{"word":"interlocutors","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"対話者、会話の相手","english_definition":"persons who take part in a dialogue or conversation, often formally or officially.","examples":[{"sentence":"The diplomats acted as interlocutors between the warring nations.","translation":"外交官たちは交戦国間の対話者として行動した。"},{"sentence":"The interviewer and interviewee are interlocutors in the discussion.","translation":"インタビューする人とインタビューを受ける人は、その議論における対話者である。"},{"sentence":"The mediator served as an interlocutor to facilitate communication between the parties.","translation":"調停者は当事者間のコミュニケーションを促進するための対話者として務めた。"}],"collocations":["act as interlocutors","primary interlocutor","key interlocutors","designated interlocutor","important interlocutors","official interlocutors"],"synonyms":["conversationalists","speakers","discussants","communicators","dialogists"],"antonyms":["listener","observer","audience"]}],"etymology":{"value":"Derived from the Latin word \"interlocutor,\" meaning \"one who speaks between.\" It is formed from \"inter-\" (between) and \"loqui\" (to speak).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪntərˈlɒkjʊtərz/","syllables":"in-ter-loc-u-tors"},"inflection":{"noun_plural":"interlocutors"},"usage_notes":{"explanation":"The term \"interlocutors\" is typically used in formal contexts to refer to individuals engaged in a structured or official conversation. It emphasizes the role of each participant as an active contributor to the dialogue. The word is often used in political, diplomatic, or academic settings.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The interlocutor listened attentively.","correct":"✓ The listener listened attentively.","note":"An interlocutor is someone who speaks in a conversation, not someone who listens. If the focus is on the listening aspect, use 'listener' instead."},{"incorrect":"✗ The group of interlocutors were noisy.","correct":"✓ The group of conversationalists were noisy.","note":"'Interlocutors' implies a more formal or structured conversation. If the context is informal and casual, 'conversationalists' might be a better fit."}],"priority":"★☆☆"},"related_words":{"derivatives":["interlocution (noun: formal conversation or dialogue)","interlocutory (adjective: relating to or occurring during a conversation)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency. Used more in formal or academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Interlocutors\" refers to individuals participating in a conversation, especially in a formal or official setting. It's a more sophisticated term than \"speakers\" or \"conversationalists,\" often used when discussing diplomacy, negotiations, or academic dialogues. Understanding this word is useful for comprehending complex discussions and formal communication scenarios.","priority":"★☆☆"},"example_sentences":[{"sentence":"The government appointed several interlocutors to negotiate with the rebels.","translation":"政府は反政府勢力との交渉のために数人の対話者を任命した。","type":"noun","meaning_category":"formal negotiation"},{"sentence":"The primary interlocutors in the research project were the lead scientists.","translation":"その研究プロジェクトの主な対話者は主任科学者たちだった。","type":"noun","meaning_category":"academic research"},{"sentence":"Effective communication between interlocutors is crucial for resolving conflicts.","translation":"対話者間の効果的なコミュニケーションは紛争解決に不可欠である。","type":"noun","meaning_category":"conflict resolution"},{"sentence":"The interlocutors exchanged views on a wide range of topics.","translation":"対話者たちは幅広いトピックについて意見を交換した。","type":"noun","meaning_category":"general conversation"},{"sentence":"The official interlocutors released a joint statement after the meeting.","translation":"公式の対話者たちは会合後、共同声明を発表した。","type":"noun","meaning_category":"official statement"}]}