{"word":"Neoteny","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"幼形成熟：動物が幼生の形質を保持したまま成熟すること。","english_definition":"The retention of juvenile features in the adult form of an animal.","examples":[{"sentence":"Axolotls are a classic example of neoteny, as they retain their larval gills and fins throughout their adult lives.","translation":"アホロートルは幼形成熟の典型的な例であり、成体になっても幼生の鰓と鰭を保持している。"},{"sentence":"Neoteny can be an evolutionary adaptation to specific environmental conditions.","translation":"幼形成熟は、特定の環境条件への進化的適応となりうる。"}],"collocations":["exhibit neoteny (幼形成熟を示す)","example of neoteny (幼形成熟の例)","evolutionary neoteny (進化的な幼形成熟)"],"synonyms":["paedomorphosis"],"antonyms":["peramorphosis"],"notes":"Neoteny is a type of paedomorphosis. Paedomorphosis is the retention in the adult of juvenile features of its ancestors."}],"etymology":{"value":"Derived from the Greek words 'neos' (new, young) and 'teinein' (to extend, stretch out, delay), referring to the delay or extension of the development of adult features.","priority":"★★★"},"pronunciation":{"ipa":"/niˈɒtəni/","syllables":"ne-o-te-ny"},"inflection":{"noun_plural":"neotenies"},"usage_notes":{"explanation":"Neoteny is a biological term primarily used in zoology and evolutionary biology. It describes a process where the development of somatic (bodily) features is slowed down relative to the development of reproductive organs. This results in an adult organism that retains characteristics typically seen only in juvenile stages of its ancestors. It is important to note that neoteny is a specific type of heterochrony, which refers to changes in the timing or rate of developmental events.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Neoteny is when an animal grows faster than usual.","correct":"✓ Neoteny is when an animal retains juvenile features into adulthood.","note":"Neoteny is about retaining juvenile traits, not about faster growth."},{"incorrect":"✗ All amphibians exhibit neoteny.","correct":"✓ Some amphibians, like axolotls, exhibit neoteny.","note":"Not all amphibians are neotenic; it's a specific adaptation seen in certain species."}],"priority":"★★☆"},"related_words":{"derivatives":["neotenic (adjective)"],"related_terms":["paedomorphosis","heterochrony","evolution","development"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Neoteny' is a specialized term in biology, specifically evolutionary biology and zoology. It refers to the phenomenon where an animal reaches adulthood while still retaining physical characteristics typically seen in its juvenile form. A well-known example is the axolotl, a type of salamander that keeps its larval gills and fins even as a mature adult. The term is not commonly used outside of scientific discussions. Understanding requires familiarity with evolutionary concepts and biological terminology."},"example_sentences":[{"sentence":"The axolotl's neoteny allows it to thrive in aquatic environments.","translation":"アホロートルの幼形成熟は、水生環境で繁栄することを可能にする。","type":"scientific","meaning_category":"Biology"},{"sentence":"Some scientists believe that neoteny played a role in human evolution.","translation":"一部の科学者は、幼形成熟が人類の進化において役割を果たしたと考えている。","type":"scientific","meaning_category":"Evolution"}]}