{"word":"hypoadenia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"リンパ節の機能低下、リンパ節の活動低下","english_definition":"Decreased activity or function of a lymph node or lymph nodes.","examples":[{"sentence":"The patient's hypoadenia was likely due to immunosuppression.","translation":"患者のリンパ節機能低下は、おそらく免疫抑制が原因であった。"}],"collocations":[],"synonyms":["lymph node hypofunction"],"antonyms":["lymph node hyperactivity","hyperadenia"]}],"etymology":{"value":"Derived from the Greek words 'hypo-' (meaning 'under' or 'below'), 'aden-' (referring to a gland, in this case, a lymph node), and '-ia' (a suffix indicating a condition or state).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpoʊəˈdiːniə/","syllables":"hy-po-a-de-ni-a"},"inflection":{"noun_plural":"hypoadenias"},"usage_notes":{"explanation":"Hypoadenia is a relatively rare term used in medical contexts to describe a state where lymph nodes are not functioning at their normal or expected level. This can be due to various factors, including infections, autoimmune diseases, or immunosuppressive treatments.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor suspected hyperadenia, but it was hypoadenia.","correct":"✓ The doctor suspected hyperadenia, but it turned out to be hypoadenia.","note":"Ensure the correct prefix is used. Hyper- indicates overactivity, while hypo- indicates underactivity."}],"priority":"★☆☆"},"related_words":{"derivatives":["hypoadenic (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hypoadenia' is a specialized medical term indicating reduced function of lymph nodes. It is typically encountered in medical or scientific contexts. Understanding requires knowledge of medical terminology, particularly prefixes and suffixes related to medical conditions.","priority":"★☆☆"},"example_sentences":[{"sentence":"The patient presented with signs of hypoadenia, including reduced immune response.","translation":"患者は免疫応答の低下を含むリンパ節機能低下の兆候を示した。","type":"medical","meaning_category":"lymph node dysfunction"},{"sentence":"Hypoadenia can be a side effect of certain medications.","translation":"リンパ節機能低下は、特定の薬の副作用である可能性がある。","type":"medical","meaning_category":"medical condition"}]}