{"word":"thermonasty","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"植物における温度変化によって引き起こされる非方向的な運動（例：チューリップの花弁の開閉）","english_definition":"A nastic movement in plants in response to a change in temperature.","examples":[{"sentence":"The opening and closing of tulip petals is an example of thermonasty.","translation":"チューリップの花弁の開閉は、温度傾性の一例です。"}],"collocations":["exhibit thermonasty","observe thermonasty"],"synonyms":["thermotropism (related, but involves directional growth)"],"antonyms":["photonasty","nyctinasty"],"notes":"Thermonasty differs from thermotropism in that it is a non-directional response; the direction of the temperature change does not influence the direction of the movement."}],"etymology":{"value":"From the Greek words 'thermo' (heat) and 'nasty' (fixed, pressed together).","priority":"★★★"},"pronunciation":{"ipa":"/θɜːrˈmɒnæsti/","syllables":"ther-mo-nas-ty"},"inflection":{"noun_plural":"thermonasties"},"usage_notes":{"explanation":"Thermonasty is a type of nastic movement, which is a non-directional response of a plant to a stimulus. In the case of thermonasty, the stimulus is a change in temperature. This can be observed in the opening and closing of certain flowers, such as tulips and crocuses, in response to temperature fluctuations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"Thermonasty is the same as thermotropism.","correct":"Thermonasty is a non-directional response to temperature, while thermotropism is a directional growth response.","note":"Thermonasty is a nastic movement (non-directional), while thermotropism is a tropism (directional growth)."}],"priority":"★★☆"},"related_words":{"derivatives":["thermonastic (adjective)"],"related_terms":["nastic movement","tropism","thermotropism","photonasty","nyctinasty"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Very low frequency - specialized botanical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Thermonasty' is a specialized term in plant biology referring to the non-directional movement of plant parts (like petals) in response to temperature changes. It's important to distinguish it from 'thermotropism,' which involves directional growth towards or away from a heat source. Examples include the opening and closing of tulip flowers with temperature fluctuations."},"example_sentences":[{"sentence":"The botanist studied the thermonasty of various alpine flowers.","translation":"植物学者は様々な高山植物の温度傾性を研究した。","type":"general","meaning_category":"General usage"},{"sentence":"The rate of thermonasty in crocus flowers is influenced by ambient temperature.","translation":"クロッカスの花の温度傾性の速度は、周囲温度の影響を受ける。","type":"specific","meaning_category":"Specific example"}]}