{"word":"cisatlantic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"（ヨーロッパから見て）大西洋のこちら側の、大西洋の西側の、アメリカの","english_definition":"On this side of the Atlantic Ocean (from the perspective of Europe); west of the Atlantic Ocean; American.","examples":[{"sentence":"The cisatlantic perspective on European affairs is often different from the European one.","translation":"ヨーロッパの出来事に対する大西洋西側の視点は、ヨーロッパの視点とはしばしば異なる。"},{"sentence":"Cisatlantic literature often explores themes of identity and the American Dream.","translation":"大西洋西側の文学は、アイデンティティやアメリカンドリームというテーマを探求することが多い。"}],"collocations":["cisatlantic perspective","cisatlantic literature","cisatlantic culture"],"synonyms":["American","Western"],"antonyms":["transatlantic"]},{"part_of_speech":"adjective","definition":"（化学で）シス型の、同じ側に位置する","english_definition":"(chemistry) Having certain atoms or groups on the same side of a double bond or ring.","examples":[{"sentence":"The cisatlantic isomer of the molecule is more reactive than the trans isomer.","translation":"その分子のシス型異性体は、トランス異性体よりも反応性が高い。"}],"collocations":["cisatlantic isomer"],"synonyms":["cis"],"antonyms":["trans"]}],"etymology":{"value":"「cis-」（こちら側）+ 「Atlantic」（大西洋）から構成される。ヨーロッパから見て大西洋のこちら側、つまりアメリカ大陸を指す。化学用語としては、分子構造における置換基の位置関係を示す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɪsætˈlæntɪk/","syllables":"cis-at-lan-tic"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"「**cisatlantic**」は、地理的な意味と化学的な意味の2つを持つ単語です。\n1. **地理的な意味**では、ヨーロッパを基準として大西洋のこちら側、つまりアメリカ大陸を指します。この用法は、ヨーロッパの視点から見たアメリカについて議論する際に用いられます。\n2. **化学的な意味**では、分子構造において、特定の原子や官能基が二重結合または環の同じ側に位置することを指します。これは「シス型」とも呼ばれます。化学の分野では、異性体を区別するために重要な用語です。\n日常会話では、地理的な意味で使われることは比較的稀ですが、学術的な文脈や専門分野では頻繁に用いられます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cisatlantic countries are all located in Europe.","correct":"✓ The cisatlantic countries are located in the Americas.","note":"「cisatlantic」はヨーロッパから見て大西洋のこちら側（西側）、つまりアメリカ大陸を指します。ヨーロッパの国々を指す場合は誤りです。"},{"incorrect":"✗ Cisatlantic refers to the opposite side of the Atlantic.","correct":"✓ Cisatlantic refers to this side of the Atlantic (from a European perspective).","note":"「cisatlantic」は「こちら側」を意味し、「反対側」を意味する「transatlantic」とは対義語です。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["transatlantic","cis (chemistry)","trans (chemistry)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**cisatlantic**」は、主に学術的な文脈で使用されるやや専門的な単語です。地理的な意味では、ヨーロッパから見て大西洋のこちら側、つまりアメリカ大陸を指します。化学的な意味では、分子構造における特定の配置を指します。日常会話ではあまり使われませんが、特定の分野の議論では重要な用語となることがあります。"},"example_sentences":[{"sentence":"The study compared cisatlantic and transatlantic approaches to economic policy.","translation":"その研究は、経済政策に対する大西洋西側と大西洋横断のアプローチを比較した。","type":"adjective","meaning_category":"地理的"},{"sentence":"The cisatlantic isomer is less stable than the trans isomer.","translation":"シス型異性体は、トランス異性体よりも不安定である。","type":"adjective","meaning_category":"化学的"}]}