{"word":"larvicolous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"幼虫に寄生する、または幼虫の中で生活する","english_definition":"Living in or on larvae; parasitic on larvae.","examples":[{"sentence":"Larvicolous mites are often used in biological control.","translation":"幼虫寄生性のダニは、生物的防除によく用いられる。"},{"sentence":"The larvicolous fly deposits its eggs on the host larva.","translation":"幼虫寄生性のハエは、宿主の幼虫に卵を産み付ける。"}],"collocations":["larvicolous mite","larvicolous fly","larvicolous parasitoid"],"synonyms":["larvae-eating","larvae-dwelling","larvae-infesting"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin words 'larva' (meaning 'ghost, mask; larva') and '-colous' (meaning 'inhabiting, dwelling in').","priority":"★★☆"},"pronunciation":{"ipa":"/lɑːrˈvɪkələs/","syllables":"lar-vi-co-lous"},"inflection":{"notes":"Does not inflect; it's an adjective."},"usage_notes":{"explanation":"The term 'larvicolous' is primarily used in biological and entomological contexts to describe organisms, especially insects and mites, that have a parasitic or commensal relationship with the larval stage of other insects. These organisms either live within or on the larvae, often feeding on them or using them as a host for reproduction.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The larvicolous is a type of insect.","correct":"✓ A larvicolous insect is a type of insect.","note":"'Larvicolous' is an adjective, so it needs to modify a noun (e.g., 'larvicolous insect')."},{"incorrect":"✗ The insect is larvicolous to the adult.","correct":"✓ The insect is larvicolous on the larva.","note":"'Larvicolous' describes the relationship to the larval stage, not the adult stage."}],"priority":"★☆☆"},"related_words":{"derivatives":["larva (noun)","-colous (suffix)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Larvicolous' is a specialized term used in biology, particularly entomology, to describe organisms that live in or on insect larvae. Understanding this term requires knowledge of basic biological concepts such as parasitism and life cycles of insects. It is not commonly used outside of scientific contexts."},"example_sentences":[{"sentence":"The study focused on identifying larvicolous parasitoids of mosquito larvae.","translation":"その研究は、蚊の幼虫に寄生する幼虫寄生生物の特定に焦点を当てていた。","type":"general","meaning_category":"幼虫に寄生する"},{"sentence":"Certain species of wasps are larvicolous, laying their eggs inside the host larva.","translation":"ある種のハチは幼虫寄生性で、宿主の幼虫の中に卵を産み付ける。","type":"general","meaning_category":"幼虫の中で生活する"}]}