{"word":"pleurisy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"胸膜炎","english_definition":"inflammation of the pleura (the membranes that surround the lungs and line the chest cavity) causing pain, typically sharp pain, especially during breathing.","examples":[{"sentence":"Pleurisy can be a complication of pneumonia.","translation":"胸膜炎は肺炎の合併症となることがある。"},{"sentence":"He was diagnosed with pleurisy and had to stay in the hospital.","translation":"彼は胸膜炎と診断され、入院しなければならなかった。"},{"sentence":"The pain associated with pleurisy can be severe.","translation":"胸膜炎に伴う痛みは激しいことがある。"}],"collocations":["develop pleurisy","suffer from pleurisy","treat pleurisy","pleuritic pain","viral pleurisy","bacterial pleurisy"],"synonyms":["pleuritis"],"antonyms":[]}],"etymology":{"value":"From Middle English *pleuresie*, from Old French *pleurisie*, from Latin *pleurisis*, from Ancient Greek *πλευρίτις* (pleurítis, “inflammation of the side”), from *πλευρά* (pleurá, “rib, side”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈplʊrəsi/","syllables":"plu-ri-sy"},"inflection":{"noun_plural":"pleurisies"},"usage_notes":{"explanation":"Pleurisy is a medical condition characterized by inflammation of the pleura, the membranes that line the lungs and chest cavity. This inflammation causes sharp chest pain, especially during breathing. It is often a complication of other respiratory infections, such as pneumonia or bronchitis. The term 'pleuritis' is sometimes used interchangeably with 'pleurisy', although 'pleurisy' is the more common term.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a pleurisy in his leg.","correct":"✓ He has pleurisy in his chest.","note":"Pleurisy affects the chest, specifically the membranes around the lungs, not the limbs."},{"incorrect":"✗ Pleurisy is caused by a broken bone.","correct":"✓ Pleurisy is often caused by a viral or bacterial infection.","note":"Pleurisy is typically caused by infections or other respiratory illnesses, not bone fractures."}],"priority":"★★☆"},"related_words":{"derivatives":["pleural","pleuritic"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pleurisy' is a medical term referring to the inflammation of the pleura, the membranes lining the lungs and chest cavity. This condition typically results in sharp chest pain, particularly during breathing. Understanding this term requires some familiarity with medical vocabulary and anatomical concepts related to the respiratory system. It's often encountered in medical contexts or discussions about respiratory illnesses.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor suspected pleurisy because of the sharp chest pain.","translation":"医師は、鋭い胸の痛みから胸膜炎を疑った。","type":"general","meaning_category":"medical condition"},{"sentence":"Breathing became difficult due to the inflammation caused by pleurisy.","translation":"胸膜炎による炎症のため、呼吸が困難になった。","type":"symptom","meaning_category":"medical condition"},{"sentence":"Antibiotics are often used to treat pleurisy caused by bacterial infections.","translation":"抗生物質は、細菌感染によって引き起こされる胸膜炎の治療によく使用される。","type":"treatment","meaning_category":"medical condition"}]}