{"word":"other-caste","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"(インドのカースト制度において) 他のカーストの、異カーストの","english_definition":"Relating to or belonging to a different caste (especially in the Indian caste system).","examples":[{"sentence":"An other-caste marriage can still face social stigma in some parts of India.","translation":"インドの一部地域では、異カースト間の結婚は依然として社会的偏見に直面することがあります。"},{"sentence":"The organization works to promote understanding between other-caste communities.","translation":"その組織は、異カーストのコミュニティ間の理解を促進するために活動しています。"}],"collocations":["other-caste marriage","other-caste community","other-caste relations"],"synonyms":["inter-caste","cross-caste"],"antonyms":["same-caste"],"notes":"This term is specific to societies with caste systems, most notably India."}],"etymology":{"value":"Formed by combining \"other\" and \"caste\".","priority":"Medium"},"pronunciation":{"ipa":"/ˈʌðər kæst/","syllables":"oth-er-caste"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"The term 'other-caste' is used to describe something (usually a person, marriage, or relationship) that involves individuals from different castes. It is most commonly used in the context of the Indian caste system.","priority":"Medium"},"related_words":{"related":["caste","caste system","intercaste","dalit","brahmin","untouchable"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'other-caste' is specific to the context of caste systems, primarily in India, and may not be widely understood by those unfamiliar with this social structure. It is typically encountered in discussions of sociology, anthropology, or South Asian studies."},"example_sentences":[{"sentence":"The family disapproved of her marrying an other-caste man.","translation":"家族は彼女が異カーストの男性と結婚することに反対しました。","type":"example","meaning_category":"marriage"},{"sentence":"Discrimination based on caste, including against other-caste individuals, is illegal in India.","translation":"カーストに基づく差別は、異カーストの人々に対するものも含め、インドでは違法です。","type":"example","meaning_category":"discrimination"}]}