{"word":"Tuamotu","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ツアモツ諸島 (南太平洋に位置するフランス領ポリネシアの島嶼群)","english_definition":"An archipelago of almost 80 islands and atolls forming a part of French Polynesia in the southern Pacific Ocean.","examples":[{"sentence":"The Tuamotu Islands are known for their pearl farms.","translation":"ツアモツ諸島は真珠養殖で知られています。"},{"sentence":"Many of the Tuamotu atolls are uninhabited.","translation":"ツアモツ諸島の環礁の多くは無人島です。"}],"collocations":["Tuamotu Archipelago","Tuamotu atoll","pearls of Tuamotu"],"synonyms":["Îles Tuamotu","Tuamotu Islands"],"antonyms":[]}],"etymology":{"value":"The name \"Tuamotu\" comes from the Tuamotuan language, meaning \"distant islands\" or \"islands far away\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtuː.əˈmoʊ.tuː/","syllables":"Tu-a-mo-tu"},"inflection":{"notes":"Proper noun, no plural form"},"usage_notes":{"explanation":"\"Tuamotu\" refers specifically to the island group in French Polynesia. It is often used in geographical contexts or when discussing the culture, history, or environment of the islands.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I am going to Tuamotus for vacation.","correct":"✓ I am going to the Tuamotu Islands for vacation.","note":"While 'Tuamotu' is acceptable, it's more common and clearer to use 'Tuamotu Islands' or 'the Tuamotus' when referring to the archipelago."}],"priority":"★★☆"},"related_words":{"derivatives":["Tuamotuan (adjective/noun): relating to the Tuamotu Islands or their people/language"],"phrases":["French Polynesia","atoll","coral reef"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2-C1 (specialized vocabulary)","frequency_google_ngram":"Low frequency (geographical term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Tuamotu\" is a geographical term referring to a specific group of islands in French Polynesia. Its use is generally limited to discussions about geography, oceanography, anthropology, or travel related to that region. Understanding the term requires some familiarity with Pacific island geography.","note":"Due to its specialized nature, \"Tuamotu\" is not typically encountered in everyday English conversation or general reading materials."},"example_sentences":[{"sentence":"The remote location of the Tuamotu Islands makes them a haven for unique marine life.","translation":"ツアモツ諸島の遠隔地という場所柄が、独特な海洋生物にとっての安息地となっています。","type":"general","meaning_category":"geography"},{"sentence":"The economy of the Tuamotu Archipelago relies heavily on black pearl cultivation.","translation":"ツアモツ諸島の経済は、主に黒真珠の養殖に依存しています。","type":"economic","meaning_category":"economy"},{"sentence":"Climate change poses a significant threat to the low-lying atolls of the Tuamotu Islands.","translation":"気候変動は、ツアモツ諸島の低地の環礁に重大な脅威をもたらしています。","type":"environmental","meaning_category":"environment"}]}