{"word":"Responsa","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(ユダヤ法における)質問に対する権威ある律法学者の回答集、または個々の回答","english_definition":"A collection of written decisions and rulings in Jewish law, given by legal authorities in response to questions; also, an individual response.","examples":[{"sentence":"The Responsa literature provides valuable insights into Jewish life throughout history.","translation":"レスポンサ文献は、歴史を通じてユダヤ人の生活に関する貴重な洞察を提供する。"},{"sentence":"He consulted the Responsa to determine the correct course of action.","translation":"彼は正しい行動方針を決定するためにレスポンサを参照した。"}],"collocations":["Responsa literature","consult Responsa","legal Responsa","rabbinic Responsa"],"synonyms":["Halakhic rulings","legal opinions","rabbinic decisions"],"antonyms":[]}],"etymology":{"value":"ヘブライ語の「シェエロット・ウ＝テシュヴォット」(שְׁאֵלוֹת וּתְשׁוּבוֹת)に由来し、「質問と回答」を意味する。ラテン語化された複数形が Responsa。","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈspɒnsə/","syllables":"Re-spon-sa"},"inflection":{"noun_plural":"Responsa (複数形は単数形と同じ)"},"usage_notes":{"explanation":"「**Responsa**」は、ユダヤ法（ハラーハー）に関する特定の質問に対して、権威あるラビや律法学者が書面で回答したものを指します。これらの回答は、個々の事例に基づいており、ユダヤ人の日常生活、儀式、倫理、法律など、幅広い問題を取り扱っています。レスポンサは、ユダヤ法の解釈と適用に関する重要な情報源であり、歴史的な文脈を理解する上でも貴重な資料です。レスポンサ文献は、何世紀にもわたって蓄積されており、今日でもユダヤ法の研究や実践において重要な役割を果たしています。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I read a responsa on the internet.","correct":"✓ I read a responsum on the internet.","note":"単一の回答を指す場合は、単数形の「responsum」を使用します。"},{"incorrect":"✗ Responsa are not important in modern Jewish law.","correct":"✓ Responsa are still important in modern Jewish law.","note":"レスポンサは現代のユダヤ法においても依然として重要な役割を果たしています。"}],"priority":"★★☆"},"related_words":{"derivatives":["responsum (単数形)","Halakha (ユダヤ法)","Rabbi (ラビ、ユダヤ教の教師)","Posek (律法学者)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門的な語彙)","frequency_google_ngram":"低頻度 (Low frequency) - ユダヤ教や法学の専門分野で使われる語彙。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Responsa**」は、ユダヤ法における重要な概念であり、特定の質問に対する権威ある律法学者の書面による回答を指します。この言葉は、ユダヤ教の法的な議論や歴史的な文脈において現れます。レスポンサは、ユダヤ法の解釈や適用に関する貴重な情報源であり、法学や歴史学の研究者にとって重要な資料です。一般的には専門的な文脈で使用されるため、日常会話にはあまり登場しません。"},"example_sentences":[{"sentence":"The rabbi's Responsa provided guidance on complex ethical dilemmas.","translation":"ラビのレスポンサは、複雑な倫理的ジレンマに関する指針を提供した。","type":"noun","meaning_category":"回答集"},{"sentence":"Scholars analyze Responsa to understand the evolution of Jewish legal thought.","translation":"学者たちは、ユダヤ法の思想の進化を理解するためにレスポンサを分析する。","type":"noun","meaning_category":"回答集"},{"sentence":"The Responsa literature covers a wide range of topics, from ritual observance to business ethics.","translation":"レスポンサ文献は、儀式の遵守からビジネス倫理まで、幅広いトピックを網羅している。","type":"noun","meaning_category":"回答集"}]}