{"word":"Jacobinize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"ジャコバン主義化する、ジャコバン党の主義・原則を広める、または受け入れさせる","english_definition":"To imbue with or convert to Jacobin principles; to subject to Jacobin influence or control.","examples":[{"sentence":"The French Revolution aimed to Jacobinize the rest of Europe.","translation":"フランス革命はヨーロッパの残りの部分をジャコバン主義化することを目指した。"},{"sentence":"The government attempted to Jacobinize the local populace through propaganda.","translation":"政府はプロパガンダを通じて地元の住民をジャコバン主義化しようと試みた。"}],"collocations":["Jacobinize the government","Jacobinize the culture","Jacobinize the masses"],"synonyms":["radicalize","revolutionize","politicize","indoctrinate"],"antonyms":["depoliticize","moderate","conservative"]},{"part_of_speech":"verb","transitivity":"vi","definition":"ジャコバン主義に染まる、ジャコバン党の主義・原則を受け入れる","english_definition":"To become Jacobin in character or principles.","examples":[{"sentence":"The student movement began to Jacobinize as it grew more radical.","translation":"学生運動はより過激になるにつれてジャコバン主義に染まり始めた。"}],"collocations":["Jacobinize over time","Jacobinize due to influence"],"synonyms":["become radicalized","become revolutionary"],"antonyms":["become moderate","become conservative"]}],"etymology":{"value":"Derived from \"Jacobin,\" referring to the members of the Jacobin Club, a radical political group during the French Revolution, plus the suffix \"-ize,\" indicating the process of becoming or causing to become.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdʒækəbɪnaɪz/","syllables":"Ja-co-bin-ize"},"inflection":{"verb_forms":{"present_simple":["Jacobinize","Jacobinizes"],"past_simple":"Jacobinized","past_participle":"Jacobinized","present_participle":"Jacobinizing"}},"usage_notes":{"explanation":"\"Jacobinize\" refers to the process of adopting or imposing the radical, egalitarian, and often revolutionary principles associated with the Jacobins of the French Revolution. It implies a significant shift towards a more radical political ideology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The country was Jacobinized by the peaceful protest.","correct":"✓ The country was Jacobinized by the violent revolution.","note":"Jacobinization often implies a forceful or radical change, so it's more fitting to associate it with events like revolutions rather than peaceful protests."}],"priority":"★★☆"},"related_words":{"derivatives":["Jacobin (noun, adjective)","Jacobinism (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"Jacobinize\" is a relatively rare and specialized term primarily used in historical or political contexts to describe the process of adopting or imposing radical, egalitarian, and often revolutionary principles associated with the Jacobins of the French Revolution. It implies a significant shift towards a more radical political ideology and is typically encountered in advanced academic or historical texts."},"example_sentences":[{"sentence":"Historians debate the extent to which Robespierre managed to Jacobinize French society.","translation":"歴史家たちは、ロベスピエールがフランス社会をどれだけジャコバン主義化できたかについて議論している。","type":"verb (vt)","meaning_category":"ジャコバン主義化する"},{"sentence":"The political climate began to Jacobinize after the king's execution.","translation":"国王処刑後、政治情勢はジャコバン主義に染まり始めた。","type":"verb (vi)","meaning_category":"ジャコバン主義に染まる"}]}