{"word":"Teiids","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A family of lizards, commonly known as tegu lizards, whiptails, and racerunners.","english_definition":"A family of lizards (family Teiidae) native to the Americas, characterized by their active foraging behavior and diverse habitats.","examples":[{"sentence":"Teiids are found throughout the Americas, from Canada to Argentina.","translation":"テユー科のトカゲは、カナダからアルゼンチンまでのアメリカ大陸全域で見られます。"},{"sentence":"Many teiids are fast-moving and diurnal, actively hunting for insects and other small prey.","translation":"多くのテユー科のトカゲは動きが速く昼行性で、昆虫や他の小さな獲物を積極的に狩ります。"}],"collocations":["tegu lizard","whiptail lizard","racerunner lizard","teiid habitat","teiid diet","teiid behavior"],"synonyms":["Tegu","Whiptail","Racerunner"],"antonyms":[]}],"etymology":{"value":"Derived from the family name Teiidae, which is based on the genus name Teius.","priority":"N/A"},"pronunciation":{"ipa":"/ˈtiːɪdz/","syllables":"Tei-ids"},"inflection":{"noun_plural":"Teiids"},"usage_notes":{"explanation":"'Teiids' refers to the family Teiidae, encompassing various genera of lizards. It is generally used in scientific or zoological contexts. When referring to a single lizard from this family, one might say 'a teiid lizard'.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["Teiidae (family name)","Teius (genus name)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The term 'Teiids' is a scientific term used in zoology and herpetology to refer to a specific family of lizards. It is unlikely to be encountered in general conversation and is primarily used in academic or technical contexts. Understanding of this term requires familiarity with biological classification systems."},"example_sentences":[{"sentence":"The study focused on the foraging behavior of several teiids in the Amazon rainforest.","translation":"その研究は、アマゾンの熱帯雨林に生息するいくつかのテユー科のトカゲの採餌行動に焦点を当てました。","type":"scientific","meaning_category":"zoology"},{"sentence":"Teiids exhibit a wide range of adaptations to different environments, from arid deserts to tropical rainforests.","translation":"テユー科のトカゲは、乾燥した砂漠から熱帯雨林まで、さまざまな環境への幅広い適応を示します。","type":"scientific","meaning_category":"zoology"}]}