{"word":"Indri","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"インドリ (インドリ属のキツネザル)","english_definition":"A large lemur (Indri indri) found in Madagascar. It is the largest living lemur and is known for its distinctive vocalizations.","examples":[{"sentence":"The Indri is critically endangered due to habitat loss.","translation":"インドリは生息地の喪失により、絶滅危惧種に指定されています。"},{"sentence":"We heard the Indri calling in the rainforest.","translation":"熱帯雨林でインドリの鳴き声を聞きました。"}],"collocations":["Indri call","Indri habitat","Indri population","endangered Indri"],"synonyms":["babakoto (Malagasy name)"],"antonyms":[]}],"etymology":{"value":"The name \"Indri\" is said to have originated from a Malagasy local pointing to the animal and saying \"Indri!\" which supposedly meant \"There!\" or \"Look there!\" to the naturalist Pierre Sonnerat. Sonnerat mistakenly took this to be the animal's name.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɪndri/","syllables":"In-dri"},"inflection":{"notes":"単数形: Indri, 複数形: Indris"},"usage_notes":{"explanation":"The Indri is a unique and iconic lemur species endemic to Madagascar. It is notable for being the largest living lemur and for its loud, wailing calls, which can be heard over long distances. The Indri is a folivore, primarily eating leaves, and plays an important role in seed dispersal within its forest habitat. Due to habitat destruction and hunting, the Indri is classified as critically endangered. Conservation efforts are crucial for the survival of this remarkable primate.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Indris live in Africa.","correct":"✓ Indris live in Madagascar.","note":"Indris are only found in Madagascar."},{"incorrect":"✗ The Indri is a monkey.","correct":"✓ The Indri is a lemur.","note":"Indris are lemurs, a type of primate distinct from monkeys."}],"priority":"★★☆"},"related_words":{"derivatives":["Indridae (family to which the Indri belongs)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"Indri\" refers to a specific species of lemur, Indri indri, which is native to Madagascar. It's a relatively rare term, typically encountered in the context of zoology, conservation, or travel writing related to Madagascar. Understanding the term requires knowledge of primate taxonomy and the unique biodiversity of Madagascar. Due to its specialized nature, it's not a word commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The **Indri's** haunting call echoed through the forest.","translation":"インドリの物悲しい鳴き声が森に響き渡った。","type":"noun","meaning_category":"animal"},{"sentence":"Conservationists are working to protect the **Indri's** remaining habitat.","translation":"保護活動家たちはインドリの残された生息地を守るために活動している。","type":"noun","meaning_category":"conservation"},{"sentence":"The **Indri** is easily recognizable by its black and white fur.","translation":"インドリは黒と白の毛皮で簡単に見分けられる。","type":"noun","meaning_category":"description"}]}