{"word":"hominy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ホミニ (トウモロコシをアルカリ液で処理した食品)","english_definition":"dried maize kernels treated with an alkali, used as food.","examples":[{"sentence":"Hominy is a staple food in many Latin American countries.","translation":"ホミニは多くの中南米諸国で主食となっています。"},{"sentence":"He added hominy to the stew for extra flavor and texture.","translation":"彼は風味と食感を加えるために、シチューにホミニを加えました。"}],"collocations":["canned hominy","ground hominy","hominy grits","hominy stew"],"synonyms":["maize","corn","samp"],"antonyms":[]}],"etymology":{"value":"スペイン語の「hominy」は、アメリカ先住民の言語から派生しました。おそらく、バージニア・アルゴンキン語族の言葉で、準備されたトウモロコシを意味する言葉に由来すると考えられています。","priority":"★★☆"},"pronunciation":{"ipa":"ˈhɑːmɪni","syllables":"hom-i-ny"},"inflection":{"noun_plural":"hominies"},"usage_notes":{"explanation":"Hominy is a food produced from dried maize (corn) kernels which have been treated with an alkali, in a process called nixtamalization. The process removes the pericarp (hull) and germ of the corn, and makes the nutrients in the corn more bioavailable. It is a staple food in many Latin American and Native American cultures. It can be eaten whole, ground into masa (dough), or dried and ground into hominy grits.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate a hominy.","correct":"✓ I ate some hominy.","note":"Hominy is usually treated as an uncountable noun, so use 'some' instead of 'a'."}],"priority":"★☆☆"},"related_words":{"derivatives":["nixtamalization","masa","grits"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Hominy is a specific food made from corn that has been treated with an alkali solution. It's a term you're more likely to encounter in discussions about Latin American or Native American cuisine. Understanding the word implies familiarity with different food preparation techniques and regional culinary traditions."},"example_sentences":[{"sentence":"The chef prepared a traditional posole using dried **hominy**.","translation":"シェフは乾燥ホミニを使って伝統的なポソレを調理しました。","type":"noun","meaning_category":"食品"},{"sentence":"**Hominy** grits are a popular breakfast dish in the Southern United States.","translation":"ホミニグリッツは、アメリカ南部で人気の朝食料理です。","type":"noun","meaning_category":"食品"}]}