{"word":"wide-watered","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(場所が)水が広く分布している、水域が広い","english_definition":"Having a broad expanse of water; characterized by extensive bodies of water.","examples":[{"sentence":"The wide-watered plains stretched out before them.","translation":"彼らの目の前には、水が広く分布する平原が広がっていた。"},{"sentence":"The wide-watered delta is home to many species of birds.","translation":"その水域の広い三角州は、多くの種類の鳥の生息地となっている。"}],"collocations":["wide-watered plains","wide-watered delta","wide-watered landscape"],"synonyms":["watery","aquatic","wetland","marshy","swampy"],"antonyms":["arid","dry","waterless"]}],"etymology":{"value":"The word is a compound adjective formed by combining \"wide\" and \"watered\". \"Wide\" refers to breadth or extent, while \"watered\" indicates the presence or abundance of water. The combination describes a place or area characterized by a broad expanse of water.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌwaɪd ˈwɔːtərd/","syllables":"wide-wa-tered"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are not commonly used with this word.","comparative":"more wide-watered","superlative":"most wide-watered"},"usage_notes":{"explanation":"\"Wide-watered\" is a descriptive adjective often used in literary or geographical contexts to evoke a sense of expansive water bodies, such as plains, deltas, or landscapes. It emphasizes the breadth and extent of the water rather than its depth or other qualities. It is not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The wide-watered is beautiful.","correct":"✓ The wide-watered area is beautiful.","note":"\"Wide-watered\" is an adjective and needs to modify a noun. It cannot stand alone as a noun."},{"incorrect":"✗ The wide watered plain.","correct":"✓ The wide-watered plain.","note":"The correct form is a hyphenated compound adjective."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["waterlogged","waterfront","waterscape","water table","watercourse"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not typically found in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency - Not a commonly used term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"wide-watered\" is a relatively uncommon and descriptive adjective. It is used to describe landscapes or areas that have a broad or extensive presence of water. Because it is not a frequently used term, it is more likely to be encountered in descriptive writing or specialized contexts such as geography or environmental science. Understanding the meaning requires a good grasp of vocabulary and the ability to interpret compound adjectives. "},"example_sentences":[{"sentence":"The explorers navigated the wide-watered river, mapping its many channels and tributaries.","translation":"探検家たちは水域の広い川を航行し、その多くの水路と支流を地図に記録した。","type":"descriptive","meaning_category":"water expanse"},{"sentence":"The wide-watered marsh provided a sanctuary for migratory birds.","translation":"その水域の広い湿地は、渡り鳥の聖域となっていた。","type":"descriptive","meaning_category":"water expanse"}]}