{"word":"price-linked","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"価格連動の、価格に連動した","english_definition":"Having a value or payment that changes in relation to the price of something else, often an index or commodity.","examples":[{"sentence":"The bond is price-linked to the consumer price index, offering protection against inflation.","translation":"その債券は消費者物価指数に価格連動しており、インフレに対する保護を提供する。"},{"sentence":"The workers are demanding a price-linked wage increase to cope with the rising cost of living.","translation":"労働者たちは、生活費の上昇に対応するために、価格連動型の賃上げを要求している。"}],"collocations":["price-linked wage (価格連動賃金)","price-linked bond (価格連動債)","price-linked contract (価格連動契約)","price-linked annuity (価格連動年金)"],"synonyms":["indexed","inflation-linked","cost-of-living adjustment (COLA)"],"antonyms":["fixed-price","flat-rate","non-indexed"]}],"etymology":{"value":"Derived from the combination of 'price' and 'linked', indicating a direct relationship or connection to a price or price index.","priority":"N/A"},"pronunciation":{"ipa":"/ˈpraɪsˌlɪŋkt/","syllables":"price-linked (1 syllable, with stress on 'price')"},"inflection":{"notes":"This is an adjective and does not have inflections for number or gender."},"usage_notes":{"explanation":"'Price-linked' is commonly used in financial and economic contexts to describe instruments, contracts, or agreements where the value or payment is adjusted based on changes in a specific price index or commodity price. This mechanism is often employed to mitigate the effects of inflation or market volatility.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The price-linked is good.","correct":"✓ The price-linked bond is good.","note":"'Price-linked' is an adjective and needs to be used with a noun. It cannot stand alone as a subject or object."}],"priority":"N/A"},"related_words":{"derivatives":["price linking (価格連動)"],"phrasal_verbs":[],"related_terms":["inflation-linked bond","consumer price index (CPI)","cost of living adjustment (COLA)","indexation"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in specialized financial and economic discussions.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'price-linked' refers to something whose value changes based on the price of another thing, often an index like the Consumer Price Index (CPI). It's used in finance and economics to describe things like bonds or wages that adjust with inflation. Because it's a specialized term, it's more common in advanced discussions about finance and economics."},"example_sentences":[{"sentence":"The government issued a new series of price-linked bonds to protect investors from inflation.","translation":"政府は、投資家をインフレから守るために、新しいシリーズの価格連動債を発行した。","type":"adjective","meaning_category":"価格連動の"},{"sentence":"The labor union negotiated a price-linked wage agreement to ensure workers' purchasing power keeps pace with rising prices.","translation":"労働組合は、労働者の購買力が物価上昇に遅れないように、価格連動型の賃金協定を交渉した。","type":"adjective","meaning_category":"価格連動の"}]}