{"word":"Intransparency","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"不透明性、透明でないこと、理解しにくいこと","english_definition":"The state or quality of not being transparent; lack of clarity or transparency; obscurity.","examples":[{"sentence":"The intransparency of the government's financial dealings raised concerns.","translation":"政府の金融取引の不透明性が懸念を引き起こした。"},{"sentence":"The intransparency of the new regulations made them difficult to understand.","translation":"新しい規制の不透明性により、理解が困難になった。"},{"sentence":"He criticized the intransparency of the decision-making process.","translation":"彼は意思決定プロセスの不透明性を批判した。"}],"collocations":["lack of transparency","financial intransparency","regulatory intransparency","organizational intransparency"],"synonyms":["opaqueness","obscurity","murkiness","vagueness","ambiguity","complexity"],"antonyms":["transparency","clarity","lucidity","simplicity","openness"]}],"etymology":{"value":"Derived from \"intransparent\" (not transparent), which is formed from the prefix \"in-\" (not) + \"transparent.\"","priority":"★★☆"},"pronunciation":{"ipa":"ˌɪntrænˈspærənsi","syllables":"in-trans-par-en-cy"},"inflection":{"noun_plural":"Intransparencies"},"usage_notes":{"explanation":"\"Intransparency\" refers to the quality of being opaque or lacking transparency, making something difficult to see through or understand. It is often used in contexts involving government, finance, or regulations to describe a lack of openness and clarity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The intransparency made it easy to see through the problem.","correct":"✓ The intransparency made it difficult to see through the problem.","note":"Intransparency implies a lack of clarity, so it would make something *difficult*, not easy, to understand."}],"priority":"★☆☆"},"related_words":{"derivatives":["intransparent (adjective)","transparent (adjective)","transparency (noun)"],"antonyms":["transparency"],"related_concepts":["opacity","obfuscation","secrecy"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"intransparency\" is a formal term indicating a lack of transparency or clarity. It suggests that something is difficult to understand or see through, often due to deliberate obscurity or complexity. This term is commonly used in discussions about government, finance, or organizational structures where openness is expected but lacking."},"example_sentences":[{"sentence":"The **intransparency** of the company's accounting practices raised suspicions of fraud.","translation":"その会社の会計慣行の不透明性は、不正の疑念を引き起こした。","type":"general"},{"sentence":"Increased **intransparency** in the supply chain can lead to ethical concerns.","translation":"サプライチェーンにおける不透明性の増加は、倫理的な懸念につながる可能性がある。","type":"business"},{"sentence":"The **intransparency** of the algorithm made it difficult to understand how decisions were being made.","translation":"アルゴリズムの不透明性により、どのように意思決定が行われているかを理解することが困難になった。","type":"technology"}]}