{"word":"cross-staffs","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(航海) 十字儀","english_definition":"An instrument formerly used for taking the altitude of the sun or stars, consisting of a staff with one or more transverse pieces sliding on it.","examples":[{"sentence":"The navigator used cross-staffs to determine the ship's latitude.","translation":"航海士は十字儀を使って船の緯度を測定した。"}],"collocations":["navigate with cross-staffs","determine latitude with cross-staffs"],"synonyms":["Jacob's staff","radius astronomicus"],"antonyms":[]}],"etymology":{"value":"From the combination of 'cross' and 'staff', referring to the cross-shaped structure of the instrument.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkrɒsˌstæfs/","syllables":"cross-staffs"},"inflection":{"noun_plural":"cross-staffs"},"usage_notes":{"explanation":"Cross-staffs are historical navigational instruments used to measure angles, primarily the altitude of celestial bodies. They were used extensively before the invention of the sextant.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a cross-staff to measure the temperature.","correct":"✓ He used a cross-staff to measure the altitude of the sun.","note":"Cross-staffs are used for measuring angles, especially altitudes, not temperature."}],"priority":"★★☆"},"related_words":{"derivatives":["cross-staff (singular form)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'cross-staffs' refers to an obsolete navigational instrument. Understanding its use requires knowledge of historical navigation practices. This term is rarely encountered outside of historical contexts or specialized literature.","priority":"★★☆"},"example_sentences":[{"sentence":"The museum displayed a collection of historical navigational tools, including cross-staffs.","translation":"博物館には、十字儀を含む歴史的な航海用具のコレクションが展示されていました。","type":"noun","meaning_category":"航海用具"},{"sentence":"Early explorers relied on cross-staffs for celestial navigation.","translation":"初期の探検家は、天体航法のために十字儀に頼っていました。","type":"noun","meaning_category":"航海用具"}]}