{"word":"self-luminescence","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"自己発光","english_definition":"The emission of light by a substance as a result of its own internal processes, such as radioactive decay or chemical reactions.","examples":[{"sentence":"The self-luminescence of radium was a key discovery in early nuclear physics.","translation":"ラジウムの自己発光は、初期の原子核物理学における重要な発見でした。"},{"sentence":"Some deep-sea organisms exhibit self-luminescence to attract prey.","translation":"深海生物の中には、獲物を引き寄せるために自己発光を示すものがいます。"},{"sentence":"The phenomenon of self-luminescence is utilized in some types of emergency lighting.","translation":"自己発光の現象は、一部の種類の非常用照明に利用されています。"}],"collocations":["exhibit self-luminescence (自己発光を示す)","measure self-luminescence (自己発光を測定する)","study self-luminescence (自己発光を研究する)","mechanism of self-luminescence (自己発光のメカニズム)","source of self-luminescence (自己発光の源)"],"synonyms":["radioluminescence","chemiluminescence","autoluminescence"],"antonyms":["phosphorescence","fluorescence","external illumination"]}],"etymology":{"value":"The term is formed by combining 'self-' (referring to the internal origin of the light), 'luminescence' (the emission of light), and connecting with a hyphen.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌselfˌluːmɪˈnesəns/","syllables":"self-lu-mi-nes-cence"},"inflection":{"noun_plural":"self-luminescences"},"usage_notes":{"explanation":"'Self-luminescence' refers to the emission of light from a substance due to processes occurring within the substance itself, without external excitation. This is distinct from phosphorescence or fluorescence, which require external sources of energy (e.g., light) to trigger light emission. Self-luminescence can arise from various mechanisms, including radioactive decay (radioluminescence) and chemical reactions (chemiluminescence).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rock showed luminescence, so it must be self-luminescence.","correct":"✓ The rock showed luminescence, but further investigation is needed to determine if it is self-luminescence or another type of luminescence.","note":"Not all luminescence is self-luminescence. Further investigation is needed to determine the source of the light emission. External excitation needs to be ruled out. "},{"incorrect":"✗ Self-luminescence is the same as fluorescence.","correct":"✓ Self-luminescence is different from fluorescence because it doesn't require external excitation.","note":"Self-luminescence is caused by internal processes, while fluorescence requires external excitation (e.g., UV light)."}],"priority":"★★☆"},"related_words":{"derivatives":["luminescence","luminescent","radioluminescence","chemiluminescence"],"related_terms":["bioluminescence (生物発光)","phosphorescence (燐光)","fluorescence (蛍光)","thermoluminescence (熱ルミネセンス)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Self-luminescence' is a scientific term referring to the emission of light by a substance due to internal processes, such as radioactive decay or chemical reactions. It is a relatively uncommon term used in specific scientific contexts, such as physics, chemistry, and biology. Understanding the term requires a grasp of scientific concepts related to light emission and energy sources. It is important to distinguish self-luminescence from other forms of luminescence, such as fluorescence and phosphorescence, which involve external excitation.","priority":"★★☆"},"example_sentences":[{"sentence":"The tritium exit signs use the principle of self-luminescence to glow in the dark.","translation":"トリチウム製の非常口標識は、自己発光の原理を利用して暗闇で光ります。","type":"general","meaning_category":"general"},{"sentence":"Scientists are studying the self-luminescence of certain minerals to understand their composition and history.","translation":"科学者たちは、特定の鉱物の自己発光を研究して、その組成と歴史を理解しようとしています。","type":"scientific","meaning_category":"scientific"},{"sentence":"The intensity of self-luminescence can be used to measure the concentration of radioactive isotopes.","translation":"自己発光の強度は、放射性同位体の濃度を測定するために使用できます。","type":"technical","meaning_category":"technical"}]}