{"word":"preillumination","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に教育分野で) 新しい情報や概念を学ぶ前に、学習者がすでに持っている知識や経験を活性化させること。学習者が新しい情報をより効果的に理解し、既存の知識と関連付けるのを助ける。","english_definition":"(primarily in education) The activation of a learner's existing knowledge and experiences before introducing new information or concepts. It helps learners understand new information more effectively and connect it to their existing knowledge.","examples":[{"sentence":"The teacher used a brainstorming session as a preillumination activity before starting the lesson on climate change.","translation":"先生は気候変動に関する授業を始める前に、予備知識を活性化させる活動としてブレインストーミングセッションを行った。"},{"sentence":"Preillumination techniques can improve student engagement and comprehension.","translation":"予備知識を活性化させるテクニックは、生徒の関与と理解度を向上させることができる。"},{"sentence":"Effective preillumination involves asking questions that encourage students to think about what they already know about the topic.","translation":"効果的な予備知識の活性化には、生徒がそのトピックについてすでに知っていることを考えるように促す質問をすることが含まれる。"}],"collocations":["preillumination activity (予備知識活性化活動)","preillumination technique (予備知識活性化テクニック)","activate preillumination (予備知識を活性化させる)","prior knowledge preillumination (事前知識の活性化)"],"synonyms":["prior knowledge activation","knowledge priming","schema activation","anticipatory set","advance organizer"],"antonyms":["post-learning review","knowledge consolidation"]},{"part_of_speech":"noun","definition":"(稀) 何かを照らす前の準備段階、または初期の光。","english_definition":"(rare) A preparatory stage before something is illuminated, or an initial light.","examples":[{"sentence":"The preillumination of the stage allowed the technicians to make final adjustments before the performance began.","translation":"舞台の予備照明により、技術者は公演が始まる前に最終調整を行うことができた。"}],"collocations":[],"synonyms":["preliminary lighting","initial glow"],"antonyms":["full illumination"]}],"etymology":{"value":"「pre-」（前に）+ 「illumination」（照明、啓発）から構成される。教育分野での意味は、文字通りに「照らす前に」学習者の知識を活性化させるという概念に基づいている。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːɪˈluːmɪneɪʃən/","syllables":"pre-il-lu-mi-na-tion"},"inflection":{"noun_plural":"preilluminations"},"usage_notes":{"explanation":"「**preillumination**」は、主に教育学の分野で使用される専門用語です。新しい教材を導入する前に、生徒の既存の知識や経験を呼び起こし、関連付けるプロセスを指します。これにより、生徒は新しい情報をより効果的に理解し、記憶することができます。一般的な方法としては、ブレインストーミング、質問、簡単なクイズなどがあります。まれに、文字通りの「照明の前の準備段階」という意味で使用されることもあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The preillumination was too bright, so we had to dim the lights.","correct":"✓ The preliminary lighting was too bright, so we had to dim the lights.","note":"この文脈では、教育的な意味ではなく、文字通りの「照明」の意味で使用されているため、「preliminary lighting」の方が適切です。"},{"incorrect":"✗ Preillumination is the same as reviewing the material after the lesson.","correct":"✓ Preillumination is different from reviewing the material after the lesson. It happens before the lesson to activate prior knowledge.","note":"予備知識活性化は、授業後に教材を復習することとは異なります。授業前に事前知識を活性化するために行われます。"}],"priority":"★★☆"},"related_words":{"derivatives":["preilluminate (動詞: 予備知識を活性化させる、事前に照らす)"],"related_concepts":["scaffolding (足場かけ)","schema theory (スキーマ理論)","constructivism (構成主義)","prior knowledge (事前知識)","active learning (アクティブラーニング)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - 主に教育分野で使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**preillumination**」は、教育の分野で使われる専門的な言葉で、新しいことを学ぶ前に、すでに知っていることや経験を思い出して、頭の中で準備運動をすることを意味します。これは、新しい情報を理解しやすくするために行われます。例えば、先生が新しい授業を始める前に、生徒にそのテーマについて知っていることを話し合ってもらうような活動がこれにあたります。この言葉は、日常会話ではあまり使われません。"},"example_sentences":[{"sentence":"The teacher used a KWL chart as a **preillumination** strategy to gauge students' existing knowledge.","translation":"先生は、生徒の既存の知識を測るための予備知識活性化戦略として、KWLチャートを使用した。","type":"noun","meaning_category":"予備知識活性化"},{"sentence":"Effective **preillumination** can lead to deeper learning and better retention of information.","translation":"効果的な予備知識活性化は、より深い学習と情報のより良い保持につながる可能性がある。","type":"noun","meaning_category":"予備知識活性化"},{"sentence":"Before reading the novel, the professor gave a brief lecture as a form of **preillumination** to provide historical context.","translation":"小説を読む前に、教授は歴史的背景を提供するための予備知識活性化の一環として、短い講義を行った。","type":"noun","meaning_category":"予備知識活性化"}]}