{"word":"marrowy","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"髄のような、髄質の；髄の多い、髄に富む","english_definition":"Resembling marrow; full of or rich in marrow.","examples":[{"sentence":"The marrowy bones were perfect for making soup.","translation":"髄の多い骨はスープを作るのに最適でした。"},{"sentence":"He enjoyed the rich, marrowy flavor of the osso buco.","translation":"彼はオッソ・ブーコの濃厚で髄のような風味を楽しみました。"}],"collocations":["marrowy bones","marrowy flavor","marrowy texture"],"synonyms":["medullary","pithy","rich","flavorful"],"antonyms":["lean","meager","bland"]}],"etymology":{"value":"From 'marrow' + '-y'. 'Marrow' comes from Old English 'mearg', of Germanic origin; related to Dutch 'merg' and German 'Mark'. The suffix '-y' indicates resemblance or abundance.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmærəʊi/","syllables":"mar-row-y"},"inflection":{"notes":"Comparative and superlative forms are 'more marrowy' and 'most marrowy', respectively, as it's a descriptive adjective."},"usage_notes":{"explanation":"'Marrowy' is primarily used to describe food, particularly bones or dishes made with bones, that contain or are reminiscent of marrow. It emphasizes the rich, fatty, and flavorful qualities associated with marrow. It is not a commonly used word outside of culinary contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant had a marrowy stem.","correct":"✓ The plant had a pithy stem.","note":"'Marrowy' is typically used for describing food, especially bones. For plants, 'pithy' is a more appropriate descriptor for a stem resembling marrow."},{"incorrect":"✗ The soup was marrowy with vegetables.","correct":"✓ The soup had a marrowy broth.","note":"'Marrowy' describes the quality derived from marrow, so it applies to the broth or bones, not the vegetables themselves."}],"priority":"★★★"},"related_words":{"derivatives":["marrow (noun): the soft, fatty, vascular tissue in the interior cavities of bones that is a major site of blood cell production.","marrowbone (noun): a bone containing marrow, especially one used for making soup or broth."],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR vocabulary lists)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Marrowy' is a relatively uncommon adjective used to describe something that resembles or is rich in bone marrow. It's mainly used in culinary contexts to describe the flavor or texture of dishes made with marrow bones. Understanding the word requires familiarity with the concept of bone marrow and its characteristics."},"example_sentences":[{"sentence":"The chef prepared a delicious sauce using marrowy beef bones.","translation":"シェフは髄の多い牛肉の骨を使って美味しいソースを作りました。","type":"adjective","meaning_category":"Describing flavor"},{"sentence":"The soup had a rich, marrowy taste that was very satisfying.","translation":"そのスープは濃厚で髄のような味がして、とても満足感がありました。","type":"adjective","meaning_category":"Describing flavor"},{"sentence":"Marrowy shanks are often braised for a long time to extract all the flavor.","translation":"髄の多いスネ肉は、風味をすべて引き出すために長時間煮込まれることが多いです。","type":"adjective","meaning_category":"Describing meat"}]}