{"word":"moonsickness","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"高山病","english_definition":"Altitude sickness; sickness caused by reduced air pressure and a lower concentration of oxygen at high altitudes.","examples":[{"sentence":"He suffered from moonsickness during his trek in the Himalayas.","translation":"彼はヒマラヤでのトレッキング中に高山病に苦しんだ。"},{"sentence":"Proper acclimatization can help prevent moonsickness.","translation":"適切な順応は高山病の予防に役立つ。"}],"collocations":["symptoms of moonsickness (高山病の症状)","prevent moonsickness (高山病を予防する)","treat moonsickness (高山病を治療する)"],"synonyms":["altitude sickness","mountain sickness"],"antonyms":[]}],"etymology":{"value":"The term 'moonsickness' is an older, somewhat archaic term for altitude sickness. The 'moon' part of the word likely refers to the feeling of lightheadedness or disorientation that can accompany the condition, as if one were 'moonstruck' or affected by the moon's influence.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmuːnˌsɪknəs/","syllables":"moon-sick-ness"},"inflection":{"noun_plural":"moonsicknesses (rarely used)"},"usage_notes":{"explanation":"'Moonsickness' is a less common term than 'altitude sickness' or 'mountain sickness', but it is still occasionally used, especially in older literature or by people familiar with traditional terms. It refers specifically to the physiological effects of being at high altitudes where there is less oxygen.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She caught moonsickness from the full moon.","correct":"✓ She suffered from moonsickness during her climb.","note":"Moonsickness is caused by high altitude, not the moon itself."}],"priority":"★★☆"},"related_words":{"derivatives":["moonstruck (形容詞: 月に心を奪われた、ぼうぜんとした)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Moonsickness' is an older term for what is now more commonly known as 'altitude sickness'. It describes the illness caused by being at high altitudes where there is less oxygen in the air. While not frequently used today, understanding this term can be helpful when reading older texts or discussing mountaineering history.","priority":"★☆☆"},"example_sentences":[{"sentence":"The early explorers often attributed their weakness to moonsickness.","translation":"初期の探検家たちはしばしば自分たちの衰弱を高山病のせいだと考えた。","type":"noun","meaning_category":"高山病"},{"sentence":"The guide warned them about the dangers of moonsickness before they began their ascent.","translation":"ガイドは彼らが登り始める前に高山病の危険性について警告した。","type":"noun","meaning_category":"高山病"}]}