{"word":"soiling","priority":"★☆☆","meanings":[{"part_of_speech":"verb (gerund/present participle)","definition":"汚すこと、汚染すること","english_definition":"The act of making something dirty; polluting.","examples":[{"sentence":"Soiling the environment is a serious offense.","translation":"環境を汚染することは重大な犯罪です。"},{"sentence":"He was accused of soiling the reputation of the company.","translation":"彼は会社の評判を汚したと非難された。"},{"sentence":"The soiling of the fabric made it unusable.","translation":"生地の汚れによって、それは使用できなくなった。"}],"collocations":["soiling the environment","soiling one's reputation","soiling the fabric"],"synonyms":["staining","dirtying","polluting","contaminating","defiling"],"antonyms":["cleaning","purifying","cleansing"]},{"part_of_speech":"noun","definition":"(医学)失禁、特に便失禁","english_definition":"(Medicine) Incontinence, especially fecal incontinence.","examples":[{"sentence":"Soiling is a common problem among elderly patients.","translation":"失禁は高齢患者によく見られる問題です。"},{"sentence":"The doctor asked about any instances of soiling.","translation":"医師は失禁の有無について尋ねた。"},{"sentence":"Soiling can be caused by various medical conditions.","translation":"失禁はさまざまな病状によって引き起こされる可能性がある。"}],"collocations":["fecal soiling","bowel soiling","accidental soiling"],"synonyms":["incontinence","encopresis"],"antonyms":[]}],"etymology":{"value":"From the verb 'soil,' which comes from Old French 'soillier' meaning 'to make dirty, to stain,' ultimately from Latin 'sūculus,' a diminutive of 'sūs' meaning 'pig.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɔɪlɪŋ/","syllables":"soil-ing"},"inflection":{"notes":"This is the gerund or present participle form of the verb 'soil.' As a noun, it is uncountable in the sense of 'the act of soiling' but can be countable when referring to instances of incontinence."},"usage_notes":{"explanation":"'Soiling' can refer to the general act of making something dirty, or it can have a specific medical meaning related to incontinence, particularly fecal incontinence. The context usually makes the intended meaning clear. In general usage, 'soiling' is often used when something is dirtied in a way that is considered unpleasant or undesirable.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The soiling was very bad after the rain.","correct":"✓ The mud was very bad after the rain. / ✓ The soiling of the carpets was very bad after the rain.","note":"'Soiling' refers to the act of making something dirty. If you want to refer to the dirt itself, use 'mud' or 'dirt'. To use 'soiling', specify what was soiled."},{"incorrect":"✗ He has soiling problems with his clothes.","correct":"✓ He has problems with soiling his clothes. / ✓ He has soiling accidents.","note":"'Soiling problems' is vague. Clarify whether the problem is the act of soiling or the result of soiling. In the medical context, 'soiling accidents' is more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["soil (verb, noun)","soiled (adjective)","unsoiled (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Soiling' has two main meanings. Generally, it refers to the act of making something dirty. For example, 'soiling the environment' means making the environment dirty. In a medical context, 'soiling' refers to the involuntary discharge of feces, also known as fecal incontinence. This term is often used in medical settings or when discussing health-related issues. The specific meaning depends heavily on the context in which it is used."},"example_sentences":[{"sentence":"The children were warned against soiling their clothes while playing.","translation":"子供たちは遊んでいる間、服を汚さないように注意された。","type":"verb (gerund)","meaning_category":"汚すこと"},{"sentence":"Fecal soiling can be a distressing symptom for patients.","translation":"便失禁は患者にとって苦痛な症状となりうる。","type":"noun","meaning_category":"失禁"},{"sentence":"The soiling of the ancient manuscript damaged its readability.","translation":"古代原稿の汚れは、その可読性を損なった。","type":"verb (gerund)","meaning_category":"汚すこと"},{"sentence":"The elderly woman experienced occasional soiling due to her medical condition.","translation":"その高齢女性は、病状のために時々失禁を経験した。","type":"noun","meaning_category":"失禁"}]}