{"word":"aerographical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"航空図の、航空図に関する","english_definition":"Relating to aerography, the descriptive science of the atmosphere.","examples":[{"sentence":"The aerographical data was used to create the flight plan.","translation":"航空図のデータは、飛行計画を作成するために使用されました。"},{"sentence":"The aerographical survey provided important information about weather patterns.","translation":"航空図調査は、気象パターンに関する重要な情報を提供しました。"}],"collocations":["aerographical chart","aerographical data","aerographical survey"],"synonyms":["atmospheric","meteorological"],"antonyms":[]}],"etymology":{"value":"Derived from 'aerography', which combines 'aero-' (relating to air or atmosphere) and '-graphy' (descriptive science).","priority":"★★★"},"pronunciation":{"ipa":"ˌɛəroʊˈɡræfɪkəl","syllables":"a-er-o-graph-i-cal"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Aerographical' is a technical term primarily used in the context of aviation, meteorology, and geography to describe information or data related to the atmosphere and its properties. It is often used in scientific or technical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The geographical data was aerographical.","correct":"✓ The aerographical data was used for flight planning.","note":"'Aerographical' specifically refers to atmospheric data, while 'geographical' refers to land features."}],"priority":"★☆☆"},"related_words":{"derivatives":["aerography (noun): The descriptive science of the atmosphere.","aerographer (noun): A person who studies or creates aerographical maps or data."]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Aerographical' is a specialized term related to the descriptive science of the atmosphere, often used in technical or scientific contexts such as aviation and meteorology. It refers to data or information pertaining to the atmosphere's properties and conditions. Due to its specific and technical nature, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The pilot consulted the aerographical maps before takeoff.","translation":"パイロットは離陸前に航空図を確認した。","type":"adjective","meaning_category":"航空図の"},{"sentence":"The aerographical report detailed the wind patterns at different altitudes.","translation":"航空図の報告書は、異なる高度での風のパターンを詳細に記述した。","type":"adjective","meaning_category":"航空図に関する"}]}