{"word":"Catharistic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"カタリ派の、またはカタリ派に関する","english_definition":"Relating to the Cathars or Catharism.","examples":[{"sentence":"Catharistic beliefs were considered heretical by the Catholic Church.","translation":"カタリ派の信仰はカトリック教会によって異端とみなされた。"},{"sentence":"The region has many historical sites related to Catharistic history.","translation":"その地域にはカタリ派の歴史に関連する多くの史跡がある。"}],"collocations":["Catharistic beliefs","Catharistic history","Catharistic texts"],"synonyms":["Albigensian","heretical (in a historical context)"],"antonyms":["orthodox","Catholic"]},{"part_of_speech":"adjective","definition":"カタリ派のような禁欲的な生活を送る","english_definition":"Resembling the ascetic lifestyle of the Cathars.","examples":[{"sentence":"His lifestyle could be described as Catharistic, given his rejection of material possessions.","translation":"彼の生活様式は、物質的な所有を拒否していることから、カタリ派的と言えるだろう。"}],"collocations":["Catharistic lifestyle","Catharistic asceticism"],"synonyms":["ascetic","austere","self-denying"],"antonyms":["hedonistic","indulgent"]}],"etymology":{"value":"Derived from 'Cathar', referring to members of a medieval dualist religious movement, combined with the suffix '-istic', indicating relation or resemblance.","priority":"★★★"},"pronunciation":{"ipa":"/ˌkæθəˈrɪstɪk/","syllables":"ca-tha-ris-tic"},"inflection":{"notes":"Adjectives do not inflect in English (no plural forms)."},"usage_notes":{"explanation":"'Catharistic' is primarily used in historical contexts to describe things related to the Cathars, a religious group in medieval Europe. It can also be used more broadly to describe a lifestyle or set of beliefs that are similar to those of the Cathars, particularly in terms of asceticism and rejection of material possessions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The catharistic person was very happy.","correct":"✓ The ascetic person was very happy.","note":"'Catharistic' refers to beliefs or practices related to the Cathars. Use 'ascetic' to describe a person who practices self-discipline and abstains from indulgence."}],"priority":"★★☆"},"related_words":{"derivatives":["Cathar (noun: a member of the Cathar religious movement)","Catharism (noun: the beliefs and practices of the Cathars)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Catharistic' is a specialized term primarily used in historical or religious contexts. It refers to the Cathars, a medieval religious group, and their associated beliefs and practices. The word is not commonly used in everyday language and requires some familiarity with medieval history or religious studies to understand fully."},"example_sentences":[{"sentence":"The museum displayed artifacts from the Catharistic period.","translation":"博物館にはカタリ派時代の遺物が展示されていた。","type":"adjective","meaning_category":"Relating to the Cathars"},{"sentence":"His rejection of worldly pleasures reflected a Catharistic philosophy.","translation":"彼の世俗的な快楽の拒否は、カタリ派的な哲学を反映していた。","type":"adjective","meaning_category":"Resembling the ascetic lifestyle of the Cathars"}]}