{"word":"intercropping","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"混作、間作、畝間栽培","english_definition":"The practice of growing two or more crops in close proximity, usually on the same land.","examples":[{"sentence":"Intercropping corn and beans can improve soil health and reduce pest problems.","translation":"トウモロコシと豆の混作は、土壌の健康を改善し、害虫の問題を軽減することができます。"},{"sentence":"Many smallholder farmers use intercropping to maximize their land use.","translation":"多くの小規模農家は、土地利用を最大化するために混作を利用しています。"},{"sentence":"Intercropping is a sustainable farming technique that can increase biodiversity.","translation":"混作は、生物多様性を高めることができる持続可能な農業技術です。"}],"collocations":["strip intercropping (帯状混作)","relay intercropping (リレー混作)","row intercropping (列状混作)","companion planting (コンパニオンプランツ)"],"synonyms":["mixed cropping","companion planting"],"antonyms":["monoculture","sole cropping"]}],"etymology":{"value":"\"Inter-\" (between) + \"cropping\" (the cultivation of plants).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪntərˈkrɒpɪŋ/","syllables":"in-ter-crop-ping"},"inflection":{"noun_plural":"intercroppings"},"usage_notes":{"explanation":"Intercropping is a strategy used in agriculture to increase yields and improve land use efficiency. It involves planting multiple crops in the same field at the same time or in overlapping seasons. This can lead to better resource utilization, pest control, and overall farm productivity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Intercropping is when you only grow one crop.","correct":"✓ Intercropping is when you grow two or more crops together.","note":"Intercropping involves growing multiple crops, not just one."},{"incorrect":"✗ Intercropping is the same as crop rotation.","correct":"✓ Intercropping is growing crops together, while crop rotation is changing crops sequentially.","note":"Intercropping is simultaneous, while crop rotation is sequential."}],"priority":"★★☆"},"related_words":{"derivatives":["intercrop (verb, to plant two or more crops together)"],"phrasal_verbs":[],"related_terms":["polyculture","agroforestry","sustainable agriculture"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in agricultural contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Intercropping' refers to the agricultural practice of growing two or more different crops in the same field at the same time. This is often done to improve soil health, manage pests, and increase overall productivity compared to growing a single crop (monoculture). It's a more advanced farming technique often discussed in the context of sustainable agriculture."},"example_sentences":[{"sentence":"The farmer used **intercropping** to grow beans and corn together.","translation":"その農家は混作を利用して豆とトウモロコシを一緒に育てた。","type":"example","meaning_category":"General"},{"sentence":"**Intercropping** can help reduce the need for chemical pesticides.","translation":"混作は化学農薬の必要性を減らすのに役立つ。","type":"example","meaning_category":"Benefits"},{"sentence":"**Intercropping** is a common practice in many developing countries.","translation":"混作は多くの発展途上国で一般的な慣行である。","type":"example","meaning_category":"Prevalence"}]}