{"word":"endocoeliac","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(医学) 腸管内の、腸腔内の","english_definition":"(medicine) Situated or occurring within the intestine.","examples":[{"sentence":"The endocoeliac administration of the drug proved to be more effective.","translation":"その薬の腸管内投与はより効果的であることが証明された。"},{"sentence":"Endocoeliac parasites can cause significant health problems.","translation":"腸管内寄生虫は重大な健康問題を引き起こす可能性がある。"}],"collocations":["endocoeliac administration","endocoeliac parasites","endocoeliac pressure"],"synonyms":["intestinal","intraluminal"],"antonyms":["extraintestinal"]}],"etymology":{"value":"Derived from the Greek words 'endo-' (within) and 'koilia' (belly, abdomen).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛndoʊˈsiːliæk/","syllables":"en-do-coe-li-ac"},"inflection":{"notes":"This word does not have standard inflections beyond comparative or superlative forms, which are rarely used (more endocoeliac, most endocoeliac)."},"usage_notes":{"explanation":"The term 'endocoeliac' is primarily used in medical and scientific contexts to describe conditions, processes, or locations within the intestinal tract. It is relatively uncommon in general language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bacteria was exocoeliac.","correct":"✓ The bacteria was endocoeliac.","note":"'Endocoeliac' refers to something inside the intestine, whereas 'exocoeliac' (if it were a valid term, which it generally isn't) would imply something outside the intestine. Make sure to use the correct prefix ('endo-' for inside)."}],"priority":"★☆☆"},"related_words":{"derivatives":["endocoeliacally (adverb, rarely used)"],"related_terms":["coeliac (related to the abdomen or coeliac disease)","intestinal (relating to the intestines)","intraluminal (within the lumen of a tubular structure, such as the intestine)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Endocoeliac' is a highly specialized medical term used to describe something located or occurring within the intestine. It is not commonly used outside of medical or scientific literature. Understanding this term requires a good grasp of medical terminology and anatomy."},"example_sentences":[{"sentence":"The study focused on the effects of the drug when administered through the endocoeliac route.","translation":"その研究は、その薬が腸管内経路で投与された場合の効果に焦点を当てた。","type":"adjective","meaning_category":"腸管内の"},{"sentence":"An endocoeliac examination revealed the presence of a polyp.","translation":"腸管内検査でポリープの存在が明らかになった。","type":"adjective","meaning_category":"腸管内の"},{"sentence":"The endocoeliac environment plays a crucial role in nutrient absorption.","translation":"腸管内環境は栄養吸収において重要な役割を果たす。","type":"adjective","meaning_category":"腸管内の"}]}