{"word":"Maximation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"最大化、最大限にすること","english_definition":"The act of maximizing something; making something as large or great as possible.","examples":[{"sentence":"The maximation of profits is the primary goal of the company.","translation":"利益の最大化は、その会社の主な目標です。"},{"sentence":"The maximation of efficiency is crucial for the success of the project.","translation":"効率の最大化は、プロジェクトの成功に不可欠です。"},{"sentence":"The athlete focused on the maximation of his strength and endurance.","translation":"その運動選手は、自身の力と持久力の最大化に集中しました。"}],"collocations":["profit maximation (利益の最大化)","efficiency maximation (効率の最大化)","utility maximation (効用の最大化)","revenue maximation (収益の最大化)","value maximation (価値の最大化)","wealth maximation (富の最大化)"],"synonyms":["optimization","maximization","enhancement","increase","amplification"],"antonyms":["minimization","reduction","decrease","diminution"]}],"etymology":{"value":"Derived from the verb 'maximize' and the suffix '-ation', indicating the process or result of maximizing. 'Maximize' comes from the Latin 'maximus', meaning 'greatest'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmæksɪməˈzeɪʃən/","syllables":"max-i-ma-tion"},"inflection":{"noun_plural":"maximations"},"usage_notes":{"explanation":"'Maximation' is a noun that refers to the act or process of making something as large or great as possible. It is often used in business, economics, and sports contexts to describe the goal of achieving the highest possible level of something, such as profits, efficiency, or performance. While 'maximization' is a more common and widely accepted term, 'maximation' is also valid and used, although less frequently.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The maximation of the company was very good.","correct":"✓ The maximization of the company's profits was very good.","note":"'Maximation' refers to the *process* of maximizing, not the company itself. Specify what is being maximized (e.g., profits, efficiency)."},{"incorrect":"✗ He is working on maximation his score.","correct":"✓ He is working on maximizing his score. / ✓ He is working on the maximation of his score.","note":"'Maximation' is a noun. To use it as a verb, you need to use 'maximize'. Alternatively, use the noun form correctly: 'the maximation of his score'."}],"priority":"★★☆"},"related_words":{"derivatives":["maximize (verb: 最大化する)","maximal (adjective: 最大の)","maximum (noun/adjective: 最大)","maximally (adverb: 最大限に)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency compared to 'maximization'.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Maximation' is a formal noun referring to the act of making something as large or effective as possible. It's often used in technical or academic contexts, particularly in economics, business, and engineering. While 'maximization' is more commonly used, 'maximation' is a valid alternative. Understanding this word helps in comprehending complex strategies aimed at achieving peak performance or output."},"example_sentences":[{"sentence":"The company's strategy involved the maximation of shareholder value.","translation":"その会社の戦略は、株主価値の最大化を含むものでした。","type":"noun","meaning_category":"最大化"},{"sentence":"The coach emphasized the maximation of each player's potential.","translation":"コーチは、各選手の潜在能力の最大化を強調しました。","type":"noun","meaning_category":"最大化"},{"sentence":"The research focused on the maximation of crop yields through advanced farming techniques.","translation":"その研究は、高度な農業技術による収穫量の最大化に焦点を当てました。","type":"noun","meaning_category":"最大化"}]}