{"word":"Autoscopy","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自己像幻視、自己像体験","english_definition":"The experience of seeing one's own body from a location outside of one's physical body.","examples":[{"sentence":"He reported an autoscopy experience during a severe migraine.","translation":"彼はひどい偏頭痛の際に自己像幻視の体験を報告した。"},{"sentence":"Autoscopy is often associated with neurological or psychiatric conditions.","translation":"自己像幻視はしばしば神経学的または精神医学的疾患と関連付けられる。"}],"collocations":["experience autoscopy","report autoscopy","autoscopy and neurological disorders"],"synonyms":["out-of-body experience (OBE)","doppelganger phenomenon"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'autos' (self) and 'skopeō' (I view). Literally, 'seeing oneself'.","priority":"★★★"},"pronunciation":{"ipa":"/ɔːˈtɒskəpi/","syllables":"Au-tos-co-py"},"inflection":{"noun_plural":"Autoscopies"},"usage_notes":{"explanation":"Autoscopy is a complex phenomenon distinct from simple hallucinations. The individual experiencing autoscopy typically recognizes the seen 'double' as their own body. It is often associated with neurological conditions like epilepsy, migraine, or stroke, as well as psychiatric conditions and near-death experiences.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a out of body experience.","correct":"✓ He had an out-of-body experience.","note":"'Out-of-body experience' is a compound noun and requires the article 'an' because it starts with a vowel sound."},{"incorrect":"✗ Autoscopy is when you see another person.","correct":"✓ Autoscopy is when you see yourself.","note":"Autoscopy specifically involves seeing oneself, not another person."}],"priority":"★★☆"},"related_words":{"derivatives":["Autoscopic (adjective)"],"phrasal_verbs":[],"related_medical_terms":["Neurology","Psychiatry","Migraine","Epilepsy","Stroke"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Autoscopy' refers to the experience of seeing one's own body as if from an external viewpoint. This phenomenon is relatively rare and is often linked to specific neurological or psychological conditions. Understanding the term requires a familiarity with medical and psychological vocabulary. It is distinct from a simple hallucination because the individual recognizes the double as themselves."},"example_sentences":[{"sentence":"During the experiment, some participants reported experiencing brief episodes of autoscopy.","translation":"実験中、一部の参加者は短い自己像幻視のエピソードを経験したと報告した。","type":"general","meaning_category":"experience"},{"sentence":"The neurologist investigated whether the patient's seizures were related to his autoscopy.","translation":"神経科医は、患者のてんかん発作が彼の自己像幻視と関連しているかどうかを調査した。","type":"medical","meaning_category":"medical condition"},{"sentence":"The philosophical implications of autoscopy raise questions about self-awareness and consciousness.","translation":"自己像幻視の哲学的意味合いは、自己認識と意識についての疑問を提起する。","type":"philosophical","meaning_category":"philosophical implication"}]}