{"word":"conditionalize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"条件付きにする、条件を付ける","english_definition":"to make something conditional; to subject something to a condition or conditions.","examples":[{"sentence":"The grant was conditionalized on the project meeting certain milestones.","translation":"その助成金は、プロジェクトが特定の目標を達成することを条件として付与された。"},{"sentence":"We need to conditionalize our offer based on the results of the inspection.","translation":"検査の結果に基づいて、私たちのオファーに条件を付ける必要がある。"}],"collocations":["conditionalize an offer (オファーに条件を付ける)","conditionalize a grant (助成金に条件を付ける)","conditionalize approval (承認に条件を付ける)"],"synonyms":["stipulate","qualify","restrict","limit","specify"],"antonyms":["unconditionally approve","authorize without conditions"]},{"part_of_speech":"verb","transitivity":"vt","definition":"(確率論で)条件付き確率を求める、条件付き確率で考える","english_definition":"(in probability theory) to calculate or consider conditional probabilities.","examples":[{"sentence":"We can conditionalize the probability of A given B.","translation":"Bを条件としたAの条件付き確率を求めることができる。"},{"sentence":"Conditionalizing on the available data, we can update our beliefs about the hypothesis.","translation":"利用可能なデータに基づいて条件付き確率を考慮することで、仮説に関する信念を更新できる。"}],"collocations":["conditionalize on data (データに基づいて条件付き確率を求める)","conditionalize a probability (確率の条件付き確率を求める)"],"synonyms":["calculate conditional probability","estimate conditional likelihood"],"antonyms":[]}],"etymology":{"value":"\"conditional\" + \"-ize\".  \"Conditional\" comes from Late Latin \"conditionalis\", from \"conditio\" (condition). The suffix \"-ize\" means \"to make, to render\".","priority":"★★☆"},"pronunciation":{"ipa":"/kənˈdɪʃənəˌlaɪz/","syllables":"con-di-tion-a-lize"},"inflection":{"verb_forms":{"present_simple":["conditionalize","conditionalizes"],"past_simple":"conditionalized","past_participle":"conditionalized","present_participle":"conditionalizing"}},"usage_notes":{"explanation":"The word \"conditionalize\" is relatively uncommon, but it is used in both general contexts to mean \"to make conditional\" and in the specific context of probability theory to mean \"to calculate or consider conditional probabilities.\"  In general usage, it implies adding a condition or requirement to something.  In probability theory, it refers to the process of updating probabilities based on new information.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The approval was conditionalized of the inspection.","correct":"✓ The approval was conditionalized on the inspection.","note":"The correct preposition to use with \"conditionalized\" is \"on\"."},{"incorrect":"✗ We should conditionalize, if the results are bad.","correct":"✓ We should conditionalize our offer if the results are bad.","note":"\"Conditionalize\" is a transitive verb and requires a direct object (what is being made conditional)."}],"priority":"★★☆"},"related_words":{"derivatives":["conditionalization (noun)"],"related_terms":["conditional (adjective)","condition (noun)","probability (noun)","conditional probability (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"conditionalize\" is a technical term, primarily used in academic or professional contexts, particularly in fields like statistics, mathematics, and law. It means to make something subject to conditions or to calculate conditional probabilities. Due to its specialized usage, it is not commonly encountered in everyday language. Understanding the context is crucial for interpreting its meaning correctly."},"example_sentences":[{"sentence":"The contract was conditionalized upon successful completion of the pilot program.","translation":"その契約は、試験プログラムの成功裏な完了を条件として付与された。","type":"verb","meaning_category":"条件付きにする"},{"sentence":"By conditionalizing on the evidence, we can refine our estimate of the risk.","translation":"証拠に基づいて条件付き確率を考慮することで、リスクの見積もりを改善できる。","type":"verb","meaning_category":"条件付き確率を求める"}]}