{"word":"Obreption","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律)事実の隠蔽または虚偽の陳述によって得られたもの。特に、上位の者から下位の者への不正な許可または恩恵。","english_definition":"The act of obtaining something by concealing the truth or making a false statement; especially, an illicit grant or benefit obtained from a superior by concealing the truth from them.","examples":[{"sentence":"The contract was obtained by obreption, as key details were deliberately withheld.","translation":"契約は事実の隠蔽によって得られたものであり、重要な詳細が意図的に伏せられていた。"},{"sentence":"The student's scholarship was revoked when it was discovered that it was gained through obreption.","translation":"学生の奨学金は、事実の隠蔽によって得られたことが判明したため、取り消された。"}],"collocations":["obtain by obreption","gain by obreption","revoke due to obreption"],"synonyms":["deception","fraud","misrepresentation","concealment","suppression"],"antonyms":["candor","honesty","truthfulness","transparency"]}],"etymology":{"value":"ラテン語の *obrepere* (忍び寄る、隠れて手に入れる) から派生。*ob-* (～に向かって) + *repere* (這う、忍び寄る) が語源。","priority":"★★☆"},"pronunciation":{"ipa":"/ɒbˈrɛpʃən/","syllables":"Ob-rep-tion"},"inflection":{"noun_plural":"obreptions"},"usage_notes":{"explanation":"Obreptionは、主に法律または正式な文脈で使用される、やや古風な単語です。これは、真実を隠したり、誤った情報を提示したりすることによって何かを得る行為を指します。特に、権限のある人から不正な許可や利益を得る場合に適用されます。日常会話ではあまり使われませんが、法的文書や歴史的な記述で見られることがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was charged with corruption, but it was actually obreption.","correct":"✓ He was charged with obreption for concealing his prior convictions.","note":"Corruptionは公務員などの不正行為を指しますが、obreptionは真実の隠蔽による不正な利益の取得を指します。"},{"incorrect":"✗ The obreption of the painting made it more valuable.","correct":"✓ The misrepresentation of the painting's origin made it more valuable.","note":"Obreptionは行為を指し、物自体を指しません。"}],"priority":"★★☆"},"related_words":{"derivatives":["obreptive (形容詞: 事実を隠蔽する)"],"phrases":[]},"level_frequency":{"CEFR":"N/A (非常にまれな単語)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「Obreption」は、法律や歴史的な文脈で稀に使用される専門用語であり、日常会話ではほとんど見られません。この単語は、真実を隠蔽したり、虚偽の陳述をしたりすることによって何かを得る行為を指します。特に、上位の者から不正な許可や利益を得る場合に用いられます。この単語を理解するには、法律や歴史的な文書の読解経験が必要です。"},"example_sentences":[{"sentence":"The lawyer argued that the contract was invalid due to the obreption involved in its procurement.","translation":"弁護士は、契約の取得に関与した事実の隠蔽により、契約は無効であると主張した。","type":"noun","meaning_category":"事実の隠蔽"},{"sentence":"The king's decree was later overturned when the obreption used to obtain it was revealed.","translation":"王の布告は、それを得るために用いられた事実の隠蔽が明らかになったとき、後に覆された。","type":"noun","meaning_category":"事実の隠蔽"}]}