{"word":"localisms","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"地域主義、地方色、方言、地域特有の表現","english_definition":"a custom, saying, or other feature that is peculiar to a particular locality or region.","examples":[{"sentence":"The book is full of localisms that are difficult for outsiders to understand.","translation":"その本は、部外者には理解しにくい地域特有の表現でいっぱいだ。"},{"sentence":"Linguists study localisms to understand how language varies across different regions.","translation":"言語学者は、言語が地域によってどのように異なるかを理解するために、地域特有の表現を研究する。"},{"sentence":"The play used many localisms to create a sense of authenticity.","translation":"その劇は、信憑性を出すために多くの地域特有の表現を使った。"}],"collocations":["regional localisms","linguistic localisms","cultural localisms","understand localisms","study localisms","use localisms"],"synonyms":["regionalisms","dialectalisms","provincialisms","colloquialisms","vernacularisms"],"antonyms":["standard language","formal language","universalisms"]}],"etymology":{"value":"From 'local' + '-ism'. 'Local' comes from Latin 'localis', pertaining to a place. '-ism' is a suffix denoting a distinctive practice, system, or philosophy.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈloʊkəˌlɪzəmz/","syllables":"lo-cal-ismz"},"inflection":{"noun_singular":"localism"},"usage_notes":{"explanation":"'Localisms' refers to features specific to a particular region, often linguistic or cultural. It can include words, phrases, pronunciations, customs, or traditions that are not widely understood or practiced outside that region. The term is often used in the context of language studies, cultural anthropology, and regional history.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The city is known for its globalisms.","correct":"✓ The city is known for its localisms.","note":"'Globalisms' refers to worldwide integration, the opposite of regional specificity."},{"incorrect":"✗ She used many universalisms in her speech.","correct":"✓ She used many localisms in her speech.","note":"'Universalisms' refers to concepts or practices applicable to everyone, contrasting with the regional focus of 'localisms'."}],"priority":"★☆☆"},"related_words":{"derivatives":["local","locality","localize","localization"],"related_concepts":["regional dialect","vernacular","cultural heritage","regional identity","folklore"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Localisms' refers to the unique characteristics, especially linguistic expressions and customs, that are specific to a particular region. Understanding this word requires familiarity with concepts of regional variation and cultural specificity. It is often used in academic or specialized contexts related to language, culture, and geography."},"example_sentences":[{"sentence":"The author skillfully incorporated localisms into the dialogue to give the characters a distinct regional flavor.","translation":"著者は、登場人物に明確な地域色を与えるために、地域特有の表現を巧みに会話に取り入れた。","type":"noun","meaning_category":"regional expression"},{"sentence":"Many localisms in the Appalachian region are derived from older forms of English.","translation":"アパラチア地方の多くの地域特有の表現は、古い形式の英語に由来する。","type":"noun","meaning_category":"linguistic features"},{"sentence":"The museum exhibit highlighted the localisms that define the region's unique cultural identity.","translation":"博物館の展示では、その地域の独特な文化的アイデンティティを定義する地域特有の表現が強調されていた。","type":"noun","meaning_category":"cultural traits"}]}