{"word":"beteela","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Australian Aboriginal English) A type of acacia tree found in arid regions of Australia.","english_definition":"A type of acacia tree (Acacia tetragonophylla) found in arid regions of Australia, characterized by its phyllodes and drought resistance.","examples":[{"sentence":"The beteela provides important habitat for native wildlife.","translation":"ベティーラは、在来の野生生物にとって重要な生息地を提供します。"},{"sentence":"Aboriginal people traditionally used the beteela for various purposes.","translation":"先住民は伝統的に、ベティーラをさまざまな目的で使用していました。"}],"collocations":["beteela tree","Acacia tetragonophylla","arid zone vegetation"],"synonyms":["prickly wattle","dead finish"],"antonyms":[]},{"part_of_speech":"adjective","definition":"(Australian Aboriginal English, rare) Relating to or made from the beteela tree.","english_definition":"Relating to or derived from the beteela tree.","examples":[{"sentence":"Beteela wood was used for making tools.","translation":"ベティーラの木材は道具を作るために使われました。"}],"collocations":["beteela wood","beteela tools"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From an Australian Aboriginal language, likely from a language of Western Australia. The exact origin and language group are not definitively known.","priority":"★★☆"},"pronunciation":{"ipa":"/bəˈtiːlə/","syllables":"be-tee-la"},"inflection":{"noun_plural":"beteelas"},"usage_notes":{"explanation":"'Beteela' is primarily used in Australian English, particularly in contexts related to botany, ecology, and Aboriginal culture. It is most commonly used as a noun to refer to the specific species of acacia tree, Acacia tetragonophylla. Its use as an adjective is less common.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a beteela in my garden in England.","correct":"✓ I saw an acacia in my garden in England.","note":"Beteela trees are native to Australia, so it would be unusual to find one in England. Use the general term 'acacia' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["None widely used"],"phrasal_verbs":[],"related_species":["Acacia aneura (mulga)","Acacia victoriae (gundabluie)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Beteela' is a specialized term primarily used in Australian English, specifically referring to the Acacia tetragonophylla tree. Understanding its meaning requires knowledge of Australian flora and potentially Aboriginal Australian culture. It is not a commonly used word outside of these contexts. Therefore, its readability is considered to be at an advanced level (C1)."},"example_sentences":[{"sentence":"The arid landscape was dotted with hardy beteela trees.","translation":"乾燥した風景には、丈夫なベティーラの木が点在していました。","type":"noun","meaning_category":"Acacia tree"},{"sentence":"Aboriginal people used beteela branches for making shelters.","translation":"先住民はベティーラの枝を使ってシェルターを作りました。","type":"noun","meaning_category":"Acacia tree"}]}