{"word":"rotiferous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"輪形動物の、輪形動物に属する","english_definition":"Relating to or belonging to the Rotifera.","examples":[{"sentence":"The sample contained several rotiferous species.","translation":"そのサンプルにはいくつかの輪形動物の種が含まれていた。"},{"sentence":"Rotiferous fauna are an important part of the freshwater ecosystem.","translation":"輪形動物相は淡水生態系の重要な部分である。"}],"collocations":["rotiferous species","rotiferous fauna","rotiferous ecosystem"],"synonyms":["rotatorial","wheel-animalcule"],"antonyms":[]}],"etymology":{"value":"From Latin 'rota' (wheel) + '-ferous' (bearing, producing). Refers to the characteristic corona (crown) of cilia around the mouth of rotifers, which resembles a rotating wheel.","priority":"★★☆"},"pronunciation":{"ipa":"/roʊˈtɪfərəs/","syllables":"ro-tif-er-ous"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Rotiferous' is a scientific term used specifically in the context of zoology and ecology to describe organisms or features related to the phylum Rotifera. It is not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rotiferous is swimming in the water.","correct":"✓ A rotifer is swimming in the water.","note":"'Rotiferous' is an adjective, not a noun. The noun form is 'rotifer'."}],"priority":"★☆☆"},"related_words":{"derivatives":["Rotifera (輪形動物門)","rotifer (輪形動物)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'rotiferous' is a specialized scientific term used in the context of zoology and ecology. It refers to anything related to the phylum Rotifera, which are microscopic or near-microscopic pseudocoelomate animals. Due to its specialized nature, it is not commonly encountered outside of scientific or academic contexts. Understanding this term requires a background in biology or a related field."},"example_sentences":[{"sentence":"The study focused on the diversity of rotiferous organisms in the lake.","translation":"その研究は湖における輪形動物の多様性に焦点を当てた。","type":"adjective","meaning_category":"輪形動物の"},{"sentence":"Rotiferous communities play a crucial role in nutrient cycling in aquatic environments.","translation":"輪形動物群集は水生環境における栄養循環において重要な役割を果たす。","type":"adjective","meaning_category":"輪形動物に属する"}]}