{"word":"vapor-barrier","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"防湿層、防湿シート","english_definition":"A material used to prevent moisture from diffusing through a building assembly (walls, floors, ceilings).","examples":[{"sentence":"The vapor barrier is installed on the warm side of the insulation.","translation":"防湿層は断熱材の暖かい側に設置されます。"},{"sentence":"A properly installed vapor barrier can prevent mold growth.","translation":"適切に設置された防湿層はカビの発生を防ぐことができます。"}],"collocations":["install a vapor barrier (防湿層を設置する)","vapor barrier membrane (防湿膜)","vapor barrier tape (防湿テープ)","vapor barrier system (防湿システム)"],"synonyms":["moisture barrier","vapor retarder"],"antonyms":[]}],"etymology":{"value":"'Vapor' (蒸気) + 'barrier' (障壁) からなる複合語。建材における湿気対策の必要性から生まれた比較的新しい用語。","priority":"★★★"},"pronunciation":{"ipa":"/ˈveɪpərˌbæriər/","syllables":"va-por-bar-ri-er"},"inflection":{"noun_plural":"vapor-barriers"},"usage_notes":{"explanation":"A vapor barrier is designed to prevent moisture from passing through walls, floors, and ceilings. It's typically installed on the warm side of the insulation in a building to prevent condensation from forming within the wall cavity, which can lead to mold and structural damage. The effectiveness of a vapor barrier depends on proper installation and the climate. In some climates, a vapor retarder (which allows some moisture to pass through) may be more appropriate than a complete vapor barrier.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The vapor barrier is on the cold side of the wall.","correct":"✓ The vapor barrier is on the warm side of the wall.","note":"Vapor barriers should be installed on the warm side of the wall to prevent moisture from condensing within the wall cavity."},{"incorrect":"✗ You don't need a vapor barrier in a dry climate.","correct":"✓ Whether you need a vapor barrier depends on the climate and building design.","note":"The need for a vapor barrier depends on the climate and building design. In some dry climates, it may not be necessary, but it's always best to consult with a building professional."}],"priority":"★★☆"},"related_words":{"derivatives":["vapor (蒸気)","barrier (障壁)","insulation (断熱材)","condensation (結露)","mold (カビ)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Relatively low frequency. Technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"vapor barrier\" refers to a material used in construction to prevent moisture from diffusing through walls, floors, and ceilings. It's a technical term primarily used by builders, contractors, and those involved in construction or home renovation. Understanding the concept requires some knowledge of building science and moisture control. The term is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"A 6-mil polyethylene sheet is often used as a vapor barrier.","translation":"6ミルのポリエチレンシートは、防湿層としてよく使用されます。","type":"noun","meaning_category":"防湿層"},{"sentence":"Make sure to overlap the seams of the vapor barrier and seal them with tape.","translation":"防湿層の継ぎ目を重ねて、テープで密封してください。","type":"noun","meaning_category":"防湿層"},{"sentence":"The building inspector checked the installation of the vapor barrier.","translation":"建築検査官は防湿層の設置状況を確認しました。","type":"noun","meaning_category":"防湿層"}]}