{"word":"fortifiers","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"強化剤、栄養強化剤","english_definition":"Substances added to food to increase its nutritional value.","examples":[{"sentence":"These breakfast cereals are often enriched with fortifiers like iron and vitamins.","translation":"これらの朝食用シリアルには、鉄やビタミンなどの強化剤がよく添加されています。"},{"sentence":"Fortifiers are used to combat nutrient deficiencies in developing countries.","translation":"強化剤は、発展途上国における栄養欠乏症と闘うために使用されています。"}],"collocations":["food fortifiers","nutrient fortifiers","vitamin fortifiers","mineral fortifiers"],"synonyms":["enrichment","supplement","additive"],"antonyms":[]}],"etymology":{"value":"The word 'fortifier' comes from the verb 'fortify,' which means to strengthen or reinforce. It is derived from the Latin word 'fortis,' meaning strong.","priority":"★★☆"},"pronunciation":{"ipa":"ˈfɔːrtɪfaɪərz","syllables":"for-ti-fi-ers"},"inflection":{"noun_plural":"fortifiers"},"usage_notes":{"explanation":"'Fortifiers' are typically added to staple foods like flour, rice, and salt to improve public health. The goal is to provide essential nutrients to a large population without requiring significant changes in dietary habits.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The fortifiers are a type of medicine.","correct":"✓ The fortifiers are a type of food additive.","note":"Fortifiers are food additives, not medicine, although they improve health. "},{"incorrect":"✗ Fortifiers only contain vitamins.","correct":"✓ Fortifiers can contain vitamins, minerals, and other nutrients.","note":"Fortifiers can include vitamins, minerals, and other essential nutrients."}],"priority":"★☆☆"},"related_words":{"derivatives":["fortify (verb)","fortification (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'fortifiers' refers to substances added to food to increase its nutritional value. This term is often used in the context of public health and nutrition, particularly when discussing strategies to combat nutrient deficiencies in populations. It is more commonly encountered in scientific or technical discussions related to food science and nutrition. "},"example_sentences":[{"sentence":"The government implemented a program to add iron fortifiers to wheat flour.","translation":"政府は小麦粉に鉄強化剤を加えるプログラムを実施しました。","type":"noun","meaning_category":"強化剤"},{"sentence":"Vitamin D fortifiers are commonly added to milk to prevent deficiencies.","translation":"ビタミンD強化剤は、欠乏症を防ぐために牛乳によく添加されます。","type":"noun","meaning_category":"強化剤"},{"sentence":"The use of iodine fortifiers in salt has significantly reduced iodine deficiency disorders.","translation":"塩にヨウ素強化剤を使用することで、ヨウ素欠乏症が大幅に減少しました。","type":"noun","meaning_category":"強化剤"}]}