{"word":"orality","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"口頭性、口述性、口承性：文字を持たない文化における言語伝達の特徴、または文字文化における口頭コミュニケーションの重要性","english_definition":"The quality or state of being oral; reliance on spoken communication rather than writing, especially in a culture without writing. It can also refer to the characteristics of spoken communication in a literate culture.","examples":[{"sentence":"In societies with strong orality, stories and traditions are passed down through generations by word of mouth.","translation":"口承性が強い社会では、物語や伝統は口頭で世代から世代へと伝えられます。"},{"sentence":"The professor emphasized the importance of orality in ancient Greek culture.","translation":"教授は古代ギリシャ文化における口頭性の重要性を強調しました。"},{"sentence":"The transition from orality to literacy had a profound impact on human thought and society.","translation":"口頭性から識字への移行は、人間の思考と社会に大きな影響を与えました。"}],"collocations":["primary orality (第一次口頭性)","secondary orality (第二次口頭性)","oral culture (口承文化)","oral tradition (口頭伝承)","orality and literacy (口頭性と識字)"],"synonyms":["spoken language","verbal communication","oral tradition","word of mouth"],"antonyms":["literacy","written language","written communication"]},{"part_of_speech":"noun","definition":"(精神分析)口唇期：精神分析における発達段階の一つで、乳児が口を通じて世界を認識し、快感を得る時期","english_definition":"(Psychoanalysis) The oral stage: the first psychosexual stage in psychoanalytic theory, during which the infant's primary source of pleasure and exploration is through the mouth.","examples":[{"sentence":"Freud believed that fixations during the orality stage could lead to certain personality traits later in life.","translation":"フロイトは、口唇期における固着が、後の人生における特定の性格特性につながる可能性があると信じていました。"},{"sentence":"The concept of orality is central to understanding early childhood development in psychoanalytic theory.","translation":"口唇期の概念は、精神分析理論における幼児期の発達を理解する上で中心的なものです。"}],"collocations":["oral stage (口唇期)","oral fixation (口唇期固着)","psychoanalytic theory (精神分析理論)"],"synonyms":["oral stage"],"antonyms":[]}],"etymology":{"value":"Derived from 'oral' + '-ity'. 'Oral' comes from Latin 'os' (mouth).","priority":"★★☆"},"pronunciation":{"ipa":"/ɔːˈræləti/","syllables":"o-ral-i-ty"},"inflection":{"notes":"Noun, plural: oralities (rarely used)"},"usage_notes":{"explanation":"The term 'orality' has two main uses. In anthropology and cultural studies, it refers to the characteristics of cultures that rely primarily on spoken communication. In psychoanalysis, it refers to the oral stage of development. Context is crucial to understanding which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The orality of the argument was very convincing.","correct":"✓ The oral presentation of the argument was very convincing.","note":"'Orality' refers to the state or quality of being oral, not the presentation itself. Use 'oral presentation' instead."},{"incorrect":"✗ He had an orality problem as a child.","correct":"✓ He had an oral fixation as a child.","note":"In a psychoanalytic context, use 'oral fixation' to describe issues related to the oral stage."}],"priority":"★★☆"},"related_words":{"derivatives":["oral (adjective)","orally (adverb)"],"phrases":["oral tradition","oral history","oral culture","oral stage","oral fixation"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Orality' is a relatively specialized term. It refers to the characteristics of a culture or society that relies heavily on spoken communication, rather than written communication. It can also refer to the oral stage in psychoanalytic theory. Understanding the context is key to interpreting the meaning of the word. It is not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The study examined the impact of orality on the development of memory in pre-literate societies.","translation":"その研究は、文字を持たない社会における記憶の発達に対する口頭性の影響を調査しました。","type":"noun","meaning_category":"口頭性 (cultural)"},{"sentence":"According to Freudian theory, excessive thumb-sucking may indicate an unresolved issue during the stage of orality.","translation":"フロイト理論によれば、過度の指しゃぶりは、口唇期の未解決の問題を示している可能性があります。","type":"noun","meaning_category":"口唇期 (psychoanalytic)"}]}