{"word":"sabellid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"イバラカンムリゴカイ科の環形動物","english_definition":"Any annelid worm of the family Sabellidae, characterized by a crown of feathery radioles used for filter feeding.","examples":[{"sentence":"Sabellids are common inhabitants of marine environments.","translation":"イバラカンムリゴカイは海洋環境によく見られる生物です。"},{"sentence":"The sabellid uses its radioles to capture plankton from the water.","translation":"イバラカンムリゴカイは、その放射状の触手を使って水中のプランクトンを捕獲します。"}],"collocations":["sabellid worm","sabellid polychaete","tube-dwelling sabellid"],"synonyms":["feather duster worm","fanworm"],"antonyms":[]}],"etymology":{"value":"Derived from the scientific family name Sabellidae, which is based on the genus Sabella. The origin of Sabella is uncertain, but it may be derived from Latin.","priority":"★★☆"},"pronunciation":{"ipa":"/səˈbɛlɪd/","syllables":"sa-bel-lid"},"inflection":{"noun_plural":"sabellids"},"usage_notes":{"explanation":"'Sabellid' refers specifically to worms belonging to the Sabellidae family. They are known for their distinctive crown of radioles, which gives them a feather-duster or fan-like appearance. They typically live in tubes they construct from sand, mud, or secreted material.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ A sabellid is a type of mollusk.","correct":"✓ A sabellid is a type of annelid worm.","note":"Sabellids are annelids (segmented worms), not mollusks (like snails or clams)."},{"incorrect":"✗ Sabellids are harmful to coral reefs.","correct":"✓ Sabellids can be both beneficial and detrimental to coral reefs, depending on the species and context.","note":"While some sabellids can compete with corals for space or contribute to bioerosion, others may be harmless or even beneficial by filtering water."}],"priority":"★☆☆"},"related_words":{"derivatives":["Sabellidae (family name)","Sabella (genus name)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sabellid' is a scientific term referring to a specific family of marine worms. Understanding this term requires some background knowledge in marine biology or zoology. The key characteristic of sabellids is their crown of feathery radioles used for filter feeding. The term is primarily used in scientific contexts or specialized literature.","priority":"★★☆"},"example_sentences":[{"sentence":"The biologist identified the worm as a sabellid based on its feathery gills.","translation":"生物学者は、その虫の羽毛のような鰓に基づいて、イバラカンムリゴカイであると特定しました。","type":"noun","meaning_category":"環形動物"},{"sentence":"Many divers enjoy observing the colorful radioles of sabellids on coral reefs.","translation":"多くのダイバーは、サンゴ礁のイバラカンムリゴカイのカラフルな放射状の触手を観察するのを楽しんでいます。","type":"noun","meaning_category":"環形動物"}]}