{"word":"Undepreciated","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"減価償却されていない、価値が減っていない","english_definition":"Not having undergone depreciation; retaining its original value.","examples":[{"sentence":"The undepreciated asset was still worth its original purchase price.","translation":"その未減価償却資産は、依然として当初の購入価格の価値があった。"},{"sentence":"The company held several undepreciated properties.","translation":"その会社はいくつかの未減価償却物件を保有していた。"}],"collocations":["undepreciated asset","undepreciated cost","undepreciated value"],"synonyms":["non-depreciated","unreduced","unimpaired"],"antonyms":["depreciated","devalued","written-down"]}],"etymology":{"value":"\"Un-\" (not) + \"depreciated\" (past participle of \"depreciate\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndɪˈpriːʃieɪtɪd/","syllables":"un-de-pre-ci-a-ted"},"inflection":{"notes":"Adjective; no specific inflectional forms beyond comparative/superlative (more undepreciated, most undepreciated), which are rarely used."},"usage_notes":{"explanation":"The term 'undepreciated' is primarily used in accounting and finance to describe an asset whose value has not been reduced over time due to depreciation. It is the opposite of 'depreciated,' which indicates that an asset's value has decreased due to wear, tear, obsolescence, or other factors.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The undepreciated car was very old.","correct":"✓ The car had a high undepreciated value despite being old.","note":"While an asset can be old and undepreciated, the term refers to its accounting value, not its physical condition. The correction clarifies that the car's value, according to accounting records, remained high. "},{"incorrect":"✗ Undepreciated assets are always good.","correct":"✓ Undepreciated assets may indicate recent purchase or specific accounting practices, but their value should still be assessed.","note":"Undepreciated assets aren't inherently 'good' or 'bad.' They simply haven't been depreciated yet. This might be because they are new, or because the company uses a specific depreciation method. A proper assessment is always needed."}],"priority":"★☆☆"},"related_words":{"derivatives":["depreciate","depreciation","appreciation"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Undepreciated' is a technical term primarily used in accounting and finance. It describes the state of an asset whose value has not yet been reduced through depreciation. Understanding this term requires familiarity with accounting principles and the concept of depreciation itself. It's not a common word in everyday conversation."},"example_sentences":[{"sentence":"The company's balance sheet showed a significant amount of undepreciated capital equipment.","translation":"その会社の貸借対照表には、多額の未減価償却資本設備が示されていた。","type":"adjective","meaning_category":"accounting"},{"sentence":"The undepreciated cost of the building was used to calculate the property tax.","translation":"その建物の未減価償却原価は、固定資産税の計算に使用された。","type":"adjective","meaning_category":"finance"}]}