{"word":"tri-ester","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A compound containing three ester groups.","english_definition":"A chemical compound containing three ester groups, typically formed by the reaction of a triol (a compound with three hydroxyl groups) with three carboxylic acids.","examples":[{"sentence":"Glycerol tristearate is a tri-ester formed from glycerol and stearic acid.","translation":"トリステアリン酸グリセリルは、グリセロールとステアリン酸から形成されるトリエステルです。"},{"sentence":"Tri-esters are common in fats and oils.","translation":"トリエステルは脂肪や油によく見られます。"}],"collocations":["glycerol tri-ester","synthetic tri-ester","natural tri-ester"],"synonyms":["triglyceride"],"antonyms":[]}],"etymology":{"value":"The term 'tri-ester' is derived from 'tri-' meaning three and 'ester' referring to the ester functional group.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtraɪˌɛstər/","syllables":"tri-es-ter"},"inflection":{"noun_plural":"tri-esters"},"usage_notes":{"explanation":"Tri-esters are often encountered in the context of lipids, particularly triglycerides, which are tri-esters of glycerol. The properties of a tri-ester depend on the specific carboxylic acids that are esterified to the triol.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tri-ester have a high melting point.","correct":"✓ The tri-ester has a high melting point.","note":"'Tri-ester' is a singular noun, so it takes a singular verb ('has')."},{"incorrect":"✗ Tri-esters are form by reacting a triol with three carboxylic acid.","correct":"✓ Tri-esters are formed by reacting a triol with three carboxylic acids.","note":"The passive voice 'are formed' is required, and 'acids' should be plural."}],"priority":"★☆☆"},"related_words":{"derivatives":["ester","polyester","mono-ester","di-ester","triglyceride"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'tri-ester' is a technical term used in chemistry, specifically in the context of organic chemistry and biochemistry. It refers to a molecule that contains three ester functional groups. Understanding this term requires a basic knowledge of chemical nomenclature and functional groups. It is typically encountered in advanced chemistry courses or research settings."},"example_sentences":[{"sentence":"The synthesis of the novel tri-ester was achieved through a multi-step reaction.","translation":"新規トリエステルの合成は、多段階反応によって達成された。","type":"noun","meaning_category":"chemical synthesis"},{"sentence":"The properties of the tri-ester were investigated using spectroscopic methods.","translation":"トリエステルの特性は、分光法を用いて調査された。","type":"noun","meaning_category":"chemical analysis"}]}