{"word":"narrative form","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"物語形式、叙述形式","english_definition":"A way of presenting or structuring a story, account, or series of events. It encompasses elements such as point of view, plot structure, and style.","examples":[{"sentence":"The novel is written in the first-person narrative form.","translation":"その小説は一人称の物語形式で書かれている。"},{"sentence":"The documentary used a chronological narrative form to present the historical events.","translation":"そのドキュメンタリーは、歴史的な出来事を年代順の物語形式で提示した。"},{"sentence":"The author experimented with different narrative forms in his short stories.","translation":"その作家は短編小説でさまざまな物語形式を試した。"}],"collocations":["first-person narrative form (一人称の物語形式)","third-person narrative form (三人称の物語形式)","chronological narrative form (年代順の物語形式)","linear narrative form (直線的な物語形式)","non-linear narrative form (非線形的な物語形式)","stream-of-consciousness narrative form (意識の流れの物語形式)"],"synonyms":["storytelling method","narrative structure","narrative style","mode of narration","presentation of events"],"antonyms":["descriptive form","expository form","argumentative form"]},{"part_of_speech":"adjective","definition":"物語形式の、叙述形式の","english_definition":"Relating to or characteristic of a narrative form.","examples":[{"sentence":"The film adopts a narrative-form approach to exploring the protagonist's inner thoughts.","translation":"その映画は、主人公の内面の思考を探求するために物語形式のアプローチを採用している。"},{"sentence":"The poem's narrative-form structure makes it easy to follow the story.","translation":"その詩の物語形式の構造は、物語を追いやすくしている。"}],"collocations":["narrative-form approach (物語形式のアプローチ)","narrative-form structure (物語形式の構造)","narrative-form technique (物語形式の技法)"],"synonyms":["narrative","storytelling","descriptive","anecdotal"],"antonyms":["non-narrative","non-storytelling","analytical"]}],"etymology":{"value":"The term 'narrative' comes from the Latin 'narrare,' meaning 'to tell.' 'Form' refers to the structure or arrangement of something. Therefore, 'narrative form' refers to the structured way in which a story is told.","priority":"★★☆"},"pronunciation":{"ipa":"ˈnærətɪv fɔːrm","syllables":"nar-ra-tive form"},"inflection":{"notes":"'Narrative form' is a noun and does not have typical inflectional forms. The adjective form is 'narrative-form'."},"usage_notes":{"explanation":"'Narrative form' refers to the way a story is presented, including elements like point of view (first-person, third-person), plot structure (linear, non-linear), and style (stream-of-consciousness). It's used in literature, film, and other forms of storytelling to describe how the story unfolds. Understanding narrative form is crucial for analyzing and interpreting stories effectively.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The narrative form was very descriptive.","correct":"✓ The narrative form was very descriptive, focusing on vivid imagery.","note":"While a narrative can be descriptive, 'narrative form' itself refers to the overall structure and style of storytelling. The description is an element *within* the narrative form."},{"incorrect":"✗ He used narrative form to argue his point.","correct":"✓ He used a narrative form to illustrate his point.","note":"'Narrative form' is primarily for telling stories, not for argumentation. While a story can support an argument, the primary purpose of narrative form is to convey a story."}],"priority":"★★☆"},"related_words":{"derivatives":["narrative (noun, adjective): a story or account of events; relating to or characteristic of storytelling.","narrator (noun): the person who tells the story.","narration (noun): the act of telling a story.","narratology (noun): the study of narrative structure and storytelling techniques."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively frequent in academic and literary contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Narrative form' is a term used to describe how a story is structured and presented. It includes elements like the point of view (who is telling the story), the plot (the sequence of events), and the style of writing. Understanding narrative form helps you analyze and appreciate stories more deeply. For example, a story told in first-person narrative form gives you a personal perspective, while a story told in third-person narrative form provides a broader view of the events."},"example_sentences":[{"sentence":"The author chose a circular narrative form, beginning and ending the story in the same place.","translation":"作者は円環的な物語形式を選び、物語を同じ場所で始めて終わらせた。","type":"noun","meaning_category":"物語形式"},{"sentence":"The film's innovative narrative-form techniques captivated the audience.","translation":"その映画の革新的な物語形式の技法は観客を魅了した。","type":"adjective","meaning_category":"物語形式の"},{"sentence":"Experimenting with different narrative forms can lead to unique and engaging storytelling.","translation":"さまざまな物語形式を試すことは、ユニークで魅力的なストーリーテリングにつながる可能性がある。","type":"noun","meaning_category":"物語形式"},{"sentence":"The use of flashbacks is a common narrative-form device.","translation":"フラッシュバックの使用は一般的な物語形式の技法である。","type":"noun","meaning_category":"物語形式"}]}