{"word":"narrative-form","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"物語形式、叙述形式","english_definition":"A way of presenting or structuring a story, account, or series of events.","examples":[{"sentence":"The novel is written in a first-person narrative form.","translation":"その小説は一人称の物語形式で書かれている。"},{"sentence":"The documentary uses a chronological narrative form to trace the history of the company.","translation":"そのドキュメンタリーは、会社の歴史をたどるために年代順の叙述形式を使用している。"},{"sentence":"Experimentation with narrative form is a common feature of postmodern literature.","translation":"物語形式の実験は、ポストモダン文学の一般的な特徴である。"}],"collocations":["first-person narrative form (一人称の物語形式)","third-person narrative form (三人称の物語形式)","linear narrative form (直線的な物語形式)","non-linear narrative form (非直線的な物語形式)","traditional narrative form (伝統的な物語形式)","experimental narrative form (実験的な物語形式)"],"synonyms":["storytelling format","narrative structure","narrative style","account format","presentation of events"],"antonyms":["non-narrative form","descriptive form","analytical form"]}],"etymology":{"value":"The term 'narrative-form' is a compound word. 'Narrative' comes from the Latin 'narrare' (to tell), and 'form' refers to the structure or shape in which something is presented.","priority":"★★☆"},"pronunciation":{"ipa":"ˈnærətɪv fɔːrm","syllables":"nar-ra-tive form"},"inflection":{"notes":"This is a noun, so it has a plural form (narrative forms)."},"usage_notes":{"explanation":"'Narrative form' refers to the way a story is told, including the point of view, structure, and style. It can be linear (chronological) or non-linear (jumping between timelines), and can be presented in various styles (e.g., first-person, third-person, stream of consciousness). The choice of narrative form greatly affects how the story is perceived and understood by the audience.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The narrative form was very descriptive.","correct":"✓ The narrative form was very descriptive. / ✓ The writing was very descriptive.","note":"'Narrative form' refers to the overall structure, not the writing style. Descriptive writing can be a part of a narrative form, but they are not the same thing."},{"incorrect":"✗ He used a narrative form to analyze the data.","correct":"✓ He used a narrative to present the data.","note":"'Narrative form' is typically used for stories or accounts, not for data analysis. Using a narrative to present data is possible, but 'narrative form' is not the correct term."}],"priority":"★★☆"},"related_words":{"derivatives":["narrative (noun, adjective)","form (noun, verb)","narratology (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. More common in academic or literary contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Narrative form' is a term used to describe how a story is structured and presented. It includes elements such as the point of view (first-person, third-person), the order of events (chronological, non-linear), and the overall style of storytelling. Understanding narrative form is important for analyzing literature and other forms of storytelling. It is more commonly used in academic or literary discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The film's innovative narrative form challenged traditional storytelling conventions.","translation":"その映画の革新的な物語形式は、従来のストーリーテリングの慣習に挑戦した。","type":"noun","meaning_category":"storytelling"},{"sentence":"She chose a fragmented narrative form to reflect the character's fractured mental state.","translation":"彼女は、登場人物の分裂した精神状態を反映させるために、断片的な物語形式を選んだ。","type":"noun","meaning_category":"storytelling"},{"sentence":"The novel explores different narrative forms, including epistolary and stream of consciousness.","translation":"その小説は、書簡体や意識の流れなど、さまざまな物語形式を探求している。","type":"noun","meaning_category":"storytelling"}]}