{"word":"Carnivorousnesses","priority":"low","meanings":[{"part_of_speech":"noun","definition":"(rare, humorous) The state or quality of being carnivorous; instances of carnivorous behavior or tendencies. This is the plural form of 'carnivorousness'.","english_definition":"(rare, humorous) The plural form of 'carnivorousness', referring to the state or quality of being carnivorous, or instances of carnivorous behavior.","examples":[{"sentence":"The carnivorousnesses of the piranhas were well-documented in the nature film.","translation":"ピラニアの肉食性は、その自然ドキュメンタリー映画でよく記録されていた。"},{"sentence":"He jokingly attributed his cat's aggressive behavior to its inherent carnivorousnesses.","translation":"彼は冗談めかして、猫の攻撃的な行動は生来の肉食性によるものだと考えた。"}],"collocations":["exhibit carnivorousnesses","inherent carnivorousnesses","observe carnivorousnesses"],"synonyms":["predation","carnivorism","meat-eating habits"],"antonyms":["herbivorousness","vegetarianism"]}],"etymology":{"value":"Derived from 'carnivorousness', which is formed by adding the suffix '-ness' (denoting a state or quality) to 'carnivorous'. 'Carnivorous' comes from Latin 'carnivorus', meaning 'flesh-eating' (from 'caro' (flesh) + 'vorare' (to devour)).","priority":"★★☆"},"pronunciation":{"ipa":"/kɑːrˈnɪvərəsnəsɪz/","syllables":"car-niv-o-rous-ness-es"},"inflection":{"noun_plural":"Carnivorousnesses"},"usage_notes":{"explanation":"'Carnivorousnesses' is a rarely used plural form of 'carnivorousness'. 'Carnivorousness' itself is not very common, as the concept is usually described using other words or phrases. The plural form would be used to describe multiple instances or types of carnivorous behavior or tendencies. Its use is often humorous or intentionally exaggerated.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The carnivorousnesses are increasing in the jungle.","correct":"✓ Carnivory is increasing in the jungle. / ✓ The number of carnivorous animals is increasing in the jungle.","note":"It's more natural to use 'carnivory' or rephrase the sentence to avoid using the uncommon noun 'carnivorousnesses'."}],"priority":"★☆☆"},"related_words":{"derivatives":["carnivorous (adjective)","carnivore (noun)","carnivory (noun)","carnivorousness (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Carnivorousnesses' is a very rare and complex word. It is the plural form of 'carnivorousness,' which refers to the state or quality of being carnivorous. It is unlikely to be encountered in general use and is more likely to appear in specialized or humorous contexts. Understanding the root word 'carnivorous' is essential to deciphering its meaning. Due to its rarity, it is not typically included in language learning curricula."},"example_sentences":[{"sentence":"The scientist studied the various carnivorousnesses displayed by different species of predatory insects.","translation":"科学者は、さまざまな捕食性昆虫によって示される多様な肉食性を研究した。","type":"noun","meaning_category":"instances of carnivorous behavior"},{"sentence":"The book explored the evolutionary origins of carnivorousnesses in mammals.","translation":"その本は、哺乳類における肉食性の進化的起源を探求した。","type":"noun","meaning_category":"the state or quality of being carnivorous"}]}