{"word":"east-trending","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"東に向かう傾向がある、東方向に伸びる","english_definition":"Extending or moving in an easterly direction.","examples":[{"sentence":"The east-trending mountain range provides a natural barrier.","translation":"東方向に伸びる山脈は自然の障壁となっている。"},{"sentence":"The river follows an east-trending course before turning south.","translation":"その川は南に転じる前に、東に向かう流れをたどる。"},{"sentence":"The geologist studied the east-trending fault lines in the region.","translation":"地質学者はその地域の東方向に伸びる断層線を調査した。"}],"collocations":["east-trending fault","east-trending ridge","east-trending valley","east-trending coastline","east-trending road","east-trending path","east-trending slope"],"synonyms":["eastward","easterly","east-directed"],"antonyms":["west-trending","westward"],"notes":"Often used in geographical or geological contexts to describe the direction of a feature."}],"etymology":{"value":"Combination of 'east' (the direction) and 'trending' (having a general tendency or direction).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈiːstˌtrɛndɪŋ/","syllables":"east-trend-ing"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are not commonly used for 'east-trending'."},"usage_notes":{"explanation":"'East-trending' is primarily used in technical or descriptive contexts, such as geography, geology, or urban planning, to indicate the direction of a physical feature or a route. It specifies that the feature or route generally moves or extends towards the east.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The road is trending east.","correct":"✓ The road is east-trending. / ✓ The road trends east.","note":"'East-trending' is an adjective, so it should modify a noun. 'Trending east' is a verb phrase indicating the action of moving east."}],"priority":"★★☆"},"related_words":{"derivatives":["trend (noun, verb)","east (noun, adjective, adverb)"],"related_terms":["north-trending","south-trending","west-trending","northeast-trending","southeast-trending","northwest-trending","southwest-trending"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, used primarily in specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'East-trending' is a technical term typically used in specialized fields such as geography and geology. It describes something that extends or moves in an easterly direction. Understanding this term requires familiarity with directional terminology and its application in describing physical features or routes. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The satellite images revealed several east-trending geological formations.","translation":"衛星画像は、いくつかの東方向に伸びる地質構造を明らかにした。","type":"adjective","meaning_category":"direction"},{"sentence":"The new highway will follow an east-trending route across the valley.","translation":"新しい高速道路は、谷を横切る東に向かうルートをたどる予定だ。","type":"adjective","meaning_category":"direction"},{"sentence":"The archaeologists discovered an ancient east-trending trail.","translation":"考古学者は古代の東に向かう道を発見した。","type":"adjective","meaning_category":"direction"}]}