{"word":"high-emission","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"高排出の、排出量の多い","english_definition":"Producing a large amount of polluting gases or particles.","examples":[{"sentence":"The government is trying to discourage the use of high-emission vehicles.","translation":"政府は高排出車両の使用を抑制しようとしている。"},{"sentence":"High-emission industries are facing increasing pressure to reduce their carbon footprint.","translation":"排出量の多い産業は、二酸化炭素排出量を削減するよう圧力を強められている。"}],"collocations":["high-emission vehicle","high-emission industry","high-emission fuel","reduce high-emission","high-emission zone"],"synonyms":["polluting","carbon-intensive","dirty","environmentally damaging"],"antonyms":["low-emission","zero-emission","clean","eco-friendly"]}],"etymology":{"value":"A compound word formed by combining 'high' (indicating a large quantity or degree) and 'emission' (the act of producing or discharging something, especially gas or radiation).","priority":"★★★"},"pronunciation":{"ipa":"/ˌhaɪ ɪˈmɪʃən/","syllables":"high-e-mis-sion"},"inflection":{"notes":"This is an adjective, so it does not inflect."},"usage_notes":{"explanation":"'High-emission' is typically used to describe vehicles, industries, fuels, or processes that release a significant amount of pollutants into the atmosphere. It is often used in discussions about environmental policy, climate change, and sustainable development.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The car is high emission.","correct":"✓ The car is a high-emission vehicle.","note":"'High-emission' is an adjective that should be followed by a noun, such as 'vehicle,' 'industry,' or 'fuel.'"},{"incorrect":"✗ High emissions is bad for the environment.","correct":"✓ High-emission activities are bad for the environment.","note":"'High emissions' (plural noun) refers to the emissions themselves, while 'high-emission' (adjective) describes the source of the emissions."}],"priority":"★★☆"},"related_words":{"derivatives":["emission (noun)","emissions (plural noun)"],"phrases":["carbon emissions","greenhouse gas emissions"],"related_terms":["low-emission","zero-emission","carbon footprint","environmental impact","air pollution","climate change"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but increasing in use due to environmental concerns.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'High-emission' is a compound adjective used to describe something that produces a large amount of pollution. It is commonly used in discussions about environmental issues, such as climate change and air quality. The term is relatively straightforward to understand, but its usage is often found in more complex discussions about environmental policy and technology."},"example_sentences":[{"sentence":"The government is offering incentives to encourage people to switch to low-emission or zero-emission vehicles instead of **high-emission** cars.","translation":"政府は、高排出車ではなく、低排出車またはゼロ排出車に乗り換えるよう奨励するために、インセンティブを提供している。","type":"adjective","meaning_category":"Describing vehicles"},{"sentence":"The city introduced a **high-emission** zone to improve air quality in the downtown area.","translation":"市は、都心部の空気質を改善するために、高排出ゾーンを導入した。","type":"adjective","meaning_category":"Describing zones"},{"sentence":"Many **high-emission** power plants are being phased out in favor of renewable energy sources.","translation":"多くの高排出発電所が、再生可能エネルギー源に取って代わられている。","type":"adjective","meaning_category":"Describing power plants"}]}