{"word":"squeamishness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"潔癖症、神経過敏、吐き気を催しやすいこと、嫌悪感","english_definition":"The state or quality of being easily nauseated, disgusted, or morally fastidious.","examples":[{"sentence":"His squeamishness prevented him from becoming a surgeon.","translation":"彼の潔癖症が、彼が外科医になることを妨げた。"},{"sentence":"She overcame her squeamishness and watched the operation.","translation":"彼女は嫌悪感を克服して手術を見学した。"},{"sentence":"The movie's graphic violence tested the audience's squeamishness.","translation":"映画の生々しい暴力描写は、観客の神経過敏さを試した。"}],"collocations":["moral squeamishness (道徳的な潔癖さ)","overcome squeamishness (潔癖さを克服する)","feeling of squeamishness (嫌悪感)"],"synonyms":["fastidiousness","delicacy","scrupulousness","queasiness","nausea"],"antonyms":["stomach for","tolerance","callousness"]}],"etymology":{"value":"Derived from 'squeamish,' which originated in the mid-18th century. The exact origin of 'squeamish' is uncertain, but it may be related to 'squeak' or other words suggesting aversion or discomfort. The suffix '-ness' is added to form the noun.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskwiːmɪʃnəs/","syllables":"squeam-ish-ness"},"inflection":{"noun_plural":"squeamishnesses (rarely used)"},"usage_notes":{"explanation":"'Squeamishness' refers to a sensitivity that can manifest physically (e.g., nausea at the sight of blood) or morally (e.g., discomfort with certain topics or actions). It implies a heightened level of aversion or disgust compared to typical reactions. It can also describe a general tendency to be easily offended or shocked.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed squeamishness for the idea.","correct":"✓ He showed squeamishness towards the idea.","note":"Use 'towards' or 'about' to indicate the object of squeamishness."},{"incorrect":"✗ Her squeamishness made her to faint.","correct":"✓ Her squeamishness made her faint.","note":"'Make' is followed by the base form of the verb without 'to'."}],"priority":"★★☆"},"related_words":{"derivatives":["squeamish (adjective)","squeamishly (adverb)"],"phrasal_verbs":[],"related_concepts":["prudishness","prudery","delicacy","sensibility"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Squeamishness' is a more advanced term describing a state of being easily disgusted or morally sensitive. It's often used to describe someone who is easily nauseated by unpleasant sights or who has very strong moral objections to certain behaviors. Understanding this word requires a good grasp of abstract concepts and nuanced emotional responses.","priority":"★★☆"},"example_sentences":[{"sentence":"The surgeon had to overcome his own squeamishness to perform the operation effectively.","translation":"外科医は手術を効果的に行うために、自身の潔癖さを克服する必要があった。","type":"general","meaning_category":"general"},{"sentence":"Her squeamishness about violence made it difficult for her to watch action movies.","translation":"彼女の暴力に対する嫌悪感から、アクション映画を見るのが困難だった。","type":"general","meaning_category":"general"},{"sentence":"Some people find his moral squeamishness to be admirable, while others see it as impractical.","translation":"彼の道徳的な潔癖さを賞賛する人もいれば、非現実的だと考える人もいる。","type":"general","meaning_category":"general"}]}