{"word":"impassionately","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"冷静に、感情を込めずに、客観的に","english_definition":"without passion; without strong feeling; calmly; objectively","examples":[{"sentence":"He spoke impassionately about the need for reform.","translation":"彼は改革の必要性を冷静に語った。"},{"sentence":"She argued her case impassionately, presenting the facts without emotion.","translation":"彼女は感情を交えずに事実を提示し、冷静に自分の主張を述べた。"},{"sentence":"The judge listened impassionately to the testimony.","translation":"裁判官は証言を冷静に聞いた。"}],"collocations":["speak impassionately","argue impassionately","listen impassionately","act impassionately","judge impassionately"],"synonyms":["calmly","coolly","objectively","dispassionately","unemotionally","indifferently","apathetically"],"antonyms":["passionately","emotionally","fervently","ardently","zealously"]}],"etymology":{"value":"\"Impassionately\" is formed by adding the suffix \"-ly\" to the adjective \"impassionate.\" \"Impassionate\" itself is formed by adding the prefix \"im-\" (meaning \"not\") to \"passionate.\" \"Passionate\" comes from the Latin word \"passio,\" meaning \"suffering, emotion, passion.\" Thus, \"impassionately\" literally means \"without passion or emotion.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ɪmˈpæʃənətli/","syllables":"im-pash-uh-nate-ly"},"inflection":{"notes":"As an adverb, \"impassionately\" does not have different forms for gender, number, or case."},"usage_notes":{"explanation":"\"Impassionately\" describes actions or speech that are devoid of strong emotion or personal feeling. It suggests a state of calmness, objectivity, and detachment. It is often used to describe someone who is presenting facts or arguments in a rational and unbiased manner, or someone who is observing or reacting to a situation without getting emotionally involved. The word can sometimes imply a lack of empathy or concern, depending on the context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He impassionately denied the allegations.","correct":"He vehemently/passionately denied the allegations.","note":"\"Impassionately\" means without passion, so it's contradictory to use it with a verb like \"deny\" when a strong, emotional denial is intended. Use \"passionately\" or \"vehemently\" instead."},{"incorrect":"She felt impassionately about the cause.","correct":"She felt passionately about the cause.","note":"\"Impassionately\" describes a lack of feeling, so it's incorrect to use it to describe strong feelings. Use \"passionately\" instead."}],"priority":"★★☆"},"related_words":{"derivatives":["impassionate (adjective): not showing or feeling emotion","passion (noun): strong feeling or emotion","passionate (adjective): having or expressing strong emotions"],"antonyms":["passionately (adverb): with strong feeling or emotion","emotionally (adverb): in an emotional way"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"impassionately\" means to do something without showing strong feelings or emotions. It suggests a calm, objective, and detached manner. It is the opposite of doing something \"passionately,\" which means doing it with a lot of enthusiasm and emotion. This word is not very common and is typically used in formal contexts."},"example_sentences":[{"sentence":"The lawyer presented the evidence impassionately to the jury.","translation":"弁護士は証拠を冷静に陪審員に提示した。","type":"general"},{"sentence":"She spoke impassionately about the need for economic reform, focusing on the data and statistics.","translation":"彼女は経済改革の必要性について、データと統計に焦点を当てて冷静に語った。","type":"general"},{"sentence":"He listened impassionately to his friend's story, offering advice without getting emotionally involved.","translation":"彼は感情的にならずにアドバイスをしながら、友人の話を冷静に聞いた。","type":"general"}]}