{"word":"compensable","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(法律)補償可能な、賠償可能な","english_definition":"Eligible for compensation; able to be compensated for loss, injury, or damage.","examples":[{"sentence":"The injury was deemed compensable under the worker's compensation law.","translation":"その怪我は労働者災害補償法の下で補償可能と判断された。"},{"sentence":"Only direct damages are compensable; indirect damages are not.","translation":"直接的な損害のみが補償可能であり、間接的な損害は補償されません。"},{"sentence":"Whether the loss is compensable depends on the specific terms of the insurance policy.","translation":"その損失が補償可能かどうかは、保険契約の具体的な条項によります。"}],"collocations":["compensable injury (補償可能な怪我)","compensable loss (補償可能な損失)","compensable damage (補償可能な損害)","compensable claim (補償可能な請求)","deemed compensable (補償可能とみなされる)"],"synonyms":["reimbursable","indemnifiable","recoverable","redressable"],"antonyms":["noncompensable","irrecoverable","unreimbursable"]}],"etymology":{"value":"From 'compensate' + '-able'. 'Compensate' comes from Latin 'compensare', meaning 'to weigh one thing against another, counterbalance, make amends'. The suffix '-able' indicates capability or suitability.","priority":"★★☆"},"pronunciation":{"ipa":"/kəmˈpɛnsəbəl/","syllables":"com-pen-sa-ble"},"inflection":{"notes":"Adjectives in English do not inflect for gender or number. Comparative and superlative forms are 'more compensable' and 'most compensable', respectively."},"usage_notes":{"explanation":"'Compensable' is primarily used in legal and insurance contexts. It describes a loss, injury, or damage for which someone is legally entitled to receive compensation. The term implies that specific criteria must be met for the loss to qualify for compensation, as determined by laws, contracts, or policies. It is often used in discussions about worker's compensation, personal injury claims, and insurance claims.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The feeling of sadness is compensable.","correct":"✓ The emotional distress is compensable.","note":"While emotional distress can sometimes be compensable, 'sadness' itself is not typically a compensable loss. It's more accurate to use terms like 'emotional distress' or 'pain and suffering' in legal contexts."},{"incorrect":"✗ He is compensable for his hard work.","correct":"✓ He is compensated for his hard work.","note":"'Compensable' describes the *thing* that *can be compensated*. The person *receives compensation*. The correct verb form is 'compensated'."},{"incorrect":"✗ The accident was compensable, so he won't have to pay anything.","correct":"✓ The accident was compensable, so he will receive compensation for his damages.","note":"'Compensable' means that compensation *can be* paid, not that payment is avoided. The phrase implies that the injured party will receive money to cover their losses."}],"priority":"★★☆"},"related_words":{"derivatives":["compensate (verb: 補償する、賠償する)","compensation (noun: 補償、賠償)","noncompensable (adjective: 補償不能な)"],"legal_terms":["damages (損害賠償金)","liability (法的責任)","indemnity (免責、補償)","restitution (原状回復、返還)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in legal and insurance contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Compensable' is a technical term primarily used in legal and insurance settings. It means that something (like an injury or loss) is eligible for compensation, meaning someone is entitled to receive money or other benefits to make up for the harm they suffered. To understand this word, you need to know the basics of legal and insurance concepts. It's not a word you'd typically use in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The court determined that the plaintiff's medical expenses were compensable.","translation":"裁判所は、原告の医療費が補償可能であると判断した。","type":"adjective","meaning_category":"legal"},{"sentence":"Under the terms of the contract, only certain types of losses are considered compensable.","translation":"契約条件に基づき、特定の種類の損失のみが補償対象とみなされます。","type":"adjective","meaning_category":"insurance"},{"sentence":"The employee's injury was compensable under the company's worker's compensation policy.","translation":"従業員の怪我は、会社の労災保険の規定により補償対象となった。","type":"adjective","meaning_category":"employment law"}]}