{"word":"Witchwife","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(ファンタジー) 魔法使いの妻、魔女の妻","english_definition":"(Fantasy) A wife of a wizard or male witch; a female witch who is married.","examples":[{"sentence":"The witchwife lived in a cottage deep in the woods.","translation":"その魔女の妻は森の奥深くの小屋に住んでいた。"},{"sentence":"He was a powerful wizard, and his witchwife was equally skilled in magic.","translation":"彼は強力な魔法使いで、彼の魔女の妻も同様に魔法の腕に長けていた。"}],"collocations":["powerful witchwife","skilled witchwife"],"synonyms":["sorceress","enchantress","spellcaster"],"antonyms":["wizard","warlock"]}],"etymology":{"value":"A compound word formed from \"witch\" and \"wife\".","priority":"★★★"},"pronunciation":{"ipa":"/ˈwɪtʃwaɪf/","syllables":"witch-wife"},"inflection":{"noun_plural":"witchwives"},"usage_notes":{"explanation":"The term \"witchwife\" is primarily used in fantasy literature and games to denote the wife of a male witch or wizard, or a female witch who is married. It is not a commonly used term in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a witchwife, so she must be evil.","correct":"✓ She is a witchwife, but that doesn't necessarily mean she is evil.","note":"Being a witchwife does not automatically imply evil. It simply indicates a female witch who is married or the wife of a male witch."}],"priority":"★☆☆"},"related_words":{"derivatives":["witch","wife","wizard","warlock"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'witchwife' is a relatively uncommon term, primarily found in fantasy contexts. It is a compound word, making it easy to understand its meaning: a female witch who is married or the wife of a male witch. Due to its specific usage and low frequency, familiarity with fantasy literature may be helpful for comprehension."},"example_sentences":[{"sentence":"The old stories told of a powerful witchwife who could control the weather.","translation":"古い物語は、天候を操ることができる強力な魔女の妻について語っていた。","type":"noun","meaning_category":"Fantasy"},{"sentence":"He sought the advice of the wise witchwife who lived on the mountain.","translation":"彼は山に住む賢い魔女の妻に助言を求めた。","type":"noun","meaning_category":"Fantasy"}]}