{"word":"permutation-sensitive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"順列に依存する、順列を区別する","english_definition":"Describes a function, algorithm, or system whose output or behavior changes depending on the order (permutation) of its inputs.","examples":[{"sentence":"The hash function is permutation-sensitive; changing the order of the input bytes results in a different hash value.","translation":"そのハッシュ関数は順列に依存します。入力バイトの順序を変更すると、異なるハッシュ値が得られます。"},{"sentence":"Unlike a bag-of-words model, a sequence-to-sequence model is permutation-sensitive because it considers the order of words.","translation":"bag-of-wordsモデルとは異なり、sequence-to-sequenceモデルは単語の順序を考慮するため、順列に依存します。"},{"sentence":"Some cryptographic algorithms are designed to be permutation-sensitive to enhance security.","translation":"一部の暗号化アルゴリズムは、セキュリティを強化するために順列に依存するように設計されています。"}],"collocations":["permutation-sensitive function","permutation-sensitive algorithm","permutation-sensitive model","permutation-sensitive hash","permutation-sensitive encryption"],"synonyms":["order-dependent","sequence-dependent","position-dependent"],"antonyms":["permutation-invariant","order-independent","sequence-insensitive","position-independent"]}],"etymology":{"value":"The term is formed by combining 'permutation' (an arrangement of objects in a specific order) with 'sensitive' (easily affected or influenced).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɜːrmjuˈteɪʃən ˈsɛnsətɪv/","syllables":"per-mu-ta-tion sen-si-tive"},"inflection":{"notes":"This is an adjective, so it has comparative and superlative forms (more permutation-sensitive, most permutation-sensitive), but these are rarely used."},"usage_notes":{"explanation":"'Permutation-sensitive' is used in technical contexts, particularly in computer science, mathematics, and cryptography, to describe systems or functions where the order of inputs matters. A permutation-sensitive system will produce different results if the same inputs are provided in a different order. This is in contrast to permutation-invariant systems, where the order of inputs does not affect the output.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The function is very sensitive, so it must be permutation-sensitive.","correct":"✓ The function is very sensitive, and it is also permutation-sensitive.","note":"'Sensitive' alone doesn't imply permutation sensitivity. Permutation sensitivity specifically refers to sensitivity to the order of inputs."},{"incorrect":"✗ This algorithm is permutation-sensitive, so it's not reliable.","correct":"✓ This algorithm is permutation-sensitive, which is necessary for its intended purpose.","note":"Permutation sensitivity is not inherently good or bad; it depends on the application. Some algorithms require it."}],"priority":"★☆☆"},"related_words":{"derivatives":["permutation (名詞: 順列)","sensitive (形容詞: 敏感な)","sensitivity (名詞: 敏感さ)","permutation-insensitivity (名詞: 順列不変性)","permutation-invariant (形容詞: 順列不変の)"],"related_concepts":["order of operations","sequence","algorithm","data structure","cryptography","hashing"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Technical vocabulary, not commonly used in general conversation)","frequency_google_ngram":"Low frequency (technical term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Permutation-sensitive' is a technical term used to describe something that is affected by the order of its inputs. If a system is permutation-sensitive, changing the order of the inputs will change the output. This term is most often used in fields like computer science, mathematics, and cryptography. Understanding this term requires familiarity with the concept of permutations (different arrangements of the same items)."},"example_sentences":[{"sentence":"The image recognition algorithm is not permutation-sensitive; it identifies the object regardless of the order in which the pixels are analyzed.","translation":"その画像認識アルゴリズムは順列に依存しません。ピクセルが分析される順序に関係なく、オブジェクトを識別します。","type":"adjective","meaning_category":"順列に依存する"},{"sentence":"The digital signature scheme is designed to be highly permutation-sensitive to prevent forgery.","translation":"そのデジタル署名スキームは、偽造を防ぐために、高度に順列に依存するように設計されています。","type":"adjective","meaning_category":"順列に依存する"},{"sentence":"Because the neural network is permutation-sensitive, it can distinguish between 'cat eats mouse' and 'mouse eats cat'.","translation":"ニューラルネットワークは順列に依存するため、「猫がネズミを食べる」と「ネズミが猫を食べる」を区別できます。","type":"adjective","meaning_category":"順列に依存する"}]}