{"word":"sand-finished","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"砂仕上げの、サンドブラスト仕上げの","english_definition":"Having a surface that has been treated with sandblasting or a similar process to create a textured, matte appearance.","examples":[{"sentence":"The sand-finished aluminum case gives the laptop a sleek, modern look.","translation":"サンドブラスト仕上げのアルミニウムケースは、そのラップトップに洗練されたモダンな外観を与える。"},{"sentence":"The architect chose sand-finished concrete for the exterior walls of the building.","translation":"建築家は建物の外壁に砂仕上げのコンクリートを選んだ。"},{"sentence":"The craftsman used a sand-finished technique to create a unique texture on the wooden sculpture.","translation":"職人は砂仕上げの技術を使って、木製の彫刻に独特の質感を作り出した。"}],"collocations":["sand-finished aluminum","sand-finished concrete","sand-finished surface","sand-finished wood","sand-finished metal"],"synonyms":["sandblasted","matte","textured","frosted"],"antonyms":["polished","glossy","smooth"]}],"etymology":{"value":"A compound adjective formed by combining 'sand' (referring to the use of sand in the finishing process) and 'finished' (indicating that the process has been completed).","priority":"★★★"},"pronunciation":{"ipa":"/ˈsændˌfɪnɪʃt/","syllables":"sand-fin-ished"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Sand-finished' describes a surface that has been treated with a process, often sandblasting, to create a matte or textured appearance. This finish is often used for aesthetic purposes, providing a non-reflective surface and a tactile feel. The term is commonly used in manufacturing, construction, and design contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The sand finished table.","correct":"✓ The sand-finished table.","note":"The hyphen is important to indicate that 'sand' and 'finished' are combined to form a single adjective describing the table."},{"incorrect":"✗ The surface was sand finish.","correct":"✓ The surface was sand-finished.","note":"'Sand-finished' is an adjective, so it should be used to describe a noun. 'Sand finish' is not grammatically correct in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["sandblast (verb, noun)","finish (verb, noun)","sanded (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'sand-finished' is a technical term used to describe a surface that has been treated with sandblasting or a similar process to create a textured, matte appearance. Understanding this term requires familiarity with manufacturing and design contexts where surface finishes are discussed. It is not a commonly used term in everyday conversation."},"example_sentences":[{"sentence":"The sand-finished steel frame is both durable and aesthetically pleasing.","translation":"砂仕上げの鋼鉄フレームは耐久性があり、見た目にも美しい。","type":"example","meaning_category":"description"},{"sentence":"The artist preferred sand-finished canvas for its ability to hold paint well.","translation":"アーティストは、塗料の保持力が高い砂仕上げのキャンバスを好んだ。","type":"example","meaning_category":"application"},{"sentence":"The product line features several items with a sand-finished coating.","translation":"その製品ラインには、砂仕上げのコーティングが施されたアイテムがいくつかある。","type":"example","meaning_category":"feature"}]}