{"word":"pingre","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(slang, humorous) A small, insignificant amount or thing; a trifle.","english_definition":"(slang, humorous) A small, insignificant amount or thing; a trifle. Often used in a self-deprecating or ironic way.","examples":[{"sentence":"I don't have much to offer, just a pingre of knowledge on the subject.","translation":"私には提供できるものはあまりありません。その件についてほんの少しの知識があるだけです。"},{"sentence":"He gave me a pingre of his dessert, barely a spoonful.","translation":"彼は私にデザートをほんの少しだけくれました。スプーン一杯にも満たない量でした。"}],"collocations":["a pingre of","just a pingre","only a pingre"],"synonyms":["iota","smidgen","whit","trifle","modicum","bit","crumb","dash","speck"],"antonyms":["abundance","profusion","wealth","plethora","surfeit"]},{"part_of_speech":"adjective","definition":"(slang, humorous) Small, insignificant, or trifling.","english_definition":"(slang, humorous) Small, insignificant, or trifling. Used to describe something of little importance or value.","examples":[{"sentence":"The difference between the two options is pingre; it doesn't really matter which one we choose.","translation":"二つの選択肢の違いはごくわずかです。どちらを選んでも大差ありません。"},{"sentence":"He offered a pingre apology, barely audible.","translation":"彼はほとんど聞こえないほどの小さな声で、ほんのわずかな謝罪をしました。"}],"collocations":["pingre amount","pingre difference","pingre apology","pingre detail"],"synonyms":["minuscule","insignificant","negligible","trivial","paltry","scant","meager","slight"],"antonyms":["substantial","significant","considerable","notable","important"]}],"etymology":{"value":"Likely a humorous or invented word, possibly a blend of 'ping' (a small sound) and 'meagre' or a similar word suggesting smallness. Its origin is informal and likely recent.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈpɪŋɡər/","syllables":"ping-ger"},"inflection":{"adjective_forms":{"comparative":"more pingre","superlative":"most pingre"},"noun_plural":"pingres"},"usage_notes":{"explanation":"'Pingre' is a slang term, used humorously to downplay the significance or size of something. It is not a standard English word and should be used with caution, primarily in informal contexts where the speaker intends to be lighthearted or self-deprecating. Its use can add a playful or ironic tone to the conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pingre was enormous.","correct":"✓ The pingre was tiny.","note":"'Pingre' implies smallness, so it should not be used to describe something large or significant."},{"incorrect":"✗ Use pingre amounts of caution when handling dangerous chemicals.","correct":"✓ Use extreme caution when handling dangerous chemicals.","note":"In serious or formal contexts, use standard terms like 'small,' 'slight,' or 'minimal' instead of the slang term 'pingre'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A (Slang, not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Very low frequency (likely a recent slang term with limited usage)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Pingre' is a slang term used humorously to describe something very small or insignificant. Because it is not a standard word, it is best used in informal settings where the speaker intends to be playful or self-deprecating. Understanding its meaning requires a good grasp of English slang and an awareness of context to avoid miscommunication."},"example_sentences":[{"sentence":"I only have a pingre of patience left for his excuses.","translation":"彼の言い訳にはもうほとんど我慢できません。","type":"noun","meaning_category":"small amount"},{"sentence":"The impact of the new policy was pingre at best.","translation":"新しい政策の影響はせいぜいごくわずかでした。","type":"adjective","meaning_category":"insignificant"}]}