{"word":"orbitelous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(生物学)目の周りの骨の隆起が大きい、または発達している","english_definition":"(zoology) Having prominent or well-developed bony ridges around the eyes.","examples":[{"sentence":"The fossil skull exhibited orbitelous features, indicating a specific evolutionary adaptation.","translation":"その化石の頭蓋骨は、目の周りの骨の隆起が大きく発達している特徴を示しており、特定の進化的適応を示唆していた。"}],"collocations":["orbitelous skull","orbitelous features","highly orbitelous"],"synonyms":["supraorbital","prominent-browed"],"antonyms":["non-orbitelous","flat-browed"]}],"etymology":{"value":"Derived from the Latin 'orbita' (eye socket) and '-elous' (having or characterized by).","priority":"★★★"},"pronunciation":{"ipa":"/ɔːrˈbɪtələs/","syllables":"or-bi-te-lous"},"inflection":{"notes":"Adjective, comparative: more orbitelous, superlative: most orbitelous"},"usage_notes":{"explanation":"The term 'orbitelous' is primarily used in zoology and paleontology to describe skulls or facial structures with pronounced bony ridges above the eyes. It is often used to differentiate between species or to indicate specific evolutionary traits related to eye protection or muscle attachment.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The orbitelous animal was very friendly.","correct":"✓ The animal had orbitelous features.","note":"'Orbitelous' describes a specific anatomical feature, not a general characteristic of an animal's behavior or temperament."}],"priority":"★★☆"},"related_words":{"derivatives":["orbita (noun: eye socket)","orbital (adjective: relating to the eye socket)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very Low Frequency - Specialized scientific term.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Orbitelous' is a specialized term used in the fields of zoology and paleontology. It describes a specific anatomical feature: the presence of prominent bony ridges around the eyes. This term is not commonly used in everyday language and is typically found in scientific literature or academic discussions related to animal anatomy and evolution. Understanding this term requires a background in biology or a related field."},"example_sentences":[{"sentence":"The primate skull was described as orbitelous, with pronounced supraorbital ridges.","translation":"その霊長類の頭蓋骨は、目の上の隆起が顕著で、目の周りの骨の隆起が大きいと記述された。","type":"adjective","meaning_category":"anatomical feature"},{"sentence":"Orbitelous features are common in certain species of early hominids.","translation":"目の周りの骨の隆起が大きい特徴は、初期の人類の一部の種によく見られる。","type":"adjective","meaning_category":"species characteristic"}]}