{"word":"Ornithography","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"鳥類誌、鳥類図譜；鳥類に関する記述","english_definition":"A description of birds; a treatise on birds.","examples":[{"sentence":"His ornithography was a comprehensive study of the birds of the region.","translation":"彼の鳥類誌は、その地域の鳥類に関する包括的な研究だった。"},{"sentence":"The ornithography included detailed illustrations of each species.","translation":"その鳥類図譜には、各種類の詳細なイラストが含まれていた。"}],"collocations":["comprehensive ornithography","regional ornithography","illustrated ornithography"],"synonyms":["ornithology","avian description","avian treatise"],"antonyms":[]}],"etymology":{"value":"Derived from Greek 'ornithos' (bird) + 'graphy' (writing, description).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɔːrnɪˈθɒɡrəfi/","syllables":"or-ni-thog-ra-phy"},"inflection":{"noun_plural":"ornithographies"},"usage_notes":{"explanation":"'Ornithography' is a relatively uncommon term, often used interchangeably with 'ornithology,' though 'ornithology' is more widely used to refer to the scientific study of birds. 'Ornithography' specifically emphasizes the descriptive aspect, particularly written accounts and illustrations of birds.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is studying ornithography, so he is a ornithographer.","correct":"✓ He is studying ornithography, so he is an ornithologist.","note":"The person who studies ornithography is called an ornithologist, not an ornithographer."}],"priority":"★☆☆"},"related_words":{"derivatives":["ornithographic (adjective)"],"related_terms":["ornithology (鳥類学)","avian (鳥の)","avifauna (鳥類相)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ornithography' is a specialized term primarily encountered in academic or historical contexts related to the study of birds. It refers specifically to the descriptive aspect of birds, often involving detailed written accounts and illustrations. While closely related to 'ornithology,' which is the broader scientific study of birds, 'ornithography' emphasizes the descriptive and illustrative elements. Understanding this term is valuable for those engaged in ornithological research or historical studies of natural history."},"example_sentences":[{"sentence":"The early ornithography of the region was based on anecdotal observations.","translation":"その地域の初期の鳥類誌は、逸話的な観察に基づいていた。","type":"general","meaning_category":"鳥類誌・鳥類図譜"},{"sentence":"The museum holds a rare collection of historical ornithography.","translation":"その博物館は、歴史的な鳥類図譜の貴重なコレクションを所蔵している。","type":"general","meaning_category":"鳥類誌・鳥類図譜"}]}