{"word":"Mandle","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(造語)男性用キャンドル。男性的な香りがつけられたり、男性向けにデザインされたキャンドル。","english_definition":"(Neologism) A candle marketed towards men, often featuring masculine scents or designs.","examples":[{"sentence":"He bought a Mandle with a leather and tobacco scent for his office.","translation":"彼はオフィス用に革とタバコの香りのマンドルを買った。"},{"sentence":"Mandles are becoming a popular gift for men who enjoy home decor.","translation":"マンドルは、インテリアを楽しむ男性への贈り物として人気が高まっている。"}],"collocations":["masculine candle","candle for men","scented candle"],"synonyms":["man candle"],"antonyms":["feminine candle"],"notes":"主にマーケティング用語として使われる。"}],"etymology":{"value":"'Man' (男性) と 'Candle' (キャンドル) を組み合わせたかばん語。","priority":"★★★"},"pronunciation":{"ipa":"/ˈmændəl/","syllables":"Man-dle"},"inflection":{"noun_plural":"Mandles"},"usage_notes":{"explanation":"'Mandle' は比較的新しい言葉で、主にマーケティング目的で使用されます。男性が好むとされる香り（例えば、革、木、スパイスなど）や、男性的なデザインのキャンドルを指します。一般的なキャンドルと区別するために使われることがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I burned a mandle to relax after work.","correct":"✓ I burned a candle to relax after work. / ✓ I burned a Mandle to relax after work.","note":"'Mandle' は特定の男性向けキャンドルを指す場合にのみ使用します。一般的なキャンドルを指す場合は 'candle' を使用します。"},{"incorrect":"✗ She gave him a mandle for Valentine's Day, but he didn't like it.","correct":"✓ She gave him a Mandle for Valentine's Day, but he didn't like it.","note":"固有名詞として扱う場合、大文字で始めるのが適切です。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_concepts":["candle","fragrance","masculinity","marketing"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"低頻度 (Low frequency) - 比較的新しい造語のため、一般的な語彙集にはまだ掲載されていないことが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mandle' is a relatively new term, a portmanteau of 'man' and 'candle,' used in marketing to describe candles specifically targeted towards men. These candles often feature scents and designs considered more masculine. While not yet a widely recognized word, its meaning is generally understood in contexts related to home decor and gift-giving. It is important to note that this term is primarily used for marketing purposes and may not be considered a standard English word.","priority":"★★☆"},"example_sentences":[{"sentence":"The store had a whole section dedicated to Mandles, with scents like cedarwood and bourbon.","translation":"その店にはマンドル専用のコーナーがあり、杉の木やバーボンのような香りが揃っていた。","type":"noun","meaning_category":"男性用キャンドル"},{"sentence":"He thought giving Mandles as groomsmen gifts would be a unique touch.","translation":"彼は、新郎の付き添い人への贈り物としてマンドルを贈るのはユニークなアイデアだと思った。","type":"noun","meaning_category":"男性用キャンドル"}]}