{"word":"reicing","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(航空)再着氷防止処理をする","english_definition":"To apply a de-icing or anti-icing fluid to an aircraft again, usually after a previous application has worn off or been compromised.","examples":[{"sentence":"The plane had to undergo reicing before takeoff due to the continued snowfall.","translation":"継続的な降雪のため、飛行機は離陸前に再着氷防止処理を受ける必要があった。"},{"sentence":"After a delay, the aircraft required reicing because the holdover time had expired.","translation":"遅延後、ホールドオーバー時間が経過したため、航空機は再着氷防止処理を必要とした。"}],"collocations":["aircraft reicing","reicing procedure","reicing fluid","reicing truck"],"synonyms":["de-icing","anti-icing"],"antonyms":[]}],"etymology":{"value":"The word 'reicing' is formed by adding the prefix 're-' (meaning 'again') to the word 'icing', which refers to the formation of ice on a surface.","priority":"★★★"},"pronunciation":{"ipa":"/riːˈaɪsɪŋ/","syllables":"re-ic-ing"},"inflection":{"verb_forms":{"present_simple":["reice","reices"],"past_simple":"reiced","past_participle":"reiced","present_participle":"reicing"}},"usage_notes":{"explanation":"'Reicing' specifically refers to the act of applying de-icing or anti-icing fluids to an aircraft more than once. This is a common procedure in cold weather conditions where ice can form rapidly on the wings and other surfaces, affecting the aircraft's aerodynamics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The reicing was done by the pilots.","correct":"✓ The reicing was done by the ground crew.","note":"Reicing is typically performed by ground crew personnel who are trained in the application of de-icing and anti-icing fluids."},{"incorrect":"✗ Reicing is optional in cold weather.","correct":"✓ Reicing is often required in cold weather to ensure safe takeoff.","note":"Reicing is often a mandatory safety procedure when there is a risk of ice formation on the aircraft."}],"priority":"★★☆"},"related_words":{"derivatives":["ice","icing","de-icing","anti-icing"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Reicing' is a specialized term used in aviation. It refers to the process of applying de-icing or anti-icing fluids to an aircraft more than once, typically when conditions require additional protection against ice formation. Understanding this term requires familiarity with aviation procedures and cold weather operations."},"example_sentences":[{"sentence":"The pilot requested **reicing** after noticing ice accumulation on the wings.","translation":"パイロットは翼に氷の蓄積に気づいた後、再着氷防止処理を要求した。","type":"verb","meaning_category":"aviation"},{"sentence":"The **reicing** process was delayed due to a shortage of de-icing fluid.","translation":"再着氷防止処理は、解氷液の不足により遅延した。","type":"noun (gerund)","meaning_category":"aviation"}]}