{"word":"Pseudo-Areopagite","priority":"低","meanings":[{"part_of_speech":"名詞","definition":"偽ディオニシウス・アレオパギタ。6世紀頃のシリアの著作家で、新プラトン主義的なキリスト教神学を展開した。その著作は、使徒言行録に登場するアレオパゴスのディオニシウスに仮託されている。","english_definition":"A 6th-century Syrian author who wrote a series of influential Neoplatonic Christian theological treatises under the pseudonym of Dionysius the Areopagite, a figure mentioned in the Acts of the Apostles.","examples":[{"sentence":"The works of the Pseudo-Areopagite had a profound impact on medieval Christian thought.","translation":"偽ディオニシウス・アレオパギタの著作は、中世キリスト教思想に深い影響を与えた。"}],"collocations":["the writings of Pseudo-Areopagite","Pseudo-Areopagite's theology"],"synonyms":["Dionysius the Areopagite (incorrectly)"],"antonyms":[]},{"part_of_speech":"形容詞","definition":"偽ディオニシウス・アレオパギタの、または彼に帰せられる。","english_definition":"Relating to or attributed to the Pseudo-Areopagite.","examples":[{"sentence":"Pseudo-Areopagite's mystical theology.","translation":"偽ディオニシウス・アレオパギタの神秘神学。"}],"collocations":["Pseudo-Areopagite's works","Pseudo-Areopagite's influence"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"\"Pseudo-\" (偽の) + \"Areopagite\" (アレオパゴスの人)。使徒言行録に登場するアレオパゴスのディオニシウスに仮託して著作したことから。","priority":"中"},"pronunciation":{"ipa":"/ˌsjuːdoʊˌæriəˈpædʒaɪt/","syllables":"pseu-do-a-re-o-pa-gite"},"inflection":{"notes":"名詞の複数形は Pseudo-Areopagites。形容詞は通常変化しません。"},"usage_notes":{"explanation":"この用語は、著作の真の作者がアレオパゴスのディオニシウスではないことを示すために使われます。著作自体は中世の神学や哲学に大きな影響を与えました。","priority":"高"},"common_mistakes":{"examples":[{"incorrect":"✗ Areopagite's writings","correct":"✓ Pseudo-Areopagite's writings","note":"著作の作者が偽ディオニシウスであることを明示することが重要です。"}],"priority":"中"},"related_words":{"derivatives":["Neoplatonism","mysticism","theology"],"phrasal_verbs":[],"priority":"中"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低い","priority":"低"},"readability_explanation":{"level":"C2","text":"\"Pseudo-Areopagite\" is a term used in academic contexts, specifically in theology, philosophy, and history. It refers to the author of a set of influential texts attributed to Dionysius the Areopagite, a figure in the New Testament. The prefix \"pseudo-\" indicates that the actual author is unknown and not the historical Dionysius. Understanding this term requires familiarity with Christian history and philosophical concepts. The texts themselves explore Neoplatonic ideas within a Christian framework, making the subject matter complex and requiring advanced reading skills."},"example_sentences":[{"sentence":"The Pseudo-Areopagite's concept of negative theology emphasizes the unknowability of God.","translation":"偽ディオニシウス・アレオパギタの否定神学の概念は、神の認識不能性を強調する。","type":"noun","meaning_category":"人物"},{"sentence":"Pseudo-Areopagite's writings were influential in the development of medieval mysticism.","translation":"偽ディオニシウス・アレオパギタの著作は、中世の神秘主義の発展に影響を与えた。","type":"adjective","meaning_category":"関連する"}]}