{"word":"Hen-harrier","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"チュウヒ (鳥)","english_definition":"A medium-sized raptor (bird of prey) in the family Accipitridae.","examples":[{"sentence":"The hen-harrier is known for its distinctive hunting behavior.","translation":"チュウヒはその独特な狩猟行動で知られている。"},{"sentence":"Hen-harriers are protected birds in many countries.","translation":"チュウヒは多くの国で保護鳥である。"}],"collocations":["observe a hen-harrier","protect hen-harriers","hen-harrier habitat"],"synonyms":["hawk","raptor","bird of prey"],"antonyms":[]}],"etymology":{"value":"The name 'hen-harrier' comes from its habit of preying on domestic fowl, particularly hens, and 'harrier' refers to its hunting style of flying low over the ground.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɛn ˈhæriər/","syllables":"hen-har-ri-er"},"inflection":{"noun_plural":"Hen-harriers"},"usage_notes":{"explanation":"The hen-harrier is a bird of prey, known for its hunting behavior over open moorland and farmland. It is often a protected species due to habitat loss and persecution.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a hen-harrier yesterday, it was very big.","correct":"✓ I saw a hen-harrier yesterday; it was very big.","note":"Use a semicolon to connect two independent clauses. Alternatively, use 'and' or 'because'."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_species":["Northern Harrier (close relative)"]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'hen-harrier' refers to a specific species of bird of prey. Understanding the term requires some familiarity with ornithology or birdwatching. The word itself is not commonly used in everyday conversation, but might appear in nature documentaries, conservation discussions, or scientific literature."},"example_sentences":[{"sentence":"The male hen-harrier has a distinctive grey plumage.","translation":"オスのチュウヒは独特の灰色の羽毛を持っている。","type":"noun","meaning_category":"description"},{"sentence":"Conservation efforts are crucial to protect the hen-harrier population.","translation":"チュウヒの個体数を保護するためには、保護活動が不可欠である。","type":"noun","meaning_category":"conservation"},{"sentence":"The hen-harrier soared over the moorland, searching for prey.","translation":"チュウヒは獲物を探して荒れ地の上を舞い上がった。","type":"noun","meaning_category":"behavior"}]}