{"word":"harasser","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"嫌がらせをする人、ハラスメントをする人、つきまとい行為をする人","english_definition":"a person who harasses another; someone who engages in harassment.","examples":[{"sentence":"The company fired the harasser after the investigation.","translation":"会社は調査後、加害者を解雇した。"},{"sentence":"She reported her harasser to the police.","translation":"彼女はつきまとい行為をする人を警察に通報した。"},{"sentence":"Online harassers often hide behind anonymous profiles.","translation":"オンラインでの嫌がらせをする人は、匿名プロフィールに隠れていることが多い。"}],"collocations":["sexual harasser (セクハラ加害者)","online harasser (オンラインでの嫌がらせをする人)","workplace harasser (職場で嫌がらせをする人)","serial harasser (常習的な嫌がらせをする人)"],"synonyms":["bully","persecutor","tormentor","abuser","stalker"],"antonyms":["victim","target"]}],"etymology":{"value":"The word \"harasser\" is derived from the verb \"harass,\" which comes from the Old French word \"harasser\" meaning \"to tire, weary, vex, annoy.\" The suffix \"-er\" is added to indicate a person who performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/həˈræsər/","syllables":"ha-rass-er"},"inflection":{"noun_plural":"harassers"},"usage_notes":{"explanation":"The term \"harasser\" is used to describe someone who repeatedly and persistently engages in unwanted and offensive behavior towards another person. This behavior can take many forms, including verbal, physical, and online harassment. The term is often used in legal and professional contexts to identify individuals who have violated anti-harassment policies or laws.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a harassment.","correct":"✓ He is a harasser.","note":"\"Harassment\" is the act of harassing, while \"harasser\" is the person who does the harassing. Use \"harasser\" to refer to the person. "},{"incorrect":"✗ She was the harasser's victim.","correct":"✓ She was the harasser's victim.","note":"This sentence is grammatically correct, but it's important to be mindful of the language used when discussing sensitive topics like harassment. Consider alternative phrasing if appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["harass (verb: to bother or upset someone repeatedly)","harassment (noun: behavior that annoys or upsets someone)"],"phrasal_verbs":[],"related_terms":["stalker","bully","cyberbully"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but increasing in usage.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'harasser' refers to someone who repeatedly bothers or troubles another person. It's a noun that describes the person doing the harassing. You'll often see it used in discussions about workplace issues, online safety, or legal situations where someone is accused of unwanted behavior towards another person. It is important to use this word carefully and accurately, as it carries a serious connotation."},"example_sentences":[{"sentence":"The company has a zero-tolerance policy for harassers.","translation":"会社には、ハラスメントを行う者に対する不寛容な方針がある。","type":"noun","meaning_category":"嫌がらせをする人"},{"sentence":"The identity of the online harasser was eventually revealed.","translation":"オンラインでの嫌がらせをする人の身元は最終的に明らかになった。","type":"noun","meaning_category":"嫌がらせをする人"},{"sentence":"The school expelled the student who was identified as a harasser.","translation":"学校は、嫌がらせをする者として特定された生徒を退学処分にした。","type":"noun","meaning_category":"嫌がらせをする人"}]}