{"word":"stone-roofed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"石葺きの屋根の","english_definition":"having a roof made of stone","examples":[{"sentence":"The village was full of stone-roofed houses.","translation":"その村は石葺きの屋根の家でいっぱいだった。"},{"sentence":"We stayed in a charming stone-roofed cottage.","translation":"私たちは魅力的な石葺きの屋根のコテージに滞在した。"}],"collocations":[],"synonyms":["slate-roofed","tiled-roofed"],"antonyms":[]}],"etymology":{"value":"'stone' (石) + 'roofed' (屋根で覆われた) の複合語。屋根の材料が石であることを示す。","priority":"★★★"},"pronunciation":{"ipa":"/ˈstoʊnˌruːft/","syllables":"stone-roofed"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"「stone-roofed」は、屋根が石でできていることを直接的に示す形容詞です。主に、特定の建築様式や地域の特徴を説明する際に使用されます。例えば、歴史的な建物や、石材が豊富な地域で見られる家屋などを描写する際に適しています。","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["stone (名詞: 石)","roof (名詞: 屋根)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'stone-roofed' is relatively straightforward in meaning, referring to structures with roofs constructed from stone. Its usage is more common in descriptive contexts related to architecture, historical buildings, or regional characteristics where stone is a prevalent roofing material. Due to its specific and somewhat niche application, it is less frequently encountered in everyday conversation or general texts, making it more suitable for advanced learners or those with an interest in architecture and construction."},"example_sentences":[{"sentence":"The ancient castle was distinguished by its imposing stone walls and a sturdy stone-roofed tower.","translation":"その古代の城は、堂々たる石壁と頑丈な石葺きの塔で際立っていた。","type":"descriptive","meaning_category":"general"},{"sentence":"Many of the traditional houses in the Cotswolds are stone-built with stone-roofed structures, reflecting the local geology.","translation":"コッツウォルズの伝統的な家屋の多くは、地元の地質を反映して、石造りで石葺きの構造になっている。","type":"regional","meaning_category":"general"}]}