{"word":"Upapurana","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ウパプラーナ、小プラーナ (主要なプラーナ文献の補足的なヒンドゥー教の文献群)","english_definition":"Upapurana, a genre of Hindu texts that are considered secondary Puranas, or minor Puranas. They are often sectarian in nature and focus on specific deities or pilgrimage sites.","examples":[{"sentence":"The Upapurana provide more detailed accounts of local legends and religious practices.","translation":"ウパプラーナは、地域の伝説や宗教的慣習についてより詳細な記述を提供する。"}],"collocations":["Upapurana texts","read Upapurana","study Upapurana"],"synonyms":["minor Puranas"],"antonyms":["Mahapurana (major Puranas)"]}],"etymology":{"value":"Sanskrit: उपपुराण (upapurāṇa) - upa (副次的、補助的) + purāṇa (古代の物語、プラーナ)","priority":"★★★"},"pronunciation":{"ipa":"/ˈuːpəpʊˌrɑːnə/","syllables":"U-pa-pu-ra-na"},"inflection":{"notes":"Plural: Upapuranas"},"usage_notes":{"explanation":"Upapurana are a class of eighteen religious texts in Hinduism, considered supplementary to the major Puranas (Mahapuranas). They often focus on specific deities, pilgrimage sites, or religious practices and are generally sectarian in nature. Their authorship and dating are uncertain, and they vary in content and importance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Upapurana is as authoritative as the Vedas.","correct":"✓ The Upapurana are considered less authoritative than the Vedas.","note":"Upapurana are generally considered less authoritative than the Vedas or the major Puranas."}],"priority":"★★☆"},"related_words":{"derivatives":["Purana","Mahapurana"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Upapurana' refers to a specific category of Hindu religious texts. Understanding requires familiarity with Hindu scripture classifications. The term itself is Sanskrit-derived, indicating advanced vocabulary."},"example_sentences":[{"sentence":"Many local traditions are explained in detail in various Upapurana.","translation":"多くの地域の伝統が、様々なウパプラーナの中で詳細に説明されている。","type":"general","meaning_category":"definition"}]}