{"word":"amateurishly","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"素人っぽく、下手に、未熟に","english_definition":"in an amateur manner; without professional skill or expertise.","examples":[{"sentence":"The film was amateurishly made, with poor lighting and sound.","translation":"その映画は素人っぽく作られており、照明や音響が悪かった。"},{"sentence":"He amateurishly tried to fix the plumbing, but only made it worse.","translation":"彼は素人っぽく配管を修理しようとしたが、悪化させただけだった。"},{"sentence":"She amateurishly decorated the cake, but it tasted delicious.","translation":"彼女は素人っぽくケーキを飾り付けたが、味は美味しかった。"}],"collocations":["amateurishly done","amateurishly made","amateurishly decorated","amateurishly performed"],"synonyms":["inexpertly","unskillfully","clumsily","crudely","poorly","badly","ineptly"],"antonyms":["professionally","expertly","skillfully","adeptly","competently"]}],"etymology":{"value":"Derived from 'amateurish' (adjective) + '-ly' (adverb suffix). 'Amateurish' comes from 'amateur', which is from the French word 'amateur' meaning 'lover of' or 'one who loves'. Ultimately from Latin 'amator' (lover).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæmətərɪʃli/","syllables":"am-a-teur-ish-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Amateurishly' describes an action or activity done in a way that lacks professional skill or polish. It implies a lack of experience or training. It is often used to criticize or describe something negatively, but can also be used in a neutral or even endearing way, depending on the context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted very amateurishly for a professional.","correct":"✓ He acted very amateurishly, considering he's a professional.","note":"The mistake is in the implication that a professional would act amateurishly. The corrected sentence acknowledges the contradiction and explains it. Alternatively, you could say: 'He acted unprofessionally.'"},{"incorrect":"✗ The amateurishly performance was funny.","correct":"✓ The amateurish performance was funny.","note":"'Amateurishly' is an adverb and modifies verbs, adjectives, or other adverbs. 'Amateurish' is an adjective and modifies nouns. In this case, 'performance' is a noun, so it should be modified by the adjective 'amateurish'."}],"priority":"★★☆"},"related_words":{"derivatives":["amateur (noun, adjective)","amateurish (adjective)","amateurism (noun)"],"phrasal_verbs":[],"related_concepts":["novice","beginner","layman","dilettante"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'amateurishly' is used to describe something done in a way that lacks professional skill or expertise. It suggests a lack of experience or training. It is typically used in more formal contexts or when providing a critical assessment of something. Because it's a more nuanced and evaluative term, it's considered a C1 level word."},"example_sentences":[{"sentence":"The play was amateurishly staged, with actors forgetting their lines.","translation":"その劇は素人っぽく演出されており、役者たちはセリフを忘れていた。","type":"adverb","meaning_category":"素人っぽく"},{"sentence":"He amateurishly tried to repair the car engine, resulting in further damage.","translation":"彼は素人っぽく車のエンジンを修理しようとしたが、さらなる損傷につながった。","type":"adverb","meaning_category":"下手に"},{"sentence":"The website was amateurishly designed, making it difficult to navigate.","translation":"そのウェブサイトは素人っぽくデザインされており、ナビゲートするのが難しかった。","type":"adverb","meaning_category":"未熟に"}]}