{"word":"achene","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"痩果（そうか）：閉果の一種で、果皮が種皮に密着せず、熟しても裂開しない乾燥した果実。","english_definition":"A small, dry, one-seeded fruit that does not open to release the seed. The seed is attached to the pericarp (fruit wall) at only one point.","examples":[{"sentence":"A sunflower seed is actually an achene.","translation":"ヒマワリの種は実際には痩果です。"},{"sentence":"Buttercups produce achenes.","translation":"キンポウゲは痩果を生成します。"}],"collocations":["sunflower achene","strawberry achene","buttercup achene"],"synonyms":["seed","fruit","caryopsis","nutlet"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'achēnēs', meaning 'not gaping' or 'not opening', referring to the fruit's characteristic of not opening to release the seed.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈeɪkiːn/","syllables":"a·chene"},"inflection":{"noun_plural":"achenes"},"usage_notes":{"explanation":"An achene is a type of simple, dry fruit. The key characteristic of an achene is that the seed is attached to the fruit wall (pericarp) at only one point, and the fruit does not open (indehiscent) when ripe to release the seed. This distinguishes it from other dry fruits like capsules or legumes. Common examples include sunflower seeds, buckwheat, and buttercups. Strawberries have many achenes on their surface, which are often mistaken as seeds.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Achenes are the same as nuts.","correct":"✓ Achenes are different from nuts because the pericarp is easily separated from the seed, unlike in nuts.","note":"Achenes are often confused with nuts, but nuts have a hard, stony shell, and the fruit wall is fused with the seed coat."},{"incorrect":"✗ Strawberries are seeds.","correct":"✓ The small 'seeds' on the outside of a strawberry are actually achenes.","note":"The small, seed-like structures on the surface of a strawberry are actually the achenes, each containing a single seed."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'achene' is a botanical term used to describe a specific type of dry fruit. It is most commonly encountered in the context of botany, plant biology, or agriculture. Understanding this term requires some familiarity with botanical terminology. The key features of an achene are its small size, dryness, single seed, and indehiscence (not opening to release the seed). Examples include sunflower seeds and the 'seeds' on a strawberry's surface."},"example_sentences":[{"sentence":"The tiny black structures on the surface of a strawberry are individual achenes, each containing a seed.","translation":"イチゴの表面にある小さな黒い構造は個々の痩果であり、それぞれに種子が含まれています。","type":"noun","meaning_category":"botany"},{"sentence":"Farmers harvest sunflower achenes for their oil-rich seeds.","translation":"農家は油分の多い種子を得るためにヒマワリの痩果を収穫します。","type":"noun","meaning_category":"agriculture"}]}