{"word":"tocologist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"産科医、分娩医","english_definition":"A physician specializing in obstetrics; an obstetrician.","examples":[{"sentence":"The tocologist delivered the baby safely.","translation":"その産科医は安全に赤ちゃんを取り上げた。"},{"sentence":"She consulted a tocologist during her pregnancy.","translation":"彼女は妊娠中、産科医に相談した。"}],"collocations":["consult a tocologist","see a tocologist","find a tocologist","become a tocologist"],"synonyms":["obstetrician","accoucheur","birth doctor"],"antonyms":[]}],"etymology":{"value":"The word \"tocologist\" is derived from the Greek words \"tokos\" (meaning childbirth) and \"-logist\" (meaning one who studies).","priority":"★★☆"},"pronunciation":{"ipa":"/toʊˈkɒlədʒɪst/","syllables":"to-col-o-gist"},"inflection":{"noun_plural":"tocologists"},"usage_notes":{"explanation":"The term \"tocologist\" is a less common synonym for \"obstetrician.\" While both terms refer to a medical doctor specializing in pregnancy, childbirth, and the postpartum period, \"obstetrician\" is the more widely recognized and frequently used term in modern English. \"Tocologist\" might be encountered in older texts or in more specialized medical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a tocologist for animals.","correct":"✓ She is a veterinarian specializing in animal reproduction.","note":"Tocologists specifically deal with human childbirth. For animals, a veterinarian specializing in reproduction would be the appropriate term."},{"incorrect":"✗ I need to make an appointment with a tocologist for my heart condition.","correct":"✓ I need to make an appointment with a cardiologist for my heart condition.","note":"Tocologists specialize in childbirth; for heart conditions, you would need to see a cardiologist."}],"priority":"★☆☆"},"related_words":{"derivatives":["tocology (noun: 産科学)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (very rare, specialized medical vocabulary)","frequency_google_ngram":"Extremely rare.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"tocologist\" is a highly specialized term, rarely used in general conversation. It is a synonym for \"obstetrician,\" a medical doctor who specializes in pregnancy and childbirth. Due to its infrequent use, it is considered advanced vocabulary, typically encountered in medical contexts or historical texts."},"example_sentences":[{"sentence":"The tocologist provided excellent prenatal care.","translation":"その産科医は優れた出生前ケアを提供した。","type":"noun","meaning_category":"産科医"},{"sentence":"She decided to become a tocologist after witnessing the miracle of birth.","translation":"彼女は出産の奇跡を目撃した後、産科医になることを決意した。","type":"noun","meaning_category":"産科医"}]}