{"word":"Nibong","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A type of palm tree (Oncosperma tigillarium) native to Southeast Asia, often found in mangrove forests and coastal areas. Its wood is known for its durability and resistance to saltwater, making it useful for construction purposes.","english_definition":"A species of palm tree (Oncosperma tigillarium) found in Southeast Asia, valued for its durable wood.","examples":[{"sentence":"The villagers used nibong wood to build their houses and boats.","translation":"村人たちはニボン材を使って家やボートを建てた。"},{"sentence":"Nibong palms are commonly found along the riverbanks in the mangrove forests.","translation":"ニボンヤシはマングローブ林の川岸によく見られる。"}],"collocations":["nibong palm","nibong wood","nibong trunk","nibong forest"],"synonyms":["Oncosperma tigillarium"],"antonyms":[]}],"etymology":{"value":"The word \"nibong\" is derived from Malay, where it refers specifically to the Oncosperma tigillarium palm tree.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈniːbɒŋ/","syllables":"Ni-bong"},"inflection":{},"usage_notes":{"explanation":"'Nibong' is primarily used to refer to the specific species of palm tree, Oncosperma tigillarium. It is also used to describe the wood obtained from this tree, which is valued for its strength and resistance to decay, especially in marine environments.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"N/A","text":"'Nibong' refers to a specific type of palm tree found in Southeast Asia. It is a relatively specialized term, primarily used in contexts related to botany, forestry, or local construction practices in the regions where the tree is found."},"example_sentences":[{"sentence":"The sturdy nibong pilings supported the traditional stilt house.","translation":"丈夫なニボンの杭が伝統的な高床式住居を支えていた。","type":"noun","meaning_category":"type of palm tree"},{"sentence":"Nibong is a sustainable building material in many coastal communities.","translation":"ニボンは多くの沿岸地域で持続可能な建築材料である。","type":"noun","meaning_category":"type of palm tree"}]}