{"word":"unhardness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"柔らかさ、軟弱さ、硬さがないこと","english_definition":"The state or quality of not being hard; softness; lack of firmness or rigidity.","examples":[{"sentence":"The unhardness of the butter made it easy to spread.","translation":"バターの柔らかさのおかげで、塗りやすかった。"},{"sentence":"The unhardness of the clay allowed the artist to mold it easily.","translation":"粘土の柔らかさのおかげで、芸術家はそれを簡単に成形できた。"}],"collocations":["degree of unhardness","relative unhardness","physical unhardness"],"synonyms":["softness","tenderness","pliability","malleability","flexibility","suppleness"],"antonyms":["hardness","rigidity","firmness","stiffness"]}],"etymology":{"value":"Formed by adding the prefix \"un-\" (meaning \"not\") to the noun \"hardness\".","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈhɑːrdnəs/","syllables":"un-hard-ness"},"inflection":{"noun_plural":"unhardnesses (rarely used)"},"usage_notes":{"explanation":"\"Unhardness\" is a relatively uncommon word used to describe the property of something lacking hardness. It is typically used in technical or descriptive contexts where the degree of softness or pliability is important. It is the direct opposite of \"hardness\".","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unhardness made the metal stronger.","correct":"✓ The unhardness made the metal more pliable.","note":"Unhardness implies lack of resistance or strength, so it would not make something stronger. Use \"pliability\" or a similar term instead."}],"priority":"★★★"},"related_words":{"derivatives":["hard (adjective)","hardness (noun)","unhard (adjective - rare)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unhardness\" is a relatively rare and technical term used to describe the absence of hardness in a material or substance. It is most often encountered in scientific or engineering contexts where the specific physical properties of materials are being discussed. Understanding the word requires familiarity with the concept of \"hardness\" and the function of the prefix \"un-\" in negating the meaning of a word."},"example_sentences":[{"sentence":"The unhardness of the wax allowed it to be easily shaped into candles.","translation":"ワックスの柔らかさのおかげで、ろうそくに簡単に成形できた。","type":"noun","meaning_category":"softness"},{"sentence":"The geologist measured the unhardness of the mineral sample.","translation":"地質学者は鉱物サンプルの柔らかさを測定した。","type":"noun","meaning_category":"lack of hardness"}]}