{"word":"rontgenological","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"レントゲン学の、レントゲン写真の","english_definition":"Relating to or using X-rays for medical imaging.","examples":[{"sentence":"The rontgenological examination revealed a fracture.","translation":"レントゲン検査で骨折が明らかになった。"},{"sentence":"Rontgenological findings were consistent with pneumonia.","translation":"レントゲン写真の所見は肺炎と一致していた。"}],"collocations":["rontgenological examination","rontgenological findings","rontgenological study"],"synonyms":["radiological","X-ray"],"antonyms":[]}],"etymology":{"value":"The word 'rontgenological' is derived from 'Röntgen', the surname of Wilhelm Conrad Röntgen, the German physicist who discovered X-rays in 1895. The suffix '-ological' indicates 'relating to the study of'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌrɒntɡənˈlɒdʒɪkəl/","syllables":"ront-gen-o-log-i-cal"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. Comparative and superlative forms are not commonly used, but 'more rontgenological' and 'most rontgenological' would be grammatically correct if needed."},"usage_notes":{"explanation":"'Rontgenological' is a somewhat older term, and 'radiological' is more commonly used in modern medical contexts. However, 'rontgenological' may still be encountered in older texts or in specific contexts where historical accuracy is important.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rontgenological is clear.","correct":"✓ The rontgenological image is clear.","note":"'Rontgenological' is an adjective and needs to modify a noun. It cannot stand alone as a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["Röntgen (noun: the unit of measurement for ionizing radiation)","Röntgen ray (noun: X-ray)","radiology (noun: the study of medical imaging)","radiologist (noun: a doctor specializing in radiology)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - primarily found in specialized medical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'rontgenological' is a highly specialized term primarily used in medical contexts. It refers to anything related to the use of X-rays for medical imaging, named after Wilhelm Conrad Röntgen, the discoverer of X-rays. Due to its specific and technical nature, it is not commonly used in general conversation and is more likely to be encountered in medical literature or discussions among healthcare professionals. In contemporary medical practice, 'radiological' is often preferred. Understanding this term requires a background in medical terminology or an interest in the history of medicine."},"example_sentences":[{"sentence":"The doctor ordered a rontgenological examination of the chest.","translation":"医師は胸部のレントゲン検査を指示した。","type":"general","meaning_category":"medical"},{"sentence":"Rontgenological techniques have advanced significantly over the past century.","translation":"レントゲン技術は過去1世紀にわたって著しく進歩してきた。","type":"historical","meaning_category":"medical"},{"sentence":"The rontgenological appearance of the tumor was indicative of its benign nature.","translation":"その腫瘍のレントゲン写真上の外観は、良性であることを示唆していた。","type":"technical","meaning_category":"medical"}]}