{"word":"kilovar-hour","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"無効電力時間、キロバール時","english_definition":"A unit of measurement for reactive power consumption over time, equal to 1000 var-hours.","examples":[{"sentence":"The utility company charges for kilovar-hour consumption to discourage excessive reactive power usage.","translation":"電力会社は、過剰な無効電力の使用を抑制するために、キロバール時の消費量に対して課金します。"}],"collocations":["measure kilovar-hour","kilovar-hour meter","reduce kilovar-hour consumption"],"synonyms":["kVARh","reactive energy consumption"],"antonyms":[]}],"etymology":{"value":"The term is derived from 'kilo-' (prefix for 1000), 'var' (volt-ampere reactive, the unit of reactive power), and 'hour' (unit of time).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈkɪləˌvɑːr aʊər/","syllables":"ki-lo-var-hour"},"inflection":{"noun_plural":"kilovar-hours"},"usage_notes":{"explanation":"Kilovar-hour (kVARh) is a unit used in electrical engineering to measure the amount of reactive power consumed over a period of time, typically an hour. Reactive power is the power that does not perform useful work but is necessary for the operation of inductive and capacitive loads. Utility companies often monitor and may charge for excessive kVARh consumption because it can lead to inefficiencies and increased costs in the power grid.","priority":"☆☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["var","kilovolt-ampere","power factor"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"Kilovar-hour (kVARh) is a technical term used in electrical engineering to quantify reactive power consumption over time. It's essential for understanding power system efficiency and billing practices related to reactive power. The concept is typically encountered in advanced electrical engineering contexts."},"example_sentences":[{"sentence":"The industrial plant's kilovar-hour usage was significantly reduced after installing power factor correction equipment.","translation":"その工業プラントのキロバール時使用量は、力率改善装置の設置後、大幅に削減されました。","type":"example","meaning_category":"usage"},{"sentence":"Monitoring kilovar-hour helps in optimizing the performance of electrical systems.","translation":"キロバール時を監視することは、電気システムの性能を最適化するのに役立ちます。","type":"example","meaning_category":"monitoring"}]}