{"word":"pericopal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"聖書日課の、聖書朗読箇所の","english_definition":"Relating to or consisting of a pericope or pericopes; pertaining to a passage or selection from the Bible appointed to be read at a religious service.","examples":[{"sentence":"The pericopal lectionary provides a set of readings for each Sunday of the year.","translation":"聖書日課の朗読表は、年間を通して各日曜日のための聖書朗読箇所を提供する。"},{"sentence":"Pericopal analysis focuses on the literary and theological significance of individual passages.","translation":"聖書日課分析は、個々の聖書朗読箇所の文学的および神学的な意義に焦点を当てる。"}],"collocations":["pericopal lectionary","pericopal reading","pericopal analysis"],"synonyms":["lectionary","biblical","scriptural"],"antonyms":[]}],"etymology":{"value":"From pericope + -al.","priority":"★★★"},"pronunciation":{"ipa":"/pəˈrɪkəpəl/","syllables":"pe-ric-o-pal"},"inflection":{},"usage_notes":{"explanation":"'Pericopal' is primarily used in religious or academic contexts related to biblical studies and liturgy. It refers specifically to the selection and arrangement of biblical passages for use in worship services.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["pericope"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The word 'pericopal' is a specialized term primarily used in theological or liturgical contexts. Understanding requires familiarity with the concept of a 'pericope,' which is a self-contained unit of biblical text. Therefore, this word is not commonly encountered outside of religious studies or related academic fields."},"example_sentences":[{"sentence":"The pericopal readings are chosen to reflect the themes of the liturgical season.","translation":"聖書日課の朗読箇所は、典礼暦のテーマを反映するように選ばれている。","type":"adjective","meaning_category":"聖書日課の"},{"sentence":"His sermon was based on the pericopal text for that Sunday.","translation":"彼の説教はその日曜日の聖書日課の箇所に基づいていた。","type":"adjective","meaning_category":"聖書朗読箇所の"}]}