{"word":"Paulinist","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A follower or supporter of the teachings of Saint Paul the Apostle.","english_definition":"A person who adheres to or advocates the theological doctrines of Saint Paul.","examples":[{"sentence":"The early church was divided between those with a more Jewish orientation and the Paulinists who emphasized the gospel to the Gentiles.","translation":"初期の教会は、ユダヤ教的な傾向が強い人々、そして異邦人への福音を強調するパウロ主義者の間で分裂していた。"}],"collocations":["Paulinist theology","Paulinist interpretation","early Paulinists"],"synonyms":["Pauline","Paulian","follower of Paul"],"antonyms":["anti-Paulinist"]},{"part_of_speech":"adjective","definition":"Relating to or characteristic of the teachings of Saint Paul.","english_definition":"Of or pertaining to Saint Paul or his theology.","examples":[{"sentence":"Paulinist theology emphasizes grace and faith over works of the law.","translation":"パウロ主義の神学は、律法の行いよりも恵みと信仰を強調する。"},{"sentence":"The letter to the Romans is a key text for understanding Paulinist thought.","translation":"ローマ人への手紙は、パウロ主義の思想を理解するための重要なテキストである。"}],"collocations":["Paulinist doctrine","Paulinist epistles","Paulinist perspective"],"synonyms":["Pauline","Paulian"],"antonyms":["anti-Paulinist"]}],"etymology":{"value":"Derived from the name Paul (referring to Saint Paul the Apostle) + -ist (suffix indicating a follower or adherent).","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɔːlɪnɪst/","syllables":"Pau-lin-ist"},"inflection":{"noun_plural":"Paulinists"},"usage_notes":{"explanation":"The term 'Paulinist' is used in theological and historical contexts to describe those who follow or advocate the theological views attributed to Saint Paul. It can also describe the theological views themselves. It is often used in discussions about the development of early Christian theology and the relationship between Pauline thought and other strands of early Christianity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Paulinist because he likes the Bible.","correct":"✓ He is a Paulinist because he adheres to Paul's theological teachings.","note":"Being a Paulinist is about adhering to specific theological interpretations attributed to Paul, not simply liking the Bible."}],"priority":"★★☆"},"related_words":{"derivatives":["Paulinism (noun: the theological doctrines of Saint Paul)"],"phrasal_verbs":[],"related_terms":["Pauline epistles","Saint Paul","Apostle Paul","New Testament theology"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Paulinist' is specialized and primarily used in religious studies, theology, and historical contexts related to early Christianity. Understanding requires familiarity with Christian theology and the role of Saint Paul in the development of Christian doctrine. The term is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"As a Paulinist, she dedicated her life to spreading the teachings of the apostle.","translation":"パウロ主義者として、彼女は使徒の教えを広めることに生涯を捧げた。","type":"noun","meaning_category":"Follower of Saint Paul"},{"sentence":"The professor specialized in Paulinist theology and its impact on early Christian communities.","translation":"教授はパウロ主義の神学と、それが初期のキリスト教コミュニティに与えた影響を専門としていた。","type":"adjective","meaning_category":"Relating to Saint Paul's teachings"}]}