{"word":"ordalian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"神判の、神明裁判の","english_definition":"Relating to or characteristic of an ordeal, especially a trial by ordeal.","examples":[{"sentence":"The ordalian practices of the medieval period were often brutal.","translation":"中世の神明裁判の慣習はしばしば残酷であった。"},{"sentence":"Ordalian law relied on divine intervention to determine guilt or innocence.","translation":"神明裁判による法律は、有罪か無罪かを判断するために神の介入に頼っていた。"}],"collocations":["ordalian practices","ordalian law","ordalian test"],"synonyms":["trial by ordeal","divine judgment"],"antonyms":[]}],"etymology":{"value":"Derived from 'ordeal,' referring to a severe test or experience, often involving physical danger or pain, used to determine guilt or innocence based on the belief that a divine power would intervene to protect the innocent.","priority":"★☆☆"},"pronunciation":{"ipa":"/ɔːrˈdeɪliən/","syllables":"or-dai-li-an"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term 'ordalian' is primarily used in historical or anthropological contexts when discussing trial by ordeal. It describes something related to or characteristic of these trials, which were common in medieval times and in some traditional societies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ordalian was happy.","correct":"✓ The accused faced an ordalian trial.","note":"'Ordalian' is an adjective, so it should modify a noun, not stand alone as a subject."}],"priority":"★☆☆"},"related_words":{"derivatives":["ordeal (noun): A severe test or experience.","ordealist (noun): Someone who supports or practices trial by ordeal."],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - primarily used in academic or historical contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Ordalian' is a specialized term used to describe something related to trial by ordeal, a historical method of determining guilt or innocence through dangerous or painful tests. It is not commonly used in everyday language and is more likely to be encountered in academic or historical texts. Understanding this word requires knowledge of historical legal practices and may not be necessary for general English proficiency."},"example_sentences":[{"sentence":"The ordalian ritual involved walking barefoot over hot coals.","translation":"その神明裁判の儀式は、裸足で熱い炭の上を歩くことを伴った。","type":"adjective","meaning_category":"神判の"},{"sentence":"Ordalian methods were eventually replaced by more rational forms of justice.","translation":"神明裁判の方法は、最終的により合理的な司法の形に取って代わられた。","type":"adjective","meaning_category":"神明裁判の"}]}