{"word":"antihemagglutinin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"抗ヘマグルチニン","english_definition":"An antibody that inhibits hemagglutination, often targeting viral hemagglutinins.","examples":[{"sentence":"The antihemagglutinin antibody effectively neutralized the influenza virus.","translation":"その抗ヘマグルチニン抗体は、インフルエンザウイルスを効果的に中和した。"},{"sentence":"Antihemagglutinin titers are used to assess the immune response to influenza vaccination.","translation":"抗ヘマグルチニン力価は、インフルエンザワクチンに対する免疫応答を評価するために使用される。"}],"collocations":["antihemagglutinin antibody","antihemagglutinin titer","neutralizing antihemagglutinin"],"synonyms":["hemagglutination-inhibiting antibody"],"antonyms":[]}],"etymology":{"value":"Formed from 'anti-' (against), 'hemagglutinin' (a substance that causes agglutination of red blood cells), and '-in' (suffix used for proteins and related substances).","priority":"★★☆"},"pronunciation":{"ipa":"ˌæntiˌhiːməˈɡluːtɪnɪn/","syllables":"an-ti-he-ma-glu-ti-ni-nin"},"inflection":{"noun_plural":"antihemagglutinins"},"usage_notes":{"explanation":"Antihemagglutinins are antibodies that specifically target and neutralize hemagglutinins, which are surface glycoproteins found on certain viruses (like influenza) that mediate viral entry into host cells. These antibodies are crucial for immune protection against viral infections and are often measured to assess vaccine efficacy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ antihemaglutinin","correct":"✓ antihemagglutinin","note":"The correct spelling includes the double 'g': 'hemagglutinin'."}],"priority":"★★☆"},"related_words":{"derivatives":["hemagglutinin","antibody","hemagglutination","virus neutralization"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Antihemagglutinin' is a technical term used in immunology and virology. It refers to an antibody that specifically inhibits hemagglutination, a process where red blood cells clump together, often caused by viral proteins like influenza's hemagglutinin. Understanding this term requires a background in biology or medicine."},"example_sentences":[{"sentence":"The research focused on developing novel antihemagglutinin therapies.","translation":"その研究は、新規の抗ヘマグルチニン療法の開発に焦点を当てた。","type":"noun","meaning_category":"Immunology"},{"sentence":"High levels of antihemagglutinin in the blood indicate a strong immune response.","translation":"血中の高レベルの抗ヘマグルチニンは、強力な免疫応答を示す。","type":"noun","meaning_category":"Virology"}]}