{"word":"non-holding","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"(of a company or organization) not owning or controlling other companies or organizations.","english_definition":"Not being a holding company; not owning or controlling other companies.","examples":[{"sentence":"The company is a non-holding entity; it focuses solely on its core business operations.","translation":"その会社はノンホールディングの組織であり、中核事業の運営のみに注力しています。"},{"sentence":"As a non-holding company, it does not have subsidiaries or investments in other businesses.","translation":"ノンホールディング会社として、子会社や他の事業への投資はありません。"}],"collocations":["non-holding company","non-holding entity","non-holding structure"],"synonyms":["independent","standalone","unaffiliated"],"antonyms":["holding","parent","controlling"]}],"etymology":{"value":"Formed by adding the prefix 'non-' to 'holding'.","priority":"Medium"},"pronunciation":{"ipa":"/ˌnɒn ˈhəʊldɪŋ/","syllables":"non-hold-ing"},"inflection":{"notes":"Adjective; no specific inflections"},"usage_notes":{"explanation":"'Non-holding' is typically used to describe a company or organization that does not function as a holding company. A holding company owns controlling shares in other companies, which it then controls. A non-holding company, by contrast, typically focuses on its own operations and does not control other entities.","priority":"High"},"common_mistakes":{"examples":[{"incorrect":"The nonholding company had many subsidiaries.","correct":"The non-holding company did not have any subsidiaries.","note":"Non-holding companies, by definition, do not have subsidiaries."}],"priority":"Medium"},"related_words":{"derivatives":["holding company","subsidiary","affiliate"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"The term 'non-holding' is a specialized term used in business and finance. It describes a company that does not own or control other companies. Understanding this term requires familiarity with corporate structures and financial terminology. It's often used in contrast to 'holding company,' which is a company that does own and control other companies through ownership of their stock."},"example_sentences":[{"sentence":"The group operates as a non-holding structure, with each division managed independently.","translation":"そのグループはノンホールディング構造で運営されており、各部門は独立して管理されています。","type":"adjective","meaning_category":"Corporate Structure"},{"sentence":"Our company is a non-holding entity; we don't have any subsidiaries.","translation":"当社はノンホールディングの組織であり、子会社はありません。","type":"adjective","meaning_category":"Corporate Structure"}]}