{"word":"twice-fined","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"二度罰金を科された","english_definition":"Having been fined on two separate occasions.","examples":[{"sentence":"The twice-fined company continued to violate environmental regulations.","translation":"二度罰金を科されたその会社は、環境規制への違反を続けた。"},{"sentence":"He was a twice-fined offender, known for his disregard for traffic laws.","translation":"彼は交通法規を無視することで知られる、二度罰金を科された違反者だった。"}],"collocations":["twice-fined offender","twice-fined company"],"synonyms":["repeatedly fined","previously fined","second-time offender"],"antonyms":["never fined","first-time offender"]}],"etymology":{"value":"Combination of \"twice\" (meaning two times) and \"fined\" (meaning having been subjected to a monetary penalty).","priority":"N/A"},"pronunciation":{"ipa":"/ˈtwaɪs faɪnd/","syllables":"twice-fined"},"inflection":{"notes":"This is an adjective, so it does not inflect for tense or number."},"usage_notes":{"explanation":"The term 'twice-fined' is used to describe someone or something that has received a financial penalty on two separate occasions. It indicates a history of non-compliance or wrongdoing that has resulted in monetary fines. It is often used in legal or regulatory contexts.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["fine","fined","fining"],"related_terms":["penalty","sanction","conviction"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'twice-fined' is a compound adjective indicating that someone or something has been subjected to a monetary penalty on two separate occasions. It is relatively straightforward to understand but is more likely to be encountered in formal or legal contexts."},"example_sentences":[{"sentence":"The twice-fined restaurant was shut down due to repeated health code violations.","translation":"その二度罰金を科されたレストランは、繰り返しの衛生法規違反により閉鎖された。","type":"adjective","meaning_category":"二度罰金を科された"},{"sentence":"As a twice-fined driver, his insurance rates were significantly higher.","translation":"二度罰金を科された運転手として、彼の保険料は著しく高かった。","type":"adjective","meaning_category":"二度罰金を科された"}]}