{"word":"zaphrentid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A solitary rugose coral of the extinct order Rugosa, typically having a simple, conical shape.","english_definition":"An extinct solitary rugose coral, typically conical in shape.","examples":[{"sentence":"Zaphrentids are common fossils in certain geological formations.","translation":"ザフレンティドは、特定の地層において一般的な化石です。"}],"collocations":["fossil zaphrentid","zaphrentid coral","zaphrentid species"],"synonyms":["horn coral","rugose coral"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name *Zaphrentis* (now considered a synonym of *Streptelasma*) + -id (suffix indicating membership in a group). The genus name *Zaphrentis* is likely derived from Greek roots, but the exact etymology is unclear.","priority":"★★☆"},"pronunciation":{"ipa":"/zæˈfrɛntɪd/","syllables":"za-phren-tid"},"inflection":{"noun_plural":"zaphrentids"},"usage_notes":{"explanation":"The term \"zaphrentid\" is primarily used in paleontology and geology when discussing or identifying fossil corals. It refers specifically to solitary rugose corals, often characterized by their horn-like shape. The term is less common outside of these scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The zaphrentid was a type of dinosaur.","correct":"✓ The zaphrentid was a type of coral.","note":"Zaphrentids are corals, not dinosaurs."},{"incorrect":"✗ Zaphrentids are still alive today.","correct":"✓ Zaphrentids are an extinct group of corals.","note":"Zaphrentids are an extinct group of corals."}],"priority":"★☆☆"},"related_words":{"derivatives":["Zaphrentis (historical genus name)","Rugosa (order of corals)","coral","fossil"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency - Specialized scientific term.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word \"zaphrentid\" is a highly specialized term used in paleontology and geology to refer to a specific type of extinct coral. Understanding this term requires familiarity with the classification and characteristics of fossil corals. It is unlikely to be encountered outside of scientific literature or academic discussions related to paleontology. The word's meaning is closely tied to the broader context of rugose corals and their evolutionary history."},"example_sentences":[{"sentence":"The paleontologist identified the fossil as a zaphrentid based on its distinctive calice.","translation":"古生物学者は、その化石の特徴的な萼（がく）に基づいて、ザフレンティドであると特定しました。","type":"noun","meaning_category":"identification of fossil"},{"sentence":"Many zaphrentid fossils from the Devonian period have been found in this region.","translation":"この地域では、デボン紀のザフレンティドの化石が多数発見されています。","type":"noun","meaning_category":"fossil discovery"}]}