{"word":"MTD","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(ビジネス) 月初来 (げっしょらい)","english_definition":"(business) Month-to-date; from the beginning of the current month to the present date.","examples":[{"sentence":"Our MTD sales are up 15% compared to last year.","translation":"当社の月初来の売上は昨年比15%増です。"},{"sentence":"The MTD budget for marketing has already been exceeded.","translation":"マーケティングの月初来予算はすでに超過しています。"}],"collocations":["MTD sales (月初来売上)","MTD revenue (月初来収益)","MTD performance (月初来実績)","MTD budget (月初来予算)"],"synonyms":["month-to-date"],"antonyms":["YTD (Year-to-date)"]},{"part_of_speech":"noun","definition":"(軍事) 機動戦術大隊 (きどうせんじゅつだいたい)","english_definition":"(military) Mechanized Tactical Detachment.","examples":[{"sentence":"The MTD was deployed to the border region.","translation":"機動戦術大隊が国境地域に配備された。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Acronym of \"Month-To-Date\" or \"Mechanized Tactical Detachment\".","priority":"★★★"},"pronunciation":{"ipa":"/ˌem tiː ˈdiː/","syllables":"em-tee-dee"},"inflection":{"notes":"It is an acronym, so it doesn't have plural forms."},"usage_notes":{"explanation":"MTD is an initialism that has two common meanings. In business, it stands for \"Month-To-Date\" and refers to the period from the beginning of the current month until the current date. It is used to track performance metrics like sales, revenue, and expenses. In military context, it stands for \"Mechanized Tactical Detachment\".","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Our MTD sales are better than last month's total.","correct":"✓ Our MTD sales are better than last month's MTD sales.","note":"When comparing MTD sales, ensure you are comparing it with the MTD sales of the previous period, not the total sales."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["YTD (Year-to-date)","QTD (Quarter-to-date)","DTD (Day-to-date)"],"priority":"★★★"},"level_frequency":{"CEFR":"B2 (business context)","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"MTD is an acronym that stands for \"Month-To-Date.\" It is commonly used in business and finance to refer to the period starting from the beginning of the current month up to the current date. It's used to track various metrics like sales, revenue, and expenses within that specific timeframe. Understanding this term is important for analyzing short-term business performance. It also refers to \"Mechanized Tactical Detachment\" in military context."},"example_sentences":[{"sentence":"The company's MTD revenue shows a significant increase compared to the same period last year.","translation":"同社の月初来収益は、昨年同期と比較して大幅な増加を示しています。","type":"noun","meaning_category":"Business"},{"sentence":"The MTD is responsible for securing the forward operating base.","translation":"機動戦術大隊は、前方作戦基地の警備を担当しています。","type":"noun","meaning_category":"Military"}]}