{"word":"trenchmaster","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史)第一次世界大戦中の塹壕戦において、塹壕の建設、維持、防衛を指揮する軍人。","english_definition":"(historical) An officer in charge of the construction, maintenance, and defence of trenches, especially during World War I.","examples":[{"sentence":"The trenchmaster inspected the newly dug trench to ensure it met the required specifications.","translation":"塹壕長は、新しく掘られた塹壕が要求される仕様を満たしていることを確認するために検査した。"},{"sentence":"The trenchmaster was responsible for coordinating the efforts of the soldiers digging and reinforcing the trench lines.","translation":"塹壕長は、塹壕線を掘り、強化する兵士たちの努力を調整する責任を負っていた。"}],"collocations":["inspect the trench","command the trench","coordinate trench defense"],"synonyms":["trench officer","trench commander"],"antonyms":[]}],"etymology":{"value":"\"trench\"（塹壕）+ \"master\"（長、指揮官）の組み合わせ。第一次世界大戦中に塹壕戦が普及した際に生まれた言葉。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtrentʃˌmæstər/","syllables":"trench-mas-ter"},"inflection":{"noun_plural":"trenchmasters"},"usage_notes":{"explanation":"\"trenchmaster\"は、第一次世界大戦特有の役職であり、現代ではほとんど使用されない歴史的な用語です。塹壕戦における専門的な知識と指揮能力が求められました。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a trench master at the construction site.","correct":"✓ He was a construction foreman at the construction site.","note":"\"trenchmaster\"は軍事用語であり、一般的な建設現場では使用されません。"},{"incorrect":"✗ The trenchmaster was responsible for the plumbing in the trenches.","correct":"✓ The trenchmaster was responsible for the overall maintenance and defense of the trenches.","note":"\"trenchmaster\"の主な任務は、塹壕の維持と防衛であり、特定の専門的な作業（配管など）ではありません。"}],"priority":"★☆☆"},"related_words":{"derivatives":["trench warfare","trench foot"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 歴史的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"trenchmaster\" is a highly specialized and historical term primarily associated with World War I. Understanding its meaning requires knowledge of the specific context of trench warfare and the military hierarchy of that era. It is unlikely to be encountered in general English usage. The word is composed of \"trench,\" referring to the long, narrow ditches used for protection in warfare, and \"master,\" indicating a person in charge or with expertise. Therefore, a \"trenchmaster\" was the officer responsible for overseeing the construction, maintenance, and defense of these trenches. Due to its limited and historical usage, this term is considered advanced vocabulary.","example_sentences":[]},"example_sentences":[{"sentence":"The **trenchmaster** barked orders to the men digging deeper into the muddy earth.","translation":"塹壕長は、泥だらけの地面をさらに深く掘る兵士たちに命令を怒鳴った。","type":"noun","meaning_category":"military officer"},{"sentence":"The responsibilities of the **trenchmaster** included ensuring the trenches were properly fortified against enemy attacks.","translation":"塹壕長の責任には、敵の攻撃に対して塹壕が適切に強化されていることを確認することが含まれていた。","type":"noun","meaning_category":"military officer"}]}