{"word":"hemielytra","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"半鞘翅（はんしょうし）。カメムシ目（半翅目）の昆虫に見られる、前翅の基部が硬化し、先端が膜質になっている翅。","english_definition":"The forewings of certain insects, such as those in the order Hemiptera (true bugs), in which the basal part is hardened and the apical part is membranous.","examples":[{"sentence":"The distinctive feature of true bugs is their hemielytra.","translation":"カメムシ目の昆虫の際立った特徴は、その半鞘翅です。"},{"sentence":"The hemielytra protect the hindwings when the insect is not flying.","translation":"昆虫が飛んでいないとき、半鞘翅は後翅を保護します。"}],"collocations":["possess hemielytra (半鞘翅を持つ)","hemipteran hemielytra (半翅目の半鞘翅)"],"synonyms":["elytra (鞘翅 - ただし、完全に硬化している場合)"],"antonyms":[],"notes":"Hemielytra are characteristic of the order Hemiptera, which includes true bugs, cicadas, aphids, planthoppers, and leafhoppers."}],"etymology":{"value":"Derived from the Greek words 'hemi-' meaning 'half' and 'elytron' meaning 'wing case' or 'sheath'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɛmiˈɛlɪtrə/","syllables":"hem-i-el-y-tra"},"inflection":{"noun_plural":"hemielytra"},"usage_notes":{"explanation":"'Hemielytra' is a technical term used in entomology to describe the specific type of forewing found in Hemiptera. It's important to distinguish this from 'elytra', which refers to the completely hardened forewings of beetles (Coleoptera).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The beetle has hemielytra.","correct":"✓ The beetle has elytra.","note":"Beetles (Coleoptera) have elytra, which are fully hardened, not hemielytra."},{"incorrect":"✗ Hemielytra are found on all insects.","correct":"✓ Hemielytra are found on insects in the order Hemiptera.","note":"Hemielytra are specific to the order Hemiptera."}],"priority":"★★☆"},"related_words":{"derivatives":["hemipteran (名詞/形容詞: 半翅目の昆虫/半翅目の)"],"phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門的な学術用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hemielytra' is a specialized term used in entomology, specifically when discussing the wing structure of insects belonging to the order Hemiptera (true bugs and related insects). The term describes a type of forewing that is partially hardened at the base and membranous at the tip. Understanding this term requires some background knowledge in insect anatomy and classification. It is not a commonly used word outside of scientific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The presence of hemielytra is a key characteristic used to identify insects belonging to the order Hemiptera.","translation":"半鞘翅の存在は、カメムシ目の昆虫を識別するための重要な特徴です。","type":"scientific","meaning_category":"identification"},{"sentence":"The hardened basal portion of the hemielytra provides protection for the delicate hindwings.","translation":"半鞘翅の硬化した基部は、繊細な後翅を保護します。","type":"anatomical","meaning_category":"function"}]}