{"word":"subarousal","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(生理学・心理学)覚醒水準の低下、低覚醒","english_definition":"A state of reduced physiological or psychological arousal.","examples":[{"sentence":"The patient exhibited symptoms of subarousal, including lethargy and decreased responsiveness.","translation":"患者は、嗜眠や反応性の低下など、覚醒水準の低下の症状を示した。"},{"sentence":"Chronic stress can lead to subarousal of the nervous system.","translation":"慢性的なストレスは、神経系の覚醒水準の低下につながる可能性がある。"}],"collocations":["low arousal","decreased arousal","physiological subarousal","psychological subarousal"],"synonyms":["hypoarousal","underarousal","low activation"],"antonyms":["hyperarousal","overarousal","high activation"]}],"etymology":{"value":"\"sub-\" (下位の、より少ない) + \"arousal\" (覚醒)。","priority":"★★★"},"pronunciation":{"ipa":"/sʌbəˈraʊzəl/","syllables":"sub-a-rous-al"},"inflection":{"noun_plural":"subarousals"},"usage_notes":{"explanation":"\"Subarousal\" refers to a state where an individual experiences a lower level of physiological or psychological activation than is considered normal or optimal. This can manifest in various ways, such as decreased alertness, reduced energy levels, and impaired cognitive function. It is often associated with conditions like depression, chronic fatigue, and certain neurological disorders.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The opposite of subarousal is sadness.","correct":"✓ The opposite of subarousal is hyperarousal.","note":"Subarousal is a physiological state, while sadness is an emotion. The opposite of subarousal is hyperarousal, which is a state of excessive arousal."}],"priority":"★☆☆"},"related_words":{"derivatives":["arousal","subarouse (verb)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in medical and psychological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Subarousal\" is a term used in physiology and psychology to describe a state of reduced alertness or activation. It means that someone's body or mind is less active or responsive than it should be. This can be caused by various factors, such as fatigue, depression, or certain medical conditions. It's the opposite of being overly excited or anxious (hyperarousal)."},"example_sentences":[{"sentence":"Individuals with ADHD may experience periods of both hyperarousal and **subarousal**.","translation":"ADHDの人は、過覚醒と低覚醒の両方の期間を経験することがある。","type":"noun","meaning_category":"覚醒水準の低下"},{"sentence":"The medication can sometimes cause **subarousal** as a side effect.","translation":"その薬は副作用として、時に覚醒水準の低下を引き起こすことがある。","type":"noun","meaning_category":"覚醒水準の低下"}]}