{"word":"fully-justified","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(テキストが)両端揃えの","english_definition":"(of text) having straight edges on both the left and right sides because the words are spaced out evenly.","examples":[{"sentence":"The document was formatted with fully-justified text.","translation":"その文書は両端揃えのテキストでフォーマットされていた。"},{"sentence":"Fully-justified paragraphs can look very neat and professional.","translation":"両端揃えの段落は、非常にきちんとしていてプロフェッショナルに見える。"}],"collocations":["fully-justified text","fully-justified paragraph","fully-justified alignment"],"synonyms":["justified","block justified"],"antonyms":["left-justified","right-justified","center-aligned"]},{"part_of_speech":"adjective","definition":"完全に正当化された、十分に理由のある","english_definition":"completely justified; having a sufficient reason or explanation.","examples":[{"sentence":"His actions were fully-justified given the circumstances.","translation":"彼の行動は、状況を考えると完全に正当化された。"},{"sentence":"The expense was fully-justified by the increased productivity.","translation":"その費用は、生産性の向上によって十分に正当化された。"}],"collocations":["fully-justified expense","fully-justified action","fully-justified decision"],"synonyms":["warranted","legitimate","defensible","reasonable"],"antonyms":["unjustified","unwarranted","unreasonable"]}],"etymology":{"value":"The term combines 'fully' (completely) with 'justified' (having a good reason or being aligned). The text alignment sense comes from the visual appearance of the text block being 'justified' or made even on both sides.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfʊli ˈdʒʌstɪfaɪd/","syllables":"ful-ly-jus-ti-fied"},"inflection":{"notes":"This is an adjective, so it doesn't inflect like a verb. Comparative and superlative forms are possible but less common (more fully-justified, most fully-justified)."},"usage_notes":{"explanation":"'Fully-justified' can refer to either text alignment or the justification of an action or decision. When referring to text, it means that the text is aligned on both the left and right margins, creating a block of text with straight edges. When referring to actions or decisions, it means that there is a complete and valid reason for them. The context will usually make it clear which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The text was fully justify.","correct":"✓ The text was fully-justified.","note":"'Fully-justified' is an adjective, so it needs the '-ed' ending when describing the state of the text."},{"incorrect":"✗ His decision wasn't fully justified, but it was close.","correct":"✓ His decision wasn't fully-justified, but it was almost justified.","note":"The hyphen is important to connect 'fully' and 'justified' when used as a compound adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["justify (verb)","justification (noun)","fully (adverb)"],"phrases":["justify one's actions","justify the expense"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in technical writing and formal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Fully-justified' is a compound adjective that can be used in two main contexts. In typography, it describes text that is aligned on both the left and right margins, creating a clean, block-like appearance. Outside of typography, it describes something (like a decision or action) that has been completely and thoroughly justified, meaning there are very strong and valid reasons for it. Because it's a more formal and technical term, it's more likely to appear in professional documents or academic writing rather than everyday conversation."},"example_sentences":[{"sentence":"The report was professionally formatted with **fully-justified** text.","translation":"そのレポートは、プロのフォーマットで、両端揃えのテキストが使用されていた。","type":"adjective","meaning_category":"(text) aligned on both sides"},{"sentence":"Her concerns were **fully-justified** given the lack of safety precautions.","translation":"安全対策が不足していたことを考えると、彼女の懸念は完全に正当化された。","type":"adjective","meaning_category":"completely justified"}]}