{"word":"docibility","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The state or quality of being docile; teachableness; receptivity to instruction.","english_definition":"The quality of being docile; teachableness.","examples":[{"sentence":"The dog's docibility made it easy to train.","translation":"その犬の従順さのおかげで、訓練が簡単だった。"},{"sentence":"The student's docibility allowed him to quickly grasp new concepts.","translation":"その学生の素直さによって、彼は新しい概念をすぐに理解することができた。"}],"collocations":["high docibility","low docibility","demonstrate docibility","lack of docibility"],"synonyms":["docility","teachableness","tractability","amenability","compliance"],"antonyms":["intractability","stubbornness","recalcitrance","obstinacy"]}],"etymology":{"value":"From Latin 'docilis' (easily taught) + '-bility' (suffix denoting a quality or state).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdoʊsɪˈbɪləti/","syllables":"do-ci-bil-i-ty"},"inflection":{"noun_plural":"docibilities"},"usage_notes":{"explanation":"\"Docibility\" refers specifically to the capacity or willingness to be taught or guided. It's often used in contexts involving training animals or educating individuals. It highlights the ease with which someone or something can be influenced or instructed.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The docibility of the material made it easy to break.","correct":"The malleability of the material made it easy to shape.","note":"\"Docibility\" relates to teachableness, not physical properties like malleability."}],"priority":"★☆☆"},"related_words":{"derivatives":["docile","docilely","docility"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Docibility\" is a relatively uncommon word that means the quality of being easily taught or trained. It's often used in formal or academic contexts when discussing learning processes or behavioral traits. If something has \"docibility,\" it is receptive to instruction and easily influenced. This word is less common than its related term, \"docility,\" which refers more broadly to being easily managed or controlled."},"example_sentences":[{"sentence":"The success of the training program depended on the horses' docibility.","translation":"その訓練プログラムの成功は、馬たちの従順さにかかっていた。","type":"noun","meaning_category":"teachableness"},{"sentence":"The teacher appreciated the student's docibility and eagerness to learn.","translation":"教師は、生徒の素直さと学ぶ意欲を評価した。","type":"noun","meaning_category":"teachableness"}]}