{"word":"coal-dependent","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"石炭依存の、石炭に大きく依存している","english_definition":"relying heavily on coal for energy or economic activity.","examples":[{"sentence":"The region is coal-dependent, with many jobs tied to the mining industry.","translation":"その地域は石炭に大きく依存しており、多くの雇用が鉱業に関連している。"},{"sentence":"The country's coal-dependent economy faces challenges as the world shifts to renewable energy.","translation":"その国の石炭依存経済は、世界が再生可能エネルギーに移行するにつれて課題に直面している。"},{"sentence":"Reducing our reliance on coal is crucial for a sustainable future, but we must consider the impact on coal-dependent communities.","translation":"石炭への依存度を下げることは持続可能な未来のために不可欠ですが、石炭依存のコミュニティへの影響を考慮しなければなりません。"}],"collocations":["coal-dependent economy (石炭依存経済)","coal-dependent region (石炭依存地域)","coal-dependent community (石炭依存コミュニティ)","coal-dependent industry (石炭依存産業)"],"synonyms":["reliant on coal","coal-reliant","coal-based","dependent on fossil fuels (より広義)"],"antonyms":["coal-independent","diversified (economy)","renewable energy-based"],"notes":"Often used in discussions about energy policy, environmental sustainability, and economic transition.","usage_notes":{"explanation":"The term 'coal-dependent' is used to describe regions, economies, or industries that rely heavily on coal as a primary source of energy or economic activity. This dependence can create challenges as the world transitions to cleaner energy sources, as it can lead to job losses and economic disruption in these areas. The term is often used in discussions about energy policy, environmental sustainability, and the need for economic diversification in coal-dependent regions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The city is depend on coal.","correct":"✓ The city is coal-dependent.","note":"'Coal-dependent' is an adjective. Use it to describe something that relies on coal. The phrase 'depend on coal' is grammatically correct but doesn't have the same specific meaning as 'coal-dependent'."},{"incorrect":"✗ Coal-dependent is good for the environment.","correct":"✓ Being coal-dependent is harmful to the environment.","note":"Coal-dependent is generally considered negative due to environmental concerns. Ensure your statement reflects this understanding."}],"priority":"★★☆"},"related_words":{"derivatives":["dependence (名詞: 依存)","dependency (名詞: 依存)","coal (名詞: 石炭)"],"related_terms":["fossil fuel (化石燃料)","renewable energy (再生可能エネルギー)","energy transition (エネルギー転換)","carbon emissions (炭素排出量)","climate change (気候変動)","sustainable development (持続可能な開発)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1-C2","frequency_google_ngram":"Relatively low frequency, but common in specific contexts (energy policy, environmental science).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Coal-dependent' describes something that relies heavily on coal. It's often used when discussing the economy or energy sources of a region or country. Because it's used in specific, often technical discussions, it's more common in advanced English. You'll see it in articles about the environment, energy policy, and the economy."},"example_sentences":[{"sentence":"The government is trying to diversify the economy of the coal-dependent province.","translation":"政府は石炭依存の州の経済を多角化しようとしている。","type":"adjective","meaning_category":"石炭依存の"},{"sentence":"Many coal-dependent communities are struggling with high unemployment rates.","translation":"多くの石炭依存のコミュニティが高い失業率に苦しんでいる。","type":"adjective","meaning_category":"石炭依存の"},{"sentence":"Investing in renewable energy is essential for transitioning away from a coal-dependent economy.","translation":"再生可能エネルギーへの投資は、石炭依存経済からの移行に不可欠である。","type":"adjective","meaning_category":"石炭依存の"}]}],"etymology":{"value":"Formed by combining 'coal' (referring to the fossil fuel) and 'dependent' (relying on something).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈkoʊl dɪˈpɛndənt/","syllables":"coal-de-pen-dent"},"inflection":{"notes":"Adjectives do not inflect in English."}}