{"word":"snowy-vested","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"白いチョッキを着た、雪のようなチョッキを着た","english_definition":"Wearing a vest that is white or resembles snow; having a white or snow-like vest.","examples":[{"sentence":"The snowy-vested penguin waddled across the ice.","translation":"白いチョッキを着たペンギンが氷の上をよちよち歩いた。"},{"sentence":"A snowy-vested waiter greeted us at the restaurant.","translation":"白いチョッキを着たウェイターがレストランで私たちを迎えた。"}],"collocations":["snowy-vested penguin","snowy-vested waiter","snowy-vested bird"],"synonyms":["white-vested","pure-vested"],"antonyms":["dark-vested","black-vested"]}],"etymology":{"value":"The word is a compound adjective formed by combining \"snowy\" (resembling snow in whiteness) and \"vested\" (wearing a vest).","priority":"★★★"},"pronunciation":{"ipa":"/ˈsnoʊi ˈvestɪd/","syllables":"snow-y-vest-ed"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than for comparative and superlative forms, which are less common for compound adjectives like this one."},"usage_notes":{"explanation":"This adjective is primarily descriptive, used to depict someone or something wearing a vest that is white or gives the impression of being covered in snow. It is often used in literary or descriptive contexts to create a vivid image.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The snowy-vested man was wearing a hat.","correct":"✓ The snowy-vested man was wearing a hat.","note":"The sentence is grammatically correct as is. Common mistakes might involve misspellings or using it in inappropriate contexts."}],"priority":"☆☆☆"},"related_words":{"derivatives":["snowy","vested"],"related_terms":["vest","snow","white"]},"level_frequency":{"CEFR":"N/A (Uncommon)","frequency_google_ngram":"Very Low Frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The adjective \"snowy-vested\" is a relatively uncommon descriptive term, likely found in more advanced or literary texts. Its meaning is straightforward, combining the concepts of \"snowy\" (white like snow) and \"vested\" (wearing a vest). Understanding the individual components makes the compound word's meaning clear. It is not a common word in everyday conversation."},"example_sentences":[{"sentence":"A flock of snowy-vested birds gathered by the frozen lake.","translation":"白いチョッキを着た鳥の群れが凍った湖のそばに集まった。","type":"descriptive","meaning_category":"appearance"},{"sentence":"The doorman, always snowy-vested, tipped his hat as we entered.","translation":"いつも白いチョッキを着たドアマンが、私たちが入ると帽子に手を当てた。","type":"descriptive","meaning_category":"clothing"}]}