{"word":"pneumographic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"呼吸運動記録の、呼吸運動記録法の","english_definition":"Relating to pneumography; pertaining to the recording of respiratory movements.","examples":[{"sentence":"The pneumographic data showed a regular breathing pattern.","translation":"呼吸運動記録のデータは、規則的な呼吸パターンを示した。"},{"sentence":"Pneumographic techniques are used to study sleep apnea.","translation":"呼吸運動記録法は、睡眠時無呼吸症候群の研究に用いられる。"}],"collocations":["pneumographic data","pneumographic recording","pneumographic study"],"synonyms":["respiratory","spirometric"],"antonyms":[]},{"part_of_speech":"noun","definition":"呼吸運動記録","english_definition":"A recording of respiratory movements.","examples":[{"sentence":"The pneumographic showed a decrease in respiratory rate during sleep.","translation":"呼吸運動記録は、睡眠中の呼吸数の減少を示した。"}],"collocations":["analyze the pneumographic","interpret the pneumographic"],"synonyms":["pneumogram","respirogram"],"antonyms":[]}],"etymology":{"value":"From 'pneumo-' (relating to the lungs or breathing) + '-graphic' (relating to recording or writing).","priority":"★★★"},"pronunciation":{"ipa":"/ˌnjuːməˈɡræfɪk/","syllables":"pneu-mo-graph-ic"},"inflection":{"notes":"Adjective: comparative - more pneumographic, superlative - most pneumographic. Noun: plural - pneumographics"},"usage_notes":{"explanation":"'Pneumographic' primarily relates to the process or result of recording respiratory movements. It is often used in medical or scientific contexts. As an adjective, it describes something related to pneumography. As a noun, it refers to the recording itself.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The pneumographic was used to treat the patient.","correct":"✓ The pneumographic data was used to diagnose the patient.","note":"A pneumographic is a diagnostic tool, not a treatment. It provides data for diagnosis."}],"priority":"★★☆"},"related_words":{"derivatives":["pneumography (noun: the process of recording respiratory movements)","pneumograph (noun: an instrument for recording respiratory movements)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'pneumographic' is a specialized term primarily used in medical and scientific fields related to respiratory studies. It describes something pertaining to the recording of respiratory movements or refers to the recording itself. Understanding requires familiarity with medical terminology.","priority":"★★★"},"example_sentences":[{"sentence":"The patient underwent a pneumographic examination to assess lung function.","translation":"患者は肺機能を評価するために呼吸運動記録検査を受けた。","type":"adjective","meaning_category":"Relating to recording respiratory movements"},{"sentence":"The pneumographic revealed irregularities in the patient's breathing pattern.","translation":"呼吸運動記録は、患者の呼吸パターンの異常を明らかにした。","type":"noun","meaning_category":"Recording of respiratory movements"}]}