{"word":"palatography","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"口蓋図法、口蓋図","english_definition":"A method of studying articulation by recording the contact between the tongue and the palate during speech.","examples":[{"sentence":"Palatography is used to analyze the articulation of speech sounds.","translation":"口蓋図法は、音声の発音を分析するために使用されます。"},{"sentence":"Static palatography involves coating the palate with a substance and then having the speaker articulate certain sounds.","translation":"静的口蓋図法では、口蓋をある物質でコーティングし、話者に特定の音を発音させます。"},{"sentence":"Dynamic palatography uses electronic sensors to track tongue contact in real-time.","translation":"動的口蓋図法では、電子センサーを使用して舌の接触をリアルタイムで追跡します。"}],"collocations":["static palatography","dynamic palatography","electropalatography (EPG)"],"synonyms":["electropalatography (EPG)"],"antonyms":[]},{"part_of_speech":"noun","definition":"口蓋図を作成すること","english_definition":"The process of creating a palatogram.","examples":[{"sentence":"Palatography is essential for understanding how different sounds are produced.","translation":"口蓋図法は、さまざまな音がどのように生成されるかを理解するために不可欠です。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From 'palato-' (relating to the palate) + '-graphy' (a process of recording or describing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpæləˈtɒɡrəfi/","syllables":"pa-la-tog-ra-phy"},"inflection":{"noun_plural":"palatographies"},"usage_notes":{"explanation":"Palatography is primarily used in phonetics, linguistics, and speech pathology to study and visualize tongue-palate contact during speech. It helps researchers and clinicians understand articulation patterns and diagnose speech disorders.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ palatogramphy","correct":"✓ palatography","note":"The correct spelling is 'palatography', not 'palatogramphy' (missing 'o')."},{"incorrect":"✗ Palatography is a treatment for speech disorders.","correct":"✓ Palatography is a diagnostic tool for speech disorders.","note":"Palatography is a method used to study and diagnose speech disorders, not a treatment."}],"priority":"★★☆"},"related_words":{"derivatives":["palatogram","electropalatography (EPG)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Palatography' is a specialized term used in phonetics and linguistics. It refers to the technique of recording the contact between the tongue and the roof of the mouth (palate) during speech. This method helps in understanding how different sounds are articulated. The term is not commonly used outside of these fields.","priority":"★★☆"},"example_sentences":[{"sentence":"Researchers use palatography to study the articulation of different languages.","translation":"研究者たちは、口蓋図法を使用してさまざまな言語の発音を研究します。","type":"general","meaning_category":"articulation analysis"},{"sentence":"Electropalatography (EPG) is a type of palatography that uses electronic sensors.","translation":"電気口蓋図法（EPG）は、電子センサーを使用する口蓋図法の一種です。","type":"specific","meaning_category":"EPG"},{"sentence":"Palatography can help diagnose articulation disorders in children.","translation":"口蓋図法は、子供の発音障害の診断に役立ちます。","type":"clinical","meaning_category":"diagnosis"}]}