{"word":"radiometallography","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"放射性金属組織学：放射性同位体を用いて金属材料の微細構造や組成を分析する技術","english_definition":"A technique for analyzing the microstructure and composition of metallic materials using radioactive isotopes.","examples":[{"sentence":"Radiometallography is used to study the diffusion of radioactive tracers in metals.","translation":"放射性金属組織学は、金属中の放射性トレーサーの拡散を研究するために使用されます。"},{"sentence":"The radiometallography analysis revealed the presence of impurities in the alloy.","translation":"放射性金属組織学分析により、合金中の不純物の存在が明らかになった。"}],"collocations":["radioactive tracer","microstructure analysis","composition analysis","diffusion studies","alloy characterization"],"synonyms":["autoradiography","radioactive tracing","metallography"],"antonyms":[]}],"etymology":{"value":"\"radio-\" (放射線) + \"metallography\" (金属組織学)","priority":"★★★"},"pronunciation":{"ipa":"ˌreɪdi.oʊ.məˈtæl.əˌɡræ.fi","syllables":"ra-di-o-me-tal-log-ra-phy"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Radiometallography is a specialized technique often used in materials science and nuclear engineering. It involves introducing radioactive isotopes into a metal sample and then using autoradiography or other radiation detection methods to visualize the distribution of these isotopes. This can provide information about grain boundaries, phase transformations, and other microstructural features.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["radiometallographic (adjective)"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"Radiometallography is a highly specialized term used in materials science and nuclear engineering. It refers to the use of radioactive isotopes to analyze the microstructure and composition of metallic materials. Understanding this term requires a strong background in both metallurgy and nuclear physics."},"example_sentences":[{"sentence":"Radiometallography provides a unique insight into the behavior of metals under irradiation.","translation":"放射性金属組織学は、放射線照射下での金属の挙動に関する独自の洞察を提供します。","type":"general","meaning_category":"放射性金属組織学の一般的な使用例"},{"sentence":"The researchers employed radiometallography to map the distribution of plutonium within the fuel rod.","translation":"研究者らは、放射性金属組織学を用いて、燃料棒内のプルトニウムの分布をマッピングした。","type":"specific application","meaning_category":"特定の応用例"}]}