{"word":"crystallogram","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"結晶構造を示す図、結晶写真","english_definition":"A diagram or photograph showing the structure of a crystal, typically obtained by X-ray diffraction.","examples":[{"sentence":"The crystallogram revealed the precise arrangement of atoms within the crystal.","translation":"その結晶写真によって、結晶内の原子の正確な配置が明らかになった。"},{"sentence":"Analysis of the crystallogram is essential for determining the crystal's unit cell dimensions.","translation":"結晶写真の解析は、結晶の単位格子の寸法を決定するために不可欠である。"}],"collocations":["X-ray crystallogram","analyze a crystallogram","interpret a crystallogram"],"synonyms":["diffraction pattern","X-ray diffraction image"],"antonyms":[]}],"etymology":{"value":"'Crystallo-' (結合形: 結晶) + '-gram' (図、記録)","priority":"★★★"},"pronunciation":{"ipa":"/krɪˈstæləˌɡræm/","syllables":"crys-tal-lo-gram"},"inflection":{"noun_plural":"crystallograms"},"usage_notes":{"explanation":"Crystallograms are visual representations of the diffraction patterns produced when a beam of X-rays, electrons, or neutrons interacts with a crystalline material. These patterns provide information about the arrangement of atoms within the crystal lattice. X-ray diffraction is the most common method for obtaining crystallograms.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The crystallogram showed the molecules directly.","correct":"✓ The crystallogram showed the diffraction pattern, which was then used to determine the molecular structure.","note":"Crystallograms don't directly show molecules but rather diffraction patterns that are interpreted to deduce molecular structures."}],"priority":"★★☆"},"related_words":{"derivatives":["crystallography","crystal","diffraction","X-ray diffraction"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A crystallogram is a technical term used in chemistry, physics, and materials science. It refers to a visual representation of the diffraction pattern obtained when X-rays or other radiation interact with a crystal. Analyzing crystallograms allows scientists to determine the arrangement of atoms within the crystal structure. This term is not commonly used outside of scientific contexts."},"example_sentences":[{"sentence":"The scientist used the crystallogram to determine the arrangement of atoms in the new material.","translation":"科学者はその結晶写真を使って、新しい材料中の原子の配置を決定した。","type":"general","meaning_category":"structure determination"},{"sentence":"The crystallogram was obtained using X-ray diffraction techniques.","translation":"その結晶写真はX線回折法を用いて得られた。","type":"technical","meaning_category":"methodology"}]}