{"word":"Dandydom","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"伊達男の世界、洒落男の世界、気取り屋の世界","english_definition":"The world of dandies; the qualities, behavior, or appearance characteristic of a dandy.","examples":[{"sentence":"He was known for his immersion in Dandydom, always meticulously dressed and concerned with fashion.","translation":"彼は常に細心の注意を払って服装を整え、ファッションに関心を持つ、伊達男の世界に浸っていることで知られていた。"},{"sentence":"Dandydom reached its peak in the 19th century, influencing fashion and social circles.","translation":"伊達男の世界は19世紀にピークを迎え、ファッションや社交界に影響を与えた。"}],"collocations":["High Dandydom","Embrace Dandydom","Pursue Dandydom"],"synonyms":["dandyism","foppery","Beau Monde"],"antonyms":["slobbishness","unkemptness"]}],"etymology":{"value":"'Dandy' + '-dom'. 'Dandy' originated in the late 18th century, possibly as a humorous alteration of 'Andrew', and '-dom' is a suffix denoting a state or condition.","priority":"★★☆"},"pronunciation":{"ipa":"ˈdændiˌdɒm","syllables":"Dan-dy-dom"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Dandydom' refers to the realm or characteristics associated with dandies, individuals known for their refined appearance, elegance, and attention to fashion. It encompasses the lifestyle, values, and social circles of these individuals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practices dandydom in a modest way.","correct":"✓ He practices dandyism in a modest way.","note":"'Dandydom' refers to the world or state, while 'dandyism' refers to the practice or behavior. Using 'dandyism' is more appropriate when describing the practice itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["dandy","dandyism"],"phrases":[]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dandydom' is a relatively rare word that refers to the world or characteristics of dandies, individuals known for their refined appearance and attention to fashion. It is more likely to be encountered in literature or historical contexts related to fashion and social history."},"example_sentences":[{"sentence":"The novel explores the themes of Dandydom and social status in Victorian England.","translation":"その小説は、ビクトリア朝時代のイギリスにおける伊達男の世界と社会的地位というテーマを探求している。","type":"general","meaning_category":"伊達男の世界"}]}