{"word":"pardhan","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(インド亜大陸の女性が着用する)ベール、覆い; 女性を隔離する慣習、女性の隔離","english_definition":"A veil or screen used in some Islamic and Hindu societies, especially in the Indian subcontinent, to keep women from being seen by men who are not relatives; the practice of female seclusion.","examples":[{"sentence":"The women observed pardhan, remaining out of sight of men outside their family.","translation":"女性たちはパルダーンを守り、家族以外の男性の目に触れないようにしていた。"},{"sentence":"The abolition of pardhan was a key aim of social reformers.","translation":"パルダーンの廃止は、社会改革者たちの重要な目標だった。"}],"collocations":["observe pardhan","abolish pardhan","practice pardhan","wear pardhan"],"synonyms":["veil","purdah","seclusion","segregation"],"antonyms":["exposure","visibility","integration"]}],"etymology":{"value":"From Urdu and Hindi पर्दा (pardā, “curtain, screen”), from Persian پرده (parde, “curtain”), from Middle Persian *pardag (“curtain”), from Proto-Iranian *párdatā (“cover, veil”), from Proto-Indo-Iranian *párda- (“side, flank”), from Proto-Indo-European *pérd- (“to fart”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɑːrdən/","syllables":"par-dhan"},"inflection":{"noun_plural":"pardhans"},"usage_notes":{"explanation":"'Pardhan' refers to both the physical veil or screen used to conceal women and the social practice of female seclusion itself. It is most commonly associated with Islamic and Hindu communities in the Indian subcontinent. The term can also be spelled 'purdah', which is a more common variant. The practice is controversial, with some viewing it as a symbol of oppression and others as a means of protecting women's honor and privacy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She wore a beautiful pardhan dress.","correct":"✓ She wore a beautiful pardhan. / ✓ She wore a beautiful burqa.","note":"'Pardhan' refers to the veil or screen itself, not a type of dress. 'Burqa' or 'hijab' might be more appropriate depending on the style of covering. A 'pardhan' is not a specific item of clothing, but rather the system of veiling and seclusion itself."},{"incorrect":"✗ The pardhan is only for Muslim women.","correct":"✓ The pardhan is practiced by some Muslim and Hindu women.","note":"While more commonly associated with Islamic cultures, the practice of pardhan is also found in some Hindu communities in the Indian subcontinent."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["burqa","hijab","niqab","chador","purdah"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pardhan' is a term referring to the practice of female seclusion and the veils or screens used to keep women from being seen by men who are not relatives, primarily in some Islamic and Hindu societies in the Indian subcontinent. It encompasses both the physical covering and the social custom. Understanding this term requires knowledge of cultural practices in specific regions and sensitivity to the varying interpretations of its significance, ranging from protection of privacy to gender inequality.","priority":"★☆☆"},"example_sentences":[{"sentence":"In some traditional families, women still observe **pardhan**.","translation":"一部の伝統的な家族では、女性はまだパルダーンを守っている。","type":"noun","meaning_category":"female seclusion"},{"sentence":"The **pardhan** separated the women's area from the men's area during the event.","translation":"そのイベント中、パルダーンは女性エリアと男性エリアを隔てていた。","type":"noun","meaning_category":"veil/screen"}]}