{"word":"leapfrogging","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(経済・技術)段階的発展を飛び越えること、段階的発展を経ずに先進的な段階に到達すること","english_definition":"The act of bypassing intermediate stages to reach a more advanced stage of development, especially in technology or economics.","examples":[{"sentence":"Developing countries are using leapfrogging to adopt mobile technology without building extensive landline infrastructure.","translation":"発展途上国は、広範な固定電話インフラを構築せずに、段階的発展を飛び越えてモバイル技術を採用している。"},{"sentence":"Leapfrogging allows companies to quickly gain a competitive advantage by adopting cutting-edge innovations.","translation":"段階的発展を飛び越えることで、企業は最先端のイノベーションを採用し、迅速に競争優位性を得ることができる。"}],"collocations":["technological leapfrogging","economic leapfrogging","leapfrogging strategy"],"synonyms":["bypassing","skipping stages","accelerated development"],"antonyms":["gradual development","incremental progress"]},{"part_of_speech":"verb","definition":"(人)の頭越しに進む、出し抜く","english_definition":"To advance or progress by overpassing or bypassing others.","examples":[{"sentence":"She leapfrogged several colleagues to become the manager.","translation":"彼女は数人の同僚を出し抜いてマネージャーになった。"}],"collocations":["leapfrog someone in the rankings","leapfrog the competition"],"synonyms":["overtake","surpass","outstrip","jump over"],"antonyms":["fall behind","lag behind"]},{"part_of_speech":"verb","definition":"(遊びで)馬跳びをする","english_definition":"To jump over someone or something in a playful manner, as in the game of leapfrog.","examples":[{"sentence":"The children were leapfrogging in the playground.","translation":"子供たちは遊び場で馬跳びをしていた。"}],"collocations":["play leapfrog"],"synonyms":["jump over","vault over"],"antonyms":[]}],"etymology":{"value":"The term comes from the children's game of leapfrog, where players jump over each other. The figurative sense of skipping stages of development originated in the mid-20th century.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈliːpfrɒɡɪŋ/","syllables":"leap-frog-ging"},"inflection":{"verb_forms":{"present_participle":"leapfrogging","past_simple":"leapfrogged","past_participle":"leapfrogged"}},"usage_notes":{"explanation":"'Leapfrogging' is often used in the context of technology and economic development, referring to the adoption of advanced technologies or strategies that bypass intermediate stages. It can also refer to surpassing competitors or colleagues in a career or other field. In a literal sense, it refers to the game of leapfrog.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The country leapfrogged to the internet.","correct":"✓ The country leapfrogged to widespread internet access.","note":"It's important to specify what is being leapfrogged to. In this case, it's not just the internet, but widespread access to it."}],"priority":"★☆☆"},"related_words":{"derivatives":["leapfrog (noun, verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but increasing in recent years due to discussions of technological advancement.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Leapfrogging' refers to skipping developmental stages to reach a more advanced level, often used in discussions about technology and economics. It implies a strategic jump over intermediate steps to achieve rapid progress. While the literal meaning relates to the children's game, its primary use is in describing accelerated development or advancement.","priority":"★★☆"},"example_sentences":[{"sentence":"The company is using a leapfrogging strategy to become a leader in the industry.","translation":"その会社は、段階的発展を飛び越える戦略を使って、業界のリーダーになろうとしている。","type":"noun","meaning_category":"economic/technological advancement"},{"sentence":"Many African nations are leapfrogging traditional banking systems by adopting mobile payment solutions.","translation":"多くのアフリカ諸国は、モバイル決済ソリューションを採用することで、従来の銀行システムを飛び越えている。","type":"verb","meaning_category":"economic/technological advancement"},{"sentence":"She leapfrogged her way to the top of the company.","translation":"彼女は同僚を出し抜いて会社のトップに上り詰めた。","type":"verb","meaning_category":"surpassing others"},{"sentence":"The children were happily leapfrogging in the park.","translation":"子供たちは公園で楽しそうに馬跳びをしていた。","type":"verb","meaning_category":"playing leapfrog"}]}