{"word":"macroevolution","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"大進化、マクロ進化","english_definition":"evolution at or above the species level, resulting in the formation of new taxonomic groups.","examples":[{"sentence":"Macroevolution involves large-scale evolutionary changes that occur over long periods.","translation":"大進化は、長期間にわたって起こる大規模な進化の変化を伴います。"},{"sentence":"The origin of new body plans is an example of macroevolution.","translation":"新しい体の構造の起源は大進化の一例です。"},{"sentence":"Macroevolutionary patterns are studied using the fossil record and comparative genomics.","translation":"大進化のパターンは、化石記録と比較ゲノミクスを用いて研究されます。"}],"collocations":["study macroevolution (大進化を研究する)","macroevolutionary patterns (大進化のパターン)","examples of macroevolution (大進化の例)","macroevolutionary processes (大進化のプロセス)"],"synonyms":["speciation","adaptive radiation","phylogenesis"],"antonyms":["microevolution"],"notes":"Macroevolution is often contrasted with microevolution, which refers to smaller-scale changes within a species or population."}],"etymology":{"value":"\"macro-\" (大規模な) + \"evolution\" (進化) からなる造語。","priority":"★★★"},"pronunciation":{"ipa":"/ˌmækroʊˌɛvəˈluːʃən/","syllables":"mac-ro-e-vo-lu-tion"},"inflection":{"noun_plural":null,"notes":"通常は不可算名詞として扱われます。"},"usage_notes":{"explanation":"Macroevolution refers to the broad patterns of evolutionary change above the species level. It encompasses the origin of new species, genera, families, and higher taxonomic groups, as well as major evolutionary transitions such as the origin of flight or the evolution of multicellularity. The study of macroevolution often involves analyzing the fossil record, comparative anatomy, and molecular phylogenies to understand the relationships between different groups of organisms and the processes that have shaped their evolutionary history. It contrasts with microevolution, which focuses on changes within populations, such as changes in allele frequencies.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Macroevolution is just microevolution over a long time.","correct":"✓ Macroevolution involves different processes than microevolution, although microevolutionary changes can contribute to macroevolutionary patterns.","note":"While microevolutionary changes can accumulate and contribute to macroevolution, macroevolution also involves unique processes such as speciation and adaptive radiation that are not simply extrapolations of microevolutionary changes."},{"incorrect":"✗ Macroevolution disproves evolution.","correct":"✓ Macroevolution is a well-supported scientific theory that explains the origin of new taxonomic groups.","note":"Macroevolution is a core concept in evolutionary biology and is supported by a wealth of evidence from various fields, including paleontology, genetics, and comparative anatomy."}],"priority":"★★☆"},"related_words":{"derivatives":["macroevolutionary (adjective)","macroevolutionist (noun)"],"related_terms":["microevolution","speciation","adaptive radiation","phylogeny","cladistics","paleontology","comparative genomics"],"priority":"★★★"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 主に生物学の専門分野で使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**macroevolution**」は、生物学で使われる言葉で、種よりも大きなレベルでの進化のことを指します。例えば、新しい種類の動物や植物がどのようにして生まれたのか、あるいは、大きな進化の変化がどのようにして起こったのかを説明するときに使います。化石を調べたり、いろいろな生き物の体を比べたり、遺伝子を調べたりして、このmacroevolutionを研究します。microevolution（種の中での小さな変化）とは違って、macroevolutionはもっと大きなスケールの進化を扱う言葉です。"},"example_sentences":[{"sentence":"The fossil record provides evidence for macroevolutionary transitions.","translation":"化石記録は大進化の移行の証拠を提供します。","type":"general","meaning_category":"general"},{"sentence":"Macroevolutionary studies often focus on the origin of novel traits.","translation":"大進化の研究は、しばしば新しい形質の起源に焦点を当てます。","type":"research","meaning_category":"research"},{"sentence":"Adaptive radiation is a key process in macroevolution.","translation":"適応放散は大進化の重要なプロセスです。","type":"process","meaning_category":"process"}]}