{"word":"Surfperch","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A type of fish belonging to the family Embiotocidae, found in the coastal waters of the Pacific Ocean, typically characterized by their flattened bodies and ability to thrive in surf zones.","english_definition":"Any of various fishes of the family Embiotocidae, found in the coastal waters of the Pacific Ocean.","examples":[{"sentence":"The angler caught a beautiful Surfperch off the coast of California.","translation":"釣り人はカリフォルニアの沖合で美しいSurfperchを捕まえた。"},{"sentence":"Surfperch are known for their ability to live in the turbulent surf zone.","translation":"Surfperchは、荒れた波の領域で生息できることで知られている。"}],"collocations":["Surfperch fishing","Catch Surfperch","Surfperch habitat","Different species of Surfperch"],"synonyms":["Seaperch","Embiotocid"],"antonyms":[]}],"etymology":{"value":"The name \"Surfperch\" is derived from the fish's habitat in the surf zone and its resemblance to perch-like fishes.","priority":"N/A"},"pronunciation":{"ipa":"/ˈsɜːrfpɜːrtʃ/","syllables":"surf-perch"},"inflection":{"noun_plural":"Surfperches or Surfperch"},"usage_notes":{"explanation":"\"Surfperch\" is a common name that refers to multiple species within the family Embiotocidae. When referring to a specific species, it is better to use the scientific name or the specific common name of that species.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a surfperch in the river.","correct":"✓ I saw a surfperch in the ocean.","note":"Surfperch are marine fish and are typically found in the ocean, not in rivers."}],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_species":["Redtail Surfperch","Shiner Surfperch","Walleye Surfperch"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"B2","text":"The term \"Surfperch\" refers to a specific family of fish found in the Pacific Ocean. Understanding this term requires some familiarity with marine biology and fish identification. It is not a commonly used word in everyday conversation, but it is relevant in contexts related to fishing, marine ecosystems, and wildlife.","priority":"N/A"},"example_sentences":[{"sentence":"Many anglers enjoy surf fishing for Surfperch along the California coast.","translation":"多くの釣り人がカリフォルニア沿岸でSurfperchのサーフフィッシングを楽しんでいる。","type":"general","meaning_category":"Habitat and Fishing"},{"sentence":"Surfperch are viviparous, giving birth to live young.","translation":"Surfperchは卵胎生で、生きた稚魚を産む。","type":"biological","meaning_category":"Reproduction"},{"sentence":"The Shiner Surfperch is a common species found in bays and estuaries.","translation":"Shiner Surfperchは湾や河口でよく見られる種である。","type":"species","meaning_category":"Species Identification"}]}