{"word":"undilative","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Not tending to cause dilation; not dilative.","english_definition":"Not having the property of causing dilation or expansion.","examples":[{"sentence":"This new eye drop is undilative, so it won't blur your vision.","translation":"この新しい目薬は散瞳作用がないので、視界がぼやけることはありません。"},{"sentence":"The substance was tested and found to be undilative to the blood vessels.","translation":"その物質は試験され、血管を拡張させる作用がないことが判明しました。"}],"collocations":["undilative eye drops","undilative substance","undilative effect"],"synonyms":["non-dilating","non-expanding"],"antonyms":["dilative","vasodilating"]}],"etymology":{"value":"Formed from the prefix 'un-' (meaning 'not') and the adjective 'dilative' (causing dilation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˈdaɪlətɪv/","syllables":"un-di-la-tive"},"inflection":{"notes":"Comparative and superlative forms are not commonly used for this word."},"usage_notes":{"explanation":"'Undilative' is primarily used in medical or scientific contexts to describe substances or treatments that do not cause dilation (expansion or widening). It's often used in contrast to 'dilative' or 'vasodilating' to specify the absence of this effect.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The undilative room made me feel claustrophobic.","correct":"✓ The small room made me feel claustrophobic.","note":"'Undilative' refers to the property of not causing dilation, not the physical size or nature of a space."}],"priority":"★★☆"},"related_words":{"derivatives":["dilation (noun): The act or condition of dilating or expanding.","dilate (verb): To make or become wider, larger, or more open.","dilative (adjective): Tending to cause dilation."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Undilative' is a technical term primarily used in medical and scientific fields. It describes something that does not cause dilation, meaning it does not widen or expand. This word is not commonly used in everyday conversation and is more likely to be encountered in specialized texts or discussions. Understanding its meaning requires a familiarity with the concept of dilation, often in a biological or physiological context."},"example_sentences":[{"sentence":"The doctor prescribed undilative medication to avoid pupil enlargement.","translation":"医師は瞳孔の拡大を避けるために、散瞳作用のない薬を処方しました。","type":"adjective","meaning_category":"not causing dilation"},{"sentence":"The study focused on the undilative properties of the compound.","translation":"その研究は、化合物の非拡張特性に焦点を当てました。","type":"adjective","meaning_category":"not causing dilation"}]}