{"word":"linebreeding","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"系統繁殖、近親交配 (特定の優れた祖先の血統を重視する)","english_definition":"A form of inbreeding in which distantly related individuals are mated to concentrate the genes of one or more outstanding ancestors in their pedigrees.","examples":[{"sentence":"Linebreeding is a technique used to maintain desirable traits in livestock.","translation":"系統繁殖は、家畜の望ましい特性を維持するために使用される技術です。"},{"sentence":"Careful linebreeding can help to improve the overall quality of a breed.","translation":"注意深い系統繁殖は、品種全体の品質を向上させるのに役立ちます。"},{"sentence":"Linebreeding aims to concentrate the genes of superior ancestors.","translation":"系統繁殖は、優れた祖先の遺伝子を集中させることを目的としています。"}],"collocations":["close linebreeding","outcross linebreeding","selective linebreeding","linebreeding program","linebreeding coefficient"],"synonyms":["inbreeding","selective breeding","pedigree breeding"],"antonyms":["outcrossing","crossbreeding","hybridization"]}],"etymology":{"value":"'Line' (血統) + 'breeding' (繁殖) の組み合わせ。特定の血統を重視した繁殖方法であることを示す。","priority":"★★★"},"pronunciation":{"ipa":"/ˈlaɪnˌbriːdɪŋ/","syllables":"line-breed-ing"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Linebreeding is a type of selective breeding that focuses on maintaining a high genetic relationship to a specific ancestor or group of ancestors. It is a form of inbreeding, but typically less intense than close inbreeding (e.g., mating siblings or parents and offspring). The goal is to concentrate desirable genes from those ancestors in the offspring. Linebreeding requires careful pedigree analysis and selection to avoid the negative consequences of inbreeding, such as reduced fertility and increased susceptibility to genetic disorders.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Linebreeding is the same as outcrossing.","correct":"Linebreeding is a form of inbreeding, not outcrossing.","note":"Linebreeding is a type of inbreeding, while outcrossing is the mating of unrelated individuals."},{"incorrect":"Linebreeding always leads to genetic defects.","correct":"Linebreeding can increase the risk of genetic defects if not managed carefully.","note":"While linebreeding can increase the risk of expressing recessive genetic defects, careful selection and management can minimize this risk."}],"priority":"★★☆"},"related_words":{"derivatives":["linebred (形容詞: 系統繁殖された)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"比較的低い (Relatively low) - 専門的な用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Linebreeding**」は、特定の優れた祖先の遺伝子を子孫に集中させるために、遠い親戚同士を交配させる繁殖方法です。これは近親交配の一種ですが、兄弟姉妹や親子のような近い関係での交配よりも緩やかです。目的は、望ましい特性を維持し、品種の品質を向上させることです。ただし、遺伝的な欠陥のリスクを避けるために、注意深い血統分析と選択が必要です。この用語は、家畜やペットの繁殖においてよく使用されます。"},"example_sentences":[{"sentence":"The breeder used linebreeding to enhance the dog's agility.","translation":"ブリーダーは、犬の敏捷性を高めるために系統繁殖を使用しました。","type":"noun","meaning_category":"繁殖技術"},{"sentence":"Linebreeding can help to fix specific traits within a breed.","translation":"系統繁殖は、品種内の特定の特性を固定するのに役立ちます。","type":"noun","meaning_category":"遺伝的特性の固定"},{"sentence":"The success of linebreeding depends on careful selection of breeding stock.","translation":"系統繁殖の成功は、繁殖個体の慎重な選択にかかっています。","type":"noun","meaning_category":"繁殖の成功要因"}]}