{"word":"Furlane","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"フリウリ語 (イタリア北東部のフリウリ地方で話されるロマンス語)","english_definition":"The Friulian language, a Romance language spoken in the Friuli region of northeastern Italy.","examples":[{"sentence":"Furlane is closely related to Ladin and Romansh.","translation":"フリウリ語は、ラディン語やロマンシュ語と密接な関係がある。"},{"sentence":"Many efforts are being made to preserve and promote Furlane.","translation":"フリウリ語を保存し、促進するための多くの努力がなされている。"}],"collocations":["speak Furlane","learn Furlane","Furlane grammar","Furlane dictionary"],"synonyms":["Friulian"],"antonyms":[]},{"part_of_speech":"adjective","definition":"フリウリ語の、フリウリ地方の","english_definition":"Of or relating to the Friulian language or the Friuli region.","examples":[{"sentence":"The Furlane culture is rich and diverse.","translation":"フリウリの文化は豊かで多様である。"},{"sentence":"He is a Furlane speaker.","translation":"彼はフリウリ語の話し手である。"}],"collocations":["Furlane culture","Furlane people","Furlane traditions"],"synonyms":["Friulian"],"antonyms":[]}],"etymology":{"value":"Derived from Friuli, the name of the region in northeastern Italy where the language is spoken. The name Friuli comes from Forum Iulii, the Roman name for the city of Cividale del Friuli.","priority":"★★☆"},"pronunciation":{"ipa":"/furˈlɑːneɪ/","syllables":"Fur-lane"},"inflection":{"noun_plural":"Furlanes"},"usage_notes":{"explanation":"\"Furlane\" can refer to both the language and things related to the Friuli region. When referring to the language, it is often used interchangeably with \"Friulian\". When used as an adjective, it describes something originating from or related to Friuli.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I speak Furlan.","correct":"✓ I speak Furlane.","note":"The correct spelling for the language is \"Furlane\", not \"Furlan\"."}],"priority":"★☆☆"},"related_words":{"derivatives":["Friuli (noun: the region in northeastern Italy)","Friulian (noun/adjective: a person from Friuli, the language of Friuli, or relating to Friuli)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very low frequency)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Furlane\" is a relatively uncommon term, primarily used in linguistic or regional contexts. It refers to the Friulian language spoken in the Friuli region of northeastern Italy. Understanding this term requires some familiarity with European regional languages and cultures. It's more likely to be encountered in academic or specialized discussions.","priority":"★☆☆"},"example_sentences":[{"sentence":"The university offers courses in Furlane language and culture.","translation":"その大学ではフリウリ語と文化の講座を提供している。","type":"noun/adjective","meaning_category":"Language/Regional"},{"sentence":"She is researching the grammar of Furlane.","translation":"彼女はフリウリ語の文法を研究している。","type":"noun","meaning_category":"Language"},{"sentence":"Many Furlane speakers are bilingual in Italian.","translation":"多くのフリウリ語話者はイタリア語とのバイリンガルである。","type":"adjective","meaning_category":"Regional"}]}