{"word":"nonsterility","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"The state of not being sterile; the presence of viable microorganisms.","english_definition":"The condition of not being sterile; the presence of living microorganisms.","examples":[{"sentence":"The nonsterility of the equipment led to a serious infection.","translation":"その装置が滅菌されていなかったことが、深刻な感染症につながった。"},{"sentence":"Testing confirmed the nonsterility of the sample.","translation":"検査により、そのサンプルが滅菌されていないことが確認された。"}],"collocations":["confirm nonsterility","demonstrate nonsterility","cause nonsterility","level of nonsterility"],"synonyms":["contamination","infection","presence of microorganisms"],"antonyms":["sterility","asepsis"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the word 'sterility'.","priority":"N/A"},"pronunciation":{"ipa":"/ˌnɒn.stəˈrɪl.ɪ.ti/","syllables":"non-ste-ril-i-ty"},"inflection":{"noun_plural":"nonsterilities"},"usage_notes":{"explanation":"'Nonsterility' refers to the absence of a sterile condition. Sterility implies the complete absence of viable microorganisms. Therefore, 'nonsterility' indicates that living microorganisms are present. This term is often used in medical, pharmaceutical, and laboratory contexts where maintaining a sterile environment is crucial.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The nonsterility was caused by sterilization.","correct":"The nonsterility was caused by a failure in the sterilization process.","note":"Nonsterility is the opposite of sterilization. Therefore, it cannot be caused by sterilization itself, but rather by a failure in the sterilization process."}],"priority":"N/A"},"related_words":{"derivatives":["sterile","sterility","sterilize","sterilization"],"related_terms":["asepsis","contamination","microorganism","pathogen"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Nonsterility' is a technical term used in scientific and medical contexts to describe the condition where something is not sterile, meaning it contains living microorganisms. This term is important in fields where maintaining a sterile environment is crucial to prevent contamination or infection. Understanding this term requires a good grasp of scientific vocabulary.","priority":"N/A"},"example_sentences":[{"sentence":"The presence of bacteria indicated the nonsterility of the surgical instruments.","translation":"細菌の存在は、手術器具が滅菌されていないことを示していた。","type":"noun","meaning_category":"state of not being sterile"},{"sentence":"The company faced legal action due to the nonsterility of their pharmaceutical products.","translation":"その企業は、医薬品が滅菌されていなかったために法的措置に直面した。","type":"noun","meaning_category":"state of not being sterile"}]}