{"word":"quasi-mighty","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"ほとんど強力な、一見強力に見える、見かけ倒しの強力さ","english_definition":"seemingly mighty; having some resemblance to might; not genuinely or fully mighty.","examples":[{"sentence":"The general presented himself as a quasi-mighty leader, but his decisions were often weak.","translation":"その将軍は、ほとんど強力なリーダーとして振る舞ったが、彼の決定はしばしば弱かった。"},{"sentence":"The small nation built a quasi-mighty army to deter potential aggressors.","translation":"その小国は、潜在的な侵略者を抑止するために、一見強力に見える軍隊を築き上げた。"},{"sentence":"The corporation's quasi-mighty influence in the region was based more on perception than reality.","translation":"その企業の地域における見かけ倒しの強力な影響力は、現実よりも認識に基づいていた。"}],"collocations":["quasi-mighty empire","quasi-mighty force","quasi-mighty power","quasi-mighty ruler","quasi-mighty state"],"synonyms":["seemingly powerful","ostensibly strong","apparently mighty","pseudo-mighty","nominally powerful"],"antonyms":["genuinely mighty","truly powerful","actually strong","really mighty"]},{"part_of_speech":"adjective","definition":"（皮肉を込めて）大したことないのに偉そうにしている","english_definition":"(ironically) pretending to be important or powerful.","examples":[{"sentence":"He acted like a quasi-mighty executive, even though he was just an intern.","translation":"彼はインターンにすぎないのに、偉そうにしている。"},{"sentence":"The self-proclaimed guru presented himself as a quasi-mighty spiritual leader.","translation":"自称グルは、大したことないのに偉そうに精神的な指導者として振る舞った。"}],"collocations":["quasi-mighty executive","quasi-mighty guru"],"synonyms":["pretentious","pompous","self-important","affected"],"antonyms":["humble","modest","unassuming"]}],"etymology":{"value":"The prefix \"quasi-\" comes from Latin, meaning \"as if,\" \"seemingly,\" or \"resembling.\" It is combined with \"mighty,\" which means possessing great power or strength. Therefore, \"quasi-mighty\" suggests something that appears to be mighty but is not truly so.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkwaːzaɪˈmaɪti/","syllables":"qua-si-migh-ty"},"inflection":{"notes":"Since it's an adjective, it can be inflected with comparative and superlative forms, although these are less common: more quasi-mighty, most quasi-mighty."},"usage_notes":{"explanation":"\"Quasi-mighty\" is used to describe something that has the appearance of might or power but lacks the genuine qualities of true might. It often implies a superficial or deceptive strength. The term can also be used ironically to describe someone who acts important but lacks real authority or influence.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The quasi-mighty building was made of cardboard.","correct":"✓ The seemingly mighty building was made of cardboard.","note":"Using \"seemingly mighty\" is more direct when describing something that appears strong but is not. \"Quasi-mighty\" implies a more nuanced or ironic sense."},{"incorrect":"✗ He is a quasi-mighty person.","correct":"✓ He acts like a quasi-mighty person.","note":"It's better to use \"acts like\" or \"presents himself as\" to show that someone is pretending to be powerful."}],"priority":"★★☆"},"related_words":{"derivatives":["quasi (adverb: seemingly, almost)","mighty (adjective: powerful, strong)"],"phrases":["quasi-official","quasi-scientific","quasi-legal"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"quasi-mighty\" is a somewhat sophisticated term used to describe something that appears to be powerful or strong but is not truly so. The prefix \"quasi-\" indicates a resemblance or approximation, suggesting that the subject only partially possesses the qualities of might. This term is often used to imply a superficial or deceptive strength, or to describe something that is pretending to be more important than it is. It is not a commonly used word and is more likely to appear in formal writing or speech."},"example_sentences":[{"sentence":"The dictator's quasi-mighty regime crumbled quickly after the first sign of opposition.","translation":"独裁者の見かけ倒しの強力な政権は、最初の反対の兆候の後すぐに崩壊した。","type":"adjective","meaning_category":"seemingly mighty"},{"sentence":"The company's quasi-mighty reputation was built on clever marketing rather than genuine innovation.","translation":"その会社の一見強力に見える評判は、真の革新ではなく、巧妙なマーケティングに基づいて築かれた。","type":"adjective","meaning_category":"seemingly mighty"},{"sentence":"He strutted around like a quasi-mighty general, but everyone knew he was just a figurehead.","translation":"彼は偉そうに将軍のように歩き回ったが、誰もが彼がただの飾り物であることを知っていた。","type":"adjective","meaning_category":"pretending to be important"}]}