{"word":"geo-aware","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"地理認識機能を持つ、地理情報に対応した","english_definition":"(of a device, application, or system) able to determine its own geographical location and/or the geographical location of other things.","examples":[{"sentence":"This app is geo-aware and can provide location-based services.","translation":"このアプリは地理認識機能があり、位置情報に基づいたサービスを提供できます。"},{"sentence":"Geo-aware advertising allows businesses to target customers in specific areas.","translation":"地理情報に対応した広告は、企業が特定の地域の顧客をターゲットにすることを可能にします。"},{"sentence":"The geo-aware system tracks the movement of vehicles in real time.","translation":"その地理認識システムは、車両の動きをリアルタイムで追跡します。"}],"collocations":["geo-aware application","geo-aware device","geo-aware technology","geo-aware advertising","geo-aware system"],"synonyms":["location-aware","geospatial-aware"],"antonyms":["geo-unaware","location-unaware"]}],"etymology":{"value":"'Geo-' (relating to the earth or geography) + 'aware' (having knowledge or perception).","priority":"★★★"},"pronunciation":{"ipa":"/ˌdʒiː.oʊ.əˈweər/","syllables":"ge-o-a-ware"},"inflection":{"notes":"Does not inflect; it's an adjective."},"usage_notes":{"explanation":"'Geo-aware' describes technology that can identify its location or the location of other things. It's often used in the context of mobile apps, advertising, and tracking systems. The term implies that the technology can use geographical data to provide relevant services or information.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The app is geo aware.","correct":"✓ The app is geo-aware.","note":"Hyphen is needed between 'geo' and 'aware'."}],"priority":"★★☆"},"related_words":{"derivatives":["geoawareness (noun)"],"related_terms":["geospatial","geolocation","GPS","GIS (Geographic Information System)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency. Primarily used in technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Geo-aware' is a technical term used to describe devices or applications that can determine their geographical location. This term is commonly used in technology and marketing contexts to describe systems that use location data to provide services or target advertising. It implies a sophisticated understanding and use of geographical information. "},"example_sentences":[{"sentence":"The new navigation system is fully geo-aware, providing real-time traffic updates.","translation":"その新しいナビゲーションシステムは完全に地理認識機能を持ち、リアルタイムの交通情報を提供します。","type":"general","meaning_category":"Functionality"},{"sentence":"Geo-aware marketing campaigns can significantly increase conversion rates.","translation":"地理認識マーケティングキャンペーンは、コンバージョン率を大幅に向上させることができます。","type":"marketing","meaning_category":"Application"},{"sentence":"The emergency response system uses geo-aware technology to locate individuals in distress.","translation":"緊急対応システムは、地理認識技術を使用して、困窮している個人を特定します。","type":"emergency services","meaning_category":"Application"}]}