{"word":"nondiffusing","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"拡散しない、拡散性のない","english_definition":"Not diffusing; lacking the ability or tendency to spread out or disperse.","examples":[{"sentence":"The nondiffusing nature of the dye allowed for precise staining of the tissue.","translation":"その色素の非拡散性のおかげで、組織を正確に染色することができた。"},{"sentence":"We used a nondiffusing tracer to track the movement of the fluid.","translation":"液体の動きを追跡するために、非拡散性のトレーサーを使用した。"}],"collocations":["nondiffusing substance","nondiffusing tracer","nondiffusing dye","nondiffusing contrast agent"],"synonyms":["non-spreading","localized","contained","concentrated"],"antonyms":["diffusing","spreading","dispersing","permeating"]}],"etymology":{"value":"Derived from the prefix 'non-' (meaning 'not') combined with the present participle 'diffusing' of the verb 'diffuse'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒn.dɪˈfjuːzɪŋ/","syllables":"non-di-fu-sing"},"inflection":{"notes":"Adjective; comparative and superlative forms are typically formed using 'more' and 'most' (e.g., more nondiffusing, most nondiffusing)."},"usage_notes":{"explanation":"'Nondiffusing' describes something that does not spread out or disperse easily. It is often used in scientific or technical contexts to describe substances or processes that remain localized or contained. The term emphasizes the lack of diffusion, which is the process of spreading out from a concentrated area.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The diffusing substance stayed in one place.","correct":"✓ The nondiffusing substance stayed in one place.","note":"'Diffusing' means spreading out, so it's contradictory to say it stayed in one place. Use 'nondiffusing' to indicate it remained localized."}],"priority":"★★☆"},"related_words":{"derivatives":["diffusion (noun): the process of spreading something more widely.","diffuse (verb): spread or cause to spread over a wide area or among a large number of people.","diffusible (adjective): capable of being diffused."],"related_terms":["non-permeable","non-spreading"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nondiffusing' is a technical term used to describe something that does not spread out or disperse. It is commonly found in scientific and medical contexts, where the localized behavior of a substance is important. For example, a nondiffusing dye might be used to stain a specific area of a tissue sample without the dye spreading to other areas. Understanding this term requires a grasp of the concept of diffusion and the effect of the 'non-' prefix."},"example_sentences":[{"sentence":"The doctor injected a nondiffusing contrast agent to improve the visibility of the blood vessels.","translation":"医師は血管の視認性を高めるために、非拡散性の造影剤を注射した。","type":"general","meaning_category":"Medical"},{"sentence":"The experiment required a nondiffusing material to ensure accurate measurements.","translation":"実験では、正確な測定を保証するために非拡散性の材料が必要だった。","type":"general","meaning_category":"Scientific"},{"sentence":"The researcher developed a nondiffusing polymer for targeted drug delivery.","translation":"研究者は、標的薬物送達のために非拡散性ポリマーを開発した。","type":"general","meaning_category":"Scientific"}]}