{"word":"mucostatic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(医学)粘液停滞性の、粘液の停滞を特徴とする","english_definition":"(Medicine) Characterized by or causing the stagnation of mucus.","examples":[{"sentence":"The patient presented with mucostatic bronchitis.","translation":"患者は粘液停滞性気管支炎を呈した。"},{"sentence":"Mucostatic conditions can lead to secondary infections.","translation":"粘液停滞状態は二次感染につながる可能性がある。"}],"collocations":["mucostatic bronchitis","mucostatic condition","mucostatic environment"],"synonyms":["mucous stagnation","phlegm retention"],"antonyms":["mucociliary clearance","expectoration"]},{"part_of_speech":"adjective","definition":"(歯科)粘膜静止性の、粘膜に圧力をかけない","english_definition":"(Dentistry) Relating to a dental impression technique where minimal pressure is applied to the mucosa.","examples":[{"sentence":"A mucostatic impression technique was used to create the denture.","translation":"粘膜静止性印象法を用いて義歯を作成した。"},{"sentence":"Mucostatic impressions are designed to minimize tissue displacement.","translation":"粘膜静止性印象は、組織の変位を最小限に抑えるように設計されている。"}],"collocations":["mucostatic impression","mucostatic denture","mucostatic technique"],"synonyms":["non-pressure impression","minimal pressure impression"],"antonyms":["compressive impression","functional impression"]}],"etymology":{"value":"Derived from the combination of 'muco-' (referring to mucus) and 'static' (referring to a state of being still or stagnant). In the dental context, it refers to a technique that aims to keep the mucosa in a static, undisturbed state during impression taking.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmjuːkoʊˈstætɪk/","syllables":"mu-co-stat-ic"},"inflection":{"notes":"Adjective; no specific inflectional forms."},"usage_notes":{"explanation":"The term 'mucostatic' has two main applications: in general medicine, it describes conditions where mucus accumulates and stagnates, potentially leading to infections. In dentistry, it refers to a specific impression technique that avoids compressing or displacing the oral mucosa, aiming for a more accurate representation of the tissues. The context usually clarifies which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The mucostatic drug helped to clear the mucus.","correct":"✓ A mucolytic drug helped to clear the mucus.","note":"'Mucostatic' refers to the stagnation of mucus, not its removal. A mucolytic drug would be used to clear mucus."}],"priority":"★☆☆"},"related_words":{"derivatives":["mucostasis (noun): the stagnation of mucus"],"phrasal_verbs":[],"related_terms":["mucolytic","mucociliary","mucosa","static"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mucostatic' is a technical term primarily used in medical and dental contexts. In medicine, it describes conditions related to the stagnation or accumulation of mucus. In dentistry, it refers to a specific impression technique designed to minimize pressure on the oral mucosa. Understanding the context is crucial for interpreting the intended meaning. It is not a commonly used word in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The patient's cough was productive of thick, mucostatic sputum.","translation":"患者の咳は、粘稠で停滞性の痰を伴っていた。","type":"medical","meaning_category":"粘液停滞性"},{"sentence":"The mucostatic impression captured the fine details of the edentulous ridge.","translation":"粘膜静止性印象は、無歯顎堤の細部を捉えた。","type":"dental","meaning_category":"粘膜静止性"}]}