{"word":"Cymograph","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"キモグラフ：生理学的現象（血圧、呼吸、筋肉の収縮など）の時間的変化を記録する装置","english_definition":"An apparatus for recording physiological phenomena (such as blood pressure, respiration, or muscle contractions) as a function of time.","examples":[{"sentence":"The cymograph was used to record the patient's breathing patterns.","translation":"キモグラフは患者の呼吸パターンを記録するために使用された。"},{"sentence":"The experiment utilized a cymograph to measure muscle contractions.","translation":"その実験では、筋肉の収縮を測定するためにキモグラフが使用された。"}],"collocations":["use a cymograph","record with a cymograph","physiological cymograph","rotating cymograph"],"synonyms":["kymograph","recording device","physiological recorder"],"antonyms":[]}],"etymology":{"value":"The word \"cymograph\" is derived from the Greek words \"kyma\" (κῦμα) meaning wave, and \"graph\" (γράφω) meaning to write or record.","priority":"★★☆"},"pronunciation":{"ipa":"ˈsaɪməˌɡræf","syllables":"cy-mo-graph"},"inflection":{"noun_plural":"cymographs"},"usage_notes":{"explanation":"A cymograph is a device used in physiology and related fields to record changes in pressure, movement, or other physiological variables over time. It typically involves a rotating drum covered with smoked paper or a similar recording medium, and a stylus that traces the variations in the measured variable.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The scientist used a seismograph to measure muscle contractions.","correct":"✓ The scientist used a cymograph to measure muscle contractions.","note":"A seismograph measures ground motion, while a cymograph measures physiological phenomena."}],"priority":"★☆☆"},"related_words":{"derivatives":["kymogram (the record produced by a cymograph)"],"related_terms":["physiology","measurement","recording","instrumentation"]},"level_frequency":{"frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"cymograph\" is highly specialized and primarily used within the context of physiology and related scientific disciplines. Understanding its meaning requires familiarity with scientific instrumentation and experimental techniques in these fields. It is not a common term in everyday language."},"example_sentences":[{"sentence":"The researcher calibrated the cymograph before starting the experiment.","translation":"研究者は実験を開始する前にキモグラフを校正した。","type":"general","meaning_category":"definition"},{"sentence":"The cymograph provided a detailed record of the changes in blood pressure.","translation":"キモグラフは血圧の変化の詳細な記録を提供した。","type":"example","meaning_category":"usage"}]}