{"word":"claim-jumping","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"（特に金鉱などの）占有権侵害、権利横取り","english_definition":"The act of illegally taking possession of a mining claim already held by another party.","examples":[{"sentence":"Claim-jumping was a common problem during the gold rush era.","translation":"権利横取りはゴールドラッシュ時代によくある問題だった。"},{"sentence":"The prospector accused his rival of claim-jumping.","translation":"その探鉱者はライバルを権利横取りで訴えた。"}],"collocations":["mining claim","gold rush","illegal possession","land rights"],"synonyms":["trespassing","encroachment","usurpation","land grabbing"],"antonyms":["legal claim","lawful ownership","valid title"]},{"part_of_speech":"noun","definition":"（比喩的に）他者のアイデアや業績の横取り","english_definition":"(Figurative) Taking credit for someone else's idea or accomplishment.","examples":[{"sentence":"He was accused of claim-jumping after presenting her research as his own.","translation":"彼は彼女の研究を自分のものとして発表した後、アイデアの横取りで非難された。"},{"sentence":"In the competitive world of business, claim-jumping can damage a company's reputation.","translation":"競争の激しいビジネスの世界では、アイデアの横取りは会社の評判を傷つける可能性がある。"}],"collocations":["intellectual property","plagiarism","idea theft","academic dishonesty"],"synonyms":["plagiarism","appropriation","intellectual theft","idea theft"],"antonyms":["originality","attribution","acknowledgement"]}],"etymology":{"value":"This term originates from the historical practice during gold rushes and other mining booms, where individuals would illegally seize land claims that were already legally held by someone else.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkleɪmˌdʒʌmpɪŋ/","syllables":"claim-jump-ing"},"inflection":{"noun_plural":"claim-jumpings"},"usage_notes":{"explanation":"The term 'claim-jumping' originally referred to the illegal seizure of mining claims, particularly during the gold rush era. It has since expanded to include the figurative sense of taking credit for someone else's ideas or accomplishments. The term carries a negative connotation, implying unethical or illegal behavior.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was claim-jumping his own land.","correct":"✓ He was defending his claim from claim-jumpers.","note":"Claim-jumping involves taking someone else's claim, not your own. You defend your claim against claim-jumpers."},{"incorrect":"✗ The company was claim-jumping the new product.","correct":"✓ The company was accused of claim-jumping the new product idea.","note":"Claim-jumping is usually an accusation or action against someone who takes a claim, idea, or credit that isn't theirs."}],"priority":"★★☆"},"related_words":{"derivatives":["claim-jumper (noun)"],"phrasal_verbs":[],"related_concepts":["prospecting","mining law","land rights","intellectual property rights"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Claim-jumping' refers to the illegal act of seizing a mining claim already owned by someone else, historically common during gold rushes. Figuratively, it means taking credit for another's ideas or work. It's a term used in legal and business contexts to describe unethical behavior related to property or intellectual rights.","priority":"★★☆"},"example_sentences":[{"sentence":"During the California Gold Rush, claim-jumping was a serious problem for miners.","translation":"カリフォルニアのゴールドラッシュの間、権利横取りは鉱夫にとって深刻な問題だった。","type":"noun","meaning_category":"占有権侵害"},{"sentence":"The professor accused the student of claim-jumping by presenting his research without attribution.","translation":"教授は、学生が自分の研究を引用せずに発表したことで、アイデアの横取りだと非難した。","type":"noun","meaning_category":"アイデアの横取り"}]}