{"word":"Tory-voiced","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"トーリー党（保守党）支持者のような声の、またはトーリー党支持者の特徴を持つ声の","english_definition":"Having a voice or manner of speaking characteristic of or associated with supporters of the Tory (Conservative) party.","examples":[{"sentence":"The actor adopted a Tory-voiced accent for the role of the wealthy landowner.","translation":"その俳優は、富裕な地主の役を演じるために、トーリー党支持者のようなアクセントを採用した。"},{"sentence":"His Tory-voiced pronouncements on economic policy were met with skepticism by the opposition.","translation":"彼の経済政策に関するトーリー党支持者のような発言は、野党から懐疑的に受け止められた。"}],"collocations":["Tory-voiced commentator","Tory-voiced politician","Tory-voiced pronouncements"],"synonyms":["Conservative-sounding","Upper-class-accented","Posh-voiced"],"antonyms":["Labour-voiced","Working-class-accented"],"notes":"This term is often used to describe a voice that sounds upper-class, educated, and traditionally British, associated with the Conservative party in the UK."}],"etymology":{"value":"Derived from 'Tory' (referring to the Conservative party in the UK) and 'voiced' (having a particular type of voice).","priority":"N/A"},"pronunciation":{"ipa":"/ˈtɔːri vɔɪst/","syllables":"Tor-y voiced"},"inflection":{"notes":"Adjective; does not inflect"},"usage_notes":{"explanation":"'Tory-voiced' is used to describe someone whose voice sounds like it belongs to a traditional, upper-class British person, often associated with the Conservative party. It can imply a certain level of privilege and authority.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"He is a Tory-voice person.","correct":"He is a Tory-voiced person.","note":"'Tory-voiced' is an adjective, so it should be used to describe the noun 'person'."}],"priority":"N/A"},"related_words":{"derivatives":["Tory (noun, adjective)","voiced (adjective)"],"related_terms":["Conservative","Conservative party","British upper class"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Tory-voiced' is a niche term used to describe a specific type of accent or manner of speaking associated with the British upper class and the Conservative party. Understanding the political and social context is necessary to fully grasp its meaning."},"example_sentences":[{"sentence":"The BBC announcer had a distinctly Tory-voiced delivery.","translation":"そのBBCのアナウンサーは明らかにトーリー党支持者のような話し方をしていた。","type":"adjective","meaning_category":"Characteristic voice"},{"sentence":"Her Tory-voiced opinions often sparked debate in the university common room.","translation":"彼女のトーリー党支持者のような意見は、大学の談話室でしばしば議論を巻き起こした。","type":"adjective","meaning_category":"Characteristic voice"}]}