{"word":"Chorology","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"地誌学、地域誌","english_definition":"The study of the geographical distribution of things and the reasons for such distribution; regional geography.","examples":[{"sentence":"Chorology seeks to understand the unique character of places and regions.","translation":"地誌学は、場所や地域の独自性を理解しようとします。"},{"sentence":"Early chorology focused on describing the visible features of different regions.","translation":"初期の地誌学は、さまざまな地域の目に見える特徴を記述することに焦点を当てていました。"}],"collocations":["regional chorology","historical chorology","applied chorology"],"synonyms":["regional geography","areal differentiation","spatial analysis"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek χώρα (khṓra, \"place, space\") + -logy (-logia, \"study of\").","priority":"★★☆"},"pronunciation":{"ipa":"/kəˈrɒlədʒi/","syllables":"cho-rol-o-gy"},"inflection":{"noun_plural":"chorologies"},"usage_notes":{"explanation":"Chorology is a branch of geography that focuses on the study of places and regions. It aims to describe and explain the spatial distribution of phenomena and the unique character of specific areas. It is closely related to regional geography and spatial analysis.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Chorology is the same as chronology.","correct":"✓ Chorology is the study of regions, while chronology is the study of time.","note":"Chorology (地域誌) and chronology (年代学) are different fields of study with distinct focuses."}],"priority":"★☆☆"},"related_words":{"derivatives":["chorological (adjective)"],"related_terms":["geography","regional geography","spatial analysis","cartography"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Chorology is a specialized term in geography that refers to the study of regions and places. It involves understanding the spatial distribution of phenomena and the unique characteristics of specific areas. This term is more commonly used in academic and research contexts related to geography and regional studies."},"example_sentences":[{"sentence":"The chorology of the Amazon basin reveals a complex interplay of environmental and human factors.","translation":"アマゾン盆地の地誌学は、環境要因と人的要因の複雑な相互作用を明らかにします。","type":"general"},{"sentence":"A detailed chorology of the region was essential for planning sustainable development projects.","translation":"持続可能な開発プロジェクトを計画するためには、その地域の詳細な地誌学が不可欠でした。","type":"applied"}]}