{"word":"entoilment","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"巻き込み、束縛、絡み合い","english_definition":"The act of entoiling; the state of being entoiled; entanglement; involvement in difficulties or complications.","examples":[{"sentence":"The novel explores the entoilment of the characters in a web of deceit.","translation":"その小説は、登場人物たちが欺瞞の網に巻き込まれていく様子を描いている。"},{"sentence":"His entoilment in the scandal ruined his career.","translation":"彼がスキャンダルに巻き込まれたことで、彼のキャリアは台無しになった。"},{"sentence":"The plant's tendrils caused entoilment of the surrounding vegetation.","translation":"その植物の巻きひげが、周囲の植物を絡みつかせた。"}],"collocations":["emotional entoilment (感情的な束縛)","legal entoilment (法的な絡み合い)","political entoilment (政治的な巻き込み)"],"synonyms":["entanglement","involvement","complication","implication","snare"],"antonyms":["freedom","liberation","release","detachment"]}],"etymology":{"value":"Derived from 'entoil', which combines 'en-' (meaning 'in' or 'to cause to be') and 'toil' (meaning 'to snare' or 'to trap').","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈtɔɪlmənt/","syllables":"en-toil-ment"},"inflection":{"noun_plural":"entoilments"},"usage_notes":{"explanation":"'Entoilment' typically refers to a situation where someone or something becomes trapped, involved, or complicated in a difficult or undesirable situation. It often implies a loss of freedom or agency due to the entanglement. It is a relatively uncommon word, more often found in formal writing or literature.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The entoilment was very happy.","correct":"✓ The entoilment caused a lot of problems.","note":"'Entoilment' generally has negative connotations, referring to being trapped or involved in something difficult. It is not used to describe positive situations."},{"incorrect":"✗ He was entoilmented by the beautiful scenery.","correct":"✓ He was captivated by the beautiful scenery.","note":"'Entoilment' implies a negative or restrictive involvement. Use words like 'captivated' or 'fascinated' to describe being drawn in by something positive."}],"priority":"★☆☆"},"related_words":{"derivatives":["entoil (verb: to snare, to trap, to involve)","toil (noun: hard work; snare, trap)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Entoilment' is a sophisticated word that describes the state of being entangled or involved in a complex or difficult situation. It suggests a loss of freedom or agency due to the entanglement. This word is not commonly used in everyday conversation and is more likely to be found in formal writing or literature where precise and nuanced language is valued. Understanding this word requires a strong vocabulary and the ability to recognize subtle shades of meaning.","priority":"★☆☆"},"example_sentences":[{"sentence":"The company's entoilment in legal battles drained its resources.","translation":"その会社が法廷闘争に巻き込まれたことで、資源が枯渇した。","type":"noun","meaning_category":"巻き込み、束縛"},{"sentence":"The artist depicted the entoilment of nature in urban sprawl.","translation":"その芸術家は、都市のスプロール現象における自然の絡み合いを描いた。","type":"noun","meaning_category":"絡み合い"},{"sentence":"His increasing entoilment with gambling led to financial ruin.","translation":"彼がギャンブルにますますのめり込んだことが、経済的破滅につながった。","type":"noun","meaning_category":"束縛"}]}