{"word":"SVR","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(統計学、機械学習) サポートベクター回帰","english_definition":"(Statistics, Machine Learning) Support Vector Regression. A type of support vector machine (SVM) that performs regression.","examples":[{"sentence":"SVR is used for predicting continuous values.","translation":"SVRは連続値を予測するために使用されます。"},{"sentence":"We trained an SVR model to predict stock prices.","translation":"株価を予測するためにSVRモデルを訓練しました。"}],"collocations":["train an SVR model","apply SVR","implement SVR","SVR model","SVR parameters"],"synonyms":["Support Vector Regression"],"antonyms":[]}],"etymology":{"value":"An acronym for Support Vector Regression.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛs ˌviː ˈɑːr/","syllables":"ES-VEE-AHR"},"inflection":{},"usage_notes":{"explanation":"SVR is a supervised learning algorithm used in machine learning for regression tasks. It is a type of Support Vector Machine (SVM) that is adapted to predict continuous output values rather than discrete classes (as in classification). SVR aims to find a function that approximates the mapping from input features to a continuous target variable, while minimizing the error and maximizing the margin around the predicted values.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["SVM (Support Vector Machine)","kernel function","regression","machine learning","support vector"],"priority":"★★★"},"level_frequency":{},"readability_explanation":{"level":"Advanced","text":"SVR (Support Vector Regression) is a type of machine learning algorithm used for regression tasks. It's part of the Support Vector Machine (SVM) family but adapted for predicting continuous values rather than classifying data into categories. SVR aims to find a function that best fits the data while minimizing errors. It's commonly used in fields like finance, engineering, and environmental science for tasks such as predicting stock prices, estimating energy consumption, or forecasting weather patterns. Understanding SVR requires knowledge of machine learning concepts like kernels, regularization, and optimization.","priority":"★★★"},"example_sentences":[{"sentence":"We used SVR to predict the sales based on advertising spend.","translation":"広告費に基づいて売上を予測するためにSVRを使用しました。","type":"example","meaning_category":"Usage Example"},{"sentence":"The performance of the SVR model depends on the choice of kernel function.","translation":"SVRモデルの性能は、カーネル関数の選択に依存します。","type":"example","meaning_category":"Model Performance"},{"sentence":"SVR is effective for handling non-linear relationships in the data.","translation":"SVRは、データ内の非線形関係を処理するのに効果的です。","type":"example","meaning_category":"Data Analysis"}]}