{"word":"pre-eligible","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(資格・条件などを満たすための)事前資格のある、仮資格のある","english_definition":"Having met the preliminary requirements or qualifications for something; provisionally eligible.","examples":[{"sentence":"The applicant was deemed pre-eligible after submitting the initial paperwork.","translation":"申請者は最初の書類を提出した後、事前資格があると判断された。"},{"sentence":"Only pre-eligible candidates will be invited to the next stage of the selection process.","translation":"事前資格のある候補者のみが選考プロセスの次の段階に招待されます。"}],"collocations":["pre-eligible candidate","pre-eligible applicant","deemed pre-eligible","become pre-eligible"],"synonyms":["provisionally qualified","conditionally eligible","initially qualified"],"antonyms":["ineligible","disqualified"]}],"etymology":{"value":"The word is formed by adding the prefix 'pre-' (meaning 'before' or 'preliminary') to the word 'eligible' (meaning 'qualified' or 'meeting the necessary conditions'). Therefore, 'pre-eligible' literally means 'eligible beforehand' or 'meeting the initial qualifications'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːˈelɪdʒɪbəl/","syllables":"pree-el-i-gi-ble"},"inflection":{"notes":"Adjective, does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Pre-eligible' is used to describe someone or something that has met the initial or preliminary requirements for a certain process, program, or position. It indicates that they are likely to be eligible, pending further review or fulfillment of additional criteria. It is often used in formal or official contexts, such as application processes or selection procedures. It suggests a stage before full eligibility is confirmed.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is pre-eligible for the job, but he doesn't have the experience.","correct":"✓ He is pre-eligible for the job, but he doesn't have all the experience.","note":"Pre-eligibility means meeting the initial requirements, but not necessarily all requirements. The example clarifies that the applicant meets the initial criteria, but lacks the complete experience. "},{"incorrect":"✗ Pre-eligible doesn't mean they are definitely accepted.","correct":"✓ Pre-eligibility doesn't mean they are definitely accepted.","note":"'Pre-eligibility' is a noun form, while 'pre-eligible' is an adjective. The correction clarifies that 'pre-eligibility' is the correct noun form to describe the state of being pre-eligible."}],"priority":"★★☆"},"related_words":{"derivatives":["pre-eligibility (noun)"],"phrasal_verbs":[],"related_adjectives":["eligible","ineligible"],"related_nouns":["eligibility"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'pre-eligible' is a relatively uncommon word used in formal contexts to describe a state of meeting initial requirements or qualifications. It is formed by adding the prefix 'pre-' to 'eligible,' indicating a preliminary stage of eligibility. Understanding this term requires a good grasp of vocabulary related to qualifications, applications, and selection processes. It is generally used in professional or academic settings."},"example_sentences":[{"sentence":"After the initial screening, many applicants were deemed **pre-eligible** for the scholarship.","translation":"最初の審査の後、多くの申請者が奨学金の事前資格があると判断されました。","type":"adjective","meaning_category":"事前資格のある"},{"sentence":"The **pre-eligible** candidates were invited to an interview.","translation":"事前資格のある候補者は面接に招待されました。","type":"adjective","meaning_category":"事前資格のある"}]}