{"word":"punishability","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"処罰可能性、罰せられる可能性","english_definition":"The state or quality of being punishable; liability to punishment.","examples":[{"sentence":"The punishability of the crime depends on the severity of the offense.","translation":"その犯罪の処罰可能性は、違反の重大さによって決まる。"},{"sentence":"The legal system defines the punishability of various actions.","translation":"法制度は、さまざまな行為の処罰可能性を定義している。"},{"sentence":"There is debate about the punishability of certain actions under international law.","translation":"国際法の下での特定の行為の処罰可能性について議論がある。"}],"collocations":["assess punishability (処罰可能性を評価する)","determine punishability (処罰可能性を決定する)","establish punishability (処罰可能性を確立する)","lack punishability (処罰可能性がない)"],"synonyms":["culpability","liability","amenability","accountability","blameworthiness"],"antonyms":["impunity","excusability","forgiveness","pardonability"]}],"etymology":{"value":"The word \"punishability\" is derived from \"punishable,\" which comes from \"punish.\" \"Punish\" originates from the Old French word \"punir,\" which in turn comes from the Latin word \"punire,\" meaning \"to punish.\" The suffix \"-ability\" indicates the capacity or state of being able to be punished.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpʌnɪʃəˈbɪlɪti/","syllables":"pun-ish-a-bil-i-ty"},"inflection":{"noun_plural":"punishabilities"},"usage_notes":{"explanation":"\"Punishability\" refers to the condition or state of being liable to punishment, often in a legal or moral context. It is used to describe whether an action or behavior warrants punishment according to established rules or laws. The term is frequently used in legal, ethical, and philosophical discussions concerning justice, crime, and responsibility.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The punishability of the weather was unfair.","correct":"✓ The severity of the weather caused damage.","note":"\"Punishability\" applies to actions or behaviors, not to natural phenomena like weather."},{"incorrect":"✗ He had no punishability for his good deeds.","correct":"✓ He received praise for his good deeds.","note":"\"Punishability\" refers to the liability to punishment, not to the absence of it."}],"priority":"★★☆"},"related_words":{"derivatives":["punishable (adjective: 処罰に値する)","punish (verb: 罰する)","punishment (noun: 処罰)"],"phrases":["criminal punishability (刑事処罰可能性)","legal punishability (法的処罰可能性)","moral punishability (道徳的処罰可能性)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Punishability\" is a complex term primarily used in legal, ethical, and philosophical discussions. It refers to the state of being liable to punishment for an action. Understanding this word requires familiarity with abstract concepts related to justice, responsibility, and the legal system. It is not commonly used in everyday conversation and is more likely to appear in academic or professional contexts dealing with law and ethics."},"example_sentences":[{"sentence":"The court considered the punishability of the defendant's actions.","translation":"裁判所は被告の行為の処罰可能性を検討した。","type":"general","meaning_category":"処罰可能性"},{"sentence":"The punishability of hate speech is a controversial topic.","translation":"ヘイトスピーチの処罰可能性は議論の的となっている。","type":"legal","meaning_category":"処罰可能性"},{"sentence":"The principle of proportionality is used to determine the punishability of crimes.","translation":"比例性の原則は、犯罪の処罰可能性を決定するために使用される。","type":"legal","meaning_category":"処罰可能性"}]}