{"word":"noncommissioned","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(軍隊において)下士官の、任官されていない","english_definition":"(of an officer in the armed forces) not holding a commission; relating to enlisted personnel.","examples":[{"sentence":"He rose through the ranks to become a noncommissioned officer.","translation":"彼は兵卒からたたき上げで下士官になった。"},{"sentence":"Noncommissioned officers play a vital role in the military.","translation":"下士官は軍隊において重要な役割を果たす。"},{"sentence":"The training program is designed for noncommissioned personnel.","translation":"その訓練プログラムは下士官向けに設計されている。"}],"collocations":["noncommissioned officer (NCO) (下士官)","noncommissioned personnel (下士官)","noncommissioned rank (下士官の階級)"],"synonyms":["enlisted","rank and file"],"antonyms":["commissioned"],"notes":["Typically refers to ranks such as sergeant, corporal, etc."]}],"etymology":{"value":"Derived from 'non-' (not) + 'commissioned'. 'Commissioned' refers to an officer holding a commission, a formal document conferring authority.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnkəˈmɪʃənd/","syllables":"non-com-mis-sioned"},"inflection":{"notes":"This is an adjective, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Noncommissioned' is almost exclusively used in a military context to describe officers who have not been formally commissioned. These individuals typically rise through the ranks based on experience and merit, rather than through officer training programs. The term is often used to distinguish between officers who have earned their rank through service and those who have been appointed to it.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a non-commission officer.","correct":"✓ He is a noncommissioned officer.","note":"The word is one word, 'noncommissioned', not 'non-commission' or 'non commission'."},{"incorrect":"✗ The noncommissioned are in charge of the commissioned.","correct":"✓ Noncommissioned officers are subordinate to commissioned officers.","note":"Noncommissioned officers are typically subordinate to commissioned officers, not in charge of them."}],"priority":"★★☆"},"related_words":{"derivatives":["noncommission (noun - rare, meaning the act of not commissioning someone)"],"phrasal_verbs":[],"related_terms":["enlisted","officer","commission","sergeant","corporal"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency outside of military contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'noncommissioned' is specific to military terminology. It describes military personnel who have risen through the enlisted ranks and hold positions of authority without having received a formal commission. Understanding this term requires familiarity with military hierarchy and rank structures. It is not commonly used in everyday conversation outside of military contexts."},"example_sentences":[{"sentence":"The noncommissioned officers provided valuable leadership during the training exercise.","translation":"下士官たちは訓練演習中に貴重なリーダーシップを発揮した。","type":"adjective","meaning_category":"Military Rank"},{"sentence":"He received an award for his outstanding service as a noncommissioned officer.","translation":"彼は下士官としての優れた勤務に対して賞を受賞した。","type":"adjective","meaning_category":"Military Rank"},{"sentence":"The noncommissioned corps is the backbone of the army.","translation":"下士官隊は陸軍の屋台骨である。","type":"adjective","meaning_category":"Military Rank"}]}