{"word":"blood-conserving","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"血液を温存する、節約する、または保護する","english_definition":"aimed at conserving, saving, or protecting blood, especially during medical procedures.","examples":[{"sentence":"The hospital implemented blood-conserving techniques during surgery to minimize the need for transfusions.","translation":"その病院では、輸血の必要性を最小限に抑えるため、手術中に血液温存技術を導入しました。"},{"sentence":"A blood-conserving strategy is crucial for patients with anemia.","translation":"貧血の患者にとって、血液温存戦略は非常に重要です。"},{"sentence":"The new device is designed to be blood-conserving, reducing blood loss during the procedure.","translation":"その新しいデバイスは、手術中の出血量を減らすように設計された血液温存型です。"}],"collocations":["blood-conserving techniques","blood-conserving strategies","blood-conserving measures","blood-conserving device","blood-conserving surgery"],"synonyms":["blood-sparing","blood-saving"],"antonyms":["blood-wasting"],"related_terms":["autologous blood transfusion","cell salvage","hemodilution","tranexamic acid"],"notes":"This term is commonly used in the medical field, particularly in the context of surgery and patient care. It refers to methods and technologies that help to minimize blood loss and the need for blood transfusions.","priority":"★★☆"}],"etymology":{"value":"The term is a compound word formed by combining \"blood\" (referring to the fluid circulating in the body) and \"conserving\" (meaning to preserve, protect, or save).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈblʌd kənˌsɜːrvɪŋ/","syllables":"blood-con-serv-ing"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Blood-conserving' is typically used in medical contexts to describe procedures, techniques, or devices that help to reduce blood loss or the need for blood transfusions. It emphasizes the importance of preserving the patient's own blood whenever possible.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ blood conserving","correct":"✓ blood-conserving","note":"The term is usually hyphenated when used as an adjective before a noun."}],"priority":"★☆☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'blood-conserving' is a technical term primarily used in medical contexts. It refers to methods or techniques used to minimize blood loss during medical procedures, especially surgery. Understanding this term requires some familiarity with medical terminology."},"example_sentences":[{"sentence":"The surgeons used **blood-conserving** methods during the operation.","translation":"外科医は手術中に血液温存法を用いました。","type":"general","meaning_category":"technique"},{"sentence":"A **blood-conserving** approach is essential for patients at risk of anemia.","translation":"貧血のリスクがある患者には、血液温存アプローチが不可欠です。","type":"general","meaning_category":"approach"},{"sentence":"The hospital promotes **blood-conserving** surgical practices.","translation":"その病院は血液温存手術を推進しています。","type":"general","meaning_category":"practice"}]}