{"word":"thoracolumbar","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"胸腰部の、胸部と腰部に関する","english_definition":"relating to or affecting the thoracic and lumbar regions of the spine.","examples":[{"sentence":"The patient experienced thoracolumbar pain after the accident.","translation":"患者は事故後、胸腰部の痛みを訴えた。"},{"sentence":"A thoracolumbar brace may be prescribed for certain spinal conditions.","translation":"特定の脊椎疾患に対して、胸腰部ブレースが処方されることがある。"}],"collocations":["thoracolumbar spine","thoracolumbar fascia","thoracolumbar pain","thoracolumbar injury","thoracolumbar brace"],"synonyms":["dorsolumbar"],"antonyms":[]}],"etymology":{"value":"Derived from the combination of \"thoraco-\" (relating to the thorax or chest) and \"lumbar\" (relating to the lumbar region or lower back).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌθɔːrækəˈlʌmbər/","syllables":"tho-ra-co-lum-bar"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"The term \"thoracolumbar\" is primarily used in medical and anatomical contexts to describe structures, regions, or conditions that involve both the thoracic (chest) and lumbar (lower back) areas of the spine. It is often used to specify the location of pain, injuries, or medical procedures.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The thoracolumbar area is in the neck.","correct":"✓ The thoracolumbar area is in the back, specifically the chest and lower back.","note":"The thoracolumbar area refers to the thoracic and lumbar regions of the spine, not the neck."}],"priority":"★☆☆"},"related_words":{"derivatives":["thoracic","lumbar","spine","vertebra"],"related_terms":["thoracolumbosacral"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in medical and scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"thoracolumbar\" is a specialized term used in medicine and anatomy. It describes something that relates to both the thoracic (chest) and lumbar (lower back) regions of the spine. Because it's a technical term, it's not commonly used in everyday language. Understanding this word is important in medical contexts when describing the location of injuries, pain, or conditions affecting the spine.","priority":"★☆☆"},"example_sentences":[{"sentence":"The MRI revealed a thoracolumbar fracture.","translation":"MRI検査で胸腰部骨折が明らかになった。","type":"medical","meaning_category":"relating to the spine"},{"sentence":"The thoracolumbar fascia plays a crucial role in back stability.","translation":"胸腰筋膜は背中の安定において重要な役割を果たす。","type":"anatomy","meaning_category":"relating to anatomy"}]}