{"word":"partitionment","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"分割、区分、仕切り","english_definition":"The act or process of dividing something into parts or sections; the state of being divided.","examples":[{"sentence":"The partitionment of the territory led to years of conflict.","translation":"その領土の分割は、長年の紛争につながった。"},{"sentence":"The partitionment of the office space allowed for better organization.","translation":"オフィススペースの仕切りによって、より良い組織化が可能になった。"}],"collocations":["territorial partitionment","office partitionment","historical partitionment"],"synonyms":["division","separation","segmentation","compartmentalization","demarcation"],"antonyms":["union","integration","consolidation"]},{"part_of_speech":"noun","definition":"（特にコンピュータの）パーティション分割","english_definition":"(Especially in computing) The division of a hard drive or other storage device into separate sections, each of which can be treated as a separate drive.","examples":[{"sentence":"The partitionment of the hard drive allowed me to install multiple operating systems.","translation":"ハードドライブのパーティション分割により、複数のオペレーティングシステムをインストールできた。"},{"sentence":"Data loss can occur if partitionment is not done correctly.","translation":"パーティション分割が正しく行われないと、データ損失が発生する可能性がある。"}],"collocations":["disk partitionment","drive partitionment","partitionment scheme"],"synonyms":["disk partitioning","drive partitioning","volume partitioning"],"antonyms":[]}],"etymology":{"value":"Derived from 'partition' (from Latin 'partitio', meaning 'division') and the suffix '-ment', indicating a state, result, or means of an action.","priority":"★★☆"},"pronunciation":{"ipa":"/pɑːrˈtɪʃənmənt/","syllables":"par-ti-tion-ment"},"inflection":{"noun_plural":"partitionments"},"usage_notes":{"explanation":"'Partitionment' is a noun that refers to the act, process, or result of dividing something into separate parts or sections. It can refer to physical division, such as dividing land or office space, or to logical division, such as partitioning a hard drive in a computer. The term is less common than 'partitioning' or 'partition', but it provides a more formal and comprehensive description of the division process.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The partitionment was made by the government.","correct":"✓ The partition was made by the government.","note":"'Partition' is more commonly used as a noun to refer to the result of the division. 'Partitionment' emphasizes the process of dividing."},{"incorrect":"✗ The partitionment of the room was very easy.","correct":"✓ Partitioning the room was very easy.","note":"'Partitioning' is often used as a gerund to describe the act of dividing."}],"priority":"★★☆"},"related_words":{"derivatives":["partition","partitioning","compartment","segment"],"phrasal_verbs":[],"related_concepts":["segmentation","division","separation","demarcation","compartmentalization"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'partitionment' is a formal noun that describes the act or process of dividing something into separate parts or sections. It is often used in contexts involving land, territories, or computer storage devices. Although less common than 'partition' or 'partitioning', it provides a more comprehensive description of the division process. Understanding this word requires a strong vocabulary and familiarity with formal language.","priority":"★☆☆"},"example_sentences":[{"sentence":"The historical partitionment of India and Pakistan resulted in significant social and political upheaval.","translation":"インドとパキスタンの歴史的な分割は、重大な社会的および政治的激変をもたらした。","type":"noun","meaning_category":"Division of territory"},{"sentence":"Effective partitionment of the database is crucial for optimizing query performance.","translation":"データベースの効果的なパーティション分割は、クエリのパフォーマンスを最適化するために重要である。","type":"noun","meaning_category":"Computer partitioning"},{"sentence":"The partitionment of the building into smaller units allowed for multiple tenants.","translation":"建物をより小さなユニットに分割することで、複数のテナントを収容できるようになった。","type":"noun","meaning_category":"Division of space"}]}