{"word":"pluridentate","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(化学)多座配位子の、複数の配位座を持つ","english_definition":"(chemistry) Having multiple points of attachment to a central atom or ion; multidentate.","examples":[{"sentence":"EDTA is a pluridentate ligand that can bind to a metal ion through multiple atoms.","translation":"EDTAは複数の原子を介して金属イオンに結合できる多座配位子です。"}],"collocations":[],"synonyms":["multidentate","polydentate"],"antonyms":["monodentate","unidentate"]}],"etymology":{"value":"Derived from the Latin words \"pluri-\" meaning \"more than one\" and \"dentate\" meaning \"toothed\" or \"having teeth\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌplʊərɪˈdɛnteɪt/","syllables":"plu-ri-den-tate"},"inflection":{"notes":"Does not inflect."},"usage_notes":{"explanation":"In chemistry, particularly coordination chemistry, pluridentate ligands are molecules or ions that can bind to a central metal atom through more than one atom. These ligands are also known as chelating agents. The number of points of attachment is indicated by prefixes such as bidentate (two points), tridentate (three points), tetradentate (four points), etc.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["pluridentation (noun)"],"phrasal_verbs":[],"related_terms":["ligand","chelate","coordination complex","bidentate","tridentate","tetradentate"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term \"pluridentate\" is a specialized term used in chemistry, specifically in the field of coordination chemistry. It refers to ligands that have multiple points of attachment to a central metal atom. Understanding this term requires a background in chemistry concepts, particularly those related to coordination complexes and ligand binding. It is not commonly used outside of this specific scientific context."},"example_sentences":[{"sentence":"The pluridentate ligand formed a stable complex with the metal ion.","translation":"多座配位子は金属イオンと安定な錯体を形成した。","type":"general","meaning_category":"chemical"},{"sentence":"Researchers are studying the effects of different pluridentate ligands on catalytic activity.","translation":"研究者たちは、触媒活性に対するさまざまな多座配位子の影響を研究している。","type":"research","meaning_category":"chemical"}]}