{"word":"phylogenetic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"系統発生の、系統発生的な","english_definition":"relating to the evolutionary development and diversification of a species or group of organisms, or of a particular feature of an organism.","examples":[{"sentence":"Phylogenetic analysis can help us understand the relationships between different species.","translation":"系統発生学的分析は、異なる種間の関係を理解するのに役立ちます。"},{"sentence":"The phylogenetic tree shows the evolutionary history of these organisms.","translation":"系統樹は、これらの生物の進化の歴史を示しています。"},{"sentence":"We used a phylogenetic approach to study the evolution of this gene.","translation":"この遺伝子の進化を研究するために、系統発生学的なアプローチを用いました。"}],"collocations":["phylogenetic tree (系統樹)","phylogenetic analysis (系統発生学的分析)","phylogenetic relationships (系統発生学的関係)","phylogenetic methods (系統発生学的方法)","phylogenetic study (系統発生学的研究)","phylogenetic signal (系統発生学的シグナル)"],"synonyms":["evolutionary","cladistic"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'phylon' (tribe, race) and 'genesis' (origin, birth).","priority":"★★★"},"pronunciation":{"ipa":"/ˌfaɪlədʒəˈnɛtɪk/","syllables":"phy-lo-ge-net-ic"},"inflection":{"notes":"Does not inflect; it's an adjective."},"usage_notes":{"explanation":"'Phylogenetic' is primarily used in the context of biology, specifically evolutionary biology. It describes the evolutionary relationships among organisms, genes, or other entities. It's often used in conjunction with terms like 'analysis,' 'tree,' or 'relationships' to describe studies or representations of evolutionary history.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The physiological tree shows the evolutionary history.","correct":"✓ The phylogenetic tree shows the evolutionary history.","note":"'Phylogenetic' (evolutionary relationships) is often confused with 'physiological' (functions of living organisms). Use the correct term to describe evolutionary history."}],"priority":"★★☆"},"related_words":{"derivatives":["phylogeny (名詞: 系統発生)","phylogenetically (副詞: 系統発生的に)"],"phrasal_verbs":[],"related_terms":["cladistics","evolutionary biology","systematics","taxonomy"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Phylogenetic' is a specialized term used in biology to describe something related to the evolutionary history and relationships of organisms. It's often found in scientific papers and discussions about evolution. Understanding this word requires some background knowledge in biology.","priority":"★★☆"},"example_sentences":[{"sentence":"The researchers constructed a detailed phylogenetic tree of primates.","translation":"研究者たちは霊長類の詳細な系統樹を作成した。","type":"example","meaning_category":"evolutionary relationships"},{"sentence":"Phylogenetic methods are used to trace the origins of viruses.","translation":"系統発生学的方法は、ウイルスの起源をたどるために使用される。","type":"example","meaning_category":"evolutionary analysis"},{"sentence":"The study revealed the phylogenetic relationships between different species of bacteria.","translation":"その研究は、異なる種類の細菌間の系統発生学的関係を明らかにした。","type":"example","meaning_category":"evolutionary relationships"}]}