{"word":"cavilingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"あら探しをして、けちをつけて、難癖をつけて","english_definition":"In a carping, fault-finding, or captious manner; making petty or unnecessary objections.","examples":[{"sentence":"He cavilingly criticized every detail of her presentation.","translation":"彼は彼女のプレゼンテーションのあらゆる細部に難癖をつけた。"},{"sentence":"She cavilingly pointed out minor errors in the report.","translation":"彼女は報告書の些細な誤りをあら探しするように指摘した。"},{"sentence":"The reviewer cavilingly dismissed the film as unoriginal.","translation":"その評論家は、その映画を独創性がないと難癖をつけて切り捨てた。"}],"collocations":["criticize cavilingly","point out cavilingly","dismiss cavilingly"],"synonyms":["captiously","carpingly","faultfindingly","nitpickingly","pettifoggingly","quibblingly"],"antonyms":["approvingly","complimentarily","laudatorily","praisingly"]}],"etymology":{"value":"Derived from the verb 'cavil' (to make petty or unnecessary objections) and the suffix '-ingly' (in a specified manner). 'Cavil' comes from the Latin word 'cavillari,' meaning 'to raise trifling objections.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkævɪlɪŋli/","syllables":"cav-il-ing-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Cavilingly' describes an action or manner of speaking that is characterized by making trivial or unnecessary objections. It suggests a tendency to find fault with minor details, often in a way that is annoying or irritating to others. The word implies a negative and critical attitude.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He cavilingly accepted the gift.","correct":"He grudgingly accepted the gift.","note":"'Cavilingly' implies criticism or fault-finding, which is the opposite of accepting something gracefully. 'Grudgingly' would be more appropriate in this context."}],"priority":"★★★"},"related_words":{"derivatives":["cavil (verb/noun)","caviler (noun)","caviling (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cavilingly' is an advanced word that describes the act of criticizing or finding fault in a petty or annoying way. It is not commonly used in everyday conversation but may appear in formal writing or literature to convey a sense of excessive criticism or nitpicking. Understanding this word requires a strong vocabulary and an understanding of nuanced language.","priority":"★★☆"},"example_sentences":[{"sentence":"The editor cavilingly scrutinized every sentence, searching for errors.","translation":"編集者はあら探しをするようにすべての文を精査し、誤りを探した。","type":"general","meaning_category":"criticizing"},{"sentence":"She cavilingly dismissed his suggestions, offering no constructive alternatives.","translation":"彼女は彼の提案を難癖をつけて退け、建設的な代替案を何も提示しなかった。","type":"general","meaning_category":"dismissing"},{"sentence":"He cavilingly complained about the temperature of the coffee, even though it was freshly brewed.","translation":"彼はコーヒーが淹れたてであるにもかかわらず、その温度について難癖をつけて文句を言った。","type":"general","meaning_category":"complaining"}]}