{"word":"refeed","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"再び餌を与える、再給餌する","english_definition":"To feed again; especially, to gradually reintroduce food after a period of starvation or restricted eating.","examples":[{"sentence":"The doctor instructed the nurses to refeed the patient slowly to avoid complications.","translation":"医師は看護師に、合併症を避けるために患者にゆっくりと再給餌するように指示した。"},{"sentence":"After the surgery, the animal shelter staff had to refeed the rescued animals.","translation":"手術後、動物保護施設のスタッフは救助された動物たちに再給餌しなければならなかった。"}],"collocations":["refeed a patient","refeed an animal","refeed slowly","refeed carefully"],"synonyms":["feed again","nourish again","replenish food","provide sustenance again"],"antonyms":["starve","deprive of food","withhold food"]},{"part_of_speech":"noun","definition":"再給餌、再給餌の行為","english_definition":"The act of feeding again, especially after a period of starvation or restricted eating.","examples":[{"sentence":"The refeed process must be carefully monitored.","translation":"再給餌のプロセスは注意深く監視されなければならない。"},{"sentence":"A successful refeed is crucial for recovery.","translation":"再給餌の成功は回復にとって非常に重要である。"}],"collocations":["refeed process","refeed protocol","refeed schedule","successful refeed","careful refeed"],"synonyms":["refed","feeding again","renourishment"],"antonyms":["starvation","food deprivation"]}],"etymology":{"value":"The word 'refeed' is formed by combining the prefix 're-' (meaning 'again' or 'anew') with the verb 'feed'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌriːˈfiːd/","syllables":"re-feed"},"inflection":{"verb_forms":{"present_simple":["refeed","refeeds"],"past_simple":"refed","past_participle":"refed","present_participle":"refeeding"},"noun_plural":"refeeds"},"usage_notes":{"explanation":"'Refeed' is commonly used in medical and veterinary contexts to describe the process of gradually reintroducing food to individuals or animals that have been starved or have had their food intake severely restricted. It's important to do this carefully to avoid refeeding syndrome, a potentially fatal metabolic disturbance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I will re-feed the dog tomorrow.","correct":"✓ I will refeed the dog tomorrow.","note":"While 're-feed' with a hyphen is sometimes used, 'refeed' as one word is more common and generally preferred."},{"incorrect":"✗ The refeed was done too fast, causing complications.","correct":"✓ The refeeding was done too fast, causing complications.","note":"'Refeeding' as a gerund (verb acting as a noun) can be used to describe the act of refeeding."}],"priority":"★★☆"},"related_words":{"derivatives":["refeeding (noun: the process of refeeding)","refeeding syndrome (noun: a potentially fatal metabolic disturbance that can occur when nutrition is reintroduced too quickly after starvation)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Refeed' is a specialized term primarily used in medical and veterinary contexts. It refers to the process of gradually reintroducing food after a period of starvation or severe dietary restriction. Understanding this term requires familiarity with related concepts such as malnutrition, starvation, and metabolic processes. It's important to note the potential risks associated with refeeding, such as refeeding syndrome, which requires careful monitoring and management."},"example_sentences":[{"sentence":"The nutritionist designed a careful refeed plan for the patient.","translation":"栄養士は患者のために慎重な再給餌プランを作成した。","type":"noun","meaning_category":"再給餌"},{"sentence":"They had to refeed the injured bird with a special formula.","translation":"彼らは怪我をした鳥に特別な調合飼料で再給餌しなければならなかった。","type":"verb","meaning_category":"再給餌する"},{"sentence":"Rapid refeeding can lead to dangerous electrolyte imbalances.","translation":"急速な再給餌は危険な電解質バランスの崩れにつながる可能性がある。","type":"noun","meaning_category":"再給餌"},{"sentence":"The vet will refeed the cat gradually over several days.","translation":"獣医は数日かけて猫に徐々に再給餌する予定だ。","type":"verb","meaning_category":"再給餌する"}]}