{"word":"perigynous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(植物学) 周位花の、花托筒が子房を囲む花の","english_definition":"(botany) (of flowers) having the perianth and stamens borne on a cup-shaped or tubular extension of the receptacle surrounding, but not adnate to, the ovary.","examples":[{"sentence":"A rose is a perigynous flower.","translation":"バラは周位花です。"},{"sentence":"Perigynous flowers exhibit a hypanthium.","translation":"周位花は花托筒を示します。"}],"collocations":["perigynous flower","perigynous ovary"],"synonyms":["hypanthium"],"antonyms":["hypogynous","epigynous"]}],"etymology":{"value":"Derived from the Greek words 'peri' (around) and 'gynē' (woman, referring to the pistil or ovary of the flower).","priority":"★★☆"},"pronunciation":{"ipa":"/pəˈrɪdʒɪnəs/","syllables":"pe-ri-gy-nous"},"inflection":{"notes":"Adjective; comparative and superlative forms are more perigynous and most perigynous, respectively, but are rarely used."},"usage_notes":{"explanation":"'Perigynous' is a botanical term used to describe a specific floral structure where the ovary is neither superior (hypogynous) nor inferior (epigynous), but rather the floral parts (sepals, petals, and stamens) are attached around the ovary on a floral tube called a hypanthium. It's a key feature in plant taxonomy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The fruit is perigynous.","correct":"✓ The flower is perigynous.","note":"'Perigynous' describes the flower structure, not the fruit."},{"incorrect":"✗ Perigynous means the ovary is above the other floral parts.","correct":"✓ Perigynous means the ovary is surrounded by a floral tube, with the other floral parts attached around it.","note":"Perigynous is different from hypogynous (ovary above) and epigynous (ovary below)."}],"priority":"★★☆"},"related_words":{"derivatives":["perigyny (noun): the condition of being perigynous"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (specialized botanical term)","frequency_google_ngram":"Very low frequency (specialized term)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Perigynous' is a technical term used in botany to describe a specific type of flower structure. It refers to flowers where the ovary is neither superior nor inferior, but rather has the other floral parts (sepals, petals, and stamens) attached around it on a cup-shaped structure called a hypanthium. This term is primarily used in scientific contexts when discussing plant morphology and classification. Understanding this term requires a background in botany or plant biology."},"example_sentences":[{"sentence":"The cherry blossom exhibits a perigynous flower structure.","translation":"桜の花は周位花の構造を示しています。","type":"descriptive","meaning_category":"botany"},{"sentence":"In perigynous flowers, the hypanthium plays a crucial role in pollination.","translation":"周位花では、花托筒が受粉において重要な役割を果たします。","type":"functional","meaning_category":"botany"}]}