{"word":"quickthorn","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"サンザシ（山査子）","english_definition":"A common thorny shrub or small tree (Crataegus monogyna) with white flowers and red berries, often used for hedging.","examples":[{"sentence":"The field was surrounded by a thick hedge of quickthorn.","translation":"その畑はサンザシの生垣で囲まれていた。"},{"sentence":"Quickthorn is a popular choice for creating wildlife-friendly boundaries.","translation":"サンザシは、野生生物に優しい境界を作るための一般的な選択肢です。"}],"collocations":["quickthorn hedge","quickthorn berries","plant quickthorn","grow quickthorn"],"synonyms":["hawthorn","maythorn","whitethorn"],"antonyms":[]}],"etymology":{"value":"The name \"quickthorn\" refers to the plant's use as a hedging plant, where it quickly forms a dense, impenetrable barrier due to its thorns. \"Quick\" in this context means \"living\" or \"alive,\" referring to the plant's ability to quickly establish and grow.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkwɪkˌθɔːrn/","syllables":"quick-thorn"},"inflection":{"noun_plural":"quickthorns"},"usage_notes":{"explanation":"\"Quickthorn\" is primarily used in British English. It is a common name for the hawthorn tree, particularly Crataegus monogyna. The term emphasizes its use as a hedging plant.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a quickthorn rose in the garden.","correct":"✓ I saw a hawthorn rose in the garden.","note":"Quickthorn is a type of hawthorn, not a rose. If you mean a rose, use 'rose'. If you mean a hawthorn, use 'hawthorn' or 'quickthorn'."}],"priority":"★☆☆"},"related_words":{"derivatives":["haw (the fruit of the hawthorn)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Quickthorn\" is a relatively uncommon term, primarily used in British English, to refer to the hawthorn tree, especially when used for hedging. Understanding the term requires familiarity with botanical vocabulary and regional variations in plant names."},"example_sentences":[{"sentence":"The farmer planted a quickthorn hedge to keep the sheep in the field.","translation":"農夫は羊を畑に閉じ込めるためにサンザシの生垣を植えた。","type":"noun","meaning_category":"plant"},{"sentence":"Birds often nest in the dense branches of the quickthorn.","translation":"鳥はしばしばサンザシの密集した枝に巣を作る。","type":"noun","meaning_category":"habitat"}]}