{"word":"unevinced","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"確信していない、納得していない","english_definition":"Not convinced; not persuaded to believe something.","examples":[{"sentence":"Despite the evidence, he remained unevinced of her guilt.","translation":"証拠があるにもかかわらず、彼は彼女の有罪を確信していなかった。"},{"sentence":"The jury seemed unevinced by the lawyer's arguments.","translation":"陪審員は弁護士の主張に納得していないようだった。"},{"sentence":"I am still unevinced that this is the right course of action.","translation":"これが正しい行動方針だと、私はまだ確信していません。"}],"collocations":["remain unevinced","seem unevinced","still unevinced"],"synonyms":["unconvinced","unsure","doubtful","skeptical","dubious","hesitant"],"antonyms":["convinced","certain","sure","persuaded","confident"]}],"etymology":{"value":"\"Unevinced\" is formed by adding the prefix \"un-\" (meaning \"not\") to the past participle of the verb \"evince.\" \"Evince\" comes from Latin \"evincere,\" meaning \"to overcome, prove, demonstrate.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnɪˈvɪnst/","syllables":"un-e-vinced"},"inflection":{"notes":"This is an adjective and does not have different forms."},"usage_notes":{"explanation":"\"Unevinced\" is a relatively uncommon word that specifically describes a state of not being convinced or persuaded, often despite the presentation of evidence or arguments. It suggests a continued state of doubt or skepticism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was unevinced to the truth.","correct":"✓ He was unevinced of the truth.","note":"The correct preposition to use with \"unevinced\" is \"of.\" It should be \"unevinced of\" something. "},{"incorrect":"✗ She felt unevinced.","correct":"✓ She felt unconvinced.","note":"While \"unevinced\" is correct, \"unconvinced\" is more common and natural-sounding in general usage. \"Unevinced\" is often used when there is a specific argument or evidence presented."}],"priority":"★☆☆"},"related_words":{"derivatives":["evince (verb: to show or demonstrate clearly)","evinced (adjective: having been shown or demonstrated)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unevinced' is a formal and relatively rare word that means 'not convinced' or 'not persuaded.' It is often used when someone remains skeptical despite evidence or arguments presented to them. Because it is not commonly used, it is considered a more advanced vocabulary word."},"example_sentences":[{"sentence":"The senator remained **unevinced** by the lobbyist's promises.","translation":"上院議員はロビイストの約束に納得しなかった。","type":"adjective","meaning_category":"確信していない"},{"sentence":"Despite the compelling data, the board members were **unevinced** of the project's feasibility.","translation":"説得力のあるデータにもかかわらず、取締役たちはプロジェクトの実現可能性を確信していなかった。","type":"adjective","meaning_category":"納得していない"},{"sentence":"He was **unevinced** of the defendant's innocence, despite the emotional testimony.","translation":"感情的な証言にもかかわらず、彼は被告の無罪を確信していなかった。","type":"adjective","meaning_category":"確信していない"}]}