{"word":"Mammie","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に米国南部で) 黒人女性の乳母、子守、または家政婦 (特に白人の子供の世話をする人)。歴史的な文脈では、しばしばステレオタイプ化された役割を指す。","english_definition":"(chiefly in the southern US) a Black woman employed as a nanny, caregiver, or domestic servant, especially one caring for white children. In historical contexts, often refers to a stereotyped role.","examples":[{"sentence":"The character of Mammie in the movie 'Gone with the Wind' is a controversial representation of this historical figure.","translation":"映画『風と共に去りぬ』の乳母（マミー）のキャラクターは、この歴史的な人物像の物議を醸す表現である。"},{"sentence":"Historically, mammies held a position of authority within the household, but were still subject to racial discrimination.","translation":"歴史的に、乳母（マミー）は家庭内で権威ある地位を占めていたが、依然として人種差別を受けていた。"}],"collocations":["plantation mammie","domestic mammie","Aunt Jemima (related stereotype)"],"synonyms":["nanny","nursemaid","housekeeper","domestic servant"],"antonyms":[],"usage_notes":"The term 'Mammie' is now considered offensive by many due to its association with slavery and racial stereotypes. It is important to be aware of the historical context and potential harm when using this word.","etymology":"Derived from 'mama' or 'mommy', reflecting the caregiver role. The specific spelling and usage of 'Mammie' developed in the context of slavery and racial segregation in the United States.","related_words":["Uncle Tom (another racial stereotype)","Jim Crow laws","plantation","slavery","racial stereotype"],"level_frequency":{"frequency_google_ngram":"Low frequency, usage is declining due to its problematic connotations.","CEFR":"Not applicable (due to cultural and historical specificity)"}}],"pronunciation":{"ipa":"/ˈmæmi/","syllables":"Mam-mie"},"inflection":{"noun_plural":"Mammies"},"common_mistakes":{"examples":[{"incorrect":"Using 'Mammie' to refer to any Black caregiver.","correct":"Avoid using the term 'Mammie' due to its offensive connotations. Use neutral terms like 'nanny' or 'caregiver' instead.","note":"The term carries a heavy historical baggage and should be avoided in contemporary usage."}]}}