{"word":"unheler","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare, nonstandard) A person who does not help; one who hinders or obstructs.","english_definition":"A person who does not help; one who hinders or obstructs.","examples":[{"sentence":"He was more of an unheler than a helper on the project.","translation":"彼はプロジェクトにおいて、助ける人というよりむしろ妨げる人だった。"}],"collocations":[],"synonyms":["hindrance","obstructor","impediment"],"antonyms":["helper","assistant","aid"]}],"etymology":{"value":"Formed by adding the prefix \"un-\" (not) to \"heler\" (helper). \"Heler\" is an archaic or dialectal form of \"helper.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈhiːlər/","syllables":"un-he-ler"},"inflection":{"noun_plural":"unhelers"},"usage_notes":{"explanation":"\"Unheler\" is a rare and somewhat nonstandard word. It is not commonly used in modern English. The more standard term would be someone who hinders or obstructs. It is primarily found in older texts or dialectal speech.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was an unhealer in the team.","correct":"✓ He was a hindrance to the team. / ✓ He hindered the team.","note":"\"Unhealer\" is not a recognized word. Use \"hindrance\" or rephrase the sentence."}],"priority":"★★☆"},"related_words":{"derivatives":["unhelp","unhelpful"],"related_terms":["helper","hinder","obstruct"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency. Not commonly found in modern texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2 (due to rarity)","text":"\"Unheler\" is a very uncommon word, and its meaning is readily understood from its construction (un- + heler). It is best avoided in formal writing due to its nonstandard nature. Use more common alternatives such as \"hindrance\" or \"obstructor.\""},"example_sentences":[{"sentence":"Instead of being a helper, he proved to be an unheler, constantly creating problems.","translation":"助けになるどころか、彼は妨げにしかならず、常に問題ばかり起こしていた。","type":"noun","meaning_category":"One who hinders"}]}