{"word":"Philonism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A philosophical system or doctrine that emphasizes love, benevolence, and altruism as central principles.","english_definition":"A philosophical system or doctrine that emphasizes love, benevolence, and altruism as central principles.","examples":[{"sentence":"Philonism, in its purest form, advocates for universal compassion and understanding.","translation":"ピロニズムは、その最も純粋な形で、普遍的な思いやりと理解を提唱しています。"},{"sentence":"The core tenets of Philonism are often reflected in ethical and moral discussions.","translation":"ピロニズムの中核的な教義は、倫理的および道徳的な議論に反映されることがよくあります。"}],"collocations":["principles of Philonism","tenets of Philonism","ethical Philonism","moral Philonism"],"synonyms":["altruism","benevolence","humanitarianism","philanthropy","compassion"],"antonyms":["egoism","selfishness","malevolence","misanthropy"]}],"etymology":{"value":"Derived from the Greek word 'philos' (φίλος), meaning 'loving' or 'friend.' The suffix '-ism' denotes a system or doctrine.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfaɪləˌnɪzəm/","syllables":"Phi-lo-nism"},"inflection":{"noun_plural":"Philonisms"},"usage_notes":{"explanation":"'Philonism' is a relatively rare term, primarily used in philosophical or academic contexts. It is closely related to the concept of 'philia' (φιλία) in ancient Greek philosophy, which signifies a type of affectionate regard or friendship, but extends this notion to a broader ethical framework.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practiced philonism by only helping his family.","correct":"✓ He practiced altruism by helping those in need, reflecting a form of Philonism.","note":"Philonism encompasses broader altruistic principles, not just familial help. Altruism is a more common term for general acts of kindness."},{"incorrect":"✗ Philonism is the opposite of love.","correct":"✓ Philonism is based on love and benevolence.","note":"Philonism emphasizes love, benevolence, and altruism, not the opposite."}],"priority":"★☆☆"},"related_words":{"derivatives":["Philonist (noun: a follower or advocate of Philonism)","Philonistic (adjective: relating to or characteristic of Philonism)"],"phrases":["Philonistic ethics","Philonistic principles"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - primarily used in philosophical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Philonism' is a term that refers to a philosophical system centered on love, benevolence, and altruism. It is derived from the Greek word for 'love' or 'friendship.' This concept is most often encountered in academic discussions related to ethics, moral philosophy, and the history of ideas. Understanding this term requires familiarity with philosophical terminology and abstract concepts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The philosopher argued that Philonism is essential for creating a harmonious society.","translation":"その哲学者は、ピロニズムが調和のとれた社会を創造するために不可欠であると主張した。","type":"general","meaning_category":"philosophical system"},{"sentence":"Her actions exemplified Philonism by consistently prioritizing the well-being of others.","translation":"彼女の行動は、常に他者の幸福を優先することによって、ピロニズムを体現していた。","type":"behavioral","meaning_category":"altruistic behavior"},{"sentence":"Critics of Philonism argue that it can be impractical in real-world scenarios.","translation":"ピロニズムの批評家は、それが現実世界では非現実的であると主張している。","type":"critical","meaning_category":"philosophical critique"}]}