{"word":"receivability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"受信可能性、受容性、受け入れやすさ","english_definition":"The quality or state of being receivable; the capacity or willingness to receive or accept something.","examples":[{"sentence":"The receivability of the new policy depends on its clarity and fairness.","translation":"新しい政策の受容性は、その明確さと公平さにかかっている。"},{"sentence":"The artist was concerned about the receivability of his controversial work.","translation":"その芸術家は、自身の物議を醸す作品の受け入れやすさを懸念していた。"},{"sentence":"The receivability of the signal was affected by the weather conditions.","translation":"信号の受信可能性は、気象条件の影響を受けた。"}],"collocations":["signal receivability (信号の受信可能性)","message receivability (メッセージの受信可能性)","policy receivability (政策の受容性)","idea receivability (アイデアの受容性)"],"synonyms":["acceptability","receptiveness","accessibility","permeability","openness","amenability"],"antonyms":["unacceptability","irreceptibility","inaccessibility","impermeability","unwillingness"]},{"part_of_speech":"noun","definition":"(電気通信)受信できる状態、受信品質","english_definition":"(Telecommunications) The state of being able to be received, especially referring to signals or transmissions.","examples":[{"sentence":"Improving the antenna increased the receivability of the television signal.","translation":"アンテナを改良することで、テレビ信号の受信品質が向上した。"},{"sentence":"The receivability of the data stream was tested under various network conditions.","translation":"データストリームの受信状態は、さまざまなネットワーク条件下でテストされた。"}],"collocations":["data receivability (データの受信可能性)","signal receivability (信号の受信可能性)","transmission receivability (送信の受信可能性)"],"synonyms":["signal strength","clarity","quality of reception"],"antonyms":["signal loss","interference","poor reception"]}],"etymology":{"value":"Derived from 'receivable' (capable of being received) + '-ity' (suffix indicating a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˌsiːvəˈbɪləti/","syllables":"re-ceiv-a-bil-i-ty"},"inflection":{"noun_plural":"receivabilities (rarely used)"},"usage_notes":{"explanation":"'Receivability' is a relatively uncommon word, primarily used in technical or formal contexts. It refers to the capacity or quality of something being received, whether it's a physical signal, a message, or an abstract concept like a policy or idea. The term often implies an assessment of how well something can be understood, accepted, or processed.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The receivability was good.","correct":"The reception was good. / The receivability of the signal was good.","note":"'Reception' is more commonly used to refer to the quality of a received signal. 'Receivability' is more appropriate when discussing the potential or capacity for something to be received."},{"incorrect":"The receivability of the gift was appreciated.","correct":"The acceptance of the gift was appreciated.","note":"For gifts or other offerings, 'acceptance' or 'reception' (in the sense of a welcoming) is more common than 'receivability'."}],"priority":"★★☆"},"related_words":{"derivatives":["receivable (adjective: capable of being received)","receive (verb: to get or accept something)","reception (noun: the act of receiving; the quality of a received signal)","receptive (adjective: willing to receive new ideas or suggestions)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Receivability' is a formal and technical term that describes the capacity or quality of something being able to be received. This can refer to physical signals (like radio waves), data transmissions, or abstract concepts like ideas or policies. It's often used in contexts where assessing the potential for understanding, acceptance, or processing is important. Because it's a less common word, it's important to ensure the context makes its meaning clear."},"example_sentences":[{"sentence":"The company assessed the receivability of the proposed changes to the employee benefits package.","translation":"会社は、従業員給付パッケージに対する提案された変更の受容性を評価した。","type":"noun","meaning_category":"受容性"},{"sentence":"Engineers worked to improve the receivability of the satellite signal in remote areas.","translation":"エンジニアは、遠隔地での衛星信号の受信可能性を向上させるために尽力した。","type":"noun","meaning_category":"受信可能性"},{"sentence":"The receivability of the new marketing campaign's message was tested with focus groups.","translation":"新しいマーケティングキャンペーンのメッセージの受容性は、フォーカスグループでテストされた。","type":"noun","meaning_category":"受容性"}]}