{"word":"armorialist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"紋章学者、紋章研究家","english_definition":"A person who studies or is knowledgeable about heraldry and coats of arms.","examples":[{"sentence":"The armorialist was able to identify the family crest on the antique shield.","translation":"その紋章学者は、アンティークの盾にある家紋を特定することができた。"},{"sentence":"Armorialists often consult historical records to trace the origins of different coats of arms.","translation":"紋章学者たちは、様々な紋章の起源を辿るために、しばしば歴史的な記録を調べる。"}],"collocations":["consult an armorialist","hire an armorialist","armorialist society"],"synonyms":["heraldist","heraldry expert"],"antonyms":[]}],"etymology":{"value":"The word 'armorialist' is derived from 'armorial,' which relates to heraldry or coats of arms. 'Armorial' comes from the Latin 'arma,' meaning 'arms' or 'weapons,' referring to the arms displayed on a coat of arms. The suffix '-ist' denotes a person who studies or is skilled in a particular field.","priority":"★★☆"},"pronunciation":{"ipa":"/ɑːrˈmɔːriəlɪst/","syllables":"ar-mo-ri-al-ist"},"inflection":{"noun_plural":"armorialists"},"usage_notes":{"explanation":"An 'armorialist' is someone with expertise in heraldry, the system of coats of arms and other heraldic devices. They may study the history, design, and significance of these symbols, and may also be involved in creating or registering new coats of arms. The term is relatively specialized and less commonly used than 'heraldist.'","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an armorial artist.","correct":"✓ He is an armorialist.","note":"'Armorial artist' might refer to someone who creates artistic depictions of coats of arms, but the correct term for a heraldry expert is 'armorialist'."}],"priority":"★☆☆"},"related_words":{"derivatives":["armorial (adjective, noun)","armory (noun)","heraldry (noun)","heraldic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'armorialist' is a specialized term referring to an expert in heraldry, the study of coats of arms and related symbols. This word is not commonly used in everyday conversation and is typically found in historical or academic contexts related to genealogy, history, or art history. Understanding this word requires familiarity with the field of heraldry."},"example_sentences":[{"sentence":"The museum hired an **armorialist** to catalog the heraldic symbols in their collection.","translation":"博物館は、所蔵品にある紋章のシンボルをカタログ化するために、紋章学者を雇った。","type":"noun","meaning_category":"紋章学者"},{"sentence":"As a skilled **armorialist**, she could identify the lineage of noble families through their coats of arms.","translation":"熟練した紋章学者として、彼女は貴族の家系を紋章を通して特定することができた。","type":"noun","meaning_category":"紋章学者"}]}