{"word":"Malayo-Negrito","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"マレー・ネグリト。東南アジアに分布する、ネグリトと呼ばれる人々に、マレー系の文化や言語の影響が加わった集団を指す民族人類学的な用語。","english_definition":"An ethnological term referring to populations in Southeast Asia, where Negrito peoples have been influenced by Malay cultures and languages.","examples":[{"sentence":"The Malayo-Negrito groups are found in various parts of Southeast Asia.","translation":"マレー・ネグリト集団は、東南アジアの様々な地域に見られる。"},{"sentence":"Their culture represents a blend of Negrito and Malay influences.","translation":"彼らの文化は、ネグリトとマレーの影響が混ざり合ったものである。"}],"collocations":["Malayo-Negrito population","Malayo-Negrito culture","Malayo-Negrito languages"],"synonyms":["Negrito","Austronesian"],"antonyms":[]},{"part_of_speech":"adjective","definition":"マレー・ネグリトの、マレー・ネグリトに関する。","english_definition":"Relating to the Malayo-Negrito people.","examples":[{"sentence":"Malayo-Negrito languages show influences from both Negrito and Austronesian roots.","translation":"マレー・ネグリトの言語は、ネグリトとオーストロネシア語族の両方の影響を示している。"},{"sentence":"The Malayo-Negrito people have a rich and diverse cultural heritage.","translation":"マレー・ネグリトの人々は、豊かで多様な文化遺産を持っている。"}],"collocations":["Malayo-Negrito languages","Malayo-Negrito culture","Malayo-Negrito traditions"],"synonyms":["Negrito","Austronesian"],"antonyms":[]}],"etymology":{"value":"'Malayo' refers to the Malay ethnic group and cultural sphere, while 'Negrito' is a Spanish term meaning 'little black people,' used to describe certain indigenous groups in Southeast Asia with perceived African physical traits. The term reflects the historical understanding and classification of these populations.","priority":"★★☆"},"pronunciation":{"ipa":"/məˈleɪoʊ nɪˈɡriːtoʊ/","syllables":"Ma-lay-o-Ne-gri-to"},"inflection":{"notes":"単数形/複数形は文脈によって判断されます。"},"usage_notes":{"explanation":"The term 'Malayo-Negrito' is primarily used in anthropological and ethnological contexts. It is important to note that the term can be considered outdated or even offensive by some, as it is based on now-discredited racial classifications. When discussing these groups, it is often preferable to refer to them by their specific tribal or ethnic names.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Malayo-Negritos are one homogenous group.","correct":"✓ The Malayo-Negrito peoples are diverse and consist of various distinct groups.","note":"The Malayo-Negrito are not a single homogenous group, but rather a collection of diverse populations. It's important to acknowledge their diversity."}],"priority":"★☆☆"},"related_words":{"derivatives":["Negrito","Malay","Austronesian"],"phrases":["Indigenous people","Ethnic group","Cultural heritage"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Malayo-Negrito' is a specialized term used in anthropology and ethnology to describe certain indigenous populations in Southeast Asia that exhibit a blend of Negrito and Malay cultural and linguistic traits. This term is rarely used in general conversation and is more commonly found in academic or scholarly contexts. It is important to be aware of the potential sensitivities associated with this term and to use it with caution."},"example_sentences":[{"sentence":"Anthropological studies have focused on the cultural adaptations of the Malayo-Negrito communities in the face of modernization.","translation":"人類学の研究は、近代化に直面したマレー・ネグリト社会の文化的適応に焦点を当ててきた。","type":"noun","meaning_category":"民族集団"},{"sentence":"The Malayo-Negrito languages often incorporate elements from both Austronesian and indigenous vocabularies.","translation":"マレー・ネグリトの言語は、オーストロネシア語族と土着の語彙の両方の要素を取り入れていることが多い。","type":"adjective","meaning_category":"言語"}]}