{"word":"lapsation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(保険契約の)失効、(権利・特権などの)消滅、(記憶などの)喪失","english_definition":"The termination of an insurance policy due to failure to pay premiums; the cessation of a right or privilege through disuse or failure to comply with conditions; a lapse of memory or other mental function.","examples":[{"sentence":"The lapsation rate for the insurance company's policies was higher than expected.","translation":"その保険会社の保険契約の失効率は予想以上に高かった。"},{"sentence":"The lapsation of his membership occurred when he failed to pay his annual dues.","translation":"彼の会員資格は、年会費を支払わなかったために消滅した。"},{"sentence":"She experienced a brief lapsation of memory and couldn't recall where she had parked her car.","translation":"彼女は一時的な記憶喪失を経験し、どこに車を駐車したか思い出せなかった。"}],"collocations":["policy lapsation (保険契約の失効)","membership lapsation (会員資格の消滅)","memory lapsation (記憶喪失)","lapsation rate (失効率)"],"synonyms":["termination","expiration","cancellation","cessation","forfeiture","lapse","omission","failure"],"antonyms":["renewal","continuation","maintenance","retention","remembrance","recall"]}],"etymology":{"value":"Derived from the word 'lapse', which comes from the Latin word 'lapsus', meaning 'a slip, fall, error'. The suffix '-ation' is added to form a noun indicating a process or result.","priority":"★★☆"},"pronunciation":{"ipa":"/læpˈseɪʃən/","syllables":"lap-sa-tion"},"inflection":{"noun_plural":"lapsations"},"usage_notes":{"explanation":"'Lapsation' is a formal term, often used in insurance and legal contexts. It refers to the termination or invalidation of something, such as an insurance policy, membership, or right, typically due to non-payment, disuse, or failure to meet certain conditions. It can also refer to a temporary failure of memory or other mental functions, although this usage is less common.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lapsation of the event caused disappointment.","correct":"✓ The cancellation of the event caused disappointment.","note":"'Lapsation' is not typically used to describe the cancellation of an event. 'Cancellation' or 'postponement' would be more appropriate. The word is more specific to the termination of contracts, rights, or mental functions."},{"incorrect":"✗ He suffered from lapsation of consciousness.","correct":"✓ He suffered a lapse of consciousness.","note":"While 'lapsation of memory' is acceptable, 'lapse of consciousness' is more common and natural-sounding."}],"priority":"★★☆"},"related_words":{"derivatives":["lapse (noun, verb)","lapsed (adjective)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'lapsation' is a relatively uncommon and formal term. It is most frequently used in the context of insurance to describe the termination of a policy due to non-payment of premiums. It can also refer to the cessation of a right or privilege or, less commonly, to a lapse of memory. Due to its specific and formal usage, it is typically encountered in professional or legal contexts rather than in everyday conversation."},"example_sentences":[{"sentence":"The company aimed to reduce policy **lapsation** by offering flexible payment options.","translation":"会社は柔軟な支払いオプションを提供することで、保険契約の失効を減らすことを目指した。","type":"noun","meaning_category":"保険契約の失効"},{"sentence":"The **lapsation** of his lease meant he had to vacate the property immediately.","translation":"彼の賃貸契約の消滅は、彼がすぐに物件を明け渡さなければならないことを意味した。","type":"noun","meaning_category":"権利の消滅"},{"sentence":"The doctor inquired about any recent **lapsation** of memory or cognitive function.","translation":"医師は最近の記憶喪失や認知機能の低下について尋ねた。","type":"noun","meaning_category":"記憶喪失"}]}