{"word":"half-stroke","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(水泳)ハーフストローク、半ストローク","english_definition":"(swimming) a swimming stroke that is not completed fully; a stroke where the arm is not fully extended or pulled through the water.","examples":[{"sentence":"He was penalized for using a half-stroke during the butterfly event.","translation":"彼はバタフライの種目でハーフストロークを使ったとしてペナルティを受けた。"},{"sentence":"The coach corrected her half-stroke, emphasizing the importance of a full arm extension.","translation":"コーチは彼女のハーフストロークを修正し、腕を完全に伸ばすことの重要性を強調した。"}],"collocations":["perform a half-stroke","correct a half-stroke","illegal half-stroke"],"synonyms":["incomplete stroke","partial stroke"],"antonyms":["full stroke","complete stroke"]},{"part_of_speech":"noun","definition":"(書道、武道など)中途半端な動き、未完成の動作","english_definition":"an incomplete or poorly executed movement in calligraphy, martial arts, or other disciplines.","examples":[{"sentence":"His calligraphy suffered from too many half-strokes, making the characters appear weak.","translation":"彼の書道はハーフストロークが多すぎて、文字が弱々しく見えた。"},{"sentence":"The instructor warned against half-strokes in the sword form, emphasizing the need for commitment in each movement.","translation":"インストラクターは剣の型においてハーフストロークをしないように警告し、各動作へのコミットメントの必要性を強調した。"}],"collocations":["avoid half-strokes","practice full strokes instead of half-strokes"],"synonyms":["incomplete movement","unfinished action"],"antonyms":["full movement","complete action"]}],"etymology":{"value":"The term 'half-stroke' is a compound word formed by combining 'half' (meaning one of two equal parts) and 'stroke' (referring to a movement, especially in swimming or writing). It literally signifies a stroke or movement that is only partially completed.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhæf ˈstroʊk/","syllables":"half-stroke"},"inflection":{"noun_plural":"half-strokes"},"usage_notes":{"explanation":"The term 'half-stroke' generally refers to an action or movement that is not fully completed. In swimming, it specifically describes a stroke where the swimmer does not fully extend their arm or pull it completely through the water, which can reduce efficiency and speed. In other contexts, such as calligraphy or martial arts, it refers to a movement that is executed with insufficient force or commitment, resulting in a less effective or aesthetically pleasing outcome.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He did a half stroke of paint on the wall.","correct":"✓ He applied a thin coat of paint on the wall.","note":"In the context of painting, 'half-stroke' is not commonly used. Instead, describe the application as a 'thin coat' or 'partial coverage'."},{"incorrect":"✗ The swimmer had half stroked the race.","correct":"✓ The swimmer used half-strokes during the race.","note":"'Half-stroke' is typically used as a noun, not a verb. To describe the action, use 'used half-strokes'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["stroke","swimming stroke","butterfly stroke","freestyle stroke","calligraphy","martial arts","movement","technique"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (technical vocabulary related to specific activities)","frequency_google_ngram":"Low frequency - primarily used in specific contexts like swimming or calligraphy.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"half-stroke\" is a technical term used in specific contexts. In swimming, it refers to an incomplete stroke where the arm is not fully extended or pulled through the water. In other disciplines like calligraphy or martial arts, it describes a movement that is not fully executed or committed to. Understanding the term requires familiarity with the specific activity being discussed. It's not a commonly used term in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The swimmer was disqualified for consistently using a **half-stroke** during the race.","translation":"その水泳選手はレース中に一貫してハーフストロークを使ったため失格となった。","type":"noun","meaning_category":"Swimming"},{"sentence":"The calligraphy teacher criticized his **half-strokes**, urging him to commit more fully to each brush movement.","translation":"書道の先生は彼のハーフストロークを批判し、筆の動き一つ一つにもっと集中するように促した。","type":"noun","meaning_category":"Calligraphy"},{"sentence":"Using a **half-stroke** in the butterfly can tire you out faster.","translation":"バタフライでハーフストロークを使うと、より早く疲れてしまう可能性がある。","type":"noun","meaning_category":"Swimming"}]}