{"word":"bailor","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"委託者、寄託者（法律用語）","english_definition":"A person who entrusts goods to another (the bailee) for some purpose.","examples":[{"sentence":"The bailor retained ownership of the goods.","translation":"委託者は商品の所有権を保持した。"},{"sentence":"The bailor is responsible for informing the bailee of any defects in the goods.","translation":"委託者は、商品の欠陥について受託者に通知する責任がある。"}],"collocations":["bailor-bailee relationship (委託者・受託者関係)"],"synonyms":["consignor","depositor","transferor"],"antonyms":["bailee"]},{"part_of_speech":"noun","definition":"保釈保証人（古用法）","english_definition":"(archaic) One who provides bail for another.","examples":[{"sentence":"The bailor vouched for the defendant's appearance in court.","translation":"保釈保証人は被告人の出廷を保証した。"}],"collocations":[],"synonyms":["surety","bondsman"],"antonyms":["defendant"]}],"etymology":{"value":"From the Anglo-French word 'bailler', meaning 'to deliver'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbeɪlər/","syllables":"bai-lor"},"inflection":{"noun_plural":"bailors"},"usage_notes":{"explanation":"The term \"bailor\" is primarily used in legal contexts related to bailment. Bailment is a legal relationship where personal property is transferred from one person (the bailor) to another (the bailee) for a specific purpose, without transfer of ownership. The bailor retains ownership of the property. A less common, archaic meaning of \"bailor\" refers to someone who provides bail for a defendant.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bailor is the one who receives the goods.","correct":"✓ The bailor is the one who entrusts the goods.","note":"The bailor is the one who gives the goods to the bailee, not the one who receives them."}],"priority":"★☆☆"},"related_words":{"derivatives":["bailment (名詞: 委託)","bailee (名詞: 受託者)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (法律用語)","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"bailor\" is a legal term referring to the person who temporarily gives possession of their personal property to someone else (the bailee) for a specific purpose, without giving up ownership. This is known as bailment. Understanding this term is important in legal contexts involving the temporary transfer of goods or property.","priority":"★★☆"},"example_sentences":[{"sentence":"The **bailor** delivered the equipment to the repair shop.","translation":"委託者は修理工場に機器を届けた。","type":"noun","meaning_category":"委託者"},{"sentence":"As the **bailor**, she had the right to inspect the stored items.","translation":"委託者として、彼女は保管された品物を検査する権利を持っていた。","type":"noun","meaning_category":"委託者"}]}