{"word":"Worshipability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The quality of being worthy of worship or adoration.","english_definition":"The characteristic of someone or something that makes them deserving of worship or extreme admiration.","examples":[{"sentence":"The worshipability of ancient gods was often tied to their perceived power and influence.","translation":"古代の神々の崇拝可能性は、しばしば彼らの認識された力と影響力に関連付けられていました。"},{"sentence":"Some argue that the worshipability of celebrities is a dangerous trend in modern society.","translation":"有名人の崇拝可能性は、現代社会における危険な傾向であると主張する人もいます。"}],"collocations":["high worshipability","inherent worshipability","perceived worshipability","question the worshipability","attribute worshipability"],"synonyms":["adorableness","reverence","worthiness","deity","godliness"],"antonyms":["despicable","unworthiness","irreverence"]}],"etymology":{"value":"Derived from the word 'worship' and the suffix '-ability,' indicating the capacity or quality of being worshiped.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌwɜːrʃɪpəˈbɪləti/","syllables":"wor-ship-a-bil-i-ty"},"inflection":{"noun_plural":"Worshipabilities"},"usage_notes":{"explanation":"'Worshipability' is a relatively rare and somewhat abstract noun. It is used to describe the degree to which someone or something is considered worthy of worship or extreme admiration. It can be applied to deities, historical figures, celebrities, or even abstract concepts. The term often implies a critical or analytical perspective on the act of worship or adoration.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The worshipability is high in this temple.","correct":"✓ The level of worshipability is high in this temple.","note":"'Worshipability' is an abstract quality, so it's better to use phrases like 'level of worshipability' rather than treating it as a concrete entity."},{"incorrect":"✗ He has a lot of worshipability.","correct":"✓ He has a high degree of worshipability.","note":"Use 'degree of worshipability' or similar phrases to quantify the abstract quality."}],"priority":"★★☆"},"related_words":{"derivatives":["worship","worshipful","worshiping"],"phrases":["worthy of worship","deserving of adoration"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Worshipability' is a complex and abstract term used to describe the quality of being worthy of worship or extreme admiration. It is often used in philosophical or sociological discussions about religion, celebrity culture, or the nature of adoration. The word is not commonly used in everyday conversation and requires a sophisticated understanding of abstract concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The ancient Egyptians attributed high worshipability to the pharaohs.","translation":"古代エジプト人はファラオに高い崇拝可能性を帰属させました。","type":"general","meaning_category":"worthiness"},{"sentence":"The worshipability of a fictional character often depends on the depth of their story and the impact they have on the audience.","translation":"架空のキャラクターの崇拝可能性は、しばしば彼らの物語の深さと、彼らが聴衆に与える影響に依存します。","type":"general","meaning_category":"worthiness"}]}