{"word":"pseudochronism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史学)史実に基づかない年代錯誤、時代錯誤、時代考証の誤り","english_definition":"An error in chronology; an anachronism.","examples":[{"sentence":"The novel contains several pseudochronisms, such as characters using technology that did not exist in that era.","translation":"その小説には、登場人物がその時代には存在しなかった技術を使用するなど、いくつかの時代錯誤が含まれている。"},{"sentence":"The film's pseudochronisms detract from its historical accuracy.","translation":"その映画の時代考証の誤りは、歴史的な正確さを損なっている。"}],"collocations":["historical pseudochronism","literary pseudochronism"],"synonyms":["anachronism","prochronism","parachronism"],"antonyms":["synchronism","isochronism"]}],"etymology":{"value":"Derived from the Greek words 'pseudo-' (false) and 'chronos' (time) combined with '-ism' (a practice, system, or doctrine).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsjuːdoʊˈkrɒnɪzəm/","syllables":"pseu-do-chro-nism"},"inflection":{"noun_plural":"pseudochronisms"},"usage_notes":{"explanation":"'Pseudochronism' is a more specific term than 'anachronism'. While an anachronism can refer to anything out of its proper time (including customs, language, etc.), a pseudochronism specifically refers to a chronological error. It is often used in discussions of historical accuracy in literature, film, and other media.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The play had many anachronisms, including pseudochronisms in the costumes.","correct":"✓ The play had many anachronisms, including inaccurate details in the costumes.","note":"While pseudochronism is a type of anachronism, it specifically relates to time errors. Inaccurate costume details are simply anachronisms."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudochronistic (adjective)"],"phrases":["historical inaccuracy","chronological error"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pseudochronism' is a specialized term primarily used in academic or critical discussions related to history, literature, and film. It refers to a specific type of error where something is placed in the wrong time period. Understanding this term requires a strong grasp of historical concepts and analytical skills."},"example_sentences":[{"sentence":"The author carefully avoided any pseudochronisms in his historical novel.","translation":"その著者は、自身の歴史小説において、年代錯誤を避けるように注意深く記述した。","type":"general","meaning_category":"年代錯誤"},{"sentence":"Critics pointed out several pseudochronisms in the movie's depiction of ancient Rome.","translation":"批評家たちは、その映画の古代ローマの描写におけるいくつかの時代考証の誤りを指摘した。","type":"historical","meaning_category":"時代考証の誤り"}]}