{"word":"superinscription","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"上書き、重ね書き","english_definition":"Something written or inscribed above or on top of something else.","examples":[{"sentence":"The ancient manuscript showed evidence of superinscription, with later text partially obscuring the original.","translation":"その古代原稿には上書きの痕跡が見られ、後のテキストが元のテキストを部分的に覆い隠していた。"}],"collocations":["text superinscription","manuscript superinscription"],"synonyms":["overwriting","overlay","palimpsest"],"antonyms":["underwriting","original inscription"]}],"etymology":{"value":"From 'super-' (above, over) + 'inscription' (something inscribed).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsuːpərɪnˈskrɪpʃən/","syllables":"su-per-in-scrip-tion"},"inflection":{"noun_plural":"superinscriptions"},"usage_notes":{"explanation":"'Superinscription' refers to the act or result of writing or inscribing something over a pre-existing inscription or text. It often implies that the newer inscription partially or fully covers the original. It is commonly used in the context of historical documents, archaeology, and digital text editing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The superinscription was under the original text.","correct":"✓ The superinscription was over the original text.","note":"'Super-' means 'above' or 'over', so superinscription must be above the original text."}],"priority":"★☆☆"},"related_words":{"derivatives":["superinscribe (verb)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Superinscription' is a technical term referring to writing or inscribing something on top of something else. It's often used in academic or specialized contexts, such as archaeology or textual analysis, where the layering of texts is significant. Understanding the prefix 'super-' (meaning 'above' or 'over') is helpful in grasping the word's meaning."},"example_sentences":[{"sentence":"Analysis of the document revealed a complex history of superinscription and erasure.","translation":"その文書の分析により、上書きと消去の複雑な歴史が明らかになった。","type":"general","meaning_category":"上書きの例"},{"sentence":"Digital tools can help to separate the layers of superinscription in ancient texts.","translation":"デジタルツールは、古代テキストの上書きの層を分離するのに役立つ。","type":"technical","meaning_category":"デジタルツールの使用例"}]}