{"word":"unrefrangible","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"屈折しない、屈折させられない","english_definition":"Not capable of being refracted; not subject to refraction.","examples":[{"sentence":"Diamond is a highly refrangible substance, but some materials are unrefrangible.","translation":"ダイヤモンドは非常に屈折率の高い物質ですが、屈折しない物質もあります。"},{"sentence":"The unrefrangible nature of the substance made it useful for certain optical applications.","translation":"その物質の屈折しない性質は、特定の光学用途に役立ちました。"}],"collocations":["unrefrangible ray","unrefrangible substance"],"synonyms":["nonrefractable","nonrefracting"],"antonyms":["refrangible","refractable","refracting"]}],"etymology":{"value":"From un- (not) + refrangible (capable of being refracted). Refrangible comes from Latin refrangere (to break back, refract), from re- (back) + frangere (to break).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnriˈfrændʒɪbəl/","syllables":"un-re-fran-gi-ble"},"inflection":{"notes":"Adjective, no specific inflections beyond comparative/superlative forms (though rarely used)."},"usage_notes":{"explanation":"'Unrefrangible' is a relatively rare term primarily used in physics and optics to describe substances or rays that do not undergo refraction when passing through a medium. It is the opposite of 'refrangible,' which describes substances that do refract light.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unrefrangible light was easily visible.","correct":"✓ The unrefrangible light was not easily bent.","note":"Unrefrangible refers to the inability to be bent (refracted), not to visibility."}],"priority":"★☆☆"},"related_words":{"derivatives":["refrangibility (noun): the quality of being refrangible","refrangible (adjective): capable of being refracted","refraction (noun): the bending of light or sound waves as they pass from one medium to another"],"related_scientific_terms":["refractive index","optics","prism","lens"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (technical/scientific vocabulary)","frequency_google_ngram":"Very low frequency. A specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unrefrangible' is a technical term used in physics, specifically optics. It describes something that cannot be refracted, meaning it does not bend when passing through a different medium. This word is not commonly used outside of scientific contexts. Understanding requires knowledge of physics principles related to light and refraction."},"example_sentences":[{"sentence":"The scientist tested the material to determine if it was unrefrangible.","translation":"科学者はその物質が屈折しないかどうかを判断するために試験を行った。","type":"general","meaning_category":"general"},{"sentence":"An unrefrangible ray would pass straight through the lens without deviation.","translation":"屈折しない光線は、レンズを真っ直ぐに通過し、偏向することはありません。","type":"technical","meaning_category":"technical"}]}