{"word":"homunculus","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ホムンクルス（錬金術で作られた人造人間、または脳の部位を表す概念）","english_definition":"(in alchemy and folklore) a miniature, artificially created human being; (in neurology) a representation of the human body mapped onto the sensory or motor cortex of the brain.","examples":[{"sentence":"The alchemist claimed to have created a homunculus in his laboratory.","translation":"その錬金術師は、自分の実験室でホムンクルスを作り出したと主張した。"},{"sentence":"The sensory homunculus shows the relative amount of the cortex devoted to different body parts.","translation":"感覚性ホムンクルスは、大脳皮質のどのくらいの領域が体の各部分に割り当てられているかを示している。"}],"collocations":["create a homunculus (ホムンクルスを作る)","sensory homunculus (感覚性ホムンクルス)","motor homunculus (運動性ホムンクルス)"],"synonyms":["artificial human","golem","automaton"],"antonyms":[]},{"part_of_speech":"noun","definition":"（軽蔑的な意味で）ちっぽけな人間、取るに足らない人間","english_definition":"(derogatory) an insignificant or contemptible person.","examples":[{"sentence":"He dismissed his opponent as a mere homunculus.","translation":"彼は対戦相手を単なる取るに足らない人間だと切り捨てた。"}],"collocations":[],"synonyms":["nonentity","nobody","dwarf","pygmy"],"antonyms":[]}],"etymology":{"value":"ラテン語の「homunculus」（小さい人、小人）に由来。これは「homo」（人間）の指小辞。錬金術師パラケルススが、人工的に作られた人間を指す言葉として用いた。","priority":"★★★"},"pronunciation":{"ipa":"/həˈmʌŋkjʊləs/","syllables":"ho-mun-cu-lus"},"inflection":{"noun_plural":"homunculi (ラテン語複数形), homunculuses (英語複数形)"},"usage_notes":{"explanation":"「**homunculus**」は、主に二つの意味を持つ単語です。\n\n1.  **錬金術におけるホムンクルス**: これは、錬金術師が人工的に作り出すことを試みた、非常に小さな人間を指します。伝説やファンタジー作品に登場することが多いです。\n2.  **神経学におけるホムンクルス**: これは、脳の感覚野や運動野における身体各部の表現を指します。脳のどの部分が体のどの部分を制御しているかを視覚的に表したもので、体の各部位の重要度に応じて大きさが異なって描かれます（例：手や顔は大きく表現される）。\n\n日常会話で使われることは稀ですが、科学やファンタジー関連の文脈では見かけることがあります。軽蔑的な意味で「取るに足らない人間」を指すこともありますが、一般的ではありません。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a homunculus in the garden. It was very small and cute.","correct":"✓ I read about a homunculus in a fantasy novel. It was a miniature human created by magic.","note":"庭にホムンクルスがいる、という状況は現実的ではありません。ファンタジー作品や錬金術の話など、架空の設定であることを明確にする必要があります。"},{"incorrect":"✗ The homunculus is responsible for our emotions.","correct":"✓ The limbic system is responsible for our emotions.","note":"感情を司るのはホムンクルスではなく、大脳辺縁系などの脳の他の部位です。ホムンクルスは感覚や運動機能の脳内での表現を指します。"}],"priority":"★★☆"},"related_words":{"derivatives":["homuncular (形容詞: ホムンクルスに関する、ホムンクルスのような)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語または文学的な文脈で使われることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**homunculus**」は、一般的にはあまり使われない専門的な単語です。主に、錬金術における人工的に作られた小さな人間、または神経科学における脳の感覚野や運動野に描かれる身体の表現を指します。日常会話で使うことはほとんどありませんが、科学やファンタジー関連の書籍や記事を読む際には、この単語に出会う可能性があります。"},"example_sentences":[{"sentence":"The alchemist spent years trying to perfect his homunculus.","translation":"その錬金術師は何年もかけてホムンクルスを完成させようとした。","type":"noun","meaning_category":"錬金術における人造人間"},{"sentence":"The motor homunculus illustrates how much of the brain is dedicated to controlling different muscles.","translation":"運動性ホムンクルスは、脳のどのくらいの領域が異なる筋肉の制御に割り当てられているかを示している。","type":"noun","meaning_category":"神経学における脳の表現"},{"sentence":"He treated his employees like homunculi, with no respect for their individuality.","translation":"彼は従業員をまるで取るに足らない人間のように扱い、彼らの個性を尊重しなかった。","type":"noun","meaning_category":"軽蔑的な意味での人間"}]}