{"word":"DLUPG","priority":"☆☆☆","meanings":[{"part_of_speech":"acronym","definition":"(computing) Dynamic Link User-level Page Global directory","english_definition":"A data structure used in some operating systems to manage memory at the user level, specifically for dynamically linked libraries.","examples":[{"sentence":"The DLUPG is responsible for mapping virtual addresses to physical memory for shared libraries.","translation":"DLUPGは、共有ライブラリの仮想アドレスを物理メモリにマッピングする役割を担っています。"},{"sentence":"Debugging memory issues in dynamically linked programs often involves inspecting the DLUPG.","translation":"動的にリンクされたプログラムのメモリ問題をデバッグするには、DLUPGの検査が伴うことがよくあります。"}],"collocations":["DLUPG entry","DLUPG table","DLUPG management","DLUPG lookup"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Acronym derived from Dynamic Link User-level Page Global directory, reflecting its function in memory management for dynamically linked libraries.","priority":"★★★"},"pronunciation":{"ipa":"/diː.el.juː.piː.dʒiː/","syllables":"Dee-El-U-Pee-Gee"},"inflection":{},"usage_notes":{"explanation":"DLUPG is a technical term primarily used in the context of operating system design and dynamic linking. It is not commonly encountered outside of low-level programming and system administration contexts.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["dynamic linking","shared library","memory management","page table","virtual memory"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Very low frequency - Primarily used in technical documentation and academic papers.","priority":"★★★"},"readability_explanation":{"level":"C2","text":"DLUPG is a highly technical term related to memory management in operating systems. Understanding it requires familiarity with concepts like dynamic linking, virtual memory, and page tables. It's primarily relevant to system programmers and those working on low-level operating system components."},"example_sentences":[{"sentence":"The operating system uses the DLUPG to resolve external function calls at runtime.","translation":"オペレーティングシステムは、DLUPGを使用して、実行時に外部関数呼び出しを解決します。","type":"definition","meaning_category":"computing"},{"sentence":"Modifying the DLUPG directly can lead to system instability.","translation":"DLUPGを直接変更すると、システムの不安定につながる可能性があります。","type":"definition","meaning_category":"computing"}]}