{"word":"snake-milk","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"A term used to describe various plant saps or milky fluids, often those considered unpalatable or poisonous; also sometimes used fancifully.","english_definition":"A term used to describe various plant saps or milky fluids, often those considered unpalatable or poisonous; also sometimes used fancifully.","examples":[{"sentence":"The children were warned not to touch the plant, as its 'snake-milk' could cause a rash.","translation":"子供たちは、その植物の「蛇の乳」に触ると発疹が出ることがあると警告された。"},{"sentence":"He fancifully called the white sap of the dandelion 'snake-milk'.","translation":"彼はタンポポの白い樹液を洒落て「蛇の乳」と呼んだ。"}],"collocations":["plant snake-milk","dandelion snake-milk"],"synonyms":["plant sap","latex","milky fluid"],"antonyms":[]}],"etymology":{"value":"Likely a descriptive term arising from the appearance and perceived properties (e.g., toxicity, unpalatability) of certain plant saps, drawing a comparison to milk and snakes.","priority":"Medium"},"pronunciation":{"ipa":"/ˈsneɪkˌmɪlk/","syllables":"snake-milk"},"inflection":{"noun_plural":"snake-milks"},"usage_notes":{"explanation":"The term 'snake-milk' is not a standard botanical term and is used informally. It often carries a connotation of something unpleasant or dangerous. It is more common in folk usage and literature than in scientific contexts.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"✗ The snake-milk is a vital nutrient for snakes.","correct":"✓ (Snakes do not drink plant sap, so this statement is generally incorrect.)","note":"Snakes are carnivorous and do not consume plant sap. The term 'snake-milk' refers to plant fluids, not something snakes drink."}],"priority":"Low"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"The term 'snake-milk' is figurative and not commonly used. Understanding requires recognizing it as a descriptive, informal term for plant saps, often with negative connotations."},"example_sentences":[{"sentence":"The old wives' tale warned of the dangers of touching the 'snake-milk' of the poisonous plant.","translation":"老婆の昔話では、有毒植物の「蛇の乳」に触れることの危険性が警告されていた。","type":"noun","meaning_category":"plant sap"},{"sentence":"He squeezed the stem, and a drop of what he called 'snake-milk' oozed out.","translation":"彼が茎を絞ると、彼が「蛇の乳」と呼ぶ液体が一滴滲み出た。","type":"noun","meaning_category":"plant sap"}]}