{"word":"Acetanilide","priority":"低","meanings":[{"part_of_speech":"noun","definition":"アセトアニリド：解熱鎮痛剤としてかつて使用された有機化合物。現在では毒性が高いため、医薬品としてはほとんど使用されない。","english_definition":"An organic chemical compound formerly used as an antipyretic and analgesic drug. It is now rarely used as a medicine due to its toxicity.","examples":[{"sentence":"Acetanilide was one of the first synthetic antipyretics.","translation":"アセトアニリドは、最初の合成解熱剤の一つでした。"},{"sentence":"The use of acetanilide as a pain reliever has been largely replaced by safer alternatives.","translation":"鎮痛剤としてのアセトアニリドの使用は、より安全な代替品に大きく置き換えられています。"}],"collocations":["acetanilide synthesis (アセトアニリド合成)","acetanilide poisoning (アセトアニリド中毒)"],"synonyms":["N-phenylacetamide"],"antonyms":[]}],"etymology":{"value":"「acetyl」と「anilide」の組み合わせ。アセチル基とアニリド基から構成される化合物であることを示す。","priority":"中"},"pronunciation":{"ipa":"/ˌæsɪˈtænɪlaɪd/","syllables":"a-cet-an-i-lide"},"inflection":{"noun_plural":"acetanilides"},"usage_notes":{"explanation":"アセトアニリドは、アニリンにアセチル基が結合した構造を持つ有機化合物です。かつては解熱鎮痛剤として広く使用されていましたが、メトヘモグロビン血症などの副作用が確認されたため、現在では医薬品としての使用は限定的です。実験室では、アニリンの誘導体化や有機合成の中間体として利用されることがあります。","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"✗ Acetanilide is a safe painkiller for children.","correct":"✓ Acetanilide is not a safe painkiller for children.","note":"アセトアニリドは毒性があるため、安全な鎮痛剤ではありません。"},{"incorrect":"✗ Acetanilide is used to treat bacterial infections.","correct":"✓ Acetanilide was formerly used as an antipyretic and analgesic.","note":"アセトアニリドは抗菌薬ではありません。解熱鎮痛剤として使用されていました。"}],"priority":"低"},"related_words":{"derivatives":["acetylation (アセチル化)","aniline (アニリン)"],"phrasal_verbs":[],"priority":"低"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低い","priority":"低"},"readability_explanation":{"level":"C2","text":"「Acetanilide」は、化学の分野で使われる専門用語であり、一般的な会話で使用されることはほとんどありません。この単語は、特定の化学的文脈や、化学史、薬学史などの専門的な議論の中で現れる可能性があります。一般の英語学習者にとっては、積極的に覚える必要性は低い単語です。"},"example_sentences":[{"sentence":"The synthesis of acetanilide involves the acetylation of aniline.","translation":"アセトアニリドの合成には、アニリンのアセチル化が含まれます。","type":"noun","meaning_category":"化学物質"},{"sentence":"Acetanilide was once a common ingredient in over-the-counter pain medications.","translation":"アセトアニリドはかつて、市販の鎮痛剤の一般的な成分でした。","type":"noun","meaning_category":"医薬品 (過去)"}]}