{"word":"photocurrent","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"光電流","english_definition":"An electric current generated when light strikes a material.","examples":[{"sentence":"The photocurrent increased linearly with the light intensity.","translation":"光電流は光の強度に比例して直線的に増加した。"},{"sentence":"The efficiency of the solar cell depends on the magnitude of the photocurrent.","translation":"太陽電池の効率は光電流の大きさに依存する。"}],"collocations":["generate photocurrent","measure photocurrent","photocurrent density","short-circuit photocurrent"],"synonyms":["photoelectric current"],"antonyms":["dark current"]}],"etymology":{"value":"Derived from 'photo-' (referring to light) and 'current' (referring to electric current).","priority":"★★★"},"pronunciation":{"ipa":"/ˌfoʊtoʊˈkɜːrənt/","syllables":"pho-to-cur-rent"},"inflection":{"noun_plural":"photocurrents"},"usage_notes":{"explanation":"Photocurrent refers specifically to the current produced by light interacting with a material, often a semiconductor. It is a crucial concept in understanding the operation of photovoltaic devices like solar cells and photodetectors.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The light current was measured.","correct":"✓ The photocurrent was measured.","note":"'Photocurrent' specifically refers to the current generated by light, not just any current related to light."}],"priority":"★★☆"},"related_words":{"derivatives":["photoelectric effect","photodiode","photovoltaic","photoconductivity"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific and technical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Photocurrent' is a technical term used in physics, electrical engineering, and materials science. It describes the flow of electric charge carriers (electrons and holes) within a material that is induced by the absorption of photons (light particles). Understanding this term requires a background in basic electromagnetism and semiconductor physics. It's commonly encountered in discussions about solar cells, photodetectors, and other optoelectronic devices."},"example_sentences":[{"sentence":"The **photocurrent** in the silicon solar cell was directly proportional to the number of incident photons.","translation":"シリコン太陽電池の光電流は、入射する光子の数に正比例していた。","type":"noun","meaning_category":"光電流"},{"sentence":"By measuring the **photocurrent**, we can determine the efficiency of the light-harvesting material.","translation":"光電流を測定することで、光捕集材料の効率を判断できる。","type":"noun","meaning_category":"光電流"},{"sentence":"The **photocurrent** density is an important parameter for characterizing photodetectors.","translation":"光電流密度は、光検出器を特性評価するための重要なパラメータである。","type":"noun","meaning_category":"光電流"}]}