{"word":"Strouds","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A type of coarse, heavy woolen cloth, typically scarlet, formerly used as a trade item with Native Americans.","english_definition":"A coarse, heavy woolen cloth, usually scarlet, formerly used in trade with Native Americans.","examples":[{"sentence":"The traders exchanged strouds for furs.","translation":"商人たちはストロウズと毛皮を交換した。"},{"sentence":"The Native Americans valued the strouds for their warmth and durability.","translation":"ネイティブアメリカンは、ストロウズの暖かさと耐久性を評価した。"}],"collocations":["trade strouds","scarlet strouds","woolen strouds"],"synonyms":["woolen cloth","trade cloth"],"antonyms":[]}],"etymology":{"value":"Likely derived from the place name Stroud in Gloucestershire, England, which was a center for woolen cloth production.","priority":"★★☆"},"pronunciation":{"ipa":"/straʊdz/","syllables":"Strouds (1 syllable)"},"inflection":{"noun_plural":"Strouds"},"usage_notes":{"explanation":"'Strouds' refers specifically to a type of durable woolen cloth that was historically significant in trade with Native American tribes. The cloth was valued for its warmth and durability, making it a desirable commodity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wore a stroud.","correct":"✓ He wore clothing made of strouds.","note":"'Strouds' refers to the cloth itself, not a specific garment. You would say clothing made of strouds, or a strouds blanket."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily used in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Strouds' is a specialized term referring to a specific type of woolen cloth used historically in trade, particularly with Native Americans. Understanding its meaning requires knowledge of historical trade practices and textiles. Due to its limited use outside historical contexts, it is not a commonly encountered word.","priority":"★☆☆"},"example_sentences":[{"sentence":"The museum displayed examples of strouds used in the 18th-century fur trade.","translation":"博物館には、18世紀の毛皮貿易で使用されたストロウズの例が展示されていた。","type":"noun","meaning_category":"woolen cloth"},{"sentence":"Early accounts describe Native Americans trading beaver pelts for strouds.","translation":"初期の記録には、ネイティブアメリカンがビーバーの毛皮とストロウズを交換していた様子が記述されている。","type":"noun","meaning_category":"woolen cloth"}]}