{"word":"altercated","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vi","definition":"口論した、激しく議論した","english_definition":"to argue or dispute angrily or vehemently; to wrangle; to contend in words.","examples":[{"sentence":"The neighbors altercated loudly about the property line.","translation":"隣人たちは境界線について激しく口論した。"},{"sentence":"The politicians altercated over the proposed bill.","translation":"政治家たちは提案された法案について激しく議論した。"},{"sentence":"They altercated for hours, but could not reach an agreement.","translation":"彼らは何時間も口論したが、合意に達することができなかった。"}],"collocations":["altercate loudly","altercate vehemently","altercate fiercely","altercate heatedly","altercate about/over something","altercate with someone"],"synonyms":["argue","quarrel","bicker","squabble","dispute","wrangle","contend","clash","differ","debate"],"antonyms":["agree","concur","harmonize","reconcile","compromise","assent","accord","settle","unite","collaborate"]}],"etymology":{"value":"Derived from the Latin word \"altercatio,\" meaning a verbal contest or dispute. This comes from \"altercari,\" which means to contend in words, derived from \"alter\" meaning \"other\" (referring to the other party in the argument).","priority":"★★☆"},"pronunciation":{"ipa":"ˈɔːltərkeɪtɪd","syllables":"al-ter-ca-ted"},"inflection":{"verb_forms":{"present_simple":["altercate","altercates"],"past_simple":"altercated","past_participle":"altercated","present_participle":"altercating"}},"usage_notes":{"explanation":"\"Altercate\" implies a more formal or intense verbal disagreement than a simple argument. It suggests a heated exchange of words, often involving strong emotions or differing opinions. The word is relatively uncommon in everyday conversation and is more frequently found in formal writing or legal contexts. It often suggests a prolonged or repeated argument.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They altercated physically.","correct":"✓ They altercated verbally. / ✓ They fought physically.","note":"\"Altercate\" specifically refers to a verbal argument, not a physical fight. Use \"fight\" or another verb to describe physical altercations."},{"incorrect":"✗ He altercated to his friend.","correct":"✓ He altercated with his friend. / ✓ He argued with his friend.","note":"When indicating who someone is arguing with, use the preposition \"with.\" Alternatively, you can use the verb \"argue\" with the preposition \"to\" when specifying the topic of the argument."},{"incorrect":"✗ The two countries altercated a peace treaty.","correct":"✓ The two countries debated a peace treaty.","note":"\"Altercate\" implies disagreement. Use \"debate,\" \"discuss,\" or \"negotiate\" when referring to discussions aimed at reaching an agreement."}],"priority":"★☆☆"},"related_words":{"derivatives":["altercation (noun): an angry argument or quarrel"],"phrasal_verbs":[],"related_verbs":["argue","dispute","quarrel","wrangle","contend","debate"],"related_nouns":["argument","dispute","quarrel","debate","contention"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Altercate\" is a formal and relatively uncommon verb that means to argue or dispute angrily, typically in a loud or heated manner. It suggests a more intense and prolonged verbal disagreement than a simple argument. Because of its formality and infrequent use, it is more likely to be encountered in formal writing or legal contexts rather than everyday conversation. It's important to distinguish it from more common synonyms like \"argue\" or \"dispute,\" which may not convey the same level of intensity or formality.","priority":"★★☆"},"example_sentences":[{"sentence":"The two lawyers altercated fiercely in the courtroom.","translation":"二人の弁護士は法廷で激しく口論した。","type":"general","meaning_category":"口論する"},{"sentence":"The committee members altercated at length over the proposed changes.","translation":"委員会のメンバーは提案された変更について長々と口論した。","type":"general","meaning_category":"口論する"},{"sentence":"They altercated about the interpretation of the contract.","translation":"彼らは契約の解釈について口論した。","type":"general","meaning_category":"口論する"}]}