{"word":"Psychologizing","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(他動詞/自動詞)心理学的に解釈する、心理分析する、深読みする","english_definition":"To analyze or interpret something from a psychological perspective; to overanalyze or attribute psychological motives to behavior.","examples":[{"sentence":"Stop psychologizing everything and just accept what happened.","translation":"何でもかんでも深読みするのはやめて、ただ起きたことを受け入れなさい。"},{"sentence":"He was psychologizing her actions, trying to understand her motives.","translation":"彼は彼女の行動を心理分析し、彼女の動機を理解しようとしていた。"},{"sentence":"The article psychologizes the characters' relationships in the novel.","translation":"その記事は小説の登場人物たちの関係を心理学的に解釈している。"}],"collocations":["psychologize about someone's behavior","psychologize a situation","over-psychologize","psychologize the characters"],"synonyms":["analyze","interpret","overanalyze","speculate","theorize","psychoanalyze"],"antonyms":["accept","ignore","overlook","simplify"]},{"part_of_speech":"noun","definition":"心理学的な解釈、心理分析、深読み (通常、否定的な意味合いを含む)","english_definition":"The act of analyzing or interpreting something from a psychological perspective, often with a negative connotation of overanalyzing or attributing excessive psychological motives.","examples":[{"sentence":"His constant psychologizing made it difficult to have a normal conversation.","translation":"彼の絶え間ない深読みのせいで、普通の会話をするのが難しかった。"},{"sentence":"She accused him of psychologizing everything she said.","translation":"彼女は彼が自分の言うこと全てを深読みしていると非難した。"},{"sentence":"The problem with his approach is that it relies too much on psychologizing.","translation":"彼のアプローチの問題点は、心理分析に頼りすぎていることだ。"}],"collocations":["constant psychologizing","excessive psychologizing","stop the psychologizing"],"synonyms":["analysis","interpretation","overanalysis","speculation","theorizing"],"antonyms":["acceptance","ignorance","oversight","simplification"]}],"etymology":{"value":"Formed from 'psychology' + '-ize' (to make, to act in a certain way) + '-ing' (present participle/gerund ending).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsaɪkɑˈlɑdʒaɪzɪŋ/","syllables":"psy-cho-lo-giz-ing"},"inflection":{"verb_forms":{"present_participle":"psychologizing","gerund":"psychologizing"},"noun_plural":null},"usage_notes":{"explanation":"'Psychologizing' often carries a negative connotation, suggesting that someone is overanalyzing or attributing psychological motives where they may not exist. It can imply a tendency to complicate simple situations with unnecessary psychological explanations. The noun form refers to the act of doing this.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is very psychologizing.","correct":"✓ He is psychologizing. / ✓ He is very analytical.","note":"'Psychologizing' is the present participle/gerund form. To describe someone's general tendency, use 'analytical' or a similar adjective. Alternatively, use the present continuous tense: 'He is psychologizing'."},{"incorrect":"✗ The psychologizing of the movie was too much.","correct":"✓ The psychologizing in the movie was too much.","note":"When using 'psychologizing' as a noun, it often refers to the process or act of analyzing, so 'in' is the more appropriate preposition."}],"priority":"★★☆"},"related_words":{"derivatives":["psychology","psychological","psychologist","psychologized","psychologizer"],"phrases":["psychological analysis","psychological interpretation","overthinking","deep analysis"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Psychologizing' is a relatively advanced term that refers to the act of analyzing or interpreting something from a psychological perspective. It often implies a tendency to overanalyze or attribute psychological motives excessively. The word is typically used in academic or intellectual contexts when discussing human behavior, literature, or social phenomena. It is important to understand the negative connotation it often carries, suggesting unnecessary complication or speculation."},"example_sentences":[{"sentence":"She was constantly psychologizing her friend's behavior, trying to find hidden meanings.","translation":"彼女は常に友人の行動を深読みし、隠された意味を見つけようとしていた。","type":"verb","meaning_category":"心理分析する"},{"sentence":"The professor's psychologizing of the historical events was fascinating but also controversial.","translation":"教授による歴史的出来事の心理学的解釈は魅力的だったが、同時に議論の的でもあった。","type":"noun","meaning_category":"心理学的な解釈"},{"sentence":"He tends to psychologize everything, even the simplest interactions.","translation":"彼は何でもかんでも深読みする傾向がある、最も単純なやり取りでさえも。","type":"verb","meaning_category":"深読みする"},{"sentence":"The novel is full of psychologizing about the characters' inner lives.","translation":"その小説は登場人物たちの内面生活に関する心理分析で満ちている。","type":"noun","meaning_category":"深読み"}]}