{"word":"meritocracy","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"能力主義、実力主義","english_definition":"a system in which advancement is based on individual ability or achievement","examples":[{"sentence":"The company claims to be a meritocracy, where promotions are based on performance, not seniority.","translation":"その会社は、昇進は年功序列ではなく、実績に基づいて行われる能力主義であると主張している。"},{"sentence":"Is a true meritocracy possible, or will social advantages always play a role?","translation":"真の能力主義は可能なのか、それとも社会的優位性が常に役割を果たすのだろうか？"},{"sentence":"She believes in a meritocracy where everyone has an equal opportunity to succeed based on their talents and efforts.","translation":"彼女は、誰もが自分の才能と努力に基づいて成功する平等な機会を持つ能力主義を信じている。"}],"collocations":["establish a meritocracy (能力主義を確立する)","promote meritocracy (能力主義を推進する)","believe in meritocracy (能力主義を信じる)","flaws of meritocracy (能力主義の欠点)","challenges to meritocracy (能力主義への挑戦)"],"synonyms":["achievocracy","talentocracy"],"antonyms":["nepotism","cronyism","plutocracy","aristocracy"]},{"part_of_speech":"noun","definition":"能力主義社会、実力主義社会","english_definition":"a society governed by people selected according to merit","examples":[{"sentence":"In a meritocracy, the most talented and hardworking individuals rise to positions of power and influence.","translation":"能力主義社会では、最も才能があり勤勉な個人が権力と影響力のある地位に昇進する。"},{"sentence":"Some argue that meritocracies can still perpetuate inequalities if access to education and opportunities is not equal.","translation":"教育や機会へのアクセスが平等でない場合、能力主義社会は依然として不平等を永続させる可能性があると主張する人もいる。"}],"collocations":["operate as a meritocracy (能力主義として機能する)","strive for a meritocracy (能力主義社会を目指す)"],"synonyms":["achievement-based society"],"antonyms":["class-based society"]}],"etymology":{"value":"Derived from 'merit' (worthiness, deserving reward) and '-cracy' (rule, power), coined by Michael Young in his dystopian satire 'The Rise of the Meritocracy' (1958). Ironically, Young intended the term as a critique of a society overly focused on merit, leading to new forms of social stratification.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɛrɪˈtɒkrəsi/","syllables":"me-ri-toc-ra-cy"},"inflection":{"noun_plural":"meritocracies"},"usage_notes":{"explanation":"'Meritocracy' is often used in discussions about social mobility, equality of opportunity, and the fairness of systems for selecting leaders and allocating resources. While often presented as an ideal, critics argue that even in systems designed to reward merit, factors like inherited wealth, social connections, and unequal access to quality education can undermine true meritocracy. The term can be used both descriptively (to describe a system) and critically (to question its effectiveness or fairness).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a meritocratic leader.","correct":"✓ He was a leader in a meritocracy. / ✓ He was a proponent of meritocracy.","note":"'Meritocratic' is an adjective, but it's more common to describe a system or society as a meritocracy rather than a person as 'meritocratic.' It's better to say someone is 'a leader in a meritocracy' or 'a proponent of meritocracy.'"},{"incorrect":"✗ Meritocracy ensures everyone will be successful.","correct":"✓ Meritocracy aims to provide equal opportunities for success.","note":"Meritocracy aims for equal opportunities, but it doesn't guarantee everyone will be successful. Success still depends on individual effort and talent."}],"priority":"★★☆"},"related_words":{"derivatives":["meritocratic (adjective: relating to meritocracy)"],"related_concepts":["equal opportunity","social mobility","achievement","ability","talent"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent, but usage is increasing in academic and political discourse.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Meritocracy' is a complex term often used in social and political discussions. It refers to a system where people are rewarded based on their abilities and achievements, rather than factors like wealth or social status. It's often seen as a fair system, but critics point out that true meritocracy is hard to achieve because factors like unequal access to education can give some people an unfair advantage. Understanding this term requires a grasp of abstract concepts like social justice and equality of opportunity."},"example_sentences":[{"sentence":"The company's promotion policy is based on meritocracy, rewarding hard work and talent.","translation":"その会社の昇進制度は能力主義に基づいており、勤勉さと才能に報いる。","type":"noun","meaning_category":"能力主義"},{"sentence":"Critics argue that even in a meritocracy, those from privileged backgrounds have an advantage.","translation":"批評家たちは、能力主義社会であっても、恵まれた環境出身の人々が有利であると主張する。","type":"noun","meaning_category":"能力主義社会"},{"sentence":"The government aims to create a more meritocratic system in education.","translation":"政府は、教育においてより能力主義的なシステムを構築することを目指している。","type":"adjective (meritocratic)","meaning_category":"能力主義的な"}]}