{"word":"pricklebur","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"A plant with prickly burs, especially those of the genus Xanthium (cocklebur).","english_definition":"A plant, especially of the genus Xanthium (cocklebur), that produces burs covered with prickles.","examples":[{"sentence":"The field was full of prickleburs, making it difficult to walk through.","translation":"その畑はオナモミだらけで、歩くのが困難だった。"},{"sentence":"Prickleburs are known for their burs sticking to clothing and animal fur.","translation":"オナモミは、そのイガイガが衣服や動物の毛皮に付着することで知られている。"}],"collocations":["pricklebur plant","remove prickleburs","field of prickleburs"],"synonyms":["cocklebur","burweed"],"antonyms":[]}],"etymology":{"value":"Combination of 'prickle' (a small, sharp point) and 'bur' (a seed case or dry fruit with hooks or prickles).","priority":"Medium"},"pronunciation":{"ipa":"/ˈprɪkəlˌbɜːr/","syllables":"prick-le-bur"},"inflection":{"noun_plural":"prickleburs"},"usage_notes":{"explanation":"'Pricklebur' is a somewhat regional or less common term, with 'cocklebur' being the more widely recognized name for plants of the genus Xanthium. The term emphasizes the prickly nature of the bur.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"prickleberry","correct":"pricklebur","note":"'Prickleberry' might be mistaken for a similar-sounding but different plant or berry."}],"priority":"Low"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Not applicable (uncommon word)","frequency_google_ngram":"Very low","priority":"Low"},"readability_explanation":{"level":"C1","text":"The word 'pricklebur' is relatively uncommon and specialized, referring to a specific type of plant with prickly burs. Understanding requires familiarity with botanical terms and potentially regional plant names."},"example_sentences":[{"sentence":"After hiking through the woods, my socks were covered in prickleburs.","translation":"森の中をハイキングした後、私の靴下はオナモミだらけになった。","type":"noun","meaning_category":"plant"},{"sentence":"Farmers often consider prickleburs to be weeds because they can contaminate crops.","translation":"農家は、オナモミが作物を汚染する可能性があるため、雑草と見なすことが多い。","type":"noun","meaning_category":"plant"}]}