{"word":"substrate-selective","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"基質選択的な","english_definition":"Exhibiting selectivity or preference for specific substrates, typically in the context of enzymes or other biological catalysts.","examples":[{"sentence":"The enzyme is substrate-selective, meaning it only binds to and catalyzes reactions involving certain molecules.","translation":"その酵素は基質選択的であり、特定の分子にのみ結合し、それらに関する反応を触媒することを意味します。"},{"sentence":"Substrate-selective inhibitors can be designed to target specific metabolic pathways.","translation":"基質選択的阻害剤は、特定の代謝経路を標的とするように設計できます。"}],"collocations":["substrate-selective enzyme","substrate-selective inhibitor","high substrate selectivity","substrate selectivity"],"synonyms":["substrate-specific","selective","specific"],"antonyms":["non-selective","broad-spectrum"]}],"etymology":{"value":"Derived from 'substrate' (the substance acted upon by an enzyme or catalyst) and 'selective' (having the quality of selecting; tending to choose carefully).","priority":"★★★"},"pronunciation":{"ipa":"/ˈsʌbstreɪt sɪˈlɛktɪv/","syllables":"sub-strate se-lec-tive"},"inflection":{"notes":"Adjective; no specific inflectional forms."},"usage_notes":{"explanation":"The term 'substrate-selective' is commonly used in biochemistry, enzymology, and related fields to describe enzymes or other catalysts that exhibit a preference for particular substrates. This selectivity is crucial for the specificity and regulation of biological processes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The substrate-selective reaction occurred.","correct":"The substrate-selective enzyme catalyzed the reaction.","note":"'Substrate-selective' describes the enzyme or catalyst, not the reaction itself."}],"priority":"★★☆"},"related_words":{"derivatives":["substrate","selectivity","selective"],"related_terms":["enzyme","catalyst","active site","specificity"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'substrate-selective' is a technical term used in biochemistry and related fields. It describes the ability of an enzyme or catalyst to preferentially bind to and react with specific substrates. Understanding this term requires a background in biochemistry or a related scientific discipline."},"example_sentences":[{"sentence":"The engineered enzyme displayed enhanced substrate-selective activity.","translation":"そのように設計された酵素は、強化された基質選択的活性を示しました。","type":"general","meaning_category":"General"},{"sentence":"Mutations in the active site can alter the substrate-selective properties of the enzyme.","translation":"活性部位の変異は、酵素の基質選択的特性を変化させる可能性があります。","type":"technical","meaning_category":"Technical"}]}