{"word":"pyrheliometer","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"直達日射計","english_definition":"An instrument for measuring direct solar radiation.","examples":[{"sentence":"The pyrheliometer was used to measure the intensity of the sun's rays.","translation":"直達日射計は、太陽光線の強度を測定するために使用されました。"},{"sentence":"Data from the pyrheliometer is essential for solar energy research.","translation":"直達日射計からのデータは、太陽エネルギー研究に不可欠です。"}],"collocations":["measure solar radiation","solar energy research","atmospheric science"],"synonyms":["actinometer","radiometer"],"antonyms":[]}],"etymology":{"value":"The word \"pyrheliometer\" comes from the Greek words \"pyr\" (fire), \"helios\" (sun), and \"meter\" (measure).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpaɪərhiːliˈɒmɪtər/","syllables":"py-rhel-i-om-e-ter"},"inflection":{"noun_plural":"pyrheliometers"},"usage_notes":{"explanation":"A pyrheliometer measures the direct beam radiation from the sun. It excludes diffuse sky radiation. It's important in climatology, meteorology, and solar energy applications.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"Using a pyranometer instead of a pyrheliometer to measure direct solar radiation.","correct":"Using a pyrheliometer to measure direct solar radiation.","note":"A pyranometer measures global solar radiation (direct and diffuse), while a pyrheliometer measures only direct solar radiation."}],"priority":"★★☆"},"related_words":{"derivatives":["pyrheliometric (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A pyrheliometer is a scientific instrument used to measure direct solar radiation. It is a specialized term primarily used in fields such as meteorology, climatology, and solar energy research. Understanding the term requires a background in these scientific areas."},"example_sentences":[{"sentence":"The scientist calibrated the pyrheliometer before taking measurements.","translation":"科学者は測定を行う前に直達日射計を校正しました。","type":"general","meaning_category":"measurement"},{"sentence":"The solar power plant relies on accurate pyrheliometer data for efficient energy production.","translation":"太陽光発電所は、効率的なエネルギー生産のために正確な直達日射計データに依存しています。","type":"application","meaning_category":"solar energy"}]}