{"word":"Goosegirl","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ガチョウ飼いの少女、ガチョウ番の娘","english_definition":"A girl who tends geese.","examples":[{"sentence":"The goosegirl led her flock to the meadow every morning.","translation":"ガチョウ飼いの少女は毎朝、ガチョウの群れを牧草地に連れて行った。"},{"sentence":"In fairy tales, the goosegirl is often a disguised princess.","translation":"おとぎ話では、ガチョウ飼いの娘は変装した王女であることが多い。"}],"collocations":["a young goosegirl","the king's goosegirl","a lonely goosegirl"],"synonyms":["gooseherd","goose tender"],"antonyms":[]},{"part_of_speech":"noun","definition":"（しばしば Goose Girl と表記される）おとぎ話のタイトル、またはそのおとぎ話の主人公","english_definition":"The title of a fairy tale, often written as \"The Goose Girl\", or the main character in that fairy tale.","examples":[{"sentence":"The Goose Girl is a fairy tale collected by the Brothers Grimm.","translation":"『ガチョウ飼いの娘』はグリム兄弟によって収集されたおとぎ話である。"},{"sentence":"The story of the Goose Girl involves a princess betrayed by her maidservant.","translation":"『ガチョウ飼いの娘』の物語は、侍女に裏切られた王女を描いている。"}],"collocations":["The Goose Girl (fairy tale)","Grimm's Goose Girl"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"\"Goose\" + \"girl\".","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡuːsˌɡɜːrl/","syllables":"Goose-girl"},"inflection":{"noun_plural":"Goosegirls"},"usage_notes":{"explanation":"The term \"goosegirl\" refers specifically to a girl (usually young) whose job or role is to look after geese. It is often used in the context of fairy tales and folklore. When referring to the specific fairy tale collected by the Brothers Grimm, it is often capitalized as \"The Goose Girl\".","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She was a goose girl, taking care of ducks.","correct":"✓ She was a goose girl, taking care of geese.","note":"Goosegirls tend to geese, not ducks."}],"priority":"★★☆"},"related_words":{"derivatives":["gooseherd","gooseboy"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency - Primarily used in literary contexts or when referring to fairy tales.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"goosegirl\" is relatively uncommon in modern English, primarily appearing in the context of fairy tales or historical descriptions of rural life. It specifically refers to a young woman or girl who is responsible for herding and caring for geese. Understanding the word requires familiarity with traditional agricultural practices and folklore. The term is more likely to be encountered in literature or historical texts than in everyday conversation."},"example_sentences":[{"sentence":"The **goosegirl** sang a sad song as she watched over her flock.","translation":"ガチョウ飼いの娘は、ガチョウの群れを見守りながら悲しい歌を歌った。","type":"noun","meaning_category":"ガチョウ飼いの少女"},{"sentence":"Many versions of **The Goose Girl** fairy tale exist across different cultures.","translation":"『ガチョウ飼いの娘』のおとぎ話は、さまざまな文化に多くのバージョンが存在する。","type":"noun","meaning_category":"おとぎ話のタイトル"}]}