{"word":"lunar-vulnerable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"月の影響を受けやすい、月齢によって状態が変化しやすい","english_definition":"Susceptible to the influence of the moon; prone to changes or fluctuations based on the lunar cycle.","examples":[{"sentence":"The plant species is lunar-vulnerable, with its growth patterns closely tied to the phases of the moon.","translation":"その植物種は月の影響を受けやすく、その成長パターンは月の満ち欠けと密接に関連している。"},{"sentence":"Some believe that certain individuals are more lunar-vulnerable, experiencing heightened emotions during a full moon.","translation":"満月の間、感情が高ぶるなど、特定の人々はより月の影響を受けやすいと信じられている。"}],"collocations":["lunar-vulnerable species","lunar-vulnerable individuals","lunar-vulnerable ecosystems"],"synonyms":["moon-sensitive","lunisolar-dependent","moon-affected"],"antonyms":["lunar-resistant","lunar-independent","moon-insensitive"]}],"etymology":{"value":"Combination of 'lunar' (relating to the moon) and 'vulnerable' (susceptible to harm or influence).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈluːnər ˈvʌlnərəbəl/","syllables":"lu-nar-vul-ner-a-ble"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"The term 'lunar-vulnerable' is often used in scientific or pseudoscientific contexts to describe organisms or systems that exhibit sensitivity to the moon's gravitational or electromagnetic effects. It can also be used metaphorically to describe individuals who are believed to be emotionally affected by the lunar cycle.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lunar-vulnerable is high during full moon.","correct":"✓ Lunar vulnerability is high during a full moon.","note":"'Lunar-vulnerable' is an adjective, not a noun. Use 'lunar vulnerability' as a noun."}],"priority":"★☆☆"},"related_words":{"derivatives":["vulnerable","lunar","vulnerability"],"related_terms":["lunar cycle","moon phase","gravitational influence","electromagnetic effect"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lunar-vulnerable' is a specialized term describing sensitivity to the moon's influence. It's used in contexts where the moon's effects on living organisms or systems are discussed, often in a scientific or metaphorical sense. The term implies a susceptibility to changes or fluctuations based on the lunar cycle."},"example_sentences":[{"sentence":"The coastal ecosystem is highly lunar-vulnerable, with tidal patterns dictating the behavior of many species.","translation":"沿岸生態系は月の影響を非常に受けやすく、潮汐パターンが多くの種の行動を決定している。","type":"adjective","meaning_category":"月の影響を受けやすい"},{"sentence":"Researchers are studying whether certain neurological conditions are lunar-vulnerable.","translation":"研究者たちは、特定の神経学的疾患が月の影響を受けやすいかどうかを研究している。","type":"adjective","meaning_category":"月齢によって状態が変化しやすい"}]}