{"word":"tempest-troubled","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"嵐に悩まされた、嵐によって苦しめられた","english_definition":"Disturbed or afflicted by a tempest; experiencing difficulties or distress caused by a storm or turbulent situation.","examples":[{"sentence":"The tempest-troubled sailors struggled to keep the ship afloat.","translation":"嵐に悩まされた船乗りたちは、船を浮かせておくために奮闘した。"},{"sentence":"His tempest-troubled mind found no peace.","translation":"彼の嵐によって苦しめられた心は、安らぎを見つけることができなかった。"},{"sentence":"The tempest-troubled region was in dire need of assistance.","translation":"嵐によって苦しめられた地域は、深刻な支援を必要としていた。"}],"collocations":["tempest-troubled sea","tempest-troubled soul","tempest-troubled times"],"synonyms":["storm-ridden","turbulent","stormy","agitated","distressed"],"antonyms":["calm","peaceful","tranquil","untroubled"]}],"etymology":{"value":"A compound word formed from 'tempest' (a violent windstorm) and 'troubled' (experiencing difficulty or distress). The combination suggests a state of being afflicted or disturbed by a severe storm or a situation analogous to a storm.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɛmpɪstˌtrʌbəld/","syllables":"tem-pest-trou-bled"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have different forms for gender or number."},"usage_notes":{"explanation":"'Tempest-troubled' is a somewhat literary or poetic adjective, often used to describe situations or individuals experiencing severe difficulties or turmoil, whether literally caused by a storm or metaphorically representing a turbulent state. It carries a sense of intense distress and hardship.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tempest-troubled is a dangerous place.","correct":"✓ The tempest-troubled sea is a dangerous place.","note":"'tempest-troubled' is an adjective and needs to modify a noun. It cannot stand alone as a noun."}],"priority":"★☆☆"},"related_words":{"derivatives":["tempest (noun): a violent windstorm","trouble (noun/verb): difficulty, distress; to cause distress"],"phrases":["tempestuous (adjective): characterized by strong and turbulent or conflicting emotion."]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - a relatively uncommon and somewhat literary word.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tempest-troubled' is a compound adjective that describes something or someone afflicted by a tempest, which is a violent storm. It is often used metaphorically to describe situations or individuals experiencing severe difficulties or emotional turmoil. The word suggests a state of being deeply disturbed or distressed by a powerful and overwhelming force, whether literal or figurative. Due to its somewhat literary and uncommon nature, it is more likely to be encountered in advanced texts or poetic contexts."},"example_sentences":[{"sentence":"The tempest-troubled waters crashed against the shore.","translation":"嵐に悩まされた水が岸に打ち寄せた。","type":"adjective","meaning_category":"Describing a stormy environment"},{"sentence":"The tempest-troubled nation sought aid from its allies.","translation":"嵐によって苦しめられた国は、同盟国からの援助を求めた。","type":"adjective","meaning_category":"Describing a nation in distress"},{"sentence":"His tempest-troubled past haunted his present.","translation":"彼の嵐によって苦しめられた過去が、彼の現在を苦しめた。","type":"adjective","meaning_category":"Describing a difficult past"}]}