{"word":"archiepiscopality","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"大司教の地位、職務、または管轄区域","english_definition":"The state, office, or jurisdiction of an archbishop.","examples":[{"sentence":"The archiepiscopality of Canterbury is one of the most important in the Anglican Communion.","translation":"カンタベリー大司教区は、聖公会において最も重要な地位の一つです。"},{"sentence":"He was elevated to the archiepiscopality after years of dedicated service.","translation":"彼は長年の献身的な奉仕の後、大司教の地位に昇格しました。"}],"collocations":["hold the archiepiscopality (大司教の地位にある)","vacant archiepiscopality (空位の大司教区)","exercise archiepiscopality (大司教の職務を遂行する)"],"synonyms":["archbishopric","episcopate","see"],"antonyms":[]}],"etymology":{"value":"\"Archiepiscopality\" is derived from \"archiepiscopal,\" which combines \"arch-\" (meaning chief or principal) with \"episcopal\" (relating to bishops). The suffix \"-ity\" denotes a state, condition, or quality. Thus, \"archiepiscopality\" refers to the state or office of a chief bishop or archbishop.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɑːrtʃiːɪpɪˈskɒpəlɪti/","syllables":"ar-chi-e-pi-sco-pa-li-ty"},"inflection":{"noun_plural":"archiepiscopalties"},"usage_notes":{"explanation":"\"Archiepiscopality\" is a formal and relatively rare term primarily used in religious or historical contexts. It specifically refers to the position, authority, or territory governed by an archbishop. It is not typically used in everyday conversation.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was known for his archiepiscopal.","correct":"✓ He was known for his archiepiscopality.","note":"\"Archiepiscopal\" is an adjective, while \"archiepiscopality\" is the noun referring to the office or state of being an archbishop."}],"priority":"★☆☆"},"related_words":{"derivatives":["archiepiscopal (adjective: 大司教の、大司教に関する)","archbishop (noun: 大司教)","episcopacy (noun: 監督制)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Archiepiscopality\" is a highly specialized term primarily encountered in religious studies, history, or contexts discussing ecclesiastical governance. Understanding this word requires familiarity with hierarchical structures within certain Christian denominations, particularly those with archbishops. Its usage is confined to formal and academic discussions.","priority":"★☆☆"},"example_sentences":[{"sentence":"The responsibilities associated with the archiepiscopality demanded both spiritual leadership and administrative skill.","translation":"大司教の地位に伴う責任は、精神的な指導力と管理能力の両方を必要としました。","type":"general","meaning_category":"大司教の地位"},{"sentence":"The historical records detail the evolution of the archiepiscopality in the region.","translation":"その地域の歴史的記録は大司教の地位の進化を詳述しています。","type":"historical","meaning_category":"大司教の地位"}]}