{"word":"Papistry","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ローマカトリック教信仰、ローマ教皇至上主義","english_definition":"The religious system, doctrines, and practices of which the pope is the head; Roman Catholicism.","examples":[{"sentence":"The Reformation was a rejection of papistry.","translation":"宗教改革はローマカトリック教信仰の拒絶であった。"},{"sentence":"He was accused of papistry because of his loyalty to the Pope.","translation":"彼は教皇への忠誠心から、ローマカトリック教信仰の疑いをかけられた。"}],"collocations":["anti-papistry (反カトリック主義)"],"synonyms":["Roman Catholicism","Romanism","Popery"],"antonyms":["Protestantism"]},{"part_of_speech":"noun","definition":"（軽蔑的な意味で）ローマカトリック教徒","english_definition":"(derogatory) Adherence to the Roman Catholic Church.","examples":[{"sentence":"In that era, papistry was often viewed with suspicion.","translation":"その時代、ローマカトリック教信仰はしばしば疑いの目で見られていた。"}],"collocations":[],"synonyms":["Roman Catholic","Catholic"],"antonyms":["Protestant"]}],"etymology":{"value":"'Pope' + '-istry'. From Middle English 'papistrie', from Old French 'papistrie'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpeɪpɪstri/","syllables":"pay-pis-try"},"inflection":{"noun_plural":"Papistries"},"usage_notes":{"explanation":"'Papistry' is often used in historical contexts or in discussions of religious differences. It can carry a negative connotation, especially when used by those who oppose the Catholic Church.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practices papistry in his daily life.","correct":"✓ He practices Roman Catholicism in his daily life.","note":"'Papistry' is more about the system or adherence to the system, not the practice itself. Use 'Roman Catholicism' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["Papist (名詞：ローマカトリック教徒、軽蔑的な意味合いを含む)","Papistic (形容詞：ローマカトリック教の、ローマ教皇至上主義の)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'papistry' is a formal and somewhat archaic term for Roman Catholicism. It is often used in historical or theological discussions, particularly when emphasizing the authority of the Pope. Due to its potential for negative connotations, it is not commonly used in contemporary, neutral contexts. Understanding the historical and religious context is crucial for interpreting this word correctly."},"example_sentences":[{"sentence":"The debates during the Reformation centered on issues of papistry and the authority of the scriptures.","translation":"宗教改革中の議論は、ローマカトリック教信仰と聖書の権威の問題に集中した。","type":"noun","meaning_category":"ローマカトリック教信仰"},{"sentence":"Historically, accusations of papistry were used to discriminate against Catholics.","translation":"歴史的に、ローマカトリック教信仰の告発はカトリック教徒を差別するために用いられた。","type":"noun","meaning_category":"ローマカトリック教信仰"}]}