{"word":"spellbreaker","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(ファンタジー)魔法を打ち破る能力を持つ者、魔法使いに対抗する者","english_definition":"(fantasy) A person who has the ability to break spells or counteract magic; someone who opposes or fights against magic users.","examples":[{"sentence":"The kingdom hired a spellbreaker to protect them from the evil sorcerer's curses.","translation":"王国は、邪悪な魔法使いの呪いから身を守るために、魔法打ち破りを雇った。"},{"sentence":"She trained for years to become a powerful spellbreaker, capable of nullifying any magical attack.","translation":"彼女はあらゆる魔法攻撃を無効化できる強力な魔法打ち破りになるために、何年も訓練した。"}],"collocations":["hire a spellbreaker","become a spellbreaker","powerful spellbreaker","trained spellbreaker"],"synonyms":["anti-mage","magic nullifier","spell nullifier","magic disruptor"],"antonyms":["mage","sorcerer","wizard","spellcaster"]},{"part_of_speech":"noun","definition":"(ゲーム)特定のゲームにおけるクラス、キャラクター、または役割","english_definition":"(gaming) A class, character, or role in a specific game, often with abilities related to dispelling or countering magic.","examples":[{"sentence":"In the MMORPG 'Arcane Legends', the Spellbreaker is a powerful melee class that can disrupt enemy spellcasting.","translation":"MMORPG『Arcane Legends』では、スペルブレイカーは敵の呪文詠唱を妨害できる強力な近接クラスです。"},{"sentence":"The Spellbreaker build in 'Elder Scrolls Online' focuses on resisting magical damage and silencing opponents.","translation":"『Elder Scrolls Online』のスペルブレイカービルドは、魔法ダメージへの抵抗と対戦相手の沈黙に重点を置いています。"}],"collocations":["Spellbreaker class","Spellbreaker build","play as a Spellbreaker"],"synonyms":["anti-mage","magic resistant character"],"antonyms":["mage class","spellcasting class"]}],"etymology":{"value":"The word is a compound of 'spell' (referring to a magical incantation) and 'breaker' (one who breaks or destroys something).","priority":"★★☆"},"pronunciation":{"ipa":"ˈspɛlˌbreɪkər/","syllables":"spell-break-er"},"inflection":{"noun_plural":"spellbreakers"},"usage_notes":{"explanation":"The term 'spellbreaker' is primarily used in fantasy literature, games, and related contexts. It describes a character or entity with the ability to negate or disrupt magical effects. The specific abilities and role of a spellbreaker can vary depending on the fictional setting.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a spell breaker.","correct":"✓ He is a spellbreaker.","note":"'Spellbreaker' is typically written as one word, especially when referring to a character class or role."}],"priority":"★★☆"},"related_words":{"derivatives":["spellbreaking (adjective, noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Fantasy specific vocabulary)","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Spellbreaker' is a compound noun primarily used in fantasy contexts. It refers to a character or entity capable of neutralizing or disrupting magical spells. The term's meaning is relatively straightforward, combining the concepts of 'spell' and 'breaking'. Its usage is largely confined to fantasy literature, games, and related discussions. Understanding the term requires familiarity with fantasy tropes and vocabulary."},"example_sentences":[{"sentence":"The spellbreaker used their abilities to dispel the curse on the village.","translation":"魔法打ち破りはその能力を使って村にかかった呪いを打ち破った。","type":"noun","meaning_category":"魔法を打ち破る能力を持つ者"},{"sentence":"She chose the spellbreaker class in the game for its strong magic resistance.","translation":"彼女はゲームで、魔法抵抗力が高いスペルブレイカーのクラスを選んだ。","type":"noun","meaning_category":"ゲームにおけるクラス"}]}