{"word":"vampirism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"吸血鬼信仰、吸血行為、吸血鬼症候群","english_definition":"The belief in or practice of vampirism; the condition or behavior of a vampire.","examples":[{"sentence":"Some people are fascinated by vampirism and vampire lore.","translation":"吸血鬼信仰や吸血鬼伝説に魅了される人もいる。"},{"sentence":"The novel explores themes of vampirism and immortality.","translation":"その小説は、吸血鬼信仰と不死のテーマを探求している。"},{"sentence":"Psychological vampirism involves draining someone's emotional energy.","translation":"心理的な吸血行為は、誰かの感情的なエネルギーを奪うことを伴う。"}],"collocations":["vampirism beliefs","psychological vampirism","sexual vampirism"],"synonyms":["bloodthirstiness","predation","parasitism"],"antonyms":[]}],"etymology":{"value":"'Vampire' + '-ism'. 'Vampire' comes from French vampire, from German Vampir, from Serbian вампир (vampir), of ultimately uncertain origin.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvæmpaɪərɪzəm/","syllables":"vam-pir-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Vampirism' refers to beliefs, practices, or conditions associated with vampires. It can refer to literal blood-drinking, or metaphorically to draining someone's energy or resources.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was suffering from vampirism, so he drank blood.","correct":"✓ He was exhibiting vampiristic behavior, so he drank blood.","note":"'Vampirism' is the belief or practice, not the state of being a vampire. Use 'vampiristic' as an adjective."}],"priority":"★☆☆"},"related_words":{"derivatives":["vampire","vampiric","vampiristic"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Vampirism' is a relatively uncommon word that refers to the belief in or practice of being a vampire, or to behaviors associated with vampires. It's often used in discussions of folklore, literature, or psychology. It is not a word commonly used in everyday conversation."},"example_sentences":[{"sentence":"The documentary explored the history of vampirism in Eastern European folklore.","translation":"そのドキュメンタリーは、東ヨーロッパの民間伝承における吸血鬼信仰の歴史を探求した。","type":"noun","meaning_category":"吸血鬼信仰"},{"sentence":"Some psychologists study psychological vampirism, where individuals drain emotional energy from others.","translation":"一部の心理学者は、個人が他人から感情的なエネルギーを奪う心理的な吸血行為を研究している。","type":"noun","meaning_category":"吸血行為"}]}