{"word":"Spartanburg","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"スパルタンバーグ（アメリカ合衆国サウスカロライナ州の都市）","english_definition":"A city in South Carolina, United States.","examples":[{"sentence":"Spartanburg is located in the upstate region of South Carolina.","translation":"スパルタンバーグは、サウスカロライナ州のアップステート地域に位置しています。"},{"sentence":"The economy of Spartanburg is diverse, with manufacturing, healthcare, and education sectors.","translation":"スパルタンバーグの経済は多様で、製造業、医療、教育分野があります。"}],"collocations":["City of Spartanburg","Spartanburg County","University of Spartanburg"],"synonyms":["Hub City (nickname)"],"antonyms":[]},{"part_of_speech":"noun","definition":"スパルタンバーグ郡（アメリカ合衆国サウスカロライナ州の郡）","english_definition":"A county in South Carolina, United States.","examples":[{"sentence":"Spartanburg County is known for its historical significance in the American Revolutionary War.","translation":"スパルタンバーグ郡は、アメリカ独立戦争における歴史的重要さで知られています。"},{"sentence":"The population of Spartanburg County is growing steadily.","translation":"スパルタンバーグ郡の人口は着実に増加しています。"}],"collocations":["Spartanburg County School District","Spartanburg County Public Libraries"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The city and county are named after the Spartan Regiment, a local militia unit that fought in the American Revolutionary War. The name 'Spartan' was chosen to reflect the perceived courage and discipline of the soldiers, drawing a parallel to the ancient Greek city-state of Sparta.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈspɑːrtənbɜːrɡ/","syllables":"Spar-tan-burg"},"inflection":{},"usage_notes":{"explanation":"'Spartanburg' typically refers to either the city or the county in South Carolina. Context is usually sufficient to determine which is meant. When referring to the city, it's common to say 'the city of Spartanburg'. When referring to the county, it's common to say 'Spartanburg County'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Spartanburg are a nice city.","correct":"✓ Spartanburg is a nice city.","note":"When referring to the city, 'Spartanburg' is treated as a singular noun. Therefore, use 'is' instead of 'are'."},{"incorrect":"✗ I live in Spartanburg city county.","correct":"✓ I live in Spartanburg County. / ✓ I live in the city of Spartanburg.","note":"Avoid redundancy by using either 'Spartanburg County' or 'the city of Spartanburg'."}],"priority":"★★☆"},"related_words":{"derivatives":["Spartan (adjective - relating to Sparta or Spartanburg; characterized by simplicity, frugality, or austerity)"],"phrases":["Upstate South Carolina (the region where Spartanburg is located)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively frequent within the context of South Carolina and regional news.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Spartanburg' is a proper noun referring to a specific place in South Carolina. Understanding its meaning requires knowledge of US geography. The word itself is not complex, but its significance is tied to its location and the historical context of the region. It's important to know that it can refer to either the city or the county, depending on the context."},"example_sentences":[{"sentence":"I'm planning a trip to Spartanburg next month.","translation":"来月、スパルタンバーグへ旅行に行く予定です。","type":"noun","meaning_category":"City"},{"sentence":"Spartanburg County has a rich history.","translation":"スパルタンバーグ郡は豊かな歴史を持っています。","type":"noun","meaning_category":"County"},{"sentence":"The University of South Carolina Upstate is located in Spartanburg.","translation":"サウスカロライナ大学アップステート校は、スパルタンバーグにあります。","type":"noun","meaning_category":"City"}]}