{"word":"transformers","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"変圧器 (electricity)","english_definition":"An electrical device that transfers electrical energy between two or more circuits through electromagnetic induction.","examples":[{"sentence":"The power station uses large transformers to step up the voltage for transmission.","translation":"発電所では、送電のために電圧を上げるために大型の変圧器を使用しています。"}],"collocations":["power transformer","distribution transformer","step-up transformer","step-down transformer"],"synonyms":["voltage converter"],"antonyms":[]},{"part_of_speech":"noun","definition":"トランスフォーマー (toys/entertainment)","english_definition":"A line of toys and entertainment featuring robots that can transform into vehicles, animals, or other objects.","examples":[{"sentence":"My son is a big fan of the Transformers movies.","translation":"私の息子はトランスフォーマーの映画の大ファンです。"},{"sentence":"He has a large collection of Transformers action figures.","translation":"彼はトランスフォーマーのアクションフィギュアをたくさんコレクションしています。"}],"collocations":["Transformers movie","Transformers toy","Transformers action figure","Autobots","Decepticons"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"変換器 (general)","english_definition":"A general term for something that transforms something else.","examples":[{"sentence":"In machine learning, transformers are a type of neural network architecture.","translation":"機械学習では、トランスフォーマーはニューラルネットワークアーキテクチャの一種です。"}],"collocations":[],"synonyms":["converter"],"antonyms":[]}],"etymology":{"value":"The word \"transformer\" comes from the verb \"transform,\" meaning to change in form or appearance. In the context of electricity, it refers to the device's ability to transform voltage levels. In the context of the toy line, it refers to the robots' ability to transform into different forms.","priority":"★★☆"},"pronunciation":{"ipa":"/trænsˈfɔːrmərz/","syllables":"trans-form-ers"},"inflection":{"noun_plural":"transformers"},"usage_notes":{"explanation":"The word \"transformers\" has multiple meanings depending on the context. It can refer to electrical devices used to change voltage, a popular toy and entertainment franchise, or, more generally, anything that transforms something else. When referring to the toy line, it is typically capitalized.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need a transformer for my phone charger.","correct":"✓ I need an adapter for my phone charger.","note":"While a transformer technically transforms electricity, in the context of phone chargers, the more common term is \"adapter.\""}],"priority":"★★☆"},"related_words":{"derivatives":["transform","transformation"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively common, especially in technical and entertainment contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"The word \"transformers\" can refer to different things. Most commonly, it refers to the popular toys and movies about robots that can change into vehicles. It can also refer to an electrical device that changes the voltage of electricity. The meaning depends on the context in which it is used."},"example_sentences":[{"sentence":"The electrical **transformers** are essential for distributing power across the city.","translation":"電気変圧器は、都市全体に電力を供給するために不可欠です。","type":"noun","meaning_category":"変圧器"},{"sentence":"My kids love playing with their **Transformers** toys.","translation":"私の子供たちはトランスフォーマーのおもちゃで遊ぶのが大好きです。","type":"noun","meaning_category":"トランスフォーマー (toys)"},{"sentence":"**Transformers** are a powerful architecture in deep learning.","translation":"トランスフォーマーは深層学習における強力なアーキテクチャです。","type":"noun","meaning_category":"変換器"}]}