{"word":"demultiplexer","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"デマルチプレクサ、逆多重化回路","english_definition":"An electronic circuit that takes a single input signal and routes it to one of several output lines.","examples":[{"sentence":"A demultiplexer is used to select one of several output channels based on the input address.","translation":"デマルチプレクサは、入力アドレスに基づいて複数の出力チャネルのうちの1つを選択するために使用されます。"},{"sentence":"The demultiplexer converts the serial data stream into parallel data.","translation":"デマルチプレクサは、シリアルデータストリームをパラレルデータに変換します。"}],"collocations":["use a demultiplexer","design a demultiplexer","implement a demultiplexer","4-to-1 demultiplexer","8-to-1 demultiplexer"],"synonyms":["data selector","decoder"],"antonyms":["multiplexer"]}],"etymology":{"value":"The term 'demultiplexer' is formed by combining 'de-' (meaning 'reverse' or 'undoing') with 'multiplexer'. A multiplexer combines multiple input signals into one, while a demultiplexer performs the reverse operation.","priority":"★★★"},"pronunciation":{"ipa":"/ˌdiːmʌltɪˈplɛksər/","syllables":"de-mul-ti-plex-er"},"inflection":{"noun_plural":"demultiplexers"},"usage_notes":{"explanation":"A demultiplexer (often shortened to 'demux') is a fundamental component in digital electronics and data communication systems. It essentially acts as a single-pole multiple-throw switch, directing a single input to one of several outputs. The specific output is determined by a set of select lines (address inputs). Demultiplexers are used in various applications, including data routing, memory addressing, and communication systems where data needs to be separated and distributed.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The demultiplexer multiplexes the signal.","correct":"✓ The demultiplexer demultiplexes the signal.","note":"Demultiplexers perform the reverse operation of multiplexing; they do not multiplex signals. Use the verb 'demultiplex' to describe the action of a demultiplexer."},{"incorrect":"✗ Demultiplexer is same as multiplexer.","correct":"✓ Demultiplexer is opposite of multiplexer.","note":"Demultiplexers and multiplexers perform opposite functions. A multiplexer combines multiple signals, while a demultiplexer separates a single signal into multiple outputs."}],"priority":"★★☆"},"related_words":{"derivatives":["demultiplex (verb)","demultiplexing (noun)"],"related_terms":["multiplexer","encoder","decoder","logic gate","digital circuit"],"priority":"★★★"},"level_frequency":{"level":"Advanced (Electrical Engineering, Computer Science)","frequency_google_ngram":"Low (Specific technical term)","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"A **demultiplexer** is a special electronic component that works like a switch. Imagine you have one wire carrying a signal, and you want to send that signal to one of many different destinations. A demultiplexer takes that single signal and, based on a code you give it, sends it to the correct output wire. It's the opposite of a multiplexer, which combines many signals into one. Demultiplexers are used in computers and other electronic devices to route data efficiently."},"example_sentences":[{"sentence":"The address lines of the demultiplexer determine which output is activated.","translation":"デマルチプレクサのアドレス線は、どのアウトプットがアクティブになるかを決定します。","type":"technical description","meaning_category":"functionality"},{"sentence":"We used a demultiplexer to route the sensor data to different processing units.","translation":"センサーデータを異なる処理ユニットにルーティングするために、デマルチプレクサを使用しました。","type":"application","meaning_category":"usage"},{"sentence":"The demultiplexer's propagation delay affects the overall system performance.","translation":"デマルチプレクサの伝搬遅延は、システム全体のパフォーマンスに影響を与えます。","type":"performance characteristic","meaning_category":"performance"}]}