{"word":"Pensionry","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(historical) A system or arrangement by which individuals or groups receive regular payments or benefits, especially from a government or other organization, often in exchange for services or loyalty.","english_definition":"A system or arrangement by which individuals or groups receive regular payments or benefits, especially from a government or other organization, often in exchange for services or loyalty.","examples":[{"sentence":"The pensionry established by the crown ensured the loyalty of key officials.","translation":"王室によって設立されたペンションリーは、主要な役人の忠誠を確保した。"},{"sentence":"The Dutch Republic's pensionary system involved regular payments to certain advisors and officials.","translation":"オランダ共和国のペンションリー制度は、特定のアドバイザーや役人への定期的な支払いを含んでいた。"}],"collocations":["establish a pensionry","maintain a pensionry","abolish a pensionry"],"synonyms":["allowance system","stipend system","payment scheme"],"antonyms":[]}],"etymology":{"value":"Derived from 'pension,' referring to a regular payment, with the suffix '-ry' indicating a system or arrangement.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɛnʃənri/","syllables":"Pen-sion-ry"},"inflection":{"noun_plural":"Pensionries"},"usage_notes":{"explanation":"'Pensionry' is a historical term primarily used to describe a system of regular payments or benefits provided by a government or organization to individuals in exchange for services or loyalty. It is often associated with political structures and patronage systems of the past.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He applied for a pensionry after retiring.","correct":"✓ He applied for a pension after retiring.","note":"'Pension' is the correct term for individual retirement benefits, while 'pensionry' refers to the system as a whole."}],"priority":"★★☆"},"related_words":{"derivatives":["pension","pensioner"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pensionry' is a specialized historical term referring to a system of regular payments or benefits, often used in the context of historical political structures. It is not commonly used in modern English. Understanding requires knowledge of historical patronage systems."},"example_sentences":[{"sentence":"The crown implemented a pensionry to secure the allegiance of local lords.","translation":"王室は地方の領主の忠誠を確保するためにペンションリーを実施した。","type":"noun","meaning_category":"system of payments"},{"sentence":"The pensionry ensured a steady income for those serving in the royal court.","translation":"ペンションリーは王室に仕える人々に安定した収入を保証した。","type":"noun","meaning_category":"system of benefits"}]}