{"word":"celoscope","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of kaleidoscope that uses transparent cells containing liquids or other materials to create moving patterns.","english_definition":"A kaleidoscope in which the patterns are formed by the movement of liquids or other materials in transparent cells.","examples":[{"sentence":"The celoscope created mesmerizing, ever-changing patterns of color and light.","translation":"セロスコープは、色と光の魅惑的で絶え間なく変化するパターンを作り出しました。"}],"collocations":["moving patterns","transparent cells","liquid-filled celoscope","artistic celoscope"],"synonyms":["kaleidoscope","teleidoscope"],"antonyms":[]}],"etymology":{"value":"The word \"celoscope\" is likely a combination of \"cel(l)\" (referring to the transparent cells used) and \"-scope\" (from Greek \"skopeō,\" meaning \"to view\" or \"to examine\").","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈsɛləˌskoʊp/","syllables":"ce-lo-scope"},"inflection":{"noun_plural":"celoscopes"},"usage_notes":{"explanation":"Celoscopes are a specific type of kaleidoscope that utilizes transparent cells, often filled with liquids or other materials, to generate dynamic and evolving patterns. Unlike traditional kaleidoscopes that use mirrors and solid objects, celoscopes offer a more fluid and organic visual experience.","priority":"☆☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["celoscopic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term \"celoscope\" refers to a specialized type of kaleidoscope that creates patterns using liquids or other materials within transparent cells. It is a relatively uncommon term, typically encountered in contexts related to optical toys, art, or science education. Understanding the term requires familiarity with the basic principles of kaleidoscopes and an understanding of how fluid dynamics can be used to create visual patterns."},"example_sentences":[{"sentence":"The artist used a celoscope to project swirling patterns onto the gallery walls.","translation":"アーティストは、セロスコープを使って、渦巻く模様をギャラリーの壁に投影しました。","type":"noun","meaning_category":"optical instrument"},{"sentence":"The science museum featured a large celoscope exhibit, allowing visitors to experiment with different liquids and materials.","translation":"科学博物館では、大きなセロスコープの展示があり、訪問者はさまざまな液体や材料を試すことができました。","type":"noun","meaning_category":"exhibit"}]}