{"word":"saintling","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"小さな聖人、聖人のような人、聖人のように振る舞う人 (しばしば皮肉を込めて)","english_definition":"A little saint; one who affects the manners or character of a saint (often used ironically).","examples":[{"sentence":"Don't act like such a saintling; we all know you're not perfect.","translation":"そんな聖人ぶらないで。あなたが完璧じゃないことみんな知ってるんだから。"},{"sentence":"She's such a saintling, always volunteering and helping others.","translation":"彼女は本当に聖人のようで、いつもボランティアをして他人を助けている。"}],"collocations":["affected saintling (気取った聖人)","pretentious saintling (見栄っ張りの聖人)"],"synonyms":["hypocrite (偽善者 - 皮肉な意味で使われる場合)","goody-goody (お利口さん - 軽蔑的な意味合い)","prig (気取り屋 - 軽蔑的な意味合い)"],"antonyms":["sinner","scoundrel"]},{"part_of_speech":"noun","definition":"(歴史的に)聖人の像、聖遺物","english_definition":"(Historically) A small image or relic of a saint.","examples":[{"sentence":"The museum displayed various saintlings from the medieval period.","translation":"博物館には中世時代の様々な聖人の像が展示されていた。"}],"collocations":["medieval saintling (中世の聖人像)","relic saintling (聖遺物の像)"],"synonyms":["relic","icon","effigy"],"antonyms":[]}],"etymology":{"value":"\"Saint\" + diminutive suffix \"-ling\".","priority":"★★★"},"pronunciation":{"ipa":"/ˈseɪntlɪŋ/","syllables":"saint-ling"},"inflection":{"noun_plural":"saintlings"},"usage_notes":{"explanation":"The word \"saintling\" is not commonly used in modern English. It often carries a negative connotation, implying that someone is being overly pious or self-righteous. The historical meaning referring to a small image or relic of a saint is even less common.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a true saintling, never making mistakes.","correct":"✓ He strives to be a saint, but he's not perfect.","note":"Calling someone a \"saintling\" implies they are trying too hard to appear saintly, which suggests insincerity. It's better to say someone \"strives to be a saint\" if you mean they are genuinely trying to be good. Using \"saint\" directly is generally more sincere."}],"priority":"★☆☆"},"related_words":{"derivatives":["saint (聖人)","saintly (聖人のような)","sainthood (聖人の位)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Very rare - not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Extremely rare (極めてまれ)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"\"Saintling\" is a rare and somewhat archaic word. It is best understood as a diminutive of \"saint,\" but it often carries a pejorative connotation, suggesting that someone is putting on airs of piety or is not genuinely virtuous. Due to its rarity and potential for misinterpretation, it should be used with caution. The historical meaning referring to a small image or relic is even less common. Understanding the etymology (saint + -ling) helps to grasp its meaning, but context is crucial to interpreting its intent.","priority":"★☆☆"},"example_sentences":[{"sentence":"The character in the play was portrayed as a self-righteous saintling, constantly judging others.","translation":"劇中の登場人物は、常に他人を裁く独善的な聖人のように描かれていた。","type":"noun","meaning_category":"聖人のような人 (皮肉を込めて)"},{"sentence":"She collected saintlings and other religious artifacts.","translation":"彼女は聖人の像やその他の宗教的な遺物を集めていた。","type":"noun","meaning_category":"聖人の像 (歴史的に)"}]}