{"word":"Europeanism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ヨーロッパ主義、ヨーロッパ的な特徴、ヨーロッパの文化・思想への傾倒","english_definition":"Advocacy of or belief in the political or cultural unity of Europe; a feature or characteristic regarded as distinctively European; adherence to European culture or ideas.","examples":[{"sentence":"The rise of Europeanism has led to greater cooperation among nations.","translation":"ヨーロッパ主義の高まりは、国家間の協力の強化につながった。"},{"sentence":"His Europeanism was evident in his appreciation for classical art and literature.","translation":"彼のヨーロッパ主義は、古典芸術や文学への評価に明らかだった。"},{"sentence":"Critics argue that Europeanism can sometimes overlook the unique identities of individual countries.","translation":"批評家たちは、ヨーロッパ主義が時に個々の国の独自性を軽視することがあると主張する。"}],"collocations":["political Europeanism (政治的ヨーロッパ主義)","cultural Europeanism (文化的ヨーロッパ主義)","promote Europeanism (ヨーロッパ主義を推進する)","support Europeanism (ヨーロッパ主義を支持する)","critique Europeanism (ヨーロッパ主義を批判する)"],"synonyms":["pro-Europeanism","European integration","Eurocentrism (文脈によっては)"],"antonyms":["Euroscepticism","nationalism","regionalism"]},{"part_of_speech":"noun","definition":"ヨーロッパ特有の語法、ヨーロッパ的な表現","english_definition":"A word, idiom, or other linguistic feature characteristic of European languages, especially when used in another language.","examples":[{"sentence":"The phrase 'to be in agreement' is sometimes considered a Europeanism in English.","translation":"「to be in agreement」というフレーズは、英語ではヨーロッパ的な語法とみなされることがある。"},{"sentence":"The translator tried to avoid Europeanisms in his translation to make it sound more natural.","translation":"翻訳者は、より自然な響きにするために、翻訳の中でヨーロッパ的な表現を避けるように努めた。"}],"collocations":["linguistic Europeanism (言語的なヨーロッパ主義)","avoid Europeanisms (ヨーロッパ的な語法を避ける)","identify Europeanisms (ヨーロッパ的な語法を特定する)"],"synonyms":["loanword","calque","borrowing"],"antonyms":[]}],"etymology":{"value":"'Europe' + '-an' + '-ism'.  Formed from 'European' and the suffix '-ism', indicating a belief, ideology, or characteristic.","priority":"★★★"},"pronunciation":{"ipa":"/ˌjʊərəˈpiːənɪzəm/","syllables":"Eu-ro-pe-an-ism"},"inflection":{"noun_plural":"Europeanisms (複数形は、ヨーロッパ特有の語法を指す場合に用いられる)"},"usage_notes":{"explanation":"'Europeanism' has two main senses. The first refers to the political and cultural ideology promoting European unity and integration. The second, less common, refers to linguistic features characteristic of European languages. The context usually makes it clear which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a strong believer of Europeanism.","correct":"✓ He is a strong believer in Europeanism.","note":"The correct preposition to use with 'believer' is 'in'."},{"incorrect":"✗ The Europeanism of the building was very modern.","correct":"✓ The European style of the building was very modern.","note":"'Europeanism' refers to a belief or ideology, not a style. Use 'European style' or 'European design' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["European (adjective, noun)","Europeanize (verb)","Eurocentric (adjective)"],"phrases":["pro-European","anti-European"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"比較的低い (Relatively low)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Europeanism' is a relatively complex term. It can refer to the idea of European unity and the promotion of European culture and values. It can also refer to specific linguistic features that are characteristic of European languages. Understanding the context is important to determine the intended meaning. It is more commonly used in academic or political discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The treaty reflected a growing sense of Europeanism among the member states.","translation":"その条約は、加盟国間のヨーロッパ主義の高まりを反映していた。","type":"noun","meaning_category":"political/cultural ideology"},{"sentence":"The translator was careful to avoid Europeanisms that might sound awkward in English.","translation":"翻訳者は、英語で不自然に聞こえる可能性のあるヨーロッパ的な語法を避けるように注意した。","type":"noun","meaning_category":"linguistic feature"},{"sentence":"Europeanism emphasizes shared values and cooperation across national borders.","translation":"ヨーロッパ主義は、国境を越えた共通の価値観と協調を強調する。","type":"noun","meaning_category":"political/cultural ideology"}]}