{"word":"Ureterostenoma","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"尿管狭窄","english_definition":"A narrowing or stricture of the ureter.","examples":[{"sentence":"The patient was diagnosed with ureterostenoma after experiencing flank pain.","translation":"患者は、側腹部痛を訴えた後、尿管狭窄と診断された。"}],"collocations":["ureterostenoma diagnosis","ureterostenoma treatment","congenital ureterostenoma"],"synonyms":["ureteral stricture","ureteral stenosis"],"antonyms":[]}],"etymology":{"value":"The term \"ureterostenoma\" is derived from the following Greek roots: 'uretero-' referring to the ureter, 'steno-' meaning narrow, and '-oma' indicating a condition or growth.","priority":"★★★"},"pronunciation":{"ipa":"/juˌritəroʊstɪˈnoʊmə/","syllables":"u-re-ter-o-ste-no-ma"},"inflection":{"noun_plural":"ureterostenomas"},"usage_notes":{"explanation":"Ureterostenoma refers specifically to the narrowing of the ureter, which can lead to obstruction of urine flow. It can be congenital (present at birth) or acquired due to injury, inflammation, or surgery. Diagnosis often involves imaging techniques such as ultrasound, CT scans, or intravenous pyelography. Treatment options vary depending on the severity and cause of the stenosis, ranging from minimally invasive procedures like balloon dilation to surgical reconstruction.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor found a ureterostenosis.","correct":"✓ The doctor found a ureterostenoma.","note":"While 'ureteral stenosis' is a valid term, 'ureterostenoma' is the specific noun form referring to the condition itself."}],"priority":"★★☆"},"related_words":{"derivatives":["ureter (noun): The tube that carries urine from the kidney to the bladder.","stenosis (noun): The abnormal narrowing of a passage in the body.","ureteral (adjective): Relating to the ureter."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ureterostenoma' is a medical term referring to the narrowing of the ureter. Understanding this term requires knowledge of medical terminology, particularly the prefixes and suffixes used in medical contexts. It is typically encountered in medical literature or discussions among healthcare professionals.","priority":"★★★"},"example_sentences":[{"sentence":"Surgical intervention is often necessary to correct severe cases of ureterostenoma.","translation":"重度の尿管狭窄を矯正するには、外科的介入が必要となることが多い。","type":"medical condition","meaning_category":"narrowing of the ureter"},{"sentence":"The ureterostenoma was identified during a routine ultrasound examination.","translation":"尿管狭窄は、定期的な超音波検査中に確認された。","type":"medical diagnosis","meaning_category":"narrowing of the ureter"}]}