{"word":"proviruses","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"プロウイルス (ウイルスのゲノムが宿主細胞のDNAに組み込まれた状態)","english_definition":"plural of provirus: A viral genome that is integrated into the DNA of a host cell.","examples":[{"sentence":"Proviruses can remain dormant within the host cell for extended periods.","translation":"プロウイルスは、宿主細胞内で長期間休眠状態を維持することがあります。"},{"sentence":"The detection of proviruses is crucial for understanding viral latency.","translation":"プロウイルスの検出は、ウイルスの潜伏期間を理解する上で重要です。"}],"collocations":["integrated provirus","latent provirus","proviral DNA","proviral integration"],"synonyms":["integrated viral genome"],"antonyms":[]}],"etymology":{"value":"'pro-' (before) + 'virus'. Indicates the viral genome exists before it actively replicates and produces new viruses.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊˈvaɪrəsɪz/","syllables":"pro-vi-rus-es"},"inflection":{"noun_plural":"proviruses"},"usage_notes":{"explanation":"'Proviruses' refers specifically to the integrated form of a viral genome within a host cell's DNA. It's a term commonly used in the context of retroviruses like HIV, where the virus integrates its DNA into the host's genome as part of its replication cycle. The provirus can then be replicated along with the host cell's DNA.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The provirus is replicating outside the cell.","correct":"✓ The provirus is integrated into the cell's DNA.","note":"Proviruses are, by definition, integrated into the host cell's genome. Replication of the virus in its active form occurs after the provirus is transcribed and translated. "},{"incorrect":"✗ Provirus is the same as a free virus particle.","correct":"✓ A provirus is the integrated form of a viral genome, while a free virus particle is the virus outside the host cell.","note":"A provirus is not a free virus particle; it's the integrated form within the host's DNA."}],"priority":"★★☆"},"related_words":{"derivatives":["provirus (singular form)","retrovirus (a type of virus that uses reverse transcriptase to integrate its genome as a provirus)","integration (the process of the viral genome becoming part of the host genome)","latency (the state of being dormant or inactive)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'proviruses' is a technical term used in virology and molecular biology. It refers to the state where a virus's genetic material has been incorporated into the genetic material of the host cell it has infected. This concept is particularly relevant for understanding retroviruses, like HIV, which use this mechanism to establish a long-term infection. Understanding this term requires a background in biology or virology."},"example_sentences":[{"sentence":"The HIV proviruses were detected in the patient's T cells.","translation":"HIVプロウイルスが患者のT細胞で検出されました。","type":"noun","meaning_category":"virology"},{"sentence":"The integrated proviruses can be passed on to daughter cells during cell division.","translation":"組み込まれたプロウイルスは、細胞分裂中に娘細胞に受け継がれる可能性があります。","type":"noun","meaning_category":"genetics"},{"sentence":"Understanding the mechanisms of proviral integration is crucial for developing effective antiviral therapies.","translation":"プロウイルスの組み込みメカニズムを理解することは、効果的な抗ウイルス療法を開発するために重要です。","type":"noun","meaning_category":"medicine"}]}