{"word":"Laevoduction","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(眼科学)左方回旋、左旋","english_definition":"Movement of an eye to the left.","examples":[{"sentence":"Laevoduction is one of the six cardinal movements of the eye.","translation":"左方回旋は、眼の主要な6つの運動の一つです。"},{"sentence":"The patient exhibited normal laevoduction during the neurological examination.","translation":"神経学的検査中、患者は正常な左方回旋を示した。"}],"collocations":["normal laevoduction (正常な左方回旋)","impaired laevoduction (障害された左方回旋)","test laevoduction (左方回旋を検査する)"],"synonyms":["leftward movement","sinistroversion"],"antonyms":["dextroversion","dextroduction"]}],"etymology":{"value":"Derived from the Latin words 'laevo-' meaning 'left' and 'duction' meaning 'leading' or 'movement'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌliːvəˈdʌkʃən/","syllables":"Lee-vo-duc-tion"},"inflection":{"noun_plural":"laevoductions"},"usage_notes":{"explanation":"Laevoduction specifically refers to the movement of the eye to the left. It is a medical term used in ophthalmology and neurology to describe and assess eye movements. The term is often used in the context of diagnosing and evaluating eye muscle function and neurological disorders affecting eye movement.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The muscle responsible for laevoduction is on the right side of the eye.","correct":"✓ The muscle responsible for laevoduction is on the left side of the eye.","note":"The muscles that control eye movement are complex, but laevoduction involves muscles that facilitate movement to the left."},{"incorrect":"✗ Laevoduction is the same as elevation.","correct":"✓ Laevoduction is the movement of the eye to the left. Elevation is the upward movement of the eye.","note":"Laevoduction refers to horizontal movement to the left, not vertical movement."}],"priority":"★★☆"},"related_words":{"derivatives":["dextroduction (右方回旋)","supraduction (上方回旋)","infraduction (下方回旋)","cycloduction (回旋運動)"],"broader_terms":["eye movement","ocular motility"],"narrower_terms":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Laevoduction' is a specialized medical term used in ophthalmology and neurology. It refers specifically to the movement of the eye to the left. Understanding this term requires a background in medical terminology and an understanding of eye anatomy and function. It is not commonly used outside of medical contexts."},"example_sentences":[{"sentence":"Assessment of laevoduction is crucial in diagnosing lateral rectus muscle palsy.","translation":"外直筋麻痺の診断には、左方回旋の評価が重要です。","type":"medical","meaning_category":"eye movement"},{"sentence":"Limited laevoduction can indicate a cranial nerve VI deficit.","translation":"左方回旋の制限は、第VI脳神経の欠損を示す可能性があります。","type":"medical","meaning_category":"eye movement"}]}