{"word":"brachistocephalic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"短頭の、短頭型の","english_definition":"Having a cephalic index of 80 or over; having a relatively short and broad head.","examples":[{"sentence":"The skull was identified as brachistocephalic.","translation":"その頭蓋骨は短頭型であると特定された。"},{"sentence":"Brachistocephalic head shapes are common in certain populations.","translation":"短頭型の頭の形は、特定の集団によく見られる。"}],"collocations":["brachistocephalic skull","brachistocephalic index"],"synonyms":["brachycephalic","short-headed"],"antonyms":["dolichocephalic","long-headed"]}],"etymology":{"value":"From Greek brachys (short) + kephalē (head).","priority":"★★★"},"pronunciation":{"ipa":"/ˌbrækɪstəʊsɪˈfælɪk/","syllables":"bra-chis-to-ce-phal-ic"},"inflection":{"notes":"Adjective, no comparative or superlative forms typically used."},"usage_notes":{"explanation":"'Brachistocephalic' is a technical term used in anthropology and physical anthropology to describe a head shape that is relatively short and broad. It is determined by the cephalic index, which is the ratio of head breadth to head length. A cephalic index of 80 or more is considered brachistocephalic.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The baby's head is brachistocephalic, so it's abnormal.","correct":"✓ The baby's head is brachistocephalic; this is a normal variation in head shape.","note":"Brachistocephaly is a normal variation and not necessarily indicative of a medical problem unless associated with other symptoms or conditions."}],"priority":"★★☆"},"related_words":{"derivatives":["brachistocephaly (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Brachistocephalic' is a specialized term primarily used in anthropology and related fields to describe a specific head shape characterized by a high cephalic index, indicating a relatively short and broad head. Its usage is confined to academic and scientific contexts. Understanding requires familiarity with anthropological terminology and concepts related to cranial measurements."},"example_sentences":[{"sentence":"Anthropologists measured the cephalic index to determine if the skull was brachistocephalic.","translation":"人類学者は、頭蓋骨が短頭型であるかどうかを判断するために頭指数を測定した。","type":"adjective","meaning_category":"Descriptive"},{"sentence":"The study focused on the prevalence of brachistocephalic head shapes in the region.","translation":"その研究は、その地域における短頭型の頭の形の有病率に焦点を当てた。","type":"adjective","meaning_category":"Descriptive"}]}