{"word":"batholith","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"底盤 (ていばん): 広大な深成岩体","english_definition":"A large mass of intrusive igneous rock (also called plutonic rock) that forms from cooled magma deep in the Earth's crust. Batholiths are typically composed primarily of felsic or intermediate rock types, such as granite, quartz diorite, or granodiorite. They are often exposed by erosion after uplift.","examples":[{"sentence":"The Sierra Nevada mountains are largely composed of a granite batholith.","translation":"シエラネバダ山脈は、主に花崗岩質の底盤で構成されている。"},{"sentence":"Erosion has exposed the batholith, revealing its vast extent.","translation":"浸食によって底盤が露出し、その広大な範囲が明らかになった。"}],"collocations":["granite batholith (花崗岩質の底盤)","exposed batholith (露出した底盤)","form a batholith (底盤を形成する)","underlying batholith (下にある底盤)"],"synonyms":["pluton","intrusive rock mass"],"antonyms":["extrusive rock","volcanic rock"]}],"etymology":{"value":"ギリシャ語の「bathos」（深さ）と「lithos」（石）に由来する。これは、batholithが地球の深部で形成されることに由来する。","priority":"★★☆"},"pronunciation":{"ipa":"ˈbæθəlɪθ","syllables":"bath-o-lith"},"inflection":{"noun_plural":"batholiths"},"usage_notes":{"explanation":"Batholiths are large, irregular-shaped intrusions of igneous rock that form deep within the Earth's crust. They are different from smaller intrusions like dikes and sills due to their size and the fact that they cut across the existing rock layers. Over long periods, uplift and erosion can expose these batholiths at the surface, forming prominent landscape features.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The batholith is a type of extrusive rock.","correct":"✓ The batholith is a type of intrusive rock.","note":"Batholiths are intrusive, meaning they form inside the Earth, not on the surface. Extrusive rocks are formed from lava that cools on the surface."},{"incorrect":"✗ The batholith is made of sedimentary rock.","correct":"✓ The batholith is made of igneous rock.","note":"Batholiths are made of igneous rock, which forms from cooled magma."}],"priority":"★★☆"},"related_words":{"derivatives":["batholithic (形容詞): 底盤の、底盤状の"],"related_terms":["pluton","dike","sill","laccolith","stock"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門的な地質学の語彙)","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**batholith**」は、地質学で使われる専門用語で、地球の深いところでマグマが冷えて固まってできた、とても大きな岩の塊のことです。この岩の塊は、周りの岩を押し分けてできるため、形が不規則です。長い時間が経つと、地面が隆起したり、雨や風で削られたりして、地表に現れることがあります。日常会話ではほとんど使われませんが、地質学や地球科学を学ぶ際には重要な言葉です。"},"example_sentences":[{"sentence":"The granite cliffs are part of a massive batholith that underlies the region.","translation":"その花崗岩の崖は、地域の下にある巨大な底盤の一部である。","type":"noun","meaning_category":"地質学"},{"sentence":"Mapping the extent of the batholith helps geologists understand the area's tectonic history.","translation":"底盤の範囲を地図にすることで、地質学者はその地域の構造史を理解するのに役立つ。","type":"noun","meaning_category":"地質学"}]}