{"word":"preprints","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"査読前論文、プレプリント","english_definition":"versions of research papers that authors share publicly before they have been peer-reviewed.","examples":[{"sentence":"Many researchers now post their work as preprints before submitting to journals.","translation":"多くの研究者は現在、論文誌に投稿する前に、研究成果をプレプリントとして公開しています。"},{"sentence":"The use of preprints has accelerated the pace of scientific communication.","translation":"プレプリントの利用は、科学コミュニケーションの速度を加速させています。"},{"sentence":"Concerns have been raised about the quality control of research shared as preprints.","translation":"プレプリントとして共有される研究の品質管理について懸念が提起されています。"}],"collocations":["post a preprint","submit a preprint","cite a preprint","preprint server","preprint archive"],"synonyms":["unpublished manuscript","working paper"],"antonyms":["peer-reviewed publication","published article"]},{"part_of_speech":"noun","definition":"（集合的に）プレプリントのコレクション","english_definition":"a collection of preprints.","examples":[{"sentence":"The library maintains a collection of preprints in various scientific fields.","translation":"図書館は、様々な科学分野のプレプリントのコレクションを維持しています。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Pre-' (before) + 'print' (a published work). Refers to the practice of sharing manuscripts before they are formally published in a journal.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpriːˌprɪnts/","syllables":"pree-prints"},"inflection":{"noun_plural":"preprints"},"usage_notes":{"explanation":"'Preprints' are preliminary versions of scientific papers shared publicly before undergoing peer review. They allow for rapid dissemination of research findings and facilitate open discussion within the scientific community. However, it's important to note that preprints have not been vetted by experts and should be interpreted with caution.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The preprint was peer-reviewed.","correct":"✓ The preprint has not yet been peer-reviewed.","note":"Preprints are, by definition, not yet peer-reviewed. This is a key distinction from published articles."},{"incorrect":"✗ Preprints are always reliable sources.","correct":"✓ Preprints should be interpreted with caution.","note":"While preprints can be valuable, their lack of peer review means they should be evaluated critically."}],"priority":"★★☆"},"related_words":{"derivatives":["preprint (singular form)","peer review","scientific publication","open science"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low, but increasing in recent years due to the rise of open science practices.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Preprints' refers to research papers that are made available to the public before they have been formally reviewed by other experts in the field (peer review). This allows researchers to share their findings quickly and receive feedback, but it also means that the research has not yet been validated by the traditional publishing process. The concept is becoming increasingly common in scientific fields.","priority":"★★☆"},"example_sentences":[{"sentence":"Researchers often use preprint servers to share their findings quickly.","translation":"研究者はしばしばプレプリントサーバーを利用して、研究成果を迅速に共有します。","type":"noun","meaning_category":"査読前論文"},{"sentence":"The preprint received a lot of attention on social media.","translation":"そのプレプリントはソーシャルメディアで多くの注目を集めました。","type":"noun","meaning_category":"査読前論文"},{"sentence":"It is important to cite preprints appropriately, acknowledging that they are not peer-reviewed.","translation":"プレプリントは査読を受けていないことを認識し、適切に引用することが重要です。","type":"noun","meaning_category":"査読前論文"}]}