{"word":"kinetochore","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"動原体（どうげんたい）：細胞分裂時に染色体を分離するために紡錘糸が付着する、染色体上のタンパク質構造","english_definition":"A protein structure on chromosomes where spindle fibers attach during cell division to pull the chromosomes apart.","examples":[{"sentence":"The kinetochore is essential for accurate chromosome segregation during mitosis.","translation":"動原体は、有糸分裂中の正確な染色体分離に不可欠です。"},{"sentence":"Spindle fibers attach to the kinetochore, ensuring that each daughter cell receives the correct number of chromosomes.","translation":"紡錘糸は動原体に付着し、各娘細胞が正しい数の染色体を受け取ることを保証します。"},{"sentence":"Errors in kinetochore function can lead to aneuploidy.","translation":"動原体機能の異常は異数性につながる可能性があります。"}],"collocations":["kinetochore protein","inner kinetochore","outer kinetochore","kinetochore microtubule","kinetochore assembly","kinetochore complex"],"synonyms":["centromere protein","chromosome segregation protein"],"antonyms":[],"field":"Cell Biology, Genetics"}],"etymology":{"value":"Derived from the Greek words 'kineto' (moving) and 'chore' (place), reflecting its role in chromosome movement during cell division.","priority":"★★★"},"pronunciation":{"ipa":"/kɪˈnɛtəˌkɔːr/","syllables":"ki-ne-to-chore"},"inflection":{"noun_plural":"kinetochores"},"usage_notes":{"explanation":"The kinetochore is a complex protein structure that assembles on the centromere region of a chromosome. It serves as the attachment point for spindle microtubules, which are responsible for segregating chromosomes during cell division (mitosis and meiosis). Proper kinetochore function is crucial for ensuring that each daughter cell receives the correct number of chromosomes. Defects in kinetochore assembly or function can lead to chromosome missegregation and aneuploidy, which are associated with various diseases, including cancer.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The centromere is the same as the kinetochore.","correct":"✓ The kinetochore assembles on the centromere.","note":"The kinetochore is a structure that forms *on* the centromere. The centromere is a region of DNA; the kinetochore is a protein complex. They are related but not the same."}],"priority":"★★☆"},"related_words":{"derivatives":["kinetochoric (adjective)"],"related_terms":["centromere","mitosis","meiosis","chromosome","spindle fibers","microtubules","aneuploidy","cell division"],"priority":"★★★"},"level_frequency":{"frequency_academic_writing":"Relatively common in cell biology and genetics research papers.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Kinetochore' is a technical term used in cell biology and genetics. It refers to a complex protein structure that forms on the centromere of a chromosome. Its primary function is to serve as an attachment point for spindle fibers during cell division, ensuring accurate chromosome segregation. Understanding the kinetochore is essential for comprehending the mechanisms of mitosis and meiosis, as well as the causes of chromosome abnormalities like aneuploidy. The term is typically encountered in advanced biology textbooks and research articles.","priority":"★★★"},"example_sentences":[{"sentence":"The **kinetochore** is a multi-protein complex that mediates chromosome attachment to the mitotic spindle.","translation":"動原体は、染色体の有糸分裂紡錘体への付着を仲介する多タンパク質複合体です。","type":"definition"},{"sentence":"Mutations in **kinetochore** proteins can disrupt chromosome segregation.","translation":"動原体タンパク質の変異は、染色体分離を妨げる可能性があります。","type":"function"},{"sentence":"Researchers are studying the dynamics of **kinetochore**-microtubule interactions.","translation":"研究者たちは、動原体と微小管の相互作用のダイナミクスを研究しています。","type":"research"},{"sentence":"The **kinetochore** plays a critical role in the spindle assembly checkpoint.","translation":"動原体は、紡錘体形成チェックポイントにおいて重要な役割を果たします。","type":"function"}]}