{"word":"luxuriation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"贅沢、豪華さ、豊かさ","english_definition":"The enjoyment of luxury; luxuriousness.","examples":[{"sentence":"The luxuriation of the spa was exactly what she needed to unwind.","translation":"そのスパの贅沢さは、彼女がリラックスするためにまさに必要としていたものだった。"},{"sentence":"He reveled in the luxuriation of his new penthouse apartment.","translation":"彼は新しいペントハウスアパートの豪華さを満喫した。"}],"collocations":["enjoy luxuriation","experience luxuriation","luxuriation of a spa","luxuriation of a hotel"],"synonyms":["luxury","opulence","sumptuousness","grandeur","richness","affluence"],"antonyms":["poverty","simplicity","austerity","deprivation"]},{"part_of_speech":"noun","definition":"(植物の)繁茂、旺盛な成長","english_definition":"Abundant or excessive growth or development, especially of plants.","examples":[{"sentence":"The luxuriation of the vines covered the entire wall.","translation":"つるの繁茂が壁全体を覆っていた。"},{"sentence":"The heavy rains caused a luxuriation of weeds in the garden.","translation":"大雨により、庭の雑草が旺盛に生い茂った。"}],"collocations":["luxuriation of vegetation","luxuriation of growth","promote luxuriation"],"synonyms":["profusion","abundance","exuberance","flourishing","prolificacy"],"antonyms":["scarcity","deficiency","stunted growth"]}],"etymology":{"value":"Derived from the word 'luxuriate,' which comes from the Latin 'luxuria' meaning 'excess, extravagance, luxury.' The suffix '-ation' is added to form a noun denoting a state or process.","priority":"★★☆"},"pronunciation":{"ipa":"/lʌɡˌʒʊəriˈeɪʃən/","syllables":"lux-u-ri-a-tion"},"inflection":{"noun_plural":"luxuriations"},"usage_notes":{"explanation":"The word \"luxuriation\" has two primary meanings: one related to the enjoyment of luxury and the other to abundant growth. When referring to luxury, it describes the state of experiencing or indulging in opulent and comfortable surroundings or experiences. When referring to growth, it describes the state of being lush and abundant, typically used in the context of plants or vegetation. The context will usually make it clear which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The luxuriation was very happy.","correct":"✓ The luxuriation was very enjoyable.","note":"Luxuriation refers to the experience or state of luxury, not a feeling. Use adjectives like 'enjoyable' or 'pleasant' to describe the feeling associated with it."},{"incorrect":"✗ The luxuriation of the desert.","correct":"✓ The vegetation of the desert.","note":"Luxuriation implies abundant growth. Deserts, by nature, do not typically exhibit luxuriant growth. Use 'vegetation' instead to refer to the plant life in a desert."}],"priority":"★★☆"},"related_words":{"derivatives":["luxuriate (verb: to enjoy oneself in a luxurious way; to grow profusely)","luxurious (adjective: characterized by luxury; richly comfortable)","luxury (noun: a state of great comfort and extravagant living; something expensive and not necessary)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"luxuriation\" is a relatively uncommon word that refers to the enjoyment of luxury or the state of abundant growth. It is more frequently encountered in formal writing or specialized contexts, such as descriptions of high-end experiences or botanical studies. Because of its less frequent usage, it is considered a more advanced vocabulary word. It is important to understand the context in which it is used to determine whether it refers to luxury or growth.","priority":"★★☆"},"example_sentences":[{"sentence":"The hotel offered a level of luxuriation that exceeded all expectations.","translation":"そのホテルは、あらゆる期待を超えるレベルの贅沢さを提供していた。","type":"noun","meaning_category":"贅沢、豪華さ"},{"sentence":"The luxuriation of the tropical rainforest was breathtaking.","translation":"熱帯雨林の繁茂は息をのむほどだった。","type":"noun","meaning_category":"(植物の)繁茂"}]}