{"word":"Emasculation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"去勢、男性器切除、男らしさを奪うこと","english_definition":"The removal of the testicles; castration. Figuratively, the deprivation of virility or vigor; weakening.","examples":[{"sentence":"Emasculation was a common punishment in some ancient societies.","translation":"去勢は古代社会において一般的な刑罰であった。"},{"sentence":"The emasculation of the novel by censorship is a tragedy.","translation":"検閲による小説の男らしさ（力強さ）の喪失は悲劇である。"},{"sentence":"He felt a sense of emasculation when he lost his job.","translation":"彼は失業したときに男らしさを奪われたような感覚を覚えた。"}],"collocations":["surgical emasculation (外科的去勢)","symbolic emasculation (象徴的な男らしさの喪失)","cultural emasculation (文化的な男らしさの喪失)"],"synonyms":["castration","gelding","debilitation","weakening","impotence"],"antonyms":["virilization","strengthening","empowerment"]}],"etymology":{"value":"From Latin 'emasculare', meaning 'to castrate', from 'e-' (ex-) meaning 'out' and 'masculus' meaning 'male'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˌmæskjʊˈleɪʃən/","syllables":"e-mas-cu-la-tion"},"inflection":{"noun_plural":"Emasculations"},"usage_notes":{"explanation":"'Emasculation' refers literally to the removal of the testicles, resulting in castration. Figuratively, it describes the act of depriving someone or something of power, strength, or virility. The figurative sense often carries a negative connotation, implying a loss of essential qualities.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The emasculation of women in society.","correct":"✓ The marginalization/oppression of women in society.","note":"'Emasculation' specifically refers to the removal of male virility or power. While women can be oppressed, the term 'emasculation' is not appropriate in this context. Use terms like 'marginalization' or 'oppression' instead."},{"incorrect":"✗ He felt emasculated after winning the competition.","correct":"✓ He felt empowered after winning the competition.","note":"Winning a competition would generally lead to a feeling of empowerment, not emasculation. Emasculation implies a loss of power or virility."}],"priority":"★★☆"},"related_words":{"derivatives":["emasculate (verb)","emasculated (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Emasculation' is a formal term that refers to the removal of the testicles or, figuratively, the deprivation of virility or strength. It is not a commonly used word and is more likely to appear in academic or specialized contexts. The figurative use implies a weakening or loss of essential male qualities or power. Understanding the etymology (from Latin 'masculus' meaning 'male') helps to grasp the word's meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The surgical emasculation of animals is sometimes practiced for population control.","translation":"動物の外科的去勢は、個体数管理のために時々行われる。","type":"noun","meaning_category":"去勢"},{"sentence":"The artist felt the studio's interference led to the emasculation of his vision.","translation":"アーティストは、スタジオの干渉が彼のビジョンの男らしさ（力強さ）を奪ったと感じた。","type":"noun","meaning_category":"男らしさを奪うこと"},{"sentence":"The political reforms were seen by some as an emasculation of the president's power.","translation":"その政治改革は、大統領の権力を奪うものだと見る人もいた。","type":"noun","meaning_category":"男らしさを奪うこと"}]}