{"word":"agripper","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Informal) Someone who is excessively greedy or grasping, especially for money.","english_definition":"(Informal) A person who is excessively greedy or grasping, especially for money.","examples":[{"sentence":"Don't be such an agripper; share the sweets with your friends.","translation":"そんなに欲張りにならないで、お菓子を友達と分けなさい。"},{"sentence":"The old man was known as an agripper because he never spent any of his money.","translation":"その老人はお金を全く使わないので、欲張りとして知られていた。"}],"collocations":["a notorious agripper","a miserly agripper"],"synonyms":["miser","hoarder","skinflint","cheapskate","tightwad","grasping person"],"antonyms":["philanthropist","generous person","giver"]}],"etymology":{"value":"Likely a blend of 'aggressively' and 'gripper,' suggesting someone who aggressively grips or holds onto possessions, especially money.","priority":"★☆☆"},"pronunciation":{"ipa":"/əˈɡrɪpər/","syllables":"a-grip-per"},"inflection":{"noun_plural":"agrippers"},"usage_notes":{"explanation":"'Agripper' is an informal and somewhat derogatory term for someone who is excessively greedy or miserly. It is not a commonly used word, and might be considered slang or dialectal in some regions. The term implies that the person is not only unwilling to spend money but also actively seeks to accumulate more, often at the expense of others.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He was agripper to the opportunity.","correct":"He was quick to seize the opportunity.","note":"'Agripper' is a noun referring to a person, not an adjective describing an action."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["greed","avarice","miserly","stingy"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Agripper' is an uncommon, informal term for a very greedy person. It suggests someone who tightly holds onto money and is unwilling to share. Because it's not widely used, it's best to understand it in context rather than try to use it in formal settings. You're more likely to encounter more common words like 'miser' or 'hoarder' to describe such a person."},"example_sentences":[{"sentence":"Everyone avoided him because he was known as an agripper.","translation":"彼は欲張りとして知られていたので、誰も彼を避けた。","type":"noun","meaning_category":"greedy person"},{"sentence":"The agripper refused to donate even a small amount to charity.","translation":"その欲張りは慈善団体にわずかな金額さえ寄付することを拒否した。","type":"noun","meaning_category":"greedy person"}]}