{"word":"Technopsychology","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"テクノロジー心理学：テクノロジーの利用が人間の心理、行動、および社会に与える影響を研究する学問分野。","english_definition":"The study of the psychological and behavioral effects of technology on individuals and society.","examples":[{"sentence":"Technopsychology explores how social media affects mental health.","translation":"テクノロジー心理学は、ソーシャルメディアが精神衛生にどのように影響するかを探求します。"},{"sentence":"The field of technopsychology is growing rapidly due to increased technology use.","translation":"テクノロジーの利用増加に伴い、テクノロジー心理学の分野は急速に成長しています。"}],"collocations":["effects of technology","impact of technology","social media","mental health","human behavior"],"synonyms":["cyberpsychology","digital psychology","internet psychology"],"antonyms":[]}],"etymology":{"value":"'Techno-' (technology) + 'psychology'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌteknoʊsaɪˈkɒlədʒi/","syllables":"tech-no-psy-chol-o-gy"},"inflection":{"noun_plural":"Technopsychologies"},"usage_notes":{"explanation":"Technopsychology is an interdisciplinary field that combines technology and psychology. It examines the psychological aspects of human-technology interaction, including the effects of technology on cognition, emotion, behavior, and social relationships.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Technopsychology is only about fixing technical problems.","correct":"✓ Technopsychology is about understanding the psychological impact of technology.","note":"Technopsychology is not just about fixing technical issues; it focuses on the psychological and behavioral aspects of technology use."}],"priority":"★★☆"},"related_words":{"derivatives":["Technopsychological (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Technopsychology is a specialized term referring to the study of the psychological impacts of technology. It is used in academic and research contexts to discuss how technology affects human behavior, mental processes, and social interactions. Understanding this term requires familiarity with both technology and psychology concepts."},"example_sentences":[{"sentence":"The conference focused on the latest research in technopsychology.","translation":"その会議はテクノロジー心理学の最新の研究に焦点を当てました。","type":"general","meaning_category":"definition"},{"sentence":"Technopsychology helps us understand the impact of virtual reality on the human mind.","translation":"テクノロジー心理学は、バーチャルリアリティが人間の心に与える影響を理解するのに役立ちます。","type":"application","meaning_category":"application"}]}