{"word":"Caseworm","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"筒巣を持つ水生昆虫の幼虫","english_definition":"The aquatic larva of any of various insects that lives in a protective case made of silk and debris.","examples":[{"sentence":"The caseworm crawled along the bottom of the stream.","translation":"トビケラの幼虫が小川の底を這っていた。"}],"collocations":["caseworm larva","aquatic caseworm"],"synonyms":["caddisfly larva"],"antonyms":[]},{"part_of_speech":"noun","definition":"特定の蛾の幼虫","english_definition":"The larva of certain moths that create a protective case around themselves.","examples":[{"sentence":"Caseworms can damage fabrics and stored products.","translation":"イガの幼虫は、布地や貯蔵品に損害を与えることがある。"}],"collocations":["clothes caseworm"],"synonyms":["clothes moth larva"],"antonyms":[]}],"etymology":{"value":"The term 'caseworm' is derived from the fact that these larvae live inside a protective case that they construct themselves.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkeɪsˌwɜːrm/","syllables":"case-worm"},"inflection":{"noun_plural":"caseworms"},"usage_notes":{"explanation":"The term 'caseworm' generally refers to the larvae of caddisflies (Trichoptera) or certain moths (especially clothes moths). These larvae are characterized by their habit of constructing and living within a protective case made from silk, plant debris, sand, or other materials found in their environment. The case provides camouflage and protection from predators.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I found a caseworm in my garden, eating my vegetables.","correct":"✓ I found a caterpillar in my garden, eating my vegetables.","note":"Caseworms are typically aquatic or found indoors (clothes moths), not in gardens eating vegetables. Caterpillars are more likely to be found eating garden plants."}],"priority":"★☆☆"},"related_words":{"derivatives":["casebearer"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Caseworm' is a specialized term referring to insect larvae that live in protective cases. Understanding this term requires some knowledge of entomology or natural history. It is not a commonly used word in everyday conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The biology student collected several caseworms from the local pond.","translation":"生物学の学生は、地元の池から数匹のトビケラの幼虫を採取した。","type":"noun","meaning_category":"aquatic insect larva"},{"sentence":"The homeowner discovered caseworms damaging their woolen clothes.","translation":"家の所有者は、イガの幼虫がウールの服を傷つけているのを発見した。","type":"noun","meaning_category":"clothes moth larva"}]}