{"word":"unknownness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"未知であること、未知の状態、未知の性質","english_definition":"the state or quality of being unknown; the condition of not being known or recognized.","examples":[{"sentence":"The unknownness of the future can be both exciting and frightening.","translation":"未来の未知性は、ワクワクすると同時に恐ろしいものでもある。"},{"sentence":"He preferred the safety of routine to the unknownness of change.","translation":"彼は変化の未知性よりも、日常の安全性を好んだ。"},{"sentence":"The project was abandoned due to the unknownness of the potential risks.","translation":"そのプロジェクトは、潜在的なリスクの未知性のため中止された。"}],"collocations":["face the unknownness (未知に立ち向かう)","embrace the unknownness (未知を受け入れる)","explore the unknownness (未知を探求する)","fear of unknownness (未知への恐怖)","the vast unknownness (広大な未知)"],"synonyms":["obscurity","mystery","uncertainty","unfamiliarity","inscrutability"],"antonyms":["familiarity","certainty","knowledge","awareness"]},{"part_of_speech":"noun","definition":"無名であること、無名の状態","english_definition":"the state of being without fame or recognition.","examples":[{"sentence":"She emerged from unknownness to become a celebrated author.","translation":"彼女は無名の状態から、称賛される作家になった。"},{"sentence":"He spent years toiling in relative unknownness.","translation":"彼は何年も比較的無名の状態で苦労した。"},{"sentence":"The band remained in unknownness despite their talent.","translation":"そのバンドは才能があるにもかかわらず、無名のままだった。"}],"collocations":["rise from unknownness (無名から立ち上がる)","fall into unknownness (無名に陥る)","escape unknownness (無名を脱する)","plunge into unknownness (無名に突入する)"],"synonyms":["anonymity","obscurity","unrecognized","uncelebrated","unnoticed"],"antonyms":["fame","recognition","celebrity","notoriety"]}],"etymology":{"value":"\"Unknown\" + \"-ness\".  The suffix \"-ness\" is added to adjectives to form nouns that denote a state, condition, or quality. Therefore, \"unknownness\" is the state or quality of being unknown.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈnoʊn.nəs/","syllables":"un-known-ness"},"inflection":{"noun_plural":"unknownnesses (rarely used)"},"usage_notes":{"explanation":"\"Unknownness\" is a noun that refers to the state or quality of being unknown. It is often used to describe situations or concepts where there is a lack of knowledge or certainty. While grammatically correct, it is not as commonly used as synonyms like \"uncertainty,\" \"obscurity,\" or \"mystery.\" The choice to use \"unknownness\" often depends on the specific nuance the writer or speaker wishes to convey.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unknownness is very scary.","correct":"✓ The unknown is very scary. / ✓ The uncertainty is very scary.","note":"While \"unknownness\" is a valid word, \"the unknown\" (without the \"-ness\") is more commonly used to refer to something that is not known.  \"Uncertainty\" is also a more frequent and natural-sounding alternative."},{"incorrect":"✗ He suffered from unknownness.","correct":"✓ He suffered from obscurity. / ✓ He suffered from being unknown.","note":"In the context of lacking fame or recognition, \"obscurity\" or \"being unknown\" are more idiomatic choices than \"unknownness.\""}],"priority":"★★☆"},"related_words":{"derivatives":["unknown (adjective, noun)","knownness (noun - rare, the state of being known)"],"synonyms":["uncertainty","obscurity","mystery","unfamiliarity","anonymity"],"antonyms":["certainty","familiarity","knowledge","recognition","fame"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unknownness\" is a relatively uncommon noun that describes the state of being unknown or the quality of not being known. It is formed by adding the suffix \"-ness\" to the adjective \"unknown.\" While grammatically correct, it is often replaced by more common synonyms such as \"uncertainty\", \"obscurity\", or \"mystery\", depending on the specific context. It is used in formal writing or when a specific emphasis on the state of being unknown is desired."},"example_sentences":[{"sentence":"The expedition set out to explore the vast unknownness of the Amazon rainforest.","translation":"その探検隊は、アマゾンの熱帯雨林の広大な未知を探検するために出発した。","type":"noun","meaning_category":"未知の状態"},{"sentence":"The company hesitated to invest due to the unknownness surrounding the new technology.","translation":"その会社は、新しい技術を取り巻く未知性のため、投資をためらった。","type":"noun","meaning_category":"未知の性質"},{"sentence":"The artist enjoyed the freedom of working in relative unknownness before achieving widespread recognition.","translation":"そのアーティストは、広く認知される前に、比較的無名の状態で制作する自由を楽しんでいた。","type":"noun","meaning_category":"無名の状態"}]}