{"word":"growth-modeling","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"成長モデリング（統計学における、時間経過に伴う個々の成長または変化のパターンを分析するための統計手法）","english_definition":"A statistical technique for analyzing patterns of individual growth or change over time.","examples":[{"sentence":"Growth modeling is used to study developmental trajectories in children.","translation":"成長モデリングは、子供の発達軌跡を研究するために使用されます。"},{"sentence":"Latent growth modeling allows researchers to examine individual differences in growth rates.","translation":"潜在成長モデリングにより、研究者は成長率の個体差を調べることができます。"},{"sentence":"The study used growth modeling to analyze changes in cognitive function over adulthood.","translation":"この研究では、成人期における認知機能の変化を分析するために成長モデリングを使用しました。"}],"collocations":["latent growth modeling","growth curve modeling","multilevel growth modeling","apply growth modeling","conduct growth modeling","growth modeling analysis"],"synonyms":["longitudinal data analysis","trajectory analysis","developmental modeling"],"antonyms":[]}],"etymology":{"value":"「growth」は成長を意味し、「modeling」はモデル化、つまり数学的または統計的表現を作成することを意味します。この用語は、時間経過に伴う成長または変化のパターンをモデル化する統計手法を指すために組み合わされています。","priority":"☆☆☆"},"pronunciation":{"ipa":"/ɡroʊθ ˈmɑdəlɪŋ/","syllables":"growth-mod-el-ing"},"inflection":{"notes":"名詞（不可算）"},"usage_notes":{"explanation":"成長モデリングは、縦断的データ（同じ個人またはグループから時間経過とともに収集されたデータ）を分析するために使用される統計手法の総称です。この手法は、個々の成長軌跡を特徴づけ、これらの軌跡に影響を与える要因を特定し、時間経過に伴う変化を予測するために使用されます。潜在成長モデリング（LGM）は、成長モデリングの一般的なアプローチであり、個々の成長軌跡を要約する潜在変数を使用します。","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Growth modeling are used in many fields.","correct":"✓ Growth modeling is used in many fields.","note":"成長モデリングは集合名詞として扱われるため、単数形の動詞を使用します。"},{"incorrect":"✗ Growth modeling can only be used with children.","correct":"✓ Growth modeling can be used with individuals of any age.","note":"成長モデリングは、子供だけでなく、あらゆる年齢層の個人の成長と変化を分析するために使用できます。"},{"incorrect":"✗ Growth modeling provides causal relationships.","correct":"✓ Growth modeling can identify associations, but does not necessarily establish causal relationships.","note":"成長モデリングは関連性を特定できますが、必ずしも因果関係を確立するわけではありません。"}],"priority":"☆☆☆"},"related_words":{"derivatives":["growth curve","latent growth curve","growth mixture modeling"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"「**Growth modeling**」とは、統計学で使われる専門的な言葉で、時間とともに人がどのように成長したり変化したりするかを分析する方法のことです。たとえば、子供の学力や、年を取るにつれて認知機能がどう変わるかを調べるときに使われます。この方法では、データを集めて、成長のパターンを見つけたり、成長に影響を与えるものを特定したりします。潜在成長モデリングという、個人の成長を要約する特別な方法もあります。統計学や心理学の研究でよく出てくる言葉なので、研究論文を読むときなどに知っておくと役立ちます。"},"example_sentences":[{"sentence":"The researchers employed **growth modeling** to assess the effectiveness of the intervention.","translation":"研究者たちは、介入の効果を評価するために成長モデリングを採用しました。","type":"noun","meaning_category":"統計手法"},{"sentence":"**Growth modeling** revealed significant individual differences in the rate of cognitive decline.","translation":"成長モデリングにより、認知機能の低下率に大きな個体差があることが明らかになりました。","type":"noun","meaning_category":"統計手法"},{"sentence":"**Growth modeling** is a powerful tool for understanding developmental processes.","translation":"成長モデリングは、発達過程を理解するための強力なツールです。","type":"noun","meaning_category":"統計手法"}]}