{"word":"litigious","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"訴訟好きな、訴訟を起こしやすい","english_definition":"unduly prone to engage in lawsuits.","examples":[{"sentence":"We live in an increasingly litigious society.","translation":"私たちはますます訴訟好きな社会に住んでいる。"},{"sentence":"He is a litigious individual who sues anyone for the slightest offense.","translation":"彼は些細なことで誰でも訴える訴訟好きな人だ。"},{"sentence":"The company is trying to avoid becoming involved in any litigious matters.","translation":"その会社は訴訟問題に関わるのを避けようとしている。"}],"collocations":["a litigious society (訴訟好きな社会)","a litigious person (訴訟好きな人)","litigious disputes (訴訟紛争)","litigious issues (訴訟問題)","litigious environment (訴訟環境)"],"synonyms":["quarrelsome","contentious","disputatious","argumentative","combative","belligerent"],"antonyms":["peaceable","amicable","conciliatory","non-litigious","forbearing"]}],"etymology":{"value":"Late Middle English: from Old French litigieux, from Latin litigiosus, from litigium ‘lawsuit’, from litigare ‘to sue’ (from lis, lit- ‘lawsuit’ + agere ‘do, act’).","priority":"★★★"},"pronunciation":{"ipa":"/lɪˈtɪdʒəs/","syllables":"li-ti-gious"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more litigious' and 'most litigious', respectively."},"usage_notes":{"explanation":"'Litigious' describes someone or something that is excessively prone to bringing lawsuits. It often carries a negative connotation, suggesting that the person or entity is overly eager to resort to legal action rather than attempting to resolve disputes through other means. The term is commonly used to describe individuals, companies, or even entire societies.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a very litigious lawyer, so he always wins cases.","correct":"✓ He is a very good lawyer, so he always wins cases.","note":"'Litigious' describes a tendency to file lawsuits, not necessarily competence in winning them. A good lawyer may or may not be litigious."},{"incorrect":"✗ The situation was litigious, so we decided to ignore it.","correct":"✓ The situation was contentious, so we decided to ignore it. / ✓ The situation was litigious, so we sought legal advice.","note":"If a situation is 'litigious', it means it's likely to result in a lawsuit, not that it should be ignored. It's more appropriate to seek legal advice."}],"priority":"★★☆"},"related_words":{"derivatives":["litigiousness (noun: the quality of being litigious)","litigate (verb: to engage in legal proceedings)","litigation (noun: the process of taking legal action)","litigator (noun: a lawyer who specializes in litigation)"],"idioms_phrases":["None commonly used with this word."],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Litigious' is a formal word used to describe someone or something that is excessively prone to engaging in lawsuits. It is not a common word in everyday conversation, but it is often used in legal and business contexts. Understanding this word requires a good vocabulary and familiarity with legal terminology."},"example_sentences":[{"sentence":"The company took steps to avoid becoming embroiled in a **litigious** dispute.","translation":"その会社は、訴訟紛争に巻き込まれるのを避けるための措置を講じた。","type":"adjective","meaning_category":"訴訟好きな、訴訟を起こしやすい"},{"sentence":"The rise in medical malpractice claims has made the healthcare industry more **litigious**.","translation":"医療過誤請求の増加により、医療業界はより訴訟を起こしやすい状況になっている。","type":"adjective","meaning_category":"訴訟好きな、訴訟を起こしやすい"},{"sentence":"In a **litigious** society, businesses must be careful to avoid even the appearance of wrongdoing.","translation":"訴訟好きな社会では、企業は不正行為の外観さえ避けるように注意しなければならない。","type":"adjective","meaning_category":"訴訟好きな、訴訟を起こしやすい"}]}