{"word":"PFD","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Personal Flotation Deviceの略)個人用浮揚装置、救命胴衣","english_definition":"(abbreviation for Personal Flotation Device) A piece of equipment designed to keep a person afloat in water; a life jacket or buoyancy aid.","examples":[{"sentence":"Make sure everyone on board has a properly fitted PFD.","translation":"乗船している全員が適切にフィットしたPFDを着用していることを確認してください。"},{"sentence":"Children should always wear a PFD when near water.","translation":"子供は水辺にいるときは常にPFDを着用すべきです。"},{"sentence":"The boater was wearing a PFD when he was rescued.","translation":"救助されたとき、そのボートに乗っていた人はPFDを着用していました。"}],"collocations":["wear a PFD","life jacket","buoyancy aid","properly fitted PFD"],"synonyms":["life jacket","buoyancy aid","life vest"],"antonyms":[]}],"etymology":{"value":"An acronym derived from the initial letters of the words 'Personal Flotation Device'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpiːˌɛfˈdiː/","syllables":"P-F-D (three syllables, pronounced as individual letters)"},"inflection":{"notes":"Plural: PFDs"},"usage_notes":{"explanation":"'PFD' is a technical term often used in boating, water sports, and safety contexts. It is a more general term than 'life jacket,' encompassing various types of flotation devices, including those designed for specific activities like kayaking or waterskiing. While 'life jacket' is commonly understood, 'PFD' is more precise and may be preferred in official or professional communications.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He put on his PFD before driving the car.","correct":"✓ He put on his seatbelt before driving the car.","note":"PFDs are for use in or near water, not for driving. Seatbelts are used in cars."},{"incorrect":"✗ The PFD protected him from the cold.","correct":"✓ The wetsuit protected him from the cold. / ✓ The PFD kept him afloat.","note":"PFDs are designed to provide buoyancy, not warmth. Wetsuits or drysuits provide thermal protection."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["life raft","flotation device","buoy","lifeboat","water safety"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Technical term)","frequency_google_ngram":"Low frequency (relatively specialized term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'PFD' stands for 'Personal Flotation Device.' It's a technical term for a life jacket or buoyancy aid. You'll usually hear it in situations related to boating, water sports, or water safety. While most people understand 'life jacket,' 'PFD' is a more precise term used by professionals. If you're talking about general water safety, 'life jacket' is fine, but in a more formal or technical context, 'PFD' is the better choice."},"example_sentences":[{"sentence":"All passengers are required to wear a PFD while the boat is underway.","translation":"ボート航行中はすべての乗客がPFDを着用する必要があります。","type":"noun","meaning_category":"個人用浮揚装置"},{"sentence":"The instructor demonstrated how to properly fit and adjust a PFD.","translation":"インストラクターは、PFDの適切な装着方法と調整方法を説明しました。","type":"noun","meaning_category":"個人用浮揚装置"},{"sentence":"This PFD is designed for kayaking and provides excellent freedom of movement.","translation":"このPFDはカヤック用に設計されており、優れた運動の自由度を提供します。","type":"noun","meaning_category":"個人用浮揚装置"}]}