{"word":"quasi-probably","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"ほとんどありそうにないが、完全にありえないわけではないこと。","english_definition":"Almost probably; in a way that suggests something is likely but not certain.","examples":[{"sentence":"Quasi-probably, the experiment will succeed, but we should still prepare for failure.","translation":"ほとんどの場合、実験は成功するだろうが、失敗に備えておくべきだ。"},{"sentence":"The team is quasi-probably going to win the championship this year.","translation":"そのチームは今年、ほとんどチャンピオンシップで優勝するだろう。"}],"collocations":["quasi-probably succeed","quasi-probably fail","quasi-probably win","quasi-probably lose"],"synonyms":["almost certainly","likely","presumably","apparently","seemingly"],"antonyms":["improbably","unlikely","certainly","definitely"]}],"etymology":{"value":"The word is formed by combining \"quasi-\" (meaning resembling or having some, but not all, of the qualities of) with \"probably\" (meaning likely to happen or be true).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkweɪzaɪˈprɒbəbli/","syllables":"quasi-prob-a-bly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"\"Quasi-probably\" is used to express a high degree of likelihood, but with a reservation that the outcome is not guaranteed. It suggests a stronger likelihood than \"probably\" alone, but still acknowledges the possibility of an alternative outcome. It is relatively uncommon in everyday speech, but can be found in more formal or technical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The event is quasi-probably cancelled.","correct":"✓ The event is quasi-probably going to be cancelled.","note":"When used with a verb, it's often best to use a future tense or a phrase that indicates likelihood, such as \"going to be.\" "},{"incorrect":"✗ Quasi-probably, he is here.","correct":"✓ Quasi-probably, he will be here.","note":"It's more common to use \"quasi-probably\" with future events or situations rather than present ones."}],"priority":"★★☆"},"related_words":{"derivatives":["quasi (adverb)","probable (adjective)","probability (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Quasi-probably\" is a complex adverb that means something is very likely, but not completely certain. It's used to express a high degree of probability while still acknowledging a small chance of an alternative outcome. It's not a common word and is mostly found in formal or technical writing. It is formed by combining \"quasi-\" which means \"almost\" or \"resembling\" with \"probably.\""},"example_sentences":[{"sentence":"Quasi-probably, the new medicine will improve the patient's condition.","translation":"ほとんどの場合、新しい薬は患者の状態を改善するだろう。","type":"adverb","meaning_category":"Likelihood"},{"sentence":"Quasi-probably, the negotiations will lead to a successful agreement.","translation":"ほとんどの場合、交渉は合意に至るだろう。","type":"adverb","meaning_category":"Likelihood"}]}