{"word":"airgraph","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"航空書簡、エアグラフ","english_definition":"A letter photographed and reduced in size for air transport, then enlarged again at its destination.","examples":[{"sentence":"During World War II, airgraphs were a common way for soldiers to communicate with their families.","translation":"第二次世界大戦中、エアグラフは兵士が家族と連絡を取る一般的な方法でした。"},{"sentence":"She sent an airgraph to her parents from overseas.","translation":"彼女は海外から両親にエアグラフを送った。"}],"collocations":["send an airgraph","receive an airgraph","wartime airgraph"],"synonyms":["V-mail (US equivalent)"],"antonyms":[]}],"etymology":{"value":"Coined during World War II, combining 'air' (referring to airmail) and 'graph' (from photograph).","priority":"★★☆"},"pronunciation":{"ipa":"ˈeərˌɡræf","syllables":"air-graph"},"inflection":{"noun_plural":"airgraphs"},"usage_notes":{"explanation":"Airgraphs were primarily used during World War II to reduce the weight and bulk of mail transported by air. The letters were photographed, reduced to a small size, transported, and then enlarged and printed at the destination. This method allowed for a greater volume of mail to be carried, which was crucial during wartime.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I sent an emailgraph.","correct":"✓ I sent an airgraph.","note":"The term 'emailgraph' is not a valid word. Use 'airgraph' for the historical method of sending photographed letters by airmail."}],"priority":"★☆☆"},"related_words":{"derivatives":["airmail","photograph"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency (Historical term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Airgraph' is a historical term referring to a specific type of correspondence used during World War II. It involves photographing letters to reduce their size for air transport, then enlarging them at the destination. Understanding this term requires knowledge of historical communication methods. It is not commonly used in modern contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"Soldiers relied on airgraphs to maintain contact with loved ones back home.","translation":"兵士たちは、故郷にいる愛する人たちとの連絡を維持するためにエアグラフに頼っていました。","type":"noun","meaning_category":"航空書簡"},{"sentence":"The museum has a collection of airgraphs from the war era.","translation":"博物館には、戦時中のエアグラフのコレクションがあります。","type":"noun","meaning_category":"航空書簡"}]}