{"word":"ethephon","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"エテホン：植物成長調整剤の一種で、植物体内でエチレンを生成し、果実の成熟促進、落葉促進、開花調節などに用いられる","english_definition":"A plant growth regulator that decomposes to ethylene, used to promote fruit ripening, defoliation, and flower induction.","examples":[{"sentence":"Ethephon is used to ripen tomatoes and other fruits.","translation":"エテホンはトマトや他の果物の成熟を促進するために使用されます。"},{"sentence":"The farmer sprayed the cotton plants with ethephon to defoliate them before harvest.","translation":"農家は収穫前に綿の木の葉を落とすためにエテホンを散布しました。"}],"collocations":["ethephon application (エテホンの施用)","ethephon treatment (エテホン処理)","ethephon concentration (エテホン濃度)"],"synonyms":["2-chloroethylphosphonic acid"],"antonyms":[]}],"etymology":{"value":"「ethephon」という名称は、「ethylene」（エチレン）と「phosphonic」（ホスホン酸）に由来する。エテホンは植物体内でエチレンを生成する化合物であるため、この名が付けられた。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈɛθəˌfɒn/","syllables":"eth-e-phon"},"inflection":{"notes":"不可算名詞"},"usage_notes":{"explanation":"エテホンは、植物ホルモンであるエチレンを植物体内で徐々に放出する化合物です。エチレンは植物の成熟、老化、落葉などの生理現象に関与しており、エテホンを施用することでこれらのプロセスを人為的に制御できます。農業分野では、果実の成熟を促進したり、収穫を容易にするために落葉を促進したり、特定の植物の開花を誘導したりするために広く使用されています。使用にあたっては、対象作物や目的に応じて適切な濃度や施用方法を選択する必要があります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Ethephon is a type of fertilizer.","correct":"✓ Ethephon is a type of plant growth regulator.","note":"エテホンは肥料ではなく、植物成長調整剤です。"},{"incorrect":"✗ Ethephon is safe for all plants at any concentration.","correct":"✓ Ethephon should be used according to the instructions, as excessive concentrations can damage plants.","note":"エテホンは適切な濃度で使用する必要があります。高濃度で使用すると植物に害を及ぼす可能性があります。"}],"priority":"★★☆"},"related_words":{"derivatives":["ethylene (エチレン)","plant growth regulator (植物成長調整剤)","defoliant (落葉剤)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な農業分野で使用される語彙。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**ethephon**」は、植物の成長を調整するために使われる化学物質の名前です。特に、果物を早く熟させたり、植物の葉を落としたりする目的で使用されます。これは、植物の中で「エチレン」というガスを発生させることで、植物の自然な成長プロセスを変化させる仕組みです。農業や園芸の専門家が使う言葉で、一般の人が日常的に使うことはほとんどありません。"},"example_sentences":[{"sentence":"The grower used ethephon to ensure uniform ripening of the apples.","translation":"栽培者はリンゴの均一な成熟を確実にするためにエテホンを使用した。","type":"general","meaning_category":"果実の成熟促進"},{"sentence":"Ethephon is often applied to rubber trees to increase latex production.","translation":"エテホンは、ラテックスの生産量を増やすためにゴムの木によく施用される。","type":"general","meaning_category":"ラテックス生産促進"}]}