{"word":"Obelias","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"オベリアス：ヒドロ虫綱花クラゲ目の動物","english_definition":"A genus of hydrozoans in the order Leptothecata (formerly called Hydroida). They are a colonial hydrozoan, with a branching stem that supports many individual polyps.","examples":[{"sentence":"Obelias are commonly found in marine environments.","translation":"オベリアスは一般的に海洋環境で見られます。"},{"sentence":"The life cycle of Obelias includes both polyp and medusa stages.","translation":"オベリアスのライフサイクルには、ポリプとメデューサの両方の段階が含まれます。"}],"collocations":["Obelia colony","Obelia life cycle","Obelia geniculate"],"synonyms":["hydroid","hydrozoan"],"antonyms":[]}],"etymology":{"value":"The name \"Obelia\" is derived from Greek, but the exact etymology is not widely documented. It is likely related to terms referring to small, delicate structures, reflecting the appearance of these hydrozoans.","priority":"★☆☆"},"pronunciation":{"ipa":"/oʊˈbiːliəs/","syllables":"O-be-li-as"},"inflection":{"noun_plural":"Obelias (used both singular and plural)"},"usage_notes":{"explanation":"\"Obelias\" refers to a specific genus of hydrozoans. In scientific contexts, it is important to use the correct taxonomic classification. When discussing multiple species, the plural form remains \"Obelias\" or \"Obelia spp.\"","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Obelia is a type of fish.","correct":"✓ Obelia is a type of hydrozoan.","note":"Obelia are not fish; they are invertebrates belonging to the class Hydrozoa."}],"priority":"★☆☆"},"related_words":{"derivatives":["Obelia geniculata (a common species of Obelia)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Scientific term)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Obelias\" is a scientific term used in the field of marine biology to refer to a specific genus of hydrozoans. Understanding this term requires familiarity with biological classifications and marine ecosystems. It is typically encountered in academic or scientific contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"Scientists are studying the growth patterns of Obelias colonies.","translation":"科学者たちはオベリアスのコロニーの成長パターンを研究しています。","type":"noun","meaning_category":"animal"},{"sentence":"The Obelias exhibit a clear alternation of generations.","translation":"オベリアスは明確な世代交代を示します。","type":"noun","meaning_category":"animal"}]}