{"word":"perversity","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"つむじ曲がり、ひねくれ、強情、邪悪さ、堕落","english_definition":"the quality or state of being perverse; deliberate contrariness or wickedness.","examples":[{"sentence":"He acted out of sheer perversity.","translation":"彼は全くのつむじ曲がりから行動した。"},{"sentence":"The perversity of human nature is often surprising.","translation":"人間の性質のひねくれ具合には驚かされることが多い。"},{"sentence":"She seemed to take a perverse pleasure in causing trouble.","translation":"彼女はトラブルを起こすことにひねくれた喜びを感じているようだった。"},{"sentence":"The perversity of the situation made it difficult to find a solution.","translation":"その状況のひねくれさが解決策を見つけるのを困難にした。"}],"collocations":["sheer perversity (全くのつむじ曲がり)","human perversity (人間のひねくれ)","a streak of perversity (ひねくれた一面)","moral perversity (道徳的堕落)"],"synonyms":["contrariness","obstinacy","stubbornness","waywardness","wickedness","depravity","malice","spitefulness"],"antonyms":["obedience","compliance","docility","goodness","benevolence"]}],"etymology":{"value":"Late Middle English: from Old French perversite, from Latin perversitas, from perversus (see perverse).","priority":"★★☆"},"pronunciation":{"ipa":"/pərˈvɜːrsəti/","syllables":"per-ver-si-ty"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"\"**Perversity**\" refers to the quality of being deliberately contrary or stubbornly doing the opposite of what is expected or desired. It often implies a willful and unreasonable opposition to what is considered normal, right, or beneficial. It can also suggest a degree of moral corruption or wickedness. The term is often used to describe actions or attitudes that are difficult to understand or justify.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed perversity to help others.","correct":"✓ He showed perversity by refusing to help others.","note":"Perversity implies a deliberate act of contrariness, often against what is considered helpful or beneficial. It's not used to describe actions intended to help others."},{"incorrect":"✗ The perversity of the weather made it rain.","correct":"✓ The unpredictability of the weather made it rain.","note":"Perversity implies a deliberate intention, which cannot be attributed to inanimate objects like the weather. Use words like \"unpredictability\" or \"capriciousness\" instead."}],"priority":"★★☆"},"related_words":{"derivatives":["perverse (adjective: つむじ曲がりの、ひねくれた、邪悪な)","perversely (adverb: つむじ曲がりに、ひねくれて、邪悪に)","pervert (verb: 堕落させる、悪用する; noun: 堕落者、変態者)","perversion (noun: 堕落、倒錯、悪用)"],"idioms_phrases":["the perversity of fate (運命のいたずら)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"比較的に低い (Relatively low frequency) - フォーマルな文脈や文学作品でよく使われる。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"**Perversity**\" is a more advanced word that describes the quality of deliberately behaving in a way that is contrary to what is expected or considered reasonable. It often suggests a stubborn or unreasonable opposition to what is normal or beneficial. This word is more commonly found in formal writing and literature when describing complex characters or situations involving moral or ethical challenges. It's important to understand the nuance of deliberate contrariness when using this word.","priority":"★★☆"},"example_sentences":[{"sentence":"The politician's decision was driven by pure **perversity**, defying all logic and reason.","translation":"その政治家の決定は全くのつむじ曲がりから来ており、あらゆる論理と理性に反していた。","type":"noun","meaning_category":"つむじ曲がり"},{"sentence":"There was a certain **perversity** in his refusal to accept help, even when he desperately needed it.","translation":"彼が必死に助けを必要としている時でさえ、助けを受け入れることを拒否することには、ある種のひねくれがあった。","type":"noun","meaning_category":"ひねくれ"},{"sentence":"The **perversity** of the criminal's actions shocked the entire community.","translation":"犯罪者の行動の邪悪さは地域全体を震撼させた。","type":"noun","meaning_category":"邪悪さ"},{"sentence":"It was out of pure **perversity** that she decided to wear a summer dress in the middle of winter.","translation":"彼女が真冬の真っただ中に夏のドレスを着ることにしたのは、全くのつむじ曲がりからだった。","type":"noun","meaning_category":"強情"}]}