{"word":"cross-multiplication","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(数学) 比例式における交差乗法","english_definition":"A mathematical process used to solve equations involving fractions or ratios, where the numerator of one fraction is multiplied by the denominator of the other, and vice versa.","examples":[{"sentence":"We can solve this proportion using cross-multiplication.","translation":"この比例式は交差乗法を使って解くことができます。"},{"sentence":"Cross-multiplication is a quick way to find the unknown value in a proportion.","translation":"交差乗法は比例式における未知の値を素早く見つける方法です。"}],"collocations":["solve by cross-multiplication","apply cross-multiplication","use cross-multiplication"],"synonyms":["ratio and proportion solving","fraction equation solving"],"antonyms":[]}],"etymology":{"value":"The term 'cross-multiplication' comes from the visual representation of multiplying the numerator of one fraction by the denominator of the other, creating a 'cross' shape when written out.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkrɔsˌmʌltɪplɪˈkeɪʃən/","syllables":"cross-mul-ti-pli-ca-tion"},"inflection":{"noun_plural":"cross-multiplications"},"usage_notes":{"explanation":"Cross-multiplication is primarily used to solve proportions (equations where two ratios are equal). It simplifies the equation by eliminating the fractions, making it easier to solve for an unknown variable. It's a fundamental technique in algebra and is particularly useful for solving problems involving ratios, rates, and percentages.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Cross-multiplication is used for adding fractions.","correct":"✓ Cross-multiplication is used for solving proportions (equations with fractions).","note":"Cross-multiplication is for solving equations, not for adding fractions directly. To add fractions, you need a common denominator."},{"incorrect":"✗ Apply cross-multiplication to 1/2 + 1/3.","correct":"✓ Cross-multiplication is applicable to equations like a/b = c/d.","note":"Cross-multiplication is applied to equations where two ratios are equal, not to the addition of fractions."}],"priority":"★★☆"},"related_words":{"derivatives":["cross-multiply (verb)"],"phrasal_verbs":[],"related_terms":["proportion","ratio","equation","numerator","denominator","algebra"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, primarily used in mathematical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Cross-multiplication' is a method used in math to solve equations that have fractions. Imagine you have two fractions that are equal to each other, like a/b = c/d. To use cross-multiplication, you multiply 'a' by 'd' and 'b' by 'c'. This gets rid of the fractions and makes the equation easier to solve. It's mostly used in algebra when you're working with proportions, ratios, or percentages.","priority":"★★☆"},"example_sentences":[{"sentence":"Use cross-multiplication to solve for x in the equation 2/3 = x/6.","translation":"方程式 2/3 = x/6 で x を解くために交差乗法を使用してください。","type":"example","meaning_category":"solving proportions"},{"sentence":"Cross-multiplication is a useful tool for solving problems involving ratios.","translation":"交差乗法は比率に関する問題を解くための便利なツールです。","type":"example","meaning_category":"general use"},{"sentence":"Before applying cross-multiplication, ensure that the equation is a proportion.","translation":"交差乗法を適用する前に、方程式が比例式であることを確認してください。","type":"example","meaning_category":"application condition"}]}