{"word":"leadin","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(ジャーナリズム)リード文、導入部","english_definition":"The introductory section of a news story or other piece of writing, designed to capture the reader's attention.","examples":[{"sentence":"The leadin of the article was very engaging.","translation":"記事のリード文は非常に魅力的だった。"},{"sentence":"A good leadin should summarize the main points of the story.","translation":"優れたリード文は、記事の要点をまとめるべきだ。"}],"collocations":["strong leadin","weak leadin","effective leadin","write a leadin"],"synonyms":["introduction","opening","preamble","lead"],"antonyms":["conclusion","ending","epilogue"]},{"part_of_speech":"noun","definition":"(印刷)行間、行送り","english_definition":"The amount of vertical space between lines of text in printing or typesetting.","examples":[{"sentence":"The leadin was too tight, making the text difficult to read.","translation":"行間が狭すぎて、テキストが読みにくかった。"},{"sentence":"Increasing the leadin can improve the readability of a document.","translation":"行間を広げることで、ドキュメントの読みやすさを向上させることができる。"}],"collocations":["tight leadin","loose leadin","adjust leadin","increase leadin","decrease leadin"],"synonyms":["line spacing","interlineation"],"antonyms":[]}],"etymology":{"value":"Derived from 'lead' (the metal) used in typesetting to create space between lines of text.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈliːdɪn/","syllables":"lead-in"},"inflection":{"noun_plural":"leadins"},"usage_notes":{"explanation":"'Leadin' has two main meanings. In journalism, it refers to the opening paragraph or sentences of an article, designed to grab the reader's attention and summarize the key points. In typography and printing, it refers to the vertical space between lines of text, also known as line spacing. The context usually makes it clear which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The leadin was too long, it lost my interest.","correct":"✓ The leadin was too long; it lost my interest. / ✓ The leadin was too long and lost my interest.","note":"When connecting two independent clauses, use a semicolon or a conjunction like 'and' after 'leadin'."},{"incorrect":"✗ The leadin of the book was boring.","correct":"✓ The introduction of the book was boring.","note":"For books, 'introduction' is more common than 'leadin'."}],"priority":"★☆☆"},"related_words":{"derivatives":["lead (verb, noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Leadin' is a technical term used in journalism and printing. In journalism, it refers to the introductory part of a news story. In printing, it refers to the space between lines of text. It's not a common word in everyday conversation."},"example_sentences":[{"sentence":"The editor rewrote the leadin to make it more compelling.","translation":"編集者はリード文をより魅力的にするために書き直した。","type":"noun","meaning_category":"ジャーナリズム"},{"sentence":"Proper leadin is essential for good typography.","translation":"適切な行間は、優れたタイポグラフィに不可欠である。","type":"noun","meaning_category":"印刷"}]}