{"word":"waterdog","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(米国方言) イモリの幼生、特にタイガーサラマンダーの幼生","english_definition":"(US dialect) The aquatic larva of a salamander, especially that of the tiger salamander.","examples":[{"sentence":"The children found a waterdog in the creek.","translation":"子供たちは小川でウォータードッグを見つけた。"},{"sentence":"Waterdogs are often used as bait for fishing.","translation":"ウォータードッグはしばしば釣りの餌として使われる。"}],"collocations":["catch a waterdog (ウォータードッグを捕まえる)","use a waterdog as bait (ウォータードッグを餌として使う)"],"synonyms":["mudpuppy (ネクトルス)","axolotl (メキシコサンショウウオ)","salamander larva (サンショウウオの幼生)"],"antonyms":[]},{"part_of_speech":"noun","definition":"(廃語) 水泳が得意な人、水夫","english_definition":"(obsolete) A good swimmer; a sailor.","examples":[{"sentence":"He was known as a waterdog for his ability to swim long distances.","translation":"彼は長距離を泳ぐ能力からウォータードッグとして知られていた。"}],"collocations":[],"synonyms":["swimmer","sailor"],"antonyms":[]}],"etymology":{"value":"'Water' + 'dog'.  The origin likely stems from the appearance or behavior of the salamander larva, perhaps resembling a small, aquatic animal. The obsolete meaning referring to a swimmer probably arose from the analogy of a dog's natural swimming ability.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɔːtərdɔːɡ/","syllables":"wa-ter-dog"},"inflection":{"noun_plural":"waterdogs"},"usage_notes":{"explanation":"The term \"waterdog\" is primarily used in the United States, particularly in certain regional dialects. It refers specifically to the larval stage of certain salamanders that retain their gills and remain aquatic throughout their lives, or until they metamorphose. The obsolete meaning is rarely encountered.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a waterdog swimming in the ocean.","correct":"✓ I saw a waterdog swimming in the creek.","note":"Waterdogs are freshwater creatures, so they would be found in creeks, ponds, or lakes, not the ocean."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["salamander","larva","amphibian"]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word \"waterdog\" has two meanings, one of which is obsolete. The primary modern meaning refers to the larval stage of certain salamanders, particularly the tiger salamander, found in freshwater habitats in the United States. It is a regional term and not widely known outside of specific areas. The older meaning referred to a skilled swimmer or sailor, but this usage is now rare."},"example_sentences":[{"sentence":"The biology class studied the anatomy of the **waterdog**.","translation":"生物学の授業でウォータードッグの解剖学を学んだ。","type":"noun","meaning_category":"イモリの幼生"},{"sentence":"(Historical) The old **waterdog** knew every current in the harbor.","translation":"(歴史的) その老練な水夫は港のすべての潮流を知っていた。","type":"noun","meaning_category":"水泳が得意な人、水夫"}]}