{"word":"Acosmist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"宇宙非存在論者、宇宙は存在しないと信じる人","english_definition":"A person who believes in acosmism, the doctrine that denies the reality of the universe.","examples":[{"sentence":"The acosmist argued that all perceived reality is merely illusion.","translation":"その宇宙非存在論者は、知覚されるすべての現実は単なる幻想であると主張した。"}],"collocations":["pure acosmist","philosophical acosmist"],"synonyms":["nihilist","illusionist","non-realist"],"antonyms":["realist","cosmologist","creationist"]}],"etymology":{"value":"From 'a-' (meaning 'not' or 'without') + 'cosm' (from Greek 'kosmos' meaning 'world' or 'universe') + '-ist' (denoting a believer in a doctrine).","priority":"★★☆"},"pronunciation":{"ipa":"/eɪˈkɒzmɪst/","syllables":"A-cos-mist"},"inflection":{"noun_plural":"Acosmists"},"usage_notes":{"explanation":"'Acosmist' refers specifically to someone who adheres to acosmism, a philosophical or religious belief system. It is a relatively rare term, primarily used in philosophical or theological contexts. It is often associated with certain interpretations of Eastern religions or idealistic philosophies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was an acosmist because he liked space.","correct":"✓ He was an acosmist because he believed the universe was not real.","note":"Acosmism is not about liking space, but about believing the universe is not real."}],"priority":"★☆☆"},"related_words":{"derivatives":["acosmism (noun: the belief that the universe is not real)"],"related_concepts":["nihilism","solipsism","idealism","non-dualism"]},"level_frequency":{"frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Acosmist' is a highly specialized term used in philosophy and theology. It refers to someone who believes that the universe is not real, which is a concept that requires a strong understanding of abstract thought and philosophical concepts. This term is not commonly used in everyday language."},"example_sentences":[{"sentence":"As an acosmist, she rejected the notion of a material world.","translation":"宇宙非存在論者として、彼女は物質世界の概念を拒否した。","type":"noun","meaning_category":"宇宙非存在論者"},{"sentence":"The lecture explored the viewpoints of various acosmists throughout history.","translation":"その講義では、歴史上の様々な宇宙非存在論者の見解を探求した。","type":"noun","meaning_category":"宇宙非存在論者"}]}