{"word":"Capitella","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A genus of small, segmented marine worms in the family Capitellidae.","english_definition":"A genus of small, segmented marine worms in the family Capitellidae, known for their ability to thrive in polluted environments.","examples":[{"sentence":"Capitella are often used as indicator species for pollution.","translation":"カピテラは汚染の指標種としてよく使われます。"}],"collocations":["Capitella capitata (代表的な種)","indicator species (指標種)","marine worms (海洋性環形動物)"],"synonyms":["polychaete worm","segmented worm"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'capitellum', meaning 'small head' or 'capital', referring to the shape of the anterior end of the worm.","priority":"★★★"},"pronunciation":{"ipa":"/ˌkæpɪˈtɛlə/","syllables":"ca-pi-tel-la"},"inflection":{"noun_plural":"Capitella (often used as a collective noun)"},"usage_notes":{"explanation":"'Capitella' refers to a specific genus of marine worms. It is often used in scientific contexts, particularly in studies related to marine biology, ecology, and pollution. The worms are known for their opportunistic nature and ability to rapidly colonize disturbed or polluted areas.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a capitella on the beach, it was very big.","correct":"✓ I saw a Capitella worm on the beach, it was very small.","note":"Capitella worms are generally small, so describing one as 'very big' is likely incorrect. Also, clarifying that it is a 'Capitella worm' is helpful for non-experts."}],"priority":"★☆☆"},"related_words":{"derivatives":["Capitellidae (family)","polychaete (class)","annelid (phylum)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Scientific vocabulary)","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Capitella' is a scientific term used in marine biology and ecology. Understanding its meaning requires familiarity with biological classification and ecological concepts. The term is primarily encountered in scientific literature and specialized contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The abundance of Capitella in the sediment indicated high levels of organic pollution.","translation":"堆積物中のカピテラの豊富さは、高レベルの有機汚染を示していた。","type":"noun","meaning_category":"Genus of marine worms"},{"sentence":"Researchers are studying the genetic diversity of Capitella populations in different coastal regions.","translation":"研究者たちは、異なる沿岸地域におけるカピテラの個体群の遺伝的多様性を研究している。","type":"noun","meaning_category":"Genus of marine worms"}]}