{"word":"apen-","priority":"N/A","meanings":[{"part_of_speech":"prefix","definition":"Indicates a state of being deceived, fooled, or tricked.","english_definition":"A prefix used to indicate a state of being deceived, fooled, or tricked. It is often used humorously or ironically.","examples":[{"sentence":"He was apen-silly to believe such a ridiculous story.","translation":"彼はそんな馬鹿げた話を信じるなんて、騙されて間抜けだった。"},{"sentence":"Don't be apen-wise; you don't know everything.","translation":"賢ぶるな。君は何もかも知っているわけじゃない。"}],"collocations":["apen-silly","apen-fool","apen-wise"],"synonyms":["deceived","fooled","tricked"],"antonyms":["wise","smart","informed"]}],"etymology":{"value":"This prefix is a humorous or ironic alteration of 'upon', suggesting someone is 'upon' a state of foolishness or deception. It is not a standard or widely recognized prefix in formal English.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌeɪpən-/","syllables":"a-pen"},"inflection":{"notes":"It's a prefix, so it's attached to the beginning of a word."},"usage_notes":{"explanation":"The prefix 'apen-' is non-standard and primarily used in informal or humorous contexts. It suggests that someone is acting in a way that is foolish or as if they have been tricked. It's not commonly found in formal writing or speech.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She was apen-happy.","correct":"✓ She was apen-silly.","note":"The prefix 'apen-' is usually combined with words that describe a state of foolishness or deception, not general happiness."},{"incorrect":"✗ Apen is a real prefix.","correct":"✓ Apen is not a real prefix.","note":"'Apen-' is a non-standard, humorous prefix, not a recognized part of formal English vocabulary."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - not a standard prefix.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The prefix 'apen-' is a non-standard, humorous construction used to imply that someone is acting foolishly or has been deceived. Its usage is rare and primarily confined to informal contexts. Understanding it requires a grasp of irony and colloquial language. It is not suitable for formal communication."},"example_sentences":[{"sentence":"He was apen-daft to think he could win the lottery.","translation":"彼は宝くじに当たるなんて考えるなんて、騙されて馬鹿だった。","type":"prefix usage","meaning_category":"deceived"},{"sentence":"She acted apen-innocent, but we knew she was involved.","translation":"彼女は騙されたかのように無邪気に振る舞ったが、彼女が関わっていることはわかっていた。","type":"prefix usage","meaning_category":"deceived"}]}