{"word":"stramonium","priority":"low","meanings":[{"part_of_speech":"noun","definition":"チョウセンアサガオ","english_definition":"A poisonous plant of the nightshade family, Datura stramonium, with white or purple trumpet-shaped flowers and spiny seed capsules.","examples":[{"sentence":"Stramonium is known for its hallucinogenic properties.","translation":"チョウセンアサガオは幻覚作用があることで知られています。"},{"sentence":"The leaves of stramonium have been used in traditional medicine.","translation":"チョウセンアサガオの葉は伝統医学で使用されてきました。"}],"collocations":["Datura stramonium","stramonium leaves","stramonium poisoning"],"synonyms":["jimsonweed","thorn apple","devil's snare","locoweed"],"antonyms":[]}],"etymology":{"value":"Derived from the New Latin name of the plant, which is believed to be a corruption of the German word 'Stramen' (meaning straw) and 'Manikon' (meaning madness), referring to the plant's effects.","priority":"medium"},"pronunciation":{"ipa":"/strəˈmoʊniəm/","syllables":"stra-mo-ni-um"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Stramonium refers specifically to the plant Datura stramonium. It is important to note its toxicity.","priority":"high"},"common_mistakes":{"examples":[{"incorrect":"Stramonium is a safe herb to consume.","correct":"Stramonium is a poisonous plant and should not be consumed.","note":"Stramonium is highly toxic."}],"priority":"high"},"related_words":{"derivatives":["Datura"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"NA","frequency_google_ngram":"very low","priority":"low"},"readability_explanation":{"level":"C2","text":"'Stramonium' is a technical term referring to a specific plant species, Datura stramonium. It is not commonly used outside of botanical or medical contexts. Understanding requires familiarity with scientific nomenclature and plant toxicology."},"example_sentences":[{"sentence":"The alkaloid content of stramonium varies depending on the growing conditions.","translation":"チョウセンアサガオのアルカロイド含有量は、生育条件によって異なります。","type":"noun","meaning_category":"plant"},{"sentence":"Symptoms of stramonium poisoning include dilated pupils and delirium.","translation":"チョウセンアサガオ中毒の症状には、瞳孔散大やせん妄などがあります。","type":"noun","meaning_category":"toxicity"}]}