{"word":"transamination","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"アミノ基転移反応、トランスアミネーション","english_definition":"A chemical reaction between an amino acid and a keto acid in which the amino group is transferred to the keto acid.","examples":[{"sentence":"Transamination is a crucial step in amino acid metabolism.","translation":"アミノ基転移反応は、アミノ酸代謝における重要なステップです。"},{"sentence":"The transamination reaction is catalyzed by transaminases.","translation":"アミノ基転移反応は、トランスアミナーゼによって触媒されます。"}],"collocations":["transamination reaction","reverse transamination"],"synonyms":["amino group transfer"],"antonyms":[]}],"etymology":{"value":"trans- (移転) + amination (アミノ化)","priority":"★★★"},"pronunciation":{"ipa":"/trænzˌæmɪˈneɪʃən/","syllables":"trans-am-i-na-tion"},"inflection":{"noun_plural":"transaminations"},"usage_notes":{"explanation":"Transamination is a biochemical process that involves the transfer of an amino group from an amino acid to a keto acid. This process is essential for the synthesis and degradation of amino acids.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★★★"},"related_words":{"derivatives":["transaminase"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"Transamination is a biochemical term referring to the transfer of an amino group from one molecule to another, particularly from an amino acid to a keto acid. It's a key process in amino acid metabolism, allowing cells to synthesize and break down amino acids as needed. This term is typically encountered in advanced biology or biochemistry contexts."},"example_sentences":[{"sentence":"During transamination, an amino group is transferred from glutamate to oxaloacetate.","translation":"アミノ基転移反応中、アミノ基はグルタミン酸からオキサロ酢酸へ転移されます。","type":"general","meaning_category":"biochemistry"},{"sentence":"Transamination reactions are reversible and play a role in both amino acid synthesis and degradation.","translation":"アミノ基転移反応は可逆的であり、アミノ酸の合成と分解の両方に関与しています。","type":"general","meaning_category":"biochemistry"}]}