{"word":"crankery","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"奇行、偏屈、奇矯な言動、またはそのような性質","english_definition":"eccentric or strange behavior, ideas, or beliefs; the state or quality of being a crank.","examples":[{"sentence":"His crankery made him an outcast in the community.","translation":"彼の奇行が原因で、彼は地域社会でつまはじきにされた。"},{"sentence":"The old man's crankery was tolerated because he was harmless.","translation":"その老人の偏屈さは、無害だったので大目に見られていた。"},{"sentence":"The book explores the crankery of various historical figures.","translation":"その本は、さまざまな歴史上の人物の奇矯な言動を探求している。"}],"collocations":["display crankery (奇行を見せる)","eccentric crankery (奇異な偏屈さ)","harmless crankery (無害な奇行)","old age crankery (老齢による奇行)"],"synonyms":["eccentricity","idiosyncrasy","oddity","peculiarity","whimsy","quirkiness","contrariness"],"antonyms":["normality","conformity","conventionality"]},{"part_of_speech":"noun","definition":"奇妙なまたは誤った考えや理論の集合","english_definition":"a set of strange or misguided ideas or theories.","examples":[{"sentence":"His political views were dismissed as crankery.","translation":"彼の政治的見解は奇妙な考えとして退けられた。"},{"sentence":"The website is full of conspiracy theories and other crankery.","translation":"そのウェブサイトは、陰謀論やその他の奇妙な理論でいっぱいだ。"},{"sentence":"She debunked the crankery surrounding the supposed health benefits of the product.","translation":"彼女は、その製品の健康上の利点とされるものを取り巻く誤った考えを暴いた。"}],"collocations":["pseudoscience crankery (疑似科学的な奇説)","conspiracy theory crankery (陰謀論的な奇説)","political crankery (政治的な奇説)","internet crankery (インターネット上の奇説)"],"synonyms":["nonsense","rubbish","balderdash","hogwash","claptrap","absurdity","fallacy"],"antonyms":["reason","logic","sense","truth"]}],"etymology":{"value":"'Crank' + '-ery'. 'Crank' originally meant 'sickly' or 'weak', then came to mean 'eccentric' or 'obsessed'. The suffix '-ery' denotes a quality, state, place, or collection.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkræŋkəri/","syllables":"cran-ker-y"},"inflection":{"noun_plural":"crankeries"},"usage_notes":{"explanation":"'Crankery' refers to behavior or ideas that are seen as strange, eccentric, or misguided. It often implies a stubborn adherence to these unusual beliefs or behaviors, even in the face of evidence or social disapproval. The term can be used in a lighthearted or dismissive way, but it can also carry a negative connotation, suggesting that the person exhibiting 'crankery' is out of touch with reality or reason.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed much crankery in his work.","correct":"✓ He showed much crankiness in his work.","note":"'Crankiness' can refer to general irritability, while 'crankery' specifically refers to eccentric behaviors or ideas."},{"incorrect":"✗ The crankery was very happy.","correct":"✓ The crank was very happy.","note":"'Crankery' is a state or quality, not a person. A person exhibiting crankery is a 'crank'."}],"priority":"★☆☆"},"related_words":{"derivatives":["crank (noun, adjective)","cranky (adjective)","crankily (adverb)","crankiness (noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Crankery' is a relatively uncommon word that describes eccentric or strange behavior, ideas, or beliefs. It is often used to dismiss or criticize someone's views as being misguided or out of touch with reality. The word implies a stubborn adherence to these unusual beliefs or behaviors, even in the face of evidence or social disapproval. Because of its nuanced meaning and relatively low frequency, it is more likely to be encountered in advanced texts or discussions.","priority":"★☆☆"},"example_sentences":[{"sentence":"The professor's lectures were filled with historical facts and bizarre crankery.","translation":"その教授の講義は、歴史的事実と奇妙な奇説で満たされていた。","type":"noun","meaning_category":"奇妙な考えや理論の集合"},{"sentence":"His crankery made him an easy target for ridicule.","translation":"彼の奇行は、彼を嘲笑の的としやすくした。","type":"noun","meaning_category":"奇行、偏屈、奇矯な言動"}]}