{"word":"toponymous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"地名に由来する、地名にちなんで名付けられた","english_definition":"named after a place; relating to a toponym (a place name)","examples":[{"sentence":"The toponymous saint of the town is Saint Michael.","translation":"その町の地名に由来する聖人は聖ミカエルです。"},{"sentence":"Many toponymous surnames originated from people migrating from a particular place.","translation":"多くの地名に由来する姓は、特定の場所から移住してきた人々から生まれた。"}],"collocations":["toponymous surname","toponymous saint","toponymous adjective"],"synonyms":["geographical","locational","place-related"],"antonyms":[],"notes":"The term is often used in the context of surnames, saints, or other things named after a place."}],"etymology":{"value":"From the combination of 'toponym' (a place name) and '-ous' (a suffix indicating possession or relation).","priority":"★★★"},"pronunciation":{"ipa":"/tɒˈpɒnɪməs/","syllables":"to-pon-y-mous"},"inflection":{"notes":"Since it is an adjective, it can have comparative and superlative forms, although they are not commonly used: more toponymous, most toponymous."},"usage_notes":{"explanation":"'Toponymous' is used to describe something that derives its name or origin from a place name. It is relatively uncommon in everyday language but is used in academic fields such as linguistics, geography, and history.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The city is toponymous.","correct":"✓ The city has a toponymous name. / ✓ The city's name is toponymous.","note":"The adjective 'toponymous' describes the name, not the place itself. You would say the city *has* a toponymous name, or the city's *name* is toponymous."}],"priority":"★★☆"},"related_words":{"derivatives":["toponym (名詞: 地名)","toponymy (名詞: 地名学)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (専門的な文脈で使用される)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Toponymous' is a specialized term used to describe something that is named after a place. It is most often encountered in academic contexts, such as when discussing the origins of surnames or the naming conventions of towns and cities. While not a common word, understanding it can be helpful in fields like linguistics, geography, and history, where place names and their origins are important. The word is formed from 'toponym,' which means place name, and the suffix '-ous,' which indicates a quality or characteristic. Thus, 'toponymous' means 'having the quality of being named after a place.'"},"example_sentences":[{"sentence":"The toponymous surname 'Lincoln' suggests that the family originated from the city of Lincoln.","translation":"地名に由来する姓「リンカーン」は、その家族がリンカーン市を起源とすることを示唆している。","type":"adjective","meaning_category":"地名に由来する"},{"sentence":"Many European towns have toponymous festivals celebrating their patron saints.","translation":"ヨーロッパの多くの町には、守護聖人を祝う地名に由来する祭りがある。","type":"adjective","meaning_category":"地名に由来する"},{"sentence":"The study of toponymous adjectives can reveal interesting historical connections between places and people.","translation":"地名に由来する形容詞の研究は、場所と人々の間の興味深い歴史的つながりを明らかにすることがある。","type":"adjective","meaning_category":"地名に由来する"}]}