{"word":"equability","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(気質・感情などの)平静さ、穏やかさ、安定性","english_definition":"the quality of being even-tempered and tranquil; calmness and composure.","examples":[{"sentence":"His equability allowed him to handle stressful situations with grace.","translation":"彼の平静さのおかげで、彼はストレスの多い状況を優雅に処理することができた。"},{"sentence":"She admired her friend's equability in the face of adversity.","translation":"彼女は逆境に直面したときの友人の穏やかさに感心した。"},{"sentence":"The equability of the climate made it a popular tourist destination.","translation":"その気候の安定性が、そこを人気の観光地にした。"}],"collocations":["emotional equability (感情的な平静さ)","temperamental equability (気質の穏やかさ)","climatic equability (気候の安定性)"],"synonyms":["composure","calmness","tranquility","serenity","evenness","imperturbability","aplomb","poise"],"antonyms":["volatility","instability","excitability","agitation","perturbation"]}],"etymology":{"value":"Late Middle English: from Latin *aequabilitas*, from *aequabilis* 'equal, uniform', from *aequus* 'equal'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌekwəˈbɪləti/","syllables":"e-qua-bil-i-ty"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"*Equability* refers to a consistent state of calmness, evenness of temper, and stability, whether in a person's character, emotions, or even in environmental conditions like climate. It suggests a lack of sudden or extreme changes. It's often seen as a positive trait, especially in leaders or those who need to remain composed under pressure.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed great equability when he won the lottery.","correct":"✓ He showed great excitement when he won the lottery.","note":"Equability implies a lack of strong emotional display. Excitement would be more appropriate in this context."},{"incorrect":"✗ The equability of the earthquake surprised everyone.","correct":"✓ The intensity of the earthquake surprised everyone.","note":"Equability refers to stability or evenness, not the force or magnitude of an event."}],"priority":"★★☆"},"related_words":{"derivatives":["equable (adjective: steady; not easily disturbed or upset; (of temperature) not varying much.)","equably (adverb: in an equable manner)","equal (adjective: being the same in quantity, size, degree, or value.)","equality (noun: the state of being equal, especially in status, rights, or opportunities.)"],"idioms_phrases":null,"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"*Equability* is a formal word that describes the quality of being calm, even-tempered, and not easily upset. It's used to describe someone who maintains a steady disposition, even in difficult situations. It can also refer to a stable climate or environment. Because it's a more advanced term, it's not commonly used in everyday conversation, but you might encounter it in literature, academic writing, or professional contexts where emotional intelligence and stability are valued."},"example_sentences":[{"sentence":"The diplomat's equability proved invaluable during the tense negotiations.","translation":"その外交官の平静さは、緊迫した交渉中に非常に貴重であることが証明された。","type":"noun","meaning_category":"平静さ・穏やかさ"},{"sentence":"The island is known for the equability of its climate, with mild temperatures year-round.","translation":"その島は、年間を通して穏やかな気温の気候の安定性で知られている。","type":"noun","meaning_category":"安定性 (気候)"},{"sentence":"Her equability in handling customer complaints earned her a promotion.","translation":"彼女の顧客からの苦情への対応における平静さが、昇進につながった。","type":"noun","meaning_category":"平静さ・穏やかさ"}]}