{"word":"ellipsoidal","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"楕円体の、楕円体のような","english_definition":"having the shape of an ellipsoid; resembling an ellipsoid.","examples":[{"sentence":"The Earth is not perfectly spherical, but slightly ellipsoidal.","translation":"地球は完全な球体ではなく、わずかに楕円体である。"},{"sentence":"The fruit had an ellipsoidal shape, like a slightly flattened sphere.","translation":"その果実は、わずかに平らになった球体のような楕円体の形をしていた。"}],"collocations":["ellipsoidal shape","ellipsoidal reflector","ellipsoidal head","ellipsoidal coordinates"],"synonyms":["ovoid","oval","elliptical","oblong"],"antonyms":["spherical","circular","round"]}],"etymology":{"value":"Derived from 'ellipsoid' + '-al'. 'Ellipsoid' comes from 'ellipse' + '-oid' (resembling). 'Ellipse' is from Greek 'elleipsis' (a falling short).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˌlɪpˈsɔɪdəl/","syllables":"el-lip-soi-dal"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Ellipsoidal' describes something that has the three-dimensional shape of an ellipse, which is called an ellipsoid. It's often used in scientific and technical contexts to describe shapes that are similar to a sphere but stretched or flattened in one or more directions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The object was elliptical, so it was ellipsoidal.","correct":"The object was elliptical in two dimensions, so it was ellipsoidal in three dimensions.","note":"'Elliptical' refers to a two-dimensional shape, while 'ellipsoidal' describes a three-dimensional shape. Use the correct term based on the dimensionality of the object."}],"priority":"★★☆"},"related_words":{"derivatives":["ellipsoid (noun): A surface whose plane sections are either ellipses or circles.","elliptical (adjective): Having the shape of an ellipse.","ellipse (noun): A regular oval shape, traced by a point moving in a plane so that the sum of its distances from two other points (the foci) is constant, or resulting when a cone is cut by an oblique plane which does not intersect the base."],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'ellipsoidal' is a technical term used to describe a three-dimensional shape that resembles a stretched or flattened sphere. It is most commonly found in scientific, mathematical, or engineering contexts. Understanding the related terms 'ellipse' (a two-dimensional oval shape) and 'ellipsoid' (the three-dimensional shape) is necessary to use this word correctly. It is not a word commonly used in everyday conversation."},"example_sentences":[{"sentence":"The researchers used an ellipsoidal mirror to focus the light.","translation":"研究者たちは、光を集束させるために楕円体の鏡を使用した。","type":"example","meaning_category":"shape"},{"sentence":"The satellite's orbit is slightly ellipsoidal due to gravitational forces.","translation":"衛星の軌道は、重力の影響によりわずかに楕円体である。","type":"example","meaning_category":"shape"},{"sentence":"The design incorporated an ellipsoidal dome for aesthetic reasons.","translation":"そのデザインには、美的理由から楕円体のドームが組み込まれていた。","type":"example","meaning_category":"shape"}]}