{"word":"tetragammadion","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A swastika, especially one composed of four Greek gamma letters.","english_definition":"A swastika, especially when composed of four Greek gamma letters.","examples":[{"sentence":"The tetragammadion is an ancient symbol found in many cultures.","translation":"テトラガンマディオンは、多くの文化で見られる古代のシンボルです。"},{"sentence":"Some consider the tetragammadion to be a symbol of good luck.","translation":"テトラガンマディオンを幸運のシンボルと考える人もいます。"}],"collocations":["ancient tetragammadion","tetragammadion symbol","cultural tetragammadion"],"synonyms":["swastika","fylfot","gammadion"],"antonyms":[]}],"etymology":{"value":"From tetra- (four) + gamma + -dion (a diminutive suffix). Refers to the four gamma (Γ) shapes that compose the symbol.","priority":"★★★"},"pronunciation":{"ipa":"/ˌtɛtrəɡəˈmeɪdiən/","syllables":"tet-ra-gam-ma-di-on"},"inflection":{"noun_plural":"tetragammadions"},"usage_notes":{"explanation":"The term 'tetragammadion' is a more specific term for the swastika, emphasizing its construction from four Greek gamma letters. It is often used in historical or archaeological contexts when discussing the symbol's presence in ancient cultures before its appropriation by the Nazi regime.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Tetragammadion' is a specialized term referring to a specific form of the swastika, composed of four Greek gamma letters. It is primarily used in academic or historical contexts. Understanding requires familiarity with Greek alphabet and historical symbolism."},"example_sentences":[{"sentence":"Archaeologists discovered a tetragammadion etched onto an ancient artifact.","translation":"考古学者は、古代の工芸品に刻まれたテトラガンマディオンを発見しました。","type":"noun","meaning_category":"symbol"},{"sentence":"The tetragammadion, though now controversial, was once a widespread symbol of prosperity.","translation":"テトラガンマディオンは、現在では物議を醸していますが、かつては繁栄の広範なシンボルでした。","type":"noun","meaning_category":"symbol"}]}