{"word":"restrictionary","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"制限的な、制約的な","english_definition":"Imposing or characterized by restrictions or limitations.","examples":[{"sentence":"The government implemented restrictionary policies to control inflation.","translation":"政府はインフレを抑制するために制限的な政策を実施した。"},{"sentence":"The new rules are quite restrictionary and limit our freedom.","translation":"新しい規則は非常に制限的で、私たちの自由を制限する。"},{"sentence":"A restrictionary clause in the contract prevented him from working for a competitor.","translation":"契約書の制限条項により、彼は競合他社で働くことができなかった。"}],"collocations":["restrictionary policies (制限的な政策)","restrictionary measures (制限的な措置)","restrictionary clause (制限条項)","restrictionary effect (制限効果)"],"synonyms":["restrictive","limiting","inhibitory","constraining","repressive"],"antonyms":["permissive","liberal","deregulatory","expansionary"]}],"etymology":{"value":"The word \"restrictionary\" is derived from \"restrict,\" which comes from the Latin \"re-\" (back, again) + \"stringere\" (to draw tight, bind). The suffix \"-ary\" indicates a quality or association.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈstrɪkʃənɛri/","syllables":"re-stric-tion-a-ry"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It can also be used in comparative and superlative forms (more restrictionary, most restrictionary), though this is less common."},"usage_notes":{"explanation":"\"Restrictionary\" is used to describe something that imposes limits or constraints. It is often used in the context of policies, rules, or measures that aim to control or limit certain activities or behaviors. It is a more formal and less commonly used word than \"restrictive,\" but they are largely interchangeable.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The restrictionary is good for the economy.","correct":"✓ Restrictionary policies are good for the economy.","note":"\"Restrictionary\" is an adjective and needs to modify a noun. It cannot stand alone as a noun."},{"incorrect":"✗ The policy is very restrictional.","correct":"✓ The policy is very restrictionary. / ✓ The policy is very restrictive.","note":"The correct adjective form is \"restrictionary\" or \"restrictive,\" not \"restrictional.\""}],"priority":"★★☆"},"related_words":{"derivatives":["restrict (verb)","restriction (noun)","restrictive (adjective)"],"phrases":["fiscal restrictionary policy (財政緊縮政策)","monetary restrictionary policy (金融引き締め政策)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1-C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"restrictionary\" is a formal term used to describe something that imposes limits or constraints. It's often used in discussions about government policies, economic measures, or legal agreements. Because it's a more sophisticated word, it's less common in everyday conversation and more frequently found in academic or professional contexts. If you're aiming to understand complex texts or participate in high-level discussions, knowing this word can be helpful."},"example_sentences":[{"sentence":"The government's restrictionary trade practices have been criticized by international organizations.","translation":"政府の制限的な貿易慣行は国際機関から批判されている。","type":"general"},{"sentence":"The central bank adopted a restrictionary monetary policy to combat inflation.","translation":"中央銀行はインフレに対抗するために金融引き締め政策を採用した。","type":"economic"},{"sentence":"The club has restrictionary membership rules.","translation":"そのクラブには制限的な会員規則がある。","type":"general"}]}