{"word":"finchery","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"飼い鳥としてのフィンチ類を飼育・繁殖する場所、またはその趣味","english_definition":"A place where finches are kept and bred, or the hobby of keeping and breeding finches.","examples":[{"sentence":"He built a large finchery in his backyard to house his collection of exotic finches.","translation":"彼は裏庭に大きなフィンチ飼育場を作り、珍しいフィンチのコレクションを収容した。"},{"sentence":"Her finchery is well-known in the local bird-keeping community.","translation":"彼女のフィンチ飼育場は、地元の愛鳥家コミュニティではよく知られている。"},{"sentence":"The finchery requires careful attention to temperature, humidity, and diet.","translation":"フィンチ飼育場では、温度、湿度、食事に細心の注意を払う必要がある。"}],"collocations":["build a finchery","maintain a finchery","visit a finchery","finchery hobby","backyard finchery"],"synonyms":["aviary","birdhouse","bird garden"],"antonyms":[]}],"etymology":{"value":"「finch」（フィンチ）+ 「-ery」（場所、活動、職業などを表す接尾辞）","priority":"★★★"},"pronunciation":{"ipa":"ˈfɪntʃəri","syllables":"fin-cher-y"},"inflection":{"noun_plural":"fincheries"},"usage_notes":{"explanation":"「finchery」は、フィンチ類を専門に飼育・繁殖する施設や場所を指す言葉です。趣味としてフィンチを飼育・繁殖する場合にも使われます。大規模なものから個人宅の小規模なものまで、様々な規模のものが存在します。フィンチの種類、飼育環境、繁殖方法など、専門的な知識が必要となる場合があります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I went to the finchery and saw many finches. It was a finch farm.","correct":"✓ I went to the finchery and saw many finches.","note":"「finch farm」という言葉は一般的ではありません。フィンチを飼育・繁殖する場所は「finchery」と表現します。"},{"incorrect":"✗ She has a finchery in her house, it's very quiet.","correct":"✓ She has a finchery in her house, it requires a lot of care.","note":"フィンチ飼育場は静かであるとは限りません。適切な環境を維持するには、温度管理や清掃など、多くの手入れが必要です。"}],"priority":"★☆☆"},"related_words":{"derivatives":["finch (フィンチ)","aviary (鳥舎)","birdkeeping (愛鳥趣味)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"finchery\" refers to a place specifically designed for keeping and breeding finches. It's a niche term, primarily used by those involved in aviculture or bird-keeping as a hobby. Understanding the term implies familiarity with the practice of keeping birds, particularly finches, in a controlled environment for breeding or enjoyment. The word is not commonly encountered in general conversation or writing.","priority":"★☆☆"},"example_sentences":[{"sentence":"The local bird club organized a tour of a well-established finchery.","translation":"地元の愛鳥クラブは、設備の整ったフィンチ飼育場の見学ツアーを企画した。","type":"noun","meaning_category":"飼育施設"},{"sentence":"Setting up a successful finchery requires knowledge of different finch species and their specific needs.","translation":"フィンチ飼育場を成功させるには、さまざまなフィンチの種類と、それぞれの特定のニーズに関する知識が必要です。","type":"noun","meaning_category":"趣味・活動"},{"sentence":"The finchery was filled with the sounds of chirping and singing birds.","translation":"フィンチ飼育場は、鳥のさえずりや歌声で満たされていた。","type":"noun","meaning_category":"飼育施設"}]}