{"word":"pose-sensitive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"姿勢に依存する、姿勢に敏感な","english_definition":"Describing a system or algorithm whose performance or output varies depending on the pose or orientation of the input.","examples":[{"sentence":"The object recognition system is pose-sensitive, struggling to identify objects when they are rotated.","translation":"その物体認識システムは姿勢に依存しており、物体が回転すると識別が困難になる。"},{"sentence":"Pose-sensitive features are used in the algorithm to improve the accuracy of human activity recognition.","translation":"姿勢に依存する特徴は、人間の活動認識の精度を向上させるためにアルゴリズムで使用される。"}],"collocations":["pose-sensitive features","pose-sensitive algorithm","pose-sensitive recognition"],"synonyms":["orientation-dependent","viewpoint-dependent"],"antonyms":["pose-invariant","orientation-independent"]}],"etymology":{"value":"The term is formed by combining 'pose' (referring to a particular bodily position) and 'sensitive' (meaning responsive to or affected by).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈpoʊzˌsɛnsɪtɪv/","syllables":"pose-sen-si-tive"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Pose-sensitive' is often used in the context of computer vision, robotics, and machine learning to describe systems that are not robust to changes in the pose or orientation of objects or subjects. A pose-sensitive system may perform well under specific conditions but degrade significantly when the input deviates from those conditions.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The system is very sensitive, so it is pose-sensitive.","correct":"✓ The system is very sensitive to pose variations, so it is pose-sensitive.","note":"'Sensitive' alone doesn't necessarily imply pose-sensitivity. It's important to specify that the sensitivity is related to pose variations."}],"priority":"☆☆☆"},"related_words":{"derivatives":["pose-sensitivity (noun)"],"phrasal_verbs":[],"related_terms":["pose estimation","computer vision","object recognition","human activity recognition"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Pose-sensitive' is a technical term used in fields like computer vision and robotics. It describes a system that is affected by the orientation or position of an object or person it is analyzing. If a system is 'pose-sensitive', it means its performance changes depending on the angle or position from which it is viewing something. This term is not commonly used in everyday language."},"example_sentences":[{"sentence":"The performance of the facial recognition software was highly pose-sensitive.","translation":"その顔認識ソフトウェアの性能は、姿勢に非常に依存していた。","type":"general","meaning_category":"general"},{"sentence":"Researchers are working on developing pose-invariant algorithms to overcome the limitations of pose-sensitive systems.","translation":"研究者たちは、姿勢に依存するシステムの限界を克服するために、姿勢不変アルゴリズムの開発に取り組んでいる。","type":"technical","meaning_category":"technical"}]}