{"word":"Borophenol","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A chemical compound containing boron and phenol groups. It is primarily of interest in theoretical chemistry and materials science.","english_definition":"A chemical compound containing boron and phenol groups, studied for its potential applications in materials science.","examples":[{"sentence":"The synthesis of borophenol derivatives is being explored for their potential in catalysis.","translation":"触媒としての可能性を探るため、ボロフェノール誘導体の合成が研究されている。"},{"sentence":"Borophenol-based materials show promise in electronic applications.","translation":"ボロフェノールを基盤とする材料は、電子応用において有望性を示している。"}],"collocations":["borophenol derivative","borophenol synthesis","borophenol-based material"],"synonyms":["boron-containing phenol","phenylboronic acid"],"antonyms":[]}],"etymology":{"value":"Derived from the combination of 'boron' and 'phenol', indicating the presence of both elements in the compound.","priority":"★★★"},"pronunciation":{"ipa":"/ˌbɔːroʊˈfiːnɒl/","syllables":"bo-ro-phe-nol"},"inflection":{"noun_plural":"borophenols"},"usage_notes":{"explanation":"Borophenol is a relatively obscure term, primarily used within the fields of chemistry and materials science. Its usage is typically limited to academic research papers and technical discussions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Borophenol is a type of polymer.","correct":"✓ Borophenol is a chemical compound.","note":"Borophenol is a specific chemical compound, not a general type of polymer."}],"priority":"★★☆"},"related_words":{"derivatives":["boronic acid","phenol","borate"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - Primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Borophenol' is a highly specialized term used in advanced chemistry and materials science. Understanding requires a strong background in organic chemistry and an understanding of chemical nomenclature. It is not a word commonly encountered outside of these specific fields."},"example_sentences":[{"sentence":"Researchers are investigating the properties of borophenol for use in new types of sensors.","translation":"研究者たちは、新しいタイプのセンサーへの応用のため、ボロフェノールの特性を調査している。","type":"noun","meaning_category":"chemical compound"},{"sentence":"The borophenol compound exhibited unique electronic characteristics.","translation":"そのボロフェノール化合物は、独特な電子特性を示した。","type":"noun","meaning_category":"chemical compound"}]}