{"word":"Yojan","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主にインドで使用される)距離の単位。古代インドの文献に登場し、その正確な長さは時代や文献によって異なるが、一般的には数キロメートルから十数キロメートル程度とされる。","english_definition":"A unit of distance, primarily used in India. It appears in ancient Indian texts, and its exact length varies depending on the era and text, but it is generally considered to be several kilometers to over ten kilometers.","examples":[{"sentence":"The city is said to be located about 10 yojans from here.","translation":"その都市はここから約10ヨジャン離れた場所にあると言われています。"},{"sentence":"In ancient times, distances were often measured in yojans.","translation":"古代には、距離はしばしばヨジャンで測られていました。"}],"collocations":["measure in yojans (ヨジャンで測る)","distance in yojans (ヨジャンの距離)"],"synonyms":["krosha","mile","kilometer"],"antonyms":[]}],"etymology":{"value":"サンスクリット語の 'yojana' (యోజన) に由来し、'旅程' や '一日の行程' を意味する。","priority":"★★★"},"pronunciation":{"ipa":"/ˈjoʊdʒən/","syllables":"yo-jan"},"inflection":{"noun_plural":"yojans"},"usage_notes":{"explanation":"'Yojan' は現代の日常生活ではほとんど使用されない歴史的な単位です。主に古代インドの叙事詩、宗教文献、歴史書などで見られます。正確な距離は文献や地域によって異なり、確定的な換算は困難です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The yojan is a very precise unit of measurement.","correct":"✓ The yojan is not a very precise unit of measurement.","note":"ヨジャンは時代や地域によって長さが異なり、正確な単位とは言えません。"},{"incorrect":"✗ A yojan is exactly 10 kilometers.","correct":"✓ A yojan is approximately 10 kilometers.","note":"ヨジャンの正確な長さは一定ではありません。およその目安として10キロメートル程度とされることがあります。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Yojan' is a historical unit of distance primarily found in ancient Indian texts. Its exact length is variable and imprecise by modern standards, making it a term encountered mainly in specialized contexts such as religious studies, Indology, or historical literature. The term's usage is rare in contemporary English.","priority":"★☆☆"},"example_sentences":[{"sentence":"The epic describes the journey as being hundreds of yojans long.","translation":"その叙事詩では、旅は何百ヨジャンもの長さであると記述されています。","type":"noun","meaning_category":"distance"},{"sentence":"Scholars debate the exact equivalent of a yojan in modern units.","translation":"学者たちは、ヨジャンの現代単位での正確な換算について議論しています。","type":"noun","meaning_category":"distance"}]}