{"word":"Paulicianism","priority":"低","meanings":[{"part_of_speech":"noun","definition":"パウロ派、パウロニキアニズム：7世紀から9世紀にかけてアルメニアおよび東ローマ帝国で広まったキリスト教の異端。マニ教の影響を受け、二元論的な宇宙観を持ち、物質世界を悪とみなした。聖像崇拝を否定し、聖書を重視した。","english_definition":"A Christian dualist sect that originated in Armenia and the Eastern Roman Empire from the 7th to 9th centuries. Influenced by Manichaeism, it held a dualistic view of the universe, considering the material world to be evil. It rejected icon worship and emphasized the Bible.","examples":[{"sentence":"Paulicianism spread rapidly in the eastern provinces of the Byzantine Empire.","translation":"パウロ派は、東ローマ帝国の東部州で急速に広まった。"},{"sentence":"The Byzantine emperors persecuted the Paulicians for their heretical beliefs.","translation":"ビザンツ皇帝たちは、その異端的な信仰のためにパウロ派を迫害した。"}],"collocations":["Paulician heresy (パウロ派の異端)","Byzantine Empire (東ローマ帝国)","dualism (二元論)","Manichaeism (マニ教)"],"synonyms":["Thondrakianism"],"antonyms":[]},{"part_of_speech":"noun","definition":"パウロ派の信奉者","english_definition":"A follower of Paulicianism.","examples":[{"sentence":"The Paulicians were known for their resistance to the Byzantine state.","translation":"パウロ派の信者は、ビザンツ国家への抵抗で知られていた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term 'Paulicianism' is derived from the name of the Apostle Paul, whom the sect revered, and the suffix '-ism,' denoting a doctrine or belief system. Some scholars believe the name may also be linked to specific leaders or communities within the movement.","priority":"中"},"pronunciation":{"ipa":"/pɔːˈlɪʃənɪzəm/","syllables":"Pau-li-cian-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Paulicianism is considered a dualistic and adoptionist heresy within Christianity. Dualistic because it posited the existence of two opposing principles (good and evil) governing the universe, and adoptionist because it believed that Jesus was a man 'adopted' by God, rather than being divine from birth. The movement was often persecuted and suppressed by the Byzantine authorities.","priority":"中"},"common_mistakes":{"examples":[],"priority":"低"},"related_words":{"derivatives":["Paulician (noun, adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低い","priority":"低"},"readability_explanation":{"level":"C2","text":"'Paulicianism' is a term primarily encountered in historical or theological contexts, specifically when studying the history of Christianity, the Byzantine Empire, or the development of heretical movements. Understanding requires familiarity with religious terminology, historical context, and theological concepts such as dualism and adoptionism."},"example_sentences":[{"sentence":"The study of Paulicianism provides insights into the religious diversity of the medieval world.","translation":"パウロ派の研究は、中世世界の宗教的多様性への洞察を提供する。","type":"general","meaning_category":"歴史的研究"},{"sentence":"The Paulicians' rejection of material possessions and emphasis on spiritual purity resonated with some segments of the population.","translation":"パウロ派の物質的な所有の拒否と精神的な純粋さの重視は、人口の一部に共鳴した。","type":"historical context","meaning_category":"信仰と影響"}]}