{"word":"non-Hispanic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"非ヒスパニック系の","english_definition":"Not of Hispanic origin or descent.","examples":[{"sentence":"The majority of the population in this area is non-Hispanic white.","translation":"この地域の人口の大部分は非ヒスパニック系の白人です。"},{"sentence":"We need to collect data on both Hispanic and non-Hispanic populations.","translation":"ヒスパニック系と非ヒスパニック系の両方の人口に関するデータを収集する必要があります。"}],"collocations":["non-Hispanic white","non-Hispanic black","non-Hispanic Asian"],"synonyms":["non-Latino"],"antonyms":["Hispanic","Latino"]},{"part_of_speech":"noun","definition":"非ヒスパニック系の人","english_definition":"A person who is not of Hispanic origin or descent.","examples":[{"sentence":"The survey included both Hispanics and non-Hispanics.","translation":"調査にはヒスパニック系と非ヒスパニック系の両方が含まれていました。"},{"sentence":"Non-Hispanics make up a significant portion of the workforce.","translation":"非ヒスパニック系の人々は労働力の重要な部分を占めています。"}],"collocations":[],"synonyms":["non-Latino"],"antonyms":["Hispanic","Latino"]}],"etymology":{"value":"Formed from the prefix 'non-' (meaning 'not') and 'Hispanic' (referring to people, cultures, or languages of Spain and Latin America).","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn hɪˈspænɪk/","syllables":"non-His-pan-ic"},"inflection":{"notes":"Plural form of the noun is 'non-Hispanics'."},"usage_notes":{"explanation":"'Non-Hispanic' is a term used in the United States, especially in demographic and statistical contexts, to distinguish people who do not identify as Hispanic or Latino/a/x. It is often used in conjunction with racial categories (e.g., non-Hispanic white, non-Hispanic black). The term is primarily used in the US and may not be widely understood or used in other countries. It is important to note that 'Hispanic' and 'Latino/a/x' are distinct but overlapping categories. 'Hispanic' refers to people, cultures, or languages of Spain and Spanish-speaking Latin America, while 'Latino/a/x' refers to people with origins in Latin America. A person can be both, one, or neither.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a non-hispanic.","correct":"✓ He is non-Hispanic.","note":"When used as an adjective, 'non-Hispanic' is typically capitalized but not hyphenated. When used as a noun, 'non-Hispanic' is capitalized and pluralized as 'non-Hispanics'."},{"incorrect":"✗ She is non Hispanic white.","correct":"✓ She is a non-Hispanic white person. / ✓ She is a non-Hispanic white.","note":"When describing someone's race and ethnicity, it's important to use respectful and accurate language. Using 'person' can help avoid objectifying individuals."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Hispanic","Latino","Latina","Latinx","ethnicity","race","demographics"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency, primarily used in specific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Non-Hispanic' is a term used mainly in the United States to categorize people who are not of Hispanic or Latino origin. It's often used in official reports and demographic studies. The term helps to differentiate between racial and ethnic groups for statistical purposes. Understanding this term requires knowledge of how the U.S. Census Bureau defines race and ethnicity, and the distinction between 'Hispanic' (related to Spanish-speaking countries) and 'Latino' (related to Latin America)."},"example_sentences":[{"sentence":"The study focused on the health disparities between Hispanic and non-Hispanic populations.","translation":"その研究は、ヒスパニック系と非ヒスパニック系の人口の間の健康格差に焦点を当てました。","type":"adjective","meaning_category":"ethnic classification"},{"sentence":"As a non-Hispanic, she was curious about the traditions of her Hispanic neighbors.","translation":"非ヒスパニック系として、彼女はヒスパニック系の隣人の伝統に興味がありました。","type":"noun","meaning_category":"ethnic identity"},{"sentence":"The data showed a significant difference in income between non-Hispanic white and non-Hispanic black households.","translation":"データは、非ヒスパニック系の白人と非ヒスパニック系の黒人の世帯の間の収入に大きな違いがあることを示しました。","type":"adjective","meaning_category":"demographic analysis"}]}