{"word":"Ixodian","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Science Fiction) A fictional inhabitant of the planet Ix in the Dune universe.","english_definition":"A fictional inhabitant of the planet Ix in the Dune universe, known for their advanced technology and manufacturing.","examples":[{"sentence":"The Ixodians are renowned for their technological prowess.","translation":"イクス人はその技術力で有名です。"},{"sentence":"Ixodian devices are highly sought after throughout the Imperium.","translation":"イクス製の装置は帝国中で非常に求められています。"}],"collocations":["Ixian technology","Ixian device","House Ix","Planet Ix"],"synonyms":["Ixian"],"antonyms":[]}],"etymology":{"value":"Derived from 'Ix', the name of the planet they inhabit, within the Dune fictional universe created by Frank Herbert.","priority":"★★★"},"pronunciation":{"ipa":"/ɪɡˈzoʊdiən/","syllables":"Ix-o-di-an"},"inflection":{"noun_plural":"Ixodians"},"usage_notes":{"explanation":"'Ixodian' refers specifically to the people of Ix in the Dune universe. It's a term used within the context of science fiction and is not found in general English vocabulary.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an Ixodes.","correct":"✓ He is an Ixodian.","note":"'Ixodes' is a genus of ticks, whereas 'Ixodian' refers to the people from the planet Ix in Dune."}],"priority":"★★☆"},"related_words":{"derivatives":["Ix (planet name)","Ixian (adjective)"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency. Specific to the Dune universe.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Ixodian' is a term specific to the Dune science fiction universe. Understanding requires familiarity with the Dune novels or related media. It is not part of standard English vocabulary. Usage is limited to discussions within the Dune fandom or academic analyses of the series."},"example_sentences":[{"sentence":"The **Ixodian** ambassador arrived with a retinue of robotic attendants.","translation":"イクス人の大使はロボットの従者の一行を連れて到着した。","type":"noun","meaning_category":"Inhabitant of Ix"},{"sentence":"**Ixodian** technology is both revered and feared in equal measure.","translation":"イクス人の技術は同様に崇拝され、恐れられている。","type":"adjective (Ixian)","meaning_category":"Relating to Ix"}]}