{"word":"affect-focused","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"感情に焦点を当てた、感情中心の","english_definition":"Focused on emotions and feelings; emphasizing the role of affect in understanding behavior or experiences.","examples":[{"sentence":"The therapist used an affect-focused approach to help the patient process their trauma.","translation":"セラピストは感情中心のアプローチを用いて、患者がトラウマを処理するのを助けた。"},{"sentence":"Affect-focused interventions aim to increase emotional awareness and regulation.","translation":"感情中心の介入は、感情的な認識と調整を高めることを目的としている。"},{"sentence":"The study examined the effectiveness of affect-focused therapy for depression.","translation":"その研究では、うつ病に対する感情中心療法の有効性を調査した。"}],"collocations":["affect-focused therapy (感情中心療法)","affect-focused intervention (感情中心の介入)","affect-focused approach (感情中心のアプローチ)","affect-focused treatment (感情中心の治療)","affect-focused regulation (感情中心の調整)"],"synonyms":["emotion-focused","feeling-oriented","emotionally-driven"],"antonyms":["cognitive-focused","behavior-focused","thought-oriented"]}],"etymology":{"value":"The term is derived from 'affect,' referring to emotions or feelings, combined with 'focused,' indicating a specific point of attention or emphasis.","priority":"★★★"},"pronunciation":{"ipa":"/əˈfɛkt ˈfoʊkəst/","syllables":"af-fect-fo-cused"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb. It can be modified by adverbs (e.g., highly affect-focused)."},"usage_notes":{"explanation":"'Affect-focused' is commonly used in psychology, therapy, and related fields to describe approaches, interventions, or treatments that prioritize the exploration, understanding, and regulation of emotions. It suggests that emotions are considered central to the issue being addressed.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The affect-focused was very helpful.","correct":"✓ The affect-focused therapy was very helpful.","note":"'Affect-focused' is an adjective and needs to modify a noun. Using it alone as a noun is incorrect."},{"incorrect":"✗ The effect-focused approach...","correct":"✓ The affect-focused approach...","note":"'Affect' (emotion) is different from 'effect' (result). Make sure to use the correct term."}],"priority":"★★☆"},"related_words":{"derivatives":["affect (noun: emotion, feeling; verb: to influence)","focus (noun: center of attention; verb: to concentrate)","focused (adjective: concentrated, attentive)"],"phrases":["emotion regulation","emotional awareness","affective science"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in academic and professional contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Affect-focused' is a specialized term primarily used in psychology and related fields. It describes something that prioritizes emotions and feelings. Understanding requires familiarity with psychological concepts and terminology. It is not typically used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The affect-focused approach helped the client identify and express their underlying emotions.","translation":"感情中心のアプローチは、クライアントが根本的な感情を特定し、表現するのを助けた。","type":"general","meaning_category":"therapy"},{"sentence":"Research suggests that affect-focused parenting can improve children's emotional development.","translation":"研究によると、感情中心の育児は子供の感情発達を改善する可能性がある。","type":"general","meaning_category":"parenting"},{"sentence":"The training program included modules on affect-focused communication skills.","translation":"その研修プログラムには、感情中心のコミュニケーションスキルに関するモジュールが含まれていた。","type":"general","meaning_category":"communication"}]}