{"word":"asclepidoid","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(植物学) ガガイモ科の植物に似た、またはそれらに関連する","english_definition":"(botany) Resembling or pertaining to plants of the family Asclepiadaceae (now Apocynaceae, subfamily Asclepiadoideae).","examples":[{"sentence":"The flower has an asclepidoid structure.","translation":"その花はガガイモ科植物に似た構造を持つ。"},{"sentence":"Asclepidoid pollen is often found in this region.","translation":"この地域ではガガイモ科の花粉がよく見られる。"}],"collocations":["asclepidoid flower","asclepidoid pollen","asclepidoid structure"],"synonyms":["apocynaceous (related term, referring to the broader family)"],"antonyms":[]}],"etymology":{"value":"Derived from the family name Asclepiadaceae (now a subfamily Asclepiadoideae within Apocynaceae) + -oid (suffix meaning 'resembling'). Asclepiadaceae is named after Asclepius, the Greek god of medicine.","priority":"★★☆"},"pronunciation":{"ipa":"/æsˈklɛpɪˌdɔɪd/","syllables":"as-cle-pid-oid"},"inflection":{"notes":"Adjective, no standard inflections apply."},"usage_notes":{"explanation":"The term 'asclepidoid' is primarily used in botanical contexts to describe features, structures, or characteristics that are similar to or associated with plants formerly classified in the family Asclepiadaceae. Modern taxonomy places these plants in the subfamily Asclepiadoideae within the broader family Apocynaceae. The term is most often encountered in scientific literature and descriptions of plant morphology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The asclepidoid is a plant.","correct":"✓ An asclepidoid plant has certain characteristics.","note":"'Asclepidoid' is an adjective, not a noun. It describes something that resembles or relates to plants of the Asclepiadoideae subfamily."}],"priority":"★☆☆"},"related_words":{"derivatives":["Asclepiadaceae","Asclepiadoideae","Apocynaceae"],"related_terms":["milkweed (common name for many plants in this group)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Asclepidoid' is a botanical term used to describe something that resembles or relates to plants in the subfamily Asclepiadoideae (formerly the family Asclepiadaceae). This term is primarily found in scientific or technical contexts related to botany and plant taxonomy. It is not a commonly used word in everyday language. Understanding this term requires familiarity with botanical classification systems.","priority":"★★☆"},"example_sentences":[{"sentence":"The plant's coronal structure is distinctly asclepidoid.","translation":"その植物の花冠構造は明らかにガガイモ科植物に似ている。","type":"adjective","meaning_category":"botanical description"},{"sentence":"Studies have focused on the unique pollination mechanisms of asclepidoid flowers.","translation":"研究は、ガガイモ科の花の独特な受粉メカニズムに焦点を当てている。","type":"adjective","meaning_category":"botanical research"}]}