{"word":"land-poor","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"土地は持っているが、それを活用する資本や資源がないために貧しい","english_definition":"owning much land but lacking the capital to make it productive and profitable; rich in land but poor in money.","examples":[{"sentence":"The family was land-poor, owning hundreds of acres but unable to afford fertilizer or equipment.","translation":"その家族は数百エーカーの土地を所有していたが、肥料や設備を買う余裕がなく、土地はあっても貧しかった。"},{"sentence":"Many farmers in the region are land-poor, struggling to make a living despite their extensive holdings.","translation":"その地域の多くの農家は、広大な土地を所有しているにもかかわらず、生活に苦労しており、土地はあっても貧しい状態だ。"}],"collocations":["land-poor farmers","land-poor gentry","land-poor aristocracy"],"synonyms":["resource-poor","capital-deficient","asset-rich, cash-poor"],"antonyms":["land-rich","wealthy","affluent"],"notes":"Typically used to describe individuals or families in agricultural societies."}],"etymology":{"value":"Combination of 'land' and 'poor', indicating poverty despite land ownership.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlændˌpʊər/","syllables":"land-poor"},"inflection":{"notes":"Adjective, no inflections"},"usage_notes":{"explanation":"The term 'land-poor' describes a situation where someone owns a significant amount of land but lacks the financial resources to utilize it effectively. This often occurs in agricultural communities where land ownership doesn't necessarily translate to wealth due to a lack of capital for farming equipment, seeds, or other necessary resources.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a land-poor man because he has no land.","correct":"✓ He is land-poor because he cannot afford to cultivate his land.","note":"Land-poor means owning land but lacking capital, not lacking land itself."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_concepts":["agrarian poverty","rural poverty","asset poverty"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively infrequent, but understood in contexts discussing land ownership and poverty.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Land-poor' is a relatively uncommon term that describes a specific economic situation: owning a lot of land but not having enough money or resources to make that land productive. It's often used in discussions about agriculture or historical social structures where land ownership was common but didn't guarantee wealth."},"example_sentences":[{"sentence":"The old plantation owners became land-poor after the Civil War.","translation":"南北戦争後、古いプランテーション所有者たちは土地はあっても貧しくなった。","type":"general","meaning_category":"general"},{"sentence":"Many land-poor families were forced to sell their ancestral lands.","translation":"多くの土地はあっても貧しい家族は、先祖代々の土地を売らざるを得なかった。","type":"general","meaning_category":"general"}]}