{"word":"hounder","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(人を)しつこく追いかける人、つきまとう人、悩ます人","english_definition":"A person who persistently pursues, follows, or harasses someone.","examples":[{"sentence":"The reporters were relentless hounders, never giving the celebrity any peace.","translation":"記者たちは容赦ない追跡者で、有名人に安らぎを与えることはなかった。"},{"sentence":"He became a hounder of politicians, constantly demanding answers to his questions.","translation":"彼は政治家を執拗に追いかける人になり、常に彼の質問への答えを要求した。"},{"sentence":"She described her ex-boyfriend as a persistent hounder who wouldn't leave her alone.","translation":"彼女は元彼氏を、彼女を一人にしてくれないしつこい追跡者だと表現した。"}],"collocations":["relentless hounder","persistent hounder","media hounder"],"synonyms":["stalker","harasser","persecutor","chaser","tormentor"],"antonyms":["supporter","friend","ally"]}],"etymology":{"value":"The word 'hounder' is derived from the verb 'to hound,' which means to pursue relentlessly or harass. The suffix '-er' is added to denote a person who performs the action. The verb 'to hound' originally referred to the use of hunting dogs (hounds) to chase animals.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhaʊndər/","syllables":"houn-der"},"inflection":{"noun_plural":"hounders"},"usage_notes":{"explanation":"'Hounder' typically carries a negative connotation, implying that the person being pursued is unwilling or uncomfortable with the attention. It suggests a level of persistence that borders on harassment or stalking. The term is often used in contexts involving media, politics, or personal relationships where one party is seeking information or attention from another in an unwelcome manner.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a hounder of good deeds.","correct":"✓ He is a doer of good deeds.","note":"'Hounder' is generally used for negative or unwanted pursuit, not for positive actions. Use 'doer' or another appropriate term instead."},{"incorrect":"✗ The dog is a hounder.","correct":"✓ The dog is a hound.","note":"If referring to a type of dog, use 'hound,' not 'hounder.' 'Hounder' refers to a person who hounds."}],"priority":"★★☆"},"related_words":{"derivatives":["hound (verb, noun)","hounding (noun, gerund)"],"related_terms":["stalking","harassment","pursuit","obsession"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'hounder' is relatively uncommon and implies a persistent and often unwelcome pursuit or harassment of someone. It is generally used in more formal or descriptive contexts to convey a strong sense of unwanted attention. Understanding the negative connotation and the context of relentless pursuit is key to interpreting this word correctly."},"example_sentences":[{"sentence":"The paparazzi acted as hounders, following the celebrity everywhere.","translation":"パパラッチは追跡者のように振る舞い、有名人をどこへでも追いかけた。","type":"noun","meaning_category":"しつこく追いかける人"},{"sentence":"She felt like she had a hounder on her trail after the interview.","translation":"インタビュー後、彼女は誰かにしつこくつきまとわれているように感じた。","type":"noun","meaning_category":"つきまとう人"},{"sentence":"The constant phone calls from the debt collector made him feel like he was being hounded.","translation":"債権回収業者からの絶え間ない電話で、彼は悩まされているように感じた。","type":"noun","meaning_category":"悩ます人"}]}