{"word":"calotypist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"カロタイプ写真家、カロタイプ技師","english_definition":"A photographer who uses the calotype process.","examples":[{"sentence":"The calotypist carefully prepared the paper with silver iodide.","translation":"カロタイプ写真家は、ヨウ化銀で注意深く紙を準備した。"},{"sentence":"Early calotypists often faced challenges with exposure times and image quality.","translation":"初期のカロタイプ写真家は、露出時間と画質に苦労することが多かった。"}],"collocations":["early calotypist","famous calotypist","skilled calotypist"],"synonyms":["photographer","camera operator"],"antonyms":[]}],"etymology":{"value":"The word \"calotypist\" is derived from \"calotype,\" which itself comes from the Greek words \"kalos\" (beautiful) and \"typos\" (impression). The suffix \"-ist\" denotes a person who practices or is skilled in something.","priority":"★★★"},"pronunciation":{"ipa":"/kəˈlɒtɪpɪst/","syllables":"ca-lo-ty-pist"},"inflection":{"noun_plural":"calotypists"},"usage_notes":{"explanation":"The term \"calotypist\" specifically refers to photographers who used the calotype process, an early photographic technique invented by William Henry Fox Talbot in the 1840s. This process produced a negative image on paper, which could then be used to create multiple positive prints.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a daguerrotypist, a type of calotypist.","correct":"✓ He is a daguerrotypist, which is different from a calotypist.","note":"Daguerrotype and calotype are different early photographic processes. A daguerrotypist uses the daguerrotype process, not the calotype process."}],"priority":"★★☆"},"related_words":{"derivatives":["calotype","calotypic"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"calotypist\" is a specialized term referring to a photographer who used the calotype process, an early photographic technique. Understanding this word requires knowledge of the history of photography and specific photographic processes. It is not a commonly used word in modern English.","priority":"★★★"},"example_sentences":[{"sentence":"As a calotypist, she experimented with various paper types to achieve different effects.","translation":"カロタイプ写真家として、彼女はさまざまな効果を得るために、さまざまな種類の紙を試した。","type":"general","meaning_category":"photographer using calotype process"},{"sentence":"The exhibition featured the work of several prominent calotypists from the 19th century.","translation":"その展覧会では、19世紀の著名なカロタイプ写真家数名の作品が展示された。","type":"historical","meaning_category":"historical photographer"}]}