{"word":"Byeman","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(historical) A member of a social class in Poland, Lithuania, Belarus, and Ukraine, consisting of petty gentry who owned small plots of land and were obligated to perform military service.","english_definition":"A member of a social class in Poland, Lithuania, Belarus, and Ukraine, consisting of petty gentry who owned small plots of land and were obligated to perform military service.","examples":[{"sentence":"The Byemans, though of noble origin, often lived in conditions similar to those of peasants.","translation":"バイェマンは、貴族の出身ではあるものの、しばしば農民と似たような状況で生活していました。"},{"sentence":"Historical records detail the rights and obligations of the Byeman class in the Grand Duchy of Lithuania.","translation":"歴史的記録には、リトアニア大公国におけるバイェマン階級の権利と義務が詳しく記されています。"}],"collocations":["Byeman class","Byeman society","Byeman rights","Byeman obligations"],"synonyms":["petty gentry","minor nobility","landed knights"],"antonyms":[]}],"etymology":{"value":"The term 'Byeman' is derived from the Belarusian word 'być' (быць), meaning 'to be', suggesting their status as landowners or those 'being' in a certain social position.","priority":"★★☆"},"pronunciation":{"ipa":"ˈbʲɛman","syllables":"Bye-man"},"inflection":{"noun_plural":"Byemans"},"usage_notes":{"explanation":"The term 'Byeman' refers to a specific historical social class in Eastern Europe. It's important to note that this class existed primarily in the context of the Polish-Lithuanian Commonwealth and surrounding regions. The term is not commonly used in modern English outside of historical or academic contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a Byeman farmer.","correct":"✓ He was a Byeman.","note":"Byemans were not simply farmers; they were petty gentry obligated to military service. The term implies a specific social status beyond just being a farmer."},{"incorrect":"✗ Byemans were wealthy landowners.","correct":"✓ Byemans were petty gentry who owned small plots of land.","note":"Byemans were not wealthy; they were considered petty gentry with limited land ownership."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["szlachta (Polish nobility)","boyar (Russian nobility)","gentry"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - Primarily used in historical or academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Byeman' is a historical term referring to a specific social class in Eastern Europe, primarily within the Polish-Lithuanian Commonwealth. Understanding this term requires knowledge of Eastern European history and social structures. It is not a commonly used word in modern English, and its usage is generally limited to academic or historical discussions. Therefore, a high level of English proficiency and familiarity with historical contexts is needed to comprehend and use this term correctly."},"example_sentences":[{"sentence":"The Byeman class played a significant role in the military defense of the Grand Duchy of Lithuania.","translation":"バイェマン階級は、リトアニア大公国の軍事防衛において重要な役割を果たしました。","type":"noun","meaning_category":"historical social class"},{"sentence":"Many Byeman families traced their lineage back to ancient noble houses.","translation":"多くのバイェマン家は、その家系を古代の貴族の家にまで遡ることができました。","type":"noun","meaning_category":"historical social class"}]}