{"word":"Macrouridae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ソコダラ科","english_definition":"The family of grenadiers or rattails, deep-sea ray-finned fish, part of the order Gadiformes.","examples":[{"sentence":"The Macrouridae family includes many species of deep-sea fish.","translation":"ソコダラ科には多くの深海魚が含まれています。"}],"collocations":[],"synonyms":["grenadiers","rattails"],"antonyms":[]}],"etymology":{"value":"From the genus name *Macrourus* (now a synonym of *Coryphaenoides*) + -idae (standard suffix for animal families). *Macrourus* is derived from Greek *makros* (long) + *oura* (tail), referring to the long, tapering tail characteristic of these fish.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmækruˈraɪdiː/","syllables":"Mac-rou-ri-dae"},"inflection":{"noun_plural":"Macrouridae (same form for singular and plural)"},"usage_notes":{"explanation":"*Macrouridae* is a scientific term used in ichthyology (the study of fish). It refers specifically to the biological family of grenadiers or rattails. When discussing these fish in a more general context, the common names 'grenadiers' or 'rattails' are often used.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["macrourid (adjective, relating to the Macrouridae family); macrourin (subfamily within Macrouridae, though classifications can vary)"],"other_related_terms":["Gadiformes (the order to which Macrouridae belongs)","Teleostei (the infraclass of bony fishes to which Macrouridae belongs)","Coryphaenoides (a common genus within Macrouridae)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term *Macrouridae* is highly technical and specific to the field of marine biology, particularly ichthyology. Understanding this term requires familiarity with the Linnaean taxonomy system and a background in zoology or a related scientific discipline. The common names 'grenadiers' or 'rattails' are more accessible for general audiences."},"example_sentences":[{"sentence":"*Macrouridae* are characterized by their long, tapering tails and deep-sea habitats.","translation":"ソコダラ科は、長く先細りの尾と深海生息地を特徴としています。","type":"scientific","meaning_category":"general description"},{"sentence":"Several studies have investigated the biodiversity of *Macrouridae* in the Atlantic Ocean.","translation":"いくつかの研究では、大西洋におけるソコダラ科の生物多様性が調査されています。","type":"scientific","meaning_category":"research context"},{"sentence":"The taxonomy of *Macrouridae* is complex, with ongoing revisions of genera and species.","translation":"ソコダラ科の分類は複雑で、属や種の改訂が継続的に行われています。","type":"scientific","meaning_category":"taxonomy"}]}