{"word":"GSR","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ガスタービン発電機 (Gas turbine power generator)","english_definition":"An electrical generator driven by a gas turbine.","examples":[{"sentence":"The GSR provides electricity to the remote facility.","translation":"そのガスタービン発電機は、遠隔地の施設に電力を供給します。"}],"collocations":["GSR maintenance","GSR efficiency"],"synonyms":["gas turbine generator"],"antonyms":[]},{"part_of_speech":"noun","definition":"皮膚電気反射 (Galvanic Skin Response)","english_definition":"A change in the electrical resistance of the skin, associated with autonomic activity.","examples":[{"sentence":"The GSR was measured to assess the participant's stress level.","translation":"参加者のストレスレベルを評価するために皮膚電気反射が測定されました。"}],"collocations":["GSR sensor","GSR measurement"],"synonyms":["electrodermal activity (EDA)","skin conductance response (SCR)"],"antonyms":[]}],"etymology":{"value":"Acronym for either 'Gas turbine power generator' or 'Galvanic Skin Response'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌdʒiːˌɛsˈɑːr/","syllables":"G-S-R"},"inflection":{},"usage_notes":{"explanation":"'GSR' can refer to either a gas turbine power generator or galvanic skin response, depending on the context. In engineering or power generation contexts, it likely refers to a gas turbine power generator. In psychology, neuroscience, or medical contexts, it likely refers to galvanic skin response.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"Advanced","text":"The acronym 'GSR' has two common meanings: Gas Turbine power generator and Galvanic Skin Response. The meaning depends heavily on the context in which it is used. If the context is related to power generation or engineering, it refers to a gas turbine power generator. If the context is related to psychology, neuroscience, or medicine, it refers to galvanic skin response. Understanding the context is crucial for correct interpretation."},"example_sentences":[{"sentence":"The new GSR will increase the plant's power output.","translation":"新しいガスタービン発電機は、プラントの発電量を増加させるでしょう。","type":"noun","meaning_category":"ガスタービン発電機"},{"sentence":"The GSR data showed a significant increase during the stressful task.","translation":"皮膚電気反射のデータは、ストレスのかかるタスク中に大幅な増加を示しました。","type":"noun","meaning_category":"皮膚電気反射"}]}