{"word":"cyclothyme","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"気分循環性障害、軽躁とうつ病を繰り返す比較的軽度の気分障害","english_definition":"a relatively mild mood disorder characterized by alternating periods of hypomania and depression","examples":[{"sentence":"People with cyclothymia experience mood swings that are less severe than those with bipolar disorder.","translation":"気分循環性障害の人は、双極性障害の人よりも軽度の気分の変動を経験します。"},{"sentence":"Cyclothymia can sometimes be difficult to diagnose because its symptoms are not as pronounced as those of other mood disorders.","translation":"気分循環性障害は、その症状が他の気分障害ほど顕著ではないため、診断が難しい場合があります。"}],"collocations":["diagnose cyclothymia","treat cyclothymia","symptoms of cyclothymia","live with cyclothymia"],"synonyms":["mood swings","emotional lability","affective disorder"],"antonyms":["euthymia (normal mood)"]}],"etymology":{"value":"From Greek 'kyklos' (circle) + 'thymos' (mood, spirit).","priority":"★★★"},"pronunciation":{"ipa":"/ˈsaɪkləˌθaɪm/","syllables":"cy-clo-thyme"},"inflection":{"noun_plural":"cyclothymes"},"usage_notes":{"explanation":"Cyclothymia is a chronic mood disorder characterized by numerous periods of hypomanic symptoms and periods of depressive symptoms, but the symptoms are less severe or of shorter duration than those of bipolar disorder or major depression. It's considered a milder form of bipolar disorder. Diagnosis requires that these mood disturbances persist for at least two years in adults and one year in children and adolescents.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is cyclothymic.","correct":"✓ He has cyclothymia.","note":"'Cyclothymia' is a noun (the name of the disorder). 'Cyclothymic' is an adjective, but it's less commonly used to describe a person. It's more common to say someone 'has cyclothymia' rather than 'is cyclothymic'."},{"incorrect":"✗ Cyclothymia is the same as bipolar disorder.","correct":"✓ Cyclothymia is a milder form of bipolar disorder.","note":"Cyclothymia is related to bipolar disorder but is less severe. The mood swings are less extreme."}],"priority":"★★☆"},"related_words":{"derivatives":["cyclothymic (adjective)"],"phrasal_verbs":[],"related_terms":["bipolar disorder","major depressive disorder","hypomania","dysthymia"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cyclothymia' is a term used in psychology and psychiatry to describe a specific mood disorder. It is characterized by long-term, fluctuating mood disturbances involving periods of hypomanic and depressive symptoms that are not severe enough to meet the criteria for bipolar disorder or major depression. Understanding this term requires knowledge of clinical psychology and mood disorders."},"example_sentences":[{"sentence":"Her persistent mood swings, though not extreme, led to a diagnosis of cyclothymia.","translation":"彼女の持続的な気分の変動は、極端ではないものの、気分循環性障害の診断につながりました。","type":"general","meaning_category":"general"},{"sentence":"Treatment for cyclothymia often involves therapy and, in some cases, medication to stabilize mood.","translation":"気分循環性障害の治療には、多くの場合、セラピーと、場合によっては、気分を安定させるための薬物療法が含まれます。","type":"treatment","meaning_category":"treatment"},{"sentence":"Living with cyclothymia can be challenging, but with proper management, individuals can lead fulfilling lives.","translation":"気分循環性障害を抱えて生きることは困難な場合がありますが、適切な管理により、個人は充実した生活を送ることができます。","type":"coping","meaning_category":"coping"}]}