{"word":"hyperpathia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"痛覚過敏、異常痛覚","english_definition":"An abnormal increased sensitivity to pain. It is different from hyperalgesia, which is an increased sensitivity to stimulation.","examples":[{"sentence":"The patient reported hyperpathia in his left leg.","translation":"患者は左足の痛覚過敏を訴えた。"},{"sentence":"Hyperpathia can be a symptom of nerve damage.","translation":"痛覚過敏は神経損傷の症状である可能性がある。"}],"collocations":["experiencing hyperpathia","diagnosed with hyperpathia","hyperpathia treatment"],"synonyms":["pain hypersensitivity","allodynia","hyperalgesia"],"antonyms":["hypoesthesia","analgesia"]}],"etymology":{"value":"Derived from the Greek words 'hyper' (excessive) and 'pathos' (suffering).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpərˈpæθiə/","syllables":"hy-per-pa-thi-a"},"inflection":{"noun_plural":"hyperpathias"},"usage_notes":{"explanation":"Hyperpathia is a clinical term used to describe an increased or altered sensitivity to pain. It is often associated with nerve damage or dysfunction. The pain experienced may be disproportionate to the stimulus and can be prolonged or delayed. It is important to distinguish hyperpathia from hyperalgesia, which is an increased sensitivity to stimulation, not necessarily pain.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Hyperpathia is the same as normal pain.","correct":"✓ Hyperpathia is an abnormal sensitivity to pain.","note":"Hyperpathia is an increased or altered sensitivity to pain, not normal pain."},{"incorrect":"✗ Hyperpathia is only caused by physical injury.","correct":"✓ Hyperpathia can be caused by nerve damage or dysfunction.","note":"While physical injury can lead to hyperpathia, it is often associated with nerve issues."}],"priority":"★☆☆"},"related_words":{"derivatives":["hyperpathic (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hyperpathia' is a specialized medical term referring to an increased or altered sensitivity to pain, often linked to nerve damage. It's a complex concept, requiring an understanding of medical terminology and pain physiology. It is not a commonly used word outside of medical contexts."},"example_sentences":[{"sentence":"The patient's hyperpathia made even light touch unbearable.","translation":"患者の痛覚過敏は、軽い接触さえ耐え難いものにした。","type":"general","meaning_category":"symptom"},{"sentence":"Diagnosis of hyperpathia requires careful neurological examination.","translation":"痛覚過敏の診断には、慎重な神経学的検査が必要である。","type":"medical","meaning_category":"diagnosis"}]}