{"word":"marmelos","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物) ベンガルカラタチ (Bael)","english_definition":"The bael (Aegle marmelos), also known as Bengal quince, golden apple, holy fruit, bili, or wood apple, is a species of tree native to the Indian subcontinent and Southeast Asia.","examples":[{"sentence":"The marmelos fruit is used in traditional medicine.","translation":"ベンガルカラタチの果実は伝統医学で用いられます。"}],"collocations":["bael fruit","Bengal quince","wood apple"],"synonyms":["Aegle marmelos","bael","Bengal quince","wood apple"],"antonyms":[]}],"etymology":{"value":"Derived from Portuguese 'marmelo' (quince), ultimately from Latin 'melimelum' (a kind of sweet apple), itself from Greek 'melimēlon' (honey-apple). The association with the Bael fruit likely arose due to superficial similarities in appearance or use.","priority":"★★☆"},"pronunciation":{"ipa":"/mɑːrˈmiːlɒs/","syllables":"mar-me-los"},"inflection":{"noun_plural":"marmelos"},"usage_notes":{"explanation":"'Marmelos' is primarily a botanical term referring to the Bael fruit tree, scientifically known as Aegle marmelos. It's not a commonly used word in everyday conversation, but may appear in contexts related to botany, traditional medicine, or South Asian cuisine. The term is somewhat interchangeable with 'bael' or 'Bengal quince', which are more frequently used.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought some marmelos jam.","correct":"✓ I bought some bael fruit jam.","note":"While technically correct, 'marmelos jam' is uncommon. 'Bael fruit jam' is more typical."}],"priority":"★☆☆"},"related_words":{"derivatives":["Aegle marmelos"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Marmelos' is a scientific or botanical term for the Bael fruit tree (Aegle marmelos). It's unlikely to be encountered outside of specialized contexts. Understanding requires familiarity with botanical nomenclature and potentially South Asian flora. The more common term is 'bael fruit'."},"example_sentences":[{"sentence":"Aegle marmelos, commonly known as marmelos or bael, is a medicinal plant.","translation":"一般的にマルメロスまたはバエルとして知られるエグレ・マルメロスは薬用植物です。","type":"noun","meaning_category":"plant"},{"sentence":"The extract of marmelos fruit has shown potential health benefits in some studies.","translation":"マルメロスの果実のエキスは、いくつかの研究で潜在的な健康上の利点を示しています。","type":"noun","meaning_category":"fruit"}]}