{"word":"Tathagata","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"如来（にょらい）","english_definition":"(In Buddhism) The 'Thus-Gone One'; an epithet of the Buddha, signifying one who has 'thus come' and 'thus gone' (i.e., who embodies ultimate reality).","examples":[{"sentence":"The Tathagata taught the Four Noble Truths.","translation":"如来は四聖諦を説いた。"},{"sentence":"Meditating on the nature of the Tathagata can lead to enlightenment.","translation":"如来の本質を瞑想することは、悟りにつながることがある。"}],"collocations":["Tathagata Buddha (如来仏)","the nature of the Tathagata (如来の本質)","the teachings of the Tathagata (如来の教え)"],"synonyms":["Buddha","Enlightened One","Sugata"],"antonyms":[]}],"etymology":{"value":"Sanskrit and Pali term, 'Tathāgata'. 'Tathā' means 'thus' or 'as it is', and 'gata' means 'gone' or 'arrived'. The term signifies one who has realized the true nature of reality and has thus 'gone' beyond suffering or 'arrived' at enlightenment.","priority":"★★☆"},"pronunciation":{"ipa":"/təˈθɑːɡətə/","syllables":"Ta-tha-ga-ta"},"inflection":{"notes":"Singular noun. No plural form typically used."},"usage_notes":{"explanation":"'Tathagata' is a significant title for the Buddha, emphasizing his realization of ultimate truth and his transcendence of the cycle of rebirth. It is often used in Buddhist scriptures and philosophical discussions. While 'Buddha' is a more general term for an enlightened being, 'Tathagata' highlights the Buddha's unique attainment and his role as a guide to liberation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Tathagata is a god in Buddhism.","correct":"✓ The Tathagata is an epithet of the Buddha in Buddhism.","note":"The Tathagata is not a god, but a title for the Buddha, who is a human being who achieved enlightenment."}],"priority":"★★☆"},"related_words":{"derivatives":["Tathagatagarbha (如来蔵: The womb or essence of the Tathagata; the potential for Buddhahood within all beings.)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency (in general English); higher frequency in Buddhist texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Tathagata' is a highly specialized term within Buddhist philosophy. Understanding its meaning requires familiarity with core Buddhist concepts such as enlightenment, the nature of reality, and the transcendence of suffering. It is primarily encountered in religious or philosophical contexts related to Buddhism. The term's significance lies in its representation of the Buddha's unique attainment and his role as a guide to liberation from the cycle of rebirth."},"example_sentences":[{"sentence":"The sutra describes the qualities of the Tathagata.","translation":"その経典は如来の特質を記述している。","type":"noun","meaning_category":"如来 (epithet of the Buddha)"},{"sentence":"Through meditation, one can come to understand the true meaning of the Tathagata's teachings.","translation":"瞑想を通して、人は如来の教えの真の意味を理解することができる。","type":"noun","meaning_category":"如来 (epithet of the Buddha)"}]}