{"word":"Praetorianism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"親衛隊政治、軍閥政治：軍隊が政治に過度に介入し、政府を支配または影響力を行使する政治体制。","english_definition":"A political system in which the military has excessive influence in politics, controlling or exerting influence over the government.","examples":[{"sentence":"The country suffered from praetorianism after the coup, with generals holding key government positions.","translation":"クーデター後、その国は親衛隊政治に苦しみ、将軍たちが政府の要職を占めた。"},{"sentence":"Historians often describe the late Roman Empire as a period of praetorianism.","translation":"歴史家はしばしば、後期ローマ帝国を親衛隊政治の時代として記述する。"}],"collocations":["military rule","political instability","coup d'état","authoritarianism"],"synonyms":["militarism","stratocracy","military dictatorship"],"antonyms":["democracy","civilian rule"]},{"part_of_speech":"noun","definition":"（比喩的に）特定の集団や組織が、本来の役割を超えて過大な影響力を行使すること。","english_definition":"(Figuratively) A situation where a particular group or organization exerts excessive influence beyond its intended role.","examples":[{"sentence":"Some argue that the power of lobbyists in Washington represents a form of modern praetorianism.","translation":"ワシントンのロビイストの権力は、現代の親衛隊政治の一形態であると主張する人もいる。"},{"sentence":"The excessive influence of the tech industry on policy decisions could be seen as a type of praetorianism.","translation":"政策決定に対するテクノロジー業界の過度の影響力は、一種の親衛隊政治と見なされる可能性がある。"}],"collocations":["lobbying","special interests","political influence","corporate power"],"synonyms":["influence peddling","undue influence","power grab"],"antonyms":["checks and balances","accountability"]}],"etymology":{"value":"「Praetorian」は、古代ローマの皇帝の警護隊である「Praetorian Guard（親衛隊）」に由来する。親衛隊はしばしば政治に介入し、皇帝の擁立や廃位に関与したため、「Praetorianism」は軍隊が政治を支配する状態を指すようになった。","priority":"★★☆"},"pronunciation":{"ipa":"/priːˈtɔːriənɪzəm/","syllables":"pree-TOH-ree-uh-niz-uhm"},"inflection":{"notes":"名詞（不可算名詞）"},"usage_notes":{"explanation":"「**Praetorianism**」は、主に政治学や歴史学で使用される専門用語であり、日常会話ではまれ。軍事クーデターや軍事政権の成立など、軍隊が政治に深く関与する状況を批判的に表現する際に用いられる。比喩的には、特定の利益団体や組織が政治に過剰な影響力を行使する状況を指すこともある。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The praetorianism of the country led to economic prosperity.","correct":"✓ The praetorianism of the country led to political instability.","note":"親衛隊政治は通常、政治的不安定や権威主義体制と関連付けられる。経済的繁栄をもたらすとは限らない。"},{"incorrect":"✗ Praetorianism is a good form of government.","correct":"✓ Praetorianism is generally considered a negative phenomenon in politics.","note":"親衛隊政治は、民主主義からの逸脱と見なされることが多く、一般的に良い政治体制とは見なされない。"}],"priority":"★☆☆"},"related_words":{"derivatives":["Praetorian (形容詞/名詞：親衛隊の、親衛隊員)","Praetorian Guard (名詞：親衛隊)"],"related_concepts":["coup d'état","military junta","authoritarianism","oligarchy","kleptocracy"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Praetorianism**」は、軍隊が政府を支配したり、強い影響力を持ったりする政治体制を指す専門用語です。これは、古代ローマの皇帝警護隊である「Praetorian Guard」が政治に介入した歴史に由来します。現代では、軍事クーデターや軍事政権など、軍隊が政治を不安定にする状況を説明する際に使われます。また、比喩的に、特定の組織や団体が政治に過剰な影響力を行使する状況を指すこともあります。政治学や歴史学の文脈で使われることが多く、日常会話ではほとんど使われません。"},"example_sentences":[{"sentence":"The rise of **praetorianism** in the nation led to widespread corruption and human rights abuses.","translation":"その国における親衛隊政治の台頭は、広範囲にわたる汚職と人権侵害につながった。","type":"noun","meaning_category":"軍隊の政治支配"},{"sentence":"Some scholars argue that the increasing power of intelligence agencies represents a form of modern **praetorianism**.","translation":"一部の学者は、情報機関の権力増大は現代の親衛隊政治の一形態であると主張する。","type":"noun","meaning_category":"特定の組織の過剰な影響力"}]}