{"word":"Un-socratic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ソクラテス的でない、ソクラテスの方法や哲学に反する","english_definition":"Not characteristic of or relating to Socrates or his methods of inquiry; contrary to Socratic principles.","examples":[{"sentence":"His teaching style was decidedly un-Socratic, relying on lecturing rather than dialogue.","translation":"彼の教え方は明らかにソクラテス的ではなく、対話よりも講義に頼っていた。"},{"sentence":"The authoritarian approach was un-Socratic in its suppression of questioning.","translation":"その権威主義的なアプローチは、質問を抑圧するという点でソクラテス的ではなかった。"}],"collocations":["un-Socratic method","un-Socratic approach","un-Socratic teaching"],"synonyms":["non-Socratic","anti-Socratic"],"antonyms":["Socratic"]},{"part_of_speech":"adjective","definition":"ソクラテスの哲学や教えに精通していない、理解していない","english_definition":"Lacking understanding or familiarity with the philosophy or teachings of Socrates.","examples":[{"sentence":"Many modern discussions of ethics are un-Socratic in their assumptions.","translation":"現代の倫理に関する議論の多くは、その前提においてソクラテス的ではない。"},{"sentence":"The student's essay revealed an un-Socratic view of knowledge.","translation":"その学生のエッセイは、知識に対するソクラテス的でない見方を明らかにした。"}],"collocations":["un-Socratic view","un-Socratic understanding"],"synonyms":["ignorant of Socratic philosophy"],"antonyms":["knowledgeable about Socratic philosophy"]}],"etymology":{"value":"接頭辞 \"un-\" (否定) + \"Socratic\" (ソクラテスの、ソクラテス的な)","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌn.sɒˈkræt.ɪk/","syllables":"Un-soc-rat-ic"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありますが、一般的ではありません。"},"usage_notes":{"explanation":"\"Un-socratic\" は、ソクラテスの哲学、特に彼の対話を通じた探求方法や、無知の自覚を重視する姿勢から逸脱している状況や考え方を指すために使用されます。教育、倫理、哲学の文脈でよく見られます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The method was unsocratic because it was easy.","correct":"✓ The method was un-Socratic because it did not encourage critical thinking.","note":"ソクラテス的な方法の反対は、単に簡単であることではなく、批判的思考や探求を促さないことです。"},{"incorrect":"✗ He was unsocratic in his appearance.","correct":"✓ His ideas were un-Socratic.","note":"\"Un-Socratic\" は通常、外見ではなく、思想、方法、アプローチを指します。"}],"priority":"★★☆"},"related_words":{"derivatives":["Socratic","Socratically","Socratism"],"related_concepts":["Socratic method","Socratic irony","Socratic dialogue","elenchus"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"un-Socratic\" is a relatively uncommon term used to describe something that is contrary to the principles or methods associated with the ancient Greek philosopher Socrates. This typically refers to approaches that do not involve critical questioning, dialogue, or the pursuit of knowledge through self-examination and intellectual humility. It is most often encountered in academic or philosophical contexts when discussing educational or ethical theories. Understanding the term requires familiarity with Socratic philosophy.","priority":"★★☆"},"example_sentences":[{"sentence":"The teacher's dogmatic style was considered un-Socratic by many of the students.","translation":"その教師の独断的なスタイルは、多くの学生によってソクラテス的ではないと見なされた。","type":"adjective","meaning_category":"ソクラテス的でない"},{"sentence":"The politician's speech was filled with assertions, making it decidedly un-Socratic.","translation":"その政治家の演説は断定に満ちており、明らかにソクラテス的ではなかった。","type":"adjective","meaning_category":"ソクラテス的でない"},{"sentence":"An un-Socratic approach to education emphasizes rote memorization over critical thinking.","translation":"教育に対するソクラテス的でないアプローチは、批判的思考よりも丸暗記を重視する。","type":"adjective","meaning_category":"ソクラテス的でない"}]}