{"word":"solvent-dispersed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"溶媒分散された","english_definition":"Describes a substance or material that is finely distributed or scattered throughout a solvent.","examples":[{"sentence":"The pigment was solvent-dispersed to ensure even color distribution in the paint.","translation":"顔料は、塗料中の均一な色分布を確実にするために溶媒分散された。"},{"sentence":"Solvent-dispersed nanoparticles are used in various applications, including coatings and inks.","translation":"溶媒分散されたナノ粒子は、コーティングやインクを含む様々な用途で使用される。"}],"collocations":["solvent-dispersed pigment","solvent-dispersed nanoparticles","solvent-dispersed system","solvent-dispersed coating"],"synonyms":["solvent-borne","solvent-based","dispersed in solvent"],"antonyms":["water-dispersed","water-borne","aqueous-based"]}],"etymology":{"value":"Combination of 'solvent' (a substance that dissolves another) and 'dispersed' (scattered or distributed).","priority":"N/A"},"pronunciation":{"ipa":"N/A","syllables":"sol-vent-dis-persed"},"inflection":{"notes":"Adjective, no inflection."},"usage_notes":{"explanation":"'Solvent-dispersed' describes a state where a substance, often a solid, is finely distributed within a liquid solvent. This is commonly achieved through mechanical mixing, sonication, or the use of dispersing agents to prevent agglomeration. The term is frequently used in the context of paints, coatings, inks, and other industrial applications where uniform distribution of components is crucial.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["dispersion","solvent","disperse"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'solvent-dispersed' is technical and typically encountered in scientific or industrial contexts. It implies that a material is not merely dissolved in a solvent but is present as fine particles evenly distributed throughout the solvent. Understanding requires knowledge of chemistry and materials science."},"example_sentences":[{"sentence":"The solvent-dispersed graphene improved the conductivity of the composite material.","translation":"溶媒分散されたグラフェンは、複合材料の導電性を向上させた。","type":"adjective","meaning_category":"describing a material"},{"sentence":"Careful control of the solvent-dispersed process is essential for achieving optimal performance.","translation":"最適な性能を達成するためには、溶媒分散プロセスの慎重な制御が不可欠である。","type":"adjective","meaning_category":"describing a process"}]}