{"word":"goniochromism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"虹彩現象、構造色","english_definition":"The phenomenon where a material's color varies depending on the angle of viewing; iridescence.","examples":[{"sentence":"The butterfly's wings exhibit goniochromism, displaying different colors as the viewing angle changes.","translation":"その蝶の羽は虹彩現象を示し、見る角度によって異なる色を表示します。"},{"sentence":"Goniochromism is often observed in opals and certain types of fish scales.","translation":"虹彩現象は、オパールや特定の種類の魚の鱗でよく観察されます。"}],"collocations":["exhibit goniochromism","display goniochromism","observe goniochromism"],"synonyms":["iridescence","opalescence","color change with angle"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'gonia' (angle) and 'chroma' (color), combined with the suffix '-ism' (a condition or phenomenon).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡɒniəˈkroʊmɪzəm/","syllables":"go-ni-o-chro-mism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Goniochromism is a scientific term used to describe the phenomenon of color change with viewing angle. It differs from simple color changes due to pigments, as it arises from the structure of the material itself. This structural coloration is caused by interference, diffraction, or scattering of light.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["goniochromatic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Very low frequency - specialized scientific term.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Goniochromism' is a specialized term used in physics, optics, and materials science to describe the phenomenon of angle-dependent color variation. It is typically encountered in scientific contexts when discussing structural coloration in natural or synthetic materials. Understanding the term requires familiarity with concepts of light interference, diffraction, and scattering.","priority":"★★☆"},"example_sentences":[{"sentence":"The researchers studied the goniochromism of the synthetic material under different lighting conditions.","translation":"研究者たちは、異なる照明条件下で合成材料の虹彩現象を研究しました。","type":"noun","meaning_category":"虹彩現象"},{"sentence":"The vibrant goniochromism of the beetle's exoskeleton is a result of its complex surface structure.","translation":"その甲虫の外骨格の鮮やかな虹彩現象は、その複雑な表面構造の結果です。","type":"noun","meaning_category":"虹彩現象"}]}