{"word":"normaliser","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(主にイギリス英語) 標準化するもの、正常化するもの、均質化するもの","english_definition":"(chiefly British English) Something that normalizes; a device or process that brings something to a standard or normal condition.","examples":[{"sentence":"The new regulations acted as a normaliser, ensuring fair practices across the industry.","translation":"新しい規制は、業界全体の公正な慣行を保証する標準化装置として機能した。"},{"sentence":"The software includes a normaliser to ensure data consistency.","translation":"そのソフトウェアには、データの一貫性を保証するための標準化機能が含まれている。"}],"collocations":["data normaliser","signal normaliser","cultural normaliser"],"synonyms":["standardizer","equalizer","regulator","homogenizer"],"antonyms":["disruptor","irregularity"]},{"part_of_speech":"noun","definition":"(冶金学) 焼ならし炉","english_definition":"(metallurgy) A furnace used for normalizing metal.","examples":[{"sentence":"The steel was treated in the normaliser to improve its strength and ductility.","translation":"鋼は強度と延性を向上させるために焼ならし炉で処理された。"}],"collocations":["steel normaliser"],"synonyms":["annealing furnace"],"antonyms":[]}],"etymology":{"value":"'Normalise' + '-er'.  'Normalise' from 'normal' + '-ise/ize'.","priority":"★★☆"},"pronunciation":{"ipa":"ˈnɔːməlaɪzə(r)","syllables":"nor-ma-li-ser"},"inflection":{"noun_plural":"normalisers"},"usage_notes":{"explanation":"The term 'normaliser' is primarily used in British English. In American English, 'normalizer' is the more common spelling. The word refers to something that brings a system, data, or process into a standard or normal state. In metallurgy, it refers to a specific type of furnace used for heat treating metals.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The normaliser was used to disrupt the data.","correct":"✓ The normaliser was used to standardize the data.","note":"A normaliser is used to standardize or normalize data, not to disrupt it."}],"priority":"★★☆"},"related_words":{"derivatives":["normalise","normalize","normal","normalisation","normalization"],"related_terms":["standard","standardise","standardize"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Normaliser' is a noun that refers to something that brings things to a standard or normal condition. It can be used in contexts such as data processing, where it refers to a tool that ensures data consistency, or in metallurgy, where it refers to a furnace used to normalize metal. The word is more common in British English, with 'normalizer' being the preferred spelling in American English."},"example_sentences":[{"sentence":"The data normaliser ensured that all entries conformed to the required format.","translation":"データノーマライザは、すべてのエントリが必要な形式に準拠していることを保証しました。","type":"noun","meaning_category":"standardization"},{"sentence":"The metal was processed through the normaliser to relieve internal stresses.","translation":"金属は内部応力を緩和するために焼ならし炉で処理されました。","type":"noun","meaning_category":"metallurgy"}]}