{"word":"savine","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"イブキビャクシン (Juniperus sabina)","english_definition":"An evergreen shrub, Juniperus sabina, of the cypress family, with scale-like leaves and bluish-black berries.","examples":[{"sentence":"Savine is sometimes planted as an ornamental shrub.","translation":"イブキビャクシンは、観賞用低木として植えられることがあります。"},{"sentence":"The leaves of savine are known to be poisonous.","translation":"イブキビャクシンの葉は有毒であることが知られています。"}],"collocations":["savine oil","Juniperus sabina","ornamental shrub"],"synonyms":["dwarf juniper","creeping juniper"],"antonyms":[]},{"part_of_speech":"noun","definition":"サビン油 (savine oil)","english_definition":"An essential oil obtained from savine, formerly used medicinally as an abortifacient.","examples":[{"sentence":"Savine oil was once used to induce abortions, but is now considered dangerous.","translation":"サビン油はかつて堕胎を誘発するために使用されていましたが、現在では危険であると考えられています。"},{"sentence":"The use of savine oil as a medicine is now largely obsolete.","translation":"サビン油の薬としての使用は、現在ではほとんど廃止されています。"}],"collocations":["essential oil","abortifacient","toxic substance"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Middle English savine, from Old French savine, from Latin sabina, from Sabina, a region in Italy where the plant was said to grow.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsævɪn/","syllables":"sav-ine"},"inflection":{"noun_plural":"savines"},"usage_notes":{"explanation":"'Savine' refers both to the plant *Juniperus sabina* and the oil extracted from it. The oil is highly toxic and was historically used (dangerously) as an abortifacient. Modern usage primarily refers to the plant in botanical contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used savine to cure my cold.","correct":"✓ I used other herbal remedies to cure my cold.","note":"Savine is toxic and not used as a common cold remedy."},{"incorrect":"✗ Savine is a type of pine tree.","correct":"✓ Savine is a type of juniper.","note":"Savine belongs to the juniper family, not the pine family."}],"priority":"★★☆"},"related_words":{"derivatives":["savina (related plant species)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"None (specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Savine' is a specialized term referring to a specific plant species (*Juniperus sabina*) and its oil. It is not commonly used in everyday language and is more likely to be encountered in botanical or historical contexts, particularly when discussing traditional medicine or poisonous plants. Due to its toxicity, it's important to understand that savine and its oil are not safe for consumption or use in home remedies."},"example_sentences":[{"sentence":"The botanical garden featured a rare specimen of **savine**.","translation":"植物園には珍しいイブキビャクシンの標本がありました。","type":"noun","meaning_category":"plant"},{"sentence":"Historically, **savine** oil was dangerously used for abortions.","translation":"歴史的に、サビン油は危険な堕胎薬として使用されていました。","type":"noun","meaning_category":"oil"}]}