{"word":"Lusatia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ルサティア (ドイツ東部とポーランド、チェコにまたがる地域)","english_definition":"A historical region in Central Europe, split between Germany (Saxony and Brandenburg) and Poland (Lower Silesia and Lubusz), with small parts belonging to the Czech Republic. It is the homeland of the Sorbian people.","examples":[{"sentence":"Lusatia is known for its unique Sorbian culture.","translation":"ルサティアは、その独特なソルブ文化で知られています。"},{"sentence":"The Lusatian language is still spoken in some parts of the region.","translation":"ルサティア語は、この地域の一部で今も話されています。"}],"collocations":["Upper Lusatia","Lower Lusatia","Sorbian Lusatia"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Sorbian Łužica, derived from Proto-Slavic *lužьnica, meaning 'swampy meadow, floodplain'.","priority":"★★☆"},"pronunciation":{"ipa":"/luːˈseɪʃə/","syllables":"Lu-sa-ti-a"},"inflection":{"notes":"Proper noun, no plural form."},"usage_notes":{"explanation":"Lusatia is a historical region inhabited by the Sorbian people. It's divided between Germany, Poland and Czech Republic. It is known for its unique culture and language.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Lusatian (adjective, noun)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"Lusatia is a region in Central Europe, primarily located in eastern Germany and parts of Poland and the Czech Republic. It's notable as the homeland of the Sorbian people, a West Slavic ethnic group with their own language and culture. The region has a complex history, having been under various rulers and kingdoms over the centuries. Understanding Lusatia requires knowledge of Central European history and minority cultures."},"example_sentences":[{"sentence":"The cultural heritage of Lusatia is carefully preserved in local museums.","translation":"ルサティアの文化遺産は、地元の博物館で大切に保存されています。","type":"noun","meaning_category":"region"},{"sentence":"Many people in Lusatia still speak Sorbian alongside German or Polish.","translation":"ルサティアの多くの人々は、ドイツ語またはポーランド語に加えて、今もソルブ語を話します。","type":"noun","meaning_category":"region"}]}