{"word":"uninfectiousness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"非感染性、感染力がないこと","english_definition":"The state or quality of not being infectious; inability to transmit a disease or infection.","examples":[{"sentence":"The patient's uninfectiousness allowed them to return to work without posing a risk.","translation":"その患者の非感染性により、リスクを冒すことなく仕事に復帰することができた。"},{"sentence":"Scientists are studying factors that contribute to the uninfectiousness of certain viruses.","translation":"科学者たちは、特定のウイルスの非感染性に寄与する要因を研究している。"}],"collocations":["demonstrate uninfectiousness","confirm uninfectiousness","achieve uninfectiousness"],"synonyms":["non-infectivity","non-contagiousness"],"antonyms":["infectiousness","contagiousness"]}],"etymology":{"value":"Derived from \"infectious\" (capable of causing infection) with the prefix \"un-\" (not) and the suffix \"-ness\" (state or quality).","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnɪnˈfɛkʃəsnəs/","syllables":"un-in-fec-tious-ness"},"inflection":{"noun_plural":"uninfectiousnesses (rarely used)"},"usage_notes":{"explanation":"\"Uninfectiousness\" refers to the condition where an individual or substance is incapable of transmitting an infectious agent. It is often used in medical and scientific contexts to describe the state of a patient after treatment or the properties of a non-contagious disease.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The uninfectiousness is very high.","correct":"✓ The level of uninfectiousness is very high.","note":"\"Uninfectiousness\" is a state or quality, so it's more accurate to describe its level or degree rather than saying it is \"high\" directly."}],"priority":"★★☆"},"related_words":{"derivatives":["uninfectious (adjective)","infectious (adjective)","infectiousness (noun)","infect (verb)","infection (noun)"],"antonyms":["infectiousness"],"related_terms":["viral load","transmission rate","incubation period","quarantine","isolation"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in scientific or medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Uninfectiousness\" is a technical term primarily used in medical and scientific contexts. It describes the state of not being able to transmit an infectious disease. Understanding this term requires familiarity with basic concepts of infectious diseases and scientific terminology. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The study aimed to determine the point at which patients achieved uninfectiousness.","translation":"その研究は、患者が非感染性を達成する時点を特定することを目的としていた。","type":"general","meaning_category":"General Use"},{"sentence":"Vaccination significantly contributes to the uninfectiousness of the population.","translation":"ワクチン接種は、人口の非感染性に大きく貢献する。","type":"medical","meaning_category":"Medical Context"},{"sentence":"The uninfectiousness of the treated water was confirmed through laboratory testing.","translation":"処理された水の非感染性は、実験室での試験を通じて確認された。","type":"scientific","meaning_category":"Scientific Context"}]}