{"word":"voice-disabled","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"音声によるコミュニケーションが困難な、または不可能な状態にある","english_definition":"Having a disability that affects the ability to speak or communicate verbally.","examples":[{"sentence":"The organization provides assistive technology for voice-disabled individuals.","translation":"その団体は、音声によるコミュニケーションが困難な人々に対して支援技術を提供しています。"},{"sentence":"Voice-disabled users can benefit from text-to-speech software.","translation":"音声によるコミュニケーションが困難なユーザーは、テキスト読み上げソフトウェアの恩恵を受けることができます。"},{"sentence":"The app was designed to help voice-disabled patients communicate with their caregivers.","translation":"そのアプリは、音声によるコミュニケーションが困難な患者が介護者とコミュニケーションを取るのを支援するために設計されました。"}],"collocations":["assistive technology for voice-disabled","voice-disabled users","voice-disabled patients"],"synonyms":["speech-impaired","non-verbal","unable to speak","mute"],"antonyms":["able-bodied","verbal","vocal"],"notes":"This term is often preferred over older terms like 'mute' because it is more descriptive and less stigmatizing."}],"etymology":{"value":"A compound word formed by combining 'voice' (referring to the ability to speak) with 'disabled' (having a physical or mental condition that limits movements, senses, or activities).","priority":"★★★"},"pronunciation":{"ipa":"/ˈvɔɪsˌdɪsˈeɪbəld/","syllables":"voice-dis-a-bled"},"inflection":{"notes":"This is an adjective, so it does not inflect for number or gender."},"usage_notes":{"explanation":"The term 'voice-disabled' is used to describe individuals who have difficulty or are unable to communicate verbally due to a disability. This can be caused by a variety of conditions, including but not limited to cerebral palsy, autism, stroke, or laryngectomy. It is important to use respectful and accurate language when referring to individuals with disabilities.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ a voice disabled","correct":"✓ a voice-disabled person/individual","note":"It's more appropriate to use 'voice-disabled' as an adjective modifying a noun (e.g., person, individual, user) rather than as a noun itself."}],"priority":"★★☆"},"related_words":{"derivatives":["disability","disabled","voice"],"related_terms":["AAC (Augmentative and Alternative Communication)","assistive technology","speech therapy"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - This term is relatively specialized and not commonly found in general texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Voice-disabled' is a term used to describe someone who has a disability that makes it hard or impossible for them to speak. It's a more respectful and descriptive way to refer to people who might have been called 'mute' in the past. If you're talking about technology or services for people who can't speak, you might use this word. It's important to remember that language should be respectful and accurate when talking about disabilities."},"example_sentences":[{"sentence":"The conference included a session on accessible communication for **voice-disabled** attendees.","translation":"その会議には、音声によるコミュニケーションが困難な参加者のためのアクセシブルなコミュニケーションに関するセッションが含まれていました。","type":"adjective","meaning_category":"Describing a person with a speech disability"},{"sentence":"Many **voice-disabled** individuals rely on augmentative and alternative communication (AAC) devices.","translation":"多くの音声によるコミュニケーションが困難な人々は、拡大代替コミュニケーション（AAC）デバイスに頼っています。","type":"adjective","meaning_category":"Describing a person with a speech disability"},{"sentence":"The study examined the effectiveness of different communication strategies for **voice-disabled** children.","translation":"その研究では、音声によるコミュニケーションが困難な子供たちのためのさまざまなコミュニケーション戦略の有効性を調査しました。","type":"adjective","meaning_category":"Describing a person with a speech disability"}]}