{"word":"HOLC","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"Home Owners' Loan Corporation (住宅所有者貸付公社)","english_definition":"A U.S. federal agency established in 1933 as part of the New Deal to help stabilize real estate values and refinance mortgages during the Great Depression.","examples":[{"sentence":"The HOLC played a significant role in shaping urban development in the United States.","translation":"住宅所有者貸付公社は、アメリカ合衆国の都市開発を形成する上で重要な役割を果たした。"}],"collocations":["HOLC maps","HOLC lending practices","HOLC redlining"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"An acronym for **H**ome **O**wners' **L**oan **C**orporation.","priority":"★★★"},"pronunciation":{"ipa":"/ˈhoʊlk/","syllables":"HOLC (one syllable)"},"inflection":{"notes":"It is a proper noun, so it doesn't have plural forms."},"usage_notes":{"explanation":"The **Home Owners' Loan Corporation (HOLC)** was a government-sponsored corporation created in 1933 as part of President Franklin D. Roosevelt's New Deal. Its primary purpose was to assist homeowners who were at risk of losing their homes due to foreclosure during the Great Depression. The HOLC is most known for creating 'residential security maps' that rated neighborhoods based on perceived lending risk. These maps are associated with the practice of redlining, where neighborhoods with large minority populations were often deemed high-risk and denied mortgage loans and other services.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["redlining"],"phrasal_verbs":[],"related_organizations":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily in historical and academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"**HOLC** stands for Home Owners' Loan Corporation. It was a U.S. government agency created during the Great Depression to help people keep their homes. The HOLC made maps that showed which neighborhoods were safe for banks to lend money to. These maps are now known for contributing to 'redlining,' a practice where certain areas, often with minority residents, were denied loans and services. Understanding HOLC is important for understanding the history of housing discrimination in the United States."},"example_sentences":[{"sentence":"The HOLC was created to help homeowners avoid foreclosure during the Great Depression.","translation":"住宅所有者貸付公社は、大恐慌時代に住宅所有者が差し押さえを避けるのを支援するために設立された。","type":"historical context","meaning_category":"historical context"},{"sentence":"HOLC maps are now studied to understand the historical roots of redlining.","translation":"住宅所有者貸付公社の地図は、現在、レッドライニングの歴史的ルーツを理解するために研究されている。","type":"contemporary relevance","meaning_category":"contemporary relevance"}]}