{"word":"holies","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)聖なる場所、聖域、最も神聖な場所","english_definition":"(plural) sacred places; sanctuaries; the most sacred places.","examples":[{"sentence":"These mountains are considered holies by the local people.","translation":"これらの山々は地元の人々によって聖地とみなされています。"},{"sentence":"The inner sanctum was one of the holies in the temple.","translation":"奥の聖域は寺院の中で最も神聖な場所の一つでした。"}],"collocations":["the holies of holies (至聖所)"],"synonyms":["sanctuaries","sacred places","shrines","temples","holy places"],"antonyms":["profane places","secular places"]}],"etymology":{"value":"'holies' is the plural form of 'holy'. 'Holy' comes from the Old English word 'hālig', meaning 'holy, consecrated, sacred; saintly; worthy of worship'. It is derived from Proto-Germanic *hailagaz, meaning 'whole, uninjured, safe; holy'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhoʊliz/","syllables":"ho-lies"},"inflection":{"noun_plural":"holies"},"usage_notes":{"explanation":"'Holies' refers to multiple places that are considered sacred or of religious importance. It is often used to describe areas within a temple, church, or other religious structure that are considered the most sacred. It can also refer to natural locations that are considered holy by a particular group of people.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The holy is a place of worship.","correct":"✓ The holy place is a place of worship. / ✓ The holies are places of worship.","note":"'Holy' is an adjective, so it needs to be followed by a noun such as 'place'. 'Holies' is a plural noun, so it should be used when referring to multiple sacred places."}],"priority":"★☆☆"},"related_words":{"derivatives":["holy (adjective: sacred, consecrated)","holiness (noun: the state of being holy)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'holies' is a relatively uncommon term, primarily used in religious or historical contexts to refer to multiple sacred places. Understanding its meaning requires familiarity with religious terminology and the concept of sacred spaces. It is not typically encountered in everyday conversation or general reading materials."},"example_sentences":[{"sentence":"Pilgrims traveled to the holies to seek spiritual enlightenment.","translation":"巡礼者たちは精神的な啓示を求めて聖地を巡った。","type":"noun","meaning_category":"sacred places"},{"sentence":"The ancient texts described the holies and their significance.","translation":"古代の文献は聖地とその重要性について記述していた。","type":"noun","meaning_category":"sacred places"},{"sentence":"The preservation of the holies is crucial for maintaining cultural heritage.","translation":"聖地の保全は文化遺産を維持するために不可欠である。","type":"noun","meaning_category":"sacred places"}]}