{"word":"resistance-training","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"レジスタンストレーニング、抵抗運動","english_definition":"exercise that causes the muscles to contract against an external resistance (in the form of free weights, weight machines, or body weight) with the expectation of increases in strength, tone, mass, and/or endurance.","examples":[{"sentence":"Resistance-training is an effective way to build muscle strength.","translation":"レジスタンストレーニングは、筋力をつける効果的な方法です。"},{"sentence":"She incorporates resistance-training into her fitness routine three times a week.","translation":"彼女は週に3回、レジスタンストレーニングをフィットネスルーチンに取り入れています。"},{"sentence":"The benefits of resistance-training include improved bone density and increased metabolism.","translation":"レジスタンストレーニングの利点には、骨密度の改善や代謝の向上などがあります。"}],"collocations":["strength training","weight training","bodyweight training","resistance exercise","muscle strengthening"],"synonyms":["strength training","weight training","muscle building"],"antonyms":["cardio","aerobic exercise"]},{"part_of_speech":"adjective","definition":"レジスタンストレーニングの、抵抗運動の","english_definition":"relating to or involving exercise that causes the muscles to contract against an external resistance.","examples":[{"sentence":"Resistance-training exercises are important for overall fitness.","translation":"レジスタンストレーニングのエクササイズは、全体的なフィットネスにとって重要です。"},{"sentence":"He specializes in resistance-training programs for athletes.","translation":"彼はアスリート向けのレジスタンストレーニングプログラムを専門としています。"},{"sentence":"The study examined the effects of resistance-training methods on muscle growth.","translation":"その研究では、レジスタンストレーニングの方法が筋肉の成長に与える影響を調べました。"}],"collocations":["resistance-training program","resistance-training exercises","resistance-training methods","resistance-training equipment"],"synonyms":["strength-training","weight-training"],"antonyms":["cardio","aerobic"]}],"etymology":{"value":"The term is formed by combining 'resistance' (the act of opposing or withstanding) with 'training' (the process of being taught a particular skill or type of behavior). It refers to training that involves resisting an external force to build strength and endurance.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈzɪstəns ˈtreɪnɪŋ/","syllables":"re-sis-tance-train-ing"},"inflection":{"notes":"As a noun, it is generally uncountable. The adjective form does not inflect."},"usage_notes":{"explanation":"'Resistance-training' is a broad term encompassing various forms of exercise where muscles work against an opposing force. This can include using free weights (dumbbells, barbells), weight machines, resistance bands, or even one's own body weight (e.g., push-ups, squats). The goal is to increase muscle strength, size, power, and endurance. It's often used interchangeably with 'strength training' and 'weight training,' although 'resistance-training' can be considered a more inclusive term.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I do resistance training every day, but my muscle don't grow.","correct":"✓ I do resistance training every day, but my muscles don't grow.","note":"'Muscle' is a countable noun, so it needs to be pluralized ('muscles'). Also, 'don't' is the correct contraction for 'do not' with a plural subject."},{"incorrect":"✗ Resistance training is only for bodybuilders.","correct":"✓ Resistance training is beneficial for people of all ages and fitness levels.","note":"Resistance training is not exclusive to bodybuilders. It offers numerous health benefits for everyone, including improved bone density, increased metabolism, and better overall fitness."}],"priority":"★★☆"},"related_words":{"derivatives":["resistance (noun)","training (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively common in fitness and health contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Resistance-training' refers to exercises where your muscles work against some kind of force, like weights or your own body. It's a way to get stronger and build muscle. You might hear it called 'strength training' or 'weight training' too. It's not just for athletes; it's good for anyone who wants to improve their fitness and health.","priority":"★★☆"},"example_sentences":[{"sentence":"Regular resistance-training can help prevent age-related muscle loss.","translation":"定期的なレジスタンストレーニングは、加齢に伴う筋肉量の減少を防ぐのに役立ちます。","type":"noun","meaning_category":"筋力トレーニング"},{"sentence":"The athlete's resistance-training routine included squats, deadlifts, and bench presses.","translation":"そのアスリートのレジスタンストレーニングルーチンには、スクワット、デッドリフト、ベンチプレスが含まれていました。","type":"noun","meaning_category":"筋力トレーニング"},{"sentence":"A well-designed resistance-training program should target all major muscle groups.","translation":"適切に設計されたレジスタンストレーニングプログラムは、すべての主要な筋肉群をターゲットにする必要があります。","type":"adjective","meaning_category":"筋力トレーニングの"}]}