{"word":"resistance training","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"レジスタンストレーニング、筋力トレーニング (筋肉に負荷をかける運動)","english_definition":"exercise that causes the muscles to contract against an external resistance (weights, bands, body weight) with the expectation of increases in strength, power, hypertrophy, and/or endurance.","examples":[{"sentence":"Resistance training is important for building muscle mass.","translation":"レジスタンストレーニングは筋肉量を増やすために重要です。"},{"sentence":"She incorporates resistance training into her fitness routine twice a week.","translation":"彼女は週に2回、レジスタンストレーニングをフィットネスルーチンに取り入れています。"},{"sentence":"Beginners should start with light weights and gradually increase the resistance.","translation":"初心者は軽いウェイトから始め、徐々に負荷を上げていくべきです。"}],"collocations":["weight training","strength training","bodyweight training","resistance bands","free weights","machine weights"],"synonyms":["strength training","weightlifting","muscle training","bodybuilding"],"antonyms":["cardio","aerobic exercise","endurance training"]}],"etymology":{"value":"The term combines 'resistance,' referring to the opposing force against muscle contraction, and 'training,' indicating a systematic process of exercise.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈzɪstəns ˈtreɪnɪŋ/","syllables":"re-sis-tance train-ing"},"inflection":{"noun_plural":"resistance trainings (less common, usually used as a mass noun)"},"usage_notes":{"explanation":"'Resistance training' encompasses various forms of exercise where muscles work against an external force. This includes lifting weights, using resistance bands, or even utilizing one's own body weight. The goal is to strengthen muscles, increase endurance, and improve overall physical fitness.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I do resistance training every day for 3 hours.","correct":"✓ I do resistance training most days for about an hour.","note":"Overtraining can lead to injury. It's important to allow muscles to recover. Resistance training is often done a few times a week, with rest days in between."},{"incorrect":"✗ Resistance training is only for bodybuilders.","correct":"✓ Resistance training is beneficial for people of all ages and fitness levels.","note":"Resistance training offers benefits beyond muscle building, including improved bone density, metabolism, and functional strength."}],"priority":"★★☆"},"related_words":{"derivatives":["resistance (noun)","train (verb)","trainer (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively common in fitness and health contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Resistance training' refers to exercises where your muscles work against some kind of force. This could be weights, resistance bands, or even just your own body weight. It's a way to build strength and muscle. It's not just for bodybuilders; it's good for anyone who wants to get stronger and healthier.","priority":"★★★"},"example_sentences":[{"sentence":"Regular **resistance training** can help prevent age-related muscle loss.","translation":"定期的なレジスタンストレーニングは、加齢に伴う筋肉量の減少を防ぐのに役立ちます。","type":"noun","meaning_category":"筋力トレーニング"},{"sentence":"She prefers **resistance training** to cardio for improving her overall fitness.","translation":"彼女は総合的なフィットネスを向上させるために、有酸素運動よりもレジスタンストレーニングを好みます。","type":"noun","meaning_category":"筋力トレーニング"},{"sentence":"The personal trainer designed a **resistance training** program tailored to his client's needs.","translation":"パーソナルトレーナーは、クライアントのニーズに合わせてレジスタンストレーニングプログラムを作成しました。","type":"noun","meaning_category":"筋力トレーニング"}]}