{"word":"nonostensibly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"表面的にはそうでないように、見せかけによらず","english_definition":"not ostensibly; not in a way that is apparent or openly declared.","examples":[{"sentence":"The two companies were nonostensibly competitors, but they often collaborated on projects behind the scenes.","translation":"その二つの会社は、表面的には競合他社ではなかったが、舞台裏ではしばしばプロジェクトで協力していた。"},{"sentence":"He nonostensibly supported the new policy, but his actions suggested otherwise.","translation":"彼は表面的には新しい政策を支持していたが、彼の行動はそうではないことを示唆していた。"}],"collocations":["nonostensibly different","nonostensibly related","nonostensibly independent"],"synonyms":["covertly","secretly","inconspicuously","seemingly","apparently"],"antonyms":["ostensibly","openly","obviously","apparently"]}],"etymology":{"value":"「non-」(否定) + 「ostensibly」(表面的に)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnɒˈstɛnsɪbli/","syllables":"non-o-sten-si-bly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"The adverb 'nonostensibly' describes an action or situation that is not what it appears to be on the surface. It suggests a hidden or underlying reality that contradicts the outward appearance. It is often used to imply deception, hidden motives, or a more complex situation than is immediately apparent.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He nonostensibly worked hard, but he was actually lazy.","correct":"✓ He ostensibly worked hard, but he was actually lazy.","note":"'Ostensibly' means 'apparently' or 'seemingly', so it's used when something appears to be true but might not be. 'Nonostensibly' means 'not apparently', so the example sentence should use 'ostensibly' to indicate the apparent hard work."}],"priority":"★★☆"},"related_words":{"derivatives":["ostensible (adj.)","ostensibly (adv.)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'nonostensibly' is a relatively rare and complex word. It means 'not in a way that is apparent or openly declared'. It is used to describe situations where the true nature of something is hidden or not immediately obvious. Due to its complexity and low frequency, it is typically encountered in advanced academic or literary contexts."},"example_sentences":[{"sentence":"The two organizations were nonostensibly rivals, but they shared resources to achieve common goals.","translation":"その二つの組織は、表面的にはライバル関係にあったが、共通の目標を達成するために資源を共有していた。","type":"adverb","meaning_category":"not openly declared"},{"sentence":"The politician nonostensibly distanced himself from the scandal, but evidence suggested his involvement.","translation":"その政治家は、表面的にはスキャンダルから距離を置いていたが、証拠は彼の関与を示唆していた。","type":"adverb","meaning_category":"not in an apparent way"}]}