{"word":"grandfathership","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(法律、規制などにおける)既存の権利保護条項、既得権益保護条項","english_definition":"a provision in a law or regulation that exempts those already engaged in the activity being regulated from the new rules.","examples":[{"sentence":"The new zoning law included a grandfathership clause to protect existing businesses.","translation":"新しいゾーニング法には、既存の事業を保護するための既得権益保護条項が含まれていた。"},{"sentence":"Because of the grandfathership, the old factory was allowed to continue operating despite the new environmental regulations.","translation":"既得権益保護条項のおかげで、古い工場は新しい環境規制にもかかわらず操業を継続することができた。"}],"collocations":["grandfathership clause","grandfathership provision","existing grandfathership"],"synonyms":["exemption clause","vested rights provision","grandfather clause"],"antonyms":["new regulation","new rule","general application"]},{"part_of_speech":"noun","definition":"(比喩的に)特例措置、例外扱い","english_definition":"(figuratively) a situation where someone or something is allowed to continue operating or existing despite new rules or regulations that would otherwise prohibit it.","examples":[{"sentence":"The old tradition continued under a kind of grandfathership, even though it was no longer officially sanctioned.","translation":"その古い伝統は、もはや公式には認められていなかったが、一種の特例措置のもとで継続された。"},{"sentence":"He was operating under a grandfathership, having been hired before the new qualifications were introduced.","translation":"彼は新しい資格が導入される前に採用されていたため、特例措置のもとで働いていた。"}],"collocations":["operate under grandfathership","exist under grandfathership"],"synonyms":["special exception","special treatment","exemption"],"antonyms":["standard practice","general rule"]}],"etymology":{"value":"「grandfather clause」という言葉に由来し、もともとはアメリカ南部で、新しい法律（特に投票権制限）が、法律施行以前から特定の権利を持っていた人々（またはその子孫）には適用されないようにするための条項を指した。これは、アフリカ系アメリカ人の投票を制限することを目的としていた。この言葉は、より一般的に、既存の権利や状況を保護する条項を指すようになった。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡrændˌfɑːðərʃɪp/","syllables":"grand-fa-ther-ship"},"inflection":{"noun_plural":"grandfatherships"},"usage_notes":{"explanation":"「**grandfathership**」は、主に法律や規制の文脈で使用され、新しい規則が既存の状況や活動に遡及的に適用されないようにする条項を指します。これは、新しい規則が施行される前に特定の活動に従事していた人々や組織が、その活動を継続できるようにするためのものです。比喩的には、新しい規則にもかかわらず、何かが例外的に許可されている状況を指すことがあります。歴史的な背景として、元々は人種差別的な意図で使用された「grandfather clause」に由来することを知っておくことが重要です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company received grandfathership because it was the oldest in the industry.","correct":"✓ The company received a grandfathership because it was the oldest in the industry.","note":"「grandfathership」は可算名詞として扱われることが多く、「a grandfathership」または「grandfatherships」のように不定冠詞または複数形を使用します。"},{"incorrect":"✗ The new law had no grandfathership, so everyone had to comply immediately.","correct":"✓ The new law had no grandfathership clause, so everyone had to comply immediately.","note":"「grandfathership」単独で使用するよりも、「grandfathership clause」または「grandfathership provision」のように、条項や規定であることを明示する方がより一般的です。"}],"priority":"★★☆"},"related_words":{"derivatives":["grandfather clause","grandfathering","grandfathered"],"synonyms":["exemption","waiver","immunity","privilege"],"antonyms":["regulation","rule","law","requirement"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 法律、規制、歴史に関する文脈で使われることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**grandfathership**」は、法律や規制の分野で使われる専門的な言葉です。新しいルールができても、すでに何かをしている人たちにはそのルールが適用されないようにする条項のことを言います。たとえば、新しい環境ルールができても、昔からある工場にはそのルールがすぐに適用されない、というような場合に使われます。この言葉は、昔のアメリカで、特定の人たちにだけ特別な権利を与えるために使われた歴史的な背景を持っているので、使うときには注意が必要です。"},"example_sentences":[{"sentence":"The property owners were granted grandfathership, exempting them from the new building codes.","translation":"その不動産所有者には既得権益が認められ、新しい建築基準法から免除された。","type":"noun","meaning_category":"既存の権利保護条項"},{"sentence":"Under the terms of the grandfathership, the company was allowed to continue its operations.","translation":"既得権益保護条項の条件に基づき、その会社は操業を継続することが認められた。","type":"noun","meaning_category":"既存の権利保護条項"},{"sentence":"The policy included a grandfathership for those who had already invested in the project.","translation":"その政策には、すでにプロジェクトに投資していた人々に対する既得権益保護条項が含まれていた。","type":"noun","meaning_category":"既存の権利保護条項"},{"sentence":"The organization was operating under a kind of grandfathership, as it had been established long before the current regulations.","translation":"その組織は、現在の規制が制定されるずっと前に設立されたため、一種の特例措置のもとで運営されていた。","type":"noun","meaning_category":"特例措置"}]}