{"word":"Sauropterygian","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"竜脚鰭亜目（りゅうきゃくきあもく）の動物：中生代に生息した、首が長く、鰭状の四肢を持つ海生爬虫類の一群。","english_definition":"Any reptile of the Sauropterygia, an extinct group of Mesozoic marine reptiles with long necks and flipper-like limbs.","examples":[{"sentence":"Sauropterygians were diverse and successful marine predators during the Mesozoic era.","translation":"竜脚鰭亜目は中生代において多様で繁栄した海洋捕食者であった。"},{"sentence":"The sauropterygian fossil was discovered in a marine deposit.","translation":"その竜脚鰭亜目の化石は、海洋堆積物の中で発見された。"}],"collocations":["sauropterygian fossil (竜脚鰭亜目の化石)","sauropterygian evolution (竜脚鰭亜目の進化)","marine sauropterygian (海生の竜脚鰭亜目)"],"synonyms":["none"],"antonyms":["none"]},{"part_of_speech":"adjective","definition":"竜脚鰭亜目（りゅうきゃくきあもく）に属する、または竜脚鰭亜目に関する。","english_definition":"Relating to or belonging to the Sauropterygia.","examples":[{"sentence":"Sauropterygian anatomy is characterized by elongated necks and paddle-like limbs.","translation":"竜脚鰭亜目の解剖学的特徴は、細長い首と櫂のような四肢によって特徴づけられる。"},{"sentence":"Sauropterygian reptiles thrived in the warm seas of the Mesozoic.","translation":"竜脚鰭亜目の爬虫類は、中生代の温暖な海で繁栄した。"}],"collocations":["sauropterygian reptile (竜脚鰭亜目の爬虫類)","sauropterygian anatomy (竜脚鰭亜目の解剖学)","sauropterygian lineage (竜脚鰭亜目の系統)"],"synonyms":["none"],"antonyms":["none"]}],"etymology":{"value":"Derived from the Greek words 'sauros' (lizard), 'pteryx' (fin or wing), and 'pteryxion' (small fin), referring to their lizard-like bodies and flipper-like limbs.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɔːrɒpˈtɛrɪdʒɪən/","syllables":"sau-rop-ter-y-gi-an"},"inflection":{"noun_plural":"sauropterygians"},"usage_notes":{"explanation":"'Sauropterygian' is a term used in paleontology and evolutionary biology to refer to a specific group of extinct marine reptiles. It is most often encountered in scientific literature or discussions about Mesozoic marine life.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Sauropterygian are dinosaurs.","correct":"✓ Sauropterygians are marine reptiles.","note":"Sauropterygians are not dinosaurs; they are a distinct group of marine reptiles. "},{"incorrect":"✗ Sauropterygian lived during the Jurassic and Cretaceous periods.","correct":"✓ Sauropterygians lived during the Triassic, Jurassic, and Cretaceous periods.","note":"While they are prominent during the Jurassic and Cretaceous, they also existed during the Triassic period."}],"priority":"★★☆"},"related_words":{"derivatives":["Plesiosauria (首長竜亜目): A major group within Sauropterygia.","Nothosauridae (ノトサウルス科): An early family within Sauropterygia."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'sauropterygian' is a specialized term primarily used within the fields of paleontology, zoology, and evolutionary biology. Understanding this term requires familiarity with the classification of extinct reptiles and the Mesozoic era. It is typically encountered in scientific literature, academic discussions, or educational contexts related to these fields."},"example_sentences":[{"sentence":"The sauropterygian had adaptations for aquatic life, such as streamlined bodies.","translation":"その竜脚鰭亜目は、流線型の体など、水生生活への適応を持っていた。","type":"noun","meaning_category":"動物"},{"sentence":"Sauropterygian fossils provide valuable insights into the evolution of marine reptiles.","translation":"竜脚鰭亜目の化石は、海洋爬虫類の進化に関する貴重な洞察を提供する。","type":"noun","meaning_category":"動物"},{"sentence":"The sauropterygian's long neck allowed it to ambush prey from a distance.","translation":"その竜脚鰭亜目の長い首は、遠くから獲物を待ち伏せすることを可能にした。","type":"adjective","meaning_category":"特徴"}]}