{"word":"arillode","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物学)仮種皮：種子の表面を部分的に覆う、種皮に由来しない肉質の付属物。","english_definition":"(botany) A fleshy outgrowth from the seed stalk (funiculus) that partly covers the seed, but is not derived from the seed coat.","examples":[{"sentence":"The bright red arillode of the yew seed attracts birds, which help disperse the seed.","translation":"イチイの種の鮮やかな赤い仮種皮は鳥を引きつけ、鳥が種子の散布を助けます。"},{"sentence":"Some species have an arillode that is highly nutritious and consumed by animals.","translation":"いくつかの種は、栄養価が高く動物に消費される仮種皮を持っています。"}],"collocations":["fleshy arillode","nutritious arillode","red arillode"],"synonyms":["aril (より一般的な用語)"],"antonyms":[]}],"etymology":{"value":"'aril' (種皮を覆う付属物) + '-ode' (類似を示す接尾辞)。種皮に由来しないarilに似た構造であることを示す。","priority":"★★★"},"pronunciation":{"ipa":"/ˈærɪloʊd/","syllables":"a-ril-lode"},"inflection":{"noun_plural":"arillodes"},"usage_notes":{"explanation":"'arillode' は、'aril' と似た構造だが、種皮ではなく種柄（funiculus）から発生する点を強調する際に使われる専門的な植物学用語です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The arillode is part of the seed coat.","correct":"✓ The arillode is not part of the seed coat; it originates from the funiculus.","note":"仮種皮は種皮の一部ではありません。種柄に由来します。"},{"incorrect":"✗ Arillode and aril are the same thing.","correct":"✓ While similar, an arillode specifically refers to a structure originating from the funiculus, whereas an aril can have different origins.","note":"arilとarillodeは似ていますが、arillodeは種柄に由来するものを指します。"}],"priority":"★★☆"},"related_words":{"derivatives":["aril"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な植物学の文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Arillode' is a technical botanical term referring to a specific type of fleshy appendage on a seed. It's important to understand that it's distinct from an 'aril' in its origin, arising from the funiculus rather than the seed coat. This term is primarily encountered in specialized texts on botany and plant morphology."},"example_sentences":[{"sentence":"The *arillode* of the bloodroot seed is rich in lipids and attracts ants for dispersal.","translation":"血根草の種の仮種皮は脂質が豊富で、アリを引きつけて種子を散布させます。","type":"noun","meaning_category":"植物学"},{"sentence":"Careful observation is needed to differentiate between a true aril and an *arillode*.","translation":"真の種皮と仮種皮を区別するには、注意深い観察が必要です。","type":"noun","meaning_category":"植物学"}]}