{"word":"Virilify","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"男性化する、男らしくする","english_definition":"To make someone or something appear more masculine or manly.","examples":[{"sentence":"The media often virilifies soldiers, portraying them as strong and fearless.","translation":"メディアはしばしば兵士を男性化し、彼らを強く恐れを知らない存在として描く。"},{"sentence":"The artist used strong lines and bold colors to virilify the subject of the painting.","translation":"その画家は、強い線と大胆な色を使って、絵の主題を男性的に見せた。"}],"collocations":["virilify a character","virilify an image","virilify a stereotype"],"synonyms":["masculinize","man up","strengthen","toughen"],"antonyms":["feminize","emasculate","weaken"]}],"etymology":{"value":"Derived from the Latin word 'virilis,' meaning 'manly' or 'masculine,' and the suffix '-fy,' meaning 'to make' or 'to cause to become.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvɪrɪlɪfaɪ/","syllables":"vi-ril-i-fy"},"inflection":{"verb_forms":{"present_simple":["virilify","virilifies"],"past_simple":"virilified","past_participle":"virilified","present_participle":"virilifying"}},"usage_notes":{"explanation":"'Virilify' is often used in discussions about gender representation and the construction of masculinity. It can be used critically to describe how certain groups or individuals are portrayed in a way that reinforces traditional masculine stereotypes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He tried to virilify his voice by speaking loudly.","correct":"✓ He tried to deepen his voice to sound more masculine.","note":"While 'virilify' means to make something more masculine, it's less commonly used to describe a direct action someone takes on themselves. It's more often used to describe how something is portrayed or represented."}],"priority":"★☆☆"},"related_words":{"derivatives":["virile (adjective): having strength, energy, and a strong sex drive; masculine.","virility (noun): the state of being strong, energetic, and masculine."],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Virilify' is a relatively uncommon word that means to make someone or something seem more masculine. It's often used in academic or critical contexts when discussing how masculinity is constructed or portrayed. Because it's not a common word, it's important to understand the context in which it's used to fully grasp its meaning."},"example_sentences":[{"sentence":"The film tended to **virilify** the protagonist, making him an unrealistic example of manliness.","translation":"その映画は主人公を男性化する傾向があり、彼を男らしさの非現実的な例としていた。","type":"verb","meaning_category":"男性化する"},{"sentence":"Advertisements often **virilify** certain products to appeal to male consumers.","translation":"広告は男性消費者にアピールするために、特定の製品を男性化することがよくある。","type":"verb","meaning_category":"男らしくする"}]}