{"word":"precolluded","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vi","definition":"事前に共謀した、前もって示し合わせた","english_definition":"to have colluded or conspired beforehand; to have engaged in secret cooperation or conspiracy in advance.","examples":[{"sentence":"It appeared as though the companies had precolluded to fix the prices before the auction.","translation":"その企業たちはオークションの前に価格を操作するために事前に共謀していたように見えた。"},{"sentence":"The evidence suggested that the politicians had precolluded to obstruct the investigation.","translation":"証拠は、政治家たちが捜査を妨害するために事前に示し合わせていたことを示唆していた。"}],"collocations":["precollude to fix prices","precollude to obstruct justice","precollude to manipulate the market"],"synonyms":["conspired beforehand","prearranged","preconspired","secretly agreed in advance"],"antonyms":["acted independently","operated separately","worked alone"]}],"etymology":{"value":"\"Pre-\" (before) + \"colluded\" (to conspire or cooperate secretly or unlawfully). The word is formed by adding the prefix 'pre-' to the past tense of 'collude', indicating that the collusion occurred prior to a specific event or time.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːkəˈluːdɪd/","syllables":"pre-col-lu-ded"},"inflection":{"verb_forms":{"present_simple":["precollude","precolludes"],"past_simple":"precolluded","past_participle":"precolluded","present_participle":"precolluding"}},"usage_notes":{"explanation":"\"Precolluded\" is used to describe situations where individuals or groups have secretly agreed to cooperate or conspire before a particular event or action takes place. It implies a level of planning and coordination that occurs in advance, often with the intention of manipulating or influencing the outcome of the event. The term is often used in legal or investigative contexts to suggest wrongdoing or unethical behavior.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The teams precolluded each other.","correct":"✓ The teams precolluded with each other.","note":"The verb 'collude' (and therefore 'precollude') often takes the preposition 'with' to indicate who the parties are colluding with."},{"incorrect":"✗ The precolluded was obvious.","correct":"✓ The precollusion was obvious.","note":"'Precolluded' is a verb. The noun form of the action is 'precollusion'."}],"priority":"★★☆"},"related_words":{"derivatives":["precollusion (noun: the act of precolluding)"],"synonyms":["conspire","collude","plot","scheme","intrigue","connive"],"antonyms":["act independently","operate separately","work alone"]},"level_frequency":{"frequency_google_ngram":"Low frequency - The word is relatively rare and not commonly used in everyday language.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Precolluded' is a relatively uncommon word that combines the prefix 'pre-' (meaning 'before') with the verb 'colluded' (meaning 'conspired or cooperated secretly'). It is used to describe situations where individuals or groups have secretly agreed to cooperate or conspire before a particular event or action takes place. This word is typically found in legal, investigative, or formal contexts, suggesting wrongdoing or unethical behavior. Because of its infrequent use and specific context, it is considered a more advanced vocabulary word."},"example_sentences":[{"sentence":"The investigation revealed that the bidders had precolluded to rig the auction results.","translation":"調査により、入札者たちがオークションの結果を不正操作するために事前に共謀していたことが明らかになった。","type":"verb","meaning_category":"事前共謀"},{"sentence":"It was suspected that the companies had precolluded to divide the market share among themselves.","translation":"企業たちが市場占有率を自分たちの間で分割するために事前に示し合わせていた疑いがあった。","type":"verb","meaning_category":"事前示し合わせ"}]}