{"word":"multiferroic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"マルチ強誘電性の","english_definition":"Describing a material that exhibits two or more primary ferroic properties (ferroelectricity, ferromagnetism, ferroelasticity) simultaneously.","examples":[{"sentence":"Multiferroic materials are of great interest for use in novel electronic devices.","translation":"マルチ強誘電性材料は、新規電子デバイスへの応用において大きな関心を集めている。"},{"sentence":"The coexistence of ferroelectricity and ferromagnetism in multiferroics allows for magnetoelectric coupling.","translation":"マルチ強誘電体における強誘電性と強磁性の共存は、磁電結合を可能にする。"}],"collocations":["multiferroic material","multiferroic compound","multiferroic properties","magnetoelectric multiferroic"],"synonyms":["magnetoelectric","ferroelectric","ferromagnetic"],"antonyms":[]}],"etymology":{"value":"The term 'multiferroic' is derived from the combination of 'multi-' (meaning many) and 'ferroic,' referring to materials exhibiting ferroic properties.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmʌltiːfəˈroʊɪk/","syllables":"mul-ti-fer-ro-ic"},"inflection":{"notes":"This word is primarily used as an adjective. The noun form would be 'multiferroic material' or simply 'a multiferroic' in some contexts."},"usage_notes":{"explanation":"Multiferroic materials are characterized by the simultaneous presence of two or more 'ferroic' orders, such as ferroelectricity (spontaneous electric polarization), ferromagnetism (spontaneous magnetization), and ferroelasticity (spontaneous strain). The coexistence of these properties, particularly ferroelectricity and ferromagnetism, enables magnetoelectric coupling, where the electric polarization can be controlled by a magnetic field and vice versa. This makes multiferroics promising for applications in sensors, actuators, and memory devices.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The multiferroic is a good conductor.","correct":"✓ The multiferroic material is a good conductor.","note":"'Multiferroic' is typically an adjective. Use 'multiferroic material' or a more specific term if referring to the substance itself."}],"priority":"★★☆"},"related_words":{"derivatives":["ferroelectricity","ferromagnetism","ferroelasticity","magnetoelectricity"],"phrases":["magnetoelectric coupling","ferroic order"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Multiferroic' describes materials that have multiple 'ferroic' properties at the same time. 'Ferroic' refers to properties like being magnetic (ferromagnetism) or electrically polarized (ferroelectricity). These materials are studied for use in new types of electronic devices because they can be controlled by both electric and magnetic fields. This word is mainly used in science and engineering.","priority":"★★☆"},"example_sentences":[{"sentence":"Researchers are exploring the potential of multiferroic thin films for data storage applications.","translation":"研究者たちは、データストレージアプリケーションにおけるマルチ強誘電性薄膜の可能性を探求している。","type":"adjective","meaning_category":"material property"},{"sentence":"The magnetoelectric effect is enhanced in certain multiferroic heterostructures.","translation":"特定のマルチ強誘電性ヘテロ構造では、磁電効果が強化される。","type":"adjective","meaning_category":"material property"}]}