{"word":"pilferment","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(古語)盗み、窃盗、盗品","english_definition":"(archaic) the act of pilfering; petty theft; stolen goods.","examples":[{"sentence":"The pilferment of small items from the market was a common occurrence.","translation":"市場からの小物の盗みはよくあることだった。"},{"sentence":"He was accused of pilferment and brought before the magistrate.","translation":"彼は窃盗の罪で告発され、治安判事の前に引き出された。"}],"collocations":["act of pilferment","petty pilferment"],"synonyms":["theft","larceny","pilfering","stealing","robbery"],"antonyms":["giving","donation","contribution"]}],"etymology":{"value":"Derived from the verb 'pilfer', with the suffix '-ment' added to form a noun indicating an act or state. 'Pilfer' itself comes from Old French 'pelfrer', meaning 'to steal', which is of uncertain origin.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɪlfərmənt/","syllables":"pil-fer-ment"},"inflection":{"noun_plural":"pilferments"},"usage_notes":{"explanation":"'Pilferment' is an archaic term, meaning it is no longer in common use. It specifically refers to the act of stealing small items or amounts, often in a sneaky or opportunistic way. The more common and modern terms for this type of theft are 'pilfering', 'petty theft', or simply 'theft'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pilferment was very large and involved many valuable items.","correct":"✓ The theft was very large and involved many valuable items.","note":"'Pilferment' implies small-scale theft. For large-scale theft, use 'theft', 'robbery', or 'larceny'."}],"priority":"★☆☆"},"related_words":{"derivatives":["pilfer (verb): to steal small items or amounts","pilferer (noun): one who pilfers","pilfering (noun): the act of stealing small items or amounts"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (not commonly used)","frequency_google_ngram":"Very low frequency - an archaic term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pilferment' is a relatively rare and archaic word that refers to the act of stealing small items or amounts. It is not commonly used in modern English. If you encounter this word, it is likely in older literature or historical contexts. In contemporary usage, 'theft' or 'pilfering' would be more appropriate and widely understood terms."},"example_sentences":[{"sentence":"The old records detailed numerous cases of pilferment from the royal treasury.","translation":"古い記録には、王室の宝物庫からの多数の窃盗事件が詳細に記録されていた。","type":"noun","meaning_category":"盗み"},{"sentence":"The merchant discovered the pilferment only after taking inventory.","translation":"商人は在庫を調べた後にのみ盗難に気づいた。","type":"noun","meaning_category":"盗み"}]}