{"word":"Roguedom","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"悪党仲間、悪党の世界、悪党根性","english_definition":"A group or class of rogues; the behavior or character of a rogue.","examples":[{"sentence":"The roguedom was filled with deceit and treachery.","translation":"その悪党仲間は欺瞞と裏切りに満ちていた。"},{"sentence":"He was banished from respectable society and cast into the roguedom.","translation":"彼はまともな社会から追放され、悪党の世界に投げ込まれた。"},{"sentence":"The politician's actions reeked of roguedom.","translation":"その政治家の行動は悪党根性が染み付いていた。"}],"collocations":["enter the roguedom","leave the roguedom","part of the roguedom","the heart of roguedom"],"synonyms":["rascality","villainy","knavishness","scoundrelism","dishonesty"],"antonyms":["honesty","integrity","virtue"]},{"part_of_speech":"noun","definition":"無法者の国、ならず者国家","english_definition":"A country or territory controlled by rogues or outlaws.","examples":[{"sentence":"The border region had become a roguedom, with no law and order.","translation":"国境地帯は無法者の国となり、法と秩序は存在しなかった。"}],"collocations":["establish a roguedom","rule a roguedom"],"synonyms":["lawless state","outlaw territory"]}],"etymology":{"value":"\"Rogue\" + \"-dom\". \"Rogue\" comes from an uncertain origin, possibly from Old French \"rogue\" (arrogant, insolent), or from a Romani word. The suffix \"-dom\" denotes a state, condition, or domain.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈroʊɡdəm/","syllables":"rogue-dom"},"inflection":{"noun_plural":"Roguedoms"},"usage_notes":{"explanation":"\"Roguedom\" is a relatively uncommon word, often used in a figurative or literary sense to describe a group of dishonest or unscrupulous people, or a situation characterized by dishonesty and lawlessness. It can also refer to a place or territory controlled by such individuals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a member of roguedom.","correct":"✓ He was a member of the rogues. / ✓ He embraced the roguedom.","note":"\"Roguedom\" refers to the *world* or *group* of rogues, not an individual rogue. Use \"rogue\" for an individual. You can \"embrace\" or \"enter\" a roguedom, but not be \"a member of\" it in the same way you'd be a member of a club."}],"priority":"★☆☆"},"related_words":{"derivatives":["rogue (noun, adjective)","roguish (adjective)","roguishly (adverb)"],"phrases":["go rogue (to act independently and without authorization)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not typically found in standard CEFR vocabulary lists)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Roguedom\" is an advanced word that describes a state or condition of being dominated by rogues (dishonest or unprincipled people). It's not commonly used in everyday conversation but might appear in literature or more formal writing. Understanding its meaning requires familiarity with the word \"rogue\" and the suffix \"-dom,\" which indicates a realm or state of being."},"example_sentences":[{"sentence":"The city had descended into a state of roguedom, with corruption rampant at every level.","translation":"その都市は悪党の世界へと堕落し、あらゆるレベルで腐敗が蔓延していた。","type":"noun","meaning_category":"悪党の世界"},{"sentence":"He saw the allure of the roguedom, where rules were meant to be broken.","translation":"彼は悪党の世界の魅力に気づいた。そこではルールは破られるためにあるものだった。","type":"noun","meaning_category":"悪党の世界"},{"sentence":"The lawless territory was a true roguedom, governed only by the strongest and most ruthless.","translation":"その無法地帯は真の無法者の国であり、最も強く、最も冷酷な者だけが支配していた。","type":"noun","meaning_category":"無法者の国"}]}