{"word":"deducibility","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"演繹可能性、推論可能性、導出可能性","english_definition":"The quality of being deducible; the capability of being logically inferred or derived from a given set of premises or axioms.","examples":[{"sentence":"The deducibility of a theorem from a set of axioms is a central concept in mathematical logic.","translation":"一連の公理からの定理の演繹可能性は、数理論理学における中心的な概念です。"},{"sentence":"The deducibility of the conclusion from the premises ensures the validity of the argument.","translation":"前提からの結論の演繹可能性は、議論の妥当性を保証します。"}],"collocations":["logical deducibility","mathematical deducibility","formal deducibility","prove deducibility","establish deducibility"],"synonyms":["inferability","derivability","provability","concludability","reasonableness"],"antonyms":["indeducibility","unprovability","unreasonableness"]}],"etymology":{"value":"The word \"deducibility\" is formed from \"deducible\" by adding the suffix \"-ity\". \"Deducible\" comes from the verb \"deduce,\" which originates from the Latin word \"deducere,\" meaning \"to lead or draw out.\" The suffix \"-ity\" is used to form nouns expressing a state, quality, or condition.","priority":"★★☆"},"pronunciation":{"ipa":"/diˌdjuːsɪˈbɪləti/","syllables":"de-du-ci-bi-li-ty"},"inflection":{"noun_plural":"deducibilities"},"usage_notes":{"explanation":"\"Deducibility\" refers to the property of a statement or conclusion being logically derivable from a set of premises or axioms. It is a key concept in logic, mathematics, and philosophy, where the validity of an argument or theory often depends on whether its claims can be rigorously deduced from established principles. The term is often used in formal contexts, such as mathematical proofs or logical arguments, where the emphasis is on the formal validity of the reasoning process.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The deducibility of the experiment was questioned.","correct":"✓ The validity of the experiment was questioned.","note":"\"Deducibility\" refers to logical inference, not the soundness of an experiment. Use \"validity\" or \"reliability\" in the context of experiments."},{"incorrect":"✗ Deducibility is when you can guess something.","correct":"✓ Deducibility is when you can logically infer something from given premises.","note":"\"Deducibility\" involves logical inference, not guessing. It requires a formal, valid argument from premises to a conclusion."}],"priority":"★★☆"},"related_words":{"derivatives":["deducible","deduce","deduction","deductive"],"related_terms":["inference","logic","axiom","premise","theorem","proof","validity","soundness"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Deducibility\" is a technical term primarily used in fields like logic, mathematics, and philosophy. It refers to the capacity of a statement or conclusion to be logically derived from a set of premises or axioms. Understanding this term requires familiarity with formal reasoning and the principles of logical inference. It is not commonly used in everyday conversation but is essential in contexts where the validity of arguments or theories is being assessed based on formal criteria."},"example_sentences":[{"sentence":"The **deducibility** of the Pythagorean theorem from Euclid's axioms is a cornerstone of geometry.","translation":"ピタゴラスの定理のユークリッドの公理からの演繹可能性は、幾何学の基礎です。","type":"noun","meaning_category":"演繹可能性 (数学)"},{"sentence":"The **deducibility** of moral principles from a set of fundamental values is a topic of debate in ethics.","translation":"道徳的原則の一連の基本的な価値観からの演繹可能性は、倫理学における議論のトピックです。","type":"noun","meaning_category":"演繹可能性 (倫理学)"},{"sentence":"In formal logic, the **deducibility** of a conclusion is demonstrated through a rigorous proof.","translation":"形式論理では、結論の演繹可能性は厳密な証明を通じて実証されます。","type":"noun","meaning_category":"演繹可能性 (論理学)"}]}