{"word":"impounding","priority":"★★☆","meanings":[{"part_of_speech":"verb (gerund or present participle)","definition":"(動詞 impound の現在分詞・動名詞) 差し押さえること、押収すること、囲い込むこと","english_definition":"The act of seizing and taking legal custody of something; confining or enclosing something.","examples":[{"sentence":"The impounding of the vehicle was due to unpaid parking tickets.","translation":"その車両の差し押さえは、未払いの駐車違反切符が原因だった。"},{"sentence":"Impounding stray animals helps to protect them and the public.","translation":"迷子の動物を囲い込むことは、動物自身と公衆の保護に役立つ。"},{"sentence":"The impounding of the documents was ordered by the court.","translation":"書類の押収は裁判所によって命じられた。"}],"collocations":["vehicle impounding (車両の差し押さえ)","animal impounding (動物の囲い込み)","document impounding (書類の押収)"],"synonyms":["seizing","confiscating","confining","detaining","sequestering","repossessing"],"antonyms":["releasing","returning","freeing","reinstating"]}],"etymology":{"value":"The word 'impounding' comes from the verb 'impound,' which originated from the Middle English word 'impondre,' meaning 'to put in a pound or enclosure.' The 'im-' prefix means 'in' or 'into,' and 'pound' refers to an enclosure for animals or lost items.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪmˈpaʊndɪŋ/","syllables":"im-pound-ing"},"inflection":{"notes":"This is the gerund or present participle form of the verb 'impound.' The base verb 'impound' has the following forms: impound, impounds, impounded, impounding."},"usage_notes":{"explanation":"'Impounding' refers to the act of legally seizing property or confining something. It often involves vehicles, animals, or documents. The reason for impounding usually involves a violation of the law or a failure to meet certain obligations. The term is frequently used in legal and administrative contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The impounding was very emotion.","correct":"✓ The impounding was very emotional.","note":"'Impounding' is a noun (gerund) referring to the act itself. 'Emotional' is an adjective describing something that evokes emotion. If you want to describe the feeling associated with the impounding, use 'emotional.'"},{"incorrect":"✗ They are impounding of the car.","correct":"✓ They are impounding the car.","note":"'Impounding' used as a gerund acts as a noun. If you want to use it as a verb in the present continuous tense, use 'are impounding' followed by the object."}],"priority":"★★☆"},"related_words":{"derivatives":["impound (verb: to seize and take legal custody of; to confine)","impoundment (noun: the act of impounding; a place where impounded items are kept)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, mainly used in legal and administrative contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Impounding' is a formal term that refers to the legal process of taking possession of property, typically due to a violation of laws or regulations. It is often used in contexts involving law enforcement, animal control, or debt collection. Understanding this term requires familiarity with legal and administrative vocabulary."},"example_sentences":[{"sentence":"The police were responsible for the **impounding** of the illegal firearms.","translation":"警察は違法な銃器の押収を担当した。","type":"noun (gerund)","meaning_category":"押収"},{"sentence":"The city's policy on **impounding** abandoned vehicles is strictly enforced.","translation":"市による放置車両の差し押さえに関する方針は厳格に施行されている。","type":"noun (gerund)","meaning_category":"差し押さえ"},{"sentence":"The **impounding** of the stray dogs aimed to ensure public safety.","translation":"野良犬の囲い込みは、公共の安全を確保することを目的としていた。","type":"noun (gerund)","meaning_category":"囲い込み"}]}