{"word":"Limawood","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"リマウッド（マメ科のカイガラノキ属の木材、染料や薬用に使われる）","english_definition":"A type of hardwood from trees of the Caesalpinia genus (family Fabaceae), used for dyes and medicinal purposes.","examples":[{"sentence":"Limawood was historically used to dye textiles a reddish color.","translation":"リマウッドは歴史的に、織物を赤みがかった色に染めるために使用されていました。"},{"sentence":"The bark of the limawood tree is sometimes used in traditional medicine.","translation":"リマウッドの木の樹皮は、伝統医学で使われることがあります。"}],"collocations":["limawood dye","limawood extract","limawood tree"],"synonyms":["redwood","brazilwood","sappanwood"],"antonyms":[]}],"etymology":{"value":"Derived from 'Lima' (the capital of Peru, where it was traded from) and 'wood'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɪməˌwʊd/","syllables":"Li-ma-wood"},"inflection":{"noun_plural":"limawoods"},"usage_notes":{"explanation":"Limawood refers to the wood of several species within the *Caesalpinia* genus, particularly those yielding red dyes. It is less common than other dye woods like brazilwood but has a similar historical usage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Limewood is the same as limawood.","correct":"✓ Limewood is a different type of wood from limawood.","note":"Limewood and limawood are different types of wood from different trees. Limewood is from the *Tilia* genus, while limawood is from the *Caesalpinia* genus."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["brazilwood","sappanwood","dye wood","hardwood","Caesalpinia"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Limawood is a relatively uncommon term referring to a specific type of hardwood used historically for dyes and medicinal purposes. Understanding its usage requires knowledge of historical trade and natural dyes. It is not a word commonly encountered in everyday language.","requires_background":"Knowledge of botany, historical trade, and natural dyes is helpful to understand the term."},"example_sentences":[{"sentence":"The antique tapestries were dyed using natural dyes, including limawood.","translation":"そのアンティークのタペストリーは、リマウッドを含む天然染料で染められていました。","type":"general","meaning_category":"dye"},{"sentence":"Historical records indicate that limawood was a valuable trade commodity in the 17th century.","translation":"歴史的記録は、リマウッドが17世紀に貴重な貿易商品であったことを示しています。","type":"historical","meaning_category":"trade"}]}