{"word":"data-integriteit","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"データ整合性、データ完全性","english_definition":"Data integrity refers to maintaining and assuring the accuracy and consistency of data over its entire life-cycle. It is a critical aspect of data management and security.","examples":[{"sentence":"Het waarborgen van data-integriteit is essentieel voor betrouwbare besluitvorming.","translation":"Ensuring data integrity is essential for reliable decision-making.","english_translation":"Ensuring data integrity is essential for reliable decision-making."},{"sentence":"Data-integriteit kan worden aangetast door menselijke fouten, hardwarefouten of softwarebugs.","translation":"Data integrity can be compromised by human errors, hardware failures, or software bugs.","english_translation":"Data integrity can be compromised by human errors, hardware failures, or software bugs."}],"collocations":["data-integriteit waarborgen (ensure data integrity)","data-integriteit aantasten (compromise data integrity)","hoge data-integriteit (high data integrity)","data-integriteit controleren (check data integrity)"],"synonyms":["gegevensintegriteit","gegevensconsistentie","databetrouwbaarheid"],"antonyms":["data-corruptie","data-inconsistentie"]}],"etymology":{"value":"'Data' is afgeleid van het Latijnse 'datum', wat 'gegeven' betekent. 'Integriteit' komt van het Latijnse 'integritas', wat 'volledigheid, gaafheid' betekent. Samen verwijst 'data-integriteit' naar de volledigheid en correctheid van gegevens.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdaːta ɪnteɣriˈtɛit/","syllables":"daa-ta in-te-gri-teit"},"inflection":{"noun_plural":"data-integriteiten"},"usage_notes":{"explanation":"'Data-integriteit' is een term die veel wordt gebruikt in de informatica, data management, en cybersecurity. Het verwijst naar de betrouwbaarheid en nauwkeurigheid van data gedurende de gehele levenscyclus. Het is cruciaal voor het nemen van goede beslissingen en het handhaven van de betrouwbaarheid van systemen.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ De data heeft integriteit.","correct":"✓ De data heeft hoge integriteit. / ✓ De data-integriteit is hoog.","note":"'Integriteit' is een eigenschap die data bezit, geen zelfstandig kenmerk. Daarom is het beter om te spreken van 'hoge integriteit' of 'de data-integriteit is hoog'."}],"priority":"★★☆"},"related_words":{"derivatives":["data (gegevens)","integriteit (integrity)","data-validatie (data validation)","data-beveiliging (data security)","data-management (data management)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatief frequent in technische contexten.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Data-integriteit' is een term die gebruikt wordt om de betrouwbaarheid en nauwkeurigheid van gegevens te beschrijven. Het is belangrijk dat data correct en consistent is, zodat je er goede beslissingen mee kunt nemen. Denk aan het controleren of er geen fouten in de data zitten, of dat de data niet is veranderd zonder dat je het weet. Het is een belangrijk concept in de wereld van computers en informatie.","english_translation":"'Data integrity' is a term used to describe the reliability and accuracy of data. It is important that data is correct and consistent so that you can make good decisions with it. Think of checking that there are no errors in the data, or that the data has not been changed without your knowledge. It is an important concept in the world of computers and information."},"example_sentences":[{"sentence":"Het is belangrijk om de data-integriteit te waarborgen bij het overzetten van gegevens naar een nieuwe database.","translation":"It is important to ensure data integrity when transferring data to a new database.","type":"general","meaning_category":"general"},{"sentence":"Een gebrek aan data-integriteit kan leiden tot verkeerde analyses en onjuiste conclusies.","translation":"A lack of data integrity can lead to incorrect analyses and inaccurate conclusions.","type":"general","meaning_category":"general"}]}