{"word":"FIO","priority":"Low","meanings":[{"part_of_speech":"acronym","definition":"Free In and Out: A shipping term indicating that the freight rate excludes the cost of loading and unloading the cargo.","english_definition":"A shipping term indicating that the freight rate excludes the cost of loading and unloading the cargo from the vessel.","examples":[{"sentence":"The shipping contract specified FIO terms, so the shipper was responsible for loading and unloading costs.","translation":"その輸送契約はFIO条件を指定していたため、荷送人が積み込みと荷降ろしの費用を負担することになっていた。"}],"collocations":["FIO terms","FIO contract","shipping FIO"],"synonyms":["Free In/Out"],"antonyms":[],"notes":"Often used in bulk cargo shipping."},{"part_of_speech":"acronym","definition":"Florida International University: A public research university in Miami, Florida.","english_definition":"A public research university in Miami, Florida, USA.","examples":[{"sentence":"She graduated from FIO with a degree in engineering.","translation":"彼女はFIOを工学の学位で卒業した。"}],"collocations":["FIO graduate","FIO campus","attend FIO"],"synonyms":[],"antonyms":[],"notes":"Common abbreviation for the university name."},{"part_of_speech":"acronym","definition":"Flexible Input/Output: A type of computer architecture or system design.","english_definition":"A type of computer architecture or system design that allows for adaptable and configurable input/output operations.","examples":[{"sentence":"The new server uses a FIO architecture to improve performance.","translation":"新しいサーバーはパフォーマンスを向上させるためにFIOアーキテクチャを使用している。"}],"collocations":["FIO architecture","FIO system","FIO design"],"synonyms":[],"antonyms":[],"notes":"Less common usage, primarily in technical contexts."}],"etymology":{"value":"Acronym derived from the initial letters of the respective terms.","priority":"Low"},"pronunciation":{"ipa":"/ˌɛf aɪ ˈoʊ/","syllables":"F-I-O"},"inflection":{"notes":"As an acronym, it does not inflect."},"usage_notes":{"explanation":"FIO is an acronym with multiple meanings depending on the context. The most common meaning is 'Free In and Out' in shipping. It can also refer to Florida International University. Less frequently, it may refer to 'Flexible Input/Output' in computing.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"I'm shipping the goods CIF, not FIO, so insurance is included.","correct":"I'm shipping the goods CIF, not FIO, so loading and unloading are not my responsibility."}],"priority":"Low"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_acronyms":["CIF","FAS","FOB"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"B2","text":"FIO is an acronym that has different meanings depending on the context. In shipping, it means 'Free In and Out,' indicating that the shipping costs do not include loading and unloading. Outside of shipping, it can refer to Florida International University or, in technical contexts, Flexible Input/Output. Understanding the context is crucial to interpreting the meaning of FIO correctly."},"example_sentences":[{"sentence":"The FIO terms in the contract meant we had to arrange for the crane ourselves.","translation":"契約のFIO条件は、私たちが自分たちでクレーンを手配しなければならないことを意味していた。","type":"acronym","meaning_category":"Shipping"},{"sentence":"She's applying to the business school at FIO.","translation":"彼女はFIOのビジネススクールに応募している。","type":"acronym","meaning_category":"University"}]}