{"word":"seizures","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(医学)発作、痙攣","english_definition":"A sudden, uncontrolled electrical disturbance in the brain. It can cause changes in your behavior, movements or feelings, and in levels of consciousness.","examples":[{"sentence":"The patient has a history of seizures.","translation":"その患者には発作の既往歴がある。"},{"sentence":"He experienced a seizure while driving.","translation":"彼は運転中に発作を起こした。"},{"sentence":"The medication helps to control her seizures.","translation":"その薬は彼女の発作を抑えるのに役立つ。"},{"sentence":"Epilepsy is characterized by recurrent seizures.","translation":"てんかんは、繰り返される発作を特徴とする。"}],"collocations":["have a seizure (発作を起こす)","control seizures (発作をコントロールする)","epileptic seizures (てんかん発作)","febrile seizures (熱性痙攣)","seizure disorder (発作性疾患)","seizure frequency (発作頻度)","seizure threshold (発作閾値)"],"synonyms":["convulsions","spasms","fits"],"antonyms":["none (発作の直接的な反対語は存在しない)"]}],"etymology":{"value":"The word 'seizure' comes from the Old French word 'seisir', meaning 'to put in possession of, to take possession of'. In a medical context, it refers to the brain 'taking possession' of the body in an uncontrolled way.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsiːʒərz/","syllables":"sei-zures"},"inflection":{"noun_plural":"seizures (発作 - 複数形)"},"usage_notes":{"explanation":"'Seizures' are usually associated with neurological conditions such as epilepsy, but can also be caused by other factors like high fever (especially in children - febrile seizures), head trauma, drug withdrawal, or metabolic imbalances. The term refers to the event itself, not the underlying condition. It's important to note that not all seizures are convulsive (involving shaking movements); some may manifest as brief periods of staring, confusion, or unusual sensations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a seizure attack.","correct":"✓ He had a seizure.","note":"The word 'seizure' already implies an attack, so 'seizure attack' is redundant."},{"incorrect":"✗ She is having a seizure from epilepsy.","correct":"✓ She is having a seizure due to epilepsy.","note":"'Due to' or 'because of' is more appropriate than 'from' when indicating the cause of a seizure."},{"incorrect":"✗ Seizures are very dangerous, you can die.","correct":"✓ Seizures can be very dangerous and may lead to death in some cases.","note":"While seizures can be dangerous, directly stating that 'you can die' is overly simplistic and potentially alarming. It's more accurate to say that seizures *may* lead to death in some cases, especially if prolonged or untreated."}],"priority":"★★☆"},"related_words":{"derivatives":["seize (動詞: 捕らえる、差し押さえる、発作を起こす)","seizable (形容詞: 差し押さえ可能な)"],"medical_terms":["epilepsy (てんかん)","convulsion (痙攣)","aura (前兆)","tonic-clonic seizure (強直間代発作)","absence seizure (欠神発作)","status epilepticus (てんかん重積状態)","EEG (脳波検査)"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"比較的低い (Relatively low), but common in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Seizures' refers to sudden, uncontrolled bursts of electrical activity in the brain, which can lead to changes in behavior, movement, or consciousness. It's a term commonly used in medical contexts, particularly when discussing conditions like epilepsy. While not an everyday word, understanding its meaning is important for comprehending medical information or discussions about neurological health. It's crucial to remember that seizures can manifest in various ways, not always involving convulsions."},"example_sentences":[{"sentence":"The doctor asked about the frequency and duration of the patient's **seizures**.","translation":"医師は患者の発作の頻度と持続時間について尋ねた。","type":"noun","meaning_category":"発作"},{"sentence":"Certain medications can increase the risk of **seizures**.","translation":"特定の薬は発作のリスクを高める可能性がある。","type":"noun","meaning_category":"発作"},{"sentence":"After the **seizure**, she felt confused and disoriented.","translation":"発作の後、彼女は混乱し、方向感覚を失った。","type":"noun","meaning_category":"発作"},{"sentence":"The child had a febrile **seizure** due to a high fever.","translation":"その子供は高熱のために熱性痙攣を起こした。","type":"noun","meaning_category":"発作"}]}