{"word":"resigned-looking","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"諦めたような顔つきの、諦観した表情の","english_definition":"having an appearance that suggests acceptance of something unpleasant or unwanted, without resistance or protest.","examples":[{"sentence":"He had a resigned-looking expression on his face as he accepted the defeat.","translation":"彼は敗北を受け入れるとき、諦めたような表情をしていた。"},{"sentence":"The dog gave his owner a resigned-looking glance before being put in the carrier.","translation":"犬はキャリーに入れられる前に、諦めたような視線を飼い主に送った。"},{"sentence":"She wore a resigned-looking smile as she listened to her boss's complaints.","translation":"彼女は上司の不満を聞きながら、諦めたような笑顔を浮かべていた。"}],"collocations":["a resigned-looking face (諦めたような顔)","a resigned-looking expression (諦めたような表情)","a resigned-looking smile (諦めたような笑顔)","resigned-looking eyes (諦めたような目)"],"synonyms":["acquiescent","submissive","unresisting","patient","stoical","fatalistic"],"antonyms":["resistant","defiant","rebellious","hopeful","optimistic"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'resigned' (past participle of the verb 'resign', meaning to accept something reluctantly but without protest) and 'looking' (referring to appearance). It describes someone whose appearance suggests they have given up hope or resistance.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈzaɪnd ˈlʊkɪŋ/","syllables":"re-signed look-ing"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Resigned-looking' describes a visible emotional state. It implies that the person has accepted a negative situation and is no longer actively fighting against it. The expression suggests a lack of hope or enthusiasm. It is often used to describe someone who is facing adversity or disappointment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was resigned-looking to the fact that he would lose.","correct":"✓ He had a resigned-looking expression on his face because he knew he would lose.","note":"'Resigned-looking' is an adjective describing appearance, not a verb. It should modify a noun like 'face' or 'expression'. 'Resigned to' is the correct phrase to express acceptance of a situation."},{"incorrect":"✗ The resigned-looking situation made everyone sad.","correct":"✓ The sad situation made everyone resigned-looking.","note":"'Resigned-looking' describes a person's appearance, not a situation. The situation might cause someone to look resigned, but the situation itself is not resigned-looking."}],"priority":"★★☆"},"related_words":{"derivatives":["resignedly (adverb: in a resigned manner)","resignation (noun: the acceptance of something undesirable)","resign (verb: to accept something reluctantly)"],"phrases":["look resigned (諦めたように見える)","appear resigned (諦めたように見える)","with a resigned air (諦めた様子で)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'resigned-looking' is relatively advanced and describes a specific emotional state visible in someone's appearance. It implies a passive acceptance of something negative, without resistance. Understanding this term requires a good grasp of vocabulary related to emotions and facial expressions."},"example_sentences":[{"sentence":"The prisoners had a resigned-looking air about them as they marched into the yard.","translation":"囚人たちは、庭に歩いて入るとき、諦めたような雰囲気を持っていた。","type":"adjective","meaning_category":"appearance"},{"sentence":"With a resigned-looking shrug, she handed over her resignation letter.","translation":"諦めたような肩をすくめて、彼女は辞表を手渡した。","type":"adjective","meaning_category":"appearance"},{"sentence":"Despite the bad news, he maintained a resigned-looking composure.","translation":"悪い知らせにもかかわらず、彼は諦めたような落ち着きを保った。","type":"adjective","meaning_category":"appearance"}]}