{"word":"Sumeria","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"シュメール（古代メソポタミア南部の地域）","english_definition":"an ancient region in southern Mesopotamia (modern Iraq), containing a number of independent cities and city-states which shared a common culture and language.","examples":[{"sentence":"Sumeria was the earliest known civilization in Mesopotamia.","translation":"シュメールはメソポタミアで最も初期に知られる文明でした。"},{"sentence":"The Sumerians developed a system of writing known as cuneiform.","translation":"シュメール人は楔形文字として知られる文字体系を発展させました。"},{"sentence":"The city-states of Sumeria were often at war with each other.","translation":"シュメールの都市国家は互いに戦争をしていることがよくありました。"}],"collocations":["ancient Sumeria (古代シュメール)","Sumerian civilization (シュメール文明)","Sumerian city-states (シュメールの都市国家)","the land of Sumeria (シュメールの地)"],"synonyms":["Land of Sumer","Ancient Sumer","Mesopotamia (in a broader context)"],"antonyms":[]}],"etymology":{"value":"Derived from Akkadian Šumeru, of uncertain origin, possibly from the Sumerian word ki-en-ĝir₁₅ (meaning \"land of the civilized lords\" or \"native land\").","priority":"★★☆"},"pronunciation":{"ipa":"/suːˈmɪəriə/","syllables":"Su-me-ri-a"},"inflection":{"notes":"Proper noun, no plural form."},"usage_notes":{"explanation":"'Sumeria' refers specifically to the geographical region and civilization in southern Mesopotamia during the Bronze Age. It is important to distinguish it from 'Mesopotamia', which is a broader term encompassing the entire region between the Tigris and Euphrates rivers. When discussing the people, language, or culture of this region, 'Sumerian' is used as an adjective or noun.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Sumeria was a country.","correct":"✓ Sumeria was a region containing city-states.","note":"Sumeria was not a unified country but a region composed of independent city-states."},{"incorrect":"✗ Sumerian is a modern language.","correct":"✓ Sumerian is an ancient, extinct language.","note":"Sumerian is an ancient language that is no longer spoken."}],"priority":"★☆☆"},"related_words":{"derivatives":["Sumerian (adjective: relating to Sumeria; noun: a person from Sumeria, the Sumerian language)"],"related_terms":["Mesopotamia","Akkad","Babylonia","Uruk","Ur","cuneiform"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2-C1 (historical contexts)","frequency_google_ngram":"Relatively low frequency, primarily used in historical or archaeological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sumeria' is a term primarily encountered in historical studies, archaeology, or related academic contexts. The term refers to a specific ancient region in southern Mesopotamia and its associated civilization. Understanding the term requires some familiarity with ancient history and geography. The related term 'Sumerian' is used to describe the people, language, and culture of Sumeria."},"example_sentences":[{"sentence":"The ruins of ancient cities in Sumeria provide valuable insights into early human civilization.","translation":"シュメールの古代都市の遺跡は、初期の人類文明に関する貴重な洞察を提供します。","type":"noun","meaning_category":"Geographical Region"},{"sentence":"Sumerian cuneiform is one of the earliest known forms of writing.","translation":"シュメールの楔形文字は、最も初期に知られる文字体系の一つです。","type":"adjective (as part of 'Sumerian cuneiform')","meaning_category":"Culture/Language"}]}