{"word":"Protectories","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"保護領 (protectory の複数形)","english_definition":"Plural form of protectory: states or territories controlled and protected by another.","examples":[{"sentence":"The European powers established numerous protectories in Africa during the colonial era.","translation":"ヨーロッパ列強は植民地時代にアフリカに多数の保護領を設立した。"},{"sentence":"These protectories were nominally independent but were heavily influenced by the dominant power.","translation":"これらの保護領は名目上は独立していたが、支配的な勢力から大きな影響を受けていた。"}],"collocations":["establish protectories","administer protectories","former protectories","UN protectories"],"synonyms":["dependencies","colonies","territories","spheres of influence"],"antonyms":["independent states","autonomous regions"]}],"etymology":{"value":"The word 'protectories' is derived from 'protectory,' which comes from 'protector.' 'Protector' originates from the Latin word 'protector,' meaning 'defender' or 'guardian.'","priority":"★★☆"},"pronunciation":{"ipa":"/pɹəˈtɛktəriz/","syllables":"pro-tec-to-ries"},"inflection":{"noun_plural":"protectories"},"usage_notes":{"explanation":"'Protectories' refers to multiple territories or states that are under the protection and control of a more powerful nation. These regions often maintain a degree of local autonomy but rely on the protecting power for defense and foreign policy. The term is commonly used in historical contexts, particularly when discussing colonial empires.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The protectories was established.","correct":"✓ The protectories were established.","note":"'Protectories' is a plural noun, so it requires a plural verb form ('were' instead of 'was')."},{"incorrect":"✗ Protectories is a type of independent country.","correct":"✓ Protectories are a type of dependent territory.","note":"Protectories are dependent territories, not independent countries."}],"priority":"★★☆"},"related_words":{"derivatives":["protectory","protector","protect","protection","protective"],"related_concepts":["colonialism","imperialism","mandate","trust territory","sphere of influence"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in historical or political contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'protectories' is a plural noun referring to multiple territories or states under the protection and control of a more powerful nation. It is often used in historical and political contexts to describe relationships where a weaker state relies on a stronger state for defense and foreign policy, while maintaining some level of internal autonomy. Understanding this term requires knowledge of historical power dynamics and international relations.","priority":"★★☆"},"example_sentences":[{"sentence":"Many former colonies transitioned into independent nations after previously existing as protectories.","translation":"かつての植民地の多くは、以前は保護領として存在していた後、独立国家へと移行した。","type":"general usage","meaning_category":"historical context"},{"sentence":"The League of Nations established several mandates, which were essentially protectories under international supervision.","translation":"国際連盟はいくつかの委任統治領を設立したが、これらは本質的に国際的な監督下にある保護領であった。","type":"political science","meaning_category":"international relations"},{"sentence":"The local customs and laws were often preserved within the protectories, although the dominant power exerted significant influence.","translation":"支配的な勢力が大きな影響力を行使していたが、保護領内では地元の慣習や法律がしばしば維持されていた。","type":"historical context","meaning_category":"governance"}]}