{"word":"pilferingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"こっそりと盗むように、ちょろまかすように","english_definition":"In a manner that involves stealing small items or amounts, often in a sneaky or surreptitious way.","examples":[{"sentence":"He pilferingly took a cookie from the jar when no one was looking.","translation":"彼は誰も見ていない隙に、こっそりと瓶からクッキーを盗んだ。"},{"sentence":"She pilferingly slipped a pen into her bag from the office supply cabinet.","translation":"彼女はオフィスの備品棚からこっそりとペンをバッグに滑り込ませた。"},{"sentence":"The child pilferingly grabbed a piece of candy from the store counter.","translation":"子供は店のカウンターからこっそりとキャンディーを掴んだ。"}],"collocations":["act pilferingly","behave pilferingly","take pilferingly","grab pilferingly","slip pilferingly"],"synonyms":["furtively","surreptitiously","stealthily","secretly","covertly","sneakily","underhandedly"],"antonyms":["openly","honestly","forthrightly","overtly"]}],"etymology":{"value":"The word \"pilferingly\" is derived from the verb \"pilfer,\" which means to steal small items or amounts, especially in a sneaky or surreptitious way. The suffix \"-ing\" turns the verb into a present participle or gerund, and the suffix \"-ly\" transforms it into an adverb, indicating the manner in which the action of pilfering is performed.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɪlfərɪŋli/","syllables":"pil-fer-ing-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"\"Pilferingly\" describes an action done in a way that suggests small, often petty, theft. It implies a degree of sneakiness or secrecy. The term is relatively uncommon in everyday conversation but may be used in descriptive writing to convey a sense of underhandedness or petty crime. It is more formal than words like sneakily or stealthily.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He pilferingly honest.","correct":"✓ He is pilferingly dishonest.","note":"\"Pilferingly\" describes the manner of an action, so it should be used to modify a verb or describe a state of being dishonest, not to directly describe someone as honest."},{"incorrect":"✗ She pilferingly the money.","correct":"✓ She pilfered the money pilferingly.","note":"\"Pilferingly\" is an adverb, so it modifies a verb. The verb \"pilfered\" is needed to show the action of stealing."}],"priority":"★☆☆"},"related_words":{"derivatives":["pilfer (verb: to steal small items or amounts)","pilferer (noun: a person who steals small items or amounts)","pilferage (noun: the act of stealing small items or amounts)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'pilferingly' is an adverb that describes how an action is performed, specifically the action of stealing small items or amounts in a sneaky or secretive way. It is not a commonly used word and is more likely to be found in formal writing or literature. Understanding this word requires a good vocabulary and the ability to recognize the nuances of adverbs that describe manner.","priority":"★☆☆"},"example_sentences":[{"sentence":"The squirrel pilferingly snatched nuts from the bird feeder.","translation":"リスはこっそりと鳥の餌箱からナッツを盗んだ。","type":"adverb","meaning_category":"manner of stealing"},{"sentence":"He pilferingly glanced at her test paper, hoping to catch a glimpse of the answers.","translation":"彼はこっそりと彼女のテスト用紙を盗み見た、答えを垣間見ようとして。","type":"adverb","meaning_category":"manner of looking"},{"sentence":"She pilferingly added extra ingredients to her dish while the chef wasn't watching.","translation":"彼女はシェフが見ていない隙に、こっそりと自分の料理に余分な材料を加えた。","type":"adverb","meaning_category":"manner of adding"}]}