{"word":"archphilosopher","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"主要な哲学者、または哲学者の長","english_definition":"A leading philosopher; the chief of philosophers.","examples":[{"sentence":"Plato is often considered the archphilosopher of ancient Greece.","translation":"プラトンは古代ギリシャの主要な哲学者と見なされることが多い。"},{"sentence":"He styled himself as the archphilosopher of the movement.","translation":"彼はその運動の哲学者たちの長であると自称した。"}],"collocations":["the archphilosopher of a movement","an archphilosopher of the time"],"synonyms":["leading philosopher","chief philosopher","master philosopher"],"antonyms":["minor philosopher","lesser philosopher"]}],"etymology":{"value":"\"arch-\" (chief, principal) + \"philosopher\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɑːrtʃfɪˈlɒsəfər/","syllables":"arch-phi-los-o-pher"},"inflection":{"noun_plural":"archphilosophers"},"usage_notes":{"explanation":"The term \"archphilosopher\" is not commonly used. It suggests someone who is preeminent or the most important among philosophers. It can also be used to describe someone who sees themselves as the leading figure in a philosophical movement.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an archphilosopher, but his ideas are not original.","correct":"✓ He is considered an archphilosopher, but his ideas are not original.","note":"The term is often used when someone is widely recognized as a leading philosopher, not just because they claim to be one."}],"priority":"★★☆"},"related_words":{"derivatives":["arch- (prefix meaning chief or principal)","philosopher","philosophy"],"phrases":["leading intellectual","prominent thinker"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"archphilosopher\" is a relatively rare and sophisticated term. It is used to describe a philosopher who is considered to be a leading or chief figure in their field. Understanding the prefix \"arch-\" as meaning \"chief\" or \"principal\" is helpful in deciphering the word's meaning. This term is more likely to be encountered in academic or philosophical contexts."},"example_sentences":[{"sentence":"Immanuel Kant is regarded by many as an archphilosopher of the Enlightenment.","translation":"イマヌエル・カントは、多くの人によって啓蒙時代の主要な哲学者と見なされている。","type":"noun","meaning_category":"主要な哲学者"},{"sentence":"Some consider him the archphilosopher of existentialism, though others disagree.","translation":"彼を実存主義の主要な哲学者と見なす人もいるが、そうでない人もいる。","type":"noun","meaning_category":"主要な哲学者"}]}