{"word":"photoreactivation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"光回復、光再活性","english_definition":"The enzymatic cleavage of pyrimidine dimers in DNA that have been caused by ultraviolet radiation; the enzyme requires visible light for its activity.","examples":[{"sentence":"Photoreactivation is a DNA repair mechanism that uses light to reverse UV damage.","translation":"光回復は、紫外線によるDNA損傷を修復するために光を利用するDNA修復機構である。"},{"sentence":"The enzyme photolyase is responsible for photoreactivation.","translation":"酵素フォトリアーゼは光回復を担う。"}],"collocations":["DNA photoreactivation","direct photoreactivation","enzymatic photoreactivation"],"synonyms":["light repair","photolyase repair"],"antonyms":[]}],"etymology":{"value":"photo- (光) + reactivation (再活性化)。紫外線によって損傷したDNAが、光のエネルギーを利用して修復される現象に由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfoʊtoʊriˌæktɪˈveɪʃən/","syllables":"pho-to-re-ac-ti-va-tion"},"inflection":{"noun_plural":"photoreactivations"},"usage_notes":{"explanation":"Photoreactivation is a specific DNA repair mechanism that directly reverses damage caused by ultraviolet (UV) light. It is distinct from other DNA repair pathways like nucleotide excision repair (NER) or mismatch repair (MMR). The enzyme photolyase binds to pyrimidine dimers (commonly thymine dimers) formed by UV radiation and, upon exposure to visible light (specifically blue light), cleaves the bond between the pyrimidines, restoring the DNA to its original state. This process is found in many organisms, including bacteria, fungi, plants, and some animals, but is notably absent in placental mammals, including humans.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Photoreactivation repairs all types of DNA damage.","correct":"✓ Photoreactivation specifically repairs pyrimidine dimers caused by UV radiation.","note":"光回復は、すべての種類のDNA損傷を修復するわけではありません。紫外線によって引き起こされたピリミジンダイマーを特異的に修復します。"},{"incorrect":"✗ Photoreactivation occurs in humans.","correct":"✓ Photoreactivation does not occur in placental mammals, including humans.","note":"光回復はヒトを含む胎盤哺乳類では起こりません。"}],"priority":"★★☆"},"related_words":{"derivatives":["photolyase (フォトリアーゼ: 光回復を触媒する酵素)","DNA repair (DNA修復)","pyrimidine dimer (ピリミジンダイマー: 紫外線によって形成されるDNA損傷)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 生物学、特に分子生物学の分野で使われる専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**photoreactivation**」は、紫外線によってDNAにできた損傷を、光を使って直接修復する仕組みのことです。特に、紫外線によってできるピリミジンダイマーというDNAの異常構造を、フォトリアーゼという酵素が光のエネルギーを使って元の状態に戻します。この仕組みは多くの生物に見られますが、人間のような胎盤を持つ哺乳類にはありません。専門的な生物学の分野で使われる言葉です。"},"example_sentences":[{"sentence":"**Photoreactivation** is an important mechanism for repairing UV-induced DNA damage in bacteria.","translation":"光回復は、細菌における紫外線誘発DNA損傷を修復するための重要なメカニズムである。","type":"general","meaning_category":"DNA修復機構"},{"sentence":"The efficiency of **photoreactivation** depends on the wavelength of light.","translation":"光回復の効率は、光の波長に依存する。","type":"scientific","meaning_category":"効率"},{"sentence":"The enzyme photolyase plays a key role in **photoreactivation**.","translation":"酵素フォトリアーゼは光回復において重要な役割を果たす。","type":"scientific","meaning_category":"酵素"}]}