{"word":"bulbilla","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物学) 珠芽（しゅが）：葉腋などにできる、養分を蓄えて繁殖に役立つ小球状の器官。","english_definition":"(botany) A small bulb-like structure, especially one formed in the place of a flower or in a leaf axil, that can develop into a new plant.","examples":[{"sentence":"Some lilies reproduce by bulbillas that form in their leaf axils.","translation":"いくつかのユリは、葉腋にできる珠芽によって繁殖する。"},{"sentence":"The bulbillas of this plant are easily detached and can grow into new individuals.","translation":"この植物の珠芽は容易に分離し、新しい個体として成長することができる。"}],"collocations":["leaf axil bulbilla","aerial bulbilla"],"synonyms":["bulbil","offset","propagule"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin 'bulbus' (bulb) with the diminutive suffix '-illa'.","priority":"★★☆"},"pronunciation":{"ipa":"/bʌlˈbɪlə/","syllables":"bul-bil-la"},"inflection":{"noun_plural":"bulbillae"},"usage_notes":{"explanation":"Bulbillas are vegetative propagules, meaning they are structures that allow a plant to reproduce asexually. They are essentially small bulbs that form on the parent plant and can detach to grow into new, genetically identical individuals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant reproduces by seeds and bulbilla.","correct":"✓ The plant reproduces by seeds and bulbillae.","note":"'Bulbilla' is singular; the plural form is 'bulbillae'."}],"priority":"★☆☆"},"related_words":{"derivatives":["bulbil (類義語)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 植物学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'bulbilla' is a botanical term referring to a small, bulb-like structure that functions as a means of vegetative reproduction in certain plants. Understanding this term requires some familiarity with botanical concepts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The tiger lily is known for producing prominent bulbillas along its stem.","translation":"オニユリは、茎に沿って目立つ珠芽を生成することで知られている。","type":"noun","meaning_category":"植物学"},{"sentence":"These bulbillas can be collected and planted to propagate new plants.","translation":"これらの珠芽は収集して植え付けることで、新しい植物を繁殖させることができる。","type":"noun","meaning_category":"植物学"}]}