{"word":"Pannonia","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"パンノニア（古代ローマ帝国の属州の一つ。現在のハンガリー西部、オーストリア東部、クロアチア北部、セルビア北部、スロベニア東部、スロバキア西部を含む地域）","english_definition":"An ancient province of the Roman Empire, located in the area of present-day western Hungary, eastern Austria, northern Croatia, northern Serbia, Slovenia, and western Slovakia.","examples":[{"sentence":"Pannonia was conquered by the Roman Empire in the 1st century BC.","translation":"パンノニアは紀元前1世紀にローマ帝国によって征服された。"},{"sentence":"The Romans established several important cities in Pannonia.","translation":"ローマ人はパンノニアにいくつかの重要な都市を建設した。"}],"collocations":["Roman Pannonia","Province of Pannonia","Upper Pannonia","Lower Pannonia"],"synonyms":["N/A"],"antonyms":["N/A"]}],"etymology":{"value":"The name 'Pannonia' is of uncertain origin, but it is believed to be derived from a local Illyrian or Celtic language.","priority":"★★☆"},"pronunciation":{"ipa":"/pæˈnoʊniə/","syllables":"Pan-no-ni-a"},"inflection":{"notes":"Proper noun, no plural form."},"usage_notes":{"explanation":"Pannonia is primarily used in historical contexts when discussing the Roman Empire and its provinces. It is not commonly used in modern geographical discussions, as the area is now divided among several countries. When referring to the region today, it's more appropriate to use the names of the modern countries that occupy the area.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to Pannonia for vacation.","correct":"✓ I'm going to Hungary/Austria/Croatia, etc. for vacation.","note":"Use the modern country names instead of 'Pannonia' when discussing travel to the region today."}],"priority":"★☆☆"},"related_words":{"derivatives":["Pannonian (adjective, relating to Pannonia; noun, a person from Pannonia)"],"phrases":["N/A"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Primarily used in historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Pannonia' is primarily encountered in historical texts and discussions related to the Roman Empire. Understanding its geographical context requires familiarity with ancient history and the modern-day countries that occupy the region. It is not a term commonly used in everyday conversation or contemporary geographical discussions."},"example_sentences":[{"sentence":"The Roman legions were stationed in Pannonia to defend the empire's borders.","translation":"ローマ軍団は帝国の国境を守るためにパンノニアに駐屯していた。","type":"historical context","meaning_category":"Roman Province"},{"sentence":"Pannonian wine was highly valued in ancient Rome.","translation":"パンノニアのワインは古代ローマで高く評価されていた。","type":"historical context","meaning_category":"Roman Province"}]}