{"word":"bioactivation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"生体内活性化、バイオアクティベーション","english_definition":"The metabolic process by which a xenobiotic (foreign chemical substance) is converted into a more reactive or toxic form within a living organism.","examples":[{"sentence":"Bioactivation of certain drugs can lead to toxic side effects.","translation":"特定の薬物の生体内活性化は、毒性の副作用を引き起こす可能性があります。"},{"sentence":"The enzyme CYP450 is involved in the bioactivation of many procarcinogens.","translation":"酵素CYP450は、多くのプロ発がん物質の生体内活性化に関与しています。"},{"sentence":"Understanding the mechanisms of bioactivation is crucial for drug development and toxicology.","translation":"生体内活性化のメカニズムを理解することは、医薬品開発と毒性学にとって非常に重要です。"}],"collocations":["CYP450 bioactivation","metabolic bioactivation","drug bioactivation","procarcinogen bioactivation"],"synonyms":["metabolic activation"],"antonyms":["detoxification","bioinactivation"]},{"part_of_speech":"verb","definition":"生体内活性化する","english_definition":"To convert a substance into a more active or toxic form within a living organism.","examples":[{"sentence":"Some chemicals are bioactivated in the liver.","translation":"いくつかの化学物質は肝臓で生体内活性化されます。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term 'bioactivation' is formed by combining 'bio-' (referring to life or living organisms) and 'activation' (the process of making something active or reactive).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbaɪoʊˌæktɪˈveɪʃən/","syllables":"bi-o-ac-ti-va-tion"},"inflection":{"noun_plural":"bioactivations","verb_forms":{}},"usage_notes":{"explanation":"Bioactivation is a critical concept in pharmacology and toxicology. It describes how the body's own metabolic processes can sometimes transform relatively harmless substances into harmful ones. This is particularly important in drug metabolism, where a drug may be designed to be inactive until bioactivated in the body, or where bioactivation leads to unwanted side effects.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The drug is deactivated by bioactivation.","correct":"✓ The drug is activated by bioactivation.","note":"Bioactivation makes a substance *more* active, not less. Deactivation is the opposite process."}],"priority":"★★☆"},"related_words":{"derivatives":["bioactivate (verb)","bioactivated (adjective)"],"phrasal_verbs":[],"related_terms":["xenobiotic","metabolism","CYP450","procarcinogen","detoxification","toxicology","pharmacology"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Bioactivation' is a technical term used in biology, pharmacology, and toxicology. It refers to the process where a substance, often a foreign chemical (xenobiotic) like a drug or pollutant, is transformed by the body's own enzymes into a more active or toxic form. This can have important consequences for how drugs work and how toxic substances affect the body. Understanding bioactivation is key to developing safer drugs and assessing the risks of environmental chemicals.","priority":"★★☆"},"example_sentences":[{"sentence":"The **bioactivation** of benzo[a]pyrene leads to the formation of a potent carcinogen.","translation":"ベンゾ[a]ピレンの生体内活性化は、強力な発がん物質の形成につながります。","type":"noun","meaning_category":"生体内活性化"},{"sentence":"Certain pesticides undergo **bioactivation** in insects, making them more toxic.","translation":"特定の殺虫剤は昆虫内で生体内活性化を受け、より毒性が高まります。","type":"noun","meaning_category":"生体内活性化"},{"sentence":"Researchers are studying how to prevent the **bioactivation** of certain drugs to reduce side effects.","translation":"研究者たちは、特定の薬物の生体内活性化を防ぎ、副作用を軽減する方法を研究しています。","type":"noun","meaning_category":"生体内活性化"}]}