{"word":"auxiliation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"助動詞化、補助動詞化","english_definition":"The process by which a lexical verb becomes a grammatical auxiliary verb.","examples":[{"sentence":"Auxiliation is a common process in the development of grammatical structures.","translation":"助動詞化は、文法構造の発達において一般的なプロセスです。"},{"sentence":"The auxiliation of 'have' in English led to the formation of the perfect aspect.","translation":"英語における 'have' の助動詞化は、完了相の形成につながりました。"}],"collocations":["grammaticalization","diachronic linguistics","historical linguistics"],"synonyms":["grammaticalization"],"antonyms":[]}],"etymology":{"value":"From 'auxiliary' + '-ation'.","priority":"★★★"},"pronunciation":{"ipa":"/ɔːɡˌzɪliˈeɪʃən/","syllables":"aux-il-i-a-tion"},"inflection":{"noun_plural":"auxiliations"},"usage_notes":{"explanation":"Auxiliation is a term used in linguistics, specifically in the study of grammaticalization. It refers to the process where a lexical verb (a verb with a full semantic meaning) gradually loses its original meaning and function, and evolves into a grammatical auxiliary verb (a verb that helps to express tense, aspect, mood, or voice). This process often involves semantic bleaching, phonological reduction, and syntactic reanalysis.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The auxiliation is when a verb is helping another verb.","correct":"✓ Auxiliation is the process by which a verb becomes an auxiliary.","note":"Auxiliation is a process, not a state of being. Therefore, use the correct definition to describe it."}],"priority":"★★☆"},"related_words":{"derivatives":["auxiliary","auxiliary verb","grammaticalization"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Auxiliation' is a technical term in linguistics describing how a regular verb changes into a helping verb (auxiliary verb) over time. This involves the original verb losing some of its meaning and becoming more about grammar than content. It's a key concept in understanding how languages evolve.","priority":"★★☆"},"example_sentences":[{"sentence":"The **auxiliation** of 'will' from a verb meaning 'to want' is an example of grammatical change.","translation":"「will」の「～したい」という意味の動詞から助動詞への変化は、文法変化の一例です。","type":"noun","meaning_category":"助動詞化"},{"sentence":"Through **auxiliation**, certain verbs lose their original lexical meaning and become markers of tense or aspect.","translation":"助動詞化を通じて、特定の動詞は元の語彙的な意味を失い、時制や相の標識となります。","type":"noun","meaning_category":"助動詞化"}]}