{"word":"aroids","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"サトイモ科の植物","english_definition":"Plants belonging to the family Araceae, characterized by a spathe and spadix.","examples":[{"sentence":"Aroids are often grown as houseplants due to their attractive foliage.","translation":"サトイモ科の植物は、魅力的な葉のため、観葉植物として栽培されることが多いです。"},{"sentence":"Many aroids thrive in tropical rainforests.","translation":"多くのサトイモ科の植物は熱帯雨林で生育します。"}],"collocations":["grow aroids","collect aroids","rare aroids","tropical aroids"],"synonyms":["Araceae","arum family"],"antonyms":[]}],"etymology":{"value":"Derived from the family name Araceae, which comes from the genus Arum.","priority":"★★☆"},"pronunciation":{"ipa":"ˈærɔɪdz","syllables":"ar-oids"},"inflection":{"noun_plural":"aroids"},"usage_notes":{"explanation":"'Aroids' refers to plants in the Araceae family. These plants are characterized by a unique inflorescence structure consisting of a spathe (a modified leaf) and a spadix (a fleshy spike bearing small flowers). Many popular houseplants, such as peace lilies, pothos, and philodendrons, belong to this family.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ A aroid is a type of flower.","correct":"✓ An aroid is a type of plant.","note":"Aroids are a family of plants, not just flowers, although they do produce flowers."},{"incorrect":"✗ Aroids need direct sunlight.","correct":"✓ Aroids often prefer indirect sunlight.","note":"Many aroids prefer indirect sunlight, as they are adapted to growing under the canopy of forests."}],"priority":"★★☆"},"related_words":{"derivatives":["aroid (singular form)","Araceae (family name)","Arum (genus)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Aroids' is a term used to refer to plants belonging to the Araceae family. These plants are characterized by their unique flower structure, which includes a spathe and spadix. Many common houseplants are aroids. The term is primarily used in botanical or horticultural contexts. Understanding the term requires some familiarity with plant classification.","priority":"★★☆"},"example_sentences":[{"sentence":"The botanist specialized in the study of rare aroids.","translation":"その植物学者は珍しいサトイモ科の植物の研究を専門としていた。","type":"noun","meaning_category":"植物"},{"sentence":"She decorated her living room with various aroids.","translation":"彼女はリビングルームを様々なサトイモ科の植物で飾った。","type":"noun","meaning_category":"植物"},{"sentence":"Aroids are known for their diverse leaf shapes and patterns.","translation":"サトイモ科の植物は、多様な葉の形や模様で知られている。","type":"noun","meaning_category":"植物"}]}