{"word":"Azande","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"アザンデ族 (中央アフリカに居住する民族集団)","english_definition":"A group of people living in Central Africa, primarily in northeastern Congo, southern Sudan, and southeastern Central African Republic.","examples":[{"sentence":"The Azande are known for their complex social organization and traditional beliefs.","translation":"アザンデ族は、複雑な社会組織と伝統的な信仰で知られています。"}],"collocations":["Azande people","Azande culture","Azande society","Azande language"],"synonyms":["N/A"],"antonyms":["N/A"]},{"part_of_speech":"noun","definition":"アザンデ語 (アザンデ族が話す言語)","english_definition":"The language spoken by the Azande people, belonging to the Ubangian language family.","examples":[{"sentence":"Azande is a tonal language with a complex grammatical structure.","translation":"アザンデ語は、複雑な文法構造を持つ声調言語です。"}],"collocations":["speak Azande","Azande language family","Azande grammar","Azande vocabulary"],"synonyms":["Zande"],"antonyms":["N/A"]},{"part_of_speech":"adjective","definition":"アザンデ族の、アザンデ語の","english_definition":"Relating to the Azande people or their language.","examples":[{"sentence":"Azande traditional music is rich in rhythm and melody.","translation":"アザンデ族の伝統音楽は、リズムとメロディーが豊かです。"},{"sentence":"The Azande culture has been influenced by neighboring ethnic groups.","translation":"アザンデ族の文化は、近隣の民族集団の影響を受けています。"}],"collocations":["Azande culture","Azande traditions","Azande music","Azande art"],"synonyms":["Zande"],"antonyms":["N/A"]}],"etymology":{"value":"The name 'Azande' is derived from the language spoken by the Azande people. The exact origin and meaning of the name within the Azande language are complex and subject to scholarly debate.","priority":"★★☆"},"pronunciation":{"ipa":"/ɑːˈzɑːndi/","syllables":"A-zan-de"},"inflection":{"noun_plural":"Azande (usually used as a collective noun, so plural form is less common)"},"usage_notes":{"explanation":"'Azande' can refer to the people, their language, or anything related to their culture. When referring to the people, it is often used as a collective noun (e.g., 'The Azande live in Central Africa'). The term 'Zande' is sometimes used as a synonym, but 'Azande' is generally preferred in academic and formal contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Azande is a person.","correct":"✓ An Azande person. / ✓ The Azande are a people.","note":"'Azande' refers to the group, so use 'an Azande person' for an individual or 'the Azande are' to refer to the people collectively."},{"incorrect":"✗ Azandes language.","correct":"✓ Azande language.","note":"'Azande' is used as an adjective, so it doesn't need a possessive form."}],"priority":"★★☆"},"related_words":{"derivatives":["N/A"],"phrasal_verbs":["N/A"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Azande' is a specific term referring to an ethnic group and their language in Central Africa. Understanding this term requires knowledge of African cultures and linguistics. It is typically encountered in academic texts, anthropological studies, or discussions related to African history and society. The word itself is not complex, but the context in which it is used requires a higher level of understanding. "},"example_sentences":[{"sentence":"The **Azande** are known for their traditional witchcraft beliefs.","translation":"アザンデ族は、伝統的な魔術の信仰で知られています。","type":"noun","meaning_category":"民族"},{"sentence":"He is studying the **Azande** language at the university.","translation":"彼は大学でアザンデ語を研究しています。","type":"noun","meaning_category":"言語"},{"sentence":"**Azande** art often incorporates intricate patterns and symbolism.","translation":"アザンデ族の芸術は、しばしば複雑な模様と象徴を取り入れています。","type":"adjective","meaning_category":"文化"}]}