{"word":"leucocytopenia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"白血球減少症","english_definition":"A condition in which a person has an abnormally low number of leukocytes (white blood cells) in the blood, which increases the risk of infection.","examples":[{"sentence":"Leucocytopenia can be a side effect of certain medications.","translation":"白血球減少症は特定の薬の副作用である可能性があります。"},{"sentence":"The patient's leucocytopenia made them susceptible to opportunistic infections.","translation":"患者の白血球減少症により、日和見感染症にかかりやすくなりました。"}],"collocations":["severe leucocytopenia","drug-induced leucocytopenia","leucocytopenia and neutropenia"],"synonyms":["leukopenia","white blood cell deficiency"],"antonyms":["leukocytosis","high white blood cell count"]}],"etymology":{"value":"From 'leukocyte' (white blood cell) + '-penia' (deficiency). 'Leukocyte' comes from Greek 'leukos' (white) + 'kytos' (cell). '-penia' comes from Greek 'penia' (poverty, deficiency).","priority":"★★☆"},"pronunciation":{"ipa":"ˌluːkoʊˌsaɪtəˈpiːniə","syllables":"leu-co-cy-to-pe-ni-a"},"inflection":{"noun_plural":"leucocytopenias"},"usage_notes":{"explanation":"Leucocytopenia is a medical term referring specifically to a decrease in the number of white blood cells. It is often used interchangeably with leukopenia, although some sources may differentiate them based on the specific types of white blood cells affected. The condition can be caused by various factors, including infections, medications, autoimmune disorders, and bone marrow disorders.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor said I have leucocytosis, which is a low white blood cell count.","correct":"✓ The doctor said I have leucocytopenia, which is a low white blood cell count.","note":"Leucocytosis is a high white blood cell count, while leucocytopenia is a low white blood cell count."},{"incorrect":"✗ Leucocytopenia is treated with antibiotics.","correct":"✓ Leucocytopenia is managed by addressing the underlying cause and preventing infections.","note":"Leucocytopenia itself is not treated with antibiotics. The focus is on treating the underlying cause and preventing infections due to the weakened immune system."}],"priority":"★★☆"},"related_words":{"derivatives":["leukocyte","leukopenia","neutropenia","thrombocytopenia","pancytopenia"],"medical_terms":["agranulocytosis","aplastic anemia","myelodysplastic syndrome"],"priority":"★★☆"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency - Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Leucocytopenia' is a technical medical term that describes a condition characterized by a reduced number of white blood cells in the body. This condition can compromise the immune system, making individuals more susceptible to infections. The term is primarily used in medical settings and is understood by healthcare professionals. Understanding this term is essential for those in the medical field and can be helpful for patients diagnosed with the condition to better understand their health status and treatment options."},"example_sentences":[{"sentence":"Chemotherapy can sometimes lead to leucocytopenia, increasing the risk of infection.","translation":"化学療法は時に白血球減少症を引き起こし、感染のリスクを高める可能性があります。","type":"medical","meaning_category":"cause"},{"sentence":"Regular blood tests are necessary to monitor for leucocytopenia in patients taking immunosuppressant drugs.","translation":"免疫抑制剤を服用している患者では、白血球減少症を監視するために定期的な血液検査が必要です。","type":"medical","meaning_category":"monitoring"},{"sentence":"Severe leucocytopenia may require treatment with growth factors to stimulate white blood cell production.","translation":"重度の白血球減少症では、白血球の産生を刺激するために成長因子による治療が必要になる場合があります。","type":"medical","meaning_category":"treatment"}]}