{"word":"nephometer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"雲量計、濁度計","english_definition":"An instrument for measuring the amount of cloudiness; an instrument for measuring the turbidity of a liquid.","examples":[{"sentence":"The nephometer indicated a high level of cloud cover.","translation":"雲量計は高い雲量を示した。"},{"sentence":"The scientist used a nephometer to measure the turbidity of the water sample.","translation":"科学者はネフロメーターを使って水サンプルの濁度を測定した。"}],"collocations":["use a nephometer","nephometer reading","measure turbidity with a nephometer"],"synonyms":["turbidimeter","cloud gauge"],"antonyms":[]},{"part_of_speech":"noun","definition":"(気象学) 雲の高さと動きを測定する装置","english_definition":"(Meteorology) An instrument for measuring the height and velocity of clouds.","examples":[{"sentence":"The airport's nephometer helps in predicting short-term weather changes.","translation":"空港のネフロメーターは短期的な天候の変化を予測するのに役立つ。"}],"collocations":["airport nephometer","laser nephometer"],"synonyms":["ceilometer"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'nephos' (cloud) and 'metron' (measure).","priority":"★★☆"},"pronunciation":{"ipa":"/nɛˈfɒmɪtər/","syllables":"ne-pho-me-ter"},"inflection":{"noun_plural":"nephometers"},"usage_notes":{"explanation":"A nephometer is used in two primary contexts: measuring cloudiness in meteorology and measuring turbidity (cloudiness or haziness) in liquids. In meteorology, it can also refer to instruments that measure cloud height and velocity. The specific type of nephometer and its application depend on the field of study.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nephometer measured the rain fall.","correct":"✓ The rain gauge measured the rain fall.","note":"A nephometer measures cloudiness or turbidity, not rainfall. A rain gauge measures rainfall."}],"priority":"★☆☆"},"related_words":{"derivatives":["nephometry (noun: the measurement of cloudiness or turbidity)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"nephometer\" refers to a specialized instrument used in scientific contexts. It has two main applications: measuring cloudiness (cloud cover) in meteorology and measuring the turbidity (cloudiness or haziness) of liquids in environmental science or chemistry. Understanding the specific context is necessary to determine which type of measurement is being taken. This term is not commonly used in everyday language."},"example_sentences":[{"sentence":"The research team deployed a **nephometer** to monitor air quality in the urban area.","translation":"研究チームは都市部の空気の質を監視するためにネフロメーターを配備した。","type":"noun","meaning_category":"濁度計"},{"sentence":"The airport uses a laser **nephometer** to determine cloud height during low visibility conditions.","translation":"空港では、視界不良時に雲の高さを判断するためにレーザーネフロメーターを使用している。","type":"noun","meaning_category":"雲量計"}]}