{"word":"Balor","priority":"★★☆","meanings":[{"part_of_speech":"proper noun","definition":"バロール（ケルト神話に登場する邪眼の王）","english_definition":"In Irish mythology, a king of the Fomorians, a race of supernatural beings, often depicted as a giant with a destructive eye.","examples":[{"sentence":"Balor's evil eye could destroy armies with a single glance.","translation":"バロールの邪眼は一瞥で軍隊を滅ぼすことができた。"},{"sentence":"The prophecy foretold that Balor would be killed by his grandson.","translation":"予言はバロールが孫に殺されると告げていた。"}],"cultural_context":"主にアイルランド神話の『マグ・トゥイレドの戦い』で言及される。邪眼の力を持つ一方、まぶたが重く普段は閉じているという描写が特徴的。","synonyms":["Fomorian king","Evil-eye king"],"antonyms":["Lugh (孫で宿敵)","Tuatha Dé Danann (敵対する神族)"]},{"part_of_speech":"noun","definition":"破壊的な力を持つ存在（神話に由来する比喩的用法）","english_definition":"A metaphor for someone or something possessing destructive power, derived from the mythological figure.","examples":[{"sentence":"The dictator was called the Balor of modern times for his ruthless suppression.","translation":"その独裁者は残忍な弾圧で現代のバロールと呼ばれた。"}],"usage_notes":"比喩表現として用いる場合、文脈によっては大文字表記しない場合もある"}],"etymology":{"value":"古アイルランド語『Balar』に由来。語源は『死をもたらす者』を意味する可能性がある。インド・ヨーロッパ祖語の『*bhel-』（光る、燃える）と関連づける説も存在（邪眼の描写と関連）。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈbælɔːr/","syllables":"Ba-lor"},"cultural_importance":{"description":"ケルト神話における代表的な敵対者として、現代のファンタジー作品にも影響を与えている。邪眼のモチーフは様々な創作物で再利用される。","references":["『マグ・トゥイレドの戦い』（中世アイルランドの叙事詩）","『ケルズの書』（関連写本）"]},"modern_usage":{"description":"現代ではファンタジー小説・ゲーム・コミック等で悪役キャラクターとして登場することが多い。例：『ダンジョンズ＆ドラゴンズ』のデーモンロード、『Fate/Grand Order』のサーヴァントなど。","examples":[{"sentence":"The video game boss was clearly inspired by Balor's mythological traits.","translation":"そのゲームのボスキャラは明らかにバロールの神話的特徴から影響を受けていた。"}]},"related_terms":[{"term":"Fomorians","relation":"バロールが属していた種族"},{"term":"Lugh","relation":"バロールを倒した孫（光の神）"},{"term":"Evil Eye","relation":"バロールの象徴的能力"}],"example_sentences":[{"sentence":"In the legend, Balor kept his deadly eye closed except in battle.","translation":"伝説では、バロールは戦いの時以外は致命的な目を閉じていた。","context":"神話的な特徴の説明"},{"sentence":"The artist's depiction of Balor emphasized his cyclopean nature.","translation":"その画家のバロール描写は単眼的な性質を強調していた。","context":"現代的な解釈"}]}