{"word":"Tree-goose","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A name formerly applied to the barnacle goose, based on the belief that it grew on trees or from driftwood.","english_definition":"An archaic name for the barnacle goose, reflecting the former belief that it developed from trees or driftwood.","examples":[{"sentence":"In medieval times, the tree-goose was thought to originate from barnacles attached to trees.","translation":"中世には、ツリーグースは木に取り付けられたフジツボから発生すると考えられていました。"},{"sentence":"The myth of the tree-goose allowed it to be eaten during Lent, as it was not considered to be 'flesh.'","translation":"ツリーグースの神話により、四旬節の間に食べることが許可されました。なぜなら「肉」とは見なされていなかったからです。"}],"collocations":["tree-goose myth","tree-goose legend"],"synonyms":["barnacle goose"],"antonyms":[]},{"part_of_speech":"noun","definition":"A goose that nests or spends time in trees.","english_definition":"A goose species that nests or spends time in trees.","examples":[{"sentence":"The knob-billed duck, sometimes called a tree-goose, nests in tree cavities.","translation":"コブハシリュウキュウガモは、ツリーグースと呼ばれることもあり、木の空洞に巣を作ります。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term 'tree-goose' arose from medieval folklore, where it was believed that barnacle geese developed from barnacles attached to trees or from driftwood in the sea. This belief stemmed from the lack of knowledge about the geese's breeding grounds, which are located in the Arctic.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtriː ɡuːs/","syllables":"tree-goose"},"inflection":{"noun_plural":"tree-geese"},"usage_notes":{"explanation":"The term 'tree-goose' is primarily historical, referring to the barnacle goose and the associated myth. Modernly, it might occasionally be used to describe any goose species that nests in trees, although this usage is less common.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a tree-goose building a nest on the ground.","correct":"✓ I saw a barnacle goose building a nest on the ground.","note":"If referring to the barnacle goose, use the correct modern name. If referring to a goose nesting in a tree, specify the species if known."}],"priority":"★★☆"},"related_words":{"derivatives":["barnacle goose","goose","barnacle"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'tree-goose' is largely historical and refers to a misconception about the origin of the barnacle goose. Its use is now limited to discussions of medieval folklore or ornithological history. When describing geese that nest in trees, it is more accurate to use the specific species name or a more descriptive phrase.","priority":"★★☆"},"example_sentences":[{"sentence":"Medieval bestiaries often depicted the tree-goose emerging from a tree.","translation":"中世の動物寓意譚では、ツリーグースが木から現れる様子がよく描かれていました。","type":"noun","meaning_category":"historical"},{"sentence":"The tree-goose myth was used to justify eating the bird during Lent.","translation":"ツリーグースの神話は、四旬節中にその鳥を食べることを正当化するために使われました。","type":"noun","meaning_category":"historical"},{"sentence":"Some species of whistling ducks, which are sometimes called tree-geese, nest in tree hollows.","translation":"リュウキュウガモの一種は、ツリーグースと呼ばれることもありますが、木の空洞に巣を作ります。","type":"noun","meaning_category":"modern (rare)"}]}