{"word":"chugger","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(軽蔑的)チャリティー勧誘員、街頭募金詐欺師","english_definition":"(derogatory) A charity mugger; a person who solicits donations for a charity in an aggressive or intrusive manner in a public place.","examples":[{"sentence":"I was accosted by a chugger outside the train station.","translation":"駅の外でチャリティーの勧誘員に声をかけられた。"},{"sentence":"Many people find chuggers annoying and intrusive.","translation":"多くの人がチャリティー勧誘員をしつこくて迷惑だと感じている。"},{"sentence":"The city council has received numerous complaints about aggressive chuggers.","translation":"市議会は、攻撃的なチャリティー勧誘員に関する苦情を多数受けている。"}],"collocations":["aggressive chugger (攻撃的なチャリティー勧誘員)","annoying chugger (迷惑なチャリティー勧誘員)","street chugger (街頭チャリティー勧誘員)"],"synonyms":["charity mugger","street fundraiser","face-to-face fundraiser"],"antonyms":[],"notes":"The term 'chugger' is often used negatively, implying that the person is overly persistent or dishonest."}],"etymology":{"value":"A blend of 'charity' and 'mugger', suggesting that the person is aggressively soliciting donations in a way that is similar to mugging someone.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʃʌɡər/","syllables":"chug-ger"},"inflection":{"noun_plural":"chuggers"},"usage_notes":{"explanation":"'Chugger' is a relatively recent term, primarily used in British English and other Commonwealth countries. It refers to individuals who approach people in public places, often with clipboards, to persuade them to sign up for regular donations to a charity. The term carries a negative connotation because these individuals are often perceived as being pushy, dishonest, or overly persistent. While the activities of chuggers are generally legal, their tactics can be seen as intrusive and annoying.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a chugger drinking beer.","correct":"✓ I saw a fundraiser drinking beer.","note":"'Chugger' specifically refers to charity fundraisers who are perceived as aggressive or intrusive. It doesn't simply mean any person who is raising money for charity. If the person's behavior isn't relevant, use a more neutral term like 'fundraiser'."},{"incorrect":"✗ He was chuggered by a charity.","correct":"✓ He was approached by a chugger.","note":"'Chugger' is a noun, not a verb. You can't 'chugger' someone. Instead, you can say that someone was 'approached by a chugger' or 'accosted by a chugger'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["fundraiser","charity","donation","mugging","solicitation"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'chugger' is a slang term, primarily used in the UK, to describe someone who aggressively solicits donations for charities in public places. It's a blend of 'charity' and 'mugger,' implying that their tactics are similar to mugging someone. The term is usually negative, suggesting that the person is pushy or dishonest. It's not a common word, so you'll likely only encounter it in specific contexts related to charity fundraising.","priority":"★★☆"},"example_sentences":[{"sentence":"I try to avoid eye contact with chuggers when walking through the city center.","translation":"街の中心部を歩くときは、チャリティー勧誘員と目を合わせないようにしている。","type":"general","meaning_category":"general"},{"sentence":"The local newspaper ran a story about the tactics used by some chuggers to pressure people into donating.","translation":"地元の新聞は、一部のチャリティー勧誘員が人々を寄付に追い込むために使用する戦術についての記事を掲載した。","type":"news","meaning_category":"news"},{"sentence":"Many charities have distanced themselves from the use of chuggers due to the negative publicity.","translation":"多くの慈善団体は、否定的な広報のためにチャリティー勧誘員の利用から距離を置いている。","type":"charity","meaning_category":"charity"}]}