{"word":"factory-caused","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"工場が原因で引き起こされた、工場由来の","english_definition":"Caused by a factory or factories; originating from a factory.","examples":[{"sentence":"The factory-caused pollution affected the nearby river.","translation":"工場由来の汚染が近くの川に影響を与えた。"},{"sentence":"The company is working to reduce factory-caused emissions.","translation":"その会社は工場由来の排出量を削減するために取り組んでいます。"}],"collocations":["factory-caused pollution (工場由来の汚染)","factory-caused emissions (工場由来の排出)","factory-caused damage (工場由来の損害)"],"synonyms":["industrial-caused","plant-related","manufacturing-induced"],"antonyms":["naturally-occurring","non-industrial","environmental"],"notes":"This word is often used in the context of environmental issues, accidents, or product defects."}],"etymology":{"value":"A compound word formed by combining \"factory\" and \"caused\". It indicates that something is a direct result of factory operations or processes.","priority":"N/A"},"pronunciation":{"ipa":"/ˈfæktəriˌkɔzd/","syllables":"fac-to-ry-caused"},"inflection":{"notes":"As an adjective, it does not have different forms."},"usage_notes":{"explanation":"The term 'factory-caused' is typically used to describe negative consequences or impacts resulting from the operation of factories. It is commonly found in discussions about environmental pollution, industrial accidents, or defects in manufactured products. The word clearly establishes the source or origin of the problem as being the factory itself.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The caused-factory accident.","correct":"✓ The factory-caused accident.","note":"The correct order is 'factory-caused' because 'factory' modifies 'caused', indicating the origin of the cause."}],"priority":"N/A"},"related_words":{"derivatives":["factory","caused","industrial","manufacturing","pollution","emission"],"phrases":["factory farming","factory outlet","factory reset"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - This is a relatively specific and uncommon term.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'factory-caused' is a compound adjective used to describe something that has been caused by a factory. It is commonly used in contexts relating to environmental impact or industrial accidents. Due to its specific and technical nature, it is more likely to be encountered in higher-level English texts."},"example_sentences":[{"sentence":"The factory-caused runoff contaminated the local water supply.","translation":"工場由来の流出物が地域の水道水を汚染した。","type":"adjective","meaning_category":"pollution"},{"sentence":"The investigation focused on the factory-caused explosion.","translation":"調査は工場が原因で発生した爆発に焦点を当てた。","type":"adjective","meaning_category":"accident"}]}