{"word":"prepunishment","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律、倫理)犯罪が行われる前に、将来の犯罪を抑止するために科される罰、または罰に類似する措置。","english_definition":"(law, ethics) Punishment, or a measure resembling punishment, inflicted before a crime is committed, with the aim of deterring future offenses.","examples":[{"sentence":"Some argue that certain surveillance measures constitute a form of prepunishment, as they restrict freedoms before any crime has occurred.","translation":"犯罪が起こる前に自由を制限するため、特定の監視措置は一種の事前処罰を構成すると主張する人もいる。"},{"sentence":"The concept of prepunishment raises significant ethical concerns about the presumption of guilt.","translation":"事前処罰の概念は、有罪の推定について重大な倫理的懸念を引き起こす。"}],"collocations":["impose prepunishment","ethical concerns about prepunishment"],"synonyms":["preventive punishment","deterrent measures"],"antonyms":["retribution","rehabilitation"]}],"etymology":{"value":"'Pre-' (before) + 'punishment' (penalty for wrongdoing). The term highlights the timing of the punitive action—before the commission of a crime rather than after.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːˈpʌnɪʃmənt/","syllables":"pre-pun-ish-ment"},"inflection":{"noun_plural":"prepunishments"},"usage_notes":{"explanation":"'Prepunishment' is a term used in legal and ethical discussions to describe actions that resemble punishment but are applied before a crime has been committed. It is often associated with controversial measures such as mass surveillance, preventative detention, or restrictions on civil liberties based on potential future criminal behavior. The ethical implications of prepunishment are widely debated, as it challenges fundamental principles of justice, such as the presumption of innocence and the right to due process.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The government used prepunishment to reward good behavior.","correct":"✓ The government used incentives to reward good behavior.","note":"Prepunishment is related to deterring potential crime, not rewarding behavior. Incentives are used for rewarding good behavior."},{"incorrect":"✗ Prepunishment is always a fair way to prevent crime.","correct":"✓ The fairness of prepunishment is highly debated.","note":"The fairness and ethical implications of prepunishment are frequently questioned and debated."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["deterrence","preventive detention","mass surveillance","presumption of innocence","due process"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'prepunishment' is a complex legal and ethical concept. It refers to measures that resemble punishment but are imposed before a crime has been committed, with the intention of preventing future offenses. Understanding this term requires a grasp of legal principles such as the presumption of innocence and due process, as well as ethical considerations related to justice and individual liberties. It is typically discussed in advanced academic or legal contexts."},"example_sentences":[{"sentence":"Critics argue that extensive data collection by intelligence agencies can be a form of **prepunishment**.","translation":"批評家たちは、情報機関による広範なデータ収集は一種の事前処罰となり得ると主張する。","type":"noun","meaning_category":"事前処罰の例"},{"sentence":"The debate over **prepunishment** involves balancing security concerns with individual rights.","translation":"事前処罰に関する議論は、安全保障上の懸念と個人の権利のバランスを取ることを伴う。","type":"noun","meaning_category":"事前処罰に関する議論"}]}