{"word":"ambulant","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"歩行できる、歩ける","english_definition":"able to walk about; not bedridden or confined to a wheelchair.","examples":[{"sentence":"The patient is now ambulant after the surgery.","translation":"その患者は手術後、歩行できるようになった。"},{"sentence":"Ambulant patients can use the restroom independently.","translation":"歩行可能な患者は、自分でトイレを使用できます。"}],"collocations":["ambulant patient","ambulant care","ambulant surgery"],"synonyms":["walking","mobile","perambulatory"],"antonyms":["bedridden","immobile","sedentary"]}],"etymology":{"value":"From Latin ambulantem (nominative ambulans), present participle of ambulare \"to walk, go about,\" from ambi- \"about\" + -alare, related to ala \"wing\" (from PIE root *aks- \"axis\").","priority":"★★☆"},"pronunciation":{"ipa":"ˈæmbjələnt","syllables":"am-bu-lant"},"inflection":{"notes":"No specific inflectional forms; it's an adjective."},"usage_notes":{"explanation":"'Ambulant' is typically used in medical or care settings to describe a patient's ability to walk. It implies a level of mobility that allows the person to move around without assistance or with minimal assistance. It is not commonly used in everyday conversation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The ambulant car arrived at the scene.","correct":"The ambulance arrived at the scene.","note":"'Ambulant' (able to walk) is often confused with 'ambulance' (a vehicle for transporting sick or injured people)."},{"incorrect":"He is very ambulant.","correct":"He is very mobile.","note":"In general conversation, 'mobile' is a more common and natural way to describe someone's ability to walk."}],"priority":"★★☆"},"related_words":{"derivatives":["ambulate (verb: to walk or move about)","ambulation (noun: the act of walking)","ambulance (noun: a vehicle for transporting sick or injured people)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ambulant' is a relatively formal and uncommon word, primarily used in medical contexts to describe someone who is able to walk. It's not typically used in everyday conversation. It's important to distinguish it from 'ambulance,' which is a much more common word."},"example_sentences":[{"sentence":"The hospital encourages ambulant patients to walk around the ward to aid their recovery.","translation":"病院では、歩行可能な患者に対し、回復を助けるために病棟内を歩き回ることを推奨しています。","type":"adjective","meaning_category":"歩行できる"},{"sentence":"Ambulant care allows patients to receive treatment without being admitted to a hospital.","translation":"外来ケアにより、患者は入院せずに治療を受けることができます。","type":"adjective","meaning_category":"歩行できる"}]}