{"word":"Eartagged","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(動物が)耳標を付けられた","english_definition":"Having an eartag attached.","examples":[{"sentence":"The eartagged sheep grazed peacefully in the field.","translation":"耳標を付けられた羊たちが、穏やかに野原で草を食んでいた。"},{"sentence":"All the cattle in the herd were eartagged for identification purposes.","translation":"群れの中の全ての牛は、識別目的のために耳標が付けられていた。"}],"collocations":["eartagged animal","eartagged livestock","eartagged cattle","eartagged sheep","eartagged pig"],"synonyms":["tagged","marked","identified"],"antonyms":["untagged","unmarked","unidentified"]}],"etymology":{"value":"The word 'eartagged' is formed by combining 'eartag' (a tag attached to an animal's ear) with the suffix '-ed', indicating that something has been done to the subject (in this case, having an eartag attached).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɪərˌtæɡd/","syllables":"ear-tagged"},"inflection":{"notes":"This word is typically used as an adjective. It does not have separate plural or comparative forms."},"usage_notes":{"explanation":"'Eartagged' is used to describe animals that have been fitted with an eartag. Eartags are typically used for identification and tracking purposes, especially in livestock management. The term is most commonly used in agricultural or veterinary contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The animal was eartag.","correct":"✓ The animal was eartagged.","note":"'Eartagged' is the past participle used as an adjective. 'Eartag' is a noun."},{"incorrect":"✗ All animals are eartagging.","correct":"✓ All animals are eartagged.","note":"'Eartagging' is the act of attaching an eartag, not the state of having one attached."}],"priority":"★★☆"},"related_words":{"derivatives":["eartag (noun: a tag attached to an animal's ear)","eartagging (noun: the act of attaching an eartag)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'eartagged' is a relatively specialized term used to describe animals that have been fitted with an eartag. Eartags are small, numbered or coded tags attached to the ears of animals, primarily livestock, for identification and tracking purposes. The term is most commonly encountered in agricultural, veterinary, or wildlife management contexts. Understanding the term requires some familiarity with animal husbandry practices."},"example_sentences":[{"sentence":"The newly born calf was immediately eartagged by the farmer.","translation":"生まれたばかりの子牛は、農家によってすぐに耳標を付けられた。","type":"adjective","meaning_category":"Describing an animal with an eartag"},{"sentence":"Eartagged deer are easier to track through the forest.","translation":"耳標を付けられた鹿は、森の中で追跡しやすい。","type":"adjective","meaning_category":"Describing animals for tracking purposes"}]}