{"word":"Antinomist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"律法無用論者、反律法主義者","english_definition":"One who holds that under the gospel dispensation of grace, the moral law is of no use or obligation because faith alone is necessary to salvation.","examples":[{"sentence":"The theologian was accused of being an Antinomist because of his views on grace and law.","translation":"その神学者は、恵みと律法に関する見解から、律法無用論者であると非難された。"},{"sentence":"Some early Christian groups were labeled as Antinomists by their opponents.","translation":"初期キリスト教のいくつかのグループは、反対者から律法無用論者というレッテルを貼られた。"}],"collocations":["accused of being an Antinomist","historical Antinomist","religious Antinomist"],"synonyms":["libertine","dissenter","heretic"],"antonyms":["legalist","moralist"]}],"etymology":{"value":"From anti- + nomos (law) + -ist.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæntiˈnɒmɪst/","syllables":"An-ti-nom-ist"},"inflection":{"noun_plural":"Antinomists"},"usage_notes":{"explanation":"An \"Antinomist\" is someone who believes that moral laws are not binding on Christians who are under grace. The term is often used in theological contexts to describe those who reject the necessity of following moral laws for salvation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a antinomist person.","correct":"✓ He was an antinomist.","note":"'Antinomist' is a noun, not an adjective. If you want to use it adjectivally, you could say 'He held antinomist views.'"},{"incorrect":"✗ Antinomists believe in no rules.","correct":"✓ Antinomists believe that moral laws are not necessary for salvation.","note":"Antinomians don't necessarily reject all rules, but specifically moral laws in the context of salvation."}],"priority":"★☆☆"},"related_words":{"derivatives":["antinomian (adjective, noun)","antinomianism (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"Antinomist\" is a specialized theological term, referring to someone who believes that moral law is not binding under a dispensation of grace. It requires understanding of theological concepts and historical religious debates. It is not commonly used outside of these contexts."},"example_sentences":[{"sentence":"The preacher warned against the dangers of becoming an Antinomist.","translation":"牧師は、律法無用論者になることの危険性について警告した。","type":"general","meaning_category":"religious belief"},{"sentence":"Historically, certain groups were accused of Antinomism due to their emphasis on faith over works.","translation":"歴史的に、特定のグループは、行いよりも信仰を重視したために、律法無用論の罪で告発された。","type":"historical","meaning_category":"religious history"},{"sentence":"His theological arguments were considered controversial, with some labeling him an Antinomist.","translation":"彼の神学的議論は物議を醸し、一部の人々は彼を律法無用論者と呼んだ。","type":"theological","meaning_category":"religious debate"}]}