{"word":"scorned-looking","meanings":[{"part_of_speech":"adjective","definition":"軽蔑されているように見える、さげすまれているような外見の","english_definition":"having an appearance that suggests one is being treated with scorn or contempt.","examples":[{"sentence":"The dog had a scorned-looking expression after being scolded.","translation":"その犬は叱られた後、軽蔑されているような表情をしていた。"},{"sentence":"She gave him a scorned-looking glance.","translation":"彼女は彼に軽蔑されているような視線を送った。"},{"sentence":"The old building had a scorned-looking facade.","translation":"その古い建物は、見捨てられたような外観をしていた。"}],"collocations":["scorned-looking face (軽蔑されているような顔)","scorned-looking expression (軽蔑されているような表情)","scorned-looking glance (軽蔑されているような一瞥)"],"synonyms":["despised-looking","rejected-looking","disdained-looking","unloved-looking","abandoned-looking"],"antonyms":["cherished-looking","adored-looking","respected-looking","loved-looking"],"notes":"This adjective is often used to describe the appearance of someone or something that has been rejected or treated with contempt."}],"etymology":{"value":"Derived from the past participle of 'scorn' (to treat with contempt or disdain) and 'looking' (having a particular appearance).","notes":"The term combines the sense of being scorned with the visual impression of that state."},"pronunciation":{"ipa":"/ˈskɔːrnd ˈlʊkɪŋ/","syllables":"scorned-look-ing"},"inflection":{"notes":"This is a compound adjective and does not have separate inflections."},"usage_notes":{"explanation":"The adjective \"scorned-looking\" describes the visual impression of someone or something that appears to be the object of scorn. It suggests a sense of rejection, disdain, or contempt is being directed towards the subject. It is often used to evoke a feeling of pity or sadness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The scorned looking man walked away.","correct":"The scorned-looking man walked away.","note":"The hyphen is important to connect 'scorned' and 'looking' to form a single adjective describing the man."}]},"related_words":{"derivatives":["scorn (noun, verb)","scornful (adjective)","scornfully (adverb)"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'scorned-looking' is relatively uncommon and requires understanding of the word 'scorn,' which implies contempt or disdain. It is used to describe an appearance that suggests someone or something is being treated with scorn, making it more suitable for advanced learners."},"example_sentences":[{"sentence":"After losing the competition, he wore a scorned-looking mask of disappointment.","translation":"競技に負けた後、彼は軽蔑されているような落胆の表情を浮かべていた。"},{"sentence":"The old toy, forgotten in the corner, had a scorned-looking air about it.","translation":"隅に忘れられた古いおもちゃは、見捨てられたような雰囲気を漂わせていた。"},{"sentence":"Despite her talent, she felt scorned-looking when the director overlooked her for the lead role.","translation":"彼女は才能があるにもかかわらず、監督が主役の座を見送ったとき、軽蔑されているように感じた。"}]}