{"word":"gyrophoric","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(有機化学) ギロフォール酸の、またはそれを含む","english_definition":"(organic chemistry) Of, or containing, gyrophoric acid.","examples":[{"sentence":"Gyrophoric acid is a depside found in lichens.","translation":"ギロフォール酸は地衣類に含まれるデプシドです。"},{"sentence":"The gyrophoric lichen species is used in traditional medicine.","translation":"ギロフォール酸を含む地衣類の種は伝統医学で使用されています。"}],"collocations":["gyrophoric acid","gyrophoric lichen"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'gyrophoric acid', which is named after the lichen genus *Gyrophora* (now Umbilicaria), from which it was first isolated.","priority":"★★★"},"pronunciation":{"ipa":"/ˌdʒaɪroʊˈfɔːrɪk/","syllables":"gy-ro-phor-ic"},"inflection":{"notes":"Adjectives do not have plural forms in English."},"usage_notes":{"explanation":"'Gyrophoric' is a technical term primarily used in organic chemistry and botany, specifically related to lichens and the chemical compounds they contain. It is not a commonly used word in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["gyrophoric acid"],"phrasal_verbs":[],"related_terms":["lichen","organic acid","depside"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"This term is highly specialized and technical, primarily encountered in scientific literature related to organic chemistry, botany, and mycology. Understanding requires a background in these fields."},"example_sentences":[{"sentence":"The lichen sample tested positive for gyrophoric acid, indicating the presence of gyrophoric compounds.","translation":"地衣類のサンプルはギロフォール酸に対して陽性反応を示し、ギロフォール化合物が存在することを示しています。","type":"adjective","meaning_category":"organic chemistry"},{"sentence":"Gyrophoric acid derivatives are being studied for their potential pharmaceutical applications.","translation":"ギロフォール酸誘導体は、その潜在的な薬理学的応用について研究されています。","type":"adjective","meaning_category":"organic chemistry"}]}