{"word":"client-managed","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"クライアント管理の、顧客管理の","english_definition":"Describes a system, service, or resource where the client (customer) has significant control and responsibility for its operation, configuration, and maintenance.","examples":[{"sentence":"This is a client-managed service, so you'll be responsible for configuring the security settings.","translation":"これはクライアント管理のサービスですので、セキュリティ設定の構成はお客様の責任となります。"},{"sentence":"The database is client-managed, giving you full control over backups and disaster recovery.","translation":"このデータベースはクライアント管理なので、バックアップと災害復旧を完全に制御できます。"},{"sentence":"We offer both fully-managed and client-managed options, depending on your level of technical expertise.","translation":"お客様の技術的な専門知識のレベルに応じて、フルマネージドオプションとクライアントマネージドオプションの両方を提供しています。"}],"collocations":["client-managed service","client-managed database","client-managed infrastructure","client-managed solution","client-managed environment"],"synonyms":["customer-managed","self-managed"],"antonyms":["fully-managed","vendor-managed","provider-managed"]},{"part_of_speech":"adjective","definition":"(投資において)顧客自身が運用する","english_definition":"(In investment contexts) Referring to an investment account or portfolio where the client makes the investment decisions, rather than a professional fund manager.","examples":[{"sentence":"A client-managed investment account offers more flexibility but requires more time and expertise.","translation":"顧客自身が運用する投資口座は、より柔軟性がありますが、より多くの時間と専門知識が必要です。"},{"sentence":"Many investors prefer a client-managed approach so they can directly control their assets.","translation":"多くの投資家は、資産を直接管理できるように、顧客自身が運用する方法を好みます。"}],"collocations":["client-managed investment account","client-managed portfolio"],"synonyms":["self-directed","self-managed"],"antonyms":["professionally managed","fund-managed"]}],"etymology":{"value":"A compound adjective formed by combining 'client' (referring to the customer) and 'managed' (indicating control or administration).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈklaɪənt ˈmænɪdʒd/","syllables":"cli-ent-man-aged"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"'Client-managed' indicates that the client, rather than a third-party provider, has primary responsibility for managing a system, service, or investment. This often implies greater control and customization options for the client, but also requires more technical knowledge and effort. It's often contrasted with 'fully-managed' services where the provider handles most of the operational tasks.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The client managed service is very easy to use because the provider does everything.","correct":"✓ The client-managed service requires more technical expertise from the client.","note":"Client-managed implies the client has more responsibility, not less. If the provider does everything, it is likely a fully-managed service."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["managed services","outsourcing","cloud computing","IT infrastructure","investment management","self-service"],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Client-managed' means that the customer is responsible for managing something, like a computer system or an investment account. This means they have more control but also more work to do. It's often used when comparing different types of services: some are 'fully-managed' (the provider does everything) and some are 'client-managed' (the customer does most of it)."},"example_sentences":[{"sentence":"With a client-managed cloud server, you have root access and can install any software you need.","translation":"クライアント管理のクラウドサーバーでは、rootアクセス権があり、必要なソフトウェアをインストールできます。","type":"adjective","meaning_category":"IT Infrastructure"},{"sentence":"A client-managed brokerage account lets you buy and sell stocks directly.","translation":"顧客管理の証券口座を使用すると、株式を直接売買できます。","type":"adjective","meaning_category":"Investment"}]}