{"word":"Trust Women","priority":"N/A","meanings":[{"part_of_speech":"phrase","definition":"(しばしばスローガンとして) 女性を信じろ、女性の自己決定権を尊重しろ","english_definition":"(often as a slogan) A phrase advocating for the belief in and support of women, particularly regarding their reproductive rights and autonomy.","examples":[{"sentence":"Many activists use the slogan 'Trust Women' to advocate for reproductive freedom.","translation":"多くの活動家は、リプロダクティブ・フリーダムを提唱するために「Trust Women（女性を信じろ）」というスローガンを使用する。"},{"sentence":"The organization's mission is based on the principle of 'Trust Women' to make their own healthcare decisions.","translation":"その団体の使命は、女性が自らの医療に関する決定を下すことを「Trust Women（女性を信じる）」という原則に基づいている。"}],"collocations":["Trust Women rally (Trust Women集会)","Trust Women movement (Trust Women運動)","Trust Women principle (Trust Women原則)"],"synonyms":["Support Women's Rights","Believe Women","Respect Women's Autonomy"],"antonyms":["Control Women","Restrict Women's Rights"]}],"etymology":{"value":"The phrase 'Trust Women' emerged as a rallying cry in the context of debates surrounding reproductive rights, particularly abortion access. It is a direct response to policies and rhetoric that question women's ability to make informed decisions about their own bodies and healthcare.","priority":"★★☆"},"pronunciation":{"ipa":"/trʌst ˈwɪmɪn/","syllables":"Trust Wom-en"},"inflection":{"notes":"This is a phrase, so it does not inflect."},"usage_notes":{"explanation":"'Trust Women' is a phrase used to express the belief that women are capable of making informed and responsible decisions about their own lives, especially concerning their reproductive health. It challenges the notion that women need to be controlled or restricted in their choices. The phrase is often used in political and social activism related to women's rights.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ We should trust the women.","correct":"✓ We should trust women.","note":"When used as a general principle or slogan, 'Trust Women' typically omits the definite article 'the'."},{"incorrect":"✗ Trust Women's.","correct":"✓ Trust Women.","note":"The phrase is generally used without the possessive form."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Reproductive Rights","Bodily Autonomy","Pro-Choice","Feminism","Gender Equality"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Moderate frequency, particularly in political and social discourse.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Trust Women' is a phrase used in discussions about women's rights, particularly reproductive rights. It means believing that women can make good decisions about their own bodies and lives. It's often used as a slogan or a statement of support for women's autonomy. Understanding this phrase requires awareness of the social and political context surrounding women's rights.","priority":"★★☆"},"example_sentences":[{"sentence":"The 'Trust Women' campaign aims to empower women to make their own reproductive choices.","translation":"「Trust Women（女性を信じろ）」キャンペーンは、女性が自らのリプロダクティブな選択をできるようにすることを目指している。","type":"phrase","meaning_category":"Advocacy for women's autonomy"},{"sentence":"We must 'Trust Women' to make informed decisions about their healthcare.","translation":"私たちは、女性が自らの医療について十分な情報に基づいて決定を下すことを「Trust Women（女性を信じなければならない）」。","type":"phrase","meaning_category":"Support for women's healthcare decisions"}]}