{"word":"Transmittancy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"透過率、透過度","english_definition":"The ratio of the radiant power transmitted through a sample to the radiant power incident on the sample. It is a measure of how much light or other electromagnetic radiation passes through a material.","examples":[{"sentence":"The transmittancy of the glass is high, allowing a lot of light to pass through.","translation":"そのガラスの透過率は高く、多くの光を通す。"},{"sentence":"The transmittancy of the filter was measured to determine its effectiveness.","translation":"そのフィルターの有効性を判断するために、透過率が測定された。"}],"collocations":["high transmittancy","low transmittancy","measure transmittancy","spectral transmittancy"],"synonyms":["transmittance","transmission coefficient","transparency"],"antonyms":["opacity","absorbance","reflectance"]}],"etymology":{"value":"Derived from 'transmit' (to send something across) and '-ancy' (a suffix indicating a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/trænzˈmɪtənsi/","syllables":"trans-mit-tan-cy"},"inflection":{"noun_plural":"Transmittancies"},"usage_notes":{"explanation":"'Transmittancy' is often used in physics, optics, and engineering to describe the ability of a material to allow electromagnetic radiation to pass through it. It is a quantitative measure, usually expressed as a ratio or percentage. It is closely related to 'transmittance', which is often used interchangeably, although some sources may make subtle distinctions based on the specifics of measurement or context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The transmittancy is very opaque.","correct":"✓ The transmittancy is very low. / ✓ The material is very opaque.","note":"Transmittancy and opacity are inversely related. High transmittancy means low opacity, and vice versa. Therefore, saying \"The transmittancy is very opaque\" is contradictory."}],"priority":"★★☆"},"related_words":{"derivatives":["transmit","transmittance","transmission","transparent","translucent","opaque"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in technical and scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Transmittancy' is a technical term used in scientific fields like physics and engineering. It refers to how much light or radiation can pass through a material. Think of it as the opposite of how opaque something is. It's not a word you'd use in everyday conversation, but it's important in contexts where understanding how materials interact with light or radiation is necessary."},"example_sentences":[{"sentence":"The high transmittancy of the material makes it suitable for solar panels.","translation":"その材料の高い透過率は、太陽光パネルに適している。","type":"general","meaning_category":"general"},{"sentence":"The transmittancy of the atmosphere affects the amount of solar radiation reaching the Earth's surface.","translation":"大気の透過率は、地球の表面に到達する太陽放射の量に影響を与える。","type":"scientific","meaning_category":"scientific"},{"sentence":"The transmittancy of the lens was carefully controlled during manufacturing.","translation":"レンズの透過率は、製造中に慎重に管理された。","type":"technical","meaning_category":"technical"}]}