{"word":"ascetismo","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"禁欲主義、苦行主義","english_definition":"severe self-discipline and avoidance of all forms of indulgence, typically for religious reasons.","examples":[{"sentence":"El ascetismo es una práctica común en muchas religiones.","translation":"禁欲主義は多くの宗教で一般的な慣習です。"},{"sentence":"Su vida se caracterizó por el ascetismo y la devoción.","translation":"彼の人生は禁欲主義と献身によって特徴づけられました。"}],"collocations":["practicar el ascetismo (禁欲主義を実践する)","vida de ascetismo (禁欲的な生活)"],"synonyms":["austeridad","abnegación","mortificación","templanza"],"antonyms":["hedonismo","indulgencia","libertinaje"]}],"etymology":{"value":"Del griego ἀσκητισμός (askētismós), derivado de ἀσκητής (askētḗs), que significa 'monje, ermitaño', y este de ἀσκέω (askéō), 'ejercitar, entrenar'. Originalmente se refería al entrenamiento físico de los atletas, pero luego se aplicó a la disciplina espiritual.","priority":"★★☆"},"pronunciation":{"ipa":"/as.θeˈtis.mo/ (Spanish)","syllables":"as-ce-tis-mo"},"inflection":{"noun_gender":"masculine","noun_plural":"ascetismos"},"usage_notes":{"explanation":"El ascetismo implica una renuncia a los placeres materiales y a menudo a las necesidades básicas, con el fin de alcanzar una mayor espiritualidad o pureza moral. Se encuentra en diversas religiones y filosofías, aunque las prácticas específicas varían.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ El ascetismo es bueno para todos.","correct":"✓ El ascetismo es una opción personal.","note":"El ascetismo no es necesariamente adecuado o beneficioso para todos, ya que implica un estilo de vida muy restrictivo. Es una elección personal basada en creencias y objetivos individuales."}],"priority":"★☆☆"},"related_words":{"derivatives":["asceta (noun: 禁欲主義者)","ascético (adjective: 禁欲的な)"],"priority":"★★☆"},"level_frequency":{"priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ascetismo' se refiere a una práctica de vida austera y disciplinada, a menudo con fines religiosos o espirituales. Implica la renuncia a placeres y comodidades materiales. Es un concepto más común en contextos religiosos o filosóficos.","priority":"★☆☆"},"example_sentences":[{"sentence":"El **ascetismo** de los monjes budistas es conocido en todo el mundo.","translation":"仏教僧の禁欲主義は世界中で知られています。","type":"general","meaning_category":"禁欲主義"},{"sentence":"Algunos filósofos griegos practicaban el **ascetismo** como un medio para alcanzar la sabiduría.","translation":"一部のギリシャの哲学者は、知恵を達成する手段として禁欲主義を実践していました。","type":"general","meaning_category":"禁欲主義"}]}