{"word":"heart-back","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(スラング) 相手に好意があることを伝えるために、テキストメッセージやオンラインチャットでハートの絵文字を送り返すこと。","english_definition":"(slang) The act of sending a heart emoji back in a text message or online chat to reciprocate affection or interest.","examples":[{"sentence":"I sent him a heart, and he gave me a heart-back immediately!","translation":"彼にハートを送ったら、すぐにハートバックが来た！"},{"sentence":"She's been giving me heart-backs all day, I think she likes me.","translation":"彼女は一日中ハートバックを送ってくる。僕のこと好きだと思う。"}],"collocations":["give a heart-back","send a heart-back","receive a heart-back"],"synonyms":["reciprocate a heart","return a heart","heart reply"],"antonyms":["ignore a heart","leave on read"],"notes":"This term is very informal and primarily used in online communication. It implies a mutual romantic interest or affection."}],"etymology":{"value":"A combination of 'heart,' referring to the heart emoji, and 'back,' indicating a return or reciprocation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɑːrtˌbæk/","syllables":"heart-back"},"inflection":{"noun_plural":"heart-backs"},"usage_notes":{"explanation":"'Heart-back' is a slang term used to describe the act of returning a heart emoji in digital communication, typically indicating mutual affection or interest. It's most commonly used among younger people in text messages or online chats.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I gave her a heart-back, but she didn't give me one.","correct":"✓ I gave her a heart, but she didn't give me one back.","note":"While 'heart-back' is used as a noun, it can also be expressed as 'give a heart back' for clarity."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Slang, not typically included in CEFR levels)","frequency_google_ngram":"Low frequency (primarily used in informal online communication)","priority":"★☆☆"},"readability_explanation":{"level":"A2","text":"'Heart-back' is a slang word that means sending a heart emoji back to someone who sent you one. It shows that you like them too. It's used when texting or chatting online."},"example_sentences":[{"sentence":"After I sent her a message, she sent a heart-back.","translation":"メッセージを送った後、彼女はハートバックを送ってきた。","type":"noun","meaning_category":"digital communication"},{"sentence":"Getting a heart-back from him made her day.","translation":"彼からハートバックをもらって、彼女は一日中幸せだった。","type":"noun","meaning_category":"digital communication"}]}