{"word":"cofinanced","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"共同出資する、共同で資金を出す","english_definition":"to finance jointly; to share the cost of (a project, etc.) with another or others.","examples":[{"sentence":"The project was cofinanced by the European Union and the national government.","translation":"そのプロジェクトは、欧州連合と国政府によって共同出資された。"},{"sentence":"We are looking for partners to cofinance this new venture.","translation":"この新しい事業に共同出資してくれるパートナーを探しています。"}],"collocations":["cofinance a project","cofinance a venture","cofinance with"],"synonyms":["jointly finance","co-fund","share the cost"],"antonyms":["solely finance","fund independently"]}],"etymology":{"value":"The word 'cofinanced' is formed by adding the prefix 'co-' (meaning 'together' or 'jointly') to the word 'financed'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkoʊfaɪˈnænst/","syllables":"co-fi-nanced"},"inflection":{"verb_forms":{"present_simple":["cofinance","cofinances"],"past_simple":"cofinanced","past_participle":"cofinanced","present_participle":"cofinancing"}},"usage_notes":{"explanation":"'Cofinanced' implies a shared financial responsibility for a project or undertaking. It is commonly used in the context of international development, large-scale projects, and business ventures where multiple parties contribute to the funding.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The project was co-financed by the bank and me.","correct":"✓ The project was cofinanced by the bank and us.","note":"Use 'us' instead of 'me' when referring to a group of people as the object of a preposition."}],"priority":"★☆☆"},"related_words":{"derivatives":["cofinancing (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'cofinanced' is a relatively formal and specialized term, primarily used in business, finance, and international development contexts. It denotes the act of sharing the financial burden of a project or venture with one or more other entities. Understanding the prefix 'co-' is helpful in deciphering its meaning. Due to its specific usage, it is more commonly encountered in professional or academic settings than in everyday conversation."},"example_sentences":[{"sentence":"The film was cofinanced by several international production companies.","translation":"その映画は、いくつかの国際的な制作会社によって共同出資された。","type":"verb","meaning_category":"共同出資する"},{"sentence":"The government cofinances renewable energy projects to promote sustainability.","translation":"政府は、持続可能性を促進するために、再生可能エネルギープロジェクトに共同出資している。","type":"verb","meaning_category":"共同出資する"},{"sentence":"The museum expansion was cofinanced through private donations and public grants.","translation":"美術館の拡張は、民間の寄付と公的助成金を通じて共同出資された。","type":"verb","meaning_category":"共同出資する"}]}