{"word":"Carboniferous","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"石炭紀の","english_definition":"Relating to or denoting the geologic period from about 359.2 to 299 million years ago, characterized by the formation of coal deposits and the development of amphibians and early reptiles.","examples":[{"sentence":"The Carboniferous period was a time of great forests.","translation":"石炭紀は巨大な森林の時代でした。"},{"sentence":"Carboniferous rocks are often rich in coal.","translation":"石炭紀の岩石はしばしば石炭が豊富です。"}],"collocations":["Carboniferous period","Carboniferous rocks","Carboniferous forest"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"石炭紀","english_definition":"The Carboniferous period or system.","examples":[{"sentence":"The Carboniferous saw the rise of swamp forests.","translation":"石炭紀には湿地林が繁栄しました。"},{"sentence":"Much of the world's coal was formed during the Carboniferous.","translation":"世界の石炭の多くは石炭紀に形成されました。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Latin *carbon* (coal) + *-ferous* (bearing, producing), referring to the extensive coal deposits formed during this period.","priority":"★★★"},"pronunciation":{"ipa":"/ˌkɑːr.bəˈnɪf.ər.əs/","syllables":"Car-bon-if-er-ous"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Carboniferous' refers to a specific period in geological history, known for its vast coal swamps and the early evolution of amphibians and reptiles. It is commonly used in geology, paleontology, and related fields.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":["Carbon (element)","carbonaceous"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively low frequency, mainly used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Carboniferous' is a technical term used in geology and paleontology. It refers to a specific period in Earth's history characterized by the formation of coal deposits. Understanding this term requires some background knowledge in Earth science. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The vast coal deposits of Pennsylvania were formed during the Carboniferous Period.","translation":"ペンシルベニア州の広大な石炭鉱床は石炭紀に形成されました。","type":"adjective","meaning_category":"Geological Period"},{"sentence":"Fossils from the Carboniferous show the early evolution of insects.","translation":"石炭紀の化石は昆虫の初期の進化を示しています。","type":"adjective","meaning_category":"Geological Period"},{"sentence":"The Carboniferous is known for its high oxygen levels and giant insects.","translation":"石炭紀は高い酸素濃度と巨大な昆虫で知られています。","type":"noun","meaning_category":"Geological Period"}]}