{"word":"Hoyas","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)ジョージタウン大学のスポーツチームの愛称","english_definition":"(plural noun) The nickname for the sports teams of Georgetown University.","examples":[{"sentence":"The Hoyas are known for their basketball program.","translation":"ホヤスはバスケットボールプログラムで知られています。"},{"sentence":"He is a proud alumnus of Georgetown and a big supporter of the Hoyas.","translation":"彼はジョージタウン大学の誇り高い卒業生であり、ホヤスの大ファンです。"}],"collocations":["Georgetown Hoyas","Hoyas basketball","Hoyas football"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(複数形)サクララン属の植物","english_definition":"(plural noun) Plants of the genus Hoya.","examples":[{"sentence":"Hoyas are popular houseplants.","translation":"ホヤは人気の観葉植物です。"},{"sentence":"She collects different varieties of hoyas.","translation":"彼女は様々な種類のホヤを集めています。"}],"collocations":["Hoya plant","Hoya carnosa","Wax plant"],"synonyms":["wax plants"],"antonyms":[]}],"etymology":{"value":"The name 'Hoyas' for Georgetown University's sports teams is believed to have originated from the Greek phrase 'Hoya Saxa,' meaning 'What Rocks!' or 'Such Rocks!' The phrase was used as a rallying cry by students in the late 19th century. For the plant genus, Hoya is named after English botanist Thomas Hoy.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɔɪəz/","syllables":"Hoy-as"},"inflection":{"noun_plural":"Hoyas"},"usage_notes":{"explanation":"'Hoyas' refers to two distinct things: the sports teams of Georgetown University and plants of the genus Hoya. Context is crucial to understanding which meaning is intended. When referring to the sports teams, it is always plural. When referring to the plants, it is typically plural as well, unless referring to a single plant.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a fan of Hoya.","correct":"✓ He is a fan of the Hoyas.","note":"When referring to the Georgetown sports teams, always use the plural form 'Hoyas'."},{"incorrect":"✗ I have a Hoyas in my room.","correct":"✓ I have a Hoya in my room.","note":"When referring to a single plant, use the singular form 'Hoya'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2 (in the context of Georgetown University), C1 (in the context of botany)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Hoyas' is a word with two distinct meanings, requiring contextual understanding. One meaning refers to the sports teams of Georgetown University, a well-known American university. The other meaning refers to a genus of plants, specifically wax plants. The intended meaning is usually clear from the context in which it is used.","priority":"★★☆"},"example_sentences":[{"sentence":"The Georgetown **Hoyas** won the basketball championship.","translation":"ジョージタウン大学のホヤスがバスケットボールの選手権で優勝しました。","type":"noun","meaning_category":"ジョージタウン大学のスポーツチーム"},{"sentence":"**Hoyas** are relatively easy to care for, making them a good choice for beginner plant owners.","translation":"ホヤは比較的育てやすく、初心者にもおすすめです。","type":"noun","meaning_category":"サクララン属の植物"}]}