{"word":"buttermouth","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(俗語)口下手な人、口が重い人、言葉に詰まる人","english_definition":"(slang) A person who has difficulty speaking or expressing themselves clearly, often due to nervousness or shyness.","examples":[{"sentence":"He's such a buttermouth; he can never get his point across in meetings.","translation":"彼は本当に口下手で、会議で自分の意見をうまく伝えられない。"},{"sentence":"She's got a bad case of buttermouth when she has to speak in public.","translation":"彼女は人前で話すとなるとひどく口ごもってしまう。"}],"collocations":["have a buttermouth","a bad case of buttermouth"],"synonyms":["tongue-tied","inarticulate","speechless","mute","reticent"],"antonyms":["eloquent","articulate","outspoken","glib","fluent"]},{"part_of_speech":"adjective","definition":"(俗語)口下手な、口が重い、言葉に詰まる","english_definition":"(slang) Characterized by an inability to speak or express oneself clearly.","examples":[{"sentence":"He gets all buttermouth when he tries to talk to her.","translation":"彼は彼女に話しかけようとすると、いつも口ごもってしまう。"},{"sentence":"I'm always buttermouth in interviews.","translation":"私は面接ではいつも口下手になってしまう。"}],"collocations":["get buttermouth","feel buttermouth"],"synonyms":["tongue-tied","inarticulate","speechless","mute","reticent"],"antonyms":["eloquent","articulate","outspoken","glib","fluent"]}],"etymology":{"value":"The etymology is uncertain, but it likely combines \"butter,\" suggesting something smooth or slippery, with \"mouth,\" implying difficulty in speaking smoothly. The image is of words slipping and sliding around in the mouth rather than coming out clearly.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbʌtərˌmaʊθ/","syllables":"but-ter-mouth"},"inflection":{"notes":"The noun is countable. The adjective does not have comparative or superlative forms."},"usage_notes":{"explanation":"\"Buttermouth\" is a slang term, so it's generally used in informal settings. It describes someone who struggles to speak clearly, often because they are nervous, shy, or lack confidence. It can be used as both a noun and an adjective.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a butter mouth.","correct":"✓ He has a buttermouth.","note":"The word is one single word, not two separate words. Also, it's 'a buttermouth', not 'a butter mouth' in this context."},{"incorrect":"✗ She's buttermouthed.","correct":"✓ She's buttermouth.","note":"The adjective form is 'buttermouth', not 'buttermouthed'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_slang":["foot-in-mouth disease"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Slang, not typically included in CEFR)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Buttermouth\" is an informal, slang term used to describe someone who has difficulty speaking clearly, often due to nervousness or shyness. It's not a common word, so it's more likely to be encountered in informal conversations or writing. The image it evokes is that the person's words are slipping around in their mouth, like butter, making it hard for them to articulate their thoughts effectively. Because it's slang, it's important to use it appropriately and be aware of the context in which it's used."},"example_sentences":[{"sentence":"Don't be such a buttermouth; just tell him how you feel.","translation":"そんなに口ごもってないで、自分の気持ちを彼に伝えなさい。","type":"noun","meaning_category":"口下手な人"},{"sentence":"I always get so buttermouth when I have to give presentations.","translation":"プレゼンテーションをしなければならないときは、いつも口下手になってしまう。","type":"adjective","meaning_category":"口下手な"}]}