{"word":"multilingualisms","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"多言語主義、多言語使用","english_definition":"The ability of societies, institutions, groups and individuals to engage, on a regular basis, with more than one language in their day-to-day lives.","examples":[{"sentence":"The European Union promotes multilingualism among its member states.","translation":"欧州連合は加盟国間で多言語主義を推進している。"},{"sentence":"Canada's policy of multilingualism recognizes both English and French as official languages.","translation":"カナダの多言語主義政策は、英語とフランス語を公用語として認めている。"},{"sentence":"Multilingualism is an asset in today's globalized world.","translation":"多言語主義は今日のグローバル化した世界において貴重な財産である。"}],"collocations":["promote multilingualism (多言語主義を推進する)","support multilingualism (多言語主義を支援する)","policy of multilingualism (多言語主義政策)","benefits of multilingualism (多言語主義の利点)","challenges of multilingualism (多言語主義の課題)"],"synonyms":["polyglotism","multilingual competence","plurilingualism"],"antonyms":["monolingualism"]},{"part_of_speech":"noun","definition":"多言語使用の状況、複数の言語が使用されている状態","english_definition":"The state of using or being able to use several languages.","examples":[{"sentence":"The city is characterized by multilingualism, with residents speaking a variety of languages.","translation":"その都市は多言語使用を特徴としており、住民は様々な言語を話す。"},{"sentence":"The school embraces multilingualism and offers language programs in several languages.","translation":"その学校は多言語使用を奨励し、複数の言語の語学プログラムを提供している。"},{"sentence":"Research shows that multilingualism can enhance cognitive abilities.","translation":"研究によると、多言語使用は認知能力を高める可能性がある。"}],"collocations":["promote multilingualism (多言語使用を推進する)","support multilingualism (多言語使用を支援する)","benefits of multilingualism (多言語使用の利点)","challenges of multilingualism (多言語使用の課題)","embrace multilingualism (多言語使用を奨励する)"],"synonyms":["polyglossia","multilingual environment","linguistic diversity"],"antonyms":["monolingualism"]}],"etymology":{"value":"The word 'multilingualism' is derived from 'multilingual,' which combines the Latin prefix 'multi-' (meaning 'many') with 'lingual' (relating to language). The suffix '-ism' denotes a practice, doctrine, or condition.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmʌltiˈlɪŋɡwəlɪzəmz/","syllables":"mul-ti-lin-gwa-liz-ums"},"inflection":{"noun_plural":"multilingualisms"},"usage_notes":{"explanation":"'Multilingualism' refers to the ability of individuals or communities to use multiple languages. It can also refer to policies or ideologies that promote the use of multiple languages within a society or organization. The plural form, 'multilingualisms,' is used to refer to different instances or types of multilingualism.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The multilingualism is good for the country.","correct":"✓ Multilingualism is good for the country.","note":"'Multilingualism' is a concept, so it's generally used in the singular form unless referring to specific instances. In this case, use the singular form to refer to the general concept of multilingualism. "},{"incorrect":"✗ He is a multilingualism person.","correct":"✓ He is a multilingual person.","note":"'Multilingual' is the adjective to describe a person who speaks multiple languages. 'Multilingualism' is the noun that refers to the ability or practice of using multiple languages."}],"priority":"★★☆"},"related_words":{"derivatives":["multilingual (adjective)","multilingually (adverb)"],"related_terms":["bilingualism","monolingualism","polyglot","language acquisition","linguistics"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but increasing in academic and policy contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Multilingualism' is a term used in linguistics, education, and policy to describe the use of multiple languages by individuals or within societies. It's a more complex concept than simply knowing several languages; it encompasses the social, cultural, and cognitive aspects of using multiple languages in everyday life. The term is often used in discussions about language policy, education, and cultural diversity. Understanding this term requires a good grasp of abstract concepts and academic vocabulary."},"example_sentences":[{"sentence":"The study explores the benefits of multilingualisms in early childhood education.","translation":"この研究は、幼児教育における多言語主義の利点を探求している。","type":"noun","meaning_category":"多言語主義"},{"sentence":"Different types of multilingualisms can be observed in various regions around the world.","translation":"世界の様々な地域で、異なる種類の多言語主義を観察することができる。","type":"noun","meaning_category":"多言語主義"},{"sentence":"The conference focused on the challenges and opportunities presented by multilingualisms in the 21st century.","translation":"会議では、21世紀における多言語主義がもたらす課題と機会に焦点が当てられた。","type":"noun","meaning_category":"多言語主義"}]}