{"word":"Malpublication","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(医学・科学)研究不正の一種で、研究結果の発表における不正行為。捏造、改ざん、盗用以外の不正行為を指す。","english_definition":"A type of research misconduct, referring to unethical practices in the publication of research results, excluding fabrication, falsification, and plagiarism.","examples":[{"sentence":"The investigation revealed several instances of malpublication in the researcher's work.","translation":"調査により、その研究者の研究にいくつかのmalpublicationの事例があることが明らかになった。"},{"sentence":"Malpublication can take many forms, including selective reporting of data and inappropriate authorship.","translation":"Malpublicationは、データの選択的報告や不適切な著者表示など、さまざまな形をとることがある。"}],"collocations":["research malpublication","scientific malpublication","instances of malpublication","investigation of malpublication"],"synonyms":["research misconduct","publication bias","selective reporting","data manipulation","inappropriate authorship"],"antonyms":["ethical publication","responsible conduct of research","transparent reporting"]}],"etymology":{"value":"\"Mal-\" (悪い、不正な) + \"publication\" (出版) の組み合わせ。研究倫理における不正な出版行為を指すために作られた言葉。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmælˌpʌblɪˈkeɪʃən/","syllables":"mal-pub-li-ca-tion"},"inflection":{"noun_plural":"malpublications"},"usage_notes":{"explanation":"\"Malpublication\"は、研究倫理の文脈で使われる専門用語であり、一般的には馴染みのない言葉です。研究結果の発表における不正行為を指しますが、捏造、改ざん、盗用といった重大な不正行為ではなく、データの選択的報告、不適切な著者表示、重複出版など、より微妙な不正行為を指します。研究の信頼性を損なう行為として問題視されています。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The author committed plagiarism, which is a type of malpublication.","correct":"✓ The author committed plagiarism, which is a type of research misconduct, but distinct from malpublication.","note":"Plagiarism (盗用) は research misconduct (研究不正) の一種ですが、malpublicationとは区別されます。Malpublicationは、捏造、改ざん、盗用以外の不正行為を指します。"},{"incorrect":"✗ Malpublication is only about making up data.","correct":"✓ Malpublication includes practices like selective reporting and inappropriate authorship, but not making up data (fabrication).","note":"Malpublicationは、データの捏造（作り上げること）は含みません。データの選択的報告や不適切な著者表示などが含まれます。"}],"priority":"★★☆"},"related_words":{"derivatives":["malpublish (動詞: 不正に出版する)"],"related_terms":["research integrity","research ethics","publication bias","selective reporting","duplicate publication","ghost authorship","gift authorship","data manipulation","scientific misconduct","fraudulent research"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (専門用語のためCEFRレベルは該当しない)","frequency_google_ngram":"低頻度 (Low frequency) - 専門分野でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Malpublication\" is a highly specialized term used within the context of research ethics and scientific publication. It refers to unethical practices in publishing research findings that fall outside the categories of fabrication, falsification, and plagiarism. Understanding this term requires familiarity with research methodology, ethical guidelines for publication, and the nuances of scientific misconduct. It is generally encountered in academic or professional settings related to research and publication. Examples of malpublication include selective reporting of data, inappropriate authorship (e.g., ghost authorship, gift authorship), and duplicate publication. The term is used to highlight the importance of transparency and integrity in the dissemination of research results.","priority":"★☆☆"},"example_sentences":[{"sentence":"The journal editor decided to retract the article due to evidence of malpublication.","translation":"その雑誌の編集者は、malpublicationの証拠があるため、記事を撤回することを決定した。","type":"noun","meaning_category":"研究不正"},{"sentence":"The university has established a committee to investigate allegations of malpublication.","translation":"その大学は、malpublicationの申し立てを調査するための委員会を設立した。","type":"noun","meaning_category":"研究不正"},{"sentence":"Researchers should be aware of the various forms that malpublication can take.","translation":"研究者は、malpublicationがとりうるさまざまな形態を認識しておく必要がある。","type":"noun","meaning_category":"研究不正"}]}