{"word":"Boxing Day","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ボクシング・デー（主にイギリス連邦諸国で、クリスマスの翌日である12月26日に行われる祝日。プレゼントを贈ったり、スポーツイベントが行われたりする。）","english_definition":"a holiday celebrated on December 26, the day after Christmas Day, primarily in countries with a British colonial history. It is traditionally a day for giving gifts to service workers and the poor, and is now often associated with shopping and sporting events.","examples":[{"sentence":"Many stores have big sales on Boxing Day.","translation":"多くの店がボクシング・デーに大規模なセールを行う。"},{"sentence":"We always watch a football match on Boxing Day.","translation":"私たちはいつもボクシング・デーにサッカーの試合を見る。"},{"sentence":"Boxing Day is a public holiday in Canada.","translation":"ボクシング・デーはカナダの祝日だ。"}],"collocations":["Boxing Day sales (ボクシング・デーのセール)","Boxing Day football (ボクシング・デーのサッカー)","celebrate Boxing Day (ボクシング・デーを祝う)","Boxing Day test (クリケットのボクシング・デー・テスト)"],"synonyms":["none (unique holiday)"],"antonyms":["Christmas Day","New Year's Day"]}],"etymology":{"value":"起源は諸説あり、はっきりとはわかっていません。有力な説としては、中世のイギリスで、教会が貧しい人々のために寄付を募った箱（boxing）を開ける日であったというものや、地主が使用人にクリスマスプレゼントを入れた箱を贈った習慣に由来するというものがあります。また、船乗りが航海の安全を祈願して箱にお金を入れていた習慣に由来するという説もあります。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɒksɪŋ deɪ/","syllables":"box-ing day"},"inflection":{"noun_plural":"Boxing Days"},"usage_notes":{"explanation":"「**Boxing Day**」は主にイギリス連邦諸国（イギリス、カナダ、オーストラリア、ニュージーランドなど）で祝われる祝日です。日付はクリスマスの翌日、12月26日です。伝統的には、雇用主が使用人にクリスマスプレゼントを入れた箱を贈ったり、教会が貧しい人々のために寄付を募った箱を開けたりする日でした。現代では、大規模なセールが行われたり、スポーツイベントが開催されたりすることが一般的です。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I went to the boxing day to buy presents.","correct":"✓ I went shopping on Boxing Day to buy presents.","note":"「boxing day」は「ボクシングの日」という意味ではなく、「Boxing Day」という祝日を指します。買い物に行く場合は、「on Boxing Day」という表現を使います。"},{"incorrect":"✗ Boxing day is only celebrated in America.","correct":"✓ Boxing Day is mainly celebrated in countries with a British colonial history, such as the UK, Canada, and Australia.","note":"ボクシング・デーは主にイギリス連邦諸国で祝われる祝日であり、アメリカでは一般的ではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":["none (compound noun)"],"idioms_phrases":["none"],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2 (特定の文化圏の知識)","frequency_google_ngram":"比較的低い (Relatively low) - 特定の地域や文化に限定されるため。","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"「**Boxing Day**」は、クリスマスの次の日、12月26日に主にイギリスやカナダ、オーストラリアなどで祝われる日です。昔は、お金持ちが使用人や貧しい人にプレゼントをあげる日でした。今では、お店で大きなセールをしたり、スポーツの試合を見たりすることが多いです。アメリカではあまり知られていません。"},"example_sentences":[{"sentence":"We always have a big family gathering on **Boxing Day**.","translation":"私たちはいつもボクシング・デーに大規模な家族の集まりを開く。","type":"noun","meaning_category":"祝日"},{"sentence":"The **Boxing Day** sales are a great opportunity to find bargains.","translation":"ボクシング・デーのセールは掘り出し物を見つける絶好の機会だ。","type":"noun","meaning_category":"セール"},{"sentence":"Many people go to football matches on **Boxing Day**.","translation":"多くの人がボクシング・デーにサッカーの試合を見に行く。","type":"noun","meaning_category":"スポーツイベント"}]}