{"word":"pneumaturia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"尿気症、尿中にガスが混入した状態","english_definition":"The passage of gas in the urine.","examples":[{"sentence":"Pneumaturia can be a sign of a fistula between the urinary tract and the bowel.","translation":"尿気症は、尿路と腸の間の瘻孔の兆候である可能性があります。"},{"sentence":"The patient presented with pneumaturia and fecaluria.","translation":"患者は尿気症と糞尿症を呈した。"}],"collocations":["cause of pneumaturia (尿気症の原因)","diagnosis of pneumaturia (尿気症の診断)","treatment of pneumaturia (尿気症の治療)"],"synonyms":["gasuria"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'pneumato-' meaning 'air' or 'gas', and 'uria' referring to 'urine'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnjuːməˈtʊəriə/","syllables":"pneu-ma-tu-ri-a"},"inflection":{"noun_plural":"pneumaturias"},"usage_notes":{"explanation":"Pneumaturia is a medical sign, not a disease itself. It indicates that gas is entering the urinary tract, usually from an abnormal connection (fistula) with the bowel, or sometimes from infection by gas-producing bacteria.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient had pneumaturia, so he had a UTI.","correct":"✓ The patient had pneumaturia, which suggested a possible fistula or gas-producing infection.","note":"Pneumaturia is not always caused by a UTI; it often indicates a more serious problem like a fistula."}],"priority":"★★☆"},"related_words":{"derivatives":["pneumatosis (異常な場所にガスが存在すること)","fistula (瘻孔)","fecaluria (糞尿症)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pneumaturia' is a specialized medical term referring to the presence of gas in the urine. It is typically encountered in clinical settings and medical literature. Understanding this term requires familiarity with medical terminology related to the urinary tract and potential underlying conditions such as fistulas or gas-producing infections. Its use is confined to healthcare professionals and those studying medicine."},"example_sentences":[{"sentence":"The doctor suspected a colovesical fistula due to the patient's report of pneumaturia.","translation":"医師は、患者の尿気症の報告から、膀胱結腸瘻を疑った。","type":"medical","meaning_category":"symptom"},{"sentence":"Pneumaturia, while alarming, is not always indicative of a life-threatening condition.","translation":"尿気症は、驚くべきことではあるが、必ずしも生命を脅かす状態を示すものではない。","type":"medical","meaning_category":"symptom"}]}