{"word":"caseating","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"乾酪壊死を起こしている、チーズ状の","english_definition":"Undergoing or resembling caseous necrosis; having a cheese-like consistency.","examples":[{"sentence":"The granuloma showed caseating necrosis.","translation":"その肉芽腫は乾酪壊死を示した。"},{"sentence":"Caseating lesions were observed in the lung tissue.","translation":"チーズ状の病変が肺組織に観察された。"}],"collocations":["caseating granuloma (乾酪壊死性肉芽腫)","caseating necrosis (乾酪壊死)","caseating lesion (乾酪壊死性病変)"],"synonyms":["caseous"],"antonyms":[]}],"etymology":{"value":"From Latin 'caseus' (cheese) + '-ate' + '-ing'. Reflects the cheese-like appearance of the necrotic tissue.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkeɪsiˌeɪtɪŋ/","syllables":"ca-se-at-ing"},"inflection":{"notes":"This is the present participle form of the verb 'caseate', which is rarely used. Primarily used as an adjective."},"usage_notes":{"explanation":"'Caseating' is a medical term primarily used in pathology to describe a specific type of necrosis (cell death) that has a cheese-like, crumbly appearance. It is most commonly associated with tuberculosis (TB) infections, but can also be seen in other granulomatous diseases. The term is used to describe the appearance of the necrotic tissue under macroscopic or microscopic examination.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The wound was caseating pus.","correct":"✓ The wound had caseating material.","note":"'Caseating' describes the *type* of necrosis, not the substance itself. It's more accurate to say the material *exhibits* caseating necrosis or has a caseating appearance."}],"priority":"★★☆"},"related_words":{"derivatives":["caseation (名詞: 乾酪化)","caseous (形容詞: 乾酪状の)","necrosis (名詞: 壊死)","granuloma (名詞: 肉芽腫)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Specialized vocabulary)","frequency_google_ngram":"Low frequency - Primarily used in medical and scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Caseating' is a highly specialized medical term used to describe a specific type of necrosis (tissue death) that has a cheese-like appearance. It's primarily encountered in the context of pathology and infectious diseases, particularly tuberculosis. Understanding this term requires a background in biology or medicine. It is not a word used in everyday conversation."},"example_sentences":[{"sentence":"Microscopic examination revealed extensive caseating necrosis within the lymph nodes.","translation":"顕微鏡検査により、リンパ節内に広範囲な乾酪壊死が認められた。","type":"adjective","meaning_category":"乾酪壊死を起こしている"},{"sentence":"The presence of caseating granulomas is a strong indicator of tuberculosis.","translation":"乾酪壊死性肉芽腫の存在は、結核の有力な指標となる。","type":"adjective","meaning_category":"乾酪壊死を起こしている"}]}