{"word":"anthozoon","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"花虫類（イソギンチャク、サンゴなど）","english_definition":"a class of marine invertebrates which includes the sea anemones and corals.","examples":[{"sentence":"Corals are anthozoans that secrete a calcium carbonate skeleton.","translation":"サンゴは炭酸カルシウムの骨格を分泌する花虫類です。"},{"sentence":"Sea anemones are solitary anthozoans that attach to rocks or other surfaces.","translation":"イソギンチャクは岩や他の表面に付着する単独性の花虫類です。"}],"collocations":["coral anthozoon","sea anemone anthozoon"],"synonyms":["coral","sea anemone","sea pen","gorgonian"],"antonyms":[]},{"part_of_speech":"noun","definition":"花虫綱の動物","english_definition":"any animal of the class Anthozoa.","examples":[{"sentence":"The Great Barrier Reef is built by anthozoons.","translation":"グレートバリアリーフは花虫綱の動物によって作られています。"}],"collocations":["anthozoan species","anthozoan diversity"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From the Greek words \"anthos\" (flower) and \"zoon\" (animal), referring to the flower-like appearance of many of these animals.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌænθəˈzoʊən/","syllables":"an-tho-zo-on"},"inflection":{"noun_plural":"anthozoans"},"usage_notes":{"explanation":"The term \"anthozoon\" is primarily used in scientific contexts when discussing marine biology, zoology, or related fields. It is not a commonly used word in everyday conversation. When referring to specific types of anthozoans, such as corals or sea anemones, those terms are generally preferred.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw an anthozoon at the zoo.","correct":"✓ I saw an anthozoan at the aquarium.","note":"Anthozoans are marine animals, so they are found in aquariums, not zoos."},{"incorrect":"✗ Anthozoons are plants.","correct":"✓ Anthozoons are animals.","note":"Anthozoans are marine invertebrates belonging to the animal kingdom."}],"priority":"★★☆"},"related_words":{"derivatives":["anthozoic (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily found in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"anthozoon\" is a technical term used in biology to refer to a class of marine invertebrates that includes corals and sea anemones. It's not a word you'd typically encounter in everyday conversation but rather in scientific or educational contexts related to marine life. Understanding this term requires some background knowledge in zoology or marine biology.","priority":"★★☆"},"example_sentences":[{"sentence":"The biodiversity of coral reefs is largely due to the presence of various anthozoon species.","translation":"サンゴ礁の生物多様性は、主にさまざまな花虫類の存在によるものです。","type":"noun","meaning_category":"花虫類"},{"sentence":"Anthozoons play a critical role in the marine ecosystem by providing habitat for other organisms.","translation":"花虫類は他の生物の生息地を提供することで、海洋生態系において重要な役割を果たしています。","type":"noun","meaning_category":"花虫綱の動物"}]}