{"word":"patronship","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"後援、保護、ひいきにすること","english_definition":"The power to give appointments or approve promotions; support, encouragement, privilege, or financial aid that an organization or individual bestows to another.","examples":[{"sentence":"The arts in the city flourished under the Earl's patronship.","translation":"その都市の芸術は、伯爵の庇護のもとで繁栄した。"},{"sentence":"The young artist relied on the patronship of wealthy benefactors to continue his work.","translation":"その若い芸術家は、作品を続けるために裕福な後援者の支援に頼っていた。"},{"sentence":"The university offered her a professorship through the patronship of a generous alumnus.","translation":"大学は、寛大な卒業生の支援により、彼女に教授職を提供した。"}],"collocations":["artistic patronship","royal patronship","financial patronship","offer patronship","seek patronship"],"synonyms":["sponsorship","backing","support","advocacy","promotion","aid","assistance","guardianship","custody","protection"],"antonyms":["opposition","antagonism","disapproval","rejection","neglect"]}],"etymology":{"value":"From 'patron' + '-ship'. 'Patron' comes from the Latin 'patronus', meaning 'protector, defender'. The suffix '-ship' denotes a state, condition, or office.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpeɪtrənʃɪp/","syllables":"pa-tron-ship"},"inflection":{"noun_plural":"patronships"},"usage_notes":{"explanation":"'Patronship' refers to the act of providing support or the status of being a patron. It often implies a relationship where one party (the patron) provides resources or influence to another (the recipient). It can also refer to the control of appointments to public office. It is often used in the context of arts, charities, and political appointments.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He received a patronship for his hard work.","correct":"✓ He received patronage for his hard work.","note":"'Patronage' is more commonly used to refer to the support itself, whereas 'patronship' refers to the role or position of being a patron or the system of patronage. 'Patronage' is the more general term for support."},{"incorrect":"✗ The artist was grateful for the patronship he received from the museum.","correct":"✓ The artist was grateful for the patronage he received from the museum.","note":"Again, 'patronage' is the more common and natural way to express the support received. While 'patronship' isn't incorrect, it's less frequently used in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["patron (noun: a person who gives financial or other support to a person, organization, cause, or activity)","patronize (verb: treat with an apparent kindness that betrays a feeling of superiority)","patronage (noun: the support, encouragement, privilege, or financial aid that an organization or individual bestows to another)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'patronship' is a relatively formal term referring to the role, position, or system associated with being a patron. It implies a relationship of support, often financial or influential, from one party to another. While 'patronage' is more commonly used to describe the act of supporting, 'patronship' emphasizes the status or office of the patron. Understanding the subtle difference between 'patronship' and 'patronage' is crucial for using the term correctly."},"example_sentences":[{"sentence":"The museum director sought to expand the museum's patronship through fundraising events.","translation":"美術館の館長は、資金調達イベントを通じて美術館の支援を拡大しようとした。","type":"noun","meaning_category":"後援"},{"sentence":"The scholar's research was made possible through the patronship of a private foundation.","translation":"その学者の研究は、民間の財団の支援によって可能になった。","type":"noun","meaning_category":"保護"},{"sentence":"The system of political patronship was criticized for its potential for corruption.","translation":"政治的な後援システムは、汚職の可能性のために批判された。","type":"noun","meaning_category":"ひいきにすること"}]}