{"word":"abstractiveness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"抽象性、抽象的な性質","english_definition":"The quality or state of being abstract; the degree to which something is abstract.","examples":[{"sentence":"The abstractiveness of the theory made it difficult to understand.","translation":"その理論の抽象性が理解を困難にした。"},{"sentence":"The painting's abstractiveness allowed for multiple interpretations.","translation":"その絵画の抽象性は、多様な解釈を可能にした。"}],"collocations":["high abstractiveness","low abstractiveness","level of abstractiveness","degree of abstractiveness"],"synonyms":["abstraction","intangibility","vagueness","generality"],"antonyms":["concreteness","tangibility","specificity"]}],"etymology":{"value":"Formed from 'abstractive' (tending to abstract) + '-ness' (suffix denoting a state or quality).","priority":"★☆☆"},"pronunciation":{"ipa":"/æbˈstræktɪvnəs/","syllables":"ab-stract-ive-ness"},"inflection":{"noun_plural":"abstractivenesses (rarely used)"},"usage_notes":{"explanation":"'Abstractiveness' refers to the extent to which something is abstract, lacking in concrete or tangible qualities. It is often used in academic or philosophical contexts to describe theories, concepts, or works of art.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The abstractiveness of the idea was very high. It was hard to understand.","correct":"✓ The abstractness of the idea was very high. It was hard to understand.","note":"While 'abstractiveness' is a valid word, 'abstractness' is more commonly used to describe the quality of being abstract."}],"priority":"★★☆"},"related_words":{"derivatives":["abstract","abstractive","abstractly","abstractness"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Abstractiveness' is a relatively uncommon noun that describes the degree to which something is abstract. It's often used in formal or academic contexts when discussing the nature of ideas, theories, or art that are not easily grasped due to their lack of concrete detail. Although grammatically correct, 'abstractness' is a more frequently used and generally preferred synonym."},"example_sentences":[{"sentence":"The high abstractiveness of his philosophical arguments made them inaccessible to the general public.","translation":"彼の哲学的な議論の高度な抽象性は、一般の人々には理解しにくいものにした。","type":"noun","meaning_category":"抽象性"},{"sentence":"The abstractiveness of modern art can be challenging for some viewers.","translation":"現代アートの抽象性は、一部の鑑賞者にとっては難しいものとなる可能性がある。","type":"noun","meaning_category":"抽象的な性質"}]}