{"word":"hierarchism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"階層主義、ヒエラルキー主義","english_definition":"The belief in or advocacy of hierarchy, especially as a principle of social organization.","examples":[{"sentence":"The company's hierarchism stifled innovation and creativity.","translation":"その会社の階層主義は、革新と創造性を抑制した。"},{"sentence":"Some argue that hierarchism is a natural and inevitable feature of human societies.","translation":"階層主義は、人間社会の自然かつ不可避な特徴であると主張する人もいる。"}],"collocations":["social hierarchism","organizational hierarchism","political hierarchism"],"synonyms":["hierarchy","stratification","ranking","pecking order"],"antonyms":["egalitarianism","anarchism","horizontalism"]}],"etymology":{"value":"'Hierarchy' + '-ism'. 'Hierarchy' comes from Late Latin hierarchia, from Greek hierarchia 'rule of a high priest', from hierarkhēs 'high priest', from hieros 'sacred' + arkhēs 'ruler'. '-ism' is a suffix denoting a belief, principle, or system.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhaɪərɑːrkɪzəm/","syllables":"hi-er-ar-chism"},"inflection":{"noun_plural":"hierarchisms"},"usage_notes":{"explanation":"'Hierarchism' refers to the belief in or advocacy for a hierarchical social structure. It is often used critically to describe systems where power and authority are concentrated at the top, leading to inequality and limited opportunities for those lower in the hierarchy. It can also be used neutrally to describe the existence of hierarchies without necessarily endorsing them.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The opposite of hierarchism is hierarchy.","correct":"✓ The opposite of hierarchism is egalitarianism or anarchism.","note":"'Hierarchy' is the system itself, while 'hierarchism' is the belief in or advocacy of that system. The opposite of believing in hierarchy is believing in equality or the absence of hierarchy."}],"priority":"★★☆"},"related_words":{"derivatives":["hierarchical (adjective)","hierarchically (adverb)","hierarchist (noun)"],"related_concepts":["hierarchy","social stratification","power structures","authority","inequality"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hierarchism' is a relatively complex term referring to the belief in or support for hierarchical systems. It is often used in discussions of social and political organization, and understanding it requires familiarity with the concept of hierarchy itself. The word is typically used in academic or intellectual contexts."},"example_sentences":[{"sentence":"The leader defended the hierarchism of the military structure, arguing it was essential for discipline.","translation":"指導者は、軍事構造の階層主義を擁護し、それが規律に不可欠であると主張した。","type":"general"},{"sentence":"Critics of the organization accused it of promoting hierarchism and stifling dissent.","translation":"その組織の批評家は、それが階層主義を助長し、異議を封じ込めていると非難した。","type":"general"}]}