{"word":"unactable","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"上演[演技]不可能な、実演[実行]不可能な","english_definition":"impossible to perform or act out, especially on stage; not suitable for dramatic performance.","examples":[{"sentence":"The play was deemed unactable due to its complex themes and staging requirements.","translation":"その劇は、複雑なテーマと舞台設定の要件のために、上演不可能と判断された。"},{"sentence":"Some scenes in the novel are considered unactable because they rely heavily on internal monologue.","translation":"その小説の一部の場面は、内面の独白に大きく依存しているため、実演不可能と考えられている。"}],"collocations":["unactable play","unactable scene","deem unactable","consider unactable"],"synonyms":["unperformable","unstageable","undramatizable","impracticable","impossible"],"antonyms":["actable","performable","stageable","dramatizable","practicable"]}],"etymology":{"value":"\"un-\" (not) + \"actable\" (capable of being acted).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈæktəbəl/","syllables":"un-act-a-ble"},"inflection":{"notes":"Adjective; comparative and superlative forms are usually expressed with 'more' and 'most' (e.g., 'more unactable', 'most unactable')."},"usage_notes":{"explanation":"\"Unactable\" is primarily used in the context of theatrical or dramatic works. It describes something that, due to its nature (e.g., excessive length, abstract concepts, technical difficulty), cannot be effectively or realistically presented on stage or in a performance. It's often a subjective judgment, depending on the resources and skill available.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The situation was unactable.","correct":"✓ The situation was untenable.","note":"\"Unactable\" specifically refers to something that cannot be performed. If you mean a situation is impossible to deal with, use \"untenable\" or \"impossible\"."},{"incorrect":"✗ He was unactable in the role.","correct":"✓ He was miscast in the role. / ✓ He was unable to act the role well.","note":"If you mean someone performed poorly, use \"miscast\" or describe their acting ability directly, rather than saying they were \"unactable\". \"Unactable\" describes the material, not the performer."}],"priority":"★★☆"},"related_words":{"derivatives":["actable (adjective: capable of being acted)","act (verb: to perform; noun: a performance)","action (noun: the process of doing something)"],"phrases":["unfilmable (similar concept for films)","unadaptable (not able to be adapted)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unactable\" is a relatively uncommon and specialized term, primarily used in discussions of theater, film, or literature. It means that something is impossible or extremely difficult to perform or adapt for performance. This could be due to the complexity of the plot, the abstract nature of the themes, or the technical challenges involved in staging it. Understanding this word requires a good grasp of vocabulary related to the performing arts."},"example_sentences":[{"sentence":"Critics described the final scene as unactable due to its reliance on abstract symbolism.","translation":"批評家たちは、最後の場面が抽象的な象徴に依存しているため、上演不可能だと評した。","type":"adjective","meaning_category":"impossible to perform"},{"sentence":"The director struggled to find a way to make the unactable parts of the script work on stage.","translation":"監督は、脚本の上演不可能な部分を舞台で機能させる方法を見つけるのに苦労した。","type":"adjective","meaning_category":"difficult to perform"}]}