{"word":"Archfounder","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The primary founder or architect of a system, institution, or movement.","english_definition":"The original or principal founder or architect of something, especially a system, institution, or movement.","examples":[{"sentence":"He is considered the archfounder of modern economics.","translation":"彼は現代経済学の創始者とみなされている。"},{"sentence":"She was the archfounder of the organization, dedicating her life to its creation.","translation":"彼女はその組織の創設者であり、その創設に生涯を捧げた。"}],"collocations":["archfounder of a movement","archfounder of a system","archfounder of an institution"],"synonyms":["founder","architect","originator","creator","pioneer"],"antonyms":["follower","successor","inheritor"]}],"etymology":{"value":"Combination of \"arch-\" (chief, principal) and \"founder\" (one who establishes or originates).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɑːrtʃˈfaʊndər/","syllables":"arch-found-er"},"inflection":{"noun_plural":"archfounders"},"usage_notes":{"explanation":"The term \"archfounder\" emphasizes the primary or original role of the founder. It is often used to highlight the significant impact and foundational contribution of the individual.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a founder, but not the archfounder.","correct":"✓ He was a founder, but not the archfounder; that title belongs to someone else.","note":"Distinguish between a regular founder and the primary or original founder. Use \"archfounder\" only when referring to the principal originator."}],"priority":"★★☆"},"related_words":{"derivatives":["archfounding (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"archfounder\" is a relatively rare and sophisticated term used to describe the primary or original founder of something significant. It is used to emphasize the foundational role and impact of the individual. Understanding the prefix \"arch-\" as meaning \"chief\" or \"principal\" helps in understanding the word's meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"Plato is often regarded as the archfounder of Western philosophy.","translation":"プラトンは西洋哲学の創始者とみなされることが多い。","type":"noun","meaning_category":"founder"},{"sentence":"As the archfounder of the company, his vision shaped its core values.","translation":"会社の創設者として、彼のビジョンがその核心的価値観を形作った。","type":"noun","meaning_category":"founder"},{"sentence":"She is remembered as the archfounder of the charity, whose work continues to impact lives.","translation":"彼女は慈善団体の創設者として記憶されており、その活動は人々の生活に影響を与え続けている。","type":"noun","meaning_category":"founder"}]}