{"word":"stramony","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"チョウセンアサガオ（Datura stramonium）","english_definition":"A coarse annual weed (Datura stramonium) of the nightshade family, with poisonous foliage and large white or purplish trumpet-shaped flowers followed by prickly capsules.","examples":[{"sentence":"Stramony is known for its hallucinogenic properties.","translation":"チョウセンアサガオは幻覚作用があることで知られています。"},{"sentence":"The plant stramony is considered a noxious weed in many areas.","translation":"チョウセンアサガオは多くの地域で有害な雑草とみなされています。"}],"collocations":["stramony extract","stramony poisoning","Datura stramonium"],"synonyms":["jimsonweed","thorn apple","devil's trumpet","locoweed"],"antonyms":[]}],"etymology":{"value":"Derived from the Medieval Latin word 'stramonium', which is believed to be a corruption of 'struma' (a swelling or tumor) and 'monium' (possibly referring to its use as a medicine).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstræməni/","syllables":"stra-mo-ny"},"inflection":{"noun_plural":"stramonies"},"usage_notes":{"explanation":"'Stramony' is a less common name for Datura stramonium, a plant more frequently referred to as jimsonweed or thorn apple. It is known for its toxic and hallucinogenic properties and should be handled with extreme caution.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used stramony as a regular herb in my cooking.","correct":"✓ Stramony is not safe for consumption and should not be used in cooking.","note":"Stramony is poisonous and should never be ingested. This is a critical safety point."}],"priority":"★★★"},"related_words":{"derivatives":["stramonium (alternative spelling)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Very uncommon, specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Stramony' is a highly specialized term referring to a specific plant species, Datura stramonium. Its usage is primarily limited to botanical or toxicological contexts. Due to its toxicity, general use is discouraged, and knowledge of the term is not expected outside of relevant fields."},"example_sentences":[{"sentence":"The effects of stramony poisoning can be severe and require immediate medical attention.","translation":"チョウセンアサガオ中毒の影響は深刻であり、直ちに医療処置が必要です。","type":"noun","meaning_category":"plant/poison"},{"sentence":"Historical records indicate that stramony was sometimes used in traditional medicine, despite its dangers.","translation":"歴史的記録によると、チョウセンアサガオは危険性にもかかわらず、伝統医学で時々使用されていました。","type":"noun","meaning_category":"plant/historical use"}]}