{"word":"chalcedony","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"玉髄（ぎょくずい）","english_definition":"A cryptocrystalline form of silica, consisting of fine intergrowths of quartz and moganite. It has a waxy luster, and may be translucent or opaque.","examples":[{"sentence":"Chalcedony is often used in jewelry and ornamental objects.","translation":"玉髄はしばしば宝石や装飾品に使われます。"},{"sentence":"Agate and onyx are varieties of chalcedony.","translation":"瑪瑙（めのう）やオニキスは玉髄の一種です。"}],"collocations":["blue chalcedony","white chalcedony","chalcedony beads","chalcedony jewelry"],"synonyms":["agate","onyx","jasper"],"antonyms":[]},{"part_of_speech":"noun","definition":"(広義には) 二酸化ケイ素の潜晶質の変種全般","english_definition":"(In a broader sense) Any cryptocrystalline variety of silica.","examples":[{"sentence":"The term chalcedony is sometimes used to refer to a wide range of cryptocrystalline quartz minerals.","translation":"玉髄という言葉は、時として広範囲な潜晶質の石英鉱物を指すのに使われます。"}],"collocations":[],"synonyms":["cryptocrystalline quartz"],"antonyms":[]}],"etymology":{"value":"From Latin chalcedonius, from Ancient Greek χαλκηδόνιος (khalkēdónios), of or from Chalcedon, an ancient maritime town in Bithynia in Asia Minor (modern-day Kadıköy, Turkey).","priority":"★★☆"},"pronunciation":{"ipa":"/kælˈsɛdəni/","syllables":"chal-ced-o-ny"},"inflection":{"noun_plural":"chalcedonies"},"usage_notes":{"explanation":"Chalcedony is a mineral that comes in many different colors and patterns. It is often used for carvings, beads, and other decorative items. The term can be used broadly to include various forms of cryptocrystalline silica.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a chalcedony rock.","correct":"✓ I have a chalcedony specimen.","note":"'Specimen' is more appropriate when referring to a mineral sample."}],"priority":"★☆☆"},"related_words":{"derivatives":["chalcedonic (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Chalcedony is a relatively uncommon word referring to a specific type of mineral. It is more likely to be encountered in contexts related to geology, mineralogy, jewelry, or lapidary arts. Understanding the term requires some familiarity with scientific or specialized vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The museum displayed a beautiful collection of chalcedony specimens.","translation":"博物館には美しい玉髄の標本が集められて展示されていました。","type":"noun","meaning_category":"玉髄"},{"sentence":"She wore a necklace made of polished chalcedony beads.","translation":"彼女は磨かれた玉髄のビーズで作られたネックレスを身に着けていました。","type":"noun","meaning_category":"玉髄"}]}