{"word":"purwannah","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(historical) A written order or grant issued by a sovereign in India, especially during the Mughal period.","english_definition":"A written order or grant issued by a sovereign in India, especially during the Mughal period.","examples":[{"sentence":"The East India Company obtained a purwannah granting them trading rights.","translation":"東インド会社は、貿易権を付与するプルワンナを取得した。"}],"collocations":["issue a purwannah","obtain a purwannah","royal purwannah","Mughal purwannah"],"synonyms":["firman","edict","decree","warrant"],"antonyms":[]}],"etymology":{"value":"From Persian *parvāna* (پروانه) meaning 'order, warrant, butterfly'.","priority":"★★☆"},"pronunciation":{"ipa":"/pərˈwɑːnə/","syllables":"pur-wah-nah"},"inflection":{"noun_plural":"purwannahs"},"usage_notes":{"explanation":"The term 'purwannah' is primarily used in a historical context when discussing the administrative and legal systems of Mughal India and other related Indian kingdoms. It refers to a formal document granting specific rights, privileges, or instructions.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["firman","sanad"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily used in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'purwannah' is a specialized term related to the history of India, particularly the Mughal period. It is not commonly used in modern English and would primarily be encountered in academic or historical texts. Understanding requires familiarity with South Asian history and administrative terminology."},"example_sentences":[{"sentence":"The museum displayed several original purwannahs from the Mughal era.","translation":"博物館には、ムガル時代のオリジナルのプルワンナがいくつか展示されていた。","type":"noun","meaning_category":"historical order"},{"sentence":"The historian analyzed the purwannah to understand the economic policies of the time.","translation":"歴史家は、当時の経済政策を理解するためにプルワンナを分析した。","type":"noun","meaning_category":"historical order"}]}