{"word":"Americanophilic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"アメリカを愛好する、アメリカびいきの","english_definition":"Having a strong affinity for or love of the United States, its culture, and its people.","examples":[{"sentence":"He is an Americanophilic historian who specializes in the Civil War.","translation":"彼は南北戦争を専門とするアメリカびいきの歴史家だ。"},{"sentence":"The Americanophilic tourist visited every major city in the U.S.","translation":"そのアメリカ愛好家の観光客は、アメリカの主要都市すべてを訪れた。"},{"sentence":"Despite some criticisms of American foreign policy, she remains Americanophilic.","translation":"アメリカの外交政策に対するいくつかの批判にもかかわらず、彼女は依然としてアメリカびいきだ。"}],"collocations":["strongly Americanophilic","overtly Americanophilic","mildly Americanophilic"],"synonyms":["pro-American","America-loving","Americanophile"],"antonyms":["Americanophobic","anti-American","anti-Americanophilic"]}],"etymology":{"value":"Formed from \"Americano-\" (combining form of \"American\") + \"-philic\" (from \"-philia\", denoting love or affinity).","priority":"★★☆"},"pronunciation":{"ipa":"/əˌmɛrɪkəˈnɒfɪlɪk/","syllables":"A-mer-i-co-phil-ic"},"inflection":{"notes":"This is an adjective, so it has comparative and superlative forms (more Americanophilic, most Americanophilic), but they are not commonly used."},"usage_notes":{"explanation":"The term \"Americanophilic\" describes someone who has a strong positive feeling towards the United States. It is less common than \"pro-American\" but carries a similar meaning. It can describe someone who admires American culture, politics, or way of life. The term can sometimes be used critically, implying an uncritical or excessive admiration.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Americanophilic.","correct":"✓ He is Americanophilic. / ✓ He is an Americanophile.","note":"\"Americanophilic\" is an adjective, so it needs a noun to modify. The noun form is \"Americanophile.\""},{"incorrect":"✗ She has Americanophilic for the USA.","correct":"✓ She has Americanophilia for the USA. / ✓ She is Americanophilic.","note":"The noun form for the love of America is \"Americanophilia\"."}],"priority":"★★☆"},"related_words":{"derivatives":["Americanophile (noun: a person who is Americanophilic)","Americanophilia (noun: love of the United States)"],"antonyms":["Americanophobia (noun: fear or dislike of the United States)","Americanophobic (adjective: having Americanophobia)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - relatively uncommon word.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Americanophilic\" is a relatively uncommon term used to describe someone who has a strong liking or admiration for the United States, its culture, and its people. It is more formal and less frequently used than terms like \"pro-American\" or \"America-loving.\" Understanding the word requires familiarity with the suffix \"-philic,\" which indicates love or attraction. The word is most likely to be encountered in academic or political discussions. "},"example_sentences":[{"sentence":"The professor's lectures were often seen as overly Americanophilic.","translation":"その教授の講義は、しばしば過度なアメリカびいきと見なされた。","type":"adjective","meaning_category":"general"},{"sentence":"Despite living abroad, she remained deeply Americanophilic.","translation":"海外に住んでいるにもかかわらず、彼女は深くアメリカを愛し続けた。","type":"adjective","meaning_category":"general"},{"sentence":"His Americanophilic views were often challenged by his colleagues.","translation":"彼のアメリカびいきの考えは、しばしば同僚から異議を唱えられた。","type":"adjective","meaning_category":"general"}]}