{"word":"Drydenic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ジョン・ドライデンの、またはジョン・ドライデンに似た","english_definition":"Of or pertaining to John Dryden, or resembling his style.","examples":[{"sentence":"The Drydenic style is characterized by its wit, precision, and formal structure.","translation":"ドライデン的な文体は、その機知、正確さ、そして形式的な構造によって特徴づけられる。"},{"sentence":"A Drydenic couplet is a rhyming pair of lines in iambic pentameter.","translation":"ドライデン風二行連句は、弱強五歩格の韻を踏んだ二行の詩である。"}],"collocations":["Drydenic couplet","Drydenic style","Drydenic wit"],"synonyms":["classical","Augustan","formal"],"antonyms":["romantic","informal"]}],"etymology":{"value":"Named after John Dryden (1631-1700), an influential English poet, literary critic, translator, and playwright who dominated the literary scene of his time.","priority":"★★★"},"pronunciation":{"ipa":"/draɪˈdɛnɪk/","syllables":"Dry-den-ic"},"inflection":{"notes":"This is an adjective and does not inflect like a verb or noun."},"usage_notes":{"explanation":"'Drydenic' is primarily used in literary contexts to describe works or styles that are reminiscent of John Dryden's writing. This often implies a sense of order, reason, and controlled expression.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The poem was very Dryden.","correct":"✓ The poem was very Drydenic.","note":"'Dryden' is a proper noun (the name of a person), while 'Drydenic' is the adjective form used to describe something related to him or his style."}],"priority":"☆☆☆"},"related_words":{"derivatives":["Dryden (noun): John Dryden himself"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Drydenic' is a specialized term primarily used in literary criticism and historical discussions of English literature. Understanding requires familiarity with John Dryden and the literary period in which he wrote. The term is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The essay exhibited a Drydenic clarity and precision of thought.","translation":"そのエッセイは、ドライデン風の明晰さと思考の正確さを示していた。","type":"adjective","meaning_category":"style"},{"sentence":"His use of satire was reminiscent of Drydenic wit.","translation":"彼の風刺の使い方は、ドライデン風の機知を彷彿とさせた。","type":"adjective","meaning_category":"wit"}]}