{"word":"endemism","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(生物学)固有性、地方病性","english_definition":"the ecological state of a species being unique to a defined geographic location, such as an island, nation, country or other defined zone, or habitat type; organisms that are indigenous to a place are not endemic to it if they are also found elsewhere.","examples":[{"sentence":"The island is known for its high level of endemism.","translation":"その島は固有性が高いことで知られています。"},{"sentence":"Habitat loss is a major threat to endemism.","translation":"生息地の喪失は固有性に対する大きな脅威です。"},{"sentence":"Many of the species in the Galapagos Islands are examples of endemism.","translation":"ガラパゴス諸島の多くの種は、固有性の例です。"}],"collocations":["high endemism (高い固有性)","local endemism (局所的な固有性)","island endemism (島の固有性)","endemism rate (固有性率)","center of endemism (固有性の中心地)"],"synonyms":["native","indigenous","local","restricted range"],"antonyms":["cosmopolitan","widespread","ubiquitous"]},{"part_of_speech":"noun","definition":"(医学)地方病","english_definition":"the constant presence and/or usual prevalence of a disease or infectious agent in a population within a geographic area.","examples":[{"sentence":"Malaria is an example of endemism in many tropical countries.","translation":"マラリアは多くの熱帯国における地方病の例です。"},{"sentence":"The level of endemism for the disease has decreased due to vaccination programs.","translation":"予防接種プログラムにより、その病気の地方病性は低下しました。"}],"collocations":["disease endemism (病気の地方病性)","level of endemism (地方病のレベル)","endemic area (地方病地域)","control of endemism (地方病の制御)"],"synonyms":["prevalence","persistence","localized disease"],"antonyms":["epidemic","pandemic"]}],"etymology":{"value":"Derived from the Greek word 'endemos' meaning 'native' or 'dwelling in'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛndəmɪzəm/","syllables":"en-de-mism"},"inflection":{"notes":"This is a noun and does not have plural forms in the traditional sense, although you might refer to 'types of endemism' in some contexts."},"usage_notes":{"explanation":"In biology, 'endemism' refers to species that are unique to a specific geographic location. It's important to distinguish this from 'native' or 'indigenous,' which simply means that a species originates from a place but may also be found elsewhere. In medicine, 'endemism' refers to the constant presence of a disease in a particular area.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant is native to the island, so it is endemism.","correct":"✓ The plant is native to the island, so it is endemic to the island. / ✓ The plant exhibits endemism on the island.","note":"'Endemism' is a noun (the state of being endemic), while 'endemic' is an adjective (belonging or native exclusively to a particular place)."},{"incorrect":"✗ The high endemism of the species is due to climate change.","correct":"✓ The high rate of endemism of the species is due to geographic isolation.","note":"While climate change can affect species distribution, endemism is usually related to geographic isolation or unique local conditions that allow species to evolve separately."}],"priority":"★★☆"},"related_words":{"derivatives":["endemic (adjective: native or confined to a particular region or people)","endemically (adverb: in an endemic manner)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency but important in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Endemism' refers to the state of a plant or animal species being unique to a defined geographic location. This means it is found nowhere else in the world. It is a term commonly used in biology and ecology when discussing the distribution of species. In medicine, it refers to the constant presence of a disease in a particular area or population. Understanding this term is important for discussing biodiversity, conservation, and public health issues."},"example_sentences":[{"sentence":"Madagascar is famous for its high levels of plant and animal **endemism**.","translation":"マダガスカルは、動植物の**固有性**の高さで有名です。","type":"noun","meaning_category":"Biology"},{"sentence":"The island's isolation has led to a remarkable degree of **endemism** among its bird populations.","translation":"その島の隔離は、鳥類の個体群において著しい程度の**固有性**をもたらしました。","type":"noun","meaning_category":"Biology"},{"sentence":"The **endemism** of certain diseases in developing countries poses a significant public health challenge.","translation":"発展途上国における特定の病気の**地方病性**は、重大な公衆衛生上の課題となっています。","type":"noun","meaning_category":"Medicine"},{"sentence":"Conservation efforts are crucial to protect areas with high **endemism**.","translation":"高い**固有性**を持つ地域を保護するためには、保全活動が不可欠です。","type":"noun","meaning_category":"Biology"}]}