{"word":"abreacts","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(精神分析)感情を解放する、感情を爆発させる、感情を浄化する","english_definition":"To release or discharge pent-up emotions and repressed feelings, often through reliving a past trauma in a therapeutic setting.","examples":[{"sentence":"The patient abreacted during the therapy session, reliving the traumatic event.","translation":"患者はセラピーのセッション中に感情を爆発させ、トラウマとなった出来事を追体験した。"},{"sentence":"Through abreaction, she was able to process her grief and begin to heal.","translation":"感情の解放を通して、彼女は悲しみを処理し、癒し始めることができた。"}],"collocations":["abreact in therapy","abreact repressed emotions","abreact traumatic memories"],"synonyms":["catharsis","emotional release","vent","purge","discharge"],"antonyms":["repress","suppress","inhibit","contain"]}],"etymology":{"value":"'Abreact' is formed from 'ab-' (away, off) + 'react'. It was coined within the field of psychoanalysis to describe the process of releasing repressed emotions.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæb.riˈækts/","syllables":"ab-re-acts"},"inflection":{"verb_forms":{"present_simple":["abreacts"],"past_simple":"abreacted","past_participle":"abreacted","present_participle":"abreacting"}},"usage_notes":{"explanation":"'Abreact' is a term primarily used in psychology and psychoanalysis. It refers to the process of reliving a traumatic experience in order to release the emotions associated with it. This is often done in a therapeutic setting under the guidance of a trained professional. The goal of abreaction is to help the individual process the trauma and reduce its negative impact on their mental health.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She abreactions her anger by yelling at her friends.","correct":"✓ She vents her anger by yelling at her friends.","note":"'Abreact' typically refers to a therapeutic process of reliving a past trauma, not just any expression of anger. Use 'vent' or 'express' for general anger release."},{"incorrect":"✗ The medicine caused him to abreaction.","correct":"✓ The medicine caused him to have an emotional outburst.","note":"'Abreact' is an active process, not something caused by a medicine. Use 'emotional outburst' or 'emotional reaction' in this context."}],"priority":"★☆☆"},"related_words":{"derivatives":["abreaction (noun): The process of abreacting.","catharsis (noun): The process of releasing strong or repressed emotions."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Abreact' is a specialized term used in the context of psychoanalysis and psychology. It describes the process of releasing repressed emotions and reliving traumatic experiences in a therapeutic setting. This term is not commonly used in everyday conversation and is more often found in academic or clinical contexts."},"example_sentences":[{"sentence":"During the session, the patient **abreacted**, expressing years of repressed anger.","translation":"セッション中、患者は感情を爆発させ、長年抑圧していた怒りを表出した。","type":"verb","meaning_category":"感情を解放する"},{"sentence":"The therapist guided her through the process of **abreacting** the painful memories.","translation":"セラピストは、彼女が苦痛な記憶を感情的に解放するプロセスを導いた。","type":"verb","meaning_category":"感情を解放する"}]}