{"word":"hemigeusia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"半側味覚脱失：舌の片側で味覚が失われること。","english_definition":"Loss of taste on one side of the tongue.","examples":[{"sentence":"Hemigeusia can be caused by damage to the nerves controlling taste.","translation":"半側味覚脱失は、味覚を制御する神経の損傷によって引き起こされる可能性があります。"},{"sentence":"The patient reported hemigeusia after undergoing dental surgery.","translation":"患者は歯科手術後、半側味覚脱失を訴えました。"}],"collocations":["cause of hemigeusia","symptoms of hemigeusia","treatment for hemigeusia"],"synonyms":["unilateral ageusia"],"antonyms":[]}],"etymology":{"value":"The term \"hemigeusia\" is derived from the Greek words \"hemi-\" meaning \"half,\" and \"geusia\" meaning \"taste.\"","priority":"★★★"},"pronunciation":{"ipa":"/ˌhɛmiˈɡjuːziə/","syllables":"he-mi-geu-si-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Hemigeusia is a relatively rare condition. It is important to differentiate it from other taste disorders such as ageusia (complete loss of taste) and dysgeusia (distortion of taste). Diagnosis typically involves a physical examination and taste testing.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["ageusia","dysgeusia","hypergeusia"],"related_medical_terms":["taste disorder","gustatory nerve","chorda tympani"],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Hemigeusia is a specialized medical term referring to the loss of taste sensation on one side of the tongue. It's not commonly used outside of medical contexts. Understanding this term requires knowledge of medical terminology related to sensory perception and neurological conditions."},"example_sentences":[{"sentence":"Following the injury, he experienced hemigeusia, making it difficult to enjoy food.","translation":"怪我の後、彼は半側味覚脱失を経験し、食べ物を楽しむのが困難になりました。","type":"general","meaning_category":"symptom"},{"sentence":"The neurologist suspected nerve damage as the cause of the patient's hemigeusia.","translation":"神経科医は、患者の半側味覚脱失の原因として神経損傷を疑った。","type":"medical","meaning_category":"diagnosis"}]}