{"word":"unpicketed","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"ピケを張られていない、ピケットラインが設けられていない","english_definition":"Not surrounded or blockaded by a picket line.","examples":[{"sentence":"The factory remained unpicketed, allowing workers to enter freely.","translation":"その工場はピケを張られていない状態だったので、労働者たちは自由に入ることができた。"},{"sentence":"An unpicketed entrance provided access to the building.","translation":"ピケットラインが設けられていない入り口が、建物へのアクセスを提供した。"}],"collocations":["remain unpicketed","an unpicketed entrance"],"synonyms":["unblocked","unobstructed","open"],"antonyms":["picketed","blockaded","obstructed"]}],"etymology":{"value":"The word is formed by adding the prefix 'un-' (meaning 'not') to the past participle 'picketed' of the verb 'to picket'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˈpɪkɪtɪd/","syllables":"un-pick-et-ed"},"inflection":{"notes":"This is an adjective, so it doesn't have typical verb inflections. However, it can be used in comparative and superlative forms (more unpicketed, most unpicketed), though these are rare."},"usage_notes":{"explanation":"'Unpicketed' is a relatively rare word, primarily used in the context of labor disputes or protests. It describes a location, typically a building or entrance, where a picket line has not been established. The absence of a picket line implies that access is not being actively blocked or protested.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unpicketed protest was small.","correct":"✓ The unpicketed factory was open.","note":"'Unpicketed' describes the *location* (e.g., factory, building), not the protest itself. A protest is either 'picketed' or not, but the location is 'unpicketed' if there is no picket line."}],"priority":"★★☆"},"related_words":{"derivatives":["picket (noun/verb)","picketing (noun/verb)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Very rare - not typically found in standard language learning resources)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'unpicketed' is a specialized term primarily used in the context of labor disputes and protests. It describes a location where a picket line is absent. Understanding requires familiarity with the concepts of picketing and labor actions, making it suitable for advanced learners or those with specific knowledge of these topics."},"example_sentences":[{"sentence":"The store remained unpicketed despite the ongoing labor dispute.","translation":"継続中の労働争議にもかかわらず、その店はピケを張られていない状態だった。","type":"adjective","meaning_category":"ピケを張られていない"},{"sentence":"An unpicketed gate allowed trucks to continue deliveries to the plant.","translation":"ピケットラインが設けられていないゲートのおかげで、トラックは工場への配送を続けることができた。","type":"adjective","meaning_category":"ピケを張られていない"}]}