{"word":"Bardcraft","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(ファンタジーゲームや創作世界で)吟遊詩人の技、吟遊詩人の仕事、吟遊詩人によって作られたもの、または吟遊詩人に関連するもの。","english_definition":"(In fantasy games or fictional settings) The craft or work of bards; things made or associated with bards.","examples":[{"sentence":"The ancient texts spoke of powerful artifacts created through Bardcraft, imbued with magic through song and story.","translation":"古代の文献には、歌と物語を通して魔法を吹き込まれた、吟遊詩人の技によって創造された強力なアーティファクトについて書かれていた。"},{"sentence":"In the game, players can develop their character's Bardcraft skills to create enchanted instruments and perform powerful spells.","translation":"ゲームでは、プレイヤーはキャラクターの吟遊詩人の技スキルを開発して、魔法がかけられた楽器を作成し、強力な呪文を実行できる。"}],"collocations":["ancient Bardcraft (古代の吟遊詩人の技)","develop Bardcraft skills (吟遊詩人の技スキルを開発する)","practice Bardcraft (吟遊詩人の技を実践する)","Bardcraft artifact (吟遊詩人の技のアーティファクト)"],"synonyms":["lore","art","skill","craftsmanship","magic","enchantment"],"antonyms":[]}],"etymology":{"value":"「bard」（吟遊詩人）と「craft」（技術、仕事）の組み合わせ。ファンタジー創作において比較的新しい造語。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈbɑːrdˌkræft/","syllables":"Bard-craft"},"inflection":{"noun_plural":"Bardcrafts (複数形はあまり一般的ではない)"},"usage_notes":{"explanation":"「Bardcraft」は、主にファンタジー小説、ロールプレイングゲーム（RPG）、特にダンジョンズ＆ドラゴンズ（D&D）のようなゲームに関連する用語です。吟遊詩人（bard）の技能、芸術、魔法的な能力を指すことが多いです。吟遊詩人の歌、物語、詩、音楽を通じて魔法を行使する能力、または吟遊詩人によって作られた魔法のアイテムや芸術作品を指すことがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used Bardcraft to repair the sword.","correct":"✓ He used smithing to repair the sword. / ✓ He used Bardcraft to enchant the sword.","note":"吟遊詩人の技は、一般的に物理的な修理ではなく、魔法やエンチャントに関連付けられています。剣を修理する場合は、鍛冶（smithing）がより適切な用語です。"}],"priority":"★☆☆"},"related_words":{"derivatives":["bard (吟遊詩人)","craft (技術、仕事)","crafting (製作)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (非常に特殊な用語)","frequency_google_ngram":"低頻度 (Low frequency) - ファンタジー関連の文脈でのみ見られる。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「Bardcraft」は、ファンタジーゲームや小説に特有の専門用語です。吟遊詩人（bard）の技術や魔法に関連する概念を指します。この単語を理解するには、吟遊詩人が物語、歌、音楽を通じて魔法を行使する役割を理解している必要があります。一般的な日常語彙ではないため、ファンタジーに慣れていない読者には馴染みがないかもしれません。"},"example_sentences":[{"sentence":"The elven smiths were renowned for their mastery of metalwork, but the bards held secrets of Bardcraft that could imbue weapons with magical power.","translation":"エルフの鍛冶屋は金属加工の熟練で有名でしたが、吟遊詩人は武器に魔法力を吹き込むことができる吟遊詩人の技の秘密を持っていました。","type":"noun","meaning_category":"吟遊詩人の技"},{"sentence":"She spent years studying ancient texts, hoping to unlock the mysteries of lost Bardcraft.","translation":"彼女は何年も古代の文献を研究し、失われた吟遊詩人の技の謎を解き明かそうとしました。","type":"noun","meaning_category":"吟遊詩人の技"}]}