{"word":"mesopause","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"中間圏界面：中間圏と熱圏の間の大気境界層。","english_definition":"The boundary in the Earth's atmosphere between the mesosphere and the thermosphere, typically located at an altitude of about 85 kilometers (53 miles). It is the coldest part of Earth's atmosphere.","examples":[{"sentence":"The mesopause is the coldest region of the Earth's atmosphere.","translation":"中間圏界面は地球大気の中で最も冷たい領域である。"},{"sentence":"Temperatures at the mesopause can reach as low as -100 degrees Celsius.","translation":"中間圏界面の温度は-100℃に達することがある。"}],"collocations":["mesopause temperature","mesopause region","mesopause altitude"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'meso-' (middle) + 'pause' (a break or boundary), referring to its location as the boundary layer in the middle atmosphere.","priority":"★★★"},"pronunciation":{"ipa":"/ˈmɛzoʊˌpɔz/","syllables":"me-so-pause"},"inflection":{"noun_plural":"mesopauses"},"usage_notes":{"explanation":"The mesopause is significant because it marks the upper boundary of the mesosphere and the lower boundary of the thermosphere. It is characterized by extremely low temperatures due to radiative cooling by carbon dioxide. It's an important region for studying atmospheric dynamics and the effects of solar activity.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["mesosphere","thermosphere"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'mesopause' refers to a specific boundary layer in the Earth's atmosphere, situated between the mesosphere and the thermosphere. It is characterized by extremely low temperatures and is a subject of study in atmospheric science. Understanding this term requires knowledge of atmospheric layers and related scientific concepts."},"example_sentences":[{"sentence":"Observations of noctilucent clouds provide information about conditions at the **mesopause**.","translation":"夜光雲の観測は、中間圏界面の状態に関する情報を提供する。","type":"noun","meaning_category":"atmospheric boundary"},{"sentence":"The **mesopause** is a critical region for studying atmospheric gravity waves.","translation":"中間圏界面は、大気重力波を研究するための重要な領域である。","type":"noun","meaning_category":"atmospheric boundary"}]}