{"word":"sideways-gazed","priority":"低","meanings":[{"part_of_speech":"verb (past participle, adjective)","definition":"横目で見た、横を向いて見た","english_definition":"Having looked or glanced to the side; having a sideways gaze. Often implies suspicion, skepticism, or a fleeting glance. Can also describe something positioned or oriented sideways.","examples":[{"sentence":"She sideways-gazed at him, a hint of doubt in her eyes.","translation":"彼女は疑いの色を少し浮かべながら、彼を横目で見た。"},{"sentence":"The picture was sideways-gazed on the wall, needing to be straightened.","translation":"その絵は壁に横向きに掛かっており、まっすぐに直す必要があった。"},{"sentence":"He sideways-gazed at the strange contraption, unsure of its purpose.","translation":"彼はその奇妙な装置を横目で見て、その目的がわからなかった。"}],"collocations":["sideways gaze","sideways glance","sideways look"],"synonyms":["glanced sideways","looked askance","side-eyed","sideways-oriented","askance"],"antonyms":["front-facing","direct gaze","straight ahead"],"notes":"This word is relatively uncommon and often used to describe a specific action or state of being. It is most frequently encountered in descriptive writing."}],"etymology":{"value":"Combination of 'sideways' (adverb/adjective indicating direction to the side) and 'gazed' (past participle of 'gaze', meaning to look steadily and intently).","priority":"低"},"pronunciation":{"ipa":"/ˈsaɪdweɪzˌɡeɪzd/","syllables":"side-ways-gazed"},"inflection":{"verb_forms":{"present_simple":["sideways-gaze"],"past_simple":"sideways-gazed","past_participle":"sideways-gazed","present_participle":"sideways-gazing"}},"usage_notes":{"explanation":"'Sideways-gazed' is typically used to describe the manner in which someone looks at something, implying a lack of directness or a specific emotion. It can also be used adjectivally to describe something that is oriented to the side.","priority":"中"},"level_frequency":{"CEFR":"N/A (uncommon)","frequency_google_ngram":"非常に低い","priority":"低"},"readability_explanation":{"level":"C1","text":"The term 'sideways-gazed' is a relatively uncommon compound word. Its meaning is fairly transparent, combining the concept of 'sideways' with 'gazed.' Understanding requires a good vocabulary and the ability to interpret compound words. It is more often found in literary or descriptive contexts.","priority":"中"},"example_sentences":[{"sentence":"The cat sideways-gazed at the approaching dog, ready to flee.","translation":"猫は近づいてくる犬を横目で見て、逃げる準備をした。","type":"verb","meaning_category":"横目で見る（警戒）"},{"sentence":"The building's design featured a sideways-gazed facade, creating a unique architectural effect.","translation":"その建物のデザインは、横向きのファサードを特徴とし、ユニークな建築効果を生み出していた。","type":"adjective","meaning_category":"横向きの"}]}