{"word":"Dionysiacal","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"ディオニュソス的な、酒神的な、酩酊的な、熱狂的な","english_definition":"Of or relating to Dionysus (Bacchus), the Greek god of wine, fertility, and drama; characterized by or given to revelry, frenzied ecstasy, or lack of restraint.","examples":[{"sentence":"The festival had a Dionysiacal atmosphere, filled with music, dancing, and wine.","translation":"その祭りは音楽、踊り、ワインで満たされ、ディオニュソス的な雰囲気だった。"},{"sentence":"His behavior became increasingly Dionysiacal as the night wore on.","translation":"夜が更けるにつれて、彼の行動はますます酩酊的になった。"},{"sentence":"The play explored the Dionysiacal aspects of human nature, such as passion and irrationality.","translation":"その劇は、情熱や非合理性など、人間性のディオニュソス的な側面を探求した。"}],"collocations":["Dionysiacal rites (ディオニュソス的な儀式)","Dionysiacal frenzy (ディオニュソス的な熱狂)","Dionysiacal spirit (ディオニュソス的な精神)","Dionysiacal festival (ディオニュソス的な祭り)","Dionysiacal art (ディオニュソス的な芸術)"],"synonyms":["Bacchanalian","orgiastic","frenzied","ecstatic","intoxicated","unrestrained","wild","rapturous"],"antonyms":["Apollonian","restrained","sober","rational","disciplined"]}],"etymology":{"value":"Derived from the Greek word 'Dionysos' (Διόνυσος), the name of the god of wine, fertility, theatre, and religious ecstasy. The suffix '-iacal' is added to form an adjective.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdaɪ.əˌnaɪˈeɪ.ə.kəl/","syllables":"Di-o-ny-si-a-cal"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It has comparative and superlative forms, though they are not commonly used: more Dionysiacal, most Dionysiacal."},"usage_notes":{"explanation":"'Dionysiacal' is used to describe things that are associated with Dionysus (or Bacchus in Roman mythology) and his cult. This often involves themes of intoxication, ecstasy, freedom from restraint, and the blurring of boundaries. It is often contrasted with 'Apollonian,' which represents reason, order, and control. The term can be used in a literal sense to describe religious rituals or festivals, or in a more figurative sense to describe art, literature, or behavior that exhibits similar characteristics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The party was very Dionysian.","correct":"✓ The party was very Dionysiacal.","note":"While 'Dionysian' is also a valid adjective derived from 'Dionysus,' 'Dionysiacal' is often preferred when emphasizing the ecstatic or unrestrained aspects associated with the god."},{"incorrect":"✗ He had a Dionysiacal approach to mathematics.","correct":"✓ (Less common, but potentially valid) He had a Dionysiacal approach to life, embracing its chaotic and unpredictable nature.","note":"The term is usually applied to situations involving strong emotions, revelry, or artistic expression. Applying it to something like mathematics might be unusual unless you're emphasizing a highly unconventional or intuitive approach."}],"priority":"★☆☆"},"related_words":{"derivatives":["Dionysian (adjective, noun)","Dionysus (noun)","Bacchic (adjective)","Bacchanal (noun)","Bacchanalia (noun)"],"idioms_phrases":["None commonly associated with this word, but related to the concept of 'carpe diem' (seize the day) and embracing life's pleasures."],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. This is a relatively uncommon word, primarily used in academic or literary contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Dionysiacal' is a sophisticated term used to describe something related to Dionysus, the Greek god of wine, fertility, and theatre. It suggests a state of wildness, ecstasy, and a lack of control. This word is not commonly used in everyday conversation and is more often found in literature, philosophy, or academic discussions when referring to concepts of passion, irrationality, and the blurring of boundaries. It is often contrasted with 'Apollonian,' which represents order and reason. Understanding this word requires familiarity with Greek mythology and its associated themes."},"example_sentences":[{"sentence":"The ancient Greek tragedies often explored the tension between Apollonian reason and Dionysiacal passion.","translation":"古代ギリシャ悲劇は、アポロン的な理性とディオニュソス的な情熱の間の緊張を探求することが多かった。","type":"adjective","meaning_category":"Relating to Dionysus"},{"sentence":"The artist's paintings were characterized by a Dionysiacal energy and vibrant colors.","translation":"その画家の絵画は、ディオニュソス的なエネルギーと鮮やかな色彩を特徴としていた。","type":"adjective","meaning_category":"Characterized by revelry and ecstasy"},{"sentence":"The music evoked a Dionysiacal atmosphere, encouraging the audience to lose themselves in the rhythm.","translation":"その音楽はディオニュソス的な雰囲気を醸し出し、聴衆がリズムに身を任せるように促した。","type":"adjective","meaning_category":"Evoking a sense of unrestrained passion"}]}