{"word":"aerothermodynamic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"空気力学と熱力学を組み合わせた、航空熱力学の","english_definition":"Relating to the combined effects of aerodynamics and thermodynamics, especially concerning the flow of air around objects at high speeds, where temperature changes become significant.","examples":[{"sentence":"The aerothermodynamic analysis of the spacecraft's reentry is crucial for its safe landing.","translation":"宇宙船の大気圏再突入における航空熱力学的解析は、安全な着陸のために非常に重要です。"},{"sentence":"Aerothermodynamic heating poses a significant challenge in the design of hypersonic vehicles.","translation":"航空熱力学的加熱は、極超音速機の設計において重大な課題となります。"}],"collocations":["aerothermodynamic heating (航空熱力学的加熱)","aerothermodynamic analysis (航空熱力学的解析)","aerothermodynamic design (航空熱力学的設計)","aerothermodynamic environment (航空熱力学的環境)"],"synonyms":["None - This term is highly specific."],"antonyms":["None - This term is highly specific."]}],"etymology":{"value":"The word is formed by combining 'aero-' (relating to air or flight), 'thermo-' (relating to heat), and 'dynamic' (relating to forces and motion).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛəroʊˌθɜːrmoʊdaɪˈnæmɪk/","syllables":"a-er-o-ther-mo-dy-nam-ic"},"inflection":{"notes":"Since it is an adjective, it has comparative and superlative forms, but they are rarely used: more aerothermodynamic, most aerothermodynamic."},"usage_notes":{"explanation":"'Aerothermodynamic' is a highly specialized term used in engineering, particularly in the fields of aerospace and mechanical engineering. It describes the study and application of principles that combine aerodynamics (the study of air flow) and thermodynamics (the study of heat and energy). This is especially important in situations where objects are moving through the air at very high speeds, such as spacecraft re-entering the atmosphere or hypersonic aircraft, because the friction with the air generates significant heat.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ aerothermodynamics (using the plural form as an adjective)","correct":"✓ aerothermodynamic (using the singular adjective form)","note":"'Aerothermodynamics' is a noun referring to the field of study itself. 'Aerothermodynamic' is the adjective used to describe something related to that field."}],"priority":"★★☆"},"related_words":{"derivatives":["aerothermodynamics (noun: 航空熱力学)"],"phrasal_verbs":["None - This is a highly technical term."],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (Highly specialized vocabulary)","frequency_google_ngram":"Very low frequency - Used primarily in technical and scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'aerothermodynamic' is a technical adjective describing the combined effects of aerodynamics (how air moves around objects) and thermodynamics (how heat and energy interact). It's mainly used when discussing things moving very fast through the air, like spacecraft or high-speed planes, where the air friction creates a lot of heat. Understanding this term requires some background knowledge in physics and engineering.","priority":"★★☆"},"example_sentences":[{"sentence":"The aerothermodynamic effects on the space shuttle during reentry are extremely complex.","translation":"スペースシャトルの大気圏再突入時の航空熱力学的影響は非常に複雑です。","type":"general","meaning_category":"General"},{"sentence":"Researchers are developing new materials to withstand the intense aerothermodynamic heating of hypersonic flight.","translation":"研究者たちは、極超音速飛行の激しい航空熱力学的加熱に耐える新しい材料を開発しています。","type":"technical","meaning_category":"Technical"}]}