{"word":"hemolymph","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"血リンパ (昆虫や軟体動物などの開放血管系を持つ生物に見られる体液。血液とリンパ液の機能を兼ね備える)","english_definition":"A fluid in arthropods and mollusks that is analogous to the blood in vertebrates. It is a circulatory fluid that carries nutrients and waste products and also functions in immunity.","examples":[{"sentence":"The hemolymph of insects transports nutrients throughout the body.","translation":"昆虫の血リンパは、栄養分を体全体に運びます。"},{"sentence":"Hemolymph plays a crucial role in the immune response of many invertebrates.","translation":"血リンパは、多くの無脊椎動物の免疫反応において重要な役割を果たします。"}],"collocations":["hemolymph composition (血リンパ組成)","hemolymph protein (血リンパタンパク質)","hemolymph analysis (血リンパ分析)","hemolymph pressure (血リンパ圧)"],"synonyms":["insect blood","invertebrate blood"],"antonyms":["blood (vertebrate)","lymph (vertebrate)"]}],"etymology":{"value":"Derived from the Greek words 'haimo-' (blood) and 'lymph' (clear fluid).","priority":"★★★"},"pronunciation":{"ipa":"/ˈhiːməˌlɪmf/","syllables":"he-mo-lymph"},"inflection":{"noun_plural":"hemolymphs (less common, usually used as a mass noun)"},"usage_notes":{"explanation":"Hemolymph is a term specific to invertebrates with open circulatory systems. It's not the same as blood in vertebrates, which has a closed circulatory system. Hemolymph directly bathes the organs and tissues.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Hemolymph is found in mammals.","correct":"✓ Hemolymph is found in insects and mollusks.","note":"Hemolymph is specific to invertebrates, not mammals."},{"incorrect":"✗ Hemolymph is the same as blood in humans.","correct":"✓ Hemolymph is analogous to blood in vertebrates but has different functions and composition.","note":"While analogous, hemolymph and vertebrate blood are not identical."}],"priority":"★★☆"},"related_words":{"derivatives":["hemocoel (血体腔)"],"phrases":["open circulatory system"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hemolymph' is a scientific term used in biology, specifically when discussing the circulatory systems of certain invertebrates like insects and mollusks. It refers to a fluid that performs functions similar to both blood and lymph in vertebrates. This term is typically encountered in advanced biology courses or scientific literature.","priority":"★★☆"},"example_sentences":[{"sentence":"The composition of hemolymph varies depending on the species.","translation":"血リンパの組成は、種によって異なります。","type":"general","meaning_category":"composition"},{"sentence":"Researchers analyzed the hemolymph of the insects to study their immune responses.","translation":"研究者たちは、昆虫の免疫反応を研究するために血リンパを分析しました。","type":"research","meaning_category":"analysis"},{"sentence":"Hemolymph transports oxygen and nutrients in the open circulatory system of the snail.","translation":"血リンパは、カタツムリの開放血管系で酸素と栄養分を運びます。","type":"function","meaning_category":"transport"}]}