{"word":"earthily","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"土のように、土の性質をもって","english_definition":"In a manner resembling earth; with the qualities of earth.","examples":[{"sentence":"The wine tasted earthily, with hints of minerals and soil.","translation":"そのワインは土のような味がし、ミネラルと土壌の香りがかすかに感じられた。"},{"sentence":"The potter shaped the clay earthily, feeling its texture and weight.","translation":"陶芸家は粘土の質感と重さを感じながら、土の性質を生かして形作った。"}],"collocations":[],"synonyms":["naturally","plainly","simply","genuinely"],"antonyms":["artificially","falsely"]},{"part_of_speech":"adverb","definition":"率直に、飾り気なく、世俗的に","english_definition":"In a frank, unrefined, or worldly manner; without pretense or delicacy.","examples":[{"sentence":"He spoke earthily about his experiences, not holding back any details.","translation":"彼は自分の経験について率直に語り、どんな細部も隠さなかった。"},{"sentence":"The comedian's jokes were earthily humorous, appealing to a wide audience.","translation":"そのコメディアンのジョークは世俗的なユーモアがあり、幅広い観客にアピールした。"}],"collocations":[],"synonyms":["frankly","openly","crudely","coarsely","vulgarity"],"antonyms":["delicately","refinedly","prudishly"]}],"etymology":{"value":"Derived from the adjective 'earthly' (relating to the earth or worldly matters) with the addition of the suffix '-ly' to form an adverb.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɜːrθɪli/","syllables":"erth-i-ly"},"inflection":{},"usage_notes":{"explanation":"The adverb 'earthily' has two main senses: one relating to the literal qualities of earth (soil, minerals, etc.) and the other relating to frank, unrefined, or worldly behavior or speech. The first sense is often used to describe flavors, scents, or textures that evoke the earth. The second sense is used to describe someone's manner or expression as being straightforward, unpretentious, and sometimes even a bit crude or vulgar.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The painting was earthily beautiful.","correct":"The painting had an earthy beauty.","note":"'Earthily' is an adverb, so it modifies verbs, adjectives, or other adverbs. To describe a noun (like 'beauty'), use the adjective 'earthy'."}],"priority":"★★★"},"related_words":{"derivatives":["earth","earthy","earthliness"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Earthily' is an uncommon word. It can mean 'in a way that reminds you of earth or soil' or 'in a direct and honest way, sometimes in a way that might offend some people.' Because it is rare, it's best to use it when you want to be very precise and you're sure your audience will understand."},"example_sentences":[{"sentence":"The aroma of the truffles filled the room, smelling earthily of the forest floor.","translation":"トリュフの香りが部屋中に広がり、森の地面のような土の香りがした。","type":"adverb","meaning_category":"土のように"},{"sentence":"He described the political situation earthily, using vivid and sometimes shocking language.","translation":"彼は政治状況を率直に描写し、鮮やかで時には衝撃的な言葉を使った。","type":"adverb","meaning_category":"率直に"}]}