{"word":"courtlike","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"宮廷のような、宮廷風の、上品な","english_definition":"Resembling or befitting a royal court; refined or elegant.","examples":[{"sentence":"The ambassador's manners were courtlike, reflecting years of diplomatic training.","translation":"大使の物腰は宮廷のようであり、長年の外交訓練を反映していた。"},{"sentence":"The ballroom was decorated in a courtlike style, with opulent chandeliers and velvet drapes.","translation":"舞踏室は宮廷風に装飾され、豪華なシャンデリアとベルベットのドレープが飾られていた。"},{"sentence":"The ceremony had a courtlike atmosphere, filled with formality and tradition.","translation":"式典は宮廷のような雰囲気で、形式と伝統に満ちていた。"}],"collocations":["courtlike manners (宮廷のような物腰)","courtlike atmosphere (宮廷のような雰囲気)","courtlike elegance (宮廷のような優雅さ)","courtlike behavior (宮廷のような振る舞い)"],"synonyms":["refined","elegant","polished","graceful","stately","regal","ceremonious","formal"],"antonyms":["boorish","crude","uncouth","rustic","informal"]}],"etymology":{"value":"'court' + '-like'. 'Court' refers to a royal court or the residence of a sovereign. '-like' is a suffix indicating resemblance or similarity.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɔːrtˌlaɪk/","syllables":"court-like"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have different forms for gender or number."},"usage_notes":{"explanation":"'Courtlike' is used to describe something that has the qualities or characteristics of a royal court, such as elegance, formality, and refinement. It suggests a high degree of sophistication and adherence to tradition. It is often used to describe manners, atmosphere, or style.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The party was very courtlike and casual.","correct":"✓ The party was courtlike but not casual.","note":"'Courtlike' implies formality, so it is contradictory to describe something as both 'courtlike' and 'casual'."}],"priority":"★★☆"},"related_words":{"derivatives":["court (noun)","courtly (adjective)","courtliness (noun)"],"related_concepts":["royalty","nobility","etiquette","protocol","diplomacy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'courtlike' is a relatively uncommon adjective used to describe something that resembles or is befitting of a royal court. It implies a high degree of formality, elegance, and refinement, often associated with the traditions and customs of a royal court. Understanding the meaning of 'court' (royal residence or assembly) is essential to grasp the meaning of 'courtlike'. This word is more likely to be encountered in literature, historical texts, or formal settings."},"example_sentences":[{"sentence":"The opera house was designed with a courtlike grandeur, reminiscent of the palaces of Europe.","translation":"そのオペラハウスは、ヨーロッパの宮殿を彷彿とさせる、宮廷のような壮大さで設計されていた。","type":"adjective","meaning_category":"resembling a royal court"},{"sentence":"His courtlike demeanor impressed everyone at the formal dinner.","translation":"彼の宮廷のような物腰は、フォーマルな夕食会で皆を感心させた。","type":"adjective","meaning_category":"refined manners"},{"sentence":"The dancers moved with courtlike grace, their movements precise and elegant.","translation":"ダンサーたちは宮廷のような優雅さで動き、その動きは正確で優雅だった。","type":"adjective","meaning_category":"elegant style"}]}