{"word":"emunctory","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"排泄器官、排泄腺","english_definition":"A duct or gland that serves as an outlet for excrementitious matter.","examples":[{"sentence":"The kidneys are important emunctories of the body.","translation":"腎臓は体の重要な排泄器官です。"},{"sentence":"Sweat glands are emunctories that help regulate body temperature.","translation":"汗腺は体温調節を助ける排泄腺です。"}],"collocations":["renal emunctory","cutaneous emunctory"],"synonyms":["excretory organ","excretory gland","outlet","duct"],"antonyms":[]}],"etymology":{"value":"From Latin ēmūnctōrium, from ēmūngere (\"to wipe away, clean out\"), from ex- + mūngere (\"to blow the nose, clean\").","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈmʌŋktəri/","syllables":"e-munc-to-ry"},"inflection":{"noun_plural":"emunctories"},"usage_notes":{"explanation":"'Emunctory' refers specifically to organs or glands involved in the elimination of waste products from the body. It is a formal and somewhat technical term, not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The liver is a digestive emunctory.","correct":"The liver is a digestive organ.","note":"The liver is primarily a digestive organ, not an emunctory, although it does contribute to detoxification processes. Emunctories are directly involved in waste elimination."}],"priority":"★☆☆"},"related_words":{"derivatives":["emunction (noun: the act of cleaning or purging)"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Emunctory' is a highly specialized term used in medical and biological contexts to describe organs or glands responsible for excreting waste. Its usage is rare outside of these specific fields, making it a word primarily encountered by those with advanced knowledge in related disciplines."},"example_sentences":[{"sentence":"The skin acts as an emunctory, eliminating toxins through sweat.","translation":"皮膚は汗を通して毒素を排出する排泄器官として機能します。","type":"noun","meaning_category":"排泄器官"},{"sentence":"Proper function of the emunctories is essential for maintaining overall health.","translation":"排泄器官の適切な機能は、全体的な健康を維持するために不可欠です。","type":"noun","meaning_category":"排泄器官"}]}