{"word":"formicoid","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"アリに似た、アリのような","english_definition":"Resembling ants; ant-like.","examples":[{"sentence":"The creature had a formicoid appearance, with a segmented body and prominent mandibles.","translation":"その生き物は、分節された体と目立つ大顎を持つ、アリのような外見をしていた。"}],"collocations":[],"synonyms":["ant-like","myrmecoid"],"antonyms":[]},{"part_of_speech":"noun","definition":"アリに似たもの、アリのような生き物","english_definition":"Something resembling an ant.","examples":[{"sentence":"The science fiction story featured formicoids as the dominant species on a distant planet.","translation":"そのSF小説では、アリのような生物が遠い惑星の支配的な種として登場した。"}],"collocations":[],"synonyms":["ant-like creature"],"antonyms":[]}],"etymology":{"value":"Derived from Latin 'formica' (ant) + '-oid' (resembling).","priority":"★★★"},"pronunciation":{"ipa":"/fɔːrˈmɪkɔɪd/","syllables":"for-mi-coid"},"inflection":{},"usage_notes":{"explanation":"'Formicoid' is a relatively uncommon word, primarily used in scientific or science fiction contexts to describe something that resembles or is related to ants. It can be used as an adjective to describe appearance or characteristics, or as a noun to refer to a creature or object that is ant-like.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["formic (adjective: relating to ants or formic acid)","formic acid (noun: a colorless, pungent acid found in ants)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'formicoid' is a specialized term, primarily found in scientific or speculative fiction contexts. It describes something that resembles or is related to ants. Understanding this word requires familiarity with scientific terminology and the ability to recognize Latin-derived roots. Its usage is rare in everyday conversation."},"example_sentences":[{"sentence":"The fossil showed a previously unknown formicoid species.","translation":"その化石は、これまで知られていなかったアリに似た種を示していた。","type":"noun","meaning_category":"アリのような生き物"},{"sentence":"The robot had a formicoid design, optimized for navigating complex tunnels.","translation":"そのロボットは、複雑なトンネルを移動するために最適化された、アリのような設計をしていた。","type":"adjective","meaning_category":"アリに似た"}]}