{"word":"Sur","priority":"N/A","meanings":[{"part_of_speech":"proper noun","definition":"A region in California known for its rugged coastline.","english_definition":"A region in California known for its rugged coastline, scenic beauty, and state parks.","examples":[{"sentence":"We drove down Highway 1 through Big Sur.","translation":"私たちはビッグサーを通ってハイウェイ1を南下しました。"},{"sentence":"Big Sur is a popular destination for camping and hiking.","translation":"ビッグサーはキャンプやハイキングに人気の場所です。"}],"collocations":["Big Sur","driving through Sur","visiting Sur"],"synonyms":["Big Sur Coast","California Coast"],"antonyms":[]}],"etymology":{"value":"The name \"Sur\" is derived from the Spanish word \"el sur,\" meaning \"the south.\" It refers to its location south of Monterey.","priority":"★★☆"},"pronunciation":{"ipa":"/sɜr/","syllables":"Sur"},"inflection":{},"usage_notes":{"explanation":"\"Sur\" is almost always used in the context of \"Big Sur,\" referring to the specific region in California. It's known for its dramatic cliffs, redwood forests, and iconic Bixby Bridge.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I live in Sur.","correct":"✓ I live near Big Sur.","note":"It's more common to say you live \"near Big Sur\" rather than \"in Sur\"."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency, primarily in travel-related content.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"\"Sur,\" specifically \"Big Sur,\" is a place name. It refers to a scenic coastal region in California. If you see the word \"Sur,\" it almost always means \"Big Sur.\" It's a popular tourist destination, so you might encounter it in travel guides or articles about California.","priority":"★★★"},"example_sentences":[{"sentence":"The views from Big Sur are breathtaking.","translation":"ビッグサーからの眺めは息をのむほど美しいです。","type":"proper noun","meaning_category":"Region in California"},{"sentence":"We hiked along the trails in Big Sur.","translation":"私たちはビッグサーのトレイル沿いをハイキングしました。","type":"proper noun","meaning_category":"Region in California"}]}