{"word":"Dharma","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ダルマ、法、仏法、真理、宇宙の法則、義務、道徳、正義、本質、性質、教え、宗教、現象","english_definition":"In Hinduism, Buddhism, Jainism, and Sikhism, dharma has multiple meanings; it is the principle or law that orders the universe, the teachings and doctrines of these religions, righteousness, duty, moral law, justice, essential quality or nature, religion, phenomenon.","examples":[{"sentence":"Following one's dharma is essential for spiritual growth.","translation":"自身のダルマに従うことは精神的な成長に不可欠です。"},{"sentence":"The Buddha's teachings are known as the Dharma.","translation":"仏陀の教えはダルマとして知られています。"},{"sentence":"Each individual has their own unique dharma to fulfill.","translation":"各個人は果たすべき独自のダルマを持っています。"},{"sentence":"Living in accordance with dharma brings harmony and balance.","translation":"ダルマに従って生きることは調和とバランスをもたらします。"}],"collocations":["follow one's dharma (自身のダルマに従う)","the Buddha's Dharma (仏陀のダルマ)","live in accordance with dharma (ダルマに従って生きる)","eternal dharma (永遠のダルマ)","universal dharma (普遍的なダルマ)","personal dharma (個人のダルマ)"],"synonyms":["righteousness","duty","moral law","justice","truth","teaching","doctrine","nature","essence","principle","law","religion","phenomenon"],"antonyms":["adharma (不正、不道徳)"]},{"part_of_speech":"noun","definition":"（日本の玩具）だるま","english_definition":"A Japanese traditional doll modeled after Bodhidharma, the founder of Zen Buddhism.","examples":[{"sentence":"I bought a Dharma doll for good luck.","translation":"幸運を祈願してだるまを買いました。"},{"sentence":"You paint one eye on the Dharma doll when you make a wish.","translation":"願い事をする時にだるまの片目を描きます。"},{"sentence":"When the wish comes true, you paint the other eye on the Dharma doll.","translation":"願いが叶ったら、だるまのもう片方の目を描きます。"}],"collocations":["Dharma doll (だるま)","paint one eye on a Dharma doll (だるまに片目を描く)","make a wish on a Dharma doll (だるまに願い事をする)","red Dharma doll (赤いだるま)","lucky Dharma doll (縁起の良いだるま)"],"synonyms":["だるま (daruma)"],"antonyms":[]}],"etymology":{"value":"Sanskrit word \"dharma\" (धर्म) meaning \"that which is established or firm,\" related to the root \"dhri\" (to hold, maintain). It refers to the cosmic law, moral order, and the principles of righteousness.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɑːrmə/","syllables":"Dar-ma"},"inflection":{"noun_plural":"dharmas"},"usage_notes":{"explanation":"\"**Dharma**\" is a complex term with multiple layers of meaning depending on the context. In religious and philosophical contexts, it refers to the underlying order of the universe, the teachings of Buddhism, Hinduism, Jainism, and Sikhism, and one's personal duty or path in life. In a more general sense, it can refer to righteousness, morality, and justice. In Japan, \"Dharma\" also refers to a specific type of doll, which is a good luck charm.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am following my karma.","correct":"✓ I am following my dharma.","note":"\"Karma\" refers to the consequences of one's actions, while \"dharma\" refers to one's duty or path in life. They are related but distinct concepts."},{"incorrect":"✗ Dharma is only a Buddhist concept.","correct":"✓ Dharma is a concept found in Hinduism, Buddhism, Jainism, and Sikhism.","note":"While dharma is central to Buddhism, it is also a significant concept in other Indian religions."}],"priority":"★★☆"},"related_words":{"derivatives":["dharmic (adjective: relating to dharma)","dharmakaya (noun: the body of the Dharma, one of the three bodies of the Buddha)","dharmachakra (noun: the wheel of Dharma, a symbol of Buddhism)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1 (for philosophical and religious contexts)","frequency_google_ngram":"Relatively low frequency in general English, but common in religious and philosophical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"**Dharma**\" is a complex term with a rich history and multiple layers of meaning. It is primarily used in the context of Hinduism, Buddhism, Jainism, and Sikhism, where it refers to the underlying order of the universe, the teachings of these religions, and one's personal duty or path in life. Understanding the concept of dharma requires familiarity with these religious and philosophical traditions. In a more general sense, it can refer to righteousness, morality, and justice. It is important to note that the meaning of dharma can vary depending on the specific context in which it is used. In Japan, it also refers to a specific type of doll, which is a good luck charm.","priority":"★☆☆"},"example_sentences":[{"sentence":"Understanding **dharma** is key to understanding Buddhist philosophy.","translation":"ダルマを理解することは仏教哲学を理解する鍵です。","type":"noun","meaning_category":"Buddhist teaching"},{"sentence":"It is important to live according to one's **dharma**.","translation":"自分のダルマに従って生きることが重要です。","type":"noun","meaning_category":"duty, moral law"},{"sentence":"The **Dharma** doll is a symbol of perseverance.","translation":"だるまは忍耐の象徴です。","type":"noun","meaning_category":"Japanese doll"},{"sentence":"His actions were not in accordance with **dharma**.","translation":"彼の行動はダルマに沿っていませんでした。","type":"noun","meaning_category":"righteousness, justice"}]}