{"word":"sectility","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"The quality of being easily cut; cuttability.","english_definition":"The quality or state of being sectile; the capability of being cut smoothly.","examples":[{"sentence":"Gold possesses high sectility, allowing it to be hammered into thin sheets.","translation":"金は高い展延性を持つため、薄いシートに打ち延ばすことができる。"},{"sentence":"The sectility of the material made it easy to work with.","translation":"その材料は切断しやすかったので、加工が容易だった。"}],"collocations":["high sectility","low sectility","degree of sectility","possess sectility","demonstrate sectility"],"synonyms":["cuttability","malleability","ductility","workability"],"antonyms":["brittleness","hardness","inflexibility"]}],"etymology":{"value":"From Latin 'sectilis' (that may be cut), from 'secare' (to cut).","priority":"★★☆"},"pronunciation":{"ipa":"/sɛkˈtɪlɪti/","syllables":"sec-til-i-ty"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Sectility' is a relatively uncommon word that describes how easily a material can be cut smoothly, without shattering or crumbling. It is often used in the context of metals and minerals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sectility of the diamond made it easy to cut.","correct":"✓ The hardness of the diamond made it difficult to cut.","note":"Diamonds are known for their hardness, not sectility. Sectility implies ease of cutting, which is the opposite of what diamonds exhibit."}],"priority":"★☆☆"},"related_words":{"derivatives":["sectile (adjective: capable of being cut smoothly)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Sectility' is a technical term not commonly used in everyday language. It is mostly found in scientific or technical contexts, especially when discussing the properties of materials. Understanding this word requires a good grasp of scientific vocabulary."},"example_sentences":[{"sentence":"The mineral's sectility was tested by attempting to shave off thin slices with a knife.","translation":"その鉱物の展延性は、ナイフで薄く削り取ろうとすることで試験された。","type":"noun","meaning_category":"cuttability"},{"sentence":"Due to its high sectility, the metal is often used in intricate decorative work.","translation":"その金属は高い展延性を持つため、複雑な装飾細工によく使用される。","type":"noun","meaning_category":"cuttability"}]}