{"word":"nonassonance","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"非類似音、非類似音韻","english_definition":"The lack of assonance; the absence of similarity in the sounds of words or syllables.","examples":[{"sentence":"The poem suffered from nonassonance, making it sound disjointed.","translation":"その詩は非類似音韻のために、まとまりのない響きになっていた。"},{"sentence":"The use of nonassonance created a deliberate sense of disharmony in the song.","translation":"非類似音韻の使用は、その歌に意図的な不協和音の感覚を生み出した。"}],"collocations":["lack of assonance","absence of assonance","avoidance of assonance"],"synonyms":["dissonance","discordance","inharmony"],"antonyms":["assonance","consonance","harmony"]}],"etymology":{"value":"\"non-\" (not) + \"assonance\" (resemblance of sounds).","priority":"★★★"},"pronunciation":{"ipa":"/nɒnˈæsənəns/","syllables":"non-as-o-nance"},"inflection":{"noun_plural":"nonassonances"},"usage_notes":{"explanation":"\"Nonassonance\" is the opposite of assonance. It refers to the lack of similar vowel sounds within words or phrases. It is used to create a sense of disharmony or to avoid a sing-song effect.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The poem was full of nonassonance, making it very melodic.","correct":"The poem was full of assonance, making it very melodic.","note":"Nonassonance is the lack of melodic sound due to dissimilar vowel sounds. Assonance is the repetition of vowel sounds, contributing to a melodic quality."}],"priority":"★★☆"},"related_words":{"derivatives":["nonassonant (adjective)"],"related_terms":["alliteration","consonance","dissonance","cacophony"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"nonassonance\" is a technical term used in literary analysis, specifically in the study of poetry and sound devices. It describes the absence of similar vowel sounds in words or syllables, which is the opposite of assonance. This term is not commonly used in everyday language and is primarily encountered in academic or critical discussions of literature."},"example_sentences":[{"sentence":"The author employed nonassonance to disrupt the rhythm of the verse.","translation":"作者は、詩のリズムを崩すために非類似音韻を使用した。","type":"general"},{"sentence":"The effect of nonassonance in the passage is a feeling of unease.","translation":"その一節における非類似音韻の効果は、不安感である。","type":"general"}]}