{"word":"Convertism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"The practice or belief in converting or being converted, especially to a religion.","english_definition":"The practice or belief in converting or being converted, especially to a religion.","examples":[{"sentence":"Convertism played a significant role in the spread of Christianity throughout the Roman Empire.","translation":"改宗主義は、ローマ帝国全体へのキリスト教の普及において重要な役割を果たしました。"},{"sentence":"Some critics argue that convertism can sometimes lead to cultural insensitivity.","translation":"一部の批評家は、改宗主義が文化的な鈍感さにつながることがあると主張しています。"}],"collocations":["religious convertism","proselytizing convertism","aggressive convertism","historical convertism"],"synonyms":["proselytism","evangelism","conversionism"],"antonyms":["religious tolerance","secularism"]}],"etymology":{"value":"Derived from 'convert' (to change one's beliefs) with the suffix '-ism' (denoting a practice, belief, or ideology).","priority":"★★☆"},"pronunciation":{"ipa":"/kənˈvɜːrtɪzəm/","syllables":"con-vert-ism"},"inflection":{"noun_plural":"Convertisms"},"usage_notes":{"explanation":"'Convertism' generally refers to the active practice or advocacy of conversion, particularly in a religious context. It can sometimes carry a negative connotation when associated with forceful or manipulative conversion tactics. It is closely related to 'proselytism' and 'evangelism,' but may also encompass broader forms of ideological conversion.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Convertism is always a positive thing.","correct":"✓ Convertism can have both positive and negative consequences, depending on the context and methods used.","note":"Avoid making generalizations about convertism without considering the specific circumstances and ethical implications."}],"priority":"★☆☆"},"related_words":{"derivatives":["convert","conversion","convertite","convertibility"],"related_concepts":["proselytization","evangelization","missionary work","religious conversion"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Convertism' is a relatively uncommon term referring to the practice or belief in converting individuals to a particular religion or ideology. It is often discussed in the context of religious studies, history, and sociology. Understanding the term involves recognizing its connection to concepts like proselytism and evangelism, as well as its potential ethical implications."},"example_sentences":[{"sentence":"The history of convertism in the region is complex and marked by both peaceful persuasion and forced assimilation.","translation":"その地域における改宗主義の歴史は複雑であり、平和的な説得と強制的な同化の両方によって特徴付けられています。","type":"noun","meaning_category":"practice of converting"},{"sentence":"Critics of aggressive convertism argue that it disregards the autonomy and cultural heritage of targeted communities.","translation":"攻撃的な改宗主義の批評家は、それが標的コミュニティの自律性と文化的遺産を無視していると主張しています。","type":"noun","meaning_category":"belief in converting"}]}