{"word":"nomenclatory","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"命名に関する、命名法の","english_definition":"relating to or of the nature of nomenclature.","examples":[{"sentence":"The nomenclatory rules are quite strict in botany.","translation":"植物学における命名法の規則は非常に厳格である。"},{"sentence":"A nomenclatory committee was established to standardize the naming of new species.","translation":"新種の命名を標準化するために、命名委員会が設立された。"}],"collocations":["nomenclatory system","nomenclatory rules","nomenclatory committee"],"synonyms":["taxonomic","classificatory"],"antonyms":[],"notes":"主に科学、特に生物学の分野で使用される。"}],"etymology":{"value":"nomenclator + -y","priority":"★★☆"},"pronunciation":{"ipa":"/nəˈmɛŋkləˌtɔːri/","syllables":"no-men-cla-to-ry"},"inflection":{},"usage_notes":{"explanation":"'Nomenclatory' is an adjective that describes something related to or having the character of nomenclature, which is the system of naming things, especially in science. It is often used in the context of biology, chemistry, and other scientific fields where a standardized naming system is crucial for clarity and consistency.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["nomenclature"],"phrases":[]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The word 'nomenclatory' is a specialized term primarily used in scientific contexts. It refers to anything related to the system of nomenclature, which is the standardized naming convention used in fields like biology and chemistry. Due to its specific and technical usage, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The paper discusses the nomenclatory issues related to the newly discovered genus.","translation":"その論文では、新しく発見された属に関連する命名法の問題について議論している。","type":"general","meaning_category":"命名に関する"},{"sentence":"Adherence to strict nomenclatory conventions is essential for avoiding confusion in scientific literature.","translation":"科学文献における混乱を避けるためには、厳格な命名法の規則を遵守することが不可欠である。","type":"general","meaning_category":"命名法の"}]}