{"word":"pidgizing","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"intransitive","definition":"ピジン化する、ピジン言語が形成される","english_definition":"The process of a language becoming a pidgin, typically through contact between speakers of different languages who need to communicate.","examples":[{"sentence":"The language started pidgizing as traders from different countries began interacting.","translation":"その言語は、様々な国からの商人が交流し始めたときにピジン化し始めた。"},{"sentence":"Pidgizing often occurs in multilingual environments where a common language is needed for basic communication.","translation":"ピジン化は、基本的なコミュニケーションに必要な共通言語が求められる多言語環境でよく起こる。"}],"collocations":["language pidgizing","the process of pidgizing"],"synonyms":["creolization (related, but distinct)","simplification","language contact"],"antonyms":["standardization","language preservation"]},{"part_of_speech":"verb","transitivity":"transitive","definition":"ピジン化する、ピジン言語に変える","english_definition":"To simplify a language and reduce its grammatical complexity, typically as a result of language contact.","examples":[{"sentence":"The colonizers began pidgizing the local language to make it easier for them to understand and use.","translation":"植民地支配者たちは、自分たちが理解しやすく使いやすくするために、現地の言語をピジン化し始めた。"},{"sentence":"Some linguists argue that attempts to create a global language may result in pidgizing existing languages.","translation":"一部の言語学者は、グローバル言語を作ろうとする試みが既存の言語をピジン化する可能性があると主張している。"}],"collocations":["pidgizing a language","pidgizing the grammar"],"synonyms":["simplifying","reducing","decomplexifying"],"antonyms":["complexifying","elaborating","enriching"]}],"etymology":{"value":"Derived from 'pidgin', referring to a simplified language that arises from contact between two or more languages. The '-izing' suffix indicates the process of becoming a pidgin.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɪdʒɪnaɪzɪŋ/","syllables":"pid-gin-iz-ing"},"inflection":{"verb_forms":{"present_simple":["pidgizes"],"past_simple":"pidgized","past_participle":"pidgized","present_participle":"pidgizing"}},"usage_notes":{"explanation":"'Pidgizing' refers to the dynamic process where a language simplifies in structure and vocabulary due to contact between different language speakers. This often happens when people who don't share a common language need to communicate, such as in trade or colonial contexts. The resulting pidgin language serves as a bridge for basic communication, but it's not typically anyone's native language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The language is pidginizing very fastly.","correct":"✓ The language is pidginizing very quickly.","note":"'Quickly' is the correct adverb to use, not 'fastly'."},{"incorrect":"✗ Pidgizing is when a language becomes more complex.","correct":"✓ Pidgizing is when a language becomes simpler.","note":"Pidgizing involves simplification, not increased complexity."}],"priority":"★★☆"},"related_words":{"derivatives":["pidgin (noun)","pidginization (noun)"],"related_terms":["creole","lingua franca","language contact","simplification"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pidgizing' is a term used in linguistics to describe the process of a language becoming a pidgin. This happens when speakers of different languages need to communicate and simplify their languages to create a common means of communication. It's a specialized term, so you'll typically encounter it in academic or linguistic contexts."},"example_sentences":[{"sentence":"The rapid globalization of business has led to some languages pidgizing in specific industries.","translation":"ビジネスの急速なグローバル化は、特定の業界でいくつかの言語がピジン化する原因となっている。","type":"verb","meaning_category":"language change"},{"sentence":"Researchers are studying the pidgizing of English in online communication.","translation":"研究者たちは、オンラインコミュニケーションにおける英語のピジン化を研究している。","type":"verb","meaning_category":"language evolution"}]}