{"word":"Epispadia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"尿道上裂：男性では尿道が陰茎の背側に開口し、女性では尿道が陰核または恥骨結合に開口する先天異常","english_definition":"A rare birth defect in which the urethra does not develop into a full tube. In males, the urethra opens on the top or side of the penis instead of the tip. In females, the urethra opens in the area of the clitoris or even in the abdomen.","examples":[{"sentence":"Epispadia is often associated with bladder exstrophy.","translation":"尿道上裂はしばしば膀胱外反症と関連しています。"},{"sentence":"Surgical correction is usually required for epispadia.","translation":"尿道上裂の外科的矯正は通常必要です。"}],"collocations":["bladder exstrophy","surgical correction","penile epispadia","clitoral epispadia"],"synonyms":["urethral ectopia"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の 'epi' (上に) + 'spadon' (裂け目、切り傷) に由来","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛpɪˈspeɪdiə/","syllables":"ep-i-spa-di-a"},"inflection":{"noun_plural":"epispadia (変化しない)"},"usage_notes":{"explanation":"Epispadiaは、尿道の形成不全によって起こる比較的まれな先天異常です。男性では陰茎の背側に、女性では陰核または恥骨結合に尿道口が開きます。重症度によって症状や治療法が異なります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Epispadia is when the urethra opens on the bottom of the penis.","correct":"✓ Epispadia is when the urethra opens on the top of the penis.","note":"尿道上裂は尿道が陰茎の背側（上側）に開口する状態です。尿道が陰茎の腹側（下側）に開口する場合は尿道下裂（hypospadias）といいます。"}],"priority":"★★☆"},"related_words":{"derivatives":["epispadic (形容詞)"],"phrasal_verbs":[],"related_medical_terms":["hypospadias (尿道下裂)","bladder exstrophy (膀胱外反症)","cloacal exstrophy (泄殖腔外反症)"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Epispadia is a complex medical term referring to a rare congenital defect involving the abnormal placement of the urethral opening. Understanding this term requires a familiarity with medical terminology and human anatomy. It is primarily used in medical contexts and is not commonly encountered in general conversation."},"example_sentences":[{"sentence":"The newborn was diagnosed with epispadia shortly after birth.","translation":"その新生児は出生直後に尿道上裂と診断されました。","type":"noun","meaning_category":"先天異常"},{"sentence":"Surgical intervention is often necessary to correct epispadia and restore normal urinary function.","translation":"尿道上裂を矯正し、正常な排尿機能を回復するためには、外科的介入が必要となることが多い。","type":"noun","meaning_category":"先天異常"}]}