{"word":"Chorizontist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(聖書学) ホメロス著のイリアスとオデュッセイアが単一の作者によって書かれたものではないと主張する学者","english_definition":"(Biblical studies) A scholar who argues that the Iliad and the Odyssey were not written by a single author.","examples":[{"sentence":"The chorizontists of the 19th century debated the authorship of the Homeric epics.","translation":"19世紀の分離主義者たちは、ホメロス叙事詩の作者について議論した。"}],"collocations":[],"synonyms":["separatist","analyst"],"antonyms":["Unitarian","Homerist"]}],"etymology":{"value":"From Ancient Greek χωρίζω (khōrízō, \"I separate\") + -ιστής (-istḗs, \"-ist\").","priority":"★★★"},"pronunciation":{"ipa":"/kəˈraɪzənˌtɪst/","syllables":"cho-ri-zon-tist"},"inflection":{"noun_plural":"Chorizontists"},"usage_notes":{"explanation":"The term 'Chorizontist' is primarily used within classical studies and Homeric scholarship. It refers to those who believe that the Iliad and the Odyssey have different authors. The opposite view is held by 'Unitarians' or 'Homerists', who believe in a single author.","priority":"★★☆"},"related_words":{"derivatives":["Chorizontism (noun: The theory or belief that the Iliad and the Odyssey were not written by a single author.)"],"related_terms":["Homeric Question","Iliad","Odyssey"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Chorizontist' is a highly specialized term used in classical studies, specifically in discussions about the authorship of the Iliad and the Odyssey. It is unlikely to be encountered outside of academic contexts focused on Homeric literature."},"example_sentences":[{"sentence":"As a chorizontist, he meticulously analyzed the linguistic differences between the two epics.","translation":"分離主義者として、彼は2つの叙事詩の言語的な違いを綿密に分析した。"},{"sentence":"The debate between chorizontists and unitarians continues to this day.","translation":"分離主義者と統一主義者の間の議論は今日まで続いている。"},{"sentence":"Early chorizontists focused on inconsistencies in plot and character development.","translation":"初期の分離主義者たちは、プロットとキャラクターの発展における矛盾に焦点を当てた。"}]}