{"word":"demoniast","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"悪魔に取り憑かれた人、悪霊に取り憑かれた人","english_definition":"A person possessed by a demon or evil spirit.","examples":[{"sentence":"The villagers believed the woman was a demoniast and feared her.","translation":"村人たちはその女性が悪魔に取り憑かれていると信じ、彼女を恐れた。"},{"sentence":"In the past, demoniasts were often treated with exorcism rituals.","translation":"過去には、悪魔に取り憑かれた人々はしばしば悪魔祓いの儀式で治療された。"}],"collocations":["exorcise a demoniast (悪魔に取り憑かれた人を祓う)","treat a demoniast (悪魔に取り憑かれた人を治療する)","identify a demoniast (悪魔に取り憑かれた人を見分ける)"],"synonyms":["possessed person","demon possessed","spirit possessed"],"antonyms":["normal person","unpossessed"],"related_terms":["demon","possession","exorcism"]}],"etymology":{"value":"From 'demon' + '-iast' (a suffix indicating someone connected with or devoted to something).","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈmoʊniˌæst/","syllables":"de-mo-ni-ast"},"inflection":{"noun_plural":"demoniasts"},"usage_notes":{"explanation":"'Demoniast' is a relatively rare and somewhat archaic term. It refers specifically to someone believed to be inhabited and controlled by a demon or evil spirit. The term often appears in historical or religious contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The demoniast was happily living in the town.","correct":"✓ The demoniast was causing chaos in the town.","note":"Demoniasts are typically portrayed as being in distress or causing trouble, due to the influence of the possessing demon."}],"priority":"★☆☆"},"related_words":{"derivatives":["demoniacal (adjective: of, like, or characteristic of demons; influenced by a demon)","demonize (verb: to portray someone or something as evil or threatening)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Demoniast' is a rare word used to describe someone believed to be possessed by a demon. It is often found in religious or historical texts dealing with exorcism and demonology. Due to its specialized and infrequent use, it is considered an advanced vocabulary word."},"example_sentences":[{"sentence":"The priest attempted to exorcise the demon from the demoniast.","translation":"司祭は悪魔に取り憑かれた人から悪魔を祓おうとした。","type":"general","meaning_category":"悪魔に取り憑かれた人"},{"sentence":"Stories of demoniasts were common in medieval folklore.","translation":"悪魔に取り憑かれた人々の話は中世の民間伝承で一般的だった。","type":"historical","meaning_category":"悪魔に取り憑かれた人"}]}