{"word":"burnables","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"可燃ごみ、燃えるごみ","english_definition":"Materials that can be burned, especially household waste that is suitable for incineration.","examples":[{"sentence":"In Japan, burnables are often collected on specific days of the week.","translation":"日本では、可燃ごみは特定の曜日に収集されることが多いです。"},{"sentence":"Please separate your trash into burnables and non-burnables.","translation":"ごみを可燃ごみと不燃ごみに分別してください。"},{"sentence":"This bag is for burnables only.","translation":"この袋は可燃ごみ専用です。"}],"collocations":["collect burnables (可燃ごみを収集する)","separate burnables (可燃ごみを分別する)","burnables collection day (可燃ごみ収集日)","burnables bag (可燃ごみ袋)"],"synonyms":["combustible waste","incinerable waste","burnable trash"],"antonyms":["non-burnables","non-combustible waste","recyclables"]}],"etymology":{"value":"The word 'burnables' is formed by adding the suffix '-able' (capable of being) to the verb 'burn'. It refers to materials that are capable of being burned.","priority":"N/A"},"pronunciation":{"ipa":"/ˈbɜːrnəbəlz/","syllables":"bur-na-bles"},"inflection":{"noun_plural":"burnables (already plural)"},"usage_notes":{"explanation":"'Burnables' is primarily used in contexts related to waste management and recycling, especially in regions where incineration is a common method of waste disposal. It is often contrasted with 'non-burnables' (materials that cannot be burned) and 'recyclables' (materials that can be recycled). The term is most common in countries like Japan, where waste separation is highly regulated.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ I put the glass in the burnables.","correct":"✓ I put the glass in the non-burnables.","note":"Glass is not combustible and should be placed in the non-burnables or recyclables, depending on local regulations."},{"incorrect":"✗ Is plastic burnable?","correct":"✓ Is plastic considered burnable waste in this area?","note":"Some types of plastic can be burned, but it's important to know local regulations as some plastics release harmful chemicals when burned."}],"priority":"N/A"},"related_words":{"derivatives":["burnable (adjective: capable of being burned)","incinerate (verb: to burn something completely)","incineration (noun: the process of burning something completely)"],"phrases":["burnable waste","non-burnable waste","waste separation","recycling","incineration plant"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, specific to waste management contexts.","priority":"N/A"},"readability_explanation":{"level":"B2","text":"'Burnables' refers to waste materials that are suitable for burning in an incinerator. This term is commonly used in areas with strict waste management systems, such as Japan, where households are required to separate their trash into different categories. Understanding the term is important for following local waste disposal guidelines in these regions. It is often contrasted with 'non-burnables,' which are materials that cannot be incinerated and require alternative disposal methods."},"example_sentences":[{"sentence":"Please ensure all food scraps are placed in the **burnables** bin.","translation":"すべての生ごみを必ず可燃ごみ箱に入れてください。","type":"noun","meaning_category":"可燃ごみ"},{"sentence":"The city provides specific bags for **burnables** to help residents separate their waste.","translation":"市は、住民がごみを分別するのに役立つように、可燃ごみ専用の袋を提供しています。","type":"noun","meaning_category":"可燃ごみ"},{"sentence":"The improper disposal of batteries in **burnables** can cause environmental hazards.","translation":"可燃ごみへの電池の不適切な廃棄は、環境災害を引き起こす可能性があります。","type":"noun","meaning_category":"可燃ごみ"}]}