{"word":"Multigraph","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"多重グラフ：複数の辺が同じ頂点対を接続することを許容するグラフ。自己ループ（1つの頂点のみを接続する辺）も許容される場合がある。","english_definition":"A graph in which multiple edges are allowed between pairs of vertices; self-loops (edges connecting a vertex to itself) may also be allowed.","examples":[{"sentence":"A multigraph can represent connections where the number of connections matters, such as multiple flights between two cities.","translation":"多重グラフは、2つの都市間の複数のフライトのように、接続の数が重要となる接続を表すことができる。"},{"sentence":"Unlike simple graphs, multigraphs allow for parallel edges, making them suitable for modeling complex relationships.","translation":"単純グラフとは異なり、多重グラフは並行辺を許容するため、複雑な関係をモデル化するのに適している。"}],"collocations":["represent connections (接続を表す)","allow parallel edges (並行辺を許容する)","model complex relationships (複雑な関係をモデル化する)"],"synonyms":["pseudograph (自己ループを許容する場合)"],"antonyms":["simple graph (単純グラフ)"]},{"part_of_speech":"noun","definition":"（歴史的）マルチグラフ：1902年から1924年頃までアメリカン・マルチグラフ・カンパニーが製造した複写機。","english_definition":"(historical) A duplicating machine manufactured by the American Multigraph Company from approximately 1902 to 1924.","examples":[{"sentence":"Before the advent of modern photocopiers, the multigraph was used to produce multiple copies of documents.","translation":"現代のコピー機が登場する前は、マルチグラフは文書の複数のコピーを作成するために使用されていた。"},{"sentence":"The multigraph was a significant innovation in office technology during the early 20th century.","translation":"マルチグラフは、20世紀初頭のオフィス技術における重要な革新だった。"}],"collocations":["produce multiple copies (複数のコピーを作成する)","office technology (オフィス技術)"],"synonyms":["duplicating machine","mimeograph"],"antonyms":[]}],"etymology":{"value":"\"multi-\"（多数の）と \"graph\"（グラフ）の組み合わせ。多重グラフの概念を指す場合は、複数の辺を持つグラフ構造を表すことから。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmʌltɪˌɡræf/","syllables":"Mul-ti-graph"},"inflection":{"noun_plural":"multigraphs"},"usage_notes":{"explanation":"「Multigraph」は主にグラフ理論における用語で、複数の辺が同じ頂点対を接続することを許容するグラフを指します。自己ループも許容される場合があります。また、歴史的には、初期の複写機を指す言葉でもありました。文脈によって意味が異なるため、注意が必要です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ A multigraph cannot have any vertices.","correct":"✓ A multigraph must have at least one vertex.","note":"グラフは頂点を持つ必要があります。"},{"incorrect":"✗ A multigraph is the same as a simple graph.","correct":"✓ A multigraph is different from a simple graph because it allows multiple edges between vertices.","note":"単純グラフは複数の辺を許容しません。"}],"priority":"★★☆"},"related_words":{"derivatives":["multigraphic (形容詞)"],"related_terms":["graph","vertex","edge","simple graph","pseudograph","digraph","hypergraph"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 特定の分野（数学、コンピュータサイエンス）でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Multigraph**」は、グラフ理論で使われる専門用語で、複数の辺が同じ頂点同士をつなぐことができるグラフのことです。これは、普通の「simple graph（単純グラフ）」とは違います。例えば、2つの都市の間に複数の航空便がある場合、それをmultigraphで表すことができます。また、昔のコピー機にも同じ名前のものがありました。専門的な分野でしか使われない言葉なので、普段の会話ではあまり出てきません。"},"example_sentences":[{"sentence":"This **multigraph** shows the different routes between cities, including multiple flights per day.","translation":"この多重グラフは、都市間の異なるルートを示しており、1日に複数のフライトが含まれています。","type":"noun","meaning_category":"グラフ理論"},{"sentence":"The **multigraph** was an early form of office technology used for duplicating documents.","translation":"マルチグラフは、文書を複製するために使用された初期のオフィス技術の一形態でした。","type":"noun","meaning_category":"歴史的"}]}