{"word":"perimeter","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"周囲、外周、周辺","english_definition":"the boundary of a closed plane figure or the total length of this boundary; the outer limits or boundary of an area or object.","examples":[{"sentence":"The perimeter of the garden is fenced.","translation":"庭の周囲は柵で囲まれている。"},{"sentence":"We need to calculate the perimeter of the room to determine how much baseboard to buy.","translation":"どれだけの幅木を買うべきか判断するために、部屋の周囲長を計算する必要があります。"},{"sentence":"Security forces have established a tight perimeter around the building.","translation":"警備部隊は建物の周囲に厳重な警戒線を張った。"}],"collocations":["calculate the perimeter (周囲を計算する)","measure the perimeter (周囲を測る)","perimeter fence (周囲の柵)","security perimeter (警備区域)","establish a perimeter (周囲を確立する)"],"synonyms":["circumference","boundary","edge","border","outline","bounds"],"antonyms":["area","center","interior"]}],"etymology":{"value":"Late Middle English: from late Latin perimetros, from Greek perimetros, from peri- ‘around’ + metron ‘a measure’.","priority":"★★☆"},"pronunciation":{"ipa":"/pəˈrɪmɪtər/","syllables":"pe-rim-e-ter"},"inflection":{"noun_plural":"perimeters"},"usage_notes":{"explanation":"The word \"perimeter\" refers to the total distance around the outside of a two-dimensional shape. It is a fundamental concept in geometry and is used in various practical applications, such as calculating the amount of fencing needed for a yard or the length of trim required for a room. It can also refer to the outer boundary of an area, especially in a security context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The area is the same as the perimeter.","correct":"✓ The area is different from the perimeter.","note":"Area is the measure of the surface enclosed by a shape, while perimeter is the distance around the shape. They are different concepts and have different units of measurement."},{"incorrect":"✗ The perimeter of a circle is called the diameter.","correct":"✓ The perimeter of a circle is called the circumference.","note":"The perimeter of a circle has a special name, which is circumference. Diameter is the distance across the circle through the center."}],"priority":"★★☆"},"related_words":{"derivatives":["perimetric (adjective: relating to a perimeter)"],"related_terms":["area (面積)","diameter (直径)","radius (半径)","circumference (円周)","geometry (幾何学)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Moderately frequent","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"perimeter\" is used to describe the distance around a shape. It's more common in contexts involving math, construction, or security. You might encounter it in problems about calculating how much fencing is needed or in discussions about setting up a secure area. It's important to distinguish it from \"area,\" which measures the space inside a shape."},"example_sentences":[{"sentence":"The police set up a **perimeter** around the crime scene.","translation":"警察は犯罪現場の周囲に警戒線を張った。","type":"noun","meaning_category":"周囲、外周"},{"sentence":"To find the **perimeter** of a rectangle, add up the lengths of all four sides.","translation":"長方形の周囲を求めるには、4辺の長さをすべて足し合わせます。","type":"noun","meaning_category":"周囲、外周"},{"sentence":"The soldiers patrolled the **perimeter** of the base.","translation":"兵士たちは基地の周囲を巡回した。","type":"noun","meaning_category":"周辺"}]}