{"word":"hygroplasm","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"吸水形質、吸水性細胞質","english_definition":"The watery protoplasm of a cell, especially when containing much water.","examples":[{"sentence":"The hygroplasm within the plant cells allows them to withstand periods of drought.","translation":"植物細胞内の吸水形質は、干ばつの期間に耐えることを可能にする。"}],"collocations":[],"synonyms":["protoplasm","cytoplasm"],"antonyms":[]}],"etymology":{"value":"From 'hygro-' (related to moisture) + 'plasm' (protoplasm).","priority":"★★★"},"pronunciation":{"ipa":"/ˈhaɪɡroʊˌplæzəm/","syllables":"hy-gro-plasm"},"inflection":{"noun_plural":"hygroplasms"},"usage_notes":{"explanation":"'Hygroplasm' is a relatively uncommon term in general use, primarily used in specialized scientific or botanical contexts. It refers to the water-rich protoplasm found in cells, particularly in plants adapted to dry environments.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["hygroscopic","protoplasm","cytoplasm"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Hygroplasm' is a specialized term used in biology and botany to describe the watery protoplasm of a cell, especially when it contains a high amount of water. It's most relevant in the context of plant cells that have adapted to survive in dry conditions. Due to its technical nature, it's not commonly encountered outside of scientific literature. Understanding requires a background in cell biology.","priority":"★★☆"},"example_sentences":[{"sentence":"The drought-resistant plant species exhibited a higher concentration of hygroplasm in their leaf cells.","translation":"その耐乾性植物種は、葉細胞内に高濃度の吸水形質を示した。","type":"scientific","meaning_category":"botany"},{"sentence":"The study investigated the role of hygroplasm in maintaining cell turgor under water stress.","translation":"その研究は、水分ストレス下での細胞の膨圧を維持する上での吸水形質の役割を調査した。","type":"scientific","meaning_category":"cell biology"}]}