{"word":"town-flanked","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"町の側面に位置する、または町に隣接する","english_definition":"Situated on the side of or adjacent to a town.","examples":[{"sentence":"The town-flanked hills provided a scenic backdrop.","translation":"町の側面に位置する丘は、美しい背景を提供した。"},{"sentence":"A town-flanked industrial area was developed to the east.","translation":"町の側面に位置する工業地帯が東に開発された。"}],"collocations":["town-flanked hills","town-flanked area","town-flanked industrial zone"],"synonyms":["adjacent to the town","bordering the town","next to the town","surrounding the town"],"antonyms":["town-centered","remote from the town","distant from the town"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'town' (referring to a populated area) and 'flanked' (meaning to be situated on the side of something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtaʊn flæŋkt/","syllables":"town-flanked"},"inflection":{"notes":"This is an adjective and does not have plural or verb forms."},"usage_notes":{"explanation":"'Town-flanked' is used to describe geographical features or areas that are located on the side or edge of a town. It emphasizes the proximity and relationship to the town. It is not a commonly used word, but it is descriptive and can be useful in specific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The town was flanked by the river.","correct":"✓ The river flanked the town.","note":"'Flank' as a verb means to be situated on each side of or on one side of (someone or something). The town is not doing the flanking; something else is flanking the town."},{"incorrect":"✗ It's a town-flanking area.","correct":"✓ It's a town-flanked area.","note":"The adjective is 'town-flanked,' not 'town-flanking.'"}],"priority":"★★☆"},"related_words":{"derivatives":["flank (noun, verb)","town (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (not commonly found in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Town-flanked' is a relatively uncommon compound adjective. It describes something located on the side of or adjacent to a town. Understanding the meaning requires knowing the individual words 'town' and 'flanked,' and how they combine to create a descriptive term. It is more likely to appear in descriptive writing or geographical contexts."},"example_sentences":[{"sentence":"The town-flanked forest provided a natural barrier against strong winds.","translation":"町の側面に位置する森林は、強い風に対する自然の障壁となった。","type":"adjective","meaning_category":"location"},{"sentence":"A town-flanked park offered residents a place for recreation.","translation":"町の側面に位置する公園は、住民にレクリエーションの場所を提供した。","type":"adjective","meaning_category":"location"}]}