{"word":"injuredly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"傷ついたように、痛めた様子で、不当に扱われたと感じて","english_definition":"in a way that shows you are hurt, wounded, or feel unfairly treated.","examples":[{"sentence":"\"I didn't mean it that way,\" she said injuredly.","translation":"「そんなつもりじゃなかったの」と彼女は傷ついたように言った。"},{"sentence":"He looked at her injuredly when she criticized his work.","translation":"彼女が彼の仕事を批判したとき、彼は不当に扱われたと感じて彼女を見た。"},{"sentence":"\"Are you accusing me?\" he asked, injuredly.","translation":"「私を責めているのか？」と彼は傷ついた様子で尋ねた。"}],"collocations":["look injuredly","say injuredly","ask injuredly","reply injuredly","speak injuredly"],"synonyms":["hurtfully","offendedly","aggrievedly","resentfully","bitterly","disappointedly"],"antonyms":["happily","cheerfully","pleasantly","unconcernedly"]}],"etymology":{"value":"The word 'injuredly' is formed by adding the suffix '-ly' to the adjective 'injured'. 'Injured' comes from the verb 'injure', which originates from the Latin word 'injuria', meaning 'injustice' or 'wrong'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɪndʒərdli/","syllables":"in-jur-ed-ly"},"inflection":{"notes":"This is an adverb and does not have different forms."},"usage_notes":{"explanation":"'Injuredly' describes the manner in which someone speaks or acts when they feel hurt, either physically or emotionally. It often implies a sense of injustice or being unfairly treated. The word is relatively uncommon and is primarily used in writing to convey a specific emotional tone.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He injuredly ran to the doctor after falling.","correct":"✓ He ran injured to the doctor after falling.","note":"'Injuredly' describes the manner of running, not the state of being injured. Use 'injured' as an adjective to describe his state. Alternatively, 'He ran to the doctor after falling and injuring himself.'"},{"incorrect":"✗ She felt injuredly by his words.","correct":"✓ She felt injured by his words.","note":"'Injured' is the correct adjective to describe how she felt. 'Injuredly' is an adverb and modifies verbs, not adjectives."}],"priority":"★★☆"},"related_words":{"derivatives":["injured (adjective)","injure (verb)","injury (noun)"],"phrases":["injured party (noun): the person who has been harmed or wronged"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (not commonly found in CEFR level vocabulary lists)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'injuredly' is an adverb that describes how someone does something in a way that shows they are hurt or offended. It's not a very common word, so you might not see it often. It's used to add detail to a description of someone's actions, showing they feel wronged or wounded. For example, if someone says something \"injuredly,\" it means they are speaking in a tone that shows they feel hurt by what has happened or been said."},"example_sentences":[{"sentence":"\"That's not fair!\" he exclaimed injuredly.","translation":"「それは不公平だ！」と彼は傷ついたように叫んだ。","type":"adverb","meaning_category":"feeling unfairly treated"},{"sentence":"She looked at him injuredly, tears welling up in her eyes.","translation":"彼女は傷ついた様子で彼を見つめ、目に涙が浮かんだ。","type":"adverb","meaning_category":"hurt or wounded"},{"sentence":"\"I always try my best,\" he replied injuredly to the criticism.","translation":"「私はいつも最善を尽くしている」と彼は批判に対して傷ついた様子で答えた。","type":"adverb","meaning_category":"feeling unfairly criticized"}]}