{"word":"assembly-level","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"アセンブリ言語の、アセンブリレベルの","english_definition":"relating to or written in assembly language.","examples":[{"sentence":"Assembly-level programming requires a deep understanding of the computer's architecture.","translation":"アセンブリレベルのプログラミングは、コンピュータのアーキテクチャに関する深い理解を必要とします。"},{"sentence":"The code was optimized at the assembly-level for maximum performance.","translation":"そのコードは、最高のパフォーマンスのためにアセンブリレベルで最適化されました。"}],"collocations":["assembly-level language","assembly-level code","assembly-level programming","assembly-level optimization"],"synonyms":["low-level"],"antonyms":["high-level"]}],"etymology":{"value":"The term 'assembly-level' is derived from 'assembly language,' which is a low-level programming language that uses symbolic representations of machine code instructions.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈsɛmbli ˈlɛvəl/","syllables":"a-ssem-bly le-vel"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Assembly-level' is used to describe anything related to assembly language programming. It signifies a level of programming that is very close to the hardware and requires detailed knowledge of the processor's instruction set.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is working on a assembly level program.","correct":"✓ He is working on an assembly-level program.","note":"Use 'an' before 'assembly' because it starts with a vowel sound."}],"priority":"★★☆"},"related_words":{"derivatives":["assembly language","assembler"],"related_terms":["machine code","low-level language","compiler","debugger"]},"level_frequency":{"frequency_google_ngram":"Low frequency. Specialized term used in computer science and software engineering.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Assembly-level' is a technical term primarily used in computer science. It refers to the level of programming that directly interacts with a computer's hardware, using assembly language. This level is more complex than high-level languages like Python or Java and requires a deep understanding of computer architecture."},"example_sentences":[{"sentence":"Debugging assembly-level code can be challenging.","translation":"アセンブリレベルのコードのデバッグは難しいことがあります。","type":"general","meaning_category":"programming"},{"sentence":"The operating system interacts with the hardware at the assembly-level.","translation":"オペレーティングシステムは、アセンブリレベルでハードウェアとやり取りします。","type":"technical","meaning_category":"computer architecture"}]}