{"word":"Nonfortuitously","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"偶然ではなく、意図的に、必然的に","english_definition":"Not by chance or accident; intentionally; necessarily.","examples":[{"sentence":"The outcome occurred nonfortuitously, as a result of careful planning.","translation":"その結果は、注意深い計画の結果として、偶然ではなく必然的に起こった。"},{"sentence":"The connection between the two events was nonfortuitous; it was deliberately engineered.","translation":"二つの出来事の間のつながりは偶然ではなかった。それは意図的に仕組まれたものだった。"}],"collocations":["occur nonfortuitously","happen nonfortuitously","arise nonfortuitously","be connected nonfortuitously"],"synonyms":["deliberately","intentionally","purposely","by design","necessarily","inevitably"],"antonyms":["fortuitously","accidentally","by chance","randomly","unintentionally"]}],"etymology":{"value":"\"non-\" (否定) + \"fortuitously\" (偶然に)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnfɔːrˈtjuːɪtəsli/","syllables":"non-for-tu-i-tous-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"\"Nonfortuitously\" is the adverbial form of \"nonfortuitous,\" meaning not happening by chance or accident. It implies a deliberate or necessary connection or outcome. It is a relatively formal and uncommon word.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The meeting happened nonfortuitously of the schedule.","correct":"✓ The meeting happened nonfortuitously, according to the schedule.","note":"The adverb modifies the verb directly. Adding \"of\" is incorrect. Use a phrase like \"according to the schedule\" to clarify the reason for the non-randomness."},{"incorrect":"✗ Nonfortuitously, he found the money.","correct":"✓ He nonfortuitously found the money (e.g., by searching deliberately). / ✓ He found the money, but not nonfortuitously (e.g., he found it by accident).","note":"The adverb should be placed to clearly modify the verb it describes. The first example implies a deliberate search, the second implies a denial of deliberate action."}],"priority":"★★☆"},"related_words":{"derivatives":["nonfortuitous (adjective)","fortuitously (adverb)","fortuitous (adjective)","fortuity (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Nonfortuitously\" is a formal and uncommon word. It is best used in academic or technical writing where precision is required to indicate that something occurred not by chance, but intentionally or necessarily. Because of its rarity, it should be used judiciously and with consideration for the audience's vocabulary. Simpler alternatives like \"deliberately\" or \"intentionally\" may be more appropriate in many contexts."},"example_sentences":[{"sentence":"The company's success arose nonfortuitously from years of research and development.","translation":"その会社の成功は、長年の研究開発の結果として、偶然ではなく必然的に生じた。","type":"adverb","meaning_category":"intentionally/necessarily"},{"sentence":"The selection of that candidate was nonfortuitous; it was based on specific criteria.","translation":"その候補者の選出は偶然ではなかった。それは特定の基準に基づいていた。","type":"adverb","meaning_category":"intentionally/necessarily"}]}