{"word":"pot-luck","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"持ち寄りパーティー、あり合わせ料理","english_definition":"a meal or party to which each of the guests contributes a dish.","examples":[{"sentence":"We're having a pot-luck dinner next week.","translation":"来週、持ち寄りディナーをすることになっています。"},{"sentence":"Everyone brought a dish to the pot-luck.","translation":"みんなが持ち寄りパーティーに料理を持ってきた。"},{"sentence":"It's a pot-luck, so just bring whatever you can.","translation":"持ち寄りなので、何かできるものを持ってきてください。"}],"collocations":["pot-luck dinner","pot-luck supper","pot-luck lunch","pot-luck party","bring a dish to the pot-luck"],"synonyms":["covered-dish supper","bring-a-plate","shared meal"],"antonyms":[],"notes":"The term can also refer to a situation where you have to make do with whatever is available."},{"part_of_speech":"adjective","definition":"あり合わせの、手持ちの","english_definition":"using whatever is available or happens to be on hand.","examples":[{"sentence":"We had a pot-luck meal with whatever was in the fridge.","translation":"冷蔵庫にあるものであり合わせの食事をした。"},{"sentence":"The decorations were pot-luck, just whatever we could find.","translation":"飾り付けはあり合わせで、見つけられるものなら何でも使った。"}],"collocations":["pot-luck meal","pot-luck supper","pot-luck arrangement"],"synonyms":["haphazard","improvised","makeshift"],"antonyms":["planned","organized"]}],"etymology":{"value":"The term \"pot-luck\" originated in the 16th century and originally referred to \"the food available for a guest; whatever food happens to be in the pot.\" It implied that a guest was welcome to share whatever was being cooked in the pot at the time. Over time, it evolved to mean a meal where guests bring dishes to share.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɒt ˈlʌk/","syllables":"pot-luck (2 syllables)"},"inflection":{"notes":"It is a compound word. The plural form is 'pot-lucks'"},"usage_notes":{"explanation":"The term \"pot-luck\" is primarily used to describe a gathering where attendees contribute dishes to be shared. It emphasizes the communal aspect of the meal. It can also describe a situation where one makes do with whatever is available, often in a culinary context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ We are going to a pot luck tomorrow.","correct":"✓ We are going to a pot-luck tomorrow.","note":"The correct spelling is 'pot-luck' with a hyphen."},{"incorrect":"✗ I will bring a pot luck for the party.","correct":"✓ I will bring a dish for the pot-luck party.","note":"It's more common to say 'bring a dish' rather than 'bring a pot-luck'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["buffet","picnic","cookout","barbecue","feast"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Moderately frequent","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Pot-luck\" refers to a meal or gathering where everyone brings a dish to share. Think of it as a collaborative dinner party. It can also describe using whatever is available, like making a meal from items already in your kitchen. It's a fairly common term, especially in social contexts related to food and gatherings.","example_sentences":[]},"example_sentences":[{"sentence":"The office is having a pot-luck lunch to celebrate the end of the project.","translation":"オフィスでは、プロジェクトの終了を祝うために持ち寄りランチをします。","type":"noun","meaning_category":"持ち寄りパーティー"},{"sentence":"We decided to have a pot-luck Thanksgiving this year.","translation":"今年は持ち寄りの感謝祭にすることにしました。","type":"noun","meaning_category":"持ち寄りパーティー"},{"sentence":"For dinner, we just had a pot-luck meal of leftovers.","translation":"夕食には、残り物で適当にあり合わせの食事をしました。","type":"adjective","meaning_category":"あり合わせの"}]}