{"word":"Insaneness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"狂気、正気でないこと、非常識","english_definition":"The state of being insane; madness; irrationality.","examples":[{"sentence":"The insaneness of his actions was evident to everyone.","translation":"彼の行動の狂気は誰の目にも明らかだった。"},{"sentence":"The judge ruled that the defendant's insaneness at the time of the crime made him not responsible for his actions.","translation":"裁判官は、被告が犯罪を犯した当時、正気でなかったため、責任を問えないと判断した。"},{"sentence":"The insaneness of the plan made it unlikely to succeed.","translation":"その計画の非常識さから、成功する可能性は低いと思われた。"}],"collocations":["bordering on insaneness (狂気に近い)","a touch of insaneness (少しばかりの狂気)","sheer insaneness (全くの狂気)"],"synonyms":["madness","insanity","lunacy","craziness","derangement","delirium","mania","folly","absurdity","irrationality"],"antonyms":["sanity","reason","rationality","soundness of mind","normality"]}],"etymology":{"value":"Formed from 'insane' (not sane) + '-ness' (a suffix denoting a state or condition). 'Insane' comes from Latin 'insanus', meaning 'not healthy, mad, crazy'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈseɪn.nəs/","syllables":"in-sane-ness"},"inflection":{"noun_plural":"insanenesses (rarely used)"},"usage_notes":{"explanation":"'Insaneness' is a noun that refers to the state or quality of being insane. It is often used to describe actions, plans, or situations that are highly irrational, foolish, or dangerous. While 'insanity' is a more common and formal term, 'insaneness' can be used to emphasize the extreme or obvious nature of the lack of sanity. It is important to use this word carefully, as it can be stigmatizing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a lot of insane.","correct":"✓ He showed a lot of insaneness.","note":"'Insane' is an adjective, while 'insaneness' is the noun form. You need the noun form to describe the state or quality of being insane."},{"incorrect":"✗ The insaneness was caused by stress, so he needs to be more sane.","correct":"✓ The insaneness was caused by stress, so he needs to regain his sanity.","note":"'Sanity' is a more common and natural antonym to 'insaneness' and 'insanity' than 'sane', which is an adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["insane (adjective)","insanely (adverb)","insanity (noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. 'Insaneness' is less common than 'insanity'.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Insaneness' is a noun that describes the state of being insane, which means not having a healthy mind or being very irrational. It's a less common word than 'insanity' but can be used to emphasize how crazy or foolish something is. For example, you might say 'The insaneness of his plan was clear to everyone' to show that the plan was obviously very bad or dangerous because it was so irrational."},"example_sentences":[{"sentence":"The sheer insaneness of the situation left her speechless.","translation":"その状況の全くの狂気は、彼女を言葉を失わせた。","type":"noun","meaning_category":"狂気"},{"sentence":"The report detailed the growing insaneness within the organization.","translation":"報告書は、組織内で増大する狂気を詳述した。","type":"noun","meaning_category":"正気でないこと"},{"sentence":"The insaneness of driving at that speed on a winding road is undeniable.","translation":"曲がりくねった道をそのスピードで運転することの非常識さは否定できない。","type":"noun","meaning_category":"非常識"}]}