{"word":"Jewstone","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ユダヤ石（歴史的にユダヤ人と関連付けられた石、またはユダヤ人の儀式に使用される石）","english_definition":"A stone historically associated with Jewish people or used in Jewish rituals","examples":[{"sentence":"The ancient Jewstone was found near the synagogue ruins.","translation":"古代のユダヤ石がシナゴーグの遺跡近くで発見された。"}],"notes":"This term is archaic and rarely used in modern contexts. When referring to Jewish ritual objects, more specific terms like 'mezuzah' or 'matzevah' are preferred."},{"part_of_speech":"noun","definition":"（廃語）ユダヤ人を侮蔑的に指す用語","english_definition":"(obsolete, offensive) A derogatory term for a Jewish person","examples":[],"warning":"This usage is extremely offensive and should never be used. Listed here only for historical understanding of language."}],"etymology":{"value":"中英語 'Jew'（ユダヤ人）と 'stone'（石）の複合語。ユダヤ人の儀式やシンボルに関連する石を指した可能性があるが、正確な語源は不明。侮蔑的な用法は16-18世紀の文献に散見される。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈdʒuːˌstoʊn/","syllables":"Jew-stone"},"usage_notes":{"explanation":"「Jewstone」は現代ではほとんど使用されない古風な用語です。歴史的文脈でユダヤ教の儀式に関連する石を指す場合がありますが、専門的にはより正確な用語（'matzevah' - 墓石、'mezuzah' - 門柱聖句など）を使用すべきです。2つ目の意味は明らかに侮蔑的で、現代では完全に不適切です。この言葉を使用する際は極めて慎重になる必要があり、通常は避けるべきです。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Using 'Jewstone' to refer to modern Jewish ritual objects","correct":"Use specific terms like 'mezuzah' or 'matzevah' instead","note":"現代のユダヤ教の儀式用品を指す場合、正確な専門用語を使用してください"}],"priority":"★★☆"},"related_words":{"appropriate_alternatives":["matzevah (ユダヤの墓石)","mezuzah (門柱聖句)","tefillin (聖句箱)","mizrach (礼拝方向を示す飾り板)"],"priority":"★★☆"},"level_frequency":{"CEFR":"Not applicable (archaic/offensive term)","frequency_google_ngram":"Extremely rare - appears mainly in historical texts before 1800","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「Jewstone」は非常に特殊で古風な用語であり、現代英語ではほとんど使用されません。歴史的文書や極めて専門的な文脈以外で遭遇することはまずありません。この言葉には潜在的に攻撃的な意味合いが含まれている可能性があるため、使用には最大限の注意が必要です。ユダヤ教の儀式や文化に関連する石を指す場合、より正確で適切な専門用語が存在します。"},"example_sentences":[{"sentence":"The museum displayed what was labeled as a medieval Jewstone.","translation":"博物館には中世のユダヤ石と表示されたものが展示されていた。","type":"historical reference","meaning_category":"歴史的遺物"}],"cultural_note":"ユダヤ教において石は重要な象徴的意味を持ちますが（例えばヤコブが枕にした石、十戒が刻まれた石板など）、'Jewstone'という包括的な用語は適切ではなく、各々の文脈に応じた正確な用語を使用する必要があります。"}