{"word":"cecidology","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"虫こぶ学、ゴール学：植物にできる虫こぶ（ゴール）を研究する学問","english_definition":"The study of plant galls (cecidia).","examples":[{"sentence":"Cecidology is a fascinating field of study that explores the interactions between plants and gall-inducing organisms.","translation":"虫こぶ学は、植物と虫こぶを誘導する生物との相互作用を探求する魅力的な研究分野です。"},{"sentence":"Researchers in cecidology investigate the morphology, development, and ecology of plant galls.","translation":"虫こぶ学の研究者は、植物の虫こぶの形態、発達、生態を調査します。"}],"collocations":["plant cecidology","applied cecidology","ecological cecidology"],"synonyms":["gall study"],"antonyms":[]},{"part_of_speech":"noun","definition":"虫こぶに関する知識","english_definition":"Knowledge relating to plant galls.","examples":[{"sentence":"His cecidology was extensive, allowing him to identify even the rarest types of galls.","translation":"彼の虫こぶに関する知識は広範囲にわたり、最も珍しい種類の虫こぶさえ識別することができました。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the Ancient Greek word 'kekis' (κηκίς) meaning 'gall' or 'oak apple', and '-logy', denoting a field of study.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɛsɪˈdɒlədʒi/","syllables":"ce-cid-ol-o-gy"},"inflection":{"noun_plural":"cecidologies"},"usage_notes":{"explanation":"Cecidology is a specialized branch of botany and entomology. It focuses on the abnormal plant growths known as galls or cecidia, which are often induced by insects, mites, fungi, bacteria, or viruses. The study includes the identification of gall-inducing organisms, the morphology and anatomy of galls, and the ecological relationships between galls and their hosts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I am studying cecidology, so I know a lot about insects.","correct":"✓ I am studying cecidology, so I know a lot about plant galls and the organisms that cause them.","note":"Cecidology specifically studies plant galls, not insects in general. While insects are often involved, the focus is on the plant's response and the gall formation."}],"priority":"★☆☆"},"related_words":{"derivatives":["cecidogenous (adjective: gall-inducing)","cecidium (noun: gall)","cecidomyiidae (noun: gall midges, a family of flies that induce galls)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Cecidology is a highly specialized term referring to the scientific study of plant galls, also known as cecidia. These galls are abnormal plant growths typically caused by insects, mites, fungi, or bacteria. Understanding this term requires familiarity with botanical and entomological concepts. The word itself is derived from Greek roots, indicating its academic and scientific context."},"example_sentences":[{"sentence":"The professor's lecture on cecidology covered the various types of galls found in the local ecosystem.","translation":"教授の虫こぶ学の講義では、地域の生態系で見られるさまざまな種類の虫こぶについて説明されました。","type":"noun","meaning_category":"虫こぶ学"},{"sentence":"Advances in cecidology have helped to identify new species of gall-inducing insects.","translation":"虫こぶ学の進歩は、虫こぶを誘導する昆虫の新しい種の特定に役立っています。","type":"noun","meaning_category":"虫こぶ学"}]}