{"word":"gasometer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ガスメーター、ガスホルダー","english_definition":"a large cylindrical container for storing gas, especially coal gas, at a constant pressure. Also refers to an instrument for measuring gas volume.","examples":[{"sentence":"The gasometer dominated the skyline of the industrial town.","translation":"ガスメーターは、その工業都市のスカイラインでひときわ目立っていた。"},{"sentence":"The old gasometer is now a historical landmark.","translation":"その古いガスメーターは現在、歴史的なランドマークとなっている。"},{"sentence":"The gasometer was used to store coal gas for the city's streetlights.","translation":"そのガスメーターは、都市の街路灯用の石炭ガスを貯蔵するために使用されていた。"}],"collocations":["gasometer tank","gasometer station","coal gas gasometer"],"synonyms":["gas holder","gas tank","gas reservoir"],"antonyms":[],"related_words":["gasworks","coal gas","natural gas","meter"],"level_frequency":{"frequency_google_ngram":"Low frequency - Relatively uncommon word.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'gasometer' refers to a specific type of large container used for storing gas, especially in historical industrial contexts. Understanding the word requires some familiarity with industrial history and gas production methods. It is not a commonly used word in modern everyday conversation."},"example_sentences":[{"sentence":"The disused gasometer was a relic of the city's industrial past.","translation":"その使われなくなったガスメーターは、都市の産業の過去の遺物だった。","type":"noun","meaning_category":"gas holder"},{"sentence":"The engineer inspected the gasometer for any signs of leaks.","translation":"技師はガスメーターに漏れの兆候がないか点検した。","type":"noun","meaning_category":"gas holder"}]}],"etymology":{"value":"Derived from 'gas' + '-o-' (connecting vowel) + '-meter' (measuring instrument). Originally referred to a device for measuring gas, but later came to denote the storage container itself.","priority":"★★☆"},"pronunciation":{"ipa":"/ɡæˈsɒmɪtər/","syllables":"ga-som-e-ter"},"inflection":{"noun_plural":"gasometers"},"usage_notes":{"explanation":"The term 'gasometer' is primarily used in historical or industrial contexts. In modern usage, the term 'gas holder' or 'gas tank' is more common when referring to the storage container. The word is more frequently encountered in British English than in American English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a big gasometer at the petrol station.","correct":"✓ I saw a big gas tank at the petrol station.","note":"Gasometers are typically large industrial structures, not found at petrol stations. Petrol stations have gas tanks for gasoline or other fuels."},{"incorrect":"✗ The gasometer is used to measure the amount of electricity used.","correct":"✓ The gasometer is used to measure the amount of gas used.","note":"Gasometers measure gas volume, not electricity."}],"priority":"★☆☆"}}