{"word":"synchronically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"共時的に、同時発生的に","english_definition":"in a synchronic manner; with regard to a particular point in time without reference to history.","examples":[{"sentence":"The data was analyzed synchronically to understand the relationships between variables at that specific moment.","translation":"そのデータは、その特定の時点における変数間の関係を理解するために、共時的に分析されました。"},{"sentence":"Linguistics can be studied synchronically or diachronically.","translation":"言語学は共時的にも通時的にも研究できます。"}],"collocations":["analyze synchronically","study synchronically","view synchronically"],"synonyms":["simultaneously","concurrently","at the same time","contemporaneously"],"antonyms":["diachronically","historically","over time"]}],"etymology":{"value":"Derived from 'synchronic', which comes from the Greek 'syn-' (together) and 'chronos' (time), plus the adverbial suffix '-ally'.","priority":"★★☆"},"pronunciation":{"ipa":"/sɪŋˈkrɒnɪkli/","syllables":"syn-chron-i-cal-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Synchronically' refers to examining something at a single point in time, without considering its historical development. It is often used in linguistics, anthropology, and other fields where phenomena can be studied both in terms of their evolution over time (diachronically) and their state at a particular moment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The events happened synchronically because they were planned that way.","correct":"✓ The events happened simultaneously because they were planned that way.","note":"'Synchronically' refers to a method of analysis, not necessarily to events that are planned to happen at the same time. 'Simultaneously' is better for describing events occurring at the same time."}],"priority":"★★☆"},"related_words":{"derivatives":["synchronic (adjective)","synchrony (noun)","synchronize (verb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Synchronically' is a term used in academic contexts, particularly in linguistics and social sciences, to describe the analysis of a phenomenon at a specific point in time, without considering its historical development. It's the adverbial form of 'synchronic'. Understanding this term requires familiarity with academic discourse. "},"example_sentences":[{"sentence":"We studied the grammar of the language synchronically, focusing on its structure at that specific period.","translation":"私たちはその言語の文法を共時的に研究し、その特定の時期における構造に焦点を当てました。","type":"general"},{"sentence":"The anthropologist analyzed the culture synchronically to understand its current state.","translation":"人類学者は、その文化の現状を理解するために、共時的に分析しました。","type":"academic"}]}