{"word":"eutaxie","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(地質学)正構造：火成岩（特に溶岩）における、鉱物または岩片の平行配列。","english_definition":"(geology) A parallel arrangement of minerals or rock fragments in an igneous rock, especially a lava.","examples":[{"sentence":"The rhyolite exhibited a beautiful eutaxie.","translation":"その流紋岩は美しい正構造を示していた。"}],"collocations":["exhibit eutaxie","display eutaxie"],"synonyms":["flow structure"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の 'eu-' (良い、正常な) + 'taxis' (配列) に由来。","priority":"★★☆"},"pronunciation":{"ipa":"/juːˈtæksi/","syllables":"eu-tax-ie"},"inflection":{"noun_plural":"eutaxies"},"usage_notes":{"explanation":"Eutaxie is a term used specifically in geology to describe a particular texture found in igneous rocks. It refers to the aligned arrangement of minerals or rock fragments, often due to flow during the rock's formation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rock showed good texture, but no eutaxie.","correct":"✓ The rock showed good texture, but no distinct eutaxie.","note":"'Eutaxie' itself describes a type of texture, so saying 'good texture, but no eutaxie' is contradictory. Instead, specify that the eutaxie is not distinct or present."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["igneous rock","lava","texture","petrology"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 地質学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Eutaxie' is a specialized geological term. It describes a specific texture in igneous rocks where minerals or rock fragments are aligned in a parallel fashion. This term is primarily used in advanced geological studies and research. Understanding requires prior knowledge of petrology and igneous rock formation processes."},"example_sentences":[{"sentence":"The geologist identified the eutaxie in the hand specimen.","translation":"地質学者は手標本の中で正構造を特定した。","type":"noun","meaning_category":"地質学用語"},{"sentence":"The degree of eutaxie can indicate the viscosity of the lava flow.","translation":"正構造の程度は、溶岩流の粘度を示す可能性がある。","type":"noun","meaning_category":"地質学用語"}]}