{"word":"nitrate-pure","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Completely free of nitrates; exceptionally pure with respect to nitrate content.","english_definition":"Describes a substance or solution that is entirely free from nitrates, implying an extremely high level of purity concerning nitrate contamination.","examples":[{"sentence":"The experiment required nitrate-pure water to avoid any interference.","translation":"実験では、干渉を避けるために硝酸塩を全く含まない水が必要だった。"},{"sentence":"Only nitrate-pure reagents were used in the analysis to ensure accurate results.","translation":"正確な結果を保証するために、分析には硝酸塩を全く含まない試薬のみが使用された。"}],"collocations":["nitrate-pure water","nitrate-pure reagents","nitrate-pure solution"],"synonyms":["nitrate-free","ultra-pure (with respect to nitrates)","nitrate-absent"],"antonyms":["nitrate-contaminated","nitrate-containing","nitrate-present"]}],"etymology":{"value":"Combination of 'nitrate' (a chemical compound) and 'pure' (free from contaminants), indicating a state of complete absence of nitrates.","priority":"low"},"pronunciation":{"ipa":"ˈnaɪtreɪt_pjʊr","syllables":"ni-trate-pure"},"inflection":{"notes":"Adjective; does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Nitrate-pure' is a highly specific term typically used in scientific or technical contexts where the presence of even trace amounts of nitrates could affect results or processes. It implies a level of purity beyond what is normally considered 'pure'.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"✗ The lake is nitrate-pure.","correct":"✓ The lake has very low nitrate levels.","note":"'Nitrate-pure' is rarely applicable to natural environments like lakes, which almost always contain some nitrates. Use it for controlled laboratory conditions or manufactured substances."}],"priority":"low"},"related_words":{"derivatives":["nitrate","pure","purity"],"related_terms":["nitrate contamination","trace analysis","chemical purity"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low","priority":"low"},"readability_explanation":{"level":"C1","text":"'Nitrate-pure' is a technical term indicating a substance is completely free of nitrates. It's used in scientific or industrial contexts where even trace amounts of nitrates are unacceptable. Understanding requires knowledge of chemistry and purity standards."},"example_sentences":[{"sentence":"The cell culture medium was prepared using nitrate-pure salts.","translation":"細胞培養培地は、硝酸塩を全く含まない塩を用いて調製された。","type":"adjective","meaning_category":"chemical purity"},{"sentence":"Achieving nitrate-pure conditions is challenging in agricultural research.","translation":"農業研究において、硝酸塩を全く含まない状態を達成することは困難である。","type":"adjective","meaning_category":"experimental conditions"}]}