{"word":"cryo-unstable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"低温で不安定な、極低温下で不安定な","english_definition":"Unstable at cryogenic temperatures; tending to degrade or change when subjected to extremely low temperatures.","examples":[{"sentence":"The compound is cryo-unstable and must be handled with care during storage.","translation":"その化合物は低温で不安定であり、保管中は注意して取り扱う必要があります。"},{"sentence":"Cryo-unstable materials are not suitable for long-term preservation in liquid nitrogen.","translation":"低温で不安定な材料は、液体窒素中での長期保存には適していません。"}],"collocations":["cryo-unstable compound","cryo-unstable material","cryo-unstable sample"],"synonyms":["temperature-sensitive","labile at low temperatures","cold-sensitive"],"antonyms":["cryo-stable","stable at low temperatures"]}],"etymology":{"value":"Derived from 'cryo-' (prefix relating to cold or freezing) and 'unstable' (not stable; likely to change or degrade).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkraɪoʊənˈsteɪbəl/","syllables":"cry-o-un-sta-ble"},"inflection":{"notes":"Adjectives do not inflect in English, except for comparative and superlative forms (which are less common for this word: more cryo-unstable, most cryo-unstable)."},"usage_notes":{"explanation":"'Cryo-unstable' is a technical term primarily used in scientific and engineering contexts, particularly when discussing materials, compounds, or biological samples that are sensitive to extremely low temperatures. It indicates that the substance is prone to degradation, decomposition, or other undesirable changes when exposed to cryogenic conditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cryo-unstable is dangerous.","correct":"✓ Cryo-unstable materials are dangerous.","note":"'Cryo-unstable' is an adjective and needs to modify a noun."}],"priority":"★☆☆"},"related_words":{"derivatives":["cryo- (prefix)","unstable","cryogenics","cryopreservation","cryostability"],"related_terms":["cryo-stable","cryoprotectant","cryobiology"],"priority":"★★☆"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency - primarily used in specialized scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cryo-unstable' is a specialized term primarily encountered in scientific or technical contexts. It describes something that is not stable (unstable) at very low (cryo-) temperatures. Understanding this term requires familiarity with basic scientific vocabulary and the concept of cryogenic temperatures. It's not commonly used in everyday language."},"example_sentences":[{"sentence":"The protein sample was found to be highly cryo-unstable, necessitating the addition of a cryoprotectant.","translation":"そのタンパク質サンプルは非常に低温で不安定であることが判明したため、凍結保護剤の添加が必要になった。","type":"general","meaning_category":"general"},{"sentence":"Due to its cryo-unstable nature, the sensor requires careful calibration before each use in cryogenic environments.","translation":"そのセンサーは低温で不安定な性質のため、極低温環境で使用する前に毎回慎重な校正が必要です。","type":"technical","meaning_category":"technical"}]}