{"word":"Uninfluenceability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"影響を受けにくいこと、影響されない性質","english_definition":"The quality or state of being uninfluenceable; the inability or unwillingness to be affected or changed by external forces, persuasion, or pressure.","examples":[{"sentence":"His uninfluenceability made him a difficult negotiator.","translation":"彼の影響を受けにくさは、彼を交渉相手として困難にした。"},{"sentence":"The politician's uninfluenceability to lobbyists was seen as a sign of integrity.","translation":"政治家がロビイストの影響を受けにくいことは、誠実さの表れと見なされた。"},{"sentence":"Her uninfluenceability stemmed from a deep-seated conviction in her own beliefs.","translation":"彼女の影響を受けにくさは、彼女自身の信念に対する根深い確信から生じていた。"}],"collocations":["show uninfluenceability","demonstrate uninfluenceability","perceived uninfluenceability","maintain uninfluenceability"],"synonyms":["impassivity","invulnerability","resistance","obstinacy","steadfastness","determination","resoluteness"],"antonyms":["influenceability","susceptibility","vulnerability","openness","receptiveness"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to 'influenceability', which itself is derived from 'influence' with the suffix '-ability' (the capacity to be influenced).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˌɪnfluənsəˈbɪləti/","syllables":"un-in-flu-en-ce-a-bil-i-ty"},"inflection":{"noun_plural":"Uninfluenceabilities (rarely used)"},"usage_notes":{"explanation":"'Uninfluenceability' describes a characteristic of a person or entity that resists being swayed or altered by external factors. It is often used in contexts where persuasion, pressure, or manipulation are present. The term can carry both positive and negative connotations, depending on the context. In some cases, it is seen as a strength, indicating integrity and steadfastness. In other cases, it can be seen as a weakness, indicating stubbornness or an unwillingness to consider alternative viewpoints.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The uninfluenceability of the weather affected our plans.","correct":"✓ The unpredictability of the weather affected our plans.","note":"'Uninfluenceability' typically refers to a person's or entity's resistance to persuasion or pressure, not to physical forces like weather. 'Unpredictability' would be more appropriate in the context of weather."},{"incorrect":"✗ He showed a great uninfluenceability.","correct":"✓ He showed great uninfluenceability. / ✓ He showed a great lack of influenceability.","note":"While grammatically correct, 'a great uninfluenceability' is less common than 'great uninfluenceability' or 'a great lack of influenceability'."}],"priority":"★☆☆"},"related_words":{"derivatives":["uninfluenceable (adjective)","influence (verb, noun)","influenceability (noun)"],"related_terms":["stubbornness","obstinacy","inflexibility","resistance","steadfastness","determination","resoluteness"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (rare and specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Uninfluenceability' is a complex noun that describes the state of not being easily influenced. It is used in formal contexts to describe someone or something that is resistant to persuasion, pressure, or change. This word is not commonly used in everyday conversation and is more likely to appear in academic or professional writing. Understanding the word requires a strong vocabulary and the ability to grasp abstract concepts."},"example_sentences":[{"sentence":"The company's uninfluenceability to market trends led to its eventual downfall.","translation":"会社が市場のトレンドに影響されなかったことが、最終的な没落につながった。","type":"general","meaning_category":"Resistance to external forces"},{"sentence":"The judge's uninfluenceability ensured a fair trial.","translation":"裁判官が影響を受けなかったことで、公正な裁判が保証された。","type":"general","meaning_category":"Resistance to pressure"},{"sentence":"The philosopher valued uninfluenceability as a key virtue.","translation":"その哲学者は、影響を受けにくいことを重要な美徳として評価した。","type":"general","meaning_category":"Steadfastness"}]}