{"word":"Escots","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(historical) Scottish soldiers or guards, especially those serving in foreign armies or royal guards.","english_definition":"Scottish soldiers or guards, particularly those who served in foreign armies or royal guards during historical periods.","examples":[{"sentence":"The Escots formed a significant part of the French Royal Guard.","translation":"エスコッツはフランス王室警備隊の重要な一部を形成していました。"},{"sentence":"Many Scottish mercenaries, known as Escots, fought in various European conflicts.","translation":"エスコッツとして知られる多くのスコットランド人傭兵が、ヨーロッパの様々な紛争で戦いました。"}],"collocations":["French Escots","Royal Escots","Scottish Escots","Guard Escots"],"synonyms":["Scottish Guard","Scottish Soldiers","Mercenaries"],"antonyms":[]}],"etymology":{"value":"Derived from the French word 'Écossais,' meaning 'Scottish.' It refers specifically to Scottish soldiers or guards, especially those serving in foreign armies or royal guards.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛskɒts/","syllables":"Es-cots"},"inflection":{"noun_plural":"Escots"},"usage_notes":{"explanation":"'Escots' is primarily a historical term used to refer to Scottish soldiers, particularly those serving in foreign armies or royal guards. It is not commonly used in modern English, except in historical contexts. The term is closely associated with Scottish mercenaries and guards serving in France and other European countries.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The escots are guarding the building now.","correct":"✓ The guards are guarding the building now.","note":"Use 'guards' or 'soldiers' in modern contexts, not 'Escots.'"},{"incorrect":"✗ He is an escot.","correct":"✓ He was an escot. / ✓ He is a Scottish soldier.","note":"Use 'Scottish soldier' or 'guard' in modern contexts. 'Escot' is primarily historical."}],"priority":"★★☆"},"related_words":{"derivatives":["Écossais (French for Scottish)","Scottish","Scots"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily used in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Escots' is a historical term referring to Scottish soldiers, especially those serving in foreign armies or royal guards. It is not commonly used in modern English. The term is derived from the French word 'Écossais,' meaning 'Scottish.' It is mainly encountered in historical texts or discussions about Scottish military history. Understanding this term requires knowledge of historical military contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The French king relied on the Escots for his personal protection.","translation":"フランス王は、自身の身辺警護をエスコッツに頼っていました。","type":"noun","meaning_category":"Scottish soldiers in foreign service"},{"sentence":"Historical records mention the bravery of the Escots in battle.","translation":"歴史的記録は、戦闘におけるエスコッツの勇敢さを記しています。","type":"noun","meaning_category":"Scottish soldiers in historical context"}]}