{"word":"micromania","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"自己卑下症、自己矮小感、自分の能力や重要性を過小評価する精神状態","english_definition":"A mental disorder in which the patient believes that they are much smaller than they really are; a delusion of smallness. More generally, an obsessive preoccupation with one's own smallness or insignificance.","examples":[{"sentence":"His micromania led him to believe he was incapable of handling even simple tasks.","translation":"彼の自己卑下症は、簡単な仕事でさえこなせないと思い込ませた。"},{"sentence":"The therapist helped her overcome her micromania and recognize her true potential.","translation":"セラピストは彼女が自己卑下症を克服し、本当の潜在能力を認識するのを助けた。"}],"collocations":["suffer from micromania","overcome micromania","micromania symptoms","micromania treatment"],"synonyms":["self-deprecation","inferiority complex","feelings of inadequacy","self-doubt","low self-esteem"],"antonyms":["megalomania","grandiosity","narcissism","superiority complex"]}],"etymology":{"value":"From 'micro-' (small) + '-mania' (obsession, madness).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmaɪkroʊˈmeɪniə/","syllables":"mi-cro-ma-ni-a"},"inflection":{"noun_plural":"micromanias"},"usage_notes":{"explanation":"'Micromania' refers to a psychological condition characterized by an exaggerated sense of one's own smallness, insignificance, or unimportance. It can manifest as a delusion of being physically smaller than one is, or more commonly, as a persistent feeling of inadequacy and low self-worth. It is the opposite of megalomania, where individuals have delusions of grandeur and exaggerated self-importance. The term is relatively rare in everyday conversation but is used in psychology and psychiatry.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a micromania for collecting stamps.","correct":"✓ He has a mania for collecting stamps.","note":"'Micromania' is not simply a fondness for small things; it is a psychological condition. Use 'mania' for general obsessions. "},{"incorrect":"✗ Her micromania made her very arrogant.","correct":"✓ Her micromania made her very insecure.","note":"'Micromania' results in feelings of insecurity and inadequacy, not arrogance. Arrogance is more associated with megalomania."}],"priority":"★★☆"},"related_words":{"derivatives":["micromanic (adjective)"],"phrasal_verbs":[],"related_concepts":["inferiority complex","self-esteem","delusion","megalomania","narcissism"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Micromania' is a relatively rare and technical term used in psychology to describe a mental condition where a person has a persistent and exaggerated feeling of being small, insignificant, or inadequate. It's the opposite of megalomania, where someone has delusions of grandeur. Understanding this term requires a good grasp of psychological concepts and vocabulary. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The patient's micromania caused him to constantly undervalue his contributions at work.","translation":"その患者の自己卑下症は、仕事での貢献を常に過小評価させた。","type":"general","meaning_category":"psychological condition"},{"sentence":"She struggled with micromania, often feeling invisible and unimportant in social situations.","translation":"彼女は自己卑下症に苦しみ、社交的な場面でしばしば自分が目立たず重要でないと感じた。","type":"general","meaning_category":"psychological condition"}]}