{"word":"hocus-pocused","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(informal) arranged or adjusted to give a deceptive appearance; manipulated.","english_definition":"arranged or adjusted to give a deceptive appearance; manipulated, often in a way that is confusing or misleading.","examples":[{"sentence":"The company's financial statements were hocus-pocused to hide their losses.","translation":"その会社の財務諸表は、損失を隠すためにごまかされていた。"},{"sentence":"The data was hocus-pocused to support their claims.","translation":"そのデータは、彼らの主張を裏付けるために操作されていた。"}],"collocations":["hocus-pocused data","hocus-pocused statistics","hocus-pocused figures","hocus-pocused accounts"],"synonyms":["manipulated","falsified","doctored","rigged","cooked","deceptive","misleading"],"antonyms":["honest","truthful","accurate","transparent"]}],"etymology":{"value":"Derived from \"hocus-pocus,\" a pseudo-Latin phrase used by magicians, likely originating as a mock Eucharist phrase. The past participle \"hocus-pocused\" implies something has been subjected to deceptive manipulation, as if by magic.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhoʊkəsˈpoʊkəst/","syllables":"ho-cus-po-cused"},"inflection":{"notes":"Past participle of the verb 'hocus-pocus' used as an adjective."},"usage_notes":{"explanation":"The term \"hocus-pocused\" is typically used informally to describe situations where information, data, or accounts have been manipulated or presented in a misleading way to create a false impression. It carries a negative connotation, suggesting intentional deception or trickery. The term is relatively uncommon but can be effective in conveying the idea of something being deceptively altered.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The hocus-pocused magician performed on stage.","correct":"✓ The magician performed hocus-pocus on stage.","note":"'Hocus-pocused' is not used to describe the magician but the manipulated object or information. Use 'hocus-pocus' to describe the magician's actions."}],"priority":"★☆☆"},"related_words":{"derivatives":["hocus-pocus (noun: meaningless talk or activity, especially when designed to deceive; verb: deceive)"],"phrasal_verbs":[],"related_adjectives":["deceptive","manipulative","fraudulent"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'hocus-pocused' is a relatively uncommon term used to describe something that has been manipulated or adjusted in a deceptive way. It implies that the manipulation is intended to mislead or create a false impression. This word is more frequently used in informal contexts when discussing financial statements, data, or other types of information that have been altered to present a distorted view. Understanding the origin of the term from the magician's phrase 'hocus-pocus' can help grasp its meaning of trickery and deception."},"example_sentences":[{"sentence":"The company's earnings report was hocus-pocused to make it look more profitable than it actually was.","translation":"その会社の収益報告書は、実際よりも収益性が高く見えるようにごまかされていた。","type":"adjective","meaning_category":"deceptive"},{"sentence":"The politician accused his opponent of using hocus-pocused statistics to mislead voters.","translation":"その政治家は、対立候補が有権者を欺くために操作された統計を使用したと非難した。","type":"adjective","meaning_category":"manipulated"}]}