{"word":"Technophilia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"テクノフィリア（技術愛好症）：技術、特に新しい技術に対する強い愛情、熱意、または崇拝。","english_definition":"An enthusiasm for technology, especially new technology.","examples":[{"sentence":"His technophilia led him to buy every new gadget as soon as it was released.","translation":"彼のテクノフィリアによって、彼は新しいガジェットが発売されるとすぐに購入するようになった。"},{"sentence":"The company's culture is characterized by technophilia and a constant pursuit of innovation.","translation":"その会社の文化は、テクノフィリアと絶え間ないイノベーションの追求によって特徴づけられている。"}],"collocations":["exhibit technophilia","demonstrate technophilia","fueled by technophilia","driven by technophilia"],"synonyms":["technology enthusiasm","technology worship","tech-savviness","digital enthusiasm"],"antonyms":["technophobia","luddism","technology aversion","digital skepticism"]}],"etymology":{"value":"'Techno-' (technology) + '-philia' (love, attraction).","priority":"★★★"},"pronunciation":{"ipa":"/ˌteknəˈfɪliə/","syllables":"tech-no-phil-i-a"},"inflection":{"noun_plural":"technophilias"},"usage_notes":{"explanation":"Technophilia refers to a strong positive attitude towards technology. It's often associated with early adopters and those who are excited about the potential of new inventions. It can also describe a cultural or societal trend where technology is highly valued.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a technophile person.","correct":"✓ He is a technophile.","note":"Technophile can be used as a noun to describe a person who has technophilia."},{"incorrect":"✗ The technophilia is bad for society.","correct":"✓ Excessive technophilia can be bad for society.","note":"While technophilia is generally positive, excessive or uncritical enthusiasm for technology can have negative consequences."}],"priority":"★★☆"},"related_words":{"derivatives":["technophile (noun: a person who loves technology)","technophilic (adjective: characterized by technophilia)"],"phrases":["digital native","early adopter","innovation culture"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Technophilia' is a relatively uncommon word that describes a strong enthusiasm for technology. It's often used in discussions about technology trends, cultural attitudes towards technology, and the impact of technology on society. Understanding this word can help you comprehend nuanced discussions about the role of technology in modern life."},"example_sentences":[{"sentence":"The city's rapid development is driven by a strong sense of technophilia.","translation":"その都市の急速な発展は、強いテクノフィリアによって推進されている。","type":"general","meaning_category":"general"},{"sentence":"His technophilia made him an invaluable asset to the tech startup.","translation":"彼のテクノフィリアは、彼をそのテックスタートアップにとって非常に貴重な人材にした。","type":"general","meaning_category":"general"},{"sentence":"Some critics argue that technophilia can lead to a neglect of traditional skills.","translation":"一部の批評家は、テクノフィリアが伝統的なスキルの軽視につながる可能性があると主張している。","type":"critical","meaning_category":"critical"}]}