{"word":"unshunning","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(verb) to reverse the act of shunning; to cease avoiding or ostracizing someone.","english_definition":"To stop avoiding or ostracizing someone; to reverse the act of shunning.","examples":[{"sentence":"After years of estrangement, the community began unshunning the former outcast, welcoming him back into their fold.","translation":"長年の疎遠の後、コミュニティはかつての追放者を避けなくなり、彼を歓迎して迎え入れた。"},{"sentence":"The organization decided to unshun members who had previously violated its rules, hoping to foster a more inclusive environment.","translation":"その組織は、以前に規則に違反したメンバーを避けなくすることを決定し、より包括的な環境を育成することを望んだ。"}],"collocations":["unshun a person","unshun a member","begin unshunning","decide to unshun"],"synonyms":["welcome back","reintegrate","accept","embrace","include"],"antonyms":["shun","ostracize","avoid","exclude","reject"]},{"part_of_speech":"noun","definition":"(noun) the act of ceasing to shun someone; the reversal of ostracism.","english_definition":"The act of ceasing to shun someone; the reversal of ostracism.","examples":[{"sentence":"The unshunning was a significant step towards reconciliation within the group.","translation":"避けなくなったことは、グループ内の和解に向けた重要な一歩だった。"},{"sentence":"The process of unshunning required open dialogue and forgiveness from all parties involved.","translation":"避けなくなるプロセスには、関係者全員からの率直な対話と許しが必要だった。"}],"collocations":["act of unshunning","process of unshunning","ceremony of unshunning"],"synonyms":["reintegration","acceptance","inclusion","rehabilitation"],"antonyms":["shunning","ostracism","exclusion","rejection"]}],"etymology":{"value":"Derived from 'shunning,' by adding the prefix 'un-' to indicate the reversal of the action.","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈʃʌnɪŋ/","syllables":"un-shun-ning"},"inflection":{"verb_forms":{"present_simple":["unshun","unshuns"],"past_simple":"unshunned","past_participle":"unshunned","present_participle":"unshunning"},"noun_plural":"unshunnings"},"usage_notes":{"explanation":"'Unshunning' describes the action of reversing the practice of shunning, where someone is intentionally avoided or excluded. It implies a deliberate decision to reintegrate or accept someone back into a community or group. It is not a commonly used word, but it is understood in contexts where shunning is practiced.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They are unshunning of him.","correct":"✓ They are unshunning him.","note":"'Unshunning' as a verb takes a direct object. The preposition 'of' is not needed."},{"incorrect":"✗ The unshunning was very shunned by the community.","correct":"✓ The unshunning was welcomed by the community.","note":"The act of unshunning cannot be 'shunned.' It is the opposite of shunning, so it would be welcomed or accepted."}],"priority":"★★☆"},"related_words":{"derivatives":["shun","shunning"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Unshunning' is a relatively rare and complex term. It describes the act of reversing the practice of shunning, which involves intentionally avoiding or excluding someone. Understanding this term requires familiarity with the concept of shunning and the ability to recognize the function of the prefix 'un-' in reversing the meaning of a word. Due to its specific and uncommon usage, it is more likely to be encountered in advanced texts or discussions related to social dynamics and community practices."},"example_sentences":[{"sentence":"The Amish community's decision to begin unshunning the family signaled a move towards forgiveness and reconciliation.","translation":"アーミッシュコミュニティがその家族を避けなくなったという決定は、許しと和解に向けた動きを示していた。","type":"verb","meaning_category":"reversing ostracism"},{"sentence":"The unshunning ceremony was a powerful symbol of acceptance and reintegration.","translation":"避けなくなったことを示す儀式は、受け入れと再統合の強力な象徴だった。","type":"noun","meaning_category":"reversal of ostracism"}]}