{"word":"Apathism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"無感動主義、無関心主義","english_definition":"Indifference or lack of enthusiasm or concern.","examples":[{"sentence":"His apathism towards politics was evident in his refusal to vote.","translation":"彼の政治に対する無関心は、投票を拒否したことに明らかだった。"},{"sentence":"The rise of apathism among young people is a worrying trend.","translation":"若者の間で無関心主義が高まっているのは憂慮すべき傾向だ。"}],"collocations":["political apathism","social apathism"],"synonyms":["indifference","lethargy","passivity","unconcern","apathy"],"antonyms":["concern","interest","zeal","passion"]}],"etymology":{"value":"'Apathism' is derived from 'apathy,' with the suffix '-ism' added to denote a belief system or doctrine. 'Apathy' comes from the Greek word 'apathēs,' meaning 'without feeling' or 'passion.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈæpəθɪzəm/","syllables":"A-pa-thism"},"inflection":{"noun_plural":"Apathisms"},"usage_notes":{"explanation":"'Apathism' is a state of indifference or lack of interest, especially towards matters that others find important or stimulating. It is often used to describe a general lack of enthusiasm or concern for social, political, or moral issues. It is similar to 'apathy,' but 'apathism' often implies a more deliberate or ideological stance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed apathism for the suffering of others.","correct":"✓ He showed apathy for the suffering of others.","note":"'Apathy' is more commonly used to describe a general lack of feeling or concern, while 'apathism' is less frequent and implies a more ideological stance."},{"incorrect":"✗ Her apathism was caused by the medication.","correct":"✓ Her apathy was caused by the medication.","note":"In cases where the lack of feeling is a result of a medical condition or medication, 'apathy' is the more appropriate term."}],"priority":"★★☆"},"related_words":{"derivatives":["apathetic (adjective)","apathy (noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Apathism' is a relatively uncommon word that describes a state of indifference or lack of concern, often in relation to social or political issues. It is similar to 'apathy,' but implies a more deliberate or ideological position. The word is most likely to be encountered in academic or philosophical discussions."},"example_sentences":[{"sentence":"The philosopher argued that apathism is a dangerous mindset in a democratic society.","translation":"その哲学者は、無感動主義は民主主義社会において危険な考え方だと主張した。","type":"general","meaning_category":"無関心主義"},{"sentence":"The political party struggled to overcome the apathism of the electorate.","translation":"その政党は有権者の無関心主義を克服するのに苦労した。","type":"political","meaning_category":"無関心主義"},{"sentence":"Some critics view modern art as a reflection of societal apathism.","translation":"一部の評論家は、現代アートを社会の無関心主義の反映と見なしている。","type":"social","meaning_category":"無関心主義"}]}