{"word":"Wintun","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"ウィントゥン語族、またはウィントゥン語族に属する言語","english_definition":"A family of Native American languages spoken in central Northern California, or any language belonging to that family.","examples":[{"sentence":"The Wintun languages are related to other language families in California.","translation":"ウィントゥン語族は、カリフォルニアの他の語族と関連がある。"},{"sentence":"There are several distinct Wintun languages.","translation":"いくつかの異なるウィントゥン語が存在する。"}],"collocations":["Wintun language","Wintun people","Wintuan languages","Wintu language"],"synonyms":["Wintu","Wintuan"],"antonyms":[]},{"part_of_speech":"noun","definition":"ウィントゥン族、またはウィントゥン語を話す人々","english_definition":"A member of a group of Native American peoples who traditionally spoke Wintun languages.","examples":[{"sentence":"The Wintun people lived in the Sacramento Valley.","translation":"ウィントゥン族はサクラメントバレーに住んでいた。"},{"sentence":"The Wintun had a rich culture and traditions.","translation":"ウィントゥン族は豊かな文化と伝統を持っていた。"}],"collocations":["Wintun tribe","Wintun culture","Wintun territory","Wintu people"],"synonyms":["Wintu"],"antonyms":[]},{"part_of_speech":"adjective","definition":"ウィントゥン語族の、ウィントゥン族の","english_definition":"Relating to the Wintun languages or the Wintun people.","examples":[{"sentence":"Wintun mythology is fascinating.","translation":"ウィントゥン族の神話は魅力的だ。"},{"sentence":"Wintun territory once covered a large area.","translation":"かつてウィントゥン族の領土は広大な地域を覆っていた。"}],"collocations":["Wintun mythology","Wintun territory","Wintun traditions","Wintun language"],"synonyms":["Wintu"],"antonyms":[]}],"etymology":{"value":"The origin of the word 'Wintun' is from the Wintun languages themselves, meaning 'people'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɪntuːn/","syllables":"Win-tun"},"inflection":{"notes":"This word can function as a noun (singular or plural) or an adjective, and does not have typical inflections like verb conjugations."},"usage_notes":{"explanation":"'Wintun' can refer to the language family, a specific language within that family, the people who speak or spoke these languages, or something related to these languages or people. It's important to consider the context to understand the intended meaning. 'Wintu' is sometimes used as a synonym, particularly for a specific language and the people who speak it.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Wintuns is a language.","correct":"✓ Wintun is a language family.","note":"Wintun is a language family, not a single language. To refer to a single language, you might use 'Wintu' or another specific language name within the Wintun family."},{"incorrect":"✗ I speak Wintunese.","correct":"✓ I speak Wintu.","note":"There is no language called 'Wintunese'. The language is called Wintu or another specific Wintun language."}],"priority":"★★☆"},"related_words":{"derivatives":["Wintu (synonym, often used for a specific language and people)","Wintuan (synonym, often used for the language family)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. This term is specific to a particular group of people and languages in California.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Wintun' is a term referring to a group of Native American people and their languages in California. The word itself comes from the Wintun languages and means 'people'. It can be used as a noun to refer to the people or the languages, or as an adjective to describe something related to them. Because it's a specific cultural and linguistic term, it's not commonly used outside of contexts discussing California Native American history, culture, or linguistics.","priority":"★★☆"},"example_sentences":[{"sentence":"The Wintun people traditionally lived along the Sacramento River.","translation":"ウィントゥン族は伝統的にサクラメント川沿いに住んでいた。","type":"noun","meaning_category":"People"},{"sentence":"Linguists study the Wintun language family to understand its relationship to other California languages.","translation":"言語学者は、ウィントゥン語族を研究して、他のカリフォルニアの言語との関係を理解しようとしている。","type":"noun","meaning_category":"Language Family"},{"sentence":"Wintun basketry is known for its intricate designs.","translation":"ウィントゥン族のバスケット作りは、その複雑なデザインで知られている。","type":"adjective","meaning_category":"Relating to the Wintun"},{"sentence":"The Wintu language is endangered.","translation":"ウィントゥ語は絶滅の危機に瀕している。","type":"noun","meaning_category":"Language (specific)"}]}