{"word":"wood-fermented","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"木桶で発酵させた","english_definition":"Fermented in wooden vessels, typically barrels or vats.","examples":[{"sentence":"This Chardonnay is wood-fermented to add complexity and depth of flavor.","translation":"このシャルドネは、複雑さと深みを加えるために木桶で発酵させています。"},{"sentence":"The brewery uses wood-fermented techniques to create unique and flavorful beers.","translation":"その醸造所は、ユニークで風味豊かなビールを作るために木桶発酵の技術を使用しています。"}],"collocations":["wood-fermented wine","wood-fermented beer","wood-fermented sake","barrel-fermented","oak-fermented"],"synonyms":["barrel-aged","oak-aged","vat-fermented"],"antonyms":["stainless steel-fermented","tank-fermented"]}],"etymology":{"value":"The term combines \"wood,\" referring to the wooden vessels used, and \"fermented,\" the process of converting sugars into alcohol or acids using microorganisms.","priority":"N/A"},"pronunciation":{"ipa":"/wʊd fərˈmɛntɪd/","syllables":"wood-fer-ment-ed"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"\"Wood-fermented\" describes a fermentation process where the liquid (wine, beer, sake, etc.) is fermented in wooden containers. This process can impart unique flavors and aromas to the final product, influenced by the type of wood used (e.g., oak, acacia) and the previous contents of the vessel. It is often associated with traditional or artisanal production methods.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The wine was fermented with wood.","correct":"✓ The wine was wood-fermented.","note":"Using \"wood-fermented\" as a compound adjective is more concise and idiomatic than saying \"fermented with wood.\""}],"priority":"N/A"},"related_words":{"derivatives":["fermentation","ferment","barrel","oak","vat"],"phrasal_verbs":["N/A"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Commonly used in the context of wine, beer, and sake production.","priority":"N/A"},"readability_explanation":{"level":"B2","text":"\"Wood-fermented\" is a term used to describe a specific winemaking or brewing technique. It means that the fermentation process, where yeast converts sugars into alcohol, takes place in wooden containers, such as barrels or vats. This method can add complexity and unique flavors to the final product, as the wood can impart its own characteristics. You'll often see this term used in descriptions of wines, beers, and some types of sake."},"example_sentences":[{"sentence":"The winery's signature Chardonnay is exclusively wood-fermented.","translation":"そのワイナリーの代表的なシャルドネは、木桶発酵のみで作られています。","type":"adjective","meaning_category":"descriptive"},{"sentence":"Many craft breweries are experimenting with wood-fermented sour beers.","translation":"多くのクラフトビール醸造所が、木桶発酵のサワービールを試作しています。","type":"adjective","meaning_category":"descriptive"}]}