{"word":"nonadjournment","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"休会しないこと、延期しないこと","english_definition":"The act or state of not adjourning; the continuation of a meeting or session without a break or postponement.","examples":[{"sentence":"The committee decided on nonadjournment to complete the urgent business.","translation":"委員会は緊急の業務を完了させるために、休会しないことを決定した。"},{"sentence":"Due to the critical nature of the discussions, a motion for nonadjournment was proposed.","translation":"議論の重大な性質から、休会しない動議が提案された。"}],"collocations":["motion for nonadjournment","decide on nonadjournment"],"synonyms":["continuation","non-postponement","non-recess"],"antonyms":["adjournment","recess","postponement"]}],"etymology":{"value":"\"non-\" (否定) + \"adjournment\" (休会、延期)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnədˈdʒɜːnmənt/","syllables":"non-ad-journ-ment"},"inflection":{"noun_plural":"nonadjournments"},"usage_notes":{"explanation":"\"Nonadjournment\" is a formal term, often used in legal, parliamentary, or official contexts. It indicates a deliberate decision to continue a meeting or session without interruption, typically due to the urgency or importance of the matters being discussed. It is the direct opposite of \"adjournment,\" which means to suspend or end a meeting with the intention of resuming it later.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonadjournment was very long.","correct":"✓ The session of nonadjournment was very long.","note":"\"Nonadjournment\" refers to the *act* of not adjourning, not the session itself. To describe the length of the session, specify 'session of nonadjournment' or similar. "},{"incorrect":"✗ They nonadjourned the meeting.","correct":"✓ They decided on nonadjournment for the meeting.","note":"\"Nonadjournment\" is primarily a noun. Use it with verbs like 'decide on,' 'motion for,' etc., rather than directly as a verb."}],"priority":"★★☆"},"related_words":{"derivatives":["adjourn (verb)","adjournment (noun)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Nonadjournment\" is a relatively rare and formal term that means not adjourning or postponing something, typically a meeting or session. It is most often encountered in legal, parliamentary, or other official contexts where the uninterrupted continuation of proceedings is deemed necessary. Understanding this term requires a strong vocabulary and familiarity with formal meeting procedures."},"example_sentences":[{"sentence":"The board voted for nonadjournment to finalize the budget before the deadline.","translation":"理事会は締め切り前に予算を確定させるため、休会しないことを決議した。","type":"noun","meaning_category":"休会しないこと"},{"sentence":"A request for nonadjournment was made by the lead negotiator to expedite the treaty signing.","translation":"条約署名を迅速化するため、主任交渉官から休会しないように要請があった。","type":"noun","meaning_category":"休会しないこと"}]}