{"word":"Secondness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(哲学) 第二性、二次性：第一性（Firstness）に対する、経験や関係性を通して生じる質や性質。","english_definition":"(Philosophy) The quality of being second; in Peircean semiotics, the category of brute reaction, experience, or facticity, in contrast to Firstness (possibility) and Thirdness (mediation).","examples":[{"sentence":"Peirce described Secondness as the realm of dyadic relations, where one thing acts upon another.","translation":"パースは第二性を二項関係の領域として記述し、あるものが別のものに作用するところとしました。"},{"sentence":"The feeling of resistance when pushing against a wall is an example of Secondness.","translation":"壁を押すときの抵抗感は、第二性の例です。"},{"sentence":"Secondness involves the brute facts of experience, such as pain, surprise, and effort.","translation":"第二性は、痛み、驚き、努力など、経験の生の事実を含みます。"}],"collocations":["Peircean Secondness","dyadic relation","brute fact","experience of resistance"],"synonyms":["reaction","facticity","experience","opposition","duality"],"antonyms":["Firstness","Thirdness"]}],"etymology":{"value":"派生語: second + -ness (名詞接尾辞、状態や性質を示す)","note":"The term 'Secondness' is primarily used within the context of Charles Sanders Peirce's philosophy of semiotics and phenomenology. It refers to one of the three fundamental categories of being or experience.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsekəndnəs/","syllables":"sec-ond-ness"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Secondness' is a technical term in philosophy, particularly within the semiotic theory of Charles Sanders Peirce. It describes the realm of actual existence, where things interact and exert influence on one another. It is characterized by brute facts, resistance, and dyadic relationships. It is contrasted with 'Firstness,' which is the realm of pure possibility and quality, and 'Thirdness,' which is the realm of mediation, law, and habit.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Secondness is about abstract ideas and possibilities.","correct":"✓ Secondness is about concrete experiences and reactions.","note":"Secondness is not about abstract ideas but rather about concrete experiences and reactions to external forces or events."},{"incorrect":"✗ Secondness is the same as duality in general.","correct":"✓ Secondness is a specific philosophical concept related to experience and reaction.","note":"While Secondness involves duality, it's a specific philosophical concept within Peirce's system, not just any form of duality."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_concepts":["Firstness","Thirdness","Peircean semiotics","phenomenology","semiotics","sign theory","dyadic relation"],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Very low frequency. Primarily used in academic philosophical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Secondness' is a highly specialized philosophical term used primarily in the context of Charles Sanders Peirce's semiotics. Understanding it requires familiarity with Peircean terminology and concepts. It refers to the category of experience, reaction, and brute fact, in contrast to the categories of possibility (Firstness) and mediation (Thirdness). It is typically encountered in advanced philosophical texts and discussions.","priority":"★☆☆"},"example_sentences":[{"sentence":"The experience of bumping into a wall illustrates the concept of Secondness.","translation":"壁にぶつかる経験は、第二性の概念を示しています。","type":"definition","meaning_category":"Philosophical concept"},{"sentence":"Secondness is characterized by the feeling of resistance and the awareness of external forces.","translation":"第二性は、抵抗感と外部の力への認識によって特徴付けられます。","type":"description","meaning_category":"Philosophical concept"},{"sentence":"Without Secondness, there would be no distinction between subjective feeling and objective reality.","translation":"第二性がなければ、主観的な感情と客観的な現実の区別は存在しないでしょう。","type":"explanation","meaning_category":"Philosophical concept"}]}