{"word":"cryoablation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"冷凍アブレーション、冷凍凝固療法","english_definition":"A medical procedure that uses extreme cold to freeze and destroy diseased tissue, including cancer cells.","examples":[{"sentence":"Cryoablation is a minimally invasive treatment option for some types of cancer.","translation":"冷凍アブレーションは、一部の種類の癌に対する低侵襲治療の選択肢です。"},{"sentence":"The doctor recommended cryoablation to treat the tumor in my kidney.","translation":"医師は、私の腎臓の腫瘍を治療するために冷凍アブレーションを勧めました。"}],"collocations":["cryoablation of the prostate","cryoablation procedure","renal cryoablation","liver cryoablation"],"synonyms":["cryosurgery","cryotherapy","freezing ablation"],"antonyms":[]}],"etymology":{"value":"The word 'cryoablation' is derived from 'cryo-' (Greek 'κρύος' meaning 'icy cold') and 'ablation' (Latin 'ablatio' meaning 'carrying away, removal').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkraɪ.oʊ.æˈbleɪ.ʃən/","syllables":"cry-o-a-bla-tion"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Cryoablation is a technique used to treat various medical conditions, most notably certain types of cancer. It involves inserting a probe into the tissue to be destroyed and then freezing it. The freezing process causes the cells to die. It is often used as a minimally invasive alternative to traditional surgery.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The cryoablation was painless, but I felt a little freeze.","correct":"✓ The cryoablation was painless, but I felt a little cold.","note":"'Freeze' is a verb or noun referring to the process of freezing or a state of being frozen. 'Cold' is the adjective to describe the sensation."}],"priority":"★★☆"},"related_words":{"derivatives":["cryoablative (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cryoablation' is a specialized medical term referring to a procedure that uses freezing to destroy tissue. It is typically encountered in medical contexts or discussions about cancer treatment options. Understanding this term requires some familiarity with medical terminology."},"example_sentences":[{"sentence":"Cryoablation is being used to treat early-stage breast cancer in some patients.","translation":"冷凍アブレーションは、一部の患者の早期乳癌の治療に使用されています。","type":"noun","meaning_category":"medical procedure"},{"sentence":"Following the cryoablation, the patient experienced minimal scarring.","translation":"冷凍アブレーション後、患者は最小限の瘢痕を経験しました。","type":"noun","meaning_category":"medical procedure"}]}