{"word":"manusina","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Samoan language) A type of traditional Samoan house, typically oval in shape, with an open design and thatched roof.","english_definition":"(Samoan language) A traditional Samoan house, usually oval, with an open structure and a thatched roof.","examples":[{"sentence":"The family gathered in their manusina to share a meal.","translation":"家族は食事を分かち合うためにマヌシナに集まりました。"},{"sentence":"The village elder oversaw the construction of the new manusina.","translation":"村の長老が新しいマヌシナの建設を監督しました。"}],"collocations":["build a manusina (マヌシナを建てる)","live in a manusina (マヌシナに住む)","traditional manusina (伝統的なマヌシナ)"],"synonyms":["fale (Samoan for house)"],"antonyms":[]}],"etymology":{"value":"From the Samoan language. The etymology of the word itself within Samoan is not widely documented in readily available sources.","priority":"★☆☆"},"pronunciation":{"ipa":"/maːnuːˈsiːna/","syllables":"ma-nu-si-na"},"inflection":{"notes":"Noun, plural form is likely 'manusina' as well, following Samoan noun pluralization patterns."},"usage_notes":{"explanation":"The term 'manusina' specifically refers to a traditional Samoan house. It's a cultural term, and its use is primarily within the context of Samoan culture and language. It is important to use this term respectfully and in appropriate contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They built a modern house with a manusina roof.","correct":"✓ They built a modern house with a thatched roof.","note":"'Manusina' refers to the entire traditional house, not just the roof. Use 'thatched roof' to describe the roof material on a modern house."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily within Samoan cultural contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Manusina' is a culturally specific term from the Samoan language, referring to a traditional type of Samoan house. Understanding its meaning requires familiarity with Samoan culture. It is not a widely used word outside of this context. Its usage should be limited to discussions about Samoan culture, architecture, or related topics."},"example_sentences":[{"sentence":"The children played under the shade of the manusina.","translation":"子供たちはマヌシナの陰で遊んだ。","type":"noun","meaning_category":"Traditional Samoan house"},{"sentence":"The village meeting was held inside the largest manusina.","translation":"村の会議は一番大きなマヌシナの中で行われた。","type":"noun","meaning_category":"Traditional Samoan house"}]}