{"word":"duplexers","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(電気通信) デュプレクサ: 送信機と受信機が同じアンテナを共有できるようにする電子回路。","english_definition":"(telecommunications) An electronic device that allows bidirectional (duplex) communication over a single path, such as an antenna. It isolates the transmitter and receiver while permitting them to use a common antenna.","examples":[{"sentence":"Duplexers are essential components in radar systems.","translation":"デュプレクサはレーダーシステムに不可欠な部品です。"},{"sentence":"The base station uses a duplexer to transmit and receive signals simultaneously.","translation":"基地局はデュプレクサを使用して、信号を同時に送受信します。"},{"sentence":"Without a duplexer, the strong transmit signal would damage the sensitive receiver.","translation":"デュプレクサがないと、強力な送信信号が敏感な受信機を損傷する可能性があります。"}],"collocations":["antenna duplexer (アンテナデュプレクサ)","radar duplexer (レーダーデュプレクサ)","RF duplexer (RFデュプレクサ)","transmit-receive switch (送受信スイッチ)"],"synonyms":["circulator","isolator","diplexer"],"antonyms":[]}],"etymology":{"value":"\"Duplex\" (双方向の) + \"-er\" (名詞を作る接尾辞)。送信と受信を同時に行う双方向通信を可能にする装置であることから。","priority":"★★★"},"pronunciation":{"ipa":"/ˈduːplɛksərz/","syllables":"Du-plex-ers"},"inflection":{"noun_plural":"duplexers"},"usage_notes":{"explanation":"Duplexers are commonly used in radio communication systems, radar systems, and other applications where simultaneous transmission and reception are required using a single antenna. They prevent the transmitter's high-power signal from damaging the receiver while allowing both to operate efficiently.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The diplexer allows only one-way communication.","correct":"✓ The duplexer allows two-way communication.","note":"A diplexer combines or separates signals of different frequencies, but a duplexer allows simultaneous two-way communication on the same frequency."},{"incorrect":"✗ Duplexer is used to amplify the signal.","correct":"✓ Duplexer is used to isolate the transmitter and receiver.","note":"A duplexer's primary function is isolation, not amplification."}],"priority":"★★☆"},"related_words":{"derivatives":["duplex (形容詞: 双方向の; 名詞: 二世帯住宅)","duplexity (名詞: 双方向性)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"低頻度 (Low frequency) - 特定の技術分野で使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"duplexer\" refers to a specialized electronic component utilized in systems requiring simultaneous two-way communication via a single antenna. Its function is to isolate the transmitter and receiver circuits, preventing damage from the high-power transmission signal while enabling efficient reception. This is crucial in applications like radar and cellular base stations. Understanding its role requires some technical knowledge of radio frequency (RF) engineering.","priority":"★★☆"},"example_sentences":[{"sentence":"The **duplexers** in the cell tower enable simultaneous voice and data transmission.","translation":"携帯電話基地局のデュプレクサは、音声とデータの同時送信を可能にします。","type":"noun","meaning_category":"電気通信"},{"sentence":"Modern radar systems rely on high-performance **duplexers** for efficient target detection.","translation":"最新のレーダーシステムは、効率的な目標検出のために高性能なデュプレクサに依存しています。","type":"noun","meaning_category":"電気通信"},{"sentence":"The design of **duplexers** must minimize signal loss and maximize isolation.","translation":"デュプレクサの設計は、信号損失を最小限に抑え、アイソレーションを最大化する必要があります。","type":"noun","meaning_category":"電気通信"}]}