{"word":"Stinkwood","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(南アフリカ産の)ニオイザクラ属の木、特に Ocotea bullata","english_definition":"Any of various trees of the genus Ocotea, especially Ocotea bullata, native to South Africa, known for their strong odor when freshly cut.","examples":[{"sentence":"The table was made of solid Stinkwood.","translation":"そのテーブルは頑丈なStinkwoodで作られていた。"},{"sentence":"Stinkwood is prized for its beautiful grain and durability.","translation":"Stinkwoodはその美しい木目と耐久性で珍重されている。"}],"collocations":["Stinkwood furniture","Stinkwood tree","Black Stinkwood","White Stinkwood"],"synonyms":["Ocotea bullata"],"antonyms":[]}],"etymology":{"value":"The name \"Stinkwood\" comes from the strong, unpleasant odor emitted by the wood when it is freshly cut or worked.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstɪŋk.wʊd/","syllables":"stink-wood"},"inflection":{"noun_plural":"Stinkwoods"},"usage_notes":{"explanation":"\"Stinkwood\" typically refers to the Ocotea bullata tree found in South Africa. The name is derived from the strong smell of the freshly cut wood. It is a valuable timber used in furniture making and construction.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a furniture made of stink wood.","correct":"✓ I bought a piece of furniture made of Stinkwood.","note":"\"Stinkwood\" is a proper noun referring to a specific type of wood, so it should be capitalized. Also, \"furniture\" is usually uncountable, so use \"a piece of furniture\"."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Ocotea","timber","hardwood"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Stinkwood\" is a specialized term primarily used in the context of South African forestry and woodworking. Understanding requires familiarity with tree species and timber terminology. It is not commonly encountered in general English conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"Antique furniture made from Stinkwood is highly sought after by collectors.","translation":"Stinkwood製のアンティーク家具はコレクターに非常に人気がある。","type":"noun","meaning_category":"ニオイザクラ属の木"},{"sentence":"The aroma of freshly sawn Stinkwood filled the workshop.","translation":"切りたてのStinkwoodの香りが作業場に満ちていた。","type":"noun","meaning_category":"ニオイザクラ属の木"}]}