{"word":"kilogrammetre","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"キログラムメートル：仕事またはエネルギーのメートル・キログラム・秒単位系（MKS単位系）における単位。1キログラムの質量を1メートルの高さまで持ち上げるのに必要な仕事量にほぼ等しい。","english_definition":"A unit of work or energy in the metre-kilogram-second system (MKS unit system), approximately equal to the work required to raise a mass of one kilogram a height of one metre.","examples":[{"sentence":"The potential energy of the object was calculated in kilogrammetres.","translation":"その物体のポテンシャルエネルギーはキログラムメートルで計算された。"}],"collocations":["measure in kilogrammetre","convert to joules"],"synonyms":["kgm","kilogram-metre","kilogram meter"],"antonyms":[],"notes":"This unit is largely obsolete, having been replaced by the joule (J) in the International System of Units (SI)."}],"etymology":{"value":"Derived from 'kilogram' and 'metre', indicating the units used in the measurement.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɪləˌɡræmˌmiːtər/","syllables":"ki-lo-gram-me-tre"},"inflection":{"noun_plural":"kilogrammetres"},"usage_notes":{"explanation":"The kilogrammetre is a unit of energy or work, but it is not part of the modern SI system. It is mostly used in historical contexts or specific engineering fields. The modern standard unit is the joule.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Use kilogrammetre instead of joule.","correct":"✓ Use joule instead of kilogrammetre.","note":"The joule is the standard unit in most scientific and engineering contexts."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_units":["joule","newton-metre","erg"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - mostly found in technical or historical texts.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'kilogrammetre' refers to a unit of energy or work, specifically the amount of work needed to lift one kilogram by one metre against gravity. This unit is not commonly used in modern science or engineering, where the joule is preferred. It's more likely to be encountered in older texts or specialized contexts. Understanding this term requires a background in physics and mechanics."},"example_sentences":[{"sentence":"The energy required to lift the weight was measured in kilogrammetres.","translation":"その重りを持ち上げるのに必要なエネルギーはキログラムメートルで測定された。","type":"general","meaning_category":"Energy measurement"}]}