{"word":"predisordered","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(医学) (遺伝的または他の要因により) 特定の疾患または状態にかかりやすい、またはその素因を持つ","english_definition":"(medicine) having a predisposition to a particular disease or condition, whether genetic or otherwise; having a pre-existing disorder.","examples":[{"sentence":"Individuals with a family history of heart disease are considered predisordered to cardiovascular problems.","translation":"心臓病の家族歴がある人は、心血管系の問題にかかりやすいと考えられています。"},{"sentence":"The study examined whether certain genetic markers indicated that individuals were predisordered to develop schizophrenia.","translation":"その研究では、特定の遺伝子マーカーが、個人が統合失調症を発症しやすいことを示しているかどうかを調査しました。"},{"sentence":"Patients who are predisordered to anxiety may benefit from early intervention strategies.","translation":"不安になりやすい患者は、早期介入戦略から恩恵を受ける可能性があります."}],"collocations":["predisordered to (disease/condition)","genetically predisordered","predisordered individuals","predisordered patients"],"synonyms":["susceptible","prone","vulnerable","at risk","inclined"],"antonyms":["immune","resistant","protected"]}],"etymology":{"value":"\"pre-\" (前に) + \"disordered\" (疾患のある、混乱した) から構成される。つまり、ある疾患または状態に事前に（生まれつき、または後天的に）なりやすい状態を指す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːdɪsˈɔːrdərd/","syllables":"pre-dis-or-dered"},"inflection":{"adjective_forms":{"comparative":"more predisordered","superlative":"most predisordered"}},"usage_notes":{"explanation":"\"**predisordered**\" は、医学または心理学の文脈でよく使用される形容詞であり、個人が特定の疾患または状態を発症するリスクが高いことを示します。これは、遺伝的要因、環境要因、またはライフスタイルの選択の結果である可能性があります。この用語は、特定の疾患または状態がまだ存在しないが、発症する可能性が高いことを強調するために使用されます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The predisordered person already has the disease.","correct":"✓ The predisordered person is at a higher risk of developing the disease.","note":"\"predisordered\" は、疾患がすでに存在することを示唆するのではなく、疾患を発症するリスクが高いことを意味します。"},{"incorrect":"✗ Predisordered is a noun.","correct":"✓ Predisordered is an adjective.","note":"\"predisordered\" は形容詞であり、名詞ではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":["predisposition (名詞: 素因、傾向)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 医学または心理学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"**Predisordered**\" is a term primarily used in medical and psychological contexts. It describes a state where an individual has an increased likelihood of developing a specific disease or condition due to genetic, environmental, or lifestyle factors. It's important to note that being \"predisordered\" does not mean the disease is already present, but rather that the person is at a higher risk of developing it in the future. This term is more commonly found in scientific literature and discussions related to health and medicine."},"example_sentences":[{"sentence":"Studies have shown that individuals can be predisordered to develop certain mental health conditions, such as depression or anxiety, due to a combination of genetic and environmental factors.","translation":"研究によると、遺伝的要因と環境的要因の組み合わせにより、個人がうつ病や不安などの特定の精神衛生状態を発症しやすいことが示されています。","type":"adjective","meaning_category":"医学"},{"sentence":"If a patient is predisordered to heart disease, lifestyle changes such as diet and exercise can help reduce their risk.","translation":"患者が心臓病にかかりやすい場合、食事や運動などのライフスタイルの変化はリスクを軽減するのに役立ちます。","type":"adjective","meaning_category":"医学"},{"sentence":"Although she was predisordered to allergies, she managed to avoid most triggers through careful management of her environment.","translation":"彼女はアレルギーにかかりやすかったが、環境を注意深く管理することで、ほとんどの誘因を回避することができた。","type":"adjective","meaning_category":"医学"}]}