{"word":"diastematomyelia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"二分脊髄症","english_definition":"A congenital disorder in which the spinal cord is split into two hemicords, each contained within its own dural sac, often separated by a bony or cartilaginous spur.","examples":[{"sentence":"Diastematomyelia is often associated with other spinal abnormalities.","translation":"二分脊髄症はしばしば他の脊椎異常と関連している。"},{"sentence":"Surgical intervention may be necessary to correct diastematomyelia and prevent neurological deficits.","translation":"二分脊髄症を矯正し、神経学的欠損を防ぐためには外科的介入が必要となる場合がある。"}],"collocations":[],"synonyms":["split cord malformation"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'diastema' (space, interval), 'myelo' (spinal cord), and 'elia' (condition).","priority":"★★★"},"pronunciation":{"ipa":"/ˌdaɪˌæstɪmətoʊmaɪˈiːliə/","syllables":"di-a-ste-ma-to-my-e-li-a"},"inflection":{"noun_plural":"diastematomyelias"},"usage_notes":{"explanation":"Diastematomyelia is a rare spinal dysraphism characterized by a longitudinal split of the spinal cord. Diagnosis typically involves imaging techniques such as MRI or CT myelography. Treatment may involve surgical removal of the bony spur and reconstruction of the dural sac.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":[],"related_medical_terms":["spinal dysraphism","tethered cord syndrome","scoliosis"]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"Diastematomyelia is a highly specialized medical term referring to a rare congenital condition. Understanding this term requires a strong background in medical terminology and anatomy. It is not commonly encountered outside of medical contexts."},"example_sentences":[{"sentence":"The pediatric neurologist suspected diastematomyelia based on the patient's clinical presentation and imaging studies.","translation":"小児神経科医は、患者の臨床症状と画像検査に基づいて二分脊髄症を疑った。","type":"medical","meaning_category":"congenital disorder"},{"sentence":"Early diagnosis and treatment of diastematomyelia are crucial to minimize long-term neurological complications.","translation":"二分脊髄症の早期診断と治療は、長期的な神経学的合併症を最小限に抑えるために重要である。","type":"medical","meaning_category":"congenital disorder"}]}