{"word":"subtribe","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"亜族 (生物学における分類階級の一つで、族の下、属の上に位置する)","english_definition":"(in zoology) a taxonomic rank below tribe and above genus.","examples":[{"sentence":"The subtribe is used to further classify the genera within the tribe.","translation":"亜族は、族内の属をさらに分類するために使用されます。"},{"sentence":"This genus belongs to a specific subtribe based on its morphological characteristics.","translation":"この属は、その形態学的特徴に基づいて特定の亜族に属します。"}],"collocations":["belong to a subtribe","classify into a subtribe","members of the subtribe"],"synonyms":["none (due to its specific taxonomic nature)"],"antonyms":["tribe","genus"]},{"part_of_speech":"noun","definition":"(社会学・人類学) 部族の下位区分、小部族","english_definition":"a subdivision of a tribe, especially in anthropology or sociology.","examples":[{"sentence":"The subtribe maintained its unique cultural practices within the larger tribal structure.","translation":"その小部族は、より大きな部族構造の中で独自の文化的慣習を維持していました。"},{"sentence":"Conflicts sometimes arose between different subtribes within the same tribe.","translation":"同じ部族内の異なる小部族間で紛争が起こることがありました。"}],"collocations":["within the subtribe","between subtribes","a subtribe of the tribe"],"synonyms":["clan","segment","faction"],"antonyms":["tribe"]}],"etymology":{"value":"prefix 'sub-' (meaning 'below' or 'subordinate') + 'tribe'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsʌbˌtraɪb/","syllables":"sub-tribe"},"inflection":{"noun_plural":"subtribes"},"usage_notes":{"explanation":"The term 'subtribe' is primarily used in biological taxonomy to classify organisms below the level of a tribe and above the level of a genus. It is also used in social sciences like anthropology and sociology to refer to subdivisions within a tribe, often based on kinship, shared customs, or geographical location. The biological and social science usages are distinct but share the common concept of a hierarchical subdivision.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The subtribe is bigger than the tribe.","correct":"✓ The subtribe is smaller than the tribe.","note":"A subtribe is a subdivision of a tribe, so it is smaller, not bigger."}],"priority":"★★☆"},"related_words":{"derivatives":["subtribal (adjective)"],"related_terms":["tribe","genus","family","order","class","phylum","kingdom","domain"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (technical vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Subtribe' is a relatively specialized term. In biology, it refers to a specific rank in the classification of living things, positioned between 'tribe' and 'genus'. Outside of biology, particularly in anthropology or sociology, it can refer to a smaller group within a larger tribe, often based on shared customs or kinship. Understanding the context is key to interpreting the meaning of 'subtribe'."},"example_sentences":[{"sentence":"The primate genus *Papio* is classified within the subtribe Papionina.","translation":"霊長類の属 *Papio* は、パピオ亜族に分類されます。","type":"noun","meaning_category":"Biological classification"},{"sentence":"The anthropologist studied the social structure of the subtribe within the larger community.","translation":"人類学者は、より大きなコミュニティ内の小部族の社会構造を研究しました。","type":"noun","meaning_category":"Social subdivision"}]}