{"word":"Ismaelism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"イスマーイール派","english_definition":"A branch of Shia Islam that accepts Isma'il ibn Jafar as the seventh Imam; also, the doctrines and practices of this branch.","examples":[{"sentence":"Ismaelism is one of the major branches of Shia Islam.","translation":"イスマーイール派はシーア派イスラームの主要な分派の一つです。"},{"sentence":"Followers of Ismaelism are called Ismailis.","translation":"イスマーイール派の信徒はイスマーイーリーと呼ばれます。"}],"collocations":["Shia Ismaelism","Fatimid Ismaelism","Nizari Ismaelism"],"synonyms":["Ismaili Shia","Seveners"],"antonyms":[]}],"etymology":{"value":"Derived from the name Isma'il ibn Jafar, who was recognized by this branch as the seventh Imam.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɪzmeɪəˌlɪzəm/","syllables":"Is-ma-e-lism"},"inflection":{},"usage_notes":{"explanation":"Ismaelism is a significant branch within Shia Islam, distinguished by its acceptance of Isma'il ibn Jafar as the seventh Imam in the succession from Ali. It has diverse sub-branches and historical periods, including the Fatimid Caliphate and the Nizari Ismailis (also known as the Assassins). The doctrines of Ismaelism often involve esoteric interpretations of the Quran and Islamic teachings.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Ismaelism is a Sunni branch.","correct":"✓ Ismaelism is a Shia branch.","note":"Ismaelism is a branch of Shia Islam, not Sunni Islam."}],"priority":"★☆☆"},"related_words":{"derivatives":["Ismaili (noun, adjective)","Ismailite (noun, adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ismaelism' refers to a specific branch of Shia Islam. Understanding this term requires familiarity with Islamic history and religious divisions. The term is primarily used in academic or religious contexts when discussing the different branches of Islam.","priority":"★★☆"},"example_sentences":[{"sentence":"The Aga Khan is the spiritual leader of the Nizari Ismaili community, a major branch of Ismaelism.","translation":"アーガー・ハーンは、イスマーイール派の主要な分派であるニザール・イスマーイーリー共同体の精神的指導者です。","type":"general","meaning_category":"religious branch"},{"sentence":"Historical studies often focus on the role of Ismaelism in the Fatimid Caliphate.","translation":"歴史研究は、しばしばファーティマ朝におけるイスマーイール派の役割に焦点を当てます。","type":"historical","meaning_category":"historical role"}]}