{"word":"cardiotocography","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"胎児心拍数陣痛図、CTG","english_definition":"A technical method of recording the fetal heartbeat and the uterine contractions during pregnancy and labour.","examples":[{"sentence":"Cardiotocography is used to monitor the baby's well-being during labor.","translation":"胎児心拍数陣痛図は、分娩中の赤ちゃんの健康状態を監視するために使用されます。"},{"sentence":"The CTG showed some abnormalities, so the doctor decided to perform a cesarean section.","translation":"CTGにいくつかの異常が見られたため、医師は帝王切開を行うことを決定しました。"}],"collocations":["antenatal cardiotocography","intrapartum cardiotocography","CTG monitoring","CTG interpretation","abnormal CTG","normal CTG"],"synonyms":["CTG","fetal monitoring"],"antonyms":[]}],"etymology":{"value":"The word 'cardiotocography' is derived from 'cardio' (referring to the heart), 'toco' (referring to childbirth or uterine contractions), and 'graphy' (referring to the process of recording).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɑːrdioʊtoʊˈkɒɡrəfi/","syllables":"car-di-o-to-cog-ra-phy"},"inflection":{"noun_plural":"cardiotocographies"},"usage_notes":{"explanation":"Cardiotocography (CTG) is a method used in antenatal and intrapartum care to monitor the fetal heart rate and uterine contractions. It helps assess fetal well-being and identify potential problems during pregnancy and labor. The interpretation of CTG traces requires expertise, and the findings can influence decisions about the management of labor and delivery.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Cardiotocography are important for fetal monitoring.","correct":"✓ Cardiotocography is important for fetal monitoring.","note":"'Cardiotocography' is a singular noun, so it takes a singular verb ('is')."},{"incorrect":"✗ The doctor used cardiotocography to monitoring the baby.","correct":"✓ The doctor used cardiotocography to monitor the baby.","note":"After 'to', use the base form of the verb ('monitor')."}],"priority":"★★☆"},"related_words":{"derivatives":["cardiotocograph (noun: the machine used for cardiotocography)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cardiotocography' is a specialized medical term referring to the continuous monitoring of fetal heart rate and uterine contractions, typically during pregnancy and labor. It is a complex procedure requiring trained professionals for interpretation and is essential for assessing fetal well-being. The term is primarily used in medical contexts and is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The obstetrician reviewed the cardiotocography to assess the fetal heart rate patterns.","translation":"産科医は胎児心拍数のパターンを評価するために胎児心拍数陣痛図を検討しました。","type":"noun","meaning_category":"medical procedure"},{"sentence":"Continuous cardiotocography is recommended for high-risk pregnancies.","translation":"ハイリスク妊娠には、継続的な胎児心拍数陣痛図が推奨されます。","type":"noun","meaning_category":"medical recommendation"},{"sentence":"The cardiotocography showed signs of fetal distress, prompting immediate intervention.","translation":"胎児心拍数陣痛図は胎児ジストレスの兆候を示し、直ちに介入を促しました。","type":"noun","meaning_category":"medical finding"}]}