{"word":"expressway-centric","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"高速道路中心の、高速道路偏重の","english_definition":"Designed or oriented primarily around expressways; heavily reliant on or focused on expressways.","examples":[{"sentence":"The city's development has been expressway-centric, leading to increased traffic congestion in certain areas.","translation":"その都市の開発は高速道路中心に進められてきたため、特定の地域で交通渋滞が増加している。"},{"sentence":"An expressway-centric transportation policy may neglect the needs of pedestrians and cyclists.","translation":"高速道路偏重の交通政策は、歩行者や自転車利用者のニーズを無視する可能性がある。"}],"collocations":["expressway-centric development (高速道路中心の開発)","expressway-centric transportation (高速道路中心の交通)","expressway-centric planning (高速道路中心の計画)"],"synonyms":["highway-oriented","autobahn-centric (if referring to Germany)"],"antonyms":["public-transport-oriented","pedestrian-friendly","transit-oriented"],"notes":"This term is often used critically to describe urban planning or transportation policies that prioritize expressways over other modes of transportation."}],"etymology":{"value":"A compound word formed by combining 'expressway' (a high-speed highway) with '-centric' (having something as its center or focus).","priority":"Medium"},"pronunciation":{"ipa":"/ɪkˈsprɛsweɪˌsɛntrɪk/","syllables":"ex-press-way-cen-tric"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"The term 'expressway-centric' is often used to describe urban planning or transportation policies that heavily favor the construction and use of expressways. This can lead to issues such as increased car dependence, urban sprawl, and neglect of alternative modes of transportation like public transit, cycling, and walking. It often carries a negative connotation, implying that such policies are unbalanced or unsustainable.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"The plan is very expressways-centric.","correct":"The plan is very expressway-centric.","note":"The word is 'expressway-centric', not 'expressways-centric'."}],"priority":"Low"},"related_words":{"derivatives":["car-centric","auto-centric"],"related_concepts":["urban sprawl","induced demand","transit-oriented development (TOD)"]},"level_frequency":{"frequency_google_ngram":"Low frequency; primarily used in academic or technical contexts.","priority":"Low"},"readability_explanation":{"level":"C1","text":"The term 'expressway-centric' is a specialized term used in urban planning and transportation discussions. It describes a situation where expressways are the primary focus of transportation development, often to the detriment of other modes of transport. Understanding this term requires familiarity with urban planning concepts and transportation policy debates."},"example_sentences":[{"sentence":"The city's expressway-centric approach has resulted in a sprawling metropolitan area.","translation":"その都市の高速道路中心のアプローチは、広大な都市圏をもたらした。","type":"general","meaning_category":"General"},{"sentence":"Critics argue that the region's expressway-centric infrastructure is unsustainable in the long term.","translation":"批評家たちは、その地域の高速道路中心のインフラは長期的には持続可能ではないと主張している。","type":"critical","meaning_category":"Criticism"}]}