{"word":"unprocure","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(rare, nonstandard) To undo the act of procuring; to lose or relinquish something that was previously obtained or secured.","english_definition":"To lose or relinquish something that was previously obtained or secured; to undo the act of procuring.","examples":[{"sentence":"The company's mismanagement led them to unprocure the contract they had worked so hard to win.","translation":"その会社の経営 mismanagement により、彼らは苦労して獲得した契約を失うことになった。"},{"sentence":"Through a series of unfortunate events, he unprocured the funding for his project.","translation":"一連の不幸な出来事を通じて、彼はプロジェクトの資金調達を失った。"}],"collocations":["unprocure funding","unprocure a contract","unprocure resources"],"synonyms":["lose","relinquish","forfeit","undo","reverse"],"antonyms":["procure","obtain","secure","acquire"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not' or 'undoing') to the word 'procure'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnproʊˈkjʊər/","syllables":"un-pro-cure"},"inflection":{"verb_forms":{"present_simple":["unprocure","unprocures"],"past_simple":"unprocured","past_participle":"unprocured","present_participle":"unprocuring"}},"usage_notes":{"explanation":"'Unprocure' is a rare and somewhat nonstandard word. It is formed by adding the prefix 'un-' to 'procure,' indicating the reversal or undoing of the act of procuring. It suggests losing something that was previously obtained or secured. Because it's not a commonly used word, it might sound unusual or awkward in many contexts. Consider using more common alternatives like 'lose,' 'relinquish,' or 'forfeit' for clarity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He unprocured happiness.","correct":"✓ He lost his happiness.","note":"'Unprocure' is typically used for tangible or concrete things that can be obtained, like contracts or funding, not abstract concepts like happiness."},{"incorrect":"✗ The unprocured item was returned.","correct":"✓ The item that was procured was returned.","note":"The past participle 'unprocured' is rarely used. It's more common to describe the act of losing something that was procured using a different verb."}],"priority":"★☆☆"},"related_words":{"derivatives":["procure (verb)","procurement (noun)"],"antonyms":["procure (verb)"]},"level_frequency":{"CEFR":"N/A (not commonly used)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unprocure' is a rare and somewhat unusual word. It means to lose or give up something that was previously obtained or secured. Because it is not commonly used, it's better to use more common synonyms like 'lose,' 'relinquish,' or 'forfeit' to ensure clarity. This word is not typically encountered in everyday language and is more likely to appear in specialized or technical contexts, if at all."},"example_sentences":[{"sentence":"Due to budget cuts, the department had to unprocure several essential supplies.","translation":"予算削減のため、その部署はいくつかの不可欠な物資を失わなければならなかった。","type":"verb","meaning_category":"relinquish"},{"sentence":"His negligence led him to unprocure the rights to the invention.","translation":"彼の過失により、彼はその発明の権利を失うことになった。","type":"verb","meaning_category":"lose"}]}