{"word":"intertessellation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"相互敷石細工、相互モザイク模様；（地質学）相互成長組織","english_definition":"The state of being intertessellated; an intertessellated structure or pattern. In geology, it refers to the mutual or interlocking growth of crystals.","examples":[{"sentence":"The intertessellation of the crystals gave the rock its unique texture.","translation":"結晶の相互成長組織が、その岩に独特の質感を与えた。"},{"sentence":"The artist used intertessellation to create a complex mosaic pattern.","translation":"その芸術家は相互モザイク模様を使って、複雑なモザイク模様を作り出した。"}],"collocations":["crystal intertessellation","intertessellation texture","geological intertessellation"],"synonyms":["interlocking","interweaving","intergrowth","mosaic","tessellation"],"antonyms":["separation","disconnection","isolation"]}],"etymology":{"value":"'Inter-' (between, among) + 'tessellation' (arrangement of shapes closely fitted together, especially of polygons in a plane).","priority":"★★☆"},"pronunciation":{"ipa":"ˌɪntərˌtɛsəˈleɪʃən","syllables":"in-ter-tes-sel-la-tion"},"inflection":{"noun_plural":"intertessellations"},"usage_notes":{"explanation":"'Intertessellation' is a relatively uncommon term, primarily used in technical contexts such as geology and materials science to describe the interlocking or intergrown arrangement of components. It can also be used more broadly to describe any complex, mosaic-like pattern formed by the interweaving of different elements.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The intertessellation was very color.","correct":"✓ The intertessellation was very colorful.","note":"'Intertessellation' is a noun, so it describes a structure or pattern. To describe the property of having many colors, use the adjective 'colorful'."}],"priority":"★☆☆"},"related_words":{"derivatives":["intertessellate (verb): to arrange or grow in an intertessellated pattern","tessellate (verb): to cover a surface with shapes that fit together without gaps or overlaps","tessellation (noun): an arrangement of shapes closely fitted together"],"related_terms":["mosaic","pattern","texture","crystal growth","intergrowth"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'intertessellation' is a technical term, primarily used in geology and materials science. It refers to the way crystals or other shapes interlock and grow together. Understanding this word requires a strong vocabulary and familiarity with scientific concepts."},"example_sentences":[{"sentence":"The thin section revealed the intricate intertessellation of plagioclase and quartz.","translation":"薄片は、斜長石と石英の複雑な相互成長組織を示した。","type":"technical","meaning_category":"geology"},{"sentence":"The artist created a stunning effect through the intertessellation of different colored glass pieces.","translation":"その芸術家は、様々な色のガラス片の相互モザイク模様によって、見事な効果を生み出した。","type":"artistic","meaning_category":"pattern"}]}