{"word":"parathyroprival","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"副甲状腺除去による、副甲状腺摘出後の","english_definition":"Relating to or resulting from the removal of the parathyroid glands.","examples":[{"sentence":"The patient experienced parathyroprival tetany after the surgery.","translation":"患者は手術後、副甲状腺摘出後のテタニーを経験した。"}],"collocations":[],"synonyms":["hypoparathyroid","post-parathyroidectomy"],"antonyms":[]}],"etymology":{"value":"Derived from 'parathyroid' (referring to the parathyroid glands) and 'privation' (the state of lacking something), combined with the adjective suffix '-al'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpærəˌθaɪroʊˈpraɪvəl/","syllables":"par-a-thy-ro-pri-val"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than to form comparative and superlative degrees (which are uncommon for this word)."},"usage_notes":{"explanation":"'Parathyroprival' is a technical term primarily used in medical contexts to describe conditions or symptoms that arise as a consequence of the removal or absence of the parathyroid glands. It is often used to describe the state of hypocalcemia (low calcium levels in the blood) that can result from this removal, as the parathyroid glands are crucial for regulating calcium levels.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The parathyroprival glands were removed.","correct":"✓ The parathyroid glands were removed, leading to a parathyroprival state.","note":"'Parathyroprival' describes the state resulting from the removal, not the glands themselves."}],"priority":"★★☆"},"related_words":{"derivatives":["parathyroid (noun, adjective)","privation (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Parathyroprival' is a highly specialized medical term. Understanding requires knowledge of the parathyroid glands and the consequences of their removal. The term is rarely used outside of medical or scientific contexts."},"example_sentences":[{"sentence":"The parathyroprival state led to severe hypocalcemia.","translation":"副甲状腺除去状態は重度の低カルシウム血症を引き起こした。","type":"adjective","meaning_category":"Medical Condition"},{"sentence":"Parathyroprival symptoms can be managed with calcium and vitamin D supplementation.","translation":"副甲状腺除去症状は、カルシウムとビタミンDの補給で管理できる。","type":"adjective","meaning_category":"Medical Condition"}]}