{"word":"foreignize","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"外国風にする、外国化する","english_definition":"to make foreign in character or appearance; to make something seem foreign or alien.","examples":[{"sentence":"The restaurant tried to foreignize its menu to attract tourists.","translation":"そのレストランは観光客を惹きつけるためにメニューを外国風にしようとした。"},{"sentence":"Some fear that globalization will foreignize local cultures.","translation":"グローバル化が地元の文化を外国化することを恐れる人もいる。"},{"sentence":"The author foreignized the setting of the novel to create a sense of mystery.","translation":"作者は小説の設定を外国風にして、神秘的な雰囲気を醸し出した。"}],"collocations":["foreignize a menu (メニューを外国風にする)","foreignize a culture (文化を外国化する)","foreignize a setting (設定を外国風にする)"],"synonyms":["exoticize","alienate","estrange"],"antonyms":["localize","domesticate","nativize"]}],"etymology":{"value":"\"foreign\" + \"-ize\".","priority":"★★★"},"pronunciation":{"ipa":"/ˈfɔːrənaɪz/","syllables":"for-eign-ize"},"inflection":{"verb_forms":{"present_simple":["foreignize","foreignizes"],"past_simple":"foreignized","past_participle":"foreignized","present_participle":"foreignizing"}},"usage_notes":{"explanation":"\"Foreignize\" is a verb that means to make something seem foreign or alien. It can refer to changing the character or appearance of something to resemble a foreign culture, or to making something unfamiliar or strange. It is often used in the context of globalization, cultural exchange, or artistic expression.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They are foreignizing.","correct":"✓ They are foreignizing the product.","note":"\"Foreignize\" is typically a transitive verb, meaning it requires a direct object. It's not usually used intransitively to describe a general state of becoming foreign."},{"incorrect":"✗ The foreignized culture.","correct":"✓ The foreignized culture is interesting.","note":"When using \"foreignized\" as an adjective, make sure it modifies a noun appropriately."}],"priority":"★★☆"},"related_words":{"derivatives":["foreignization (名詞: 外国化)","foreign (形容詞: 外国の)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"foreignize\" is a relatively uncommon verb that means to make something seem foreign or alien. It is often used in discussions about cultural change or globalization. Because it is not a frequently used word, it is more likely to be encountered in advanced texts or discussions. The related noun, \"foreignization,\" is also relatively uncommon."},"example_sentences":[{"sentence":"The film director chose to foreignize the story by setting it in an exotic location.","translation":"その映画監督は、物語を異国情緒あふれる場所に設定することで、物語を外国風にすることを選んだ。","type":"verb","meaning_category":"外国風にする"},{"sentence":"Some critics argued that the adaptation foreignized the original text too much.","translation":"一部の批評家は、その翻案は原作を外国化しすぎていると主張した。","type":"verb","meaning_category":"外国化する"},{"sentence":"The company's attempt to foreignize its brand ultimately failed to resonate with local consumers.","translation":"その会社がブランドを外国風にしようとした試みは、最終的には地元の消費者の共感を呼ぶことができなかった。","type":"verb","meaning_category":"外国風にする"}]}