{"word":"deuteration","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"重水素化、重水素置換","english_definition":"The process of replacing hydrogen atoms in a molecule with deuterium atoms.","examples":[{"sentence":"Deuteration of the drug molecule improved its metabolic stability.","translation":"その薬物分子の重水素化は、代謝安定性を改善した。"},{"sentence":"Deuteration is a common technique used in NMR spectroscopy.","translation":"重水素化は、NMR分光法で一般的に使用される技術である。"}],"collocations":["complete deuteration (完全重水素化)","selective deuteration (選択的重水素化)","deuteration level (重水素化レベル)"],"synonyms":["hydrogen-deuterium exchange"],"antonyms":[]}],"etymology":{"value":"Formed from 'deuter-' (prefix relating to deuterium) + '-ation' (suffix indicating a process or action).","priority":"★★★"},"pronunciation":{"ipa":"/ˌdjuːtəˈreɪʃən/","syllables":"du-te-ra-tion"},"inflection":{"noun_plural":"deuterations"},"usage_notes":{"explanation":"Deuteration is a chemical process where hydrogen atoms in a molecule are replaced by deuterium atoms. Deuterium is an isotope of hydrogen with one proton and one neutron in its nucleus, making it twice the mass of ordinary hydrogen. Deuteration is often used to alter the properties of a molecule, such as its stability or its behavior in chemical reactions. It is also a common technique in analytical chemistry, particularly in NMR spectroscopy and mass spectrometry.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The deuteration was make on the molecule.","correct":"✓ The deuteration was performed on the molecule.","note":"Use 'performed' or 'carried out' instead of 'make' when describing the process of deuteration. Deuteration is a process that is carried out, not made."},{"incorrect":"✗ Deuterization is the same as deuteration.","correct":"✓ Deuteration is the process of replacing hydrogen with deuterium.","note":"'Deuterization' is not a standard term. The correct term is 'deuteration'."}],"priority":"★★☆"},"related_words":{"derivatives":["deuterate (verb)","deuterated (adjective)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Deuteration is a term used in chemistry to describe the process of replacing hydrogen atoms with deuterium atoms in a molecule. Deuterium is a heavier isotope of hydrogen. This process is commonly used to study reaction mechanisms, improve the stability of drugs, and in various spectroscopic techniques like NMR. The term is technical and primarily used within the field of chemistry."},"example_sentences":[{"sentence":"The **deuteration** of the solvent is crucial for NMR experiments.","translation":"溶媒の重水素化はNMR実験にとって非常に重要である。","type":"noun","meaning_category":"重水素化"},{"sentence":"**Deuteration** can significantly alter the metabolic pathway of a drug.","translation":"重水素化は薬物の代謝経路を大幅に変える可能性がある。","type":"noun","meaning_category":"重水素化"}]}