{"word":"Changa","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"チャンガ：DMT（ジメチルトリプタミン）を含む喫煙可能なハーブ混合物。通常、さまざまな植物とモノアミン酸化酵素阻害薬（MAOI）を含む。","english_definition":"Changa: A smokable herbal mixture containing DMT (dimethyltryptamine), typically including various plants and a monoamine oxidase inhibitor (MAOI).","examples":[{"sentence":"He smoked Changa and experienced vivid hallucinations.","translation":"彼はチャンガを吸って、鮮やかな幻覚を体験した。"},{"sentence":"Changa is often considered a gentler alternative to smoking pure DMT.","translation":"チャンガは、純粋なDMTを喫煙するよりも穏やかな代替手段と見なされることが多い。"}],"collocations":["smoke Changa","Changa experience","Changa blend","MAOI in Changa"],"synonyms":["DMT blend","herbal DMT mixture"],"antonyms":[]}],"etymology":{"value":"「Changa」という名前は、アフリカのシャーマンが使用するズールー語の単語に由来すると言われています。この言葉は「変化」を意味し、この物質の使用によって引き起こされる意識の変化を反映しています。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʃæŋɡə/","syllables":"Chan-ga"},"inflection":{"notes":"名詞であり、複数形は通常使用されませんが、異なる種類のチャンガを指す場合は \"Changas\" となることがあります。"},"usage_notes":{"explanation":"チャンガは、DMTを単独で喫煙するよりも、より長く、より穏やかな体験を提供すると考えられています。MAOIが含まれているため、DMTが体内で分解される速度が遅くなり、効果が長持ちします。ただし、MAOIを含む物質の摂取には注意が必要であり、特定の薬物や食品との相互作用がある可能性があります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I will try Changa for fun without research.","correct":"✓ I will research Changa before trying it.","note":"Changaの使用には、潜在的なリスクと相互作用があるため、事前に十分な調査を行うことが重要です。特に、MAOIが含まれているため、他の薬物や食品との相互作用に注意が必要です。"},{"incorrect":"✗ Changa is legal everywhere.","correct":"✓ The legality of Changa varies by location.","note":"DMTを含む製品の合法性は国や地域によって異なります。使用前に現地の法律を確認することが重要です。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (非常に特殊な用語)","frequency_google_ngram":"低頻度 (Low frequency) - 特定のサブカルチャーやコミュニティでのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Changa**」は、DMT（ジメチルトリプタミン）を含む喫煙可能なハーブ混合物を指す、非常に特殊な用語です。この用語は、特定の精神活性物質の使用に関心のある人々の間で知られていますが、一般的な語彙ではありません。この物質の使用には潜在的なリスクが伴うため、関連情報を理解するには高度な知識が必要です。"},"example_sentences":[{"sentence":"Many users report that smoking **Changa** provides a more grounded and extended DMT experience compared to freebase DMT.","translation":"多くのユーザーは、チャンガを喫煙することで、フリーベースDMTと比較して、より地に足が着いた、より長いDMT体験が得られると報告しています。","type":"noun","meaning_category":"ハーブ混合物"},{"sentence":"The **Changa** blend included ayahuasca vine and other herbs known for their synergistic effects.","translation":"そのチャンガブレンドには、相乗効果で知られるアヤワスカのつるやその他のハーブが含まれていました。","type":"noun","meaning_category":"ハーブ混合物"}]}