{"word":"Lepisosteidae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ガー目（ガーもく）に属する魚類の唯一の科","english_definition":"The only family of fish belonging to the order Lepisosteiformes (gars).","examples":[{"sentence":"The Lepisosteidae are characterized by their elongated bodies and ganoid scales.","translation":"ガー科は、細長い体と硬鱗（こうりん）を持つことを特徴とする。"}],"collocations":[],"synonyms":["gar family"],"antonyms":[]}],"etymology":{"value":"From Lepisosteus (the type genus) + -idae (standard suffix for zoological families). Lepisosteus is derived from the Greek words 'lepis' (scale) and 'osteon' (bone), referring to the bony, scale-like plates covering their bodies.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌlɛpɪsoʊˈstiːɪdiː/","syllables":"Le-pis-o-ste-i-dae"},"inflection":{"noun_plural":"Lepisosteids"},"usage_notes":{"explanation":"Lepisosteidae refers to the family of gars, which are primitive ray-finned fish. They are found primarily in North America, with some species also occurring in Central America and Cuba. Gars are characterized by their long, slender bodies, elongated snouts filled with sharp teeth, and diamond-shaped ganoid scales, which provide a protective armor. They inhabit a variety of freshwater habitats, including rivers, lakes, and swamps, and are known for their predatory behavior.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Lepisosteiformes (order)","Lepisosteus (genus)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lepisosteidae' is a scientific term referring to the gar family of fish. This term is typically used in zoological or ichthyological contexts. Understanding this term requires familiarity with biological classification systems and a specialized vocabulary related to fish anatomy and taxonomy. The pronunciation may be challenging for those unfamiliar with scientific nomenclature."},"example_sentences":[{"sentence":"Members of the Lepisosteidae family are often found in slow-moving rivers and bayous.","translation":"ガー科の魚は、流れの緩やかな川やバイユー（入江）によく見られる。","type":"general"},{"sentence":"Research on Lepisosteidae provides insights into the evolution of ray-finned fishes.","translation":"ガー科に関する研究は、条鰭魚類の進化に関する洞察を提供する。","type":"scientific"}]}