{"word":"Hypercalcaemia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"高カルシウム血症","english_definition":"An abnormally high concentration of calcium in the blood.","examples":[{"sentence":"Hypercalcaemia can be caused by various underlying conditions, including hyperparathyroidism and certain cancers.","translation":"高カルシウム血症は、副甲状腺機能亢進症や特定のがんなど、さまざまな基礎疾患によって引き起こされる可能性があります。"},{"sentence":"Symptoms of hypercalcaemia may include fatigue, muscle weakness, and kidney stones.","translation":"高カルシウム血症の症状には、倦怠感、筋力低下、腎臓結石などがあります。"}],"collocations":["severe hypercalcaemia","mild hypercalcaemia","cause hypercalcaemia","treat hypercalcaemia","hypercalcaemia symptoms"],"synonyms":["elevated blood calcium","high calcium levels"],"antonyms":["hypocalcemia (低カルシウム血症)"]}],"etymology":{"value":"Derived from the Greek words 'hyper' (above, excessive), 'kalx' (lime, calcium), and 'haima' (blood).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpərkælˈsiːmiə/","syllables":"hy-per-cal-ce-mi-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Hypercalcaemia is a medical condition characterized by elevated levels of calcium in the blood. It is important to note that hypercalcaemia is a sign of an underlying problem, not a disease in itself. Treatment focuses on addressing the underlying cause.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Hypercalcemia is when you don't have enough calcium.","correct":"✓ Hypercalcemia is when you have too much calcium.","note":"Hypercalcaemia means having too much calcium in the blood, not too little."}],"priority":"★★☆"},"related_words":{"derivatives":["hypercalcemic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hypercalcaemia' is a medical term referring to an abnormally high level of calcium in the blood. Understanding this term requires a knowledge of medical terminology and physiology. It is typically encountered in medical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The patient was diagnosed with hypercalcaemia after blood tests revealed elevated calcium levels.","translation":"血液検査でカルシウム値の上昇が明らかになった後、患者は高カルシウム血症と診断されました。","type":"medical","meaning_category":"diagnosis"},{"sentence":"Chronic hypercalcaemia can lead to kidney damage and other serious health problems.","translation":"慢性的な高カルシウム血症は、腎臓の損傷やその他の深刻な健康問題につながる可能性があります。","type":"medical","meaning_category":"complications"},{"sentence":"Treatment for hypercalcaemia typically involves addressing the underlying cause and managing calcium levels.","translation":"高カルシウム血症の治療は通常、根本的な原因に対処し、カルシウム値を管理することを含みます。","type":"medical","meaning_category":"treatment"}]}