{"word":"compurgatorial","priority":"低","meanings":[{"part_of_speech":"adjective","definition":"誓約弁護による、潔白証明の","english_definition":"Relating to or involving compurgation.","examples":[{"sentence":"The compurgatorial oath was a common practice in medieval law.","translation":"誓約弁護による誓いは、中世の法律では一般的な慣習でした。"}],"collocations":["compurgatorial oath","compurgatorial procedure"],"synonyms":["exculpatory","vindicatory"],"antonyms":["incriminating"]}],"etymology":{"value":"Late Latin compurgatorius, from compurgare to purify completely, from com- + purgare to purify.","priority":"中"},"pronunciation":{"ipa":"/kəmˌpɜːrɡəˈtɔːriəl/","syllables":"com-pur-ga-to-ri-al"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化があります。"},"usage_notes":{"explanation":"'Compurgatorial' is an adjective specifically used to describe something related to compurgation, an archaic legal practice where a person's innocence was established by oaths sworn by them and by 'compurgators' who swore to their belief in the person's credibility. This term is rarely used in modern contexts outside of historical or legal discussions.","priority":"低"},"common_mistakes":{"examples":[{"incorrect":"The compurgatorial system is still used in modern courts.","correct":"Compurgation is an archaic legal practice not used in modern courts.","note":"Compurgation is no longer used in modern legal systems."}],"priority":"低"},"related_words":{"derivatives":["compurgation","compurgator"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度","priority":"低"},"readability_explanation":{"level":"C2","text":"The word 'compurgatorial' is a highly specialized term related to historical legal practices. It is unlikely to be encountered outside of academic or historical contexts. Understanding requires knowledge of the concept of 'compurgation.'"},"example_sentences":[{"sentence":"The defendant sought to clear his name through a compurgatorial process.","translation":"被告は誓約弁護の手続きを通じて、自身の潔白を証明しようとしました。","type":"general","meaning_category":"general"},{"sentence":"Historians study the compurgatorial system to understand medieval legal customs.","translation":"歴史家たちは、中世の法律慣習を理解するために誓約弁護制度を研究します。","type":"academic","meaning_category":"academic"}]}