{"word":"geodal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"測地線に関する、測地線の","english_definition":"Relating to or resembling a geodesic line or geodesic survey.","examples":[{"sentence":"The geodal survey provided accurate measurements of the Earth's surface.","translation":"測地線測量は、地球表面の正確な測定値を提供した。"},{"sentence":"Geodal lines are the shortest paths between two points on a curved surface.","translation":"測地線は、曲面上の2点間の最短経路である。"}],"collocations":["geodal survey","geodal line","geodal network"],"synonyms":["geodesic","geodetic"],"antonyms":[]}],"etymology":{"value":"Derived from 'geode', referring to the earth, and '-al', a suffix indicating relationship or belonging.","priority":"★★★"},"pronunciation":{"ipa":"/dʒiˈoʊdəl/","syllables":"ge-o-dal"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Geodal' is primarily used in technical contexts related to geodesy, surveying, and mapping. It describes something that pertains to or resembles a geodesic line, which is the shortest path between two points on a curved surface, such as the Earth.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The geodal dome was impressive.","correct":"✓ The geodesic dome was impressive.","note":"'Geodal' relates to geodesics (shortest paths on a curved surface), while 'geodesic' more commonly refers to geodesic structures like domes."}],"priority":"★★☆"},"related_words":{"derivatives":["geodesy","geodetic","geodesic"],"related_terms":["geoid","ellipsoid","datum"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Geodal' is a technical term primarily used in the fields of geodesy and surveying. It refers to anything related to or resembling a geodesic line, which is the shortest path between two points on a curved surface. Due to its specialized usage, it is not commonly encountered in general English. Understanding requires familiarity with concepts from mathematics and earth sciences."},"example_sentences":[{"sentence":"The geodal measurements were crucial for creating accurate maps.","translation":"その測地線測定は、正確な地図を作成するために不可欠だった。","type":"adjective","meaning_category":"Relating to geodesics"},{"sentence":"The geodal network helped to establish precise control points for the construction project.","translation":"その測地線ネットワークは、建設プロジェクトのための正確な基準点を確立するのに役立った。","type":"adjective","meaning_category":"Relating to geodesics"}]}