{"word":"hemisphere","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"半球","english_definition":"a half of the earth, usually divided into northern and southern halves by the equator, or into western and eastern halves by an imaginary line passing through the poles.","examples":[{"sentence":"The Northern Hemisphere is generally colder than the Southern Hemisphere.","translation":"北半球は一般的に南半球よりも寒い。"},{"sentence":"Japan is located in the Eastern Hemisphere.","translation":"日本は東半球に位置している。"},{"sentence":"The Amazon rainforest is largely located in the Southern Hemisphere.","translation":"アマゾンの熱帯雨林は主に南半球に位置している。"}],"collocations":["Northern Hemisphere (北半球)","Southern Hemisphere (南半球)","Eastern Hemisphere (東半球)","Western Hemisphere (西半球)","brain hemisphere (脳半球)"],"synonyms":["half-sphere","semisphere"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'hēmisphairion', which means 'half of a sphere'. It is a combination of 'hēmi-' meaning 'half' and 'sphaira' meaning 'sphere'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈhemɪsfɪər/","syllables":"hem-i-sphere"},"inflection":{"noun_plural":"hemispheres"},"usage_notes":{"explanation":"The term 'hemisphere' is most commonly used in geography to refer to halves of the Earth. It can also be used in other contexts, such as anatomy, to refer to a half of a sphere-like structure, such as the brain.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The hemisphere of my brain hurts.","correct":"✓ One hemisphere of my brain hurts.","note":"When referring to a specific half, use 'one hemisphere' or specify which hemisphere (left or right)."},{"incorrect":"✗ The northern hemisphere is more populated that the southern.","correct":"✓ The Northern Hemisphere is more populated than the Southern Hemisphere.","note":"Capitalize the names of the hemispheres (Northern, Southern, Eastern, Western)."}],"priority":"★★☆"},"related_words":{"derivatives":["hemispheric (adjective)"],"related_terms":["equator","prime meridian","latitude","longitude","globe","sphere"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively common, especially in geographical and scientific contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Hemisphere' refers to half of a sphere, most often used to describe half of the Earth. The Earth is commonly divided into the Northern and Southern Hemispheres by the equator, or the Eastern and Western Hemispheres by the Prime Meridian. Understanding this term is useful for discussing geography, climate, and global events. It's also used in other scientific contexts, such as describing the hemispheres of the brain."},"example_sentences":[{"sentence":"The majority of the world's population lives in the Northern Hemisphere.","translation":"世界の人口の大部分は北半球に住んでいる。","type":"general","meaning_category":"geography"},{"sentence":"The left hemisphere of the brain controls the right side of the body.","translation":"脳の左半球は体の右側を制御する。","type":"scientific","meaning_category":"anatomy"},{"sentence":"During summer in the Southern Hemisphere, it is winter in the Northern Hemisphere.","translation":"南半球が夏の時期には、北半球は冬である。","type":"general","meaning_category":"geography"}]}