{"word":"membrane-resistant","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(of a compound, especially a drug) able to cross or not be affected by biological membranes.","english_definition":"(of a compound, especially a drug) able to cross or not be affected by biological membranes.","examples":[{"sentence":"The new drug is membrane-resistant, allowing it to reach the target cells more effectively.","translation":"その新薬は膜透過性があり、標的細胞に効果的に到達できる。"},{"sentence":"We need to develop membrane-resistant antibiotics to combat resistant bacteria.","translation":"耐性菌に対抗するために、膜透過性抗生物質を開発する必要がある。"}],"collocations":["membrane-resistant drug","membrane-resistant antibiotic","membrane-resistant compound"],"synonyms":["membrane-permeable","membrane-crossing","cell-penetrating"],"antonyms":["membrane-impermeable","membrane-sensitive"]}],"etymology":{"value":"Formed by combining 'membrane' (referring to a biological membrane), 'resistant' (meaning not affected or able to withstand), and the hyphen connecting them.","priority":"N/A"},"pronunciation":{"ipa":"/ˈmɛmbreɪn rɪˈzɪstənt/","syllables":"mem-brane re-sis-tant"},"inflection":{"notes":"Adjective; comparative and superlative forms are generally formed using 'more' and 'most' (e.g., 'more membrane-resistant', 'most membrane-resistant')."},"usage_notes":{"explanation":"'Membrane-resistant' describes a substance's ability to either pass through or remain unaffected by biological membranes, such as cell membranes. This property is crucial in drug development, as it determines how effectively a drug can reach its target within the body. The term is often used in the context of pharmaceuticals and biochemistry.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bacteria are membrane-resistant.","correct":"✓ The bacteria are resistant to the membrane-disrupting agent.","note":"'Membrane-resistant' typically describes a compound, not an organism. Resistance in organisms is usually specified in relation to a particular agent or condition."}],"priority":"N/A"},"related_words":{"derivatives":["membrane resistance (noun): the degree to which a membrane resists the passage of a substance.","resistant (adjective): offering resistance to something.","membrane (noun): a thin, pliable sheet of material acting as a boundary, lining, or partition in an organism or cell."],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Membrane-resistant' is a technical term used in biology, chemistry, and pharmacology. It describes a substance's ability to either pass through or remain unaffected by biological membranes. Understanding this term requires knowledge of biological membranes and the concept of resistance in a scientific context. It's not commonly used in everyday language."},"example_sentences":[{"sentence":"The researchers synthesized a novel membrane-resistant molecule for targeted drug delivery.","translation":"研究者らは、標的薬物送達のために、新規な膜透過性分子を合成した。","type":"adjective","meaning_category":"pharmaceutical"},{"sentence":"Developing membrane-resistant antiviral drugs is crucial for combating viral infections.","translation":"ウイルス感染症と戦うためには、膜透過性抗ウイルス薬の開発が不可欠である。","type":"adjective","meaning_category":"medical"}]}