{"word":"anoxaemic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(医学)無酸素血症の、血液中の酸素が欠乏した","english_definition":"(medicine) deficient in oxygen in the blood.","examples":[{"sentence":"The patient was anoxaemic due to severe respiratory failure.","translation":"患者は重度の呼吸不全のため無酸素血症であった。"},{"sentence":"Anoxaemic conditions can lead to serious complications.","translation":"無酸素血症の状態は深刻な合併症を引き起こす可能性がある。"}],"collocations":["anoxaemic patient","anoxaemic conditions","become anoxaemic"],"synonyms":["hypoxemic","deoxygenated"],"antonyms":["oxygenated","normoxemic"]}],"etymology":{"value":"From 'an-' (absence of), 'ox-' (oxygen), and '-aemic' (relating to blood).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌænɒkˈsiːmɪk/","syllables":"an-ox-ae-mic"},"inflection":{"notes":"Adjective; comparative and superlative forms are possible but rare (more anoxaemic, most anoxaemic)."},"usage_notes":{"explanation":"'Anoxaemic' specifically refers to a condition where the blood is deficient in oxygen. It is often used in medical contexts to describe patients with respiratory or circulatory problems. It is closely related to 'hypoxemic', which also refers to low blood oxygen, but 'anoxaemic' implies a more severe deficiency.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The air was anoxaemic.","correct":"✓ The air was oxygen-deficient.","note":"'Anoxaemic' refers to a condition of the blood, not the air. Use 'oxygen-deficient' or 'anoxic' to describe air lacking oxygen."},{"incorrect":"✗ He felt anoxaemic after running.","correct":"✓ He felt short of breath after running.","note":"While running can cause temporary oxygen deficiency, it's more common to say someone feels 'short of breath' or 'out of breath' rather than 'anoxaemic', unless it's a diagnosed medical condition."}],"priority":"★☆☆"},"related_words":{"derivatives":["anoxaemia (noun): the condition of having deficient oxygen in the blood","anoxic (adjective): completely without oxygen"],"medical_terms":["hypoxia (noun): deficiency in the amount of oxygen reaching the tissues","hypoxemia (noun): abnormally low level of oxygen in the blood","hyperoxia (noun): excess supply of oxygen in tissues and organs"]},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency - primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Anoxaemic' is a technical term used in medicine to describe a condition where the blood does not have enough oxygen. It's not a word you'd typically use in everyday conversation. If you're reading medical texts or discussing medical conditions, you might come across this word. It's important to understand that it specifically refers to the oxygen level in the blood, not in the air or tissues. It is related to, but more severe than, 'hypoxemic' (low blood oxygen)."},"example_sentences":[{"sentence":"The newborn was immediately treated for an anoxaemic episode.","translation":"新生児は無酸素血症のエピソードのため直ちに治療を受けた。","type":"adjective","meaning_category":"medical condition"},{"sentence":"Severe pneumonia can lead to an anoxaemic state.","translation":"重度の肺炎は無酸素血症の状態を引き起こす可能性がある。","type":"adjective","meaning_category":"medical condition"},{"sentence":"The doctor monitored the patient's blood oxygen levels to prevent them from becoming anoxaemic.","translation":"医師は患者の血液酸素レベルを監視し、無酸素血症にならないようにした。","type":"adjective","meaning_category":"medical monitoring"}]}