{"word":"federally-required","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"連邦政府によって義務付けられた、連邦法で定められた","english_definition":"Mandated or required by the federal government or federal law.","examples":[{"sentence":"The federally-required safety inspections are designed to protect consumers.","translation":"連邦政府によって義務付けられた安全検査は、消費者を保護するために設計されています。"},{"sentence":"All states must comply with federally-required environmental regulations.","translation":"すべての州は、連邦政府によって義務付けられた環境規制を遵守しなければなりません。"},{"sentence":"The company implemented the federally-required training program for all employees.","translation":"その会社は、すべての従業員に対して連邦政府によって義務付けられた研修プログラムを実施しました。"}],"collocations":["federally-required training","federally-required reporting","federally-required compliance","federally-required standards","federally-required documentation"],"synonyms":["mandated by the federal government","required by federal law","federally mandated","legally required"],"antonyms":["voluntary","optional","state-required","locally-required"]}],"etymology":{"value":"Combination of 'federally' (relating to the federal government) and 'required' (necessary or compulsory).","priority":"★★★"},"pronunciation":{"ipa":"/ˈfɛdərəli rɪˈkwaɪərd/","syllables":"fed-er-al-ly re-quired"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"The term 'federally-required' is used to describe something that is not optional but is a legal obligation imposed by the federal government of a country (typically the United States). It often refers to regulations, standards, inspections, or other actions that businesses, organizations, or individuals must follow to be in compliance with federal laws.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The state-required program is also federally-required.","correct":"✓ The state-required program is also federally-required.","note":"The hyphen is important to connect 'federally' and 'required' to form a single adjective modifying the noun. Without the hyphen, the sentence may be grammatically incorrect or unclear."},{"incorrect":"✗ Federally required programs are optional.","correct":"✓ Federally required programs are mandatory.","note":"'Federally-required' implies something is mandatory, not optional. Using 'optional' contradicts the meaning of 'federally-required'."}],"priority":"★★☆"},"related_words":{"derivatives":["federal","require","requirement","mandate","regulation"],"phrases":["federal law","federal government","legal requirement","mandatory compliance"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in legal and governmental contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Federally-required' is a compound adjective used in formal and legal contexts to describe something that is mandatory due to federal laws or regulations. It implies that compliance is not optional and is enforced by the federal government. This term is often found in documents related to law, government, and business compliance. Understanding this term is important for interpreting legal and regulatory information accurately."},"example_sentences":[{"sentence":"The federally-required background checks are essential for firearm purchases.","translation":"連邦政府によって義務付けられた身元調査は、銃器の購入に不可欠です。","type":"adjective","meaning_category":"Legal/Regulatory"},{"sentence":"Our company ensures compliance with all federally-required environmental standards.","translation":"当社は、連邦政府によって義務付けられたすべての環境基準の遵守を保証します。","type":"adjective","meaning_category":"Compliance"},{"sentence":"The federally-required data must be submitted by the end of the fiscal year.","translation":"連邦政府によって義務付けられたデータは、会計年度末までに提出する必要があります。","type":"adjective","meaning_category":"Reporting"}]}