{"word":"zinc-sampler","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A device or tool used to collect samples of zinc or zinc-containing materials.","english_definition":"A device or tool used to collect samples of zinc or zinc-containing materials for analysis or testing.","examples":[{"sentence":"The geologist used a zinc-sampler to collect soil samples near the mine.","translation":"地質学者は、鉱山の近くで土壌サンプルを採取するために亜鉛サンプラーを使用した。"},{"sentence":"The technician deployed a zinc-sampler to assess the zinc content in the industrial waste stream.","translation":"技術者は、産業廃棄物の流れにおける亜鉛含有量を評価するために亜鉛サンプラーを展開した。"}],"collocations":["soil zinc-sampler","water zinc-sampler","industrial zinc-sampler","portable zinc-sampler"],"synonyms":["zinc sampling tool","zinc collection device"],"antonyms":[]}],"etymology":{"value":"The word is a compound of \"zinc\", referring to the metal, and \"sampler\", indicating a device used for taking samples.","priority":"N/A"},"pronunciation":{"ipa":"/ˈzɪŋk ˈsæmplər/","syllables":"zinc-sam-pler"},"inflection":{"noun_plural":"zinc-samplers"},"usage_notes":{"explanation":"A zinc-sampler is a specialized tool used to obtain representative samples of materials containing zinc. The design of the sampler can vary depending on the medium being sampled (e.g., soil, water, air).","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["zinc","sampler","sampling"],"related_terms":["soil sampler","water sampler","air sampler","metal sampler"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Specialized term.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term \"zinc-sampler\" is a specialized term used in scientific and industrial contexts related to the sampling of zinc-containing materials. It is likely to be encountered in fields such as geology, environmental science, and metallurgy."},"example_sentences":[{"sentence":"The environmental agency uses a specialized zinc-sampler to monitor pollution levels in the river.","translation":"環境機関は、川の汚染レベルを監視するために、特殊な亜鉛サンプラーを使用しています。","type":"noun","meaning_category":"environmental monitoring"},{"sentence":"The mining company invested in a new zinc-sampler to improve the accuracy of their ore analysis.","translation":"鉱山会社は、鉱石分析の精度を向上させるために、新しい亜鉛サンプラーに投資しました。","type":"noun","meaning_category":"ore analysis"},{"sentence":"Researchers are developing a more efficient zinc-sampler for use in remote field locations.","translation":"研究者たちは、遠隔地の現場で使用するための、より効率的な亜鉛サンプラーを開発しています。","type":"noun","meaning_category":"research and development"}]}