{"word":"culture-shaped","meanings":[{"part_of_speech":"adjective","definition":"文化によって形成された、文化の影響を受けた","english_definition":"Formed, influenced, or determined by culture.","examples":[{"sentence":"Our beliefs are culture-shaped.","translation":"私たちの信念は文化によって形成されています。"},{"sentence":"The way we perceive the world is culture-shaped.","translation":"私たちの世界の見方は文化の影響を受けています。"},{"sentence":"Many of our behaviors are culture-shaped and not innate.","translation":"私たちの行動の多くは文化によって形成されたものであり、生得的なものではありません。"}],"collocations":["culture-shaped beliefs","culture-shaped values","culture-shaped behaviors","culture-shaped understanding","culture-shaped perspectives"],"synonyms":["culturally influenced","culturally determined","culturally formed","culture-bound"],"antonyms":["innate","natural","uninfluenced","universal"],"related_words":["culture","shape","cultural","society","tradition","values","beliefs"],"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"usage_notes":{"explanation":"The term 'culture-shaped' emphasizes the role of culture in influencing or determining various aspects of human life, such as beliefs, values, behaviors, and perspectives. It highlights that many of our traits are not simply innate but are molded by the cultural environment we grow up in.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"Our culture shaped.","correct":"Our culture is shaped.","note":"The adjective needs a verb to connect it to the subject."},{"incorrect":"The shaped culture.","correct":"The culture-shaped [aspect].","note":"The adjective needs to come before the noun it modifies."}],"priority":"★★☆"},"etymology":{"value":"A compound word formed by combining 'culture' and 'shaped'. 'Culture' refers to the customs, arts, social institutions, and achievements of a particular nation, people, or group. 'Shaped' means to give a particular form or influence to something.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈkʌltʃərˌʃeɪpt/","syllables":"cul-ture-shaped"},"inflection":{"notes":"This is an adjective and does not have different forms."},"readability_explanation":{"level":"C1","text":"'Culture-shaped' is a term used to describe something that has been influenced or formed by cultural factors. It is often used in social sciences and humanities to emphasize that many aspects of human life, such as beliefs, values, and behaviors, are not simply innate but are shaped by the cultural environment in which people grow up. Understanding this term helps to recognize the diversity of human experiences and the impact of culture on individual and collective identities."},"example_sentences":[{"sentence":"Her views on marriage were culture-shaped by the traditions of her community.","translation":"彼女の結婚観は、彼女のコミュニティの伝統によって文化的に形成されました。","type":"general","meaning_category":"influenced by tradition"},{"sentence":"The artist's work explores how identity is culture-shaped.","translation":"その芸術家の作品は、アイデンティティがどのように文化的に形成されるかを探求しています。","type":"arts","meaning_category":"exploring identity"},{"sentence":"Education plays a crucial role in transmitting culture-shaped values to the next generation.","translation":"教育は、文化的に形成された価値観を次世代に伝える上で重要な役割を果たします。","type":"education","meaning_category":"transmitting values"}]}],"related_words":{}}