{"word":"plasmids","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"プラスミド","english_definition":"A genetic structure in a cell that can replicate independently of the chromosomes, typically a small circular DNA strand in the cytoplasm of a bacterium or protozoan. Plasmids are much used in the laboratory manipulation of genes.","examples":[{"sentence":"Plasmids are essential tools in molecular biology.","translation":"プラスミドは分子生物学において不可欠なツールです。"},{"sentence":"The bacteria contained plasmids that conferred antibiotic resistance.","translation":"その細菌は抗生物質耐性を与えるプラスミドを含んでいた。"},{"sentence":"Researchers use plasmids to clone and express genes.","translation":"研究者たちは遺伝子をクローニングし発現させるためにプラスミドを使用する。"}],"collocations":["plasmid DNA","plasmid vector","recombinant plasmid","plasmid transformation","plasmid isolation"],"synonyms":["vector","episome","DNA construct"],"antonyms":[]}],"etymology":{"value":"The word 'plasmid' was coined in 1952 by Joshua Lederberg from 'plasm', referring to the cytoplasm, and '-id', indicating a structure within the cell.","priority":"★★★"},"pronunciation":{"ipa":"/ˈplæzmɪdz/","syllables":"plaz-midz"},"inflection":{"noun_plural":"plasmids"},"usage_notes":{"explanation":"Plasmids are extrachromosomal DNA molecules, most commonly found in bacteria and some other microorganisms. They are widely used in genetic engineering as vectors to carry foreign genes into host cells. Plasmids can be engineered to contain specific genes of interest, selectable markers (e.g., antibiotic resistance genes), and origins of replication. They are essential tools for cloning, gene expression, and other molecular biology techniques.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The plasmid was use to transform the bacteria.","correct":"✓ The plasmid was used to transform the bacteria.","note":"Ensure correct past participle form of the verb 'use' is employed."},{"incorrect":"✗ Plasmids are only found in animals.","correct":"✓ Plasmids are commonly found in bacteria and other microorganisms.","note":"Plasmids are primarily associated with bacteria and microorganisms, not animals."}],"priority":"★★☆"},"related_words":{"derivatives":["plasmidial","plasmidome"],"phrasal_verbs":[],"related_terms":["transformation","transfection","cloning","gene expression","vector","recombinant DNA","antibiotic resistance"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, specific to scientific and technical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'plasmids' refers to small, circular DNA molecules found mainly in bacteria and other microorganisms. These structures are separate from the main chromosomes of the cell and can replicate independently. Plasmids are crucial tools in molecular biology and genetic engineering, serving as vectors to introduce foreign genes into host cells. They often contain genes that confer antibiotic resistance or other beneficial traits to the host organism. Understanding plasmids is essential in fields such as biotechnology, microbiology, and genetics."},"example_sentences":[{"sentence":"The researchers inserted the human gene into a bacterial **plasmid**.","translation":"研究者たちはヒト遺伝子を細菌のプラスミドに挿入した。","type":"noun","meaning_category":"genetics"},{"sentence":"This **plasmid** contains an ampicillin resistance gene.","translation":"このプラスミドはアンピシリン耐性遺伝子を含んでいる。","type":"noun","meaning_category":"genetics"},{"sentence":"**Plasmid** DNA was extracted from the bacterial culture.","translation":"プラスミドDNAが細菌培養から抽出された。","type":"noun","meaning_category":"genetics"}]}