{"word":"Inferribility","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"推論可能であること、推論できる性質","english_definition":"The quality or state of being inferrible; the capability of being inferred.","examples":[{"sentence":"The inferribility of the defendant's guilt from the circumstantial evidence was a key point in the trial.","translation":"状況証拠から被告の有罪を推論できるかどうかが、裁判の重要な点でした。"},{"sentence":"The inferribility of the author's intent is often debated by literary critics.","translation":"作者の意図が推論可能かどうかは、しばしば文芸評論家によって議論されます。"}],"collocations":["assess the inferribility","demonstrate the inferribility","establish the inferribility","lack of inferribility"],"synonyms":["deducibility","derivability","concludability"],"antonyms":["uninferribility","impossibility of inference"]}],"etymology":{"value":"Formed from 'inferrible' (capable of being inferred) + '-ity' (a suffix denoting a state or quality). 'Inferrible' comes from 'infer' (to deduce or conclude from evidence) + '-ible' (capable of).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˌfɜːrɪˈbɪlɪti/","syllables":"in-fer-ri-bi-li-ty"},"inflection":{"noun_plural":"Inferribilities"},"usage_notes":{"explanation":"'Inferribility' is a relatively uncommon term that is primarily used in academic or formal contexts, especially in philosophy, logic, law, and literary analysis. It refers to the degree to which a conclusion can be logically derived or deduced from given premises or evidence. The term emphasizes the potential for a valid inference to be made, rather than the actual act of inferring.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The inferribility was high.","correct":"✓ The degree of inferribility was high.","note":"'Inferribility' is a quality or state, not a quantifiable amount. Therefore, it is more appropriate to speak of the 'degree of inferribility' or to use a related adjective like 'inferrible' (e.g., 'The conclusion was highly inferrible')."},{"incorrect":"✗ Inferribility is when you guess something.","correct":"✓ Inferribility is the quality of being able to be logically inferred.","note":"'Inferribility' refers to the capability of being inferred, not the act of guessing or inferring itself. It is about the logical relationship between premises and conclusion."}],"priority":"★★☆"},"related_words":{"derivatives":["inferrible (adjective)","infer (verb)","inference (noun)"],"related_terms":["deducibility","derivability","concludability","implication","entailment"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Inferribility' is a formal and abstract noun that describes the quality of being able to be logically concluded or deduced from something else. It's not a common word, and you're most likely to come across it in academic writing, particularly in areas like philosophy, law, or literary criticism. It focuses on whether a conclusion can be validly drawn from the available information, rather than the act of drawing the conclusion itself. If something has a high degree of 'inferribility', it means you can confidently deduce it based on the evidence or premises provided."},"example_sentences":[{"sentence":"The legal team argued for the inferribility of causation between the company's actions and the environmental damage.","translation":"弁護団は、会社の行為と環境破壊の間に因果関係を推論できると主張した。","type":"general","meaning_category":"推論可能性"},{"sentence":"Critics questioned the inferribility of the director's political views from the symbolism in the film.","translation":"批評家たちは、映画の象徴から監督の政治的見解を推論できるかどうか疑問を呈した。","type":"general","meaning_category":"推論可能性"}]}