{"word":"tricyanide","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A compound containing three cyanide groups.","english_definition":"A chemical compound that contains three cyanide (CN) groups.","examples":[{"sentence":"Tricyanide compounds are used in various industrial processes.","translation":"トリシアン化物化合物は、さまざまな工業プロセスで使用されています。"},{"sentence":"The synthesis of tricyanide derivatives is a complex process.","translation":"トリシアン化物誘導体の合成は複雑なプロセスです。"}],"collocations":["tricyanide compound","tricyanide derivative","synthesis of tricyanide"],"synonyms":["cyanide compound"],"antonyms":[]}],"etymology":{"value":"The prefix 'tri-' indicates three, and 'cyanide' refers to the cyanide group (CN).","priority":"★★★"},"pronunciation":{"ipa":"/traɪˈsaɪənaɪd/","syllables":"tri-cy-a-nide"},"inflection":{"noun_plural":"tricyanides"},"usage_notes":{"explanation":"Tricyanides are a class of chemical compounds characterized by the presence of three cyanide (CN) functional groups within their molecular structure. These compounds are often encountered in specialized chemical applications, such as in the synthesis of complex organic molecules or in certain industrial processes. Due to the toxicity associated with cyanide, handling and use of tricyanides require strict safety protocols and expertise.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Tricyanide is a element.","correct":"✓ Tricyanide is a compound.","note":"Tricyanide is a compound, not an element."},{"incorrect":"✗ Tricyanide is safe to handle.","correct":"✓ Tricyanide requires careful handling due to its toxicity.","note":"Tricyanide compounds are toxic and require careful handling."}],"priority":"★☆☆"},"related_words":{"derivatives":["cyanide","dicyanide","tetracyanide"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'tricyanide' refers to a specific type of chemical compound that contains three cyanide groups. It is a technical term primarily used in chemistry. Understanding this term requires a background in chemistry, particularly organic or inorganic chemistry, to comprehend the compound's structure and properties. Due to its specialized nature, it is not commonly encountered in everyday language or general texts.","example_sentences":[]}}