{"word":"neuriatry","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"神経病学、精神医学","english_definition":"The branch of medicine dealing with the nervous system and its disorders; neurology and psychiatry.","examples":[{"sentence":"Neuriatry encompasses the study and treatment of conditions affecting the brain, spinal cord, and nerves.","translation":"神経病学は、脳、脊髄、および神経に影響を与える状態の研究と治療を包含する。"},{"sentence":"Advances in neuriatrics have led to improved diagnostic and therapeutic approaches for neurological disorders.","translation":"神経病学の進歩は、神経疾患の診断および治療アプローチの改善につながった。"}],"collocations":["clinical neuriatrics","pediatric neuriatrics","research neuriatrics"],"synonyms":["neurology","psychiatry","neuropsychiatry"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'neuron' (nerve) and 'iatreia' (healing, medical treatment).","priority":"★★★"},"pronunciation":{"ipa":"/njʊˈraɪətri/","syllables":"neu-ri-a-try"},"inflection":{"noun_plural":"neuriatries"},"usage_notes":{"explanation":"The term 'neuriatry' is somewhat archaic and less commonly used in modern medical terminology. It generally refers to the combined fields of neurology and psychiatry, focusing on disorders of the nervous system and their related mental and emotional aspects. In contemporary usage, neurology and psychiatry are typically treated as distinct but related specialties.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is studying neuriatrics to become a brain surgeon.","correct":"✓ He is studying neurosurgery to become a brain surgeon.","note":"Neurosurgery is the surgical specialty, while neuriatrics is the broader field encompassing neurology and psychiatry."},{"incorrect":"✗ Neuriatry is only concerned with mental illnesses.","correct":"✓ Neuriatry (historically) encompasses both mental and neurological illnesses.","note":"Historically, neuriatrics included both neurological and psychiatric conditions, but modern usage often separates these fields."}],"priority":"★★☆"},"related_words":{"derivatives":["neuriatric (adjective)"],"phrases":["neuropsychiatric","neurological","psychiatric"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - The term is not commonly used in modern English.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Neuriatry' is an older term that combines the fields of neurology and psychiatry, dealing with disorders of the nervous system and related mental health issues. It's not as commonly used today, with neurology and psychiatry typically treated as separate specialties. If you encounter this term, understand that it refers to the intersection of these two medical areas."},"example_sentences":[{"sentence":"The old textbook described the treatment of depression under the section of neuriatrics.","translation":"その古い教科書は、神経病学のセクションでうつ病の治療について説明していた。","type":"general","meaning_category":"general"},{"sentence":"The hospital once had a dedicated department for neuriatrics, but it has since been divided into neurology and psychiatry.","translation":"その病院にはかつて神経病学の専門部署があったが、その後神経内科と精神科に分割された。","type":"historical","meaning_category":"historical"}]}