{"word":"leucocytolytic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"白血球溶解性の","english_definition":"Capable of destroying or lysing leukocytes (white blood cells).","examples":[{"sentence":"The leucocytolytic activity of the substance was observed in vitro.","translation":"その物質の白血球溶解活性がインビトロで観察された。"}],"collocations":["leucocytolytic agent","leucocytolytic activity"],"synonyms":["leukocytolytic"],"antonyms":["leukocyte-sparing","leukocyte-protective"]}],"etymology":{"value":"Derived from 'leukocyte' (white blood cell) + '-lytic' (capable of dissolving or destroying).","priority":"★★★"},"pronunciation":{"ipa":"ˌluːkoʊˌsaɪtəˈlɪtɪk","syllables":"lu-co-cy-to-ly-tic"},"inflection":{"notes":"Adjective; comparative and superlative forms are formed using 'more' and 'most', respectively (e.g., more leucocytolytic, most leucocytolytic)."},"usage_notes":{"explanation":"'Leucocytolytic' describes a substance or process that causes the destruction or lysis of leukocytes. It is primarily used in medical and scientific contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The leucocytolytic is high.","correct":"✓ The leucocytolytic activity is high.","note":"'Leucocytolytic' is an adjective, so it must modify a noun. It cannot stand alone as a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["leucocytolysin (noun): a substance that causes the lysis of leukocytes","leukocyte (noun): white blood cell","lysis (noun): the disintegration of a cell by rupture of the cell wall or membrane"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - Primarily used in specialized medical and scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Leucocytolytic' is a highly specialized term used in the fields of medicine, immunology, and hematology. It describes the property of a substance or process that is capable of lysing or destroying leukocytes (white blood cells). Understanding this term requires a strong background in biology and medical terminology. It is rarely encountered outside of scientific publications and advanced medical discussions."},"example_sentences":[{"sentence":"Certain viruses exhibit a strong leucocytolytic effect on specific types of white blood cells.","translation":"特定のウイルスは、特定の種類の白血球に対して強い白血球溶解効果を示す。","type":"scientific","meaning_category":"medical"},{"sentence":"The research investigated the leucocytolytic potential of a novel compound against leukemia cells.","translation":"その研究では、白血病細胞に対する新規化合物の白血球溶解能が調査された。","type":"scientific","meaning_category":"medical"}]}