{"word":"non-hot-pluggable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ホットプラグに対応していない、ホットスワップに対応していない","english_definition":"Not capable of being hot-plugged or hot-swapped; requiring the system to be powered down before the device can be connected or disconnected.","examples":[{"sentence":"This older device is non-hot-pluggable, so you must shut down the computer before installing it.","translation":"この古いデバイスはホットプラグに対応していないため、インストールする前にコンピュータをシャットダウンする必要があります。"},{"sentence":"Unlike the newer models, this card is non-hot-pluggable.","translation":"新しいモデルとは異なり、このカードはホットプラグに対応していません。"}],"collocations":["non-hot-pluggable device (ホットプラグに対応していないデバイス)","non-hot-pluggable card (ホットプラグに対応していないカード)"],"synonyms":["not hot-pluggable","not hot-swappable"],"antonyms":["hot-pluggable","hot-swappable"]}],"etymology":{"value":"The term is formed by adding the prefix 'non-' (meaning 'not') to 'hot-pluggable'. 'Hot-pluggable' itself refers to the ability to plug in or unplug a device while the system is running (i.e., 'hot').","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn hɒt ˈplʌɡəbəl/","syllables":"non-hot-plug-ga-ble"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Non-hot-pluggable' describes hardware that cannot be safely connected or disconnected while the system is powered on. Attempting to do so can result in damage to the device, the system, or both. This is in contrast to 'hot-pluggable' devices, which are designed to be safely added or removed without interrupting system operation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The USB drive is non hot pluggable.","correct":"✓ The USB drive is non-hot-pluggable.","note":"The correct form is 'non-hot-pluggable', with hyphens separating the words."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["hot-pluggable","hot-swap","plug and play","cold swap"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'non-hot-pluggable' is a technical term used in the context of computer hardware and electronics. It describes devices that cannot be safely connected or disconnected while the system is running. Understanding this term requires familiarity with basic computer hardware concepts.","priority":"★★★"},"example_sentences":[{"sentence":"Always check the device specifications to determine if it is hot-pluggable or non-hot-pluggable.","translation":"デバイスがホットプラグに対応しているか否かを判断するために、必ずデバイスの仕様を確認してください。","type":"general","meaning_category":"definition"},{"sentence":"The server's older expansion slots are non-hot-pluggable, requiring a full system shutdown for upgrades.","translation":"サーバーの古い拡張スロットはホットプラグに対応していないため、アップグレードにはシステム全体のシャットダウンが必要です。","type":"technical","meaning_category":"hardware"}]}