{"word":"state-legislated","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"州法で定められた、州の法律によって規定された","english_definition":"Established, required, or regulated by a state's laws or legislature.","examples":[{"sentence":"The program is state-legislated, ensuring consistent standards across all participating schools.","translation":"そのプログラムは州法で定められており、参加するすべての学校で一貫した基準が保証されています。"},{"sentence":"State-legislated mandates often address issues such as education, healthcare, and environmental protection.","translation":"州法で定められた義務は、教育、医療、環境保護などの問題に対処することがよくあります。"},{"sentence":"The state-legislated funding for the project was approved by the senate.","translation":"そのプロジェクトに対する州法で定められた資金は、上院で承認されました。"}],"collocations":["state-legislated mandate (州法で定められた義務)","state-legislated funding (州法で定められた資金)","state-legislated standards (州法で定められた基準)","state-legislated requirements (州法で定められた要件)"],"synonyms":["statutory","legally mandated","state-mandated","legally required","legislatively enacted"],"antonyms":["voluntary","optional","federal","unregulated"]}],"etymology":{"value":"The word is formed by combining 'state' (referring to a U.S. state or similar political division), 'legislated' (meaning enacted or established by legislation), and connecting them with a hyphen.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsteɪt ˌlɛdʒɪsˌleɪtɪd/","syllables":"state-leg-is-la-ted"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'State-legislated' is used to describe something that has been created or controlled by laws passed at the state level. It indicates that the specific requirements, funding, or regulations are the result of legislative action within a particular state. This term is commonly used in discussions about education, healthcare, environmental policy, and other areas where states have significant regulatory authority.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The federal government state-legislated the new law.","correct":"✓ The state government state-legislated the new law.","note":"The term 'state-legislated' refers to laws enacted by a state government, not the federal government."},{"incorrect":"✗ This is a state legislated program.","correct":"✓ This is a state-legislated program.","note":"The hyphen is important to correctly link 'state' and 'legislated' to form a compound adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["legislation (法律制定)","legislature (州議会)","state law (州法)","federal law (連邦法)"],"phrases":["state government (州政府)","federal government (連邦政府)","legislative branch (立法府)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency - Primarily used in legal and political contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'State-legislated' is a term used in legal and political contexts to describe something that has been created or controlled by laws passed at the state level. It is often used in discussions about education, healthcare, and environmental policy. Because it is a compound adjective, it is important to use a hyphen to connect 'state' and 'legislated'. It's also important to remember that 'state-legislated' refers to laws enacted by a state government, not the federal government."},"example_sentences":[{"sentence":"The state-legislated curriculum requires all students to take a course in civics.","translation":"州法で定められたカリキュラムでは、すべての学生が公民のコースを受講する必要があります。","type":"adjective","meaning_category":"法律で定められた"},{"sentence":"The state-legislated tax incentives are designed to attract new businesses to the area.","translation":"州法で定められた税制上の優遇措置は、新しい企業をこの地域に誘致するように設計されています。","type":"adjective","meaning_category":"法律で定められた"},{"sentence":"The state-legislated regulations on emissions are stricter than the federal standards.","translation":"州法で定められた排出量に関する規制は、連邦基準よりも厳格です。","type":"adjective","meaning_category":"法律で定められた"}]}