{"word":"dysregulation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"調節障害、制御不全、機能不全","english_definition":"A state of impaired or disrupted regulation or control of a system or process, especially within a biological, psychological, or social context.","examples":[{"sentence":"Emotional dysregulation is a core feature of borderline personality disorder.","translation":"感情調節障害は、境界性パーソナリティ障害の中核的な特徴です。"},{"sentence":"Immune dysregulation can lead to autoimmune diseases.","translation":"免疫調節障害は、自己免疫疾患につながる可能性があります。"},{"sentence":"The study examined the role of neural dysregulation in the development of anxiety disorders.","translation":"その研究では、不安障害の発症における神経調節障害の役割を調査しました。"},{"sentence":"Metabolic dysregulation is often observed in patients with diabetes.","translation":"代謝調節障害は、糖尿病患者によく見られます。"}],"collocations":["emotional dysregulation (感情調節障害)","immune dysregulation (免疫調節障害)","neural dysregulation (神経調節障害)","metabolic dysregulation (代謝調節障害)","hormonal dysregulation (ホルモン調節障害)","genetic dysregulation (遺伝子調節障害)","physiological dysregulation (生理学的調節障害)"],"synonyms":["imbalance","disorder","malfunction","impairment","disruption","instability","abnormality"],"antonyms":["regulation","balance","control","stability","homeostasis"]}],"etymology":{"value":"The word \"dysregulation\" is formed by combining the prefix \"dys-\" (meaning bad, difficult, or impaired) with the noun \"regulation\" (the process of controlling something or operating according to a rule).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɪsˌreɡjʊˈleɪʃən/","syllables":"dis-reg-u-la-tion"},"inflection":{"noun_plural":"dysregulations"},"usage_notes":{"explanation":"\"Dysregulation\" refers to a condition where a system or process is not functioning properly due to a failure in its regulatory mechanisms. This term is commonly used in medical, psychological, and biological contexts to describe a wide range of conditions, from emotional instability to metabolic disorders. It emphasizes the breakdown of the normal regulatory processes rather than a specific disease or condition.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient has a dysregulation of their emotions.","correct":"✓ The patient has dysregulation of their emotions. / ✓ The patient experiences emotional dysregulation.","note":"\"Dysregulation\" itself implies a state or condition, so adding \"a\" before it is usually incorrect. It is more common to use it without an article or to use it as part of a compound noun like \"emotional dysregulation.\""},{"incorrect":"✗ Dysregulation is when the body regulates itself too much.","correct":"✓ Dysregulation is when the body does not regulate itself properly.","note":"\"Dysregulation\" means the opposite of proper regulation; it signifies impaired or insufficient regulation, not excessive regulation."}],"priority":"★★☆"},"related_words":{"derivatives":["dysregulate (verb): to impair the regulation of","dysregulated (adjective): characterized by dysregulation","regulation (noun): the process of controlling something","regulate (verb): to control something"],"phrases":["self-regulation (自己調節)","co-regulation (共同調節)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively infrequent, primarily used in academic and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Dysregulation\" is a technical term primarily used in medical, psychological, and scientific contexts. It describes a state where a system's normal regulatory mechanisms are impaired, leading to instability or malfunction. Understanding this word requires familiarity with the concept of regulation and the prefix \"dys-\", which indicates impairment or abnormality. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The child's aggressive behavior may be a sign of emotional **dysregulation**.","translation":"その子供の攻撃的な行動は、感情調節障害の兆候である可能性があります。","type":"noun","meaning_category":"調節障害"},{"sentence":"Chronic stress can lead to hormonal **dysregulation**.","translation":"慢性的なストレスは、ホルモン調節障害につながる可能性があります。","type":"noun","meaning_category":"調節障害"},{"sentence":"Researchers are investigating the genetic basis of immune **dysregulation**.","translation":"研究者たちは、免疫調節障害の遺伝的基盤を調査しています。","type":"noun","meaning_category":"調節障害"},{"sentence":"Effective interventions can help individuals improve their emotional **dysregulation** skills.","translation":"効果的な介入は、個人が感情調節障害のスキルを向上させるのに役立ちます。","type":"noun","meaning_category":"調節障害"}]}