{"word":"anodization","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"陽極酸化処理、アルマイト処理","english_definition":"An electrolytic passivation process used to increase the thickness of the natural oxide layer on the surface of metal parts.","examples":[{"sentence":"Anodization is commonly used to protect aluminum alloys from corrosion.","translation":"陽極酸化処理は、アルミニウム合金を腐食から保護するために一般的に使用されます。"},{"sentence":"The anodization process can also be used to dye the metal surface.","translation":"陽極酸化処理は、金属表面を染色するためにも使用できます。"},{"sentence":"Anodization improves the wear resistance and aesthetic appeal of the metal.","translation":"陽極酸化処理は、金属の耐摩耗性と美的魅力を向上させます。"}],"collocations":["aluminum anodization (アルミニウム陽極酸化処理)","titanium anodization (チタン陽極酸化処理)","hard anodization (硬質陽極酸化処理)","sulfuric acid anodization (硫酸陽極酸化処理)","chromic acid anodization (クロム酸陽極酸化処理)"],"synonyms":["electrolytic oxidation","anodic oxidation","anodizing"],"antonyms":[]}],"etymology":{"value":"'Anodization' is derived from 'anode' (the positive electrode) and '-ization' (the process of making or becoming).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌænədaɪˈzeɪʃən/","syllables":"a-nod-i-za-tion"},"inflection":{"noun_plural":"anodizations"},"usage_notes":{"explanation":"'Anodization' refers to the electrochemical process of forming a protective oxide layer on a metal surface, typically aluminum. This layer enhances corrosion resistance, wear resistance, and can be used for decorative purposes. The process involves immersing the metal in an electrolytic solution and passing an electric current through it, causing the oxide layer to grow.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The anodization was applied to the plastic.","correct":"✓ The anodization was applied to the aluminum.","note":"Anodization is primarily used on metals, especially aluminum, not plastics."},{"incorrect":"✗ Anodization is painting the metal.","correct":"✓ Anodization is oxidizing the metal surface.","note":"Anodization is an electrochemical process that grows an oxide layer, not a coating like paint."}],"priority":"★★☆"},"related_words":{"derivatives":["anodize (verb: 陽極酸化処理する)","anodized (adjective: 陽極酸化処理された)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Anodization' is a technical term used in materials science and engineering. It describes a process where a metal, usually aluminum, is treated to form a protective oxide layer on its surface. This layer makes the metal more resistant to corrosion and wear. The process is electrochemical, meaning it involves electricity and chemical reactions. While not a common word in everyday conversation, it's important in specific technical contexts."},"example_sentences":[{"sentence":"The aircraft components underwent anodization to improve their durability.","translation":"航空機の部品は、耐久性を向上させるために陽極酸化処理を受けました。","type":"noun","meaning_category":"陽極酸化処理"},{"sentence":"Anodization is essential for protecting aluminum in marine environments.","translation":"陽極酸化処理は、海洋環境でアルミニウムを保護するために不可欠です。","type":"noun","meaning_category":"陽極酸化処理"},{"sentence":"The company specializes in hard anodization for industrial applications.","translation":"その会社は、産業用途向けの硬質陽極酸化処理を専門としています。","type":"noun","meaning_category":"陽極酸化処理"},{"sentence":"Different electrolytes can be used to achieve various colors during anodization.","translation":"陽極酸化処理中にさまざまな色を実現するために、異なる電解質を使用できます。","type":"noun","meaning_category":"陽極酸化処理"}]}