{"word":"tlayuda","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"トラユダ：メキシコ、オアハカ州の郷土料理。巨大なクリスピーなトルティーヤに豆ペースト、ケソ・オアハカ（チーズ）、レタス、肉（牛肉、豚肉、鶏肉、またはチョリソ）などのトッピングを乗せたもの。","english_definition":"A tlayuda is a handmade dish in the state of Oaxaca, Mexico. It consists of a large, thin, crispy or slightly chewy tortilla covered with a spread of refried beans, quesillo (Oaxaca cheese), lettuce or cabbage, avocado, salsa, and a choice of meat.","examples":[{"sentence":"We ordered tlayudas with tasajo (thinly sliced grilled beef) at the market.","translation":"私たちは市場でタサホ（薄切りグリル牛肉）のトラユダを注文しました。"},{"sentence":"Tlayudas are often served as street food in Oaxaca.","translation":"トラユダはオアハカではよく屋台料理として提供されます。"}],"collocations":["tlayuda oaxaqueña (オアハカのトラユダ)","tlayuda with tasajo (タサホのトラユダ)","eat a tlayuda (トラユダを食べる)","order a tlayuda (トラユダを注文する)"],"synonyms":["Oaxacan pizza","Mexican pizza"],"antonyms":[]}],"etymology":{"value":"ナワトル語の「tlaolli」（トウモロコシの粒）に由来すると考えられている。","priority":"★☆☆"},"pronunciation":{"ipa":"/tlaˈʝu.da/","syllables":"tla-yu-da"},"inflection":{"noun_plural":"tlayudas"},"usage_notes":{"explanation":"Tlayudas are a popular regional dish in Oaxaca, Mexico, and are often compared to a Mexican pizza due to their large, flat, and shareable nature. The tortilla used for tlayudas is larger and thinner than regular tortillas, and it is traditionally cooked on a comal (a flat griddle).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I want a tlayuda with many meats.","correct":"✓ I want a tlayuda with a variety of meats.","note":"While you can have a tlayuda with multiple types of meat, 'many meats' is not the most natural way to express this. 'A variety of meats' is better."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word 'tlayuda' refers to a specific regional dish from Oaxaca, Mexico. Understanding the term requires some familiarity with Mexican cuisine. The dish itself is relatively simple, consisting of a large tortilla with various toppings, but the cultural context is important for full comprehension."},"example_sentences":[{"sentence":"The best tlayudas are found in the markets of Oaxaca.","translation":"最高のトラユダはオアハカの市場で見つかります。","type":"noun","meaning_category":"郷土料理"},{"sentence":"Each tlayuda vendor has their own unique recipe and toppings.","translation":"各トラユダの露店商は独自のレシピとトッピングを持っています。","type":"noun","meaning_category":"郷土料理"}]}