{"word":"anthomaniac","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"花狂い、花愛好家、花に異常な執着を持つ人","english_definition":"A person with an excessive enthusiasm for flowers.","examples":[{"sentence":"He was considered an anthomaniac because he spent all his time and money collecting rare orchids.","translation":"彼は珍しい蘭を集めることに全ての時間とお金を費やしていたので、花狂いだと見なされていた。"},{"sentence":"The anthomaniac's garden was filled with a dazzling array of colorful blooms.","translation":"その花狂いの庭は、まばゆいばかりのカラフルな花々で埋め尽くされていた。"}],"collocations":["rare orchid anthomaniac","dazzling bloom anthomaniac"],"synonyms":["flower enthusiast","flower lover","horticultural fanatic"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'anthos' (flower) and 'mania' (madness, frenzy).","priority":"★★☆"},"pronunciation":{"ipa":"ˌænθoʊˈmeɪniæk/","syllables":"an-tho-ma-ni-ac"},"inflection":{"noun_plural":"anthomaniacs"},"usage_notes":{"explanation":"The term 'anthomaniac' is used to describe someone who is extremely passionate about flowers, sometimes to an obsessive degree. It is not a commonly used word, and can sometimes carry a slightly negative connotation, suggesting that the person's interest in flowers is excessive or irrational.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is an anthomaniac of cars.","correct":"✓ She is an anthomaniac; she loves flowers.","note":"'Anthomaniac' specifically refers to an obsession with flowers, not other things like cars."}],"priority":"★☆☆"},"related_words":{"derivatives":["anthomania (noun: an excessive enthusiasm for flowers)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Rare word)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Anthomaniac' is a rare and specialized word used to describe someone with an extreme passion for flowers. It combines 'antho-' (flower) and '-mania' (obsession). Due to its rarity, it's unlikely to be encountered in everyday conversation and is more likely to appear in specialized texts or discussions about horticulture or psychology."},"example_sentences":[{"sentence":"The old woman was known in the village as an anthomaniac, due to her vast and meticulously cared-for flower garden.","translation":"その老女は、広大で手入れの行き届いた花壇のせいで、村では花狂いとして知られていた。","type":"noun","meaning_category":"花に異常な執着を持つ人"},{"sentence":"His anthomaniac tendencies led him to spend his entire fortune on acquiring the rarest and most exotic blooms from around the world.","translation":"彼の花狂いの傾向は、彼に世界中から最も希少でエキゾチックな花を手に入れるために全財産を費やさせた。","type":"noun","meaning_category":"花愛好家"}]}