{"word":"plussage","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(養蜂) 巣箱に余分なミツバチを追加して、蜂蜜の生産量を増やすこと","english_definition":"(beekeeping) The practice of adding extra bees to a hive to increase honey production.","examples":[{"sentence":"Plussage can be a useful technique for boosting honey yields in a strong nectar flow.","translation":"プラサージュは、豊富な蜜源がある場合に蜂蜜の収量を増やすための有用な技術となり得る。"}],"collocations":["perform plussage","practice plussage","increase honey production through plussage"],"synonyms":["boosting","augmentation"],"antonyms":["reduction","decrease"]}],"etymology":{"value":"The term 'plussage' is derived from the French word 'plus', meaning 'more'. It reflects the practice of adding 'more' bees to a hive.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈplʌsɪdʒ/","syllables":"plus-sage"},"inflection":{"noun_plural":"plussages"},"usage_notes":{"explanation":"'Plussage' is a specialized term used within the context of beekeeping. It refers specifically to the act of supplementing an existing bee colony with additional bees to enhance honey production. It is not a commonly used word outside of this specific field.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plussage of the garden improved the flowers.","correct":"✓ The addition of fertilizer improved the flowers.","note":"'Plussage' is specific to beekeeping and adding bees to a hive. It cannot be used generally to describe adding something to improve something else."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["beekeeping","apiculture","honey production","bee colony","hive"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (specialized term)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Plussage' is a highly specialized term used in beekeeping. It refers to the practice of adding extra bees to a hive to increase honey production. Due to its niche usage, it is not commonly encountered in general English. Understanding this term requires knowledge of beekeeping practices.","priority":"★☆☆"},"example_sentences":[{"sentence":"The beekeeper decided to perform plussage to maximize honey production before the end of the season.","translation":"養蜂家は、シーズンが終わる前に蜂蜜の生産量を最大化するためにプラサージュを行うことに決めた。","type":"noun","meaning_category":"beekeeping"},{"sentence":"Plussage is most effective when the colony is already strong and there is a good nectar flow.","translation":"プラサージュは、コロニーがすでに強く、豊富な蜜源がある場合に最も効果的である。","type":"noun","meaning_category":"beekeeping"}]}