{"word":"celliform","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Cell-shaped; having the shape of a cell.","english_definition":"Having the shape of a cell.","examples":[{"sentence":"The celliform structures were visible under the microscope.","translation":"その細胞状の構造は顕微鏡下で観察できた。"},{"sentence":"The artist created celliform sculptures using glass.","translation":"その芸術家はガラスを使って細胞状の彫刻を制作した。"}],"collocations":["celliform structure","celliform design","celliform pattern"],"synonyms":["cellular","cell-like"],"antonyms":[]}],"etymology":{"value":"Derived from 'cell' (referring to a biological cell or a small room) and 'form' (shape).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɛlɪfɔrm/","syllables":"cel-li-form"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. Comparative and superlative forms are 'more celliform' and 'most celliform', respectively, though these are rarely used."},"usage_notes":{"explanation":"'Celliform' is a descriptive term mainly used in scientific or artistic contexts to describe something that resembles the shape of a biological cell. It is not a commonly used word.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building had a celliform of rooms.","correct":"✓ The building had a celliform arrangement of rooms.","note":"'Celliform' is an adjective, so it needs to modify a noun. 'Celliform of rooms' is grammatically incorrect. Use 'celliform arrangement of rooms' or similar. "},{"incorrect":"✗ The celliform was visible.","correct":"✓ The celliform structure was visible.","note":"'Celliform' is an adjective, not a noun. You need to specify what is celliform by adding a noun after it."}],"priority":"★☆☆"},"related_words":{"derivatives":["cell (noun)","form (noun)","cellular (adjective)"],"phrases":[]},"level_frequency":{"CEFR":"N/A (Very rare - not in CEFR vocabulary lists)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'celliform' is a technical term used to describe something that has the shape of a cell. It is not commonly used in everyday language and is more likely to be encountered in scientific or specialized contexts. Understanding the etymology (cell + form) can help in grasping its meaning. It is an adjective, so it will always modify a noun."},"example_sentences":[{"sentence":"The honeycomb structure exhibited a celliform pattern.","translation":"ハニカム構造は細胞状のパターンを示した。","type":"adjective","meaning_category":"cell-shaped"},{"sentence":"The architect designed celliform windows for the new laboratory.","translation":"建築家は新しい研究所のために細胞状の窓を設計した。","type":"adjective","meaning_category":"cell-shaped"}]}