{"word":"FRS","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"Acronym for Family Radio Service. A short-distance, license-free radio service in the UHF band used for two-way voice communication.","english_definition":"A short-distance, license-free radio service in the UHF band used for two-way voice communication.","examples":[{"sentence":"We used FRS radios to communicate between cars on the road trip.","translation":"ロードトリップ中、車間で連絡を取るためにFRS無線機を使用しました。"},{"sentence":"FRS radios are commonly used for recreational activities like hiking and camping.","translation":"FRS無線機はハイキングやキャンプなどのレクリエーション活動によく使用されます。"}],"collocations":["FRS radio","FRS channel","use FRS","FRS range"],"synonyms":["walkie-talkie","two-way radio"],"antonyms":[]}],"etymology":{"value":"Acronym derived from the initial letters of Family Radio Service.","priority":"Medium"},"pronunciation":{"ipa":"/ˌɛfˌɑːrˈɛs/","syllables":"F-R-S"},"inflection":{"noun_plural":"FRSs"},"usage_notes":{"explanation":"FRS radios are designed for short-range communication and do not require a license to operate in the United States. They typically have a limited number of channels and power output.","priority":"High"},"common_mistakes":{"examples":[{"incorrect":"FRS radios are as powerful as ham radios.","correct":"FRS radios are less powerful than ham radios.","note":"FRS radios have limited power compared to amateur (ham) radios."}],"priority":"Medium"},"related_words":{"derivatives":[],"related_terms":["GMRS (General Mobile Radio Service)","UHF (Ultra High Frequency)","radio","walkie-talkie"],"priority":"Medium"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"Low"},"readability_explanation":{"level":"B2","text":"\"FRS\" stands for Family Radio Service. It's a type of short-range radio communication system that doesn't require a license to use. Think of it like walkie-talkies that you might use when hiking or camping to stay in touch with your group. Because it's license-free, the range and power are limited compared to other radio services like GMRS or ham radio."},"example_sentences":[{"sentence":"The family used FRS radios to coordinate their activities at the amusement park.","translation":"家族は遊園地での活動を調整するためにFRS無線機を使用しました。","type":"noun","meaning_category":"communication"},{"sentence":"Make sure your FRS radio is charged before heading out on the trail.","translation":"トレイルに出かける前に、FRS無線機が充電されていることを確認してください。","type":"noun","meaning_category":"equipment"}]}