{"word":"zithers","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ツィター（チター）：弦楽器の一種。平らな共鳴箱の上に張られた多数の弦を弾いて演奏する。","english_definition":"Plural form of zither: a musical instrument consisting of a flat wooden sound box with numerous strings stretched across it, played horizontally by plucking or strumming.","examples":[{"sentence":"He collected various zithers from around the world.","translation":"彼は世界中から様々なツィターを集めた。"},{"sentence":"The orchestra included several zithers in the ensemble.","translation":"そのオーケストラはアンサンブルにいくつかのツィターを含めていた。"}],"collocations":["play zithers","collect zithers","stringed zithers","alpine zithers"],"synonyms":["psaltery","dulcimer","autoharp"],"antonyms":[]}],"etymology":{"value":"The word 'zither' comes from the German word 'Zither', which in turn is derived from the Greek word 'kithara' (κιθάρα), a type of ancient Greek stringed instrument similar to a lyre or harp.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈzɪðərz/","syllables":"zi-thers"},"inflection":{"noun_plural":"zithers"},"usage_notes":{"explanation":"'Zithers' is simply the plural form of 'zither'. A zither is a stringed instrument, and the plural form is used when referring to multiple instruments. It is not a commonly used word in everyday conversation, but it is used in musical contexts and when discussing musical instruments.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He plays zither very well.","correct":"✓ He plays the zither very well.","note":"When referring to a specific instrument in general, it is common to use the definite article 'the' before the instrument name."},{"incorrect":"✗ zithers is a string instrument.","correct":"✓ Zithers are string instruments.","note":"Since 'zithers' is plural, the verb should also be plural ('are' instead of 'is')."}],"priority":"★★☆"},"related_words":{"derivatives":["zitherist (noun: a person who plays the zither)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Very low frequency)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'zithers' refers to multiple zithers, which are stringed musical instruments. This word is not commonly used in everyday language and is more likely to appear in contexts related to music, musical instruments, or ethnomusicology. Understanding this word requires some familiarity with musical instruments. The plural form is straightforward, simply adding an 's' to the singular form 'zither'."},"example_sentences":[{"sentence":"The museum displayed a collection of antique zithers.","translation":"その博物館はアンティークのツィターのコレクションを展示していた。","type":"noun","meaning_category":"楽器"},{"sentence":"Several zithers were used to create the unique sound in the film score.","translation":"映画のサウンドトラックで独特な音を出すために、いくつかのツィターが使用された。","type":"noun","meaning_category":"楽器"},{"sentence":"The musician is known for his mastery of various zithers.","translation":"その音楽家は様々なツィターの熟練した演奏で知られている。","type":"noun","meaning_category":"楽器"}]}