{"word":"nonpersistently","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"持続性なく、永続的でなく、一時的に","english_definition":"in a manner that is not persistent; temporarily or without lasting effect.","examples":[{"sentence":"The data was stored nonpersistently, so it was lost after the system rebooted.","translation":"データは非永続的に保存されたため、システム再起動後に失われました。"},{"sentence":"The application cached the information nonpersistently to improve performance.","translation":"アプリケーションはパフォーマンスを向上させるために、情報を非永続的にキャッシュしました。"},{"sentence":"The changes were applied nonpersistently, meaning they would not be saved to the configuration file.","translation":"変更は非永続的に適用されたため、構成ファイルには保存されません。"}],"collocations":["store data nonpersistently","cache information nonpersistently","apply changes nonpersistently"],"synonyms":["temporarily","transiently","ephemerally","fleetingly","momentarily"],"antonyms":["persistently","permanently","durably","enduringly"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to 'persistently'. 'Persistently' comes from 'persistent', which originates from the Latin word 'persistere' (to continue steadfastly).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnpərˈsɪstəntli/","syllables":"non-per-sis-tent-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Nonpersistently' describes actions or processes that do not create lasting effects or permanent storage. It is often used in technical contexts, such as software development and data management, to indicate that data or changes are temporary and will not be retained after a system is shut down or a process is completed.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The application runs non persistent.","correct":"✓ The application runs nonpersistently.","note":"'Nonpersistently' is an adverb and modifies the verb 'runs'. 'Non persistent' is an adjective phrase and would need a linking verb like 'is' (e.g., 'The application is non persistent')."},{"incorrect":"✗ The data is saved non-persistently on the hard drive.","correct":"✓ The data is not saved persistently on the hard drive.","note":"Saving data on a hard drive implies persistence. If you want to express that the data is not saved permanently, it's clearer to say 'not saved persistently' or 'saved temporarily' rather than 'non-persistently on the hard drive'."}],"priority":"★☆☆"},"related_words":{"derivatives":["nonpersistent (adjective)","persistence (noun)","persistent (adjective)","persistently (adverb)","persist (verb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nonpersistently' is a technical term that means something is done in a way that doesn't last or isn't saved permanently. It's often used in computer science to describe data that is only stored temporarily and is lost when the system is turned off or restarted. Because it's a specialized word, it's not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The virtual machine stored the temporary files nonpersistently.","translation":"仮想マシンは一時ファイルを非永続的に保存しました。","type":"adverb","meaning_category":"一時的に保存"},{"sentence":"The settings were applied nonpersistently for testing purposes.","translation":"設定はテスト目的で非永続的に適用されました。","type":"adverb","meaning_category":"永続的でない適用"},{"sentence":"The changes to the database were made nonpersistently, so they were not committed.","translation":"データベースへの変更は非永続的に行われたため、コミットされませんでした。","type":"adverb","meaning_category":"持続性のない変更"}]}