{"word":"Celtic-friendly","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(主にサッカーにおいて) セルティックFCのファンやサポーターに好意的な、またはセルティックFCを支持する","english_definition":"(mainly in soccer) Favorable or supportive of Celtic FC, its fans, or its values.","examples":[{"sentence":"The pub is known for being Celtic-friendly, always showing their matches on TV.","translation":"そのパブはセルティックFCの試合をいつもテレビで放映しており、セルティックファンに好意的であることで知られている。"},{"sentence":"The referee was criticized for making several Celtic-friendly decisions during the game.","translation":"審判は試合中、セルティックFCに有利な判定をいくつか行ったとして批判された。"}],"collocations":["Celtic-friendly pub","Celtic-friendly referee","Celtic-friendly atmosphere","Celtic-friendly decision"],"synonyms":["pro-Celtic","Celtic-supporting","Celtic-biased"],"antonyms":["anti-Celtic","Rangers-friendly"],"notes":"This term is primarily used in the context of Scottish football, particularly in relation to Celtic FC and its rivalry with Rangers FC."}],"etymology":{"value":"Combination of 'Celtic' (referring to Celtic Football Club) and 'friendly' (implying a welcoming or supportive attitude).","priority":"N/A"},"pronunciation":{"ipa":"/ˌkɛltɪk ˈfrendli/","syllables":"Cel-tic-friend-ly"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"'Celtic-friendly' is a term used to describe something or someone that is welcoming, supportive, or biased towards Celtic Football Club, its fans, or its values. It's often used in the context of pubs, referees, or media coverage. The term can sometimes carry a negative connotation when used to imply unfair bias.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The restaurant is very friendly Celtic.","correct":"✓ The restaurant is very Celtic-friendly.","note":"The adjective order is important; 'Celtic-friendly' is a compound adjective."}],"priority":"N/A"},"related_words":{"derivatives":["Celtic (adjective, noun)","friendly (adjective)"],"related_terms":["Rangers-friendly (antonym)","Old Firm (the rivalry between Celtic and Rangers)","Celtic FC (Celtic Football Club)"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, specific to football discussions.","priority":"N/A"},"readability_explanation":{"level":"B2","text":"'Celtic-friendly' is a compound adjective used to describe something that is favorable or supportive of Celtic FC, a Scottish football club. It is often used in contexts such as pubs that welcome Celtic fans or referees who are perceived to make decisions favoring the team. Understanding this term requires knowledge of Scottish football culture and the rivalry between Celtic and Rangers. It is not a commonly used term outside of this specific context."},"example_sentences":[{"sentence":"The bar had a Celtic-friendly policy, ensuring a safe and welcoming environment for all supporters.","translation":"そのバーはセルティックファンに優しい方針をとっており、すべてのサポーターにとって安全で歓迎的な環境を保証していた。","type":"adjective","meaning_category":"Supportive environment"},{"sentence":"Some fans felt that the media coverage was too Celtic-friendly.","translation":"一部のファンは、メディアの報道がセルティックに偏りすぎていると感じた。","type":"adjective","meaning_category":"Biased coverage"}]}