{"word":"son-in-lawship","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"義理の息子としての関係、婿としての身分","english_definition":"The state, condition, or relationship of being a son-in-law.","examples":[{"sentence":"He enjoyed his son-in-lawship, feeling welcomed into the family.","translation":"彼は義理の息子としての関係を楽しみ、家族に迎え入れられていると感じた。"},{"sentence":"The responsibilities of son-in-lawship can vary greatly depending on the family.","translation":"婿としての責任は、家族によって大きく異なることがある。"}],"collocations":["enjoy one's son-in-lawship","the duties of son-in-lawship","the responsibilities of son-in-lawship"],"synonyms":["affiliation by marriage","marital connection"],"antonyms":["father-in-lawship","mother-in-lawship","daughter-in-lawship"]}],"etymology":{"value":"Formed by analogy with other '-ship' words, from 'son-in-law' (the relationship by marriage to one's spouse's parents) + '-ship' (a suffix denoting a state, condition, or office).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsʌn ɪn lɔːʃɪp/","syllables":"son-in-law-ship"},"inflection":{"noun_plural":"son-in-lawships"},"usage_notes":{"explanation":"The word 'son-in-lawship' is relatively rare and somewhat formal. It refers to the status or condition of being a son-in-law, emphasizing the relationship and associated responsibilities. It is often used in discussions about family dynamics or legal contexts concerning inheritance or family obligations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a good son-in-lawship with his wife's parents.","correct":"✓ He has a good relationship with his wife's parents.","note":"It's more common to say 'He has a good relationship with his wife's parents' than to use 'son-in-lawship' to describe the relationship itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["son-in-law"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Rare)","frequency_google_ngram":"Extremely low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Son-in-lawship' is a rare and formal term that describes the state or condition of being a son-in-law. It's not commonly used in everyday conversation. Instead, people usually talk about having a good or bad relationship with their in-laws. This word might appear in legal or formal contexts when discussing family relationships and responsibilities."},"example_sentences":[{"sentence":"The nuances of son-in-lawship were often discussed during family gatherings.","translation":"家族の集まりでは、婿としての関係の微妙なニュアンスがよく議論された。","type":"noun","meaning_category":"Relationship"},{"sentence":"His son-in-lawship was marked by respect and consideration for his wife's family.","translation":"彼の婿としての関係は、妻の家族への敬意と配慮によって特徴づけられた。","type":"noun","meaning_category":"Relationship"}]}