{"word":"lithochromatographic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Relating to or using lithochromatography, a method of separating substances by allowing them to diffuse through a layer of powdered rock or mineral.","english_definition":"Relating to or using lithochromatography.","examples":[{"sentence":"The lithochromatographic analysis revealed the presence of several rare earth elements.","translation":"リソクロマトグラフィー分析により、いくつかの希土類元素の存在が明らかになった。"},{"sentence":"Lithochromatographic techniques are used in geochemical studies to separate and identify different minerals.","translation":"リソクロマトグラフィー技術は、地球化学研究において、異なる鉱物を分離および識別するために使用される。"}],"collocations":["lithochromatographic analysis","lithochromatographic separation","lithochromatographic method","lithochromatographic technique"],"synonyms":["chromatographic","separative"],"antonyms":[]}],"etymology":{"value":"The word is formed from 'litho-' (referring to stone or rock), 'chromato-' (referring to color or chromatography), and '-graphic' (referring to writing or recording).","priority":"★★★"},"pronunciation":{"ipa":"/ˌlɪθoʊˌkroʊmətəˈɡræfɪk/","syllables":"li-tho-chro-ma-to-graph-ic"},"inflection":{"notes":"This is an adjective, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"This term is highly specialized and used primarily in scientific contexts, specifically in geochemistry and analytical chemistry. It describes processes or analyses involving lithochromatography, a technique not widely used outside of these fields.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lithochromatographic is a new device.","correct":"✓ Lithochromatography is a new technique.","note":"'Lithochromatographic' is an adjective, not a noun. You would use it to describe something, but not as the subject itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["lithochromatography (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - a highly specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'lithochromatographic' is a highly specialized adjective used in geochemistry and analytical chemistry. It refers to anything related to the process of lithochromatography, which is a method of separating substances by allowing them to diffuse through a layer of powdered rock or mineral. Due to its technical nature, it is rarely encountered outside of scientific literature and discussions within these specific fields."},"example_sentences":[{"sentence":"The researchers employed a lithochromatographic method to isolate the organic compounds from the shale sample.","translation":"研究者たちは、頁岩サンプルから有機化合物を分離するためにリソクロマトグラフィー法を採用した。","type":"adjective","meaning_category":"Relating to lithochromatography"},{"sentence":"Lithochromatographic studies have contributed significantly to our understanding of mineral formation processes.","translation":"リソクロマトグラフィー研究は、鉱物形成過程の理解に大きく貢献してきた。","type":"adjective","meaning_category":"Using lithochromatography"}]}