{"word":"Marxism-Leninism-Maoism","priority":"low","meanings":[{"part_of_speech":"noun","definition":"マルクス・レーニン・毛沢東主義","english_definition":"An ideology derived from Marxism, Leninism, and Maoism. It is a political philosophy that combines Marxist and Leninist principles with the theories and practices of Mao Zedong.","examples":[{"sentence":"Marxism-Leninism-Maoism was the guiding ideology of the Communist Party of Peru (Shining Path).","translation":"マルクス・レーニン・毛沢東主義は、ペルー共産党（センデロ・ルミノソ）の指導的イデオロギーだった。"}],"synonyms":["Maoism","Marxism-Leninism","MLM"],"antonyms":[]}],"etymology":{"value":"A synthesis of the ideas of Karl Marx, Vladimir Lenin, and Mao Zedong.","priority":"medium"},"pronunciation":{"ipa":"/ˌmɑːrksɪzəm ˌlɛnɪnɪzəm ˈmaʊɪzəm/","syllables":"Marx-ism-Len-in-ism-Mao-ism"},"inflection":{},"usage_notes":{"explanation":"Marxism-Leninism-Maoism (MLM) is a more radical and specific form of Marxism-Leninism, incorporating Maoist thought and strategies. It is often associated with revolutionary movements in the developing world.","priority":"medium"},"common_mistakes":{},"related_words":{"derivatives":["Marxist","Leninist","Maoist"],"related_ideologies":["Marxism","Leninism","Maoism","Communism"]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"Marxism-Leninism-Maoism is a complex political ideology that combines elements of Marxism, Leninism, and Maoism. It is primarily studied in the context of political science, history, and sociology. Understanding this term requires knowledge of the historical and theoretical backgrounds of Marxism, Leninism, and Maoism."},"example_sentences":[{"sentence":"The group adheres to Marxism-Leninism-Maoism as their fundamental political ideology.","translation":"そのグループは、マルクス・レーニン・毛沢東主義を彼らの基本的な政治イデオロギーとして堅持している。","type":"general","meaning_category":"ideology"},{"sentence":"Marxism-Leninism-Maoism emphasizes the role of the peasantry in revolutionary movements.","translation":"マルクス・レーニン・毛沢東主義は、革命運動における農民の役割を強調する。","type":"political theory","meaning_category":"political theory"}]}