{"word":"coembodies","priority":"N/A","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"共に具現化する、共同で体現する","english_definition":"To embody together; to jointly represent or express in a tangible or visible form.","examples":[{"sentence":"The project coembodies the values of sustainability and innovation.","translation":"そのプロジェクトは、持続可能性と革新という価値観を共に具現化している。"},{"sentence":"These two leaders coembody the hopes of their respective communities.","translation":"これらの二人の指導者は、それぞれのコミュニティの希望を共同で体現している。"}],"collocations":["coembody values","coembody principles","coembody ideals","coembody characteristics"],"synonyms":["jointly embody","collectively represent","mutually express","incarnate together"],"antonyms":["individually embodies","separately represents"]}],"etymology":{"value":"The word is formed by combining the prefix 'co-' (meaning 'together' or 'jointly') with the verb 'embodies' (meaning 'to give a concrete form to; to express or represent in a tangible or visible form').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkoʊɪmˈbɒdiz/","syllables":"co-im-bod-ies"},"inflection":{"verb_forms":{"present_simple":["coembodies"],"past_simple":"coembodied","past_participle":"coembodied","present_participle":"coembodying"}},"usage_notes":{"explanation":"'Coembodies' suggests a shared or joint embodiment of something, such as values, principles, or characteristics. It implies that multiple entities or individuals collectively represent or express a particular concept or idea. This word is relatively rare and is often used in formal or academic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artwork coembodies the artist.","correct":"✓ The artwork embodies the artist.","note":"If the artwork represents the artist alone, 'embodies' is sufficient. 'Coembodies' is used when multiple entities are represented together."},{"incorrect":"✗ The team coembodies each member's skills.","correct":"✓ The team embodies each member's skills.","note":"While the team may represent the skills of its members, 'embodies' is generally used in this context. 'Coembodies' would be more appropriate if the team and something else jointly represent the skills."}],"priority":"★★☆"},"related_words":{"derivatives":["coembodiment (noun): The act or state of coembodying.","embody (verb): To give a concrete form to; to express or represent in a tangible or visible form."],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Coembodies' is a relatively rare and sophisticated word. It is used to describe the joint or collective embodiment of something, such as values or principles. Understanding the word requires a strong vocabulary and an ability to grasp nuanced meanings. It is more commonly found in academic or formal writing.","priority":"★☆☆"},"example_sentences":[{"sentence":"The architecture of the building coembodies both modern and traditional design elements.","translation":"その建物の建築は、現代的および伝統的なデザイン要素を共に具現化している。","type":"verb","meaning_category":"具現化する"},{"sentence":"The partnership coembodies the shared vision of both organizations.","translation":"そのパートナーシップは、両組織の共有されたビジョンを共同で体現している。","type":"verb","meaning_category":"体現する"}]}