{"word":"Endorsees","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)裏書きされた人、支持された人、推薦された人","english_definition":"Plural form of endorsee: A person or organization who is endorsed, supported, or recommended.","examples":[{"sentence":"The campaign relies heavily on its list of high-profile endorsees to attract voters.","translation":"その選挙運動は、有権者を引きつけるために、著名な支持者リストに大きく依存している。"},{"sentence":"The company carefully selects its endorsees to ensure they align with its brand values.","translation":"その会社は、ブランド価値と一致するように、支持者を慎重に選んでいる。"},{"sentence":"The athlete's endorsees include several major sports apparel companies.","translation":"その運動選手の支持者には、いくつかの主要なスポーツウェア会社が含まれている。"}],"collocations":["high-profile endorsees (著名な支持者)","celebrity endorsees (有名人の支持者)","key endorsees (主要な支持者)","list of endorsees (支持者リスト)"],"synonyms":["supporters","backers","advocates","promoters","sponsors","patrons"],"antonyms":["critics","opponents"]}],"etymology":{"value":"Derived from 'endorsee,' which comes from 'endorse.' 'Endorse' originates from the Latin 'in dorsum,' meaning 'on the back.' Initially, it referred to writing on the back of a document, but evolved to mean supporting or approving something.","priority":"★★☆"},"pronunciation":{"ipa":"/ɛnˌdɔrˈsiːz/","syllables":"en-dor-sees"},"inflection":{"noun_plural":"endorsees"},"usage_notes":{"explanation":"'Endorsees' refers specifically to the individuals or entities that receive endorsement or support. It's often used in contexts of marketing, politics, and finance, where endorsements play a significant role. The term implies a formal or public declaration of support.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The endorsee were happy with the results.","correct":"✓ The endorsees were happy with the results.","note":"'Endorsees' is plural, so the verb should agree (i.e., 'were' instead of 'was')."},{"incorrect":"✗ Many company seek out endorsees.","correct":"✓ Many companies seek out endorsees.","note":"'Company' should be pluralized to 'companies' to match the plural verb 'seek.'"}],"priority":"★☆☆"},"related_words":{"derivatives":["endorse (verb: to support or approve)","endorsement (noun: the act of endorsing)","endorser (noun: one who endorses)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Endorsees' is a specialized term primarily used in business, marketing, and political contexts. It refers to the individuals or organizations that are being supported or promoted by someone else, often in a public manner. Due to its specific usage and context, it is more commonly encountered in advanced English texts and discussions. Understanding the word requires familiarity with the concept of endorsement and its implications in various fields."},"example_sentences":[{"sentence":"The politician thanked all of his endorsees during his victory speech.","translation":"政治家は勝利演説で、すべての支持者に感謝した。","type":"noun","meaning_category":"支持された人々"},{"sentence":"The company's annual report listed all of its major endorsees.","translation":"会社の年次報告書には、主要な支持者がすべて記載されていた。","type":"noun","meaning_category":"推薦された人々"},{"sentence":"The success of the product launch was attributed to the popularity of its celebrity endorsees.","translation":"製品発売の成功は、有名人の支持者の人気によるものとされた。","type":"noun","meaning_category":"支持された人々"}]}