{"word":"Pinola","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A fine meal made of parched corn, often seasoned; used in the southwestern United States and Mexico.","english_definition":"A flour made from toasted corn, sometimes flavored with spices, used especially in the southwestern U.S. and Mexico.","examples":[{"sentence":"The hikers carried pinole for a quick and nutritious meal on the trail.","translation":"ハイカーたちは、トレイルでの手軽で栄養価の高い食事のためにピノレを持ち歩いた。"},{"sentence":"She added cinnamon and sugar to the pinole for a sweet treat.","translation":"彼女は甘いおやつとして、ピノレにシナモンと砂糖を加えた。"}],"collocations":["make pinole","eat pinole","pinole recipe","traditional pinole"],"synonyms":["cornmeal","corn flour"],"antonyms":[]}],"etymology":{"value":"From Mexican Spanish pinole, from Nahuatl pinolli.","priority":"★★★"},"pronunciation":{"ipa":"/pɪˈnoʊlə/","syllables":"Pi-no-la"},"inflection":{"noun_plural":"pinoles"},"usage_notes":{"explanation":"Pinole is a traditional food made from ground toasted corn. It is often used as a base for drinks or as a quick and easy meal when mixed with water or milk.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I added wheat flour instead of pinole.","correct":"✓ I added corn flour instead of pinole.","note":"Pinole is made from corn, not wheat."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Pinole is a specialized term, primarily used in the context of Southwestern U.S. and Mexican cuisine. Understanding requires familiarity with regional food traditions.","priority":"★★☆"},"example_sentences":[{"sentence":"The runners consumed pinole to sustain their energy during the long race.","translation":"ランナーたちは、長距離レース中のエネルギーを維持するためにピノレを摂取した。","type":"noun","meaning_category":"food"},{"sentence":"Authentic pinole is made with carefully selected varieties of corn.","translation":"本格的なピノレは、厳選された種類のトウモロコシで作られている。","type":"noun","meaning_category":"food"}]}