{"word":"disangelical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"反福音主義的な、福音主義に反する","english_definition":"Opposed to or deviating from evangelical principles or beliefs.","examples":[{"sentence":"His views on social issues were considered disangelical by many in the church.","translation":"彼の社会問題に対する見解は、教会の多くの人々によって反福音主義的であると見なされた。"},{"sentence":"The theologian argued that the new doctrine was disangelical and a departure from traditional teachings.","translation":"その神学者は、新しい教義は反福音主義的であり、伝統的な教えからの逸脱であると主張した。"}],"collocations":["disangelical views","disangelical doctrine","disangelical teachings"],"synonyms":["anti-evangelical","non-evangelical","un-evangelical"],"antonyms":["evangelical","pro-evangelical"]}],"etymology":{"value":"\"dis-\" (否定接頭辞) + \"angelical\" (福音主義的な)","priority":"★★★"},"pronunciation":{"ipa":"/ˌdɪsænˈdʒɛlɪkəl/","syllables":"dis-an-gel-i-cal"},"inflection":{"adjective_forms":{"comparative":"more disangelical","superlative":"most disangelical"}},"usage_notes":{"explanation":"\"Disangelical\" is used to describe ideas, beliefs, or actions that are contrary to the principles of evangelical Christianity. It is a relatively uncommon term, often used in theological or religious discussions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a disangelical person because he is not happy.","correct":"✓ He is considered disangelical because of his unorthodox religious views.","note":"\"Disangelical\" refers to deviation from evangelical principles, not general unhappiness."}],"priority":"★★☆"},"related_words":{"derivatives":["disangelicalism (反福音主義)"],"related_terms":["evangelical","evangelicalism","theology","doctrine"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"disangelical\" is a highly specialized term primarily used within theological or religious contexts. It signifies a departure from or opposition to the core tenets of evangelical Christianity. Understanding this word requires familiarity with evangelical theology and the ability to recognize nuanced ideological differences within religious discourse. Its rarity makes it suitable for advanced learners or those engaged in specific fields of study. "},"example_sentences":[{"sentence":"The sermon was criticized for its disangelical approach to social justice.","translation":"その説教は、社会正義に対する反福音主義的なアプローチであると批判された。","type":"adjective","meaning_category":"反福音主義的な"},{"sentence":"Some scholars argue that certain modern interpretations of the Bible are disangelical in nature.","translation":"一部の学者は、聖書の特定の現代的な解釈は本質的に反福音主義的であると主張している。","type":"adjective","meaning_category":"反福音主義的な"}]}