{"word":"coresonant","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"共鳴する、共振する、共鳴性のある","english_definition":"Exhibiting or characterized by coresonance; having the property of coresonance.","examples":[{"sentence":"The coresonant frequencies of the two systems allowed for efficient energy transfer.","translation":"二つのシステムの共鳴周波数が、効率的なエネルギー伝達を可能にした。"},{"sentence":"The coresonant nature of the molecules contributed to the material's unique properties.","translation":"分子の共鳴性が、その材料のユニークな特性に貢献した。"}],"collocations":["coresonant frequency","coresonant system","coresonant molecules"],"synonyms":["resonant","sympathetic","harmonious"],"antonyms":["dissonant","inharmonious"]}],"etymology":{"value":"The word 'coresonant' is formed by combining the prefix 'co-' (meaning 'together' or 'jointly') with the word 'resonant' (meaning 'exhibiting resonance').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkoʊˈrɛzənənt/","syllables":"co-re-so-nant"},"inflection":{"notes":"Adjectives do not typically inflect in English, aside from comparative and superlative forms, which are 'more coresonant' and 'most coresonant', respectively."},"usage_notes":{"explanation":"'Coresonant' is a relatively technical term, primarily used in scientific or engineering contexts. It describes a state where two or more systems or components exhibit resonance together, often leading to enhanced effects or energy transfer. It implies a shared or coordinated resonance, rather than independent resonance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The singers were coresonant, so their voices clashed.","correct":"✓ The singers were not coresonant, so their voices clashed.","note":"Coresonance implies harmony or agreement in frequency, not clashing. Clashing would suggest a lack of coresonance or dissonance."}],"priority":"★☆☆"},"related_words":{"derivatives":["coresonance (noun): The state or quality of being coresonant.","resonance (noun): The condition in which an object or system is subjected to an oscillating force having a frequency close to its own natural frequency.","resonant (adjective): Exhibiting resonance."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in technical or scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Coresonant' is a specialized term usually found in scientific or technical texts. It describes something that exhibits resonance in conjunction with something else, often implying a shared or coordinated resonant frequency. Understanding requires familiarity with the concept of 'resonance' itself. Usage is rare outside of specific technical fields.","priority":"★☆☆"},"example_sentences":[{"sentence":"The **coresonant** design of the antenna improved signal strength.","translation":"アンテナの共鳴設計により、信号強度が向上した。","type":"adjective","meaning_category":"共鳴する"},{"sentence":"The **coresonant** vibrations caused the structure to fail.","translation":"共鳴振動により、構造物が破損した。","type":"adjective","meaning_category":"共振する"},{"sentence":"The **coresonant** interaction between the two particles is crucial for the reaction to occur.","translation":"二つの粒子の共鳴相互作用は、反応が起こるために不可欠である。","type":"adjective","meaning_category":"共鳴性のある"}]}