{"word":"euhemerising","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"intransitive","definition":"ユヘメロス説を唱える、神話を歴史的事実として解釈する","english_definition":"To interpret mythology as growing out of historical accounts of real people and events.","examples":[{"sentence":"Some scholars have attempted to euhemerise the legends of King Arthur.","translation":"一部の学者は、アーサー王の伝説をユヘメロス説的に解釈しようと試みてきた。"}],"collocations":["euhemerise myths","euhemerise legends"],"synonyms":["rationalize","historicize"],"antonyms":["mythologize"]},{"part_of_speech":"verb","transitivity":"transitive","definition":"（神話など）をユヘメロス説的に解釈する","english_definition":"To explain (a myth, etc.) by euhemerism.","examples":[{"sentence":"He euhemerised the Greek pantheon, claiming the gods were originally mortal rulers.","translation":"彼はギリシャの神々をユヘメロス説的に解釈し、神々は元々人間の支配者だったと主張した。"}],"collocations":["euhemerise a myth","euhemerise a legend"],"synonyms":["rationalize","historicize"],"antonyms":["mythologize"]}],"etymology":{"value":"From the verb 'euhemerise', derived from 'Euhemerus', a Greek mythographer of the late 4th century BC, who interpreted myths as distorted accounts of historical events.","priority":"★★☆"},"pronunciation":{"ipa":"/juːˈhiːmərɪzaɪzɪŋ/","syllables":"eu-he-mer-i-sing"},"inflection":{"verb_forms":{"present_simple":["euhemerise","euhemerises"],"past_simple":"euhemerised","past_participle":"euhemerised","present_participle":"euhemerising"}},"usage_notes":{"explanation":"'Euhemerising' refers to the act of applying euhemerism, which is the interpretation of myths as distorted historical accounts. It is often used in academic contexts when discussing the origins and interpretations of mythology. The term can be used both transitively (to euhemerise a myth) and intransitively (to engage in euhemerising).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is euhemerizing about the weather.","correct":"✓ He is euhemerising the myth of Zeus.","note":"'Euhemerising' specifically relates to the interpretation of myths or legends as historical events, not general topics like the weather."}],"priority":"★☆☆"},"related_words":{"derivatives":["euhemerism (noun): ユヘメロス説","euhemerist (noun): ユヘメロス説者","euhemerized (adjective): ユヘメロス説的に解釈された"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Euhemerising' is a specialized term used in the study of mythology and religion. It describes the process of interpreting myths and legends as having a basis in historical events or figures. This term is not commonly used in everyday conversation and is primarily found in academic or scholarly contexts. Understanding this term requires familiarity with the field of mythology and its various interpretive approaches."},"example_sentences":[{"sentence":"By euhemerising the story of Hercules, we can see him as a powerful, but mortal, leader.","translation":"ヘラクレスの物語をユヘメロス説的に解釈することで、彼を強力だが、死すべき運命にある指導者として見ることができる。","type":"verb","meaning_category":"神話を歴史的事実として解釈する"},{"sentence":"The historian was criticised for euhemerising too many traditional narratives.","translation":"その歴史家は、あまりにも多くの伝統的な物語をユヘメロス説的に解釈したとして批判された。","type":"verb","meaning_category":"神話を歴史的事実として解釈する"}]}