{"word":"Guisarme","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史的な武器) ゲザーム：刃のついたフックまたは鎌を備えた、長い柄の武器。主に歩兵が騎兵を馬から引きずり下ろすために使用された。","english_definition":"(historical weapon) A guisarme is a pole weapon primarily used between 1000 and 1600. It was used to dismount knights from their horses. It comprised a blade mounted on a long pole, typically with a hook or sickle-like appendage.","examples":[{"sentence":"The infantrymen were armed with guisarmes to defend against the charging knights.","translation":"歩兵たちは、突撃してくる騎士たちから身を守るためにゲザームで武装していた。"},{"sentence":"The museum displayed a collection of medieval polearms, including a well-preserved guisarme.","translation":"博物館には、保存状態の良いゲザームを含む中世のポールアームのコレクションが展示されていた。"}],"collocations":["polearm","medieval weapon","historical weapon","dismount knights"],"synonyms":["bill","fauchard","glaive","poleaxe"],"antonyms":[]}],"etymology":{"value":"語源ははっきりしないが、古フランス語の「guiser」（武装する、身なりを整える）に関連があるという説や、ドイツ語の「Wieseme」（草刈り鎌）に由来するという説がある。","priority":"★★☆"},"pronunciation":{"ipa":"/ɡiˈzɑːrm/","syllables":"gui-sarme"},"inflection":{"noun_plural":"guisarmes"},"usage_notes":{"explanation":"「**Guisarme**」は、歴史的な文脈でのみ使用される非常に特殊な単語です。現代英語ではほとんど使われず、中世の武器や歴史的な軍事戦術について議論する場合にのみ現れる可能性があります。","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a guisarme to cut the grass.","correct":"✓ He used a scythe to cut the grass.","note":"ゲザームは武器であり、草刈り鎌ではありません。草を刈るにはサイス（scythe）を使用します。"},{"incorrect":"✗ The guisarme was a common weapon in modern warfare.","correct":"✓ The guisarme was a common weapon in medieval warfare.","note":"ゲザームは中世の武器であり、現代戦では使用されません。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["polearm","bill","fauchard","glaive","halberd","poleaxe"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (非常にまれな単語)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Guisarme**」は、歴史的な武器を指す専門用語であり、一般的な語彙ではありません。この単語に出会うのは、中世の歴史、武器の進化、またはファンタジー文学といった特定の文脈に限られるでしょう。この単語を理解するには、中世の武器に関する知識が必要です。"},"example_sentences":[{"sentence":"The re-enactors demonstrated the use of the guisarme in dismounting a charging knight.","translation":"再現者たちは、突撃してくる騎士を馬から引きずり下ろすゲザームの使い方を実演した。","type":"noun","meaning_category":"historical weapon"},{"sentence":"Illustrations from medieval manuscripts depict soldiers wielding guisarmes in battle.","translation":"中世の写本のイラストには、兵士たちが戦闘でゲザームを振るう様子が描かれている。","type":"noun","meaning_category":"historical weapon"}]}