{"word":"Satcitananda","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(サンスクリット語) サットチットアーナンダ。存在（Sat）、意識（Cit）、至福（Ananda）が一体となった、究極の現実、絶対的な真理、ブラフマン（Brahman）の状態を指す言葉。ヒンドゥー教の哲学、特にヴェーダーンタ学派において重要な概念。","english_definition":"(Sanskrit) Satcitananda. A composite Sanskrit word describing the nature of Brahman as ultimate reality. It is a combination of Sat (being, existence), Cit (consciousness), and Ananda (bliss). It is a central concept in Hindu philosophy, particularly in Vedanta.","examples":[{"sentence":"Satcitananda is the ultimate goal of spiritual realization.","translation":"サットチットアーナンダは、精神的な悟りの究極の目標です。"},{"sentence":"The guru explained the meaning of Satcitananda to his disciples.","translation":"導師は弟子たちにサットチットアーナンダの意味を説明しました。"},{"sentence":"Meditating on Satcitananda can lead to profound spiritual insights.","translation":"サットチットアーナンダについて瞑想することで、深遠な精神的洞察が得られることがあります。"}],"collocations":["realize Satcitananda (サットチットアーナンダを悟る)","experience Satcitananda (サットチットアーナンダを体験する)","meditate on Satcitananda (サットチットアーナンダについて瞑想する)"],"synonyms":["Brahman","Atman","ultimate reality","absolute truth"],"antonyms":[]}],"etymology":{"value":"サンスクリット語の複合語で、Sat（存在、真実）、Cit（意識、知性）、Ananda（至福、喜び）の3つの言葉が組み合わさってできた言葉。","priority":"★★★"},"pronunciation":{"ipa":"/sʌtˌtʃɪtˈɑːnəndə/","syllables":"Sat-chi-ta-nan-da"},"inflection":{"notes":"名詞のため、複数形や活用形はありません。"},"usage_notes":{"explanation":"「**Satcitananda**」は、ヒンドゥー教哲学における最高概念の一つであり、ブラフマン（宇宙の根本原理）の本質を表します。この言葉は、存在（Sat）、意識（Cit）、至福（Ananda）という3つの要素が不可分に結びついていることを示し、これらが一体となった状態が、究極の現実であるとされます。サットチットアーナンダの理解と体験は、精神的な探求の最終目標とされ、瞑想やヨーガなどの実践を通じて目指されます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Satcitananda is a god.","correct":"✓ Satcitananda is the nature of Brahman.","note":"サットチットアーナンダは神の名前ではなく、ブラフマン（宇宙の根本原理）の本質を表す概念です。"},{"incorrect":"✗ Satcitananda can be easily understood through logic.","correct":"✓ Satcitananda is best understood through experience and intuition.","note":"サットチットアーナンダは論理的な理解を超えた、体験的な理解が重要視される概念です。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_concepts":["Brahman (ブラフマン)","Atman (アートマン)","Vedanta (ヴェーダーンタ)","Yoga (ヨーガ)","Meditation (瞑想)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - 哲学や宗教関連の文脈でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Satcitananda**」は、ヒンドゥー教の哲学、特にヴェーダーンタ学派で用いられる専門用語であり、サンスクリット語に由来します。この言葉は、宇宙の根本原理であるブラフマンの本質を、「存在（Sat）」、「意識（Cit）」、「至福（Ananda）」という3つの側面から捉えたものです。これらの要素は互いに分離不可能であり、一体となって究極の現実を構成するとされます。サットチットアーナンダの概念を理解するには、ヴェーダーンタ哲学の基礎知識や、瞑想などの実践経験が求められるため、高度な読解力が必要です。"},"example_sentences":[{"sentence":"The sage spoke of Satcitananda as the source of all creation.","translation":"賢者は、サットチットアーナンダをすべての創造の源として語った。","type":"noun","meaning_category":"究極の現実"},{"sentence":"Through deep meditation, one can experience the bliss of Satcitananda.","translation":"深い瞑想を通して、人はサットチットアーナンダの至福を体験することができる。","type":"noun","meaning_category":"究極の現実"},{"sentence":"Satcitananda is not merely a concept, but a state of being to be realized.","translation":"サットチットアーナンダは単なる概念ではなく、実現されるべき存在の状態である。","type":"noun","meaning_category":"究極の現実"}]}