{"word":"Paramine","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A trade name for a type of direct dye used in the textile industry, particularly for dyeing cotton and rayon.","english_definition":"A trade name for a type of direct dye used in the textile industry, particularly for dyeing cotton and rayon.","examples":[{"sentence":"The fabric was dyed using Paramine dyes to achieve a vibrant color.","translation":"その生地は、鮮やかな色を出すためにパラミン染料で染められました。"}],"collocations":["Paramine dye","dye with Paramine","Paramine-dyed fabric"],"synonyms":["direct dye","textile dye"],"antonyms":[]}],"etymology":{"value":"Derived from the trade name 'Paramine', likely a combination of 'para-' (referring to a chemical structure) and '-amine' (referring to the presence of amino groups in the dye).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈpærəmiːn/","syllables":"Pa-ra-mine"},"inflection":{"notes":"Plural form is 'Paramines'."},"usage_notes":{"explanation":"'Paramine' refers specifically to a class of direct dyes, often used in the textile industry. It is important to note that 'Paramine' is a trade name, and there may be variations in the exact chemical composition depending on the manufacturer.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used Paramine to paint my house.","correct":"✓ I used paint to paint my house.","note":"Paramine is a textile dye, not suitable for painting houses."}],"priority":"★☆☆"},"related_words":{"derivatives":["Paramine Black","Paramine Brown"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - primarily used in technical or industrial contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Paramine' is a specialized term primarily encountered in the context of textile dyeing and the chemical industry. Understanding its meaning requires familiarity with dye chemistry and textile manufacturing processes. It is not a word commonly used in general conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The textile manufacturer preferred Paramine dyes for their ease of use and vibrant colors.","translation":"その繊維製造業者は、使いやすさと鮮やかな色のため、パラミン染料を好みました。","type":"noun","meaning_category":"textile dye"},{"sentence":"The specifications called for a fabric dyed with Paramine Black.","translation":"仕様書では、パラミンブラックで染色された生地が要求されていました。","type":"noun","meaning_category":"textile dye"}]}