{"word":"unscholar","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"学者らしくない、学問的でない","english_definition":"Not characteristic of a scholar; not scholarly.","examples":[{"sentence":"His unscholar remarks revealed a lack of understanding of the subject.","translation":"彼の学者らしくない発言は、その主題に対する理解の欠如を露呈した。"},{"sentence":"The article was criticized for its unscholar approach to the topic.","translation":"その記事は、そのトピックに対する学問的でないアプローチで批判された。"}],"collocations":["unscholar approach","unscholar remarks","unscholar methods","unscholar attitude"],"synonyms":["unacademic","non-scholarly","popular","lay"],"antonyms":["scholarly","academic","learned","erudite"]},{"part_of_speech":"noun","definition":"学者でない人、学問に関心のない人","english_definition":"A person who is not a scholar or is not interested in scholarly pursuits.","examples":[{"sentence":"He was an unscholar, preferring practical work to academic study.","translation":"彼は学者ではなく、学問的な研究よりも実践的な仕事を好んだ。"}],"collocations":["self-confessed unscholar"],"synonyms":["non-academic","layperson"],"antonyms":["scholar","academic"]}],"etymology":{"value":"\"Un-\" (not) + \"scholar\".","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈskɑːlər/","syllables":"un-schol-ar"},"inflection":{"notes":"Regular inflection for adjective and noun forms."},"usage_notes":{"explanation":"\"Unscholar\" is used to describe something that lacks the qualities expected of a scholar, such as rigorous research, deep knowledge, or careful analysis. It can also refer to a person who is not a scholar or does not engage in scholarly activities. The term often carries a negative connotation, implying a lack of intellectual depth or seriousness.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is very unscholar.","correct":"✓ He is very unscholarly.","note":"While \"unscholar\" can be used as an adjective, \"unscholarly\" is more common and natural-sounding."}],"priority":"★★☆"},"related_words":{"derivatives":["unscholarly (adjective): More common synonym for unscholar (adjective).","scholar (noun): A learned person.","scholarly (adjective): Characteristic of a scholar.","scholarship (noun): Academic study; financial aid for students."],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unscholar\" is relatively uncommon. It is used to describe something that lacks the qualities of a scholar, such as rigorous research or deep knowledge. It can also refer to someone who is not a scholar. The more common alternative is \"unscholarly\". Understanding the root word \"scholar\" is essential to grasp the meaning of \"unscholar\". "},"example_sentences":[{"sentence":"The politician's unscholar remarks on climate change were widely criticized.","translation":"その政治家の気候変動に関する学者らしくない発言は広く批判された。","type":"adjective","meaning_category":"学者らしくない"},{"sentence":"As an unscholar, he found the academic debates tedious and irrelevant.","translation":"学者でない彼にとって、学術的な議論は退屈で無関係だった。","type":"noun","meaning_category":"学者でない人"}]}