{"word":"karsts","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"カルスト地形","english_definition":"A landscape underlain by limestone that has been eroded by dissolution, producing ridges, towers, sinkholes, caves, and other characteristic features.","examples":[{"sentence":"The karsts of Guilin are famous for their unique beauty.","translation":"桂林のカルスト地形はその独特の美しさで有名です。"},{"sentence":"Karsts are often associated with underground drainage systems.","translation":"カルスト地形は、地下排水システムと関連付けられることが多いです。"}],"collocations":["karst topography","karst landscape","karst region","karst features","karst aquifer"],"synonyms":["limestone pavement","sinkhole terrain","cave system"],"antonyms":[]}],"etymology":{"value":"The word \"karst\" comes from the German name Karst for a region of the Dinaric Alps, a limestone plateau near Trieste, on the border of Italy and Slovenia. The name ultimately derives from a pre-Indo-European word meaning 'stone'.","priority":"★★★"},"pronunciation":{"ipa":"/kɑːrsts/","syllables":"karsts"},"inflection":{"noun_plural":"karsts (already plural, refers to multiple karst regions or features)"},"usage_notes":{"explanation":"\"Karsts\" is the plural form of \"karst,\" which refers to a specific type of landscape formed by the dissolution of soluble rocks, such as limestone. These landscapes are characterized by unique features like sinkholes, caves, and underground drainage systems. The term is both a noun and an adjective (karst topography).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The karst are beautiful.","correct":"✓ The karsts are beautiful.","note":"When referring to multiple karst regions or features, use the plural form \"karsts.\""},{"incorrect":"✗ Karst is a type of mountains.","correct":"✓ Karst is a type of landscape.","note":"Karst refers to a specific type of landscape, not mountains in general."}],"priority":"★★☆"},"related_words":{"derivatives":["karstic (adjective: relating to or consisting of karst)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"karsts\" refers to a specific geological landform resulting from the dissolution of soluble rocks, such as limestone. It's a term primarily used in geography, geology, and environmental science. Understanding the term requires familiarity with geological processes and landform types. It's not a common word in everyday conversation."},"example_sentences":[{"sentence":"The **karsts** in Vietnam attract many tourists.","translation":"ベトナムのカルスト地形は多くの観光客を魅了しています。","type":"noun","meaning_category":"カルスト地形"},{"sentence":"The area is known for its extensive **karsts**.","translation":"その地域は広大なカルスト地形として知られています。","type":"noun","meaning_category":"カルスト地形"}]}