{"word":"cyclophosphamides","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"シクロホスファミド類（抗がん剤の一種）","english_definition":"A class of drugs, specifically alkylating agents, used as chemotherapy and immunosuppressants. Cyclophosphamide is a prominent example.","examples":[{"sentence":"Cyclophosphamides are used to treat various cancers and autoimmune diseases.","translation":"シクロホスファミド類は、様々な癌や自己免疫疾患の治療に用いられる。"},{"sentence":"The doctor prescribed cyclophosphamides as part of her chemotherapy regimen.","translation":"医師は彼女の化学療法レジメンの一部としてシクロホスファミド類を処方した。"}],"collocations":["treat with cyclophosphamides (シクロホスファミド類で治療する)","cyclophosphamides chemotherapy (シクロホスファミド類化学療法)","administer cyclophosphamides (シクロホスファミド類を投与する)"],"synonyms":["alkylating agents","chemotherapeutic agents","immunosuppressants"],"antonyms":[]}],"etymology":{"value":"Derived from the chemical structure involving cyclic phosphamide groups.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsaɪkloʊˈfɒsfəmaɪdz/","syllables":"cy-clo-phos-pha-mides"},"inflection":{"noun_plural":"cyclophosphamides"},"usage_notes":{"explanation":"'Cyclophosphamides' refers to a group of related drugs, with 'cyclophosphamide' being the most well-known member. These drugs are powerful and have significant side effects, so their use is carefully monitored.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ cyclophosphamide are used...","correct":"✓ cyclophosphamides are used...","note":"When referring to the class of drugs, use the plural form 'cyclophosphamides'."}],"priority":"★★☆"},"related_words":{"derivatives":["cyclophosphamide (singular form, specific drug)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency, primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cyclophosphamides' is a technical term used in medicine, specifically in oncology and rheumatology. It refers to a class of drugs used in chemotherapy and as immunosuppressants. Due to its specialized nature, it is not commonly used outside of medical or scientific contexts. Understanding its use requires knowledge of pharmacology and disease treatment.","priority":"★★☆"},"example_sentences":[{"sentence":"The use of cyclophosphamides has significantly improved outcomes for patients with certain types of lymphoma.","translation":"シクロホスファミド類の使用は、特定の種類のリンパ腫患者の転帰を大幅に改善した。","type":"noun","meaning_category":"抗がん剤"},{"sentence":"Cyclophosphamides can cause side effects like nausea and hair loss.","translation":"シクロホスファミド類は、吐き気や脱毛のような副作用を引き起こす可能性がある。","type":"noun","meaning_category":"抗がん剤"}]}