{"word":"unvirtuous-looking","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"having an appearance that suggests a lack of moral virtue or goodness; appearing immoral or wicked.","english_definition":"having an appearance that suggests a lack of moral virtue or goodness; appearing immoral or wicked.","examples":[{"sentence":"The character in the play was portrayed as an unvirtuous-looking rogue, with shifty eyes and a sneer.","translation":"劇中の登場人物は、落ち着きのない目つきと嘲笑を浮かべた、不道徳に見える悪党として描かれていた。"},{"sentence":"Despite her charitable actions, some people found her unvirtuous-looking, perhaps due to her unconventional style.","translation":"彼女の慈善活動にもかかわらず、型破りなスタイルが原因で、彼女を不道徳に見えると感じる人もいた。"}],"collocations":["unvirtuous-looking character","unvirtuous-looking expression","unvirtuous-looking smile","unvirtuous-looking individual"],"synonyms":["immoral-looking","wicked-looking","dissolute-looking","debauched-looking","corrupt-looking","sinister-looking","villainous-looking","unprincipled-looking"],"antonyms":["virtuous-looking","moral-looking","righteous-looking","innocent-looking","pure-looking","upright-looking"]}],"etymology":{"value":"Formed by combining the prefix 'un-' (meaning 'not') with 'virtuous-looking', which itself is a combination of 'virtuous' (having or showing high moral standards) and 'looking' (having a certain appearance).","priority":"low"},"pronunciation":{"ipa":"/ˌʌnˈvɜːrtʃuəs ˈlʊkɪŋ/","syllables":"un-vir-tu-ous-look-ing"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns and can be used in comparative and superlative forms (more unvirtuous-looking, most unvirtuous-looking), although these are less common."},"usage_notes":{"explanation":"'Unvirtuous-looking' is used to describe someone whose appearance suggests they lack moral principles or are inclined to do wrong. It's a subjective assessment based on visual cues. The term often carries a negative connotation and implies a judgment based on outward appearance rather than actual behavior.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"He was unvirtuous-looking because he was actually unvirtuous.","correct":"He was unvirtuous-looking, giving the impression of being morally corrupt, even if it wasn't entirely true.","note":"The term describes appearance, not necessarily actual behavior. Someone can be unvirtuous-looking without being truly unvirtuous."},{"incorrect":"She was unvirtuous-looking, so she must be a bad person.","correct":"Her unvirtuous-looking appearance made people wary of her, but it didn't necessarily reflect her true character.","note":"Avoid making assumptions about someone's character solely based on their appearance."}],"priority":"low"},"related_words":{"derivatives":["unvirtuously (adverb)","virtuous (adjective)","virtue (noun)"],"phrasal_verbs":[],"priority":"low"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"low"},"readability_explanation":{"level":"C1","text":"'Unvirtuous-looking' is a complex adjective used to describe someone whose appearance suggests a lack of moral virtue or goodness. It implies a judgment based on visual cues, suggesting the person looks immoral or wicked. This term is not commonly used and requires a good understanding of vocabulary related to morality and appearance. The word is relatively rare in everyday conversation and writing."},"example_sentences":[{"sentence":"The pirate captain had an unvirtuous-looking grin that sent shivers down the cabin boy's spine.","translation":"海賊の船長は、不道徳に見えるニヤニヤ笑いを浮かべており、それが船室の少年を震え上がらせた。","type":"adjective","meaning_category":"appearance"},{"sentence":"The old mansion had an unvirtuous-looking facade, with crumbling gargoyles and darkened windows.","translation":"その古い大邸宅は、崩れかけたガーゴイルと暗くなった窓があり、不道徳に見える外観をしていた。","type":"adjective","meaning_category":"appearance"},{"sentence":"He cast an unvirtuous-looking shadow in the dimly lit alleyway.","translation":"彼は薄暗い路地で不道徳に見える影を落とした。","type":"adjective","meaning_category":"appearance"}]}