{"word":"clownheal","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(slang, derogatory) A person, typically male, who is considered foolish, incompetent, or contemptible.","english_definition":"(slang, derogatory) A foolish, incompetent, or contemptible person, typically male.","examples":[{"sentence":"He's such a clownheal, he can't even tie his own shoes.","translation":"彼は本当に愚か者で、自分の靴ひもさえ結べない。"},{"sentence":"Don't listen to him, he's just a clownheal trying to get attention.","translation":"彼の言うことを聞くな、彼はただ注目を集めようとしている愚か者だ。"}],"collocations":[],"synonyms":["idiot","fool","jerk","loser","asshole"],"antonyms":["genius","expert","hero"]}],"etymology":{"value":"Likely a blend of \"clown\" (a foolish or comical person) and \"heel\" (a contemptible person). The combination emphasizes both the foolishness and the unpleasantness of the individual.","priority":"★★☆"},"pronunciation":{"ipa":"/klaʊnhiːl/","syllables":"clown-heel"},"inflection":{"noun_plural":"clownheals"},"usage_notes":{"explanation":"\"Clownheal\" is a relatively new slang term, and its usage is primarily online. It is considered derogatory and offensive. The term combines the idea of someone being a \"clown\" (foolish or ridiculous) with the negative connotations of being a \"heel\" (a contemptible or unpleasant person).","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - likely a recent slang term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Clownheal\" is a slang term that is used to describe someone who is foolish, incompetent, and generally unlikeable. It's a derogatory term, so it's not something you'd want to use in polite conversation. It's a relatively new term, so it's not widely known or used. It's most commonly found online.","priority":"★★☆"},"example_sentences":[{"sentence":"That clownheal keeps messing up the project.","translation":"あの愚か者はプロジェクトをめちゃくちゃにし続けている。","type":"noun","meaning_category":"derogatory term"},{"sentence":"He acted like a complete clownheal during the meeting.","translation":"彼は会議中、まるで完全な愚か者のように振る舞った。","type":"noun","meaning_category":"derogatory term"}]}