{"word":"character-based","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"文字を基本とする、文字に基づく","english_definition":"Based on or using characters (letters, symbols, etc.) as the primary means of representation or interaction.","examples":[{"sentence":"The old computer system used a character-based interface.","translation":"その古いコンピューターシステムは、文字ベースのインターフェースを使用していました。"},{"sentence":"Many early video games were character-based, using simple graphics made from text characters.","translation":"初期のビデオゲームの多くは文字ベースで、テキスト文字から作られたシンプルなグラフィックを使用していました。"},{"sentence":"The encryption algorithm is character-based, meaning it operates on individual characters rather than larger blocks of data.","translation":"その暗号化アルゴリズムは文字ベースであり、より大きなデータのブロックではなく、個々の文字に対して動作することを意味します。"}],"collocations":["character-based interface","character-based game","character-based encryption","character-based animation","character-based language"],"synonyms":["text-based","alphanumeric","symbolic"],"antonyms":["graphical","image-based","vector-based"]},{"part_of_speech":"adjective","definition":"登場人物を重視した、キャラクター性に基づいた","english_definition":"Focusing on the development and portrayal of characters in a story, game, or other narrative.","examples":[{"sentence":"The novel is character-based, exploring the inner lives and relationships of its protagonists.","translation":"その小説は登場人物を重視しており、主人公たちの内面生活と人間関係を探求しています。"},{"sentence":"Character-based dramas often explore complex moral dilemmas.","translation":"登場人物を重視したドラマは、複雑な道徳的ジレンマを探求することがよくあります。"},{"sentence":"The game is more character-based than action-oriented.","translation":"そのゲームは、アクション指向というよりも、登場人物を重視しています。"}],"collocations":["character-based drama","character-based novel","character-based game","character-based storytelling","character-based approach"],"synonyms":["character-driven","character-focused","character-oriented"],"antonyms":["plot-driven","action-oriented"]}],"etymology":{"value":"The term 'character-based' is formed by combining the noun 'character' with the suffix '-based,' indicating that something is founded on or primarily uses characters.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkærəktərˌbeɪst/","syllables":"char-ac-ter-based"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"The term 'character-based' has two primary meanings, depending on the context. In computing and technology, it refers to systems or interfaces that rely on text characters for display and interaction. In literature, film, and games, it describes narratives that prioritize the development and exploration of characters over plot or action.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The movie was character based and boring.","correct":"✓ The movie was character-based and boring.","note":"Remember to use the hyphen when using 'character-based' as a compound adjective."},{"incorrect":"✗ The system is character based, so it's very fast.","correct":"✓ The system is character-based, so it's very fast.","note":"Again, the hyphen is important for clarity."}],"priority":"★★☆"},"related_words":{"derivatives":["character","based"],"related_terms":["text-based","character-driven","graphical user interface (GUI)","plot-driven"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in specific contexts (e.g., computer science, literary criticism).","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Character-based' can refer to two different things. First, it can describe computer systems or programs that use text characters instead of pictures. Think of old computer screens where everything was made of letters and symbols. Second, it can describe stories, movies, or games that focus on the characters and their relationships more than the plot or action. So, a 'character-based novel' is one where you learn a lot about the people in the story and how they change. You need to understand the context to know which meaning is intended."},"example_sentences":[{"sentence":"The early computer games had a **character-based** display.","translation":"初期のコンピューターゲームは、文字ベースのディスプレイを備えていました。","type":"adjective","meaning_category":"文字を基本とする"},{"sentence":"The success of the novel lies in its **character-based** storytelling.","translation":"その小説の成功は、登場人物を重視したストーリーテリングにあります。","type":"adjective","meaning_category":"登場人物を重視した"}]}