{"word":"Significatory","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"意味を示す、意味を持つ、意味のある","english_definition":"Having or expressing a meaning; significant.","examples":[{"sentence":"The use of color in the painting is significatory.","translation":"その絵画における色の使用は意味を示すものである。"},{"sentence":"The symbol has a significatory role in the ritual.","translation":"そのシンボルは儀式において意味のある役割を果たす。"}],"collocations":["significatory gesture","significatory symbol","significatory element"],"synonyms":["meaningful","expressive","indicative","symbolic","suggestive"],"antonyms":["meaningless","insignificant"]}],"etymology":{"value":"From Late Latin *significatorius*, from Latin *significare* ('to signify').","priority":"★★☆"},"pronunciation":{"ipa":"/sɪɡˈnɪfɪkətɔːri/","syllables":"sig-nif-i-ca-to-ry"},"inflection":{"notes":"Adjective, comparative and superlative forms (more significatory, most significatory) are possible but less common."},"usage_notes":{"explanation":"'Significatory' is a relatively rare and formal word that emphasizes the quality of conveying meaning or significance. It is often used in academic or technical contexts when discussing symbols, gestures, or elements that carry a particular meaning. It is less common in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The weather was significatory for our picnic.","correct":"✓ The weather was significant for our picnic.","note":"Use 'significant' when referring to importance or consequence, rather than conveying meaning."},{"incorrect":"✗ The significatory of the word is unclear.","correct":"✓ The significance of the word is unclear.","note":"'Significatory' is an adjective, not a noun. Use 'significance' as the noun form."}],"priority":"★★☆"},"related_words":{"derivatives":["signify (verb)","significance (noun)","significant (adjective)","signification (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Significatory' is a formal and infrequent word, primarily used in academic or specialized contexts to describe something that conveys meaning or is significant. It is less common in everyday language. Understanding the related terms 'signify,' 'significance,' and 'significant' can help grasp its meaning. It is important to distinguish it from the more common word 'significant,' which often refers to importance or consequence rather than the act of conveying meaning itself."},"example_sentences":[{"sentence":"The painting's composition is highly significatory, with each element carefully chosen to convey a specific message.","translation":"その絵画の構成は非常に意味深く、各要素は特定のメッセージを伝えるために慎重に選択されている。","type":"general","meaning_category":"meaningful"},{"sentence":"The anthropologist studied the significatory role of masks in the tribal ceremony.","translation":"人類学者は、部族の儀式における仮面の意味のある役割を研究した。","type":"academic","meaning_category":"expressive"}]}