{"word":"Opisthognathism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"下顎後退症、顎後退（症）","english_definition":"A condition characterized by the mandible (lower jaw) being positioned posterior to its normal location.","examples":[{"sentence":"Opisthognathism can lead to difficulties in chewing and speaking.","translation":"下顎後退症は咀嚼や発話の困難を引き起こす可能性がある。"},{"sentence":"Orthodontic treatment may be necessary to correct severe cases of opisthognathism.","translation":"重度の下顎後退症を矯正するには、歯科矯正治療が必要になる場合がある。"}],"collocations":["severe opisthognathism (重度の下顎後退症)","mild opisthognathism (軽度の下顎後退症)","correct opisthognathism (下顎後退症を矯正する)","surgical correction of opisthognathism (下顎後退症の外科的矯正)"],"synonyms":["mandibular retrusion","retrognathia"],"antonyms":["prognathism"]},{"part_of_speech":"noun","definition":"（歯科）下顎が上顎に対して後退している状態","english_definition":"(dentistry) A condition in which the mandible is positioned posterior to the maxilla.","examples":[{"sentence":"The patient presented with significant opisthognathism, requiring a detailed orthodontic assessment.","translation":"患者は顕著な下顎後退症を呈しており、詳細な歯科矯正評価が必要であった。"}],"collocations":["opisthognathism treatment (下顎後退症の治療)","opisthognathism surgery (下顎後退症の手術)","opisthognathism correction (下顎後退症の矯正)"],"synonyms":["retrognathia","mandibular retrusion"],"antonyms":["prognathism"]}],"etymology":{"value":"From Greek 'opisthe' (backward) + 'gnathos' (jaw) + '-ism' (condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒpɪsˈθɒɡnəθɪzəm/","syllables":"o-pis-tho-gna-thism"},"inflection":{"noun_plural":"opisthognathisms"},"usage_notes":{"explanation":"Opisthognathism is a medical term primarily used in dentistry and orthodontics to describe the condition where the lower jaw is set back further than normal in relation to the upper jaw. It can be a cosmetic concern, but more importantly, it can affect dental function, such as chewing and speaking. Treatment options range from orthodontic appliances to surgical correction, depending on the severity of the condition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Opisthognathism is when the upper jaw is behind the lower jaw.","correct":"✓ Opisthognathism is when the lower jaw is behind the upper jaw.","note":"It's important to remember that opisthognathism refers to the lower jaw being positioned behind the upper jaw, not the other way around."}],"priority":"★★☆"},"related_words":{"derivatives":["opisthognathic (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (specialized medical vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Opisthognathism' is a specialized medical term used in dentistry and orthodontics. It refers to a condition where the lower jaw is positioned further back than normal in relation to the upper jaw. Understanding this term requires knowledge of anatomical terminology and dental concepts. It is not commonly used in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The cephalometric analysis revealed a clear case of opisthognathism.","translation":"頭部X線規格写真分析により、明らかな下顎後退症の症例が明らかになった。","type":"noun","meaning_category":"下顎後退症"},{"sentence":"Treatment for opisthognathism often involves orthodontic appliances to gradually move the lower jaw forward.","translation":"下顎後退症の治療には、下顎を徐々に前方に移動させるための歯科矯正器具がよく用いられる。","type":"noun","meaning_category":"下顎後退症"}]}