{"word":"Pororoca","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ポロロッカ：アマゾン川などの河口で起こる潮津波","english_definition":"A tidal bore occurring on the Amazon River and other rivers in South America.","examples":[{"sentence":"The pororoca is a powerful and destructive force of nature.","translation":"ポロロッカは強力で破壊的な自然の力です。"},{"sentence":"Surfers travel to the Amazon to ride the pororoca.","translation":"サーファーたちはポロロッカに乗るためにアマゾンへ旅をします。"}],"collocations":["ride the pororoca (ポロロッカに乗る)","amazon pororoca (アマゾンのポロロッカ)"],"synonyms":["tidal bore","bore tide"],"antonyms":[]}],"etymology":{"value":"Tupi language word meaning \"great destructive noise\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɔːroʊˈroʊkə/","syllables":"po-ro-ro-ca"},"inflection":{"noun_plural":"pororocas"},"usage_notes":{"explanation":"The term \"pororoca\" specifically refers to the tidal bore phenomenon that occurs in certain rivers, most notably the Amazon. It's characterized by large, fast-moving waves that travel upstream.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a tsunami on the Amazon River.","correct":"✓ I saw a pororoca on the Amazon River.","note":"A tsunami is a seismic sea wave, while a pororoca is a tidal bore specific to rivers."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Pororoca\" is a specialized term referring to a specific tidal phenomenon in South American rivers. Understanding requires knowledge of geography and natural phenomena. The word is not commonly used outside of specific scientific or adventurous contexts."},"example_sentences":[{"sentence":"The indigenous people of the Amazon have long been aware of the destructive power of the Pororoca.","translation":"アマゾンの先住民は、ポロロッカの破壊力を古くから知っていました。","type":"noun","meaning_category":"潮津波"},{"sentence":"Scientists study the Pororoca to better understand tidal dynamics in river systems.","translation":"科学者たちは、河川システムにおける潮汐のダイナミクスをより良く理解するために、ポロロッカを研究しています。","type":"noun","meaning_category":"潮津波"},{"sentence":"The Pororoca attracts surfers seeking a unique and challenging wave.","translation":"ポロロッカは、ユニークで挑戦的な波を求めるサーファーを魅了します。","type":"noun","meaning_category":"潮津波"}]}