{"word":"Khasa","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"カサ族：ネパールのカスの言語を話すインド・アーリア民族グループ。","english_definition":"An Indo-Aryan ethno-linguistic group native to the Himalayan region of Nepal, speaking the Khas language.","examples":[{"sentence":"The Khasa people have a rich cultural heritage.","translation":"カサ族は豊かな文化遺産を持っています。"},{"sentence":"The Khas language is related to Nepali.","translation":"カスの言語はネパール語と関連があります。"}],"collocations":["Khasa language","Khasa culture","Khasa kingdom"],"synonyms":["Parbatiya","Gorkhali"],"antonyms":[]}],"etymology":{"value":"The term Khasa is derived from ancient Sanskrit texts referring to a group of people inhabiting the Himalayan regions.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkʰʌsə/","syllables":"Kha-sa"},"inflection":{"notes":"Noun, plural: Khasas"},"usage_notes":{"explanation":"The term 'Khasa' is primarily used in historical and anthropological contexts to refer to a specific ethnic group and their language in the Himalayan region, particularly in Nepal and parts of India. It is important to use the term with respect and awareness of its cultural significance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Khasa is a country.","correct":"✓ Khasa is an ethnic group.","note":"Khasa refers to an ethnic group, not a country."},{"incorrect":"✗ Khasa language is same as Hindi.","correct":"✓ Khasa language is related to Nepali.","note":"Khasa language is related to Nepali, not Hindi."}],"priority":"★★☆"},"related_words":{"derivatives":["Khas (adjective: relating to the Khasa people or language)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Khasa' refers to an ethno-linguistic group native to the Himalayan region. This term is more commonly encountered in academic or anthropological contexts when discussing the history and culture of the region. Understanding the term requires familiarity with South Asian ethnography and historical linguistics."},"example_sentences":[{"sentence":"The ancient Khasa kingdom controlled a large territory in the western Himalayas.","translation":"古代カサ王国はヒマラヤ西部の広い地域を支配していました。","type":"noun","meaning_category":"ethnic group"},{"sentence":"The Khasa language has influenced the development of modern Nepali.","translation":"カスの言語は現代ネパール語の発展に影響を与えてきました。","type":"noun","meaning_category":"ethnic group"}]}