{"word":"Virtualism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(哲学)仮想主義、実在論に対する立場の一つで、現実世界の客観的な実在を否定し、現実とはシミュレーションや情報によって構成された仮想的なものであるとする考え方。","english_definition":"(Philosophy) A philosophical position, opposed to realism, that denies the objective reality of the real world, asserting that reality is a virtual construct composed of simulations or information.","examples":[{"sentence":"Virtualism suggests that our perception of reality is shaped by digital interfaces and mediated experiences.","translation":"仮想主義は、現実に対する私たちの認識が、デジタルインターフェースや仲介された経験によって形作られていることを示唆している。"},{"sentence":"Some proponents of virtualism argue that the distinction between the physical and digital worlds is becoming increasingly blurred.","translation":"仮想主義の支持者の中には、物理世界とデジタル世界の区別がますます曖昧になっていると主張する人もいる。"},{"sentence":"The concept of virtualism has gained traction with the rise of advanced technologies like virtual reality and augmented reality.","translation":"仮想主義の概念は、バーチャルリアリティや拡張現実のような高度な技術の台頭とともに注目を集めている。"}],"collocations":["philosophical virtualism (哲学的仮想主義)","digital virtualism (デジタル仮想主義)","virtualism and simulation (仮想主義とシミュレーション)","virtualism in art (芸術における仮想主義)","virtualism in media (メディアにおける仮想主義)"],"synonyms":["simulationism","idealism","constructivism","anti-realism"],"antonyms":["realism","materialism","objectivism"]},{"part_of_speech":"noun","definition":"(芸術)仮想現実主義、現実世界を仮想空間で再現・表現しようとする芸術運動や傾向。","english_definition":"(Art) A movement or trend in art that seeks to recreate or represent the real world in a virtual space.","examples":[{"sentence":"Virtualism in art often explores the boundaries between the physical and digital realms.","translation":"芸術における仮想現実主義は、物理的な領域とデジタル領域の境界を探求することが多い。"},{"sentence":"Virtualism artists use technologies like VR and AR to create immersive and interactive experiences for viewers.","translation":"仮想現実主義のアーティストは、VRやARのような技術を使って、没入型でインタラクティブな体験を鑑賞者に提供する。"},{"sentence":"The virtualism exhibition showcased artworks that challenged the traditional notions of space and presence.","translation":"仮想現実主義展では、空間と存在の伝統的な概念に挑戦するアート作品が展示された。"}],"collocations":["virtualism art (仮想現実主義アート)","virtualism exhibition (仮想現実主義展)","virtualism artist (仮想現実主義アーティスト)","virtualism and technology (仮想現実主義とテクノロジー)","virtualism and immersion (仮想現実主義と没入感)"],"synonyms":["digital art","new media art","interactive art","immersive art"],"antonyms":["traditional art","classical art"]}],"etymology":{"value":"The term \"virtualism\" is derived from \"virtual,\" which comes from the Medieval Latin \"virtualis,\" meaning \"being something in essence or effect, though not actually or in fact.\" The suffix \"-ism\" denotes a doctrine, principle, or theory.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvɜːrtʃuəlɪzəm/","syllables":"vir-tu-al-ism"},"inflection":{"noun_plural":"Virtualisms (まれに複数形で使われることがある)"},"usage_notes":{"explanation":"\"Virtualism\" is a term primarily used in philosophy and art. In philosophy, it represents a stance against realism, arguing that what we perceive as reality is essentially a virtual construct. In art, it refers to the use of virtual technologies to create immersive and interactive experiences. The term is relatively new and its usage is still evolving.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Virtualism is the same as virtual reality.","correct":"✓ Virtualism is a philosophical concept that explores the nature of reality, while virtual reality is a technology that creates immersive virtual environments.","note":"Virtualism is a philosophical concept, whereas virtual reality is a technology. They are related but distinct."},{"incorrect":"✗ Virtualism only applies to digital worlds.","correct":"✓ Virtualism can also be applied to non-digital simulations and constructs of reality.","note":"While often associated with digital technology, virtualism can also apply to other forms of simulation and constructed realities."}],"priority":"★☆☆"},"related_words":{"derivatives":["virtual (形容詞: 仮想の)","virtuality (名詞: 仮想性)","virtualize (動詞: 仮想化する)","virtualist (名詞: 仮想主義者)"],"related_concepts":["simulation theory (シミュレーション仮説)","augmented reality (拡張現実)","virtual reality (バーチャルリアリティ)","postmodernism (ポストモダニズム)","constructivism (構成主義)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門的な文脈でのみ使用される)","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Virtualism\" is a complex philosophical and artistic term. It suggests that what we think of as real might actually be a kind of simulation or construct. In philosophy, it challenges the idea that there's an objective, independent reality. In art, it describes art that uses virtual technologies to create new experiences. It's a term you'll mostly encounter in academic or artistic discussions.","priority":"★☆☆"},"example_sentences":[{"sentence":"The philosopher explored the implications of virtualism for our understanding of consciousness.","translation":"その哲学者は、仮想主義が私たちの意識の理解に与える影響を探求した。","type":"general","meaning_category":"哲学"},{"sentence":"Virtualism in contemporary art often involves the creation of interactive installations.","translation":"現代アートにおける仮想現実主義は、インタラクティブなインスタレーションの制作を伴うことが多い。","type":"general","meaning_category":"芸術"},{"sentence":"Critics of virtualism argue that it can lead to a detachment from the physical world.","translation":"仮想主義の批判者たちは、それが物理世界からの乖離につながる可能性があると主張する。","type":"general","meaning_category":"哲学・批判"},{"sentence":"The virtualism movement has influenced the development of new forms of storytelling in digital media.","translation":"仮想現実主義運動は、デジタルメディアにおける新しいストーリーテリングの形式の発展に影響を与えてきた。","type":"general","meaning_category":"芸術・メディア"}]}