{"word":"Funders","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"資金提供者、出資者","english_definition":"Individuals or organizations that provide financial support to a project, organization, or cause.","examples":[{"sentence":"The project is seeking funders to help with its development.","translation":"そのプロジェクトは、開発を支援してくれる資金提供者を求めています。"},{"sentence":"Major funders of the charity include several large corporations.","translation":"その慈善団体の主な資金提供者には、いくつかの大企業が含まれています。"},{"sentence":"We are grateful to all our funders for their generous support.","translation":"寛大なご支援を賜りましたすべての資金提供者の皆様に感謝申し上げます。"}],"collocations":["major funders","key funders","potential funders","seek funders","attract funders","thank funders"],"synonyms":["investors","donors","sponsors","benefactors","patrons","contributors"],"antonyms":["recipients","beneficiaries"]}],"etymology":{"value":"The word \"funders\" is simply the plural form of \"funder,\" which is derived from the verb \"fund.\" \"Fund\" comes from the Latin word \"fundus,\" meaning \"bottom, piece of land, estate.\" The financial sense developed from the idea of a foundation or basis for something.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfʌndərz/","syllables":"fun-ders"},"inflection":{"noun_plural":"Funders is already a plural noun."},"usage_notes":{"explanation":"\"Funders\" refers to the individuals or organizations that provide the financial resources necessary for something to operate or succeed. It's often used in the context of non-profits, research projects, or startups seeking investment. The term implies a more formal and significant level of financial support than a simple donation might suggest.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The funder are important for the project.","correct":"✓ The funders are important for the project.","note":"Since \"funders\" is plural, use the plural form of the verb \"to be\" (are)."},{"incorrect":"✗ We need to find a funder for our project.","correct":"✓ We need to find funders for our project.","note":"If the project requires multiple sources of funding, use the plural \"funders.\" If seeking a single, primary source, \"a funder\" is correct, but less common."}],"priority":"★★☆"},"related_words":{"derivatives":["fund (verb, noun)","funding (noun)","underfunded (adjective)","overfunded (adjective)"],"related_terms":["venture capitalist","angel investor","grantor","philanthropist"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in specific contexts (finance, non-profits).","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"funders\" is used to describe the people or organizations that provide money for a project or organization. It's common in discussions about business, research, or charities. Understanding this word helps in comprehending how projects are financed and sustained. It implies a formal financial relationship beyond simple donations."},"example_sentences":[{"sentence":"The university's research relies heavily on external funders.","translation":"その大学の研究は、外部の資金提供者に大きく依存している。","type":"noun","meaning_category":"資金提供者"},{"sentence":"They are actively seeking funders for their new environmental initiative.","translation":"彼らは新しい環境イニシアチブのために積極的に資金提供者を求めている。","type":"noun","meaning_category":"資金提供者"},{"sentence":"The documentary film acknowledged its funders in the closing credits.","translation":"そのドキュメンタリー映画は、エンドクレジットで資金提供者に謝意を表した。","type":"noun","meaning_category":"資金提供者"}]}