{"word":"polyergic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(化学)多作用性の、複数の反応に関与する","english_definition":"(chemistry) capable of participating in multiple reactions; exhibiting multiple effects.","examples":[{"sentence":"The polyergic catalyst facilitated several steps in the reaction sequence.","translation":"その多作用性の触媒は、反応系列のいくつかの段階を促進した。"},{"sentence":"This compound is polyergic and can interact with various biological targets.","translation":"この化合物は多作用性であり、さまざまな生物学的標的と相互作用することができる。"}],"collocations":["polyergic catalyst","polyergic compound","polyergic interaction"],"synonyms":["multifunctional","versatile","omnifarious"],"antonyms":["monoergic","unifunctional"]}],"etymology":{"value":"\"poly-\" (many) + \"-ergic\" (working, energy)","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɒliˈɜːrdʒɪk/","syllables":"pol-y-er-gic"},"inflection":{"notes":"Comparative and superlative forms are typically not used."},"usage_notes":{"explanation":"The term 'polyergic' is primarily used in scientific contexts, particularly in chemistry and pharmacology, to describe substances or systems that can participate in or influence multiple reactions or processes. It emphasizes the versatility or broad-spectrum activity of the substance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The drug had a polyergic effect on the patient's mood.","correct":"The drug had a multifaceted effect on the patient's mood.","note":"While 'polyergic' technically means having multiple effects, it is most commonly used in a chemical or pharmacological context. For describing effects on mood or behavior, 'multifaceted' or 'complex' are more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["synergistic","antagonistic","catalyst","reaction"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Polyergic' is a technical term mainly used in chemistry and pharmacology. It describes something, usually a chemical substance or a catalyst, that can participate in or cause multiple different reactions or have multiple effects. It is not a commonly used word in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The enzyme is polyergic, catalyzing both hydrolysis and oxidation reactions.","translation":"その酵素は多作用性であり、加水分解反応と酸化反応の両方を触媒する。","type":"adjective","meaning_category":"多作用性の"},{"sentence":"The research focused on identifying polyergic compounds with potential therapeutic applications.","translation":"その研究は、潜在的な治療応用を持つ多作用性化合物を特定することに焦点を当てた。","type":"adjective","meaning_category":"多作用性の"}]}