{"word":"simplexed","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(通信)単方向の、シンプレックスの","english_definition":"(telecommunications) transmitting signals in one direction only.","examples":[{"sentence":"Simplexed communication is suitable for applications where data only needs to flow in one direction.","translation":"単方向通信は、データが一方向にのみ流れる必要があるアプリケーションに適しています。"},{"sentence":"A walkie-talkie in simplex mode requires users to press a button to talk and release it to listen.","translation":"単方向モードのトランシーバーでは、ユーザーは話すためにボタンを押し、聞くためにボタンを離す必要があります。"}],"collocations":["simplexed communication","simplexed mode","simplexed system"],"synonyms":["one-way","unidirectional"],"antonyms":["duplex","bidirectional"]},{"part_of_speech":"verb","definition":"(過去形、過去分詞)simplexの形にする、単方向通信にする","english_definition":"(past tense and past participle of simplex) to convert to a simplex form or system; to make capable of one-way communication only.","examples":[{"sentence":"The system was simplexed to reduce complexity and cost.","translation":"複雑さとコストを削減するために、システムは単方向通信にされました。"},{"sentence":"The data transmission was simplexed for security reasons.","translation":"セキュリティ上の理由から、データ伝送は単方向通信にされました。"}],"collocations":["simplexed system","simplexed transmission"],"synonyms":["converted to simplex","made unidirectional"],"antonyms":["duplexed","made bidirectional"]}],"etymology":{"value":"Derived from 'simplex', meaning 'single' or 'one-way', with the addition of the '-ed' suffix to form the past tense and past participle of a verb or an adjective indicating a state or condition.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɪmˌplɛkst/","syllables":"sim-plexed"},"inflection":{"verb_forms":{"present_simple":["simplex"],"past_simple":"simplexed","past_participle":"simplexed","present_participle":"simplexing"},"adjective_forms":{}},"usage_notes":{"explanation":"'Simplexed' is primarily used in the context of telecommunications and engineering to describe a system or communication channel that operates in one direction only. As an adjective, it describes something that *is* simplex. As a verb (past tense/participle), it describes the *action* of making something simplex.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The communication was simplex, it can send and receive.","correct":"✓ The communication was half-duplex, it can send and receive, but not simultaneously. / ✓ The communication was duplex, it can send and receive simultaneously.","note":"Simplex communication is one-way only. If a system can both send and receive (even if not at the same time), it's not simplex."}],"priority":"★★☆"},"related_words":{"derivatives":["simplex (noun, adjective)","simplexing (verb - present participle)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Technical vocabulary)","frequency_google_ngram":"Low frequency - primarily used in technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Simplexed' is a technical term primarily used in telecommunications and engineering. It describes a system or communication channel that transmits signals in only one direction. It is not a commonly used word in everyday conversation. Understanding requires familiarity with technical concepts related to data transmission.","priority":"★★☆"},"example_sentences":[{"sentence":"The alarm system was designed with a simplexed connection to prevent hacking.","translation":"その警報システムは、ハッキングを防ぐために単方向接続で設計されました。","type":"adjective","meaning_category":"単方向の"},{"sentence":"The old radio system was simplexed, meaning it could only transmit, not receive.","translation":"その古い無線システムは単方向通信であり、送信のみ可能で、受信はできませんでした。","type":"adjective","meaning_category":"単方向の"},{"sentence":"To simplify the network, the data flow was simplexed.","translation":"ネットワークを簡素化するために、データフローは単方向通信にされました。","type":"verb (past participle)","meaning_category":"単方向通信にする"}]}