{"word":"case-marking","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"格標示、格表示","english_definition":"A system of grammatical marking that indicates the grammatical function of a noun or pronoun in a sentence, such as subject, object, or possessor.","examples":[{"sentence":"Japanese uses particles for case-marking.","translation":"日本語は格標示に助詞を使います。"},{"sentence":"Case-marking helps to clarify the roles of different nouns in a sentence.","translation":"格標示は文中の異なる名詞の役割を明確にするのに役立ちます。"},{"sentence":"Languages with rich case-marking systems often have more flexible word order.","translation":"豊かな格標示体系を持つ言語は、しばしば語順がより自由です。"}],"collocations":["nominative case-marking (主格標示)","accusative case-marking (対格標示)","dative case-marking (与格標示)","genitive case-marking (属格標示)","ergative case-marking (能格標示)","absolutive case-marking (絶対格標示)","case-marking particle (格標示助詞)"],"synonyms":["case inflection","grammatical case","morphological case"],"antonyms":[]},{"part_of_speech":"adjective","definition":"格標示の、格表示の","english_definition":"Relating to or involving the grammatical marking of cases.","examples":[{"sentence":"This language has a complex case-marking system.","translation":"この言語は複雑な格標示体系を持っています。"},{"sentence":"The case-marking suffixes are essential for understanding the grammar.","translation":"格標示接尾辞は文法を理解するために不可欠です。"}],"collocations":["case-marking system (格標示体系)","case-marking suffix (格標示接尾辞)","case-marking strategy (格標示戦略)"],"synonyms":["case-inflected","grammatically marked"],"antonyms":[]}],"etymology":{"value":"The term 'case-marking' is derived from the combination of 'case' (referring to grammatical case) and 'marking' (referring to the indication or signaling of that case).","priority":"★★★"},"pronunciation":{"ipa":"/ˈkeɪsˌmɑːrkɪŋ/","syllables":"case-mark-ing"},"inflection":{"noun_plural":"case-markings"},"usage_notes":{"explanation":"'Case-marking' refers to the way a language indicates the grammatical role of a noun phrase (e.g., subject, object, indirect object) within a sentence. This can be achieved through various means, including affixes (prefixes, suffixes), particles, or even word order. Languages like Latin, German, and Japanese are well-known for their case-marking systems. The presence and nature of case-marking can significantly influence a language's word order flexibility and overall grammatical structure.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Case marking is when you mark a case.","correct":"✓ Case-marking is a system of grammatical marking that indicates the grammatical function of a noun.","note":"The incorrect sentence is overly simplistic and doesn't capture the complexity of case-marking. The correct sentence provides a more accurate definition."},{"incorrect":"✗ English has a lot of case-marking.","correct":"✓ English has very little case-marking compared to languages like Latin or Japanese.","note":"While English retains some remnants of case (e.g., possessive 's, pronoun case), it is not a heavily case-marked language."}],"priority":"★★☆"},"related_words":{"derivatives":["case (noun, referring to grammatical case)","marker (noun, referring to the element that indicates case)"],"phrasal_verbs":[],"related_concepts":["grammatical case","nominative case","accusative case","dative case","genitive case","ergativity","absolutive case","case inflection","particle (grammar)","morphology","syntax"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in linguistics and language studies.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Case-marking' is a term primarily used in linguistics to describe how a language indicates the grammatical role of a noun or pronoun in a sentence. It involves understanding grammatical cases (like nominative, accusative, dative, etc.) and how they are signaled through morphological changes (inflections) or separate words (particles). This concept is more advanced and requires familiarity with linguistic terminology.","priority":"★☆☆"},"example_sentences":[{"sentence":"The suffixes in Finnish are examples of case-marking.","translation":"フィンランド語の接尾辞は格標示の例です。","type":"noun","meaning_category":"格標示の例"},{"sentence":"The presence of case-marking allows for more flexible word order in many languages.","translation":"格標示の存在は、多くの言語でより柔軟な語順を可能にします。","type":"noun","meaning_category":"格標示の機能"},{"sentence":"The student is studying the case-marking system of Old English.","translation":"学生は古英語の格標示体系を研究しています。","type":"adjective","meaning_category":"格標示体系の研究"}]}