{"word":"cross-bill","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(鳥類) イスカ (交喙)","english_definition":"A finch of the genus Loxia, having the tips of the mandibles crossing each other.","examples":[{"sentence":"The cross-bill is known for its unique beak.","translation":"イスカはその独特な嘴で知られている。"},{"sentence":"Cross-bills use their beaks to pry open cones and extract seeds.","translation":"イスカは嘴を使って松ぼっくりを開け、種を取り出す。"}],"collocations":["red cross-bill","parrot cross-bill"],"synonyms":["finch"],"antonyms":[]},{"part_of_speech":"noun","definition":"(法律) 反訴、反対請求","english_definition":"A claim brought by a defendant against the plaintiff in the same proceeding.","examples":[{"sentence":"The defendant filed a cross-bill against the plaintiff.","translation":"被告は原告に対して反訴を提起した。"},{"sentence":"The cross-bill sought damages for breach of contract.","translation":"反訴は契約違反による損害賠償を求めた。"}],"collocations":["file a cross-bill","counterclaim"],"synonyms":["counterclaim"],"antonyms":[]}],"etymology":{"value":"The term 'cross-bill' refers to the distinctive feature of the bird's beak, where the upper and lower mandibles cross each other. For the legal term, it refers to a 'bill' or claim that crosses over from the defendant to the plaintiff.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkrɔːs.bɪl/","syllables":"cross-bill"},"inflection":{"noun_plural":"cross-bills"},"usage_notes":{"explanation":"The term 'cross-bill' has two distinct meanings: one referring to a type of bird with a unique beak structure, and the other referring to a legal claim made by a defendant against a plaintiff. The context will usually make it clear which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a crossbill in the court.","correct":"✓ I learned about cross-bills in court.","note":"The bird 'cross-bill' is unlikely to be found in a courtroom. The legal term is more likely in that context."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'cross-bill' has two distinct meanings that are unrelated. One refers to a type of bird with a unique beak structure, and the other refers to a legal claim made by a defendant against a plaintiff. The context will usually make it clear which meaning is intended.","priority":"★★☆"},"example_sentences":[{"sentence":"The **cross-bill** is well-adapted to feeding on pine cones.","translation":"イスカは松ぼっくりを食べるのに適応している。","type":"noun","meaning_category":"Bird"},{"sentence":"The lawyer advised the client to file a **cross-bill**.","translation":"弁護士はクライアントに反訴を提起するように助言した。","type":"noun","meaning_category":"Legal claim"}]}