{"word":"Isidia","priority":"Low","meanings":[{"part_of_speech":"Noun","definition":"Vegetative propagules consisting of a cortex and medulla, produced by some lichens.","english_definition":"Small, detachable, vegetative propagules on the surface of a lichen thallus, consisting of a cortex, medulla, and sometimes algal cells.","examples":[{"sentence":"The lichen reproduces asexually through the dispersal of isidia.","translation":"その地衣類は、イシジアの散布によって無性生殖を行う。"},{"sentence":"The presence or absence of isidia is a key characteristic used in lichen identification.","translation":"イシジアの有無は、地衣類の識別に用いられる重要な特徴である。"}],"collocations":["Lichen isidia","Isidia formation","Isidia dispersal"],"synonyms":["Vegetative propagule","Lichen propagule"],"antonyms":[]}],"etymology":{"value":"Derived from Greek 'isos' meaning 'equal' and '-idion' a diminutive suffix, referring to their small size and similarity to the parent lichen.","priority":"Medium"},"pronunciation":{"ipa":"/ɪˈsɪdiə/","syllables":"i-sid-i-a"},"inflection":{"noun_plural":"Isidia"},"usage_notes":{"explanation":"Isidia are small, cylindrical or spherical outgrowths on the surface of lichen thalli. They contain both fungal and algal components, allowing them to grow into new lichens when dispersed. Their presence, shape, and density are important taxonomic characters.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"✗ The lichen has soredia instead of isidia.","correct":"✓ The lichen has soredia instead of isidia.","note":"Isidia and soredia are both vegetative propagules, but they differ in structure. Isidia have a cortex, while soredia do not."}],"priority":"Low"},"related_words":{"derivatives":[],"related_terms":["Soredia","Lichen","Thallus","Propagule","Vegetative reproduction"],"priority":"Medium"},"level_frequency":{"level":"Specialized (Botany/Mycology)","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"The term 'isidia' is a technical term used in the field of lichenology (the study of lichens). It refers to a specific type of vegetative structure found on some lichens that allows them to reproduce asexually. Understanding this term requires some background knowledge of lichen biology."},"example_sentences":[{"sentence":"The crustose lichen was covered in numerous isidia, giving it a granular appearance.","translation":"その地衣状地衣類は多数のイシジアで覆われており、粒状の外観を呈していた。","type":"Noun","meaning_category":"Vegetative propagule"},{"sentence":"Microscopic examination revealed the presence of algal cells within the isidia.","translation":"顕微鏡検査により、イシジア内に藻類細胞が存在することが明らかになった。","type":"Noun","meaning_category":"Vegetative propagule"}]}