{"word":"homeopathy","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ホメオパシー（同種療法）","english_definition":"A system of complementary medicine in which ailments are treated by minute doses of natural substances that in a healthy person would produce symptoms of the disease.","examples":[{"sentence":"Some people swear by homeopathy, while others dismiss it as pseudoscience.","translation":"ホメオパシーを信奉する人もいれば、疑似科学として否定する人もいる。"},{"sentence":"She decided to try homeopathy for her chronic allergies.","translation":"彼女は慢性アレルギーの治療にホメオパシーを試すことにした。"},{"sentence":"There is little scientific evidence to support the effectiveness of homeopathy.","translation":"ホメオパシーの有効性を裏付ける科学的根拠はほとんどない。"}],"collocations":["practice homeopathy (ホメオパシーを実践する)","try homeopathy (ホメオパシーを試す)","homeopathy treatment (ホメオパシー治療)","homeopathy remedy (ホメオパシー療法)","homeopathy practitioner (ホメオパシー開業医)"],"synonyms":["alternative medicine","complementary medicine","holistic medicine"],"antonyms":["conventional medicine","allopathic medicine"]}],"etymology":{"value":"Derived from the Greek words 'homoios' (similar) and 'pathos' (suffering or disease). Coined by Samuel Hahnemann in the late 18th century to describe his system of medicine based on the principle of 'like cures like'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌhoʊmiˈɒpəθi/","syllables":"ho-me-op-a-thy"},"inflection":{"noun_plural":"homeopathies (rarely used)"},"usage_notes":{"explanation":"Homeopathy is a controversial system of alternative medicine. Its central principle is 'like cures like,' meaning that a substance that causes symptoms in a healthy person can cure similar symptoms in a sick person. Homeopathic remedies are highly diluted, often to the point where there are no molecules of the original substance left in the final product. Mainstream medicine generally does not accept homeopathy as an effective treatment due to the lack of scientific evidence.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to a homeopathy doctor.","correct":"✓ I'm going to a homeopathic doctor. / ✓ I'm going to a homeopathy practitioner.","note":"Use 'homeopathic' as the adjective to describe the doctor or treatment. 'Homeopathy practitioner' is also a common and accurate term."},{"incorrect":"✗ Homeopathy is a proven science.","correct":"✓ Homeopathy is considered alternative medicine. / ✓ There is limited scientific evidence to support homeopathy.","note":"It's important to acknowledge the lack of widespread scientific support for homeopathy."}],"priority":"★★☆"},"related_words":{"derivatives":["homeopathic (adjective: relating to homeopathy)","homeopath (noun: a practitioner of homeopathy)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, primarily used in discussions about alternative medicine.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Homeopathy' refers to a system of alternative medicine based on the principle of treating ailments with highly diluted substances that, in larger doses, would produce similar symptoms in a healthy person. It's often discussed in the context of healthcare choices and debates about the effectiveness of different medical approaches. Understanding the term requires awareness of the distinction between conventional and alternative medical practices.","priority":"★★☆"},"example_sentences":[{"sentence":"She sought relief from her migraines through homeopathy.","translation":"彼女は片頭痛の緩和をホメオパシーに求めた。","type":"noun","meaning_category":"alternative medicine"},{"sentence":"The effectiveness of homeopathy is a subject of ongoing debate.","translation":"ホメオパシーの有効性は、現在も議論の対象となっている。","type":"noun","meaning_category":"alternative medicine"},{"sentence":"He consulted a homeopath for treatment of his eczema.","translation":"彼は湿疹の治療のためにホメオパシー医に相談した。","type":"noun","meaning_category":"alternative medicine"}]}