{"word":"solipsism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"唯我論（ゆいがろん）","english_definition":"the theory that only the self exists, or can be known to exist.","examples":[{"sentence":"Solipsism is a philosophical idea that is difficult to prove or disprove.","translation":"唯我論は証明することも反証することも難しい哲学的な考え方です。"},{"sentence":"The solipsist believes that the external world and other minds are not real.","translation":"唯我論者は、外界や他者の心は実在しないと信じています。"},{"sentence":"He argued that solipsism, while logically possible, was psychologically implausible.","translation":"彼は、唯我論は論理的には可能だが、心理的にはあり得ないと主張した。"}],"collocations":["philosophical solipsism","metaphysical solipsism","ethical solipsism","embrace solipsism","reject solipsism","argue against solipsism","discuss solipsism"],"synonyms":["subjectivism","egoism","individualism"],"antonyms":["realism","objectivism","altruism"]}],"etymology":{"value":"Derived from Latin 'solus' (alone, only) + 'ipse' (self). Coined in German as 'Solipsismus' in 1834.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsɒlɪpsɪzəm/","syllables":"so-lip-si-sm"},"inflection":{"noun_plural":"solipsisms"},"usage_notes":{"explanation":"Solipsism is a philosophical concept asserting that only one's own mind is sure to exist. It's a radical form of subjective idealism. It doesn't necessarily deny the existence of an external world, but claims that we cannot know anything about it with certainty. It is often used in philosophical discussions and thought experiments.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a solipsistic person who only cares about others.","correct":"✓ He is a solipsistic person who only cares about himself.","note":"Solipsism is about the self being the only thing that can be known to exist, so a solipsistic person would only care about themselves."},{"incorrect":"✗ Solipsism is the same as selfishness.","correct":"✓ Solipsism is a philosophical theory, while selfishness is a character trait.","note":"Solipsism is a philosophical position about existence and knowledge, while selfishness is a moral or behavioral characteristic."}],"priority":"★★☆"},"related_words":{"derivatives":["solipsist (noun: a person who believes in solipsism)","solipsistic (adjective: relating to solipsism)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. A philosophical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Solipsism' is a complex philosophical term. It refers to the idea that the only thing a person can be sure exists is their own mind. It's a concept often discussed in philosophy classes and advanced discussions about reality and knowledge. It's not a word you'd typically encounter in everyday conversation, but it's important to understand if you're studying philosophy."},"example_sentences":[{"sentence":"The novel explored the protagonist's descent into solipsism after a traumatic event.","translation":"その小説は、主人公がトラウマとなる出来事の後に唯我論に陥っていく様子を描いた。","type":"general","meaning_category":"philosophical concept"},{"sentence":"Critics accused the artist of solipsism, arguing that his work was too self-absorbed.","translation":"批評家たちはその芸術家を唯我論だと非難し、彼の作品は自己中心的すぎると主張した。","type":"general","meaning_category":"philosophical concept"},{"sentence":"The philosophical debate centered on whether solipsism could ever be disproven.","translation":"その哲学的な議論は、唯我論が反証されうるかどうかを中心に展開された。","type":"general","meaning_category":"philosophical concept"}]}