{"word":"Enterobiasis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"蟯虫症（ぎょうちゅうしょう）","english_definition":"An infection of the intestines caused by the pinworm Enterobius vermicularis.","examples":[{"sentence":"Enterobiasis is common in school-aged children.","translation":"蟯虫症は学齢期の子供によく見られます。"},{"sentence":"Symptoms of enterobiasis include itching around the anus.","translation":"蟯虫症の症状には、肛門周囲のかゆみなどがあります。"}],"collocations":["treat enterobiasis (蟯虫症を治療する)","diagnose enterobiasis (蟯虫症を診断する)","symptoms of enterobiasis (蟯虫症の症状)"],"synonyms":["pinworm infection","oxyuriasis"],"antonyms":[]}],"etymology":{"value":"The term 'Enterobiasis' comes from the genus name of the pinworm, 'Enterobius,' combined with the suffix '-iasis,' which indicates a disease or condition. 'Entero-' refers to the intestines, and 'bios' means life, reflecting the pinworm's life cycle in the intestines.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛntərəˈbaɪəsɪs/","syllables":"En-ter-o-bi-a-sis"},"inflection":{"noun_plural":"Enterobiases"},"usage_notes":{"explanation":"Enterobiasis is a parasitic infection caused by the pinworm Enterobius vermicularis. It is characterized by intense itching in the anal area, especially at night. The infection is spread through the ingestion of pinworm eggs, often due to poor hygiene. Diagnosis is typically made by identifying the eggs using the 'Scotch tape test.' Treatment usually involves medication to kill the worms and strict hygiene measures to prevent reinfection.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Enterobiasis is caused by a bacteria.","correct":"✓ Enterobiasis is caused by a worm.","note":"Enterobiasis is a parasitic infection caused by a worm, not a bacteria."},{"incorrect":"✗ Enterobiasis only affects adults.","correct":"✓ Enterobiasis commonly affects children.","note":"While enterobiasis can affect people of all ages, it is more common in children, especially school-aged children."}],"priority":"★★☆"},"related_words":{"derivatives":["Enterobius vermicularis (蟯虫)","pinworm (蟯虫)","anthelmintic (駆虫薬)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Enterobiasis' is a medical term referring to a pinworm infection. It's more commonly used in medical or scientific contexts. The infection is caused by the Enterobius vermicularis worm, and it's typically diagnosed using methods like the Scotch tape test to identify eggs around the anus. Treatment involves medication and improved hygiene practices. Due to its specialized nature, this term is not commonly encountered in everyday conversations but is important in medical discussions. "},"example_sentences":[{"sentence":"Good hygiene practices are essential to prevent the spread of enterobiasis.","translation":"蟯虫症の蔓延を防ぐためには、良好な衛生習慣が不可欠です。","type":"general","meaning_category":"prevention"},{"sentence":"The doctor suspected enterobiasis based on the patient's symptoms of anal itching.","translation":"医師は患者の肛門のかゆみの症状から蟯虫症を疑った。","type":"diagnosis","meaning_category":"symptoms"},{"sentence":"Treatment for enterobiasis typically involves a dose of medication for all family members.","translation":"蟯虫症の治療は通常、家族全員が薬を服用することを含みます。","type":"treatment","meaning_category":"treatment"}]}