{"word":"beneficiating","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(rare) to perform a service or kindness; to do good.","english_definition":"(rare) performing an act of kindness or service; doing good.","examples":[{"sentence":"He was known for beneficiating the poor in his community.","translation":"彼は地域社会の貧しい人々に恩恵を施すことで知られていた。"},{"sentence":"She spent her life beneficiating others through charitable work.","translation":"彼女は慈善活動を通じて他人に恩恵を施す人生を送った。"}],"collocations":["beneficiating the poor","beneficiating the community","beneficiating others"],"synonyms":["aiding","assisting","helping","serving","doing good"],"antonyms":["harming","hurting","injuring"]},{"part_of_speech":"verb","definition":"(rare) to hold a benefice (ecclesiastical office).","english_definition":"(rare) holding a benefice (an ecclesiastical office to which revenue is attached).","examples":[{"sentence":"The priest was beneficiating in a small rural parish.","translation":"その司祭は、小さな田舎の教区で聖職禄を享受していた。"}],"collocations":["beneficiating in a parish","beneficiating as a priest"],"synonyms":["holding a benefice","serving in a church office"],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'beneficiate,' which comes from the Latin 'beneficium' (benefit, kindness), combined with the suffix '-ing' to form the present participle or gerund.","priority":"★★☆"},"pronunciation":{"ipa":"/bɛnɪˈfɪʃieɪtɪŋ/","syllables":"ben-i-fi-ci-a-ting"},"inflection":{"verb_forms":{"present_participle":"beneficiating","gerund":"beneficiating"}},"usage_notes":{"explanation":"'Beneficiating' is a relatively rare word, primarily used in formal or literary contexts. It can refer to actively doing good or performing acts of kindness, or, more rarely, to holding a benefice in a church. The first meaning is more common than the second.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is beneficiating from the new tax laws.","correct":"✓ The company is benefiting from the new tax laws.","note":"'Beneficiating' should not be confused with 'benefiting,' which is the more common term for receiving advantages or gains. 'Beneficiating' implies actively providing benefits, not receiving them."}],"priority":"★★☆"},"related_words":{"derivatives":["beneficiate (verb): to improve or treat something, especially ore; to do good.","beneficiation (noun): the act of beneficiating; improvement or treatment.","beneficent (adjective): doing good; charitable.","beneficiary (noun): a person who benefits from something."],"related_forms":["benefit (verb, noun)","beneficial (adjective)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (very rare, likely only encountered in specialized or historical texts)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Beneficiating' is a rare and formal word. It means actively doing good or providing benefits to others. It is more often seen in historical or specialized texts and is not commonly used in everyday conversation. It is important to distinguish it from the more common word 'benefiting,' which means receiving benefits. The word is related to 'beneficent' (doing good) and 'beneficiary' (someone who receives benefits)."},"example_sentences":[{"sentence":"The organization is dedicated to beneficiating underprivileged children through education.","translation":"その組織は、教育を通じて恵まれない子供たちに恩恵を施すことに専念している。","type":"verb (present participle)","meaning_category":"doing good"},{"sentence":"He saw his role as beneficiating the lives of those less fortunate than himself.","translation":"彼は自分の役割を、自分より恵まれない人々の生活に恩恵を施すことだと考えていた。","type":"verb (present participle)","meaning_category":"doing good"},{"sentence":"In the past, a priest might have been described as beneficiating in a wealthy parish.","translation":"かつて、司祭は裕福な教区で聖職禄を享受していると表現されたかもしれない。","type":"verb (present participle)","meaning_category":"holding a benefice"}]}