{"word":"gasoscope","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"検ガス器、ガス検知器","english_definition":"An instrument for detecting the presence of gas, especially explosive or poisonous gas.","examples":[{"sentence":"The miners used a gasoscope to check for methane in the coal mine.","translation":"鉱夫たちは炭鉱でメタンガスを検知するために検ガス器を使った。"}],"collocations":["use a gasoscope","check with a gasoscope"],"synonyms":["gas detector","gas analyzer"],"antonyms":[]}],"etymology":{"value":"\"gas-\" (from gas) + \"-oscope\" (from Greek skopeō, meaning \"I view\").","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡæsəˌskoʊp/","syllables":"ga-so-scope"},"inflection":{"noun_plural":"gasoscopes"},"usage_notes":{"explanation":"A gasoscope is a scientific instrument used to detect and often measure the concentration of specific gases in an environment. It is commonly used in industries such as mining, oil and gas, and environmental monitoring to ensure safety and compliance with regulations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a telescope to find the gas leak.","correct":"✓ I used a gasoscope to find the gas leak.","note":"A telescope is for viewing distant objects, while a gasoscope is specifically for detecting gases."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A gasoscope is a specialized instrument used to detect the presence of specific gases. It is primarily used in industrial settings to ensure safety and compliance. The term is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The technician used a gasoscope to identify the source of the leak.","translation":"技術者はガス漏れの源を特定するために検ガス器を使った。","type":"noun","meaning_category":"検ガス器"},{"sentence":"The gasoscope indicated a high concentration of carbon monoxide.","translation":"検ガス器は一酸化炭素の高濃度を示した。","type":"noun","meaning_category":"検ガス器"}]}