{"word":"straddlingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"またがって、両足を広げて、または、両方の立場に立って。","english_definition":"In a manner that involves sitting or standing with one leg on either side of something; or in a way that involves being in two conflicting positions or opinions at the same time.","examples":[{"sentence":"He sat straddlingly on the motorcycle.","translation":"彼はオートバイにまたがって座った。"},{"sentence":"The politician spoke straddlingly on the issue, trying to appeal to both sides.","translation":"その政治家はその問題について、両方の側に訴えかけようとして、どちらつかずの発言をした。"}],"collocations":["sit straddlingly","stand straddlingly","speak straddlingly"],"synonyms":["astride","ambiguously","equivocally"],"antonyms":["clearly","definitely","unambiguously"]}],"etymology":{"value":"Derived from the verb 'straddle' (to sit or stand with one leg on either side of) with the addition of the adverbial suffix '-ingly'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstrædlɪŋli/","syllables":"strad-dling-ly"},"inflection":{"notes":"This is an adverb, so it does not have plural or verb forms."},"usage_notes":{"explanation":"'Straddlingly' describes the manner in which an action is performed. It can refer to the physical act of straddling something, or the more abstract act of holding two opposing views or positions simultaneously. It is not a commonly used word.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He straddlingly the horse.","correct":"✓ He straddled the horse.","note":"'Straddlingly' is an adverb, so it modifies a verb, adjective, or another adverb. 'Straddle' is the verb in this case."}],"priority":"★☆☆"},"related_words":{"derivatives":["straddle (verb, noun)","straddling (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Straddlingly' is an adverb that describes the way something is done. It means doing something while having one leg on each side of something, or having two different opinions about something at the same time. Because it is not a common word, it is more likely to be found in advanced texts. "},"example_sentences":[{"sentence":"The child sat straddlingly on the wooden horse.","translation":"子供は木馬にまたがって座った。","type":"adverb","meaning_category":"Physical Position"},{"sentence":"The company addressed the environmental concerns straddlingly, acknowledging the need for change while continuing their harmful practices.","translation":"その会社は、変化の必要性を認めながらも、有害な慣行を継続し、環境問題に曖昧な態度で対処した。","type":"adverb","meaning_category":"Ambiguous Stance"}]}