{"word":"decollate","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(書類などを)分離する、ページを分ける","english_definition":"to separate and arrange in correct order the sheets of (a set of multiple copies of a document) after they have been printed.","examples":[{"sentence":"The machine can collate and decollate documents quickly.","translation":"その機械は書類を素早く照合したり、分離したりできる。"},{"sentence":"After printing, decollate the sets of forms.","translation":"印刷後、フォームのセットを分離してください。"}],"collocations":["decollate documents","decollate forms","decollate sets"],"synonyms":["separate","unstack","sort"],"antonyms":["collate","assemble","stack"]},{"part_of_speech":"verb","transitivity":"vt","definition":"(生物学)除去する、切除する (特に神経学で脳の一部を切除すること)","english_definition":"(biology) to remove or cut off (a part of an animal or plant, especially the brain or part of the brain).","examples":[{"sentence":"The researchers decollated the snails to study their nervous systems.","translation":"研究者たちは、カタツムリの神経系を研究するために、それらを切除した。"},{"sentence":"Decollating the cerebral cortex can affect behavior.","translation":"大脳皮質を切除すると、行動に影響を与える可能性がある。"}],"collocations":["decollate the brain","decollate the cortex","decollate an animal"],"synonyms":["excise","remove","ablate","resect"],"antonyms":["implant","graft"]}],"etymology":{"value":"From Latin *de-* (removal) + *collat-* (brought together, compared), from *con-* (together) + *ferre* (to bring).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdiːˈkɒleɪt/","syllables":"de-col-late"},"inflection":{"verb_forms":{"present_simple":["decollate","decollates"],"past_simple":"decollated","past_participle":"decollated","present_participle":"decollating"}},"usage_notes":{"explanation":"The word \"decollate\" has two main meanings:\n\n1.  In the context of documents, it means to separate sheets that have been printed together (often in multiple copies) into individual sets.\n2.  In biology (particularly neurology), it means to remove or cut off a part of an organism, especially the brain or part of the brain. This usage is more technical.\n\nThe document-related meaning is more common in office or printing environments, while the biological meaning is specific to scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to collate the documents before I decollate them.","correct":"✓ I need to collate the documents, then decollate the copies.","note":"Collate means to assemble in order, while decollate means to separate. You usually collate first if you're assembling different pages into a set, then decollate the copies of that set. However, the order depends on the process."},{"incorrect":"✗ The decollated brain showed no activity.","correct":"✓ The decollated animal showed no brain activity.","note":"When referring to the biological meaning, it's important to specify what was decollated (e.g., the brain, the animal)."}],"priority":"★★☆"},"related_words":{"derivatives":["decollation (noun: the act of decollating)"],"related_terms":["collation (noun: the act of collating)","collate (verb: to assemble in order)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (technical vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"decollate\" is a relatively uncommon word with two distinct meanings. In the context of document handling, it refers to the process of separating multiple copies of a document into individual sets after printing. In a biological context, it refers to the surgical removal or excision of a part of an organism, especially the brain. The biological meaning is highly specialized and found primarily in scientific literature. Understanding the context is crucial to interpreting the meaning of \"decollate\" correctly."},"example_sentences":[{"sentence":"The printer can automatically **decollate** the output.","translation":"そのプリンターは出力を自動的に分離できる。","type":"verb (document context)","meaning_category":"分離する (書類)"},{"sentence":"**Decollating** the spinal cord allowed for detailed study of the neurons.","translation":"脊髄を切除することで、ニューロンの詳細な研究が可能になった。","type":"verb (biological context)","meaning_category":"除去する (生物学)"},{"sentence":"After printing hundreds of copies, we had to **decollate** them all by hand.","translation":"数百部印刷した後、私たちはそれらすべてを手で分離しなければならなかった。","type":"verb (document context)","meaning_category":"分離する (書類)"}]}