{"word":"photoradio","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"写真電送、写真電報","english_definition":"A system or device for transmitting photographs by radio; a photograph transmitted by radio.","examples":[{"sentence":"The newspaper received the photoradio from their correspondent overseas.","translation":"新聞社は海外特派員から写真電送を受け取った。"},{"sentence":"Photoradio technology was crucial for disseminating news during wartime.","translation":"写真電送技術は戦時中にニュースを広める上で非常に重要だった。"}],"collocations":["send a photoradio","receive a photoradio","photoradio transmission","photoradio technology"],"synonyms":["radiophoto","wirephoto","facsimile"],"antonyms":[]}],"etymology":{"value":"A blend of \"photo\" (from photograph) and \"radio\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfoʊtoʊˈreɪdioʊ/","syllables":"pho-to-ra-di-o"},"inflection":{"noun_plural":"photoradios"},"usage_notes":{"explanation":"The term \"photoradio\" refers to both the technology and the resulting image transmitted via radio waves. It is largely a historical term, as modern digital methods have replaced analog photoradio systems. However, the concept remains relevant in understanding the evolution of media and communication technologies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I sent a photoradio to my friend using email.","correct":"✓ I sent a photo to my friend using email.","note":"Photoradio specifically refers to transmission via radio waves, not digital methods like email."}],"priority":"★☆☆"},"related_words":{"derivatives":["photoradiogram (noun): A photograph produced by photoradiography."],"phrasal_verbs":[],"related_terms":["radio","photography","telecommunication","facsimile"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"photoradio\" is relatively uncommon in modern usage. It refers to the historical technology of transmitting photographs via radio waves, a method largely superseded by digital communication. Understanding the term requires familiarity with both photography and radio technology, as well as an awareness of historical communication methods. Its use is generally limited to discussions of media history or technical contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"During World War II, photoradio was used to transmit images of battles from the front lines.","translation":"第二次世界大戦中、写真電送は戦場からの戦闘の画像を送信するために使用された。","type":"noun","meaning_category":"写真電送"},{"sentence":"The museum exhibit featured a vintage photoradio transmitter.","translation":"博物館の展示会には、ヴィンテージの写真電送送信機が展示されていた。","type":"noun","meaning_category":"写真電送"}]}