{"word":"revarnishes","priority":"N/A","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(家具、絵画など)を再ニス塗りする","english_definition":"to apply a new coat of varnish to (something, especially furniture or a painting).","examples":[{"sentence":"He revarnishes antique furniture as a hobby.","translation":"彼は趣味でアンティーク家具を再ニス塗りする。"},{"sentence":"The painting was carefully revarnished to restore its original luster.","translation":"その絵画は、元の輝きを取り戻すために注意深く再ニス塗りされた。"}],"collocations":["revarnish furniture","revarnish a painting","revarnish an antique"],"synonyms":["varnish again","recoat with varnish"],"antonyms":["strip varnish","remove varnish"]}],"etymology":{"value":"The word \"revarnish\" is formed by adding the prefix \"re-\" (meaning \"again\") to the word \"varnish\". \"Varnish\" itself comes from Old French \"vernis,\" which is related to Medieval Latin \"veronix,\" meaning a type of resin.","priority":"N/A"},"pronunciation":{"ipa":"/ˌriːˈvɑːrnɪʃɪz/","syllables":"re-var-nish-es"},"inflection":{"verb_forms":{"present_simple":["revarnishes"],"past_simple":"revarnished","past_participle":"revarnished","present_participle":"revarnishing"}},"usage_notes":{"explanation":"\"Revarnish\" is a verb that describes the action of applying a new layer of varnish to an object that has already been varnished before. This is often done to protect the surface, enhance its appearance, or restore its original condition. It is commonly used in the context of furniture restoration, art conservation, and woodworking.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ I am going to revarnish the wood.","correct":"✓ I am going to revarnish the wood.","note":"The original sentence is already correct. Common mistakes are more likely to involve incorrect spelling or using the wrong tense."}],"priority":"N/A"},"related_words":{"derivatives":["revarnishing (noun/gerund)","revarnished (adjective)"],"phrasal_verbs":[],"related_terms":["varnish","lacquer","polish","stain"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The word \"revarnish\" is a relatively uncommon word, typically used in specialized contexts such as furniture restoration or art conservation. It simply means to apply a new coat of varnish to something. Understanding the meaning of the prefix \"re-\" and the base word \"varnish\" is helpful in deciphering its meaning. The word is more likely to be encountered in written texts related to these specific fields rather than in everyday conversation."},"example_sentences":[{"sentence":"The craftsman carefully revarnishes the table to protect it from scratches.","translation":"職人は傷から保護するために、テーブルを丁寧に再ニス塗りする。","type":"verb","meaning_category":"to apply a new coat of varnish"},{"sentence":"She revarnishes her paintings every few years to keep them looking their best.","translation":"彼女は絵の見栄えを保つために、数年ごとに絵を再ニス塗りする。","type":"verb","meaning_category":"to apply a new coat of varnish"}]}