{"word":"Matronizing","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人を)保護[後援]するような態度で接する、見下すような態度で接する","english_definition":"To treat someone with condescension; to act in a patronizing manner.","examples":[{"sentence":"He disliked being matronized by his older sister.","translation":"彼は年上の姉に見下されるのが嫌だった。"},{"sentence":"She felt matronized by the condescending tone of his voice.","translation":"彼女は彼の見下すような口調に、保護されているような気になった。"}],"collocations":["matronize someone","matronize someone with condescension"],"synonyms":["patronize","condescend","treat condescendingly","look down on"],"antonyms":["respect","value","appreciate"]}],"etymology":{"value":"The word 'matronize' is derived from 'matron,' referring to a mature woman, especially one who is dignified or has social standing. The suffix '-ize' transforms the noun into a verb, indicating the act of behaving like a matron, often in a condescending or patronizing way.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmeɪtrənaɪzɪŋ/","syllables":"may-tron-i-zing"},"inflection":{"verb_forms":{"present_simple":["matronize","matronizes"],"past_simple":"matronized","past_participle":"matronized","present_participle":"matronizing"}},"usage_notes":{"explanation":"'Matronizing' implies treating someone as if they are less capable or knowledgeable, often by offering unsolicited advice or help. It carries a negative connotation, suggesting a lack of respect for the other person's autonomy and abilities. The term is relatively uncommon and is often used in formal or literary contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She was matronizing the children with gifts.","correct":"✓ She was patronizing the children with gifts.","note":"'Matronizing' specifically refers to a condescending attitude, not simply providing gifts or care. 'Patronizing' is a more common and suitable word in this context."},{"incorrect":"✗ He matronized the situation by taking control.","correct":"✓ He took control of the situation.","note":"'Matronize' is typically used to describe how someone treats another person, not a situation. Using 'took control' is more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["matron (noun): a married woman, especially one who is mature and dignified; a female supervisor in a school or hospital.","matronly (adjective): having characteristics associated with a matron, such as being dignified, stout, or protective.","patronize (verb): to treat with condescension; to be a customer of a business."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Matronizing' is a relatively uncommon word that describes the act of treating someone in a condescending or patronizing manner, as if they are less capable or knowledgeable. It is often used to describe interactions where one person assumes a superior position and offers unsolicited advice or help. Understanding this word requires a good grasp of social dynamics and nuanced communication.","priority":"★☆☆"},"example_sentences":[{"sentence":"The professor's matronizing tone made the students feel inadequate.","translation":"教授の見下すような口調は、学生たちに自分は不十分だと感じさせた。","type":"verb","meaning_category":"condescending attitude"},{"sentence":"She resented being matronized by her well-meaning but overbearing aunt.","translation":"彼女は善意からくるものだが、横柄な叔母に見下されることに腹を立てた。","type":"verb","meaning_category":"condescending attitude"},{"sentence":"He tried to offer constructive criticism without sounding matronizing.","translation":"彼は見下しているように聞こえないように、建設的な批判をしようとした。","type":"verb","meaning_category":"condescending attitude"}]}