{"word":"pseudoconglomerate","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(地質学) 偽礫岩：堆積岩の一種で、外見は礫岩に似ているが、堆積後に変形や再結晶作用を受けて形成されたもの。","english_definition":"(geology) A sedimentary rock that resembles a conglomerate but is formed by post-depositional deformation or recrystallization.","examples":[{"sentence":"The outcrop contained a significant amount of pseudoconglomerate, indicating complex geological processes.","translation":"その露頭にはかなりの量の偽礫岩が含まれており、複雑な地質学的プロセスを示していた。"}],"collocations":["geological survey","sedimentary rock","deformation","recrystallization"],"synonyms":["deformed conglomerate","metaconglomerate"],"antonyms":[]}],"etymology":{"value":"\"pseudo-\" (偽の) + \"conglomerate\" (礫岩)","priority":"★★★"},"pronunciation":{"ipa":"/ˌsuːdoʊkənˈɡlɒmərət/","syllables":"pseu-do-con-glom-er-ate"},"inflection":{"noun_plural":"pseudoconglomerates"},"usage_notes":{"explanation":"Pseudoconglomerates are often difficult to distinguish from true conglomerates without detailed microscopic analysis. The key difference lies in their origin: true conglomerates are formed by the cementation of rounded gravel clasts, while pseudoconglomerates are formed by the deformation or alteration of other sedimentary rocks, giving them a conglomerate-like appearance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rock was identified as a conglomerate, but it was actually a pseudoconglomerate because the clasts were not rounded.","correct":"✓ The rock was identified as a conglomerate, but it was actually a pseudoconglomerate because the 'clasts' were formed by deformation, not by deposition of rounded gravel.","note":"The critical distinction is the origin of the clasts, not just their shape."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudo- (接頭辞: 偽の、見せかけの)","conglomerate (名詞: 礫岩、複合企業)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 地質学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"pseudoconglomerate\" is a specialized geological term referring to a rock that superficially resembles a conglomerate (a sedimentary rock composed of rounded gravel fragments cemented together). However, a pseudoconglomerate is formed through different processes, typically involving the deformation or alteration of existing rocks, which creates structures that mimic the appearance of a true conglomerate. Understanding the distinction requires knowledge of sedimentary petrology and deformation processes.","priority":"★★☆"},"example_sentences":[{"sentence":"Detailed petrographic analysis revealed the rock to be a pseudoconglomerate rather than a true conglomerate.","translation":"詳細な岩石学的分析により、その岩石は真の礫岩ではなく偽礫岩であることが明らかになった。","type":"noun","meaning_category":"地質学"},{"sentence":"The presence of pseudoconglomerate in the region suggests a history of intense tectonic activity.","translation":"その地域における偽礫岩の存在は、激しい構造活動の歴史を示唆している。","type":"noun","meaning_category":"地質学"}]}