{"word":"FNPA","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(金融)外国親法人等(Foreign Parented Non-Financial Affiliate)の略","english_definition":"Abbreviation for Foreign Parented Non-Financial Affiliate (FNPA). A U.S. business enterprise in which a foreign entity owns or controls, directly or indirectly, 10 percent or more of the voting securities if the enterprise is incorporated, or an equivalent interest if the enterprise is unincorporated, and that is not a financial institution.","examples":[{"sentence":"The BEA collects data on FNPAs to understand the impact of foreign investment on the U.S. economy.","translation":"BEA（米国経済分析局）は、外国投資が米国経済に与える影響を理解するために、FNPAに関するデータを収集しています。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Acronym derived from 'Foreign Parented Non-Financial Affiliate'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛf ɛn piː ˈeɪ/","syllables":"ef-en-pee-ay"},"inflection":{},"usage_notes":{"explanation":"FNPA is a technical term used primarily in economics and business statistics, specifically when discussing foreign direct investment in the United States. It excludes financial institutions to focus on non-financial sectors.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["foreign direct investment (FDI)","BEA (Bureau of Economic Analysis)","affiliate","subsidiary"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency. It is a specialized term.","priority":"★★★"},"readability_explanation":{"level":"C1","text":"FNPA is a highly specialized term used in the context of international economics and business. Understanding it requires familiarity with concepts such as foreign direct investment and the structure of multinational corporations. It is not commonly used outside of these specific fields."},"example_sentences":[{"sentence":"The study focused on the impact of FNPAs on U.S. employment.","translation":"その研究は、FNPAが米国の雇用に与える影響に焦点を当てました。","type":"noun","meaning_category":"Foreign Parented Non-Financial Affiliate"}]}