{"word":"Electrophilic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"求電子性の、電子を好む","english_definition":"Having an affinity for electrons; tending to attack regions of high electron density.","examples":[{"sentence":"Electrophilic reagents are attracted to electron-rich areas of a molecule.","translation":"求電子試薬は、分子内の電子密度の高い領域に引き寄せられます。"},{"sentence":"The reaction proceeds via an electrophilic attack.","translation":"その反応は求電子攻撃によって進行します。"}],"collocations":["electrophilic attack","electrophilic reagent","electrophilic substitution"],"synonyms":["electron-loving","electron-seeking"],"antonyms":["nucleophilic"]}],"etymology":{"value":"Derived from 'electro-' (referring to electrons) and '-philic' (from Greek 'philos' meaning 'loving').","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˌlɛktrəˈfɪlɪk/","syllables":"e-lec-tro-phil-ic"},"inflection":{"notes":"This is an adjective and does not have typical inflectional forms (e.g., no plural or verb forms)."},"usage_notes":{"explanation":"'Electrophilic' describes a chemical species (an atom, ion, or molecule) that is attracted to electrons or electron-rich centers. Electrophiles participate in chemical reactions by accepting an electron pair to form a chemical bond. They are important in organic chemistry, particularly in reactions involving aromatic compounds and alkenes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The reaction was caused by a electrophilic.","correct":"✓ The reaction was caused by an electrophilic reagent.","note":"'Electrophilic' is an adjective and must be followed by a noun (e.g., electrophilic reagent, electrophilic attack)."},{"incorrect":"✗ The molecule is very electrophilic, so it gave electrons.","correct":"✓ The molecule is very electrophilic, so it accepts electrons.","note":"Electrophiles accept, not give, electrons. A molecule that donates electrons is nucleophilic."}],"priority":"★★☆"},"related_words":{"derivatives":["electrophile (noun: a species that is attracted to electrons)","electrophilicity (noun: the extent to which a chemical species is electrophilic)"],"related_terms":["nucleophile","nucleophilic","electron","electron density","chemical reaction","organic chemistry"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency (specialized scientific term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Electrophilic' is a term used in chemistry to describe something that 'loves' or is attracted to electrons. Electrons are negatively charged, so an electrophilic substance is typically positively charged or has a partial positive charge. These substances are important in chemical reactions because they seek out areas in molecules that have a lot of electrons, and they react with those areas. It's a term mainly used by chemists and in advanced chemistry contexts."},"example_sentences":[{"sentence":"The bromination of benzene is an example of an **electrophilic** aromatic substitution.","translation":"ベンゼンの臭素化は、求電子芳香族置換反応の一例です。","type":"adjective","meaning_category":"chemical property"},{"sentence":"The **electrophilic** character of the carbocation makes it susceptible to nucleophilic attack.","translation":"カルボカチオンの求電子性により、求核攻撃を受けやすくなります。","type":"adjective","meaning_category":"chemical property"}]}