{"word":"dissipatedly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"放蕩に、浪費的に、身を持ち崩して","english_definition":"In a dissipated manner; wastefully; profligately; living a life of excessive indulgence in sensual pleasures.","examples":[{"sentence":"He lived dissipatedly, squandering his inheritance on gambling and drink.","translation":"彼は放蕩な生活を送り、ギャンブルと酒に遺産を浪費した。"},{"sentence":"The young man behaved dissipatedly, showing little regard for his health or future.","translation":"その若者は身を持ち崩したように振る舞い、自身の健康や将来をほとんど気にかけなかった。"}],"collocations":["live dissipatedly","behave dissipatedly","spend dissipatedly"],"synonyms":["profligately","wastefully","debauchedly","licentiously","immorally"],"antonyms":["prudently","frugally","temperately","morally"]}],"etymology":{"value":"Formed from 'dissipated' + '-ly'. 'Dissipated' comes from the verb 'dissipate', meaning to scatter, waste, or vanish, which originates from Latin 'dissipare' (to scatter). The '-ly' suffix transforms the adjective into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɪsɪˌpeɪtɪdlɪ/","syllables":"dis-si-pa-ted-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Dissipatedly' describes actions or a lifestyle characterized by excessive indulgence in pleasures, often leading to wastefulness and a decline in moral or physical health. It suggests a lack of self-control and a tendency to squander resources. It is not a commonly used word, and often implies a negative judgment.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He dissipatedly worked on the project.","correct":"✓ He worked on the project in a dissipated manner.","note":"'Dissipatedly' describes a lifestyle or behavior, not the manner of working on a project. Use it to describe how someone lives or behaves generally, not specific actions related to work or other responsibilities."},{"incorrect":"✗ She dissipatedly felt sad.","correct":"✓ She felt sad and dissipated.","note":"'Dissipatedly' describes actions, not feelings. Use it to describe how someone behaves, not how they feel."}],"priority":"★☆☆"},"related_words":{"derivatives":["dissipate (verb)","dissipated (adjective)","dissipation (noun)"],"synonyms":["profligately","wastefully","debauchedly","licentiously","immorally"],"antonyms":["prudently","frugally","temperately","morally"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Dissipatedly' is an advanced word describing a lifestyle of excessive indulgence and wastefulness. It's not commonly used and implies a negative judgment. It's best understood in the context of describing how someone lives or behaves in a generally unrestrained and self-destructive manner. It is not used to describe specific actions unrelated to this lifestyle."},"example_sentences":[{"sentence":"He spent his inheritance dissipatedly, traveling the world and indulging in every luxury.","translation":"彼は遺産を放蕩に使い、世界中を旅してあらゆる贅沢にふけった。","type":"adverb","meaning_category":"放蕩に"},{"sentence":"The artist lived dissipatedly, neglecting his health and responsibilities in pursuit of pleasure.","translation":"その芸術家は放蕩な生活を送り、快楽を追求するために自身の健康や責任を顧みなかった。","type":"adverb","meaning_category":"身を持ち崩して"},{"sentence":"She behaved dissipatedly, ignoring the consequences of her actions.","translation":"彼女は身を持ち崩したように振る舞い、自身の行動の結果を無視した。","type":"adverb","meaning_category":"浪費的に"}]}