{"word":"seriality","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"連続性、連続している性質、連載性","english_definition":"The state or quality of being serial; the condition of occurring in a series or sequence.","examples":[{"sentence":"The seriality of the murders made the case particularly frightening.","translation":"その殺人事件の連続性は、事件を特に恐ろしいものにした。"},{"sentence":"The author explored the theme of seriality in his novels.","translation":"その作家は、自身の小説で連続性というテーマを探求した。"},{"sentence":"The seriality of the data allowed for trend analysis.","translation":"データの連続性により、傾向分析が可能になった。"}],"collocations":["temporal seriality (時間的な連続性)","narrative seriality (物語の連続性)","causal seriality (因果的な連続性)"],"synonyms":["sequence","succession","continuity","progression","series"],"antonyms":["randomness","discontinuity","interruption"]},{"part_of_speech":"noun","definition":"（哲学）連続的な存在、一連の出来事","english_definition":"(Philosophy) The condition of being a series of successive events or states.","examples":[{"sentence":"Sartre discussed the concept of seriality in his existentialist philosophy.","translation":"サルトルは、実存主義哲学の中で連続性の概念について議論した。"},{"sentence":"Seriality implies a lack of individual agency within a larger group.","translation":"連続性は、より大きなグループ内での個々の主体性の欠如を意味する。"}],"collocations":["existential seriality (実存的な連続性)","social seriality (社会的な連続性)"],"synonyms":["successiveness","sequentiality"],"antonyms":["singularity","isolation"]}],"etymology":{"value":"Derived from 'serial' (adjective) + '-ity' (suffix denoting a state or quality). 'Serial' comes from Latin 'seriālis,' pertaining to a series.","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɪəriˈæləti/","syllables":"se-ri-al-i-ty"},"inflection":{"noun_plural":"serialities"},"usage_notes":{"explanation":"'Seriality' refers to the quality or state of being serial, meaning occurring in a series or sequence. It can describe the arrangement of events, objects, or data in a specific order. In philosophical contexts, particularly within existentialism, 'seriality' describes a specific mode of being where individuals are part of a series but lack genuine connection or agency. The term is relatively formal and is more common in academic or technical contexts than in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The seriality of the event was interesting.","correct":"✓ The series of events was interesting.","note":"In general conversation, 'series of events' is more common than 'seriality of the event'. Use 'seriality' when emphasizing the quality of being in a series or sequence, rather than just referring to a series itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["serial","serialize","serialization"],"related_terms":["series","sequence","succession"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. More common in academic and technical writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Seriality' is a relatively uncommon word that means the quality of being serial, or occurring in a series. It's often used in academic or technical contexts to describe things that happen in a specific order or sequence. For example, it might be used to describe the order of events in a story or the way data is arranged in a computer program. In philosophy, it can refer to a state of being part of a series without having a strong individual identity. It's not a word you're likely to hear in everyday conversation, but it's useful to know if you're reading academic or technical texts."},"example_sentences":[{"sentence":"The **seriality** of the numbers was crucial for identifying the pattern.","translation":"その数字の連続性は、パターンを特定するために重要だった。","type":"noun","meaning_category":"連続性"},{"sentence":"The philosopher explored the concept of **seriality** in modern society.","translation":"その哲学者は、現代社会における連続性の概念を探求した。","type":"noun","meaning_category":"連続的な存在"}]}