{"word":"woolly-butted","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(slang, humorous) Stubborn, obstinate, or headstrong.","english_definition":"(slang, humorous) Stubborn, obstinate, or headstrong.","examples":[{"sentence":"He's a woolly-butted old man who never changes his mind.","translation":"彼は頑固で意地っ張りな老人で、決して考えを変えない。"},{"sentence":"Don't be so woolly-butted; try to see things from my perspective.","translation":"そんなに頑固にならないで、私の立場から物事を考えてみて。"}],"collocations":["woolly-butted old man","woolly-butted attitude","woolly-butted refusal"],"synonyms":["stubborn","obstinate","headstrong","pigheaded","mulish"],"antonyms":["flexible","compliant","agreeable","yielding"]},{"part_of_speech":"adjective","definition":"(literally) Having a woolly rear end.","english_definition":"(literally) Having a woolly rear end.","examples":[{"sentence":"The woolly-butted sheep grazed peacefully in the meadow.","translation":"毛むくじゃらの尻をした羊たちが牧草地で穏やかに草を食んでいた。"}],"collocations":["woolly-butted sheep","woolly-butted lamb"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Likely a humorous formation based on the image of a sheep or goat with a thick, woolly rear end, suggesting a stubborn or unyielding nature. The literal meaning likely came first, with the figurative meaning developing later.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌwʊli ˈbʌtɪd/","syllables":"wool-ly-but-ted"},"inflection":{"notes":"Adjective, comparative and superlative forms are 'more woolly-butted' and 'most woolly-butted' respectively."},"usage_notes":{"explanation":"'Woolly-butted' is primarily used in informal contexts and often carries a humorous tone. While it can refer literally to an animal with a woolly rear, it's more commonly used figuratively to describe someone who is stubborn or unwilling to change their mind. The term is not considered offensive but is generally avoided in formal settings.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was woolly-butted to go to the party.","correct":"✓ He was woolly-butted and refused to go to the party.","note":"The adjective describes a characteristic, not an action. Use it to describe someone's personality or attitude, not to say they were forced to do something."}],"priority":"★★☆"},"related_words":{"derivatives":["woolly (adjective: covered in wool, vague or unclear)","butt (noun: rear end, stubborn person)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (not commonly found in standard language learning materials)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Woolly-butted' is a slang term, primarily used humorously to describe someone who is stubborn or obstinate. It's not a common word and is unlikely to be encountered in formal writing or speech. The literal meaning, referring to an animal with a woolly rear end, is less common than the figurative meaning. Understanding the humor and informality of the word is key to using it appropriately."},"example_sentences":[{"sentence":"The old farmer was known for being a woolly-butted character.","translation":"その年老いた農夫は、頑固な性格で知られていた。","type":"adjective","meaning_category":"stubborn"},{"sentence":"Despite the evidence, he remained woolly-butted in his belief.","translation":"証拠があるにもかかわらず、彼は自分の信念を頑なに守り続けた。","type":"adjective","meaning_category":"stubborn"},{"sentence":"The woolly-butted lamb frolicked in the spring sunshine.","translation":"毛むくじゃらの尻をした子羊が春の日差しの中で戯れていた。","type":"adjective","meaning_category":"literal"}]}