{"word":"coinherent","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(哲学、神学)相互固有の、相互内在的な、互いに不可分な","english_definition":"Existing mutually or jointly within each other; inseparably connected or inherent.","examples":[{"sentence":"The three persons of the Trinity are coinherent.","translation":"三位一体の三つの位格は相互固有である。"},{"sentence":"Love and compassion are coinherent qualities of a truly virtuous person.","translation":"愛と思いやりは、真に徳のある人の相互固有の性質である。"}],"collocations":["coinherent qualities","coinherent properties","coinherent existence","coinherent attributes"],"synonyms":["interdependent","interwoven","interrelated","intrinsic","inseparable"],"antonyms":["separate","distinct","independent"]}],"etymology":{"value":"Derived from the prefix 'co-' (together) and 'inherent' (existing as a natural or essential part).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkoʊɪnˈhɪərənt/","syllables":"co-in-her-ent"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"'Coinherent' describes qualities, properties, or entities that exist together and are intrinsically linked, such that one cannot exist without the others. It is often used in theological contexts to describe the relationship between the persons of the Trinity, emphasizing their unity and mutual indwelling. It can also be used more broadly to describe any set of qualities or concepts that are deeply interconnected.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The coinherent buildings stood side by side.","correct":"✓ The adjacent buildings stood side by side.","note":"'Coinherent' refers to abstract qualities or entities, not physical objects. Use 'adjacent' or 'neighboring' for buildings. "},{"incorrect":"✗ Their coinherent ideas were completely different.","correct":"✓ Their related ideas were completely different.","note":"'Coinherent' implies a necessary connection; if the ideas are different, they cannot be coinherent. Use 'related' or 'associated' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["coinherence (noun): The state or quality of being coinherent.","inherent (adjective): Existing as a natural or essential part or quality.","inherently (adverb): In an inherent manner."],"phrases":["Circumincession (theological term related to coinherence, describing the mutual interpenetration of the three persons of the Trinity.)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in philosophical and theological texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Coinherent' is a relatively rare and abstract term primarily used in philosophy and theology. It describes the relationship between two or more entities or qualities that are intrinsically linked and mutually dependent, such that they cannot exist separately. Understanding this term requires a strong grasp of abstract concepts and familiarity with philosophical or theological discourse."},"example_sentences":[{"sentence":"The coinherent nature of justice and mercy ensures a balanced approach to ethical decision-making.","translation":"正義と慈悲の相互固有の性質は、倫理的な意思決定へのバランスの取れたアプローチを保証する。","type":"adjective","meaning_category":"相互固有の (qualities)"},{"sentence":"In Trinitarian theology, the Father, Son, and Holy Spirit are understood to be coinherent, sharing the same divine essence.","translation":"三位一体の神学では、父、子、聖霊は相互固有であり、同じ神の性質を共有すると理解されている。","type":"adjective","meaning_category":"相互固有の (theology)"}]}