{"word":"Skaillie","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of traditional Scottish roofing slate, typically thin and irregular in shape.","english_definition":"A thin, irregular roofing slate used in traditional Scottish architecture.","examples":[{"sentence":"The old cottage was roofed with skaillie.","translation":"その古いコテージはスカイリーで屋根が葺かれていた。"},{"sentence":"Skaillie roofs are characteristic of buildings in this region.","translation":"スカイリー屋根はこの地域の建物の特徴である。"}],"collocations":["skaillie roof","skaillie quarry"],"synonyms":["slate","flagstone"],"antonyms":[]}],"etymology":{"value":"Likely derived from a Scottish or Northern English dialect word related to 'scale' or 'shale', referring to the thin, layered nature of the slate.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskæli/","syllables":"skai-lie"},"inflection":{"noun_plural":"skaillies"},"usage_notes":{"explanation":"'Skaillie' is a relatively specialized term, primarily used in the context of Scottish architectural history and building conservation. It refers to a specific type of roofing material and is not in common usage outside of this context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The house had a skaillie of paint.","correct":"✓ The house had a coat of paint.","note":"'Skaillie' refers specifically to roofing slate, not paint."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Skaillie' is a highly specialized term related to traditional Scottish architecture. Understanding this word requires familiarity with regional building practices and materials. It is unlikely to be encountered outside of specific contexts related to Scottish history or architecture."},"example_sentences":[{"sentence":"The conservation project aimed to restore the kirk's skaillie roof to its original condition.","translation":"その保全プロジェクトは教会のスカイリー屋根を元の状態に修復することを目的としていた。","type":"noun","meaning_category":"roofing material"}]}