{"word":"chain-reacting","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"連鎖反応を起こす、連鎖的に反応する","english_definition":"Undergoing or capable of undergoing a chain reaction.","examples":[{"sentence":"The experiment involved a chain-reacting chemical process.","translation":"その実験は連鎖反応を起こす化学プロセスを伴った。"},{"sentence":"A chain-reacting system can quickly become unstable.","translation":"連鎖反応システムはすぐに不安定になる可能性がある。"}],"collocations":["chain-reacting process","chain-reacting system","chain-reacting substance"],"synonyms":["cascading","domino effect","self-propagating"],"antonyms":["stable","inert","non-reactive"]}],"etymology":{"value":"The term is derived from the concept of a chain reaction, where one event triggers a series of subsequent events in a self-sustaining manner.","priority":"N/A"},"pronunciation":{"ipa":"/ˈtʃeɪn.riˈæktɪŋ/","syllables":"chain-re-act-ing"},"inflection":{"notes":"It is the present participle form of the verb \"chain-react\" used as an adjective."},"usage_notes":{"explanation":"\"Chain-reacting\" describes something that initiates or is part of a chain reaction. It is often used in scientific or technical contexts to describe processes that propagate themselves once started.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The chain-reacting event was stopped.","correct":"✓ The chain reaction was stopped.","note":"It's more common to say \"chain reaction\" rather than \"chain-reacting event\"."}],"priority":"N/A"},"related_words":{"derivatives":["chain reaction (名詞: 連鎖反応)","chain-react (動詞: 連鎖反応を起こす)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term \"chain-reacting\" is relatively technical and is used to describe processes that involve a series of events where each event triggers the next, creating a self-sustaining sequence. It's commonly used in scientific and engineering fields, particularly in discussions of nuclear reactions, chemical processes, and sometimes in more abstract systems where one action sets off a series of related actions."},"example_sentences":[{"sentence":"The scientists observed a chain-reacting series of events after introducing the catalyst.","translation":"科学者たちは触媒を導入した後、連鎖反応的な一連の出来事を観察した。","type":"adjective","meaning_category":"連鎖反応を起こす"},{"sentence":"The model simulates a chain-reacting economic collapse.","translation":"そのモデルは連鎖反応的な経済崩壊をシミュレートする。","type":"adjective","meaning_category":"連鎖的に反応する"}]}