{"word":"power-dove","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(政治)穏健派の権力者、平和的な手段を好む権力者","english_definition":"A powerful person who advocates for peaceful solutions and diplomacy rather than aggressive or militaristic approaches.","examples":[{"sentence":"Despite his reputation as a tough negotiator, the senator was seen by many as a power-dove, always seeking compromise.","translation":"タフな交渉者としての評判にもかかわらず、その上院議員は常に妥協を求める平和的な権力者として多くの人に見られていた。"},{"sentence":"The president's appointment of a known power-dove to the position of Secretary of State signaled a shift towards a more diplomatic foreign policy.","translation":"大統領が国務長官の地位に知られている穏健派の権力者を任命したことは、より外交的な外交政策への転換を示唆した。"}],"collocations":["moderate power-dove","influential power-dove","appoint a power-dove","known power-dove"],"synonyms":["moderate","pacifist","diplomat","negotiator","peacemaker"],"antonyms":["hawk","warmonger","militarist"]}],"etymology":{"value":"The term is a blend of 'power' (referring to influence or authority) and 'dove' (a symbol of peace). It suggests someone who holds power but prefers peaceful means.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpaʊərˌdʌv/","syllables":"pow-er-dove"},"inflection":{"noun_plural":"power-doves"},"usage_notes":{"explanation":"The term 'power-dove' is often used in political contexts to describe individuals who hold significant positions of authority but are known for their advocacy of peaceful and diplomatic solutions to conflicts. It is a relatively uncommon term, but useful for describing a specific type of political figure.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a power doveish.","correct":"✓ He is a power-dove.","note":"'Power-dove' is a noun. The adjective form would be something like 'power-dove-like' or 'inclined to be a power-dove' but these are not common usages."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["dove","hawk","realist","idealist","centrist"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'power-dove' is a specialized term used in political discourse. It combines the concepts of 'power' (influence, authority) and 'dove' (peace advocate) to describe someone who holds a position of power but favors diplomatic and peaceful solutions. Understanding this term requires familiarity with political terminology and nuanced understanding of political ideologies."},"example_sentences":[{"sentence":"The new ambassador, a well-known power-dove, is expected to ease tensions between the two nations.","translation":"新任大使は、よく知られた穏健派の権力者であり、両国間の緊張を緩和することが期待されている。","type":"noun","meaning_category":"political figure"},{"sentence":"Analysts are debating whether the president's recent actions indicate a shift from a power-dove stance to a more hawkish approach.","translation":"アナリストたちは、大統領の最近の行動が、穏健派の権力者としての立場から、よりタカ派的なアプローチへの転換を示しているかどうかを議論している。","type":"noun","meaning_category":"political figure"}]}