{"word":"Celo","meanings":[{"part_of_speech":"noun","definition":"A blockchain platform focused on making decentralized financial (DeFi) systems accessible to mobile users.","english_definition":"A blockchain platform focused on making decentralized financial (DeFi) systems accessible to mobile users, particularly those in developing countries.","examples":[{"sentence":"Celo aims to create a financial system that creates the conditions of prosperity for all.","translation":"Celoは、すべての人々の繁栄のための条件を作り出す金融システムの構築を目指しています。"},{"sentence":"The Celo blockchain uses a proof-of-stake consensus mechanism.","translation":"Celoブロックチェーンは、プルーフ・オブ・ステークのコンセンサスメカニズムを使用しています。"}],"collocations":["Celo blockchain","Celo Dollar (cUSD)","Celo Euro (cEUR)","Celo Foundation"],"synonyms":["blockchain platform","DeFi platform"],"antonyms":[]}],"etymology":{"value":"The name 'Celo' is derived from the word 'cielo', which means 'sky' or 'heaven' in Spanish, symbolizing the platform's goal of reaching for the sky in terms of financial inclusion.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtʃeloʊ/","syllables":"Ce-lo"},"inflection":{"noun_plural":"Celos"},"usage_notes":{"explanation":"Celo is often discussed in the context of cryptocurrency, blockchain technology, and decentralized finance (DeFi). It is notable for its focus on mobile accessibility and financial inclusion, particularly in emerging markets. The platform supports stablecoins like cUSD and cEUR, which are designed to maintain a stable value relative to the US dollar and Euro, respectively.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I invested in cello.","correct":"✓ I invested in Celo.","note":"Distinguish between 'Celo' (the blockchain platform) and 'cello' (the musical instrument)."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["blockchain","cryptocurrency","DeFi","stablecoin","cUSD","cEUR","proof-of-stake"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency (specific to the cryptocurrency/blockchain domain)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Celo' refers to a specific blockchain platform. Understanding its meaning requires familiarity with concepts such as blockchain technology, decentralized finance (DeFi), and cryptocurrency. The platform aims to provide financial services accessible via mobile devices, particularly in developing regions. Its stablecoins, like cUSD and cEUR, are designed to minimize price volatility."},"example_sentences":[{"sentence":"Developers are building various DeFi applications on the Celo platform.","translation":"開発者たちはCeloプラットフォーム上で様々なDeFiアプリケーションを構築しています。","type":"noun","meaning_category":"blockchain platform"},{"sentence":"Celo's mission is to build a financial system that creates the conditions for prosperity for everyone.","translation":"Celoの使命は、すべての人々の繁栄のための条件を作り出す金融システムを構築することです。","type":"noun","meaning_category":"blockchain platform"},{"sentence":"You can use Celo Dollars (cUSD) for everyday transactions.","translation":"Celoドル（cUSD）を日常の取引に使用できます。","type":"noun","meaning_category":"cryptocurrency"}]}