{"word":"refectionary","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に修道院や学校の)食堂、食事室","english_definition":"A dining hall, especially in a monastery or college.","examples":[{"sentence":"The monks gathered in the refectionary for their evening meal.","translation":"修道士たちは夕食のために食堂に集まった。"},{"sentence":"The refectionary was a large, echoing room with long wooden tables.","translation":"食堂は、長い木のテーブルが並んだ、音が反響する広い部屋だった。"}],"collocations":["monastery refectionary","college refectionary","large refectionary","small refectionary"],"synonyms":["dining hall","mess hall","canteen","commons"],"antonyms":[]}],"etymology":{"value":"Late Middle English: from late Latin refectorium, from refectus, past participle of reficere ‘restore, refresh’ (see refect).","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈfɛkʃənəri/","syllables":"re-fec-tion-a-ry"},"inflection":{"noun_plural":"refectionaries"},"usage_notes":{"explanation":"'Refectionary' is a somewhat formal or archaic term, primarily used in the context of monasteries, religious orders, boarding schools, or other institutions where communal meals are taken. It specifically refers to the room or hall designated for dining. The more common and general term is 'dining hall'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ We ate in the refection.","correct":"✓ We ate in the refectionary.","note":"'Refection' refers to the act of eating or being refreshed, while 'refectionary' is the actual dining hall."}],"priority":"★★☆"},"related_words":{"derivatives":["refection (noun: the act of eating and drinking; refreshment)","refect (verb: to refresh; to restore)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Refectionary' is a specialized term, primarily encountered in historical or institutional contexts. It denotes a dining hall, particularly within a monastery, boarding school, or similar setting. Due to its limited usage, it is not part of common vocabulary. Understanding the term requires familiarity with institutional or historical terminology."},"example_sentences":[{"sentence":"The students filed into the large, echoing refectionary for lunch.","translation":"学生たちは昼食のために、音が反響する広い食堂に列をなして入った。","type":"noun","meaning_category":"食堂"},{"sentence":"The ancient monastery's refectionary still retained its original stone walls and wooden beams.","translation":"その古代修道院の食堂は、今もなお元の石壁と木の梁を保っていた。","type":"noun","meaning_category":"食堂"}]}