{"word":"pseudo-seizure","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"偽発作、心因性非癲癇性発作","english_definition":"An event that resembles an epileptic seizure but is not caused by abnormal electrical activity in the brain. It is a type of conversion disorder or functional neurological symptom disorder.","examples":[{"sentence":"The patient was diagnosed with pseudo-seizures after EEG monitoring showed no epileptic activity during the events.","translation":"患者は、脳波モニタリングで発作中に癲癇性の活動が見られなかったため、偽発作と診断された。"},{"sentence":"Pseudo-seizures can be difficult to distinguish from true seizures based on observation alone.","translation":"偽発作は、観察だけでは真の発作と区別するのが難しいことがある。"},{"sentence":"Psychotherapy is often a key component of treatment for pseudo-seizures.","translation":"精神療法は、偽発作の治療において重要な要素となることが多い。"}],"collocations":["psychogenic non-epileptic seizures (PNES)","conversion disorder","functional neurological symptom disorder","EEG monitoring","video-EEG monitoring","psychotherapy","behavioral therapy"],"synonyms":["psychogenic non-epileptic seizure (PNES)","functional seizure","dissociative seizure","conversion seizure"],"antonyms":["epileptic seizure","true seizure"]},{"part_of_speech":"adjective","definition":"偽発作性の","english_definition":"Relating to or characterized by pseudo-seizures.","examples":[{"sentence":"The patient exhibited pseudo-seizure activity, but no underlying neurological cause was found.","translation":"患者は偽発作性の活動を示したが、基礎となる神経学的な原因は見つからなかった。"}],"collocations":["pseudo-seizure activity","pseudo-seizure disorder"],"synonyms":["psychogenic","non-epileptic"],"antonyms":["epileptic"]}],"etymology":{"value":"'Pseudo-' comes from the Greek word 'pseudes' meaning false. 'Seizure' refers to a sudden surge of electrical activity in the brain. Therefore, 'pseudo-seizure' literally means 'false seizure'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsuːdoʊˈsiːʒər/","syllables":"pseu-do-sei-zure"},"inflection":{"notes":"Plural: pseudo-seizures"},"usage_notes":{"explanation":"Pseudo-seizures are not caused by abnormal electrical activity in the brain, unlike epileptic seizures. They are considered a type of conversion disorder or functional neurological symptom disorder, where psychological distress manifests as physical symptoms. Diagnosis often involves video-EEG monitoring to rule out epileptic activity. Treatment typically includes psychotherapy and behavioral therapy to address the underlying psychological issues. It is important to note that pseudo-seizures are a real and distressing condition for those who experience them, and should not be dismissed as 'fake' seizures.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor said it was just a pseudo-seizure, so it's not serious.","correct":"✓ The doctor diagnosed pseudo-seizures, which require treatment and support.","note":"Pseudo-seizures are a real condition that requires treatment and support, even though they are not caused by epilepsy. Dismissing them as 'not serious' is inappropriate. "},{"incorrect":"✗ Pseudo-seizures are the same as epileptic seizures.","correct":"✓ Pseudo-seizures are different from epileptic seizures because they are not caused by abnormal electrical activity in the brain.","note":"It is crucial to understand that pseudo-seizures and epileptic seizures have different causes and require different treatment approaches."}],"priority":"★★☆"},"related_words":{"derivatives":["psychogenic non-epileptic seizures (PNES)","conversion disorder","functional neurological symptom disorder"],"phrases":["video-EEG monitoring","psychological distress","behavioral therapy","cognitive behavioral therapy (CBT)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'pseudo-seizure' refers to events that resemble epileptic seizures but are not caused by abnormal electrical activity in the brain. These events are now more commonly referred to as psychogenic non-epileptic seizures (PNES) or functional seizures to better reflect their psychological origin. Understanding this term requires knowledge of medical terminology related to neurology and psychology. It's important to recognize that PNES are a genuine condition requiring appropriate diagnosis and treatment, often involving psychotherapy and behavioral interventions."},"example_sentences":[{"sentence":"During the episode, the patient exhibited behaviors consistent with a pseudo-seizure, including thrashing and unresponsiveness.","translation":"エピソード中、患者は体をよじったり無反応になったりするなど、偽発作に一致する行動を示した。","type":"noun","meaning_category":"偽発作の症状"},{"sentence":"The neurologist ordered a video-EEG to differentiate between epileptic seizures and pseudo-seizures.","translation":"神経科医は、癲癇発作と偽発作を区別するためにビデオ脳波検査を指示した。","type":"noun","meaning_category":"診断"},{"sentence":"Treatment for pseudo-seizures often involves addressing underlying psychological trauma.","translation":"偽発作の治療には、しばしば根底にある心理的トラウマへの対処が含まれる。","type":"noun","meaning_category":"治療"},{"sentence":"It's important to provide support and understanding to individuals experiencing pseudo-seizures.","translation":"偽発作を経験している人に、サポートと理解を提供することが重要だ。","type":"noun","meaning_category":"サポート"}]}