{"word":"Undeterrability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The quality or state of being impossible to deter; the inability to be discouraged or prevented from a course of action.","english_definition":"The quality or state of being impossible to deter; the inability to be discouraged or prevented from a course of action.","examples":[{"sentence":"His undeterrability in pursuing his goals was both admirable and frightening.","translation":"彼の目標追求における不屈の精神は、賞賛に値すると同時に恐ろしいものでもあった。"},{"sentence":"The dictator's undeterrability made diplomatic solutions nearly impossible.","translation":"独裁者の不屈の精神が、外交的な解決をほぼ不可能にした。"}],"collocations":["demonstrate undeterrability","admire undeterrability","lack undeterrability"],"synonyms":["resoluteness","determination","persistence","tenacity","inflexibility","obstinacy"],"antonyms":["deterrability","discouragement","persuadability","flexibility"]}],"etymology":{"value":"Formed from \"undeter\" (prefix meaning not), \"deter\" (to discourage or restrain from acting), \"-ability\" (suffix denoting capacity or quality).","priority":"★★★"},"pronunciation":{"ipa":"ˌʌndɪˌtɜːrəˈbɪləti","syllables":"Un-de-ter-ra-bil-i-ty"},"inflection":{"noun_plural":"Undeterrabilities"},"usage_notes":{"explanation":"'Undeterrability' is a relatively uncommon noun, often used in formal or academic contexts to describe a strong, unwavering commitment to a particular course of action, even in the face of opposition or difficulty. It often carries a negative connotation, implying inflexibility or stubbornness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The undeterrability of the weather prevented our trip.","correct":"✓ The inclement weather deterred our trip.","note":"'Undeterrability' describes a quality of a person or entity, not a condition that prevents something else. Use 'deterred' to describe the weather's effect."},{"incorrect":"✗ He showed great undeterrability during the negotiation.","correct":"✓ He showed great determination during the negotiation.","note":"In many contexts, 'determination' is a more common and natural-sounding synonym for 'undeterrability'."}],"priority":"★★☆"},"related_words":{"derivatives":["undeterred (adjective)","deter (verb)","deterrent (noun)","deterrence (noun)"],"phrases":["show undeterrability","unwavering undeterrability"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Undeterrability' is a complex and uncommon word. It describes the quality of someone or something being impossible to discourage or prevent from a course of action. It's often used in formal writing or discussions about politics, strategy, or psychology. Because it's not a commonly used word, it's important to be clear about its meaning when you use it."},"example_sentences":[{"sentence":"The general's undeterrability was both his greatest strength and his ultimate downfall.","translation":"将軍の不屈の精神は、彼の最大の強みであり、最終的な没落の原因でもあった。","type":"general"},{"sentence":"The activist's undeterrability inspired many to join the cause.","translation":"活動家の不屈の精神は、多くの人々に運動への参加を促した。","type":"general"}]}