{"word":"hypocotyledonary","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"子葉下生の、子葉下軸の","english_definition":"Relating to or having hypocotyl germination, where the hypocotyl elongates and forms the apical hook, pulling the cotyledons (seed leaves) out of the soil.","examples":[{"sentence":"Hypocotyledonary germination is common in beans and sunflowers.","translation":"子葉下生の発芽は、豆やヒマワリによく見られます。"}],"collocations":["hypocotyledonary germination"],"synonyms":["epigeal"],"antonyms":["epicotyledonary","hypogeal"]}],"etymology":{"value":"From 'hypocotyl' (the part of a plant embryo directly below the cotyledons, forming the primary root) + '-ary' (relating to).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpoʊˌkɒtɪˈliːdəneri/","syllables":"hy-po-cot-y-le-don-a-ry"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"The term 'hypocotyledonary' describes a type of germination in plants. During hypocotyledonary germination, the hypocotyl (the stem of the germinating seedling below the cotyledons) elongates, forming a hook that pulls the cotyledons out of the soil. This contrasts with epicotyledonary or hypogeal germination, where the cotyledons remain underground.","priority":"★★☆"},"related_words":{"derivatives":["hypocotyl","cotyledon"],"related_terms":["epicotyledonary","epigeal","hypogeal"]},"level_frequency":{"frequency_google_ngram":"Low frequency. Specialized botanical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hypocotyledonary' is a technical term used in botany to describe a specific type of plant germination. It refers to the process where the hypocotyl (the embryonic axis below the cotyledons) elongates and lifts the cotyledons above the soil surface. Understanding this term requires familiarity with basic botanical concepts and plant anatomy."},"example_sentences":[{"sentence":"The bean plant exhibits hypocotyledonary emergence, with the cotyledons being pulled above ground by the elongating hypocotyl.","translation":"豆の植物は子葉下生の発芽を示し、伸びる子葉下軸によって子葉が地上に引き上げられる。","type":"adjective","meaning_category":"子葉下生の"}]}