{"word":"peritonitis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"腹膜炎","english_definition":"inflammation of the peritoneum, the membrane lining the abdominal cavity and covering the abdominal organs.","examples":[{"sentence":"Peritonitis is a serious condition that requires immediate medical attention.","translation":"腹膜炎は、直ちに医療措置を必要とする重篤な状態です。"},{"sentence":"Symptoms of peritonitis include severe abdominal pain, fever, and nausea.","translation":"腹膜炎の症状には、激しい腹痛、発熱、吐き気などがあります。"},{"sentence":"Untreated peritonitis can lead to sepsis and death.","translation":"未治療の腹膜炎は、敗血症や死亡につながる可能性があります。"}],"collocations":["bacterial peritonitis (細菌性腹膜炎)","septic peritonitis (化膿性腹膜炎)","acute peritonitis (急性腹膜炎)","generalized peritonitis (汎発性腹膜炎)","localized peritonitis (限局性腹膜炎)","peritonitis symptoms (腹膜炎の症状)","peritonitis treatment (腹膜炎の治療)","develop peritonitis (腹膜炎を発症する)"],"synonyms":["abdominal inflammation","inflammation of the peritoneum"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'peri' (around) + 'teinein' (to stretch) + '-itis' (inflammation). Literally, 'inflammation around the stretched membrane'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɛrɪtəˈnaɪtɪs/","syllables":"per-i-to-ni-tis"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Peritonitis is a medical condition characterized by inflammation of the peritoneum, the serous membrane lining the abdominal cavity and covering its organs. It is typically caused by bacterial or fungal infection, often resulting from a ruptured appendix, perforated ulcer, or other abdominal injury or surgery. Peritonitis is a serious and potentially life-threatening condition that requires prompt diagnosis and treatment, usually involving antibiotics and sometimes surgery to address the underlying cause.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He had peritonitis in his chest.","correct":"✓ He had peritonitis in his abdomen.","note":"Peritonitis specifically affects the peritoneum in the abdominal cavity, not the chest."},{"incorrect":"✗ Peritonitis is not a serious condition.","correct":"✓ Peritonitis is a serious condition.","note":"Peritonitis is a potentially life-threatening condition requiring immediate medical attention."}],"priority":"★★☆"},"related_words":{"derivatives":["peritoneal (adjective: relating to the peritoneum)","peritoneum (noun: the membrane lining the abdominal cavity)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively low frequency. Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Peritonitis' is a medical term referring to the inflammation of the peritoneum, the membrane lining the abdominal cavity. It is a serious condition typically caused by infection and requires immediate medical attention. Understanding this term is important in medical contexts, but it is not commonly used in everyday language."},"example_sentences":[{"sentence":"The patient was diagnosed with peritonitis after experiencing severe abdominal pain.","translation":"患者は、激しい腹痛を訴えた後、腹膜炎と診断されました。","type":"general","meaning_category":"diagnosis"},{"sentence":"Prompt treatment of peritonitis is essential to prevent complications.","translation":"合併症を防ぐためには、腹膜炎の迅速な治療が不可欠です。","type":"general","meaning_category":"treatment"},{"sentence":"A ruptured appendix can lead to peritonitis if not treated promptly.","translation":"虫垂破裂は、迅速に治療しないと腹膜炎につながる可能性があります。","type":"cause","meaning_category":"cause"}]}