{"word":"Parabomb","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of aerial bomb equipped with a parachute to slow its descent, allowing the delivering aircraft to escape the blast radius or to increase accuracy in certain situations.","english_definition":"An aerial bomb equipped with a parachute to slow its descent.","examples":[{"sentence":"The planes dropped parabombs over the target area.","translation":"飛行機は目標地域にパラボムを投下した。"},{"sentence":"Parabombs were used to destroy bridges and other infrastructure.","translation":"パラボムは橋や他のインフラを破壊するために使用された。"}],"collocations":["drop parabombs","use parabombs","parabomb attack"],"synonyms":["retarded bomb","delayed-action bomb"],"antonyms":[]}],"etymology":{"value":"A combination of \"parachute\" and \"bomb\".","priority":"★★★"},"pronunciation":{"ipa":"/ˈpærəbɒm/","syllables":"pa-ra-bomb"},"inflection":{"noun_plural":"parabombs"},"usage_notes":{"explanation":"Parabombs are designed to allow the aircraft delivering them to escape the blast radius. They are also used in situations where greater accuracy is needed, as the parachute stabilizes the bomb's descent.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bomb had a pair of bombs.","correct":"✓ The bomb was a parabomb.","note":"\"Pair of bombs\" refers to two separate bombs, while \"parabomb\" is a single bomb with a parachute."}],"priority":"★★☆"},"related_words":{"derivatives":["parachute","bomb"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"parabomb\" is a specialized term related to military technology. It is not commonly used in everyday language. Understanding requires knowledge of military terminology and aerial weaponry.","priority":"★★☆"},"example_sentences":[{"sentence":"The pilot deployed the parabomb to ensure the safety of the aircraft.","translation":"パイロットは航空機の安全を確保するためにパラボムを展開した。","type":"noun","meaning_category":"aerial bomb"},{"sentence":"The use of parabombs allowed for more precise targeting in the urban environment.","translation":"パラボムの使用により、都市環境でのより正確なターゲティングが可能になった。","type":"noun","meaning_category":"aerial bomb"}]}