{"word":"unappreciatively","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"感謝せずに、ありがたみを知らずに、無頓着に","english_definition":"in a manner that shows a lack of gratitude or appreciation.","examples":[{"sentence":"He took the gift unappreciatively, barely glancing at it.","translation":"彼はその贈り物をありがたみも知らずに受け取り、ほとんど見ようともしなかった。"},{"sentence":"She responded unappreciatively to their efforts, complaining about the minor flaws.","translation":"彼女は彼らの努力に感謝することなく、些細な欠点について文句を言った。"},{"sentence":"The team felt unappreciatively treated by management.","translation":"チームは経営陣から感謝されていないと感じた。"}],"collocations":["respond unappreciatively","behave unappreciatively","treat someone unappreciatively","look at something unappreciatively"],"synonyms":["ungratefully","thanklessly","callously","disdainfully","indifferently"],"antonyms":["appreciatively","gratefully","thankfully"]}],"etymology":{"value":"The word is formed by adding the prefix 'un-' (meaning 'not') and the suffix '-ly' (forming an adverb) to the word 'appreciative'. 'Appreciative' comes from 'appreciate', which is derived from the Latin 'appretiare' meaning 'to set a price on, value'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnəˈpriːʃətɪvli/","syllables":"un-ap-pre-cia-tive-ly"},"inflection":{"notes":"This is an adverb, so it does not have different forms for gender or number."},"usage_notes":{"explanation":"'Unappreciatively' describes an action or behavior that demonstrates a lack of gratitude or recognition for something done or given. It suggests a negative or indifferent attitude towards the kindness, effort, or value provided by others. It is often used to criticize or describe someone's poor manners or lack of awareness.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He unappreciatively the gift.","correct":"✓ He accepted the gift unappreciatively.","note":"'Unappreciatively' is an adverb and modifies a verb. It cannot be used as a verb itself. You need to use a verb like 'accepted', 'responded', or 'behaved' to describe the action. "},{"incorrect":"✗ She was unappreciatively.","correct":"✓ She behaved unappreciatively.","note":"'Unappreciatively' is an adverb, so it cannot describe a person directly. You need to use a verb to describe how the person is acting."}],"priority":"★★☆"},"related_words":{"derivatives":["unappreciative (adjective)","appreciative (adjective)","appreciate (verb)","appreciation (noun)"],"phrasal_verbs":[],"related_concepts":["ingratitude","disrespect","callousness","indifference"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Not commonly used in everyday conversation.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unappreciatively' is an adverb that describes how someone does something without showing gratitude or thankfulness. It's not a very common word, and it's used in more formal or descriptive contexts. If someone takes a gift 'unappreciatively', it means they took it without showing any thanks or happiness about receiving it. It's a more complex way of saying someone is ungrateful or not thankful."},"example_sentences":[{"sentence":"The spoiled child unwrapped the presents unappreciatively, tossing aside the wrapping paper with disdain.","translation":"甘やかされた子供はプレゼントを感謝もせずに開け、包装紙を軽蔑するように投げ捨てた。","type":"adverb","meaning_category":"lack of gratitude"},{"sentence":"She listened unappreciatively to the advice, clearly not valuing their experience.","translation":"彼女はアドバイスをありがたみも知らずに聞き、彼らの経験を明らかに評価していなかった。","type":"adverb","meaning_category":"lack of appreciation"},{"sentence":"He stared unappreciatively at the gourmet meal, complaining that it wasn't what he wanted.","translation":"彼はグルメ料理を感謝せずに見つめ、自分が欲しいものではないと文句を言った。","type":"adverb","meaning_category":"indifference"}]}