{"word":"simple-legged","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"Having simple legs; often used in entomology to describe insects with legs that are not modified for specialized functions like jumping or digging.","english_definition":"Describing an organism, typically an insect, with legs that are not highly specialized or modified for specific functions.","examples":[{"sentence":"The beetle was described as simple-legged, indicating its legs were primarily for walking.","translation":"その甲虫は単純な脚を持つと記述されており、その脚が主に歩行用であることを示していた。"},{"sentence":"Unlike grasshoppers with their jumping legs, this insect is simple-legged.","translation":"跳躍脚を持つバッタとは異なり、この昆虫は単純な脚を持つ。"}],"collocations":["simple-legged insect","simple-legged beetle","simple-legged fly"],"synonyms":["unspecialized-legged","non-adapted-legged"],"antonyms":["specialized-legged","adapted-legged"]},{"part_of_speech":"adjective","definition":"(Figurative) Lacking complexity or sophistication in movement or design of the legs.","english_definition":"(Figurative) Lacking complexity or sophistication in the movement or design related to the legs.","examples":[{"sentence":"The robot's simple-legged design made it stable but slow.","translation":"そのロボットの単純な脚の設計は安定性を高めたが、速度は遅かった。"},{"sentence":"The dancer's routine, while elegant, was simple-legged compared to more acrobatic performances.","translation":"そのダンサーのルーチンは優雅ではあったが、よりアクロバティックなパフォーマンスと比較すると、脚の動きは単純だった。"}],"collocations":["simple-legged robot","simple-legged design","simple-legged movement"],"synonyms":["basic-legged","unsophisticated-legged"],"antonyms":["complex-legged","sophisticated-legged"]}],"etymology":{"value":"Compound word formed by combining 'simple' and 'legged'.","priority":"Medium"},"pronunciation":{"ipa":"/ˈsɪmpəlˌlɛɡɪd/","syllables":"sim-ple-leg-ged"},"inflection":{"notes":"Adjective; does not inflect further."},"usage_notes":{"explanation":"The term 'simple-legged' is primarily used in scientific or technical contexts, particularly in entomology. It describes insects or other organisms whose legs are not highly modified for specific purposes. In a figurative sense, it can describe designs or movements that lack complexity.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"The simple legged animal moved quickly.","correct":"The simple-legged animal moved quickly.","note":"Hyphen is required to combine simple and legged into a compound adjective."}],"priority":"Low"},"related_words":{"derivatives":[],"related_terms":["leg","simple","legged"],"priority":"Low"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low","priority":"Low"},"readability_explanation":{"level":"C1","text":"The term 'simple-legged' is a technical term primarily used in the field of entomology or robotics. It describes legs that are not specialized for particular functions. Due to its specific usage, it is not commonly encountered in general language. Understanding requires familiarity with technical vocabulary."},"example_sentences":[{"sentence":"The taxonomist noted that the specimen was a simple-legged species of ant.","translation":"分類学者は、その標本が単純な脚を持つアリの一種であると指摘した。","type":"adjective","meaning_category":"Entomology"},{"sentence":"The engineer designed a simple-legged walking mechanism for the prototype robot.","translation":"エンジニアは、試作ロボットのために単純な脚を持つ歩行機構を設計した。","type":"adjective","meaning_category":"Robotics"}]}