{"word":"oxyanthracene","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A derivative of anthracene in which one or more oxygen atoms are directly attached to the anthracene ring system.","english_definition":"A chemical compound derived from anthracene, characterized by the direct attachment of one or more oxygen atoms to the anthracene ring structure.","examples":[{"sentence":"Oxyanthracene compounds are often fluorescent.","translation":"オキシアントラセン化合物は蛍光性を示すことが多い。"},{"sentence":"The synthesis of oxyanthracene derivatives is an area of active research.","translation":"オキシアントラセン誘導体の合成は活発な研究分野である。"}],"collocations":["oxyanthracene derivative","substituted oxyanthracene","synthesis of oxyanthracene"],"synonyms":["hydroxyanthracene","anthraquinone","anthrone"],"antonyms":[]}],"etymology":{"value":"Derived from 'oxy-' (referring to oxygen), 'anthrac-' (from anthracene), and '-ene' (indicating an unsaturated hydrocarbon or derivative).","priority":"N/A"},"pronunciation":{"ipa":"/ˌɒksiˈænθrəsiːn/","syllables":"ox-y-an-thra-cene"},"inflection":{"noun_plural":"oxyanthracenes"},"usage_notes":{"explanation":"Oxyanthracenes are a class of organic compounds that are structurally related to anthracene, but with oxygen atoms directly bonded to the anthracene ring system. These compounds can exhibit a range of interesting properties, including fluorescence and redox activity, making them useful in various applications such as dyes, pigments, and organic electronics. Common examples include anthraquinone and anthrone.","priority":"N/A"},"common_mistakes":{},"related_words":{"derivatives":["anthracene","anthraquinone","anthrone","hydroxyanthracene"],"related_compounds":["dyes","pigments","organic semiconductors"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - specialized chemical term.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"Oxyanthracene refers to a specific class of organic compounds derived from anthracene with oxygen atoms directly attached to the ring structure. Understanding this term requires a background in organic chemistry, particularly knowledge of polycyclic aromatic hydrocarbons and functional group nomenclature. Oxyanthracenes are often discussed in the context of dyes, pigments, and organic electronics due to their unique chemical properties.","priority":"N/A"},"example_sentences":[{"sentence":"The fluorescence of oxyanthracene derivatives is highly sensitive to the surrounding environment.","translation":"オキシアントラセン誘導体の蛍光は周囲の環境に非常に敏感である。","type":"noun","meaning_category":"chemical compound"},{"sentence":"Researchers are exploring the use of oxyanthracene-based materials in organic solar cells.","translation":"研究者たちは有機太陽電池におけるオキシアントラセンベースの材料の使用を研究している。","type":"noun","meaning_category":"chemical compound"}]}