{"word":"promythic","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"物語の冒頭に置かれる教訓的な物語、特に寓話に関連する、またはそれを含む","english_definition":"Of or relating to a promyth, a didactic narrative placed at the beginning of a story, especially a fable.","examples":[{"sentence":"The promythic section of the fable clearly outlined the moral lesson to be learned.","translation":"その寓話のプロミュート部分では、学ぶべき教訓が明確に概説されていました。"},{"sentence":"The author used a promythic introduction to set the stage for the main narrative.","translation":"著者は、プロミュート的な導入部を使用して、主要な物語の舞台を設定しました。"}],"collocations":["promythic introduction","promythic element","promythic narrative","promythic fable"],"synonyms":["introductory","preliminary","didactic","moralizing"],"antonyms":["epimythic","concluding"]},{"part_of_speech":"adjective","definition":"物語の導入部として機能する","english_definition":"Serving as an introduction to a story.","examples":[{"sentence":"The promythic scene established the themes that would be explored later in the novel.","translation":"プロミュート的なシーンは、小説の後半で探求されるテーマを確立しました。"}],"collocations":["promythic scene","promythic function"],"synonyms":["preliminary","introductory","preparatory"],"antonyms":["concluding","final"]}],"etymology":{"value":"Derived from 'pro-' (before) + 'mythic' (relating to myth).","priority":"★★☆"},"pronunciation":{"ipa":"/proʊˈmɪθɪk/","syllables":"pro-myth-ic"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than comparative/superlative forms, which are not common for this word."},"usage_notes":{"explanation":"'Promythic' is a relatively rare term, primarily used in literary analysis to describe a narrative element that precedes the main story and often conveys a moral or didactic message. It is most commonly associated with fables. The opposite of 'promythic' is 'epimythic,' which refers to a moralizing narrative placed at the end of a story.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The story was promythic throughout.","correct":"✓ The story had a promythic introduction.","note":"'Promythic' describes a specific part of a story, not the entire story."}],"priority":"★★☆"},"related_words":{"derivatives":["promyth (noun): A didactic narrative placed at the beginning of a story, especially a fable.","epimythic (adjective): Relating to an epimyth, a didactic narrative placed at the end of a story.","myth (noun): A traditional story, especially one concerning the early history of a people or explaining some natural or social phenomenon, and typically involving supernatural beings or events."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Promythic' is a specialized literary term used to describe an introductory narrative, often containing a moral lesson, that appears at the beginning of a story, particularly a fable. Understanding this term requires familiarity with literary analysis and the structure of classical fables."},"example_sentences":[{"sentence":"The *promythic* tale served as a cautionary introduction to the main events of the epic poem.","translation":"プロミュート的な物語は、叙事詩の主要な出来事への注意を促す導入として機能しました。","type":"adjective","meaning_category":"Introductory narrative"},{"sentence":"The *promythic* element in Aesop's fables often highlighted the consequences of certain actions.","translation":"イソップ寓話のプロミュート的な要素は、特定の行動の結果を強調することがよくありました。","type":"adjective","meaning_category":"Didactic narrative"}]}