{"word":"undefrauded","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"不正行為を受けていない、詐欺に遭っていない","english_definition":"Not having been defrauded; not having been cheated or swindled.","examples":[{"sentence":"The company prides itself on ensuring that its customers remain undefrauded.","translation":"その会社は、顧客が詐欺に遭わないようにすることを誇りとしています。"},{"sentence":"He emerged from the business deal undefrauded, thanks to his careful planning.","translation":"彼は注意深い計画のおかげで、その取引から詐欺に遭わずに済んだ。"}],"collocations":["remain undefrauded","emerge undefrauded","ensure someone is undefrauded"],"synonyms":["uncheated","unswindled","unscammed","unduped"],"antonyms":["defrauded","cheated","swindled","scammed","duped"]}],"etymology":{"value":"'Undefrauded' is formed by adding the prefix 'un-' (meaning 'not') to the past participle 'defrauded' of the verb 'defraud'. 'Defraud' comes from the Latin 'de-' (meaning 'away, from') and 'fraus' (meaning 'fraud, deceit').","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌʌndɪˈfrɔːdɪd/","syllables":"un-de-frau-ded"},"inflection":{"notes":"This is an adjective. It does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Undefrauded' is a relatively uncommon word, primarily used in formal or legal contexts. It emphasizes the state of not having been subjected to fraudulent or deceptive practices. It is often used to assure or describe situations where measures have been taken to prevent fraud.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The undefrauded customer was very happy.","correct":"✓ The customer, undefrauded, was very happy.","note":"When used as a postpositive adjective, it should be set off by commas."},{"incorrect":"✗ He undefrauded the bank.","correct":"✓ He did not defraud the bank. / ✓ He remained undefrauded by the bank.","note":"'Undefrauded' is a passive state, meaning someone has not been defrauded. It is not an active verb."}],"priority":"★☆☆"},"related_words":{"derivatives":["defraud (verb): to cheat or swindle someone","defrauding (verb - present participle): the act of cheating or swindling someone","defrauder (noun): someone who defrauds","fraud (noun): wrongful or criminal deception intended to result in financial or personal gain","fraudulent (adjective): obtained, done by, or involving deception, especially criminal deception"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Undefrauded' is a relatively rare and formal word that means 'not having been cheated or swindled'. It is typically used in legal or business contexts to describe a situation where someone has avoided being a victim of fraud. Understanding this word requires familiarity with the base word 'defraud' and the negative prefix 'un-'. Due to its infrequent use, it is more likely to be encountered in written texts than in spoken conversation."},"example_sentences":[{"sentence":"The audit confirmed that all investors remained undefrauded throughout the investment period.","translation":"監査により、投資期間中、すべての投資家が詐欺に遭わなかったことが確認されました。","type":"adjective","meaning_category":"Not having been defrauded"},{"sentence":"The company's robust security measures ensured that its customers were undefrauded by online scams.","translation":"その会社の堅牢なセキュリティ対策により、顧客はオンライン詐欺に遭わずに済みました。","type":"adjective","meaning_category":"Not having been defrauded"}]}