{"word":"reallegation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"再主張、再主張された内容","english_definition":"A renewed or repeated allegation.","examples":[{"sentence":"The document contained a reallegation of the previous accusations.","translation":"その文書には、以前の告発の再主張が含まれていた。"},{"sentence":"The defendant's lawyer dismissed the plaintiff's reallegation as baseless.","translation":"被告の弁護士は、原告の再主張を根拠がないとして退けた。"}],"collocations":["reallegation of facts","reallegation of claims","dismiss a reallegation"],"synonyms":["reassertion","reaffirmation","renewal","repetition"],"antonyms":["retraction","denial","disavowal"]}],"etymology":{"value":"The word is formed by adding the prefix 're-' (meaning again) to 'allegation' (a claim or assertion that someone has done something illegal or wrong, typically one made without proof).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˌæləˈɡeɪʃən/","syllables":"re-al-le-ga-tion"},"inflection":{"noun_plural":"reallegations"},"usage_notes":{"explanation":"'Reallegation' is used in legal and formal contexts to indicate that an allegation, often of wrongdoing, is being repeated or reasserted. It often implies that the allegation has been previously made but is being brought up again, possibly in a new context or with additional information.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The reallegation was proved.","correct":"✓ The original allegation was proved.","note":"'Reallegation' refers to the act of repeating an allegation, not the original allegation itself. If you want to say that the allegation was proven, refer to the 'original allegation'."},{"incorrect":"✗ He made a reallegation about his feelings.","correct":"✓ He reiterated his feelings.","note":"'Reallegation' is typically used in formal or legal contexts, particularly when referring to accusations of wrongdoing. For repeating feelings or opinions, use 'reiterated' or 'reaffirmed'."}],"priority":"★★☆"},"related_words":{"derivatives":["re-allege (verb)"],"phrasal_verbs":[],"related_terms":["allegation","allege","reiterate","reaffirm","reassert"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Reallegation' is a formal term, primarily used in legal or official contexts. It signifies the act of repeating an allegation, which is a statement or claim, typically without proof, that someone has done something wrong or illegal. The word is constructed by adding 're-' to 'allegation,' indicating the repeated nature of the claim. Understanding this term requires familiarity with legal vocabulary and formal language. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The lawsuit contained a reallegation of fraud against the company's executives.","translation":"その訴訟には、会社の幹部に対する詐欺の再主張が含まれていた。","type":"general","meaning_category":"repetition of claim"},{"sentence":"The judge dismissed the reallegation due to lack of new evidence.","translation":"裁判官は、新たな証拠がないため、その再主張を却下した。","type":"legal","meaning_category":"legal context"}]}