{"word":"semiannealed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(金属などが)部分的に焼きなましされた","english_definition":"Partially annealed; having undergone a partial annealing process.","examples":[{"sentence":"The semiannealed copper wire was easier to bend than the fully hardened wire.","translation":"部分的に焼きなましされた銅線は、完全に硬化された線よりも曲げやすかった。"},{"sentence":"Semiannealed steel sheets are often used in applications where some ductility is required but full softness is not necessary.","translation":"部分的に焼きなましされた鋼板は、ある程度の延性が要求されるが、完全な柔らかさが不要な用途でよく使用される。"}],"collocations":["semiannealed copper","semiannealed steel","semiannealed metal"],"synonyms":["partially annealed"],"antonyms":["fully annealed","hardened"]}],"etymology":{"value":"The word 'semiannealed' is formed by combining the prefix 'semi-' (meaning 'partially' or 'half') with the word 'annealed' (meaning 'subjected to annealing').","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɛmiəˈniːld/","syllables":"se-mi-an-nealed"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Semiannealed' describes a material, typically metal, that has undergone an annealing process, but not to the full extent. Annealing involves heating a material to a specific temperature and then allowing it to cool slowly, which reduces its hardness and increases its ductility. A semiannealed material will have properties that are intermediate between those of a fully annealed material and a hardened material.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The metal was semi-anneal.","correct":"✓ The metal was semiannealed.","note":"'Semiannealed' is the correct adjective form. 'Semi-anneal' is not a standard term."}],"priority":"★★★"},"related_words":{"derivatives":["anneal","annealing"],"related_terms":["work hardening","heat treatment","ductility","malleability"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. This term is primarily used in technical or engineering contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'semiannealed' is a technical term used in materials science and engineering. It refers to a material, usually a metal, that has been partially annealed. Annealing is a heat treatment process that alters the physical and sometimes chemical properties of a material to increase its ductility and reduce its hardness. 'Semiannealed' indicates that the annealing process was not completed fully, resulting in a material with properties somewhere between a fully annealed and a hardened state. This term is most likely to be encountered in technical documentation or discussions related to metalworking and materials processing."},"example_sentences":[{"sentence":"The manufacturer chose semiannealed aluminum for its balance of strength and formability.","translation":"製造業者は、強度と成形性のバランスを考慮して、部分的に焼きなましされたアルミニウムを選択した。","type":"descriptive","meaning_category":"Material Properties"},{"sentence":"The semiannealed condition of the wire made it suitable for cold forming operations.","translation":"ワイヤーの部分的な焼きなまし状態は、冷間成形作業に適していた。","type":"technical","meaning_category":"Manufacturing Process"}]}