{"word":"small-feed","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(農業)少量給餌、小分け給餌","english_definition":"A method of feeding livestock or other animals with small, frequent meals rather than large, infrequent ones.","examples":[{"sentence":"The small-feed system improved the growth rate of the piglets.","translation":"少量給餌システムは子豚の成長率を改善した。"},{"sentence":"Small-feed is often used for animals with sensitive digestive systems.","translation":"少量給餌は、消化器系が敏感な動物によく使用される。"}],"collocations":["small-feed system","small-feed method","implement small-feed","benefit from small-feed"],"synonyms":["frequent feeding","portion feeding","controlled feeding"],"antonyms":["bulk feeding","ad libitum feeding","free-range feeding"]}],"etymology":{"value":"Compound word formed from 'small' and 'feed', indicating the provision of feed in small quantities.","priority":"N/A"},"pronunciation":{"ipa":"/smɔːl fiːd/","syllables":"small-feed"},"inflection":{"noun_plural":"small-feeds"},"usage_notes":{"explanation":"'Small-feed' is a technical term primarily used in agriculture and animal husbandry. It refers to a specific feeding strategy that involves providing animals with smaller portions of food at more frequent intervals. This can be beneficial for various reasons, such as improving digestion, reducing waste, and promoting more consistent growth.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ We use small feed for our cows.","correct":"✓ We use small-feed for our cows.","note":"'Small-feed' is a single term, so it should be hyphenated. Alternatively, you could say 'We use small portions of feed for our cows'."}],"priority":"N/A"},"related_words":{"derivatives":["feed","feeding","small","portion","ration"],"phrasal_verbs":[],"related_terms":["animal husbandry","livestock management","feeding strategy","nutrition","digestion"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily a technical term.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Small-feed' is a specialized term used in the context of animal care and agriculture. It describes the practice of giving animals smaller amounts of food more often, rather than large meals less frequently. Understanding this term requires some familiarity with animal feeding practices and related vocabulary. It is not commonly used in general conversation."},"example_sentences":[{"sentence":"The farmer adopted a small-feed approach to minimize food waste.","translation":"その農家は、食品廃棄物を最小限に抑えるために少量給餌のアプローチを採用した。","type":"noun","meaning_category":"少量給餌"},{"sentence":"Small-feed can help prevent digestive problems in young animals.","translation":"少量給餌は、若い動物の消化器系の問題を予防するのに役立つ。","type":"noun","meaning_category":"少量給餌"}]}