{"word":"self-danger","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自己の危険、自身に対する危険","english_definition":"The state or condition of being a danger to oneself; behavior or circumstances that pose a risk of harm to one's own well-being or safety.","examples":[{"sentence":"His erratic behavior indicated a state of self-danger, requiring immediate intervention.","translation":"彼の不安定な行動は自己の危険な状態を示しており、直ちに介入が必要だった。"},{"sentence":"The therapist assessed the patient's level of self-danger to determine the appropriate course of treatment.","translation":"セラピストは、適切な治療方針を決定するために、患者の自己に対する危険のレベルを評価した。"},{"sentence":"The hotline is available for individuals experiencing thoughts of self-harm and self-danger.","translation":"このホットラインは、自傷行為や自己の危険な状態を経験している個人が利用できます。"}],"collocations":["risk of self-danger (自己の危険のリスク)","level of self-danger (自己の危険のレベル)","state of self-danger (自己の危険な状態)","assess self-danger (自己の危険を評価する)","prevent self-danger (自己の危険を防ぐ)"],"synonyms":["self-harm","self-destructive behavior","suicidal ideation","risk to self","endangering oneself"],"antonyms":["self-preservation","self-care","safety","well-being","protection"],"notes":"Often used in a clinical or medical context to describe a person's potential to harm themselves, either intentionally or unintentionally."}],"etymology":{"value":"A compound word formed from 'self' (referring to oneself) and 'danger' (the possibility of suffering harm or injury). The term describes a situation where the danger originates from within the individual or is directed towards the individual themselves.","priority":"★★★"},"pronunciation":{"ipa":"/ˌself ˈdeɪn.dʒər/","syllables":"self-dan-ger"},"inflection":{"noun_plural":"self-dangers"},"usage_notes":{"explanation":"'Self-danger' is a term used to describe situations where an individual's behavior, thoughts, or circumstances pose a risk to their own safety, health, or well-being. It is often used in medical, psychological, and social work contexts to assess the potential for self-harm, suicidal ideation, or other behaviors that could lead to negative outcomes for the individual. The term emphasizes that the source of the danger is internal or directed towards the self, rather than coming from external sources.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was in self danger.","correct":"✓ He was in a state of self-danger.","note":"It's more common to use 'self-danger' with a descriptive phrase like 'state of' or 'risk of' to provide context. Using it alone can sound awkward. Alternatively, use 'He was a danger to himself.'"},{"incorrect":"✗ The child showed self-danger behaviors.","correct":"✓ The child showed self-endangering behaviors.","note":"While 'self-danger behaviors' is understandable, 'self-endangering behaviors' is more grammatically correct and commonly used to describe actions that put oneself at risk."}],"priority":"★★☆"},"related_words":{"derivatives":["self-endangering (adjective: 自身を危険にさらす)","self-harm (noun: 自傷行為)","suicide (noun: 自殺)","self-destructive (adjective: 自己破壊的な)"],"phrases":["at risk of self-harm","suicidal ideation","mental health crisis","psychiatric emergency"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency - Primarily used in specialized contexts (medical, psychological).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'self-danger' is relatively specialized and is most often encountered in professional or clinical settings related to mental health, social work, or medicine. It describes situations where a person's own actions, thoughts, or circumstances present a risk to their own safety or well-being. Understanding this term requires a familiarity with concepts related to risk assessment, mental health, and self-harm. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The social worker was concerned about the teenager's increasing risk of self-danger.","translation":"ソーシャルワーカーは、その10代の若者の自己の危険のリスクが高まっていることを懸念していた。","type":"general"},{"sentence":"The hospital has protocols in place to manage patients who are assessed as being in a state of self-danger.","translation":"病院には、自己の危険な状態にあると評価された患者を管理するためのプロトコルが整備されている。","type":"medical"},{"sentence":"The psychologist explored the underlying causes of the patient's self-danger during the therapy sessions.","translation":"心理学者は、セラピーセッション中に患者の自己の危険の根本的な原因を探った。","type":"psychological"}]}