{"word":"classical-influenced","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"古典の影響を受けた、古典に影響された","english_definition":"Influenced by or characteristic of classical art, music, literature, or culture, especially that of ancient Greece and Rome.","examples":[{"sentence":"The building's design is classical-influenced, with columns and a symmetrical facade.","translation":"その建物のデザインは古典の影響を受けており、柱と左右対称のファサードが特徴です。"},{"sentence":"Her music is classical-influenced, incorporating elements of baroque and romantic styles.","translation":"彼女の音楽は古典の影響を受けており、バロックやロマン派の要素を取り入れています。"},{"sentence":"The novel is classical-influenced in its themes of fate and heroism.","translation":"その小説は、運命と英雄主義というテーマにおいて古典の影響を受けています。"}],"collocations":["classical-influenced architecture","classical-influenced music","classical-influenced art","classical-influenced design","classical-influenced style"],"synonyms":["classical","classicizing","neo-classical"],"antonyms":["modern","contemporary","avant-garde"]}],"etymology":{"value":"Combines \"classical\" (relating to the culture of ancient Greece and Rome, or to formal and traditional art forms) with \"influenced\" (having been affected by something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈklæsɪkəl ˈɪnfluənst/","syllables":"clas-si-cal-in-flu-enced"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"\"Classical-influenced\" describes something that shows the impact or inspiration of classical art, music, literature, or culture. It implies a connection to the traditions, styles, and principles of classical antiquity, often seen in architecture, music, and literature. It's used to indicate that while not strictly classical, the work incorporates elements or ideas derived from classical sources.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The classical influenced building.","correct":"✓ The classical-influenced building.","note":"Hyphenate the compound adjective when it precedes the noun it modifies."}],"priority":"★☆☆"},"related_words":{"derivatives":["classical","influence","influenced"],"related_terms":["neoclassical","classicism","classicizing"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, used in specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Classical-influenced\" is a term used to describe something that shows the effect of classical art, music, literature, or culture, especially from ancient Greece and Rome. It suggests that the thing being described has taken ideas or styles from classical sources and incorporated them. This term is more common in discussions of art, architecture, music, and literature where classical elements are present but not dominant."},"example_sentences":[{"sentence":"The painting features a classical-influenced composition, reminiscent of Renaissance masters.","translation":"その絵画は、ルネサンスの巨匠を彷彿とさせる、古典の影響を受けた構図が特徴です。","type":"adjective","meaning_category":"art"},{"sentence":"The symphony is classical-influenced, but with a modern twist.","translation":"その交響曲は古典の影響を受けていますが、現代的なひねりが加えられています。","type":"adjective","meaning_category":"music"},{"sentence":"The poem is classical-influenced in its use of meter and mythological allusions.","translation":"その詩は、韻律と神話への言及において古典の影響を受けています。","type":"adjective","meaning_category":"literature"}]}