{"word":"psychography","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"心霊筆記、自動書記","english_definition":"writing produced by a spiritualist medium or psychic, purportedly under the control of a spirit.","examples":[{"sentence":"The psychography produced by the medium was filled with cryptic messages.","translation":"霊媒によって書かれた心霊筆記は、不可解なメッセージで満たされていた。"},{"sentence":"Skeptics argue that psychography is simply a product of the medium's subconscious.","translation":"懐疑論者たちは、心霊筆記は単に霊媒の潜在意識の産物だと主張する。"}],"collocations":["produce psychography","analyze psychography","spiritualist psychography","automatic psychography"],"synonyms":["automatic writing","spirit writing","mediumistic writing"],"antonyms":[]}],"etymology":{"value":"From psycho- + -graphy.","priority":"★★☆"},"pronunciation":{"ipa":"/saɪˈkɒɡrəfi/","syllables":"psy-cho-gra-phy"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Psychography refers specifically to writing that is claimed to be produced by a spirit or other supernatural entity through a medium. It is often associated with spiritualism and paranormal phenomena.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She studied psychography to understand human behavior.","correct":"✓ She studied psychology to understand human behavior.","note":"Psychography (心霊筆記) is often confused with psychology (心理学)."},{"incorrect":"✗ The psychography was a detailed biography of the author.","correct":"✓ The biography was a detailed account of the author's life.","note":"Psychography is not the same as biography (伝記)."}],"priority":"★★☆"},"related_words":{"derivatives":["psychographer (noun): a person who practices or studies psychography"],"related_terms":["spiritualism","medium","automatic writing","paranormal"],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Psychography is a specialized term related to spiritualism and the paranormal. It refers to writing that is believed to be produced by a spirit through a medium. Due to its specific and niche usage, it is not a commonly encountered word. Understanding requires familiarity with spiritualist concepts."},"example_sentences":[{"sentence":"The séance included a session of psychography, where the medium channeled messages from the deceased.","translation":"その降霊会には心霊筆記のセッションが含まれており、霊媒が故人からのメッセージを伝えた。","type":"noun","meaning_category":"心霊筆記"},{"sentence":"Researchers have attempted to analyze psychography to determine the source of the writing.","translation":"研究者たちは、心霊筆記の出所を特定するために分析を試みてきた。","type":"noun","meaning_category":"心霊筆記"}]}