{"word":"hyperthyroidize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"甲状腺機能亢進症にする、甲状腺ホルモンを過剰に投与する","english_definition":"To induce hyperthyroidism in (someone or something); to administer excessive thyroid hormones to.","examples":[{"sentence":"The researchers hyperthyroidized the rats to study the effects on metabolism.","translation":"研究者たちは代謝への影響を研究するために、ラットに甲状腺ホルモンを過剰に投与した。"},{"sentence":"It is not ethical to hyperthyroidize a healthy individual for non-medical reasons.","translation":"医学的理由なしに健康な人に甲状腺ホルモンを過剰に投与することは倫理的ではない。"}],"collocations":["hyperthyroidize rats (ラットに甲状腺ホルモンを過剰投与する)","hyperthyroidize cells (細胞に甲状腺ホルモンを過剰投与する)"],"synonyms":["overstimulate thyroid","induce hyperthyroidism"],"antonyms":["hypothyroidize (甲状腺機能低下症にする)"]}],"etymology":{"value":"\"hyper-\" (過剰) + \"thyroid\" (甲状腺) + \"-ize\" (〜にする)","priority":"★★★"},"pronunciation":{"ipa":"/ˌhaɪpərˈθaɪrɔɪˌdaɪz/","syllables":"hy-per-thy-roid-ize"},"inflection":{"verb_forms":{"present_simple":["hyperthyroidize","hyperthyroidizes"],"past_simple":"hyperthyroidized","past_participle":"hyperthyroidized","present_participle":"hyperthyroidizing"}},"usage_notes":{"explanation":"This term is primarily used in medical and scientific contexts. It refers to the act of causing a state of hyperthyroidism, either experimentally or iatrogenically (through medical treatment). It's not a commonly used word in everyday conversation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor hyperthyroidized the patient without checking their hormone levels.","correct":"✓ The doctor should not have hyperthyroidized the patient without checking their hormone levels.","note":"Hyperthyroidizing a patient without proper assessment is medically inappropriate and potentially harmful. The example highlights the importance of ethical and safe medical practice."}],"priority":"★★☆"},"related_words":{"derivatives":["hyperthyroidism (甲状腺機能亢進症)","hyperthyroid (甲状腺機能亢進症の)"],"related_medical_terms":["hypothyroidism (甲状腺機能低下症)","thyroid hormone (甲状腺ホルモン)","thyroxine (チロキシン)","triiodothyronine (トリヨードサイロニン)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学・科学分野でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"hyperthyroidize\" is a highly specialized term primarily used in medical and scientific fields. It refers to the act of inducing hyperthyroidism, a condition of excessive thyroid hormone production, in an organism. This is often done experimentally to study the effects of hyperthyroidism or as a consequence of certain medical treatments. Due to its specific and technical nature, it is not commonly encountered in general language use."},"example_sentences":[{"sentence":"The endocrinologist decided to hyperthyroidize the cell cultures to observe the cellular response.","translation":"内分泌専門医は、細胞の反応を観察するために、細胞培養に甲状腺ホルモンを過剰に投与することを決定した。","type":"verb","meaning_category":"甲状腺機能亢進症にする"}]}