{"word":"cliquedom","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"派閥支配、派閥政治","english_definition":"rule or government by a clique; a state or organization controlled by a clique.","examples":[{"sentence":"The university was plagued by cliquedom, with a small group of professors controlling all the key decisions.","translation":"その大学は派閥支配に悩まされており、少数の教授グループがすべての重要な決定を支配していた。"},{"sentence":"He criticized the company's cliquedom, arguing that it stifled innovation and excluded talented individuals.","translation":"彼は会社の派閥支配を批判し、それが革新を妨げ、才能のある個人を排除していると主張した。"}],"collocations":["political cliquedom","corporate cliquedom","academic cliquedom"],"synonyms":["factionalism","nepotism","favoritism","oligarchy","inner circle"],"antonyms":["democracy","meritocracy","openness","transparency"]}],"etymology":{"value":"\"clique\" (派閥) + \"-dom\" (状態、領域)","priority":"★★★"},"pronunciation":{"ipa":"/ˈkliːkdəm/","syllables":"cli-que-dom"},"inflection":{"noun_plural":"cliquedoms"},"usage_notes":{"explanation":"\"Cliquedom\" refers to a situation where a small, exclusive group (a clique) holds power and influence, often to the detriment of others. It implies a closed and potentially unfair system where access and advancement are determined by membership in the clique rather than by merit or ability. The term often carries a negative connotation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cliquedom was very quiet.","correct":"✓ The cliquedom was very powerful.","note":"\"Cliquedom\" refers to a system of control, not a physical space or attribute. Therefore, it's more appropriate to describe it as powerful, influential, or corrupt, rather than quiet, large, or small."}],"priority":"★☆☆"},"related_words":{"derivatives":["clique","cliquish","cliquey"],"related_concepts":["groupthink","insider trading","cronyism","old boys' network"]},"level_frequency":{"frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈や批判的な議論で使われることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Cliquedom\" is a relatively uncommon word that describes a situation where a small, exclusive group of people controls an organization or system. It suggests that decisions are made based on personal connections and favoritism rather than on merit or fairness. Understanding this word requires a good grasp of abstract concepts and social dynamics."},"example_sentences":[{"sentence":"The new CEO vowed to dismantle the cliquedom that had been running the company for years.","translation":"新しいCEOは、長年会社を経営してきた派閥支配を解体することを誓った。","type":"general","meaning_category":"派閥支配"},{"sentence":"Many employees felt excluded from the cliquedom and unable to advance in their careers.","translation":"多くの従業員は、派閥支配から排除され、キャリアアップできないと感じていた。","type":"general","meaning_category":"派閥支配"},{"sentence":"The investigation revealed a complex web of relationships that perpetuated the cliquedom within the government agency.","translation":"調査により、政府機関内の派閥支配を永続させていた複雑な人間関係の網が明らかになった。","type":"general","meaning_category":"派閥支配"}]}