{"word":"Empress","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"女帝、皇后","english_definition":"A female ruler of an empire; the wife or widow of an emperor.","examples":[{"sentence":"The Empress ruled the vast empire with wisdom and grace.","translation":"女帝は知恵と優雅さをもって広大な帝国を統治した。"},{"sentence":"The Emperor and Empress attended the state banquet.","translation":"皇帝と皇后は国賓晩餐会に出席した。"},{"sentence":"Empress Dowager Cixi was a powerful figure in Chinese history.","translation":"西太后は中国の歴史における強力な人物だった。"}],"collocations":["Empress Dowager (皇太后)","Empress Consort (皇后)","Empress Regnant (女帝)"],"synonyms":["Queen (女王 - ただし、Empressは帝国を統治する女性に限定されることが多い)"],"antonyms":["Emperor (皇帝)","King (国王)","Queen (女王)"]},{"part_of_speech":"noun","definition":"（比喩的に）女王のように振る舞う女性、支配的な女性","english_definition":"(Figurative) A woman who is dominant or behaves like a queen.","examples":[{"sentence":"She always acts like an empress, demanding everyone's attention.","translation":"彼女はいつも女帝のように振る舞い、みんなの注目を集めようとする。"}],"collocations":[],"synonyms":["queen","diva"],"antonyms":[]}],"etymology":{"value":"Old French: emperesse, from Latin: imperatrix, feminine of imperator (commander, emperor).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈem.prəs/","syllables":"Em-press"},"inflection":{"noun_plural":"Empresses"},"usage_notes":{"explanation":"The term \"Empress\" specifically denotes a female ruler of an empire or the wife/widow of an emperor. It is distinct from \"Queen,\" which refers to a female monarch of a kingdom. The term can also be used figuratively to describe a woman who behaves in a dominant or regal manner.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"She is the queen of the empire.","correct":"She is the empress of the empire.","note":"Use 'empress' when referring to the female ruler of an empire."}],"priority":"★☆☆"},"related_words":{"derivatives":["emperor","empire","imperial"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'Empress' refers to a female ruler of an empire or the wife of an emperor. It's a relatively formal word, and understanding its specific meaning is important for comprehending historical and political contexts. The figurative use of the term is less common but can be encountered in literature or descriptive writing."},"example_sentences":[{"sentence":"The Empress oversaw the expansion of the empire's territories.","translation":"女帝は帝国の領土拡大を監督した。","type":"noun","meaning_category":"Female Ruler"},{"sentence":"The coronation of the Empress was a grand and elaborate ceremony.","translation":"皇后の戴冠式は壮大で手の込んだ儀式だった。","type":"noun","meaning_category":"Wife of Emperor"},{"sentence":"She has an air of authority, like a true empress.","translation":"彼女はまるで本物の女帝のような威厳がある。","type":"noun","meaning_category":"Figurative"}]}