{"word":"soldierly","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"兵士らしい、勇敢な、規律正しい、忠実な","english_definition":"having or showing qualities appropriate to a soldier, such as courage, discipline, and loyalty.","examples":[{"sentence":"He displayed soldierly courage in the face of danger.","translation":"彼は危険に直面して兵士らしい勇気を示した。"},{"sentence":"The recruits were praised for their soldierly bearing.","translation":"新兵たちは兵士らしい態度を褒められた。"},{"sentence":"She admired his soldierly dedication to his duty.","translation":"彼女は彼の兵士らしい任務への献身に感銘を受けた。"}],"collocations":["soldierly conduct (兵士らしい行動)","soldierly bearing (兵士らしい態度)","soldierly courage (兵士らしい勇気)","soldierly discipline (兵士らしい規律)","soldierly loyalty (兵士らしい忠誠心)","soldierly qualities (兵士らしい資質)"],"synonyms":["brave","courageous","valiant","gallant","disciplined","loyal","patriotic","martial"],"antonyms":["cowardly","undisciplined","disloyal","unpatriotic"]}],"etymology":{"value":"\"Soldier\" + \"-ly\".  Derived from the word \"soldier\" and the suffix \"-ly,\" indicating qualities or characteristics associated with a soldier.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsoʊldʒərli/","syllables":"sol-dier-ly"},"inflection":{"adjective_forms":{"comparative":"more soldierly","superlative":"most soldierly"}},"usage_notes":{"explanation":"\"Soldierly\" describes qualities or behaviors that are considered typical or admirable in a soldier. It often implies bravery, discipline, loyalty, and a strong sense of duty. The term is used to commend individuals who exhibit these traits, whether they are actually soldiers or not. It can also be used to describe the manner in which someone carries themselves or performs a task.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted soldierly when he ran away.","correct":"✓ He acted cowardly when he ran away.","note":"\"Soldierly\" implies bravery and duty, so running away would be the opposite of soldierly behavior. Use \"cowardly\" instead."},{"incorrect":"✗ The general was soldierly dressed.","correct":"✓ The general was soldierly in appearance. / ✓ The general was dressed in a soldierly manner.","note":"\"Soldierly\" is an adjective and cannot directly modify \"dressed.\" Use \"soldierly in appearance\" or \"dressed in a soldierly manner\" instead."}],"priority":"★★☆"},"related_words":{"derivatives":["soldier (noun: 兵士)","soldiering (noun: 兵役、軍務)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"比較的低い (Relatively low) - 一般的な会話ではあまり使われないが、文学や歴史的な文脈では見られる。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"soldierly\" describes someone or something that has the qualities of a good soldier. This includes being brave, disciplined, and loyal. It's not a very common word in everyday conversation, but you might find it in books or movies about war or the military. It's used to show respect for someone who acts like a good soldier, even if they aren't actually in the military.","priority":"★★☆"},"example_sentences":[{"sentence":"The young officer showed soldierly resolve in the face of the enemy.","translation":"若い士官は敵を前にして兵士らしい決意を示した。","type":"adjective","meaning_category":"勇敢さ、決意"},{"sentence":"Her soldierly demeanor impressed everyone at the ceremony.","translation":"彼女の兵士らしい態度は式典の参加者全員に感銘を与えた。","type":"adjective","meaning_category":"態度、品格"},{"sentence":"He approached the challenge with soldierly discipline and determination.","translation":"彼は兵士らしい規律と決意をもってその難題に取り組んだ。","type":"adjective","meaning_category":"規律、決意"},{"sentence":"The veterans were honored for their soldierly service to the country.","translation":"退役軍人たちは国への兵士らしい奉仕を讃えられた。","type":"adjective","meaning_category":"忠誠心、奉仕"}]}