{"word":"reinduction","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"再誘導、再導入、再帰納","english_definition":"The act of inducting again; a second or subsequent induction.","examples":[{"sentence":"The reinduction of the new members was held after the summer break.","translation":"新メンバーの再導入は夏休み後に行われた。"},{"sentence":"The company is considering the reinduction of a training program.","translation":"会社は研修プログラムの再導入を検討している。"}],"collocations":["reinduction program","reinduction ceremony","reinduction training"],"synonyms":["reinstatement","reactivation","reintroduction"],"antonyms":["removal","exclusion","termination"]}],"etymology":{"value":"The word \"reinduction\" is formed by adding the prefix \"re-\" (meaning again or anew) to the word \"induction\". \"Induction\" itself comes from the Latin word \"inductio\", meaning \"a leading in\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːɪnˈdʌkʃən/","syllables":"re-in-duc-tion"},"inflection":{"noun_plural":"reinductions"},"usage_notes":{"explanation":"\"Reinduction\" refers to the process of inducting someone or something again. This can apply to people, such as reintroducing members to an organization, or to processes, such as reintroducing a training program. The context usually makes it clear what is being re-inducted.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The reinduction was very inducting.","correct":"✓ The reinduction was very thorough.","note":"\"Inducting\" as an adjective doesn't fit here. Use a more appropriate adjective like \"thorough\" or \"detailed\"."},{"incorrect":"✗ They reinductioned the new members.","correct":"✓ They performed the reinduction of the new members.","note":"\"Reinduction\" is primarily used as a noun. The verb form is less common and can sound awkward. It's better to use a phrase like \"performed the reinduction\" or reintroduce."}],"priority":"★★☆"},"related_words":{"derivatives":["reinduct (verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"reinduction\" is a relatively formal and uncommon term, generally used in professional or academic contexts. It implies a process of reinstating or reintroducing something that was previously in place. Understanding requires familiarity with the base word \"induction\" and the prefix \"re-\". It is not typically encountered in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The company held a formal reinduction for employees returning after a long leave.","translation":"会社は長期休暇から復帰した従業員のために正式な再導入を行った。","type":"noun","meaning_category":"再導入"},{"sentence":"The reinduction program helped the returning staff to quickly reintegrate into their roles.","translation":"再導入プログラムは、復帰したスタッフが速やかに役割に再統合するのを助けた。","type":"noun","meaning_category":"再導入"},{"sentence":"The reinduction process included updated training on new safety protocols.","translation":"再導入プロセスには、新しい安全プロトコルに関する最新のトレーニングが含まれていた。","type":"noun","meaning_category":"再導入"}]}