{"word":"deurbanization","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"脱都市化、都市離反","english_definition":"The process of population shift from urban areas to rural areas.","examples":[{"sentence":"Deurbanization is becoming more common as remote work opportunities increase.","translation":"リモートワークの機会が増えるにつれて、脱都市化がより一般的になっている。"},{"sentence":"The deurbanization trend is driven by factors such as lower cost of living and a desire for a more peaceful lifestyle.","translation":"脱都市化の傾向は、生活費の低さや、より平和なライフスタイルへの願望などの要因によって推進されている。"}],"collocations":["drive deurbanization","reverse deurbanization","experience deurbanization"],"synonyms":["ruralization","counter-urbanization"],"antonyms":["urbanization"]},{"part_of_speech":"noun","definition":"都市機能の縮小、都市衰退","english_definition":"The decline of urban functions or the deterioration of urban areas.","examples":[{"sentence":"Deurbanization can lead to the closure of businesses and a decline in public services.","translation":"脱都市化は、企業の閉鎖や公共サービスの低下につながる可能性がある。"},{"sentence":"The city is experiencing deurbanization due to economic hardship.","translation":"その都市は経済的困難のため、都市機能の縮小を経験している。"}],"collocations":["urban deurbanization","economic deurbanization"],"synonyms":["urban decay","urban decline"],"antonyms":["urban renewal","urban development"]}],"etymology":{"value":"Formed from the prefix 'de-' (meaning 'removal' or 'reversal') and 'urbanization'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdiːˌɜːrbənɪˈzeɪʃən/","syllables":"de-ur-ban-i-za-tion"},"inflection":{"noun_plural":"deurbanizations"},"usage_notes":{"explanation":"'Deurbanization' refers to two related but distinct processes: the movement of people from cities to rural areas, and the decline of urban areas themselves. The first sense focuses on population shifts, while the second emphasizes the deterioration of urban functions and infrastructure.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Urbanization is the opposite of deurbanization, where people move to the city.","correct":"Urbanization is the opposite of deurbanization, where people move from rural areas to the city.","note":"The correct definition of urbanization is the movement of people from rural areas to urban areas."}],"priority":"★★☆"},"related_words":{"derivatives":["deurbanize (verb)"],"related_terms":["suburbanization","rural flight","urban sprawl"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Deurbanization' is a term used to describe the process where people move away from cities and into rural areas. It can also refer to the decline of city functions and infrastructure. This is often caused by factors such as high living costs, increased remote work opportunities, or a desire for a quieter lifestyle. It's the opposite of 'urbanization', which is the movement of people into cities."},"example_sentences":[{"sentence":"The rise of remote work has accelerated **deurbanization** in many developed countries.","translation":"リモートワークの普及は、多くの先進国で脱都市化を加速させている。","type":"noun","meaning_category":"population shift"},{"sentence":"Economic decline led to **deurbanization** and the abandonment of many buildings in the city center.","translation":"経済の衰退は脱都市化を招き、都市中心部の多くの建物が放棄された。","type":"noun","meaning_category":"urban decline"}]}