{"word":"theopathic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"神の感情に影響された、神の感情を経験する、または神の感情を表現する","english_definition":"Affected by, experiencing, or expressing the emotions of God.","examples":[{"sentence":"The theopathic saint was said to have visions filled with divine love and sorrow.","translation":"その神憑り的な聖者は、神の愛と悲しみに満ちた幻を見たと言われている。"},{"sentence":"His theopathic writings explored the human connection to divine suffering.","translation":"彼の神憑り的な著作は、神の苦しみとの人間のつながりを考察した。"}],"collocations":["theopathic experience","theopathic vision","theopathic writing","theopathic saint"],"synonyms":["divinely inspired","godly","spiritual","religious","devout"],"antonyms":["atheistic","secular","worldly"]}],"etymology":{"value":"From the Greek words 'theos' (god) and 'pathos' (feeling, suffering).","priority":"★★★"},"pronunciation":{"ipa":"/ˌθiːəˈpæθɪk/","syllables":"the-o-path-ic"},"inflection":{"notes":"Adjective, no specific inflection"},"usage_notes":{"explanation":"'Theopathic' describes someone or something influenced by or expressing divine emotions, often in a religious or spiritual context. It suggests a deep connection to the feelings and experiences attributed to God. It is a relatively rare word, primarily used in theological or philosophical discussions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Theopathic treatment cured his disease.","correct":"✓ Theopathic experiences shaped his spiritual journey.","note":"The word 'theopathic' describes a state of being influenced by divine emotions, not a method of treatment. It cannot be used as a treatment method."},{"incorrect":"✗ He was theopathic because he went to church every Sunday.","correct":"✓ He was theopathic because he claimed to feel God's joy and sorrow.","note":"Attending church is a religious practice, but 'theopathic' specifically relates to experiencing or expressing divine emotions."}],"priority":"★★☆"},"related_words":{"derivatives":["theopathy (noun): The experience or expression of divine emotions.","theopath (noun): One who experiences or expresses divine emotions."],"related_terms":["theism","pathos","divine","spiritual"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'theopathic' is a rare and complex term, primarily used in theological or philosophical contexts. It describes the state of being influenced by or expressing the emotions of God. Understanding this word requires a strong vocabulary and familiarity with abstract concepts related to religion and spirituality. It is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The mystic described her theopathic state as a profound union with the divine.","translation":"その神秘家は、彼女の神憑り的な状態を、神との深遠な一体感として説明した。","type":"adjective","meaning_category":"Experiencing divine emotions"},{"sentence":"The artist's theopathic paintings conveyed a sense of both divine suffering and transcendent joy.","translation":"その芸術家の神憑り的な絵画は、神の苦しみと超越的な喜びの両方を伝えた。","type":"adjective","meaning_category":"Expressing divine emotions"}]}