{"word":"bourgeois-influenced","meanings":[{"part_of_speech":"adjective","definition":"ブルジョアの影響を受けた、ブルジョア的な影響を受けた","english_definition":"Having been affected or shaped by the values, attitudes, or characteristics associated with the bourgeoisie.","examples":[{"sentence":"His art was criticized for being bourgeois-influenced and lacking in revolutionary spirit.","translation":"彼の芸術は、ブルジョアの影響を受けており、革命精神に欠けていると批判された。"},{"sentence":"The film's themes were seen as bourgeois-influenced, focusing on individual success rather than collective struggle.","translation":"その映画のテーマは、集団的な闘争よりも個人の成功に焦点を当てており、ブルジョアの影響を受けていると見なされた。"},{"sentence":"Some argue that modern education is bourgeois-influenced, perpetuating class inequalities.","translation":"現代の教育はブルジョアの影響を受けており、階級の不平等を永続させていると主張する人もいる。"}],"collocations":["bourgeois values","bourgeois culture","bourgeois ideology","bourgeois society","bourgeois lifestyle"],"synonyms":["middle-class influenced","conventional","establishment"],"antonyms":["proletarian","revolutionary","counter-cultural"],"notes":["Often used in a critical or pejorative way, particularly in Marxist or socialist contexts."]}],"etymology":{"value":"Derived from 'bourgeois,' referring to the middle class, and 'influenced,' meaning affected or shaped by something.","notes":"The term reflects a critique of cultural or social elements perceived as being shaped by bourgeois values."},"pronunciation":{"ipa":null,"syllables":null},"inflection":{},"usage_notes":{"explanation":"'Bourgeois-influenced' is used to describe something that exhibits the values, tastes, or characteristics associated with the bourgeoisie, often in a way that is seen as negative or undesirable by those with different ideologies. It implies a focus on material wealth, social status, and conventional norms.","priority":"2"},"common_mistakes":{},"related_words":{"derivatives":["bourgeoisie","bourgeois","influence","influenced"],"related_terms":["proletariat","class struggle","capitalism","socialism","Marxism"]},"level_frequency":{},"readability_explanation":{"level":null,"text":"The term 'bourgeois-influenced' is relatively complex and is most often encountered in discussions of social class, politics, and cultural criticism. Understanding the term requires familiarity with the concept of the bourgeoisie and its associated values."},"example_sentences":[{"sentence":"The play was criticized for its bourgeois-influenced portrayal of family life.","translation":"その劇は、ブルジョア的な家族生活の描写で批判された。","type":"general","meaning_category":"general"},{"sentence":"Many saw the economic reforms as bourgeois-influenced policies that favored the wealthy.","translation":"多くの人が、その経済改革を富裕層を優遇するブルジョアの影響を受けた政策と見なした。","type":"political","meaning_category":"political"},{"sentence":"The artist rejected what he saw as bourgeois-influenced art, seeking a more authentic form of expression.","translation":"その芸術家は、ブルジョアの影響を受けた芸術と彼が見なしたものを拒否し、より本物の表現形式を求めた。","type":"artistic","meaning_category":"artistic"}]}