{"word":"Auriculidae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"オカミミガイ科","english_definition":"A taxonomic family of air-breathing snails, pulmonate gastropods, in the superfamily Ellobioidea. They are terrestrial or semi-terrestrial snails.","examples":[{"sentence":"The Auriculidae family includes several genera of snails found in coastal areas.","translation":"オカミミガイ科には、沿岸地域で見られるいくつかの属のカタツムリが含まれています。"}],"collocations":[],"synonyms":["Ellobiidae (sometimes used synonymously, though Ellobiidae might be considered a more encompassing or updated classification)"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin 'auricula' meaning 'little ear' (referring to the ear-like shape of the shell) and the suffix '-idae' which is used to denote a zoological family.","priority":"★★☆"},"pronunciation":{"ipa":"/ɔːˌrɪkjʊˈlaɪdiː/","syllables":"Au-ric-u-li-dae"},"inflection":{"noun_plural":"Auriculidae (often used in plural form to refer to the family in general)"},"usage_notes":{"explanation":"Auriculidae is a taxonomic family name, primarily used in scientific contexts, specifically in zoology and malacology (the study of mollusks). It refers to a specific grouping of snails.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Auriculidae is a type of snail.","correct":"✓ Auriculidae is a family of snails.","note":"Auriculidae is a family, not a specific type of snail. To refer to a specific snail, you'd need to use the genus and species name."}],"priority":"★☆☆"},"related_words":{"derivatives":["auricula (Latin root meaning 'little ear')"],"taxonomic_hierarchy":["Superfamily: Ellobioidea","Class: Gastropoda","Phylum: Mollusca"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語 (scientific term).","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Auriculidae' is a specialized term used in the field of zoology, specifically when discussing the taxonomy of mollusks. Understanding this term requires familiarity with biological classification systems. It is not commonly used outside of scientific literature or specialized discussions on snail taxonomy."},"example_sentences":[{"sentence":"Researchers studied the respiratory adaptations of Auriculidae in mangrove ecosystems.","translation":"研究者たちは、マングローブ生態系におけるオカミミガイ科の呼吸適応を研究しました。","type":"scientific","meaning_category":"zoology"},{"sentence":"The classification of certain genera within Auriculidae is still debated among malacologists.","translation":"オカミミガイ科内の特定の属の分類は、依然として軟体動物学者たちの間で議論されています。","type":"scientific","meaning_category":"taxonomy"}]}