{"word":"Broletti","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Italian, historical) The name of a medieval town hall or public square in some northern Italian cities, particularly in the Lombardy region. It often served as a center for commerce, justice, and civic administration.","english_definition":"(Italian, historical) The name of a medieval town hall or public square in some northern Italian cities, particularly in the Lombardy region. It often served as a center for commerce, justice, and civic administration.","examples":[{"sentence":"The Broletti in Como is a beautiful example of medieval architecture.","translation":"コモのブロレッティは中世建築の美しい例です。"},{"sentence":"Historically, the Broletti was where important civic decisions were made.","translation":"歴史的に、ブロレッティは重要な市民の決定がなされた場所でした。"}],"collocations":["Piazza del Broletto","Broletto of Como","Broletto of Brescia"],"synonyms":["town hall","public square","civic center"],"antonyms":[]}],"etymology":{"value":"Derived from the Lombard word 'brolo' meaning 'enclosed garden' or 'orchard'. The term evolved to refer to the area where public assemblies were held, often near a garden or green space.","priority":"★★☆"},"pronunciation":{"ipa":"/broˈletti/","syllables":"Bro-let-ti"},"inflection":{"notes":"Plural form is Broletti (same as singular)."},"usage_notes":{"explanation":"'Broletti' specifically refers to historical town squares or town halls in northern Italian cities, especially those with Lombard origins. It's not a generic term for any town square. The term evokes a sense of medieval civic life and governance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ All Italian town squares are called Broletti.","correct":"✓ 'Broletti' refers specifically to certain historical town squares in northern Italy.","note":"'Broletti' is not a general term for all Italian town squares."}],"priority":"★☆☆"},"related_words":{"derivatives":["brolo (Italian, enclosed garden, orchard)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - primarily used in historical or architectural contexts related to northern Italy.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Broletti' is a specialized term referring to a type of historical town square or town hall found in northern Italy, particularly in the Lombardy region. Understanding its meaning requires knowledge of Italian history and architecture. The term is not commonly used outside of these specific contexts."},"example_sentences":[{"sentence":"The arches of the Broletti provided shade for merchants selling their goods.","translation":"ブロレッティのアーチは、商品を売る商人に日陰を提供しました。","type":"general","meaning_category":"historical context"},{"sentence":"The Broletti in Mantua is a significant landmark in the city's historical center.","translation":"マントヴァのブロレッティは、市の歴史的中心部における重要なランドマークです。","type":"specific example","meaning_category":"landmark"}]}