{"word":"seaways","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"航路、海上ルート","english_definition":"A route on the sea used by ships; a navigable channel or system of channels for maritime transport.","examples":[{"sentence":"The Great Lakes Seaway allows large ships to reach inland ports.","translation":"五大湖水路は大型船が内陸の港に到達することを可能にする。"},{"sentence":"Historically, seaways were vital for trade and exploration.","translation":"歴史的に、航路は貿易と探検にとって不可欠だった。"},{"sentence":"Modern seaways are often equipped with navigational aids.","translation":"現代の航路はしばしば航行支援設備を備えている。"}],"collocations":["international seaways (国際航路)","major seaways (主要航路)","strategic seaways (戦略的航路)","coastal seaways (沿岸航路)","inland seaways (内陸航路)"],"synonyms":["waterways","shipping lanes","sea routes","channels","maritime routes"],"antonyms":[]}],"etymology":{"value":"'Seaway' is a compound word formed by combining 'sea' and 'way'. It describes a path or route on the sea.","priority":"★★☆"},"pronunciation":{"ipa":"ˈsiːweɪz","syllables":"sea-ways"},"inflection":{"noun_plural":"seaways (already plural)"},"usage_notes":{"explanation":"'Seaways' refers to established routes used by ships for transportation. It often implies a managed or navigable channel, sometimes involving canals or other modifications to natural waterways. The term is frequently used in discussions of trade, shipping, and maritime infrastructure.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The seaway was very traffic.","correct":"✓ The seaway had a lot of traffic.","note":"Use 'traffic' as a noun, not an adjective. 'The seaway was very busy' is also correct."},{"incorrect":"✗ He traveled by seaway to Europe.","correct":"✓ He traveled by sea to Europe. / ✓ He used the seaway to travel to Europe.","note":"'By seaway' is less common than 'by sea'. If specifying the route, use 'used the seaway'."}],"priority":"★★☆"},"related_words":{"derivatives":["seaway (singular form)","sea lane","waterway","shipping route"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'seaways' is used to describe routes on the sea that ships use for travel. It's a more formal term than just saying 'sea routes' and often implies that these routes are well-established and possibly managed or maintained. You'll often see it used when talking about international trade, shipping, or the infrastructure that supports maritime transport. It's not a very common word in everyday conversation, but you'll find it in news articles or reports about shipping and trade.","priority":"★★☆"},"example_sentences":[{"sentence":"The St. Lawrence Seaways are crucial for transporting goods between the Atlantic Ocean and the Great Lakes.","translation":"セントローレンス水路は、大西洋と五大湖の間で商品を輸送する上で非常に重要である。","type":"noun","meaning_category":"航路"},{"sentence":"The development of new seaways can significantly impact global trade patterns.","translation":"新しい航路の開発は、世界の貿易パターンに大きな影響を与える可能性がある。","type":"noun","meaning_category":"航路"},{"sentence":"Piracy remains a threat in some of the world's busiest seaways.","translation":"海賊行為は、世界で最も交通量の多い航路の一部で依然として脅威となっている。","type":"noun","meaning_category":"航路"},{"sentence":"The government invested heavily in improving the safety of the nation's seaways.","translation":"政府は国の航路の安全性を向上させるために多額の投資を行った。","type":"noun","meaning_category":"航路"}]}