{"word":"mammin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(スラング、主にインターネット) 母親に過度に依存している男性、マザコン","english_definition":"(slang, mainly internet) A man who is excessively attached to his mother; a mama's boy.","examples":[{"sentence":"He's such a mammin; he still lives with his mother and she does everything for him.","translation":"彼は本当にマザコンだ。まだ母親と一緒に住んでいて、彼女が彼の身の回りのことを全部やっている。"},{"sentence":"Some people use 'mammin' as an insult to describe men who are perceived as weak or lacking independence.","translation":"一部の人は、弱くて自立心がないと思われる男性を指す侮辱的な言葉として「mammin」を使う。"}],"collocations":["live with mother","dependent on mother","mama's boy"],"synonyms":["mama's boy","mother's boy","mummy's boy","mommy's boy"],"antonyms":["independent","self-reliant"]}],"etymology":{"value":"A blend of 'mama' or 'mommy' and '-in', possibly influenced by terms like 'simpin' or other internet slang.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈmæmɪn/","syllables":"mam-min"},"inflection":{"noun_plural":"mammins"},"usage_notes":{"explanation":"'Mammin' is a slang term, primarily used online, to describe a man who is excessively attached to or dependent on his mother. It's often used pejoratively, implying a lack of independence or maturity. The term is relatively new and its usage is still evolving.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She's a mammin because she loves her mom.","correct":"✓ He's a mammin because he relies on his mom for everything.","note":"Loving one's mother is normal; 'mammin' implies excessive dependence, not just affection."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Slang, not typically included in CEFR levels)","frequency_google_ngram":"Low frequency (Primarily internet slang)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Mammin' is a slang term, primarily used in online contexts, to describe a man who is excessively dependent on his mother. It is often used as a derogatory term implying a lack of independence or maturity. Due to its slang nature and relatively recent origin, it is not typically found in formal contexts or traditional language learning materials. Understanding the term requires familiarity with internet slang and its nuances."},"example_sentences":[{"sentence":"Don't be such a mammin; learn to do things for yourself.","translation":"そんなマザコンになるな。自分のことは自分でできるようになりなさい。","type":"noun","meaning_category":"マザコン"},{"sentence":"He's a total mammin; his mom still packs his lunch every day.","translation":"彼は完全なマザコンだ。彼の母親は毎日彼の弁当を詰めている。","type":"noun","meaning_category":"マザコン"}]}