{"word":"Coolamon","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"クーラモン：オーストラリア先住民のアボリジニが使用する、浅い湾曲した木製の多目的容器。水を運んだり、食べ物を集めたり、赤ちゃんを運んだりするのに使われる。","english_definition":"A coolamon is an Australian Aboriginal carrying vessel. It is a shallow, curved wooden dish used for carrying water, food, and even babies.","examples":[{"sentence":"The Aboriginal woman carried water in her coolamon.","translation":"そのアボリジニの女性はクーラモンで水を運んだ。"},{"sentence":"Coolamons were traditionally made from bark or wood.","translation":"クーラモンは伝統的に樹皮や木から作られていた。"}],"collocations":["carry water in a coolamon (クーラモンで水を運ぶ)","wooden coolamon (木製のクーラモン)","Aboriginal coolamon (アボリジニのクーラモン)"],"synonyms":["carrying dish","wooden vessel"],"antonyms":[]}],"etymology":{"value":"The word 'coolamon' is derived from the Dharug language, an Aboriginal language of the Sydney region.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkuːləmən/","syllables":"coo-la-mon"},"inflection":{"noun_plural":"coolamons"},"usage_notes":{"explanation":"Coolamons are significant cultural artifacts for Aboriginal Australians, representing traditional skills, resourcefulness, and connection to the land. They are often decorated with traditional designs and can vary in size and shape depending on their intended use and the region they come from.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She used a coolamon as a weapon.","correct":"✓ She used a spear as a weapon.","note":"Coolamons are primarily carrying vessels, not weapons."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'coolamon' refers to a specific type of traditional Aboriginal Australian tool. Understanding its meaning requires knowledge of Aboriginal culture and history. It's not a commonly used word outside of contexts discussing Aboriginal culture or Australian history. Therefore, a higher level of English proficiency and cultural awareness is needed to fully comprehend its meaning and usage."},"example_sentences":[{"sentence":"The museum displayed a collection of ancient coolamons.","translation":"博物館には古代のクーラモンのコレクションが展示されていた。","type":"noun","meaning_category":"cultural artifact"},{"sentence":"She learned how to make a coolamon from her grandmother.","translation":"彼女は祖母からクーラモンの作り方を教わった。","type":"noun","meaning_category":"cultural artifact"}]}