{"word":"Gebelein","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古代エジプトの都市) ゲベレイン：古代エジプトの上エジプトにあった都市。現在のナイル川東岸のナガ・エル・ゲリザ村付近に位置する。","english_definition":"(Ancient Egyptian city) Gebelein: An ancient Egyptian city located in Upper Egypt. It is located near the present-day village of Naga el-Geriza on the east bank of the Nile.","examples":[{"sentence":"The Gebelein Papyri are a collection of ancient Egyptian documents discovered at Gebelein.","translation":"ゲベレイン・パピルスは、ゲベレインで発見された古代エジプトの文書群です。"},{"sentence":"Gebelein was an important religious center dedicated to the goddess Hathor.","translation":"ゲベレインは、女神ハトホルに捧げられた重要な宗教的中心地でした。"}],"collocations":["Gebelein Papyri (ゲベレイン・パピルス)","Temple of Hathor at Gebelein (ゲベレインのハトホル神殿)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"ゲベレインという名前は、古代エジプト語の「Per-Hathor」（ハトホルの家）に由来すると考えられています。ギリシャ語では「Pathyris」と呼ばれていました。","priority":"★★☆"},"pronunciation":{"ipa":"/ɡəˈbiːlaɪn/","syllables":"Ge-be-lein"},"inflection":{},"usage_notes":{"explanation":"Gebeleinは、古代エジプト史において重要な場所であり、特に初期王朝時代からローマ時代にかけて繁栄しました。この都市は、女神ハトホルを祀る神殿で知られており、また、埋葬地としても重要でした。ゲベレインで発見された遺物や文書は、古代エジプトの文化や社会に関する貴重な情報を提供しています。","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Gebelein Papyri (ゲベレイン・パピルス)"],"related_places":["Upper Egypt (上エジプト)","Nile River (ナイル川)","Hathor (ハトホル)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"低頻度 (Low frequency) - 古代エジプト史の研究者や愛好家以外には馴染みが薄い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「Gebelein」は、古代エジプトの都市の名前です。歴史や考古学に興味がある人以外にはあまり知られていないかもしれません。ナイル川沿いに位置し、女神ハトホルを祀る神殿があったことで知られています。また、ここで発見されたパピルスは、古代エジプトの生活を知る上で重要な資料となっています。専門的な文脈で使われることが多い単語です。"},"example_sentences":[{"sentence":"The mummies discovered at Gebelein provide valuable insights into ancient Egyptian burial practices.","translation":"ゲベレインで発見されたミイラは、古代エジプトの埋葬習慣に関する貴重な洞察を提供します。","type":"noun","meaning_category":"古代エジプトの都市"},{"sentence":"Archaeologists continue to study the artifacts found at Gebelein to learn more about its history.","translation":"考古学者は、ゲベレインの歴史についてより深く知るために、そこで発見された遺物の研究を続けています。","type":"noun","meaning_category":"古代エジプトの都市"}]}