{"word":"bread-basket","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"パンかご、パン入れ","english_definition":"A basket or container for holding bread, typically at the table.","examples":[{"sentence":"The waiter brought a bread-basket filled with warm rolls.","translation":"ウェイターは温かいロールパンでいっぱいのパンかごを持ってきた。"},{"sentence":"She placed the bread-basket in the center of the table.","translation":"彼女はパンかごをテーブルの中央に置いた。"}],"collocations":["pass the bread-basket","a woven bread-basket","a silver bread-basket"],"synonyms":["bread holder","bread container"],"antonyms":[]},{"part_of_speech":"noun","definition":"(俗語)腹部、特に腹部への打撃を受けやすい部分","english_definition":"(Slang) The abdomen, especially the vulnerable area for punches.","examples":[{"sentence":"He took a punch to the bread-basket and doubled over.","translation":"彼は腹部にパンチを受けて体を折り曲げた。"},{"sentence":"Protect your bread-basket!","translation":"腹部を守れ！"}],"collocations":["punch to the bread-basket","hit in the bread-basket"],"synonyms":["stomach","abdomen","belly"],"antonyms":[]}],"etymology":{"value":"The term \"bread-basket\" is a compound word. \"Bread\" refers to the food, and \"basket\" refers to the container. The slang usage likely derives from the idea of the abdomen being a vulnerable 'container' for vital organs.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbrɛdˌbæskɪt/","syllables":"bread-bas-ket"},"inflection":{"noun_plural":"bread-baskets"},"usage_notes":{"explanation":"The term \"bread-basket\" has two distinct meanings. The primary meaning refers to a container for holding bread. The slang meaning refers to the abdomen, particularly as a target in fighting. Context is crucial for understanding the intended meaning. The slang usage is informal and may not be appropriate in all situations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He put the apples in the bread-basket.","correct":"✓ He put the bread in the bread-basket.","note":"A bread-basket is specifically for bread, not other types of food."},{"incorrect":"✗ She felt pain in her bread basket after running.","correct":"✓ She felt pain in her abdomen after running.","note":"While 'bread-basket' can refer to the abdomen, it's more common to use 'abdomen' or 'stomach' in formal contexts."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["basket","bread","abdomen","stomach"]},"level_frequency":{"CEFR":"B2 (for the literal meaning), C1 (for the slang meaning)","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"bread-basket\" has two meanings: a literal one (a basket for bread) and a slang one (the abdomen). The literal meaning is straightforward. The slang meaning is more figurative and less common, referring to the abdomen as a vulnerable area. Understanding the context is key to interpreting the intended meaning. The slang usage is informal.","priority":"★★☆"},"example_sentences":[{"sentence":"The bakery displayed its fresh loaves in a large bread-basket.","translation":"パン屋は焼きたてのパンを大きなパンかごに入れて展示した。","type":"noun","meaning_category":"パンかご"},{"sentence":"The boxer aimed a swift punch at his opponent's bread-basket.","translation":"ボクサーは対戦相手の腹部に素早いパンチを狙った。","type":"noun","meaning_category":"腹部"}]}