{"word":"Arhat","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"阿羅漢 (あらかん): 仏教において、修行の最終段階に達し、悟りを開いた聖者。煩悩を断ち切り、輪廻から解脱した者。","english_definition":"(Buddhism) A perfected person who has attained nirvana and is free from rebirth; a worthy one who has gained insight into the true nature of existence and achieved liberation from the cycle of rebirth.","examples":[{"sentence":"阿羅漢は、仏教の修行における理想的な境地の一つです。","translation":"An Arhat is one of the ideal states in Buddhist practice."},{"sentence":"彼は厳しい修行の末、阿羅漢の位に達したと言われています。","translation":"It is said that he reached the state of Arhat after rigorous training."}],"collocations":["阿羅漢果 (あらかんか): the fruit of Arhatship, the state of being an Arhat","五百羅漢 (ごひゃくらかん): five hundred Arhats (often depicted in Buddhist art)"],"synonyms":["応供 (おうぐ): worthy of offerings","無学 (むがく): beyond learning (because there is nothing more to learn)","真人 (しんじん): true person"],"antonyms":["凡夫 (ぼんぷ): ordinary person","菩薩 (ぼさつ): Bodhisattva (one who seeks enlightenment for all beings)"]}],"etymology":{"value":"サンスクリット語の 'arhat' (अरिहत्) に由来し、「価値ある者」「尊敬される者」を意味する。パーリ語では 'arahant' となる。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɑːrhæt/","syllables":"Ar-hat"},"inflection":{"noun_plural":"Arhats (英語で複数形にする場合)"},"usage_notes":{"explanation":"'Arhat' は仏教用語であり、一般的に英語圏では仏教の研究や実践に関連する文脈で使用されます。日本語の「阿羅漢」とほぼ同じ意味合いを持ちます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an Arhat because he is a good person.","correct":"✓ He is considered an Arhat because he has attained enlightenment through Buddhist practice.","note":"単に良い人であるだけでなく、仏教の修行を通して悟りを開いた者が阿羅漢であるという点を明確にする必要があります。"},{"incorrect":"✗ Arhats are the same as Buddhas.","correct":"✓ Arhats are enlightened beings, but not all Arhats are Buddhas. A Buddha is a unique being who rediscovers the path to enlightenment.","note":"阿羅漢は悟りを開いた存在ですが、仏陀（如来）とは異なります。仏陀は自力で悟りへの道を見出した特別な存在です。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2 (専門的な仏教用語)","frequency_google_ngram":"非常に低い (Very low) - 仏教関連の文献や研究で使われる専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Arhat**」は仏教用語で、特に上座部仏教（Theravada Buddhism）において重要な概念です。阿羅漢とは、仏教の修行を完成させ、すべての煩悩を断ち切って解脱した聖者を指します。輪廻転生から解放された状態を意味し、仏教徒が目指す理想的な境地の一つです。この単語は、仏教の研究や実践に関わる人々にとって重要な意味を持ちますが、一般的な日常会話ではほとんど使われません。"},"example_sentences":[{"sentence":"The **Arhat** sat in meditation, radiating peace and wisdom.","translation":"阿羅漢は瞑想に座り、平和と知恵を放っていた。","type":"noun","meaning_category":"仏教における聖者"},{"sentence":"The teachings of the Buddha guide practitioners towards becoming an **Arhat**.","translation":"仏陀の教えは、修行者を阿羅漢になるように導く。","type":"noun","meaning_category":"仏教における聖者"}]}