{"word":"Methodistical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"メソジストの、メソジスト教徒のような","english_definition":"Of or relating to Methodism or Methodists; characteristic of Methodists.","examples":[{"sentence":"His preaching style was Methodistical, emphasizing personal piety and social action.","translation":"彼の説教スタイルはメソジスト的で、個人的な敬虔さと社会活動を強調していた。"},{"sentence":"The meeting had a Methodistical fervor, with passionate singing and heartfelt testimonies.","translation":"集会はメソジスト的な熱意に満ちており、情熱的な歌と心からの証しがあった。"}],"collocations":["Methodistical preacher","Methodistical church","Methodistical fervor"],"synonyms":["Methodist","devout","pious","zealous"],"antonyms":["unreligious","secular","worldly"]},{"part_of_speech":"adjective","definition":"厳格な、几帳面な、形式ばった","english_definition":"Strictly methodical; excessively formal or precise.","examples":[{"sentence":"His approach to problem-solving was Methodistical, following a rigid set of steps.","translation":"彼の問題解決へのアプローチはメソジスト的で、厳格な手順に従っていた。"},{"sentence":"She criticized his Methodistical adherence to the rules, arguing for more flexibility.","translation":"彼女は彼の規則へのメソジスト的な固執を批判し、より柔軟性を求めた。"}],"collocations":["Methodistical approach","Methodistical adherence","Methodistical precision"],"synonyms":["methodical","systematic","orderly","precise","pedantic"],"antonyms":["unorganized","haphazard","random"]}],"etymology":{"value":"Derived from 'Methodist' + '-ical'. 'Methodist' refers to a member of a Protestant Christian denomination originating in the 18th century. The suffix '-ical' transforms the noun into an adjective.","priority":"★★★"},"pronunciation":{"ipa":"/məˈθɒdɪstɪkəl/","syllables":"me-thod-is-ti-cal"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be used in comparative and superlative forms (more Methodistical, most Methodistical)."},"usage_notes":{"explanation":"The term 'Methodistical' can have two primary connotations. The first relates directly to Methodism, a Protestant Christian denomination. The second, often used more critically, describes an overly strict, methodical, or formal approach to something. The context usually clarifies which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He was a Methodistical.","correct":"He was a Methodist.","note":"'Methodistical' is an adjective; 'Methodist' is the noun referring to a person. "},{"incorrect":"She approached the task in a methodical way, but it wasn't Methodistical.","correct":"She approached the task in a methodical way, but it wasn't necessarily related to Methodism.","note":"'Methodical' and 'Methodistical' are related but not interchangeable. 'Methodical' simply means systematic, while 'Methodistical' implies a connection to Methodism or an overly rigid approach."}],"priority":"★★☆"},"related_words":{"derivatives":["Methodist","Methodism","methodically"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Methodistical' is a relatively uncommon word. It has two main senses: (1) relating to Methodism (a Christian denomination) or (2) excessively methodical or formal. The first sense is straightforward, while the second is often used in a critical way to describe someone who is too rigid or precise in their approach. Understanding the context is essential to interpreting the intended meaning."},"example_sentences":[{"sentence":"The old church had a distinctly Methodistical style of architecture.","translation":"その古い教会は明らかにメソジスト様式の建築様式を持っていた。","type":"adjective","meaning_category":"Relating to Methodism"},{"sentence":"His Methodistical approach to the project left no room for creativity.","translation":"彼のメソジスト的なプロジェクトへの取り組みは、創造性の余地を残さなかった。","type":"adjective","meaning_category":"Excessively methodical"}]}