{"word":"isidium","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"粉状または棒状の無性生殖器官で、地衣類の表面に発生し、植物体から分離して新しい個体になることができる","english_definition":"A powdery or rod-like asexual propagule occurring on the surface of lichens, which can detach from the parent thallus and develop into a new individual.","examples":[{"sentence":"The presence of isidia is a key characteristic in identifying certain lichen species.","translation":"イシジウムの存在は、特定の地衣類種を識別する上で重要な特徴です。"},{"sentence":"Isidia provide a means of vegetative reproduction for lichens.","translation":"イシジウムは地衣類の栄養繁殖の手段を提供します。"}],"collocations":["lichen isidia","granular isidia","corticate isidia"],"synonyms":["propagule","soredium"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'isidion', meaning 'small island'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈsɪdiəm/","syllables":"i-sid-i-um"},"inflection":{"noun_plural":"isidia"},"usage_notes":{"explanation":"Isidia are small, vegetative propagules found on the surface of lichens. They are used for asexual reproduction and dispersal. Their presence, morphology, and distribution are important characteristics for lichen identification.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The isidium is a type of algae.","correct":"✓ The isidium is a reproductive structure of lichens.","note":"Isidia are specific to lichens, which are symbiotic organisms composed of fungi and algae or cyanobacteria, and not a type of algae themselves."}],"priority":"★☆☆"},"related_words":{"derivatives":["isidiate (adjective: having isidia)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Isidium' is a specialized term used in the field of lichenology, referring to a specific type of asexual reproductive structure found on lichens. Understanding this term requires familiarity with lichen biology and reproductive strategies."},"example_sentences":[{"sentence":"This lichen species is characterized by its abundant isidia.","translation":"この地衣類種は、豊富なイシジウムによって特徴付けられます。","type":"general","meaning_category":"description"},{"sentence":"The isidia detach easily from the lichen thallus, facilitating dispersal.","translation":"イシジウムは地衣類の植物体から容易に分離し、分散を促進します。","type":"biological process","meaning_category":"reproduction"}]}