{"word":"quarter-decker","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史的な船の)クォーターデッキを持つ船","english_definition":"A ship with a quarterdeck.","examples":[{"sentence":"The quarter-decker was a common type of warship in the 17th and 18th centuries.","translation":"クォーターデッカーは17世紀と18世紀によく見られた軍艦の一種でした。"}],"collocations":[],"synonyms":["ship","vessel"],"antonyms":[]}],"etymology":{"value":"The term comes from the fact that the ship has a quarterdeck, which is a raised deck at the stern (rear) of the ship, typically covering about a quarter of the ship's length.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkwɔːrtərˌdekər/","syllables":"quar-ter-deck-er"},"inflection":{"noun_plural":"quarter-deckers"},"usage_notes":{"explanation":"The term \"quarter-decker\" is primarily historical and refers to a specific type of sailing ship. It's not commonly used in modern contexts unless discussing naval history.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["quarterdeck"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - primarily used in historical contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'quarter-decker' refers to a specific type of sailing ship from the 17th and 18th centuries, characterized by its quarterdeck. Understanding this term requires knowledge of historical ship design and naval terminology, making it more suitable for advanced learners or those with a specific interest in maritime history."},"example_sentences":[{"sentence":"The museum displayed a detailed model of a quarter-decker, showcasing its unique design.","translation":"博物館にはクォーターデッカーの詳細な模型が展示されており、その独特なデザインを紹介していました。","type":"noun","meaning_category":"historical ship"},{"sentence":"Naval historians studied the blueprints of the quarter-decker to understand its role in past sea battles.","translation":"海軍史家たちは、過去の海戦におけるクォーターデッカーの役割を理解するために、その設計図を研究しました。","type":"noun","meaning_category":"historical ship"}]}