{"word":"Mozarabian","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"モサラベの、モサラベ人に関する","english_definition":"Relating to the Mozarabs, their culture, or their language.","examples":[{"sentence":"Mozarabian art is characterized by a unique blend of Christian and Islamic influences.","translation":"モサラベ美術は、キリスト教とイスラムの影響が独特に融合しているのが特徴です。"},{"sentence":"The Mozarabian dialect preserved many features of Vulgar Latin.","translation":"モサラベ方言は、俗ラテン語の多くの特徴を保持していました。"}],"collocations":["Mozarabian art","Mozarabian architecture","Mozarabian language","Mozarabian culture","Mozarabian community"],"synonyms":["Christian-Arabic","Romance-Arabic"],"antonyms":["Islamic","Moorish"]},{"part_of_speech":"noun","definition":"モサラベ人","english_definition":"A Mozarab; a Christian living under Moorish rule in Spain.","examples":[{"sentence":"The Mozarabians maintained their Christian faith and traditions.","translation":"モサラベ人はキリスト教の信仰と伝統を維持しました。"},{"sentence":"Many Mozarabians eventually migrated to the northern Christian kingdoms.","translation":"多くのモサラベ人は最終的に北部のキリスト教王国に移住しました。"}],"collocations":["Mozarabian community","Mozarabian population"],"synonyms":["Christian under Moorish rule"],"antonyms":["Moor","Muslim"]}],"etymology":{"value":"From Spanish *Mozárabe*, from Arabic مُسْتَعْرَب‎ (mustaʻrab, “Arabized”), passive participle of اِسْتَعْرَبَ‎ (istaʻraba, “to become Arabized”).","priority":"★★★"},"pronunciation":{"ipa":"/ˌmoʊzəˈreɪbiən/","syllables":"Mo-za-ra-bi-an"},"inflection":{"notes":"Adjective: comparative/superlative forms are possible (more Mozarabian, most Mozarabian) but not common. Noun: plural is Mozarabians."},"usage_notes":{"explanation":"The term *Mozarabian* refers specifically to Christians who lived in Al-Andalus (Moorish Iberia) from the 8th to 15th centuries. They retained their Christian faith and some of their own laws and customs, but also adopted elements of Arabic culture and language. The term is often used in historical and art-historical contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Mozarabic culture existed only in North Africa.","correct":"✓ Mozarabic culture existed primarily in Iberia (Spain and Portugal).","note":"Mozarabic culture flourished in Iberia, not North Africa, although there were cultural exchanges between the two regions."},{"incorrect":"✗ Mozarabs were forced to convert to Islam.","correct":"✓ Mozarabs were allowed to practice Christianity, but faced certain restrictions.","note":"Mozarabs were generally allowed to practice their religion, but they were subject to certain taxes and legal limitations."}],"priority":"★★☆"},"related_words":{"derivatives":["Mozarab (noun, adjective)","Mozarabic (adjective, noun)","Mozarabic Rite (noun)"],"phrases":["Al-Andalus","Reconquista"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word *Mozarabian* is a specialized term used in historical and cultural contexts to describe the Christian population living under Muslim rule in medieval Iberia (Spain and Portugal). Understanding this term requires knowledge of Iberian history and the interactions between Christian and Islamic cultures during that period. It is not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The **Mozarabian** churches of Toledo are renowned for their unique architectural style.","translation":"トレドのモサラベ様式の教会は、その独特な建築様式で有名です。","type":"adjective","meaning_category":"relating to Mozarabs"},{"sentence":"The **Mozarabians** played a crucial role in preserving Visigothic traditions.","translation":"モサラベ人は、西ゴート族の伝統を保存する上で重要な役割を果たしました。","type":"noun","meaning_category":"Mozarabs"}]}