{"word":"unassignably","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"割り当てることができないほどに、譲渡できないほどに","english_definition":"In a manner that prevents assignment or transfer; in a way that something cannot be attributed or allocated to a specific person, purpose, or time.","examples":[{"sentence":"The blame for the accident was unassignably spread across multiple factors.","translation":"事故の責任は、複数の要因に割り当てることができないほどに分散していた。"},{"sentence":"The task proved unassignably complex, requiring a team effort rather than individual responsibility.","translation":"その仕事は、割り当てることができないほど複雑であることが判明し、個人の責任ではなくチームでの取り組みが必要となった。"},{"sentence":"The funds were used for general purposes, making it unassignably difficult to track their specific impact.","translation":"資金は一般的な目的で使用されたため、その具体的な影響を追跡することは割り当てることができないほど困難になった。"}],"collocations":["unassignably complex","unassignably difficult","unassignably spread"],"synonyms":["inalienably","nontransferably","irrevocably","indivisibly"],"antonyms":["assignably","transferably","allocably"]}],"etymology":{"value":"Derived from 'unassignable' (not capable of being assigned) + '-ly' (forming an adverb). 'Unassignable' is formed from the prefix 'un-' (not) + 'assignable' (capable of being assigned), which comes from 'assign' (to allocate or attribute) + '-able' (capable of).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌʌnəˈsaɪnəbli/","syllables":"un-as-sign-a-bly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Unassignably' is used to describe situations where it's impossible or extremely difficult to allocate something (like blame, responsibility, or resources) to a specific entity or purpose. It emphasizes the lack of clear attribution or allocation. It is a relatively rare word, often used in formal or technical contexts.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The task was unassignable.","correct":"✓ The task was unassignably complex.","note":"'Unassignable' describes the task itself as not able to be assigned. 'Unassignably complex' describes the degree of complexity making it impossible to assign. The adverb modifies an adjective or verb, not the noun directly."}],"priority":"☆☆☆"},"related_words":{"derivatives":["unassignable (adjective)","assign (verb)","assignable (adjective)","assignment (noun)"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Unassignably' is an advanced adverb used to describe something that cannot be assigned or attributed. It's often used in formal or technical contexts to emphasize the impossibility of allocating responsibility, blame, or resources to a specific entity or purpose. Due to its complexity and specific usage, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The effects of the policy were unassignably intertwined with other economic factors.","translation":"その政策の効果は、他の経済的要因と割り当てることができないほど絡み合っていた。","type":"adverb","meaning_category":"Inability to assign due to entanglement"},{"sentence":"The responsibility for the failure was unassignably distributed among the entire team.","translation":"失敗の責任は、チーム全体に割り当てることができないほど分散していた。","type":"adverb","meaning_category":"Inability to assign due to distribution"},{"sentence":"The origins of the rumor were unassignably lost in the mists of time.","translation":"その噂の起源は、時の霧の中に割り当てることができないほど失われていた。","type":"adverb","meaning_category":"Inability to assign due to obscurity"}]}