{"word":"honorableship","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"名誉職、名誉会員の地位","english_definition":"The state or condition of holding an office or membership conferred as an honor, without the usual duties or responsibilities.","examples":[{"sentence":"He received an honorableship in the society for his contributions to the field.","translation":"彼はその分野への貢献により、学会の名誉会員の地位を授与された。"},{"sentence":"The university offered her an honorableship as a visiting professor.","translation":"大学は彼女に客員教授の名誉職を申し出た。"}],"collocations":["receive an honorableship","offer an honorableship","hold an honorableship"],"synonyms":["honorary position","honorary membership","distinguished position"],"antonyms":["regular position","active membership"]}],"etymology":{"value":"'honorable' + '-ship'. The suffix '-ship' indicates a state, condition, or office. Thus, 'honorableship' refers to the state of holding an honorable position or membership.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɒnərəbəlʃɪp/","syllables":"on-or-a-ble-ship"},"inflection":{"noun_plural":"honorableships"},"usage_notes":{"explanation":"'Honorableship' is a relatively rare word. It specifically denotes a position or membership that is granted as an honor, typically without the usual obligations or responsibilities associated with that role. It is often used in academic, professional, or societal contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has an honorable ship in the company.","correct":"✓ He has an honorableship in the company.","note":"'Honorable ship' refers to a ship that is deserving of honor, whereas 'honorableship' refers to a position held as an honor."}],"priority":"★★☆"},"related_words":{"derivatives":["honorable","honor","honoree","honorary"],"related_concepts":["honorary degree","fellowship","membership"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Honorableship' is a formal and infrequent word referring to the status of holding an honorary position or membership, often in academic or professional organizations. Understanding the word requires familiarity with the concept of honorary roles and the suffix '-ship', which denotes a state or condition.","priority":"★★☆"},"example_sentences":[{"sentence":"The distinguished scientist accepted the honorableship with gratitude.","translation":"その著名な科学者は感謝の念を込めて名誉職を受諾した。","type":"general","meaning_category":"名誉職"},{"sentence":"Her honorableship at the museum allowed her access to special collections.","translation":"彼女の美術館での名誉会員の地位により、特別なコレクションへのアクセスが許可された。","type":"general","meaning_category":"名誉会員の地位"}]}