{"word":"monoclinous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(植物学) 雌雄同花の、両性花の","english_definition":"(botany) having both stamens and pistils in the same flower; hermaphroditic.","examples":[{"sentence":"A monoclinous flower contains both male and female reproductive organs.","translation":"雌雄同花は、雄しべと雌しべの両方の生殖器官を同じ花の中に持っています。"}],"collocations":["monoclinous flower"],"synonyms":["hermaphroditic","bisexual"],"antonyms":["diclinous"]}],"etymology":{"value":"Derived from the Greek words 'monos' (single, one) and 'kline' (bed), referring to the single 'bed' or receptacle holding both male and female reproductive parts.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɒnəˈklaɪnəs/","syllables":"mo-no-cli-nous"},"inflection":{"notes":"Adjective, no specific inflections beyond comparative and superlative forms (more monoclinous, most monoclinous)."},"usage_notes":{"explanation":"The term 'monoclinous' is primarily used in botanical contexts to describe flowers that possess both male (stamens) and female (pistils) reproductive organs within the same floral structure. It is a technical term, not commonly used outside of botany.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The animal is monoclinous.","correct":"✓ The flower is monoclinous.","note":"'Monoclinous' applies to plants, specifically flowers, not animals."}],"priority":"★★☆"},"related_words":{"derivatives":["monocliny (noun): the state of being monoclinous"],"related_terms":["diclinous (adjective): having separate male and female flowers on the same or different plants.","dioecious (adjective): having male and female flowers on separate plants.","monoecious (adjective): having separate male and female flowers on the same plant."],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Technical term, not in CEFR vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Monoclinous' is a highly specialized botanical term. Understanding requires familiarity with plant reproductive biology. The word is rarely encountered outside of academic or technical literature. It describes a specific floral arrangement and is contrasted with other arrangements like diclinous, monoecious, and dioecious.","priority":"★★☆"},"example_sentences":[{"sentence":"Most flowering plants exhibit monoclinous flowers.","translation":"ほとんどの顕花植物は雌雄同花を示します。","type":"definition","meaning_category":"botany"},{"sentence":"The lily is an example of a plant with monoclinous flowers.","translation":"ユリは雌雄同花を持つ植物の例です。","type":"example","meaning_category":"botany"}]}