{"word":"inductions","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"就任、入会、導入、誘導","english_definition":"The action or process of inducting someone to a position or organization; the introduction or initiation of someone into something; the process of deriving general principles from particular instances.","examples":[{"sentence":"The new employees underwent a week of inductions.","translation":"新入社員は1週間の入社式を受けた。"},{"sentence":"The induction of the new members will take place next week.","translation":"新会員の入会式は来週行われる。"},{"sentence":"Mathematical induction is a method of proving statements.","translation":"数学的帰納法は命題を証明する方法の一つである。"},{"sentence":"The company provides a thorough induction program for all new staff.","translation":"会社はすべての新入社員に徹底的な導入プログラムを提供している。"}],"collocations":["induction program","employee induction","mathematical induction","induction ceremony"],"synonyms":["initiation","installation","introduction","orientation","enlistment"],"antonyms":["dismissal","expulsion","exclusion"]},{"part_of_speech":"noun","definition":"電磁誘導","english_definition":"The production of an electromotive force across an electrical conductor in a changing magnetic field.","examples":[{"sentence":"The motor works on the principle of electromagnetic induction.","translation":"そのモーターは電磁誘導の原理で動く。"},{"sentence":"Induction heating is used in many industrial processes.","translation":"誘導加熱は多くの工業プロセスで使用されている。"}],"collocations":["electromagnetic induction","induction heating","induction motor"],"synonyms":["electromagnetic force","magnetic induction"],"antonyms":[]}],"etymology":{"value":"From Latin 'inductio', from 'inducere' meaning 'to lead in'.","priority":"★★★"},"pronunciation":{"ipa":"/ɪnˈdʌkʃənz/","syllables":"in-duc-tions"},"inflection":{"noun_plural":"inductions"},"usage_notes":{"explanation":"'Inductions' is the plural form of 'induction,' which has several meanings. It can refer to the process of formally introducing someone to a new role or organization, often involving training and orientation. It can also refer to the scientific principle of electromagnetic induction, or to mathematical induction, a method of mathematical proof. The specific meaning depends on the context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The induction was very helpful for understand the company.","correct":"✓ The induction was very helpful for understanding the company.","note":"After the preposition 'for,' use the gerund form of the verb (understanding)."},{"incorrect":"✗ He received a good induct.","correct":"✓ He received a good induction.","note":"'Induct' is a verb, while 'induction' is the noun form referring to the process."}],"priority":"★★☆"},"related_words":{"derivatives":["induct (verb)","inductive (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively frequent in technical and formal contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'inductions' refers to the plural form of 'induction,' which can have multiple meanings depending on the context. In a business setting, it often refers to the process of onboarding new employees, including training and orientation. In science, particularly physics, it refers to electromagnetic induction, a process where a changing magnetic field produces an electromotive force. In mathematics, it refers to mathematical induction, a method of proving statements. Understanding the context is crucial to interpreting the meaning of 'inductions' correctly."},"example_sentences":[{"sentence":"All new employees are required to attend the company's inductions.","translation":"すべての新入社員は会社の入社式に参加する必要があります。","type":"noun","meaning_category":"就任、入会、導入"},{"sentence":"The inductions covered company policies and procedures.","translation":"入社式では会社のポリシーと手続きについて説明がありました。","type":"noun","meaning_category":"就任、入会、導入"},{"sentence":"Inductions are a crucial part of the onboarding process.","translation":"入社式はオンボーディングプロセスにおいて重要な部分です。","type":"noun","meaning_category":"就任、入会、導入"},{"sentence":"The experiment demonstrated the principles of electromagnetic inductions.","translation":"その実験は電磁誘導の原理を実証しました。","type":"noun","meaning_category":"電磁誘導"}]}