{"word":"sandy-pated","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"赤毛の、金髪の","english_definition":"Having sandy-colored hair; fair-haired.","examples":[{"sentence":"He was a sandy-pated boy with freckles.","translation":"彼はそばかすのある赤毛の少年だった。"},{"sentence":"The sandy-pated children played on the beach.","translation":"金髪の子供たちがビーチで遊んでいた。"}],"collocations":["sandy-pated youth","sandy-pated child","sandy-pated girl"],"synonyms":["fair-haired","blonde","red-haired"],"antonyms":["dark-haired","brunette"]}],"etymology":{"value":"\"Sandy\" referring to the color of sand, and \"pated\" being an archaic term for \"headed,\" from \"pate\" meaning head.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsændi ˌpeɪtɪd/","syllables":"san-dy-pa-ted"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"The term \"sandy-pated\" is somewhat archaic and literary. It is used to describe someone with hair that is a light, yellowish-brown color, similar to sand. It is not a commonly used word in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was sandy-pated with blue eyes.","correct":"✓ He was sandy-pated and had blue eyes.","note":"The term describes hair color, so it should not be used to describe other features directly."}],"priority":"★☆☆"},"related_words":{"derivatives":["sandy (adjective: resembling sand in color or texture)","pate (noun: head - archaic)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely rare.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Sandy-pated\" is a rare and somewhat archaic term used to describe someone with sandy-colored hair, meaning light yellowish-brown or reddish-brown hair. Due to its rarity, it is not commonly used in modern conversation or writing, and its usage is generally limited to literary or descriptive contexts aiming for a vintage or old-fashioned feel. Understanding the etymology (sandy + pated = headed) can help in deciphering its meaning. It's not a word typically encountered in everyday language learning."},"example_sentences":[{"sentence":"The artist painted a portrait of a sandy-pated maiden.","translation":"その芸術家は赤毛の乙女の肖像画を描いた。","type":"adjective","meaning_category":"赤毛の"},{"sentence":"A sandy-pated toddler toddled along the shore.","translation":"金髪の幼児が海岸をよちよち歩いていた。","type":"adjective","meaning_category":"金髪の"}]}