{"word":"panspermic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"汎精子説の、宇宙播種説の","english_definition":"Relating to or characterized by panspermia, the theory that life originated throughout the universe and was spread to Earth.","examples":[{"sentence":"The panspermic theory suggests that life on Earth may have originated from microorganisms transported from another planet.","translation":"汎精子説は、地球上の生命が他の惑星から運ばれた微生物に由来する可能性を示唆している。"}],"collocations":["panspermic theory","panspermic origin","panspermic hypothesis"],"synonyms":["exogenesis","cosmozoan"],"antonyms":[]}],"etymology":{"value":"From the combination of 'pan-' (all, every) + 'spermic' (relating to sperm or seeds), referring to the idea of seeds of life being spread throughout the universe.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpænˈspɜːrmɪk/","syllables":"pan-sper-mic"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Panspermic' is primarily used in scientific and philosophical contexts when discussing the origin of life. It is directly related to the theory of panspermia, which is not widely accepted but remains a topic of scientific discussion. The term is relatively rare in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The panspermic organisms were visible to the naked eye.","correct":"✓ The panspermic theory suggests that microscopic organisms may have traveled through space.","note":"Panspermia deals with microscopic organisms, not those visible to the naked eye."}],"priority":"★☆☆"},"related_words":{"derivatives":["panspermia (noun): The theory that life originated throughout the universe and was spread to Earth.","panspermism (noun): A belief in panspermia."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'panspermic' is highly specialized and primarily encountered in scientific discussions related to astrobiology and the origin of life. Understanding requires familiarity with the concept of panspermia, making it suitable for advanced learners and those with a background in science."},"example_sentences":[{"sentence":"Some scientists explore the panspermic possibilities for the emergence of life on Earth.","translation":"一部の科学者は、地球上の生命の出現における汎精子説の可能性を探求している。","type":"adjective","meaning_category":"汎精子説の"},{"sentence":"The panspermic hypothesis is one explanation for the ubiquity of certain organic molecules in the universe.","translation":"汎精子説は、宇宙における特定の有機分子の遍在性に対する一つの説明である。","type":"adjective","meaning_category":"宇宙播種説の"}]}