{"word":"Salyer","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A surname.","english_definition":"A surname, likely of occupational or locational origin.","examples":[{"sentence":"Mr. Salyer is the new CEO.","translation":"サリヤー氏が新しいCEOです。"},{"sentence":"Salyer Lake is a popular fishing spot.","translation":"サリヤー湖は人気の釣りスポットです。"}],"collocations":["Salyer family","Salyer Lake","Salyer surname"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Likely derived from a surname of occupational or locational origin. Possibly related to terms for a seller of goods or a place name. Further research needed for a definitive etymology.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈseɪljər/","syllables":"Say-lyer"},"inflection":{"notes":"Proper noun; plural form is Salyers."},"usage_notes":{"explanation":"'Salyer' is primarily used as a surname. It may also appear as part of place names (e.g., Salyer Lake). Its frequency as a given name is very low.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I am going to visit Salyer tomorrow. (Intending to visit Mr. Salyer)","correct":"✓ I am going to visit Mr. Salyer tomorrow.","note":"When referring to a person with the surname Salyer, use the appropriate title (Mr., Ms., Dr., etc.) unless you are on familiar terms."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"variants":[],"related_surnames":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency as a general word, higher frequency within specific communities or regions where the surname is common.","priority":"★☆☆"},"readability_explanation":{"level":"N/A","text":"'Salyer' is a surname and is generally understood within contexts where surnames are used. Its readability depends on familiarity with surnames in general.","priority":"★☆☆"},"example_sentences":[{"sentence":"The Salyer family has lived in this town for generations.","translation":"サリヤー家はこの町に何世代も住んでいます。","type":"noun","meaning_category":"Surname"},{"sentence":"We drove past Salyer Lake on our way to the mountains.","translation":"山に向かう途中、サリヤー湖を通り過ぎました。","type":"noun","meaning_category":"Place name"}]}