{"word":"Goldbar","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"金の延べ棒、金塊","english_definition":"A bar of gold, typically of a standard weight and purity, used as a store of value or in financial transactions.","examples":[{"sentence":"The bank stores goldbars in its vault.","translation":"銀行は金庫に金の延べ棒を保管している。"},{"sentence":"He dreamed of finding a chest full of goldbars.","translation":"彼は金の延べ棒でいっぱいの宝箱を見つけることを夢見た。"}],"collocations":["goldbar vault","goldbar price","invest in goldbars"],"synonyms":["gold ingot","gold bullion","gold brick"],"antonyms":[]}],"etymology":{"value":"Combination of 'gold' (the precious metal) and 'bar' (a solid, elongated block).","priority":"★★☆"},"pronunciation":{"ipa":"ˈɡoʊldbɑːr","syllables":"Gold-bar"},"inflection":{"noun_plural":"goldbars"},"usage_notes":{"explanation":"'Goldbar' specifically refers to a bar-shaped piece of gold, often of a standardized weight and purity. It is commonly used in the context of finance, investment, and precious metal storage.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a gold bar. It was made of chocolate.","correct":"✓ I bought a gold-colored bar. It was made of chocolate.","note":"'Goldbar' implies real gold. If it's gold-colored or made of something else, specify that it's not a real goldbar."}],"priority":"★★☆"},"related_words":{"derivatives":["gold","bar","bullion","ingot"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but understood.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Goldbar' is a compound noun referring to a specific form of gold. It is generally understood in contexts related to finance, investment, or precious metals. While not extremely common in everyday conversation, it is readily understood by most English speakers, especially in discussions about economics or treasure."},"example_sentences":[{"sentence":"The robbers tried to steal the goldbars from the armored truck.","translation":"強盗たちは装甲車から金の延べ棒を盗もうとした。","type":"noun","meaning_category":"金の延べ棒"},{"sentence":"Many investors see goldbars as a safe haven during economic uncertainty.","translation":"多くの投資家は、経済が不安定な時期に金の延べ棒を安全な避難場所と見なしている。","type":"noun","meaning_category":"金の延べ棒"},{"sentence":"The museum displayed a collection of ancient goldbars, recovered from a shipwreck.","translation":"博物館は、難破船から回収された古代の金の延べ棒のコレクションを展示した。","type":"noun","meaning_category":"金の延べ棒"}]}