{"word":"walkability-focused","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"歩きやすさを重視した、歩行者中心の","english_definition":"Designed or planned with a strong emphasis on creating environments that are pedestrian-friendly and easily navigable on foot.","examples":[{"sentence":"The city is implementing walkability-focused urban planning initiatives to reduce reliance on cars.","translation":"その都市は、自動車への依存を減らすために、歩きやすさを重視した都市計画イニシアチブを実施している。"},{"sentence":"Walkability-focused neighborhoods often have higher property values and a greater sense of community.","translation":"歩きやすさを重視した地域は、不動産価値が高く、コミュニティ意識が高いことが多い。"},{"sentence":"The new development will be walkability-focused, with pedestrian-only streets and ample green spaces.","translation":"その新しい開発は、歩行者専用道路と十分な緑地を備えた、歩きやすさを重視したものになるだろう。"}],"collocations":["walkability-focused design","walkability-focused urban planning","walkability-focused neighborhood","walkability-focused community","walkability-focused infrastructure"],"synonyms":["pedestrian-friendly","pedestrian-oriented","walkable","foot-traffic-friendly","human-scaled"],"antonyms":["car-dependent","automobile-oriented","sprawl-inducing"]}],"etymology":{"value":"A compound adjective formed by combining 'walkability' (the quality of being easily walked) with '-focused' (having a particular focus or emphasis).","priority":"N/A"},"pronunciation":{"ipa":"/ˌwɔːkəˈbɪləti ˈfoʊkəst/","syllables":"walk-a-bil-i-ty fo-cused"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Walkability-focused' describes something that is intentionally designed to prioritize the needs and convenience of pedestrians. This often involves features such as sidewalks, crosswalks, bike lanes, public transportation access, mixed-use zoning, and a density of amenities within walking distance. It's often used in the context of urban planning, community development, and transportation policy.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The plan is focus on walkability.","correct":"✓ The plan is focused on walkability. / ✓ The plan is walkability-focused.","note":"'Focused' needs to be in the past participle form or used as part of the compound adjective 'walkability-focused'."}],"priority":"N/A"},"related_words":{"derivatives":["walkability (noun)","focus (verb/noun)"],"phrases":["complete streets","new urbanism","transit-oriented development (TOD)","smart growth"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency, but increasing in use within urban planning and design contexts.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Walkability-focused' is a specialized term used in urban planning and design. It means that something is specifically designed to make it easy and pleasant for people to walk. This often involves creating neighborhoods with shops, restaurants, and other amenities close to where people live, as well as providing safe and convenient infrastructure for pedestrians. The term is used to describe policies, designs, and developments that prioritize walking as a mode of transportation and recreation."},"example_sentences":[{"sentence":"The city's new zoning regulations are designed to promote walkability-focused development.","translation":"その都市の新しいゾーニング規制は、歩きやすさを重視した開発を促進するように設計されている。","type":"adjective","meaning_category":"urban planning"},{"sentence":"The walkability-focused design of the neighborhood encourages residents to walk or bike for errands.","translation":"その地域の歩きやすさを重視した設計は、住民が用事を足すために徒歩や自転車を利用することを奨励する。","type":"adjective","meaning_category":"urban design"},{"sentence":"Investing in walkability-focused infrastructure can improve public health and reduce traffic congestion.","translation":"歩きやすさを重視したインフラに投資することで、公衆衛生を改善し、交通渋滞を緩和することができる。","type":"adjective","meaning_category":"urban infrastructure"}]}