{"word":"pseudosatirical","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"偽の風刺的な、風刺を装った","english_definition":"Appearing to be satirical but lacking genuine satirical intent or effect; falsely or superficially satirical.","examples":[{"sentence":"The article was pseudosatirical, using the trappings of satire without any real bite.","translation":"その記事は偽の風刺的であり、真の痛烈さのない風刺の装いを使用していた。"},{"sentence":"His pseudosatirical comments were more offensive than funny.","translation":"彼の風刺を装ったコメントは、面白おかしいというより不快だった。"},{"sentence":"The play was criticized for being pseudosatirical, as it lacked any real social commentary.","translation":"その劇は、真の社会批評を欠いているため、風刺を装っていると批判された。"}],"collocations":["pseudosatirical article","pseudosatirical commentary","pseudosatirical tone","pseudosatirical approach","pseudosatirical website"],"synonyms":["mock-satirical","quasi-satirical","ostensibly satirical","purportedly satirical","superficially satirical"],"antonyms":["genuinely satirical","truly satirical","actually satirical","authentically satirical"]}],"etymology":{"value":"The word \"pseudosatirical\" is formed by combining the prefix \"pseudo-\" (meaning false or pretending) with the adjective \"satirical\" (relating to satire).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsjuːdoʊsəˈtɪrɪkəl/","syllables":"pseu-do-sa-tir-i-cal"},"inflection":{"notes":"This is an adjective, so it has comparative and superlative forms (more pseudosatirical, most pseudosatirical), but they are rarely used."},"usage_notes":{"explanation":"'Pseudosatirical' is used to describe something that appears to be satire but lacks the key elements that make satire effective, such as wit, irony, or social commentary. It often comes across as simply offensive or poorly executed. It's used to critique works that attempt satire but fail to deliver a meaningful or humorous critique.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The comedian was pseudosatirical, everyone laughed.","correct":"✓ The comedian was satirical, everyone laughed.","note":"If the comedian was genuinely funny and making a point, 'satirical' is more appropriate. 'Pseudosatirical' implies a failure to achieve genuine satire."},{"incorrect":"✗ This is a pseudosatirical painting of a flower.","correct":"✓ This is a satirical painting of a flower.","note":"Satire typically targets social or political issues, so unless the flower painting is making a commentary on something larger, 'satirical' is unlikely to be the right word. A painting of a flower is unlikely to be pseudosatirical."}],"priority":"★☆☆"},"related_words":{"derivatives":["pseudosatire (noun): false or superficial satire"],"related_terms":["parody","spoof","lampoon","caricature","travesty"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pseudosatirical' is a complex word used to describe something that pretends to be satire but isn't very good at it. It's like a joke that falls flat or a criticism that doesn't really make a point. If something is genuinely funny and insightful, it's just 'satirical.' 'Pseudosatirical' is used when the attempt at satire fails.","priority":"★☆☆"},"example_sentences":[{"sentence":"The blog post was labeled pseudosatirical because it simply mocked people without offering any real criticism.","translation":"そのブログ記事は、現実的な批判を提示せずに人々を嘲笑しただけだったので、風刺を装っていると見なされた。","type":"adjective","meaning_category":"偽の風刺的な"},{"sentence":"The movie's pseudosatirical take on politics was more confusing than funny.","translation":"その映画の政治に対する風刺を装った解釈は、面白おかしいというより混乱を招いた。","type":"adjective","meaning_category":"風刺を装った"},{"sentence":"Many critics found the comedian's routine to be pseudosatirical, lacking the cleverness and insight of true satire.","translation":"多くの批評家は、そのコメディアンのルーチンが真の風刺の巧妙さと洞察力を欠いているため、風刺を装っていると判断した。","type":"adjective","meaning_category":"偽の風刺的な"}]}