{"word":"Holyhead","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ホーリーヘッド：ウェールズの北西端にある町、およびアングルシー島にある港町","english_definition":"A town and major port in Anglesey, Wales, situated on Holy Island. It is a major ferry port for Ireland.","examples":[{"sentence":"We took the ferry from Holyhead to Dublin.","translation":"私たちはホーリーヘッドからダブリンまでフェリーに乗った。"},{"sentence":"Holyhead is the largest town in Anglesey.","translation":"ホーリーヘッドはアングルシー島で最大の町です。"}],"collocations":["Holyhead ferry","Holyhead port","Holyhead to Dublin"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Holyhead' is derived from the Welsh name 'Caergybi', meaning 'Cybi's fort'. Cybi was a 6th-century Welsh saint who founded a monastery there. The English name refers to the religious significance of the area.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɒliˈhɛd/","syllables":"Ho-ly-head"},"inflection":{},"usage_notes":{"explanation":"Holyhead is primarily known as a major ferry port connecting Wales to Ireland, particularly Dublin. It is also a town with historical significance, including ancient Roman remains and connections to Welsh saints. The town is a popular stop for travelers heading to or from Ireland.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"related_places":["Anglesey","Wales","Dublin","Ireland"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. It is a place name, so its use is limited to specific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Holyhead' refers to a specific location, a town and port in Wales. Understanding its significance requires some geographical knowledge of the UK and its connections to Ireland. It's often encountered in the context of travel and transportation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The train from London terminates at Holyhead.","translation":"ロンドンからの列車はホーリーヘッドが終点です。","type":"general","meaning_category":"location"},{"sentence":"Many people pass through Holyhead on their way to Ireland.","translation":"多くの人々がアイルランドへ向かう途中でホーリーヘッドを経由します。","type":"general","meaning_category":"location"}]}