{"word":"slanderously","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"中傷的に、誹謗的に、名誉毀損的に","english_definition":"in a manner involving false and malicious statements or charges that damage someone's reputation.","examples":[{"sentence":"The article slanderously accused him of corruption.","translation":"その記事は彼を中傷的に汚職で告発した。"},{"sentence":"He was slanderously portrayed in the documentary.","translation":"彼はそのドキュメンタリーで中傷的に描かれた。"},{"sentence":"She was slanderously attacked in the press.","translation":"彼女はマスコミで中傷的に攻撃された。"}],"collocations":["slanderously accuse","slanderously portray","slanderously attack","slanderously defame"],"synonyms":["libelously","defamatorily","maliciously","pejoratively","disparagingly"],"antonyms":["respectfully","accurately","truthfully","fairly"]}],"etymology":{"value":"The word 'slanderously' is derived from 'slanderous', which comes from 'slander'. 'Slander' originates from the Anglo-French 'esclandre', meaning 'scandal', which in turn comes from the Latin 'scandalum', meaning 'cause of offense, stumbling block'. The suffix '-ly' transforms the adjective into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈslændərəsli/","syllables":"slan-der-ous-ly"},"inflection":{"notes":"This is an adverb, so it does not have different forms for gender or number."},"usage_notes":{"explanation":"'Slanderously' is used to describe actions or statements that are falsely and maliciously damaging to someone's reputation. It implies an intent to harm through untrue claims. It is often used in legal contexts or when discussing media portrayals.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He slanderously wrote a book.","correct":"✓ He slanderously accused her in the book.","note":"'Slanderously' modifies the verb, indicating the manner of the action. It's more accurate to say someone 'slanderously accused' rather than 'slanderously wrote'."},{"incorrect":"✗ The slanderously is wrong.","correct":"✓ The slander is wrong.","note":"'Slanderously' is an adverb. The noun form 'slander' should be used as the subject."}],"priority":"★★☆"},"related_words":{"derivatives":["slander (noun): the action or crime of making a false spoken statement damaging to a person's reputation.","slander (verb): to make false and damaging statements about (someone).","slanderous (adjective): containing or constituting slander."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'slanderously' is an adverb that describes actions done in a way that spreads false and harmful information about someone. It's a more advanced word related to the legal concept of slander, which is spoken defamation. Because it's a more formal and specific term, it's not as commonly used in everyday conversation. Understanding this word helps in analyzing texts that discuss legal matters, media, or ethical behavior.","priority":"★★☆"},"example_sentences":[{"sentence":"The newspaper slanderously reported that she had embezzled funds.","translation":"その新聞は彼女が資金を横領したと中傷的に報道した。","type":"general","meaning_category":"中傷的に報道する"},{"sentence":"He was slanderously accused of being a traitor.","translation":"彼は中傷的に裏切り者だと告発された。","type":"general","meaning_category":"中傷的に告発する"},{"sentence":"The politician slanderously attacked his opponent's character.","translation":"その政治家は中傷的に対立候補の人格を攻撃した。","type":"general","meaning_category":"中傷的に攻撃する"}]}