{"word":"unpopularly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"不人気に、評判が悪く、一般に受け入れられずに","english_definition":"in a way that is not popular or widely liked; in a manner that lacks favor or approval.","examples":[{"sentence":"The government's decision was unpopularly received by the public.","translation":"政府の決定は国民に不評だった。"},{"sentence":"He expressed his views, unpopularly, to the committee.","translation":"彼は委員会に、評判の悪いことに、自分の意見を表明した。"},{"sentence":"The measure was unpopularly implemented, leading to widespread protests.","translation":"その措置は不人気なやり方で実施され、広範囲にわたる抗議につながった。"}],"collocations":["unpopularly received","unpopularly implemented","unpopularly viewed","unpopularly perceived","unpopularly supported"],"synonyms":["disfavorably","disagreeably","unacceptably","negatively","adversely"],"antonyms":["popularly","favorably","agreeably","acceptably","positively"]}],"etymology":{"value":"\"un-\" (not) + \"popularly\" (in a popular manner). Formed by adding the prefix \"un-\" to the adverb \"popularly\".","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈpɒpjʊləli/","syllables":"un-pop-u-lar-ly"},"inflection":{"notes":"Adverb, no inflections."},"usage_notes":{"explanation":"\"**unpopularly**\" is an adverb that describes the manner in which something is done or received. It indicates that an action, decision, or idea is not well-liked or widely accepted. It often implies that there is opposition or disapproval associated with the subject. It is used to modify verbs, adjectives, or other adverbs, providing context about the lack of popularity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The decision was unpopular.","correct":"✓ The decision was unpopularly received.","note":"\"unpopular\" is an adjective describing the decision itself, whereas \"unpopularly received\" describes how the decision was received by others."},{"incorrect":"✗ He acted unpopularly.","correct":"✓ He acted in an unpopular manner.","note":"While \"unpopularly\" can modify verbs, it's often clearer to use \"in an unpopular manner\" or a similar phrase to avoid ambiguity."}],"priority":"★★☆"},"related_words":{"derivatives":["unpopular (adjective: not liked or approved of by many people)","popularity (noun: the state of being liked, admired, or supported by many people)","popular (adjective: liked or admired by many people or by a particular person or group)","popularly (adverb: in a manner that is liked or admired by many people)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"**unpopularly**\" means \"in a way that is not liked by many people.\" It's used to describe how something is done or received when it's not well-liked. For example, \"The new policy was **unpopularly** implemented\" means that the way the new policy was put into place was not liked by many people. It's not a very common word, so you'll mostly find it in more formal writing or speech."},"example_sentences":[{"sentence":"The reforms were **unpopularly** introduced, leading to widespread discontent.","translation":"改革は不人気な形で導入され、広範な不満につながった。","type":"adverb","meaning_category":"不人気に"},{"sentence":"He voiced his concerns, **unpopularly**, at the meeting.","translation":"彼は会議で、評判の悪いことに、懸念を表明した。","type":"adverb","meaning_category":"評判が悪く"},{"sentence":"The proposal was **unpopularly** viewed by the majority of the committee members.","translation":"その提案は、委員会メンバーの大多数から不評だった。","type":"adverb","meaning_category":"一般に受け入れられずに"}]}