{"word":"NDIS","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"National Disability Insurance Scheme (オーストラリアの障害者保険制度)","english_definition":"The National Disability Insurance Scheme is an Australian government scheme that provides funding for people with disabilities.","examples":[{"sentence":"The NDIS provides support for people with a wide range of disabilities.","translation":"NDISは、幅広い障害を持つ人々に支援を提供します。"},{"sentence":"She receives funding through the NDIS to help with her daily living expenses.","translation":"彼女は日常生活費を支援するためにNDISを通じて資金を受け取っています。"},{"sentence":"The NDIS aims to give people with disabilities more choice and control over their lives.","translation":"NDISは、障害を持つ人々に、より多くの選択肢と生活のコントロールを与えることを目的としています。"}],"collocations":["NDIS funding (NDIS資金)","NDIS plan (NDISプラン)","NDIS participant (NDIS参加者)","NDIS support (NDIS支援)","access the NDIS (NDISにアクセスする)","apply for the NDIS (NDISに申し込む)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"An acronym for National Disability Insurance Scheme.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛnˌdiːˈaɪˌɛs/","syllables":"en-dee-eye-es"},"inflection":{"notes":"It is a noun, so it has no inflection."},"usage_notes":{"explanation":"NDIS is an acronym that refers specifically to the Australian government's National Disability Insurance Scheme. It is used in contexts related to disability support, funding, and services in Australia.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am on the NDIS.","correct":"✓ I am an NDIS participant. / ✓ I receive NDIS funding.","note":"While 'on the NDIS' is sometimes used informally, it is more accurate to say 'I am an NDIS participant' or 'I receive NDIS funding' to describe your involvement with the scheme."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"acronyms":["LAC (Local Area Coordinator)","SIL (Supported Independent Living)","SDA (Specialist Disability Accommodation)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively frequent in Australian contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"NDIS is an acronym for the National Disability Insurance Scheme in Australia. This scheme provides funding and support to Australians with disabilities. The term is commonly used in discussions about disability services, government policy, and individual support plans within Australia. Understanding this term is essential for anyone involved in or researching disability-related issues in Australia."},"example_sentences":[{"sentence":"The NDIS has significantly improved the lives of many Australians with disabilities.","translation":"NDISは、多くの障害を持つオーストラリア人の生活を大幅に改善しました。","type":"general","meaning_category":"General statement about the scheme."},{"sentence":"To access NDIS funding, you need to meet certain eligibility criteria.","translation":"NDIS資金にアクセスするには、特定の資格基準を満たす必要があります。","type":"eligibility","meaning_category":"Eligibility requirements for the scheme."},{"sentence":"Her NDIS plan includes funding for therapy and assistive technology.","translation":"彼女のNDISプランには、セラピーと支援技術のための資金が含まれています。","type":"support","meaning_category":"Types of support provided by the scheme."}]}