{"word":"Fairydom","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"妖精の世界、妖精の国","english_definition":"The realm or world of fairies.","examples":[{"sentence":"She imagined herself transported to Fairydom, a land of magic and wonder.","translation":"彼女は自分が妖精の国に運ばれ、魔法と驚異の土地にいるところを想像した。"},{"sentence":"The stories spoke of a hidden entrance to Fairydom, accessible only to those with pure hearts.","translation":"物語は、純粋な心を持つ者だけがアクセスできる、妖精の国への隠された入り口について語っていた。"}],"collocations":["enter Fairydom","visit Fairydom","the magic of Fairydom","a creature of Fairydom"],"synonyms":["fairyland","elfland","faerie","the Otherworld"],"antonyms":["the mortal world","reality"]},{"part_of_speech":"noun","definition":"妖精の社会、妖精の支配","english_definition":"The collective fairies; the rule or dominion of fairies.","examples":[{"sentence":"Fairydom was governed by a wise and benevolent queen.","translation":"妖精の国は、賢明で慈悲深い女王によって統治されていた。"},{"sentence":"The customs and traditions of Fairydom were ancient and mysterious.","translation":"妖精の国の慣習と伝統は、古代から続く神秘的なものだった。"}],"collocations":["the queen of Fairydom","the laws of Fairydom","the inhabitants of Fairydom","the society of Fairydom"],"synonyms":["fairy society","fairy realm","fairy kingdom"],"antonyms":["human society","mankind"]}],"etymology":{"value":"'Fairy' + '-dom'. 'Fairy' comes from Old French 'faerie', meaning enchantment or the land of fairies. '-dom' is a suffix denoting a state, condition, or dominion.","priority":"★★★"},"pronunciation":{"ipa":"ˈfeəridəm","syllables":"fair-y-dom"},"inflection":{"noun_plural":"Fairydoms"},"usage_notes":{"explanation":"'Fairydom' refers to the world where fairies live, their society, or their rule. It's often used in fantasy literature and storytelling. It can evoke a sense of magic, wonder, and the supernatural.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I want to go to fairy's dom.","correct":"✓ I want to go to Fairydom.","note":"'Fairydom' is a single word, not a possessive form. Using 'fairy's dom' is grammatically incorrect in this context."},{"incorrect":"✗ Fairydom is a real country.","correct":"✓ Fairydom is a fictional world.","note":"Fairydom is a product of imagination and folklore, not a real place."}],"priority":"★★☆"},"related_words":{"derivatives":["fairy","faerie","fairyland","elfland"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency. Primarily found in fantasy literature and related contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Fairydom' is a relatively uncommon word, primarily used in the context of fantasy literature, folklore, and storytelling. It refers to the realm or society of fairies. Understanding the word requires familiarity with the concept of fairies and the suffix '-dom', which denotes a state or dominion. Its usage is generally limited to imaginative or literary contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The princess dreamed of escaping her mundane life and finding a portal to Fairydom.","translation":"王女は、平凡な生活から抜け出し、妖精の国への入り口を見つけることを夢見ていた。","type":"general","meaning_category":"妖精の世界"},{"sentence":"The wise old wizard warned them of the dangers that lurked within Fairydom.","translation":"賢明な老魔法使いは、妖精の国に潜む危険について彼らに警告した。","type":"general","meaning_category":"妖精の世界"},{"sentence":"The queen ruled Fairydom with grace and wisdom, ensuring peace and prosperity for all her subjects.","translation":"女王は優雅さと知恵をもって妖精の国を統治し、すべての臣民に平和と繁栄を保証した。","type":"general","meaning_category":"妖精の支配"}]}