{"word":"deviant","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(規範から)逸脱した、常軌を逸した、変態的な","english_definition":"departing from accepted standards; not normal or usual; (of a person or their behavior) differing from what is considered acceptable in society; sexually perverted.","examples":[{"sentence":"deviant behavior","translation":"逸脱した行動"},{"sentence":"a deviant personality","translation":"常軌を逸した性格"},{"sentence":"He was considered a deviant by his conservative neighbors.","translation":"彼は保守的な隣人たちから変人扱いされた。"},{"sentence":"deviant sexual practices","translation":"異常な性的行為"}],"collocations":["deviant behavior","deviant personality","deviant sexual practices","deviant art"],"synonyms":["abnormal","anomalous","atypical","irregular","unconventional","perverted","kinky","idiosyncratic","eccentric","outlandish","wayward","nonconformist"],"antonyms":["normal","conventional","typical","standard","orthodox"]},{"part_of_speech":"noun","definition":"(規範から)逸脱した人、変人、変態","english_definition":"a person or thing that deviates from accepted standards; a person whose behavior differs from what is considered acceptable in society; a sexually perverted person.","examples":[{"sentence":"He was labeled as a deviant by society.","translation":"彼は社会から逸脱者として烙印を押された。"},{"sentence":"The study examined the characteristics of deviants.","translation":"その研究は逸脱者の特徴を調べた。"},{"sentence":"She was ostracized for being a deviant.","translation":"彼女は逸脱者として排斥された。"}],"collocations":["social deviant","sexual deviant"],"synonyms":["aberrant","nonconformist","eccentric","oddball","misfit","outcast","pervert","degenerate"],"antonyms":["conformist","mainstreamer"]}],"etymology":{"value":"From the verb deviate, which comes from Late Latin deviare, from de- 'away from' + via 'way'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdiːviənt/","syllables":"dee-vi-ant"},"inflection":{"noun_plural":"deviants"},"usage_notes":{"explanation":"The term 'deviant' can be considered offensive depending on the context and how it is used. It is often used to describe behavior or individuals that are considered outside the norm of societal expectations. When discussing sensitive topics, it is important to use respectful and appropriate language.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a deviant of the rules.","correct":"✓ He is deviant from the rules. / ✓ He is deviating from the rules.","note":"When using 'deviant' as an adjective to describe something departing from a standard, use 'deviant from'. Alternatively, use the verb 'deviating' to describe the action of departing from the rules."},{"incorrect":"✗ The deviant is good.","correct":"✓ The deviant is not good. / ✓ Deviance is not good.","note":"'Deviant' often carries a negative connotation, so using it in a positive context without further explanation can be confusing or misleading. If you intend to convey something positive, consider using a different word that emphasizes individuality or nonconformity in a positive light."}],"priority":"★★☆"},"related_words":{"derivatives":["deviance (noun): the fact or state of departing from usual or accepted standards, especially in social or sexual behavior.","deviate (verb): depart from an established course or accepted standard.","deviation (noun): the action of departing from an established course or accepted standard."],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, used in specific contexts such as sociology, psychology, and criminology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'deviant' is used to describe something or someone that goes against what is considered normal or acceptable in society. It's often used in discussions about social norms, behavior, and psychology. Because it can have negative connotations, it's important to use it carefully and be aware of the context. The word is more common in academic or specialized discussions rather than everyday conversation."},"example_sentences":[{"sentence":"The sociologist studied deviant behavior in urban communities.","translation":"その社会学者は都市コミュニティにおける逸脱行動を研究した。","type":"adjective","meaning_category":"逸脱した"},{"sentence":"He was considered a social deviant because of his unconventional lifestyle.","translation":"彼は型破りなライフスタイルが原因で、社会の逸脱者とみなされた。","type":"noun","meaning_category":"逸脱者"},{"sentence":"The artist's work was seen as deviant and controversial.","translation":"その芸術家の作品は、逸脱的で物議を醸すと見なされた。","type":"adjective","meaning_category":"常軌を逸した"},{"sentence":"The study explored the causes of deviance in adolescents.","translation":"その研究は、青年期の逸脱の原因を探求した。","type":"noun (as deviance)","meaning_category":"逸脱"}]}