{"word":"dough-face","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(米俗語, 軽蔑的) 北部出身で、南部の奴隷制度擁護政策を支持する人","english_definition":"(US, slang, derogatory) A Northerner who sympathized with the South during the period leading up to the Civil War.","examples":[{"sentence":"The term 'dough-face' was used to criticize politicians who seemed to prioritize Southern interests over those of the North.","translation":"「dough-face」という言葉は、北部の利益よりも南部の利益を優先しているように見える政治家を批判するために使われた。"},{"sentence":"Some historians argue that the dough-faces were motivated by a desire to preserve the Union at all costs.","translation":"一部の歴史家は、dough-faceたちは何としても連邦を維持したいという願望に動機づけられていたと主張している。"}],"collocations":["accuse someone of being a dough-face","dough-face politician","dough-face policy"],"synonyms":["appeaser","sympathizer"],"antonyms":["abolitionist","radical"],"notes":"This term is highly derogatory and specific to a historical context in the United States."}],"etymology":{"value":"The term 'dough-face' likely originated from the idea that such individuals were easily molded or shaped by Southern interests, like dough.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdoʊˌfeɪs/","syllables":"dough-face"},"inflection":{"noun_plural":"dough-faces"},"usage_notes":{"explanation":"The term 'dough-face' is a historical and derogatory term used in the United States during the period leading up to the Civil War. It referred to Northerners who were seen as sympathetic to the Southern cause, particularly the institution of slavery. The term implies a lack of conviction or backbone, suggesting that these individuals were easily swayed by Southern interests. It is important to note that this term is offensive and should be used with caution, if at all.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a dough-face because he liked bread.","correct":"✓ He was accused of being a dough-face because he supported the Kansas-Nebraska Act.","note":"The term has nothing to do with liking bread; it's about political alignment during a specific historical period."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["Copperhead (similar but broader term for Northerners opposed to the Civil War)","fire-eater (Southern extremist advocating for secession)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency; primarily found in historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dough-face' is a highly specific and historical term, primarily encountered in the context of pre-Civil War United States history. Understanding its meaning requires knowledge of the political climate of that era and the tensions surrounding slavery. It is not a commonly used term in modern English and carries a strong negative connotation."},"example_sentences":[{"sentence":"Senator Douglas was often labeled a 'dough-face' due to his stance on popular sovereignty.","translation":"ダグラス上院議員は、人民主権に対する彼の立場から、「dough-face」とよく呼ばれた。","type":"example","meaning_category":"Historical Context"},{"sentence":"The 'dough-faces' in Congress played a crucial role in the passage of several controversial laws.","translation":"議会の「dough-face」たちは、いくつかの物議を醸す法律の可決に重要な役割を果たした。","type":"example","meaning_category":"Historical Context"}]}