{"word":"pentagrid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(無線)五極管、ペンタグリッド","english_definition":"An electron tube with five grids, used especially as a mixer in superheterodyne radio receivers.","examples":[{"sentence":"The pentagrid converter is a type of vacuum tube used in radio receivers.","translation":"ペンタグリッドコンバーターは、ラジオ受信機で使用される真空管の一種です。"},{"sentence":"The pentagrid mixer offers good performance in superheterodyne circuits.","translation":"ペンタグリッドミキサーは、スーパーヘテロダイン回路で優れた性能を発揮します。"}],"collocations":["pentagrid converter","pentagrid mixer","pentagrid tube"],"synonyms":["converter tube","mixer tube"],"antonyms":[]}],"etymology":{"value":"'Penta-' (five) + 'grid' (referring to the grids within the tube).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɛntəˌɡrɪd/","syllables":"pen-ta-grid"},"inflection":{"noun_plural":"pentagrids"},"usage_notes":{"explanation":"The term 'pentagrid' is primarily used in the context of electronics and radio technology. It refers to a specific type of vacuum tube that was commonly used in older radio receivers. While still relevant for understanding historical electronics, it is less commonly encountered in modern technology due to the prevalence of solid-state devices.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pentagrid is a type of transistor.","correct":"✓ The pentagrid is a type of vacuum tube.","note":"A pentagrid is a vacuum tube, not a transistor."}],"priority":"★★☆"},"related_words":{"derivatives":["heptode (similar tube with seven electrodes)","octode (similar tube with eight electrodes)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pentagrid' is a technical term used in electronics, specifically referring to a type of vacuum tube with five grids. Understanding this term requires some background knowledge in electronics and radio technology. It is not commonly used in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The **pentagrid** oscillator is a key component in the superheterodyne receiver.","translation":"ペンタグリッド発振器は、スーパーヘテロダイン受信機の重要なコンポーネントです。","type":"noun","meaning_category":"(無線)五極管"},{"sentence":"The **pentagrid** tube allows for both oscillation and mixing within a single device.","translation":"ペンタグリッド管を使用すると、1つのデバイス内で発振と混合の両方を行うことができます。","type":"noun","meaning_category":"(無線)五極管"}]}