{"word":"jaghiredar","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史) ジャーギール制におけるジャーギール（土地）の保有者、封建領主","english_definition":"(historical) the holder of a jaghir (land grant) in the jaghir system, a type of feudal land grant in South Asia.","examples":[{"sentence":"The jaghiredar was responsible for collecting taxes from the peasants in his jaghir.","translation":"ジャーギールダーは、自分のジャーギール内の農民から税を徴収する責任があった。"},{"sentence":"The power of the jaghiredars varied depending on the size and importance of their jaghirs.","translation":"ジャーギールダーの権力は、彼らのジャーギールの規模と重要性によって異なっていた。"}],"collocations":["jagir system","land grant","feudal lord","tax collection"],"synonyms":["landholder","feudal tenant","zamindar (related but not identical)"],"antonyms":["peasant","tenant farmer"]}],"etymology":{"value":"From Persian 'jagirdar' (جاگیردار), meaning 'holder of a jagir'. 'Jagir' (جاگیر) means 'place-holding', 'fief', or 'land grant', and 'dar' (دار) means 'holder' or 'possessor'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdʒɑːɡɪərˈdɑːr/","syllables":"ja-ghir-e-dar"},"inflection":{"noun_plural":"jaghiredars"},"usage_notes":{"explanation":"'Jaghiredar' is a historical term specifically related to the jaghir system, which was prevalent in the Mughal Empire and other parts of South Asia. The jaghiredar was granted control over a piece of land (jagir) and was responsible for collecting revenue and maintaining order in that area. The system was similar to feudalism in Europe.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a jaghiredar in the modern Indian government.","correct":"✓ The jaghiredar system was abolished after Indian independence.","note":"The jaghir system and the term 'jaghiredar' are historical and no longer exist in modern governments."}],"priority":"★★☆"},"related_words":{"derivatives":["jagir (noun: the land grant itself)"],"related_terms":["zamindar (a similar but distinct type of landholder)","mansabdar (an official in the Mughal administration, sometimes also a jaghiredar)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily used in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'jaghiredar' is a specialized historical term referring to a landholder in the jaghir system of South Asia, particularly during the Mughal Empire. Understanding the term requires knowledge of South Asian history and feudal systems. It is not commonly used in modern contexts.","domain":"History"},"example_sentences":[{"sentence":"The jaghiredar maintained a small army to enforce his authority within his jaghir.","translation":"そのジャーギールダーは、自分のジャーギール内で権力を維持するために小さな軍隊を維持していた。","type":"noun","meaning_category":"historical landholder"},{"sentence":"The peasants resented the jaghiredar's heavy taxes.","translation":"農民たちはジャーギールダーの重税を恨んでいた。","type":"noun","meaning_category":"historical landholder"}]}