{"word":"blepharophryplasty","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(形成外科)眉毛下切開術：上眼瞼のたるみと眉毛下垂を同時に改善する手術","english_definition":"(plastic surgery) A surgical procedure to improve the appearance of the upper eyelids and eyebrows, often involving the removal of excess skin and fat.","examples":[{"sentence":"The patient underwent blepharophryplasty to correct drooping eyelids and raise the eyebrows.","translation":"患者は、まぶたのたるみと眉毛の引き上げを修正するために、眉毛下切開術を受けた。"}],"collocations":["undergo blepharophryplasty (眉毛下切開術を受ける)","blepharophryplasty surgery (眉毛下切開術)"],"synonyms":["eyelid lift","brow lift"],"antonyms":[]}],"etymology":{"value":"'blepharo-' (まぶた) + '-phry-' (眉毛) + '-plasty' (形成術) から構成される。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌblefəroʊˈfrɪplæsti/","syllables":"ble-pha-ro-phry-plas-ty"},"inflection":{"noun_plural":"blepharophryplasties"},"usage_notes":{"explanation":"Blepharophryplasty is a cosmetic surgery procedure that addresses both the upper eyelids and eyebrows. It's often performed to reduce sagging skin and improve the overall appearance of the upper face.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm considering a blepharoplasty for my eyebrows.","correct":"✓ I'm considering a blepharophryplasty for my eyebrows.","note":"Blepharoplasty typically refers to eyelid surgery, while blepharophryplasty addresses both eyelids and eyebrows."}],"priority":"★☆☆"},"related_words":{"derivatives":["blepharoplasty (眼瞼形成術)","browplasty (眉形成術)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Blepharophryplasty' is a highly specialized term used in the field of plastic surgery. It refers to a specific procedure that combines elements of both eyelid surgery (blepharoplasty) and brow lift (browplasty) to achieve a comprehensive rejuvenation of the upper facial area. Due to its technical nature, it is primarily encountered in medical contexts or discussions related to cosmetic surgery."},"example_sentences":[{"sentence":"The surgeon recommended blepharophryplasty to address both the patient's hooded eyelids and low-set eyebrows.","translation":"外科医は、患者の覆いかぶさったまぶたと低い位置の眉毛の両方を改善するために、眉毛下切開術を推奨した。","type":"noun","meaning_category":"cosmetic surgery procedure"}]}