{"word":"partialist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"偏見を持つ人、不公平な人、部分的な見方をする人","english_definition":"A person who is biased, unfair, or takes a limited or incomplete view of something.","examples":[{"sentence":"He was accused of being a partialist in the dispute, favoring one side over the other.","translation":"彼は紛争において偏見を持っていると非難され、一方の側を他方よりも優遇した。"},{"sentence":"A true judge should not be a partialist, but rather impartial and objective.","translation":"真の裁判官は偏見を持つべきではなく、公平かつ客観的であるべきだ。"}],"collocations":["a known partialist","an avowed partialist","a rank partialist"],"synonyms":["biased person","partisan","favoritist","prejudiced person","sectarian"],"antonyms":["impartialist","fair-minded person","objective person","unbiased person"]},{"part_of_speech":"adjective","definition":"偏見のある、不公平な、部分的な見方をする","english_definition":"Having or showing bias or prejudice; taking a limited or incomplete view.","examples":[{"sentence":"The report was criticized for being partialist and failing to consider all perspectives.","translation":"その報告書は、偏見があり、すべての視点を考慮していないとして批判された。"},{"sentence":"A partialist approach to the problem will not lead to a satisfactory solution.","translation":"問題に対する部分的な見方では、満足のいく解決策にはつながらないだろう。"}],"collocations":["partialist view","partialist approach","partialist attitude"],"synonyms":["biased","prejudiced","partisan","unfair","one-sided"],"antonyms":["impartial","unbiased","objective","fair-minded"]}],"etymology":{"value":"The word 'partialist' is derived from 'partial' (meaning biased or incomplete) with the suffix '-ist' (indicating a person who adheres to or practices something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɑːrʃəlɪst/","syllables":"par-tial-ist"},"inflection":{"noun_plural":"partialists"},"usage_notes":{"explanation":"'Partialist' is used to describe someone who shows favoritism or bias towards a particular person, group, or viewpoint. It can also refer to someone who only considers a limited aspect of a situation, neglecting other important factors. The term often carries a negative connotation, implying a lack of fairness or objectivity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a partialist to chocolate ice cream.","correct":"He is partial to chocolate ice cream.","note":"When expressing a preference, use 'partial to' rather than 'a partialist to'."},{"incorrect":"The partialist report was well-received.","correct":"The biased report was not well-received.","note":"Using 'biased' or 'prejudiced' might be clearer and more common than 'partialist' in many contexts."}],"priority":"★★☆"},"related_words":{"derivatives":["partiality (noun: bias, favoritism)","partial (adjective: biased, incomplete)"],"antonyms":["impartiality (noun: fairness, objectivity)","impartial (adjective: unbiased, fair)"],"related":["partisan (noun/adjective: a strong supporter of a party, cause, or person)","sectarian (adjective: narrowly confined to a particular group)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Partialist' is a relatively uncommon word used to describe someone who is biased or takes a one-sided view. It is more formal and less frequently used than words like 'biased' or 'prejudiced'. Understanding the word requires a good grasp of abstract concepts like fairness, objectivity, and perspective. It's often used in discussions about politics, law, or ethics, where impartiality is expected but not always achieved."},"example_sentences":[{"sentence":"The historian was criticized for being a partialist, focusing only on the achievements of one particular leader.","translation":"その歴史家は、偏見を持っており、特定の指導者の業績のみに焦点を当てているとして批判された。","type":"noun","meaning_category":"偏見を持つ人"},{"sentence":"The media outlet was accused of taking a partialist stance on the issue.","translation":"そのメディアは、その問題について偏った立場を取っていると非難された。","type":"adjective","meaning_category":"偏見のある"}]}