{"word":"Skookum-house","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Historical) A type of prison or jail, particularly one associated with Indigenous populations in the Pacific Northwest.","english_definition":"(Historical) A type of prison or jail, particularly one associated with Indigenous populations in the Pacific Northwest.","examples":[{"sentence":"The Skookum-house was a place of fear and injustice for many Indigenous people.","translation":"スクーカム・ハウスは、多くの先住民にとって恐怖と不正義の場所でした。"}],"collocations":["Skookum-house prison","Skookum-house jail"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Combination of \"skookum\" (Chinook Jargon for strong, powerful, or impressive) and \"house\". The name likely reflects the perceived strength or imposing nature of these institutions.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskuːkəmˌhaʊs/","syllables":"skoo-kum-house"},"inflection":{"noun_plural":"Skookum-houses"},"usage_notes":{"explanation":"The term \"Skookum-house\" is primarily historical and carries strong negative connotations due to the often unjust treatment of Indigenous people within these institutions. It's important to use this term with sensitivity and awareness of its historical context.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["skookum (adjective)"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term \"Skookum-house\" is a historical term referring to a type of prison or jail, particularly one associated with Indigenous populations in the Pacific Northwest. The term is derived from Chinook Jargon, a trade language used in the region. Due to its historical context and association with injustice, it is important to use this term with sensitivity and awareness."},"example_sentences":[{"sentence":"The history of the Skookum-house reveals a dark chapter in the treatment of Indigenous communities.","translation":"スクーカム・ハウスの歴史は、先住民コミュニティの扱いにおける暗い章を明らかにしています。","type":"noun","meaning_category":"prison/jail"}]}