{"word":"nonsyntactically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"非統語的に、統語論的に正しくない方法で","english_definition":"in a manner that is not syntactically correct; not following the rules of syntax.","examples":[{"sentence":"The sentence was nonsyntactically constructed, making it difficult to understand.","translation":"その文は非統語的に構成されており、理解するのが困難だった。"},{"sentence":"The data was processed nonsyntactically, leading to errors in the analysis.","translation":"データは非統語的に処理され、分析に誤りが生じた。"}],"collocations":["used to describe text or data processing","often used in technical or academic contexts"],"synonyms":["agrammatically","incorrectly","illogically"],"antonyms":["syntactically","grammatically","logically"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to 'syntactically'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn.sɪnˈtæktɪkli/","syllables":"non-syn-tac-ti-cal-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Nonsyntactically' is used to describe something that does not adhere to the rules of syntax, often in the context of language or data processing. It implies a deviation from the expected grammatical structure.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The code was nonsyntactically, causing the program to crash.","correct":"✓ The code was nonsyntactically written, causing the program to crash.","note":"'Nonsyntactically' is an adverb and should modify a verb or adjective, not stand alone as an adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["syntax","syntactic","syntactically"],"related_terms":["semantics","grammar","morphology"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Nonsyntactically' is a technical term primarily used in linguistics, computer science, and related fields. It describes something that violates the rules of syntax, which are the rules governing the structure of sentences and phrases. This word is not commonly used in everyday language and is more likely to be encountered in academic or technical writing."},"example_sentences":[{"sentence":"The input string was nonsyntactically valid, and the parser rejected it.","translation":"入力文字列は非統語的に有効でなかったため、パーサーはそれを拒否した。","type":"adverb","meaning_category":"非統語的に"},{"sentence":"The data was stored nonsyntactically, which made querying it difficult.","translation":"データは非統語的に保存されており、クエリが困難になった。","type":"adverb","meaning_category":"非統語的に"}]}