{"word":"unhardihood","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"臆病、意気地なし、不活発","english_definition":"lack of courage and vigor; cowardice; inactivity.","examples":[{"sentence":"His unhardihood prevented him from taking risks.","translation":"彼の臆病さのために、彼はリスクを冒すことができなかった。"},{"sentence":"The unhardihood of the team led to their defeat.","translation":"チームの意気地なしが敗北につながった。"}],"collocations":["display unhardihood (臆病さを示す)","suffer from unhardihood (意気地なしに苦しむ)"],"synonyms":["cowardice","timidity","pusillanimity","lack of courage","inaction","passivity"],"antonyms":["courage","bravery","valor","hardihood","activity","vigor"]}],"etymology":{"value":"\"Unhardihood\" is formed from the prefix \"un-\" (meaning 'not'), the word \"hardihood\" (meaning 'boldness, daring'), and the suffix \"-hood\" (denoting a state or condition). Thus, it literally means 'the state of not having hardihood'.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈhɑːrdiˌhʊd/","syllables":"un-har-di-hood"},"inflection":{"noun_plural":"unhardihoods (rarely used in plural)"},"usage_notes":{"explanation":"\"Unhardihood\" is a somewhat archaic and uncommon word. It is the opposite of \"hardihood,\" which means courage and robustness. \"Unhardihood\" describes a state of lacking these qualities, often implying a deficiency in courage or vigor.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed great unhardihood in the face of danger.","correct":"✓ He showed great hardihood in the face of danger.","note":"\"Unhardihood\" means lack of courage, so the opposite should be used to describe bravery. Use \"hardihood\" instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["hardihood (noun: courage, boldness)","hardy (adjective: robust, capable of enduring difficult conditions)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency. The word is rarely used in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"unhardihood\" is a rare and somewhat archaic term that means a lack of courage, vigor, or boldness. It is formed by adding the prefix \"un-\" (meaning 'not') to \"hardihood,\" which itself is not a commonly used word. Due to its rarity and the relative unfamiliarity of its root word, \"unhardihood\" is considered a high-level vocabulary word. It's more likely to be encountered in older literature or specialized contexts."},"example_sentences":[{"sentence":"The knight's reputation was tarnished by his display of unhardihood during the battle.","translation":"騎士の名声は、戦いでの彼の臆病さによって汚された。","type":"noun","meaning_category":"lack of courage"},{"sentence":"The explorer's unhardihood prevented him from venturing further into the unknown territory.","translation":"探検家の意気地なしのために、彼は未知の領域への冒険を断念した。","type":"noun","meaning_category":"lack of vigor"}]}