{"word":"nonriparian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(土地や地域が)河岸にない、河畔に位置しない","english_definition":"Not located on or relating to the bank of a river or stream.","examples":[{"sentence":"The nonriparian areas of the county rely on groundwater for their water supply.","translation":"その郡の河岸にない地域は、水の供給を地下水に頼っている。"},{"sentence":"Nonriparian landowners do not have the same water rights as those who own land along the river.","translation":"河畔の土地を所有する人々と異なり、河岸にない土地の所有者は同じ水利権を持たない。"}],"collocations":["nonriparian land","nonriparian area","nonriparian rights"],"synonyms":["upland","inland"],"antonyms":["riparian"],"notes":"Often used in legal and environmental contexts to describe land or rights related to water access."}],"etymology":{"value":"Formed from the prefix 'non-' (meaning 'not') and 'riparian' (relating to a riverbank).","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnrɪˈpeəriən/","syllables":"non-ri-par-i-an"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"'Nonriparian' is a term primarily used in legal and environmental discussions concerning water rights and land use. It distinguishes areas or properties that are not adjacent to a body of water (typically a river or stream) from those that are. This distinction is important because riparian rights, which govern water access and usage, typically apply only to riparian landowners.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The riparian zone is nonriparian.","correct":"✓ The area away from the river is nonriparian.","note":"The riparian zone is, by definition, riparian. Nonriparian refers to areas not adjacent to the water source."}],"priority":"★★☆"},"related_words":{"derivatives":["riparian","riparianism"],"related_terms":["water rights","land use","hydrology","watershed"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Specialized vocabulary used in specific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nonriparian' is a specialized term used in legal and environmental contexts. It describes land or areas that are not located along the banks of a river or stream. Understanding this term is important for comprehending discussions related to water rights, land use regulations, and environmental management in areas where water resources are a key issue. It is the opposite of 'riparian,' which refers to land adjacent to a water source."},"example_sentences":[{"sentence":"The irrigation system serves both riparian and **nonriparian** farms in the valley.","translation":"その灌漑システムは、谷の河畔と河岸にない両方の農場にサービスを提供している。","type":"adjective","meaning_category":"河岸にない"},{"sentence":"**Nonriparian** water rights are often subject to different regulations than riparian rights.","translation":"河岸にない水利権は、河畔の水利権とは異なる規制を受けることが多い。","type":"adjective","meaning_category":"河岸にない"}]}