{"word":"defilement","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"汚染、冒涜、不浄にすること","english_definition":"The act of making something impure or unclean; pollution; desecration.","examples":[{"sentence":"The defilement of the temple was considered a grave sin.","translation":"神殿の汚染は重大な罪とみなされた。"},{"sentence":"The river suffered defilement from industrial waste.","translation":"その川は産業廃棄物による汚染を受けた。"},{"sentence":"He was accused of the defilement of a sacred site.","translation":"彼は聖地の冒涜で告発された。"}],"collocations":["environmental defilement (環境汚染)","moral defilement (道徳的堕落)","religious defilement (宗教的冒涜)","spiritual defilement (精神的汚染)"],"synonyms":["pollution","desecration","contamination","violation","profanation","tainting"],"antonyms":["purification","sanctification","cleansing"]}],"etymology":{"value":"Derived from the Middle English word 'defilen', which comes from the Old French 'defouler' meaning 'to trample on, violate'. Ultimately from Latin 'de-' (down, away) + 'fullo' (to clean cloth, trample).","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈfaɪlmənt/","syllables":"de-file-ment"},"inflection":{"noun_plural":"defilements"},"usage_notes":{"explanation":"'Defilement' is a formal term that refers to the act of making something impure, either physically or morally. It often carries a strong negative connotation, particularly when referring to the desecration of something sacred or the pollution of the environment. It is less commonly used in everyday conversation compared to words like 'pollution' or 'contamination'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The defilement of the air is a big problem.","correct":"✓ The pollution of the air is a big problem.","note":"'Pollution' is a more common and natural way to describe the contamination of air. 'Defilement' is more often used for sacred or moral contexts."},{"incorrect":"✗ He committed a defilement.","correct":"✓ He committed an act of defilement.","note":"'Defilement' is a noun that refers to the act itself. To describe a specific instance, use 'an act of defilement'."}],"priority":"★☆☆"},"related_words":{"derivatives":["defile (verb: to make impure or unclean)","defiled (adjective: made impure or unclean)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency"},"readability_explanation":{"level":"C1","text":"The word 'defilement' is a formal and somewhat rare word. It means the act of making something dirty, impure, or morally wrong, especially something that is considered holy or respected. It's often used in discussions about environmental damage, religious desecration, or moral corruption. You might encounter it in academic texts, legal documents, or news reports about serious offenses."},"example_sentences":[{"sentence":"The archaeological site suffered irreversible defilement due to looting.","translation":"その遺跡は略奪により不可逆的な汚染を受けた。","type":"noun","meaning_category":"汚染・冒涜"},{"sentence":"The defilement of the environment is a serious concern for future generations.","translation":"環境の汚染は将来の世代にとって深刻な懸念事項である。","type":"noun","meaning_category":"汚染"},{"sentence":"The book detailed the defilement of the ancient burial grounds.","translation":"その本は古代の埋葬地の冒涜について詳しく記述していた。","type":"noun","meaning_category":"冒涜"}]}