{"word":"Al-Quran","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(イスラム教)クルアーン、コーラン","english_definition":"(Islam) The central religious text of Islam, believed by Muslims to be the word of God (Allah), revealed to the Prophet Muhammad through the angel Gabriel.","examples":[{"sentence":"Muslims consider the Al-Quran to be the literal word of God.","translation":"イスラム教徒は、アル・クルアーンを神の言葉そのものだと考えています。"},{"sentence":"The Al-Quran is divided into chapters called surahs.","translation":"アル・クルアーンは、スーラと呼ばれる章に分かれています。"},{"sentence":"He spends hours each day reading the Al-Quran.","translation":"彼は毎日何時間もアル・クルアーンを読んでいます。"}],"collocations":["read the Al-Quran (アル・クルアーンを読む)","study the Al-Quran (アル・クルアーンを研究する)","memorize the Al-Quran (アル・クルアーンを暗記する)","recite the Al-Quran (アル・クルアーンを朗読する)"],"synonyms":["Quran","Koran","The Quran","The Holy Quran","The Noble Quran"],"antonyms":[]}],"etymology":{"value":"From Arabic الْقُرْآن‎ (al-qurʾān), meaning 'the recitation'.","priority":"★★★"},"pronunciation":{"ipa":"/æl kʊˈrɑːn/","syllables":"Al-Qu-ran"},"inflection":{"noun_plural":"None (considered a singular, unique text)"},"usage_notes":{"explanation":"'Al-Quran' is the most accurate and respectful way to refer to the Islamic holy book. While 'Quran' and 'Koran' are also used, 'Al-Quran' specifically includes the Arabic definite article 'al-', signifying 'the'. It is considered the direct word of God as revealed to Prophet Muhammad. The term is almost exclusively used in religious or academic contexts related to Islam.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I read a Quran.","correct":"✓ I read the Al-Quran.","note":"Since it is a specific text, it is usually preceded by the definite article 'the' (or 'Al-' in 'Al-Quran')."},{"incorrect":"✗ The Al-Quran are...","correct":"✓ The Al-Quran is...","note":"'Al-Quran' refers to a single book, so it takes a singular verb."}],"priority":"★★☆"},"related_words":{"derivatives":["Quranic (adjective: relating to the Quran)","Qari (noun: a person who recites the Quran)","Surah (noun: a chapter of the Quran)","Ayah (noun: a verse of the Quran)"],"phrases":["Hafiz (a person who has memorized the entire Quran)","Tafsir (exegesis or commentary on the Quran)","Tajwid (rules for proper pronunciation during recitation of the Quran)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Religious Term)","frequency_google_ngram":"Moderate (in religious and academic contexts)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Al-Quran' is a religious term referring to the central text of Islam. Understanding its significance requires familiarity with Islamic culture and beliefs. The text is considered by Muslims to be the direct word of God. The term is primarily used in religious, academic, and cultural contexts related to Islam. Correct usage requires understanding its singular nature and the importance of using the definite article."},"example_sentences":[{"sentence":"The Imam recited verses from the Al-Quran during the prayer.","translation":"イマームは祈りの際にアル・クルアーンの節を朗読しました。","type":"noun","meaning_category":"Religious Text"},{"sentence":"Many scholars have dedicated their lives to the study of the Al-Quran.","translation":"多くの学者がアル・クルアーンの研究に生涯を捧げています。","type":"noun","meaning_category":"Religious Text"},{"sentence":"The teachings of the Al-Quran guide Muslims in all aspects of life.","translation":"アル・クルアーンの教えは、生活のあらゆる面でイスラム教徒を導きます。","type":"noun","meaning_category":"Religious Text"}]}