{"word":"defiant-gazed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"反抗的な視線を向けている、挑戦的な眼差しの","english_definition":"Having a gaze that shows defiance; looking rebellious or challenging.","examples":[{"sentence":"The prisoner stood defiant-gazed before the judge, refusing to answer any questions.","translation":"囚人は裁判官の前に反抗的な視線を向けて立ち、質問に一切答えようとしなかった。"},{"sentence":"With a defiant-gazed stare, she challenged his authority.","translation":"挑戦的な眼差しで、彼女は彼の権威に異議を唱えた。"},{"sentence":"The child, defiant-gazed, refused to apologize for his actions.","translation":"その子供は反抗的な視線を向けて、自分の行動について謝罪することを拒否した。"}],"collocations":["defiant-gazed stare (反抗的な視線)","defiant-gazed look (反抗的な表情)","defiant-gazed expression (反抗的な表現)"],"synonyms":["rebellious-looking","challenging-eyed","insubordinate-gazed","mutinous-eyed","unruly-gazed"],"antonyms":["submissive-gazed","compliant-looking","obedient-eyed","docile-gazed","meek-looking"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'defiant' (showing resistance or opposition) and 'gazed' (having a particular way of looking). It describes someone whose gaze or look expresses defiance.","priority":"☆☆☆"},"pronunciation":{"ipa":"/dɪˈfaɪənt ˈɡeɪzd/","syllables":"de-fi-ant-gazed"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have plural forms or comparative/superlative degrees."},"usage_notes":{"explanation":"'Defiant-gazed' is a descriptive adjective used to characterize someone's look or stare as expressing defiance or resistance. It is often used in literature or descriptive writing to convey a character's rebellious attitude or unwillingness to submit to authority.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He defiant-gazed at me.","correct":"✓ He gazed at me with a defiant look.","note":"'Defiant-gazed' is an adjective and should be used to describe a noun (e.g., 'defiant-gazed look'). It cannot be used as a verb."},{"incorrect":"✗ She was very defiant-gazed.","correct":"✓ She had a defiant-gazed expression.","note":"Avoid using adverbs like 'very' to modify 'defiant-gazed.' Instead, focus on using it to describe a specific noun."}],"priority":"☆☆☆"},"related_words":{"derivatives":["defiant (adjective)","defiance (noun)","gaze (noun/verb)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A (This is a less common compound adjective)","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Defiant-gazed' is a compound adjective that combines the concepts of 'defiant' (showing resistance or opposition) and 'gaze' (a steady look). It is used to describe someone whose look or stare expresses defiance. This term is more likely to be found in descriptive writing or literature to convey a character's rebellious attitude. Understanding the individual components ('defiant' and 'gazed') helps in grasping the meaning of the compound adjective."},"example_sentences":[{"sentence":"The rebel soldier stood before the general, his face set in a defiant-gazed mask.","translation":"反逆兵は将軍の前に立ち、顔は反抗的な視線をたたえた仮面のように固まっていた。","type":"adjective","meaning_category":"反抗的な視線を向けている"},{"sentence":"Her defiant-gazed expression dared him to challenge her again.","translation":"彼女の挑戦的な眼差しの表情は、彼に再び異議を唱える勇気があるのかと挑んでいるようだった。","type":"adjective","meaning_category":"挑戦的な眼差しの"},{"sentence":"Despite the threats, the activist remained defiant-gazed, refusing to back down from her cause.","translation":"脅迫にもかかわらず、活動家は反抗的な視線を崩さず、自分の主張から退くことを拒否した。","type":"adjective","meaning_category":"反抗的な視線を向けている"}]}