{"word":"syphilis","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"梅毒","english_definition":"a chronic infectious disease caused by the bacterium Treponema pallidum, usually transmitted by sexual contact but sometimes congenital (acquired in utero).","examples":[{"sentence":"Syphilis is a sexually transmitted infection.","translation":"梅毒は性感染症です。"},{"sentence":"Early detection and treatment of syphilis are crucial.","translation":"梅毒の早期発見と治療が重要です。"},{"sentence":"Congenital syphilis can cause serious health problems in newborns.","translation":"先天梅毒は新生児に深刻な健康問題を引き起こす可能性があります。"}],"collocations":["contract syphilis (梅毒に感染する)","treat syphilis (梅毒を治療する)","congenital syphilis (先天梅毒)","primary syphilis (第一期梅毒)","secondary syphilis (第二期梅毒)","latent syphilis (潜在性梅毒)","tertiary syphilis (第三期梅毒)"],"synonyms":["lues"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin poem 'Syphilis sive Morbus Gallicus' (1530) by Girolamo Fracastoro, in which Syphilus is the name of a shepherd who is punished with the disease by the gods. The poem describes a disease, then thought to have originated in the Americas, that was spreading through Europe.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɪfɪlɪs/","syllables":"sif-i-lis"},"inflection":{"noun_plural":"syphilises (rarely used)"},"usage_notes":{"explanation":"Syphilis is a sexually transmitted infection (STI) caused by the bacterium Treponema pallidum. It can also be transmitted from a mother to her baby during pregnancy (congenital syphilis). The disease progresses in stages (primary, secondary, latent, and tertiary), each with different symptoms. Early diagnosis and treatment with antibiotics are essential to prevent serious complications. Due to its potentially severe health consequences, syphilis is a significant public health concern.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a syphilis.","correct":"✓ I have syphilis.","note":"Syphilis is an uncountable noun, so it does not take an indefinite article ('a' or 'an')."},{"incorrect":"✗ Syphilis is caused by a virus.","correct":"✓ Syphilis is caused by a bacterium.","note":"Syphilis is caused by the bacterium Treponema pallidum, not a virus."}],"priority":"★★☆"},"related_words":{"derivatives":["syphilitic (adjective: relating to or affected by syphilis)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but important in medical and public health contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Syphilis' is a medical term referring to a sexually transmitted infection caused by a bacterium. It's important to understand that this is a serious disease that requires medical attention. The word itself is not commonly used in everyday conversation but is important in medical and public health contexts. Understanding the term is crucial for discussions about sexual health and disease prevention."},"example_sentences":[{"sentence":"He tested positive for **syphilis** during a routine screening.","translation":"彼は定期検査で梅毒の陽性反応が出た。","type":"noun","meaning_category":"disease"},{"sentence":"Untreated **syphilis** can lead to severe neurological problems.","translation":"未治療の梅毒は重度の神経学的問題を引き起こす可能性がある。","type":"noun","meaning_category":"disease"},{"sentence":"The doctor explained the treatment options for **syphilis**.","translation":"医師は梅毒の治療選択肢について説明した。","type":"noun","meaning_category":"disease"}]}