{"word":"edger","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(庭仕事用の)縁切り機、エッジャー","english_definition":"a tool or machine used for trimming the edges of a lawn or garden bed.","examples":[{"sentence":"He used the edger to create a clean line between the lawn and the flower bed.","translation":"彼はエッジャーを使って、芝生と花壇の間にきれいな線を作った。"},{"sentence":"The electric edger made quick work of trimming the edges of the yard.","translation":"電動エッジャーのおかげで、庭の縁のトリミングがすぐに終わった。"}],"collocations":["lawn edger","electric edger","gas-powered edger","trim the edges with an edger"],"synonyms":["lawn trimmer","edge trimmer"],"antonyms":[]},{"part_of_speech":"noun","definition":"(スキー板などの)エッジを研ぐ人、エッジ調整師","english_definition":"a person who sharpens or adjusts the edges of skis, snowboards, or other similar equipment.","examples":[{"sentence":"The ski edger at the shop gave my skis a razor-sharp edge.","translation":"店にいるスキーのエッジ調整師が、私のスキー板のエッジをカミソリのように研いでくれた。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(製材業で)木材の端を切り落とす人、または機械","english_definition":"a person or machine that trims the edges of lumber in a sawmill.","examples":[{"sentence":"The edger operator carefully aligned the boards before making the cuts.","translation":"エッジャーのオペレーターは、切断する前に慎重に板を並べた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the word \"edge\" + the suffix \"-er\" (denoting a person or thing that performs the action).","priority":"★★★"},"pronunciation":{"ipa":"/ˈɛdʒər/","syllables":"edg-er"},"inflection":{"noun_plural":"edgers"},"usage_notes":{"explanation":"The term \"edger\" generally refers to a tool or machine used to create or maintain edges, most commonly in landscaping. It can also refer to a person who works with edges in specific industries like ski maintenance or lumber processing. The specific meaning depends on the context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used the edge to trim the lawn.","correct":"✓ I used the edger to trim the lawn.","note":"\"Edge\" refers to the border or boundary, while \"edger\" is the tool used for trimming edges."}],"priority":"★★☆"},"related_words":{"derivatives":["edge","edging"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word \"edger\" has specialized meanings related to tools or people working with edges. The most common usage is in the context of gardening, referring to a tool used to trim the edges of lawns or garden beds. Other meanings are more specific to industries like ski maintenance or lumber processing. Understanding the context is crucial for interpreting the intended meaning of \"edger.\""},"example_sentences":[{"sentence":"The gardener used a power **edger** to create a sharp border along the sidewalk.","translation":"庭師は電動エッジャーを使って、歩道沿いにくっきりとした境界線を作った。","type":"noun","meaning_category":"縁切り機"},{"sentence":"The ski technician is a skilled **edger**, ensuring optimal performance on the slopes.","translation":"そのスキー技術者は熟練したエッジ調整師で、ゲレンデでの最高のパフォーマンスを保証している。","type":"noun","meaning_category":"エッジ調整師"},{"sentence":"The **edger** in the sawmill carefully trimmed the rough edges of the freshly cut lumber.","translation":"製材所の木材端切り係は、切りたての木材の荒い端を注意深く切り落とした。","type":"noun","meaning_category":"木材の端を切り落とす人"}]}