{"word":"tectite","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"テクタイト（隕石の衝突によって生成された天然ガラス）","english_definition":"A natural glass formed from terrestrial debris ejected during meteorite impacts.","examples":[{"sentence":"Tektites are often found in strewn fields.","translation":"テクタイトはしばしば散布地で見つかる。"},{"sentence":"The origin of tektites is linked to meteorite impact events.","translation":"テクタイトの起源は隕石の衝突現象と関連付けられている。"}],"collocations":["strewn field","impact crater","natural glass"],"synonyms":["impactite","obsidian-like glass"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'tektos' meaning 'molten'.","priority":"★★★"},"pronunciation":{"ipa":"ˈtɛktaɪt","syllables":"tek-tite"},"inflection":{"noun_plural":"tectites"},"usage_notes":{"explanation":"Tektites are small, glassy objects that are thought to have formed from terrestrial material ejected during meteorite impacts. They are often found in specific regions called strewn fields, which are areas where tektites are distributed.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Tectites are extraterrestrial rocks.","correct":"✓ Tektites are terrestrial rocks formed by meteorite impacts.","note":"Tektites are made from Earth rocks melted by meteorite impacts, not from the meteorite itself."}],"priority":"★★☆"},"related_words":{"derivatives":["microtektite"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Tektites are natural glass objects formed from terrestrial debris ejected during meteorite impacts. They are often found in strewn fields and are studied to understand impact events on Earth. The term is relatively specialized and primarily used in geology and planetary science contexts."},"example_sentences":[{"sentence":"The chemical composition of the tektite matched the local soil.","translation":"そのテクタイトの化学組成は、現地の土壌と一致した。","type":"scientific","meaning_category":"geology"},{"sentence":"Researchers analyzed the tektite to determine the age of the impact event.","translation":"研究者たちは、その衝突現象の年代を特定するためにテクタイトを分析した。","type":"scientific","meaning_category":"geology"}]}