{"word":"FICO scores","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"A credit score developed by Fair Isaac Corporation (FICO) used by lenders to assess the creditworthiness of borrowers.","english_definition":"A type of credit score created by the Fair Isaac Corporation (FICO). Lenders use it to evaluate a borrower's credit risk.","examples":[{"sentence":"A good FICO score can help you get a lower interest rate on a loan.","translation":"良いFICOスコアは、ローンのより低い金利を得るのに役立ちます。"},{"sentence":"Checking your FICO score regularly can help you monitor your credit health.","translation":"定期的にFICOスコアを確認することは、あなたの信用状態を監視するのに役立ちます。"},{"sentence":"Lenders use FICO scores to determine whether to approve a loan application.","translation":"貸し手はFICOスコアを使用して、ローン申請を承認するかどうかを判断します。"}],"collocations":["improve FICO score","check FICO score","high FICO score","low FICO score","FICO score range"],"synonyms":["credit score"],"antonyms":["bad credit history"]}],"etymology":{"value":"Derived from the Fair Isaac Corporation, the company that developed the scoring model.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfaɪkoʊ skɔrz/","syllables":"Fi-co scores"},"inflection":{"noun_plural":"N/A (already plural)"},"usage_notes":{"explanation":"FICO scores are widely used in the United States to assess credit risk. They range from 300 to 850, with higher scores indicating lower credit risk. These scores are based on various factors, including payment history, amounts owed, length of credit history, credit mix, and new credit.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a FICO score of 900.","correct":"✓ FICO scores range from 300 to 850.","note":"FICO scores do not go above 850."},{"incorrect":"✗ My FICO score is not important.","correct":"✓ Your FICO score is very important for obtaining credit.","note":"FICO scores are crucial for getting loans and credit cards."}],"priority":"★★☆"},"related_words":{"derivatives":["credit report","credit history","credit rating","Fair Isaac Corporation"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively common in financial contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"FICO scores are a numerical representation of your creditworthiness, calculated by the Fair Isaac Corporation. Lenders use these scores to decide whether to give you a loan or credit card and at what interest rate. A higher FICO score means you're seen as a lower risk, which can lead to better loan terms. It's important to monitor your FICO score to ensure accuracy and maintain good credit health. Factors like payment history and debt levels significantly influence your score."},"example_sentences":[{"sentence":"Improving your FICO scores can help you qualify for better interest rates on mortgages.","translation":"FICOスコアを改善すると、住宅ローンのより良い金利を得るのに役立ちます。","type":"general","meaning_category":"credit score"},{"sentence":"Many factors influence your FICO scores, including payment history and credit utilization.","translation":"支払い履歴や信用利用率など、多くの要因がFICOスコアに影響を与えます。","type":"general","meaning_category":"credit score"},{"sentence":"Check your FICO scores regularly to monitor your credit health.","translation":"信用状態を監視するために、定期的にFICOスコアを確認してください。","type":"general","meaning_category":"credit score"}]}