{"word":"mesodic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(音楽)中音域の、中間的な音域の","english_definition":"Relating to or having a middle range; pertaining to the middle part of a scale or range of sounds.","examples":[{"sentence":"The mesodic range of the singer's voice was particularly strong.","translation":"その歌手の声の中音域は特に力強かった。"},{"sentence":"The composer focused on the mesodic elements of the melody.","translation":"作曲家は旋律の中音域の要素に焦点を当てた。"}],"collocations":["mesodic range","mesodic voice","mesodic melody"],"synonyms":["middle","median","intermediate"],"antonyms":["high","low"]}],"etymology":{"value":"Derived from the Greek words 'mesos' meaning 'middle' and 'ode' meaning 'song' or 'melody'.","priority":"★★★"},"pronunciation":{"ipa":"/mɛˈsɒdɪk/","syllables":"me-sod-ic"},"inflection":{"notes":"Comparative and superlative forms are 'more mesodic' and 'most mesodic', respectively, as it's a descriptive adjective."},"usage_notes":{"explanation":"'Mesodic' is a relatively rare term, primarily used in musical contexts to describe elements related to the middle range of pitch or sound. It is often used to specify the part of a melody or a singer's vocal range that lies in the middle register.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The mesodic temperature of the room was comfortable.","correct":"✓ The moderate temperature of the room was comfortable.","note":"'Mesodic' is specific to musical contexts and should not be used to describe general middle ranges or averages. Use 'moderate' or 'average' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["mesode (noun: a middle part or section, especially in a Greek chorus)"],"phrases":["mesodic scale","mesodic register"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency. Specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mesodic' is a specialized term used in music theory and analysis. It refers to the middle range or register of a voice or instrument. Understanding this term requires familiarity with musical terminology and concepts related to pitch and range. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The flute carried the mesodic line while the bassoon provided the lower register.","translation":"フルートが中音域の旋律を奏で、ファゴットが低音域を提供した。","type":"adjective","meaning_category":"音楽"},{"sentence":"Her mesodic voice was well-suited for the ballad.","translation":"彼女の中音域の声はバラードによく合っていた。","type":"adjective","meaning_category":"音楽"}]}