{"word":"unrecessively","priority":"N/A","meanings":[{"part_of_speech":"adverb","definition":"In a manner that is not recessive; without being recessive.","english_definition":"In a manner that does not exhibit recessive traits or characteristics.","examples":[{"sentence":"The gene was expressed unrecessively, meaning its trait was visible even with only one copy.","translation":"その遺伝子は非劣性的に発現し、つまり、その形質はコピーが1つしかない場合でも目に見えた。"}],"collocations":["expressed unrecessively","inherited unrecessively"],"synonyms":["dominantly","non-recessively"],"antonyms":["recessively"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to 'recessively'. 'Recessively' is derived from 'recessive', which describes a genetic trait that is expressed only when two copies of the gene are present.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnrɪˈsɛsɪvli/","syllables":"un-re-ces-sive-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Unrecessively' is primarily used in the context of genetics to describe how a gene is expressed. It indicates that the trait associated with the gene is visible or expressed even when only one copy of the gene is present in an organism's genome. This is in contrast to recessive traits, which require two copies of the gene to be expressed.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The disease is unrecessively inherited, so carriers are unaffected.","correct":"✓ The disease is dominantly inherited, so carriers are affected.","note":"If carriers are affected, the inheritance is dominant, not unrecessive. 'Unrecessively' describes the manner of expression, not the inheritance pattern."}],"priority":"★★☆"},"related_words":{"derivatives":["unrecessive (adjective)","recessive (adjective)","recessively (adverb)","dominance (noun)"],"related_terms":["dominant","gene","allele","phenotype","genotype"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unrecessively' is a technical term primarily used in genetics. It describes the manner in which a gene's trait is expressed, specifically when the trait is visible even with only one copy of the gene present. This term is typically encountered in advanced scientific literature or discussions related to genetics and inheritance patterns."},"example_sentences":[{"sentence":"The mutation was expressed unrecessively, leading to a visible change in the organism's phenotype.","translation":"その突然変異は非劣性的に発現し、生物の表現型に目に見える変化をもたらした。","type":"adverb","meaning_category":"genetics"},{"sentence":"Because the trait is inherited unrecessively, affected individuals typically have at least one affected parent.","translation":"その形質は非劣性的に遺伝するため、罹患した個体は通常、少なくとも1人の罹患した親を持つ。","type":"adverb","meaning_category":"genetics"}]}