{"word":"unmanhood","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"男らしくなさ、意気地なし、臆病","english_definition":"lack of courage, resolution, or other qualities considered appropriate to or typical of a man.","examples":[{"sentence":"He accused the politician of unmanhood for not standing up for his beliefs.","translation":"彼はその政治家が信念を貫かないことを男らしくないと非難した。"},{"sentence":"The general viewed cowardice as the ultimate unmanhood.","translation":"将軍は臆病を究極の男らしくなさだと考えた。"}],"collocations":["display unmanhood","accuse of unmanhood"],"synonyms":["cowardice","effeminacy","weakness","timidity","pusillanimity"],"antonyms":["manliness","courage","bravery","valor"]},{"part_of_speech":"noun","definition":"去勢、男らしさを奪うこと","english_definition":"the state of being castrated; deprivation of virility or masculine qualities.","examples":[{"sentence":"The ritual involved a symbolic unmanhood of the defeated warriors.","translation":"その儀式には、敗北した戦士たちの象徴的な去勢が含まれていた。"},{"sentence":"He feared unmanhood more than death.","translation":"彼は死よりも男らしさを奪われることを恐れた。"}],"collocations":["symbolic unmanhood","fear of unmanhood"],"synonyms":["castration","emasculation","defeminization"],"antonyms":["virility","masculinity"]}],"etymology":{"value":"\"Un-\" (否定接頭辞) + \"manhood\" (男らしさ)","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈmænhʊd/","syllables":"un-man-hood"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"\"Unmanhood\" is a relatively rare word with negative connotations. It generally refers to a perceived lack of traditionally masculine qualities, such as courage, strength, or resolve. It can also refer to castration or the loss of virility, though this meaning is less common in modern usage. The term is often used in a critical or accusatory manner.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed unmanhood by helping the elderly woman.","correct":"✓ He showed compassion by helping the elderly woman.","note":"Helping someone is not typically considered \"unmanhood.\" Using the word in this context would be inappropriate and could be seen as offensive. Consider using words like compassion, kindness, or empathy instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["unman (verb)"],"related_terms":["manhood","manly","unmanly"],"priority":"★☆☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"unmanhood\" is not commonly used in modern English. It is a formal word that refers to the lack of qualities typically associated with men, such as courage and strength. It can also refer to castration, but this meaning is less common. Because of its infrequent use and potentially offensive connotations, it is important to use this word with caution."},"example_sentences":[{"sentence":"The king accused the knight of unmanhood after he fled the battlefield.","translation":"王は騎士が戦場から逃げ出した後、彼を男らしくないと非難した。","type":"noun","meaning_category":"男らしくなさ"},{"sentence":"The fear of unmanhood drove him to take reckless risks.","translation":"男らしくなくなることへの恐れが、彼を無謀なリスクを冒させた。","type":"noun","meaning_category":"男らしくなさ"}]}