{"word":"color-sighted","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"色覚のある、色を識別できる","english_definition":"Having normal color vision; able to distinguish between different colors.","examples":[{"sentence":"Most people are color-sighted and can easily tell the difference between red and green.","translation":"ほとんどの人は色覚があり、赤と緑の違いを簡単に見分けることができます。"},{"sentence":"The test is designed to determine whether someone is color-sighted or color-blind.","translation":"そのテストは、誰かが色覚があるか色盲であるかを判断するように設計されています。"}],"collocations":["normally color-sighted","fully color-sighted"],"synonyms":["chromatic","having normal vision"],"antonyms":["color-blind","achromatic"]}],"etymology":{"value":"The word 'color-sighted' is formed by combining 'color' and 'sighted'. 'Color' refers to the property of reflecting light of a particular wavelength, and 'sighted' means having the ability to see. Therefore, 'color-sighted' literally means 'able to see colors'.","priority":"N/A"},"pronunciation":{"ipa":"/ˈkʌlərˌsaɪtɪd/","syllables":"col-or-sight-ed"},"inflection":{"notes":"The word 'color-sighted' is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Color-sighted' is used to describe individuals who possess normal color vision. It is often used in contrast to 'color-blind' to differentiate between those who can perceive colors accurately and those who have difficulty distinguishing certain colors.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"He is a color-sighted person.","correct":"He is color-sighted.","note":"'Color-sighted' is an adjective, so it directly modifies the noun. Using 'a color-sighted person' is grammatically correct but less common."}],"priority":"N/A"},"related_words":{"derivatives":["color-sightedness (noun: the state of being color-sighted)"],"related_terms":["color vision","color perception","normal vision","dichromacy","anomalous trichromacy"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"B2","text":"The term 'color-sighted' is relatively straightforward. It describes someone who has normal color vision and can distinguish between different colors. It's often used in medical or scientific contexts when discussing vision and color perception. Understanding the term is useful for comprehending discussions about vision impairments like color blindness.","priority":"N/A"},"example_sentences":[{"sentence":"The artist was color-sighted, allowing him to create vibrant and realistic paintings.","translation":"そのアーティストは色覚があり、鮮やかでリアルな絵を描くことができました。","type":"adjective","meaning_category":"Able to see colors"},{"sentence":"The study compared the performance of color-sighted and color-blind individuals on a visual task.","translation":"その研究では、視覚課題における色覚のある人と色盲の人のパフォーマンスを比較しました。","type":"adjective","meaning_category":"Having normal color vision"}]}