{"word":"Myotalpinae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A subfamily of moles in the family Talpidae, containing the single living species Gansu mole (Scapanulus oweni).","english_definition":"A taxonomic subfamily within the mole family (Talpidae), characterized by having only one extant species, the Gansu mole (Scapanulus oweni).","examples":[{"sentence":"The Gansu mole is the only extant member of the subfamily Myotalpinae.","translation":"甘粛モグラはMyotalpinae亜科の現存する唯一の種です。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the genus name 'Myotalpa' (now obsolete) and the suffix '-inae', which is used to denote a subfamily in biological taxonomy.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmaɪoʊˈtælpɪniː/","syllables":"My-o-tal-pi-nae"},"inflection":{"noun_plural":"Myotalpinae (already plural form for a subfamily)"},"usage_notes":{"explanation":"This term is primarily used in scientific and taxonomic contexts when discussing the classification of moles. It's important to note that the taxonomy may change as new research emerges.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Talpidae (family)","Scapanulus oweni (Gansu mole, the only species in this subfamily)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Very low frequency - Primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Myotalpinae' is a specialized term used in zoology and taxonomy. It refers to a specific subfamily within the mole family, Talpidae. The only living species in this subfamily is the Gansu mole (Scapanulus oweni). Understanding this term requires familiarity with biological classification systems."},"example_sentences":[{"sentence":"Phylogenetic analysis supports the placement of Scapanulus oweni within the Myotalpinae subfamily.","translation":"系統解析は、甘粛モグラをMyotalpinae亜科に分類することを支持しています。","type":"scientific","meaning_category":"Taxonomy"}]}