{"word":"Mogos","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Romania, informal) A mountain peak, especially a prominent or isolated one.","english_definition":"(Romania, informal) A mountain peak, especially a prominent or isolated one. Often used in place names.","examples":[{"sentence":"The village is located at the foot of Mogos Mountain.","translation":"その村はモゴス山の麓に位置しています。"},{"sentence":"Mogos peak offers a stunning view of the surrounding landscape.","translation":"モゴスの頂上からは、周囲の景色を一望できます。"}],"collocations":["Mogos Mountain","Mogos Peak"],"synonyms":["peak","summit","mountaintop"],"antonyms":[]}],"etymology":{"value":"Originates from Romanian folklore and regional dialects, possibly related to ancient Dacian words for 'high place' or 'sacred ground'. The exact etymology is debated.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmo.ɡos/","syllables":"Mo-gos"},"inflection":{"noun_plural":"Mogos (usually refers to a specific mountain, so plural is rare)"},"usage_notes":{"explanation":"'Mogos' is primarily used in Romania, especially in Transylvania and other mountainous regions. It often appears as part of a proper noun, referring to a specific mountain. Outside of Romania, the term is not generally recognized.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ We climbed the Mogos in the Alps.","correct":"✓ We climbed Mogos Mountain in Romania.","note":"'Mogos' is specific to Romanian geography."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Regional and specialized vocabulary)","frequency_google_ngram":"Low (Specific to Romanian geography)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mogos' is a specialized term with limited usage outside of Romanian geography and culture. Understanding requires familiarity with Romanian place names and regional vocabulary. It is not typically encountered in general English texts.","note":"This word is highly specific and not part of general English vocabulary."},"example_sentences":[{"sentence":"The hike to Mogos was challenging but rewarding.","translation":"モゴスへのハイキングは大変でしたが、やりがいがありました。","type":"noun","meaning_category":"Mountain Peak"},{"sentence":"We could see Mogos from our hotel window.","translation":"ホテルの窓からモゴスが見えました。","type":"noun","meaning_category":"Mountain Peak"}]}