{"word":"self-example","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"An example set by oneself; demonstrating something through one's own actions or behavior.","english_definition":"An instance of demonstrating something through one's own actions or behavior; an example that one sets for others by their own conduct.","examples":[{"sentence":"The teacher emphasized the importance of self-example, urging students to practice what they preach.","translation":"先生は自己の実践の重要性を強調し、学生たちに言うだけでなく自分自身も実行するように促した。","usage_note":"This implies that the teacher is setting a good example for the students."},{"sentence":"Leading by self-example is more effective than simply giving orders.","translation":"自己の実践によって導くことは、単に命令するよりも効果的だ。","usage_note":"This suggests that leaders should demonstrate the behaviors they expect from their team members."},{"sentence":"Her success was a self-example of what hard work and dedication can achieve.","translation":"彼女の成功は、努力と献身が何を達成できるかの自己の実践例だった。","usage_note":"This indicates that her own achievements serve as an example to others."}],"collocations":["lead by self-example","set a self-example","importance of self-example"],"synonyms":["role model","exemplification","demonstration","embodiment"],"antonyms":["hypocrisy","inconsistency"]}],"etymology":{"value":"Combination of 'self' (referring to oneself) and 'example' (a thing characteristic of its kind or illustrating a general rule).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌselfɪɡˈzæmpəl/","syllables":"self-ex-am-ple"},"inflection":{"noun_plural":"self-examples"},"usage_notes":{"explanation":"'Self-example' emphasizes the act of demonstrating a principle or behavior through one's own actions. It is often used in contexts where personal integrity and authenticity are important, such as leadership, teaching, and parenting. It suggests that actions speak louder than words.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He gave a good self-example to his children.","correct":"✓ He set a good self-example for his children. / ✓ He led by self-example for his children.","note":"The correct phrasing is 'set a self-example' or 'lead by self-example.'"},{"incorrect":"✗ The self-example is very important in leadership.","correct":"✓ Self-example is very important in leadership. / ✓ Leading by self-example is very important in leadership.","note":"It is better to use 'self-example' as a concept or to use the phrase 'leading by self-example'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["role model","leadership","integrity","authenticity"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Self-example' is a relatively uncommon term that refers to demonstrating something through one's own actions or behavior. It is often used in discussions about leadership, ethics, and personal responsibility. The term implies that one's actions should align with one's words and that leading by example is an effective way to influence others. Understanding the concept requires a good grasp of abstract ideas and nuanced communication."},"example_sentences":[{"sentence":"Effective leaders understand the power of self-example in motivating their teams.","translation":"効果的なリーダーは、チームを鼓舞する上での自己の実践の力を理解している。","type":"noun","meaning_category":"Leadership"},{"sentence":"She believed that the best way to teach her children values was through self-example.","translation":"彼女は、子供たちに価値観を教える最良の方法は自己の実践によるものだと信じていた。","type":"noun","meaning_category":"Parenting"},{"sentence":"The company's commitment to sustainability was evident in their self-example of eco-friendly practices.","translation":"その企業の持続可能性への取り組みは、環境に優しい慣行の自己の実践例に明らかだった。","type":"noun","meaning_category":"Sustainability"}]}