{"word":"Sulfation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(化学)硫酸化、硫酸塩化","english_definition":"The process of introducing a sulfate group into a molecule; the formation of a sulfate.","examples":[{"sentence":"Sulfation is a common post-translational modification of proteins.","translation":"硫酸化はタンパク質の一般的な翻訳後修飾です。"},{"sentence":"Sulfation of steroids can affect their biological activity.","translation":"ステロイドの硫酸化は、その生物活性に影響を与える可能性があります。"}],"collocations":["protein sulfation (タンパク質の硫酸化)","steroid sulfation (ステロイドの硫酸化)","tyrosine sulfation (チロシンの硫酸化)"],"synonyms":["sulfation reaction","sulfate conjugation"],"antonyms":[]}],"etymology":{"value":"Derived from 'sulfate' (a salt or ester of sulfuric acid) with the suffix '-ation' (denoting a process or action).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsʌlˈfeɪʃən/","syllables":"sul-fa-tion"},"inflection":{"noun_plural":"sulfations"},"usage_notes":{"explanation":"'Sulfation' refers to a chemical process where a sulfate group (SO₄²⁻) is added to a molecule. This process is important in various biological and industrial contexts. In biology, sulfation often modifies proteins and steroids, affecting their functions. In chemistry, it describes the formation of sulfates.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sulfation is very important to the cell.","correct":"✓ Sulfation is very important to the cell.","note":"'Sulfation' is a noun, so it does not require an article ('the') in general statements about the process itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["sulfate (名詞: 硫酸塩)","sulfated (形容詞: 硫酸塩化された)","sulfonate (動詞: スルホン化する; 名詞: スルホン酸塩)","desulfation (名詞: 脱硫酸化)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sulfation' is a technical term primarily used in chemistry and biology. It refers to the process of adding a sulfate group to a molecule. Understanding this term requires a background in these fields, as it's typically discussed in the context of chemical reactions, protein modifications, or steroid metabolism. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"Tyrosine **sulfation** is a common post-translational modification in eukaryotic cells.","translation":"チロシンの硫酸化は、真核細胞における一般的な翻訳後修飾です。","type":"noun","meaning_category":"(化学)硫酸化"},{"sentence":"The **sulfation** process can alter the properties of the polymer.","translation":"硫酸化プロセスは、ポリマーの特性を変化させる可能性があります。","type":"noun","meaning_category":"(化学)硫酸化"}]}