{"word":"Koolooly","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Australian Aboriginal) A type of wattle tree, *Acacia colei*, native to arid regions of Australia.","english_definition":"A species of wattle tree, *Acacia colei*, endemic to arid areas of Australia.","examples":[{"sentence":"The Koolooly provides valuable food and shelter for native animals.","translation":"クーロリーは、オーストラリアの在来動物にとって貴重な食料と避難場所を提供します。"}],"collocations":["Koolooly seeds","Koolooly flowers","Koolooly habitat"],"synonyms":["Cole's wattle","wattle tree"],"antonyms":[]}],"etymology":{"value":"Derived from an Australian Aboriginal language, likely from a language group in Western Australia where the tree is found. The exact language and meaning are not widely documented in standard English etymological resources.","priority":"★☆☆"},"pronunciation":{"ipa":"/kuːluːli/","syllables":"Koo-loo-ly"},"inflection":{"notes":"Plural form is Kooloolies."},"usage_notes":{"explanation":"'Koolooly' is primarily used in botanical or ecological contexts when discussing Australian flora, particularly in regions where the *Acacia colei* is prevalent. It is more common in scientific or specialized literature than in everyday conversation.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a koolooly in my garden in London.","correct":"✓ I saw a wattle tree in my garden in London.","note":"Koolooly/Acacia colei is native to Australia, so it's unlikely to be found naturally in London. Use 'wattle tree' if referring to a general type of acacia."}],"priority":"★☆☆"},"related_words":{"derivatives":["Acacia colei (scientific name)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Koolooly' is a highly specialized term referring to a specific species of wattle tree (*Acacia colei*) found in arid regions of Australia. Its usage is largely confined to botanical, ecological, or indigenous Australian contexts. Due to its limited and specific application, it is not considered part of general English vocabulary. Understanding requires familiarity with Australian flora and potentially, knowledge of Australian Aboriginal languages from which the term originates."},"example_sentences":[{"sentence":"The arid landscape was dotted with resilient Koolooly trees.","translation":"乾燥した景観には、たくましいクーロリーの木が点在していた。","type":"noun","meaning_category":"Australian Flora"},{"sentence":"Indigenous Australians have traditionally used Koolooly seeds as a food source.","translation":"オーストラリアの先住民は伝統的にクーロリーの種を食料源として利用してきた。","type":"noun","meaning_category":"Australian Flora"}]}