{"word":"cystoureteritis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"膀胱尿管炎","english_definition":"Inflammation of the urinary bladder and ureters.","examples":[{"sentence":"Cystoureteritis can be caused by bacterial infection.","translation":"膀胱尿管炎は細菌感染によって引き起こされることがある。"}],"collocations":[],"synonyms":["urinary tract infection","bladder infection"],"antonyms":[]}],"etymology":{"value":"The term is derived from the combination of 'cysto-' (relating to the bladder), 'uretero-' (relating to the ureter), and '-itis' (indicating inflammation).","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɪstoʊˌjuːˌriːtəˈraɪtɪs/","syllables":"cis-to-u-re-te-ri-tis"},"inflection":{"noun_plural":"cystoureteritides (rare)"},"usage_notes":{"explanation":"Cystoureteritis is a medical term referring to the inflammation of both the urinary bladder (cystitis) and the ureters (ureteritis). It is often caused by a bacterial infection that ascends from the bladder to the ureters. Symptoms may include frequent urination, pain during urination, and lower abdominal pain. Diagnosis typically involves urine tests and imaging studies. Treatment usually involves antibiotics.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["cystitis","ureteritis"],"related_terms":["urinary tract infection (UTI)","pyelonephritis"]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"'Cystoureteritis' is a specialized medical term indicating inflammation of both the bladder and ureters. It's typically used in medical contexts and may not be familiar to the general public. Understanding the etymology (cysto- + uretero- + -itis) can aid in recognizing the condition's location within the urinary system."},"example_sentences":[{"sentence":"The patient presented with symptoms indicative of cystoureteritis, including dysuria and frequent urination.","translation":"患者は排尿困難や頻尿など、膀胱尿管炎を示唆する症状を呈した。","type":"medical","meaning_category":"inflammation"},{"sentence":"Diagnosis of cystoureteritis was confirmed through urinalysis and imaging.","translation":"尿検査と画像診断により、膀胱尿管炎の診断が確定された。","type":"medical","meaning_category":"diagnosis"}]}