{"word":"Epiploce","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"エピプロケ、文末反復。修辞技法のひとつで、文や句の終わりで同じ単語やフレーズを繰り返すこと。","english_definition":"A rhetorical device in which a word or phrase is repeated at the end of successive clauses or sentences.","examples":[{"sentence":"\"Government of the people, by the people, for the people, shall not perish from the earth.\" - Abraham Lincoln (a famous example, though also containing elements of other rhetorical devices).","translation":"「人民の人民による人民のための政治は、地上から決して滅びることはない。」 - エイブラハム・リンカーン（有名な例だが、他の修辞技法の要素も含む）。"},{"sentence":"He said he would be there, and he was there. She knew it was important, and it was important.","translation":"彼はそこにいると言った、そして彼はそこにいた。彼女はそれが重要だと知っていた、そしてそれは重要だった。"}],"collocations":["use of epiploce","rhetorical epiploce","literary epiploce"],"synonyms":["epistrophe","antistrophe","terminal repetition","counterturn"],"antonyms":["anaphora (文頭反復)","symploce (文頭文末反復)"]}],"etymology":{"value":"ギリシャ語の ἐπιπλοκή (epiplokē) から派生。ἐπί (epí)「上に、～に」+ πλοκή (plokḗ)「編むこと、絡み合うこと」に由来し、言葉を編み込む、結びつけるイメージから来ている。","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈpɪploʊsi/","syllables":"e-pip-lo-ce"},"inflection":{"notes":"複数形は epiploces"},"usage_notes":{"explanation":"Epiploce (エピプロケ) は、文末反復を意味する修辞技法です。文末に同じ単語やフレーズを繰り返すことで、強調やリズム感を生み出し、聴衆や読者の心に強く印象づける効果があります。Anaphora（アナフォラ、文頭反復）と対比されることが多く、Symploce（シンプロケ、文頭文末反復）は、AnaphoraとEpiploceを組み合わせたものです。文学作品、スピーチ、広告など、様々な分野で使用されます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The use of anaphora is when you repeat the end of the sentence.","correct":"✓ The use of epiploce is when you repeat the end of the sentence.","note":"Anaphora (アナフォラ) は文頭反復なので、文末反復である epiploce と混同しないようにしましょう。"},{"incorrect":"✗ Epiploce is the same as repetition.","correct":"✓ Epiploce is a specific type of repetition at the end of clauses or sentences.","note":"Epiploce は反復の一種ですが、単なる反復ではなく、文末での反復を指します。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["anaphora","symploce","rhetoric","rhetorical device","epistrophe"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Epiploce**」は、文章の最後に同じ言葉やフレーズを繰り返す修辞技法を指す、やや専門的な用語です。これは、特定のアイデアを強調したり、リズムを作ったりするために使用されます。例えば、「政府は国民のものであり、国民によって運営され、国民のために存在するものでなければならない」というリンカーンの言葉は、epiploceの例として挙げられます。この言葉では、「国民」という言葉が各句の最後に繰り返され、その重要性が強調されています。この用語は、文学や修辞学の専門的な文脈で最も一般的に使用されます。"},"example_sentences":[{"sentence":"The project failed because of a lack of funding, a lack of planning, and a lack of commitment. A lack of commitment.","translation":"そのプロジェクトは資金不足、計画不足、そしてコミットメントの欠如が原因で失敗した。コミットメントの欠如だ。","type":"example","meaning_category":"文末反復の例"},{"sentence":"We must fight for our freedom, we must die for our freedom, we must live for our freedom. For our freedom!","translation":"我々は自由のために戦わなければならない、自由のために死ななければならない、自由のために生きなければならない。自由のために！","type":"example","meaning_category":"文末反復の例"},{"sentence":"His life was about service, nothing but service.","translation":"彼の人生は奉仕、ただ奉仕のためだけにあった。","type":"example","meaning_category":"文末反復の例"}]}