{"word":"galvanologist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"電気生理学者、ガルヴァーニ電気の研究者","english_definition":"A scientist who studies galvanism or electrophysiology.","examples":[{"sentence":"The galvanologist conducted experiments on muscle contractions using electrical stimulation.","translation":"その電気生理学者は、電気刺激を用いた筋肉の収縮に関する実験を行った。"}],"collocations":["study of galvanism","electrophysiological research"],"synonyms":["electrophysiologist","bioelectromagnetics researcher"],"antonyms":[]}],"etymology":{"value":"The word is derived from 'galvanism,' named after Luigi Galvani, an 18th-century Italian scientist who conducted early experiments with electricity and animal tissues. The suffix '-ologist' denotes someone who studies a particular field.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡælvəˈnɒlədʒɪst/","syllables":"gal-va-nol-o-gist"},"inflection":{"noun_plural":"galvanologists"},"usage_notes":{"explanation":"The term 'galvanologist' is somewhat archaic, with 'electrophysiologist' being the more common term today. It specifically refers to someone who studies the electrical properties of living organisms, particularly in the context of muscle and nerve function.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a galvanologist in the field of astronomy.","correct":"✓ She is an astronomer.","note":"Galvanology is related to electricity in biological systems, not astronomy."}],"priority":"★☆☆"},"related_words":{"derivatives":["galvanology","galvanic","galvanism","electrophysiology"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'galvanologist' is a highly specialized term referring to a scientist who studies galvanism or electrophysiology. It's not commonly used in everyday language and is more likely to appear in scientific or historical contexts related to the study of electricity and its effects on living organisms. Understanding this word requires knowledge of scientific terminology and the history of science."},"example_sentences":[{"sentence":"Early galvanologists believed that animal electricity was a unique vital force.","translation":"初期の電気生理学者は、動物電気は独特の生命力であると信じていた。","type":"general","meaning_category":"definition"},{"sentence":"Modern galvanologists use sophisticated techniques to measure electrical activity in the brain.","translation":"現代の電気生理学者は、脳内の電気的活動を測定するために高度な技術を使用している。","type":"general","meaning_category":"definition"}]}