{"word":"Saturn","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"土星","english_definition":"The sixth planet from the Sun in our solar system, characterized by its prominent rings.","examples":[{"sentence":"Saturn is famous for its beautiful rings.","translation":"土星はその美しい環で有名です。"},{"sentence":"The spacecraft sent back stunning images of Saturn.","translation":"その宇宙船は土星の素晴らしい画像を送信しました。"}],"collocations":["Saturn's rings (土星の環)","planet Saturn (惑星土星)","the planet Saturn (惑星土星)"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(ローマ神話)サトゥルヌス (農耕神)","english_definition":"(Roman mythology) The Roman god of agriculture and harvest.","examples":[{"sentence":"Saturn was the Roman equivalent of the Greek god Cronus.","translation":"サトゥルヌスはギリシャ神話の神クロノスに相当するローマの神です。"},{"sentence":"The festival of Saturnalia was held in honor of Saturn.","translation":"サトゥルナリア祭はサトゥルヌスを称えて開催されました。"}],"collocations":["god Saturn (神サトゥルヌス)","Saturnalia (サトゥルナリア祭)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Latin 'Saturnus', the Roman god of agriculture, believed to have reigned during a golden age of prosperity and peace. The planet was named after the god, likely due to its slow orbit, symbolizing the passage of time and the agricultural cycle.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsætərn/","syllables":"Sat-urn"},"inflection":{"notes":"Plural: Saturns (rare, usually referring to multiple instances of the planet or its features in a specific context)."},"usage_notes":{"explanation":"'Saturn' primarily refers to the planet. When referring to the Roman god, it's often in the context of mythology or historical studies. The term 'Saturnalia' is specifically associated with the Roman festival.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Saturne is a planet.","correct":"✓ Saturn is a planet.","note":"The correct spelling is 'Saturn'."},{"incorrect":"✗ Saturn's rings are made of only ice.","correct":"✓ Saturn's rings are made of ice and rock.","note":"Saturn's rings are composed of both ice and rock particles."}],"priority":"★☆☆"},"related_words":{"derivatives":["Saturnian (adjective: relating to Saturn or its inhabitants; noun: hypothetical inhabitant of Saturn)"],"phrases":["Saturnalia (Roman festival in honor of Saturn)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B1","frequency_google_ngram":"Relatively frequent in scientific and educational contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"'Saturn' is a word primarily used in the context of astronomy and mythology. It refers to the sixth planet from the Sun, known for its prominent rings. It also refers to the Roman god of agriculture. The word is not commonly used in everyday conversation but is important in science and history contexts."},"example_sentences":[{"sentence":"Scientists are studying the composition of **Saturn**'s rings.","translation":"科学者たちは土星の環の組成を研究しています。","type":"noun","meaning_category":"Planet"},{"sentence":"The myth of **Saturn** devouring his children is a powerful symbol.","translation":"子供をむさぼり食うサトゥルヌスの神話は、強力な象徴です。","type":"noun","meaning_category":"Roman God"}]}