{"word":"sorediform","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(lichenology) Having a sorediate appearance; resembling soredia.","english_definition":"(lichenology) Having a sorediate appearance; resembling soredia.","examples":[{"sentence":"The lichen thallus exhibits a sorediform appearance due to the presence of numerous soredia.","translation":"その地衣体の葉状体は、多数の粉芽の存在により、粉芽状の外観を呈する。"}],"collocations":["sorediform lichen","sorediform structure","sorediform appearance"],"synonyms":["sorediate","granular","powdery"],"antonyms":["non-sorediate","smooth","continuous"]}],"etymology":{"value":"From 'soredium' (a type of asexual propagule in lichens) + '-form' (having the form of).","priority":"★★★"},"pronunciation":{"ipa":"/sɔˈriːdɪˌfɔrm/","syllables":"so-re-di-form"},"inflection":{"notes":"This word is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Sorediform' is a descriptive term used in lichenology to describe structures or appearances that resemble soredia, which are small, powdery propagules used for asexual reproduction in lichens. It is typically used to describe the overall texture or morphology of a lichen thallus or specific parts of it.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The lichen is sorediforming.","correct":"✓ The lichen has a sorediform appearance.","note":"'Sorediform' is an adjective, not a verb. Use it to describe the appearance, not as an action."},{"incorrect":"✗ The sorediforms are visible on the lichen.","correct":"✓ The soredia are visible on the lichen, giving it a sorediform appearance.","note":"'Sorediform' describes the appearance, while 'soredia' are the actual propagules."}],"priority":"★★☆"},"related_words":{"derivatives":["soredium (noun): a small, asexual reproductive structure in lichens.","sorediate (adjective): producing or having soredia."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Specialized term in lichenology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sorediform' is a technical term used in the field of lichenology. It describes something that has the appearance of soredia, which are powdery structures used by lichens to reproduce asexually. If a lichen surface looks granular or powdery due to the presence of these structures, it might be described as 'sorediform'. This term is mainly encountered in scientific literature related to lichens."},"example_sentences":[{"sentence":"The crustose lichen exhibited a distinctly sorediform margin.","translation":"その痂状地衣は、明らかに粉芽状の縁を示した。","type":"descriptive","meaning_category":"lichen morphology"},{"sentence":"Microscopic examination revealed a sorediform layer beneath the cortex.","translation":"顕微鏡検査により、皮層の下に粉芽状の層が明らかになった。","type":"descriptive","meaning_category":"lichen anatomy"},{"sentence":"The presence of sorediform structures is a key characteristic for identifying this species of lichen.","translation":"粉芽状構造の存在は、この種の地衣を識別するための重要な特徴である。","type":"identification","meaning_category":"lichen identification"}]}