{"word":"interpellate","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(政府高官に対して)質問する、質疑する (特に議会において)","english_definition":"to question (a government minister) formally, especially in a parliament.","examples":[{"sentence":"The opposition party decided to interpellate the Minister of Finance regarding the new tax policy.","translation":"野党は、新しい税制政策に関して財務大臣に質問することを決定した。"},{"sentence":"The MP interpellated the Prime Minister about the rising unemployment rate.","translation":"その国会議員は、失業率の上昇について首相に質問した。"}],"collocations":["interpellate a minister","interpellate the government"],"synonyms":["question","examine","query","challenge","grill"],"antonyms":["answer","support","endorse"]}],"etymology":{"value":"Late Latin *interpellatus*, past participle of *interpellare* (\"to interrupt, disturb, question\"), from *inter-* (\"between\") + *pellare* (\"to drive, push\").","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈtɜːrpəleɪt/","syllables":"in-ter-pel-late"},"inflection":{"verb_forms":{"present_simple":["interpellate","interpellates"],"past_simple":"interpellated","past_participle":"interpellated","present_participle":"interpellating"}},"usage_notes":{"explanation":"\"Interpellate\" is a formal term, primarily used in political contexts to describe the act of questioning a government official, especially in a parliamentary setting. It implies a formal and often challenging inquiry. The term is not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The journalist interpellated the celebrity about their new movie.","correct":"✓ The journalist questioned the celebrity about their new movie.","note":"\"Interpellate\" is typically used only in a political or governmental context, not for general questioning of individuals."}],"priority":"★★☆"},"related_words":{"derivatives":["interpellation (noun): the act of formally questioning a government official."],"related_terms":["questionnaire","inquiry","interrogation"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"interpellate\" is a highly formal and specialized term, primarily used in the context of parliamentary procedure and political science. It refers to the act of a member of a legislative body formally questioning a government minister or official about a policy, decision, or action. Due to its specific and formal usage, it is not commonly encountered in general English. Understanding its meaning requires familiarity with political and legal terminology."},"example_sentences":[{"sentence":"The senator decided to **interpellate** the Secretary of State regarding the recent foreign policy decisions.","translation":"その上院議員は、最近の外交政策の決定に関して国務長官に質問することを決定した。","type":"verb","meaning_category":"質問する (政府高官に対して)"},{"sentence":"The opposition party used its right to **interpellate** the Prime Minister during the parliamentary session.","translation":"野党は、議会会期中に首相に質問する権利を行使した。","type":"verb","meaning_category":"質問する (政府高官に対して)"}]}