{"word":"plantocracy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(特に西インド諸島における) 大農園所有者階級、プランター支配階級","english_definition":"the class of planters who owned most of the land and slaves in areas such as the West Indies.","examples":[{"sentence":"The plantocracy held significant political and economic power in the region.","translation":"大農園所有者階級はその地域で大きな政治的・経済的権力を握っていた。"},{"sentence":"The social structure was dominated by the plantocracy.","translation":"社会構造は大農園所有者階級によって支配されていた。"}],"collocations":["West Indian plantocracy","sugar plantocracy","slave-owning plantocracy"],"synonyms":["planter class","landed gentry","slaveholders"],"antonyms":[]}],"etymology":{"value":"\"Plantocracy\" is a blend of \"plantation\" and \"aristocracy.\" It reflects the aristocratic status and power held by plantation owners, particularly in historical colonial societies.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌplæntˈɒkrəsi/","syllables":"plan-toc-ra-cy"},"inflection":{"noun_plural":"plantocracies"},"usage_notes":{"explanation":"The term \"plantocracy\" is primarily used in historical contexts to describe the powerful elite in societies where large-scale plantations, often relying on slave labor, were central to the economy. It highlights the social, economic, and political dominance of this class.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plantocracy was known for their egalitarian views.","correct":"✓ The plantocracy was known for their exploitative practices.","note":"The plantocracy was a privileged class that often relied on exploitation, particularly of enslaved people, rather than egalitarianism."}],"priority":"★★☆"},"related_words":{"derivatives":["plantation","planter","aristocracy","plutocracy"],"phrases":["slave society","colonial society","sugar plantation"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'plantocracy' refers to the ruling class of plantation owners, particularly in historical colonial societies that relied on slave labor. It's a specialized term that often appears in historical or sociological discussions of these societies."},"example_sentences":[{"sentence":"The plantocracy's wealth was built on the backs of enslaved people.","translation":"大農園所有者階級の富は、奴隷にされた人々の犠牲の上に築かれた。","type":"general","meaning_category":"general"},{"sentence":"The plantocracy resisted efforts to abolish slavery.","translation":"大農園所有者階級は奴隷制度廃止の取り組みに抵抗した。","type":"historical","meaning_category":"historical"}]}