{"word":"one-pope","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(主に歴史的文脈で)単一のローマ教皇のみを認める、または単一のローマ教皇の正当性を主張する","english_definition":"(primarily in a historical context) Recognizing or asserting the legitimacy of only one pope in Rome, especially during periods of papal schism.","examples":[{"sentence":"The one-pope faction maintained that Clement VII was an antipope.","translation":"単一教皇支持派は、クレメンス7世は対立教皇であると主張した。"},{"sentence":"During the Western Schism, the political landscape was divided between one-pope and multiple-pope allegiances.","translation":"教会大分裂の間、政治情勢は単一教皇支持と複数教皇支持の忠誠心の間で分断された。"}],"collocations":["one-pope faction","one-pope allegiance","one-pope position","one-pope theory"],"synonyms":["papalist","ultramontane"],"antonyms":["antipapal","conciliarist"],"notes":"This term is primarily used in historical discussions of the Western Schism and other periods of papal conflict. It emphasizes the belief in a single, legitimate successor to St. Peter."}],"etymology":{"value":"Derived from the concept of having 'one' (single) 'pope' (the Bishop of Rome) at a time, as opposed to periods where multiple claimants vied for the papacy.","priority":"★★☆"},"pronunciation":{"ipa":"/wʌn ˈpoʊp/","syllables":"one-pope"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"The term \"one-pope\" is used to describe the position that there can be only one legitimate pope at any given time. This becomes relevant during periods of schism, when multiple individuals claim to be the rightful pope. Those who adhere to the \"one-pope\" view typically argue for the legitimacy of a specific claimant and denounce others as antipopes. This term is most often encountered in historical or theological discussions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a one-pope Catholic.","correct":"✓ He adheres to the one-pope position.","note":"It's more accurate to say someone 'adheres to the one-pope position' rather than saying they 'are a one-pope Catholic,' as it describes their stance on papal legitimacy rather than their entire religious identity."}],"priority":"★★☆"},"related_words":{"derivatives":["papacy","antipope","schism","conciliarism","ultramontanism"],"related_terms":["Western Schism","Avignon Papacy","Council of Constance"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - primarily used in historical or theological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"one-pope\" is a specialized term used primarily in historical and theological discussions related to periods of papal schism. It describes the position that there can be only one legitimate pope at any given time. Understanding this term requires familiarity with the history of the papacy and the concept of antipopes. It is not a commonly used term in everyday language."},"example_sentences":[{"sentence":"The historian argued that the one-pope solution ultimately prevailed at the Council of Constance.","translation":"歴史家は、単一教皇の解決策が最終的にコンスタンツ公会議で勝利したと主張した。","type":"adjective","meaning_category":"historical context"},{"sentence":"The one-pope theory was central to the arguments against the Avignon Papacy.","translation":"単一教皇の理論は、アヴィニョン教皇庁に対する議論の中心だった。","type":"adjective","meaning_category":"theological context"}]}