{"word":"pitarah","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(India) A large, strong box or chest, especially one used for storing valuables or clothing.","english_definition":"A large, strong box or chest, especially one used for storing valuables or clothing, commonly found in India.","examples":[{"sentence":"The old pitarah in the attic held generations of family heirlooms.","translation":"屋根裏部屋の古いピターラには、何世代にもわたる家宝が保管されていた。"},{"sentence":"She carefully placed her wedding sari in the pitarah.","translation":"彼女は結婚式のサリーを丁寧にピターラにしまった。"}],"collocations":["wooden pitarah","antique pitarah","family pitarah","store in a pitarah"],"synonyms":["chest","trunk","coffer","box"],"antonyms":[]}],"etymology":{"value":"From Hindi पिटारा (piṭārā) / Urdu پٹارا (piṭārā), from Sanskrit पिटक (piṭaka, “basket, box”).","priority":"★★★"},"pronunciation":{"ipa":"/pɪˈtɑːrə/","syllables":"pi-tar-ah"},"inflection":{"noun_plural":"pitarahs"},"usage_notes":{"explanation":"The word 'pitarah' is primarily used in the context of Indian culture and households. It refers to a specific type of storage container that is often ornately decorated and holds significant cultural or sentimental value.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She used a suitcase as a pitarah.","correct":"✓ She used the pitarah to store her clothes.","note":"A 'pitarah' is a specific type of chest, not just any storage container. Using a more general term like 'chest' or 'trunk' would be more appropriate if it's not the traditional Indian box."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["sandook (similar term for a chest or box in other South Asian languages)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in specific cultural contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'pitarah' is a niche term primarily used within the context of Indian culture. It refers to a specific type of large, strong box or chest, often used for storing valuable or culturally significant items. Due to its cultural specificity, it is not commonly encountered in general English usage. Understanding the term requires familiarity with Indian cultural contexts.","notes":"This word is not commonly used in everyday English and is more likely to be found in literature or discussions related to Indian culture."},"example_sentences":[{"sentence":"The bride's family gifted her a beautifully carved pitarah filled with traditional jewelry.","translation":"花嫁の家族は、伝統的な宝石でいっぱいの美しく彫刻されたピターラを彼女に贈った。","type":"noun","meaning_category":"storage chest"},{"sentence":"Generations of family history were preserved within the sturdy walls of the old pitarah.","translation":"何世代にもわたる家族の歴史が、古いピターラの頑丈な壁の中に保存されていた。","type":"noun","meaning_category":"storage chest"}]}