{"word":"laterotemporal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"側頭葉の、側頭葉に関連する","english_definition":"Relating to the lateral and temporal aspects of the brain.","examples":[{"sentence":"The patient exhibited damage in the laterotemporal cortex.","translation":"患者は側頭葉皮質に損傷を示した。"},{"sentence":"Laterotemporal activity was observed during the memory task.","translation":"記憶課題中に側頭葉の活動が観察された。"}],"collocations":["laterotemporal cortex","laterotemporal lobe","laterotemporal activity"],"synonyms":["temporal","lateral"],"antonyms":[]}],"etymology":{"value":"Formed from 'lateral' (referring to the side) and 'temporal' (referring to the temporal lobe of the brain).","priority":"★★★"},"pronunciation":{"ipa":"/ˌlætərəʊˈtɛmpərəl/","syllables":"lat-er-o-tem-po-ral"},"inflection":{},"usage_notes":{"explanation":"'Laterotemporal' is a specialized term primarily used in neurology, neuroscience, and related medical fields to describe areas or functions involving both the lateral and temporal parts of the brain. It is often used to specify regions or processes that are not exclusively located in or related to the temporal lobe but extend laterally.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["laterotemporally"],"related_terms":["temporal lobe","lateral cortex","neuroanatomy"]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term 'laterotemporal' is highly technical and specific to the fields of neurology and neuroscience. It is unlikely to be encountered outside of these contexts. Understanding requires knowledge of brain anatomy and medical terminology."},"example_sentences":[{"sentence":"The study focused on the effects of lesions in the laterotemporal region on auditory processing.","translation":"その研究は、側頭葉領域の病変が聴覚処理に及ぼす影響に焦点を当てた。","type":"scientific","meaning_category":"brain anatomy"},{"sentence":"Functional MRI revealed increased activation in the laterotemporal cortex during language comprehension tasks.","translation":"機能的MRIは、言語理解課題中に側頭葉皮質の活性化の増加を明らかにした。","type":"scientific","meaning_category":"neuroscience"}]}