{"word":"Powhatan","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ポウハタン族 (北米の先住民族)","english_definition":"A member of an Algonquian-speaking Native American people who formerly inhabited eastern Virginia.","examples":[{"sentence":"The Powhatan were a powerful tribe in the 17th century.","translation":"ポウハタン族は17世紀に強大な部族でした。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"ポウハタン (ポウハタン族の首長、またはその称号)","english_definition":"The paramount chief of the Powhatan people, or the title held by that chief.","examples":[{"sentence":"Chief Powhatan was the father of Pocahontas.","translation":"ポウハタン酋長はポカホンタスの父でした。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"ポウハタン語 (ポウハタン族が話していた言語)","english_definition":"The extinct Algonquian language formerly spoken by the Powhatan people.","examples":[{"sentence":"Very little of the Powhatan language is known today.","translation":"今日、ポウハタン語についてはほとんど知られていません。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"adjective","definition":"ポウハタン族の、ポウハタン語の","english_definition":"Relating to the Powhatan people, their language, or their culture.","examples":[{"sentence":"Powhatan culture was heavily influenced by the surrounding environment.","translation":"ポウハタン族の文化は、周囲の環境から大きな影響を受けていました。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after Chief Powhatan, the paramount chief of the Powhatan Confederacy when the English colonists arrived in Virginia in the early 17th century. The name itself is believed to be derived from a place name meaning 'at the falls'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpaʊəˈtæn/","syllables":"Pow-a-tan"},"inflection":{},"usage_notes":{"explanation":"'Powhatan' can refer to the people, their leader, their language, or things related to their culture. Context is important to determine the specific meaning.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Powhatan Confederacy (ポウハタン連邦)","Pocahontas (ポカホンタス)"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Relatively low frequency, primarily in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Powhatan' is a proper noun primarily encountered in historical contexts, specifically related to the early English colonization of Virginia and the Native American tribes inhabiting the region. Understanding the term requires some familiarity with American history and Native American cultures. The word's usage is often academic or documentary in nature."},"example_sentences":[{"sentence":"The **Powhatan** people initially had a complex relationship with the Jamestown settlers.","translation":"ポウハタン族は当初、ジェームズタウン入植者と複雑な関係を持っていました。","type":"noun","meaning_category":"ポウハタン族"},{"sentence":"**Powhatan's** leadership was crucial in the early interactions with the English.","translation":"ポウハタン酋長のリーダーシップは、初期のイギリス人との交流において重要でした。","type":"noun","meaning_category":"ポウハタン酋長"},{"sentence":"Efforts are being made to revitalize the **Powhatan** language.","translation":"ポウハタン語を復興させるための取り組みが行われています。","type":"noun","meaning_category":"ポウハタン語"},{"sentence":"Archaeological sites provide insights into **Powhatan** society.","translation":"考古学的な遺跡は、ポウハタン族の社会への洞察を提供します。","type":"adjective","meaning_category":"ポウハタン族の"}]}