{"word":"intercrural","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"股間の、股間の間にある","english_definition":"Located between the crura (legs or branches) of a structure, especially in the groin area.","examples":[{"sentence":"The intercrural region is often affected by skin conditions.","translation":"股間部は皮膚疾患の影響を受けやすい。"},{"sentence":"Intercrural dermatitis can be a painful condition.","translation":"股間皮膚炎は痛みを伴うことがある。"}],"collocations":["intercrural dermatitis (股間皮膚炎)","intercrural area (股間部)"],"synonyms":["inguinal","groin"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin words \"inter\" (between) and \"crus\" (leg).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪntərˈkrʊərəl/","syllables":"in-ter-cru-ral"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"The term \"intercrural\" is primarily used in medical and anatomical contexts to describe the region or structures located between the legs, particularly in the groin area. It is often used in discussions of skin conditions, infections, or anatomical features of this region.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The intercrural pain was in his arm.","correct":"✓ The intercrural pain was in his groin.","note":"Intercrural refers specifically to the area between the legs, not the arm."}],"priority":"★★★"},"related_words":{"derivatives":["crus (leg-like structure)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Primarily used in medical or anatomical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Intercrural' is a technical term primarily used in medical or anatomical contexts. It refers to the area or structures located between the legs, specifically in the groin region. Understanding this term requires knowledge of anatomical terminology. Due to its specialized usage, it is not commonly encountered in general English conversation or writing."},"example_sentences":[{"sentence":"The doctor examined the patient's intercrural area for signs of infection.","translation":"医師は感染の兆候がないか患者の股間部を診察した。","type":"adjective","meaning_category":"股間の"}]}