{"word":"parliamenteering","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"議会戦術、議会運営術","english_definition":"The use of parliamentary procedure to achieve a desired result; skillful maneuvering within a parliament or similar legislative body.","examples":[{"sentence":"His success was due to his mastery of parliamenteering.","translation":"彼の成功は、議会戦術の熟達によるものだった。"},{"sentence":"The debate was dominated by clever parliamenteering.","translation":"その討論は、巧妙な議会戦術によって支配された。"}],"collocations":["mastery of parliamenteering","clever parliamenteering","effective parliamenteering","parliamenteering skills"],"synonyms":["legislative tactics","political maneuvering","parliamentary procedure","political strategy"],"antonyms":[]}],"etymology":{"value":"From 'parliament' + '-eer' (suffix denoting someone involved in or skilled at something) + '-ing' (gerund or present participle suffix).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɑːrlɪˈmɛntɪərɪŋ/","syllables":"par-li-men-teer-ing"},"inflection":{"noun_plural":"parliamenteerings"},"usage_notes":{"explanation":"'Parliamenteering' refers to the strategic and tactical use of parliamentary rules and procedures to gain an advantage or achieve a specific outcome in a legislative setting. It often involves skillful debate, amendment proposals, and procedural maneuvers.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used parliamenteering to avoid debate.","correct":"✓ He used parliamenteering to control the debate.","note":"Parliamenteering is usually employed to influence or control debate, not avoid it entirely."}],"priority":"★☆☆"},"related_words":{"derivatives":["parliament (noun)","parliamentarian (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Parliamenteering' is a specialized term related to political science and legislative processes. It is generally used by those with a strong understanding of government and political strategy. The word describes the strategic use of parliamentary procedures to achieve a political goal, often involving complex maneuvering and debate tactics."},"example_sentences":[{"sentence":"The opposition party accused the government of using underhanded parliamenteering to push through the controversial bill.","translation":"野党は、政府が物議を醸している法案を強行するために、不正な議会戦術を用いていると非難した。","type":"noun","meaning_category":"議会戦術"},{"sentence":"Effective parliamenteering requires a deep understanding of the rules of procedure and the ability to think strategically.","translation":"効果的な議会戦術には、議事規則の深い理解と戦略的に考える能力が必要である。","type":"noun","meaning_category":"議会運営術"}]}