{"word":"Cerenkov","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"チェレンコフ放射の、チェレンコフ効果の","english_definition":"Relating to or exhibiting Cerenkov radiation or the Cerenkov effect.","examples":[{"sentence":"Cerenkov radiation is used in particle detectors.","translation":"チェレンコフ放射は粒子検出器で使用される。"},{"sentence":"The Cerenkov effect is observed when charged particles travel through a dielectric medium at speeds greater than the phase velocity of light in that medium.","translation":"チェレンコフ効果は、荷電粒子が誘電体媒質中をその媒質中の光の位相速度よりも速い速度で移動するときに観察される。"}],"collocations":["Cerenkov radiation","Cerenkov detector","Cerenkov light"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"チェレンコフ放射、チェレンコフ光","english_definition":"Electromagnetic radiation emitted when a charged particle (such as an electron) passes through a dielectric medium at a speed greater than the phase velocity of light in that medium.","examples":[{"sentence":"The blue glow in nuclear reactors is due to Cerenkov radiation.","translation":"原子炉の青い光はチェレンコフ放射によるものである。"},{"sentence":"Cerenkov radiation is used to detect high-energy particles.","translation":"チェレンコフ放射は高エネルギー粒子の検出に使用される。"}],"collocations":["detect Cerenkov radiation","observe Cerenkov light","Cerenkov radiation spectrum"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after Pavel Alekseyevich Cherenkov (or Cerenkov), the Soviet physicist who first characterized it in 1934.","priority":"★★★"},"pronunciation":{"ipa":"/tʃəˈrɛŋkɒf/","syllables":"Che-ren-kov"},"inflection":{"notes":"The word is generally invariable. The noun form has a plural, but it is rarely used."},"usage_notes":{"explanation":"'Cerenkov' is used primarily in scientific contexts, specifically in physics and related fields, to describe the phenomenon of Cerenkov radiation and related technologies. It is not commonly used in everyday language.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Cherenkov is a type of light bulb.","correct":"✓ Cherenkov radiation produces light, but it is not a light bulb.","note":"Cerenkov radiation is a phenomenon, not a device like a light bulb."}],"priority":"★★☆"},"related_words":{"derivatives":["Cherenkov detector","Cherenkov telescope"],"related_terms":["radiation","particle physics","dielectric medium","electromagnetic radiation"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Cerenkov' is highly specialized and primarily used in scientific and technical contexts related to physics, particularly particle physics and nuclear physics. Understanding the term requires familiarity with concepts such as electromagnetic radiation, charged particles, and dielectric media. It is unlikely to be encountered outside of these specific fields."},"example_sentences":[{"sentence":"The underwater robot detected the **Cerenkov** radiation from the nuclear waste.","translation":"水中ロボットは核廃棄物からのチェレンコフ放射を検出した。","type":"noun","meaning_category":"チェレンコフ放射"},{"sentence":"The **Cerenkov** detector is sensitive to high-energy particles.","translation":"チェレンコフ検出器は高エネルギー粒子に敏感である。","type":"adjective","meaning_category":"チェレンコフ放射の"}]}