{"word":"small-part","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"小さな部品、細かな部分","english_definition":"A minor or insignificant component of a larger whole; a component of limited size.","examples":[{"sentence":"The watch contains many small-parts.","translation":"その時計は多くの小さな部品を含んでいる。"},{"sentence":"He disassembled the engine, carefully organizing each small-part.","translation":"彼はエンジンを分解し、それぞれの小さな部品を丁寧に整理した。"},{"sentence":"The success of the project depended on the proper functioning of every small-part.","translation":"プロジェクトの成功は、すべての小さな部品が適切に機能するかにかかっていた。"}],"collocations":["small-part component","small-part assembly","small-part manufacturing","small-part replacement","small-part repair"],"synonyms":["component","detail","element","fragment","piece","bit"],"antonyms":["major component","large part","whole"],"notes":"Often used in technical contexts, such as engineering, manufacturing, or mechanics."}],"etymology":{"value":"Combination of the words 'small' and 'part', indicating a part that is small in size or significance.","priority":"N/A"},"pronunciation":{"ipa":"/ˈsmɔːl pɑːrt/","syllables":"small-part"},"inflection":{"noun_plural":"small-parts"},"usage_notes":{"explanation":"The term 'small-part' is generally used to refer to a physical object that is a component of a larger mechanism or system. It can also be used metaphorically to describe an insignificant element of a larger concept or situation.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He lost a small part from the toy.","correct":"✓ He lost a small-part from the toy.","note":"Using 'small part' as two separate words is grammatically correct, but 'small-part' as a single compound word emphasizes that it is a specific component or item, particularly in technical contexts."}],"priority":"N/A"},"related_words":{"derivatives":["small","part","particulate"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"N/A"},"readability_explanation":{"level":"B2","text":"The term 'small-part' is a compound noun that refers to a minor or insignificant component of a larger whole. Its meaning is relatively straightforward, but it is more commonly used in technical or specialized contexts. Understanding the term requires a basic understanding of compound nouns and the meanings of 'small' and 'part'."},"example_sentences":[{"sentence":"The technician carefully examined each small-part of the machine.","translation":"技術者は機械の各小さな部品を注意深く調べた。","type":"noun","meaning_category":"部品"},{"sentence":"The model airplane kit contained hundreds of small-parts.","translation":"その模型飛行機キットには何百もの小さな部品が含まれていた。","type":"noun","meaning_category":"部品"},{"sentence":"The failure of one small-part caused the entire system to shut down.","translation":"一つの小さな部品の故障が、システム全体の停止を引き起こした。","type":"noun","meaning_category":"部品"}]}