{"word":"stony-flavored","meanings":[{"part_of_speech":"adjective","definition":"石のような味がする、鉱物のような風味がする","english_definition":"Having a taste reminiscent of stones or minerals.","examples":[{"sentence":"The water from the well had a distinctly stony-flavored quality.","translation":"その井戸水は明らかに石のような味がした。"},{"sentence":"Some describe the wine as having a stony-flavored finish, due to the minerals in the soil.","translation":"土壌中のミネラルが原因で、そのワインは石のような風味のフィニッシュを持つと評する人もいる。"}],"synonyms":["mineral-tasting","earthy-flavored","flinty","minerally"],"antonyms":["fruity","sweet","floral"],"related_words":["stony","flavor","mineral","taste"]}],"etymology":{"value":"Combination of 'stony' (resembling stone) and 'flavored' (having a particular taste).","notes":"The term implies a taste sensation similar to the smell or feel associated with stones or minerals.","priority":"★★★"},"pronunciation":{"ipa":"/ˈstoʊni ˈfleɪvərd/","syllables":"sto-ny-fla-vored"},"usage_notes":{"explanation":"This adjective is typically used to describe the taste of water, wine, or other beverages or foods where the mineral content or the environment in which they were produced imparts a specific flavor profile. It is often used in the context of wine tasting to describe a particular characteristic of the wine's taste.","priority":"★★★"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"This term is relatively uncommon and specific, usually found in descriptive contexts related to taste, particularly in wine or water tasting. Understanding requires familiarity with descriptive language related to sensory experiences."},"example_sentences":[{"sentence":"The olive oil had a peculiar, almost stony-flavored aftertaste.","translation":"そのオリーブオイルは独特で、ほとんど石のような後味があった。","type":"descriptive","meaning_category":"taste description"},{"sentence":"The sommelier noted the wine's stony-flavored minerality.","translation":"ソムリエはそのワインの石のような風味のミネラル感を指摘した。","type":"wine tasting","meaning_category":"taste description"}]}