{"word":"Monsieurship","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The state, condition, or rank of being a Monsieur; the qualities or characteristics associated with a Monsieur.","english_definition":"The state, condition, or rank of being a Monsieur; the qualities or characteristics associated with a Monsieur.","examples":[{"sentence":"His monsieurship was evident in his refined manners and elegant attire.","translation":"彼のムッシューシップは、洗練されたマナーとエレガントな服装に明らかでした。"}],"collocations":["display one's monsieurship","the essence of monsieurship"],"synonyms":["gentlemanliness","refinement","elegance"],"antonyms":["boorishness","vulgarity"]}],"etymology":{"value":"Formed from 'Monsieur' (French title of respect equivalent to 'Sir' or 'Mister') + '-ship' (suffix denoting state, condition, or rank).","priority":"★★★"},"pronunciation":{"ipa":"/mɒnˈsɜːʃɪp/","syllables":"Mon-sieur-ship"},"inflection":{"noun_plural":"monsieurships"},"usage_notes":{"explanation":"'Monsieurship' is a relatively rare and somewhat archaic term. It is used to describe the qualities, characteristics, or status associated with being a 'Monsieur,' which is a French title of respect equivalent to 'Sir' or 'Mister.' It implies a certain level of refinement, elegance, and gentlemanly behavior.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The monsieurship was very loud and obnoxious.","correct":"✓ The lack of monsieurship was evident in his loud and obnoxious behavior.","note":"'Monsieurship' implies refinement and gentlemanly qualities, so it cannot be loud and obnoxious. The absence of these qualities would be described as a lack of monsieurship."}],"priority":"★★☆"},"related_words":{"derivatives":["Monsieur"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Monsieurship' is a rare and sophisticated term that denotes the qualities and characteristics associated with being a 'Monsieur,' a French title of respect. It implies refinement, elegance, and gentlemanly behavior. This term is not commonly used in modern English and would primarily be found in literary or historical contexts."},"example_sentences":[{"sentence":"The diplomat's impeccable manners exemplified true monsieurship.","translation":"その外交官の完璧なマナーは、真のムッシューシップを体現していた。","type":"noun","meaning_category":"state of being a Monsieur"},{"sentence":"He aspired to achieve a certain level of monsieurship in his social interactions.","translation":"彼は社交的な交流において、ある程度のムッシューシップを達成することを熱望していた。","type":"noun","meaning_category":"qualities of a Monsieur"}]}