{"word":"Toxicemia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"毒血症","english_definition":"A condition in which toxins are present in the blood.","examples":[{"sentence":"The patient was diagnosed with toxicemia after showing signs of severe infection.","translation":"患者は重度の感染の兆候を示した後、毒血症と診断されました。"}],"collocations":["develop toxicemia","treat toxicemia","severe toxicemia"],"synonyms":["blood poisoning","septicemia"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'toxikon' (poison) and 'haima' (blood), combined with the suffix '-emia' (condition of the blood).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtɒksɪˈmiːə/","syllables":"tox-i-ce-mi-a"},"inflection":{"noun_plural":"toxicemias"},"usage_notes":{"explanation":"Toxicemia is a medical term referring to the presence of toxins in the blood. It is often associated with severe infections or other conditions that release toxins into the bloodstream.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor suspected toxicemia because of the patient's high temperature and rash.","correct":"✓ The doctor suspected toxicemia because of the patient's high temperature and signs of sepsis.","note":"While high temperature and rash can be symptoms, 'signs of sepsis' is a more direct indicator of potential toxicemia."}],"priority":"★☆☆"},"related_words":{"derivatives":["toxic (adjective)","toxin (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Toxicemia' is a specialized medical term indicating a condition where toxins are present in the bloodstream. Its use is primarily within medical contexts, and understanding it requires familiarity with medical terminology. It is a more specific term than 'blood poisoning' and is often used to describe conditions related to severe infections or other systemic toxin releases."},"example_sentences":[{"sentence":"Prompt treatment is essential to manage severe cases of toxicemia.","translation":"重度の毒血症を管理するには、迅速な治療が不可欠です。","type":"noun","meaning_category":"medical condition"},{"sentence":"The laboratory tests confirmed the presence of toxins in the patient's blood, indicating toxicemia.","translation":"検査室での検査により、患者の血液中に毒素が存在することが確認され、毒血症が示唆されました。","type":"noun","meaning_category":"medical diagnosis"}]}