{"word":"Somalia","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ソマリア（アフリカの角にある国）","english_definition":"A country in the Horn of Africa.","examples":[{"sentence":"Somalia is located in the Horn of Africa.","translation":"ソマリアはアフリカの角に位置しています。"},{"sentence":"The capital of Somalia is Mogadishu.","translation":"ソマリアの首都はモガディシュです。"},{"sentence":"Somalia has a long coastline.","translation":"ソマリアは長い海岸線を持っています。"}],"collocations":["Republic of Somalia","Federal Republic of Somalia","Somali culture","Somali language","visit Somalia","travel to Somalia"],"synonyms":["Somali Republic"],"antonyms":[]},{"part_of_speech":"noun","definition":"ソマリア（地域名）","english_definition":"A geographical region in the Horn of Africa, encompassing Somalia and parts of neighboring countries.","examples":[{"sentence":"The Somali region is known for its arid climate.","translation":"ソマリア地域はその乾燥した気候で知られています。"},{"sentence":"Many people in the Somali region speak the Somali language.","translation":"ソマリア地域の人々の多くはソマリ語を話します。"}],"collocations":["Greater Somalia","Somali Peninsula","Somali ethnicity","Somali diaspora"],"synonyms":["Somali region","Somali territories"],"antonyms":[]}],"etymology":{"value":"The name Somalia is derived from the Somali people, who are the predominant ethnic group in the region. The exact origin of the name 'Somali' is debated, but it is believed to be related to the words 'soo' (go) and 'maal' (milk), referring to the nomadic pastoralist lifestyle of the Somali people.","priority":"★★☆"},"pronunciation":{"ipa":"/səˈmɑːliə/","syllables":"So-ma-li-a"},"inflection":{"notes":"ソマリアは国名なので、複数形はありません。"},"usage_notes":{"explanation":"'Somalia' refers to both the country officially known as the Federal Republic of Somalia and the broader geographical and cultural region inhabited by Somali people. When referring to the country, it is often used in the context of its political situation, history, and international relations. When referring to the region, it encompasses areas beyond the country's borders where Somali communities reside.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Somalia is a city.","correct":"✓ Somalia is a country.","note":"Somalia is a country, not a city. Mogadishu is the capital city of Somalia."},{"incorrect":"✗ Somali is the country.","correct":"✓ Somalia is the country.","note":"'Somali' is the adjective and noun referring to the people, language, or culture of Somalia. 'Somalia' is the name of the country."}],"priority":"★★☆"},"related_words":{"derivatives":["Somali (adjective: relating to Somalia or the Somali people; noun: a person from Somalia, the Somali language)","Somaliland (noun: a self-declared state internationally recognized as an autonomous region of Somalia)"],"phrases":["Horn of Africa","East Africa"],"priority":"★★☆"},"level_frequency":{"CEFR":"B1","frequency_google_ngram":"Moderately frequent.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"'Somalia' is the name of a country in Africa. It's located in the Horn of Africa. You might see it in the news when people talk about East Africa or international politics. 'Somali' is used to describe things related to Somalia, like the Somali language or Somali people.","priority":"★★☆"},"example_sentences":[{"sentence":"The ongoing conflict has greatly affected the people of Somalia.","translation":"現在進行中の紛争はソマリアの人々に大きな影響を与えています。","type":"noun","meaning_category":"country"},{"sentence":"Many Somali refugees have sought asylum in neighboring countries.","translation":"多くのソマリア難民が近隣諸国に亡命を求めています。","type":"noun","meaning_category":"country"},{"sentence":"The Somali language is spoken by millions of people in the Horn of Africa.","translation":"ソマリ語はアフリカの角で数百万人に話されています。","type":"adjective (related to Somalia)","meaning_category":"language"},{"sentence":"He is a Somali citizen.","translation":"彼はソマリア国民です。","type":"adjective (related to Somalia)","meaning_category":"nationality"}]}