{"word":"hyperlethargy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"過度の嗜眠、極度の倦怠感","english_definition":"A state of excessive drowsiness or sluggishness.","examples":[{"sentence":"The patient exhibited hyperlethargy as a result of the medication.","translation":"患者は、薬の副作用で過度の嗜眠状態を示した。"},{"sentence":"Hyperlethargy can be a symptom of various underlying medical conditions.","translation":"過度の嗜眠は、さまざまな基礎疾患の症状である可能性がある。"}],"collocations":["exhibit hyperlethargy (過度の嗜眠を示す)","symptom of hyperlethargy (過度の嗜眠の症状)","cause hyperlethargy (過度の嗜眠を引き起こす)"],"synonyms":["excessive drowsiness","extreme sluggishness","profound lethargy","somnolence","torpor"],"antonyms":["alertness","wakefulness","vigilance","energy","vitality"]}],"etymology":{"value":"'Hyper-' (過剰な) + 'lethargy' (嗜眠、倦怠感)","priority":"★★★"},"pronunciation":{"ipa":"/ˌhaɪpərˈlɛθərdʒi/","syllables":"hy-per-leth-ar-gy"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Hyperlethargy' is a medical term that describes a state of extreme drowsiness or sluggishness, more severe than typical lethargy. It often indicates an underlying medical issue or a side effect of medication.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am feeling hyperlethargic, so I will go for a run.","correct":"✓ I am feeling hyperlethargic, so I will rest.","note":"Hyperlethargy implies a lack of energy, so resting is more appropriate than exercising."}],"priority":"★★☆"},"related_words":{"derivatives":["hyperlethargic (adjective)"],"phrasal_verbs":null,"priority":"★★★"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hyperlethargy' is a specialized medical term indicating an extreme state of drowsiness or sluggishness, often associated with underlying medical conditions or medication side effects. It's more severe than typical lethargy and implies a significant reduction in alertness and responsiveness. This term is primarily used in medical or scientific contexts."},"example_sentences":[{"sentence":"The patient's hyperlethargy made it difficult to conduct a thorough examination.","translation":"患者の過度の嗜眠により、詳細な検査を実施することが困難になった。","type":"noun","meaning_category":"過度の嗜眠"},{"sentence":"One of the side effects of the new drug was hyperlethargy, causing patients to sleep for extended periods.","translation":"新薬の副作用の一つは過度の嗜眠であり、患者は長期間睡眠することになった。","type":"noun","meaning_category":"過度の嗜眠"},{"sentence":"The doctor noted the patient's hyperlethargy in the medical chart, along with other symptoms.","translation":"医師は、他の症状とともに、患者の過度の嗜眠をカルテに記録した。","type":"noun","meaning_category":"過度の嗜眠"}]}