{"word":"Eidograph","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"拡大・縮小可能な図面複写機、エイドグラフ","english_definition":"An instrument for copying drawings on the same or on an enlarged or reduced scale.","examples":[{"sentence":"The architect used an eidograph to create scaled copies of the blueprints.","translation":"建築家はエイドグラフを使って、青写真の拡大縮小コピーを作成した。"},{"sentence":"The museum displayed an antique eidograph, showcasing its historical significance in drafting.","translation":"博物館では、製図における歴史的意義を示すアンティークのエイドグラフが展示されていた。"}],"collocations":["use an eidograph","antique eidograph","historical eidograph"],"synonyms":["pantograph","copying machine","drafting instrument"],"antonyms":[]}],"etymology":{"value":"The word \"eidograph\" comes from the Greek words \"eido-\" (form, shape) and \"-graph\" (writing, drawing).","priority":"★★☆"},"pronunciation":{"ipa":"ˈaɪdəˌɡræf","syllables":"Ei-do-graph"},"inflection":{"noun_plural":"eidographs"},"usage_notes":{"explanation":"An eidograph is a mechanical drawing instrument used for copying a drawing and for enlarging or reducing it to a desired scale. It is a type of pantograph.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a eidograph to take a photo.","correct":"✓ I used an eidograph to copy the drawing.","note":"An eidograph is used for copying drawings, not taking photos."}],"priority":"★★☆"},"related_words":{"derivatives":["eidographic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'eidograph' refers to a specialized drawing instrument used for creating scaled copies of drawings. Due to its specific function and historical context, it is not a commonly used word in everyday language. Understanding its meaning requires familiarity with technical drawing or historical drafting practices."},"example_sentences":[{"sentence":"The cartographer employed an eidograph to accurately reproduce maps at different scales.","translation":"地図製作者は、異なる縮尺で地図を正確に複製するためにエイドグラフを使用した。","type":"noun","meaning_category":"Instrument for copying drawings"},{"sentence":"Early eidographs were made of wood, while later models incorporated metal components for greater precision.","translation":"初期のエイドグラフは木製だったが、後のモデルでは精度を高めるために金属部品が組み込まれた。","type":"noun","meaning_category":"Instrument for copying drawings"}]}