{"word":"Acipenseroid","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"チョウザメ目の","english_definition":"Relating to the Acipenseriformes order of fish (sturgeons and paddlefishes).","examples":[{"sentence":"Acipenseroid fishes are characterized by their cartilaginous skeletons.","translation":"チョウザメ目の魚は、軟骨性の骨格を特徴とする。"}],"collocations":[],"synonyms":["sturgeon-like"],"antonyms":[]},{"part_of_speech":"noun","definition":"チョウザメ目の魚","english_definition":"A fish belonging to the order Acipenseriformes (sturgeons and paddlefishes).","examples":[{"sentence":"The acipenseroids are an ancient group of fishes.","translation":"チョウザメ目の魚は古代魚の一群である。"}],"collocations":[],"synonyms":["sturgeon"],"antonyms":[]}],"etymology":{"value":"From the taxonomic name Acipenseriformes, referring to the order that includes sturgeons and paddlefishes.","priority":"★★☆"},"pronunciation":{"ipa":"/əˌsɪpənˈsɔɪd/","syllables":"a-cip-en-ser-oid"},"inflection":{"noun_plural":"Acipenseroids"},"usage_notes":{"explanation":"'Acipenseroid' is a term used in zoology and ichthyology to refer to fish belonging to the order Acipenseriformes, which includes sturgeons and paddlefishes. It can be used as both an adjective and a noun.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Acipenseriformes (noun: the order of sturgeons and paddlefishes)","Acipenser (noun: the genus of true sturgeons)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'acipenseroid' is a technical term used in the field of zoology and ichthyology. It refers specifically to fish belonging to the order Acipenseriformes, which encompasses sturgeons and paddlefishes. Understanding and using this term requires familiarity with biological classification systems."},"example_sentences":[{"sentence":"The museum exhibited several fossil specimens of acipenseroid fish.","translation":"博物館では、チョウザメ目の魚の化石標本がいくつか展示されていた。","type":"noun","meaning_category":"魚"},{"sentence":"Conservation efforts are crucial for protecting acipenseroid species from extinction.","translation":"チョウザメ目の種を絶滅から守るためには、保護活動が不可欠である。","type":"adjective","meaning_category":"チョウザメ目に関する"}]}