{"word":"Huipils","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A traditional garment worn by indigenous women in Central America and Mexico, typically a loose-fitting tunic made from woven fabric, often adorned with intricate embroidery or designs.","english_definition":"A traditional, handwoven garment worn by indigenous women in Central America and parts of Mexico. It is typically a loose-fitting tunic, often heavily decorated with embroidery, brocade, or other embellishments that signify the wearer's community, marital status, or religious beliefs.","examples":[{"sentence":"The market was filled with women selling colorful huipils.","translation":"市場は色とりどりのウィピルを売る女性たちでいっぱいだった。"},{"sentence":"Each huipil tells a story through its unique patterns and symbols.","translation":"それぞれのウィピルは、その独特な模様とシンボルを通して物語を語る。"},{"sentence":"She wore a huipil that had been passed down through generations of her family.","translation":"彼女は家族の世代から受け継がれてきたウィピルを着ていた。"}],"collocations":["wear a huipil","embroidered huipil","traditional huipil","colorful huipil","handwoven huipil"],"synonyms":["tunica","blouse","smock"],"antonyms":[]}],"etymology":{"value":"The word \"huipil\" comes from the Nahuatl word *huīpīlli*, meaning 'blouse' or 'dress'. Nahuatl was the language of the Aztec Empire and is still spoken by many indigenous people in Mexico.","priority":"★★★"},"pronunciation":{"ipa":"/wiˈpilz/","syllables":"hui-pils"},"inflection":{"noun_plural":"huipils"},"usage_notes":{"explanation":"Huipils are more than just clothing; they are cultural artifacts that reflect the history, identity, and artistic traditions of the communities that create them. The designs and colors often have specific meanings, and the way a huipil is worn can indicate a woman's social status or role within her community.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She wore a beautiful huipil dress.","correct":"✓ She wore a beautiful huipil.","note":"The word \"huipil\" already refers to a type of dress or tunic, so adding \"dress\" is redundant."},{"incorrect":"✗ Huipils are only worn by poor people.","correct":"✓ Huipils are worn by indigenous women as a cultural tradition, regardless of their economic status.","note":"Huipils are worn as a cultural tradition, not necessarily because of poverty."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["textiles","embroidery","indigenous cultures","Central America","Mexico","Nahuatl"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"huipil\" refers to a specific type of traditional garment worn by indigenous women in Central America and Mexico. Understanding the term requires familiarity with the cultural context and textile traditions of these regions. While not a commonly used word in general English, it is important in discussions of anthropology, cultural studies, and textile arts."},"example_sentences":[{"sentence":"Many museums display antique huipils as examples of indigenous artistry.","translation":"多くの博物館では、ウィピルのアンティーク品を先住民の芸術の例として展示している。","type":"noun","meaning_category":"traditional garment"},{"sentence":"The intricate designs on her huipil showcased the weaving skills of her village.","translation":"彼女のウィピルに施された複雑なデザインは、彼女の村の織りの技術を物語っていた。","type":"noun","meaning_category":"traditional garment"},{"sentence":"Tourists often purchase huipils as souvenirs of their travels in Guatemala.","translation":"観光客はグアテマラ旅行のお土産としてウィピルを購入することが多い。","type":"noun","meaning_category":"traditional garment"}]}