{"word":"purificatory","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"浄化の、清めの、浄化作用のある","english_definition":"having the effect or purpose of purifying; cleansing.","examples":[{"sentence":"The ritual had a purificatory effect on the participants.","translation":"その儀式は参加者に浄化作用をもたらした。"},{"sentence":"The fire was believed to have a purificatory power.","translation":"その火は浄化の力を持つと信じられていた。"},{"sentence":"They used special herbs for their purificatory properties.","translation":"彼らは浄化作用のある特別なハーブを使った。"}],"collocations":["purificatory ritual (浄化の儀式)","purificatory power (浄化の力)","purificatory properties (浄化作用)","purificatory effect (浄化効果)","purificatory process (浄化過程)"],"synonyms":["cleansing","expiatory","ablutionary","cathartic","lustral"],"antonyms":["polluting","contaminating","defiling"]}],"etymology":{"value":"Late Middle English: from late Latin purificatorius, from purificare ‘make pure’ (see purify).","priority":"★★☆"},"pronunciation":{"ipa":"/pjʊˈrɪfɪkətəri/","syllables":"pu-rif-i-ca-to-ry"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"'Purificatory' is an adjective primarily used to describe something that has the quality or function of purifying, making something clean, or removing impurities. It is often used in religious, spiritual, or ceremonial contexts to describe rituals, processes, or substances that are believed to cleanse or purify individuals or objects. It can also be used in a more general sense to describe processes or substances that cleanse or purify in a non-spiritual context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The purificatory is very important for the ceremony.","correct":"✓ The purificatory ritual is very important for the ceremony.","note":"'Purificatory' is an adjective and needs to be followed by a noun. 'Ritual', 'process', or 'substance' are suitable nouns."},{"incorrect":"✗ He felt purificatory after the bath.","correct":"✓ He felt purified after the bath.","note":"'Purificatory' describes something that purifies. To describe how someone feels after being purified, use 'purified'."}],"priority":"★★☆"},"related_words":{"derivatives":["purify (verb: 浄化する)","purification (noun: 浄化)","pure (adjective: 純粋な)","purity (noun: 純粋さ)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'purificatory' is a relatively uncommon and formal adjective. It is used to describe something that has the quality or function of purifying, meaning to make something clean or remove impurities. This word is most often encountered in contexts related to religious rituals, spiritual practices, or specialized scientific or technical processes. Because of its specific and somewhat elevated usage, it is more likely to be found in formal writing or academic texts than in everyday conversation."},"example_sentences":[{"sentence":"The ancient Egyptians practiced purificatory rites along the Nile River.","translation":"古代エジプト人はナイル川沿いで浄化の儀式を行った。","type":"adjective","meaning_category":"浄化の"},{"sentence":"The steam bath had a purificatory effect on his skin.","translation":"スチームバスは彼の肌に浄化効果をもたらした。","type":"adjective","meaning_category":"浄化作用のある"},{"sentence":"The spring water was believed to have purificatory properties that could heal the sick.","translation":"その湧き水は病人を癒す浄化作用を持つと信じられていた。","type":"adjective","meaning_category":"清めの"}]}