{"word":"shelffuls","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"棚いっぱいの量、たくさんの棚","english_definition":"The amount that fills several shelves; many shelves' worth.","examples":[{"sentence":"The library contained shelffuls of books on every subject imaginable.","translation":"その図書館には、想像できるあらゆる主題に関する本が棚いっぱいにあった。"},{"sentence":"The store had shelffuls of the latest gadgets.","translation":"その店には最新のガジェットが棚いっぱいに並んでいた。"}],"collocations":["shelffuls of books","shelffuls of merchandise"],"synonyms":["many shelves of","numerous shelves of","a large quantity of"],"antonyms":["a few shelves of","a small quantity of"]}],"etymology":{"value":"Derived from 'shelf' (a flat length of wood or other rigid material, attached to a wall or forming part of a piece of furniture, that provides a surface for the storage or display of objects) and 'ful' (a suffix meaning 'full of').","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʃɛlfˌfʊlz/","syllables":"shelf-fuls"},"inflection":{"noun_plural":"shelffuls"},"usage_notes":{"explanation":"'Shelffuls' is the plural form of 'shelfful', which means the amount or quantity that fills a shelf. It is used to describe a large quantity of items that occupy multiple shelves. The word is relatively uncommon but is useful for vividly describing a large collection or stock of items.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The room was filled with shelfful of toys.","correct":"✓ The room was filled with shelffuls of toys.","note":"'Shelfful' is singular, but when referring to multiple shelves, use the plural form 'shelffuls'."}],"priority":"★★☆"},"related_words":{"derivatives":["shelf","shelfful"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Shelffuls' is a relatively uncommon word used to describe a large quantity of items filling multiple shelves. It is formed by combining 'shelf' and 'ful' (meaning 'full of'). Understanding this word requires a good vocabulary and the ability to recognize less common plural forms. It's typically found in descriptive writing where the author wants to emphasize the abundance of items.","priority":"★★☆"},"example_sentences":[{"sentence":"The antique shop was crammed with shelffuls of porcelain dolls.","translation":"その骨董品店は、磁器の人形で棚いっぱいに詰め込まれていた。","type":"descriptive","meaning_category":"quantity"},{"sentence":"The library contained shelffuls of ancient manuscripts.","translation":"その図書館には、古代の写本が棚いっぱいにあった。","type":"descriptive","meaning_category":"quantity"}]}