{"word":"theodicies","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"神義論（神の正義を弁護する理論、特に全能・全知・全善である神が存在するにもかかわらず、なぜ悪が存在するのかを説明しようとする試み）","english_definition":"plural of theodicy: explanations or defenses of God's goodness and omnipotence in the face of evil in the world.","examples":[{"sentence":"Different theodicies have been proposed to reconcile the existence of evil with the belief in an all-good, all-powerful God.","translation":"悪の存在と全善全能の神への信仰を両立させるために、さまざまな神義論が提唱されてきた。"}],"collocations":["develop theodicies","explore theodicies","classical theodicies","contemporary theodicies"],"synonyms":["divine justice explanation","justification of God's ways","defense of divine goodness"],"antonyms":[]}],"etymology":{"value":"The word \"theodicy\" comes from the Greek words \"theos\" (God) and \"dikē\" (justice). It was coined by Gottfried Wilhelm Leibniz in his 1710 work \"Théodicée\" to address the problem of evil.","priority":"★★★"},"pronunciation":{"ipa":"/θiˈɒdɪsiz/","syllables":"the-od-i-cies"},"inflection":{"noun_plural":"theodicies","noun_singular":"theodicy"},"usage_notes":{"explanation":"\"Theodicy\" is a philosophical and theological term. It is often used in discussions about the problem of evil, which questions how an all-powerful, all-knowing, and all-good God can allow evil to exist. Different theodicies offer different explanations, such as free will, the greater good, or the limitations of human understanding.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Theodicy are important for understanding religious beliefs.","correct":"✓ Theodicies are important for understanding religious beliefs.","note":"Since 'theodicies' is the plural form, it should be used with a plural verb."},{"incorrect":"✗ He presented a theodicies to explain suffering.","correct":"✓ He presented a theodicy to explain suffering.","note":"When referring to a single explanation, use the singular form 'theodicy'."}],"priority":"★★☆"},"related_words":{"derivatives":["theodical (adjective)","theodicean (adjective)"],"phrases":["problem of evil","divine justice","free will defense","soul-making theodicy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'theodicies' is a plural form of 'theodicy,' which is a complex philosophical and theological term. It refers to various attempts to justify God's goodness and omnipotence in the face of the existence of evil in the world. Understanding this term requires familiarity with philosophical and religious concepts related to the problem of evil. It is typically encountered in advanced academic discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"Scholars have proposed numerous **theodicies** to reconcile faith and suffering.","translation":"学者は、信仰と苦しみを調和させるために、数多くの神義論を提唱してきた。","type":"noun","meaning_category":"神義論"},{"sentence":"Theodicies often grapple with the question of why innocent people suffer.","translation":"神義論はしばしば、なぜ罪のない人々が苦しむのかという問題に取り組む。","type":"noun","meaning_category":"神義論"},{"sentence":"Leibniz's **theodicy** is a famous attempt to justify God's actions.","translation":"ライプニッツの神義論は、神の行いを正当化する有名な試みである。","type":"noun","meaning_category":"神義論"}]}