{"word":"business-provided","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"企業が提供する、会社支給の","english_definition":"Supplied or made available by a business or company, typically for its employees.","examples":[{"sentence":"The employee received a business-provided laptop for work.","translation":"従業員は業務のために会社支給のラップトップを受け取った。"},{"sentence":"The company offers business-provided health insurance to all full-time staff.","translation":"その会社はすべてのフルタイムの従業員に会社支給の健康保険を提供している。"},{"sentence":"Business-provided training is essential for professional development.","translation":"企業が提供する研修は、専門能力開発に不可欠である。"}],"collocations":["business-provided car","business-provided phone","business-provided accommodation","business-provided benefits","business-provided equipment"],"synonyms":["company-supplied","employer-provided","corporate-provided","organization-provided"],"antonyms":["personally-owned","privately-owned","employee-purchased"]}],"etymology":{"value":"Combination of \"business\" (referring to a commercial enterprise) and \"provided\" (past participle of \"provide,\" meaning to supply or make available).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɪznəs prəˈvaɪdɪd/","syllables":"biz-ness pro-vi-ded"},"inflection":{"notes":"Adjective; does not inflect for number or gender."},"usage_notes":{"explanation":"\"Business-provided\" is used to describe something that a company gives or makes available to its employees, often as a benefit or to facilitate their work. It emphasizes that the item or service is not purchased or obtained by the employee themselves, but rather is supplied by the company.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The business provided car was very useful.","correct":"✓ The business-provided car was very useful.","note":"Hyphenation is important when using \"business-provided\" as a compound adjective before a noun."},{"incorrect":"✗ The company provided a car business.","correct":"✓ The company provided a business-provided car.","note":"The word order changes the meaning. \"A car business\" refers to a company that sells cars, while \"a business-provided car\" refers to a car given to an employee by a company."}],"priority":"★★☆"},"related_words":{"derivatives":["business","provide","provided"],"phrasal_verbs":["N/A"],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency. More common in business and HR contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"business-provided\" is a compound adjective that describes something supplied by a company, typically for its employees. It's commonly used in professional settings when discussing benefits, equipment, or services offered by a business. Understanding this term is useful for comprehending workplace policies and employee benefits packages."},"example_sentences":[{"sentence":"The sales team uses business-provided tablets to record customer information.","translation":"営業チームは顧客情報を記録するために会社支給のタブレットを使用している。","type":"adjective","meaning_category":"Company-supplied equipment"},{"sentence":"Our business-provided healthcare plan covers dental and vision.","translation":"当社の会社支給の医療保険プランは歯科と視覚をカバーしている。","type":"adjective","meaning_category":"Company-supplied benefits"},{"sentence":"The company offers business-provided transportation to employees who live far from the office.","translation":"会社はオフィスから遠くに住む従業員に会社支給の交通手段を提供している。","type":"adjective","meaning_category":"Company-supplied service"}]}