{"word":"girolle","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"アンズタケ","english_definition":"A widely distributed edible mushroom with a bright yellow to orange cap.","examples":[{"sentence":"We found several girolles in the forest.","translation":"私たちは森でいくつかのアンズタケを見つけました。"},{"sentence":"Girolles are prized for their delicate flavor.","translation":"アンズタケはその繊細な風味で珍重されています。"}],"collocations":["fresh girolles","sautéed girolles","girolle mushroom"],"synonyms":["chanterelle"],"antonyms":[]}],"etymology":{"value":"From French girolle, diminutive of girole, from Latin gyrare 'to turn'. Refers to the wavy edge of the mushroom cap.","priority":"★★☆"},"pronunciation":{"ipa":"/ʒɪˈrɒl/","syllables":"gi-rolle"},"inflection":{"noun_plural":"girolles"},"usage_notes":{"explanation":"Girolle is the French name for the chanterelle mushroom. It is a highly sought-after edible mushroom known for its fruity aroma and delicate flavor. It is often used in French cuisine.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate a lot of girolla.","correct":"✓ I ate a lot of girolles.","note":"Girolle is a countable noun, so use the plural form 'girolles' when referring to more than one mushroom."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Girolle' is a relatively uncommon word, primarily used in culinary contexts or when discussing specific types of mushrooms. It refers to a type of edible mushroom, also known as a chanterelle, and is more frequently used in French cuisine. Understanding this word is helpful for those interested in gourmet cooking or mycology."},"example_sentences":[{"sentence":"The chef prepared a delicious sauce with fresh girolles.","translation":"シェフは新鮮なアンズタケを使った美味しいソースを作った。","type":"noun","meaning_category":"mushroom"},{"sentence":"Girolles are often found near oak and birch trees.","translation":"アンズタケはしばしばオークやカバの木の近くで見つかる。","type":"noun","meaning_category":"mushroom"}]}