{"word":"gonotocont","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(genetics) A cell or organism that contains genetic material from only one parent, due to the loss or inactivation of the genetic material from the other parent.","english_definition":"A cell or organism that contains genetic material from only one parent, due to the loss or inactivation of the genetic material from the other parent.","examples":[{"sentence":"The resulting gonotocont displayed only the maternal genetic markers.","translation":"結果として生じたゴノトコントは、母親由来の遺伝子マーカーのみを示した。"},{"sentence":"Researchers are studying gonotoconts to understand the mechanisms of uniparental inheritance.","translation":"研究者たちは、片親遺伝のメカニズムを理解するためにゴノトコントを研究している。"}],"collocations":["create a gonotocont","study gonotoconts","uniparental gonotocont"],"synonyms":["haploid","uniparental cell"],"antonyms":["zygote","diploid"]}],"etymology":{"value":"From Ancient Greek γόνος (gónos, “offspring, seed”) + τόκος (tókos, “birth, offspring”) + -ont.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡɒnətoʊˈkɒnt/","syllables":"go-no-to-cont"},"inflection":{"noun_plural":"gonotoconts"},"usage_notes":{"explanation":"The term 'gonotocont' is primarily used in genetics and developmental biology to describe cells or organisms that have lost the genetic contribution from one parent. This can occur naturally or be induced experimentally. It is important to note that while a gonotocont contains genetic material from only one parent, it is not necessarily haploid (having half the usual number of chromosomes), as the remaining genetic material may be duplicated.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The gonotocont was created by adding genetic material.","correct":"✓ The gonotocont was created by removing genetic material.","note":"Gonotoconts are created by *removing* or inactivating genetic material from one parent, not by adding genetic material."},{"incorrect":"✗ Gonotoconts are the same as haploid cells.","correct":"✓ Gonotoconts are not necessarily the same as haploid cells, as they may have a duplicated set of chromosomes from one parent.","note":"While some gonotoconts may be haploid, the term specifically refers to the *uniparental* origin of the genetic material, not necessarily the number of chromosomes."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["uniparental disomy","parthenogenesis","androgenesis","gynogenesis"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - specialized term used in genetics.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'gonotocont' is a highly specialized term used within the fields of genetics and developmental biology. It refers to a cell or organism that possesses genetic material derived from only one parent due to the loss or inactivation of the other parent's genetic contribution. Understanding this term requires a solid foundation in genetics, including concepts like uniparental inheritance, haploidy, and diploidy. It is not a term commonly encountered outside of advanced scientific literature and research."},"example_sentences":[{"sentence":"Artificial gonotoconts can be generated in the laboratory to study the effects of uniparental inheritance.","translation":"人工的なゴノトコントは、片親遺伝の影響を研究するために実験室で生成できる。","type":"noun","meaning_category":"genetics"},{"sentence":"The development of a gonotocont can lead to unusual phenotypes due to the absence of genetic information from one parent.","translation":"ゴノトコントの発生は、一方の親からの遺伝情報がないために、通常とは異なる表現型につながる可能性がある。","type":"noun","meaning_category":"genetics"}]}