{"word":"Sabellidae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ケヤリムシ科：多毛綱に属する環形動物の一科。砂や泥の中に棲み、触手冠を広げてプランクトンなどを捕食する。","english_definition":"A family of annelid worms in the class Polychaeta, commonly known as feather duster worms. They live in tubes in sand or mud and extend a crown of radioles to filter feed on plankton and other suspended particles.","examples":[{"sentence":"Sabellidae are known for their beautiful feather-like crowns.","translation":"ケヤリムシ科は、その美しい羽のような触手冠で知られています。"},{"sentence":"Many species of Sabellidae build tubes from sand grains and mucus.","translation":"ケヤリムシ科の多くの種は、砂粒と粘液から管を作ります。"}],"collocations":["feather duster worm","tube worm","filter feeder","marine invertebrate"],"synonyms":["feather duster worm","fan worm"],"antonyms":[]}],"etymology":{"value":"New Latin, from Sabella (genus name) + -idae (standard suffix used to form the names of animal families). Sabella is named after Sabella, an ancient Sabine woman known for her beauty.","priority":"★★☆"},"pronunciation":{"ipa":"/səˈbɛlɪdiː/","syllables":"sa-bel-li-dee"},"inflection":{"noun_plural":"Sabellids or Sabellidae"},"usage_notes":{"explanation":"Sabellidae is a taxonomic term used in biology and marine science. It refers specifically to the family of feather duster worms. When referring to a single member of this family, it is common to use the term 'sabellid worm'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Sabellidae on the beach.","correct":"✓ I saw a sabellid worm on the beach.","note":"'Sabellidae' refers to the family, so use 'sabellid worm' for a single individual."}],"priority":"★☆☆"},"related_words":{"derivatives":["sabellid (noun, adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Specialized scientific vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Sabellidae' is a scientific term used in the field of marine biology. It refers to a specific family of polychaete worms known as feather duster worms or fan worms. Understanding this term requires familiarity with biological classification systems and marine invertebrate zoology. It is not commonly used outside of scientific contexts."},"example_sentences":[{"sentence":"The diversity of Sabellidae in coral reef ecosystems is significant.","translation":"サンゴ礁生態系におけるケヤリムシ科の多様性は重要です。","type":"noun","meaning_category":"Taxonomy"},{"sentence":"Sabellidae use their radioles to capture food particles from the water column.","translation":"ケヤリムシ科は、その触手冠を使って水中の食物粒子を捕獲します。","type":"noun","meaning_category":"Biology"}]}