{"word":"tightly-coiffed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(髪型が)きっちりと整えられた、かっちりとセットされた","english_definition":"(of hair) styled in a neat and elaborate way, often with the use of hairspray or other styling products to hold it firmly in place.","examples":[{"sentence":"The socialite arrived at the gala with her tightly-coiffed hair gleaming under the lights.","translation":"その社交界の名士は、ライトの下で輝くきっちりと整えられた髪でガラに到着した。"},{"sentence":"The news anchor's tightly-coiffed hairstyle never seemed to move, even during a live broadcast.","translation":"そのニュースキャスターのかっちりとセットされた髪型は、生放送中でも決して乱れることがないようだった。"},{"sentence":"She spent hours each week maintaining her tightly-coiffed updo.","translation":"彼女は毎週何時間もかけて、きっちりと整えられたアップスタイルを維持していた。"}],"collocations":["tightly-coiffed hair","tightly-coiffed updo","tightly-coiffed hairstyle"],"synonyms":["immaculately styled","perfectly groomed","meticulously arranged","elaborately styled","carefully set"],"antonyms":["disheveled","messy","unruly","windswept","natural"]},{"part_of_speech":"adjective","definition":"(比喩的に)かっちりとした、隙のない、厳格な","english_definition":"(figuratively) meticulously organized, controlled, or presented; lacking spontaneity or flexibility.","examples":[{"sentence":"The politician's tightly-coiffed image was carefully crafted by his PR team.","translation":"その政治家の隙のないイメージは、PRチームによって注意深く作り上げられた。"},{"sentence":"The presentation was so tightly-coiffed that it felt impersonal and lacked genuine connection with the audience.","translation":"そのプレゼンテーションはかっちりとしすぎていて、非個人的で、聴衆との真のつながりを欠いているように感じられた。"}],"collocations":["tightly-coiffed image","tightly-coiffed presentation","tightly-coiffed persona"],"synonyms":["controlled","calculated","contrived","stiff","formal"],"antonyms":["spontaneous","natural","relaxed","unscripted"]}],"etymology":{"value":"The term is a combination of 'tightly' (adverb, meaning firmly or closely) and 'coiffed' (past participle of the verb 'coiff,' meaning to style or arrange hair). 'Coiff' itself comes from the French word 'coiffer,' meaning to arrange the hair.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtaɪtli ˈkwɑft/","syllables":"tight-ly-coiffed"},"inflection":{"notes":"This is an adjective, so it does not inflect for tense or number."},"usage_notes":{"explanation":"'Tightly-coiffed' generally describes a hairstyle that is meticulously styled and firmly held in place, often giving a polished and somewhat artificial appearance. It can also be used figuratively to describe something that is overly controlled or lacks spontaneity. The term often carries a connotation of formality and attention to detail.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"She had a tightly-coiffed dress.","correct":"She had a tightly-coiffed hairstyle.","note":"'Tightly-coiffed' specifically refers to hair, not clothing or other items."},{"incorrect":"The tightly-coiffed was beautiful.","correct":"The tightly-coiffed hair was beautiful.","note":"'Tightly-coiffed' is an adjective and needs a noun to modify, such as 'hair' or 'hairstyle'."}],"priority":"★★☆"},"related_words":{"derivatives":["coiffure (noun: a hairstyle)","coif (noun: a close-fitting cap)","coiff (verb: to style or arrange hair)"],"phrases":["immaculately groomed","perfectly styled","carefully arranged"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tightly-coiffed' is a relatively uncommon and descriptive term used to describe a hairstyle that is meticulously styled and firmly held in place. It often implies a sense of formality and attention to detail. The word is most often used in writing to create a vivid image of a person's appearance. Due to its specific meaning and relatively low frequency, it is more likely to be encountered in advanced texts or specialized contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The queen's tightly-coiffed hair was a symbol of her regal status.","translation":"女王のきっちりと整えられた髪は、彼女の王室の地位の象徴だった。","type":"descriptive","meaning_category":"hair style"},{"sentence":"The lawyer's tightly-coiffed arguments left no room for doubt.","translation":"その弁護士の隙のない主張は、疑いの余地を残さなかった。","type":"figurative","meaning_category":"meticulously organized"}]}