{"word":"terror-fleet","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A fleet of ships or vehicles used to spread terror or intimidation.","english_definition":"A group of ships or vehicles deliberately used to inspire fear or intimidation, often through aggressive or destructive actions.","examples":[{"sentence":"The dictator dispatched a terror-fleet to the coastal cities to quell any potential uprising.","translation":"独裁者は、潜在的な反乱を鎮圧するために、沿岸都市にテロ艦隊を派遣した。"},{"sentence":"The pirate terror-fleet was known for raiding villages and leaving a trail of destruction.","translation":"海賊のテロ艦隊は、村々を襲撃し、破壊の跡を残すことで知られていた。"}],"collocations":["dispatch a terror-fleet","pirate terror-fleet","terror-fleet raid","terror-fleet patrol"],"synonyms":["intimidation fleet","menace fleet","assault fleet","raid fleet"],"antonyms":["peacekeeping fleet","humanitarian fleet","rescue fleet"]}],"etymology":{"value":"Combination of 'terror' (extreme fear) and 'fleet' (a group of ships or vehicles).","priority":"N/A"},"pronunciation":{"ipa":"/ˈtɛrərˌfliːt/","syllables":"ter-ror-fleet"},"inflection":{"noun_plural":"terror-fleets"},"usage_notes":{"explanation":"The term 'terror-fleet' is not a common or widely recognized term in standard English. It is a descriptive term, often used in fictional or dramatic contexts, to emphasize the intent and effect of a fleet's actions. It implies that the primary purpose of the fleet is to instill fear and control through violence or the threat of violence.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The terror-fleet was happiness to the people.","correct":"✓ The terror-fleet brought terror to the people.","note":"Terror-fleets do not bring happiness; they are designed to instill fear. The correct usage reflects the intended purpose of the fleet."},{"incorrect":"✗ He saw a terror-fleet of birds.","correct":"✓ He saw a flock of birds.","note":"'Terror-fleet' specifically refers to ships or vehicles. For birds, use 'flock'."}],"priority":"N/A"},"related_words":{"derivatives":["terror (noun)","fleet (noun)","terrorize (verb)"],"phrases":["fleet of terror","ships of terror","vehicles of terror"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - likely a neologism or specialized term.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'terror-fleet' is a compound noun that combines the concepts of 'terror' and 'fleet.' It is used to describe a group of ships or vehicles whose primary purpose is to instill fear and intimidation. Due to its specific and often dramatic usage, it is not a common term in everyday language and is more likely to be encountered in fictional or specialized contexts. Understanding the term requires a grasp of both the literal meaning of its components and the implied intent behind its use."},"example_sentences":[{"sentence":"The terror-fleet approached the city, its dark hulls casting long shadows on the water.","translation":"テロ艦隊が都市に接近し、その黒い船体が水面に長い影を落とした。","type":"noun","meaning_category":"fleet used to spread terror"},{"sentence":"News of the approaching terror-fleet caused widespread panic among the coastal villages.","translation":"接近するテロ艦隊の知らせは、沿岸の村々に広範囲なパニックを引き起こした。","type":"noun","meaning_category":"fleet used to spread terror"}]}