{"word":"overeater","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"食べ過ぎる人、過食症の人","english_definition":"a person who eats excessively; someone who suffers from overeating.","examples":[{"sentence":"He was a compulsive overeater, often consuming huge amounts of food in one sitting.","translation":"彼は強迫的な過食症で、一度に大量の食べ物を消費することが多かった。"},{"sentence":"She realized she was an overeater and sought help from a therapist.","translation":"彼女は自分が食べ過ぎる人だと気づき、セラピストの助けを求めた。"},{"sentence":"Support groups can be helpful for overeaters trying to change their eating habits.","translation":"支援グループは、食習慣を変えようとしている過食症の人にとって役立つことがあります。"}],"collocations":["compulsive overeater (強迫的な過食症の人)","secret overeater (隠れて過食する人)","emotional overeater (感情的な過食をする人)"],"synonyms":["glutton","gourmand","binge eater"],"antonyms":["undereater","fussy eater","light eater"]},{"part_of_speech":"noun","definition":"(Overeaters Anonymousなどの)過食症者のための自助グループのメンバー","english_definition":"a member of a self-help group for people with eating disorders, such as Overeaters Anonymous.","examples":[{"sentence":"She found solace and support by attending Overeaters Anonymous meetings.","translation":"彼女は、過食症者のための自助グループのミーティングに参加することで、慰めとサポートを見つけました。"},{"sentence":"Many overeaters find comfort in sharing their experiences with others who understand.","translation":"多くの過食症者は、理解してくれる他の人と経験を共有することに慰めを見出します。"}],"collocations":["Overeaters Anonymous (過食症者のための自助グループ)"],"synonyms":["OA member"],"antonyms":[]}],"etymology":{"value":"'Over-' (過剰な) + 'eater' (食べる人) から構成される。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊvərˈiːtər/","syllables":"o-ver-eat-er"},"inflection":{"noun_plural":"overeaters"},"usage_notes":{"explanation":"The term \"overeater\" generally refers to someone who habitually eats excessively, often to the point of discomfort or health problems. It can also refer to someone who engages in binge eating, a more severe form of overeating. The term is often used in the context of support groups like Overeaters Anonymous (OA), a 12-step program for people struggling with compulsive overeating, bulimia, and anorexia.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a big eater, but not an overeater.","correct":"✓ He is a big eater, but not necessarily an overeater.","note":"A 'big eater' simply enjoys eating large portions, while an 'overeater' has a problem with controlling their eating habits, often driven by emotional or psychological factors."},{"incorrect":"✗ She is an overeater because she likes food.","correct":"✓ She is an overeater because she uses food to cope with emotions.","note":"Liking food doesn't make someone an overeater. Overeating is often linked to emotional or psychological issues."}],"priority":"★★☆"},"related_words":{"derivatives":["overeat (verb: 食べ過ぎる)","overeating (noun: 過食)"],"idioms_phrases":[],"related_medical_terms":["binge eating disorder (むちゃ食い障害)","bulimia nervosa (神経性大食症)","anorexia nervosa (神経性食欲不振症)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"比較的低い (Relatively low) - 特定の文脈で使われる単語。","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"overeater\" describes someone who regularly eats too much. This is different from just enjoying food or having a large appetite. Overeating is often connected to feelings or problems that someone is trying to deal with through food. The term is also used for people who are part of support groups like Overeaters Anonymous, which helps people who struggle with eating disorders. It's important to remember that overeating can be a sign of a more serious problem.","priority":"★★☆"},"example_sentences":[{"sentence":"Many people become **overeaters** as a way to cope with stress.","translation":"多くの人がストレスに対処する方法として過食症になります。","type":"noun","meaning_category":"食べ過ぎる人"},{"sentence":"Joining Overeaters Anonymous helped her overcome her eating disorder.","translation":"過食症者のための自助グループに参加したことが、彼女が摂食障害を克服するのに役立ちました。","type":"noun","meaning_category":"過食症者のための自助グループのメンバー"},{"sentence":"He admitted to being an **overeater** and sought professional help.","translation":"彼は自分が食べ過ぎる人であることを認め、専門家の助けを求めた。","type":"noun","meaning_category":"食べ過ぎる人"},{"sentence":"The support group is designed for **overeaters** who want to change their relationship with food.","translation":"その支援グループは、食べ物との関係を変えたい過食症者のために設計されています。","type":"noun","meaning_category":"過食症者のための自助グループのメンバー"}]}