{"word":"Anglo-Catholicism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"アングロ・カトリシズム：英国国教会（聖公会）における、カトリック的要素を重視する一潮流。典礼、聖餐、聖職者の権威、聖人崇敬などを強調する。","english_definition":"A tradition within Anglicanism that emphasizes its Catholic heritage and identity, including liturgical practices, the sacraments, the authority of clergy, and devotion to saints.","examples":[{"sentence":"Anglo-Catholicism has a strong emphasis on the sacraments.","translation":"アングロ・カトリシズムは聖餐を強く重視している。"},{"sentence":"Many Anglo-Catholic churches use incense and elaborate vestments.","translation":"多くのアングロ・カトリックの教会では、香や手の込んだ祭服を用いる。"},{"sentence":"Anglo-Catholicism seeks to bridge the gap between Anglicanism and Roman Catholicism.","translation":"アングロ・カトリシズムは、聖公会とローマ・カトリック教会の間の溝を埋めようとしている。"}],"collocations":["high church (ハイ・チャーチ：アングロ・カトリシズムの教会を指すことが多い)","liturgical worship (典礼的な礼拝)","sacramental theology (秘跡神学)","Catholic Revival (カトリック復興)"],"synonyms":["High Church Anglicanism","Catholic Anglicanism","Ritualism"],"antonyms":["Low Church Anglicanism","Evangelical Anglicanism"]},{"part_of_speech":"noun","definition":"アングロ・カトリシズムの信奉者","english_definition":"A person who adheres to the principles and practices of Anglo-Catholicism.","examples":[{"sentence":"He is a devout Anglo-Catholic.","translation":"彼は敬虔なアングロ・カトリックの信者だ。"},{"sentence":"Anglo-Catholics often have a deep appreciation for traditional church music.","translation":"アングロ・カトリックの信者は、伝統的な教会音楽を深く評価することが多い。"}],"collocations":["devout Anglo-Catholic","committed Anglo-Catholic"],"synonyms":["High Churchman","Catholic Anglican"],"antonyms":["Low Churchman","Evangelical Anglican"]}],"etymology":{"value":"\"Anglo-\"（英語の、英国の）と \"Catholicism\"（カトリシズム、普遍的なキリスト教信仰）の組み合わせ。英国国教会（聖公会）が、ローマ・カトリック教会から分離した後も、カトリック教会の伝統を受け継いでいることを示す。19世紀のオックスフォード運動（Oxford Movement）において、その傾向が顕著になった。","priority":"★★☆"},"pronunciation":{"ipa":"ˌæŋɡloʊ kəˈθɒlɪˌsɪzəm","syllables":"An-glo-Ca-thol-i-cism"},"inflection":{"notes":"名詞なので複数形は Anglo-Catholicisms"},"usage_notes":{"explanation":"\"Anglo-Catholicism\"は、英国国教会（聖公会）内の、カトリック的要素を強く志向する一派を指す言葉です。典礼、聖餐、聖職者の権威、聖人崇敬などを重視し、ローマ・カトリック教会との共通点を強調します。ただし、ローマ教皇の首位権は認めません。アングロ・カトリシズムの教会は、しばしば「ハイ・チャーチ（High Church）」と呼ばれ、典礼的な礼拝や伝統的な聖歌などを特徴とします。対照的に、福音主義的な傾向の強い教会は「ロー・チャーチ（Low Church）」と呼ばれます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Anglo-Catholicism is the same as Roman Catholicism.","correct":"✓ Anglo-Catholicism is a tradition within Anglicanism that emphasizes its Catholic heritage, but it is not the same as Roman Catholicism.","note":"アングロ・カトリシズムは聖公会の一潮流であり、ローマ・カトリック教会とは異なる。"},{"incorrect":"✗ All Anglican churches are Anglo-Catholic.","correct":"✓ Not all Anglican churches are Anglo-Catholic; there are also Low Church and Evangelical Anglican churches.","note":"聖公会には、アングロ・カトリックだけでなく、ロー・チャーチや福音主義的な教会もある。"}],"priority":"★☆☆"},"related_words":{"derivatives":["Anglo-Catholic (形容詞、名詞)","Anglicanism (聖公会)","Catholicism (カトリシズム)","Oxford Movement (オックスフォード運動)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"比較的低い (Relatively low) - 特定の宗教的文脈で用いられる。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Anglo-Catholicism\" refers to a specific movement within the Anglican Communion that emphasizes the Catholic aspects of its heritage. It is a term used in religious and historical contexts, and understanding it requires familiarity with the history of the Church of England and its relationship to the Roman Catholic Church. The term is not commonly used in everyday conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The Anglo-Catholic parish celebrated Mass with elaborate rituals.","translation":"そのアングロ・カトリックの教区は、手の込んだ儀式でミサを執り行った。","type":"noun","meaning_category":"アングロ・カトリシズム"},{"sentence":"He was raised in an Anglo-Catholic tradition and valued its liturgical practices.","translation":"彼はアングロ・カトリックの伝統の中で育ち、その典礼的な慣習を大切にしていた。","type":"adjective","meaning_category":"アングロ・カトリックの"},{"sentence":"Anglo-Catholicism played a significant role in the Oxford Movement of the 19th century.","translation":"アングロ・カトリシズムは、19世紀のオックスフォード運動において重要な役割を果たした。","type":"noun","meaning_category":"アングロ・カトリシズム"}]}