{"word":"Turkishness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"トルコ人であること、トルコ的な性質、トルコらしさ","english_definition":"The quality or state of being Turkish; Turkish character, attributes, or identity.","examples":[{"sentence":"The novel explores themes of Turkishness and cultural identity.","translation":"その小説は、トルコらしさと文化的アイデンティティのテーマを探求している。"},{"sentence":"He embraced his Turkishness after living abroad for many years.","translation":"彼は長年海外に住んだ後、自身のトルコ人としてのアイデンティティを受け入れた。"},{"sentence":"The exhibition showcased various aspects of Turkishness through art, music, and cuisine.","translation":"その展覧会は、芸術、音楽、料理を通してトルコらしさの様々な側面を紹介した。"}],"collocations":["aspects of Turkishness (トルコらしさの側面)","elements of Turkishness (トルコらしさの要素)","sense of Turkishness (トルコ人としての感覚)","identity of Turkishness (トルコらしさのアイデンティティ)","preserve Turkishness (トルコらしさを維持する)","promote Turkishness (トルコらしさを促進する)","celebrate Turkishness (トルコらしさを祝う)"],"synonyms":["Turkish identity","Turkish character","Turkish culture","Turkish heritage","Turkish spirit"],"antonyms":["foreignness","non-Turkishness"]}],"etymology":{"value":"'Turkish' + '-ness'. 'Turkish' refers to anything related to Turkey, its people, language, or culture. The suffix '-ness' is used to form abstract nouns denoting a state, condition, or quality.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtɜːrkɪʃnəs/","syllables":"Tur-kish-ness"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Turkishness' is an abstract noun that refers to the qualities, characteristics, or identity associated with being Turkish. It encompasses various aspects of Turkish culture, heritage, and national identity. The term is often used in discussions about cultural identity, national pride, and the preservation of Turkish traditions. It can also be used to describe something that is distinctly Turkish in character or style.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Turkishness are very friendly.","correct":"✓ Turkish people are very friendly.","note":"'Turkishness' is an abstract noun referring to the quality of being Turkish, not the people themselves. Use 'Turkish people' instead. "},{"incorrect":"✗ He is a Turkishness.","correct":"✓ He is Turkish.","note":"'Turkishness' refers to the state or quality of being Turkish, not a person. To describe a person's nationality, use 'Turkish'."}],"priority":"★★☆"},"related_words":{"derivatives":["Turkish (adjective, noun)","Turk (noun)","Turkic (adjective, noun)"],"phrases":["Turkish delight","Turkish coffee","Turkish bath","Turkish Angora"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, used in academic or cultural discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Turkishness' is a more complex and abstract term, often used in academic or cultural contexts. It refers to the essence or qualities that define what it means to be Turkish, encompassing cultural identity, heritage, and national characteristics. This word is less commonly used in everyday conversation and requires a deeper understanding of cultural and national identity concepts."},"example_sentences":[{"sentence":"The museum's exhibition aimed to capture the essence of Turkishness through various historical artifacts.","translation":"その博物館の展示は、様々な歴史的工芸品を通してトルコらしさの本質を捉えることを目的としていた。","type":"general","meaning_category":"general"},{"sentence":"Scholars debate the evolving definition of Turkishness in the context of globalization.","translation":"学者たちは、グローバル化の文脈におけるトルコらしさの進化する定義について議論している。","type":"academic","meaning_category":"academic"},{"sentence":"Traditional music and dance are integral to the expression of Turkishness.","translation":"伝統的な音楽とダンスは、トルコらしさを表現する上で不可欠である。","type":"cultural","meaning_category":"cultural"}]}