{"word":"employment-contingent","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"雇用を条件とする、雇用が条件となっている","english_definition":"Dependent on employment; conditional upon being employed.","examples":[{"sentence":"The offer of admission is employment-contingent; you must secure a job at the university to enroll.","translation":"入学許可は雇用を条件としています。入学するには大学での職を確保する必要があります。"},{"sentence":"His visa status is employment-contingent, meaning he can only stay in the country as long as he is employed.","translation":"彼のビザのステータスは雇用を条件としており、雇用されている限りにおいてのみ国内に滞在できることを意味します。"}],"collocations":["employment-contingent offer","employment-contingent visa","employment-contingent status"],"synonyms":["conditional on employment","dependent on employment","job-dependent"],"antonyms":["unconditional","independent of employment"]}],"etymology":{"value":"The term is formed by combining 'employment' (the state of having a job) and 'contingent' (dependent on certain conditions).","priority":"★★★"},"pronunciation":{"ipa":"/ɪmˈplɔɪmənt kənˈtɪndʒənt/","syllables":"em-ploy-ment con-tin-gent"},"inflection":{"notes":"It is an adjective, so it can be used to modify nouns. It does not have different forms for gender or number."},"usage_notes":{"explanation":"'Employment-contingent' is typically used in formal contexts, such as legal documents, contracts, or official communications. It specifies that a particular benefit, status, or opportunity is directly tied to the individual's employment status. If the person loses their job, they also lose the benefit or status.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The scholarship is contingent, it requires employment.","correct":"✓ The scholarship is employment-contingent; it requires employment.","note":"The adjective 'employment-contingent' should be used to directly describe the scholarship. Using 'contingent' alone is less specific."}],"priority":"★★☆"},"related_words":{"derivatives":["contingent (adjective: dependent on conditions)","employment (noun: the state of being employed)"],"phrasal_verbs":[],"related_terms":["job offer","visa status","conditional offer","terms of employment"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Employment-contingent' is a specialized term used to describe something that is dependent on having a job. It's often used in formal or legal contexts to specify that a benefit or status is tied to employment. This term is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The housing benefit is employment-contingent and will cease if you lose your job.","translation":"住宅手当は雇用を条件としており、失業すると停止されます。","type":"adjective","meaning_category":"Conditional"},{"sentence":"Many temporary work visas are employment-contingent, limiting the worker's ability to change jobs.","translation":"多くの一時的な就労ビザは雇用を条件としており、労働者の転職能力を制限しています。","type":"adjective","meaning_category":"Conditional"}]}