{"word":"attrition-increasing","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"摩耗を増加させる、消耗を増加させる","english_definition":"Causing an increase in attrition; tending to wear down or diminish something more quickly.","examples":[{"sentence":"The company's new policies were attrition-increasing, leading to a high turnover rate.","translation":"その会社の新しい方針は消耗を増加させるもので、高い離職率につながった。"},{"sentence":"The rough terrain made the hike attrition-increasing for the hikers' boots.","translation":"その険しい地形はハイカーのブーツにとって摩耗を増加させるハイキングとなった。"}],"collocations":["attrition-increasing policies","attrition-increasing factors","attrition-increasing conditions"],"synonyms":["wearing","depleting","eroding","damaging","accelerating depletion"],"antonyms":["attrition-reducing","conserving","preserving"],"notes":"This word is often used in business, military, or environmental contexts."}],"etymology":{"value":"Derived from 'attrition' (the process of wearing down or gradually reducing something) and 'increasing' (making something greater).","priority":"N/A"},"pronunciation":{"ipa":"/əˈtrɪʃən ɪnˈkriːsɪŋ/","syllables":"at-tri-tion in-creas-ing"},"inflection":{"notes":"This is an adjective and does not have different forms."},"usage_notes":{"explanation":"The term 'attrition-increasing' is used to describe factors or conditions that accelerate the rate at which something is worn down, depleted, or diminished. It is commonly used in contexts where the gradual loss or reduction of something is a concern.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The attrition-increasing of the tires was due to poor maintenance.","correct":"The attrition-increasing effect on the tires was due to poor maintenance.","note":"'Attrition-increasing' is an adjective, so it needs to modify a noun. In this case, 'effect' is a suitable noun."}],"priority":"N/A"},"related_words":{"derivatives":["attrition (noun)","increase (verb/noun)"],"phrases":["rate of attrition","employee attrition","customer attrition"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - specialized vocabulary.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Attrition-increasing' is a complex adjective used to describe something that causes an increase in the rate at which something is worn down or reduced. It's often used in professional or technical contexts, such as business or engineering. The word combines the concept of 'attrition,' which means a gradual reduction, with 'increasing,' meaning to make greater. Therefore, it describes something that makes the process of wearing down or reducing faster."},"example_sentences":[{"sentence":"The lack of training made the job attrition-increasing for new employees.","translation":"訓練の不足は、新しい従業員にとってその仕事を消耗を増加させるものにした。","type":"adjective","meaning_category":"causing increased attrition"},{"sentence":"The constant budget cuts were attrition-increasing to the department's resources.","translation":"絶え間ない予算削減は、部門の資源にとって消耗を増加させるものだった。","type":"adjective","meaning_category":"causing increased attrition"}]}