{"word":"anti-puncture","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"耐パンク性の、パンク防止の","english_definition":"Designed to resist or prevent punctures, especially in tires.","examples":[{"sentence":"These anti-puncture tires are perfect for cycling on rough terrain.","translation":"この耐パンクタイヤは、荒れた地形でのサイクリングに最適です。"},{"sentence":"The anti-puncture layer in the tire helps to prevent flats.","translation":"タイヤの耐パンク層は、パンクを防ぐのに役立ちます。"}],"collocations":["anti-puncture tire","anti-puncture sealant","anti-puncture layer"],"synonyms":["puncture-resistant","puncture-proof"],"antonyms":["non-puncture-resistant"]}],"etymology":{"value":"The word is formed by combining the prefix 'anti-' (meaning against) with 'puncture' (a hole made by a sharp object).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæntiˈpʌŋktʃər/","syllables":"an-ti-punc-ture"},"inflection":{"notes":"This is an adjective and does not have different forms."},"usage_notes":{"explanation":"'Anti-puncture' is commonly used to describe tires, particularly bicycle tires, that have been designed to resist punctures from sharp objects like glass, thorns, or nails. It refers to the feature of the tire, sealant, or other material that makes it more difficult to puncture.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The tire is anti-punctured.","correct":"✓ The tire is anti-puncture.","note":"'Anti-puncture' is an adjective, not a verb, so it doesn't take an '-ed' ending. Use it to describe the tire, not as a verb."}],"priority":"★★☆"},"related_words":{"derivatives":["anti- (prefix)","puncture (noun, verb)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Anti-puncture' is a technical term, mostly used in the context of tires, especially for bicycles. It means something is designed to resist being punctured by sharp objects. It's not a very common word in everyday conversation, but you might encounter it when discussing bicycles, tires, or related equipment."},"example_sentences":[{"sentence":"I invested in anti-puncture tires for my mountain bike.","translation":"私はマウンテンバイク用の耐パンクタイヤに投資しました。","type":"adjective","meaning_category":"耐パンク性の"},{"sentence":"The anti-puncture sealant worked perfectly, and I didn't get a single flat tire all season.","translation":"耐パンクシーラントが完璧に機能し、シーズン中一度もパンクしませんでした。","type":"adjective","meaning_category":"パンク防止の"}]}