{"word":"soot-fall","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"降煤、降下煤塵","english_definition":"The deposit of soot from the air.","examples":[{"sentence":"The soot-fall in the city has increased due to the factory emissions.","translation":"工場の排出により、都市部の降煤が増加している。"},{"sentence":"Residents complained about the heavy soot-fall on their cars and houses.","translation":"住民は、車や家へのひどい降煤について苦情を訴えた。"}],"collocations":["heavy soot-fall","increased soot-fall","reduce soot-fall"],"synonyms":["soot deposit","ashfall","smutfall"],"antonyms":[]}],"etymology":{"value":"Derived from the combination of 'soot' (a black carbonaceous substance produced by incomplete combustion) and 'fall' (the act or process of dropping or descending).","priority":"★★★"},"pronunciation":{"ipa":"ˈsʊtfɔːl","syllables":"soot-fall"},"inflection":{"noun_plural":"soot-falls"},"usage_notes":{"explanation":"'Soot-fall' refers specifically to the deposition of soot particles from the air onto surfaces. It is often associated with industrial pollution, wildfires, or other sources of combustion. The term is typically used in environmental science, meteorology, and public health contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The soot-fall was very dust.","correct":"✓ The soot-fall was very heavy.","note":"'Soot-fall' is quantified by terms like 'heavy', 'light', or 'significant', not by 'dust'."},{"incorrect":"✗ We need to clean the soot-fall every day.","correct":"✓ We need to clean up the soot-fall every day.","note":"'Clean up' is more commonly used with 'soot-fall' to describe the action of removing the soot."}],"priority":"★★☆"},"related_words":{"derivatives":["sooty (adjective: covered with or resembling soot)","soot (noun: a black carbonaceous substance)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Soot-fall' is a technical term used to describe the deposition of soot particles from the air. It is most commonly used in environmental science or industrial contexts. Understanding this term requires familiarity with environmental issues and pollution.","priority":"★★☆"},"example_sentences":[{"sentence":"The local government is trying to reduce the soot-fall by implementing stricter emission controls.","translation":"地方自治体は、より厳格な排出規制を実施することで降煤を減らそうとしている。","type":"general","meaning_category":"降煤"},{"sentence":"The analysis of the soot-fall composition can help identify the source of pollution.","translation":"降煤の組成分析は、汚染源の特定に役立つ。","type":"scientific","meaning_category":"降煤"},{"sentence":"The heavy soot-fall blackened the snow-covered landscape.","translation":"ひどい降煤が雪に覆われた風景を黒くした。","type":"descriptive","meaning_category":"降煤"}]}