{"word":"contaminative","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"汚染性の、伝染性の、汚染しやすい","english_definition":"Tending to contaminate; capable of contaminating or polluting.","examples":[{"sentence":"The contaminative nature of the disease made it difficult to control.","translation":"その病気の伝染性の高さから、制御が困難だった。"},{"sentence":"Ensure proper disposal of contaminative materials.","translation":"汚染性物質の適切な廃棄を徹底してください。"},{"sentence":"The contaminative effects of the spill spread rapidly.","translation":"流出による汚染性の影響は急速に広がった。"}],"collocations":["contaminative waste (汚染性廃棄物)","contaminative agent (汚染性物質)","contaminative process (汚染性プロセス)","contaminative influence (汚染性の影響)"],"synonyms":["polluting","infectious","tainting","defiling","corrupting"],"antonyms":["pure","clean","sterile","unpolluted"]}],"etymology":{"value":"From the verb 'contaminate' + '-ive'. 'Contaminate' comes from Latin 'contaminare' meaning 'to pollute, defile'.","priority":"★★★"},"pronunciation":{"ipa":"/kənˈtæmɪneɪtɪv/","syllables":"con-tam-i-na-tive"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be used in comparative and superlative forms (more contaminative, most contaminative)."},"usage_notes":{"explanation":"'Contaminative' describes something that has the potential or tendency to contaminate. It is often used in scientific, medical, or environmental contexts to describe substances or processes that can cause pollution or infection. It emphasizes the capability of something to contaminate. It is less common than 'contaminating' or 'contaminated' but provides a specific nuance about the inherent quality of something to cause contamination.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The contaminative water was cleaned.","correct":"✓ The contaminated water was cleaned.","note":"'Contaminated' describes something that has already been affected by contamination. 'Contaminative' describes something that has the potential to contaminate."},{"incorrect":"✗ The contaminative is dangerous.","correct":"✓ The contaminant is dangerous.","note":"'Contaminant' is a noun referring to the substance that causes contamination. 'Contaminative' is an adjective describing the quality of something that can contaminate."}],"priority":"★★☆"},"related_words":{"derivatives":["contaminate (verb: 汚染する)","contamination (noun: 汚染)","contaminated (adjective: 汚染された)","contaminant (noun: 汚染物質)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Contaminative' is a relatively formal and technical term, typically used in scientific or environmental contexts. It describes something that has the inherent ability or tendency to cause contamination. Understanding the difference between 'contaminative' (capable of contaminating) and 'contaminated' (already polluted) is crucial for accurate comprehension. This word is more likely to be encountered in specialized texts rather than everyday conversation."},"example_sentences":[{"sentence":"The contaminative dust from the factory posed a health risk to nearby residents.","translation":"工場からの汚染性の粉塵は、近隣住民に健康リスクをもたらした。","type":"adjective","meaning_category":"汚染性の"},{"sentence":"Proper handling procedures are essential to prevent the spread of contaminative materials.","translation":"汚染性物質の拡散を防ぐためには、適切な取り扱い手順が不可欠である。","type":"adjective","meaning_category":"汚染性の"},{"sentence":"The study examined the contaminative effects of pesticides on the local ecosystem.","translation":"その研究では、農薬が地域の生態系に及ぼす汚染性の影響を調査した。","type":"adjective","meaning_category":"汚染性の"}]}