{"word":"discodactylous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"指の先端が円盤状になっていること、またはそのような指を持つこと","english_definition":"Having disc-shaped tips on the digits.","examples":[{"sentence":"The gecko is discodactylous, allowing it to cling to smooth surfaces.","translation":"そのヤモリは指の先端が円盤状になっているため、滑らかな表面に張り付くことができる。"},{"sentence":"Discodactylous adaptations are common in arboreal animals.","translation":"円盤状の指の適応は、樹上性の動物によく見られる。"}],"collocations":["discodactylous gecko","discodactylous pads","discodactylous adaptation"],"synonyms":["padded","adhesive","sucker-footed"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'discos' (disk) and 'daktylos' (finger or toe).","priority":"★★★"},"pronunciation":{"ipa":"/ˌdɪskoʊdækˈtɪləs/","syllables":"dis-co-dac-ty-lous"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"This term is primarily used in zoology to describe animals with specialized adhesive pads on their digits, allowing them to grip surfaces effectively. It is not commonly used in everyday language.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["discodactyly (noun): The condition of having disc-shaped tips on the digits."],"related_terms":["gecko","adhesive pads","arboreal adaptation"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Discodactylous' is a highly technical term used in biology, specifically zoology, to describe animals that possess disc-shaped tips on their digits (fingers or toes). These disc-shaped tips usually contain specialized adhesive pads that enable the animal to cling to surfaces, often vertically or even upside down. This term is not part of common vocabulary and would primarily be encountered in scientific literature or specialized discussions about animal adaptations."},"example_sentences":[{"sentence":"The scansorial ability of the gecko is enhanced by its discodactylous feet.","translation":"ヤモリのよじ登る能力は、円盤状の指を持つ足によって高められている。","type":"descriptive","meaning_category":"zoology"},{"sentence":"Discodactylous features are a key adaptation for many climbing species.","translation":"円盤状の指の特徴は、多くのクライミング種にとって重要な適応である。","type":"descriptive","meaning_category":"zoology"}]}