{"word":"Carbonemia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"血中二酸化炭素過多症","english_definition":"The presence of an abnormally high level of carbon dioxide in the blood.","examples":[{"sentence":"The patient was diagnosed with carbonemia due to severe respiratory failure.","translation":"患者は重度の呼吸不全により血中二酸化炭素過多症と診断された。"}],"collocations":["severe carbonemia","acute carbonemia","chronic carbonemia"],"synonyms":["hypercapnia"],"antonyms":["hypocapnia"]},{"part_of_speech":"noun","definition":"(まれ) 一酸化炭素中毒","english_definition":"(rarely) Carbon monoxide poisoning. This usage is less common and can be confusing.","examples":[{"sentence":"(Less common usage) The symptoms resembled carbonemia, but it was actually carbon monoxide poisoning.","translation":"（まれな用法）症状は血中二酸化炭素過多症に似ていたが、実際には一酸化炭素中毒だった。"}],"collocations":["severe carbonemia","acute carbonemia"],"synonyms":["carbon monoxide poisoning"],"antonyms":[]}],"etymology":{"value":"Derived from 'carbon' referring to carbon dioxide, combined with '-emia' indicating a condition in the blood.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɑːrbəˈniːmiə/","syllables":"car-bo-ne-mi-a"},"inflection":{"noun_plural":"carbonemias"},"usage_notes":{"explanation":"'Carbonemia' primarily refers to an elevated level of carbon dioxide in the blood (hypercapnia). While it can rarely and confusingly be used to refer to carbon monoxide poisoning, this usage is discouraged due to the potential for misinterpretation. Hypercapnia is the preferred term for high blood carbon dioxide, and 'carbon monoxide poisoning' should be used for the latter.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He suffered from carbonemia after inhaling carbon monoxide.","correct":"✓ He suffered from carbon monoxide poisoning after inhaling carbon monoxide.","note":"Use 'carbon monoxide poisoning' when referring to the effects of carbon monoxide inhalation."}],"priority":"★★☆"},"related_words":{"derivatives":["carbonemic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Carbonemia' is a technical term used in medicine to describe a condition where there is too much carbon dioxide in the blood. It's important to know that while it sometimes can refer to carbon monoxide poisoning, this is rare and can cause confusion. Usually, 'hypercapnia' is the correct term for high carbon dioxide levels, and 'carbon monoxide poisoning' should be used for the other condition."},"example_sentences":[{"sentence":"The blood gas analysis revealed severe carbonemia, requiring immediate intervention.","translation":"血液ガス分析の結果、重度の血中二酸化炭素過多症が明らかになり、直ちに介入が必要となった。","type":"noun","meaning_category":"血中二酸化炭素過多症"},{"sentence":"(Rare usage) The initial diagnosis of carbonemia was later corrected to carbon monoxide poisoning.","translation":"(まれな用法) 当初の血中二酸化炭素過多症の診断は、後に一酸化炭素中毒に修正された。","type":"noun","meaning_category":"一酸化炭素中毒 (まれ)"}]}