{"word":"filoplume","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"糸状羽（しじょうう）：鳥類の羽毛の一種で、細い糸状の軸と先端にわずかな羽枝を持つ。触覚や気流の変化を感知する感覚器官としての役割を持つと考えられている。","english_definition":"A hairlike feather of birds, consisting of a slender shaft with a few short barbs near the tip. Filoplumes are sensory feathers thought to function in monitoring the position and movement of contour feathers.","examples":[{"sentence":"The filoplumes help the bird sense the position of its other feathers.","translation":"糸状羽は、鳥が他の羽毛の位置を感知するのに役立つ。"},{"sentence":"Filoplumes are often difficult to see without close examination.","translation":"糸状羽は、注意深く観察しないと見えにくいことが多い。"}],"collocations":["filoplume feather","sensory filoplume","avian filoplume"],"synonyms":["hair feather","plumule"],"antonyms":[]},{"part_of_speech":"noun","definition":"(より広義には)糸状の構造を持つ羽毛全般","english_definition":"(More broadly) Any feather with a threadlike structure.","examples":[{"sentence":"Some classify down feathers with very reduced barbs as a type of filoplume.","translation":"綿羽の中には、羽枝が非常に退化したものを糸状羽の一種として分類する人もいる。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the Latin words 'filum' (thread) and 'pluma' (feather).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɪləˌplum/","syllables":"fi-lo-plume"},"inflection":{"noun_plural":"filoplumes"},"usage_notes":{"explanation":"Filoplumes are specialized feathers found in birds, typically located near contour feathers. They are thought to play a role in sensory perception, helping birds maintain their plumage and detect air currents. While not as visually prominent as flight or contour feathers, they are essential for the bird's overall sensory awareness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Filoplumes are used for flight.","correct":"✓ Filoplumes are sensory feathers, not flight feathers.","note":"Filoplumes are sensory feathers and do not contribute to flight. Flight feathers are larger and have a different structure."},{"incorrect":"✗ Filoplumes are large and easily visible.","correct":"✓ Filoplumes are small and often hidden beneath other feathers.","note":"Filoplumes are small and hairlike, often hidden by other feathers."}],"priority":"★★☆"},"related_words":{"derivatives":["plumage","feather","contour feather","down feather"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"None (Specialized vocabulary)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Filoplume' is a specialized term in ornithology, referring to a specific type of sensory feather in birds. Understanding this term requires knowledge of avian anatomy and feather types. It is not commonly used outside of scientific or technical contexts related to birds.","priority":"★☆☆"},"example_sentences":[{"sentence":"The bird's filoplumes help it maintain the correct position of its flight feathers.","translation":"その鳥の糸状羽は、飛翔羽の正しい位置を維持するのに役立つ。","type":"noun","meaning_category":"Sensory Feather"},{"sentence":"Scientists are studying the role of filoplumes in avian flight control.","translation":"科学者たちは、鳥類の飛行制御における糸状羽の役割を研究している。","type":"noun","meaning_category":"Sensory Feather"}]}