{"word":"charoset","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ハロセス：過越の祭（ペサハ）のセダーの食卓に供される、甘いペースト状の食品。すりおろしたリンゴ、ナッツ、スパイス、甘味（蜂蜜や砂糖）、ワインなどを混ぜて作る。奴隷状態にあったユダヤ人の苦難と、レンガを作るために使われたモルタルを象徴する。","english_definition":"A sweet, dark-colored paste made of fruits and nuts eaten at the Passover Seder. It symbolizes the mortar used by the Israelites when they were slaves in Egypt.","examples":[{"sentence":"We made charoset with apples, walnuts, cinnamon, and red wine.","translation":"私たちはリンゴ、クルミ、シナモン、赤ワインでハロセスを作りました。"},{"sentence":"Every family has their own unique recipe for charoset.","translation":"どの家族も独自のハロセスのレシピを持っています。"},{"sentence":"The charoset is meant to remind us of the hardships our ancestors faced.","translation":"ハロセスは、私たちの祖先が直面した苦難を思い出させるためのものです。"}],"collocations":["make charoset (ハロセスを作る)","charoset recipe (ハロセスのレシピ)","Passover charoset (過越の祭のハロセス)","traditional charoset (伝統的なハロセス)"],"synonyms":["none (specific synonyms, variations exist based on ingredients)"],"antonyms":["none (as it is a specific cultural food item)"]}],"etymology":{"value":"ヘブライ語の「חרסת」（ḥăroseth）に由来し、「粘土」または「モルタル」を意味する「חרס」（ḥeres）から派生。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɑːroʊˈsɛt/","syllables":"ha-ro-set"},"inflection":{"noun_plural":"charosets (まれに複数形で使われる)"},"usage_notes":{"explanation":"ハロセスは、ユダヤ教の過越の祭（ペサハ）のセダーの食卓に欠かせない食品です。その味は甘く、食感は粗く、ペースト状です。材料は地域や家族によって異なり、リンゴ、ナッツ（クルミ、アーモンドなど）、スパイス（シナモン、ジンジャーなど）、甘味（蜂蜜、砂糖、デーツシロップなど）、ワインなどが使われます。ハロセスは、奴隷状態にあったユダヤ人がレンガを作る際に使用したモルタルを象徴しており、セダーの儀式において重要な意味を持ちます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ charoset is a type of bread.","correct":"✓ charoset is a paste made of fruits and nuts.","note":"ハロセスはパンではなく、果物とナッツで作られたペーストです。"},{"incorrect":"✗ charoset is eaten during Hanukkah.","correct":"✓ charoset is eaten during Passover.","note":"ハロセスは過越の祭（ペサハ）で食べられます。ハヌカではありません。"},{"incorrect":"✗ charoset always contains dairy products.","correct":"✓ charoset typically does not contain dairy products.","note":"ハロセスは通常、乳製品を含みません。過越の祭では、肉と乳製品を一緒に食べないという食の規定があるためです。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["Passover (過越の祭)","Seder (セダー)","matzah (マッツァ)","Haggadah (ハガダー)","Pesach (ペサハ)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (非常に特殊な語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**charoset**」は、ユダヤ教の過越の祭（ペサハ）のセダーで食べられる特別な食べ物を指す単語です。これは、リンゴ、ナッツ、スパイス、ワインなどを混ぜて作られた甘いペーストで、古代エジプトで奴隷として働いていたユダヤ人がレンガを作る際に使ったモルタルを象徴しています。ユダヤ教の文化や宗教的な背景を知らない人にとっては馴染みのない単語でしょう。レシピは家庭や地域によって異なり、さまざまなバリエーションがあります。"},"example_sentences":[{"sentence":"The children helped to prepare the charoset for the Passover Seder.","translation":"子供たちは過越の祭のセダーのためにハロセスの準備を手伝った。","type":"noun","meaning_category":"食品"},{"sentence":"My grandmother's charoset recipe has been passed down for generations.","translation":"祖母のハロセスのレシピは何世代にもわたって受け継がれてきた。","type":"noun","meaning_category":"食品"},{"sentence":"The taste of charoset always brings back memories of Passover celebrations.","translation":"ハロセスの味はいつも過越の祭の祝いの思い出を呼び起こす。","type":"noun","meaning_category":"食品"}]}