{"word":"inveteracy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(習慣・感情・病気などの)根深さ、慢性化、長年の習慣","english_definition":"the quality or condition of being long-established and difficult to change; the state of being deep-rooted or chronic.","examples":[{"sentence":"The inveteracy of the problem made it difficult to find a solution.","translation":"その問題の根深さが、解決策を見つけることを困難にした。"},{"sentence":"The inveteracy of his smoking habit made it hard for him to quit.","translation":"彼の喫煙習慣の慢性化は、彼が禁煙することを困難にした。"},{"sentence":"The inveteracy of corruption in the government was a major concern.","translation":"政府における汚職の根深さは、大きな懸念事項であった。"}],"collocations":["inveteracy of habit (習慣の根深さ)","inveteracy of disease (病気の慢性化)","inveteracy of prejudice (偏見の根深さ)","inveteracy of custom (慣習の根深さ)"],"synonyms":["chronicity","persistence","deep-rootedness","ingrainedness","established nature","long-standing nature"],"antonyms":["novelty","recentness","transience","short-livedness"]}],"etymology":{"value":"Late Latin *inveteratus* (grown old), from Latin *inveterascere* (to grow old, become established), from *in-* (in) + *veterascere* (to grow old), from *vetus* (old).","priority":"★★★"},"pronunciation":{"ipa":"/ɪnˈvɛtərəsi/","syllables":"in-vet-er-a-cy"},"inflection":{"noun_plural":"inveteracies (rare)"},"usage_notes":{"explanation":"\"Inveteracy\" refers to something, usually a habit, belief, or problem, that has existed for a long time and is therefore difficult to change or eradicate. It emphasizes the deep-rooted nature and persistence of the thing in question. It is a relatively formal word and is not commonly used in everyday conversation. It is often used in academic, political, or medical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The inveteracy of the new policy was surprising.","correct":"✓ The novelty of the new policy was surprising.","note":"\"Inveteracy\" refers to something old and established, not something new. Use \"novelty\" or a similar word to describe something new. "},{"incorrect":"✗ He showed inveteracy towards his friends.","correct":"✓ He showed loyalty towards his friends.","note":"\"Inveteracy\" does not describe a positive trait or attitude towards someone. Use words like \"loyalty,\" \"devotion,\" or \"steadfastness\" instead."}],"priority":"★★☆"},"related_words":{"derivatives":["inveterate (adjective: having a particular habit, activity, or interest that is long-established and unlikely to change)","inveterately (adverb: in a long-established and unchangeable manner)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"inveteracy\" is a formal and relatively uncommon noun that describes the state of something being long-established and difficult to change. It is often used in academic or formal writing to emphasize the deep-rooted nature of a problem, habit, or belief. Understanding this word requires a good vocabulary and familiarity with formal language. It is not typically used in everyday conversation."},"example_sentences":[{"sentence":"The **inveteracy** of racism in the society made it difficult to achieve true equality.","translation":"社会における人種差別の根深さは、真の平等を達成することを困難にした。","type":"noun","meaning_category":"根深さ"},{"sentence":"The doctor was concerned about the **inveteracy** of the patient's cough.","translation":"医師は患者の咳の慢性化を懸念していた。","type":"noun","meaning_category":"慢性化"},{"sentence":"The **inveteracy** of certain cultural traditions made them resistant to change.","translation":"特定の文化的伝統の根深さは、それらを変化に抵抗させた。","type":"noun","meaning_category":"根深さ"}]}