{"word":"patroller","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"巡回者、警邏隊員、パトロール隊員","english_definition":"a person who patrols an area, especially to maintain security or enforce regulations.","examples":[{"sentence":"The ski resort employs several patrollers to ensure the safety of skiers.","translation":"そのスキーリゾートは、スキーヤーの安全を確保するために数名のパトロール隊員を雇用している。"},{"sentence":"The security patroller checked the perimeter fence every hour.","translation":"警備巡回員は、毎時間境界フェンスを点検した。"},{"sentence":"A border patroller spotted the group crossing the boundary.","translation":"国境警備隊員が、境界を越えてくるグループを発見した。"}],"collocations":["security patroller (警備巡回員)","border patroller (国境警備隊員)","ski patroller (スキーパトロール隊員)","beach patroller (ビーチパトロール隊員)"],"synonyms":["guard","watchman","sentinel","ranger","peacekeeper"],"antonyms":[],"related_words":["patrol (verb/noun)","patrolling (adjective)"]}],"etymology":{"value":"The word \"patroller\" is derived from the verb \"patrol,\" which comes from the French word \"patrouiller\" meaning \"to go the rounds.\" The suffix \"-er\" is added to indicate a person who performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/pəˈtroʊlər/","syllables":"pa-trol-ler"},"inflection":{"noun_plural":"patrollers"},"usage_notes":{"explanation":"A \"patroller\" is someone whose job involves regularly walking or driving around a specific area to maintain order, provide security, or enforce rules. The type of area and the specific duties can vary widely, leading to different types of patrollers, such as ski patrollers, border patrollers, and security patrollers. The term emphasizes the act of patrolling as the primary function of the person.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a patrol.","correct":"✓ He is a patroller. / ✓ He is on patrol.","note":"\"Patrol\" is the act of patrolling or the group doing it. \"Patroller\" is the individual person. To say someone is actively patrolling, use \"on patrol.\""},{"incorrect":"✗ The patroller is patrolling. (redundant)","correct":"✓ The patroller is on patrol.","note":"Saying \"The patroller is patrolling\" is redundant because it repeats the idea of patrolling. It's better to say \"The patroller is on patrol\" or \"The patroller is checking the area.\""}],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in specific contexts (e.g., skiing, security).","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"patroller\" refers to a person who regularly goes around an area to keep it safe or enforce rules. Think of someone who walks around a building to check for security, or someone who skis down a mountain to help injured skiers. They are called \"patrollers\" because their main job is to \"patrol\" the area. This word is used in situations where security or safety is important.","priority":"★★☆"},"example_sentences":[{"sentence":"The ski **patroller** rescued an injured skier from the slopes.","translation":"スキーパトロール隊員が、斜面で怪我をしたスキーヤーを救助した。","type":"noun","meaning_category":"巡回者、救助者"},{"sentence":"A security **patroller** monitors the building's surveillance cameras.","translation":"警備巡回員が、建物の監視カメラを監視している。","type":"noun","meaning_category":"警備員"},{"sentence":"The border **patroller** is responsible for preventing illegal crossings.","translation":"国境警備隊員は、不法な国境越えを防ぐ責任がある。","type":"noun","meaning_category":"国境警備隊員"}]}