{"word":"mainframes","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"メインフレーム (大型汎用コンピュータ)","english_definition":"Large, powerful computers used primarily by large organizations for critical applications, typically for bulk data processing such as census, industry and consumer statistics, enterprise resource planning, and financial transaction processing.","examples":[{"sentence":"Many banks still rely on mainframes for their core transaction processing.","translation":"多くの銀行は依然として基幹業務のトランザクション処理にメインフレームを利用している。"},{"sentence":"Mainframes are known for their reliability and security.","translation":"メインフレームはその信頼性とセキュリティで知られている。"},{"sentence":"Modern mainframes can handle a wide variety of workloads, including cloud computing and virtualization.","translation":"現代のメインフレームは、クラウドコンピューティングや仮想化など、さまざまなワークロードを処理できる。"}],"collocations":["mainframe computer","mainframe system","mainframe architecture","mainframe application","mainframe environment","mainframe technology","mainframe migration","mainframe modernization"],"synonyms":["large-scale computer","enterprise server","central computer"],"antonyms":["personal computer","microcomputer","workstation"]}],"etymology":{"value":"The term 'mainframe' originated in reference to the large cabinets, or 'main frames,' that housed the central processing unit and main memory of early computers. These frames were often quite large, hence the name.","priority":"★★☆"},"pronunciation":{"ipa":"ˈmeɪnfreɪmz","syllables":"main-frames"},"inflection":{"noun_plural":"mainframes (always plural, referring to the category of computers)"},"usage_notes":{"explanation":"'Mainframes' refers to a class of powerful computers, not a specific brand or model. While initially associated with batch processing and centralized computing, modern mainframes have evolved to support a wide range of applications and architectures, including virtualization and cloud computing. They are often used in situations requiring high reliability, security, and processing capacity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a mainframe at home.","correct":"✓ I have a powerful server at home.","note":"Mainframes are typically used by large organizations, not individuals. A home computer, even a powerful one, is not a mainframe."},{"incorrect":"✗ Mainframe is outdated technology.","correct":"✓ While mainframes have a long history, they are continually updated and remain relevant for many critical applications.","note":"While mainframes have been around for a long time, they are not necessarily outdated. They are continually updated and still used in many industries."}],"priority":"★★☆"},"related_words":{"derivatives":["mainframe (singular form, less common in general use)"],"related_concepts":["batch processing","COBOL","IBM z/Architecture","enterprise computing","legacy systems","virtualization","cloud computing"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency compared to general computing terms, but common in IT and business contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mainframes' are high-capacity computing systems designed to handle extensive data processing and critical applications for large organizations. They are characterized by their reliability, security, and ability to manage vast amounts of data. While the term evokes images of older, centralized computing models, modern mainframes are sophisticated systems that integrate with cloud computing and virtualization technologies. Understanding mainframes requires familiarity with enterprise-level IT infrastructure and concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The airline's reservation system runs on a mainframe.","translation":"その航空会社の予約システムはメインフレーム上で動作している。","type":"noun","meaning_category":"大型汎用コンピュータ"},{"sentence":"Companies are exploring ways to modernize their mainframe applications.","translation":"企業はメインフレームアプリケーションを近代化する方法を模索している。","type":"noun","meaning_category":"大型汎用コンピュータ"},{"sentence":"Security is a primary concern when managing mainframe systems.","translation":"メインフレームシステムを管理する上で、セキュリティは主要な懸念事項である。","type":"noun","meaning_category":"大型汎用コンピュータ"}]}