{"word":"Dowieism","priority":"低","meanings":[{"part_of_speech":"noun","definition":"ドウィー主義：ジョン・アレクサンダー・ドウィーの教えに基づくキリスト教の一派。神癒を強調し、イリノイ州ザイオン市を設立した。","english_definition":"The religious teachings and practices associated with John Alexander Dowie, emphasizing divine healing and the establishment of the city of Zion, Illinois.","examples":[{"sentence":"Dowieism attracted many followers with its promise of healing through faith.","translation":"ドウィー主義は信仰による癒しの約束で多くの信者を引きつけた。"},{"sentence":"The principles of Dowieism were strictly enforced in the early days of Zion.","translation":"ドウィー主義の原則はザイオン市の初期には厳格に施行された。"}],"collocations":["Dowieist (ドウィー主義者)","Zion City (ザイオン市)","divine healing (神癒)"],"synonyms":["Christian Catholic Apostolic Church (キリスト教カトリック使徒教会)"],"antonyms":[]}],"etymology":{"value":"創始者であるジョン・アレクサンダー・ドウィー (John Alexander Dowie) の名前に、主義・学説を表す接尾辞「-ism」が付いたもの。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdaʊiɪzəm/","syllables":"Dow-ie-ism"},"inflection":{"notes":"名詞なので複数形は通常ありません。"},"usage_notes":{"explanation":"「**Dowieism**」は、ジョン・アレクサンダー・ドウィーの教え体系全体を指す言葉です。神癒を重視し、ザイオン市という共同体を築いたことが特徴です。現代ではあまり一般的ではなく、歴史的な文脈で使われることが多いです。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He practices Dowieism as a main religion.","correct":"✓ He practiced Dowieism.","note":"Dowieismは、現代では一般的な宗教ではありません。過去形を使うか、歴史的な文脈で使うのが適切です。"},{"incorrect":"✗ Dowieism is about denying medical treatment.","correct":"✓ Dowieism emphasizes divine healing, but the extent to which followers reject medical treatment varied.","note":"Dowieismは神癒を強調しますが、信者が医療を拒否する程度は様々でした。医療を完全に否定するわけではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":["Dowieist (ドウィー主義者)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な歴史または宗教学の文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Dowieism**」は、ジョン・アレクサンダー・ドウィーという人物の宗教的な教えを指す専門用語です。この用語は、特定の歴史的および宗教的な文脈でのみ使用され、一般的には知られていません。Dowieismの理解には、ドウィーの生涯、彼の教え、そして彼が設立したザイオン市についての知識が必要です。この単語は、宗教学や歴史学の研究者など、特定の分野の専門家によって使用される可能性が高くなります。"},"example_sentences":[{"sentence":"The rise of Dowieism in the late 19th century reflected a broader interest in faith healing.","translation":"19世紀後半のドウィー主義の台頭は、信仰による癒しへの広範な関心を反映していた。","type":"noun","meaning_category":"宗教的教義"},{"sentence":"Historians study Dowieism to understand the social and religious dynamics of the period.","translation":"歴史家は、当時の社会的および宗教的力学を理解するためにドウィー主義を研究している。","type":"noun","meaning_category":"宗教的教義"}]}