{"word":"prerestraint","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(法律) 事前抑制、事前規制","english_definition":"(law) prior restraint; judicial suppression of material that would be published or broadcast, on the grounds that it is libelous or harmful. In US law, the First Amendment severely limits the ability of the government to do this.","examples":[{"sentence":"The court ruled that the government's attempt to block the publication was an unconstitutional prerestraint.","translation":"裁判所は、政府による出版差し止めは違憲な事前抑制であるとの判決を下した。"},{"sentence":"Prerestraint on speech is considered a serious infringement of freedom of expression.","translation":"言論に対する事前抑制は、表現の自由に対する重大な侵害とみなされている。"}],"collocations":["unconstitutional prerestraint (違憲な事前抑制)","impose a prerestraint (事前抑制を課す)","lift a prerestraint (事前抑制を解除する)","prerestraint on publication (出版に対する事前抑制)","prerestraint on speech (言論に対する事前抑制)"],"synonyms":["censorship","prior censorship","suppression","prohibition"],"antonyms":["freedom of speech","freedom of the press","free expression"]}],"etymology":{"value":"'Pre-' (before) + 'restraint' (the act of restraining or controlling).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːrɪˈstreɪnt/","syllables":"pre-re-straint"},"inflection":{"noun_plural":"prerestraints"},"usage_notes":{"explanation":"'Prerestraint' is a legal term, primarily used in the context of freedom of speech and freedom of the press. It refers to the government's attempt to prevent the publication or broadcast of information before it occurs, rather than punishing it afterward. This is generally viewed as a serious violation of constitutional rights, especially in the United States, where the First Amendment protects freedom of expression.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The law imposed a pre-restraint on all citizens.","correct":"✓ The law imposed a prerestraint on certain types of publications.","note":"'Prerestraint' specifically applies to restrictions on expression (speech, publication, etc.), not general restrictions on behavior."},{"incorrect":"✗ He felt a prerestraint from speaking his mind.","correct":"✓ He felt a restraint from speaking his mind.","note":"'Prerestraint' is a legal term referring to government action. General feelings of inhibition are simply 'restraint'."}],"priority":"★★☆"},"related_words":{"derivatives":["restraint","prior restraint","censorship","gag order","injunction"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency (専門用語)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Prerestraint' is a specialized legal term referring to the government's attempt to suppress speech or publication before it occurs. It's a concept central to First Amendment law in the United States, where such actions are viewed with great skepticism. Understanding this term requires familiarity with legal and constitutional concepts related to freedom of expression."},"example_sentences":[{"sentence":"The newspaper argued that the court order was an unconstitutional **prerestraint** on their ability to report the news.","translation":"その新聞社は、裁判所の命令は報道の自由に対する違憲な事前抑制であると主張した。","type":"noun","meaning_category":"事前抑制"},{"sentence":"The government's attempt to censor the documentary was seen as a clear example of **prerestraint**.","translation":"政府によるドキュメンタリーの検閲の試みは、事前抑制の明確な例と見なされた。","type":"noun","meaning_category":"事前抑制"},{"sentence":"Legal scholars debated whether the new regulation constituted an impermissible **prerestraint** on academic research.","translation":"法学者は、その新しい規制が学術研究に対する許容できない事前抑制に当たるかどうかを議論した。","type":"noun","meaning_category":"事前抑制"}]}