{"word":"estrangingly","priority":"N/A","meanings":[{"part_of_speech":"adverb","definition":"疎遠にさせるように、仲たがいさせるように","english_definition":"In a manner that causes someone to feel alienated or distant.","examples":[{"sentence":"He spoke estrangingly of his former friends, making it clear he no longer felt connected to them.","translation":"彼は以前の友人たちについて疎遠にさせるように話し、もはや彼らとのつながりを感じていないことを明らかにした。"},{"sentence":"The new policies were implemented estrangingly, causing many employees to feel undervalued and disconnected from the company.","translation":"新しい政策は疎遠にさせるように実施され、多くの従業員が会社から過小評価されていると感じ、つながりを失った。"}],"collocations":["speak estrangingly","act estrangingly","implement estrangingly"],"synonyms":["alienatingly","distancingly","separatingly"],"antonyms":["attractively","engagingly","connectingly"]}],"etymology":{"value":"Derived from the verb 'estrange,' which comes from the Old French 'estranger' meaning 'to treat as a stranger.' The suffix '-ingly' turns it into an adverb.","priority":"★☆☆"},"pronunciation":{"ipa":"/ɪˈstreɪndʒɪŋli/","syllables":"e-strang-ing-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"'Estrangingly' describes an action or manner that causes a feeling of alienation or distance. It is often used to describe behavior or policies that make someone feel like an outsider or that damages relationships. The word is not commonly used, and more common alternatives like 'alienatingly' or 'distancingly' are often preferred.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She looked at him estrangingly.","correct":"✓ She looked at him with an estranging gaze. / ✓ She looked at him in an estranging manner.","note":"'Estrangingly' describes how an action is performed, not a state of being. It's better to use a phrase like 'with an estranging gaze' or 'in an estranging manner' to describe someone's look."}],"priority":"★☆☆"},"related_words":{"derivatives":["estrange (verb)","estranged (adjective)","estrangement (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - not commonly used.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Estrangingly' is an advanced adverb that describes actions or behaviors that cause feelings of alienation or distance. It is not a common word and is typically used in formal or literary contexts. Because of its rarity and the complexity of the concept it conveys, it is considered a C2 level word. It is more common to use alternative phrases like 'in an alienating way' or 'in a distancing manner.'"},"example_sentences":[{"sentence":"The company president spoke estrangingly about the union's demands, creating further division between management and labor.","translation":"会社社長は組合の要求について疎遠にさせるように話し、経営陣と労働者の間のさらなる分裂を生み出した。","type":"adverb","meaning_category":"causing alienation"},{"sentence":"The artist depicted the figures in the painting estrangingly, emphasizing their isolation and detachment from each other.","translation":"そのアーティストは絵画の中で人物を疎遠にさせるように描き、彼らの孤立と互いからの隔絶を強調した。","type":"adverb","meaning_category":"depicting alienation"}]}