{"word":"ephthianure","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare, archaic) A substance, especially a poison, that causes death.","english_definition":"(rare, archaic) A substance, especially a poison, that causes death.","examples":[{"sentence":"The old books spoke of ephthianures that could kill with a single drop.","translation":"その古い本には、一滴で人を殺せるエフシアニュア（致死物質）について書かれていた。"}],"collocations":[],"synonyms":["poison","venom","toxicant","bane"],"antonyms":["antidote","remedy","cure"]}],"etymology":{"value":"The etymology of 'ephthianure' is uncertain and somewhat obscure. It is likely a constructed word, possibly influenced by Greek elements related to destruction or decay, but there is no definitive established origin. It appears primarily in literary contexts.","priority":"★☆☆"},"pronunciation":{"ipa":"/ɛfˈθaɪəˌnjʊər/","syllables":"eph-thi-a-nure"},"inflection":{"noun_plural":"ephthianures"},"usage_notes":{"explanation":"'Ephthianure' is a very rare and archaic word, almost exclusively found in older literature, particularly in fantasy or gothic works, to describe a deadly poison or substance. It is not in common use and would likely be unfamiliar to most modern English speakers.","priority":"★☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (extremely rare)","frequency_google_ngram":"Extremely low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Ephthianure' is a highly uncommon and archaic word. Its usage is almost exclusively limited to literary contexts, particularly within the genres of fantasy and gothic fiction. Due to its rarity, it is unlikely to be encountered in general reading or conversation. Understanding this word is primarily relevant for those studying older or specialized literature."},"example_sentences":[{"sentence":"The villain concocted a potent ephthianure in his hidden laboratory.","translation":"悪役は隠された研究室で強力なエフシアニュアを調合した。","type":"noun","meaning_category":"poison"},{"sentence":"Legends spoke of an ephthianure so deadly that it could wither entire forests.","translation":"伝説では、森全体を枯らすほど強力なエフシアニュアについて語られていた。","type":"noun","meaning_category":"poison"}]}