{"word":"jasz","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヤス族：ハンガリーの少数民族。","english_definition":"A member of the Jasz people, a subgroup of the Ossetians who settled in Hungary in the 13th century.","examples":[{"sentence":"The Jasz people have a distinct cultural heritage.","translation":"ヤス族は独特の文化遺産を持っています。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"ヤス語：ヤス族が話していた言語。現在はほぼ消滅。","english_definition":"The Jasz language, a dialect of Ossetian formerly spoken by the Jasz people. It is now nearly extinct.","examples":[{"sentence":"Very few speakers of the Jasz language remain today.","translation":"今日、ヤス語の話し手はほとんど残っていません。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"adjective","definition":"ヤス族の、ヤス語の。","english_definition":"Relating to the Jasz people or their language.","examples":[{"sentence":"Jasz traditions are still celebrated in some regions of Hungary.","translation":"ハンガリーの一部の地域では、ヤス族の伝統が今でも祝われています。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name \"Jasz\" is derived from the name of the Iazyges, an ancient Sarmatian tribe.","priority":"★★★"},"pronunciation":{"ipa":"/jɑːs/","syllables":"Jasz (1 syllable)"},"inflection":{},"usage_notes":{"explanation":"The term \"Jasz\" primarily refers to the Jasz people, a group with Ossetian origins who migrated to Hungary. They maintained a degree of autonomy for centuries. The Jasz language is now almost extinct, with very few speakers remaining. The term can also be used adjectivally to describe things related to the Jasz people or their culture.","priority":"★★★"},"common_mistakes":{},"related_words":{},"level_frequency":{},"readability_explanation":{"level":"C1","text":"\"Jasz\" refers to a specific ethnic group in Hungary with historical ties to the Ossetians. It's not a commonly used word unless discussing Hungarian history, ethnography, or linguistics. The word can function as a noun referring to the people or their language, or as an adjective describing something related to them."},"example_sentences":[{"sentence":"The Jasz region of Hungary has a unique history.","translation":"ハンガリーのヤス地域は独特の歴史を持っています。","type":"adjective","meaning_category":"ヤス族の"},{"sentence":"Efforts are being made to preserve the remaining elements of Jasz culture.","translation":"ヤス族の文化の残りの要素を保存するための努力がなされています。","type":"noun","meaning_category":"ヤス族"}]}