{"word":"BSPhTh","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"Bachelor of Science in Physical Therapy (理学療法学士)","english_definition":"An academic degree awarded for completing a four-year undergraduate program in physical therapy.","examples":[{"sentence":"She earned a BSPhTh from the University of the Philippines.","translation":"彼女はフィリピン大学で理学療法学士号を取得しました。"}],"collocations":["earn a BSPhTh","obtain a BSPhTh","BSPhTh degree"],"synonyms":["BScPT","BPT","Bachelor of Physiotherapy"],"antonyms":[]}],"etymology":{"value":"An abbreviation formed from the initial letters of 'Bachelor of Science in Physical Therapy'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌbiːˌɛsˌpiːˌeɪtʃˌtiːˈeɪtʃ/","syllables":"bee-es-pee-aitch-tee-aitch"},"inflection":{"noun_plural":"BSPhThs"},"usage_notes":{"explanation":"'BSPhTh' is commonly used in countries where the degree title follows this convention. It indicates that the holder has completed the necessary education and training to practice as a physical therapist.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a BSPhTh therapist.","correct":"✓ He is a physical therapist with a BSPhTh degree.","note":"BSPhTh is a degree, not a profession. It's more accurate to say someone 'has a BSPhTh degree' or is a 'physical therapist'. "},{"incorrect":"✗ I have a BSPhTh on physical therapy.","correct":"✓ I have a BSPhTh in physical therapy.","note":"The correct preposition to use is 'in', not 'on'."}],"priority":"★★☆"},"related_words":{"derivatives":["physical therapy","physiotherapy","physical therapist","physiotherapist"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'BSPhTh' is an abbreviation for 'Bachelor of Science in Physical Therapy'. It's a degree earned after completing a four-year program in physical therapy. This term is primarily used in academic and professional contexts related to healthcare and physical rehabilitation. Understanding this term is useful for those in the medical field or those seeking information about physical therapy qualifications.","priority":"★★★"},"example_sentences":[{"sentence":"Many graduates with a BSPhTh go on to specialize in areas like sports medicine or geriatric care.","translation":"多くの理学療法学士号取得者は、スポーツ医学や老年医学などの分野を専門にしています。","type":"general","meaning_category":"education"},{"sentence":"The curriculum for a BSPhTh includes coursework in anatomy, physiology, and therapeutic exercise.","translation":"理学療法学士のカリキュラムには、解剖学、生理学、および治療的運動のコースワークが含まれています。","type":"curriculum","meaning_category":"education"},{"sentence":"A BSPhTh is often a prerequisite for becoming a licensed physical therapist.","translation":"理学療法学士は、多くの場合、理学療法士の免許を取得するための前提条件です。","type":"licensing","meaning_category":"professional"}]}