{"word":"colostomy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"人工肛門（結腸瘻造設術）","english_definition":"a surgical operation in which a piece of the colon is diverted to an artificial opening in the abdominal wall so as to bypass a damaged part of the colon. Also, the opening created by this operation.","examples":[{"sentence":"He had a colostomy after surgery for colon cancer.","translation":"彼は結腸がんの手術後、人工肛門を造設した。"},{"sentence":"Living with a colostomy requires adjustments to diet and lifestyle.","translation":"人工肛門とともに生きるには、食事や生活習慣の調整が必要となる。"}],"collocations":["have a colostomy","undergo a colostomy","colostomy bag","colostomy surgery"],"synonyms":["artificial anus","stoma","bowel diversion"],"antonyms":[]}],"etymology":{"value":"The word \"colostomy\" is derived from the Greek words \"colon\" (κόλον), referring to the colon or large intestine, and \"stoma\" (στόμα), meaning mouth or opening.","priority":"★★☆"},"pronunciation":{"ipa":"/kəˈlɒstəmi/","syllables":"co-los-to-my"},"inflection":{"noun_plural":"colostomies"},"usage_notes":{"explanation":"A colostomy is a surgical procedure that creates an opening (stoma) in the abdominal wall through which the colon (large intestine) can empty. This is often necessary when a portion of the colon is diseased or damaged, preventing normal bowel function. Waste is collected in a bag attached to the stoma. Colostomies can be temporary or permanent, depending on the underlying medical condition.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a colostomy in his stomach.","correct":"✓ He has a colostomy in his abdomen.","note":"The stoma is created in the abdominal wall, not the stomach."},{"incorrect":"✗ Colostomy is a disease.","correct":"✓ Colostomy is a surgical procedure.","note":"Colostomy is the name of the procedure, not a disease itself. It is performed to manage the effects of a disease."}],"priority":"★★☆"},"related_words":{"derivatives":["colostomic (adjective)"],"phrasal_verbs":[],"related_medical_terms":["ileostomy","urostomy","ostomy","stoma","colon resection","bowel obstruction","inflammatory bowel disease (IBD)","colon cancer"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'colostomy' refers to a specific surgical procedure involving the creation of an opening in the abdomen for bowel evacuation. Understanding this term requires a basic knowledge of medical terminology and human anatomy, specifically the digestive system. It's a term primarily used in medical contexts and discussions related to surgical interventions for bowel-related conditions."},"example_sentences":[{"sentence":"After the accident, she required a temporary **colostomy** to allow her colon to heal.","translation":"事故の後、彼女は結腸を治癒させるために一時的な人工肛門を必要とした。","type":"noun","meaning_category":"人工肛門"},{"sentence":"The **colostomy** bag needs to be emptied several times a day.","translation":"人工肛門バッグは一日に数回空にする必要がある。","type":"noun","meaning_category":"人工肛門"}]}