{"word":"propheticism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"予言主義、予言的傾向","english_definition":"Belief in or adherence to prophecy; the practice of making or interpreting prophecies.","examples":[{"sentence":"The rise of propheticism in the movement led to some unusual interpretations of scripture.","translation":"その運動における予言主義の高まりは、聖書のいくつかの異例な解釈につながった。"},{"sentence":"Some scholars see propheticism as a key element in the development of early religious thought.","translation":"一部の学者は、予言主義を初期の宗教思想の発展における重要な要素と見なしている。"}],"collocations":["religious propheticism","biblical propheticism","modern propheticism"],"synonyms":["prophecy","divination","soothsaying","prognostication"],"antonyms":[]}],"etymology":{"value":"From 'prophetic' (relating to prophecy) + '-ism' (denoting a belief, practice, or ideology).","priority":"★★☆"},"pronunciation":{"ipa":"/prəˈfɛtɪˌsɪzəm/","syllables":"pro-phet-i-cism"},"inflection":{"noun_plural":"propheticisms"},"usage_notes":{"explanation":"'Propheticism' refers to the belief in, or the practice of, prophecy. It can describe a general tendency to make or interpret prophecies, or a specific religious or cultural movement centered on prophecy. It is often used in academic or theological contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a propheticism.","correct":"✓ He is a prophet.","note":"'Propheticism' is a belief or practice, not a person. A person who makes prophecies is a 'prophet' or a 'prophetess'."}],"priority":"★★☆"},"related_words":{"derivatives":["prophet (noun: 預言者)","prophecy (noun: 予言)","prophetic (adjective: 予言的な)","prophetically (adverb: 予言的に)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Propheticism' is a relatively uncommon term referring to the belief in or practice of prophecy. It's often used in religious studies, theology, or historical contexts when discussing movements or ideologies centered around prophetic interpretations or pronouncements. Understanding this term requires familiarity with the concept of prophecy itself."},"example_sentences":[{"sentence":"The study explores the role of propheticism in shaping social movements.","translation":"その研究は、社会運動の形成における予言主義の役割を探求している。","type":"general","meaning_category":"belief system"},{"sentence":"The community was characterized by a strong emphasis on propheticism and divine revelation.","translation":"そのコミュニティは、予言主義と神の啓示を強く重視することを特徴としていた。","type":"religious","meaning_category":"religious practice"}]}