{"word":"Millenarianism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"千年王国説、千年至福説","english_definition":"The belief by a religious, social, or political group or movement in a coming fundamental transformation of society, after which all things will be changed, based on a one-thousand-year cycle.","examples":[{"sentence":"Millenarianism has been a recurring theme in various religious movements throughout history.","translation":"千年王国説は、歴史を通じて様々な宗教運動で繰り返されるテーマとなっている。"},{"sentence":"Some scholars interpret early Christian beliefs as having millenarian aspects.","translation":"一部の学者は、初期キリスト教の信仰に千年王国説的な側面があったと解釈している。"},{"sentence":"The movement's millenarian vision promised a utopian future for its followers.","translation":"その運動の千年王国的なビジョンは、信者たちにユートピア的な未来を約束した。"}],"collocations":["religious millenarianism (宗教的な千年王国説)","political millenarianism (政治的な千年王国説)","social millenarianism (社会的な千年王国説)","apocalyptic millenarianism (黙示録的な千年王国説)","early millenarianism (初期の千年王国説)"],"synonyms":["chiliasm","millennialism","utopianism","apocalypticism"],"antonyms":[]}],"etymology":{"value":"From 'millenarian', derived from Latin 'mille' (thousand) + 'annus' (year) + '-arian' (suffix denoting a believer or supporter). Refers to the belief in a thousand-year period of divine rule or perfect peace.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɪləˈnɛəriənɪzəm/","syllables":"mil-le-nar-i-an-is-m"},"inflection":{"noun_plural":"Millenarianisms"},"usage_notes":{"explanation":"'Millenarianism' refers to the belief in a future, often apocalyptic, transformation of society followed by a golden age, typically lasting one thousand years. It is often associated with religious movements, particularly within Christianity, but can also appear in secular political and social ideologies. The term emphasizes the belief in a radical change and a subsequent period of perfection or divine rule.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Millenarianism is about believing in the past.","correct":"✓ Millenarianism is about believing in a future transformation.","note":"Millenarianism focuses on a future, not a past, transformation of society."},{"incorrect":"✗ Millenarianism is the same as ordinary religious faith.","correct":"✓ Millenarianism involves a specific belief in a coming fundamental societal change.","note":"Millenarianism is a specific belief system, not a general religious faith."}],"priority":"★★☆"},"related_words":{"derivatives":["millenarian (adjective, noun)","millennial (adjective, noun)","chiliast (noun)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Millenarianism' is a complex term referring to a belief system centered on a coming, transformative period of one thousand years, often associated with religious or social upheaval and subsequent utopian conditions. It is primarily used in academic, theological, and historical contexts when discussing specific belief systems and movements focused on such a future transformation.","priority":"★★☆"},"example_sentences":[{"sentence":"The group's ideology was rooted in a form of millenarianism, promising a new world after the coming cataclysm.","translation":"そのグループのイデオロギーは、来るべき大変動の後に新しい世界を約束する千年王国説の一形態に根ざしていた。","type":"general","meaning_category":"belief system"},{"sentence":"Historians have studied the role of millenarianism in various revolutionary movements.","translation":"歴史家たちは、様々な革命運動における千年王国説の役割を研究してきた。","type":"academic","meaning_category":"historical context"},{"sentence":"Some interpretations of biblical prophecy involve elements of millenarianism.","translation":"聖書の予言のいくつかの解釈には、千年王国説の要素が含まれている。","type":"theological","meaning_category":"religious interpretation"}]}