{"word":"heliostat","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ヘリオスタット、太陽追尾反射鏡","english_definition":"A device that includes a mirror, usually a plane mirror, which turns so as to keep reflecting sunlight toward a predetermined target, compensating for the sun's apparent motions in the sky.","examples":[{"sentence":"The solar power plant uses many heliostats to focus sunlight on a central receiver.","translation":"その太陽光発電所は、太陽光を中央の受光体に集めるために多数のヘリオスタットを使用している。"},{"sentence":"Heliostats are essential components in concentrated solar power systems.","translation":"ヘリオスタットは、集光型太陽熱発電システムにおいて不可欠な構成要素である。"}],"collocations":["solar heliostat","heliostat field","central receiver heliostat","heliostat mirror","heliostat control system"],"synonyms":["solar tracker","sun tracker","mirror array"],"antonyms":[]}],"etymology":{"value":"The word \"heliostat\" comes from the Greek words \"helios\" (ἥλιος), meaning \"sun,\" and \"statos\" (στατός), meaning \"stationary\" or \"standing.\" It combines to mean \"stationary sun,\" referring to the device's ability to keep the sun's reflection fixed on a target.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhiːliəˌstæt/","syllables":"he-li-o-stat"},"inflection":{"noun_plural":"heliostats"},"usage_notes":{"explanation":"A **heliostat** is a device used to reflect sunlight onto a fixed target. It typically consists of a mirror that is automatically adjusted to compensate for the sun's movement, ensuring that the reflected light remains directed at the desired location. Heliostats are commonly used in solar power plants to concentrate sunlight onto a central receiver, which then generates electricity. They can also be used for other purposes, such as solar research and daylighting in buildings.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The heliostat is used to create shadow.","correct":"✓ The heliostat is used to reflect sunlight.","note":"Heliostats are designed to reflect sunlight, not create shadow. Their purpose is to redirect the sun's rays to a specific target. "},{"incorrect":"✗ Heliostat only works at night.","correct":"✓ Heliostats only work during the day.","note":"Heliostats rely on sunlight, so they are only functional during daylight hours. They cannot operate at night."}],"priority":"★☆☆"},"related_words":{"derivatives":["heliostatic (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A **heliostat** is a specialized term primarily encountered in the context of solar energy and physics. It refers to a device that uses a mirror to redirect sunlight to a fixed location, compensating for the sun's movement across the sky. Understanding the term requires familiarity with solar power technology and optical principles. It is not a common word in everyday conversation but is essential in technical discussions related to concentrated solar power.","priority":"★☆☆"},"example_sentences":[{"sentence":"The engineers calibrated the **heliostat** to maximize the efficiency of the solar thermal system.","translation":"エンジニアたちは、太陽熱システムの効率を最大化するためにヘリオスタットを調整した。","type":"general","meaning_category":"Definition"},{"sentence":"The field of **heliostats** stretched across the desert, reflecting the intense sunlight.","translation":"ヘリオスタットのフィールドが砂漠に広がり、強烈な太陽光を反射していた。","type":"general","meaning_category":"Usage"},{"sentence":"The **heliostat's** precise tracking mechanism ensured a constant beam of light on the target.","translation":"ヘリオスタットの精密な追尾機構により、ターゲットに一定の光線が照射された。","type":"technical","meaning_category":"Technical"}]}