{"word":"cross-lap","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(木工) あられ組み、相欠き継ぎ","english_definition":"A woodworking joint in which two pieces of wood are joined by overlapping them with a series of interlocking notches or recesses.","examples":[{"sentence":"The table legs were attached to the tabletop using a strong cross-lap joint.","translation":"テーブルの脚は、丈夫なあられ組みの継ぎ手を使って天板に取り付けられました。"},{"sentence":"He carefully cut the cross-lap joints to ensure a tight and secure fit.","translation":"彼は、きつくしっかりと合うように、あられ組みの継ぎ手を注意深く切りました。"}],"collocations":["make a cross-lap joint (あられ組みを作る)","cut a cross-lap (あられ組みを切る)","strong cross-lap (丈夫なあられ組み)"],"synonyms":["halving joint","housing joint","lap joint"],"antonyms":[]},{"part_of_speech":"verb","definition":"(木工) あられ組みにする、相欠き継ぎにする","english_definition":"To join two pieces of wood using a cross-lap joint.","examples":[{"sentence":"The carpenter cross-lapped the two pieces of wood to create a strong frame.","translation":"その大工は、丈夫なフレームを作るために、2つの木材をあられ組みにしました。"}],"collocations":["cross-lap two pieces (2つの部品をあられ組みにする)"],"synonyms":["lap joint","halve joint"],"antonyms":[]}],"etymology":{"value":"The term 'cross-lap' is derived from the combination of 'cross' (referring to the intersecting nature of the joint) and 'lap' (referring to the overlapping of the wood pieces).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkrɔsˌlæp/","syllables":"cross-lap"},"inflection":{"verb_forms":{"present_simple":["cross-lap","cross-laps"],"past_simple":"cross-lapped","past_participle":"cross-lapped","present_participle":"cross-lapping"},"noun_plural":"cross-laps"},"usage_notes":{"explanation":"A cross-lap joint is a strong and visually appealing woodworking joint often used for joining frame members or creating sturdy structures. It involves removing material from both pieces of wood so that they interlock and create a flush surface. The strength of the joint comes from the glue surface area and the mechanical interlock.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a cross lap joint for the dovetail.","correct":"✓ He used a cross-lap joint, not a dovetail joint.","note":"Cross-lap joints and dovetail joints are different types of woodworking joints. They should not be confused."}],"priority":"★☆☆"},"related_words":{"derivatives":["lap joint","dovetail joint","mortise and tenon joint"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"None (Technical vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cross-lap' refers to a specific woodworking technique used to join two pieces of wood. It's a more advanced term, typically encountered in carpentry or woodworking contexts. Understanding this term requires familiarity with woodworking processes and terminology. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The craftsman used a cross-lap joint to connect the frame pieces.","translation":"職人はあられ組みの継ぎ手を使ってフレームの部品を接続しました。","type":"noun","meaning_category":"あられ組み"},{"sentence":"He carefully cross-lapped the boards to create a sturdy shelf.","translation":"彼は丈夫な棚を作るために、注意深く板をあられ組みにしました。","type":"verb","meaning_category":"あられ組みにする"}]}