{"word":"bitterwort","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"センブリ (植物)","english_definition":"A plant of the genus Gentianella, especially Gentianella amarella (autumn gentian), known for its bitter taste and medicinal properties.","examples":[{"sentence":"Bitterwort is used in traditional medicine as a digestive aid.","translation":"センブリは伝統医学で消化を助ける薬として使われています。"},{"sentence":"The bitter taste of bitterwort makes it unpalatable to most animals.","translation":"センブリの苦味はほとんどの動物にとって不味いものです。"}],"collocations":["bitterwort extract","bitterwort tea"],"synonyms":["gentianella","autumn gentian"],"antonyms":[]}],"etymology":{"value":"Derived from 'bitter' referring to the plant's taste, and 'wort' an Old English word for plant or herb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɪtərwɜːrt/","syllables":"bit-ter-wort"},"inflection":{"noun_plural":"bitterworts"},"usage_notes":{"explanation":"'Bitterwort' specifically refers to plants of the Gentianella genus, known for their intense bitterness. It is often used in herbal medicine.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I found a bitterwort in my garden that smells sweet.","correct":"✓ I found a plant in my garden that looks like bitterwort, but it smells sweet.","note":"Bitterwort is known for its bitter taste, not its sweet smell. If a plant resembles bitterwort but smells sweet, it is likely a different plant."}],"priority":"★★☆"},"related_words":{"derivatives":["bitter (adjective)","wort (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Bitterwort' is a specialized term primarily used in botany and herbal medicine. Understanding requires familiarity with plant classifications and traditional medicine practices. The word itself is descriptive, combining 'bitter' and 'wort' (old word for plant), but its specific application is limited.","requires_background_knowledge":true},"example_sentences":[{"sentence":"The herbalist recommended bitterwort for its digestive benefits.","translation":"薬草医はセンブリの消化促進効果を推奨しました。","type":"noun","meaning_category":"plant/herb"},{"sentence":"Bitterwort is a common ingredient in traditional herbal remedies.","translation":"センブリは伝統的な薬草療法によく使われる成分です。","type":"noun","meaning_category":"plant/herb"}]}