{"word":"Oligohemia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(病理)血液量減少症、血液希釈症","english_definition":"A deficiency in the volume of the blood; a condition in which the total blood volume is less than normal.","examples":[{"sentence":"Oligohemia can result from severe blood loss.","translation":"血液量減少症は、重度の出血によって引き起こされることがある。"},{"sentence":"Symptoms of oligohemia include fatigue and dizziness.","translation":"血液量減少症の症状には、疲労感やめまいなどがある。"}],"collocations":["cause oligohemia","treat oligohemia","severe oligohemia","chronic oligohemia"],"synonyms":["hypovolemia","oligemia"],"antonyms":["hypervolemia","polycythemia"]}],"etymology":{"value":"From Greek 'oligos' (ὀλίγος) meaning 'few, little' + 'haima' (αἷμα) meaning 'blood' + '-ia' suffix indicating a condition.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒlɪɡoʊˈhiːmiə/","syllables":"ol-i-go-he-mi-a"},"inflection":{"noun_plural":"oligohemias"},"usage_notes":{"explanation":"Oligohemia refers specifically to a decrease in blood volume, whereas anemia refers to a decrease in the number of red blood cells or hemoglobin concentration. Oligohemia is less commonly used than hypovolemia.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient has oligohemia because of iron deficiency.","correct":"✓ The patient has anemia because of iron deficiency.","note":"Iron deficiency typically leads to anemia (low red blood cell count or hemoglobin), not oligohemia (low blood volume)."},{"incorrect":"✗ Oligohemia is treated with iron supplements.","correct":"✓ Oligohemia is treated with fluid replacement and addressing the underlying cause.","note":"Oligohemia is treated by restoring blood volume, often through fluid replacement. Iron supplements are used for iron-deficiency anemia."}],"priority":"★★☆"},"related_words":{"derivatives":["oligohemic (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (specialized medical vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Oligohemia' is a medical term referring to a condition where the total volume of blood in the body is less than normal. It's not a commonly used term in everyday language and is primarily found in medical contexts. It's important to differentiate it from 'anemia,' which refers to a deficiency in red blood cells or hemoglobin. Oligohemia is often caused by blood loss or dehydration and is treated by restoring fluid volume.","priority":"★★☆"},"example_sentences":[{"sentence":"The patient presented with severe oligohemia following a traumatic injury.","translation":"その患者は外傷後、重度の血液量減少症を呈した。","type":"medical","meaning_category":"blood volume deficiency"},{"sentence":"Rapid fluid resuscitation is critical in managing oligohemia.","translation":"血液量減少症の管理には、迅速な輸液蘇生が不可欠である。","type":"medical","meaning_category":"blood volume deficiency"}]}