{"word":"pro-form","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(言語学) 代形式：名詞句、動詞句、節などを指すために使われる語句。代名詞、代動詞、代副詞などを含む。","english_definition":"(linguistics) A word or phrase that stands in for another word, phrase, clause, or sentence, when the meaning is recoverable from the context. Pro-forms include pronouns, pro-verbs, and pro-adverbs.","examples":[{"sentence":"'He' is a pro-form that can stand in for a noun phrase like 'John'.","translation":"「彼」は「ジョン」のような名詞句の代わりになる代形式です。"},{"sentence":"In the sentence 'I like it and so does she', 'so does' is a pro-form standing in for 'likes it'.","translation":"「私はそれが好きで、彼女もそうです」という文では、「so does」は「likes it」の代わりとなる代形式です。"},{"sentence":"Pro-forms help to avoid repetition in language.","translation":"代形式は言語における繰り返しを避けるのに役立ちます。"}],"collocations":["pronoun as a pro-form (代名詞としての代形式)","pro-verb (代動詞)","pro-adverb (代副詞)","anaphoric pro-form (照応的な代形式)","cataphoric pro-form (前方照応的な代形式)"],"synonyms":["substitute","replacement","dummy word"],"antonyms":[]}],"etymology":{"value":"'Pro-' (for, in place of) + 'form' (linguistic unit).","priority":"★★★"},"pronunciation":{"ipa":"/ˈproʊˌfɔːrm/","syllables":"pro-form"},"inflection":{"noun_plural":"pro-forms"},"usage_notes":{"explanation":"A pro-form is a linguistic unit that replaces a longer expression. The most common type is the pronoun, which replaces a noun phrase. Pro-verbs replace verb phrases, and pro-adverbs replace adverbial phrases. Pro-forms are essential for creating concise and coherent text by avoiding unnecessary repetition.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The proform is only pronouns.","correct":"✓ Pro-forms include pronouns, pro-verbs, and pro-adverbs.","note":"Pro-forms are not limited to pronouns; they encompass various types of words that substitute for other linguistic units."},{"incorrect":"✗ Use proforms to make the sentence more complicated.","correct":"✓ Use pro-forms to make the sentence more concise and avoid repetition.","note":"The purpose of using pro-forms is to simplify sentences and avoid repetition, not to complicate them."}],"priority":"★★☆"},"related_words":{"derivatives":["pronoun (代名詞)","pro-verb (代動詞)","pro-adverb (代副詞)","anaphora (照応)","cataphora (前方照応)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency. Primarily used in linguistic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'pro-form' is a linguistic term referring to a word or phrase that replaces a longer expression, such as a noun phrase, verb phrase, or clause. Pronouns are the most common type of pro-form, but pro-verbs and pro-adverbs also exist. Pro-forms are used to avoid repetition and make language more concise. Understanding pro-forms is important for analyzing sentence structure and understanding how meaning is conveyed in language.","priority":"★★★"},"example_sentences":[{"sentence":"'It' in 'The book is interesting, I read it yesterday' is a pro-form.","translation":"「その本は面白い、私は昨日それを読んだ」の「それ」は代形式です。","type":"noun","meaning_category":"代形式の例"},{"sentence":"Pro-forms are crucial for textual cohesion.","translation":"代形式はテキストの結束に不可欠です。","type":"noun","meaning_category":"役割"},{"sentence":"The use of pro-forms reduces redundancy in writing.","translation":"代形式の使用は文章の冗長性を減らします。","type":"noun","meaning_category":"利点"}]}