{"word":"Chimarikan","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A hypothetical language family that would include the Chumashan and Salinan languages of California.","english_definition":"A proposed language family consisting of the Chumashan and Salinan languages, both indigenous to California.","examples":[{"sentence":"The Chimarikan hypothesis suggests a possible genetic relationship between Chumashan and Salinan.","translation":"チマリカン仮説は、チュマシュ語族とサリナン語族の間の遺伝的な関係性を示唆しています。"}],"collocations":["Chimarikan languages","Chimarikan hypothesis","Chumashan languages","Salinan languages","language family"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Formed from the names of the Chumashan and Salinan language families.","priority":"★★★"},"pronunciation":{"ipa":"/ˌtʃɪməˈrɪkən/","syllables":"chi-ma-ri-kan"},"inflection":{"noun_plural":"Chimarikan languages"},"usage_notes":{"explanation":"The term 'Chimarikan' is primarily used in linguistic discussions concerning the possible relationships between Native Californian languages. The hypothesis is not universally accepted.","priority":"★★★"},"common_mistakes":[],"related_words":{"derivatives":[],"related_terms":["Chumashan","Salinan","language family","linguistics","Native American languages"]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★★★"},"readability_explanation":{"level":"C2","text":"The term 'Chimarikan' is a specialized term used within the field of linguistics, specifically when discussing hypothetical language families of Native California. Understanding this term requires familiarity with linguistic classification and the indigenous languages of California."},"example_sentences":[{"sentence":"The validity of the Chimarikan language family remains a topic of debate among linguists.","translation":"チマリカン語族の妥当性は、言語学者の間で議論の的となっています。","type":"noun","meaning_category":"Language family"},{"sentence":"Some linguists have proposed the Chimarikan hypothesis based on lexical similarities between Chumashan and Salinan.","translation":"一部の言語学者は、チュマシュ語族とサリナン語族の語彙の類似性に基づいて、チマリカン仮説を提唱しています。","type":"noun","meaning_category":"Language family"}]}