{"word":"down-beater","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"（音楽）指揮者が拍子を取る際に最初に来る強い拍","english_definition":"(music) the first, accented beat of a measure, typically indicated by a downward motion of the conductor's baton.","examples":[{"sentence":"The conductor emphasized the down-beater to keep the orchestra in sync.","translation":"指揮者はオーケストラをシンクさせるために、ダウンビートを強調した。"},{"sentence":"The drummer accented the down-beater to give the song a strong rhythmic foundation.","translation":"ドラマーは曲に強いリズムの基礎を与えるために、ダウンビートを強調した。"}],"collocations":["emphasize the down-beater","accent the down-beater","strong down-beater","weak down-beater"],"synonyms":["downbeat","beat one","first beat"],"antonyms":["upbeat","off-beat"]},{"part_of_speech":"noun","definition":"（俗語、軽蔑的）他人をけなす人、他人を落胆させる人","english_definition":"(slang, derogatory) a person who is discouraging or pessimistic; a killjoy.","examples":[{"sentence":"Don't be such a down-beater; try to look on the bright side.","translation":"そんなに人をけなすなよ。明るい面を見るようにしなさい。"},{"sentence":"He's always been a down-beater, never seeing the positive in anything.","translation":"彼はいつも他人をけなす人で、何事にも良い面を見ようとしない。"}],"collocations":["a real down-beater","chronic down-beater","negative down-beater"],"synonyms":["pessimist","killjoy","spoilsport","wet blanket","Debbie Downer"],"antonyms":["optimist","cheerleader","encourager"]}],"etymology":{"value":"The term 'down-beater' comes from the physical downward motion of a conductor's baton to indicate the first beat of a measure in music. The slang usage likely derives from the idea that such a person 'brings down' the mood or spirits of others.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdaʊnˌbiːtər/","syllables":"down-beat-er"},"inflection":{"noun_plural":"down-beaters"},"usage_notes":{"explanation":"The term 'down-beater' has two distinct meanings. In music, it refers to the first, accented beat of a measure, indicated by a downward motion. In slang, it refers to a person who is pessimistic or discouraging. The slang usage is often considered derogatory.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He's a real downbeater, always happy and positive.","correct":"✓ He's a real down-beater, always negative and pessimistic.","note":"A down-beater is someone who is negative, not positive."},{"incorrect":"✗ The down-beater was on the second beat of the measure.","correct":"✓ The down-beater was on the first beat of the measure.","note":"The down-beater is always the first beat."}],"priority":"★★☆"},"related_words":{"derivatives":["downbeat (noun, adjective): can refer to the first beat or a pessimistic mood)","upbeat (noun, adjective): opposite of downbeat, referring to the unaccented beat or an optimistic mood)","beat (noun): a rhythmic unit in music)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Down-beater' has two meanings. In music, it's the first, strong beat in a bar, shown by a conductor's downward movement. Informally, it's a negative person who discourages others. Context is key to understanding which meaning is intended. The slang use is often negative."},"example_sentences":[{"sentence":"The conductor gave a clear down-beater to start the piece.","translation":"指揮者は曲を始めるために明確なダウンビートを与えた。","type":"noun","meaning_category":"music"},{"sentence":"She tried to ignore the down-beaters and focus on her goals.","translation":"彼女は他人をけなす人たちを無視して、自分の目標に集中しようとした。","type":"noun","meaning_category":"slang"}]}