{"word":"thermionic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"熱電子放出の、熱電子の","english_definition":"Relating to or involving the emission of electrons from a heated surface.","examples":[{"sentence":"thermionic emission is the basis for vacuum tubes.","translation":"熱電子放出は真空管の基礎である。"},{"sentence":"The thermionic current increases with temperature.","translation":"熱電子電流は温度とともに増加する。"}],"collocations":["thermionic emission","thermionic diode","thermionic converter"],"synonyms":["thermoelectric"],"antonyms":[]}],"etymology":{"value":"Derived from 'thermo-' (heat) + 'ionic' (relating to ions), reflecting the emission of ions (specifically electrons) due to heat.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌθɜːrmiˈɒnɪk/","syllables":"ther-mi-on-ic"},"inflection":{"notes":"Does not inflect; it's an adjective."},"usage_notes":{"explanation":"'Thermionic' is a technical term primarily used in physics and electrical engineering. It describes phenomena and devices related to the emission of electrons from a heated surface. It's most commonly encountered in the context of thermionic emission, which is the fundamental principle behind vacuum tubes and certain types of energy converters.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The thermionic effect is when heat is absorbed.","correct":"✓ The thermionic effect is when heat causes electrons to be emitted.","note":"The thermionic effect is about *emission* of electrons, not absorption of heat. Heat is the *cause* of the emission."}],"priority":"★☆☆"},"related_words":{"derivatives":["thermion (noun): A thermally emitted electron.","thermionics (noun): The study and application of thermionic emission."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - a specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Thermionic' is a highly specialized term primarily encountered in advanced physics and engineering contexts. Understanding it requires familiarity with concepts such as electron emission, vacuum tubes, and thermodynamics. It's not a word typically used in general conversation or writing. The core concept is that heating a material can cause it to release electrons, and 'thermionic' describes anything related to this process."},"example_sentences":[{"sentence":"The **thermionic** diode was a key component in early radio receivers.","translation":"熱電子ダイオードは初期のラジオ受信機における重要な部品だった。","type":"adjective","meaning_category":"熱電子放出の"},{"sentence":"The efficiency of the **thermionic** converter depends on the work function of the emitter material.","translation":"熱電子コンバーターの効率は、エミッター材料の仕事関数に依存する。","type":"adjective","meaning_category":"熱電子の"}]}