{"word":"unintellectual-looking","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"知的に見えない、知性的に見えない外見の","english_definition":"having an appearance that does not suggest intelligence or intellectual pursuits.","examples":[{"sentence":"He was an unintellectual-looking man, but in reality, he was a brilliant scientist.","translation":"彼は知的に見えない外見の男だったが、実際には、彼は優秀な科学者だった。"},{"sentence":"The character was designed to be unintellectual-looking to contrast with his surprising intelligence.","translation":"そのキャラクターは、彼の驚くべき知性と対照的に、知的に見えないように設計された。"}],"collocations":["unintellectual-looking appearance","unintellectual-looking face","unintellectual-looking demeanor"],"synonyms":["dull-looking","simple-looking","unintelligent-appearing","vacant-looking"],"antonyms":["intellectual-looking","intelligent-looking","scholarly-looking"],"notes":["This adjective is often used to describe someone whose appearance does not match their actual intelligence or abilities."]}],"etymology":{"value":"Formed by combining 'un-' (not) + 'intellectual' + '-looking' (having the appearance of).","priority":"low"},"pronunciation":{"ipa":"/ˌʌnɪnˈtelɪktʃuəl ˈlʊkɪŋ/","syllables":"un-in-tel-lec-tu-al look-ing"},"inflection":{"notes":"This is an adjective and does not have different forms for inflection."},"usage_notes":{"explanation":"'Unintellectual-looking' describes someone whose outward appearance does not suggest intelligence or scholarly interests. It can be used to describe facial features, clothing, or general demeanor. It's important to use this term carefully, as judging someone's intelligence based on appearance can be misleading and unfair.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"He was unintellectual-looking, but he was very intellectual.","correct":"He was unintellectual-looking, but he was actually very intelligent.","note":"It's better to use 'intelligent' when referring to someone's actual mental capacity."}],"priority":"low"},"related_words":{"derivatives":["intellectual","intellectually","looking"],"related_terms":["unintelligent","uneducated","simple","naive"]},"level_frequency":{"frequency_google_ngram":"Low frequency - not a common term.","priority":"low"},"readability_explanation":{"level":"C1","text":"The term 'unintellectual-looking' is relatively uncommon and implies a nuanced understanding of how appearances can be misleading regarding a person's intelligence. It's suitable for advanced English speakers who can appreciate the subtlety of the description."},"example_sentences":[{"sentence":"Despite his unintellectual-looking glasses, he was a renowned physicist.","translation":"知的に見えない眼鏡をかけているにもかかわらず、彼は有名な物理学者だった。","type":"general","meaning_category":"appearance"},{"sentence":"The director chose an unintellectual-looking actor to play the role of the genius detective.","translation":"監督は、天才的な探偵の役を演じるために、知的に見えない俳優を選んだ。","type":"general","meaning_category":"appearance"}]}