{"word":"nonheme","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"非ヘム性の","english_definition":"Not containing heme.","examples":[{"sentence":"Nonheme iron is found in plant-based foods.","translation":"非ヘム鉄は植物性食品に含まれています。"}],"collocations":["nonheme iron"],"synonyms":[],"antonyms":["heme"]},{"part_of_speech":"noun","definition":"非ヘム鉄","english_definition":"Iron that is not part of a heme group.","examples":[{"sentence":"Nonheme iron absorption is affected by other dietary factors.","translation":"非ヘム鉄の吸収は、他の食事要因の影響を受けます。"}],"collocations":["nonheme iron"],"synonyms":[],"antonyms":["heme iron"]}],"etymology":{"value":"'non-' + 'heme'","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌnɒnˈhiːm/","syllables":"non-heme"},"inflection":{},"usage_notes":{"explanation":"'Nonheme' typically refers to nonheme iron, a form of iron found in plant-based foods, as opposed to heme iron, which is found in animal-based foods. Nonheme iron is more susceptible to being affected by other dietary factors that can either enhance or inhibit its absorption.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["heme","iron","nonheme iron"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"'Nonheme' is a technical term, primarily used in the context of nutrition and biochemistry, specifically when discussing iron sources in food. It distinguishes iron that is not bound to a heme molecule (found in animal products) from the iron found in plant-based foods. Understanding this term is crucial for those studying nutrition or dealing with dietary planning, especially for vegetarians or individuals with iron deficiency.","priority":"★★☆"},"example_sentences":[{"sentence":"The absorption of nonheme iron can be increased by consuming vitamin C.","translation":"非ヘム鉄の吸収は、ビタミンCを摂取することで増加させることができます。","type":"noun","meaning_category":"非ヘム鉄"},{"sentence":"Nonheme iron sources include beans, lentils, and fortified cereals.","translation":"非ヘム鉄の供給源には、豆類、レンズ豆、および強化シリアルが含まれます。","type":"adjective","meaning_category":"非ヘム性の"}]}