{"word":"Twice-Identified","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"二重に特定された、二重に特別なニーズを持つ","english_definition":"Describing an individual who is identified as having both a gift or talent and a learning disability or other special need.","examples":[{"sentence":"Twice-identified students may struggle in school despite their high potential.","translation":"二重に特定された生徒は、高い潜在能力を持っているにもかかわらず、学校で苦労することがあります。"},{"sentence":"Support for twice-identified learners requires a nuanced understanding of their strengths and weaknesses.","translation":"二重に特定された学習者への支援には、彼らの強みと弱みを理解することが必要です。"}],"collocations":["twice-identified student","twice-identified learner","twice-exceptional"],"synonyms":["2e","twice-exceptional"],"antonyms":[]}],"etymology":{"value":"The term combines the concept of being 'identified' as gifted or talented with the simultaneous identification of a learning disability or other special need.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtwaɪs aɪˈdɛntɪfaɪd/","syllables":"twice-i-den-ti-fied"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"'Twice-identified' (often shortened to '2e' for 'twice-exceptional') refers to individuals who are both gifted and have a learning disability, ADHD, autism spectrum disorder, or other condition that impacts learning or development. These individuals often present a unique challenge in educational settings, as their gifts may mask their disabilities, or vice versa. Effective support requires recognizing and addressing both their strengths and weaknesses.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is twice identified.","correct":"✓ He is a twice-identified student.","note":"'Twice-identified' is typically used as an adjective before a noun (e.g., student, child, learner)."},{"incorrect":"✗ Twice identified are always geniuses.","correct":"✓ Twice-identified students are often highly intelligent, but they also face learning challenges.","note":"While twice-identified individuals are often gifted, it's important not to overgeneralize. The term refers to the co-occurrence of gifts and challenges."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["gifted","learning disability","special needs","twice-exceptional","2e"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency; primarily used in educational and psychological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'twice-identified' is a specialized term used in education and psychology to describe individuals who have both gifts or talents and a learning disability or other special need. Understanding this term requires familiarity with concepts of giftedness and special education. The term highlights the importance of recognizing and supporting both the strengths and challenges of these individuals.","priority":"★★☆"},"example_sentences":[{"sentence":"The school provides specialized programs for **twice-identified** students.","translation":"その学校は、二重に特定された生徒のための専門プログラムを提供しています。","type":"adjective","meaning_category":"Describing students with both gifts and learning disabilities"},{"sentence":"Supporting **twice-identified** learners requires a holistic approach.","translation":"二重に特定された学習者を支援するには、全体的なアプローチが必要です。","type":"adjective","meaning_category":"Describing learners with both gifts and learning disabilities"}]}