{"word":"iconometrically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"Using iconometry; by means of iconometry.","english_definition":"By means of iconometry; according to iconometric principles.","examples":[{"sentence":"The painting was analyzed iconometrically to determine its age.","translation":"その絵画は、その年代を特定するために、図像計測学的に分析された。"},{"sentence":"The proportions of the figures were assessed iconometrically.","translation":"人物のプロポーションは、図像計測学的に評価された。"}],"collocations":["analyze iconometrically","assess iconometrically","measure iconometrically"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From 'iconometry' (the science or method of measuring images or icons) + '-ically'.","priority":"★★★"},"pronunciation":{"ipa":"/aɪˌkɒnəˈmɛtrɪkli/","syllables":"i-con-o-met-ri-cal-ly"},"inflection":{},"usage_notes":{"explanation":"'Iconometrically' is a technical term primarily used in art history, archaeology, and related fields. It describes the application of iconometry, which involves the precise measurement and analysis of images, icons, or other visual representations to gain insights into their proportions, symbolism, and cultural context.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["iconometry","iconometric"],"related_terms":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'iconometrically' is a highly specialized term primarily used in academic or technical contexts related to art history and image analysis. It signifies the use of iconometry, a method involving precise measurements of images to extract meaningful data. Due to its niche usage, it is unlikely to appear in general English texts and is primarily encountered in scholarly articles or specialized studies. Understanding requires familiarity with art historical methodologies and technical vocabulary."},"example_sentences":[{"sentence":"The artist's use of perspective was examined iconometrically to reveal underlying geometric principles.","translation":"遠近法の芸術家の使用は、根底にある幾何学的原理を明らかにするために、図像計測学的に調べられた。","type":"general","meaning_category":"analysis"},{"sentence":"The ancient frescoes were documented iconometrically before restoration work began.","translation":"古代のフレスコ画は、修復作業が始まる前に、図像計測学的に記録された。","type":"general","meaning_category":"documentation"}]}