{"word":"finish-ream","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"(manufacturing) To ream a hole to its final, precise dimensions after other machining operations.","english_definition":"To perform a final reaming operation on a hole to achieve a precise size and smooth surface finish. This is typically done after other machining processes have brought the hole close to its desired dimensions.","examples":[{"sentence":"The machinist will finish-ream the cylinder bore to ensure a perfect fit for the piston.","translation":"機械工は、ピストンが完全に適合するように、シリンダーの内径を仕上げリーマ加工する予定です。"},{"sentence":"After drilling and rough-reaming, we finish-ream the hole to a tolerance of +/- 0.0005 inches.","translation":"ドリル加工と粗リーマ加工の後、穴を±0.0005インチの公差で仕上げリーマ加工します。"},{"sentence":"Finish-reaming is critical for achieving the required surface finish in hydraulic valve bodies.","translation":"仕上げリーマ加工は、油圧バルブ本体に必要な表面仕上げを実現するために非常に重要です。"}],"collocations":["finish-ream a hole","finish-ream to a tolerance","finish-ream a bore","finish-ream a cylinder"],"synonyms":["ream","bore","hone","burnish"],"antonyms":["drill","rough-ream"]}],"etymology":{"value":"The term 'finish-ream' is a compound word combining 'finish' (indicating the final stage of a process) and 'ream' (referring to the machining process of enlarging a hole with a rotating tool). The etymology is straightforward, reflecting the function of the process.","priority":"N/A"},"pronunciation":{"ipa":"/ˈfɪnɪʃˌriːm/","syllables":"fin-ish-ream"},"inflection":{"verb_forms":{"present_simple":["finish-ream","finish-reams"],"past_simple":"finish-reamed","past_participle":"finish-reamed","present_participle":"finish-reaming"}},"usage_notes":{"explanation":"'Finish-ream' is a technical term used in manufacturing and machining. It specifically refers to the final reaming operation performed to achieve the desired accuracy and surface finish of a hole. It is often used in the context of precision engineering and metalworking. The term implies that one or more rougher reaming operations have already been performed.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ I finished reaming the hole.","correct":"✓ I finish-reamed the hole.","note":"While 'finished reaming' is grammatically correct, 'finish-reamed' is the more precise and commonly used term in manufacturing contexts to describe the specific final reaming process."}],"priority":"N/A"},"related_words":{"derivatives":["reamer (tool)","reaming (process)"],"phrasal_verbs":[],"related_terms":["rough-ream","bore","drill","hone","surface finish","tolerance","machining","metalworking","precision engineering"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - technical term used in specific industries.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Finish-ream' is a highly specialized term used in manufacturing, specifically in machining processes. It describes the final step of reaming a hole to achieve very precise dimensions and a smooth surface. This term is unlikely to be encountered outside of technical contexts related to engineering, metalworking, or manufacturing. Understanding requires familiarity with basic machining concepts and terminology."},"example_sentences":[{"sentence":"The technician used a carbide reamer to finish-ream the bearing housing.","translation":"技術者は、ベアリングハウジングを仕上げリーマ加工するために、超硬リーマを使用しました。","type":"verb","meaning_category":"manufacturing"},{"sentence":"The specifications require that all holes are finish-reamed to a surface finish of 16 microinches.","translation":"仕様では、すべての穴を表面仕上げ16マイクロインチまで仕上げリーマ加工する必要があると規定されています。","type":"verb","meaning_category":"manufacturing"},{"sentence":"After the initial drilling, the holes are rough-reamed and then finish-reamed for optimal precision.","translation":"最初のドリル加工後、穴は最適な精度を得るために粗リーマ加工され、次に仕上げリーマ加工されます。","type":"verb","meaning_category":"manufacturing"}]}