{"word":"branchiosaurian","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"盤竜類","english_definition":"An extinct genus of small aquatic amphibians from the Late Carboniferous and Early Permian periods.","examples":[{"sentence":"The branchiosaurian was a small amphibian that lived in freshwater environments.","translation":"盤竜類は、淡水環境に生息していた小型の両生類でした。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"adjective","definition":"盤竜類に属する","english_definition":"Relating to the Branchiosauridae family of amphibians.","examples":[{"sentence":"Branchiosaurian fossils have been found in Europe and North America.","translation":"盤竜類の化石は、ヨーロッパと北米で発見されています。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From the genus name *Branchiosaurus*, derived from the Greek words *branchia* (gill) and *sauros* (lizard), referring to the external gills present in the larval stage.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌbræŋkiəˈsɔːriən/","syllables":"bran-chi-o-saur-i-an"},"inflection":{"noun_plural":"branchiosaurians"},"usage_notes":{"explanation":"The term 'branchiosaurian' is primarily used in paleontological contexts when discussing extinct amphibians. It refers to both the animal itself (as a noun) and characteristics related to the animal (as an adjective).","priority":"☆☆☆"},"common_mistakes":{},"related_words":{"derivatives":["Branchiosauridae (family)","Branchiosaurus (genus)"],"priority":"☆☆☆"},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term 'branchiosaurian' is a highly specialized term used within the field of paleontology. It is unlikely to be encountered outside of scientific literature or discussions about extinct amphibians. Understanding requires knowledge of biological classification and evolutionary history."},"example_sentences":[{"sentence":"Several well-preserved branchiosaurian specimens have provided insights into amphibian metamorphosis.","translation":"保存状態の良い盤竜類の標本がいくつか、両生類の変態に関する洞察を提供しています。","type":"noun","meaning_category":"盤竜類"},{"sentence":"The branchiosaurian larva possessed external gills, a feature rarely seen in modern amphibians.","translation":"盤竜類の幼生は外鰓を持っており、これは現代の両生類ではめったに見られない特徴です。","type":"adjective","meaning_category":"盤竜類に属する"}]}