{"word":"Discobolos","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"円盤投げの選手、円盤投げの像","english_definition":"A discus thrower; especially, a famous statue of a discus thrower by Myron.","examples":[{"sentence":"The Discobolos is a famous example of classical Greek sculpture.","translation":"円盤投げ（の像）は、古典ギリシャ彫刻の有名な例です。"},{"sentence":"He admired the Discobolos for its depiction of athletic form.","translation":"彼は円盤投げの像の、運動選手の体型の描写に感銘を受けた。"}],"collocations":["Discobolos statue","Myron's Discobolos"],"synonyms":["discus thrower"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek δισκοβόλος (diskobólos), from δίσκος (dískos, “discus”) + βολή (bolḗ, “a throw”).","priority":"★★★"},"pronunciation":{"ipa":"/dɪˈskɒbələs/","syllables":"Dis-cob-o-los"},"inflection":{"noun_plural":"Discoboloi (Greek plural), Discoboloses"},"usage_notes":{"explanation":"Discobolos refers both to an athlete participating in the sport of discus throwing and, more specifically, to the famous statue created by the Greek sculptor Myron in the 5th century BC. When capitalized, it often refers to the statue.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a discobolos in the museum, it was throwing.","correct":"✓ I saw a Discobolos in the museum, it was a statue.","note":"Discobolos can refer to a statue, so clarify if it's a statue or a person."}],"priority":"★★☆"},"related_words":{"derivatives":["discus","throw"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Discobolos' is a specialized term primarily used in the context of classical art and athletics. It refers to a discus thrower, most notably the statue by Myron. Due to its specific and somewhat niche usage, it is not a commonly encountered word. Understanding requires familiarity with classical Greek sculpture and athletic events."},"example_sentences":[{"sentence":"The museum displayed a replica of the famous Discobolos.","translation":"博物館には有名な円盤投げの像のレプリカが展示されていた。","type":"noun","meaning_category":"円盤投げの像"},{"sentence":"The ancient Olympics featured events like the pentathlon, which included the discobolos.","translation":"古代オリンピックでは、円盤投げを含む五種競技のような種目が行われた。","type":"noun","meaning_category":"円盤投げの選手"}]}