{"word":"clavichord","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"クラビコード（鍵盤楽器の一種）","english_definition":"A keyboard instrument of the late medieval, Renaissance, and Baroque eras. Pressing a key causes a metal blade to strike a string.","examples":[{"sentence":"She played a Bach prelude on the clavichord.","translation":"彼女はクラビコードでバッハの前奏曲を演奏した。"},{"sentence":"The clavichord's quiet tone is perfect for intimate settings.","translation":"クラビコードの静かな音色は、親密な環境に最適だ。"}],"collocations":["play the clavichord","clavichord music","clavichord recital"],"synonyms":["keyboard instrument","stringed keyboard"],"antonyms":[]}],"etymology":{"value":"From French *clavicorde*, from Latin *clavis* (key) + *chorda* (string).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈklævɪkɔːrd/","syllables":"clav-i-chord"},"inflection":{"noun_plural":"clavichords"},"usage_notes":{"explanation":"The clavichord is a relatively quiet instrument, best suited for small rooms. Its sound is produced by a metal tangent striking a string, which also serves as the end of the string, determining its pitch. The clavichord allows for a degree of expressive control over the sound, including a vibrato-like effect called *Bebung*.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He played the clavichord very loudly.","correct":"✓ He played the clavichord, but it wasn't very loud.","note":"The clavichord is a quiet instrument, so describing it as being played loudly is generally inaccurate."}],"priority":"★☆☆"},"related_words":{"derivatives":["clavichordist"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'clavichord' refers to a specific type of historical keyboard instrument. Understanding requires familiarity with musical instruments and historical music periods. The instrument's quiet nature and the technique of 'Bebung' are aspects that require a more advanced understanding of music terminology."},"example_sentences":[{"sentence":"The museum displayed a beautifully preserved clavichord from the 18th century.","translation":"博物館には、18世紀の美しい状態で保存されたクラビコードが展示されていた。","type":"noun","meaning_category":"instrument"},{"sentence":"Composers like Bach wrote music that was well-suited to the clavichord's delicate sound.","translation":"バッハのような作曲家は、クラビコードの繊細な音色によく合う音楽を作曲した。","type":"noun","meaning_category":"instrument"}]}