{"word":"shoddyite","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A rare copper magnesium hydroxyl sulfate mineral with the chemical formula MgCu₄(SO₄)₂(OH)₆·3H₂O.","english_definition":"A rare copper magnesium hydroxyl sulfate mineral with the chemical formula MgCu₄(SO₄)₂(OH)₆·3H₂O.","examples":[{"sentence":"The crystal structure of shoddyite has been determined using single-crystal X-ray diffraction.","translation":"単結晶X線回折法を用いて、shoddyiteの結晶構造が決定された。"},{"sentence":"Shoddyite is typically found as a secondary mineral in copper deposits.","translation":"Shoddyiteは通常、銅鉱床中の二次鉱物として見られる。"}],"collocations":["crystal structure of shoddyite","secondary mineral","copper deposits"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named in honor of Alan Shoddy, an Australian mineral collector.","priority":"★★★"},"pronunciation":{"ipa":"/ˈʃɒdi.aɪt/","syllables":"shod-dy-ite"},"inflection":{"noun_plural":"shoddyites"},"usage_notes":{"explanation":"Shoddyite is a relatively rare mineral, and information about its occurrence and properties is primarily found in mineralogical databases and scientific publications. It's not a commonly used word outside of the field of mineralogy.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"related_minerals":["serpierite","devilline","chalcanthite"],"chemical_formula":"MgCu₄(SO₄)₂(OH)₆·3H₂O"},"level_frequency":{"frequency_google_ngram":"Extremely low frequency - Primarily used within the field of mineralogy.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Shoddyite' is a highly specialized term used in mineralogy. Understanding and using this term requires advanced knowledge of chemistry and geology. It is unlikely to be encountered outside of scientific literature or specialized discussions within the field of mineralogy."},"example_sentences":[{"sentence":"The shoddyite sample was identified by its distinctive blue-green color and association with other secondary copper minerals.","translation":"そのshoddyiteのサンプルは、特徴的な青緑色と他の二次銅鉱物との関連性によって識別された。","type":"noun","meaning_category":"mineralogy"},{"sentence":"X-ray diffraction analysis confirmed the presence of shoddyite in the mineral assemblage.","translation":"X線回折分析により、鉱物集合体中のshoddyiteの存在が確認された。","type":"noun","meaning_category":"mineralogy"}]}