{"word":"bambocciade","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"バンボッチャード：17世紀のローマで、庶民の日常生活を写実的に描いた風俗画の一種。特に、貧しい人々、農民、物乞い、大道芸人などを描いたもの。","english_definition":"A bambocciade is a genre of painting featuring scenes of everyday life, particularly those depicting the lower classes in 17th-century Rome. These paintings often portrayed poor people, peasants, beggars, and street performers in a realistic manner.","examples":[{"sentence":"The exhibition featured several examples of bambocciade, offering a glimpse into the lives of ordinary people in Rome during the 1600s.","translation":"その展覧会では、バンボッチャードの作品がいくつか展示され、1600年代のローマにおける庶民の生活を垣間見ることができた。"},{"sentence":"Critics of the time often dismissed bambocciade as being vulgar or lacking in artistic merit, but they remain a valuable historical record.","translation":"当時の批評家は、バンボッチャードをしばしば下品であるとか、芸術的価値に欠けるとして退けたが、それらは貴重な歴史的記録として残っている。"}],"collocations":["paint a bambocciade (バンボッチャードを描く)","bambocciade scene (バンボッチャードの場面)","typical bambocciade (典型的なバンボッチャード)"],"synonyms":["genre painting","low-life painting","scene of daily life"],"antonyms":[]}],"etymology":{"value":"イタリア語の「bamboccio」（人形、愚か者、子供っぽい人）に由来する。この言葉は、オランダ人画家ピーテル・ファン・ラール（Pieter van Laer）のあだ名であり、彼はこのジャンルの初期の代表的な画家であった。ファン・ラールは身体的な欠陥があり、そのために「bamboccio」と呼ばれていた。彼のスタイルを模倣した画家たちの作品が「bambocciade」と呼ばれるようになった。","priority":"★★☆"},"pronunciation":{"ipa":"/bambotˈtʃaːde/","syllables":"bam-boc-cia-de"},"inflection":{"noun_plural":"bambocciades"},"usage_notes":{"explanation":"「**bambocciade**」は、特定の美術史の文脈で使用される専門用語です。日常会話で使われることはほとんどありません。美術史や絵画に関する議論で、17世紀のローマの風俗画を指す場合に用いられます。このジャンルの絵画は、しばしば写実的で、庶民の生活を詳細に描写している点が特徴です。","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He painted a beautiful landscape in the style of bambocciade.","correct":"✓ He painted a bambocciade, depicting everyday life in Rome.","note":"バンボッチャードは風景画ではなく、庶民の日常生活を描いた風俗画です。"},{"incorrect":"✗ The museum had a large collection of bambocciade sculptures.","correct":"✓ The museum had a large collection of bambocciade paintings.","note":"バンボッチャードは絵画のジャンルであり、彫刻ではありません。"}],"priority":"★☆☆"},"related_words":{"derivatives":["bamboccio (イタリア語: 人形、愚か者、子供っぽい人)"],"artists":["Pieter van Laer (ピーテル・ファン・ラール)","Michelangelo Cerquozzi (ミケランジェロ・チェルクォッツィ)","Johannes Lingelbach (ヨハネス・リンゲルバッハ)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 美術史の専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**bambocciade**」は、美術史における専門用語であり、一般的には使用されません。この単語は、17世紀のローマで流行した、庶民の日常生活を写実的に描いた風俗画のジャンルを指します。特に、貧しい人々、農民、物乞い、大道芸人などの姿が描かれることが多く、ピーテル・ファン・ラールのような画家がこのジャンルを代表します。美術史の研究や議論においてのみ使われるため、高度な専門知識が必要です。"},"example_sentences":[{"sentence":"The art historian discussed the characteristics of bambocciade in detail.","translation":"美術史家はバンボッチャードの特徴について詳細に議論した。","type":"noun","meaning_category":"風俗画のジャンル"},{"sentence":"Many bambocciade paintings offer valuable insights into the social conditions of 17th-century Rome.","translation":"多くのバンボッチャードの絵画は、17世紀のローマの社会状況に関する貴重な洞察を提供してくれる。","type":"noun","meaning_category":"風俗画のジャンル"}]}