{"word":"fermis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Slang, Internet) A misspelling of 'famous', often used intentionally for humorous effect or to mock someone seeking attention.","english_definition":"(Slang, Internet) An intentional misspelling of 'famous', often used humorously or sarcastically, especially online.","examples":[{"sentence":"Look at this guy, he thinks he's fermis now that he has 100 followers.","translation":"こいつを見ろよ、フォロワーが100人になっただけで有名人だと思ってる。"},{"sentence":"She's trying so hard to be fermis on TikTok.","translation":"彼女はTikTokで有名になろうと必死だ。"}],"collocations":["become fermis","trying to be fermis","internet fermis"],"synonyms":["famous (intentional misspelling)","infamous (sometimes used similarly)"],"antonyms":["unknown","obscure"]}],"etymology":{"value":"A deliberate misspelling of the word 'famous', likely originating in online communities as a form of mockery or humorous exaggeration.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfɜːrmɪs/","syllables":"fer-mis"},"inflection":{"notes":"It is primarily used as a noun, although it can sometimes be used adjectivally. It is often used in the plural (fermises) when referring to multiple instances of someone trying to be famous."},"usage_notes":{"explanation":"'Fermis' is a slang term primarily used in internet culture. It is a deliberate misspelling of 'famous' and is often used sarcastically or humorously to describe someone who is perceived as trying too hard to gain attention or fame, especially online. It carries a slightly mocking or derisive tone.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She's a fermis actress.","correct":"✓ She's trying to be fermis. / ✓ She wants to be fermis.","note":"'Fermis' is not typically used as a direct adjective. Instead, it describes the act of trying to be famous."},{"incorrect":"✗ He's very fermis.","correct":"✓ He's very famous.","note":"When you mean 'famous', use the correct spelling. 'Fermis' is only used intentionally for comedic or sarcastic effect."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["famous","infamous","internet slang","meme","attention-seeking"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Slang, not typically included in CEFR)","frequency_google_ngram":"Low frequency (primarily used in internet slang)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Fermis' is an internet slang term, a deliberate misspelling of 'famous', used to mock or satirize someone's attempts to gain online fame or attention. It is used sarcastically and implies that the person's efforts are exaggerated or insincere. Understanding its usage requires familiarity with internet culture and slang."},"example_sentences":[{"sentence":"That influencer is doing anything to become fermis.","translation":"あのインフルエンサーは何でもして有名になろうとしている。","type":"noun","meaning_category":"Slang"},{"sentence":"He's acting like a fermis after getting a few likes on his post.","translation":"彼は投稿に少し「いいね」がついただけで有名人のように振る舞っている。","type":"noun","meaning_category":"Slang"},{"sentence":"Stop trying to be fermis; it's embarrassing.","translation":"有名になろうとするのはやめて。恥ずかしいよ。","type":"noun","meaning_category":"Slang"}]}