{"word":"shiplessly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"船なしで、船を使わずに、船を失って","english_definition":"Without a ship; in a manner lacking ships; having lost one's ship.","examples":[{"sentence":"They were stranded shiplessly on the deserted island.","translation":"彼らは無人島に船を失い、立ち往生した。"},{"sentence":"The explorers traveled shiplessly across the frozen landscape.","translation":"探検家たちは船を使わずに凍てついた景色の中を旅した。"}],"collocations":["stranded shiplessly","traveled shiplessly"],"synonyms":["without a vessel","by land","ashore"],"antonyms":["by ship","aboard","navigating"],"notes":"This word is relatively rare and often used in descriptive or narrative contexts."}],"etymology":{"value":"Derived from the adjective 'shipless' (without a ship) with the addition of the adverbial suffix '-ly'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʃɪpləsli/","syllables":"ship-less-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"The adverb 'shiplessly' describes an action or state occurring without a ship, either because no ship is available or because a ship has been lost. It is not a common word but can be used to add emphasis to the absence of maritime transport.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They arrived shiplessly to the island.","correct":"✓ They arrived on the island without a ship.","note":"'Shiplessly' describes the manner of an action, not the destination. Use a prepositional phrase like 'without a ship' to describe the state of arriving."}],"priority":"★☆☆"},"related_words":{"derivatives":["shipless (adjective)","ship (noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'shiplessly' is an uncommon adverb used to describe actions performed without a ship. It is most likely to be encountered in literature or historical texts. Understanding its meaning requires a good vocabulary and an understanding of how adverbs modify verbs. "},"example_sentences":[{"sentence":"The survivors drifted shiplessly for days, clinging to debris.","translation":"生存者たちは瓦礫にしがみつき、何日も船を失った状態で漂流した。","type":"adverb","meaning_category":"Without a ship"},{"sentence":"They explored the coastline shiplessly, relying on small rafts.","translation":"彼らは小さな筏を頼りに、船を使わずに海岸線を探索した。","type":"adverb","meaning_category":"Without using a ship"}]}