{"word":"cannular","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Relating to or resembling a cannula or small tube.","english_definition":"Relating to or resembling a cannula or small tube.","examples":[{"sentence":"The cannular structure of the plant's vascular system allows for efficient transport of nutrients.","translation":"その植物の維管束系の管状構造は、栄養素の効率的な輸送を可能にする。"},{"sentence":"The device features a cannular design for minimally invasive insertion.","translation":"その装置は、低侵襲挿入のための管状設計を特徴とする。"}],"collocations":["cannular structure","cannular design","cannular shape"],"synonyms":["tubular","cylindrical","hollow","channelled"],"antonyms":["solid","filled"],"notes":"Often used in scientific or technical contexts to describe shapes or structures."}],"etymology":{"value":"Derived from 'cannula,' a small tube for insertion into a body cavity, duct, or vessel, with the suffix '-ar' indicating relationship or resemblance.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkænjʊlər/","syllables":"can-nu-lar"},"inflection":{"notes":"Adjectives do not inflect in English, but can form comparative and superlative degrees (more cannular, most cannular)."},"usage_notes":{"explanation":"'Cannular' is a relatively uncommon adjective, primarily used in technical or scientific fields to describe something that has the form or function of a cannula (a small tube). It is most often encountered in medical, biological, or engineering contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cannular was used to inject the medicine.","correct":"✓ The cannula was used to inject the medicine.","note":"'Cannular' is an adjective; 'cannula' is the noun (the tube itself)."},{"incorrect":"✗ The device had a canular shape.","correct":"✓ The device had a cannular shape.","note":"Correct spelling is crucial in technical contexts."}],"priority":"★★☆"},"related_words":{"derivatives":["cannula (noun: a small tube for insertion into a body cavity, duct, or vessel)","cannulation (noun: the insertion of a cannula)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Primarily found in specialized texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cannular' is a technical adjective used to describe something resembling a cannula, which is a small tube inserted into the body. It is most commonly found in medical, scientific, or engineering texts. Understanding requires familiarity with technical vocabulary."},"example_sentences":[{"sentence":"The **cannular** probe allowed for precise measurement of the fluid's properties.","translation":"その管状プローブは、流体の特性の正確な測定を可能にした。","type":"adjective","meaning_category":"resembling a cannula"},{"sentence":"The plant's **cannular** stems provide structural support and facilitate nutrient transport.","translation":"その植物の管状の茎は、構造的な支持を提供し、栄養素の輸送を促進する。","type":"adjective","meaning_category":"resembling a tube"}]}