{"word":"gray-grown","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"白髪が生え始めた、白髪交じりの","english_definition":"Having hair that is starting to turn gray.","examples":[{"sentence":"He was a handsome man with a gray-grown beard.","translation":"彼は白髪交じりの髭を生やしたハンサムな男だった。"},{"sentence":"She noticed the gray-grown roots of her hair in the mirror.","translation":"彼女は鏡の中で、白髪が生え始めた髪の根元に気づいた。"}],"collocations":["gray-grown hair (白髪交じりの髪)","gray-grown beard (白髪交じりの髭)","gray-grown roots (白髪が生え始めた根元)"],"synonyms":["graying","grizzled","silvered"],"antonyms":["dark-haired","youthful"],"notes":"Typically used to describe hair that is in the process of turning gray, rather than being completely gray."}],"etymology":{"value":"A compound word formed by combining 'gray' (referring to the color of gray hair) and 'grown' (past participle of 'grow', indicating that the hair has grown to have gray color).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡreɪˌɡroʊn/","syllables":"gray-grown"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'gray-grown' is a descriptive adjective used to indicate that someone's hair is beginning to show signs of graying. It suggests an early stage of the aging process as reflected in hair color. The term is less common than 'graying' or 'grizzled' but provides a more specific image.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a gray-grown.","correct":"✓ He has gray-grown hair.","note":"'gray-grown' is an adjective and needs to modify a noun, such as 'hair' or 'beard'."}],"priority":"★★☆"},"related_words":{"derivatives":["gray (noun, adjective)","grow (verb)","grown (past participle)","graying (adjective, gerund)","grizzled (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (not a common term)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'gray-grown' is a compound adjective that describes hair that is starting to turn gray. It combines the color 'gray' with 'grown', indicating that the grayness is a result of the hair growing out. This term is not as common as 'graying' or 'grizzled' but is relatively straightforward to understand if you know the meanings of its component words. It is typically used in descriptive contexts to provide a visual detail about a person's appearance."},"example_sentences":[{"sentence":"The actor's temples were framed by gray-grown hair, adding to his distinguished appearance.","translation":"その俳優のこめかみは白髪交じりの髪で縁取られ、彼の際立った容姿をさらに引き立てていた。","type":"descriptive","meaning_category":"appearance"},{"sentence":"Despite his youthful energy, the gray-grown stubble on his chin hinted at the passage of time.","translation":"彼の若々しいエネルギーにもかかわらず、顎の白髪交じりの無精ひげは時の流れを暗示していた。","type":"descriptive","meaning_category":"appearance"}]}