{"word":"tanier","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(カリブ海地域で一般的な)タロイモに似た根菜","english_definition":"A tropical plant (Xanthosoma sagittifolium) cultivated for its edible starchy corms, similar to taro.","examples":[{"sentence":"Tanier is a staple food in many Caribbean countries.","translation":"タニアは多くのカリブ海の国々で主食です。"},{"sentence":"The farmer grows tanier and other root vegetables.","translation":"その農家はタニアや他の根菜を栽培しています。"}],"collocations":["grow tanier","cook tanier","eat tanier","tanier corms","tanier leaves"],"synonyms":["yautia","tannia","cocoyam","taro"],"antonyms":[]}],"etymology":{"value":"Likely derived from a Carib language.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtæniər/","syllables":"tan-ier"},"inflection":{"noun_plural":"taniers"},"usage_notes":{"explanation":"Tanier is a starchy root vegetable popular in the Caribbean and parts of Latin America. It is often used in soups, stews, and as a side dish. It is similar to taro but has a slightly different flavor and texture.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a taro, but it was tanier.","correct":"✓ I bought what I thought was taro, but it was actually tanier.","note":"Taro and tanier are similar but distinct root vegetables. Make sure to correctly identify them."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tanier' refers to a specific type of root vegetable, primarily found and used in Caribbean and Latin American cuisine. It is less common in other parts of the world, so its usage is limited to contexts where Caribbean or Latin American food or agriculture is being discussed. The word is not commonly used in everyday English.","priority":"★★☆"},"example_sentences":[{"sentence":"She prepared a traditional Caribbean stew with tanier and other vegetables.","translation":"彼女はタニアと他の野菜を使った伝統的なカリブ海のシチューを作った。","type":"noun","meaning_category":"root vegetable"},{"sentence":"The market had a wide selection of root crops, including tanier and yams.","translation":"市場にはタニアやヤム芋など、さまざまな根菜が豊富に揃っていた。","type":"noun","meaning_category":"root vegetable"}]}