{"word":"Euphrasia","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"メグサハーブ（目薬草）：ヨーロッパ原産の、伝統的に目の炎症やアレルギー症状の治療に使用される植物。","english_definition":"A genus of herbaceous flowering plants in the family Orobanchaceae (formerly Scrophulariaceae), native to Europe, traditionally used to treat eye inflammations and allergies. Also known as eyebright.","examples":[{"sentence":"Euphrasia is often used in herbal remedies for conjunctivitis.","translation":"メグサハーブは、結膜炎のハーブ療法によく用いられます。"},{"sentence":"Some people use Euphrasia eye drops to relieve itchy eyes.","translation":"目の痒みを和らげるために、メグサハーブの点眼薬を使用する人もいます。"}],"collocations":["Euphrasia officinalis (一般的なメグサハーブの種)","Euphrasia extract (メグサハーブ抽出物)","Euphrasia eye drops (メグサハーブ点眼薬)","herbal remedies with Euphrasia (メグサハーブを含むハーブ療法)"],"synonyms":["Eyebright"],"antonyms":[]},{"part_of_speech":"noun","definition":"メグサハーブ属：ハマウツボ科（以前はゴマノハグサ科）の草本顕花植物の属名。","english_definition":"The genus of herbaceous flowering plants in the family Orobanchaceae (formerly Scrophulariaceae).","examples":[{"sentence":"The genus Euphrasia contains many species with similar medicinal properties.","translation":"メグサハーブ属には、同様の薬効を持つ多くの種が含まれています。"}],"collocations":["genus Euphrasia","species of Euphrasia"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"ギリシャ語の「euphrasia」（喜び、快活さ）に由来。これは、この植物が視力を改善すると信じられていたことにちなんでいます。","priority":"★★★"},"pronunciation":{"ipa":"/juːˈfreɪziə/","syllables":"Eu-phra-si-a"},"inflection":{"notes":"可算名詞。複数形は Euphrasias。"},"usage_notes":{"explanation":"「**Euphrasia**」は、主にハーブ療法で使用される植物の名前です。特に目の症状の緩和に用いられることが多く、「eyebright（目の輝き）」という別名も持っています。学名としても使用され、その場合は属名として扱われます。一般的な会話では、植物そのもの、またはそれを含む製品（点眼薬など）を指すことが多いです。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used Euphrasia to cure my headache.","correct":"✓ I used Euphrasia to treat my eye irritation.","note":"Euphrasia (eyebright) is traditionally used for eye conditions, not headaches."},{"incorrect":"✗ Euphrasia are a common flower in my garden.","correct":"✓ Euphrasia is a common herb used in traditional medicine.","note":"Euphrasia is more known for its medicinal use than as a common garden flower."}],"priority":"★★☆"},"related_words":{"derivatives":["Euphrasial (形容詞: メグサハーブの、メグサハーブに関する)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Not typically included in CEFR vocabulary lists.","frequency_google_ngram":"低頻度 (Low frequency) - 特定の分野（ハーブ療法、植物学）でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Euphrasia**」は、一般的な単語ではなく、植物学やハーブ療法に関連する専門用語です。主に、目の炎症やアレルギー症状の治療に用いられる植物「メグサハーブ（目薬草）」を指します。この単語は、一般的な英語学習者には馴染みが薄いかもしれませんが、代替医療や自然療法に関心のある人にとっては重要な語彙です。また、学名としても使用され、その場合はハマウツボ科の植物の属名を指します。専門的な文脈で使用されることが多い単語であることを理解しておきましょう。"},"example_sentences":[{"sentence":"The herbalist recommended Euphrasia tea for my eye strain.","translation":"その薬草医は、私の眼精疲労にメグサハーブティーを勧めました。","type":"noun","meaning_category":"メグサハーブ"},{"sentence":"Euphrasia officinalis is the most common species used in traditional medicine.","translation":"メグサハーブ（Euphrasia officinalis）は、伝統医学で最も一般的に使用される種です。","type":"noun","meaning_category":"メグサハーブ属"}]}