{"word":"Performative","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"遂行的な、発語内行為的な","english_definition":"(of a statement) actually doing the action it describes, not just saying it.","examples":[{"sentence":"'I promise' is a performative utterance because the act of saying it constitutes the act of making a promise.","translation":"「約束します」という発言は、それを言うこと自体が約束するという行為を構成するため、遂行的な発言です。"},{"sentence":"The judge's statement 'I sentence you to five years in prison' is a performative act.","translation":"裁判官の「懲役5年の刑を宣告する」という発言は、遂行的な行為です。"}],"collocations":["performative utterance","performative verb","performative act","performative speech act"],"synonyms":["operative","effective","constitutive"],"antonyms":["constative","descriptive"]},{"part_of_speech":"noun","definition":"遂行文、発語内行為","english_definition":"a performative utterance.","examples":[{"sentence":"'I apologize' is a classic example of a performative.","translation":"「申し訳ありません」は、遂行文の典型的な例です。"},{"sentence":"Performatives are different from statements that simply describe a state of affairs.","translation":"遂行文は、単に状況を説明する文とは異なります。"}],"collocations":["explicit performative","implicit performative"],"synonyms":["speech act"],"antonyms":["constative utterance"]}],"etymology":{"value":"The term 'performative' was introduced by the philosopher J.L. Austin in his book 'How to Do Things with Words'. It is derived from the verb 'to perform', emphasizing that such utterances perform an action.","priority":"★★☆"},"pronunciation":{"ipa":"/pərˈfɔːrmətɪv/","syllables":"per-for-ma-tive"},"inflection":{"notes":"The adjective form is 'performative'. The noun form, referring to the utterance itself, is also 'performative' or 'performative utterance'."},"usage_notes":{"explanation":"The term 'performative' is central to speech act theory, which examines how language is used not just to convey information but also to perform actions. A performative utterance is one that, by being uttered, performs a specific act. For example, saying 'I bet' is not just describing a bet; it is the act of placing a bet. Performatives often involve specific verbs (e.g., promise, apologize, declare, pronounce) and require appropriate context and authority to be effective.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ His speech was very performative. (Intended meaning: impressive or theatrical)","correct":"✓ His speech was very theatrical. / ✓ His speech was very impressive.","note":"'Performative' in the technical sense should not be confused with simply 'theatrical' or 'impressive'. It has a specific meaning related to speech act theory."},{"incorrect":"✗ A performative sentence is always true.","correct":"✓ A performative sentence is neither true nor false; it is effective or ineffective.","note":"Performative utterances are not assessed for truth value. They are assessed for whether they successfully perform the intended action."}],"priority":"★★☆"},"related_words":{"derivatives":["performativity (名詞: 遂行性)"],"phrasal_verbs":[],"related_terms":["speech act","illocutionary act","locutionary act","perlocutionary act","felicity conditions"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (Specialized academic vocabulary)","frequency_google_ngram":"Low frequency (Specialized term in linguistics and philosophy)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"performative\" refers to a specific type of statement that, when uttered, performs the action it describes. This concept is primarily used in linguistics and philosophy, particularly within speech act theory. A performative utterance doesn't just convey information; it actively does something. For example, when a judge says, \"I sentence you to...\", they are not just describing a sentencing; they are actually sentencing the person. Understanding \"performative\" requires familiarity with speech act theory and the idea that language can be used to perform actions, not just to state facts."},"example_sentences":[{"sentence":"'I name this ship the Queen Mary' is a classic example of a **performative** utterance.","translation":"「私はこの船をクイーン・メリーと命名します」は、遂行的な発言の典型的な例です。","type":"adjective","meaning_category":"遂行的な"},{"sentence":"The act of saying 'I do' during a wedding ceremony is a **performative** act.","translation":"結婚式で「誓います」と言う行為は、遂行的な行為です。","type":"adjective","meaning_category":"遂行的な"},{"sentence":"Austin argued that many utterances are not simply constative but **performative**.","translation":"オースティンは、多くの発言は単に叙述的であるだけでなく、遂行的であると主張しました。","type":"adjective","meaning_category":"遂行的な"},{"sentence":"The success of a **performative** depends on the context and the authority of the speaker.","translation":"遂行文の成功は、文脈と発話者の権威に依存します。","type":"noun","meaning_category":"遂行文"}]}