{"word":"Chandlerly","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"Having qualities reminiscent of the character Chandler Bing from the TV show 'Friends'. This may include being sarcastic, witty, humorous, awkward, or having a distinctive style of joking.","english_definition":"Possessing characteristics similar to those of the character Chandler Bing from the television show 'Friends,' such as sarcasm, wit, humor, awkwardness, or a particular style of joking.","examples":[{"sentence":"His chandlerly remarks often made the team laugh, even during stressful meetings.","translation":"彼のチャンドラー的な発言は、ストレスの多い会議中でも、しばしばチームを笑わせた。"},{"sentence":"She had a chandlerly way of defusing tense situations with a well-timed joke.","translation":"彼女は、タイミングの良いジョークで緊迫した状況を和らげるチャンドラー的な方法を持っていた。"},{"sentence":"Despite his chandlerly exterior, he was a deeply caring friend.","translation":"彼のチャンドラー的な外見にもかかわらず、彼は心の底から思いやりのある友人だった。"}],"collocations":["chandlerly wit","chandlerly sarcasm","chandlerly humor","chandlerly awkwardness","chandlerly joke"],"synonyms":["sarcastic","witty","humorous","awkward","funny","jocular","droll"],"antonyms":["serious","solemn","humorless","earnest","grave"]}],"etymology":{"value":"Derived from the name 'Chandler,' referring to the character Chandler Bing from the popular TV show 'Friends,' combined with the suffix '-ly,' which transforms a noun into an adjective.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʃændlərli/","syllables":"chan-dler-ly"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. Comparative and superlative forms are possible but less common (more chandlerly, most chandlerly)."},"usage_notes":{"explanation":"The adjective 'chandlerly' is used informally to describe someone who exhibits traits associated with the character Chandler Bing from 'Friends.' These traits typically include a sarcastic sense of humor, a tendency towards awkwardness, and a distinctive style of joking. The word is generally used in a positive or humorous context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted very chandler.","correct":"✓ He acted very chandlerly.","note":"'Chandler' is a noun (a name), while 'chandlerly' is the adjective that describes someone acting like Chandler Bing."},{"incorrect":"✗ The atmosphere was chandlerly.","correct":"✓ The atmosphere was humorous/lighthearted.","note":"'Chandlerly' usually describes a person's behavior or characteristics, not a general atmosphere."}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (not a standard English word)","frequency_google_ngram":"Very low frequency - a neologism or informal term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Chandlerly' is a niche adjective, understood primarily by those familiar with the TV show 'Friends.' It describes someone who has qualities similar to the character Chandler Bing, such as sarcasm, wit, and a slightly awkward sense of humor. It's not a formal word and is used informally. To understand it, you need to know the character it references."},"example_sentences":[{"sentence":"His **chandlerly** comments always broke the tension in the room.","translation":"彼のチャンドラー的なコメントは常に部屋の緊張をほぐした。","type":"adjective","meaning_category":"humorous"},{"sentence":"She had a **chandlerly** way of delivering bad news with a joke.","translation":"彼女はジョークで悪い知らせを伝えるチャンドラー的な方法を持っていた。","type":"adjective","meaning_category":"witty"},{"sentence":"Despite his **chandlerly** demeanor, he was actually quite sensitive.","translation":"彼のチャンドラー的な振る舞いにもかかわらず、彼は実際にはとても繊細だった。","type":"adjective","meaning_category":"sarcastic"}]}