{"word":"supersacerdotal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Being above or superior to the priesthood.","english_definition":"Above or superior to the priesthood.","examples":[{"sentence":"The king held a supersacerdotal position in the ancient kingdom, wielding both religious and secular power.","translation":"その王は古代王国において、宗教的権力と世俗的権力の両方を振るう、聖職者よりも上位の地位を保持していた。"}],"collocations":[],"synonyms":["supreme","transcendent","preeminent"],"antonyms":["subordinate","inferior","lower"],"notes":"Often used in historical or theological contexts."}],"etymology":{"value":"From 'super-' (above) + 'sacerdotal' (relating to priests or the priesthood), ultimately from Latin 'sacerdos' (priest).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsuːpərˌsæsərˈdoʊtəl/","syllables":"su-per-sa-cer-do-tal"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"The term 'supersacerdotal' is relatively rare. It is used to describe a position, authority, or status that is higher than or beyond that of the priesthood. This often implies a combination of religious and secular power, or a spiritual authority that transcends formal religious office.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["sacerdotal","sacerdotalism"],"related_terms":["pontifical","hierarchical"]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The word 'supersacerdotal' is a highly specialized term, rarely used outside academic or theological discussions. Its meaning is relatively straightforward, combining 'super-' (above) with 'sacerdotal' (relating to priests), but its niche usage makes it uncommon. Understanding the etymology helps in grasping its meaning, but familiarity with theological concepts is beneficial for full comprehension."},"example_sentences":[{"sentence":"The emperor claimed a supersacerdotal authority, positioning himself as both ruler and high priest.","translation":"皇帝は聖職者よりも上位の権威を主張し、自身を支配者かつ大司祭として位置づけた。","type":"general","meaning_category":"authority"},{"sentence":"Some scholars argue that early monarchs held a supersacerdotal role, legitimizing their rule through divine connection.","translation":"一部の学者は、初期の君主が聖職者よりも上位の役割を担い、神とのつながりを通してその支配を正当化したと主張している。","type":"academic","meaning_category":"historical role"}]}