{"word":"Indianised","priority":"☆☆☆","meanings":[{"part_of_speech":"verb (past participle & adjective)","definition":"(過去分詞)インド化された、インドの影響を受けた。(形容詞)インド化された、インドの影響を受けた","english_definition":"(past participle) having been made or become Indian in character or culture. (adjective) having taken on Indian characteristics or culture.","examples":[{"sentence":"The cuisine has been Indianised to suit local tastes.","translation":"その料理は地元の好みに合うようにインド化されています。"},{"sentence":"The architecture shows an Indianised style.","translation":"その建築様式はインド化されたスタイルを示しています。"}],"collocations":["Indianised version","Indianised culture","Indianised food","Indianised name"],"synonyms":["Indianized","influenced by India","adapted to Indian culture","transformed by Indian culture"],"antonyms":["Westernised","Europeanised","unaffected by India","unaltered"],"notes":"The spelling \"Indianised\" is more common in British English, while \"Indianized\" is more common in American English. The term refers to the process of something becoming more Indian in character, often through cultural exchange or adaptation."}],"etymology":{"value":"Derived from the verb 'Indianise' (or 'Indianize'), which comes from the noun 'Indian' and the suffix '-ise' (or '-ize'), meaning 'to make or become Indian'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪndiəˈnaɪzd/","syllables":"In-di-a-nised"},"inflection":{"notes":"This word is the past participle and adjective form of the verb 'Indianise'/'Indianize'."},"usage_notes":{"explanation":"'Indianised' describes something that has been modified or adapted to incorporate Indian cultural elements, customs, or styles. This can apply to various aspects, such as food, language, art, music, and architecture. The term implies a transformation or modification process rather than simply being of Indian origin.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building is Indianised because it is in India.","correct":"✓ The building is Indianised because it incorporates Indian architectural elements.","note":"Being located in India does not automatically mean something is Indianised. It must show specific Indian cultural influences or adaptations."},{"incorrect":"✗ He Indianised to India.","correct":"✓ He Indianised his lifestyle.","note":"'Indianise' is used to describe the transformation of something, not a movement to India."}],"priority":"★★☆"},"related_words":{"derivatives":["Indianise (verb)","Indianization (noun)"],"related_terms":["Indian","India","culture","adaptation","assimilation"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency. More common in academic or cultural contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Indianised' (or 'Indianized') describes something that has been changed or adapted to include Indian cultural elements. It is often used in discussions about cultural exchange, adaptation, and the influence of Indian culture on other things. This word is more common in academic or cultural contexts and may not be widely used in everyday conversation."},"example_sentences":[{"sentence":"The music was Indianised by incorporating traditional instruments and melodies.","translation":"その音楽は、伝統的な楽器とメロディーを取り入れることによってインド化されました。","type":"descriptive"},{"sentence":"Many dishes in Southeast Asia have been Indianised over centuries of trade and cultural exchange.","translation":"東南アジアの多くの料理は、数世紀にわたる貿易と文化交流を通じてインド化されてきました。","type":"historical"},{"sentence":"The film presented an Indianised version of the classic story.","translation":"その映画は、古典的な物語のインド化されたバージョンを提示しました。","type":"cultural"}]}