{"word":"Jacobinizing","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"ジャコバン主義化する、ジャコバン党の原則や政策を導入する、または影響を与える","english_definition":"To imbue with or subject to Jacobin principles or policies; to influence with Jacobinism.","examples":[{"sentence":"The revolution aimed at Jacobinizing the entire country.","translation":"その革命は国全体をジャコバン主義化することを目指した。"},{"sentence":"Some historians argue that Napoleon was Jacobinizing Europe through his reforms.","translation":"一部の歴史家は、ナポレオンが改革を通じてヨーロッパをジャコバン主義化していたと主張している。"}],"collocations":["Jacobinizing influence","Jacobinizing reforms","Jacobinizing the government"],"synonyms":["radicalizing","revolutionizing","politicizing","reforming","influencing"],"antonyms":["conservatizing","traditionalizing","depoliticizing","stabilizing"]},{"part_of_speech":"verb","transitivity":"vi","definition":"ジャコバン主義化される、ジャコバン党の原則や政策の影響を受ける","english_definition":"To become influenced by or subject to Jacobin principles or policies.","examples":[{"sentence":"The local population was Jacobinizing rapidly due to the revolutionary fervor.","translation":"革命の熱狂により、地元の住民は急速にジャコバン主義化されていた。"}],"collocations":["Jacobinizing rapidly","Jacobinizing under pressure","Jacobinizing due to influence"],"synonyms":["radicalizing","revolutionizing","becoming politicized","being reformed","being influenced"],"antonyms":["conservatizing","traditionalizing","becoming depoliticized","becoming stable"]}],"etymology":{"value":"The word is derived from 'Jacobin,' referring to members of a radical political club during the French Revolution, plus the suffix '-ize,' indicating the process of becoming or making something.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒækəbɪnaɪzɪŋ/","syllables":"Ja-co-bin-iz-ing"},"inflection":{"verb_forms":{"present_simple":["Jacobinizes"],"past_simple":"Jacobinized","past_participle":"Jacobinized","present_participle":"Jacobinizing"}},"usage_notes":{"explanation":"'Jacobinizing' refers to the process of adopting or imposing the radical, often revolutionary, principles associated with the Jacobins of the French Revolution. It often implies a significant shift towards more egalitarian, democratic, or centralized governance. The term can be used in historical contexts or to describe similar processes in other political movements.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The country was Jacobinizing with traditional values.","correct":"✓ The country was Jacobinizing, abandoning traditional values.","note":"Jacobinizing typically involves a departure from traditional values, not an adherence to them."},{"incorrect":"✗ Jacobinizing is a slow and conservative process.","correct":"✓ Jacobinizing is a rapid and radical process.","note":"Jacobinizing is generally associated with rapid and radical change, not slow and conservative approaches."}],"priority":"★★☆"},"related_words":{"derivatives":["Jacobin (noun, adjective)","Jacobinism (noun)","Jacobinize (verb)"],"phrases":["French Revolution","Reign of Terror","radical politics","revolutionary fervor"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized historical and political term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Jacobinizing' is a specialized term primarily used in historical and political contexts to describe the process of adopting or implementing radical, revolutionary principles, particularly those associated with the Jacobins of the French Revolution. It implies a significant and often abrupt shift towards more egalitarian, democratic, or centralized governance. Due to its specific historical and political connotations, it is considered an advanced vocabulary term. Understanding the historical context of the Jacobins and their role in the French Revolution is essential for comprehending the meaning and usage of this word."},"example_sentences":[{"sentence":"The new government was accused of Jacobinizing the legal system.","translation":"新政府は法制度をジャコバン主義化していると非難された。","type":"verb","meaning_category":"Imposing Jacobin principles"},{"sentence":"The political climate was Jacobinizing, with calls for radical reform.","translation":"政治情勢はジャコバン主義化しており、根本的な改革を求める声が高まっていた。","type":"verb","meaning_category":"Becoming influenced by Jacobin principles"}]}