{"word":"executions","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)死刑執行、処刑","english_definition":"The carrying out of a sentence of death on a condemned person.","examples":[{"sentence":"The executions were carried out at dawn.","translation":"死刑執行は夜明けに行われた。"},{"sentence":"There have been no executions in this state for ten years.","translation":"この州では10年間、死刑執行が行われていない。"},{"sentence":"He witnessed several executions during his time as a prison guard.","translation":"彼は刑務官時代にいくつかの死刑執行を目撃した。"}],"collocations":["carry out executions (死刑を執行する)","halt executions (死刑執行を停止する)","oppose executions (死刑執行に反対する)","a wave of executions (死刑執行の波)","public executions (公開処刑)"],"synonyms":["capital punishment","death penalty","judicial killing","execution"],"antonyms":["reprieve","amnesty","pardon"]},{"part_of_speech":"noun","definition":"(複数形)実行、遂行、遂行力","english_definition":"The carrying out or putting into effect of a plan, order, or course of action.","examples":[{"sentence":"The success of the project depends on its flawless execution.","translation":"プロジェクトの成功はその完璧な実行にかかっている。"},{"sentence":"The plan was brilliant, but the execution was poor.","translation":"計画は素晴らしかったが、実行は拙かった。"},{"sentence":"Good ideas are worthless without effective execution.","translation":"良いアイデアも効果的な実行がなければ価値がない。"}],"collocations":["flawless execution (完璧な実行)","effective execution (効果的な実行)","poor execution (拙い実行)","successful execution (成功した実行)","plan execution (計画の実行)","strategy execution (戦略の実行)"],"synonyms":["implementation","performance","accomplishment","achievement","enforcement","fulfillment"],"antonyms":["failure","neglect","abandonment"]},{"part_of_speech":"noun","definition":"(複数形)（芸術作品などの）技巧、表現力、出来栄え","english_definition":"The style or skill with which something is made or done.","examples":[{"sentence":"The painting is technically brilliant, but the execution lacks emotion.","translation":"その絵は技術的には素晴らしいが、表現力に感情が欠けている。"},{"sentence":"The musical piece was impressive in its execution.","translation":"その楽曲は出来栄えにおいて印象的だった。"},{"sentence":"The actor's execution of the role was masterful.","translation":"その俳優の役の表現力は名人芸だった。"}],"collocations":["artistic execution (芸術的な技巧)","technical execution (技術的な技巧)","musical execution (音楽的な表現力)","flawless execution (完璧な出来栄え)"],"synonyms":["performance","technique","skill","craftsmanship","style","interpretation"],"antonyms":["incompetence","clumsiness"]}],"etymology":{"value":"The word \"executions\" is derived from the Latin word \"exsequi,\" meaning \"to follow out, carry out, perform, execute.\" It is the plural form of \"execution,\" which has been used in English since the 14th century.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛksɪˈkjuːʃənz/","syllables":"ex-e-cu-tions"},"inflection":{"noun_plural":"executions"},"usage_notes":{"explanation":"The word \"executions\" is the plural form of \"execution,\" and its meaning depends on the context. It can refer to multiple instances of carrying out a death sentence, the implementation of plans or actions, or the style and skill with which something is performed or created. It's important to consider the surrounding words and sentences to determine the intended meaning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The execution of the project were successful.","correct":"✓ The execution of the project was successful.","note":"When referring to the implementation of a single project, use the singular form \"execution\" with a singular verb. \"Executions\" (plural) would be used if referring to multiple projects or instances of execution."},{"incorrect":"✗ He was against the execution of the law.","correct":"✓ He was against the enforcement of the law.","note":"When referring to the implementation of a law, \"enforcement\" is often a more appropriate term than \"execution.\""}],"priority":"★★☆"},"related_words":{"derivatives":["execute (verb): to carry out, perform, or put to death","executable (adjective): capable of being executed or performed","executor (noun): a person who carries out the terms of a will"],"phrases":["death penalty","capital punishment","carrying out a sentence","implementation","performance","artistic expression"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively frequent, especially in legal, political, and business contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"executions\" has multiple meanings that depend on the context. In a legal or historical context, it refers to the carrying out of a death sentence. In a business or project management context, it refers to the implementation of a plan or strategy. In an artistic context, it refers to the skill and style with which a work is created. Understanding the context is crucial to interpreting the intended meaning. The word is relatively formal and is more common in written than spoken English.","priority":"★☆☆"},"example_sentences":[{"sentence":"The government announced a stay of **executions**.","translation":"政府は死刑執行の停止を発表した。","type":"noun (plural)","meaning_category":"死刑執行"},{"sentence":"The company's success hinged on the effective **executions** of its marketing strategies.","translation":"会社の成功は、マーケティング戦略の効果的な実行にかかっていた。","type":"noun (plural)","meaning_category":"実行"},{"sentence":"The pianist's **executions** of the Chopin nocturnes were breathtaking.","translation":"そのピアニストのショパンのノクターンの演奏は息をのむほど素晴らしかった。","type":"noun (plural)","meaning_category":"技巧"}]}