{"word":"Simonies","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"聖職売買、聖職の不正授与","english_definition":"The buying or selling of ecclesiastical privileges, for example pardons, benefices, or offices.","examples":[{"sentence":"The church condemned simonies as a grave sin.","translation":"教会は聖職売買を重大な罪として非難した。"},{"sentence":"Simonies were rampant during the medieval period.","translation":"中世の時代には、聖職売買が横行していた。"}],"collocations":["commit simony","practice simony","condemn simony"],"synonyms":["corruption","bribery","graft"],"antonyms":["integrity","honesty"]}],"etymology":{"value":"Derived from Simon Magus, who, according to the Acts of the Apostles (8:9-24), offered the apostles Peter and John money in exchange for being granted the power to impart the gifts of the Holy Spirit.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsaɪməniːz/","syllables":"Si-mo-nies"},"inflection":{"noun_plural":"N/A (uncountable noun)"},"usage_notes":{"explanation":"'Simony' refers to the act of buying or selling spiritual things, especially church offices and roles. It is considered a form of corruption within religious institutions. The term originates from the biblical figure Simon Magus, who attempted to purchase spiritual powers from the apostles.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was accused of simony, but he claimed he was just donating to the church.","correct":"✓ He was accused of simony, but he claimed he was just making a donation to the church.","note":"The act of 'donating' is different from 'buying' a position. Simony implies a direct exchange of money for spiritual benefits, not simply charitable giving."}],"priority":"★★☆"},"related_words":{"derivatives":["simoniacal (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in historical or theological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Simony' is a specialized term primarily encountered in historical or religious contexts, referring to the corrupt practice of buying or selling ecclesiastical privileges. Understanding this term requires familiarity with church history and theological concepts. It is not commonly used in everyday language.","priority":"★☆☆"},"example_sentences":[{"sentence":"The investigation revealed widespread simonies within the diocese.","translation":"その調査によって、教区内で広範囲にわたる聖職売買が明らかになった。","type":"noun","meaning_category":"聖職売買"},{"sentence":"The practice of simonies undermined the moral authority of the church.","translation":"聖職売買の慣行は、教会の道徳的権威を損なった。","type":"noun","meaning_category":"聖職売買"}]}