{"word":"dependence-maintaining","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"依存性を維持する、依存症を維持する","english_definition":"Serving to maintain or perpetuate a state of dependence, especially in the context of addiction or reliance on external support.","examples":[{"sentence":"The social welfare system, while intended to help, can sometimes create dependence-maintaining conditions.","translation":"社会福祉制度は、支援を目的としている一方で、依存性を維持する状況を生み出すことがある。"},{"sentence":"Some argue that certain therapeutic approaches can inadvertently become dependence-maintaining if they foster over-reliance on the therapist.","translation":"セラピストへの過度の依存を助長する場合、特定の治療アプローチは意図せずに依存症を維持する可能性があると主張する人もいる。"},{"sentence":"The availability of easy credit can lead to dependence-maintaining financial habits.","translation":"安易な信用供与は、依存性を維持する経済的習慣につながる可能性がある。"}],"collocations":["dependence-maintaining behavior","dependence-maintaining factors","dependence-maintaining system","dependence-maintaining relationship"],"synonyms":["dependency-sustaining","addiction-perpetuating","reliance-fostering"],"antonyms":["independence-promoting","autonomy-enhancing","self-sufficiency-building"]}],"etymology":{"value":"The word is formed by combining 'dependence' (the state of relying on someone or something), 'maintaining' (keeping something in its current state), and '-ing' (forming an adjective).","priority":"N/A"},"pronunciation":{"ipa":"/dɪˈpɛndəns meɪnˈteɪnɪŋ/","syllables":"de-pen-dence main-tain-ing"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb. Comparative and superlative forms would be 'more dependence-maintaining' and 'most dependence-maintaining', respectively."},"usage_notes":{"explanation":"'Dependence-maintaining' is often used in discussions of social policy, healthcare, and psychology. It describes systems, behaviors, or relationships that, perhaps unintentionally, prevent individuals from becoming self-sufficient or overcoming addiction. It carries a somewhat negative connotation, suggesting that the thing being described is not conducive to long-term well-being or recovery.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The program was dependence-maintained.","correct":"✓ The program was dependence-maintaining.","note":"The correct term is 'dependence-maintaining', not 'dependence-maintained'. The -ing form indicates an ongoing process or quality."}],"priority":"N/A"},"related_words":{"derivatives":["dependence","maintain","maintaining"],"phrasal_verbs":[],"related_adjectives":["dependent","independent"],"related_nouns":["dependency","maintenance"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - specialized vocabulary.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Dependence-maintaining' is a complex term generally used in academic or professional contexts, particularly in fields like social work, psychology, or economics. It describes something that actively sustains a state of reliance or addiction. Understanding this term requires familiarity with the concept of dependence and the implications of maintaining such a state. It's not typically used in everyday conversation."},"example_sentences":[{"sentence":"The study investigated the dependence-maintaining effects of long-term opioid use.","translation":"その研究では、長期的なオピオイド使用の依存性を維持する効果を調査した。","type":"adjective","meaning_category":"addiction"},{"sentence":"Critics argue that certain government policies can be dependence-maintaining for marginalized communities.","translation":"批判家たちは、特定の政府政策が社会的に疎外されたコミュニティにとって依存性を維持する可能性があると主張する。","type":"adjective","meaning_category":"social policy"},{"sentence":"The therapist identified several dependence-maintaining patterns in the client's relationships.","translation":"セラピストは、クライアントの関係におけるいくつかの依存性を維持するパターンを特定した。","type":"adjective","meaning_category":"psychology"}]}