{"word":"ferocious-eyed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"having a fierce or savage expression in the eyes","english_definition":"Having eyes that express extreme fierceness, savagery, or cruelty.","examples":[{"sentence":"The ferocious-eyed dog snarled at the mailman.","translation":"その獰猛な目をした犬は郵便配達員に唸り声をあげた。"},{"sentence":"The warrior was described as ferocious-eyed, striking fear into his enemies.","translation":"その戦士は獰猛な目をしていると描写され、敵に恐怖を与えた。"}],"collocations":["ferocious-eyed gaze","ferocious-eyed stare","ferocious-eyed look"],"synonyms":["fierce-eyed","savage-eyed","wild-eyed","menacing-eyed","threatening-eyed"],"antonyms":["gentle-eyed","kind-eyed","mild-eyed","peaceful-eyed","calm-eyed"]}],"etymology":{"value":"Combination of 'ferocious' (wild, savage) and 'eyed' (having eyes of a specified kind).","priority":"N/A"},"pronunciation":{"ipa":"/fəˈroʊʃəs aɪd/","syllables":"fuh-ROH-shuhs-EYED"},"inflection":{"adjective_forms":{"comparative":"more ferocious-eyed","superlative":"most ferocious-eyed"}},"usage_notes":{"explanation":"'Ferocious-eyed' is typically used to describe a person or animal whose eyes convey a sense of intense aggression, anger, or threat. It is often used in descriptive writing to create a vivid image of the subject's demeanor.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The ferocious-eyed dog was friendly.","correct":"✓ The seemingly ferocious-eyed dog was actually friendly.","note":"Using 'ferocious-eyed' to describe a friendly dog is contradictory. If the dog is friendly, it might be better to say it *seemed* ferocious-eyed, but was actually friendly."}],"priority":"N/A"},"related_words":{"derivatives":["ferociously","ferocity"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Rare","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The word 'ferocious-eyed' is a compound adjective that combines the adjective 'ferocious' (meaning extremely fierce or violent) with the suffix '-eyed' (indicating having eyes of a particular kind). It is used to describe someone or something whose eyes convey a sense of extreme fierceness or savagery. Due to its descriptive and somewhat literary nature, it is less common in everyday conversation and more likely to appear in written contexts, particularly those involving vivid descriptions of characters or animals. Understanding the meaning of 'ferocious' is key to understanding this compound adjective."},"example_sentences":[{"sentence":"The pirate captain, ferocious-eyed and scarred, surveyed his crew.","translation":"その海賊の船長は、獰猛な目をし、傷だらけで、乗組員を見渡した。","type":"adjective","meaning_category":"descriptive"},{"sentence":"Even the children were intimidated by the ferocious-eyed guard.","translation":"子供たちでさえ、その獰猛な目をした警備員に脅えていた。","type":"adjective","meaning_category":"descriptive"}]}