{"word":"laminability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"積層性、ラミネート加工性、薄層にできる性質","english_definition":"The ability to be laminated; the property of a material that allows it to be formed into thin layers or to adhere well to other layers when laminated.","examples":[{"sentence":"The laminability of this plastic film makes it ideal for packaging.","translation":"このプラスチックフィルムの積層性により、包装に最適です。"},{"sentence":"Testing the laminability of different adhesives is crucial for manufacturing durable composites.","translation":"耐久性のある複合材を製造するには、さまざまな接着剤のラミネート加工性をテストすることが重要です。"}],"collocations":["good laminability","poor laminability","high laminability","improve laminability","test laminability","ensure laminability"],"synonyms":["layerability","stratifiability","film-forming ability","coatability","adhesiveness"],"antonyms":["non-laminability","non-adhesive"],"notes":"Often used in materials science, manufacturing, and packaging industries."}],"etymology":{"value":"Derived from \"laminate\" (verb or noun) + \"-ability\" (suffix indicating capability or quality). \"Laminate\" comes from Latin \"lamina\" meaning \"thin plate or layer.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌlæmɪnəˈbɪləti/","syllables":"lam-i-na-bil-i-ty"},"inflection":{"noun_plural":"laminabilities"},"usage_notes":{"explanation":"\"Laminability\" refers to how easily a material can be made into thin layers or how well it adheres to other materials during lamination. It's an important property in industries that use laminated materials, such as packaging, electronics, and construction.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The laminability is very good on this material.","correct":"✓ The laminability of this material is very good.","note":"It's more precise to specify 'the laminability of this material' rather than using 'the laminability' in isolation."},{"incorrect":"✗ Laminability is when you laminate something.","correct":"✓ Laminability is the property of being able to be laminated.","note":"Laminability is a property, not the act of laminating."}],"priority":"★☆☆"},"related_words":{"derivatives":["laminate","laminated","laminating","laminator"],"related_terms":["lamination","adhesive","composite material","film","layer"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency. Primarily used in technical and industrial contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Laminability\" is a technical term used to describe how well a material can be made into thin layers or how well it sticks to other materials when laminated. It's a concept mainly discussed in fields like materials science or manufacturing. You'll often find it in technical documents or research papers related to these areas."},"example_sentences":[{"sentence":"The polymer's excellent laminability ensures strong adhesion in multi-layer structures.","translation":"そのポリマーの優れた積層性により、多層構造における強力な接着が保証されます。","type":"technical","meaning_category":"material property"},{"sentence":"Factors affecting the laminability of paperboard were investigated to optimize packaging processes.","translation":"包装プロセスを最適化するために、板紙のラミネート加工性に影響を与える要因が調査されました。","type":"industrial","meaning_category":"manufacturing"},{"sentence":"The enhanced laminability of the new coating allows for thinner and more flexible electronic devices.","translation":"新しいコーティングの強化された積層性により、より薄く、より柔軟な電子デバイスが可能になります。","type":"engineering","meaning_category":"application"}]}