{"word":"Acrochordon","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"軟線維腫、スキンタッグ","english_definition":"A small benign skin growth, often on a stalk, that is the same color as the skin.","examples":[{"sentence":"Acrochordons are common in areas where skin rubs against skin, such as the neck, armpits, and groin.","translation":"軟線維腫は、首、脇の下、鼠径部など、皮膚が擦れ合う部位によく見られます。"},{"sentence":"The doctor removed the acrochordon with a simple surgical procedure.","translation":"医師は簡単な外科的処置で軟線維腫を除去しました。"}],"collocations":["remove an acrochordon","develop acrochordons","skin-colored acrochordon","pedunculated acrochordon"],"synonyms":["skin tag","fibroepithelial polyp","soft fibroma"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'akros' (ἄκρος) meaning 'highest, topmost' and 'chorde' (χορδή) meaning 'string, cord'. The term refers to the skin growth hanging like a cord.","priority":"★★★"},"pronunciation":{"ipa":"/ˌækroʊˈkɔːrdən/","syllables":"a-cro-chor-don"},"inflection":{"noun_plural":"acrochorda or acrochordons"},"usage_notes":{"explanation":"Acrochordons, commonly known as skin tags, are harmless skin growths that are very common, especially in older adults and people with certain medical conditions. They typically don't cause any symptoms unless they become irritated from rubbing against clothing or jewelry.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a acrochordon on my neck.","correct":"✓ I have an acrochordon on my neck.","note":"'Acrochordon' starts with a vowel sound, so use 'an' instead of 'a' as the indefinite article."},{"incorrect":"✗ Acrochordon are painful.","correct":"✓ Acrochordon is usually painless.","note":"Acrochordons are generally painless unless irritated. The sentence should reflect this."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_medical_terms":["benign tumor","dermatology","excision","ligation","cryotherapy","electrocautery"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized medical vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Acrochordon' is a medical term referring to a skin tag, a common, small, benign skin growth. It's more frequently used in medical contexts or discussions about dermatology. While the condition itself is common, the specific term 'acrochordon' is less commonly used in everyday conversation. Understanding this term is more relevant for those in healthcare or those researching specific skin conditions.","translation":"「Acrochordon」は、一般的な良性の小さな皮膚の成長であるスキンタッグを指す医学用語です。医学的な文脈や皮膚科学に関する議論でより頻繁に使用されます。状態自体は一般的ですが、特定の用語「acrochordon」は日常会話ではあまり使用されません。この用語の理解は、ヘルスケアに従事している人や、特定の皮膚の状態を研究している人にとってより適切です。"},"example_sentences":[{"sentence":"The dermatologist diagnosed the skin growth as an acrochordon.","translation":"皮膚科医はその皮膚の成長を軟線維腫と診断しました。","type":"noun","meaning_category":"medical diagnosis"},{"sentence":"Many people choose to have acrochordons removed for cosmetic reasons.","translation":"多くの人が美容上の理由で軟線維腫の除去を選択します。","type":"noun","meaning_category":"cosmetic procedure"},{"sentence":"Acrochordons are typically asymptomatic and do not require treatment unless they become irritated.","translation":"軟線維腫は通常無症状であり、炎症を起こさない限り治療を必要としません。","type":"noun","meaning_category":"medical condition"}]}