{"word":"diphthong","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"二重母音","english_definition":"A sound formed by the combination of two vowels in a single syllable, in which the sound begins as one vowel and moves towards another (as in coin, loud, and side).","examples":[{"sentence":"The word 'boy' contains a diphthong.","translation":"「boy」という単語には二重母音が含まれています。"},{"sentence":"Many English words contain diphthongs.","translation":"多くの英単語は二重母音を含んでいます。"},{"sentence":"The pronunciation of diphthongs can vary between dialects.","translation":"二重母音の発音は方言によって異なる場合があります。"}],"collocations":["falling diphthong (下降二重母音)","rising diphthong (上昇二重母音)","centering diphthong (中央化二重母音)","narrow diphthong (狭二重母音)","wide diphthong (広二重母音)"],"synonyms":["glide vowel","complex vowel"],"antonyms":["monophthong (単母音)"]}],"etymology":{"value":"From Ancient Greek 'δίφθογγος' (díphthongos) meaning 'having two sounds,' from 'δι-' (di-) 'two' + 'φθόγγος' (phthóngos) 'sound, voice'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdɪfθɒŋ/","syllables":"dif-thong"},"inflection":{"noun_plural":"diphthongs"},"usage_notes":{"explanation":"A diphthong is a vowel sound that starts near the articulatory position for one vowel and moves toward the position for another. It is perceived as a single phoneme. Diphthongs are contrasted with monophthongs, which are single vowel sounds. In English, common examples of diphthongs can be found in words like 'eye', 'out', and 'oil'. The exact phonetic realization of diphthongs can vary depending on the speaker's dialect.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Diphthongs are single vowel sounds.","correct":"✓ Diphthongs are combinations of two vowel sounds.","note":"Diphthongs, by definition, involve two vowel sounds within a single syllable, unlike monophthongs which are single vowel sounds."},{"incorrect":"✗ The word 'cat' has a diphthong.","correct":"✓ The word 'cat' has a monophthong.","note":"The vowel sound in 'cat' is a single, stable vowel sound, making it a monophthong, not a diphthong."}],"priority":"★★☆"},"related_words":{"derivatives":["diphthongal (adjective: relating to or containing a diphthong)"],"phrases":["falling diphthong (a diphthong where the prominence is on the first vowel)","rising diphthong (a diphthong where the prominence is on the second vowel)"],"priority":"★★☆"},"level_frequency":{"level":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in linguistic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A 'diphthong' is a technical term in phonetics, referring to a vowel sound that involves a glide from one vowel quality to another within the same syllable. It's a concept typically encountered in advanced language studies or linguistics. Understanding diphthongs is important for precise pronunciation and phonological analysis.","priority":"★★☆"},"example_sentences":[{"sentence":"The word 'house' in many dialects contains the diphthong /aʊ/.","translation":"多くの方言において、「house」という単語には二重母音 /aʊ/ が含まれています。","type":"example","meaning_category":"Definition"},{"sentence":"Phonetic transcription helps in identifying and representing diphthongs accurately.","translation":"音声記号は、二重母音を正確に識別し、表現するのに役立ちます。","type":"example","meaning_category":"Usage"},{"sentence":"Some languages have a greater number of diphthongs than others.","translation":"言語によっては、他の言語よりも多くの二重母音を持つものがあります。","type":"example","meaning_category":"Comparative linguistics"}]}