{"word":"amphikaryon","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(生物学) 核膜を持つ細胞、真核細胞","english_definition":"(biology) A cell with a membrane-bound nucleus; a eukaryotic cell.","examples":[{"sentence":"Eukaryotes, also known as amphikarya, are organisms whose cells have a nucleus enclosed within a nuclear envelope.","translation":"真核生物は、アンフィカリオンとしても知られ、細胞内に核膜で囲まれた核を持つ生物です。"}],"collocations":["amphikaryotic cell","eukaryotic organism"],"synonyms":["eukaryote","eukaryotic cell"],"antonyms":["prokaryote","prokaryotic cell"]}],"etymology":{"value":"Derived from the Greek words 'amphi' (meaning 'both' or 'double') and 'karyon' (meaning 'nut' or 'kernel', referring to the nucleus).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæmfɪˈkæriˌɒn/","syllables":"am-phi-kar-y-on"},"inflection":{"noun_plural":"amphikarya"},"usage_notes":{"explanation":"The term 'amphikaryon' is a somewhat less common synonym for 'eukaryote'. It emphasizes the presence of a true, membrane-bound nucleus, distinguishing it from prokaryotic cells which lack a nucleus. While 'eukaryote' is the more widely accepted and used term in modern biology, 'amphikaryon' may be encountered in older literature or in specific contexts emphasizing the nuclear structure.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Amphikaryons are cells without a nucleus.","correct":"✓ Amphikaryons are cells with a nucleus.","note":"Amphikaryons, by definition, possess a nucleus. This is the defining characteristic that distinguishes them from prokaryotes."}],"priority":"★☆☆"},"related_words":{"derivatives":["amphikaryotic (adjective)"],"related_terms":["eukaryotic","prokaryote","nucleus","cell membrane"]},"level_frequency":{"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語 (specialized term).","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Amphikaryon' is a technical term in biology, specifically referring to eukaryotic cells. It's not commonly used outside of scientific contexts. Understanding this term requires familiarity with basic cell biology concepts, such as the structure and function of the nucleus and the distinction between prokaryotic and eukaryotic cells. The term emphasizes the presence of a well-defined nucleus enclosed by a membrane.","priority":"★☆☆"},"example_sentences":[{"sentence":"The presence of an amphikaryon is a defining characteristic of eukaryotic organisms.","translation":"アンフィカリオンの存在は、真核生物を特徴づけるものです。","type":"scientific","meaning_category":"definition"},{"sentence":"Unlike prokaryotes, amphikarya contain complex organelles within their cytoplasm.","translation":"原核生物とは異なり、アンフィカリオンは細胞質内に複雑なオルガネラを含んでいます。","type":"scientific","meaning_category":"comparison"}]}