{"word":"antibalm","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"Something that exacerbates or worsens a situation, rather than providing relief or comfort.","english_definition":"Something that has the opposite effect of a balm; something that worsens or irritates a situation instead of soothing or relieving it.","examples":[{"sentence":"His insensitive comments were more of an antibalm than a comfort to her grief.","translation":"彼の無神経なコメントは、彼女の悲しみを慰めるどころか、悪化させるものだった。"},{"sentence":"The new policy proved to be an antibalm, creating more problems than it solved.","translation":"新しい政策は、解決策になるどころか、問題を増やす結果となった。"}],"collocations":["act as an antibalm","prove to be an antibalm","an antibalm to the situation"],"synonyms":["irritant","aggravator","exacerbator","provocation","source of discomfort"],"antonyms":["balm","soother","comfort","relief","remedy"]},{"part_of_speech":"noun","definition":"A substance or action that causes irritation or pain.","english_definition":"A substance or action that causes irritation or pain, rather than soothing or healing.","examples":[{"sentence":"The harsh words were an antibalm to his wounded pride.","translation":"その辛辣な言葉は、彼の傷ついた自尊心をさらに傷つけた。"},{"sentence":"Applying alcohol to the wound was an antibalm, causing more pain than relief.","translation":"傷口にアルコールを塗るのは、痛みを和らげるどころか、さらに痛みを増す行為だった。"}],"collocations":["apply as an antibalm","act as an antibalm","a source of antibalm"],"synonyms":["irritant","painful application","aggravating substance"],"antonyms":["balm","salve","ointment"]}],"etymology":{"value":"Formed by adding the prefix 'anti-' (meaning 'opposite' or 'against') to 'balm' (a soothing ointment or something that provides relief).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈæntibaːm/","syllables":"an-ti-balm"},"inflection":{"noun_plural":"antibalms"},"usage_notes":{"explanation":"'Antibalm' is used to describe something that has the opposite effect of a 'balm'. While a balm soothes and relieves, an antibalm irritates and worsens. It is often used figuratively to describe words, actions, or policies that exacerbate a negative situation or feeling.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She used antibalm on her skin to soothe it.","correct":"✓ She used balm on her skin to soothe it.","note":"'Antibalm' has the opposite effect of soothing; use 'balm' for soothing purposes."},{"incorrect":"✗ The medicine was an antibalm and cured his illness.","correct":"✓ The medicine was a balm and cured his illness.","note":"'Antibalm' worsens, rather than cures; use 'balm' or another appropriate term for something that heals."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["balm","anti-","irritant","aggravator","exacerbate"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'antibalm' is relatively uncommon and is used to describe something that has the opposite effect of a balm, which is something soothing or healing. Therefore, 'antibalm' refers to something that irritates or worsens a situation rather than providing relief. It's often used figuratively to describe actions or words that exacerbate a problem or emotional distress. Understanding the meaning of 'balm' is essential to grasp the meaning of 'antibalm'."},"example_sentences":[{"sentence":"The politician's divisive rhetoric was an antibalm to the already tense social climate.","translation":"政治家の分裂を招くレトリックは、すでに緊張状態にある社会情勢をさらに悪化させるものだった。","type":"noun","meaning_category":"exacerbation"},{"sentence":"Instead of offering support, his criticism acted as an antibalm to her confidence.","translation":"支援を提供する代わりに、彼の批判は彼女の自信をさらに傷つけるものとなった。","type":"noun","meaning_category":"irritation"}]}