{"word":"mycologist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"菌類学者、菌学者","english_definition":"a person who studies fungi; a fungal biologist.","examples":[{"sentence":"The mycologist identified the mushroom as a rare species.","translation":"その菌類学者は、そのキノコを珍しい種であると特定した。"},{"sentence":"Mycology is the branch of biology that mycologists specialize in.","translation":"菌類学は、菌類学者が専門とする生物学の分野である。"},{"sentence":"The mycologist's research contributed to the development of new antibiotics.","translation":"その菌類学者の研究は、新しい抗生物質の開発に貢献した。"}],"collocations":["expert mycologist","leading mycologist","research mycologist","amateur mycologist","consulting mycologist"],"synonyms":["fungal biologist","fungologist"],"antonyms":[],"related_terms":["mycology","fungi","mushroom","mold","yeast","spore"]}],"etymology":{"value":"The word \"mycologist\" is derived from the Greek words \"mykes\" (μύκης), meaning \"fungus,\" and \"-logia\" (-λογία), meaning \"study of.\"","priority":"★★★"},"pronunciation":{"ipa":"/maɪˈkɒlədʒɪst/","syllables":"my-col-o-gist"},"inflection":{"noun_plural":"mycologists"},"usage_notes":{"explanation":"A mycologist is a scientist who specializes in the study of fungi, which includes mushrooms, molds, yeasts, and other related organisms. Mycologists study the genetics, biochemistry, taxonomy, and ecology of fungi, as well as their uses in medicine, agriculture, and industry.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am a mycologist, so I study bacteria.","correct":"✓ I am a mycologist, so I study fungi.","note":"Mycologists study fungi, not bacteria."},{"incorrect":"✗ Mycology is the study of insects, and a mycologist studies insects.","correct":"✓ Entomology is the study of insects, and an entomologist studies insects. Mycology is the study of fungi, and a mycologist studies fungi.","note":"Mycology is the study of fungi, while entomology is the study of insects."}],"priority":"★★☆"},"related_words":{"derivatives":["mycological (adjective)","mycologically (adverb)"],"related_fields":["botany","biology","microbiology","ecology"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency. It is a specialized term.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word \"mycologist\" is a specialized term referring to a scientist who studies fungi. It is not a commonly used word in everyday conversation, but it is important in scientific and academic contexts related to biology, botany, and agriculture. Understanding this word requires a good grasp of scientific vocabulary."},"example_sentences":[{"sentence":"The **mycologist** carefully examined the spores under the microscope.","translation":"その菌類学者は顕微鏡で胞子を注意深く調べた。","type":"general","meaning_category":"study of fungi"},{"sentence":"She is a renowned **mycologist** known for her work on truffle cultivation.","translation":"彼女はトリュフ栽培の研究で知られる著名な菌類学者である。","type":"specific","meaning_category":"research on fungi"},{"sentence":"The **mycologist** warned against consuming wild mushrooms without proper identification.","translation":"その菌類学者は、適切な識別なしに野生のキノコを摂取することに対して警告した。","type":"cautionary","meaning_category":"fungi identification"}]}