{"word":"Archidome","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A large, domed structure, often used for exhibitions, sports events, or other public gatherings.","english_definition":"A large domed structure, often used for exhibitions, sports events, or other public gatherings.","examples":[{"sentence":"The Archidome hosted the international trade fair.","translation":"そのアーチドームでは国際見本市が開催された。"},{"sentence":"The city's Archidome is a landmark known for its unique architecture.","translation":"その都市のアーチドームは、そのユニークな建築で知られるランドマークである。"}],"collocations":["host an event in the Archidome","visit the Archidome","the city's Archidome"],"synonyms":["dome","arena","stadium","pavilion"],"antonyms":[]}],"etymology":{"value":"A blend of 'architecture' and 'dome', suggesting a structure that is both architecturally significant and domed.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɑːrkɪdoʊm/","syllables":"Ar-chi-dome"},"inflection":{"noun_plural":"Archidomes"},"usage_notes":{"explanation":"'Archidome' is typically used to describe a specific, large domed building, often one that is well-known or architecturally significant. It is not a generic term for any dome.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The small dome was referred to as an Archidome.","correct":"✓ The large dome was referred to as an Archidome.","note":"'Archidome' implies a large structure, so it's not appropriate for smaller domes."}],"priority":"★★☆"},"related_words":{"derivatives":["arch (noun, verb)","dome (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specific architectural term)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Archidome' is a specialized architectural term referring to a large, significant domed structure. Its usage is relatively infrequent and typically found in contexts discussing architecture, urban planning, or event venues. Understanding its meaning requires familiarity with architectural vocabulary."},"example_sentences":[{"sentence":"The Archidome's innovative design allows for natural light to flood the interior.","translation":"アーチドームの革新的なデザインは、自然光が内部に差し込むことを可能にする。","type":"noun","meaning_category":"structure"},{"sentence":"The annual technology conference is held at the Archidome.","translation":"年次技術会議はアーチドームで開催される。","type":"noun","meaning_category":"venue"}]}