{"word":"palatograph","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"口蓋図、口蓋構音図：発音時の舌と口蓋の接触を示す図、またはそれを記録する装置","english_definition":"An instrument for recording the contact between the tongue and the palate during the articulation of speech sounds; also, the diagram or record produced by such an instrument.","examples":[{"sentence":"The palatograph showed that the speaker's tongue touched the hard palate when pronouncing the /t/ sound.","translation":"口蓋図は、話者が/t/の音を発音する際に、舌が硬口蓋に接触していることを示した。"},{"sentence":"Modern palatography often uses digital techniques to create detailed maps of tongue-palate contact.","translation":"現代の口蓋構音図法は、しばしばデジタル技術を用いて、舌と口蓋の接触の詳細な地図を作成する。"}],"collocations":["static palatography","dynamic palatography","digital palatography"],"synonyms":["articulograph","glossograph"],"antonyms":[]},{"part_of_speech":"noun","definition":"(より一般的に)口蓋構音図法","english_definition":"(More generally) the technique of using a palatograph.","examples":[{"sentence":"Palatography is a valuable tool for speech therapists.","translation":"口蓋構音図法は、言語療法士にとって貴重なツールである。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From 'palato-' (relating to the palate) + '-graph' (something written or recorded).","priority":"★★☆"},"pronunciation":{"ipa":"/pəˈlætəˌɡræf/","syllables":"pa-la-to-graph"},"inflection":{"noun_plural":"palatographs"},"usage_notes":{"explanation":"A palatograph is a device used in phonetics to record the contact between the tongue and the roof of the mouth (palate) during speech. The resulting record, also called a palatograph, provides valuable information about how speech sounds are articulated. There are different types of palatography, including static (where the tongue is coated with a substance and contact is recorded after a single articulation) and dynamic (which captures tongue movement over time, often using electronic sensors). Digital palatography is now common.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor used a palatogram to examine my throat.","correct":"✓ The doctor used a laryngoscope to examine my throat.","note":"A palatograph is for recording tongue-palate contact in speech, not for general throat examinations. A laryngoscope is used for throat examinations."}],"priority":"★☆☆"},"related_words":{"derivatives":["palatography (口蓋構音図法)","palatal (口蓋の、口蓋音の)","palatalize (口蓋化する)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'palatograph' refers to a specialized instrument used in the field of phonetics to study how the tongue touches the roof of the mouth during speech. It is a technical term, and understanding it requires some knowledge of linguistics and speech science. The related term 'palatography' refers to the process or technique of using a palatograph. This word is not commonly used outside of academic or clinical settings related to speech and language.","priority":"★☆☆"},"example_sentences":[{"sentence":"The researcher used a palatograph to analyze the participant's pronunciation of sibilant sounds.","translation":"研究者は、参加者の歯擦音の発音を分析するために口蓋図を使用した。","type":"noun","meaning_category":"Instrument for recording tongue-palate contact"},{"sentence":"Digital palatography allows for real-time visualization of tongue movements during speech.","translation":"デジタル口蓋構音図法は、発話中の舌の動きをリアルタイムで視覚化することを可能にする。","type":"noun","meaning_category":"Technique of using a palatograph"}]}