{"word":"purpuric","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"紫斑性の、紫斑病の","english_definition":"Relating to or characterized by purpura (a condition characterized by purple or brownish-red spots on the skin and mucous membranes, caused by leakage of blood from small vessels).","examples":[{"sentence":"The patient presented with a purpuric rash on their legs.","translation":"患者は脚に紫斑性の発疹を呈した。"},{"sentence":"Purpuric lesions can be a sign of various underlying medical conditions.","translation":"紫斑性の病変は、さまざまな基礎疾患の兆候である可能性がある。"}],"collocations":["purpuric rash","purpuric lesions","purpuric eruption"],"synonyms":["ecchymotic","petechial","hemorrhagic"],"antonyms":[]}],"etymology":{"value":"From the word 'purpura' (Latin for purple) + '-ic' (suffix meaning 'relating to').","priority":"★★☆"},"pronunciation":{"ipa":"/pərˈpjʊərɪk/","syllables":"pur-pur-ic"},"inflection":{},"usage_notes":{"explanation":"'Purpuric' is a medical term specifically used to describe conditions or symptoms related to purpura, which involves discoloration of the skin or mucous membranes due to blood leakage. It is often used in medical contexts when describing rashes, lesions, or other skin abnormalities.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["purpura (noun): a condition characterized by purple spots and patches on the skin.","purpureal (adjective): of or resembling purple; also, relating to purpura (rare)."],"priority":"★★☆"},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The word 'purpuric' is a specialized medical term, typically encountered in clinical or scientific contexts. Understanding its meaning requires familiarity with medical terminology related to hematology and dermatology. It's not commonly used in everyday language."},"example_sentences":[{"sentence":"The doctor noted a purpuric eruption on the patient's abdomen.","translation":"医師は患者の腹部に紫斑性の発疹があることを指摘した。","type":"adjective","meaning_category":"紫斑性の"},{"sentence":"The biopsy confirmed that the lesions were purpuric in nature.","translation":"生検により、その病変が紫斑性であることが確認された。","type":"adjective","meaning_category":"紫斑性の"}]}