{"word":"Patronizable","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"見下すような態度をとることができる、見下す価値のある","english_definition":"Capable of being treated in a condescending way; deserving of condescension.","examples":[{"sentence":"His naive enthusiasm was patronizable, but she tried to be encouraging instead.","translation":"彼の世間知らずな熱意は見下すこともできたが、彼女はむしろ励まそうとした。"},{"sentence":"The outdated technology was patronizable by the younger engineers.","translation":"その時代遅れの技術は、若いエンジニアたちから見下される対象だった。"}],"collocations":["patronizable behavior","patronizable attitude","patronizable naivety"],"synonyms":["condescendable","despicable","contemptible"],"antonyms":["respectable","admirable","worthy"]},{"part_of_speech":"adjective","definition":"保護または支援しやすい、後援する価値のある","english_definition":"Worthy of being patronized; easily supported or sponsored.","examples":[{"sentence":"The local arts scene was small but patronizable with a little effort.","translation":"地元の芸術シーンは小規模だったが、少しの努力で支援する価値があった。"},{"sentence":"The struggling business was patronizable if the community rallied together.","translation":"その苦境にあるビジネスは、地域社会が団結すれば支援することができた。"}],"collocations":["patronizable arts scene","patronizable business","patronizable cause"],"synonyms":["supportable","sponsorable","fundable"],"antonyms":["unsupportable","unsustainable"]}],"etymology":{"value":"The word 'patronizable' is derived from 'patronize,' which comes from the Middle French 'patronner' (to act as a patron to), from 'patron' (a protector or supporter). The suffix '-able' indicates capable of or worthy of.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpeɪtrənaɪzəbəl/","syllables":"pa-tron-i-za-ble"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It can also be used in comparative and superlative forms (more patronizable, most patronizable), though these are less common."},"usage_notes":{"explanation":"'Patronizable' can have two main senses. The first, and more common, implies something or someone is deserving of or invites condescension. The second, less common, suggests something is worthy of being patronized in the sense of being supported or sponsored. Context is crucial in determining which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was patronizable because he was rich.","correct":"✓ He was patronizing because he was rich.","note":"'Patronizable' describes the *recipient* of condescension, not the *actor*. 'Patronizing' describes the person acting condescendingly."},{"incorrect":"✗ The charity was patronizable with donations.","correct":"✓ The charity was supportable with donations. / ✓ People were able to patronize the charity with donations.","note":"While 'patronizable' can mean worthy of support, it is less common. Using 'supportable' is clearer."}],"priority":"★★☆"},"related_words":{"derivatives":["patronize (verb)","patronizing (adjective)","patronizingly (adverb)","patron (noun)","patronage (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Patronizable' is a relatively uncommon word that describes something or someone that can be treated in a condescending way or is worthy of being supported. The word is derived from 'patronize,' which means to treat someone with an apparent kindness that betrays a feeling of superiority. It's important to understand the context to determine whether the word is being used to describe something deserving of condescension or something worthy of support."},"example_sentences":[{"sentence":"The student's simplistic understanding of the complex issue made his arguments patronizable.","translation":"その学生の複雑な問題に対する単純すぎる理解は、彼の議論を見下す対象とした。","type":"adjective","meaning_category":"Deserving of Condescension"},{"sentence":"The small, local theater was patronizable through community donations and ticket sales.","translation":"その小さな地元の劇場は、地域社会の寄付とチケット販売によって支援することができた。","type":"adjective","meaning_category":"Worthy of Support"}]}