{"word":"nonretiring","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"退職しない、引退しない","english_definition":"Not retiring; not withdrawing from a position, occupation, or activity.","examples":[{"sentence":"He is a nonretiring professor who continues to teach even after the typical retirement age.","translation":"彼は定年後も教え続ける退職しない教授です。"},{"sentence":"The nonretiring CEO remained at the helm of the company for decades.","translation":"その引退しないCEOは、数十年にわたり会社の舵取りを続けました。"}],"collocations":["nonretiring employee","nonretiring professor","nonretiring CEO","nonretiring nature"],"synonyms":["active","continuing","persistent","remaining","unretiring"],"antonyms":["retiring","withdrawing","inactive","departing"]},{"part_of_speech":"adjective","definition":"控えめではない、引っ込み思案ではない","english_definition":"Not retiring; not shy or reserved; bold and outgoing.","examples":[{"sentence":"She has a nonretiring personality and is always the first to speak up in meetings.","translation":"彼女は控えめではない性格で、常に会議で最初に発言します。"},{"sentence":"His nonretiring demeanor made him a natural leader.","translation":"彼の引っ込み思案ではない態度は、彼を生まれながらのリーダーにしました。"}],"collocations":["nonretiring personality","nonretiring demeanor","nonretiring attitude","nonretiring character"],"synonyms":["bold","outgoing","assertive","confident","unreserved","extroverted"],"antonyms":["retiring","shy","reserved","timid","introverted"]}],"etymology":{"value":"Derived from \"non-\" (prefix meaning \"not\") + \"retiring\" (present participle of \"retire\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒn.rɪˈtaɪərɪŋ/","syllables":"non-re-tir-ing"},"inflection":{"notes":"Adjective, comparative and superlative forms can be created using \"more nonretiring\" and \"most nonretiring\", but this is not common."},"usage_notes":{"explanation":"The word \"nonretiring\" has two primary meanings, both negating the qualities associated with \"retiring.\" The first meaning refers to someone who does not withdraw from a position or occupation, often continuing to work past the typical retirement age. The second meaning describes someone who is not shy or reserved, but rather bold and outgoing. The context usually makes it clear which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a very nonretiring person, he always stays at home.","correct":"✓ He is a very retiring person, he always stays at home.","note":"The sentence describes someone who stays at home, which is characteristic of a 'retiring' (shy, reserved) person, not a 'nonretiring' person."},{"incorrect":"✗ The company needs more nonretiring workers to replace those who are leaving.","correct":"✓ The company needs more workers to replace those who are retiring.","note":"The sentence refers to replacing workers who are leaving their jobs upon reaching retirement age, so the correct term is 'retiring workers'."}],"priority":"★★☆"},"related_words":{"derivatives":["nonretirement"],"phrases":["nonretiring age"],"related_terms":["active","persistent","bold","outgoing","unreserved"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonretiring\" is a relatively uncommon adjective. It can describe someone who continues to work or hold a position beyond the usual retirement age, or it can describe someone who is not shy or reserved. The meaning depends on the context. It is formed by adding the prefix \"non-\" to \"retiring,\" which makes its meaning relatively straightforward to understand if one knows the meaning of \"retiring.\""},"example_sentences":[{"sentence":"The nonretiring senator continued to serve his constituents well into his eighties.","translation":"その引退しない上院議員は、80代になっても有権者のために尽力し続けました。","type":"adjective","meaning_category":"Not withdrawing from a position"},{"sentence":"Her nonretiring spirit and determination inspired everyone around her.","translation":"彼女の控えめではない精神と決意は、周りのすべての人々を鼓舞しました。","type":"adjective","meaning_category":"Not shy or reserved"}]}