{"word":"venisection","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"瀉血（しゃけつ）、静脈切開","english_definition":"The act or practice of opening a vein for letting blood; phlebotomy.","examples":[{"sentence":"Venisection was a common medical practice in the past.","translation":"瀉血は過去には一般的な医療行為だった。"}],"collocations":["perform venisection","practice venisection"],"synonyms":["phlebotomy","bloodletting"],"antonyms":[]}],"etymology":{"value":"Late Middle English: from Latin venae sectio, from vena ‘vein’ + sectio ‘cutting’ (from secare ‘to cut’).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌvɛnɪˈsɛkʃən/","syllables":"ve-ni-sec-tion"},"inflection":{"noun_plural":"venisections"},"usage_notes":{"explanation":"Venisection is an archaic term for phlebotomy or bloodletting, a medical procedure involving the incision of a vein to withdraw blood. It was historically used to treat a wide range of illnesses based on the now-discredited theory of humorism. Today, phlebotomy is primarily used for blood testing and therapeutic purposes in specific conditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Venesection is a modern treatment for infections.","correct":"✓ Phlebotomy is sometimes used to treat specific blood disorders.","note":"Venisection (or phlebotomy) is not a common treatment for infections. While phlebotomy is still practiced, it is typically for specific blood disorders, not general infections."}],"priority":"★☆☆"},"related_words":{"derivatives":["venisector"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Venisection' is a highly specialized and archaic term primarily encountered in historical or medical contexts. Understanding requires familiarity with outdated medical practices and terminology. The more common and contemporary term is 'phlebotomy.'"},"example_sentences":[{"sentence":"In the 18th century, venisection was a routine treatment for fever.","translation":"18世紀には、瀉血は発熱に対する日常的な治療法だった。","type":"noun","meaning_category":"medical practice"},{"sentence":"The barber-surgeon performed venisection on the patient.","translation":"床屋外科医が患者に瀉血を行った。","type":"noun","meaning_category":"historical context"}]}