{"word":"banking-disabled","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(人)が銀行業務を行うことができない、または(システム)が銀行業務をサポートしていない","english_definition":"(of a person) unable to perform banking operations, or (of a system) not supporting banking operations. This term often refers to situations where individuals with disabilities face barriers in accessing banking services, or where banking systems are not designed to be accessible to people with disabilities.","examples":[{"sentence":"The new regulations aim to ensure that banking services are not banking-disabled for visually impaired customers.","translation":"新しい規制は、視覚障害のある顧客にとって銀行サービスが利用できない状態にならないようにすることを目的としています。"},{"sentence":"Many elderly citizens are banking-disabled because they are not comfortable using online banking platforms.","translation":"多くの高齢者は、オンラインバンキングプラットフォームの利用に慣れていないため、銀行業務を行うことができません。"},{"sentence":"The lack of accessible ATMs makes the city banking-disabled for many wheelchair users.","translation":"アクセス可能なATMの不足により、その都市は多くの車椅子利用者にとって銀行業務を行うことができない場所となっています。"}],"collocations":["banking-disabled customers","banking-disabled individuals","banking-disabled community","banking-disabled systems","banking-disabled access"],"synonyms":["financially excluded","unbanked","underbanked","disenfranchised from banking","unable to access banking"],"antonyms":["financially included","banked","able to access banking","banking-enabled"]}],"etymology":{"value":"The term is a compound word combining 'banking' (referring to financial services and operations) and 'disabled' (referring to the state of being unable to perform certain activities, often due to physical or other impairments). The combination highlights the situation where individuals or systems are prevented from fully participating in or accessing banking services.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbæŋkɪŋ ˌdɪsˈeɪbəld/","syllables":"bank-ing-dis-a-bled"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"The term 'banking-disabled' is used to describe situations where individuals face barriers in accessing banking services, either due to their own disabilities or due to the inaccessibility of banking systems. It is often used in discussions about financial inclusion and accessibility, highlighting the need for banking services to be designed to be usable by everyone, regardless of their abilities. It can also refer to systems or technologies that do not support banking operations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The banking-disabled person went to the bank.","correct":"✓ The person with a disability went to the bank. / ✓ The banking system is disabled for many.","note":"Avoid using the term to directly label a person. Instead, focus on the barriers they face or the inaccessibility of the system. It's better to say 'a person with a disability' or describe the system as 'disabled for many.'"},{"incorrect":"✗ The banking system is banking-disabled.","correct":"✓ The banking system is inaccessible. / ✓ The banking system is not accessible to people with disabilities.","note":"Avoid redundancy. If the system is 'banking-disabled', it implies it's inaccessible. Use more direct language like 'inaccessible' or specify who the system is inaccessible to."}],"priority":"★★☆"},"related_words":{"derivatives":["disability","banking","accessible","accessibility","financial inclusion"],"related_terms":["financial exclusion","digital divide","assistive technology","universal design","inclusive design","accessible banking"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - This term is relatively new and not widely used, but it is gaining traction in discussions about financial inclusion and accessibility.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Banking-disabled' is a term used to describe situations where people are unable to access banking services. This can be because of their own disabilities, or because the banking systems are not designed to be accessible. It highlights the need for banks to make their services available to everyone, regardless of their abilities. The term is often used in discussions about making sure everyone has equal access to financial services. It's important to use this term carefully and respectfully, focusing on the barriers people face rather than labeling individuals.","priority":"★★☆"},"example_sentences":[{"sentence":"The government is working to reduce the number of banking-disabled citizens by promoting accessible banking technologies.","translation":"政府は、アクセス可能な銀行技術を推進することにより、銀行業務を行うことができない市民の数を減らすために取り組んでいます。","type":"adjective","meaning_category":"unable to access banking"},{"sentence":"The study found that many online banking platforms are banking-disabled for people with visual impairments.","translation":"調査によると、多くのオンラインバンキングプラットフォームは、視覚障害のある人々にとって銀行業務を行うことができません。","type":"adjective","meaning_category":"inaccessible online banking"},{"sentence":"The organization advocates for policies that address the challenges faced by banking-disabled communities.","translation":"その組織は、銀行業務を行うことができないコミュニティが直面する課題に対処する政策を提唱しています。","type":"adjective","meaning_category":"challenges faced by communities"}]}