{"word":"Micmacs","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"ミクマク族（カナダ東部およびアメリカ合衆国北東部に居住する先住民族）","english_definition":"A member of an indigenous people inhabiting the Atlantic provinces of Canada and the Gaspé Peninsula of Quebec, as well as the northeastern region of Maine.","examples":[{"sentence":"The Micmacs were skilled hunters and fishermen.","translation":"ミクマク族は熟練した狩猟者であり漁師であった。"},{"sentence":"Micmacs history is rich and complex.","translation":"ミクマク族の歴史は豊かで複雑である。"}],"collocations":["Micmacs language (ミクマク語)","Micmacs culture (ミクマク族の文化)","Micmacs people (ミクマク族の人々)"],"synonyms":["Mi'kmaq","Mi'gmaq"],"antonyms":[]}],"etymology":{"value":"Micmacs is an exonym, a name given by outsiders. It is believed to be derived from a Mi'kmaq word meaning 'allied' or 'related'. The term Mi'kmaq (singular) or Mi'kmaq (plural) is now the preferred term used by the people themselves.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɪkmæks/","syllables":"Mic-macs"},"inflection":{"noun_plural":"Micmacs (already plural, refers to the people)"},"usage_notes":{"explanation":"'Micmacs' is a historical term and sometimes still used, but 'Mi'kmaq' is the preferred term by the people themselves. When referring to a single person, 'Mi'kmaq' is used. When referring to the people as a whole, 'Mi'kmaq' is also used as the plural form.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ A Micmacs person.","correct":"✓ A Mi'kmaq person.","note":"When referring to a single person, use 'Mi'kmaq'."},{"incorrect":"✗ The Micmacs tribe.","correct":"✓ The Mi'kmaq people.","note":"'Mi'kmaq people' is more respectful and accurate."}],"priority":"★★☆"},"related_words":{"derivatives":["Mi'kmaq (preferred term)","Mi'gmaq (alternate spelling)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Micmacs' refers to the Mi'kmaq people, an indigenous group from eastern Canada and parts of the northeastern United States. While 'Micmacs' is sometimes used, the term 'Mi'kmaq' is preferred and more respectful. This term can be used for both singular and plural references. Understanding the history and cultural significance of the Mi'kmaq people is important when using these terms."},"example_sentences":[{"sentence":"The history of the Micmacs is intertwined with the history of Canada.","translation":"ミクマク族の歴史はカナダの歴史と深く関わっている。","type":"noun","meaning_category":"先住民族"},{"sentence":"The Micmacs language is still spoken by many people in the community.","translation":"ミクマク語は今でもコミュニティの多くの人々によって話されている。","type":"noun","meaning_category":"先住民族"}]}