{"word":"saprobic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"腐生性の、腐食性の","english_definition":"living on decaying organic matter; obtaining nourishment from decaying organic matter.","examples":[{"sentence":"Saprobic bacteria play a crucial role in decomposition.","translation":"腐生細菌は分解において重要な役割を果たす。"},{"sentence":"The saprobic fungi break down dead plants and animals.","translation":"腐生菌は枯れた植物や動物を分解する。"}],"collocations":["saprobic bacteria","saprobic fungi","saprobic organisms","saprobic decomposition","saprobic environment"],"synonyms":["decomposer","saprophytic","decaying","rotting"],"antonyms":["autotrophic","photosynthetic"]}],"etymology":{"value":"Derived from the Greek words 'sapros' (rotten) and 'bios' (life).","priority":"★★☆"},"pronunciation":{"ipa":"/sæˈproʊbɪk/","syllables":"sa-pro-bic"},"inflection":{"notes":"Not applicable for adjectives in English."},"usage_notes":{"explanation":"The term 'saprobic' is mainly used in biology and ecology to describe organisms that obtain nutrients from dead or decaying organic matter. These organisms are essential for recycling nutrients in ecosystems. It is often used to describe bacteria, fungi, and some other microorganisms.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant is saprobic and makes its own food.","correct":"✓ The plant is autotrophic and makes its own food.","note":"Saprobic organisms obtain food from dead organic matter, while autotrophic organisms make their own food through photosynthesis or chemosynthesis."},{"incorrect":"✗ Saprobic organisms are usually harmful to the environment.","correct":"✓ Saprobic organisms are essential for nutrient cycling in the environment.","note":"Saprobic organisms are beneficial as they decompose organic matter and release nutrients back into the ecosystem."}],"priority":"★☆☆"},"related_words":{"derivatives":["saprobe (noun: a saprobic organism)","saprophyte (noun: a plant that lives on dead or decaying organic matter)","saprophytic (adjective: living on dead or decaying organic matter)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Saprobic' is a technical term used in biology to describe organisms that live on and get their food from dead or decaying organic material. These organisms are important for breaking down dead plants and animals and returning nutrients to the environment. This word is not commonly used in everyday language and is mostly found in scientific contexts."},"example_sentences":[{"sentence":"The presence of saprobic organisms indicates the decomposition of organic waste.","translation":"腐生生物の存在は有機廃棄物の分解を示している。","type":"general","meaning_category":"decomposition"},{"sentence":"Saprobic fungi are essential for breaking down leaf litter in forests.","translation":"腐生菌は森林の落葉分解に不可欠である。","type":"ecology","meaning_category":"ecology"},{"sentence":"Certain saprobic bacteria are used in wastewater treatment to remove pollutants.","translation":"特定の腐生細菌は、汚染物質を除去するために廃水処理に使用される。","type":"environmental science","meaning_category":"environmental science"}]}