{"word":"city-ordered","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Ordered or arranged according to a city's specifications, regulations, or requirements. This could refer to anything from urban planning to the placement of public utilities or the organization of municipal services.","english_definition":"Arranged or mandated by a city's government or administration, typically in accordance with specific regulations or plans.","examples":[{"sentence":"The new development followed a city-ordered plan to ensure green spaces were integrated throughout the neighborhood.","translation":"新しい開発は、緑地が近隣全体に統合されるように、市が命令した計画に従った。"},{"sentence":"The construction company had to comply with the city-ordered noise restrictions during the project.","translation":"建設会社は、プロジェクト中に市が命令した騒音規制を遵守する必要があった。"},{"sentence":"The trees were planted in a city-ordered pattern along the avenue.","translation":"木々は、市が命令したパターンで大通り沿いに植えられた。"}],"collocations":["city-ordered plan","city-ordered regulations","city-ordered restrictions","city-ordered design","city-ordered survey"],"synonyms":["mandated by the city","city-regulated","city-directed","municipally ordered","city-prescribed"],"antonyms":["privately arranged","unregulated","randomly organized","independently planned"]}],"etymology":{"value":"The term is a compound adjective formed by combining 'city' (referring to a municipality or its government) and 'ordered' (indicating something arranged or commanded). The combination signifies that the order or arrangement originates from the city's authority.","priority":"N/A"},"pronunciation":{"ipa":"/ˈsɪti ˈɔːrdərd/","syllables":"cit-y or-dered"},"inflection":{"notes":"This is an adjective and does not have typical inflectional forms (like pluralization)."},"usage_notes":{"explanation":"'City-ordered' is used to describe something that is not just generally related to a city, but specifically arranged, mandated, or regulated by the city government or administration. It implies a level of official involvement and adherence to specific urban planning or municipal guidelines.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The garden was city ordered.","correct":"✓ The garden was city-ordered.","note":"The hyphen is crucial to indicate that 'city' and 'ordered' are functioning together as a single adjective modifying the noun. Without the hyphen, the sentence may not make sense or could be misinterpreted."}],"priority":"N/A"},"related_words":{"derivatives":["city (noun)","order (verb, noun)","ordered (adjective)","city planning (noun)","municipal (adjective)"],"phrasal_verbs":[],"related_concepts":["urban planning","municipal regulations","zoning laws","city ordinances","local government","urban development"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. This is a specific compound adjective and not commonly used in general conversation.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'City-ordered' is a compound adjective used to describe something that has been arranged, regulated, or mandated by a city's government or administration. It is typically used in contexts related to urban planning, municipal services, or construction projects where adherence to city regulations is important. The term implies official involvement and compliance with specific guidelines set by the city. Due to its specific and technical nature, it is more likely to be encountered in formal or professional contexts."},"example_sentences":[{"sentence":"The new bike lanes were installed according to a city-ordered plan to improve traffic flow.","translation":"新しい自転車レーンは、交通の流れを改善するために、市が命令した計画に従って設置された。","type":"adjective","meaning_category":"Regulations and Planning"},{"sentence":"All businesses must adhere to the city-ordered recycling program.","translation":"すべての企業は、市が命令したリサイクルプログラムを遵守する必要がある。","type":"adjective","meaning_category":"Municipal Compliance"},{"sentence":"The architecture of the building had to meet city-ordered aesthetic standards.","translation":"建物の建築は、市が命令した美的基準を満たす必要があった。","type":"adjective","meaning_category":"Urban Development"}]}