{"word":"crosswalks","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"横断歩道","english_definition":"a specially marked part of a road where people can cross","examples":[{"sentence":"Use the crosswalks to cross the street safely.","translation":"安全に道路を渡るために横断歩道を使ってください。"},{"sentence":"The crosswalks are painted with white stripes.","translation":"横断歩道は白い線で塗られています。"},{"sentence":"Pedestrians should always look both ways before stepping into crosswalks.","translation":"歩行者は横断歩道に入る前に必ず左右を確認すべきです。"}],"collocations":["marked crosswalks (標示された横断歩道)","unmarked crosswalks (標示されていない横断歩道)","pedestrian crosswalks (歩行者用横断歩道)","school crosswalks (学校の横断歩道)","crosswalks signs (横断歩道の標識)"],"synonyms":["pedestrian crossing","zebra crossing (UK)"],"antonyms":[],"related_terms":["jaywalking (信号無視横断)","sidewalk (歩道)","intersection (交差点)"]}],"etymology":{"value":"'Crosswalk' is a compound word. 'Cross' refers to the act of going from one side to the other, and 'walk' refers to the area designated for pedestrians to walk. The combination indicates an area for pedestrians to cross a street or road.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkrɔːswɔːks/","syllables":"cross-walks"},"inflection":{"noun_plural":"crosswalks"},"usage_notes":{"explanation":"'Crosswalks' refers to designated areas on roads where pedestrians have the right of way to cross. They are often marked with white or yellow lines, and sometimes have traffic signals to aid in safe crossing. It's important to use crosswalks whenever available to ensure pedestrian safety.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I crossed the street without looking for a crosswalk.","correct":"✓ I crossed the street without looking for a crosswalk. (grammatically correct, but unsafe)","note":"While grammatically correct, it's important to emphasize the importance of using crosswalks for safety."},{"incorrect":"✗ crosswalk is for cars.","correct":"✓ Crosswalks are for pedestrians.","note":"Crosswalks are specifically for pedestrians, not vehicles."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["pedestrian","traffic","street","road","safety"],"priority":"★★☆"},"level_frequency":{"CEFR":"B1","frequency_google_ngram":"Relatively common","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"The word 'crosswalks' is a common noun that refers to a designated area on a road where people can safely cross from one side to the other. These areas are usually marked with lines or other signals to indicate where pedestrians should cross. It is important to use crosswalks when crossing streets to ensure safety."},"example_sentences":[{"sentence":"The city installed new crosswalks near the school to improve safety.","translation":"市は安全性を向上させるために学校の近くに新しい横断歩道を設置しました。","type":"general","meaning_category":"general"},{"sentence":"Always use the crosswalks when crossing busy streets.","translation":"交通量の多い道路を渡るときは、必ず横断歩道を使ってください。","type":"safety","meaning_category":"safety"},{"sentence":"The crosswalks were clearly marked with bright yellow paint.","translation":"横断歩道は明るい黄色のペンキで明確にマークされていました。","type":"description","meaning_category":"description"}]}