{"word":"mycorrhiza","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"菌根","english_definition":"a symbiotic association between a fungus and the roots of a vascular plant.","examples":[{"sentence":"Mycorrhizae enhance nutrient uptake in many plants.","translation":"菌根は多くの植物における栄養吸収を促進する。"},{"sentence":"Some plants are highly dependent on mycorrhizal associations.","translation":"いくつかの植物は菌根共生に非常に依存している。"}],"collocations":["form mycorrhizae","mycorrhizal fungi","mycorrhizal association","ectomycorrhiza","endomycorrhiza"],"synonyms":["root fungus","fungus root"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'mykes' (μύκης) meaning 'fungus', 'rhiza' (ῥίζα) meaning 'root', and the suffix '-a' indicating a plural noun.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmaɪkəˈraɪzə/","syllables":"my-co-rhi-za"},"inflection":{"noun_plural":"mycorrhizae or mycorrhizas"},"usage_notes":{"explanation":"Mycorrhiza refers to the symbiotic relationship between a fungus and the roots of a plant. The fungus colonizes the plant's roots, providing increased water and nutrient absorption capabilities for the plant, while the plant provides the fungus with carbohydrates produced through photosynthesis. This mutually beneficial relationship is crucial for the health and survival of many plant species, particularly in nutrient-poor environments. There are two main types of mycorrhizae: ectomycorrhizae, where the fungus forms a sheath around the root, and endomycorrhizae, where the fungus penetrates the root cells.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Mycorhiza is a bacteria.","correct":"✓ Mycorrhiza is a fungus.","note":"Mycorrhiza is a symbiotic association involving a fungus, not bacteria."},{"incorrect":"✗ Mycorrhiza are a root.","correct":"✓ Mycorrhiza is a symbiotic association with roots.","note":"Mycorrhiza is not the root itself, but the symbiotic association between a fungus and the root."}],"priority":"★★☆"},"related_words":{"derivatives":["mycorrhizal (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'mycorrhiza' is a scientific term used in the context of botany and mycology. It describes a mutually beneficial (symbiotic) relationship between a fungus and the roots of a plant. The fungus helps the plant absorb water and nutrients from the soil, while the plant provides the fungus with sugars produced through photosynthesis. Understanding this term requires some background knowledge in biology, particularly plant physiology and fungal ecology."},"example_sentences":[{"sentence":"The presence of **mycorrhiza** significantly improves the growth of the seedlings.","translation":"菌根の存在は苗木の成長を著しく改善する。","type":"noun","meaning_category":"symbiotic association"},{"sentence":"**Mycorrhizal** fungi play a crucial role in forest ecosystems.","translation":"菌根菌は森林生態系において重要な役割を果たす。","type":"adjective","meaning_category":"related to symbiotic association"}]}