{"word":"Glossopteris","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"グロッソプテリス（絶滅した種子植物の属）","english_definition":"An extinct genus of seed ferns from the Permian and Triassic periods, characterized by tongue-shaped leaves.","examples":[{"sentence":"Fossil evidence of Glossopteris has been found on multiple continents.","translation":"グロッソプテリスの化石証拠は、複数の大陸で発見されています。"},{"sentence":"The presence of Glossopteris fossils supports the theory of continental drift.","translation":"グロッソプテリスの化石の存在は、大陸移動説を裏付けています。"}],"collocations":["Glossopteris fossil","Glossopteris flora","Glossopteris leaf","Glossopteris indica"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Greek 'glossa' (tongue) + 'pteris' (fern), referring to the tongue-shaped leaves.","priority":"★★★"},"pronunciation":{"ipa":"/ɡlɒˈsɒptərɪs/","syllables":"glos-sop-te-ris"},"inflection":{"noun_plural":"Glossopteris (usually used as a singular collective noun)"},"usage_notes":{"explanation":"Glossopteris is significant in paleobotany and geology because its fossils are found across continents now widely separated (South America, Africa, India, Australia, and Antarctica). This distribution pattern provided early evidence for the theory of continental drift and the existence of the supercontinent Gondwana.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Glossopteris are a type of fern.","correct":"✓ Glossopteris is a genus of seed ferns.","note":"Glossopteris is a genus, so the singular form is generally used, and it's more accurately described as a seed fern rather than just a fern."}],"priority":"★★☆"},"related_words":{"derivatives":["Glossopteridales (order)"],"related_terms":["Gondwana","continental drift","paleobotany","seed fern"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Glossopteris is a term mainly encountered in scientific contexts, particularly in paleobotany and geology. Understanding its significance requires knowledge of continental drift theory and the concept of Gondwana. While the word itself is not complex, the concepts associated with it are advanced.","priority":"★★☆"},"example_sentences":[{"sentence":"The discovery of Glossopteris fossils in Antarctica provided strong evidence for the existence of Gondwana.","translation":"南極大陸でのグロッソプテリスの化石の発見は、ゴンドワナ大陸の存在の強力な証拠となりました。","type":"scientific","meaning_category":"paleobotany"},{"sentence":"Glossopteris leaves are characterized by their distinctive tongue-like shape and reticulate venation.","translation":"グロッソプテリスの葉は、独特の舌のような形と網状の葉脈によって特徴付けられます。","type":"scientific","meaning_category":"morphology"}]}