{"word":"codeina","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"コデイン：弱い鎮痛剤、咳止め薬、および下痢止め薬として使用されるオピエート。","english_definition":"Codeine is an opiate used as a weak pain reliever, cough suppressant, and anti-diarrheal.","examples":[{"sentence":"Codeine is often prescribed for mild to moderate pain.","translation":"コデインは、軽度から中程度の痛みによく処方されます。"},{"sentence":"The doctor prescribed codeine for my cough.","translation":"医者は私の咳にコデインを処方しました。"}],"collocations":["codeine phosphate","codeine sulfate","take codeine","prescribe codeine"],"synonyms":["dihydrocodeine","opium alkaloid"],"antonyms":[],"related_terms":["analgesic","opiate","cough suppressant","painkiller"]}],"etymology":{"value":"From French 'codéine', from Greek 'kodeia' (poppy head), from 'kōdē' (poppy seed head).","priority":"★★★"},"pronunciation":{"ipa":"/koʊˈdiːnə/","syllables":"co-de-i-na"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Codeine is a controlled substance in many countries due to its potential for addiction. It is often combined with other medications, such as acetaminophen or ibuprofen, to enhance its pain-relieving effects.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I took codeine and now I feel happiness.","correct":"✓ I took codeine and now I feel drowsy.","note":"Codeine is a pain reliever, not a mood enhancer. Common side effects include drowsiness, constipation, and nausea."},{"incorrect":"✗ Codeine is safe for everyone.","correct":"✓ Codeine should be taken under medical supervision.","note":"Codeine can have serious side effects and is not suitable for everyone, especially children and pregnant women. It should only be taken as prescribed by a doctor."}],"priority":"★★☆"},"related_words":{"derivatives":["codeine phosphate","codeine sulfate"],"related_terms":["morphine","opium","thebaine"],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Codeine' is a technical term related to medicine and pharmacology. Understanding its usage requires knowledge of medical contexts and drug classifications. It is not commonly used in everyday conversations but is important in healthcare settings."},"example_sentences":[{"sentence":"The doctor prescribed a low dose of codeine to alleviate the patient's persistent cough.","translation":"医師は患者の持続的な咳を緩和するために、低用量のコデインを処方しました。","type":"noun","meaning_category":"medication"},{"sentence":"Codeine is an effective analgesic, but it can also cause constipation as a side effect.","translation":"コデインは効果的な鎮痛剤ですが、副作用として便秘を引き起こす可能性もあります。","type":"noun","meaning_category":"medication"}]}