{"word":"Tuscarawas","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"タスカラワス（米国オハイオ州東部の郡、およびその郡を流れる川の名前）","english_definition":"A county in eastern Ohio, United States, and the name of a river that flows through the county.","examples":[{"sentence":"Tuscarawas County is known for its Amish community.","translation":"タスカラワス郡は、アーミッシュのコミュニティで知られています。"},{"sentence":"The Tuscarawas River eventually joins the Muskingum River.","translation":"タスカラワス川は最終的にマスキンガム川に合流します。"}],"collocations":["Tuscarawas County, Ohio","Tuscarawas River","New Philadelphia (county seat of Tuscarawas County)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Tuscarawas' is believed to be derived from a Native American word, possibly Delaware (Lenape), meaning 'old town' or 'open mouth'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtʌskəˈrɑːwəs/","syllables":"Tus-ca-ra-was"},"inflection":{"notes":"Proper noun, so no plural form."},"usage_notes":{"explanation":"Tuscarawas is primarily used as a proper noun to refer to a specific geographic location in Ohio. It can refer to the county itself, the river that flows through it, or towns and landmarks within the county. The word is not commonly used in everyday conversation outside of discussions about the specific region.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, specific to the region.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tuscarawas' is a proper noun referring to a specific geographic location in Ohio. Its usage is limited to discussions about that particular region. Due to its specific nature and Native American origin, it is not part of the common English vocabulary and would be encountered primarily in contexts related to Ohio history, geography, or local news."},"example_sentences":[{"sentence":"The economy of Tuscarawas County relies heavily on agriculture and manufacturing.","translation":"タスカラワス郡の経済は、農業と製造業に大きく依存しています。","type":"noun","meaning_category":"Geographic Location"},{"sentence":"The Tuscarawas River is a popular spot for kayaking and fishing.","translation":"タスカラワス川は、カヤックや釣りの人気スポットです。","type":"noun","meaning_category":"Geographic Location"}]}