{"word":"Edriophthalma","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(分類学)エドリオフタルマ類：甲殻亜門軟甲綱に属する、腹部に直接付着した柄のない眼を持つ甲殻類の旧分類群。等脚類（ワラジムシなど）と端脚類（ヨコエビなど）を含む。","english_definition":"(taxonomy) An obsolete grouping of crustaceans within the subclass Malacostraca, characterized by sessile eyes (eyes that are not on stalks) directly attached to the cephalon (head), and thoracic limbs modified for walking. It included the Isopoda (e.g., woodlice) and Amphipoda (e.g., scuds).","examples":[{"sentence":"The Edriophthalma were once considered a distinct group within the Crustacea.","translation":"エドリオフタルマ類はかつて甲殻類の中で独立したグループと考えられていた。"},{"sentence":"Isopods and amphipods were traditionally classified under Edriophthalma.","translation":"等脚類と端脚類は伝統的にエドリオフタルマ類に分類されていた。"}],"collocations":["Edriophthalma classification","Edriophthalma species","Isopoda (formerly Edriophthalma)","Amphipoda (formerly Edriophthalma)"],"synonyms":["Malacostraca (broader group)","Isopoda","Amphipoda"],"antonyms":[]}],"etymology":{"value":"Derived from Greek: 'edrios' (ἕδριος) meaning 'sessile' or 'sitting', referring to the sessile eyes, and 'ophthalmos' (ὀφθαλμός) meaning 'eye'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛdriɒfˈθælmə/","syllables":"Ed-ri-oph-thal-ma"},"inflection":{"noun_plural":"Edriophthalmata"},"usage_notes":{"explanation":"The term 'Edriophthalma' is largely obsolete in modern taxonomy. Molecular and morphological evidence has led to a reclassification of crustaceans, and the groups formerly included in Edriophthalma are now placed in different, more accurately defined taxa within the Malacostraca. The term may still be encountered in older literature.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Edriophthalma are insects.","correct":"✓ Edriophthalma are crustaceans.","note":"Edriophthalma are crustaceans, not insects."},{"incorrect":"✗ Edriophthalma have stalked eyes.","correct":"✓ Edriophthalma have sessile eyes.","note":"Edriophthalma are characterized by sessile eyes, not stalked eyes."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Malacostraca","Isopoda","Amphipoda","Crustacea"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - This term is rarely used in modern scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Edriophthalma' is a technical term from older taxonomic classifications of crustaceans, specifically those with sessile eyes. It is not commonly used in modern biology due to reclassifications based on more recent research. Understanding this term requires familiarity with taxonomic nomenclature and the history of crustacean classification."},"example_sentences":[{"sentence":"Older textbooks may refer to isopods and amphipods as belonging to the Edriophthalma.","translation":"古い教科書では、等脚類と端脚類がエドリオフタルマ類に属すると記載されているかもしれない。","type":"noun","meaning_category":"Taxonomy"},{"sentence":"The classification of Edriophthalma has been superseded by more modern phylogenetic analyses.","translation":"エドリオフタルマ類の分類は、より現代的な系統解析によって取って代わられた。","type":"noun","meaning_category":"Taxonomy"}]}