{"word":"deformedness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"奇形であること、変形している状態","english_definition":"The state of being deformed; a malformation.","examples":[{"sentence":"The deformedness of the tree was due to a genetic mutation.","translation":"その木の奇形は遺伝子突然変異によるものだった。"},{"sentence":"The sculptor tried to capture the beauty even in the deformedness of the figure.","translation":"彫刻家はその人物の奇形の中にさえ美を捉えようとした。"}],"collocations":["congenital deformedness (先天性奇形)","physical deformedness (身体的奇形)"],"synonyms":["malformation","deformity","misshapenness","distortion","abnormality"],"antonyms":["normality","regularity","symmetry"]}],"etymology":{"value":"\"Deformed\" + \"-ness\". \"Deformed\" comes from Old French \"desformer\" (to disfigure), from Latin \"deformare\" (to disfigure), from \"de-\" (completely) + \"formare\" (to form).","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈfɔːrmɪdnəs/","syllables":"de-form-ed-ness"},"inflection":{"noun_plural":"deformednesses"},"usage_notes":{"explanation":"\"Deformedness\" is a noun that refers to the state or quality of being deformed. It is often used to describe physical abnormalities or malformations. While \"deformity\" is a more common synonym, \"deformedness\" emphasizes the condition or state of being deformed rather than the specific instance of a malformation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The deformedness was very sadly.","correct":"✓ The deformedness was very sad.","note":"\"Deformedness\" is a noun, so it should be modified by an adjective (sad) rather than an adverb (sadly)."},{"incorrect":"✗ He had a deformedness on his hand.","correct":"✓ He had a deformity on his hand. / ✓ His hand had a deformedness.","note":"While both are correct, \"deformity\" is more commonly used to refer to a specific malformation. \"Deformedness\" is better used to describe the general state."}],"priority":"★☆☆"},"related_words":{"derivatives":["deform (verb)","deformed (adjective)","deformity (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Deformedness\" is a relatively uncommon word that describes the state of being deformed or misshapen. It is a noun form derived from the adjective \"deformed.\" This word is typically encountered in formal or technical contexts, such as medical or scientific discussions, where precise descriptions of physical abnormalities are necessary. It's important to note that while \"deformedness\" and \"deformity\" are similar, \"deformity\" is the more frequently used term.","priority":"★☆☆"},"example_sentences":[{"sentence":"The doctor documented the deformedness of the patient's spine.","translation":"医師は患者の脊椎の奇形を記録した。","type":"general"},{"sentence":"The deformedness in the sculpture was intentional, meant to convey a sense of unease.","translation":"彫刻の奇形は意図的なもので、不安感を伝えるためのものだった。","type":"artistic"},{"sentence":"The plant's deformedness was a result of nutrient deficiency.","translation":"その植物の奇形は栄養不足の結果だった。","type":"scientific"}]}