{"word":"amorphization","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"非晶質化、アモルファス化","english_definition":"The process of converting a crystalline material into an amorphous (non-crystalline) state.","examples":[{"sentence":"Amorphization can be achieved through rapid quenching or ion implantation.","translation":"非晶質化は、急速冷却またはイオン注入によって達成できる。"},{"sentence":"The amorphization of the surface layer improves the material's corrosion resistance.","translation":"表面層の非晶質化は、材料の耐食性を向上させる。"}],"collocations":["thermal amorphization (熱的非晶質化)","ion-beam amorphization (イオンビーム非晶質化)","solid-state amorphization (固相非晶質化)"],"synonyms":["vitrification","amorphization process"],"antonyms":["crystallization"]},{"part_of_speech":"noun","definition":"(比喩的に)組織や構造の喪失、無秩序化","english_definition":"(figuratively) The loss of organization or structure; disordering.","examples":[{"sentence":"The amorphization of the political system led to widespread instability.","translation":"政治システムの無秩序化は、広範な不安定につながった。"},{"sentence":"The rapid social changes caused a certain amorphization of traditional values.","translation":"急速な社会変化は、伝統的な価値観の一定の無秩序化を引き起こした。"}],"collocations":["social amorphization (社会の無秩序化)","political amorphization (政治の無秩序化)"],"synonyms":["disorganization","disordering","destructuring"],"antonyms":["organization","structuring"]}],"etymology":{"value":"Derived from 'amorphous' (from Greek 'amorphos' meaning 'without form') + '-ization' (the process of becoming).","priority":"★★☆"},"pronunciation":{"ipa":"/əˌmɔːrfəˈzeɪʃən/","syllables":"a-mor-pha-za-tion"},"inflection":{"noun_plural":"amorphizations"},"usage_notes":{"explanation":"'Amorphization' primarily refers to the physical process of transforming a crystalline substance into an amorphous state, where the long-range order of the atoms is lost. It is commonly used in materials science, physics, and chemistry. Figuratively, it can describe the loss of structure or organization in a system, such as a political or social structure.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The amorphization is a crystal.","correct":"✓ The result of amorphization is an amorphous material, not a crystal.","note":"Amorphization results in a non-crystalline (amorphous) state, the opposite of a crystal."}],"priority":"★★☆"},"related_words":{"derivatives":["amorphous (adjective)","amorphously (adverb)","amorphize (verb)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Amorphization' is a technical term primarily used in scientific contexts, particularly in materials science. It describes the process of converting a crystalline material, which has a highly ordered atomic structure, into an amorphous material, which lacks long-range order. The figurative use of the term describes the loss of structure or organization in a system. Understanding requires familiarity with scientific concepts related to material structure and phase transitions."},"example_sentences":[{"sentence":"The amorphization of silicon by ion implantation is used to create shallow junctions in semiconductors.","translation":"イオン注入によるシリコンの非晶質化は、半導体における浅い接合を生成するために使用される。","type":"noun","meaning_category":"physical process"},{"sentence":"The amorphization of the company's management structure led to confusion and inefficiency.","translation":"会社の経営構造の無秩序化は、混乱と非効率につながった。","type":"noun","meaning_category":"figurative"}]}