{"word":"odalman","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A type of traditional Korean outerwear, typically a robe or coat, worn by men. It is often made of silk or other fine materials and is characterized by its wide sleeves and loose fit.","english_definition":"Traditional Korean men's outerwear, such as a robe or coat, made of silk or fine materials, known for wide sleeves and a loose fit.","examples":[{"sentence":"The nobleman wore a magnificent odalman, embroidered with gold thread.","translation":"その貴族は、金糸で刺繍された豪華なオダルマンを着ていた。"},{"sentence":"Odalman were commonly worn by scholars and officials during the Joseon dynasty.","translation":"オダルマンは、朝鮮王朝時代には学者や官僚によって一般的に着用されていた。"}],"collocations":["wear an odalman","silk odalman","embroidered odalman","traditional odalman"],"synonyms":["dopo","changot","hanbok (general term for Korean traditional clothing)"],"antonyms":[]}],"etymology":{"value":"The term 'odalman' is derived from Korean historical and cultural context, referring to a specific style of men's outerwear during the Joseon dynasty and earlier. The exact origin of the word is not widely documented in standard etymological resources, but it is understood to be a native Korean term.","priority":"★★☆"},"pronunciation":{"ipa":"/o.dal.man/","syllables":"o-dal-man"},"inflection":{"noun_plural":"odalmans","notes":"The plural form is created by simply adding an 's' as it is a loanword in English."},"usage_notes":{"explanation":"The term 'odalman' specifically refers to a type of traditional Korean men's outerwear. It is important to use this term when referring to this specific garment to distinguish it from other types of Korean clothing. While 'hanbok' is a general term for Korean traditional clothing, 'odalman' is more specific.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He wore a hanbok odalman.","correct":"✓ He wore an odalman.","note":"'Odalman' is a specific type of hanbok, so it's redundant to say 'hanbok odalman'. Just use 'odalman'."},{"incorrect":"✗ She wore an odalman to the wedding.","correct":"✓ He wore an odalman to the wedding.","note":"Odalman is traditionally men's clothing. Women wear different types of hanbok."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["hanbok","dopo","gat","jeogori","baji"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - specialized vocabulary related to Korean culture.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'odalman' is a specialized term referring to a specific type of traditional Korean men's clothing. Understanding its meaning requires knowledge of Korean culture and history. It is not a commonly used word in general English conversation."},"example_sentences":[{"sentence":"The museum displayed a collection of historical odalman from the Joseon period.","translation":"博物館には、朝鮮時代の歴史的なオダルマンのコレクションが展示されていた。","type":"noun","meaning_category":"traditional Korean outerwear"},{"sentence":"The actor looked regal in his silk odalman during the historical drama.","translation":"その俳優は、時代劇の中で絹のオダルマンを着て威厳があるように見えた。","type":"noun","meaning_category":"traditional Korean outerwear"}]}