{"word":"Nyaya","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ニヤーヤ学派（インド哲学の正統六派の一つ）","english_definition":"(Indian philosophy) One of the six orthodox schools of Hindu philosophy, focusing on epistemology and logic.","examples":[{"sentence":"Nyaya provides a systematic framework for reasoning and debate.","translation":"ニヤーヤ学派は、推論と議論のための体系的な枠組みを提供する。"},{"sentence":"The Nyaya Sutras are the foundational texts of the Nyaya school.","translation":"ニヤーヤ・スートラは、ニヤーヤ学派の基礎となる文献である。"}],"collocations":["Nyaya Sutras","Nyaya philosophy","epistemology of Nyaya","logic of Nyaya"],"synonyms":["Indian logic","epistemology","Hindu philosophy"],"antonyms":[]}],"etymology":{"value":"Sanskrit 'nyāya' (न्याय) meaning 'rule', 'method', 'plan', 'system', or 'judgment'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈnjɑːjə/","syllables":"Nya-ya"},"inflection":{"notes":"単数形のみ"},"usage_notes":{"explanation":"'Nyaya' refers specifically to the Nyaya school of Hindu philosophy. It is often associated with logic and epistemology (the study of knowledge). The school's primary focus is on providing a means to attain liberation (moksha) through valid knowledge.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am studying Nyaya to improve my feelings.","correct":"✓ I am studying Nyaya to improve my reasoning skills.","note":"Nyaya focuses on logic and reasoning, not emotions."}],"priority":"★★☆"},"related_words":{"derivatives":["Navya-Nyaya (新ニヤーヤ学派 - a later development of the Nyaya school)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Specialized academic vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nyaya' is a term from Indian philosophy, specifically referring to one of the six orthodox schools of Hinduism. It is a specialized term used in academic contexts when discussing Indian philosophy, logic, and epistemology. It is not a commonly used word in everyday conversation.","example_sentences":[]},"example_sentences":[{"sentence":"The **Nyaya** school emphasizes the importance of pramanas, or valid means of knowledge.","translation":"ニヤーヤ学派は、知識の正当な手段であるプラマーナの重要性を強調する。","type":"noun","meaning_category":"Indian philosophy"}]}