{"word":"quasi-tolerantly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"ある程度寛容に、表面上は寛容に","english_definition":"In a manner that suggests tolerance to some degree, but not completely or genuinely.","examples":[{"sentence":"The new policy was quasi-tolerantly received by the older employees, who were skeptical of its long-term effects.","translation":"新しい方針は、その長期的な影響を疑っていた年配の従業員によって、ある程度寛容に受け入れられた。"},{"sentence":"He quasi-tolerantly listened to her explanation, though he secretly disagreed with every point she made.","translation":"彼は彼女の説明を表面上は寛容に聞いたが、内心では彼女の主張のすべてに反対していた。"}],"collocations":["behave quasi-tolerantly","respond quasi-tolerantly","accept quasi-tolerantly"],"synonyms":["seemingly tolerantly","ostensibly tolerantly","superficially tolerantly","partially tolerantly"],"antonyms":["intolerantly","genuinely tolerantly","fully tolerantly"]}],"etymology":{"value":"「quasi-」は「似た」「擬似的な」という意味の接頭辞で、ラテン語の「quasi」（あたかも、ほとんど）に由来します。「tolerantly」は「寛容に」という意味で、「tolerant」（寛容な）に接尾辞「-ly」が付いたものです。したがって、「quasi-tolerantly」は「完全ではないが、ある程度寛容な様子で」という意味になります。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkweɪzaɪˈtɒlərəntli/","syllables":"quasi-tol-er-ant-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"\"Quasi-tolerantly\" is used to describe actions or attitudes that appear tolerant on the surface but lack genuine or complete tolerance. It implies a limited or conditional acceptance, often with underlying reservations or skepticism. The term is relatively uncommon and is typically used in formal or academic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted quasi-tolerantly, but he was very happy.","correct":"✓ He acted quasi-tolerantly, but he was secretly annoyed.","note":"The adverb implies a lack of genuine tolerance, so it's illogical to follow it with an expression of happiness."},{"incorrect":"✗ The law was quasi-tolerantly enforced. It was enforced strictly.","correct":"✓ The law was quasi-tolerantly enforced. It was not consistently applied.","note":"The adverb suggests inconsistent or incomplete enforcement, not strict enforcement."}],"priority":"★★☆"},"related_words":{"derivatives":["quasi (adverb/adjective)","tolerant (adjective)","tolerance (noun)","tolerantly (adverb)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Quasi-tolerantly\" is a complex word indicating a superficial or incomplete form of tolerance. It suggests that someone is acting tolerantly but may not genuinely feel or believe in tolerance. This word is rarely used in everyday conversation and is more common in academic or formal writing where nuanced descriptions of behavior are necessary. Understanding the prefix \"quasi-\" is key to grasping the meaning of this word.","example_sentences":[]}}