{"word":"busings","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(plural of busing) The practice of transporting students by bus to schools so as to redress prior racial segregation of schools, or to overcome the effects of residential segregation.","english_definition":"The practice of transporting students by bus to schools so as to redress prior racial segregation of schools, or to overcome the effects of residential segregation.","examples":[{"sentence":"The court ordered busing to achieve racial balance in the schools.","translation":"裁判所は学校の人種バランスを達成するためにバス通学を命じた。"},{"sentence":"Busing was a controversial issue in many cities.","translation":"バス通学は多くの都市で物議を醸した問題だった。"}],"collocations":["school busing","mandatory busing","court-ordered busing"],"synonyms":["school transportation","desegregation","integration"],"antonyms":["segregation","neighborhood schools"]}],"etymology":{"value":"Derived from the verb 'bus,' referring to transporting students by bus.","priority":"N/A"},"pronunciation":{"ipa":"/ˈbʌsɪŋz/","syllables":"bus-ings"},"inflection":{"noun_plural":"busings"},"usage_notes":{"explanation":"'Busings' specifically refers to the practice of using buses to transport students for the purpose of desegregation or integration. It's a term heavily associated with the civil rights era in the United States and is often used in discussions about education policy and racial equality.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["bus (verb)","bused (past tense/participle)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, specifically related to historical and political contexts.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Busings' is a term primarily used in the context of discussions about desegregation efforts in schools, particularly in the United States. It refers to the practice of transporting students via bus to schools outside their immediate neighborhoods to promote racial integration. Understanding this term requires familiarity with the history of civil rights and education policy.","priority":"N/A"},"example_sentences":[{"sentence":"The debate over busings continues to resonate in discussions about school diversity.","translation":"バス通学に関する議論は、学校の多様性に関する議論において依然として影響を与えている。","type":"noun","meaning_category":"desegregation"},{"sentence":"Many parents opposed the implementation of mandatory busings.","translation":"多くの親が義務的なバス通学の実施に反対した。","type":"noun","meaning_category":"desegregation"}]}