{"word":"reiver","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史) (16世紀から17世紀にかけての)イングランドとスコットランドの国境地帯の略奪者、襲撃者","english_definition":"(historical) a robber or plunderer, especially one of the border clans of the Anglo-Scottish border region in the 16th and 17th centuries.","examples":[{"sentence":"The border reivers were notorious for their cattle raiding.","translation":"国境地帯の略奪者たちは、牛泥棒で悪名高かった。"},{"sentence":"The reivers lived by plunder and raiding across the border.","translation":"略奪者たちは、国境を越えて略奪と襲撃をして生計を立てていた。"}],"collocations":["border reiver","cattle reiving"],"synonyms":["raider","plunderer","marauder","freebooter","bandit","outlaw"],"antonyms":[]}],"etymology":{"value":"Middle English 'rever', from 'reve' (to rob, plunder), of Scandinavian origin; related to Old Norse 'raufa' (to plunder).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈriːvər/","syllables":"rei-ver"},"inflection":{"noun_plural":"reivers"},"usage_notes":{"explanation":"The term 'reiver' specifically refers to the border clansmen who engaged in raiding and pillaging along the Anglo-Scottish border during a particular historical period. It is not a general term for any robber or bandit.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a reiver in the Wild West.","correct":"✓ He was an outlaw in the Wild West.","note":"'Reiver' refers specifically to the Anglo-Scottish border region, not the American West."}],"priority":"★★☆"},"related_words":{"derivatives":["reive (verb: to rob, plunder)","reiving (noun: the act of robbing or plundering)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (specialized historical term)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Reiver' is a specialized historical term referring to raiders along the Anglo-Scottish border in the 16th and 17th centuries. Understanding requires knowledge of British history and border conflicts. The word is not commonly used in modern English outside of historical contexts."},"example_sentences":[{"sentence":"The ballads tell tales of the daring exploits of the border **reivers**.","translation":"バラッドは、国境地帯の略奪者たちの大胆な武勇伝を語っている。","type":"noun","meaning_category":"略奪者"},{"sentence":"Many families in the border region have ancestors who were **reivers**.","translation":"国境地帯の多くの家族には、先祖が略奪者だった者がいる。","type":"noun","meaning_category":"略奪者"}]}