{"word":"locust-tree","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ニセアカシア、ハリエンジュ","english_definition":"A tree of the genus Robinia, especially Robinia pseudoacacia, having pinnate leaves and fragrant white flowers.","examples":[{"sentence":"The locust-tree is known for its fragrant flowers.","translation":"ニセアカシアは香りの良い花で知られています。"},{"sentence":"Locust-trees are often planted for erosion control.","translation":"ニセアカシアは、侵食防止のために植えられることが多いです。"}],"collocations":["black locust-tree","honey locust-tree"],"synonyms":["Robinia pseudoacacia","false acacia"],"antonyms":[]},{"part_of_speech":"noun","definition":"イナゴマメの木、キャロブ","english_definition":"A tree of the genus Ceratonia, especially Ceratonia siliqua, bearing edible pods.","examples":[{"sentence":"The locust-tree produces carob beans.","translation":"イナゴマメの木はキャロブ豆を生産します。"},{"sentence":"Carob is a popular substitute for chocolate, made from the pods of the locust-tree.","translation":"キャロブは、イナゴマメの木のさやから作られる、チョコレートの一般的な代替品です。"}],"collocations":["carob locust-tree"],"synonyms":["Ceratonia siliqua","carob tree"],"antonyms":[]}],"etymology":{"value":"The name 'locust-tree' is somewhat confusing because it is applied to two different trees. The Robinia pseudoacacia was named 'locust' because its pods resemble those of the true locust bean tree (Ceratonia siliqua). The name 'locust' for Ceratonia siliqua comes from the belief that John the Baptist ate locusts in the desert, though it was more likely the pods of this tree.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈloʊkəstˌtriː/","syllables":"lo-cust-tree"},"inflection":{"noun_plural":"locust-trees"},"usage_notes":{"explanation":"The term 'locust-tree' can refer to two different trees: Robinia pseudoacacia (ニセアカシア) and Ceratonia siliqua (イナゴマメの木). Robinia pseudoacacia is more commonly known as 'black locust' or 'false acacia' and is native to North America. Ceratonia siliqua is also known as the 'carob tree' and is native to the Mediterranean region. Be aware of the context to understand which tree is being referred to.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a locust-tree with red flowers.","correct":"✓ I saw a locust-tree with white flowers.","note":"Robinia pseudoacacia (ニセアカシア) typically has white flowers. If the tree has red flowers, it is likely a different species. You may need to specify the species of the locust-tree."},{"incorrect":"✗ Locust-tree beans are used to make chocolate.","correct":"✓ Carob beans are used as a chocolate substitute.","note":"Carob beans, from the Ceratonia siliqua (イナゴマメの木), are used as a chocolate substitute. The beans of Robinia pseudoacacia are not typically eaten."}],"priority":"★★☆"},"related_words":{"derivatives":["locust (イナゴ)","carob (キャロブ)","Robinia (ニセアカシア属)","Ceratonia (イナゴマメ属)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Locust-tree' refers to two different trees, which can be confusing. The most common is Robinia pseudoacacia, also called 'black locust' or 'false acacia', known for its white, fragrant flowers. The other is Ceratonia siliqua, or 'carob tree', which produces edible carob beans. When you see 'locust-tree', consider the context to determine which tree is being discussed. If the discussion involves erosion control or white flowers, it's likely Robinia pseudoacacia. If it involves carob or chocolate substitutes, it's likely Ceratonia siliqua.","priority":"★★☆"},"example_sentences":[{"sentence":"The **locust-tree** provided shade in the park.","translation":"ニセアカシアが公園に日陰を作っていた。","type":"noun","meaning_category":"ニセアカシア"},{"sentence":"Farmers cultivate the **locust-tree** for its valuable timber.","translation":"農家はニセアカシアを貴重な木材として栽培している。","type":"noun","meaning_category":"ニセアカシア"},{"sentence":"The **locust-tree** is native to the Mediterranean region and produces carob pods.","translation":"イナゴマメの木は地中海地域原産で、キャロブのさやを生産する。","type":"noun","meaning_category":"イナゴマメの木"},{"sentence":"**Locust-tree** honey has a unique flavor.","translation":"ニセアカシアの蜂蜜は独特の風味がある。","type":"noun","meaning_category":"ニセアカシア"}]}