{"word":"tintypes","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(写真) チンタイプ、ブリキ版写真：感光性のあるラッカーを塗った鉄板に直接画像を露光して作成された写真。","english_definition":"A photograph taken as a positive on a thin sheet of metal, typically iron, and developed by a process that produces a direct positive image.","examples":[{"sentence":"Tintypes were a popular form of photography in the 19th century.","translation":"チンタイプは19世紀に人気のある写真の形式でした。"},{"sentence":"Many Civil War soldiers had their portraits taken as tintypes.","translation":"南北戦争の兵士の多くは、チンタイプとして肖像写真を撮られました。"},{"sentence":"The antique shop had a collection of old tintypes.","translation":"その骨董品店には古いチンタイプのコレクションがありました。"}],"collocations":["take a tintype","old tintypes","Civil War tintypes","tintype portrait","tintype photograph"],"synonyms":["ferrotype","melainotype"],"antonyms":[]}],"etymology":{"value":"「tintype」という言葉は、写真が撮影される金属板に由来します。このプロセスは1850年代に導入され、比較的手頃な価格と迅速な処理時間により、すぐに人気を博しました。","priority":"★★☆"},"pronunciation":{"ipa":"ˈtɪnˌtaɪps","syllables":"tin-types"},"inflection":{"noun_plural":"tintypes"},"usage_notes":{"explanation":"Tintypes are a historical photographic process, meaning they are no longer commonly used in modern photography. They are often found in antique shops or historical collections. The image is a direct positive, meaning there is no negative. The image is also laterally reversed, like looking in a mirror.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I took a tintype of my family with my digital camera.","correct":"✓ I saw a tintype of my family at the antique store.","note":"Tintypes are a historical process, so you cannot create them with a digital camera."},{"incorrect":"✗ Tintypes are known for their high resolution and color accuracy.","correct":"✓ Tintypes are known for their durability and unique aesthetic.","note":"Tintypes have a lower resolution and are monochromatic."}],"priority":"★★☆"},"related_words":{"derivatives":["tintype (singular noun)"],"phrasal_verbs":[],"related_terms":["photography","daguerreotype","ambrotype","wet plate collodion","ferrotype","melainotype"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"tintypes\" refers to a specific historical photographic process. Understanding requires knowledge of photographic history and terminology. The word itself is not commonly used in modern contexts outside of discussions of historical photography."},"example_sentences":[{"sentence":"The museum displayed a collection of 19th-century **tintypes**.","translation":"博物館には19世紀のチンタイプのコレクションが展示されていました。","type":"noun","meaning_category":"photograph"},{"sentence":"Many families in the 1800s had **tintypes** taken as a way to preserve their memories.","translation":"1800年代の多くの家族は、思い出を保存する方法としてチンタイプを撮影しました。","type":"noun","meaning_category":"photograph"},{"sentence":"The **tintypes** had a unique, almost ethereal quality to them.","translation":"チンタイプには独特の、ほとんど非現実的な品質がありました。","type":"noun","meaning_category":"photograph"}]}