{"word":"twice-mourned","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"二度喪に服された、二度悼まれた","english_definition":"Having been mourned or grieved for on two separate occasions.","examples":[{"sentence":"The twice-mourned hero was remembered for his bravery and sacrifice.","translation":"二度喪に服された英雄は、彼の勇敢さと犠牲によって記憶された。"},{"sentence":"The twice-mourned city rebuilt itself after each devastating event.","translation":"二度悼まれた都市は、それぞれの壊滅的な出来事の後に再建された。"}],"collocations":["twice-mourned hero","twice-mourned victim","twice-mourned city"],"synonyms":["doubly mourned","repeatedly mourned"],"antonyms":["unmourned","forgotten"]}],"etymology":{"value":"The word is formed by combining \"twice\" (meaning two times) with \"mourned\" (past participle of \"mourn,\" meaning to feel or express sorrow or grief).","priority":"N/A"},"pronunciation":{"ipa":"/ˈtwaɪs mɔːrnd/","syllables":"twice-mourned"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"\"Twice-mourned\" is an adjective that describes someone or something that has been mourned or grieved for on two separate occasions. This could be due to two separate deaths or losses, or perhaps a presumed death followed by a later, actual death. It implies a deeper level of sorrow and remembrance.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The twice-mourn person.","correct":"✓ The twice-mourned person.","note":"Ensure the correct past participle form \"mourned\" is used."}],"priority":"N/A"},"related_words":{"derivatives":["mourn","mourned","mourner","mournful","mournfully"],"phrases":["in mourning","period of mourning"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Rare","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The word \"twice-mourned\" is a relatively uncommon and literary term. It is used to describe someone or something that has been mourned on two separate occasions, suggesting a profound and repeated sense of loss. The word is typically found in more formal or literary contexts."},"example_sentences":[{"sentence":"The twice-mourned queen was first believed to have died in childbirth, only to reappear years later before finally passing away from illness.","translation":"二度喪に服された女王は、最初は出産で亡くなったと思われていたが、数年後に再登場し、最終的に病気で亡くなった。","type":"adjective","meaning_category":"二度喪に服された"}]}