{"word":"subrule","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"下位規則、細則、副規則","english_definition":"A rule that is subordinate to or derived from another rule.","examples":[{"sentence":"The subrule clarifies the application of the main rule.","translation":"その下位規則は、主要な規則の適用を明確にする。"},{"sentence":"Each subrule must be consistent with the overarching principles.","translation":"各細則は、包括的な原則と一貫していなければならない。"},{"sentence":"The committee debated several amendments to the proposed subrules.","translation":"委員会は、提案された細則に対するいくつかの修正案について議論した。"}],"collocations":["derive a subrule","establish a subrule","amend a subrule","interpret a subrule","apply a subrule"],"synonyms":["subsection","provision","clause","stipulation","detail"],"antonyms":["main rule","overarching rule","general principle"]}],"etymology":{"value":"The word 'subrule' is formed by combining the prefix 'sub-' meaning 'under' or 'below' with the noun 'rule'. It indicates a rule that is secondary or subordinate to a primary rule.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsʌbˌruːl/","syllables":"sub-rule"},"inflection":{"noun_plural":"subrules"},"usage_notes":{"explanation":"'Subrule' refers to a specific, often more detailed, rule that falls under a broader, more general rule. It is used to provide clarification, exceptions, or further specifications related to the main rule. Subrules are common in legal documents, regulations, and complex systems where detailed guidance is necessary.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The subrule is more general than the rule.","correct":"✓ The subrule is more specific than the rule.","note":"Subrules are typically more specific and detailed than the main rule they are derived from."},{"incorrect":"✗ Subrule is the same as rule.","correct":"✓ A subrule is a specific type of rule.","note":"Subrules are a subset of rules, but they are not identical to general rules."}],"priority":"★★☆"},"related_words":{"derivatives":["sub- (prefix)","rule (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'subrule' is a technical term, primarily used in legal, regulatory, and technical contexts. It refers to a rule that is subordinate to another, more general rule. Understanding this term requires familiarity with formal systems and hierarchical structures of rules and regulations. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The new subrule addresses the issue of data privacy.","translation":"新しい細則は、データプライバシーの問題に対処する。","type":"general","meaning_category":"Definition"},{"sentence":"The subrule provides an exception for small businesses.","translation":"その下位規則は、中小企業に対する例外規定を設けている。","type":"specific","meaning_category":"Clarification"},{"sentence":"The subrule must be interpreted in accordance with the main rule.","translation":"その細則は、主要な規則に従って解釈されなければならない。","type":"legal","meaning_category":"Application"}]}