{"word":"psycho-physic","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"精神物理学","english_definition":"The branch of psychology that deals with the relationships between physical stimuli and the sensations and perceptions they evoke.","examples":[{"sentence":"Psycho-physic studies how changes in physical stimuli relate to changes in our sensations.","translation":"精神物理学は、物理的な刺激の変化が私たちの感覚の変化にどのように関連するかを研究します。"},{"sentence":"Early psycho-physic experiments focused on determining the absolute threshold for various sensory modalities.","translation":"初期の精神物理学の実験は、さまざまな感覚様式における絶対閾値を決定することに焦点を当てていました。"}],"collocations":["psycho-physic experiment","psycho-physic method","psycho-physic measurement","psycho-physic research"],"synonyms":["psychophysics"],"antonyms":[]}],"etymology":{"value":"Derived from 'psycho-' (relating to the mind) and 'physic' (relating to physical phenomena).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsaɪkoʊˈfɪzɪk/","syllables":"psy-cho-phys-ic"},"inflection":{"noun_plural":"psycho-physics"},"usage_notes":{"explanation":"'Psycho-physic' is a less common variant of 'psychophysics'. Both terms refer to the same field of study. 'Psychophysics' is the more widely accepted and frequently used term in contemporary psychology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Psycho-physic studies the mind directly.","correct":"✓ Psycho-physic studies the relationship between physical stimuli and mental sensations.","note":"Psycho-physic does not directly study the mind but rather the relationship between physical stimuli and the resulting sensations and perceptions."}],"priority":"★☆☆"},"related_words":{"derivatives":["psychophysical (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Psycho-physic' is a technical term used in psychology, specifically referring to the study of the relationship between physical stimuli and the sensations and perceptions they evoke. It's a relatively uncommon term, with 'psychophysics' being the more widely used synonym. Understanding this term requires familiarity with psychological concepts and scientific vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The researcher used psycho-physic methods to measure the participants' sensitivity to different light intensities.","translation":"研究者は、参加者のさまざまな光の強度に対する感受性を測定するために、精神物理学的方法を使用しました。","type":"noun","meaning_category":"branch of psychology"},{"sentence":"Psycho-physic experiments can help us understand how our senses adapt to changes in the environment.","translation":"精神物理学の実験は、私たちの感覚が環境の変化にどのように適応するかを理解するのに役立ちます。","type":"noun","meaning_category":"branch of psychology"}]}