{"word":"Lenapes","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"レナペ族（北米の先住民族）","english_definition":"A group of several bands of Native American people who spoke related languages and shared cultural practices. They lived in the area that is now New Jersey, eastern Pennsylvania, southeastern New York, Delaware, and parts of eastern Maryland.","examples":[{"sentence":"The Lenapes were forced to move west by European settlers.","translation":"レナペ族はヨーロッパからの入植者によって西へ移動することを余儀なくされました。"},{"sentence":"Many Lenape traditions are still practiced today.","translation":"多くのレナペ族の伝統は今日でも実践されています。"}],"collocations":["Lenape culture","Lenape language","Lenape tribe","Lenape history"],"synonyms":["Delaware Indians"],"antonyms":[]}],"etymology":{"value":"The name 'Lenape' comes from their own language, meaning 'the people'.","priority":"★★☆"},"pronunciation":{"ipa":"/ləˈnɑːpeɪ/","syllables":"Le-na-pes"},"inflection":{"noun_plural":"Lenapes"},"usage_notes":{"explanation":"'Lenapes' refers to a group of related Native American peoples, not a single unified tribe. They are also known as the Delaware Indians, a name given to them by Europeans. When referring to a single person, you might say 'a Lenape person' or 'a member of the Lenape'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Lenape is a tribe.","correct":"✓ The Lenapes are a group of tribes.","note":"Lenape refers to a group of related peoples, not a single tribe."}],"priority":"★★☆"},"related_words":{"derivatives":["Unami","Munsee"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lenapes' refers to a group of Native American peoples who historically lived in the northeastern United States. It's important to understand that this term encompasses several related groups, not just one tribe. The word itself comes from their own language and means 'the people'. When discussing their history or culture, it's crucial to be respectful and accurate in using this term."},"example_sentences":[{"sentence":"The history of the Lenapes is closely tied to the early colonization of North America.","translation":"レナペ族の歴史は、北米の初期の植民地化と密接に結びついています。","type":"noun","meaning_category":"民族"},{"sentence":"Efforts are being made to preserve the Lenape language and traditions.","translation":"レナペ族の言語と伝統を保存するための努力がなされています。","type":"noun","meaning_category":"民族"}]}