{"word":"rubricist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"（特に中世写本の）朱書き者、朱筆者","english_definition":"A person who writes or illuminates rubrics, especially in medieval manuscripts.","examples":[{"sentence":"The rubricist carefully added the red headings to the illuminated manuscript.","translation":"朱筆者は注意深く、彩飾写本に赤い見出しを加えた。"}],"collocations":["medieval rubricist","manuscript rubricist"],"synonyms":["illuminator","scribe"],"antonyms":[]}],"etymology":{"value":"From 'rubric' (red ochre or red chalk, then a heading or title written in red) + '-ist' (a person who does or is concerned with something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈruːbrɪsɪst/","syllables":"ru-bri-cist"},"inflection":{"noun_plural":"rubricists"},"usage_notes":{"explanation":"A rubricist was a specialized scribe, particularly during the medieval period, responsible for adding rubrics (headings, titles, or instructions) to manuscripts, often in red ink. This was a distinct role from that of the main scribe or illuminator, although sometimes the same person performed multiple roles.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a rubricist for the modern textbook.","correct":"✓ He was an editor for the modern textbook.","note":"The term 'rubricist' is strongly associated with medieval manuscripts, not modern books. Use 'editor' or a more general term for modern texts."}],"priority":"★☆☆"},"related_words":{"derivatives":["rubric (noun: a heading or title in red, a set of rules or instructions)","rubricate (verb: to mark or color with red, to establish rules or standards)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely rare.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'rubricist' is highly specialized and rarely encountered outside of historical or academic contexts related to medieval manuscripts. Understanding requires familiarity with the history of book production and the role of scribes and illuminators. The related term 'rubric' is more commonly used in modern contexts to refer to a set of rules or guidelines, but the connection to the historical role of the rubricist may not be immediately apparent to most readers."},"example_sentences":[{"sentence":"The skill of the rubricist is evident in the precise lettering and vibrant red ink of the headings.","translation":"朱筆者の技術は、正確な文字と鮮やかな赤インクの見出しに明らかである。","type":"general","meaning_category":"skill"},{"sentence":"Many medieval manuscripts show evidence of collaboration between the scribe, the illuminator, and the rubricist.","translation":"多くの中世写本は、筆記者、彩飾者、そして朱筆者の間の共同作業の証拠を示している。","type":"historical context","meaning_category":"historical"}]}