{"word":"Caligulism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"カリグラ帝のような残虐で気まぐれな専制政治、またはそのような行動","english_definition":"cruel and capricious tyranny, like that of the emperor Caligula; or such behavior.","examples":[{"sentence":"The CEO's management style was often described as Caligulism, marked by arbitrary decisions and a disregard for employee welfare.","translation":"そのCEOの経営スタイルは、恣意的な決定と従業員の福利厚生への無視を特徴とする、カリグラ帝のような専制政治とよく評された。"},{"sentence":"Historians debate whether Caligula's reign was truly defined by Caligulism, or if accounts were exaggerated by his political enemies.","translation":"歴史家たちは、カリグラ帝の治世が本当にカリグラ帝のような専制政治によって定義されたのか、それとも彼の政敵によって誇張された記述なのかについて議論している。"}],"collocations":["exhibit Caligulism","practice Caligulism","Caligulism in politics","Caligulism in management"],"synonyms":["tyranny","despotism","autocracy","dictatorship","cruelty","capriciousness"],"antonyms":["benevolence","democracy","republic","kindness","compassion"]}],"etymology":{"value":"皇帝カリグラ（ガイウス・ユリウス・カエサル・アウグストゥス・ゲルマニクス）の名前に由来。カリグラは、その残虐で気まぐれな行動で知られていた。接尾辞「-ism」は、主義、行動、または特徴を示すために使用される。","priority":"★★★"},"pronunciation":{"ipa":"/kəˈlɪɡjʊlɪzəm/","syllables":"ca-lig-u-lism"},"inflection":{"noun_plural":"Caligulisms"},"usage_notes":{"explanation":"「Caligulism」は、非常に否定的で批判的な意味合いを持つ言葉です。通常、権力者が恣意的で残虐な方法で権力を行使する状況を指します。この言葉は、歴史的な文脈（特に古代ローマ）や、現代の政治、ビジネス、または社会的な状況で使用されることがあります。この言葉を使う際は、その意味合いの強さを考慮する必要があります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The caligulism of the weather made it impossible to plan a picnic.","correct":"✓ The capriciousness of the weather made it impossible to plan a picnic.","note":"「Caligulism」は人や組織の行動を指す言葉であり、自然現象には適用されません。"},{"incorrect":"✗ He showed caligulism by donating to charity.","correct":"✓ He showed generosity by donating to charity.","note":"「Caligulism」は否定的な意味合いを持つ言葉であり、慈善行為のような肯定的な行動を説明するためには使用されません。"}],"priority":"★☆☆"},"related_words":{"derivatives":["Caligulan (形容詞: カリグラ帝の、カリグラ帝のような)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Caligulism**」は、皇帝カリグラの治世を特徴づけたとされる残虐で気まぐれな専制政治を指す、非常に特殊な単語です。この言葉は、権力者が恣意的で残酷な方法で権力を行使する状況を批判的に表現するために使われます。歴史的な文脈や、現代の政治、ビジネス、社会的な状況で使用されることがありますが、一般的な会話で使われることはほとんどありません。この言葉を使うには、その歴史的背景と否定的な意味合いを理解している必要があります。"},"example_sentences":[{"sentence":"The dictator's reign was marked by **Caligulism**, as he made decisions based on personal whims rather than the needs of the people.","translation":"その独裁者の治世は、人々のニーズよりも個人的な気まぐれに基づいて決定を下したため、カリグラ帝のような専制政治によって特徴づけられた。","type":"noun","meaning_category":"専制政治"},{"sentence":"Critics accused the governor of **Caligulism** when he suddenly fired all the members of the state's environmental protection agency.","translation":"知事が州の環境保護庁のメンバー全員を突然解雇したとき、批評家たちは彼をカリグラ帝のような専制政治だと非難した。","type":"noun","meaning_category":"専制政治"},{"sentence":"The novel explores the themes of power and **Caligulism** through the story of a corrupt Roman emperor.","translation":"その小説は、堕落したローマ皇帝の物語を通して、権力とカリグラ帝のような専制政治のテーマを探求している。","type":"noun","meaning_category":"専制政治"}]}