{"word":"Methylglycine","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A chemical compound; specifically, N-methylglycine, also known as sarcosine.","english_definition":"A naturally occurring amino acid found in muscles and other tissues. It is a derivative of glycine with a methyl group attached to the nitrogen atom.","examples":[{"sentence":"Methylglycine is involved in the metabolism of choline.","translation":"メチルグリシンはコリンの代謝に関与しています。"},{"sentence":"The concentration of methylglycine can be measured in urine.","translation":"尿中のメチルグリシンの濃度を測定することができます。"}],"collocations":["N-methylglycine","sarcosine","amino acid","metabolism","urine concentration"],"synonyms":["sarcosine","N-methylglycine"],"antonyms":[]}],"etymology":{"value":"Derived from the chemical structure: 'methyl' refers to the methyl group (CH3), and 'glycine' is the amino acid it is derived from.","priority":"N/A"},"pronunciation":{"ipa":"/ˌmɛθɪlˈɡlaɪsiːn/","syllables":"meth-yl-gly-cine"},"inflection":{"notes":"It is a noun, so it has no plural form."},"usage_notes":{"explanation":"Methylglycine, commonly known as sarcosine, is an intermediate in the metabolism of choline to glycine. It has been studied for its potential role in various biological processes and medical conditions.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["glycine","dimethylglycine","choline"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"Methylglycine, also known as sarcosine, is a biochemical term referring to a specific amino acid derivative. Understanding this term requires knowledge of organic chemistry and biochemistry, particularly related to amino acids and metabolic pathways. It is typically encountered in scientific literature or advanced studies in biology and chemistry."},"example_sentences":[{"sentence":"The enzymatic conversion of choline produces methylglycine as an intermediate.","translation":"コリンの酵素的変換は、中間体としてメチルグリシンを生成します。","type":"scientific","meaning_category":"biochemistry"},{"sentence":"Research indicates that methylglycine levels may be altered in certain metabolic disorders.","translation":"研究によると、メチルグリシンのレベルは特定の代謝障害で変化する可能性があることが示されています。","type":"medical","meaning_category":"medical research"}]}