{"word":"uncoquettish","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"控えめな、媚びない、気取らない","english_definition":"Not behaving in a flirtatious way; lacking coquetry; modest; unpretentious.","examples":[{"sentence":"She had an uncoquettish demeanor, preferring honesty to charm.","translation":"彼女は媚びない態度で、魅力よりも正直さを好んだ。"},{"sentence":"Her uncoquettish nature made her seem genuine and approachable.","translation":"彼女の気取らない性格は、彼女を誠実で親しみやすく見せた。"}],"collocations":["uncoquettish demeanor","uncoquettish nature","uncoquettish manner"],"synonyms":["modest","unassuming","unpretentious","reserved","demure","unflirtatious"],"antonyms":["coquettish","flirtatious","affected","pretentious"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to 'coquettish'. 'Coquettish' comes from the French word 'coquette', meaning a flirtatious woman.","priority":"medium"},"pronunciation":{"ipa":"/ˌʌnkoʊˈkɛtɪʃ/","syllables":"un-co-quet-tish"},"inflection":{"notes":"Adjectives in English do not inflect, but can form comparative and superlative forms (more uncoquettish, most uncoquettish)."},"usage_notes":{"explanation":"'Uncoquettish' describes someone who lacks the traits associated with a coquette – someone who flirts to attract attention. It suggests a lack of artificiality or affectation in one's behavior. The word is relatively uncommon.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"She was uncoquettish with her friends, always being honest and direct.","correct":"She was uncoquettish, always being honest and direct.","note":"The phrase 'with her friends' is redundant. The quality of being uncoquettish applies to her general demeanor, not just her interactions with friends."}],"priority":"low"},"related_words":{"derivatives":["uncoquettishly (adverb)","uncoquettishness (noun)"],"phrasal_verbs":[],"related_words":["coquette","coquetry","flirt","flirtatious","modest"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"low"},"readability_explanation":{"level":"C1","text":"'Uncoquettish' is a sophisticated word that describes someone who is not flirtatious or affected. It is used to describe a person who is genuine and straightforward in their interactions, lacking the desire to attract attention through flirtation. Because of its relative obscurity, it is more likely to be encountered in literature or formal writing."},"example_sentences":[{"sentence":"Her uncoquettish approach to conversation was refreshing in a world of artifice.","translation":"彼女の媚びない会話の仕方は、虚飾の世界では新鮮だった。","type":"adjective","meaning_category":"控えめな、媚びない"},{"sentence":"The character's uncoquettish demeanor was a deliberate choice by the author to emphasize her sincerity.","translation":"そのキャラクターの気取らない態度は、作者が彼女の誠実さを強調するために意図的に選んだものだった。","type":"adjective","meaning_category":"気取らない"}]}