{"word":"ghazel","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ガザル：アラビア、ペルシア、ウルドゥー文学における詩の形式。通常、各連が独立した意味を持ち、押韻と韻律の厳格なパターンに従う。愛、神秘主義、哲学などのテーマを扱うことが多い。","english_definition":"A form of lyric poetry common in Arabic, Persian, and Urdu literature. It typically consists of couplets that are independent in meaning but share a strict rhyme and meter scheme. Ghazals often explore themes of love, mysticism, and philosophy.","examples":[{"sentence":"The poet recited a beautiful ghazel about lost love.","translation":"詩人は失恋についての美しいガザルを朗読した。"},{"sentence":"Ghazels are known for their intricate rhyme schemes.","translation":"ガザルは、その複雑な韻の構成で知られている。"},{"sentence":"Many classical ghazels explore themes of divine love.","translation":"多くの古典的なガザルは、神への愛というテーマを探求している。"}],"collocations":["write a ghazel (ガザルを書く)","recite a ghazel (ガザルを朗読する)","classical ghazel (古典的なガザル)","modern ghazel (現代的なガザル)"],"synonyms":["lyric poem","ode","song"],"antonyms":[]}],"etymology":{"value":"アラビア語の غَزَل (ḡazal) に由来し、「愛の言葉を語る、紡ぐ」という意味を持つ。これは、ガザルの初期のテーマが主に愛であったことに由来する。ペルシア語を経て、ウルドゥー語やその他の言語にも広まった。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡæzəl/","syllables":"gha-zel"},"inflection":{"noun_plural":"ghazels"},"usage_notes":{"explanation":"「**ghazel**」は、詩の形式を指す専門的な用語です。一般的な会話で使われることは稀で、文学、特にアラビア、ペルシア、ウルドゥー文学の文脈で登場します。ガザルは、その独特な形式（各連が独立した意味を持ちながら、共通の韻律と押韻パターンに従う）と、愛、神秘主義、哲学といったテーマを扱うことで特徴付けられます。","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I wrote a ghazel about my dog.","correct":"✓ I wrote a poem about my dog.","note":"ガザルは特定の形式を持つ詩なので、形式を理解せずに使うのは不適切です。犬についての詩を書いた場合は、単に「poem」と言う方が適切です。"},{"incorrect":"✗ Ghazel is a type of novel.","correct":"✓ Ghazel is a type of poem.","note":"ガザルは小説ではなく詩の一種です。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["qasida (カシーダ：アラビア語の頌詩)","masnavi (マスナヴィー：二行連句形式の詩)","urdu poetry (ウルドゥー語詩)","persian poetry (ペルシア語詩)","arabic poetry (アラビア語詩)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 文学研究や専門分野でのみ使われる。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**ghazel**」は、アラビア、ペルシア、ウルドゥー文学に特有の詩の形式を指す専門用語です。文学研究者や詩に深い関心を持つ人以外には馴染みが薄いかもしれません。ガザルは、各連が独立した意味を持ちながら、厳格な韻律と押韻パターンを共有するという独特の構造を持っています。また、愛、神秘主義、哲学といったテーマを扱うことが多いです。この単語を理解するには、詩の形式に関する知識と、関連する文化への理解が求められます。"},"example_sentences":[{"sentence":"The anthology featured several examples of classical ghazels.","translation":"そのアンソロジーには、いくつかの古典的なガザルの例が掲載されていた。","type":"noun","meaning_category":"詩の形式"},{"sentence":"He attempted to write a ghazel in English, but found it challenging to maintain the traditional rhyme scheme.","translation":"彼は英語でガザルを書こうと試みたが、伝統的な韻の構成を維持するのが難しいと感じた。","type":"noun","meaning_category":"詩の形式"},{"sentence":"The professor lectured on the history and evolution of the ghazel in Persian literature.","translation":"教授はペルシア文学におけるガザルの歴史と進化について講義した。","type":"noun","meaning_category":"詩の形式"}]}