{"word":"coxofemoral","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"股関節の、寛骨大腿の","english_definition":"Relating to the hip joint (the joint between the femur and the hip bone).","examples":[{"sentence":"Coxofemoral joint osteoarthritis is a common condition in older adults.","translation":"股関節の変形性関節症は、高齢者に一般的な疾患です。"},{"sentence":"The coxofemoral ligaments provide stability to the hip.","translation":"股関節の靭帯は股関節に安定性をもたらします。"}],"collocations":["coxofemoral joint","coxofemoral dislocation","coxofemoral ligaments"],"synonyms":["hip joint","hip"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin words 'coxa' (hip) and 'femur' (thigh bone).","priority":"★★★"},"pronunciation":{"ipa":"/ˌkɒksəˈfɛmərəl/","syllables":"cox-o-fem-o-ral"},"inflection":{},"usage_notes":{"explanation":"'Coxofemoral' is a technical term used in anatomy and medicine to specifically refer to the hip joint, which connects the femur (thigh bone) to the coxal bone (hip bone). It is often used in the context of medical conditions, injuries, or anatomical descriptions related to this joint.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The coxofemoral is located in the knee.","correct":"✓ The coxofemoral joint is located in the hip.","note":"The coxofemoral joint is in the hip, not the knee."}],"priority":"★★☆"},"related_words":{"derivatives":["coxa","femur"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'coxofemoral' is a specialized anatomical term primarily used in medical and scientific contexts. Understanding its meaning requires knowledge of Latin roots ('coxa' for hip, 'femur' for thigh bone) and a familiarity with anatomical terminology. Due to its specific usage, it is not commonly encountered in general language.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor examined the patient's coxofemoral region for signs of injury.","translation":"医師は、患者の股関節領域を診察し、怪我の兆候がないか確認しました。","type":"general","meaning_category":"股関節の"},{"sentence":"Coxofemoral dysplasia can lead to early-onset arthritis.","translation":"股関節形成不全は、早期発症の関節炎につながる可能性があります。","type":"medical","meaning_category":"股関節の"}]}