{"word":"Antwerp","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"アントウェルペン (ベルギーの都市)","english_definition":"A major city in Belgium, known for its diamond trade and port.","examples":[{"sentence":"Antwerp is a vibrant city with a rich history.","translation":"アントウェルペンは豊かな歴史を持つ活気のある都市です。"},{"sentence":"The port of Antwerp is one of the largest in Europe.","translation":"アントウェルペンの港はヨーロッパ最大級です。"}],"collocations":["Port of Antwerp","Antwerp diamond district","Visit Antwerp","Antwerp Central Station"],"synonyms":["Antwerpen (Dutch)","Anvers (French)"],"antonyms":[]}],"etymology":{"value":"The name 'Antwerp' is believed to come from the Dutch 'aan het werp' meaning 'at the wharf'.  A folk etymology connects it to the legend of Silvius Brabo, who threw the hand of a giant into the Scheldt river, hence 'hand werpen' (hand throwing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈæntwɜːrp/","syllables":"Ant-werp"},"inflection":{"notes":"Proper noun, no plural form."},"usage_notes":{"explanation":"Antwerp is a significant city in Belgium, known for its diamond industry and its large port. It's a popular tourist destination with historical architecture and a vibrant cultural scene. The name is often used in geographical contexts or when discussing trade and industry in Belgium.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am going to Antwerps.","correct":"✓ I am going to Antwerp.","note":"Antwerp is a proper noun and does not take a plural form when referring to the city itself."},{"incorrect":"✗ Antwerp is in Netherlands.","correct":"✓ Antwerp is in Belgium.","note":"Antwerp is located in Belgium, not the Netherlands."}],"priority":"★★☆"},"related_words":{"derivatives":["Antwerpian (adjective/noun: relating to Antwerp or a resident of Antwerp)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but commonly used in geographical or economic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Antwerp' is a proper noun referring to a specific city in Belgium. It is generally encountered in contexts related to geography, travel, or economics, particularly concerning the diamond trade or European ports. Understanding the term implies a general knowledge of European geography and trade centers."},"example_sentences":[{"sentence":"We took a train from Brussels to Antwerp.","translation":"私たちはブリュッセルからアントウェルペンまで電車で行きました。","type":"noun","meaning_category":"City"},{"sentence":"Antwerp's diamond district is world-renowned.","translation":"アントウェルペンのダイヤモンド街は世界的に有名です。","type":"noun","meaning_category":"City"},{"sentence":"The art museum in Antwerp has an impressive collection of Flemish paintings.","translation":"アントウェルペンの美術館には、フランドル絵画の印象的なコレクションがあります。","type":"noun","meaning_category":"City"}]}