{"word":"Neo-Kantianism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"新カント主義","english_definition":"A philosophical movement that arose in Germany in the mid-19th century, which sought to return to the philosophy of Immanuel Kant and to emphasize the importance of critical philosophy.","examples":[{"sentence":"Neo-Kantianism influenced many areas of philosophy, including epistemology, ethics, and aesthetics.","translation":"新カント主義は、認識論、倫理学、美学など、哲学の多くの分野に影響を与えた。"}],"collocations":["Neo-Kantian ethics","Neo-Kantian epistemology","Marburg School of Neo-Kantianism","Baden School of Neo-Kantianism"],"synonyms":["Kantian revival","Critical idealism"],"antonyms":["Positivism","Materialism"]}],"etymology":{"value":"Formed from \"Neo-\" (meaning \"new\" or \"revived\") + \"Kantianism\" (referring to the philosophy of Immanuel Kant).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌniːoʊˈkæntiənɪzəm/","syllables":"Ne-o-Kan-ti-an-ism"},"inflection":{"noun_plural":"Neo-Kantianisms"},"usage_notes":{"explanation":"Neo-Kantianism represents a diverse set of philosophical approaches that sought to revitalize Kant's philosophy in response to the perceived failures of Hegelian idealism and materialism. Key themes include a focus on epistemology, the transcendental conditions of knowledge, and the role of values in shaping our understanding of the world. Different schools of Neo-Kantianism, such as the Marburg School and the Baden School, emphasized different aspects of Kant's thought.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Neo-Kantism is a person.","correct":"✓ Neo-Kantianism is a philosophical movement.","note":"Neo-Kantianism is a philosophical movement, not a person."}],"priority":"★★☆"},"related_words":{"derivatives":["Neo-Kantian (adjective, noun)","Kantian (adjective, noun)","Kant (proper noun)"],"related_concepts":["Transcendental idealism","Epistemology","Ethics","Aesthetics","Critical philosophy"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Neo-Kantianism is a complex philosophical term referring to a 19th-century movement that aimed to revive and reinterpret the philosophy of Immanuel Kant. Understanding it requires familiarity with Kant's original ideas and the historical context of philosophical debates in Germany during that period. It is a term typically encountered in academic philosophy and intellectual history. "},"example_sentences":[{"sentence":"The rise of Neo-Kantianism marked a shift away from speculative metaphysics towards a more critical and epistemological approach.","translation":"新カント主義の台頭は、思弁的な形而上学から、より批判的で認識論的なアプローチへの転換を示した。","type":"general"},{"sentence":"Hermann Cohen was a prominent figure in the Marburg School of Neo-Kantianism.","translation":"ヘルマン・コーエンは、マールブルク学派の新カント主義の著名な人物であった。","type":"specific"}]}