{"word":"Alodialism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史)完全所有権、封建的義務を伴わない土地所有制度","english_definition":"(historical) A system of land ownership where land is held absolutely, without any feudal obligations or service to an overlord.","examples":[{"sentence":"Alodialism was rare in medieval Europe, where most land was held under feudal tenure.","translation":"中世ヨーロッパでは、ほとんどの土地が封建的保有の下にあったため、完全所有権はまれであった。"},{"sentence":"In countries with alodial systems, landowners have complete control over their property.","translation":"完全所有権制度を持つ国では、土地所有者は自分の財産を完全に管理できる。"}],"collocations":["alodial tenure","alodial land","alodial owner","establish alodialism","abolish alodialism"],"synonyms":["freehold","fee simple","absolute ownership"],"antonyms":["feudalism","tenure","leasehold"]}],"etymology":{"value":"Derived from the Medieval Latin word \"alodium,\" meaning \"freehold estate.\" The term \"alodium\" is of Germanic origin, from \"all-od,\" meaning \"complete property.\"","priority":"★★☆"},"pronunciation":{"ipa":"/əˈloʊdiəlɪzəm/","syllables":"a-lo-di-al-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Alodialism refers to a system of land ownership where the land is held absolutely, without any obligation of feudal service or fealty to an overlord. This contrasts with feudalism, where land is held in return for service to a superior. Alodialism is relatively rare historically, but it exists in some modern jurisdictions. The term is primarily used in historical and legal contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Alodialism is the same as feudalism.","correct":"✓ Alodialism is the opposite of feudalism.","note":"Alodialism and feudalism are contrasting systems of land ownership. Alodialism involves absolute ownership, while feudalism involves land tenure in exchange for service."},{"incorrect":"✗ Alodialism only exists today.","correct":"✓ Alodialism is a historical system that still exists in some modern jurisdictions.","note":"Alodialism is primarily a historical concept, but it continues to exist in some places today."}],"priority":"★☆☆"},"related_words":{"derivatives":["alodial (adjective: relating to alodium)","alodium (noun: land held in absolute ownership)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Very low frequency. Primarily used in legal and historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Alodialism' is a specialized term primarily used in legal and historical contexts to describe a system of land ownership where the land is held absolutely, without any feudal obligations. Understanding this term requires familiarity with historical land tenure systems and legal concepts of property ownership."},"example_sentences":[{"sentence":"The transition from feudalism to alodialism empowered landowners.","translation":"封建制度から完全所有権制度への移行は、土地所有者に権限を与えた。","type":"noun","meaning_category":"完全所有権制度"},{"sentence":"Alodialism ensured that landowners were not subject to the whims of a feudal lord.","translation":"完全所有権制度は、土地所有者が封建領主の気まぐれに左右されないことを保証した。","type":"noun","meaning_category":"完全所有権制度"}]}