{"word":"Chantilly","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"シャンティイ（フランスの都市）","english_definition":"A town in the Oise department in northern France. It is known for its château, racecourse, and cream.","examples":[{"sentence":"We visited Chantilly during our trip to France.","translation":"私たちはフランス旅行中にシャンティイを訪れました。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"シャンティイ（レース）","english_definition":"A type of delicate bobbin lace originally made in Chantilly, France.","examples":[{"sentence":"The bride's veil was made of Chantilly lace.","translation":"花嫁のベールはシャンティイレースで作られていました。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"シャンティイ（クリーム）","english_definition":"Whipped cream sweetened with sugar and flavored with vanilla.","examples":[{"sentence":"The cake was topped with Chantilly cream and strawberries.","translation":"ケーキの上にはシャンティイクリームとイチゴが乗っていました。"}],"collocations":[],"synonyms":["whipped cream"],"antonyms":[]}],"etymology":{"value":"Named after the town of Chantilly, France.","priority":"★★★"},"pronunciation":{"ipa":"/ʃænˈtɪli/","syllables":"Shan-til-ly"},"inflection":{"noun_plural":"Chantillys (when referring to types of lace or cream)"},"usage_notes":{"explanation":"'Chantilly' can refer to a town in France, a type of delicate lace, or sweetened whipped cream. The context usually makes it clear which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I want a Chantilly on my coffee.","correct":"✓ I want Chantilly cream on my coffee.","note":"To avoid ambiguity, specify 'Chantilly cream' when referring to the whipped cream."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Chantilly' is a word with multiple meanings, all related to the town of Chantilly in France. It can refer to the town itself, a type of lace made there, or a specific type of sweetened whipped cream. Understanding the context is crucial to interpreting the intended meaning. The word is more commonly encountered in culinary or fashion contexts."},"example_sentences":[{"sentence":"The Château de Chantilly is a beautiful historical site.","translation":"シャンティイ城は美しい史跡です。","type":"noun","meaning_category":"town"},{"sentence":"Her dress was adorned with exquisite Chantilly lace.","translation":"彼女のドレスは精巧なシャンティイレースで飾られていました。","type":"noun","meaning_category":"lace"},{"sentence":"Would you like Chantilly cream with your dessert?","translation":"デザートにシャンティイクリームはいかがですか？","type":"noun","meaning_category":"cream"}]}