{"word":"Carbohydrase","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"炭水化物分解酵素","english_definition":"An enzyme that catalyzes the hydrolysis of carbohydrates into smaller sugars.","examples":[{"sentence":"Amylase is a type of carbohydrase that breaks down starch.","translation":"アミラーゼはデンプンを分解する炭水化物分解酵素の一種です。"},{"sentence":"Carbohydrases are essential for the digestion of carbohydrates in the body.","translation":"炭水化物分解酵素は体内の炭水化物の消化に不可欠です。"}],"collocations":["amylase","cellulase","digestive enzymes","hydrolysis of carbohydrates"],"synonyms":["amylase","cellulase","pectinase","glycosidase"],"antonyms":[]}],"etymology":{"value":"The word 'carbohydrase' is derived from 'carbohydrate' (referring to the substance it acts upon) and '-ase' (a suffix used to denote an enzyme).","priority":"★★★"},"pronunciation":{"ipa":"/ˌkɑːrboʊˈhaɪdreɪz/","syllables":"car-bo-hy-drase"},"inflection":{"noun_plural":"carbohydrases"},"usage_notes":{"explanation":"'Carbohydrase' refers to a class of enzymes rather than a single enzyme. Different types of carbohydrases act on different types of carbohydrates (e.g., starch, cellulose, lactose).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Carbohydrase is a carbohydrate.","correct":"✓ Carbohydrase is an enzyme that breaks down carbohydrates.","note":"Carbohydrase is an enzyme, not a type of carbohydrate."}],"priority":"★★☆"},"related_words":{"derivatives":["carbohydrate","enzyme","amylase","cellulase","hydrolysis"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Carbohydrase' is a technical term used in biology and biochemistry to describe enzymes that break down carbohydrates. It's not a common word in everyday conversation but is important in the context of digestion, nutrition, and enzyme function. Understanding the role of carbohydrases is useful for understanding how the body processes sugars and starches.","note":"This word is typically encountered in scientific or academic contexts."},"example_sentences":[{"sentence":"The activity of carbohydrase in the saliva begins the process of starch digestion.","translation":"唾液中の炭水化物分解酵素の活性は、デンプン消化のプロセスを開始します。","type":"scientific","meaning_category":"enzyme function"},{"sentence":"Different types of carbohydrase are required to break down various complex carbohydrates.","translation":"さまざまな種類の複雑な炭水化物を分解するには、異なる種類の炭水化物分解酵素が必要です。","type":"scientific","meaning_category":"enzyme types"},{"sentence":"Some individuals may lack certain carbohydrase enzymes, leading to digestive issues.","translation":"一部の人は特定の炭水化物分解酵素が不足している可能性があり、消化器系の問題につながる可能性があります。","type":"medical","meaning_category":"medical condition"}]}