{"word":"scomm","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(slang, Internet) A social media or online community manager; someone who manages a company's or organization's social media presence.","english_definition":"A social media or online community manager.","examples":[{"sentence":"The scomm team is responsible for creating engaging content.","translation":"ソーシャルメディアチームは、魅力的なコンテンツを作成する責任があります。"},{"sentence":"Our scomm is doing a great job increasing brand awareness.","translation":"うちのソーシャルメディア担当者は、ブランド認知度を高めるのに素晴らしい仕事をしている。"}],"collocations":["scomm manager","scomm team","hire a scomm","scomm strategy"],"synonyms":["social media manager","community manager","online marketing specialist"],"antonyms":[]}],"etymology":{"value":"Shortening of 'social media communications manager' or 'social media community manager'.","priority":"★★☆"},"pronunciation":{"ipa":"/skɒm/","syllables":"scomm"},"inflection":{"noun_plural":"scomms"},"usage_notes":{"explanation":"\"scomm\" is a slang term primarily used within the marketing and social media industries. It's a shortened, informal way to refer to a social media or community manager. It's not typically used in formal writing or outside of these specific professional circles.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The scomm is responsible of all social media.","correct":"✓ The scomm is responsible for all social media.","note":"Use 'responsible for' instead of 'responsible of'."},{"incorrect":"✗ I'm looking for a job as scomm.","correct":"✓ I'm looking for a job as a scomm.","note":"Use the indefinite article 'a' before 'scomm' when referring to a single person in that role."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["social media","community management","digital marketing","content creation"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Slang, not typically included in CEFR)","frequency_google_ngram":"Low frequency - primarily used within specific professional circles.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Scomm\" is a slang term, primarily used within the marketing and social media industries, to refer to a social media or community manager. Due to its informal nature and limited usage, it's more likely to be encountered by those working in or closely following these fields. Understanding requires familiarity with industry jargon and abbreviations."},"example_sentences":[{"sentence":"Our company's scomm is actively engaging with customers on Twitter.","translation":"当社のソーシャルメディア担当者は、Twitterで積極的に顧客と交流しています。","type":"noun","meaning_category":"Social Media Manager"},{"sentence":"The scomm presented a new social media strategy to the marketing team.","translation":"ソーシャルメディア担当者は、マーケティングチームに新しいソーシャルメディア戦略を提示しました。","type":"noun","meaning_category":"Social Media Manager"}]}