{"word":"outwardly-driven","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"外的な要因によって動機づけられる、外発的な動機を持つ","english_definition":"motivated by external factors or rewards, rather than internal desires or values.","examples":[{"sentence":"He is outwardly-driven, always seeking recognition and praise from others.","translation":"彼は外発的な動機を持っており、常に他人からの承認や賞賛を求めている。"},{"sentence":"The company's culture is highly competitive, attracting outwardly-driven individuals who thrive on achieving targets and bonuses.","translation":"その会社の文化は非常に競争的であり、目標達成やボーナスで成功する外発的な動機を持つ人々を引き付けている。"},{"sentence":"While she appears confident, her actions are often outwardly-driven by a need for validation.","translation":"彼女は自信があるように見えるが、彼女の行動はしばしば承認欲求によって外発的に動機づけられている。"}],"collocations":["outwardly-driven behavior (外発的な行動)","outwardly-driven motivation (外発的な動機)","outwardly-driven individual (外発的な動機を持つ人)","outwardly-driven goals (外発的な目標)"],"synonyms":["externally motivated","reward-driven","achievement-oriented (in some contexts)","extrinsic"],"antonyms":["inwardly-driven","intrinsically motivated","self-motivated"],"notes":"This term is often used in psychology and business contexts to describe individuals whose actions are primarily influenced by external rewards or pressures, such as money, recognition, or status."}],"etymology":{"value":"Combination of 'outwardly' (externally) and 'driven' (motivated).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈaʊtwərdli ˈdrɪvən/","syllables":"out-ward-ly driv-en"},"inflection":{"notes":"Adjectives do not typically inflect in English, although they can be modified by adverbs (e.g., 'very outwardly-driven')."},"usage_notes":{"explanation":"'Outwardly-driven' describes someone whose behavior is primarily motivated by external rewards or pressures. This contrasts with 'inwardly-driven' or 'intrinsically motivated' individuals, who are motivated by internal desires or values. The term can have both positive and negative connotations, depending on the context. In some cases, it may suggest a focus on achievement and success, while in others, it may imply a lack of genuine passion or self-direction.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a very outwardly person.","correct":"✓ He is a very outwardly-driven person.","note":"'Outwardly' is an adverb, so it needs to be combined with 'driven' to form the adjective 'outwardly-driven' to describe a person. Using 'outwardly' alone to describe a person is grammatically incorrect."},{"incorrect":"✗ She is outwardly driven by her inner desires.","correct":"✓ She is outwardly driven by external rewards.","note":"The core concept of 'outwardly-driven' is motivation from external sources. If the motivation is from inner desires, it would be 'inwardly-driven' or 'intrinsically motivated'."}],"priority":"★★☆"},"related_words":{"derivatives":["outwardly (adverb)","driven (adjective)","motivation (noun)","extrinsic motivation (noun)"],"related_concepts":["extrinsic rewards","incentives","performance-based pay","recognition","status","validation"],"priority":"★★☆"},"level_frequency":{"notes":"This term is more common in specialized contexts such as psychology, business, and self-help literature. It is not a very common word in everyday conversation.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Outwardly-driven' is a term used to describe someone whose actions and behaviors are primarily motivated by external rewards or pressures, such as money, recognition, or status. It's often used in contrast to 'inwardly-driven' or 'intrinsically motivated,' which describes someone whose actions are driven by internal desires or values. The term is most commonly found in discussions of psychology, business, or personal development."},"example_sentences":[{"sentence":"The sales team was composed of outwardly-driven individuals who were highly motivated by commissions.","translation":"その営業チームは、コミッションによって非常に意欲を高められた外発的な動機を持つ人々で構成されていた。","type":"adjective","meaning_category":"外的な要因によって動機づけられる"},{"sentence":"She realized that her career choices had been outwardly-driven, and she decided to pursue her true passions.","translation":"彼女は自分のキャリアの選択が外発的な動機によるものだったことに気づき、自分の本当の情熱を追求することに決めた。","type":"adjective","meaning_category":"外的な要因によって動機づけられる"},{"sentence":"The company's reward system inadvertently created an environment where employees were more outwardly-driven than focused on quality.","translation":"その会社の報酬システムは、意図せずに、従業員が品質よりも外発的な動機に焦点を当てる環境を作り出してしまった。","type":"adjective","meaning_category":"外的な要因によって動機づけられる"}]}