{"word":"rust-complexioned","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"赤褐色の顔色の、赤茶けた肌の","english_definition":"Having a complexion or skin tone that is reddish-brown, resembling the color of rust.","examples":[{"sentence":"The old sailor had a rust-complexioned face, weathered by years at sea.","translation":"その老船員は、長年の航海で風化した赤褐色の顔色をしていた。"},{"sentence":"Her rust-complexioned skin was a testament to her time spent working outdoors.","translation":"彼女の赤茶けた肌は、屋外での仕事に費やした時間の証だった。"}],"collocations":["rust-complexioned face","rust-complexioned skin","a person with a rust-complexioned appearance"],"synonyms":["ruddy","reddish-brown","weather-beaten","sun-kissed","bronzed"],"antonyms":["pale","fair-skinned","light-complexioned"]},{"part_of_speech":"adjective","definition":"（比喩的に）古びた、時代遅れの、錆び付いたような","english_definition":"(Figurative) Having a worn, aged, or antiquated appearance or quality.","examples":[{"sentence":"His rust-complexioned ideas were out of touch with the modern world.","translation":"彼の古びた考えは、現代社会とはかけ離れていた。"},{"sentence":"The rust-complexioned building stood as a reminder of a bygone era.","translation":"その古びた建物は、過ぎ去った時代を思い起こさせるものとして立っていた。"}],"collocations":["rust-complexioned ideas","rust-complexioned building","a rust-complexioned view of the world"],"synonyms":["antiquated","outdated","obsolete","stale","worn-out"],"antonyms":["modern","contemporary","fresh","innovative"]}],"etymology":{"value":"The term is a compound adjective formed by combining 'rust' (referring to the reddish-brown color of iron oxide) with 'complexioned' (referring to the color and appearance of the skin). It directly describes a skin tone resembling the color of rust.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌrʌst kəmˈplɛkʃənd/","syllables":"rust-com-plex-ioned"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are less common for compound adjectives like this one. More often, 'more rust-complexioned' or 'most rust-complexioned' would be used, though these are rare."},"usage_notes":{"explanation":"'Rust-complexioned' is a descriptive adjective used to characterize a person's skin tone. It suggests a reddish-brown hue, often associated with exposure to the sun or outdoor elements. The term can also be used figuratively to describe something that appears old, worn, or outdated, similar to the appearance of rust on metal. It is relatively uncommon in modern usage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a rust complexion.","correct":"✓ He has a rust-complexioned face.","note":"While 'rust complexion' might be understood, 'rust-complexioned' is the more common and grammatically correct adjectival form. It's often used to describe a specific feature like 'face' or 'skin' rather than the general concept of complexion."},{"incorrect":"✗ The building was rust-complexion.","correct":"✓ The building was rust-complexioned.","note":"As an adjective, it should be 'rust-complexioned' to properly modify the noun."}],"priority":"★★☆"},"related_words":{"derivatives":["complexion (noun)","rust (noun)"],"phrases":["weather-beaten","sun-kissed","ruddy-faced"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Uncommon)","frequency_google_ngram":"Low frequency - The term is not commonly used in contemporary English.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Rust-complexioned' is a relatively uncommon and descriptive adjective used to describe a reddish-brown skin tone reminiscent of rust. It is often used in literature or descriptive writing to evoke a specific image of a person's appearance, particularly one who spends a lot of time outdoors. The figurative use of the term, to describe something as old or outdated, is even less common and requires a strong understanding of metaphorical language."},"example_sentences":[{"sentence":"The desert nomad's face was rust-complexioned from years of exposure to the harsh sun.","translation":"その砂漠の遊牧民の顔は、長年過酷な太陽にさらされて赤茶けていた。","type":"adjective","meaning_category":"赤褐色の顔色の"},{"sentence":"The critic dismissed the play as having rust-complexioned themes that were no longer relevant.","translation":"評論家はその劇を、もはや時代遅れとなった古びたテーマを持っているとして一蹴した。","type":"adjective","meaning_category":"古びた、時代遅れの"}]}