{"word":"document-oriented","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"ドキュメント指向の","english_definition":"Designed or structured around documents, especially in the context of databases or programming.","examples":[{"sentence":"This database is document-oriented, making it suitable for storing unstructured data.","translation":"このデータベースはドキュメント指向であり、非構造化データの保存に適しています。"},{"sentence":"We chose a document-oriented database because it offers more flexibility than a relational database.","translation":"リレーショナルデータベースよりも柔軟性があるため、ドキュメント指向データベースを選択しました。"},{"sentence":"The application uses a document-oriented approach to manage its configuration files.","translation":"このアプリケーションは、構成ファイルを管理するためにドキュメント指向のアプローチを使用しています。"}],"collocations":["document-oriented database","document-oriented architecture","document-oriented programming"],"synonyms":["schemaless","non-relational"],"antonyms":["relational","schema-based"]},{"part_of_speech":"adjective","definition":"文書中心の、書類重視の","english_definition":"Focusing on documents or paperwork, often in an organizational or bureaucratic context.","examples":[{"sentence":"The process is very document-oriented, requiring multiple forms to be filled out.","translation":"そのプロセスは非常に文書中心であり、複数のフォームに記入する必要があります。"},{"sentence":"The company has a document-oriented culture, with a strong emphasis on record-keeping.","translation":"その会社は文書中心の文化を持ち、記録管理を重視しています。"},{"sentence":"The system is document-oriented, so all information must be submitted in writing.","translation":"このシステムは文書中心であるため、すべての情報は書面で提出する必要があります。"}],"collocations":["document-oriented process","document-oriented system","document-oriented culture"],"synonyms":["paper-based","formal","bureaucratic"],"antonyms":["informal","streamlined"]}],"etymology":{"value":"Combination of 'document' and 'oriented'. 'Document' comes from Latin 'documentum' meaning 'lesson, proof, or example'. 'Oriented' comes from 'orient', meaning to face or be directed toward. Therefore, 'document-oriented' means directed or focused on documents.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɒkjʊˌmɛnt ˈɔːriəntɪd/","syllables":"doc-u-ment-o-ri-en-ted"},"inflection":{},"usage_notes":{"explanation":"'Document-oriented' can have two main meanings. In the context of databases and programming, it refers to systems that store data as documents (e.g., JSON or XML) rather than in rows and columns like relational databases. In a more general organizational context, it describes processes or cultures that heavily rely on documents and paperwork. The specific meaning depends on the context in which it is used.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is oriented document.","correct":"✓ The company is document-oriented.","note":"The correct word order is 'document-oriented' as a compound adjective."},{"incorrect":"✗ Document oriented database are good for unstructured data.","correct":"✓ Document-oriented databases are good for unstructured data.","note":"Make sure to use the correct plural form 'databases' and the correct adjective form 'document-oriented'."}],"priority":"★★☆"},"related_words":{"derivatives":["document","orientation","oriented"],"phrasal_verbs":[],"related_terms":["NoSQL","JSON","XML","database","schema","relational database"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Document-oriented' is a term used to describe systems or approaches that prioritize documents. It's commonly used in the context of databases, where it refers to databases that store data in document formats like JSON or XML, rather than in tables like traditional relational databases. It can also describe organizational processes that heavily rely on paperwork. Understanding the context is key to interpreting the meaning correctly."},"example_sentences":[{"sentence":"MongoDB is a popular document-oriented database.","translation":"MongoDBは人気のあるドキュメント指向データベースです。","type":"technical","meaning_category":"database"},{"sentence":"The government agency has a very document-oriented process for approving permits.","translation":"その政府機関は、許可を承認するための非常に文書中心のプロセスを持っています。","type":"organizational","meaning_category":"process"},{"sentence":"Document-oriented databases are often used for content management systems.","translation":"ドキュメント指向データベースは、コンテンツ管理システムでよく使用されます。","type":"technical","meaning_category":"database"},{"sentence":"The new system aims to be less document-oriented and more streamlined.","translation":"新しいシステムは、文書中心ではなく、より合理化されることを目指しています。","type":"organizational","meaning_category":"process"}]}