{"word":"recoverability","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"回復可能性、復旧可能性、回収可能性","english_definition":"The ability to recover or be recovered; the extent to which something can be restored to its original condition or value.","examples":[{"sentence":"The recoverability of the data after the system crash was uncertain.","translation":"システムクラッシュ後のデータの回復可能性は不確かだった。"},{"sentence":"The insurance policy covers the recoverability of lost assets.","translation":"その保険契約は、失われた資産の回収可能性をカバーしている。"},{"sentence":"The recoverability of the endangered species is a major concern for conservationists.","translation":"絶滅危惧種の回復可能性は、自然保護活動家にとって大きな懸念事項である。"}],"collocations":["data recoverability (データ回復可能性)","asset recoverability (資産回収可能性)","system recoverability (システム復旧可能性)","high recoverability (高い回復可能性)","poor recoverability (低い回復可能性)"],"synonyms":["restorability","retrievability","reclaimability","salvageability"],"antonyms":["irrecoverability","unrecoverability"]}],"etymology":{"value":"The word is formed by combining the verb 'recover' with the suffix '-ability', which indicates the capacity or capability of something.","priority":"★★★"},"pronunciation":{"ipa":"/rɪˌkʌvərəˈbɪləti/","syllables":"ri-cov-er-a-bil-i-ty"},"inflection":{"noun_plural":"recoverabilities"},"usage_notes":{"explanation":"'Recoverability' is a noun that refers to the degree to which something can be recovered, restored, or retrieved. It is often used in technical contexts, such as data management, disaster recovery, and financial planning. The term implies an assessment of the likelihood and feasibility of regaining something that has been lost, damaged, or compromised.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The recoverability is good.","correct":"✓ The recoverability of the system is good.","note":"It's important to specify what is being recovered. Use 'recoverability of X' to be clear."},{"incorrect":"✗ Recoverability is important to recover data.","correct":"✓ Recoverability is important for recovering data.","note":"The correct preposition to use with 'important' in this context is 'for'."}],"priority":"★★☆"},"related_words":{"derivatives":["recover (verb)","recoverable (adjective)","recovery (noun)"],"phrasal_verbs":[],"related_concepts":["resilience","fault tolerance","backup and restore","disaster recovery planning"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in technical and specialized contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Recoverability' is a more advanced term used to describe how easily something can be brought back to its original state after being lost, damaged, or compromised. It's often used in technical fields like IT (data recoverability) or finance (asset recoverability). If something has high recoverability, it means it's relatively easy to restore it. If it has low recoverability, it's difficult or impossible to restore. This word is more common in formal or technical writing and speech."},"example_sentences":[{"sentence":"The company invested heavily in improving the data recoverability of its servers.","translation":"その会社は、サーバーのデータ回復可能性を向上させるために多額の投資を行った。","type":"general","meaning_category":"Data Management"},{"sentence":"The bank assessed the asset recoverability in case of a market downturn.","translation":"銀行は、市場の低迷が発生した場合の資産回収可能性を評価した。","type":"financial","meaning_category":"Financial Planning"},{"sentence":"The disaster recovery plan outlined the steps needed to ensure system recoverability.","translation":"災害復旧計画は、システムの復旧可能性を確保するために必要な手順を概説した。","type":"technical","meaning_category":"Disaster Recovery"}]}