{"word":"Edwardianism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"エドワード朝様式、エドワード朝趣味","english_definition":"The styles, manners, and social attitudes prevalent during the reign of King Edward VII of the United Kingdom (1901–1910).","examples":[{"sentence":"The play was set in the era of Edwardianism, with lavish costumes and decor.","translation":"その劇はエドワード朝様式時代を舞台にしており、豪華な衣装と装飾が施されていた。"},{"sentence":"Edwardianism was characterized by a sense of optimism and elegance.","translation":"エドワード朝様式は、楽観主義と優雅さによって特徴づけられた。"}],"collocations":["Edwardian era","Edwardian architecture","Edwardian fashion","Edwardian society"],"synonyms":["Edwardian era","Edwardian period"],"antonyms":[]},{"part_of_speech":"noun","definition":"エドワード朝時代の思想や価値観","english_definition":"The ideology, values, and cultural norms associated with the Edwardian era.","examples":[{"sentence":"Edwardianism reflected a shift from Victorian morality to a more relaxed and modern outlook.","translation":"エドワード朝様式は、ヴィクトリア朝の道徳から、よりリラックスした近代的な見方への移行を反映していた。"}],"collocations":["social Edwardianism","political Edwardianism","cultural Edwardianism"],"synonyms":["Edwardian values","Edwardian ideals"],"antonyms":[]}],"etymology":{"value":"From 'Edwardian' (of or relating to the reign of King Edward VII) + '-ism' (a suffix denoting a distinctive practice, system, or philosophy).","priority":"★★★"},"pronunciation":{"ipa":"/ɛˌdwɔrdiˈənɪzəm/","syllables":"Ed-ward-i-an-ism"},"inflection":{"noun_plural":"Edwardianisms"},"usage_notes":{"explanation":"'Edwardianism' refers to the characteristics of British society and culture during the reign of King Edward VII (1901-1910). It encompasses art, architecture, fashion, social customs, and political attitudes of the time. The term often evokes images of elegance, opulence, and a sense of optimism that contrasted with the more rigid Victorian era that preceded it.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Edwardianism was a person.","correct":"✓ Edwardianism was a period.","note":"Edwardianism refers to a period or a style, not a person."}],"priority":"★★☆"},"related_words":{"derivatives":["Edwardian (adjective, noun)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Edwardianism' is a term used to describe the characteristics of the Edwardian era in British history, specifically during the reign of King Edward VII. It encompasses the art, architecture, fashion, and social and political norms of that time. Understanding the term requires knowledge of British history and culture from the early 20th century."},"example_sentences":[{"sentence":"The novel captured the essence of Edwardianism with its portrayal of upper-class society.","translation":"その小説は、上流社会の描写によって、エドワード朝様式の本質を捉えた。","type":"noun","meaning_category":"Style and Manners"},{"sentence":"The architecture of the building is a prime example of Edwardianism.","translation":"その建物の建築は、エドワード朝様式の代表的な例である。","type":"noun","meaning_category":"Style and Manners"}]}