{"word":"machinery-intensive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"機械集約的な、機械化された","english_definition":"Characterized by a high level of investment in, and use of, machinery, especially in relation to labor.","examples":[{"sentence":"The farm is machinery-intensive, requiring only a few workers to manage a large area.","translation":"その農場は機械集約的で、広い面積を管理するのに少数の労働者しか必要としない。"},{"sentence":"The mining industry has become increasingly machinery-intensive over the past few decades.","translation":"鉱業は過去数十年にわたり、ますます機械集約的になっている。"},{"sentence":"A machinery-intensive approach can increase productivity but may also lead to job displacement.","translation":"機械集約的なアプローチは生産性を向上させる可能性があるが、失業につながる可能性もある。"}],"collocations":["machinery-intensive agriculture (機械集約型農業)","machinery-intensive industry (機械集約型産業)","machinery-intensive production (機械集約型生産)","become machinery-intensive (機械集約的になる)"],"synonyms":["mechanized","automated","capital-intensive (in some contexts)"],"antonyms":["labor-intensive","manual","hand-operated"]}],"etymology":{"value":"The word is formed by combining 'machinery' (machines collectively) with 'intensive' (involving a great deal of effort or resources).","priority":"★★☆"},"pronunciation":{"ipa":"/məˈʃiːnəri ɪnˈtɛnsɪv/","syllables":"ma-chin-er-y in-ten-sive"},"inflection":{"notes":"This is an adjective and does not have inflections for number or gender."},"usage_notes":{"explanation":"'Machinery-intensive' describes a process or industry that relies heavily on machines to perform tasks. It implies a significant investment in equipment and technology to increase efficiency and output. This term is often used in contrast to 'labor-intensive', where human effort is the primary input.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The factory is very machinery.","correct":"✓ The factory is very machinery-intensive.","note":"'Machinery' is a noun. Use the adjective 'machinery-intensive' to describe something that uses a lot of machinery."},{"incorrect":"✗ The machinery-intensive is good for the economy.","correct":"✓ Machinery-intensive industries are good for the economy.","note":"'Machinery-intensive' is an adjective and needs to modify a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["machinery (noun)","intensive (adjective)","intensively (adverb)"],"phrases":["capital-intensive","technology-intensive"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. Used primarily in specialized or technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Machinery-intensive' describes a situation where a lot of machines are used to do work, often instead of people. It's used in discussions about industries, farming, or manufacturing where technology plays a big role. The word suggests that a significant amount of money has been invested in equipment. It's a more technical term, so you'll likely encounter it in articles or discussions about economics, technology, or industrial processes."},"example_sentences":[{"sentence":"Modern agriculture is highly machinery-intensive, allowing farmers to cultivate vast fields with minimal manual labor.","translation":"現代農業は高度に機械集約的であり、農家は最小限の手作業で広大な畑を耕作できる。","type":"general","meaning_category":"general"},{"sentence":"The transition to machinery-intensive production has significantly increased the factory's output.","translation":"機械集約型生産への移行により、工場の生産量は大幅に増加した。","type":"economic","meaning_category":"economic"},{"sentence":"While machinery-intensive methods improve efficiency, they also raise concerns about environmental impact and energy consumption.","translation":"機械集約的な方法は効率を向上させる一方で、環境への影響とエネルギー消費に関する懸念も高める。","type":"environmental","meaning_category":"environmental"}]}