{"word":"chokeweed","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A common name for various plants that can obstruct or choke other plants, or are toxic to livestock.","english_definition":"A common name for various plants that can obstruct or choke other plants, or are toxic to livestock.","examples":[{"sentence":"The farmer spent the morning pulling chokeweed from the pasture to protect his cattle.","translation":"農夫は牛を守るために、牧草地からチョークウィードを引き抜くのに午前中を費やした。"},{"sentence":"Chokeweed can quickly take over a garden if not properly managed.","translation":"チョークウィードは適切に管理しないと、すぐに庭を占拠してしまう可能性がある。"}],"collocations":["pull chokeweed","remove chokeweed","control chokeweed","pasture chokeweed","garden chokeweed"],"synonyms":["strangler vine","dodder","bindweed","poisonous plant","noxious weed"],"antonyms":[]}],"etymology":{"value":"The name 'chokeweed' is descriptive, referring to the plant's ability to choke or obstruct other plants or animals.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtʃoʊkˌwiːd/","syllables":"choke-weed"},"inflection":{"noun_plural":"chokeweeds"},"usage_notes":{"explanation":"'Chokeweed' is a general term and can refer to different plants depending on the region. It's often used to describe invasive or toxic plants that pose a threat to agriculture or livestock.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I planted chokeweed in my garden because it looks pretty.","correct":"✓ I planted flowers in my garden because they look pretty.","note":"Chokeweed is generally considered a weed, not a desirable plant for gardens."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Chokeweed' is a specific term used to describe plants that can choke out or harm other plants or livestock. It is not a commonly used word, and understanding its meaning requires some knowledge of botany or agriculture. The term is often used in rural or agricultural contexts."},"example_sentences":[{"sentence":"The invasive chokeweed threatened the native plant species in the area.","translation":"侵略的なチョークウィードは、その地域の在来植物種を脅かした。","type":"noun","meaning_category":"Plant"},{"sentence":"Farmers must be vigilant in controlling chokeweed to prevent it from harming their crops.","translation":"農家は作物を害するのを防ぐために、チョークウィードの防除に警戒しなければならない。","type":"noun","meaning_category":"Plant"},{"sentence":"Some types of chokeweed are poisonous and can be dangerous if ingested by animals.","translation":"一部の種類のチョークウィードは有毒であり、動物が摂取すると危険な場合がある。","type":"noun","meaning_category":"Plant"}]}