{"word":"reachably","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"到達可能な方法で、手の届く範囲で","english_definition":"In a way that can be reached or attained.","examples":[{"sentence":"The top shelf was reachably arranged, allowing easy access to the items.","translation":"最上段の棚は手が届きやすいように配置されており、アイテムに簡単にアクセスできました。"},{"sentence":"The goal, while ambitious, was reachably set to motivate the team.","translation":"その目標は野心的ではあるものの、チームを鼓舞するために達成可能な範囲で設定されました。"}],"collocations":["reachably arranged","reachably set","reachably located"],"synonyms":["accessibly","attainably","achievably","obtainably"],"antonyms":["unreachably","inaccessibly","unattainably"]}],"etymology":{"value":"The word \"reachably\" is formed by adding the suffix \"-ly\" to the adjective \"reachable.\" \"Reachable\" comes from the verb \"reach\" and the suffix \"-able,\" indicating the ability to be reached.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈriːtʃəbli/","syllables":"reach-a-bly"},"inflection":{"notes":"Adverb, no comparative or superlative forms."},"usage_notes":{"explanation":"\"Reachably\" is used to describe something that can be reached, either physically or metaphorically. It suggests that a goal, object, or place is within the realm of possibility or attainment. It is relatively uncommon compared to its adjective form, \"reachable.\"","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The star was reachably far.","correct":"✓ The star was unreachably far.","note":"\"Reachably far\" is contradictory. If something is far, it is typically not reachable. Use \"unreachably\" in this context."},{"incorrect":"✗ He set the goal reachably. But it was too easy.","correct":"✓ He set the goal at a reachable level. But it was too easy.","note":"While \"reachably\" can modify \"set,\" it's more common and natural to say \"at a reachable level\" or \"within a reachable range.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["reachable (adjective)","reach (verb, noun)","unreachable (adjective)","unreachably (adverb)"],"phrasal_verbs":[],"related_concepts":["accessibility","attainability","feasibility","possibility"]},"level_frequency":{"CEFR":"N/A (Not commonly found in CEFR levels)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'reachably' is an adverb that describes how something can be reached or attained. It's not a very common word, and you're more likely to encounter its adjective form, 'reachable.' It implies that something is within the realm of possibility or accessibility. For example, 'The supplies were reachably placed on the lower shelves' means the supplies were positioned so that they could be easily reached."},"example_sentences":[{"sentence":"The summit was now reachably close, spurring the climbers onward.","translation":"頂上は今や手の届くところまで近づき、登山者たちをさらに奮い立たせた。","type":"adverb","meaning_category":"attainable distance"},{"sentence":"The company's targets were reachably ambitious, designed to stretch but not break the team.","translation":"その会社の目標は、チームを限界まで引き上げるように設計されつつも、達成可能な範囲で野心的に設定された。","type":"adverb","meaning_category":"achievable goal"},{"sentence":"The emergency exits were reachably located throughout the building.","translation":"非常口は建物全体に手が届きやすい場所に設置されていた。","type":"adverb","meaning_category":"accessible location"}]}