{"word":"Unscrupulousnesses","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(plural only) The state or quality of being unscrupulous; lack of moral principles; unprincipled behavior. This is the plural form of an uncountable noun, and is rarely used.","english_definition":"The state or quality of being unscrupulous; lack of moral principles; unprincipled behavior.","examples":[{"sentence":"The unscrupulousnesses of some politicians are shocking.","translation":"一部の政治家の不道徳さは衝撃的です。","note":"This example is grammatically correct but stylistically awkward due to the pluralization of an uncountable noun. A better phrasing might be 'The unscrupulous behavior of some politicians is shocking.' or 'The lack of scruples among some politicians is shocking.'"}],"collocations":["display of unscrupulousnesses","series of unscrupulousnesses"],"synonyms":["dishonesty","immorality","unethicality","lack of scruples","unprincipledness"],"antonyms":["scrupulousness","honesty","integrity","morality"]}],"etymology":{"value":"Derived from 'unscrupulous' (lacking moral principles) + '-ness' (suffix forming a noun denoting a state or quality) + '-es' (plural suffix).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈskruːpjələsnəsɪz/","syllables":"un-scru-pu-lous-ness-es"},"inflection":{"noun_plural":"Unscrupulousnesses (rarely used)"},"usage_notes":{"explanation":"'Unscrupulousness' is typically used as an uncountable noun, referring to the general quality or state of lacking moral principles. The plural form, 'unscrupulousnesses', is grammatically valid but very rarely used. It might be employed to refer to multiple instances or manifestations of unscrupulous behavior, but in most contexts, it's better to rephrase the sentence to avoid the awkward pluralization. For example, instead of saying 'The unscrupulousnesses of the company were revealed,' one could say 'The company's unscrupulous behavior was revealed' or 'The company engaged in multiple instances of unscrupulous behavior.'","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unscrupulousness were evident.","correct":"✓ The unscrupulousness was evident.","note":"'Unscrupulousness' is generally uncountable, so it takes a singular verb. However, this sentence is still less common than using 'unscrupulous behavior' or 'lack of scruples.'"},{"incorrect":"✗ He showed many unscrupulousnesses.","correct":"✓ He showed much unscrupulousness. / ✓ He engaged in many unscrupulous acts.","note":"It's better to use 'much unscrupulousness' (uncountable) or rephrase to use a countable noun like 'acts' or 'deeds.'"}],"priority":"★★☆"},"related_words":{"derivatives":["unscrupulous (adjective)","scrupulousness (noun)","scrupulously (adverb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (due to the rarity of the plural form and the abstract nature of the concept)","frequency_google_ngram":"Very low frequency (the plural form is extremely rare)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unscrupulousnesses' is the plural form of 'unscrupulousness,' which refers to a lack of moral principles. However, the plural form is rarely used in practice. It's more common to use 'unscrupulousness' as an uncountable noun or to rephrase the sentence to use alternative expressions like 'unscrupulous behavior' or 'lack of scruples.' The concept itself is abstract and related to ethics and morality, making it suitable for advanced learners."},"example_sentences":[{"sentence":"The report detailed several instances of the company's unscrupulousnesses.","translation":"その報告書は、同社のいくつかの不道徳な行為の事例を詳述していた。","type":"noun (plural)","meaning_category":"lack of moral principles"},{"sentence":"The unscrupulousnesses displayed by the organization were deeply concerning.","translation":"その組織によって示された不道徳さは深く懸念された。","type":"noun (plural)","meaning_category":"lack of moral principles"},{"sentence":"It is rare to encounter such blatant unscrupulousnesses in the business world.","translation":"ビジネスの世界でこのような露骨な不道徳さに遭遇することは稀である。","type":"noun (plural)","meaning_category":"lack of moral principles"}]}