{"word":"non-prescriptibility","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"記述的であること、規範的でないこと。言語学において、言語学者が言語の使用法を規定するのではなく、実際にどのように使用されているかを記述するという原則。","english_definition":"The quality of being descriptive rather than prescriptive; in linguistics, the principle that linguists should describe how language is actually used, rather than prescribing how it should be used.","examples":[{"sentence":"Linguistic analysis emphasizes the non-prescriptibility of language, focusing on observed usage rather than imposed rules.","translation":"言語分析は、言語の非規範性を強調し、押し付けられた規則ではなく、観察された用法に焦点を当てています。"},{"sentence":"The concept of non-prescriptibility is central to modern linguistics.","translation":"非規範性の概念は、現代言語学の中心です。"}],"collocations":["linguistic non-prescriptibility","principle of non-prescriptibility"],"synonyms":["descriptivism","non-normativity"],"antonyms":["prescriptivism","normativity"]}],"etymology":{"value":"「non-」+「prescriptibility」。 prescriptibilityは「prescriptible」+「-ity」で、「prescriptible」は「prescribe」+「-ible」。「prescribe」はラテン語の「praescribere」（前もって書く、指示する）に由来。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnprɪˌskrɪptɪˈbɪləti/","syllables":"non-pre-script-i-bil-i-ty"},"inflection":{"notes":"不可算名詞"},"usage_notes":{"explanation":"「Non-prescriptibility」は、言語学の専門用語であり、日常会話ではほとんど使用されません。言語学者が言語を研究する際に、特定の文法規則や語彙を「正しい」または「間違っている」と判断するのではなく、人々が実際にどのように言語を使用しているかを客観的に記述することを指します。これは、言語が常に変化し進化するものであり、固定された規範に従うべきではないという考えに基づいています。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The teacher promoted non-prescriptibility in her grammar lessons.","correct":"✓ The teacher promoted descriptive grammar in her lessons.","note":"文法レッスンで非規範性を促進するというよりは、記述文法を促進すると言う方が自然です。"},{"incorrect":"✗ Non-prescriptibility is when you don't follow the rules.","correct":"✓ Non-prescriptibility is the idea that linguists should describe language as it is used, rather than prescribing how it should be used.","note":"非規範性は、規則に従わないことではなく、言語学者が言語を記述的に研究すべきだという考え方です。"}],"priority":"★★☆"},"related_words":{"derivatives":["prescriptivism","descriptivism","prescriptive","descriptive"],"phrases":["descriptive linguistics","prescriptive grammar"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 言語学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**non-prescriptibility**」は、言語学の専門用語で、一般的には使われません。これは、言語学者が言語を研究する際に、言語のルールを決めつけるのではなく、人々が実際にどのように言語を使っているかを観察し、記述することを重視する考え方を指します。つまり、「これは正しい」「これは間違っている」と判断するのではなく、「人々はこういう風に使っている」という事実を記録することが大切だ、という考え方です。"},"example_sentences":[{"sentence":"The sociolinguist argued for the non-prescriptibility of dialects, emphasizing their inherent validity.","translation":"社会言語学者は、方言の固有の妥当性を強調し、方言の非規範性を主張しました。","type":"noun","meaning_category":"言語学"},{"sentence":"A commitment to non-prescriptibility requires linguists to avoid making value judgments about different language varieties.","translation":"非規範性へのコミットメントは、言語学者が異なる言語変種について価値判断をすることを避けることを要求します。","type":"noun","meaning_category":"言語学"}]}