{"word":"fiscalism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"財政政策重視主義、財政主義","english_definition":"The belief that government economic policy should primarily be concerned with the manipulation of taxation and government spending.","examples":[{"sentence":"Fiscalism is often contrasted with monetarism.","translation":"財政主義はしばしばマネタリズムと対比される。"},{"sentence":"The debate between fiscalism and monetarism dominated economic policy discussions for decades.","translation":"財政主義とマネタリズムの間の議論は、数十年にわたって経済政策の議論を支配した。"}],"collocations":["fiscalism versus monetarism","Keynesian fiscalism"],"synonyms":["Keynesian economics","fiscal policy","demand-side economics"],"antonyms":["monetarism","supply-side economics"]},{"part_of_speech":"noun","definition":"（軽蔑的に）放漫財政、財政放縦","english_definition":"(derogatory) Excessive government spending and debt.","examples":[{"sentence":"Critics accused the government of fiscalism, leading to unsustainable debt levels.","translation":"批判者たちは、政府を持続不可能な債務水準につながる財政放縦だと非難した。"},{"sentence":"The country's economic woes were attributed to years of fiscalism and mismanagement.","translation":"その国の経済的苦境は、長年の財政放縦と経営のまずさに起因するとされた。"}],"collocations":["runaway fiscalism","unchecked fiscalism"],"synonyms":["profligacy","squandering","wastefulness"],"antonyms":["austerity","fiscal conservatism"]}],"etymology":{"value":"\"Fiscal\" (relating to government revenue, especially taxes) + \"-ism\" (a suffix denoting a principle, belief, or ideology).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɪskəlɪzəm/","syllables":"fis-cal-ism"},"inflection":{"noun_plural":"fiscalisms"},"usage_notes":{"explanation":"\"Fiscalism\" generally refers to the belief that fiscal policy (government spending and taxation) is the primary tool for managing the economy. However, it can also be used pejoratively to describe excessive government spending and debt accumulation. The specific meaning depends on the context. It is often discussed in contrast to monetarism, which emphasizes the role of monetary policy (controlling the money supply and interest rates).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a fiscalist, so he supports lower taxes.","correct":"✓ Depending on his specific beliefs, a fiscalist might support either lower or higher taxes.","note":"Fiscalism doesn't inherently imply support for lower or higher taxes. Fiscalists believe in using government spending and taxation to influence the economy, and their specific policy recommendations depend on their economic goals (e.g., stimulating growth, reducing inequality)."},{"incorrect":"✗ Fiscalism is the same as socialism.","correct":"✓ Fiscalism is not inherently socialist, although some fiscal policies may align with socialist goals.","note":"Fiscalism is an economic theory about how to manage the economy using government spending and taxation. While some fiscal policies (e.g., progressive taxation, social welfare programs) may overlap with socialist goals, fiscalism itself is not inherently tied to any particular political ideology."}],"priority":"★★☆"},"related_words":{"derivatives":["fiscal (adjective)","fiscal policy (noun)","fiscalist (noun)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Fiscalism\" is a term used in economics and political science to describe the belief that government spending and taxation are the most important tools for managing the economy. It's often contrasted with \"monetarism,\" which emphasizes the role of controlling the money supply. The term can also be used negatively to criticize governments for spending too much money and accumulating debt. Understanding \"fiscalism\" requires knowledge of basic economic concepts and the ability to analyze government policies."},"example_sentences":[{"sentence":"The new administration's economic plan relies heavily on fiscalism to stimulate growth.","translation":"新政権の経済計画は、成長を刺激するために財政政策重視主義に大きく依存している。","type":"noun","meaning_category":"財政政策重視主義"},{"sentence":"Critics warned that the government's fiscalism would lead to long-term economic instability.","translation":"批判者たちは、政府の財政放縦が長期的な経済不安定につながると警告した。","type":"noun","meaning_category":"放漫財政"}]}