{"word":"yokeableness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The quality or state of being easily yoked or controlled; submissiveness.","english_definition":"The quality or state of being easily yoked or controlled; submissiveness.","examples":[{"sentence":"The animal's yokeableness made it ideal for farm work.","translation":"その動物の従順さから、農作業に最適でした。"},{"sentence":"The yokeableness of the population allowed the dictator to maintain power.","translation":"国民の服従が、独裁者が権力を維持することを可能にしました。"}],"collocations":["high yokeableness","low yokeableness"],"synonyms":["submissiveness","docility","tractability","manageability","controllability"],"antonyms":["stubbornness","rebelliousness","intractability","unmanageability"]}],"etymology":{"value":"Derived from 'yokeable' (capable of being yoked or controlled) + '-ness' (suffix indicating a state or quality).","priority":"★★★"},"pronunciation":{"ipa":"/ˈjoʊkəbəlnəs/","syllables":"yo-ka-ble-ness"},"inflection":{"noun_plural":"yokeablenesses"},"usage_notes":{"explanation":"'Yokeableness' is a relatively rare and formal term. It describes the degree to which something or someone can be easily controlled or managed, often in a context where such control is exerted externally. It is most often used in discussions of animal behavior or in sociological or political contexts to describe the willingness of a population to be governed.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The yokeableness of the machine made it efficient.","correct":"✓ The efficiency of the machine was high.","note":"'Yokeableness' typically applies to living beings, not inanimate objects. Use 'efficiency' or 'effectiveness' for machines."},{"incorrect":"✗ He showed great yokeableness in his work.","correct":"✓ He showed great diligence in his work.","note":"'Yokeableness' implies external control. Use 'diligence,' 'compliance,' or 'obedience' when referring to internal work ethic."}],"priority":"★★☆"},"related_words":{"derivatives":["yokeable","yoke","yoked"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Yokeableness' is a complex word indicating the degree to which something can be controlled or managed, often in a context of external governance or influence. It is not a common word and implies a formal or academic discussion. Understanding the root word 'yoke' (to join or control) is helpful in grasping its meaning. It is more often used in sociological or political contexts than in everyday conversation."},"example_sentences":[{"sentence":"The high yokeableness of the oxen made plowing the fields much easier.","translation":"牛の従順さが、畑を耕すのをはるかに簡単にしました。","type":"noun","meaning_category":"submissiveness"},{"sentence":"Historians debate the role of popular yokeableness in the rise of authoritarian regimes.","translation":"歴史家たちは、権威主義体制の台頭における大衆の服従の役割について議論しています。","type":"noun","meaning_category":"controllability"}]}