{"word":"untunneled","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"トンネル化されていない、トンネルを通っていない","english_definition":"Not having been made into or passed through a tunnel.","examples":[{"sentence":"The untunneled section of the river remained wild and untouched.","translation":"その川のトンネル化されていない区間は、自然のままで手付かずの状態だった。"},{"sentence":"They chose an untunneled route for the pipeline to minimize environmental disruption.","translation":"彼らは環境破壊を最小限に抑えるために、パイプラインのトンネル化されていないルートを選んだ。"}],"collocations":["untunneled section","untunneled route","untunneled area"],"synonyms":["uncovered","exposed","surface"],"antonyms":["tunneled","covered","underground"]}],"etymology":{"value":"The word is formed by adding the prefix 'un-' (meaning 'not') to the past participle 'tunneled' of the verb 'tunnel.' 'Tunnel' itself comes from the Old French 'tonnel,' meaning 'net, snare,' which is a diminutive of 'tonne,' meaning 'cask, barrel.' The association with barrels likely arose from the early construction of tunnels resembling barrel-shaped structures.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈtʌnəld/","syllables":"un-tun-neled"},"inflection":{"notes":"This word is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Untunneled' is primarily used in technical or descriptive contexts to specify that something has not been subjected to tunneling. It is often used in discussions of infrastructure, geography, or engineering, where the distinction between tunneled and untunneled sections is relevant. The word implies a contrast with areas or routes that have been modified by tunnel construction.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The untunneled train.","correct":"✓ The train is untunneled. / ✓ The untunneled portion of the track.","note":"'Untunneled' describes a location or route, not a vehicle. It specifies that a particular section has not been made into a tunnel."}],"priority":"★☆☆"},"related_words":{"derivatives":["tunnel (noun, verb)","tunneling (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'untunneled' is a relatively uncommon word that is formed by adding the prefix 'un-' to 'tunneled.' It means 'not having been made into or passed through a tunnel.' It is generally used in technical or descriptive contexts, such as in engineering, geography, or infrastructure discussions. Understanding the meaning of 'tunnel' and the negative prefix 'un-' is helpful for comprehending this word. "},"example_sentences":[{"sentence":"The hikers preferred the untunneled path, despite its steeper incline.","translation":"ハイカーたちは、より急な傾斜にもかかわらず、トンネル化されていない道を選んだ。","type":"adjective","meaning_category":"not tunneled"},{"sentence":"The engineers carefully examined the untunneled portion of the mountain for stability.","translation":"エンジニアたちは、山のトンネル化されていない部分の安定性を注意深く調べた。","type":"adjective","meaning_category":"not tunneled"}]}