{"word":"Wheyfaces","priority":"Low","meanings":[{"part_of_speech":"Noun","definition":"(Slang, derogatory) A pale-skinned person, especially one considered weak or effeminate.","english_definition":"(Slang, derogatory) A pale-skinned person, especially one considered weak or effeminate.","examples":[{"sentence":"Those wheyfaces couldn't handle a day of hard labor.","translation":"あんな青白い顔をした連中は、一日中の重労働には耐えられないだろう。"},{"sentence":"He called them a bunch of wheyfaces for not standing up to the bully.","translation":"彼は、いじめっ子に立ち向かわなかった彼らを青白い顔をした連中だと罵った。"}],"collocations":["a bunch of wheyfaces","pale wheyfaces"],"synonyms":["paleface","milksop","weakling"],"antonyms":["tanned","strong","masculine"]}],"etymology":{"value":"Likely derived from the pale color of whey, the liquid remaining after milk has been curdled and strained, often associated with a sickly or weak complexion.","priority":"Medium"},"pronunciation":{"ipa":"/ˈweɪfeɪsɪz/","syllables":"whey-fac-es"},"inflection":{"noun_plural":"Wheyfaces"},"usage_notes":{"explanation":"'Wheyfaces' is a derogatory term, often used to insult someone's perceived lack of physical strength, masculinity, or overall health, based on their pale complexion. It's important to note that using this term can be offensive.","priority":"High"},"common_mistakes":{"examples":[{"incorrect":"He was a wheyface because he liked milk.","correct":"He was called a wheyface because of his pale complexion.","note":"The term refers to pale skin, not a fondness for milk."}],"priority":"Medium"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"C2","text":"'Wheyfaces' is a derogatory slang term referring to pale-skinned individuals, often implying weakness or lack of masculinity. Its usage is generally offensive and should be avoided in formal contexts."},"example_sentences":[{"sentence":"The group of 'wheyfaces' struggled to lift the heavy boxes.","translation":"その『青白い顔をした連中』は重い箱を持ち上げるのに苦労した。","type":"Noun","meaning_category":"Derogatory term for pale-skinned people"}]}