{"word":"mineralocorticoid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"鉱質コルチコイド","english_definition":"A corticosteroid, such as aldosterone, that is involved with maintaining the salt and water balance in the body.","examples":[{"sentence":"Aldosterone is the primary mineralocorticoid in humans.","translation":"アルドステロンはヒトにおける主要な鉱質コルチコイドです。"},{"sentence":"Mineralocorticoids act on the kidneys to promote sodium retention and potassium excretion.","translation":"鉱質コルチコイドは腎臓に作用し、ナトリウムの保持とカリウムの排泄を促進します。"}],"collocations":["aldosterone (アルドステロン)","adrenal cortex (副腎皮質)","sodium retention (ナトリウム貯留)","potassium excretion (カリウム排泄)","electrolyte balance (電解質バランス)"],"synonyms":["corticosteroid","adrenocortical steroid"],"antonyms":[]}],"etymology":{"value":"Derived from 'mineral' (referring to minerals or electrolytes), 'cortico-' (referring to the cortex of the adrenal gland where these hormones are produced), and '-oid' (meaning resembling).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌmɪnərəl.oʊˈkɔːrtɪˌkɔɪd/","syllables":"min-er-a-lo-cor-ti-coid"},"inflection":{"noun_plural":"mineralocorticoids"},"usage_notes":{"explanation":"Mineralocorticoids are a class of steroid hormones produced by the adrenal cortex. Their primary function is to regulate electrolyte and water balance by promoting sodium retention and potassium excretion in the kidneys. Aldosterone is the most important mineralocorticoid in humans. Imbalances in mineralocorticoid levels can lead to various medical conditions, such as hypertension or electrolyte disturbances.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Mineralocorticoids are produced by the pancreas.","correct":"✓ Mineralocorticoids are produced by the adrenal cortex.","note":"Mineralocorticoids are produced by the adrenal cortex, not the pancreas."},{"incorrect":"✗ Mineralocorticoid is a type of vitamin.","correct":"✓ Mineralocorticoid is a type of hormone.","note":"Mineralocorticoids are hormones, specifically steroid hormones, not vitamins."}],"priority":"☆☆☆"},"related_words":{"derivatives":["mineralocorticoid receptor (鉱質コルチコイド受容体)","corticosteroid (コルチコステロイド)","glucocorticoid (糖質コルチコイド)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'mineralocorticoid' refers to a type of steroid hormone produced by the adrenal cortex, primarily involved in regulating electrolyte and water balance in the body. This term is highly specialized and typically encountered in advanced studies of physiology, endocrinology, or pharmacology. Understanding requires familiarity with hormonal systems and kidney function."},"example_sentences":[{"sentence":"The patient's hypertension was attributed to an overproduction of mineralocorticoids.","translation":"その患者の高血圧は、鉱質コルチコイドの過剰産生が原因であると考えられました。","type":"noun","meaning_category":"hormone"},{"sentence":"Spironolactone is a mineralocorticoid receptor antagonist used to treat heart failure.","translation":"スピロノラクトンは、心不全の治療に使用される鉱質コルチコイド受容体拮抗薬です。","type":"noun","meaning_category":"hormone"},{"sentence":"Dysregulation of mineralocorticoid signaling can lead to electrolyte imbalances.","translation":"鉱質コルチコイドシグナル伝達の調節異常は、電解質バランスの乱れを引き起こす可能性があります。","type":"noun","meaning_category":"hormone"}]}