{"word":"nonblasphemous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"冒涜的でない、不敬虔でない","english_definition":"Not involving or characterized by blasphemy; not irreverent or profane.","examples":[{"sentence":"The revised script was careful to be nonblasphemous.","translation":"改訂された脚本は、冒涜的でないように注意深く書かれていた。"},{"sentence":"He made a nonblasphemous comment about religion.","translation":"彼は宗教について冒涜的でないコメントをした。"}],"collocations":["nonblasphemous language","nonblasphemous content","nonblasphemous statement"],"synonyms":["respectful","reverent","pious","devout","secular","inoffensive"],"antonyms":["blasphemous","irreverent","profane","sacrilegious"]},{"part_of_speech":"adjective","definition":"宗教上の神聖なものを侮辱しない","english_definition":"Not expressing disrespect or contempt for God or sacred things.","examples":[{"sentence":"The book was deemed nonblasphemous by religious leaders.","translation":"その本は宗教指導者たちによって冒涜的ではないと判断された。"}],"collocations":["nonblasphemous depiction","nonblasphemous representation"],"synonyms":["godly","holy","religious","spiritual"],"antonyms":["blasphemous","impious"]}],"etymology":{"value":"\"non-\" (not) + \"blasphemous\" (characterized by blasphemy).","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈblæsfəməs/","syllables":"non-blas-phe-mous"},"inflection":{"adjective_forms":{"comparative":"more nonblasphemous","superlative":"most nonblasphemous"}},"usage_notes":{"explanation":"\"Nonblasphemous\" is the opposite of \"blasphemous.\" It describes something that does not contain or express blasphemy, which is the act of insulting or showing contempt or lack of reverence for God or sacred things. It is often used in discussions about religious sensitivities and freedom of expression.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The movie was very nonblasphemous, so it was boring.","correct":"✓ The movie was very respectful, so it was boring.","note":"\"Nonblasphemous\" describes the absence of blasphemy, not necessarily a lack of excitement. Use a word like \"respectful\" or \"inoffensive\" if you mean something lacks excitement because it avoids controversial topics."}],"priority":"★★☆"},"related_words":{"derivatives":["nonblasphemy (noun): the absence of blasphemy"],"antonyms":["blasphemous","sacrilegious","profane","impious","irreverent"],"related_concepts":["blasphemy","heresy","sacrilege","profanity"]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonblasphemous\" is a relatively uncommon word that is formed by adding the prefix \"non-\" to the word \"blasphemous.\" It means the opposite of \"blasphemous,\" which is to say that it describes something that is not disrespectful or contemptuous towards God or sacred things. Because it is a less common word and involves understanding the concept of blasphemy, it is more likely to be encountered by advanced English learners."},"example_sentences":[{"sentence":"The author took great care to ensure the book was nonblasphemous.","translation":"著者は、その本が冒涜的でないことを確認するために細心の注意を払った。","type":"general"},{"sentence":"The comedian's act was surprisingly nonblasphemous, given his reputation.","translation":"そのコメディアンの芸は、彼の評判を考えると驚くほど冒涜的ではなかった。","type":"general"},{"sentence":"The organization promotes nonblasphemous dialogue between different faiths.","translation":"その組織は、異なる信仰間の冒涜的でない対話を促進している。","type":"general"}]}