{"word":"industry-specific","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"特定の産業に特有の、特定の産業に合わせた、特定の産業に適用される","english_definition":"Relating to or designed for a particular industry.","examples":[{"sentence":"We need industry-specific software to manage our inventory.","translation":"在庫管理には、業界特有のソフトウェアが必要です。"},{"sentence":"The conference focused on industry-specific challenges and opportunities.","translation":"会議では、業界特有の課題と機会に焦点が当てられました。"},{"sentence":"Our training program provides industry-specific skills to new employees.","translation":"当社の研修プログラムは、新入社員に業界特有のスキルを提供します。"}],"collocations":["industry-specific software","industry-specific knowledge","industry-specific training","industry-specific regulations","industry-specific solutions","industry-specific standards"],"synonyms":["sector-specific","domain-specific","specialized","tailored","customized"],"antonyms":["general","universal","broad","non-specific"]}],"etymology":{"value":"Combines 'industry' (a particular branch of economic or commercial activity) and 'specific' (clearly defined or identified).","priority":"★☆☆"},"pronunciation":{"ipa":"/ɪnˈdʌstri spəˈsɪfɪk/","syllables":"in-dus-try spe-cif-ic"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Industry-specific' is used to describe something that is designed or intended for use within a particular industry. It implies a level of specialization and relevance that is not found in more general solutions or approaches. It's often used in the context of software, training, regulations, or knowledge.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The software is very specific to the industry.","correct":"✓ The software is industry-specific.","note":"Using 'industry-specific' is more concise and idiomatic than saying 'specific to the industry'."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["industry","sector","domain","specialized","vertical market"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively frequent in business and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Industry-specific' means something is designed or related to a particular type of business or economic activity. It's often used when discussing solutions, training, or regulations that are tailored for a certain industry and wouldn't be suitable or effective in others. The term implies a degree of specialization."},"example_sentences":[{"sentence":"The company provides industry-specific consulting services to healthcare providers.","translation":"その会社は、医療機関に業界特有のコンサルティングサービスを提供しています。","type":"adjective","meaning_category":"Relating to a particular industry"},{"sentence":"We developed an industry-specific curriculum to address the skills gap in the manufacturing sector.","translation":"製造業におけるスキルギャップに対応するため、業界特有のカリキュラムを開発しました。","type":"adjective","meaning_category":"Designed for a particular industry"},{"sentence":"Compliance with industry-specific regulations is crucial for avoiding penalties.","translation":"業界特有の規制を遵守することは、罰則を回避するために非常に重要です。","type":"adjective","meaning_category":"Applicable to a particular industry"}]}