{"word":"price-maker","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"価格支配者、プライスメイカー","english_definition":"A company or individual that has enough market power to influence the market price of a good or service.","examples":[{"sentence":"A monopoly is a classic example of a price-maker.","translation":"独占はプライスメイカーの典型的な例です。"},{"sentence":"Price-makers can set prices above marginal cost.","translation":"プライスメイカーは限界費用よりも高い価格を設定できます。"},{"sentence":"Unlike firms in perfectly competitive markets, price-makers face a downward-sloping demand curve.","translation":"完全競争市場の企業とは異なり、プライスメイカーは右下がりの需要曲線に直面します。"}],"collocations":["become a price-maker","exercise price-making power","price-maker behavior","price-maker firm","price-maker industry"],"synonyms":["market power","monopoly","oligopoly","dominant firm"],"antonyms":["price-taker","perfect competition"]},{"part_of_speech":"adjective","definition":"価格支配的な、プライスメイカーの","english_definition":"Relating to or characteristic of a price-maker.","examples":[{"sentence":"The company's price-maker strategy allowed it to maintain high profit margins.","translation":"その会社のプライスメイカー戦略により、高い利益率を維持することができました。"},{"sentence":"Price-maker industries often face government regulation.","translation":"価格支配的な産業は、政府の規制に直面することがよくあります。"}],"collocations":["price-maker strategy","price-maker industry","price-maker power"],"synonyms":["market-dominant","monopolistic","oligopolistic"],"antonyms":["price-taking","competitive"]}],"etymology":{"value":"The term is derived from the ability of such entities to 'make' or set the price, rather than passively accepting the market price.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpraɪsˌmeɪkər/","syllables":"price-ma-ker"},"inflection":{"noun_plural":"price-makers"},"usage_notes":{"explanation":"A 'price-maker' is a firm or entity that has sufficient control over its market to influence the price of its goods or services. This is in contrast to a 'price-taker,' which must accept the prevailing market price. Price-makers typically exist in markets that are not perfectly competitive, such as monopolies or oligopolies.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ A small business is often a price-maker.","correct":"✓ A small business is rarely a price-maker.","note":"Small businesses typically lack the market power to influence prices significantly. They are more often price-takers."},{"incorrect":"✗ Price-makers always charge the highest possible price.","correct":"✓ Price-makers aim to maximize profit, which may not always be the highest possible price.","note":"Price-makers consider demand elasticity and other factors to maximize profit, not simply charge the highest price."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["monopoly","oligopoly","market power","price elasticity of demand","marginal cost","profit maximization"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent, used primarily in economics and business contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'price-maker' refers to a company or entity that has enough control over its market to influence the price of its products or services. This usually happens when there are few competitors, like in a monopoly. Unlike companies in very competitive markets that have to accept the going price, a price-maker can set its own prices, often above what it costs to produce the product. This term is mainly used in economics and business discussions."},"example_sentences":[{"sentence":"The pharmaceutical company, holding a patent, acted as a price-maker for its new drug.","translation":"特許を持つ製薬会社は、新薬の価格支配者として行動しました。","type":"noun","meaning_category":"価格支配者"},{"sentence":"As a price-maker, the firm had to carefully consider the demand curve when setting prices.","translation":"価格支配者として、その企業は価格を設定する際に需要曲線を慎重に検討する必要がありました。","type":"noun","meaning_category":"価格支配者"},{"sentence":"The government investigated the company for engaging in price-maker behavior.","translation":"政府はその企業が価格支配的な行動に関与しているとして調査しました。","type":"adjective","meaning_category":"価格支配的な"}]}