{"word":"reseparating","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"再び分離する、再分離する","english_definition":"Separating again; performing the action of separating something that was previously separated and then rejoined or considered as a whole.","examples":[{"sentence":"After the components were mixed, the chemist began reseparating them to analyze the individual substances.","translation":"成分が混合された後、化学者は個々の物質を分析するためにそれらを再分離し始めた。"},{"sentence":"The recycling plant is reseparating the materials to improve the purity of each stream.","translation":"リサイクル工場は、各ストリームの純度を向上させるために材料を再分離しています。"}],"collocations":["reseparating materials","reseparating components","reseparating elements"],"synonyms":["disuniting","dividing again","splitting again"],"antonyms":["recombining","reuniting","integrating"]}],"etymology":{"value":"The word is formed by adding the prefix 're-' (meaning again) to the word 'separating', which is the present participle of 'separate'. 'Separate' comes from the Latin 'separatus', the past participle of 'separare' (to divide, disjoin).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˈsepəreɪtɪŋ/","syllables":"re-sep-a-rat-ing"},"inflection":{"verb_forms":{"present_simple":["reseparate","reseparates"],"past_simple":"reseparated","past_participle":"reseparated","present_participle":"reseparating"}},"usage_notes":{"explanation":"'Reseparating' is used when something has been separated, then brought back together (either physically or conceptually), and is now being separated again. This term is often found in scientific, industrial, or technical contexts where components or materials are processed multiple times.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The machine is reseparating, it will be done soon.","correct":"✓ The machine is reseparating the components; it will be done soon.","note":"It's important to specify what is being reseparated. The sentence is improved by adding a direct object."},{"incorrect":"✗ Reseparating is not possible, they are mixed forever.","correct":"✓ Reseparation is not possible; they are mixed forever.","note":"When referring to the process or act in general, use the noun form 'reseparation' instead of the present participle 'reseparating'."}],"priority":"★★☆"},"related_words":{"derivatives":["reseparation (noun)","separate (verb)","separation (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'reseparating' is a technical term used to describe the process of separating something again after it has been combined or mixed. It is generally used in specific contexts such as chemistry, recycling, or industrial processes. Understanding the prefix 're-' and the base word 'separating' is essential to grasp its meaning. It is not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The laboratory technician is reseparating the isotopes to isolate the pure element.","translation":"実験室の技術者は、純粋な元素を分離するために同位体を再分離しています。","type":"verb","meaning_category":"再び分離する"},{"sentence":"The goal of the new filtration system is reseparating the contaminants from the water supply.","translation":"新しい濾過システムの目的は、給水から汚染物質を再分離することです。","type":"verb","meaning_category":"再び分離する"}]}