{"word":"lingerer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ぐずぐずする人、なかなか立ち去らない人、長居する人","english_definition":"a person who stays longer than necessary or expected in a place; someone who lingers.","examples":[{"sentence":"She was a lingerer at the party, not wanting the night to end.","translation":"彼女はパーティーでなかなか帰ろうとせず、夜が終わるのを惜しんだ。"},{"sentence":"He's a lingerer in the coffee shop, often staying for hours after finishing his drink.","translation":"彼はコーヒーショップで長居する人で、飲み物を飲み終わってからも何時間もいることが多い。"},{"sentence":"The lingerers at the museum admired the artwork long after closing time.","translation":"美術館でなかなか帰ろうとしない人々は、閉館時間後も長く作品を鑑賞していた。"}],"collocations":["a lingerer at the party","a lingerer in the coffee shop","a lingerer after the show"],"synonyms":["loiterer","dawdler","straggler","lagger","idler"],"antonyms":["early bird","go-getter","mover","doer"]},{"part_of_speech":"noun","definition":"(病気などが)なかなか治らない人、長引く病気を患っている人","english_definition":"a person whose illness or condition persists for a long time.","examples":[{"sentence":"The hospital staff provided extra care for the lingerers, whose recovery was slow.","translation":"病院のスタッフは、回復が遅い、なかなか治らない患者たちに特別なケアを提供した。"},{"sentence":"As a lingerer, he required constant medical attention.","translation":"なかなか病気が治らない患者として、彼は絶え間ない医療的ケアを必要とした。"}],"collocations":["a lingerer in the hospital","a lingerer with a chronic illness"],"synonyms":["chronic patient","long-term sufferer"],"antonyms":["quick healer","fast recoverer"]}],"etymology":{"value":"The word 'lingerer' is derived from the verb 'linger,' which comes from Middle English 'lengen,' meaning 'to prolong' or 'to delay.' The suffix '-er' is added to form a noun denoting someone who performs the action of lingering.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɪŋɡərər/","syllables":"lin-ger-er"},"inflection":{"noun_plural":"lingerers"},"usage_notes":{"explanation":"The word 'lingerer' is used to describe someone who remains in a place or continues an activity longer than is usual or expected. It can also refer to someone whose illness persists for an extended period. The term often carries a slightly negative connotation, suggesting that the person is delaying or prolonging something unnecessarily.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a lingerer, she always arrives late.","correct":"✓ She is a lingerer, she never wants to leave.","note":"'Lingerer' refers to someone who stays longer, not someone who arrives late. Use 'latecomer' or 'tardy person' for someone who arrives late."},{"incorrect":"✗ The lingerer was quickly cured.","correct":"✓ The patient was a lingerer, requiring long-term care.","note":"When referring to a person with a prolonged illness, specify that they are a 'patient' or use a similar term to clarify the context."}],"priority":"★★☆"},"related_words":{"derivatives":["linger (verb)","lingering (adjective)"],"phrasal_verbs":[],"related_nouns":["loiterer","dawdler","straggler"],"related_adjectives":["lingering"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lingerer' describes someone who stays longer than expected, whether at a party or with an illness. It's more formal than 'loiterer' and implies a reluctance to leave or a prolonged state. The word is not commonly used, making it suitable for advanced learners who want to expand their vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The last lingerers at the bar finally left as the sun began to rise.","translation":"バーで最後まで粘っていた客たちは、ついに日が昇り始めると店を後にした。","type":"noun","meaning_category":"なかなか立ち去らない人"},{"sentence":"The doctor worried about the lingerers in the ward, whose conditions were not improving.","translation":"医師は病棟でなかなか治らない患者たちのことを心配していた。彼らの容態は改善していなかった。","type":"noun","meaning_category":"なかなか治らない人"},{"sentence":"She was a lingerer in the art gallery, captivated by each painting.","translation":"彼女は美術館でなかなか立ち去ろうとせず、それぞれの絵に魅了されていた。","type":"noun","meaning_category":"なかなか立ち去らない人"}]}