{"word":"shuttlewise","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"In the manner of a shuttle; moving back and forth repeatedly.","english_definition":"Moving back and forth repeatedly, like a shuttle.","examples":[{"sentence":"The train moved shuttlewise between the two stations.","translation":"列車は二つの駅の間をシャトルのように往復した。"},{"sentence":"The worker carried materials shuttlewise from the warehouse to the factory floor.","translation":"作業員は倉庫から工場フロアへシャトルのように資材を運んだ。"}],"collocations":["move shuttlewise","operate shuttlewise","transport shuttlewise"],"synonyms":["back and forth","to and fro","reciprocally","alternately"],"antonyms":["stationary","immobile","fixed"]}],"etymology":{"value":"Formed from 'shuttle' (referring to a device that moves back and forth, especially in weaving) and '-wise' (indicating manner or direction).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʃʌtəlwaɪz/","syllables":"shut-tle-wise"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Shuttlewise' describes movement that is repetitive and alternates between two points, similar to how a shuttle operates in a loom. It is not a commonly used word, but it is descriptive when you want to emphasize this type of back-and-forth motion.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bus traveled in a shuttlewise direction.","correct":"✓ The bus traveled shuttlewise between the cities.","note":"'Shuttlewise' describes the manner of movement, not the direction. It's better to use it to show the repetitive back and forth action between two points."}],"priority":"★★☆"},"related_words":{"derivatives":["shuttle (noun, verb)","wise (suffix)"],"phrasal_verbs":[],"related_adverbs":["back and forth","to and fro"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Shuttlewise' is a relatively uncommon adverb that describes movement in a manner resembling a shuttle, meaning back and forth repeatedly between two points. It is used to emphasize the repetitive nature of the movement. Due to its infrequent use, it is more likely to be encountered in advanced texts or specialized contexts."},"example_sentences":[{"sentence":"The automated system delivered packages shuttlewise between the loading docks.","translation":"自動化されたシステムは、積み込み場間でシャトルのように荷物を配達した。","type":"adverb","meaning_category":"Manner of movement"},{"sentence":"The robot moved shuttlewise along the assembly line, performing its designated task.","translation":"ロボットは組み立てラインに沿ってシャトルのように動き、指定されたタスクを実行した。","type":"adverb","meaning_category":"Manner of movement"}]}