{"word":"snakebird","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ヘビウ (鳥)","english_definition":"A large, slender, dark-plumaged tropical bird of the genus Anhinga, with a long, thin neck and sharp bill, that swims with its body submerged, resembling a snake.","examples":[{"sentence":"The snakebird swam silently through the water, its long neck extended like a serpent.","translation":"ヘビウは静かに水面を泳ぎ、その細長い首は蛇のように伸びていた。"},{"sentence":"Snakebirds are known for their ability to spear fish with their sharp beaks.","translation":"ヘビウは、鋭いくちばしで魚を突き刺す能力で知られている。"}],"collocations":["Indian snakebird","African snakebird","American snakebird","Australian snakebird","darter bird","water turkey"],"synonyms":["darter","anhinga"],"antonyms":[]}],"etymology":{"value":"The name 'snakebird' comes from the bird's habit of swimming with its body submerged and only its long neck and head visible above the water, resembling a snake.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsneɪkbɜːrd/","syllables":"snake-bird"},"inflection":{"noun_plural":"snakebirds"},"usage_notes":{"explanation":"Snakebirds are skilled swimmers and divers, often found in freshwater habitats such as lakes, rivers, and swamps. They are also known as darters because of their ability to spear fish with their sharp beaks.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a snakebird with a long snake neck.","correct":"✓ I saw a snakebird with a long neck that looked like a snake.","note":"The neck of the snakebird *resembles* a snake, but it is not literally a snake's neck."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'snakebird' refers to a specific type of bird known for its long, slender neck that resembles a snake when it swims with its body submerged. It is a relatively uncommon term, typically used in ornithology or when discussing wildlife in tropical regions. Understanding the term requires some familiarity with bird identification and natural history."},"example_sentences":[{"sentence":"We spotted a snakebird perched on a branch, drying its wings after a dive.","translation":"ダイビングの後、枝に止まって羽を乾かしているヘビウを見つけた。","type":"noun","meaning_category":"bird identification"},{"sentence":"The guide pointed out a snakebird swimming in the lagoon, its neck gracefully cutting through the water.","translation":"ガイドはラグーンで泳いでいるヘビウを指し、その首が優雅に水面を切っていた。","type":"noun","meaning_category":"bird identification"}]}