{"word":"Turbinotomy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"鼻甲介切除術（びこうかいせつじょじゅつ）","english_definition":"A surgical procedure involving the partial or complete removal of one or more of the turbinates in the nose.","examples":[{"sentence":"The patient underwent a turbinotomy to improve nasal airflow.","translation":"患者は鼻腔の空気の流れを改善するために鼻甲介切除術を受けた。"},{"sentence":"Turbinotomy is sometimes recommended for chronic nasal congestion.","translation":"鼻甲介切除術は慢性的な鼻づまりに対して推奨されることがある。"}],"collocations":["partial turbinotomy (部分鼻甲介切除術)","submucosal turbinotomy (粘膜下鼻甲介切除術)","laser turbinotomy (レーザー鼻甲介切除術)"],"synonyms":["turbinectomy","turbinate reduction"],"antonyms":[]}],"etymology":{"value":"Derived from 'turbinate' (referring to the turbinate bones in the nose) and '-otomy' (denoting a surgical incision or cutting).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɜːrbɪˌnɒtəmi/","syllables":"tur-bi-no-to-my"},"inflection":{"noun_plural":"Turbinotomies"},"usage_notes":{"explanation":"Turbinotomy is a surgical procedure aimed at reducing the size of the turbinates in the nasal passages. Turbinates are bony structures covered with soft tissue that help to humidify and filter air. When they become enlarged (turbinate hypertrophy), they can obstruct airflow and cause nasal congestion. Turbinotomy can be performed using various techniques, including surgical cutting, laser ablation, or radiofrequency reduction.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor performed a turbinectomy, which is the same as turbinotomy.","correct":"✓ The doctor performed a turbinotomy to reduce the size of the turbinates.","note":"While the terms are often used interchangeably, turbinectomy refers to the complete removal of the turbinate, while turbinotomy is a partial removal or reduction. Ensure the correct term is used to accurately describe the procedure."}],"priority":"★☆☆"},"related_words":{"derivatives":["turbinate","turbinectomy","rhinoplasty"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Turbinotomy' is a specialized medical term referring to a surgical procedure to reduce the size of nasal turbinates. It is used in the context of otolaryngology (ENT) and is not commonly encountered outside of medical settings. Understanding this term requires knowledge of nasal anatomy and surgical procedures."},"example_sentences":[{"sentence":"The ENT specialist recommended a turbinotomy to alleviate the patient's chronic nasal obstruction.","translation":"耳鼻咽喉科専門医は、患者の慢性的な鼻閉を緩和するために鼻甲介切除術を推奨した。","type":"medical","meaning_category":"surgical procedure"},{"sentence":"Following the turbinotomy, the patient reported improved breathing and reduced nasal congestion.","translation":"鼻甲介切除術後、患者は呼吸の改善と鼻づまりの軽減を報告した。","type":"medical","meaning_category":"surgical outcome"}]}