{"word":"Stoicism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ストア主義、禁欲主義","english_definition":"An ancient Greek philosophy that emphasizes virtue, reason, and living in accordance with nature. It teaches self-control, resilience, and acceptance of what cannot be changed.","examples":[{"sentence":"Stoicism helped him cope with the challenges in his life.","translation":"ストア主義は彼が人生の困難に対処するのに役立った。"},{"sentence":"She found solace in Stoicism during difficult times.","translation":"彼女は困難な時期にストア主義に心の安らぎを見出した。"},{"sentence":"The principles of Stoicism encourage emotional resilience.","translation":"ストア主義の原則は、感情的な回復力を促進する。"}],"collocations":["practice Stoicism (ストア主義を実践する)","Stoicism philosophy (ストア主義哲学)","Stoic principles (ストア主義の原則)","Stoic virtue (ストア主義の徳)","Embrace Stoicism (ストア主義を受け入れる)"],"synonyms":["self-control","resilience","acceptance","fortitude","equanimity","inner peace"],"antonyms":["hedonism","emotionalism","indulgence","sensuality"]}],"etymology":{"value":"Derived from the Greek word 'Stoa Poikile' (painted porch), the place where Zeno of Citium, the founder of Stoicism, taught his philosophy in Athens.","priority":"★★★"},"pronunciation":{"ipa":"/ˈstoʊɪsɪzəm/","syllables":"Sto-i-cism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Stoicism is a philosophy, not a religion. It focuses on personal ethics and developing inner strength to face adversity. Stoics believe that external events are beyond our control, but we can control our reactions to them. Key figures in Stoicism include Zeno of Citium, Epictetus, Seneca, and Marcus Aurelius.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is practicing Stoic.","correct":"✓ He is practicing Stoicism.","note":"Stoicism is the philosophy itself. A person who follows Stoicism is a 'Stoic'."},{"incorrect":"✗ Stoicism is about being emotionless.","correct":"✓ Stoicism is about controlling emotions, not suppressing them.","note":"Stoicism doesn't advocate suppressing emotions, but rather understanding and managing them through reason."}],"priority":"★★☆"},"related_words":{"derivatives":["Stoic (noun/adjective: ストア派の人/ストア派の、禁欲的な)","Stoically (adverb: ストア派的に、禁欲的に)"],"idioms_phrases":["bear with a stoic face (ストイックな表情で耐える)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, more common in academic or philosophical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Stoicism' is a philosophical term referring to a school of thought that originated in ancient Greece. It emphasizes the importance of virtue, reason, and living in harmony with nature. Stoics believe in controlling one's emotions and accepting what cannot be changed. The term is often used in discussions about philosophy, ethics, and personal development. Understanding the core principles of Stoicism requires some familiarity with philosophical concepts."},"example_sentences":[{"sentence":"The athlete's Stoicism was evident as he continued the race despite his injury.","translation":"その運動選手のストア主義は、怪我にもかかわらずレースを続けたことで明らかだった。","type":"noun","meaning_category":"哲学"},{"sentence":"Stoicism teaches us to focus on what we can control and accept what we cannot.","translation":"ストア主義は、私たちがコントロールできることに焦点を当て、コントロールできないことを受け入れるように教えている。","type":"noun","meaning_category":"哲学"},{"sentence":"Many people find Stoicism a helpful philosophy for navigating the challenges of modern life.","translation":"多くの人々は、ストア主義が現代生活の課題を乗り越えるのに役立つ哲学であると考えている。","type":"noun","meaning_category":"哲学"}]}