{"word":"Conoy","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(歴史) コノイ族：アメリカ先住民の一つの部族。また、その言語や文化を指す。","english_definition":"(historical) A Native American tribe, also known as the Piscataway, who historically lived in the areas of present-day Maryland and surrounding regions. Also refers to their language and culture.","examples":[{"sentence":"The Conoy people were skilled farmers and fishermen.","translation":"コノイ族は熟練した農民であり漁師だった。"},{"sentence":"Efforts are being made to preserve the Conoy language.","translation":"コノイ語を保存するための努力がなされている。"},{"sentence":"The history of the Conoy tribe is closely linked to the early colonial period in Maryland.","translation":"コノイ族の歴史は、メリーランドの初期植民地時代と密接に結びついている。"}],"collocations":["Conoy tribe (コノイ族)","Conoy language (コノイ語)","Piscataway Conoy (ピスカタウェイ・コノイ)"],"synonyms":["Piscataway","Piscataway Conoy"],"antonyms":[]}],"etymology":{"value":"由来は不明だが、アルゴンキン語族に属する言語から来ていると考えられている。Piscatawayという名前は、彼らが住んでいた場所の地名に由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkoʊnɔɪ/","syllables":"Co-noy"},"inflection":{"notes":"名詞であり、複数形は通常 Conoys となる。"},"usage_notes":{"explanation":"「**Conoy**」は、主に歴史的な文脈で使用される言葉です。現代では、彼らの子孫はピスカタウェイ・コノイ族として知られており、部族の文化と遺産を維持するための活動を続けています。部族の歴史、文化、言語について言及する場合に使用されます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Conoy is a city in Maryland.","correct":"✓ Conoy refers to a Native American tribe that lived in the area of present-day Maryland.","note":"コノイはメリーランド州の都市ではありません。メリーランド州周辺に住んでいたアメリカ先住民の部族を指します。"},{"incorrect":"✗ The Conoy are a extinct tribe.","correct":"✓ The descendants of the Conoy people, known as the Piscataway Conoy, still exist and are working to preserve their culture.","note":"コノイ族は絶滅した部族ではありません。彼らの子孫であるピスカタウェイ・コノイ族は、文化を保存するために活動しています。"}],"priority":"★★☆"},"related_words":{"derivatives":["Piscataway (ピスカタウェイ)","Algonquian (アルゴンキン語族)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"低頻度 (Low frequency) - 歴史的な文脈でのみ使用されることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Conoy**」は、アメリカ合衆国、特にメリーランド州周辺に歴史的に居住していた先住民族の名前です。彼らはピスカタウェイ族としても知られています。この単語は、歴史、人類学、または先住民族の研究に関連する文脈で最も一般的に使用されます。現代では、彼らの子孫は自分たちをピスカタウェイ・コノイ族と呼んでいます。この単語は一般的な会話ではあまり使われません。"},"example_sentences":[{"sentence":"Archaeological evidence suggests that the Conoy people inhabited the region for thousands of years.","translation":"考古学的証拠は、コノイ族が数千年にわたってその地域に居住していたことを示唆している。","type":"noun","meaning_category":"部族"},{"sentence":"The Piscataway Conoy Tribe is working to gain federal recognition.","translation":"ピスカタウェイ・コノイ族は、連邦政府の承認を得るために活動している。","type":"noun","meaning_category":"部族"},{"sentence":"The Conoy language is part of the Algonquian language family.","translation":"コノイ語は、アルゴンキン語族の一部である。","type":"noun","meaning_category":"言語"}]}