{"word":"mousepox","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"マウス痘","english_definition":"A contagious viral disease of mice, caused by the mousepox virus (ectromelia virus).","examples":[{"sentence":"Mousepox is a serious concern in laboratory mouse colonies.","translation":"マウス痘は実験用マウスコロニーにおいて深刻な懸念事項です。"},{"sentence":"The researchers were studying the effects of mousepox on the immune system.","translation":"研究者たちはマウス痘が免疫系に与える影響を研究していました。"}],"collocations":["mousepox virus","ectromelia virus","laboratory mice","mouse colony"],"synonyms":["ectromelia"],"antonyms":[]},{"part_of_speech":"noun","definition":"マウス痘ウイルス","english_definition":"The virus that causes mousepox, also known as ectromelia virus.","examples":[{"sentence":"The mousepox virus is a member of the orthopoxvirus family.","translation":"マウス痘ウイルスはオルソポックスウイルス科の一員です。"},{"sentence":"Infection with the mousepox virus can lead to high mortality rates in susceptible mouse strains.","translation":"マウス痘ウイルスへの感染は、感受性の高いマウス系統において高い死亡率につながる可能性があります。"}],"collocations":["orthopoxvirus","viral infection","mortality rate","mouse strains"],"synonyms":["ectromelia virus"],"antonyms":[]}],"etymology":{"value":"Derived from 'mouse' (referring to the animal affected) and 'pox' (referring to the characteristic skin lesions caused by the virus).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmaʊsˌpɒks/","syllables":"mouse-pox"},"inflection":{"noun_plural":"None (generally used as an uncountable noun)"},"usage_notes":{"explanation":"Mousepox is primarily a disease of laboratory mice and is of significant concern in research settings due to its potential to affect experimental results. It is caused by the ectromelia virus, which is highly contagious among mice. Symptoms can range from mild skin lesions to severe systemic illness and death, depending on the mouse strain.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The mouse has mousepoxes.","correct":"✓ The mouse has mousepox.","note":"Mousepox is generally used as an uncountable noun, so the plural form is not common."},{"incorrect":"✗ Mousepox is a bacterial infection.","correct":"✓ Mousepox is a viral infection.","note":"Mousepox is caused by a virus, not bacteria."}],"priority":"★★☆"},"related_words":{"derivatives":["ectromelia (synonym)","orthopoxvirus (related virus family)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (specialized term)","frequency_google_ngram":"Low frequency (specialized term used in veterinary medicine and research)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mousepox' is a technical term referring to a specific viral disease affecting mice, primarily in laboratory settings. Understanding this term requires familiarity with basic virology and laboratory animal medicine. The disease is caused by the ectromelia virus and can have significant implications for research involving mice. Due to its specialized nature, this term is not commonly encountered outside of scientific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The outbreak of **mousepox** led to the culling of the entire mouse colony.","translation":"マウス痘の発生により、マウスコロニー全体が殺処分されることになった。","type":"noun","meaning_category":"disease"},{"sentence":"Vaccination is an effective method for preventing the spread of **mousepox** in research facilities.","translation":"ワクチン接種は研究施設におけるマウス痘の蔓延を防ぐ効果的な方法です。","type":"noun","meaning_category":"disease"}]}