{"word":"trisomic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"トリソミーの、トリソミー性の","english_definition":"Having three homologous chromosomes instead of the normal two.","examples":[{"sentence":"The baby was born with a trisomic condition.","translation":"その赤ちゃんはトリソミーの状態で生まれた。"},{"sentence":"Trisomic cells can arise due to nondisjunction during meiosis.","translation":"トリソミー細胞は、減数分裂中の不分離によって生じることがある。"}],"collocations":["trisomic cell (トリソミー細胞)","trisomic condition (トリソミー状態)","trisomic individual (トリソミー個体)"],"synonyms":["aneuploid","nondisjunction"],"antonyms":["disomic","monosomic"]},{"part_of_speech":"noun","definition":"トリソミー個体、トリソミー細胞","english_definition":"An individual or cell having three homologous chromosomes instead of the normal two.","examples":[{"sentence":"A trisomic is often characterized by specific phenotypic traits.","translation":"トリソミー個体は、特定の表現型特性によって特徴づけられることが多い。"},{"sentence":"This trisomic shows an extra copy of chromosome 21.","translation":"このトリソミーは、21番染色体の余分なコピーを示している。"}],"collocations":["Down syndrome (ダウン症候群) - trisomy 21","Edwards syndrome (エドワーズ症候群) - trisomy 18","Patau syndrome (パタウ症候群) - trisomy 13"],"synonyms":["aneuploid","nondisjunction"],"antonyms":["disomic","monosomic"]}],"etymology":{"value":"From 'tri-' (three) + 'soma' (body) + '-ic' (relating to). Refers to the presence of three copies of a chromosome instead of the usual two.","priority":"★★☆"},"pronunciation":{"ipa":"/traɪˈsoʊmɪk/","syllables":"tri-so-mic"},"inflection":{"noun_plural":"trisomics"},"usage_notes":{"explanation":"'Trisomic' refers to a genetic condition where an individual has an extra copy of a chromosome, resulting in a total of three copies instead of the usual two. This can lead to various developmental and health issues. The term is used both as an adjective to describe the condition and as a noun to refer to an individual or cell with this condition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cell was trisomy.","correct":"✓ The cell was trisomic.","note":"'Trisomy' is the name of the condition, while 'trisomic' is the adjective describing something that has trisomy."}],"priority":"★★☆"},"related_words":{"derivatives":["trisomy (名詞: トリソミー)","chromosome (名詞: 染色体)","aneuploidy (名詞: 異数性)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Trisomic' is a term used in genetics to describe a cell or organism that has an extra copy of one chromosome. Normally, organisms have two copies of each chromosome (one from each parent). In a trisomic condition, there are three copies of a particular chromosome. This can lead to various genetic disorders. The most well-known example is Down syndrome, which is caused by trisomy of chromosome 21."},"example_sentences":[{"sentence":"The genetic analysis confirmed that the fetus was trisomic for chromosome 18.","translation":"遺伝子解析により、胎児が18番染色体トリソミーであることが確認された。","type":"adjective","meaning_category":"トリソミーの"},{"sentence":"Individuals with trisomic conditions often exhibit a range of developmental challenges.","translation":"トリソミー状態の個体は、しばしばさまざまな発達上の課題を示す。","type":"adjective","meaning_category":"トリソミーの"},{"sentence":"The laboratory identified a trisomic cell line in the sample.","translation":"研究室は、サンプル中にトリソミー細胞株を特定した。","type":"adjective","meaning_category":"トリソミーの"},{"sentence":"The trisomic had distinct physical characteristics associated with the chromosomal abnormality.","translation":"そのトリソミー個体は、染色体異常に関連する明確な身体的特徴を持っていた。","type":"noun","meaning_category":"トリソミー個体"}]}