{"word":"Solomonical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ソロモンのような、ソロモンに似た、ソロモンの知恵に富んだ","english_definition":"resembling or characteristic of Solomon, especially in wisdom or judgment.","examples":[{"sentence":"The judge rendered a Solomonical decision, pleasing both parties.","translation":"裁判官はソロモンの知恵のような判決を下し、両当事者を満足させた。"},{"sentence":"Her Solomonical wisdom helped resolve the dispute.","translation":"彼女のソロモンのような知恵が紛争の解決に役立った。"}],"collocations":["Solomonical judgment","Solomonical wisdom","Solomonical decision"],"synonyms":["wise","judicious","sagacious","discerning","astute"],"antonyms":["foolish","unwise","imprudent","foolhardy"]}],"etymology":{"value":"Derived from the name of King Solomon, known for his wisdom in the Old Testament of the Bible.","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɒləˈmɒnɪkəl/","syllables":"So-lo-mon-i-cal"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"The term 'Solomonical' is used to describe someone or something that possesses exceptional wisdom and judgment, similar to that attributed to King Solomon in the Bible. It is often used in the context of legal decisions, problem-solving, or conflict resolution where a wise and fair approach is needed.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He made a very solomonical mistake.","correct":"✓ He made a very Solomon-like mistake.","note":"'Solomonical' is generally used to describe positive attributes like wisdom or judgment, not mistakes. 'Solomon-like' can be used more broadly to describe something resembling Solomon."},{"incorrect":"✗ She is a solomonical person.","correct":"✓ She is a Solomon-like person. / ✓ She possesses Solomonical wisdom.","note":"While 'Solomonical' can describe attributes, 'Solomon-like' is often preferred to describe a person directly."}],"priority":"★☆☆"},"related_words":{"derivatives":["Solomon (noun)","Solomon-like (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Solomonical' is an advanced adjective used to describe something that resembles the wisdom and judgment of King Solomon from the Bible. It's not commonly used in everyday conversation but may appear in literature, legal contexts, or discussions about ethics and problem-solving. Understanding the reference to King Solomon is key to understanding the meaning of this word."},"example_sentences":[{"sentence":"The mediator offered a Solomonical solution that satisfied both parties involved in the dispute.","translation":"調停者は、紛争に関与する両当事者を満足させるソロモンの知恵のような解決策を提示した。","type":"adjective","meaning_category":"wisdom"},{"sentence":"The professor's Solomonical insights into the complex issue were highly valued by his students.","translation":"教授の複雑な問題に対するソロモンのような洞察力は、彼の学生たちから高く評価された。","type":"adjective","meaning_category":"wisdom"}]}