{"word":"unattainability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"到達不能性、達成不能性、入手不能性","english_definition":"The state or quality of being impossible to attain, reach, or obtain.","examples":[{"sentence":"The unattainability of perfection can be frustrating.","translation":"完璧に到達できないことは、イライラの原因となりうる。"},{"sentence":"The unattainability of world peace is a common theme in literature.","translation":"世界平和の達成不能性は、文学における共通のテーマである。"},{"sentence":"Due to high demand and limited supply, the unattainability of the product drove up its price on the secondary market.","translation":"高い需要と限られた供給のため、その製品の入手不能性が二次市場での価格を押し上げた。"}],"collocations":["unattainability of a goal","unattainability of perfection","perceived unattainability","relative unattainability"],"synonyms":["impossibility","inaccessibility","unreachability","infeasibility","hopelessness","impracticability"],"antonyms":["attainability","accessibility","reachability","feasibility","possibility","practicability"]}],"etymology":{"value":"Formed from \"unattainable\" (not able to be attained) + \"-ity\" (a suffix denoting a state or quality). \"Unattainable\" is derived from \"un-\" (not) + \"attainable\" (able to be attained). \"Attainable\" comes from \"attain\" (to reach, achieve) + \"-able\" (capable of). \"Attain\" comes from Old French \"ataindre\" (to reach, seize), from Latin \"ad-\" (to) + \"tangere\" (to touch).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnəˌteɪnəˈbɪləti/","syllables":"un-at-tain-a-bil-i-ty"},"inflection":{"noun_plural":"unattainabilities (rarely used)"},"usage_notes":{"explanation":"\"Unattainability\" is a relatively formal and abstract noun. It is used to describe situations, goals, or objects that are impossible to reach or obtain, often due to inherent limitations or external factors. It emphasizes the state of being beyond reach, rather than simply being difficult to achieve.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unattainability of the mountain was because of the weather.","correct":"✓ The unattainability of reaching the mountain's peak was due to the weather.","note":"It's better to specify what is unattainable. In this case, it's the reaching of the peak, not the mountain itself. Also, the phrase \"because of\" is less formal than \"due to\" and may not be appropriate in all contexts where \"unattainability\" is used."},{"incorrect":"✗ He felt unattainability when he saw the test.","correct":"✓ He felt a sense of unattainability when he saw the test. / ✓ He felt that passing the test was unattainable.","note":"\"Unattainability\" is a noun, not a feeling. You can feel a sense of unattainability, or you can feel that something is unattainable."}],"priority":"★☆☆"},"related_words":{"derivatives":["unattainable (adjective): not able to be attained","attainability (noun): the state of being able to be attained","attainable (adjective): able to be attained","attain (verb): to reach or achieve something"],"phrases":["sense of unattainability","feeling of unattainability"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unattainability\" is a complex and abstract noun that describes the state of something being impossible to reach or achieve. It is typically used in formal contexts to discuss abstract concepts or goals that are inherently out of reach. Understanding this word requires a strong vocabulary and the ability to grasp abstract ideas. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The **unattainability** of absolute justice is a recurring theme in philosophical debates.","translation":"絶対的な正義の達成不能性は、哲学的な議論における繰り返しのテーマである。","type":"noun","meaning_category":"impossibility"},{"sentence":"The **unattainability** of the summit, given the storm, forced the climbers to turn back.","translation":"嵐のため、頂上への到達不能性が登山者たちに引き返すことを強いた。","type":"noun","meaning_category":"inaccessibility"},{"sentence":"The artist explored the theme of **unattainability** in her series of paintings.","translation":"そのアーティストは、一連の絵画の中で達成不能性というテーマを探求した。","type":"noun","meaning_category":"impossibility"}]}