{"word":"Pan-Germanism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"汎ゲルマン主義","english_definition":"The idea or political movement advocating the unification of all German-speaking people into a single nation or state.","examples":[{"sentence":"Pan-Germanism was a significant political force in the 19th and early 20th centuries.","translation":"汎ゲルマン主義は、19世紀から20世紀初頭にかけて重要な政治勢力だった。"},{"sentence":"The ideology of Pan-Germanism contributed to the outbreak of World War I.","translation":"汎ゲルマン主義のイデオロギーは、第一次世界大戦の勃発に寄与した。"}],"collocations":["promote Pan-Germanism (汎ゲルマン主義を推進する)","the ideology of Pan-Germanism (汎ゲルマン主義のイデオロギー)","historical Pan-Germanism (歴史的な汎ゲルマン主義)"],"synonyms":["German nationalism","Greater German ideology"],"antonyms":["Anti-Germanism","particularism"]},{"part_of_speech":"noun","definition":"(より広義に) ゲルマン民族の文化、利益、団結を促進する思想や運動","english_definition":"More broadly, any ideology or movement promoting the cultural, economic, or political unity and interests of the Germanic peoples.","examples":[{"sentence":"Some scholars interpret aspects of Nordic identity movements as a form of Pan-Germanism.","translation":"一部の研究者は、北欧アイデンティティ運動の側面を汎ゲルマン主義の一形態として解釈している。"}],"collocations":["modern Pan-Germanism (現代の汎ゲルマン主義)","cultural Pan-Germanism (文化的な汎ゲルマン主義)"],"synonyms":["Germanic unity","Germanic solidarity"],"antonyms":["cultural separatism"]}],"etymology":{"value":"\"Pan-\" (all, encompassing) + \"German\" + \"-ism\" (ideology, movement). Reflects the idea of uniting all German-speaking or Germanic peoples.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpænˈdʒɜːrmənɪzəm/","syllables":"Pan-Ger-man-ism"},"inflection":{"notes":"Uncountable noun"},"usage_notes":{"explanation":"\"Pan-Germanism\" refers specifically to the political ideology advocating for the unification of all German-speaking people into a single state. It is historically associated with 19th and early 20th-century German nationalism and expansionist policies. The term can also be used more broadly to describe movements promoting Germanic cultural or ethnic unity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Pan-Germanism is the same as German culture.","correct":"✓ Pan-Germanism is a political ideology related to German nationalism.","note":"Pan-Germanism is a political ideology, not simply German culture itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["Pan-German (adjective)","German nationalism","Volkisch movement"],"historical_context":["German Empire","World War I","Nazism"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency; primarily used in historical or political contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Pan-Germanism\" is a term used in history and political science to describe the ideology promoting the unification of all German-speaking peoples into a single nation. It is a complex concept tied to German nationalism and historical events like World War I. Understanding this term requires knowledge of European history and political ideologies. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The rise of Pan-Germanism in the 19th century fueled tensions in Europe.","translation":"19世紀の汎ゲルマン主義の台頭は、ヨーロッパの緊張を高めた。","type":"historical context","meaning_category":"political ideology"},{"sentence":"Some historians argue that Pan-Germanism was a precursor to Nazi ideology.","translation":"一部の歴史家は、汎ゲルマン主義がナチズムの先駆けだったと主張している。","type":"historical analysis","meaning_category":"political ideology"}]}