{"word":"games-player","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ゲームをする人、ゲーム愛好家、競技者","english_definition":"A person who plays games, especially regularly or skillfully.","examples":[{"sentence":"He is a keen games-player and enjoys both video games and board games.","translation":"彼は熱心なゲーム愛好家で、ビデオゲームもボードゲームも楽しんでいます。"},{"sentence":"As a skilled games-player, she often wins tournaments.","translation":"熟練したゲーム競技者として、彼女はしばしばトーナメントで優勝します。"},{"sentence":"The online community is full of avid games-players.","translation":"オンラインコミュニティは熱心なゲーム愛好家でいっぱいです。"}],"collocations":["avid games-player (熱心なゲーム愛好家)","skilled games-player (熟練したゲーム競技者)","casual games-player (カジュアルなゲームプレイヤー)","professional games-player (プロのゲームプレイヤー)"],"synonyms":["gamer","player","competitor","enthusiast"],"antonyms":["non-gamer","spectator"]},{"part_of_speech":"noun","definition":"駆け引きをする人、策略家、打算的な人","english_definition":"A person who manipulates situations or people for their own advantage; a strategist.","examples":[{"sentence":"He is a ruthless games-player in the political arena.","translation":"彼は政界では冷酷な策略家です。"},{"sentence":"She is a clever games-player, always thinking several steps ahead.","translation":"彼女は賢い策略家で、常に数手先を読んでいます。"},{"sentence":"In business, you have to be a games-player to succeed.","translation":"ビジネスで成功するには、駆け引きをする人でなければなりません。"}],"collocations":["ruthless games-player (冷酷な策略家)","clever games-player (賢い策略家)","political games-player (政治的な駆け引きをする人)","business games-player (ビジネスで駆け引きをする人)"],"synonyms":["strategist","manipulator","schemer","tactician"],"antonyms":["naive person","straightforward person"]}],"etymology":{"value":"The term is a compound word formed by combining 'games' (referring to activities played for amusement or competition) and 'player' (a person who participates in an activity). The meaning evolved from simply someone who plays games to also describe someone who engages in strategic or manipulative behavior.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡeɪmzˌpleɪər/","syllables":"games-play-er"},"inflection":{"noun_plural":"games-players"},"usage_notes":{"explanation":"The term 'games-player' can refer to someone who enjoys playing games as a hobby or someone who is skilled at games and plays them competitively. It can also describe someone who uses strategic or manipulative tactics in various situations, not necessarily related to games. The context usually clarifies which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a good game-player.","correct":"✓ He is a good games-player.","note":"When referring to someone who plays multiple games or is generally a player of games, use the plural form 'games-player.'"},{"incorrect":"✗ She is games player in politics.","correct":"✓ She is a games-player in politics.","note":"Use the article 'a' before 'games-player' when referring to someone as a type of person."}],"priority":"★★☆"},"related_words":{"derivatives":["gameplay (ゲームプレイ)","game (ゲーム)","player (プレイヤー)"],"phrases":["play games (ゲームをする、駆け引きをする)","the name of the game (最も重要なこと、本質)"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but understood in context.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'games-player' has two main meanings: someone who enjoys playing games, and someone who uses strategic tactics to gain an advantage. The first meaning is straightforward and refers to a hobbyist or competitor in games. The second meaning is more abstract and describes someone who is manipulative or strategic in various contexts, such as politics or business. Understanding the context is crucial to interpreting the intended meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The club is looking for skilled games-players to join their team.","translation":"クラブはチームに参加する熟練したゲーム競技者を探しています。","type":"noun","meaning_category":"ゲーム競技者"},{"sentence":"He proved to be a formidable games-player during the negotiations.","translation":"彼は交渉中に手ごわい策略家であることがわかった。","type":"noun","meaning_category":"策略家"},{"sentence":"She is an avid games-player and spends hours playing online.","translation":"彼女は熱心なゲーム愛好家で、何時間もオンラインで遊んでいます。","type":"noun","meaning_category":"ゲーム愛好家"},{"sentence":"In the corporate world, you often have to be a games-player to climb the ladder.","translation":"企業の世界では、出世するためにはしばしば駆け引きをする人でなければならない。","type":"noun","meaning_category":"策略家"}]}