{"word":"unsoldiery","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Not soldierly; lacking the qualities or characteristics expected of a soldier.","english_definition":"Not exhibiting or possessing the qualities expected of a soldier, such as discipline, bravery, or loyalty.","examples":[{"sentence":"His unsoldiery conduct during the battle led to a court-martial.","translation":"彼の戦闘中の兵士らしくない行動は、軍法会議につながった。"},{"sentence":"The general criticized the unsoldiery behavior of some of the recruits.","translation":"将軍は新兵の一部の兵士らしくない振る舞いを批判した。"}],"collocations":["unsoldiery conduct","unsoldiery behavior","unsoldiery appearance","unsoldiery manner"],"synonyms":["unmilitary","unprofessional","undisciplined","cowardly","disloyal"],"antonyms":["soldierly","military","disciplined","brave","loyal"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to 'soldiery,' which refers to soldiers collectively or the qualities associated with soldiers.","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈsoʊldʒəri/","syllables":"un-sol-dier-y"},"inflection":{"notes":"Adjective; comparative and superlative forms (more unsoldiery, most unsoldiery) exist but are rarely used."},"usage_notes":{"explanation":"'Unsoldiery' is used to describe actions, behaviors, or appearances that are inappropriate or unbecoming of a soldier. It implies a deviation from the expected standards of military conduct. It is a relatively uncommon word, often replaced by more common terms like 'unmilitary' or 'undisciplined.'","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unsoldiery was evident in their lack of training.","correct":"✓ The unsoldiery behavior was evident in their lack of training.","note":"'Unsoldiery' is an adjective and must modify a noun. 'Unsoldierly behavior' is a correct usage."},{"incorrect":"✗ He acted very unsoldiery.","correct":"✓ He acted in an unsoldiery manner.","note":"Since 'unsoldiery' is an adjective, it needs to be used with a noun (e.g., manner, fashion, way) to describe how someone acted."}],"priority":"★★☆"},"related_words":{"derivatives":["soldier (noun)","soldierly (adjective)","soldiery (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (not commonly used)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Unsoldiery' is a relatively rare and formal word used to describe something that is not characteristic of or appropriate for a soldier. It implies a lack of discipline, bravery, or loyalty expected in military personnel. Due to its infrequent use, it is more likely to be encountered in formal writing or historical contexts. Understanding the root word 'soldiery' is helpful in deciphering its meaning."},"example_sentences":[{"sentence":"The officer was reprimanded for his unsoldiery language in front of the troops.","translation":"その士官は、部隊の前での兵士らしくない言葉遣いを理由に叱責された。","type":"adjective","meaning_category":"lacking soldierly qualities"},{"sentence":"Such unsoldiery behavior undermines the morale of the entire unit.","translation":"そのような兵士らしくない振る舞いは、部隊全体の士気を低下させる。","type":"adjective","meaning_category":"inappropriate for a soldier"}]}