{"word":"intertriginous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"（医学）間擦部の、間擦疹の","english_definition":"(medicine) relating to or affecting intertrigo, or occurring in intertriginous areas (areas where skin rubs together).","examples":[{"sentence":"The patient presented with an intertriginous rash.","translation":"患者は間擦疹を発症して来院した。"},{"sentence":"Intertriginous dermatitis is common in obese individuals.","translation":"間擦部皮膚炎は肥満の人によく見られる。"}],"collocations":["intertriginous dermatitis (間擦部皮膚炎)","intertriginous area (間擦部)","intertriginous rash (間擦疹)"],"synonyms":["flexural","crease-related"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin words 'inter' (between) and 'terere' (to rub), combined with the suffix '-inous' (relating to).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪntərˈtrɪdʒɪnəs/","syllables":"in-ter-trig-i-nous"},"inflection":{"adjective_forms":{}},"usage_notes":{"explanation":"'Intertriginous' is a medical term specifically used to describe conditions or areas of the body where skin surfaces are in close proximity and rub together, such as the armpits, groin, and between skin folds. It is often used in the context of skin conditions like intertrigo.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cream is good for any skin.","correct":"✓ The cream is good for intertriginous skin.","note":"Use 'intertriginous' specifically when referring to skin in areas where skin rubs together."}],"priority":"★☆☆"},"related_words":{"derivatives":["intertrigo (名詞: 間擦疹)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'intertriginous' is a specialized medical term referring to areas of the body where skin rubs together, such as the armpits or groin. It is typically used in medical contexts to describe conditions like intertrigo, an inflammatory skin condition. Due to its specific usage, it is not commonly encountered outside of medical or dermatological discussions."},"example_sentences":[{"sentence":"The doctor noted an intertriginous infection during the examination.","translation":"医師は診察中に間擦部感染症を確認した。","type":"adjective","meaning_category":"間擦部の"},{"sentence":"Maintaining good hygiene can prevent intertriginous problems.","translation":"良好な衛生状態を保つことで、間擦部の問題を予防できる。","type":"adjective","meaning_category":"間擦部の"}]}