{"word":"floriscope","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"花言葉辞典、花言葉集","english_definition":"A dictionary or collection of flower meanings; the language of flowers.","examples":[{"sentence":"She consulted her floriscope to determine the hidden message in the bouquet.","translation":"彼女は花束に隠されたメッセージを解読するために、花言葉辞典を調べた。"},{"sentence":"The Victorian era saw a surge in popularity for floriscopes.","translation":"ヴィクトリア時代には、花言葉辞典の人気が急上昇した。"}],"collocations":["consult a floriscope","Victorian floriscope"],"synonyms":["flower dictionary","language of flowers"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'flos' (flower) and 'scope' (instrument for viewing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈflɔːrɪˌskoʊp/","syllables":"flo-ri-scope"},"inflection":{"noun_plural":"florisopes"},"usage_notes":{"explanation":"A floriscope is a book or guide that explains the symbolic meanings associated with different flowers. It was particularly popular during the Victorian era, when people used flowers to convey messages that they couldn't express openly.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a floriscope to water my plants.","correct":"✓ I used a floriscope to understand the meaning of the flowers.","note":"A floriscope is a dictionary, not a tool for gardening."}],"priority":"★★☆"},"related_words":{"derivatives":["floristic (adjective: relating to the flora of a region)","floristry (noun: the art of arranging flowers)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word 'floriscope' is a relatively uncommon word referring to a dictionary of flower meanings. It is most often encountered in historical contexts, especially when discussing Victorian-era customs and communication. Understanding the term requires a good vocabulary and familiarity with historical practices.","priority":"★★☆"},"example_sentences":[{"sentence":"The secret lovers exchanged flowers, relying on the floriscope to convey their true feelings.","translation":"秘密の恋人たちは、花言葉辞典を頼りに、真の感情を伝えるために花を交換した。","type":"noun","meaning_category":"花言葉辞典"},{"sentence":"Many Victorian novels reference the use of a floriscope to interpret floral gifts.","translation":"多くのヴィクトリア朝の小説は、花の贈り物を解釈するために花言葉辞典を使用することに言及している。","type":"noun","meaning_category":"花言葉辞典"}]}