{"word":"Cumaru","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"クマルの木、またはその木材","english_definition":"A South American tree (Dipteryx odorata) yielding fragrant seeds used as a vanilla substitute, or the timber from this tree.","examples":[{"sentence":"Cumaru is a popular choice for decking due to its durability.","translation":"クマルの木材は耐久性があるため、デッキ材として人気があります。"},{"sentence":"The seeds of the Cumaru tree are sometimes used in perfumes.","translation":"クマルの木の種子は、香水に使われることがあります。"}],"collocations":["Cumaru decking","Cumaru seeds","Cumaru oil"],"synonyms":["Brazilian teak","Tonka bean tree"],"antonyms":[]}],"etymology":{"value":"From Portuguese 'cumaru', which is derived from a Tupi language.","priority":"★★☆"},"pronunciation":{"ipa":"/kuˈmɑːruː/","syllables":"cu-ma-ru"},"inflection":{"noun_plural":"Cumarus"},"usage_notes":{"explanation":"Cumaru is primarily used to refer to the tree species *Dipteryx odorata* or its durable wood. The seeds are also known as tonka beans and have a vanilla-like fragrance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I want to buy a furniture made of cumaru.","correct":"✓ I want to buy furniture made of cumaru.","note":"'Furniture' is generally an uncountable noun. Therefore, it does not need an article 'a' before it."}],"priority":"★☆☆"},"related_words":{"derivatives":["Tonka bean"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cumaru' is a specialized term referring to a specific type of tree and its products, primarily used in contexts related to botany, forestry, woodworking, and sometimes culinary arts or perfumery due to the tree's fragrant seeds. It is not a common word in everyday conversation and is more likely to appear in technical or descriptive writing. Understanding the term requires some familiarity with these specialized fields."},"example_sentences":[{"sentence":"The **Cumaru** floor added a touch of elegance to the room.","translation":"クマルの床は部屋に優雅さを添えた。","type":"noun","meaning_category":"wood"},{"sentence":"The aroma of **Cumaru** beans filled the air with a sweet scent.","translation":"クマルの豆の香りが甘い香りで空気を満たした。","type":"noun","meaning_category":"seeds"}]}