{"word":"drawboring","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A method of joining pieces of wood using a drawbore pin to align the pieces, then driving a peg through offset holes to create tension and a tight joint.","english_definition":"A method of joining pieces of wood using a drawbore pin to align the pieces, then driving a peg through offset holes to create tension and a tight joint.","examples":[{"sentence":"The craftsman used drawboring to create a strong and durable mortise and tenon joint.","translation":"職人はドローボーリングを用いて、丈夫で耐久性のあるほぞ穴とほぞの接合部を作成した。"}],"collocations":["drawbore pin","mortise and tenon joint","woodworking","timber framing"],"synonyms":["drawbore pinning","drift pinning"],"antonyms":[]}],"etymology":{"value":"From 'draw' (to pull) and 'bore' (to drill), referring to the process of drawing the pieces together by boring offset holes.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdrɔːˌbɔːrɪŋ/","syllables":"draw-bor-ing"},"inflection":{"noun_plural":"drawborings"},"usage_notes":{"explanation":"Drawboring is a traditional woodworking technique used to create strong joints, particularly in timber framing. The offset holes and the driving of the peg create tension that pulls the joint tight and prevents it from loosening over time.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ draw boring","correct":"✓ drawboring","note":"While 'draw boring' might be understood, the single-word form 'drawboring' is more common and specific to the woodworking technique."}],"priority":"★☆☆"},"related_words":{"derivatives":["drawbore (noun: the hole created in drawboring)","drawbore pin (noun: the pin used to align the pieces)"]},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'drawboring' is highly specialized and likely only encountered in the context of traditional woodworking or timber framing. Understanding requires familiarity with woodworking terminology and techniques."},"example_sentences":[{"sentence":"Proper drawboring ensures the mortise and tenon joint will remain secure for generations.","translation":"適切なドローボーリングは、ほぞ穴とほぞの接合部が何世代にもわたって安全であることを保証する。","type":"noun","meaning_category":"woodworking technique"},{"sentence":"He learned the art of drawboring from his grandfather, a master carpenter.","translation":"彼は、熟練した大工である祖父からドローボーリングの技術を学んだ。","type":"noun","meaning_category":"woodworking technique"}]}