{"word":"Pelean","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(火山学) プレー式噴火の、ペレー山の","english_definition":"Relating to or characteristic of a type of volcanic eruption (Pelean eruption) involving a violent explosion of gas and ash, typically producing a pyroclastic flow. Also, relating to Mount Pelée, a volcano on the island of Martinique.","examples":[{"sentence":"The eruption was characterized as a Pelean-type event.","translation":"その噴火はプレー式噴火の特徴を持つものとされた。"},{"sentence":"Pelean flows are extremely dangerous due to their high speed and temperature.","translation":"プレー式噴火による火砕流は、その速度と温度の高さから非常に危険である。"}],"collocations":["Pelean eruption","Pelean flow","Pelean-type","Mount Pelée"],"synonyms":["pyroclastic","volcanic","explosive"],"antonyms":[]}],"etymology":{"value":"Named after Mount Pelée, a volcano on the Caribbean island of Martinique, which experienced a devastating eruption in 1902.","priority":"★★★"},"pronunciation":{"ipa":"/pəˈliːən/","syllables":"pe-le-an"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Pelean' is primarily used in the context of volcanology to describe a specific type of eruption characterized by the explosive ejection of pyroclastic flows. It is also used to refer to features and phenomena associated with this type of eruption.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Pelean eruption caused a tsunami.","correct":"✓ The Pelean eruption caused pyroclastic flows.","note":"Pelean eruptions are characterized by pyroclastic flows, not necessarily tsunamis, although large eruptions can indirectly cause them."}],"priority":"★★☆"},"related_words":{"derivatives":["Pelee (Mount Pelée)","pyroclastic flow"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pelean' is a technical term primarily used in volcanology. It refers to a specific type of volcanic eruption characterized by the explosive ejection of pyroclastic flows. Understanding this term requires familiarity with basic volcanological concepts. It is not commonly used outside of scientific or specialized contexts."},"example_sentences":[{"sentence":"The 1902 eruption of Mount Pelée was a classic example of a Pelean eruption.","translation":"1902年のモン・プレーの噴火は、プレー式噴火の典型的な例だった。","type":"adjective","meaning_category":"volcanology"},{"sentence":"Pelean flows can travel at speeds exceeding 100 miles per hour.","translation":"プレー式噴火による火砕流は、時速100マイルを超える速度で移動することがある。","type":"adjective","meaning_category":"volcanology"}]}