{"word":"glucocorticoid","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"糖質コルチコイド","english_definition":"A class of steroid hormones that bind to the glucocorticoid receptor, present in nearly every vertebrate animal cell. They are part of the feedback mechanism in the immune system which reduces certain aspects of immune function, such as inflammation.","examples":[{"sentence":"Glucocorticoids are used to treat inflammatory conditions.","translation":"糖質コルチコイドは炎症性疾患の治療に使用される。"},{"sentence":"Long-term use of glucocorticoids can have side effects.","translation":"糖質コルチコイドの長期使用は副作用を引き起こす可能性がある。"}],"collocations":["glucocorticoid receptor","synthetic glucocorticoid","glucocorticoid therapy"],"synonyms":["corticosteroid"],"antonyms":[],"related_terms":["mineralocorticoid","steroid hormone","adrenal cortex"]}],"etymology":{"value":"From 'gluco-' (referring to glucose or sugar), 'cortic-' (referring to the cortex of the adrenal gland where these hormones are produced), and '-oid' (meaning resembling).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡluːkəˈkɔːrtɪkɔɪd/","syllables":"glu-co-cor-ti-coid"},"inflection":{"noun_plural":"glucocorticoids"},"usage_notes":{"explanation":"Glucocorticoids are a type of corticosteroid hormone that are produced in the adrenal cortex. They have a wide range of effects on the body, including regulating metabolism, immune function, and inflammation. They are often used as medications to treat inflammatory and autoimmune diseases.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ glucocorticoid are a type of steroid.","correct":"✓ glucocorticoids are a type of steroid.","note":"'Glucocorticoid' is a countable noun, so it needs to be pluralized when referring to the class of hormones."}],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in scientific and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Glucocorticoid' is a technical term primarily used in medicine and biology. It refers to a type of steroid hormone that affects glucose metabolism and has anti-inflammatory properties. It's important to understand its role in the endocrine and immune systems if you're studying these fields."},"example_sentences":[{"sentence":"The doctor prescribed a glucocorticoid cream for the skin rash.","translation":"医師は皮膚の発疹に対して糖質コルチコイドクリームを処方した。","type":"general","meaning_category":"medical"},{"sentence":"Glucocorticoid resistance is a significant challenge in treating some diseases.","translation":"糖質コルチコイド抵抗性は、一部の疾患の治療における重要な課題である。","type":"scientific","meaning_category":"medical research"}]}