{"word":"thunder-maned","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"雷のようなたてがみを持つ、雷鳴のようなたてがみを持つ","english_definition":"Having a mane resembling thunder, either in color, sound, or power.","examples":[{"sentence":"The artist depicted the mythical beast as a thunder-maned stallion, its hooves striking sparks from the ground.","translation":"そのアーティストは、神話上の獣を雷鳴のようなたてがみを持つ雄馬として描き、その蹄は地面から火花を散らしていた。"},{"sentence":"In the poem, the hero rides a thunder-maned steed into battle, a symbol of his untamed power.","translation":"その詩では、英雄は雷のようなたてがみを持つ馬に乗って戦場に向かい、彼の制御不能な力の象徴となっている。"}],"collocations":["thunder-maned stallion","thunder-maned steed","thunder-maned horse"],"synonyms":["powerful-maned","storm-maned","lightning-maned"],"antonyms":["weak-maned","gentle-maned"]}],"etymology":{"value":"A compound word formed from 'thunder' (referring to the loud noise and power of a thunderstorm) and 'maned' (having a mane, typically of a horse or lion). The combination suggests a mane that is either visually striking like lightning or sounds like thunder when moving.","priority":"★★★"},"pronunciation":{"ipa":"/ˈθʌndərˌmeɪnd/","syllables":"thun-der-maned"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be used in comparative and superlative forms (more thunder-maned, most thunder-maned)."},"usage_notes":{"explanation":"'Thunder-maned' is a descriptive adjective, often used in literature or figurative language to evoke a sense of power, wildness, and awe. It is most commonly applied to horses or other mythical creatures to emphasize their strength and imposing presence. The term is not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The thunder-maned horse was running quick.","correct":"✓ The thunder-maned horse was running quickly.","note":"'Quick' is an adjective, while 'quickly' is an adverb. Since 'running' is a verb, it needs to be modified by an adverb."},{"incorrect":"✗ He saw a thunder-mained horse.","correct":"✓ He saw a thunder-maned horse.","note":"The correct spelling is 'maned' (having a mane), not 'mained' (injured or crippled)."}],"priority":"★★☆"},"related_words":{"derivatives":["thunder (noun, verb)","mane (noun)"],"related_terms":["storm-tossed","tempestuous","powerful","wild","untamed"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (uncommon, likely C2 or above due to its figurative nature)","frequency_google_ngram":"Very low frequency - primarily used in literary or descriptive contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Thunder-maned' is a relatively uncommon and evocative adjective. It is used to describe something, typically a horse or mythical creature, as having a mane that is reminiscent of thunder. This could be due to its color (dark and stormy), its sound (roaring or powerful), or its overall impression of strength and energy. Due to its figurative and descriptive nature, it is more likely to be encountered in literature or creative writing than in everyday conversation. Understanding the component words ('thunder' and 'maned') is helpful in deciphering its meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The artist's rendering of the Valkyrie's steed showed a magnificent, thunder-maned creature, its eyes blazing with fire.","translation":"アーティストが描いたヴァルキリーの馬は、壮大で雷のようなたてがみを持つ生き物で、その目は炎を燃やしていた。","type":"descriptive","meaning_category":"descriptive"},{"sentence":"He imagined a thunder-maned beast galloping across the plains, a symbol of freedom and raw power.","translation":"彼は雷のようなたてがみを持つ獣が平原を駆け抜ける姿を想像し、自由と生の力の象徴とした。","type":"figurative","meaning_category":"figurative"}]}