{"word":"tetanizing","priority":"☆☆☆","meanings":[{"part_of_speech":"verb (present participle)","definition":"引きつけを起こさせる、強直させる","english_definition":"causing tetany or tetanus; inducing a state of sustained muscular contraction.","examples":[{"sentence":"The tetanizing effect of the toxin caused muscle spasms.","translation":"その毒素の強直作用は筋肉の痙攣を引き起こした。"},{"sentence":"The electrical stimulation was tetanizing the muscle fibers.","translation":"電気刺激は筋繊維を強直させていた。"}],"collocations":["tetanizing current","tetanizing stimulus","tetanizing effect"],"synonyms":["contracting","spasming","stiffening"],"antonyms":["relaxing","loosening"]}],"etymology":{"value":"From the verb 'tetanize', which is derived from 'tetanus' (a medical condition characterized by sustained muscle contractions) + '-ize' (a suffix indicating causation or action). 'Tetanus' comes from the Greek 'tetanos' (rigid, stretched), from 'teinein' (to stretch).","priority":"★★★"},"pronunciation":{"ipa":"/ˈtetənaɪzɪŋ/","syllables":"tet-a-niz-ing"},"inflection":{"verb_forms":{"present_simple":["tetanize","tetanizes"],"past_simple":"tetanized","past_participle":"tetanized","present_participle":"tetanizing"}},"usage_notes":{"explanation":"'Tetanizing' is primarily used in scientific or medical contexts to describe the process or effect of causing muscles to enter a state of sustained contraction, similar to what happens in tetanus. It's often used in discussions of physiology, neurology, and toxicology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The medicine was tetanizing the patient.","correct":"✓ The medicine was causing tetany in the patient.","note":"Unless the medicine is directly causing muscle contractions, it's more appropriate to say it's 'causing tetany' or 'inducing tetanus'. 'Tetanizing' implies a direct action on the muscles. "},{"incorrect":"✗ The athlete was tetanizing after the race.","correct":"✓ The athlete was experiencing muscle cramps after the race.","note":"'Tetanizing' refers to a specific physiological process. Muscle cramps are more general and don't necessarily involve the sustained contraction characteristic of tetany."}],"priority":"★★☆"},"related_words":{"derivatives":["tetanize (verb)","tetanus (noun)","tetanic (adjective)","tetany (noun)"],"related_terms":["muscle contraction","muscle spasm","neuromuscular junction","action potential"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tetanizing' is a technical term used in medicine and physiology. It describes the process of causing a muscle to enter a state of sustained contraction, similar to what occurs in the disease tetanus. It is not a commonly used word in everyday language. You'll typically encounter it in scientific articles, textbooks, or medical discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The researcher observed the tetanizing effect of the drug on the isolated muscle tissue.","translation":"研究者は、その薬物が単離された筋肉組織に及ぼす強直作用を観察した。","type":"scientific","meaning_category":"physiology"},{"sentence":"The high-frequency stimulation was tetanizing the nerve, preventing it from firing properly.","translation":"高頻度の刺激は神経を強直させ、正常な発火を妨げていた。","type":"scientific","meaning_category":"neurology"},{"sentence":"The toxin works by tetanizing the respiratory muscles, leading to respiratory failure.","translation":"その毒素は呼吸筋を強直させることで作用し、呼吸不全を引き起こす。","type":"medical","meaning_category":"toxicology"}]}