{"word":"Tubipore","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A genus of octocorals, also known as organ pipe corals, characterized by their bright red calcareous skeletons.","english_definition":"A genus of octocorals, commonly known as organ pipe corals, characterized by their distinctive bright red calcareous skeletons.","examples":[{"sentence":"The Tubipore coral adds a vibrant color to the reef.","translation":"オオヤギカイメンサンゴは、サンゴ礁に鮮やかな色を添えます。"}],"collocations":["organ pipe coral","red coral","reef coral"],"synonyms":["organ pipe coral"],"antonyms":[]}],"etymology":{"value":"Derived from Latin 'tubus' (tube) and 'porus' (pore), referring to the tubular structure of the coral's skeleton.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtjuːbɪˈpɔːr/","syllables":"Tu-bi-pore"},"inflection":{"noun_plural":"Tubipores"},"usage_notes":{"explanation":"'Tubipore' is primarily used in marine biology and aquarium-keeping contexts. It refers specifically to corals of the genus Tubipora, known for their unique appearance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a tubipora at the zoo.","correct":"✓ I saw a tubipora at the aquarium.","note":"Tubipore are marine animals, so they are found in aquariums, not zoos."}],"priority":"★☆☆"},"related_words":{"derivatives":["Tubipora (genus name)"],"phrasal_verbs":[]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tubipore' is a technical term used in marine biology. Understanding requires familiarity with coral taxonomy. It's not commonly used outside of scientific or specialized contexts."},"example_sentences":[{"sentence":"Divers often admire the delicate structure of Tubipore colonies.","translation":"ダイバーはしばしば、オオヤギカイメンサンゴの繊細な構造に感嘆します。","type":"noun","meaning_category":"coral"},{"sentence":"The aquarium featured a stunning display of Tubipore and other reef-building corals.","translation":"水族館には、オオヤギカイメンサンゴやその他の造礁サンゴの見事な展示がありました。","type":"noun","meaning_category":"coral"}]}