{"word":"Phascolome","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Zoology) A hypothetical or theoretical marsupial ancestor, proposed to be ancestral to wombats and koalas.","english_definition":"A hypothetical or theoretical marsupial ancestor, proposed to be ancestral to wombats and koalas.","examples":[{"sentence":"The phascolome is a theoretical construct used in discussions of marsupial evolution.","translation":"フラスコロメは、有袋類の進化に関する議論で使用される理論的な構成概念です。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the genus name *Phascolomys* (wombats) and used to denote a common ancestor.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfæskəloʊm/","syllables":"Phas-co-lome"},"inflection":{"noun_plural":"phascolomes"},"usage_notes":{"explanation":"The term 'phascolome' is primarily used in academic and scientific contexts when discussing the evolutionary relationships of Australian marsupials, particularly wombats and koalas. It's important to note that this is a hypothetical ancestor, and no fossil evidence directly confirms its existence.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Phascolomyidae (family of wombats)"],"related_terms":["Diprotodontia (order including wombats, koalas, kangaroos)","Vombatiformes (suborder including wombats and koalas)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency (Specialized scientific term)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Phascolome' is a highly specialized term used within the field of zoology and evolutionary biology. It refers to a hypothetical common ancestor of wombats and koalas, and its usage is primarily confined to academic discussions and scientific literature. Understanding this term requires a solid background in marsupial evolution.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The concept of the phascolome helps to explain the shared anatomical features of wombats and koalas.","translation":"フラスコロメの概念は、ウォンバットとコアラの共有された解剖学的特徴を説明するのに役立ちます。","type":"noun","meaning_category":"Zoology"}]}