{"word":"quarter-cut","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(木材)柾目の、柾目切りの","english_definition":"(of lumber) sawn so that the annual rings are generally at right angles to the surface of the board.","examples":[{"sentence":"Quarter-cut oak is often used for high-quality furniture.","translation":"柾目切りのオーク材は、高品質の家具によく使用されます。"},{"sentence":"The quarter-cut method produces boards with a beautiful grain pattern.","translation":"柾目切りという方法は、美しい木目模様の板を生み出します。"}],"collocations":["quarter-cut oak (柾目切りのオーク材)","quarter-cut lumber (柾目切りの木材)","quarter-cut veneer (柾目切りのベニヤ)"],"synonyms":["radially sawn","rift-sawn"],"antonyms":["flat-sawn","plain-sawn"]},{"part_of_speech":"noun","definition":"(木材)柾目切り","english_definition":"lumber that has been quarter-cut.","examples":[{"sentence":"The cabinetmaker preferred quarter-cut for its stability.","translation":"その家具職人は、安定性のために柾目切りを好みました。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term 'quarter-cut' refers to the method of sawing a log into four quarters and then sawing each quarter perpendicular to the annual rings.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkwɔːrtərˌkʌt/","syllables":"quar-ter-cut"},"inflection":{"notes":"The word 'quarter-cut' can function as both an adjective and a noun. As an adjective, it describes the type of cut. As a noun, it refers to the wood itself that has been cut in this way."},"usage_notes":{"explanation":"'Quarter-cut' is primarily used in the context of lumber and woodworking. It describes a specific way of sawing logs to produce wood with a straight grain pattern and increased stability. This method is more expensive and wasteful than plain sawing, but it yields higher-quality wood that is less prone to warping and shrinking.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used quarter cut wood for the project.","correct":"✓ He used quarter-cut wood for the project.","note":"The term is typically hyphenated when used as an adjective before a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["quarter-sawing"],"phrasal_verbs":[],"related_terms":["flat-sawn","plain-sawn","rift-sawn","radially sawn","lumber","woodworking"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Quarter-cut' is a technical term used in woodworking and lumber industries. It refers to a specific method of sawing logs to produce lumber with a straight grain pattern and increased stability. Understanding this term requires familiarity with woodworking techniques and lumber grading. It is not commonly used outside of these specific contexts."},"example_sentences":[{"sentence":"The **quarter-cut** boards were more expensive but worth it for the stability.","translation":"柾目切りの板はより高価でしたが、安定性のためにそれだけの価値がありました。","type":"adjective","meaning_category":"describing wood"},{"sentence":"He specified **quarter-cut** for the table legs to prevent warping.","translation":"彼はテーブルの脚が歪むのを防ぐために柾目切りを指定しました。","type":"noun","meaning_category":"referring to the wood"}]}