{"word":"Altaic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"アルタイ語族の、アルタイ語族に属する","english_definition":"Relating to or denoting a family of languages including Turkic, Mongolic, and Tungusic.","examples":[{"sentence":"The Altaic language family is a controversial grouping.","translation":"アルタイ語族は論争の的となっている言語グループです。"}],"collocations":["Altaic languages","Altaic family","Altaic theory"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"アルタイ語族","english_definition":"A hypothetical language family that includes the Turkic, Mongolic, and Tungusic language families, and sometimes also the Korean and Japanese languages.","examples":[{"sentence":"The existence of the Altaic language family is debated among linguists.","translation":"アルタイ語族の存在は言語学者の間で議論されています。"}],"collocations":["Altaic languages","Altaic family","Altaic hypothesis"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term 'Altaic' comes from the Altai Mountains, a mountain range in Central Asia, considered by some to be the Urheimat (original homeland) of the speakers of these languages.","priority":"★★☆"},"pronunciation":{"ipa":"/ælˈteɪɪk/","syllables":"Al-tai-ic"},"inflection":{"notes":"The term 'Altaic' can function as both an adjective and a noun, so inflection is not applicable."},"usage_notes":{"explanation":"The term 'Altaic' is used to refer to a proposed language family. However, the validity of the Altaic language family is highly debated among linguists. Some linguists support the Altaic hypothesis, while others reject it, arguing that similarities between these languages are due to language contact rather than common ancestry.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Altaic is a language.","correct":"✓ Altaic is a language family (hypothesis).","note":"'Altaic' refers to a group of languages, not a single language."}],"priority":"★★☆"},"related_words":{"derivatives":["Turkic","Mongolic","Tungusic","Korean","Japanese"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Altaic' is a linguistic term referring to a hypothetical language family. It is used in academic contexts, particularly in discussions about comparative linguistics and language origins. Understanding the term requires familiarity with linguistic terminology and the history of language classification. The validity of the Altaic hypothesis is a subject of ongoing debate among linguists."},"example_sentences":[{"sentence":"Many linguists have studied the proposed **Altaic** language family.","translation":"多くの言語学者が提案されているアルタイ語族を研究してきました。","type":"adjective","meaning_category":"アルタイ語族の"},{"sentence":"The **Altaic** hypothesis suggests a common origin for Turkic, Mongolic, and Tungusic languages.","translation":"アルタイ語仮説は、テュルク語族、モンゴル語族、ツングース語族の共通の起源を示唆しています。","type":"noun","meaning_category":"アルタイ語族"}]}