{"word":"diphthongal","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"二重母音の、二重母音的な","english_definition":"relating to or characterized by a diphthong.","examples":[{"sentence":"The word \"boy\" has a diphthongal sound.","translation":"「boy」という単語は二重母音の音を持つ。"},{"sentence":"The pronunciation of this vowel is diphthongal in some dialects.","translation":"この母音の発音は、いくつかの方言では二重母音的である。"}],"collocations":["diphthongal vowel","diphthongal pronunciation","diphthongal glide"],"synonyms":["diphthongic"],"antonyms":["monophthongal"]}],"etymology":{"value":"From \"diphthong\" + \"-al\". \"Diphthong\" comes from Ancient Greek δίφθογγος (diphthongos), from δι- (di-, \"twice, double\") + φθόγγος (phthóngos, \"sound, voice\").","priority":"★★☆"},"pronunciation":{"ipa":"/dɪfˈθɔŋɡəl/","syllables":"diph-thong-al"},"inflection":{"notes":"Adjectives do not inflect in English, other than comparatives/superlatives."},"usage_notes":{"explanation":"'Diphthongal' is used to describe sounds or pronunciations that involve a diphthong, which is a vowel sound that starts near one vowel and moves toward another in the same syllable. It's a term primarily used in phonetics and linguistics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The word has a diphthongal letter.","correct":"✓ The word has a diphthongal sound.","note":"'Diphthongal' describes the sound, not the letter itself. The letter combination represents the diphthongal sound."}],"priority":"★★☆"},"related_words":{"derivatives":["diphthong (noun): a sound made by combining two vowels within a single syllable.","diphthongize (verb): to change a vowel into a diphthong."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Diphthongal' is a technical term used in phonetics and linguistics. It describes something related to a diphthong, which is a vowel sound where your mouth moves from one vowel position to another within the same syllable. Understanding this word requires familiarity with basic phonetic concepts."},"example_sentences":[{"sentence":"The teacher explained the diphthongal nature of the 'oi' sound in 'coin'.","translation":"先生は「coin」の「oi」の音が二重母音的であることを説明した。","type":"adjective","meaning_category":"phonetics"},{"sentence":"Some regional accents are characterized by more prominent diphthongal pronunciations.","translation":"地域によっては、より顕著な二重母音の発音によって特徴づけられるアクセントがある。","type":"adjective","meaning_category":"phonetics"}]}