{"word":"overdefiantly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"過度に反抗的に、度を超して反抗的に","english_definition":"In an excessively defiant manner; to an extreme degree of rebelliousness.","examples":[{"sentence":"The child acted overdefiantly, refusing to follow any instructions.","translation":"その子供は過度に反抗的な態度を取り、どんな指示にも従おうとしなかった。"},{"sentence":"He responded overdefiantly to the teacher's request, earning a detention.","translation":"彼は先生の要求に度を超して反抗的に答え、放課後居残りを言い渡された。"}],"collocations":["act overdefiantly","respond overdefiantly","behave overdefiantly"],"synonyms":["excessively rebelliously","extremely disobediently","intractably","obstreperously"],"antonyms":["obediently","submissively","compliantly"]}],"etymology":{"value":"Formed by combining the prefix 'over-' (meaning excessively or to an extreme degree) with the adverb 'defiantly' (in a rebellious or resistant manner).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊvərdiˈfaɪəntli/","syllables":"o-ver-de-fi-ant-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Overdefiantly' describes actions or behaviors that exhibit an extreme or excessive level of defiance. It suggests a degree of rebelliousness that goes beyond what might be expected or considered normal. This word is relatively rare and is used to emphasize the intensity of the defiance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted over defiant.","correct":"✓ He acted overdefiantly.","note":"'Overdefiantly' is an adverb, so it modifies a verb. 'Over defiant' is grammatically incorrect in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["overdefiant (adjective)","defiant (adjective)","defiance (noun)","defiantly (adverb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'overdefiantly' is a complex adverb that combines the concepts of excessiveness ('over-') and defiance ('defiantly'). It is used to describe actions or behaviors that exhibit an extreme or exaggerated level of rebelliousness. Understanding this word requires a strong grasp of both its component parts and the nuances of advanced vocabulary. Due to its rarity and complexity, it is more likely to be encountered in formal writing or specialized contexts."},"example_sentences":[{"sentence":"The protesters behaved overdefiantly, openly challenging the authority of the government.","translation":"抗議者たちは過度に反抗的な態度を取り、公然と政府の権威に挑戦した。","type":"adverb","meaning_category":"manner"},{"sentence":"Rather than negotiate, the company responded overdefiantly to the union's demands.","translation":"交渉する代わりに、会社は労働組合の要求に度を超して反抗的に対応した。","type":"adverb","meaning_category":"manner"}]}