{"word":"VOM","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(電気) ボルト・オーム・ミリメーター","english_definition":"(electronics) Volt-Ohm-Milliammeter; a device that measures voltage, resistance, and current.","examples":[{"sentence":"Use a VOM to check the voltage of the battery.","translation":"VOMを使ってバッテリーの電圧をチェックしてください。"},{"sentence":"The technician used a VOM to troubleshoot the circuit.","translation":"技術者はVOMを使って回路のトラブルシューティングを行った。"}],"collocations":["analog VOM","digital VOM","VOM meter"],"synonyms":["multimeter"],"antonyms":[]}],"etymology":{"value":"An acronym for Volt-Ohm-Milliammeter, describing the three electrical measurements the device can perform.","priority":"★★★"},"pronunciation":{"ipa":"/viː oʊ em/","syllables":"V-O-M"},"inflection":{"notes":"Plural: VOMs"},"usage_notes":{"explanation":"A VOM is a type of multimeter used to measure voltage (volts), resistance (ohms), and current (milliamps). It can be analog or digital.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a VOM to measure temperature.","correct":"✓ I used a VOM to measure voltage.","note":"A VOM measures voltage, resistance, and current, not temperature."}],"priority":"★★☆"},"related_words":{"derivatives":["voltmeter","ohmmeter","ammeter","multimeter"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"VOM is an acronym for Volt-Ohm-Milliammeter. It is a type of electronic measuring instrument that combines the functions of a voltmeter, ohmmeter, and ammeter into one unit. It is used to measure voltage, resistance, and current in electrical circuits. It is a technical term primarily used by electricians and electronics technicians.","priority":"★★☆"},"example_sentences":[{"sentence":"The electrician used a VOM to diagnose the electrical problem.","translation":"電気技師はVOMを使用して電気的な問題を診断しました。","type":"noun","meaning_category":"電気測定器"},{"sentence":"Before working on any electrical circuit, always use a VOM to ensure it is de-energized.","translation":"電気回路を操作する前に、必ずVOMを使用して電源が切れていることを確認してください。","type":"noun","meaning_category":"電気測定器"}]}