{"word":"topotype","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"模式産地標本、タイプ産地標本：ある種が最初に発見された場所（模式産地）で採取された標本。","english_definition":"A specimen of an organism collected from the same locality as the original type specimen.","examples":[{"sentence":"The topotype specimen helped clarify some ambiguities in the original species description.","translation":"模式産地標本は、元の種の説明におけるいくつかの曖昧さを明確にするのに役立った。"},{"sentence":"Researchers collected topotypes to study the genetic variation within the species.","translation":"研究者たちは、種内の遺伝的変異を研究するために模式産地標本を収集した。"}],"collocations":["collect topotypes","examine topotypes","study topotypes","topotype specimen","topotype series"],"synonyms":["paratype","neotype","holotype (related, but refers to the original specimen)"],"antonyms":[]}],"etymology":{"value":"「topo-」（場所、地域）+ 「type」（タイプ、型）から構成される。ギリシャ語の「topos」（場所）に由来。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtoʊpoʊˌtaɪp/","syllables":"to-po-type"},"inflection":{"noun_plural":"topotypes"},"usage_notes":{"explanation":"「**topotype**」は、生物学、特に分類学で使用される専門用語です。ある生物種が最初に記載された場所（模式産地）で採取された標本を指します。オリジナル標本（ホロタイプなど）が損傷または紛失した場合、または種の定義を明確にするために、追加の標本が必要な場合に収集されます。模式産地標本は、種の同定と分類において重要な役割を果たします。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The holotype is a topotype.","correct":"✓ The topotype is from the same location as the holotype, but is not the original specimen.","note":"ホロタイプはオリジナル標本であり、模式産地標本は同じ場所で採取された後続の標本です。"},{"incorrect":"✗ Topotypes are used to name new species.","correct":"✓ Holotypes are used to name new species. Topotypes help clarify existing species descriptions.","note":"新種の命名にはホロタイプが使用され、模式産地標本は既存の種の説明を明確にするために使用されます。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["holotype","paratype","neotype","type locality","taxonomy","systematics"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 生物学、特に分類学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**topotype**」は、生物学、特に分類学で使用される専門用語です。ある種が最初に記載された場所（模式産地）で採取された標本を指し、種の同定と分類において重要な役割を果たします。この単語は、生物学の研究者や専門家が使用することが一般的です。一般の人が日常会話で使用することはほとんどありません。"},"example_sentences":[{"sentence":"The museum's collection includes several topotypes of rare insect species.","translation":"その博物館のコレクションには、希少な昆虫種の模式産地標本がいくつか含まれている。","type":"noun","meaning_category":"標本"},{"sentence":"By comparing the topotype with other specimens, the researchers confirmed its species identification.","translation":"研究者たちは、模式産地標本を他の標本と比較することで、その種の同定を確認した。","type":"noun","meaning_category":"標本"}]}