{"word":"Perkinism","priority":"低","meanings":[{"part_of_speech":"noun","definition":"パーキンイズム：ウィリアム・ヘンリー・パーキン（William Henry Perkin）の研究、業績、または彼に影響を受けた化学分野の発展を指す言葉。特に、染料化学や有機化学の初期の発展に関連する。","english_definition":"Perkinism refers to the research, achievements, or the development of chemical fields influenced by William Henry Perkin, especially related to the early development of dye chemistry and organic chemistry.","examples":[{"sentence":"The conference highlighted the importance of Perkinism in the history of organic chemistry.","translation":"その会議では、有機化学の歴史におけるパーキンイズムの重要性が強調された。"},{"sentence":"Perkinism led to the creation of synthetic dyes that revolutionized the textile industry.","translation":"パーキンイズムは、繊維産業に革命をもたらした合成染料の創出につながった。"}],"collocations":["dye chemistry","organic chemistry","synthetic dyes","chemical industry"],"synonyms":["Perkin's influence","Perkin's legacy"],"antonyms":[]}],"etymology":{"value":"ウィリアム・ヘンリー・パーキン（William Henry Perkin, 1838-1907）に由来。パーキンは、世界初の合成有機染料であるモーブ（mauveine）を偶然に発見し、染料産業の発展に大きく貢献した。彼の業績や影響を称えるために「Perkinism」という言葉が用いられるようになった。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɜːrkɪnɪzəm/","syllables":"per-kin-i-sm"},"inflection":{"noun_plural":"Perkinisms"},"usage_notes":{"explanation":"「Perkinism」は、化学史や科学技術史の文脈で用いられる専門的な用語であり、日常会話で使われることはほとんどない。ウィリアム・ヘンリー・パーキンの業績、特に合成染料の発見とそれに関連する化学分野の発展を指す場合に限定される。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The new art movement was influenced by Perkinism.","correct":"✓ The new art movement was influenced by the use of synthetic dyes, a result of Perkin's discoveries.","note":"パーキンイズムは、化学分野に限定されるため、芸術運動に直接的な影響を与えることはない。合成染料の使用という間接的な影響を説明する必要がある。"},{"incorrect":"✗ Perkinism is a political ideology.","correct":"✓ Perkinism is related to the history of chemistry and the development of synthetic dyes.","note":"パーキンイズムは政治的なイデオロギーではない。化学史における特定の人物の業績と影響を指す。"}],"priority":"★☆☆"},"related_words":{"derivatives":["Perkin (ウィリアム・ヘンリー・パーキン)","mauveine (モーブ、パーキンが発見した最初の合成染料)","aniline dyes (アニリン染料)"],"phrases":["Perkin Medal (パーキンメダル、アメリカ化学会が授与する工業化学の賞)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「Perkinism」は、化学史や科学技術史の専門分野で使われる用語です。ウィリアム・ヘンリー・パーキンという科学者が合成染料を発見し、それが化学産業に大きな影響を与えたことを指します。この言葉は、パーキンの業績や彼の影響を受けた化学分野の発展を議論する際に使用されます。一般的にはあまり使われない専門用語なので、化学史に関心のある人が知っていれば十分でしょう。"},"example_sentences":[{"sentence":"The lecture focused on the impact of Perkinism on the development of the modern pharmaceutical industry.","translation":"その講義は、パーキンイズムが現代の製薬産業の発展に与えた影響に焦点を当てた。","type":"noun","meaning_category":"化学史における業績"},{"sentence":"The discovery of mauveine is considered a key event in the history of Perkinism.","translation":"モーブの発見は、パーキンイズムの歴史における重要な出来事とみなされている。","type":"noun","meaning_category":"合成染料の発見"}]}