{"word":"keup","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Korean pop music slang) A combination of K-pop and makeup, referring to the makeup styles and trends associated with K-pop idols.","english_definition":"(Korean pop music slang) A portmanteau of K-pop and makeup, referring to the makeup styles and trends associated with K-pop idols.","examples":[{"sentence":"Her keup is heavily influenced by Blackpink's Lisa.","translation":"彼女のkeupはBlackpinkのリサから大きな影響を受けている。"},{"sentence":"Many tutorials online show you how to achieve the perfect keup look.","translation":"オンライン上には、完璧なkeupルックを実現する方法を示すチュートリアルがたくさんある。"}],"collocations":["keup tutorial","keup look","keup style","K-pop makeup"],"synonyms":["K-beauty","K-pop makeup"],"antonyms":[]}],"etymology":{"value":"A portmanteau of 'K-pop' (Korean pop music) and 'makeup'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkeɪ.ʌp/","syllables":"ke-up"},"inflection":{"notes":"It is a noun, so it can be pluralized as 'keups', although it's not very common."},"usage_notes":{"explanation":"'Keup' is a relatively new slang term primarily used within the K-pop and beauty communities. It specifically refers to the makeup styles, techniques, and trends popularized by K-pop idols. It's often used in the context of tutorials, product recommendations, and discussions about achieving a K-pop-inspired aesthetic.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to a keup class to learn how to sing like a K-pop star.","correct":"✓ I'm going to a vocal class to learn how to sing like a K-pop star.","note":"'Keup' refers specifically to makeup, not general K-pop-related activities like singing or dancing."},{"incorrect":"✗ She's a keup artist.","correct":"✓ She's a makeup artist specializing in K-pop looks.","note":"While understandable, it's more accurate to say 'makeup artist specializing in K-pop looks' as 'keup artist' isn't a widely recognized professional title."}],"priority":"★★☆"},"related_words":{"derivatives":["K-beauty","K-pop","makeup"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Slang, not typically included in standard language assessments)","frequency_google_ngram":"Low frequency (primarily used in specific online communities)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Keup' is a slang term, so it's not found in standard English learning materials. It's a combination of 'K-pop' and 'makeup,' referring to the makeup styles associated with K-pop idols. You'll likely encounter it in online beauty communities or discussions about K-pop culture. It's important to understand the context to use it correctly.","priority":"★★☆"},"example_sentences":[{"sentence":"Her **keup** is so on point; she looks just like a K-pop idol!","translation":"彼女のkeupは完璧で、まるでK-popアイドルみたい！","type":"noun","meaning_category":"K-pop makeup"},{"sentence":"I'm watching a **keup** tutorial to learn how to do aegyo-sal.","translation":"私は涙袋の作り方を学ぶためにkeupチュートリアルを見ている。","type":"noun","meaning_category":"K-pop makeup"},{"sentence":"What are some popular **keup** products right now?","translation":"今人気のあるkeup製品は何ですか？","type":"noun","meaning_category":"K-pop makeup"}]}