{"word":"fable-framing","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"寓話化、物語化：出来事や状況を寓話や物語の形式で表現または解釈すること。","english_definition":"The act of presenting or interpreting events or situations in the form of a fable or narrative.","examples":[{"sentence":"The politician's speech involved a lot of fable-framing, making complex issues seem like simple moral tales.","translation":"その政治家の演説は多くの寓話化を含んでおり、複雑な問題を単純な道徳物語のように見せていた。"},{"sentence":"Through fable-framing, the author transformed the historical event into a timeless lesson about human nature.","translation":"寓話化を通じて、著者はその歴史的出来事を人間の本質に関する時代を超越した教訓に変えた。"}],"collocations":["narrative framing","storytelling","allegory","myth-making"],"synonyms":["storytelling","narrative construction","allegorization","mythologizing"],"antonyms":["factual reporting","objective analysis","deconstruction","realism"]}],"etymology":{"value":"「fable」（寓話）と「framing」（枠組み、構成）の組み合わせ。出来事を寓話の枠組みで捉えることを意味する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfeɪbəlˌfreɪmɪŋ/","syllables":"fa-ble-fram-ing"},"inflection":{"noun_plural":"fable-framings"},"usage_notes":{"explanation":"「fable-framing」は、特定の視点やメッセージを伝えるために、出来事や状況を寓話や物語の形式で表現する手法を指します。政治、文学、教育など、さまざまな分野で使用されます。寓話化された物語は、複雑な問題を理解しやすくしたり、特定の価値観を強調したりする効果があります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The fable-framing was too literal and lacked imagination.","correct":"✓ The fable-framing was too simplistic and lacked nuance.","note":"「literal」は文字通りの意味で、寓話化とは異なる概念です。寓話化が単純すぎる場合は「simplistic」が適切です。"},{"incorrect":"✗ Fable-framing is always a bad thing because it hides the truth.","correct":"✓ Fable-framing can be manipulative, but it can also make complex ideas more accessible.","note":"寓話化は必ずしも悪いものではありません。理解を助ける場合もありますが、操作的な意図が含まれる可能性もあります。"}],"priority":"★☆☆"},"related_words":{"derivatives":["fable","frame","framing","narrative","allegory","myth"],"phrases":["spin","propaganda","rhetoric","persuasion"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈で使用されることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「fable-framing」は、出来事や状況を寓話や物語の形にして伝えることを意味する、少し専門的な言葉です。政治的な話や、何かを教えるときに、複雑なことを簡単な物語のように見せるために使われることがあります。この言葉は、物語を使って情報を伝える方法について話すときに使われます。"},"example_sentences":[{"sentence":"The documentary used fable-framing to illustrate the dangers of unchecked corporate power.","translation":"そのドキュメンタリーは、抑制のない企業力の危険性を示すために寓話化を使用した。","type":"noun","meaning_category":"寓話化"},{"sentence":"Critics accused the government of fable-framing the economic crisis to avoid blame.","translation":"批評家たちは、政府が責任を回避するために経済危機を寓話化したと非難した。","type":"noun","meaning_category":"寓話化"},{"sentence":"Effective fable-framing can make abstract concepts more relatable and memorable.","translation":"効果的な寓話化は、抽象的な概念をより共感しやすく、記憶に残るものにすることができる。","type":"noun","meaning_category":"寓話化"}]}