{"word":"Martinism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"マルティニスム：18世紀フランスの神秘思想家マルティネス・ド・パスカーリの教えに由来する神秘主義運動。","english_definition":"A mystical tradition originating in 18th-century France, based on the teachings of Martinez de Pasqually, emphasizing the fall of humanity and the path to reintegration with the divine.","examples":[{"sentence":"Martinism emphasizes personal spiritual experience and theurgical practices.","translation":"マルティニスムは、個人的な霊的経験とテウルギア（神働術）の実践を重視する。"},{"sentence":"Several different orders and lineages claim to represent authentic Martinism.","translation":"いくつかの異なる教団や系統が、正統なマルティニスムを代表すると主張している。"}],"collocations":["Order of Martinists","Traditional Martinist Order","Elus Cohens (related to the origins of Martinism)"],"synonyms":["Christian Theosophy","Western Esotericism","Mysticism"],"antonyms":["Materialism","Atheism"]}],"etymology":{"value":"Named after Louis-Claude de Saint-Martin, a disciple of Martinez de Pasqually, who popularized and systematized his teachings. The suffix '-ism' denotes a system of thought or practice.","priority":"★★★"},"pronunciation":{"ipa":"/ˈmɑːrtɪnɪzəm/","syllables":"Mar-tin-is-m"},"inflection":{"noun_plural":"Martinisms (rare, referring to different interpretations or branches)"},"usage_notes":{"explanation":"Martinism is a complex and multifaceted mystical tradition. It is distinct from, but related to, Rosicrucianism and Freemasonry. It emphasizes direct spiritual experience and the possibility of personal reintegration with the divine source. Different Martinist orders have varying practices and interpretations of the core teachings.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Martinism is a type of Protestantism.","correct":"✓ Martinism is a mystical tradition within Western Esotericism.","note":"Martinism is not directly related to Protestantism, although it has Christian influences."}],"priority":"★★☆"},"related_words":{"derivatives":["Martinist (noun/adjective)","Saint-Martin (related to Louis-Claude de Saint-Martin)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Not applicable (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Martinism is a specialized term related to a specific mystical tradition. Understanding it requires familiarity with Western Esotericism, Christian mysticism, and the history of secret societies in 18th-century France. The concepts involved are abstract and require a sophisticated understanding of religious and philosophical ideas."},"example_sentences":[{"sentence":"The study of Martinism requires a deep understanding of esoteric philosophy.","translation":"マルティニスムの研究には、秘教哲学の深い理解が必要である。","type":"general","meaning_category":"study"},{"sentence":"Some Martinist orders practice rituals aimed at spiritual purification.","translation":"一部のマルティニスム教団は、霊的な浄化を目的とした儀式を実践している。","type":"practice","meaning_category":"rituals"}]}