{"word":"whalelike","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"クジラのような、クジラに似た","english_definition":"resembling a whale, especially in shape or size.","examples":[{"sentence":"The submarine had a whalelike shape to reduce drag in the water.","translation":"その潜水艦は、水中での抵抗を減らすためにクジラのような形をしていた。"},{"sentence":"The large creature swimming in the distance had a whalelike appearance.","translation":"遠くを泳いでいるその大きな生き物は、クジラのような外見をしていた。"}],"collocations":["whalelike body (クジラのような体)","whalelike form (クジラのような形)","whalelike appearance (クジラのような外観)"],"synonyms":["cetacean","whale-shaped","whale-like"],"antonyms":[]}],"etymology":{"value":"'whale' + '-like'","priority":"★★★"},"pronunciation":{"ipa":"/ˈweɪlˌlaɪk/","syllables":"whale-like"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"'Whalelike' is used to describe something that shares characteristics with a whale, typically its size or shape. It is often used in descriptive contexts, such as describing the appearance of an object or creature.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The boat was whalelike swimming in the ocean.","correct":"✓ The boat, which was whalelike in shape, was swimming in the ocean.","note":"'Whalelike' is an adjective and should be used to describe a noun. It cannot act as a verb."}],"priority":"★★☆"},"related_words":{"derivatives":["whale (名詞: クジラ)","like (接尾辞: ～のような)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'whalelike' is a descriptive adjective used to convey that something resembles a whale. It is formed by combining the noun 'whale' with the suffix '-like', which indicates resemblance. This word is not commonly used in everyday conversation but may appear in scientific or descriptive writing when comparing the features of an object or creature to those of a whale."},"example_sentences":[{"sentence":"The aircraft carrier had a whalelike bulk in the harbor.","translation":"その航空母艦は港でクジラのような巨体を見せていた。","type":"adjective","meaning_category":"似ている"},{"sentence":"The new design of the submarine was whalelike to improve its underwater maneuverability.","translation":"その潜水艦の新しいデザインは、水中での操縦性を向上させるためにクジラのような形にされた。","type":"adjective","meaning_category":"似ている"}]}