{"word":"sympathetic-gazed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Having or showing a sympathetic gaze; looking at someone or something with empathy, understanding, and concern.","english_definition":"Describing someone or something that is looked at with empathy, understanding, and concern.","examples":[{"sentence":"The doctor offered a sympathetic-gazed look to the patient as he explained the diagnosis.","translation":"医師は診断結果を説明しながら、患者に同情的な眼差しを向けた。"},{"sentence":"She gave a sympathetic-gazed glance to the crying child.","translation":"彼女は泣いている子供に同情的な視線を送った。"},{"sentence":"The therapist listened intently, maintaining a sympathetic-gazed expression throughout the session.","translation":"セラピストは熱心に耳を傾け、セッション中ずっと同情的な眼差しの表情を保った。"}],"collocations":["sympathetic-gazed look","sympathetic-gazed expression","sympathetic-gazed glance"],"synonyms":["empathetic","compassionate","understanding","caring","concerned"],"antonyms":["indifferent","apathetic","unconcerned","callous"]}],"etymology":{"value":"A compound adjective formed by combining 'sympathetic' (feeling or showing sympathy) with 'gazed' (past participle of 'gaze', meaning to look steadily and intently).","priority":"N/A"},"pronunciation":{"ipa":"/ˌsɪmpəˈθɛtɪk ˈɡeɪzd/","syllables":"sym-pa-thet-ic-gazed"},"inflection":{"notes":"This is a compound adjective and does not have typical inflectional forms like comparative or superlative degrees."},"usage_notes":{"explanation":"'Sympathetic-gazed' is a descriptive adjective used to convey a specific type of look or expression characterized by empathy, understanding, and concern. It is often used to describe someone's facial expression or the way they are looking at another person, particularly in situations involving distress, sadness, or difficulty.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He sympathetic-gazed at the situation.","correct":"✓ He looked sympathetic-gazed at the situation. / ✓ He gave a sympathetic-gazed look at the situation.","note":"'Sympathetic-gazed' is an adjective describing a look or expression, not an action. Therefore, it should be used to modify a noun (e.g., look, expression) or as part of a descriptive phrase."}],"priority":"N/A"},"related_words":{"derivatives":["sympathetic","gaze","sympathy","empathy","compassion"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - This is a relatively uncommon or niche term.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Sympathetic-gazed' is a compound adjective that describes a look or expression filled with empathy and understanding. It is used to describe someone looking at another person or situation with care and concern, often in response to distress or difficulty. The term combines the concepts of 'sympathy' and 'gaze' to create a specific and nuanced description."},"example_sentences":[{"sentence":"With a sympathetic-gazed expression, she listened to her friend's problems.","translation":"同情的な眼差しの表情で、彼女は友人の悩みを聞いた。","type":"adjective","meaning_category":"showing empathy"},{"sentence":"The dog offered a sympathetic-gazed look to its owner who was feeling unwell.","translation":"犬は体調の悪い飼い主に同情的な眼差しを向けた。","type":"adjective","meaning_category":"showing concern"},{"sentence":"The nurse's sympathetic-gazed approach made the patient feel more comfortable.","translation":"看護師の同情的な眼差しの対応は、患者をより安心させた。","type":"adjective","meaning_category":"showing understanding"}]}