{"word":"input-based","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"入力に基づいた、入力に依存した","english_definition":"Relating to or based on input, especially data or information provided to a system or process.","examples":[{"sentence":"The learning algorithm is input-based, meaning it adapts based on the data it receives.","translation":"その学習アルゴリズムは入力に基づいているため、受信するデータに基づいて適応します。"},{"sentence":"The system uses an input-based control mechanism to regulate the flow of resources.","translation":"そのシステムは、リソースの流れを調整するために、入力に基づいた制御メカニズムを使用しています。"}],"collocations":["input-based system","input-based control","input-based learning","input-based model"],"synonyms":["data-driven","input-driven","information-based"],"antonyms":["output-based","rule-based"]}],"etymology":{"value":"\"Input\" + \"-based\". \"Input\" refers to data or information provided to a system. \"-based\" indicates that something is founded on or derived from that input.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɪnˌpʊt beɪst/","syllables":"in-put-based"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"\"Input-based\" is commonly used in fields like computer science, engineering, and education to describe systems, models, or approaches that rely heavily on the data or information they receive. It emphasizes the importance of the input in determining the behavior or outcome of the system.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The system is base on input.","correct":"✓ The system is input-based. / ✓ The system is based on input.","note":"Ensure correct usage of the adjective form \"input-based\" or the phrase \"based on input.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["input","based"],"related_terms":["data-driven","machine learning","artificial intelligence"],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Input-based\" describes something that relies on data or information provided to a system. It's often used in technical fields to explain how a system's behavior is determined by the input it receives. For example, an input-based learning algorithm adjusts its parameters based on the data it's given."},"example_sentences":[{"sentence":"The robot's movements are controlled by an input-based system that responds to environmental sensors.","translation":"ロボットの動きは、環境センサーに応答する入力に基づいたシステムによって制御されています。","type":"adjective","meaning_category":"入力に基づく"},{"sentence":"The company adopted an input-based budgeting approach, allocating resources based on projected demand.","translation":"会社は、予測される需要に基づいてリソースを割り当てる、入力に基づいた予算編成アプローチを採用しました。","type":"adjective","meaning_category":"入力に依存する"}]}