{"word":"imperialisation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"帝国主義化、帝国主義の拡大、帝国主義の影響","english_definition":"The act or process of extending a country's power and influence through colonization, use of military force, or other means. It also refers to the spread of imperialistic ideas or influence.","examples":[{"sentence":"The imperialisation of Africa by European powers had a profound impact on the continent.","translation":"ヨーロッパ列強によるアフリカの帝国主義化は、大陸に深刻な影響を与えた。"},{"sentence":"Some scholars argue that globalisation is a form of economic imperialisation.","translation":"グローバル化は経済的な帝国主義化の一形態であると主張する学者もいる。"},{"sentence":"The imperialisation of culture can lead to the loss of local traditions.","translation":"文化の帝国主義化は、地元の伝統の喪失につながる可能性がある。"}],"collocations":["economic imperialisation (経済的帝国主義化)","cultural imperialisation (文化的帝国主義化)","political imperialisation (政治的帝国主義化)","military imperialisation (軍事的帝国主義化)","the imperialisation of (国/地域) (～の帝国主義化)"],"synonyms":["colonialism","expansionism","hegemony","domination","subjugation"],"antonyms":["decolonisation","independence","sovereignty","autonomy"]}],"etymology":{"value":"The word 'imperialisation' is derived from 'imperial', which relates to an empire or emperor, and the suffix '-isation', which denotes a process or action of making something imperial.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪmˌpɪəriəlaɪˈzeɪʃən/","syllables":"im-pe-ri-al-i-sa-tion"},"inflection":{"noun_plural":"imperialisations"},"usage_notes":{"explanation":"'Imperialisation' is often used in historical and political contexts to describe the actions of powerful nations extending their control over weaker ones. It can also refer to the spread of cultural or economic influence without direct political control. The term often carries negative connotations, suggesting exploitation and oppression.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The country experienced imperialisation after the war ended.","correct":"✓ The country experienced imperialistic policies after the war ended.","note":"'Imperialisation' refers to the process, not the policies themselves. Use 'imperialistic policies' to describe the specific actions taken."},{"incorrect":"✗ Imperialisation is always a good thing for developing countries.","correct":"✓ Imperialisation often has negative consequences for developing countries.","note":"Imperialisation is generally viewed critically due to its association with exploitation and loss of sovereignty."}],"priority":"★☆☆"},"related_words":{"derivatives":["imperial (adjective, relating to an empire)","imperialism (noun, the policy of extending a country's power)","imperialist (noun, a person who supports imperialism; adjective, relating to imperialism)","imperialistic (adjective, characterized by imperialism)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Imperialisation' is a complex term used in history and politics to describe how a country increases its power and influence over other countries, often through colonization or military force. It can also refer to the spread of a country's culture or economic system. This word is often used in discussions about the negative effects of powerful countries on weaker ones. It's important to understand that 'imperialisation' is usually seen as a negative process because it can lead to exploitation and loss of independence for the countries being influenced."},"example_sentences":[{"sentence":"The **imperialisation** of education systems led to the suppression of indigenous knowledge.","translation":"教育制度の帝国主義化は、先住民の知識の抑圧につながった。","type":"noun","meaning_category":"帝国主義の拡大"},{"sentence":"Critics argue that globalisation is simply a new form of **imperialisation**.","translation":"批評家たちは、グローバル化は単なる新たな形態の帝国主義化にすぎないと主張している。","type":"noun","meaning_category":"帝国主義の影響"},{"sentence":"The **imperialisation** of the region resulted in significant economic changes.","translation":"その地域の帝国主義化は、重大な経済的変化をもたらした。","type":"noun","meaning_category":"帝国主義の拡大"}]}