{"word":"infeasibly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"実行不可能に、実現不可能に","english_definition":"in a manner that is not feasible; impractically.","examples":[{"sentence":"The project was infeasibly expensive.","translation":"そのプロジェクトは実行不可能なくらい高価だった。"},{"sentence":"The plan was infeasibly complex.","translation":"その計画は実行不可能なくらい複雑だった。"},{"sentence":"The task was infeasibly difficult to complete in the given time.","translation":"そのタスクは与えられた時間で完了するには実行不可能なくらい難しかった。"}],"collocations":["infeasibly expensive","infeasibly complex","infeasibly difficult","infeasibly large","infeasibly small"],"synonyms":["impractically","unworkably","unachievably","impossibly","unrealistically"],"antonyms":["feasibly","practically","workably","achievably","realistically"]}],"etymology":{"value":"\"Infeasible\" (実行不可能な) + \"-ly\" (副詞を作る接尾辞)","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈfiːzɪbli/","syllables":"in-fea-si-bly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"\"Infeasibly\" is used to describe something that is impossible or extremely difficult to achieve or carry out due to practical considerations. It emphasizes the impracticality or unachievability of something. It is often used to describe plans, projects, or tasks that are too expensive, complex, or time-consuming to be realistically accomplished.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The car was infeasibly to drive.","correct":"✓ It was infeasibly expensive to buy the car.","note":"\"Infeasibly\" should modify an adjective or adverb, not a verb directly. It describes the degree to which something is impractical or unachievable, not the action itself."},{"incorrect":"✗ The plan was infeasible, but we tried to do it feasibly.","correct":"✓ The plan was infeasible, so we tried to make it feasible.","note":"\"Infeasible\" and \"feasibly\" are antonyms. \"Infeasibly\" describes something that cannot be done, while \"feasibly\" describes something that can be done. The sentence should be restructured to reflect this."}],"priority":"★★☆"},"related_words":{"derivatives":["infeasible (adjective)","feasibility (noun)","feasible (adjective)","feasibly (adverb)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"infeasibly\" means in a way that is not possible or practical to do. It is used to describe things that are too difficult, costly, or complex to be achieved. It is not a common word, and you will likely encounter it in formal writing or discussions about planning, projects, or problem-solving. It is the adverb form of the adjective \"infeasible,\" which means not capable of being done or carried out. To understand \"infeasibly,\" you need to understand the root word \"feasible,\" which means capable of being done or carried out easily or conveniently."},"example_sentences":[{"sentence":"The proposed timeline was infeasibly short, given the scope of the project.","translation":"提案されたタイムラインは、プロジェクトの規模を考えると、実行不可能なくらい短すぎた。","type":"adverb","meaning_category":"impracticality"},{"sentence":"The budget was infeasibly low to cover all the necessary expenses.","translation":"予算は、必要なすべての費用を賄うには、実行不可能なくらい低すぎた。","type":"adverb","meaning_category":"unachievability"},{"sentence":"The conditions made it infeasibly dangerous to proceed with the mission.","translation":"その状況では、ミッションを続行するには実行不可能なくらい危険だった。","type":"adverb","meaning_category":"impossibility"}]}