{"word":"Glamberry","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A fictional or invented word, likely a portmanteau of 'glamorous' and 'berry', suggesting something that is both attractive/stylish and natural/fruity.","english_definition":"A neologism, likely combining 'glamorous' and 'berry', suggesting an appealing blend of style and natural qualities. It could refer to a product, brand, or aesthetic.","examples":[{"sentence":"The new lipstick was named Glamberry, reflecting its vibrant color and luxurious feel.","translation":"その新しい口紅は、鮮やかな色と豪華な感触を反映して、グラムベリーと名付けられました。"},{"sentence":"The fashion magazine described her style as 'Glamberry chic'.","translation":"そのファッション雑誌は、彼女のスタイルを「グラムベリー・シック」と表現しました。"},{"sentence":"The company launched a Glamberry-scented candle.","translation":"その会社はグラムベリーの香りのキャンドルを発売しました。"}],"collocations":["Glamberry lipstick","Glamberry scent","Glamberry style","Glamberry collection"],"synonyms":["glamorous","stylish","fruity","natural","appealing","chic"],"antonyms":["plain","unattractive","ordinary","unfashionable"]}],"etymology":{"value":"Likely a portmanteau (blend of words) combining 'glamorous' (attractive, stylish) and 'berry' (a small, pulpy fruit). The combination suggests a blend of sophistication and natural appeal.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡlæmbəri/","syllables":"Glam-ber-ry"},"inflection":{"noun_plural":"Glamberries"},"usage_notes":{"explanation":"'Glamberry' is not a standard English word and is likely a neologism (newly coined word). Its meaning is derived from its constituent parts, 'glamorous' and 'berry'. It is often used in marketing or creative contexts to evoke a sense of sophisticated naturalness or attractive fruitiness. The word's meaning is context-dependent, but it generally implies a positive and appealing quality.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She was wearing a glamberry dress made of cotton.","correct":"✓ She was wearing a glamorous dress made of cotton. / She was wearing a dress with a glamberry print.","note":"Since 'glamberry' is not a standard adjective, it's better to use 'glamorous' or describe the dress as having a 'glamberry print' or design."},{"incorrect":"✗ The glamberry of the event was amazing.","correct":"✓ The glamour of the event was amazing.","note":"Use 'glamour' instead of 'glamberry' when referring to the general attractiveness or excitement of an event."}],"priority":"★★☆"},"related_words":{"derivatives":["glamorous","berry","glamour"],"phrasal_verbs":[],"related_concepts":["fashion","beauty","cosmetics","fragrance","marketing","branding"]},"level_frequency":{"CEFR":"N/A (Neologism)","frequency_google_ngram":"Very Low (likely a recent or invented word)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Glamberry' is a made-up word, probably a mix of 'glamorous' and 'berry'. It's not in regular dictionaries. If you see it, it likely means something that's both fancy and natural, like a stylish product with a fruity scent or a fashionable look inspired by nature. Because it's not a real word, the exact meaning depends on how the speaker or writer is using it. It's more common in advertising or creative writing than in everyday conversation."},"example_sentences":[{"sentence":"The new line of skincare products features a 'Glamberry' face mask, promising radiant and healthy skin.","translation":"新しいスキンケア製品ラインには、輝きのある健康的な肌を約束する「グラムベリー」フェイスマスクが含まれています。","type":"noun (brand/product name)","meaning_category":"Cosmetics/Beauty"},{"sentence":"The interior design was described as 'Glamberry', with lush fabrics and berry-toned accents.","translation":"インテリアデザインは「グラムベリー」と評され、豪華な生地とベリー色を基調としたアクセントが特徴です。","type":"adjective (style descriptor)","meaning_category":"Fashion/Design"},{"sentence":"The perfume had a unique 'Glamberry' fragrance, blending floral and fruity notes.","translation":"その香水は、フローラルとフルーティーなノートをブレンドした、ユニークな「グラムベリー」の香りでした。","type":"adjective (scent descriptor)","meaning_category":"Fragrance"}]}