{"word":"Excubittoria","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(archaic) A watchtower or lookout post.","english_definition":"An archaic term for a watchtower or lookout post, often situated in a high or strategic location to provide surveillance over an area.","examples":[{"sentence":"The Roman soldiers manned the excubittoria, ever vigilant for signs of attack.","translation":"ローマ兵は攻撃の兆候に常に警戒し、見張り塔に配置された。"},{"sentence":"From the excubittoria, the guards could see for miles across the plains.","translation":"見張り塔からは、警備兵は何マイルも平原を見渡すことができた。"}],"collocations":["man the excubittoria","build an excubittoria","ancient excubittoria","strategic excubittoria"],"synonyms":["watchtower","lookout","sentry box","observation post","beacon tower"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'excubiae,' meaning 'night watch' or 'guard duty.' The term 'excubittoria' is the plural form, referring to multiple watchtowers or guard posts.","priority":"★★☆"},"pronunciation":{"ipa":"/ɛkskjuːbɪˈtɔːriə/","syllables":"ex-cu-bit-to-ri-a"},"inflection":{"noun_plural":"Excubittorias"},"usage_notes":{"explanation":"The term 'excubittoria' is rarely used in modern English. It is primarily encountered in historical contexts, particularly when discussing Roman military fortifications or other ancient defensive structures. It specifically refers to a structure designed for observation and early warning, rather than a general-purpose tower or building.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The excubittoria was used as a residence.","correct":"✓ The excubittoria was used as a lookout post.","note":"Excubittoria refers specifically to a watchtower or lookout post, not a general residence."}],"priority":"★☆☆"},"related_words":{"derivatives":["excubiae (noun: night watch, guard duty)","excubitor (noun: sentinel, guard)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency - primarily found in historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Excubittoria' is a highly specialized and archaic term, primarily encountered in historical or academic texts concerning Roman military history or ancient fortifications. Its usage is extremely rare in contemporary English. Understanding the term requires familiarity with Latin roots and historical military terminology."},"example_sentences":[{"sentence":"The remains of the Roman excubittoria still stand on the hilltop.","translation":"ローマ時代の見張り塔の残骸は今も丘の上に立っている。","type":"noun","meaning_category":"watchtower"},{"sentence":"From the strategic excubittoria, the Roman army controlled the valley.","translation":"戦略的な見張り塔から、ローマ軍は谷を支配した。","type":"noun","meaning_category":"lookout post"}]}