{"word":"pickleworm","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(昆虫)ウリハムシの一種、特にウリ科植物に害を及ぼす幼虫","english_definition":"a moth larva (Diaphania nitidalis) that bores into squash, cucumbers, melons, and other cucurbits.","examples":[{"sentence":"Pickleworms can cause significant damage to cucumber and squash crops.","translation":"ウリハムシはキュウリやカボチャの作物に大きな被害をもたらす可能性があります。"},{"sentence":"The farmer used insecticide to control the pickleworm infestation.","translation":"農家はウリハムシの蔓延を抑制するために殺虫剤を使用しました。"}],"collocations":["pickleworm damage","pickleworm infestation","pickleworm control","pickleworm moth"],"synonyms":["cucumber moth larva","melonworm (related species)"],"antonyms":[]}],"etymology":{"value":"The name \"pickleworm\" comes from the fact that the larva is a worm that infests and damages cucurbit crops, including cucumbers, which are often used to make pickles.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɪkəlˌwɜːrm/","syllables":"pic-kle-worm"},"inflection":{"noun_plural":"pickleworms"},"usage_notes":{"explanation":"Pickleworms are a significant agricultural pest, particularly in the southeastern United States. The larvae bore into fruits and stems of cucurbit plants, making them unmarketable. Control methods include insecticides, row covers, and crop rotation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a pickle worm in my garden.","correct":"✓ I saw a pickleworm in my garden.","note":"The correct spelling is \"pickleworm\" (one word)."},{"incorrect":"✗ Pickle worms are destroying my tomatoes.","correct":"✓ Pickleworms are destroying my cucumbers.","note":"Pickleworms primarily attack cucurbits, not tomatoes."}],"priority":"★★☆"},"related_words":{"derivatives":["pickleworm moth (Diaphania nitidalis)"],"phrasal_verbs":[],"related_species":["melonworm (Diaphania hyalinata)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term \"pickleworm\" refers to the larva of a specific moth species that is a common agricultural pest. Understanding this term requires some knowledge of agriculture and pest control. The word itself is a compound noun, combining \"pickle\" (referring to pickled cucumbers, a common cucurbit) and \"worm\" (referring to the larval stage of the insect)."},"example_sentences":[{"sentence":"The farmer was concerned about the potential damage from pickleworms to his squash crop.","translation":"農家はカボチャの作物に対するウリハムシによる潜在的な被害を懸念していました。","type":"noun","meaning_category":"insect pest"},{"sentence":"Organic growers often struggle to control pickleworms without using synthetic insecticides.","translation":"有機栽培農家は、合成殺虫剤を使用せずにウリハムシを制御するのに苦労することがよくあります。","type":"noun","meaning_category":"insect pest"}]}