{"word":"expositorily","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"解説的に、説明的に","english_definition":"in an expository manner; serving to expound, set forth, or explain.","examples":[{"sentence":"The topic was presented expositorily, with clear definitions and examples.","translation":"そのトピックは、明確な定義と例を用いて、解説的に提示された。"},{"sentence":"He wrote expositorily, aiming to educate the reader on the subject.","translation":"彼は読者にその主題について教育することを目的として、説明的に書いた。"}],"collocations":["present expositorily","write expositorily","explain expositorily","describe expositorily"],"synonyms":["descriptively","didactically","elucidatively","interpretively","illustratively","clarifyingly"],"antonyms":["obfuscatingly","confusingly","enigmatically"]}],"etymology":{"value":"The word \"expositorily\" is derived from \"expository,\" which comes from the verb \"expose.\" \"Expose\" comes from the Old French \"exposer,\" which in turn comes from the Latin \"exponere,\" meaning \"to set forth, explain.\" The suffix \"-ly\" is added to form the adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪkˌspɒzɪˈtɔːrɪli/","syllables":"ex-pos-i-to-ri-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"\"Expositorily\" is used to describe something that is presented or explained in a clear, comprehensive, and informative way. It emphasizes the intention to educate or clarify the topic at hand. It is often used in academic, journalistic, or technical contexts where clear and unbiased explanation is important.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The essay was written expository.","correct":"✓ The essay was written expositorily.","note":"\"Expository\" is an adjective, while \"expositorily\" is the adverb. Use the adverb to modify a verb (e.g., \"written\")."},{"incorrect":"✗ He explained the concept with exposition.","correct":"✓ He explained the concept expositorily.","note":"\"Exposition\" is a noun that refers to the act of explaining or a written explanation. \"Expositorily\" is the adverb that describes how something is explained."}],"priority":"★★☆"},"related_words":{"derivatives":["expository (adjective)","exposition (noun)","expose (verb)","expositor (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"expositorily\" is an adverb used to describe something done in an expository manner, meaning it is presented or explained clearly and comprehensively. This word is relatively uncommon and is typically used in formal writing or academic contexts where the goal is to provide thorough and informative explanations. Understanding the related terms like \"expository\" and \"exposition\" can help in grasping the meaning of \"expositorily.\""},"example_sentences":[{"sentence":"The guide explained the historical events expositorily, providing context and analysis.","translation":"そのガイドは、歴史的出来事を解説的に説明し、背景と分析を提供した。","type":"adverb","meaning_category":"解説的に"},{"sentence":"She presented her research findings expositorily, ensuring that the audience understood the methodology.","translation":"彼女は聴衆が方法論を理解できるように、研究結果を説明的に提示した。","type":"adverb","meaning_category":"説明的に"},{"sentence":"The textbook is written expositorily, with each chapter building on the previous one.","translation":"その教科書は解説的に書かれており、各章が前の章の上に構築されている。","type":"adverb","meaning_category":"解説的に"}]}