{"word":"aitchbone","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(牛肉の)エッチボーン、腰骨付き肉","english_definition":"a cut of beef consisting of the rump and the bone of the hip.","examples":[{"sentence":"He ordered an aitchbone roast for Sunday dinner.","translation":"彼は日曜日の夕食にエッチボーンのローストを注文した。"},{"sentence":"The aitchbone is a flavorful and tender cut of beef.","translation":"エッチボーンは風味豊かで柔らかい牛肉の部位です。"}],"collocations":["aitchbone roast","roasted aitchbone","cut of aitchbone"],"synonyms":["rump roast","hip bone steak"],"antonyms":[]}],"etymology":{"value":"The word \"aitchbone\" is a corruption of \"nache bone,\" from the Old English word \"nache\" meaning \"buttock.\" The \"n\" was dropped due to misinterpretation of the phrase \"a nache bone\" as \"an ache bone,\" and then further altered to \"aitchbone.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˈeɪtʃboʊn/","syllables":"aitch-bone"},"inflection":{"noun_plural":"aitchbones"},"usage_notes":{"explanation":"An aitchbone is a specific cut of beef that includes the rump and hip bone. It's often roasted and is known for its flavor and tenderness. The term is primarily used in culinary contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a hipbone steak, also known as aitchbone.","correct":"✓ I bought an aitchbone steak.","note":"While aitchbone includes the hip bone, it's a specific cut, not just any steak with the hip bone. Using \"aitchbone\" is more precise."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["beef","rump","steak","roast"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語に近い。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"aitchbone\" refers to a specific cut of beef that includes the rump and hip bone. It is primarily used in culinary contexts and is not a commonly encountered word outside of discussions about meat cuts or recipes. Understanding the term requires familiarity with butchery terminology.","priority":"★☆☆"},"example_sentences":[{"sentence":"The butcher recommended an aitchbone for slow roasting.","translation":"肉屋はゆっくりローストするためにエッチボーンを勧めた。","type":"noun","meaning_category":"牛肉の部位"},{"sentence":"She prepared a delicious aitchbone with roasted vegetables.","translation":"彼女はロースト野菜を添えた美味しいエッチボーンを作った。","type":"noun","meaning_category":"牛肉の部位"}]}