{"word":"non-precedential","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"先例拘束力のない、判例としての価値を持たない","english_definition":"Not establishing or serving as a precedent; not binding on future decisions.","examples":[{"sentence":"The court designated the opinion as non-precedential.","translation":"裁判所はその意見を先例拘束力がないものとして指定した。"},{"sentence":"Non-precedential rulings are generally not cited in subsequent cases.","translation":"先例拘束力のない判決は、通常、その後の訴訟で引用されない。"},{"sentence":"The decision was marked as non-precedential, meaning it only applies to the specific facts of this case.","translation":"その決定は先例拘束力がないとされ、この訴訟の特定の事実にのみ適用されることを意味する。"}],"collocations":["non-precedential opinion","non-precedential ruling","designated as non-precedential","mark as non-precedential"],"synonyms":["not binding","non-binding","not precedential","not authoritative"],"antonyms":["precedential","binding","authoritative","controlling"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the word 'precedential'.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌnɒn prɪˈsɛdənʃəl/","syllables":"non-pre-ce-den-tial"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Non-precedential' is a term primarily used in legal contexts to describe court opinions or rulings that do not establish a legal precedent. This means that future courts are not required to follow the reasoning or holding of the decision. Such opinions may be issued when the court believes the case is fact-specific or does not involve a novel legal issue. While non-precedential opinions can be persuasive, they are not binding authority.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The judge made a non-precedent decision.","correct":"✓ The judge made a non-precedential decision.","note":"'Non-precedent' is not the correct term. The adjective form is 'non-precedential'."},{"incorrect":"✗ This law is non-precedential for all cases.","correct":"✓ This ruling is non-precedential for future cases.","note":"'Non-precedential' typically applies to rulings or opinions, not laws themselves."}],"priority":"☆☆☆"},"related_words":{"derivatives":["precedent (noun)","precedential (adjective)"],"phrases":["stare decisis (the legal principle of following precedents)"],"priority":"☆☆☆"},"level_frequency":{"level":"C2 (Legal terminology)","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'non-precedential' is a legal term that means something does not create a rule that other courts must follow. If a court decision is 'non-precedential', it only applies to the specific case it was decided for, and other courts don't have to make the same decision in similar cases. This term is mostly used by lawyers and judges.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The appellate court designated the summary disposition as **non-precedential**.","translation":"控訴裁判所はその略式判決を先例拘束力がないものとして指定した。","type":"adjective","meaning_category":"先例拘束力のない"},{"sentence":"Although the ruling provides guidance, it is **non-precedential** and not binding on other courts.","translation":"その判決は指針を提供するものの、先例拘束力はなく、他の裁判所を拘束するものではない。","type":"adjective","meaning_category":"先例拘束力のない"},{"sentence":"The state supreme court clarified that unpublished opinions are generally **non-precedential**.","translation":"州最高裁判所は、未公開の意見は一般的に先例拘束力がないことを明確にした。","type":"adjective","meaning_category":"先例拘束力のない"}]}