{"word":"rotten-heartedly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"心が腐っているように、意地悪く、不親切に","english_definition":"In a manner characterized by a corrupt, malicious, or unkind nature; wickedly; cruelly.","examples":[{"sentence":"He acted rotten-heartedly, betraying his friend for personal gain.","translation":"彼は私利のために友人を裏切り、意地悪く振る舞った。"},{"sentence":"She spoke rotten-heartedly about her rival, spreading false rumors.","translation":"彼女はライバルについて、偽の噂を広め、意地悪く話した。"}],"collocations":["act rotten-heartedly","speak rotten-heartedly","behave rotten-heartedly"],"synonyms":["maliciously","wickedly","cruelly","unkindly","meanly","viciously"],"antonyms":["kindly","generously","compassionately","benevolently"]}],"etymology":{"value":"Derived from the adjective phrase \"rotten-hearted,\" combining \"rotten\" (decayed, corrupt) and \"hearted\" (having a heart, referring to one's disposition or feelings). The adverbial form is created by adding the suffix \"-ly.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌrɒtənˈhɑːrtɪdli/","syllables":"rot-ten-heart-ed-ly"},"inflection":{"notes":"Adverb, so no inflection."},"usage_notes":{"explanation":"\"Rotten-heartedly\" is an adverb that describes actions or speech done with a corrupt, malicious, or unkind intention. It implies a deep-seated negativity or wickedness in the person's character. It is a relatively uncommon word, but it is used to emphasize the malicious nature of an action.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a rotten-heartedly person.","correct":"✓ He is a rotten-hearted person. / ✓ He acted rotten-heartedly.","note":"\"Rotten-hearted\" is an adjective describing a person, while \"rotten-heartedly\" is an adverb describing how an action is performed."}],"priority":"★★☆"},"related_words":{"derivatives":["rotten-hearted (adjective)","rotten (adjective)","heart (noun)","-ly (suffix)"],"related_terms":["evil-heartedly","cold-heartedly","hard-heartedly"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"rotten-heartedly\" is a relatively rare and complex word. It is used to describe actions done with a malicious or unkind intention, suggesting a deep-seated negativity in the person's character. The word combines the idea of something being \"rotten\" or corrupt with the idea of the \"heart,\" which represents one's feelings and disposition. Because of its complexity and rarity, it is more likely to be encountered in advanced texts or discussions. "},"example_sentences":[{"sentence":"The villain laughed rotten-heartedly as he revealed his evil plan.","translation":"悪役は邪悪な計画を明かしながら、心が腐っているかのように笑った。","type":"adverb","meaning_category":"意地悪く"},{"sentence":"She treated her employees rotten-heartedly, showing no empathy for their struggles.","translation":"彼女は従業員を心が腐っているかのように扱い、彼らの苦労に全く共感を示さなかった。","type":"adverb","meaning_category":"不親切に"}]}