{"word":"verdugoship","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"The office, position, or tenure of a verdugo (an official in some Spanish-speaking countries).","english_definition":"The office, position, or tenure of a verdugo.","examples":[{"sentence":"He held the verdugoship for many years, overseeing the administration of the region.","translation":"彼は長年verdugoの職を務め、その地域の行政を監督した。"}],"collocations":["hold a verdugoship","assume the verdugoship","end a verdugoship"],"synonyms":["office","position","tenure"],"antonyms":[]}],"etymology":{"value":"Derived from \"verdugo\" (Spanish for executioner or, more broadly, an official), with the suffix \"-ship\" indicating a position or office.","priority":"★★☆"},"pronunciation":{"ipa":"/vərˈduːɡoʊʃɪp/","syllables":"ver-du-go-ship"},"inflection":{"noun_plural":"verdugoships"},"usage_notes":{"explanation":"The term \"verdugoship\" is quite rare and specific. It refers to the role or period of service of a \"verdugo,\" which historically could mean an executioner but more commonly refers to a type of official, particularly in some Latin American contexts. The term is most likely to appear in historical or academic discussions of governance in those regions.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He applied for verdugoship at the company.","correct":"✓ He applied for a managerial position at the company.","note":"\"Verdugoship\" is not used in a general business context. It refers to a specific historical or regional office."}],"priority":"★☆☆"},"related_words":{"derivatives":["verdugo"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"verdugoship\" is a highly specialized term, primarily encountered in historical or academic contexts related to Spanish-speaking countries. Understanding requires familiarity with the term \"verdugo\" and the function of the \"-ship\" suffix to denote a position or office. Due to its rarity and specific usage, it is not part of common vocabulary. "},"example_sentences":[{"sentence":"The documents detailed the responsibilities of the verdugoship during the colonial era.","translation":"その文書は、植民地時代におけるverdugoの職務の詳細を記述していた。","type":"noun","meaning_category":"office/position"},{"sentence":"The transfer of power marked the end of his verdugoship.","translation":"権力の移譲は彼のverdugoとしての任期の終わりを告げた。","type":"noun","meaning_category":"tenure"}]}