{"word":"convocated","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"召集した、招集した（会議、集会などを）","english_definition":"Called together; assembled for a meeting or assembly.","examples":[{"sentence":"The university president convocated a meeting of the faculty to discuss the new curriculum.","translation":"大学の学長は、新しいカリキュラムについて議論するために教職員会議を召集した。"},{"sentence":"The governor convocated the state legislature to address the emergency situation.","translation":"知事は緊急事態に対処するために州議会を招集した。"}],"collocations":["convocate a meeting","convocate an assembly","convocate a council"],"synonyms":["summoned","assembled","gathered","called together"],"antonyms":["dismissed","adjourned","dispersed"]}],"etymology":{"value":"Late Latin convocatus, past participle of convocare (\"to call together\"), from Latin com- (\"together\") + vocare (\"to call\").","priority":"★★☆"},"pronunciation":{"ipa":"ˈkɒnvəˌkeɪtɪd","syllables":"con-vo-cat-ed"},"inflection":{"verb_forms":{"present_simple":["convocate","convocates"],"past_simple":"convocated","past_participle":"convocated","present_participle":"convocating"}},"usage_notes":{"explanation":"'Convocated' is the past tense and past participle of the verb 'convocate,' which means to call together or summon people for a meeting or assembly. It is often used in formal contexts, such as academic or governmental settings.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The team was convocated to celebrate their victory.","correct":"✓ The team was assembled to celebrate their victory.","note":"'Convocate' implies a formal summoning for a specific purpose, not just gathering for any reason. 'Assembled' is more appropriate for a celebration. "},{"incorrect":"✗ She convocated a delicious dinner for her friends.","correct":"✓ She prepared a delicious dinner for her friends.","note":"'Convocate' is used for calling people together, not for preparing food or other items."}],"priority":"★★☆"},"related_words":{"derivatives":["convocation (名詞: 召集、招集された集会)","convocator (名詞: 召集者)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Convocated' is a formal term used to describe the act of calling people together for a specific meeting or assembly, often in academic, governmental, or ecclesiastical contexts. It is derived from the verb 'convocate,' which implies a deliberate and official summoning. This word is less common in everyday language and more frequently encountered in formal writing or speech. "},"example_sentences":[{"sentence":"The principal convocated a meeting of all teachers to discuss the new school policies.","translation":"校長は新しい学校の方針について議論するために、すべての教師の会議を召集した。","type":"verb","meaning_category":"召集する"},{"sentence":"Having convocated the council, the chairman outlined the agenda for the day.","translation":"評議会を召集した後、議長はその日の議題の概要を説明した。","type":"verb","meaning_category":"召集する"}]}