{"word":"non-consumptive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"消費的でない、消費を伴わない","english_definition":"Not involving consumption or destruction of a resource.","examples":[{"sentence":"Non-consumptive water use, such as hydroelectric power generation, returns the water to the source.","translation":"水力発電のような非消費的な水の利用は、水を源に戻します。"},{"sentence":"Wildlife viewing is a non-consumptive use of natural resources.","translation":"野生生物の観察は、天然資源の非消費的な利用です。"}],"collocations":["non-consumptive use","non-consumptive recreation","non-consumptive water use"],"synonyms":["sustainable","renewable","non-destructive"],"antonyms":["consumptive","destructive"]}],"etymology":{"value":"\"non-\" (否定) + \"consumptive\" (消費的な)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn.kənˈsʌm.ptɪv/","syllables":"non-con-sump-tive"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"\"Non-consumptive\" describes activities or uses that do not deplete or destroy a resource. It's often used in the context of natural resource management, environmental science, and economics. It emphasizes sustainability and the preservation of resources for future use.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The non-consumptive product is very popular.","correct":"✓ The non-consumptive use of the park is encouraged.","note":"\"Non-consumptive\" typically modifies \"use\" or \"activity\" rather than a product. Focus on the action, not the object. "},{"incorrect":"✗ Consumptive use is better than non-consumptive.","correct":"✓ Non-consumptive use is generally more sustainable than consumptive use.","note":"The value judgment depends on the context, but generally, non-consumptive use is considered more sustainable. Avoid making sweeping generalizations."}],"priority":"★★☆"},"related_words":{"derivatives":["consumptive (形容詞: 消費的な)","consumption (名詞: 消費)"],"phrasal_verbs":[],"related_concepts":["sustainable development","resource management","environmental conservation"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"non-consumptive\" is a technical term used in environmental science, resource management, and related fields. It describes activities that utilize resources without depleting or destroying them. Understanding this term requires a grasp of abstract concepts related to sustainability and resource conservation. It is not commonly used in everyday language. "},"example_sentences":[{"sentence":"The park promotes non-consumptive recreational activities, such as hiking and birdwatching.","translation":"その公園は、ハイキングやバードウォッチングのような非消費的なレクリエーション活動を推進しています。","type":"adjective","meaning_category":"資源利用"},{"sentence":"Non-consumptive data collection methods are preferred in long-term ecological studies.","translation":"長期的な生態学的研究では、非消費的なデータ収集方法が好まれます。","type":"adjective","meaning_category":"研究方法"},{"sentence":"The economic value of non-consumptive ecosystem services is often underestimated.","translation":"非消費的な生態系サービスの経済的価値は、しばしば過小評価されます。","type":"adjective","meaning_category":"経済"}]}