{"word":"genotoxicity","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"遺伝毒性：細胞の遺伝物質（DNAまたはRNA）に有害な影響を与える物質または作用の性質。","english_definition":"The property of a substance or agent to cause adverse effects on the genetic material (DNA or RNA) of a cell.","examples":[{"sentence":"The genotoxicity of the chemical was assessed using in vitro tests.","translation":"その化学物質の遺伝毒性は、in vitro試験を用いて評価された。"},{"sentence":"Exposure to certain environmental pollutants can lead to genotoxicity and increase the risk of cancer.","translation":"特定の環境汚染物質への暴露は、遺伝毒性を引き起こし、癌のリスクを高める可能性がある。"},{"sentence":"The study investigated the genotoxicity of nanoparticles in human cells.","translation":"その研究では、ヒト細胞におけるナノ粒子の遺伝毒性を調査した。"}],"collocations":["assess genotoxicity","evaluate genotoxicity","induce genotoxicity","genotoxicity testing","genotoxicity assay"],"synonyms":["mutagenicity","DNA damage potential"],"antonyms":["non-genotoxicity"],"related_terms":["mutagen","carcinogen","DNA adduct","chromosome aberration","micronucleus assay"]}],"etymology":{"value":"'geno-' (遺伝子) + 'toxicity' (毒性) から構成される。","priority":"★★★"},"pronunciation":{"ipa":"/ˌdʒiːnoʊtɒkˈsɪsɪti/","syllables":"ge-no-tox-ic-i-ty"},"inflection":{"noun_plural":"genotoxicities"},"usage_notes":{"explanation":"Genotoxicity is a term used in toxicology and genetics to describe the ability of a chemical or physical agent to damage DNA, leading to mutations, chromosomal aberrations, or other genetic alterations. Genotoxicity testing is a crucial part of the safety assessment of new drugs, chemicals, and other products to determine their potential to cause harm to living organisms.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The chemical has a high genotoxic.","correct":"✓ The chemical has high genotoxicity.","note":"'Genotoxic' is an adjective, while 'genotoxicity' is a noun. Use the noun form to describe the property of having the potential to damage DNA."}],"priority":"★★☆"},"related_words":{"derivatives":["genotoxic (adjective)"],"related_terms":["mutagen","carcinogen","DNA damage","mutation","chromosome aberration","micronucleus","Ames test","in vitro","in vivo"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily used in scientific and technical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Genotoxicity' is a technical term used in science, especially in toxicology and genetics. It refers to the ability of a substance to damage the DNA or RNA inside cells. This damage can lead to mutations or other genetic problems. Scientists often test chemicals to see if they have genotoxicity to ensure they are safe for use. Understanding this term requires some background knowledge in biology and chemistry."},"example_sentences":[{"sentence":"The researchers aimed to determine the genotoxicity of the new compound.","translation":"研究者たちは、その新しい化合物の遺伝毒性を特定することを目的とした。","type":"general"},{"sentence":"Genotoxicity testing is a regulatory requirement for many pharmaceutical products.","translation":"遺伝毒性試験は、多くの医薬品に対する規制要件である。","type":"regulatory"},{"sentence":"The study found no evidence of genotoxicity associated with the substance.","translation":"その研究では、その物質に関連する遺伝毒性の証拠は見つからなかった。","type":"research"}]}