{"word":"Cnossian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"クノッソス（古代都市）の、クノッソス人（またはミノス人）の","english_definition":"Relating to Knossos, an ancient city on Crete, or its people (the Minoans).","examples":[{"sentence":"Cnossian pottery is known for its intricate designs.","translation":"クノッソスの陶器は、その複雑なデザインで知られています。"},{"sentence":"The Cnossian civilization flourished during the Bronze Age.","translation":"クノッソス文明は青銅器時代に繁栄しました。"}],"collocations":["Cnossian palace","Cnossian art","Cnossian frescoes"],"synonyms":["Minoan","Cretan"],"antonyms":[]}],"etymology":{"value":"Derived from Knossos, the ancient city on Crete.","priority":"★★★"},"pronunciation":{"ipa":"/ˈnɒsiən/","syllables":"Cnos-si-an"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"'Cnossian' is primarily used in historical and archaeological contexts when discussing the Minoan civilization centered at Knossos. It is often used to describe artifacts, architecture, or other cultural elements associated with this civilization.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Cnossian language is widely spoken today.","correct":"✓ The Cnossian language is no longer spoken today.","note":"The Cnossian language (Linear A) is not spoken today and has not been fully deciphered."}],"priority":"★★☆"},"related_words":{"derivatives":["Knossos","Minoan"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Cnossian' is a specialized term primarily encountered in the context of ancient history and archaeology, specifically relating to the Minoan civilization centered at Knossos on the island of Crete. Due to its limited and specific usage, it is considered an advanced vocabulary word."},"example_sentences":[{"sentence":"The archaeologist discovered a well-preserved Cnossian vase.","translation":"考古学者は保存状態の良いクノッソスの壺を発見しました。","type":"adjective","meaning_category":"Relating to Knossos"},{"sentence":"Cnossian society was highly advanced for its time.","translation":"クノッソス社会は当時としては非常に発達していました。","type":"adjective","meaning_category":"Relating to Knossos"}]}