{"word":"Xanthippe","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"クサンティッペ：古代ギリシャの哲学者ソクラテスの妻。気性が激しく口やかましい妻の代名詞として使われることがある。","english_definition":"Xanthippe: The wife of Socrates, known for her sharp tongue and difficult temperament. Her name is sometimes used to refer to a shrewish or nagging wife.","examples":[{"sentence":"Xanthippe is often portrayed as a difficult and argumentative wife.","translation":"クサンティッペは、しばしば気難しく議論好きな妻として描かれる。"},{"sentence":"He jokingly referred to his wife as Xanthippe.","translation":"彼は冗談めかして自分の妻をクサンティッペと呼んだ。"}],"collocations":["a modern Xanthippe (現代のクサンティッペ)"],"synonyms":["shrew","termagant","virago"],"antonyms":[]}],"etymology":{"value":"古代ギリシャ語の Ξανθίππη (Xanthippē) に由来。ξανθός (xanthos, 「黄色、金色」) + ἵππος (hippos, 「馬」) から構成される。","priority":"★★☆"},"pronunciation":{"ipa":"/zænˈθɪpi/","syllables":"zan-THIP-pee"},"inflection":{"notes":"固有名詞のため、複数形はありません。"},"usage_notes":{"explanation":"「**Xanthippe**」は、ソクラテスの妻の名前ですが、彼女の性格から転じて「口やかましい妻」の代名詞として使われることがあります。ただし、この用法はしばしば女性に対する偏見を含んでいるため、注意が必要です。歴史的な人物名として使う場合は中立的ですが、性格を表す場合は文脈に配慮しましょう。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Xanthippe was a philosopher.","correct":"✓ Xanthippe was the wife of a philosopher.","note":"クサンティッペは哲学者ではなく、哲学者の妻でした。"},{"incorrect":"✗ He called his wife a Xanthippe as a compliment.","correct":"✓ He called his wife a Xanthippe, possibly as a joke, but it might be considered insulting.","note":"「Xanthippe」という言葉は、一般的に褒め言葉としては使われません。妻を口やかましいと表現することは、侮辱と受け取られる可能性があります。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (文学作品や哲学史で言及されることがある)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 一般的な会話ではほとんど使われない。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Xanthippe**」は、古代ギリシャの哲学者ソクラテスの妻の名前です。彼女は気性が激しく、口やかましいことで知られており、その名前は「口やかましい妻」の代名詞として使われることがあります。ただし、この用法は現代では性差別的と見なされる可能性があるため、使用には注意が必要です。主に文学作品や哲学史の中で言及されることが多く、日常会話で使われることはほとんどありません。"},"example_sentences":[{"sentence":"The playwright depicted Xanthippe as a scolding and demanding wife.","translation":"その劇作家はクサンティッペを、小言が多くて要求の多い妻として描いた。","type":"noun","meaning_category":"古代ギリシャの人物"},{"sentence":"Some historians argue that the negative portrayal of Xanthippe is unfair.","translation":"一部の歴史家は、クサンティッペの否定的な描写は不当だと主張している。","type":"noun","meaning_category":"古代ギリシャの人物"},{"sentence":"He jokingly called his wife a Xanthippe, but she didn't find it amusing.","translation":"彼は冗談で妻をクサンティッペと呼んだが、彼女は面白いと思わなかった。","type":"noun","meaning_category":"口やかましい妻の代名詞"}]}