{"word":"Flathead","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(魚類) カワアナゴ科の魚の総称、特にコチ","english_definition":"Any fish of the family Platycephalidae, especially the dusky flathead (Platycephalus fuscus).","examples":[{"sentence":"The angler caught a large flathead in the estuary.","translation":"釣り人は河口で大きなコチを釣り上げた。"}],"collocations":["dusky flathead","bartail flathead"],"synonyms":["platycephalid"],"antonyms":[]},{"part_of_speech":"noun","definition":"(俗語、侮蔑的) 頭の平らな人、特に先住民に対する侮蔑語","english_definition":"(slang, derogatory) A person with a flattened head; historically, a derogatory term for certain Native American tribes who practiced head flattening.","examples":[{"sentence":"The term 'flathead' is considered offensive when referring to Native Americans.","translation":"「flathead」という言葉は、ネイティブアメリカンを指す場合、侮辱的であると考えられている。"}],"collocations":[],"synonyms":["blockhead","idiot"],"antonyms":[]},{"part_of_speech":"adjective","definition":"頭が平らな","english_definition":"Having a flat head.","examples":[{"sentence":"The flathead catfish is named for its flattened head.","translation":"フラットヘッドナマズは、その平らな頭にちなんで名付けられた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the literal description of having a flat head.  The term's application to fish refers to their physical characteristic. Its application to people, specifically Native Americans, stems from the historical practice of artificial cranial deformation, where infants' heads were intentionally flattened.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈflætˌhɛd/","syllables":"flat-head"},"inflection":{"notes":"The noun 'flathead' has a regular plural form: flatheads."},"usage_notes":{"explanation":"The term 'Flathead' has two primary meanings: one referring to a type of fish and another, historically derogatory, referring to people, particularly certain Native American tribes. The usage referring to people is highly sensitive and should be avoided. When referring to fish, it is a descriptive term.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a flathead walking down the street.","correct":"✓ I saw a flathead catfish in the aquarium.","note":"Unless the context clearly indicates otherwise, 'flathead' generally refers to the fish. Using it to refer to a person is usually offensive."}],"priority":"★★☆"},"related_words":{"derivatives":["flatheaded (adjective)"],"phrasal_verbs":[],"related_terms":["Platycephalidae (scientific name for the flathead fish family)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, context-dependent.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Flathead' requires careful consideration due to its dual meanings and potential for offense. While it accurately describes a type of fish, its historical use as a derogatory term for certain Native American tribes makes it a sensitive word. Understanding the context is crucial to avoid misinterpretation and causing offense."},"example_sentences":[{"sentence":"We caught several **flathead** while fishing in the bay.","translation":"私たちは湾で釣りをしている間、数匹のコチを捕まえた。","type":"noun","meaning_category":"魚"},{"sentence":"The **Flathead** River is a major waterway in Montana.","translation":"フラットヘッド川はモンタナ州の主要な水路である。","type":"noun","meaning_category":"地名"},{"sentence":"(Avoid) Using '**flathead**' as a term for a person is offensive.","translation":"（避けるべき）「flathead」を人に対する言葉として使うことは侮辱的である。","type":"noun","meaning_category":"侮蔑語"}]}