{"word":"Hypercalcemia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"高カルシウム血症","english_definition":"A condition in which the calcium level in the blood is above normal.","examples":[{"sentence":"Hypercalcemia can be caused by various factors, including hyperparathyroidism and certain cancers.","translation":"高カルシウム血症は、副甲状腺機能亢進症や特定のがんなど、さまざまな要因によって引き起こされる可能性があります。"},{"sentence":"Symptoms of hypercalcemia may include fatigue, weakness, and increased thirst.","translation":"高カルシウム血症の症状には、倦怠感、脱力感、喉の渇きなどがあります。"}],"collocations":["cause of hypercalcemia (高カルシウム血症の原因)","symptoms of hypercalcemia (高カルシウム血症の症状)","treatment for hypercalcemia (高カルシウム血症の治療)","severe hypercalcemia (重度の高カルシウム血症)","mild hypercalcemia (軽度の高カルシウム血症)"],"synonyms":["elevated calcium levels","high blood calcium"],"antonyms":["hypocalcemia (低カルシウム血症)"]},{"part_of_speech":"noun","definition":"(獣医学)高カルシウム血症","english_definition":"(Veterinary medicine) A condition in animals characterized by abnormally high levels of calcium in the blood.","examples":[{"sentence":"Hypercalcemia is a common finding in dogs with certain types of cancer.","translation":"高カルシウム血症は、特定の種類のがんを持つ犬によく見られる所見です。"},{"sentence":"The veterinarian diagnosed hypercalcemia in the cat after blood tests.","translation":"獣医は血液検査の後、猫に高カルシウム血症と診断しました。"}],"collocations":["feline hypercalcemia (猫の高カルシウム血症)","canine hypercalcemia (犬の高カルシウム血症)","idiopathic hypercalcemia (特発性高カルシウム血症)"],"synonyms":["elevated serum calcium","high calcium in animals"],"antonyms":["hypocalcemia (低カルシウム血症)"]}],"etymology":{"value":"The term 'hypercalcemia' is derived from the Greek roots 'hyper-' (meaning above or excessive), 'calc-' (referring to calcium), and '-emia' (referring to a condition of the blood).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpərkælˈsiːmiə/","syllables":"hy-per-cal-ce-mi-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Hypercalcemia is a medical condition characterized by an abnormally high concentration of calcium in the blood. It can result from various underlying causes, including endocrine disorders (such as hyperparathyroidism), certain types of cancer, vitamin D toxicity, and kidney disease. The symptoms of hypercalcemia can vary depending on the severity and duration of the condition, ranging from mild symptoms like fatigue and constipation to more severe symptoms such as kidney stones, bone pain, and neurological problems. Diagnosis typically involves blood tests to measure calcium levels, and treatment focuses on addressing the underlying cause and lowering calcium levels through medications, intravenous fluids, or dialysis in severe cases.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Hypercalcemia is when you have low calcium.","correct":"✓ Hypercalcemia is when you have high calcium.","note":"Hypercalcemia refers to high calcium levels, not low calcium levels. Hypocalcemia refers to low calcium levels."},{"incorrect":"✗ Hypercalcemia always has obvious symptoms.","correct":"✓ Hypercalcemia may not always have obvious symptoms, especially in mild cases.","note":"Mild hypercalcemia may be asymptomatic (without symptoms)."},{"incorrect":"✗ You can cure hypercalcemia with calcium supplements.","correct":"✓ Calcium supplements are generally not used to treat hypercalcemia and may worsen the condition.","note":"Calcium supplements are contraindicated (not recommended) in hypercalcemia."}],"priority":"★★☆"},"related_words":{"derivatives":["hypercalciuria (高カルシウム尿症)","calcemia (カルシウム血症)","hypocalcemia (低カルシウム血症)","normocalcemia (正常カルシウム血症)"],"medical_terms":["hyperparathyroidism (副甲状腺機能亢進症)","vitamin D toxicity (ビタミンD中毒)","renal failure (腎不全)","malignancy (悪性腫瘍)","bone resorption (骨吸収)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hypercalcemia' is a medical term referring to an elevated level of calcium in the blood. It is important to understand that 'hyper-' indicates 'high' or 'excessive,' 'calc-' refers to 'calcium,' and '-emia' signifies 'a condition in the blood.' This condition can be caused by a variety of factors, including endocrine disorders, certain cancers, and vitamin D toxicity. Symptoms can range from mild to severe, and diagnosis is typically made through blood tests. Treatment focuses on addressing the underlying cause and lowering calcium levels. This term is primarily used in medical contexts and may not be familiar to the general public."},"example_sentences":[{"sentence":"The patient was diagnosed with hypercalcemia after routine blood work revealed elevated calcium levels.","translation":"定期的な血液検査でカルシウム値の上昇が明らかになった後、患者は高カルシウム血症と診断されました。","type":"general","meaning_category":"Medical Condition"},{"sentence":"Persistent hypercalcemia can lead to kidney damage and other serious complications.","translation":"持続的な高カルシウム血症は、腎臓の損傷やその他の深刻な合併症につながる可能性があります。","type":"general","meaning_category":"Medical Condition"},{"sentence":"In veterinary medicine, hypercalcemia is often associated with certain types of cancer in dogs.","translation":"獣医学では、高カルシウム血症は犬の特定の種類のがんと関連していることがよくあります。","type":"veterinary","meaning_category":"Veterinary Medicine"},{"sentence":"The treatment for hypercalcemia depends on the underlying cause and the severity of the condition.","translation":"高カルシウム血症の治療は、根本的な原因と状態の重症度によって異なります。","type":"general","meaning_category":"Treatment"}]}