{"word":"Triptych","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"三連祭壇画、三枚続きの絵","english_definition":"A picture or carving in three panels side by side.","examples":[{"sentence":"The artist created a stunning triptych depicting scenes from the Bible.","translation":"その芸術家は聖書の場面を描いた見事な三連祭壇画を制作した。"},{"sentence":"The museum's collection includes a famous triptych by Hieronymus Bosch.","translation":"その美術館のコレクションには、ヒエロニムス・ボスの有名な三連祭壇画が含まれている。"}],"collocations":["altarpiece triptych","photographic triptych","contemporary triptych"],"synonyms":["three-paneled artwork","three-part painting"],"antonyms":[]}],"etymology":{"value":"The word \"triptych\" comes from the Greek word \"triptychos\" (τρίπτυχος), meaning \"three-layered\" or \"three-folded,\" from \"tri-\" (three) + \"ptysso\" (to fold).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtrɪptɪk/","syllables":"trip-tych"},"inflection":{"noun_plural":"Triptychs"},"usage_notes":{"explanation":"A triptych is a work of art (usually a panel painting) that is divided into three sections, or panels that are hinged together and can be folded shut or displayed open. It is a common format for altarpieces and other religious works of art. The three panels are usually related thematically.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a diptych that was a triptych.","correct":"✓ I saw a triptych.","note":"A diptych has two panels, while a triptych has three. They are different forms of art."}],"priority":"★☆☆"},"related_words":{"derivatives":["diptych (two-paneled artwork)","polyptych (multi-paneled artwork)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"triptych\" refers to a specific artistic format involving three panels. Understanding its etymology and historical context (often religious art) is helpful. The word itself is not commonly used in everyday conversation but is relevant in art history and criticism contexts."},"example_sentences":[{"sentence":"The gallery displayed a modern triptych made of photographs.","translation":"ギャラリーは写真でできた現代的な三連祭壇画を展示した。","type":"noun","meaning_category":"art"},{"sentence":"The artist used the triptych format to tell a story in three distinct parts.","translation":"そのアーティストは、三連祭壇画の形式を使って、3つの異なる部分で物語を語った。","type":"noun","meaning_category":"art"}]}