{"word":"memorialization","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"記念化、追悼、記念碑建立、記憶の保持","english_definition":"The act of preserving the memory of someone or something, especially by means of a monument or ceremony.","examples":[{"sentence":"The memorialization of war veterans is an important part of national identity.","translation":"戦争退役軍人の記念化は、国民的アイデンティティの重要な部分です。"},{"sentence":"The city council discussed the memorialization of the historical event with a new statue.","translation":"市議会は、新しい像による歴史的イベントの記念化について議論しました。"},{"sentence":"Online memorialization allows friends and family to share memories of loved ones who have passed away.","translation":"オンラインでの記念化により、友人や家族は亡くなった愛する人々の思い出を共有できます。"},{"sentence":"The museum's exhibit focused on the memorialization of the Holocaust.","translation":"博物館の展示は、ホロコーストの記念化に焦点を当てていました。"}],"collocations":["historical memorialization (歴史的記念化)","cultural memorialization (文化的記念化)","online memorialization (オンライン記念化)","public memorialization (公共の記念化)","memorialization ceremony (記念式典)","memorialization project (記念化プロジェクト)"],"synonyms":["commemoration","remembrance","honoring","tribute","dedication","celebration","immortalization"],"antonyms":["oblivion","forgetfulness","disregard","neglect","suppression","erasure"]}],"etymology":{"value":"The word 'memorialization' is derived from 'memorialize,' which comes from 'memorial' (something that serves to preserve remembrance). 'Memorial' itself comes from the Latin 'memorialis,' pertaining to memory. The suffix '-ization' is added to form a noun indicating the process or act of making something a memorial.","priority":"★★☆"},"pronunciation":{"ipa":"/məˌmɔːriəlaɪˈzeɪʃən/","syllables":"me-mo-ri-al-i-za-tion"},"inflection":{"noun_plural":"memorializations"},"usage_notes":{"explanation":"'Memorialization' refers to the process of creating or maintaining something that serves as a reminder of a person, event, or idea. This can take many forms, including building monuments, holding ceremonies, creating online tributes, or preserving historical records. The term often carries a sense of respect and reverence for the subject being memorialized. It is frequently used in the context of historical events, war, and the loss of loved ones.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The memorialization was very emotional.","correct":"✓ The memorial service was very emotional.","note":"'Memorialization' refers to the process, while 'memorial service' refers to a specific event. Using 'memorial service' is more appropriate when describing an event. Alternatively, 'The memorialization process was very emotional' would be correct."},{"incorrect":"✗ They memorialized the event with a simple remember.","correct":"✓ They memorialized the event with a simple ceremony. / ✓ They remembered the event.","note":"'Remember' is a verb, while 'memorialization' implies a more formal or structured act of remembrance. A ceremony or monument is a more fitting result of memorialization. Using 'remembered' is correct if simply referring to the act of recalling the event."}],"priority":"★☆☆"},"related_words":{"derivatives":["memorialize (verb: to commemorate or honor)","memorial (noun: something that serves to preserve remembrance; adjective: serving as a memorial)","memorialist (noun: one who creates or studies memorials)"],"phrasal_verbs":[],"related_concepts":["collective memory (集合的記憶)","cultural heritage (文化遺産)","remembrance day (戦没者追悼記念日)","historical preservation (歴史的保存)","commemorative event (記念行事)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency. More common in academic or formal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Memorialization' is a complex term referring to the process of preserving the memory of a person, event, or idea, often through formal or symbolic means. It involves active efforts to ensure that something is not forgotten, typically due to its historical, cultural, or personal significance. The word is often used in discussions about history, politics, and cultural studies, and it implies a deliberate and thoughtful approach to remembering the past. It is less common in everyday conversation and more frequently encountered in academic or formal writing.","priority":"★☆☆"},"example_sentences":[{"sentence":"The government invested in the **memorialization** of the national hero through a grand monument.","translation":"政府は、壮大な記念碑を通じて、国民的英雄の記念化に投資しました。","type":"noun","meaning_category":"記念碑建立"},{"sentence":"The **memorialization** of the victims of the tragedy helped the community heal.","translation":"悲劇の犠牲者の記念化は、コミュニティの癒しに役立ちました。","type":"noun","meaning_category":"追悼"},{"sentence":"Digital **memorialization** is becoming increasingly common as a way to remember loved ones.","translation":"デジタル記念化は、愛する人を追悼する方法としてますます一般的になっています。","type":"noun","meaning_category":"記憶の保持"},{"sentence":"The project aims at the **memorialization** of the indigenous culture through art and storytelling.","translation":"このプロジェクトは、芸術と物語を通して先住民族の文化の記念化を目指しています。","type":"noun","meaning_category":"記念化"}]}