{"word":"Mycohemia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The presence of fungi or fungal elements in the blood.","english_definition":"The presence of fungi or fungal elements in the blood.","examples":[{"sentence":"Mycohemia is a serious condition requiring prompt diagnosis and treatment.","translation":"真菌血症は迅速な診断と治療を必要とする深刻な状態です。"},{"sentence":"The patient's blood culture revealed mycohemia, indicating a systemic fungal infection.","translation":"患者の血液培養検査で真菌血症が明らかになり、全身性の真菌感染症が示唆されました。"}],"collocations":["diagnose mycohemia","treat mycohemia","blood culture for mycohemia","candida mycohemia"],"synonyms":["fungemia","fungal sepsis","systemic fungal infection"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'myco-' (fungus), 'hem-' (blood), and '-ia' (condition).","priority":"★★★"},"pronunciation":{"ipa":"/ˌmaɪkoʊˈhiːmiə/","syllables":"My-co-he-mi-a"},"inflection":{"noun_plural":"mycohemias"},"usage_notes":{"explanation":"Mycohemia is a medical term specifically referring to the presence of fungi in the bloodstream. It is often used interchangeably with fungemia, though some sources may distinguish subtle differences. It is a serious condition that can lead to sepsis and requires immediate medical attention.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor suspected bacteremia, but it turned out to be mycohemia.","correct":"✓ The doctor suspected bacteremia, but it turned out to be mycohemia.","note":"Bacteremia refers to the presence of bacteria in the blood, while mycohemia refers to the presence of fungi. They are distinct conditions."}],"priority":"★★☆"},"related_words":{"derivatives":["mycotic (adjective: relating to or caused by fungus)","fungemia (noun: presence of fungi in the blood)","sepsis (noun: a life-threatening condition caused by the body's response to an infection)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2 (specialized medical vocabulary)","frequency_google_ngram":"Very low frequency - a specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mycohemia' is a specialized medical term indicating a fungal infection in the bloodstream. It's crucial to differentiate it from 'bacteremia,' which refers to a bacterial infection in the blood. The term is primarily used in medical contexts and requires a strong understanding of medical terminology.","priority":"★★☆"},"example_sentences":[{"sentence":"Early detection of mycohemia is crucial for effective treatment.","translation":"真菌血症の早期発見は効果的な治療に不可欠です。","type":"medical","meaning_category":"fungal infection in blood"},{"sentence":"The patient developed mycohemia following a prolonged course of antibiotics.","translation":"患者は長期の抗生物質投与後に真菌血症を発症しました。","type":"medical","meaning_category":"fungal infection in blood"}]}