{"word":"Archhost","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Fantasy/Sci-Fi) A powerful, often malevolent, entity or being that serves as the primary antagonist or a significant force of evil.","english_definition":"In fantasy or science fiction, a powerful entity, often malevolent, that serves as a primary antagonist or a significant source of evil.","examples":[{"sentence":"The heroes must defeat the Archhost to save the kingdom.","translation":"英雄たちは王国を救うためにアーチホストを倒さなければならない。"},{"sentence":"The Archhost's influence spread like a dark plague across the land.","translation":"アーチホストの影響は暗い疫病のようにその土地に広がった。"}],"collocations":["defeat the Archhost","the Archhost's power","the Archhost's influence"],"synonyms":["overlord","nemesis","supreme villain","dark lord"],"antonyms":["protagonist","benevolent deity","savior"]}],"etymology":{"value":"A combination of 'arch-' (meaning chief or principal) and 'host' (referring to a large group or army, often with negative connotations in this context). The 'arch-' prefix elevates the 'host' to a position of supreme power or leadership, typically within an antagonistic force.","priority":"★★☆"},"pronunciation":{"ipa":"/ɑːrtʃhoʊst/","syllables":"Arch-host"},"inflection":{"noun_plural":"Archhosts"},"usage_notes":{"explanation":"'Archhost' is primarily used within the context of fantasy or science fiction narratives. It denotes a central antagonist who commands significant power and often leads a large, malevolent force. The term is less common in everyday language and more prevalent in genre-specific literature, games, and media.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The archhost was a kind and gentle ruler.","correct":"✓ The archhost was a cruel and tyrannical ruler.","note":"Archhosts are typically portrayed as malevolent or antagonistic figures, not benevolent ones."}],"priority":"★★☆"},"related_words":{"derivatives":["arch (prefix meaning chief or principal)","host (a large number of people or things)"],"phrasal_verbs":[],"related_terms":["archvillain","overlord","dark lord","nemesis"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily used in fantasy and science fiction contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Archhost' is a term primarily found in fantasy and science fiction. It refers to a major villain or antagonistic force, often commanding a large group or army. The prefix 'arch-' indicates that this entity is the chief or principal one, making it a powerful and significant threat within the narrative. Understanding this term requires familiarity with genre conventions and vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The prophecy foretold the coming of the Archhost and the end of the world.","translation":"予言はアーチホストの到来と世界の終わりを告げていた。","type":"noun","meaning_category":"antagonist"},{"sentence":"The Archhost's armies marched across the plains, leaving destruction in their wake.","translation":"アーチホストの軍隊は平原を横断し、破壊の跡を残した。","type":"noun","meaning_category":"antagonist"},{"sentence":"Only the legendary sword could defeat the Archhost.","translation":"伝説の剣だけがアーチホストを倒すことができた。","type":"noun","meaning_category":"antagonist"}]}