{"word":"Fluorography","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"蛍光写真法、蛍光X線写真法","english_definition":"A photographic process in which an image is recorded by the fluorescence produced when a substance is exposed to X-rays or other radiation.","examples":[{"sentence":"Fluorography is used in medical imaging to visualize structures containing fluorescent markers.","translation":"蛍光写真法は、蛍光マーカーを含む構造を可視化するために医療イメージングで使用されます。"},{"sentence":"The results of the fluorography were used to diagnose the patient's condition.","translation":"蛍光写真の結果は、患者の状態を診断するために使用されました。"}],"collocations":["medical fluorography","X-ray fluorography"],"synonyms":["radiography","scintigraphy","X-ray imaging"],"antonyms":[]}],"etymology":{"value":"'Fluoro-' refers to fluorescence, and '-graphy' refers to a process of recording or writing.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌflʊərəˈɡrɒfi/","syllables":"flu-o-rog-ra-phy"},"inflection":{"noun_plural":"fluorographies"},"usage_notes":{"explanation":"Fluorography is a technique used to capture images based on fluorescence, often induced by X-rays. It is used in various scientific and medical applications.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Fluorography is the same as a fluoroscope.","correct":"✓ Fluorography is a photographic process, while a fluoroscope is a device for real-time imaging.","note":"Fluorography is a method of recording images, whereas a fluoroscope provides real-time viewing."}],"priority":"★☆☆"},"related_words":{"derivatives":["fluorographic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Fluorography is a specialized term primarily used in scientific and medical contexts. It refers to a photographic process that records images based on fluorescence, often induced by X-rays. Understanding this term requires familiarity with scientific imaging techniques."},"example_sentences":[{"sentence":"The research team used fluorography to analyze the distribution of the labeled protein.","translation":"研究チームは、標識されたタンパク質の分布を分析するために蛍光写真法を使用しました。","type":"noun","meaning_category":"蛍光写真法"},{"sentence":"Fluorography allows for the detection of low levels of radioactivity in samples.","translation":"蛍光写真法により、サンプル中の低レベルの放射能の検出が可能になります。","type":"noun","meaning_category":"蛍光写真法"}]}