{"word":"Botticellian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ボッティチェリ風の、ボッティチェリに似た","english_definition":"Resembling or characteristic of the style of the Italian Renaissance painter Sandro Botticelli.","examples":[{"sentence":"She had a Botticellian beauty, with long flowing hair and delicate features.","translation":"彼女は、長い流れるような髪と繊細な顔立ちで、ボッティチェリ風の美しさを持っていた。"},{"sentence":"The painting had a Botticellian grace and elegance.","translation":"その絵画は、ボッティチェリ風の優雅さと気品を備えていた。"}],"collocations":["Botticellian beauty","Botticellian grace","Botticellian style"],"synonyms":["Botticellesque"],"antonyms":[]}],"etymology":{"value":"From the name of the Italian Renaissance painter Sandro Botticelli (1445–1510), plus the suffix '-ian'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌbɒtɪˈtʃɛliən/","syllables":"Bot-ti-cel-li-an"},"inflection":{"notes":"Adjectives do not inflect in English, but can be used in comparative and superlative forms with 'more' and 'most', though this is rare for 'Botticellian'."},"usage_notes":{"explanation":"'Botticellian' is used to describe something that resembles the artistic style of Sandro Botticelli, particularly his depictions of figures with graceful poses, flowing drapery, and idealized beauty. It is most often used in the context of art and literature.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building was Botticellian.","correct":"✓ The building was built in a Botticellian style.","note":"'Botticellian' typically describes artistic style or features, not entire structures."}],"priority":"★☆☆"},"related_words":{"derivatives":["Botticelli"],"related_terms":["Renaissance","Italian Renaissance","Sandro Botticelli","art history"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Botticellian' is a relatively uncommon word used to describe something that resembles the artistic style of the Italian Renaissance painter Sandro Botticelli. It is most often used in the context of art and art history. The word implies a graceful and elegant style, often with flowing lines and idealized figures. Because it is a specialized term, it is not commonly used in everyday conversation, but is more likely to be found in academic or artistic contexts."},"example_sentences":[{"sentence":"The model's pose was reminiscent of a Botticellian Venus.","translation":"そのモデルのポーズは、ボッティチェリのヴィーナスを彷彿とさせた。","type":"adjective","meaning_category":"Resembling Botticelli's style"},{"sentence":"Her flowing red hair gave her a Botticellian appearance.","translation":"彼女の流れるような赤い髪は、彼女にボッティチェリ風の印象を与えた。","type":"adjective","meaning_category":"Resembling Botticelli's style"}]}