{"word":"texturally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"質感的に、手触りに関して、構造的に","english_definition":"with regard to texture; in terms of texture or structure.","examples":[{"sentence":"The dish was texturally interesting, with both creamy and crunchy elements.","translation":"その料理は、クリーミーな要素とカリカリした要素の両方があり、質感的に面白かった。"},{"sentence":"Texturally, the two fabrics are very different.","translation":"質感的に、その2つの生地は非常に異なる。"},{"sentence":"The artist explored the theme texturally, using rough and smooth surfaces.","translation":"アーティストは、粗い表面と滑らかな表面を使用して、質感的にテーマを探求した。"}],"collocations":["texturally diverse","texturally rich","texturally interesting","texturally complex"],"synonyms":["structurally","tactilely","materially","palpably"],"antonyms":[]}],"etymology":{"value":"Derived from the adjective 'textural', which relates to texture. Texture comes from Latin 'textura', meaning 'a weaving', from 'texere' meaning 'to weave'.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈtɛkstʃərəli/","syllables":"tex-tur-al-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Texturally' is used to describe something in terms of its texture, which can refer to the tactile quality of a surface or the structure of a substance. It is often used in contexts related to food, art, and materials science.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The painting was texturally.","correct":"✓ The painting was texturally interesting.","note":"'Texturally' is an adverb and needs to modify a verb, adjective, or another adverb. It cannot stand alone as a predicate adjective."}],"priority":"★☆☆"},"related_words":{"derivatives":["texture (noun)","textural (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Texturally' is an adverb that means 'in terms of texture'. It's used to describe how something feels or looks regarding its surface qualities. This word is more common in specialized contexts like food criticism, art analysis, or materials science where the texture is a key aspect of the subject being discussed. Because of its specific usage, it is considered a more advanced vocabulary word."},"example_sentences":[{"sentence":"The chef aimed to create a dish that was both visually appealing and texturally exciting.","translation":"シェフは、視覚的に魅力的で、質感的にエキサイティングな料理を作ることを目指した。","type":"adverb","meaning_category":"質感的に"},{"sentence":"Texturally, the bark of the tree was rough and uneven.","translation":"質感的に、その木の樹皮は粗くて不均一だった。","type":"adverb","meaning_category":"手触りに関して"},{"sentence":"The architect designed the building to be texturally diverse, using a variety of materials.","translation":"建築家は、さまざまな素材を使用して、建物が質感的に多様になるように設計した。","type":"adverb","meaning_category":"構造的に"}]}