{"word":"narcomaniac","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"麻薬中毒者、麻薬狂","english_definition":"A person with an intense craving for narcotics.","examples":[{"sentence":"The doctor recognized him as a narcomaniac seeking a prescription.","translation":"医者は彼を処方箋を求める麻薬中毒者だと認識した。"},{"sentence":"The film portrays the struggles of a narcomaniac trying to get clean.","translation":"その映画は、麻薬中毒者が薬物から抜け出そうとする苦闘を描いている。"}],"collocations":["recovering narcomaniac (回復期の麻薬中毒者)","former narcomaniac (元麻薬中毒者)"],"synonyms":["drug addict","junkie","dope fiend"],"antonyms":["abstainer"]}],"etymology":{"value":"Derived from 'narco-' (referring to narcotics) + '-maniac' (denoting an obsessive enthusiasm or craving).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɑːrkəˈmeɪniæk/","syllables":"nar-co-ma-ni-ac"},"inflection":{"noun_plural":"narcomaniacs"},"usage_notes":{"explanation":"'Narcomaniac' is a somewhat dated and stigmatizing term for a person addicted to narcotics. More neutral and preferred terms include 'person with a substance use disorder' or 'person addicted to narcotics'. The term implies an intense craving or obsession with narcotics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a narcomaniac with alcohol.","correct":"✓ He is a narcomaniac with narcotics. / ✓ He is addicted to both alcohol and narcotics.","note":"'Narcomaniac' specifically refers to an addiction to narcotics, not other substances like alcohol."}],"priority":"★☆☆"},"related_words":{"derivatives":["narcomania (麻薬中毒)"],"related_terms":["narcotics (麻薬)","addiction (中毒)","substance abuse (薬物乱用)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Narcomaniac' is a relatively uncommon and somewhat clinical term for someone intensely addicted to narcotics. It's important to note that this term can be stigmatizing, and more neutral language is often preferred when discussing addiction. Understanding the term can be helpful in older texts or medical contexts, but using person-first language is generally recommended in contemporary discussions."},"example_sentences":[{"sentence":"The novel depicted the descent of a promising young man into a desperate narcomaniac.","translation":"その小説は、有望な若者が絶望的な麻薬中毒者へと堕落していく様子を描写した。","type":"general","meaning_category":"麻薬中毒者"},{"sentence":"Rehabilitation centers offer support for narcomaniacs seeking recovery.","translation":"リハビリセンターは、回復を求める麻薬中毒者に支援を提供している。","type":"medical/social","meaning_category":"麻薬中毒者"}]}