{"word":"kegalauan","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(インドネシア語) 心配、不安、悩み、混乱、落ち着きのなさ","english_definition":"(Indonesian) worry, anxiety, unease, confusion, restlessness. A state of emotional turmoil or uncertainty.","examples":[{"sentence":"Kegalauan hatinya terlihat jelas di wajahnya.","translation":"His inner turmoil was clearly visible on his face.","english_translation":"The anxiety in his heart was clearly visible on his face."},{"sentence":"Dia sedang merasakan kegalauan tentang masa depannya.","translation":"He is feeling anxious about his future.","english_translation":"He is experiencing anxiety about his future."},{"sentence":"Kegalauan politik semakin meningkat di negara itu.","translation":"Political unrest is increasing in the country.","english_translation":"Political unease is increasing in the country."}],"collocations":["merasa kegalauan (to feel anxious)","mengatasi kegalauan (to overcome anxiety)","kegalauan hati (inner turmoil)","kegalauan pikiran (mental unrest)"],"synonyms":["kecemasan","kekhawatiran","kebimbangan","keresahan","kegelisahan"],"antonyms":["ketenangan","kedamaian","kesejahteraan"],"cultural_context":"This word often implies a deeper, more existential form of anxiety or restlessness than everyday worries. It can relate to personal, political, or spiritual matters. It is commonly used in literature, poetry, and philosophical discussions in Indonesia."}],"etymology":{"value":"Derived from the root word 'galau', which means 'confused', 'restless', or 'in a state of emotional turmoil'. The suffix '-an' transforms the root into a noun.","priority":"★★☆"},"pronunciation":{"ipa":"/kə.ɡaˈlaʊ̯.an/","syllables":"ke-ga-lau-an"},"inflection":{"noun_forms":{"singular":"kegalauan","plural":"kegalauan (though often uncountable)"}},"usage_notes":{"explanation":"'Kegalauan' is a nuanced term that goes beyond simple worry. It suggests a profound sense of unease, often related to uncertainty about the future, moral dilemmas, or a general dissatisfaction with the status quo. It's a common theme in Indonesian art and literature.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Saya merasa takut.","correct":"Saya merasa kegalauan.","note":"'Takut' means 'afraid' and describes fear of a specific thing. 'Kegalauan' is a more general feeling of anxiety or unease."}],"priority":"★★☆"},"related_words":{"derivatives":["galau (adjective/verb: confused, restless, in turmoil)","menggalau (verb: to feel or cause confusion/restlessness)"],"priority":"★★★"},"level_frequency":{"frequency_corpus":"Moderately frequent in Indonesian literature and media.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Kegalauan' is a more advanced Indonesian word describing a state of anxiety, unease, or restlessness. It's not a simple, everyday worry, but a deeper feeling of turmoil or uncertainty, often related to existential questions or societal issues. You'll encounter it more in literature, philosophical discussions, or news reports about social unrest."},"example_sentences":[{"sentence":"Remaja itu merasakan kegalauan karena harus memilih antara dua pilihan sulit.","translation":"The teenager felt anxious because he had to choose between two difficult choices.","type":"example","meaning_category":"anxiety/worry"},{"sentence":"Kegalauan ekonomi membuat banyak orang kehilangan pekerjaan.","translation":"Economic uncertainty caused many people to lose their jobs.","type":"example","meaning_category":"unease/restlessness"},{"sentence":"Puisi itu menggambarkan kegalauan seorang seniman dalam mencari jati dirinya.","translation":"The poem depicts the inner turmoil of an artist searching for his identity.","type":"example","meaning_category":"inner turmoil"}]}