{"word":"Aggappera","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Sri Lankan Slang) An overly enthusiastic or attention-seeking person; someone who is perceived as trying too hard or being excessively eager.","english_definition":"(Sri Lankan Slang) An overly enthusiastic or attention-seeking person; someone who is perceived as trying too hard or being excessively eager.","examples":[{"sentence":"Don't be such an Aggappera, no need to show off so much.","translation":"そんなにアガッペラぶらないで、そんなに見せびらかす必要ないよ。"},{"sentence":"He's such an Aggappera, always trying to impress everyone.","translation":"彼は本当にアガッペラだね、いつもみんなに良い印象を与えようとしている。"}],"collocations":["being an Aggappera","acting like an Aggappera"],"synonyms":["try-hard","show-off","attention seeker"],"antonyms":["reserved","understated"]}],"etymology":{"value":"Originates from Sri Lankan slang, possibly a playful or derogatory term. The exact etymology is not widely documented.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌæɡəˈpɛrə/","syllables":"Ag-gap-pe-ra"},"inflection":{"noun_plural":"Aggapperas"},"usage_notes":{"explanation":"'Aggappera' is a slang term primarily used in Sri Lanka to describe someone who is perceived as overly enthusiastic, attention-seeking, or trying too hard to impress others. It often carries a negative connotation, implying that the person's behavior is excessive or insincere.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She's a very Aggappera person.","correct":"✓ She's such an Aggappera.","note":"'Aggappera' is typically used as a noun to describe a person, not as an adjective to describe a quality."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily used in Sri Lanka.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Aggappera' is a slang term unique to Sri Lanka, used to describe someone who is overly enthusiastic or attention-seeking. Understanding its usage requires familiarity with Sri Lankan colloquial language and cultural context. It's not commonly used or understood outside of Sri Lanka."},"example_sentences":[{"sentence":"Stop being such an Aggappera and just relax.","translation":"そんなアガッペラぶるのはやめて、リラックスしなよ。","type":"noun","meaning_category":"overly enthusiastic person"},{"sentence":"He's always acting like an Aggappera to get noticed.","translation":"彼はいつも注目されるためにアガッペラのように振る舞っている。","type":"noun","meaning_category":"attention seeker"}]}