{"word":"protoscientific","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"科学的であることの初期段階にある、または科学的であると主張するが、現代科学の基準を満たしていない","english_definition":"relating to an early stage of development of a science; claiming to be scientific but not meeting the standards of modern science.","examples":[{"sentence":"Alchemy can be considered a protoscientific endeavor that paved the way for modern chemistry.","translation":"錬金術は、現代化学への道を開いたプロト科学的な試みと見なすことができる。"},{"sentence":"Astrology, while claiming to predict the future, is often criticized as being protoscientific rather than truly scientific.","translation":"占星術は、未来を予測すると主張する一方で、真に科学的というよりはプロト科学的であると批判されることが多い。"},{"sentence":"Early attempts at classification of plants and animals were protoscientific, lacking the rigorous methodology of modern taxonomy.","translation":"動植物の初期の分類の試みは、現代の分類学の厳格な方法論を欠いており、プロト科学的であった。"}],"collocations":["protoscientific theories (プロト科学的な理論)","protoscientific practices (プロト科学的な実践)","protoscientific ideas (プロト科学的な考え)","protoscientific beliefs (プロト科学的な信念)","protoscientific approach (プロト科学的なアプローチ)"],"synonyms":["pre-scientific","early scientific","quasi-scientific","pseudo-scientific"],"antonyms":["scientific","established science","modern science"]}],"etymology":{"value":"\"proto-\" (初期の、原始的な) + \"scientific\" (科学的な) から構成される。科学の初期段階、または科学の基準を満たしていないが科学的であることを目指すものを指す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊtoʊsaɪənˈtɪfɪk/","syllables":"pro-to-sci-en-tif-ic"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"「**protoscientific**」は、ある分野が科学として確立される以前の段階、または科学的な方法論や証拠の基準を満たしていないものの、科学的であることを目指す試みを指す言葉です。完全に非科学的というわけではなく、科学的な探求の初期段階や、科学的な要素を含むものの、現代科学の基準には達していないものを指すニュアンスがあります。錬金術、占星術、初期の医学などがその例として挙げられます。疑似科学（pseudoscience）と似た意味合いで使われることもありますが、プロト科学はより中立的な意味合いを持ち、将来的に科学として発展する可能性を含むニュアンスがあります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The experiment was protoscientific and therefore completely useless.","correct":"✓ The experiment was protoscientific, meaning it lacked the rigor of modern scientific methodology, but it still provided valuable insights.","note":"プロト科学的であることは、完全に無価値であることを意味しません。初期段階の科学的探求であり、現代科学の基準を満たしていないということを意味します。"},{"incorrect":"✗ Protoscientific is the same as pseudoscience.","correct":"✓ Protoscientific is similar to pseudoscience, but it often refers to earlier stages of scientific development or ideas that contain some scientific elements but don't fully meet modern scientific standards.","note":"プロト科学と疑似科学は似ていますが、プロト科学はより中立的な意味合いを持ち、将来的に科学として発展する可能性を含むニュアンスがあります。疑似科学は、科学的であると偽って主張するものを指します。"}],"priority":"★★☆"},"related_words":{"derivatives":["protoscience (名詞: プロト科学)"],"related_terms":["pseudoscience (疑似科学)","pre-science (前科学)","early science (初期の科学)","scientific method (科学的方法)","empirical evidence (経験的証拠)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**protoscientific**」は、科学の初期段階や、科学的であると主張するものの現代科学の基準を満たしていないものを指す言葉です。錬金術や占星術のように、科学的な探求の初期段階であったり、科学的な要素を含むものの、厳密な方法論や証拠に基づかない分野を説明する際に使われます。疑似科学（pseudoscience）と似た意味合いで使われることもありますが、プロト科学はより中立的な意味合いを持ち、将来的に科学として発展する可能性を含むニュアンスがあります。科学史や科学哲学の文脈でよく使われる専門的な言葉です。"},"example_sentences":[{"sentence":"The ancient Greeks developed protoscientific theories about the nature of matter.","translation":"古代ギリシャ人は、物質の性質に関するプロト科学的な理論を展開した。","type":"adjective","meaning_category":"初期の科学的探求"},{"sentence":"Many protoscientific ideas from the past have been disproven by modern science.","translation":"過去の多くのプロト科学的な考えは、現代科学によって反証されている。","type":"adjective","meaning_category":"科学的基準を満たさない"},{"sentence":"Understanding protoscientific thought is crucial for tracing the development of modern scientific disciplines.","translation":"プロト科学的な思考を理解することは、現代の科学分野の発展を辿る上で重要である。","type":"adjective","meaning_category":"科学史における重要性"}]}