{"word":"mescalism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"メスカリン中毒、メスカリンによる酩酊状態","english_definition":"Intoxication caused by mescaline, a psychedelic drug found in certain cacti, especially peyote.","examples":[{"sentence":"The symptoms of mescalism can include hallucinations and altered perceptions of reality.","translation":"メスカリン中毒の症状には、幻覚や現実の認識の変化が含まれることがあります。"},{"sentence":"Some cultures use peyote in religious ceremonies, but the resulting mescalism is carefully controlled.","translation":"一部の文化では、宗教儀式でペヨーテを使用しますが、結果として生じるメスカリン中毒は慎重に管理されています。"}],"collocations":["experience mescalism (メスカリン中毒を経験する)","symptoms of mescalism (メスカリン中毒の症状)","effects of mescalism (メスカリン中毒の影響)","treat mescalism (メスカリン中毒を治療する)"],"synonyms":["peyotism","mescaline intoxication","hallucinogenic intoxication"],"antonyms":["sobriety","abstinence"]}],"etymology":{"value":"Derived from \"mescal,\" a term used for peyote and other cacti containing mescaline, combined with the suffix \"-ism,\" indicating a condition or state. \"Mescal\" comes from the Nahuatl word \"mexcalli,\" referring to agave plants.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɛskəlɪzəm/","syllables":"mes-cal-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"\"Mescalism\" specifically refers to the state of intoxication or altered perception caused by the ingestion of mescaline, typically from peyote or other mescaline-containing cacti. It is often associated with religious or spiritual ceremonies in certain cultures. The term is less commonly used in modern medical or scientific contexts, where \"mescaline intoxication\" might be preferred.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He suffered from alcoholism due to mescalism.","correct":"✓ He suffered from mescalism.","note":"\"Mescalism\" is the specific intoxication caused by mescaline, not a general form of alcoholism. Use \"alcoholism\" for alcohol addiction."},{"incorrect":"✗ Mescalism is a type of mental illness.","correct":"✓ Mescalism is a state of intoxication.","note":"Mescalism is a temporary state of intoxication, not a chronic mental illness, although prolonged or excessive use of mescaline can have psychological consequences."}],"priority":"★☆☆"},"related_words":{"derivatives":["mescal (noun: a type of agave-derived liquor, also a term for peyote cactus)","mescaline (noun: the psychoactive compound in peyote)","peyote (noun: a small, spineless cactus containing mescaline)"],"phrasal_verbs":null,"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Mescalism\" is a specialized term referring to the state of intoxication caused by mescaline, a psychoactive substance found in peyote and other cacti. It is typically used in anthropological, historical, or medical contexts when discussing the effects of mescaline or the cultural practices surrounding peyote use. Understanding this term requires familiarity with psychoactive substances and related cultural practices."},"example_sentences":[{"sentence":"The anthropologist studied the effects of mescalism on the participants in the peyote ceremony.","translation":"人類学者は、ペヨーテの儀式の参加者に対するメスカリン中毒の影響を研究しました。","type":"noun","meaning_category":"メスカリン中毒"},{"sentence":"Reports of mescalism often describe vivid hallucinations and altered perceptions of time and space.","translation":"メスカリン中毒の報告では、しばしば鮮やかな幻覚や時間と空間の認識の変化が記述されています。","type":"noun","meaning_category":"メスカリン中毒"}]}