{"word":"Claremont","priority":"★★☆","meanings":[{"part_of_speech":"proper noun","definition":"クレアモント (アメリカ合衆国カリフォルニア州にある都市)","english_definition":"A city in Los Angeles County, California, United States. It is located in the eastern part of the county, in the foothills of the San Gabriel Mountains. It is known for its seven colleges, collectively known as the Claremont Colleges.","examples":[{"sentence":"Claremont is home to the Claremont Colleges.","translation":"クレアモントはクレアモント・カレッジズの本拠地です。"},{"sentence":"I'm visiting Claremont next week to see the colleges.","translation":"来週、大学を見にクレアモントを訪れます。"}],"collocations":["Claremont Colleges","City of Claremont","Claremont Village"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name Claremont is derived from the French 'clair mont', meaning 'clear mountain' or 'bright mountain', referring to the view of the San Gabriel Mountains.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈklɛərˌmɒnt/","syllables":"Clare-mont"},"inflection":{},"usage_notes":{"explanation":"Claremont is primarily known as the location of the Claremont Colleges, a consortium of seven highly selective private institutions of higher education. The city has a reputation for being a well-educated and affluent community. It is located about 30 miles (48 km) east of downtown Los Angeles.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"related_places":["Pomona","Upland","La Verne","San Dimas"],"priority":"★★☆"},"level_frequency":{},"readability_explanation":{"level":"B1","text":"'Claremont' is the name of a city in California, USA. It's famous for having many colleges. If you hear someone talking about going to college in Claremont, they probably mean one of the Claremont Colleges.","priority":"★★☆"},"example_sentences":[{"sentence":"She's studying at one of the Claremont Colleges.","translation":"彼女はクレアモント・カレッジズのいずれかの大学で勉強しています。","type":"example","meaning_category":"location"},{"sentence":"Claremont is a beautiful city with a lot of trees.","translation":"クレアモントは木々が多く美しい街です。","type":"example","meaning_category":"description"}]}