{"word":"sublicensing","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"再許諾、サブライセンス","english_definition":"The act of granting a license to a third party to use intellectual property rights that one has already been licensed to use.","examples":[{"sentence":"The contract allows for sublicensing to other companies.","translation":"その契約は他の会社への再許諾を認めている。"},{"sentence":"Sublicensing can be a valuable way to expand market reach.","translation":"再許諾は市場へのリーチを拡大する上で貴重な手段となり得る。"},{"sentence":"We are considering sublicensing our technology to a foreign partner.","translation":"当社は外国のパートナーに当社の技術を再許諾することを検討している。"}],"collocations":["grant a sublicense","sublicense agreement","sublicense fee","exclusive sublicense","non-exclusive sublicense"],"synonyms":["relicensing","secondary licensing"],"antonyms":["direct licensing","original licensing"]},{"part_of_speech":"verb","definition":"再許諾する、サブライセンスを供与する","english_definition":"To grant a sublicense.","examples":[{"sentence":"We plan to sublicense our software to distributors in Europe.","translation":"当社はヨーロッパの販売業者に当社のソフトウェアを再許諾する予定です。"},{"sentence":"The company is authorized to sublicense the patent.","translation":"その会社は特許を再許諾する権限を与えられている。"}],"collocations":["sublicense a patent","sublicense software","sublicense technology"],"synonyms":["relicense"],"antonyms":["license directly"]}],"etymology":{"value":"The word 'sublicensing' is formed by combining the prefix 'sub-' (meaning under, below, or secondary) with the word 'licensing'. It indicates a license that is granted under an existing license.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsʌbˈlaɪsənsɪŋ/","syllables":"sub-li-cens-ing"},"inflection":{"noun_plural":"sublicensings","verb_forms":{"present_simple":["sublicense","sublicenses"],"past_simple":"sublicensed","past_participle":"sublicensed","present_participle":"sublicensing"}},"usage_notes":{"explanation":"'Sublicensing' refers to the process where a licensee (the party who has been granted a license to use intellectual property) grants a license to another party (the sublicensee). This is usually subject to the terms and conditions of the original license agreement. It's a common practice in industries such as software, pharmaceuticals, and entertainment.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sublicensing was granted to them.","correct":"✓ A sublicense was granted to them.","note":"'Sublicensing' is the act or process. 'A sublicense' is the actual license document or agreement."},{"incorrect":"✗ They sublicensed the patent without permission, it's illegal.","correct":"✓ They sublicensed the patent without permission; it's illegal.","note":"Use a semicolon to connect two independent clauses when they are closely related. Alternatively, separate them into two sentences."}],"priority":"★★☆"},"related_words":{"derivatives":["sublicensee (noun: the party receiving the sublicense)","sublicensor (noun: the party granting the sublicense)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'sublicensing' is a legal and business term referring to the practice of granting a license to a third party to use intellectual property rights that one has already been licensed to use. Understanding this term requires familiarity with intellectual property law and licensing agreements. It is commonly used in legal and business contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"Our company earns revenue through both direct licensing and **sublicensing** agreements.","translation":"当社は直接ライセンス契約と再許諾契約の両方を通じて収益を上げています。","type":"noun","meaning_category":"再許諾"},{"sentence":"The software developer decided to **sublicense** its technology to a larger corporation for wider distribution.","translation":"そのソフトウェア開発者は、より広範な流通のために、その技術をより大規模な企業に再許諾することを決定した。","type":"verb","meaning_category":"再許諾する"},{"sentence":"The terms of the original license agreement strictly regulate the conditions under which **sublicensing** is permitted.","translation":"元のライセンス契約の条項は、再許諾が許可される条件を厳格に規制している。","type":"noun","meaning_category":"再許諾"}]}