{"word":"bushman","priority":"低","meanings":[{"part_of_speech":"noun","definition":"ブッシュマン、サン族 (アフリカ南部に住む狩猟採集民)","english_definition":"A member of any of the indigenous peoples inhabiting Southern Africa, especially the Kalahari Desert; a San person.","examples":[{"sentence":"The Bushmen are known for their tracking skills.","translation":"ブッシュマンは追跡技術で知られている。"},{"sentence":"Many Bushmen now live in settled communities.","translation":"多くのブッシュマンは現在、定住コミュニティで暮らしている。"}],"collocations":["San people","Kalahari Bushmen","traditional Bushman culture"],"synonyms":["San","Basarwa"],"antonyms":[],"cultural_note":"The term 'Bushman' is sometimes considered outdated or even offensive by some, with 'San' being the preferred term. However, it is still used in some contexts."},{"part_of_speech":"noun","definition":"(オーストラリア英語、古語) 奥地に住む人、未開拓地に住む人","english_definition":"(Australian English, dated) A person who lives in the bush; an inhabitant of the outback.","examples":[{"sentence":"The old bushman knew the land like the back of his hand.","translation":"その老いたブッシュマンは、手のひらを見るようにその土地を知っていた。"},{"sentence":"Bushmen were often skilled in survival and navigation.","translation":"ブッシュマンはしばしば、サバイバルとナビゲーションに長けていた。"}],"collocations":["Australian bush","outback life","survival skills"],"synonyms":["outback dweller","backwoodsman"],"antonyms":["city dweller","urbanite"]}],"etymology":{"value":"'Bushman' is a compound of 'bush' (referring to wild or uncultivated land) and 'man'. For the San people, it reflects their traditional lifestyle in the bush. In Australian English, it similarly refers to someone living in the outback.","priority":"中"},"pronunciation":{"ipa":"/ˈbʊʃmən/","syllables":"bush-man"},"inflection":{"noun_plural":"bushmen"},"usage_notes":{"explanation":"The term 'bushman' has two primary meanings, one referring to the San people of Southern Africa and the other (mainly in Australian English) to people living in the outback. The term's use for the San is sometimes considered insensitive.","priority":"高"},"common_mistakes":{"examples":[{"incorrect":"The Bushman built a house in the city.","correct":"The Bushman lived in the Kalahari Desert.","note":"Bushmen traditionally live in the bush or desert, not cities."}],"priority":"中"},"related_words":{"derivatives":[],"related_terms":["bush","outback","San","Kalahari"],"priority":"中"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"低","priority":"低"},"readability_explanation":{"level":"B2","text":"The word 'bushman' can refer to two different groups of people: the San people of Southern Africa or people living in the Australian outback. Be aware that the term can be considered outdated or offensive when referring to the San. The Australian usage is less sensitive but still somewhat dated."},"example_sentences":[{"sentence":"The Bushmen of the Kalahari have a rich cultural heritage.","translation":"カラハリのブッシュマンは豊かな文化遺産を持っている。","type":"noun","meaning_category":"San people"},{"sentence":"The Australian bushman was skilled at tracking animals.","translation":"オーストラリアのブッシュマンは動物の追跡に長けていた。","type":"noun","meaning_category":"Outback dweller"}]}