{"word":"garnisheeing","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(賃金などを)差し押さえること (garnisheeの現在分詞)","english_definition":"Present participle of garnishee: To legally take part of a person's salary or property to pay a debt.","examples":[{"sentence":"The court ordered garnisheeing his wages to pay off the debt.","translation":"裁判所は、借金を返済するために彼の賃金を差し押さえるよう命じた。"}],"collocations":["wage garnisheeing","bank account garnisheeing"],"synonyms":["attaching","seizing","confiscating"],"antonyms":["releasing","returning"]},{"part_of_speech":"noun","definition":"(法律) 差し押さえ手続き","english_definition":"The legal process of garnisheeing.","examples":[{"sentence":"Garnisheeing is a legal process that allows creditors to collect debts.","translation":"差し押さえ手続きは、債権者が債務を回収することを可能にする法的手続きである。"}],"collocations":["wage garnisheeing process","court-ordered garnisheeing"],"synonyms":["attachment","seizure","confiscation"],"antonyms":["release","return"]}],"etymology":{"value":"The word 'garnishee' comes from Old French 'garnir', meaning 'to warn, equip, fortify'. It entered English law to describe the process of warning a third party holding assets of a debtor to hold those assets for the creditor.","priority":"★★★"},"pronunciation":{"ipa":"ˌɡɑːrnɪˈʃiːɪŋ","syllables":"gar-ni-shee-ing"},"inflection":{"verb_forms":{"present_simple":["garnisheeing"],"past_simple":["garnisheed"],"past_participle":["garnisheed"],"present_participle":["garnisheeing"]},"noun_plural":[]},"usage_notes":{"explanation":"'Garnisheeing' is primarily used in legal contexts to describe the process of legally seizing assets, typically wages or bank accounts, to satisfy a debt. It's important to note that the term refers to the ongoing process, while 'garnishment' often refers to the legal order or the amount garnished.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is garnisheeing to pay his debts.","correct":"✓ His wages are being garnisheed to pay his debts.","note":"'Garnisheeing' is the process, not something a person does directly. The correct usage involves the wages or assets 'being garnisheed'."}],"priority":"★★☆"},"related_words":{"derivatives":["garnishee (noun: the person or entity whose assets are being seized; verb: to seize assets)","garnishment (noun: the legal order to seize assets; the amount seized)","garnisher (noun: the creditor who initiates the garnisheeing process)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Garnisheeing' is a legal term referring to the process of legally seizing assets to satisfy a debt. It is typically encountered in legal documents or discussions related to debt collection and court orders. Understanding this term requires familiarity with legal and financial concepts."},"example_sentences":[{"sentence":"The company is garnisheeing his wages due to unpaid taxes.","translation":"その会社は未払いの税金のために彼の賃金を差し押さえている。","type":"verb","meaning_category":"差し押さえること"},{"sentence":"Garnisheeing can have a significant impact on an individual's financial stability.","translation":"差し押さえ手続きは個人の経済的安定に大きな影響を与える可能性がある。","type":"noun","meaning_category":"差し押さえ手続き"}]}