{"word":"plagiarists","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"剽窃者、盗用者","english_definition":"people who take the work or ideas of someone else and pass them off as their own.","examples":[{"sentence":"The professor caught several plagiarists in his class.","translation":"教授は授業で数人の剽窃者を捕まえた。"},{"sentence":"Plagiarists often face severe consequences.","translation":"剽窃者はしばしば厳しい結果に直面する。"}],"collocations":["catch plagiarists (剽窃者を捕まえる)","identify plagiarists (剽窃者を特定する)","punish plagiarists (剽窃者を罰する)"],"synonyms":["copycats","imitators","thieves","frauds"],"antonyms":["originators","creators","authors"]}],"etymology":{"value":"The word \"plagiarist\" comes from the Latin word \"plagiarius,\" meaning \"kidnapper\" or \"plunderer.\" This is because plagiarists steal the work of others, much like a kidnapper steals a person.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpleɪdʒərɪsts/","syllables":"pla-gia-rists"},"inflection":{"noun_singular":"plagiarist","noun_plural":"plagiarists"},"usage_notes":{"explanation":"\"Plagiarists\" refers to multiple individuals who engage in plagiarism. Plagiarism is the act of presenting someone else's work or ideas as your own, with or without their consent, by incorporating it into your work without full acknowledgement. All published and unpublished material, whether in manuscript, printed or electronic form, is covered under this definition.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a plagiarist, so he plagiarisms.","correct":"✓ He is a plagiarist, so he plagiarizes.","note":"The verb form is 'plagiarize,' not 'plagiarisms'."},{"incorrect":"✗ The plagiarists was caught.","correct":"✓ The plagiarists were caught.","note":"'Plagiarists' is plural, so it takes the plural verb 'were'."}],"priority":"★★☆"},"related_words":{"derivatives":["plagiarism (noun: 剽窃)","plagiarize (verb: 剽窃する)","plagiaristic (adjective: 剽窃的な)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"plagiarists\" refers to individuals who commit plagiarism, which is the act of taking someone else's work or ideas and passing them off as one's own. This term is typically used in academic, journalistic, or creative contexts where originality and intellectual property are highly valued. Understanding this word requires a grasp of ethical principles related to authorship and intellectual honesty.","priority":"★★☆"},"example_sentences":[{"sentence":"The university expelled several students who were identified as plagiarists.","translation":"大学は剽窃者として特定された数名の学生を退学処分にした。","type":"general","meaning_category":"剽窃者"},{"sentence":"The article exposed the plagiarists who had been stealing content from smaller blogs.","translation":"その記事は、小規模なブログからコンテンツを盗んでいた剽窃者たちを暴露した。","type":"general","meaning_category":"剽窃者"},{"sentence":"Detecting plagiarists is a growing concern in the digital age.","translation":"デジタル時代において、剽窃者を検出することはますます懸念事項となっている。","type":"general","meaning_category":"剽窃者"}]}