{"word":"Sepulveda","priority":"☆☆☆","meanings":[{"part_of_speech":"proper noun","definition":"A surname of Spanish origin.","english_definition":"A Spanish surname.","examples":[{"sentence":"Mr. Sepulveda is a well-respected member of the community.","translation":"セプルベダさんは地域社会で尊敬されている人物です。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"proper noun","definition":"A place name, often referring to locations in California, USA.","english_definition":"A place name, often referring to locations in California, USA.","examples":[{"sentence":"We drove down Sepulveda Boulevard.","translation":"私たちはセプルベダ通りを車で走った。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The surname Sepulveda is of Spanish origin, derived from the place name Sepúlveda, a town in the province of Segovia, Spain. The name Sepúlveda itself comes from the Latin word 'sepultus,' meaning 'buried,' referring to ancient burial grounds or tombs.","priority":"★★☆"},"pronunciation":{"ipa":"/səˈpʌlvɪdə/","syllables":"Se-pul-ve-da"},"inflection":{},"usage_notes":{"explanation":"'Sepulveda' is most commonly encountered as a surname, particularly within communities of Spanish or Latin American descent. It is also a place name, most notably associated with Sepulveda Boulevard in Los Angeles, California. When used as a place name, it typically refers to locations within Southern California that are named after the Sepulveda family, who were prominent landowners in the region during the Spanish and Mexican periods.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"related_names":["Sepúlveda"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency as a general word, but common in specific regions (e.g., Southern California).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sepulveda' is primarily a proper noun, functioning as a surname and a place name. Its usage is largely confined to contexts involving individuals with that surname or locations named Sepulveda, particularly in Southern California. Understanding its significance requires familiarity with Spanish naming conventions and the history of California. Due to its specificity, it is not a word commonly encountered in general English conversation or writing."},"example_sentences":[{"sentence":"The Sepulveda family has a long history in California.","translation":"セプルベダ家はカリフォルニアに長い歴史を持っている。","type":"proper noun","meaning_category":"surname"},{"sentence":"Traffic on Sepulveda Boulevard can be very heavy during rush hour.","translation":"ラッシュアワー時のセプルベダ通りの交通量は非常に多いことがある。","type":"proper noun","meaning_category":"place name"}]}