{"word":"ungeoreferencing","priority":"low","meanings":[{"part_of_speech":"verb","definition":"(地図、画像などを)地理情報を持たない状態に戻す、地理座標情報を除去する","english_definition":"To remove geographic coordinates or spatial reference information from a map, image, or other spatial data; to reverse the process of georeferencing.","examples":[{"sentence":"The scanned map was first georeferenced, and then ungeoreferenced to remove any location data before being shared online.","translation":"スキャンされた地図は、最初にジオリファレンスされ、その後、オンラインで共有する前に位置情報を削除するためにアンジオリファレンスされました。"},{"sentence":"We need to ungeoreference these aerial photos to protect the privacy of the landowners.","translation":"地権者のプライバシーを保護するために、これらの航空写真をアンジオリファレンスする必要があります。"}],"collocations":["ungeoreference a map","ungeoreference an image","ungeoreference spatial data"],"synonyms":["remove georeference","strip geodata","de-georeference"],"antonyms":["georeference"],"related_terms":["georeferencing","spatial data","geographic coordinates","GIS (Geographic Information System)"],"usage_notes":{"explanation":"Ungeoreferencing is the opposite of georeferencing. It involves removing the spatial reference information that links a digital map or image to real-world coordinates. This might be done for privacy reasons, to reduce file size, or to prevent unauthorized use of the data's location information.","priority":"medium"}}],"etymology":{"value":"The word is formed by adding the prefix 'un-' (meaning 'not' or 'reverse') to 'georeferencing'.","priority":"low"},"pronunciation":{"ipa":"/ˌʌnˌdʒiːoʊˈrɛfərənsɪŋ/","syllables":"un-ge-o-ref-er-enc-ing"},"inflection":{"verb_forms":{"present_simple":["ungeoreference","ungeoreferences"],"past_simple":"ungeoreferenced","past_participle":"ungeoreferenced","present_participle":"ungeoreferencing"}},"level_frequency":{"frequency_google_ngram":"Very low frequency - Primarily used within the GIS and mapping fields.","priority":"low"},"readability_explanation":{"level":"C1","text":"'Ungeoreferencing' is a technical term used in the field of Geographic Information Systems (GIS) and mapping. It refers to the process of removing the geographic location information from a digital map or image. This is the opposite of 'georeferencing,' which adds location data. The term is not commonly used outside of these specialized fields."},"example_sentences":[{"sentence":"The software allows you to easily georeference and then ungeoreference images.","translation":"そのソフトウェアを使用すると、画像を簡単にジオリファレンスしてからアンジオリファレンスできます。","type":"general"},{"sentence":"Ungeoreferencing the dataset reduced its file size significantly.","translation":"データセットをアンジオリファレンスすると、ファイルサイズが大幅に縮小されました。","type":"technical"}]}