{"word":"reconfront","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"再び直面する、再対決する","english_definition":"To confront again; to face or deal with (someone or something) a second or subsequent time.","examples":[{"sentence":"After some time apart, they had to reconfront their differences.","translation":"しばらく離れていた後、彼らは再び自分たちの違いに直面しなければならなかった。"},{"sentence":"The company had to reconfront the same environmental issues it thought it had resolved.","translation":"その会社は、解決したと思っていたのと同じ環境問題に再び直面しなければならなかった。"}],"collocations":["reconfront a problem","reconfront a person","reconfront a situation"],"synonyms":["re-encounter","readdress","revisit"],"antonyms":["avoid","ignore","evade"]}],"etymology":{"value":"The word \"reconfront\" is formed by adding the prefix \"re-\" (meaning again or anew) to the word \"confront.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːkənˈfrʌnt/","syllables":"re-con-front"},"inflection":{"verb_forms":{"present_simple":["reconfront","reconfronts"],"past_simple":"reconfronted","past_participle":"reconfronted","present_participle":"reconfronting"}},"usage_notes":{"explanation":"\"Reconfront\" implies a previous confrontation or encounter that was either unresolved or requires further attention. It suggests a deliberate act of facing something again, often with the implication of difficulty or challenge.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I will reconfront him tomorrow about the issue.","correct":"✓ I will reconfront him about the issue tomorrow.","note":"The adverb of time (tomorrow) usually comes at the end of the sentence or clause."}],"priority":"★★☆"},"related_words":{"derivatives":["confront","confrontation","re-","-ation"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"reconfront\" is a relatively uncommon verb that means to face or deal with something again, usually after a previous encounter or attempt to resolve it. It implies a deliberate and often challenging act of addressing something that has resurfaced or requires further attention.","priority":"★★☆"},"example_sentences":[{"sentence":"The negotiators had to reconfront the same sticking points in the agreement.","translation":"交渉担当者たちは、合意における同じ難点に再び直面しなければならなかった。","type":"verb","meaning_category":"再び直面する"},{"sentence":"After therapy, she felt ready to reconfront her past traumas.","translation":"セラピーの後、彼女は過去のトラウマに再び向き合う準備ができたと感じた。","type":"verb","meaning_category":"再び直面する"}]}