{"word":"smileage","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主にアメリカ英語の俗語) 飛行機のマイレージプログラムで得られる特典航空券やアップグレード券などと引き換えられるポイントを、サービスや親切な行為によって得られる見返りの比喩として使う言葉。特に、顧客サービスや従業員のモチベーション向上策に関連して使われる。","english_definition":"(chiefly US, informal) A notional reward or benefit gained from providing good service or performing acts of kindness, analogous to frequent flyer miles. Often used in the context of customer service or employee motivation programs.","examples":[{"sentence":"The company implemented a 'smileage' program to encourage employees to provide excellent customer service.","translation":"その会社は、従業員が優れた顧客サービスを提供するよう促すために「スマイレージ」プログラムを導入した。"},{"sentence":"He earned a lot of 'smileage' by always going the extra mile for his clients.","translation":"彼は顧客のために常に期待以上のことをすることで、多くの「スマイレージ」を獲得した。"},{"sentence":"The company's 'smileage' initiative rewards employees for positive interactions with customers.","translation":"その会社の「スマイレージ」イニシアチブは、顧客との肯定的なやり取りに対して従業員に報酬を与える。"}],"collocations":["earn smileage","accumulate smileage","collect smileage","give smileage","smileage program","smileage initiative"],"synonyms":["goodwill","kudos","credit","brownie points"],"antonyms":["disfavor","displeasure","ill will"]}],"etymology":{"value":"'Smile' (笑顔) と 'mileage' (マイレージ) のかばん語。航空会社のマイレージプログラムで飛行距離に応じて特典が得られるシステムを、笑顔や親切な行為に対する見返りに見立てた造語。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsmaɪlɪdʒ/","syllables":"smi-le-age"},"inflection":{"noun_plural":"smileages"},"usage_notes":{"explanation":"'Smileage' はインフォーマルな言葉で、ビジネスやマーケティングの文脈で、顧客満足度や従業員のモチベーション向上策をユーモラスに表現する際に使われることが多い。文字通りの意味ではなく、比喩的な意味合いで使用される点に注意。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He drove a lot of smileage this year.","correct":"✓ He earned a lot of smileage this year by providing excellent service.","note":"'Smileage' は物理的な距離を表すものではないため、'drive' と組み合わせて使うのは不適切。サービスや親切な行為によって得られる見返りを表す場合に使う。"},{"incorrect":"✗ The company pays smileage to its customers.","correct":"✓ The company rewards customers with discounts for their loyalty.","note":"'Smileage' は顧客に直接支払われるものではない。ロイヤリティプログラムやポイントシステムなど、間接的な報酬を指す場合に使う。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["customer loyalty program","employee motivation","incentive program","reward system","customer satisfaction","service excellence"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (俗語のため)","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Smileage' は、主にアメリカ英語のインフォーマルな単語で、ビジネスやマーケティングの分野で、顧客サービスや従業員のモチベーション向上策を比喩的に表現する際に使われます。航空会社のマイレージプログラムを連想させ、笑顔や親切な行為がポイントのように蓄積され、何らかの報酬につながるというイメージを伝えるために用いられます。日常会話で使われることは少なく、専門的な文脈でのみ理解されることが多いでしょう。"},"example_sentences":[{"sentence":"The new 'smileage' program aims to boost employee morale and improve customer relations.","translation":"新しい「スマイレージ」プログラムは、従業員の士気を高め、顧客との関係を改善することを目的としている。","type":"general","meaning_category":"プログラム"},{"sentence":"By consistently providing excellent service, the staff accumulated a lot of 'smileage' with their regular customers.","translation":"常に優れたサービスを提供することで、スタッフは常連客から多くの「スマイレージ」を得た。","type":"general","meaning_category":"顧客サービス"}]}