{"word":"incubations","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(卵・細菌などの)培養、抱卵、温伏","english_definition":"The process of incubating; the act of sitting on eggs to hatch them; the maintenance of controlled environmental conditions for the purpose of hatching eggs, growing microorganisms, or promoting a chemical reaction.","examples":[{"sentence":"The incubations of the eggs took about 21 days.","translation":"その卵の培養には約21日かかった。"},{"sentence":"The laboratory is equipped for incubations of bacterial cultures.","translation":"その研究室は細菌培養のための設備が整っている。"},{"sentence":"The hen's incubations were successful, and all the chicks hatched.","translation":"その雌鶏の抱卵は成功し、すべての雛が孵化した。"}],"collocations":["egg incubations (卵の培養)","bacterial incubations (細菌培養)","successful incubations (成功した培養)","short incubations (短い培養期間)","long incubations (長い培養期間)"],"synonyms":["hatching","breeding","culturing","germination"],"antonyms":[]}],"etymology":{"value":"The word 'incubations' is the plural form of 'incubation,' which comes from the Latin word 'incubare,' meaning 'to lie on, hatch.' This is formed from 'in-' (upon) + 'cubare' (to lie down).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪŋkjuˈbeɪʃənz/","syllables":"in-cu-ba-tions"},"inflection":{"noun_plural":"incubations"},"usage_notes":{"explanation":"'Incubations' refers to multiple instances or processes of incubation. It is used when discussing several separate acts of incubating eggs, bacterial cultures, or other items requiring controlled environmental conditions. The singular form, 'incubation,' refers to the general process or a single instance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The incubation were performed at 37 degrees Celsius.","correct":"✓ The incubations were performed at 37 degrees Celsius.","note":"When referring to multiple instances of incubation, use the plural form 'incubations' with a plural verb ('were')."},{"incorrect":"✗ The incubations period was too short.","correct":"✓ The incubation period was too short.","note":"When referring to the duration of a single incubation process, use the singular form 'incubation' with 'period.'"}],"priority":"★★☆"},"related_words":{"derivatives":["incubate (verb: to keep eggs, cells, bacteria, etc. at a suitable temperature so that they develop)","incubator (noun: an apparatus used to control the environmental conditions for growing or hatching)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'incubations' is a technical term primarily used in scientific or agricultural contexts. It refers to multiple instances of keeping eggs, cells, or microorganisms under controlled conditions to allow them to develop. Understanding this word requires familiarity with biological or agricultural processes. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The laboratory conducted several incubations to study the growth of different bacterial strains.","translation":"その研究室では、さまざまな細菌株の成長を研究するために、いくつかの培養を行った。","type":"general","meaning_category":"培養"},{"sentence":"The farmer carefully monitored the incubations of the chicken eggs.","translation":"農家は鶏卵の培養を注意深く監視した。","type":"agricultural","meaning_category":"抱卵"},{"sentence":"The incubations were carried out in a temperature-controlled environment.","translation":"培養は温度管理された環境で行われた。","type":"scientific","meaning_category":"培養"}]}