{"word":"Moonworts","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ハナヤスリ属の植物","english_definition":"A genus of ferns, *Botrychium*, characterized by a single, fleshy leaf divided into a sterile, photosynthetic segment and a fertile, spore-bearing segment.","examples":[{"sentence":"Moonworts are known for their unique leaf structure.","translation":"ハナヤスリ属の植物は、その独特な葉の構造で知られています。"},{"sentence":"Some species of moonworts are rare and protected.","translation":"ハナヤスリ属の一部の種は希少で保護されています。"}],"collocations":["rare moonworts","common moonworts","moonworts habitat"],"synonyms":["Botrychium","fern"],"antonyms":[]}],"etymology":{"value":"'Moon' refers to the crescent shape of the leaf segments in some species, and 'wort' is an old English word for plant.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmuːnwɔːrts/","syllables":"moon-worts"},"inflection":{"noun_plural":"moonworts"},"usage_notes":{"explanation":"'Moonworts' refers to plants in the genus *Botrychium*. They are ferns, but they don't look like typical ferns. They have a single leaf divided into two parts: one part looks like a normal leaf, and the other part has the spores.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a moonwort in the garden, it had flowers.","correct":"✓ I saw a moonwort in the garden, it had spores.","note":"Moonworts are ferns and reproduce via spores, not flowers."}],"priority":"★★☆"},"related_words":{"derivatives":["moonwort"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Moonworts' is a specialized term referring to a genus of ferns (*Botrychium*). Understanding requires some botanical knowledge. The word itself is not commonly used outside of botanical contexts."},"example_sentences":[{"sentence":"The elusive moonworts are often found in undisturbed meadows.","translation":"とらえどころのないハナヤスリ属の植物は、手つかずの牧草地によく見られます。","type":"noun","meaning_category":"plants"}]}