{"word":"sheath-winged","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"鞘翅(しょうし)のある、鞘翅目の","english_definition":"Having elytra; belonging to the order Coleoptera (beetles).","examples":[{"sentence":"Sheath-winged insects are commonly called beetles.","translation":"鞘翅目の昆虫は一般的にカブトムシと呼ばれます。"},{"sentence":"The sheath-winged order is one of the most diverse in the animal kingdom.","translation":"鞘翅目は動物界で最も多様な目の一つです。"}],"collocations":["sheath-winged insect","sheath-winged beetle","sheath-winged order"],"synonyms":["coleopterous"],"antonyms":[]}],"etymology":{"value":"From \"sheath\" (referring to the protective covering of the wings) + \"winged\".","priority":"medium"},"pronunciation":{"ipa":"/ˈʃiːθˌwɪŋd/","syllables":"sheath-winged"},"inflection":{"notes":"This is an adjective and does not have different forms."},"usage_notes":{"explanation":"The term 'sheath-winged' is primarily used in scientific or technical contexts when discussing insects, specifically beetles, and their classification. It highlights a key characteristic of beetles: their hardened forewings (elytra) that act as protective sheaths for their hindwings.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"Sheath-winged animals are only insects.","correct":"Sheath-winged animals are a type of insect.","note":"Sheath-winged refers specifically to a type of insect, not all animals."}],"priority":"low"},"related_words":{"derivatives":["elytron (singular of elytra)","Coleoptera"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"low"},"readability_explanation":{"level":"C1","text":"The term 'sheath-winged' is a technical term used in entomology (the study of insects). It describes insects that belong to the order Coleoptera, which are commonly known as beetles. The term refers to the hardened forewings (elytra) that cover and protect the delicate hindwings used for flying. Understanding this term requires some familiarity with insect anatomy and classification. It is not a commonly used term in everyday language."},"example_sentences":[{"sentence":"The scientist studied the anatomical features of the sheath-winged insect.","translation":"科学者は鞘翅目の昆虫の解剖学的特徴を研究しました。","type":"general","meaning_category":"description"},{"sentence":"The diversity of sheath-winged beetles is astonishing.","translation":"鞘翅目のカブトムシの多様性は驚くべきものです。","type":"general","meaning_category":"description"}]}