{"word":"Rodham","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"A surname, notably associated with Hillary Rodham Clinton.","english_definition":"A surname, most notably associated with Hillary Rodham Clinton, former First Lady of the United States, U.S. Senator, and Secretary of State.","examples":[{"sentence":"Hillary Rodham Clinton is a prominent figure in American politics.","translation":"ヒラリー・ロダム・クリントンはアメリカ政治における著名な人物です。"},{"sentence":"The Rodham family has a long history in Illinois.","translation":"ロダム家はイリノイ州に長い歴史を持っています。"}],"collocations":["Hillary Rodham Clinton","the Rodham family"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The etymology of the surname Rodham is likely of English origin, possibly derived from a place name or a combination of elements. Further research would be needed to determine the precise origin.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrɒdhəm/","syllables":"Rod-ham"},"inflection":{"notes":"Proper noun; no plural form."},"usage_notes":{"explanation":"The name Rodham is primarily known as the maiden name of Hillary Rodham Clinton. It is often used in conjunction with her married name, Clinton, particularly when referring to her in a formal or historical context.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_names":["Clinton"],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency, primarily associated with mentions of Hillary Rodham Clinton.","priority":"★☆☆"},"readability_explanation":{"level":"N/A","text":"The word 'Rodham' is a proper noun (surname), and its readability is not typically assessed using standard readability metrics. Its understanding depends on familiarity with the name and its association with Hillary Rodham Clinton."},"example_sentences":[{"sentence":"The biography detailed Hillary Rodham's early life and education.","translation":"その伝記はヒラリー・ロダムの幼少期と教育について詳しく述べていた。","type":"noun","meaning_category":"surname"},{"sentence":"The Rodham Institute focuses on health policy research.","translation":"ロダム研究所は、医療政策の研究に焦点を当てています。","type":"noun","meaning_category":"surname"}]}