{"word":"torpidity","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"鈍さ、不活発、無気力、休眠状態","english_definition":"the state of being inactive, sluggish, or dormant; lethargy; dormancy.","examples":[{"sentence":"The torpidity of the economy worried many investors.","translation":"経済の不活発さは多くの投資家を悩ませた。"},{"sentence":"During winter, the bear falls into a state of torpidity.","translation":"冬の間、熊は休眠状態になる。"},{"sentence":"He struggled to overcome the torpidity that followed his illness.","translation":"彼は病後の無気力状態を克服しようと苦労した。"}],"collocations":["economic torpidity (経済の不活発)","winter torpidity (冬眠)","mental torpidity (精神的な鈍さ)","overcome torpidity (不活発さを克服する)"],"synonyms":["lethargy","sluggishness","inactivity","dormancy","apathy","inertia","stupor","listlessness"],"antonyms":["activity","vigor","energy","animation","liveliness"]}],"etymology":{"value":"Late Middle English: from late Latin torpiditas, from torpidus (see torpid).","priority":"★★☆"},"pronunciation":{"ipa":"/tɔːrˈpɪdɪti/","syllables":"tor-pid-i-ty","audio_url":null},"inflection":{"notes":"Noun, uncountable"},"usage_notes":{"explanation":"'Torpidity' refers to a state of reduced physical or mental activity. It can describe a temporary state, such as hibernation in animals, or a more persistent condition, such as economic stagnation or a person's lack of motivation. It often implies a lack of energy or enthusiasm.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The torpidity of the city was exciting.","correct":"✓ The torpidity of the city was depressing.","note":"'Torpidity' describes a state of inactivity or sluggishness, which is generally considered negative. Describing it as 'exciting' would be contradictory."},{"incorrect":"✗ He injected torpidity into the project.","correct":"✓ He injected enthusiasm into the project. / ✓ The project suffered from torpidity.","note":"'Torpidity' is a state, not something that can be injected. To indicate a lack of energy in a project, you would say it 'suffered from torpidity' or that someone injected its opposite, such as 'enthusiasm'."}],"priority":"★☆☆"},"related_words":{"derivatives":["torpid (adjective)","torpidly (adverb)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Torpidity' is a formal word that describes a state of inactivity, sluggishness, or dormancy. It is not commonly used in everyday conversation but may appear in academic or literary contexts when discussing topics such as economics, biology, or psychology. Understanding this word can help you comprehend complex texts and express nuanced ideas about states of reduced activity or energy."},"example_sentences":[{"sentence":"The long winter months brought a sense of torpidity to the small town.","translation":"長い冬の月日は、その小さな町に倦怠感をもたらした。","type":"general","meaning_category":"鈍さ、不活発"},{"sentence":"The patient's torpidity was a cause for concern among the medical staff.","translation":"患者の無気力さは、医療スタッフの間で懸念の原因となった。","type":"medical","meaning_category":"無気力"},{"sentence":"Economic torpidity can lead to widespread unemployment and social unrest.","translation":"経済の不活発は、広範囲にわたる失業と社会不安につながる可能性がある。","type":"economic","meaning_category":"不活発"}]}