{"word":"Piebaldism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"白斑症（はくはんしょう）：先天的にメラノサイト（色素細胞）が欠如している状態。通常、額、髪の毛、皮膚に特徴的な白い部分が現れる。","english_definition":"A rare genetic disorder characterized by the absence of melanocytes (pigment cells) in certain areas of the skin and hair, typically resulting in patches of white skin and hair, especially on the forehead.","examples":[{"sentence":"Piebaldism is usually noticeable at birth due to the distinct white patches on the skin.","translation":"白斑症は通常、皮膚の明瞭な白い斑点によって出生時に気づかれます。"},{"sentence":"The white forelock is a common characteristic of piebaldism.","translation":"白い前髪は白斑症の一般的な特徴です。"},{"sentence":"Piebaldism is caused by mutations in the KIT gene.","translation":"白斑症はKIT遺伝子の変異によって引き起こされます。"}],"collocations":["white forelock (白い前髪)","KIT gene (KIT遺伝子)","melanocytes (メラノサイト、色素細胞)","congenital condition (先天性疾患)","genetic disorder (遺伝性疾患)"],"synonyms":["partial albinism","leukoderma congenitum"],"antonyms":["hyperpigmentation (色素沈着過剰)"]}],"etymology":{"value":"\"Piebald\"（まだら模様の、白黒の）+ \"-ism\"（状態、性質を示す接尾辞）。\"Piebald\"は、カササギ（pie）のような白黒のまだら模様を指す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpaɪˌbɔːldɪzəm/","syllables":"pie-bald-ism"},"inflection":{"notes":"不可算名詞 (uncountable noun)"},"usage_notes":{"explanation":"Piebaldism is a rare genetic condition, distinct from vitiligo, which is an acquired loss of pigmentation. Piebaldism is present from birth, while vitiligo typically develops later in life. The condition is caused by mutations in genes that affect the development and migration of melanocytes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Piebaldism is contagious.","correct":"✓ Piebaldism is a genetic condition.","note":"Piebaldism is a genetic disorder and is not contagious. It cannot be spread from person to person. "},{"incorrect":"✗ Piebaldism is the same as albinism.","correct":"✓ Piebaldism is a form of partial albinism, but not the same as full albinism.","note":"Piebaldism is characterized by localized areas of missing pigment, while albinism involves a complete or near-complete lack of pigment throughout the body."}],"priority":"★★☆"},"related_words":{"derivatives":["piebald (形容詞: まだらの、白黒の)","piebaldish (形容詞: ややまだらの)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Piebaldism\" is a technical term referring to a rare genetic condition where someone has patches of skin and hair that lack pigment, resulting in white areas. It's present from birth and is different from other conditions that cause loss of pigment later in life. The term is primarily used in medical or scientific contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"Genetic testing can confirm a diagnosis of piebaldism.","translation":"遺伝子検査は白斑症の診断を確定することができます。","type":"general","meaning_category":"diagnosis"},{"sentence":"The individual with piebaldism had a distinctive white streak in their hair.","translation":"白斑症の人は、髪に特徴的な白い筋があった。","type":"general","meaning_category":"characteristics"},{"sentence":"Research is ongoing to understand the genetic basis of piebaldism.","translation":"白斑症の遺伝的基盤を理解するための研究が進行中です。","type":"research","meaning_category":"genetics"}]}