{"word":"Refusnik","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(ソ連において)出国を拒否されたユダヤ人","english_definition":"a Jew in the former Soviet Union who was refused permission to emigrate.","examples":[{"sentence":"Many Refusniks faced discrimination and hardship.","translation":"多くの出国拒否者は差別と苦難に直面した。"},{"sentence":"The Refusnik movement sought to raise awareness of their plight.","translation":"出国拒否者運動は、彼らの苦境に対する意識を高めようとした。"}],"collocations":["Soviet Refusnik","Jewish Refusnik"],"synonyms":["Denied Emigrant"],"antonyms":["Emigrant","Immigrant"]}],"etymology":{"value":"The term \"Refusnik\" comes from the Russian word \"otkaznik\" (отказник), which literally means \"rejectee\" or \"one who has been refused\". It refers to Soviet Jews (and sometimes other ethnic groups) who were denied permission to emigrate, primarily to Israel, during the Cold War era.","priority":"★★★"},"pronunciation":{"ipa":"/rɪˈfjuːznɪk/","syllables":"re-fus-nik"},"inflection":{"noun_plural":"Refusniks"},"usage_notes":{"explanation":"The term 'Refusnik' is specifically associated with the plight of Jews in the Soviet Union who were denied emigration rights. While the literal translation might apply to anyone refused something, its historical context is crucial. The term carries a strong connotation of human rights violations and political oppression.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a Refusnik from China.","correct":"✓ He was a dissident from China.","note":"'Refusnik' specifically refers to Soviet citizens (primarily Jews) denied emigration. A dissident is a more general term for someone who opposes the government."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Dissident","Emigration","Soviet Jewry","Gulag","Samizdat"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Historically significant, but not commonly used today.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Refusnik' is a term with significant historical and political weight, referring specifically to Soviet Jews denied emigration during the Cold War. Understanding its usage requires knowledge of this historical context and the human rights issues involved. The term is not commonly used in everyday conversation but is important in discussions of Soviet history and Jewish diaspora.","priority":"★★☆"},"example_sentences":[{"sentence":"The plight of the Refusniks became a cause célèbre in the West.","translation":"出国拒否者の苦境は、西側諸国で大きな注目を集める問題となった。","type":"noun","meaning_category":"Denied Emigrant"},{"sentence":"Many activists campaigned for the release of Refusniks from the Soviet Union.","translation":"多くのアクティビストが、ソ連からの出国拒否者の解放を求めて運動を行った。","type":"noun","meaning_category":"Denied Emigrant"}]}