{"word":"hippotigrine","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"シマウマのような縞模様の、シマウマに似た","english_definition":"Of or pertaining to zebras; zebra-like; striped like a zebra.","examples":[{"sentence":"The hippotigrine markings on the quagga were less distinct than those of a zebra.","translation":"クアッガのシマウマのような模様は、シマウマほどはっきりしていなかった。"},{"sentence":"Some experimental horses have been bred to exhibit hippotigrine striping.","translation":"実験的に、シマウマのような縞模様を示すように繁殖された馬もいる。"}],"collocations":["hippotigrine stripes (シマウマのような縞模様)","hippotigrine pattern (シマウマのような模様)"],"synonyms":["zebraic","zebrine","striped"],"antonyms":["unstriped","plain"]},{"part_of_speech":"noun","definition":"シマウマのような縞模様を持つ動物","english_definition":"An animal with zebra-like stripes.","examples":[{"sentence":"The museum displayed a variety of hippotigrines, including different species of zebras and quaggas.","translation":"博物館には、さまざまな種類のシマウマやクアッガなど、シマウマのような縞模様を持つ動物が展示されていた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Latin 'hippus' (horse) + 'tigris' (tiger) + '-ine' (of or pertaining to). Literally, 'horse-tiger-like'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌhɪpəˈtaɪɡraɪn/","syllables":"hip-po-ti-grine"},"inflection":{"notes":"Adjective: hippotigrine (comparative: more hippotigrine, superlative: most hippotigrine). Noun: hippotigrine (plural: hippotigrines)."},"usage_notes":{"explanation":"The term 'hippotigrine' is relatively rare and specialized, primarily used in scientific or zoological contexts to describe animals or patterns resembling those of zebras. It is not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The hippotigrine is a type of horse.","correct":"✓ The zebra is a type of hippotigrine.","note":"'Hippotigrine' describes the pattern, not necessarily the animal itself. Zebras are a type of animal that exhibit hippotigrine patterns."}],"priority":"★★☆"},"related_words":{"derivatives":["hippotigris (historical term for zebra)"],"phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hippotigrine' is a specialized term used to describe something that has zebra-like stripes or characteristics. It combines elements referencing both horses ('hippo-') and tigers ('-tigrine'), indicating a striped pattern similar to that of a zebra. This word is not commonly used in everyday language and is more likely to appear in scientific or zoological contexts when discussing animal markings or patterns.","priority":"★★☆"},"example_sentences":[{"sentence":"The extinct quagga possessed hippotigrine markings primarily on its forequarters.","translation":"絶滅したクアッガは、主に前肢にシマウマのような模様を持っていた。","type":"adjective","meaning_category":"シマウマのような縞模様の"},{"sentence":"Scientists studied the genetics behind the hippotigrine patterns in various equine species.","translation":"科学者たちは、さまざまなウマ科動物のシマウマのような模様の遺伝的背景を研究した。","type":"adjective","meaning_category":"シマウマのような縞模様の"}]}