{"word":"unimpassionately","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"冷静に、感情を込めずに、淡々と","english_definition":"without passion or emotion; calmly and objectively.","examples":[{"sentence":"He spoke unimpassionately about the company's financial troubles.","translation":"彼は会社の財政難について冷静に語った。"},{"sentence":"She delivered the news unimpassionately, showing no sign of personal feeling.","translation":"彼女は個人的な感情を一切見せず、淡々とそのニュースを伝えた。"},{"sentence":"The judge listened unimpassionately to the arguments presented by both sides.","translation":"裁判官は両側の主張を冷静に聞き入った。"}],"collocations":["speak unimpassionately","act unimpassionately","describe unimpassionately","observe unimpassionately","analyze unimpassionately"],"synonyms":["calmly","coolly","objectively","dispassionately","indifferently","apathetically","stoically"],"antonyms":["passionately","emotionally","fervently","ardently","zealously"]}],"etymology":{"value":"The word 'unimpassionately' is formed by adding the prefix 'un-' (meaning 'not') and the suffix '-ly' (forming an adverb) to the word 'impassionate'. 'Impassionate' itself comes from 'im-' (meaning 'in' or 'on') and 'passionate', which is derived from 'passion'. Thus, 'unimpassionately' literally means 'not in a passionate manner'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnɪmˈpæʃənətli/","syllables":"un-im-pas-sion-ate-ly"},"inflection":{"notes":"As an adverb, 'unimpassionately' does not have different forms for gender or number."},"usage_notes":{"explanation":"'Unimpassionately' describes actions or speech that are devoid of strong feelings or emotions. It suggests a state of detachment, objectivity, or indifference. It is often used to describe someone who is presenting facts or making decisions without being influenced by personal biases or emotional considerations. The word implies a lack of enthusiasm, excitement, or strong emotional investment in the subject at hand.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She unimpassionately felt the cold.","correct":"✓ She unimpassionately described the cold weather.","note":"'Unimpassionately' typically modifies verbs related to speaking, acting, or describing, rather than verbs of feeling. It describes the manner in which something is expressed or done, not the feeling itself."},{"incorrect":"✗ He acted unimpassionate.","correct":"✓ He acted unimpassionately.","note":"'Unimpassionately' is an adverb, so it should be used to modify a verb. 'Unimpassionate' is an adjective, meaning 'without passion', and is used to describe a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["unimpassioned (adjective): not showing or feeling strong emotions","passion (noun): strong and barely controllable emotion","passionate (adjective): showing or caused by strong feelings or a strong belief"],"antonyms":["passionately (adverb): with great emotion or enthusiasm","emotionally (adverb): relating to emotions"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unimpassionately' is an advanced word that describes doing something without strong feelings or emotions. It suggests a calm, objective, or indifferent approach. You might see it used to describe someone presenting facts or making decisions without being influenced by personal biases. It's the opposite of doing something 'passionately'. Because it's not a common word, it's more likely to appear in formal writing or discussions."},"example_sentences":[{"sentence":"The scientist presented the data unimpassionately, focusing solely on the facts.","translation":"科学者は事実のみに焦点を当て、データを冷静に提示した。","type":"general"},{"sentence":"Despite the gravity of the situation, he spoke unimpassionately, maintaining a neutral tone.","translation":"事態の重大さにもかかわらず、彼は冷静に話し、中立的な口調を維持した。","type":"general"},{"sentence":"She analyzed the problem unimpassionately, setting aside any personal feelings.","translation":"彼女は個人的な感情を脇に置き、冷静に問題を分析した。","type":"general"}]}