{"word":"microtomist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"顕微鏡切片作成者、薄切標本作製者","english_definition":"A person who prepares extremely thin slices of material for microscopic examination, using a microtome.","examples":[{"sentence":"The microtomist carefully prepared the tissue samples for the pathologist.","translation":"薄切標本作製者は、病理医のために組織サンプルを注意深く準備した。"},{"sentence":"A skilled microtomist is essential for accurate histological analysis.","translation":"熟練した顕微鏡切片作成者は、正確な組織学的分析に不可欠である。"}],"collocations":["skilled microtomist","experienced microtomist","tissue preparation","histological analysis"],"synonyms":["section cutter","histotechnician","tissue processor"],"antonyms":[]}],"etymology":{"value":"Derived from 'microtome' (an instrument used to cut thin sections) + '-ist' (a suffix denoting a person who practices or is skilled in a particular art or science).","priority":"★★☆"},"pronunciation":{"ipa":"/maɪˈkrɒtəmɪst/","syllables":"mi-cro-to-mist"},"inflection":{"noun_plural":"microtomists"},"usage_notes":{"explanation":"The term 'microtomist' refers specifically to someone who prepares samples for microscopy by cutting them into extremely thin sections using a microtome. This is a specialized skill often required in fields such as histology, pathology, and materials science.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The microbiologist acted as a microtomist.","correct":"✓ The histotechnician acted as a microtomist.","note":"A microbiologist studies microorganisms, while a microtomist prepares thin sections of tissue. A histotechnician is a more appropriate term for someone performing microtomy."}],"priority":"★★☆"},"related_words":{"derivatives":["microtome (noun: an instrument used to cut thin sections)","microtomy (noun: the process of cutting thin sections with a microtome)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'microtomist' is a specialized term used in scientific and medical contexts. It refers to a person skilled in the art of microtomy, which is the preparation of extremely thin slices of material for examination under a microscope. Understanding this term requires familiarity with scientific vocabulary and histological techniques."},"example_sentences":[{"sentence":"The research lab hired a new microtomist to improve the quality of their tissue samples.","translation":"その研究室は、組織サンプルの品質を向上させるために、新しい顕微鏡切片作成者を雇った。","type":"general","meaning_category":"professional"},{"sentence":"The microtomist used a cryostat to prepare frozen sections of the biopsy sample.","translation":"顕微鏡切片作成者は、生検サンプルの凍結切片を準備するためにクライオスタットを使用した。","type":"technical","meaning_category":"technical process"}]}