{"word":"unghostly","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"幽霊らしくない、幽霊のようではない","english_definition":"Not resembling or characteristic of a ghost; not ghostly.","examples":[{"sentence":"The figure in the photograph looked surprisingly unghostly, almost human.","translation":"写真の中の人物は驚くほど幽霊らしくなく、ほとんど人間のように見えた。"},{"sentence":"Despite the spooky setting, the atmosphere felt strangely unghostly.","translation":"不気味な設定にもかかわらず、雰囲気は奇妙なほど幽霊らしくなかった。"}],"collocations":["unghostly appearance","unghostly presence","unghostly atmosphere"],"synonyms":["non-ghostly","unspiritual","earthly","corporeal","human"],"antonyms":["ghostly","spectral","ethereal","supernatural"]}],"etymology":{"value":"\"un-\" (否定の接頭辞) + \"ghostly\" (幽霊のような)","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈɡoʊstli/","syllables":"un-ghost-ly"},"inflection":{"adjective_forms":{"comparative":"more unghostly","superlative":"most unghostly"}},"usage_notes":{"explanation":"\"Unghostly\" is used to describe something that lacks the typical characteristics associated with ghosts, such as being ethereal, transparent, or frightening. It often implies a sense of normalcy or reality in a context where one might expect to encounter something supernatural.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unghostly house was very scary.","correct":"✓ The house, though old, had an unghostly atmosphere.","note":"Houses are not inherently ghostly or unghostly; it's the atmosphere or feeling associated with them that can be described as such."},{"incorrect":"✗ He was unghostly dressed.","correct":"✓ He was unghostly in appearance.","note":"\"Unghostly\" describes an overall quality or impression, not typically a specific item of clothing."}],"priority":"★★☆"},"related_words":{"derivatives":["ghostly (adjective: 幽霊のような)","ghost (noun: 幽霊)"],"antonyms":["ghostlike","spectral","phantom","wraithlike"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Low frequency)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unghostly\" is relatively uncommon and is formed by adding the prefix \"un-\" to \"ghostly,\" which means \"resembling a ghost.\" Therefore, \"unghostly\" means the opposite: not resembling a ghost. It is used to describe something that lacks the typical characteristics associated with ghosts, such as being ethereal, transparent, or frightening. This word is more likely to be encountered in descriptive writing or specialized contexts where the absence of ghostly qualities is notable."},"example_sentences":[{"sentence":"The supposedly haunted mansion had an surprisingly unghostly feel to it.","translation":"幽霊が出ると言われている大邸宅は、驚くほど幽霊のような感じがしなかった。","type":"adjective","meaning_category":"幽霊らしくない"},{"sentence":"The special effects made the alien look unghostly and more like a solid being.","translation":"特殊効果により、エイリアンは幽霊のようには見えず、より実体のある存在のように見えた。","type":"adjective","meaning_category":"幽霊らしくない"}]}