{"word":"Wampumpeag","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史的な意味で) 北米の先住民が貝殻を加工して作ったビーズ状の装飾品、通貨として使用された。","english_definition":"(historically) beads made from shells, used by North American indigenous peoples as ornamentation, ceremonial items, and currency.","examples":[{"sentence":"Wampumpeag was often used in treaties and agreements between Native Americans and European colonists.","translation":"ワムパムピーグは、しばしば北米先住民とヨーロッパの入植者間の条約や合意において使用された。"},{"sentence":"The colors of wampumpeag beads often held symbolic meaning.","translation":"ワムパムピーグのビーズの色は、しばしば象徴的な意味を持っていた。"}],"collocations":["wampum belt (ワムパムのベルト)","string of wampum (ワムパムの連)","trade wampum (ワムパムを取引する)"],"synonyms":["shell beads","seawan","sewant"],"antonyms":[]},{"part_of_speech":"noun","definition":"(一般的な意味で) 貝殻ビーズ、貝殻製の装飾品","english_definition":"(generally) shell beads; ornamentation made from shells.","examples":[{"sentence":"She wore a necklace made of wampumpeag.","translation":"彼女はワムパムピーグで作られたネックレスを身につけていた。"}],"collocations":["shell necklace","beaded jewelry"],"synonyms":["shell jewelry","shell craft"],"antonyms":[]}],"etymology":{"value":"アルゴンキン語族の言葉に由来し、おそらくナラガンセット語の「wampumpeag」または類似の言葉から。これは「白い紐」を意味する「wampi」と「ビーズ」を意味する「peag」の組み合わせである可能性がある。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɑːmpəmˌpiːɔɡ/","syllables":"wam-pum-peag"},"inflection":{"noun_plural":"wampumpeags"},"usage_notes":{"explanation":"「**Wampumpeag**」は、主に歴史的な文脈で使用される単語で、北米の先住民が貝殻を加工して作ったビーズ状の装飾品や通貨を指します。特に、条約や儀式で使用されたワムパムベルトが有名です。現代では、一般的な貝殻ビーズや装飾品を指すこともありますが、その場合は歴史的な意味合いは薄れます。複数形は「wampumpeags」ですが、単数形で集合名詞的に使われることもあります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He found a wampumpeag on the beach made of plastic.","correct":"✓ He found a shell bead on the beach made of plastic.","note":"「wampumpeag」は本来、貝殻で作られたビーズを指します。プラスチック製のビーズには使いません。"},{"incorrect":"✗ The wampumpeag was used as money by all tribes in the world.","correct":"✓ The wampumpeag was used as money by some North American indigenous tribes.","note":"ワムパムピーグは、すべての部族で使用されたわけではありません。主に北米の特定の部族で使用されました。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["seawan","shell money","beadwork","Native American history","Algonquian languages"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (非常に特殊な語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 歴史、人類学、先住民文化に関する文脈でのみ見られる。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Wampumpeag**」は、北米先住民の歴史や文化に特有の非常に専門的な単語です。これは、貝殻から作られたビーズを指し、装飾品や儀式用品として、また一種の通貨として使用されました。この単語は、歴史的な文脈や、先住民の文化や歴史について議論する学術的な文章で最も一般的に使用されます。日常会話で使われることはほとんどありません。この単語を理解するには、北米先住民の歴史と文化に関する背景知識が必要です。"},"example_sentences":[{"sentence":"The museum displayed a beautiful wampumpeag belt depicting important historical events.","translation":"博物館には、重要な歴史的出来事を描いた美しいワムパムピーグのベルトが展示されていた。","type":"noun","meaning_category":"歴史的な装飾品・通貨"},{"sentence":"Archaeologists have discovered wampumpeag beads at several Native American archaeological sites.","translation":"考古学者は、いくつかの北米先住民の遺跡でワムパムピーグのビーズを発見した。","type":"noun","meaning_category":"歴史的な装飾品・通貨"},{"sentence":"Wampumpeag played a significant role in the trade networks of the Eastern Woodlands tribes.","translation":"ワムパムピーグは、東部森林地帯の部族の交易ネットワークにおいて重要な役割を果たした。","type":"noun","meaning_category":"歴史的な装飾品・通貨"}]}