{"word":"Fourier","priority":"★★☆","meanings":[{"part_of_speech":"proper noun","definition":"フーリエ (人名: フランスの数学者、物理学者)","english_definition":"A French mathematician and physicist (1768-1830).","examples":[{"sentence":"Fourier developed the theory of Fourier analysis.","translation":"フーリエはフーリエ解析の理論を開発した。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"adjective","definition":"フーリエの、フーリエに関する","english_definition":"Relating to or associated with the French mathematician and physicist Jean-Baptiste Joseph Fourier or his work.","examples":[{"sentence":"Fourier transform is a fundamental tool in signal processing.","translation":"フーリエ変換は信号処理における基本的なツールである。"}],"collocations":["Fourier analysis","Fourier transform","Fourier series"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after Jean-Baptiste Joseph Fourier (1768-1830), a French mathematician and physicist who made important contributions to the study of heat transfer and signal analysis.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfʊrieɪ/","syllables":"Foo-ri-ay"},"inflection":{},"usage_notes":{"explanation":"The term \"Fourier\" is primarily used as a proper noun to refer to the French mathematician and physicist Jean-Baptiste Joseph Fourier. It is also commonly used as an adjective to describe concepts, methods, or transforms that are related to his work, such as Fourier analysis, Fourier transform, and Fourier series. These concepts are widely used in mathematics, physics, engineering, and signal processing.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["Fourier analysis (フーリエ解析)","Fourier transform (フーリエ変換)","Fourier series (フーリエ級数)"],"priority":"★★★"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term \"Fourier\" is a technical term primarily encountered in mathematics, physics, and engineering contexts. It refers to the French mathematician and physicist Jean-Baptiste Joseph Fourier and his associated theories and transforms. Understanding the term requires familiarity with advanced mathematical concepts such as signal processing, harmonic analysis, and differential equations. The most common usage is in the context of Fourier analysis and Fourier transforms, which are used to decompose complex functions into simpler sinusoidal components. Due to its specialized nature, it is not typically encountered in general English usage."},"example_sentences":[{"sentence":"The **Fourier** transform is a powerful tool for analyzing signals in the frequency domain.","translation":"フーリエ変換は、周波数領域で信号を解析するための強力なツールです。","type":"adjective","meaning_category":"フーリエの、フーリエに関する"},{"sentence":"**Fourier**'s work on heat conduction was groundbreaking.","translation":"フーリエの熱伝導に関する研究は画期的だった。","type":"proper noun","meaning_category":"フーリエ (人名)"}]}