{"word":"Dorism","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A belief in or adherence to the principles and practices associated with Doris Day, often characterized by optimism, wholesomeness, and a focus on traditional values.","english_definition":"Belief in or adherence to the principles and practices associated with Doris Day, often characterized by optimism, wholesomeness, and a focus on traditional values.","examples":[{"sentence":"Her unwavering Dorism was a source of inspiration to many.","translation":"彼女の揺るぎないドリスムは多くの人にとってインスピレーションの源でした。"},{"sentence":"The movie embodies a certain Dorism that is both nostalgic and comforting.","translation":"その映画は、ノスタルジックで心地よい、ある種のドリスムを体現しています。"}],"collocations":["Embrace Dorism","Practice Dorism","A touch of Dorism","Unwavering Dorism"],"synonyms":["Optimism","Wholesomeness","Traditionalism","Idealism"],"antonyms":["Cynicism","Pessimism"]}],"etymology":{"value":"Derived from the name 'Doris,' specifically referring to Doris Day, a popular American actress and singer known for her wholesome image and optimistic roles. The suffix '-ism' is added to denote a belief system or set of principles.","priority":"★★★"},"pronunciation":{"ipa":"ˈdɔːrɪzəm","syllables":"Dor-is-m"},"inflection":{"noun_plural":"Dorisms"},"usage_notes":{"explanation":"'Dorism' is a relatively recent and informal term, often used to describe a particular set of values or a worldview influenced by the persona and work of Doris Day. It is not a widely recognized or formally defined concept but is used in cultural commentary and discussions about nostalgia, traditional values, and the portrayal of women in media.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She practices Dorism in her everyday life, like a religion.","correct":"✓ She embodies Dorism in her everyday life, showing optimism and kindness.","note":"'Dorism' is not a formal religion or strict set of rules, but rather a set of values or a way of life inspired by Doris Day's image."}],"priority":"★★☆"},"related_words":{"derivatives":["Doris Day (Proper noun: The person from whom the term is derived)"],"phrases":["Doris Day image","Doris Day movies"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not a standard CEFR word)","frequency_google_ngram":"Low frequency (Relatively rare word)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dorism' is a niche term that requires understanding of Doris Day's cultural impact. It's used to describe a set of values associated with her public image, such as optimism and wholesomeness. Understanding this term requires cultural literacy and familiarity with the actress and her work."},"example_sentences":[{"sentence":"The play's lighthearted tone and focus on family values reflect a strong sense of Dorism.","translation":"その劇の気楽なトーンと家族の価値観への焦点は、強いドリスムを反映しています。","type":"noun","meaning_category":"Belief system"},{"sentence":"Some critics argue that Dorism presents an unrealistic and overly idealized view of the world.","translation":"一部の批評家は、ドリスムが非現実的で過度に理想化された世界観を提示していると主張しています。","type":"noun","meaning_category":"Belief system"}]}