{"word":"Chavaree","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史的な儀式) シャリバリ：中世から近世にかけてヨーロッパで行われた、社会的に容認されない結婚や行為（寡婦との再婚、高齢者の結婚、不倫など）に対する抗議や嘲笑を目的とした騒々しい儀式。鍋やフライパンを叩いたり、歌を歌ったり、人形劇をしたりすることが含まれた。","english_definition":"(historical) A charivari: a noisy mock serenade, typically performed by a group of people to ridicule or express disapproval of a socially unacceptable marriage or behavior (such as a widow remarrying too soon, an older person marrying a younger one, or adultery). It often involved banging pots and pans, singing rude songs, and performing skits.","examples":[{"sentence":"The young couple was subjected to a chavaree by the townspeople because the bride was much older than the groom.","translation":"その若いカップルは、花嫁が花婿よりずっと年上だったため、町の人々からシャリバリを受けた。"},{"sentence":"Chavarees were a way for the community to enforce social norms and express disapproval of those who violated them.","translation":"シャリバリは、地域社会が社会規範を強制し、規範に違反する人々への不承認を表明する方法だった。"}],"collocations":["subjected to a chavaree","perform a chavaree","a traditional chavaree"],"synonyms":["skimmington ride","rough music","charivari"],"antonyms":[]}],"etymology":{"value":"フランス語の 'charivari' に由来し、中世ラテン語の 'caribaria' （頭痛、混乱）に関連するとされる。騒々しい音や混乱を伴う儀式の性質を反映している。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʃævəˈriː/","syllables":"Sha-va-ree"},"inflection":{"noun_plural":"chavarees"},"usage_notes":{"explanation":"「**Chavaree**」は、歴史的な文脈でのみ使用される単語であり、現代ではほとんど使われません。主に、中世から近世にかけてのヨーロッパの社会史や文化史を扱う際に言及されることがあります。現代社会には直接的な類似の儀式は存在しませんが、社会的な非難や抗議の形として、類似の行動が見られる場合があります。","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They organized a chavaree to celebrate the wedding.","correct":"✓ They organized a chavaree to protest the wedding.","note":"シャリバリは結婚を祝うものではなく、抗議や嘲笑を目的とした儀式です。"},{"incorrect":"✗ The chavaree was a quiet and respectful ceremony.","correct":"✓ The chavaree was a noisy and disruptive ceremony.","note":"シャリバリは騒々しく、混乱を招く儀式でした。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["folk justice","social shaming","community rituals"]},"level_frequency":{"CEFR":"N/A (非常にまれな単語)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Chavaree**」は、歴史的な文脈でのみ使用される非常に特殊な単語です。この単語を理解するには、中世から近世にかけてのヨーロッパの社会史、特に社会規範からの逸脱に対する地域社会の反応について知っておく必要があります。この単語は、社会学、人類学、歴史学の研究論文や書籍で出会う可能性があります。現代英語の日常会話や一般的な文章ではほとんど使用されません。"},"example_sentences":[{"sentence":"The villagers staged a **chavaree** outside the home of the adulterous couple.","translation":"村人たちは、姦通を犯したカップルの家の外でシャリバリを行った。","type":"noun","meaning_category":"歴史的な儀式"},{"sentence":"The **chavaree** was intended to publicly shame those who violated the community's moral code.","translation":"シャリバリは、地域社会の道徳規範に違反した人々を公に辱めることを目的としていた。","type":"noun","meaning_category":"歴史的な儀式"},{"sentence":"Historians study **chavarees** to understand the social dynamics of past communities.","translation":"歴史家は、過去の地域社会の社会力学を理解するためにシャリバリを研究する。","type":"noun","meaning_category":"歴史的な儀式"}]}