{"word":"sacramentary","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"聖餐書、聖礼典書","english_definition":"A book containing the prayers and ceremonies used by a priest celebrating Mass or administering sacraments.","examples":[{"sentence":"The priest consulted the sacramentary before beginning the Mass.","translation":"司祭はミサを始める前に聖餐書を参照した。"},{"sentence":"The sacramentary provides the liturgical texts for the entire year.","translation":"聖餐書は一年全体の典礼文を提供する。"}],"collocations":["ancient sacramentary","liturgical sacramentary","Gregorian Sacramentary","Gelasian Sacramentary"],"synonyms":["missal","liturgical book","ritual book"],"antonyms":[]}],"etymology":{"value":"From Medieval Latin 'sacramentarium', from Latin 'sacramentum' (sacrament).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsækrəˈmɛntəri/","syllables":"sac-ra-men-ta-ry"},"inflection":{"noun_plural":"sacramentaries"},"usage_notes":{"explanation":"A sacramentary is a specific type of liturgical book used in Christian churches, particularly in the Roman Catholic tradition. It is primarily for the use of the priest and contains the texts he recites during Mass and when administering sacraments. It differs from a missal, which includes the readings and chants for the choir and congregation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He read from the bible instead of the sacramentary.","correct":"✓ He read from the missal instead of the sacramentary.","note":"The Bible contains scripture, while the sacramentary contains prayers and instructions for the priest. A missal is a more general term for a liturgical book containing texts for Mass."}],"priority":"★☆☆"},"related_words":{"derivatives":["sacrament (名詞: 聖餐、聖礼典)","sacramental (形容詞: 聖餐の、聖礼典の)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'sacramentary' is a specialized term used within liturgical contexts, specifically referring to a book containing the prayers and ceremonies used by a priest during Mass and administering sacraments. It is not commonly used outside of theological or historical discussions related to Christian liturgy. Understanding this term requires familiarity with Christian religious practices and terminology."},"example_sentences":[{"sentence":"The scholar studied the ancient sacramentary to understand the evolution of the Mass.","translation":"学者はミサの進化を理解するために古代の聖餐書を研究した。","type":"noun","meaning_category":"聖餐書"},{"sentence":"The newly ordained priest received a sacramentary as part of his training.","translation":"新しく叙階された司祭は訓練の一環として聖餐書を受け取った。","type":"noun","meaning_category":"聖餐書"}]}