{"word":"begadang","priority":"★★★","meanings":[{"part_of_speech":"verb","definition":"staying up late or all night; to be wakeful","english_definition":"to stay awake until very late at night or all night. Often done for leisure, work, or due to an inability to sleep.","examples":[{"sentence":"Jangan terlalu sering begadang, itu tidak baik untuk kesehatanmu.","translation":"Don't stay up too late too often; it's not good for your health."}],"collocations":["begadang semalaman (stay up all night)","begadang sampai pagi (stay up until morning)","begadang karena pekerjaan (stay up late because of work)","begadang nonton bola (stay up late watching soccer)"],"synonyms":["melek","tidak tidur","duduk sampai larut malam"],"antonyms":["tidur","istirahat"],"related_words":["bergadang (noun form - the act of staying up late)"]}],"etymology":{"value":"The word 'begadang' is of Indonesian origin. It doesn't have a clear etymological root in other languages but is a common term in Indonesian daily conversation.","priority":"★★☆"},"pronunciation":{"ipa":"/bəˈɡadang/","syllables":"buh-gah-dang"},"inflection":{"verb_forms":{"present":"begadang","past":"begadang","future":"begadang"},"notes":"'Begadang' does not change form based on tense in Indonesian. The context of the sentence indicates the time frame."},"usage_notes":{"explanation":"'Begadang' is a very common Indonesian word that refers to the act of staying up late or all night. It can be used in a variety of contexts, from working on a project to simply enjoying leisure activities. It often implies a conscious decision to remain awake longer than usual.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Saya sudah begadang kemarin.","correct":"Saya begadang kemarin.","note":"The word 'sudah' (already) is redundant here. 'Begadang' itself implies that the action took place."},{"incorrect":"Dia begadang untuk tidur.","correct":"Dia begadang, tidak tidur.","note":"'Begadang' means to stay awake, so 'begadang untuk tidur' (staying up late to sleep) is contradictory. It should be 'staying up late, not sleeping'."}],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Common in Indonesian language context.","priority":"★☆☆"},"readability_explanation":{"level":"Beginner-Intermediate","text":"'Begadang' is a common Indonesian word that means to stay up late or all night. It's used in everyday conversation and is easily understood by most Indonesian speakers. It's important to remember that it refers to staying awake, not trying to sleep."},"example_sentences":[{"sentence":"Setiap malam minggu, kami selalu begadang bersama teman-teman.","translation":"Every Saturday night, we always stay up late with friends.","type":"general","meaning_category":"social activity"},{"sentence":"Mahasiswa sering begadang mengerjakan tugas kuliah.","translation":"Students often stay up late working on college assignments.","type":"general","meaning_category":"work/study"},{"sentence":"Begadang terlalu sering bisa menyebabkan kurang tidur.","translation":"Staying up too late too often can cause sleep deprivation.","type":"general","meaning_category":"health"}]}