{"word":"clition","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A hypothetical subatomic particle proposed as a constituent of quarks and leptons in some preon models.","english_definition":"A hypothetical subatomic particle proposed as a constituent of quarks and leptons in some preon models.","examples":[{"sentence":"Some physicists have proposed the existence of clitions as fundamental building blocks of matter.","translation":"一部の物理学者は、物質の基本的な構成要素としてクリチオンの存在を提唱しています。"}],"collocations":["preon model","fundamental particle","subatomic particle"],"synonyms":["preon"],"antonyms":[]}],"etymology":{"value":"The etymology is not definitively established, but it is likely a constructed term within the context of particle physics, possibly derived from or inspired by existing terms or concepts in the field.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈklɪti.ɒn/","syllables":"cli-ti-on"},"inflection":{"noun_plural":"clitions"},"usage_notes":{"explanation":"The term 'clition' is highly theoretical and not widely used, even within the physics community. It appears in discussions of preon models, which are themselves speculative attempts to explain the substructure of quarks and leptons. Its existence has not been experimentally verified.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Clitions are well-established particles in the Standard Model.","correct":"✓ Clitions are hypothetical particles proposed in some preon models, which go beyond the Standard Model.","note":"Clitions are not part of the Standard Model of particle physics."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["preon","quark","lepton","Standard Model"]},"level_frequency":{"CEFR":"C2 (very specialized vocabulary)","frequency_google_ngram":"Extremely low frequency - term is highly specialized and theoretical.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Clition' is a highly specialized term from theoretical particle physics. It refers to a hypothetical particle proposed as a constituent of quarks and leptons in preon models. Understanding this term requires a solid background in particle physics and the Standard Model. It is not part of everyday vocabulary and is rarely encountered outside of specialized academic contexts."},"example_sentences":[{"sentence":"The preon model suggests that quarks and leptons are not fundamental but are instead composed of even smaller particles called clitions.","translation":"プレオンモデルは、クォークとレプトンが基本的なものではなく、クリチオンと呼ばれるさらに小さな粒子で構成されていることを示唆しています。","type":"noun","meaning_category":"hypothetical particle"}]}