{"word":"typically-nosed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"having a nose that is typical or characteristic of a particular group, type, or stereotype.","english_definition":"Possessing a nose that conforms to a common or expected appearance for a specific group, type, or stereotype.","examples":[{"sentence":"The character was described as typically-nosed, fitting the ethnic stereotype.","translation":"そのキャラクターは、民族的ステレオタイプに合致する、典型的な鼻を持つと描写された。"},{"sentence":"He was a typically-nosed Roman, with a prominent aquiline feature.","translation":"彼は典型的な鼻を持つローマ人で、顕著な鷲鼻が特徴だった。"}],"collocations":["typically-nosed [ethnic group]","typically-nosed [animal breed]","typically-nosed [character type]"],"synonyms":["characteristically-nosed","stereotypically-nosed","conventionally-nosed"],"antonyms":["untypically-nosed","unconventionally-nosed","atypically-nosed"]}],"etymology":{"value":"Derived from combining 'typically' (in a typical manner) and 'nosed' (having a nose of a specified kind). The term suggests adherence to a common or expected nasal appearance.","priority":"N/A"},"pronunciation":{"ipa":"/ˈtɪpɪkəlɪ noʊzd/","syllables":"tip-i-cal-ly nosed"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"The term 'typically-nosed' is often used in descriptive contexts to indicate that someone or something has a nose that is representative of a particular group, type, or stereotype. Its usage can be sensitive, particularly when describing ethnic or racial features, as it can perpetuate stereotypes.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The dog was typically-nosed for a cat.","correct":"✓ The dog was typically-nosed for a beagle.","note":"The adjective should be used in reference to the correct group or type."}],"priority":"N/A"},"related_words":{"derivatives":["typically","nosed"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'typically-nosed' is a compound adjective used to describe a nose that conforms to a common or expected appearance for a specific group, type, or stereotype. It is relatively uncommon and may be encountered in descriptive or literary contexts. Its usage can be sensitive, particularly when describing ethnic or racial features, as it can perpetuate stereotypes."},"example_sentences":[{"sentence":"The actor was cast as a typically-nosed Italian in the period drama.","translation":"その俳優は、時代劇の中で典型的な鼻を持つイタリア人として配役された。","type":"adjective","meaning_category":"descriptive"},{"sentence":"The breed is known for being typically-nosed, with a straight profile.","translation":"その犬種は、直線的な輪郭を持つ典型的な鼻を持つことで知られている。","type":"adjective","meaning_category":"descriptive"}]}