{"word":"introspectivo","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"内省的な、自己反省的な","english_definition":"Given to introspection; characterized by or involving introspection.","examples":[{"sentence":"Es un hombre introspectivo que pasa mucho tiempo pensando en sí mismo.","translation":"彼は自分自身について考えることに多くの時間を費やす内省的な男だ。"},{"sentence":"Su novela es muy introspectiva y explora los pensamientos y sentimientos del personaje principal.","translation":"彼の小説は非常に内省的で、主人公の考えや感情を探求している。"}],"collocations":["ser introspectivo (内省的である)","pensamiento introspectivo (内省的な思考)","análisis introspectivo (内省的な分析)"],"synonyms":["reflexivo","meditativo","pensativo","contemplativo"],"antonyms":["extrovertido","superficial","frívolo"]}],"etymology":{"value":"Del latín 'intro-' (dentro) + 'spectare' (mirar) + '-ivo' (relativo a). Literalmente, 'relativo a mirar dentro'.","priority":"N/A"},"pronunciation":{"ipa":"/intɾospekˈtiβo/","syllables":"in-tros-pec-ti-vo"},"inflection":{"gender":"masculine","number":"singular"},"usage_notes":{"explanation":"'Introspectivo' se usa para describir a personas, obras de arte, o procesos mentales que se caracterizan por una profunda reflexión interna. Implica un examen cuidadoso de los propios pensamientos, sentimientos y motivaciones.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"Él es muy extrovertido e introspectivo a la vez.","correct":"Él es una persona con momentos de extroversión y momentos de introspección.","note":"Es difícil ser completamente extrovertido e introspectivo al mismo tiempo, ya que son tendencias opuestas. Se puede tener momentos de cada uno."}],"priority":"N/A"},"related_words":{"derivatives":["introspección (introspección)","introspectivamente (introspectivamente)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relativamente frecuente en textos académicos y literarios.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"La palabra 'introspectivo' se utiliza en contextos donde se requiere un vocabulario preciso para describir procesos mentales complejos. Su comprensión implica la capacidad de entender conceptos abstractos relacionados con la psicología y la filosofía."},"example_sentences":[{"sentence":"La soledad le permitió un tiempo introspectivo para reflexionar sobre su vida.","translation":"Solitude allowed him introspective time to reflect on his life.","type":"adjective","meaning_category":"内省的な"},{"sentence":"El artista creó una serie de autorretratos introspectivos que revelaban su estado emocional.","translation":"The artist created a series of introspective self-portraits that revealed his emotional state.","type":"adjective","meaning_category":"内省的な"}]}