{"word":"dermapostasis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A condition in which, after death, the blood settles in the dependent parts of the body, causing a discoloration of the skin.","english_definition":"The settling of blood in the lower (dependent) portion of the body, causing a purplish red discoloration of the skin; occurs after death.","examples":[{"sentence":"Dermapostasis is a useful indicator of the position of the body after death.","translation":"死後、皮下静脈沈滞は死後の体の位置を示す有用な指標となる。"}],"collocations":["postmortem dermapostasis","livor mortis","settling of blood"],"synonyms":["livor mortis","postmortem hypostasis"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'derma' (skin) + 'apo' (away, from) + 'stasis' (standing, stoppage).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌdɜːrməpɒˈsteɪsɪs/","syllables":"der-ma-po-sta-sis"},"inflection":{"noun_plural":"dermapostasis (uncountable)"},"usage_notes":{"explanation":"Dermapostasis, also known as livor mortis or postmortem hypostasis, is a key factor in determining the time and position of death in forensic science. The discoloration typically appears within 30 minutes to 2 hours after death and becomes fixed within 8 to 12 hours.","priority":"☆☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["derm (skin)","stasis (stoppage)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Dermapostasis' is a highly specialized term used in forensic science and medicine to describe the postmortem settling of blood. Due to its technical nature, it is rarely encountered outside of these fields. Understanding requires a strong grasp of medical and scientific terminology."},"example_sentences":[{"sentence":"The presence of dermapostasis on the back of the body indicated that the deceased had been lying in a supine position for several hours after death.","translation":"体の背面に皮下静脈沈滞が見られたことから、死亡者は死後数時間仰向けに寝ていたことが示唆された。","type":"noun","meaning_category":"medical condition"}]}