{"word":"Oppositionism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(政治) 反対主義、反対のための反対","english_definition":"The practice of habitually opposing or resisting something; systematic opposition, especially to an established government or policy.","examples":[{"sentence":"His political views were characterized by pure oppositionism, regardless of the merits of the proposals.","translation":"彼の政治的見解は、提案のメリットに関わらず、純粋な反対主義によって特徴づけられていた。"},{"sentence":"The party's platform was often criticized as mere oppositionism, lacking constructive alternatives.","translation":"その党の綱領は、建設的な代替案を欠き、単なる反対主義だとしばしば批判された。"}],"collocations":["pure oppositionism (純粋な反対主義)","mere oppositionism (単なる反対主義)","political oppositionism (政治的反対主義)","systematic oppositionism (組織的な反対主義)"],"synonyms":["obstructionism","resistance","dissent","defiance","negativism"],"antonyms":["conformity","acquiescence","compliance","agreement","support"]}],"etymology":{"value":"'Opposition'（反対）に '-ism'（主義）が付いた言葉。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒpəˈzɪʃənɪzəm/","syllables":"op-po-si-tion-ism"},"inflection":{"notes":"不可算名詞"},"usage_notes":{"explanation":"'Oppositionism' は、特定の政策や提案に対して、その内容に関わらず、一貫して反対する傾向を指す言葉です。しばしば、建設的な代替案を提示することなく、単に反対すること自体が目的となっている場合に用いられます。政治的な文脈でよく使われますが、他の分野でも、組織やグループ内で見られる反対意見の表明を指すことがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a great oppositionism for the new law.","correct":"✓ He showed great opposition to the new law. / ✓ He displayed oppositionism towards the new law.","note":"'Oppositionism' は、反対の態度や行動そのものを指す名詞であり、具体的な対象に対する反対を示す場合は、'opposition to' または 'oppositionism towards' のように前置詞を伴う表現が適切です。また、'opposition' 自体も、具体的な対象に対する反対意見や行動を表す名詞として使えます。"},{"incorrect":"✗ The oppositionism was very strong from the public.","correct":"✓ Opposition to the plan was very strong from the public. / ✓ Public opposition to the plan was very strong.","note":"'Oppositionism' は、主義や傾向を指す抽象的な名詞であり、具体的な反対意見や行動を示す場合は、'opposition' を使う方が自然です。"}],"priority":"★★☆"},"related_words":{"derivatives":["opposition (名詞: 反対、対立)","oppositionist (名詞: 反対者、反対主義者)","oppose (動詞: 反対する)","oppositional (形容詞: 反対の、対立的な)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Oppositionism' is a relatively uncommon term that describes the practice of consistently opposing or resisting something, often without offering constructive alternatives. It is frequently used in political contexts to critique parties or individuals who seem to oppose policies simply for the sake of opposing them. Understanding this term requires a grasp of abstract concepts and a familiarity with political discourse."},"example_sentences":[{"sentence":"The senator's constant oppositionism made it difficult to pass any legislation.","translation":"その上院議員の絶え間ない反対主義は、いかなる法案も通過させることを困難にした。","type":"general","meaning_category":"反体制的な態度"},{"sentence":"The group was accused of engaging in oppositionism rather than offering viable solutions.","translation":"そのグループは、実行可能な解決策を提供するのではなく、反対主義に走っていると非難された。","type":"general","meaning_category":"建設的な代替案の欠如"}]}