{"word":"Doliolidae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ウミタル科：尾索動物亜門に属する海洋無脊椎動物の一群","english_definition":"A family of marine invertebrate animals belonging to the subphylum Tunicata (also known as Urochordata), characterized by barrel-shaped bodies and a complex life cycle involving both sexual and asexual reproduction.","examples":[{"sentence":"Doliolidae are planktonic organisms found in warm and temperate seas.","translation":"ウミタル科は、温帯および熱帯の海で見られる浮遊性生物です。"}],"collocations":["Doliolidae distribution","Doliolidae morphology","Doliolidae life cycle"],"synonyms":["doliolid","sea squirt relative"],"antonyms":[]}],"etymology":{"value":"Doliolidae is derived from the genus name Doliolum, which comes from the Latin word 'doliolum', meaning 'small jar' or 'small barrel', referring to the shape of these organisms.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdoʊliˈoʊlədiː/","syllables":"Do-li-o-li-dae"},"inflection":{"noun_plural":"Doliolids or Doliolidae"},"usage_notes":{"explanation":"Doliolidae are a family within the class Thaliacea, which are free-floating tunicates. They are important members of the marine plankton community and can form large blooms. Their complex life cycle involves alternating sexual and asexual generations.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Doliolum (genus)","Thaliacea (class)","Tunicata (subphylum)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Doliolidae is a scientific term referring to a specific family of tunicates. Understanding this term requires familiarity with marine biology and taxonomic classification. The text provided assumes a reader with advanced knowledge in these areas.","priority":"★★☆"},"example_sentences":[{"sentence":"The abundance of Doliolidae can significantly impact the marine food web.","translation":"ウミタル科の豊富さは、海洋食物網に大きな影響を与える可能性があります。","type":"general","meaning_category":"ecology"},{"sentence":"Researchers are studying the unique reproductive strategies of Doliolidae species.","translation":"研究者たちは、ウミタル科の種の独特な繁殖戦略を研究しています。","type":"scientific","meaning_category":"biology"}]}