{"word":"indexation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(経済)インデックス化、物価連動制、インフレ調整","english_definition":"The adjustment of wages, prices, interest rates, taxes, or other contractual payments to compensate for inflation or changes in the cost of living.","examples":[{"sentence":"The government uses indexation to adjust social security payments for inflation.","translation":"政府はインフレに合わせて社会保障給付金を調整するためにインデックス化を使用しています。"},{"sentence":"Wage indexation helps workers maintain their purchasing power during periods of high inflation.","translation":"賃金のインデックス化は、高インフレ期間中に労働者が購買力を維持するのに役立ちます。"},{"sentence":"Tax brackets are subject to indexation to prevent bracket creep.","translation":"税率区分は、ブラケットクリープを防ぐためにインデックス化の対象となります。"}],"collocations":["wage indexation (賃金インデックス化)","price indexation (価格インデックス化)","tax indexation (税金インデックス化)","full indexation (完全インデックス化)","partial indexation (部分的インデックス化)","automatic indexation (自動インデックス化)"],"synonyms":["inflation adjustment","cost-of-living adjustment (COLA)","linking","adjustment"],"antonyms":["fixed rate","non-indexed"]},{"part_of_speech":"noun","definition":"(情報科学)索引付け、インデックス作成","english_definition":"The process of creating an index for a database, document, or other collection of data to improve search performance.","examples":[{"sentence":"Indexation of the database significantly improved query response times.","translation":"データベースのインデックス作成により、クエリの応答時間が大幅に改善されました。"},{"sentence":"Search engines use sophisticated indexation techniques to crawl and index web pages.","translation":"検索エンジンは、Webページをクロールしてインデックスを作成するために、高度なインデックス作成技術を使用しています。"},{"sentence":"Proper indexation is crucial for efficient data retrieval.","translation":"適切なインデックス作成は、効率的なデータ検索に不可欠です。"}],"collocations":["database indexation (データベースのインデックス作成)","full-text indexation (全文インデックス作成)","inverted indexation (転置インデックス作成)","automatic indexation (自動インデックス作成)","manual indexation (手動インデックス作成)"],"synonyms":["indexing","cataloging","listing","classification"],"antonyms":["non-indexed","unindexed"]}],"etymology":{"value":"Derived from 'index' + '-ation'. 'Index' comes from Latin 'index' meaning 'pointer, sign, list'. The suffix '-ation' is used to form nouns denoting an action or process.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪndɛkˈseɪʃən/","syllables":"in-dex-a-tion"},"inflection":{"noun_plural":"indexations"},"usage_notes":{"explanation":"'Indexation' has two primary meanings: in economics, it refers to adjusting financial values to account for inflation, while in computer science, it refers to creating an index to improve search efficiency. The context usually clarifies which meaning is intended. In economics, it is often used in discussions of social security, wages, and taxes. In computer science, it is used in the context of databases, search engines, and information retrieval systems.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The indexation of the book was very helpful.","correct":"✓ The indexing of the book was very helpful.","note":"While 'indexation' can refer to the general process, 'indexing' is more common when referring to the act of creating an index for a book or document."},{"incorrect":"✗ They indexed the salaries to the cost of living.","correct":"✓ They indexed the salaries to the cost of living index.","note":"When referring to economic indexation, it's important to specify what the adjustment is being linked to (e.g., the cost of living index, the consumer price index)."}],"priority":"★★☆"},"related_words":{"derivatives":["index (noun, verb)","indexed (adjective)","indexing (noun, verb)"],"related_terms":["inflation","deflation","cost of living","consumer price index (CPI)","database","search engine","information retrieval"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Indexation' is a relatively advanced term primarily used in economics and computer science. In economics, it refers to the process of adjusting economic values (like wages or taxes) to account for inflation or changes in the cost of living. In computer science, it refers to the process of creating an index to improve the speed and efficiency of searching through large amounts of data. The context will usually indicate which meaning is intended. It is not a common word in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The government implemented full **indexation** of pensions to protect retirees from inflation.","translation":"政府は退職者をインフレから守るために、年金の完全インデックス化を実施しました。","type":"noun","meaning_category":"(経済)インデックス化"},{"sentence":"**Indexation** of the company's database led to a significant improvement in search performance.","translation":"会社のデータベースのインデックス作成により、検索パフォーマンスが大幅に向上しました。","type":"noun","meaning_category":"(情報科学)索引付け"},{"sentence":"Without **indexation**, the real value of savings would erode over time due to inflation.","translation":"インデックス化がなければ、貯蓄の実質価値はインフレによって時間とともに低下するでしょう。","type":"noun","meaning_category":"(経済)インデックス化"},{"sentence":"The search engine relies on sophisticated **indexation** algorithms to provide relevant results.","translation":"検索エンジンは、関連性の高い結果を提供するために、高度なインデックス作成アルゴリズムに依存しています。","type":"noun","meaning_category":"(情報科学)索引付け"}]}