{"word":"a fortiori","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"いっそう強く、なおさら、論理的に言って","english_definition":"with even stronger reason; all the more; used in logic to indicate a conclusion that is even more certain than another.","examples":[{"sentence":"If he can't afford a bicycle, then a fortiori he can't afford a car.","translation":"もし彼が自転車を買う余裕がないなら、なおさら車を買う余裕はないだろう。"},{"sentence":"She can't speak her native language well, a fortiori she can't master a foreign language.","translation":"彼女は母国語も上手に話せないのだから、いっそう外国語を習得できるはずがない。"}],"collocations":["a fortiori argument (より強い論証)","a fortiori reasoning (より強い推論)"],"synonyms":["all the more","even more certainly","with stronger reason"],"antonyms":["a priori","a posteriori"]}],"etymology":{"value":"ラテン語の「a fortiori ratione」（より強い理由によって）から。法学・論理学用語として英語に取り入れられた。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌeɪ fɔːrtiˈoʊraɪ/","syllables":"a for-ti-o-ri"},"usage_notes":{"explanation":"「**a fortiori**」は主に学術的・論理的な文脈で用いられる形式ばった表現です。ある命題が真である場合、それより強い理由で別の命題も真であることを示す際に使われます。通常、前の文で述べられた内容から、より明白な結論を導く場合に用いられます。日常会話ではほとんど使われず、主に法学、哲学、論理学の分野で見られます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is rich, a fortiori he must be happy.","correct":"✓ He can't even pay his rent, a fortiori he can't afford a luxury car.","note":"a fortioriは「より弱い/明白なケースからより強いケースを推論する」際に使う。富と幸福の関係のように主観的な推論には不適切"},{"incorrect":"✗ A fortiori, the sun will rise tomorrow.","correct":"✓ If he can't solve simple equations, a fortiori he can't solve advanced calculus problems.","note":"自明の真理に使うのは不適切。相対的な強弱関係を示す推論に用いる"}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":["a priori (先験的に)","a posteriori (経験的に)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈に限定される","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**a fortiori**」は高度に専門的なラテン語由来の論理学用語で、「より強い理由によって」「なおさら」という意味です。ある命題が成立するなら、それより明白な命題は当然成立する、という論理展開を示します。例えば「未成年者が飲酒できないなら、なおさら運転中に飲酒してはならない」といった使い方をします。法学・哲学論文などで稀に見られますが、日常会話ではまず使われません。"},"example_sentences":[{"sentence":"If the law applies to minors, then a fortiori it applies to adults.","translation":"もしその法律が未成年者に適用されるなら、なおさら成人にも適用される。","type":"adverb","meaning_category":"論理的推論"},{"sentence":"He can't even understand basic instructions, a fortiori complex theories.","translation":"彼は基本的な指示さえ理解できないのだから、いっそう複雑な理論など理解できるはずがない。","type":"adverb","meaning_category":"論理的推論"},{"sentence":"The evidence is insufficient for a misdemeanor charge, a fortiori for a felony.","translation":"その証拠では軽犯罪の立証も不十分なのだから、なおさら重犯罪の立証などできない。","type":"adverb","meaning_category":"法廷論理"}]}