{"word":"pump-well","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"井戸ポンプ","english_definition":"A well equipped with a pump for drawing water.","examples":[{"sentence":"The village pump-well provided fresh water for all the residents.","translation":"村の井戸ポンプは、すべての住民に新鮮な水を提供した。"},{"sentence":"They installed a new pump-well to increase the water supply.","translation":"彼らは給水量を増やすために新しい井戸ポンプを設置した。"}],"collocations":["village pump-well","install a pump-well","operate a pump-well"],"synonyms":["water well with pump","pumped well","well with pump"],"antonyms":["open well"]},{"part_of_speech":"noun","definition":"ポンプ室付きの井戸","english_definition":"A well that includes a pump house or a structure to protect the pumping mechanism.","examples":[{"sentence":"The old pump-well needed repairs to its structure.","translation":"古いポンプ室付きの井戸は、構造の修理が必要だった。"},{"sentence":"The pump-well was built to withstand harsh weather conditions.","translation":"ポンプ室付きの井戸は、厳しい気象条件に耐えるように建てられた。"}],"collocations":["old pump-well","repair a pump-well","build a pump-well"],"synonyms":["well with pump house","covered well","protected well"],"antonyms":["unprotected well"]}],"etymology":{"value":"The term combines 'pump,' referring to the mechanical device used to draw water, and 'well,' indicating the source of the water.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpʌmpˌwɛl/","syllables":"pump-well"},"inflection":{"noun_plural":"pump-wells"},"usage_notes":{"explanation":"The term 'pump-well' is used to specifically denote a well that utilizes a pump system to extract water. This distinguishes it from traditional open wells where water is drawn manually. It can also refer to the structure housing the pump mechanism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pumpwell was dry.","correct":"✓ The pump-well was dry.","note":"Hyphenation is important to ensure the term is recognized as a single concept."}],"priority":"★★☆"},"related_words":{"derivatives":["pump","well","water well"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Pump-well' refers to a well that uses a pump to extract water, distinguishing it from open wells. It can also refer to the structure protecting the pump. The term is relatively technical and less common in everyday conversation, usually appearing in contexts related to water supply, engineering, or rural infrastructure. Understanding the hyphenated structure is important for proper usage."},"example_sentences":[{"sentence":"The new pump-well significantly improved the village's access to clean drinking water.","translation":"新しい井戸ポンプは、村のきれいな飲料水へのアクセスを大幅に改善した。","type":"noun","meaning_category":"井戸ポンプ"},{"sentence":"Maintenance workers regularly inspect the pump-well to ensure it is functioning properly.","translation":"メンテナンス作業員は、井戸ポンプが適切に機能していることを確認するために定期的に点検する。","type":"noun","meaning_category":"井戸ポンプ"},{"sentence":"The design of the pump-well included a sturdy housing to protect the equipment from the elements.","translation":"井戸ポンプの設計には、機器を風雨から保護するための頑丈なハウジングが含まれていた。","type":"noun","meaning_category":"ポンプ室付きの井戸"}]}