{"word":"interjectionalizing","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(rare, nonstandard) to use interjections excessively or in an inappropriate manner.","english_definition":"(rare, nonstandard) to insert interjections into speech or writing, often excessively or inappropriately.","examples":[{"sentence":"His writing was criticized for interjectionalizing every other sentence.","translation":"彼の文章は、文の合間に過剰に間投詞を挿入していると批判された。"},{"sentence":"She has a habit of interjectionalizing when she's nervous.","translation":"彼女は緊張すると、間投詞を挟む癖がある。"}],"collocations":["interjectionalizing speech","interjectionalizing writing"],"synonyms":["interrupting","punctuating","injecting interjections"],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'interjectionalize,' which is formed by adding the suffix '-ize' (or '-ise' in British English) to 'interjectional.' 'Interjectional' is derived from 'interjection,' which comes from Latin 'interiectio,' meaning 'a throwing in between.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪntərˈdʒɛkʃənəˌlaɪzɪŋ/","syllables":"in-ter-jec-tion-al-iz-ing"},"inflection":{"verb_forms":{"present_simple":["interjectionalizes"],"past_simple":"interjectionalized","past_participle":"interjectionalized","present_participle":"interjectionalizing"}},"usage_notes":{"explanation":"'Interjectionalizing' is a rare and somewhat humorous term used to describe the act of excessively using interjections in speech or writing. It is not a standard or widely recognized word, and its usage is often considered nonstandard. It implies that the speaker or writer is overusing interjections to the point of being distracting or annoying.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The interjectionalizing of the story made it more interesting.","correct":"✓ The use of interjections in the story made it more interesting.","note":"It's better to use a more standard phrase like 'the use of interjections' instead of 'interjectionalizing' as a noun."}],"priority":"★☆☆"},"related_words":{"derivatives":["interjection (noun): an abrupt remark, made especially as an aside or interruption.","interjectional (adjective): relating to or of the nature of an interjection.","interjectionalize (verb): to insert interjections into speech or writing."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (not a standard word)","frequency_google_ngram":"Very low frequency - not a commonly used word.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Interjectionalizing' is a rare and nonstandard word, so it would not be found in common language learning resources. It describes the act of using interjections too much in speech or writing. Because it is not a common word, it is more likely to be understood by advanced English speakers who are familiar with the process of forming new words by adding suffixes like '-ize' to existing words."},"example_sentences":[{"sentence":"The comedian's routine involved a lot of interjectionalizing, which some found funny and others found annoying.","translation":"そのコメディアンのルーティンは多くの間投詞を含んでおり、面白いと思う人もいれば、迷惑だと思う人もいた。","type":"verb","meaning_category":"using interjections excessively"},{"sentence":"Avoid interjectionalizing your academic papers, as it can make your writing seem less formal.","translation":"学術論文で間投詞を過度に使用することは避けましょう。文章がフォーマルでなくなる可能性があります。","type":"verb","meaning_category":"using interjections inappropriately"}]}