{"word":"lunar-sensitive","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"月齢に敏感な、月の影響を受けやすい","english_definition":"Responsive or susceptible to the phases or influence of the moon.","examples":[{"sentence":"Some gardeners believe that certain plants are lunar-sensitive and grow better when planted according to the lunar cycle.","translation":"一部の園芸家は、特定の植物は月齢に敏感であり、月の周期に従って植えるとより良く育つと信じています。"},{"sentence":"The behavior of some animals is thought to be lunar-sensitive, with increased activity during the full moon.","translation":"一部の動物の行動は月齢に敏感であると考えられており、満月の間は活動が活発になります。"}],"collocations":["lunar-sensitive plants","lunar-sensitive animals","lunar-sensitive crops"],"synonyms":["moon-sensitive","moon-responsive"],"antonyms":["lunar-insensitive","moon-insensitive"]}],"etymology":{"value":"Combination of 'lunar' (relating to the moon) and 'sensitive' (easily affected or responsive).","priority":"N/A"},"pronunciation":{"ipa":"/ˈluːnər ˈsɛnsətɪv/","syllables":"lu-nar-sen-si-tive"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"The term 'lunar-sensitive' is often used in contexts related to astrology, gardening, and animal behavior to describe something that is believed to be affected by the moon's phases. It implies a direct correlation or responsiveness to the lunar cycle.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The lunar-sensitive is very important for the growth of the plant.","correct":"✓ Lunar sensitivity is very important for the growth of the plant.","note":"'Lunar-sensitive' is an adjective, not a noun. Use 'lunar sensitivity' as a noun."}],"priority":"N/A"},"related_words":{"derivatives":["lunar","sensitive","sensitivity"],"phrases":["lunar cycle","moon phase","moon influence"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Lunar-sensitive' is a compound adjective describing something that reacts to or is affected by the moon's phases. It's often used in specialized contexts like gardening or animal behavior studies where lunar cycles are thought to have an impact. The word suggests a direct relationship between the moon's state and the behavior or growth of the subject being described."},"example_sentences":[{"sentence":"Many traditional farmers believe that sowing seeds during specific moon phases can benefit lunar-sensitive crops.","translation":"多くの伝統的な農家は、特定の月の満ち欠けの間に種をまくことが、月齢に敏感な作物の生育に役立つと信じています。","type":"adjective","meaning_category":"月齢に敏感な"}]}