{"word":"mycetocyte","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"菌細胞：昆虫などの体内に見られる特殊な細胞で、共生細菌（内生菌）を保持する。","english_definition":"A specialized cell in insects and other animals that houses symbiotic microorganisms, typically bacteria.","examples":[{"sentence":"Mycetocytes are essential for the insect's nutrition, as the symbiotic bacteria provide essential nutrients.","translation":"菌細胞は、共生細菌が不可欠な栄養素を提供するため、昆虫の栄養にとって不可欠である。"},{"sentence":"The mycetocytes are located within the insect's fat body.","translation":"菌細胞は昆虫の脂肪体内に位置している。"}],"collocations":["harbor symbiotic bacteria","contain endosymbionts","specialized cell","insect symbiosis"],"synonyms":["bacteriocyte"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'mykes' (μύκης) meaning 'fungus' and 'kytos' (κύτος) meaning 'cell'. Although the term refers to cells harboring symbiotic microorganisms, the 'myceto-' prefix is historical and doesn't necessarily imply a fungal symbiont.","priority":"★★☆"},"pronunciation":{"ipa":"/maɪˈsiːtəˌsaɪt/","syllables":"my-ce-to-cyte"},"inflection":{"noun_plural":"mycetocytes"},"usage_notes":{"explanation":"Mycetocytes are critical for insects that rely on nutrient-poor diets, as the symbiotic bacteria within these cells synthesize essential amino acids and vitamins that the insect cannot obtain from its food. The relationship is mutually beneficial.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["mycetoma","mycetozoa"],"related_terms":["symbiosis","endosymbiont","bacteriome","fat body"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mycetocyte' is a specialized biological term referring to a cell that houses symbiotic microorganisms, typically bacteria, within an insect's body. These cells and their symbiotic bacteria are essential for the insect's survival, especially when the insect's diet lacks essential nutrients. Understanding this term requires knowledge of biology, particularly symbiosis and cellular structures."},"example_sentences":[{"sentence":"The aphid's mycetocytes contain Buchnera bacteria, which provide essential amino acids.","translation":"アブラムシの菌細胞にはブフネラ菌が含まれており、必須アミノ酸を提供している。","type":"general","meaning_category":"definition"},{"sentence":"Electron microscopy revealed the dense population of symbiotic bacteria within the mycetocytes.","translation":"電子顕微鏡により、菌細胞内の共生細菌の高密度な集団が明らかになった。","type":"research","meaning_category":"research context"}]}