{"word":"osteothrombosis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"骨血栓症：骨組織内の血栓形成","english_definition":"The formation of a blood clot within bone tissue.","examples":[{"sentence":"Osteothrombosis can contribute to the pathogenesis of avascular necrosis.","translation":"骨血栓症は、無血管性壊死の病因に寄与する可能性がある。"},{"sentence":"Research suggests a link between osteothrombosis and certain bone disorders.","translation":"研究は骨血栓症と特定の骨疾患との関連性を示唆している。"}],"collocations":["related to avascular necrosis (無血管性壊死に関連する)","associated with bone disorders (骨疾患に関連する)","pathogenesis of (～の病因)"],"synonyms":["intrabone thrombosis","bone thrombosis"],"antonyms":[]}],"etymology":{"value":"The term combines \"osteo-\" (from Greek \"osteon\" meaning bone), \"thrombo-\" (from Greek \"thrombos\" meaning clot), and \"-osis\" (denoting a condition or process).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɒstiːoʊθrɒmˈboʊsɪs/","syllables":"os-te-o-throm-bo-sis"},"inflection":{"noun_plural":"osteothromboses"},"usage_notes":{"explanation":"Osteothrombosis is a relatively rare and specific term in medical contexts, referring to the presence of blood clots within bone tissue. It is often discussed in relation to conditions affecting bone health and blood supply.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Osteothrombosis is a type of arthritis.","correct":"✓ Osteothrombosis involves blood clot formation within bone, which is different from the inflammation seen in arthritis.","note":"Osteothrombosis is related to blood clots, not inflammation like arthritis."}],"priority":"★★☆"},"related_words":{"derivatives":["thrombosis","osteonecrosis","avascular necrosis"],"related_terms":["coagulation","bone marrow","ischemia"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized medical vocabulary)","frequency_google_ngram":"Very low frequency - a specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Osteothrombosis' is a highly specialized medical term referring to the formation of blood clots within bone tissue. Understanding this term requires knowledge of medical terminology related to bones (osteo-) and blood clots (thrombosis). It is typically encountered in advanced medical texts or discussions concerning bone diseases and vascular complications.","priority":"★★☆"},"example_sentences":[{"sentence":"The study investigated the role of osteothrombosis in the development of osteonecrosis.","translation":"その研究では、骨壊死の発症における骨血栓症の役割が調査された。","type":"medical research","meaning_category":"pathogenesis"},{"sentence":"Microscopic analysis confirmed the presence of osteothrombosis in the bone sample.","translation":"顕微鏡分析により、骨サンプル中の骨血栓症の存在が確認された。","type":"diagnosis","meaning_category":"diagnosis"}]}