{"word":"slop-seller","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古語、軽蔑的) 安物衣料品店、またはその店主","english_definition":"(archaic, derogatory) A shop selling cheap clothes, or the owner of such a shop.","examples":[{"sentence":"He started as a slop-seller but eventually built a successful tailoring business.","translation":"彼は安物衣料品店から始めたが、最終的には成功した仕立て屋ビジネスを築き上げた。"},{"sentence":"The slop-seller tried to convince the customers that his goods were of high quality, but everyone knew better.","translation":"その安物衣料品店の店主は、自分の商品が高品質だと顧客に納得させようとしたが、誰もがそうではないと知っていた。"}],"collocations":["cheap clothing","low-quality goods","derogatory term"],"synonyms":["cheapjack","haberdasher (sometimes, depending on the quality)","outfitter (sometimes, depending on the quality)"],"antonyms":["high-end tailor","exclusive boutique"]},{"part_of_speech":"noun","definition":"(古語、軽蔑的) 海軍御用達の衣料品店、またはその店主","english_definition":"(archaic, derogatory) A shop supplying clothing to sailors, or the owner of such a shop.","examples":[{"sentence":"The sailors grumbled about the high prices at the slop-seller's shop near the docks.","translation":"船乗りたちは、波止場近くの海軍御用達衣料品店の高い値段について不平を言った。"},{"sentence":"Many a slop-seller made a fortune outfitting ships' crews.","translation":"多くの海軍御用達衣料品店の店主が、船の乗組員に衣料品を供給して財を成した。"}],"collocations":["naval clothing","sailors' attire","dockside shop"],"synonyms":["purveyor of sailors' clothing","ship's chandler (sometimes, for broader supplies)"],"antonyms":["luxury goods provider","high-fashion designer"]}],"etymology":{"value":"'Slop' refers to cheap, ready-made clothing, especially for sailors. 'Seller' is simply someone who sells.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈslɒpˌsɛlər/","syllables":"slop-sel-ler"},"inflection":{"noun_plural":"slop-sellers"},"usage_notes":{"explanation":"The term 'slop-seller' carries a negative connotation, implying that the goods sold are of poor quality and the seller may be dishonest. It's an archaic term, not commonly used in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought my suit at a slop-seller and it was very expensive.","correct":"✓ I bought my suit at a slop-seller, but it was very cheap.","note":"'Slop-seller' implies cheapness, so it's contradictory to say the goods were expensive."}],"priority":"★☆☆"},"related_words":{"derivatives":["slop (noun: watery or unappetizing food; cheap ready-made clothing)"],"phrases":["slop shop (similar meaning to slop-seller)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency - an archaic term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Slop-seller' is an archaic and derogatory term for a shopkeeper who sells cheap, ready-made clothing, particularly to sailors. Its use implies low quality and potentially dishonest business practices. The term is rarely encountered in modern English. Understanding it requires familiarity with historical contexts and vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The desperate sailor had no choice but to buy his clothes from the slop-seller.","translation":"その絶望的な船乗りは、安物衣料品店から服を買うしかなかった。","type":"general","meaning_category":"cheap clothing seller"},{"sentence":"The slop-seller's wares were known for their poor stitching and flimsy fabric.","translation":"その安物衣料品店の品物は、縫製が悪く、生地が薄っぺらなことで知られていた。","type":"general","meaning_category":"cheap clothing seller"}]}