{"word":"leistering","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主にスコットランド) 三叉の銛を使った魚獲り","english_definition":"(chiefly Scotland) The act or practice of fishing with a leister (a three-pronged spear).","examples":[{"sentence":"Leistering was once a common method of catching salmon in Scottish rivers.","translation":"かつて、スコットランドの川では、三叉の銛を使った魚獲りがサケを捕る一般的な方法でした。"}],"collocations":[],"synonyms":["spearfishing"],"antonyms":[]},{"part_of_speech":"verb","definition":"(主にスコットランド) 三叉の銛で魚を獲る (leisterの現在分詞)","english_definition":"(chiefly Scotland) Present participle of leister: to fish with a leister (a three-pronged spear).","examples":[{"sentence":"He was leistering for salmon in the river.","translation":"彼は川で三叉の銛を使ってサケを獲っていました。"}],"collocations":[],"synonyms":["spearfishing"],"antonyms":[]}],"etymology":{"value":"Derived from the noun 'leister,' referring to the three-pronged spear used for fishing.","priority":"★★★"},"pronunciation":{"ipa":"/ˈliːstərɪŋ/","syllables":"leis-ter-ing"},"inflection":{"noun_plural":null,"verb_forms":{"present_simple":null,"past_simple":null,"past_participle":null,"present_participle":"leistering"}},"usage_notes":{"explanation":"'Leistering' specifically refers to the method of fishing using a 'leister,' which is a type of three-pronged spear. This term is most commonly used in Scotland and is relatively uncommon elsewhere. It can be used as a noun to describe the activity itself or as a verb (present participle) to describe the act of fishing with a leister.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["leister (noun): a three-pronged spear used for fishing"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'leistering' is highly specialized and primarily used in Scottish contexts related to traditional fishing methods. Understanding requires knowledge of archaic or regional fishing techniques. Due to its limited usage, it is not typically encountered in general English conversation or writing."},"example_sentences":[{"sentence":"The old man reminisced about his days leistering on the River Spey.","translation":"その老人はスペイ川で三叉の銛を使って魚を獲っていた日々を懐かしんだ。","type":"verb (present participle)","meaning_category":"fishing"},{"sentence":"Leistering requires skill and a deep understanding of the river's currents.","translation":"三叉の銛を使った魚獲りには、技術と川の流れに対する深い理解が必要です。","type":"noun","meaning_category":"fishing"}]}