{"word":"Phenetidin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"フェネチジン：かつて解熱鎮痛剤として使用された有機化合物。現在は毒性が高いため使用されていない。","english_definition":"An organic compound formerly used as an analgesic (pain reliever) and antipyretic (fever reducer). Its use has been discontinued due to its toxicity.","examples":[{"sentence":"Phenetidin was once a common ingredient in pain medications.","translation":"フェネチジンはかつて鎮痛剤の一般的な成分でした。"},{"sentence":"The use of phenetidin has been linked to certain health risks.","translation":"フェネチジンの使用は特定の健康リスクと関連付けられています。"}],"collocations":["phenetidin derivative","phenetidin synthesis","phenetidin toxicity"],"synonyms":["acetophenetidin","paracetamol precursor"],"antonyms":[]}],"etymology":{"value":"Derived from phenol and ethyl groups, indicating its chemical structure.","priority":"★☆☆"},"pronunciation":{"ipa":"/fɪˈnɛtɪdɪn/","syllables":"phe-net-i-din"},"inflection":{"noun_plural":"phenetidins"},"usage_notes":{"explanation":"Phenetidin is a chemical compound with a history of medical use, but it is now largely obsolete due to safety concerns. It's primarily encountered in historical contexts or in discussions of pharmaceutical chemistry.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Phenetidin is a safe alternative to aspirin.","correct":"✓ Phenetidin is not a safe alternative to aspirin.","note":"Phenetidin is no longer considered safe for use. It is associated with health risks."}],"priority":"★☆☆"},"related_words":{"derivatives":["acetophenetidin (phenacetin)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Phenetidin' is a technical term primarily encountered in chemistry or medical contexts. Understanding requires familiarity with organic chemistry and pharmaceutical history. It is not a word used in general conversation."},"example_sentences":[{"sentence":"The synthesis of phenetidin involves several chemical steps.","translation":"フェネチジンの合成にはいくつかの化学的ステップが含まれます。","type":"noun","meaning_category":"chemical synthesis"},{"sentence":"Research showed that prolonged exposure to phenetidin could lead to adverse effects.","translation":"研究は、フェネチジンへの長期暴露が有害な影響につながる可能性があることを示しました。","type":"noun","meaning_category":"toxicity"}]}