{"word":"Overletting","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"The act of letting (renting) property for a rent higher than that which the tenant pays to the landlord.","english_definition":"The act of subletting a property at a higher rent than the original tenant pays.","examples":[{"sentence":"The contract forbade overletting of the apartment.","translation":"契約では、アパートの又貸しで元の賃料より高い賃料を取ることは禁じられていた。"},{"sentence":"Overletting is a common practice in areas with high rental demand.","translation":"又貸しで元の賃料より高い賃料を取ることは、賃貸需要の高い地域では一般的な慣行である。"}],"collocations":["illegal overletting","prohibition of overletting","practice of overletting"],"synonyms":["subletting","subleasing"],"antonyms":["underletting"],"notes":"Often considered unethical or illegal if not permitted by the original lease agreement."}],"etymology":{"value":"Derived from 'over-' (meaning above or exceeding) and 'letting' (the act of renting out property).","priority":"★★☆"},"pronunciation":{"ipa":"ˌoʊvərˈlɛtɪŋ","syllables":"o-ver-let-ting"},"inflection":{"noun_plural":"overlettings"},"usage_notes":{"explanation":"'Overletting' specifically refers to the practice of a tenant subletting a property for more than they pay in rent. This differs from simply subletting, which doesn't necessarily involve a profit for the tenant. The legality and acceptability of overletting depend on the terms of the original lease agreement and local laws.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The overletting was done without the landlord's knowledge.","correct":"✓ The subletting was done without the landlord's knowledge.","note":"Use 'subletting' if the focus is on the act of renting to someone else, regardless of the price. Use 'overletting' to specifically emphasize that the rent charged was higher than the original rent."}],"priority":"★☆☆"},"related_words":{"derivatives":["overlet (verb): to sublet at a higher rent","letting (noun): the act of renting out property","sublet (verb): to rent out property one is already renting"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Rare","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Overletting' is a specialized term related to real estate and rental agreements. It describes a specific situation where a tenant rents out a property they are renting at a higher price than they pay to the original landlord. Understanding this term requires familiarity with property law and rental practices. It's not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The tenant was caught overletting the apartment on Airbnb.","translation":"そのテナントはAirbnbでアパートを又貸しし、元の賃料より高い賃料を取っていたところを捕まった。","type":"noun","meaning_category":"Renting property at a higher rent"},{"sentence":"The lease agreement explicitly prohibits overletting.","translation":"賃貸契約書には、又貸しで元の賃料より高い賃料を取ることを明確に禁じている。","type":"noun","meaning_category":"Renting property at a higher rent"}]}