{"word":"amateurs","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"素人、アマチュア (複数形)","english_definition":"plural of amateur: a person who engages in a pursuit, especially a sport, on an unpaid basis.","examples":[{"sentence":"The competition was open to both professionals and amateurs.","translation":"その競技会はプロとアマチュアの両方に開放されていた。"},{"sentence":"The amateurs played with enthusiasm, but lacked the skill of the professionals.","translation":"アマチュアたちは熱意を持ってプレーしたが、プロの技術には及ばなかった。"},{"sentence":"He started as an amateur photographer, but now he's making a living from it.","translation":"彼はアマチュア写真家としてスタートしたが、今ではそれで生計を立てている。"}],"collocations":["group of amateurs (アマチュアの集団)","team of amateurs (アマチュアのチーム)","compete against amateurs (アマチュアと競争する)","professional vs. amateurs (プロ対アマチュア)"],"synonyms":["nonprofessionals","laypersons","dilettantes","novices","beginners"],"antonyms":["professionals","experts","veterans"]},{"part_of_speech":"noun","definition":"未熟な人たち、下手な人たち (軽蔑的な意味合いを含む)","english_definition":"people who are unskilled or inept in a particular activity; often used in a derogatory way.","examples":[{"sentence":"This project was clearly done by amateurs.","translation":"このプロジェクトは明らかに素人がやったものだ。"},{"sentence":"The security system was so poorly designed, it looked like it was created by amateurs.","translation":"そのセキュリティシステムは非常に粗末な設計で、まるで素人が作ったかのようだった。"},{"sentence":"Don't trust them with that task; they're just a bunch of amateurs.","translation":"彼らにその仕事を任せるな。彼らはただの素人集団だ。"}],"collocations":["bunch of amateurs (素人集団)","group of amateurs (未熟な人々の集団)","amateur hour (素人丸出しの時間、下手なことばかりが起こる状況)"],"synonyms":["inexperienced people","unskilled people","bunglers","clumsy people","incompetents"],"antonyms":["experts","professionals","skilled workers"]}],"etymology":{"value":"Derived from the French word 'amateur,' which comes from the Latin 'amator,' meaning 'lover' or 'one who loves.' Originally referred to someone who pursued an activity for the love of it, rather than for financial gain.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈæmətərz/","syllables":"am-a-teurs"},"inflection":{"noun_plural":"amateurs"},"usage_notes":{"explanation":"The word 'amateurs' has two primary meanings. The first refers to individuals who participate in an activity, often sports or arts, without receiving payment. This is the more neutral and common usage. The second meaning is derogatory, implying that someone is unskilled or incompetent. The context usually makes it clear which meaning is intended. Be mindful of the potential for offense when using 'amateurs' in a negative way.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an amateurs.","correct":"✓ He is an amateur.","note":"'Amateur' is a countable noun, so it needs an article ('a' or 'an') in the singular form. 'Amateurs' is the plural form."},{"incorrect":"✗ They are amateurs in the good way.","correct":"✓ They are amateurs in the positive sense. / ✓ They are amateurs in the original sense, meaning they do it for the love of it.","note":"When clarifying that you're using 'amateurs' in the non-derogatory sense, it's better to use phrases like 'positive sense' or 'original sense' rather than 'good way'."},{"incorrect":"✗ The work was done by a amateur.","correct":"✓ The work was done by an amateur.","note":"Use 'an' before words that begin with a vowel sound."}],"priority":"★★☆"},"related_words":{"derivatives":["amateur (noun, adjective)","amateurish (adjective)","amateurism (noun)"],"idioms_phrases":["amateur hour (a situation characterized by mistakes and incompetence)"],"priority":"★★★"},"level_frequency":{"CEFR":"B1","frequency_google_ngram":"Moderately frequent.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"'Amateurs' refers to people who do something for enjoyment, not as a job. It can also be used negatively to describe someone who is not skilled at something. The meaning depends on the context. If you're talking about sports, it usually means people who aren't paid to play. If you're talking about the quality of work, it can mean that the work is poorly done."},"example_sentences":[{"sentence":"The local theater group is made up of talented amateurs.","translation":"その地元の劇団は才能のあるアマチュアたちで構成されている。","type":"noun","meaning_category":"non-professional participants"},{"sentence":"The project looked like it was designed by amateurs.","translation":"そのプロジェクトは素人が設計したように見えた。","type":"noun","meaning_category":"unskilled people"},{"sentence":"The competition is a great opportunity for amateurs to showcase their skills.","translation":"その競技会はアマチュアが彼らのスキルを披露する絶好の機会だ。","type":"noun","meaning_category":"non-professional participants"},{"sentence":"The security at the event was so lax, it felt like it was run by amateurs.","translation":"イベントの警備は非常に緩く、まるで素人が運営しているように感じられた。","type":"noun","meaning_category":"unskilled people"}]}