{"word":"Regelation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"再凍結; 圧力によって融解した氷が、圧力が取り除かれると再び凍結する現象","english_definition":"The phenomenon of melting under pressure and freezing again when the pressure is removed.","examples":[{"sentence":"Regelation is responsible for the movement of glaciers.","translation":"再凍結は氷河の移動の原因となる。"},{"sentence":"The regelation process allows ice skates to glide on ice.","translation":"再凍結の過程により、アイススケートは氷上を滑ることができる。"}],"collocations":["glacier regelation","ice regelation","regelation process"],"synonyms":["refreezing","thaw-freeze"],"antonyms":["melting"]},{"part_of_speech":"noun","definition":"(より一般的に) 融解と再凍結のプロセス","english_definition":"(More generally) the process of melting and refreezing.","examples":[{"sentence":"The regelation of snow can lead to the formation of ice layers.","translation":"雪の再凍結は氷の層の形成につながることがある。"}],"collocations":["snow regelation"],"synonyms":["freeze-thaw cycle","melt-freeze cycle"],"antonyms":[]}],"etymology":{"value":"Derived from Latin *re-* (again) + *gelare* (to freeze). Coined in the mid-19th century.","priority":"★★★"},"pronunciation":{"ipa":"/ˌriːdʒɪˈleɪʃən/","syllables":"Re-ge-la-tion"},"inflection":{"noun_plural":"regelations"},"usage_notes":{"explanation":"Regelation is a scientific term primarily used in physics and glaciology. It refers specifically to the phenomenon where ice melts under pressure and refreezes when the pressure is reduced. This process is crucial in understanding the movement of glaciers and the properties of ice. The term can also be used more broadly to describe any melting and refreezing cycle, particularly in the context of snow and ice.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The regelation caused the water to boil.","correct":"✓ The regelation caused the ice to refreeze.","note":"Regelation involves melting and refreezing, not boiling."},{"incorrect":"✗ Regelation only happens in the summer.","correct":"✓ Regelation can happen whenever there is pressure on ice, regardless of the season.","note":"Regelation is dependent on pressure, not just temperature."}],"priority":"★★☆"},"related_words":{"derivatives":["regelate (verb, rare)"],"phrasal_verbs":[],"related_scientific_terms":["pressure melting","glaciology","cryology"]},"level_frequency":{"CEFR":"C2 (specialized scientific vocabulary)","frequency_google_ngram":"Low frequency. Primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Regelation' is a technical term used in physics and earth sciences, especially in glaciology. It describes the process where ice melts under pressure and then refreezes when the pressure is reduced. This is important for understanding how glaciers move. It's not an everyday word and is mainly found in scientific discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The glacier's movement is facilitated by regelation at its base.","translation":"氷河の動きは、その基底での再凍結によって促進される。","type":"scientific","meaning_category":"glaciology"},{"sentence":"Regelation explains why ice skates can glide smoothly on ice.","translation":"再凍結は、なぜアイススケートが氷上をスムーズに滑ることができるのかを説明する。","type":"scientific","meaning_category":"physics"},{"sentence":"The regelation process contributes to the formation of dense ice layers in snowpacks.","translation":"再凍結の過程は、積雪における高密度の氷の層の形成に寄与する。","type":"scientific","meaning_category":"meteorology"}]}