{"word":"neurobiology","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"神経生物学","english_definition":"the branch of biology that deals with the anatomy, physiology, and pathology of the nervous system.","examples":[{"sentence":"Neurobiology is a rapidly advancing field of study.","translation":"神経生物学は急速に進歩している研究分野です。"},{"sentence":"Her research focuses on the neurobiology of learning and memory.","translation":"彼女の研究は学習と記憶の神経生物学に焦点を当てています。"},{"sentence":"The course covers the basic principles of neurobiology.","translation":"その講座では神経生物学の基本原理を扱います。"}],"collocations":["molecular neurobiology (分子神経生物学)","cellular neurobiology (細胞神経生物学)","behavioral neurobiology (行動神経生物学)","developmental neurobiology (発達神経生物学)","cognitive neurobiology (認知神経生物学)"],"synonyms":["neural biology","brain science","neuroscience"],"antonyms":[]}],"etymology":{"value":"\"neuro-\" (神経) + \"biology\" (生物学)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnʊroʊbaɪˈɒlədʒi/","syllables":"neu-ro-bi-ol-o-gy"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Neurobiology is a subdiscipline of neuroscience that focuses on the biology of the nervous system. It encompasses the study of neurons, glial cells, synapses, and neural circuits, as well as their development, function, and disorders. It often involves molecular, cellular, and physiological approaches. While neuroscience is a broader term that includes psychology, computer science, and other fields, neurobiology is specifically rooted in biological principles.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am studying neurobiology, it is very interesting.","correct":"✓ I am studying neurobiology; it is very interesting. / ✓ I am studying neurobiology. It is very interesting.","note":"When connecting two independent clauses, use a semicolon or separate them into two sentences."},{"incorrect":"✗ Neurobiology are a fascinating subject.","correct":"✓ Neurobiology is a fascinating subject.","note":"Neurobiology is a singular noun, so it takes a singular verb."}],"priority":"★★☆"},"related_words":{"derivatives":["neurobiological (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Neurobiology is a specialized term used in scientific and academic contexts. Understanding requires familiarity with basic biological and neurological concepts. The word itself is relatively long and complex, reflecting the complexity of the field it describes."},"example_sentences":[{"sentence":"Advances in neurobiology are providing new insights into the causes of mental illness.","translation":"神経生物学の進歩は、精神疾患の原因に関する新たな洞察を提供しています。","type":"general","meaning_category":"general"},{"sentence":"The neurobiology of pain involves complex interactions between the peripheral and central nervous systems.","translation":"痛みの神経生物学は、末梢神経系と中枢神経系の複雑な相互作用を含みます。","type":"specific","meaning_category":"specific research area"},{"sentence":"She is a professor of neurobiology at Harvard University.","translation":"彼女はハーバード大学の神経生物学の教授です。","type":"professional","meaning_category":"professional context"}]}