{"word":"mealproof","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Resistant to damage or staining from food or drink; designed to withstand exposure to meals without being harmed.","english_definition":"Designed to resist damage or staining from food or drink.","examples":[{"sentence":"The new tablecloth is mealproof, so spills are no problem.","translation":"その新しいテーブルクロスは食事に強く、こぼれても問題ありません。"},{"sentence":"This coating makes the surface mealproof and easy to clean.","translation":"このコーティングは表面を食事に強くし、掃除を簡単にします。"}],"collocations":["mealproof tablecloth","mealproof coating","mealproof finish","mealproof surface"],"synonyms":["stain-resistant","food-safe","durable","protective"],"antonyms":["vulnerable","susceptible","non-resistant"]}],"etymology":{"value":"A compound word formed by combining 'meal' (referring to food or a dining occasion) and 'proof' (meaning resistant or impervious to something).","priority":"N/A"},"pronunciation":{"ipa":"/ˈmiːl.pruːf/","syllables":"meal-proof"},"inflection":{"notes":"Since it is an adjective, it can be used in comparative and superlative forms, though they are not common: more mealproof, most mealproof."},"usage_notes":{"explanation":"'Mealproof' is a relatively uncommon word, primarily used in marketing or product descriptions to highlight a product's ability to withstand exposure to food and drink without being damaged or stained. It suggests durability and ease of cleaning.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The mealproof of the table is excellent.","correct":"✓ The mealproof quality of the table is excellent. / ✓ The table is mealproof.","note":"'Mealproof' is an adjective, not a noun. To refer to the property of being mealproof, use 'mealproof quality' or rephrase the sentence."}],"priority":"N/A"},"related_words":{"derivatives":["None commonly used."],"phrasal_verbs":["None"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - not a common word.","priority":"N/A"},"readability_explanation":{"level":"B2","text":"'Mealproof' is a compound adjective indicating resistance to damage or staining from food and drink. It is typically used in product descriptions to emphasize durability and ease of maintenance, particularly for items like tablecloths, placemats, or furniture finishes. Understanding the word requires familiarity with the individual components ('meal' and 'proof') and their combined meaning in a specific context."},"example_sentences":[{"sentence":"The restaurant uses mealproof placemats to protect the tables from spills.","translation":"そのレストランでは、テーブルをこぼれから守るために、食事に強いプレースマットを使用しています。","type":"adjective","meaning_category":"Resistant to food damage"},{"sentence":"This new coating makes the kitchen countertop mealproof and easy to wipe clean.","translation":"この新しいコーティングは、キッチンのカウンタートップを食事に強く、拭き掃除を簡単にします。","type":"adjective","meaning_category":"Resistant to food damage"}]}