{"word":"Discoplasm","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(心霊主義)霊媒を通して現れるとされる、不定形の、しばしば発光する物質。","english_definition":"(Spiritualism) A substance, often luminous, said to emanate from a medium during a séance and to be capable of forming into various shapes and figures.","examples":[{"sentence":"The discoplasm supposedly formed the shape of a deceased relative.","translation":"そのディスコプラズムは、亡くなった親戚の形になったとされている。"},{"sentence":"Skeptics argue that discoplasm is merely cheesecloth or other materials used to fake paranormal phenomena.","translation":"懐疑論者たちは、ディスコプラズムは単なるチーズクロスや、超常現象を偽装するために使われる他の材料にすぎないと主張している。"}],"collocations":["form discoplasm","ectoplasmic material","spiritualistic medium"],"synonyms":["ectoplasm","teleplasm"],"antonyms":[]}],"etymology":{"value":"「disco-」(円盤) + 「-plasm」(形成物) の合成語。心霊主義において、円盤状の形状を形成することがあるとされたため。","priority":"★★★"},"pronunciation":{"ipa":"/ˈdɪskoʊˌplæzəm/","syllables":"Dis-co-plasm"},"inflection":{"noun_plural":"discoplasms"},"usage_notes":{"explanation":"「Discoplasm」は、心霊主義の文脈でのみ使用される専門用語です。現代では、心霊主義自体が科学的な根拠を欠くと見なされているため、この単語の使用頻度は非常に低いです。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The scientist studied the discoplasm under a microscope.","correct":"✓ The spiritualists claimed to observe discoplasm during the séance.","note":"「Discoplasm」は科学的な研究対象ではなく、心霊主義の信念体系の一部です。"},{"incorrect":"✗ Discoplasm is a type of cell found in the human body.","correct":"✓ Discoplasm is a substance claimed to be produced by mediums during séances.","note":"「Discoplasm」は生物学的な用語ではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":["discoplasmic (形容詞)"],"phrasal_verbs":[],"related_terms":["ectoplasm","medium","séance","spiritualism","teleplasm"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (非常に専門的な用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「Discoplasm」は、心霊主義という特定の分野でのみ使われる非常に特殊な単語です。心霊主義とは、死者の霊と交信できると信じる人々の間で発展した信仰体系です。この単語は、霊媒（霊との交信を仲介する人）を通して現れるとされる、不定形で発光することもある物質を指します。現代では、心霊主義自体が科学的な根拠を欠くと考えられているため、この単語が使われることはほとんどありません。したがって、この単語を理解する必要があるのは、心霊主義の歴史や関連文献を研究するような、ごく限られた状況に限られます。"},"example_sentences":[{"sentence":"During the séance, the medium claimed that discoplasm was emerging from her body.","translation":"降霊会中、霊媒はディスコプラズムが彼女の体から現れていると主張した。","type":"noun","meaning_category":"心霊主義"},{"sentence":"Many early photographs of discoplasm were later proven to be fraudulent.","translation":"ディスコプラズムの初期の写真の多くは、後に詐欺であることが証明された。","type":"noun","meaning_category":"心霊主義"}]}