{"word":"oversocialized","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"社会化されすぎた、社会規範を過剰に内面化した","english_definition":"having internalized societal norms to an excessive degree; excessively conforming to social expectations.","examples":[{"sentence":"He argued that modern individuals are often oversocialized, leading to a suppression of their natural instincts.","translation":"彼は、現代人は社会化されすぎていることが多く、その結果、自然な本能が抑制されていると主張した。"},{"sentence":"An oversocialized individual may experience difficulty expressing their true feelings or desires.","translation":"社会化されすぎた人は、自分の本当の感情や欲求を表現するのが難しいことがある。"},{"sentence":"The concept of the 'oversocialized man' is used to critique the conformist tendencies of modern society.","translation":"「社会化されすぎた人間」という概念は、現代社会の同調主義的な傾向を批判するために用いられる。"}],"collocations":["oversocialized individual","oversocialized society","become oversocialized","the oversocialized man"],"synonyms":["excessively socialized","overly conforming","highly indoctrinated"],"antonyms":["undersocialized","unsocialized","individualistic","nonconformist"]},{"part_of_speech":"adjective","definition":"(特に動物が)人間に慣れすぎた、野生の行動を失った","english_definition":"(especially of an animal) excessively accustomed to humans, having lost wild behaviors.","examples":[{"sentence":"The bear was too oversocialized to be released back into the wild.","translation":"その熊は人間に慣れすぎていて、野生に戻すことができなかった。"},{"sentence":"Oversocialized animals often become dependent on humans for food and shelter.","translation":"人間に慣れすぎた動物は、しばしば食料や住居を人間に依存するようになる。"}],"collocations":["oversocialized bear","oversocialized animal","too oversocialized"],"synonyms":["overly domesticated","human-dependent"],"antonyms":["wild","feral"]}],"etymology":{"value":"「over-」（過剰に）と「socialized」（社会化された）を組み合わせた造語。社会学や心理学の分野で、個人が社会規範や期待を過剰に内面化している状態を表すために用いられる。また、動物行動学の分野では、動物が人間に慣れすぎて野生の行動を失っている状態を指す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊvərˈsoʊʃəlaɪzd/","syllables":"o-ver-so-cial-ized"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"「**oversocialized**」は、主に社会学、心理学、動物行動学の分野で使用される専門用語です。社会学や心理学では、個人が社会の規範や期待を過剰に内面化し、自己の個性や自律性を失っている状態を指します。この概念は、社会の同調圧力や画一化を批判する文脈で用いられることがあります。動物行動学では、動物が人間に慣れすぎて、野生の行動を失い、人間の保護なしには生き残れない状態を指します。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a very socialized person.","correct":"✓ He is a very sociable person. / ✓ He is a well-socialized person.","note":"「socialized」は「社会化された」という意味で、社会規範を身につけていることを指します。「社交的な」という意味で使いたい場合は「sociable」を使います。また、「well-socialized」は「社会性が高い」という意味で使えます。"},{"incorrect":"✗ The oversocialized bear was very friendly with humans. So it is good.","correct":"✓ The oversocialized bear was very friendly with humans, which is problematic because it can't survive in wild.","note":"動物が人間に慣れすぎることは、必ずしも良いことではありません。野生で生き残る能力を失う可能性があるため、問題視されることがあります。"}],"priority":"★★☆"},"related_words":{"derivatives":["oversocialization (名詞: 社会化過剰)"],"related_concepts":["socialization","conformity","individuality","autonomy","wildness","domestication"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - 専門分野で使われる用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**oversocialized**」は、社会学や心理学で使われる言葉で、人が社会のルールや考え方を強く受け入れすぎて、自分の考えや気持ちをあまり出せなくなる状態を言います。例えば、周りの人に合わせすぎて、自分の本当にやりたいことが分からなくなるような場合に使われます。また、動物が人間に慣れすぎて、野生で生きるための行動を忘れてしまうことにも使われます。少し難しい言葉ですが、社会や人間関係について考えるときに役立つ言葉です。"},"example_sentences":[{"sentence":"The author argues that modern education systems can lead to oversocialized students who lack critical thinking skills.","translation":"著者は、現代の教育システムは、批判的思考スキルを欠いた社会化されすぎた学生を生み出す可能性があると主張している。","type":"adjective","meaning_category":"社会規範を過剰に内面化した"},{"sentence":"The rescued wolf pup was too oversocialized to be released back into its natural habitat.","translation":"救助されたオオカミの子供は、人間に慣れすぎていて、自然の生息地に戻すことができなかった。","type":"adjective","meaning_category":"人間に慣れすぎた"}]}