{"word":"Dehradun","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"デヘラードゥーン：インドのウッタラーカンド州にある都市。","english_definition":"A city in the state of Uttarakhand, India. It is the winter capital of the state and a popular tourist destination known for its scenic beauty and educational institutions.","examples":[{"sentence":"Dehradun is known for its pleasant climate.","translation":"デヘラードゥーンは過ごしやすい気候で知られています。"},{"sentence":"Many prestigious schools are located in Dehradun.","translation":"多くの名門校がデヘラードゥーンにあります。"},{"sentence":"We visited Robber's Cave during our trip to Dehradun.","translation":"デヘラードゥーンへの旅行中に、私たちはロバーズ・ケーブを訪れました。"}],"collocations":["visit Dehradun","Dehradun city","schools in Dehradun","climate of Dehradun"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name Dehradun is derived from 'Dehra', referring to the 'dera' or camp established by Guru Ram Rai, and 'Dun', a term for the valley located between the Himalayas and the Shivalik Ranges.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdeɪdəˈduːn/","syllables":"Deh-ra-dun"},"inflection":{"notes":"Proper noun, no plural form."},"usage_notes":{"explanation":"Dehradun is a proper noun referring to a specific city in India. It's often used in the context of travel, education, or geography.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I am going to the Dehradun.","correct":"✓ I am going to Dehradun.","note":"No article 'the' is needed before the name of the city."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_places":["Mussoorie (nearby hill station)","Rishikesh (nearby city)","Uttarakhand (state)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, specific to geographical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"Dehradun is a proper noun, referring to a specific city in India. It is generally encountered in travel writing, geographical discussions, or when discussing Indian culture and education. The word itself is not complex, but understanding its context requires some familiarity with Indian geography."},"example_sentences":[{"sentence":"The Doon School is a famous boarding school in Dehradun.","translation":"ドゥーン・スクールはデヘラードゥーンにある有名な寄宿学校です。","type":"example","meaning_category":"location"},{"sentence":"Dehradun is the winter capital of Uttarakhand.","translation":"デヘラードゥーンはウッタラーカンド州の冬の首都です。","type":"example","meaning_category":"location"},{"sentence":"We plan to spend a week in Dehradun exploring its natural beauty.","translation":"私たちはデヘラードゥーンで1週間過ごし、その自然の美しさを探索する予定です。","type":"example","meaning_category":"travel"}]}