{"word":"Canadianisms","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"カナダ英語特有の単語、句、発音、綴り、またはその他の言語的特徴。","english_definition":"Words, phrases, pronunciations, spellings, or other linguistic features that are characteristic of Canadian English.","examples":[{"sentence":"\"Eh\" is one of the most well-known Canadianisms.","translation":"\"Eh\"は最もよく知られたカナダ英語特有の表現の一つです。"},{"sentence":"The use of \"zed\" instead of \"zee\" for the letter Z is a Canadianism.","translation":"文字Zに対して\"zee\"の代わりに\"zed\"を使うのはカナダ英語特有の表現です。"},{"sentence":"Many Canadianisms are influenced by British English and French.","translation":"多くのカナダ英語特有の表現は、イギリス英語とフランス語の影響を受けています。"}],"collocations":["identify a Canadianism","common Canadianisms","list of Canadianisms","examples of Canadianisms"],"synonyms":["Canadian English","Canadian dialect","CanE"],"antonyms":["Americanism","Britishism"]}],"etymology":{"value":"\"Canadian\" + \"-ism\".","priority":"★☆☆"},"pronunciation":{"ipa":"/kəˈneɪdiənɪzəmz/","syllables":"Ca-na-di-an-is-ms"},"inflection":{"noun_plural":"Canadianisms"},"usage_notes":{"explanation":"Canadianisms are linguistic features unique to or particularly common in Canadian English. They can include words not used in other English-speaking countries, distinct pronunciations, or spellings that differ from both American and British English. The term is used to identify and study these unique aspects of Canadian language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Using American slang is a Canadianism.","correct":"✓ Using \"chesterfield\" to refer to a sofa is a Canadianism.","note":"Canadianisms are specific to Canadian English, not general American slang."},{"incorrect":"✗ All Canadians use every Canadianism.","correct":"✓ Not all Canadians use every Canadianism; usage varies by region and social group.","note":"Usage of specific Canadianisms can vary across different regions and social groups within Canada."}],"priority":"★☆☆"},"related_words":{"derivatives":["Canadian English","CanE","Canadian"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Canadianisms\" refers to words, phrases, pronunciations, or spellings that are unique to or commonly used in Canadian English. Understanding this term requires familiarity with the concept of regional dialects and linguistic variations. It's used in discussions about language and cultural identity in Canada."},"example_sentences":[{"sentence":"Studying Canadianisms can provide insights into the cultural history of Canada.","translation":"カナダ英語特有の表現を研究することで、カナダの文化史に関する洞察を得ることができます。","type":"noun","meaning_category":"linguistic features"},{"sentence":"The professor gave a lecture on the origins of various Canadianisms.","translation":"教授は様々なカナダ英語特有の表現の起源について講義をしました。","type":"noun","meaning_category":"linguistic features"},{"sentence":"Many people find Canadianisms charming and distinctive.","translation":"多くの人々はカナダ英語特有の表現を魅力的で独特だと感じています。","type":"noun","meaning_category":"linguistic features"}]}