{"word":"golliwogs","priority":"低","meanings":[{"part_of_speech":"noun","definition":"(侮蔑的) ゴリウォーグ人形 (黒い顔、ぼさぼさの黒髪、赤い唇が特徴の人形。人種差別的ステレオタイプとみなされることが多い)","english_definition":"(offensive) a type of rag doll with a black face, frizzy hair, and red lips, regarded as a racist stereotype.","examples":[{"sentence":"Golliwogs were once popular children's toys, but are now considered offensive.","translation":"ゴリウォーグ人形はかつて子供たちに人気のおもちゃでしたが、現在では侮蔑的であると考えられています。"},{"sentence":"The shop removed golliwogs from its shelves after complaints.","translation":"その店は苦情を受けてゴリウォーグ人形を棚から撤去しました。"}],"collocations":["golliwog doll","golliwog image","golliwog toy"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"もともとはフローレンス・ケイト・アプトン (Florence Kate Upton) が1895年に出版した子供向けの本に登場するキャラクターの名前。アプトンは、アメリカで黒人の顔を描いたミンストレルショーに影響を受け、このキャラクターを作り出したと言われている。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡɒliwɒɡz/","syllables":"gol-li-wogs"},"inflection":{"noun_plural":"golliwogs"},"usage_notes":{"explanation":"「**golliwog**」は、黒い顔、ぼさぼさの黒髪、赤い唇が特徴的な人形を指す言葉です。元々は子供向けの本のキャラクターでしたが、その外見が人種差別的なステレオタイプを連想させるため、現在では非常に侮蔑的な言葉とみなされています。公共の場や商品などで使用することは避けるべきです。この言葉を使うことは、多くの人々を傷つけ、不快にさせる可能性があります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He collected golliwogs because they were cute.","correct":"✓ He collected golliwog dolls, unaware of their racist connotations. / ✓ He collected antique dolls.","note":"ゴリウォーグ人形を「かわいい」という理由で集めることは、人種差別的な意味合いを無視していると解釈される可能性があります。人形のコレクションについて言及する場合は、人種的な意味合いに注意するか、単に「antique dolls (アンティーク人形)」と表現する方が適切です。"},{"incorrect":"✗ The shop sold golliwogs to celebrate diversity.","correct":"✓ The shop sold diverse range of dolls to celebrate diversity.","note":"ゴリウォーグ人形を多様性を祝うために販売することは不適切です。多様性を祝うためには、様々な人種や文化を尊重する人形を販売する方が適切です。"}],"priority":"★★★"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["racism","stereotype","blackface","minstrel show"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (歴史的文脈または人種差別に関する議論でのみ使用される可能性が高い)","frequency_google_ngram":"非常に低い頻度 (Very low frequency) - 日常会話ではほとんど使用されない。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**golliwog**」は、黒い顔、ぼさぼさの髪、赤い唇を持つ人形を指す言葉ですが、非常に侮蔑的な意味合いを持つため、使用は避けるべきです。この言葉は、人種差別的なステレオタイプを連想させ、多くの人々を傷つける可能性があります。歴史的な文脈や人種差別に関する議論以外では、使用されることはほとんどありません。もし人形について言及する必要がある場合は、単に「doll (人形)」と表現するか、より具体的な説明を加える方が適切です。"},"example_sentences":[{"sentence":"The use of **golliwogs** in advertising has been widely condemned.","translation":"広告におけるゴリウォーグ人形の使用は広く非難されています。","type":"noun","meaning_category":"侮蔑的な人形"},{"sentence":"Many people find **golliwogs** to be offensive due to their racist connotations.","translation":"多くの人々は、ゴリウォーグ人形が人種差別的な意味合いを持つため、侮辱的であると感じています。","type":"noun","meaning_category":"侮蔑的な人形"},{"sentence":"The museum displayed a collection of antique dolls, including a **golliwog**.","translation":"博物館は、ゴリウォーグ人形を含むアンティーク人形のコレクションを展示しました。（ただし、展示の文脈と意図が重要）","type":"noun","meaning_category":"侮蔑的な人形"}]}