{"word":"avanters","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"plural of avanter (archaic term for a boastful person, braggart)","english_definition":"plural form of avanter, an archaic term for a boastful person or braggart.","examples":[{"sentence":"The play featured a group of avanters, each trying to outdo the other in their exaggerated tales.","translation":"その劇には、大げさな話で互いに負けじと張り合う、自慢屋の一団が登場した。"}],"collocations":[],"synonyms":["braggarts","boasters","swaggerers"],"antonyms":[],"notes":"The term 'avanter' and its plural form 'avanters' are rarely used in modern English. It primarily appears in historical texts or when attempting to emulate archaic language."}],"etymology":{"value":"Derived from the obsolete verb 'avant,' meaning to boast or brag, which itself comes from Old French 'avanter' (to boast).","priority":"★★☆"},"pronunciation":{"ipa":"/əˈvæntərz/","syllables":"a-van-ters"},"inflection":{"noun_plural":"avanters"},"usage_notes":{"explanation":"'Avanters' is the plural form of the archaic noun 'avanter,' referring to multiple individuals who are boastful or given to bragging. The term is not in common usage today.","priority":"★☆☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["avanter (singular noun)","avant (obsolete verb)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely rare.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Avanters' is a plural noun referring to multiple boastful individuals. The term is archaic and rarely used in modern English, primarily found in historical texts or when intentionally using older language. Understanding requires familiarity with obsolete vocabulary.","note":"This word is very uncommon."},"example_sentences":[{"sentence":"The historical novel depicted a scene filled with avanters, each vying for attention with their tall tales.","translation":"その歴史小説は、ほら話で注目を集めようと競い合う、自慢屋たちで満たされた場面を描写していた。","type":"noun","meaning_category":"boastful people"}]}