{"word":"libertarian","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自由至上主義者、リバタリアン","english_definition":"An advocate or supporter of a political philosophy that advocates individual liberty and minimal government intervention.","examples":[{"sentence":"Libertarians believe in maximizing individual freedom and minimizing government control.","translation":"リバタリアンは、個人の自由を最大限に高め、政府の統制を最小限に抑えることを信条としています。"},{"sentence":"He is a strong libertarian, advocating for free markets and personal responsibility.","translation":"彼は強力なリバタリアンであり、自由市場と個人の責任を提唱しています。"}],"collocations":["classical libertarian","left-libertarian","right-libertarian","anarcho-libertarian","libertarian principles","libertarian party"],"synonyms":["individualist","free marketeer","autonomist"],"antonyms":["statist","collectivist","authoritarian"]},{"part_of_speech":"adjective","definition":"自由至上主義の、リバタリアンの","english_definition":"Relating to or characteristic of libertarianism.","examples":[{"sentence":"The libertarian movement has gained some traction in recent years.","translation":"自由至上主義運動は近年、いくらか勢いを増しています。"},{"sentence":"He holds libertarian views on economic and social issues.","translation":"彼は経済および社会問題について自由至上主義的な見解を持っています。"}],"collocations":["libertarian policies","libertarian philosophy","libertarian ideals","libertarian society","libertarian perspective"],"synonyms":["individualistic","autonomist","free-market"],"antonyms":["statist","collectivist","authoritarian"]}],"etymology":{"value":"The term 'libertarian' emerged in the 18th century, derived from 'liberty'. It was initially used to refer to advocates of free will. In the mid-20th century, it was adopted by proponents of laissez-faire capitalism and minimal government.","priority":"★★★"},"pronunciation":{"ipa":"/ˌlɪbərˈtɛəriən/","syllables":"li-ber-tar-i-an"},"inflection":{"noun_plural":"libertarians","adjective_forms":{}},"usage_notes":{"explanation":"'Libertarian' refers to a political philosophy emphasizing individual freedom, limited government, and free markets. It is often associated with classical liberalism and can encompass a range of views, from minimal state intervention to anarcho-capitalism.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Libertarianism is the same as liberalism.","correct":"Libertarianism shares some similarities with liberalism, but it generally advocates for even less government intervention.","note":"While libertarianism shares roots with liberalism, it typically advocates for a more radical reduction in government power."},{"incorrect":"Libertarians are always right-wing.","correct":"Libertarianism spans the political spectrum, with both right-libertarian and left-libertarian perspectives.","note":"There are different strands of libertarianism, including left-libertarianism, which combines individual liberty with egalitarian social goals."}],"priority":"★★☆"},"related_words":{"derivatives":["libertarianism (noun)","liberty (noun)","liberal (adjective/noun)"],"phrases":["small government","free markets","individual rights","personal responsibility","self-ownership"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, but increasing in recent years.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'libertarian' refers to a political ideology that prioritizes individual liberty and minimal government intervention in economic and social affairs. It is important to understand that libertarianism is not a monolithic ideology and encompasses a range of views. It is often associated with concepts such as free markets, personal responsibility, and limited government. Understanding the nuances of this term requires familiarity with political philosophy and economic theory."},"example_sentences":[{"sentence":"Many libertarians support the legalization of all drugs.","translation":"多くのリバタリアンは、すべての薬物の合法化を支持しています。","type":"noun","meaning_category":"自由至上主義者"},{"sentence":"The party platform reflects a strongly libertarian stance on taxation.","translation":"その政党の政策綱領は、課税に関して非常に自由至上主義的な立場を反映しています。","type":"adjective","meaning_category":"自由至上主義の"},{"sentence":"He identifies as a libertarian and advocates for deregulation.","translation":"彼は自身をリバタリアンと認識しており、規制緩和を提唱しています。","type":"noun","meaning_category":"自由至上主義者"},{"sentence":"The libertarian philosophy emphasizes individual autonomy and freedom of choice.","translation":"自由至上主義の哲学は、個人の自主性と選択の自由を強調しています。","type":"adjective","meaning_category":"自由至上主義の"}]}