{"word":"lontar","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"オウギヤシ (Borassus flabellifer)","english_definition":"A palm tree (Borassus flabellifer), native to the Indian subcontinent and Southeast Asia.","examples":[{"sentence":"The leaves of the lontar palm are used for thatching and weaving.","translation":"オウギヤシの葉は屋根葺きや編み物に使われます。"},{"sentence":"Lontar sap is fermented to make palm wine.","translation":"オウギヤシの樹液は発酵させてヤシ酒を作ります。"}],"collocations":["lontar palm","lontar leaf","lontar sugar","lontar manuscript"],"synonyms":["palmyra palm","toddy palm","sugar palm"],"antonyms":[]},{"part_of_speech":"noun","definition":"オウギヤシの葉に書かれた写本、古文書","english_definition":"A manuscript written on dried palm leaves, especially of the lontar palm, used in South Asia and Southeast Asia.","examples":[{"sentence":"The library holds a collection of ancient lontar manuscripts.","translation":"その図書館は古代のオウギヤシの葉に書かれた写本のコレクションを所蔵しています。"},{"sentence":"Scholars are studying the lontar texts to learn about ancient Javanese culture.","translation":"学者たちは古代ジャワ文化について学ぶために、オウギヤシの葉に書かれた文書を研究しています。"}],"collocations":["lontar manuscript","lontar text","lontar script"],"synonyms":["palm-leaf manuscript"],"antonyms":[]}],"etymology":{"value":"From Malay *lontar*, from Old Javanese *rontal*, from Proto-Malayo-Polynesian *runtas*.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɒntɑː(r)/","syllables":"lon-tar"},"inflection":{"noun_plural":"lontars"},"usage_notes":{"explanation":"The term \"lontar\" refers both to the palm tree itself and to the manuscripts made from its leaves. When referring to the manuscript, it often implies a historical or cultural significance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a lontar in the forest.","correct":"✓ I saw a lontar palm in the forest.","note":"To avoid ambiguity, specify \"lontar palm\" when referring to the tree."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"lontar\" is a specialized term primarily used in the context of South Asian and Southeast Asian studies, particularly concerning the culture, history, and literature of regions where the Borassus flabellifer palm tree is native. It refers both to the palm itself and, more commonly, to the manuscripts inscribed on its dried leaves. Understanding this term requires familiarity with the cultural and historical practices of these regions, making it less common in general English usage."},"example_sentences":[{"sentence":"The ancient **lontar** manuscripts provide valuable insights into Balinese history.","translation":"古代のオウギヤシの写本はバリの歴史に関する貴重な洞察を提供します。","type":"noun","meaning_category":"manuscript"},{"sentence":"The villagers used **lontar** leaves to build their houses.","translation":"村人たちはオウギヤシの葉を使って家を建てました。","type":"noun","meaning_category":"palm tree"}]}