{"word":"kagalingan","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Tagalog) wellness, welfare, well-being, recovery, improvement","english_definition":"the state of being healthy, happy, or prosperous; the process of becoming healthy again; an improvement in condition","examples":[{"sentence":"Ang kagalingan ng mga mamamayan ay tungkulin ng pamahalaan.","translation":"The welfare of the citizens is the duty of the government.","type":"example"},{"sentence":"Nakatutuwang makita ang kanyang kagalingan pagkatapos ng operasyon.","translation":"It's pleasing to see his recovery after the operation.","type":"example"},{"sentence":"Ang ehersisyo ay mahalaga para sa kagalingan ng katawan at isipan.","translation":"Exercise is important for the well-being of the body and mind.","type":"example"}],"collocations":["pangkalahatang kagalingan (general welfare)","kagalingang panlipunan (social welfare)","pagpapabuti ng kagalingan (improving well-being)","kagalingan ng kalusugan (health wellness)"],"synonyms":["kapakanan","kabutihan","kalusugan","ginhawa","pagbuti"],"antonyms":["karamdaman","kapighatian","kasamaan"]},{"part_of_speech":"noun","definition":"(Tagalog, archaic) skill, expertise, proficiency","english_definition":"the quality of having great skill or knowledge in a particular area.","examples":[{"sentence":"Ipinakita niya ang kanyang kagalingan sa pagtugtog ng piyano.","translation":"He showed his skill in playing the piano.","type":"example"},{"sentence":"Ang kagalingan niya sa matematika ay kahanga-hanga.","translation":"His expertise in mathematics is admirable.","type":"example"}],"collocations":["kagalingan sa sining (skill in art)","kagalingan sa musika (skill in music)","kagalingan sa pagluluto (skill in cooking)"],"synonyms":["kahusayan","kasanayan","talino","galing","abilidad"],"antonyms":["kamangmangan","kawalan ng kakayahan"]}],"etymology":{"value":"Derived from the Tagalog root word \"galing\" meaning \"skill, ability, excellence\" with the prefix \"ka-\" and suffix \"-an\" indicating a state or condition.","priority":"N/A"},"pronunciation":{"ipa":"/kaɡaliˈŋan/","syllables":"ka-ga-li-ngan"},"inflection":{"notes":"This is a noun, so it does not inflect for tense. It can be pluralized, but that is less common."},"usage_notes":{"explanation":"The word \"kagalingan\" is a versatile Tagalog word with two main meanings: wellness/well-being and skill/expertise. The context usually clarifies which meaning is intended. When referring to health or welfare, it is often used in discussions about public policy or personal health practices. When referring to skill, it emphasizes a high level of proficiency.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"Using \"kagalingan\" to refer to a specific talent, when \"talento\" would be more appropriate.","correct":"Use \"kagalingan\" to refer to a developed skill or expertise, not just a natural talent.","note":"While related, \"kagalingan\" implies developed skill, whereas \"talento\" is more about innate ability."}],"priority":"N/A"},"related_words":{"derivatives":["gumaling (to recover, to improve)","magaling (skilled, excellent, good)","pagalingin (to heal, to cure)","galing (skill, ability, excellence)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Moderate frequency in Tagalog texts.","priority":"N/A"},"readability_explanation":{"level":"Intermediate","text":"\"Kagalingan\" is a Tagalog word that encompasses both well-being and skill. It is important to understand the context to determine the intended meaning. When discussing health or welfare, it refers to a state of wellness. When discussing abilities, it refers to a high level of skill or expertise. The word is commonly used in formal settings and discussions about social issues or personal development."},"example_sentences":[{"sentence":"Ang kanyang kagalingan sa pag-awit ay nagbigay-daan sa kanyang tagumpay.","translation":"Her skill in singing paved the way for her success.","type":"skill"},{"sentence":"Mahalaga ang pagpapanatili ng kagalingan ng ating kapaligiran.","translation":"Maintaining the well-being of our environment is important.","type":"well-being"}]}