{"word":"Cimicidae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"トコジラミ科","english_definition":"The family of bed bugs, parasitic insects that feed exclusively on blood.","examples":[{"sentence":"Cimicidae are known for their ability to infest human dwellings.","translation":"トコジラミ科は、人間の住居に蔓延する能力で知られています。"},{"sentence":"The Cimicidae family includes several species of bed bugs.","translation":"トコジラミ科には、いくつかの種類のトコジラミが含まれています。"}],"collocations":["Cimicidae infestation (トコジラミ科の蔓延)","Cimicidae control (トコジラミ科の駆除)"],"synonyms":["bed bugs","bedbug family"],"antonyms":[]}],"etymology":{"value":"From the Latin 'cimex' (bug) + '-idae' (a standard suffix used to form the names of zoological families).","priority":"★★☆"},"pronunciation":{"ipa":"/sɪˈmɪsɪdiː/","syllables":"ci-mi-ci-dae"},"inflection":{"noun_plural":"Cimicidae (科名のため、複数形は通常使用されません)"},"usage_notes":{"explanation":"'Cimicidae' refers to the scientific family name for bed bugs. It is typically used in scientific or technical contexts. In general conversation, 'bed bugs' is more common.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["cimex (トコジラミ属)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Cimicidae' is a scientific term referring to the family of insects known as bed bugs. It is rarely used in everyday conversation and is primarily found in scientific literature or technical discussions related to entomology or pest control. Understanding this term is relevant for those in related fields, but not generally necessary for everyday English comprehension."},"example_sentences":[{"sentence":"Scientists are studying the Cimicidae family to develop better control methods.","translation":"科学者たちは、より良い駆除方法を開発するためにトコジラミ科を研究しています。","type":"noun","meaning_category":"トコジラミ科"},{"sentence":"Cimicidae are nocturnal insects that feed on the blood of humans and other warm-blooded animals.","translation":"トコジラミ科は夜行性の昆虫で、人間や他の温血動物の血を吸います。","type":"noun","meaning_category":"トコジラミ科"}]}