{"word":"Leeco","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A former Chinese technology company, also known as Letv, that produced consumer electronics, entertainment content, and electric vehicles.","english_definition":"A defunct Chinese technology company known for its diverse range of products and services, including smartphones, televisions, and streaming content.","examples":[{"sentence":"Leeco was once a major player in the Chinese smartphone market.","translation":"Leecoはかつて中国のスマートフォン市場における主要なプレーヤーでした。"},{"sentence":"Leeco's financial troubles led to its eventual collapse.","translation":"Leecoの財政難は最終的な崩壊につながりました。"}],"collocations":["Leeco smartphone","Leeco television","Leeco streaming service"],"synonyms":["Letv"],"antonyms":[]}],"etymology":{"value":"The name 'Leeco' is a combination of 'Le' (乐), meaning 'joy' or 'happiness' in Chinese, and 'eco', representing the company's ecosystem of products and services.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈliːkoʊ/","syllables":"Lee-co"},"inflection":{},"usage_notes":{"explanation":"Leeco was a prominent Chinese technology company that aimed to create an interconnected ecosystem of products and services. However, due to aggressive expansion and financial difficulties, the company eventually faced collapse and ceased operations. The name is primarily associated with the company's history and its innovative but ultimately unsustainable business model.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"related_companies":["Coolpad (Leeco was a major shareholder)"],"people":["Jia Yueting (founder of Leeco)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency due to the company's limited lifespan.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Leeco' refers to a Chinese technology company that was once known for its ambitions to create a broad ecosystem of products. It is now largely defunct due to financial problems. Understanding the term requires some knowledge of the technology industry and the history of Chinese tech companies. It's not a commonly used word outside of discussions about business or technology.","priority":"★☆☆"},"example_sentences":[{"sentence":"The rise and fall of Leeco is a cautionary tale about rapid expansion.","translation":"Leecoの隆盛と衰退は、急速な拡大に関する教訓的な物語です。","type":"general","meaning_category":"Company history"},{"sentence":"Leeco's electric vehicle project faced numerous delays and ultimately failed.","translation":"Leecoの電気自動車プロジェクトは、数多くの遅延に直面し、最終的に失敗しました。","type":"specific","meaning_category":"Company projects"}]}