{"word":"fizzer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(口語)失敗作、不発弾、期待外れな人や物事","english_definition":"(colloquial) A failure; something that does not live up to expectations.","examples":[{"sentence":"The party was a complete fizzer; nobody showed up.","translation":"パーティーは大失敗だった。誰も来なかった。"},{"sentence":"His new business venture turned out to be a fizzer.","translation":"彼の新しい事業は結局、期待外れに終わった。"},{"sentence":"The movie was hyped up, but it was a real fizzer.","translation":"その映画は宣伝されていたが、実際はつまらなかった。"}],"collocations":["complete fizzer","total fizzer","real fizzer"],"synonyms":["failure","flop","dud","letdown","disappointment"],"antonyms":["success","hit","winner"]},{"part_of_speech":"noun","definition":"(口語, オーストラリア英語)炭酸飲料","english_definition":"(colloquial, Australian English) A carbonated drink; a soft drink.","examples":[{"sentence":"I'll have a fizzer with my lunch.","translation":"昼食に炭酸飲料をください。"},{"sentence":"He ordered a fizzer at the pub.","translation":"彼はパブで炭酸飲料を注文した。"}],"collocations":["order a fizzer","have a fizzer"],"synonyms":["soft drink","soda","pop","carbonated beverage"],"antonyms":[]}],"etymology":{"value":"The origin is likely onomatopoeic, referring to the sound of something fizzing (making a bubbling or hissing sound). The 'failure' sense may have developed from the idea of something that starts with a fizz but then quickly loses its energy or excitement.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɪzər/","syllables":"fiz-zer"},"inflection":{"noun_plural":"fizzers"},"usage_notes":{"explanation":"The word \"fizzer\" has two main meanings, one more general and one specific to Australian English. The general meaning refers to something that is a failure or a disappointment. The Australian English meaning refers to a carbonated drink. Context is important to determine which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The fizzer was delicious.","correct":"✓ The fizzer was a failure. / ✓ The fizzer was a refreshing drink.","note":"Depending on the context, \"fizzer\" can mean either a failure or a carbonated drink. Make sure the sentence reflects the intended meaning."}],"priority":"★★☆"},"related_words":{"derivatives":["fizz (noun: a bubbling or hissing sound; verb: to make a bubbling or hissing sound)","fizzy (adjective: containing bubbles; effervescent)"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"fizzer\" is an informal term that can mean either a failure or a carbonated drink (in Australian English). Understanding the context is crucial to interpreting the intended meaning. It's not a very common word, so it's more likely to be encountered in informal settings or specific regional contexts."},"example_sentences":[{"sentence":"The much-anticipated product launch turned out to be a complete **fizzer**.","translation":"大いに期待された製品の発売は、完全な失敗作に終わった。","type":"noun","meaning_category":"失敗作"},{"sentence":"I'll grab a **fizzer** from the fridge.","translation":"冷蔵庫から炭酸飲料を取ってくるよ。","type":"noun","meaning_category":"炭酸飲料 (オーストラリア英語)"}]}