{"word":"granularly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"粒状に、細かく分析して、詳細に","english_definition":"In a granular manner; in terms of small, detailed components or elements; with fine-grained detail.","examples":[{"sentence":"We need to analyze the data granularly to identify the root cause of the problem.","translation":"問題の根本原因を特定するために、データを詳細に分析する必要があります。"},{"sentence":"The software allows you to manage your budget granularly, tracking every expense.","translation":"そのソフトウェアを使用すると、すべての費用を追跡して、予算を詳細に管理できます。"},{"sentence":"The project was broken down granularly into smaller, more manageable tasks.","translation":"プロジェクトは、より管理しやすい小さなタスクに細かく分割されました。"}],"collocations":["analyze granularly","manage granularly","break down granularly","control granularly","view granularly","examine granularly","report granularly"],"synonyms":["detailedly","minutely","finely","precisely","thoroughly","comprehensively","atomically"],"antonyms":["broadly","generally","roughly","superficially","holistically"]}],"etymology":{"value":"Derived from the adjective 'granular', which comes from the Latin 'granulum', a diminutive of 'granum' meaning 'grain'. The suffix '-ly' turns it into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡrænjʊlərli/","syllables":"gran-u-lar-ly"},"inflection":{"notes":"This is an adverb, so it does not have different forms."},"usage_notes":{"explanation":"'Granularly' describes an action done with a high level of detail, focusing on the individual components or elements. It implies a thorough and precise approach, often used in contexts involving data analysis, project management, or control systems. The term emphasizes the ability to examine or manage something at a very fine-grained level.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The information was presented granular.","correct":"✓ The information was presented granularly.","note":"'Granular' is an adjective, while 'granularly' is the adverb needed to modify the verb 'presented'."},{"incorrect":"✗ We need to look at the big picture, not granularly.","correct":"✓ We need to look at the big picture, not in a granular way.","note":"While 'granularly' is an adverb, sometimes rephrasing with 'in a granular way' can improve clarity, especially in contrast to 'the big picture'."}],"priority":"★☆☆"},"related_words":{"derivatives":["granular (adjective)","granularity (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in technical or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Granularly' is an adverb that means 'in a detailed or fine-grained manner'. It's used to describe how something is analyzed, managed, or controlled by looking at its smallest parts. This word is more common in technical fields like data analysis, software development, or project management where precise and detailed examination is important. It suggests a level of detail that goes beyond general overviews and delves into the specifics.","priority":"★☆☆"},"example_sentences":[{"sentence":"The system allows you to control user access granularly, specifying permissions for each individual file.","translation":"このシステムでは、ユーザーアクセスを詳細に制御し、個々のファイルごとに権限を指定できます。","type":"adverb","meaning_category":"詳細に制御する"},{"sentence":"We can analyze the market data granularly to identify specific customer segments.","translation":"市場データを詳細に分析して、特定の顧客セグメントを特定できます。","type":"adverb","meaning_category":"詳細に分析する"},{"sentence":"The project plan was broken down granularly to ensure each task was clearly defined and manageable.","translation":"プロジェクト計画は、各タスクが明確に定義され、管理可能になるように細かく分割されました。","type":"adverb","meaning_category":"詳細に分割する"}]}