{"word":"jargony","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"専門用語だらけの、専門用語を多用した、難解な","english_definition":"characterized by jargon; full of technical terms or specialized vocabulary that is difficult for outsiders to understand.","examples":[{"sentence":"The report was jargony and difficult to understand for non-experts.","translation":"その報告書は専門用語だらけで、専門家以外には理解するのが難しかった。"},{"sentence":"His presentation was too jargony for the general audience.","translation":"彼のプレゼンテーションは一般の聴衆には専門用語が多すぎた。"},{"sentence":"Avoid using jargony language when writing for a broad readership.","translation":"幅広い読者層に向けて書くときは、専門用語だらけの言葉遣いは避けるように。"}],"collocations":["jargony language","jargony report","jargony presentation","overly jargony","highly jargony"],"synonyms":["technical","specialized","obscure","pedantic","esoteric","abstruse"],"antonyms":["plain","simple","clear","accessible","uncomplicated"]},{"part_of_speech":"adjective","definition":"気取った、衒学的な","english_definition":"pretentious or affected, especially in the use of language.","examples":[{"sentence":"The professor's jargony style made him seem aloof and out of touch.","translation":"その教授の気取った話し方は、彼をよそよそしく、現実離れしているように見させた。"},{"sentence":"She criticized the writer's jargony prose, calling it pretentious and meaningless.","translation":"彼女は、その作家の気取った散文を批判し、衒学的で意味がないと評した。"}],"collocations":["jargony style","jargony prose","jargony writing"],"synonyms":["pretentious","affected","bombastic","pompous","ostentatious","theatrical"],"antonyms":["sincere","genuine","unaffected","natural"]}],"etymology":{"value":"Derived from \"jargon,\" referring to specialized or technical language, plus the suffix \"-y,\" indicating a quality or characteristic.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒɑːrɡəni/","syllables":"jar-go-ny"},"inflection":{"notes":"Adjective; comparative and superlative forms can be created using 'more jargony' and 'most jargony', but this is less common.","adjective_forms":{"comparative":"more jargony","superlative":"most jargony"}},"usage_notes":{"explanation":"\"Jargony\" describes something that is excessively filled with jargon, making it difficult for those outside a specific field or group to understand. It often carries a negative connotation, suggesting that the language is unnecessarily complex or pretentious. The word can also be used to describe writing or speech that is deliberately obscure or intended to impress rather than communicate clearly.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The jargony was too much for me to understand.","correct":"The jargon was too much for me to understand. / The language was too jargony for me to understand.","note":"\"Jargony\" is an adjective, so it needs to modify a noun. \"Jargon\" is the noun form."},{"incorrect":"He spoke in jargons.","correct":"He spoke in jargon. / He used jargony language.","note":"\"Jargon\" is typically used as an uncountable noun."}],"priority":"★★☆"},"related_words":{"derivatives":["jargon (noun)","jargonize (verb)"],"related_terms":["technical","specialized","terminology","buzzwords"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"jargony\" is used to describe language that is full of jargon, which means it's difficult for people who are not experts in a particular field to understand. It's often used negatively, implying that the language is unnecessarily complicated or pretentious. Think of it as the opposite of clear and simple language. If someone says a report is \"jargony,\" they mean it's full of technical terms and hard to follow if you don't have specialized knowledge.","priority":"★★☆"},"example_sentences":[{"sentence":"The manual was so jargony that even experienced technicians had trouble understanding it.","translation":"そのマニュアルは専門用語だらけで、経験豊富な技術者でさえ理解に苦労した。","type":"adjective","meaning_category":"専門用語だらけの"},{"sentence":"The politician's jargony speech was designed to confuse the public.","translation":"その政治家の専門用語だらけの演説は、大衆を混乱させるように意図されていた。","type":"adjective","meaning_category":"専門用語を多用した"},{"sentence":"The article was criticized for being too jargony and inaccessible to the average reader.","translation":"その記事は、専門用語が多すぎて、平均的な読者には理解できないと批判された。","type":"adjective","meaning_category":"難解な"}]}