{"word":"Transferrotype","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A photographic print made by transferring a collodion positive from its glass support to another surface, such as paper or cloth.","english_definition":"A photographic print made by transferring a collodion positive from its glass support to another surface, such as paper or cloth.","examples":[{"sentence":"The museum displayed a collection of transferrotypes from the 19th century.","translation":"博物館は19世紀のトランスフェロタイプのコレクションを展示した。"},{"sentence":"She learned the process of making transferrotypes in her photography class.","translation":"彼女は写真の授業でトランスフェロタイプの作成方法を学んだ。"}],"collocations":["make a transferrotype","transferrotype photograph","collodion transferrotype"],"synonyms":["collodion print","photographic transfer"],"antonyms":[]}],"etymology":{"value":"The word \"transferrotype\" is derived from \"transfer\" (to move from one place to another) and \"ferrotype\" (a photograph made on a lacquered iron plate). It describes the process of transferring an image from one surface to another.","priority":"★★☆"},"pronunciation":{"ipa":"/trænsˈfɛroʊtaɪp/","syllables":"trans-fer-ro-type"},"inflection":{"noun_plural":"transferrotypes"},"usage_notes":{"explanation":"A transferrotype is a specific type of photographic print created using the wet collodion process. The image is initially developed on a glass plate and then transferred to a different support material. This technique was popular in the 19th century.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He made a ferrotype transfer.","correct":"✓ He made a transferrotype.","note":"The correct term for the transferred collodion positive is \"transferrotype,\" not \"ferrotype transfer.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["transfer","ferrotype","collodion"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"transferrotype\" refers to a specific historical photographic process. Understanding requires familiarity with 19th-century photography techniques, particularly the wet collodion process and ferrotypes. The term is rarely used in modern contexts outside of historical discussions or specialized photography circles."},"example_sentences":[{"sentence":"The antique shop had several beautifully preserved transferrotypes.","translation":"そのアンティークショップには、美しく保存されたトランスフェロタイプがいくつかあった。","type":"noun","meaning_category":"photographic print"},{"sentence":"Creating a transferrotype requires careful handling of chemicals and precise timing.","translation":"トランスフェロタイプを作成するには、化学物質の慎重な取り扱いと正確なタイミングが必要だ。","type":"noun","meaning_category":"photographic process"}]}