{"word":"Normanist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ノルマン説主義者：ノルマン人が東スラヴ民族の歴史、特にキエフ・ルーシの建国において重要な役割を果たしたと信じる人。","english_definition":"A proponent of Normanism: the belief that the Norsemen (Normans, Vikings) played a key role in the history of the East Slavs, especially in the founding of Kievan Rus'.","examples":[{"sentence":"Many historians consider themselves Normanists to varying degrees, acknowledging the Norse influence on early Russian history.","translation":"多くの歴史家は、初期のロシア史に対するノース人の影響を認めており、さまざまな程度で自身をノルマン説主義者であると考えています。"}],"collocations":["historical Normanist","early Normanist"],"synonyms":["Viking theorist"],"antonyms":["Anti-Normanist","Slavophile"],"notes":"The term is often used in the context of historical debates about the origins of Russian statehood."},{"part_of_speech":"adjective","definition":"ノルマン説の：ノルマン人が東スラヴ民族の歴史、特にキエフ・ルーシの建国において重要な役割を果たしたという信念に関連する。","english_definition":"Relating to Normanism: the belief that the Norsemen (Normans, Vikings) played a key role in the history of the East Slavs, especially in the founding of Kievan Rus'.","examples":[{"sentence":"Normanist theories were popular among some 18th-century historians.","translation":"ノルマン説の理論は、18世紀の一部の歴史家の間で人気がありました。"}],"collocations":["Normanist theory","Normanist interpretation"],"synonyms":["Viking-centric"],"antonyms":["Anti-Normanist","Slavophilic"]}],"etymology":{"value":"Formed from \"Norman\" + \"-ist\".","priority":"☆☆☆"},"pronunciation":{"ipa":"ˈnɔːrmənɪst","syllables":"Nor-man-ist"},"inflection":{"noun_plural":"Normanists"},"usage_notes":{"explanation":"The term \"Normanist\" is primarily used in historical and academic contexts when discussing the role of Vikings (specifically, Norsemen or Normans) in the formation of early East Slavic states, particularly Kievan Rus'. It is often contrasted with \"Anti-Normanist\" views, which emphasize the role of the Slavs themselves in their own history.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Normanist because he likes Normandy.","correct":"✓ He is a Normanist because he believes Vikings founded Russia.","note":"Normanism is a specific historical theory, not just an interest in Normandy."}],"priority":"☆☆☆"},"related_words":{"derivatives":["Normanism","Anti-Normanism"],"related_terms":["Viking","Norseman","Kievan Rus'","Slav","Varangian"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term \"Normanist\" is a specialized term used in historical discussions, particularly those concerning the origins of Russia and other East Slavic states. It refers to someone who supports the theory that Vikings (Normans) played a significant role in the establishment of these states. Understanding this term requires familiarity with early East Slavic history and the debates surrounding it."},"example_sentences":[{"sentence":"As a Normanist, he argued that the Varangian guard had a profound impact on Byzantine culture.","translation":"ノルマン説主義者として、彼はヴァリャーグ親衛隊がビザンツ文化に深い影響を与えたと主張した。","type":"noun","meaning_category":"ノルマン説主義者"},{"sentence":"The Normanist perspective on early Russian history is often debated.","translation":"初期のロシア史に関するノルマン説的な見解は、しばしば議論される。","type":"adjective","meaning_category":"ノルマン説の"}]}