{"word":"lipolysis","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"脂肪分解、脂肪細胞分解","english_definition":"The breakdown of fats and other lipids by hydrolysis to release fatty acids.","examples":[{"sentence":"Lipolysis is stimulated by several hormones, including epinephrine and norepinephrine.","translation":"脂肪分解は、エピネフリンやノルエピネフリンを含むいくつかのホルモンによって刺激されます。"},{"sentence":"Exercise promotes lipolysis, which helps to reduce body fat.","translation":"運動は脂肪分解を促進し、体脂肪の減少に役立ちます。"},{"sentence":"The rate of lipolysis varies depending on factors such as diet and genetics.","translation":"脂肪分解の速度は、食事や遺伝などの要因によって異なります。"}],"collocations":["hormone-sensitive lipolysis","stimulated lipolysis","inhibit lipolysis","promote lipolysis","rate of lipolysis","adipose tissue lipolysis"],"synonyms":["fat breakdown","fat metabolism","lipid hydrolysis"],"antonyms":["lipogenesis","fat storage","adipogenesis"]}],"etymology":{"value":"Derived from the Greek words 'lipos' (fat) and 'lysis' (loosening, dissolution).","priority":"★★★"},"pronunciation":{"ipa":"/laɪˈpɒlɪsɪs/","syllables":"li-pol-y-sis"},"inflection":{"noun_plural":"lipolyses"},"usage_notes":{"explanation":"Lipolysis is a metabolic process that involves the hydrolysis of triglycerides into glycerol and free fatty acids. These fatty acids are then released into the bloodstream and can be used as an energy source by cells. The process is regulated by hormones and other factors and plays a crucial role in energy metabolism and weight management.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Lipolysis is the process of building fat.","correct":"✓ Lipolysis is the process of breaking down fat.","note":"Lipolysis is the breakdown, not the building, of fats."},{"incorrect":"✗ Lipolysis only occurs during exercise.","correct":"✓ Lipolysis occurs both during exercise and at rest, but is stimulated by exercise.","note":"Lipolysis occurs at rest but is increased during exercise."}],"priority":"★★☆"},"related_words":{"derivatives":["lipolytic (adjective: relating to or promoting lipolysis)"],"related_terms":["adipose tissue","triglycerides","fatty acids","glycerol","hormones","metabolism"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in scientific and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Lipolysis is a technical term used in biology and medicine to describe the process of breaking down fats (lipids) into smaller molecules like fatty acids and glycerol. This process is important for energy production and is influenced by hormones and other factors. Understanding lipolysis is crucial for studying metabolism, obesity, and related health conditions. It is a term primarily encountered in scientific literature and advanced discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"During fasting, the body increases lipolysis to provide energy.","translation":"絶食中、体はエネルギーを供給するために脂肪分解を増加させます。","type":"general","meaning_category":"脂肪分解"},{"sentence":"Certain medications can affect the rate of lipolysis in the body.","translation":"特定の薬は、体内の脂肪分解の速度に影響を与える可能性があります。","type":"medical","meaning_category":"脂肪分解"},{"sentence":"Endurance exercise is known to enhance lipolysis in adipose tissue.","translation":"持久力運動は、脂肪組織における脂肪分解を促進することが知られています。","type":"exercise physiology","meaning_category":"脂肪分解"}]}