{"word":"Farmage","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(造語) 農場を意味する \"farm\" と、集落や共同体を意味する \"village\" を組み合わせた言葉。農場のような集落や、農業を中心としたコミュニティを指す。","english_definition":"(Neologism) A portmanteau of \"farm\" and \"village\", referring to a farm-like settlement or an agricultural-centered community.","examples":[{"sentence":"The eco-village was more like a farmage, with everyone involved in growing food.","translation":"そのエコビレッジは、まるでファーマージュのようで、誰もが食料の栽培に関わっていた。"},{"sentence":"They envisioned a future of small farmages, each self-sufficient and sustainable.","translation":"彼らは、それぞれが自給自足で持続可能な小さなファーマージュの未来を思い描いていた。"}],"collocations":["eco-farmage (エコファーマージュ)","sustainable farmage (持続可能なファーマージュ)"],"synonyms":["agricultural village","farm community","rural settlement"],"antonyms":["urban center","city","metropolis"]}],"etymology":{"value":"\"Farmage\" is a neologism, a portmanteau word created by combining \"farm\" and \"village\". The intention is to describe a settlement or community that is centered around agriculture, resembling a farm in its structure and activities.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfɑːrmɪdʒ/","syllables":"Far-mage"},"inflection":{"noun_plural":"Farmages"},"usage_notes":{"explanation":"\"Farmage\" is not a standard English word and is considered a neologism. Its meaning is generally understood through the combination of its constituent parts, \"farm\" and \"village\". It suggests a rural community where agriculture plays a central role in the economy and lifestyle. The term is often used in the context of sustainable living, eco-villages, and intentional communities.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The farmage is located in the urban area.","correct":"✓ The farmage is located in the rural area.","note":"Farmages are typically located in rural areas, not urban areas, as they are centered around agriculture."},{"incorrect":"✗ Farmage is a well-established term in agricultural studies.","correct":"✓ Farmage is a neologism and not a well-established term in agricultural studies.","note":"Farmage is a relatively new and uncommon word, not a standard term in academic fields."}],"priority":"★★☆"},"related_words":{"derivatives":["farm (noun, verb)","village (noun)","farming (noun)","agriculture (noun)","farmstead (noun)"],"phrases":["agricultural community","rural settlement","eco-village","intentional community"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (not a standard English word)","frequency_google_ngram":"Low frequency (as it's a neologism)","priority":"☆☆☆"},"readability_explanation":{"level":"C1 (due to being a neologism and requiring understanding of word formation)","text":"\"Farmage\" is a newly coined word, combining \"farm\" and \"village\". It describes a community that functions like a farm, where agriculture is central to life. Because it's not a common word, understanding its meaning requires recognizing the parts it's made from and the concept it represents. It's often used in discussions about sustainable living or intentional communities.","note":"This word is not in common usage and may not be recognized by all English speakers."},"example_sentences":[{"sentence":"The students visited a local farmage to learn about sustainable agriculture.","translation":"学生たちは持続可能な農業について学ぶために、地元のファーマージュを訪れた。","type":"noun","meaning_category":"agricultural community"},{"sentence":"The residents of the farmage share resources and work together to cultivate the land.","translation":"そのファーマージュの住民は資源を共有し、協力して土地を耕作する。","type":"noun","meaning_category":"agricultural community"},{"sentence":"The concept of a farmage promotes self-sufficiency and environmental stewardship.","translation":"ファーマージュの概念は、自給自足と環境保護を促進する。","type":"noun","meaning_category":"agricultural community"}]}