{"word":"supply-constrained","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"供給制約のある、供給が逼迫している","english_definition":"Characterized by a situation in which the availability of goods or services is limited, restricting the ability to meet demand.","examples":[{"sentence":"The automotive industry is currently supply-constrained due to the global chip shortage.","translation":"自動車産業は現在、世界的な半導体不足により供給制約を受けている。"},{"sentence":"Rising prices are often a sign of a supply-constrained market.","translation":"価格の上昇は、しばしば供給制約のある市場の兆候である。"},{"sentence":"The housing market is supply-constrained in many major cities.","translation":"住宅市場は、多くの主要都市で供給制約を受けている。"}],"collocations":["supply-constrained market (供給制約のある市場)","supply-constrained economy (供給制約のある経済)","become supply-constrained (供給制約になる)","remain supply-constrained (供給制約の状態が続く)"],"synonyms":["supply-limited","capacity-constrained","resource-scarce","under-supplied"],"antonyms":["supply-abundant","over-supplied","demand-constrained"]},{"part_of_speech":"adjective","definition":"供給側の制約によって影響を受ける、供給側の要因によって左右される","english_definition":"Affected or determined primarily by factors related to the supply side of an economy.","examples":[{"sentence":"Inflation in this sector is largely supply-constrained, rather than demand-driven.","translation":"この分野のインフレは、需要主導型というよりは、主に供給側の制約を受けている。"},{"sentence":"The economic recovery is supply-constrained due to disruptions in global supply chains.","translation":"世界的なサプライチェーンの混乱により、景気回復は供給側の制約を受けている。"}],"collocations":["supply-constrained inflation (供給制約によるインフレ)","supply-constrained growth (供給制約による成長)","supply-constrained recovery (供給制約による回復)"],"synonyms":["supply-side limited","supply-side affected","supply-side driven"],"antonyms":["demand-driven","demand-side affected"]}],"etymology":{"value":"A compound adjective formed by combining 'supply' (the amount of a resource or product available) and 'constrained' (restricted or limited). The term describes a situation where supply is limited or restricted, impacting the availability of goods or services.","priority":"★★☆"},"pronunciation":{"ipa":"/səˈplaɪ kənˈstreɪnd/","syllables":"sup-ply con-strained"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Supply-constrained' is commonly used in economics, business, and finance to describe situations where the availability of goods, services, or resources is limited, preventing demand from being fully met. It is often used to explain rising prices, production bottlenecks, or other economic challenges. The term can apply to specific industries, sectors, or the entire economy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The market is supply constrained of goods.","correct":"✓ The market is supply-constrained.","note":"The correct form is 'supply-constrained' without the preposition 'of' after it."},{"incorrect":"✗ Supply constrained is a problem.","correct":"✓ Supply constraints are a problem.","note":"'Supply constrained' is an adjective, so it needs a noun to modify. 'Supply constraints' (plural) can be used as a noun phrase."}],"priority":"★★☆"},"related_words":{"derivatives":["constraint (noun)","constrain (verb)","supply (noun, verb)"],"phrases":["supply chain","supply-side economics","demand-side economics","shortage","scarcity"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent, but increasing in usage in recent years due to global supply chain issues.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Supply-constrained' describes a situation where there isn't enough of something (like goods or services) to meet the demand for it. Think of it like this: if everyone wants to buy a certain toy, but the factory can't make enough of them, the toy is 'supply-constrained.' This often leads to higher prices or difficulty finding the item you want. It's a term often used in economics and business to explain why some products are hard to get or expensive."},"example_sentences":[{"sentence":"The global shortage of semiconductors has made many electronic devices supply-constrained.","translation":"世界的な半導体不足により、多くの電子機器が供給制約を受けている。","type":"adjective","meaning_category":"Limited availability"},{"sentence":"The company's growth is supply-constrained by its limited production capacity.","translation":"同社の成長は、限られた生産能力によって供給制約を受けている。","type":"adjective","meaning_category":"Limited by supply factors"},{"sentence":"Due to the drought, the agricultural sector is heavily supply-constrained this year.","translation":"干ばつのため、今年の農業部門は深刻な供給制約を受けている。","type":"adjective","meaning_category":"Limited by supply factors"}]}