{"word":"Dimensuration","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The act, process, or result of measuring dimensions.","english_definition":"The act or process of taking measurements of dimensions; the result of such measurement.","examples":[{"sentence":"The dimensuration of the room was carefully done to ensure the furniture would fit.","translation":"家具が確実に収まるように、部屋の寸法測定は慎重に行われた。"},{"sentence":"Accurate dimensuration is crucial in engineering design.","translation":"正確な寸法測定は、エンジニアリング設計において非常に重要である。"}],"collocations":["accurate dimensuration","careful dimensuration","precise dimensuration"],"synonyms":["measurement","mensuration","dimensioning"],"antonyms":["estimation","approximation"]}],"etymology":{"value":"Derived from the verb 'dimensurate', which comes from 'dimension' + '-ate' (forming a verb). 'Dimension' comes from Latin 'dīmēnsiō' (a measuring), from 'dīmēnsus', past participle of 'dīmētīrī' (to measure out).","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˌmɛnʃəˈreɪʃən/","syllables":"di-men-su-ra-tion"},"inflection":{"noun_plural":"dimensurations"},"usage_notes":{"explanation":"'Dimensuration' is a relatively formal term for the process of measuring dimensions. It is often used in technical or academic contexts where precise measurement is important. It emphasizes the act or process of measuring rather than simply the dimensions themselves.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The dimensuration were taken with a laser.","correct":"✓ The dimensuration was taken with a laser.","note":"'Dimensuration' is often used as an uncountable noun referring to the process or act of measuring, so it takes a singular verb. When referring to the results of multiple measurements, 'dimensurations' (plural) can be used, but it's less common."}],"priority":"★★☆"},"related_words":{"derivatives":["dimension","dimensional","dimensurable","dimensurate"],"related_terms":["mensuration","measurement"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dimensuration' is a technical term referring to the process of measuring dimensions. It is used in contexts where precise measurement is crucial, such as engineering, architecture, or manufacturing. The word is derived from 'dimension' and implies a careful and accurate measurement process. Understanding this term is helpful for comprehending technical documents and discussions in related fields."},"example_sentences":[{"sentence":"The architect performed a detailed dimensuration of the site before beginning the design.","translation":"建築家は設計を開始する前に、敷地の詳細な寸法測定を行った。","type":"general","meaning_category":"measurement"},{"sentence":"The accuracy of the dimensuration directly affects the fit of the components.","translation":"寸法測定の精度は、部品の適合に直接影響する。","type":"technical","meaning_category":"accuracy"},{"sentence":"The report includes a comprehensive dimensuration of the building's interior.","translation":"報告書には、建物の内部の包括的な寸法測定が含まれている。","type":"report","meaning_category":"comprehensive"}]}