{"word":"zoacum","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(historical) A kind of gruel or porridge made from flour and water, used as a cheap food, especially in times of scarcity.","english_definition":"A type of gruel or porridge made from flour and water, often consumed as a cheap food, particularly during periods of scarcity.","examples":[{"sentence":"During the famine, many people survived on zoacum.","translation":"飢饉の間、多くの人々がゾアクムを食べて生き延びました。"},{"sentence":"Zoacum was a staple food for the poor in that era.","translation":"ゾアクムはその時代、貧しい人々の主食でした。"}],"collocations":["make zoacum","eat zoacum","survive on zoacum"],"synonyms":["gruel","porridge","frumenty"],"antonyms":[]}],"etymology":{"value":"The origin of the word 'zoacum' is uncertain. It may be derived from a Latin or Greek term, but the exact root is not definitively known.","priority":"★☆☆"},"pronunciation":{"ipa":"/zoʊˈeɪkəm/","syllables":"zo-a-cum"},"inflection":{"noun_plural":"zoacums"},"usage_notes":{"explanation":"The term 'zoacum' is primarily historical and rarely used in modern English. It refers to a simple, inexpensive food made from flour and water, typically consumed by those facing poverty or food shortages. It is often found in historical texts describing the diets of the poor.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I had zoacum for dinner last night.","correct":"✓ (More appropriate alternatives) I had porridge for dinner last night. / I had a simple gruel for dinner last night.","note":"Using 'zoacum' in modern conversation may sound archaic or unfamiliar. More common terms like 'porridge' or 'gruel' are generally preferred."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["gruel","porridge","frumenty","pottage"]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency - primarily found in historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'zoacum' is highly specialized and uncommon. It is unlikely to be encountered outside of historical or academic contexts. Understanding the term requires knowledge of historical food practices and dietary habits of the poor. Due to its rarity, it is not part of standard vocabulary and would be considered advanced."},"example_sentences":[{"sentence":"The historical records indicate that zoacum was a common meal for peasants during the medieval period.","translation":"歴史的記録は、中世時代に農民にとってゾアクムが一般的な食事であったことを示しています。","type":"noun","meaning_category":"historical food"},{"sentence":"In times of famine, even zoacum was a luxury that many could not afford.","translation":"飢饉の時代には、ゾアクムでさえ多くの人々が手に入れることのできない贅沢品でした。","type":"noun","meaning_category":"historical food"}]}