{"word":"galvanoplasty","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"電気めっき法、ガルバノ形成","english_definition":"The process of electrodepositing a metal onto a mold to form a thin, detailed layer, which is then separated to create a metallic object or coating.","examples":[{"sentence":"Galvanoplasty is used to create intricate metal parts.","translation":"電気めっき法は、複雑な金属部品を作るために使用されます。"},{"sentence":"The museum uses galvanoplasty to reproduce ancient artifacts.","translation":"博物館は電気めっき法を使って古代の工芸品を複製しています。"}],"collocations":["electrodeposition","electroforming","metal plating","nickel plating","copper plating"],"synonyms":["electroforming","electrodeposition","metal plating"],"antonyms":[]}],"etymology":{"value":"The term 'galvanoplasty' combines 'galvano-' (referring to Luigi Galvani, pioneer in electricity) and '-plasty' (from Greek 'plassein' meaning to mold or shape).","priority":"★★☆"},"pronunciation":{"ipa":"/ɡælˈvænoʊˌplæsti/","syllables":"gal-va-no-plas-ty"},"inflection":{"noun_plural":"galvanoplasties"},"usage_notes":{"explanation":"Galvanoplasty is primarily a technical term used in manufacturing, art, and conservation. It refers to a specific type of electrodeposition where the goal is to create a separate, freestanding metallic object or a very precise coating. It's distinct from general electroplating, where the coating is intended to remain permanently adhered to the substrate.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used galvanoplasty for simple metal coating.","correct":"✓ He used electroplating for simple metal coating.","note":"Galvanoplasty is for creating separate objects or very detailed coatings, not simple coatings."}],"priority":"★☆☆"},"related_words":{"derivatives":["galvanoplastic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Galvanoplasty' is a specialized term used in technical and artistic contexts. It describes a process of creating metal objects or coatings through electrodeposition. The key concept is the creation of a separable metallic layer, distinguishing it from standard electroplating. Understanding requires familiarity with basic chemistry and manufacturing processes."},"example_sentences":[{"sentence":"The jeweler used galvanoplasty to create intricate gold ornaments.","translation":"宝石商は電気めっき法を使って複雑な金の装飾品を作りました。","type":"example","meaning_category":"manufacturing"},{"sentence":"Conservationists employed galvanoplasty to restore the corroded bronze statue.","translation":"修復家たちは腐食した青銅像を修復するために電気めっき法を使用しました。","type":"example","meaning_category":"conservation"},{"sentence":"The artist experimented with galvanoplasty to produce unique metal sculptures.","translation":"その芸術家は電気めっき法を試して、ユニークな金属彫刻を制作しました。","type":"example","meaning_category":"art"}]}