{"word":"pyrazine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ピラジン：芳香族複素環式有機化合物の一種。２つの窒素原子がパラ位に置換された６員環を持つ。","english_definition":"A heterocyclic aromatic organic compound with the formula C4H4N2, characterized by a six-membered ring with two nitrogen atoms at opposite (para) positions.","examples":[{"sentence":"Pyrazine and its derivatives contribute to the flavor and aroma of many foods.","translation":"ピラジンおよびその誘導体は、多くの食品の風味と香りに寄与する。"},{"sentence":"Some pyrazines are used as flavoring agents in the food industry.","translation":"いくつかのピラジンは、食品業界で香料として使用されている。"}],"collocations":["pyrazine derivative","substituted pyrazine","alkyl pyrazine"],"synonyms":["diazine (general term for six-membered rings with two nitrogen atoms)"],"antonyms":[]}],"etymology":{"value":"Derived from 'pyr-' (referring to heat, as pyrazines were often first discovered during high-temperature reactions) and '-azine' (a suffix used for heterocyclic compounds containing nitrogen).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpaɪzəˌziːn/","syllables":"py-ra-zine"},"inflection":{"noun_plural":"pyrazines"},"usage_notes":{"explanation":"Pyrazine is a chemical compound that is important in the flavor and aroma of many foods, including roasted nuts, coffee, and chocolate. It is also used as a flavoring agent in the food industry. Chemically, it is a heterocyclic aromatic compound.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["alkylpyrazine","tetramethylpyrazine"],"related_compounds":["piperazine","pyrimidine","imidazole"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency (scientific/technical vocabulary)","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"Pyrazine is a technical term in organic chemistry, typically encountered in advanced chemistry or food science contexts. It refers to a specific type of heterocyclic aromatic compound. Understanding this term requires a background in chemistry.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The aroma of roasted coffee is often attributed to the presence of pyrazines.","translation":"ローストコーヒーの香りは、しばしばピラジンの存在に起因する。","type":"general","meaning_category":"chemical compound"},{"sentence":"Various alkyl pyrazines contribute to the characteristic flavor of baked goods.","translation":"様々なアルキルピラジンが、焼き菓子の特徴的な風味に寄与する。","type":"specific","meaning_category":"flavor compound"}]}