{"word":"arousingly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"刺激的に、興奮させるように、性的に魅力的に","english_definition":"in a manner that causes sexual excitement or interest; in a stimulating or provocative way.","examples":[{"sentence":"She danced arousingly, captivating the entire audience.","translation":"彼女は刺激的に踊り、観客全体を魅了した。"},{"sentence":"The model posed arousingly for the magazine cover.","translation":"モデルは雑誌の表紙のために性的に魅力的なポーズをとった。"},{"sentence":"The film was criticized for its arousingly suggestive scenes.","translation":"その映画は、刺激的に示唆的なシーンで批判された。"}],"collocations":["dance arousingly (刺激的に踊る)","pose arousingly (刺激的なポーズをとる)","dress arousingly (刺激的な服装をする)","speak arousingly (刺激的な話し方をする)"],"synonyms":["provocatively","seductively","enticingly","stimulatingly","excitably","suggestively"],"antonyms":["unattractively","uninvitingly","repulsively"]}],"etymology":{"value":"The word 'arousingly' is derived from the verb 'arouse', which means to excite or awaken. The suffix '-ingly' is added to form the adverb, indicating the manner in which something is done.","priority":"★★★"},"pronunciation":{"ipa":"/əˈraʊzɪŋli/","syllables":"a-rous-ing-ly"},"inflection":{"notes":"This is an adverb, so it does not have plural forms or different tenses."},"usage_notes":{"explanation":"'Arousingly' is used to describe actions or qualities that are sexually stimulating or exciting. It is often used in the context of art, performance, or personal appearance. The word carries a strong connotation and should be used with consideration of the audience and context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She smiled arousing.","correct":"✓ She smiled arousingly.","note":"'Arousing' is an adjective, while 'arousingly' is an adverb. Use the adverb to modify a verb."},{"incorrect":"✗ The music was arousingly.","correct":"✓ The music was arousing.","note":"'Arousingly' modifies a verb, while 'arousing' can be an adjective. In this case, the music itself is arousing, so the adjective is appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["arouse (verb: to excite or awaken)","arousing (adjective: causing excitement or interest)","arousal (noun: the state of being excited or stimulated)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'arousingly' is an adverb that describes something done in a way that causes sexual excitement or interest. It is a more advanced word and is not commonly used in everyday conversation. It is often found in literature, film criticism, or discussions about art and sexuality. Understanding the connotations of the word is important, as it can be considered provocative or suggestive.","priority":"★★☆"},"example_sentences":[{"sentence":"The dancer moved arousingly across the stage, captivating the audience with her sensuality.","translation":"ダンサーは刺激的にステージを動き回り、その官能性で観客を魅了した。","type":"adverb","meaning_category":"性的に魅力的に"},{"sentence":"The novel described the scene arousingly, leaving little to the imagination.","translation":"その小説はその場面を刺激的に描写し、想像の余地をほとんど残さなかった。","type":"adverb","meaning_category":"刺激的に"},{"sentence":"The advertisement featured a model posing arousingly in designer clothing.","translation":"その広告には、デザイナーの服を着て刺激的なポーズをとるモデルが起用されていた。","type":"adverb","meaning_category":"性的に魅力的に"}]}