{"word":"phaeophyceous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"褐藻類の、褐藻に属する","english_definition":"Relating to or belonging to the brown algae (Phaeophyceae).","examples":[{"sentence":"Phaeophyceous algae are characterized by their brown pigment.","translation":"褐藻類は、その褐色の色素によって特徴づけられる。"},{"sentence":"The phaeophyceous seaweed is rich in iodine.","translation":"その褐藻類の海藻はヨウ素が豊富である。"}],"collocations":["phaeophyceous algae","phaeophyceous seaweed"],"synonyms":["brown algae","brown seaweed"],"antonyms":["green algae","red algae"]}],"etymology":{"value":"From the class name Phaeophyceae (brown algae) + -ous (suffix indicating belonging or resemblance). Phaeo- comes from Greek 'phaios' meaning 'dusky, brown'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfiːəˈfɪʃəs/","syllables":"phe-o-phy-ce-ous"},"inflection":{"notes":"Adjective; no comparative or superlative forms."},"usage_notes":{"explanation":"'Phaeophyceous' is a scientific term primarily used in biology and botany to describe organisms belonging to the class Phaeophyceae, which includes brown algae. It is often used in academic or technical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The phaeophyceous is a type of algae.","correct":"✓ Phaeophyceous algae are a type of algae.","note":"'Phaeophyceous' is an adjective, so it needs to be followed by a noun (e.g., algae, seaweed)."},{"incorrect":"✗ Phaeophyceous are found only in freshwater.","correct":"✓ Phaeophyceous algae are primarily found in marine environments.","note":"Phaeophyceous algae are mostly found in marine environments, not freshwater."}],"priority":"★★☆"},"related_words":{"derivatives":["Phaeophyceae (noun: the class of brown algae)"],"phrases":["Phaeophyceous pigments"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'phaeophyceous' is a highly technical term used within the fields of marine biology and botany. It refers specifically to brown algae and is not commonly used in everyday language. Understanding requires familiarity with biological classification systems.","priority":"★★☆"},"example_sentences":[{"sentence":"The intertidal zone is often dominated by various species of phaeophyceous algae.","translation":"潮間帯は、しばしば様々な種類の褐藻類によって占められている。","type":"adjective","meaning_category":"褐藻類の"},{"sentence":"Research is being conducted on the potential uses of phaeophyceous compounds in pharmaceuticals.","translation":"医薬品における褐藻類化合物の潜在的な用途に関する研究が行われている。","type":"adjective","meaning_category":"褐藻に属する"}]}