{"word":"Horse-hoe","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"馬耕式中耕機","english_definition":"An early type of cultivator drawn by horses, used for tilling between rows of crops.","examples":[{"sentence":"Jethro Tull invented the horse-hoe in the early 18th century.","translation":"ジェスロ・タルは18世紀初頭に馬耕式中耕機を発明した。"},{"sentence":"The horse-hoe revolutionized agriculture by allowing for more efficient weed control and soil aeration.","translation":"馬耕式中耕機は、より効率的な雑草防除と土壌通気を可能にし、農業に革命をもたらした。"}],"collocations":["use a horse-hoe","invent a horse-hoe","horse-hoe agriculture"],"synonyms":["cultivator","tiller","plow"],"antonyms":[]}],"etymology":{"value":"The term 'horse-hoe' is a compound word combining 'horse,' referring to the animal that pulls the machine, and 'hoe,' referring to the hand tool used for weeding and cultivating.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɔːrs hoʊ/","syllables":"horse-hoe"},"inflection":{"noun_plural":"horse-hoes"},"usage_notes":{"explanation":"The 'horse-hoe' is primarily a historical term, as modern agriculture relies on more advanced machinery. However, it remains relevant in discussions of agricultural history and the development of farming techniques. It is specifically designed for tilling between rows of crops, unlike a plow which prepares the entire field.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a horse-hoe to plow the field.","correct":"✓ I used a horse-hoe to cultivate between the rows.","note":"A horse-hoe is for cultivating between rows, not for plowing an entire field."}],"priority":"★☆☆"},"related_words":{"derivatives":["hoe","horse","agriculture","cultivation"],"phrases":["horse-drawn","agricultural revolution"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - primarily used in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'horse-hoe' refers to a specific type of agricultural tool used historically. Understanding its function requires knowledge of farming practices and agricultural history. It is not a commonly used term in modern contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The farmer used a horse-hoe to remove weeds from between the rows of corn.","translation":"農夫はトウモロコシの列の間の雑草を取り除くために馬耕式中耕機を使用した。","type":"noun","meaning_category":"agricultural tool"},{"sentence":"The invention of the horse-hoe greatly improved crop yields in the 18th century.","translation":"馬耕式中耕機の発明は、18世紀の収穫量を大幅に改善した。","type":"noun","meaning_category":"historical significance"}]}