{"word":"Fordland","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"フォードランド：ブラジル、パラー州にある、ヘンリー・フォードが1920年代後半にゴム農園を建設しようとした場所。","english_definition":"Fordlândia: A now-abandoned, prefabricated industrial town established in the Amazon rainforest in the late 1920s by American industrialist Henry Ford to secure a source of cultivated rubber for the Ford Motor Company.","examples":[{"sentence":"Fordland was Henry Ford's attempt to create a rubber plantation in the Amazon.","translation":"フォードランドは、ヘンリー・フォードがアマゾンにゴム農園を作ろうとした試みでした。"},{"sentence":"The remains of Fordland can still be visited today.","translation":"今日でもフォードランドの遺跡を訪れることができます。"}],"collocations":["rubber plantation","Amazon rainforest","industrial town","abandoned town"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"ヘンリー・フォード (Henry Ford) の名に、土地 (land) を意味する接尾辞を組み合わせた造語。","priority":"★★★"},"pronunciation":{"ipa":"ˈfɔːrdˌlænd","syllables":"Ford-land"},"inflection":{"notes":"固有名詞のため、複数形はありません。"},"usage_notes":{"explanation":"フォードランドは、ヘンリー・フォードがゴムの自給自足を目指して建設したものの、気候や病害、労働者の反発などにより失敗に終わった場所です。現在では廃墟となっており、その歴史的背景から、企業の無謀な試みや文化的な衝突の象徴として語られることがあります。","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"低頻度 (Low frequency) - 歴史的な文脈でのみ使用されることが多い。","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"「**Fordland**」は、ブラジルのアマゾンに存在した、ヘンリー・フォードが設立したゴム農園の名前です。これは、歴史や経済、環境に関する議論で言及されることがあります。フォードランドは、企業の野心と自然環境への影響、そして文化的な違いによる失敗を象徴する場所として知られています。そのため、この単語を理解するには、歴史的な背景知識が必要となります。"},"example_sentences":[{"sentence":"The story of Fordland is a cautionary tale about the challenges of imposing industrial methods on a natural environment.","translation":"フォードランドの物語は、自然環境に工業的な手法を適用することの難しさについての教訓的な物語です。","type":"noun","meaning_category":"場所"},{"sentence":"Fordland's failure was due to a combination of poor planning, disease, and resistance from the local workforce.","translation":"フォードランドの失敗は、計画の不備、病気、そして地元の労働者からの抵抗が組み合わさった結果でした。","type":"noun","meaning_category":"場所"}]}