{"word":"unconsolidation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"統合解除、非統合","english_definition":"The act or process of separating or disaggregating something that was previously consolidated; the state of being un-consolidated.","examples":[{"sentence":"The un-consolidation of the company's assets led to a significant restructuring.","translation":"会社の資産の統合解除は、大規模なリストラにつながった。"},{"sentence":"The government's policy of un-consolidation aimed to break up large monopolies.","translation":"政府の統合解除政策は、大規模な独占を解体することを目的としていた。"}],"collocations":["asset un-consolidation","market un-consolidation","industry un-consolidation"],"synonyms":["deconsolidation","disaggregation","separation","fragmentation"],"antonyms":["consolidation","integration","aggregation","merger"]}],"etymology":{"value":"The word is formed by adding the prefix \"un-\" (meaning \"not\" or \"opposite of\") to the noun \"consolidation\".","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnkənˌsɒlɪˈdeɪʃən/","syllables":"un-con-sol-i-da-tion"},"inflection":{"noun_plural":"unconsolidations"},"usage_notes":{"explanation":"\"Unconsolidation\" refers to the reverse process of consolidation. It's often used in business, finance, and economics to describe the separation of assets, companies, or industries that were previously combined. It can also refer to a general process of breaking something down into smaller parts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unconsolidation was a surprise to everyone.","correct":"✓ The deconsolidation was a surprise to everyone.","note":"While \"unconsolidation\" is a valid word, \"deconsolidation\" is more commonly used, especially in financial contexts."}],"priority":"★☆☆"},"related_words":{"derivatives":["unconsolidated (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unconsolidation' is a technical term, primarily used in business, finance, and economics. It describes the process of separating entities or assets that were previously combined. Due to its specific context and relatively low frequency, it's considered a complex term."},"example_sentences":[{"sentence":"The bank announced the unconsolidation of its subsidiary.","translation":"銀行は子会社の統合解除を発表した。","type":"noun","meaning_category":"統合解除"},{"sentence":"Market unconsolidation can lead to increased competition.","translation":"市場の統合解除は、競争の激化につながる可能性がある。","type":"noun","meaning_category":"非統合"}]}