{"word":"clothesbag","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"衣類バッグ、衣服バッグ","english_definition":"A bag specifically designed for carrying clothes, often to protect them from wrinkles or damage during travel or storage.","examples":[{"sentence":"She packed her dress in a clothesbag to keep it from getting wrinkled.","translation":"彼女はドレスがしわにならないように、衣類バッグに詰めた。"},{"sentence":"He stored his suits in clothesbags to protect them from moths.","translation":"彼はスーツを蛾から守るために、衣類バッグに入れて保管した。"}],"collocations":["pack a clothesbag","store clothes in a clothesbag","carry a clothesbag"],"synonyms":["garment bag","suit bag","dress bag"],"antonyms":[]}],"etymology":{"value":"Combination of \"clothes\" (plural of \"cloth,\" referring to garments) and \"bag\" (a container).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkloʊðzbæɡ/","syllables":"clothes-bag"},"inflection":{"noun_plural":"clothesbags"},"usage_notes":{"explanation":"The term \"clothesbag\" is generally interchangeable with \"garment bag,\" \"suit bag,\" or \"dress bag.\" It refers to a bag made of fabric or plastic, often with a zipper, used to protect clothing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I put my clothes in a clothebag.","correct":"✓ I put my clothes in a clothesbag.","note":"The correct spelling is \"clothesbag,\" with an \"s\" at the end of \"clothes.\" This indicates that the bag is for multiple items of clothing."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"The word \"clothesbag\" is a compound noun that is relatively straightforward. It combines \"clothes,\" which refers to items worn on the body, and \"bag,\" which is a container. The word is used to describe a bag specifically designed for carrying clothes, often to protect them during travel or storage. It is a fairly specific term, so it may not be as commonly used as more general terms like \"suitcase\" or \"bag.\""},"example_sentences":[{"sentence":"He carefully placed his tuxedo in the clothesbag before the trip.","translation":"彼は旅行の前にタキシードをしわにならないように丁寧に衣類バッグに入れた。","type":"general","meaning_category":"general"},{"sentence":"The clothesbag has a zipper to keep the dust out.","translation":"その衣類バッグにはほこりが入らないようにジッパーが付いている。","type":"description","meaning_category":"description"},{"sentence":"She bought a new clothesbag for her daughter's dance costumes.","translation":"彼女は娘のダンス衣装のために新しい衣類バッグを買った。","type":"example","meaning_category":"example"}]}