{"word":"revalorization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(通貨の)再評価、切り上げ","english_definition":"The act or process of increasing the value of a currency in relation to other currencies.","examples":[{"sentence":"The government announced the revalorization of the national currency.","translation":"政府は自国通貨の再評価を発表した。"},{"sentence":"Revalorization can help reduce inflation but may hurt exports.","translation":"再評価はインフレを抑制するのに役立つが、輸出に悪影響を及ぼす可能性がある。"}],"collocations":["currency revalorization","economic revalorization"],"synonyms":["currency appreciation","currency strengthening","upvaluation"],"antonyms":["devaluation"]},{"part_of_speech":"noun","definition":"(価値の)再評価、見直し","english_definition":"The act or process of reassessing and increasing the value or importance of something.","examples":[{"sentence":"There is a growing revalorization of traditional crafts.","translation":"伝統工芸の再評価が進んでいる。"},{"sentence":"The revalorization of historical sites is important for tourism.","translation":"史跡の再評価は観光にとって重要である。"}],"collocations":["cultural revalorization","historical revalorization"],"synonyms":["reassessment","re-evaluation","reappraisal"],"antonyms":["devaluation","downgrading"]}],"etymology":{"value":"'Re-' (again) + 'valorization' (the act of giving value to something). Valorization comes from 'valor,' meaning worth or value.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːvæləraɪˈzeɪʃən/","syllables":"re-val-or-i-za-tion"},"inflection":{"noun_plural":"revalorizations"},"usage_notes":{"explanation":"'Revalorization' generally refers to increasing the value of something that was previously undervalued. In economics, it specifically refers to a currency's value. In broader contexts, it can refer to the renewed appreciation of cultural, historical, or artistic elements.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The revalorization of the company's stock was unexpected.","correct":"✓ The revaluation of the company's stock was unexpected.","note":"While 'revalorization' can be used in a general sense of reassessing value, 'revaluation' is more commonly used in financial contexts, especially concerning assets like stocks."}],"priority":"★★☆"},"related_words":{"derivatives":["revalorize (verb)"],"related":["valorization","value","revaluation"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Revalorization' is a formal term referring to the act of increasing the value or importance of something, often after a period of undervaluation. It's used in economics to describe currency appreciation and in cultural contexts to describe renewed appreciation for traditions or historical sites. The term implies a deliberate effort to restore or enhance perceived value."},"example_sentences":[{"sentence":"The city's revalorization of its waterfront has attracted new businesses.","translation":"その都市のウォーターフロントの再評価は、新しいビジネスを引き寄せた。","type":"noun","meaning_category":"再評価 (価値)"},{"sentence":"Economists debated the potential effects of currency revalorization on the trade balance.","translation":"経済学者たちは、通貨再評価が貿易収支に及ぼす可能性のある影響について議論した。","type":"noun","meaning_category":"再評価 (通貨)"}]}