{"word":"tune-skilled","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"音感の良い、音程を正確に歌える、調律の腕が良い","english_definition":"Having a good sense of pitch and the ability to sing in tune; skilled at tuning instruments.","examples":[{"sentence":"The choir director sought tune-skilled singers for the challenging soprano parts.","translation":"合唱団の指揮者は、難しいソプラノパートのために音感の良い歌手を探した。"},{"sentence":"A tune-skilled pianist can easily transpose melodies into different keys.","translation":"音感の良いピアニストは、簡単にメロディーを異なるキーに移調できる。"},{"sentence":"The tune-skilled technician meticulously adjusted the strings of the violin.","translation":"調律の腕が良い技術者は、バイオリンの弦を細心の注意を払って調整した。"}],"collocations":["tune-skilled singer (音感の良い歌手)","tune-skilled musician (音感の良い音楽家)","tune-skilled ear (音感の良い耳)","tune-skilled instrument technician (調律の腕が良い楽器技術者)"],"synonyms":["melodically gifted","musically adept","pitch-perfect","harmonically sensitive","intonationally accurate"],"antonyms":["tone-deaf","unmusical","out of tune"]},{"part_of_speech":"adjective","definition":"(比喩的に)状況や感情にうまく対応できる、機転が利く","english_definition":"(Figurative) Able to adapt well to situations or emotions; having a good sense of what is appropriate.","examples":[{"sentence":"A tune-skilled diplomat can navigate complex negotiations with grace.","translation":"機転が利く外交官は、複雑な交渉を優雅に進めることができる。"},{"sentence":"The tune-skilled manager knew how to motivate each member of the team.","translation":"状況にうまく対応できるマネージャーは、チームの各メンバーをどのようにやる気にさせるかを知っていた。"},{"sentence":"Her tune-skilled response diffused the tension in the room.","translation":"彼女の機転の利いた返答は、部屋の緊張を和らげた。"}],"collocations":["tune-skilled diplomat (機転が利く外交官)","tune-skilled negotiator (交渉上手な人)","tune-skilled response (機転の利いた返答)","tune-skilled approach (状況に合わせたアプローチ)"],"synonyms":["adaptable","resourceful","tactful","diplomatic","perceptive"],"antonyms":["insensitive","clumsy","inept"]}],"etymology":{"value":"Compound word combining \"tune\" (referring to musical pitch or melody) and \"skilled\" (having or showing skill).","priority":"★★★"},"pronunciation":{"ipa":"/ˈtjuːnˌskɪld/","syllables":"tune-skilled"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"The adjective \"tune-skilled\" describes someone who possesses a natural aptitude for music, particularly in terms of pitch and intonation. It can refer to a singer who can accurately reproduce notes or a musician who is adept at tuning instruments. Figuratively, it can describe someone who is skilled at adapting to different situations or understanding subtle nuances.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He is a tune-skilled in piano.","correct":"He is tune-skilled at piano.","note":"Use \"at\" to indicate proficiency in a specific instrument or activity."},{"incorrect":"She is a tune-skilled person.","correct":"She is a tune-skilled musician/singer.","note":"It's better to specify the area of skill (e.g., musician, singer) rather than just saying \"person\"."}],"priority":"★★☆"},"related_words":{"derivatives":["tune (noun, verb)","skill (noun)","skilled (adjective)"],"related_concepts":["perfect pitch","relative pitch","intonation","harmony","melody"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR vocabulary lists)","frequency_google_ngram":"Low frequency (relatively rare in general usage)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"tune-skilled\" is a relatively uncommon adjective that describes someone with a high level of musical ability, particularly in terms of pitch and intonation. It can also be used figuratively to describe someone who is adaptable and perceptive. Because it is not a common word, it may require some context to understand its meaning fully.","priority":"★★☆"},"example_sentences":[{"sentence":"The tune-skilled violinist captivated the audience with her flawless performance.","translation":"その音感の良いバイオリニストは、完璧な演奏で聴衆を魅了した。","type":"adjective","meaning_category":"音感の良い"},{"sentence":"A tune-skilled ear is essential for a professional audio engineer.","translation":"音感の良い耳は、プロのオーディオエンジニアにとって不可欠だ。","type":"adjective","meaning_category":"音感の良い"},{"sentence":"The negotiator's tune-skilled approach helped to bridge the gap between the two parties.","translation":"交渉担当者の機転の利いたアプローチは、両者の間の溝を埋めるのに役立った。","type":"adjective","meaning_category":"状況や感情にうまく対応できる"}]}