{"word":"tarsadenitis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"瞼板腺炎（けんばんせんえん）","english_definition":"Inflammation of the tarsal glands (Meibomian glands) in the eyelids.","examples":[{"sentence":"Tarsadenitis can cause discomfort and redness in the eyelids.","translation":"瞼板腺炎は、まぶたに不快感や赤みを引き起こすことがあります。"},{"sentence":"Treatment for tarsadenitis may include warm compresses and antibiotics.","translation":"瞼板腺炎の治療には、温湿布や抗生物質が含まれる場合があります。"}],"collocations":["chronic tarsadenitis (慢性瞼板腺炎)","acute tarsadenitis (急性瞼板腺炎)"],"synonyms":["Meibomian gland dysfunction (MGD)","posterior blepharitis"],"antonyms":[]}],"etymology":{"value":"The term 'tarsadenitis' is derived from the following Greek roots: 'tarsos' (referring to the tarsal plate of the eyelid), 'aden' (referring to a gland), and '-itis' (indicating inflammation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtɑːrsædɪˈnaɪtɪs/","syllables":"tar-sad-e-ni-tis"},"inflection":{"noun_plural":"tarsadenitides (rare)"},"usage_notes":{"explanation":"Tarsadenitis specifically refers to inflammation of the Meibomian glands, which are oil-producing glands located in the tarsal plates of the eyelids. This condition is often associated with Meibomian gland dysfunction (MGD) and can contribute to dry eye syndrome.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Tarsadenitis is a type of conjunctivitis.","correct":"✓ Tarsadenitis is an inflammation of the Meibomian glands.","note":"Tarsadenitis affects the Meibomian glands, while conjunctivitis affects the conjunctiva (the membrane lining the eyelids and covering the white part of the eye)."},{"incorrect":"✗ Tarsadenitis is treated with eye drops only.","correct":"✓ Tarsadenitis may be treated with warm compresses, eyelid hygiene, and sometimes antibiotics.","note":"Treatment often involves a combination of approaches, not just eye drops."}],"priority":"★★☆"},"related_words":{"derivatives":["tarsal (adjective: relating to the tarsus of the eyelid)","adenitis (noun: inflammation of a gland)","blepharitis (noun: inflammation of the eyelids)"],"medical_terms":["Meibomian gland dysfunction (MGD)","chalazion (noun: a cyst in the eyelid caused by blocked Meibomian glands)","dry eye syndrome"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tarsadenitis' is a medical term referring to the inflammation of the Meibomian glands located in the eyelids. Understanding this term requires familiarity with medical terminology related to eye anatomy and inflammatory conditions. It is commonly discussed in the context of ophthalmology and optometry.","explanation":"'Tarsadenitis' is a medical term referring to the inflammation of the Meibomian glands located in the eyelids. Understanding this term requires familiarity with medical terminology related to eye anatomy and inflammatory conditions. It is commonly discussed in the context of ophthalmology and optometry."},"example_sentences":[{"sentence":"The patient presented with symptoms indicative of tarsadenitis, including redness and swelling of the eyelids.","translation":"患者は、まぶたの赤みや腫れなど、瞼板腺炎を示唆する症状を呈した。","type":"medical","meaning_category":"symptoms"},{"sentence":"Proper eyelid hygiene is crucial in managing tarsadenitis and preventing recurrence.","translation":"適切なまぶたの衛生状態は、瞼板腺炎の管理と再発防止に不可欠である。","type":"treatment","meaning_category":"management"},{"sentence":"Severe cases of tarsadenitis may require systemic antibiotics to control the inflammation.","translation":"重症の瞼板腺炎では、炎症を抑えるために全身性抗生物質が必要になることがある。","type":"treatment","meaning_category":"treatment"}]}