{"word":"antigrowth","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"反成長論、脱成長論","english_definition":"opposition to economic growth, typically advocating for a smaller, more sustainable economy.","examples":[{"sentence":"The antigrowth movement is gaining momentum in some European countries.","translation":"反成長運動は、いくつかのヨーロッパ諸国で勢いを増している。"},{"sentence":"Antigrowth advocates argue that endless economic expansion is unsustainable.","translation":"反成長論者は、終わりのない経済拡大は持続可能ではないと主張している。"}],"collocations":["antigrowth movement","antigrowth policies","antigrowth economy"],"synonyms":["degrowth","post-growth","sustainable economy"],"antonyms":["pro-growth","economic growth","growth-oriented"]},{"part_of_speech":"adjective","definition":"反成長の、脱成長の","english_definition":"opposed to or advocating against economic growth.","examples":[{"sentence":"Antigrowth activists protested against the new highway project.","translation":"反成長活動家たちは、新しい高速道路プロジェクトに抗議した。"},{"sentence":"The antigrowth perspective challenges conventional economic thinking.","translation":"反成長の視点は、従来の経済的思考に挑戦する。"}],"collocations":["antigrowth activist","antigrowth perspective","antigrowth strategy"],"synonyms":["degrowth","post-growth"],"antonyms":["pro-growth","growth-oriented"]}],"etymology":{"value":"Formed from the prefix 'anti-' (against) and 'growth' (economic growth).","priority":"★★★"},"pronunciation":{"ipa":"/ˌæntiˈɡroʊθ/","syllables":"an-ti-growth"},"inflection":{"notes":"The noun is uncountable. The adjective does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Antigrowth' refers to the ideology and movement that opposes continuous economic growth, arguing that it is environmentally unsustainable and socially unjust. It advocates for alternative economic models that prioritize well-being, sustainability, and social equity over GDP growth. It is often used in discussions about environmentalism, economics, and politics.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The anti-growth is good for the environment.","correct":"✓ Antigrowth is good for the environment.","note":"'Antigrowth' itself can function as a noun referring to the concept or movement.  Avoid using 'the' before it in general statements."},{"incorrect":"✗ He is a very antigrowth person.","correct":"✓ He is an antigrowth advocate. / ✓ He is opposed to economic growth.","note":"While 'antigrowth' can be used as an adjective, it's more common to say someone is an 'antigrowth advocate' or 'opposed to economic growth' to describe their stance."}],"priority":"★★☆"},"related_words":{"derivatives":["degrowth","post-growth","sustainable development","ecological economics"],"phrases":["steady-state economy","circular economy","well-being economy"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, primarily used in academic and political discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Antigrowth' is a term used to describe ideas and movements that are against the idea that the economy must always grow. People who support 'antigrowth' believe that focusing on making the economy bigger all the time is bad for the environment and society. Instead, they suggest we should focus on things like making sure everyone has what they need, protecting the environment, and creating a more fair society, even if it means the economy doesn't get bigger. This term is often used in discussions about the environment, economics, and politics.","priority":"★★☆"},"example_sentences":[{"sentence":"The **antigrowth** movement challenges the assumption that economic growth is always beneficial.","translation":"反成長運動は、経済成長が常に有益であるという前提に異議を唱えている。","type":"noun","meaning_category":"反成長論"},{"sentence":"She is an **antigrowth** economist who advocates for a smaller, more sustainable economy.","translation":"彼女は、より小さく、より持続可能な経済を提唱する反成長経済学者である。","type":"adjective","meaning_category":"反成長の"},{"sentence":"**Antigrowth** policies aim to reduce consumption and promote resource conservation.","translation":"反成長政策は、消費を減らし、資源の保全を促進することを目的としている。","type":"adjective","meaning_category":"反成長の"},{"sentence":"The **antigrowth** perspective emphasizes the importance of ecological limits.","translation":"反成長の視点は、生態系の限界の重要性を強調する。","type":"noun","meaning_category":"反成長論"}]}