{"word":"slavery-supporting","meanings":[{"part_of_speech":"adjective","definition":"奴隷制を支持する、奴隷制を擁護する","english_definition":"Advocating for or defending the practice of slavery.","examples":[{"sentence":"The politician was criticized for his slavery-supporting views.","translation":"その政治家は、奴隷制を支持する見解を批判された。"},{"sentence":"The historical document reveals the slavery-supporting arguments of the time.","translation":"その歴史的文書は、当時の奴隷制を支持する議論を明らかにしている。"}],"synonyms":["pro-slavery","slavery advocate","defender of slavery"],"antonyms":["abolitionist","anti-slavery"],"related_words":["slavery","slaveholder","plantation","abolitionism"]}],"etymology":{"value":"Combination of 'slavery' (the state of being a slave) and 'supporting' (giving assistance or approval to).","notes":"The term directly describes the act of supporting or advocating for the institution of slavery."},"pronunciation":{"ipa":"/ˈsleɪvəri səˈpɔːrtɪŋ/","syllables":"sla-ve-ry sup-port-ing"},"usage_notes":{"explanation":"This term is used to describe individuals, groups, or ideologies that actively support or justify the practice of slavery. It carries a strong negative connotation due to the inherent injustice and human rights violations associated with slavery.","priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, but important in historical and political contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"This term is relatively straightforward, combining the well-known word 'slavery' with 'supporting'. Its meaning is easily understood as 'supporting slavery'. However, its usage often appears in complex discussions regarding historical injustices and ethical considerations, requiring a high level of reading comprehension."},"example_sentences":[{"sentence":"The book examines the economic factors that contributed to slavery-supporting ideologies in the antebellum South.","translation":"その本は、南北戦争前の南部における奴隷制を支持するイデオロギーに貢献した経済的要因を検証している。","type":"general"},{"sentence":"Many religious leaders of the time held slavery-supporting beliefs, citing biblical passages to justify the practice.","translation":"当時の多くの宗教指導者は、聖書の箇所を引用して奴隷制を正当化し、奴隷制を支持する信念を持っていた。","type":"historical"}]}