{"word":"night-struck","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"夜に打たれた、夜に魅せられた、夜に影響を受けた","english_definition":"Affected, influenced, or fascinated by the night; as if struck by the night.","examples":[{"sentence":"The night-struck traveler lost his way in the dark forest.","translation":"夜に魅せられた旅人は、暗い森の中で道に迷った。"},{"sentence":"She wandered through the city streets, a night-struck dreamer.","translation":"彼女は夜に魅せられた夢想家のように、街の通りをさまよった。"},{"sentence":"The artist painted a night-struck landscape, capturing the moon's eerie glow.","translation":"その画家は、月の不気味な光をとらえた、夜に影響を受けた風景を描いた。"}],"collocations":["night-struck traveler","night-struck dreamer","night-struck landscape","night-struck city","night-struck soul"],"synonyms":["night-touched","night-enchanted","night-obsessed","night-fascinated"],"antonyms":["day-struck","day-touched","day-enchanted"]},{"part_of_speech":"adjective","definition":"(比喩的に) 恐怖や驚きで麻痺した、打ちのめされた","english_definition":"(Figurative) Paralyzed or overwhelmed by fear or astonishment, as if struck by the night's darkness.","examples":[{"sentence":"He stood night-struck, unable to comprehend the tragedy.","translation":"彼は夜に打たれたかのように立ち尽くし、その悲劇を理解することができなかった。"},{"sentence":"The news left her night-struck and speechless.","translation":"その知らせは彼女を打ちのめし、言葉を失わせた。"},{"sentence":"They were night-struck by the sudden turn of events.","translation":"彼らは突然の事態の変化に打ちのめされた。"}],"collocations":["night-struck with fear","night-struck by grief","night-struck by the news","night-struck silence"],"synonyms":["stunned","paralyzed","overwhelmed","aghast","dumbfounded","speechless"],"antonyms":["unaffected","unmoved","calm","composed"]}],"etymology":{"value":"A compound word formed by combining \"night\" and \"struck.\" The word \"struck\" implies being hit or affected suddenly and powerfully, suggesting a strong influence or impact from the night.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnaɪtˌstrʌk/","syllables":"night-struck"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"\"Night-struck\" is a relatively uncommon word, often used in literary or descriptive contexts to convey a sense of being deeply affected or influenced by the night. It can describe a literal fascination with the night or a figurative state of being overwhelmed by fear, surprise, or tragedy. The word evokes a sense of mystery, darkness, and the unknown.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was night-strucking by the sight.","correct":"✓ He was night-struck by the sight.","note":"\"Night-struck\" is an adjective and does not have a continuous verb form (night-strucking)."},{"incorrect":"✗ She felt night-strucked.","correct":"✓ She felt night-struck.","note":"The past participle form \"night-strucked\" is incorrect. The correct form is \"night-struck.\""}],"priority":"★★☆"},"related_words":{"derivatives":["night","struck","stricken"],"related_terms":["moonstruck","starstruck","thunderstruck","sun-struck"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR vocabulary lists.)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Night-struck\" is a relatively uncommon and evocative word. It combines the familiar element of \"night\" with \"struck,\" implying a sudden and powerful impact or influence from the night. The word can be used to describe someone who is fascinated or enchanted by the night, or figuratively, someone who is overwhelmed or paralyzed by fear or astonishment. Understanding the metaphorical use of \"struck\" is key to grasping the meaning of this word. It is more likely to be encountered in literature or descriptive writing than in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The night-struck city shimmered with a million lights.","translation":"夜に魅せられた都市は、無数の光で輝いていた。","type":"adjective","meaning_category":"夜に魅せられた"},{"sentence":"He was night-struck by the horror of the battlefield.","translation":"彼は戦場の恐怖に打ちのめされた。","type":"adjective","meaning_category":"恐怖で麻痺した"},{"sentence":"The night-struck owl perched silently on the branch.","translation":"夜に魅せられたフクロウは、静かに枝にとまっていた。","type":"adjective","meaning_category":"夜に影響を受けた"},{"sentence":"She felt night-struck, as if the darkness had stolen her voice.","translation":"彼女は夜に打たれたかのように感じ、まるで闇が彼女の声を奪ったかのようだった。","type":"adjective","meaning_category":"驚きで麻痺した"}]}