{"word":"pasquilant","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A person who writes or circulates pasquils.","english_definition":"A writer or distributor of satirical lampoons or pasquils.","examples":[{"sentence":"The pasquilant was known for their sharp wit and ability to expose the hypocrisy of the powerful.","translation":"そのパスキル作者は、鋭い機知と権力者の偽善を暴く能力で知られていた。"}],"collocations":["anonymous pasquilant","political pasquilant"],"synonyms":["lampooner","satirist","libeler"],"antonyms":[],"notes":"This word is relatively rare and historical, primarily used in literary or historical contexts."}],"etymology":{"value":"Derived from 'pasquil', a type of satirical writing posted in public places, particularly in Rome during the Renaissance. The suffix '-ant' indicates a person associated with the activity.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpæskwɪlənt/","syllables":"pas-qui-lant"},"inflection":{"noun_plural":"pasquilants"},"usage_notes":{"explanation":"The term 'pasquilant' refers specifically to individuals involved in the creation or dissemination of pasquils, which are satirical or defamatory writings often posted anonymously in public. The word carries a historical and literary connotation, reflecting a period when such writings were a form of political and social commentary.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["pasquil (noun: a satirical writing)","pasquinade (noun: a satirical writing, similar to a pasquil)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pasquilant' is a rare and specialized word, primarily encountered in historical or literary contexts when discussing satirical writings and their authors. It signifies someone who creates or distributes pasquils, which were satirical lampoons often used for political or social commentary. Understanding this word requires familiarity with the historical practice of anonymous satirical writing.","notes":"This word is unlikely to be encountered outside of specialized academic or literary contexts."},"example_sentences":[{"sentence":"The identity of the pasquilant remained a mystery, adding to the intrigue surrounding the controversial writings.","translation":"そのパスキル作者の身元は謎のままであり、物議を醸す著作をめぐる陰謀をさらに深めた。","type":"general","meaning_category":"writer of pasquils"},{"sentence":"Many attributed the pasquils to a disgruntled courtier, but the true pasquilant was never definitively identified.","translation":"多くの人がパスキルを不満を抱いた廷臣のせいだと考えたが、真のパスキル作者は決して明確に特定されなかった。","type":"historical","meaning_category":"writer of pasquils"}]}