{"word":"Sandemanianism","priority":"低","meanings":[{"part_of_speech":"noun","definition":"サンデマン主義：18世紀にスコットランドで発展したカルヴァン主義の一派。信仰の実践と聖書の文字通りの解釈を重視する。","english_definition":"A Christian sect that originated in Scotland in the 18th century, emphasizing strict adherence to the Bible and a communal lifestyle.","examples":[{"sentence":"Sandemanianism was known for its emphasis on biblical literalism.","translation":"サンデマン主義は、聖書の文字通りの解釈を重視することで知られていた。"},{"sentence":"Some notable figures in science were associated with Sandemanianism.","translation":"科学における著名な人物の中には、サンデマン主義と関係があった者もいる。"}],"collocations":["adherent of Sandemanianism","beliefs of Sandemanianism"],"synonyms":["Glasites"],"antonyms":[]}],"etymology":{"value":"この用語は、この宗派の教義を広めたロバート・サンデマン（Robert Sandeman, 1718-1771）にちなんで名付けられた。","priority":"中"},"pronunciation":{"ipa":"/ˌsændɪˈmeɪniənɪzəm/","syllables":"San-de-ma-ni-an-ism"},"inflection":{},"usage_notes":{"explanation":"サンデマン主義は、ジョン・グラス（John Glas）によって始められた運動から発展した。信仰の実践的な側面と、初期キリスト教の共同体生活の再現を重視した。この宗派は、その厳格な規律と、世俗的な社会からの分離を特徴としていた。","priority":"中"},"common_mistakes":{},"related_words":{"derivatives":["Sandemanian (名詞/形容詞：サンデマン主義者、またはサンデマン主義の)"],"related_religious_movements":["Calvinism","Presbyterianism"],"people":["Robert Sandeman","John Glas"]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"Sandemanianism is a relatively obscure religious movement, so understanding it requires familiarity with religious history and theological concepts. The vocabulary associated with it is specialized and not commonly used."},"example_sentences":[{"sentence":"The principles of Sandemanianism led its followers to live a life separate from the broader society.","translation":"サンデマン主義の原則は、その信者をより広い社会から隔絶した生活へと導いた。","type":"general","meaning_category":"belief"},{"sentence":"Scholars have studied the influence of Sandemanianism on the scientific thought of Michael Faraday.","translation":"学者たちは、マイケル・ファラデーの科学的思考に対するサンデマン主義の影響を研究してきた。","type":"historical","meaning_category":"influence"}]}