{"word":"precondemnation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"先入観による非難、予断による有罪判決","english_definition":"condemnation in advance, without a fair hearing or trial; a judgment or sentence passed prematurely and without due process.","examples":[{"sentence":"The media's precondemnation of the suspect made it difficult to find an impartial jury.","translation":"メディアによる容疑者の予断的な非難は、公平な陪審員を見つけることを困難にした。"},{"sentence":"The report criticized the organization for its precondemnation of individuals based on incomplete evidence.","translation":"その報告書は、不完全な証拠に基づいて個人を予断的に非難したとして、その組織を批判した。"},{"sentence":"He argued that the public's precondemnation of him was unfair and based on misinformation.","translation":"彼は、自分に対する世間の予断的な非難は不当であり、誤った情報に基づいていると主張した。"}],"collocations":["media precondemnation","public precondemnation","avoid precondemnation","risk of precondemnation","unfair precondemnation"],"synonyms":["prejudgment","prejudice","bias","predetermination","premature judgment","unjust condemnation"],"antonyms":["fair trial","due process","impartial judgment","objective evaluation"]}],"etymology":{"value":"\"Pre-\" (before) + \"condemnation\" (the act of condemning). Indicates a condemnation or judgment made before proper investigation or due process.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːkɒndemˈneɪʃən/","syllables":"pre-con-dem-na-tion"},"inflection":{"noun_plural":"precondemnations"},"usage_notes":{"explanation":"The term \"precondemnation\" typically carries a negative connotation, implying unfairness and a lack of objectivity. It is often used in legal or political contexts to criticize the premature judgment of individuals or groups before all the facts are known or a fair trial has been conducted. It highlights the importance of due process and the presumption of innocence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The precondemnation was based on facts.","correct":"✓ The precondemnation was based on bias.","note":"Precondemnation implies a lack of objectivity, so it's usually based on prejudice or incomplete information, not facts."},{"incorrect":"✗ He supported the precondemnation.","correct":"✓ He criticized the precondemnation.","note":"Since precondemnation is generally seen as unfair, it is usually something that is criticized, not supported."}],"priority":"★★☆"},"related_words":{"derivatives":["precondemn (verb)"],"phrasal_verbs":[],"related_concepts":["due process","presumption of innocence","fair trial","impartiality","objectivity","prejudice","bias"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Precondemnation\" is a relatively rare and complex word that refers to the act of judging or condemning someone before all the facts are known or a fair trial has taken place. It implies a lack of objectivity and a violation of due process. The word is most often used in legal or political contexts to criticize unfair or biased judgments. Understanding the word requires a good grasp of abstract concepts such as fairness, justice, and impartiality."},"example_sentences":[{"sentence":"The senator accused the media of precondemnation, arguing that they had already convicted the defendant in the court of public opinion.","translation":"上院議員は、メディアが世論裁判で被告を有罪とすでに断定していると主張し、メディアの予断的な非難を非難した。","type":"noun","meaning_category":"先入観による非難"},{"sentence":"The organization sought to avoid any appearance of precondemnation by conducting a thorough and impartial investigation.","translation":"その組織は、徹底的かつ公平な調査を実施することにより、予断的な非難の印象を避けるように努めた。","type":"noun","meaning_category":"先入観による非難"},{"sentence":"The lawyer argued that the witness's testimony was tainted by precondemnation and should be excluded from the trial.","translation":"弁護士は、証人の証言は予断的な非難によって汚染されており、裁判から除外されるべきだと主張した。","type":"noun","meaning_category":"先入観による非難"}]}