{"word":"Tripura","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"トリプラ州（インド北東部の州）","english_definition":"A state in Northeast India.","examples":[{"sentence":"Tripura is known for its bamboo handicrafts.","translation":"トリプラ州は竹細工で知られています。"},{"sentence":"Agartala is the capital of Tripura.","translation":"アガルタラはトリプラ州の州都です。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name Tripura is believed to be derived from 'Tripura Sundari', the presiding deity of the Tripura Sundari Temple, one of the 51 Shakti Peethas. Some scholars suggest it comes from 'Tui-pra', meaning 'land near water' in the local Kokborok language.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtrɪpʊrə/","syllables":"Tri-pu-ra"},"inflection":{},"usage_notes":{"explanation":"Tripura is one of the smallest states in India, located in the northeastern part of the country. It is bordered by Bangladesh on three sides. The state has a rich cultural heritage and is known for its tribal traditions, bamboo and cane handicrafts, and historical sites.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Tripuri (adjective, noun): Relating to Tripura or its people/language.","Kokborok (noun): The main native language of Tripura."],"priority":"★★☆"},"level_frequency":{},"readability_explanation":{"level":"B2","text":"Tripura is a state in Northeast India. It is a proper noun, so it is always capitalized. The word is most commonly used in geographical or political contexts when discussing the region or its people. Understanding the term is helpful for those studying Indian geography, culture, or politics."},"example_sentences":[{"sentence":"The government of Tripura is working to improve infrastructure in the state.","translation":"トリプラ州政府は州内のインフラ改善に取り組んでいます。","type":"general","meaning_category":"political/geographical"},{"sentence":"Many people in Tripura are involved in agriculture.","translation":"トリプラ州では多くの人々が農業に従事しています。","type":"general","meaning_category":"economic"},{"sentence":"The traditional music of Tripura is very unique.","translation":"トリプラ州の伝統音楽は非常にユニークです。","type":"general","meaning_category":"cultural"}]}