{"word":"Mydriatine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A brand name for tropicamide, an anticholinergic drug used to dilate the pupil of the eye, usually for eye examinations.","english_definition":"A brand name for tropicamide, an anticholinergic drug used to dilate the pupil of the eye, usually for eye examinations.","examples":[{"sentence":"The optometrist used Mydriatine to dilate my pupils before the eye exam.","translation":"検眼医は眼科検査の前にミドリアチンを使って私の瞳孔を拡張しました。"}],"collocations":["dilate pupils with Mydriatine","eye examination with Mydriatine"],"synonyms":["tropicamide"],"antonyms":[]}],"etymology":{"value":"Derived from the drug's effect (mydriasis, pupil dilation) and a proprietary suffix.","priority":"★★★"},"pronunciation":{"ipa":"/maɪˈdraɪ.əˌtiːn/","syllables":"My-dri-a-tine"},"inflection":{"notes":"Singular noun. Plural form is Mydriatines, but rarely used."},"usage_notes":{"explanation":"Mydriatine is a specific brand name, so it is most appropriate to use when referring to the product sold under that name. In medical contexts, the generic name tropicamide may be preferred.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used Mydriatine to constrict my pupils.","correct":"✓ I used Mydriatine to dilate my pupils.","note":"Mydriatine is a mydriatic, which means it dilates (enlarges) the pupils, not constricts (shrinks) them."}],"priority":"★★☆"},"related_words":{"derivatives":["mydriasis (pupil dilation)","mydriatic (agent that causes pupil dilation)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency, specific to medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mydriatine' is a specialized term primarily used in medical and optometry contexts. It refers to a specific brand of tropicamide, a medication used to dilate the pupils for eye examinations. Understanding this term requires familiarity with medical terminology. In general conversation, it's more common to refer to the drug by its generic name, tropicamide, or simply as 'eye drops to dilate the pupils.'"},"example_sentences":[{"sentence":"The doctor prescribed Mydriatine eye drops for the fundus examination.","translation":"医師は眼底検査のためにミドリアチン点眼薬を処方しました。","type":"medical","meaning_category":"pupil dilation"}]}