{"word":"Stundism","priority":"低","meanings":[{"part_of_speech":"名詞","definition":"シュトゥンディズム（ロシア語: штундизм）: 19世紀後半にロシア帝国で発生したプロテスタント系の宗教運動。ドイツの敬虔主義の影響を受け、聖書研究と個人的な信仰体験を重視した。","english_definition":"Stundism (Russian: штундизм) was a Protestant religious movement that arose in the Russian Empire in the late 19th century. Influenced by German Pietism, it emphasized Bible study and personal religious experience.","examples":[{"sentence":"シュトゥンディズムは、正教会の権威に挑戦したため、政府から迫害を受けた。","translation":"Stundism was persecuted by the government because it challenged the authority of the Orthodox Church."},{"sentence":"シュトゥンディズムの信者は、農民や労働者を中心に広がった。","translation":"Followers of Stundism were mainly peasants and workers."}],"collocations":["シュトゥンディズムの信者 (followers of Stundism)","シュトゥンディズムの運動 (the Stundist movement)","シュトゥンディズムの迫害 (persecution of Stundism)"],"synonyms":["福音派 (Evangelicalism)","敬虔主義 (Pietism)"],"antonyms":["正教会 (Orthodox Church)"]}],"etymology":{"value":"「シュトゥンディズム」という名前は、ドイツ語の「Stunde」（時間、特に聖書研究の時間）に由来する。これは、シュトゥンディズムの信者が聖書研究会を重視したことにちなんでいる。","priority":"中"},"pronunciation":{"ipa":"[ˈʂtundʲɪzm]","syllables":"shtun-dizm"},"inflection":{"notes":"名詞（不可算）"},"usage_notes":{"explanation":"「シュトゥンディズム」は、歴史的な文脈で使用されることが多い。現代のロシアにおけるプロテスタントの状況を議論する際に言及されることがある。","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"シュトゥンディズムは、カトリックの一派である。","correct":"シュトゥンディズムは、プロテスタントの一派である。","note":"シュトゥンディズムはプロテスタント系の運動であり、カトリックとは異なる。"},{"incorrect":"シュトゥンディズムは、現代のロシアで最も信者の多い宗教である。","correct":"シュトゥンディズムは、歴史的に重要な宗教運動であったが、現代のロシアでは信者は少ない。","note":"シュトゥンディズムは、現代のロシアでは主流の宗教ではない。"}],"priority":"低"},"related_words":{"derivatives":["シュトゥンディスト (Stundist) - シュトゥンディズムの信者"],"phrasal_verbs":[],"priority":"低"},"level_frequency":{"CEFR":"該当なし","frequency_google_ngram":"非常に低い","priority":"低"},"readability_explanation":{"level":"C2","text":"「シュトゥンディズム」は、歴史的な宗教運動に関する専門的な用語であるため、一般の読者には馴染みが薄い。この単語を理解するには、19世紀後半のロシア帝国の宗教的・社会的背景に関する知識が必要となる。また、プロテスタント、敬虔主義、正教会などの関連用語についても理解していることが望ましい。"},"example_sentences":[{"sentence":"シュトゥンディズムは、ロシアの農村部で急速に広まり、多くの農民が正教会から離れてシュトゥンディズムに改宗した。","translation":"Stundism spread rapidly in rural Russia, with many peasants converting from the Orthodox Church to Stundism.","type":"歴史的記述"},{"sentence":"政府は、シュトゥンディズムを異端とみなし、信者たちを厳しく弾圧した。","translation":"The government considered Stundism to be heresy and severely repressed its followers.","type":"歴史的記述"}]}