{"word":"flexure","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"屈曲、湾曲、たわみ","english_definition":"the act of bending; a bend or curve; a state of being bent.","examples":[{"sentence":"The flexure of the metal indicated stress.","translation":"金属の屈曲は応力を示していた。"},{"sentence":"The river's flexure created a natural harbor.","translation":"川の湾曲が天然の港を作り出した。"},{"sentence":"The engineer calculated the flexure of the beam under load.","translation":"技師は荷重下での梁のたわみを計算した。"}],"collocations":["beam flexure (梁のたわみ)","spinal flexure (脊椎の屈曲)","geological flexure (地質学的屈曲)"],"synonyms":["bend","curve","curvature","deflection","inflection"],"antonyms":["straightness","rigidity"]},{"part_of_speech":"noun","definition":"(地質学)地層の曲がり、撓曲(とうきょく)","english_definition":"(geology) a bend or undulation in strata or other planar geological features.","examples":[{"sentence":"The flexure in the rock layers revealed the history of tectonic activity.","translation":"岩層の撓曲は、構造活動の歴史を明らかにした。"},{"sentence":"Mapping the flexures helped geologists understand the region's formation.","translation":"撓曲を地図にすることで、地質学者はその地域の形成を理解するのに役立った。"}],"collocations":["monoclinal flexure (単斜撓曲)","regional flexure (広域撓曲)"],"synonyms":["fold","bend","warp","distortion"],"antonyms":[]}],"etymology":{"value":"Late Latin *flexura* from Latin *flectere* 'to bend'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈflɛks(j)ər/","syllables":"flex-ure"},"inflection":{"noun_plural":"flexures"},"usage_notes":{"explanation":"'Flexure' is often used in technical contexts, such as engineering and geology, to describe the bending or curving of materials or geological formations. In general usage, it refers to the act of bending or the state of being bent. It is less common in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The flexure of his arm was painful.","correct":"✓ The bending of his arm was painful.","note":"In general contexts, 'bending' is more common than 'flexure' when referring to body parts."}],"priority":"★☆☆"},"related_words":{"derivatives":["flex (verb): to bend or contract","flexible (adjective): capable of bending easily without breaking.","inflexible (adjective): not capable of being bent; rigid.","flexuous (adjective): full of bends and curves; winding."],"phrasal_verbs":[],"related_terms":["inflection (linguistics): a change in the form of a word)","reflection (physics): the throwing back by a body or surface of light, heat, or sound without absorbing it."]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Flexure' is a relatively uncommon word, primarily used in technical or scientific contexts. It refers to the act of bending something or the resulting bend or curve. It is often used in engineering to describe how materials bend under stress, or in geology to describe bends in rock layers. If you are not working in one of these fields, you are unlikely to encounter this word frequently."},"example_sentences":[{"sentence":"The bridge's design accounted for the metal's expected **flexure** under heavy traffic.","translation":"橋の設計は、交通量の多い状況下で予想される金属のたわみを考慮に入れている。","type":"noun","meaning_category":"たわみ (engineering)"},{"sentence":"Geologists studied the **flexures** in the rock formations to understand the region's tectonic history.","translation":"地質学者は、その地域の構造史を理解するために、岩層の撓曲を研究した。","type":"noun","meaning_category":"撓曲 (geology)"},{"sentence":"The **flexure** of the dancer's spine allowed for graceful movements.","translation":"ダンサーの脊椎の屈曲が優雅な動きを可能にした。","type":"noun","meaning_category":"屈曲 (general)"}]}