{"word":"illocality","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"非局所性、非局在性：あるエンティティ（例えば、物理的なオブジェクト、情報、効果など）が特定の場所や領域に限定されず、空間的に分離された複数の場所に同時に存在するか、または即座に影響を及ぼす性質。","english_definition":"The property of an entity (e.g., a physical object, information, or effect) not being confined to a specific location or region, but existing simultaneously in or instantaneously affecting multiple spatially separated locations.","examples":[{"sentence":"Quantum entanglement demonstrates illocality, where the state of one particle instantaneously influences another, regardless of the distance between them.","translation":"量子エンタングルメントは非局所性を示す。一方の粒子の状態が、それらの間の距離に関係なく、もう一方の粒子に即座に影響を与える。"},{"sentence":"Some theories propose that consciousness exhibits illocality, suggesting that awareness is not solely confined to the brain.","translation":"いくつかの理論は、意識が非局所性を示すと提唱しており、認識が脳だけに限定されないことを示唆している。"},{"sentence":"The concept of illocality challenges classical notions of space and time.","translation":"非局所性の概念は、空間と時間に関する古典的な概念に挑戦する。"}],"collocations":["quantum illocality (量子非局所性)","non-local correlation (非局所的相関)","spatial illocality (空間的非局所性)","temporal illocality (時間的非局所性)"],"synonyms":["non-locality","nonlocality","delocalization","ubiquity"],"antonyms":["locality","localization","spatial confinement"]},{"part_of_speech":"noun","definition":"(哲学、形而上学)場所の概念からの独立性、場所への依存の欠如。","english_definition":"(Philosophy, Metaphysics) Independence from the concept of place; lack of dependence on location.","examples":[{"sentence":"In certain philosophical frameworks, the soul is considered to possess illocality, transcending physical boundaries.","translation":"特定の哲学的枠組みでは、魂は非局所性を持つと考えられており、物理的な境界を超越している。"},{"sentence":"The illocality of abstract concepts allows them to be universally understood, regardless of geographical location.","translation":"抽象的な概念の非局所性により、地理的な場所に関係なく、普遍的に理解されることが可能になる。"}],"collocations":["metaphysical illocality (形而上学的非局所性)","conceptual illocality (概念的非局所性)"],"synonyms":["transcendence","immateriality","universality"],"antonyms":["materiality","particularity","dependence"]}],"etymology":{"value":"Derived from the prefix 'il-' (meaning 'not') and 'locality' (the condition of being local or confined to a place).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪləʊˈkæləti/","syllables":"il-lo-cal-i-ty"},"inflection":{"noun_plural":"illocalities"},"usage_notes":{"explanation":"'Illocality' is primarily used in physics, particularly in the context of quantum mechanics, to describe phenomena where spatial separation does not prevent immediate correlation or influence. It is also used in philosophical and metaphysical discussions to describe concepts or entities that are not bound by physical location. The term is relatively technical and not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The illocality of the event made it difficult to attend.","correct":"✓ The ubiquity of the event made it difficult to avoid.","note":"'Illocality' refers to non-confinement to a location, not difficulty in attending. 'Ubiquity' (being everywhere) is more appropriate in this context."},{"incorrect":"✗ The illocality of the rumor spread quickly.","correct":"✓ The rumor spread quickly.","note":"While rumors can spread widely, 'illocality' is not the correct term to describe this. Simply stating that the rumor spread quickly is sufficient."}],"priority":"★☆☆"},"related_words":{"derivatives":["illocal (adjective: 非局所的な)","non-local (adjective: 非局所的な)","delocalized (adjective: 非局在化した)"],"related_concepts":["quantum entanglement (量子エンタングルメント)","quantum nonlocality (量子非局所性)","Bell's theorem (ベルの定理)","spooky action at a distance (アインシュタインが提唱した「遠隔作用」)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (highly specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Illocality' is a highly technical term primarily used in physics and philosophy. It describes the state of something not being confined to a specific location, often implying instantaneous connections or influences across distances, particularly in quantum mechanics. Understanding this term requires familiarity with advanced concepts in these fields. It is rarely used in general conversation."},"example_sentences":[{"sentence":"The EPR paradox highlighted the potential illocality inherent in quantum mechanics.","translation":"EPRパラドックスは、量子力学に内在する潜在的な非局所性を浮き彫りにした。","type":"noun","meaning_category":"非局所性 (物理学)"},{"sentence":"Critics of materialism argue for the illocality of consciousness, suggesting it extends beyond the physical brain.","translation":"唯物論の批判者たちは、意識の非局所性を主張し、それが物理的な脳を超えて広がっていることを示唆している。","type":"noun","meaning_category":"非局所性 (哲学)"},{"sentence":"The experiment aimed to test the limits of illocality in entangled photons.","translation":"その実験は、エンタングルした光子における非局所性の限界をテストすることを目的としていた。","type":"noun","meaning_category":"非局所性 (物理学)"}]}