{"word":"scrappily","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"ばらばらに、不ぞろいに、寄せ集めで、間に合わせで、粗末に、みすぼらしく","english_definition":"in a disorganized, untidy, or makeshift manner; using scraps or leftovers; poorly or shoddily.","examples":[{"sentence":"The project was put together scrappily, using whatever materials were available.","translation":"そのプロジェクトは、手に入る材料を寄せ集めて、間に合わせに組み立てられた。"},{"sentence":"The team played scrappily in the first half, but improved in the second.","translation":"チームは前半はばらばらにプレーしたが、後半は改善した。"},{"sentence":"The old house was scrappily built and in need of repair.","translation":"その古い家は粗末に建てられており、修理が必要だった。"},{"sentence":"He dressed scrappily in old, mismatched clothes.","translation":"彼は古くて不ぞろいな服をみすぼらしく着ていた。"}],"collocations":["scrappily dressed","scrappily built","scrappily organized","scrappily put together"],"synonyms":["haphazardly","disorderly","untidily","shoddily","poorly","makeshiftly","roughly","patchily"],"antonyms":["neatly","tidily","organizedly","carefully","meticulously"]}],"etymology":{"value":"\"Scrappily\" is derived from the adjective \"scrappy,\" which comes from \"scrap.\" \"Scrap\" originally meant a small piece or fragment, often leftover material. The suffix \"-ily\" is added to form the adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskræpɪli/","syllables":"scrap-pi-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"\"Scrappily\" describes something done in a disorganized, makeshift, or untidy way, often using whatever is available. It can refer to physical construction, organization, or even someone's appearance or performance. The implication is that the result is not of high quality or well-planned.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He scrappily wrote the letter.","correct":"✓ He hastily wrote the letter.","note":"While \"scrappily\" can imply a lack of care, it usually refers to the method or materials used, not the speed. \"Hastily\" is better for describing quickly written text."},{"incorrect":"✗ The meal was scrappily.","correct":"✓ The meal was prepared scrappily.","note":"\"Scrappily\" is an adverb and needs a verb to modify. You can't say \"The meal was scrappily,\" but you can say \"The meal was prepared scrappily.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["scrappy (adjective)","scrap (noun, verb)"],"phrasal_verbs":[],"related_adverbs":["haphazardly","shoddily","roughly"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Scrappily\" is a relatively uncommon adverb describing something done in a disorganized, makeshift, or untidy manner. It suggests a lack of planning or resources, resulting in a poor or haphazard outcome. It's often used to describe things that are put together quickly and without much care, using whatever is available. Understanding the root word \"scrap\" (a small piece or fragment) helps to grasp the meaning of \"scrappily.\" It is not a word commonly used in everyday conversation, but you may encounter it in descriptive writing or more formal contexts."},"example_sentences":[{"sentence":"The garden was planted scrappily with a mix of flowers and vegetables.","translation":"庭は花と野菜がばらばらに植えられていた。","type":"adverb","meaning_category":"disorganized"},{"sentence":"The repairs to the car were done scrappily, and it soon broke down again.","translation":"車の修理は粗末に行われ、すぐにまた故障した。","type":"adverb","meaning_category":"poorly"},{"sentence":"The report was scrappily written and difficult to understand.","translation":"レポートは粗雑に書かれており、理解するのが難しかった。","type":"adverb","meaning_category":"untidily"}]}