{"word":"crown-of-jewels","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of succulent plant in the genus Euphorbia, known for its thorny stems and colorful bracts that resemble a crown.","english_definition":"A succulent plant of the genus Euphorbia milii, characterized by its thorny stems and colorful bracts surrounding small flowers.","examples":[{"sentence":"The crown-of-jewels plant is drought-tolerant and easy to care for.","translation":"クラウンオブジュエルズは乾燥に強く、手入れが簡単です。"},{"sentence":"The bright red bracts of the crown-of-jewels add color to the garden.","translation":"クラウンオブジュエルズの鮮やかな赤い苞は庭に彩りを添えます。"}],"collocations":["plant crown-of-jewels","grow crown-of-jewels","crown-of-jewels flower","red crown-of-jewels","yellow crown-of-jewels"],"synonyms":["Euphorbia milii"],"antonyms":[]}],"etymology":{"value":"The name 'crown-of-jewels' refers to the plant's thorny stems which form a crown-like structure, and the colorful bracts that resemble jewels.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkraʊn əv ˈdʒuːəlz/","syllables":"crown-of-jew-els"},"inflection":{"notes":"Plural form: crown-of-jewels plants"},"usage_notes":{"explanation":"The term 'crown-of-jewels' is primarily used to refer to the plant Euphorbia milii. It is a popular ornamental plant grown in gardens and as a houseplant.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ crowns-of-jewel","correct":"✓ crown-of-jewels","note":"The correct name of the plant is 'crown-of-jewels' not 'crowns-of-jewel'."}],"priority":"★★☆"},"related_words":{"derivatives":["Euphorbia (genus)","succulent (general term for plants like crown-of-jewels)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Crown-of-jewels' refers to a specific type of succulent plant. Understanding the term requires some familiarity with botany and gardening. The plant is known for its distinctive appearance, with thorny stems and colorful bracts. The term is not commonly used in general conversation, but is recognized among gardening enthusiasts."},"example_sentences":[{"sentence":"She added a crown-of-jewels to her succulent collection.","translation":"彼女は多肉植物コレクションにクラウンオブジュエルズを追加しました。","type":"noun","meaning_category":"plant"},{"sentence":"The crown-of-jewels plant is native to Madagascar.","translation":"クラウンオブジュエルズはマダガスカル原産です。","type":"noun","meaning_category":"plant origin"}]}