{"word":"non-factorability","priority":"low","meanings":[{"part_of_speech":"noun","definition":"The property of not being able to be factored; the state of being non-factorable.","english_definition":"The inability of a mathematical expression (such as a polynomial or integer) to be expressed as a product of simpler expressions or factors.","examples":[{"sentence":"The non-factorability of this polynomial makes it difficult to solve.","translation":"この多項式の非因数分解性により、解くのが難しくなっています。"},{"sentence":"Determining the non-factorability of large numbers is crucial in cryptography.","translation":"大きな数の非因数分解性を判断することは、暗号化において非常に重要です。"}],"collocations":["prime number non-factorability","polynomial non-factorability","integer non-factorability"],"synonyms":["irreducibility","unfactorability"],"antonyms":["factorability"],"related_terms":["factor","factorization","prime number","polynomial","irreducible polynomial"]}],"etymology":{"value":"Formed by adding the prefix 'non-' to 'factorability'.","priority":"low"},"pronunciation":{"ipa":"/ˌnɒnˌfæktərəˈbɪləti/","syllables":"non-fac-tor-a-bil-i-ty"},"inflection":{"noun_plural":"non-factorabilities"},"usage_notes":{"explanation":"'Non-factorability' is primarily used in mathematical contexts, specifically in number theory and algebra. It refers to the characteristic of a mathematical object (like a number or polynomial) that cannot be broken down into smaller, simpler factors.","priority":"medium"},"level_frequency":{"level":"Advanced (Mathematics)","frequency_google_ngram":"Very low","priority":"low"},"readability_explanation":{"level":"C2","text":"'Non-factorability' is a term primarily used in advanced mathematics. It describes the property of a number or polynomial that cannot be expressed as a product of smaller factors. Understanding this term requires a solid foundation in algebra and number theory."},"example_sentences":[{"sentence":"The security of the RSA algorithm relies on the non-factorability of large composite numbers into their prime factors.","translation":"RSAアルゴリズムのセキュリティは、大きな合成数を素因数に分解できないことに依存しています。","type":"Technical","meaning_category":"Mathematics"},{"sentence":"The professor explained the conditions under which a polynomial exhibits non-factorability over a given field.","translation":"教授は、多項式が特定のフィールド上で非因数分解性を示す条件を説明しました。","type":"Academic","meaning_category":"Mathematics"}]}