{"word":"Booma","priority":"☆☆☆","meanings":[{"part_of_speech":"proper noun","definition":"(主にオンラインゲームやコミュニティで使用されるスラング)ブーマー、中高年層のプレイヤーを指す侮蔑的な言葉。","english_definition":"(slang, mainly used in online games and communities) A derogatory term referring to boomer, middle-aged or older players.","examples":[{"sentence":"That Booma keeps complaining about the game being too hard.","translation":"あのブーマーはゲームが難しすぎると文句ばかり言っている。"},{"sentence":"Don't listen to the Boomas, they don't know what they're talking about.","translation":"ブーマーの言うことを聞くな、彼らは何も分かっていない。"}],"collocations":["Okay Booma (ブーマーは黙ってろ)","booma mentality (ブーマーの考え方)"],"synonyms":["Boomer","Old man","Fossil"],"antonyms":["Zoomer","Kid","Newbie"]}],"etymology":{"value":"「Boomer」という言葉に由来し、ベビーブーム世代（1946年～1964年生まれ）を指す。オンラインコミュニティで、ゲームの腕前や考え方が古い中高年層のプレイヤーを揶揄する際に使われる。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈbuːmə/","syllables":"Boo-ma"},"inflection":{},"usage_notes":{"explanation":"「**Booma**」は、主にオンラインゲームやコミュニティで使用されるスラングで、ベビーブーム世代（Boomer）を指す侮蔑的な言葉です。ゲームの腕前や考え方が古い中高年層のプレイヤーを揶揄する際に使われます。相手を侮辱する意図が含まれるため、使用には注意が必要です。より若い世代のプレイヤーが、年配のプレイヤーを批判したり、意見を軽視したりする際に用いられます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Booma because he is very skilled at the game.","correct":"✓ He is a Booma because he doesn't understand the new game mechanics.","note":"「Booma」は、ゲームが下手だったり、新しいゲームの仕組みを理解できなかったりする年配のプレイヤーを指す言葉として使われます。"},{"incorrect":"✗ Booma is a respectful term for older gamers.","correct":"✓ Booma is a derogatory term for older gamers.","note":"「Booma」は侮蔑的な意味合いを持つ言葉であり、敬意を表する言葉ではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":["Boomer (ベビーブーム世代)"],"phrases":["Okay Boomer (ブーマーは黙ってろ)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"低頻度 (Low frequency) - スラングであり、一般的な語彙ではない。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Booma**」は、主にオンラインゲームやコミュニティで使用されるスラングで、年配のプレイヤーを指す侮蔑的な言葉です。ベビーブーム世代（1946年～1964年生まれ）を指す「Boomer」に由来し、ゲームの腕前や考え方が古いプレイヤーを揶揄する際に使われます。相手を侮辱する意図が含まれるため、使用には注意が必要です。オンラインコミュニティに特有の言葉であり、一般的な会話ではほとんど使われません。"},"example_sentences":[{"sentence":"The chat was full of 'Okay Booma' responses whenever he gave advice.","translation":"彼がアドバイスをするたびに、チャットは「ブーマーは黙ってろ」という反応でいっぱいになった。","type":"proper noun","meaning_category":"侮蔑的な言葉"},{"sentence":"Some players use 'Booma' as a quick insult during heated online matches.","translation":"一部のプレイヤーは、激しいオンライン対戦中に「ブーマー」をちょっとした侮辱として使う。","type":"proper noun","meaning_category":"侮蔑的な言葉"}]}