{"word":"epilepsy-resistant","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(医学)てんかん発作を起こしにくい、てんかんに対する抵抗性を持つ","english_definition":"(medicine) Less likely to experience epileptic seizures; possessing resistance to epilepsy.","examples":[{"sentence":"The new medication aims to make patients epilepsy-resistant.","translation":"その新薬は、患者がてんかん発作を起こしにくくすることを目的としている。"},{"sentence":"Researchers are studying genetic factors that contribute to an epilepsy-resistant phenotype.","translation":"研究者たちは、てんかんに対する抵抗性を持つ表現型に寄与する遺伝的要因を研究している。"}],"collocations":["epilepsy-resistant mice (てんかん抵抗性マウス)","epilepsy-resistant cells (てんかん抵抗性細胞)","epilepsy-resistant brain (てんかん抵抗性脳)"],"synonyms":["seizure-resistant","antiepileptic","epilepsy-proof"],"antonyms":["epilepsy-prone","seizure-susceptible"],"notes":"This term is often used in medical and research contexts to describe individuals, animals, or cells that are less likely to develop or experience epileptic seizures."}],"etymology":{"value":"Formed by combining \"epilepsy\" (てんかん) with \"resistant\" (抵抗性のある).","priority":"N/A"},"pronunciation":{"ipa":"/ˌɛpɪˈlɛpsi rɪˈzɪstənt/","syllables":"ep-i-lep-sy re-sis-tant"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"The term 'epilepsy-resistant' is used in medical and scientific contexts to describe a state or characteristic of being less susceptible to epileptic seizures. It is often used when discussing potential treatments, genetic factors, or other mechanisms that can reduce the likelihood of seizures.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The patient is epilepsy-resistant to the medication.","correct":"The patient is resistant to the medication for epilepsy.","note":"'Epilepsy-resistant' describes the subject's inherent resistance to epilepsy itself, not their response to medication. To describe resistance to a medication, use 'resistant to the medication for epilepsy'."}],"priority":"N/A"},"related_words":{"derivatives":["epilepsy (てんかん)","resistant (抵抗性のある)","resistance (抵抗)"],"related_terms":["antiepileptic (抗てんかん薬)","seizure (発作)","phenotype (表現型)"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - primarily used in medical and research contexts.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Epilepsy-resistant' is a technical term used in medical and research fields to describe a state of reduced susceptibility to epileptic seizures. Understanding this term requires knowledge of medical terminology and concepts related to epilepsy. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The goal of gene therapy is to create epilepsy-resistant neurons.","translation":"遺伝子治療の目標は、てんかん発作を起こしにくいニューロンを作り出すことである。","type":"adjective","meaning_category":"てんかん抵抗性"},{"sentence":"Studies on epilepsy-resistant animal models can provide insights into the mechanisms of seizure control.","translation":"てんかん抵抗性動物モデルの研究は、発作制御のメカニズムに関する洞察を提供することができる。","type":"adjective","meaning_category":"てんかん抵抗性"}]}