{"word":"quasi-increased","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"準増加した、ほぼ増加した、見かけ上増加した","english_definition":"Having the appearance of being increased, but not necessarily in a genuine or complete sense; seemingly increased.","examples":[{"sentence":"The company reported quasi-increased profits due to accounting adjustments.","translation":"その会社は会計調整により、見かけ上増加した利益を報告した。"},{"sentence":"There was a quasi-increased demand for the product after the marketing campaign, but sales remained stagnant.","translation":"マーケティングキャンペーン後、その製品に対する需要はほぼ増加したように見えたが、売上は停滞したままであった。"},{"sentence":"The quasi-increased security measures gave a false sense of safety.","translation":"ほぼ増加したセキュリティ対策は、誤った安心感を与えた。"}],"collocations":["quasi-increased profits","quasi-increased demand","quasi-increased security","quasi-increased activity","quasi-increased spending"],"synonyms":["seemingly increased","apparently increased","ostensibly increased","nominally increased","virtually increased","pseudo-increased"],"antonyms":["decreased","reduced","diminished","actually decreased","genuinely decreased"]},{"part_of_speech":"verb","definition":"準増加した、ほぼ増加した、見かけ上増加した (quasi-increase の過去分詞形)","english_definition":"Past participle of the verb 'quasi-increase', meaning to appear to increase but not necessarily in a genuine or complete sense.","examples":[{"sentence":"The reported figures were quasi-increased to impress investors.","translation":"報告された数値は、投資家に印象を与えるために見かけ上増加された。"}],"collocations":[],"synonyms":["seemingly increased","apparently increased","ostensibly increased"],"antonyms":["actually decreased","genuinely decreased"]}],"etymology":{"value":"The prefix 'quasi-' comes from Latin, meaning 'as if' or 'resembling'. It is combined with 'increased' to indicate something that appears to be increased but may not be in reality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkweɪzaɪ ɪnˈkriːst/","syllables":"quasi-in-creased"},"inflection":{"adjective_forms":{"comparative":"more quasi-increased","superlative":"most quasi-increased"},"verb_forms":{}},"usage_notes":{"explanation":"'Quasi-increased' suggests an increase that is not entirely genuine or may be due to artificial factors. It implies a superficial or apparent increase rather than a substantial one. The term is often used to express skepticism or caution about the reported increase.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The quasi-increased price is a good deal.","correct":"✓ The seemingly increased price is not a good deal.","note":"'Quasi-increased' implies that the increase is not genuine, so it would not typically be used to describe a 'good deal'. Instead, use it to express skepticism about the price increase."},{"incorrect":"✗ The company quasi-increased their sales.","correct":"✓ The company reported quasi-increased sales.","note":"'Quasi-increased' is more commonly used as an adjective to describe something that appears to be increased. To describe an action, use a phrase like 'reported quasi-increased sales' or 'artificially increased'."}],"priority":"★★☆"},"related_words":{"derivatives":["quasi (adverb, adjective)","increase (verb, noun)"],"phrases":["quasi-official","quasi-scientific","quasi-judicial"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Quasi-increased' is a technical term used to describe something that appears to have increased, but the increase is not necessarily real or substantial. It is often used in formal contexts such as business reports or academic papers to express doubt or skepticism about reported increases. The prefix 'quasi-' indicates that the increase is only apparent or superficial. Understanding this term requires a good grasp of formal language and the ability to recognize subtle nuances in meaning."},"example_sentences":[{"sentence":"The quasi-increased revenue was primarily due to a one-time tax credit.","translation":"ほぼ増加した収益は、主に一時的な税額控除によるものであった。","type":"adjective","meaning_category":"見かけ上増加した"},{"sentence":"The government announced quasi-increased funding for education, but the actual budget remained the same.","translation":"政府は教育へのほぼ増加した資金提供を発表したが、実際の予算は変わらなかった。","type":"adjective","meaning_category":"ほぼ増加した"},{"sentence":"The quasi-increased activity in the stock market was driven by speculative trading.","translation":"株式市場におけるほぼ増加した活動は、投機的な取引によって推進された。","type":"adjective","meaning_category":"見かけ上増加した"}]}