{"word":"refractivity","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"屈折率、屈折能","english_definition":"The measure of how much a substance slows down the speed of light; the ability of a substance to refract light.","examples":[{"sentence":"The refractivity of diamond is very high, which is why it sparkles so much.","translation":"ダイヤモンドの屈折率は非常に高く、それが非常に輝く理由です。"},{"sentence":"Changes in temperature can affect the refractivity of air.","translation":"温度変化は空気の屈折率に影響を与える可能性があります。"},{"sentence":"The refractivity of the solution was measured using a refractometer.","translation":"溶液の屈折率は屈折計を用いて測定された。"}],"collocations":["high refractivity (高い屈折率)","low refractivity (低い屈折率)","measure refractivity (屈折率を測定する)","index of refractivity (屈折率指数)"],"synonyms":["refractive index","light refraction","optical density"],"antonyms":[]}],"etymology":{"value":"Derived from 'refract' (to deflect light) and '-ivity' (denoting a property or quality). 'Refract' comes from Latin 'refractus,' the past participle of 'refringere' (to break back or bend back).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːfrækˈtɪvɪti/","syllables":"re-frac-tiv-i-ty"},"inflection":{"noun_plural":"refractivities"},"usage_notes":{"explanation":"'Refractivity' is a scientific term primarily used in physics, optics, and chemistry. It quantifies how much light bends when passing through a substance. A higher refractivity indicates a greater bending of light. It is often expressed as a refractive index, which is the ratio of the speed of light in a vacuum to its speed in the substance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The refractivity is high in vacuum.","correct":"✓ The refractivity of a vacuum is 1.","note":"The refractivity of a vacuum is defined as 1, which is the lowest possible value. Other materials have refractivities greater than 1. It's more accurate to say that a vacuum has a refractive index of 1."},{"incorrect":"✗ Refractivity is the same as reflection.","correct":"✓ Refractivity is related to refraction, while reflection is a different phenomenon.","note":"Refractivity describes the bending of light (refraction), whereas reflection is the bouncing back of light from a surface. They are distinct optical phenomena."}],"priority":"★★☆"},"related_words":{"derivatives":["refract (verb: 屈折させる)","refraction (noun: 屈折)","refractive (adjective: 屈折性の)","refractometer (noun: 屈折計)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (Specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Refractivity' is a technical term that refers to how much light bends when it passes through a material. It's usually used in science, especially in physics and chemistry. Think of it as a measure of how much a substance slows down light. A high refractivity means the light bends a lot, like in a diamond, which makes it sparkle. You'll mostly see this word in scientific contexts or when discussing optics."},"example_sentences":[{"sentence":"The high **refractivity** of the lens allows for precise focusing of light.","translation":"レンズの高い屈折率により、光を正確に集束させることができます。","type":"general"},{"sentence":"Scientists are studying the **refractivity** of new materials for advanced optical devices.","translation":"科学者たちは、高度な光学デバイスのための新しい材料の屈折率を研究しています。","type":"research"},{"sentence":"The **refractivity** of water changes with salinity.","translation":"水の屈折率は塩分濃度によって変化します。","type":"scientific"}]}