{"word":"semihepatization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(病理学)肺の一部が肝臓のような状態になること。肺組織の充実化が部分的である状態を指す。","english_definition":"(Pathology) A condition in which a portion of the lung becomes liver-like in consistency, indicating partial consolidation of the lung tissue.","examples":[{"sentence":"Semihepatization of the lung was observed in the lower lobe due to pneumonia.","translation":"肺炎により、肺の下葉に半肝変化が認められた。"}],"collocations":["lung semihepatization","partial semihepatization"],"synonyms":["partial consolidation","incomplete hepatization"],"antonyms":["resolution","aeration"]}],"etymology":{"value":"\"semi-\" (部分的な) + \"hepatization\" (肝変化) から構成される病理学用語。","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɛmiˌhɛpətaɪˈzeɪʃən/","syllables":"se-mi-he-pa-ti-za-tion"},"inflection":{"noun_plural":"semihepatizations"},"usage_notes":{"explanation":"Semihepatizationは、肺炎などの炎症性疾患によって肺胞が滲出液や細胞で満たされ、肺組織が硬くなる肝変化（hepatization）が、肺の一部に限定的に起こっている状態を指します。完全な肝変化（complete hepatization）とは異なり、肺の一部分のみが影響を受けている場合に用いられます。画像診断や病理検査で確認されます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The entire lung showed signs of semihepatization.","correct":"✓ The lower lobe of the lung showed signs of semihepatization.","note":"Semihepatizationは部分的な肝変化を指すため、肺全体に及ぶ場合は不適切です。"},{"incorrect":"✗ Semihepatization is a normal condition of the lung.","correct":"✓ Semihepatization is an abnormal condition of the lung.","note":"Semihepatizationは病的な状態であり、正常な肺の状態ではありません。"}],"priority":"★★★"},"related_words":{"derivatives":["hepatization","pneumonia","consolidation"],"medical_terms":["lobar pneumonia","bronchopneumonia","acute lung injury","ARDS (acute respiratory distress syndrome)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学論文や専門書でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Semihepatization\" is a highly specialized medical term used in pathology to describe a condition where a portion of the lung tissue becomes firm and liver-like due to partial consolidation, typically observed in cases of pneumonia or other inflammatory lung diseases. It is important to note that this term is used by medical professionals and is not commonly encountered in everyday language. Understanding this term requires knowledge of lung anatomy, pathology, and related medical conditions."},"example_sentences":[{"sentence":"Chest X-ray revealed semihepatization in the right middle lobe, suggesting lobar pneumonia.","translation":"胸部X線検査で右中葉に半肝変化が認められ、大葉性肺炎が示唆された。","type":"medical imaging report","meaning_category":"diagnosis"},{"sentence":"Histopathological examination confirmed semihepatization with alveolar exudates and inflammatory cells.","translation":"病理組織学的検査により、肺胞滲出液と炎症細胞を伴う半肝変化が確認された。","type":"pathology report","meaning_category":"pathology"},{"sentence":"The patient's condition improved with antibiotics, and the semihepatization gradually resolved.","translation":"患者の状態は抗生物質で改善し、半肝変化は徐々に解消された。","type":"clinical observation","meaning_category":"treatment outcome"}]}