{"word":"preadherently","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"付着前に、予め付着するように","english_definition":"In a manner that is adherent beforehand; in a way that something is already attached or prone to adhere.","examples":[{"sentence":"The cells were preadherently seeded onto the culture dish to ensure even distribution.","translation":"細胞が均一に分散するように、培養皿に予め付着させた状態で播種した。"},{"sentence":"The coating was designed to be preadherently bonded to the metal surface.","translation":"そのコーティングは、金属表面に予め結合するように設計された。"}],"collocations":["preadherently seeded","preadherently bonded","preadherently attached"],"synonyms":["pre-attached","pre-fixed","pre-bound"],"antonyms":["nonadherently","loosely","unattached"]}],"etymology":{"value":"The word is formed by combining the prefix 'pre-' (meaning before) with 'adherently' (in an adhering manner).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːədˈhɪərəntli/","syllables":"pre-ad-her-ent-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Preadherently' describes a state or action where something is already in an adhering or attached state before a subsequent action or observation. It is often used in scientific or technical contexts, particularly in biology and materials science, to describe how cells, coatings, or other substances are prepared or designed to interact with a surface.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The cells grew preadherently.","correct":"✓ The cells were seeded preadherently.","note":"'Preadherently' describes the manner of seeding, not the growth itself."},{"incorrect":"✗ The paint is preadherent to the wall.","correct":"✓ The paint is designed to be preadherently bonded to the wall.","note":"'Preadherently' describes how the paint is bonded, not a state of being."}],"priority":"★★☆"},"related_words":{"derivatives":["adherent (adjective, noun)","adhere (verb)","adherence (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'preadherently' is a technical term, primarily used in scientific or technical contexts. It describes a state where something is already attached or prone to adhere before a subsequent action or observation. Understanding this word requires familiarity with the prefix 'pre-' and the concept of adherence. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The nanoparticles were preadherently functionalized with antibodies for targeted drug delivery.","translation":"ナノ粒子は、標的薬物送達のために、予め抗体で機能化された。","type":"adverb","meaning_category":"付着前に"},{"sentence":"The scaffold was designed to support cells that were preadherently attached.","translation":"その足場は、予め付着した細胞を支持するように設計された。","type":"adverb","meaning_category":"予め付着するように"}]}