{"word":"solubility","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"溶解度","english_definition":"the ability of a substance (solute) to dissolve in a solvent","examples":[{"sentence":"The solubility of salt in water increases with temperature.","translation":"水の塩の溶解度は温度とともに増加します。"},{"sentence":"Ethanol has a high solubility in water.","translation":"エタノールは水への溶解度が高いです。"},{"sentence":"Factors affecting solubility include temperature, pressure, and the nature of the solute and solvent.","translation":"溶解度に影響を与える要因には、温度、圧力、溶質と溶媒の性質が含まれます。"}],"collocations":["high solubility (高い溶解度)","low solubility (低い溶解度)","water solubility (水溶性)","temperature and solubility (温度と溶解度)","determine solubility (溶解度を決定する)","measure solubility (溶解度を測定する)"],"synonyms":["dissolvability","miscibility"],"antonyms":["insolubility"]}],"etymology":{"value":"From Latin 'solubilis' (able to be dissolved) + '-ity'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɒljʊˈbɪləti/","syllables":"sol-u-bil-i-ty"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Solubility is a quantitative measure of how much of a substance (the solute) can dissolve in a given amount of another substance (the solvent). It's often expressed as the maximum concentration of the solute that can dissolve in the solvent at a specific temperature.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The solubility is soluble in water.","correct":"✓ The substance is soluble in water.","note":"Solubility is a property; soluble is the adjective describing a substance that can dissolve. Don't confuse the noun and adjective forms."},{"incorrect":"✗ High temperature decrease solubility.","correct":"✓ High temperature increases solubility.","note":"For many solids, increased temperature increases solubility. Be mindful of the relationship between temperature and solubility for different substances."}],"priority":"★★☆"},"related_words":{"derivatives":["soluble (adjective: able to be dissolved)","insoluble (adjective: not able to be dissolved)","dissolve (verb: to become or cause to become incorporated into a liquid so as to form a solution)","solution (noun: a liquid mixture in which the minor component (the solute) is uniformly distributed within the major component (the solvent))","solvent (noun: the liquid in which a solute is dissolved to form a solution)","solute (noun: the substance dissolved in a solution)"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent but common in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Solubility' refers to how well something mixes into a liquid to form a solution. For example, sugar has high solubility in water because it dissolves easily. Some things, like sand, have low solubility because they don't dissolve well. Understanding solubility is important in chemistry and other sciences."},"example_sentences":[{"sentence":"The experiment aimed to determine the solubility of the new compound in various solvents.","translation":"その実験は、新しい化合物の様々な溶媒への溶解度を決定することを目的としていました。","type":"noun","meaning_category":"溶解度"},{"sentence":"The solubility of carbon dioxide in seawater is affected by ocean acidification.","translation":"海水中の二酸化炭素の溶解度は、海洋酸性化の影響を受けます。","type":"noun","meaning_category":"溶解度"},{"sentence":"Knowing the solubility of a drug is crucial for its formulation and delivery.","translation":"薬物の溶解度を知ることは、その製剤と送達にとって非常に重要です。","type":"noun","meaning_category":"溶解度"}]}