{"word":"evaluatively","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"評価的に、評価する観点から","english_definition":"in a way that expresses a judgment about the value or quality of something.","examples":[{"sentence":"The essay was written evaluatively, considering both the strengths and weaknesses of the argument.","translation":"そのエッセイは評価的に書かれており、議論の長所と短所の両方を考慮していた。"},{"sentence":"She spoke evaluatively about the new policy, highlighting its potential benefits and drawbacks.","translation":"彼女は新しい政策について評価的に話し、その潜在的な利点と欠点を強調した。"},{"sentence":"The data was analyzed evaluatively to determine the effectiveness of the program.","translation":"そのプログラムの有効性を判断するために、データは評価的に分析された。"}],"collocations":["analyze evaluatively","assess evaluatively","discuss evaluatively","examine evaluatively","speak evaluatively","write evaluatively"],"synonyms":["critically","judgmentally","analytically","assessingly","interpretively"],"antonyms":["descriptively","factually","objectively","neutrally"]}],"etymology":{"value":"The word \"evaluatively\" is derived from the word \"evaluate,\" which comes from the French word \"évaluer\" (to assess the value of), and ultimately from the Latin word \"valere\" (to be worth). The suffix \"-ly\" turns it into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈvæljuˌeɪtɪvli/","syllables":"e-val-u-a-tive-ly"},"inflection":{"notes":"As an adverb, \"evaluatively\" does not have different forms for tense or number."},"usage_notes":{"explanation":"\"Evaluatively\" is used to describe actions or statements that involve making judgments or assessments about something's worth, quality, or significance. It implies a critical and analytical approach, considering various factors before forming an opinion or conclusion. This adverb is commonly used in academic, professional, and analytical contexts where evaluation is a crucial component.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He evaluatively looked at the painting with no emotion.","correct":"✓ He looked evaluatively at the painting, considering its technique and composition.","note":"\"Evaluatively\" implies active judgment and consideration, so it doesn't fit well with a lack of emotion or thought."},{"incorrect":"✗ The report was written very evaluative.","correct":"✓ The report was written very evaluatively.","note":"\"Evaluative\" is an adjective, while \"evaluatively\" is the adverb. Use the adverb to describe how something was written."}],"priority":"★★☆"},"related_words":{"derivatives":["evaluate (verb)","evaluation (noun)","evaluative (adjective)"],"phrases":["evaluative judgment","evaluative criteria","evaluative feedback","evaluative research"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in academic and professional contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"evaluatively\" is an adverb that means 'in a way that assesses or judges the value or quality of something.' It is used in contexts where something is being analyzed and assessed, often with the aim of forming an opinion or making a decision. This word is more common in academic or professional writing than in everyday conversation."},"example_sentences":[{"sentence":"The teacher graded the essays evaluatively, providing detailed feedback on each student's work.","translation":"教師はエッセイを評価的に採点し、各生徒の作品について詳細なフィードバックを提供した。","type":"general","meaning_category":"expressing judgment"},{"sentence":"The manager reviewed the employee's performance evaluatively, considering their contributions and areas for improvement.","translation":"マネージャーは従業員の業績を評価的に見直し、彼らの貢献と改善の余地を検討した。","type":"professional","meaning_category":"assessment"},{"sentence":"The critic wrote evaluatively about the play, discussing its themes, acting, and direction.","translation":"評論家は演劇について評価的に書き、そのテーマ、演技、演出について論じた。","type":"academic","meaning_category":"critical analysis"}]}