{"word":"Iconoscope","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(初期のテレビカメラ管の一種)蓄積型撮像管","english_definition":"An early type of television camera tube in which a beam of electrons scans a mosaic of photoelectric cells that have stored an electric charge pattern corresponding to the image being televised.","examples":[{"sentence":"The iconoscope was a significant invention in the development of television technology.","translation":"アイコノスコープは、テレビ技術の発展における重要な発明でした。"},{"sentence":"Early television broadcasts used cameras equipped with iconoscopes.","translation":"初期のテレビ放送では、アイコノスコープを搭載したカメラが使用されていました。"}],"collocations":["television camera tube","scanning electron beam","photoelectric cells","image storage","early television broadcasts"],"synonyms":["camera tube","video camera tube","image tube"],"antonyms":[]}],"etymology":{"value":"The word \"iconoscope\" is derived from the Greek words \"eikon\" (image) and \"skopeō\" (to view or observe). It literally means \"image viewer\" or \"image observer\".","priority":"★★☆"},"pronunciation":{"ipa":"/aɪˈkɒnəskoʊp/","syllables":"I-con-o-scope"},"inflection":{"noun_plural":"iconoscopes"},"usage_notes":{"explanation":"The iconoscope was one of the first practical electronic television camera tubes. It was invented in the early 1930s by Vladimir K. Zworykin. Although it was a revolutionary invention, it had limitations such as low sensitivity and image distortion. It was later superseded by more advanced camera tubes like the image orthicon and vidicon.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The iconoscope is still widely used in modern television cameras.","correct":"✓ The iconoscope was used in early television cameras but is now obsolete.","note":"Iconoscopes are no longer used in modern television cameras due to their limitations and the development of more advanced technologies."}],"priority":"★★☆"},"related_words":{"derivatives":["iconoscopic (adjective)"],"related_terms":["image orthicon","vidicon","camera tube","television camera"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - primarily used in historical contexts related to television technology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"iconoscope\" refers to a specific type of early television camera tube. Understanding its function and historical significance requires some technical knowledge of television technology. It is not a commonly used word in everyday language. Therefore, a higher level of reading comprehension is needed to understand its meaning and context.","priority":"★★☆"},"example_sentences":[{"sentence":"The **iconoscope** converted light into an electronic signal.","translation":"アイコノスコープは光を電気信号に変換しました。","type":"noun","meaning_category":"Definition"},{"sentence":"The **iconoscope** was a key component in early television broadcasting systems.","translation":"アイコノスコープは初期のテレビ放送システムにおける重要なコンポーネントでした。","type":"noun","meaning_category":"Usage Example"}]}