{"word":"seroprotease","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"セリンプロテアーゼ：セリン残基が活性部位に存在するプロテアーゼ（タンパク質分解酵素）の一種。トリプシン、キモトリプシン、エラスターゼなどが含まれる。","english_definition":"A serine protease is an enzyme that cleaves peptide bonds in proteins, in which serine serves as the nucleophilic amino acid at the enzyme's active site.","examples":[{"sentence":"Seroproteases play crucial roles in various physiological processes, including digestion, blood coagulation, and immune response.","translation":"セリンプロテアーゼは、消化、血液凝固、免疫応答を含む様々な生理学的プロセスにおいて重要な役割を果たします。"},{"sentence":"Inhibitors of seroproteases are used as drugs to treat certain diseases.","translation":"セリンプロテアーゼの阻害剤は、特定の疾患を治療するための薬として使用されています。"}],"collocations":["serine protease inhibitor (セリンプロテアーゼ阻害剤)","serine protease activity (セリンプロテアーゼ活性)","trypsin-like serine protease (トリプシン様セリンプロテアーゼ)","chymotrypsin-like serine protease (キモトリプシン様セリンプロテアーゼ)"],"synonyms":["serine endopeptidase"],"antonyms":[]}],"etymology":{"value":"'sero-' (セリン) + 'protease' (プロテアーゼ)","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌsɪəroʊˈproʊtiˌeɪz/","syllables":"se-ro-pro-te-ase"},"inflection":{"noun_plural":"seroproteases"},"usage_notes":{"explanation":"セリンプロテアーゼは、タンパク質のペプチド結合を加水分解する酵素群であり、活性部位にセリン残基を持つことが特徴です。生体内の様々なプロセスに関与しており、医学・生物学分野で重要な研究対象となっています。","priority":"☆☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["protease","serine","enzyme","hydrolysis"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Seroprotease' is a technical term used in biochemistry and molecular biology. It refers to a specific type of enzyme that breaks down proteins using a serine residue in its active site. Understanding this term requires a background in biology and chemistry. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The researchers investigated the role of a specific seroprotease in tumor development.","translation":"研究者らは、腫瘍の発生における特定のセリンプロテアーゼの役割を調査しました。","type":"general","meaning_category":"セリンプロテアーゼ"}]}