{"word":"nonidentity","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"非同一性、非同一であること","english_definition":"The state or condition of not being identical; lack of identity.","examples":[{"sentence":"The principle of nonidentity states that a thing cannot be identical to something else if they have different properties.","translation":"非同一性の原理は、あるものが異なる特性を持つ場合、他のものと同一であることはできないと述べている。"},{"sentence":"The nonidentity problem in ethics considers the moral status of actions that bring people into existence.","translation":"倫理学における非同一性問題は、人々の存在をもたらす行為の道徳的地位を考察する。"}],"collocations":["principle of nonidentity (非同一性の原理)","problem of nonidentity (非同一性問題)"],"synonyms":["difference","distinctness","dissimilarity","unlikeness"],"antonyms":["identity","sameness","equivalence"]}],"etymology":{"value":"\"non-\" (否定接頭辞) + \"identity\" (同一性)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn.aɪˈdɛntɪti/","syllables":"non-i-den-ti-ty"},"inflection":{"noun_plural":"nonidentities"},"usage_notes":{"explanation":"\"Nonidentity\" is a formal term, often used in philosophy, logic, and ethics. It refers to the lack of sameness or equivalence between two or more things. In philosophy, it is often contrasted with \"identity,\" which refers to the state of being the same.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The non-identity of the two twins was obvious.","correct":"✓ The nonidentity of the two twins was obvious. / ✓ The lack of identity between the two twins was obvious.","note":"While \"non-identity\" (with a hyphen) might be understandable, \"nonidentity\" (without a hyphen) is the more standard and accepted form. Alternatively, rephrasing to \"lack of identity\" can also improve clarity."}],"priority":"★★☆"},"related_words":{"derivatives":["nonidentical (adjective: 同一でない)"],"antonyms":["identity","sameness"],"related_concepts":["identity (同一性)","difference (差異)","equivalence (同等性)"]},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonidentity\" is a relatively uncommon term, primarily used in philosophical and academic contexts. It describes the state of not being the same or identical. Understanding this word requires familiarity with abstract concepts like identity and difference. It's often used in discussions about ethics, logic, and metaphysics."},"example_sentences":[{"sentence":"The **nonidentity** of the objects was confirmed by scientific analysis.","translation":"その物体の非同一性は、科学的分析によって確認された。","type":"noun","meaning_category":"非同一性"},{"sentence":"The **nonidentity** problem raises difficult questions about our obligations to future generations.","translation":"非同一性問題は、将来の世代に対する私たちの義務について難しい問題を提起する。","type":"noun","meaning_category":"非同一性"}]}