{"word":"intersexualism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"インターセックス（性分化疾患）","english_definition":"A condition in which a person is born with reproductive or sexual anatomy that doesn't seem to fit the typical definitions of female or male.","examples":[{"sentence":"Intersexualism is a complex condition with many different variations.","translation":"インターセックスは多くの異なるバリエーションを持つ複雑な状態です。"},{"sentence":"The causes of intersexualism can be genetic, hormonal, or unknown.","translation":"インターセックスの原因は、遺伝的、ホルモン的、または不明な場合があります。"},{"sentence":"Support groups can provide valuable resources for individuals with intersexualism and their families.","translation":"支援団体は、インターセックスの方々とその家族に貴重な情報源を提供できます。"}],"collocations":["intersex condition","differences of sex development (DSD)","atypical sex characteristics"],"synonyms":["differences of sex development (DSD)","disorder of sex development"],"antonyms":[]},{"part_of_speech":"noun","definition":"インターセックスの人であること","english_definition":"The state of being intersex.","examples":[{"sentence":"Intersexualism is a natural variation in human biology.","translation":"インターセックスは、人間の生物学における自然なバリエーションです。"},{"sentence":"Understanding and acceptance of intersexualism are important for promoting inclusivity.","translation":"インターセックスの理解と受容は、包括性を促進するために重要です。"}],"collocations":["intersex identity","intersex rights","intersex awareness"],"synonyms":["intersexuality"],"antonyms":[]}],"etymology":{"value":"'Inter-' (between) + 'sexual' (relating to sex) + '-ism' (condition or state).","priority":"★★★"},"pronunciation":{"ipa":"ˌɪntərˈsekʃuəlɪzəm","syllables":"in-ter-sex-u-al-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Intersexualism' and 'differences of sex development (DSD)' are often used interchangeably, although DSD is sometimes preferred in medical contexts to avoid stigmatizing language. It refers to a range of conditions where a person's sex characteristics don't fit typical binary notions of male or female. It's important to use respectful and person-centered language when discussing this topic.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Intersexualism is a choice.","correct":"✓ Intersexualism is a biological condition present at birth.","note":"Intersexualism is not a choice, but a biological variation. It is not related to gender identity or sexual orientation."},{"incorrect":"✗ All intersex people need surgery.","correct":"✓ Medical interventions for intersex people should be carefully considered and based on informed consent.","note":"Not all intersex people require or desire surgery. Medical decisions should be made in consultation with medical professionals and with the informed consent of the individual (or their parents/guardians, when the individual is a minor)."},{"incorrect":"✗ Intersexualism is the same as transgender.","correct":"✓ Intersexualism relates to biological sex characteristics, while transgender relates to gender identity.","note":"Intersexualism is about biological sex characteristics that don't fit typical definitions, while transgender is about a person's gender identity differing from the sex they were assigned at birth."}],"priority":"★★☆"},"related_words":{"derivatives":["intersex","intersexuality"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Intersexualism' is a term referring to conditions where a person's sex characteristics don't fit typical definitions of male or female. It's a complex topic that requires sensitivity and understanding. The term 'differences of sex development (DSD)' is sometimes preferred in medical contexts. It's important to remember that intersex people have diverse experiences and identities, and language should be respectful and person-centered."},"example_sentences":[{"sentence":"Research into the genetic causes of intersexualism is ongoing.","translation":"インターセックスの遺伝的原因に関する研究が進行中です。","type":"noun","meaning_category":"condition"},{"sentence":"Advocates are working to raise awareness about intersexualism and fight for the rights of intersex individuals.","translation":"擁護者たちは、インターセックスについての意識を高め、インターセックスの人々の権利のために活動しています。","type":"noun","meaning_category":"state of being intersex"}]}