{"word":"denaturised","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"変性させた、変性アルコール化した","english_definition":"Having undergone a process to make it unfit for consumption, especially alcohol.","examples":[{"sentence":"Denaturised alcohol is used as a solvent.","translation":"変性アルコールは溶剤として使用される。"},{"sentence":"The product contains denaturised ethanol.","translation":"その製品には変性エタノールが含まれている。"}],"collocations":["denaturised alcohol","denaturised ethanol"],"synonyms":["modified","altered","treated"],"antonyms":["pure","unmodified","natural"]}],"etymology":{"value":"The word 'denaturised' comes from 'denature', which is formed from 'de-' (meaning 'removal' or 'reversal') and 'nature'. It refers to the process of removing or altering the natural properties of a substance, typically to make it unsuitable for consumption while retaining its usefulness for other purposes.","priority":"★★☆"},"pronunciation":{"ipa":"/diːˈneɪtʃəraɪzd/","syllables":"de-na-tur-ised"},"inflection":{"notes":"This is the past participle form of the verb 'denaturise' used as an adjective."},"usage_notes":{"explanation":"'Denaturised' is primarily used to describe substances, especially alcohol, that have been treated with additives to make them toxic or unpalatable, preventing their consumption as beverages. This is done for regulatory and tax reasons, as denaturised alcohol is often exempt from taxes applied to alcoholic beverages. The term is commonly used in scientific, industrial, and regulatory contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The alcohol was denaturized for drinking.","correct":"✓ The alcohol was denaturised to prevent drinking.","note":"Denaturing is done to prevent consumption, not to enable it."},{"incorrect":"✗ Denaturised is a natural product.","correct":"✓ Denaturised is not a natural product.","note":"Denaturing is a process that alters the natural state of a substance."}],"priority":"★★☆"},"related_words":{"derivatives":["denature (verb)","denaturation (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'denaturised' is a technical term primarily used in chemistry, manufacturing, and regulatory contexts. It refers to a substance, especially alcohol, that has been treated to make it unsuitable for human consumption. Understanding this term requires familiarity with scientific and regulatory vocabulary. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The laboratory uses denaturised alcohol for cleaning equipment.","translation":"その研究室では、機器の洗浄に変性アルコールを使用している。","type":"adjective","meaning_category":"変性させた"},{"sentence":"Denaturised spirits are often dyed to distinguish them from potable alcohol.","translation":"変性スピリッツは、飲用アルコールと区別するために着色されることが多い。","type":"adjective","meaning_category":"変性アルコール化した"}]}