{"word":"abasedly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"屈辱的に、卑下して、へりくだって","english_definition":"In a humble or degraded manner; in a way that shows humiliation or a lack of self-respect.","examples":[{"sentence":"He apologized abasedly for his mistake.","translation":"彼は自分の過ちを屈辱的なほどに謝罪した。"},{"sentence":"She bowed abasedly before the king.","translation":"彼女は王の前で卑下して頭を下げた。"},{"sentence":"The servant spoke abasedly to his master.","translation":"その召使いは主人にへりくだって話した。"}],"collocations":["apologize abasedly","bow abasedly","speak abasedly"],"synonyms":["humbly","meekly","submissively","obsequiously","ingratiatingly","servilely"],"antonyms":["proudly","arrogantly","haughtily","defiantly"]}],"etymology":{"value":"The word \"abasedly\" is derived from the adjective \"abased,\" which comes from the verb \"abase.\" \"Abase\" originates from the Old French word \"abaissier,\" meaning \"to lower, reduce, humble,\" which in turn comes from the Latin word \"ad bassus,\" meaning \"to the bottom.\" The suffix \"-ly\" is added to form the adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈbeɪsɪdli/","syllables":"a-bas-ed-ly"},"inflection":{"notes":"This is an adverb, so it does not inflect."},"usage_notes":{"explanation":"\"Abasedly\" describes an action performed in a way that shows extreme humility, often to the point of degradation. It suggests a lowering of oneself in status or dignity. The word is relatively formal and not commonly used in everyday conversation. It is often used in literature or historical contexts to depict characters in positions of subservience or deep remorse.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He felt abasedly after the criticism.","correct":"✓ He felt abased after the criticism.","note":"\"Abasedly\" is an adverb, so it describes how an action is performed. \"Abased\" is an adjective that describes how someone feels. In this case, the correct word is the adjective \"abased.\""},{"incorrect":"✗ She acted abasedly because she was shy.","correct":"✓ She acted humbly because she was shy.","note":"While \"abasedly\" can describe humility, it suggests a more extreme and often degrading level of humility. If the person is simply shy, \"humbly\" or \"meekly\" might be more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["abase (verb)","abased (adjective)","abasement (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Abasedly\" is an adverb that means \"in a way that shows you are ashamed or have lost your self-respect.\" It is a formal word and not commonly used. It is used to describe someone acting in a very humble or degraded manner. It is important to understand the nuance of extreme humility or humiliation when using this word."},"example_sentences":[{"sentence":"The prisoner pleaded abasedly for mercy.","translation":"囚人は屈辱的に慈悲を請うた。","type":"general","meaning_category":"屈辱的に"},{"sentence":"He apologized abasedly, his head bowed low.","translation":"彼は頭を深く下げ、へりくだって謝罪した。","type":"general","meaning_category":"へりくだって"},{"sentence":"She accepted the criticism abasedly, acknowledging her mistake.","translation":"彼女は自分の過ちを認め、屈辱的にその批判を受け入れた。","type":"general","meaning_category":"屈辱的に"}]}