{"word":"hell-brewed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"地獄で作られたような、非常に悪い、邪悪な","english_definition":"As if brewed in hell; extremely bad or evil.","examples":[{"sentence":"The hell-brewed storm raged for days.","translation":"地獄で作られたかのような嵐が何日も荒れ狂った。"},{"sentence":"He unleashed a hell-brewed fury upon his enemies.","translation":"彼は敵に地獄で作られたかのような怒りを爆発させた。"}],"collocations":["hell-brewed storm","hell-brewed fury","hell-brewed concoction"],"synonyms":["infernal","diabolical","fiendish","wicked","evil"],"antonyms":["heavenly","divine","angelic","good"]},{"part_of_speech":"adjective","definition":"非常に強力な、強烈な","english_definition":"Extremely potent or intense.","examples":[{"sentence":"This coffee is a hell-brewed concoction that will keep you awake all night.","translation":"このコーヒーは、一晩中目を覚まさせる地獄で作られたかのような強力な飲み物だ。"}],"collocations":["hell-brewed coffee","hell-brewed liquor","hell-brewed potion"],"synonyms":["potent","intense","strong","powerful"],"antonyms":["weak","mild","watered-down"]}],"etymology":{"value":"A compound word formed from \"hell\" (referring to the underworld or a place of extreme suffering) and \"brewed\" (suggesting something created or concocted). The combination implies something of diabolical origin or intensity.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhel ˈbruːd/","syllables":"hell-brewed"},"inflection":{"notes":"This word does not inflect; it remains the same regardless of grammatical context."},"usage_notes":{"explanation":"\"Hell-brewed\" is a figurative term used to describe something extremely negative, intense, or evil. It often carries a strong emotional charge and is used to emphasize the severity or unpleasantness of the subject. It can also describe something very strong or potent, as if it were created with infernal power.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The hell-brewed angel descended from the sky.","correct":"✓ The hellish angel descended from the sky.","note":"\"Hell-brewed\" typically describes something negative or evil, so it would be contradictory to use it with something inherently good like an angel. \"Hellish\" would be a more appropriate adjective."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["hellish","infernal","diabolical","fiendish"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"hell-brewed\" is a figurative expression that combines the concepts of \"hell\" (a place of extreme suffering or evil) and \"brewed\" (suggesting something created or concocted). It is used to describe something extremely negative, intense, or evil, as if it originated from hell itself. It is not a common word and is typically used in more descriptive or literary contexts to add emphasis or emotional impact."},"example_sentences":[{"sentence":"The general unleashed a hell-brewed campaign of terror upon the civilian population.","translation":"将軍は一般市民に対して、地獄で作られたかのような恐怖のキャンペーンを繰り広げた。","type":"adjective","meaning_category":"邪悪な、非常に悪い"},{"sentence":"That moonshine is a hell-brewed concoction that will knock you off your feet.","translation":"あの密造酒は、あなたを打ちのめすような地獄で作られたかのような強力な飲み物だ。","type":"adjective","meaning_category":"非常に強力な"}]}