{"word":"motofacient","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Producing movement; causing motion.","english_definition":"Producing or capable of producing movement; causing motion.","examples":[{"sentence":"The motofacient force of the engine propelled the vehicle forward.","translation":"エンジンの運動生成力（運動を起こす力）が車両を前進させた。"},{"sentence":"The scientist studied the motofacient properties of the new material.","translation":"科学者はその新素材の運動生成特性を研究した。"}],"collocations":[],"synonyms":["kinetic","dynamic","motive","propulsive"],"antonyms":["static","stationary","inert"]}],"etymology":{"value":"From Latin 'moto' (movement, motion) + 'facient' (making, doing), combining the roots to describe something that causes or produces movement.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmoʊtoʊˈfeɪʃənt/","syllables":"mo-to-fa-cient"},"inflection":{"notes":"Adjective, no specific inflections beyond comparative and superlative forms (more motofacient, most motofacient)."},"usage_notes":{"explanation":"'Motofacient' is a relatively rare and technical term used to describe something that generates or causes motion. It is often found in scientific or engineering contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The motofacient was broken, so the car wouldn't start.","correct":"✓ The motofacient component was broken, so the car wouldn't start.","note":"'Motofacient' is an adjective, not a noun. It describes something that causes motion, but it is not the thing itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["motion","motive","facilitate"],"related_terms":["motor","force","kinetic energy"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Motofacient' is a highly specialized term, rarely encountered outside of technical or scientific writing. Understanding requires a strong grasp of Latin roots and scientific vocabulary."},"example_sentences":[{"sentence":"The design incorporated a highly efficient motofacient system.","translation":"その設計には、非常に効率的な運動生成システムが組み込まれていた。","type":"adjective","meaning_category":"producing movement"},{"sentence":"The study focused on the motofacient aspects of muscle contraction.","translation":"その研究は、筋肉収縮の運動生成の側面に焦点を当てた。","type":"adjective","meaning_category":"causing motion"}]}