{"word":"uninveighing","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Not inveighing; not expressing strong disapproval or protest.","english_definition":"Not expressing strong disapproval or protest; not making a vehement attack in words.","examples":[{"sentence":"His uninveighing tone was a stark contrast to the passionate arguments of others.","translation":"彼の非難しない口調は、他の人々の情熱的な議論とは対照的だった。"},{"sentence":"The author adopted an uninveighing approach, presenting the facts without resorting to harsh criticism.","translation":"著者は非難しないアプローチを採用し、厳しい批判に頼らずに事実を提示した。"}],"collocations":["uninveighing tone","uninveighing approach","uninveighing manner"],"synonyms":["non-accusatory","non-critical","restrained","moderate","mild","gentle"],"antonyms":["inveighing","accusatory","critical","harsh","vehement"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to the word 'inveighing', which is the present participle of the verb 'inveigh'. 'Inveigh' comes from the Latin word 'invehere', meaning 'to carry in, attack'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnɪnˈveɪɪŋ/","syllables":"un-in-veigh-ing"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It can also be used in comparative and superlative forms (more uninveighing, most uninveighing), although these are rare."},"usage_notes":{"explanation":"'Uninveighing' is a relatively rare word, typically used in formal or literary contexts. It describes a style or manner of speaking or writing that avoids strong criticism or condemnation. It suggests a calm, objective, or even gentle approach to a subject, even when disagreement is present.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was uninveighing insults at his opponent.","correct":"✓ He was inveighing insults at his opponent.","note":"'Uninveighing' means *not* expressing strong disapproval. The opposite, 'inveighing', would be used to describe someone who is strongly criticizing or insulting someone."}],"priority":"★★☆"},"related_words":{"derivatives":["inveigh (verb): to speak or write about something with great disapproval.","inveighing (adjective): expressing strong disapproval or protest.","inveighment (noun): an act of inveighing; a vehement expression of disapproval."],"related_concepts":["criticism","condemnation","disapproval","protest","rhetoric","argumentation"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Uninveighing' is a sophisticated word that is rarely used in everyday conversation. It describes the quality of not expressing strong disapproval or criticism. Understanding this word requires familiarity with the root word 'inveigh' and the negative prefix 'un-'. It is most likely to be encountered in academic or literary contexts."},"example_sentences":[{"sentence":"The diplomat's uninveighing statement helped to de-escalate the tension between the two nations.","translation":"外交官の非難しない声明は、二国間の緊張を緩和するのに役立った。","type":"adjective","meaning_category":"non-critical"},{"sentence":"She presented her arguments in an uninveighing manner, focusing on facts rather than personal attacks.","translation":"彼女は個人的な攻撃ではなく事実に焦点を当てて、非難しない態度で議論を提示した。","type":"adjective","meaning_category":"restrained"},{"sentence":"Despite the provocation, he remained uninveighing, refusing to engage in a shouting match.","translation":"挑発にもかかわらず、彼は非難することを避け、口論をすることを拒否した。","type":"adjective","meaning_category":"moderate"}]}