{"word":"penanced","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(古語)に罰を与える、に贖罪をさせる","english_definition":"(archaic) to subject to a penance; to impose a penance on.","examples":[{"sentence":"The priest penanced the sinner for their transgressions.","translation":"司祭は罪人の罪に対して贖罪を科した。"},{"sentence":"He was penanced for his disrespectful behavior.","translation":"彼は無礼な振る舞いに対して罰せられた。"}],"collocations":[],"synonyms":["punished","chastised","disciplined"],"antonyms":["forgiven","pardoned","absolved"]}],"etymology":{"value":"'Penanced' is derived from the verb 'penance,' which comes from the Old French word 'penance,' meaning 'atonement for sin.' This ultimately comes from the Latin word 'paenitentia,' meaning 'repentance.' The verb 'to penance' means to subject someone to a penance, which is an act of self-mortification or devotion performed to show sorrow or repentance for a sin.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɛnənst/","syllables":"pen-anced"},"inflection":{"verb_forms":{"present_simple":["penance","penances"],"past_simple":"penanced","past_participle":"penanced","present_participle":"penancing"}},"usage_notes":{"explanation":"The word 'penanced' is an archaic form and is rarely used in modern English. It is mostly found in historical or religious contexts. The more common way to express the idea of giving someone a penance is to use phrases like 'subjected to a penance' or 'given a penance.'","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["penance (noun): an act of self-punishment or religious devotion to show sorrow or repentance for a sin.","penitence (noun): the feeling of regret or sorrow for having done something wrong.","penitent (adjective): feeling or showing sorrow and regret for having done something wrong; (noun): a person who repents their sins or wrongdoings and seeks forgiveness."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'penanced' is a rarely used, archaic term. It is best understood in the context of religious or historical texts where the act of assigning a penance for wrongdoing is described. Due to its infrequent use, it is not recommended for general communication. Instead, using phrases like 'subjected to a penance' or 'given a penance' is more appropriate in modern English. Understanding the related words like 'penance,' 'penitence,' and 'penitent' can provide context for the historical usage of 'penanced.'"},"example_sentences":[{"sentence":"In the old days, those who committed serious sins were often publicly penanced.","translation":"昔は、重大な罪を犯した者はしばしば公に罰せられた。","type":"verb","meaning_category":"punishment"},{"sentence":"The monk was penanced for breaking his vows.","translation":"その修道士は誓いを破ったために罰せられた。","type":"verb","meaning_category":"religious discipline"}]}