{"word":"permeation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"浸透、透過、浸潤","english_definition":"The process of a substance spreading or passing through something.","examples":[{"sentence":"The permeation of water through the soil is essential for plant growth.","translation":"土壌への水の浸透は植物の成長に不可欠です。"},{"sentence":"The permeation of new ideas into the company culture was slow but steady.","translation":"新しいアイデアの企業文化への浸透は、ゆっくりと着実でした。"},{"sentence":"The rate of permeation depends on the properties of the membrane and the substance.","translation":"浸透速度は、膜と物質の特性に依存します。"}],"collocations":["rate of permeation (浸透速度)","degree of permeation (浸透度)","permeation barrier (浸透バリア)","gas permeation (気体透過)","vapor permeation (蒸気透過)"],"synonyms":["diffusion","penetration","infiltration","absorption","impregnation"],"antonyms":["impermeability","resistance","exclusion"]}],"etymology":{"value":"Late Latin *permeationem* (nominative *permeatio*) \"a passing through,\" noun of action from past participle stem of *permeare* \"to pass through,\" from *per-* \"through\" + *meare* \"to go, pass,\" from PIE root *mei-* \"to go.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɜːrmiˈeɪʃən/","syllables":"per-me-a-tion"},"inflection":{"noun_plural":"permeations"},"usage_notes":{"explanation":"\"Permeation\" refers to the process by which a substance spreads or passes through another substance. It is commonly used in scientific and technical contexts, particularly in fields like chemistry, physics, biology, and engineering. The term implies a gradual and often subtle process of penetration. It is often used to describe the movement of liquids, gases, or even abstract concepts through a medium or system.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The permeation of the company.","correct":"✓ The permeation into the company.","note":"When referring to permeation into a specific place or organization, use the preposition \"into\". However, using \"of\" is correct when referring to the permeation of a substance (e.g., \"the permeation of water\")."},{"incorrect":"✗ Permeation is very quick.","correct":"✓ Permeation is very fast. / ✓ The rate of permeation is very quick.","note":"While \"quick\" can be used, \"fast\" is more commonly used to describe the speed of permeation. If you want to use \"quick\", specify that you are talking about the rate of permeation."}],"priority":"★★☆"},"related_words":{"derivatives":["permeate (verb)","permeable (adjective)","permeability (noun)","impermeable (adjective)","impermeability (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. Used primarily in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Permeation\" is a relatively advanced term that describes the process of something spreading or passing through something else. It's often used in scientific or technical contexts to describe the movement of liquids, gases, or even ideas through a medium. For example, you might talk about the permeation of a gas through a membrane or the permeation of new ideas into a company. The key idea is that it's a gradual process of spreading or penetrating.","priority":"★★☆"},"example_sentences":[{"sentence":"The **permeation** of the dye into the fabric resulted in a vibrant color.","translation":"染料の生地への浸透により、鮮やかな色になりました。","type":"noun","meaning_category":"浸透"},{"sentence":"Scientists are studying the **permeation** of pollutants through the soil.","translation":"科学者たちは土壌中の汚染物質の浸透を研究しています。","type":"noun","meaning_category":"浸透"},{"sentence":"The **permeation** of the new policy throughout the organization was met with resistance.","translation":"新しい方針の組織全体への浸透は、抵抗を受けました。","type":"noun","meaning_category":"浸透"},{"sentence":"The membrane's effectiveness is measured by its resistance to **permeation**.","translation":"膜の有効性は、浸透に対する抵抗によって測定されます。","type":"noun","meaning_category":"浸透"}]}