{"word":"Uncatechisedness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The state of being uninstructed in the principles of religion, especially the Christian religion.","english_definition":"The state of being uninstructed in the principles of religion, especially the Christian religion.","examples":[{"sentence":"The uncatechisedness of the population was a concern for the church leaders.","translation":"その地域住民が宗教の教義を十分に教えられていないことは、教会の指導者たちにとって懸念事項であった。"}],"collocations":["general uncatechisedness","widespread uncatechisedness"],"synonyms":["ignorance of religious doctrine","lack of religious instruction","religious illiteracy"],"antonyms":["catechizedness","religious instruction","religious education"]}],"etymology":{"value":"Formed from \"uncatechised\" (not instructed in religious principles) + \"-ness\" (a suffix denoting state or condition). \"Uncatechised\" comes from \"catechise\" (to instruct in religious principles), which originates from the Greek word \"katēcheō\" (to instruct orally).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnkætɪˈkaɪzdnəs/","syllables":"Un-cat-e-chised-ness"},"inflection":{"noun_plural":"uncatechisednesses (rare)"},"usage_notes":{"explanation":"This word refers specifically to a lack of instruction in religious principles, particularly within a Christian context. It is a relatively rare and formal term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The uncatechisedness was due to lack of schools.","correct":"✓ The uncatechisedness was due to a lack of religious instruction.","note":"The word specifically relates to religious instruction, not general education."}],"priority":"★☆☆"},"related_words":{"derivatives":["uncatechised (adjective)","catechise (verb)","catechism (noun)","catechetical (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare word)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Uncatechisedness' is a rare and formal noun referring to the state of not being instructed in the basic principles of a religion, particularly Christianity. It implies a lack of religious education or knowledge. Due to its specialized and infrequent use, it is considered a high-level vocabulary word. Understanding the root word 'catechise' (to instruct in religious principles) is helpful in deciphering its meaning."},"example_sentences":[{"sentence":"The report highlighted the growing uncatechisedness among young adults.","translation":"その報告書は、若年成人層における宗教的教義の未学習が拡大していることを強調した。","type":"general"},{"sentence":"The bishop expressed concern about the uncatechisedness of new church members.","translation":"司教は、新しく教会のメンバーになった人たちが宗教的教義を十分に教えられていないことについて懸念を表明した。","type":"religious context"}]}