{"word":"re-edification","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"再教育、再啓発、再構築","english_definition":"The process of educating or edifying again; rebuilding or reconstructing in an enlightening way.","examples":[{"sentence":"The city underwent a period of re-edification after the war, focusing on rebuilding not only infrastructure but also community values.","translation":"戦後、その都市は再教育の時代を迎え、インフラだけでなくコミュニティの価値観の再構築にも重点を置いた。"},{"sentence":"The curriculum reform aimed at the re-edification of students in critical thinking and problem-solving skills.","translation":"カリキュラム改革は、批判的思考と問題解決スキルにおける学生の再教育を目的としていた。"}],"collocations":["cultural re-edification","moral re-edification","spiritual re-edification","social re-edification"],"synonyms":["re-education","re-enlightenment","reconstruction","rebuilding","revival","renewal"],"antonyms":["destruction","demolition","ignorance","neglect"]}],"etymology":{"value":"The word is formed by adding the prefix 're-' (meaning again or anew) to 'edification'. 'Edification' itself comes from the Latin 'aedificare' (to build, construct), which is derived from 'aedes' (a building, temple). Therefore, 're-edification' literally means 'to build again' in an enlightening or educational sense.","priority":"★★☆"},"pronunciation":{"ipa":"/riːˌɛdɪfɪˈkeɪʃən/","syllables":"re-ed-i-fi-ca-tion"},"inflection":{"noun_plural":"re-edifications"},"usage_notes":{"explanation":"'Re-edification' is a relatively uncommon word, often used in academic or philosophical contexts. It implies not just a simple repetition of education, but a deeper, more transformative process of rebuilding knowledge, understanding, or values. It can refer to the re-establishment of moral, cultural, or spiritual foundations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The re-edification of the building was completed.","correct":"✓ The reconstruction of the building was completed.","note":"'Re-edification' is not typically used for physical buildings; use 'reconstruction' or 'rebuilding' instead. It mainly refers to intellectual or moral rebuilding."},{"incorrect":"✗ He needs re-edification in basic math.","correct":"✓ He needs re-education in basic math.","note":"For basic skills, 're-education' is more common. 'Re-edification' suggests a more profound, value-oriented learning process."}],"priority":"★☆☆"},"related_words":{"derivatives":["edification","edify","re-edify"],"antonyms":["deconstruction","destruction"],"related_concepts":["rehabilitation","reformation","restoration","renaissance"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Re-edification' is a complex word that signifies the act of educating or enlightening someone again, often with the aim of rebuilding or reconstructing their understanding, values, or knowledge. It's not just about repeating education but about a transformative process of renewal. This term is typically found in academic or philosophical discussions where the focus is on profound intellectual or moral rebuilding rather than simple skill acquisition or information recall."},"example_sentences":[{"sentence":"The program aimed at the re-edification of prisoners, focusing on moral and ethical development.","translation":"そのプログラムは、囚人の再教育を目的とし、道徳的および倫理的発達に焦点を当てていた。","type":"general","meaning_category":"再教育"},{"sentence":"After years of neglect, the community sought the re-edification of its cultural heritage.","translation":"長年の無視の後、コミュニティは文化的遺産の再構築を求めた。","type":"general","meaning_category":"再構築"},{"sentence":"The philosophical movement promoted the re-edification of society through critical self-reflection.","translation":"その哲学運動は、批判的な自己反省を通じて社会の再教育を促進した。","type":"academic","meaning_category":"再啓発"}]}