{"word":"Alfileria","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物) アルフィレリア、アメリカフウロ (Erodium cicutarium)","english_definition":"A common annual plant (Erodium cicutarium) in the geranium family, native to the Mediterranean region and naturalized in many parts of the world, including North America. It is often used as forage for livestock.","examples":[{"sentence":"The alfileria plant is known for its distinctive seed pods.","translation":"アルフィレリアの植物は、特徴的な種子のさやで知られています。"},{"sentence":"Alfileria is a valuable forage crop in arid regions.","translation":"アルフィレリアは乾燥地域では貴重な飼料作物です。"}],"collocations":["alfileria plant","Erodium cicutarium","forage crop"],"synonyms":["redstem filaree","red-stemmed stork's bill","common stork's-bill"],"antonyms":[]}],"etymology":{"value":"The word \"alfileria\" comes from the Spanish word \"alfiler,\" meaning \"pin.\" This refers to the shape of the plant's seed pods, which resemble pins.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌælfɪˈlɪəriə/","syllables":"al-fi-le-ri-a"},"inflection":{"noun_plural":"alfilerias"},"usage_notes":{"explanation":"Alfileria is primarily used to refer to the plant Erodium cicutarium. It is not a commonly used word outside of botanical or agricultural contexts. The plant is known by several common names, including redstem filaree and common stork's-bill.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Erodium (genus name)","Geraniaceae (plant family)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'alfileria' is a relatively uncommon term, primarily used in botanical or agricultural contexts to refer to the plant Erodium cicutarium. Due to its specialized usage, it is not typically encountered in general English conversation or writing. Understanding this term requires familiarity with plant nomenclature or specific knowledge of forage crops. Other more common names for this plant include 'redstem filaree' or 'common stork's-bill.'"},"example_sentences":[{"sentence":"The cattle grazed on the abundant alfileria in the meadow.","translation":"牛は牧草地の豊富なアルフィレリアを食べていた。","type":"noun","meaning_category":"植物"},{"sentence":"Alfileria is well-adapted to drought conditions.","translation":"アルフィレリアは干ばつ条件によく適応している。","type":"noun","meaning_category":"植物"}]}