{"word":"differentially","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"差別的に、区別して、異なって","english_definition":"in a differential manner; in a way that shows a difference or distinction; in a way that relates to or is based on a difference.","examples":[{"sentence":"The students were treated differentially based on their performance.","translation":"学生たちは成績に基づいて差別的に扱われた。"},{"sentence":"The two groups responded differentially to the treatment.","translation":"その2つのグループは治療に対して異なった反応を示した。"},{"sentence":"The tax system affects different income groups differentially.","translation":"税制は異なる所得層に異なった影響を与える。"}],"collocations":["treat differentially (差別的に扱う)","respond differentially (異なって反応する)","affect differentially (異なって影響する)","behave differentially (異なって行動する)"],"synonyms":["distinctly","variously","unequally","discriminatorily"],"antonyms":["equally","uniformly","identically","similarly"]},{"part_of_speech":"adverb","definition":"微分的に、微小に","english_definition":"in a manner relating to or using mathematical differentials.","examples":[{"sentence":"The equation was solved differentially.","translation":"その方程式は微分的に解かれた。"},{"sentence":"The rate of change was analyzed differentially.","translation":"変化率は微分的に分析された。"}],"collocations":["solve differentially (微分的に解く)","analyze differentially (微分的に分析する)"],"synonyms":["calculably","mathematically"],"antonyms":[]}],"etymology":{"value":"The word \"differentially\" is derived from the adjective \"differential,\" which comes from the verb \"differentiate.\" The root is the Latin word \"differre,\" meaning \"to carry apart, differ.\" The suffix \"-ly\" turns the adjective into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɪfəˈrɛnʃəli/","syllables":"dif-fer-en-tial-ly"},"inflection":{"notes":"As an adverb, \"differentially\" does not have different inflections (e.g., comparative or superlative forms)."},"usage_notes":{"explanation":"\"Differentially\" is used to describe actions or processes that are carried out in a way that acknowledges or creates differences. It can refer to treating things or people unequally or to analyzing something using mathematical differentials. The context usually makes it clear which meaning is intended. In mathematical contexts, it specifically relates to calculus and the use of differentials to analyze rates of change.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patients were treated different.","correct":"✓ The patients were treated differentially.","note":"\"Different\" is an adjective, while \"differentially\" is an adverb. Use the adverb to describe how something is treated. Alternatively, you could say \"The patients were treated in a different way.\""},{"incorrect":"✗ The software calculates the result difference.","correct":"✓ The software calculates the result differentially.","note":"\"Difference\" is a noun. In this context, you need the adverb \"differentially\" to describe how the software calculates the result."}],"priority":"★★☆"},"related_words":{"derivatives":["differential (adjective, noun)","differentiate (verb)","difference (noun)"],"phrases":["differential calculus (微分積分学)","differential equation (微分方程式)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"differentially\" is an adverb that means 'in a way that shows a difference' or, in mathematics, 'using differentials.' It's not a common word in everyday conversation but is more often found in academic or technical contexts, such as social sciences (when discussing differential treatment) or mathematics (when discussing differential equations). Understanding its meaning requires a good grasp of the related words 'difference' and 'differentiate.'"},"example_sentences":[{"sentence":"The company's marketing strategy targeted different demographics differentially.","translation":"その会社のマーケティング戦略は、異なる人口統計層を差別的にターゲットにした。","type":"general","meaning_category":"Showing a difference"},{"sentence":"The cells responded differentially to the hormone.","translation":"その細胞はホルモンに対して異なった反応を示した。","type":"scientific","meaning_category":"Showing a difference"},{"sentence":"The model calculates the impact of each variable differentially.","translation":"そのモデルは各変数の影響を微分的に計算する。","type":"mathematical","meaning_category":"Mathematical"}]}