{"word":"Amphorophony","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A hollow, ringing sound heard in auscultation, resembling that produced by blowing over the mouth of an empty bottle. It indicates a large, thin-walled cavity in the lung, or a pneumothorax with a bronchopleural fistula.","english_definition":"A hollow, ringing sound heard during auscultation, resembling the sound made by blowing across the mouth of a bottle; indicative of a large, thin-walled cavity in the lung or a pneumothorax with a bronchopleural fistula.","examples":[{"sentence":"The doctor detected amphorophony during the lung examination.","translation":"医師は肺の診察中に両音性呼吸音を検出した。"},{"sentence":"Amphorophony can be a key sign in diagnosing certain pulmonary conditions.","translation":"両音性呼吸音は、特定の肺の状態を診断する上で重要な兆候となることがある。"}],"collocations":["detect amphorophony","presence of amphorophony","pulmonary amphorophony"],"synonyms":["cavernous breathing","hollow sound","tympanic resonance"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'amphora' (a two-handled jar) and 'phone' (sound), referring to the sound's resemblance to that produced by blowing across the mouth of a jar or bottle.","priority":"★★☆"},"pronunciation":{"ipa":"/æmˌfɔːˈrɒfəni/","syllables":"am-pho-ro-pho-ny"},"inflection":{"noun_plural":"amphorophonies"},"usage_notes":{"explanation":"Amphorophony is a clinical sign primarily used in the field of pulmonology. It is detected through auscultation, the process of listening to internal body sounds, typically with a stethoscope. The presence of amphorophony suggests specific pathological conditions within the lung or pleural space.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient complained of amphorophony.","correct":"✓ The doctor detected amphorophony during auscultation.","note":"Amphorophony is a sound detected by a healthcare professional, not a symptom reported by the patient. "},{"incorrect":"✗ Amphorophony is a common symptom of asthma.","correct":"✓ Amphorophony is associated with conditions like pneumothorax or large lung cavities.","note":"Amphorophony is typically associated with specific conditions involving air-filled spaces in the lung, not common conditions like asthma."}],"priority":"★☆☆"},"related_words":{"derivatives":["amphoric (adjective: relating to or resembling the sound of amphorophony)","auscultation (noun: the act of listening to internal body sounds)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (specialized medical vocabulary)","frequency_google_ngram":"Very low frequency (specialized medical term)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Amphorophony' is a highly specialized medical term used in pulmonology. It refers to a specific type of sound detected during auscultation of the lungs, resembling the sound produced by blowing across the mouth of a bottle. Understanding this term requires a background in medical terminology and respiratory physiology."},"example_sentences":[{"sentence":"The presence of **amphorophony** on the right side indicated a possible pneumothorax.","translation":"右側に両音性呼吸音が認められたことは、気胸の可能性を示唆していた。","type":"noun","meaning_category":"medical sign"},{"sentence":"The resident physician was trained to differentiate **amphorophony** from other abnormal lung sounds.","translation":"研修医は、両音性呼吸音を他の異常な肺音と区別するように訓練された。","type":"noun","meaning_category":"medical training"}]}