{"word":"non-communicating","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"コミュニケーションを取らない、意思疎通をしない、非伝達性の","english_definition":"Not communicating; not able or willing to communicate. Not transmitting or conveying information.","examples":[{"sentence":"The patient was non-communicating due to the severity of their condition.","translation":"患者は容態が重篤なため、コミュニケーションを取ることができなかった。"},{"sentence":"The two departments were non-communicating, leading to duplicated efforts.","translation":"その2つの部署は意思疎通ができておらず、結果として作業の重複が生じた。"},{"sentence":"A non-communicating device cannot send or receive data.","translation":"非伝達性のデバイスはデータを送受信できない。"}],"collocations":["non-communicating patient (コミュニケーションを取れない患者)","non-communicating departments (意思疎通のない部署)","non-communicating device (非伝達性のデバイス)"],"synonyms":["uncommunicative","reticent","silent","isolated","disconnected"],"antonyms":["communicative","responsive","talkative","connected","transmitting"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to the word 'communicating'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn.kəˈmjuːnɪˌkeɪ.tɪŋ/","syllables":"non-com-mu-ni-cat-ing"},"inflection":{"notes":"This is an adjective, so it doesn't inflect in the same way as verbs or nouns. However, it can be used in comparative and superlative phrases (e.g., more non-communicating, most non-communicating)."},"usage_notes":{"explanation":"'Non-communicating' describes something or someone that is not engaging in communication. This can be due to an inability to communicate (e.g., a medical condition), a lack of willingness to communicate (e.g., reticence), or a technical state where communication is not possible (e.g., a disconnected device). The context usually makes the specific reason clear.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The non-communication person.","correct":"The non-communicating person.","note":"'Non-communication' is a noun referring to the lack of communication. 'Non-communicating' is the adjective describing someone who is not communicating."}],"priority":"★★☆"},"related_words":{"derivatives":["non-communication (noun: lack of communication)"],"related_terms":["communication (noun: the process of conveying information)","communicative (adjective: willing and able to communicate)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'non-communicating' is used in formal contexts to describe something or someone that is not engaging in communication. It is often used in medical, technical, or organizational settings. Understanding the context is crucial to interpreting the specific reason for the lack of communication."},"example_sentences":[{"sentence":"The injured animal was non-communicating and unresponsive to stimuli.","translation":"負傷した動物はコミュニケーションを取らず、刺激にも反応しなかった。","type":"adjective","meaning_category":"Inability to communicate"},{"sentence":"The two departments remained non-communicating despite repeated attempts to bridge the gap.","translation":"その2つの部署は、溝を埋めるための繰り返しの試みにもかかわらず、意思疎通のない状態が続いた。","type":"adjective","meaning_category":"Unwillingness to communicate"},{"sentence":"The satellite was temporarily non-communicating due to a power outage.","translation":"衛星は停電のため一時的に通信不能になった。","type":"adjective","meaning_category":"Technical state of being unable to communicate"}]}