{"word":"brazen-mailed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"身に青銅の鎧を着た","english_definition":"Wearing bronze mail or armor.","examples":[{"sentence":"The brazen-mailed warriors stood ready for battle.","translation":"青銅の鎧を身に着けた戦士たちは、戦闘の準備ができていた。"},{"sentence":"He was a brazen-mailed knight, feared by many.","translation":"彼は青銅の鎧を着た騎士で、多くの人に恐れられていた。"}],"collocations":["brazen-mailed warrior","brazen-mailed knight","brazen-mailed army"],"synonyms":["bronze-armored","bronze-clad"],"antonyms":["unarmored","mail-less"]}],"etymology":{"value":"The word is a compound of 'brazen' (made of or resembling brass/bronze) and 'mailed' (wearing mail, referring to a type of armor made of interlocking metal rings or plates).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbreɪzən meɪld/","syllables":"bra-zen-mailed"},"inflection":{"notes":"This word is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Brazen-mailed' is an archaic or literary term, primarily used to describe warriors or knights adorned in bronze armor. It evokes a sense of ancient warfare and is not commonly used in modern contexts. The term emphasizes the material and appearance of the armor.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He brazen-mailed the letter.","correct":"✓ He sent the letter.","note":"'Brazen-mailed' refers to wearing bronze armor, not sending mail. This is a common misunderstanding due to the word 'mail' being part of the compound word."}],"priority":"★☆☆"},"related_words":{"derivatives":["brazen (adjective: bold and without shame; made of brass)","mail (noun: armor made of interlocking metal rings or plates)"],"phrases":["brazen armor","mail armor"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - Primarily found in literary or historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Brazen-mailed' is a highly specialized and archaic term, primarily encountered in literature describing ancient or mythological warriors. Understanding requires knowledge of both 'brazen' (referring to bronze or brass) and 'mail' (referring to a type of armor). Due to its infrequent use and specific context, it is considered a high-level vocabulary word."},"example_sentences":[{"sentence":"The epic poem described the brazen-mailed hero's valiant deeds.","translation":"その叙事詩は、青銅の鎧を身に着けた英雄の勇敢な行いを描写していた。","type":"adjective","meaning_category":"descriptive"},{"sentence":"A vision of brazen-mailed soldiers filled his dreams.","translation":"青銅の鎧を身に着けた兵士たちの幻影が彼の夢を満たした。","type":"adjective","meaning_category":"imagery"}]}