{"word":"Cowper","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"カウパー（姓）","english_definition":"A surname.","examples":[{"sentence":"Mr. Cowper is a well-respected member of the community.","translation":"カウパーさんは地域社会で尊敬されている人物です。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"ウィリアム・カウパー（人名）","english_definition":"William Cowper (1731–1800), an English poet and hymnodist.","examples":[{"sentence":"Cowper's poems often reflect his personal struggles with mental health.","translation":"カウパーの詩は、しばしば彼の精神的な健康との個人的な闘いを反映している。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"カウパー腺","english_definition":"Either of two small glands in the male reproductive system that secrete a fluid which lubricates the urethra.","examples":[{"sentence":"The Cowper's glands are located near the urethra.","translation":"カウパー腺は尿道の近くに位置している。"}],"collocations":[],"synonyms":["bulbourethral gland"],"antonyms":[]}],"etymology":{"value":"Surname: Possibly from Middle English couper, cowper, meaning a maker or seller of tubs or buckets. Person: Named after William Cowper. Gland: Named after anatomist William Cowper (1666–1709).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkaʊpər/","syllables":"Cow-per"},"inflection":{},"usage_notes":{"explanation":"Cowper can refer to a surname, a famous English poet (William Cowper), or the Cowper's glands (bulbourethral glands) in the male reproductive system. The context will usually make it clear which meaning is intended.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The word Cowper is typically encountered in specific contexts: as a surname, when discussing the poet William Cowper, or in medical or biological contexts referring to the Cowper's glands. Its usage is not common in everyday conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"I am reading a biography of William Cowper.","translation":"私はウィリアム・カウパーの伝記を読んでいる。","type":"noun","meaning_category":"人名"},{"sentence":"The Cowper family has lived in this town for generations.","translation":"カウパー家はこの町に何世代にもわたって住んでいる。","type":"noun","meaning_category":"姓"},{"sentence":"The fluid secreted by the Cowper's gland helps to neutralize acidity in the urethra.","translation":"カウパー腺から分泌される液体は、尿道内の酸性を中和するのに役立つ。","type":"noun","meaning_category":"カウパー腺"}]}