{"word":"Hypocalcemia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"低カルシウム血症","english_definition":"A condition in which there are lower-than-normal levels of calcium in the blood.","examples":[{"sentence":"Hypocalcemia can cause muscle cramps and spasms.","translation":"低カルシウム血症は筋肉のけいれんや痙攣を引き起こす可能性があります。"},{"sentence":"Severe hypocalcemia can be life-threatening.","translation":"重度の低カルシウム血症は生命を脅かす可能性があります。"},{"sentence":"The doctor diagnosed her with hypocalcemia after blood tests.","translation":"医師は血液検査の結果、彼女を低カルシウム血症と診断しました。"}],"collocations":["cause hypocalcemia (低カルシウム血症を引き起こす)","treat hypocalcemia (低カルシウム血症を治療する)","severe hypocalcemia (重度の低カルシウム血症)","mild hypocalcemia (軽度の低カルシウム血症)","hypocalcemia symptoms (低カルシウム血症の症状)"],"synonyms":["calcium deficiency","low blood calcium"],"antonyms":["hypercalcemia"]}],"etymology":{"value":"From 'hypo-' (below, deficient) + 'calc-' (referring to calcium) + '-emia' (condition of the blood).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpoʊkælˈsiːmiə/","syllables":"hy-po-cal-ce-mi-a"},"inflection":{"noun_plural":"hypocalcemias"},"usage_notes":{"explanation":"Hypocalcemia refers specifically to the medical condition of having abnormally low calcium levels in the blood. It is important to distinguish between hypocalcemia and dietary calcium deficiency, although the latter can contribute to the former. Diagnosis is based on blood tests, and treatment typically involves calcium and vitamin D supplementation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have hypocalcemia, so I need to eat more calcium-rich foods.","correct":"✓ I have hypocalcemia, so I need to take calcium supplements and eat more calcium-rich foods.","note":"While dietary calcium is important, hypocalcemia often requires medical treatment, such as supplements, to correct the deficiency. Simply eating more calcium-rich foods may not be sufficient."},{"incorrect":"✗ Hypocalcemia is the same as osteoporosis.","correct":"✓ Hypocalcemia is a condition of low blood calcium, while osteoporosis is a condition of weakened bones.","note":"Hypocalcemia and osteoporosis are related to calcium, but they are distinct conditions. Hypocalcemia is low blood calcium, while osteoporosis is a decrease in bone density."}],"priority":"★★☆"},"related_words":{"derivatives":["hypocalcemic (adjective)"],"related_terms":["calcium","hypercalcemia","parathyroid hormone (PTH)","vitamin D"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency (専門用語)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hypocalcemia' is a medical term referring to a condition characterized by abnormally low levels of calcium in the blood. It is typically diagnosed through blood tests and often requires medical intervention, such as calcium and vitamin D supplementation. The term is primarily used in medical contexts and is not commonly encountered in everyday language. It's crucial to differentiate it from general calcium deficiency, which might be addressed through dietary changes.","priority":"★★☆"},"example_sentences":[{"sentence":"Chronic kidney disease is a common cause of hypocalcemia.","translation":"慢性腎臓病は低カルシウム血症の一般的な原因です。","type":"medical condition","meaning_category":"cause"},{"sentence":"Symptoms of hypocalcemia include muscle spasms and numbness.","translation":"低カルシウム血症の症状には、筋肉の痙攣やしびれなどがあります。","type":"medical condition","meaning_category":"symptoms"},{"sentence":"Treatment for hypocalcemia often involves calcium and vitamin D supplements.","translation":"低カルシウム血症の治療には、カルシウムとビタミンDのサプリメントがよく用いられます。","type":"medical condition","meaning_category":"treatment"}]}