{"word":"Coliforms","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"大腸菌群","english_definition":"A group of bacteria, mostly harmless, that live in the intestines of humans and animals. Their presence in water indicates fecal contamination and the potential presence of disease-causing bacteria.","examples":[{"sentence":"The water sample tested positive for coliforms, indicating contamination.","translation":"その水サンプルは大腸菌群に対して陽性反応を示し、汚染を示唆していた。"},{"sentence":"Coliforms are used as an indicator organism to assess water quality.","translation":"大腸菌群は、水質を評価するための指標生物として使用される。"}],"collocations":["total coliforms (総大腸菌群)","fecal coliforms (糞便性大腸菌群)","coliform bacteria (大腸菌群)","coliform count (大腸菌群数)","coliform contamination (大腸菌群汚染)"],"synonyms":["coliform bacteria"],"antonyms":[]}],"etymology":{"value":"Derived from 'coli-' referring to colon (large intestine) and '-form' indicating shape or form.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒlɪfɔːrmz/","syllables":"col-i-forms"},"inflection":{"noun_plural":"coliforms (already plural)"},"usage_notes":{"explanation":"'Coliforms' refers to a group of bacteria, not a specific species. Their presence indicates potential fecal contamination. Fecal coliforms, a subgroup, are more specific to fecal matter.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Coliform is a type of bacteria.","correct":"✓ Coliforms are a group of bacteria.","note":"Coliforms is a group, not a single type."},{"incorrect":"✗ Coliforms are always harmful.","correct":"✓ Coliforms indicate potential contamination, and some may be harmful.","note":"Not all coliforms are harmful, but their presence suggests the possibility of harmful bacteria."}],"priority":"★★☆"},"related_words":{"derivatives":["coliform (singular form, less common in general use)","fecal coliforms (糞便性大腸菌群)","E. coli (大腸菌 - a specific type of fecal coliform)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, primarily used in scientific or environmental contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Coliforms' are a group of bacteria found in the intestines of animals and humans. Their presence in water is an indicator that the water may be contaminated with fecal matter, which could mean that other, more dangerous bacteria are also present. While not all coliforms are harmful themselves, their presence is a warning sign. The term is often used in environmental science and water quality testing.","note":"This term is technical and more likely to be encountered in scientific or technical contexts."},"example_sentences":[{"sentence":"The city issued a boil water advisory after coliforms were detected in the water supply.","translation":"市は、水道水から大腸菌群が検出されたため、煮沸勧告を発令した。","type":"general","meaning_category":"definition"},{"sentence":"Regular testing is essential to ensure that coliform levels in drinking water remain within safe limits.","translation":"飲料水中の大腸菌群レベルが安全な範囲内にとどまるように、定期的な検査が不可欠である。","type":"general","meaning_category":"definition"}]}