{"word":"Sibucao","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A traditional Filipino beverage made from the bark of the sibukaw tree (Caesalpinia sappan). It is known for its reddish color and is often used as a natural dye.","english_definition":"A traditional Filipino beverage made from the bark of the sibukaw tree (Caesalpinia sappan), known for its reddish color and use as a natural dye.","examples":[{"sentence":"My grandmother still makes Sibucao during special occasions.","translation":"私の祖母は特別な機会に今でもSibucaoを作ります。"},{"sentence":"The reddish hue of the fabric came from Sibucao dye.","translation":"その生地の赤みがかった色合いはSibucao染料に由来します。"}],"collocations":["make Sibucao","Sibucao dye","traditional Sibucao"],"synonyms":["sibukaw drink","sappan bark tea"],"antonyms":[]}],"etymology":{"value":"Derived from the local name of the sappan tree (Caesalpinia sappan) in the Philippines.","priority":"★★★"},"pronunciation":{"ipa":"/siˈbuːkaʊ/","syllables":"Si-bu-cao"},"inflection":{"noun_plural":"Sibucaos"},"usage_notes":{"explanation":"Sibucao is primarily known as a cultural drink and a natural dye. It is associated with traditional practices in the Philippines.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Sibucao is a type of coffee.","correct":"✓ Sibucao is a traditional Filipino drink made from sappan bark.","note":"Sibucao is not coffee; it's made from sappan bark."}],"priority":"★★★"},"related_words":{"derivatives":["sibukaw (sappan tree)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★★★"},"readability_explanation":{"level":"C1","text":"'Sibucao' is a specialized term referring to a traditional Filipino beverage and dye. Understanding its usage requires familiarity with Philippine culture and traditional practices. It is not a commonly used word in general English.","priority":"★★★"},"example_sentences":[{"sentence":"The old woman showed us how to prepare Sibucao using traditional methods.","translation":"その老婦人は、伝統的な方法でSibucaoを準備する方法を教えてくれました。","type":"noun","meaning_category":"Traditional beverage"},{"sentence":"Sibucao is often used to dye fabrics a rich red color.","translation":"Sibucaoは、生地を豊かな赤色に染めるためによく使用されます。","type":"noun","meaning_category":"Natural dye"}]}