{"word":"widowish","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"未亡人のような、未亡人風の、未亡人っぽい","english_definition":"Resembling or characteristic of a widow; somewhat like a widow.","examples":[{"sentence":"She wore a widowish black dress to the funeral.","translation":"彼女は葬儀に未亡人風の黒いドレスを着て行った。"},{"sentence":"The house had a widowish gloom about it.","translation":"その家は未亡人のような陰鬱な雰囲気を漂わせていた。"},{"sentence":"After her husband's death, she adopted a widowish lifestyle.","translation":"夫の死後、彼女は未亡人のような生活様式を取り入れた。"}],"collocations":["widowish dress","widowish gloom","widowish lifestyle"],"synonyms":["mournful","somber","bereaved","grief-stricken"],"antonyms":["married","husbanded"]},{"part_of_speech":"adjective","definition":"（特に中年女性が）未亡人めいた、未亡人のように見える","english_definition":"(Especially of a middle-aged woman) appearing like a widow; having characteristics associated with widows.","examples":[{"sentence":"She had a certain widowish air about her, even though she was still young.","translation":"彼女はまだ若かったが、どこか未亡人めいた雰囲気を持っていた。"},{"sentence":"Her widowish attire made her look older than she was.","translation":"彼女の未亡人めいた服装は、彼女を実年齢よりも老けて見させた。"}],"collocations":["widowish attire","widowish air","widowish appearance"],"synonyms":["matronly","dowdy","old-fashioned"],"antonyms":["youthful","fashionable"]}],"etymology":{"value":"The word \"widowish\" is formed by adding the suffix \"-ish\" to the word \"widow.\" The suffix \"-ish\" indicates a resemblance to or characteristic of something. Therefore, \"widowish\" means \"resembling or characteristic of a widow.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɪdoʊɪʃ/","syllables":"wid-ow-ish"},"inflection":{"notes":"Adjective; comparative and superlative forms are generally not used."},"usage_notes":{"explanation":"\"Widowish\" is a descriptive adjective used to indicate that something or someone resembles or is characteristic of a widow. It is often used to describe clothing, appearance, or atmosphere. The term can sometimes carry a slightly negative connotation, suggesting a somber or old-fashioned quality.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is widowish.","correct":"✓ She has a widowish appearance.","note":"It's more common to say someone 'has a widowish appearance' or 'wears widowish clothes' rather than simply stating 'she is widowish,' as the latter can sound awkward."},{"incorrect":"✗ He looked widowish.","correct":"✓ He looked bereaved.","note":"The term 'widowish' is generally used to describe women or things associated with widows. For men, terms like 'bereaved' or 'grief-stricken' are more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["widow (noun)","widower (noun)","widowhood (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR vocabulary lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"widowish\" is a relatively uncommon adjective that describes something or someone as resembling or characteristic of a widow. It is formed by adding the suffix \"-ish\" to \"widow,\" indicating a similarity or approximation. This word is typically used in descriptive contexts to convey a sense of somberness, mourning, or a style associated with widows. Understanding the base word \"widow\" is essential to grasping the meaning of \"widowish.\" The word is not frequently encountered in everyday language, so familiarity with more advanced vocabulary is helpful for comprehension."},"example_sentences":[{"sentence":"The room was decorated in a widowish style, with dark colors and heavy curtains.","translation":"部屋は未亡人のようなスタイルで装飾されており、暗い色と重いカーテンが使われていた。","type":"adjective","meaning_category":"Resembling a widow"},{"sentence":"She had a widowish look about her, even though her husband was still alive.","translation":"彼女は夫がまだ生きているにもかかわらず、未亡人のような雰囲気を持っていた。","type":"adjective","meaning_category":"Characteristic of a widow"},{"sentence":"The old house had a widowish air of sadness and neglect.","translation":"その古い家は、未亡人のような悲しみと荒廃の雰囲気を漂わせていた。","type":"adjective","meaning_category":"Resembling a widow"}]}