{"word":"pseudamphorae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(考古学)擬似アンフォラ、アンフォラに似た形状の容器","english_definition":"(archaeology) plural form of pseudamphora, a type of pottery vessel resembling an amphora in shape but differing in some characteristics.","examples":[{"sentence":"Several pseudamphorae were discovered during the excavation of the ancient Roman villa.","translation":"古代ローマの別荘の発掘中に、いくつかの擬似アンフォラが発見された。"}],"collocations":["ceramic pseudamphorae","ancient pseudamphorae","excavated pseudamphorae"],"synonyms":["amphora-like vessel","pottery container","archaeological artifact"],"antonyms":[]}],"etymology":{"value":"\"pseudamphora\" is derived from the Greek words \"pseudo-\" meaning false or imitation, and \"amphora,\" a type of ancient Greek or Roman jar or vase with two handles and a narrow neck. The plural form \"pseudamphorae\" follows the Latin pluralization.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsjuːdæmˈfɔːriː/","syllables":"pseu-dam-pho-rae"},"inflection":{"noun_plural":"pseudamphorae"},"usage_notes":{"explanation":"\"Pseudamphorae\" refers specifically to archaeological finds. These vessels are similar in appearance to amphorae but do not meet the precise criteria to be classified as true amphorae. The term is used by archaeologists and art historians.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I found a pseudamphora.","correct":"✓ I found a pseudamphora or I found several pseudamphorae.","note":"Since \"pseudamphorae\" is the plural, use \"pseudamphora\" for the singular."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudamphora (singular form)","amphora (related vessel type)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"pseudamphorae\" is a specialized term used in archaeology and art history to describe pottery vessels that resemble amphorae but differ in some characteristics. It is unlikely to be encountered outside of these contexts. Understanding requires familiarity with archaeological terminology and ancient pottery types."},"example_sentences":[{"sentence":"The museum's collection includes several well-preserved pseudamphorae from the Hellenistic period.","translation":"博物館のコレクションには、ヘレニズム時代からの保存状態の良い擬似アンフォラがいくつか含まれている。","type":"noun","meaning_category":"容器"},{"sentence":"Archaeologists are studying the pseudamphorae to understand their function and origin.","translation":"考古学者は、擬似アンフォラの機能と起源を理解するために研究している。","type":"noun","meaning_category":"容器"}]}