{"word":"Melanoidin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"メラノイジン：メイラード反応によって生成される、高分子で窒素を含む褐色の化合物群。特に、麦芽の焙煎や食品の加熱調理中に生成され、風味や色に影響を与える。","english_definition":"A class of high-molecular-weight, nitrogen-containing brown-colored compounds formed by the Maillard reaction. They are produced especially during the roasting of malt or the heating of food and contribute to flavor and color.","examples":[{"sentence":"Melanoidins contribute to the characteristic color and flavor of roasted coffee.","translation":"メラノイジンは、焙煎されたコーヒーの独特の色と風味に貢献する。"},{"sentence":"The melanoidin content in beer can influence its stability and antioxidant properties.","translation":"ビール中のメラノイジン含有量は、その安定性と抗酸化特性に影響を与える可能性がある。"}],"collocations":["melanoidin formation (メラノイジン生成)","melanoidin content (メラノイジン含有量)","beer melanoidins (ビールメラノイジン)","malt melanoidins (麦芽メラノイジン)"],"synonyms":["Maillard reaction products","brown pigments"],"antonyms":[]}],"etymology":{"value":"「メラノ」(melano-：黒色の接頭辞) + 「イジン」(oidin：～に似たものを示す接尾辞) の組み合わせ。メラノイジンが褐色の色素であることに由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/məˈlænɔɪdɪn/","syllables":"me-lan-oi-din"},"inflection":{"noun_plural":"melanoidins"},"usage_notes":{"explanation":"「**Melanoidin**」は、食品化学や醸造学の分野でよく使われる専門用語です。食品の加熱や麦芽の焙煎時に、アミノ酸と還元糖が反応するメイラード反応によって生成される複雑な高分子化合物群を指します。メラノイジンは、食品や飲料の色、風味、抗酸化特性に影響を与えます。特に、ビール、コーヒー、パンなどの製造において重要な役割を果たします。一般の会話ではほとんど使われません。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Melanoidin is a type of sugar.","correct":"✓ Melanoidin is a complex polymer formed from sugars and amino acids.","note":"メラノイジンは糖の一種ではなく、糖とアミノ酸から形成される複雑なポリマーです。"},{"incorrect":"✗ Melanoidin is only found in dark beers.","correct":"✓ Melanoidin is found in many foods and beverages that undergo heating or roasting, including some beers.","note":"メラノイジンは、ビールだけでなく、加熱または焙煎された多くの食品や飲料に含まれています。"}],"priority":"★☆☆"},"related_words":{"derivatives":["melanogenesis (メラニン生成)","Maillard reaction (メイラード反応)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Melanoidin**」は、食品科学や醸造学で使われる専門用語で、メイラード反応によって作られる褐色の化合物を指します。この化合物は、食品の色や風味に影響を与え、特に焙煎された麦芽やコーヒー豆に含まれています。一般の会話ではほとんど使われません。"},"example_sentences":[{"sentence":"The dark color of the stout is largely due to the presence of melanoidins.","translation":"スタウトの濃い色は、主にメラノイジンの存在によるものである。","type":"noun","meaning_category":"化学化合物 (食品)"},{"sentence":"Researchers are studying the antioxidant properties of melanoidins in coffee.","translation":"研究者たちは、コーヒー中のメラノイジンの抗酸化特性を研究している。","type":"noun","meaning_category":"化学化合物 (食品)"}]}