{"word":"Womanity","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"女性らしさ、女性であること、女性の集団、女性の権利や地位を向上させること","english_definition":"The quality of being a woman; the characteristics, roles, and experiences associated with being female; women collectively; the advocacy of women's rights and equality.","examples":[{"sentence":"The conference focused on celebrating womanity in all its forms.","translation":"その会議は、あらゆる形の女性らしさを祝福することに焦点を当てました。"},{"sentence":"She dedicated her life to promoting womanity and empowering women around the world.","translation":"彼女は女性らしさを促進し、世界中の女性に力を与えることに生涯を捧げました。"},{"sentence":"The novel explores the complexities of womanity in a patriarchal society.","translation":"その小説は、家父長制社会における女性らしさの複雑さを探求しています。"},{"sentence":"The organization's mission is to advance womanity through education and advocacy.","translation":"その組織の使命は、教育と擁護を通じて女性らしさを前進させることです。"}],"collocations":["celebrate womanity (女性らしさを祝う)","promote womanity (女性らしさを促進する)","explore womanity (女性らしさを探求する)","advance womanity (女性らしさを前進させる)","essence of womanity (女性らしさの本質)"],"synonyms":["femininity","femaleness","womanhood","sisterhood","women's rights","female empowerment"],"antonyms":["masculinity","manhood"]},{"part_of_speech":"noun","definition":"(特定の文脈で)女性の人道的側面、女性特有の共感力や思いやり","english_definition":"(In specific contexts) the humanitarian aspects of women; the empathy and compassion unique to women.","examples":[{"sentence":"Her work as a nurse demonstrated the true womanity of her character.","translation":"看護師としての彼女の仕事は、彼女の性格の真の女性らしさを示していました。"},{"sentence":"The project aims to harness the power of womanity to address global challenges.","translation":"そのプロジェクトは、地球規模の課題に対処するために、女性らしさの力を活用することを目指しています。"}],"collocations":["power of womanity (女性らしさの力)","true womanity (真の女性らしさ)"],"synonyms":["compassion","empathy","humanity","kindness","tenderness"],"antonyms":["cruelty","callousness"]}],"etymology":{"value":"A blend of 'woman' and 'humanity', suggesting the qualities and experiences unique to women as part of the broader human experience.","priority":"★★☆"},"pronunciation":{"ipa":"/wʊˈmænɪti/","syllables":"wo-man-i-ty"},"inflection":{"noun_plural":"womanities (rarely used)"},"usage_notes":{"explanation":"'Womanity' is a relatively modern term, often used to emphasize the positive aspects of being a woman and to advocate for women's rights and empowerment. It can also refer to the collective group of women or the qualities and characteristics associated with being female. The term is less common than 'femininity' or 'womanhood', but it carries a stronger emphasis on the social and political aspects of being a woman.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed great womanity in his actions.","correct":"✓ She showed great womanity in her actions.","note":"'Womanity' refers to qualities associated with women, so it is typically used to describe female actions or characteristics."},{"incorrect":"✗ Womanity is the same as femininity.","correct":"✓ Womanity is similar to femininity, but it emphasizes the social and political aspects of being a woman more strongly.","note":"While related, 'womanity' often carries a stronger emphasis on the social and political aspects of being a woman compared to 'femininity', which focuses more on traditional gender roles and characteristics."}],"priority":"★★☆"},"related_words":{"derivatives":["woman (noun)","humanity (noun)","femininity (noun)","womanhood (noun)","feminism (noun)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (not a common word)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Womanity' is a less common word that combines 'woman' and 'humanity'. It generally refers to the qualities, characteristics, and experiences associated with being a woman. It can also refer to women collectively or the advocacy of women's rights and equality. The word is often used to emphasize the positive aspects of being a woman and to promote female empowerment. It is more commonly used in academic or activist contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The exhibition celebrated the diversity and strength of womanity.","translation":"その展示会は、女性らしさの多様性と強さを祝福しました。","type":"noun","meaning_category":"女性らしさ、女性であること"},{"sentence":"She is a strong advocate for womanity and gender equality.","translation":"彼女は女性らしさと男女平等を強く提唱しています。","type":"noun","meaning_category":"女性の権利や地位を向上させること"},{"sentence":"The film explores the unique challenges and triumphs of womanity in modern society.","translation":"その映画は、現代社会における女性らしさのユニークな課題と勝利を探求しています。","type":"noun","meaning_category":"女性らしさ、女性であること"},{"sentence":"The organization works to empower women and advance womanity around the world.","translation":"その組織は、世界中の女性に力を与え、女性らしさを前進させるために活動しています。","type":"noun","meaning_category":"女性の権利や地位を向上させること"}]}