{"word":"chargee","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律) 担保権者、被担保者 (債権担保のために財産を譲り受けた者)","english_definition":"(Law) A person to whom a charge is given as security for a debt or obligation; the secured party.","examples":[{"sentence":"The bank is the chargee in this mortgage agreement.","translation":"この住宅ローン契約において、銀行が担保権者です。"},{"sentence":"The chargee has the right to sell the property if the borrower defaults.","translation":"借り手が債務不履行に陥った場合、担保権者はその財産を売却する権利を有します。"}],"collocations":["mortgage chargee (住宅ローン担保権者)","secured chargee (担保付き担保権者)","unsecured chargee (無担保担保権者)"],"synonyms":["secured creditor","mortgagee","lienholder"],"antonyms":["chargor","mortgagor","debtor"]}],"etymology":{"value":"The term 'chargee' is derived from the word 'charge', meaning a security interest or lien over property. It is formed by adding the suffix '-ee', which denotes the recipient of an action or benefit.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈtʃɑːrdʒiː/","syllables":"chargee"},"inflection":{"noun_plural":"chargees"},"usage_notes":{"explanation":"The term 'chargee' is primarily used in legal and financial contexts to refer to the party who holds a charge (security interest) over an asset. It is most commonly encountered in discussions of mortgages, loans, and other forms of secured debt. The chargee's rights and obligations are typically defined in the charge agreement or mortgage deed.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The chargee must always be a bank.","correct":"✓ The chargee can be a bank, a financial institution, or even a private individual.","note":"While banks are common chargees, any entity or individual can be a chargee if they hold a security interest in an asset."},{"incorrect":"✗ The chargee is responsible for maintaining the property.","correct":"✓ The chargor (borrower) is typically responsible for maintaining the property.","note":"The chargor (borrower) retains ownership and responsibility for the property unless there is a default."}],"priority":"☆☆☆"},"related_words":{"derivatives":["charge (noun: 担保、債務負担；verb: 担保設定する)","chargor (noun: 担保設定者、債務者)","chargeable (adjective: 課税対象の、請求可能な)"],"idioms_phrases":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A (Legal/Financial Term)","frequency_google_ngram":"Low frequency - Specialized legal/financial term.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Chargee' is a legal term referring to the entity (often a bank or financial institution) that holds a charge or security interest over a property or asset. This means they have a claim on the asset if the borrower (chargor) fails to repay their debt. The term is primarily used in formal legal and financial contexts. Understanding this term requires a strong grasp of legal and financial concepts related to secured transactions."},"example_sentences":[{"sentence":"As the chargee, the lender has the right to foreclose on the property if the borrower defaults on the loan.","translation":"担保権者として、貸し手は借り手がローンの支払いを怠った場合、その財産を差し押さえる権利を有します。","type":"noun","meaning_category":"担保権者"},{"sentence":"The chargee's interest is protected by the terms of the security agreement.","translation":"担保権者の利益は、担保契約の条項によって保護されています。","type":"noun","meaning_category":"担保権者"},{"sentence":"Before granting the loan, the bank ensured it would be the first-ranking chargee.","translation":"融資を行う前に、銀行は自らが第一順位の担保権者となることを確認しました。","type":"noun","meaning_category":"担保権者"}]}