{"word":"riotingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"騒動を起こして、暴動を起こすように","english_definition":"In a manner involving or resembling a riot; in a tumultuous or disorderly way.","examples":[{"sentence":"The crowd behaved riotingly, throwing objects and shouting slogans.","translation":"群衆は騒動を起こすように振る舞い、物を投げつけ、スローガンを叫んだ。"},{"sentence":"The news report described the scene as riotingly chaotic.","translation":"ニュース報道はその光景を、暴動が起きているかのように混沌としていると描写した。"}],"collocations":["behave riotingly","act riotingly","riotingly chaotic","riotingly destructive"],"synonyms":["tumultuously","disorderly","turbulently","unruly","riotously"],"antonyms":["peacefully","calmly","orderly"]},{"part_of_speech":"adverb","definition":"非常に、極めて (比喩的に、抑制なく、激しく)","english_definition":"In an extreme or unrestrained manner; excessively. (Figurative)","examples":[{"sentence":"The garden was riotingly overgrown with weeds.","translation":"庭は雑草が非常に生い茂っていた。"},{"sentence":"The colors in the painting were riotingly vibrant.","translation":"絵の中の色は極めて鮮やかだった。"}],"collocations":["riotingly overgrown","riotingly vibrant","riotingly colorful","riotingly abundant"],"synonyms":["excessively","extremely","intensely","unrestrainedly","rampantly"],"antonyms":["moderately","restrainedly","sparsely"]}],"etymology":{"value":"Derived from the adjective 'rioting' (participial adjective of 'riot') and the suffix '-ly'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈraɪətɪŋli/","syllables":"ri-ot-ing-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"The adverb 'riotingly' describes actions or states that resemble or involve a riot, either literally or figuratively. Literally, it describes behavior that is tumultuous and disorderly, like a riot. Figuratively, it can describe something that is excessive or unrestrained, such as a garden overgrown with weeds. The figurative sense implies a lack of control or restraint, similar to the chaos of a riot.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The flowers grew riotingly in the vase.","correct":"✓ The flowers grew riotously in the vase.","note":"'Riotously' is more commonly used than 'riotingly' to describe something abundant or unrestrained, especially in a positive or celebratory context. 'Riotingly' often carries a negative connotation of disorder or chaos."}],"priority":"★☆☆"},"related_words":{"derivatives":["riot (noun, verb)","rioter (noun)","rioting (noun, adjective)","riotous (adjective)","riotously (adverb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Riotingly' is an advanced adverb that describes something done in a manner resembling a riot or in an unrestrained, excessive way. It is not a commonly used word and is more often found in descriptive or literary contexts. The word can be used both literally, to describe actions that are tumultuous and disorderly, and figuratively, to describe something that is excessively vibrant or overgrown. Because of its infrequent use and nuanced meaning, it is considered a high-level vocabulary word."},"example_sentences":[{"sentence":"The protesters marched riotingly through the streets, demanding change.","translation":"抗議者たちは騒動を起こすように街路をデモ行進し、変革を要求した。","type":"adverb","meaning_category":"騒動を起こして"},{"sentence":"The jungle vegetation grew riotingly, swallowing the ancient ruins.","translation":"ジャングルの植生は非常に生い茂り、古代遺跡を飲み込んだ。","type":"adverb","meaning_category":"非常に (比喩的に)"}]}