{"word":"dominial","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"領地の、領主の、領有の","english_definition":"relating to or characteristic of a lord's domain or ownership; pertaining to a domain or dominion.","examples":[{"sentence":"The dominial rights were fiercely protected by the lord.","translation":"領有権は領主によって厳重に保護されていた。"},{"sentence":"Dominial lands were often worked by serfs.","translation":"領地はしばしば農奴によって耕作されていた。"},{"sentence":"The dominial system shaped the social structure of the time.","translation":"領主制度はその時代の社会構造を形作った。"}],"collocations":["dominial rights","dominial lands","dominial system"],"synonyms":["lordly","manorial","seigniorial","territorial"],"antonyms":["public","common","communal"]}],"etymology":{"value":"Derived from the word 'domain', which comes from the Old French 'demaine' meaning 'lord's land', ultimately from Latin 'dominium' (ownership, property).","priority":"★★☆"},"pronunciation":{"ipa":"/dəˈmɪniəl/","syllables":"do-min-i-al"},"inflection":{"notes":"Adjective, no specific inflectional forms beyond comparative/superlative (more dominial, most dominial), which are rarely used."},"usage_notes":{"explanation":"'Dominial' is a relatively rare and formal term, primarily used in historical or legal contexts to describe things related to the ownership or control of land by a lord or sovereign. It is not commonly used in modern, everyday English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The dominial government provided services to everyone.","correct":"✓ The local government provided services to everyone.","note":"'Dominial' refers specifically to a lord's domain, not general governance. Use 'local' or 'regional' government instead."},{"incorrect":"✗ He had a dominial influence over his friends.","correct":"✓ He had a dominant influence over his friends.","note":"'Dominial' relates to land ownership; for influence, use 'dominant'."}],"priority":"★★☆"},"related_words":{"derivatives":["domain","dominion","dominate","dominant"],"phrases":["dominial rights","dominial land","dominial system"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (very rare, specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'dominial' is a specialized term relating to land ownership and control, particularly in a historical context involving lords and domains. It is not commonly used in modern English and would primarily be encountered in academic or historical texts. Understanding the root word 'domain' is helpful in deciphering its meaning."},"example_sentences":[{"sentence":"The historical records detailed the transfer of dominial authority from one noble family to another.","translation":"歴史的記録は、ある貴族の家系から別の家系への領有権の移転を詳述していた。","type":"adjective","meaning_category":"領地の"},{"sentence":"The dominial economy was based on agriculture and the labor of tenant farmers.","translation":"領地経済は農業と小作農の労働に基づいていた。","type":"adjective","meaning_category":"領主の"},{"sentence":"The king asserted his dominial claim over the newly discovered territories.","translation":"王は新たに発見された領土に対する領有権を主張した。","type":"adjective","meaning_category":"領有の"}]}