{"word":"pseudoprostyle","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(建築) 擬似プロスタイルの、プロスタイル風の：建物の正面に、構造的な支持を持たない、壁に付加された柱がある様式。","english_definition":"(architecture) Having columns across the front of a building that are attached to the wall, rather than being structurally independent.","examples":[{"sentence":"The building's pseudoprostyle facade gave the impression of a classical temple.","translation":"その建物の擬似プロスタイルのファサードは、古典的な神殿のような印象を与えた。"},{"sentence":"Many Roman temples adopted a pseudoprostyle design to save on construction costs.","translation":"多くのローマ神殿は、建設費用を節約するために擬似プロスタイルのデザインを採用した。"}],"collocations":["pseudoprostyle temple","pseudoprostyle portico","pseudoprostyle facade"],"synonyms":["engaged column facade","attached column facade"],"antonyms":["prostyle","peripteral"]}],"etymology":{"value":"\"Pseudo-\" (偽の) + \"prostyle\" (プロスタイル：建物の正面に独立した柱が並ぶ様式) から構成される。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsjuːdoʊˈproʊstaɪl/","syllables":"pseu-do-pro-style"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"\"**pseudoprostyle**\" は建築様式を指す専門用語であり、日常会話ではほとんど使用されません。古典建築、特に神殿や公共建築物の様式を議論する際に用いられます。プロスタイル（prostyle）とは異なり、柱が独立しておらず、壁に埋め込まれている（エンゲージド・コラム）点が特徴です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building was built in a prostyle way, but the columns were not free-standing, so it was pseudoprostyle.","correct":"✓ The building was pseudoprostyle because the columns were engaged, not free-standing.","note":"プロスタイルと擬似プロスタイルの違いは、柱が独立しているか、壁に埋め込まれているかです。"},{},{"incorrect":"✗ The architect used pseudoprostyle columns to support the roof.","correct":"✓ The architect used pseudoprostyle columns for decorative purposes.","note":"擬似プロスタイルの柱は構造的な支持を持たないため、屋根を支える目的には使用されません。"}],"priority":"★★☆"},"related_words":{"derivatives":["pseudoperipteral (擬似周柱式の)"],"related_terms":["prostyle (プロスタイル)","peripteral (周柱式の)","engaged column (エンゲージド・コラム、付柱)","portico (ポルティコ、柱廊)","facade (ファサード、正面)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 建築学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**pseudoprostyle**」は建築様式に関する専門用語で、一般的にはほとんど使われません。この用語は、建物の正面に柱が並んでいるものの、それらの柱が構造的に独立しておらず、壁に埋め込まれている（付柱）様式を指します。古典建築、特に古代ギリシャやローマの神殿建築について議論する際に用いられることがあります。建築史や建築デザインを専門的に学ぶ場合に遭遇する可能性が高い単語です。"},"example_sentences":[{"sentence":"The Maison Carrée in Nîmes, France, is a well-preserved example of a Roman pseudoprostyle temple.","translation":"フランスのニームにあるメゾン・カレは、保存状態の良いローマの擬似プロスタイル神殿の例である。","type":"adjective","meaning_category":"建築様式"},{"sentence":"The portico of the building features a pseudoprostyle arrangement of Corinthian columns.","translation":"その建物のポルティコは、コリント式の柱が擬似プロスタイルに配置されているのが特徴である。","type":"adjective","meaning_category":"建築様式"}]}