{"word":"dracontic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(天文学)竜の、交点周期の","english_definition":"Relating to the mean period between successive passages of the moon through the same node of its orbit.","examples":[{"sentence":"The dracontic month is shorter than the sidereal month.","translation":"交点月は恒星月よりも短い。"}],"collocations":[],"synonyms":["nodal"],"antonyms":[]},{"part_of_speech":"adjective","definition":"(比喩)非常に厳しい、過酷な","english_definition":"(Figurative) Extremely severe or cruel.","examples":[{"sentence":"The new laws were dracontic in their severity.","translation":"新しい法律はその厳しさにおいて非常に過酷だった。"}],"collocations":[],"synonyms":["draconian","severe","harsh","cruel","stringent"],"antonyms":["lenient","mild","compassionate"]}],"etymology":{"value":"From Latin draconticus, from Ancient Greek δρακοντικός (drakontikós, “of or pertaining to a dragon or serpent”), from δράκων (drákōn, “dragon, serpent”). The astronomical sense refers to the 'dragon' representing the nodes of the moon's orbit, where eclipses can occur. The figurative sense derives from Draco, an Athenian lawgiver known for his harsh laws.","priority":"★★☆"},"pronunciation":{"ipa":"/drəˈkɒntɪk/","syllables":"dra-con-tic"},"inflection":{},"usage_notes":{"explanation":"The word 'dracontic' has two main senses. The first, used in astronomy, refers to the dracontic month, which is the period between successive passages of the Moon through the same node of its orbit. The second, and more common, usage is figurative, meaning extremely severe or cruel, often used to describe laws or punishments. This latter sense is derived from Draco, an ancient Athenian lawgiver known for his harsh legal code.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["draconian"],"related_terms":["Draco"]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The word 'dracontic' is relatively rare and has two distinct meanings. One meaning, used in astronomy, refers to the dracontic month, which is related to the moon's orbit. The other, more common meaning, describes something extremely severe or cruel. This word is not commonly used in everyday conversation and is more likely to be found in formal writing or specialized contexts. Understanding the context is crucial to correctly interpret its meaning."},"example_sentences":[{"sentence":"Astronomers study the dracontic month to predict eclipses.","translation":"天文学者たちは、日食を予測するために交点月を研究する。","type":"adjective","meaning_category":"astronomy"},{"sentence":"The dictator imposed dracontic measures to suppress dissent.","translation":"独裁者は反対意見を抑圧するために非常に厳しい措置を課した。","type":"adjective","meaning_category":"figurative"}]}