{"word":"deformation-independent","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"変形に依存しない","english_definition":"Not depending on deformation; remaining constant or unaffected by changes in shape or size.","examples":[{"sentence":"The material property is deformation-independent, meaning it remains the same regardless of how much the object is stretched or compressed.","translation":"その材料特性は変形に依存しないため、物体がどれだけ引き伸ばされたり圧縮されたりしても同じ状態を保ちます。"},{"sentence":"For simplicity, we assume the model is deformation-independent in this range of stress.","translation":"簡単にするために、この応力範囲ではモデルが変形に依存しないと仮定します。"}],"collocations":["deformation-independent material property","deformation-independent model","deformation-independent behavior"],"synonyms":["invariant to deformation","deformation-insensitive","shape-independent"],"antonyms":["deformation-dependent","deformation-sensitive"]}],"etymology":{"value":"The term is formed by combining \"deformation\" (change in shape), \"independent\" (not depending on), and the hyphen to link them.","priority":"★★★"},"pronunciation":{"ipa":"/diˌfɔːrˈmeɪʃən ɪndɪˈpɛndənt/","syllables":"de-for-ma-tion in-di-pen-dent"},"inflection":{"notes":"This is an adjective and does not have different forms for inflection."},"usage_notes":{"explanation":"The term \"deformation-independent\" is used to describe properties or models that do not change or are not affected by the deformation (change in shape or size) of an object or material. It's often used in physics, engineering, and material science to simplify models or describe ideal behaviors.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The deformation independent property.","correct":"✓ The deformation-independent property.","note":"The hyphen is crucial to correctly form the compound adjective. Without it, the phrase doesn't make sense grammatically."},{"incorrect":"✗ The model is independent of deform.","correct":"✓ The model is independent of deformation.","note":"Use the noun form \"deformation\" after \"independent of.\""}],"priority":"★★☆"},"related_words":{"derivatives":["deformation","independent","dependence"],"related_terms":["elasticity","plasticity","stress","strain","constitutive model"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized term used in technical fields.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"deformation-independent\" describes something that doesn't change when an object is deformed (changes shape). It's a technical term used in fields like engineering and physics. If a property is deformation-independent, it means that stretching, compressing, or otherwise changing the shape of an object doesn't affect that property. This is often a simplifying assumption made in models to make calculations easier.","priority":"★★☆"},"example_sentences":[{"sentence":"The assumption of a deformation-independent dielectric constant simplifies the analysis.","translation":"変形に依存しない誘電率の仮定は、解析を簡素化します。","type":"adjective","meaning_category":"General"},{"sentence":"In this model, the yield strength is considered deformation-independent.","translation":"このモデルでは、降伏強度は変形に依存しないと見なされます。","type":"adjective","meaning_category":"Material Science"},{"sentence":"We assume a deformation-independent refractive index for the optical fiber.","translation":"光ファイバーの屈折率は変形に依存しないと仮定します。","type":"adjective","meaning_category":"Physics"}]}