{"word":"entour","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(建築・都市計画) 周囲の環境、背景、添景","english_definition":"(architecture, urban planning) The surrounding environment or context of a building or site, including landscaping, vegetation, and other features that enhance the visual appeal and integration of the design.","examples":[{"sentence":"The architect carefully considered the existing entour when designing the new building.","translation":"建築家は新しい建物を設計する際に、既存の周囲の環境を注意深く検討しました。"},{"sentence":"The urban plan included detailed specifications for the entour, including trees, parks, and public spaces.","translation":"都市計画には、樹木、公園、公共スペースなど、周囲の環境に関する詳細な仕様が含まれていました。"},{"sentence":"The artist added figures and other elements to the painting to create a more realistic and engaging entour.","translation":"画家は、より現実的で魅力的な背景を作成するために、人物やその他の要素を絵画に追加しました."}],"collocations":["architectural entour","urban entour","site entour","landscape entour","vegetation entour","contextual entour","visual entour","natural entour","existing entour","planned entour"],"synonyms":["setting","surroundings","context","environment","ambiance","atmosphere","backdrop","background","landscape","scene"],"antonyms":[]}],"etymology":{"value":"Borrowed from French *entour*, from *entourer* (“to surround”), from *en-* + *tour* (“turn, circuit”).","priority":"★★☆"},"pronunciation":{"ipa":"/ɑ̃ˈtuːr/","syllables":"ahn-toor"},"inflection":{"noun_plural":"entours"},"usage_notes":{"explanation":"The term *entour* is primarily used in architecture, landscape architecture, and urban planning to refer to the surrounding environment of a building or site. It includes both natural and man-made elements that contribute to the overall aesthetic and functional integration of the design. The term can also be used more broadly to refer to the context or setting of a work of art or other creative endeavor.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building's interior was impressive, but the entour was neglected.","correct":"✓ The building's interior was impressive, but the *entourage* was neglected.","note":"*Entour* (surrounding environment) is often confused with *entourage* (a group of people attending or surrounding an important person). Make sure to use the correct term based on the context."}],"priority":"★★☆"},"related_words":{"derivatives":["entourage (a group of people attending or surrounding an important person)","entourer (French verb: to surround)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word *entour* is a specialized term primarily used in the fields of architecture, landscape architecture, and urban planning. It refers to the surrounding environment or context of a building or site, including both natural and man-made elements that contribute to the overall design. Understanding the meaning of *entour* requires familiarity with the vocabulary and concepts of these fields. It is not a commonly used word in general conversation or writing."},"example_sentences":[{"sentence":"The architect's rendering showed the building integrated seamlessly into its natural **entour**.","translation":"建築家のレンダリングは、建物が自然の周囲の環境にシームレスに統合されていることを示していました。","type":"noun","meaning_category":"surrounding environment"},{"sentence":"The landscape architect carefully selected plants that would complement the existing **entour**.","translation":"ランドスケープアーキテクトは、既存の周囲の環境を補完する植物を注意深く選択しました。","type":"noun","meaning_category":"surrounding environment"},{"sentence":"The city planners considered the impact of the new development on the surrounding **entour**.","translation":"都市計画家は、新しい開発が周囲の環境に与える影響を検討しました。","type":"noun","meaning_category":"surrounding environment"}]}