{"word":"Undernourishments","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"栄養不良（の状態）","english_definition":"The state of being undernourished; insufficient nutrition.","examples":[{"sentence":"The doctor was concerned about the child's undernourishments.","translation":"医者はその子供の栄養不良を心配していた。"},{"sentence":"Undernourishments can lead to serious health problems.","translation":"栄養不良は深刻な健康問題につながる可能性がある。"}],"collocations":["severe undernourishments (重度の栄養不良)","childhood undernourishments (小児期の栄養不良)"],"synonyms":["malnutrition","undernutrition","inanition"],"antonyms":["nourishment","nutrition","overnourishment"]}],"etymology":{"value":"'Undernourishment' is derived from 'under-' (meaning 'below' or 'insufficient') + 'nourishment' (meaning 'the food or other substances necessary for growth, health, and good condition'). The plural form 'undernourishments' is less common but refers to multiple instances or types of undernourishment.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌʌndərˈnʌrɪʃmənts/","syllables":"un-der-nour-ish-ments"},"inflection":{"noun_plural":"Undernourishments"},"usage_notes":{"explanation":"'Undernourishment' refers to the condition of not receiving enough nutrients, while 'Undernourishments,' in its plural form, might refer to different instances or types of such conditions. It's less frequently used in the plural.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The undernourishment are a problem in the region.","correct":"✓ Undernourishment is a problem in the region.","note":"'Undernourishment' is typically used as an uncountable noun to describe the general state. Use the plural form 'undernourishments' only when referring to specific instances or types of undernourishment. In most contexts, the singular form is preferred."}],"priority":"★☆☆"},"related_words":{"derivatives":["undernourished (adjective: 栄養不良の)","nourishment (noun: 栄養)","nourish (verb: 栄養を与える)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (専門的な文脈でまれに使用)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 一般的な会話ではほとんど使用されない。","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Undernourishments' is the plural form of 'undernourishment,' which refers to the state of not having enough food or the right kinds of food for good health and growth. It is a less common term than 'undernourishment' or 'malnutrition.' You would typically encounter this word in specialized or technical contexts when discussing multiple instances or types of undernourishment. It is more common to use the singular form 'undernourishment' when referring to the general condition.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The report detailed various undernourishments affecting children in the developing world.","translation":"その報告書は、発展途上国の子どもたちに影響を与えている様々な栄養不良について詳述した。","type":"noun","meaning_category":"栄養不良（の状態）"},{"sentence":"Different types of undernourishments require different treatment strategies.","translation":"異なる種類の栄養不良には、異なる治療戦略が必要となる。","type":"noun","meaning_category":"栄養不良（の状態）"}]}