{"word":"nonanaemic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"貧血ではない、非貧血性の","english_definition":"Not suffering from anemia; not relating to or characterized by anemia.","examples":[{"sentence":"The patient was diagnosed as nonanaemic during the routine check-up.","translation":"定期検診で、患者は貧血ではないと診断された。"},{"sentence":"We need to ensure that the population remains nonanaemic through proper nutrition.","translation":"適切な栄養を通して、国民が貧血にならないようにする必要があります。"}],"collocations":["nonanaemic patient","nonanaemic population","remain nonanaemic","diagnosed as nonanaemic"],"synonyms":["healthy","not anemic","blood-sufficient"],"antonyms":["anaemic","anemic","blood-deficient"]},{"part_of_speech":"adjective","definition":"(比喩的に)活気がない状態ではない","english_definition":"(figuratively) Not lacking in vitality or energy.","examples":[{"sentence":"The project remained nonanaemic despite the initial setbacks.","translation":"そのプロジェクトは、最初の挫折にもかかわらず、活気を失わなかった。"}],"collocations":["nonanaemic project","nonanaemic performance"],"synonyms":["vigorous","energetic","dynamic"],"antonyms":["anaemic","lethargic","lifeless"]}],"etymology":{"value":"The word 'nonanaemic' is formed by adding the prefix 'non-' (meaning 'not') to the word 'anaemic'. 'Anaemic' itself comes from the Greek word 'anaimia', meaning 'lack of blood'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnəˈniːmɪk/","syllables":"non-a-nae-mic"},"inflection":{"adjective_forms":{}},"usage_notes":{"explanation":"The term 'nonanaemic' is primarily used in medical contexts to describe a person or condition that is not affected by anemia. Anemia is a condition characterized by a deficiency of red blood cells or hemoglobin in the blood, resulting in pallor and fatigue. Therefore, 'nonanaemic' indicates the absence of this condition. It can also be used figuratively to describe something that is not weak or lacking in vitality.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonanaemic level was checked.","correct":"✓ The hemoglobin level was checked to ensure it was nonanaemic.","note":"'Nonanaemic' is an adjective describing a state, not a level. It's more accurate to say the level was checked to ensure the patient was nonanaemic."},{"incorrect":"✗ He felt nonanaemic after a good night's sleep.","correct":"✓ He felt energetic after a good night's sleep.","note":"While technically correct, 'nonanaemic' is usually reserved for medical contexts. In general conversation, 'energetic' or 'vigorous' would be more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["anaemia (noun)","anemia (noun)","non- (prefix)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nonanaemic' is a specialized term primarily used in medical or scientific contexts. It directly indicates the absence of anemia, a condition involving a deficiency of red blood cells or hemoglobin. Understanding this word requires familiarity with medical terminology related to blood disorders. While the prefix 'non-' is common, the base word 'anaemic' is less frequently encountered in everyday language, making it more suitable for advanced English proficiency levels."},"example_sentences":[{"sentence":"The blood test confirmed that she was nonanaemic.","translation":"血液検査で、彼女が貧血ではないことが確認された。","type":"adjective","meaning_category":"Medical Condition"},{"sentence":"The plant's vibrant green leaves indicated it was nonanaemic.","translation":"その植物の鮮やかな緑色の葉は、それが活力を失っていないことを示していた。","type":"adjective","meaning_category":"Figurative"}]}