{"word":"misdevise","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(法律) (遺言によって)誤って譲渡する、誤って遺贈する","english_definition":"(law) to devise wrongly; to make an improper or invalid devise of (property) by will.","examples":[{"sentence":"The testator attempted to misdevise the property to an ineligible beneficiary.","translation":"遺言者は、その財産を資格のない受益者に誤って遺贈しようとした。"},{"sentence":"The lawyer advised against misdevising the estate, as it could lead to legal challenges.","translation":"弁護士は、遺産の誤った遺贈は法的異議申し立てにつながる可能性があるため、避けるように助言した。"}],"collocations":["misdevise property","misdevise an estate","attempt to misdevise","advise against misdevising"],"synonyms":["misappropriate","misallocate","misbestow","wrongfully devise"],"antonyms":["rightfully devise","properly allocate","correctly bequeath"]}],"etymology":{"value":"The word \"misdevise\" is formed by adding the prefix \"mis-\" (meaning wrongly or improperly) to the word \"devise.\" \"Devise\" comes from the Old French \"deviser,\" meaning to divide or arrange, ultimately from the Latin \"dividere,\" meaning to divide. Therefore, \"misdevise\" literally means to wrongly divide or allocate property through a will.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɪsdɪˈvaɪz/","syllables":"mis-de-vise"},"inflection":{"verb_forms":{"present_simple":["misdevise","misdevises"],"past_simple":"misdevised","past_participle":"misdevised","present_participle":"misdevising"}},"usage_notes":{"explanation":"\"Misdevise\" is a relatively rare and technical term primarily used in legal contexts, specifically concerning wills and the improper or invalid transfer of property. It implies an error or impropriety in the act of devising, rather than intentional wrongdoing (which might be termed fraud or similar). The focus is on the legal validity and correctness of the devise.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He misdevised the plan for the party.","correct":"✓ He misguided the plan for the party.","note":"\"Misdevise\" is specifically related to the wrongful devising of property in a will, not general planning or guidance. Use \"misguide\" or \"mismanage\" in other contexts."},{"incorrect":"✗ She accidentally misdevised.","correct":"✓ She accidentally misdevised the property.","note":"\"Misdevise\" is a transitive verb and requires a direct object (the property being wrongly devised)."}],"priority":"★★☆"},"related_words":{"derivatives":["devise (verb, noun)","devisee (noun)","devisor (noun)"],"phrasal_verbs":[],"related_legal_terms":["will","testament","bequest","legacy","inheritance","estate","probate"]},"level_frequency":{"CEFR":"C2 (very specialized legal vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"misdevise\" is a highly specialized legal term. It is primarily encountered in the context of wills and estates. Understanding requires familiarity with legal terminology related to property transfer and inheritance. Its use is restricted to professional legal settings.","priority":"★☆☆"},"example_sentences":[{"sentence":"The court determined that the testator had misdevised the land due to a clerical error in the will.","translation":"裁判所は、遺言の事務的な誤りにより、遺言者が土地を誤って遺贈したと判断した。","type":"verb","meaning_category":"improperly bequeathing property"},{"sentence":"The lawyer warned that attempting to misdevise assets could result in the will being contested.","translation":"弁護士は、資産を誤って遺贈しようとすると、遺言が無効になる可能性があると警告した。","type":"verb","meaning_category":"attempting improper bequest"}]}