{"word":"embellished-haired","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"髪が装飾された、髪に飾りを施した","english_definition":"Having hair adorned or decorated with ornaments or embellishments.","examples":[{"sentence":"The queen was portrayed as an embellished-haired beauty in the painting.","translation":"その絵の中で、女王は髪に飾りを施した美女として描かれていた。"},{"sentence":"She walked down the runway as an embellished-haired model.","translation":"彼女は髪に飾りを施したモデルとしてランウェイを歩いた。"}],"collocations":["embellished-haired beauty","embellished-haired model"],"synonyms":["decorated-haired","ornamented-haired","adorned-haired"],"antonyms":["plain-haired","unadorned-haired"]}],"etymology":{"value":"The word is a compound adjective formed by combining the past participle 'embellished' (meaning decorated or adorned) with the noun 'haired' (having hair).","priority":"★★★"},"pronunciation":{"ipa":"/ɪmˈbelɪʃt-heərd/","syllables":"im-bel-isht-haird"},"inflection":{"notes":"This is a compound adjective and does not have typical inflectional forms (e.g., comparative or superlative)."},"usage_notes":{"explanation":"'Embellished-haired' is a descriptive adjective used to indicate that someone's hair has been decorated or adorned, typically with ornaments or other decorative elements. It is often used in contexts where the elaborate styling of hair is a significant feature, such as in fashion, art, or historical descriptions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She has embellished hair.","correct":"✓ She has embellished-haired.","note":"When used as a compound adjective before a noun, it should be hyphenated. Alternatively, you could say 'Her hair is embellished.'"},{"incorrect":"✗ The embellished-haired girl.","correct":"✓ The embellished-haired girl.","note":"The hyphen is important to show that 'embellished' modifies 'haired', and together they modify 'girl'."}],"priority":"★★☆"},"related_words":{"derivatives":["embellish (verb: to decorate or adorn)","embellishment (noun: a decoration or adornment)"],"related_terms":["hair ornament","hair accessory","hair decoration"]},"level_frequency":{"frequency_google_ngram":"Low frequency (not commonly found in general text)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'embellished-haired' is relatively uncommon and would likely be encountered in more descriptive or artistic contexts. It's a compound adjective that describes someone whose hair has been decorated or adorned, often elaborately. Understanding the individual components ('embellished' and 'haired') helps in deciphering its meaning. This term is more likely to appear in literature, fashion descriptions, or historical accounts where detailed physical descriptions are common."},"example_sentences":[{"sentence":"The portrait depicted an embellished-haired noblewoman with pearls woven into her braids.","translation":"その肖像画は、真珠が編み込まれた髪に飾りを施した貴婦人を描いていた。","type":"descriptive","meaning_category":"decorated hair"},{"sentence":"The embellished-haired bride walked down the aisle, her hair sparkling under the lights.","translation":"髪に飾りを施した花嫁が通路を歩き、彼女の髪は光の下で輝いていた。","type":"descriptive","meaning_category":"decorated hair"}]}