{"word":"complementarity","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"相補性、相補関係、補完性","english_definition":"The relationship between two or more different things or people in which each enhances the qualities of the others. The state of being complementary.","examples":[{"sentence":"The complementarity of skills within the team ensured its success.","translation":"チーム内のスキルにおける相補性が、チームの成功を確実にした。"},{"sentence":"There is a strong complementarity between the two approaches.","translation":"その二つのアプローチの間には強い相補性がある。"},{"sentence":"The concept of complementarity is central to understanding their relationship.","translation":"相補性の概念は、彼らの関係を理解する上で中心となる。"}],"collocations":["skill complementarity (スキルの相補性)","strategic complementarity (戦略的相補性)","functional complementarity (機能的相補性)","economic complementarity (経済的相補性)","cultural complementarity (文化的相補性)"],"synonyms":["interdependence","mutualism","reciprocity","synergy","correlation","harmony"],"antonyms":["contradiction","conflict","opposition","incompatibility"]},{"part_of_speech":"noun","definition":"(量子力学における)相補性","english_definition":"(in quantum mechanics) the principle that aspects of nature can be understood only by considering them in complementary and apparently mutually exclusive ways.","examples":[{"sentence":"Wave-particle duality is an example of complementarity in quantum mechanics.","translation":"波動と粒子の二重性は、量子力学における相補性の一例である。"},{"sentence":"The principle of complementarity is fundamental to quantum theory.","translation":"相補性の原理は量子論の基礎である。"}],"collocations":["quantum complementarity (量子的相補性)","wave-particle complementarity (波動-粒子相補性)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the word 'complementary', which comes from the Latin 'complementum', meaning 'that which completes or fulfills'. The suffix '-ity' is added to form the noun, indicating a state or quality.","priority":"★★★"},"pronunciation":{"ipa":"/ˌkɒmplɪmənˈtærɪti/","syllables":"com-pli-men-tar-i-ty"},"inflection":{"notes":"This is a noun and does not have different inflections."},"usage_notes":{"explanation":"'Complementarity' refers to a relationship where different elements enhance each other. It's often used in contexts like team dynamics, economics, and quantum mechanics. In team dynamics, it describes how different skills combine to create a stronger whole. In economics, it can refer to how different industries or economies benefit from each other. In quantum mechanics, it describes how certain properties of particles, like wave and particle behavior, are complementary aspects of the same phenomenon.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The company focused on complimentarity, praising each other's work.","correct":"The company focused on complementarity, ensuring their skills worked well together.","note":"'Complementarity' (相補性) should not be confused with 'complimentarity' (お互いを褒め合うこと - これは 'complimentary' の誤用)。"},{"incorrect":"The two theories were completely the same, showing complementarity.","correct":"The two theories were different but worked well together, showing complementarity.","note":"'Complementarity' implies differences that enhance each other, not sameness."}],"priority":"★★☆"},"related_words":{"derivatives":["complementary (adjective)","complement (verb, noun)"],"phrases":["principle of complementarity","complementary goods"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, used in academic and specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Complementarity' is a more advanced term describing how different things enhance each other when combined. It's often used in academic or professional settings to explain how different skills, strategies, or approaches can work together to create a better outcome. It's important to understand that 'complementarity' implies differences that work well together, not things that are identical or in conflict.","priority":"★★☆"},"example_sentences":[{"sentence":"The **complementarity** of their research interests led to a fruitful collaboration.","translation":"彼らの研究関心の相補性が、実り多い共同研究につながった。","type":"general","meaning_category":"相補性"},{"sentence":"The **complementarity** between renewable energy sources can improve grid reliability.","translation":"再生可能エネルギー源間の相補性は、電力網の信頼性を向上させることができる。","type":"technical","meaning_category":"相補性"},{"sentence":"Understanding **complementarity** is crucial for effective team building.","translation":"相補性を理解することは、効果的なチーム構築に不可欠である。","type":"business","meaning_category":"相補性"},{"sentence":"The **complementarity** principle in quantum mechanics highlights the wave-particle duality.","translation":"量子力学における相補性の原理は、波動と粒子の二重性を強調する。","type":"physics","meaning_category":"相補性"}]}