{"word":"NCO","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"下士官 (Non-Commissioned Officer)","english_definition":"A non-commissioned officer; a military officer who has not earned a commission.","examples":[{"sentence":"He rose through the ranks to become a respected NCO.","translation":"彼は昇進を重ね、尊敬される下士官になった。"},{"sentence":"The NCOs are responsible for training the enlisted personnel.","translation":"下士官は、兵卒の訓練を担当する。"}],"collocations":["senior NCO (上級下士官)","junior NCO (下級下士官)","NCO training (下士官訓練)","NCO academy (下士官学校)"],"synonyms":["sergeant","corporal"],"antonyms":["officer (将校)"]},{"part_of_speech":"noun","definition":"(一般的な) 指導的役割を果たす人","english_definition":"(informal) A person who takes on a leadership role, especially in a non-hierarchical setting.","examples":[{"sentence":"She's the NCO of the volunteer group, always organizing events.","translation":"彼女はボランティアグループのまとめ役で、いつもイベントを企画している。"}],"collocations":["team NCO","project NCO"],"synonyms":["leader","organizer","coordinator"],"antonyms":["follower"]}],"etymology":{"value":"An acronym for Non-Commissioned Officer.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛnˌsiːˈoʊ/","syllables":"en-see-oh"},"inflection":{"noun_plural":"NCOs"},"usage_notes":{"explanation":"'NCO' is primarily a military term referring to a Non-Commissioned Officer. These are members of the armed forces who have not earned a commission (i.e., they have risen through the ranks). In informal contexts, it can sometimes be used to describe someone who takes on a leadership role within a group, even if they don't hold a formal position of authority.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an officer, but also an NCO.","correct":"✓ He is an NCO, not an officer.","note":"NCOs and officers are distinct ranks. One cannot be both simultaneously."},{"incorrect":"✗ The NCO's are in charge of the officers.","correct":"✓ The officers are in charge of the NCOs.","note":"Officers generally outrank NCOs, although senior NCOs have significant authority."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"acronyms":["SNCO (Senior Non-Commissioned Officer)"],"military_terms":["enlisted","commissioned officer","ranks"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively common in military contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'NCO' stands for Non-Commissioned Officer. It's a military term for members of the armed forces who have leadership responsibilities but haven't been formally commissioned as officers. Think of them as experienced soldiers who have worked their way up and are now in charge of training and leading other soldiers. Outside of the military, you might occasionally hear it used informally to describe someone who takes charge in a group project or activity, even if they don't have an official title."},"example_sentences":[{"sentence":"The new recruits were assigned to an experienced NCO for training.","translation":"新兵たちは訓練のため、経験豊富な下士官に配属された。","type":"noun","meaning_category":"下士官"},{"sentence":"As a senior NCO, she had the respect of both her subordinates and superiors.","translation":"上級下士官として、彼女は部下からも上官からも尊敬されていた。","type":"noun","meaning_category":"下士官"},{"sentence":"He acted as the NCO for the project, coordinating everyone's efforts.","translation":"彼はプロジェクトのまとめ役として、皆の努力を調整した。","type":"noun","meaning_category":"指導的役割"}]}