{"word":"ketogenesis","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ケトジェネシス、ケトン体生成","english_definition":"The biochemical process by which organisms produce ketone bodies through breakdown of fatty acids and ketogenic amino acids.","examples":[{"sentence":"Ketogenesis occurs primarily in the mitochondria of liver cells.","translation":"ケトジェネシスは主に肝細胞のミトコンドリアで起こる。"},{"sentence":"During periods of fasting, ketogenesis becomes an important source of energy.","translation":"絶食期間中、ケトジェネシスは重要なエネルギー源となる。"}],"collocations":["induce ketogenesis (ケトジェネシスを誘導する)","regulate ketogenesis (ケトジェネシスを調節する)","inhibit ketogenesis (ケトジェネシスを阻害する)"],"synonyms":["ketone body synthesis"],"antonyms":["glycolysis","lipogenesis"]}],"etymology":{"value":"Derived from 'keto-' (referring to ketone bodies) + '-genesis' (meaning creation or production).","priority":"★★★"},"pronunciation":{"ipa":"/ˌkiːtoʊˈdʒɛnɪsɪs/","syllables":"ke-to-gen-e-sis"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Ketogenesis is a metabolic process that produces ketone bodies, which can be used as an alternative fuel source by the body when glucose is limited, such as during fasting, starvation, or a very low-carbohydrate diet (ketogenic diet). It's a crucial adaptation for survival in the absence of sufficient carbohydrates. However, excessive ketogenesis can lead to ketoacidosis, a dangerous condition.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Ketogenesis is the same as ketoacidosis.","correct":"✓ Ketogenesis is the process of producing ketone bodies, while ketoacidosis is a dangerous condition caused by excessive ketone body production.","note":"Ketogenesis is a normal metabolic process, but ketoacidosis is a pathological condition resulting from uncontrolled ketogenesis."}],"priority":"★★☆"},"related_words":{"derivatives":["ketogenic (adjective: ケトン生成性の)","ketone bodies (noun: ケトン体)","ketoacidosis (noun: ケトアシドーシス)"],"related_processes":["lipolysis (脂肪分解)","beta-oxidation (β酸化)","gluconeogenesis (糖新生)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in scientific and medical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Ketogenesis' is a technical term primarily used in biochemistry, nutrition, and medicine. It refers to the process by which the body produces ketone bodies from fats when glucose is scarce. Understanding this term requires some background knowledge in biology and metabolism. It is often discussed in the context of ketogenic diets, diabetes, and starvation.","priority":"★★☆"},"example_sentences":[{"sentence":"The ketogenic diet forces the body to rely on ketogenesis for energy.","translation":"ケトジェニックダイエットは、体がエネルギーのためにケトジェネシスに頼ることを強制する。","type":"general","meaning_category":"general"},{"sentence":"Impaired ketogenesis can lead to metabolic disorders.","translation":"ケトジェネシスの障害は代謝異常を引き起こす可能性がある。","type":"medical","meaning_category":"medical"},{"sentence":"Ketogenesis is upregulated during prolonged exercise in endurance athletes.","translation":"持久系アスリートの長時間の運動中には、ケトジェネシスが上方制御される。","type":"exercise physiology","meaning_category":"exercise physiology"}]}