{"word":"pre-British","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"イギリス以前の、イギリス支配以前の","english_definition":"Existing or occurring before the British presence, influence, or control.","examples":[{"sentence":"The museum displays artifacts from the pre-British era.","translation":"その博物館には、イギリス支配以前の時代の遺物が展示されている。"},{"sentence":"Archaeologists are studying pre-British settlements in the region.","translation":"考古学者たちは、その地域のイギリス以前の集落を研究している。"},{"sentence":"The pre-British legal system was based on customary law.","translation":"イギリス以前の法制度は、慣習法に基づいていた。"}],"collocations":["pre-British history","pre-British culture","pre-British society","pre-British architecture","pre-British inhabitants"],"synonyms":["precolonial","pre-imperial","pre-occupation"],"antonyms":["post-British","British"],"notes":"Often used in historical or archaeological contexts to describe a period or culture before British colonization or influence."}],"etymology":{"value":"Formed by combining the prefix 'pre-' (before) with the adjective 'British'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpriːˈbrɪtɪʃ/","syllables":"pre-Brit-ish"},"inflection":{"notes":"Adjectives do not typically inflect in English. Comparative and superlative forms are possible (more pre-British, most pre-British), but are not common."},"usage_notes":{"explanation":"'Pre-British' is used to specify a time, culture, or system that existed before the arrival or dominance of the British. It is commonly used in discussions of history, archaeology, and cultural studies, particularly in regions that were formerly part of the British Empire. The term helps to distinguish between indigenous developments and those influenced by British colonization.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The prebritish history is fascinating.","correct":"✓ The pre-British history is fascinating.","note":"Hyphenate 'pre-British' when used as an adjective before a noun. Without the hyphen, it is less clear and can be confusing."},{"incorrect":"✗ The building is pre British.","correct":"✓ The building is pre-British.","note":"Use a hyphen when 'pre-' is attached to a proper adjective like 'British'."}],"priority":"★★☆"},"related_words":{"derivatives":["pre-","British","post-British"],"related_terms":["colonial","imperial","indigenous","native","settlement","empire"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency, used primarily in academic or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pre-British' is a compound adjective that means 'before the British'. It's used in academic and historical contexts to describe periods, cultures, or artifacts that existed before British influence or colonization. Understanding the prefix 'pre-' is helpful for grasping the meaning. This term is more common in specialized discussions about history and archaeology."},"example_sentences":[{"sentence":"The study examines the social structures of pre-British India.","translation":"その研究は、イギリス以前のインドの社会構造を調査している。","type":"adjective","meaning_category":"historical"},{"sentence":"These artifacts provide insights into pre-British Aboriginal culture.","translation":"これらの遺物は、イギリス以前のアボリジニ文化への洞察を提供する。","type":"adjective","meaning_category":"cultural"},{"sentence":"The legal system was significantly altered after the arrival of the British, replacing many pre-British customs.","translation":"法制度はイギリス人の到来後、大幅に変更され、イギリス以前の多くの慣習に取って代わった。","type":"adjective","meaning_category":"legal"}]}