{"word":"normativ","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"規範的な、基準となる、標準的な","english_definition":"Establishing, relating to, or deriving from a standard or norm, especially of behavior.","examples":[{"sentence":"Normative economics deals with value judgments and opinions.","translation":"規範経済学は、価値判断や意見を扱う。","note":"経済学における規範的な議論の例"},{"sentence":"The company established normative guidelines for employee conduct.","translation":"会社は従業員の行動に関する規範的なガイドラインを確立した。","note":"行動規範の例"},{"sentence":"Normative ethics seeks to define moral standards.","translation":"規範倫理学は、道徳的基準を定義しようとする。","note":"倫理学における規範的な議論の例"}],"collocations":["normative standard","normative behavior","normative ethics","normative economics","normative rules","normative values"],"synonyms":["prescriptive","standard","ideal","regulatory","evaluative"],"antonyms":["descriptive","positive","non-normative"]}],"etymology":{"value":"Derived from the word 'norm,' indicating a standard or rule. The suffix '-ative' indicates a quality or tendency towards that standard.","priority":"★★☆"},"pronunciation":{"ipa":"/nɔʁmatɪf/","syllables":"nor-ma-tiv"},"inflection":{"notes":"Adjective; does not inflect for gender or number in English."},"usage_notes":{"explanation":"The term 'normativ' is often used in academic and professional contexts, particularly in fields like economics, ethics, sociology, and political science. It describes concepts or statements that express value judgments or prescribe standards of behavior, rather than simply describing what is.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The research was very normativ.","correct":"The research was very normative.","note":"Correct spelling is crucial."},{"incorrect":"Normative is the same as normal.","correct":"Normative is related to norms, but it's not the same as normal. Normal describes what is common, while normative describes what should be.","note":"Distinguish from 'normal,' which means usual or typical."}],"priority":"★★☆"},"related_words":{"derivatives":["norm (noun)","normalization (noun)","normatively (adverb)"],"phrases":["normative statement","normative claim","normative theory"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency, primarily used in academic and specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'normativ' is a specialized term used to describe something that establishes or relates to a standard or norm. It's commonly found in academic discussions, especially in fields like ethics, economics, and sociology. Understanding this word requires familiarity with abstract concepts and a higher level of vocabulary."},"example_sentences":[{"sentence":"The normative approach to policy-making involves setting goals and determining how best to achieve them.","translation":"政策立案への規範的なアプローチは、目標を設定し、それを達成するための最良の方法を決定することを含む。","type":"adjective","meaning_category":"規範的な"},{"sentence":"Many ethical debates center on normative questions about what is right or wrong.","translation":"多くの倫理的な議論は、何が正しくて何が間違っているかという規範的な問題を中心に展開する。","type":"adjective","meaning_category":"規範的な"},{"sentence":"Normative statements express value judgments and cannot be empirically verified.","translation":"規範的な記述は価値判断を表現し、経験的に検証することはできない。","type":"adjective","meaning_category":"規範的な"}]}