{"word":"pulsar","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"パルサー（高精度な周期で電磁波を放射する中性子星）","english_definition":"A rapidly rotating neutron star that emits a beam of electromagnetic radiation, which can be detected as pulses of radio waves, X-rays, or gamma rays.","examples":[{"sentence":"Pulsars are formed when massive stars collapse at the end of their lives.","translation":"パルサーは、大質量の星が寿命の終わりに崩壊するときに形成されます。"},{"sentence":"The Crab Pulsar is one of the most well-known pulsars.","translation":"かに星雲パルサーは、最もよく知られているパルサーの一つです。"},{"sentence":"Scientists use pulsars to study extreme states of matter and test theories of gravity.","translation":"科学者たちは、パルサーを使って極限状態の物質を研究し、重力理論を検証します。"}],"collocations":["radio pulsar","X-ray pulsar","millisecond pulsar","binary pulsar","Crab Pulsar","pulsar timing","pulsar emission","pulsar wind nebula"],"synonyms":["neutron star","rotating radio transient (RRAT)","magnetar"],"antonyms":[]}],"etymology":{"value":"Derived from 'pulsating star,' coined shortly after their discovery in 1967.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpʌlsɑːr/","syllables":"pul-sar"},"inflection":{"noun_plural":"pulsars"},"usage_notes":{"explanation":"Pulsars are extremely dense, rapidly rotating neutron stars that emit beams of electromagnetic radiation from their magnetic poles. These beams sweep through space, and when one of them crosses Earth's line of sight, we detect a pulse. The regularity of these pulses is incredibly precise, making pulsars useful as cosmic clocks. They are studied by astronomers to understand extreme physics and to test general relativity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Pulsars are black holes.","correct":"✓ Pulsars are neutron stars.","note":"Pulsars are often confused with black holes, but they are distinct objects. Pulsars are neutron stars, while black holes are regions of spacetime with such strong gravity that nothing, not even light, can escape. "},{"incorrect":"✗ Pulsars emit constant radiation.","correct":"✓ Pulsars emit pulsed radiation.","note":"Pulsars do not emit constant radiation; they emit beams of radiation that appear as pulses as the star rotates."}],"priority":"★★☆"},"related_words":{"derivatives":["pulsation","pulse","neutron star","magnetosphere","electromagnetic radiation"],"phrasal_verbs":[],"related_concepts":["astronomy","astrophysics","general relativity","neutron star","electromagnetism","radiation","magnetic field","stellar evolution","supernova"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Technical vocabulary for astronomy/astrophysics)","frequency_google_ngram":"Relatively low frequency, specific to scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A pulsar is a type of star called a neutron star that spins very quickly and sends out beams of energy like a lighthouse. These beams reach Earth as regular pulses, which is why they're called pulsars. They're important for studying space because they act like very accurate clocks and help scientists understand extreme conditions in the universe.","priority":"★★☆"},"example_sentences":[{"sentence":"The discovery of the first pulsar provided strong evidence for the existence of neutron stars.","translation":"最初のパルサーの発見は、中性子星の存在に対する強力な証拠を提供しました。","type":"noun","meaning_category":"astronomy"},{"sentence":"Millisecond pulsars are used to search for gravitational waves.","translation":"ミリ秒パルサーは、重力波を探索するために使用されます。","type":"noun","meaning_category":"astrophysics"},{"sentence":"Pulsars can be found in supernova remnants.","translation":"パルサーは超新星残骸の中に見つけることができます。","type":"noun","meaning_category":"astronomy"}]}