{"word":"Hyracoidian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"岩狸目の、ケープハイラックス亜目の","english_definition":"Relating to or belonging to the order Hyracoidea (hyraxes).","examples":[{"sentence":"The hyracoidian mammals are found in Africa and the Middle East.","translation":"岩狸目の哺乳類はアフリカと中東で見られる。"}],"collocations":[],"synonyms":["hyrax-like"],"antonyms":[]},{"part_of_speech":"noun","definition":"岩狸目の動物","english_definition":"An animal of the order Hyracoidea (hyraxes).","examples":[{"sentence":"The hyracoidian is a small, herbivorous mammal.","translation":"岩狸は小型の草食性哺乳類である。"}],"collocations":[],"synonyms":["hyrax"],"antonyms":[]}],"etymology":{"value":"From Hyracoidea (the taxonomic order) + -an. Hyracoidea is derived from Hyrax (the genus name) + -oidea (a suffix used in zoological nomenclature for orders). Hyrax comes from the Greek word \"ὕραξ\" (húrax) meaning shrew-mouse or a similar small animal.","priority":"★★★"},"pronunciation":{"ipa":"/ˌhaɪrəˈkɔɪdiən/","syllables":"hy-ra-coid-i-an"},"inflection":{"noun_plural":"Hyracoidians"},"usage_notes":{"explanation":"This term is primarily used in scientific or zoological contexts when discussing the order Hyracoidea, which includes hyraxes (also known as dassies or rock rabbits). It is not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Hyracoidea","Hyrax"],"related_terms":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Hyracoidian' is a technical term used in zoology to refer to animals or characteristics related to the order Hyracoidea, which includes hyraxes. Due to its specialized nature, it is not commonly encountered outside of scientific contexts. Understanding requires familiarity with biological classification systems and zoological terminology."},"example_sentences":[{"sentence":"The fossil record provides insights into the evolutionary history of hyracoidian species.","translation":"化石記録は岩狸目の種の進化の歴史への洞察を提供する。","type":"adjective","meaning_category":"岩狸目の"},{"sentence":"The hyracoidian's unique foot structure allows it to grip rocky surfaces effectively.","translation":"岩狸目の独特な足の構造は、岩の表面を効果的に掴むことを可能にする。","type":"noun","meaning_category":"岩狸目の動物"}]}