{"word":"collative","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(主に聖書学で)異読を比較検討する、異本を照合する","english_definition":"(chiefly biblical studies) relating to or involving the collation of different readings or versions of a text.","examples":[{"sentence":"The collative analysis of the manuscripts revealed several discrepancies.","translation":"写本の異本照合分析により、いくつかの食い違いが明らかになった。"},{"sentence":"This edition includes collative notes on the variant readings.","translation":"この版には、異読に関する照合注が含まれている。"}],"collocations":["collative text","collative notes","collative analysis","collative study"],"synonyms":["comparative","critical","analytical"],"antonyms":[]}],"etymology":{"value":"Derived from 'collate,' which comes from the Latin 'collatio,' meaning 'a bringing together, comparison,' from 'con-' (together) + 'latio' (a bringing, carrying).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒlətɪv/","syllables":"col-la-tive"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more collative' and 'most collative,' respectively, although these are rarely used."},"usage_notes":{"explanation":"\"Collative\" is primarily used in academic contexts, particularly within biblical studies and textual criticism, to describe the process or result of comparing different versions of a text to identify variations and determine the most accurate or original reading. It is less common in general usage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The collative properties of the material were tested.","correct":"✓ The material's properties were tested.","note":"Avoid using 'collative' when you mean general properties or characteristics. 'Collative' specifically refers to comparing different versions of something."}],"priority":"★☆☆"},"related_words":{"derivatives":["collate (verb): to compare carefully in order to note points of disagreement or agreement","collation (noun): the action of collating something"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Collative\" is a specialized term primarily encountered in academic fields such as textual criticism and biblical studies. It describes the process of comparing different versions of a text to identify variations. Due to its limited and technical usage, it is not commonly found in general English discourse."},"example_sentences":[{"sentence":"The scholar presented a detailed collative report on the Dead Sea Scrolls.","translation":"学者は死海文書に関する詳細な異本照合報告書を発表した。","type":"adjective","meaning_category":"異読を比較検討する"},{"sentence":"A collative edition of Shakespeare's plays is essential for understanding the evolution of the text.","translation":"シェイクスピア劇の異本照合版は、テキストの変遷を理解するために不可欠である。","type":"adjective","meaning_category":"異本を照合する"}]}