{"word":"tank-aged","meanings":[{"part_of_speech":"adjective","definition":"タンク熟成された、タンクで熟成された","english_definition":"(of wine, beer, etc.) matured or aged in a tank, typically a stainless steel tank.","examples":[{"sentence":"This Chardonnay is tank-aged to preserve its fresh fruit flavors.","translation":"このシャルドネは、フレッシュなフルーツの風味を保つためにタンク熟成されています。"},{"sentence":"The brewery uses tank-aged beer for its flagship lager.","translation":"その醸造所は、主力ラガーにタンク熟成ビールを使用しています。"}],"collocations":["tank-aged wine","tank-aged beer","stainless steel tank-aged"],"synonyms":["fermented in tanks","aged in stainless steel"],"antonyms":["barrel-aged","oak-aged"]},{"part_of_speech":"adjective","definition":"(比喩的に)洗練されていない、未熟な、粗削りな","english_definition":"(figuratively) unrefined, immature, or rough around the edges, suggesting a lack of complexity or sophistication.","examples":[{"sentence":"His ideas are still tank-aged and need more development.","translation":"彼のアイデアはまだ粗削りで、もっと発展させる必要があります。"},{"sentence":"The project is in its tank-aged phase, requiring further refinement.","translation":"プロジェクトはまだ初期段階で、さらなる洗練が必要です。"}],"collocations":["tank-aged ideas","tank-aged project","tank-aged concept"],"synonyms":["unrefined","immature","undeveloped","rough","raw"],"antonyms":["refined","mature","developed","sophisticated"]}],"etymology":{"value":"The term combines 'tank' (referring to a large container, typically stainless steel, used for storage and fermentation) with 'aged' (having been kept for a period to develop flavor). The figurative sense extends from the literal process of aging in a tank, suggesting something not yet fully developed or refined, similar to how a beverage might need barrel aging for complexity.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtæŋkˌeɪdʒd/","syllables":"tank-aged"},"inflection":{"notes":"This is an adjective and does not have typical inflectional forms (e.g., comparative or superlative)."},"usage_notes":{"explanation":"The term 'tank-aged' is primarily used in the context of beverages like wine and beer, indicating that the aging process occurred in a tank, often stainless steel. This method is typically used to preserve fresh, fruity flavors and avoid the oaky notes imparted by barrel aging. Figuratively, 'tank-aged' can describe something that is still in a preliminary stage of development or lacks refinement.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The tank-aged is very good.","correct":"✓ The tank-aged wine is very good.","note":"'Tank-aged' is an adjective and needs to be followed by a noun (e.g., wine, beer, ideas)."},{"incorrect":"✗ He tank-aged the wine.","correct":"✓ He tank-aged the wine in stainless steel tanks. / ✓ The wine was tank-aged.","note":"'Tank-aged' is not typically used as a verb. Instead, use a phrase like 'tank-aged in stainless steel tanks' or use it passively ('was tank-aged')."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["barrel-aged","oak-aged","stainless steel fermentation","wine aging","beer aging"]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency (specialized term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'tank-aged' is a specialized term primarily used in the context of winemaking and brewing. It describes the process where wine or beer is aged in a tank, usually made of stainless steel, rather than in traditional oak barrels. This method is often employed to preserve the fresh, fruity characteristics of the beverage. Figuratively, it can describe something that is still in an early stage of development and lacks refinement, similar to how a beverage might need further aging to reach its full potential."},"example_sentences":[{"sentence":"The winery's tank-aged Sauvignon Blanc is known for its crisp acidity and vibrant citrus notes.","translation":"そのワイナリーのタンク熟成されたソーヴィニヨン・ブランは、キレのある酸味と鮮やかな柑橘系の香りで知られています。","type":"adjective","meaning_category":"タンク熟成された"},{"sentence":"His tank-aged ideas about urban planning need more practical consideration before they can be implemented.","translation":"彼の都市計画に関する粗削りなアイデアは、実施される前に、より現実的な検討が必要です。","type":"adjective","meaning_category":"洗練されていない"}]}