{"word":"co-signatory","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"共同署名人、連署者","english_definition":"A person who signs a document jointly with another or others.","examples":[{"sentence":"He was a co-signatory to the treaty.","translation":"彼はその条約の共同署名人だった。"},{"sentence":"All board members are co-signatories on the bank account.","translation":"すべての理事は銀行口座の共同署名人です。"}],"collocations":["act as co-signatory","become a co-signatory","multiple co-signatories"],"synonyms":["joint signatory","endorser","backer"],"antonyms":[]}],"etymology":{"value":"The word \"co-signatory\" is formed by combining the prefix \"co-\" (meaning \"jointly\" or \"together\") with the word \"signatory\" (meaning \"one who signs\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkoʊˈsɪɡnətɔːri/","syllables":"co-sig-na-to-ry"},"inflection":{"noun_plural":"co-signatories"},"usage_notes":{"explanation":"A \"co-signatory\" is someone who signs a document along with one or more other people. This often implies a shared responsibility or agreement to the terms of the document. It is commonly used in legal, financial, and official contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a co-signature on the loan.","correct":"✓ He is a co-signatory on the loan.","note":"The correct term for someone who signs jointly is \"co-signatory,\" not \"co-signature.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["co-sign (verb): to sign a document jointly with another person.","signatory (noun): a party that has signed an agreement, treaty, or other document."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"co-signatory\" refers to an individual who jointly signs a document with one or more others, signifying shared responsibility or agreement. This term is typically encountered in formal contexts, such as legal agreements, financial documents, or official treaties. Understanding its meaning is essential for interpreting complex documents and comprehending the roles and responsibilities of the parties involved."},"example_sentences":[{"sentence":"The bank required a co-signatory for the loan application.","translation":"銀行は融資申請に共同署名人を要求した。","type":"noun","meaning_category":"Joint signer"},{"sentence":"As a co-signatory, he is equally responsible for the debt.","translation":"共同署名人として、彼はその債務に対して同等の責任を負う。","type":"noun","meaning_category":"Shared responsibility"}]}