{"word":"humanized","priority":"★★☆","meanings":[{"part_of_speech":"verb (past participle)","definition":"人間らしくされた、人間味を与えられた","english_definition":"Having been made more humane or relatable; given human qualities or characteristics.","examples":[{"sentence":"The robot was humanized through its interactions with children.","translation":"そのロボットは子供たちとの交流を通して人間味を与えられた。"},{"sentence":"The software interface was humanized to be more user-friendly.","translation":"そのソフトウェアのインターフェースは、よりユーザーフレンドリーになるように人間味を与えられた。"},{"sentence":"The data was humanized with stories and anecdotes.","translation":"そのデータは物語や逸話によって人間味を与えられた。"}],"collocations":["humanized robot","humanized interface","humanized data","humanized approach","humanized care"],"synonyms":["anthropomorphized","personalized","made relatable","given empathy","made user-friendly"],"antonyms":["dehumanized","impersonal","alienated","objectified"]},{"part_of_speech":"adjective","definition":"人間らしくされた、人間味を与えられた","english_definition":"Having been made more humane or relatable; given human qualities or characteristics.","examples":[{"sentence":"The humanized version of the story was much more engaging.","translation":"人間味を与えられたバージョンの物語は、はるかに魅力的だった。"},{"sentence":"They sought a more humanized approach to customer service.","translation":"彼らは、より人間味のある顧客サービスのアプローチを求めた。"},{"sentence":"The humanized design made the product easier to use.","translation":"人間味を与えられたデザインは、製品をより使いやすくした。"}],"collocations":["humanized story","humanized approach","humanized design","humanized care","humanized medicine"],"synonyms":["anthropomorphic","personalized","relatable","empathetic","user-friendly"],"antonyms":["dehumanized","impersonal","alienating","cold","unfriendly"]}],"etymology":{"value":"The word \"humanized\" comes from the verb \"humanize,\" which is derived from the adjective \"human.\" The suffix \"-ize\" means \"to make or become.\" Therefore, \"humanize\" means \"to make human\" or \"to give human qualities to something.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhjuːmənaɪzd/","syllables":"hu-man-ized"},"inflection":{"notes":"This word is the past participle and adjective form of the verb \"humanize.\""},"usage_notes":{"explanation":"\"Humanized\" generally refers to the process of making something more relatable, understandable, or empathetic by giving it human qualities or characteristics. It is often used in the context of technology, data, or abstract concepts to make them more accessible and engaging. It can also refer to making something more humane, ethical, or compassionate.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The robot was humanized, so it was a human.","correct":"The robot was humanized, so it acted more like a human.","note":"\"Humanized\" does not mean that something becomes a human, but rather that it is given human qualities or characteristics."},{"incorrect":"The data was humanized, so it was alive.","correct":"The data was humanized, so it was more relatable.","note":"\"Humanized\" does not mean that something becomes alive, but rather that it is made more understandable or relatable."}],"priority":"★★☆"},"related_words":{"derivatives":["humanize (verb)","humanization (noun)","human (adjective, noun)","humane (adjective)","humanely (adverb)","humanism (noun)","humanist (noun, adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but used in specific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"humanized\" means to make something more human-like or relatable. It's often used to describe how technology or data can be presented in a way that is easier for people to understand and connect with. For example, a robot might be \"humanized\" by giving it the ability to express emotions, or data might be \"humanized\" by presenting it in the form of a story. The word implies that something has been made more approachable, empathetic, or user-friendly by adding human qualities to it."},"example_sentences":[{"sentence":"The company humanized its brand by sharing employee stories on social media.","translation":"その会社は、ソーシャルメディアで従業員のストーリーを共有することで、ブランドに人間味を与えた。","type":"verb (past participle)","meaning_category":"人間味を与えられた"},{"sentence":"The humanized AI assistant was designed to be more empathetic and understanding.","translation":"人間味を与えられたAIアシスタントは、より共感的で理解力があるように設計された。","type":"adjective","meaning_category":"人間味を与えられた"},{"sentence":"The professor humanized the complex theory by relating it to everyday experiences.","translation":"教授は、複雑な理論を日常の経験に関連付けることで、人間味を与えた。","type":"verb (past participle)","meaning_category":"人間味を与えられた"},{"sentence":"The humanized data visualization helped stakeholders understand the key insights.","translation":"人間味を与えられたデータの可視化は、関係者が重要な洞察を理解するのに役立った。","type":"adjective","meaning_category":"人間味を与えられた"}]}