{"word":"vassality","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"臣従、封臣の地位、封臣としての義務","english_definition":"The condition of being a vassal; the obligations of a vassal to a lord; feudal allegiance.","examples":[{"sentence":"The knight swore an oath of vassality to the king.","translation":"騎士は王に臣従の誓いを立てた。"},{"sentence":"Vassality was a key component of the feudal system.","translation":"臣従関係は封建制度の重要な要素であった。"},{"sentence":"The peasants were bound by vassality to the lord of the manor.","translation":"農民は荘園領主への臣従関係に縛られていた。"}],"collocations":["oath of vassality (臣従の誓い)","feudal vassality (封建的臣従)","condition of vassality (臣従の状況)"],"synonyms":["fealty","subjection","servitude","allegiance","homage"],"antonyms":["sovereignty","independence","autonomy"]}],"etymology":{"value":"Derived from the word 'vassal,' which comes from Medieval Latin 'vassallus,' meaning a servant or dependent. The suffix '-ity' transforms it into a noun denoting the state or condition of being a vassal.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvæsəlti/","syllables":"vas-sal-i-ty"},"inflection":{"noun_plural":"vassalities (rare)"},"usage_notes":{"explanation":"'Vassality' refers specifically to the feudal relationship between a lord and his vassal, where the vassal owes service and loyalty to the lord in exchange for protection and land. It is a historical term primarily used in the context of feudalism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The country was in a state of vassality after the war, but they quickly regained their independence.","correct":"✓ The country was in a state of subjugation after the war, but they quickly regained their independence.","note":"'Vassality' refers to a specific feudal relationship. For general subjugation, use 'subjugation' or 'dependence'."}],"priority":"★☆☆"},"related_words":{"derivatives":["vassal (noun: 封臣)","vassalage (noun: 封臣の地位、封臣制度)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Vassality' is a formal and relatively rare term that describes the state of being a vassal in a feudal system. It involves the obligations and duties that a vassal owes to their lord, such as military service and loyalty, in exchange for protection and land. This word is typically encountered in historical or academic contexts when discussing feudalism.","priority":"★☆☆"},"example_sentences":[{"sentence":"The system of vassality ensured the lord's military strength.","translation":"臣従制度は領主の軍事力を保証した。","type":"general","meaning_category":"feudal allegiance"},{"sentence":"His vassality required him to fight alongside his lord in battle.","translation":"彼の臣従義務は、戦闘で領主と共に戦うことを要求した。","type":"general","meaning_category":"obligations of a vassal"},{"sentence":"The decline of feudalism led to the gradual disappearance of vassality.","translation":"封建制度の衰退は、臣従関係の徐々の消滅につながった。","type":"historical","meaning_category":"condition of being a vassal"}]}