{"word":"immotioned","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"感動しない、感情を表に出さない、冷静な","english_definition":"Not moved by emotion; unemotional; impassive; calm.","examples":[{"sentence":"He remained immotioned throughout the trial, showing no sign of sympathy or remorse.","translation":"彼は裁判の間中、感動することなく、同情や後悔の兆候を全く見せなかった。"},{"sentence":"Despite the tragic news, she remained immotioned, her face a mask of composure.","translation":"悲劇的な知らせにもかかわらず、彼女は感情を表に出さず、顔は平静を装っていた。"}],"collocations":["remain immotioned","appear immotioned","seem immotioned"],"synonyms":["unemotional","impassive","stoic","calm","composed","expressionless","unmoved","detached"],"antonyms":["emotional","moved","passionate","excitable","sensitive"]}],"etymology":{"value":"Formed from the prefix 'im-' (not) and 'motioned' (moved by emotion).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈmoʊʃənd/","syllables":"im-mo-tioned"},"inflection":{"notes":"Adjectives do not typically inflect, but can form comparative and superlative forms."},"usage_notes":{"explanation":"'Immotioned' describes a state of being free from or unaffected by emotion. It suggests a deliberate or natural lack of emotional response, often in situations where emotion might be expected. It can imply a sense of detachment, composure, or even coldness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was immotioned by the beautiful music.","correct":"✓ He was unmoved by the beautiful music.","note":"'Immotioned' implies a general lack of emotional response, not a failure to be moved by something specific. 'Unmoved' is more appropriate in this context."},{"incorrect":"✗ The immotioned actor gave a terrible performance.","correct":"✓ The unemotional actor gave a terrible performance.","note":"While 'immotioned' and 'unemotional' are synonyms, 'unemotional' is more commonly used and understood."}],"priority":"★★☆"},"related_words":{"derivatives":["immotionally (adverb)","immotionedness (noun)"],"related_terms":["unemotional","impassive","stoic","apathetic"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Rare; more common alternatives exist)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Immotioned' is a relatively rare and formal word that describes someone who is not showing or feeling any emotion. It is similar to 'unemotional' or 'impassive,' but it is less commonly used. You might encounter this word in literature or formal writing, but it is not typically used in everyday conversation. It suggests a deliberate or natural lack of emotional response, often in situations where emotion might be expected.","priority":"★★☆"},"example_sentences":[{"sentence":"The defendant remained immotioned as the verdict was read.","translation":"被告は判決が読み上げられる間、感情を表に出さなかった。","type":"adjective","meaning_category":"感情を表に出さない"},{"sentence":"Her face was immotioned, betraying no hint of her inner thoughts.","translation":"彼女の顔は無表情で、内面の考えを全く表に出していなかった。","type":"adjective","meaning_category":"感情を表に出さない"},{"sentence":"He delivered the bad news in an immotioned tone, as if reciting a grocery list.","translation":"彼はまるで買い物リストを読み上げるかのように、感情のない口調で悪い知らせを伝えた。","type":"adjective","meaning_category":"感情を表に出さない"}]}