{"word":"flowage","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律) 土地の浸水に対する権利、または浸水した土地","english_definition":"(law) the right to flood land; land that has been flooded.","examples":[{"sentence":"The power company acquired flowage rights along the river.","translation":"電力会社は川沿いの土地の浸水に対する権利を取得した。"},{"sentence":"The dam created a large flowage area.","translation":"ダムは広大な浸水地域を作り出した。"}],"collocations":["flowage rights","flowage easement","flowage area","flowage land"],"synonyms":["flooding","inundation","submergence"],"antonyms":["dry land"]},{"part_of_speech":"noun","definition":"液体の流れ、流出量","english_definition":"the act or process of flowing; the amount that flows.","examples":[{"sentence":"The flowage of the lava was slow but steady.","translation":"溶岩の流れは遅かったが、着実だった。"},{"sentence":"The flowage of water through the pipe was restricted.","translation":"パイプを通る水の流れは制限されていた。"}],"collocations":["lava flowage","water flowage","oil flowage"],"synonyms":["flow","outflow","discharge","effusion"],"antonyms":["stagnation"]}],"etymology":{"value":"\"Flow\" + \"-age\".","priority":"★★★"},"pronunciation":{"ipa":"/ˈfloʊɪdʒ/","syllables":"flow-age"},"inflection":{"noun_plural":"flowages"},"usage_notes":{"explanation":"\"Flowage\" is a relatively uncommon word, primarily used in legal or technical contexts. It refers to the right to flood land or the area of land that is flooded, often in relation to dams or other water management projects. It can also refer to the act or amount of liquid flowing, but this usage is less common than simply \"flow\".","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The flowage of people into the stadium was enormous.","correct":"✓ The flow of people into the stadium was enormous.","note":"For the movement of people, use \"flow\" instead of \"flowage\"."},{"incorrect":"✗ The flowage of the river is very clean.","correct":"✓ The water in the river is very clean.","note":"\"Flowage\" refers to the process or right of flooding, not the water itself."}],"priority":"★★☆"},"related_words":{"derivatives":["flow (verb, noun)","flowing (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Flowage\" is a technical term that is not commonly used in everyday conversation. It is most often encountered in legal documents or engineering reports related to water management and land use. Understanding the term requires familiarity with concepts related to property rights, water resources, and environmental regulations.","priority":"★★☆"},"example_sentences":[{"sentence":"The company had to purchase flowage easements from the landowners.","translation":"会社は地主から浸水地役権を購入しなければならなかった。","type":"noun","meaning_category":"(法律) 土地の浸水に対する権利"},{"sentence":"The flowage from the heavy rains caused significant damage.","translation":"大雨による流出が深刻な被害をもたらした。","type":"noun","meaning_category":"液体の流れ"}]}