{"word":"rheum","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(医学) 粘液、特に鼻や目から出る薄い液体","english_definition":"A thin discharge of mucus from the nose or eyes, especially during or after a cold.","examples":[{"sentence":"The child's eyes were crusted with rheum.","translation":"その子供の目は目やにで固まっていた。"},{"sentence":"She wiped the rheum from her nose with a tissue.","translation":"彼女はティッシュで鼻水を拭いた。"}],"collocations":["eye rheum","nasal rheum"],"synonyms":["mucus","discharge","phlegm","snot","eye boogers"],"antonyms":[]}],"etymology":{"value":"Middle English: from Old French reume, from late Latin rheuma, from Greek rheuma ‘flux’ (from rhein ‘to flow’).","priority":"★★☆"},"pronunciation":{"ipa":"/ruːm/","syllables":"1"},"inflection":{"noun_plural":"rheums"},"usage_notes":{"explanation":"'Rheum' is a somewhat old-fashioned or medical term for the watery discharge that can come from the nose or eyes, especially when someone has a cold or allergy. It's not a very common word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"I have a lot of rheum in my stomach.","correct":"I have a lot of mucus in my stomach.","note":"'Rheum' specifically refers to discharge from the nose or eyes, not the stomach."}],"priority":"★☆☆"},"related_words":{"derivatives":["rheumy (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Rheum' is a specialized term, primarily used in medical contexts or older literature to describe a watery discharge from the nose or eyes. Due to its limited usage and specific meaning, it is considered an advanced vocabulary word. It is more common to use terms like 'mucus' or 'discharge' in everyday conversation."},"example_sentences":[{"sentence":"The doctor examined the patient's eyes, noting the presence of rheum.","translation":"医者は患者の目を診察し、目やにの存在に気づいた。","type":"noun","meaning_category":"medical"},{"sentence":"In the old days, they attributed many illnesses to an excess of rheum in the body.","translation":"昔は、多くの病気が体内の過剰な粘液のせいだと考えられていた。","type":"noun","meaning_category":"historical"}]}