{"word":"self-sacrificer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"自己犠牲者、自己犠牲的な人","english_definition":"a person who sacrifices their own interests, desires, or well-being for the sake of others.","examples":[{"sentence":"She was a true self-sacrificer, always putting her family's needs before her own.","translation":"彼女は真の自己犠牲者で、常に自分の家族のニーズを自分のものよりも優先していた。"},{"sentence":"He was seen as a self-sacrificer for his willingness to risk his life to save others.","translation":"彼は他人を救うために自分の命を危険にさらすことを厭わなかったので、自己犠牲者と見なされた。"},{"sentence":"The organization relies on self-sacrificers who are willing to work long hours for little pay.","translation":"その組織は、わずかな給料で長時間働くことを厭わない自己犠牲者に頼っている。"}],"collocations":["true self-sacrificer","willing self-sacrificer","ultimate self-sacrificer"],"synonyms":["altruist","martyr","philanthropist","humanitarian"],"antonyms":["egoist","selfish person","narcissist"]}],"etymology":{"value":"The word is formed by combining \"self-\" (referring to oneself) with \"sacrificer\" (one who sacrifices).","priority":"★★★"},"pronunciation":{"ipa":"/ˌselfˈsækrɪfaɪsər/","syllables":"self-sac-ri-fic-er"},"inflection":{"noun_plural":"self-sacrificers"},"usage_notes":{"explanation":"The term \"self-sacrificer\" typically describes someone who consistently and willingly prioritizes the well-being of others over their own. It can be used in a positive light to praise someone's altruism, but it can also carry a negative connotation if the self-sacrifice is seen as excessive or detrimental to the person's own health and happiness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a very self-sacrifice.","correct":"✓ He is a very self-sacrificing person. / ✓ He is a self-sacrificer.","note":"\"Self-sacrifice\" is a noun, while \"self-sacrificing\" is an adjective. To describe someone, use \"self-sacrificing person\" or the noun \"self-sacrificer.\""}],"priority":"★★☆"},"related_words":{"derivatives":["self-sacrifice (noun)","self-sacrificing (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'self-sacrificer' refers to someone who consistently puts the needs of others before their own, often at a personal cost. It's a relatively uncommon word, but the concept it represents is widely understood. The word is composed of 'self,' indicating the individual, and 'sacrificer,' indicating someone who makes sacrifices. It's important to note that while self-sacrifice can be seen as a virtue, it can also be problematic if it leads to the individual neglecting their own well-being."},"example_sentences":[{"sentence":"The firefighter was hailed as a self-sacrificer after running into the burning building to save the family.","translation":"その消防士は、家族を救うために燃えている建物に駆け込んだ後、自己犠牲者として称えられた。","type":"noun","meaning_category":"altruistic person"},{"sentence":"She was a quiet self-sacrificer, always volunteering her time and resources to help those in need.","translation":"彼女は静かな自己犠牲者で、常に自分の時間と資源を必要としている人々のために進んで提供していた。","type":"noun","meaning_category":"altruistic person"},{"sentence":"History remembers him as a self-sacrificer who gave his life for his country.","translation":"歴史は彼を、国のために命を捧げた自己犠牲者として記憶している。","type":"noun","meaning_category":"altruistic person"}]}