{"word":"Danainae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"マダラチョウ亜科","english_definition":"The milkweed butterflies, a subfamily of nymphalid butterflies, consisting of about 300 species in 12 genera.","examples":[{"sentence":"The Danainae are known for their bright colors and toxic properties.","translation":"マダラチョウ亜科は、その鮮やかな色彩と有毒性で知られています。"}],"collocations":[],"synonyms":["milkweed butterflies"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name *Danaus*, which was named after Danaus, a mythical king of Libya. The suffix '-inae' is a standard zoological suffix denoting a subfamily.","priority":"★★☆"},"pronunciation":{"ipa":"/dəˈneɪɪnaɪ/","syllables":"Da-nai-i-nae"},"inflection":{"noun_plural":"Danainae (same as singular)"},"usage_notes":{"explanation":"In scientific classification, 'Danainae' refers specifically to the subfamily of butterflies that includes the monarch butterfly and its relatives. This term is primarily used in biological and entomological contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Danaidae is a synonym of Danainae.","correct":"✓ Danainae is a subfamily of Nymphalidae.","note":"Danainae is a subfamily, not a family. Danaidae is an older, less precise term."}],"priority":"★☆☆"},"related_words":{"derivatives":["Danaus (genus)","Nymphalidae (family)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Danainae' is a scientific term used in biology, specifically entomology, to refer to a subfamily of butterflies known as milkweed butterflies. This term is not commonly used in everyday language and is primarily found in scientific publications and discussions related to butterfly classification and biology. Understanding this term requires a background in biological taxonomy."},"example_sentences":[{"sentence":"The migration patterns of Danainae butterflies are a subject of ongoing research.","translation":"マダラチョウ亜科の蝶の移動パターンは、現在も研究の対象となっています。","type":"noun","meaning_category":"マダラチョウ亜科"},{"sentence":"Many species within the Danainae subfamily exhibit aposematism.","translation":"マダラチョウ亜科の多くの種は、警戒色を示します。","type":"noun","meaning_category":"マダラチョウ亜科"}]}