{"word":"Post-Cartesian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"デカルト以後の、デカルト哲学の後に現れた","english_definition":"Relating to the period after René Descartes or to philosophical movements that developed in response to or after Cartesianism.","examples":[{"sentence":"Post-Cartesian philosophy has grappled with the mind-body problem in various ways.","translation":"デカルト以後の哲学は、心身問題をさまざまな方法で取り組んできた。"},{"sentence":"The post-Cartesian era saw a shift in focus from metaphysics to epistemology.","translation":"デカルト以後の時代には、形而上学から認識論への焦点の移行が見られた。"}],"collocations":["Post-Cartesian thought","Post-Cartesian philosophy","Post-Cartesian dualism"],"synonyms":["After Descartes","Following Cartesianism"],"antonyms":["Pre-Cartesian"]},{"part_of_speech":"noun","definition":"デカルト以後の思想、デカルト哲学の後に現れた思想","english_definition":"Philosophical thought developed after or in response to Cartesianism.","examples":[{"sentence":"Post-Cartesianism often critiques Descartes' dualistic view of mind and body.","translation":"デカルト以後の思想は、しばしばデカルトの心身二元論を批判する。"}],"collocations":["Critiques of Post-Cartesianism","Developments in Post-Cartesianism"],"synonyms":["Later philosophical movements"],"antonyms":["Cartesianism"]}],"etymology":{"value":"Derived from \"post-\" (after) and \"Cartesian\" (relating to René Descartes or his philosophy).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpoʊst kɑrˈtiʒən/","syllables":"post-car-ti-an"},"inflection":{"notes":"Adjective and noun forms exist. The adjective does not inflect for number or gender. The noun can be pluralized (Post-Cartesians)."},"usage_notes":{"explanation":"\"Post-Cartesian\" refers to ideas, philosophies, or periods that came after or were influenced by the work of René Descartes. It often implies a departure from or critique of Cartesian principles, such as mind-body dualism.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Post-Cartesian is a type of math.","correct":"✓ Post-Cartesian is a term used in philosophy.","note":"Post-Cartesian relates to philosophy, not mathematics, although Descartes made significant contributions to both fields."}],"priority":"★★☆"},"related_words":{"derivatives":["Cartesian","Cartesianism","Neo-Cartesianism"],"phrases":["Mind-body problem","Dualism","Rationalism","Empiricism"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"Post-Cartesian\" is primarily used in philosophical contexts to describe ideas and movements that followed the work of René Descartes. Understanding requires familiarity with Descartes' key concepts, such as mind-body dualism and rationalism. The term is not commonly used outside of academic philosophy. "},"example_sentences":[{"sentence":"The rise of empiricism was a key feature of **Post-Cartesian** intellectual history.","translation":"経験論の台頭は、デカルト以後の知的歴史の重要な特徴だった。","type":"adjective","meaning_category":"Relating to the period after Descartes"},{"sentence":"**Post-Cartesian** thought sought to reconcile the gap between the mental and physical realms.","translation":"デカルト以後の思想は、精神と物理的な領域の間のギャップを埋めようとした。","type":"noun","meaning_category":"Philosophical thought after Descartes"}]}