{"word":"feminist-adjacent","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"フェミニズムに関連する、またはフェミニズムに近いが、厳密にはフェミニストではない立場や人物を指す言葉。","english_definition":"Relating to or resembling feminism, but not strictly feminist; describing positions or individuals that are sympathetic to feminist ideals without fully identifying as feminist.","examples":[{"sentence":"The author's work explores themes that are feminist-adjacent, focusing on gender roles and equality.","translation":"その作家の作品は、ジェンダーの役割と平等に焦点を当て、フェミニズムに近いテーマを探求しています。"},{"sentence":"He holds feminist-adjacent views, supporting women's rights but not necessarily subscribing to all feminist theories.","translation":"彼は女性の権利を支持していますが、必ずしもすべてのフェミニスト理論を支持しているわけではなく、フェミニズムに近い見解を持っています。"},{"sentence":"The policy change was described as feminist-adjacent, as it aimed to improve conditions for women in the workplace without explicitly addressing systemic inequality.","translation":"その政策変更は、職場における女性の状況を改善することを目的としていたため、体系的な不平等に明示的に対処することなく、フェミニズムに近いものとして説明されました。"}],"collocations":["feminist-adjacent ideas","feminist-adjacent policies","feminist-adjacent arguments","feminist-adjacent perspectives","feminist-adjacent themes"],"synonyms":["feminism-related","feminist-leaning","pro-feminist","sympathetic to feminism"],"antonyms":["anti-feminist","misogynistic","sexist"]}],"etymology":{"value":"「feminist」（フェミニスト）に、位置関係を表す接尾辞「-adjacent」（隣接する、近い）を組み合わせた造語。フェミニズムの周辺にある概念や立場を示すために用いられる。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɛmənɪst əˈdʒeɪsənt/","syllables":"fem-i-nist a-ja-cent"},"inflection":{"notes":"形容詞なので、名詞の複数形のような変化はありません。比較級・最上級は、more/most を用いて表現します（例：more feminist-adjacent）。"},"usage_notes":{"explanation":"「**feminist-adjacent**」は、フェミニズムの原則や目標に共感・支持するものの、自身を厳密な意味でのフェミニストとは認識していない人や、フェミニズムの枠組みに完全に収まらない考え方や行動を指す際に使われます。フェミニズムの定義や範囲が広いため、この用語は、より包括的でニュアンスのある議論を可能にします。ただし、この用語の使用は、フェミニズムの核心的な価値観を薄める可能性があるという批判もあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a feminist-adjacent.","correct":"✓ She holds feminist-adjacent views.","note":"「feminist-adjacent」は形容詞なので、名詞として使う場合は、修飾する名詞（views, ideas, policiesなど）を伴う必要があります。"},{"incorrect":"✗ He is adjacent to feminism.","correct":"✓ He holds feminist-adjacent views.","note":"「adjacent to feminism」という表現も文法的には正しいですが、より自然な言い方は「feminist-adjacent views」のように、形容詞として使うことです。"}],"priority":"★★☆"},"related_words":{"derivatives":["feminism","feminist","pro-feminist","post-feminist"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 比較的新しい用語で、専門的な文脈で使われることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**feminist-adjacent**」は、フェミニズムの考え方に近いけれど、完全にフェミニストとは言えない立場や考え方を表す言葉です。例えば、女性の権利を支持するけれど、フェミニズムのすべての理論に同意するわけではない人や、ジェンダー平等を促進する政策だけれど、フェミニズムという言葉をあえて使わない場合などに使われます。この言葉を使うことで、フェミニズムとの関係性をより細かく表現できます。"},"example_sentences":[{"sentence":"The movie explores themes of female empowerment in a way that feels feminist-adjacent.","translation":"その映画は、フェミニズムに近い形で女性のエンパワーメントのテーマを探求しています。","type":"adjective","meaning_category":"関連する"},{"sentence":"Her political stance is best described as feminist-adjacent, as she advocates for gender equality but avoids the feminist label.","translation":"彼女の政治的立場は、ジェンダー平等を提唱するものの、フェミニストというレッテルを避けているため、フェミニズムに近いと表現するのが最も適切です。","type":"adjective","meaning_category":"近い"},{"sentence":"The company's new policies are feminist-adjacent, aiming to support working mothers without explicitly addressing broader gender issues.","translation":"その会社の新しいポリシーは、より広範なジェンダー問題に明示的に取り組むことなく、働く母親を支援することを目的としているため、フェミニズムに近いものです。","type":"adjective","meaning_category":"近い"}]}