{"word":"hormone-dependent","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"ホルモン依存性の、ホルモンの影響を受ける","english_definition":"Requiring a specific hormone for growth or function; influenced by hormones.","examples":[{"sentence":"Some cancers are hormone-dependent, meaning their growth is stimulated by hormones like estrogen or testosterone.","translation":"一部のがんはホルモン依存性であり、エストロゲンやテストステロンなどのホルモンによって成長が促進されることを意味します。"},{"sentence":"The hormone-dependent tissues of the reproductive system respond to hormonal fluctuations.","translation":"生殖系のホルモン依存性組織は、ホルモンの変動に反応します。"},{"sentence":"This type of tumor is hormone-dependent and may respond to hormone therapy.","translation":"このタイプの腫瘍はホルモン依存性であり、ホルモン療法に反応する可能性があります。"}],"collocations":["hormone-dependent cancer","hormone-dependent tumor","hormone-dependent tissue","hormone-dependent growth","hormone-dependent cell"],"synonyms":["hormone-sensitive","hormonally responsive","endocrine-dependent"],"antonyms":["hormone-independent","hormone-insensitive","hormonally unresponsive"]}],"etymology":{"value":"Formed from 'hormone' + 'dependent'. Indicates a reliance on hormones for a particular process or condition.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɔːrmoʊn dɪˈpɛndənt/","syllables":"hor-mone-de-pen-dent"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Hormone-dependent' is commonly used in medical contexts, particularly in oncology (cancer treatment) and endocrinology (hormone-related disorders). It describes conditions or tissues that require specific hormones to function or grow. Understanding hormone dependency is crucial for developing targeted therapies.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The cell is depend on hormone.","correct":"✓ The cell is hormone-dependent. / ✓ The cell depends on hormones.","note":"'Hormone-dependent' is an adjective describing the cell. To use 'depend' as a verb, the sentence structure must change."},{"incorrect":"✗ Hormone dependence.","correct":"✓ Hormone dependency.","note":"While 'dependence' and 'dependency' are often interchangeable, 'hormone dependency' is more commonly used in a medical context."}],"priority":"★★☆"},"related_words":{"derivatives":["hormone","dependent","dependency","hormonally"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hormone-dependent' is a technical term primarily used in medical and scientific contexts. It means that something, such as a cell or a tumor, needs hormones to grow or function properly. This term is often used when discussing cancer treatments or hormonal disorders. It's important to understand this term if you are reading scientific or medical texts.","priority":"★★☆"},"example_sentences":[{"sentence":"Breast cancer can be hormone-dependent, meaning its growth is fueled by estrogen.","translation":"乳がんはホルモン依存性である可能性があり、その成長はエストロゲンによって促進されます。","type":"adjective","meaning_category":"Medical"},{"sentence":"The prostate gland is a hormone-dependent organ.","translation":"前立腺はホルモン依存性の臓器です。","type":"adjective","meaning_category":"Anatomy"},{"sentence":"Hormone-dependent cancers may be treated with hormone therapy to block the effects of hormones.","translation":"ホルモン依存性のがんは、ホルモンの影響を遮断するためにホルモン療法で治療されることがあります。","type":"adjective","meaning_category":"Treatment"}]}