{"word":"fussbudgety","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(informal) overly concerned with details, especially in a trivial or annoying way; fussy.","english_definition":"excessively concerned with minor details or rules, especially in a way that annoys other people.","examples":[{"sentence":"He's become so fussbudgety in his old age, constantly complaining about minor inconveniences.","translation":"彼は年を取ってから細かくなりすぎて、些細な不便さについていつも文句を言っている。"},{"sentence":"The new manager is a bit fussbudgety, insisting on everything being done exactly according to the manual.","translation":"新しいマネージャーは少し細かすぎる。マニュアル通りにすべてを正確に行うように主張している。"}],"collocations":["fussbudgety behavior","fussbudgety tendencies","a fussbudgety person","fussbudgety about details"],"synonyms":["fussy","finicky","nitpicky","particular","fastidious","pernickety","meticulous (often used positively, but can be negative in excess)"],"antonyms":["easygoing","laid-back","relaxed","unfussy","carefree","tolerant"],"notes":"Often used to describe someone who is overly concerned with rules, order, or cleanliness."}],"etymology":{"value":"Derived from 'fussbudget,' which is a combination of 'fuss' (petty excitement or worry) and possibly 'budget' (suggesting a concern with small amounts or details). The '-y' suffix turns it into an adjective.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfʌsˌbʌdʒɪti/","syllables":"fuss-budg-et-y"},"inflection":{"notes":"Comparative and superlative forms are generally 'more fussbudgety' and 'most fussbudgety,' respectively, as it's not a core adjective."},"usage_notes":{"explanation":"'Fussbudgety' is an informal and often pejorative term used to describe someone who pays excessive attention to trivial details, rules, or order. It implies that this attention is annoying or unnecessary. The term is more common in spoken English than in formal writing.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a fussbudgety.","correct":"✓ He is fussbudgety. / ✓ He is a fussbudgety person.","note":"'Fussbudgety' is an adjective, so it needs to modify a noun or follow a linking verb. You can say 'He is fussbudgety' or 'He is a fussbudgety person,' but not 'He is a fussbudgety' alone."},{"incorrect":"✗ She is fussbudgety about everything except important things.","correct":"✓ She is fussbudgety about everything, especially unimportant things.","note":"'Fussbudgety' implies a focus on unimportant details, so the phrase 'except important things' is contradictory."}],"priority":"★★☆"},"related_words":{"derivatives":["fussbudget (noun: a fussy person)","fuss (noun/verb: excessive concern or activity about something unimportant)","fussy (adjective: showing excessive concern with minor details)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Low frequency (relatively uncommon word)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Fussbudgety' is an informal adjective describing someone excessively concerned with trivial details, often to an annoying degree. It's not a common word, so understanding requires familiarity with the base word 'fussbudget' and the general meaning of the '-y' suffix to create adjectives. It's more likely to be encountered in spoken or informal written contexts."},"example_sentences":[{"sentence":"Don't be so fussbudgety about the seating arrangement; just find a place to sit.","translation":"座席の配置についてそんなに細かく言うな。どこか座れる場所を見つけて座ればいいんだ。","type":"adjective","meaning_category":"Overly concerned with details"},{"sentence":"My grandmother is quite fussbudgety when it comes to cleaning; everything has to be spotless.","translation":"私の祖母は掃除に関してはかなり細かい。すべてが完璧にきれいである必要がある。","type":"adjective","meaning_category":"Overly concerned with details"},{"sentence":"The editor was known for being fussbudgety about grammar and punctuation.","translation":"その編集者は文法と句読点にうるさいことで知られていた。","type":"adjective","meaning_category":"Overly concerned with details"}]}