{"word":"Protostar","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"原始星","english_definition":"A contracting mass of gas and plasma that represents an early stage in the formation of a star.","examples":[{"sentence":"The protostar was still surrounded by a swirling disk of gas and dust.","translation":"その原始星はまだガスと塵の渦巻く円盤に囲まれていた。"},{"sentence":"Astronomers observed the protostar using infrared telescopes.","translation":"天文学者たちは赤外線望遠鏡を使ってその原始星を観測した。"}],"collocations":["form a protostar","observe a protostar","young protostar","massive protostar"],"synonyms":["pre-main-sequence star","young stellar object (YSO)"],"antonyms":["main-sequence star","red giant","white dwarf"]}],"etymology":{"value":"From 'proto-' (meaning 'first' or 'earliest form of') + 'star'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈproʊtoʊstɑːr/","syllables":"pro-to-star"},"inflection":{"noun_plural":"protostars"},"usage_notes":{"explanation":"A protostar is an early stage in the life cycle of a star. It is formed by the gravitational collapse of a molecular cloud core. As the protostar collapses, it heats up and begins to radiate energy. Eventually, the core of the protostar becomes hot enough for nuclear fusion to begin, and the protostar becomes a main-sequence star.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The protostar is already burning hydrogen.","correct":"✓ The protostar is not yet burning hydrogen.","note":"Protostars have not yet reached the stage of nuclear fusion, so they don't burn hydrogen like main-sequence stars."}],"priority":"★★☆"},"related_words":{"derivatives":["protostellar (adjective)"],"related_terms":["molecular cloud","nebula","T Tauri star","Herbig-Haro object","accretion disk","stellar evolution","star formation"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in astronomy and astrophysics contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'protostar' is a technical term used in astronomy to describe a star in its earliest stage of formation, before it begins nuclear fusion. Understanding this term requires some background knowledge of astrophysics and stellar evolution. The word itself is composed of 'proto-' meaning 'first' and 'star,' making it conceptually accessible, but its usage is limited to scientific contexts."},"example_sentences":[{"sentence":"The James Webb Space Telescope is providing unprecedented views of protostars forming within molecular clouds.","translation":"ジェームズ・ウェッブ宇宙望遠鏡は、分子雲の中で形成される原始星のこれまでにない画像を提供している。","type":"general","meaning_category":"general"},{"sentence":"The protostar's luminosity increased as it accreted more material from the surrounding disk.","translation":"原始星の光度は、周囲の円盤からより多くの物質を取り込むにつれて増加した。","type":"technical","meaning_category":"technical"}]}