{"word":"enfranchiser","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(人や集団に)選挙権を与える人、解放する人","english_definition":"A person or thing that enfranchises; one who grants the rights and privileges of citizenship, especially the right to vote.","examples":[{"sentence":"The suffragette movement was a powerful enfranchiser of women.","translation":"婦人参政権運動は、女性に選挙権を与える強力な推進力となった。"},{"sentence":"History remembers him as an enfranchiser of the working class.","translation":"歴史は彼を労働者階級に選挙権を与えた人物として記憶している。"}],"collocations":["act as an enfranchiser","historical enfranchiser"],"synonyms":["liberator","emancipator","franchiser"],"antonyms":["disenfranchiser"]}],"etymology":{"value":"From 'enfranchise' (to grant the right to vote) + '-er' (suffix denoting agent). 'Enfranchise' comes from Old French 'enfranchir', meaning 'to set free', ultimately from 'franc', referring to the Franks, who were originally free men.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈfræntʃaɪzər/","syllables":"in-fran-chise-er"},"inflection":{"noun_plural":"enfranchisers"},"usage_notes":{"explanation":"'Enfranchiser' refers to someone who actively works to give rights, especially voting rights, to a group of people. It highlights the act of granting freedom or rights. The term is often used in historical or political contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The law enfranchised.","correct":"✓ The law acted as an enfranchiser.","note":"'Enfranchiser' is a noun, not a verb. Use it to describe the agent, not the action itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["enfranchise (verb: to grant the right to vote or other rights)","enfranchisement (noun: the act of granting rights)","franchise (noun: the right to vote; a business license)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'enfranchiser' is a formal and relatively rare term. It is used to describe someone who actively grants rights, particularly the right to vote, to a group of people who were previously excluded. Understanding the historical context of enfranchisement movements is helpful in grasping the meaning of this word."},"example_sentences":[{"sentence":"Susan B. Anthony was a key enfranchiser in the women's suffrage movement.","translation":"スーザン・B・アンソニーは、女性参政権運動における重要な権利付与者でした。","type":"noun","meaning_category":"granting voting rights"},{"sentence":"Legislation can act as an enfranchiser by expanding access to voting.","translation":"法律は、投票へのアクセスを拡大することにより、権利付与者として機能することができます。","type":"noun","meaning_category":"granting voting rights"}]}