{"word":"halfword","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(情報科学) ハーフワード：コンピュータのワード（通常は2バイトまたは16ビット）の半分。","english_definition":"(computing) Half the size of a word, typically 2 bytes or 16 bits.","examples":[{"sentence":"The variable is stored as a halfword to save memory.","translation":"その変数はメモリを節約するためにハーフワードとして保存される。"},{"sentence":"In some architectures, a halfword is the smallest addressable unit.","translation":"いくつかのアーキテクチャでは、ハーフワードは最小のアドレス指定可能な単位である。"}],"collocations":["store as halfword","halfword alignment"],"synonyms":["short word"],"antonyms":["word","doubleword"]}],"etymology":{"value":"'half' + 'word'.  Directly describes its size relative to a 'word'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈhæfˌwɜːrd/","syllables":"half-word"},"inflection":{"noun_plural":"halfwords"},"usage_notes":{"explanation":"In computer architecture, a halfword is a data unit that is half the size of a full word. The exact size of a halfword depends on the architecture of the computer, but it is commonly 16 bits (2 bytes). Halfwords are used to store smaller data values, such as short integers or characters, and can help to reduce memory usage and improve performance in some cases.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The halfword is 4 bytes.","correct":"✓ The halfword is 2 bytes.","note":"A halfword is typically 2 bytes (16 bits), not 4 bytes.  4 bytes would usually be a full 'word' on many systems, or a 'single-precision floating point number' (float)."},{"incorrect":"✗ Use halfword for large numbers.","correct":"✓ Use word or larger for large numbers.","note":"Halfwords are for smaller numbers. Using them for large numbers would cause overflow errors."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["byte","word","doubleword","longword","data type","memory address","endianness"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Halfword' is a technical term used in computer science, specifically in the context of computer architecture and data representation. It refers to a unit of data that is half the size of a 'word' on a given computer system. Understanding this term requires familiarity with basic computer architecture concepts like memory organization, data types, and word size. It's not commonly used outside of technical discussions related to low-level programming or hardware design."},"example_sentences":[{"sentence":"The processor fetches instructions in units of halfwords.","translation":"プロセッサはハーフワード単位で命令をフェッチする。","type":"technical","meaning_category":"computing"},{"sentence":"We can pack more data into memory by using halfword variables.","translation":"ハーフワード変数を使用することで、より多くのデータをメモリにパックできる。","type":"technical","meaning_category":"computing"}]}