{"word":"oculocephalic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"眼球頭部の、眼球と頭部に関する","english_definition":"Relating to the eyes and the head, especially with regard to movements of the eyes in response to head movements.","examples":[{"sentence":"The oculocephalic reflex is tested to assess brainstem function.","translation":"眼球頭反射は脳幹機能を評価するために検査されます。"},{"sentence":"Oculocephalic movements were observed during the examination.","translation":"検査中に眼球頭運動が観察されました。"}],"collocations":["oculocephalic reflex","oculocephalic response","oculocephalic maneuver"],"synonyms":["vestibulo-ocular"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin words 'oculus' (eye) and 'cephalicus' (relating to the head), combining to describe something pertaining to both the eyes and the head.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒkjʊloʊsɪˈfælɪk/","syllables":"oc-u-lo-ce-phal-ic"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"The term 'oculocephalic' is primarily used in medical contexts, particularly in neurology, to describe reflexes and movements involving the eyes and head. It is often used when discussing the oculocephalic reflex, also known as the doll's eye reflex, which is a test to assess brainstem function in comatose patients.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ oculocephalic is when you look at your head.","correct":"✓ Oculocephalic refers to the relationship between eye and head movements.","note":"Oculocephalic does not mean simply looking at one's head, but rather refers to the coordination or relationship between eye and head movements."}],"priority":"★☆☆"},"related_words":{"derivatives":["oculus (eye)","cephalic (relating to the head)","oculomotor (relating to eye movement)"],"phrases":["oculocephalic reflex (doll's eye reflex)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized medical vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Oculocephalic' is a highly specialized term primarily used in medical and neurological contexts. It describes the relationship between the eyes and the head, particularly concerning movements and reflexes. Understanding this term requires a background in anatomy, physiology, or medicine. It is not commonly used in general conversation."},"example_sentences":[{"sentence":"The presence of the oculocephalic reflex indicated intact brainstem function.","translation":"眼球頭反射の存在は、脳幹機能が正常であることを示していました。","type":"medical","meaning_category":"reflex assessment"},{"sentence":"The doctor performed an oculocephalic examination to evaluate the patient's neurological status.","translation":"医師は患者の神経学的状態を評価するために眼球頭検査を実施しました。","type":"medical","meaning_category":"neurological exam"}]}