{"word":"disgregation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"分離、分散、解離","english_definition":"The act of disgregating; separation; disunion; the state of being disgregated.","examples":[{"sentence":"The disgregation of the crowd after the event was orderly.","translation":"イベント後、群衆の解散は秩序正しかった。"},{"sentence":"The disgregation of the company's assets led to its eventual bankruptcy.","translation":"会社の資産の分離は、最終的な倒産につながった。"}],"collocations":["cause disgregation","result in disgregation","process of disgregation"],"synonyms":["separation","dispersion","dissolution","disintegration","scattering"],"antonyms":["aggregation","integration","assembly","collection"]}],"etymology":{"value":"From Latin 'dis-' (apart, asunder) + 'grex' (flock, herd) + '-ation' (forming nouns of action or condition). Essentially, 'to separate from a flock or group'.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪsɡrɪˈɡeɪʃən/","syllables":"dis-gre-ga-tion"},"inflection":{"noun_plural":"disgregations"},"usage_notes":{"explanation":"\"Disgregation\" refers to the process or state of something being separated or broken apart from a group or whole. It is the opposite of aggregation, which means to come together. The term is relatively uncommon in everyday language and is more frequently used in technical or formal contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The disgregation of the information made it easier to understand.","correct":"✓ The segregation of the information made it easier to understand.","note":"While \"disgregation\" implies separation, \"segregation\" is more commonly used when referring to the separation of information or data."}],"priority":"★☆☆"},"related_words":{"derivatives":["disgregate (verb): to separate or scatter","disgregative (adjective): tending to disgregate"],"related_concepts":["segregation","fragmentation","decomposition"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1/C2","text":"\"Disgregation\" is a formal and relatively rare term that describes the process of something being separated or scattered from a group or whole. It's not commonly used in everyday conversation but might appear in academic or technical writing when discussing the breakdown or separation of systems, data, or groups. Understanding the root words (dis- + greg- + -ation) can help in deciphering its meaning."},"example_sentences":[{"sentence":"The disgregation of the cells was observed under the microscope.","translation":"顕微鏡下で細胞の分離が観察された。","type":"noun","meaning_category":"separation"},{"sentence":"The government's policies led to the disgregation of the social fabric.","translation":"政府の政策は社会構造の解体に繋がった。","type":"noun","meaning_category":"disunion"}]}