{"word":"shoddier","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(shoddyの比較級) より粗末な、より質の悪い、よりずさんな","english_definition":"(comparative of shoddy) of poorer quality; more carelessly made or done.","examples":[{"sentence":"This product is shoddier than the last one we bought.","translation":"この製品は、以前に買ったものよりも粗末だ。"},{"sentence":"The workmanship on this repair is shoddier than I expected.","translation":"この修理の出来栄えは、予想していたよりもずさんだ。"}],"collocations":["shoddier construction (より粗末な構造)","shoddier materials (より質の悪い材料)","shoddier workmanship (よりずさんな出来栄え)"],"synonyms":["inferior","poorer","cheaper","flimsier","trashier"],"antonyms":["superior","better","finer","more durable","more reliable"]}],"etymology":{"value":"'Shoddier' is the comparative form of 'shoddy.' 'Shoddy' originally referred to a fabric made from reclaimed wool fibers, implying a lower quality. The term then extended to describe anything of poor quality or workmanship.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʃɒdiər/","syllables":"shod-di-er"},"inflection":{"adjective_forms":{"comparative":"shoddier","superlative":"shoddiest"}},"usage_notes":{"explanation":"'Shoddier' is used to compare two things, indicating that one is of lower quality or made with less care than the other. It implies a lack of attention to detail and a general inferiority in materials or construction. The term often carries a negative connotation, suggesting that the item is unreliable or likely to break down.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ This is the shoddier of all products.","correct":"✓ This is the shoddiest of all products.","note":"When comparing more than two items, use the superlative form 'shoddiest,' not the comparative 'shoddier.'"},{"incorrect":"✗ He did a shoddier job than me.","correct":"✓ He did a shoddier job than I did.","note":"When comparing actions, ensure the comparison is grammatically complete. 'Than I' should be followed by 'did' to clarify the comparison."}],"priority":"★★☆"},"related_words":{"derivatives":["shoddy (adjective: 粗末な, 質の悪い; noun: 粗悪品)","shoddily (adverb: 粗末に, ずさんに)","shoddiness (noun: 粗末さ, 質の悪さ)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Shoddier' means something is of lower quality than something else. It's used to compare the quality of two items, indicating that one is made with less care or poorer materials. For example, 'This car is shoddier than my old one' means the new car is made with worse materials or less attention to detail than the old car. It's not a very common word, but useful for expressing comparative quality.","example_sentences":[]},"example_sentences":[{"sentence":"The new version of the software is shoddier than the previous one, with more bugs and glitches.","translation":"新しいバージョンのソフトウェアは、以前のものよりもバグや不具合が多く、質が悪い。","type":"adjective","meaning_category":"粗末な・質の悪い"},{"sentence":"The construction of the new apartments was shoddier than expected, with thin walls and cheap materials.","translation":"新しいアパートの建設は予想以上に粗末で、壁は薄く、材料は安価だった。","type":"adjective","meaning_category":"粗末な・質の悪い"}]}