{"word":"hue-correct","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"To adjust or modify the hue of an image or color.","english_definition":"To adjust or modify the hue of an image or color, typically in digital image processing or color correction.","examples":[{"sentence":"I need to hue-correct this photo to remove the greenish tint.","translation":"緑がかった色合いを取り除くために、この写真の色相を補正する必要があります。"},{"sentence":"The software allows you to hue-correct specific parts of the image.","translation":"そのソフトウェアでは、画像内の特定の部分の色相を補正できます。"}],"collocations":["hue-correct image","hue-correct color","hue-correct selectively"],"synonyms":["color-correct","adjust hue","modify hue"],"antonyms":["N/A"]}],"etymology":{"value":"A compound word formed by combining 'hue' (the attribute of a color by virtue of which it is discernible as red, green, blue, etc.) and 'correct' (to make right; to remove errors).","priority":"N/A"},"pronunciation":{"ipa":"/ˈhjuː kəˈrɛkt/","syllables":"hue-cor-rect"},"inflection":{"verb_forms":{"present_simple":["hue-correct","hue-corrects"],"past_simple":"hue-corrected","past_participle":"hue-corrected","present_participle":"hue-correcting"}},"usage_notes":{"explanation":"'Hue-correct' is primarily used in the context of digital image processing, photography, and graphic design. It refers to the process of adjusting the hue values in an image or color palette to achieve a desired visual effect or to correct color imbalances. The term is relatively technical and less common in everyday conversation.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to hue correct the image's saturation.","correct":"✓ I need to hue-correct the image. / ✓ I need to adjust the image's saturation.","note":"'Hue-correct' specifically refers to adjusting the hue, not other color properties like saturation. If you're adjusting saturation, use 'adjust saturation' or 'color-correct' more broadly."}],"priority":"N/A"},"related_words":{"derivatives":["hue (noun)","correction (noun)","color correction (noun)"],"phrasal_verbs":["N/A"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Hue-correct' is a technical term primarily used in fields such as digital image processing, photography, and graphic design. It refers to the act of adjusting the hue, which is the attribute of a color that distinguishes it as red, green, blue, etc. Understanding this term requires familiarity with color theory and image editing concepts. It is not commonly used in general conversation."},"example_sentences":[{"sentence":"The artist used software to hue-correct the painting, giving it a warmer tone.","translation":"アーティストはソフトウェアを使って絵画の色相を補正し、より暖かい色調にした。","type":"verb","meaning_category":"adjust hue"},{"sentence":"The photographer had to hue-correct the photo because the lighting was off.","translation":"写真家は照明が悪かったため、写真の色相を補正する必要があった。","type":"verb","meaning_category":"adjust hue"}]}