{"word":"Irishizing","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"アイルランド風にする、アイルランド化する","english_definition":"To make something more Irish in character or culture.","examples":[{"sentence":"The city council is considering Irishizing the downtown area to attract tourists.","translation":"市議会は観光客誘致のため、ダウンタウン地区をアイルランド風にすることを検討している。"},{"sentence":"The restaurant owner decided to Irishize the menu with traditional dishes.","translation":"レストランのオーナーは、伝統的な料理でメニューをアイルランド風にすることに決めた。"}],"collocations":["Irishize a menu","Irishize a town","Irishize a name"],"synonyms":["Gaelicize","Hibernicize"],"antonyms":["Anglicize","Americanize"]},{"part_of_speech":"verb","transitivity":"vi","definition":"アイルランド風になる、アイルランド化される","english_definition":"To become more Irish in character or culture.","examples":[{"sentence":"Over time, the community began Irishizing, embracing traditional music and dance.","translation":"時が経つにつれて、コミュニティはアイルランド風になり始め、伝統的な音楽とダンスを取り入れた。"}],"collocations":["Irishizing community"],"synonyms":["Gaelicize","Hibernicize"],"antonyms":["Anglicize","Americanize"]},{"part_of_speech":"noun","definition":"アイルランド化","english_definition":"The act or process of making something more Irish in character or culture.","examples":[{"sentence":"The Irishizing of the neighborhood led to increased tourism.","translation":"近隣のアイルランド化は観光客増加につながった。"}],"collocations":["process of Irishizing"],"synonyms":["Gaelicization","Hibernicization"],"antonyms":["Anglicization","Americanization"]}],"etymology":{"value":"\"Irish\" + \"-ize\" + \"-ing\".","priority":"★★★"},"pronunciation":{"ipa":"/ˈaɪrɪʃaɪzɪŋ/","syllables":"I-rish-i-zing"},"inflection":{"verb_forms":{"present_simple":["Irishizes"],"past_simple":"Irishized","past_participle":"Irishized","present_participle":"Irishizing"},"noun_plural":"Irishizings"},"usage_notes":{"explanation":"The term \"Irishizing\" refers to the process of making something more Irish in character, culture, or appearance. This can involve incorporating Irish traditions, language, or symbols. The term is often used in the context of tourism, cultural preservation, or identity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ They are Irishizing the food by adding Italian spices.","correct":"✓ They are Irishizing the food by adding traditional Irish herbs.","note":"Irishizing should involve making something more Irish, not adding elements from other cultures."}],"priority":"★★☆"},"related_words":{"derivatives":["Irishize","Irishized"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Irishizing\" is a relatively uncommon term that describes the process of making something more Irish in character or culture. It is often used in discussions about cultural identity, tourism, and the preservation of Irish traditions. Understanding the word requires a familiarity with the concept of cultural adaptation and the specific characteristics of Irish culture."},"example_sentences":[{"sentence":"The city is Irishizing its St. Patrick's Day parade to emphasize its Irish heritage.","translation":"市はアイルランドの遺産を強調するため、聖パトリックの日のパレードをアイルランド風にしている。","type":"verb","meaning_category":"アイルランド風にする"},{"sentence":"The Irishizing of the school curriculum aims to promote the Irish language and culture.","translation":"学校のカリキュラムのアイルランド化は、アイルランドの言語と文化の促進を目的としている。","type":"noun","meaning_category":"アイルランド化"}]}