{"word":"trimetric","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"三斜晶系の、三斜晶系の結晶に関する","english_definition":"Relating to or having the characteristics of the triclinic crystal system.","examples":[{"sentence":"The mineral was identified as trimetric based on its crystal structure.","translation":"その鉱物は、その結晶構造に基づいて三斜晶系であると同定された。"}],"collocations":["trimetric crystal system","trimetric projection"],"synonyms":["triclinic"],"antonyms":[]}],"etymology":{"value":"From 'tri-' (three) + 'metric' (relating to measurement), referring to the three unequal axes and angles in the triclinic crystal system.","priority":"★★☆"},"pronunciation":{"ipa":"/traɪˈmɛtrɪk/","syllables":"tri-met-ric"},"inflection":{"notes":"The word 'trimetric' does not have plural forms or comparative/superlative forms as it is an adjective."},"usage_notes":{"explanation":"'Trimetric' is primarily used in crystallography and mineralogy to describe crystals belonging to the triclinic system. These crystals have three unequal axes intersecting at three unequal angles, none of which are 90 degrees. The term is relatively specialized and not commonly used outside of scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building has a trimetric design.","correct":"✓ The building has a triclinic design.","note":"'Trimetric' is specifically related to crystal systems. For general design, 'asymmetrical' or 'irregular' might be more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["triclinic (synonym)","crystal system"],"phrases":["trimetric crystal","trimetric lattice"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Trimetric' is a technical term used in the field of crystallography to describe a specific type of crystal system called the triclinic system. These crystals are characterized by three unequal axes intersecting at three unequal angles, none of which are right angles. Understanding this term requires a background in mineralogy or materials science. It is not commonly used in general language.","priority":"★★☆"},"example_sentences":[{"sentence":"The sample exhibited a trimetric crystal structure under microscopic analysis.","translation":"そのサンプルは、顕微鏡分析下で三斜晶系の結晶構造を示した。","type":"general","meaning_category":"crystallography"},{"sentence":"Trimetric crystals are often difficult to identify due to their lack of symmetry.","translation":"三斜晶系の結晶は、対称性がないため、識別が難しいことが多い。","type":"technical","meaning_category":"crystallography"}]}