{"word":"back-paint","priority":"★★★","meanings":[{"part_of_speech":"verb","definition":"(ガラスやアクリルなどの素材の)裏面に塗装する","english_definition":"To apply paint to the reverse side of a transparent material, such as glass or acrylic.","examples":[{"sentence":"We will back-paint the glass to give it a glossy, opaque finish.","translation":"光沢のある不透明な仕上がりにするために、ガラスの裏面に塗装します。"},{"sentence":"The sign was back-painted with vibrant colors to make it stand out.","translation":"その標識は、目立つように鮮やかな色で裏面塗装されました。"}],"collocations":["back-paint glass (ガラスを裏面塗装する)","back-paint acrylic (アクリルを裏面塗装する)","back-paint a sign (看板を裏面塗装する)"],"synonyms":["reverse-paint","underpaint"],"antonyms":["front-paint"]},{"part_of_speech":"noun","definition":"裏面塗装","english_definition":"The process or technique of applying paint to the reverse side of a transparent material.","examples":[{"sentence":"Back-paint is often used in signage and decorative applications.","translation":"裏面塗装は、看板や装飾用途でよく使用されます。"},{"sentence":"The back-paint provides a durable and attractive finish.","translation":"裏面塗装は、耐久性があり魅力的な仕上がりを提供します。"}],"collocations":["use back-paint (裏面塗装を使用する)","apply back-paint (裏面塗装を適用する)","back-paint technique (裏面塗装技術)"],"synonyms":["reverse painting","underpainting"],"antonyms":["front painting"]}],"etymology":{"value":"The term 'back-paint' is a compound word formed from 'back' (referring to the reverse side) and 'paint' (referring to the application of paint). It literally describes the process of painting on the back side of a material.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbækˌpeɪnt/","syllables":"back-paint"},"inflection":{"verb_forms":{"present_simple":["back-paint","back-paints"],"past_simple":"back-painted","past_participle":"back-painted","present_participle":"back-painting"},"noun_plural":"back-paints"},"usage_notes":{"explanation":"'Back-paint' refers specifically to the technique of applying paint to the reverse side of a transparent material. This method is often used to achieve a glossy, durable, and visually appealing finish, particularly in applications like signage, decorative panels, and furniture. The paint is protected by the transparent material, making it less susceptible to scratches and wear.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I front-painted the glass, but it looks terrible.","correct":"✓ I back-painted the glass, and it looks great.","note":"'Front-paint' refers to painting the front surface, while 'back-paint' refers to painting the reverse side of a transparent material. Using the wrong term can lead to confusion about the technique used."},{"incorrect":"✗ The paint is on the front of the glass, so it's back-paint.","correct":"✓ The paint is on the back of the glass, so it's back-paint.","note":"The defining characteristic of back-paint is that the paint is applied to the reverse side of the transparent material."}],"priority":"★★☆"},"related_words":{"derivatives":["back-painted (adjective: 裏面塗装された)"],"phrasal_verbs":[],"related_techniques":["screen printing","spray painting","lacquering"],"related_materials":["glass","acrylic","lacquer","enamel paint"],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Back-paint' is a specialized term referring to the technique of applying paint to the reverse side of a transparent material, such as glass or acrylic. This method is used to create a durable, glossy finish, often seen in signage and decorative applications. Understanding this term requires familiarity with painting techniques and materials used in manufacturing and design. It's important to distinguish 'back-paint' from standard painting methods where the paint is applied to the front surface.","priority":"★☆☆"},"example_sentences":[{"sentence":"The company specializes in back-painting glass for architectural applications.","translation":"その会社は、建築用途向けのガラスの裏面塗装を専門としています。","type":"verb","meaning_category":"裏面塗装する"},{"sentence":"The back-paint on this sign is very durable and resistant to scratches.","translation":"この標識の裏面塗装は非常に耐久性があり、傷がつきにくいです。","type":"noun","meaning_category":"裏面塗装"},{"sentence":"Back-painting is a common technique for creating high-end decorative panels.","translation":"裏面塗装は、高級装飾パネルを作成するための一般的な技術です。","type":"noun","meaning_category":"裏面塗装"},{"sentence":"They back-painted the acrylic sheet with a custom color to match the brand's aesthetic.","translation":"彼らはブランドの美学に合わせて、カスタムカラーでアクリルシートを裏面塗装しました。","type":"verb","meaning_category":"裏面塗装する"}]}