{"word":"planispherical","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"平面図の、平面図形の、プラニスフェアの","english_definition":"Relating to or resembling a planisphere; represented on a plane.","examples":[{"sentence":"The planispherical projection showed the continents in a distorted form.","translation":"平面図法による投影は、大陸を歪んだ形で示した。"},{"sentence":"The planispherical astrolabe was used to determine the position of stars.","translation":"平面図式アストロラーベは、星の位置を特定するために使用された。"}],"collocations":["planispherical projection (平面図法)","planispherical astrolabe (平面図式アストラーベ)"],"synonyms":["planar","flat","two-dimensional"],"antonyms":["spherical","three-dimensional"]},{"part_of_speech":"adjective","definition":"プラニスフェアのような形状の","english_definition":"Having the shape of a planisphere.","examples":[{"sentence":"The museum displayed a planispherical model of the solar system.","translation":"博物館には、太陽系の平面図模型が展示されていた。"}],"collocations":[],"synonyms":["disk-shaped","circular"],"antonyms":[]}],"etymology":{"value":"'Planisphere' + '-ical'. 'Planisphere' comes from the Latin 'planus' (flat) + 'sphaera' (sphere).","priority":"★★★"},"pronunciation":{"ipa":"/ˌplænɪˈsfɪrɪkəl/","syllables":"pla-ni-spher-i-cal"},"inflection":{"notes":"Adjective, no inflection."},"usage_notes":{"explanation":"'Planispherical' is an adjective primarily used in technical or scientific contexts, particularly in astronomy and cartography. It describes something related to or resembling a planisphere, which is a flat representation of the celestial sphere or a portion of the Earth's surface. The term often implies a projection or representation onto a two-dimensional plane.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The spherical map was planispherical.","correct":"✓ The spherical object was represented using a planispherical projection.","note":"A spherical map cannot be planispherical, as 'planispherical' implies a flat representation. The correct usage would be to say that a spherical object is represented using a planispherical projection. "},{"incorrect":"✗ He used a planispherical to measure the angle.","correct":"✓ He used a planisphere to measure the angle.","note":"'Planispherical' is an adjective, not a noun. The correct noun is 'planisphere'."}],"priority":"★★☆"},"related_words":{"derivatives":["planisphere"],"phrasal_verbs":[],"related_terms":["cartography","astronomy","projection","celestial sphere","astrolabe"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'planispherical' is a technical term primarily used in the fields of astronomy and cartography. It describes something related to a 'planisphere,' which is a flat representation of the celestial sphere or a portion of the Earth. Understanding this word requires familiarity with these scientific contexts. It's not commonly used in everyday language."},"example_sentences":[{"sentence":"The ancient mariners used a planispherical chart for navigation.","translation":"古代の船乗りは、航海のために平面図の海図を使用した。","type":"general","meaning_category":"平面図の"},{"sentence":"The professor explained the principles of planispherical projection.","translation":"教授は、平面図法の原理を説明した。","type":"technical","meaning_category":"平面図の"}]}