{"word":"Heraklid","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"ヘーラクレースの子孫、ヘーラクレイダイ","english_definition":"A descendant of Heracles (Hercules); plural: Heraclidae.","examples":[{"sentence":"The Heraklids claimed their right to rule the Peloponnese.","translation":"ヘーラクレイダイはペロポネソスを支配する権利を主張した。"}],"collocations":["Heraklid dynasty","Heraklid kings"],"synonyms":["Heraclid","Heracleidae"],"antonyms":[]}],"etymology":{"value":"Derived from the name of Heracles (Hercules), with the suffix '-id' indicating descent or family membership.","priority":"★★☆"},"pronunciation":{"ipa":"/hɪˈræklɪd/","syllables":"He-rak-lid"},"inflection":{"noun_plural":"Heraclids or Heraclidae"},"usage_notes":{"explanation":"'Heraklid' refers to a member of the lineage claiming descent from the mythological hero Heracles. The Heraclidae play a significant role in Greek mythology and history, particularly in the Dorian invasion and the establishment of dynasties in the Peloponnese.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["Heraclea (various cities named after Heracles)","Heracles (the hero himself)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily encountered in historical or mythological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Heraklid' is a specialized term primarily used in the context of Greek mythology and ancient history. Understanding requires familiarity with the legends surrounding Heracles (Hercules) and the historical claims of various ruling families in ancient Greece. It is not a word commonly encountered in everyday language.","priority":"★☆☆"},"example_sentences":[{"sentence":"According to legend, the return of the Heraklids was a key event in the Dorian invasion.","translation":"伝説によれば、ヘーラクレイダイの帰還はドーリア人の侵略における重要な出来事であった。","type":"noun","meaning_category":"ヘーラクレースの子孫"},{"sentence":"Many ancient dynasties traced their lineage back to a Heraklid ancestor.","translation":"多くの古代王朝は、自分たちの血統をヘーラクレースの子孫に遡らせた。","type":"noun","meaning_category":"ヘーラクレースの子孫"}]}