{"word":"Hoosierize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"To convert something to a Hoosier style or make it characteristic of Indiana or its residents.","english_definition":"To make something resemble or be characteristic of Indiana or its residents.","examples":[{"sentence":"The company decided to Hoosierize its marketing campaign to better appeal to the local audience.","translation":"その会社は、地元の聴衆により良くアピールするために、マーケティングキャンペーンをインディアナ風にすることに決定しました。"},{"sentence":"They attempted to Hoosierize the recipe by adding ingredients commonly found in Indiana cuisine.","translation":"彼らは、インディアナ料理によく見られる材料を加えることによって、レシピをインディアナ風にしようと試みました。"}],"collocations":["Hoosierize a campaign","Hoosierize a recipe","Hoosierize a product"],"synonyms":["adapt","localize","customize","regionalize"],"antonyms":["globalize","standardize","generalize"]}],"etymology":{"value":"Derived from 'Hoosier,' a demonym for residents of Indiana, USA, combined with the suffix '-ize,' indicating the act of making something into that form or characteristic. The origin of 'Hoosier' itself is debated, with various folk etymologies.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhuːʒəˌraɪz/","syllables":"Hoo-sier-ize"},"inflection":{"verb_forms":{"present_simple":["Hoosierize","Hoosierizes"],"past_simple":"Hoosierized","past_participle":"Hoosierized","present_participle":"Hoosierizing"}},"usage_notes":{"explanation":"'Hoosierize' is a relatively uncommon verb used to describe the process of adapting or modifying something to reflect the culture, style, or characteristics of Indiana or its residents (known as Hoosiers). It implies making something more local or regional in nature.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The chef Hoosierized the French dish by adding pasta.","correct":"✓ The chef Hoosierized the French dish by adding corn and pork tenderloin.","note":"The correction provides ingredients more typical of Indiana cuisine, making the Hoosierization more accurate."}],"priority":"★☆☆"},"related_words":{"derivatives":["Hoosier (noun, adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hoosierize' is a specialized term related to the U.S. state of Indiana. It means to adapt something to fit the culture or characteristics of Indiana. This word is not commonly used outside of contexts specifically discussing Indiana or regional adaptations."},"example_sentences":[{"sentence":"The brewery decided to Hoosierize its beer selection by featuring locally sourced ingredients.","translation":"その醸造所は、地元産の材料を特徴とすることで、ビールのセレクションをインディアナ風にすることに決定しました。","type":"verb","meaning_category":"adapt"},{"sentence":"The restaurant chain planned to Hoosierize its menu in Indiana locations to include regional favorites like pork tenderloin sandwiches.","translation":"そのレストランチェーンは、インディアナの店舗でポークテンダーロインサンドイッチのような地元の人気料理を含めるために、メニューをインディアナ風にすることを計画しました。","type":"verb","meaning_category":"customize"}]}