{"word":"flop-top","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of container, typically a bottle or jar, with a hinged lid that flips open and closed.","english_definition":"A container, typically a bottle or jar, with a hinged lid that flips open and closed.","examples":[{"sentence":"She refilled her water bottle, which had a convenient flop-top.","translation":"彼女は便利なフリップトップのついたウォーターボトルに水を補充した。"},{"sentence":"The old-fashioned lemonade came in a glass bottle with a flop-top.","translation":"その昔ながらのレモネードは、フリップトップのガラス瓶に入っていた。"}],"collocations":["flop-top bottle","flop-top container","flop-top lid"],"synonyms":["flip-top","swing-top","bail-top"],"antonyms":[]}],"etymology":{"value":"A combination of 'flop' (referring to the action of the lid) and 'top' (referring to the lid itself).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈflɒpˌtɒp/","syllables":"flop-top"},"inflection":{"noun_plural":"flop-tops"},"usage_notes":{"explanation":"The term 'flop-top' is primarily used to describe containers that have a hinged lid that can be easily flipped open and closed, often with a snapping or clicking sound. These containers are often reusable and are used for liquids or other pourable substances. The term is more descriptive than formally defined, and may overlap with 'flip-top' or 'swing-top'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need a flop-top for my computer.","correct":"✓ I need a laptop for my computer.","note":"'Flop-top' refers to a type of container lid, not a computer. Use 'laptop' for a portable computer."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Flop-top' is a relatively uncommon term referring to a specific type of container lid. Understanding requires familiarity with the physical mechanism of a hinged lid that flips open and closed. Due to its specificity, it is unlikely to be encountered frequently in general English conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The beer came in a brown bottle with a red flop-top.","translation":"ビールは赤いフリップトップの茶色の瓶に入っていた。","type":"noun","meaning_category":"Container with hinged lid"},{"sentence":"She easily opened the juice using the bottle's flop-top.","translation":"彼女はボトルのフリップトップを使って簡単にジュースを開けた。","type":"noun","meaning_category":"Container with hinged lid"}]}