{"word":"non-Anglo","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"非アングロサクソン系の、アングロサクソン人でない","english_definition":"Not of Anglo-Saxon origin or descent; not relating to Anglo-Saxons or their culture.","examples":[{"sentence":"The city has a large non-Anglo population.","translation":"その都市には多くのアングロサクソン系でない人々が住んでいる。"},{"sentence":"The study focused on the experiences of non-Anglo immigrants.","translation":"その研究は、アングロサクソン系でない移民の経験に焦点を当てた。"},{"sentence":"The school aims to promote understanding between Anglo and non-Anglo students.","translation":"その学校は、アングロサクソン系の学生と非アングロサクソン系の学生の間の理解を促進することを目指している。"}],"collocations":["non-Anglo culture (非アングロサクソン文化)","non-Anglo community (非アングロサクソン系コミュニティ)","non-Anglo background (非アングロサクソン系の背景)","non-Anglo ethnicity (非アングロサクソン系の民族性)"],"synonyms":["non-English","non-British","of different ethnic origin"],"antonyms":["Anglo","Anglo-Saxon"]},{"part_of_speech":"noun","definition":"非アングロサクソン系の人","english_definition":"A person who is not of Anglo-Saxon origin or descent.","examples":[{"sentence":"The organization represents the interests of non-Anglos in the region.","translation":"その組織は、その地域の非アングロサクソン系の人々の利益を代表している。"},{"sentence":"The survey included both Anglos and non-Anglos.","translation":"その調査には、アングロサクソン系の人々と非アングロサクソン系の人々の両方が含まれていた。"}],"collocations":["non-Anglos and Anglos (非アングロサクソン系の人々とアングロサクソン系の人々)"],"synonyms":["non-English person","person of different ethnic origin"],"antonyms":["Anglo","Anglo-Saxon"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to 'Anglo', which refers to Anglo-Saxons, a Germanic people who settled in Britain in the 5th and 6th centuries.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒn ˈæŋɡloʊ/","syllables":"non-An-glo"},"inflection":{"noun_plural":"non-Anglos"},"usage_notes":{"explanation":"'Non-Anglo' is used to describe people, cultures, or things that are not of Anglo-Saxon origin. It is often used in contexts where there is a need to differentiate between Anglo-Saxon and other ethnic or cultural groups. The term can sometimes be considered sensitive, depending on the context and the specific groups being referred to. It is important to be mindful of the potential for misinterpretation or offense when using this term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The city is very non-Anglo.","correct":"✓ The city has a large non-Anglo population.","note":"It's more common to use 'non-Anglo' to describe a population or community rather than a place itself. Saying 'The city is very non-Anglo' is grammatically correct but less idiomatic."},{"incorrect":"✗ He is a non-Anglo speaker.","correct":"✓ He is a non-native English speaker.","note":"If you mean someone who doesn't speak English as their first language, it's better to say 'non-native English speaker' rather than 'non-Anglo speaker'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["Anglo","Anglo-Saxon","Anglo-American","non-white","minority"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency. Used in specific academic or sociological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'non-Anglo' is used to describe people or things that are not of Anglo-Saxon origin. This term is often used in academic or sociological contexts when discussing ethnicity, culture, or demographics. It is important to use this term carefully, as it can be seen as insensitive or exclusionary depending on the context. It is often more appropriate to use more specific terms to describe particular ethnic or cultural groups rather than using the broad term 'non-Anglo'."},"example_sentences":[{"sentence":"The museum features art from various non-Anglo cultures.","translation":"その博物館には、さまざまな非アングロサクソン文化の芸術作品が展示されている。","type":"adjective","meaning_category":"Cultural"},{"sentence":"The study examined the challenges faced by non-Anglo students in higher education.","translation":"その研究は、高等教育における非アングロサクソン系の学生が直面する課題を調査した。","type":"adjective","meaning_category":"Demographic"},{"sentence":"The organization provides support services for non-Anglo immigrants.","translation":"その組織は、非アングロサクソン系の移民に支援サービスを提供している。","type":"adjective","meaning_category":"Social"}]}