{"word":"Sabbatist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"安息日遵守主義者、特に、日曜ではなく土曜日を安息日として守るキリスト教徒","english_definition":"A person who observes the Sabbath, particularly one who observes it on Saturday rather than Sunday.","examples":[{"sentence":"The Sabbatists believe that the Sabbath should be observed on Saturday, as it is written in the Bible.","translation":"安息日遵守主義者は、聖書に書かれているように、安息日は土曜日に守られるべきだと信じている。"},{"sentence":"Some Sabbatist groups have faced discrimination for their religious practices.","translation":"一部の安息日遵守主義者のグループは、その宗教的慣習のために差別を受けてきた。"}],"collocations":["Seventh-day Sabbatist (セブンスデー・サバティスト、第七日安息日遵守者)"],"synonyms":["Sabbatarian","Seventh-day Adventist"],"antonyms":["Sunday observer"],"notes":"Often refers to Seventh-day Adventists or other similar denominations.","antonyms_notes":"Someone who observes Sunday as the Sabbath."}],"etymology":{"value":"From Sabbath + -ist.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsæbətɪst/","syllables":"Sab-ba-tist"},"inflection":{"noun_plural":"Sabbatists"},"usage_notes":{"explanation":"The term 'Sabbatist' typically refers to individuals or groups who adhere to the practice of observing the Sabbath on a day other than Sunday, most commonly Saturday. This belief is rooted in interpretations of biblical scripture. The term is often associated with specific religious denominations, such as Seventh-day Adventists, who emphasize the importance of Sabbath observance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Sabbatist and goes to church on Sunday.","correct":"✓ He is a Sabbatist and goes to church on Saturday.","note":"Sabbatists observe the Sabbath (and typically attend church) on Saturday, not Sunday."}],"priority":"★★☆"},"related_words":{"derivatives":["Sabbath","Sabbatarianism"],"related_terms":["Seventh-day Adventist","Hebraic roots movement"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Sabbatist' is a specialized term referring to individuals who observe the Sabbath on Saturday rather than Sunday. It is often used in religious or historical contexts. Understanding this term requires familiarity with religious practices and terminology related to the Sabbath. It is less commonly used in everyday conversation."},"example_sentences":[{"sentence":"The Sabbatist community gathered for prayer and fellowship on Saturday.","translation":"安息日遵守主義者のコミュニティは、土曜日に祈りと親睦のために集まった。","type":"noun","meaning_category":"安息日遵守主義者"},{"sentence":"Many Sabbatists base their beliefs on a literal interpretation of the Ten Commandments.","translation":"多くの安息日遵守主義者は、十戒の文字通りの解釈に基づいて彼らの信念を築いている。","type":"noun","meaning_category":"安息日遵守主義者"}]}