{"word":"Burghley","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A surname, also a place name in England.","english_definition":"A surname of English origin, also the name of a place in England, most notably Burghley House near Stamford.","examples":[{"sentence":"The Burghley Horse Trials are held annually at Burghley House.","translation":"バーリー・ホース・トライアルは、毎年バーリー・ハウスで開催されます。"},{"sentence":"William Cecil, 1st Baron Burghley, was a prominent statesman in Elizabethan England.","translation":"ウィリアム・セシル、初代バーリー男爵は、エリザベス朝イングランドの著名な政治家でした。"}],"collocations":["Burghley House","Burghley Horse Trials","Lord Burghley"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The surname Burghley is derived from a place name, likely from Old English 'burh' (fortified place) and 'leah' (wood, clearing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɜːrli/","syllables":"Burgh-ley"},"inflection":{},"usage_notes":{"explanation":"Burghley is primarily known as a surname and a place name. Burghley House is a famous stately home in Lincolnshire, England. The Burghley Horse Trials, a prestigious equestrian event, takes place there annually. The surname is associated with historical figures such as William Cecil, 1st Baron Burghley, a chief advisor to Queen Elizabeth I.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"related_places":["Burghley House (Lincolnshire, England)"],"related_people":["William Cecil, 1st Baron Burghley"]},"level_frequency":{},"readability_explanation":{"level":"N/A","text":"Burghley is a proper noun, referring to a specific surname and place. Its understanding is related to knowledge of British history and geography."},"example_sentences":[{"sentence":"We visited Burghley House last summer.","translation":"私たちは昨年の夏にバーリー・ハウスを訪れました。","type":"noun","meaning_category":"place name"},{"sentence":"The current Marquess of Exeter resides at Burghley.","translation":"現在のエクセター侯爵はバーリーに居住しています。","type":"noun","meaning_category":"place name"},{"sentence":"The Burghley family has a long and distinguished history.","translation":"バーリー家は長く、高名な歴史を持っています。","type":"noun","meaning_category":"surname"}]}