{"word":"doxastic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"信念に関する、意見に関する","english_definition":"Relating to or involving belief.","examples":[{"sentence":"Doxastic logic deals with reasoning about beliefs.","translation":"ドクサスティック論理は、信念に関する推論を扱う。"},{"sentence":"The doxastic attitude of the agent is crucial in this scenario.","translation":"このシナリオでは、エージェントの信念的な態度が重要である。"}],"collocations":["doxastic logic","doxastic attitude","doxastic state","doxastic commitment","doxastic justification"],"synonyms":["epistemic","cognitive","belief-related"],"antonyms":["alethic","veridical"]}],"etymology":{"value":"Derived from the Greek word 'doxa' (δόξα), meaning 'belief' or 'opinion'.","priority":"★★★"},"pronunciation":{"ipa":"/dɒkˈsæstɪk/","syllables":"dok-sas-tik"},"inflection":{"notes":"Adjectives do not typically inflect in English, aside from comparative and superlative forms, which are rarely used with 'doxastic' due to its specialized nature."},"usage_notes":{"explanation":"The term 'doxastic' is primarily used in philosophy, logic, and computer science to describe concepts related to belief. It is not commonly used in everyday language. It often appears in discussions of doxastic logic, which is a type of modal logic used to formalize reasoning about beliefs.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doxastic fact is that the Earth is round.","correct":"✓ The doxastic belief is that the Earth is round.","note":"'Doxastic' modifies beliefs or opinions, not facts. Facts are alethic, relating to truth."},{"incorrect":"✗ He had a doxastic feeling about the situation.","correct":"✓ He had a doxastic belief about the situation.","note":"'Doxastic' relates to beliefs, not feelings. While feelings can influence beliefs, 'doxastic' specifically refers to the belief itself."}],"priority":"★★☆"},"related_words":{"derivatives":["doxa (n.) - belief, opinion","doxography (n.) - a collection of opinions or beliefs"],"related_terms":["epistemology (n.) - the study of knowledge","belief (n.) - an acceptance that a statement is true or that something exists.","opinion (n.) - a view or judgment formed about something, not necessarily based on fact or knowledge."],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in academic and philosophical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Doxastic' is a specialized term primarily encountered in philosophy, logic, and theoretical computer science. It describes concepts pertaining to belief systems and opinions, often within the context of formal reasoning. Understanding requires familiarity with philosophical terminology and modal logic. Its rarity outside of academic discourse makes it a term for advanced learners.","priority":"★★☆"},"example_sentences":[{"sentence":"The philosopher explored the agent's doxastic commitments.","translation":"その哲学者は、エージェントの信念的なコミットメントを探求した。","type":"general","meaning_category":"Belief-related"},{"sentence":"Doxastic logic provides a framework for modeling belief revision.","translation":"ドクサスティック論理は、信念修正をモデル化するためのフレームワークを提供する。","type":"technical","meaning_category":"Belief-related"},{"sentence":"The robot's doxastic state was updated based on new sensor data.","translation":"ロボットの信念状態は、新しいセンサーデータに基づいて更新された。","type":"technical","meaning_category":"Belief-related"}]}