{"word":"ungilled","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(菌類が)ひだ(gill)がない、またはひだの無い","english_definition":"(of a fungus) lacking gills.","examples":[{"sentence":"This mushroom is ungilled, making it easy to identify.","translation":"このキノコはひだが無いため、識別が容易です。"},{"sentence":"Ungilled mushrooms are often found in specific habitats.","translation":"ひだの無いキノコは、特定の生息地で見られることが多いです。"}],"collocations":["ungilled mushroom","ungilled fungi"],"synonyms":["gill-less","non-gilled"],"antonyms":["gilled"]}],"etymology":{"value":"\"un-\" (not) + \"gilled\" (having gills).","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈɡɪld/","syllables":"un-gilled"},"inflection":{"notes":"Comparative and superlative forms are not typically used for this adjective."},"usage_notes":{"explanation":"The term \"ungilled\" is primarily used in mycology (the study of fungi) to describe fungi that do not possess gills, which are the radiating plate-like structures found on the underside of the caps of many mushrooms. Gills are important for spore dispersal. The absence of gills is a key characteristic used in the identification and classification of certain types of fungi.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The ungilled fish swam in the sea.","correct":"✓ The fish swam in the sea.","note":"\"Ungilled\" refers to fungi, not fish. Fish have gills, which are essential for their respiration. Using \"ungilled\" to describe a fish would be incorrect."}],"priority":"★★☆"},"related_words":{"derivatives":["gill (noun): a plate-like structure under the cap of some fungi, used for spore dispersal.","gilled (adjective): having gills."],"scientific_terms":["Basidiomycetes (a class of fungi that includes both gilled and ungilled species)","Aphyllophorales (an older taxonomic grouping that included many ungilled fungi)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Very low frequency - specialized term used in mycology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"ungilled\" is a technical term used in the field of mycology to describe fungi that lack gills. Gills are the thin, radiating structures found on the underside of the caps of many mushrooms, and they are essential for spore dispersal. Therefore, \"ungilled\" simply means \"without gills.\" This term is primarily encountered in scientific or educational contexts related to fungi identification and classification."},"example_sentences":[{"sentence":"The bolete is an example of an **ungilled** fungus.","translation":"イグチはひだのない菌類の例です。","type":"adjective","meaning_category":"lacking gills"},{"sentence":"Identifying features of the polypore include its **ungilled** underside and woody texture.","translation":"サルノコシカケの特徴は、ひだのない裏側と木のような質感です。","type":"adjective","meaning_category":"lacking gills"}]}