{"word":"conventional release","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(映画などの)通常公開、一般公開","english_definition":"A standard theatrical release of a film in cinemas, as opposed to a limited release or streaming-only release.","examples":[{"sentence":"The film had a conventional release in over 3,000 theaters nationwide.","translation":"その映画は全国3,000館以上の劇場で通常公開された。"},{"sentence":"After a successful film festival run, the studio decided to give the movie a conventional release.","translation":"映画祭での成功を受け、スタジオはその映画を通常公開することに決定した。"},{"sentence":"The director fought for a conventional release, wanting the film to be seen on the big screen.","translation":"監督は映画を大画面で見てもらいたかったため、通常公開を求めた。"}],"collocations":["wide release","theatrical release","limited release","streaming release","film distribution"],"synonyms":["general release","theatrical distribution"],"antonyms":["limited release","streaming release","direct-to-video"],"notes":"Often implies a wide distribution across many theaters."}],"etymology":{"value":"Combination of 'conventional' (following established practices) and 'release' (making something available to the public).","priority":"N/A"},"pronunciation":{"ipa":"/kənˈvɛnʃənəl rɪˈliːs/","syllables":"con-ven-tion-al re-lease"},"inflection":{"notes":"Noun, plural: conventional releases"},"usage_notes":{"explanation":"'Conventional release' refers to the typical way a film is shown to the public, which is in movie theaters. It's different from showing it only in a few theaters ('limited release') or making it available only on streaming services. The term is used to emphasize that a film is being shown in the usual way, in cinemas.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The film had a conventional released.","correct":"✓ The film had a conventional release.","note":"'Release' is a noun in this context, not a verb. Use the noun form."}],"priority":"N/A"},"related_words":{"derivatives":["conventional (adjective)","release (noun, verb)"],"related_terms":["theatrical window","box office","film distribution","independent film","blockbuster"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency, specific to the film industry.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'conventional release' is used in the film industry to describe the standard way a movie is shown in theaters. It means the film is available in many cinemas, unlike a 'limited release' which is only in a few theaters, or a 'streaming release' where it's only available online. It's a term used when discussing how a film is distributed to the public."},"example_sentences":[{"sentence":"The studio opted for a conventional release to maximize the film's box office potential.","translation":"スタジオは映画の興行収入の可能性を最大限に高めるために、通常公開を選んだ。","type":"example","meaning_category":"General Usage"},{"sentence":"Many independent films struggle to get a conventional release due to competition from major studios.","translation":"多くのインディペンデント映画は、大手スタジオとの競争のため、通常公開を得るのに苦労している。","type":"example","meaning_category":"Film Industry Context"}]}