{"word":"milfoil","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物)西洋ノコギリソウ","english_definition":"A plant of the genus Achillea, especially Achillea millefolium, having feathery leaves and clusters of small white, pink, or yellow flowers.","examples":[{"sentence":"The meadow was filled with milfoil and other wildflowers.","translation":"その牧草地は西洋ノコギリソウや他の野花でいっぱいだった。"},{"sentence":"Milfoil has been used in traditional medicine for its anti-inflammatory properties.","translation":"西洋ノコギリソウは、その抗炎症作用のために伝統医学で使用されてきた。"}],"collocations":["common milfoil","water milfoil","yarrow (synonym)"],"synonyms":["yarrow"],"antonyms":[]},{"part_of_speech":"noun","definition":"(植物)オオフサモ (水生植物)","english_definition":"A plant of the genus Myriophyllum, especially Myriophyllum aquaticum (parrot's feather) or Myriophyllum spicatum (Eurasian watermilfoil).","examples":[{"sentence":"Eurasian watermilfoil is an invasive species that can clog waterways.","translation":"オオフサモは、水路を詰まらせる可能性のある侵略的外来種である。"},{"sentence":"Divers worked to remove the milfoil from the lake.","translation":"ダイバーたちは湖からオオフサモを除去するために働いた。"}],"collocations":["Eurasian watermilfoil","parrot's feather"],"synonyms":["watermilfoil"],"antonyms":[]}],"etymology":{"value":"Derived from Latin 'millefolium', meaning 'thousand-leaved', referring to the finely divided leaves of the plant.","priority":"★★☆"},"pronunciation":{"ipa":"ˈmɪlfɔɪl","syllables":"mil-foil"},"inflection":{"noun_plural":"milfoils"},"usage_notes":{"explanation":"The term 'milfoil' can refer to plants in the genus Achillea (yarrows) or the genus Myriophyllum (watermilfoils). When referring to yarrows, 'milfoil' and 'yarrow' are often used interchangeably. When referring to watermilfoils, the term 'watermilfoil' is more common to avoid ambiguity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"I planted milfoil in my aquarium.","correct":"I planted watermilfoil in my aquarium.","note":"If you are planting an aquatic plant, specify 'watermilfoil' to avoid confusion with yarrow."}],"priority":"★☆☆"},"related_words":{"derivatives":["millefoliate (adjective: having many leaves)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Milfoil' is a botanical term referring to specific plants with finely divided leaves. It can refer to both terrestrial yarrows (Achillea) and aquatic watermilfoils (Myriophyllum). The term is relatively uncommon in general conversation and is more likely to be encountered in botanical or ecological contexts. When using the term, it is important to be aware of the potential for ambiguity and to provide clarifying information if necessary."},"example_sentences":[{"sentence":"The herbalist recommended a tea made from milfoil to soothe inflammation.","translation":"その薬草家は、炎症を鎮めるために西洋ノコギリソウで作られたお茶を勧めた。","type":"noun","meaning_category":"西洋ノコギリソウ"},{"sentence":"The spread of Eurasian watermilfoil has become a major concern for lake managers.","translation":"オオフサモの蔓延は、湖の管理者にとって大きな懸念事項となっている。","type":"noun","meaning_category":"オオフサモ"}]}