{"word":"sustainingly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"持続的に、維持するように、環境に配慮して","english_definition":"in a manner that can be maintained or continued for a long time; in an environmentally responsible way.","examples":[{"sentence":"The project was designed to operate sustainingly for future generations.","translation":"そのプロジェクトは、将来の世代のために持続的に運営されるように設計されました。"},{"sentence":"We must manage our resources more sustainingly.","translation":"私たちはより持続的に資源を管理しなければなりません。"},{"sentence":"The company aims to grow sustainingly without harming the environment.","translation":"その会社は環境を害することなく、持続的に成長することを目指しています。"}],"collocations":["live sustainingly (持続可能な生活を送る)","manage resources sustainingly (資源を持続的に管理する)","grow sustainingly (持続的に成長する)","develop sustainingly (持続的に発展する)"],"synonyms":["durably","enduringly","constantly","eco-friendly","environmentally"],"antonyms":["unsustainably","temporarily","fleetingly"]}],"etymology":{"value":"The word 'sustainingly' is derived from the verb 'sustain,' which comes from the Old French 'sostenir' (to hold up, maintain), and ultimately from the Latin 'sustinere' (to hold up from below). The suffix '-ingly' turns it into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/səˈsteɪnɪŋli/","syllables":"suh-stain-ing-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Sustainingly' is used to describe actions or processes that are carried out in a way that can be maintained over the long term, often with consideration for environmental impact. It's commonly used in discussions about environmentalism, resource management, and long-term planning. It emphasizes the ability to continue something without depleting resources or causing harm.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The building was sustainingly built.","correct":"✓ The building was sustainably built.","note":"'Sustainingly' describes the *manner* in which something is done, not the *state* of something.  'Sustainably' is more appropriate when referring to the qualities of the building itself. However, 'The building was built sustainingly' could be correct if it refers to the building process itself being carried out in a sustainable manner."},{"incorrect":"✗ He lived a sustainingly life.","correct":"✓ He lived a sustainable life. / ✓ He lived sustainingly.","note":"'Sustainable' is an adjective that describes the *type* of life. 'Sustainingly' is an adverb that describes *how* he lived. The first correction is more common."}],"priority":"★★☆"},"related_words":{"derivatives":["sustain (verb)","sustainable (adjective)","sustainability (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sustainingly' is an adverb that means 'in a way that can be maintained over a long period.' It's often used in the context of environmental conservation and responsible resource management. This word is not commonly used in everyday conversation and is more likely to be found in formal writing or discussions about sustainability and environmental issues. Therefore, it is considered a C1 level word."},"example_sentences":[{"sentence":"The company is working to source its materials more sustainingly.","translation":"その会社は、より持続可能な方法で材料を調達しようと努めています。","type":"adverb","meaning_category":"持続的に"},{"sentence":"We need to develop our economies more sustainingly to protect the planet.","translation":"地球を守るためには、経済をより持続的に発展させる必要があります。","type":"adverb","meaning_category":"持続的に"},{"sentence":"The farm operates sustainingly, using renewable energy and organic practices.","translation":"その農場は、再生可能エネルギーと有機農法を用いて持続的に運営されています。","type":"adverb","meaning_category":"持続的に"}]}