{"word":"polysemeia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(言語学)多義性：一つの語が複数の意味を持つこと。","english_definition":"(linguistics) polysemy: the coexistence of many possible meanings for a word or phrase.","examples":[{"sentence":"Polysemeia is common in natural languages, where words often develop multiple related meanings over time.","translation":"多義性は自然言語で一般的であり、単語は時間とともに複数の関連する意味を発展させることが多い。"},{"sentence":"The word 'bank' exhibits polysemeia, referring to both a financial institution and the side of a river.","translation":"「bank」という単語は多義性を示し、金融機関と川の側面の両方を指します。"}],"collocations":["lexical polysemeia","semantic polysemeia","instances of polysemeia","examples of polysemeia"],"synonyms":["polysemy","multiple meaning","semantic ambiguity"],"antonyms":["monosemy (一義性)"]}],"etymology":{"value":"From Ancient Greek πολυσημεία (polusēmeía), from πολύς (polús, “many”) + σῆμα (sêma, “sign”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɒlɪsiˈmiːə/","syllables":"po-ly-se-mei-a"},"inflection":{"noun_plural":"polysemeias"},"usage_notes":{"explanation":"\"Polysemeia\" refers to the phenomenon in linguistics where a single word has multiple related meanings. It's important to distinguish it from homonymy, where words have the same form but unrelated meanings (e.g., 'bat' meaning a flying mammal or a piece of sports equipment). In polysemeia, the different meanings are connected in some way, often through historical development or metaphorical extension.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The word has a lot of meanings, so it's homonymy.","correct":"✓ The word has a lot of related meanings, so it's polysemy.","note":"Polysemy involves related meanings, while homonymy involves unrelated meanings."}],"priority":"★★☆"},"related_words":{"derivatives":["polysemous (多義的な)","polyseme (多義語)"],"related_concepts":["homonymy (同音異義)","homography (同形異義)","semantic field (意味領域)","lexical ambiguity (語彙的曖昧性)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Polysemeia\" is a technical term used in linguistics to describe the situation where a single word has multiple related meanings. This is different from homonymy, where words have the same form but unrelated meanings. Understanding polysemeia is important for analyzing how language evolves and how meanings are extended and related to each other."},"example_sentences":[{"sentence":"The study of polysemeia helps us understand the evolution of word meanings.","translation":"多義性の研究は、単語の意味の進化を理解するのに役立ちます。","type":"general","meaning_category":"linguistics"},{"sentence":"The polysemeia of the word 'bright' allows it to refer to both light and intelligence.","translation":"「bright」という単語の多義性により、光と知性の両方を指すことができます。","type":"example","meaning_category":"linguistics"}]}