{"word":"Ametabolism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"無変態：昆虫の成長様式の一つで、幼虫、蛹の段階を経ずに、孵化した幼虫が脱皮を繰り返して徐々に成虫の形に近づくもの。","english_definition":"A type of insect development in which the young resemble the adults and undergo a series of molts without distinct larval or pupal stages.","examples":[{"sentence":"Silverfish exhibit ametabolism, with young nymphs resembling smaller versions of the adults.","translation":"シミは無変態を示し、若いニンフは成虫の小型版に似ています。"}],"collocations":["exhibit ametabolism","show ametabolism","ametabolous insect"],"synonyms":["direct development","incomplete metamorphosis"],"antonyms":["hemimetabolism","holometabolism"]}],"etymology":{"value":"The term 'ametabolism' is derived from the Greek words 'a-' (meaning 'without'), 'meta-' (meaning 'change'), and '-bolism' (referring to metabolism or change). Thus, it literally means 'without change' or 'without metamorphosis'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌeɪˌmɛtəˈbɒlɪzəm/","syllables":"a-me-ta-bo-lism"},"inflection":{"noun_plural":"Ametabolisms"},"usage_notes":{"explanation":"Ametabolism is one of the basic types of insect development. Insects that undergo ametabolism are called ametabolous insects. The young, called nymphs, hatch from eggs and resemble smaller, wingless versions of the adults. They grow and molt, gradually increasing in size, until they reach the adult stage. There is no distinct larval or pupal stage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Ametabolism involves a pupal stage.","correct":"✓ Ametabolism does not involve a pupal stage.","note":"Ametabolism is characterized by the absence of a pupal stage. Insects with complete metamorphosis have a pupal stage."}],"priority":"★★☆"},"related_words":{"derivatives":["ametabolous (adjective)"],"related_terms":["hemimetabolism","holometabolism","metamorphosis","nymph"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Ametabolism is a term used in entomology to describe a specific type of insect development. It is characterized by the absence of distinct larval and pupal stages. The young nymphs resemble smaller versions of the adults and gradually grow through molting. This term is primarily used in scientific contexts and may not be commonly encountered in everyday language. Understanding this term requires a basic knowledge of insect biology and development.","translation":"無変態は、昆虫学で使用される用語で、特定のタイプの昆虫の発生を説明します。幼虫期と蛹期がないことが特徴です。若いニンフは成虫の小型版に似ており、脱皮を通じて徐々に成長します。この用語は主に科学的な文脈で使用され、日常言語では一般的に遭遇しない場合があります。この用語を理解するには、昆虫の生物学と発生に関する基本的な知識が必要です。"},"example_sentences":[{"sentence":"Silverfish are a classic example of insects that undergo ametabolism.","translation":"シミは、無変態を行う昆虫の典型的な例です。","type":"general","meaning_category":"insect development"},{"sentence":"In ametabolism, the nymphs and adults often share the same habitat and food sources.","translation":"無変態では、ニンフと成虫が同じ生息地と食物源を共有することがよくあります。","type":"general","meaning_category":"insect development"}],"japanese_reading":"むへんたい","japanese_word":"無変態"}