{"word":"Nonnocturnally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"Not nocturnally; not in a nocturnal manner.","english_definition":"In a way that is not nocturnal; not during the night.","examples":[{"sentence":"The bird species is active nonnocturnally, primarily during daylight hours.","translation":"その鳥類は非夜行性であり、主に日中の時間帯に活動する。"},{"sentence":"The plant's flowers open nonnocturnally, attracting daytime pollinators.","translation":"その植物の花は非夜行性で開き、日中に受粉媒介者を惹きつける。"}],"collocations":["active nonnocturnally","blooming nonnocturnally"],"synonyms":["diurnally","by day","in daylight"],"antonyms":["nocturnally","at night"]},{"part_of_speech":"adjective","definition":"Not nocturnal.","english_definition":"Not active or occurring during the night.","examples":[{"sentence":"The nonnocturnally active animal forages during the day.","translation":"その非夜行性の動物は日中に餌を探す。"}],"collocations":["nonnocturnally active","nonnocturnally blooming"],"synonyms":["diurnal"],"antonyms":["nocturnal"]}],"etymology":{"value":"Formed by adding the prefix \"non-\" (meaning \"not\") to the adverb \"nocturnally\".","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn.nɒkˈtɜːnəli/","syllables":"non-noc-tur-nal-ly"},"inflection":{"notes":"Since this word can function as both an adverb and an adjective, it does not have typical inflectional forms (like comparative or superlative)."},"usage_notes":{"explanation":"\"Nonnocturnally\" is a relatively rare word used to describe activities or behaviors that do not occur at night. It is most often used in scientific or descriptive contexts when specifying that something is active or occurs during the day rather than at night.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The flower blooms non-nocturnally.","correct":"✓ The flower blooms nonnocturnally.","note":"The prefix \"non-\" should be attached directly to the word without a hyphen unless clarity requires it or it precedes a proper noun."}],"priority":"★☆☆"},"related_words":{"derivatives":["nocturnal","nocturnally","diurnal"],"antonyms":["nocturnally"],"related_terms":["crepuscular","matutinal","vespertine"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"nonnocturnally\" is a specialized term primarily used in scientific or technical contexts. It is formed by adding the prefix \"non-\" to \"nocturnally,\" indicating the opposite of nocturnal behavior or activity. Understanding this word requires familiarity with scientific vocabulary and the ability to recognize prefixes and suffixes. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"Many insects are nonnocturnally active, relying on sunlight for navigation and warmth.","translation":"多くの昆虫は非夜行性であり、ナビゲーションと暖かさのために日光に頼っている。","type":"adverb","meaning_category":"Not at night"},{"sentence":"The researchers observed the animals foraging nonnocturnally in the open fields.","translation":"研究者たちは、動物たちが開けた野原で非夜行的に餌を探しているのを観察した。","type":"adverb","meaning_category":"Not at night"}]}