{"word":"salacities","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"わいせつさ、好色さ、みだらなこと","english_definition":"Obscene or lascivious qualities, behavior, or language.","examples":[{"sentence":"The novel was criticized for its salacities.","translation":"その小説はわいせつさで批判された。"},{"sentence":"The play was full of salacities that shocked the audience.","translation":"その劇は観客を驚かせるようなみだらなことでいっぱいだった。"}],"collocations":["sexual salacities","literary salacities"],"synonyms":["lewdness","obscenity","lasciviousness","licentiousness","pornography","smut"],"antonyms":["decency","purity","modesty"]}],"etymology":{"value":"Derived from the Latin word 'salax,' meaning 'lustful' or 'lecherous.'","priority":"★★☆"},"pronunciation":{"ipa":"/səˈlæsətiz/","syllables":"sa-lac-i-ties"},"inflection":{"noun_plural":"salacities (already plural, referring to multiple instances or qualities)"},"usage_notes":{"explanation":"'Salacities' refers to the quality of being obscene or excessively sexual. It is often used in a critical context to describe something that is considered morally offensive due to its explicit or suggestive nature. The word is relatively formal and not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The salacity of the weather made everyone happy.","correct":"✓ The pleasant weather made everyone happy.","note":"'Salacity' refers to sexual or obscene content, not general pleasantness."},{"incorrect":"✗ He showed great salacity in his business dealings.","correct":"✓ He showed great shrewdness in his business dealings.","note":"'Salacity' does not mean shrewdness or cleverness."}],"priority":"★★☆"},"related_words":{"derivatives":["salacious (adjective: lustful, lecherous, obscene)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'salacities' is a relatively uncommon and formal term used to describe obscene or excessively sexual qualities or behaviors. It is most often encountered in literary criticism or discussions of censorship and morality. Due to its specialized usage and relatively low frequency, it is considered an advanced vocabulary word. Understanding this word requires a strong grasp of abstract concepts related to morality and sexuality."},"example_sentences":[{"sentence":"The film's gratuitous salacities detracted from its artistic merit.","translation":"その映画の不必要なわいせつさは、芸術的な価値を損なった。","type":"noun","meaning_category":"わいせつさ"},{"sentence":"The report detailed the salacities found in the online chat rooms.","translation":"その報告書は、オンラインチャットルームで見つかったわいせつな内容を詳述した。","type":"noun","meaning_category":"みだらなこと"}]}