{"word":"fetting","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(繊維産業で)羊毛などの洗浄・油付けの工程、またはその工程で除去される不純物","english_definition":"The process of cleaning and oiling wool or other fibers in the textile industry; also, the impurities removed during this process.","examples":[{"sentence":"The fetting process is crucial for preparing the wool for spinning.","translation":"洗浄・油付けの工程は、羊毛を紡績する準備のために非常に重要です。"},{"sentence":"The fetting removed a significant amount of dirt and vegetable matter from the fleece.","translation":"洗浄・油付けによって、フリースからかなりの量の汚れや植物性の物質が除去されました。"}],"collocations":["wool fetting","fleece fetting","fetting process","remove fetting"],"synonyms":["cleaning","scouring","degreasing"],"antonyms":[]},{"part_of_speech":"verb","definition":"(羊毛などを)洗浄・油付けする (fettの現在分詞)","english_definition":"Present participle of 'fett': to clean and oil wool or other fibers.","examples":[{"sentence":"They are fetting the wool to remove impurities and add lanolin.","translation":"彼らは不純物を取り除きラノリンを加えるために羊毛を洗浄・油付けしています。"}],"collocations":["fetting wool","fetting fleece"],"synonyms":["cleaning","scouring","degreasing"],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'fett', which comes from Middle English 'fette', meaning to prepare or clean. Related to the Old English word 'fæt', meaning fat or grease, referring to the oiling process.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɛtɪŋ/","syllables":"fet-ting"},"inflection":{"verb_forms":{"present_participle":"fetting"}},"usage_notes":{"explanation":"'Fetting' is a specialized term primarily used in the context of the textile industry, specifically relating to the processing of wool and other fibers. It refers to the cleaning and oiling stages that are essential for preparing the fibers for spinning and weaving. The term is less commonly encountered outside of this specific industry.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm fetting ready for the party.","correct":"✓ I'm getting ready for the party.","note":"'Fetting' (related to textile cleaning) should not be confused with 'getting' (becoming)."},{"incorrect":"✗ The fett was removed from the wool.","correct":"✓ The fetting was removed from the wool.","note":"'Fetting' is the process or the removed material; 'fett' is the base verb, rarely used in modern English."}],"priority":"★★☆"},"related_words":{"derivatives":["fett (verb: to clean and oil wool)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Fetting' is a technical term used in the textile industry, specifically related to the processing of wool and other fibers. It refers to the cleaning and oiling stages that are essential for preparing the fibers for spinning and weaving. Due to its specialized nature, it is not commonly encountered in general English usage. Understanding this term requires familiarity with textile manufacturing processes."},"example_sentences":[{"sentence":"The **fetting** process ensures the removal of impurities from the raw wool.","translation":"洗浄・油付けの工程は、生の羊毛から不純物を取り除くことを保証します。","type":"noun","meaning_category":"洗浄・油付けの工程"},{"sentence":"The workers were **fetting** the wool, preparing it for the next stage of production.","translation":"作業員たちは羊毛を洗浄・油付けしており、次の生産段階の準備をしていた。","type":"verb","meaning_category":"洗浄・油付けする"}]}