{"word":"Owlishness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"フクロウのような性質、フクロウに似ていること、またはフクロウのような様子","english_definition":"The quality or state of being owlish; resembling or characteristic of an owl.","examples":[{"sentence":"His owlishness was accentuated by the thick glasses perched on his nose.","translation":"彼のフクロウのような様子は、鼻にかけている分厚い眼鏡によって強調されていた。"},{"sentence":"The professor's owlishness made him seem wise and knowledgeable.","translation":"教授のフクロウのような様子は、彼を賢く知識が豊富なように見せた。"},{"sentence":"There was an air of owlishness about the old library, with its hushed atmosphere and serious readers.","translation":"静まり返った雰囲気と真剣な読者がいる古い図書館には、フクロウのような雰囲気がある。"}],"collocations":["exhibit owlishness","an air of owlishness","perceived owlishness"],"synonyms":["solemnity","seriousness","wisdom (implied)","studiousness (implied)","gravity"],"antonyms":["frivolity","lightheartedness","silliness"]},{"part_of_speech":"noun","definition":"（比喩的に）賢明さ、思慮深さ、または学識があるように見えること","english_definition":"(Figuratively) An appearance of wisdom, thoughtfulness, or erudition.","examples":[{"sentence":"He affected an owlishness that belied his actual ignorance of the subject.","translation":"彼はその主題に対する実際の無知を覆い隠すために、賢明な様子を装った。"},{"sentence":"Her owlishness during the debate impressed the audience, even though she was just reciting facts.","translation":"討論中の彼女の賢明な様子は、彼女が単に事実を暗唱しているだけであっても、聴衆を感銘させた。"}],"collocations":["affect owlishness","feign owlishness","display owlishness"],"synonyms":["pretentiousness","affectation","sanctimoniousness","pompousness"],"antonyms":["genuineness","sincerity","authenticity"]}],"etymology":{"value":"Derived from 'owlish' (resembling an owl), which comes from 'owl' + '-ish' (suffix indicating resemblance or characteristic).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈaʊlɪʃnəs/","syllables":"owl-ish-ness"},"inflection":{"noun_plural":"owlishnesses (rarely used)"},"usage_notes":{"explanation":"'Owlishness' generally refers to qualities associated with owls, such as a serious or wise demeanor, often linked to their large eyes and nocturnal habits. It can also imply a studious or scholarly appearance. The term is not commonly used in everyday conversation but is more often found in descriptive writing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a strong owlishness about the party.","correct":"✓ He had an air of owlishness about him.","note":"'Owlishness' describes a quality or state, not a physical presence at a location. Use it to describe someone's demeanor or appearance."},{"incorrect":"✗ The owlishness made the room dark.","correct":"✓ The dim lighting contributed to the owlish atmosphere of the room.","note":"'Owlishness' is not a direct cause of physical attributes like darkness. It's a characteristic or atmosphere."}],"priority":"★☆☆"},"related_words":{"derivatives":["owlish (adjective)","owl (noun)"],"phrases":["wise as an owl (idiom)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Owlishness' is a relatively uncommon word that describes the quality of resembling an owl, often in terms of appearance or demeanor. It suggests a serious, studious, or wise-looking quality. The word is more likely to be encountered in literature or descriptive writing rather than everyday conversation. Understanding the word requires a good vocabulary and an appreciation of figurative language."},"example_sentences":[{"sentence":"The librarian's **owlishness** was enhanced by her spectacles and quiet demeanor.","translation":"司書のフクロウのような様子は、彼女の眼鏡と静かな態度によって強調されていた。","type":"general","meaning_category":"フクロウのような性質"},{"sentence":"He tried to project an air of **owlishness** to impress his colleagues.","translation":"彼は同僚に感銘を与えるために、賢明な様子を装おうとした。","type":"figurative","meaning_category":"賢明さの表れ"},{"sentence":"The museum's hushed atmosphere and dim lighting contributed to its overall **owlishness**.","translation":"博物館の静まり返った雰囲気と薄暗い照明が、全体的なフクロウのような雰囲気に貢献していた。","type":"general","meaning_category":"フクロウのような性質"}]}