{"word":"dendrachate","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"樹枝状模様のある瑪瑙","english_definition":"A variety of agate containing inclusions of dendritic minerals, giving it a plant-like appearance.","examples":[{"sentence":"The dendrachate gemstone was prized for its unique, natural patterns.","translation":"その樹枝状瑪瑙の宝石は、その独特な自然の模様で珍重された。"}],"collocations":["dendrachate pendant","dendrachate slice","dendrachate jewelry"],"synonyms":["moss agate","tree agate"],"antonyms":[]}],"etymology":{"value":"From the Greek words δένδρον (dendron) meaning 'tree' and ἀχάτης (achates) referring to agate.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɛndrəˈkeɪt/","syllables":"den-dra-chate"},"inflection":{"noun_plural":"dendrachates"},"usage_notes":{"explanation":"Dendrachate is a type of agate distinguished by its branching, tree-like inclusions. These inclusions are typically composed of iron or manganese oxides. It is often used in jewelry and ornamental objects.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I found a dendrachate rock on the beach.","correct":"✓ I found a dendrachate agate on the beach.","note":"Dendrachate is a specific type of agate, so it's more precise to call it a dendrachate agate rather than just a rock."}],"priority":"★☆☆"},"related_words":{"derivatives":["dendritic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Dendrachate is a specialized term in geology and gemology, referring to a specific type of agate with dendritic inclusions. Its usage is primarily limited to contexts involving mineralogy, gem collecting, and jewelry design. Understanding requires familiarity with geological terminology.","priority":"★☆☆"},"example_sentences":[{"sentence":"The museum displayed a stunning collection of dendrachate specimens.","translation":"博物館は見事な樹枝状瑪瑙の標本コレクションを展示した。","type":"noun","meaning_category":"gemstone"},{"sentence":"She wore a beautiful dendrachate necklace.","translation":"彼女は美しい樹枝状瑪瑙のネックレスを身に着けていた。","type":"noun","meaning_category":"jewelry"}]}