{"word":"entrancer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"魅了する人、魅惑的な人","english_definition":"A person who entrances; someone who fills you with wonder and delight.","examples":[{"sentence":"She was a natural entrancer, captivating everyone she met with her charm.","translation":"彼女は生まれつき人を魅了する人で、会う人すべてをその魅力で虜にした。"},{"sentence":"The magician was a skilled entrancer, holding the audience spellbound with his tricks.","translation":"そのマジシャンは熟練した魅了者で、その手品で観客を魅了した。"}],"collocations":["natural entrancer","skilled entrancer","master entrancer"],"synonyms":["charmer","enchanter","captivator","fascinator","magician"],"antonyms":["bore","repeller"]}],"etymology":{"value":"Derived from the verb 'entrance,' meaning 'to fill with delight and wonder,' with the suffix '-er' indicating a person who performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈtrænsər/","syllables":"in-tranc-er"},"inflection":{"noun_plural":"entrancers"},"usage_notes":{"explanation":"'Entrancer' is a relatively uncommon word, typically used to describe someone with a captivating or magical quality. It emphasizes the person's ability to enchant and delight others.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an entrancer actor.","correct":"✓ He is an entrancing actor.","note":"'Entrancer' is a noun (a person), while 'entrancing' is an adjective (describing a quality)."},{"incorrect":"✗ The entrancer of the building was grand.","correct":"✓ The entrance of the building was grand.","note":"'Entrancer' (a person who entrances) should not be confused with 'entrance' (a way in)."}],"priority":"★★☆"},"related_words":{"derivatives":["entrance (verb, noun)","entrancing (adjective)","entranced (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Entrancer' is a rare word used to describe someone who has the ability to charm and fascinate others. It is derived from the verb 'entrance,' meaning to fill with delight and wonder. This word is not commonly used in everyday conversation and is more likely to be found in literature or formal writing. Understanding its meaning requires a good vocabulary and an appreciation for nuanced language."},"example_sentences":[{"sentence":"The singer was a true entrancer, captivating the audience with her powerful voice.","translation":"その歌手は真の魅了者で、その力強い歌声で観客を魅了した。","type":"noun","meaning_category":"魅了する人"},{"sentence":"As a storyteller, he was an entrancer, weaving tales that transported his listeners to other worlds.","translation":"ストーリーテラーとして、彼は魅了する人で、聞き手を別の世界に連れて行く物語を紡ぎ出した。","type":"noun","meaning_category":"魅了する人"},{"sentence":"She was known as an entrancer, able to win over even the most skeptical individuals.","translation":"彼女は人を魅了する人として知られており、最も懐疑的な人でさえも味方にすることができた。","type":"noun","meaning_category":"魅了する人"}]}