{"word":"unatoning","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"償いをしない、罪滅ぼしをしない、贖罪しない","english_definition":"not making amends or reparations; not expiating or atoning for wrongdoing.","examples":[{"sentence":"His unatoning actions caused lasting damage to the community.","translation":"彼の償いをしない行動は、地域社会に永続的な損害を与えた。"},{"sentence":"The unatoning corporation continued to pollute the river despite public outcry.","translation":"その罪滅ぼしをしない企業は、世間の非難にもかかわらず、川を汚染し続けた。"},{"sentence":"She remained unatoning for her past mistakes, refusing to acknowledge the harm she had caused.","translation":"彼女は過去の過ちに対する罪滅ぼしをせず、自分が与えた害を認めようとしなかった。"}],"collocations":["unatoning behavior","unatoning actions","unatoning attitude","remain unatoning"],"synonyms":["unrepentant","unapologetic","remorseless","impenitent","uncontrite"],"antonyms":["atoning","repentant","apologetic","remorseful","contrite"]}],"etymology":{"value":"The word is formed by adding the prefix 'un-' (meaning 'not') to 'atoning,' which is the present participle of the verb 'atone.' 'Atone' itself comes from 'at one,' signifying the act of reconciliation or making amends. Thus, 'unatoning' literally means 'not making at one' or 'not reconciling.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnəˈtoʊnɪŋ/","syllables":"un-a-ton-ing"},"inflection":{"notes":"This is an adjective, so it can be modified by adverbs (e.g., 'very unatoning') but does not have different forms for tense or number."},"usage_notes":{"explanation":"'Unatoning' is used to describe someone or something that does not attempt to make amends for a wrong or injury. It often implies a lack of remorse or responsibility for the negative consequences of one's actions. The term can carry a strong moral judgment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was unatoning to his family.","correct":"✓ He was unatoning towards his family. / ✓ He showed unatoning behavior towards his family.","note":"While 'unatoning' can describe a person, it often modifies actions or attitudes. If describing a person's behavior towards someone, use 'towards' or rephrase to focus on the behavior itself."},{"incorrect":"✗ The company made an unatoning statement.","correct":"✓ The company made an unapologetic statement. / ✓ The company remained unatoning.","note":"'Unatoning' describes a state of not making amends, rather than the quality of a statement. 'Unapologetic' is more appropriate to describe a statement that does not express remorse. To use 'unatoning' correctly, focus on the lack of action to make amends."}],"priority":"★★☆"},"related_words":{"derivatives":["atone (verb: to make amends or reparation)","atonement (noun: reparation for a wrong or injury)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. This is a relatively uncommon word.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unatoning' is a relatively advanced word that describes a lack of effort to make amends for a wrong. It is often used in formal or literary contexts to express moral disapproval or condemnation. Understanding the root word 'atone' and the negative prefix 'un-' is helpful in grasping its meaning. This word is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The politician's unatoning stance on the issue led to widespread protests.","translation":"その政治家の問題に対する償いをしない姿勢は、広範な抗議につながった。","type":"adjective","meaning_category":"lack of remorse"},{"sentence":"Despite the evidence, the defendant remained unatoning, denying any involvement in the crime.","translation":"証拠にもかかわらず、被告は罪滅ぼしをせず、犯罪への関与を否定した。","type":"adjective","meaning_category":"refusal to make amends"},{"sentence":"The company's unatoning disregard for environmental regulations resulted in severe penalties.","translation":"その企業の環境規制に対する償いをしない無視は、厳しい罰則をもたらした。","type":"adjective","meaning_category":"failure to repair damage"}]}