{"word":"philology","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"文献学、文献研究、言語学","english_definition":"the branch of knowledge that deals with the structure, historical development, and relationships of a language or languages.","examples":[{"sentence":"He is a professor of philology at the university.","translation":"彼は大学の文献学の教授です。"},{"sentence":"Philology helps us understand the evolution of words.","translation":"文献学は、単語の進化を理解するのに役立ちます。"},{"sentence":"The philology of ancient texts is a complex field.","translation":"古代テキストの文献学は複雑な分野です。"}],"collocations":["historical philology","comparative philology","classical philology"],"synonyms":["linguistics","language study","historical linguistics","textual criticism"],"antonyms":[]}],"etymology":{"value":"From Greek 'philologia' (φιλολογία) meaning 'love of learning and literature', from 'philos' (φίλος) meaning 'loving' and 'logos' (λόγος) meaning 'word, reason'.","priority":"★★★"},"pronunciation":{"ipa":"/fɪˈlɒlədʒi/","syllables":"phi-lol-o-gy"},"inflection":{"noun_plural":"philologies"},"usage_notes":{"explanation":"Philology is often used to describe the study of language in written historical sources; it is a combination of literary study, history, and linguistics. It is particularly useful for understanding older languages and texts. While sometimes used interchangeably with 'linguistics', philology often has a greater emphasis on historical and textual analysis.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I am studying philology because I like to speak many languages.","correct":"✓ I am studying philology because I am interested in the history of languages and texts.","note":"Philology is not simply about speaking languages, but about the study of their history and development through written sources."}],"priority":"★★☆"},"related_words":{"derivatives":["philological (adjective)","philologist (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Philology is a specialized field of study that focuses on the historical development of languages and their relationships, often through the analysis of written texts. It's a more academic term than 'linguistics' and is typically used in the context of studying ancient or historical languages and literature. Understanding philology requires a strong grasp of history, literature, and language theory."},"example_sentences":[{"sentence":"The professor's expertise lies in the philology of ancient Greek.","translation":"その教授の専門は古代ギリシャの文献学です。","type":"general","meaning_category":"文献学"},{"sentence":"Philology can reveal insights into the cultural context of old manuscripts.","translation":"文献学は、古い写本の文化的背景に関する洞察を明らかにすることができます。","type":"general","meaning_category":"文献学"},{"sentence":"Comparative philology studies the relationships between different languages.","translation":"比較文献学は、異なる言語間の関係を研究します。","type":"specific","meaning_category":"文献学"}]}