{"word":"Amphionic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(化学)両性イオンの、双性イオンの","english_definition":"Relating to or having the characteristics of a zwitterion (a molecule or ion having separate positively and negatively charged groups).","examples":[{"sentence":"Amphionic compounds are important in biochemistry.","translation":"両性イオン化合物は生化学において重要である。"},{"sentence":"The amphionic nature of amino acids allows them to act as both acids and bases.","translation":"アミノ酸の両性イオンとしての性質により、酸としても塩基としても作用できる。"}],"collocations":["amphionic compound","amphionic amino acid","amphionic properties"],"synonyms":["zwitterionic","amphoteric"],"antonyms":[]}],"etymology":{"value":"Derived from the combination of 'amphi-' (meaning 'both' or 'dual') and 'ionic' (relating to ions), indicating the presence of both positive and negative charges within the same molecule.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæmfiˈɒnɪk/","syllables":"Am-phi-on-ic"},"inflection":{"notes":"This is an adjective, so it has no plural form."},"usage_notes":{"explanation":"'Amphionic' describes a molecule or compound that exists as a zwitterion, possessing both positive and negative charges on different atoms within the same molecule. This term is primarily used in chemistry and biochemistry to describe the behavior of certain molecules, such as amino acids in specific pH conditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The solution was amphionic, so it only acted as an acid.","correct":"✓ The solution was amphoteric, so it could act as both an acid and a base.","note":"'Amphionic' specifically refers to the zwitterionic nature of a molecule, while 'amphoteric' describes a substance that can act as both an acid and a base. While related, they are not interchangeable."}],"priority":"★★☆"},"related_words":{"derivatives":["amphion (noun, rare)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Amphionic' is a technical term used in chemistry, specifically to describe molecules that exist as zwitterions. It is not commonly used outside of scientific contexts. Understanding the concept of zwitterions is necessary to grasp the meaning of 'amphionic.'"},"example_sentences":[{"sentence":"The amphionic surfactant was effective at stabilizing the emulsion.","translation":"その両性イオン界面活性剤は、エマルションの安定化に効果的だった。","type":"adjective","meaning_category":"両性イオンの"},{"sentence":"Glycine is an example of an amphionic amino acid.","translation":"グリシンは両性イオン性アミノ酸の一例である。","type":"adjective","meaning_category":"両性イオンの"}]}