{"word":"drupe","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"核果（かくか）：果皮が外果皮、中果皮、内果皮の3層に分かれ、内果皮が硬い核となる果実。","english_definition":"A fleshy fruit with thin skin and a central stone containing the seed, such as a plum, cherry, almond, or olive.","examples":[{"sentence":"A cherry is a drupe.","translation":"サクランボは核果です。"},{"sentence":"Peaches and plums are examples of drupes.","translation":"モモやスモモは核果の例です。"},{"sentence":"The olive is a drupe with a single seed.","translation":"オリーブは種が一つ入った核果です。"}],"collocations":["fleshy drupe","stone fruit","single-seeded drupe"],"synonyms":["stone fruit"],"antonyms":[]}],"etymology":{"value":"From the Latin word 'drupa', meaning overripe olive.","priority":"★★☆"},"pronunciation":{"ipa":"/druːp/","syllables":"drupe"},"inflection":{"noun_plural":"drupes"},"usage_notes":{"explanation":"A drupe is a type of fruit characterized by its structure: an outer skin (exocarp), a fleshy middle layer (mesocarp), and a hard, stony inner layer (endocarp) that surrounds the seed. This inner layer is often referred to as the 'stone' or 'pit'. Drupes are typically formed from a single carpel and contain one seed, although some drupes may have multiple seeds.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ A tomato is a drupe because it has seeds.","correct":"✓ A tomato is a berry because it has many seeds inside the fleshy fruit.","note":"While tomatoes have seeds, they are classified as berries due to the presence of multiple seeds within the fleshy fruit, unlike drupes which typically have a single seed enclosed in a hard pit."},{"incorrect":"✗ All fruits with pits are drupes.","correct":"✓ Fruits with a single seed enclosed in a hard pit are drupes.","note":"The presence of a pit is a key characteristic of drupes, but it must also have a fleshy outer layer and typically only one seed."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["berry","pome","fruit","exocarp","mesocarp","endocarp","seed","pit","stone fruit"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'drupe' is a botanical term used to classify a specific type of fruit. It is not commonly used in everyday language but is important in botany and horticulture. Understanding the structure of a drupe (outer skin, fleshy middle, hard inner stone containing the seed) is key to understanding the term. Examples include cherries, plums, and olives.","priority":"★☆☆"},"example_sentences":[{"sentence":"The almond is a drupe, although we typically eat the seed inside the hard endocarp.","translation":"アーモンドは核果ですが、通常は硬い内果皮の中にある種子を食べます。","type":"noun","meaning_category":"botany"},{"sentence":"Many birds and mammals eat drupes and help disperse their seeds.","translation":"多くの鳥や哺乳類が核果を食べ、その種子の散布を助けます。","type":"noun","meaning_category":"ecology"},{"sentence":"Drupes are an important food source in many ecosystems.","translation":"核果は多くの生態系において重要な食料源です。","type":"noun","meaning_category":"ecology"}]}