{"word":"antipreparedness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"準備をしないこと、または準備に反対すること","english_definition":"The state of being unprepared; opposition to preparedness.","examples":[{"sentence":"The government's antipreparedness for the disaster led to widespread suffering.","translation":"政府の災害に対する準備不足が、広範囲にわたる苦しみにつながった。"},{"sentence":"His antipreparedness for the exam resulted in a failing grade.","translation":"彼の試験に対する準備不足は、不合格という結果になった。"}],"collocations":["government antipreparedness","general antipreparedness","organizational antipreparedness"],"synonyms":["unpreparedness","lack of preparation","negligence","carelessness"],"antonyms":["preparedness","readiness","foresight","planning"]}],"etymology":{"value":"'anti-' (反対) + 'preparedness' (準備)","priority":"★★★"},"pronunciation":{"ipa":"/ˌæntiˌprɪˈpeərdnəs/","syllables":"an-ti-pre-pared-ness"},"inflection":{"noun_plural":"antipreparednesses"},"usage_notes":{"explanation":"'Antipreparedness' refers to a state or condition of lacking preparation, often implying a deliberate choice or negligence in failing to prepare for foreseeable events or circumstances. It can also refer to active opposition to measures intended to improve preparedness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The antipreparedness was caused by lack of funding and planning.","correct":"✓ The antipreparedness was caused by a lack of funding and planning.","note":"Use the indefinite article 'a' before 'lack' when referring to a general instance of lacking something."},{"incorrect":"✗ He showed a great antipreparedness for the presentation.","correct":"✓ He showed great antipreparedness for the presentation. / ✓ He showed a great lack of preparation for the presentation.","note":"'Antipreparedness' is typically used as an uncountable noun. To emphasize the degree, use 'great antipreparedness' or rephrase using 'lack of preparation'."}],"priority":"★☆☆"},"related_words":{"derivatives":["unpreparedness","preparedness","prepare"],"related_terms":["negligence","omission","dereliction","laxity"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Antipreparedness' is a formal term indicating a lack of readiness or a stance against being prepared. It's often used in discussions about government policy, disaster management, or strategic planning where being ready for potential events is crucial. The word combines 'anti-' (against) with 'preparedness' (being ready), so understanding these components helps grasp its meaning. It's less common in everyday conversation but important in professional or academic contexts dealing with risk and planning."},"example_sentences":[{"sentence":"The commission investigated the reasons for the city's antipreparedness for the hurricane.","translation":"委員会は、その都市のハリケーンに対する準備不足の理由を調査した。","type":"noun","meaning_category":"lack of readiness"},{"sentence":"The senator criticized the administration's antipreparedness in dealing with the pandemic.","translation":"上院議員は、政権のパンデミックへの対応における準備不足を批判した。","type":"noun","meaning_category":"opposition to preparedness"}]}