{"word":"Wiltsey","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A type of cheese made in Wiltshire, England.","english_definition":"A type of semi-hard cheese made in Wiltshire, England, similar to Cheddar.","examples":[{"sentence":"We enjoyed a delicious ploughman's lunch with Wiltsey cheese and crusty bread.","translation":"ウィルトシーチーズと香ばしいパンを使った美味しいプラウマンズランチを楽しみました。"}],"collocations":["Wiltsey cheese","Wiltshire cheese"],"synonyms":["Wiltshire cheese","Cheddar-like cheese"],"antonyms":[]}],"etymology":{"value":"Derived from the county of Wiltshire in England, where the cheese is produced.","priority":"★★★"},"pronunciation":{"ipa":"/ˈwɪltsi/","syllables":"Wilt-sey"},"inflection":{"notes":"This is a proper noun, so it doesn't have plural forms in the same way as common nouns. It may be used attributively (e.g., Wiltsey cheese)."},"usage_notes":{"explanation":"'Wiltsey' refers specifically to a type of cheese originating from Wiltshire, England. It is known for its flavor and texture, often compared to Cheddar. It is less common than other well-known cheeses.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought some Wiltshire cheese, but it was labeled 'Wiltsey' in France.","correct":"✓ I bought some Wiltsey cheese.","note":"'Wiltsey' is the correct name for the cheese. 'Wiltshire cheese' is a more general term, but 'Wiltsey' specifically refers to the cheddar-like cheese from Wiltshire."}],"priority":"★★☆"},"related_words":{"derivatives":["Wiltshire (county)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Wiltsey' is a relatively uncommon term referring to a specific type of cheese from Wiltshire, England. Understanding this term requires some familiarity with regional cheeses and British culture. It is not a word typically encountered in everyday language.","priority":"★★★"},"example_sentences":[{"sentence":"The cheesemonger recommended the Wiltsey as a good alternative to Cheddar.","translation":"チーズ職人はチェダーの良い代替品としてウィルトシーを勧めてくれました。","type":"noun","meaning_category":"cheese"},{"sentence":"Wiltsey is often paired with apples and pears.","translation":"ウィルトシーはリンゴや梨とよく合います。","type":"noun","meaning_category":"cheese"}]}