{"word":"Homoplasy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"相同性（相同器官）ではないが、収斂進化や平行進化によって類似した形質を獲得した状態、またはその形質自体。","english_definition":"A character shared by a set of species but not present in their common ancestor. A homoplasy can arise from convergent evolution or evolutionary reversals.","examples":[{"sentence":"The wings of birds and insects are an example of homoplasy.","translation":"鳥と昆虫の翼は、ホモプラスミーの例です。"},{"sentence":"Homoplasy can make it difficult to reconstruct accurate phylogenetic trees.","translation":"ホモプラスミーは、正確な系統樹を再構築することを困難にする可能性があります。"}],"collocations":["convergent homoplasy","parallel homoplasy","evolutionary homoplasy"],"synonyms":["analogy","convergent evolution","parallel evolution"],"antonyms":["homology"]},{"part_of_speech":"noun","definition":"収斂形質","english_definition":"A trait or character state that has evolved independently in two or more lineages.","examples":[{"sentence":"The similar body shape of dolphins and sharks is due to homoplasy.","translation":"イルカとサメの類似した体型は、ホモプラスミーによるものです。"}],"collocations":["morphological homoplasy","molecular homoplasy"],"synonyms":["convergent trait","analogous structure"],"antonyms":["homologous trait"]}],"etymology":{"value":"Derived from the Greek words 'homos' (same) and 'plassein' (to mold or shape).","priority":"★★☆"},"pronunciation":{"ipa":"/hoʊməˌplæsi/","syllables":"ho-mo-plas-y"},"inflection":{"noun_plural":"Homoplasies"},"usage_notes":{"explanation":"Homoplasy refers to the development of similar traits in different lineages due to similar environmental pressures or functional needs, rather than shared ancestry. It is important to distinguish homoplasy from homology, where traits are similar due to common descent. Homoplasy can complicate phylogenetic analyses because it can lead to the incorrect inference of relationships between species.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Homoplasy is the same as homology.","correct":"✓ Homoplasy is different from homology.","note":"Homoplasy and homology are distinct concepts. Homoplasy refers to similar traits due to convergent evolution, while homology refers to similar traits due to shared ancestry."},{"incorrect":"✗ Homoplasy always indicates a close evolutionary relationship.","correct":"✓ Homoplasy does not necessarily indicate a close evolutionary relationship.","note":"Homoplasy arises independently in different lineages and does not imply a recent common ancestor."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Homoplasy' is a technical term used in evolutionary biology to describe when different species independently evolve similar traits, even though their common ancestor did not have those traits. This often happens because they live in similar environments or face similar challenges. It's important to understand homoplasy to avoid mistakenly thinking that species are closely related just because they share certain features. Distinguishing homoplasy from homology (traits inherited from a common ancestor) is crucial for accurately reconstructing evolutionary relationships."},"example_sentences":[{"sentence":"The evolution of camera eyes in cephalopods and vertebrates is a classic example of homoplasy.","translation":"頭足類と脊椎動物におけるカメラ眼の進化は、ホモプラスミーの典型的な例です。","type":"noun","meaning_category":"収斂進化"},{"sentence":"Molecular homoplasy can arise due to the limited number of possible nucleotide substitutions.","translation":"分子ホモプラスミーは、起こりうるヌクレオチド置換の数が限られているために生じることがあります。","type":"noun","meaning_category":"分子進化"},{"sentence":"Distinguishing between homology and homoplasy is crucial for accurate phylogenetic reconstruction.","translation":"相同性とホモプラスミーを区別することは、正確な系統発生の再構築にとって重要です。","type":"noun","meaning_category":"系統学"}]}