{"word":"macrochemistry","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"高分子化学","english_definition":"The chemistry of macromolecules, including their synthesis, properties, and reactions.","examples":[{"sentence":"Macrochemistry is essential for understanding the behavior of plastics and other polymeric materials.","translation":"高分子化学は、プラスチックやその他の高分子材料の挙動を理解するために不可欠です。"}],"collocations":["polymer chemistry","macromolecular science"],"synonyms":["polymer science","macromolecular chemistry"],"antonyms":[]}],"etymology":{"value":"Derived from 'macro-' (large) and 'chemistry'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmækroʊˈkemɪstri/","syllables":"mac-ro-chem-is-try"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Macrochemistry focuses on the synthesis, characterization, and properties of large molecules, or macromolecules, which include polymers, proteins, and other complex structures.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Macrochemistry is the same as organic chemistry.","correct":"✓ Macrochemistry is a branch of chemistry that deals with large molecules, while organic chemistry deals with carbon-containing compounds.","note":"Macrochemistry specifically deals with macromolecules, whereas organic chemistry is a broader field focusing on carbon compounds."}],"priority":"★★☆"},"related_words":{"derivatives":["macromolecule","polymer","oligomer"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Macrochemistry is a specialized field of chemistry dealing with large molecules, often requiring advanced knowledge of chemical principles. It's typically encountered in higher education or research settings."},"example_sentences":[{"sentence":"The field of macrochemistry has led to significant advancements in material science.","translation":"高分子化学の分野は、材料科学に大きな進歩をもたらしました。","type":"general","meaning_category":"general"},{"sentence":"Researchers in macrochemistry are developing new polymers with enhanced properties.","translation":"高分子化学の研究者たちは、特性が向上した新しいポリマーを開発しています。","type":"research","meaning_category":"research"}]}