{"word":"Faraday","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ファラデー (電気量の単位)","english_definition":"(physics) A unit of electrical charge, equal to the charge on one mole of electrons; approximately 96,485 coulombs.","examples":[{"sentence":"The Faraday constant is a fundamental physical constant.","translation":"ファラデー定数は基本的な物理定数です。"}],"collocations":["Faraday constant","Faraday's law of induction"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"マイケル・ファラデー (人名、イギリスの物理学者・化学者)","english_definition":"Michael Faraday (1791-1867), a British scientist (physicist and chemist) who contributed to the study of electromagnetism and electrochemistry.","examples":[{"sentence":"Faraday discovered electromagnetic induction.","translation":"ファラデーは電磁誘導を発見した。"}],"collocations":["Michael Faraday","Faraday's cage","Faraday's law"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after Michael Faraday (1791-1867), a British scientist.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfærədeɪ/","syllables":"Far-a-day"},"inflection":{"notes":"Proper noun, so typically no plural form unless referring to multiple units of measure."},"usage_notes":{"explanation":"The term \"Faraday\" can refer to either the unit of electrical charge or to the scientist Michael Faraday. Context is crucial to determine the intended meaning. When discussing physics or chemistry, it often refers to the unit of charge. When discussing the history of science, it likely refers to the scientist.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to calculate the faraday for this reaction.","correct":"✓ I need to calculate the Faraday constant for this reaction. / ✓ I need to calculate the charge using the Faraday constant for this reaction.","note":"'Faraday' alone is the unit, but the constant is called 'Faraday constant'."}],"priority":"★★☆"},"related_words":{"derivatives":["Faradaic (adjective, relating to Faraday or his work)","Faraday's law (noun, a law of electromagnetism)","Faraday cage (noun, an enclosure used to block electromagnetic fields)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1 (technical contexts)","frequency_google_ngram":"Relatively low frequency outside of scientific contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Faraday' is a technical term primarily used in physics and chemistry. It can refer to a unit of electrical charge or to the scientist Michael Faraday. Understanding its meaning requires some background knowledge in these fields. The term is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The experiment required precise measurement of the charge in **Faradays**.","translation":"その実験では、ファラデー単位での電荷の正確な測定が必要だった。","type":"noun","meaning_category":"unit of charge"},{"sentence":"**Faraday's** work revolutionized our understanding of electromagnetism.","translation":"ファラデーの研究は、電磁気学に対する私たちの理解に革命をもたらした。","type":"noun","meaning_category":"scientist"},{"sentence":"A **Faraday** cage can shield electronic equipment from external electromagnetic interference.","translation":"ファラデーケージは、電子機器を外部からの電磁干渉から保護することができる。","type":"noun","meaning_category":"application of Faraday's principles"}]}