{"word":"Sorbonic","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Relating to the Sorbonne, a university in Paris, or its students and alumni.","english_definition":"Of or pertaining to the Sorbonne, especially its students or alumni.","examples":[{"sentence":"He had a Sorbonic accent when speaking French.","translation":"彼がフランス語を話すとき、ソルボンヌ大学風のアクセントがあった。"},{"sentence":"The Sorbonic intellectual tradition is highly respected.","translation":"ソルボンヌ大学の知的伝統は非常に尊敬されている。"}],"collocations":["Sorbonic accent","Sorbonic intellectual","Sorbonic tradition"],"synonyms":["academic","scholarly","intellectual"],"antonyms":["layman","uneducated"]}],"etymology":{"value":"Derived from 'Sorbonne', the name of a famous university in Paris, France. The Sorbonne was originally a college founded in 1257 by Robert de Sorbon.","priority":"★★★"},"pronunciation":{"ipa":"/sɔːrˈbɒnɪk/","syllables":"Sor-bon-ic"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Sorbonic' is primarily used to describe things associated with the Sorbonne University, such as its academic style, intellectual environment, or the characteristics of its students and alumni. It is relatively uncommon in everyday language and is mostly used in academic or historical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He spoke in Sorbonic.","correct":"✓ He spoke in a Sorbonic manner.","note":"'Sorbonic' is an adjective, so it needs to modify a noun. Using it as an adverb is incorrect."}],"priority":"★☆☆"},"related_words":{"derivatives":["Sorbonne (noun): The University of Paris"],"phrases":["Sorbonic method","Sorbonic style"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sorbonic' is a specialized term used to describe something related to the Sorbonne University in Paris. It is not commonly used in everyday conversation but may appear in academic or historical texts. Understanding this word requires familiarity with the Sorbonne and its reputation as a center of learning."},"example_sentences":[{"sentence":"The professor's lecture had a distinctly Sorbonic flavor.","translation":"その教授の講義は明らかにソルボンヌ大学風の趣があった。","type":"adjective","meaning_category":"Relating to the Sorbonne"},{"sentence":"Her Sorbonic education gave her a deep understanding of French literature.","translation":"彼女のソルボンヌ大学での教育は、彼女にフランス文学の深い理解を与えた。","type":"adjective","meaning_category":"Relating to the Sorbonne"}]}