{"word":"annalists","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"年代記編者、歴史を年代順に記録する人","english_definition":"A writer of annals; one who records events year by year.","examples":[{"sentence":"The annalists of the Roman Empire provide valuable insights into its history.","translation":"ローマ帝国の年代記編者たちは、その歴史に関する貴重な洞察を提供している。"},{"sentence":"Medieval annalists meticulously documented the events of their time.","translation":"中世の年代記編者たちは、彼らの時代の出来事を綿密に記録した。"}],"collocations":["Roman annalists","Medieval annalists","early annalists","famous annalists"],"synonyms":["chronicler","historian","recorder","scribe"],"antonyms":[]}],"etymology":{"value":"From 'annals,' which comes from the Latin word 'annales libri,' meaning 'yearly books.' The suffix '-ist' denotes a person who practices or is concerned with something.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈænəlɪsts/","syllables":"an-nal-ists"},"inflection":{"noun_plural":"annalists"},"usage_notes":{"explanation":"'Annalists' refers specifically to individuals who compile annals, which are historical records presented in chronological order, typically year by year. This term is often used in the context of ancient or medieval history.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The annalist wrote a novel.","correct":"✓ The annalist wrote annals.","note":"Annalists write annals, not novels. Their focus is on recording historical events in a chronological format."}],"priority":"★☆☆"},"related_words":{"derivatives":["annal (noun: a record of events year by year)","annalistic (adjective: relating to annals or annalists)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'annalists' is a specialized term used to describe individuals who write annals, which are historical records organized by year. It is not a commonly used word in everyday conversation but is more likely to appear in historical or academic contexts. Understanding this word requires familiarity with historical terminology and a higher level of vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"Ancient Egyptian annalists documented the reigns of pharaohs and significant events.","translation":"古代エジプトの年代記編者たちは、ファラオの治世と重要な出来事を記録した。","type":"noun","meaning_category":"historical record keepers"},{"sentence":"The work of early medieval annalists provides valuable insights into the social and political structures of the time.","translation":"初期中世の年代記編者たちの業績は、当時の社会および政治構造に関する貴重な洞察を提供する。","type":"noun","meaning_category":"historical record keepers"}]}