{"word":"conformation-specific","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"特定の立体配座に特有の、立体配座特異的な","english_definition":"Relating to or exhibiting specificity for a particular conformation (spatial arrangement of atoms in a molecule).","examples":[{"sentence":"The antibody is conformation-specific and only binds to the protein when it is folded in a certain way.","translation":"その抗体は立体配座特異的であり、タンパク質が特定の構造に折りたたまれた場合にのみ結合する。"},{"sentence":"Conformation-specific antibodies can be used to detect misfolded proteins.","translation":"立体配座特異的抗体は、誤って折りたたまれたタンパク質の検出に使用できる。"},{"sentence":"The drug's efficacy depends on its interaction with a conformation-specific binding site on the receptor.","translation":"薬物の有効性は、受容体上の立体配座特異的な結合部位との相互作用に依存する。"}],"collocations":["conformation-specific antibody (立体配座特異的抗体)","conformation-specific epitope (立体配座特異的エピトープ)","conformation-specific binding (立体配座特異的結合)"],"synonyms":["stereospecific","structure-specific","shape-selective"],"antonyms":["conformation-independent","non-specific"]},{"part_of_speech":"adjective","definition":"（高分子化学において）特定の立体配座のみを認識または相互作用する","english_definition":"(In polymer chemistry) Recognizing or interacting with only a specific spatial arrangement of a polymer chain.","examples":[{"sentence":"Conformation-specific probes are used to study the dynamics of polymer folding.","translation":"立体配座特異的プローブは、ポリマーの折りたたみのダイナミクスを研究するために使用される。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term is formed by combining \"conformation\" (the spatial arrangement of atoms in a molecule) with \"specific\" (clearly defined or identified).","priority":"N/A"},"pronunciation":{"ipa":"/kənˌfɔːrˈmeɪʃən spəˈsɪfɪk/","syllables":"con-for-ma-tion spe-ci-fic"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"This term is primarily used in biochemistry, molecular biology, and polymer chemistry to describe molecules (often antibodies or probes) that selectively interact with a target molecule only when it adopts a particular three-dimensional shape or conformation. This specificity is crucial for many biological processes and analytical techniques.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ conformation specific","correct":"✓ conformation-specific","note":"The hyphen is important to indicate that \"conformation\" and \"specific\" are acting together as a single adjective modifying another noun."}],"priority":"★★☆"},"related_words":{"derivatives":["conformation","specific","specificity"],"related_terms":["stereochemistry","molecular recognition","protein folding","antibody","epitope"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"conformation-specific\" is a technical term used in scientific fields like biochemistry and molecular biology. It describes something that is selective or specific to a particular spatial arrangement (conformation) of a molecule. Understanding this term requires familiarity with concepts like molecular structure and stereochemistry."},"example_sentences":[{"sentence":"The **conformation-specific** antibody only binds to the protein's active form.","translation":"その立体配座特異的抗体は、タンパク質の活性型にのみ結合する。","type":"adjective","meaning_category":"biochemistry"},{"sentence":"**Conformation-specific** probes are essential for studying protein dynamics.","translation":"立体配座特異的プローブは、タンパク質のダイナミクスを研究するために不可欠である。","type":"adjective","meaning_category":"molecular biology"}]}