{"word":"worst-bred","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"最も育ちの悪い、最も礼儀作法を知らない、最も下品な","english_definition":"most poorly brought up; most lacking in manners or refinement; most vulgar.","examples":[{"sentence":"He was the worst-bred fellow I had ever encountered; his behavior was appalling.","translation":"彼は私が今まで出会った中で最も育ちの悪い男だった。彼の振る舞いはひどかった。"},{"sentence":"Her worst-bred comments offended everyone at the dinner party.","translation":"彼女の最も下品なコメントは、夕食会の全員を不快にさせた。"},{"sentence":"The worst-bred children were running wild, causing chaos in the store.","translation":"最も育ちの悪い子供たちが走り回り、店内で大混乱を引き起こしていた。"}],"collocations":["worst-bred manners (最も悪いマナー)","worst-bred behavior (最も下品な振る舞い)","worst-bred comments (最も下品なコメント)","worst-bred fellow (最も育ちの悪いやつ)"],"synonyms":["ill-mannered","uncouth","boorish","vulgar","crass","coarse","rude","impolite"],"antonyms":["well-bred","refined","polite","courteous","civilized","well-mannered"]}],"etymology":{"value":"Derived from the phrase \"badly bred,\" meaning poorly raised or lacking in good manners. \"Worst-bred\" is the superlative form, indicating the highest degree of poor breeding.","priority":"★★★"},"pronunciation":{"ipa":"/ˈwɜːrst bred/","syllables":"worst-bred"},"inflection":{"notes":"Adjective; superlative form of \"ill-bred\" or \"badly bred\"."},"usage_notes":{"explanation":"\"Worst-bred\" is a strong adjective used to describe someone who exhibits extremely poor manners, lacks refinement, or is generally vulgar in behavior. It implies a significant deficiency in upbringing and social graces. The term is often used to express strong disapproval or disdain.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a worst-bred person.","correct":"✓ He is the worst-bred person.","note":"Since it is a superlative adjective, it should be preceded by 'the'."},{"incorrect":"✗ The worst-bred behavior is not acceptable.","correct":"✓ Such worst-bred behavior is not acceptable.","note":"Adding 'such' can emphasize the extreme nature of the behavior."}],"priority":"★★☆"},"related_words":{"derivatives":["ill-bred (育ちの悪い、無作法な)","well-bred (育ちの良い、上品な)","badly-bred (育ちの悪い)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - not commonly used in modern English.","priority":"★★☆"},"readability_explanation":{"level":"C2","text":"\"Worst-bred\" is a relatively uncommon and somewhat archaic term used to describe someone with extremely poor manners or upbringing. It is a strong expression and implies a significant lack of refinement or social grace. Due to its intensity and infrequent use, it is more likely to be encountered in literature or historical contexts rather than everyday conversation."},"example_sentences":[{"sentence":"The nobleman considered the peasant to be the worst-bred individual he had ever met.","translation":"その貴族は、その農民を今まで会った中で最も育ちの悪い人物だと考えた。","type":"adjective","meaning_category":"育ちの悪い"},{"sentence":"His worst-bred table manners disgusted the other guests at the formal dinner.","translation":"彼の最も下品なテーブルマナーは、正式な夕食会の他の客をうんざりさせた。","type":"adjective","meaning_category":"下品な"},{"sentence":"The critic described the play as being filled with worst-bred characters.","translation":"評論家はその劇を、最も育ちの悪い登場人物で満たされていると評した。","type":"adjective","meaning_category":"礼儀作法を知らない"}]}