{"word":"OTC","priority":"☆☆☆","meanings":[{"part_of_speech":"abbreviation","definition":"Over-the-counter (店頭販売の、処方箋なしで買える)","english_definition":"(of a medicine) sold legally in shops without a prescription from a doctor. Also refers to financial instruments traded directly between two parties, without going through an exchange.","examples":[{"sentence":"You can buy many pain relievers OTC.","translation":"多くの鎮痛剤はOTCで購入できます。"},{"sentence":"OTC derivatives are less regulated than exchange-traded ones.","translation":"OTCデリバティブは、取引所取引のものよりも規制が緩いです。"}],"collocations":["OTC medicine","OTC drugs","OTC market","OTC transaction"],"synonyms":["nonprescription","off-exchange"],"antonyms":["prescription","exchange-traded"]}],"etymology":{"value":"Abbreviation of 'over-the-counter,' referring to items sold directly to consumers from a store counter, without needing a prescription or intermediary.","priority":"★★★"},"pronunciation":{"ipa":"/ˌoʊ tiː ˈsiː/","syllables":"O-T-C"},"inflection":{"notes":"It's an abbreviation, so it doesn't inflect."},"usage_notes":{"explanation":"'OTC' has two primary meanings:\n\n1.  **Over-the-counter medicine:** This refers to medications that can be purchased without a doctor's prescription. These are typically for common ailments and are considered safe for self-administration when used as directed.\n2.  **Over-the-counter market/trading:** In finance, OTC refers to trading that occurs directly between two parties, without the use of a central exchange. This is common for derivatives, bonds, and other financial instruments.  OTC markets are generally less regulated than exchange-based markets.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need a prescription for this OTC drug.","correct":"✓ I can buy this OTC drug without a prescription.","note":"OTC drugs are, by definition, available without a prescription."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["prescription drug","generic drug","exchange-traded fund (ETF)","derivatives market"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (in context of medicine or finance)","frequency_google_ngram":"Relatively infrequent, but common in specific contexts (medicine, finance).","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'OTC' stands for 'over-the-counter'. It has two main uses. In medicine, it means you can buy a medicine in a shop without needing a doctor's prescription. In finance, it means that financial products are traded directly between two parties and not through a stock exchange. You need to understand the context to know which meaning is being used."},"example_sentences":[{"sentence":"The pharmacist recommended an OTC allergy medication.","translation":"薬剤師はOTCのアレルギー薬を勧めました。","type":"abbreviation","meaning_category":"medicine"},{"sentence":"Many small companies are traded on the OTC market.","translation":"多くの中小企業がOTC市場で取引されています。","type":"abbreviation","meaning_category":"finance"}]}