{"word":"Piarist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ピアリスト会士：16世紀末にスペインの聖ヨセフ・カラサンツによって創設された、貧しい子供たちの教育に尽力するカトリック修道会「敬虔学校会」の会員。","english_definition":"A member of the Piarists, a Roman Catholic religious order founded in the late 16th century by St. Joseph Calasanz to provide education to poor children. Also known as the Order of Poor Clerics Regular of the Mother of God of the Pious Schools (Sch. P.).","examples":[{"sentence":"He became a Piarist and dedicated his life to teaching.","translation":"彼はピアリスト会士となり、教育に生涯を捧げた。"},{"sentence":"The Piarists established many schools throughout Europe.","translation":"ピアリスト会はヨーロッパ中に多くの学校を設立した。"}],"collocations":["Piarist school","Piarist order","become a Piarist"],"synonyms":["Scholar of the Pious Schools","Order of Poor Clerics Regular of the Mother of God of the Pious Schools"],"antonyms":[]}],"etymology":{"value":"From the Latin 'piarista', referring to the 'Scholae Piae' or 'Pious Schools' founded by St. Joseph Calasanz.","priority":"★★☆"},"pronunciation":{"ipa":"ˈpaɪərɪst","syllables":"Pi-a-rist"},"inflection":{"noun_plural":"Piarists"},"usage_notes":{"explanation":"'Piarist' refers specifically to a member of the Piarist order, a religious order within the Catholic Church focused on education. The term is not commonly used outside of historical or religious contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a pianist.","correct":"✓ He is a Piarist.","note":"'Pianist' refers to someone who plays the piano, while 'Piarist' refers to a member of the religious order."}],"priority":"★☆☆"},"related_words":{"derivatives":["Piarism (the principles and practices of the Piarist order)"],"related_religious_orders":["Jesuit","Franciscan","Dominican"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Piarist' is highly specialized and unlikely to be encountered outside of specific historical or religious contexts. Understanding requires familiarity with the history of Catholic religious orders and their contributions to education."},"example_sentences":[{"sentence":"The Piarist brothers ran the school with dedication and care.","translation":"ピアリスト会の修道士たちは献身と注意をもって学校を運営した。","type":"noun","meaning_category":"member of a religious order"},{"sentence":"Many prominent figures were educated in Piarist schools.","translation":"多くの著名人がピアリスト会の学校で教育を受けた。","type":"adjective (attributive)","meaning_category":"related to the Piarist order"}]}