{"word":"light-sterilized","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"光殺菌された、光滅菌された","english_definition":"Having been sterilized or disinfected using light, typically ultraviolet (UV) light.","examples":[{"sentence":"The baby bottles were light-sterilized to ensure they were free of bacteria.","translation":"哺乳瓶は、バクテリアがないことを確認するために光殺菌されました。"},{"sentence":"The hospital uses light-sterilized equipment to prevent the spread of infection.","translation":"病院では、感染の拡大を防ぐために光殺菌された機器を使用しています。"},{"sentence":"Light-sterilized water is safe to drink.","translation":"光殺菌された水は安全に飲めます。"}],"collocations":["light-sterilized equipment","light-sterilized water","light-sterilized surface","UV light-sterilized","light-sterilized air"],"synonyms":["UV-sterilized","ultraviolet-sterilized","disinfected with light","sterilized by light"],"antonyms":["unsterilized","contaminated","infected"]}],"etymology":{"value":"The word is formed by combining \"light\" (referring to electromagnetic radiation, often UV light) and \"sterilized\" (made free from bacteria or other living microorganisms).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlaɪt ˈstɛrɪˌlaɪzd/","syllables":"light-ster-i-lized"},"inflection":{"notes":"This is an adjective, so it does not have verb conjugations. Comparative and superlative forms are possible but less common (more light-sterilized, most light-sterilized)."},"usage_notes":{"explanation":"\"Light-sterilized\" specifically refers to the process of using light, usually UV light, to kill or deactivate microorganisms. It is often used in contexts where hygiene and cleanliness are important, such as hospitals, food processing, and water treatment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The water was sterilized by light. It is a light sterilized water.","correct":"✓ The water was sterilized by light. It is light-sterilized water.","note":"The hyphen is important when using 'light-sterilized' as a compound adjective before a noun."},{"incorrect":"✗ The light sterilized the room.","correct":"✓ The room was light-sterilized.","note":"'Light-sterilized' is an adjective, not a verb. You can say 'The room was light-sterilized' or 'The room was sterilized with light'."}],"priority":"★★☆"},"related_words":{"derivatives":["sterilize (verb)","sterilization (noun)","disinfect (verb)","disinfection (noun)","UV light (noun)"],"phrasal_verbs":[],"related_terms":["UV sterilization","ultraviolet disinfection","photodisinfection"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but increasing due to increased awareness of sterilization methods.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"light-sterilized\" is a compound adjective describing something that has undergone a sterilization process using light, typically ultraviolet (UV) light. It's used in contexts related to hygiene, medicine, and sanitation. Understanding the term requires familiarity with the concept of sterilization and the use of light as a disinfecting agent."},"example_sentences":[{"sentence":"The operating room is cleaned with light-sterilized equipment.","translation":"手術室は光殺菌された機器で清掃されています。","type":"adjective","meaning_category":"光殺菌された"},{"sentence":"The company sells light-sterilized air purifiers.","translation":"その会社は光殺菌された空気清浄機を販売しています。","type":"adjective","meaning_category":"光殺菌された"},{"sentence":"The researchers studied the effectiveness of light-sterilized surfaces in reducing bacterial growth.","translation":"研究者たちは、光殺菌された表面が細菌の増殖を抑制する効果について研究しました。","type":"adjective","meaning_category":"光殺菌された"}]}