{"word":"genderizing","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"ジェンダー化する、性別化する：ある物事、役割、行動などを特定のジェンダーに関連付けること。または、ジェンダーのステレオタイプを強化すること。","english_definition":"To associate something, such as an object, role, or behavior, with a particular gender; to reinforce gender stereotypes.","examples":[{"sentence":"The toy industry is often criticized for genderizing toys, marketing pink toys to girls and blue toys to boys.","translation":"おもちゃ業界は、おもちゃをジェンダー化し、女の子にはピンクのおもちゃ、男の子には青のおもちゃを販売しているとよく批判されます。"},{"sentence":"Some argue that genderizing certain professions discourages individuals from pursuing careers they might otherwise enjoy.","translation":"特定の職業をジェンダー化することは、個人が本来楽しめるかもしれないキャリアを追求することを妨げると主張する人もいます。"},{"sentence":"The marketing campaign was accused of genderizing household chores, showing only women doing the cleaning.","translation":"そのマーケティングキャンペーンは、家事をジェンダー化していると非難され、掃除をしているのは女性だけが描かれていました。"}],"collocations":["genderizing toys","genderizing roles","genderizing professions","genderizing colors","genderizing activities"],"synonyms":["stereotyping","sexualizing","categorizing by gender","assigning gender roles"],"antonyms":["degendering","neutralizing","unisex","gender-neutral"]}],"etymology":{"value":"\"Genderize\" + \"-ing\". \"Genderize\" comes from \"gender\" + \"-ize\" (to make or become).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈdʒɛndəraɪzɪŋ/","syllables":"gen-der-iz-ing"},"inflection":{"verb_forms":{"present_simple":["genderize","genderizes"],"past_simple":"genderized","past_participle":"genderized","present_participle":"genderizing"}},"usage_notes":{"explanation":"\"Genderizing\" typically carries a negative connotation, implying that the association with a specific gender is limiting or unfair. It is often used in discussions about social justice, equality, and challenging traditional norms.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"The company is genderizing to all employees.","correct":"The company is genderizing its products.","note":"\"Genderizing\" requires a direct object (something that is being genderized)."}],"priority":"☆☆☆"},"related_words":{"derivatives":["genderize","genderized","genderization"],"related_terms":["gender","gender role","gender stereotype","gender equality","gender bias"]},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency, primarily used in academic and social commentary contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"\"Genderizing\" is a term used to describe the act of associating something with a particular gender. It often implies reinforcing gender stereotypes and can be used critically to point out how certain products, roles, or behaviors are unfairly linked to one gender. The word is commonly found in discussions about gender equality and social justice."},"example_sentences":[{"sentence":"The school tried to avoid genderizing activities by offering a wide range of options for all students.","translation":"その学校は、すべての生徒に幅広い選択肢を提供することで、活動をジェンダー化することを避けようとしました。","type":"verb","meaning_category":"Associating activities with gender"},{"sentence":"Critics argued that the advertisement was genderizing beauty standards, promoting an unrealistic image of women.","translation":"批評家たちは、その広告が美の基準をジェンダー化し、女性の非現実的なイメージを促進していると主張しました。","type":"verb","meaning_category":"Reinforcing gender stereotypes"},{"sentence":"The company aims to stop genderizing its products and market them to a wider audience.","translation":"その会社は、製品のジェンダー化をやめ、より幅広い層に販売することを目指しています。","type":"verb","meaning_category":"Associating products with gender"}]}