{"word":"subability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The quality or state of being subable; the degree to which something is able to be subjected to a particular process or treatment. This term is often used in technical or scientific contexts to describe how well a material or object can withstand or undergo a specific condition or manipulation.","english_definition":"The quality or state of being subable; the degree to which something is able to be subjected to a particular process or treatment.","examples":[{"sentence":"The subability of the alloy to high temperatures was tested extensively.","translation":"その合金が高温に耐えうる能力（サブアビリティ）は、広範囲にわたって試験された。"},{"sentence":"The subability of the new coating to chemical corrosion is significantly improved.","translation":"新しいコーティングの化学腐食に対する耐性（サブアビリティ）は大幅に向上している。"}],"collocations":["high subability","low subability","test subability","improve subability","assess subability"],"synonyms":["susceptibility","vulnerability","amenability","receptiveness","liability"],"antonyms":["resistance","immunity","invulnerability","insusceptibility"]}],"etymology":{"value":"The word 'subability' is derived from 'subable,' which combines the prefix 'sub-' (meaning under or subjected to) with the suffix '-able' (meaning capable of or suitable for). Thus, 'subable' means capable of being subjected to something. Adding the suffix '-ity' transforms it into a noun indicating the quality or state of being subable.","priority":"★★★"},"pronunciation":{"ipa":"/ˌsʌbəˈbɪləti/","syllables":"sub-a-bil-i-ty"},"inflection":{"noun_plural":"subabilities"},"usage_notes":{"explanation":"'Subability' is a relatively rare and technical term. It is primarily used in scientific, engineering, or technical contexts to describe the extent to which a material, object, or system can be subjected to a particular process or condition without adverse effects. It is related to concepts like resistance, durability, and tolerance, but specifically focuses on the capacity to be acted upon.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The subability of the idea was clear.","correct":"✓ The feasibility of the idea was clear.","note":"'Subability' is generally used for physical or chemical properties, not abstract concepts. Use 'feasibility' or 'viability' for ideas. "},{"incorrect":"✗ The subability of the metal made it perfect for the project.","correct":"✓ The durability of the metal made it perfect for the project.","note":"Consider using more common terms like 'durability,' 'resistance,' or 'tolerance' unless the specific context requires emphasizing the capacity to be subjected to something."}],"priority":"★★☆"},"related_words":{"derivatives":["subable"],"related_terms":["susceptibility","liability","resistance","tolerance","durability","amenability"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Subability' is a technical term used to describe how well something can be subjected to a process or condition. It's not commonly used in everyday language and is more likely to appear in scientific or engineering contexts. Understanding this word requires a good grasp of technical vocabulary and the ability to infer meaning from context."},"example_sentences":[{"sentence":"The experiment aimed to measure the subability of the polymer to ultraviolet radiation.","translation":"その実験は、ポリマーの紫外線に対する耐性（サブアビリティ）を測定することを目的としていた。","type":"technical","meaning_category":"resistance to a process"},{"sentence":"The enhanced subability of the material allows for its use in more demanding applications.","translation":"その材料の向上した耐性（サブアビリティ）により、より要求の厳しい用途での使用が可能になる。","type":"technical","meaning_category":"suitability for application"}]}