{"word":"substance-specific","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"特定の物質に特有の、特定の物質に限定された","english_definition":"Relating to or characteristic of a particular substance; limited to a specific substance.","examples":[{"sentence":"The study examined substance-specific effects of the drug on brain activity.","translation":"その研究では、薬物が脳活動に及ぼす特定の物質に特有の影響を調べた。"},{"sentence":"Substance-specific treatment programs are designed to address the unique challenges associated with each type of substance abuse.","translation":"特定の物質に特有の治療プログラムは、それぞれの種類の物質乱用に関連する特有の課題に対処するように設計されている。"},{"sentence":"The test is substance-specific, meaning it only detects the presence of one particular chemical.","translation":"その検査は特定の物質に限定されており、つまり、特定の化学物質の存在のみを検出する。"}],"collocations":["substance-specific treatment","substance-specific effects","substance-specific knowledge","substance-specific receptors","substance-specific antibodies"],"synonyms":["specific","particular","specialized","targeted","selective"],"antonyms":["general","non-specific","broad","universal"]}],"etymology":{"value":"The word is formed by combining 'substance' (a particular kind of matter), 'specific' (clearly defined or identified), and '-ic' (a suffix indicating relation or characteristic).","priority":"☆☆☆"},"pronunciation":{"ipa":"/sʌb.stəns.spəˈsɪf.ɪk/","syllables":"sub-stance-spe-cif-ic"},"inflection":{"notes":"Adjectives do not inflect in English. Comparative and superlative forms are 'more substance-specific' and 'most substance-specific', respectively."},"usage_notes":{"explanation":"'Substance-specific' is used to describe something that is uniquely related to or designed for a particular substance. It is often used in scientific, medical, and legal contexts to emphasize the targeted nature of an effect, treatment, or test. For example, a 'substance-specific antibody' will only bind to a particular substance, and a 'substance-specific law' will only apply to a particular substance.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor prescribed a general treatment instead of substance-specific.","correct":"✓ The doctor prescribed a general treatment instead of a substance-specific one.","note":"When using 'substance-specific' to refer to a treatment or program, it's important to use the indefinite article 'a' before it, or to use 'treatment/program' after it."},{"incorrect":"✗ The substance-specific is very important in this case.","correct":"✓ Substance-specificity is very important in this case.","note":"'Substance-specific' is an adjective; to refer to the quality or state of being substance-specific, use the noun 'substance-specificity'."}],"priority":"☆☆☆"},"related_words":{"derivatives":["substance (noun)","specific (adjective)","specificity (noun)"],"phrases":["substance-specific disorder","substance-specific learning","substance-specific immunity"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'substance-specific' is a technical term used to describe something that is uniquely related to or designed for a particular substance. It is commonly used in scientific, medical, and legal contexts. Understanding this term requires a good grasp of technical vocabulary and the ability to understand complex relationships between concepts. It is not typically encountered in everyday language."},"example_sentences":[{"sentence":"The research focused on identifying substance-specific biomarkers for early disease detection.","translation":"その研究は、早期の疾患発見のための特定の物質に特有のバイオマーカーを特定することに焦点を当てた。","type":"general","meaning_category":"relating to a particular substance"},{"sentence":"The new drug is designed to target substance-specific receptors in the brain.","translation":"その新薬は、脳内の特定の物質に特有の受容体を標的とするように設計されている。","type":"medical","meaning_category":"relating to a particular substance"},{"sentence":"The law requires substance-specific labeling for all products containing hazardous chemicals.","translation":"その法律は、有害化学物質を含むすべての製品に対して、特定の物質に特有のラベル表示を義務付けている。","type":"legal","meaning_category":"relating to a particular substance"}]}