{"word":"transposer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"移調楽器、移調者、転置する人または装置","english_definition":"A person or thing that transposes; especially, a musical instrument that produces notes other than those written, or a device for changing the key of a musical composition.","examples":[{"sentence":"The clarinet is a transposer, as it is usually pitched in B♭ or A.","translation":"クラリネットは通常B♭またはAで調律されているため、移調楽器です。"},{"sentence":"He used a transposer to change the song to a key that better suited the singer's vocal range.","translation":"彼は移調器を使って、歌手の音域に合うキーに曲を調整しました。"}],"collocations":["musical transposer","key transposer","audio transposer"],"synonyms":["converter","adapter","changer"],"antonyms":[]}],"etymology":{"value":"From the verb 'transpose' + '-er' (suffix indicating agent or instrument). 'Transpose' comes from Old French 'transposer', from Latin 'transponere' (to put across).","priority":"★★☆"},"pronunciation":{"ipa":"/trænzˈpoʊzər/","syllables":"trans-po-ser"},"inflection":{"noun_plural":"transposers"},"usage_notes":{"explanation":"'Transposer' can refer to a musical instrument that plays in a key different from what is written (e.g., a B♭ clarinet). It can also refer to a device or software that changes the key of a piece of music. Less commonly, it can refer to a person who transposes something.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The transposer was used to translate the text.","correct":"✓ The translator was used to translate the text.","note":"'Transposer' is generally used in a musical context. For text, use 'translator'."}],"priority":"★☆☆"},"related_words":{"derivatives":["transpose (verb)","transposition (noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'transposer' is relatively uncommon and is primarily used in musical contexts to describe instruments that play in a different key than written or devices that change the key of music. It can also refer to someone who transposes something, but this usage is less common. Understanding the term requires some familiarity with musical concepts."},"example_sentences":[{"sentence":"The saxophone is a common transposer in jazz music.","translation":"サックスはジャズ音楽で一般的な移調楽器です。","type":"noun","meaning_category":"移調楽器"},{"sentence":"The software includes a transposer that allows you to change the key of any song.","translation":"そのソフトウェアには、あらゆる曲のキーを変更できる移調器が含まれています。","type":"noun","meaning_category":"装置"}]}