{"word":"superconductors","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"超伝導体","english_definition":"Materials that conduct electricity with no resistance below a specific critical temperature.","examples":[{"sentence":"Superconductors have the potential to revolutionize energy transmission.","translation":"超伝導体はエネルギー伝送に革命をもたらす可能性を秘めている。"},{"sentence":"The research team is working on developing superconductors that operate at room temperature.","translation":"研究チームは室温で動作する超伝導体の開発に取り組んでいる。"}],"collocations":["high-temperature superconductors","room-temperature superconductors","superconducting materials","superconducting magnets"],"synonyms":["superconducting materials"],"antonyms":["normal conductors","resistors","semiconductors"]}],"etymology":{"value":"The term 'superconductor' is a compound word formed from 'super-' (meaning above or beyond) and 'conductor' (a material that conducts electricity). It describes materials that conduct electricity with virtually no resistance, a property that goes beyond that of normal conductors.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsuːpərkənˈdʌktərz/","syllables":"su-per-con-duc-tors"},"inflection":{"noun_plural":"superconductors"},"usage_notes":{"explanation":"Superconductors are materials that exhibit superconductivity, a phenomenon characterized by the complete absence of electrical resistance and the expulsion of magnetic fields (the Meissner effect) below a critical temperature. They have numerous potential applications, including lossless power transmission, high-speed computing, and powerful magnets for medical imaging (MRI) and particle accelerators.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Superconductor is used in MRI machines.","correct":"✓ Superconductors are used in MRI machines.","note":"MRI machines use superconducting magnets, which are made from superconducting materials. Therefore, the plural form 'superconductors' is more appropriate."},{"incorrect":"✗ Superconductors have a lot of resistance.","correct":"✓ Superconductors have zero resistance.","note":"The defining characteristic of superconductors is the absence of electrical resistance."}],"priority":"★★☆"},"related_words":{"derivatives":["superconductivity (noun): the phenomenon of zero electrical resistance and expulsion of magnetic fields occurring in certain materials at very low temperatures.","superconducting (adjective): relating to or exhibiting superconductivity."],"related_terms":["Meissner effect","critical temperature","quantum mechanics","cryogenics"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Superconductors' refers to materials that, under specific conditions (typically very low temperatures), conduct electricity with absolutely no resistance. This is a complex topic related to physics and materials science. Understanding it requires familiarity with concepts like electrical resistance, temperature dependence, and sometimes quantum mechanics. The term is often used in the context of advanced technologies and scientific research.","priority":"★★☆"},"example_sentences":[{"sentence":"High-temperature **superconductors** have expanded the potential applications of this technology.","translation":"高温超伝導体はこの技術の潜在的な応用範囲を拡大した。","type":"general","meaning_category":"超伝導体"},{"sentence":"The development of efficient **superconductors** is crucial for future energy infrastructure.","translation":"効率的な超伝導体の開発は、将来のエネルギーインフラにとって非常に重要である。","type":"general","meaning_category":"超伝導体"},{"sentence":"Researchers are exploring new materials to create more practical **superconductors**.","translation":"研究者たちは、より実用的な超伝導体を開発するために新しい材料を研究している。","type":"research","meaning_category":"超伝導体"}]}