{"word":"tradicionalidade","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"Qualidade ou caráter do que é tradicional; apego ou respeito às tradições.","english_definition":"The quality or character of being traditional; attachment to or respect for traditions.","examples":[{"sentence":"A tradicionalidade da festa junina é um aspecto importante da cultura brasileira.","translation":"The traditional character of the Festa Junina is an important aspect of Brazilian culture."},{"sentence":"A tradicionalidade da família é um valor importante para muitas pessoas.","translation":"The traditional nature of the family is an important value for many people."}],"collocations":["manter a tradicionalidade","preservar a tradicionalidade","valorizar a tradicionalidade"],"synonyms":["conservadorismo","costume","hábito","tradição"],"antonyms":["modernidade","inovação"]}],"etymology":{"value":"Derivado de 'tradicional', acrescido do sufixo '-idade', que indica qualidade ou estado.","priority":"★★☆"},"pronunciation":{"ipa":"/tɾɐ.di.sjo.na.liˈda.dʒi/","syllables":"tra-di-ci-o-na-li-da-de"},"inflection":{"noun_gender":"feminine","plural":"tradicionalidades"},"usage_notes":{"explanation":"'Tradicionalidade' refere-se à qualidade ou ao estado de ser tradicional. Envolve a valorização e a manutenção de costumes, crenças e práticas transmitidas de geração em geração. É frequentemente associada a aspectos culturais, religiosos e sociais.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"A tradicionalidade é muito moderno.","correct":"A tradicionalidade é o oposto da modernidade.","note":"Tradicionalidade e modernidade são conceitos opostos."}],"priority":"★★☆"},"related_words":{"derivatives":["tradicional","tradicionalmente"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relativamente frequente em textos acadêmicos e culturais.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tradicionalidade' é um substantivo que descreve a qualidade de algo ser tradicional, ou seja, estar ligado a costumes e práticas antigas. É um termo usado em contextos culturais, sociais e históricos para enfatizar a importância da preservação de valores e práticas transmitidas ao longo do tempo. Implica um respeito pelas origens e pela continuidade de certos aspectos da vida e da sociedade."},"example_sentences":[{"sentence":"A tradicionalidade da culinária mineira é um atrativo turístico.","translation":"The traditional character of Minas Gerais cuisine is a tourist attraction.","type":"general","meaning_category":"cultura"},{"sentence":"A tradicionalidade religiosa é mantida por muitas famílias.","translation":"Religious traditionalism is maintained by many families.","type":"general","meaning_category":"religião"}]}