{"word":"opioid-sensitive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"オピオイドに感受性のある、オピオイドが効果的な","english_definition":"Responsive or susceptible to the effects of opioids.","examples":[{"sentence":"The patient's pain was opioid-sensitive, allowing for effective management with morphine.","translation":"その患者の痛みはオピオイドに感受性があり、モルヒネによる効果的な管理が可能であった。"},{"sentence":"Opioid-sensitive receptors are crucial for pain modulation in the central nervous system.","translation":"オピオイド感受性受容体は、中枢神経系における痛みの調節に不可欠である。"}],"collocations":["opioid-sensitive pain","opioid-sensitive receptors","opioid-sensitive neurons"],"synonyms":["opioid-responsive"],"antonyms":["opioid-resistant","opioid-insensitive"]}],"etymology":{"value":"Derived from 'opioid' (a substance that binds to opioid receptors) and 'sensitive' (responsive or susceptible).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈoʊpiɔɪd ˈsɛnsətɪv/","syllables":"o-pi-oid-sen-si-tive"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Opioid-sensitive' describes a condition, tissue, or organism that responds to opioids. It is often used in medical contexts to describe pain that can be effectively managed with opioid medications or receptors that bind strongly to opioids.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The opioid-sensitive drug was not effective.","correct":"✓ The patient's pain was not opioid-sensitive.","note":"Ensure the correct subject is being described as opioid-sensitive. It is the condition or tissue that is sensitive, not the drug itself."}],"priority":"☆☆☆"},"related_words":{"derivatives":["opioid","sensitive","sensitivity"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'opioid-sensitive' is a technical term used in medical and scientific contexts. It describes something that is responsive to opioids. Understanding requires knowledge of both 'opioid' and 'sensitive' and how they combine to describe a specific characteristic."},"example_sentences":[{"sentence":"The tumor cells were found to be opioid-sensitive, suggesting a potential therapeutic target.","translation":"その腫瘍細胞はオピオイドに感受性があることが判明し、潜在的な治療標的を示唆している。","type":"general","meaning_category":"general"},{"sentence":"Opioid-sensitive neurons in the spinal cord play a key role in the transmission of pain signals.","translation":"脊髄のオピオイド感受性ニューロンは、痛みのシグナルの伝達において重要な役割を果たす。","type":"medical","meaning_category":"medical"}]}