{"word":"Saturnal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"土星の、土星に関する","english_definition":"Of or pertaining to the planet Saturn.","examples":[{"sentence":"The Saturnal rings are a prominent feature of the planet.","translation":"土星の環は、この惑星の顕著な特徴である。"}],"collocations":["Saturnal rings","Saturnal orbit"],"synonyms":["Saturnian"],"antonyms":[]},{"part_of_speech":"adjective","definition":"陰鬱な、憂鬱な","english_definition":"Gloomy, grave, or taciturn.","examples":[{"sentence":"His Saturnal expression reflected his somber mood.","translation":"彼の陰鬱な表情は、彼の陰気な気分を反映していた。"}],"collocations":["Saturnal mood","Saturnal temperament"],"synonyms":["gloomy","melancholy","somber","taciturn"],"antonyms":["cheerful","joyful"]}],"etymology":{"value":"From Latin Saturnalis, pertaining to Saturn, the Roman god of agriculture and time.","priority":"★★★"},"pronunciation":{"ipa":"/səˈtɜːrnəl/","syllables":"Sa-tur-nal"},"inflection":{"notes":"Adjective, comparative and superlative forms exist but are rarely used (more Saturnal, most Saturnal)."},"usage_notes":{"explanation":"The word \"Saturnal\" has two primary meanings. The first relates directly to the planet Saturn. The second, less common meaning, describes a gloomy or taciturn disposition, reflecting the astrological associations of Saturn with melancholy and gravity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The saturnal party was wild and festive.","correct":"✓ The Saturnalia party was wild and festive.","note":"Saturnal refers to Saturn, while Saturnalia refers to the Roman festival."}],"priority":"★★☆"},"related_words":{"derivatives":["Saturn (planet)","Saturnalia (Roman festival)","Saturnine (having characteristics associated with Saturn, such as gloominess)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Saturnal\" is relatively uncommon and has two distinct meanings. The first is related to the planet Saturn, while the second describes a gloomy or taciturn demeanor. Its usage is often found in scientific or literary contexts. Understanding the etymology helps differentiate its meanings and usage.","priority":"★★☆"},"example_sentences":[{"sentence":"The telescope revealed the intricate details of the Saturnal system.","translation":"望遠鏡は土星系の複雑な詳細を明らかにした。","type":"adjective","meaning_category":"土星の"},{"sentence":"His Saturnal silence made it difficult to gauge his true feelings.","translation":"彼の陰鬱な沈黙は、彼の本当の気持ちを測るのを困難にした。","type":"adjective","meaning_category":"陰鬱な"}]}