{"word":"production-driven","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"生産主導の、生産重視の","english_definition":"Focused primarily on maximizing output or production volume, often at the expense of other considerations such as quality, customer satisfaction, or employee well-being.","examples":[{"sentence":"The company's production-driven approach led to high output but also numerous quality control issues.","translation":"その会社の生産主導のアプローチは、高い生産量を実現しましたが、多くの品質管理上の問題も引き起こしました。"},{"sentence":"A production-driven culture can sometimes neglect innovation and long-term sustainability.","translation":"生産主導の文化は、時にイノベーションや長期的な持続可能性を軽視することがあります。"},{"sentence":"The factory operated under a highly production-driven model, with workers under constant pressure to meet quotas.","translation":"その工場は高度な生産主導型モデルで運営されており、労働者は常にノルマを達成するためのプレッシャーにさらされていました。"}],"collocations":["production-driven approach","production-driven culture","production-driven model","production-driven strategy","production-driven environment"],"synonyms":["output-focused","efficiency-oriented","volume-driven","results-oriented (with emphasis on quantity)"],"antonyms":["quality-driven","customer-focused","market-driven","innovation-driven","value-driven"]},{"part_of_speech":"adjective","definition":"（経済学で）供給主導の","english_definition":"(In economics) Characterized by an emphasis on supply-side factors in driving economic growth.","examples":[{"sentence":"The government's policies were criticized for being too production-driven, neglecting demand-side stimulus.","translation":"政府の政策は、需要側の刺激を軽視し、生産主導に偏りすぎていると批判されました。"}],"collocations":["production-driven economy","production-driven growth"],"synonyms":["supply-side"],"antonyms":["demand-driven"]}],"etymology":{"value":"The term is formed by combining \"production\" (the process of creating goods or services) with \"driven\" (motivated or controlled by a particular force or factor).","priority":"★★☆"},"pronunciation":{"ipa":"/prəˈdʌkʃən ˌdrɪvən/","syllables":"pro-duc-tion-dri-ven"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"\"Production-driven\" describes something that is primarily motivated or controlled by the desire to increase production. It often implies a focus on quantity over quality or other factors. In an economic context, it refers to an approach that emphasizes supply-side economics. It can have negative connotations, suggesting a lack of balance or consideration for other important aspects.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is production driven to make more profit.","correct":"✓ The company is production-driven to make more profit.","note":"The hyphen is important to connect the two words into a single adjective. Without the hyphen, the sentence is grammatically incorrect."},{"incorrect":"✗ The production driven of the company is very high.","correct":"✓ The production output of the company is very high. / ✓ The company is production-driven.","note":"\"Production driven\" is an adjective, not a noun. Use \"production output\" or rephrase the sentence."}],"priority":"★★☆"},"related_words":{"derivatives":["production (noun)","driven (adjective)"],"related_terms":["market-driven","customer-driven","demand-driven","supply-side economics"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, used in business and economics contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"production-driven\" is used in business and economics to describe a situation where the primary focus is on increasing the amount of goods or services produced. This often means that other factors, such as quality or customer satisfaction, are given less importance. It can also refer to economic policies that prioritize increasing the supply of goods and services. Because it's a specialized term, it's more commonly used in professional or academic settings."},"example_sentences":[{"sentence":"The factory's **production-driven** approach resulted in a significant increase in output.","translation":"その工場の生産主導のアプローチは、生産量の大幅な増加をもたらしました。","type":"adjective","meaning_category":"生産重視"},{"sentence":"A **production-driven** strategy can lead to burnout among employees.","translation":"生産主導の戦略は、従業員の燃え尽き症候群につながる可能性があります。","type":"adjective","meaning_category":"生産重視"},{"sentence":"The government's **production-driven** policies aimed to stimulate economic growth through increased supply.","translation":"政府の生産主導の政策は、供給の増加を通じて経済成長を刺激することを目的としていました。","type":"adjective","meaning_category":"供給主導"}]}