{"word":"reparked","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(車などを)再び駐車する、駐車し直す","english_definition":"to park (a vehicle) again or in a different place.","examples":[{"sentence":"I reparked the car to avoid getting a ticket.","translation":"切符を切られるのを避けるために、車を駐車し直した。"},{"sentence":"He reparked the truck so it wouldn't block the driveway.","translation":"彼はトラックを車道がふさがらないように駐車し直した。"}],"collocations":["repark a car","repark a vehicle"],"synonyms":["reposition","move","relocate"],"antonyms":["leave","abandon"]}],"etymology":{"value":"The word 'reparked' is formed by adding the prefix 're-' (meaning 'again' or 'anew') to the word 'parked', which is the past tense and past participle of the verb 'park'. The verb 'park' comes from the Middle English 'park', referring to an enclosed area, and later extended to mean leaving a vehicle in a designated area.","priority":"★★★"},"pronunciation":{"ipa":"/ˌriːˈpɑːrkt/","syllables":"re-parked"},"inflection":{"verb_forms":{"present_simple":["repark","reparks"],"past_simple":"reparked","past_participle":"reparked","present_participle":"reparking"}},"usage_notes":{"explanation":"'Reparked' is a relatively straightforward word. It simply means to park something, usually a vehicle, again. The reason for reparking might be to improve the parking position, avoid a fine, or make space for something else.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I reparked the car on the street.","correct":"✓ I reparked the car in the driveway.","note":"The preposition 'on' is generally used for surfaces, while 'in' is used for enclosed spaces or designated areas. The correct preposition depends on the context. If the car was parked 'on' the street, it could mean it was illegally parked. 'In' the driveway is more appropriate if the driveway is the designated parking area."}],"priority":"★★☆"},"related_words":{"derivatives":["reparking (noun): the act of parking again"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (not commonly listed in CEFR vocabularies)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'reparked' is a compound verb formed by adding the prefix 're-' to the verb 'park'. It is relatively easy to understand as it directly implies performing the action of parking again. The context usually involves vehicles and the need to adjust their parking position. While not a very common word, it is easily understood by native English speakers.","priority":"★★☆"},"example_sentences":[{"sentence":"She **reparked** her car after realizing it was too close to the fire hydrant.","translation":"彼女は消防栓に近すぎることに気づき、車を駐車し直した。","type":"verb","meaning_category":"駐車し直す"},{"sentence":"He **reparked** the motorcycle to make room for the delivery truck.","translation":"彼は配達トラックのためにバイクを駐車し直した。","type":"verb","meaning_category":"駐車し直す"}]}