{"word":"Demigoddessship","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The state, condition, or rank of being a female demigod; partial divinity of a female figure.","english_definition":"The state, condition, or rank of being a female demigod; partial divinity of a female figure.","examples":[{"sentence":"Her demigoddessship was evident in her extraordinary powers and beauty.","translation":"彼女の半女神としての地位は、彼女の並外れた力と美しさにおいて明らかだった。"},{"sentence":"The legends spoke of her demigoddessship and her role in protecting the land.","translation":"伝説は彼女の半女神としての地位と、土地を守る彼女の役割について語った。"}],"collocations":["attain demigoddessship","hereditary demigoddessship","divine demigoddessship"],"synonyms":["semi-divinity","partial goddesshood"],"antonyms":["mortality"]}],"etymology":{"value":"Formed by combining \"demigoddess\" (a female demigod) with the suffix \"-ship\" (denoting state, condition, or rank).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɛmiˈɡɒdɛsʃɪp/","syllables":"de-mi-god-dess-ship"},"inflection":{"noun_plural":"Demigoddessships"},"usage_notes":{"explanation":"The term \"demigoddessship\" is relatively rare and primarily used in mythological, fantasy, or religious contexts to describe the status or condition of a female being who is part human and part divine. It emphasizes the partial divinity and the associated powers or responsibilities.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She possessed demigoddessship powers.","correct":"✓ She possessed powers associated with demigoddessship.","note":"Avoid using \"demigoddessship\" directly as an adjective. Instead, use it as a noun to describe the state or condition, and then use adjectives to describe the powers or attributes associated with that state."}],"priority":"★☆☆"},"related_words":{"derivatives":["demigod","demigoddess"],"related_terms":["divinity","goddesshood","heroism"]},"level_frequency":{"CEFR":"N/A (rare word)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"demigoddessship\" is a complex and rare term used in mythological or fantasy contexts to describe the state or condition of being a female demigod. It implies partial divinity and is typically encountered in advanced literary or academic discussions. Understanding the etymology and the concept of demigods is essential for comprehending this term."},"example_sentences":[{"sentence":"The epic poem detailed her journey to achieve demigoddessship.","translation":"その叙事詩は、彼女が半女神としての地位を達成するための旅を詳しく述べた。","type":"noun","meaning_category":"state of being a demigoddess"},{"sentence":"Her demigoddessship granted her control over the elements.","translation":"彼女の半女神としての地位は、彼女に元素を操る力を与えた。","type":"noun","meaning_category":"condition of partial divinity"}]}