{"word":"Heraclidan","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヘラクレスの子孫、ヘラクレスの家系の者","english_definition":"A descendant of Heracles (Hercules); a member of the house or lineage of Heracles.","examples":[{"sentence":"The Heraclidae claimed the right to rule because of their lineage.","translation":"ヘラクレスの子孫たちは、その血統ゆえに支配する権利を主張した。"},{"sentence":"According to legend, many royal families of ancient Greece were Heraclidan.","translation":"伝説によれば、古代ギリシャの多くの王家はヘラクレスの家系であった。"}],"collocations":["Heraclidan dynasty","Heraclidan kings","Heraclidan lineage"],"synonyms":["Heraclid","descendant of Heracles"],"antonyms":[]}],"etymology":{"value":"Derived from the name Heracles (Hercules in Roman mythology) + -id (suffix indicating descent or family membership) + -an (suffix indicating belonging to or associated with).","priority":"★★☆"},"pronunciation":{"ipa":"/hɪˈræklɪdən/","syllables":"He-rac-li-dan"},"inflection":{"noun_plural":"Heraclidae"},"usage_notes":{"explanation":"The term 'Heraclidan' is primarily used in historical and mythological contexts to refer to individuals or groups who traced their ancestry back to the legendary hero Heracles. It is often associated with claims of legitimacy and divine right to rule in ancient Greece.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a Heraclidan hero.","correct":"✓ He was a Heraclidan. / ✓ He was a hero of the Heraclidae.","note":"'Heraclidan' itself refers to a descendant, not a quality. To describe a hero from that lineage, use 'a hero of the Heraclidae' or rephrase."}],"priority":"★☆☆"},"related_words":{"derivatives":["Heracles","Hercules","Heraclid","Heraclidae"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency (historical/mythological context)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Heraclidan' is highly specialized and primarily encountered in the study of ancient Greek history and mythology. Understanding requires familiarity with the legend of Heracles and the significance of lineage in ancient Greek society. Usage is limited to academic or historical discussions.","priority":"★☆☆"},"example_sentences":[{"sentence":"The return of the Heraclidae is a significant event in Greek mythology.","translation":"ヘラクレスの子孫たちの帰還は、ギリシャ神話における重要な出来事である。","type":"noun","meaning_category":"ヘラクレスの子孫"},{"sentence":"The Dorian invasion is sometimes attributed to the Heraclidan migration.","translation":"ドーリア人の侵入は、時にヘラクレスの家系の移動に起因するとされる。","type":"adjective (implied)","meaning_category":"ヘラクレスの家系に関連する"}]}