{"word":"recompounded","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(薬などを)再調合する、再び混合する","english_definition":"To compound again or anew; to remix or reformulate (something, especially a medicine).","examples":[{"sentence":"The pharmacist recompounded the prescription to adjust the dosage.","translation":"薬剤師は投与量を調整するために処方箋を再調合した。"},{"sentence":"The chemist recompounded the mixture after discovering an impurity.","translation":"化学者は不純物を発見した後、混合物を再調合した。"}],"collocations":["recompound a medicine","recompound a formula"],"synonyms":["remix","reformulate","reconstitute"],"antonyms":["decompose","separate"]},{"part_of_speech":"verb","transitivity":"vt","definition":"(利息などを)再複利計算する","english_definition":"To calculate compound interest again, typically over a new period.","examples":[{"sentence":"The bank recompounded the interest annually.","translation":"銀行は年ごとに利息を再複利計算した。"},{"sentence":"The investment firm recompounded the returns to maximize growth.","translation":"投資会社は成長を最大化するために収益を再複利計算した。"}],"collocations":["recompound interest","recompound returns"],"synonyms":["recalculate","recompute"],"antonyms":["simplify","reduce"]}],"etymology":{"value":"The word 'recompounded' is formed by adding the prefix 're-' (meaning 'again' or 'anew') to the word 'compounded'. 'Compound' itself comes from the Latin word 'componere', meaning 'to put together'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːkəmˈpaʊndɪd/","syllables":"re-com-pound-ed"},"inflection":{"verb_forms":{"present_simple":["recompound","recompounds"],"past_simple":"recompounded","past_participle":"recompounded","present_participle":"recompounding"}},"usage_notes":{"explanation":"The term 'recompounded' is relatively uncommon and is primarily used in technical or specialized contexts, such as pharmacy or finance. In pharmacy, it refers to the act of mixing or formulating a substance again, often to adjust its properties or correct an error. In finance, it describes the process of recalculating compound interest, usually to reflect changes in the interest rate or investment period.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The chef recompounded the recipe with new ingredients.","correct":"✓ The chef revised the recipe with new ingredients.","note":"While 'recompounded' implies remixing or reformulating something, it is not typically used in the context of cooking recipes. 'Revised' or 'modified' would be more appropriate. "},{"incorrect":"✗ The problem was recompounded by the lack of resources.","correct":"✓ The problem was exacerbated by the lack of resources.","note":"'Recompounded' is not generally used to describe the worsening of a problem. 'Exacerbated' or 'compounded' (without the 're-') would be more suitable."}],"priority":"★☆☆"},"related_words":{"derivatives":["recompounding (noun: the act of recompounding)"],"phrasal_verbs":[],"related_terms":["compound","compounding","compound interest"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'recompounded' is a technical term that is not commonly used in everyday language. It generally refers to the act of doing something again that involves combining or mixing elements. The most common contexts in which you might encounter this word are in discussions of pharmacy (where it might refer to the re-mixing of a medication) or finance (where it might refer to the recalculation of compound interest). Because of its specialized nature, it is considered a high-level vocabulary word."},"example_sentences":[{"sentence":"The formula was unstable, so it had to be carefully recompounded.","translation":"その処方は不安定だったので、注意深く再調合する必要があった。","type":"verb","meaning_category":"再調合する"},{"sentence":"The fund's returns are recompounded quarterly to maximize investor gains.","translation":"ファンドの収益は投資家の利益を最大化するために四半期ごとに再複利計算される。","type":"verb","meaning_category":"再複利計算する"}]}