{"word":"hermogeniarnun","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare, technical) A hypothetical elementary particle that is its own antiparticle and mediates interactions.","english_definition":"A hypothetical elementary particle that is its own antiparticle and mediates interactions.","examples":[{"sentence":"The existence of hermogeniarnuns is predicted by some extensions of the Standard Model.","translation":"エルモゲニアヌンの存在は、標準模型のいくつかの拡張によって予測されています。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"A blend of 'Hermes' (Greek god associated with mediation) and 'genion' (referring to self-conjugate particles like Majorana fermions).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɜːrmoʊˌdʒiːniˈɑːrnʌn/","syllables":"her-mo-ge-ni-ar-nun"},"inflection":{"noun_plural":"hermogeniarnuns"},"usage_notes":{"explanation":"The term 'hermogeniarnun' is highly specialized and rarely used outside of theoretical physics discussions. It refers to a hypothetical particle with specific properties related to being its own antiparticle and mediating forces.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"related_concepts":["Majorana fermion","self-conjugate particle","Standard Model","particle physics"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very specialized term)","frequency_google_ngram":"Extremely rare","priority":"☆☆☆"},"readability_explanation":{"level":"C2 (highly technical)","text":"The word 'hermogeniarnun' is a highly technical term from theoretical physics. Understanding it requires familiarity with concepts such as elementary particles, antiparticles, mediators, and the Standard Model of particle physics. It is unlikely to be encountered outside of specialized academic or research contexts."},"example_sentences":[{"sentence":"The theoretical properties of hermogeniarnuns are still being investigated.","translation":"エルモゲニアヌンの理論的特性は、まだ調査中です。","type":"noun","meaning_category":"hypothetical particle"}]}