{"word":"propman","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(映画・演劇などの)小道具係、小道具担当者","english_definition":"A person responsible for selecting and handling props in a film, television, or theatrical production.","examples":[{"sentence":"The propman made sure the actor had the correct sword for the scene.","translation":"小道具係は、俳優がそのシーンに合った剣を持っていることを確認した。"},{"sentence":"The propman is in charge of finding and maintaining all the props used in the play.","translation":"小道具係は、劇で使用されるすべての小道具を見つけて管理する責任者だ。"}],"collocations":["head propman","assistant propman","film propman","theater propman"],"synonyms":["props master","property master","props person"],"antonyms":[]}],"etymology":{"value":"A combination of \"prop\" (short for property, referring to the items used in a production) and \"man\" (referring to the person handling the props).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈprɒpˌmæn/","syllables":"prop-man"},"inflection":{"noun_plural":"propmen"},"usage_notes":{"explanation":"The term \"propman\" is commonly used in the film, television, and theater industries to refer to the person who is in charge of the props. The propman is responsible for finding, acquiring, maintaining, and placing all the props used in a production. The propman works closely with the director, set designer, and actors to ensure that the props are appropriate for the scene and are used correctly.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The properman was very helpful.","correct":"✓ The propman was very helpful.","note":"The correct term is \"propman,\" not \"properman.\""}],"priority":"★★☆"},"related_words":{"derivatives":["props","property"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"propman\" is a specialized term used in the film, television, and theater industries. It refers to the person responsible for handling and managing the props used in a production. Understanding this term requires familiarity with the roles and responsibilities within these industries."},"example_sentences":[{"sentence":"The **propman** carefully arranged the antique books on the shelf.","translation":"小道具係は、棚にアンティークの本を丁寧に並べた。","type":"noun","meaning_category":"小道具係"},{"sentence":"The director consulted with the **propman** about the authenticity of the weapons.","translation":"監督は、武器の信憑性について小道具係に相談した。","type":"noun","meaning_category":"小道具係"}]}