{"word":"insurability","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"保険をかけられること、被保険者資格、保険適格性","english_definition":"The state of being insurable; the degree to which something is eligible for insurance coverage.","examples":[{"sentence":"His poor health affected his insurability.","translation":"彼の不健康な状態は、彼の保険適格性に影響を与えた。"},{"sentence":"The insurability of the property was assessed before the policy was issued.","translation":"保険証書が発行される前に、その物件の保険適格性が評価された。"},{"sentence":"Factors affecting insurability include age, health, and lifestyle.","translation":"保険適格性に影響を与える要因には、年齢、健康、ライフスタイルなどがある。"}],"collocations":["assess insurability (保険適格性を評価する)","affect insurability (保険適格性に影響を与える)","determine insurability (保険適格性を決定する)","check insurability (保険適格性を確認する)","insurability risk (保険適格性リスク)"],"synonyms":["eligibility for insurance","coverability","risk assessment"],"antonyms":["uninsurability","ineligibility for insurance"]}],"etymology":{"value":"\"insurable\" (保険をかけられる) + \"-ity\" (名詞を作る接尾辞)","priority":"★★★"},"pronunciation":{"ipa":"/ɪnˌʃʊərəˈbɪləti/","syllables":"in-sur-a-bil-i-ty"},"inflection":{"noun_plural":"insurabilities (まれに)"},"usage_notes":{"explanation":"\"Insurability\" refers to the ability of a person, object, or entity to be insured. It's a key concept in the insurance industry, as insurance companies evaluate insurability to determine whether they will offer coverage and at what premium. Factors such as health, age, lifestyle, location, and the condition of the property can all influence insurability. A low level of insurability may result in higher premiums or denial of coverage.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The insurability is depend on health.","correct":"✓ The insurability depends on health.","note":"\"Insurability\" is a singular noun, so it requires a singular verb form (depends)."},{"incorrect":"✗ He has a good insureability.","correct":"✓ He has good insurability.","note":"\"Insurability\" is already a noun, so it doesn't need an article like \"a\" before it when used as a general concept."}],"priority":"★★☆"},"related_words":{"derivatives":["insurable (形容詞: 保険をかけられる)","insurer (名詞: 保険会社)","insurance (名詞: 保険)","insure (動詞: 保険をかける)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 保険業界や法律関連の文書でよく見られる。","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"\"Insurability\" is a somewhat technical term that refers to whether something can be insured. It's used to talk about the factors that make a person, property, or other entity eligible for insurance coverage. For example, a person with a serious illness might have low insurability for health insurance. Understanding this term is important when dealing with insurance policies and risk assessment. It is not a word used in everyday conversation.","priority":"★★★"},"example_sentences":[{"sentence":"The company specializes in assessing the insurability of high-risk properties.","translation":"その会社は、高リスク物件の保険適格性の評価を専門としている。","type":"general"},{"sentence":"Age and pre-existing conditions can significantly impact a person's insurability for life insurance.","translation":"年齢と既存症（既往症）は、生命保険の保険適格性に大きな影響を与える可能性がある。","type":"general"},{"sentence":"Due to the high crime rate in the area, the insurability of local businesses is a major concern.","translation":"その地域の高い犯罪率のため、地元の企業の保険適格性が大きな懸念事項となっている。","type":"general"}]}