{"word":"Leucocism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"白変種: 動物において、色素細胞の減少によって引き起こされる、部分的なまたは完全な色素の喪失。ただし、アルビノとは異なり、目の色は通常影響を受けない。","english_definition":"A condition characterized by reduced pigmentation in animals caused by a recessive gene; unlike albinism, it can result in either partial or total loss of pigmentation, but the eyes are not usually affected.","examples":[{"sentence":"The bird had leucocism, resulting in its unusually pale plumage.","translation":"その鳥は白変種であり、その結果、その羽毛は異常に淡い色になった。"},{"sentence":"Leucocism is different from albinism because it doesn't affect the pigment in the eyes.","translation":"白変種は、アルビノとは異なり、目の色素には影響を与えない。"}],"collocations":["partial leucocism (部分的な白変種)","total leucocism (完全な白変種)","exhibit leucocism (白変種を示す)"],"synonyms":["hypomelanism","amelanism"],"antonyms":["melanism","albinism"]}],"etymology":{"value":"ギリシャ語の leukos (λευκός)「白い」+ -ism (状態を示す接尾辞)に由来する。","priority":"★★★"},"pronunciation":{"ipa":"/ljuˈkoʊsɪzəm/","syllables":"Leu-co-cis-m"},"inflection":{"noun_plural":"Leucocisms"},"usage_notes":{"explanation":"Leucocismは、動物の色素異常の一種で、メラニン色素の減少または欠如によって、体の一部または全体が白くなる現象を指します。アルビノ (albinism) と混同されやすいですが、leucocismは必ずしも全身の色素を失うわけではなく、目の色も正常であることが多いです。また、遺伝的な要因だけでなく、環境要因によって引き起こされる場合もあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The leucocism animal was completely white with red eyes.","correct":"✓ The leucistic animal was mostly white, but its eyes retained their normal color.","note":"Leucocism does not typically affect eye color, unlike albinism which often results in red or pink eyes."},{"incorrect":"✗ Leucocism is the same as albinism.","correct":"✓ Leucocism is similar to albinism but differs in that it doesn't always cause complete loss of pigment and usually doesn't affect eye color.","note":"It's important to distinguish leucocism from albinism."}],"priority":"★★☆"},"related_words":{"derivatives":["leucistic (形容詞: 白変種の)"],"related_terms":["albinism (アルビノ)","melanism (黒化)","pigmentation (色素形成)","amelanistic (形容詞: 無色素の)","hypomelanistic (形容詞: 低色素の)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - 科学的な文脈でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Leucocism**」は、動物が持つ色素が少なくなる状態を指す専門用語です。アルビノと似ていますが、白変種の場合は目の色が普通であることが多いです。この単語は、生物学や動物学の分野でよく使われます。例えば、「その鳥は白変種の特徴を持っていた」のように使います。専門的な内容を理解するために必要な語彙です。"},"example_sentences":[{"sentence":"The researchers studied the genetic basis of leucocism in a population of squirrels.","translation":"研究者たちは、リスの集団における白変種の遺伝的基盤を研究した。","type":"noun","meaning_category":"白変種"},{"sentence":"The leucistic tiger had striking white fur with faint stripes.","translation":"その白変種のトラは、かすかな縞模様のある印象的な白い毛皮を持っていた。","type":"adjective (leucistic)","meaning_category":"白変種の"},{"sentence":"Unlike albinism, leucocism allows for some pigment production, resulting in varied appearances.","translation":"アルビノとは異なり、白変種はいくつかの色素生成を可能にし、その結果、さまざまな外観をもたらす。","type":"noun","meaning_category":"白変種"}]}