{"word":"semipedal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"半歩行性の、二足歩行と四足歩行の中間の歩行様式を持つ","english_definition":"Having a mode of locomotion intermediate between quadrupedal and bipedal; moving partly or sometimes on two legs.","examples":[{"sentence":"Some dinosaurs were semipedal, using their forelimbs for support at times.","translation":"一部の恐竜は半歩行性で、時には前肢を支えに使っていた。"},{"sentence":"The researcher studied the semipedal movements of the primate species.","translation":"研究者はその霊長類の半歩行性の動きを研究した。"}],"collocations":["semipedal locomotion","semipedal gait","semipedal posture"],"synonyms":["partially bipedal"],"antonyms":["quadrupedal","bipedal"]}],"etymology":{"value":"From Latin 'semi-' (half) + 'pedalis' (relating to the foot), from 'pes' (foot).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɛmiˈpiːdl/","syllables":"se-mi-pe-dal"},"inflection":{"notes":"Comparative and superlative forms are formed regularly: more semipedal, most semipedal."},"usage_notes":{"explanation":"'Semipedal' describes animals that sometimes walk on two legs and sometimes on four. It is a relatively uncommon term, primarily used in zoology, paleontology, and related fields.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The robot was semipedal, using only one leg to move.","correct":"✓ The robot was unipedal, using only one leg to move.","note":"'Semipedal' implies the use of two legs sometimes, whereas 'unipedal' means using only one leg."}],"priority":"★★☆"},"related_words":{"derivatives":["semipede (noun, rare): An animal that is partially bipedal."],"related_terms":["bipedal","quadrupedal","locomotion","gait"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Semipedal' is a specialized term used in biology and paleontology to describe a type of locomotion that is intermediate between walking on all fours (quadrupedal) and walking on two legs (bipedal). It is not a commonly used word in everyday language. Understanding this term requires familiarity with scientific vocabulary related to animal movement."},"example_sentences":[{"sentence":"The fossil evidence suggests that the early hominids exhibited semipedal behavior.","translation":"化石の証拠は、初期の人類が半歩行性の行動を示していたことを示唆している。","type":"general","meaning_category":"locomotion"},{"sentence":"The lizard's semipedal stance allowed it to scan the environment for predators.","translation":"そのトカゲの半歩行性の姿勢は、捕食者を求めて環境をスキャンすることを可能にした。","type":"general","meaning_category":"posture"}]}