{"word":"jussives","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"命令形（文法）","english_definition":"(grammar) A verb form expressing a command or strong encouragement.","examples":[{"sentence":"Jussives are commonly used in ancient languages like Hebrew and Arabic.","translation":"命令形はヘブライ語やアラビア語のような古代言語でよく使われます。"},{"sentence":"The jussive mood is often distinguished from the imperative mood by its degree of force.","translation":"命令法は、その強さの度合いによって、命令形と区別されることが多いです。"}],"collocations":["jussive mood","form a jussive","use a jussive"],"synonyms":["imperative","command","injunction"],"antonyms":["optative","hortatory"]}],"etymology":{"value":"The term \"jussive\" comes from the Latin word \"jussivus,\" which means \"ordered\" or \"commanded.\" This is derived from \"jubēre,\" meaning \"to order.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒʌsɪvz/","syllables":"jus-sives"},"inflection":{"noun_plural":"jussives"},"usage_notes":{"explanation":"In grammar, a jussive is a verbal mood that expresses a command, exhortation, or strong encouragement. It is often used in contexts where the speaker has authority or wishes to strongly influence the action of the listener. The jussive is found in various languages, including Semitic languages like Arabic and Hebrew. It is often similar in form to the subjunctive or imperative, but carries a distinct nuance of forceful urging or command.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The jussive is same as the imperative.","correct":"✓ The jussive is similar to the imperative, but expresses a different nuance.","note":"While both express commands, the jussive often carries a stronger or different nuance than the imperative."}],"priority":"★☆☆"},"related_words":{"derivatives":["jussive (adjective)"],"related_terms":["imperative","subjunctive","mood (grammar)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily used in linguistic or grammatical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"jussive\" refers to a grammatical mood that expresses a command or strong encouragement. This term is primarily used in the context of linguistics and grammar, particularly when discussing ancient languages. It is less commonly encountered in everyday language and more often found in academic or specialized texts on language. Understanding the jussive mood requires a basic knowledge of grammatical concepts such as mood, tense, and verb forms.","priority":"★☆☆"},"example_sentences":[{"sentence":"The Arabic jussive is used to express commands in certain grammatical constructions.","translation":"アラビア語の命令形は、特定の文法構造で命令を表すために使用されます。","type":"example","meaning_category":"Grammatical usage"},{"sentence":"In Hebrew, the jussive often appears in biblical texts.","translation":"ヘブライ語では、命令形は聖書のテキストによく見られます。","type":"example","meaning_category":"Language example"}]}