{"word":"mortling","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A young or recently dead salmon or trout.","english_definition":"A young salmon or trout, especially one recently dead.","examples":[{"sentence":"The river was littered with mortlings after the pollution incident.","translation":"汚染事故の後、川は死んだばかりの若いサケやマスの死骸で散乱していた。"},{"sentence":"Fishermen reported seeing many mortlings in the shallows.","translation":"漁師たちは浅瀬で多くの若いサケやマスを見たと報告した。"}],"collocations":["river mortlings","salmon mortlings","trout mortlings"],"synonyms":["fry","fingerling","smolt"],"antonyms":[]}],"etymology":{"value":"Derived from 'mort', meaning death, combined with the diminutive suffix '-ling', indicating something small or young.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɔːrtlɪŋ/","syllables":"mort-ling"},"inflection":{"noun_plural":"mortlings"},"usage_notes":{"explanation":"'Mortling' specifically refers to young salmonids (salmon and trout) that have recently died. It's a relatively uncommon term, often used in contexts related to fisheries, ecology, or environmental studies. The term emphasizes the recent death of the young fish.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The mortling swam upstream.","correct":"✓ The fry swam upstream.","note":"A mortling is dead, so it cannot swim. Use 'fry' or 'fingerling' to describe a live young salmon or trout."},{"incorrect":"✗ He caught a large mortling.","correct":"✓ He found a large mortling.","note":"Mortlings are dead, so they are found, not caught."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["mort (death)","ling (suffix indicating young or small)","salmonid (family of fish including salmon and trout)"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Mortling' is a specialized term used to describe a young, recently deceased salmon or trout. Due to its specific and technical nature, it is not commonly encountered in general language use and is more likely to appear in scientific or ecological contexts. Understanding this term requires knowledge of both the life cycle of salmonids and vocabulary related to death and decay in natural environments."},"example_sentences":[{"sentence":"The biologist examined the mortlings to determine the cause of death.","translation":"生物学者は死因を特定するために、死んだばかりの若い魚を調べた。","type":"noun","meaning_category":"young dead fish"},{"sentence":"The high water temperature led to a significant increase in mortlings.","translation":"水温の上昇は、死んだばかりの若い魚の著しい増加につながった。","type":"noun","meaning_category":"young dead fish"}]}