{"word":"Lactucol","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A bitter, crystalline sesquiterpene lactone found in lettuce (Lactuca sativa) and related species. It is one of the active components responsible for the sedative and analgesic properties of lettuce.","english_definition":"A bitter, crystalline sesquiterpene lactone found in lettuce (Lactuca sativa) and related species, thought to contribute to its sedative properties.","examples":[{"sentence":"Lactucol is extracted from lettuce and used in some traditional medicines.","translation":"ラクトゥコールはレタスから抽出され、一部の伝統医学で使用されています。"},{"sentence":"The sedative effects of lettuce are partly attributed to the presence of lactucol.","translation":"レタスの鎮静効果は、一部ラクトゥコールの存在に起因すると考えられています。"}],"collocations":["extract lactucol","sedative properties of lactucol","lactucol content"],"synonyms":["lettuce opium","lactucarium"],"antonyms":[]}],"etymology":{"value":"Derived from *Lactuca*, the genus name for lettuce, and the suffix *-ol*, commonly used in chemistry to denote an alcohol or related compound.","priority":"★★☆"},"pronunciation":{"ipa":"/lækˈtjuːkɒl/","syllables":"Lac-tu-col"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Lactucol is primarily of scientific or historical interest, related to the study of natural products and traditional medicine. It is not a commonly used term in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["lactucarium","lactucin","lactupicrin"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Lactucol' is a technical term primarily encountered in scientific or historical contexts related to botany, chemistry, or traditional medicine. A strong understanding of scientific vocabulary and plant-based compounds is needed to understand this term."},"example_sentences":[{"sentence":"The study investigated the concentration of lactucol in different varieties of lettuce.","translation":"その研究では、さまざまな種類のレタスに含まれるラクトゥコールの濃度が調査されました。","type":"noun","meaning_category":"chemical compound"},{"sentence":"Historically, lactucol was considered to be a key component of lactucarium, a lettuce-derived sedative.","translation":"歴史的に、ラクトゥコールは、レタス由来の鎮静剤であるラクツカリウムの主要な成分であると考えられていました。","type":"noun","meaning_category":"historical medicinal compound"}]}