{"word":"size-restrictive","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"サイズ制限のある、サイズが制限的な","english_definition":"Imposing limitations or restrictions based on size.","examples":[{"sentence":"The park has size-restrictive regulations for dogs.","translation":"その公園には犬のサイズに関する制限的な規則がある。"},{"sentence":"The competition is size-restrictive, only allowing small cars to participate.","translation":"その競技会はサイズ制限があり、小型車のみ参加できる。"},{"sentence":"The software has size-restrictive parameters for image uploads.","translation":"そのソフトウェアには、画像アップロードに関するサイズ制限的なパラメータがある。"}],"collocations":["size-restrictive regulations","size-restrictive parameters","size-restrictive policies","size-restrictive design"],"synonyms":["size-limited","size-constrained","dimensionally-restricted"],"antonyms":["size-unrestricted","size-flexible","size-unlimited"]}],"etymology":{"value":"The word is formed by combining 'size' (referring to dimensions or magnitude) with 'restrictive' (imposing limitations or constraints).","priority":"N/A"},"pronunciation":{"ipa":"/saɪz rɪˈstrɪktɪv/","syllables":"size-re-stric-tive"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than forming comparative and superlative degrees (more size-restrictive, most size-restrictive)."},"usage_notes":{"explanation":"'Size-restrictive' is used to describe something that imposes limits or constraints based on the physical dimensions or magnitude of an object or entity. It is often used in contexts where size is a critical factor, such as regulations, design specifications, or competition rules.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The size restrictive is applied to all vehicles.","correct":"✓ The size restriction is applied to all vehicles.","note":"'Size restrictive' is an adjective describing something. The noun form 'size restriction' is used to refer to the limitation itself."}],"priority":"N/A"},"related_words":{"derivatives":["restriction (noun)","restrict (verb)","restrictive (adjective)"],"related_terms":["size limit","size constraint","dimensional restriction"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Size-restrictive' is a technical term used to describe something that limits or restricts based on size. It is commonly used in formal contexts such as regulations, specifications, or technical descriptions. It implies that there are specific size requirements that must be met. Understanding this term requires a good grasp of vocabulary related to measurement, limitations, and specifications."},"example_sentences":[{"sentence":"The bridge has size-restrictive signage indicating the maximum vehicle height.","translation":"その橋には、車両の最大高を示すサイズ制限の標識がある。","type":"adjective","meaning_category":"サイズ制限のある"},{"sentence":"The new policy is size-restrictive, favoring smaller businesses.","translation":"その新しい政策はサイズ制限的であり、小規模企業を優遇している。","type":"adjective","meaning_category":"サイズが制限的な"},{"sentence":"The software's size-restrictive feature prevents users from uploading large files.","translation":"そのソフトウェアのサイズ制限機能により、ユーザーは大容量ファイルをアップロードできない。","type":"adjective","meaning_category":"サイズ制限のある"}]}