{"word":"worldly-led","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"主導権が世俗的な価値観や目標によって握られている、世俗的な考え方に導かれた","english_definition":"Guided or controlled by secular values, goals, or considerations; characterized by a focus on material or temporal concerns rather than spiritual ones.","examples":[{"sentence":"The organization's decisions seemed increasingly worldly-led, prioritizing profit over ethical considerations.","translation":"その組織の決定は、倫理的な配慮よりも利益を優先し、ますます世俗的な考え方に導かれているように見えた。"},{"sentence":"Some critics argue that modern society is too worldly-led, neglecting the importance of inner peace and spiritual growth.","translation":"現代社会は世俗的な考え方に偏りすぎており、心の平安や精神的な成長の重要性を軽視していると批判する人もいる。"}],"collocations":["worldly-led society","worldly-led decisions","worldly-led priorities","become worldly-led","increasingly worldly-led"],"synonyms":["secular-driven","materialistic","temporal-focused","earthly-minded","pragmatic"],"antonyms":["spiritually-led","ethically-driven","values-based","principled","idealistic"]}],"etymology":{"value":"Combines 'worldly' (relating to the world and its affairs, rather than spiritual matters) with 'led' (guided or directed). The term implies that the direction or guidance is coming from a worldly perspective.","priority":"Low"},"pronunciation":{"ipa":"/ˈwɜːrldli ˈlɛd/","syllables":"world-ly-led"},"inflection":{"notes":"Adjective; does not inflect"},"usage_notes":{"explanation":"'Worldly-led' is often used in a critical context to suggest that something is overly focused on material success, power, or other secular goals, potentially at the expense of moral or spiritual values. It implies a lack of higher purpose or ethical grounding. The term is relatively uncommon and is often used in discussions about ethics, religion, or social values.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"✗ The leader was worldly-lead.","correct":"✓ The leader was worldly-led.","note":"The correct past participle form of 'lead' (to guide) is 'led,' not 'lead.'"},{"incorrect":"✗ The company is worldly led.","correct":"✓ The company is worldly-led.","note":"Hyphenation is important for clarity. 'Worldly-led' functions as a compound adjective modifying the noun."}],"priority":"Low"},"related_words":{"derivatives":["worldly (adjective)","worldliness (noun)","led (verb)"],"phrases":["world-weary","worldly possessions","lead (verb)"],"priority":"Low"},"level_frequency":{"CEFR":"N/A (Uncommon)","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C2","text":"'Worldly-led' is a relatively uncommon and sophisticated term. Understanding it requires familiarity with the concept of 'worldly' values as opposed to spiritual or ethical ones. It is often used in academic or philosophical discussions about the direction of society or organizations. The term implies a critical perspective, suggesting that an overemphasis on secular goals can be detrimental."},"example_sentences":[{"sentence":"The university's shift towards vocational training was seen by some as a sign of becoming increasingly worldly-led.","translation":"大学の職業訓練への移行は、一部の人々から、ますます世俗的な考え方に導かれている兆候と見なされた。","type":"adjective","meaning_category":"guided by secular values"},{"sentence":"In a society that is so worldly-led, it can be difficult to maintain a sense of spiritual purpose.","translation":"非常に世俗的な考え方に導かれている社会では、精神的な目的意識を維持することが難しい場合がある。","type":"adjective","meaning_category":"focused on material concerns"}]}