{"word":"unaffliction","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"苦しみがない状態、苦難からの解放、平穏","english_definition":"The state of being free from suffering or distress; a release from affliction; tranquility.","examples":[{"sentence":"The monk sought unaffliction through meditation.","translation":"その僧侶は瞑想を通して苦しみからの解放を求めた。"},{"sentence":"The doctor's goal was to bring unaffliction to his patients.","translation":"その医者の目標は、患者に苦痛からの解放をもたらすことだった。"},{"sentence":"After years of hardship, she finally found unaffliction in her new life.","translation":"長年の苦難の後、彼女はついに新しい生活で平穏を見つけた。"}],"collocations":["find unaffliction","seek unaffliction","bring unaffliction","state of unaffliction"],"synonyms":["peace","tranquility","serenity","relief","comfort","ease","well-being","freedom from suffering"],"antonyms":["affliction","suffering","distress","misery","torment","hardship"]}],"etymology":{"value":"\"un-\" (否定の接頭辞) + \"affliction\" (苦しみ、苦難)","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnəˈflɪkʃən/","syllables":"un-af-flic-tion"},"inflection":{"noun_plural":"unafflictions"},"usage_notes":{"explanation":"\"Unaffliction\" is a relatively uncommon word that describes the absence of suffering or the state of being free from distress. It often implies a sense of peace, tranquility, or relief. It is more formal and less frequently used than synonyms like \"peace\" or \"relief.\"","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He felt unaffliction because he was happy.","correct":"✓ He felt unaffliction because his pain had subsided.","note":"\"Unaffliction\" specifically refers to the absence of suffering or distress, not just general happiness. It's more appropriate when describing the relief from a negative state."},{"incorrect":"✗ The unaffliction of the poor is a major concern.","correct":"✓ The affliction of the poor is a major concern.","note":"Be careful not to confuse \"unaffliction\" with \"affliction.\" \"Affliction\" refers to suffering, while \"unaffliction\" refers to the absence of suffering."}],"priority":"★★☆"},"related_words":{"derivatives":["affliction","afflict","unafflicted"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unaffliction' is a formal and uncommon word. It means the state of being free from suffering or distress. It is used in contexts where you want to emphasize the absence of hardship or the attainment of peace and tranquility. Because it is not a commonly used word, it is more likely to be found in formal writing or philosophical discussions."},"example_sentences":[{"sentence":"The yoga retreat promised a path to inner peace and unaffliction.","translation":"そのヨガリトリートは、内なる平和と苦しみからの解放への道を提供すると約束した。","type":"general","meaning_category":"freedom from suffering"},{"sentence":"She dedicated her life to bringing unaffliction to those living in poverty.","translation":"彼女は貧困の中で暮らす人々に苦しみからの解放をもたらすために人生を捧げた。","type":"general","meaning_category":"relief from distress"},{"sentence":"The artist's work explored themes of suffering and the eventual attainment of unaffliction.","translation":"その芸術家の作品は、苦しみと最終的な平穏の達成というテーマを探求した。","type":"general","meaning_category":"tranquility"}]}