{"word":"phyllaries","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"総苞片（そうほうへん）：キク科などの植物の花の頭状花序を包む苞の集合","english_definition":"plural of phyllary: the individual bracts forming the involucre surrounding the flower head of a composite plant (such as a sunflower or daisy).","examples":[{"sentence":"The phyllaries of this thistle are spiny.","translation":"このアザミの総苞片は棘がある。"},{"sentence":"The shape and arrangement of the phyllaries are important characteristics for identifying different species of Asteraceae.","translation":"総苞片の形状と配置は、キク科の異なる種を識別するための重要な特徴である。"}],"collocations":["involucral phyllaries","reflexed phyllaries","erect phyllaries"],"synonyms":["bracts","involucral bracts"],"antonyms":[]}],"etymology":{"value":"Derived from the Ancient Greek word 'phyllon' (φύλλον) meaning 'leaf', combined with the suffix '-ary' indicating a part or pertaining to.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɪləriz/","syllables":"phyl-la-ries"},"inflection":{"noun_plural":"phyllaries"},"usage_notes":{"explanation":"'Phyllaries' specifically refers to the bracts that make up the involucre surrounding the flower head in plants of the Asteraceae (Compositae) family, such as sunflowers, daisies, and thistles. The number, shape, arrangement, and texture of phyllaries are important diagnostic features for plant identification.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The phyllaries are petals.","correct":"✓ The phyllaries are bracts.","note":"Phyllaries are modified leaves (bracts), not petals. Petals are part of the flower corolla, while phyllaries are part of the involucre surrounding the flower head."}],"priority":"★★☆"},"related_words":{"derivatives":["phyllary (singular form)","involucre (the structure formed by the phyllaries)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Phyllaries' is a botanical term referring to the individual bracts that form the involucre (a protective layer of bracts) around the flower head in plants of the Asteraceae family. Understanding this term requires some familiarity with plant morphology and botanical vocabulary. It is typically encountered in advanced botanical texts or field guides.","example_sentences":[]}}