{"word":"Afrocentrism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"アフリカ中心主義：アフリカの歴史と文化を、世界史と文化の中心として捉える思想。アフリカの視点から歴史や文化を再解釈し、アフリカ人の貢献を強調する。","english_definition":"A worldview that emphasizes the importance of African people and their descendants in history, culture, and achievements. It centers the study of history and culture on African perspectives.","examples":[{"sentence":"Afrocentrism seeks to correct historical distortions and biases against African contributions.","translation":"アフリカ中心主義は、アフリカの貢献に対する歴史的な歪曲や偏見を正そうとする。"},{"sentence":"Some scholars criticize Afrocentrism for its potential to promote historical revisionism.","translation":"一部の学者は、アフリカ中心主義が歴史修正主義を助長する可能性を批判している。"},{"sentence":"Afrocentrism has influenced the curriculum in some schools, particularly in African American studies programs.","translation":"アフリカ中心主義は、一部の学校、特にアフリカ系アメリカ人研究プログラムのカリキュラムに影響を与えている。"}],"collocations":["Afrocentric perspective (アフリカ中心の視点)","Afrocentric education (アフリカ中心の教育)","Afrocentric curriculum (アフリカ中心のカリキュラム)","critics of Afrocentrism (アフリカ中心主義の批判者)","supporters of Afrocentrism (アフリカ中心主義の支持者)"],"synonyms":["African-centeredness","African-centered perspective"],"antonyms":["Eurocentrism","Western-centrism"]},{"part_of_speech":"noun","definition":"アフリカ中心主義：アフリカ文化、歴史、政治、経済、社会問題の研究におけるアフリカ人の視点と経験を重視する学問的アプローチ。","english_definition":"An academic approach that prioritizes the perspectives and experiences of African people in the study of African culture, history, politics, economics, and social issues.","examples":[{"sentence":"Afrocentrism challenges the Eurocentric bias in traditional historical narratives.","translation":"アフリカ中心主義は、伝統的な歴史的記述におけるヨーロッパ中心の偏見に挑戦する。"},{"sentence":"Afrocentrism encourages a deeper understanding of African civilizations and their impact on the world.","translation":"アフリカ中心主義は、アフリカ文明とその世界への影響についてのより深い理解を促す。"},{"sentence":"The Afrocentric approach emphasizes the agency and resilience of African people in the face of adversity.","translation":"アフリカ中心のアプローチは、逆境に直面したアフリカの人々の主体性と回復力を強調する。"}],"collocations":["Afrocentric scholarship (アフリカ中心の学問)","Afrocentric methodology (アフリカ中心の方法論)","Afrocentric research (アフリカ中心の研究)","Afrocentric analysis (アフリカ中心の分析)"],"synonyms":["African-centered scholarship","African-centered analysis"],"antonyms":["Eurocentric scholarship","Eurocentric analysis"]}],"etymology":{"value":"'Afro-' (アフリカ) + 'centrism' (中心主義) からなる造語。20世紀後半に、アフリカ系アメリカ人の知識人や活動家によって提唱された。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæfroʊˈsɛntrɪzəm/","syllables":"Af-ro-cen-trism"},"inflection":{"notes":"不可算名詞"},"usage_notes":{"explanation":"「**Afrocentrism**」は、アフリカの歴史、文化、視点を重視する思想および学問的アプローチを指します。これは、歴史的および文化的な記述において、ヨーロッパ中心主義的な偏見を是正し、アフリカ人の貢献と経験を強調することを目的としています。ただし、歴史修正主義や排他的な視点につながる可能性があるとして批判されることもあります。学術的な文脈では、アフリカ研究においてアフリカ人の視点を重視する研究方法論を指すことがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Afrocentrism is only for African people.","correct":"✓ Afrocentrism is a perspective that centers African history and culture, and is open to anyone who wants to learn about it.","note":"アフリカ中心主義はアフリカ人だけのものではなく、アフリカの歴史と文化に関心のあるすべての人に開かれています。"},{"incorrect":"✗ Afrocentrism is the same as racism.","correct":"✓ Afrocentrism is a perspective that emphasizes African contributions, while racism is the belief that one race is superior to another.","note":"アフリカ中心主義はアフリカの貢献を強調する視点であり、人種差別は特定の民族が他の民族よりも優れていると信じることです。これらは異なります。"},{"incorrect":"✗ Afrocentrism is always historically accurate.","correct":"✓ While Afrocentrism aims to correct historical biases, it is important to critically evaluate all historical claims, including those made within an Afrocentric framework.","note":"アフリカ中心主義は歴史的な偏見を正すことを目指していますが、アフリカ中心の枠組みで行われた主張を含め、すべての歴史的主張を批判的に評価することが重要です。"}],"priority":"★★☆"},"related_words":{"derivatives":["Afrocentric (形容詞：アフリカ中心の)","Afrocentrist (名詞：アフリカ中心主義者)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"比較的低頻度 (Relatively low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Afrocentrism**」は、アフリカの歴史や文化を世界史の中心として捉え、アフリカ人の視点から歴史を再解釈する思想や学問的アプローチを指す言葉です。この概念は、歴史的な偏見を是正し、アフリカ人の貢献を強調することを目的としていますが、歴史修正主義や排他的な視点につながる可能性もあるため、批判的に理解する必要があります。学術的な文脈では、アフリカ研究においてアフリカ人の視点を重視する研究方法論を指すことがあります。関連語として、「Afrocentric（アフリカ中心の）」や「Afrocentrist（アフリカ中心主義者）」があります。"},"example_sentences":[{"sentence":"The professor's lectures were heavily influenced by **Afrocentrism**.","translation":"教授の講義はアフリカ中心主義の影響を強く受けていた。","type":"noun","meaning_category":"アフリカ中心主義の思想"},{"sentence":"Some critics argue that **Afrocentrism** can lead to historical inaccuracies.","translation":"一部の批評家は、アフリカ中心主義が歴史的な不正確さにつながる可能性があると主張している。","type":"noun","meaning_category":"アフリカ中心主義の思想"},{"sentence":"An **Afrocentric** perspective is essential for understanding the complexities of African history.","translation":"アフリカの歴史の複雑さを理解するためには、アフリカ中心の視点が不可欠である。","type":"adjective (related word)","meaning_category":"アフリカ中心の"}]}