{"word":"memorialism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(神学)聖餐におけるキリストの臨在を象徴的なものとみなす見解。聖餐はキリストの死を記念する行為にすぎないと考える。","english_definition":"(theology) the view that the Eucharist is simply a commemoration of Christ's death, with no real presence of Christ in the elements.","examples":[{"sentence":"Memorialism is a common view among some Protestant denominations.","translation":"記念説は、一部のプロテスタント教派の間で一般的な見解です。"},{"sentence":"Zwingli was a key proponent of memorialism.","translation":"ツヴィングリは記念説の主要な提唱者でした。"}],"collocations":["Eucharistic memorialism","Zwinglian memorialism"],"synonyms":["Zwinglianism","symbolic presence view"],"antonyms":["real presence","consubstantiation","transubstantiation"]}],"etymology":{"value":"'memorial' + '-ism' から構成される。聖餐が単なる記念であるという考え方を表すために作られた言葉。","priority":"★☆☆"},"pronunciation":{"ipa":"/məˈmɔːriəlɪzəm/","syllables":"me-mo-ri-al-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Memorialismは、聖餐（聖体拝領、聖晩餐）の解釈に関する神学的な立場の一つです。これは、パンとぶどう酒はキリストの体と血を象徴するものであり、聖餐はキリストの犠牲を思い起こし、記念する行為であると主張します。キリストが文字通りパンとぶどう酒の中に存在するという「実質変化説」（transubstantiation）や、キリストがパンとぶどう酒と「共に」存在する（consubstantiation）という見解とは対照的です。この見解は、特に宗教改革期のツヴィングリによって提唱されました。","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["memorialist (名詞: 記念説を信奉する人)","memorialize (動詞: 記念する)"],"phrases":[]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"'Memorialism' is a theological term referring to a specific understanding of the Eucharist (Holy Communion). It suggests that the bread and wine used in the sacrament are symbolic representations of Christ's body and blood, and the ceremony is primarily a commemoration or remembrance of Christ's sacrifice. This view contrasts with other theological interpretations like transubstantiation (where the bread and wine become the actual body and blood of Christ) and consubstantiation (where Christ's body and blood coexist with the bread and wine). Understanding 'memorialism' requires familiarity with Christian theology and sacramental theology.","priority":"★☆☆"},"example_sentences":[{"sentence":"The doctrine of memorialism denies any real presence of Christ in the Eucharist.","translation":"記念説の教義は、聖餐におけるキリストの真の臨在を否定します。","type":"noun","meaning_category":"theological view"},{"sentence":"Some reformers adopted a memorialist view of the Lord's Supper.","translation":"一部の宗教改革者は、主の晩餐について記念説的な見解を採用しました。","type":"noun","meaning_category":"historical context"}]}