{"word":"isocitric","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"イソクエン酸の、イソクエン酸に関する","english_definition":"Relating to or derived from isocitric acid.","examples":[{"sentence":"Isocitric acid is an isomer of citric acid.","translation":"イソクエン酸はクエン酸の異性体です。"},{"sentence":"The isocitric dehydrogenase enzyme catalyzes the conversion of isocitric acid to alpha-ketoglutarate.","translation":"イソクエン酸デヒドロゲナーゼ酵素は、イソクエン酸からα-ケトグルタル酸への変換を触媒します。"}],"collocations":["isocitric acid","isocitric dehydrogenase"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the combination of 'iso-' (meaning 'same' or 'equal') and 'citric', referring to its isomeric relationship with citric acid.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌaɪsoʊˈsɪtrɪk/","syllables":"i-so-ci-tric"},"inflection":{"notes":"This is an adjective, so it does not inflect in the same way as verbs or nouns."},"usage_notes":{"explanation":"'Isocitric' is primarily used in biochemistry and organic chemistry contexts to describe substances or processes related to isocitric acid. It is not a commonly used word outside of these specialized fields.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The isocitric is important for the Krebs cycle.","correct":"✓ Isocitric acid is important for the Krebs cycle.","note":"'Isocitric' is an adjective, so it needs to be followed by a noun (e.g., isocitric acid)."}],"priority":"★★☆"},"related_words":{"derivatives":["isocitrate (noun): The anion derived from isocitric acid.","isocitric acid (noun): An isomer of citric acid that is an intermediate in the citric acid cycle."],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'isocitric' is a technical term used in biochemistry and chemistry, specifically related to the citric acid cycle (Krebs cycle). Understanding requires familiarity with organic chemistry and metabolic pathways. It is not generally used in everyday language."},"example_sentences":[{"sentence":"The enzyme isocitric dehydrogenase plays a critical role in the regulation of the citric acid cycle.","translation":"イソクエン酸デヒドロゲナーゼ酵素は、クエン酸回路の調節において重要な役割を果たします。","type":"adjective","meaning_category":"イソクエン酸の"}]}