{"word":"fathmur","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(slang, derogatory) A person, typically male, who is perceived as being excessively devoted to or controlled by their father.","english_definition":"A person, typically male, who is perceived as being excessively devoted to or controlled by their father.","examples":[{"sentence":"Don't be such a fathmur; make your own decisions.","translation":"そんな父親に操られるような人になるな。自分で決断しなさい。"},{"sentence":"He's a total fathmur; he can't do anything without his dad's approval.","translation":"彼は完全に父親に操られている。父親の承認なしには何もできない。"}],"collocations":["total fathmur","complete fathmur","typical fathmur"],"synonyms":["daddy's boy","mama's boy (used metaphorically)","yes-man"],"antonyms":[]}],"etymology":{"value":"Likely a blend of 'father' and 'mur' (possibly from 'murmur' suggesting someone who only echoes their father's opinions), or a humorous alteration of 'father-lover'. The exact origin is unclear and likely informal.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈfæθmər/","syllables":"fath-mur"},"inflection":{"noun_plural":"fathmurs"},"usage_notes":{"explanation":"\"Fathmur\" is a slang term, often used in a derogatory or humorous way. It implies that someone lacks independence and relies too heavily on their father's guidance or approval. It is not a common word and may not be widely understood.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (slang)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Fathmur\" is a slang term with limited usage. Understanding it requires familiarity with informal and often critical language used to describe someone perceived as overly dependent on their father. Due to its slang nature, it's unlikely to be encountered in formal contexts."},"example_sentences":[{"sentence":"He's such a fathmur; he always agrees with everything his father says.","translation":"彼は本当に父親に操られている。いつも父親の言うことに同意する。","type":"noun","meaning_category":"derogatory term for someone controlled by their father"}]}