{"word":"acroamatical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"難解な、秘伝の、口頭伝授の","english_definition":"Esoteric; abstruse; communicated orally.","examples":[{"sentence":"The philosopher's acroamatical teachings were only revealed to a select few.","translation":"その哲学者の難解な教えは、選ばれた少数の者にのみ明かされた。"}],"collocations":["acroamatical doctrine","acroamatical philosophy"],"synonyms":["esoteric","abstruse","arcane","recondite","occult"],"antonyms":["exoteric","accessible","understandable","common"]},{"part_of_speech":"adjective","definition":"(古代ギリシアにおいて)一般公開されず、選ばれた生徒にのみ口頭で教えられた","english_definition":"(Of ancient Greek philosophical teachings) not publicly available; taught only to select students.","examples":[{"sentence":"Aristotle's acroamatical works were intended for internal use within the Lyceum.","translation":"アリストテレスの口頭伝授の著作は、リュケイオン内での使用を意図していた。"}],"collocations":["acroamatical lectures","acroamatical works"],"synonyms":["private","restricted","confidential"],"antonyms":["public","open","general"]}],"etymology":{"value":"Derived from the Greek word ἀκροαματικός (akroamatikos), meaning 'belonging to oral instruction,' from ἀκρόαμα (akroama), 'a thing heard,' from ἀκροᾶσθαι (akroasthai), 'to hear.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌækroʊ.əˈmætɪkəl/","syllables":"ac-ro-a-mat-i-cal"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more acroamatical' and 'most acroamatical', respectively."},"usage_notes":{"explanation":"'Acroamatical' refers to something that is difficult to understand, often because it is intended to be understood only by a select few who have been initiated into its secrets. It can also refer specifically to the teachings of ancient Greek philosophers that were not made public but were reserved for advanced students. The word emphasizes the exclusivity and difficulty of the knowledge being conveyed.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The acroamatical music was enjoyed by everyone.","correct":"✓ The esoteric music was enjoyed by a select few.","note":"'Acroamatical' implies that something is difficult to understand, so it wouldn't typically be enjoyed by 'everyone.' Use 'esoteric' instead."},{"incorrect":"✗ He gave an acroamatical speech that was very clear.","correct":"✓ He gave a clear and concise speech.","note":"'Acroamatical' implies obscurity, so it cannot be 'very clear.' Choose a different adjective if clarity is intended."}],"priority":"★★☆"},"related_words":{"derivatives":["acroamatic (adjective): Relating to or consisting of oral instruction.","acroama (noun): A thing heard; a lecture or discourse intended for hearing."],"phrases":["Acroamatical philosophy","Acroamatical teachings"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency; rare.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'acroamatical' is a rare and specialized term, primarily used in philosophical or historical contexts to describe esoteric or orally transmitted knowledge. Due to its limited usage and complex etymology, it is considered an advanced vocabulary word. Understanding its meaning requires familiarity with the history of ancient Greek philosophy and the distinction between public and private teachings. It is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The professor delved into the acroamatical aspects of Neoplatonism, leaving many students bewildered.","translation":"教授は新プラトン主義の難解な側面を掘り下げ、多くの学生を当惑させた。","type":"adjective","meaning_category":"難解な"},{"sentence":"The acroamatical tradition within the Pythagorean school emphasized secrecy and symbolic interpretation.","translation":"ピタゴラス学派内の口頭伝授の伝統は、秘密主義と象徴的な解釈を強調した。","type":"adjective","meaning_category":"口頭伝授の"}]}