{"word":"counsellorship","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"カウンセラーの職、カウンセラーの地位","english_definition":"The position or role of a counsellor.","examples":[{"sentence":"She applied for a counsellorship at the local school.","translation":"彼女は地元の学校のカウンセラーの職に応募した。"},{"sentence":"He held a counsellorship at the university for many years.","translation":"彼は長年、大学でカウンセラーの地位を務めた。"}],"collocations":["apply for a counsellorship","hold a counsellorship","offer a counsellorship","accept a counsellorship"],"synonyms":["counseling position","advisory role"],"antonyms":[]}],"etymology":{"value":"The word 'counsellorship' is formed by combining 'counsellor' (someone who gives advice or guidance) with the suffix '-ship' (denoting a position, office, or status).","priority":"★★★"},"pronunciation":{"ipa":"/ˈkaʊnsələʃɪp/","syllables":"coun-sel-lor-ship"},"inflection":{"noun_plural":"counsellorships"},"usage_notes":{"explanation":"'Counsellorship' refers specifically to the job or official role of a counsellor. It implies a formal position where one provides guidance, advice, or support to others, often in an educational, professional, or therapeutic setting.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a good counsellorship.","correct":"✓ He holds a good counsellorship. / ✓ He is a good counsellor.","note":"'Counsellorship' refers to the position itself, not the person. Use 'holds' or 'has' to indicate someone has the position, or rephrase to say they are a good counsellor."}],"priority":"★★★"},"related_words":{"derivatives":["counsellor","counsel","counseling"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'counsellorship' is a formal term referring to the position or role of a counsellor. It is typically used in professional or academic contexts when discussing employment or responsibilities related to providing guidance and support. Understanding this word requires familiarity with formal vocabulary related to job titles and organizational structures."},"example_sentences":[{"sentence":"The advertisement listed several requirements for the counsellorship.","translation":"その広告には、カウンセラーの職に関するいくつかの要件が記載されていた。","type":"general","meaning_category":"job requirements"},{"sentence":"She was delighted to be offered the counsellorship after a rigorous interview process.","translation":"彼女は厳格な面接プロセスの後、カウンセラーの地位を提供されたことを喜んだ。","type":"general","meaning_category":"job offer"},{"sentence":"The responsibilities of the counsellorship included providing support to students and staff.","translation":"カウンセラーの職務には、学生と職員へのサポートの提供が含まれていた。","type":"general","meaning_category":"job responsibilities"}]}