{"word":"reservedly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"控えめに、遠慮がちに、内気そうに、打ち解けずに","english_definition":"in a restrained or cautious manner; without openness or warmth.","examples":[{"sentence":"She spoke reservedly about her past.","translation":"彼女は過去について控えめに語った。"},{"sentence":"He greeted us reservedly, not showing much enthusiasm.","translation":"彼はあまり熱意を示さず、私たちを遠慮がちに迎えた。"},{"sentence":"The new employee acted reservedly at first, but gradually became more outgoing.","translation":"新入社員は最初は控えめに振る舞っていたが、徐々に打ち解けていった。"}],"collocations":["speak reservedly","act reservedly","behave reservedly","respond reservedly","greet reservedly"],"synonyms":["cautiously","restrainedly","guardedly","secretively","timidly","shyly","circumspectly","distantly","formally"],"antonyms":["openly","freely","unreservedly","candidly","frankly","warmly","effusively","outgoingly"]}],"etymology":{"value":"\"reserved\" + \"-ly\". \"Reserved\" は「取っておかれた」「蓄えられた」という意味から、「感情を表に出さない」「控えめな」という意味に派生。","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈzɜːrvɪdli/","syllables":"re-serv-ed-ly"},"inflection":{"notes":"Adverb, does not inflect."},"usage_notes":{"explanation":"\"Reservedly\" describes actions or behaviors characterized by a lack of openness, warmth, or enthusiasm. It suggests a degree of caution, restraint, or formality in one's interactions or expressions. It often implies a reluctance to fully disclose one's thoughts, feelings, or personality. It contrasts with behaving openly, freely, or warmly.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She reservedly told the truth.","correct":"✓ She told the truth reservedly. / ✓ She told the truth in a reserved manner.","note":"The adverb \"reservedly\" typically modifies the verb, describing *how* the action is performed, not the object of the action. It's more natural to place it after the verb or use a phrase like \"in a reserved manner.\""},{"incorrect":"✗ He is a reservedly person.","correct":"✓ He is a reserved person.","note":"\"Reservedly\" is an adverb and modifies verbs, adjectives, or other adverbs. To describe a person's character, use the adjective \"reserved.\""}],"priority":"★★☆"},"related_words":{"derivatives":["reserved (adjective: 控えめな、内気な、打ち解けない)","reserve (noun: 控え、蓄え、遠慮)","reserve (verb: 取っておく、予約する、遠慮する)"],"idioms_phrases":["without reserve (遠慮なく、率直に)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Reservedly\" means acting in a way that is not open or enthusiastic, showing caution or restraint. It describes how someone does something, suggesting they are not fully expressing themselves or are holding back their feelings. It is a more advanced word and not commonly used in everyday conversation. It implies a deliberate choice to be less forthcoming or expressive. It's often used in formal writing or when describing someone's personality or behavior in detail."},"example_sentences":[{"sentence":"The witness answered the lawyer's questions reservedly, choosing his words carefully.","translation":"証人は弁護士の質問に言葉を選びながら、控えめに答えた。","type":"adverb","meaning_category":"控えめに"},{"sentence":"The diplomat spoke reservedly about the sensitive negotiations.","translation":"外交官は、デリケートな交渉について控えめに語った。","type":"adverb","meaning_category":"遠慮がちに"},{"sentence":"He smiled reservedly, giving no hint of his true feelings.","translation":"彼は控えめに微笑み、本当の気持ちを全く表に出さなかった。","type":"adverb","meaning_category":"打ち解けずに"}]}