{"word":"phylogeny","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"系統発生、系統樹","english_definition":"The evolutionary history of a species or group of species.","examples":[{"sentence":"The phylogeny of primates is a complex and actively researched area.","translation":"霊長類の系統発生は複雑であり、活発に研究されている分野です。"},{"sentence":"Phylogenetic analysis can reveal the relationships between different organisms.","translation":"系統解析は、異なる生物間の関係を明らかにすることができます。"},{"sentence":"The phylogeny of a virus can help track its spread and evolution.","translation":"ウイルスの系統発生は、その拡散と進化を追跡するのに役立ちます。"}],"collocations":["phylogenetic tree (系統樹)","phylogenetic analysis (系統解析)","phylogenetic relationship (系統関係)","molecular phylogeny (分子系統学)"],"synonyms":["evolutionary history","cladogenesis","descent"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'phylon' (tribe, race) and 'genesis' (origin, birth).","priority":"★★★"},"pronunciation":{"ipa":"/faɪˈlɒdʒəni/","syllables":"phy-log-e-ny"},"inflection":{"noun_plural":"phylogenies"},"usage_notes":{"explanation":"Phylogeny refers to the evolutionary relationships among organisms. It is often represented as a phylogenetic tree, which shows the inferred ancestry and descent of different species or groups. Phylogenetic studies use various types of data, including morphological, molecular, and behavioral data, to reconstruct evolutionary history.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The ontogeny describes the phylogeny.","correct":"Phylogeny describes the evolutionary history, while ontogeny describes the development of an individual organism.","note":"Phylogeny (evolutionary history) is different from ontogeny (development of an individual)."},{"incorrect":"Phylogeny is only based on physical characteristics.","correct":"Phylogeny is based on various data, including physical characteristics, genetic information, and behavioral traits.","note":"Phylogenetic analysis uses a variety of data types, not just physical characteristics."}],"priority":"★★☆"},"related_words":{"derivatives":["phylogenetic (adjective: 系統発生の)","phylogenetically (adverb: 系統発生的に)","phylogenomics (noun: 系統ゲノミクス)"],"phrases":["phylogenetic tree","phylogenetic analysis","molecular phylogeny"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Phylogeny' is a specialized term used in biology to describe the evolutionary history and relationships of organisms. Understanding this term requires a background in evolutionary biology and genetics. It is commonly encountered in scientific literature and academic discussions related to the classification and evolution of species.","priority":"★★☆"},"example_sentences":[{"sentence":"The study reconstructed the phylogeny of flowering plants using DNA sequence data.","translation":"その研究は、DNA配列データを用いて顕花植物の系統発生を再構築した。","type":"general","meaning_category":"Evolutionary history"},{"sentence":"Understanding the phylogeny of viruses is crucial for developing effective antiviral therapies.","translation":"ウイルスの系統発生を理解することは、効果的な抗ウイルス療法を開発するために不可欠である。","type":"medical","meaning_category":"Evolutionary relationships"},{"sentence":"Phylogenetic trees are used to visualize the evolutionary relationships among species.","translation":"系統樹は、種間の進化的関係を視覚化するために使用される。","type":"general","meaning_category":"Visual representation"}]}