{"word":"inveiglement","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"甘言、誘惑、丸め込み、欺瞞的な説得","english_definition":"the act of persuading someone to do something by means of deception or flattery.","examples":[{"sentence":"The con artist's inveiglement led the victim to hand over their life savings.","translation":"詐欺師の甘言により、被害者は生涯の貯蓄を手渡してしまった。"},{"sentence":"She resisted his inveiglement, knowing his promises were empty.","translation":"彼女は彼の誘惑に抵抗し、彼の約束が空虚であることを知っていた。"},{"sentence":"The company's inveiglement of new customers involved misleading advertising.","translation":"その会社の新規顧客の丸め込みには、誤解を招く広告が含まれていた。"}],"collocations":["inveiglement tactics (誘惑戦術)","inveiglement scheme (誘惑計画)","resist inveiglement (誘惑に抵抗する)","fall prey to inveiglement (誘惑の餌食になる)"],"synonyms":["persuasion","enticement","allurement","seduction","deception","coaxing","wheedling","flattery"],"antonyms":["repulsion","deterrence","dissuasion","warning"]},{"part_of_speech":"noun","definition":"（法律）誘拐、誘い出し (特に未成年者に対する不当な影響力の行使)","english_definition":"(law) the act of enticing or influencing someone, especially a minor, through undue influence.","examples":[{"sentence":"The inveiglement of a minor is a serious crime.","translation":"未成年者の誘拐は重大な犯罪である。"},{"sentence":"The court heard evidence of the defendant's inveiglement of the young witness.","translation":"裁判所は、被告が若い証人を誘い出した証拠を聞いた。"}],"collocations":["inveiglement of a minor (未成年者の誘拐)","evidence of inveiglement (誘拐の証拠)","charge of inveiglement (誘拐の罪)"],"synonyms":["abduction","enticement","persuasion","influence"],"antonyms":["protection","safeguarding"]}],"etymology":{"value":"Derived from the verb 'inveigle,' which comes from the Middle French 'aveugler' meaning 'to blind, deceive,' ultimately from Latin 'ab oculis,' meaning 'away from the eyes.' The addition of 'in-' intensifies the sense of deception.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈveɪɡəlmənt/","syllables":"in-vei-gle-ment"},"inflection":{"noun_plural":"inveiglements"},"usage_notes":{"explanation":"'Inveiglement' refers to the act of persuading someone to do something, often something unwise or against their best interests, through the use of deception, flattery, or other manipulative tactics. It implies a deliberate attempt to mislead or entice the target. In a legal context, it can specifically refer to the act of enticing or influencing a minor, which is a serious offense. The word carries a negative connotation, suggesting unethical or illegal behavior.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The inveiglement of the gift made her happy.","correct":"✓ The allure of the gift made her happy.","note":"'Inveiglement' implies deception or manipulation, so it's not appropriate when simply describing something that makes someone happy. Use 'allure' or 'attraction' instead."},{"incorrect":"✗ He used inveiglement to convince his friend to study.","correct":"✓ He used persuasion to convince his friend to study.","note":"If the persuasion is not deceptive or manipulative, 'persuasion' is a more appropriate word than 'inveiglement'."}],"priority":"★★☆"},"related_words":{"derivatives":["inveigle (verb: to persuade someone to do something by means of deception or flattery)"],"phrasal_verbs":[],"related_concepts":["fraud","manipulation","coercion","brainwashing","grooming (in the context of child abuse)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Inveiglement' is a sophisticated word denoting the act of persuading someone through cunning, deception, or flattery, often leading them to do something against their best judgment. It carries a strong negative connotation, implying unethical or manipulative behavior. In legal contexts, it can refer specifically to the enticement or influencing of a minor, which is a serious offense. Understanding this word requires a grasp of subtle nuances and a familiarity with formal or legal language."},"example_sentences":[{"sentence":"The cult leader used **inveiglement** to recruit vulnerable individuals.","translation":"カルトの指導者は、甘言を使って脆弱な個人を勧誘した。","type":"noun","meaning_category":"甘言、誘惑"},{"sentence":"The prosecutor presented evidence of the defendant's **inveiglement** of the witness.","translation":"検察官は、被告が証人を誘い出した証拠を提示した。","type":"noun","meaning_category":"（法律）誘拐、誘い出し"},{"sentence":"She was skilled in the art of **inveiglement**, able to get people to do almost anything.","translation":"彼女は甘言の技術に長けており、ほとんど何でも人にやらせることができた。","type":"noun","meaning_category":"甘言、誘惑"},{"sentence":"The company's **inveiglement** of investors led to significant financial losses.","translation":"その会社による投資家の丸め込みは、重大な経済的損失につながった。","type":"noun","meaning_category":"甘言、誘惑"}]}