{"word":"overtreating","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(患者を)過剰に治療する、必要以上に治療する","english_definition":"To treat (a patient or condition) excessively or unnecessarily.","examples":[{"sentence":"Some doctors are accused of overtreating patients to increase their profits.","translation":"一部の医師は、利益を増やすために患者を過剰に治療していると非難されています。"},{"sentence":"The study found that many elderly patients were being overtreated with medications they didn't need.","translation":"その研究では、多くの高齢患者が必要のない薬で過剰に治療されていることが判明しました。"}],"collocations":["overtreating patients (患者を過剰に治療する)","overtreating a condition (症状を過剰に治療する)"],"synonyms":["overmedicating","overprescribing","unnecessary treatment"],"antonyms":["undertreating","appropriate treatment"]},{"part_of_speech":"noun","definition":"過剰治療、必要以上の治療","english_definition":"The act of providing excessive or unnecessary treatment.","examples":[{"sentence":"Overtreating can lead to negative side effects and increased healthcare costs.","translation":"過剰治療は、負の副作用や医療費の増加につながる可能性があります。"},{"sentence":"The hospital is trying to reduce overtreating by implementing new guidelines.","translation":"その病院は、新しいガイドラインを実施することで過剰治療を減らそうとしています。"}],"collocations":["avoid overtreating (過剰治療を避ける)","reduce overtreating (過剰治療を減らす)","risks of overtreating (過剰治療のリスク)"],"synonyms":["overmedication","unnecessary treatment"],"antonyms":["undertreatment","appropriate treatment"]}],"etymology":{"value":"\"Over-\" (過剰に) + \"treating\" (治療すること)","priority":"★★★"},"pronunciation":{"ipa":"/ˌoʊvərˈtriːtɪŋ/","syllables":"o-ver-treat-ing"},"inflection":{"verb_forms":{"present_simple":["overtreat","overtreats"],"past_simple":"overtreated","past_participle":"overtreated","present_participle":"overtreating"},"noun_plural":"overtreatings"},"usage_notes":{"explanation":"\"Overtreating\" refers to providing medical treatment that is more intensive or extensive than necessary, or providing treatment when it is not needed at all. This can include prescribing unnecessary medications, performing unnecessary procedures, or providing care that is not beneficial to the patient. Overtreatment can have negative consequences, such as side effects from medications, complications from procedures, and increased healthcare costs.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor is overtreating for the patient.","correct":"✓ The doctor is overtreating the patient.","note":"\"Overtreat\" is a transitive verb, so it takes a direct object (the patient). The preposition \"for\" is not needed."},{"incorrect":"✗ Overtreating can cause harm to patients, so we should avoid to do it.","correct":"✓ Overtreating can cause harm to patients, so we should avoid doing it.","note":"After the verb \"avoid\", we use the gerund form of the verb (doing) instead of the infinitive form (to do)."}],"priority":"★★☆"},"related_words":{"derivatives":["overtreatment (名詞: 過剰治療)"],"antonyms":["undertreating (過少治療)","undertreatment (過少治療)"],"related_terms":["medicalization (医療化)","iatrogenesis (医原病)"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"overtreating\" refers to the act of providing medical treatment that is excessive or unnecessary. This term is often used in discussions about healthcare costs, patient safety, and the ethical responsibilities of medical professionals. It's important to understand that overtreatment can have negative consequences for patients, such as side effects from medications and complications from procedures. It's also important to note that overtreatment is not always intentional; it can sometimes occur due to a lack of evidence-based guidelines or a fear of missing a diagnosis."},"example_sentences":[{"sentence":"The overuse of antibiotics is a form of **overtreating** that contributes to antibiotic resistance.","translation":"抗生物質の過剰使用は、抗生物質耐性の一因となる過剰治療の一形態です。","type":"verb","meaning_category":"過剰に治療する"},{"sentence":"There is growing concern about **overtreating** children with behavioral problems.","translation":"行動上の問題を抱える子供たちを過剰に治療することへの懸念が高まっています。","type":"verb","meaning_category":"過剰に治療する"},{"sentence":"The study aimed to identify factors that contribute to **overtreating** in primary care.","translation":"その研究は、プライマリケアにおける過剰治療の一因となる要因を特定することを目的としていました。","type":"noun","meaning_category":"過剰治療"},{"sentence":"The hospital implemented new protocols to minimize **overtreating** of common conditions.","translation":"その病院は、一般的な症状の過剰治療を最小限に抑えるための新しいプロトコルを実施しました。","type":"noun","meaning_category":"過剰治療"}]}