{"word":"Skeech","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(slang) A person who is considered to be of low moral character, especially a woman; a promiscuous person.","english_definition":"(slang) A derogatory term for a person, typically a woman, considered to be of low moral character or promiscuous.","examples":[{"sentence":"She was labeled a skeech by some of the other girls.","translation":"彼女は他の女の子たちからスケッチだとレッテルを貼られた。"},{"sentence":"Don't be such a skeech; have some self-respect.","translation":"そんなスケッチみたいなことしないで、自尊心を持ちなさい。"}],"collocations":[],"synonyms":["slut","whore","tramp","floozy"],"antonyms":["saint","prude"]},{"part_of_speech":"noun","definition":"(slang) A contemptible or unpleasant person.","english_definition":"(slang) A general term of contempt for a person considered unpleasant or worthless.","examples":[{"sentence":"He's nothing but a skeech, always trying to cheat people.","translation":"彼はただのスケッチだ、いつも人を騙そうとしている。"},{"sentence":"Get out of here, you skeech!","translation":"出て行け、このスケッチ野郎！"}],"collocations":[],"synonyms":["jerk","creep","scumbag","loser"],"antonyms":["hero","benefactor"]}],"etymology":{"value":"Origin uncertain. Possibly a variant of 'sketchy,' implying something or someone unreliable or of questionable character. The term gained popularity in the late 20th and early 21st centuries, particularly in urban slang.","priority":"★★☆"},"pronunciation":{"ipa":"/skiːtʃ/","syllables":"skeech"},"inflection":{"noun_plural":"skeeches"},"usage_notes":{"explanation":"'Skeech' is a highly derogatory slang term. Its use is generally considered offensive. It is most often applied to women, implying promiscuity or low moral standards, but can also be used more generally to describe someone considered contemptible or unpleasant. Due to its offensive nature, it should be used with extreme caution or avoided altogether.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He's a nice skeech.","correct":"✗ This term is almost always used negatively.","note":"The term 'skeech' is almost exclusively used in a negative and derogatory context."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Slang, low frequency)","frequency_google_ngram":"Low frequency. Primarily used in slang and informal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Skeech' is a highly offensive slang term with strong negative connotations. It is primarily used to denigrate individuals, especially women, by implying promiscuity or low moral character. The word should be avoided in formal settings and used with extreme caution due to its potential to cause offense. Understanding the term is important for recognizing and avoiding its use, rather than incorporating it into one's vocabulary."},"example_sentences":[{"sentence":"(offensive) She was called a skeech for her behavior.","translation":"（攻撃的）彼女は、その行動のせいでスケッチと呼ばれた。","type":"noun","meaning_category":"derogatory term"},{"sentence":"(offensive) He acted like a total skeech at the party.","translation":"（攻撃的）彼はパーティーで完全にスケッチのように振る舞った。","type":"noun","meaning_category":"contemptible person"}]}