{"word":"MOIG","priority":"☆☆☆","meanings":[{"part_of_speech":"acronym","definition":"Ministry of Oil and Gas (政府機関などの略称)","english_definition":"An abbreviation for Ministry of Oil and Gas, typically referring to a governmental department responsible for overseeing the oil and gas industry in a particular country.","examples":[{"sentence":"The MOIG announced new regulations for offshore drilling.","translation":"石油ガス省は、沖合掘削に関する新たな規制を発表した。"},{"sentence":"The minister from MOIG attended the international energy conference.","translation":"石油ガス省の大臣が国際エネルギー会議に出席した。"}],"collocations":["MOIG regulations","MOIG minister","MOIG announcement","MOIG policy"],"synonyms":["Ministry of Petroleum","Department of Energy"],"antonyms":[]}],"etymology":{"value":"Acronym derived from the initial letters of Ministry of Oil and Gas.","priority":"★★★"},"pronunciation":{"ipa":"/ˈmɔɪɡ/","syllables":"moig"},"inflection":{},"usage_notes":{"explanation":"MOIG is used as a specific reference to a government ministry. The particular country or region to which the ministry belongs would usually be clear from the context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The MOIG are responsible for the oil fields.","correct":"✓ The MOIG is responsible for the oil fields.","note":"MOIG is treated as a singular entity, so it takes a singular verb."}],"priority":"★★☆"},"related_words":{"derivatives":["oil","gas","ministry","petroleum","energy"],"acronyms":["OPEC","IEA"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency, specific to contexts involving oil and gas industries and governmental affairs.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'MOIG' is a technical acronym used primarily in contexts related to the oil and gas industry and governmental regulation. It is not commonly used in general conversation and is more likely to appear in specialized publications or reports. Understanding requires familiarity with governmental structures and the energy sector."},"example_sentences":[{"sentence":"The MOIG released its annual report on oil production.","translation":"石油ガス省は、石油生産に関する年次報告書を発表した。","type":"acronym","meaning_category":"Governmental Ministry"},{"sentence":"The new MOIG policy aims to increase energy efficiency.","translation":"新しい石油ガス省の政策は、エネルギー効率の向上を目的としている。","type":"acronym","meaning_category":"Governmental Policy"}]}