{"word":"mutterer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"つぶやく人、ぶつぶつ言う人","english_definition":"a person who mutters; someone who speaks in a low, indistinct tone, often to themselves.","examples":[{"sentence":"He was a constant mutterer, always complaining under his breath.","translation":"彼はいつもぶつぶつ言っていて、絶えず小声で不満を言っていた。"},{"sentence":"The old man was a mutterer, and no one could understand what he was saying.","translation":"その老人はぶつぶつ言う人で、誰も彼が何を言っているのか理解できなかった。"},{"sentence":"She dismissed him as a harmless mutterer.","translation":"彼女は彼を無害なつぶやき屋だと片付けた。"}],"collocations":["a constant mutterer (いつもぶつぶつ言う人)","a habitual mutterer (常習的につぶやく人)","an angry mutterer (怒ってぶつぶつ言う人)"],"synonyms":["grumbler","complainer","murmurer","whisperer"],"antonyms":["speaker","orator","communicator"]}],"etymology":{"value":"The word \"mutterer\" is derived from the verb \"mutter,\" which comes from Middle English *muteren*, related to Old English *motian* meaning 'to murmur, mutter, speak indistinctly.' The suffix '-er' is added to form a noun denoting a person who performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmʌtərə(r)/","syllables":"mut-ter-er"},"inflection":{"noun_plural":"mutterers"},"usage_notes":{"explanation":"The term \"mutterer\" typically describes someone who habitually speaks in a low, unclear voice, often expressing complaints or dissatisfaction. The act of muttering is usually done quietly and may not be intended for others to hear, although it can be audible. The word often carries a negative connotation, suggesting discontent or secrecy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a mutterer about the weather.","correct":"✓ He is a mutterer who complains about the weather.","note":"When specifying what the mutterer is complaining about, use a relative clause or a prepositional phrase with 'about' followed by a gerund (e.g., 'He is a mutterer about complaining')."},{"incorrect":"✗ She mutters as a mutterer.","correct":"✓ She mutters like a mutterer.","note":"To describe how someone mutters, use 'like a mutterer' rather than 'as a mutterer.'"},{"incorrect":"✗ The mutterer said loudly.","correct":"✓ The mutterer muttered loudly.","note":"Muttering is inherently quiet, so saying someone 'muttered loudly' is contradictory. Instead, describe the content or emotion behind the muttering."}],"priority":"★★☆"},"related_words":{"derivatives":["mutter (verb, noun)","muttering (noun, adjective)"],"phrasal_verbs":[],"related_nouns":["grumbler","complainer","whisperer"],"related_adjectives":["muttering","grumbling","complaining"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Mutterer\" is a noun that describes a person who habitually speaks in a low, indistinct tone, often to themselves or expressing complaints quietly. It implies a tendency to murmur or grumble under one's breath. The word is not commonly used in everyday conversation and is more often found in literature or descriptive writing to characterize someone's behavior or personality. Understanding the word requires a grasp of the verb \"mutter\" and the suffix \"-er,\" which denotes a person who performs the action.","priority":"★☆☆"},"example_sentences":[{"sentence":"The disgruntled employee was known as a constant **mutterer**, always voicing his complaints in hushed tones.","translation":"不満を抱いた従業員は、常に小声で不満を漏らす、いつもぶつぶつ言う人として知られていた。","type":"noun","meaning_category":"つぶやく人"},{"sentence":"The old woman, a lonely **mutterer**, shuffled down the street, seemingly talking to herself.","translation":"その老婆は、孤独なつぶやき屋で、まるで自分に話しかけているかのように、通りをよろよろと歩いていた。","type":"noun","meaning_category":"つぶやく人"},{"sentence":"He dismissed his neighbor as a harmless **mutterer**, unaware of the man's growing resentment.","translation":"彼は隣人を無害なつぶやき屋だと片付けたが、その男の募る恨みに気づいていなかった。","type":"noun","meaning_category":"つぶやく人"}]}