{"word":"Kalki","priority":"★★★","meanings":[{"part_of_speech":"proper noun","definition":"カルキ（ヒンドゥー教におけるヴィシュヌ神の第10で最後のアヴァターラ（化身）)","english_definition":"The tenth and final avatar of the Hindu god Vishnu in some traditions, prophesied to appear at the end of the Kali Yuga (current age of darkness).","examples":[{"sentence":"Many Hindus believe Kalki will restore righteousness in the world.","translation":"多くのヒンドゥー教徒は、カルキが世界に正義を回復すると信じている。"},{"sentence":"The Puranas describe Kalki riding a white horse with a flaming sword.","translation":"プラーナ文献では、炎の剣を持ち白馬に乗るカルキが描写されている。"}],"cultural_context":{"origin":"Hindu eschatology (mainly in Vishnu Purana, Bhagavata Purana)","appearance":"Described as a warrior figure on a white horse","role":"To end the current corrupt age (Kali Yuga) and restart the cycle of time","symbolism":"Represents destruction of evil and rebirth of dharma"},"synonyms":["Kalkin","The Destroyer of Filth"],"related_concepts":["Avatar","Maitreya (Buddhist counterpart)","Messiah"]}],"etymology":{"value":"サンスクリット語の「कल्कि (kalki)」に由来し、「白い馬」または「永遠の時間」を意味する。語源は「kalka」（汚れ、不純物）と関連し、「汚れを洗い流す者」という意味合いを持つ。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkʌlki/","syllables":"Kal-ki"},"usage_notes":{"explanation":"「Kalki」はヒンドゥー教の終末論における中心的な存在で、ヴィシュヌ神の最後の化身として描かれます。現代のヒンドゥー文化では、終末の救世主的な存在として解釈されることが多く、しばしば白馬に乗った戦士として描画されます。この概念はゾロアスター教のサオシュヤントやキリスト教の再臨のキリストとの類似性が指摘されることもあります。固有名詞として扱われるため、文頭では常に大文字で表記されます。","priority":"★★★"},"related_words":{"hindu_trinity":["Brahma","Vishnu","Shiva"],"other_avatars":["Rama","Krishna","Buddha (in some traditions)"],"cosmic_cycles":["Satya Yuga","Treta Yuga","Dvapara Yuga","Kali Yuga"],"priority":"★★★"},"cultural_significance":{"in_literature":"Featured in Puranic texts and modern Hindu literature","in_art":"Commonly depicted as a sword-wielding horseman","in_pop_culture":"Appears in some Indian comics, films and video games","modern_interpretations":"Sometimes associated with contemporary spiritual figures","priority":"★★☆"},"example_sentences":[{"sentence":"The prophecy states that Kalki will appear when virtue has disappeared from the world.","translation":"予言によれば、カルキは美徳が世界から消え去った時に現れるとされている。","type":"religious context"},{"sentence":"Some believe the Kalki avatar has already been born in secret.","translation":"カルキの化身はすでに密かに生まれていると信じる人々もいる。","type":"modern interpretation"},{"sentence":"The temple walls were adorned with carvings of Vishnu's avatars, including Kalki.","translation":"寺院の壁には、カルキを含むヴィシュヌの化身の彫刻が飾られていた。","type":"artistic representation"}]}