{"word":"shirtiest","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(informal, humorous) Most resembling a shirt; most excessively or conspicuously wearing a shirt, or having qualities associated with shirts.","english_definition":"(informal, humorous) superlative form of 'shirty'; most resembling a shirt; most excessively or conspicuously wearing a shirt, or having qualities associated with shirts.","examples":[{"sentence":"He was the shirtiest guy at the beach, wearing a button-down even in the water.","translation":"彼はビーチで一番シャツを着ている人で、水の中でもボタンダウンを着ていた。"},{"sentence":"Of all the outfits, that one is definitely the shirtiest.","translation":"すべての服装の中で、あれが間違いなく一番シャツっぽい。"}],"collocations":["the shirtiest outfit","the shirtiest person"],"synonyms":["most shirty","most shirt-like"],"antonyms":["least shirty","least shirt-like"]}],"etymology":{"value":"Derived from 'shirty' (resembling a shirt; bad-tempered) + '-iest' (superlative suffix).","priority":"N/A"},"pronunciation":{"ipa":"/ˈʃɜːrtiəst/","syllables":"shir-ti-est"},"inflection":{"adjective_forms":{"comparative":"shirttier","superlative":"shirtiest"}},"usage_notes":{"explanation":"'Shirtiest' is a humorous and informal superlative adjective. It is used to describe something or someone that most resembles a shirt or exhibits qualities associated with shirts to an extreme degree. It can also be used playfully to describe someone who is bad-tempered or irritable, though this usage is less common.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ This is the shirtiest.","correct":"✓ This is the shirtiest outfit.","note":"'Shirtiest' is an adjective and needs to modify a noun."}],"priority":"N/A"},"related_words":{"derivatives":["shirty","shirt","shirtless"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - likely a neologism or rare usage.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Shirtiest' is a humorous and uncommon superlative adjective, derived from 'shirty'. It implies the highest degree of resemblance to a shirt or the most extreme expression of qualities associated with shirts, often in an exaggerated or comical way. Its usage is typically informal and playful."},"example_sentences":[{"sentence":"That's the shirtiest costume I've ever seen!","translation":"あれは今まで見た中で一番シャツっぽい衣装だ！","type":"adjective","meaning_category":"resembling a shirt"},{"sentence":"Among all the grumpy people, he was definitely the shirtiest this morning.","translation":"不機嫌な人たちの中で、彼は今朝間違いなく一番不機嫌だった。","type":"adjective","meaning_category":"bad-tempered (humorous)"}]}