{"word":"incommensurately","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"不均衡に、不釣り合いに、比較にならないほど","english_definition":"in a way that is disproportionate or not comparable; to an extent that is out of proportion.","examples":[{"sentence":"The benefits were incommensurately small compared to the risks.","translation":"利益はリスクと比較して不均衡に小さかった。"},{"sentence":"The punishment was incommensurately severe for such a minor offense.","translation":"その処罰は、そのような軽微な違反に対して不釣り合いに厳しかった。"},{"sentence":"The effort required was incommensurately large for the result achieved.","translation":"必要とされた努力は、達成された結果に対して比較にならないほど大きかった。"}],"collocations":["incommensurately small","incommensurately large","incommensurately severe","incommensurately greater","incommensurately less"],"synonyms":["disproportionately","unequally","imbalance","asymmetrically","excessively","inordinately"],"antonyms":["commensurately","proportionately","equally","symmetrically"]},{"part_of_speech":"adverb","definition":"共通の基準や尺度がないほど、比較できないほど","english_definition":"in a way that lacks a common standard of measurement; in a manner that is not comparable due to a lack of shared qualities or units.","examples":[{"sentence":"Their values are incommensurately different, making agreement impossible.","translation":"彼らの価値観は共通の基準がないほど異なっており、合意は不可能である。"},{"sentence":"The two theories operate on incommensurately different levels of analysis.","translation":"その2つの理論は、比較できないほど異なる分析レベルで機能している。"},{"sentence":"These artistic styles are incommensurately unique, each possessing its own distinct principles.","translation":"これらの芸術様式は、それぞれ独自の原則を持っており、比較できないほど独特である。"}],"collocations":["incommensurately different","incommensurately unique","incommensurately distinct"],"synonyms":["uncomparably","disparately","distinctly","unrelatedly","irreconcilably"],"antonyms":["comparably","relatedly","reconcilably"]}],"etymology":{"value":"Formed from \"in-\" (not) + \"commensurate\" (proportionate, having a common measure) + \"-ly\" (adverb suffix). Thus, literally meaning 'not in a proportionate or comparable way.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪnkəˈmɛnʃərətli/","syllables":"in-com-men-su-rate-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"\"Incommensurately\" is used to describe a situation where there is a significant lack of proportion or comparability between two things. It can refer to a difference in size, degree, or value that is so great that it seems unfair or unreasonable. It can also refer to a lack of a common standard of measurement or comparison, making it difficult or impossible to compare two things directly. The word often carries a sense of imbalance or inappropriateness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The two ideas are incommensurate.","correct":"✓ The two ideas are incommensurately different.","note":"\"Incommensurate\" as an adjective means \"out of proportion\" or \"lacking a common standard.\" To use it correctly, you'd need to say something like \"The two values are incommensurate with each other.\" Using the adverb form, \"incommensurately,\" often requires adding an adjective to clarify the specific way in which they are not comparable."},{"incorrect":"✗ He was incommensurately happy.","correct":"✓ He was disproportionately happy.","note":"While one could argue that someone's happiness might be \"incommensurately\" large for a given situation, \"disproportionately\" is a more common and natural way to express that the happiness is too great for the situation."}],"priority":"★☆☆"},"related_words":{"derivatives":["incommensurable (adjective)","commensurate (adjective)","commensurately (adverb)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"incommensurately\" is a formal and relatively rare adverb. It is used to describe something that is disproportionate or not comparable to something else. Understanding the root word \"commensurate\" (meaning proportionate or corresponding in size or degree) is helpful in grasping the meaning of \"incommensurately.\" It is often used in academic or technical contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The resources allocated to the project were incommensurately small given its importance.","translation":"プロジェクトの重要性を考えると、割り当てられたリソースは不均衡に少なかった。","type":"adverb","meaning_category":"Disproportionate"},{"sentence":"The risks involved were incommensurately high compared to the potential rewards.","translation":"潜在的な報酬と比較して、伴うリスクは不均衡に高かった。","type":"adverb","meaning_category":"Disproportionate"},{"sentence":"The two theories operate on incommensurately different assumptions.","translation":"2つの理論は、比較できないほど異なる前提で機能する。","type":"adverb","meaning_category":"Incomparable"}]}