{"word":"extractability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"抽出可能性、抽出性","english_definition":"The quality of being able to be extracted; the degree to which something can be extracted.","examples":[{"sentence":"The extractability of the ore is a key factor in determining the economic viability of the mining operation.","translation":"鉱石の抽出可能性は、採掘事業の経済的実現可能性を決定する重要な要素です。"},{"sentence":"The extractability of DNA from the sample was low due to degradation.","translation":"サンプルのDNAの抽出性は、分解のために低かった。"}],"collocations":["high extractability","low extractability","measure extractability","improve extractability","assess extractability"],"synonyms":["removability","separability","recoverability","accessibility"],"antonyms":["inaccessibility","irretrievability"],"related_terms":["extraction","extractable","extract"],"notes":"Often used in scientific or technical contexts, such as mining, chemistry, or biology."}],"etymology":{"value":"Derived from 'extractable' (capable of being extracted) + '-ity' (a suffix denoting a state or quality).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ɪkˌstræktəˈbɪləti/","syllables":"ex-tract-a-bil-i-ty"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Extractability' refers to the ease or possibility with which a substance can be removed from a mixture, compound, or location. It's a key consideration in various fields where separation processes are important.","priority":"☆☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in technical or scientific writing.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word 'extractability' is a technical term used to describe how easily something can be extracted or removed from something else. It's often used in science and engineering contexts. Understanding the word requires familiarity with the concept of extraction and the suffix '-ability', which indicates a capability or quality."},"example_sentences":[{"sentence":"The high extractability of the target compound made the purification process relatively simple.","translation":"標的化合物の高い抽出性により、精製プロセスは比較的簡単になりました。","type":"general","meaning_category":"general"},{"sentence":"Scientists are working to improve the extractability of rare earth elements from electronic waste.","translation":"科学者たちは、電子廃棄物からの希土類元素の抽出性を向上させるために取り組んでいます。","type":"technical","meaning_category":"technical"}]}