{"word":"polypeptide","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ポリペプチド","english_definition":"A chain of amino acids linked together by peptide bonds.","examples":[{"sentence":"A polypeptide must fold correctly to function.","translation":"ポリペプチドは機能するために正しく折りたたまれなければならない。"},{"sentence":"Proteins are made up of one or more polypeptide chains.","translation":"タンパク質は一つ以上のポリペプチド鎖から構成されている。"}],"collocations":["polypeptide chain","polypeptide synthesis","polypeptide folding"],"synonyms":["peptide","oligopeptide","protein precursor"],"antonyms":["amino acid"],"related_terms":["protein","amino acid","peptide bond","translation","ribosome"]}],"etymology":{"value":"From 'poly-' (meaning 'many') + 'peptide' (from Greek 'peptos' meaning 'digested').","priority":"★★☆"},"pronunciation":{"ipa":"ˌpɒliˈpɛptaɪd/","syllables":"pol-y-pep-tide"},"inflection":{"noun_plural":"polypeptides"},"usage_notes":{"explanation":"A polypeptide is a chain of amino acids linked by peptide bonds. It is an intermediate stage in protein synthesis. A protein is made of one or more polypeptide chains that have folded into a specific three-dimensional structure. The distinction between a polypeptide and a protein is not always clear-cut, but generally, a polypeptide refers to the linear chain of amino acids before it has folded into its functional form.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Polypeptides are made of nucleic acids.","correct":"✓ Polypeptides are made of amino acids.","note":"Polypeptides are chains of amino acids, not nucleic acids."},{"incorrect":"✗ Polypeptide is the same as protein.","correct":"✓ A polypeptide is a chain of amino acids that can fold to become a protein, or part of a protein.","note":"A polypeptide is a precursor to a protein, or a subunit of a protein. A protein is the functional, folded form."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'polypeptide' is a technical term used in biochemistry and molecular biology. It refers to a chain of amino acids linked together by peptide bonds. Understanding this term requires a basic knowledge of protein structure and synthesis. It's commonly encountered in scientific literature and advanced biology courses."},"example_sentences":[{"sentence":"The nascent polypeptide is synthesized on the ribosome.","translation":"生まれたばかりのポリペプチドはリボソーム上で合成される。","type":"scientific","meaning_category":"general"},{"sentence":"The sequence of amino acids in a polypeptide determines its structure and function.","translation":"ポリペプチド中のアミノ酸の配列が、その構造と機能を決定する。","type":"scientific","meaning_category":"structure"},{"sentence":"Chaperone proteins assist in the proper folding of polypeptides.","translation":"シャペロンタンパク質は、ポリペプチドの適切な折り畳みを助ける。","type":"scientific","meaning_category":"function"}]}