{"word":"fallibility","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"誤りやすさ、間違いを犯しやすい性質、不確実性","english_definition":"the tendency to make mistakes or be wrong; the state of being fallible.","examples":[{"sentence":"Humans are characterized by their fallibility.","translation":"人間は誤りやすいという特徴がある。"},{"sentence":"The fallibility of eyewitness testimony is well-documented.","translation":"目撃証言の誤りやすさは十分に文書化されている。"},{"sentence":"We must acknowledge our own fallibility and be open to correction.","translation":"私たちは自身の誤りやすさを認め、修正を受け入れる姿勢を持つべきだ。"},{"sentence":"The system is designed to account for human fallibility.","translation":"そのシステムは、人間の誤りやすさを考慮して設計されている。"}],"collocations":["human fallibility (人間の誤りやすさ)","inherent fallibility (内在的な誤りやすさ)","demonstrate fallibility (誤りやすさを示す)","acknowledge fallibility (誤りやすさを認める)","recognize fallibility (誤りやすさを認識する)"],"synonyms":["imperfection","liability to error","defectiveness","flaw","weakness","frailty","unreliability","uncertainty"],"antonyms":["infallibility","perfection","certainty","reliability","accuracy"]}],"etymology":{"value":"Late Middle English: from Old French faillibilite, from late Latin fallibilitas, from fallibilis ‘liable to err’, from fallere ‘deceive’.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfælɪˈbɪləti/","syllables":"fal-li-bil-i-ty (5 syllables)"},"inflection":{"notes":"This is a noun and does not have different inflections."},"usage_notes":{"explanation":"\"**Fallibility**\" refers to the inherent capacity of humans or systems to make mistakes. It's often used in contexts where acknowledging the potential for error is crucial, such as in discussions of eyewitness testimony, software design, or philosophical arguments about the limits of human knowledge. It's a more formal and abstract term than \"mistake\" or \"error.\" It emphasizes the general tendency or possibility of making mistakes, rather than a specific instance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed his fallibility by winning the game.","correct":"✓ He showed his fallibility by making several errors during the game.","note":"Fallibility refers to the capacity to make errors, not to success. The sentence should describe instances where mistakes were made."},{"incorrect":"✗ The fallibility of the machine made it work better.","correct":"✓ The fallibility of the machine made it unreliable.","note":"Fallibility implies unreliability, not improved performance."}],"priority":"★★☆"},"related_words":{"derivatives":["fallible (adjective: capable of making mistakes or being wrong)","infallibility (noun: the quality of being incapable of making mistakes or being wrong)","infallible (adjective: incapable of making mistakes or being wrong)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1-C2","frequency_google_ngram":"Relatively low frequency, but used in academic and formal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"**Fallibility**\" is a relatively advanced word that describes the quality of being likely to make mistakes or be wrong. It is often used in formal writing or academic discussions when talking about the limitations of humans or systems. It's important to understand that it refers to the *potential* for error, not necessarily a specific error that has been made. It's the opposite of \"infallibility,\" which means being incapable of making mistakes.","priority":"★★☆"},"example_sentences":[{"sentence":"The legal system must account for the **fallibility** of human memory.","translation":"法制度は、人間の記憶の誤りやすさを考慮しなければならない。","type":"noun","meaning_category":"誤りやすさ"},{"sentence":"Acknowledging the **fallibility** of our models is crucial for scientific progress.","translation":"私たちのモデルの誤りやすさを認めることは、科学の進歩にとって非常に重要だ。","type":"noun","meaning_category":"誤りやすさ"},{"sentence":"The design incorporates safeguards to minimize the impact of human **fallibility**.","translation":"その設計には、人間の誤りやすさの影響を最小限に抑えるための安全対策が組み込まれている。","type":"noun","meaning_category":"誤りやすさ"},{"sentence":"Despite his expertise, he never forgot his own **fallibility**.","translation":"彼の専門知識にもかかわらず、彼は決して自身の誤りやすさを忘れることはなかった。","type":"noun","meaning_category":"誤りやすさ"}]}