{"word":"alco-ometer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アルコール濃度計、酒精計","english_definition":"An instrument for determining the percentage of alcohol in a liquid.","examples":[{"sentence":"The alco-ometer reading indicated a high alcohol content.","translation":"アルコール濃度計の読みは高いアルコール含有量を示した。"}],"collocations":["alco-ometer reading","digital alco-ometer"],"synonyms":["alcoholmeter","proof hydrometer"],"antonyms":[]}],"etymology":{"value":"'alco-' (alcohol) + '-ometer' (measuring instrument)","priority":"★★★"},"pronunciation":{"ipa":"/ˌælkəˈwɒmɪtər/","syllables":"al-co-om-e-ter"},"inflection":{"noun_plural":"alco-ometers"},"usage_notes":{"explanation":"An alco-ometer is a specific type of hydrometer used to measure the alcohol content in a liquid, typically alcoholic beverages. It works on the principle that the density of the liquid changes with the alcohol concentration.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a thermometer to measure the alcohol.","correct":"✓ I used an alco-ometer to measure the alcohol.","note":"A thermometer measures temperature, while an alco-ometer measures alcohol concentration."}],"priority":"★★☆"},"related_words":{"derivatives":["alcohol","meter","hydrometer"],"related_terms":["breathalyzer","alcohol test"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"An alco-ometer is a technical term for a device that measures the amount of alcohol in a liquid. It's not a commonly used word, but it's important in contexts where precise alcohol measurement is needed, such as in brewing or distilling. It's a type of hydrometer specifically designed for alcohol measurement."},"example_sentences":[{"sentence":"The distiller used an alco-ometer to ensure the spirit met the required proof.","translation":"蒸留業者は、蒸留酒が必要なプルーフを満たしていることを確認するためにアルコール濃度計を使用した。","type":"general"},{"sentence":"The alco-ometer showed that the homemade wine had an alcohol content of 12%.","translation":"アルコール濃度計は、自家製ワインのアルコール含有量が12％であることを示した。","type":"general"}]}