{"word":"shovelboard","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"シャッフルボード","english_definition":"A game in which players use cues to push weighted discs along a smooth surface, aiming to land them within marked scoring areas.","examples":[{"sentence":"They played shuffleboard on the cruise ship.","translation":"彼らはクルーズ船でシャッフルボードをした。"},{"sentence":"Shuffleboard is a popular pastime for seniors.","translation":"シャッフルボードは高齢者に人気の娯楽です。"}],"collocations":["play shuffleboard","shuffleboard court","shuffleboard tournament"],"synonyms":["deck shuffleboard","floor shuffleboard"],"antonyms":[]}],"etymology":{"value":"The name 'shovelboard' comes from the fact that the game originally involved shovelling or sliding coins or weights along a board.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʃʌvəlˌbɔrd/","syllables":"shov-el-board"},"inflection":{"noun_plural":"shovelboards"},"usage_notes":{"explanation":"Shuffleboard can refer to two main types of games: deck shuffleboard, played on ships or long courts, and floor shuffleboard, played on smaller indoor courts. The basic principle is the same: players use cues to propel discs toward scoring zones.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"I'm going to play shuffle board.","correct":"I'm going to play shuffleboard.","note":"'Shuffleboard' is one word."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Shuffleboard' is a relatively uncommon word referring to a specific game. Understanding its meaning requires familiarity with recreational activities, particularly those associated with cruise ships or senior centers. While the word itself is not complex, its limited usage makes it less likely to be encountered in everyday conversation or general reading material."},"example_sentences":[{"sentence":"The retirement community had a well-maintained shuffleboard court.","translation":"その高齢者コミュニティには、手入れの行き届いたシャッフルボードコートがあった。","type":"noun","meaning_category":"シャッフルボード"},{"sentence":"He practiced his shuffleboard skills every day.","translation":"彼は毎日シャッフルボードの腕を磨いた。","type":"noun","meaning_category":"シャッフルボード"}]}