{"word":"dogboat","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(slang, humorous) A small, often poorly maintained or makeshift boat.","english_definition":"(slang, humorous) A small, often poorly maintained or makeshift boat; a boat in poor condition.","examples":[{"sentence":"He showed up in this old dogboat that looked like it was about to fall apart.","translation":"彼は今にも壊れそうなオンボロの小型ボートに乗って現れた。"},{"sentence":"That dogboat wouldn't last five minutes in rough seas.","translation":"あのオンボロ船は荒れた海では5分ももたないだろう。"}],"collocations":["old dogboat","rickety dogboat"],"synonyms":["clunker","beater","rust bucket","tub","shantyboat"],"antonyms":[]}],"etymology":{"value":"Likely a humorous combination of 'dog' (implying something of low quality or undesirable) and 'boat'. The term suggests the boat is so bad it's fit for a dog.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɔɡboʊt/","syllables":"dog-boat"},"inflection":{"noun_plural":"dogboats"},"usage_notes":{"explanation":"'Dogboat' is a slang term, typically used humorously or disparagingly to describe a small boat that is old, poorly maintained, or of low quality. It's not a formal term and is more common in informal conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He sailed his dogboat across the Atlantic.","correct":"✓ He sailed his small boat across the Atlantic. (If the boat was NOT a 'dogboat')","note":"Using 'dogboat' implies the boat is in poor condition. If the boat was seaworthy for a trans-Atlantic voyage, 'dogboat' would be inappropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (slang, uncommon)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dogboat' is a slang term used to describe a small boat that is in poor condition. It's a humorous way to say that the boat is old, not well-maintained, or of low quality. The term is not used in formal settings. Understanding the humor requires familiarity with the negative connotations of 'dog' when used to describe something's quality."},"example_sentences":[{"sentence":"Look at that old dogboat tied up at the dock!","translation":"ドックに繋がれているあのオンボロ船を見て！","type":"noun","meaning_category":"small, poorly maintained boat"},{"sentence":"He spent all summer fixing up his dogboat.","translation":"彼は夏の間ずっと自分のオンボロ船の修理に費やした。","type":"noun","meaning_category":"small, poorly maintained boat"}]}