{"word":"Pishpek","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ビシュケク (キルギスの首都の旧称)","english_definition":"Former name of Bishkek, the capital city of Kyrgyzstan.","examples":[{"sentence":"Pishpek was the capital of the Kirghiz ASSR within the Russian SFSR.","translation":"ピシュペクは、ロシアSFSR内のキルギス自治ソビエト社会主義共和国の首都でした。"},{"sentence":"The city was renamed Bishkek in 1991, after Kyrgyzstan gained independence.","translation":"キルギスが独立した後、1991年に都市はビシュケクと改名されました。"}],"collocations":[],"synonyms":["Bishkek"],"antonyms":[]}],"etymology":{"value":"The name Pishpek is of uncertain origin, but it is believed to be derived from a Kyrgyz word for a stick used to churn kumis (fermented mare's milk).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɪʃpek/","syllables":"Pish-pek"},"inflection":{},"usage_notes":{"explanation":"Pishpek is the historical name of Bishkek, the capital of Kyrgyzstan. It was used during the Soviet era. After Kyrgyzstan gained independence in 1991, the city was renamed Bishkek. When referring to the city's history before 1991, 'Pishpek' is the appropriate term.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":[],"related_places":["Kyrgyzstan","Bishkek"],"related_terms":["Frunze (another former name of Bishkek)"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"'Pishpek' is a historical term, specifically the former name of Bishkek, the capital of Kyrgyzstan. Its usage is limited to discussions of the city's history before 1991. It is not commonly used in contemporary contexts. Understanding its historical significance is key to interpreting texts related to the Soviet era or the early years of Kyrgyzstan's independence."},"example_sentences":[{"sentence":"In 1926, Pishpek was renamed Frunze in honor of Mikhail Frunze.","translation":"1926年、ピシュペクはミハイル・フルンゼに敬意を表してフルンゼと改名されました。","type":"historical","meaning_category":"historical name"},{"sentence":"The Treaty of Pishpek was signed in the city in the early 20th century.","translation":"ピシュペク条約は20世紀初頭にこの都市で締結されました。","type":"historical","meaning_category":"historical event"}]}