{"word":"calquing","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"翻訳借用、翻訳借用語、模倣翻訳：ある言語の単語や句の構造を別の言語に直訳して作り出された単語や句。","english_definition":"The process or result of borrowing a word or phrase from one language and translating its elements literally into another. The resulting word or phrase is called a calque or loan translation.","examples":[{"sentence":"The term 'skyscraper' is a calque of the French 'gratte-ciel'.","translation":"「skyscraper（超高層ビル）」という言葉は、フランス語の「gratte-ciel」の翻訳借用である。"},{"sentence":"'Beer garden' is a calque from the German 'Biergarten'.","translation":"「Beer garden（ビアガーデン）」は、ドイツ語の「Biergarten」からの翻訳借用である。"},{"sentence":"Calquing is a common way for languages to adopt new concepts.","translation":"翻訳借用は、言語が新しい概念を取り入れる一般的な方法である。"}],"collocations":["loan translation","word-for-word translation","semantic loan"],"synonyms":["loan translation","semantic loan"],"antonyms":[]},{"part_of_speech":"verb","definition":"翻訳借用する、模倣翻訳する：ある言語の単語や句を別の言語に直訳して作り出す。","english_definition":"To create a new word or phrase in one language by translating the elements of a word or phrase from another language literally.","examples":[{"sentence":"They calqued the English phrase 'long time no see' into their language.","translation":"彼らは英語のフレーズ「long time no see（久しぶり）」を自分たちの言語に翻訳借用した。"},{"sentence":"The translator calqued the idiom to make it understandable in the target language.","translation":"翻訳者は、目的言語で理解できるようにイディオムを翻訳借用した。"}],"collocations":["literally translate","borrow and translate","create a loan translation"],"synonyms":["literally translate","borrow and translate"],"antonyms":[]}],"etymology":{"value":"フランス語の \"calque\"（模写、複写）に由来し、これはイタリア語の \"calco\"（押し型、石膏模型）から来ています。さらに遡ると、ラテン語の \"calx\"（石灰、石灰石）にたどり着きます。石灰は型を取るのに使われたため、この語源が模倣や複写の意味につながりました。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkælkɪŋ/","syllables":"cal-quing"},"inflection":{"verb_forms":{"present_simple":["calques"],"past_simple":"calqued","past_participle":"calqued","present_participle":"calquing"}},"usage_notes":{"explanation":"「**calquing**」は、ある言語から別の言語へ単語やフレーズを導入する際に、元の言語の構成要素を文字通り翻訳して新しい単語やフレーズを作り出すプロセスを指します。このプロセスによって生まれる単語やフレーズ自体も「calque」と呼ばれます。翻訳借用は、特に概念やアイデアを異なる言語間で共有する際に役立ちます。ただし、直訳が不自然な場合や、文化的背景が異なる場合には、適切な翻訳や適応が必要となることがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The word is a direct translation, not a calquing.","correct":"✓ The word is a direct translation, but it's also a calque.","note":"「calque」は翻訳の一種であり、単に「翻訳」と対比されるものではありません。直接翻訳でありながら、翻訳借用でもあるというケースが多くあります。"},{"incorrect":"✗ Calquing is always a bad translation strategy.","correct":"✓ Calquing can sometimes lead to awkward translations if not done carefully.","note":"翻訳借用は必ずしも悪い翻訳戦略ではありません。新しい概念を導入する有効な手段となることもあります。ただし、注意深く行わないと不自然な翻訳になる可能性があります。"}],"priority":"★★☆"},"related_words":{"derivatives":["calque (noun: 翻訳借用語)"],"related_terms":["loanword (外来語：ある言語から別の言語にそのまま取り入れられた単語)","borrowing (借用：ある言語から別の言語に単語や概念を取り入れること)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 言語学や翻訳の分野でよく使われる専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Calquing**」は、ある言語の単語やフレーズを別の言語に翻訳する際に、元の言語の要素を文字通りに翻訳して新しい単語やフレーズを作ることを指します。これは、単に単語を借りてくる（loanword）のではなく、元の単語の構造を模倣して翻訳する点で異なります。例えば、英語の「skyscraper」がフランス語の「gratte-ciel」を模倣して作られたように、翻訳借用は言語間の影響を示す興味深い現象です。言語学や翻訳の分野でよく使われる専門用語であり、一般的な会話ではあまり使われません。"},"example_sentences":[{"sentence":"'Brain drain' is a calque from German 'Brain-Drain'.","translation":"「Brain drain（頭脳流出）」は、ドイツ語の「Brain-Drain」からの翻訳借用である。","type":"noun","meaning_category":"翻訳借用"},{"sentence":"Many computer terms are calqued from English into other languages.","translation":"多くのコンピュータ用語は、英語から他の言語に翻訳借用されている。","type":"verb","meaning_category":"翻訳借用する"},{"sentence":"The translator avoided calquing the idiom to maintain the natural flow of the target language.","translation":"翻訳者は、目的言語の自然な流れを維持するために、イディオムの翻訳借用を避けた。","type":"verb","meaning_category":"翻訳借用する"},{"sentence":"Calquing can enrich a language by introducing new ways of expressing ideas.","translation":"翻訳借用は、アイデアを表現する新しい方法を導入することで、言語を豊かにすることができる。","type":"noun","meaning_category":"翻訳借用"}]}