{"word":"sulphite","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"亜硫酸塩","english_definition":"a salt or ester of sulfurous acid.","examples":[{"sentence":"Sulphites are used as preservatives in many foods and beverages.","translation":"亜硫酸塩は多くの食品や飲料の保存料として使用されています。"},{"sentence":"Some people are sensitive to sulphites and may experience allergic reactions.","translation":"亜硫酸塩に敏感な人もおり、アレルギー反応を起こすことがあります。"}],"collocations":["sulphite sensitivity (亜硫酸塩過敏症)","sulphite-free (亜硫酸塩不使用)","added sulphites (添加亜硫酸塩)"],"synonyms":["sulfite"],"antonyms":[]}],"etymology":{"value":"Derived from 'sulfur' (or 'sulphur' in British English) and the suffix '-ite', indicating a salt of sulfurous acid.","priority":"★★☆"},"pronunciation":{"ipa":"ˈsʌlfaɪt","syllables":"sul-phite"},"inflection":{"noun_plural":"sulphites"},"usage_notes":{"explanation":"Sulphites are chemical compounds that are salts or esters of sulfurous acid. They are commonly used as preservatives in food and beverages to prevent spoilage and discoloration. However, some individuals have a sensitivity or allergy to sulphites, which can cause various reactions, including skin rashes, digestive issues, and respiratory problems. The spelling 'sulphite' is more common in British English, while 'sulfite' is the preferred spelling in American English.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Sulphate is the same as sulphite.","correct":"✓ Sulphate is different from sulphite.","note":"Sulphate is a salt of sulfuric acid, while sulphite is a salt of sulfurous acid. They are different chemical compounds."}],"priority":"★★☆"},"related_words":{"derivatives":["sulfurous acid (亜硫酸)","sulfur dioxide (二酸化硫黄)","sulphate (硫酸塩)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sulphite' refers to a chemical compound used as a preservative, especially in food and drinks. It's important to be aware of it because some people have allergic reactions to it. If you see 'sulphite' on a food label, it means that this preservative has been added. The term is more commonly used in a scientific or technical context, particularly when discussing food safety or allergies.","priority":"★★☆"},"example_sentences":[{"sentence":"This wine contains added sulphites to maintain its freshness.","translation":"このワインには鮮度を保つために亜硫酸塩が添加されています。","type":"general","meaning_category":"preservative"},{"sentence":"People with asthma may be more sensitive to sulphites.","translation":"喘息を持つ人は亜硫酸塩に敏感である可能性があります。","type":"medical","meaning_category":"allergy"},{"sentence":"The label clearly states that the product is sulphite-free.","translation":"ラベルには、この製品が亜硫酸塩不使用であることが明記されています。","type":"food labeling","meaning_category":"food safety"}]}