{"word":"Ureterolith","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"尿管結石","english_definition":"A calculus (stone) located in the ureter.","examples":[{"sentence":"The patient was diagnosed with a ureterolith after experiencing severe flank pain.","translation":"患者は激しい側腹部痛を訴え、尿管結石と診断された。"},{"sentence":"Treatment options for a ureterolith may include pain management, medication, or surgical removal.","translation":"尿管結石の治療法としては、疼痛管理、薬物療法、または外科的除去などが考えられる。"}],"collocations":["ureterolithiasis (尿管結石症)","renal colic due to ureterolith (尿管結石による腎疝痛)","extracorporeal shock wave lithotripsy (ESWL) for ureterolith (尿管結石に対する体外衝撃波結石破砕術)"],"synonyms":["ureteral calculus","ureter stone"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'ureter' (the tube carrying urine from the kidney to the bladder) and 'lithos' (stone).","priority":"★★☆"},"pronunciation":{"ipa":"/juˈriːtəroʊˌlɪθ/","syllables":"u-re-ter-o-lith"},"inflection":{"noun_plural":"ureteroliths"},"usage_notes":{"explanation":"A ureterolith is a specific type of kidney stone that has moved into the ureter. It can cause significant pain and urinary obstruction.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor found a kidney stone in the ureter, so it's a nephrolith.","correct":"✓ The doctor found a kidney stone in the ureter, so it's a ureterolith.","note":"A nephrolith is a kidney stone located in the kidney itself, while a ureterolith is a kidney stone located in the ureter."}],"priority":"★★☆"},"related_words":{"derivatives":["ureterolithiasis (尿管結石症)","nephrolithiasis (腎結石症)","lithiasis (結石症)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Ureterolith' is a medical term referring to a stone located in the ureter. It is derived from Greek roots and is primarily used in medical contexts. Understanding this term requires familiarity with medical terminology related to the urinary system."},"example_sentences":[{"sentence":"The ureterolith caused severe hydronephrosis in the affected kidney.","translation":"尿管結石は、罹患した腎臓に重度の水腎症を引き起こした。","type":"medical","meaning_category":"location"},{"sentence":"The size of the ureterolith was measured using a CT scan.","translation":"尿管結石のサイズはCTスキャンを用いて測定された。","type":"medical","meaning_category":"diagnosis"}]}