{"word":"spell-stopped","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(ファンタジー)魔法によって止められた、魔法の効果で動かなくなった","english_definition":"(Fantasy) Halted or immobilized by a magical spell.","examples":[{"sentence":"The knight found the dragon spell-stopped in mid-air, an opportunity he couldn't miss.","translation":"騎士は、魔法で空中で動きを止められたドラゴンを見つけ、それは彼にとって見逃せない好機だった。"},{"sentence":"The ancient clock was spell-stopped, its hands frozen at the moment the wizard vanished.","translation":"古代の時計は魔法で止められており、魔法使いが消えた瞬間に針が止まっていた。"}],"collocations":["spell-stopped dragon","spell-stopped clock","spell-stopped in mid-air"],"synonyms":["immobilized by magic","frozen by spell","magically halted"],"antonyms":["unaffected by magic","moving freely","unimpeded"]}],"etymology":{"value":"Composed of 'spell' (referring to a magical incantation) and 'stopped' (past participle of 'stop', meaning to cease movement or operation). The combination indicates a cessation of movement or function due to magical influence.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈspɛl stɒpt/","syllables":"spell-stop-ped"},"inflection":{"notes":"This word is typically used as an adjective. It doesn't have different forms for gender or number."},"usage_notes":{"explanation":"The term 'spell-stopped' is primarily used in fantasy literature and role-playing games to describe something that has been magically frozen or halted in its actions. It is not a common word in everyday conversation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The car was spell-stopped by the mechanic.","correct":"✓ The car was stopped by the mechanic.","note":"'Spell-stopped' refers to magical intervention, not mechanical or ordinary means of stopping something."},{"incorrect":"✗ He spell-stopped to talk to her.","correct":"✓ He stopped to talk to her.","note":"'Spell-stopped' is not a verb meaning 'to stop'; it is an adjective describing something halted by magic."}],"priority":"★★☆"},"related_words":{"derivatives":["spell (noun): a magical incantation","stop (verb): to cease movement","spellbound: held by or as if by a spell"],"phrases":["under a spell","magic spell","frozen in time"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - primarily used in fantasy literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Spell-stopped' is a niche term primarily found in fantasy literature. It combines the concept of a 'spell' (magical incantation) with 'stopped' (ceased movement). Understanding requires familiarity with fantasy tropes and vocabulary. Its usage is highly specific to contexts involving magic and enchanted objects or beings."},"example_sentences":[{"sentence":"The wizard's tower was filled with spell-stopped creatures, each frozen in a moment of terror or surprise.","translation":"魔法使いの塔は、魔法で動きを止められた生き物で満たされており、それぞれが恐怖や驚きの瞬間に凍りついていた。","type":"adjective","meaning_category":"魔法によって止められた"},{"sentence":"A spell-stopped waterfall hung suspended in the air, a testament to the archmage's power.","translation":"魔法で止められた滝が空中に浮かび上がり、大魔術師の力を証明していた。","type":"adjective","meaning_category":"魔法によって止められた"}]}