{"word":"comprehensibly","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"理解できるように、わかりやすく","english_definition":"in a way that is easy to understand; clearly.","examples":[{"sentence":"The teacher explained the concept comprehensibly.","translation":"先生はその概念をわかりやすく説明した。"},{"sentence":"He wrote the instructions comprehensibly so that anyone could follow them.","translation":"彼は誰でも従えるように、指示をわかりやすく書いた。"},{"sentence":"The speaker presented the information comprehensibly, using simple language and clear examples.","translation":"講演者は簡単な言葉と明確な例を用いて、情報をわかりやすく提示した。"}],"collocations":["explain comprehensibly","write comprehensibly","present comprehensibly","speak comprehensibly","describe comprehensibly"],"synonyms":["clearly","understandably","lucidly","plainly","intelligibly","explicitly"],"antonyms":["incomprehensibly","unintelligibly","obscurely","vaguely"]}],"etymology":{"value":"The word \"comprehensibly\" is derived from the adjective \"comprehensible,\" which comes from the Latin word \"comprehendere,\" meaning \"to grasp, seize, understand.\" The suffix \"-ly\" is added to form the adverb.","priority":"★★★"},"pronunciation":{"ipa":"/ˌkɒmprɪˈhensɪbli/","syllables":"com-pre-hen-si-bly"},"inflection":{"notes":"As an adverb, \"comprehensibly\" does not have different inflections."},"usage_notes":{"explanation":"\"Comprehensibly\" is used to describe how something is communicated or presented in a way that is easy for others to understand. It emphasizes the clarity and intelligibility of the information being conveyed. It is often used to describe explanations, instructions, or presentations that are well-organized and use simple language.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The report was comprehensibly written.","correct":"✓ The report was written comprehensibly.","note":"Adverbs typically modify verbs, adjectives, or other adverbs. In this case, \"comprehensibly\" modifies the verb \"written,\" so it should be placed after the verb."},{"incorrect":"✗ He comprehensibly explained the theorem.","correct":"✓ He explained the theorem comprehensibly.","note":"Similar to the previous example, the adverb \"comprehensibly\" should follow the verb \"explained\"."},{"incorrect":"✗ The comprehensibly of the text was high.","correct":"✓ The comprehensibility of the text was high.","note":"\"Comprehensibly\" is an adverb, while \"comprehensibility\" is a noun that refers to the quality of being easily understood. The sentence requires a noun to function as the subject."}],"priority":"★★☆"},"related_words":{"derivatives":["comprehensible (adjective: understandable)","comprehensibility (noun: the quality of being understandable)","comprehend (verb: to understand)","comprehension (noun: understanding)","incomprehensible (adjective: not understandable)","incomprehensibly (adverb: in a way that is not understandable)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but used in academic and professional contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"comprehensibly\" is an adverb that means \"in a way that is easy to understand.\" It is used to describe how something is communicated or explained. Because it is an adverb derived from a more common adjective (\"comprehensible\"), it is more likely to be encountered in written or formal spoken contexts where clarity and precision are important. It is not a word typically used in everyday conversation. Understanding the root word \"comprehend\" and the suffix \"-ible\" can help in understanding the meaning of \"comprehensibly.\""},"example_sentences":[{"sentence":"She spoke slowly and comprehensibly so that everyone could understand her.","translation":"彼女は皆が理解できるように、ゆっくりとわかりやすく話した。","type":"general","meaning_category":"understanding"},{"sentence":"The manual was written comprehensibly, making it easy for users to install the software.","translation":"そのマニュアルはわかりやすく書かれていたため、ユーザーはソフトウェアを簡単にインストールできた。","type":"general","meaning_category":"understanding"},{"sentence":"The data was presented comprehensibly in a series of charts and graphs.","translation":"データは一連の図表でわかりやすく提示された。","type":"general","meaning_category":"understanding"}]}