{"word":"cheesebox","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に米国で軽蔑的に) 安っぽい、四角い、見栄えのしない建物、特に現代的な建物","english_definition":"(chiefly US, derogatory) a cheap, boxy, and unattractive building, especially a modern one.","examples":[{"sentence":"The new apartment complex was just a big, ugly cheesebox.","translation":"新しいアパートはただの大きくて醜いチーズ箱だった。"},{"sentence":"They called the office building a cheesebox because of its plain, rectangular design.","translation":"彼らはそのオフィスビルを、その簡素な長方形のデザインからチーズ箱と呼んだ。"}],"collocations":["ugly cheesebox","modern cheesebox","big cheesebox"],"synonyms":["eyesore","monstrosity","box","block"],"antonyms":["architectural masterpiece","beautiful building"]},{"part_of_speech":"noun","definition":"(歴史的な意味で) チーズを輸送するための箱","english_definition":"a box for transporting cheese.","examples":[{"sentence":"The cheesebox was filled with cheddar.","translation":"チーズボックスはチェダーチーズでいっぱいだった。"}],"collocations":["filled cheesebox","wooden cheesebox"],"synonyms":["cheese crate"],"antonyms":[]}],"etymology":{"value":"'cheese' + 'box'. The term likely originated from the resemblance of plain, rectangular buildings to the shape of boxes used for transporting cheese.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʃiːzˌbɒks/","syllables":"cheese-box"},"inflection":{"noun_plural":"cheeseboxes"},"usage_notes":{"explanation":"The term \"cheesebox\" is primarily used in American English as a derogatory term for buildings that are considered unattractive due to their simple, box-like design. It is often used to criticize modern architecture that lacks aesthetic appeal. The historical meaning refers to a literal box used for transporting cheese, but this usage is less common today.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cheesebox was very artistic and beautiful.","correct":"✓ The building was very artistic and beautiful.","note":"Using \"cheesebox\" to describe an artistic and beautiful building would be contradictory, as the term is inherently derogatory."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrases":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"cheesebox\" is a somewhat uncommon, derogatory term used to describe buildings that are considered unattractive due to their simple, box-like design. It is often used in architectural criticism. The term's meaning is derived from the resemblance of these buildings to the shape of boxes used for transporting cheese. While it has a literal meaning related to cheese transport, this is less common than its use as a pejorative architectural term."},"example_sentences":[{"sentence":"The critic described the new office tower as a soulless cheesebox.","translation":"評論家はその新しいオフィスタワーを魂のないチーズ箱だと評した。","type":"noun","meaning_category":"derogatory building description"},{"sentence":"The old wooden cheesebox was used to transport cheddar across the state.","translation":"古い木製のチーズボックスは、州を横断してチェダーチーズを輸送するために使用された。","type":"noun","meaning_category":"cheese transport box"}]}