{"word":"wakerife","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(古語、スコットランド)不眠の、眠れない、警戒心の強い、用心深い","english_definition":"(archaic, Scotland) watchful; vigilant; sleepless.","examples":[{"sentence":"The wakerife sentry stood guard throughout the night.","translation":"用心深い歩哨は一晩中警戒に立っていた。"},{"sentence":"He was wakerife, always alert to any potential danger.","translation":"彼は用心深く、常に潜在的な危険に警戒していた。"}],"collocations":["wakerife and wary","a wakerife watchman"],"synonyms":["watchful","vigilant","sleepless","alert","cautious","circumspect"],"antonyms":["unwatchful","negligent","drowsy","asleep","careless"]}],"etymology":{"value":"Middle English: from wake + rife. Rife means widespread or common, so originally it meant 'wakeful to a great extent'.","priority":"★★☆"},"pronunciation":{"ipa":"ˈweɪkˌraɪf","syllables":"wake-rife"},"inflection":{"notes":"Comparative and superlative forms (more wakerife, most wakerife) are possible but rare."},"usage_notes":{"explanation":"'Wakerife' is an archaic term, primarily found in older literature and Scottish English. It describes someone who is highly alert, watchful, and often unable to sleep. The word emphasizes a state of heightened awareness and vigilance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was wakerife because he was tired.","correct":"✓ He was wakerife because he sensed danger.","note":"'Wakerife' implies alertness and watchfulness, not simply tiredness. It's used when someone is actively staying awake due to a specific reason, such as fear or responsibility."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrases":[],"related_concepts":["vigilance","alertness","sleeplessness","watchfulness"]},"level_frequency":{"CEFR":"N/A (archaic)","frequency_google_ngram":"Very low frequency; mostly found in older texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Wakerife' is an archaic and uncommon word. It's primarily encountered in older literature, particularly Scottish texts. Understanding its meaning requires familiarity with historical language usage. It describes a state of being watchful and vigilant, often to the point of sleeplessness. Due to its rarity, it's not part of standard modern English vocabulary."},"example_sentences":[{"sentence":"The old shepherd was wakerife, always scanning the hills for wolves.","translation":"その老いた羊飼いは用心深く、常に丘に狼がいないか目を光らせていた。","type":"adjective","meaning_category":"警戒心の強い"},{"sentence":"Despite his exhaustion, he remained wakerife, fearing an attack.","translation":"疲労にもかかわらず、彼は攻撃を恐れて眠らずに警戒していた。","type":"adjective","meaning_category":"不眠の"}]}