{"word":"Europeanization","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ヨーロッパ化、欧州化","english_definition":"The process by which non-European countries or regions adopt the political, economic, and social systems, values, and norms of Europe. It can also refer to the increasing influence of the European Union on its member states and neighboring countries.","examples":[{"sentence":"The Europeanization of Japan's legal system began in the Meiji era.","translation":"日本の法制度の欧州化は明治時代に始まった。"},{"sentence":"The accession process to the EU involves the Europeanization of candidate countries' economies and institutions.","translation":"EUへの加盟プロセスには、候補国の経済と制度の欧州化が含まれる。"},{"sentence":"Some scholars argue that globalization is simply a form of Europeanization on a global scale.","translation":"グローバル化は、単に地球規模での欧州化の一形態に過ぎないと主張する学者もいる。"}],"collocations":["political Europeanization (政治的な欧州化)","economic Europeanization (経済的な欧州化)","cultural Europeanization (文化的な欧州化)","legal Europeanization (法的な欧州化)","institutional Europeanization (制度的な欧州化)"],"synonyms":["Westernization","Modernization","Globalization"],"antonyms":["De-Europeanization","Localization","Nationalization"]}],"etymology":{"value":"The term is derived from the word 'Europe' and the suffix '-ization,' which denotes a process of becoming or making something.","priority":"★★★"},"pronunciation":{"ipa":"/ˌjʊərəpiːənaɪˈzeɪʃən/","syllables":"Eu-ro-pe-an-i-za-tion"},"inflection":{"noun_plural":"Europeanizations"},"usage_notes":{"explanation":"Europeanization refers to the adoption or imposition of European political, economic, and social models on non-European contexts. It can also describe the impact of the European Union on its member states and neighboring countries, leading to policy convergence and institutional adaptation. The term is often used in political science, sociology, and economics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The country is Europeanizing their culture.","correct":"✓ The country is undergoing Europeanization of its culture.","note":"'Europeanization' is a noun, so it describes a process, not an action that a subject performs directly. Use 'undergoing Europeanization' or 'the Europeanization of' to describe the process."},{"incorrect":"✗ Europeanization only affects countries in Europe.","correct":"✓ Europeanization can affect countries both within and outside of Europe.","note":"Europeanization can refer to the influence of European models on countries outside of Europe, not just within the continent."}],"priority":"★★☆"},"related_words":{"derivatives":["Europeanize (verb)","European (adjective, noun)"],"phrases":["soft power","policy transfer","institutional isomorphism"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively infrequent, but common in academic and political discourse.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Europeanization' is a complex term that describes the process of adopting European political, economic, and social systems and norms in non-European contexts or the increasing influence of the European Union. It is often used in academic and political discussions, particularly in the fields of political science, sociology, and economics. Understanding the term requires familiarity with European history, politics, and institutions."},"example_sentences":[{"sentence":"The **Europeanization** of agricultural policies in Eastern Europe has led to significant changes in farming practices.","translation":"東ヨーロッパにおける農業政策の欧州化は、農業慣行に大きな変化をもたらした。","type":"general"},{"sentence":"Critics argue that **Europeanization** can lead to a loss of national identity and cultural diversity.","translation":"批判家は、欧州化が国民のアイデンティティと文化的多様性の喪失につながる可能性があると主張している。","type":"criticism"},{"sentence":"The **Europeanization** process requires candidate countries to align their laws with EU regulations.","translation":"欧州化のプロセスでは、候補国は自国の法律をEUの規制に合わせる必要がある。","type":"political science"}]}