{"word":"oralization","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"口頭化、音声化、口述","english_definition":"The act or process of expressing something in spoken words; the conversion of written or symbolic information into spoken language.","examples":[{"sentence":"The oralization of the text made it accessible to visually impaired individuals.","translation":"そのテキストの口頭化によって、視覚障碍者もアクセスできるようになった。"},{"sentence":"The teacher emphasized the importance of oralization in language learning.","translation":"先生は言語学習において音声化の重要性を強調した。"},{"sentence":"The software allows for the oralization of documents, which is helpful for proofreading.","translation":"そのソフトウェアは文書の音声化を可能にし、校正に役立つ。"}],"collocations":["text oralization (テキストの音声化)","data oralization (データの音声化)","oralization of information (情報の音声化)","promote oralization (口頭化を促進する)","support oralization (口頭化を支援する)"],"synonyms":["vocalization","verbalization","speaking","utterance","articulation"],"antonyms":["writing","inscription","textualization","silent reading"]},{"part_of_speech":"noun","definition":"（心理学）口唇期固着の表出","english_definition":"(Psychology) The expression or manifestation of fixations related to the oral stage of psychosexual development.","examples":[{"sentence":"His constant need for attention could be seen as an oralization of unresolved childhood issues.","translation":"彼の絶え間ない注意を求める欲求は、未解決の幼少期の課題の口唇期固着の表出と見なせる。"},{"sentence":"The therapist explored the patient's oralization patterns to understand their underlying anxieties.","translation":"セラピストは患者の口唇期固着の表出パターンを探り、その根底にある不安を理解しようとした。"}],"collocations":["oral fixation (口唇期固着)","psychosexual development (精神性的発達)","unresolved issues (未解決の課題)","manifestation of oralization (口唇期固着の表出)"],"synonyms":["oral fixation expression","manifestation of oral stage issues"],"antonyms":[]}],"etymology":{"value":"Derived from 'oral' (relating to the mouth or spoken words) and '-ization' (the process of making something into a specific form or state).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɔːrəlaɪˈzeɪʃən/","syllables":"o-ra-li-za-tion"},"inflection":{"noun_plural":"oralizations"},"usage_notes":{"explanation":"'Oralization' primarily refers to the process of converting text or data into spoken form. It is commonly used in contexts related to accessibility, language learning, and assistive technologies. In a psychological context, particularly within psychoanalytic theory, it can refer to the expression of fixations related to the oral stage of development, but this usage is less common.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The oralisation of the report was very long.","correct":"✓ The oralization of the report was very long.","note":"'Oralization' is the standard spelling, although 'oralisation' is an acceptable variant in some Commonwealth countries."},{"incorrect":"✗ He used oralization to write the letter.","correct":"✓ He used dictation to write the letter.","note":"'Oralization' refers to speaking something aloud, not using speech to create written text (which is dictation)."}],"priority":"★★☆"},"related_words":{"derivatives":["oral (adjective)","oralize (verb)","oralist (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Oralization' is a relatively uncommon term that refers to the process of converting written information into spoken language. It can also refer to the expression of fixations related to the oral stage of psychosexual development in psychology, although this usage is less frequent. The word is typically encountered in academic or technical contexts. Understanding the context is important to determine the intended meaning."},"example_sentences":[{"sentence":"The company is developing new software for the **oralization** of e-books.","translation":"その会社は電子書籍の音声化のための新しいソフトウェアを開発している。","type":"noun","meaning_category":"口頭化、音声化"},{"sentence":"The professor discussed the concept of **oralization** in Freudian psychology.","translation":"教授はフロイト心理学における口唇期固着の表出の概念について議論した。","type":"noun","meaning_category":"（心理学）口唇期固着の表出"},{"sentence":"The **oralization** of the data made it easier to understand for those unfamiliar with the subject.","translation":"データの音声化は、その主題に不慣れな人にとって理解しやすくした。","type":"noun","meaning_category":"口頭化、音声化"}]}