{"word":"unit-by-unit","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"ユニットごとに、一つ一つのユニットで","english_definition":"in a manner that considers or deals with each unit separately and individually.","examples":[{"sentence":"The software was tested unit-by-unit to ensure each component functioned correctly.","translation":"ソフトウェアは、各コンポーネントが正しく機能することを確認するために、ユニットごとにテストされました。"},{"sentence":"The assembly line processed the products unit-by-unit.","translation":"組み立てラインは製品をユニットごとに処理しました。"},{"sentence":"We analyzed the data unit-by-unit to identify any anomalies.","translation":"異常を特定するために、データをユニットごとに分析しました。"}],"collocations":["analyze unit-by-unit","test unit-by-unit","process unit-by-unit","examine unit-by-unit"],"synonyms":["individually","separately","one by one","piece by piece"],"antonyms":["collectively","as a whole","in bulk"]}],"etymology":{"value":"Combination of 'unit' (a single, complete thing), 'by' (indicating a process or method), and 'unit' again, emphasizing the iterative nature of the process.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈjuːnɪt baɪ ˈjuːnɪt/","syllables":"u-nit-by-u-nit"},"inflection":{"notes":"This is an adverbial phrase and does not inflect."},"usage_notes":{"explanation":"'Unit-by-unit' describes a process where each individual unit is handled or considered separately. It is often used in technical or analytical contexts to emphasize thoroughness and attention to detail.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The units were processed unit by unitly.","correct":"✓ The units were processed unit-by-unit.","note":"'Unit-by-unit' is already an adverbial phrase; adding '-ly' is incorrect."},{"incorrect":"✗ We examined the data unit by unit, it was very tedious.","correct":"✓ We examined the data unit-by-unit; it was very tedious.","note":"Hyphenation is important for clarity. Without hyphens, the phrase can be misinterpreted."}],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["unit testing","modular design","component analysis"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'unit-by-unit' is a relatively specialized term used to describe a detailed, iterative process of examining or processing individual units. It is most commonly found in technical or analytical contexts where precision and thoroughness are important. Understanding the term requires a good grasp of compound words and adverbial phrases."},"example_sentences":[{"sentence":"The technician checked each circuit board unit-by-unit.","translation":"技術者は各回路基板をユニットごとにチェックしました。","type":"adverb","meaning_category":"逐一"},{"sentence":"The code was reviewed unit-by-unit to identify potential vulnerabilities.","translation":"潜在的な脆弱性を特定するために、コードはユニットごとにレビューされました。","type":"adverb","meaning_category":"逐一"},{"sentence":"The components were assembled unit-by-unit on the production line.","translation":"コンポーネントは生産ラインでユニットごとに組み立てられました。","type":"adverb","meaning_category":"逐一"}]}