{"word":"Bangalore","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"バンガロール（インドのカルナータカ州の州都）","english_definition":"A major city in India, the capital of Karnataka state.","examples":[{"sentence":"Bangalore is known as the Silicon Valley of India.","translation":"バンガロールはインドのシリコンバレーとして知られています。"},{"sentence":"I'm planning to visit Bangalore next month.","translation":"来月バンガロールを訪れる予定です。"}],"collocations":["Bangalore city","Bangalore airport","Visit Bangalore","Bangalore weather"],"synonyms":["Bengaluru (new name)"],"antonyms":[]}],"etymology":{"value":"The name Bangalore is an anglicized version of the Kannada name 'Bengalūru'. There are several legends about the origin of the name. One popular legend says that a Hoysala king, Veera Ballala II, lost his way in the forest. An old woman gave him boiled beans ('benda kaalu') to eat, and out of gratitude, he named the place 'Benda-kaal-ooru' (place of boiled beans), which eventually became Bengaluru.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbæŋɡəlɔːr/","syllables":"Bang-ga-lore"},"inflection":{"notes":"Proper noun, no plural form."},"usage_notes":{"explanation":"Bangalore is a proper noun referring to a specific city in India. It is often referred to as the 'Silicon Valley of India' due to its prominence as a technology hub. The city's official name was changed to Bengaluru in 2006, but Bangalore remains a commonly used name, especially in international contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I live in Bangalore city.","correct":"✓ I live in Bangalore.","note":"'Bangalore' already implies it's a city, so 'Bangalore city' is redundant, though commonly used."}],"priority":"★★☆"},"related_words":{"derivatives":["Bangalorean (person from Bangalore)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B1","frequency_google_ngram":"Relatively frequent, especially in contexts related to technology and India.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"'Bangalore' is the name of a big city in India. It's known for technology, so you might see it in news about computers or software. The city is now officially called 'Bengaluru', but many people still use the name 'Bangalore'."},"example_sentences":[{"sentence":"Many tech companies have offices in Bangalore.","translation":"多くのテクノロジー企業がバンガロールにオフィスを構えています。","type":"noun","meaning_category":"City"},{"sentence":"The weather in Bangalore is pleasant year-round.","translation":"バンガロールの気候は一年を通して過ごしやすいです。","type":"noun","meaning_category":"City"}]}