{"word":"unvenomous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"毒のない、無毒の","english_definition":"not venomous; not capable of injecting venom.","examples":[{"sentence":"Most snakes are unvenomous and harmless to humans.","translation":"ほとんどのヘビは毒がなく、人間にとって無害です。"},{"sentence":"The garden is home to a variety of unvenomous insects.","translation":"その庭にはさまざまな無毒の昆虫が生息しています。"}],"collocations":["unvenomous snake","unvenomous insect","unvenomous creature"],"synonyms":["nonvenomous","harmless","innocuous"],"antonyms":["venomous","poisonous"]}],"etymology":{"value":"\"un-\" (否定の接頭辞) + \"venomous\" (毒のある)","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈvɛnəməs/","syllables":"un-ven-om-ous"},"inflection":{"adjective_forms":{"comparative":"more unvenomous","superlative":"most unvenomous"}},"usage_notes":{"explanation":"\"Unvenomous\" is used to describe animals or organisms that do not produce or inject venom. It is often used in contrast to \"venomous\" to distinguish between species that pose a threat and those that do not. The term is primarily used in scientific or technical contexts, or when specifically discussing the presence or absence of venom.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The spider was unpoisonous.","correct":"✓ The spider was unvenomous.","note":"\"Venomous\" refers to toxins injected via a bite or sting, while \"poisonous\" refers to toxins ingested or absorbed. Spiders are typically venomous, not poisonous."},{"incorrect":"✗ The unvenomous snake bit me, but nothing happened.","correct":"✓ The nonvenomous snake bit me, but nothing happened.","note":"While \"unvenomous\" is correct, \"nonvenomous\" is a more commonly used and easily understood synonym."}],"priority":"★★☆"},"related_words":{"derivatives":["unvenomously (adverb)"],"related_terms":["venom","venomous","nonvenomous","poisonous","toxin"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unvenomous\" is a relatively uncommon word that means 'not venomous'. It is formed by adding the prefix 'un-' to 'venomous', which means 'capable of injecting venom'. Because it is a more technical term, it is more likely to be encountered in scientific or educational contexts when discussing animals and their characteristics. It is the direct opposite of venomous. A more common synonym is 'nonvenomous.'"},"example_sentences":[{"sentence":"The guide assured us that the snakes in the area were mostly unvenomous.","translation":"ガイドは、その地域のヘビはほとんどが無毒だと保証してくれた。","type":"adjective","meaning_category":"無毒の"},{"sentence":"Identifying unvenomous species is crucial for safe wildlife observation.","translation":"安全な野生生物観察のためには、無毒の種を識別することが重要です。","type":"adjective","meaning_category":"無毒の"},{"sentence":"The children were fascinated by the unvenomous caterpillars in the garden.","translation":"子供たちは庭にいる無毒の毛虫に魅了されていた。","type":"adjective","meaning_category":"無毒の"}]}