{"word":"Bifaces","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of prehistoric stone tool flaked on both faces.","english_definition":"A prehistoric stone tool made by removing flakes from both sides of a stone (also known as a hand axe).","examples":[{"sentence":"Bifaces are characteristic of the Acheulean industry.","translation":"両面加工石器はアシュール文化の特徴である。"},{"sentence":"Early humans used bifaces for a variety of tasks, including butchering animals and cutting wood.","translation":"初期の人類は、動物の解体や木材の切断など、さまざまな作業に両面加工石器を使用した。"}],"collocations":["Acheulean bifaces","hand axe bifaces","stone bifaces"],"synonyms":["hand axe","cleaver","hand adze"],"antonyms":[]}],"etymology":{"value":"From 'bi-' (two) + 'face' (surface), referring to the tool being worked on both sides.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbaɪfeɪsɪz/","syllables":"bi-fac-es"},"inflection":{"noun_plural":"Bifaces"},"usage_notes":{"explanation":"'Bifaces' refers specifically to a type of early stone tool. It is a technical term used in archaeology and anthropology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He found a biface in his garden, so he used it to chop wood.","correct":"✓ He found a biface in his garden; it was an archaeological artifact.","note":"Bifaces are archaeological artifacts and should not be used as tools."}],"priority":"★★☆"},"related_words":{"derivatives":["bifacial (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Bifaces' is a specialized term used in archaeology to describe a specific type of prehistoric stone tool. Understanding this term requires familiarity with archaeological concepts and terminology. It is not commonly used outside of academic or professional contexts related to archaeology or anthropology."},"example_sentences":[{"sentence":"The archaeological dig uncovered several well-preserved bifaces.","translation":"その考古学的発掘調査で、保存状態の良い両面加工石器がいくつか発見された。","type":"noun","meaning_category":"archaeology"},{"sentence":"Researchers analyzed the wear patterns on the bifaces to determine their function.","translation":"研究者たちは、両面加工石器の摩耗パターンを分析して、その機能を特定した。","type":"noun","meaning_category":"archaeology"}]}