{"word":"Helleborism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"Poisoning by hellebore.","english_definition":"Poisoning caused by the ingestion or application of plants of the genus Helleborus, typically resulting in symptoms such as vomiting, diarrhea, cardiac issues, and neurological effects.","examples":[{"sentence":"Ancient accounts describe instances of helleborism used for medicinal purposes or as a form of poisoning.","translation":"古代の記録には、薬用または毒殺の手段として用いられたヘレボリズムの事例が記述されている。"},{"sentence":"The symptoms of helleborism can vary depending on the species of hellebore and the amount ingested.","translation":"ヘレボリズムの症状は、摂取したバイケイソウの種類と量によって異なることがある。"}],"collocations":["cause helleborism","symptoms of helleborism","treat helleborism"],"synonyms":["hellebore poisoning"],"antonyms":[]}],"etymology":{"value":"Derived from 'hellebore' (the plant genus Helleborus) and '-ism' (a suffix indicating a condition or process).","priority":"★★★"},"pronunciation":{"ipa":"/ˌhɛlɪˈbɔːrɪzəm/","syllables":"hel-le-bo-rism"},"inflection":{"noun_plural":"Helleborisms"},"usage_notes":{"explanation":"Helleborism refers specifically to poisoning caused by plants of the *Helleborus* genus, which includes plants commonly known as hellebores or winter roses. While historically used in medicine (with great caution), these plants contain toxic compounds that can cause serious health problems if ingested or improperly applied. The term is relatively rare in modern usage, but may appear in historical or toxicological contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He suffered from general plant poisoning, a type of helleborism.","correct":"✓ He suffered from helleborism after ingesting hellebore roots.","note":"Helleborism is specific to poisoning from *Helleborus* plants, not general plant poisoning."}],"priority":"★☆☆"},"related_words":{"derivatives":["hellebore","helleborein"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Helleborism' is a highly specialized term referring to poisoning by hellebore plants. Understanding requires knowledge of botany and toxicology. Its use is limited to specific contexts in medicine, history, or toxicology. Due to its rarity and specific meaning, it is not part of general vocabulary.","note":"This word is rarely used in general conversation."},"example_sentences":[{"sentence":"The old herbal described the dangers of helleborism if the plant was not properly prepared.","translation":"その古い薬草書は、植物が適切に準備されていなければ、ヘレボリズムの危険性について記述していた。","type":"noun","meaning_category":"poisoning"},{"sentence":"Cases of helleborism are rare today due to increased awareness of the plant's toxicity.","translation":"植物の毒性に対する意識が高まったため、今日ではヘレボリズムの症例はまれである。","type":"noun","meaning_category":"poisoning"}]}