{"word":"metameral","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(色彩学において)条件等色的な、メタメリズムを示す","english_definition":"(in color science) exhibiting metamerism; having colors that match under one set of conditions but not under another.","examples":[{"sentence":"The two fabrics were metameral; they matched under daylight but appeared different under incandescent light.","translation":"その2つの生地は条件等色性を示した。昼光下では色が一致したが、白熱灯下では異なって見えた。"}],"collocations":["metameral pair","metameral match","metameral colors"],"synonyms":["conditional color match"],"antonyms":["non-metameral","isomeric"],"notes":["Often used in the context of textiles, paints, and other colored materials."]}],"etymology":{"value":"Derived from \"metamerism\" (the phenomenon of metameric colors) + \"-al\" (suffix indicating relationship or belonging).","priority":"★★☆"},"pronunciation":{"ipa":"/məˈtæmərəl/","syllables":"me-tam-er-al"},"inflection":{"notes":"Adjective; no comparative or superlative forms."},"usage_notes":{"explanation":"The term 'metameral' is primarily used in the fields of color science, textile engineering, and paint technology to describe colors that appear to match under specific lighting conditions but differ under others. This phenomenon is called metamerism. It's important to consider metamerism when color-matching products to ensure consistency across different lighting environments.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The metameral object was very shiny.","correct":"✓ The metameral colors appeared different under different lights.","note":"'Metameral' describes the color property, not the object itself. It's about the color's behavior under different lighting conditions."}],"priority":"★☆☆"},"related_words":{"derivatives":["metamerism (noun): the phenomenon of colors matching under one light but not another.","metamer (noun): a color that matches another under specific conditions but not all conditions."],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Specialized term used in specific fields.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Metameral' is a technical term used in color science to describe colors that exhibit metamerism. Metamerism is when two colors appear to match under one lighting condition but not under another. This term is typically encountered in contexts involving color matching, quality control in manufacturing (especially textiles and paints), and advanced color theory. Understanding this term requires a background in color science or related fields."},"example_sentences":[{"sentence":"The buyer rejected the shipment because the paint samples were metameral and did not match under all lighting conditions.","translation":"買い手は、塗料サンプルが条件等色性を示し、すべての照明条件下で一致しなかったため、出荷を拒否した。","type":"adjective","meaning_category":"conditional color matching"},{"sentence":"To avoid metameral failures, it's crucial to use standardized lighting conditions for color evaluation.","translation":"条件等色性の失敗を避けるためには、色評価に標準化された照明条件を使用することが重要です。","type":"adjective","meaning_category":"conditional color matching"}]}