{"word":"totalitarisme","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"全体主義","english_definition":"A political system in which the state recognizes no limits to its authority and strives to regulate every aspect of public and private life wherever feasible.","examples":[{"sentence":"Le totalitarisme est une forme de gouvernement oppressive.","translation":"Totalitarianism is an oppressive form of government."},{"sentence":"Le XXe siècle a été marqué par l'ascension de plusieurs régimes totalitaires.","translation":"The 20th century was marked by the rise of several totalitarian regimes."}],"collocations":["régime totalitarisme (totalitarian regime)","idéologie totalitarisme (totalitarian ideology)"],"synonyms":["dictature","autocratie"],"antonyms":["démocratie","libéralisme"]}],"etymology":{"value":"Dérivé de l'italien 'totalitario', lui-même issu de 'totalità' (totalité). Le terme a été popularisé dans les années 1920 pour décrire le régime fasciste de Mussolini.","priority":"★★☆"},"pronunciation":{"ipa":"/tɔ.ta.li.ta.ʁism/","syllables":"to-ta-li-ta-risme"},"inflection":{"noun_gender":"masculine","noun_plural":"totalitarismes"},"usage_notes":{"explanation":"Le totalitarisme se distingue de l'autoritarisme par son ambition de contrôler non seulement la sphère publique, mais aussi la pensée et les comportements privés des citoyens. Il repose souvent sur une idéologie forte et un parti unique.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Le totalitarisme est bon pour l'économie.","correct":"Le totalitarisme viole les droits de l'homme.","note":"Le totalitarisme est généralement considéré comme négatif en raison de sa suppression des libertés individuelles."}],"priority":"★★☆"},"related_words":{"derivatives":["totalitaire (adjective: totalitarian)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relativement fréquent dans les discussions politiques et historiques.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Le mot 'totalitarisme' est un terme politique complexe qui décrit un système où l'État contrôle tous les aspects de la vie publique et privée. Il est souvent utilisé dans des contextes historiques et théoriques.","note":"Ce terme est plus courant dans les discussions politiques et académiques que dans la conversation quotidienne."},"example_sentences":[{"sentence":"Le totalitarisme nie la liberté individuelle.","translation":"Totalitarianism denies individual freedom.","type":"general","meaning_category":"definition"},{"sentence":"La propagande est un outil essentiel des régimes totalitaires.","translation":"Propaganda is an essential tool of totalitarian regimes.","type":"example","meaning_category":"characteristics"}]}