{"word":"Surdimutism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"聾唖、聴覚障害と発話障害を併せ持つ状態","english_definition":"The condition of being both deaf and mute; inability to hear and speak.","examples":[{"sentence":"Surdimutism can be caused by congenital factors or acquired later in life.","translation":"聾唖は先天的な要因または後天的な要因によって引き起こされる可能性があります。"},{"sentence":"Early intervention is crucial for individuals with surdimutism to develop communication skills.","translation":"コミュニケーションスキルを開発するために、聾唖の個人に対する早期介入が重要です。"}],"collocations":["congenital surdimutism (先天性聾唖)","acquired surdimutism (後天性聾唖)","surdimutism education (聾唖教育)","surdimutism rehabilitation (聾唖リハビリテーション)"],"synonyms":["deaf-mutism","deafness and muteness"],"antonyms":[]}],"etymology":{"value":"'Surdi-' はラテン語の 'surdus' (聞こえない) に由来し、'mutism' は発話不能の状態を意味する。","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɜːrdɪˈmjuːtɪzəm/","syllables":"sur-di-mu-tism"},"inflection":{"noun_plural":"surdimutisms"},"usage_notes":{"explanation":"'Surdimutism' は医学的文脈で使用される専門用語であり、日常会話ではあまり一般的ではありません。より一般的で受け入れられている表現は 'deaf-mute' ですが、これも現在ではやや時代遅れと見なされることがあります。聴覚障害と発話障害を持つ人々を指す場合は、個人の好みや状況を考慮し、敬意を払った言葉を選ぶことが重要です。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has surdimutism, so he can't see.","correct":"✓ He has surdimutism, so he can't hear or speak.","note":"Surdimutism は聴覚と発話の障害であり、視覚障害ではありません。"},{"incorrect":"✗ Surdimutism is a mental illness.","correct":"✓ Surdimutism is a physical condition affecting hearing and speech.","note":"Surdimutism は精神疾患ではなく、聴覚と発話に影響を与える身体的な状態です。"}],"priority":"★★☆"},"related_words":{"derivatives":["surdus (ラテン語: 聞こえない)","mutism (緘黙症、発話不能)","deaf (聴覚障害)","mute (口のきけない)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Surdimutism' is a technical term referring to the condition of being both deaf and mute. It is primarily used in medical or educational contexts when discussing individuals who have both hearing and speech impairments. Due to its specialized nature, it is not commonly used in everyday language. When communicating with or about individuals with this condition, it is important to use respectful and person-first language, such as 'a person with hearing and speech impairments,' rather than relying solely on the term 'surdimutism.'"},"example_sentences":[{"sentence":"The study focused on the challenges faced by individuals with congenital surdimutism.","translation":"その研究は、先天性聾唖の個人が直面する課題に焦点を当てました。","type":"noun","meaning_category":"聾唖"},{"sentence":"Specialized educational programs are designed to support children with surdimutism in developing communication skills.","translation":"特別な教育プログラムは、聾唖の子供たちがコミュニケーションスキルを開発するのを支援するように設計されています。","type":"noun","meaning_category":"聾唖"}]}