{"word":"faro","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史的な) ファロ (カードゲーム)","english_definition":"A gambling card game, now obsolete, played with a dealing box from which players drew cards.","examples":[{"sentence":"Faro was a popular card game in the American West during the 19th century.","translation":"ファロは19世紀のアメリカ西部で人気のあるカードゲームでした。"},{"sentence":"Many saloons offered faro as a game of chance.","translation":"多くの酒場が運試しのゲームとしてファロを提供していました。"}],"collocations":["play faro","faro dealer","faro table"],"synonyms":["pharaoh (misspelling)"],"antonyms":[],"related_terms":["poker","blackjack","gambling"]},{"part_of_speech":"noun","definition":"(地名) ファロ (ポルトガルの都市)","english_definition":"A city and municipality in Portugal, the capital of the Algarve region.","examples":[{"sentence":"Faro is a popular tourist destination in the Algarve.","translation":"ファロはアルガルヴェ地方で人気の観光地です。"},{"sentence":"The airport in Faro serves the entire Algarve region.","translation":"ファロの空港はアルガルヴェ地方全体をカバーしています。"}],"collocations":["Faro Airport","Algarve region","city of Faro"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The card game is believed to be named after the Egyptian pharaohs, possibly due to a decorative motif on early playing cards. The city's etymology is uncertain, with possible roots in Arabic or pre-Roman languages.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɛəroʊ/","syllables":"Fa-ro"},"inflection":{"notes":"Plural: faros (both meanings)"},"usage_notes":{"explanation":"The word \"faro\" has two distinct meanings: a historical card game and a city in Portugal. Context is crucial to determine the intended meaning. The card game is relatively obscure today, so the city is the more common usage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to play pharaoh tonight.","correct":"✓ I'm going to play faro tonight.","note":"\"Pharaoh\" refers to the ancient Egyptian rulers, while \"faro\" is the card game."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["gambling","card game","Algarve","Portugal"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency (card game), Moderate frequency (city)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Faro\" is a word with two main meanings: a card game and a city. The card game \"faro\" was popular in the past, especially in the American Old West, but is now rarely played. The city of Faro is the capital of the Algarve region in Portugal and is a popular tourist destination. When you see the word \"faro,\" you need to use the context to understand whether it refers to the card game or the city."},"example_sentences":[{"sentence":"He lost a lot of money playing faro at the saloon.","translation":"彼は酒場でファロをして大金を失った。","type":"noun","meaning_category":"card game"},{"sentence":"We are flying to Faro for our summer vacation.","translation":"私たちは夏の休暇でファロへ飛びます。","type":"noun","meaning_category":"city"}]}