{"word":"nonobsession","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"執着しないこと、無執着、特定の考えや感情に囚われない状態","english_definition":"The state of not being obsessed; freedom from obsessive thoughts or feelings.","examples":[{"sentence":"Practicing mindfulness can help cultivate nonobsession with negative thoughts.","translation":"マインドフルネスを実践することで、否定的な考えに執着しない状態を養うことができます。"},{"sentence":"His nonobsession with material possessions made him content with a simple life.","translation":"物質的な所有に執着しないことで、彼は質素な生活に満足していました。"},{"sentence":"The therapist encouraged nonobsession as a way to manage anxiety.","translation":"セラピストは、不安を管理する方法として、執着しないことを勧めました。"}],"collocations":["cultivate nonobsession (無執着を養う)","practice nonobsession (無執着を実践する)","achieve nonobsession (無執着を達成する)","promote nonobsession (無執着を促進する)"],"synonyms":["detachment","non-attachment","equanimity","indifference","disinterest","freedom from obsession"],"antonyms":["obsession","fixation","preoccupation","compulsion"]}],"etymology":{"value":"\"non-\" (否定の接頭辞) + \"obsession\" (執着) から構成される。","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnəbˈsɛʃən/","syllables":"non-ob-ses-sion"},"inflection":{"noun_plural":"nonobsessions"},"usage_notes":{"explanation":"\"Nonobsession\" は、特定の思考、感情、または対象に対する過度な執着や囚われがない状態を指します。これは、精神的な健康や幸福を促進するために意図的に追求されることがあります。仏教の教えにおける「無執着」の概念と関連しています。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a nonobsession for collecting stamps.","correct":"✓ He has a nonobsession with material things.","note":"\"nonobsession for\" ではなく、対象が物事の場合は \"nonobsession with\" を使うのが一般的です。"},{"incorrect":"✗ Nonobsession is a bad thing because it means you don't care about anything.","correct":"✓ Nonobsession is not about not caring, but about not being controlled by your thoughts and feelings.","note":"Nonobsession は無関心とは異なり、感情や思考に支配されない状態を指します。"}],"priority":"★★☆"},"related_words":{"derivatives":["nonobsessive (形容詞: 執着的でない)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Nonobsession\" is a relatively uncommon word that describes the state of not being obsessed with something. It implies a mental state of detachment and freedom from compulsive thoughts or feelings. Understanding this word requires a grasp of the concept of \"obsession\" and the ability to recognize the negation implied by the prefix \"non-\". It is often used in discussions of mental health, mindfulness, and philosophical concepts related to detachment and equanimity."},"example_sentences":[{"sentence":"Through meditation, she learned to practice nonobsession with her worries.","translation":"瞑想を通して、彼女は心配事に執着しないことを学びました。","type":"noun","meaning_category":"無執着"},{"sentence":"His nonobsession with fame allowed him to focus on his art.","translation":"名声に執着しないことで、彼は自分の芸術に集中することができました。","type":"noun","meaning_category":"無執着"},{"sentence":"The key to happiness, according to some philosophies, is cultivating nonobsession.","translation":"いくつかの哲学によれば、幸福の鍵は無執着を養うことです。","type":"noun","meaning_category":"無執着"}]}