{"word":"small-mindedly","meanings":[{"part_of_speech":"adverb","definition":"心が狭く、偏狭に、度量が狭く","english_definition":"In a narrow-minded or petty manner; lacking generosity of spirit or breadth of understanding.","examples":[{"sentence":"He acted small-mindedly, refusing to help his neighbor in need.","translation":"彼は心が狭く、困っている隣人を助けるのを拒否した。"},{"sentence":"She criticized her colleague small-mindedly, focusing on minor flaws rather than their overall contribution.","translation":"彼女は同僚を心が狭く批判し、全体の貢献よりも小さな欠点に焦点を当てた。"}],"collocations":["act small-mindedly","behave small-mindedly","criticize small-mindedly","judge small-mindedly"],"synonyms":["narrow-mindedly","petty","mean-spiritedly","ungenerously","illiberally","intolerantly","parochially"],"antonyms":["generously","open-mindedly","liberally","magnanimously","broad-mindedly"]},{"part_of_speech":"adverb","definition":"重要でないこと、些細なことに関心を払いすぎる様子","english_definition":"Excessively concerned with trivial or unimportant matters.","examples":[{"sentence":"The committee debated the issue small-mindedly, focusing on minor details instead of the larger implications.","translation":"委員会はその問題を心が狭く議論し、大きな影響よりも小さな詳細に焦点を当てた。"}],"collocations":["focus small-mindedly","debate small-mindedly","argue small-mindedly"],"synonyms":["pettily","triflingly","frivolously"],"antonyms":["importantly","significantly","substantially"]}],"etymology":{"value":"Derived from the adjective 'small-minded' (having a narrow or petty mind) combined with the adverbial suffix '-ly'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌsmɔːlˈmaɪndɪdli/","syllables":"small-mind-ed-ly"},"inflection":{"notes":"Adverb - no inflection"},"usage_notes":{"explanation":"'Small-mindedly' describes actions or behaviors that are characterized by a lack of generosity, understanding, or a focus on trivial matters. It implies a limited perspective and an unwillingness to consider broader implications or alternative viewpoints. It is often used to criticize someone's actions or attitudes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He small-minded the issue.","correct":"He addressed the issue small-mindedly.","note":"'Small-mindedly' is an adverb and should modify a verb, not be used as a verb itself."},{"incorrect":"She is a small-mindedly person.","correct":"She is a small-minded person.","note":"'Small-minded' is an adjective that describes a person; 'small-mindedly' is an adverb that describes how someone acts."}],"priority":"★★★"},"related_words":{"derivatives":["small-minded (adjective)","small-mindedness (noun)"],"phrases":["act in a small-minded way"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The adverb 'small-mindedly' describes actions done in a narrow-minded or petty way. It suggests a lack of generosity, understanding, or concern for important matters, focusing instead on trivial details. It is used to criticize behavior that is considered limited in perspective and lacking in empathy or broad consideration. The word is not commonly used in everyday conversation but appears in more formal or critical contexts."},"example_sentences":[{"sentence":"The manager handled the employee dispute small-mindedly, exacerbating the conflict instead of resolving it.","translation":"マネージャーは従業員間の紛争を心が狭く処理し、解決する代わりに紛争を悪化させた。"},{"sentence":"Instead of focusing on the overall goal, they argued small-mindedly about minor details during the meeting.","translation":"全体的な目標に焦点を当てる代わりに、彼らは会議中に些細な詳細について心が狭く議論した。"}]}