{"word":"ephorship","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"（古代スパルタの）監督官の職、監督官の地位","english_definition":"The office or position of an ephor in ancient Sparta.","examples":[{"sentence":"He aspired to the ephorship to wield more political power.","translation":"彼はより大きな政治権力を行使するために、監督官の地位を熱望した。"},{"sentence":"The powers of the ephorship were considerable in Spartan society.","translation":"監督官の権力は、スパルタ社会において非常に大きかった。"}],"collocations":["hold the ephorship","aspire to the ephorship"],"synonyms":["ephorate","magistracy"],"antonyms":[]}],"etymology":{"value":"Derived from 'ephor', from Greek 'ephoros' (overseer), combined with '-ship' (denoting a state, condition, or office).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛfərʃɪp/","syllables":"e-phor-ship"},"inflection":{"noun_plural":"ephorships"},"usage_notes":{"explanation":"'Ephorship' refers specifically to the position held by an ephor in ancient Sparta. An ephor was one of a group of five magistrates elected annually who held significant power, including overseeing the kings and the assembly. The term is rarely used outside of historical contexts related to ancient Sparta.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He applied for the ephorship in Athens.","correct":"✓ He applied for a magistracy in Athens.","note":"The ephorship was a Spartan institution, not Athenian. Use 'magistracy' for general positions in other ancient Greek city-states."}],"priority":"★★☆"},"related_words":{"derivatives":["ephor","ephoral"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'ephorship' is a specialized term related to ancient Spartan history and political structure. It is unlikely to be encountered outside of academic or historical contexts. Understanding requires knowledge of ancient Greek history, particularly the role of ephors in Spartan society."},"example_sentences":[{"sentence":"The ephorship was a powerful check on the power of the Spartan kings.","translation":"監督官の地位は、スパルタ王の権力に対する強力な抑制力となった。","type":"noun","meaning_category":"position of an ephor"},{"sentence":"The annual election to the ephorship was a critical event in Spartan politics.","translation":"監督官への毎年の選挙は、スパルタの政治において重要な出来事であった。","type":"noun","meaning_category":"position of an ephor"}]}