{"word":"inflation-tolerant","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"インフレに強い、インフレの影響を受けにくい","english_definition":"Able to maintain its value or purchasing power during periods of inflation.","examples":[{"sentence":"Real estate is often considered an inflation-tolerant asset.","translation":"不動産はしばしばインフレに強い資産とみなされます。"},{"sentence":"Certain commodities are more inflation-tolerant than others.","translation":"特定のコモディティは他のものよりもインフレに強いです。"},{"sentence":"The company's pricing strategy is designed to be inflation-tolerant.","translation":"その会社の価格戦略は、インフレに耐えられるように設計されています。"}],"collocations":["inflation-tolerant asset","inflation-tolerant investment","inflation-tolerant strategy"],"synonyms":["inflation-resistant","inflation-proof","hedge against inflation"],"antonyms":["inflation-sensitive","vulnerable to inflation"]}],"etymology":{"value":"The term is formed by combining 'inflation' (a general increase in prices and fall in the purchasing value of money) with 'tolerant' (able to endure or withstand something).","priority":"★★★"},"pronunciation":{"ipa":"/ɪnˈfleɪʃən ˌtɒlərənt/","syllables":"in-fla-tion-tol-er-ant"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Inflation-tolerant' is used to describe assets, investments, or strategies that are expected to maintain their value or perform well even when the general price level in an economy is rising. These items are seen as a hedge against the erosion of purchasing power caused by inflation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The inflation-tolerant of gold is well-known.","correct":"✓ The inflation-tolerance of gold is well-known.","note":"'Inflation-tolerant' is an adjective, so it should be used to describe a noun. The noun form is 'inflation-tolerance'."},{"incorrect":"✗ This stock is very inflation-tolerant, so it will always go up.","correct":"✓ This stock is considered inflation-tolerant, but its performance can still be affected by other economic factors.","note":"While an asset might be considered inflation-tolerant, it doesn't guarantee that its value will always increase. Other economic factors can still influence its performance."}],"priority":"★★☆"},"related_words":{"derivatives":["inflation","tolerance","inflation-tolerance"],"phrases":["hedge against inflation","inflation rate","purchasing power"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. More common in financial and economic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Inflation-tolerant' describes something that doesn't lose value easily when prices go up in general (inflation). It's like saying something is 'resistant' to inflation. This term is often used when talking about investments or assets that can hold their value or even increase in value during inflationary periods. It's a term mainly used in economics and finance."},"example_sentences":[{"sentence":"Gold is often seen as an **inflation-tolerant** investment because its value tends to rise during periods of high inflation.","translation":"金は、インフレ率が高い時期に価値が上昇する傾向があるため、インフレに強い投資と見なされることが多いです。","type":"adjective","meaning_category":"インフレに強い"},{"sentence":"The company adopted an **inflation-tolerant** pricing strategy to maintain profitability.","translation":"その会社は、収益性を維持するために、インフレに強い価格戦略を採用しました。","type":"adjective","meaning_category":"インフレに強い"},{"sentence":"Investing in **inflation-tolerant** assets can help protect your savings from losing value.","translation":"インフレに強い資産に投資することで、貯蓄の価値が失われるのを防ぐことができます。","type":"adjective","meaning_category":"インフレに強い"}]}