{"word":"inkhornism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(軽蔑的に) 文学作品や会話で、不必要に難解で衒学的な言葉や表現を使うこと。特に、外国語（主にラテン語やギリシャ語）から借用した、一般には理解されない言葉を使うこと。","english_definition":"(derogatory) The use of unnecessarily learned or obscure words or expressions, especially those recently borrowed from foreign languages (chiefly Latin or Greek), in literary works or conversation.","examples":[{"sentence":"His writing was criticized for its excessive inkhornism, making it difficult for the average reader to understand.","translation":"彼の文章は過度なインク壺語の使用で批判され、一般の読者には理解しにくいものになっていた。"},{"sentence":"The professor's lecture was filled with inkhornisms, leaving many students confused.","translation":"教授の講義はインク壺語で溢れており、多くの学生を混乱させた。"}],"collocations":["pedantic language","bombastic language","highfalutin language","affected language","artificial language"],"synonyms":["sesquipedalianism","pedantry","grandiloquence","bombast","pompousness"],"antonyms":["plain language","simple language","vernacular","colloquialism"]}],"etymology":{"value":"16世紀後半に作られた言葉で、「inkhorn」（インク壺）と「-ism」（主義、傾向）の組み合わせ。当時の知識人や作家が、インク壺を使って学術的な言葉を書き連ねる様子を揶揄した。インク壺は、学問や文学の象徴であった。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɪŋkˌhɔːrnɪzəm/","syllables":"ink-horn-i-zuhm"},"inflection":{"noun_plural":"inkhornisms"},"usage_notes":{"explanation":"「**inkhornism**」は、学識をひけらかすために、わざと難解な言葉を使うことを非難する際に用いられる軽蔑的な言葉です。特に、当時隆盛していたラテン語やギリシャ語からの借用語を多用する傾向を指していました。現代では、特定の分野の専門用語を一般の人が理解できない文脈で使う場合などにも、比喩的に用いられることがあります。ただし、現代英語ではあまり一般的な言葉ではありません。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The inkhornism of the painting was impressive.","correct":"✓ The pedantry of the lecture was irritating.","note":"「inkhornism」は言葉遣いに対して使われる言葉であり、絵画などの芸術作品には適用されません。絵画の難解さや衒学的な要素を批判するなら、「pedantry」（衒学）のような言葉がより適切です。"},{"incorrect":"✗ He used inkhornism to simplify the explanation.","correct":"✓ He used jargon to simplify the explanation.","note":"「inkhornism」は難解な言葉を使うことを指し、説明を簡単にする目的とは逆です。特定の分野の専門用語を使って説明を簡単にする場合は、「jargon」（専門用語）のような言葉を使う方が適切です。"}],"priority":"★★☆"},"related_words":{"derivatives":["inkhorn (名詞: インク壺；衒学的な言葉を使う人)"],"related_terms":["neologism (新語)","archaism (古語)","jargon (専門用語)","pedantic (衒学的な)","sesquipedalian (長ったらしい言葉を使う)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (非常にまれな語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 現代英語ではほとんど使われない。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**inkhornism**」は、あまり一般的ではない言葉で、特に文学や言語学の分野で使われます。これは、誰かが文章や会話の中で、わざと難しくて普通の人には理解できないような言葉を使うことを批判的に言うときに使われます。昔の英語で、ラテン語やギリシャ語から新しく入ってきた言葉を使いすぎることを批判するために使われていました。現代では、特定の分野の専門用語を一般の人が理解できない状況で使うことを指すこともありますが、日常会話ではほとんど使われません。"},"example_sentences":[{"sentence":"The essay was marred by the author's excessive use of inkhornism, making it inaccessible to most readers.","translation":"そのエッセイは、著者の過度なインク壺語の使用によって損なわれ、ほとんどの読者にとって理解不能なものになっていた。","type":"noun","meaning_category":"衒学的な言葉遣い"},{"sentence":"Some critics accused Shakespeare of inkhornism, pointing to his use of newly coined Latinate words.","translation":"一部の批評家はシェイクスピアをインク壺語の使用で非難し、彼が新しく作ったラテン語起源の言葉を使ったことを指摘した。","type":"noun","meaning_category":"衒学的な言葉遣い"},{"sentence":"While a certain amount of technical vocabulary is necessary in scientific writing, excessive inkhornism should be avoided.","translation":"科学的な文章ではある程度の専門用語は必要だが、過度なインク壺語の使用は避けるべきである。","type":"noun","meaning_category":"衒学的な言葉遣い"}]}