{"word":"hysterometry","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"子宮計測（法）","english_definition":"The measurement of the uterus, especially of the length of the uterine cavity.","examples":[{"sentence":"Hysterometry is performed to determine the depth of the uterus before inserting an IUD.","translation":"子宮内避妊具を挿入する前に、子宮の深さを決定するために子宮計測が行われる。"},{"sentence":"The hysterometry reading was 8 cm.","translation":"子宮計測の測定値は8cmだった。"}],"collocations":["perform hysterometry","hysterometry reading"],"synonyms":["uterine sounding"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'hystera' (uterus) and 'metron' (measure).","priority":"★★★"},"pronunciation":{"ipa":"/ˌhɪstəˈrɒmətri/","syllables":"his-ter-o-me-try"},"inflection":{"noun_plural":"hysterometries"},"usage_notes":{"explanation":"Hysterometry is a medical procedure used to measure the length of the uterine cavity. It is often performed before procedures such as IUD insertion, endometrial biopsy, or hysteroscopy. The measurement helps to prevent perforation of the uterus during these procedures.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Hysterometry is used to treat uterine fibroids.","correct":"✓ Hysterometry is used to measure the uterine cavity before treating uterine fibroids.","note":"Hysterometry is a diagnostic procedure, not a treatment. It is used to obtain measurements before other procedures."}],"priority":"★★☆"},"related_words":{"derivatives":["hysterometer (noun): instrument used for measuring the uterus)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Hysterometry is a specialized medical term. Understanding requires knowledge of medical terminology related to gynecology. The term is not commonly used outside of medical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor performed a hysterometry to assess the size and shape of the uterus.","translation":"医師は子宮の大きさと形状を評価するために子宮計測を行った。","type":"general","meaning_category":"measurement"},{"sentence":"Hysterometry is an important step before inserting an intrauterine device.","translation":"子宮計測は子宮内避妊具を挿入する前の重要なステップである。","type":"medical procedure","meaning_category":"procedure"}]}