{"word":"relodge","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"再び宿泊させる、別の場所に宿泊させる","english_definition":"to provide someone with accommodation again, or to provide someone with accommodation in a different place.","examples":[{"sentence":"The charity helped to relodge the families displaced by the flood.","translation":"その慈善団体は、洪水で家を失った家族を再び宿泊させるのを支援した。"},{"sentence":"After the fire, the hotel relodged its guests in a nearby resort.","translation":"火災の後、ホテルは宿泊客を近くのリゾートに宿泊させた。"}],"collocations":["relodge someone","relodge families","relodge guests"],"synonyms":["rehouse","accommodate","house","shelter"],"antonyms":["evict","dislodge"]},{"part_of_speech":"verb","transitivity":"vi","definition":"再び宿泊する、別の場所に宿泊する","english_definition":"to find accommodation again, or to find accommodation in a different place.","examples":[{"sentence":"They had to relodge after their apartment building was condemned.","translation":"彼らはアパートが立ち入り禁止になった後、別の場所に宿泊しなければならなかった。"}],"collocations":["relodge somewhere","relodge temporarily"],"synonyms":["find new accommodation","find new housing"],"antonyms":["become homeless"]}],"etymology":{"value":"接頭辞 \"re-\" (再び) + \"lodge\" (宿泊させる)。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˈlɒdʒ/","syllables":"re-lodge"},"inflection":{"verb_forms":{"present_simple":["relodge","relodges"],"past_simple":"relodged","past_participle":"relodged","present_participle":"relodging"}},"usage_notes":{"explanation":"\"Relodge\" typically implies a temporary or emergency situation where someone needs to be provided with or find alternative accommodation. It is often used in the context of disasters, displacement, or temporary housing arrangements.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ We need to relodge the information in the database.","correct":"✓ We need to re-enter/update the information in the database.","note":"\"Relodge\" is primarily used for providing physical accommodation, not for data or information."}],"priority":"★★☆"},"related_words":{"derivatives":["lodging","lodger","rehousing"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Relodge\" means to provide someone with a new place to stay, often after they have been displaced or lost their original accommodation. It's not a very common word and is usually used in formal or official contexts, such as when discussing disaster relief or housing assistance programs. The word implies a temporary or emergency situation where someone needs immediate housing. It's important to distinguish it from simply \"lodging\" someone, as \"relodge\" specifically refers to finding new accommodation after a displacement."},"example_sentences":[{"sentence":"The government is working to relodge all the refugees in safe housing.","translation":"政府はすべての難民を安全な住宅に再び宿泊させるために取り組んでいる。","type":"verb","meaning_category":"再び宿泊させる"},{"sentence":"Many families had to relodge with relatives after the hurricane.","translation":"多くの家族がハリケーンの後、親戚の家に宿泊しなければならなかった。","type":"verb","meaning_category":"再び宿泊する"}]}