{"word":"sporabola","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of curve studied in mathematics, specifically a quartic curve defined by an equation of the form (x^2 + y^2)^2 = ax^2 + by^2.","english_definition":"A quartic curve defined by the equation (x^2 + y^2)^2 = ax^2 + by^2.","examples":[{"sentence":"The sporabola is a fascinating example of a quartic curve.","translation":"スポラボラは、4次曲線の魅力的な例です。"},{"sentence":"Different values of 'a' and 'b' in the equation of a sporabola result in different shapes.","translation":"スポラボラの式における 'a' と 'b' の異なる値は、異なる形状をもたらします。"}],"collocations":["quartic curve","mathematical curve","equation of a sporabola"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term 'sporabola' is likely derived from a combination of 'spora' (referring to a seed or origin) and 'bola' (referring to a ball or curve), suggesting its curved shape originating from a central point.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌspɔːrˈæbələ/","syllables":"spo-ra-bo-la"},"inflection":{"noun_plural":"sporabolas"},"usage_notes":{"explanation":"The term 'sporabola' is primarily used in mathematical contexts, specifically within the study of algebraic curves. It is not a commonly used term outside of specialized fields of mathematics.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"related_terms":["quartic curve","algebraic curve","lemniscate"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Specialized mathematical term)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'sporabola' is a highly specialized mathematical term referring to a specific type of quartic curve. Understanding its meaning requires familiarity with algebraic geometry and curve equations. It is unlikely to be encountered outside of advanced mathematical texts or discussions."},"example_sentences":[{"sentence":"The shape of the sporabola changes significantly as the parameters in its defining equation are varied.","translation":"スポラボラの形状は、その定義方程式のパラメータが変化すると大幅に変化します。","type":"noun","meaning_category":"mathematical curve"},{"sentence":"Researchers are studying the properties of sporabolas to better understand the broader class of quartic curves.","translation":"研究者たちは、4次曲線のより広いクラスをより良く理解するために、スポラボラの特性を研究しています。","type":"noun","meaning_category":"mathematical curve"}]}