{"word":"Cytophysics","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"細胞物理学：細胞の物理的特性と挙動の研究","english_definition":"The study of the physical properties and behavior of cells.","examples":[{"sentence":"Cytophysics combines principles of physics with cell biology.","translation":"細胞物理学は物理学の原理と細胞生物学を組み合わせたものです。"},{"sentence":"Advances in cytophysics are leading to new insights into cell mechanics.","translation":"細胞物理学の進歩は、細胞力学に関する新たな洞察につながっています。"}],"collocations":["cell mechanics","physical properties of cells","cell behavior","biophysics","mechanobiology"],"synonyms":["cell biophysics","mechanobiology"],"antonyms":[]}],"etymology":{"value":"The word \"cytophysics\" is derived from the Greek words \"cyto-\" meaning \"cell\" and \"physics\" referring to the science of matter and energy and their interactions.","priority":"★★★"},"pronunciation":{"ipa":"/ˌsaɪtoʊˈfɪzɪks/","syllables":"cy-to-phys-ics"},"inflection":{"noun_plural":"cytophysics (uncountable)"},"usage_notes":{"explanation":"Cytophysics is an interdisciplinary field that applies principles and techniques from physics to study the structure, function, and behavior of cells. It focuses on understanding the physical forces, mechanical properties, and energy transformations that govern cellular processes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Cytophysics are an important field.","correct":"✓ Cytophysics is an important field.","note":"Cytophysics is generally treated as a singular, uncountable noun, even though it ends in 's'."}],"priority":"★★☆"},"related_words":{"derivatives":["cytophysicist (noun): A scientist who studies cytophysics."],"related_fields":["biophysics","cell biology","mechanobiology","bioengineering"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Cytophysics is a specialized term used in the context of scientific research, particularly in biophysics and cell biology. It refers to the application of physical principles to the study of cells, including their mechanical properties and behavior. This term is more likely to be encountered in academic or research settings. "},"example_sentences":[{"sentence":"Cytophysics uses advanced microscopy techniques to visualize cellular structures.","translation":"細胞物理学は、高度な顕微鏡技術を使用して細胞構造を可視化します。","type":"general","meaning_category":"study of cell properties"},{"sentence":"Researchers in cytophysics are developing new methods to measure cell stiffness.","translation":"細胞物理学の研究者は、細胞の硬さを測定するための新しい方法を開発しています。","type":"research","meaning_category":"research and development"}]}