{"word":"preabdomen","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(昆虫学)前腹部：昆虫の腹部の前方の部分。特に膜翅目（ハチ、アリなど）において、腹部が強くくびれている部分より前の部分を指す。","english_definition":"(Entomology) The anterior part of the abdomen of an insect, especially in Hymenoptera (bees, ants, etc.), the part before the constricted waist.","examples":[{"sentence":"The preabdomen of the ant is connected to the thorax by a narrow petiole.","translation":"アリの前腹部は細い腹柄によって胸部と繋がっている。"},{"sentence":"The segments of the preabdomen are often more heavily sclerotized than those of the petiole or postabdomen.","translation":"前腹部の体節は、腹柄や後腹部の体節よりも硬化していることが多い。"}],"collocations":["preabdomen segment","preabdomen sclerite"],"synonyms":["anterior abdomen"],"antonyms":["postabdomen"],"notes":"The term is most commonly used in the context of Hymenoptera, but can be applied to other insects where a clear division of the abdomen exists.","images":["https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Ant_anatomy.svg/500px-Ant_anatomy.svg.png"]}],"etymology":{"value":"Derived from the prefix 'pre-' (before) and 'abdomen'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːˈæbdəmən/","syllables":"pre-ab-do-men"},"inflection":{"noun_plural":"pre abdomens"},"usage_notes":{"explanation":"The term 'preabdomen' is a technical term used in entomology to describe a specific region of the insect abdomen. It is most relevant when discussing insects with a constricted waist, such as ants and bees, where the abdomen is clearly divided into distinct sections.","priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["abdomen","thorax","petiole","postabdomen","gaster"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - technical term used in entomology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Preabdomen' is a specialized term in entomology, specifically referring to the anterior portion of an insect's abdomen, particularly when there's a distinct constriction or division in the abdomen, as seen in ants and bees. Understanding this term requires familiarity with basic insect anatomy. It's not a word used in general conversation."},"example_sentences":[{"sentence":"The morphology of the preabdomen is a key characteristic in identifying different species of ants.","translation":"前腹部の形態は、アリの異なる種を識別するための重要な特徴である。","type":"noun","meaning_category":"Anterior part of insect abdomen"},{"sentence":"The venom gland is located within the preabdomen of the worker bee.","translation":"毒腺は働き蜂の前腹部に位置している。","type":"noun","meaning_category":"Anterior part of insect abdomen"}]}