{"word":"succession-related","priority":"3","meanings":[{"part_of_speech":"adjective","definition":"relating to the process or issues involved in the transfer of power, property, or a title from one person to another, especially after a death or departure.","english_definition":"connected with or concerning the sequence in which one person after another succeeds to a title, throne, estate, or office.","examples":[{"sentence":"The company faced several succession-related challenges after the CEO's retirement.","translation":"CEOの退任後、会社は後継に関するいくつかの課題に直面した。"},{"sentence":"Succession-related laws vary significantly from country to country.","translation":"相続関連の法律は国によって大きく異なる。"},{"sentence":"The family discussed succession-related matters during the estate planning meeting.","translation":"家族は遺産計画会議で相続関連事項について話し合った。"}],"collocations":["succession-related planning","succession-related issues","succession-related laws","succession-related disputes","succession-related documents"],"synonyms":["inheritance-related","hereditary","genealogical","lineal","sequential"],"antonyms":[]}],"etymology":{"value":"Derived from the noun 'succession' (the act or process of succeeding to a position, title, etc.) and the adjective 'related' (connected or associated).","priority":"2"},"pronunciation":{"ipa":"/səkˈsɛʃən rɪˌleɪtɪd/","syllables":"suc-ces-sion re-lat-ed"},"inflection":{"notes":"This is an adjective and does not have different forms."},"usage_notes":{"explanation":"The term 'succession-related' is commonly used in legal, business, and genealogical contexts to describe matters pertaining to the transfer of rights, responsibilities, or assets. It often implies a formal or structured process.","priority":"3"},"common_mistakes":{"examples":[{"incorrect":"succession related","correct":"succession-related","note":"The hyphen is important to show that 'succession' and 'related' are acting as a single adjective modifying a noun."}],"priority":"2"},"related_words":{"derivatives":["succession","successor","related"],"phrases":["succession planning","line of succession"],"priority":"3"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"1"},"readability_explanation":{"level":"C1","text":"The term 'succession-related' is a specialized term often used in formal contexts such as law, business, and genealogy. It refers to anything connected to the process of one person taking over from another, usually in a position of authority or ownership. Understanding this term requires familiarity with the concept of succession itself."},"example_sentences":[{"sentence":"The lawyer specialized in succession-related litigation.","translation":"弁護士は相続関連訴訟を専門としていた。","type":"adjective","meaning_category":"legal"},{"sentence":"The company implemented a new succession-related policy to ensure a smooth transition of leadership.","translation":"会社はリーダーシップの円滑な移行を確実にするため、新しい後継関連ポリシーを実施した。","type":"adjective","meaning_category":"business"},{"sentence":"The historian studied succession-related documents to understand the transfer of power in the dynasty.","translation":"歴史家は王朝における権力の移行を理解するために、相続関連文書を研究した。","type":"adjective","meaning_category":"historical"}]}