{"word":"Homocerebrin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A neuropeptide found in the human brain, specifically in cerebrospinal fluid.","english_definition":"A neuropeptide found in the human brain, notably in cerebrospinal fluid; it is thought to play a role in neuronal development and function.","examples":[{"sentence":"Homocerebrin levels in cerebrospinal fluid may be indicative of certain neurological conditions.","translation":"脳脊髄液中のホモセレブリンのレベルは、特定の神経学的状態を示す可能性があります。"}],"collocations":["cerebrospinal fluid homocerebrin","homocerebrin concentration","homocerebrin levels"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name is derived from 'homo-' (meaning 'same' or 'similar', referring to its structural similarity to other cerebrins) and 'cerebrin' (referring to its presence in the brain).","priority":"★★★"},"pronunciation":{"ipa":"/ˌhoʊmoʊsəˈriːbrɪn/","syllables":"ho-mo-ce-re-brin"},"inflection":{"noun_plural":"Homocerebrins"},"usage_notes":{"explanation":"Homocerebrin is primarily a scientific term used in the fields of neuroscience and biochemistry. It is not commonly used in everyday language.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["cerebrin","neuropeptide"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Homocerebrin is a highly specialized term used within the scientific community, specifically in neuroscience and biochemistry. Understanding this term requires advanced knowledge of these fields."},"example_sentences":[{"sentence":"Research suggests that homocerebrin plays a crucial role in neuronal growth and differentiation.","translation":"研究によると、ホモセレブリンはニューロンの成長と分化において重要な役割を果たしていることが示唆されています。","type":"scientific","meaning_category":"neuronal function"},{"sentence":"The study measured homocerebrin concentrations in patients with neurodegenerative diseases.","translation":"その研究では、神経変性疾患の患者におけるホモセレブリン濃度を測定しました。","type":"scientific","meaning_category":"biomarker"}]}