{"word":"voidee","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(建築) 建物内部の吹き抜け空間、特に階段室や玄関ホールなどに見られる、上階まで続く開放的な空間。","english_definition":"(architecture) An open space within a building, especially a large one that goes through several floors, such as in a stairwell or entrance hall.","examples":[{"sentence":"The architect designed the building with a central voidee to maximize natural light.","translation":"建築家は、自然光を最大限に取り入れるために、建物の中央に吹き抜け空間を設計しました。"},{"sentence":"The grand voidee in the hotel lobby created a sense of spaciousness and elegance.","translation":"ホテルのロビーにある壮大な吹き抜け空間は、広々とした優雅な雰囲気を作り出していました。"}],"collocations":["central voidee","grand voidee","open voidee","design with a voidee","create a voidee"],"synonyms":["atrium","open well","light well","void","open space"],"antonyms":[]}],"etymology":{"value":"語源は不明。建築用語として比較的新しい言葉。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈvɔɪdiː/","syllables":"voi-dee"},"inflection":{"noun_plural":"voidees"},"usage_notes":{"explanation":"\"voidee\"は、建築設計において、建物の内部空間を垂直方向に繋ぐ開放的な空間を指す専門用語です。特に、自然光の取り込みや、視覚的な広がりを演出するために用いられます。一般的な「吹き抜け」よりも、設計意図や機能性を強調するニュアンスがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The voidee was filled with furniture.","correct":"The voidee was surrounded by furniture.","note":"voideeは開放的な空間なので、家具で埋め尽くされることは通常ありません。家具はvoideeの周囲に配置されることが多いです。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["atrium","mezzanine","balcony","clerestory"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Voidee\" is a technical term used in architecture to describe a large, open space within a building that extends vertically through multiple floors. It's often used to enhance natural lighting and create a sense of spaciousness. While not a common word in everyday conversation, it's important for those involved in architectural design and construction to understand its meaning."},"example_sentences":[{"sentence":"The modern office building features a stunning voidee that connects all the floors.","translation":"その近代的なオフィスビルは、すべてのフロアをつなぐ見事な吹き抜け空間が特徴です。","type":"noun","meaning_category":"吹き抜け空間"},{"sentence":"The architect used the voidee to create a dramatic visual effect in the lobby.","translation":"建築家は、ロビーに劇的な視覚効果を作り出すために、吹き抜け空間を利用しました。","type":"noun","meaning_category":"吹き抜け空間"}]}