{"word":"spending-based","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"支出に基づいた、支出を基準とする","english_definition":"Based on or determined by the amount of money spent.","examples":[{"sentence":"The government is considering a spending-based tax reform.","translation":"政府は支出に基づいた税制改革を検討している。"},{"sentence":"The company's bonus system is spending-based, rewarding employees who generate higher sales.","translation":"その会社のボーナス制度は支出基準であり、より高い売上を上げた従業員に報酬を与える。"},{"sentence":"A spending-based approach to budgeting focuses on prioritizing needs and allocating funds accordingly.","translation":"予算編成への支出基準のアプローチは、ニーズの優先順位付けとそれに応じた資金配分に焦点を当てる。"}],"collocations":["spending-based tax","spending-based budget","spending-based reward system","spending-based analysis"],"synonyms":["expenditure-based","outlay-based"],"antonyms":["income-based","revenue-based"]}],"etymology":{"value":"The term is formed by combining \"spending\" (the act of expending money) with \"based\" (having a specified foundation).","priority":"★★★"},"pronunciation":{"ipa":"/ˈspɛndɪŋˌbeɪst/","syllables":"spend-ing-based"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"\"Spending-based\" is commonly used in economics, finance, and government contexts to describe systems, policies, or analyses that rely on or are influenced by spending patterns or levels. It is often contrasted with \"income-based\" or \"revenue-based\" approaches.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The spending-based is a good idea.","correct":"✓ A spending-based system is a good idea.","note":"\"Spending-based\" is an adjective and needs to modify a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["spending","based"],"related_terms":["spending","expenditure","outlay","budget","consumption"]},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in specialized contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term \"spending-based\" is a compound adjective used in formal contexts, such as economics or policy discussions. It describes something that is determined or influenced by the amount of money spent. Understanding this term requires familiarity with economic and financial concepts."},"example_sentences":[{"sentence":"The proposed economic model is spending-based, assuming that consumer spending drives growth.","translation":"提案された経済モデルは支出に基づいており、消費者の支出が成長を牽引すると仮定している。","type":"general","meaning_category":"general"},{"sentence":"The government implemented a spending-based stimulus package to boost the economy.","translation":"政府は経済を活性化するために、支出に基づいた景気刺激策を実施した。","type":"policy","meaning_category":"policy"},{"sentence":"The analysis is spending-based, focusing on how households allocate their disposable income.","translation":"分析は支出に基づいており、家計が可処分所得をどのように配分するかに焦点を当てている。","type":"analysis","meaning_category":"analysis"}]}