{"word":"SMR","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"小型モジュール炉（Small Modular Reactor）","english_definition":"Small Modular Reactor: A nuclear fission reactor that is smaller than conventional nuclear reactors and manufactured at a plant and shipped to a site for installation.","examples":[{"sentence":"SMRs are expected to play a key role in future energy production.","translation":"SMRは将来のエネルギー生産において重要な役割を果たすと期待されています。"},{"sentence":"The government is investing in the development of SMR technology.","translation":"政府はSMR技術の開発に投資しています。"}],"collocations":["deploy SMRs (SMRを展開する)","develop SMR technology (SMR技術を開発する)","SMR plant (SMRプラント)"],"synonyms":["small nuclear reactor","modular reactor"],"antonyms":["conventional nuclear reactor","large-scale nuclear reactor"]}],"etymology":{"value":"Acronym of Small Modular Reactor","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛsˌɛmˈɑːr/","syllables":"ES-EM-AR"},"inflection":{"notes":"Plural: SMRs"},"usage_notes":{"explanation":"SMR is an acronym for Small Modular Reactor. It refers to a type of nuclear reactor that is smaller than traditional reactors and can be manufactured in a factory and transported to the site. SMRs are considered to be safer, more efficient, and more flexible than conventional nuclear reactors. They are expected to play a significant role in the future of nuclear energy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The SMR are a promising technology.","correct":"✓ SMRs are a promising technology.","note":"SMR is an acronym, and when referring to multiple reactors, the plural form 'SMRs' should be used."},{"incorrect":"✗ SMR is more safe than traditional reactors.","correct":"✓ SMRs are safer than traditional reactors.","note":"When comparing SMRs to traditional reactors in general, use the plural form 'SMRs' to indicate that you are referring to the technology as a whole."}],"priority":"★★☆"},"related_words":{"derivatives":["nuclear","reactor","modular","energy","fission"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low, but increasing due to growing interest in nuclear energy.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"SMR stands for Small Modular Reactor. These are advanced nuclear reactors that are smaller than traditional ones and can be built in factories and shipped to different locations. They are designed to be safer and more efficient, and they are seen as a potential solution for generating clean energy in the future. Because the term is technical, it's typically used in discussions about energy policy, nuclear technology, and environmental sustainability."},"example_sentences":[{"sentence":"The feasibility study examined the potential for deploying **SMRs** in remote communities.","translation":"その実現可能性調査では、遠隔地でのSMRの展開の可能性を検討しました。","type":"noun","meaning_category":"小型モジュール炉"},{"sentence":"**SMR** technology offers a flexible and scalable approach to nuclear power generation.","translation":"SMR技術は、原子力発電に対する柔軟で拡張性のあるアプローチを提供します。","type":"noun","meaning_category":"小型モジュール炉"},{"sentence":"The construction of the first **SMR** plant is expected to begin next year.","translation":"最初のSMRプラントの建設は来年開始される予定です。","type":"noun","meaning_category":"小型モジュール炉"}]}