{"word":"nighttime-affected","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Influenced or impacted by nighttime conditions or events.","english_definition":"Describes something that is influenced, changed, or affected by conditions or events that occur during the night. This could refer to changes in behavior, performance, or physical state due to darkness, temperature, or other factors associated with nighttime.","examples":[{"sentence":"The study focused on nighttime-affected cognitive functions in shift workers.","translation":"その研究は、夜勤労働者の夜間に影響を受ける認知機能に焦点を当てた。"},{"sentence":"Certain plant species exhibit nighttime-affected growth patterns.","translation":"特定の植物種は、夜間に影響を受ける成長パターンを示す。"},{"sentence":"The nighttime-affected visibility made driving dangerous.","translation":"夜間に影響を受ける視界の悪さが運転を危険にした。"}],"collocations":["nighttime-affected behavior","nighttime-affected performance","nighttime-affected visibility","nighttime-affected cognitive function","nighttime-affected sleep patterns"],"synonyms":["night-influenced","night-dependent","night-related","nocturnally-influenced"],"antonyms":["daytime-affected","day-influenced","light-dependent"]},{"part_of_speech":"adjective","definition":"(医学的に)夜間に症状が悪化する、または夜間に特有の症状が現れること。","english_definition":"(Medically) Pertaining to conditions or symptoms that are exacerbated or uniquely present during nighttime.","examples":[{"sentence":"The patient reported nighttime-affected pain that disrupted sleep.","translation":"患者は、睡眠を妨げる夜間に悪化する痛みを訴えた。"},{"sentence":"Asthma can be a nighttime-affected condition for many individuals.","translation":"喘息は、多くの人にとって夜間に症状が悪化する病状となりうる。"},{"sentence":"Nighttime-affected coughing is a common symptom of the illness.","translation":"夜間に影響を受ける咳は、その病気の一般的な症状である。"}],"collocations":["nighttime-affected asthma","nighttime-affected pain","nighttime-affected cough","nighttime-affected symptoms","nighttime-affected breathing"],"synonyms":["nocturnal","nighttime-exacerbated"],"antonyms":["diurnal","daytime-alleviated"]}],"etymology":{"value":"The term is formed by combining 'nighttime' (referring to the period of darkness between sunset and sunrise) with 'affected' (meaning influenced or impacted).","priority":"N/A"},"pronunciation":{"ipa":"/ˈnaɪttaɪm əˈfɛktɪd/","syllables":"night-time a-fec-ted"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Nighttime-affected' is a descriptive adjective used to specify that something is influenced or altered by the conditions or events that occur during the night. It can apply to a wide range of phenomena, including biological processes, environmental conditions, and medical symptoms. In a medical context, it often indicates that a condition worsens or manifests primarily during the night.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nighttime affected the plants.","correct":"✓ The plants were nighttime-affected.","note":"'Nighttime-affected' is an adjective and should be used to describe a noun, not as a verb. Use 'affected by nighttime' or 'nighttime conditions affected the plants' instead."},{"incorrect":"✗ He has nighttime-affected.","correct":"✓ He has a nighttime-affected condition.","note":"'Nighttime-affected' needs to modify a noun. You can't say someone 'has nighttime-affected'; instead, say they have a 'nighttime-affected condition' or 'nighttime-affected symptoms'."}],"priority":"★☆☆"},"related_words":{"derivatives":["nighttime (noun, adjective)","affected (adjective, verb)"],"phrases":["affected by nighttime","influenced by nighttime conditions","nocturnally affected"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - The term is relatively specialized and not commonly used in general conversation.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nighttime-affected' is a compound adjective that describes something that is influenced or changed by conditions or events that occur during the night. It is often used in scientific or medical contexts to describe phenomena that are specific to or exacerbated by nighttime. Understanding the term requires familiarity with both 'nighttime' and 'affected,' and the ability to comprehend how they combine to create a more specific meaning. The term is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The study examined the nighttime-affected melatonin production in elderly patients.","translation":"その研究は、高齢患者における夜間に影響を受けるメラトニンの産生を調査した。","type":"adjective","meaning_category":"Medical/Scientific"},{"sentence":"The nighttime-affected migration patterns of the birds were tracked using radar.","translation":"その鳥の夜間に影響を受ける渡りのパターンは、レーダーを使って追跡された。","type":"adjective","meaning_category":"Biological/Environmental"},{"sentence":"The nighttime-affected symptoms of restless legs syndrome can significantly disrupt sleep.","translation":"むずむず脚症候群の夜間に影響を受ける症状は、睡眠を著しく妨げることがある。","type":"adjective","meaning_category":"Medical"},{"sentence":"The nighttime-affected reduction in temperature can cause frost damage to crops.","translation":"夜間に影響を受ける気温の低下は、作物に霜害を引き起こす可能性がある。","type":"adjective","meaning_category":"Environmental"}]}