{"word":"reprography","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"複製技術、複写術","english_definition":"the reproduction of graphic material by any means, including photocopying, photography, and printing.","examples":[{"sentence":"Reprography is essential for document management in large organizations.","translation":"複製技術は、大規模な組織における文書管理に不可欠です。"},{"sentence":"The reprography department handles all the copying and printing needs of the company.","translation":"複製部は、会社のすべてのコピーおよび印刷ニーズを処理します。"}],"collocations":["digital reprography","reprography services","reprography department","copyright and reprography"],"synonyms":["copying","photocopying","duplication","printing","imaging"],"antonyms":[]}],"etymology":{"value":"Derived from 'repro' (short for reproduction) + '-graphy' (denoting a process of writing or recording).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːprɒˈɡræfi/","syllables":"re-pro-gra-phy"},"inflection":{"noun_plural":"reprographies (rarely used)"},"usage_notes":{"explanation":"Reprography refers to the process of reproducing documents and other graphic materials. It encompasses various methods, including traditional photocopying, digital printing, and other imaging techniques. The term is often used in professional contexts, such as in libraries, archives, and businesses that require extensive document management.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Reprography is only photocopying.","correct":"✓ Reprography includes photocopying, but also other methods like digital printing.","note":"Reprography is a broader term than just photocopying; it includes various reproduction methods."}],"priority":"★☆☆"},"related_words":{"derivatives":["reprographic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Reprography' is a technical term referring to the various methods used to reproduce documents and graphic materials. It is commonly used in professional contexts such as libraries, archives, and businesses. While photocopying is a type of reprography, the term encompasses a wider range of reproduction techniques, including digital printing and imaging. Understanding this term is useful for those working with document management or reproduction services."},"example_sentences":[{"sentence":"The library offers a range of reprography services, including scanning and printing.","translation":"図書館では、スキャンや印刷など、さまざまな複製サービスを提供しています。","type":"noun","meaning_category":"複製技術"},{"sentence":"Advances in digital reprography have made document sharing easier than ever.","translation":"デジタル複製技術の進歩により、ドキュメントの共有がこれまで以上に容易になりました。","type":"noun","meaning_category":"複製技術"}]}