{"language":"Urdu","native_name":"اُردُو‎","iso_639_1":"ur","iso_639_2":"urd","family":"Indo-European, Indo-Iranian, Indo-Aryan","script":"Perso-Arabic","speakers":"Approximately 70 million native speakers; 100+ million including second-language speakers (estimates vary widely)","regions":"Pakistan (national language), India (scheduled language), significant diaspora communities worldwide","description":"Urdu is an Indo-Aryan language closely related to Hindi. It is the national language of Pakistan and an officially recognized language in India. While Hindi and Urdu share a common colloquial base (often referred to as Hindustani), they differ in their literary and formal vocabulary. Urdu draws heavily from Persian and Arabic, while Hindi draws more from Sanskrit. Urdu is typically written in a modified Perso-Arabic script.","key_features":["Uses a modified Perso-Arabic script written from right to left.","Vocabulary heavily influenced by Persian and Arabic.","Phonology includes sounds not found in many other Indo-European languages.","Grammar shares similarities with other Indo-Aryan languages, including Hindi.","Rich literary tradition with a focus on poetry (ghazals, nazms, etc.)."],"sample_phrase":{"phrase":"آپ کیسے ہیں؟","transliteration":"Āp kaise hain?","translation":"How are you?"},"interesting_facts":["Urdu and Hindi are mutually intelligible in their colloquial forms, leading to the term 'Hindustani' to describe their shared spoken base.","Urdu is associated with Muslim culture in the Indian subcontinent, while Hindi is associated with Hindu culture.","Many loanwords from English are commonly used in Urdu.","Urdu poetry is highly regarded and has a long and influential history.","The name 'Urdu' is derived from the Persian word 'ordu' meaning 'army' or 'camp'."],"resources":[{"type":"Online Dictionary","name":"Urdu Dictionary by UrduPoint","url":"https://www.urdupoint.com/dictionary/"},{"type":"Language Learning App","name":"Duolingo (Urdu course)","url":"https://www.duolingo.com/"}]}