{"word":"abortionist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"違法な中絶手術を行う人、堕胎医","english_definition":"a person who performs illegal abortions.","examples":[{"sentence":"The abortionist was arrested for performing illegal operations.","translation":"その堕胎医は違法な手術を行ったとして逮捕された。"}],"collocations":["illegal abortionist","back-alley abortionist"],"synonyms":["quack","illegal practitioner"],"antonyms":["physician","doctor","obstetrician","gynecologist"]},{"part_of_speech":"noun","definition":"中絶を支持する人","english_definition":"a person who advocates or supports abortion rights.","examples":[{"sentence":"She is an abortionist and believes that women should have the right to choose.","translation":"彼女は中絶を支持する人で、女性には選択する権利があるべきだと考えている。"}],"collocations":["pro-choice activist","abortion rights advocate"],"synonyms":["pro-choice advocate","abortion rights supporter"],"antonyms":["anti-abortion activist","pro-life advocate"]}],"etymology":{"value":"'Abortion' + '-ist'.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈbɔːrʃənɪst/","syllables":"a-bor-tion-ist"},"inflection":{"noun_plural":"abortionists"},"usage_notes":{"explanation":"The term 'abortionist' can be controversial. It is often used in a negative context to refer to someone who performs illegal abortions. However, it can also be used neutrally to describe someone who supports abortion rights. The meaning depends heavily on the context and the speaker's point of view.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a good abortionist.","correct":"✓ She is a good doctor who performs abortions.","note":"Using 'abortionist' to describe a doctor who legally performs abortions can be seen as pejorative. It's better to say 'a doctor who performs abortions' or 'an abortion provider'."}],"priority":"★★☆"},"related_words":{"derivatives":["abortion","abortion rights","pro-choice","pro-life"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"abortionist\" is a complex term due to its strong association with the controversial topic of abortion. It can refer to someone who performs illegal abortions, which is viewed negatively, or to someone who supports abortion rights, which is a more neutral or positive connotation depending on one's viewpoint. Because of these conflicting meanings and the sensitive nature of the subject, it's important to understand the context in which the word is used to avoid misinterpretation or causing offense. The term is not commonly used in everyday conversation and is more often found in discussions about political or ethical issues related to abortion.","priority":"★★☆"},"example_sentences":[{"sentence":"The police were searching for the abortionist who had performed the illegal procedure.","translation":"警察は違法な手術を行った堕胎医を捜索していた。","type":"noun","meaning_category":"Illegal practitioner"},{"sentence":"As an abortionist, she dedicated her life to ensuring women had access to safe reproductive healthcare.","translation":"中絶を支持する人として、彼女は女性が安全なリプロダクティブ・ヘルスケアを利用できるように人生を捧げた。","type":"noun","meaning_category":"Abortion rights supporter"}]}