{"word":"downcycling","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ダウンサイクル、質を低下させるリサイクル","english_definition":"The process of recycling materials into new products of lesser quality and reduced functionality.","examples":[{"sentence":"Downcycling is often easier and cheaper than true recycling.","translation":"ダウンサイクルは、真のリサイクルよりも簡単で安価なことが多いです。"},{"sentence":"Many plastics are downcycled into lower-grade products.","translation":"多くのプラスチックは、より低品質の製品にダウンサイクルされます。"},{"sentence":"While downcycling extends the life of a material, it doesn't eliminate waste.","translation":"ダウンサイクルは材料の寿命を延ばしますが、廃棄物をなくすわけではありません。"}],"collocations":["plastic downcycling","paper downcycling","material downcycling","avoid downcycling","promote upcycling"],"synonyms":["inferior recycling","lower-grade recycling"],"antonyms":["upcycling","true recycling","closed-loop recycling"]},{"part_of_speech":"verb","definition":"ダウンサイクルする、質を低下させるリサイクルを行う","english_definition":"To recycle (a material) into a product of lower quality or value.","examples":[{"sentence":"The company downcycles used plastic bottles into park benches.","translation":"その会社は、使用済みのペットボトルを公園のベンチにダウンサイクルしています。"},{"sentence":"Instead of being recycled into new bottles, the plastic is often downcycled.","translation":"新しいボトルにリサイクルされる代わりに、プラスチックはしばしばダウンサイクルされます。"}],"collocations":["downcycle plastic","downcycle paper","downcycle waste"],"synonyms":["recycle to a lower grade"],"antonyms":["upcycle","recycle properly"]}],"etymology":{"value":"Combination of \"down\" (indicating a decrease in quality) and \"cycling\" (referring to the recycling process).","priority":"★★★"},"pronunciation":{"ipa":"/ˈdaʊnsaɪklɪŋ/","syllables":"down-cy-cling"},"inflection":{"noun_plural":"downcyclings","verb_forms":{"present_simple":["downcycle","downcycles"],"past_simple":"downcycled","past_participle":"downcycled","present_participle":"downcycling"}},"usage_notes":{"explanation":"Downcycling refers to the process where recycled materials are transformed into new materials of lesser quality and functionality. This is in contrast to upcycling, where recycled materials are converted into products of higher quality. Downcycling is often criticized because it eventually leads to the material becoming unusable and ending up as waste.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Upcycling is the same as downcycling.","correct":"✓ Upcycling is the opposite of downcycling.","note":"Upcycling increases the value of the recycled material, while downcycling decreases it."},{"incorrect":"✗ Downcycling eliminates waste.","correct":"✓ Downcycling reduces waste, but does not eliminate it.","note":"Downcycling extends the lifespan of materials, but eventually they become unusable."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["recycling","upcycling","waste management","sustainability","circular economy"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but increasing in use due to environmental awareness.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Downcycling' is a term used to describe a type of recycling where old materials are turned into new products that are of lower quality or usefulness. This is different from 'upcycling', where materials are made into something better. Understanding the difference between these two terms is important for discussing environmental issues and waste management. The word is often used in discussions about sustainability and the circular economy."},"example_sentences":[{"sentence":"The paper was downcycled into cardboard.","translation":"その紙は段ボールにダウンサイクルされた。","type":"verb","meaning_category":"質を低下させるリサイクルを行う"},{"sentence":"Downcycling is a common practice in the recycling industry.","translation":"ダウンサイクルはリサイクル業界で一般的な慣行です。","type":"noun","meaning_category":"質を低下させるリサイクル"},{"sentence":"We need to find ways to avoid downcycling and promote upcycling instead.","translation":"ダウンサイクルを避け、代わりにアップサイクルを促進する方法を見つける必要があります。","type":"verb","meaning_category":"質を低下させるリサイクルを行う"},{"sentence":"The environmental impact of downcycling is still significant.","translation":"ダウンサイクルの環境への影響は依然として大きい。","type":"noun","meaning_category":"質を低下させるリサイクル"}]}