{"word":"Ageisms","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"年齢差別（特に高齢者に対する差別）","english_definition":"Prejudice or discrimination on the basis of a person's age, especially against older people.","examples":[{"sentence":"Ageisms in the workplace can prevent older workers from getting hired or promoted.","translation":"職場における年齢差別は、高齢の労働者が採用されたり昇進したりすることを妨げる可能性があります。"},{"sentence":"The media often perpetuates ageisms by portraying older people as frail and incompetent.","translation":"メディアは高齢者を虚弱で無能であるかのように描写することで、年齢差別を助長することがよくあります。"},{"sentence":"We need to challenge ageisms and promote a more inclusive society for people of all ages.","translation":"私たちは年齢差別に対抗し、すべての年齢の人々にとってより包括的な社会を促進する必要があります。"}],"collocations":["combat ageisms (年齢差別と闘う)","challenge ageisms (年齢差別に異議を唱える)","address ageisms (年齢差別に対処する)","overcome ageisms (年齢差別を克服する)","perpetuate ageisms (年齢差別を永続させる)","experience ageisms (年齢差別を経験する)"],"synonyms":["age discrimination","age bias","age prejudice"],"antonyms":["age equality","age inclusivity","age neutrality"]}],"etymology":{"value":"The term 'ageism' was coined in 1969 by Robert Butler to describe discrimination against seniors, paralleling sexism and racism.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈeɪdʒɪzəmz/","syllables":"a-ge-isms"},"inflection":{"noun_plural":"ageisms (already plural)"},"usage_notes":{"explanation":"'Ageisms' refers to the plural form of 'ageism,' indicating multiple instances or manifestations of age discrimination. It is often used to describe systemic or widespread prejudice based on age.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed ageism towards the young employees.","correct":"✓ He showed ageism towards the young employees.","note":"While ageism is often associated with discrimination against older people, it can also apply to discrimination against younger people. The sentence is grammatically correct, but it's important to remember that ageism can affect all age groups."},{"incorrect":"✗ Ageism is a problem, but ageisms are not so common.","correct":"✓ Ageism is a problem, and ageisms are also common.","note":"'Ageism' (singular) refers to the general concept of age discrimination, while 'ageisms' (plural) refers to specific instances or manifestations of it. Both are common problems."}],"priority":"★★☆"},"related_words":{"derivatives":["ageist (adjective: 年齢差別的な; noun: 年齢差別主義者)","ageistic (adjective: 年齢差別的な)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1-C2","frequency_google_ngram":"Relatively low frequency, but increasing in recent years.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ageisms' is a term used to describe various forms of prejudice or discrimination based on age. It's similar to 'sexism' or 'racism,' but focuses on age as the basis for unfair treatment. It's often discussed in the context of employment, healthcare, and social attitudes towards older people, but it can also apply to younger individuals. Understanding 'ageisms' involves recognizing how age-related stereotypes and biases can lead to unequal opportunities and treatment.","priority":"★★★"},"example_sentences":[{"sentence":"The company's hiring practices were criticized for reflecting ageisms.","translation":"その会社の採用慣行は、年齢差別を反映しているとして批判されました。","type":"noun","meaning_category":"年齢差別"},{"sentence":"We need to be aware of our own ageisms and challenge them.","translation":"私たちは自分自身の年齢差別を認識し、それに異議を唱える必要があります。","type":"noun","meaning_category":"年齢差別"},{"sentence":"Ageisms can have a negative impact on the mental and physical health of older adults.","translation":"年齢差別は、高齢者の精神的および身体的健康に悪影響を与える可能性があります。","type":"noun","meaning_category":"年齢差別"}]}