{"word":"paniconography","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The study or interpretation of images and symbols relating to panic or fear.","english_definition":"The study or interpretation of images and symbols relating to panic or fear.","examples":[{"sentence":"The professor specialized in the paniconography of early horror films.","translation":"その教授は初期のホラー映画におけるパニアイコノグラフィーを専門としていた。"},{"sentence":"The artist's work explored the paniconography of contemporary anxieties.","translation":"そのアーティストの作品は、現代の不安のパニアイコノグラフィーを探求した。"}],"collocations":["paniconography of fear","study of paniconography","interpret paniconography"],"synonyms":["iconology of fear","symbolism of panic"],"antonyms":[]}],"etymology":{"value":"Combination of 'panic' (sudden uncontrollable fear or anxiety) and 'iconography' (the visual images and symbols used in a work of art or the study or interpretation of these).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpænɪkɑɪˈnɒɡrəfi/","syllables":"pan-i-co-nog-ra-phy"},"inflection":{"noun_plural":"paniconographies"},"usage_notes":{"explanation":"'Paniconography' is a relatively rare term, primarily used in academic or artistic contexts to describe the analysis of visual representations of panic and fear. It is a specialized field within art history, film studies, and cultural studies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He created a paniconography to scare people.","correct":"✓ He used paniconography to represent fear.","note":"Paniconography is the study or use of images, not the creation of a single image itself."}],"priority":"★★☆"},"related_words":{"derivatives":["panic","iconography","iconology"],"related_terms":["visual culture","semiotics","symbolism","fear studies"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - Specialized academic term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Paniconography' is a specialized term used in academic fields like art history and cultural studies. It refers to the study and interpretation of images and symbols that represent panic or fear. Understanding this term requires familiarity with both 'panic' and 'iconography' as individual concepts. It's not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The exhibition explored the paniconography of war through historical paintings.","translation":"その展覧会は、歴史的な絵画を通して戦争のパニアイコノグラフィーを探求した。","type":"general","meaning_category":"study of fear symbols"},{"sentence":"Her thesis focused on the paniconography of climate change in contemporary art.","translation":"彼女の論文は、現代アートにおける気候変動のパニアイコノグラフィーに焦点を当てていた。","type":"academic","meaning_category":"interpretation of panic images"}]}