{"word":"arrestors","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) アレスタ、避雷器、制動装置","english_definition":"Plural form of 'arrestor': devices designed to protect electrical equipment from voltage surges, or devices used to stop or slow down movement.","examples":[{"sentence":"The building was equipped with surge arrestors to protect the electronic equipment during lightning storms.","translation":"その建物には、雷雨の際に電子機器を保護するためのサージアレスタが装備されていた。"},{"sentence":"These arrestors prevent the conveyor belt from rolling backwards.","translation":"これらの制動装置は、コンベヤーベルトが逆方向に回転するのを防ぐ。"}],"collocations":["surge arrestors (サージアレスタ)","lightning arrestors (避雷器)","flame arrestors (防炎装置)"],"synonyms":["surge protector","limiter","stopper","brake"],"antonyms":[]}],"etymology":{"value":"'Arrestor' is derived from the verb 'arrest,' meaning to stop or seize. The suffix '-or' indicates an agent or device that performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈrɛstərz/","syllables":"uh-res-torz"},"inflection":{"noun_plural":"arrestors"},"usage_notes":{"explanation":"'Arrestors' is the plural form of 'arrestor.' An arrestor is a device designed to stop something, either electrical surges or physical movement. Surge arrestors are used in electrical systems to protect equipment from damage due to voltage spikes. Other types of arrestors are used in mechanical systems to control motion.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The arrestors was installed.","correct":"✓ The arrestors were installed.","note":"'Arrestors' is a plural noun, so it requires a plural verb form ('were')."},{"incorrect":"✗ Use arrestor to protect your computer.","correct":"✓ Use a surge arrestor to protect your computer.","note":"When referring to a specific type of arrestor, it's important to use the correct adjective (e.g., 'surge arrestor')."}],"priority":"★★☆"},"related_words":{"derivatives":["arrest (verb, noun)","arresting (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'arrestors' is a technical term, most commonly used in electrical engineering and mechanical contexts. It refers to devices that stop or limit something, such as voltage surges or motion. Because of its technical nature, it is more likely to be encountered in specialized texts and discussions. Understanding the context is essential to correctly interpret its meaning."},"example_sentences":[{"sentence":"The power plant uses advanced lightning arrestors to prevent damage from electrical storms.","translation":"その発電所は、雷雨による損傷を防ぐために高度な避雷器を使用している。","type":"noun","meaning_category":"避雷器"},{"sentence":"Flame arrestors are essential safety components in gas pipelines.","translation":"防炎装置は、ガスパイプラインにおいて不可欠な安全部品である。","type":"noun","meaning_category":"防炎装置"},{"sentence":"The new braking system incorporates multiple arrestors for enhanced safety.","translation":"新しいブレーキシステムには、安全性を高めるために複数の制動装置が組み込まれている。","type":"noun","meaning_category":"制動装置"}]}