{"word":"unattachable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"取り付けることができない、付着させることができない","english_definition":"Not able to be attached; incapable of being fastened or joined to something else.","examples":[{"sentence":"Due to the unique design, the component was unattachable to the standard mounting bracket.","translation":"独特な設計のため、その部品は標準的な取り付け金具に取り付けることができませんでした。"},{"sentence":"The coating made the surface unattachable, preventing any adhesive from sticking.","translation":"そのコーティングにより表面は付着不可能になり、接着剤が一切付着しなくなりました。"}],"collocations":["unattachable component","unattachable surface","unattachable object"],"synonyms":["non-adhesive","unaffixable","unjoinable"],"antonyms":["attachable","affixable","joinable","fastenable"]}],"etymology":{"value":"The word 'unattachable' is formed by adding the prefix 'un-' (meaning not) to the word 'attachable'. 'Attachable' comes from the verb 'attach', which originates from the Old French word 'atachier' meaning 'to fasten'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnəˈtætʃəbəl/","syllables":"un-at-tach-a-ble"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Unattachable' is used to describe something that cannot be physically connected or joined to something else. This might be due to its design, material, or the presence of a coating that prevents adhesion. It is a relatively uncommon word, typically used in technical or descriptive contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The file is unattachable to the email.","correct":"✓ The file cannot be attached to the email.","note":"While 'unattachable' could technically be used, it's more common and natural to say 'cannot be attached' when referring to digital files. 'Unattachable' is better suited for physical objects."}],"priority":"★★☆"},"related_words":{"derivatives":["attach","attachment","attachable","unattached"],"related_terms":["non-stick","adhesive-resistant","incompatible"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unattachable' is a relatively uncommon and technical term. It is used to describe something that is impossible to attach or connect to something else. Understanding this word requires a knowledge of the base word 'attachable' and the negative prefix 'un-'. It is most likely to be encountered in specialized or technical contexts where the property of being unable to be attached is relevant."},"example_sentences":[{"sentence":"The new Teflon coating made the pan virtually unattachable to food residue.","translation":"新しいテフロン加工により、その鍋にはほとんど食品の残留物が付着しなくなりました。","type":"adjective","meaning_category":"non-adhesive"},{"sentence":"The oddly shaped connector was unattachable to any standard cable.","translation":"その奇妙な形のコネクタは、どの標準ケーブルにも取り付けることができませんでした。","type":"adjective","meaning_category":"incompatible"},{"sentence":"Due to its highly polished surface, the sensor was unattachable using conventional adhesives.","translation":"高度に研磨された表面のため、そのセンサーは従来の接着剤では取り付けることができませんでした。","type":"adjective","meaning_category":"unaffixable"}]}