{"word":"pictorialisation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"絵画化、図解化、視覚化","english_definition":"The act or process of representing something in pictorial form; the creation of a picture or visual representation of something.","examples":[{"sentence":"The pictorialisation of the novel's key scenes helped the audience understand the story better.","translation":"小説の主要な場面の絵画化は、観客が物語をより良く理解するのに役立った。"},{"sentence":"The artist's pictorialisation of the poem was stunning.","translation":"その芸術家による詩の絵画化は見事だった。"},{"sentence":"The report included a pictorialisation of the data to make it more accessible.","translation":"報告書にはデータをよりアクセスしやすくするための図解化が含まれていた。"}],"collocations":["pictorialisation of data (データの図解化)","pictorialisation of a concept (概念の視覚化)","pictorialisation of history (歴史の絵画化)"],"synonyms":["visualization","illustration","representation","depiction","portrayal"],"antonyms":["abstraction","conceptualization"]}],"etymology":{"value":"The word 'pictorialisation' is derived from 'pictorial,' which means 'expressed in pictures,' and the suffix '-isation,' which denotes the act or process of making something into a specified form.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɪkˌtɔːriəlaɪˈzeɪʃən/","syllables":"pic-to-ri-al-i-sa-tion"},"inflection":{"noun_plural":"pictorialisations"},"usage_notes":{"explanation":"'Pictorialisation' refers to the act of representing something in a visual or pictorial form. It is often used in contexts where abstract ideas, data, or complex information are translated into images or illustrations to enhance understanding or engagement. The term emphasizes the process of making something visual.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The pictorialisation was very good, it made the abstract concept very clear.","correct":"✓ The pictorialisation was very good; it made the abstract concept very clear.","note":"A semicolon is used to connect two related independent clauses. Alternatively, two separate sentences could be used."},{"incorrect":"✗ The pictorialisation is more better than the text description.","correct":"✓ The pictorialisation is better than the text description.","note":"'More better' is grammatically incorrect. Use 'better' as it is the comparative form of 'good'."}],"priority":"★★☆"},"related_words":{"derivatives":["pictorial (adjective: relating to or expressed in pictures)","pictorially (adverb: in a pictorial manner)"],"phrasal_verbs":[],"related_concepts":["illustration","graphic design","data visualization","art","photography"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pictorialisation' is a relatively advanced term that refers to the process of representing something in a visual or pictorial form. It is often used in academic or technical contexts when discussing the transformation of abstract concepts or data into visual representations. Understanding this term requires a good grasp of vocabulary related to art, design, and communication."},"example_sentences":[{"sentence":"The museum exhibit featured the pictorialisation of various historical events.","translation":"博物館の展示会では、さまざまな歴史的出来事の絵画化が特集されていました。","type":"general","meaning_category":"絵画化"},{"sentence":"Data scientists used advanced techniques for the pictorialisation of complex datasets.","translation":"データ科学者は、複雑なデータセットの図解化のために高度な技術を使用しました。","type":"technical","meaning_category":"図解化"},{"sentence":"The director aimed for a vivid pictorialisation of the protagonist's inner turmoil.","translation":"監督は、主人公の内面の葛藤の鮮やかな視覚化を目指しました。","type":"artistic","meaning_category":"視覚化"}]}