{"word":"Odiometer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"An instrument for measuring the degree of unpleasantness or disagreeableness of a stimulus, such as a sound or odor.","english_definition":"An instrument used to measure the degree of unpleasantness or disagreeableness of a stimulus.","examples":[{"sentence":"The odiometer was used to quantify the aversiveness of different smells.","translation":"そのオジオメーターは、様々な匂いの嫌悪度を定量化するために使用された。"}],"collocations":["measure with an odiometer","odiometer reading"],"synonyms":["algometer","dolorimeter"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'odio-' (hatred, aversion) and '-meter' (measuring instrument).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊdiˈɒmɪtər/","syllables":"o-di-om-e-ter"},"inflection":{"noun_plural":"odiometers"},"usage_notes":{"explanation":"The term 'odiometer' is relatively rare and primarily used in scientific or research contexts, particularly in fields like psychology, sensory science, and environmental science. It is used to objectively assess subjective experiences of unpleasantness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The audiometer was used to measure the odor.","correct":"✓ The odiometer was used to measure the odor.","note":"An audiometer measures hearing, while an odiometer measures unpleasantness, often related to odors."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'odiometer' is a highly specialized term. It is used to describe a scientific instrument that measures how unpleasant something is, often a smell or sound. Because it is technical, it is not commonly used outside of research or scientific contexts."},"example_sentences":[{"sentence":"Researchers used an odiometer to assess the perceived unpleasantness of various urban noises.","translation":"研究者たちは、様々な都市の騒音に対する認識される不快感を評価するためにオジオメーターを使用した。","type":"noun","meaning_category":"measuring instrument"}]}