{"word":"pill-dispensing","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"錠剤を分配する、錠剤を払い出す","english_definition":"Relating to the act or process of dispensing pills, typically referring to automated or mechanical systems that distribute pills.","examples":[{"sentence":"The hospital uses a pill-dispensing robot to ensure accurate medication delivery.","translation":"その病院では、正確な薬の配達を保証するために、錠剤を分配するロボットを使用しています。"},{"sentence":"The pharmacy installed a new pill-dispensing machine to improve efficiency.","translation":"その薬局は、効率を改善するために新しい錠剤払い出し機を設置しました。"},{"sentence":"The nurse is trained to use the automated pill-dispensing system.","translation":"看護師は、自動化された錠剤分配システムを使用するように訓練されています。"}],"collocations":["pill-dispensing machine","pill-dispensing robot","automated pill-dispensing system","pill-dispensing technology"],"synonyms":["medication-dispensing","drug-dispensing"],"antonyms":[]}],"etymology":{"value":"The term is formed by combining 'pill' (a small tablet of medicine) with 'dispensing' (the act of distributing or providing something). The compound describes systems or devices designed to distribute pills.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɪl dɪˈspɛnsɪŋ/","syllables":"pill-dis-pens-ing"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb or noun."},"usage_notes":{"explanation":"'Pill-dispensing' is commonly used to describe automated systems or machines that distribute pills, especially in healthcare settings like hospitals and pharmacies. It emphasizes the function of these systems in providing the correct medication to patients efficiently and accurately.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The pill-dispensing is very efficient.","correct":"✓ The pill-dispensing system is very efficient.","note":"'Pill-dispensing' is an adjective and needs to modify a noun. Using it as a noun is incorrect."},{"incorrect":"✗ He is a pill-dispensing.","correct":"✓ He operates the pill-dispensing machine.","note":"'Pill-dispensing' describes a system or machine, not a person."}],"priority":"★★☆"},"related_words":{"derivatives":["dispense","dispenser","medication","pharmacy"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'pill-dispensing' refers to the process of distributing pills, often using automated systems. It is commonly used in medical and pharmaceutical contexts to describe machines or technologies that provide medication to patients. The term is relatively technical and specific to these fields."},"example_sentences":[{"sentence":"The new pill-dispensing unit reduced medication errors.","translation":"新しい錠剤分配ユニットは、薬の誤りを減らしました。","type":"adjective","meaning_category":"錠剤を分配する"},{"sentence":"The automated pill-dispensing system helps manage large volumes of prescriptions.","translation":"自動化された錠剤分配システムは、大量の処方箋を管理するのに役立ちます。","type":"adjective","meaning_category":"錠剤を払い出す"},{"sentence":"Efficient pill-dispensing is crucial in hospitals.","translation":"効率的な錠剤分配は病院で非常に重要です。","type":"adjective","meaning_category":"錠剤を分配する"}]}