{"word":"Hansardize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(文書などを)公式議事録のような形式に書き換える、記録する","english_definition":"To record or rewrite (a document, speech, etc.) in a style resembling that of an official parliamentary record (like Hansard).","examples":[{"sentence":"The journalist Hansardized the politician's rambling speech to make it more coherent.","translation":"ジャーナリストは、政治家のとりとめのない演説を、よりまとまりのあるものにするために、公式議事録のような形式に書き換えた。"},{"sentence":"The company's internal meeting minutes were Hansardized for legal compliance.","translation":"社内の会議議事録は、法令遵守のために公式議事録のような形式で記録された。"}],"collocations":["Hansardize a speech","Hansardize meeting minutes","Hansardize a document"],"synonyms":["transcribe","record","verbatim","summarize","report"],"antonyms":["ad-lib","extemporize","improvise"]}],"etymology":{"value":"Derived from 'Hansard,' the name of the official reports of parliamentary debates in the UK and other Commonwealth countries. The verb 'Hansardize' implies converting something into a formal, detailed record akin to those reports.","priority":"★★★"},"pronunciation":{"ipa":"/ˈhænsɑːrdaɪz/","syllables":"Han-sard-ize"},"inflection":{"verb_forms":{"present_simple":["Hansardize","Hansardizes"],"past_simple":"Hansardized","past_participle":"Hansardized","present_participle":"Hansardizing"}},"usage_notes":{"explanation":"'Hansardize' is a relatively uncommon verb that describes the act of creating a formal, detailed, and often verbatim record of something, similar to how parliamentary debates are recorded in Hansard. It suggests a level of accuracy and formality in the recording process.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to Hansardize my thoughts.","correct":"✓ I need to organize my thoughts.","note":"'Hansardize' is typically used for recording external events or speeches, not for personal thought organization."},{"incorrect":"✗ The author Hansardized the novel.","correct":"✓ The author transcribed the novel.","note":"'Hansardize' implies a formal recording process, not simply writing a novel."}],"priority":"★☆☆"},"related_words":{"derivatives":["Hansard (noun): The official report of debates in the UK Parliament and other Commonwealth countries.","Hansard (adjective): Relating to or characteristic of Hansard."],"related_terms":["transcribe","record","minutes","verbatim","report"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Very rare - not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Extremely Low Frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Hansardize' is a specialized term primarily used in contexts related to formal record-keeping, particularly in parliamentary or legal settings. It implies a high degree of accuracy and formality in documenting spoken or written information. Due to its specific usage, it is not commonly encountered in general English. Understanding requires familiarity with the function and style of Hansard reports."},"example_sentences":[{"sentence":"The legal team decided to Hansardize all depositions to ensure accuracy.","translation":"弁護士チームは、正確性を確保するために、すべての証言を公式議事録のような形式で記録することに決定した。","type":"verb","meaning_category":"記録する"},{"sentence":"The CEO's speech was Hansardized and distributed to all employees.","translation":"CEOの演説は公式議事録のような形式に書き換えられ、全従業員に配布された。","type":"verb","meaning_category":"書き換える"}]}