{"word":"chaksi","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(South Asian cuisine) A set of two bowls, one for rice and one for curry or other dishes, often used together.","english_definition":"A set of two bowls, typically used in South Asian cuisine, consisting of a larger bowl for rice and a smaller bowl for curry or other dishes.","examples":[{"sentence":"He ate his lunch from a chaksi.","translation":"彼はお昼ご飯をチャクシで食べた。"},{"sentence":"The chaksi is a convenient way to serve a complete meal.","translation":"チャクシは一食分の食事を出すのに便利な方法だ。"}],"collocations":["eat from a chaksi","serve food in a chaksi"],"synonyms":["thali (similar but often larger)"],"antonyms":[]}],"etymology":{"value":"Likely derived from a regional South Asian language. The exact origin is not widely documented in standard English etymological resources.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈtʃʌksi/","syllables":"chak-si"},"inflection":{"noun_plural":"chaksis"},"usage_notes":{"explanation":"The term 'chaksi' is not widely used in standard English. It is more common in specific cultural contexts related to South Asian cuisine.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate with chaksi.","correct":"✓ I ate from a chaksi.","note":"Use the preposition 'from' to indicate eating from the bowls."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (not a common English word)","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Chaksi' is a niche term, primarily used within specific cultural contexts related to South Asian cuisine. It refers to a set of two bowls used for serving a meal. Due to its limited usage, it is not commonly found in general English vocabulary. Understanding this term requires familiarity with South Asian culinary practices."},"example_sentences":[{"sentence":"The restaurant served the traditional meal in a chaksi.","translation":"レストランでは伝統的な食事をチャクシで提供した。","type":"noun","meaning_category":"cuisine"},{"sentence":"He preferred using a chaksi for his daily meals.","translation":"彼は毎日の食事にチャクシを使うのを好んだ。","type":"noun","meaning_category":"utensil"}]}