{"word":"photometrician","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"測光学者、測光専門家","english_definition":"A person who specializes in photometry, the science of measuring light.","examples":[{"sentence":"The photometrician carefully calibrated the instrument before taking measurements.","translation":"測光学者は測定を行う前に、慎重に機器の校正を行った。"},{"sentence":"Photometricians play a crucial role in astronomy by analyzing the brightness of stars.","translation":"測光学者は、星の明るさを分析することで天文学において重要な役割を果たす。"}],"collocations":["calibrate instruments","analyze data","measure brightness"],"synonyms":["light measurement specialist","illumination expert"],"antonyms":[]}],"etymology":{"value":"The word \"photometrician\" is derived from \"photometry\" (the science of measuring light) + \"-ician\" (a suffix denoting a person skilled in a particular field). \"Photometry\" comes from the Greek words \"phos\" (light) and \"metron\" (measure).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfoʊtoʊməˈtrɪʃən/","syllables":"pho-to-me-tri-cian"},"inflection":{"noun_plural":"photometricians"},"usage_notes":{"explanation":"A photometrician is a specialist in the field of photometry, which involves the measurement of light intensity and related properties. They often work in areas such as astronomy, lighting design, and image processing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The photometrician studies photos.","correct":"✓ The photometrician studies light measurements.","note":"Photometricians study the measurement of light, not necessarily photographs."}],"priority":"★★☆"},"related_words":{"derivatives":["photometry","photometric"],"related_fields":["astronomy","lighting design","image processing"]},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"photometrician\" is a specialized term used to describe someone who works in the field of photometry. This involves measuring light intensity and related properties. It's a technical term that is not commonly used in everyday language."},"example_sentences":[{"sentence":"The photometrician used a spectroradiometer to measure the spectral power distribution of the light source.","translation":"測光学者は、光源のスペクトルパワー分布を測定するために分光放射計を使用した。","type":"general","meaning_category":"definition"},{"sentence":"As a photometrician, she was responsible for ensuring the accuracy of the lighting design in the new museum.","translation":"測光学者として、彼女は新しい博物館の照明設計の精度を保証する責任があった。","type":"professional","meaning_category":"job responsibility"}]}