{"word":"Lyonnesse","priority":"低","meanings":[{"part_of_speech":"noun","definition":"(伝説上の)リヨネー、アーサー王物語に登場する失われた王国","english_definition":"(Legendary) A mythical kingdom said to have been located off the coast of Cornwall, England, now submerged beneath the sea. It is associated with Arthurian legends, particularly the story of Tristan and Iseult.","examples":[{"sentence":"Lyonnesse is mentioned in Arthurian romances as the homeland of Tristan.","translation":"リヨネーはアーサー王物語の中で、トリスタンの故郷として言及されている。"},{"sentence":"According to legend, Lyonnesse was a fertile and prosperous land before it was swallowed by the sea.","translation":"伝説によれば、リヨネーは海に飲み込まれる前は肥沃で繁栄した土地だった。"}],"collocations":["lost kingdom of Lyonnesse","legend of Lyonnesse","submerged Lyonnesse"],"synonyms":["lost land","mythical kingdom","Avalon (related, but not a direct synonym)"],"antonyms":[]},{"part_of_speech":"noun","definition":"(比喩的に)失われた場所、過ぎ去った時代","english_definition":"(Figurative) A place or time that is lost or gone forever; a symbol of something irretrievable.","examples":[{"sentence":"For many, the small village represents a Lyonnesse of simpler times.","translation":"多くの人々にとって、その小さな村は、よりシンプルな時代の失われた場所を象徴している。"},{"sentence":"The old photographs evoked a sense of Lyonnesse, a world now vanished.","translation":"古い写真は、失われた世界、過ぎ去った時代の感覚を呼び起こした。"}],"collocations":["a Lyonnesse of the past","evoke a Lyonnesse","sense of Lyonnesse"],"synonyms":["bygone era","lost world","vanished place"],"antonyms":[]}],"etymology":{"value":"The name 'Lyonnesse' is of uncertain origin, but it is believed to be derived from a combination of Old French and Cornish elements. It first appeared in medieval romances and chronicles. The spelling varies, and it is sometimes seen as 'Lyonesse'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌlaɪəˈnɛs/","syllables":"Ly-on-nesse"},"inflection":{"notes":"Noun, singular. No standard plural form."},"usage_notes":{"explanation":"'Lyonnesse' primarily refers to the legendary lost kingdom. Its usage is often literary or historical, appearing in discussions of Arthurian mythology or in metaphorical contexts to describe something lost and idealized. The term is relatively rare in modern everyday speech.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I visited Lyonnesse last summer.","correct":"✓ (If referring to the legend) Lyonnesse is a legendary kingdom, not a real place to visit.","note":"Lyonnesse is a mythical place, not a real location that can be visited."},{"incorrect":"✗ Lyonnesse is in France.","correct":"✓ Lyonnesse is said to have been off the coast of Cornwall, England.","note":"The legendary location of Lyonnesse is off the coast of Cornwall, not in France."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["Arthurian legends","Tristan and Iseult","Cornwall","mythical islands","Atlantis (similar concept of a lost land)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (not in standard CEFR vocabulary lists)","frequency_google_ngram":"Very low frequency. Primarily found in literature and historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Lyonnesse' is a rare and specialized term primarily encountered in the context of Arthurian legends and literature. Understanding its meaning requires familiarity with these cultural references. Its figurative usage requires an understanding of metaphor and symbolism. Due to its limited usage and specialized context, it is considered a high-level vocabulary word."},"example_sentences":[{"sentence":"The poet wrote of Lyonnesse, a land lost to the sea.","translation":"詩人は、海に失われた土地、リヨネーについて書いた。","type":"noun","meaning_category":"Legendary kingdom"},{"sentence":"The abandoned village seemed like a Lyonnesse of a bygone era.","translation":"その廃村は、過ぎ去った時代の失われた場所のようだった。","type":"noun","meaning_category":"Figurative lost place"}]}