{"word":"hypergolically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"自然発火的に、接触すると即座に燃焼するように","english_definition":"In a hypergolic manner; pertaining to hypergolicity, or spontaneous ignition upon contact.","examples":[{"sentence":"The fuel and oxidizer were mixed hypergolically, resulting in immediate combustion.","translation":"燃料と酸化剤は自然発火的に混合され、即座に燃焼した。"}],"collocations":[],"synonyms":["spontaneously","ignitably","reactively"],"antonyms":["non-reactively","non-ignitably"]}],"etymology":{"value":"Derived from 'hypergolic', which originates from the prefix 'hyper-' (meaning 'over' or 'excessive') and the suffix '-golic' (related to energy or work). The term describes substances that ignite spontaneously upon contact due to their high reactivity.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpərˈɡɒlɪkli/","syllables":"hy-per-gol-i-cal-ly"},"inflection":{"notes":"This is an adverb, so it does not inflect."},"usage_notes":{"explanation":"'Hypergolically' describes a specific type of chemical reaction where ignition occurs immediately upon contact between two substances, typically a fuel and an oxidizer. This property is crucial in rocket propulsion systems, where reliable and instant ignition is essential.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["hypergolic (adjective)","hypergolicity (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'hypergolically' is a highly specialized term primarily used in the context of rocket science and chemistry. It describes the manner in which hypergolic substances (fuels and oxidizers) react, which is to ignite spontaneously upon contact. Due to its technical nature, it is rarely encountered outside of these specific fields."},"example_sentences":[{"sentence":"The rocket engine was designed to inject the fuel and oxidizer hypergolically.","translation":"そのロケットエンジンは、燃料と酸化剤を自然発火的に噴射するように設計されていた。","type":"adverb","meaning_category":"自然発火的に"}]}