{"word":"nubbiness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(生地などの)表面の小さなこぶ状の突起がある状態、ごつごつした感じ、けば立ち","english_definition":"The state or quality of being nubby; having small lumps or protuberances on the surface, often referring to fabric.","examples":[{"sentence":"The nubbiness of the tweed gave it a rustic charm.","translation":"そのツイード生地のけば立ちが、素朴な魅力をもたらした。"},{"sentence":"She liked the nubbiness of the handwoven fabric.","translation":"彼女は手織り生地のごつごつした感じが好きだった。"},{"sentence":"The texture was defined by its characteristic nubbiness.","translation":"その質感は、特徴的なけば立ちによって定義されていた。"}],"collocations":["fabric nubbiness (生地のけば立ち)","texture nubbiness (質感のけば立ち)","increase nubbiness (けば立ちを増す)","reduce nubbiness (けば立ちを減らす)"],"synonyms":["lumpiness","roughness","unevenness","protuberance","knobbliness"],"antonyms":["smoothness","evenness","flatness"]}],"etymology":{"value":"The word \"nubbiness\" is derived from \"nubby,\" which comes from \"nub.\" \"Nub\" likely originated from Middle Low German or Middle Dutch words meaning \"knob\" or \"protuberance.\" The suffix \"-iness\" is added to form a noun indicating the quality or state of being nubby.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnʌbinəs/","syllables":"nub-bi-ness"},"inflection":{"noun_plural":"nubbinesses"},"usage_notes":{"explanation":"\"Nubbiness\" is primarily used to describe the texture of fabrics or other materials that have small, raised bumps or irregularities on their surface. It is often used in the context of textiles, where the nubs can add visual interest or a unique tactile quality. The term can also be used more generally to describe any surface that has a bumpy or uneven texture.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nubbiness was too much smooth.","correct":"✓ The nubbiness was not smooth at all. / ✓ The fabric lacked smoothness.","note":"\"Nubbiness\" and \"smoothness\" are antonyms, so they cannot be used together to describe the same quality. Instead, use a negative construction or a contrasting statement. "},{"incorrect":"✗ The nubbiness of the idea.","correct":"✓ The complexity/impracticality of the idea.","note":"\"Nubbiness\" typically refers to physical textures. For abstract concepts like ideas, use other words like \"complexity\" or \"impracticality\" instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["nub (名詞: 小さなこぶ、突起)","nubby (形容詞: こぶ状の突起がある、けば立った)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門的な文脈でまれに使用される)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Nubbiness\" is a relatively uncommon word used to describe the texture of a surface that has small bumps or lumps. It's most often used when talking about fabrics or materials. The word implies a tactile quality, suggesting that the surface is not smooth but has a slightly rough or uneven feel due to the presence of nubs. Understanding this word requires a good vocabulary and familiarity with descriptive language. "},"example_sentences":[{"sentence":"The designer chose the fabric for its unique **nubbiness**.","translation":"デザイナーはその独特のけば立ちのためにその生地を選んだ。","type":"noun","meaning_category":"けば立ち"},{"sentence":"The **nubbiness** of the wool made the sweater feel extra cozy.","translation":"そのウールのけば立ちが、セーターをとても心地よく感じさせた。","type":"noun","meaning_category":"けば立ち"},{"sentence":"The artist appreciated the **nubbiness** of the handmade paper.","translation":"アーティストは手作り紙のけば立ちを高く評価した。","type":"noun","meaning_category":"けば立ち"}]}