{"word":"orthopedia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"整形外科学","english_definition":"The branch of surgery concerned with conditions involving the musculoskeletal system.","examples":[{"sentence":"He is a doctor specializing in orthopedia.","translation":"彼は整形外科を専門とする医者です。"}],"collocations":[],"synonyms":["orthopaedics","orthopedic surgery"],"antonyms":[]}],"etymology":{"value":"From the Greek words \"orthos\" (straight) and \"paideia\" (rearing of children), reflecting an original focus on correcting skeletal deformities in children.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɔːrθəˈpiːdiə/","syllables":"or-tho-pe-di-a"},"inflection":{"noun_plural":"orthopedias"},"usage_notes":{"explanation":"While \"orthopedia\" is technically correct and reflects the word's etymological roots, the more common and widely accepted spelling is \"orthopaedics\" (in British English) or \"orthopedics\" (in American English). The term refers to the medical specialty focused on the diagnosis, treatment, rehabilitation, and prevention of injuries and diseases of the musculoskeletal system.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I went to the orthopedia for my back pain.","correct":"✓ I went to the orthopedist for my back pain.","note":"It is more common to say \"orthopedist\" (a doctor specializing in orthopaedics) rather than \"orthopedia\" (the field of medicine) when referring to seeing a doctor for musculoskeletal issues."}],"priority":"★★☆"},"related_words":{"derivatives":["orthopedic (adjective)","orthopedist (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Orthopedia\" is a formal term, although less commonly used than \"orthopaedics\" or \"orthopedics,\" referring to the branch of medicine dealing with the correction or prevention of deformities, injuries, or diseases of the bones, joints, muscles, and other elements of the musculoskeletal system. It's a specialized term primarily used in medical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The hospital has a dedicated department for orthopedia.","translation":"その病院には整形外科の専門部署があります。","type":"noun","meaning_category":"整形外科学"},{"sentence":"His research contributes to the field of orthopedia.","translation":"彼の研究は整形外科学の分野に貢献しています。","type":"noun","meaning_category":"整形外科学"}]}