{"word":"stereoroentgenogram","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"立体レントゲン写真、ステレオレントゲン写真","english_definition":"A stereoscopic X-ray picture; a pair of radiographs taken from slightly different angles to give a three-dimensional view when viewed through a stereoscope.","examples":[{"sentence":"The doctor examined the stereoroentgenogram to get a better understanding of the patient's condition.","translation":"医師は患者の状態をより良く理解するために、立体レントゲン写真を調べた。"}],"collocations":["take a stereoroentgenogram","examine a stereoroentgenogram","interpret a stereoroentgenogram"],"synonyms":["stereoradiograph","stereogram","X-ray stereogram"],"antonyms":[]}],"etymology":{"value":"'Stereo-' (立体) + 'roentgenogram' (レントゲン写真)","priority":"★★★"},"pronunciation":{"ipa":"/ˌstɪəriːəʊˌrɛntɡəˈnɒɡræm/","syllables":"ste-re-o-roent-ge-no-gram"},"inflection":{"noun_plural":"stereoroentgenograms"},"usage_notes":{"explanation":"A stereoroentgenogram is a pair of X-ray images taken from slightly different angles, which, when viewed together through a stereoscope, provide a three-dimensional view of the internal structures of the body. This technique is used to improve the visualization and diagnosis of certain medical conditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I need a stereoroentgenogram of my brain.","correct":"✓ I need a stereoroentgenogram of my head.","note":"While the brain is inside the head, specifying 'head' is more common and accurate when referring to the area being imaged."}],"priority":"★☆☆"},"related_words":{"derivatives":["stereoroentgenography (立体レントゲン撮影法)","roentgenogram (レントゲン写真)","stereoscopy (立体視)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'stereoroentgenogram' is a highly specialized medical term referring to a stereoscopic X-ray image. Due to its technical nature and limited use outside of medical contexts, it is considered a C2 level word. Understanding requires familiarity with medical imaging techniques and terminology."},"example_sentences":[{"sentence":"The stereoroentgenogram revealed a small lesion in the lung.","translation":"立体レントゲン写真で肺の小さな病変が明らかになった。","type":"medical","meaning_category":"diagnosis"},{"sentence":"The stereoroentgenogram provided a clearer three-dimensional view of the fracture.","translation":"立体レントゲン写真は骨折のより鮮明な立体画像を提供した。","type":"medical","meaning_category":"imaging"}]}