{"word":"carbonide","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"炭化物","english_definition":"A compound of carbon with a more electropositive element or elements.","examples":[{"sentence":"Silicon carbonide is a very hard material.","translation":"炭化ケイ素は非常に硬い材料です。"},{"sentence":"Some metals form carbonides at high temperatures.","translation":"一部の金属は高温で炭化物を形成します。"}],"collocations":["metal carbonide","silicon carbonide"],"synonyms":["carbide"],"antonyms":[]}],"etymology":{"value":"The term 'carbonide' is derived from 'carbon' and '-ide', a suffix used in chemistry to denote a binary compound, especially one in which the first element named is more electropositive than the second.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkɑːrbənaɪd/","syllables":"car-bo-nide"},"inflection":{"noun_plural":"carbonides"},"usage_notes":{"explanation":"The term 'carbonide' is often used interchangeably with 'carbide'. However, 'carbide' is the more common and widely accepted term in scientific and technical contexts. 'Carbonide' may sometimes be used to emphasize the presence of carbon in a compound, especially when discussing compounds where carbon acts as the more electronegative element.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The carbonide is used as a lubricant.","correct":"✓ The carbide is used as a lubricant.","note":"'Carbide' is the more common term. Use 'carbonide' only when you need to emphasize the presence of carbon in the compound."}],"priority":"★★☆"},"related_words":{"derivatives":["carbon","carbide","carbonization"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Carbonide' is a technical term primarily used in chemistry and materials science to refer to compounds of carbon with a more electropositive element. While often used synonymously with 'carbide', 'carbonide' may be preferred when emphasizing the role of carbon in the compound's structure or properties. Understanding this term requires a background in chemistry or materials science.","priority":"★★☆"},"example_sentences":[{"sentence":"Titanium carbonide is used in cutting tools due to its high hardness.","translation":"炭化チタンは、その高い硬度から切削工具に使用されます。","type":"noun","meaning_category":"炭化物"},{"sentence":"The formation of carbonides can affect the properties of steel.","translation":"炭化物の形成は、鋼の特性に影響を与える可能性があります。","type":"noun","meaning_category":"炭化物"}]}