{"word":"subterposition","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(地質学) 下位に位置すること、下位にある状態","english_definition":"The state of being placed or lying under something else; the condition of being in a lower position. (Specifically in geology, the state of being located below another layer or stratum.)","examples":[{"sentence":"The subterposition of the older rock layers beneath the newer ones indicates a long geological history.","translation":"新しい岩層の下に古い岩層が下位に位置することは、長い地質学的歴史を示している。"}],"collocations":["relative subterposition","stratigraphic subterposition"],"synonyms":["underlying","underlying position","inferior position"],"antonyms":["superposition","overlying","superior position"]},{"part_of_speech":"noun","definition":"(比喩的に) 従属的な立場、二次的な重要性","english_definition":"A subordinate or secondary position; a state of being less important or influential. (Figurative usage).","examples":[{"sentence":"The subterposition of local concerns to national interests is a common theme in political discourse.","translation":"地方の関心が国の利益に従属することは、政治的な議論における共通のテーマである。"}],"collocations":["relative subterposition","hierarchical subterposition"],"synonyms":["subordination","secondary status","inferiority"],"antonyms":["superordination","primacy","superiority"]}],"etymology":{"value":"From Latin *sub-* (under) + *positio* (a placing, situation), from *ponere* (to place). Literally, 'a placing under'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsʌb.tər.pəˈzɪʃ.ən/","syllables":"sub-ter-po-si-tion"},"inflection":{"noun_plural":"subterpositions"},"usage_notes":{"explanation":"'Subterposition' is a relatively rare word, primarily used in technical contexts, especially geology. It refers to the state of being located underneath something else. Figuratively, it can describe a state of subordination or lesser importance. The antonym 'superposition' is much more common.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The subterposition of the painting was remarkable.","correct":"✓ The composition of the painting was remarkable.","note":"Subterposition refers to relative physical or hierarchical positioning, not artistic composition."}],"priority":"★☆☆"},"related_words":{"derivatives":["subterrestrial","subterranean","position","superposition"],"related_terms":["stratigraphy","geology","hierarchy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Subterposition' is a technical term primarily used in geology to describe the relationship between layers of rock, where one layer lies beneath another. It can also be used more abstractly to describe something that is in a subordinate or less important position. Because of its specialized usage, it's not a common word in everyday language, and understanding it requires a good grasp of scientific or technical vocabulary. The word is formed from the prefix 'sub-' (meaning 'under') and 'position' (meaning 'place')."},"example_sentences":[{"sentence":"The principle of subterposition helps geologists determine the relative ages of rock strata.","translation":"下位の法則は、地質学者が岩層の相対的な年代を決定するのに役立つ。","type":"noun","meaning_category":"Geology"},{"sentence":"In the company hierarchy, the marketing department's concerns were often in subterposition to the sales department's priorities.","translation":"会社の階層構造において、マーケティング部門の関心事は、しばしば営業部門の優先事項に従属していた。","type":"noun","meaning_category":"Figurative"}]}