{"word":"preventer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"妨害者、阻止する人、予防するもの","english_definition":"A person or thing that prevents something from happening.","examples":[{"sentence":"He was known as a preventer of crime in the neighborhood.","translation":"彼は近隣で犯罪を阻止する人として知られていた。"},{"sentence":"The vaccine is a great preventer of the disease.","translation":"そのワクチンはその病気の優れた予防薬だ。"}],"collocations":["crime preventer (犯罪阻止者)","disease preventer (病気予防薬)","accident preventer (事故防止装置)"],"synonyms":["deterrent","inhibitor","obstacle","barrier","hindrance"],"antonyms":["promoter","facilitator","enabler"]}],"etymology":{"value":"The word 'preventer' is derived from the verb 'prevent', which comes from the Latin word 'praevenire', meaning 'to come before, anticipate, hinder'. The suffix '-er' is added to indicate a person or thing that performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/prɪˈventər/","syllables":"pre-vent-er"},"inflection":{"noun_plural":"preventers"},"usage_notes":{"explanation":"'Preventer' is used to describe something or someone that stops something else from happening. It can refer to a person who actively stops something, or an object or substance that prevents an event or condition. It is less common than 'prevention' or 'preventative'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The preventer is very effective to cure the disease.","correct":"The preventer is very effective at preventing the disease.","note":"'Preventer' is something that stops something from happening, not something that cures. Use 'preventing' to describe the action of stopping the disease."}],"priority":"★☆☆"},"related_words":{"derivatives":["prevent (verb)","prevention (noun)","preventable (adjective)","preventative (adjective)"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'preventer' is a noun that refers to something or someone that stops something else from happening. It is formed by adding the suffix '-er' to the verb 'prevent'. The word is not very common and is typically used in formal or technical contexts. It's important to distinguish 'preventer' from 'prevention,' which is the act of preventing something, and 'preventative,' which is an adjective describing something that is used to prevent something else."},"example_sentences":[{"sentence":"The new security system acts as a preventer of theft.","translation":"その新しいセキュリティシステムは盗難防止装置として機能する。","type":"noun","meaning_category":"予防するもの"},{"sentence":"He saw himself as a preventer of injustice in the community.","translation":"彼は地域社会における不正を阻止する者として自分を見ていた。","type":"noun","meaning_category":"妨害者"}]}