{"word":"Aisne-Marne","priority":"★★☆","meanings":[{"part_of_speech":"proper noun","definition":"(フランスの)エーヌ＝マルヌ","english_definition":"A region in France encompassing parts of the Aisne and Marne departments. It is historically significant as the site of several major battles during World War I.","examples":[{"sentence":"The Aisne-Marne American Cemetery is located in Belleau, France.","translation":"エーヌ＝マルヌ米軍墓地はフランスのベルーにあります。"},{"sentence":"The Battle of Aisne-Marne was a crucial turning point in World War I.","translation":"エーヌ＝マルヌの戦いは、第一次世界大戦における重要な転換点でした。"}],"collocations":["Aisne-Marne American Cemetery","Battle of Aisne-Marne","Aisne Department","Marne Department"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name combines the names of two French departments, Aisne and Marne, both of which are traversed by the Aisne and Marne rivers, respectively. The region is named for its geographical location and historical significance during World War I.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌeɪn ˈmɑːrn/","syllables":"Aisne-Marne"},"inflection":{},"usage_notes":{"explanation":"'Aisne-Marne' primarily refers to a geographical area in France, particularly relevant in the context of World War I history. It is often used in discussions about the battles fought there and the American involvement in those battles. The Aisne-Marne American Cemetery is a notable landmark in the area.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"related_terms":["Aisne","Marne","World War I","Belleau Wood","Château-Thierry"],"priority":"★★☆"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"'Aisne-Marne' is a proper noun referring to a specific region in France, primarily known for its historical significance during World War I. Understanding its meaning requires familiarity with French geography and World War I history. The term is most commonly encountered in historical texts, military discussions, or when referring to landmarks like the Aisne-Marne American Cemetery."},"example_sentences":[{"sentence":"The Aisne-Marne offensive was a major Allied offensive in 1918.","translation":"エーヌ＝マルヌ攻勢は、1918年の主要な連合国軍の攻勢でした。","type":"example","meaning_category":"historical event"},{"sentence":"Many American soldiers are buried at the Aisne-Marne American Cemetery.","translation":"多くのアメリカ兵がエーヌ＝マルヌ米軍墓地に埋葬されています。","type":"example","meaning_category":"location"},{"sentence":"The battles in the Aisne-Marne region were critical to the outcome of the war.","translation":"エーヌ＝マルヌ地域での戦いは、戦争の結果にとって非常に重要でした。","type":"example","meaning_category":"historical significance"}]}