{"word":"cachexia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"悪液質（あくえきしつ）: 慢性疾患に伴う極度の衰弱と栄養不良の状態。筋肉の消耗、体重減少、食欲不振などが特徴。","english_definition":"A complex metabolic syndrome associated with underlying illness and characterized by loss of muscle with or without loss of fat mass. The prominent feature of cachexia is weight loss, muscle atrophy, fatigue, weakness, and significant loss of appetite in someone who is not actively trying to lose weight.","examples":[{"sentence":"Cancer cachexia is a common problem in advanced cancer patients.","translation":"癌性悪液質は、進行癌患者によく見られる問題です。"},{"sentence":"The patient presented with severe cachexia and required nutritional support.","translation":"患者は重度の悪液質を呈しており、栄養サポートが必要でした。"},{"sentence":"Cachexia can significantly impact the quality of life for individuals with chronic diseases.","translation":"悪液質は、慢性疾患を持つ人々の生活の質に大きな影響を与える可能性があります。"}],"collocations":["cancer cachexia (癌性悪液質)","cardiac cachexia (心臓悪液質)","HIV-associated cachexia (HIV関連悪液質)","cachexia treatment (悪液質治療)","cachexia management (悪液質管理)","muscle wasting in cachexia (悪液質における筋肉消耗)"],"synonyms":["wasting syndrome","malnutrition","emaciation","atrophy","debilitation"],"antonyms":["anabolism","weight gain","muscle gain","hypertrophy"]}],"etymology":{"value":"ギリシャ語の「kakos」（悪い）と「hexis」（状態、性質）に由来。文字通りには「悪い状態」を意味する。","priority":"★★☆"},"pronunciation":{"ipa":"/kæˈkɛksiə/","syllables":"ca-chex-i-a"},"inflection":{"noun_plural":null,"notes":"通常、不可算名詞として扱われるため、複数形は一般的ではありません。"},"usage_notes":{"explanation":"「**cachexia**」は、単なる体重減少とは異なり、基礎疾患（癌、慢性心不全、慢性腎不全、HIV感染症など）によって引き起こされる代謝異常を伴う複雑な症候群です。炎症性サイトカインの過剰産生や、異常なエネルギー代謝が関与すると考えられています。栄養補給だけでは改善しないことが多く、基礎疾患の治療と並行して、運動療法や薬物療法などの包括的なアプローチが必要です。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Cachexia is just being skinny.","correct":"✓ Cachexia is a complex metabolic syndrome associated with underlying illness, characterized by muscle wasting and weight loss.","note":"Cachexiaは単なる痩せではなく、基礎疾患に伴う代謝異常を伴う状態です。"},{"incorrect":"✗ Eating more will cure cachexia.","correct":"✓ Eating more may help, but cachexia often requires a multifaceted approach including treatment of the underlying disease and other interventions.","note":"栄養補給は重要ですが、悪液質の根本的な原因に対処する必要があります。"}],"priority":"★★☆"},"related_words":{"derivatives":["cachectic (形容詞: 悪液質の)"],"phrasal_verbs":null,"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (医学・専門分野)","frequency_google_ngram":"低頻度 (Low frequency) - 医学用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**cachexia**」は、医学用語で、慢性的な病気によって引き起こされる体の衰弱と筋肉の減少を指します。これは、単に体重が減るだけでなく、体がエネルギーを使う方法が変わってしまう複雑な状態です。癌や心不全などの病気を持つ人が、食欲がない、疲れやすい、体重が減るといった症状を示す場合に、この言葉が使われます。治療は、病気の原因に対処し、栄養を補給し、筋肉を維持することを目指します。"},"example_sentences":[{"sentence":"The patient's severe weight loss was indicative of advanced cachexia.","translation":"患者の深刻な体重減少は、進行した悪液質を示唆していました。","type":"noun","meaning_category":"病状"},{"sentence":"Nutritional support is crucial in managing cachexia and improving the patient's quality of life.","translation":"栄養サポートは、悪液質を管理し、患者の生活の質を向上させるために不可欠です。","type":"noun","meaning_category":"治療"}],"medical_specialty":["oncology","cardiology","nephrology","infectious disease"]}