{"word":"calorie-dense","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"カロリー密度の高い、高カロリーの","english_definition":"containing a large amount of calories relative to its weight or volume.","examples":[{"sentence":"Nuts and seeds are calorie-dense foods.","translation":"ナッツや種子はカロリー密度の高い食品です。"},{"sentence":"Processed foods are often calorie-dense but nutrient-poor.","translation":"加工食品はカロリー密度が高いものの、栄養価が低いことが多いです。"},{"sentence":"Athletes may need calorie-dense foods to fuel their training.","translation":"アスリートはトレーニングのエネルギー源として、カロリー密度の高い食品が必要となる場合があります。"}],"collocations":["calorie-dense food","calorie-dense diet","calorie-dense snack"],"synonyms":["high-calorie","energy-dense"],"antonyms":["low-calorie","nutrient-dense","low-energy"],"notes":"Calorie density is a measure of how many calories a food contains relative to its weight or volume. Foods that are high in calories but low in nutrients are considered calorie-dense. Calorie-dense foods can contribute to weight gain if consumed in excess."}],"etymology":{"value":"The term is a compound of 'calorie' (a unit of energy) and 'dense' (closely packed together).","priority":"★★★"},"pronunciation":{"ipa":"/ˈkæləriˌdɛns/","syllables":"cal-o-rie-dense"},"inflection":{"notes":"This is an adjective and does not have different forms."},"usage_notes":{"explanation":"The term 'calorie-dense' is often used in the context of nutrition and dietetics to describe foods that provide a lot of energy (calories) in a small serving. While such foods can be beneficial for athletes or individuals needing to gain weight, they can also contribute to overeating and weight gain if not consumed in moderation. It's important to consider the nutritional value of calorie-dense foods, as some may be high in unhealthy fats, sugars, or processed ingredients.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ This fruit is calorie-dense, so it's healthy.","correct":"✓ This fruit is nutrient-dense, so it's healthy.","note":"Fruits are generally nutrient-dense (high in vitamins and minerals) rather than calorie-dense. While some fruits have more calories than others, the term 'calorie-dense' is usually reserved for foods like nuts, seeds, and processed foods."},{"incorrect":"✗ A calorie-dense diet is always good for weight loss.","correct":"✓ A calorie-restricted diet is often used for weight loss.","note":"A calorie-dense diet is generally not recommended for weight loss, as it can lead to overeating. A calorie-restricted diet (consuming fewer calories) is typically used for weight loss."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["nutrient-dense","energy density","macronutrients","micronutrients","empty calories"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in nutrition-related contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Calorie-dense' describes foods that have a lot of calories compared to how much they weigh or how big they are. These foods give you a lot of energy in a small amount. While they can be helpful for people who need extra calories, like athletes, they can also lead to weight gain if you eat too much of them. It's important to think about whether these foods also have a lot of vitamins and minerals, or if they mostly just have calories."},"example_sentences":[{"sentence":"Avocados are a calorie-dense fruit, providing healthy fats and nutrients.","translation":"アボカドはカロリー密度の高い果物で、健康的な脂肪と栄養素を提供します。","type":"adjective","meaning_category":"高カロリーの"},{"sentence":"It's important to be mindful of portion sizes when consuming calorie-dense snacks like trail mix.","translation":"トレイルミックスのようなカロリー密度の高いスナックを摂取する際は、ポーションサイズに注意することが重要です。","type":"adjective","meaning_category":"高カロリーの"},{"sentence":"While calorie-dense foods can be convenient, they should be balanced with nutrient-rich options.","translation":"カロリー密度の高い食品は便利な場合もありますが、栄養豊富な食品とのバランスを取る必要があります。","type":"adjective","meaning_category":"高カロリーの"}]}