{"word":"restitutive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"賠償の、弁償の、回復的な","english_definition":"Serving to restore or compensate for loss or damage.","examples":[{"sentence":"The court ordered the company to pay a restitutive fine to the victims.","translation":"裁判所は、会社に対して被害者への賠償金を支払うよう命じた。"},{"sentence":"The restitutive measures aimed to restore the damaged ecosystem.","translation":"その回復措置は、損傷した生態系を回復させることを目的としていた。"}],"collocations":["restitutive justice","restitutive damages","restitutive fine","restitutive measures"],"synonyms":["compensatory","reparative","restorative","remedial"],"antonyms":["punitive","retributive"]}],"etymology":{"value":"From the Latin word 'restitutus', the past participle of 'restituere', meaning 'to restore'. 'Restituere' is formed from 're-' (again) and 'statuere' (to set up, establish).","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈstɪtjuːtɪv/","syllables":"re-sti-tu-tive"},"inflection":{"notes":"Comparative and superlative forms (more restitutive, most restitutive) exist but are not commonly used."},"usage_notes":{"explanation":"'Restitutive' is primarily used in legal and economic contexts to describe actions or measures taken to restore something to its original condition or to compensate for a loss. It often implies a sense of fairness and making amends. It is less commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The restitutive action was to punish the offender.","correct":"✓ The restitutive action was to compensate the victim.","note":"'Restitutive' focuses on compensating the victim, while punishment is a separate concept (punitive)."},{"incorrect":"✗ He felt restitutive for his mistake.","correct":"✓ He felt remorseful for his mistake. / ✓ He took restitutive action for his mistake.","note":"'Restitutive' describes actions or measures, not feelings. 'Remorseful' describes feelings of regret."}],"priority":"★★☆"},"related_words":{"derivatives":["restitution (noun): the act of restoring someone or something to its rightful owner or former condition; making good on loss or damage.","restitute (verb): to restore (something lost or stolen) to its proper owner."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Restitutive' is a formal and specialized term primarily used in legal and economic discussions. It describes actions aimed at restoring something lost or compensating for damages. Understanding the term requires familiarity with concepts of justice, compensation, and restoration. It is not typically encountered in everyday language."},"example_sentences":[{"sentence":"The insurance company provided a restitutive payment to cover the cost of the repairs.","translation":"保険会社は、修理費用を賄うための賠償金を支払った。","type":"adjective","meaning_category":"賠償の"},{"sentence":"The government implemented restitutive policies to address historical injustices.","translation":"政府は、歴史的な不正義に対処するための回復政策を実施した。","type":"adjective","meaning_category":"回復的な"},{"sentence":"The judge emphasized the importance of restitutive justice in the case.","translation":"裁判官は、この事件における賠償的司法の重要性を強調した。","type":"adjective","meaning_category":"賠償の"}]}