{"word":"unmoldableness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"成形不可能なこと、型から取り出せない性質","english_definition":"The quality or state of being unable to be molded or removed from a mold.","examples":[{"sentence":"The unmoldableness of the clay made it unsuitable for the project.","translation":"その粘土の成形不可能な性質が、プロジェクトには不向きにした。"},{"sentence":"Due to its stickiness, the substance exhibited unmoldableness.","translation":"その物質は粘着性のために、型から取り出せない性質を示した。"}],"collocations":["exhibit unmoldableness (成形不可能性を示す)","degree of unmoldableness (成形不可能性の度合い)"],"synonyms":["nonmoldability","inflexibility","rigidity"],"antonyms":["moldability","pliability","flexibility"]}],"etymology":{"value":"\"un-\" (否定接頭辞) + \"moldable\" (成形可能な) + \"-ness\" (名詞化接尾辞)","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈmoʊldəbəlnəs/","syllables":"un-mold-a-ble-ness"},"inflection":{"noun_plural":"unmoldablenesses (まれ)"},"usage_notes":{"explanation":"\"Unmoldableness\" is a relatively rare and technical term. It refers to the property of a substance or material that prevents it from being easily shaped or removed from a mold. This term is often used in industrial or scientific contexts when discussing materials and their properties.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unmoldableness was caused by the heat.","correct":"✓ The unmoldableness was caused by the heat treatment.","note":"\"Unmoldableness\" is a property of the material itself. Heat alone doesn't cause unmoldableness, but a heat *treatment* might change the material's properties to make it unmoldable. The sentence should specify the process that leads to the property."}],"priority":"★☆☆"},"related_words":{"derivatives":["unmoldable (形容詞: 成形不可能な)","moldable (形容詞: 成形可能な)","mold (名詞/動詞: 型、型に入れる)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Unmoldableness\" is a complex word that describes the characteristic of something that cannot be easily shaped or taken out of a mold. It's a niche term, most likely to be encountered in technical or scientific discussions about material properties. The word is formed by adding prefixes and suffixes to the base word \"mold,\" making it less common in everyday language."},"example_sentences":[{"sentence":"The high viscosity contributed to the material's unmoldableness.","translation":"高い粘度が、その材料の成形不可能性に寄与した。","type":"general","meaning_category":"成形不可能性"}]}