{"word":"refrangibleness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"屈折性、光の屈折率","english_definition":"The property of being refrangible; the degree to which a ray of light is refracted in passing from one medium into another.","examples":[{"sentence":"The refrangibleness of diamond is very high, which is why it sparkles so much.","translation":"ダイヤモンドの屈折率は非常に高く、それがダイヤモンドが非常に輝く理由です。"},{"sentence":"The refrangibleness of different types of glass varies, affecting how they are used in lenses.","translation":"異なる種類のガラスの屈折率は異なり、レンズでの使用方法に影響を与えます。"}],"collocations":["high refrangibleness","low refrangibleness","measure refrangibleness","determine refrangibleness"],"synonyms":["refractivity","refraction","refractive index"],"antonyms":["opacity","absorbency"]}],"etymology":{"value":"Derived from 'refrangible' (capable of being refracted) + '-ness' (suffix indicating a state or quality). 'Refrangible' comes from the Latin 'refrangere' (to break back, refract), from 're-' (back) + 'frangere' (to break).","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈfrændʒɪbəlˌnəs/","syllables":"re-fran-gi-ble-ness"},"inflection":{"noun_plural":"refrangibleness (uncountable)"},"usage_notes":{"explanation":"'Refrangibleness' is a technical term primarily used in physics and optics to describe how much light bends when passing through a substance. It's not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The refrangibleness of the object was colorful.","correct":"✓ The refrangibleness of the object was high.","note":"Refrangibleness refers to the degree of refraction, not the color. Use it to describe the extent of light bending, not visual properties like color."},{"incorrect":"✗ The refrangibleness caused the object to disappear.","correct":"✓ The high refrangibleness caused the object to appear distorted.","note":"High refrangibleness causes distortion due to bending light, not disappearance. Disappearance would be related to absorption or opacity."}],"priority":"★★☆"},"related_words":{"derivatives":["refrangible (adjective)","refract (verb)","refraction (noun)","refractive index (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (technical vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Refrangibleness' is a highly technical term used in physics, specifically optics. It refers to the degree to which light bends when it passes from one medium to another. This word is rarely used outside of scientific contexts and is not part of common vocabulary."},"example_sentences":[{"sentence":"The experiment aimed to measure the refrangibleness of various liquids.","translation":"その実験は、さまざまな液体の屈折率を測定することを目的としていました。","type":"noun","meaning_category":"屈折性"},{"sentence":"Due to its high refrangibleness, the prism effectively separated the white light into a spectrum of colors.","translation":"高い屈折率のため、プリズムは白色光を効果的に色のスペクトルに分離しました。","type":"noun","meaning_category":"光の屈折率"}]}