{"word":"Jabiru","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ジャビル (コウノトリ目コウノトリ科の鳥)","english_definition":"A large stork found in the Americas from Mexico to Argentina, typically black and white with a bare black head and neck and a red throat pouch.","examples":[{"sentence":"The jabiru is a wading bird often found in wetlands.","translation":"ジャビルは湿地帯でよく見られる渉禽類です。"},{"sentence":"Jabirus are known for their impressive size and distinctive appearance.","translation":"ジャビルはその印象的な大きさと独特の外観で知られています。"}],"collocations":["jabiru nest","jabiru habitat","jabiru stork"],"synonyms":["stork (コウノトリ)"],"antonyms":[]},{"part_of_speech":"noun","definition":"ジャビル (オーストラリア空軍の航空機)","english_definition":"An Australian designed and built light sport aircraft.","examples":[{"sentence":"The Jabiru is a popular choice for recreational flying.","translation":"ジャビルはレクリエーション飛行に人気があります。"},{"sentence":"Many flying schools use the Jabiru for training purposes.","translation":"多くの飛行学校が訓練目的でジャビルを使用しています。"}],"collocations":["Jabiru aircraft","Jabiru engine","Jabiru plane"],"synonyms":["light sport aircraft"],"antonyms":[]}],"etymology":{"value":"The name 'jabiru' comes from a Tupi-Guarani language and means 'swollen neck', referring to the bird's throat pouch.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒæbɪruː/","syllables":"ja-bi-ru"},"inflection":{"noun_plural":"jabirus"},"usage_notes":{"explanation":"The word \"Jabiru\" refers to two distinct things: a species of stork native to the Americas, and a type of light sport aircraft designed and built in Australia. The context usually makes it clear which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a jabiru flying over the ocean in Australia.","correct":"✓ I saw a jabiru flying over the wetlands in Australia.","note":"Jabirus (the stork) are not typically found over the ocean. In Australia, you'd find them in wetlands. If it was over the ocean, it would more likely be the aircraft."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"jabiru\" is relatively uncommon and may require specialized knowledge to understand its meaning. It refers to either a specific species of stork or a type of light sport aircraft. Understanding the context is crucial to determine the intended meaning. The etymology of the word is also interesting, as it provides insight into the origin of the name and its connection to the bird's physical characteristics."},"example_sentences":[{"sentence":"The **jabiru** waded gracefully through the shallow water.","translation":"ジャビルは浅瀬を優雅に歩いた。","type":"noun","meaning_category":"Bird"},{"sentence":"The **Jabiru** aircraft is known for its fuel efficiency.","translation":"ジャビルの航空機は燃費が良いことで知られています。","type":"noun","meaning_category":"Aircraft"}]}