{"word":"aquiculturist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"養殖業者、水産養殖業者","english_definition":"A person who practices aquaculture; someone involved in the cultivation of aquatic organisms such as fish, shellfish, and aquatic plants.","examples":[{"sentence":"The aquiculturist carefully monitors the water quality in the fish farm.","translation":"その養殖業者は、養魚場の水質を注意深く監視している。"},{"sentence":"Aquiculturists are working to develop sustainable methods for seafood production.","translation":"水産養殖業者は、持続可能な水産物生産方法の開発に取り組んでいる。"},{"sentence":"She became an aquiculturist after studying marine biology in college.","translation":"彼女は大学で海洋生物学を学んだ後、養殖業者になった。"}],"collocations":["fish aquiculturist (魚の養殖業者)","shellfish aquiculturist (貝の養殖業者)","aquaculture farm (養殖場)","sustainable aquaculture (持続可能な養殖)"],"synonyms":["fish farmer","aquafarmer","mariculturist"],"antonyms":[]}],"etymology":{"value":"The word \"aquiculturist\" is derived from \"aquiculture\" (the farming of aquatic organisms), which combines \"aqua\" (Latin for water) and \"culture\" (cultivation). The suffix \"-ist\" denotes a person who practices or is skilled in a particular field.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌækwɪˈkʌltʃərɪst/","syllables":"a-qui-cul-tur-ist"},"inflection":{"noun_plural":"aquiculturists"},"usage_notes":{"explanation":"An \"aquiculturist\" is a specific type of farmer who focuses on aquatic environments. They may specialize in raising fish, shellfish, algae, or other aquatic organisms for food, research, or conservation purposes. The term emphasizes the cultivation aspect of their work, distinguishing them from those who simply catch wild fish.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a aquaculturist.","correct":"✓ He is an aquiculturist.","note":"Because 'aquiculturist' begins with a vowel sound, it is preceded by 'an' instead of 'a'."},{"incorrect":"✗ aquaculturist","correct":"✓ aquiculturist","note":"Spelling matters. While 'aquaculture' is the general term for the practice, the person is an 'aquiculturist'."}],"priority":"★★☆"},"related_words":{"derivatives":["aquaculture (養殖)","aquicultural (養殖の)"],"phrasal_verbs":[],"related_occupations":["marine biologist","fisheries scientist","aquatic veterinarian"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"aquiculturist\" is a specialized term used to describe someone who practices aquaculture. It is not commonly used in everyday conversation but is more frequently found in scientific, technical, or industry-related contexts. Understanding the term requires knowledge of aquaculture practices and related fields.","priority":"★☆☆"},"example_sentences":[{"sentence":"The local aquiculturist specializes in raising organic shrimp.","translation":"地元の養殖業者は、有機エビの養殖を専門としている。","type":"general","meaning_category":"養殖業者"},{"sentence":"Aquiculturists are experimenting with new feed formulations to improve fish growth rates.","translation":"水産養殖業者は、魚の成長率を向上させるために、新しい飼料配合を実験している。","type":"research","meaning_category":"水産養殖業者"},{"sentence":"The aquiculturist implemented new water filtration systems to reduce environmental impact.","translation":"その養殖業者は、環境への影響を軽減するために、新しい水ろ過システムを導入した。","type":"environmental","meaning_category":"養殖業者"}]}