{"word":"lunar-insensitive","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Not significantly affected or influenced by the lunar cycle or lunar conditions.","english_definition":"Not showing a marked response or sensitivity to the moon's phases or conditions.","examples":[{"sentence":"The experiment was designed to be lunar-insensitive, ensuring consistent results regardless of the moon's position.","translation":"その実験は、月の位置に関わらず一貫した結果を保証するために、月の影響を受けにくいように設計されました。"},{"sentence":"This type of sensor is lunar-insensitive, making it suitable for use in space missions where the moon's presence is a factor.","translation":"このタイプのセンサーは月の影響を受けにくいため、月の存在が要因となる宇宙ミッションでの使用に適しています。"}],"collocations":["lunar-insensitive sensor","lunar-insensitive experiment","lunar-insensitive measurement"],"synonyms":["moon-independent","moon-unaffected"],"antonyms":["lunar-sensitive","moon-affected"]}],"etymology":{"value":"Formed by combining 'lunar' (relating to the moon) with 'insensitive' (not responsive or affected).","priority":"N/A"},"pronunciation":{"ipa":"/ˈluːnər ɪnˈsɛnsətɪv/","syllables":"lu-nar in-sen-si-tive"},"inflection":{},"usage_notes":{"explanation":"'Lunar-insensitive' is a technical term often used in scientific or engineering contexts to describe systems, devices, or experiments that are designed to minimize or eliminate the influence of the moon's phases, gravitational pull, or other lunar conditions on their operation or results.","priority":"N/A"},"common_mistakes":{},"related_words":{"derivatives":["lunar","insensitive","sensitivity"],"related_terms":["lunar cycle","moon phase","gravitational influence"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"'Lunar-insensitive' is a specialized term used in technical fields to describe something not affected by the moon. It combines 'lunar' (related to the moon) and 'insensitive' (not responsive). Understanding requires familiarity with scientific or engineering contexts where lunar effects might be relevant."},"example_sentences":[{"sentence":"The satellite's navigation system is designed to be lunar-insensitive for accurate positioning.","translation":"衛星のナビゲーションシステムは、正確な位置特定のために、月の影響を受けにくいように設計されています。","type":"adjective","meaning_category":"Not affected by the moon"}]}