{"word":"Fremantle","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"フリーマントル（オーストラリア、西オーストラリア州の港湾都市）","english_definition":"A port city in Western Australia, located at the mouth of the Swan River.","examples":[{"sentence":"Fremantle is known for its maritime history and well-preserved Victorian architecture.","translation":"フリーマントルは、その海洋史と保存状態の良いビクトリア朝建築で知られています。"},{"sentence":"We took a ferry from Perth to Fremantle.","translation":"私たちはパースからフリーマントルまでフェリーで行きました。"}],"collocations":["Fremantle Prison","Fremantle Markets","Little Creatures Brewery (Fremantle)"],"synonyms":["Freo (colloquial)"],"antonyms":[]}],"etymology":{"value":"Named after Captain Charles Fremantle, the captain of HMS Challenger, who took possession of the west coast of New Holland (now Australia) for the British Crown in 1829.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfriːmæntl/","syllables":"Free-man-tle"},"inflection":{},"usage_notes":{"explanation":"Fremantle is a proper noun referring to a specific city in Western Australia. It's often used in the context of Australian geography, history, or travel.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I live in Fremantle's.","correct":"✓ I live in Fremantle.","note":"Fremantle is a proper noun and doesn't typically take a possessive 's unless referring to something specifically owned by the city itself (e.g., Fremantle's city council)."},{"incorrect":"✗ Fremantle is a country.","correct":"✓ Fremantle is a city.","note":"Fremantle is a city, not a country."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_places":["Perth (nearby city)","Western Australia"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in contexts related to Australia.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"'Fremantle' is a place name. It is the name of a city in Western Australia. If you are talking about Australia, or reading about it, you might see this word. It is not a very common word unless you are talking about that specific place."},"example_sentences":[{"sentence":"The America's Cup was held in Fremantle in 1987.","translation":"1987年にアメリカズカップがフリーマントルで開催されました。","type":"general","meaning_category":"location"},{"sentence":"Many tourists visit the historic Fremantle Prison.","translation":"多くの観光客が歴史的なフリーマントル刑務所を訪れます。","type":"general","meaning_category":"location"}]}