{"word":"xenophilous","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"外国人好きの、外国文化を好む","english_definition":"Having or showing a fondness for foreigners or foreign things.","examples":[{"sentence":"The city has a xenophilous atmosphere, welcoming people from all over the world.","translation":"その都市は外国人好きの雰囲気があり、世界中からの人々を歓迎している。"},{"sentence":"She is a xenophilous traveler, always eager to explore new cultures.","translation":"彼女は外国人好きの旅行者で、常に新しい文化を探求することに熱心だ。"}],"collocations":["xenophilous attitude","xenophilous society","xenophilous policies"],"synonyms":["welcoming","accepting","open-minded","cosmopolitan"],"antonyms":["xenophobic","nationalistic","insular"]}],"etymology":{"value":"From Greek *xenos* (stranger, foreigner) + *philos* (loving).","priority":"★★★"},"pronunciation":{"ipa":"/zɛˈnɒfɪləs/","syllables":"ze-no-phi-lous"},"inflection":{"notes":"Comparative: more xenophilous, superlative: most xenophilous"},"usage_notes":{"explanation":"'Xenophilous' describes a person or entity that is positively inclined towards foreign people, cultures, or customs. It is the opposite of 'xenophobic,' which describes a fear or hatred of foreigners.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a xenophilous because he likes to travel.","correct":"✓ He is xenophilous because he likes to travel.","note":"'Xenophilous' is an adjective, not a noun. To describe a person, use 'He is a xenophile.'"},{"incorrect":"✗ The government is xenophilous to protect local businesses.","correct":"✓ The government is xenophobic to protect local businesses.","note":"Xenophilia is about liking foreign things, not protecting local interests."}],"priority":"★★☆"},"related_words":{"derivatives":["xenophile (noun): a person who is fond of foreign things","xenophilia (noun): fondness for foreign things"],"antonyms":["xenophobia (noun): fear or hatred of foreigners","xenophobic (adjective): showing a fear or hatred of foreigners"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Xenophilous' is a relatively uncommon word that describes someone who likes or is attracted to foreign people, cultures, or customs. It's the opposite of 'xenophobic,' which means fearing or hating foreigners. You might encounter this word in discussions about cultural exchange, immigration, or globalism."},"example_sentences":[{"sentence":"The museum's collection reflects the founder's xenophilous tastes.","translation":"その博物館のコレクションは、創設者の外国人好きの趣味を反映している。","type":"adjective","meaning_category":"foreign culture preference"},{"sentence":"As a xenophilous individual, she enjoyed learning new languages and customs.","translation":"外国人好きの個人として、彼女は新しい言語や習慣を学ぶことを楽しんだ。","type":"adjective","meaning_category":"fondness for foreigners"}]}