{"word":"roilier","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(historical) A member of a class of indentured servants in the French colonies, especially in the Caribbean, who were required to work for a certain number of years in exchange for passage and provisions.","english_definition":"(historical) A member of a class of indentured servants in the French colonies, especially in the Caribbean, who were required to work for a certain number of years in exchange for passage and provisions.","examples":[{"sentence":"Many roiliers were recruited from the poorer regions of France.","translation":"多くのロイリエはフランスの貧しい地域から募集された。"},{"sentence":"The roiliers' contracts often stipulated harsh working conditions.","translation":"ロイリエの契約には、しばしば過酷な労働条件が規定されていた。"}],"collocations":["roilier contract","become a roilier","French roilier system"],"synonyms":["indentured servant","engagé"],"antonyms":["free person","master"],"notes":"This term is specific to the historical context of French colonial indentured servitude."}],"etymology":{"value":"Derived from the French word 'rôle', meaning 'roll' or 'list', referring to the lists on which the names of these indentured servants were recorded.","priority":"★★☆"},"pronunciation":{"ipa":"/ʁwa.lje/","syllables":"roi-lier"},"inflection":{"noun_plural":"roiliers"},"usage_notes":{"explanation":"The term 'roilier' is primarily used in historical contexts when discussing the French colonial system of indentured labor. It's important to note that this system, while different from slavery, often involved harsh conditions and limited freedoms for the roiliers.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a roilier, so he was a slave.","correct":"✓ He was a roilier, an indentured servant, not a slave, although his conditions were often harsh.","note":"Roiliers were indentured servants, not slaves. While their conditions could be harsh, they were technically working under a contract for a limited time."}],"priority":"★☆☆"},"related_words":{"derivatives":["rôle (French word meaning 'roll' or 'list')","engagé (French term for indentured servant)"],"historical_terms":["indentured servitude","colonial labor systems"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - primarily used in historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'roilier' is a specialized historical term relating to French colonial history and the system of indentured servitude. Understanding its meaning requires familiarity with this specific historical context. The term is not commonly used in modern English outside of academic or historical discussions."},"example_sentences":[{"sentence":"The life of a roilier was often difficult and demanding.","translation":"ロイリエの生活はしばしば困難で要求の厳しいものだった。","type":"noun","meaning_category":"historical context"},{"sentence":"The French colonial administration regulated the contracts of the roiliers.","translation":"フランス植民地政庁はロイリエの契約を規制していた。","type":"noun","meaning_category":"historical context"}]}