{"word":"reconsolidated","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(記憶などが)再固定化された","english_definition":"Past tense and past participle of reconsolidate: to strengthen (a memory) again after it has been recalled.","examples":[{"sentence":"The memory was reconsolidated after each retrieval.","translation":"その記憶は、思い出すたびに再固定化された。"},{"sentence":"The patient's fear response was reconsolidated during therapy.","translation":"患者の恐怖反応は、治療中に再固定化された。"}],"collocations":["reconsolidated memory","reconsolidated fear response"],"synonyms":["restrengthened","reinforced","re-established"],"antonyms":["destabilized","weakened","erased"]}],"etymology":{"value":"The word 'reconsolidated' is formed by adding the prefix 're-' (meaning 'again') to the word 'consolidated'. 'Consolidated' comes from the Latin word 'consolidare', meaning 'to make firm or solid'. Therefore, 'reconsolidated' means to make something firm or solid again.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːkənˈsɒlɪdeɪtɪd/","syllables":"re-con-sol-i-dat-ed"},"inflection":{"verb_forms":{"present_simple":["reconsolidate","reconsolidates"],"past_simple":"reconsolidated","past_participle":"reconsolidated","present_participle":"reconsolidating"}},"usage_notes":{"explanation":"'Reconsolidated' is primarily used in the context of memory and learning. It refers to the process by which a memory, after being recalled, becomes stable again. This process is important for maintaining long-term memories, but it can also be a window for modifying or even erasing unwanted memories.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building was reconsolidated after the earthquake.","correct":"✓ The building was rebuilt after the earthquake.","note":"'Reconsolidated' is typically used for abstract concepts like memories, not physical structures. Use 'rebuilt' or 'reconstructed' for buildings."},{"incorrect":"✗ He reconsolidated his position in the company by working hard.","correct":"✓ He strengthened his position in the company by working hard.","note":"While you could theoretically use 'reconsolidated' metaphorically, it's best to stick to more common terms like 'strengthened' or 'reinforced' when referring to someone's position."}],"priority":"★★☆"},"related_words":{"derivatives":["reconsolidation (noun)","consolidate (verb)","consolidation (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"reconsolidated\" is a specialized term primarily used in the field of memory research and cognitive psychology. It describes the process where a memory, once recalled, undergoes a period of instability and then is restabilized or strengthened again. This term is not commonly used in everyday conversation and is more likely to be encountered in academic or scientific contexts related to memory and learning. Understanding the concept of memory reconsolidation requires some background knowledge in cognitive science."},"example_sentences":[{"sentence":"The researchers found that the fear memory was successfully reconsolidated with a weaker emotional response.","translation":"研究者たちは、恐怖記憶がより弱い感情反応で再固定化されることに成功したことを発見した。","type":"verb","meaning_category":"再固定化された"},{"sentence":"During sleep, the learned information is reconsolidated, making it easier to recall later.","translation":"睡眠中、学習した情報は再固定化され、後で思い出しやすくなる。","type":"verb","meaning_category":"再固定化された"},{"sentence":"The therapy aimed to disrupt the reconsolidation of traumatic memories.","translation":"その治療は、トラウマ記憶の再固定化を妨げることを目的としていた。","type":"verb","meaning_category":"再固定化された"}]}