{"word":"pseudocourteous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"見せかけの礼儀正しい、偽の丁寧さを示す","english_definition":"Marked by a false or artificial politeness; superficially courteous.","examples":[{"sentence":"His pseudocourteous manner hid his true intentions.","translation":"彼の見せかけの礼儀正しい態度は、彼の本当の意図を隠していた。"},{"sentence":"The sales representative's pseudocourteous approach felt insincere.","translation":"その販売員の偽の丁寧な態度は、誠実さに欠けているように感じられた。"}],"collocations":["pseudocourteous behavior","pseudocourteous manner","pseudocourteous smile","pseudocourteous tone"],"synonyms":["insincere","artificial","affected","superficial","feigned","false","mock-polite"],"antonyms":["sincere","genuine","authentic","heartfelt","true","unaffected"]}],"etymology":{"value":"\"pseudo-\" (偽の) + \"courteous\" (礼儀正しい)","priority":"★★★"},"pronunciation":{"ipa":"/ˌsjuːdoʊˈkɜːrtiəs/","syllables":"pseu-do-cour-te-ous"},"inflection":{},"usage_notes":{"explanation":"\"Pseudocourteous\" describes behavior or language that appears polite on the surface but lacks genuine sincerity. It suggests that the politeness is a facade, often used to manipulate or conceal true feelings. The term implies a critical judgment of the person's motives.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was pseudocourteous with his friends.","correct":"✓ He was pseudocourteous to his rivals.","note":"The word is usually used when the courtesy is unexpected or seems out of place, often towards someone who is not a friend."}],"priority":"★★★"},"related_words":{"derivatives":["pseudocourtesy (noun)"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"pseudocourteous\" is a relatively uncommon word used to describe behavior that appears polite but is not sincere. It is formed by combining \"pseudo-\" (meaning false or fake) with \"courteous\" (meaning polite). The word is typically used in formal writing or speech to express disapproval of someone's insincere politeness. Understanding the word requires a good vocabulary and an understanding of the nuances of social behavior."},"example_sentences":[{"sentence":"The politician's pseudocourteous remarks during the debate failed to impress the audience.","translation":"討論会での政治家の見せかけの礼儀正しい発言は、聴衆に感銘を与えることができなかった。","type":"general","meaning_category":"general"},{"sentence":"Despite his pseudocourteous greeting, I sensed a hint of hostility in his eyes.","translation":"彼の見せかけの礼儀正しい挨拶にもかかわらず、彼の目に敵意の兆候を感じた。","type":"general","meaning_category":"general"}]}