{"word":"Undescriptive","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"記述的でない、描写力に欠ける、説明不足の","english_definition":"Not descriptive; lacking in detail or vividness.","examples":[{"sentence":"The report was undescriptive and failed to provide a clear picture of the situation.","translation":"その報告書は記述的でなく、状況を明確に描写していなかった。"},{"sentence":"His writing style is undescriptive, making it difficult to visualize the scenes.","translation":"彼の文体は描写力に欠けており、場面を想像するのが難しい。"},{"sentence":"The witness's account was undescriptive and offered little help to the investigation.","translation":"目撃者の証言は説明不足で、捜査の役に立たなかった。"}],"collocations":["undescriptive language (描写力に欠ける言葉)","undescriptive report (説明不足の報告書)","undescriptive account (説明不足の証言)","undescriptive style (描写力に欠ける文体)"],"synonyms":["vague","general","imprecise","indefinite","lacking detail","unclear","non-descriptive"],"antonyms":["descriptive","detailed","vivid","explicit","graphic","clear"]},{"part_of_speech":"adjective","definition":"特徴のない、個性のない","english_definition":"Lacking distinctive qualities or features; unremarkable.","examples":[{"sentence":"The building's architecture was undescriptive and blended into the surrounding landscape.","translation":"その建物の建築は特徴がなく、周囲の景観に溶け込んでいた。"},{"sentence":"The music was undescriptive and failed to evoke any particular emotion.","translation":"その音楽は個性がなく、特定の感情を呼び起こすことができなかった。"}],"collocations":["undescriptive architecture (特徴のない建築)","undescriptive music (個性のない音楽)","undescriptive appearance (特徴のない外観)"],"synonyms":["unremarkable","ordinary","commonplace","bland","featureless","nondescript","uninspired"],"antonyms":["distinctive","remarkable","unique","original","inspired","characteristic"]}],"etymology":{"value":"\"Un-\" (否定) + \"descriptive\" (記述的な)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndɪˈskrɪptɪv/","syllables":"un-de-scrip-tive"},"inflection":{"adjective_forms":{"comparative":"more undescriptive","superlative":"most undescriptive"}},"usage_notes":{"explanation":"\"Undescriptive\" is used to describe something that lacks detail, vividness, or distinctive qualities. It can refer to writing, speech, art, or even physical appearances. The word implies a lack of clarity or memorability due to the absence of specific or interesting details.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The book was very undescriptive, I couldn't understand anything.","correct":"✓ The book was so undescriptive, I couldn't understand anything.","note":"While \"very\" can be used with many adjectives, \"so\" is often a stronger and more natural fit when emphasizing the degree to which something is undescriptive. Alternatively, you could rephrase the sentence to use a different adjective, such as \"The book was very vague...\""},{"incorrect":"✗ The painting was undescriptive because it had no colors.","correct":"✓ The painting was undescriptive because it lacked detail and emotion.","note":"While color can contribute to descriptiveness, the absence of color alone doesn't necessarily make something undescriptive. Descriptiveness is more about the level of detail and the ability to evoke a clear image or feeling."}],"priority":"★★☆"},"related_words":{"derivatives":["undescriptiveness (名詞: 記述的でないこと、描写力に欠けること)"],"antonyms":["descriptive","detailed","vivid","expressive"],"related_concepts":["vagueness","ambiguity","abstraction","generalization","simplification"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Undescriptive\" is a relatively uncommon word used to describe something that lacks detail or vividness. It suggests that something fails to create a clear or memorable impression due to a lack of specific information or interesting qualities. The word is often used in contexts related to writing, art, or communication where detailed descriptions are expected. Understanding this word requires a good vocabulary and the ability to recognize subtle nuances in meaning.","example_sentences":[{"sentence":"The witness gave an undescriptive account of the events, making it difficult for the police to identify the suspect.","translation":"目撃者は事件について説明不足の証言をしたため、警察が容疑者を特定するのは困難だった。","type":"general"},{"sentence":"The architect's plans were undescriptive, failing to convey the building's intended aesthetic.","translation":"建築家の計画は説明不足で、建物の意図された美学を伝えることができなかった。","type":"specific"}]}}