{"word":"pharmacopoeist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"薬剤師、薬局経営者","english_definition":"A person skilled in pharmacy; a pharmacist or druggist.","examples":[{"sentence":"The pharmacopoeist carefully measured the ingredients for the prescription.","translation":"薬剤師は処方箋の材料を注意深く計量した。"},{"sentence":"The local pharmacopoeist was known for his knowledge of herbal remedies.","translation":"地元の薬剤師は、薬草療法に関する知識で知られていた。"}],"collocations":["qualified pharmacopoeist","local pharmacopoeist","chief pharmacopoeist"],"synonyms":["pharmacist","apothecary","druggist","chemist (mainly British)"],"antonyms":[]}],"etymology":{"value":"Derived from 'pharmacopoeia' (a book containing a list of medicinal drugs with their effects and directions for their use) + '-ist' (a suffix denoting a person skilled in or concerned with something). 'Pharmacopoeia' comes from Late Latin, from Greek 'pharmakopoios' (drug-making), from 'pharmakon' (drug, poison) + 'poiein' (to make).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɑːrməkəˈpiːɪst/","syllables":"phar-ma-co-poe-ist"},"inflection":{"noun_plural":"pharmacopoeists"},"usage_notes":{"explanation":"The term 'pharmacopoeist' is somewhat archaic and less commonly used than 'pharmacist' or 'druggist' in modern English. It specifically refers to a person skilled in the preparation and dispensing of drugs, often with a deep understanding of the pharmacopoeia (the official book of drug standards).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to see a pharmacopoeist to get my medicine.","correct":"✓ I need to see a pharmacist to get my medicine.","note":"'Pharmacist' is the more common and widely understood term in modern English."}],"priority":"★☆☆"},"related_words":{"derivatives":["pharmacy","pharmacopoeia","pharmaceutical","pharmacist"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - The term is rarely used in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'pharmacopoeist' is a formal and somewhat outdated term for a pharmacist. It refers to someone who is skilled in preparing and dispensing medicines, often with a deep knowledge of the pharmacopoeia, which is an official book of drug standards. This word is not commonly used in everyday conversation; 'pharmacist' is the more common and widely understood term."},"example_sentences":[{"sentence":"The old pharmacopoeist had a vast knowledge of traditional remedies.","translation":"その年老いた薬剤師は、伝統的な治療法に関する幅広い知識を持っていた。","type":"noun","meaning_category":"薬剤師"},{"sentence":"A qualified pharmacopoeist is essential for dispensing prescription medications safely.","translation":"資格のある薬剤師は、処方薬を安全に調剤するために不可欠である。","type":"noun","meaning_category":"薬剤師"}]}