{"word":"ultramicroscope","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"超顕微鏡、限外顕微鏡","english_definition":"A microscope that uses the Tyndall effect to make visible particles that are too small to be seen with an ordinary microscope.","examples":[{"sentence":"An ultramicroscope is used to observe particles smaller than the wavelength of light.","translation":"超顕微鏡は、光の波長よりも小さい粒子を観察するために使用されます。"},{"sentence":"The ultramicroscope allows for the visualization of colloidal particles.","translation":"超顕微鏡は、コロイド粒子の可視化を可能にします。"}],"collocations":["use an ultramicroscope","observe with an ultramicroscope","colloidal particles ultramicroscope"],"synonyms":["dark-field microscope"],"antonyms":[]}],"etymology":{"value":"'Ultra-' (beyond) + 'microscope'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌltrəˈmaɪkrəˌskoʊp/","syllables":"ul-tra-mi-cro-scope"},"inflection":{"noun_plural":"ultramicroscopes"},"usage_notes":{"explanation":"An ultramicroscope is a type of microscope that uses the Tyndall effect to visualize particles too small to be seen with a regular microscope. It illuminates the sample from the side, so only light scattered by the particles is visible.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a normal microscope to see the colloid.","correct":"✓ I used an ultramicroscope to see the colloid.","note":"Colloids are very small, so you need an ultramicroscope to see them."}],"priority":"★★☆"},"related_words":{"derivatives":["ultramicroscopy"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'ultramicroscope' refers to a specialized type of microscope used to view extremely small particles, often smaller than the wavelength of visible light. It works by illuminating the sample from the side and observing the scattered light, a technique known as dark-field microscopy. This allows for the visualization of particles that would otherwise be invisible under a standard microscope."},"example_sentences":[{"sentence":"The scientist used an ultramicroscope to study the movement of nanoparticles in the solution.","translation":"科学者は超顕微鏡を使って、溶液中のナノ粒子の動きを研究しました。","type":"general","meaning_category":"scientific research"},{"sentence":"With the ultramicroscope, we can observe the Brownian motion of the colloidal particles.","translation":"超顕微鏡を使うと、コロイド粒子のブラウン運動を観察できます。","type":"specific","meaning_category":"scientific observation"}]}