{"word":"orthometry","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"正射影法、直投影法","english_definition":"The art or practice of making a correct metrical survey or map; specifically, the art of representing elevations of objects by perpendicular lines on a geometrical plane.","examples":[{"sentence":"Orthometry is used in architectural drawings to represent the true height of buildings.","translation":"正射影法は、建築図面で建物の真の高さを表現するために使用されます。"}],"collocations":["architectural orthometry","survey orthometry"],"synonyms":["orthogonal projection","direct projection"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'orthos' (straight, right) and 'metron' (measure).","priority":"★★☆"},"pronunciation":{"ipa":"/ɔːrˈθɒmɪtri/","syllables":"or-thom-e-try"},"inflection":{"noun_plural":"orthometries"},"usage_notes":{"explanation":"Orthometry is a technical term primarily used in fields like surveying, architecture, and engineering. It refers to a method of representing three-dimensional objects or landscapes in two dimensions while preserving accurate measurements.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Orthometry is the same as perspective drawing.","correct":"✓ Orthometry differs from perspective drawing in that it preserves true measurements.","note":"Orthometry preserves true measurements, while perspective drawing creates a realistic visual representation that includes foreshortening."}],"priority":"★☆☆"},"related_words":{"derivatives":["orthometric (adjective)"],"related_terms":["orthographic projection","isometric projection","perspective projection"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Orthometry is a specialized term used in technical fields. Understanding it requires familiarity with concepts in geometry and spatial representation. It's not commonly used in everyday language."},"example_sentences":[{"sentence":"The surveyor used orthometry to create an accurate map of the terrain.","translation":"測量技師は正射影法を使用して、地形の正確な地図を作成しました。","type":"technical","meaning_category":"正射影法"},{"sentence":"Architects rely on orthometry to ensure precise measurements in building plans.","translation":"建築家は、建築計画の正確な寸法を確保するために正射影法に頼っています。","type":"technical","meaning_category":"正射影法"}]}