{"word":"Dismarketing","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(マーケティング)ディマーケティング：特定の製品、サービス、ブランドに対する需要を一時的または永続的に減らすことを目的としたマーケティング戦略","english_definition":"A marketing strategy aimed at reducing demand for a product, service, or brand, either temporarily or permanently.","examples":[{"sentence":"The company used dismarketing to reduce demand for their oversubscribed service.","translation":"その会社は、申し込みが殺到しているサービスの需要を減らすために、ディマーケティング戦略を用いた。"},{"sentence":"Dismarketing can be used to manage demand during peak seasons.","translation":"ディマーケティングは、繁忙期の需要を管理するために利用できる。"},{"sentence":"Ethical concerns can lead a company to engage in dismarketing of harmful products.","translation":"倫理的な懸念から、企業は有害な製品のディマーケティングに取り組むことがある。"}],"collocations":["implement dismarketing","use dismarketing strategies","apply dismarketing techniques","dismarketing campaign","dismarketing strategy"],"synonyms":["demand reduction","de-selling","selective marketing"],"antonyms":["marketing","promotion","advertising"]}],"etymology":{"value":"「dis-」(否定を表す接頭辞) + 「marketing」から構成される。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɪsˈmɑːrkɪtɪŋ/","syllables":"dis-mar-ket-ing"},"inflection":{"noun_plural":"Dismarketings"},"usage_notes":{"explanation":"Dismarketing is often employed when demand exceeds supply, when a product is harmful, or when a company wants to reposition a brand. It can involve raising prices, reducing advertising, or discouraging consumption. It's the opposite of traditional marketing, which aims to increase demand.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ We are doing marketing to reduce sales.","correct":"✓ We are using dismarketing to reduce sales.","note":"Using 'marketing' to describe reducing sales is confusing. 'Dismarketing' is the correct term."}],"priority":"★★☆"},"related_words":{"derivatives":["dismarket (verb)"],"related_terms":["demarketing","counter-marketing","unmarketing"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dismarketing' is a specialized term in marketing. It refers to strategies used to decrease the demand for a product or service. This is often done when a company can't meet the current demand, or when they want to discourage the use of a product for ethical reasons. It's the opposite of regular marketing, which tries to increase demand."},"example_sentences":[{"sentence":"The national park implemented dismarketing to reduce the number of visitors during the summer.","translation":"国立公園は、夏季の訪問者数を減らすためにディマーケティングを実施した。","type":"example","meaning_category":"Demand Reduction"},{"sentence":"Due to production issues, the company decided to use dismarketing temporarily.","translation":"生産上の問題から、会社は一時的にディマーケティングを行うことを決定した。","type":"example","meaning_category":"Temporary Demand Management"},{"sentence":"The government used dismarketing to discourage smoking.","translation":"政府は喫煙を抑制するためにディマーケティングを行った。","type":"example","meaning_category":"Ethical Concerns"}]}