{"word":"thermolabile","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"熱に不安定な、熱によって変性しやすい","english_definition":"Sensitive to heat; easily denatured or destroyed by heat.","examples":[{"sentence":"The enzyme is thermolabile and must be stored at low temperatures.","translation":"その酵素は熱に不安定なので、低温で保存しなければならない。"},{"sentence":"Thermolabile toxins are easily destroyed by cooking.","translation":"熱に不安定な毒素は、調理によって容易に破壊される。"}],"collocations":["thermolabile enzyme","thermolabile toxin","thermolabile protein"],"synonyms":["heat-sensitive","heat-labile"],"antonyms":["thermostable","heat-resistant"]},{"part_of_speech":"noun","definition":"熱不安定性物質","english_definition":"A substance that is sensitive to heat.","examples":[{"sentence":"The thermolabile must be stored in a freezer to prevent degradation.","translation":"熱不安定性物質は、分解を防ぐために冷凍庫に保管する必要がある。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From 'thermo-' (heat) + 'labile' (liable to change or break down).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌθɜːrmoʊˈleɪbaɪl/","syllables":"ther-mo-la-bile"},"inflection":{"notes":"Adjective: thermolabile (comparative/superlative forms are not commonly used). Noun: thermolabiles"},"usage_notes":{"explanation":"'Thermolabile' describes substances, especially biological molecules like enzymes and proteins, that are easily altered or destroyed by heat. It is often used in scientific and medical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The thermolabile was heated to 100 degrees Celsius.","correct":"✓ The thermolabile substance was heated to 100 degrees Celsius.","note":"'Thermolabile' is an adjective, so it needs to modify a noun. Using 'thermolabile' alone as a noun is less common and requires context. Using 'thermolabile substance' is more precise."}],"priority":"★★☆"},"related_words":{"derivatives":["thermolability (noun: the state of being thermolabile)"],"phrasal_verbs":[],"related_terms":["thermostable (heat-stable)","heat-labile (synonym for thermolabile)","denaturation (the process of a protein losing its structure due to heat or other factors)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Thermolabile' is a scientific term that describes something that is easily changed or destroyed by heat. It's often used to describe biological substances like enzymes or proteins. If something is thermolabile, it means you need to be careful about exposing it to high temperatures.","priority":"★★☆"},"example_sentences":[{"sentence":"Many vaccines contain thermolabile components that require careful handling.","translation":"多くのワクチンには、取り扱いに注意が必要な熱に不安定な成分が含まれている。","type":"adjective","meaning_category":"熱に不安定な"},{"sentence":"The researcher studied the effects of temperature on the thermolabile protein.","translation":"研究者は、熱に不安定なタンパク質に対する温度の影響を研究した。","type":"adjective","meaning_category":"熱によって変性しやすい"}]}