{"word":"over-emotionalize","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vi","definition":"感情的になりすぎる、感情過多になる","english_definition":"To react to something in an excessively emotional way; to make something seem more emotional than it is.","examples":[{"sentence":"She tends to over-emotionalize situations, which can be exhausting for others.","translation":"彼女は状況を感情的に捉えすぎる傾向があり、周りの人を疲れさせてしまうことがある。"},{"sentence":"Don't over-emotionalize the problem; let's look at it logically.","translation":"問題を感情的に捉えすぎないで、論理的に見てみましょう。"},{"sentence":"He accused her of over-emotionalizing the issue to gain sympathy.","translation":"彼は彼女が同情を得るために問題を感情的に誇張していると非難した。"}],"collocations":["over-emotionalize a situation","over-emotionalize a response","tend to over-emotionalize","accused of over-emotionalizing"],"synonyms":["exaggerate","dramatize","overreact","sensationalize"],"antonyms":["understate","minimize","rationalize"]}],"etymology":{"value":"Derived from \"emotionalize\" (to make emotional) with the prefix \"over-\" (excessively).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊvərɪˈmoʊʃənəˌlaɪz/","syllables":"o-ver-e-mo-tion-a-lize"},"inflection":{"verb_forms":{"present_simple":["over-emotionalize","over-emotionalizes"],"past_simple":"over-emotionalized","past_participle":"over-emotionalized","present_participle":"over-emotionalizing"}},"usage_notes":{"explanation":"\"Over-emotionalize\" implies an excessive or inappropriate display of emotion, often to the point where it becomes detrimental or manipulative. It suggests a lack of rational perspective and an exaggeration of feelings. It is often used in a critical or disapproving context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is over-emotionalized.","correct":"✓ She over-emotionalizes.","note":"When describing a tendency or habit, use the present simple tense: \"She over-emotionalizes.\" The past participle \"over-emotionalized\" is used to describe something that has already happened or been made emotional."},{"incorrect":"✗ Don't over emotionalize.","correct":"✓ Don't over-emotionalize.","note":"The word is one word, not two."}],"priority":"★★☆"},"related_words":{"derivatives":["over-emotionalization (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Over-emotionalize\" is a relatively uncommon word that means to react to something in an excessively emotional way. It suggests that someone is making something seem more emotional than it actually is, or that they are displaying emotions inappropriately. This word is often used in discussions about communication, psychology, or conflict resolution, where the balance between rational thinking and emotional response is important. Because it's not a frequently used term, it is more appropriate for advanced learners of English."},"example_sentences":[{"sentence":"The media often over-emotionalizes stories to attract viewers.","translation":"メディアは視聴者を引きつけるために、物語を感情的に誇張することがよくある。","type":"verb","meaning_category":"感情的に誇張する"},{"sentence":"It's important not to over-emotionalize when making important decisions.","translation":"重要な決断をする際には、感情的になりすぎないことが重要だ。","type":"verb","meaning_category":"感情的になりすぎる"},{"sentence":"He accused her of over-emotionalizing the situation to manipulate him.","translation":"彼は彼女が自分を操るために状況を感情的に誇張していると非難した。","type":"verb","meaning_category":"感情的に誇張する"}]}