{"word":"supineness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"仰臥、仰向けであること","english_definition":"The state of being supine; lying on the back or having the face upward.","examples":[{"sentence":"The doctor positioned the patient with supineness for the examination.","translation":"医者は診察のために患者を仰臥位にした。"}],"collocations":["supineness position"],"synonyms":["recumbency","repose"],"antonyms":["proneness"]},{"part_of_speech":"noun","definition":"無気力、怠惰、無関心","english_definition":"Passivity; inactivity; indolence; apathy; indifference.","examples":[{"sentence":"The government's supineness in addressing the crisis led to widespread criticism.","translation":"政府の危機への無気力な対応は広範囲な批判を招いた。"},{"sentence":"His supineness towards his studies resulted in poor grades.","translation":"彼の学業に対する無気力さが低い成績につながった。"}],"collocations":["political supineness","moral supineness"],"synonyms":["lethargy","inertia","passivity","indolence","apathy"],"antonyms":["activity","energy","zeal"]}],"etymology":{"value":"Derived from 'supine', which comes from the Latin word 'supinus', meaning 'lying on the back'. The sense of 'indifference' or 'passivity' developed from the idea of someone being inactive or unconcerned, as if lying down and doing nothing.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsuːpaɪnˌnɛs/","syllables":"su-pine-ness"},"inflection":{"noun_plural":"supinenesses"},"usage_notes":{"explanation":"'Supineness' has two main senses: a literal physical position (lying on the back) and a figurative sense referring to a lack of energy, interest, or action. The figurative sense is more commonly used in contemporary English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed supineness by actively participating in the protest.","correct":"✓ He showed supineness by remaining silent during the protest.","note":"'Supineness' implies a lack of action or involvement, not active participation."}],"priority":"★★☆"},"related_words":{"derivatives":["supine (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Supineness' is a relatively uncommon word that describes a state of being either physically lying on one's back or, more often, characterized by passivity, indifference, or a lack of energy. It's often used in formal or academic contexts to critique a lack of action or concern in response to a problem or situation."},"example_sentences":[{"sentence":"The patient was placed in a position of supineness for the surgery.","translation":"患者は手術のために仰臥位にされた。","type":"noun","meaning_category":"仰臥"},{"sentence":"The public criticized the government's supineness in dealing with the economic crisis.","translation":"国民は経済危機への対処における政府の無気力さを批判した。","type":"noun","meaning_category":"無気力"}]}