{"word":"nondemonstrability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"証明不能性、非演繹性","english_definition":"The quality or state of being impossible to demonstrate or prove.","examples":[{"sentence":"The nondemonstrability of Gödel's incompleteness theorems has profound implications for the limits of mathematical knowledge.","translation":"ゲーデルの不完全性定理の証明不能性は、数学的知識の限界に深刻な影響を与えます。"},{"sentence":"The nondemonstrability of certain philosophical claims is often a point of contention.","translation":"特定の哲学的命題の証明不能性は、しばしば議論の的となります。"}],"collocations":["mathematical nondemonstrability","philosophical nondemonstrability"],"synonyms":["unprovability","untestability","indemonstrability"],"antonyms":["demonstrability","provability","testability"]}],"etymology":{"value":"Formed from \"non-\" (not) + \"demonstrability\" (the ability to be demonstrated), which in turn comes from \"demonstrate\" (to show clearly) + \"-ability\" (suffix indicating capability).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˌdɛmənstrəˈbɪləti/","syllables":"non-de-mon-stra-bil-i-ty"},"inflection":{"noun_plural":"nondemonstrabilities"},"usage_notes":{"explanation":"\"Nondemonstrability\" refers specifically to the inability to prove something using logical or empirical methods. It is often used in formal contexts such as mathematics, logic, and philosophy. It indicates that a statement or concept cannot be shown to be true based on existing rules or evidence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nondemonstrability was a surprise.","correct":"✓ The nondemonstrability of the theorem was a surprise.","note":"It's better to specify what exactly is nondemonstrable. Use the noun with a specific subject or context for clarity."}],"priority":"★★☆"},"related_words":{"derivatives":["nondemonstrable (adjective)"],"related_terms":["demonstrability","demonstrate","proof","theorem","axiom"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Primarily used in academic or technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Nondemonstrability\" is a complex term used in fields like mathematics, logic, and philosophy. It describes the state of something that cannot be proven or demonstrated to be true using established methods or evidence. Understanding this term requires familiarity with formal reasoning and abstract concepts. It's not commonly used in everyday language.","priority":"★☆☆"},"example_sentences":[{"sentence":"The scientist addressed the nondemonstrability of the hypothesis with current technology.","translation":"科学者は、現在の技術ではその仮説が証明できないという問題に取り組んだ。","type":"general","meaning_category":"general"},{"sentence":"The philosopher argued for the inherent nondemonstrability of moral truths.","translation":"その哲学者は、道徳的真理には本質的に証明不能性があると主張した。","type":"specific","meaning_category":"philosophy"}]}