{"word":"parenchyma","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"柔組織 (植物学); 実質組織 (動物学)","english_definition":"(Botany) The fundamental tissue of plants, composed of thin-walled cells capable of division; (Zoology) The functional tissue of an organ as distinguished from the connective and supporting tissue.","examples":[{"sentence":"Parenchyma cells are responsible for photosynthesis and storage in plants.","translation":"柔組織細胞は植物における光合成と貯蔵を担う。"},{"sentence":"Damage to the parenchyma of the liver can lead to serious health problems.","translation":"肝臓の実質組織への損傷は深刻な健康問題につながる可能性がある。"}],"collocations":["parenchyma cell","liver parenchyma","lung parenchyma","renal parenchyma"],"synonyms":["ground tissue (botany)","functional tissue"],"antonyms":["sclerenchyma (botany)","stroma (zoology)"]},{"part_of_speech":"noun","definition":"(寄生虫学) 扁形動物の体腔を満たす細胞性組織","english_definition":"(Parasitology) The cellular tissue filling the body cavity of flatworms.","examples":[{"sentence":"The parenchyma of the planarian is composed of various cell types.","translation":"プラナリアの柔組織は様々な細胞型で構成されている。"}],"collocations":["planarian parenchyma"],"synonyms":["mesenchyme"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek παρεγχυμα (parenkhuma, “something poured in beside”), from παρα- (para-, “beside”) + ἔγχυμα (enkhuma, “infusion, juice”), from ἐν (en, “in”) + χυμός (khumos, “juice”). Originally referred to the supposedly nutritive substance filling the interstices of organs.","priority":"★★☆"},"pronunciation":{"ipa":"/pəˈrɛŋkɪmə/","syllables":"pa-ren-chy-ma"},"inflection":{"noun_plural":"parenchymas or parenchymae"},"usage_notes":{"explanation":"'Parenchyma' refers to the functional tissue of an organ or structure, as opposed to the supporting or connective tissues. In botany, it's the main tissue of plants, responsible for photosynthesis, storage, and other vital functions. In zoology, it refers to the functional tissue of organs like the liver or lungs. In parasitology, it describes the tissue filling the body cavity of flatworms.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The parenchyma is made of sclerenchyma cells.","correct":"✓ The parenchyma is made of parenchyma cells.","note":"Parenchyma is composed of parenchyma cells, not sclerenchyma cells (which are a different type of plant cell)."},{"incorrect":"✗ The stroma is the functional tissue of the liver.","correct":"✓ The parenchyma is the functional tissue of the liver.","note":"The parenchyma, not the stroma, is the functional tissue of an organ."}],"priority":"★★☆"},"related_words":{"derivatives":["parenchymal (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Parenchyma' is a technical term primarily used in biology, specifically in botany and zoology. In botany, it refers to the fundamental tissue of plants, responsible for functions like photosynthesis and storage. In zoology, it denotes the functional tissue of organs, as opposed to the supporting connective tissue. The word is also used in parasitology to describe the tissue filling the body cavity of flatworms. Understanding this term requires a background in biology or related fields."},"example_sentences":[{"sentence":"The leaf's **parenchyma** is rich in chloroplasts.","translation":"葉の柔組織は葉緑体が豊富である。","type":"noun","meaning_category":"botany"},{"sentence":"Cirrhosis damages the liver's **parenchyma**.","translation":"肝硬変は肝臓の実質組織を損傷する。","type":"noun","meaning_category":"zoology"},{"sentence":"The **parenchyma** of the flatworm provides structural support.","translation":"扁形動物の柔組織は構造的な支持を提供する。","type":"noun","meaning_category":"parasitology"}]}