{"word":"devirgination","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"処女喪失、初めての性交","english_definition":"The act or process of depriving a woman of her virginity; the first act of sexual intercourse.","examples":[{"sentence":"Her devirgination was a significant event in her life.","translation":"彼女の処女喪失は彼女の人生における重要な出来事だった。"},{"sentence":"The novel explores the emotional impact of devirgination.","translation":"その小説は処女喪失の感情的な影響を探求している。"}],"collocations":["first devirgination","traumatic devirgination","forced devirgination"],"synonyms":["deflowerment","loss of virginity","first sexual experience"],"antonyms":["virginity","chastity"]}],"etymology":{"value":"Derived from the Latin word 'de-' (meaning 'from' or 'away') and 'virginare' (meaning 'to make a virgin'), combined with the suffix '-tion' (indicating an action or process).","priority":"★★☆"},"pronunciation":{"ipa":"/diˌvɜːrdʒɪˈneɪʃən/","syllables":"de-vir-gi-na-tion"},"inflection":{"noun_plural":"devirginations"},"usage_notes":{"explanation":"The term 'devirgination' is a formal and somewhat clinical term for the loss of virginity, specifically referring to a woman's first experience of sexual intercourse. It is not commonly used in everyday conversation and can be considered sensitive or even offensive depending on the context. More neutral terms like 'first sexual experience' are often preferred.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The devirgination was painful for him.","correct":"✓ The devirgination was painful for her.","note":"Devirgination specifically refers to the experience of a woman losing her virginity. While men also have a first sexual experience, this term is not typically applied to them."},{"incorrect":"✗ Devirgination is always a positive experience.","correct":"✓ Devirgination can be a complex and emotional experience, with both positive and negative aspects.","note":"The experience of devirgination can vary greatly from person to person and is not always positive. It's important to avoid making generalizations about it."}],"priority":"★☆☆"},"related_words":{"derivatives":["devirginate (verb): to deprive of virginity"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Devirgination' is a formal and uncommon term referring to the act of a woman losing her virginity through her first sexual intercourse. Due to its clinical and potentially sensitive nature, it's rarely used in everyday language. More neutral and less loaded phrases like 'first sexual experience' are generally preferred in contemporary discussions. Understanding its meaning is more relevant in specific contexts such as literature, medical discussions, or historical analyses where the term might be encountered.","priority":"★☆☆"},"example_sentences":[{"sentence":"The historical accounts often described devirgination as a rite of passage.","translation":"歴史的な記録では、処女喪失はしばしば通過儀礼として記述されていた。","type":"noun","meaning_category":"処女喪失"},{"sentence":"The film sensitively portrayed the protagonist's devirgination.","translation":"その映画は主人公の処女喪失を繊細に描いた。","type":"noun","meaning_category":"初めての性交"}]}