{"word":"aerobiotically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"好気的に、好気性条件下で","english_definition":"In an aerobic manner; in the presence of oxygen.","examples":[{"sentence":"The bacteria were grown aerobiotically in a nutrient-rich broth.","translation":"そのバクテリアは、栄養豊富な液体培地中で好気的に培養された。"},{"sentence":"The enzyme functions aerobiotically, requiring oxygen to catalyze the reaction.","translation":"その酵素は好気的に機能し、反応を触媒するために酸素を必要とする。"}],"collocations":["grow aerobiotically","function aerobiotically","metabolize aerobiotically","oxidize aerobiotically"],"synonyms":["in the presence of oxygen","using oxygen","with oxygen"],"antonyms":["anaerobically"]}],"etymology":{"value":"Formed from 'aerobic' (requiring oxygen) and '-ally' (forming adverbs).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛəroʊbaɪˈɒtɪkli/","syllables":"a-er-o-bi-ot-i-cal-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Aerobiotically' describes processes or conditions that occur in the presence of oxygen. It is commonly used in scientific and technical contexts, especially in biology, microbiology, and environmental science. It is the adverbial form of 'aerobic.'","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The process is aerobic, it happens aerobiotically.","correct":"✓ The process is aerobic; it happens aerobiotically.","note":"'Aerobic' is an adjective, while 'aerobiotically' is an adverb. Use the correct form to describe the process or the manner in which it occurs."}],"priority":"★★☆"},"related_words":{"derivatives":["aerobic (adjective)","aerobiosis (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'aerobiotically' is a technical term used to describe processes that occur in the presence of oxygen. It is primarily found in scientific or technical texts. Understanding the root word 'aerobic' (relating to or requiring oxygen) is helpful in deciphering its meaning. The suffix '-ally' turns it into an adverb, indicating the manner in which something is done."},"example_sentences":[{"sentence":"The yeast ferments the sugar anaerobically, but can also metabolize it aerobiotically if oxygen is available.","translation":"その酵母は糖を嫌気的に発酵させるが、酸素が利用可能であれば好気的にも代謝できる。","type":"adverb","meaning_category":"好気的に"},{"sentence":"The compost pile was turned regularly to ensure that the organic matter decomposed aerobiotically.","translation":"コンポストの山は、有機物が好気的に分解されるように定期的に攪拌された。","type":"adverb","meaning_category":"好気的に"}]}