{"word":"canceration","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"癌化、癌腫形成","english_definition":"The process of becoming cancerous; the formation of a cancer.","examples":[{"sentence":"The canceration of the tissue was observed under the microscope.","translation":"その組織の癌化が顕微鏡下で観察された。"},{"sentence":"Prolonged exposure to carcinogens can lead to canceration.","translation":"発癌物質への長期暴露は癌化につながる可能性がある。"}],"collocations":["canceration of tissue","canceration process"],"synonyms":["carcinogenesis","malignant transformation","oncogenesis"],"antonyms":["regression","remission"]}],"etymology":{"value":"Derived from 'cancer' (Latin for crab or creeping ulcer) and the suffix '-ation' (denoting a process or action).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkænsəˈreɪʃən/","syllables":"can-cer-a-tion"},"inflection":{"noun_plural":"cancerations"},"usage_notes":{"explanation":"'Canceration' specifically refers to the process by which normal cells transform into cancerous cells. It is a term often used in medical and scientific contexts. It is less commonly used in everyday language.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor discussed the patient's canceration options.","correct":"✓ The doctor discussed the patient's cancer treatment options.","note":"'Canceration' refers to the process of becoming cancerous, not the treatment options. Use 'cancer treatment' instead."},{"incorrect":"✗ The canceration was already in stage four.","correct":"✓ The cancer was already in stage four.","note":"Use 'cancer' to refer to the established disease state, not 'canceration' which is the process of becoming cancerous."}],"priority":"★★☆"},"related_words":{"derivatives":["cancer","carcinogen","carcinoma","oncology"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Canceration' is a highly technical term primarily used in medical and scientific literature. It describes the cellular and biological processes involved in the development of cancer. Due to its specialized nature, it is not commonly encountered in general English. Understanding requires knowledge of biology and medicine."},"example_sentences":[{"sentence":"The study investigated the mechanisms of canceration in epithelial cells.","translation":"その研究は上皮細胞における癌化のメカニズムを調査した。","type":"general","meaning_category":"癌化のメカニズム"},{"sentence":"Early detection can prevent the further canceration of affected tissues.","translation":"早期発見は、罹患組織のさらなる癌化を防ぐことができる。","type":"medical","meaning_category":"癌化の予防"}]}