{"word":"endoenteritis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"小腸の内膜の炎症","english_definition":"Inflammation of the inner lining of the small intestine.","examples":[{"sentence":"The patient was diagnosed with endoenteritis after experiencing severe abdominal pain and diarrhea.","translation":"患者は、激しい腹痛と下痢の症状を訴えた後、小腸炎と診断されました。"}],"collocations":["acute endoenteritis","chronic endoenteritis"],"synonyms":["enteritis","duodenitis","ileitis","jejunitis"],"antonyms":[]}],"etymology":{"value":"endo- (内側の) + enter- (腸) + -itis (炎症)","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛndoʊˌɛntəˈraɪtɪs/","syllables":"en-do-en-te-ri-tis"},"inflection":{"noun_plural":"endoenteritides (rare)"},"usage_notes":{"explanation":"Endoenteritis specifically refers to inflammation of the inner lining (mucosa) of the small intestine. It is often used interchangeably with enteritis, but enteritis can refer to inflammation of the entire small intestine or even the entire intestinal tract.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor prescribed antibiotics for the endoenteritis.","correct":"✓ The doctor prescribed antibiotics for the bacterial endoenteritis.","note":"While antibiotics are sometimes used, they are only effective against bacterial infections. Specifying the cause is important."}],"priority":"★★☆"},"related_words":{"derivatives":["enteritis","enteropathy"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Endoenteritis is a medical term referring to inflammation of the inner lining of the small intestine. Understanding this term requires knowledge of medical terminology, specifically the prefixes 'endo-' (meaning inner) and 'enter-' (referring to the intestine), as well as the suffix '-itis' (indicating inflammation). It is a relatively uncommon term used primarily in medical contexts."},"example_sentences":[{"sentence":"Endoenteritis can be caused by viral, bacterial, or parasitic infections.","translation":"小腸炎はウイルス、細菌、または寄生虫感染によって引き起こされる可能性があります。","type":"general","meaning_category":"causes"},{"sentence":"Symptoms of endoenteritis include abdominal pain, diarrhea, and vomiting.","translation":"小腸炎の症状には、腹痛、下痢、嘔吐などがあります。","type":"symptoms","meaning_category":"symptoms"},{"sentence":"Diagnosis of endoenteritis often involves stool tests and endoscopy.","translation":"小腸炎の診断には、しばしば便検査と内視鏡検査が含まれます。","type":"diagnosis","meaning_category":"diagnosis"}]}