{"word":"non-ego","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"非我、自我ならざるもの、自己以外のもの","english_definition":"That which is not the ego or self; anything external to oneself.","examples":[{"sentence":"The individual must distinguish between the ego and the non-ego to understand their place in the world.","translation":"個人は、世界における自身の位置を理解するために、自我と非我を区別しなければならない。"},{"sentence":"In philosophy, the non-ego is often used to describe the external world.","translation":"哲学において、非我はしばしば外部世界を記述するために用いられる。"}],"collocations":["ego and non-ego (自我と非我)","distinguish between ego and non-ego (自我と非我を区別する)"],"synonyms":["external world","other","outside world","not-self"],"antonyms":["ego","self"]},{"part_of_speech":"adjective","definition":"非自我の、自己以外の","english_definition":"Relating to or being that which is not the ego or self.","examples":[{"sentence":"The non-ego influences on behavior are often underestimated.","translation":"非自我的な行動への影響は、しばしば過小評価される。"},{"sentence":"He focused on the non-ego aspects of the experience.","translation":"彼はその経験の非自我的な側面に焦点を当てた。"}],"collocations":["non-ego influences (非自我的な影響)","non-ego aspects (非自我的な側面)"],"synonyms":["external","objective","other"],"antonyms":["egoistic","self-centered"]}],"etymology":{"value":"Formed from the prefix 'non-' (not) and 'ego' (the self).","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn ˈiːɡoʊ/","syllables":"non-e-go"},"inflection":{"noun_plural":"non-egos"},"usage_notes":{"explanation":"The term \"non-ego\" is primarily used in philosophy, psychology, and related fields to refer to anything that is not the self or ego. It represents the external world, other people, and anything that is perceived as separate from one's own identity. Understanding the distinction between the ego and the non-ego is crucial for developing a sense of self and navigating one's relationship with the world.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is very non-ego.","correct":"✓ He is not egoistic. / ✓ He is not self-centered.","note":"\"Non-ego\" is typically used as a noun or adjective to describe something that is not the self. To describe a person who lacks ego, use terms like \"not egoistic\" or \"not self-centered.\""}],"priority":"★★★"},"related_words":{"derivatives":["ego","egoism","egotism","alter ego"],"related_concepts":["subject-object duality","self-awareness","consciousness"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in academic and philosophical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'non-ego' is a philosophical concept referring to everything that is not the 'ego' or 'self.' It's used to distinguish between one's own identity and the external world. This term is more commonly found in academic and philosophical discussions rather than everyday conversation. Understanding this term requires familiarity with philosophical concepts related to self-awareness and consciousness."},"example_sentences":[{"sentence":"The philosopher explored the relationship between the ego and the non-ego in his latest work.","translation":"その哲学者は最新作で、自我と非我の関係を探求した。","type":"noun","meaning_category":"非我"},{"sentence":"The child gradually learns to differentiate between their own body and the non-ego environment.","translation":"子供は徐々に自分の体と非我的な環境を区別することを学ぶ。","type":"adjective","meaning_category":"非自我的な"}]}