{"word":"spondyloschisis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"脊椎分離症","english_definition":"A defect in the pars interarticularis of a vertebra, often leading to spondylolisthesis.","examples":[{"sentence":"Spondyloschisis is often diagnosed through X-rays or other imaging techniques.","translation":"脊椎分離症は、X線や他の画像診断技術を通じて診断されることが多いです。"},{"sentence":"Athletes involved in repetitive hyperextension of the spine are at higher risk of developing spondyloschisis.","translation":"脊椎の反復的な過伸展を伴うスポーツ選手は、脊椎分離症を発症するリスクが高くなります。"}],"collocations":["pars interarticularis","vertebra","spondylolisthesis","spinal defect","stress fracture"],"synonyms":["vertebral defect","pars defect","spinal fracture"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'spondylo' (vertebra), 'schisis' (split), and '-osis' (condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌspɒndɪloʊˈskɪsɪs/","syllables":"spon-dy-lo-schi-sis"},"inflection":{"noun_plural":"spondyloschises"},"usage_notes":{"explanation":"Spondyloschisis refers specifically to the defect or fracture in the pars interarticularis of a vertebra. It is a common cause of lower back pain, particularly in adolescents and athletes. The condition can sometimes lead to spondylolisthesis, where one vertebra slips forward on another.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Spondyloschisis is the same as scoliosis.","correct":"✓ Spondyloschisis is a defect in the pars interarticularis, while scoliosis is a curvature of the spine.","note":"Spondyloschisis and scoliosis are different spinal conditions. Spondyloschisis involves a defect in a specific part of the vertebra, while scoliosis is a lateral curvature of the spine."},{"incorrect":"✗ Spondyloschisis always requires surgery.","correct":"✓ Many cases of spondyloschisis can be managed with conservative treatments like physical therapy and bracing.","note":"Surgery is not always necessary for spondyloschisis. Conservative treatments are often effective, especially in the early stages."}],"priority":"★★☆"},"related_words":{"derivatives":["spondylolysis","spondylolisthesis","vertebra","vertebral"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Spondyloschisis' is a medical term referring to a specific defect in the spine. It's not commonly used in everyday language and is typically encountered in medical contexts or discussions about spinal conditions. Understanding this term requires some knowledge of anatomy and medical terminology."},"example_sentences":[{"sentence":"The MRI revealed a clear case of **spondyloschisis** in the L5 vertebra.","translation":"MRI検査により、L5椎骨に明らかな脊椎分離症の症例が認められました。","type":"noun","meaning_category":"脊椎分離症"},{"sentence":"Conservative treatment for **spondyloschisis** includes rest, pain management, and physical therapy.","translation":"脊椎分離症の保存的治療には、安静、疼痛管理、理学療法が含まれます。","type":"noun","meaning_category":"脊椎分離症"}]}