{"word":"undeprecatingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"控えめな態度をとらずに、自己卑下せずに","english_definition":"Without being self-deprecating; in a manner that is not modest or humble; without belittling oneself.","examples":[{"sentence":"She undeprecatingly accepted the award, acknowledging her hard work and dedication.","translation":"彼女は控えめな態度をとらずに賞を受け取り、自身の努力と献身を認めた。"},{"sentence":"He undeprecatingly presented his accomplishments to the board, confident in his abilities.","translation":"彼は自己卑下せずに自身の業績を役員会に提示し、自身の能力に自信を持っていた。"}],"collocations":["speak undeprecatingly","accept praise undeprecatingly","present oneself undeprecatingly"],"synonyms":["confidently","assertively","proudly","unassumingly","boldly"],"antonyms":["self-deprecatingly","modestly","humbly","demurely","timidly"]}],"etymology":{"value":"Derived from 'undeprecating', which is formed by adding the prefix 'un-' (not) to 'deprecating'. 'Deprecating' comes from the verb 'deprecate', meaning to express disapproval of or to belittle. The suffix '-ly' turns the adjective into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndɪˈprɛkeɪtɪŋli/","syllables":"un-di-prec-a-ting-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Undeprecatingly' describes an action or manner that lacks self-deprecation. It suggests a confident and unapologetic presentation of oneself or one's achievements, without any attempt to diminish or downplay them. The word implies a sense of self-assurance and a willingness to accept praise or recognition without false modesty.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She undeprecatingly apologized for her mistake.","correct":"✓ She apologized self-deprecatingly for her mistake.","note":"'Undeprecatingly' implies a lack of apology or self-belittlement. If someone is apologizing, 'self-deprecatingly' is more appropriate."},{"incorrect":"✗ The shy student undeprecatingly gave his presentation.","correct":"✓ The shy student confidently gave his presentation.","note":"'Undeprecatingly' suggests confidence and a lack of shyness. If the student is shy, a different adverb like 'confidently' might be more suitable to describe the action, or the sentence may need restructuring."}],"priority":"★★☆"},"related_words":{"derivatives":["undeprecating (adjective)","deprecatingly (adverb)","deprecate (verb)","deprecation (noun)"],"antonyms":["self-deprecatingly","modestly","humbly"],"synonyms":["confidently","assertively","proudly"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Undeprecatingly' is an advanced word that describes doing something without being self-deprecating or modest. It means to act confidently and without trying to make oneself seem less important or capable. This word is not commonly used and is suitable for advanced English speakers who want to express a nuanced sense of confidence and self-assurance."},"example_sentences":[{"sentence":"He undeprecatingly accepted the compliments on his performance.","translation":"彼は自分の演技に対する褒め言葉を控えめな態度をとらずに受け入れた。","type":"general","meaning_category":"acceptance"},{"sentence":"She undeprecatingly shared her accomplishments with the team, inspiring them with her success.","translation":"彼女はチームに自己卑下せずに自分の業績を共有し、その成功で彼らを鼓舞した。","type":"general","meaning_category":"sharing achievements"},{"sentence":"The artist undeprecatingly defended her unique style, refusing to conform to popular trends.","translation":"そのアーティストは自身のユニークなスタイルを控えめな態度をとらずに擁護し、流行に迎合することを拒否した。","type":"general","meaning_category":"defending style"}]}