{"word":"ataxiaphasia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"運動失調性失語","english_definition":"A type of aphasia characterized by impaired articulation and prosody due to motor control deficits, often associated with cerebellar damage.","examples":[{"sentence":"The patient exhibited ataxiaphasia, struggling to form words clearly.","translation":"患者は運動失調性失語を示し、言葉をはっきりと形成するのに苦労していた。"}],"collocations":["exhibit ataxiaphasia","diagnose ataxiaphasia","ataxiaphasia symptoms"],"synonyms":["motor aphasia","dysarthria","anarthria"],"antonyms":[]}],"etymology":{"value":"Derived from 'ataxia' (lack of coordination) + 'aphasia' (language impairment).","priority":"★★★"},"pronunciation":{"ipa":"/əˌtæksiəˈfeɪziə/","syllables":"a-tax-i-a-pha-si-a"},"inflection":{"noun_plural":"ataxiaphasias"},"usage_notes":{"explanation":"Ataxiaphasia is a specific type of aphasia primarily affecting the motor aspects of speech production. It's important to differentiate it from other types of aphasia that primarily affect language comprehension or formulation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has aphasia, so he must have ataxiaphasia.","correct":"✓ He has aphasia, but further testing is needed to determine if it's ataxiaphasia or another type.","note":"Aphasia is a general term, and ataxiaphasia is just one specific type. Not all aphasia is ataxiaphasia."}],"priority":"★★☆"},"related_words":{"derivatives":["ataxic (adjective)","aphasic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Ataxiaphasia' is a highly specialized term used in neurology and speech-language pathology. Understanding it requires knowledge of both motor control and language processing. It's not commonly encountered outside of medical or academic contexts."},"example_sentences":[{"sentence":"The speech therapist worked with the patient to improve articulation affected by ataxiaphasia.","translation":"言語聴覚士は、運動失調性失語によって影響を受けた構音の改善のために患者と協力した。","type":"general","meaning_category":"definition"}]}