{"word":"rewade","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"再び渉る、再び歩いて渡る","english_definition":"To wade again; to walk or proceed through again.","examples":[{"sentence":"They had to rewade the stream to get back to camp.","translation":"彼らはキャンプに戻るために再び小川を渉らなければならなかった。"},{"sentence":"After checking their gear, they decided to rewade the river.","translation":"装備を確認した後、彼らは再び川を歩いて渡ることに決めた。"}],"collocations":[],"synonyms":["re-cross","traverse again"],"antonyms":[]}],"etymology":{"value":"The word \"rewade\" is formed by adding the prefix \"re-\" (meaning \"again\" or \"anew\") to the word \"wade\" (meaning to walk through water or another liquid or soft substance).","priority":"★★★"},"pronunciation":{"ipa":"/riːˈweɪd/","syllables":"re-wade"},"inflection":{"verb_forms":{"present_simple":["rewade","rewades"],"past_simple":"rewaded","past_participle":"rewaded","present_participle":"rewading"}},"usage_notes":{"explanation":"\"Rewade\" is a relatively uncommon word. It specifically refers to the act of wading through something again, typically water. It's often used in contexts involving hiking, fishing, or other outdoor activities where crossing streams or shallow bodies of water is necessary.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["wade","wading"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"rewade\" is a niche term, primarily used in contexts related to outdoor activities like hiking or fishing, where one might need to cross a stream or shallow body of water more than once. Its meaning is straightforward, combining the idea of \"wading\" (walking through water) with the prefix \"re-\" (again). Due to its specific usage and relative rarity, it's not a word commonly encountered in everyday language, making it more appropriate for advanced learners or those with specific interests in related fields."},"example_sentences":[{"sentence":"The hikers decided to **rewade** the river rather than search for a bridge.","translation":"ハイカーたちは橋を探すよりも、再び川を渉ることに決めた。","type":"verb","meaning_category":"再び渉る"},{"sentence":"After realizing they had dropped a piece of equipment, they had to **rewade** the shallow stream to retrieve it.","translation":"装備の一部を落としたことに気づいた後、彼らはそれを回収するために再び浅い小川を渉らなければならなかった。","type":"verb","meaning_category":"再び渉る"}]}