{"word":"hookwormer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"駆虫薬、特に鉤虫駆除薬","english_definition":"A drug used to treat hookworm infection.","examples":[{"sentence":"The vet prescribed a hookwormer for the puppy.","translation":"獣医は子犬に鉤虫駆除薬を処方した。"},{"sentence":"Regular deworming with a hookwormer is important for pet health.","translation":"鉤虫駆除薬による定期的な駆虫は、ペットの健康にとって重要である。"}],"collocations":["administer a hookwormer","prescribe a hookwormer","hookwormer medication"],"synonyms":["anthelmintic","dewormer"],"antonyms":[]}],"etymology":{"value":"\"hookworm\"（鉤虫）+ \"-er\"（～するもの）","priority":"★★★"},"pronunciation":{"ipa":"/ˈhʊkwɜːrmər/","syllables":"hook-worm-er"},"inflection":{"noun_plural":"hookwormers"},"usage_notes":{"explanation":"\"Hookwormer\" is a specific type of dewormer used to treat hookworm infections, primarily in animals but also in humans. It's important to use the correct dosage and follow veterinary or medical advice when administering this medication.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need a hookwormer for my computer.","correct":"✓ I need a dewormer for my dog.","note":"Hookwormers are for treating parasitic infections, not computer problems."}],"priority":"★★☆"},"related_words":{"derivatives":["hookworm","dewormer","anthelmintic"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"hookwormer\" is a specialized term used in veterinary medicine and human medicine to refer to medications that specifically target and eliminate hookworm parasites. It is typically used by professionals in these fields or by individuals who are dealing with hookworm infections in themselves or their animals. Understanding this term requires some knowledge of parasitic infections and the medications used to treat them."},"example_sentences":[{"sentence":"The farmer gave his livestock a hookwormer to prevent infection.","translation":"農家は感染を防ぐために家畜に鉤虫駆除薬を与えた。","type":"noun","meaning_category":"駆虫薬"},{"sentence":"This hookwormer is effective against a broad range of intestinal parasites.","translation":"この鉤虫駆除薬は、広範囲の腸内寄生虫に効果がある。","type":"noun","meaning_category":"駆虫薬"}]}