{"word":"Homoeoplasy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"相同形質：異なる系統の生物において、独立に進化し、類似した形質や特徴が現れる現象。収斂進化や並行進化の結果として生じる。","english_definition":"The development of similar features independently in different lineages; a resemblance that is not due to common ancestry; often resulting from convergent or parallel evolution.","examples":[{"sentence":"The wings of bats and birds are an example of homoeoplasy, as they evolved independently for flight.","translation":"コウモリと鳥の翼は相同形質の例であり、飛行のために独立して進化した。"},{"sentence":"Eye structures in different species show homoeoplasy, reflecting similar environmental pressures.","translation":"異なる種における眼の構造は相同形質を示しており、類似した環境圧力を反映している。"}],"collocations":["convergent evolution","parallel evolution","analogous structures","independent evolution","morphological similarity"],"synonyms":["convergence","analogy","parallelism"],"antonyms":["homology"],"notes":"Homoeoplasy is often contrasted with homology, where similarities are due to shared ancestry.","usage":"Commonly used in evolutionary biology, phylogenetics, and comparative anatomy.","example_usage":"The presence of spines in cacti and some euphorbias is a classic example of homoeoplasy."}],"etymology":{"value":"Derived from the Greek words 'homoios' (similar) + 'plassein' (to mold or shape).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhoʊmioʊˈplæsi/","syllables":"ho-me-o-plas-y"},"inflection":{"noun_plural":"Homoeoplasies"},"related_words":{"related_terms":["homoplasy","convergence","parallelism","analogy","homologous","evolutionary biology","phylogenetics"],"notes":"Homoplasy is a broader term, while homoeoplasy is more specific, often emphasizing the independent origin of the similar traits."},"level_frequency":{"frequency_google_ngram":"Low frequency. Specialized term in biology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Homoeoplasy' is a technical term used in evolutionary biology to describe when different species independently evolve similar traits. This happens when they face similar environmental challenges. For example, wings in birds and insects are homoeoplastic because they evolved separately for flight, not because they inherited wings from a common ancestor."},"example_sentences":[{"sentence":"The streamlined body shape of dolphins and sharks is an instance of homoeoplasy driven by aquatic environments.","translation":"イルカとサメの流線型の体型は、水生環境によって引き起こされた相同形質の例である。","type":"scientific","meaning_category":"evolutionary biology"},{"sentence":"Distinguishing between homology and homoeoplasy is crucial for accurate phylogenetic analysis.","translation":"相同性と相同形質を区別することは、正確な系統解析にとって重要である。","type":"scientific","meaning_category":"phylogenetics"},{"sentence":"The evolution of camera eyes in vertebrates and cephalopods is a striking example of homoeoplasy.","translation":"脊椎動物と頭足類におけるカメラ眼の進化は、相同形質の顕著な例である。","type":"scientific","meaning_category":"evolutionary biology"}]}