{"word":"micropipette","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"微量ピペット、マイクロピペット","english_definition":"A very fine pipette used to measure or deliver very small quantities of liquid, typically in microliters.","examples":[{"sentence":"The researcher used a micropipette to transfer 10 microliters of the solution.","translation":"研究者はマイクロピペットを使って溶液10マイクロリットルを移した。"},{"sentence":"Micropipettes are essential tools in molecular biology labs.","translation":"マイクロピペットは分子生物学の研究室では不可欠な道具である。"}],"collocations":["use a micropipette (マイクロピペットを使う)","calibrate a micropipette (マイクロピペットを校正する)","set the volume of a micropipette (マイクロピペットの容量を設定する)","micropipette tip (マイクロピペットチップ)"],"synonyms":["pipette","transfer pipette","Pasteur pipette"],"antonyms":[]}],"etymology":{"value":"\"Micro-\" (very small) + \"pipette\" (a slender tube used for transferring or measuring small amounts of liquid).","priority":"★★★"},"pronunciation":{"ipa":"/ˌmaɪkroʊpaɪˈpɛt/","syllables":"mi-cro-pi-pette"},"inflection":{"noun_plural":"micropipettes"},"usage_notes":{"explanation":"A **micropipette** is a laboratory tool used to accurately measure and dispense very small volumes of liquid, typically in the microliter range (1 μL = 10⁻⁶ L). They are commonly used in biology, chemistry, and medical research. Micropipettes come in various types, including adjustable and fixed-volume models. It's crucial to use the correct technique and pipette tips to ensure accuracy and prevent contamination.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a micropipette to measure kilograms of the solution.","correct":"✓ I used a micropipette to measure microliters of the solution.","note":"Micropipettes are used for microliter volumes, not kilograms."},{"incorrect":"✗ The micropipette is broken, so I'll just pour the liquid.","correct":"✓ The micropipette is broken, so I'll use another micropipette.","note":"If accuracy is important, you should use a functioning micropipette rather than pouring."}],"priority":"★★☆"},"related_words":{"derivatives":["micropipetting (マイクロピペット操作)"],"phrasal_verbs":[],"related_terms":["microbiology (微生物学)","biochemistry (生化学)","molecular biology (分子生物学)","cell culture (細胞培養)","PCR (ポリメラーゼ連鎖反応)","elisa (酵素免疫測定法)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency, specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"micropipette\" refers to a laboratory instrument used for precisely measuring and dispensing very small volumes of liquid, typically in the microliter range. These instruments are essential in various scientific disciplines, including molecular biology, biochemistry, and cell biology. The term is relatively specialized and is primarily encountered in scientific or technical contexts. Understanding the function and application of micropipettes is crucial for anyone working in these fields, as accuracy and precision are paramount in experimental procedures.","priority":"★★☆"},"example_sentences":[{"sentence":"She carefully aspirated the sample using a **micropipette**.","translation":"彼女はマイクロピペットを使って慎重にサンプルを吸引した。","type":"noun","meaning_category":"instrument"},{"sentence":"The protocol requires the use of a **micropipette** with disposable tips.","translation":"プロトコルでは、使い捨てチップ付きのマイクロピペットの使用が義務付けられている。","type":"noun","meaning_category":"instrument"},{"sentence":"The student practiced using the **micropipette** to improve their technique.","translation":"学生は技術を向上させるためにマイクロピペットを使う練習をした。","type":"noun","meaning_category":"instrument"}]}