{"word":"Bourignianist","priority":"low","meanings":[{"part_of_speech":"noun","definition":"A follower of Antoinette Bourignon, a 17th-century mystic who advocated for inner experience over formal religious doctrine.","english_definition":"A follower of the religious teachings of Antoinette Bourignon, a 17th-century mystic.","examples":[{"sentence":"The Bourignianists were known for their emphasis on personal spiritual experience.","translation":"ブーリニョン主義者は、個人的な霊的経験を重視することで知られていた。"}],"collocations":["religious sect","spiritual movement","mystical group"],"synonyms":["Bourignonist"],"antonyms":[]}],"etymology":{"value":"Derived from the name of Antoinette Bourignon (1616-1680), a French-Flemish mystic, with the suffix '-ist' indicating a follower or adherent.","priority":"medium"},"pronunciation":{"ipa":"/bʊərɪɡˈnɪənɪst/","syllables":"Bour-ig-ni-an-ist"},"inflection":{"noun_plural":"Bourignianists"},"usage_notes":{"explanation":"The term 'Bourignianist' refers specifically to those who adhered to the teachings of Antoinette Bourignon, which emphasized direct, personal spiritual experience and minimized the importance of external religious forms and institutions. The movement was influential in the late 17th and early 18th centuries, particularly in the Netherlands and Scotland.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a Bourignonist of the modern era.","correct":"✓ He was interested in Bourignonist philosophy.","note":"The term is primarily historical, referring to followers of a specific 17th-century figure. Using it for contemporary spiritual interests requires careful phrasing."}],"priority":"low"},"related_words":{"derivatives":["Bourignonism (the religious doctrines of Antoinette Bourignon)"],"related_concepts":["Mysticism","Quietism","Spiritualism"]},"level_frequency":{"frequency_google_ngram":"Very low frequency - a niche historical term.","priority":"low"},"readability_explanation":{"level":"C2","text":"'Bourignianist' is a highly specialized term referring to followers of Antoinette Bourignon, a 17th-century mystic. Understanding requires knowledge of religious history and 17th-century spiritual movements. Its use is limited to academic or historical contexts."},"example_sentences":[{"sentence":"The Bourignianists sought a direct relationship with God, bypassing traditional church structures.","translation":"ブーリニョン主義者は、伝統的な教会の構造を迂回して、神との直接的な関係を求めた。","type":"noun","meaning_category":"follower"},{"sentence":"Historical accounts describe the beliefs and practices of the Bourignianists in detail.","translation":"歴史的な記録は、ブーリニョン主義者の信念と実践を詳細に記述している。","type":"noun","meaning_category":"follower"}]}