{"word":"donatively","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"寄付によって、寄付の形で","english_definition":"In a manner characterized by giving or donating; as a donation.","examples":[{"sentence":"The artwork was acquired donatively by the museum.","translation":"その芸術作品は寄付によって美術館に収蔵された。"},{"sentence":"The land was transferred donatively to the charity.","translation":"その土地は慈善団体に寄付の形で譲渡された。"}],"collocations":["acquire donatively","transfer donatively","provide donatively"],"synonyms":["as a donation","by contribution","through giving"],"antonyms":["commercially","for profit","by purchase"]}],"etymology":{"value":"Derived from the adjective 'donative' (pertaining to a gift or donation) with the addition of the adverbial suffix '-ly'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdoʊnətɪvli/","syllables":"do-na-tive-ly"},"inflection":{"notes":"This is an adverb, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Donatively' is used to describe how something is acquired or provided, specifically indicating that it was obtained through a donation or gift rather than through purchase or other commercial means. It is a relatively uncommon word, often replaced by phrases like 'as a donation' or 'through a gift.'","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company acted donatively by lowering prices.","correct":"✓ The company acted charitably by lowering prices.","note":"'Donatively' refers specifically to giving something as a donation. Lowering prices is more accurately described as 'charitably' or 'generously'."},{"incorrect":"✗ He gave donatively to the poor.","correct":"✓ He gave generously to the poor. / ✓ He donated to the poor.","note":"While 'donatively' describes the manner of giving, it's more common to say someone 'gave generously' or 'donated' to express the act of giving."}],"priority":"★☆☆"},"related_words":{"derivatives":["donate (verb)","donation (noun)","donor (noun)","donative (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Donatively' is a formal adverb that describes something done as a donation or gift. It is not commonly used in everyday language. Instead, phrases like 'as a donation' or 'through a gift' are more frequently used. It is most likely to appear in legal or financial contexts when describing how assets or items were transferred or acquired without a commercial transaction. The word emphasizes the act of giving without expecting anything in return."},"example_sentences":[{"sentence":"The rare manuscript was gifted donatively to the university's library.","translation":"その貴重な原稿は寄贈によって大学の図書館に贈られた。","type":"general","meaning_category":"donation"},{"sentence":"The building was acquired donatively, allowing the organization to expand its services.","translation":"その建物は寄贈によって取得され、組織はサービスを拡大することができた。","type":"general","meaning_category":"donation"}]}