{"word":"Tarwood","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of wood that is heavily saturated with tar, making it highly flammable.","english_definition":"Wood that is heavily saturated with tar, making it easily combustible.","examples":[{"sentence":"The settlers used tarwood to start their fires quickly.","translation":"入植者たちはすぐに火を起こすためにタールウッドを使った。"},{"sentence":"Because of its high tar content, tarwood burns with a thick, black smoke.","translation":"タール分が多いため、タールウッドは濃い黒煙を上げて燃える。"}],"collocations":["start a fire with tarwood","high tar content tarwood","burn tarwood"],"synonyms":["fatwood","pitchwood","lighter wood"],"antonyms":["greenwood","wet wood"]}],"etymology":{"value":"Likely a compound word combining 'tar' (a dark, oily, viscous material) and 'wood' (the substance of trees). The name reflects the wood's characteristic of being impregnated with tar.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɑːrwʊd/","syllables":"Tar-wood"},"inflection":{"noun_plural":"tarwoods"},"usage_notes":{"explanation":"Tarwood is a specific type of wood, not a general term. It is valued for its ability to easily catch fire, even when damp. It is often found in pine trees, where the resin has concentrated over time.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used any wood to start the fire, including tarwood.","correct":"✓ He specifically used tarwood to start the fire.","note":"Tarwood is a specific type of wood chosen for its flammability, not just any wood."}],"priority":"★☆☆"},"related_words":{"derivatives":["tar","wood","fatwood","pitchwood"],"related_terms":["kindling","firewood","resin","pine"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tarwood' is a specialized term referring to wood heavily saturated with tar or resin, making it highly flammable. It's a niche term, not commonly used in everyday conversation, and more likely to be encountered in contexts related to survival skills, historical accounts of early settlers, or discussions of natural materials and fire-starting techniques. Understanding the term requires some familiarity with the properties of tar and resin and their impact on wood's combustibility."},"example_sentences":[{"sentence":"The survivalist relied on his knowledge of tarwood to quickly ignite a campfire in the wilderness.","translation":"そのサバイバリストは、荒野で素早くキャンプファイヤーに点火するために、タールウッドの知識を頼りにした。","type":"noun","meaning_category":"Flammable wood"},{"sentence":"Early pioneers often sought out tarwood because it was an effective fire starter, even in damp conditions.","translation":"初期の開拓者たちは、湿った状態でも効果的な火付け材であったため、タールウッドをよく探した。","type":"noun","meaning_category":"Fire starter"}]}