{"word":"grasscutter","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"草刈り機、刈払機","english_definition":"A machine for cutting grass; a lawnmower.","examples":[{"sentence":"He used a grasscutter to trim the lawn.","translation":"彼は芝生を刈るために草刈り機を使った。"},{"sentence":"The grasscutter made short work of the overgrown field.","translation":"草刈り機は生い茂った畑をあっという間に片付けた。"}],"collocations":["ride-on grasscutter (乗用草刈り機)","petrol grasscutter (ガソリン式草刈り機)","electric grasscutter (電気式草刈り機)"],"synonyms":["lawnmower","mower","strimmer","brushcutter"],"antonyms":[],"notes":"In some regions, particularly in West Africa, 'grasscutter' can also refer to the greater cane rat, a type of rodent that is hunted for food. This entry focuses on the more common meaning of the word."},{"part_of_speech":"noun","definition":"(西アフリカで)オオネズミ(食用)","english_definition":"(In West Africa) the greater cane rat, Thryonomys swinderianus, a large rodent hunted for its meat.","examples":[{"sentence":"Grasscutter is a popular source of protein in many West African countries.","translation":"オオネズミは多くのアフリカ西部諸国で一般的なタンパク源です。"},{"sentence":"He raises grasscutters on his farm for commercial purposes.","translation":"彼は商業目的で農場でオオネズミを飼育している。"}],"collocations":["raise grasscutters (オオネズミを飼育する)","grasscutter farming (オオネズミの飼育)","grasscutter meat (オオネズミの肉)"],"synonyms":["greater cane rat","cane rat","thryonomys swinderianus"],"antonyms":[],"notes":"This meaning is specific to West Africa and may not be widely understood elsewhere."}],"etymology":{"value":"The term 'grasscutter' is a compound word formed from 'grass' and 'cutter,' describing a machine or animal that cuts grass. The use of 'grasscutter' to refer to the greater cane rat likely stems from the animal's diet, which primarily consists of grasses and other vegetation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡræsˌkʌtər/","syllables":"grass-cut-ter"},"inflection":{"noun_plural":"grasscutters"},"usage_notes":{"explanation":"The term 'grasscutter' has two distinct meanings depending on the region and context. The primary meaning refers to a machine used for cutting grass, such as a lawnmower or brushcutter. However, in West Africa, 'grasscutter' also refers to the greater cane rat, a large rodent that is a popular source of food. When using the term, it is important to consider the audience and context to avoid confusion.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a grasscutter running across the lawn, it was huge!","correct":"✓ I saw a cane rat running across the lawn, it was huge! / ✓ I saw a very large rodent running across the lawn.","note":"Unless you are in West Africa and discussing food animals, assume the listener will think of a lawnmower. If you mean the animal, use 'cane rat' or 'rodent' to avoid confusion."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["lawnmower","mower","brushcutter","strimmer","cane rat","rodent","Thryonomys swinderianus"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Grasscutter' is a compound noun with two main meanings. Primarily, it refers to a machine used for cutting grass, like a lawnmower. However, specifically in West Africa, it also refers to the greater cane rat, a large rodent that is a source of food. The context is crucial to understanding which meaning is intended. If you're not in West Africa, people will likely assume you're talking about a lawnmower.","note":"The term is not very common outside of specific contexts, so it's important to be aware of its dual meaning."},"example_sentences":[{"sentence":"The gardener used a grasscutter to maintain the neat appearance of the garden.","translation":"庭師は庭のきれいな外観を維持するために草刈り機を使った。","type":"noun","meaning_category":"草刈り機"},{"sentence":"In some West African markets, you can find grasscutter meat for sale.","translation":"一部のアフリカ西部市場では、オオネズミの肉が販売されている。","type":"noun","meaning_category":"オオネズミ"}]}