{"word":"Swasembada","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Indonesia) Self-sufficiency, especially in food production.","english_definition":"(Indonesia) The state of being self-sufficient, especially in the production of food.","examples":[{"sentence":"Indonesia sedang berupaya mencapai swasembada pangan.","translation":"Indonesia is striving to achieve food self-sufficiency."},{"sentence":"Program swasembada beras telah berhasil meningkatkan produksi.","translation":"The rice self-sufficiency program has successfully increased production."}],"collocations":["swasembada pangan (food self-sufficiency)","mencapai swasembada (to achieve self-sufficiency)"],"synonyms":["kemandirian (independence)","kecukupan (sufficiency)"],"antonyms":["ketergantungan (dependence)"]}],"etymology":{"value":"From Indonesian, formed from 'swa' (self) + 'sem-' (prefix indicating completeness or totality) + 'bada' (body, self). Literally means 'self-bodied' or 'self-contained', implying self-reliance.","priority":"★★☆"},"pronunciation":{"ipa":"/swa.səmˈba.da/","syllables":"swa-səm-ba-da"},"inflection":{"notes":"This word is a noun and does not inflect."},"usage_notes":{"explanation":"'Swasembada' is a term widely used in Indonesian political and economic discourse, particularly concerning national development goals. It often refers to the aspiration to be independent from foreign imports, especially in essential sectors like agriculture. The term carries a strong connotation of national pride and economic strength.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The country wants to be swasembada in technology.","correct":"✓ The country wants to achieve technological independence.","note":"While 'swasembada' technically means self-sufficiency, it is most commonly used in the context of food or agriculture. For other sectors, 'kemandirian' (independence) or a more specific term is preferred."}],"priority":"★★☆"},"related_words":{"derivatives":["menswasembadakan (to make self-sufficient)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency outside of Indonesian contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Swasembada' is a specialized term primarily used in Indonesian contexts to describe the goal of national self-sufficiency, particularly in food production. Understanding this term requires familiarity with Indonesian political and economic discourse. It is not commonly used in general English.","requires_context":"Indonesian politics, economics, agriculture"},"example_sentences":[{"sentence":"Pemerintah menargetkan swasembada gula dalam lima tahun ke depan.","translation":"The government aims for sugar self-sufficiency in the next five years.","type":"noun","meaning_category":"Self-sufficiency"},{"sentence":"Swasembada energi menjadi prioritas utama dalam kebijakan nasional.","translation":"Energy self-sufficiency is a top priority in national policy.","type":"noun","meaning_category":"Self-sufficiency"}]}