{"word":"basolateral","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(生物学)基底外側の、基底側面の","english_definition":"relating to both the base and the side of a cell or tissue; located at or near the base and lateral surface of a structure.","examples":[{"sentence":"The basolateral membrane of the epithelial cell is responsible for transporting nutrients into the bloodstream.","translation":"上皮細胞の基底外側膜は、栄養素を血流に輸送する役割を担っています。"},{"sentence":"Basolateral amygdala lesions can affect fear conditioning.","translation":"扁桃体の基底外側部の病変は、恐怖条件付けに影響を与える可能性があります。"}],"collocations":["basolateral membrane","basolateral amygdala","basolateral surface"],"synonyms":["abluminal"],"antonyms":["apical","luminal"]}],"etymology":{"value":"The term \"basolateral\" is a combination of \"baso-\" (referring to the base or basal part) and \"lateral\" (referring to the side).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbeɪsoʊˈlætərəl/","syllables":"ba-so-lat-er-al"},"inflection":{},"usage_notes":{"explanation":"In biology, particularly in cell biology and neuroscience, \"basolateral\" describes the membrane or region of a cell that is both at the base (the side facing away from the lumen or external environment) and on the lateral side (the side adjacent to neighboring cells). This is often used to describe epithelial cells, neurons, and other polarized cells.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["basolaterally (adverb)"],"related_terms":["apical","luminal","epithelial cell","neuron","amygdala"]},"level_frequency":{"frequency_google_ngram":"Low frequency - Specialized terminology used in biology and medicine.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"basolateral\" is a technical term used in biology and medicine to describe a specific location or region of a cell or tissue. It refers to the base and the side of a structure, particularly in polarized cells like epithelial cells. Understanding this term requires a background in cell biology or a related field. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The Na+/K+ ATPase is located on the **basolateral** membrane of renal tubular cells.","translation":"Na+/K+ ATPaseは、腎尿細管細胞の基底外側膜に位置しています。","type":"adjective","meaning_category":"基底外側の"},{"sentence":"Activation of the **basolateral** amygdala is crucial for the expression of conditioned fear.","translation":"扁桃体の基底外側部の活性化は、条件付けられた恐怖の発現に不可欠です。","type":"adjective","meaning_category":"基底外側の"}]}