{"word":"semidomesticated","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"半家畜化された、準家畜化された","english_definition":"Partially domesticated; having undergone some, but not all, of the processes of domestication.","examples":[{"sentence":"Reindeer are a semidomesticated species, herded for their meat and antlers.","translation":"トナカイは半家畜化された種であり、肉と角のために飼育されています。"},{"sentence":"Some breeds of cats are considered semidomesticated, retaining many of their wild instincts.","translation":"猫のいくつかの品種は半家畜化されていると考えられており、野生の本能の多くを保持しています。"},{"sentence":"The horses on the island are semidomesticated, roaming freely but still reliant on human care.","translation":"島の馬は半家畜化されており、自由に歩き回っていますが、依然として人間の世話に頼っています。"}],"collocations":["semidomesticated animals","semidomesticated species","semidomesticated reindeer","semidomesticated cats","semidomesticated horses"],"synonyms":["partially domesticated","part-domesticated","semi-tame","partly tamed"],"antonyms":["wild","feral","undomesticated"]}],"etymology":{"value":"The word is formed by combining the prefix 'semi-' (meaning 'half' or 'partially') with the word 'domesticated'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɛmiːdəˈmɛstɪkeɪtɪd/","syllables":"se-mi-do-mes-ti-cat-ed"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have different forms for gender or number."},"usage_notes":{"explanation":"'Semidomesticated' describes animals or plants that are in the process of domestication or have undergone some aspects of domestication but still retain wild characteristics. These species often live in a state between complete wildness and full domestication, often relying on humans for some resources but maintaining a degree of independence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The animal is semidomestic.","correct":"✓ The animal is semidomesticated.","note":"'Semidomestic' is not a commonly used word. 'Semidomesticated' is the correct term to describe an animal that is partially domesticated."}],"priority":"★☆☆"},"related_words":{"derivatives":["domestication","domesticated","domesticate","semi-","tame"],"phrases":["partially domesticated","semi-wild"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'semidomesticated' is used to describe animals or plants that are not fully wild but also not fully domesticated. These organisms have undergone some level of human control or influence, but they still retain many of their natural, wild characteristics. This term is often used in discussions about animal husbandry, ecology, and conservation biology."},"example_sentences":[{"sentence":"The research focuses on the behavior of semidomesticated foxes.","translation":"その研究は、半家畜化されたキツネの行動に焦点を当てています。","type":"example","meaning_category":"Animal behavior"},{"sentence":"These semidomesticated plants require less human intervention than fully domesticated crops.","translation":"これらの半家畜化された植物は、完全に家畜化された作物よりも人間の介入を必要としません。","type":"example","meaning_category":"Agriculture"},{"sentence":"The local community relies on semidomesticated reindeer for their livelihood.","translation":"地域社会は、生活のために半家畜化されたトナカイに頼っています。","type":"example","meaning_category":"Cultural practices"}]}