{"word":"acalculia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"計算不能症、失計算","english_definition":"Impairment in the ability to perform simple arithmetic calculations, typically resulting from brain damage.","examples":[{"sentence":"Acalculia is often associated with damage to the parietal lobe.","translation":"計算不能症はしばしば頭頂葉の損傷と関連付けられる。"},{"sentence":"The patient exhibited acalculia, struggling with basic addition and subtraction.","translation":"患者は計算不能症を示し、基本的な足し算と引き算に苦労していた。"}],"collocations":["exhibit acalculia","suffer from acalculia","develop acalculia","acalculia testing","types of acalculia"],"synonyms":["dyscalculia (developmental acalculia)","arithmetical disability"],"antonyms":[]}],"etymology":{"value":"From 'a-' (meaning 'not' or 'without') + 'calculia' (from Latin 'calculus' meaning 'small stone used for counting', hence 'calculation').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌeɪkælˈkjuːliə/","syllables":"a-cal-cu-li-a"},"inflection":{"notes":"Uncountable noun"},"usage_notes":{"explanation":"Acalculia refers to acquired difficulty in performing mathematical calculations in individuals who previously had the ability. It is distinct from dyscalculia, which is a developmental learning disability affecting mathematical skills. Acalculia is typically caused by neurological damage, such as stroke, traumatic brain injury, or neurodegenerative diseases. The specific type of calculation impairment can vary depending on the location and extent of the brain damage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Acalculia is a type of dyslexia.","correct":"✓ Acalculia is a difficulty with math, while dyslexia is a difficulty with reading.","note":"Acalculia affects mathematical abilities, whereas dyslexia affects reading abilities. They are distinct learning difficulties."},{"incorrect":"✗ My child has acalculia since birth.","correct":"✓ My child has dyscalculia since birth.","note":"If the condition is present from birth or early childhood, it is more likely to be dyscalculia (developmental), not acalculia (acquired)."}],"priority":"★☆☆"},"related_words":{"derivatives":["acalculic (adjective: relating to or characterized by acalculia)"],"phrases":["Gerstmann syndrome (a neurological disorder that can include acalculia)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Acalculia' is a specialized term used in neurology and neuropsychology to describe the acquired inability to perform mathematical calculations due to brain damage. It is not a common term in everyday language. Understanding this term requires knowledge of medical and psychological concepts related to cognitive functions and neurological disorders."},"example_sentences":[{"sentence":"The stroke resulted in severe acalculia, making it impossible for him to manage his finances.","translation":"脳卒中の結果、重度の計算不能症が生じ、彼は自分の財政を管理することが不可能になった。","type":"general","meaning_category":"Impairment in calculation"},{"sentence":"Testing for acalculia is a standard part of neuropsychological assessments following brain injury.","translation":"計算不能症の検査は、脳損傷後の神経心理学的評価の標準的な一部である。","type":"medical","meaning_category":"Impairment in calculation"}]}