{"word":"overpersecuting","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"過度に迫害する、過剰に苦しめる","english_definition":"To persecute to an excessive degree; to harass or oppress beyond reasonable limits.","examples":[{"sentence":"The regime was accused of overpersecuting religious minorities.","translation":"その政権は、宗教的少数派を過度に迫害していると非難された。"},{"sentence":"The media was criticized for overpersecuting the celebrity after the scandal.","translation":"メディアは、スキャンダルの後、その有名人を過剰に迫害していると批判された。"}],"collocations":["overpersecuting minorities","overpersecuting political opponents","overpersecuting whistleblowers"],"synonyms":["harass","oppress","victimize","mistreat","abuse","torment"],"antonyms":["protect","support","defend","aid","assist"]}],"etymology":{"value":"The word is formed by adding the prefix 'over-' to the verb 'persecute.' 'Over-' indicates excessiveness. 'Persecute' comes from Latin 'persequi,' meaning 'to follow persistently, pursue, harass.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊvərˈpɜːrsɪˌkjuːtɪŋ/","syllables":"o-ver-per-se-cu-ting"},"inflection":{"verb_forms":{"present_simple":["overpersecute","overpersecutes"],"past_simple":"overpersecuted","past_participle":"overpersecuted","present_participle":"overpersecuting"}},"usage_notes":{"explanation":"'Overpersecuting' implies a level of persecution that is considered excessive, unjust, or beyond what is warranted by the situation. It suggests a deliberate and sustained effort to cause harm or suffering. This word is often used in contexts involving human rights, political oppression, or social injustice.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The government is persecuting, they are overpersecuting.","correct":"✓ The government is persecuting; in fact, they are overpersecuting.","note":"'Overpersecuting' implies a degree of persecution that is excessive. Ensure the context supports this level of intensity."},{"incorrect":"✗ They are overpersecuting because they are angry.","correct":"✓ They are overpersecuting because they want to suppress dissent.","note":"Overpersecution often implies a systematic or calculated effort rather than a spontaneous reaction."}],"priority":"★★☆"},"related_words":{"derivatives":["overpersecution (noun)"],"phrasal_verbs":[],"related_terms":["persecute","persecution","oppression","harassment","discrimination","victimization"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'overpersecuting' is a relatively uncommon and complex term. It is formed by combining 'over-' (meaning excessively) with 'persecuting' (meaning to harass or oppress persistently). The word is typically used in formal contexts to describe situations where individuals or groups are subjected to excessive and unjust harassment or oppression. Understanding the prefixes and root words can help in comprehending the meaning.","priority":"★☆☆"},"example_sentences":[{"sentence":"The international community condemned the regime for overpersecuting its political rivals.","translation":"国際社会は、その政権が政敵を過度に迫害していることを非難した。","type":"verb","meaning_category":"過度に迫害する"},{"sentence":"Critics argued that the company was overpersecuting employees who spoke out against its policies.","translation":"批判者たちは、その会社が自社の政策に反対する従業員を過剰に迫害していると主張した。","type":"verb","meaning_category":"過剰に苦しめる"}]}