{"word":"meager-looking","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"貧弱に見える、粗末に見える、乏しい様子に見える","english_definition":"Having a thin, deficient, or poor appearance; looking inadequate or insufficient.","examples":[{"sentence":"The meal was meager-looking, with only a small portion of rice and a few vegetables.","translation":"食事は貧弱に見え、ご飯が少しといくつかの野菜しかありませんでした。"},{"sentence":"The meager-looking crops suggested a poor harvest this year.","translation":"粗末に見える作物は、今年の収穫が少ないことを示唆していました。"},{"sentence":"Despite the meager-looking supplies, they managed to survive.","translation":"乏しい様子に見える物資にもかかわらず、彼らはなんとか生き延びました。"}],"collocations":["meager-looking meal (粗末に見える食事)","meager-looking crops (貧弱に見える作物)","meager-looking supplies (乏しい様子に見える物資)"],"synonyms":["scanty","skimpy","paltry","deficient","inadequate","poor","thin","wretched"],"antonyms":["abundant","plentiful","ample","rich","substantial","luxurious"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'meager' (meaning deficient in quantity or quality) and 'looking' (having the appearance of).","priority":"☆☆☆"},"pronunciation":{"ipa":null,"syllables":"mea-ger-look-ing"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be used in comparative and superlative forms with 'more' and 'most' or '-er' and '-est' (though less common with compound adjectives like this)."},"usage_notes":{"explanation":"'Meager-looking' is used to describe something that appears to be insufficient, either in quantity or quality. It suggests a visual impression of lack or deficiency. It is often used to describe food, supplies, or resources.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"The meager-looking person was very strong.","correct":"The thin-looking person was very strong.","note":"'Meager-looking' usually describes objects or provisions, not people. Use 'thin-looking' or 'frail-looking' to describe a person's appearance."}],"priority":"☆☆☆"},"related_words":{"derivatives":["meagerly (adverb)","meagerness (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The adjective 'meager-looking' describes something that visually appears to be insufficient or of poor quality. It combines the concept of 'meager' (lacking in quantity or quality) with the appearance ('looking'). This term is not commonly used in everyday conversation and is more likely to be found in descriptive writing or formal contexts."},"example_sentences":[{"sentence":"The refugees arrived with only meager-looking bundles of their belongings.","translation":"難民たちは、乏しい様子に見える所持品の包みを抱えて到着しました。","type":"adjective","meaning_category":"貧弱に見える"},{"sentence":"The soil was dry and the plants were meager-looking, suggesting a lack of water.","translation":"土壌は乾燥しており、植物は粗末に見え、水不足を示唆していました。","type":"adjective","meaning_category":"粗末に見える"},{"sentence":"The rations were meager-looking, but they were enough to keep us alive.","translation":"配給品は乏しい様子に見えましたが、私たちが生き続けるには十分でした。","type":"adjective","meaning_category":"乏しい様子に見える"}]}