{"word":"Imamite","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"イスラム教シーア派の一派、十二イマーム派の信者","english_definition":"A follower of the Twelver branch of Shia Islam, which believes in a succession of twelve divinely appointed Imams.","examples":[{"sentence":"The majority of Shia Muslims in Iran are Imamites.","translation":"イランのシーア派イスラム教徒の大多数は十二イマーム派です。"},{"sentence":"Imamite theology emphasizes the role of the Imams as spiritual and political leaders.","translation":"十二イマーム派の神学は、イマームの精神的および政治的指導者としての役割を強調しています。"}],"collocations":["Imamite Shia (十二イマーム派シーア派)","Imamite theology (十二イマーム派神学)","Twelver Imamite (十二イマーム派)"],"synonyms":["Twelver Shia","Ja'fari Shia"],"antonyms":["Sunni Muslim"]},{"part_of_speech":"adjective","definition":"十二イマーム派の、十二イマーム派に関する","english_definition":"Relating to or characteristic of the Twelver branch of Shia Islam.","examples":[{"sentence":"Imamite jurisprudence is based on the teachings of the Imams.","translation":"十二イマーム派の法学は、イマームの教えに基づいています。"},{"sentence":"The Imamite view of history differs from that of Sunni Muslims.","translation":"十二イマーム派の歴史観は、スンニ派イスラム教徒の歴史観とは異なります。"}],"collocations":["Imamite jurisprudence (十二イマーム派法学)","Imamite doctrine (十二イマーム派教義)","Imamite perspective (十二イマーム派の視点)"],"synonyms":["Twelver Shia","Ja'fari"],"antonyms":["Sunni"]}],"etymology":{"value":"Derived from the Arabic word 'Imam', referring to a leader or guide, and the suffix '-ite', indicating a follower or adherent.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈmɑːˌmaɪt/","syllables":"I-ma-mite"},"inflection":{"noun_plural":"Imamites"},"usage_notes":{"explanation":"The term 'Imamite' specifically refers to followers of the Twelver branch of Shia Islam, which is the largest Shia denomination. They believe in twelve divinely appointed Imams, starting with Ali ibn Abi Talib and ending with Muhammad al-Mahdi, who is believed to be in occultation and will reappear at the end of time. The terms 'Imamite', 'Twelver Shia', and 'Ja'fari Shia' are often used interchangeably.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Imamites believe in only one Imam.","correct":"✓ Imamites believe in twelve Imams.","note":"Imamites, or Twelver Shias, believe in a succession of twelve Imams, not just one."},{"incorrect":"✗ All Shia Muslims are Imamites.","correct":"✓ Not all Shia Muslims are Imamites; there are other branches of Shia Islam, such as Zaidis and Ismailis.","note":"While Imamites are the largest Shia group, other Shia branches exist with different beliefs about the line of Imams."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2-C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Imamite' is a specialized term used in the context of Islamic studies and religious studies, specifically referring to the Twelver branch of Shia Islam. Understanding this term requires familiarity with Islamic history, theology, and the different branches within Islam. It's not a term commonly used in everyday conversation but is important for academic discussions and research related to Shia Islam."},"example_sentences":[{"sentence":"The Imamite community in Lebanon has a significant political influence.","translation":"レバノンの十二イマーム派コミュニティは、大きな政治的影響力を持っています。","type":"noun","meaning_category":"信者"},{"sentence":"Imamite scholars have made significant contributions to Islamic philosophy.","translation":"十二イマーム派の学者は、イスラム哲学に大きな貢献をしてきました。","type":"adjective","meaning_category":"十二イマーム派の"}]}