{"word":"antibody","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"抗体","english_definition":"A blood protein produced in response to and counteracting a specific antigen.","examples":[{"sentence":"The body produces antibodies to fight off infection.","translation":"体は感染症と戦うために抗体を生成します。"},{"sentence":"The vaccine stimulates the production of antibodies.","translation":"ワクチンは抗体の産生を刺激します。"},{"sentence":"Monoclonal antibodies are used in some cancer treatments.","translation":"モノクローナル抗体は、一部の癌治療で使用されています。"}],"collocations":["produce antibodies (抗体を産生する)","develop antibodies (抗体を生成する)","monoclonal antibody (モノクローナル抗体)","antibody test (抗体検査)","antibody response (抗体反応)"],"synonyms":["immunoglobulin"],"antonyms":[]}],"etymology":{"value":"From 'anti-' (against) + 'body'. Coined in the late 19th century as a term for substances in the blood that counteract antigens.","priority":"★★☆"},"pronunciation":{"ipa":"ˈæntibɒdi","syllables":"an-ti-bod-y"},"inflection":{"noun_plural":"antibodies"},"usage_notes":{"explanation":"Antibodies are crucial components of the adaptive immune system, recognizing and neutralizing specific foreign substances (antigens) like bacteria, viruses, and toxins. They are produced by B cells and are highly specific to their target antigen. Antibody tests are used to detect past infections or immune responses to vaccines.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The antibody is a type of antigen.","correct":"✓ The antibody binds to the antigen.","note":"Antibodies bind to antigens, they are not a type of antigen themselves."},{"incorrect":"✗ Antibodies are only produced after vaccination.","correct":"✓ Antibodies can be produced after infection or vaccination.","note":"Antibodies are produced in response to both infections and vaccinations."}],"priority":"★★☆"},"related_words":{"derivatives":["antigen (抗原)","immunoglobulin (免疫グロブリン)","immunology (免疫学)","vaccine (ワクチン)","immunity (免疫)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively frequent, especially in scientific and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"An **antibody** is a protein made by the body's immune system to fight off harmful substances called antigens, such as bacteria and viruses. When an antigen enters the body, the immune system recognizes it and produces specific antibodies that bind to the antigen and help to remove it. Antibody tests can be used to determine if someone has been infected with a particular disease or has developed immunity to it. The term is commonly used in medical and scientific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The patient's blood sample showed a high level of antibodies against the virus.","translation":"患者の血液サンプルは、ウイルスに対する高レベルの抗体を示した。","type":"noun","meaning_category":"抗体"},{"sentence":"The vaccine helps the body create antibodies to protect against the disease.","translation":"ワクチンは、体が病気から身を守るための抗体を作るのを助ける。","type":"noun","meaning_category":"抗体"},{"sentence":"Researchers are developing new monoclonal antibodies to treat autoimmune diseases.","translation":"研究者たちは、自己免疫疾患を治療するための新しいモノクローナル抗体を開発している。","type":"noun","meaning_category":"抗体"}]}