{"word":"cyano","priority":"☆☆☆","meanings":[{"part_of_speech":"prefix","definition":"シアン(基)の、青色の","english_definition":"A prefix denoting a blue color or the presence of a cyanide group.","examples":[{"sentence":"Cyanobacteria are a phylum of bacteria that obtain energy through photosynthesis.","translation":"シアノバクテリアは、光合成によってエネルギーを得る細菌の門です。"},{"sentence":"The cyanoacrylate adhesive is a strong, fast-acting glue.","translation":"シアノアクリレート接着剤は、強力で速乾性の接着剤です。"}],"collocations":["cyanobacteria","cyanoacrylate","cyanogen"],"synonyms":["blue","cyanide"],"antonyms":[]}],"etymology":{"value":"From the Ancient Greek κύανος (kyanos) meaning 'dark blue enamel, lapis lazuli'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsaɪənoʊ/","syllables":"cy-a-no"},"inflection":{},"usage_notes":{"explanation":"'Cyano-' is a prefix used in scientific and technical contexts. It indicates either a blue color or the presence of a cyanide group in a chemical compound. It's not typically used as a standalone word.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["cyan (noun: a greenish-blue color)","cyanide (noun: a highly poisonous chemical compound)","cyanotic (adjective: relating to or affected by cyanosis, a bluish discoloration of the skin)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Cyano-' is a technical prefix primarily encountered in scientific fields such as biology and chemistry. It signifies either a blue color or the presence of a cyanide group. Understanding this prefix is useful for deciphering the meaning of related scientific terms.","priority":"★★☆"},"example_sentences":[{"sentence":"The pond was green due to an overgrowth of cyano bacteria.","translation":"池はシアノバクテリアの異常繁殖により緑色になっていた。","type":"example","meaning_category":"blue color"},{"sentence":"Cyanoacrylate adhesives are commonly used in medical applications.","translation":"シアノアクリレート接着剤は、医療用途で一般的に使用されています。","type":"example","meaning_category":"cyanide group"}]}