{"word":"fossilism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"化石信仰、化石崇拝","english_definition":"The belief that fossils are the remains of organisms destroyed by Noah's Flood; a literal interpretation of the Biblical account of the Flood to explain the fossil record.","examples":[{"sentence":"Fossilism is a pseudoscientific attempt to reconcile religious beliefs with scientific findings.","translation":"化石信仰は、宗教的信念と科学的発見を調和させようとする疑似科学的な試みです。"},{"sentence":"The arguments of fossilism are often used to deny the validity of evolutionary theory.","translation":"化石信仰の議論は、進化論の妥当性を否定するためによく用いられます。"}],"collocations":["creationist fossilism","flood geology","young-earth creationism"],"synonyms":["creation science","flood geology"],"antonyms":["evolutionism","uniformitarianism"]},{"part_of_speech":"noun","definition":"(比喩的に)時代遅れの考え方、保守主義","english_definition":"(figuratively) An adherence to outdated or obsolete ideas; conservatism.","examples":[{"sentence":"His fossilism prevented him from accepting new technologies.","translation":"彼の時代遅れの考え方は、彼が新しい技術を受け入れることを妨げた。"},{"sentence":"The company's fossilism made it difficult to compete in the modern market.","translation":"その会社の保守主義は、現代の市場で競争することを困難にした。"}],"collocations":["intellectual fossilism","ideological fossilism"],"synonyms":["conservatism","traditionalism","archaism"],"antonyms":["progressivism","modernism"]}],"etymology":{"value":"'fossil' + '-ism'. Derived from the belief that fossils were formed by Noah's Flood.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɒsɪlɪzəm/","syllables":"fos-sil-ism"},"inflection":{"noun_plural":"fossilisms"},"usage_notes":{"explanation":"'Fossilism' primarily refers to the belief that fossils are evidence of Noah's Flood, a concept within creationism. Figuratively, it can describe clinging to outdated ideas.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He studied fossilism in college.","correct":"✓ He studied paleontology in college.","note":"Paleontology is the scientific study of fossils. Fossilism is a belief system."}],"priority":"★☆☆"},"related_words":{"derivatives":["fossilist","fossilize","fossilized"],"related_terms":["creationism","flood geology","paleontology","evolution"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Fossilism' is a term with two main meanings. Primarily, it refers to the belief that fossils are the result of Noah's Flood, a concept associated with creationism. Figuratively, it can describe an adherence to outdated or obsolete ideas. The term is relatively uncommon and is more likely to be encountered in discussions about creationism, paleontology, or the history of science. Understanding the context is crucial to interpreting the intended meaning."},"example_sentences":[{"sentence":"The museum exhibit challenged the tenets of fossilism by presenting evidence of gradual evolutionary change.","translation":"博物館の展示は、漸進的な進化の変化の証拠を提示することにより、化石信仰の原則に異議を唱えた。","type":"noun","meaning_category":"化石信仰"},{"sentence":"The manager's fossilism stifled innovation within the department.","translation":"そのマネージャーの保守主義は、部門内のイノベーションを抑制した。","type":"noun","meaning_category":"時代遅れの考え方"}]}