{"word":"adipose-resistant","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"Resistant to the accumulation or formation of adipose tissue (body fat).","english_definition":"Exhibiting resistance to the accumulation or formation of adipose tissue; tending to prevent or counteract obesity.","examples":[{"sentence":"The new drug is being tested for its adipose-resistant properties.","translation":"その新薬は、脂肪組織の蓄積を抑制する特性があるかどうか試験されています。"},{"sentence":"Certain genetic factors may contribute to an adipose-resistant phenotype.","translation":"特定の遺伝的要因が、脂肪組織が蓄積しにくい表現型に寄与する可能性があります。"}],"collocations":["adipose-resistant drug","adipose-resistant gene","adipose-resistant phenotype"],"synonyms":["anti-obesity","fat-resistant"],"antonyms":["adipogenic","pro-obesity"]}],"etymology":{"value":"Formed by combining 'adipose' (relating to fat) and 'resistant' (offering resistance).","priority":"medium"},"pronunciation":{"ipa":"/ˈædɪpoʊz rɪˈzɪstənt/","syllables":"ad-i-pose re-sis-tant"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms (which are rarely used for this word)."},"usage_notes":{"explanation":"This term is typically used in scientific or medical contexts to describe substances, treatments, or genetic traits that prevent or reduce the formation of adipose tissue. It is often associated with research into obesity and related metabolic disorders.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The material is adipose-resistant, so it's good for insulation.","correct":"The material is heat-resistant, so it's good for insulation.","note":"Adipose-resistant refers to resisting fat accumulation, not heat or other properties."}],"priority":"low"},"related_words":{"derivatives":["adipose (adjective, noun)","resistance (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low","priority":"low"},"readability_explanation":{"level":"C2","text":"The term 'adipose-resistant' is highly specialized and technical, primarily found in scientific and medical literature related to obesity research and metabolic disorders. Understanding requires a strong background in biology and medicine."},"example_sentences":[{"sentence":"Studies suggest that regular exercise can promote an adipose-resistant state in individuals.","translation":"研究によると、定期的な運動は個人の脂肪組織が蓄積しにくい状態を促進する可能性があることが示唆されています。","type":"general","meaning_category":"prevention of fat accumulation"},{"sentence":"Researchers are exploring adipose-resistant therapies to combat obesity.","translation":"研究者たちは、肥満に対抗するための脂肪組織が蓄積しにくい治療法を研究しています。","type":"medical","meaning_category":"medical treatment"}]}