{"word":"shrink-fit","priority":"★★★","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"焼き嵌めする、焼きばめする","english_definition":"To assemble two parts by heating one of them to expand it, then fitting the other part inside, and allowing the heated part to cool and shrink, creating a very tight fit.","examples":[{"sentence":"The gear was shrink-fit onto the shaft.","translation":"ギアはシャフトに焼き嵌めされた。"},{"sentence":"We shrink-fit the bearing onto the axle.","translation":"ベアリングを車軸に焼き嵌めした。"}],"collocations":["shrink-fit a gear onto a shaft (ギアをシャフトに焼き嵌めする)","shrink-fit a bearing onto an axle (ベアリングを車軸に焼き嵌めする)"],"synonyms":["interference fit","press fit"],"antonyms":["loose fit"]},{"part_of_speech":"noun","definition":"焼き嵌め、焼きばめ","english_definition":"A method of fitting two parts together by heating one of them to expand it, then fitting the other part inside, and allowing the heated part to cool and shrink, creating a very tight fit.","examples":[{"sentence":"Shrink-fit is a common method for assembling gears and shafts.","translation":"焼き嵌めは、ギアとシャフトを組み立てる一般的な方法です。"},{"sentence":"The shrink-fit ensures a strong and reliable connection.","translation":"焼き嵌めは、強固で信頼性の高い接続を保証します。"}],"collocations":["perform a shrink-fit (焼き嵌めを行う)","shrink-fit assembly (焼き嵌めによる組み立て)","shrink-fit connection (焼き嵌めによる接続)"],"synonyms":["interference fit","press fit"],"antonyms":["loose fit"]}],"etymology":{"value":"The term 'shrink-fit' comes from the process of fitting parts together by shrinking one part onto another.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʃrɪŋk fɪt/","syllables":"shrink-fit"},"inflection":{"verb_forms":{"present_simple":["shrink-fit","shrink-fits"],"past_simple":"shrink-fitted","past_participle":"shrink-fitted","present_participle":"shrink-fitting"},"noun_plural":"shrink-fits"},"usage_notes":{"explanation":"'Shrink-fit' is a technical term primarily used in engineering and manufacturing. It refers to a specific method of joining two parts together using thermal expansion and contraction. The process involves heating one part to expand it, inserting the other part, and then allowing the heated part to cool and shrink, creating a very tight and secure fit.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ shrink fit","correct":"✓ shrink-fit","note":"When used as a compound adjective or noun, it is typically hyphenated."}],"priority":"★★☆"},"related_words":{"derivatives":["shrink fitting"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'shrink-fit' is a technical term used in engineering and manufacturing. It describes a method of joining two parts where one part is heated to expand it, the other part is inserted, and then the heated part is allowed to cool and shrink, creating a very tight fit. This process is used to create strong and reliable connections in mechanical systems.","priority":"★★★"},"example_sentences":[{"sentence":"The mechanic used a torch to heat the outer ring before the **shrink-fit**.","translation":"整備士は焼き嵌めの前に、トーチを使って外側のリングを加熱した。","type":"noun","meaning_category":"焼き嵌め"},{"sentence":"They **shrink-fit** the steel sleeve onto the aluminum cylinder.","translation":"彼らは鋼鉄製のスリーブをアルミニウム製のシリンダーに焼き嵌めした。","type":"verb","meaning_category":"焼き嵌めする"}]}