{"word":"unprosperously","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"不成功に、不景気に、恵まれない状態で","english_definition":"In a manner lacking success, prosperity, or good fortune; without thriving or flourishing.","examples":[{"sentence":"The business venture failed, and the entrepreneur lived unprosperously for many years.","translation":"その事業は失敗し、起業家は長年不遇な生活を送った。"},{"sentence":"Despite his hard work, he lived unprosperously due to the economic downturn.","translation":"彼の努力にもかかわらず、景気低迷のため、彼は不遇な生活を送った。"}],"collocations":["live unprosperously","fare unprosperously","endure unprosperously"],"synonyms":["poorly","badly","unsuccessfully","adversely","poverty-strickenly"],"antonyms":["prosperously","successfully","flourishingly","thrivingly","richly"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to 'prosperously'. 'Prosperously' comes from 'prosperous', which is derived from the Latin 'prosperare' (to cause to succeed or thrive).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈprɒspərəsli/","syllables":"un-pros-per-ous-ly"},"inflection":{"notes":"Adverbs do not typically inflect. This word does not have different forms based on tense or number."},"usage_notes":{"explanation":"'Unprosperously' describes the manner in which something is done or experienced, indicating a lack of success, wealth, or good fortune. It is the opposite of 'prosperously' and is used to convey a state of adversity or lack of thriving.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He unprosperously lived.","correct":"✓ He lived unprosperously.","note":"The adverb 'unprosperously' should be placed after the verb it modifies, or at the beginning of the sentence for emphasis, but not between the subject and verb."},{"incorrect":"✗ The unprosperously person.","correct":"✓ The unprosperous person.","note":"'Unprosperously' is an adverb and modifies verbs, adverbs, or adjectives. To describe a person, use the adjective 'unprosperous'."}],"priority":"★★☆"},"related_words":{"derivatives":["unprosperous (adjective)","prosperously (adverb)","prosperous (adjective)","prosperity (noun)","prosper (verb)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unprosperously' is an advanced word that means 'in a way that lacks success or wealth'. It's not commonly used in everyday conversation but might appear in formal writing or literature when describing someone's unfortunate circumstances or a business's failure. You would use it to describe how someone lives or how a business operates when they are not doing well financially or achieving their goals."},"example_sentences":[{"sentence":"The small farm operated unprosperously for years, barely making enough to cover its expenses.","translation":"その小さな農場は何年も不景気な状態で運営され、かろうじて経費を賄うのがやっとだった。","type":"adverb","meaning_category":"Lack of Success"},{"sentence":"Despite his best efforts, the artist lived unprosperously, struggling to sell his paintings.","translation":"最善の努力にもかかわらず、その芸術家は絵を売るのに苦労し、不遇な生活を送った。","type":"adverb","meaning_category":"Lack of Wealth"},{"sentence":"The company fared unprosperously during the recession, leading to significant layoffs.","translation":"不況の間、その会社は不振に陥り、大規模な人員削減につながった。","type":"adverb","meaning_category":"Adversity"}]}