{"word":"dumpishly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"不格好に、ぶっきらぼうに、無愛想に","english_definition":"In a dumpy manner; awkwardly, unattractively, or sullenly.","examples":[{"sentence":"He dumpishly shrugged his shoulders, refusing to answer the question.","translation":"彼はぶっきらぼうに肩をすくめ、質問に答えるのを拒否した。"},{"sentence":"She dumpishly walked away, clearly unhappy with the situation.","translation":"彼女は不機嫌そうに歩き去り、明らかにその状況に不満だった。"}],"collocations":["act dumpishly","behave dumpishly","walk dumpishly","shrug dumpishly"],"synonyms":["awkwardly","clumsily","sullenly","morosely","ungracefully"],"antonyms":["gracefully","elegantly","cheerfully","happily"]}],"etymology":{"value":"Derived from the adjective 'dumpy' (short and stout; sullen or depressed) with the addition of the adverbial suffix '-ly'. The word 'dumpy' likely has origins in Middle English or earlier, possibly related to words describing a lump or heap.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʌmpɪʃli/","syllables":"dump-ish-ly"},"inflection":{"notes":"Adverb, does not inflect."},"usage_notes":{"explanation":"'Dumpishly' describes an action performed in a 'dumpy' manner, which implies a combination of physical awkwardness or unattractiveness and a sullen or unhappy mood. It suggests a lack of grace, enthusiasm, or social skills in the way someone moves, speaks, or behaves. The word is relatively uncommon and carries a negative connotation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She danced dumpishly across the stage.","correct":"✓ She danced awkwardly across the stage.","note":"While 'dumpishly' could describe a dance, 'awkwardly' is a more common and natural choice in this context, as 'dumpishly' also implies a negative mood, not just physical clumsiness."},{"incorrect":"✗ The room was decorated dumpishly.","correct":"✓ The room was decorated tastelessly.","note":"'Dumpishly' is typically used to describe actions or behaviors of people, not the appearance of objects or places. 'Tastelessly' would be more appropriate to describe a poorly decorated room."}],"priority":"★★☆"},"related_words":{"derivatives":["dumpy (adjective)","dumpiness (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Dumpishly' is a relatively rare and nuanced word. It describes an action performed in a way that combines physical awkwardness or unattractiveness with a sullen or unhappy mood. It is not a word commonly encountered in everyday language and would likely be used in more descriptive or literary contexts."},"example_sentences":[{"sentence":"The teenager dumpishly slammed the door to his room after the argument.","translation":"そのティーンエイジャーは口論の後、不機嫌そうに自分の部屋のドアを乱暴に閉めた。","type":"adverb","meaning_category":"ぶっきらぼうに"},{"sentence":"He dumpishly sat down in the chair, avoiding eye contact with everyone.","translation":"彼は不機嫌そうに椅子に座り、誰とも目を合わせようとしなかった。","type":"adverb","meaning_category":"無愛想に"},{"sentence":"She dumpishly pushed the plate away, indicating she didn't like the food.","translation":"彼女は不機嫌そうに皿を押しやり、食べ物が気に入らないことを示した。","type":"adverb","meaning_category":"無愛想に"}]}