{"word":"monocystic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Having or pertaining to a single cyst or sac.","english_definition":"Relating to or having a single cyst or sac.","examples":[{"sentence":"The tumor was described as monocystic, containing only one large fluid-filled cavity.","translation":"その腫瘍は単嚢胞性であると記述され、一つの大きな液体で満たされた空洞のみを含んでいた。"},{"sentence":"Monocystic lesions are often easier to diagnose than complex, multiloculated cysts.","translation":"単嚢胞性の病変は、複雑な多房性の嚢胞よりも診断が容易なことが多い。"}],"collocations":["monocystic tumor","monocystic lesion","monocystic structure"],"synonyms":["unicystic","single-chambered"],"antonyms":["multicystic","polycyclic"]}],"etymology":{"value":"Derived from the Greek words 'monos' (single, alone) and 'cystis' (bladder, sac), combined with the suffix '-ic' (pertaining to).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɒnəˈsɪstɪk/","syllables":"mo-no-cis-tic"},"inflection":{"notes":"Adjective; comparative and superlative forms are generally formed using 'more' and 'most' (e.g., more monocystic, most monocystic)."},"usage_notes":{"explanation":"The term 'monocystic' is primarily used in medical and biological contexts to describe structures or conditions characterized by a single cyst. It's often used in radiology, pathology, and surgery to describe the appearance of tumors, lesions, or other abnormal formations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The monocystic is very small.","correct":"✓ The monocystic cyst is very small.","note":"'Monocystic' is an adjective, so it needs to modify a noun. Using it as a noun is incorrect."}],"priority":"★★☆"},"related_words":{"derivatives":["monocyst (noun): A single cyst or sac.","monocystoma (noun): A tumor or growth consisting of a single cyst."],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in specialized medical or scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Monocystic' is a specialized term used in medical and biological fields. It describes something that consists of or pertains to a single cyst or sac. Due to its specific usage, it is not commonly encountered in general language but is important for those in related professions to understand.","priority":"★★☆"},"example_sentences":[{"sentence":"The ultrasound revealed a simple, **monocystic** kidney cyst.","translation":"超音波検査で、単純な単嚢胞性の腎臓嚢胞が明らかになった。","type":"general","meaning_category":"single cyst"},{"sentence":"Surgical removal is often recommended for large, symptomatic **monocystic** ovarian cysts.","translation":"手術による除去は、大きく症状のある単嚢胞性の卵巣嚢胞によく推奨される。","type":"medical","meaning_category":"single cyst"},{"sentence":"Histological analysis confirmed the lesion to be a benign **monocystic** growth.","translation":"組織学的分析により、その病変は良性の単嚢胞性増殖であることが確認された。","type":"medical","meaning_category":"single cyst"}]}