{"word":"Semicrystalline","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"部分的に結晶性の、半結晶性の","english_definition":"Having both crystalline and amorphous regions within its structure.","examples":[{"sentence":"Semicrystalline polymers exhibit properties intermediate between those of purely crystalline and amorphous materials.","translation":"半結晶性ポリマーは、純粋な結晶性材料と非晶性材料の中間の特性を示す。"},{"sentence":"The degree of crystallinity in a semicrystalline material affects its mechanical strength and optical properties.","translation":"半結晶性材料の結晶化度は、その機械的強度と光学特性に影響を与える。"}],"collocations":["semicrystalline polymer","semicrystalline structure","degree of crystallinity"],"synonyms":["partially crystalline"],"antonyms":["amorphous","crystalline"]}],"etymology":{"value":"The word \"semicrystalline\" is formed by combining the prefix \"semi-\" (meaning half or partly) with the word \"crystalline\" (relating to or having the structure and form of a crystal).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɛmiˈkrɪstəlɪn/","syllables":"sem-i-crys-tal-line"},"inflection":{"notes":"This word is an adjective and does not have different inflections."},"usage_notes":{"explanation":"\"Semicrystalline\" is typically used in materials science and chemistry to describe materials that are neither fully crystalline nor fully amorphous. These materials have regions of ordered crystalline structure interspersed with disordered amorphous regions. The properties of semicrystalline materials are often dependent on the degree of crystallinity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The material is semi-crystal.","correct":"✓ The material is semicrystalline.","note":"\"Semicrystalline\" is the correct adjective form. \"Semi-crystal\" is not commonly used in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["crystallinity","amorphous","polymer","crystal"],"related_terms":["crystallization","nucleation","spherulite"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"semicrystalline\" is a technical term primarily used in materials science and chemistry. It describes materials that have both ordered (crystalline) and disordered (amorphous) regions. Understanding this term requires a basic knowledge of material structures and properties."},"example_sentences":[{"sentence":"Polyethylene is a common example of a **semicrystalline** polymer.","translation":"ポリエチレンは、一般的な半結晶性ポリマーの例である。","type":"general"},{"sentence":"The **semicrystalline** nature of the material gives it both strength and flexibility.","translation":"その材料の半結晶性という性質が、強度と柔軟性の両方を与えている。","type":"property"}]}