{"word":"nympholepsies","priority":"低","meanings":[{"part_of_speech":"noun","definition":"ニンフォレプシー（ニンフ憑き）：強い性的魅力を持つ若い女性に魅了され、その女性への強迫的な欲望や憧れを抱く状態。古代ギリシャでは、ニンフ（妖精）に魅入られた状態を指した。現代では、精神医学的な用語としては稀だが、文学や芸術作品で用いられることがある。","english_definition":"A state of being seized by an intense, often obsessive, desire for an unattainable young woman. Originally, in ancient Greece, it referred to being possessed by a nymph. In modern usage, it is a rare psychiatric term but may appear in literature and art.","examples":[{"sentence":"The protagonist in the novel suffered from nympholepsies, leading him to pursue a young woman with reckless abandon.","translation":"小説の主人公はニンフォレプシーに苦しみ、無謀にも若い女性を追いかけることになった。"},{"sentence":"The artist's depiction of the mythological figure hinted at a sense of nympholepsies, capturing the intoxicating allure of the nymph.","translation":"その芸術家による神話上の人物の描写は、ニンフォレプシーの感覚を暗示しており、ニンフの魅惑的な魅力を捉えていた。"}],"collocations":["suffer from nympholepsies (ニンフォレプシーに苦しむ)","a case of nympholepsies (ニンフォレプシーの症例)","literary depiction of nympholepsies (ニンフォレプシーの文学的描写)"],"synonyms":["obsession","infatuation","fixation","erotomania"],"antonyms":["apathy","indifference","disinterest"]}],"etymology":{"value":"ギリシャ語の「nymphē」（若い女性、ニンフ）と「lēpsis」（発作、捕獲）に由来する。元々はニンフに魅入られた状態を指し、そこから若い女性への強迫的な欲望という意味合いに発展した。","priority":"中"},"pronunciation":{"ipa":"/ˌnɪmfəˈlɛpsiːz/","syllables":"nym-pho-lep-sies"},"inflection":{"noun_plural":"nympholepsies"},"usage_notes":{"explanation":"「nympholepsies」は、現代の精神医学ではほとんど使用されない古い用語であり、主に文学や芸術の文脈で見られる。この言葉は、若い女性に対する強烈でしばしば非現実的な欲望や憧れを指し、しばしば破滅的な結果を伴う。","priority":"低"},"common_mistakes":{"examples":[{"incorrect":"✗ He had nympholepsies for older women.","correct":"✓ He had nympholepsies for young women.","note":"Nympholepsies specifically refers to an obsession with young women."},{"incorrect":"✗ Nympholepsies is a common mental disorder.","correct":"✓ Nympholepsies is a rare term, not a common mental disorder.","note":"It is not a commonly recognized or diagnosed mental disorder in modern psychiatry."}],"priority":"低"},"related_words":{"derivatives":["nympholeptic (形容詞/名詞: ニンフォレプシーの、ニンフォレプシーの人)"],"priority":"低"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低い","priority":"低"},"readability_explanation":{"level":"C2","text":"「nympholepsies」は非常に専門的で稀な単語であり、主に文学や心理学の高度な文脈で使用されます。この単語は、若い女性に対する強烈で強迫的な欲望を指し、しばしば理想化や非現実的な期待を伴います。現代の日常会話ではほとんど使用されず、高度な読解力と専門知識が必要です。"},"example_sentences":[{"sentence":"The character's nympholepsies drove the plot, leading to his ultimate downfall.","translation":"その登場人物のニンフォレプシーが物語を動かし、彼の最終的な破滅につながった。","type":"noun","meaning_category":"ニンフォレプシー"},{"sentence":"Critics have analyzed the theme of nympholepsies in the poet's later works.","translation":"批評家たちは、その詩人の後期の作品におけるニンフォレプシーのテーマを分析した。","type":"noun","meaning_category":"ニンフォレプシー"}]}