{"word":"expurgator","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"削除者、検閲者、不適切な箇所を削除する人","english_definition":"A person who expurgates; one who removes objectionable material from a text or other work.","examples":[{"sentence":"The publisher hired an expurgator to clean up the manuscript before it went to print.","translation":"出版社は、原稿を印刷にかける前に、不適切な箇所を削除するために削除者を雇った。"},{"sentence":"The expurgator carefully reviewed the film, cutting out scenes that were deemed too violent.","translation":"削除者は映画を注意深く見直し、暴力的すぎると判断されたシーンをカットした。"}],"collocations":["hire an expurgator","act as an expurgator","literary expurgator","moral expurgator"],"synonyms":["censor","bowdlerizer","purifier","reviser","editor"],"antonyms":["none"]}],"etymology":{"value":"From Latin 'expurgare', meaning 'to cleanse, purify'. 'Ex-' (out) + 'purgare' (to purge, cleanse).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛkspərˌɡeɪtər/","syllables":"ex-pur-ga-tor"},"inflection":{"noun_plural":"expurgators"},"usage_notes":{"explanation":"'Expurgator' refers to someone who removes parts of a text, film, or other work that are considered offensive, obscene, or otherwise objectionable. The role of an expurgator is to sanitize the content, often to make it suitable for a wider audience or to comply with certain standards or regulations. This term is often used in contexts where the removal of material is seen as controversial or as a form of censorship.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a great expurgator, adding many new scenes to the movie.","correct":"✓ He was a great director, adding many new scenes to the movie.","note":"Expurgators remove content; they don't add content. Adding scenes is the job of a writer or director."},{"incorrect":"✗ The expurgator's job is to write the book.","correct":"✓ The expurgator's job is to edit the book.","note":"Expurgators edit or censor; they don't write the original work."}],"priority":"★☆☆"},"related_words":{"derivatives":["expurgate (verb)","expurgation (noun)","expurgated (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'expurgator' is a relatively uncommon term referring to someone who removes objectionable content from a text or other work. It is often used in discussions about censorship and the alteration of creative works. Understanding this word requires a good vocabulary and familiarity with the concept of censorship."},"example_sentences":[{"sentence":"The Victorian era was known for its strict expurgators who heavily censored literary works.","translation":"ビクトリア朝時代は、文学作品を厳しく検閲した厳格な削除者で知られていた。","type":"general","meaning_category":"historical context"},{"sentence":"As an expurgator, her main task was to ensure the book was suitable for young readers.","translation":"削除者として、彼女の主な仕事は、本が若い読者に適していることを確認することだった。","type":"professional role","meaning_category":"job description"}]}