{"word":"llautu","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(In Quechua cultures) A headdress or turban, often elaborately decorated, used as a symbol of authority or status.","english_definition":"A traditional Andean headdress or turban, often intricately woven and decorated, used to signify status or authority, particularly in Quechua-speaking communities.","examples":[{"sentence":"The Inca emperor wore a magnificent llautu adorned with gold and feathers.","translation":"インカ帝は金と羽で飾られた壮大なラウトゥを身に着けていた。"},{"sentence":"The intricate designs on the llautu indicated the wearer's social standing.","translation":"ラウトゥの複雑なデザインは、着用者の社会的地位を示していた。"}],"collocations":["wear a llautu","Inca llautu","ceremonial llautu","traditional llautu","woven llautu"],"synonyms":["turban","headdress","crown","headband"],"antonyms":[]}],"etymology":{"value":"From Quechua *llawtu* or *ll'awt'u*, meaning 'turban' or 'headband'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈʎaw.tu/","syllables":"llau-tu"},"inflection":{"noun_plural":"llautus"},"usage_notes":{"explanation":"The *llautu* is more than just a headdress; it's a cultural symbol with deep historical roots in the Andean region. The specific designs, colors, and materials used often carry significant meaning, indicating the wearer's role, community affiliation, or social status. While the term is most closely associated with the Inca Empire, similar types of headdresses have been used by various Andean cultures throughout history.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The llautu was a simple hat.","correct":"The llautu was an elaborate headdress.","note":"Llautus are typically intricately designed and not simple."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term *llautu* is a specialized term primarily used in the context of Andean history and culture. Understanding its significance requires familiarity with the cultural practices and social structures of the Inca Empire and other Andean societies. The word is not commonly encountered outside of academic or specialized contexts."},"example_sentences":[{"sentence":"Archaeologists discovered fragments of a llautu during the excavation of the ancient Inca site.","translation":"考古学者は古代インカの遺跡の発掘中にラウトゥの断片を発見した。","type":"noun","meaning_category":"headdress"},{"sentence":"The community leader donned his ceremonial llautu before addressing the crowd.","translation":"コミュニティのリーダーは群衆に話しかける前に儀式用のラウトゥを身に着けた。","type":"noun","meaning_category":"headdress"}]}