{"word":"liability-driven","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(金融)負債主導型の","english_definition":"(Finance) Relating to an investment strategy that focuses on managing assets to meet future liabilities.","examples":[{"sentence":"They adopted a liability-driven investing (LDI) strategy to ensure they could meet their pension obligations.","translation":"彼らは年金の義務を確実に履行できるように、負債主導型投資（LDI）戦略を採用しました。"},{"sentence":"The fund's liability-driven approach helped to stabilize its financial position during the market downturn.","translation":"そのファンドの負債主導型アプローチは、市場の低迷期における財務状況の安定に役立ちました。"}],"collocations":["liability-driven investing (LDI)","liability-driven strategy","liability-driven approach","liability-driven portfolio"],"synonyms":["LDI-focused","liability-matching"],"antonyms":["asset-driven","growth-oriented"]}],"etymology":{"value":"The term is derived from the concept that investment strategies should primarily be driven by the need to meet future liabilities, rather than solely focusing on maximizing asset growth.","priority":"★★★"},"pronunciation":{"ipa":null,"syllables":"li-a-bil-i-ty-dri-ven"},"inflection":{},"usage_notes":{"explanation":"Liability-driven investing (LDI) is an investment strategy used to manage assets in relation to future liabilities, such as pension obligations or insurance claims. It aims to minimize the risk of not being able to meet these liabilities by matching the characteristics of the assets with those of the liabilities. This approach is commonly used by pension funds, insurance companies, and other institutions with long-term financial obligations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company's asset-driven strategy was liability-driven.","correct":"✓ The company's asset-driven strategy was replaced with a liability-driven one.","note":"A strategy cannot be both asset-driven and liability-driven simultaneously. The sentence should indicate a change or replacement of strategy."}],"priority":"★★☆"},"related_words":{"derivatives":["liability","driven","investing"],"phrasal_verbs":[],"related_terms":["asset-liability management (ALM)","duration matching","immunization","pension fund","insurance company"]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency, primarily used in financial contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'liability-driven' is a specialized term used in finance, particularly in investment management. It describes an investment strategy where the primary goal is to ensure that future financial obligations (liabilities) can be met. Instead of focusing solely on maximizing investment returns, a liability-driven approach prioritizes matching the characteristics of investments with the characteristics of the liabilities. This strategy is often used by organizations like pension funds and insurance companies that have long-term financial commitments. Understanding this term requires some familiarity with financial concepts and investment strategies."},"example_sentences":[{"sentence":"The pension fund shifted to a **liability-driven** investment approach to better manage its long-term obligations.","translation":"その年金基金は、長期的な義務をより適切に管理するために、負債主導型投資アプローチに移行しました。","type":"adjective","meaning_category":"負債主導型"},{"sentence":"A **liability-driven** strategy can help to reduce the risk of a shortfall in meeting future pension payments.","translation":"負債主導型戦略は、将来の年金支払いの不足リスクを軽減するのに役立ちます。","type":"adjective","meaning_category":"負債主導型"}]}