{"word":"searchingly","priority":"★★★","meanings":[{"part_of_speech":"adverb","definition":"探るように、詮索するように、注意深く観察するように","english_definition":"in a manner that shows a desire to find something, often by looking carefully or asking questions; in a way that suggests a thorough investigation or examination.","examples":[{"sentence":"She looked at him searchingly, trying to gauge his reaction.","translation":"彼女は彼の反応を測ろうと、探るように彼を見つめた。"},{"sentence":"He questioned the witness searchingly, hoping to uncover the truth.","translation":"彼は真実を暴こうと、証人を詮索するように尋問した。"},{"sentence":"The detective examined the room searchingly for any clues.","translation":"刑事は手がかりを求めて、部屋を注意深く観察するように調べた。"}],"collocations":["look searchingly","examine searchingly","question searchingly","study searchingly"],"synonyms":["inquisitively","scrutinizingly","probingly","intently","carefully","thoroughly","closely"],"antonyms":["casually","superficially","cursorily","indifferently"]}],"etymology":{"value":"The word 'searchingly' is derived from the verb 'search' and the suffix '-ingly'. 'Search' comes from Old French 'cerchier' (to search), from Latin 'circare' (to go around, wander about), related to 'circus'. The suffix '-ingly' transforms the verb into an adverb indicating the manner of the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɜːrtʃɪŋli/","syllables":"search-ing-ly"},"inflection":{"notes":"As an adverb, 'searchingly' does not have different inflections."},"usage_notes":{"explanation":"'Searchingly' describes the manner in which someone looks, examines, or questions, implying a deep and thorough effort to find something, whether it's information, truth, or an object. It suggests a focused and attentive approach, often driven by curiosity or suspicion.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She searched the room searching.","correct":"✓ She searched the room searchingly.","note":"'Searching' as an adjective describes the act of searching itself, while 'searchingly' as an adverb describes the manner in which the action is performed."},{"incorrect":"✗ He looked searching at the document.","correct":"✓ He looked searchingly at the document.","note":"The adverb 'searchingly' directly modifies the verb 'looked', so it should be placed after the verb."}],"priority":"★★☆"},"related_words":{"derivatives":["search (verb, noun)","searching (adjective)"],"phrases":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but used in formal writing and literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Searchingly' is an adverb that describes an action done with a strong desire to find something, usually by looking closely or asking many questions. It suggests a deep and careful investigation. It's used in more advanced English to add detail about how something is done. For example, if someone 'looks searchingly', they are not just looking, but looking very carefully to find something specific."},"example_sentences":[{"sentence":"The interviewer questioned the candidate searchingly about their past experience.","translation":"面接官は候補者の過去の経験について、詮索するように質問した。","type":"adverb","meaning_category":"questioning"},{"sentence":"She gazed searchingly into his eyes, trying to discern his true feelings.","translation":"彼女は彼の本当の気持ちを見抜こうと、探るように彼の目をじっと見つめた。","type":"adverb","meaning_category":"looking"},{"sentence":"The scientist studied the data searchingly, hoping to find a pattern.","translation":"科学者はパターンを見つけようと、データを注意深く観察するように調べた。","type":"adverb","meaning_category":"studying"}]}