{"word":"filter-passing","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(情報セキュリティ)フィルタリングを通過すること、フィルタリングを回避すること","english_definition":"The act of successfully bypassing a filter, especially in the context of information security.","examples":[{"sentence":"The attacker used a sophisticated technique for filter-passing to inject malicious code.","translation":"攻撃者は高度なフィルタ回避技術を使用して、悪意のあるコードを注入しました。"},{"sentence":"The security team is working to identify and patch vulnerabilities that allow filter-passing.","translation":"セキュリティチームは、フィルタ回避を可能にする脆弱性を特定し、修正する作業に取り組んでいます。"},{"sentence":"Effective input validation is crucial to prevent filter-passing attacks.","translation":"効果的な入力検証は、フィルタ回避攻撃を防ぐために非常に重要です。"}],"collocations":["filter-passing technique","filter-passing vulnerability","prevent filter-passing","filter-passing attack"],"synonyms":["filter bypass","filter evasion","content filtering bypass"],"antonyms":["filter enforcement","content filtering"],"related_terms":["XSS (Cross-Site Scripting)","SQL injection","input validation","web application firewall (WAF)"]}],"etymology":{"value":"A compound word formed by combining 'filter' (referring to a mechanism for screening or blocking unwanted content) and 'passing' (referring to the act of successfully moving through or beyond something).","priority":"N/A"},"pronunciation":{"ipa":"/ˈfɪltərˌpæsɪŋ/","syllables":"fil-ter-pass-ing"},"inflection":{"noun_plural":"filter-passings"},"usage_notes":{"explanation":"'Filter-passing' is primarily used in the context of computer security, particularly web application security. It describes methods used by attackers to circumvent security filters designed to block malicious input. These filters are intended to prevent attacks such as Cross-Site Scripting (XSS) and SQL injection. The term highlights the importance of robust filter design and input validation to ensure effective security.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The new software is filter-passing.","correct":"✓ The new software is vulnerable to filter-passing.","note":"'Filter-passing' itself is not a property of software. Software can be *vulnerable* to filter-passing attacks. The term describes the *act* of bypassing a filter."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["firewall","intrusion detection system (IDS)","intrusion prevention system (IPS)","whitelist","blacklist"]},"level_frequency":{"CEFR":"C2 (Technical vocabulary related to cybersecurity)","frequency_google_ngram":"Low frequency (Specialized technical term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Filter-passing' is a technical term used in cybersecurity. It describes the action of an attacker successfully bypassing a security filter that is intended to block malicious input or code. This is often done to carry out attacks like XSS or SQL injection. Understanding this term requires familiarity with web application security concepts and common attack vectors."},"example_sentences":[{"sentence":"The penetration tester demonstrated a successful filter-passing exploit.","translation":"侵入テスターは、フィルタ回避エクスプロイトの成功を実証しました。","type":"noun","meaning_category":"security exploit"},{"sentence":"The WAF needs to be updated to prevent new filter-passing techniques.","translation":"新しいフィルタ回避技術を防ぐために、WAFを更新する必要があります。","type":"noun","meaning_category":"security measure"},{"sentence":"Researchers are studying various filter-passing methods to improve security defenses.","translation":"研究者たちは、セキュリティ防御を改善するために、さまざまなフィルタ回避方法を研究しています。","type":"noun","meaning_category":"research area"}]}