{"word":"half-mourning","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"準喪服、半喪","english_definition":"A period or state of reduced or partial mourning, typically following a period of deep mourning. Also refers to clothing worn during this period.","examples":[{"sentence":"After the initial period of deep mourning, she entered a period of half-mourning, wearing gray and lavender.","translation":"最初の深い喪の期間の後、彼女は準喪の期間に入り、灰色とラベンダー色の服を着ていた。"},{"sentence":"The etiquette books of the Victorian era dictated specific colors and fabrics for half-mourning attire.","translation":"ヴィクトリア朝時代のエチケット本には、準喪服の服装にふさわしい特定の色と生地が規定されていた。"}],"collocations":["wear half-mourning","enter half-mourning","period of half-mourning","half-mourning attire","observe half-mourning"],"synonyms":["light mourning","secondary mourning"],"antonyms":["full mourning","deep mourning"]}],"etymology":{"value":"A compound word formed from \"half\" and \"mourning.\" It reflects a state of reduced or partial mourning, less intense than full or deep mourning. The practice and associated terminology were particularly prevalent in the Victorian era.","priority":"★★★"},"pronunciation":{"ipa":"/ˌhæfˈmɔːrnɪŋ/","syllables":"half-mourn-ing"},"inflection":{"noun_plural":"N/A (uncountable noun)"},"usage_notes":{"explanation":"\"Half-mourning\" refers to a period of mourning that is less strict or intense than full or deep mourning. It also describes the clothing worn during this period. The colors associated with half-mourning are typically lighter than black, such as gray, lavender, or muted shades of purple. The concept was more common in past eras, particularly the Victorian era, when mourning customs were highly formalized.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She wears half mourning dress.","correct":"✓ She wears half-mourning attire. / ✓ She wears half-mourning.","note":"While \"half-mourning dress\" might be understood, \"half-mourning attire\" or simply \"half-mourning\" is more common and grammatically correct. Using \"half-mourning\" as an adjective to describe clothing requires careful construction."},{"incorrect":"✗ He is in half-mourning for a year.","correct":"✓ He observed half-mourning for a year. / ✓ He was in half-mourning for a year.","note":"\"Observe half-mourning\" is a common phrase to describe the act of participating in half-mourning. Alternatively, \"He was in half-mourning\" is also correct."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["mourning","full mourning","deep mourning","bereavement","grief","etiquette","Victorian era"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low frequency - primarily used in historical or cultural contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Half-mourning\" is a specialized term referring to a period of reduced mourning, typically following a period of deep mourning. It also describes the clothing worn during this time, which is usually in lighter colors than full mourning attire (e.g., gray, lavender). The concept is most associated with historical periods, particularly the Victorian era, when mourning customs were highly structured. Understanding the term requires familiarity with historical social customs and vocabulary related to grief and bereavement."},"example_sentences":[{"sentence":"After several months of wearing black, she transitioned to half-mourning, donning shades of gray and purple.","translation":"数ヶ月間黒い服を着た後、彼女は準喪に移行し、灰色と紫色の服を着始めた。","type":"noun","meaning_category":"準喪服"},{"sentence":"The rules of half-mourning were less strict than those of full mourning, allowing for some ornamentation and lighter fabrics.","translation":"準喪の規則は本喪の規則ほど厳しくなく、ある程度の装飾やより軽い生地が許容されていた。","type":"noun","meaning_category":"準喪"}]}