{"word":"hetairist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"古代ギリシャの高級娼婦を支持する人、またはヘタイライ（高級娼婦）の慣習を支持する人","english_definition":"A supporter of hetairas (ancient Greek courtesans) or the hetairism practice.","examples":[{"sentence":"He was known as a hetairist for his admiration of Aspasia.","translation":"彼はアスパシアを称賛していたため、ヘタイリストとして知られていた。"},{"sentence":"The philosopher defended the role of hetairas, marking him as a hetairist.","translation":"その哲学者はヘタイライの役割を擁護し、彼をヘタイリストとして特徴づけた。"}],"collocations":["a known hetairist","a defender of hetairism"],"synonyms":["admirer of courtesans","supporter of hetaerism"],"antonyms":["critic of hetaerism"]}],"etymology":{"value":"「hetaira」（古代ギリシャの高級娼婦）+ 「-ist」（～主義者、～を支持する人）","priority":"☆☆☆"},"pronunciation":{"ipa":"/hɪˈtaɪərɪst/","syllables":"he-tai-rist"},"inflection":{"noun_plural":"hetairists"},"usage_notes":{"explanation":"この単語は非常に専門的で、歴史的な文脈でのみ使用されます。現代ではほとんど使われません。","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a hetairist because he likes women.","correct":"✓ He is a hetairist because he admires the role of hetairas in ancient Greek society.","note":"「hetairist」は単に女性が好きというだけでなく、古代ギリシャのヘタイライの役割や地位を支持または称賛する人を指します。"}],"priority":"☆☆☆"},"related_words":{"derivatives":["hetaira","hetaerism"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'hetairist' is a highly specialized term related to ancient Greek history and culture. It refers to someone who supports or admires the hetairai, who were highly educated and sophisticated courtesans. This word is rarely encountered in modern English and is primarily used in academic or historical contexts."},"example_sentences":[{"sentence":"As a self-proclaimed hetairist, he often lectured on the social influence of ancient Greek courtesans.","translation":"自称ヘタイリストとして、彼は古代ギリシャの高級娼婦の社会的影響についてしばしば講義を行った。","type":"noun","meaning_category":"支持者"},{"sentence":"The historian's analysis revealed him to be a hetairist, emphasizing the hetairas' contributions to intellectual discourse.","translation":"歴史家の分析により、彼がヘタイリストであることが明らかになり、ヘタイライの知的議論への貢献を強調した。","type":"noun","meaning_category":"支持者"}]}