{"word":"self-esteeming","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"自尊心のある、自尊感情の高い","english_definition":"having or showing a high opinion of oneself or one's abilities; possessing or demonstrating self-esteem.","examples":[{"sentence":"A self-esteeming person is more likely to take risks and pursue their goals.","translation":"自尊心のある人は、リスクを冒して目標を追求する可能性が高いです。"},{"sentence":"She is a self-esteeming individual who believes in her own capabilities.","translation":"彼女は自分の能力を信じる自尊心のある人です。"}],"collocations":["high self-esteem","positive self-esteem","low self-esteem"],"synonyms":["self-respecting","confident","assured","self-assured","proud"],"antonyms":["self-deprecating","humble","insecure","self-doubting"]}],"etymology":{"value":"The word is formed by combining 'self' and 'esteeming'. 'Self' refers to the individual person as the object of their own reflection or action. 'Esteeming' is the present participle of the verb 'esteem,' which means to respect and admire. Therefore, 'self-esteeming' describes someone who respects and values themselves.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌself ɪˈstiːmɪŋ/","syllables":"self-es-teem-ing"},"inflection":{"notes":"This is an adjective, so it does not have plural forms or verb conjugations. Its comparative and superlative forms are 'more self-esteeming' and 'most self-esteeming', respectively."},"usage_notes":{"explanation":"'Self-esteeming' is used to describe someone who has a healthy sense of their own worth and value. It is often used in discussions about mental health and personal development. It is important to note that 'self-esteeming' is not the same as being arrogant or conceited; it simply means having a positive and realistic view of oneself.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is very self-esteemed.","correct":"✓ He is very self-esteeming.","note":"'Self-esteemed' is less common than 'self-esteeming'. While 'self-esteemed' could be understood, 'self-esteeming' is the more widely accepted and frequently used form."},{"incorrect":"✗ She is a self-esteeming but humble person.","correct":"✓ She is a self-esteeming and humble person.","note":"While it's possible to be both self-esteeming and humble, it's important to clarify that self-esteem is not the same as arrogance. A self-esteeming person can still be humble and recognize their limitations."}],"priority":"★★☆"},"related_words":{"derivatives":["self-esteem (noun: 自尊心)","esteem (verb: 尊重する、評価する)"],"phrases":["build self-esteem","boost self-esteem","lack of self-esteem"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Self-esteeming' is an adjective that describes someone who has a good opinion of themselves and their abilities. It's not a very common word, but it's useful for talking about people who are confident and value themselves. It's important to remember that being 'self-esteeming' is different from being arrogant or thinking you're better than others. It simply means having a healthy respect for yourself."},"example_sentences":[{"sentence":"The therapist encouraged her to become more self-esteeming by focusing on her strengths.","translation":"セラピストは、彼女に自分の強みに焦点を当てることで、より自尊心を持つように勧めました。","type":"adjective","meaning_category":"自尊心のある"},{"sentence":"A self-esteeming attitude can lead to greater success in both personal and professional life.","translation":"自尊心のある態度は、私生活と仕事の両方でより大きな成功につながる可能性があります。","type":"adjective","meaning_category":"自尊心のある"},{"sentence":"It's important for parents to raise self-esteeming children who believe in themselves.","translation":"親が、自分自身を信じる自尊心のある子供たちを育てることは重要です。","type":"adjective","meaning_category":"自尊心のある"}]}