{"word":"Etherealize","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人や物を)非物質的なものにする、実体のないものにする、精神化する","english_definition":"To make ethereal; to treat as something light, airy, or tenuous; to refine into a more spiritual or delicate substance or quality.","examples":[{"sentence":"The artist sought to etherealize the human form in his paintings.","translation":"その芸術家は絵画の中で人間の姿を非物質的なものにしようとした。"},{"sentence":"The composer etherealized the folk melody into a hauntingly beautiful piece.","translation":"作曲家はその民謡を、心に残る美しい作品へと精神化させた。"},{"sentence":"Through meditation, she tried to etherealize her thoughts and emotions.","translation":"瞑想を通して、彼女は自身の思考と感情を精神化しようと試みた。"}],"collocations":["etherealize a concept (概念を精神化する)","etherealize a figure (人物を非物質化する)","etherealize emotions (感情を精神化する)"],"synonyms":["spiritualize","rarefy","sublimate","attenuate","deliquesce"],"antonyms":["materialize","solidify","concretize","substantialize"]},{"part_of_speech":"verb","transitivity":"vi","definition":"非物質的なものになる、精神化する","english_definition":"To become ethereal; to take on a light, airy, or tenuous quality.","examples":[{"sentence":"As the mist rose, the landscape seemed to etherealize before our eyes.","translation":"霧が立ち上るにつれて、風景は目の前で非物質的なものになっていくようだった。"},{"sentence":"With time, the memories began to etherealize, losing their sharp edges.","translation":"時が経つにつれて、記憶は精神化し始め、その鮮明さを失っていった。"}],"collocations":["memories etherealize (記憶が精神化する)","landscapes etherealize (風景が非物質化する)"],"synonyms":["dissolve","fade","rarefy","become airy"],"antonyms":["solidify","coagulate","materialize"]}],"etymology":{"value":"\"Ethereal\" + \"-ize\". \"Ethereal\" comes from the Late Latin \"aethereus\" and Greek \"aitherios\", meaning 'upper air, heavenly'. The suffix \"-ize\" means 'to make, to render'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈθɪəriəlaɪz/","syllables":"e-the-re-al-ize"},"inflection":{"verb_forms":{"present_simple":["etherealize","etherealizes"],"past_simple":"etherealized","past_participle":"etherealized","present_participle":"etherealizing"}},"usage_notes":{"explanation":"\"Etherealize\" is a relatively uncommon word that describes the process of making something immaterial, delicate, or spiritual. It often implies a transformation from a more concrete or physical state to a more abstract or refined one. It can be used in both a transitive sense (to make something ethereal) and an intransitive sense (to become ethereal). The word is often used in artistic, philosophical, or spiritual contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She tried to eternalize the moment.","correct":"✓ She tried to etherealize the moment.","note":"\"Eternalize\" means to make something last forever, while \"etherealize\" means to make something immaterial or spiritual. They are different concepts."},{"incorrect":"✗ The artist etherealized the painting with bright colors.","correct":"✓ The artist etherealized the painting with soft, muted colors.","note":"Etherealizing often involves making something less solid or substantial, so bright colors might not be the best way to achieve this effect. Soft, muted colors are more likely to create an ethereal quality."}],"priority":"★★☆"},"related_words":{"derivatives":["etherealization (noun: the act of making something ethereal)","ethereal (adjective: extremely delicate and light in a way that seems too perfect for this world)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Etherealize' is a sophisticated word that means to make something seem light, airy, or not of this world, often in a spiritual or artistic way. It's not a common word, so you'll mostly find it in writing about art, philosophy, or spirituality. It suggests taking something real and making it more like a dream or a feeling. Think of it as turning something solid into something like a mist or a memory."},"example_sentences":[{"sentence":"The photographer used soft focus to etherealize the model's features.","translation":"写真家はソフトフォーカスを使って、モデルの顔立ちを非物質的なものにした。","type":"verb (vt)","meaning_category":"非物質的なものにする"},{"sentence":"The music seemed to etherealize the atmosphere of the concert hall.","translation":"その音楽はコンサートホールの雰囲気を精神化させるようだった。","type":"verb (vt)","meaning_category":"精神化する"},{"sentence":"As the sun set, the mountains began to etherealize in the fading light.","translation":"日が沈むにつれて、山々は薄れゆく光の中で非物質的なものになり始めた。","type":"verb (vi)","meaning_category":"非物質的なものになる"}]}