{"word":"Lahnda","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ラフンダー語 (パキスタン西部で話される言語グループ)","english_definition":"A group of Indo-Aryan languages spoken in western Punjab, Pakistan.","examples":[{"sentence":"Lahnda is a group of languages, not a single language.","translation":"ラフンダー語は単一の言語ではなく、言語グループです。"},{"sentence":"The speakers of Lahnda are primarily located in the Punjab province.","translation":"ラフンダー語の話し手は主にパンジャブ州に位置しています。"}],"collocations":["Lahnda dialects","Lahnda speakers","Punjabi and Lahnda"],"synonyms":["Western Punjabi","Lahndi"],"antonyms":[]},{"part_of_speech":"adjective","definition":"ラフンダー語の、ラフンダー語に関する","english_definition":"Relating to the Lahnda languages.","examples":[{"sentence":"The Lahnda dialects are closely related to Punjabi.","translation":"ラフンダー語の方言はパンジャブ語と密接に関連しています。"},{"sentence":"There is debate about whether Lahnda is a distinct language or a dialect of Punjabi.","translation":"ラフンダー語が独立した言語であるか、パンジャブ語の方言であるかについては議論があります。"}],"collocations":["Lahnda literature","Lahnda culture","Lahnda region"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Lahnda' is derived from the Punjabi word 'lahnda', meaning 'western'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlʌndə/","syllables":"Lund-da"},"inflection":{"notes":"The word 'Lahnda' does not typically inflect as it is primarily a proper noun or adjective."},"usage_notes":{"explanation":"'Lahnda' is used to refer to a group of related languages spoken in the western Punjab region of Pakistan. It is sometimes considered a dialect continuum rather than a set of distinct languages. The classification of Lahnda as a separate language group from Punjabi is a subject of ongoing debate among linguists.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Lahnda is a language spoken in India.","correct":"✓ Lahnda is a language spoken in Pakistan.","note":"Lahnda is spoken in Pakistan, not India."},{"incorrect":"✗ Lahnda is the same as Punjabi.","correct":"✓ Lahnda is related to Punjabi, but is considered by some to be a distinct language group.","note":"Lahnda is related to Punjabi, but they are not the same."}],"priority":"★★☆"},"related_words":{"derivatives":["None commonly used."],"phrasal_verbs":["None applicable."],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lahnda' refers to a group of Indo-Aryan languages spoken in the western Punjab region of Pakistan. It is often debated whether Lahnda is a distinct language or a dialect continuum of Punjabi. Understanding the term requires knowledge of South Asian linguistics and geography."},"example_sentences":[{"sentence":"The classification of Lahnda languages is a complex issue in South Asian linguistics.","translation":"ラフンダー語の分類は、南アジアの言語学における複雑な問題です。","type":"noun","meaning_category":"Language Group"},{"sentence":"Several dialects are considered part of the Lahnda language group.","translation":"いくつかの方言がラフンダー語群の一部とみなされています。","type":"noun","meaning_category":"Language Group"},{"sentence":"The Lahnda-speaking region has a rich cultural history.","translation":"ラフンダー語を話す地域には豊かな文化史があります。","type":"adjective","meaning_category":"Relating to the Languages"}]}