{"word":"plum-cake","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"プラムケーキ","english_definition":"A type of cake containing dried or candied fruit, especially plums or raisins.","examples":[{"sentence":"She baked a delicious plum-cake for Christmas.","translation":"彼女はクリスマスに美味しいプラムケーキを焼いた。"},{"sentence":"We enjoyed a slice of plum-cake with our afternoon tea.","translation":"私たちは午後の紅茶と共にプラムケーキを一切れ楽しんだ。"}],"collocations":["bake a plum-cake","slice of plum-cake","Christmas plum-cake"],"synonyms":["fruitcake","raisin cake"],"antonyms":[]}],"etymology":{"value":"The term 'plum-cake' comes from the historical use of dried plums (or prunes) as a common ingredient. Over time, other dried fruits like raisins and currants were also used, but the name stuck.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈplʌmˌkeɪk/","syllables":"plum-cake"},"inflection":{"noun_plural":"plum-cakes"},"usage_notes":{"explanation":"'Plum-cake' is a traditional cake often associated with holidays like Christmas. While it originally contained plums, modern versions often include a mix of dried fruits. It can be dense and rich, sometimes soaked in alcohol to preserve it and enhance its flavor.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate a plum cake, it didn't have any plums.","correct":"✓ I ate a plum-cake, but it didn't have any plums.","note":"The name 'plum-cake' is historical; it doesn't necessarily mean the cake contains plums today."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"'Plum-cake' is a type of cake that usually has dried fruits in it. It's often eaten during special times like Christmas. Even though it's called 'plum-cake,' it might not always have plums in it. It's a bit like fruitcake but can have its own special taste."},"example_sentences":[{"sentence":"Grandma always makes a big plum-cake for the family gathering.","translation":"祖母はいつも家族の集まりのために大きなプラムケーキを作る。","type":"noun","meaning_category":"プラムケーキ"},{"sentence":"The aroma of the plum-cake filled the kitchen with a festive scent.","translation":"プラムケーキの香りが台所を祝祭の香りで満たした。","type":"noun","meaning_category":"プラムケーキ"}]}