{"word":"factioneer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"派閥活動家、党派主義者","english_definition":"A person who engages in factionalism; one who promotes the interests of a faction, often in a disruptive or self-serving manner.","examples":[{"sentence":"The political landscape was marred by factioneers vying for power.","translation":"政界は権力を争う党派主義者たちによって損なわれていた。"},{"sentence":"He was accused of being a factioneer, more interested in personal gain than the good of the party.","translation":"彼は党の利益よりも個人的な利益に関心がある党派活動家だと非難された。"}],"collocations":["political factioneer","party factioneer"],"synonyms":["partisan","cabalist","schemer","intriguer"],"antonyms":["unifier","peacemaker","conciliator"]},{"part_of_speech":"verb","transitivity":"vi","definition":"派閥活動を行う、党派主義的に行動する","english_definition":"To engage in factionalism; to act as a factioneer.","examples":[{"sentence":"They factioneered within the organization, creating divisions and hindering progress.","translation":"彼らは組織内で派閥活動を行い、分裂を生み出し、進歩を妨げた。"},{"sentence":"Instead of working together, they factioneered and undermined each other's efforts.","translation":"協力する代わりに、彼らは派閥活動を行い、互いの努力を弱体化させた。"}],"collocations":["factioneer within a party","factioneer against someone"],"synonyms":["intrigue","scheme","plot","cabal"],"antonyms":["cooperate","collaborate","unite"]}],"etymology":{"value":"Derived from 'faction' (a group or clique within a larger group, often dissenting or self-seeking) + '-eer' (a suffix denoting a person engaged in a particular activity).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfækʃəˈnɪər/","syllables":"fac-tion-eer"},"inflection":{"noun_plural":"factioneers","verb_forms":{"present_simple":["factioneer","factioneers"],"past_simple":"factioneered","past_participle":"factioneered","present_participle":"factioneering"}},"usage_notes":{"explanation":"'Factioneer' typically carries a negative connotation, implying that the person or group is more concerned with their own narrow interests than with the well-being of the larger organization or community. It is often used in political or organizational contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a factionary.","correct":"✓ He is a factioneer.","note":"The correct term for a person engaged in factionalism is 'factioneer,' not 'factionary.'"},{"incorrect":"✗ They are factioneering for the good of the company.","correct":"✓ They are factioneering, but it is not for the good of the company.","note":"'Factioneering' usually implies self-serving motives rather than the overall good."}],"priority":"★★☆"},"related_words":{"derivatives":["factional (adjective)","factionalism (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Factioneer' is a relatively uncommon word used to describe someone who actively participates in factionalism, often with negative implications. It suggests a focus on promoting the interests of a particular faction, potentially at the expense of broader goals or unity. The word is most often found in political or organizational contexts where internal divisions and power struggles are present."},"example_sentences":[{"sentence":"The senator was known as a skilled factioneer, adept at manipulating alliances.","translation":"その上院議員は、同盟を操るのが上手な熟練した党派活動家として知られていた。","type":"noun","meaning_category":"派閥活動家"},{"sentence":"The article criticized the way some members factioneered, creating unnecessary conflict.","translation":"その記事は、一部のメンバーが不必要な対立を生み出しながら派閥活動を行ったやり方を批判した。","type":"verb","meaning_category":"派閥活動を行う"}]}