{"word":"Surrein","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Fantasy setting) A powerful magical artifact or location, often associated with immense power or significance.","english_definition":"In some fantasy settings, 'Surrein' refers to a significant magical artifact or a place of great power. Its specific attributes and role vary depending on the fictional universe.","examples":[{"sentence":"The heroes sought the Surrein to defeat the dark lord.","translation":"英雄たちは暗黒卿を倒すためにサレインを探し求めた。"},{"sentence":"The ancient texts spoke of the Surrein's ability to control the elements.","translation":"古代の文献には、サレインが元素を操る能力を持つと記されていた。"},{"sentence":"Legend says the Surrein is hidden within the Crystal Caves.","translation":"伝説によれば、サレインはクリスタル洞窟の中に隠されているという。"}],"collocations":["Seek the Surrein","Power of the Surrein","Hidden Surrein","Ancient Surrein"],"synonyms":["artifact","relic","source of power","nexus","focus"],"antonyms":[]}],"etymology":{"value":"Likely a constructed word for a fantasy setting, possibly derived from elements suggesting 'above' or 'ruling' combined with a suffix indicating a thing or place.","priority":"★☆☆"},"pronunciation":{"ipa":"/sɜːˈreɪn/","syllables":"Sur-rein"},"inflection":{"noun_plural":"Surreins"},"usage_notes":{"explanation":"'Surrein' is typically used within the context of a specific fantasy world or game. Its meaning and importance are defined by the lore of that particular setting. It is not a commonly used word in general English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I found a surrein in my backyard.","correct":"✓ (Within the context of a fantasy story) I found a Surrein in my backyard.","note":"The word is specific to fantasy settings, so using it in a real-world context would be incorrect unless you are role-playing or referencing a specific fictional work."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - likely specific to certain fantasy works.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Surrein' is a highly specialized term used in some fantasy settings. Understanding its meaning requires familiarity with the specific fictional universe in which it appears. It is not part of standard English vocabulary. Its usage is limited to discussions about or within those particular fantasy worlds."},"example_sentences":[{"sentence":"The fate of the kingdom rested on finding the lost Surrein.","translation":"王国の運命は、失われたサレインを見つけることにかかっていた。","type":"noun","meaning_category":"Magical Artifact"},{"sentence":"Only those with pure hearts could wield the power of the Surrein.","translation":"純粋な心を持つ者だけが、サレインの力を振るうことができた。","type":"noun","meaning_category":"Source of Power"},{"sentence":"The Surrein pulsed with an ancient energy.","translation":"サレインは古代のエネルギーで脈打っていた。","type":"noun","meaning_category":"Magical Location"}]}