{"word":"cold-adapted","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"寒冷適応した、寒冷地に適応した","english_definition":"Adapted to cold environments; able to survive and thrive in cold conditions.","examples":[{"sentence":"The arctic fox is a cold-adapted animal.","translation":"ホッキョクギツネは寒冷適応した動物です。"},{"sentence":"Cold-adapted plants can survive freezing temperatures.","translation":"寒冷適応した植物は氷点下の気温でも生き残ることができます。"},{"sentence":"These bacteria are cold-adapted and can grow at low temperatures.","translation":"これらのバクテリアは寒冷適応しており、低温で成長することができます。"}],"collocations":["cold-adapted species","cold-adapted microorganisms","cold-adapted enzymes","cold-adapted technology"],"synonyms":["cryophilic","psychrophilic","freeze-tolerant","cold-hardy"],"antonyms":["heat-adapted","thermophilic","heat-sensitive"]}],"etymology":{"value":"The word \"cold-adapted\" is formed by combining \"cold\" and \"adapted\". \"Cold\" refers to low temperatures, and \"adapted\" means having adjusted to environmental conditions through evolutionary processes.","priority":"N/A"},"pronunciation":{"ipa":"/ˈkoʊld əˈdæptɪd/","syllables":"cold-a-dapt-ed"},"inflection":{"notes":"This is an adjective, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"\"Cold-adapted\" is used to describe organisms, systems, or technologies that have evolved or been designed to function effectively in cold environments. It implies a specific set of traits or characteristics that allow for survival and optimal performance in low-temperature conditions.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The plant is cold adapted.","correct":"The plant is cold-adapted.","note":"The hyphen is important to show that \"cold\" and \"adapted\" are working together as a compound adjective."}],"priority":"N/A"},"related_words":{"derivatives":["cold adaptation (寒冷適応)"],"phrases":["cold tolerance (耐寒性)","freeze resistance (耐凍性)","psychrophile (低温菌)","cryophile (低温生物)"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - specialized term used in scientific contexts.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term \"cold-adapted\" describes something that has changed or evolved to live well in cold places. It's often used in science to talk about animals, plants, or even tiny organisms that can survive in freezing temperatures. It means they have special features or abilities that help them cope with the cold.","priority":"N/A"},"example_sentences":[{"sentence":"The researchers studied cold-adapted enzymes from Antarctic bacteria.","translation":"研究者たちは南極のバクテリアから得られた寒冷適応酵素を研究しました。","type":"adjective","meaning_category":"寒冷適応した"},{"sentence":"Many cold-adapted fish have antifreeze proteins in their blood.","translation":"多くの寒冷適応した魚は血液中に不凍タンパク質を持っています。","type":"adjective","meaning_category":"寒冷適応した"},{"sentence":"The development of cold-adapted crops could improve food security in northern regions.","translation":"寒冷適応作物の開発は、北部地域の食糧安全保障を向上させる可能性があります。","type":"adjective","meaning_category":"寒冷適応した"}]}