{"word":"Vaccinophobia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ワクチン恐怖症、ワクチン接種に対する極度の恐怖または嫌悪感","english_definition":"The fear of vaccination or inoculation.","examples":[{"sentence":"Vaccinophobia can lead individuals to avoid necessary vaccinations.","translation":"ワクチン恐怖症は、必要なワクチン接種を避ける原因となることがあります。"},{"sentence":"Understanding the roots of vaccinophobia is crucial for public health efforts.","translation":"ワクチン恐怖症の根源を理解することは、公衆衛生の取り組みにとって重要です。"}],"collocations":["overcome vaccinophobia (ワクチン恐怖症を克服する)","address vaccinophobia (ワクチン恐怖症に対処する)","combat vaccinophobia (ワクチン恐怖症と闘う)","vaccine hesitancy (ワクチン躊躇)"],"synonyms":["fear of needles","needle phobia","trypanophobia"],"antonyms":["vaccine acceptance","vaccine enthusiasm","pro-vaccination"],"notes":"Vaccinophobia is a specific type of phobia related to medical procedures. It can be associated with a more general fear of needles (trypanophobia) or medical interventions."}],"etymology":{"value":"The word \"vaccinophobia\" is derived from the Latin word \"vaccina,\" meaning \"of or from cows\" (referring to the early use of cowpox virus in vaccination), combined with the Greek word \"phobos,\" meaning \"fear.\"","priority":"★★★"},"pronunciation":{"ipa":"/ˌvæksɪnoʊˈfoʊbiə/","syllables":"vac-ci-no-pho-bi-a"},"inflection":{"noun_plural":"vaccinophobias"},"usage_notes":{"explanation":"\"Vaccinophobia\" refers to an irrational and excessive fear of vaccines or the act of vaccination. It is a significant factor contributing to vaccine hesitancy and can have serious implications for public health, as it may lead individuals to avoid vaccinations, increasing the risk of infectious disease outbreaks.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has vaccinophobia, so he is vaccine.","correct":"✓ He has vaccinophobia, so he is against vaccines.","note":"\"Vaccine\" is a noun or adjective, not a state of being. Use \"against vaccines\" or \"anti-vaccine\" to describe someone who opposes vaccination."},{"incorrect":"✗ Vaccinophobia is when you don't like shots.","correct":"✓ Vaccinophobia is an extreme fear of vaccinations.","note":"Vaccinophobia is more than just disliking shots; it's an intense, irrational fear."}],"priority":"★★☆"},"related_words":{"derivatives":["vaccinophobic (adjective: ワクチン恐怖症の)","vaccine hesitancy (名詞: ワクチン躊躇)","anti-vaxxer (名詞: 反ワクチン主義者)"],"phrases":["addressing vaccine hesitancy (ワクチン躊躇への対処)","promoting vaccine confidence (ワクチンへの信頼を促進する)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Vaccinophobia\" is a specialized term referring to the intense and irrational fear of vaccines or the act of vaccination. It is more than just a dislike of needles; it represents a significant anxiety that can lead individuals to avoid necessary medical interventions. This term is often used in discussions related to public health, vaccine hesitancy, and the promotion of vaccine confidence. Understanding this term is relevant in the context of medical and social discussions surrounding vaccination.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor tried to reassure the patient who suffered from severe vaccinophobia.","translation":"医師は重度のワクチン恐怖症に苦しむ患者を安心させようと努めた。","type":"general","meaning_category":"fear of vaccination"},{"sentence":"Public health campaigns aim to reduce vaccinophobia by providing accurate information about vaccines.","translation":"公衆衛生キャンペーンは、ワクチンに関する正確な情報を提供することで、ワクチン恐怖症を減らすことを目指している。","type":"general","meaning_category":"fear of vaccination"},{"sentence":"Vaccinophobia is a complex issue influenced by various factors, including misinformation and personal experiences.","translation":"ワクチン恐怖症は、誤った情報や個人的な経験など、さまざまな要因に影響される複雑な問題である。","type":"general","meaning_category":"fear of vaccination"}]}