{"word":"colorimeter","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"比色計","english_definition":"An instrument used to measure the absorbance and transmittance of light through a solution, used to determine the concentration of a known solute.","examples":[{"sentence":"The concentration of the dye was determined using a colorimeter.","translation":"その染料の濃度は比色計を使って測定された。"},{"sentence":"The lab uses a colorimeter to analyze water samples.","translation":"その研究所では、比色計を使って水サンプルを分析している。"}],"collocations":["use a colorimeter","calibrate a colorimeter","digital colorimeter","portable colorimeter"],"synonyms":["spectrophotometer"],"antonyms":[]}],"etymology":{"value":"Derived from 'color' + '-i-' (connecting vowel) + '-meter' (measuring instrument).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌkʌlərˈɪmɪtər/","syllables":"co-lor-im-e-ter"},"inflection":{"noun_plural":"colorimeters"},"usage_notes":{"explanation":"A colorimeter measures color by quantifying the amount of light that passes through a liquid sample. It is often used in chemistry, biology, and environmental science.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Use the colorimeter to see the color.","correct":"✓ Use the colorimeter to measure the absorbance of the solution.","note":"A colorimeter measures absorbance, not the color directly. "},{"incorrect":"✗ Colorimeter is same as spectrophotometer, so it can measure UV light.","correct":"✓ Some spectrophotometers can measure UV light, but basic colorimeters are usually limited to visible light.","note":"While related, colorimeters are often simpler instruments than spectrophotometers and may not measure UV light."}],"priority":"☆☆☆"},"related_words":{"derivatives":["colorimetric (adjective)","colorimetry (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"A colorimeter is a scientific instrument used to measure the absorbance or transmission of light through a liquid sample. It is commonly used to determine the concentration of a substance in a solution. The term is technical and primarily encountered in scientific contexts.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The student used a colorimeter to measure the concentration of copper sulfate in the solution.","translation":"学生は比色計を使って溶液中の硫酸銅の濃度を測定した。","type":"general","meaning_category":"measurement"},{"sentence":"The lab technician calibrated the colorimeter before starting the experiment.","translation":"実験を始める前に、実験技師は比色計を校正した。","type":"technical","meaning_category":"calibration"},{"sentence":"The portable colorimeter allowed for on-site water quality testing.","translation":"その携帯型比色計により、現場での水質検査が可能になった。","type":"application","meaning_category":"application"}]}