{"word":"trichophyllous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"糸状の葉を持つ、毛状の葉を持つ","english_definition":"Having leaves that are thread-like or hair-like.","examples":[{"sentence":"The trichophyllous aquatic plant floated gently in the stream.","translation":"その糸状の葉を持つ水生植物は小川の中で穏やかに漂っていた。"},{"sentence":"Many alpine plants are trichophyllous to reduce water loss in the harsh environment.","translation":"多くの高山植物は、厳しい環境での水分損失を減らすために、毛状の葉を持っている。"}],"collocations":["trichophyllous leaves","trichophyllous plant","aquatic trichophyllous plant"],"synonyms":["filiform","capillaceous","setaceous"],"antonyms":["laminar","broadleaf","latifoliate"]}],"etymology":{"value":"Derived from the Greek words 'thrix' (hair), 'trichos' (of hair) + 'phyllon' (leaf) + '-ous' (having, possessing).","priority":"★★★"},"pronunciation":{"ipa":"/ˌtrɪkəˈfɪləs/","syllables":"tri-cho-phyl-lous"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. There are no specific inflections beyond comparative and superlative forms (more trichophyllous, most trichophyllous), but these are rarely used."},"usage_notes":{"explanation":"This term is primarily used in botany to describe plants with very fine, thread-like leaves. This leaf morphology is often an adaptation to specific environmental conditions, such as aquatic habitats or arid environments where reducing surface area minimizes water loss.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant had trichophyllous roots.","correct":"✓ The plant had trichophyllous leaves.","note":"'Trichophyllous' specifically refers to leaves, not roots or other plant parts."},{"incorrect":"✗ The trichophyllous texture of the bark was interesting.","correct":"✓ The plant had trichophyllous leaves.","note":"'Trichophyllous' describes the leaf shape, not texture."}],"priority":"★☆☆"},"related_words":{"derivatives":["trichophylly (noun: the condition of having thread-like leaves)"],"related_terms":["phyllode (a flattened petiole that functions as a leaf)","xerophyte (a plant adapted to dry conditions)","hydrophyte (a plant adapted to aquatic environments)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Specialized vocabulary, rare in general use)","frequency_google_ngram":"Very low frequency - Primarily used in botanical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Trichophyllous' is a technical term used in botany to describe plants with thread-like or hair-like leaves. It's not a word commonly used outside of scientific or specialized contexts. The word is formed from Greek roots, combining 'hair' and 'leaf' to describe the specific leaf morphology. Understanding this term requires some familiarity with botanical terminology.","priority":"★★☆"},"example_sentences":[{"sentence":"The *Cabomba caroliniana* is a popular aquarium plant known for its delicate, trichophyllous leaves.","translation":"カロリナ・カボンバは、繊細な糸状の葉で知られる人気のある水槽用植物です。","type":"descriptive","meaning_category":"botany"},{"sentence":"The trichophyllous structure of the leaves helps to reduce water loss in arid environments.","translation":"葉の糸状構造は、乾燥した環境での水分損失を減らすのに役立ちます。","type":"functional","meaning_category":"adaptation"}]}