{"word":"pre-explain","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"（通常、後でより詳細な説明が続くことを意図して）事前に説明する、前もって説明する","english_definition":"To explain something in advance, usually with the intention of providing a more detailed explanation later.","examples":[{"sentence":"The teacher pre-explained the basic concepts before diving into the complex equations.","translation":"先生は複雑な方程式に入る前に、基本的な概念を事前に説明した。"},{"sentence":"The guide pre-explained the safety procedures before the tour began.","translation":"ガイドはツアーが始まる前に、安全手順を前もって説明した。"},{"sentence":"I'll pre-explain the project's goals so you have a better understanding when we discuss the details.","translation":"詳細を議論するときに理解が深まるように、プロジェクトの目標を事前に説明します。"}],"collocations":["pre-explain the concepts","pre-explain the procedures","pre-explain the goals","pre-explain the rules","pre-explain the situation"],"synonyms":["introduce","preview","outline","briefly explain","give a preliminary explanation of"],"antonyms":["summarize","recapitulate","review","explain fully","elaborate"]}],"etymology":{"value":"\"pre-\" (before) + \"explain\" (to make clear).  Indicates explaining something in advance of a more thorough explanation or event.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːɪkˈspleɪn/","syllables":"pre-ex-plain"},"inflection":{"verb_forms":{"present_simple":["pre-explain","pre-explains"],"past_simple":"pre-explained","past_participle":"pre-explained","present_participle":"pre-explaining"}},"usage_notes":{"explanation":"\"pre-explain\" is used to describe the act of providing a preliminary or introductory explanation. It suggests that a more detailed explanation will follow. The purpose is often to give the audience a basic understanding or context before delving into more complex information. It's not a very common word, but it's useful for describing this specific action.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I will explain him the rules before.","correct":"✓ I will pre-explain the rules to him.","note":"When using 'pre-explain', the object (what is being explained) should directly follow the verb. If you want to include the person being explained to, use 'to' before the person."},{"incorrect":"✗ I pre-explained, but I didn't explain.","correct":"✓ I pre-explained, but I didn't explain fully.","note":"'Pre-explain' implies a less detailed explanation. The contrast should be between a preliminary explanation and a full explanation."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["preamble","preface","introduction","prologue","preview"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR vocabulary lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Pre-explain\" means to explain something briefly or in advance, before giving a more complete explanation later. It's like giving a sneak peek or a summary before going into all the details. This word isn't used very often, so it's more common in writing or when someone wants to be very specific about how they are explaining something."},"example_sentences":[{"sentence":"The lecturer pre-explained the historical context to help students understand the novel better.","translation":"講師は、学生が小説をよりよく理解できるように、歴史的背景を事前に説明しました。","type":"verb","meaning_category":"事前に説明する"},{"sentence":"Before the experiment, the scientist pre-explained the potential risks to the participants.","translation":"実験の前に、科学者は参加者に起こりうるリスクを事前に説明しました。","type":"verb","meaning_category":"前もって説明する"},{"sentence":"The manager pre-explained the new software's features before the training session.","translation":"マネージャーは、トレーニングセッションの前に、新しいソフトウェアの機能を事前に説明しました。","type":"verb","meaning_category":"事前に説明する"}]}