{"word":"disinheritable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"相続を剥奪できる、廃嫡できる","english_definition":"Capable of being disinherited; able to be deprived of an inheritance.","examples":[{"sentence":"Under the old laws, certain family members were considered disinheritable for specific offenses.","translation":"古い法律の下では、特定の犯罪を犯した特定の家族構成員は、相続を剥奪できると見なされていました。"},{"sentence":"Whether a person is considered disinheritable depends on the jurisdiction and applicable laws.","translation":"人が相続を剥奪できると見なされるかどうかは、管轄区域と適用される法律によって異なります。"}],"collocations":["disinheritable offense","disinheritable conduct","disinheritable status"],"synonyms":["revocable inheritance","forfeitable inheritance"],"antonyms":["inheritable","non-disinheritable"]}],"etymology":{"value":"Formed from 'disinherit' (to deprive of an inheritance) + '-able' (capable of being).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɪsɪnˈherɪtəbəl/","syllables":"dis-in-her-it-a-ble"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Disinheritable' is a relatively rare word, primarily used in legal contexts. It describes the characteristic of a person or a right to inheritance that can be legally taken away. The conditions under which someone is disinheritable vary greatly depending on the jurisdiction and specific laws in place.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The property was disinheritable by the family.","correct":"✓ The heir was disinheritable due to their actions.","note":"'Disinheritable' describes the *person* or the *inheritance*, not the property itself. The correct usage focuses on the individual's status or the inheritance's vulnerability to being revoked."}],"priority":"★★☆"},"related_words":{"derivatives":["disinherit (verb)","disinheritance (noun)"],"priority":"★★★"},"level_frequency":{"level":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'disinheritable' is a complex legal term. It means that someone can legally have their inheritance taken away. This word is not commonly used in everyday language and is mostly found in legal documents or discussions about inheritance law. Understanding this word requires knowledge of legal concepts related to inheritance and property rights."},"example_sentences":[{"sentence":"The court determined that his actions made him disinheritable under the terms of the will.","translation":"裁判所は、彼の行動が遺言の条項に基づき、彼を相続剥奪可能にしたと判断しました。","type":"adjective","meaning_category":"Legal Status"},{"sentence":"Whether a child is disinheritable for criminal behavior is a complex legal question.","translation":"子供が犯罪行為によって相続を剥奪できるかどうかは、複雑な法的問題です。","type":"adjective","meaning_category":"Legal Question"}]}