{"word":"Arabicism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"アラビア語からの借用語、アラビア語の影響を受けた表現、アラビア語の語法","english_definition":"A word, idiom, or other linguistic feature derived from Arabic.","examples":[{"sentence":"The word 'algebra' is an Arabicism.","translation":"「algebra（代数学）」という単語はアラビア語からの借用語です。"},{"sentence":"Many Spanish words are Arabicisms due to the historical influence of Arabic culture in Spain.","translation":"スペイン語の多くの単語は、スペインにおけるアラビア文化の歴史的な影響により、アラビア語からの借用語です。"},{"sentence":"The use of certain rhetorical devices in the poem is considered an Arabicism by some scholars.","translation":"その詩における特定の修辞技法の使用は、一部の学者によってアラビア語の影響を受けたものと見なされています。"}],"collocations":["linguistic Arabicism","lexical Arabicism","cultural Arabicism"],"synonyms":["Arabic loanword","Arabic influence","Arabicism in language"],"antonyms":[]}],"etymology":{"value":"'Arab' + '-ic' + '-ism'.  From Arabic influence or origin.","priority":"★★★"},"pronunciation":{"ipa":"/ˈærəbɪsɪzəm/","syllables":"A-ra-bi-ci-sm"},"inflection":{"noun_plural":"Arabicisms"},"usage_notes":{"explanation":"An 'Arabicism' refers specifically to linguistic elements borrowed from or influenced by the Arabic language. It can apply to individual words, grammatical structures, or stylistic features found in other languages.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The architecture of the building is Arabicism.","correct":"✓ The architecture of the building shows Arabic influence.","note":"'Arabicism' refers to linguistic features, not architectural styles. Use 'Arabic influence' instead."},{"incorrect":"✗ He spoke Arabicism fluently.","correct":"✓ He spoke Arabic fluently.","note":"'Arabicism' is a noun referring to a linguistic feature, not the Arabic language itself. Use 'Arabic' to refer to the language."}],"priority":"★★☆"},"related_words":{"derivatives":["Arab","Arabic","Arabize"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'Arabicism' is a specialized term used in linguistics to describe words, idioms, or other language features that come from Arabic. It's not a common word in everyday conversation, but it's useful for discussing language history and the influence of Arabic on other languages. You'll typically find this word in academic or scholarly contexts when discussing language origins and influences."},"example_sentences":[{"sentence":"The presence of numerous Arabicisms in the Spanish language reflects centuries of cultural exchange.","translation":"スペイン語に多数のアラビア語からの借用語が存在することは、何世紀にもわたる文化交流を反映しています。","type":"general","meaning_category":"general"},{"sentence":"Scholars debate whether certain grammatical structures in the dialect are Arabicisms or independent developments.","translation":"学者たちは、その方言における特定の文法構造がアラビア語の影響を受けたものなのか、それとも独自に発展したものなのかについて議論しています。","type":"linguistics","meaning_category":"linguistics"},{"sentence":"Many mathematical terms used in English, such as 'algorithm', are Arabicisms.","translation":"英語で使用されている多くの数学用語、例えば「algorithm（アルゴリズム）」は、アラビア語からの借用語です。","type":"etymology","meaning_category":"etymology"}]}