{"word":"practical-legal","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"実務法学の、実務法律の、実務的な法律に関する","english_definition":"Relating to the application of legal principles in real-world situations; pertaining to the practical aspects of law.","examples":[{"sentence":"The course focuses on the practical-legal aspects of contract negotiation.","translation":"その講座は、契約交渉の実務法学的な側面に焦点を当てています。"},{"sentence":"She has a strong understanding of the theoretical and practical-legal implications of the new legislation.","translation":"彼女は、新しい法律の理論的および実務法学的な意味合いについて深い理解を持っています。"},{"sentence":"This book provides a practical-legal guide for small business owners.","translation":"この本は、中小企業の経営者向けの実務的な法律ガイドを提供しています。"}],"collocations":["practical-legal advice","practical-legal implications","practical-legal issues","practical-legal guide","practical-legal training","practical-legal framework"],"synonyms":["applied legal","operational legal","real-world legal","pragmatic legal"],"antonyms":["theoretical legal","abstract legal","academic legal"]}],"etymology":{"value":"A combination of 'practical' (concerned with real-world application) and 'legal' (relating to law).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpræktɪkəl ˈliːɡəl/","syllables":"prac-ti-cal-le-gal"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Practical-legal' is used to describe something that relates to both the practical application of law and legal principles. It emphasizes the real-world implications and applications of legal concepts, rather than just the theoretical aspects. It is often used in the context of education, training, or advice related to law.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a practical legal experience.","correct":"✓ He has practical-legal experience.","note":"'Practical-legal' is a compound adjective and should be hyphenated when used before a noun. Alternatively, you can say 'He has practical legal experience.'"},{"incorrect":"✗ The course is about practical and legal aspects.","correct":"✓ The course is about the practical-legal aspects.","note":"Using 'practical-legal' as a single adjective emphasizes the combined nature of practical and legal considerations. Alternatively, you can say 'The course is about practical and legal aspects.'"}],"priority":"★★☆"},"related_words":{"derivatives":["practicality","legality","legalistic","practitioner"],"phrases":["legal practice","practical application","legal framework"],"priority":"★★★"},"level_frequency":{"CEFR":"C1-C2","frequency_google_ngram":"Low frequency. Primarily used in legal and academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'practical-legal' is a specialized term used in legal and academic contexts. It refers to the application of legal principles in real-world situations. Understanding this term requires familiarity with both legal concepts and practical applications. It is typically used in discussions about legal education, training, and the practical implications of laws and regulations."},"example_sentences":[{"sentence":"The seminar will cover the practical-legal issues surrounding intellectual property rights.","translation":"そのセミナーでは、知的財産権を取り巻く実務法学的な問題について取り上げます。","type":"adjective","meaning_category":"実務法学"},{"sentence":"She is seeking practical-legal advice on how to start her own business.","translation":"彼女は、起業方法に関する実務法学的なアドバイスを求めています。","type":"adjective","meaning_category":"実務法学"},{"sentence":"The curriculum includes practical-legal training to prepare students for their careers.","translation":"そのカリキュラムには、学生のキャリアに備えるための実務法学的なトレーニングが含まれています。","type":"adjective","meaning_category":"実務法学"}]}