{"word":"extremophile","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"極限環境微生物（きょくげんかんきょうびせいぶつ）","english_definition":"An organism that thrives in extreme environments, such as very high or low temperatures, pH, salinity, or pressure.","examples":[{"sentence":"Extremophiles are of interest to astrobiologists because they suggest life could exist on other planets.","translation":"極限環境微生物は、他の惑星にも生命が存在する可能性を示唆するため、宇宙生物学者にとって関心のある対象です。"},{"sentence":"Some extremophiles can survive in boiling water.","translation":"極限環境微生物の中には、沸騰したお湯の中で生き残ることができるものもいます。"},{"sentence":"The study of extremophiles has expanded our understanding of the limits of life.","translation":"極限環境微生物の研究は、生命の限界に関する私たちの理解を広げました。"}],"collocations":["thermophile (好熱菌)","acidophile (好酸菌)","halophile (好塩菌)","alkaliphile (好アルカリ菌)","barophile (好圧菌)","extreme environment (極限環境)","microorganism (微生物)"],"synonyms":["extremeophile","archaea (古細菌)","microbe"],"antonyms":["mesophile (中温菌)"],"related_terms":["astrobiology (宇宙生物学)","adaptation (適応)","biodiversity (生物多様性)"]}],"etymology":{"value":"Formed from 'extreme' and '-phile', from Greek 'philein' (to love). Literally, 'extreme-loving'.","translation":"「extreme（極端な）」と、ギリシャ語の「philein（愛する）」に由来する「-phile」から形成されています。文字通りには「極端なものを愛する」という意味です。","priority":"★★☆"},"pronunciation":{"ipa":"/ɪkˈstriːməfaɪl/","syllables":"ex-treme-o-phile"},"inflection":{"noun_plural":"extremophiles"},"usage_notes":{"explanation":"'Extremophile' refers to organisms, typically microorganisms, that can survive and thrive in conditions that would be lethal to most other life forms. These conditions include extreme temperatures, pH levels, salinity, pressure, and radiation. The study of extremophiles is important for understanding the range of conditions under which life can exist and has implications for astrobiology and biotechnology.","translation":"「Extremophile（極限環境微生物）」とは、他のほとんどの生物にとって致死的であるような条件下で生存し、繁栄することができる生物、典型的には微生物を指します。これらの条件には、極端な温度、pHレベル、塩分濃度、圧力、および放射線が含まれます。極限環境微生物の研究は、生命が存在できる条件の範囲を理解するために重要であり、宇宙生物学やバイオテクノロジーに影響を与えます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Extremophiles are animals that live in extreme conditions.","correct":"✓ Extremophiles are microorganisms that live in extreme conditions.","note":"Extremophiles are typically microorganisms, such as bacteria and archaea, not animals."},{"incorrect":"✗ Extremophile is a type of extreme environment.","correct":"✓ An extremophile is an organism that lives in an extreme environment.","note":"Extremophile is the organism, not the environment."}],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"extremophile\" is a specialized term used in biology and related fields. It refers to organisms, usually microorganisms like bacteria or archaea, that can survive and thrive in environments that are considered extreme for most life forms. These environments can include very high or low temperatures, extreme pH levels (very acidic or alkaline), high salinity (very salty), high pressure, or high levels of radiation. Understanding this term requires knowledge of basic biology and ecology.","translation":"「extremophile（極限環境微生物）」という単語は、生物学および関連分野で使用される専門用語です。これは、ほとんどの生物にとって極端であると考えられる環境で生存し、繁栄できる生物、通常は細菌や古細菌などの微生物を指します。これらの環境には、非常に高いまたは低い温度、極端なpHレベル（非常に酸性またはアルカリ性）、高い塩分濃度（非常に塩辛い）、高い圧力、または高レベルの放射線が含まれます。この用語を理解するには、基礎生物学と生態学の知識が必要です。"},"example_sentences":[{"sentence":"The discovery of extremophiles in deep-sea vents revolutionized our understanding of life's origins.","translation":"深海熱水噴出孔における極限環境微生物の発見は、生命の起源に関する私たちの理解に革命をもたらしました。","type":"general","meaning_category":"general"},{"sentence":"Some extremophiles have enzymes that are stable at high temperatures, making them useful in industrial processes.","translation":"一部の極限環境微生物は、高温で安定な酵素を持っており、産業プロセスで役立ちます。","type":"application","meaning_category":"application"},{"sentence":"Scientists are studying extremophiles to understand how life might exist on Mars.","translation":"科学者たちは、火星で生命がどのように存在し得るかを理解するために、極限環境微生物を研究しています。","type":"research","meaning_category":"research"}]}