{"word":"podding","meanings":[{"part_of_speech":"verb","definition":"Present participle of 'pod'.","english_definition":"The act of forming or developing pods; also, the act of removing peas or beans from their pods.","examples":[{"sentence":"The peas are podding nicely this year.","translation":"今年はエンドウ豆が順調に莢をつけている。"},{"sentence":"We spent the afternoon podding peas for freezing.","translation":"私たちは午後を冷凍保存するためにエンドウ豆の莢むきをして過ごした。"}],"collocations":["podding peas","podding beans","good podding season"],"synonyms":["shelling","husking"],"related_words":["pod","pea","bean","shell","husk"]},{"part_of_speech":"noun","definition":"The process of forming or removing pods.","english_definition":"The action or process of forming or removing pods from plants.","examples":[{"sentence":"The podding of the broad beans is a task for a sunny afternoon.","translation":"ソラマメの莢むきは、晴れた午後の仕事だ。"}],"collocations":["pea podding","bean podding"],"synonyms":["shelling","husking"],"related_words":["pod","pea","bean","shell","husk"]}],"etymology":{"value":"Derived from the noun 'pod', referring to a seed vessel, with the addition of the '-ing' suffix to form a present participle or gerund.","notes":"The etymology is straightforward, reflecting the direct action related to pods.","priority":"3"},"pronunciation":{"ipa":"/ˈpɒdɪŋ/","syllables":"pod-ding"},"inflection":{"verb_forms":{"present_participle":"podding"},"noun_forms":{"gerund":"podding"}},"usage_notes":{"explanation":"'Podding' primarily refers to the agricultural or culinary activity of either the formation of pods on plants or the removal of seeds (like peas or beans) from their pods. It's often used in contexts related to gardening, farming, or food preparation.","priority":"2"},"level_frequency":{"frequency_google_ngram":"Low frequency.","notes":"The term is relatively specific and not commonly used outside of contexts related to agriculture or gardening.","priority":"3"},"readability_explanation":{"level":"B2","text":"'Podding' is a term used in gardening or cooking contexts to describe the action of plants forming pods or the removal of seeds from pods. It is not a common word in everyday conversation, so understanding its meaning requires some familiarity with gardening or culinary terms."},"example_sentences":[{"sentence":"The farmer observed the healthy podding of his soybean crop.","translation":"農家はダイズの作物が健全に莢をつけているのを観察した。","type":"verb","meaning_category":"forming pods"},{"sentence":"After harvesting, the family dedicated an evening to podding the garden peas.","translation":"収穫後、家族は庭のエンドウ豆の莢むきに夕べを費やした。","type":"verb","meaning_category":"removing from pods"},{"sentence":"The efficiency of the podding process is crucial for large-scale pea processing.","translation":"莢むきプロセスの効率は、大規模なエンドウ豆の加工にとって重要である。","type":"noun","meaning_category":"process"}]}