{"word":"preformism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"先成説（生物学）","english_definition":"(biology) The theory that organisms develop from miniature versions of themselves.","examples":[{"sentence":"Preformism was a popular theory in the 17th and 18th centuries.","translation":"先成説は17世紀から18世紀にかけて広く支持された理論だった。"},{"sentence":"The preformism theory suggested that all future generations were preformed inside the first organism.","translation":"先成説は、将来の世代すべてが最初の生物の中にすでに形成されていると提唱した。"}],"collocations":[],"synonyms":["encasement theory"],"antonyms":["epigenesis (後成説)"]}],"etymology":{"value":"'pre-' (before) + 'form' + '-ism'.  From the idea that the organism is pre-formed.","priority":"★★☆"},"pronunciation":{"ipa":"/priˈfɔːrmɪzəm/","syllables":"pre-form-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Preformism is a historical biological theory, largely discredited today, that posited that organisms develop from pre-existing, miniature versions of themselves. This contrasts with epigenesis, which states that organisms develop gradually from undifferentiated matter.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"★★★"},"related_words":{"derivatives":["preform (verb)","preformed (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Preformism' is a specialized term in the history of biology. It refers to the outdated idea that living things start as tiny, fully formed versions of themselves. Understanding this term requires knowledge of historical scientific theories. It is not commonly used outside of this specific context."},"example_sentences":[{"sentence":"The concept of preformism was eventually replaced by the theory of epigenesis.","translation":"先成説の概念は最終的に後成説に取って代わられた。","type":"noun","meaning_category":"生物学"},{"sentence":"Early microscopists sometimes supported preformism based on their observations.","translation":"初期の顕微鏡研究者は、観察に基づいて先成説を支持することがあった。","type":"noun","meaning_category":"生物学"}]}