{"word":"Crypto-christian","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"隠れキリシタン","english_definition":"A person who secretly adheres to Christianity while outwardly professing another faith, especially to avoid persecution.","examples":[{"sentence":"During the Edo period in Japan, many Crypto-christians maintained their faith in secret.","translation":"日本の江戸時代には、多くの隠れキリシタンが信仰を秘密裏に守り続けた。"}],"collocations":["secret Christian","hidden Christian"],"synonyms":["Nicodemite","secret believer"],"antonyms":["overt Christian","professing Christian"]}],"etymology":{"value":"Derived from 'crypto-' (from Greek kryptos, meaning 'hidden' or 'secret') combined with 'Christian'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌkrɪptoʊˈkrɪstiən/","syllables":"cryp-to-chris-tian"},"inflection":{"noun_plural":"Crypto-christians"},"usage_notes":{"explanation":"The term 'Crypto-christian' is often used to describe individuals who practice Christianity secretly due to fear of persecution or social stigma. It is particularly associated with historical contexts where Christianity was outlawed or suppressed.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a crypto-Christian because he likes crypto currency.","correct":"✓ He is a Crypto-christian because he practices Christianity in secret.","note":"The prefix 'crypto-' means 'hidden' or 'secret'. Do not confuse it with 'cryptocurrency'."}],"priority":"★★☆"},"related_words":{"derivatives":["Crypto-christianity (noun: the practice of secretly adhering to Christianity)"],"related_terms":["Marranos (Spanish Jews who outwardly converted to Christianity but secretly practiced Judaism)","Kakure Kirishitan (Japanese Crypto-christians)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Crypto-christian' refers to someone who secretly practices Christianity while pretending to follow another religion. This term is often used in historical contexts, such as during times of religious persecution. The word is formed from 'crypto-', meaning 'hidden', and 'Christian'. Understanding the historical and social context is important when using this term."},"example_sentences":[{"sentence":"The Crypto-christians in Japan developed unique syncretic practices that blended Christian and Buddhist elements.","translation":"日本の隠れキリシタンは、キリスト教と仏教の要素を融合させた独特の習合的な慣習を発展させた。","type":"example","meaning_category":"historical context"},{"sentence":"Many Crypto-christians faced severe persecution for their hidden faith.","translation":"多くの隠れキリシタンは、隠された信仰のために厳しい迫害に直面した。","type":"example","meaning_category":"persecution"}]}