{"word":"G-string","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"Tバック (下着)","english_definition":"A type of thong underwear or swimsuit that consists of a narrow strip of material that passes between the buttocks, attached to a waistband.","examples":[{"sentence":"She wore a G-string under her dress.","translation":"彼女はドレスの下にTバックを履いていた。"},{"sentence":"G-strings are often worn to avoid visible panty lines.","translation":"Tバックは、下着の線が見えるのを避けるためによく着用される。"}],"collocations":["wear a G-string","G-string bikini","male G-string"],"synonyms":["thong","tanga","string bikini"],"antonyms":["briefs","panties","bikini briefs"]}],"etymology":{"value":"The origin of the term 'G-string' is somewhat debated, but it is believed to have originated in the early 20th century. The 'G' may refer to the 'groin' area, or it may simply be an arbitrary designation. The term gained popularity in the context of burlesque and exotic dancing.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒiːˌstrɪŋ/","syllables":"gee-string"},"inflection":{"noun_plural":"G-strings"},"usage_notes":{"explanation":"The term 'G-string' is primarily used to refer to a type of underwear or swimwear that provides minimal coverage. It is often associated with revealing clothing and is commonly worn in situations where avoiding visible panty lines is desired. The term can sometimes be considered suggestive or provocative, depending on the context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wore a G-string to the beach.","correct":"✓ He wore swim trunks to the beach.","note":"While male G-strings exist, they are less common. 'Swim trunks' is a more typical choice for men's swimwear."},{"incorrect":"✗ G-string is a formal attire.","correct":"✓ G-string is not a formal attire.","note":"G-strings are generally considered informal and are not appropriate for formal occasions."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["thong","bikini","underwear","swimwear"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'G-string' refers to a type of underwear or swimwear that is very minimal in coverage, consisting of a narrow strip of fabric that goes between the buttocks. It's often worn to avoid visible panty lines under clothing. The term is generally understood, but it's considered somewhat informal and may be seen as suggestive in certain contexts. It's important to use the term appropriately, considering the audience and situation."},"example_sentences":[{"sentence":"She chose a seamless dress and a G-string to avoid any visible lines.","translation":"彼女は縫い目のないドレスとTバックを選び、下着の線が見えないようにした。","type":"noun","meaning_category":"下着"},{"sentence":"The dancer's costume included a sequined G-string.","translation":"ダンサーの衣装には、スパンコールで飾られたTバックが含まれていた。","type":"noun","meaning_category":"衣装"}]}