{"word":"inductor","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"インダクタ、誘導子","english_definition":"A passive electrical component that stores energy in a magnetic field when electric current flows through it.","examples":[{"sentence":"The circuit contains a resistor, a capacitor, and an inductor.","translation":"その回路は抵抗、コンデンサ、そしてインダクタを含んでいます。"},{"sentence":"The inductor opposes changes in current.","translation":"インダクタは電流の変化に抵抗します。"},{"sentence":"The value of the inductor is measured in henries.","translation":"インダクタの値はヘンリーで測定されます。"}],"collocations":["air-core inductor (空芯インダクタ)","ferrite-core inductor (フェライトコアインダクタ)","variable inductor (可変インダクタ)","inductor coil (インダクタコイル)","ideal inductor (理想インダクタ)"],"synonyms":["coil","choke","reactor"],"antonyms":["capacitor","resistor"]}],"etymology":{"value":"From 'inductance' + '-or'. Inductance refers to the property of an electrical conductor by which a change in current creates a voltage in both the conductor itself and in any nearby conductors.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈdʌktər/","syllables":"in-duc-tor"},"inflection":{"noun_plural":"inductors"},"usage_notes":{"explanation":"An inductor is a fundamental electronic component used to store energy in a magnetic field. It is often a coil of wire. Inductors are used in a wide range of applications, including power supplies, filters, and oscillators. The key characteristic of an inductor is its inductance, measured in henries (H). An ideal inductor has no resistance, but real-world inductors have some resistance due to the wire used to make the coil.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The inductor resist the current.","correct":"✓ The inductor resists the current.","note":"The subject 'inductor' is singular, so the verb must be 'resists'."},{"incorrect":"✗ Inductors are used to store electricity.","correct":"✓ Inductors are used to store energy in a magnetic field.","note":"Inductors store energy in a magnetic field, not electricity directly. Capacitors store electrical energy in an electric field."}],"priority":"★★☆"},"related_words":{"derivatives":["inductance (名詞: インダクタンス、誘導係数)","inductive (形容詞: 誘導性の)","inductively (副詞: 誘導的に)"],"related_terms":["capacitor (コンデンサ)","resistor (抵抗器)","transformer (変圧器)","circuit (回路)","henry (ヘンリー)","impedance (インピーダンス)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'inductor' refers to an electronic component that stores energy in a magnetic field when current flows through it. It's a more specialized term primarily used in the context of electrical engineering and electronics. Understanding the concept of inductance and its role in circuits is essential for comprehending the function of an inductor. While not a common word in everyday conversation, it is crucial for anyone studying or working with electronics.","priority":"★★☆"},"example_sentences":[{"sentence":"The power supply uses a large inductor to smooth the output voltage.","translation":"その電源は、出力電圧を平滑化するために大きなインダクタを使用しています。","type":"general","meaning_category":"application"},{"sentence":"The inductor's value is critical for the filter's performance.","translation":"インダクタの値は、フィルタの性能にとって非常に重要です。","type":"technical","meaning_category":"characteristic"},{"sentence":"The engineer replaced the faulty inductor on the circuit board.","translation":"エンジニアは回路基板上の故障したインダクタを交換しました。","type":"practical","meaning_category":"repair"}]}