{"word":"toil-bent","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Bent or stooped from hard work or toil.","english_definition":"Physically bent or stooped as a result of prolonged and strenuous labor.","examples":[{"sentence":"The toil-bent farmer slowly walked across his field, his body bearing the marks of decades of labor.","translation":"労苦に身をかがめた農夫は、何十年もの労働の跡を体に刻みながら、ゆっくりと畑を横切って歩いた。"},{"sentence":"His toil-bent figure was a testament to the relentless demands of his profession.","translation":"彼の労苦に身をかがめた姿は、彼の職業の容赦ない要求の証だった。"}],"collocations":["toil-bent figure","toil-bent back","toil-bent shoulders"],"synonyms":["stooped","hunched","bent over","labor-worn"],"antonyms":["upright","straight","erect"]}],"etymology":{"value":"The word combines 'toil,' referring to strenuous effort and labor, with 'bent,' indicating a curved or stooped posture. The phrase suggests a physical condition resulting from prolonged hard work.","priority":"N/A"},"pronunciation":{"ipa":"/ˈtɔɪlˌbɛnt/","syllables":"toil-bent"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Toil-bent' is a descriptive adjective, often used in literature or descriptive writing to evoke the image of someone whose body has been shaped by years of hard physical labor. It emphasizes the physical toll that work can take on a person.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He was toil-benting in the field.","correct":"✓ He was toil-bent in the field.","note":"'Toil-bent' is an adjective, not a verb, so it cannot be used in continuous tenses."}],"priority":"N/A"},"related_words":{"derivatives":["toil (noun/verb)","bent (adjective/past participle)"],"phrasal_verbs":[],"related_adjectives":["weary","exhausted","laborious"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - a somewhat archaic or literary term.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Toil-bent' is a relatively uncommon and literary adjective. It is used to describe someone who is physically stooped or bent over due to hard work. Understanding this word requires a good vocabulary and an understanding of figurative language."},"example_sentences":[{"sentence":"The old woman's toil-bent frame told a story of years spent working the land.","translation":"老婆の労苦に身をかがめた体は、土地を耕して過ごした年月を物語っていた。","type":"adjective","meaning_category":"descriptive"},{"sentence":"He recognized the toil-bent posture of his father from a distance.","translation":"彼は遠くから父親の労苦に身をかがめた姿勢を認識した。","type":"adjective","meaning_category":"descriptive"}]}