{"word":"conflictedly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"葛藤して、相反する感情を抱きながら、矛盾した気持ちで","english_definition":"in a way that shows conflicting emotions; with mixed feelings; in a state of internal conflict.","examples":[{"sentence":"He stared at the contract conflictedly, unsure whether to sign it.","translation":"彼は契約書を葛藤しながら見つめ、署名すべきかどうか迷っていた。"},{"sentence":"She smiled conflictedly, happy for her friend's success but also a little envious.","translation":"彼女は友人の成功を喜びつつも、少し羨ましくもあり、複雑な笑顔を浮かべた。"},{"sentence":"The politician spoke conflictedly about the controversial issue, trying to appease both sides.","translation":"その政治家は物議を醸す問題について、双方をなだめようとしながら、矛盾した気持ちで語った。"}],"collocations":["stare conflictedly","smile conflictedly","speak conflictedly","feel conflictedly","act conflictedly","respond conflictedly"],"synonyms":["ambivalently","hesitantly","uncertainly","doubtingly","equivocally","torn","in two minds"],"antonyms":["decisively","resolutely","confidently","certainly","unambiguously","unequivocally"]}],"etymology":{"value":"The word 'conflictedly' is derived from the adjective 'conflicted', which comes from the verb 'conflict'. 'Conflict' originates from the Latin word 'confligere', meaning 'to strike together' or 'to be in opposition'. The suffix '-ly' is added to 'conflicted' to form the adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/kənˈflɪktɪdli/","syllables":"con-flict-ed-ly"},"inflection":{"notes":"Adverbs do not typically inflect. 'Conflictedly' remains the same regardless of tense or number."},"usage_notes":{"explanation":"'Conflictedly' describes an action or state performed with mixed or opposing feelings. It suggests an internal struggle or uncertainty. It is often used when someone is torn between two or more options, desires, or beliefs. The adverb emphasizes the internal conflict present during the action. It is less common than the adjective 'conflicted', but it provides a more precise description of how an action is performed.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He felt conflictedly about the decision.","correct":"✓ He felt conflicted about the decision.","note":"'Conflictedly' describes how someone acts, speaks, or performs an action. To describe how someone feels, use the adjective 'conflicted'."},{"incorrect":"✗ She answered conflictedly, but her actions were clear.","correct":"✓ She answered hesitantly, but her actions were clear.","note":"If the person's words show internal conflict but their actions are clear, it might be more appropriate to use a synonym like 'hesitantly' or 'uncertainly' to describe their answer."},{"incorrect":"✗ The situation was conflictedly.","correct":"✓ The situation was conflicting.","note":"'Conflictedly' is an adverb and should not be used to describe a situation. Use the adjective 'conflicting' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["conflict (noun, verb)","conflicted (adjective)","conflicting (adjective)","confliction (noun - rare)"],"idioms_phrases":["torn between two (or more) things","in two minds","on the horns of a dilemma"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency. The adjective 'conflicted' is more common.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Conflictedly' is an adverb that describes doing something while experiencing mixed or opposing emotions. It's used when someone is struggling internally with a decision or action. Since it's less common than the adjective 'conflicted', it's more often encountered in formal writing or when a precise description of the internal state is needed. Understanding the root word 'conflict' and the suffix '-ly' helps to grasp its meaning. It implies a state of internal disagreement or uncertainty during an action."},"example_sentences":[{"sentence":"He approached the negotiation table conflictedly, aware of the compromises he would have to make.","translation":"彼は交渉のテーブルに葛藤しながら向かった。彼は妥協をしなければならないことを知っていた。","type":"adverb","meaning_category":"葛藤して"},{"sentence":"She accepted the award conflictedly, knowing that others were more deserving.","translation":"彼女は、他の人の方がもっとふさわしいと知りながら、葛藤して賞を受け取った。","type":"adverb","meaning_category":"相反する感情を抱きながら"},{"sentence":"The witness testified conflictedly, struggling to reconcile the truth with his loyalty to his friend.","translation":"証人は、真実と友人への忠誠心との折り合いをつけようと苦労しながら、矛盾した気持ちで証言した。","type":"adverb","meaning_category":"矛盾した気持ちで"}]}