{"word":"acolhimento","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"歓迎、受け入れ、もてなし","english_definition":"The act or manner of receiving someone warmly and hospitably; welcome, reception, hospitality.","examples":[{"sentence":"O acolhimento que recebemos foi maravilhoso.","translation":"私たちが受けたもてなしは素晴らしいものでした。"}],"collocations":["Acolhimento familiar (里親制度)","Acolhimento institucional (施設での保護)","Acolhimento humanitário (人道的受け入れ)","Acolhimento de imigrantes (移民の受け入れ)","Acolhimento de turistas (観光客の受け入れ)"],"synonyms":["recepção","hospitalidade","recebimento","agasalho","amparo"],"antonyms":["rejeição","exclusão","abandono"]},{"part_of_speech":"noun","definition":"（心理学・社会学）共感的な理解、受容、寄り添い","english_definition":"(Psychology, Sociology) Empathic understanding, acceptance, and support; a welcoming and supportive attitude.","examples":[{"sentence":"O acolhimento é fundamental para o sucesso do tratamento.","translation":"共感的な理解は治療の成功に不可欠です。"}],"collocations":["Acolhimento psicológico (心理的サポート)","Acolhimento social (社会的サポート)","Acolhimento terapêutico (治療的サポート)","Acolhimento emocional (感情的サポート)"],"synonyms":["compreensão","empatia","aceitação","apoio","suporte"],"antonyms":["indiferença","negação","rejeição"]}],"etymology":{"value":"Derived from the Portuguese verb 'acolher', meaning 'to welcome', 'to receive', or 'to shelter'. The suffix '-mento' transforms the verb into a noun, indicating the act or result of welcoming.","priority":"★★☆"},"pronunciation":{"ipa":"/ɐ.ku.ʎiˈmẽ.tu/","syllables":"a-co-lhi-men-to"},"inflection":{"noun_plural":"acolhimentos"},"usage_notes":{"explanation":"'Acolhimento' encompasses not only the physical act of welcoming but also the emotional and psychological aspects of acceptance and support. It is often used in contexts related to social services, healthcare, and education, emphasizing the importance of creating a welcoming and supportive environment for individuals in need. The term implies a sense of empathy, understanding, and care.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"O acolhimento foi muito bom, mas a comida não.","correct":"A recepção foi muito boa, mas a comida não.","note":"While 'acolhimento' can refer to the general reception, 'recepção' is more commonly used for the act of receiving someone at a specific place or event."},{"incorrect":"Ele precisa de um acolhimento urgente. (referring to a physical object)","correct":"Ele precisa de ajuda urgente.","note":"'Acolhimento' is generally used for people, not objects. For objects, use 'ajuda' (help) or another appropriate term."}],"priority":"★★☆"},"related_words":{"derivatives":["acolher (verb: to welcome, to receive, to shelter)","acolhedor (adjective: welcoming, hospitable, cozy)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Moderately frequent.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Acolhimento' is a nuanced term that goes beyond a simple welcome. It implies a deep sense of care, empathy, and support. It's often used in professional contexts like social work, psychology, and education to describe creating a safe and welcoming environment for people who need assistance. The word suggests a proactive and compassionate approach to receiving and supporting others.","priority":"★★☆"},"example_sentences":[{"sentence":"O programa oferece acolhimento e apoio às famílias em situação de vulnerabilidade.","translation":"The program offers welcome and support to families in vulnerable situations.","type":"noun","meaning_category":"歓迎、受け入れ、もてなし"},{"sentence":"O hospital tem um setor de acolhimento para pacientes com doenças mentais.","translation":"The hospital has a reception sector for patients with mental illnesses.","type":"noun","meaning_category":"歓迎、受け入れ、もてなし"},{"sentence":"O acolhimento dos professores foi fundamental para a adaptação dos alunos estrangeiros.","translation":"The teachers' support was essential for the adaptation of the foreign students.","type":"noun","meaning_category":"（心理学・社会学）共感的な理解、受容、寄り添い"},{"sentence":"A política de acolhimento da empresa visa promover um ambiente de trabalho inclusivo.","translation":"The company's welcoming policy aims to promote an inclusive work environment.","type":"noun","meaning_category":"歓迎、受け入れ、もてなし"}]}