{"word":"intercohort","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"世代間の、コホート間の","english_definition":"Relating to or involving different cohorts (groups of people born around the same time).","examples":[{"sentence":"Intercohort differences in attitudes towards technology are significant.","translation":"テクノロジーに対する態度の世代間格差は大きい。"},{"sentence":"The study examined intercohort mobility in income levels.","translation":"その研究では、所得水準における世代間の流動性を調査した。"}],"collocations":["intercohort analysis","intercohort study","intercohort comparison","intercohort differences","intercohort effects","intercohort mobility"],"synonyms":["intergenerational"],"antonyms":["intracohort","cohort-specific"]},{"part_of_speech":"noun","definition":"世代間、コホート間","english_definition":"The space or relationship between different cohorts.","examples":[{"sentence":"Understanding the intercohort is crucial for predicting future social trends.","translation":"将来の社会動向を予測するには、世代間を理解することが重要です。"}],"collocations":[],"synonyms":["intergeneration"],"antonyms":["intracohort"]}],"etymology":{"value":"Derived from the prefix 'inter-' (between) and 'cohort' (a group of people born around the same time).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪntərˈkoʊhɔːrt/","syllables":"in-ter-co-hort"},"inflection":{"notes":"Adjective: intercohort; Noun: intercohort (usually used in abstract sense)"},"usage_notes":{"explanation":"The term 'intercohort' is used to describe phenomena, differences, or relationships that exist *between* different cohorts. It is commonly used in sociology, demography, and related fields to analyze how experiences and characteristics vary across different generations or birth cohorts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The study focused on intercohort, rather than individual experiences.","correct":"✓ The study focused on intercohort differences, rather than individual experiences.","note":"'Intercohort' is often used as an adjective to modify a noun (e.g., differences, effects)."},{"incorrect":"✗ The intercohort was very similar.","correct":"✓ The cohorts were very similar.","note":"When referring to the cohorts themselves, use 'cohorts' rather than 'intercohort'."}],"priority":"★★☆"},"related_words":{"derivatives":["cohort","cohort analysis","intracohort","intergenerational"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in academic and research contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Intercohort' is a specialized term primarily used in academic and research settings, particularly in sociology, demography, and related fields. It refers to the relationships, differences, or comparisons between different cohorts (groups of people born around the same time). Understanding this term requires familiarity with cohort analysis and demographic studies."},"example_sentences":[{"sentence":"Intercohort variations in educational attainment have implications for social mobility.","translation":"教育達成度における世代間格差は、社会的流動性に影響を与える。","type":"adjective","meaning_category":"Relating to different cohorts"},{"sentence":"The intercohort is a key factor in understanding societal change.","translation":"世代間は、社会の変化を理解する上で重要な要素である。","type":"noun","meaning_category":"The space between cohorts"}]}