{"word":"Greekify","priority":"★★★","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"ギリシャ風にする、ギリシャ化する","english_definition":"To make something Greek in character or style; to Hellenize.","examples":[{"sentence":"The artist decided to Greekify the Roman statue by adding more flowing robes.","translation":"その芸術家は、より流れるようなローブを追加することで、ローマの彫像をギリシャ風にすることに決めた。"},{"sentence":"The restaurant chain began to Greekify its menu by adding dishes like souvlaki and tzatziki.","translation":"そのレストランチェーンは、スブラキやザジキのような料理を追加することで、メニューをギリシャ化し始めた。"},{"sentence":"The architect wanted to Greekify the building's facade with columns and pediments.","translation":"その建築家は、柱とペディメントで建物のファサードをギリシャ風にしたかった。"}],"collocations":["Greekify a statue","Greekify a menu","Greekify a building","Greekify a name","Greekify a story"],"synonyms":["Hellenize","Atticize","Grecize"],"antonyms":[]}],"etymology":{"value":"Formed from \"Greek\" + \"-ify\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡriːkaɪfaɪ/","syllables":"Gree-ki-fy"},"inflection":{"verb_forms":{"present_simple":["Greekify","Greekifies"],"past_simple":"Greekified","past_participle":"Greekified","present_participle":"Greekifying"}},"usage_notes":{"explanation":"\"Greekify\" means to transform something to resemble Greek culture, style, or characteristics. It is often used in the context of art, architecture, cuisine, or language. The term implies an intentional effort to imbue something with Greek qualities.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am going to Greekify myself by learning Greek.","correct":"✓ I am going to Hellenize myself by learning Greek.","note":"While 'Greekify' can be used for cultural influence, 'Hellenize' is more common when referring to a person adopting Greek culture."}],"priority":"★★☆"},"related_words":{"derivatives":["Greekification (noun)"],"phrasal_verbs":[],"related_adjectives":["Greek","Hellenic"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Greekify\" is a relatively uncommon word that means to make something resemble Greek culture or style. It is often used in academic or artistic contexts. Understanding its meaning requires familiarity with the concept of cultural influence and transformation. The word is more frequently encountered in writing than in everyday conversation."},"example_sentences":[{"sentence":"The director wanted to Greekify the play by setting it in ancient Athens.","translation":"監督は、古代アテネを舞台にすることで、その劇をギリシャ風にしたかった。","type":"verb","meaning_category":"Transforming to Greek style"},{"sentence":"The chef decided to Greekify the salad by adding feta cheese and olives.","translation":"シェフは、フェタチーズとオリーブを追加することで、サラダをギリシャ風にすることに決めた。","type":"verb","meaning_category":"Transforming to Greek style"}]}