{"word":"lottizzazione","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(イタリア語)区画整理、宅地造成","english_definition":"(Italian) Land subdivision, housing development, zoning.","examples":[{"sentence":"La lottizzazione ha trasformato la zona agricola in un quartiere residenziale.","translation":"The land subdivision transformed the agricultural area into a residential neighborhood.","note":"This sentence illustrates the general transformation of an area."},{"sentence":"Il comune ha approvato il piano di lottizzazione per la costruzione di nuove case.","translation":"The municipality approved the land subdivision plan for the construction of new houses.","note":"This sentence shows the approval process by local authorities."},{"sentence":"La lottizzazione abusiva ha deturpato il paesaggio.","translation":"The illegal land subdivision has disfigured the landscape.","note":"This sentence highlights the negative consequences of illegal subdivision."}],"collocations":["piano di lottizzazione (land subdivision plan)","lottizzazione abusiva (illegal land subdivision)","area di lottizzazione (land subdivision area)"],"synonyms":["urbanizzazione (urbanization)","comparto edificatorio (building sector)","piano regolatore (zoning plan)"],"antonyms":["area agricola (agricultural area)","terreno inedificato (undeveloped land)"]}],"etymology":{"value":"Derived from the Italian word 'lotto' (lot), referring to a piece of land. The suffix '-izzazione' indicates a process or action of dividing land into lots.","priority":"★★☆"},"pronunciation":{"ipa":"/lot.tid.dzi.atˈtsjo.ne/","syllables":"lot-tiz-za-tsi-o-ne"},"inflection":{"noun_plural":"lottizzazioni"},"usage_notes":{"explanation":"'Lottizzazione' refers specifically to the process of dividing land into building lots, often for residential development. It implies a planned and authorized transformation of land use. The term is commonly used in legal and administrative contexts related to urban planning and construction.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"*lottizatione","correct":"lottizzazione","note":"Correct spelling is crucial as it is an Italian term."},{"incorrect":"Using 'lottizzazione' to refer to a single building lot.","correct":"Use 'lotto' to refer to a single building lot.","note":"'Lottizzazione' refers to the entire process or area of land subdivision, not a single lot."}],"priority":"★★☆"},"related_words":{"derivatives":["lotto (lot)","lottizzare (to subdivide land)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, specific to Italian contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'lottizzazione' is a specialized term related to urban planning and land development in Italy. It refers to the process of dividing a larger piece of land into smaller lots for building purposes, often involving legal and administrative procedures. Understanding this term requires familiarity with Italian legal and urban planning concepts."},"example_sentences":[{"sentence":"La nuova lottizzazione prevede la costruzione di un parco pubblico.","translation":"The new land subdivision includes the construction of a public park.","type":"general","meaning_category":"land subdivision"},{"sentence":"Il permesso di costruire è stato rilasciato dopo l'approvazione della lottizzazione.","translation":"The building permit was issued after the approval of the land subdivision.","type":"legal","meaning_category":"land subdivision"},{"sentence":"La lottizzazione ha aumentato il valore dei terreni circostanti.","translation":"The land subdivision has increased the value of the surrounding land.","type":"economic","meaning_category":"land subdivision"}]}