{"word":"Umpirism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"審判主義、経験主義","english_definition":"A philosophy that bases knowledge and values on experience and observation, often emphasizing practical results over abstract theories.","examples":[{"sentence":"His umpirism led him to trust the data above all else.","translation":"彼の経験主義は、何よりもデータを信頼させた。"},{"sentence":"The company's umpirism was evident in its focus on testing and iteration.","translation":"その会社の経験主義は、テストと反復に焦点を当てることで明らかになった。"}],"collocations":["practical umpirism","philosophical umpirism","data-driven umpirism"],"synonyms":["empiricism","pragmatism","experimentalism"],"antonyms":["rationalism","idealism","theoreticalism"]}],"etymology":{"value":"Derived from 'umpire,' suggesting a reliance on observable facts and judgment, similar to how an umpire makes calls based on what they see.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʌmpaɪˌrɪzəm/","syllables":"um-pir-ism"},"inflection":{"noun_plural":"Umpirisms"},"usage_notes":{"explanation":"'Umpirism' is a relatively rare term, often used in philosophical or academic contexts to describe an approach that prioritizes empirical evidence and practical application. It is closely related to empiricism and pragmatism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practices umpirism in his daily life by ignoring all rules.","correct":"✓ He practices umpirism in his daily life by relying on his own observations and experiences.","note":"Umpirism is about relying on experience, not ignoring rules."}],"priority":"★☆☆"},"related_words":{"derivatives":["umpire (noun, verb)","empirical (adjective)","empirically (adverb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Umpirism' is a specialized term used in philosophical and academic discussions. It signifies a reliance on empirical evidence and practical experience as the basis for knowledge and values. Understanding this term requires familiarity with philosophical concepts such as empiricism and pragmatism."},"example_sentences":[{"sentence":"The scientist's umpirism was reflected in his meticulous data collection.","translation":"科学者の経験主義は、彼の綿密なデータ収集に反映されていた。","type":"general","meaning_category":"philosophical approach"},{"sentence":"The project's success was attributed to its umpirism, which allowed for constant adjustments based on real-world feedback.","translation":"プロジェクトの成功は、実際のフィードバックに基づいて絶えず調整できる経験主義によるものとされた。","type":"general","meaning_category":"practical application"}]}