{"word":"Chancellorsville","priority":"★★☆","meanings":[{"part_of_speech":"proper noun","definition":"チャンセラーズヴィル（アメリカ南北戦争における重要な戦場）","english_definition":"Site of a major Civil War battle (April 30-May 6, 1863) in Virginia, where Confederate General Robert E. Lee achieved a significant victory against Union forces despite being outnumbered.","examples":[{"sentence":"The Battle of Chancellorsville is considered Lee's greatest tactical victory.","translation":"チャンセラーズヴィルの戦いはリー将軍の最高の戦術的勝利と考えられている。"},{"sentence":"Stonewall Jackson was mortally wounded at Chancellorsville.","translation":"ストーンウォール・ジャクソンはチャンセラーズヴィルで致命傷を負った。"}],"historical_context":{"date":"1863年4月30日-5月6日","location":"バージニア州スポットシルバニア郡","significance":"南軍のリー将軍が北軍のフッカー将軍を破ったが、ジャクソン将軍を失うという犠牲を伴った勝利。"}},{"part_of_speech":"proper noun","definition":"バージニア州の未編入地域の名称","english_definition":"Unincorporated community in Spotsylvania County, Virginia, near the historic battlefield.","examples":[{"sentence":"The Chancellorsville area preserves several Civil War sites.","translation":"チャンセラーズヴィル地域には南北戦争の史跡が数多く保存されている。"}]}],"etymology":{"value":"地名は19世紀初頭にこの地にあったChancellor家の旅館（Chancellor Inn）に由来。1863年の戦いで歴史的に著名になった。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈtʃænsələrzvɪl/","syllables":"Chan-cel-lors-ville"},"usage_notes":{"explanation":"「Chancellorsville」は主に南北戦争の歴史的文脈で使用される固有名詞です。現代の地名として使われることもありますが、歴史的な戦場として言及されることが圧倒的に多いです。軍事史やアメリカ史の文脈以外ではほとんど登場しません。","priority":"★★☆"},"related_words":{"historical_figures":["Robert E. Lee (南軍総司令官)","Stonewall Jackson (南軍将軍)","Joseph Hooker (北軍将軍)"],"related_battles":["Battle of Fredericksburg (前年の戦い)","Battle of Gettysburg (次の主要会戦)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門的な歴史用語)","frequency_google_ngram":"低頻度 (Low frequency) - 主に歴史関連文献で使用","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「Chancellorsville」は、アメリカ南北戦争の重要な戦場の名前です。1863年に行われたこの戦いでは、南軍のロバート・E・リー将軍が数的優位な北軍に対して見事な勝利を収めましたが、ストーンウォール・ジャクソン将軍を失うという代償を払いました。この地名は現代ではバージニア州の地域名としても存在しますが、主に歴史的な文脈で使われます。アメリカ史や軍事史に興味がない限り、日常会話で使うことはほとんどありません。"},"example_sentences":[{"sentence":"The Chancellorsville Campaign demonstrated Lee's brilliant generalship.","translation":"チャンセラーズヴィル作戦はリーの卓越した将軍としての力量を示した。","type":"proper noun","meaning_category":"歴史的戦闘"},{"sentence":"Today, the Chancellorsville Battlefield is part of the Fredericksburg and Spotsylvania National Military Park.","translation":"現在、チャンセラーズヴィル戦場跡はフレデリックスバーグ・アンド・スポットシルバニア国立軍事公園の一部となっている。","type":"proper noun","meaning_category":"現代の地名"},{"sentence":"Jackson's flank attack at Chancellorsville is still studied in military academies.","translation":"ジャクソンによるチャンセラーズヴィルでの側面攻撃は、今も軍事アカデミーで研究されている。","type":"proper noun","meaning_category":"軍事戦術"}]}