{"word":"neurodiversity-negative","meanings":[{"part_of_speech":"adjective","definition":"Expressing or characterized by opposition to, skepticism about, or a lack of understanding of neurodiversity.","english_definition":"Expressing or characterized by opposition to, skepticism about, or a lack of understanding of neurodiversity.","examples":[{"sentence":"The article presented a neurodiversity-negative viewpoint, focusing on the challenges rather than the strengths of autistic individuals.","translation":"その記事は神経多様性に対して否定的な視点を示し、自閉症者の強みよりも課題に焦点を当てていた。"},{"sentence":"Some argue that diagnostic labels are inherently neurodiversity-negative, as they pathologize natural variations in the human brain.","translation":"診断ラベルは人間の脳の自然な多様性を病理化するため、本質的に神経多様性に対して否定的であると主張する人もいる。"}],"collocations":["neurodiversity-negative attitude","neurodiversity-negative perspective","neurodiversity-negative language","neurodiversity-negative bias"],"synonyms":["anti-neurodiversity","neurodiversity-skeptical","ableist"],"antonyms":["neurodiversity-affirming","neurodiversity-positive","neurodiversity-friendly"]}],"etymology":{"value":"Formed by combining \"neurodiversity\" with \"negative,\" indicating an opposing or critical stance towards the concept of neurodiversity.","priority":"3"},"pronunciation":{"ipa":"/ˌnjʊəroʊdaɪˈvɜːrsɪti ˈnɛɡətɪv/","syllables":"neu-ro-di-ver-si-ty neg-a-tive"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"The term \"neurodiversity-negative\" is used to describe viewpoints, attitudes, or actions that are contrary to the principles of neurodiversity, which emphasizes the acceptance and celebration of neurological differences. It often implies a focus on deficits or impairments rather than strengths and variations.","priority":"2"},"common_mistakes":{"examples":[{"sentence":"It's important to distinguish between constructive criticism and neurodiversity-negative statements.","translation":"建設的な批判と神経多様性に対して否定的な発言を区別することが重要です。"}],"priority":"3"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["neurodiversity","neurotypical","neurodivergent","ableism","inclusion"]},"level_frequency":{"frequency_google_ngram":"Low frequency, specific to discussions about neurodiversity.","priority":"3"},"readability_explanation":{"level":"C1","text":"The term \"neurodiversity-negative\" is a complex term used in discussions about neurodiversity. It describes perspectives or actions that are against the idea of accepting and valuing different ways of thinking and processing information. It's often used to point out attitudes that focus on what's 'wrong' or 'deficient' in neurodivergent individuals rather than recognizing their strengths. Understanding this term requires familiarity with the concept of neurodiversity itself."},"example_sentences":[{"sentence":"The company's hiring practices were criticized for being neurodiversity-negative, as they favored candidates with traditional communication skills.","translation":"その会社の採用慣行は、従来のコミュニケーションスキルを持つ候補者を優遇しており、神経多様性に対して否定的であると批判された。","type":"adjective","meaning_category":"opposition to neurodiversity"},{"sentence":"The therapist's approach was considered neurodiversity-negative because it aimed to normalize autistic behaviors rather than accepting them.","translation":"そのセラピストのアプローチは、自閉症の行動を受け入れるのではなく、正常化することを目的としていたため、神経多様性に対して否定的であると見なされた。","type":"adjective","meaning_category":"lack of understanding of neurodiversity"}]}