{"word":"transportability","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"輸送可能性、可搬性、移植性","english_definition":"The quality or state of being transportable; the ability to be easily transported or moved from one place to another. Also refers to the ability of software or data to be used in different operating environments.","examples":[{"sentence":"The transportability of the equipment was a key factor in its selection.","translation":"その装置の輸送可能性が、選定における重要な要素でした。"},{"sentence":"We need to improve the transportability of our products to reduce shipping costs.","translation":"輸送コストを削減するために、製品の輸送可能性を向上させる必要があります。"},{"sentence":"The transportability of this software across different platforms is a major advantage.","translation":"このソフトウェアの異なるプラットフォーム間での移植性は大きな利点です。"}],"collocations":["improve transportability (輸送可能性を改善する)","ensure transportability (輸送可能性を確保する)","enhance transportability (輸送可能性を高める)","software transportability (ソフトウェアの移植性)","data transportability (データの移植性)"],"synonyms":["portability","movability","transferability","conveyability","mobility","ease of transport","adaptability (in software context)"],"antonyms":["immobility","untransportability","non-portability","fixedness","stationariness"]}],"etymology":{"value":"Formed from 'transportable' (capable of being transported) with the suffix '-ity' (denoting a state or quality). 'Transportable' is derived from 'transport' (to carry from one place to another) and '-able' (capable of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtrænspɔːrtəˈbɪləti/","syllables":"trans-port-a-bil-i-ty"},"inflection":{"noun_plural":"transportabilities"},"usage_notes":{"explanation":"'Transportability' refers to the characteristic of something being easily moved or transferred. It is used in contexts where the ease of movement is important, such as in logistics, manufacturing, and software development. In software, it refers to the ability of a program or data to be used on different computer systems or platforms without requiring significant modifications.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The transportability of the idea is important.","correct":"✓ The feasibility of the idea is important.","note":"'Transportability' typically applies to physical objects or software, not abstract concepts. Use 'feasibility' or 'viability' for ideas. "},{"incorrect":"✗ The transportability of the building was difficult.","correct":"✓ Moving the building was difficult.","note":"While technically correct, it's more natural to say 'moving the building' or 'transporting the building' rather than focusing on the 'transportability' as a characteristic."}],"priority":"★★☆"},"related_words":{"derivatives":["transportable (adjective: capable of being transported)","transport (verb: to carry from one place to another; noun: the act of transporting)","transportation (noun: the act of transporting or the means of transport)"],"phrasal_verbs":[],"related_concepts":["logistics","supply chain","portability (in computing)","cross-platform compatibility","mobility","shipping","handling"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in technical and logistical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Transportability' is a formal noun that describes how easily something can be moved or carried from one place to another. This word is often used in business, engineering, and computer science. It's important to understand that it's not just about whether something *can* be moved, but also how *easily* and efficiently it can be moved. In software, it means how easily a program can be used on different types of computers or operating systems."},"example_sentences":[{"sentence":"The design of the container emphasized the **transportability** of the goods.","translation":"コンテナの設計は、商品の輸送可能性を重視していました。","type":"noun","meaning_category":"輸送可能性"},{"sentence":"The **transportability** of the data between systems was a key requirement.","translation":"システム間のデータの移植性が重要な要件でした。","type":"noun","meaning_category":"移植性"},{"sentence":"Factors affecting **transportability** include size, weight, and fragility.","translation":"輸送可能性に影響を与える要因には、サイズ、重量、および壊れやすさが含まれます。","type":"noun","meaning_category":"輸送可能性"},{"sentence":"The company invested in new packaging to improve the **transportability** of its fragile products.","translation":"会社は、壊れやすい製品の輸送可能性を向上させるために、新しいパッケージングに投資しました。","type":"noun","meaning_category":"輸送可能性"}]}