{"word":"curace","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(薬学) キュレース：南米原産の植物から抽出される矢毒の総称。特にツヅラフジ科の植物から得られるものが知られる。麻痺作用があり、狩猟に用いられた。また、麻酔薬や筋弛緩剤としての研究も行われた。","english_definition":"(Pharmacology) Curare: A general term for arrow poisons extracted from plants native to South America, especially those obtained from plants of the Menispermaceae family. Known for its paralytic effects, it was used for hunting. Research has also been conducted on its use as an anesthetic and muscle relaxant.","examples":[{"sentence":"先住民はキュレースを塗った矢で狩りを行った。","translation":"The indigenous people hunted with arrows coated in curare."},{"sentence":"キュレースの研究は、現代の麻酔薬の開発に貢献した。","translation":"Research on curare has contributed to the development of modern anesthetics."}],"collocations":["キュレース中毒 (curare poisoning)","ツヅラフジ科キュレース (Menispermaceae curare)","矢毒キュレース (arrow poison curare)"],"synonyms":["矢毒 (arrow poison)","ツヅラフジ (Menispermaceae)","麻痺毒 (paralytic poison)"],"antonyms":[]},{"part_of_speech":"noun","definition":"(医学) キュラーレ：キュレースに含まれる有効成分であるd-ツボクラリンなどの総称。神経筋接合部を遮断し、骨格筋を弛緩させる作用を持つ。手術時の筋弛緩剤として用いられる。","english_definition":"(Medicine) Curare: A general term for active ingredients found in curare, such as d-tubocurarine. It blocks the neuromuscular junction and has the effect of relaxing skeletal muscles. It is used as a muscle relaxant during surgery.","examples":[{"sentence":"キュラーレは手術中の筋肉の弛緩に使用される。","translation":"Curare is used to relax muscles during surgery."},{"sentence":"キュラーレの投与量は厳密に管理される必要がある。","translation":"The dosage of curare needs to be strictly controlled."}],"collocations":["キュラーレ製剤 (curare preparation)","d-ツボクラリン (d-tubocurarine)","神経筋遮断薬 (neuromuscular blocking agent)"],"synonyms":["d-ツボクラリン (d-tubocurarine)","筋弛緩薬 (muscle relaxant)","神経筋遮断薬 (neuromuscular blocking agent)"],"antonyms":[]}],"etymology":{"value":"キュレース (curare) という言葉は、南米の先住民の言語に由来すると考えられているが、正確な語源は不明である。","priority":"★☆☆"},"pronunciation":{"ipa":"/kjuːˈrɑːreɪ/","syllables":"kyu-raa-re"},"inflection":{"notes":"名詞なので、複数形は通常用いられない。"},"usage_notes":{"explanation":"「キュレース」は、植物由来の矢毒としての意味と、医学的な筋弛緩剤としての意味を持つ。文脈によってどちらの意味で使われているか判断する必要がある。医学的な文脈では、より正確には「キュラーレ」という言葉が使われることが多い。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ キュレースは痛み止めとして使われる。","correct":"✓ キュレースは筋弛緩剤として使われる。","note":"キュレースは痛み止めではなく、主に筋弛緩剤として使用される。"},{"incorrect":"✗ キュレースは安全な薬である。","correct":"✓ キュレースは厳密な管理下で使用される薬である。","note":"キュレースは強力な作用を持つため、厳密な管理下で使用する必要がある。"}],"priority":"★★☆"},"related_words":{"derivatives":["キュラーレ様物質 (curare-like substance)","ツボクラリン (tubocurarine)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 医学・薬学分野で使われる専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「キュレース」は、南米の植物から作られる矢毒であり、医学的には筋弛緩剤として用いられる物質を指します。この単語は、医学や薬学の専門的な文脈で使われることが多く、日常会話ではほとんど使われません。そのため、一般の読者には馴染みが薄いかもしれません。キュレースは、神経と筋肉の間の信号伝達を遮断することで、筋肉を弛緩させる効果があります。手術中に筋肉をリラックスさせるために使用されますが、その使用は厳密に管理されています。"},"example_sentences":[{"sentence":"アマゾンの先住民は、**キュレース**を塗った吹き矢で獲物を狩る。","translation":"Amazonian indigenous people hunt prey with blowgun darts coated in curare.","type":"noun","meaning_category":"矢毒"},{"sentence":"**キュレース**は、手術中の筋肉の弛緩を助けるために使用される。","translation":"Curare is used to help relax muscles during surgery.","type":"noun","meaning_category":"筋弛緩剤"}]}