{"word":"formatted","priority":"2","meanings":[{"part_of_speech":"verb (past participle)","definition":"(コンピューター) フォーマットされた、初期化された","english_definition":"Having been prepared (a storage medium) for use, by erasing existing data and organizing the storage space.","examples":[{"sentence":"The hard drive was formatted before the operating system was installed.","translation":"オペレーティングシステムをインストールする前に、ハードドライブはフォーマットされました。"},{"sentence":"Make sure the USB drive is formatted correctly.","translation":"USBドライブが正しくフォーマットされていることを確認してください。"}],"collocations":["formatted hard drive","formatted USB drive","formatted disk"],"synonyms":["initialized","prepared","organized"],"antonyms":["unformatted"]},{"part_of_speech":"adjective","definition":"(文書などが) 整えられた、書式設定された","english_definition":"Having a specific arrangement or style of text and layout.","examples":[{"sentence":"The document was formatted with a specific font and margins.","translation":"その文書は特定のフォントと余白で書式設定されました。"},{"sentence":"A well-formatted report is easier to read.","translation":"きちんと書式設定されたレポートは見やすいです。"}],"collocations":["well-formatted","poorly formatted","formatted document","formatted text"],"synonyms":["arranged","organized","styled","laid out"],"antonyms":["unformatted"]}],"etymology":{"value":"The word 'formatted' comes from the verb 'to format,' which originated in the late 19th century, initially referring to the arrangement of printed matter. In the context of computers, it began to be used in the mid-20th century to describe the process of preparing storage media for use.","priority":"2"},"pronunciation":{"ipa":"/ˈfɔːrmætɪd/","syllables":"for-mat-ted"},"inflection":{"notes":"This is the past participle form of the verb 'to format' and can also be used as an adjective."},"usage_notes":{"explanation":"'Formatted' is commonly used in the context of computers and digital devices, referring to the process of preparing a storage medium (like a hard drive or USB drive) for use. It can also refer to the arrangement and style of text in a document.","priority":"3"},"common_mistakes":{"examples":[{"incorrect":"I formatted the document with the computer.","correct":"I formatted the document on the computer.","note":"Use 'on' to indicate the platform or device used for formatting."},{"incorrect":"The data is formatted.","correct":"The data was formatted.","note":"Use the past tense 'was formatted' to indicate that the action has already been completed."}],"priority":"2"},"related_words":{"derivatives":["format","formatting","formatter"],"related_terms":["initialize","partition","file system"]},"level_frequency":{"CEFR":"B1","frequency_google_ngram":"Medium frequency","priority":"2"},"readability_explanation":{"level":"B1","text":"'Formatted' generally means something has been prepared or arranged in a specific way. In computers, it means a disk or drive has been prepared to store data. In documents, it means the text and layout have been arranged in a particular style. It's a common term in technology and writing."},"example_sentences":[{"sentence":"Have you formatted the new memory card yet?","translation":"新しいメモリカードはもうフォーマットしましたか？","type":"verb (past participle)","meaning_category":"コンピューター"},{"sentence":"The essay was formatted according to MLA guidelines.","translation":"そのエッセイはMLAのガイドラインに従って書式設定されました。","type":"adjective","meaning_category":"文書"}]}