{"word":"Scypha","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(生物) サイファ：石灰海綿綱に属する海綿動物の一属。または、杯状の海綿動物の一般的な呼称。","english_definition":"(Zoology) A genus of calcareous sponges; also, a general term for cup-shaped sponges.","examples":[{"sentence":"The Scypha sponge is often found attached to rocks in shallow marine environments.","translation":"サイファ海綿は、浅い海の環境で岩に付着しているのがよく見られる。"},{"sentence":"The body of a Scypha is typically vase-shaped with an osculum at the top.","translation":"サイファの体は通常、上部に出水孔（オスキュラム）がある壺型をしている。"}],"collocations":["Scypha ciliata","Scypha compressa","calcareous sponge","marine sponge"],"synonyms":["calcareous sponge","grantia","sponge"],"antonyms":[]},{"part_of_speech":"noun","definition":"(古生物) 古生代の海綿動物の化石の一種。","english_definition":"(Paleontology) A type of fossil sponge from the Paleozoic era.","examples":[{"sentence":"Fossilized Scypha specimens provide valuable insights into the evolution of early marine life.","translation":"化石化したサイファの標本は、初期の海洋生物の進化に関する貴重な洞察を提供する。"}],"collocations":["fossil sponge","Paleozoic sponge"],"synonyms":["fossil sponge"],"antonyms":[]}],"etymology":{"value":"Derived from the Ancient Greek word 'skyphos' (σκύφος), meaning 'cup' or 'drinking cup,' referring to the cup-like shape of these sponges.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsaɪfə/","syllables":"Sci-pha"},"inflection":{"noun_plural":"Scyphas or Scyphae"},"usage_notes":{"explanation":"'Scypha' is primarily a zoological term referring to a specific genus of calcareous sponges. It can also be used more broadly to describe any cup-shaped sponge. In paleontology, it refers to certain fossil sponges. The term is relatively uncommon outside of scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a scypha in my garden.","correct":"✓ I saw a snail in my garden.","note":"Scypha are marine animals and would not be found in a garden."},{"incorrect":"✗ Scypha are plants.","correct":"✓ Scypha are animals.","note":"Scypha are sponges, which are classified as animals, not plants."}],"priority":"★☆☆"},"related_words":{"derivatives":["Scyphate (adjective: cup-shaped)","Scyphistoma (noun: a larval stage of certain jellyfish, resembling a small cup)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Specialized scientific vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Scypha' is a specialized zoological term primarily encountered in scientific literature, particularly in the fields of marine biology and paleontology. Understanding its meaning requires a background in these disciplines. It is not part of common vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The marine biologist identified the sponge as belonging to the genus Scypha.","translation":"海洋生物学者は、その海綿動物をサイファ属に属するものと特定した。","type":"noun","meaning_category":"Genus of sponge"},{"sentence":"Scypha fossils are important for understanding the biodiversity of ancient marine ecosystems.","translation":"サイファの化石は、古代の海洋生態系の生物多様性を理解する上で重要である。","type":"noun","meaning_category":"Fossil sponge"}]}