{"word":"bottomers","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(俗語, 複数形) 肛門性交をする人、特に受動的な役割を担う人","english_definition":"(slang, plural only) A person who engages in anal sex, especially the receptive partner.","examples":[{"sentence":"Some people identify as exclusively bottomers.","translation":"完全にボトマーとして認識する人もいます。"},{"sentence":"The club was known to cater to bottomers.","translation":"そのクラブはボトマーを対象としていることで知られていました。"}],"collocations":["gay bottomers (ゲイのボトマー)","active bottomers (アクティブなボトマー)","passive bottomers (パッシブなボトマー)"],"synonyms":["receiver","passive partner"],"antonyms":["top","versatile"],"notes":"This term is considered slang and may be offensive to some. Use with caution. It is often used within the LGBTQ+ community, particularly among gay men, but can be considered derogatory if used outside of that context.","related_terms":["top","versatile","bottoming","toping"]}],"etymology":{"value":"Derived from 'bottom,' referring to the receptive role in anal sex. The '-er' suffix is added to denote a person who performs the action.","priority":"N/A"},"pronunciation":{"ipa":"/ˈbɒtəmərz/","syllables":"bot-tom-ers"},"inflection":{"noun_plural":"bottomers"},"usage_notes":{"explanation":"'Bottomers' is a slang term used, often within the LGBTQ+ community, to describe individuals who prefer or primarily take the receptive role in anal sex. It's crucial to understand the context in which this term is used, as it can be offensive if used inappropriately or outside of its intended community. The term is typically used in the plural form.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a bottomer.","correct":"✓ He is one of the bottomers.","note":"The term is usually used in plural form, 'bottomers,' to refer to a group or category of people, rather than an individual instance. However, using 'a bottom' to refer to someone who bottoms is possible, though less common."}],"priority":"N/A"},"related_words":{"derivatives":["bottom (noun)","bottoming (verb)"],"related_terms":["top","versatile"]},"level_frequency":{"frequency_google_ngram":"Low frequency. Slang term.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Bottomers' is a slang term primarily used within the LGBTQ+ community, specifically among gay men, to describe individuals who prefer the receptive role in anal sex. It's essential to understand the context and potential offensiveness of the term before using it. The term is often used in contrast to 'tops,' who prefer the insertive role, and 'versatiles,' who enjoy both roles. This term is not appropriate for general use and should only be used when discussing sexuality within a relevant and respectful context."},"example_sentences":[{"sentence":"The party was full of tops, bottomers, and versatiles.","translation":"パーティーにはトップ、ボトマー、バーサタイルがたくさんいました。","type":"noun","meaning_category":"sexual role"},{"sentence":"He identifies as one of the bottomers in the community.","translation":"彼はコミュニティの中でボトマーの一人として認識されています。","type":"noun","meaning_category":"sexual role"}]}