{"word":"spheroidization","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"球状化処理、球状化焼鈍","english_definition":"A heat treatment process used to transform the microstructure of steel and other alloys into a globular (spheroidal) form, improving ductility and machinability.","examples":[{"sentence":"Spheroidization is often used on high-carbon steels to improve their formability.","translation":"球状化処理は、高炭素鋼の成形性を向上させるためによく使用されます。"},{"sentence":"The spheroidization process involves heating the metal to a specific temperature and then slowly cooling it.","translation":"球状化処理は、金属を特定の温度まで加熱し、その後ゆっくりと冷却することを含みます。"}],"collocations":["spheroidization annealing","isothermal spheroidization","cycle spheroidization"],"synonyms":["globularization"],"antonyms":[]}],"etymology":{"value":"Derived from 'spheroid' (a shape resembling a sphere) and the suffix '-ization' (the process of becoming).","priority":"★★☆"},"pronunciation":{"ipa":"/sfɪˈrɔɪdəˌzeɪʃən/","syllables":"spher-oid-i-za-tion"},"inflection":{"noun_plural":"spheroidizations"},"usage_notes":{"explanation":"Spheroidization is a specific type of heat treatment primarily applied to steels, particularly high-carbon steels. It aims to alter the microstructure by transforming the cementite (iron carbide) phase into a spherical or globular shape. This change reduces hardness and increases ductility, making the material easier to machine, form, or cold work. The process involves heating the steel to a temperature just below its lower critical temperature (Ac1) and holding it there for an extended period, followed by slow cooling. Different spheroidization techniques exist, such as isothermal spheroidization and cycle spheroidization, each with variations in heating and cooling cycles to achieve the desired microstructure.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Spheroidization is used to increase the hardness of steel.","correct":"✓ Spheroidization is used to decrease the hardness of steel.","note":"Spheroidization reduces hardness and increases ductility."},{"incorrect":"✗ Spheroidization is a cold working process.","correct":"✓ Spheroidization is a heat treatment process.","note":"Spheroidization involves heating and cooling the metal."}],"priority":"★★☆"},"related_words":{"derivatives":["spheroidize (verb)","spheroidized (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Spheroidization' is a technical term used in materials science and metallurgy. It refers to a heat treatment process applied to steels to improve their ductility and machinability. The process involves transforming the microstructure of the steel so that the cementite phase (iron carbide) becomes spherical or globular. This makes the steel softer and easier to work with. The word is derived from 'spheroid,' which means a shape resembling a sphere, and '-ization,' which indicates a process of becoming. Understanding this term requires knowledge of materials science concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The steel underwent **spheroidization** to improve its cold formability.","translation":"鋼は冷間成形性を向上させるために球状化処理を受けた。","type":"noun","meaning_category":"球状化処理"},{"sentence":"The effectiveness of **spheroidization** depends on the specific heating and cooling cycle used.","translation":"球状化処理の有効性は、使用される特定の加熱および冷却サイクルに依存する。","type":"noun","meaning_category":"球状化処理"}]}