{"word":"muriformly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"In a way that resembles a wall or brickwork; divided into cells or compartments like a brick wall.","english_definition":"In a manner resembling a wall or brickwork; divided into cells or compartments like a brick wall.","examples":[{"sentence":"The spores were arranged muriformly within the ascus.","translation":"胞子は子のうの中で壁状に配置されていた。"},{"sentence":"The tissue is muriformly structured, with cells tightly packed together.","translation":"その組織は壁のように構造化されており、細胞が互いに密に詰まっている。"}],"collocations":["arranged muriformly","structured muriformly"],"synonyms":["cellularly","compartmentally","in a brick-like manner"],"antonyms":[]}],"etymology":{"value":"Derived from 'muriform', which comes from Latin 'murus' (wall) + 'form' (shape, form) + '-ly' (adverbial suffix). Thus, literally 'in a wall-like form'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmjʊərɪfɔːrmli/","syllables":"mu-ri-form-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Muriformly' is a technical term primarily used in biology, especially in mycology (the study of fungi) and botany, to describe structures that are divided into cells or compartments resembling bricks in a wall. It is not commonly used in everyday language.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building was muriformly designed.","correct":"✓ The building was designed with a brick-like pattern.","note":"'Muriformly' is typically used to describe microscopic structures in biology, not macroscopic architectural designs. Use 'brick-like' or more common architectural terms instead."}],"priority":"★★☆"},"related_words":{"derivatives":["muriform (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - a highly specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Muriformly' is a highly specialized term used in scientific contexts, particularly in biology, to describe arrangements or structures that resemble brickwork or walls. Due to its technical nature and limited usage, it is considered a C2 level word and is unlikely to be encountered outside of specific scientific literature or discussions. Understanding the term requires familiarity with biological terminology and concepts."},"example_sentences":[{"sentence":"The conidia are transversely and longitudinally septate, appearing muriformly.","translation":"分生子は横方向および縦方向に隔壁があり、壁のように見える。","type":"adverb","meaning_category":"Describing spore structure"},{"sentence":"The cells were muriformly arranged within the fungal stroma.","translation":"細胞は菌糸体のストロマ内で壁状に配置されていた。","type":"adverb","meaning_category":"Describing cell arrangement"}]}