{"word":"Emissaria","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Roman history) A female emissary or envoy.","english_definition":"A female emissary or envoy, especially in ancient Rome.","examples":[{"sentence":"The emissaria was sent to negotiate a peace treaty.","translation":"その女性使節は和平条約を交渉するために派遣された。"},{"sentence":"As an emissaria, she carried important messages between the warring factions.","translation":"女性使節として、彼女は交戦派閥間で重要なメッセージを伝えた。"}],"collocations":["send an emissaria","the emissaria negotiates","the emissaria delivers a message"],"synonyms":["envoy","delegate","messenger","ambassadress"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'emissarius', meaning 'one sent out'. The feminine form 'emissaria' specifically refers to a female envoy.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛmɪˈsɛəriə/","syllables":"e-mis-sar-i-a"},"inflection":{"noun_plural":"emissariae (Latin plural)"},"usage_notes":{"explanation":"The term 'emissaria' is primarily used in historical contexts, particularly when discussing ancient Rome. It denotes a female representative sent on a mission, often involving diplomacy or delivering important messages. While the term 'emissary' can be used for both males and females, 'emissaria' specifically highlights the envoy's female gender.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The emissaria was a male representative.","correct":"✓ The emissary was a male representative.","note":"'Emissaria' specifically refers to a female envoy. For a male envoy, use 'emissary'."}],"priority":"★★☆"},"related_words":{"derivatives":["emissary (noun: a person sent on a special mission, usually as a diplomatic representative)","emit (verb: to send out or give off)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - Primarily used in historical or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Emissaria' is a relatively rare and specialized term, primarily encountered in historical texts or discussions related to ancient Rome. It specifically refers to a female envoy or messenger sent on a mission. Understanding the term requires familiarity with Latin roots and historical contexts. Its usage is limited to specific academic or historical discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The Roman emissaria played a crucial role in the negotiations with the neighboring tribes.","translation":"そのローマの女性使節は、近隣部族との交渉において重要な役割を果たした。","type":"noun","meaning_category":"female envoy"},{"sentence":"As an emissaria of the queen, she was granted special privileges.","translation":"女王の女性使節として、彼女は特別な特権を与えられた。","type":"noun","meaning_category":"female envoy"}]}