{"word":"pagano","meanings":[{"part_of_speech":"noun","definition":"(イタリア語、スペイン語) 異教徒、特に古代ローマの異教徒","english_definition":"(Italian, Spanish) pagan, especially a pagan of ancient Rome.","examples":[{"sentence":"I pagani celebravano feste in onore degli dei. (Italian)","translation":"異教徒たちは神々を称える祭りを祝った。"},{"sentence":"Los paganos adoraban a muchos dioses. (Spanish)","translation":"異教徒たちは多くの神々を崇拝していた。"}],"collocations":[],"synonyms":["gentile","heathen","infidel"],"antonyms":["Christian","monotheist"],"notes":"This word is often used in historical or religious contexts."}],"etymology":{"value":"From Latin 'paganus', meaning 'country dweller, rustic; civilian, non-soldier; pagan'. Originally referred to those living in the countryside who clung to old beliefs after Christianity became widespread in cities.","priority":"★★☆"},"pronunciation":{"notes":"Pronunciation varies depending on the language. In Italian, it's roughly /paˈɡaːno/. In Spanish, it's roughly /paˈɣano/."},"inflection":{"notes":"The word has plural forms in both Italian ('pagani') and Spanish ('paganos')."},"usage_notes":{"explanation":"The term 'pagano' is primarily used in Italian and Spanish. While it translates directly to 'pagan' in English, its usage often carries a slightly different connotation, sometimes implying a connection to ancient Roman or Mediterranean paganism. It can also be used more broadly to refer to anyone who is not Christian, Jewish, or Muslim.","priority":"★★☆"},"related_words":{"derivatives":["paganismo (Spanish, Italian: paganism)"],"related_languages":["Italian","Spanish","Latin"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The word 'pagano' is a loanword from Italian and Spanish, referring to a pagan, especially one from ancient Rome. Its usage is generally limited to contexts discussing history, religion, or culture within those language spheres. Understanding requires familiarity with the historical context of paganism and its relationship to Christianity in the Roman Empire and subsequent European history."},"example_sentences":[{"sentence":"Il film racconta la storia di un romano che si converte dal pagano al cristianesimo. (Italian)","translation":"The film tells the story of a Roman who converts from paganism to Christianity.","type":"noun","meaning_category":"異教徒"},{"sentence":"En la antigüedad, los romanos consideraban a los cristianos como paganos. (Spanish)","translation":"In ancient times, the Romans considered Christians to be pagans.","type":"noun","meaning_category":"異教徒"}]}