{"word":"rod-bending","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The sport or activity of fishing, especially when considered in terms of the excitement and skill involved in bending the fishing rod when a fish is caught.","english_definition":"The activity of fishing, particularly emphasizing the action of the rod bending when a fish is hooked.","examples":[{"sentence":"He enjoys rod-bending every weekend at the lake.","translation":"彼は毎週末、湖で釣りを楽しんでいます。"},{"sentence":"Rod-bending is a relaxing way to spend the afternoon.","translation":"釣りは午後のリラックスした過ごし方です。"},{"sentence":"The annual rod-bending competition attracts anglers from all over the region.","translation":"毎年恒例の釣り大会には、地域中から釣り人が集まります。"}],"collocations":["go rod-bending","rod-bending competition","enjoy rod-bending"],"synonyms":["fishing","angling","casting"],"antonyms":[]}],"etymology":{"value":"Derived from the literal action of a fishing rod bending when a fish is caught on the line.","priority":"★★★"},"pronunciation":{"ipa":"/ˈrɒdˌbɛndɪŋ/","syllables":"rod-bend-ing"},"inflection":{"noun_plural":"rod-bendings"},"usage_notes":{"explanation":"'Rod-bending' is often used to describe fishing in a more active and engaging way, highlighting the physical interaction and excitement of catching a fish. It can also be used humorously or informally.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I went to the store to buy some rod-bending.","correct":"✓ I went to the store to buy some fishing gear.","note":"'Rod-bending' refers to the activity of fishing, not the equipment used for fishing."}],"priority":"★★☆"},"related_words":{"derivatives":["rod (noun: fishing rod)","bend (verb: to curve or angle)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Rod-bending' is a specific term for fishing, emphasizing the excitement of the rod bending when a fish is caught. It's more descriptive than simply saying 'fishing' and is often used to convey the thrill of the sport. It's not a very common term, so it might not be understood by everyone.","note":"This term is more commonly used among fishing enthusiasts."},"example_sentences":[{"sentence":"The thrill of rod-bending keeps him coming back to the river every season.","translation":"釣りのスリルが彼を毎シーズン川に戻らせる。","type":"noun","meaning_category":"fishing"},{"sentence":"He spent the day rod-bending, hoping to catch a big one.","translation":"彼は一日中釣りをして、大物を釣ろうと願った。","type":"noun","meaning_category":"fishing"}]}