{"word":"Overcup","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"オーバーカップオーク：北米原産の落葉樹で、ドングリがほぼ完全にカップに覆われているのが特徴。","english_definition":"A deciduous oak tree native to North America, noted for its acorns being almost entirely enclosed in the cup.","examples":[{"sentence":"The Overcup is a large tree, growing up to 100 feet tall.","translation":"オーバーカップオークは大きな木で、高さ100フィートまで成長します。"},{"sentence":"The acorns of the Overcup are an important food source for wildlife.","translation":"オーバーカップオークのドングリは、野生動物にとって重要な食料源です。"}],"collocations":["Overcup oak tree","Overcup acorn","Overcup habitat"],"synonyms":["Quercus lyrata"],"antonyms":[]}],"etymology":{"value":"The name \"Overcup\" refers to the acorn's cup, which covers most of the nut.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈoʊvərkʌp/","syllables":"o-ver-cup"},"inflection":{"noun_plural":"Overcups"},"usage_notes":{"explanation":"The Overcup is a specific type of oak tree, so the term is primarily used in botanical or ecological contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw an overcup in the forest. It was very tall.","correct":"✓ I saw an overcup oak in the forest. It was very tall.","note":"It's better to specify 'Overcup oak' to avoid confusion, as 'overcup' alone might not be understood."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Overcup' refers to a specific species of oak tree, Quercus lyrata. It is a relatively uncommon term, primarily used in botany, forestry, or ecological contexts. Understanding requires familiarity with tree identification and botanical terminology."},"example_sentences":[{"sentence":"The bottomlands are often dominated by bald cypress and Overcup.","translation":"低地はしばしばヌマスギとオーバーカップオークが優占種です。","type":"noun","meaning_category":"樹木"},{"sentence":"The swamp provides a critical habitat for the Overcup and many other species.","translation":"その湿地はオーバーカップオークや他の多くの種にとって重要な生息地です。","type":"noun","meaning_category":"樹木"}]}