{"word":"chokecherries","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"チョークチェリー（バラ科の植物、およびその果実）","english_definition":"The fruit of the chokecherry tree, Prunus virginiana.","examples":[{"sentence":"Chokecherries are often used to make jams and jellies.","translation":"チョークチェリーは、しばしばジャムやゼリーを作るために使われます。"},{"sentence":"The birds love to eat chokecherries in the fall.","translation":"鳥たちは秋にチョークチェリーを食べるのが大好きです。"}],"collocations":["chokecherry jam","chokecherry jelly","chokecherry syrup"],"synonyms":["Prunus virginiana fruit"],"antonyms":[]},{"part_of_speech":"noun","definition":"チョークチェリーの木（バラ科の植物）","english_definition":"A shrub or small tree, Prunus virginiana, of the rose family, native to North America, having white flowers and dark red or blackish fruit.","examples":[{"sentence":"Chokecherries are common along the riverbanks.","translation":"チョークチェリーは川岸によく見られます。"},{"sentence":"The chokecherry tree provides food and shelter for wildlife.","translation":"チョークチェリーの木は野生動物に食料と避難場所を提供します。"}],"collocations":["chokecherry tree","wild chokecherry"],"synonyms":["Prunus virginiana","bitter-berry","black choke"],"antonyms":[]}],"etymology":{"value":"The name \"chokecherry\" comes from the astringent taste of the fruit, which can cause a choking sensation if eaten in large quantities.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʃoʊkˌtʃɛriz/","syllables":"choke-cher-ries"},"inflection":{"noun_plural":"chokecherries"},"usage_notes":{"explanation":"Chokecherries are a type of cherry that grows on a shrub or small tree. They are native to North America. The fruit is dark red or blackish and has an astringent taste. Chokecherries are often used to make jams, jellies, syrups, and wines. They can also be eaten raw, but the astringent taste may be unpleasant for some people. The chokecherry tree is also used as an ornamental plant.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate a chokecherry and it was so sweet!","correct":"✓ I ate a chokecherry and it was quite tart/astringent.","note":"Chokecherries are known for their astringent or tart flavor, not sweetness."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"chokecherries\" refers to both the fruit and the tree of *Prunus virginiana*. The fruit is known for its tart, astringent taste, and while edible, it's often processed into jams or jellies. The tree itself is a common sight in North America and provides ecological benefits. Because it's a specific type of plant, it's not a common term in everyday conversation, making it a B2 level word."},"example_sentences":[{"sentence":"She made a delicious chokecherry jam from the berries she picked.","translation":"彼女は摘んだチョークチェリーで美味しいジャムを作った。","type":"noun","meaning_category":"Fruit"},{"sentence":"The chokecherries provided a vibrant splash of color to the autumn landscape.","translation":"チョークチェリーは秋の風景に鮮やかな色の飛沫を加えた。","type":"noun","meaning_category":"Tree"}]}