{"word":"non-aggressively","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"非攻撃的に、穏やかに、控えめに","english_definition":"in a way that avoids aggression or confrontation; gently; mildly; passively.","examples":[{"sentence":"He spoke non-aggressively, trying to de-escalate the situation.","translation":"彼は状況を鎮静化しようと、非攻撃的に話した。"},{"sentence":"The company marketed its product non-aggressively, relying on word-of-mouth.","translation":"その会社は口コミを頼りに、控えめに製品を販売した。"},{"sentence":"She approached the stray dog non-aggressively, offering it food.","translation":"彼女は野良犬に食べ物を与えようと、穏やかに近づいた。"}],"collocations":["speak non-aggressively (非攻撃的に話す)","act non-aggressively (非攻撃的に行動する)","approach non-aggressively (非攻撃的に近づく)","market non-aggressively (非攻撃的に販売する)"],"synonyms":["peacefully","mildly","gently","passively","calmly","diplomatically","unassertively","meekly"],"antonyms":["aggressively","assertively","forcefully","violently","confrontationally"]}],"etymology":{"value":"「non-」+「aggressively」。「aggressively」は「aggressive」+「-ly」。","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn əˈɡrɛsɪvli/","syllables":"non-ag-gres-sive-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Non-aggressively' describes an action or manner that deliberately avoids being aggressive, confrontational, or hostile. It implies a conscious effort to be gentle, mild, and respectful, often in situations where aggression might be expected or provoked. It is frequently used in contexts involving communication, negotiation, marketing, or interacting with animals or people who might be easily threatened. It emphasizes the absence of forcefulness or hostility.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He non aggressively pushed the door open.","correct":"✓ He non-aggressively pushed the door open.","note":"The adverb 'non-aggressively' modifies the verb 'pushed', so it should be placed directly before it or after it, depending on style.  Using a hyphen helps clarify the meaning."},{"incorrect":"✗ She acted with non-aggression.","correct":"✓ She acted non-aggressively.","note":"'Non-aggression' is a noun referring to the principle or policy of avoiding aggression. 'Non-aggressively' is the adverb describing how someone acts."}],"priority":"★★☆"},"related_words":{"derivatives":["non-aggression (noun: 非侵略、非攻撃)","aggressive (adjective: 攻撃的な)","aggression (noun: 攻撃性、攻撃)","aggressively (adverb: 攻撃的に)"],"phrases":["passive-aggressive (adjective: 受動攻撃的な)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'non-aggressively' means doing something in a way that avoids being forceful, hostile, or confrontational. It is used to describe actions that are gentle, mild, and respectful, especially in situations where aggression might be expected. The word is formed by adding the prefix 'non-' (meaning 'not') to 'aggressively', which is the adverbial form of 'aggressive'. Because it is a more complex and nuanced term, it is generally used by advanced English speakers (C1 level)."},"example_sentences":[{"sentence":"The negotiator approached the discussion non-aggressively, seeking common ground.","translation":"交渉担当者は共通の基盤を求め、非攻撃的に議論に臨んだ。","type":"adverb","meaning_category":"manner"},{"sentence":"The trainer used non-aggressive methods to teach the dog new tricks.","translation":"トレーナーは犬に新しい芸を教えるために、非攻撃的な方法を用いた。","type":"adverb","meaning_category":"method"},{"sentence":"The company adopted a non-aggressive marketing strategy to build trust with customers.","translation":"その会社は顧客との信頼関係を築くために、非攻撃的なマーケティング戦略を採用した。","type":"adverb","meaning_category":"strategy"}]}