{"word":"lunar-proof","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Designed to withstand the conditions of the moon, or protected from lunar effects.","english_definition":"Designed to be resistant to the conditions found on the moon, such as extreme temperatures, vacuum, and radiation; or protected from lunar effects such as tides.","examples":[{"sentence":"The equipment used for the lunar mission was lunar-proof, ensuring its functionality in the harsh lunar environment.","translation":"月面ミッションで使用された機器は耐月面仕様であり、過酷な月面環境での機能が保証されていました。"},{"sentence":"The new lunar base is designed with lunar-proof materials to withstand the constant bombardment of micrometeorites.","translation":"新しい月面基地は、微小隕石の絶え間ない衝突に耐えるために、耐月面素材で設計されています。"}],"collocations":["lunar-proof equipment","lunar-proof materials","lunar-proof design","lunar-proof construction"],"synonyms":["moon-resistant","moon-durable","lunar-resistant","lunar-durable"],"antonyms":["lunar-vulnerable","lunar-sensitive"]}],"etymology":{"value":"Combination of 'lunar' (relating to the moon) and 'proof' (resistant to damage or penetration).","priority":"★★★"},"pronunciation":{"ipa":"/ˈluːnər pruːf/","syllables":"lu-nar proof"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"The term 'lunar-proof' is a relatively modern and specialized term, primarily used in the context of space exploration and technology. It describes items, equipment, or structures specifically engineered to function reliably in the challenging conditions of the moon. This includes resistance to extreme temperature variations, vacuum, radiation, and micrometeoroid impacts. It is not a commonly used word in everyday conversation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The sunscreen is lunar-proof.","correct":"✓ The sunscreen is effective against UV radiation.","note":"While sunscreen protects against radiation, 'lunar-proof' is generally reserved for items designed for the moon's specific environment, not just radiation protection on Earth."}],"priority":"★★☆"},"related_words":{"derivatives":["lunar (adjective: relating to the moon)","proof (noun: evidence, test; adjective: resistant)"],"related_terms":["moon base","lunar mission","space exploration","radiation shielding","thermal protection"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lunar-proof' is a technical term used to describe something that is designed to withstand the harsh conditions of the moon. This includes extreme temperatures, vacuum, and radiation. It is most often used in the context of space exploration and engineering. Because it is a specialized term, it is not commonly used in everyday language."},"example_sentences":[{"sentence":"The rover's wheels are made of a lunar-proof alloy.","translation":"ローバーの車輪は耐月面合金で作られています。","type":"adjective","meaning_category":"resistant to lunar conditions"},{"sentence":"Engineers are developing lunar-proof habitats for future moon missions.","translation":"エンジニアは、将来の月面ミッションのために耐月面居住施設を開発しています。","type":"adjective","meaning_category":"designed for lunar environment"}]}