{"word":"calefactory","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"暖房室、暖房設備","english_definition":"A room or building, especially in a monastery, that is heated; a heating apparatus.","examples":[{"sentence":"The monks retreated to the calefactory to escape the winter chill.","translation":"修道士たちは冬の寒さを避けるために暖房室に引きこもった。"},{"sentence":"The old calefactory was replaced with a modern heating system.","translation":"古い暖房設備は最新の暖房システムに置き換えられた。"}],"collocations":["monastic calefactory","central calefactory"],"synonyms":["heating room","warming room"],"antonyms":["unheated room"]}],"etymology":{"value":"Late Middle English: from late Latin calefactorium, from calefacere ‘make warm’, from calere ‘be warm’ + facere ‘make’.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkæləˈfæktəri/","syllables":"ca-le-fac-to-ry"},"inflection":{"noun_plural":"calefactories"},"usage_notes":{"explanation":"The term 'calefactory' is primarily used in historical contexts, particularly when discussing monasteries or other large buildings where a dedicated heating room was essential. It is not commonly used in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The calefactory was used to refrigerate food.","correct":"✓ The calefactory was used to heat the building.","note":"A calefactory is for heating, not cooling."}],"priority":"★☆☆"},"related_words":{"derivatives":["calefaction (noun: the act of heating or warming)","calefacient (adjective: causing warmth; noun: a warming medicine)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Calefactory' is a rare and specialized term, primarily encountered in historical or architectural contexts related to monasteries or similar institutions. It denotes a room specifically designed and used for heating. Due to its limited usage, it is unlikely to be familiar to non-specialist English speakers."},"example_sentences":[{"sentence":"The medieval monastery's calefactory offered a respite from the harsh winter winds.","translation":"中世の修道院の暖房室は、厳しい冬の風からの一時的な休息場所を提供した。","type":"noun","meaning_category":"暖房室"},{"sentence":"Archaeologists discovered the remains of the calefactory during the excavation of the ancient abbey.","translation":"考古学者は古代修道院の発掘中に暖房室の遺跡を発見した。","type":"noun","meaning_category":"暖房設備"}]}