{"word":"nonsecretion","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"非分泌：物質が分泌されないこと、または分泌機能の欠如。","english_definition":"The absence of secretion; the failure to secrete a substance, or lack of secretory function.","examples":[{"sentence":"The patient's condition was characterized by nonsecretion of insulin, leading to hyperglycemia.","translation":"患者の状態はインスリンの非分泌を特徴とし、高血糖症を引き起こした。"},{"sentence":"Nonsecretion of certain enzymes can result in digestive problems.","translation":"特定の酵素の非分泌は、消化器系の問題を引き起こす可能性がある。"}],"collocations":["insulin nonsecretion (インスリン非分泌)","enzyme nonsecretion (酵素非分泌)","gastric acid nonsecretion (胃酸非分泌)"],"synonyms":["asecretion","hyposecretion","lack of secretion"],"antonyms":["secretion","hypersecretion"]},{"part_of_speech":"noun","definition":"（細胞生物学）細胞が特定の物質を細胞外に輸送しないこと。","english_definition":"(Cell Biology) The failure of a cell to transport a particular substance outside of the cell.","examples":[{"sentence":"The study investigated the mechanisms leading to nonsecretion of the protein from the genetically modified cells.","translation":"その研究では、遺伝子組み換え細胞からのタンパク質の非分泌につながるメカニズムを調査した。"},{"sentence":"Nonsecretion mutants are often used to study the secretory pathway.","translation":"非分泌変異体は、分泌経路の研究によく使用される。"}],"collocations":["protein nonsecretion (タンパク質非分泌)","vesicular nonsecretion (小胞非分泌)"],"synonyms":["export deficiency","transport block"],"antonyms":["export","transport"]}],"etymology":{"value":"\"non-\" (否定) + \"secretion\" (分泌)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn.sɪˈkriː.ʃən/","syllables":"non-se-cre-tion"},"inflection":{"noun_plural":"nonsecretions"},"usage_notes":{"explanation":"\"Nonsecretion\" is primarily a technical term used in medical and biological contexts. It refers to the absence or failure of a normal secretory process. It is often encountered in discussions of endocrine disorders, enzyme deficiencies, and cellular transport mechanisms.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The gland was nonsecretion.","correct":"✓ The gland exhibited nonsecretion. / ✓ There was nonsecretion from the gland.","note":"\"Nonsecretion\" is a noun, not an adjective. Use it with verbs like \"exhibit,\" \"show,\" or in constructions like \"there was nonsecretion.\" Avoid using it directly to describe a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["nonsecretory (形容詞: 非分泌性の)"],"related_terms":["secretion (分泌)","endocrine (内分泌)","exocrine (外分泌)","asecretion (無分泌)","hyposecretion (分泌低下)","hypersecretion (分泌過多)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (専門的な文脈でのみ使用)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Nonsecretion\" is a technical term primarily used in medical and biological fields. It describes the absence or failure of a substance to be secreted (released) by a cell or gland. This term is typically encountered in advanced scientific literature or discussions related to endocrine disorders, cellular biology, or enzyme deficiencies. Understanding this term requires a background in biology or medicine.","priority":"★★☆"},"example_sentences":[{"sentence":"The study focused on the nonsecretion of cytokines in response to the viral infection.","translation":"その研究は、ウイルス感染に対するサイトカインの非分泌に焦点を当てた。","type":"noun","meaning_category":"非分泌 (免疫学)"},{"sentence":"Genetic defects can lead to nonsecretion of digestive enzymes, causing malabsorption.","translation":"遺伝的欠陥は、消化酵素の非分泌を引き起こし、吸収不良につながる可能性がある。","type":"noun","meaning_category":"非分泌 (医学)"}]}