{"word":"vomitingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"嘔吐しながら、吐き気を催すように","english_definition":"In a manner that involves or suggests vomiting; in a way that causes or expresses nausea or disgust.","examples":[{"sentence":"The smell was so bad it made me feel vomitingly ill.","translation":"その臭いはひどすぎて、吐き気を催すほど気分が悪くなった。"},{"sentence":"He described the scene vomitingly, unable to hold back his disgust.","translation":"彼は吐き気を催すようにその場面を描写し、嫌悪感を抑えきれなかった。"}],"collocations":["feel vomitingly ill","describe something vomitingly"],"synonyms":["nauseatingly","disgustingly","repulsively","sickeningly"],"antonyms":[]}],"etymology":{"value":"Derived from the word 'vomiting' by adding the suffix '-ly'. 'Vomiting' comes from the verb 'vomit', which originates from the Latin word 'vomere' meaning 'to vomit'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvɒmɪtɪŋli/","syllables":"vom-it-ing-ly"},"inflection":{"notes":"Adverbs do not have different forms for gender or number."},"usage_notes":{"explanation":"'Vomitingly' is an adverb that describes an action or state related to vomiting. It is often used to emphasize the intensity of nausea or disgust. It is not a commonly used word and is typically found in descriptive writing to create a vivid image.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She felt vomitingly.","correct":"✓ She felt vomitingly ill.","note":"'Vomitingly' is an adverb that modifies a verb or adjective. It needs to be used with another word to describe the manner of the action or state."}],"priority":"★☆☆"},"related_words":{"derivatives":["vomit (noun, verb)","vomiting (noun, adjective)","vomitive (adjective)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Vomitingly' is a relatively rare adverb used to describe something done in a manner that involves or suggests vomiting. It is typically used in descriptive writing to convey a strong sense of nausea or disgust. Due to its infrequent use and specific meaning, it is more likely to be encountered by advanced English learners or native speakers in literary or technical contexts."},"example_sentences":[{"sentence":"The food tasted so awful that I felt vomitingly sick.","translation":"その食べ物はとてもまずかったので、吐き気を催すほど気分が悪くなった。","type":"adverb","meaning_category":"nausea"},{"sentence":"He recounted the gruesome details vomitingly, his face pale with revulsion.","translation":"彼は身の毛もよだつ詳細を吐き気を催すように語り、顔は嫌悪感で青ざめていた。","type":"adverb","meaning_category":"disgust"}]}