{"word":"hematochyluria","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"乳糜血尿（にゅうびけつにょう）: 尿にリンパ液と血液が混じって排出される病状","english_definition":"A condition in which both chyle (lymphatic fluid) and blood are present in the urine.","examples":[{"sentence":"Hematochyluria can be caused by lymphatic obstruction or parasitic infections.","translation":"乳糜血尿は、リンパ管の閉塞または寄生虫感染によって引き起こされることがある。"}],"collocations":["chyluria","hematuria","lymphatic obstruction","parasitic infection"],"synonyms":["chylous hematuria"],"antonyms":[]}],"etymology":{"value":"'hemato-' (blood) + 'chyl-' (chyle, lymphatic fluid) + '-uria' (urine condition).","priority":"★★★"},"pronunciation":{"ipa":"/ˌhiːmætoʊkaɪˈlʊəriə/","syllables":"he-ma-to-chy-lu-ri-a"},"inflection":{"noun_plural":"hematochylurias"},"usage_notes":{"explanation":"Hematochyluria is a relatively rare condition, often associated with parasitic infections like filariasis, particularly in endemic regions. Non-parasitic causes include lymphatic abnormalities, trauma, or tumors. Diagnosis typically involves urine analysis and imaging studies to identify the source of the lymphatic and blood leakage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Hematochyluria is when only blood is in the urine.","correct":"✓ Hematochyluria is when both chyle and blood are in the urine.","note":"Hematochyluria involves both chyle and blood, not just blood (which would be hematuria)."}],"priority":"★★★"},"related_words":{"derivatives":["hematuria","chyluria","lymphuria"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hematochyluria' is a highly specialized medical term referring to the presence of both chyle and blood in the urine. Understanding this term requires a strong background in medical terminology and physiology, specifically related to the lymphatic and urinary systems. It is primarily used in medical contexts and is not commonly encountered in general language use."},"example_sentences":[{"sentence":"The patient presented with hematochyluria, prompting further investigation into possible lymphatic abnormalities.","translation":"患者は乳糜血尿を呈しており、リンパ系の異常の可能性について更なる調査が必要となった。","type":"medical case","meaning_category":"medical condition"}]}