{"word":"Marxism-Leninism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"マルクス・レーニン主義","english_definition":"A political ideology encompassing the socio-economic analyses of Karl Marx as interpreted by Vladimir Lenin; typically advocating for a one-party state and state control over the economy.","examples":[{"sentence":"Marxism-Leninism was the official ideology of the Soviet Union.","translation":"マルクス・レーニン主義はソビエト連邦の公式イデオロギーだった。"},{"sentence":"Some communist parties still adhere to Marxism-Leninism.","translation":"一部の共産党は今でもマルクス・レーニン主義を支持している。"}],"collocations":["apply Marxism-Leninism","abandon Marxism-Leninism","interpret Marxism-Leninism"],"synonyms":["communism","socialism","Leninism","Marxism"],"antonyms":["capitalism","liberalism","democracy"]}],"etymology":{"value":"Combination of 'Marxism' (the political and economic theories of Karl Marx) and 'Leninism' (Lenin's adaptation and implementation of Marxism, particularly regarding the role of the vanguard party and the dictatorship of the proletariat).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɑːrksɪzəm ˈlɛnɪnɪzəm/","syllables":"Marx-ism-Len-in-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Marxism-Leninism is a specific adaptation of Marxist theory developed by Vladimir Lenin. It emphasizes the need for a vanguard party to lead the proletariat in revolution and establish a dictatorship of the proletariat as a transitional stage to communism. It has been the ideological basis for various communist states.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Marxism-Leninism is a democratic ideology.","correct":"✓ Marxism-Leninism is a communist ideology.","note":"Marxism-Leninism is fundamentally a communist ideology, not a democratic one."},{"incorrect":"✗ Marxism-Leninism supports free markets.","correct":"✓ Marxism-Leninism advocates for state control over the economy.","note":"Marxism-Leninism typically opposes free markets and advocates for state control over the economy."}],"priority":"★★☆"},"related_words":{"derivatives":["Marxist-Leninist (adjective, noun)"],"phrasal_verbs":null,"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency, primarily used in academic or political contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Marxism-Leninism' is a complex political term referring to a specific interpretation of Marxism developed by Vladimir Lenin. It involves concepts such as the vanguard party, the dictatorship of the proletariat, and state control over the economy. Understanding this term requires familiarity with Marxist and Leninist theory, making it suitable for advanced learners or those with a background in political science."},"example_sentences":[{"sentence":"The government implemented policies based on Marxism-Leninism.","translation":"政府はマルクス・レーニン主義に基づく政策を実施した。","type":"general","meaning_category":"general"},{"sentence":"Critics argue that Marxism-Leninism leads to authoritarianism.","translation":"批評家は、マルクス・レーニン主義は権威主義につながると主張する。","type":"critical","meaning_category":"critical"}]}