{"word":"Marxism-Leninism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"マルクス・レーニン主義","english_definition":"A political ideology and a variant of Marxism that includes the political theories of Vladimir Lenin, interpreting Marxism and applying it to the socio-political conditions of Russia in the early 20th century. It was the official ideology of the Soviet Union and other communist states.","examples":[{"sentence":"Marxism-Leninism was the guiding ideology of the Communist Party of the Soviet Union.","translation":"マルクス・レーニン主義は、ソビエト連邦共産党の指導的イデオロギーであった。"},{"sentence":"Some scholars argue that Marxism-Leninism is a distortion of Marx's original ideas.","translation":"マルクス・レーニン主義は、マルクスの本来の思想を歪曲したものだと主張する学者もいる。"}],"collocations":["apply Marxism-Leninism","interpret Marxism-Leninism","adhere to Marxism-Leninism","the principles of Marxism-Leninism"],"synonyms":["communism","Soviet Marxism","Leninism"],"antonyms":["capitalism","liberalism","democracy"]}],"etymology":{"value":"Combines the names and ideas of Karl Marx and Vladimir Lenin. Marx provided the foundational theories of historical materialism and class struggle, while Lenin adapted these theories to the context of early 20th-century Russia, emphasizing the role of a vanguard party in leading the proletariat to revolution and establishing a dictatorship of the proletariat.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɑːrksɪzəm ˈlɛnɪnɪzəm/","syllables":"Marx-ism-Len-in-ism"},"inflection":{"notes":"Uncountable noun."},"usage_notes":{"explanation":"Marxism-Leninism is a complex and often controversial ideology. It is important to understand its historical context and its interpretations by different political movements. It is distinct from other forms of Marxism and is often associated with authoritarian regimes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Marxism-Leninism are a political ideology.","correct":"✓ Marxism-Leninism is a political ideology.","note":"Marxism-Leninism is a singular, uncountable noun, so it takes a singular verb."},{"incorrect":"✗ Marxism-Leninism believes in free markets.","correct":"✓ Marxism-Leninism opposes free markets.","note":"Marxism-Leninism is fundamentally opposed to free market capitalism."}],"priority":"★★☆"},"related_words":{"derivatives":["Marxist","Leninist","Stalinism","Maoism","Trotskyism"],"ideologies":["socialism","communism","historical materialism","dialectical materialism"],"people":["Karl Marx","Vladimir Lenin","Joseph Stalin","Leon Trotsky","Mao Zedong"],"organizations":["Communist Party","Bolsheviks","Comintern"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency in general texts, but higher in academic and political science contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Marxism-Leninism is a complex political ideology that combines the theories of Karl Marx with the adaptations and interpretations of Vladimir Lenin. It emphasizes class struggle, the dictatorship of the proletariat, and the role of a vanguard party in leading the revolution. Understanding this term requires familiarity with Marxist theory and the history of the Soviet Union. It is often discussed in the context of political science, history, and sociology.","priority":"★★☆"},"example_sentences":[{"sentence":"The fall of the Berlin Wall marked a decline in the influence of Marxism-Leninism.","translation":"ベルリンの壁の崩壊は、マルクス・レーニン主義の影響力の低下を示した。","type":"general","meaning_category":"historical context"},{"sentence":"Critics of Marxism-Leninism point to its authoritarian tendencies and suppression of individual freedoms.","translation":"マルクス・レーニン主義の批判者たちは、その権威主義的な傾向と個人の自由の抑圧を指摘する。","type":"critical analysis","meaning_category":"critiques"},{"sentence":"The Chinese Communist Party has adapted Marxism-Leninism to suit its own national context.","translation":"中国共産党は、マルクス・レーニン主義を自国の状況に合わせて適応させてきた。","type":"contemporary application","meaning_category":"contemporary application"}]}