{"word":"world-consuming","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"世界を滅ぼす、世界を飲み込む、または世界全体に影響を及ぼすような","english_definition":"destroying, devouring, or affecting the entire world.","examples":[{"sentence":"The story depicted a world-consuming fire that threatened all life.","translation":"その物語は、すべての生命を脅かす世界を滅ぼす炎を描いていた。"},{"sentence":"His ambition was a world-consuming desire for power.","translation":"彼の野望は、権力に対する世界を飲み込むような欲望だった。"},{"sentence":"The environmental crisis has become a world-consuming problem.","translation":"環境危機は、世界全体に影響を及ぼす問題となっている。"}],"collocations":["world-consuming fire (世界を滅ぼす炎)","world-consuming ambition (世界を飲み込むような野望)","world-consuming problem (世界全体に影響を及ぼす問題)","world-consuming threat (世界を滅ぼす脅威)"],"synonyms":["all-encompassing","global","universal","cataclysmic","devastating","omnivorous"],"antonyms":["local","limited","contained","regional"]},{"part_of_speech":"adjective","definition":"（感情・情熱などが）世界を覆い尽くすような、圧倒的な","english_definition":"(of an emotion or passion) overwhelming and all-encompassing.","examples":[{"sentence":"He was filled with a world-consuming grief after the loss of his family.","translation":"彼は家族を失い、世界を覆い尽くすような悲しみに打ちひしがれた。"},{"sentence":"Her love for him was a world-consuming passion.","translation":"彼女の彼への愛は、世界を覆い尽くすような情熱だった。"}],"collocations":["world-consuming grief (世界を覆い尽くすような悲しみ)","world-consuming love (世界を覆い尽くすような愛)","world-consuming passion (世界を覆い尽くすような情熱)"],"synonyms":["overwhelming","all-consuming","consuming","intense","profound","boundless"],"antonyms":["mild","moderate","restrained"]}],"etymology":{"value":"'World' + 'consuming'. Combining the idea of the entire world with the action of consuming or destroying.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɜːld kənˌsjuːmɪŋ/","syllables":"world-con-su-ming"},"inflection":{"notes":"Adjective, no inflections"},"usage_notes":{"explanation":"'World-consuming' is a dramatic adjective used to describe something that either literally destroys or impacts the entire world, or figuratively describes something (like an emotion) that is overwhelming and all-encompassing. It often carries a negative connotation, implying destruction or an uncontrollable force.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The world-consuming food was delicious.","correct":"✓ The all-consuming food was delicious.","note":"'World-consuming' implies destruction or global impact, so it's not appropriate to describe delicious food. 'All-consuming' might be more appropriate if you mean the food was incredibly satisfying and took up all your attention."}],"priority":"★☆☆"},"related_words":{"derivatives":["consume","consuming","world"],"related_terms":["apocalyptic","global","universal","catastrophic"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'world-consuming' is a relatively advanced and figurative adjective. It is used to describe something that has a massive impact, either literally affecting the entire world (like a global catastrophe) or figuratively describing an emotion or desire that is all-encompassing and overwhelming. Due to its figurative and dramatic nature, it is more common in literature, creative writing, or specialized discussions about global issues. The word is not typically used in everyday conversation."},"example_sentences":[{"sentence":"The ancient prophecy spoke of a world-consuming darkness that would engulf the land.","translation":"古代の予言は、その地を飲み込む世界を滅ぼす闇について語っていた。","type":"general","meaning_category":"destroying the world"},{"sentence":"His world-consuming ambition drove him to betray his friends.","translation":"彼の世界を飲み込むような野望が、彼に友人たちを裏切らせた。","type":"general","meaning_category":"overwhelming ambition"},{"sentence":"The debate over climate change has become a world-consuming issue.","translation":"気候変動に関する議論は、世界全体に影響を及ぼす問題となっている。","type":"general","meaning_category":"affecting the entire world"},{"sentence":"She felt a world-consuming sadness after the death of her pet.","translation":"彼女はペットの死後、世界を覆い尽くすような悲しみに襲われた。","type":"general","meaning_category":"overwhelming emotion"}]}