{"word":"fish-goddess","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"魚の女神、魚を司る女神","english_definition":"A female deity associated with fish, the sea, or aquatic life.","examples":[{"sentence":"The ancient mariners prayed to the fish-goddess for a safe voyage.","translation":"古代の船乗りたちは、安全な航海を魚の女神に祈った。"},{"sentence":"Local legends tell of a fish-goddess who protects the fishermen.","translation":"地元の伝説では、漁師を守る魚の女神について語られている。"}],"collocations":["worship the fish-goddess (魚の女神を崇拝する)","fish-goddess statue (魚の女神像)","ancient fish-goddess (古代の魚の女神)"],"synonyms":["sea goddess","water goddess","aquatic deity"],"antonyms":[]}],"etymology":{"value":"'Fish' and 'goddess' combined, referring to a female deity associated with fish.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfɪʃ ˌɡɒdəs/","syllables":"fish-god-dess"},"inflection":{"noun_plural":"fish-goddesses"},"usage_notes":{"explanation":"The term 'fish-goddess' is used to describe a female deity whose attributes, powers, or domain are related to fish, the sea, or water. Such goddesses appear in various mythologies and cultures, often associated with fertility, abundance, protection of fishermen, and safe sea voyages.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He prayed to the fish goddess for good luck.","correct":"✓ He prayed to the fish-goddess for good luck.","note":"The hyphen is important for compound nouns. However, usage can vary, and 'fish goddess' (without the hyphen) is also sometimes seen, though less common."}],"priority":"★★☆"},"related_words":{"derivatives":["goddess","fish","deity","sea deity"],"phrases":["sea goddess","water deity","aquatic goddess"],"priority":"★★★"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'fish-goddess' refers to a female deity associated with fish or aquatic life. This term is relatively uncommon in everyday language but may appear in discussions of mythology, folklore, or religious studies. Understanding the term requires familiarity with the concept of deities and their roles in different cultures."},"example_sentences":[{"sentence":"The temple was dedicated to the fish-goddess, revered by the coastal community.","translation":"その寺院は、沿岸部のコミュニティに崇拝されている魚の女神に捧げられていた。","type":"general","meaning_category":"general"},{"sentence":"Archaeologists discovered an ancient statue believed to represent a local fish-goddess.","translation":"考古学者たちは、地元の魚の女神を表していると考えられている古代の像を発見した。","type":"archaeology","meaning_category":"archaeology"}]}