{"word":"ovariohysterectomy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"卵巣子宮摘出術（らんそうしきゅうてきしゅつじゅつ）","english_definition":"A surgical procedure to remove the ovaries and uterus.","examples":[{"sentence":"Ovariohysterectomy is commonly performed on female dogs and cats to prevent pregnancy and certain health problems.","translation":"卵巣子宮摘出術は、妊娠の予防や特定の健康問題を防ぐために、メスの犬や猫によく行われます。"}],"collocations":["spay","neutering","surgical procedure","veterinary medicine"],"synonyms":["spaying","castration (in lay terms, though technically incorrect)"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'oophoron' (ovary), 'hystera' (uterus), and 'ektome' (excision).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊˌveɪrioʊhɪstəˈrɛktəmi/","syllables":"o·var·i·o·hys·ter·ec·to·my"},"inflection":{"noun_plural":"ovariohysterectomies"},"usage_notes":{"explanation":"Ovariohysterectomy is the technical term for what is commonly known as spaying in female animals. It is a major surgical procedure and is typically performed by a veterinarian. The procedure eliminates the animal's ability to reproduce and can also reduce the risk of certain cancers and infections.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ My dog had a hysterectomy.","correct":"✓ My dog had an ovariohysterectomy.","note":"While 'hysterectomy' refers to the removal of the uterus, 'ovariohysterectomy' includes the removal of both the uterus and ovaries, which is the standard procedure for spaying female animals."}],"priority":"★★☆"},"related_words":{"derivatives":["ovary","uterus","hysterectomy","oophorectomy"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - primarily used in veterinary and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Ovariohysterectomy' is a complex medical term referring to the surgical removal of both the ovaries and the uterus. This procedure, commonly known as spaying in animals, prevents reproduction and can mitigate certain health risks. Due to its specialized nature, the term is predominantly used within veterinary and medical fields, making it less common in general conversation. Understanding the etymology (originating from Greek words for ovary, uterus, and excision) can aid in comprehending the term's meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The veterinarian recommended an ovariohysterectomy for our dog to prevent future health complications.","translation":"獣医は、将来の健康上の合併症を防ぐために、私たちの犬に卵巣子宮摘出術を勧めました。","type":"medical","meaning_category":"surgical procedure"},{"sentence":"Ovariohysterectomy is a routine surgery performed on many female pets.","translation":"卵巣子宮摘出術は、多くのメスのペットに対して行われるルーチン手術です。","type":"veterinary","meaning_category":"surgical procedure"}]}