{"word":"sun-expelling","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"太陽を追い払う、太陽を遮る、日差しを防ぐ","english_definition":"Having the property of driving away or blocking sunlight.","examples":[{"sentence":"The thick curtains were sun-expelling, keeping the room dark even in the middle of the day.","translation":"その厚いカーテンは太陽を遮り、真昼でも部屋を暗く保っていた。"},{"sentence":"The leaves of the large tree created a sun-expelling canopy over the garden.","translation":"その大木の葉は、庭の上に太陽を遮る天蓋を作っていた。"}],"collocations":["sun-expelling curtains","sun-expelling canopy","sun-expelling material"],"synonyms":["sun-blocking","sun-shading","sun-shielding","light-blocking","opaque"],"antonyms":["sun-attracting","sun-gathering","sun-permeable","translucent"],"notes":"This word is often used to describe materials or structures designed to block sunlight."}],"etymology":{"value":"A compound word formed by combining 'sun' (referring to sunlight) and 'expelling' (driving away or forcing out).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsʌn ɪkˌspɛlɪŋ/","syllables":"sun-ex-pel-ling"},"inflection":{"notes":"This is an adjective, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Sun-expelling' is a descriptive adjective used to characterize something that effectively blocks or drives away sunlight. It is often used in contexts where the reduction of sunlight is desirable, such as in window treatments, architectural design, or protective clothing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sun-expelling is very effective.","correct":"✓ The sun-expelling material is very effective.","note":"'Sun-expelling' is an adjective and needs to modify a noun. Using it as a noun is incorrect."}],"priority":"★☆☆"},"related_words":{"derivatives":["expel","expelling"],"related_terms":["sunblock","sunshade","sunscreen","blackout curtains"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - not commonly used, but understandable.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'sun-expelling' is a compound adjective that describes something that blocks or drives away sunlight. It is not a common word, but its meaning is easily understood from its components: 'sun' (referring to sunlight) and 'expelling' (forcing out or driving away). It is typically used in contexts where blocking sunlight is a desired feature, such as in describing curtains or building materials."},"example_sentences":[{"sentence":"The new building design incorporates sun-expelling glass to reduce energy consumption.","translation":"新しい建物の設計には、エネルギー消費を削減するために太陽を遮るガラスが組み込まれている。","type":"general","meaning_category":"blocking sunlight"},{"sentence":"She chose sun-expelling blinds for her bedroom to ensure a dark and restful sleep.","translation":"彼女は暗くて安らかな睡眠を確保するために、寝室に太陽を遮るブラインドを選んだ。","type":"general","meaning_category":"blocking sunlight"}]}