{"word":"semiquartile","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"四分位範囲の半分、準四分位範囲","english_definition":"Half the interquartile range; a measure of statistical dispersion.","examples":[{"sentence":"The semiquartile range is a robust measure of spread.","translation":"準四分位範囲は、ばらつきの頑健な尺度です。"},{"sentence":"Calculate the semiquartile range to understand the data's variability.","translation":"データの変動性を理解するために、準四分位範囲を計算してください。"}],"collocations":["semiquartile range","calculate semiquartile","determine semiquartile"],"synonyms":["quartile deviation","half interquartile range"],"antonyms":[]}],"etymology":{"value":"'semi-' (half) + 'quartile' (each of four equal groups into which a population can be divided according to the distribution of values of a particular variable).","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɛmiˈkwɔːrtaɪl/","syllables":"se-mi-quar-tile"},"inflection":{"noun_plural":"semiquartiles"},"usage_notes":{"explanation":"The semiquartile range is a measure of statistical dispersion, calculated as half the difference between the upper and lower quartiles. It is less sensitive to extreme values than the range or standard deviation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The semiquartile is same as standard deviation.","correct":"✓ The semiquartile range is different from the standard deviation.","note":"The semiquartile range and standard deviation are different measures of dispersion."}],"priority":"★★★"},"related_words":{"derivatives":["quartile","interquartile range"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'semiquartile' is used in statistics to describe half of the interquartile range. This value provides a measure of the spread or dispersion of a dataset, specifically focusing on the middle 50% of the data and is less influenced by outliers compared to other measures like the range or standard deviation. It is typically used in advanced statistical analysis."},"example_sentences":[{"sentence":"The semiquartile range for the dataset was found to be 15, indicating moderate variability.","translation":"データセットの準四分位範囲は15であることがわかり、適度な変動性を示しています。","type":"noun","meaning_category":"statistical measure"},{"sentence":"Using the semiquartile range helps to avoid the influence of extreme values in the data.","translation":"準四分位範囲を使用すると、データ内の極端な値の影響を回避できます。","type":"noun","meaning_category":"statistical measure"}]}