{"word":"Anticivic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"反市民的な、非社会的な、公共の利益に反する","english_definition":"Opposed to or detrimental to the interests of a community or society; lacking concern for public welfare.","examples":[{"sentence":"His anticivic behavior included vandalism and disregard for public property.","translation":"彼の反市民的な行動には、破壊行為や公共物への配慮の欠如が含まれていた。"},{"sentence":"The company's decision to pollute the river was seen as an anticivic act.","translation":"その会社が川を汚染するという決定は、反市民的な行為とみなされた。"}],"collocations":["anticivic behavior","anticivic act","anticivic attitude","anticivic tendencies"],"synonyms":["unsocial","irresponsible","disrespectful","uncooperative","destructive"],"antonyms":["civic-minded","responsible","cooperative","respectful","social"],"notes":"The term is often used to describe actions that harm the community or show a lack of respect for public norms and values."}],"etymology":{"value":"Formed from the prefix 'anti-' (against) and 'civic' (relating to a city or community).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæntiˈsɪvɪk/","syllables":"an-ti-civ-ic"},"inflection":{"notes":"Adjectives do not inflect in English, but can form comparative and superlative forms (more anticivic, most anticivic)."},"usage_notes":{"explanation":"'Anticivic' describes behavior or attitudes that are contrary to the well-being and proper functioning of a community. It suggests a disregard for the shared values and responsibilities that hold a society together.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The anticivic person.","correct":"✓ The anticivic behavior.","note":"'Anticivic' is an adjective, so it should modify a noun (e.g., behavior, attitude, act) rather than stand alone as a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["anticivically (adverb)"],"related_terms":["civic","civics","civic-mindedness","antisocial"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Anticivic' is a relatively uncommon word used to describe actions or attitudes that are harmful or disrespectful to a community. It's often used in discussions about social responsibility and public welfare. Understanding the word requires familiarity with the prefix 'anti-' and the concept of 'civic' duty."},"example_sentences":[{"sentence":"The graffiti was an example of anticivic behavior that degraded the neighborhood.","translation":"その落書きは、近隣地域を劣化させる反市民的な行動の一例だった。","type":"example"},{"sentence":"The politician condemned the protesters' actions as anticivic and harmful to public order.","translation":"その政治家は、抗議者たちの行動を反市民的であり、公共の秩序を害するものとして非難した。","type":"example"}]}