{"word":"membrane-stabilizing","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"膜安定化作用のある","english_definition":"Having the property of stabilizing cell membranes, reducing their permeability and preventing the release of intracellular contents.","examples":[{"sentence":"Membrane-stabilizing agents can be used to treat certain types of arrhythmias.","translation":"膜安定化薬は、特定の種類のリズム障害の治療に使用できます。"},{"sentence":"The drug has membrane-stabilizing effects, which help to reduce inflammation.","translation":"この薬は膜安定化作用があり、炎症を軽減するのに役立ちます。"}],"collocations":["membrane-stabilizing agent","membrane-stabilizing drug","membrane-stabilizing effect"],"synonyms":["membrane-protective"],"antonyms":["membrane-disrupting"]},{"part_of_speech":"adjective","definition":"（特に薬理学において）細胞膜の安定化を促進する","english_definition":"(Especially in pharmacology) Promoting the stabilization of cell membranes.","examples":[{"sentence":"Lidocaine has membrane-stabilizing properties.","translation":"リドカインは膜安定化特性を持っています。"}],"collocations":["membrane-stabilizing properties"],"synonyms":["membrane stabilizing"],"antonyms":[]}],"etymology":{"value":"Formed by combining \"membrane\" (referring to a biological membrane), \"stabilizing\" (making stable), and the suffix \"-ing\" (indicating an action or property).","priority":"☆☆☆"},"pronunciation":{"ipa":"ˈmɛmˌbreɪn ˈsteɪbəˌlaɪzɪŋ","syllables":"mem-brane-sta-bi-liz-ing"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term \"membrane-stabilizing\" is primarily used in the context of pharmacology and medicine to describe substances or drugs that can protect and stabilize cell membranes. These substances often work by reducing the fluidity or permeability of the membrane, which can prevent the leakage of intracellular components and protect cells from damage.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"The membrane-stabilizing is important for cell health.","correct":"Membrane stabilization is important for cell health.","note":"\"Membrane-stabilizing\" is an adjective, so it needs a noun to modify. Use the noun form \"membrane stabilization\" instead."}],"priority":"☆☆☆"},"related_words":{"derivatives":["stabilize","stabilization","membrane"],"phrases":["cell membrane","membrane potential"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term \"membrane-stabilizing\" is a technical term used in biology, pharmacology, and medicine. It describes the action of a substance that increases the stability of a cell membrane. This is often achieved by reducing the membrane's permeability or fluidity, which helps prevent the leakage of intracellular components. Understanding this term requires a background in cell biology or a related field."},"example_sentences":[{"sentence":"The researchers investigated the membrane-stabilizing effects of the novel compound.","translation":"研究者らは、新規化合物の膜安定化効果を調査しました。","type":"scientific","meaning_category":"pharmacology"},{"sentence":"Certain antiarrhythmic drugs have membrane-stabilizing actions.","translation":"特定の抗不整脈薬は、膜安定化作用を持っています。","type":"medical","meaning_category":"pharmacology"}]}