{"word":"twice-anticipated","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"二度期待された、二度予想された","english_definition":"Having been anticipated or expected on two separate occasions.","examples":[{"sentence":"The twice-anticipated event was finally cancelled due to unforeseen circumstances.","translation":"二度期待されたイベントは、予期せぬ事態により最終的に中止となった。"},{"sentence":"The release of the twice-anticipated album was met with mixed reviews.","translation":"二度期待されたアルバムのリリースは、賛否両論の評価を受けた。"}],"collocations":["twice-anticipated release","twice-anticipated event","twice-anticipated return"],"synonyms":["long-awaited","eagerly-awaited","repeatedly-expected"],"antonyms":["unanticipated","unexpected","unforeseen"]}],"etymology":{"value":"The word is formed by combining 'twice' (meaning two times) with the past participle 'anticipated' (meaning expected or looked forward to). It suggests that something has been expected or looked forward to on two separate occasions.","priority":"N/A"},"pronunciation":{"ipa":"/ˈtwaɪs ænˈtɪsɪˌpeɪtɪd/","syllables":"twice-an-ti-ci-pa-ted"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than through comparative and superlative forms, which are not commonly used with this word."},"usage_notes":{"explanation":"The term 'twice-anticipated' is used to emphasize that an event, release, or occurrence has been expected or awaited on two separate occasions, often implying a delay or postponement between the initial expectation and the eventual realization (or cancellation). It adds a layer of emphasis compared to simply saying 'anticipated'.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The twice anticipate movie.","correct":"✓ The twice-anticipated movie.","note":"'Anticipated' should be used as the past participle form to correctly describe the state of being expected."}],"priority":"N/A"},"related_words":{"derivatives":["anticipate (verb)","anticipation (noun)"],"phrases":["highly anticipated","eagerly anticipated","long-anticipated"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'twice-anticipated' is a relatively complex adjective used to describe something that has been expected or looked forward to on two separate occasions. It implies a sense of prolonged expectation or repeated postponement. This term is less common in everyday language and is more likely to be found in formal writing or specialized contexts."},"example_sentences":[{"sentence":"The twice-anticipated software update was finally launched after numerous delays.","translation":"二度期待されたソフトウェアアップデートは、数々の遅延の末についに公開された。","type":"adjective","meaning_category":"Expected on two occasions"},{"sentence":"The twice-anticipated rematch between the two boxers generated significant buzz.","translation":"二度期待されたボクサー同士の再戦は、大きな話題を呼んだ。","type":"adjective","meaning_category":"Expected on two occasions"}]}