{"word":"periostitic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"骨膜炎の、骨膜炎性の","english_definition":"Relating to or affected by periostitis (inflammation of the periosteum).","examples":[{"sentence":"The X-ray showed periostitic changes in the tibia.","translation":"レントゲン写真には脛骨の骨膜炎性の変化が見られた。"},{"sentence":"Periostitic reactions can be caused by various factors, including infection and trauma.","translation":"骨膜炎性の反応は、感染や外傷を含む様々な要因によって引き起こされる可能性がある。"}],"collocations":["periostitic reaction","periostitic changes","periostitic inflammation"],"synonyms":["periosteal","osteitic"],"antonyms":[]}],"etymology":{"value":"Derived from 'periostitis' (inflammation of the periosteum) by adding the suffix '-ic' (relating to). 'Periostitis' comes from 'periosteum' (the membrane covering bone) + '-itis' (inflammation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɛriɒˈstɪtɪk/","syllables":"per-i-os-tit-ic"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are not commonly used for this word."},"usage_notes":{"explanation":"'Periostitic' is a medical term used to describe conditions or changes related to inflammation of the periosteum, the membrane that covers the outer surface of bones. It is often used in medical imaging reports (e.g., X-rays, MRIs) to describe findings suggestive of periostitis.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The bone is periostitic.","correct":"✓ The bone shows periostitic changes.","note":"It's more accurate to say that a bone 'shows periostitic changes' or 'has periostitic reactions' rather than saying the bone *is* periostitic. The term describes the condition, not the bone itself."}],"priority":"★★☆"},"related_words":{"derivatives":["periostitis (noun: inflammation of the periosteum)","periosteum (noun: membrane covering bone)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2 (specialized medical vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Periostitic' is a technical term primarily used in medical contexts. It describes something related to periostitis, which is the inflammation of the periosteum (the membrane covering the bone). Understanding this word requires familiarity with basic medical terminology related to bone structure and inflammation. It is typically encountered in medical reports, textbooks, or discussions among healthcare professionals.","priority":"★☆☆"},"example_sentences":[{"sentence":"The patient presented with pain and swelling, and the X-ray revealed periostitic changes.","translation":"患者は痛みと腫れを訴え、レントゲン検査では骨膜炎性の変化が認められた。","type":"adjective","meaning_category":"medical condition"},{"sentence":"Chronic periostitic inflammation can lead to bone thickening.","translation":"慢性の骨膜炎性の炎症は、骨の肥厚につながる可能性がある。","type":"adjective","meaning_category":"medical condition"}]}