{"word":"tares","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ドクムギ（毒麦）","english_definition":"A weedy plant (Vicia sativa) that resembles wheat when young, and whose seeds are poisonous.","examples":[{"sentence":"The parable of the wheat and the tares illustrates the coexistence of good and evil in the world.","translation":"麦と毒麦のたとえは、世界における善と悪の共存を例証している。"}],"collocations":["sow tares","wheat and tares"],"synonyms":["darnel","vetch"],"antonyms":[]}],"etymology":{"value":"Middle English: plural of tare, from an Old English word related to tear (in the sense ‘separate’).","priority":"★★☆"},"pronunciation":{"ipa":"/tɛərz/","syllables":"tares (1 syllable)"},"inflection":{"noun_plural":"tares"},"usage_notes":{"explanation":"'Tares' refers to a specific type of weed, particularly darnel (Lolium temulentum), which is known for its resemblance to wheat in its early stages of growth. Its seeds are poisonous. The term is often used in a biblical context, notably in the Parable of the Wheat and the Tares, to symbolize the coexistence of good and evil and the difficulty in distinguishing between them.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a tare growing in the garden.","correct":"✓ I saw tares growing in the garden.","note":"'Tare' is less commonly used in the singular form unless referring to a single plant specimen. It's generally used as 'tares' when referring to the weeds in general."}],"priority":"★★☆"},"related_words":{"derivatives":["tare (singular form of tares, less common)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tares' is a relatively uncommon word referring to a specific type of weed, most often found in agricultural or biblical contexts. Understanding its meaning requires familiarity with agricultural terminology or religious parables. The word is primarily encountered in literature or discussions related to these specific fields."},"example_sentences":[{"sentence":"Farmers must be vigilant to prevent tares from contaminating their wheat fields.","translation":"農家は、ドクムギが小麦畑を汚染するのを防ぐために警戒しなければならない。","type":"noun","meaning_category":"ドクムギ"},{"sentence":"The difficulty lies in distinguishing the wheat from the tares.","translation":"困難は、麦と毒麦を見分けることにある。","type":"noun","meaning_category":"ドクムギ"}]}