{"word":"Metallicity","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(天文学)金属量：恒星やその他の天体に存在する水素とヘリウム以外の元素の割合。","english_definition":"(astronomy) The proportion of elements other than hydrogen and helium in a star or other astronomical object.","examples":[{"sentence":"The metallicity of this star is much higher than that of the Sun.","translation":"この星の金属量は太陽よりもずっと高い。"},{"sentence":"Metallicity is an important factor in planet formation.","translation":"金属量は惑星形成における重要な要素である。"},{"sentence":"The age and metallicity of globular clusters can be determined by analyzing their spectra.","translation":"球状星団の年齢と金属量は、そのスペクトルを分析することによって決定できる。"}],"collocations":["high metallicity (高い金属量)","low metallicity (低い金属量)","stellar metallicity (恒星の金属量)","measure metallicity (金属量を測定する)","metallicity gradient (金属量勾配)"],"synonyms":["metal abundance","elemental abundance"],"antonyms":["primordial abundance (原始組成)"],"notes":["In astronomy, all elements heavier than hydrogen and helium are considered 'metals'.","Metallicity is often expressed as a logarithmic ratio relative to the Sun's metallicity.","Metallicity affects a star's color, luminosity, and evolution."]}],"etymology":{"value":"Formed from 'metal' + '-icity'. The term 'metal' in this context is used by astronomers to refer to all elements heavier than hydrogen and helium.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɛtəˈlɪsɪti/","syllables":"me-tal-li-ci-ty"},"inflection":{"noun_plural":"Metallicities"},"usage_notes":{"explanation":"In astronomy, 'metallicity' is a key parameter for understanding the formation and evolution of stars and galaxies. It's important to remember that astronomers use the term 'metal' to refer to any element heavier than hydrogen and helium. A higher metallicity generally indicates that a star formed later in the universe's history, as previous generations of stars have enriched the interstellar medium with heavier elements through nuclear fusion and supernovae.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The metallicity is measured in grams.","correct":"✓ The metallicity is often expressed as a logarithmic ratio relative to the Sun's metallicity.","note":"Metallicity is not measured in units of mass. It is typically expressed as a logarithmic ratio relative to the Sun's metallicity, often denoted as [Fe/H]."},{"incorrect":"✗ Only iron is considered when calculating metallicity.","correct":"✓ Metallicity refers to the abundance of all elements heavier than hydrogen and helium.","note":"Metallicity includes all elements heavier than hydrogen and helium, not just iron, although iron abundance is often used as a proxy for overall metallicity."}],"priority":"★★☆"},"related_words":{"derivatives":["metal (noun)","metallic (adjective)","metal-poor (adjective)","metal-rich (adjective)"],"related_concepts":["stellar evolution","nucleosynthesis","galactic chemical evolution","H II region","population I stars","population II stars"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Specialized vocabulary)","frequency_google_ngram":"Low frequency (specialized scientific term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Metallicity' is a term used in astronomy to describe the amount of elements heavier than hydrogen and helium that are present in a star or other celestial object. Even though the word contains 'metal', in astronomy, 'metal' refers to any element that is not hydrogen or helium. The metallicity of a star can tell us about its age and how it formed. Stars with higher metallicity are generally younger, because they formed from gas clouds that had been enriched with heavier elements by previous generations of stars. This is a specialized term, so it is mainly used in scientific contexts related to astronomy and astrophysics."},"example_sentences":[{"sentence":"The high **metallicity** of the exoplanet's host star suggests it is likely to have rocky planets.","translation":"その太陽系外惑星のホスト星の高い金属量は、岩石惑星を持っている可能性が高いことを示唆している。","type":"noun","meaning_category":"astronomy"},{"sentence":"By studying the **metallicity** of distant galaxies, we can learn about the early universe.","translation":"遠い銀河の金属量を研究することで、初期の宇宙について知ることができる。","type":"noun","meaning_category":"astronomy"},{"sentence":"The chemical composition and **metallicity** of the gas clouds influence star formation.","translation":"ガス雲の化学組成と金属量は星の形成に影響を与える。","type":"noun","meaning_category":"astronomy"}]}