{"word":"ideomotor","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"観念運動性の、観念運動的な","english_definition":"Relating to or involving muscular movements that originate independently of conscious volition, as in automatic writing or responses to suggestion.","examples":[{"sentence":"Ideomotor action can explain some phenomena of dowsing.","translation":"観念運動はダウジングのいくつかの現象を説明できる。"},{"sentence":"The ideomotor effect is often cited in discussions of facilitated communication.","translation":"観念運動効果は、しばしば介助コミュニケーションの議論で引用される。"}],"collocations":["ideomotor action","ideomotor response","ideomotor effect"],"synonyms":["unconscious","subconscious","automatic"],"antonyms":["conscious","voluntary"]}],"etymology":{"value":"From 'ideo-' (combining form of 'idea') + 'motor'. Coined in the 19th century to describe movements influenced by suggestion or unconscious thought.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌaɪdiːoʊˈmoʊtər/","syllables":"i-de-o-mo-tor"},"inflection":{"notes":"Does not inflect; it's primarily an adjective."},"usage_notes":{"explanation":"The term 'ideomotor' describes physical movements that occur without conscious intent or awareness. These movements are believed to be influenced by subtle suggestions, expectations, or unconscious thoughts. It is often used in the context of psychology, parapsychology, and the study of human behavior. The ideomotor effect is the phenomenon where a thought or idea leads to an unconscious physical action.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ideomotor is a type of car engine.","correct":"✓ Ideomotor action refers to unconscious muscle movements.","note":"'Ideomotor' is not related to engines or vehicles; it describes a type of involuntary muscle movement. "},{"incorrect":"✗ She has an ideomotor problem with her leg.","correct":"✓ Her leg movements are due to ideomotor action.","note":"Instead of a 'problem', it's more accurate to say the movements 'are due to ideomotor action' or 'are ideomotor in nature'."}],"priority":"★☆☆"},"related_words":{"derivatives":["ideomotility (noun): the quality or state of being ideomotor. "],"related_terms":["automatism","automatic writing","facilitated communication","dowsing"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ideomotor' is a specialized term primarily used in psychology and related fields. It describes the phenomenon where unconscious thoughts or suggestions influence muscle movements without the person being aware of it. It's often discussed in the context of facilitated communication, dowsing, and other areas where subtle, unconscious influences on behavior are examined. Understanding this term requires a background in psychological concepts. "},"example_sentences":[{"sentence":"The Ouija board's movements are often attributed to the ideomotor effect.","translation":"ウィジャボードの動きは、しばしば観念運動効果に起因すると考えられている。","type":"general","meaning_category":"general"},{"sentence":"Researchers study ideomotor responses to understand subconscious influences on behavior.","translation":"研究者たちは、行動に対する潜在意識の影響を理解するために観念運動反応を研究している。","type":"research","meaning_category":"research"},{"sentence":"The ideomotor theory suggests that thoughts can directly influence muscle movements.","translation":"観念運動理論は、思考が筋肉の動きに直接影響を与える可能性があることを示唆している。","type":"theory","meaning_category":"theory"}]}