{"word":"Euramerican","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"ヨーロッパ系アメリカ人の、またはヨーロッパとアメリカの両方に関連する","english_definition":"Relating to or characteristic of both Europe and America, especially of European Americans.","examples":[{"sentence":"Euramerican culture is a blend of European traditions and American innovations.","translation":"ヨーロッパ系アメリカ人の文化は、ヨーロッパの伝統とアメリカの革新が融合したものです。"},{"sentence":"The Euramerican population has a significant influence on American society.","translation":"ヨーロッパ系アメリカ人の人口は、アメリカ社会に大きな影響を与えています。"}],"collocations":["Euramerican culture","Euramerican population","Euramerican history","Euramerican literature","Euramerican relations"],"synonyms":["European American","Euro-American","Western","Caucasian"],"antonyms":["Afroamerican","Asian American","Indigenous American"]},{"part_of_speech":"noun","definition":"ヨーロッパ系アメリカ人","english_definition":"A person of European descent who is a citizen or resident of the United States.","examples":[{"sentence":"Many Euramericans trace their ancestry back to various European countries.","translation":"多くのヨーロッパ系アメリカ人は、自分たちの祖先を様々なヨーロッパの国々に遡ることができます。"},{"sentence":"Euramericans have contributed significantly to the development of the United States.","translation":"ヨーロッパ系アメリカ人は、アメリカ合衆国の発展に大きく貢献してきました。"}],"collocations":["a Euramerican","Euramericans"],"synonyms":["European American","Euro-American"],"antonyms":["African American","Asian American","Native American"]}],"etymology":{"value":"A blend of 'European' and 'American'.","priority":"★★★"},"pronunciation":{"ipa":"ˌjʊərəˈmɛrɪkən","syllables":"Eu-ro-a-mer-i-can"},"inflection":{"noun_plural":"Euramericans"},"usage_notes":{"explanation":"The term 'Euramerican' is used to describe people of European descent living in the Americas, primarily in the United States. It can also refer to cultural or historical connections between Europe and the Americas. The term is sometimes used to avoid the ambiguity of 'American' when referring to people of European descent, as 'American' can refer to anyone from the Americas.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Euramerican from Africa.","correct":"✓ He is an American of European descent from Africa.","note":"'Euramerican' specifically refers to people of European descent in the Americas. Someone of European descent from Africa would be described differently."},{"incorrect":"✗ The Euramerican language.","correct":"✓ The English language (in the context of the US)","note":"There is no single 'Euramerican language'. Depending on the context, you might refer to English, or specific European languages spoken in America."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["European","American","Euro-American","European American","White American"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Euramerican\" is a term used to describe people who are of European descent and live in the Americas, especially in the United States. It's a way to specify that someone is both European and American, often to distinguish them from other groups in America. It's not a very common word, so you might not hear it often, but it's useful for being precise about someone's background.","priority":"★★☆"},"example_sentences":[{"sentence":"The museum features exhibits on Euramerican settlement in the region.","translation":"その博物館では、この地域のヨーロッパ系アメリカ人の入植に関する展示を特集しています。","type":"adjective","meaning_category":"ヨーロッパ系アメリカ人の"},{"sentence":"Many Euramericans celebrate both American and European holidays.","translation":"多くのヨーロッパ系アメリカ人は、アメリカとヨーロッパ両方の祝日を祝います。","type":"noun","meaning_category":"ヨーロッパ系アメリカ人"}]}