{"word":"jammers","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"妨害装置、妨害電波発信機","english_definition":"Devices that transmit signals to disrupt or block communication or tracking systems.","examples":[{"sentence":"The police used jammers to prevent the protesters from coordinating their activities via cell phones.","translation":"警察は、抗議者たちが携帯電話で活動を調整するのを防ぐために妨害装置を使用した。"},{"sentence":"Military forces often employ jammers to disrupt enemy radar and communication systems.","translation":"軍隊は敵のレーダーや通信システムを妨害するために、しばしば妨害装置を使用する。"},{"sentence":"Some people illegally use GPS jammers in their cars to prevent their employers from tracking their movements.","translation":"雇用主が自分の動きを追跡するのを防ぐために、自分の車にGPS妨害装置を違法に使用する人もいる。"}],"collocations":["GPS jammers","cell phone jammers","radar jammers","signal jammers"],"synonyms":["signal blockers","interference devices","disruptors"],"antonyms":["communication enablers","signal boosters","repeaters"]},{"part_of_speech":"noun","definition":"(主に米国の口語) 水泳用または運動用のぴったりしたショーツ","english_definition":"(chiefly US, informal) Close-fitting shorts worn for swimming or athletics.","examples":[{"sentence":"He wore jammers for the swim meet.","translation":"彼は水泳大会のためにジャマーを着用した。"},{"sentence":"The athlete prefers jammers over looser shorts for better performance.","translation":"その運動選手は、より良いパフォーマンスのために、ゆったりしたショーツよりもジャマーを好む。"}],"collocations":["swim jammers","compression jammers","athletic jammers"],"synonyms":["compression shorts","swim briefs","trunks"],"antonyms":["baggy shorts","loose-fitting shorts"]}],"etymology":{"value":"The term 'jammers' relating to signal interference comes from the verb 'to jam,' meaning to block or disrupt. The athletic shorts sense likely derives from the garment's tight, compressive fit.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒæmərz/","syllables":"jam-mers"},"inflection":{"noun_plural":"jammers"},"usage_notes":{"explanation":"The word 'jammers' has two distinct meanings. In the context of technology and security, it refers to devices that block or disrupt signals. In sports, particularly swimming, it refers to a type of tight-fitting shorts. The context usually makes it clear which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He used jammers to listen to music.","correct":"✓ He used headphones to listen to music.","note":"'Jammers' block signals, they don't help you listen to music. Use 'headphones' or 'earbuds' instead."},{"incorrect":"✗ The spy used a jammer to amplify the signal.","correct":"✓ The spy used a jammer to block the signal.","note":"Jammers are used to block signals, not amplify them."}],"priority":"★★☆"},"related_words":{"derivatives":["jam (verb, noun)","jamming (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'jammers' has two main meanings, one related to technology and security, and the other related to sports apparel. Understanding the context is crucial to interpreting the intended meaning. The technological meaning is more specialized and less frequently encountered in everyday conversation compared to the sports apparel meaning, which is more common in athletic contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The government deployed signal **jammers** to disrupt terrorist communications.","translation":"政府はテロリストの通信を妨害するために信号妨害装置を展開した。","type":"noun","meaning_category":"妨害装置"},{"sentence":"The swimmer wore **jammers** to reduce drag in the water.","translation":"その水泳選手は、水中の抵抗を減らすためにジャマーを着用した。","type":"noun","meaning_category":"水泳用ショーツ"}]}