{"word":"corvoid","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"カラス科の、カラスに似た","english_definition":"Relating to or resembling crows or the Corvidae family.","examples":[{"sentence":"The bird exhibited corvoid characteristics, such as a strong beak and intelligent behavior.","translation":"その鳥は、強い嘴や知的な行動など、カラス科の特徴を示した。"},{"sentence":"Corvoid birds are known for their adaptability and problem-solving skills.","translation":"カラス科の鳥は、適応力と問題解決能力で知られている。"}],"collocations":["corvoid bird","corvoid behavior","corvoid characteristics"],"synonyms":["crow-like","raven-like"],"antonyms":[]},{"part_of_speech":"noun","definition":"カラス科の鳥","english_definition":"A bird of the Corvidae family.","examples":[{"sentence":"The corvoid is a common sight in urban areas.","translation":"カラス科の鳥は都市部でよく見かける。"},{"sentence":"Different species of corvoid can be found all over the world.","translation":"さまざまな種類のカラス科の鳥が世界中で見られる。"}],"collocations":["species of corvoid","types of corvoid"],"synonyms":["crow","raven","jay","magpie"],"antonyms":[]}],"etymology":{"value":"Derived from the family name Corvidae, which comes from the Latin word 'corvus' meaning 'raven'.","priority":"★★☆"},"pronunciation":{"ipa":"ˈkɔːrvɔɪd","syllables":"cor-void"},"inflection":{"noun_plural":"corvoids"},"usage_notes":{"explanation":"The term 'corvoid' is primarily used in scientific or ornithological contexts when referring to birds belonging to the Corvidae family. It can be used as both an adjective to describe characteristics of these birds and as a noun to refer to a member of the family.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The corvoid was singing a beautiful song.","correct":"✓ The songbird was singing a beautiful song.","note":"Corvids are not typically known for their melodious songs; songbirds are more appropriate in this context."}],"priority":"★☆☆"},"related_words":{"derivatives":["Corvidae (family name)","corvine (related to crows)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Corvoid' is a technical term used in ornithology to describe birds belonging to the Corvidae family, which includes crows, ravens, jays, and magpies. It is not commonly used in everyday language. The term can be used as an adjective to describe characteristics of these birds or as a noun to refer to a member of the family. Understanding the term requires some knowledge of bird classification.","priority":"★★☆"},"example_sentences":[{"sentence":"The **corvoid** family includes some of the most intelligent birds.","translation":"カラス科には、最も知的な鳥類が含まれている。","type":"noun","meaning_category":"カラス科の鳥"},{"sentence":"The **corvoid** species is known for its problem-solving abilities.","translation":"そのカラス科の種は、問題解決能力で知られている。","type":"adjective","meaning_category":"カラス科の"}]}