{"word":"Untrumping","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"Present participle of untrump.","english_definition":"Present participle of the verb 'untrump'. To reverse or undo the effect of a trump card in a card game, or more generally, to reverse or negate a previous action or statement, especially one that was boastful or exaggerated.","examples":[{"sentence":"He was desperately trying to untrumping his earlier boast after the project failed.","translation":"プロジェクトが失敗した後、彼は以前の大言壮語を何とか取り消そうとしていた。"},{"sentence":"She attempted untrumping the negative publicity by releasing a series of positive announcements.","translation":"彼女は一連の肯定的な発表をすることで、否定的な宣伝の効果を打ち消そうと試みた。"}],"collocations":["untrumping a boast","untrumping a decision","untrumping an action"],"synonyms":["reversing","negating","undoing","counteracting"],"antonyms":["confirming","reinforcing","validating"]}],"etymology":{"value":"Derived from the verb 'untrump', which combines the prefix 'un-' (meaning 'not' or 'reverse') with the verb 'trump' (to defeat by playing a trump card).","priority":"N/A"},"pronunciation":{"ipa":"/ʌnˈtrʌmpɪŋ/","syllables":"un-trump-ing"},"inflection":{"verb_forms":{"present_simple":["untrumps"],"past_simple":"untrumped","past_participle":"untrumped","present_participle":"untrumping"}},"usage_notes":{"explanation":"'Untrumping' is a relatively rare word, primarily used in contexts where a previous action or statement needs to be reversed or negated. It often carries a connotation of attempting to undo something that was previously considered advantageous or definitive. The term is most likely to appear in discussions of strategy, politics, or situations where someone is trying to backtrack from a previous commitment or assertion.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He was untrumping the situation by adding more fuel to the fire.","correct":"✓ He was exacerbating the situation by adding more fuel to the fire.","note":"'Untrumping' implies reversing or negating a previous action, not making the situation worse. Use 'exacerbating' or 'worsening' in the incorrect example's context."}],"priority":"N/A"},"related_words":{"derivatives":["untrump (verb)","untrumpable (adjective)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Untrumping' is a niche term that means reversing or negating a previous action or statement, particularly one that was boastful or intended to be decisive. It is not commonly used and requires a high level of vocabulary understanding to both comprehend and use correctly. The term is most likely to be encountered in advanced discussions of strategy, politics, or situations involving backtracking or retraction."},"example_sentences":[{"sentence":"The politician found himself untrumping his earlier promises as the economic situation worsened.","translation":"政治家は経済状況が悪化するにつれて、以前の公約を撤回せざるを得なくなった。","type":"verb (present participle)","meaning_category":"reversing a statement"},{"sentence":"By admitting his mistake, he was effectively untrumping his initial defense.","translation":"彼は自分の過ちを認めることで、事実上、最初の弁護を取り消していた。","type":"verb (present participle)","meaning_category":"negating an action"}]}