{"word":"glairiness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(通常、好ましくない) ギラギラした状態、ぎらつき、光沢、透明さ","english_definition":"The state or quality of being glairy; a viscous, translucent, or shiny appearance, often unpleasant.","examples":[{"sentence":"The glairiness of the egg white made it difficult to whip into stiff peaks.","translation":"卵白のギラギラした感じが、それを泡立てて角が立つようにするのが難しくした。"},{"sentence":"The glairiness of the cheap varnish detracted from the beauty of the wood.","translation":"安物のニスがギラギラしていたので、木の美しさが損なわれた。"},{"sentence":"The glairiness on the road surface after the rain made driving hazardous.","translation":"雨上がりの道路表面のギラギラした光沢が、運転を危険にした。"}],"collocations":["egg white glairiness","varnish glairiness","road glairiness"],"synonyms":["glossiness","shininess","translucence","viscosity"],"antonyms":["dullness","opaqueness","matte finish"]}],"etymology":{"value":"Derived from \"glairy,\" which comes from the Middle English \"glaire,\" meaning egg white. The suffix \"-ness\" is added to form a noun indicating a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡlɛərɪnəs/","syllables":"glair-i-ness"},"inflection":{"noun_plural":"glairinesses (rarely used)"},"usage_notes":{"explanation":"\"Glairiness\" is a relatively uncommon word that describes a specific type of sheen or translucence, often associated with viscous substances like egg whites or certain types of finishes. It often carries a negative connotation, implying an unpleasant or artificial shine.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The glairiness of her smile was captivating.","correct":"✓ The radiance of her smile was captivating.","note":"\"Glairiness\" is rarely used to describe something positive like a smile. \"Radiance\" or \"brightness\" would be more appropriate. "},{"incorrect":"✗ He disliked the glairiness of the matte paint.","correct":"✓ He disliked the sheen of the glossy paint.","note":"\"Glairiness\" implies a glossy or shiny appearance, not a matte one. The sentence should be corrected to reflect the intended meaning."}],"priority":"★★☆"},"related_words":{"derivatives":["glairy (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"\"Glairiness\" is a rare and specialized word. It describes a specific type of shiny or translucent appearance, often with a slightly unpleasant or artificial quality. It's most often used in technical or descriptive contexts, particularly when discussing materials like paints, varnishes, or food preparation (e.g., egg whites)."},"example_sentences":[{"sentence":"The artist tried to reduce the **glairiness** of the oil paint by adding a matte medium.","translation":"その画家は、マットメディウムを加えて油絵の具のギラギラした感じを減らそうとした。","type":"noun","meaning_category":"ギラギラした状態"},{"sentence":"The **glairiness** of the cheap plastic table was quite off-putting.","translation":"その安物のプラスチックテーブルのギラギラした感じは、かなり不快だった。","type":"noun","meaning_category":"ぎらつき"},{"sentence":"The **glairiness** of the egg white is due to its high protein content.","translation":"卵白のギラギラした感じは、タンパク質含有量が高いことが原因である。","type":"noun","meaning_category":"光沢"}]}