{"word":"diorthosis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(地質学)正長石化作用：長石が変質して正長石になること。","english_definition":"(Geology) The alteration of a feldspar into orthoclase.","examples":[{"sentence":"The diorthosis of plagioclase feldspar can result in the formation of orthoclase.","translation":"斜長石の正長石化作用は、正長石の形成をもたらす可能性がある。"}],"collocations":["diorthosis process","feldspar diorthosis"],"synonyms":["orthoclasization"],"antonyms":[]}],"etymology":{"value":"From 'ortho-' (straight, correct) + 'osis' (process, condition), reflecting the transformation into orthoclase (ortho-clase).","priority":"★★☆"},"pronunciation":{"ipa":"/daɪɔːrˈθoʊsɪs/","syllables":"di-or-tho-sis"},"inflection":{"noun_plural":"diorthoses"},"usage_notes":{"explanation":"'Diorthosis' is a relatively rare geological term specifically describing the alteration process of feldspar into orthoclase. It is primarily used in academic and technical contexts within geology and mineralogy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rock showed signs of diorthosis, indicating it was metamorphic.","correct":"✓ The rock showed signs of alteration, including the possibility of diorthosis.","note":"Diorthosis specifically refers to the alteration into orthoclase, not a general sign of metamorphism."}],"priority":"★☆☆"},"related_words":{"derivatives":["orthoclase","feldspar"],"phrasal_verbs":[],"related_terms":["albitization","sericitization"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Diorthosis' is a technical geological term. Understanding it requires a background in mineralogy and petrology. It describes a specific type of alteration process affecting feldspar minerals. Due to its specialized nature, it's unlikely to be encountered outside of advanced geological studies."},"example_sentences":[{"sentence":"Microscopic analysis revealed evidence of diorthosis within the granite sample.","translation":"顕微鏡分析により、花崗岩のサンプル中に正長石化作用の証拠が明らかになった。","type":"noun","meaning_category":"Geological process"},{"sentence":"The degree of diorthosis can influence the physical properties of the altered rock.","translation":"正長石化作用の程度は、変質した岩石の物理的特性に影響を与える可能性がある。","type":"noun","meaning_category":"Geological process"}]}