{"word":"phylarchy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"部族国家、部族支配","english_definition":"A government or state ruled by a tribe or tribal chief; tribal rule.","examples":[{"sentence":"The region was formerly under a phylarchy before the centralized government took over.","translation":"その地域は、中央政府が引き継ぐ前は部族支配下にあった。"},{"sentence":"The ancient kingdom began as a simple phylarchy.","translation":"その古代王国は、単純な部族国家として始まった。"}],"collocations":["establish a phylarchy","transition from a phylarchy","under a phylarchy"],"synonyms":["tribal rule","tribal government","chiefdom"],"antonyms":["democracy","monarchy","oligarchy"]}],"etymology":{"value":"From the Greek words 'phyle' (tribe) + 'archē' (rule).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfaɪlɑːrki/","syllables":"phy-lar-chy"},"inflection":{"noun_plural":"phylarchies"},"usage_notes":{"explanation":"'Phylarchy' is a relatively rare term used in historical or anthropological contexts to describe a form of government or social organization based on tribal structures.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The country was a phylarchy with a king.","correct":"✓ The country was a monarchy with a king.","note":"A phylarchy is ruled by a tribe or tribal chief, not a king. A king rules a monarchy."}],"priority":"★☆☆"},"related_words":{"derivatives":["phylarch (noun: a tribal chief or ruler)"],"related_terms":["tribe","chiefdom","ethnocracy"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'phylarchy' is a specialized term primarily used in academic or historical discussions about forms of government and social organization. It is not commonly encountered in everyday language. Understanding the etymology (Greek roots 'phyle' and 'arche') can aid in comprehension."},"example_sentences":[{"sentence":"Historians study the transition from phylarchy to more centralized forms of government.","translation":"歴史家は、部族国家からより中央集権的な政府形態への移行を研究する。"},{"sentence":"The society's structure was based on a complex system of phylarchy, with various tribes holding different levels of power.","translation":"その社会の構造は、複雑な部族支配のシステムに基づいており、さまざまな部族が異なるレベルの権力を持っていた。"}]}