{"word":"invigilator","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"試験監督官、試験監視員","english_definition":"A person who supervises candidates during an examination to prevent cheating.","examples":[{"sentence":"The invigilator walked around the room to ensure no one was cheating.","translation":"試験監督官は、誰も不正行為をしていないことを確認するために室内を歩き回った。"},{"sentence":"Please raise your hand if you have any questions for the invigilator.","translation":"試験監督官に質問がある場合は、手を挙げてください。"},{"sentence":"The invigilator collected the exam papers after the allotted time.","translation":"試験監督官は、割り当てられた時間の後、試験用紙を回収した。"}],"collocations":["exam invigilator","chief invigilator","invigilator duties","invigilator training"],"synonyms":["proctor","supervisor","examiner","monitor"],"antonyms":["examinee","candidate"]}],"etymology":{"value":"From Latin 'invigilare', meaning 'to watch over', 'to be vigilant'. 'In-' (on, upon) + 'vigilare' (to watch).","priority":"★★★"},"pronunciation":{"ipa":"/ɪnˈvɪdʒɪleɪtər/","syllables":"in-vig-i-la-tor"},"inflection":{"noun_plural":"invigilators"},"usage_notes":{"explanation":"'Invigilator' is the standard term in British English and some Commonwealth countries for a person who supervises exams. In American English, 'proctor' is more commonly used. The role of an invigilator is to maintain the integrity of the examination process by preventing cheating and ensuring that all rules are followed.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The invigilator was writing the exam.","correct":"✓ The invigilator was supervising the exam.","note":"Invigilators supervise the exam, they do not take or write it. The candidates write the exam."},{"incorrect":"✗ The invigilator is a student taking the test.","correct":"✓ The invigilator is supervising the students taking the test.","note":"The invigilator is the supervisor, not a student taking the test."}],"priority":"★★☆"},"related_words":{"derivatives":["invigilate (verb: to supervise an examination)","invigilation (noun: the act of supervising an examination)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in educational contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word 'invigilator' refers to someone who watches over students during an exam to prevent cheating. It's a formal word used in educational settings, particularly in the UK and Commonwealth countries. The main job of an invigilator is to make sure the exam is fair and that everyone follows the rules. In the US, the word 'proctor' is more commonly used for the same role."},"example_sentences":[{"sentence":"The **invigilator** reminded the students to turn off their phones.","translation":"試験監督官は学生たちに携帯電話の電源を切るように注意した。","type":"noun","meaning_category":"試験監督官"},{"sentence":"All **invigilators** must attend a training session before the exams begin.","translation":"すべての試験監督官は、試験が始まる前に研修会に参加しなければならない。","type":"noun","meaning_category":"試験監督官"},{"sentence":"The **invigilator** checked each student's ID before allowing them into the examination hall.","translation":"試験監督官は、学生が試験会場に入る前に、各学生のIDを確認した。","type":"noun","meaning_category":"試験監督官"}]}