{"word":"wagbeard","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Rare, humorous) A person with a long, prominent beard, especially one who is elderly or eccentric.","english_definition":"(Rare, humorous) A person with a long, prominent beard, especially one who is elderly or eccentric.","examples":[{"sentence":"Old Man Fitzwilliam, with his snowy wagbeard, was a familiar sight in the village.","translation":"雪のような長いあごひげを揺らめかせたフィッツウィリアム老人は、村では見慣れた光景だった。"},{"sentence":"He looked like a proper wagbeard, with his spectacles perched on his nose and his beard nearly reaching his knees.","translation":"彼は、鼻に眼鏡をかけ、ひげがほとんど膝に届くほどで、まさに典型的な「wagbeard」のようだった。"}],"collocations":["snowy wagbeard","eccentric wagbeard","old wagbeard"],"synonyms":["bearded man","longbeard","greybeard","old codger"],"antonyms":[]}],"etymology":{"value":"A humorous compound word formed from \"wag\" (to move or swing rapidly and repeatedly) and \"beard.\" The term suggests a beard that is long and prominent enough to swing or wag when the person moves.","priority":"★★☆"},"pronunciation":{"ipa":"ˈwæɡˌbɪərd","syllables":"wag-beard"},"inflection":{"noun_plural":"wagbeards"},"usage_notes":{"explanation":"The term \"wagbeard\" is rare and somewhat archaic, often used in a lighthearted or humorous way to describe someone with a particularly noticeable beard. It typically implies that the person is elderly or eccentric, adding to the comical effect.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a wagbeard woman.","correct":"✓ He is a wagbeard.","note":"\"Wagbeard\" refers specifically to a man with a long beard."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Wagbeard\" is a rare and humorous term, likely unfamiliar to most English speakers. It describes a man with a long, prominent beard, often implying that he is elderly or eccentric. The word is formed by combining \"wag\" (to move or swing) and \"beard,\" suggesting a beard that moves noticeably. Due to its rarity and somewhat archaic feel, it is unlikely to be encountered in everyday conversation or writing. Understanding the word requires a good grasp of English vocabulary and an appreciation for humorous or descriptive language.","priority":"★★☆"},"example_sentences":[{"sentence":"The wizard, with his flowing robes and long, white wagbeard, looked every bit the part.","translation":"魔法使いは、ゆったりとしたローブと長く白いあごひげを揺らし、まさにその役柄にふさわしい姿だった。","type":"noun","meaning_category":"descriptive"},{"sentence":"The old professor, a self-proclaimed wagbeard, regaled his students with stories of his travels.","translation":"自称「wagbeard」の老教授は、学生たちに自身の旅行の話を聞かせた。","type":"noun","meaning_category":"humorous"}]}