{"word":"unneutralising","priority":"N/A","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"中和を解除する、中和作用をなくす","english_definition":"To reverse or undo the process of neutralization; to remove or counteract a neutralizing agent or effect.","examples":[{"sentence":"The acid rain unneutralising the alkaline soil caused significant damage to the crops.","translation":"酸性雨がアルカリ性の土壌の中和を解除したため、作物に重大な被害が発生した。"},{"sentence":"The new chemical process is designed to prevent the unneutralising of the solution.","translation":"その新しい化学プロセスは、溶液の中和解除を防ぐように設計されている。"}],"collocations":["unneutralising agent","unneutralising effect","prevent unneutralising"],"synonyms":["denature","deactivate","undo","reverse","counteract"],"antonyms":["neutralize","activate","stabilize"]},{"part_of_speech":"adjective","definition":"中和を解除する、中和作用をなくす","english_definition":"Having the property of reversing or undoing neutralization.","examples":[{"sentence":"The unneutralising antibody allowed the virus to infect cells more effectively.","translation":"中和を解除する抗体により、ウイルスはより効果的に細胞に感染することができた。"},{"sentence":"The unneutralising effect of the pollutant was evident in the increased acidity of the lake.","translation":"汚染物質の中和解除効果は、湖の酸性度の上昇に明らかだった。"}],"collocations":["unneutralising antibody","unneutralising effect"],"synonyms":["denaturing","deactivating","reversing","counteracting"],"antonyms":["neutralizing","activating","stabilizing"]}],"etymology":{"value":"The word is formed by adding the prefix 'un-' (meaning 'not' or 'reverse') to the word 'neutralising'. 'Neutralising' itself comes from 'neutralize', which originates from the Latin word 'neuter' meaning 'neither'.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈnjuːtrəlaɪzɪŋ/","syllables":"un-neu-tra-li-zing"},"inflection":{"verb_forms":{"present_simple":["unneutralise","unneutralises"],"past_simple":"unneutralised","past_participle":"unneutralised","present_participle":"unneutralising"},"adjective_forms":{"comparative":"more unneutralising","superlative":"most unneutralising"}},"usage_notes":{"explanation":"'Unneutralising' is typically used in scientific or technical contexts, particularly in chemistry, biology, and environmental science. It describes a process or substance that reverses or counteracts the effects of neutralization. It is less commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unneutralising made the solution acidic.","correct":"✓ The unneutralising agent made the solution acidic.","note":"'Unneutralising' alone is not a noun. You need to specify what is doing the unneutralising (e.g., an agent, a process)."},{"incorrect":"✗ The soil was unneutralised by the rain.","correct":"✓ The soil was unneutralised by the acid rain.","note":"It's important to specify what caused the unneutralisation, as it's not a spontaneous process."}],"priority":"★★☆"},"related_words":{"derivatives":["unneutralised (adjective)","neutralise (verb)","neutralization (noun)","neutralizing (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific and technical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unneutralising' is a specialized term primarily used in scientific and technical contexts. It describes the process of reversing or counteracting neutralization, typically in chemistry or biology. Understanding this word requires familiarity with the concept of neutralization and the use of prefixes like 'un-' to indicate reversal or negation. Due to its specific usage, it is not commonly encountered in general English.","priority":"★★☆"},"example_sentences":[{"sentence":"The research focused on identifying factors that prevent the unneutralising of antibodies.","translation":"その研究は、抗体の中和解除を防ぐ要因の特定に焦点を当てていた。","type":"verb","meaning_category":"中和を解除する"},{"sentence":"The unneutralising effect of the pollutant was evident in the increased acidity of the water.","translation":"汚染物質の中和解除効果は、水の酸性度の上昇に明らかだった。","type":"adjective","meaning_category":"中和を解除する"},{"sentence":"The experiment aimed to determine the rate at which the acid would unneutralise the base.","translation":"その実験は、酸が塩基の中和を解除する速度を決定することを目的としていた。","type":"verb","meaning_category":"中和を解除する"}]}