{"word":"dichotomised","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"二分化した、二分法で分類した","english_definition":"Divided or classified into two mutually exclusive categories.","examples":[{"sentence":"The data was dichotomised into high and low groups.","translation":"データは高群と低群に二分化された。"},{"sentence":"The issue was dichotomised by the media, creating a false sense of opposition.","translation":"その問題はメディアによって二分化され、誤った対立意識が生み出された。"}],"collocations":["dichotomise data","dichotomise variables","dichotomise opinions"],"synonyms":["bifurcated","split","divided","categorized"],"antonyms":["combined","unified","merged"]}],"etymology":{"value":"From 'dichotomy,' which comes from the Greek 'dichotomia,' meaning 'a cutting in two.'","priority":"★★★"},"pronunciation":{"ipa":"/daɪˈkɒtəmaɪzd/","syllables":"di-cho-to-mised"},"inflection":{"verb_forms":{"present_simple":["dichotomise","dichotomises"],"past_simple":"dichotomised","past_participle":"dichotomised","present_participle":"dichotomising"}},"usage_notes":{"explanation":"'Dichotomised' is the past tense and past participle of 'dichotomise.' It refers to the act of dividing something into two mutually exclusive categories. It is often used in academic and scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The results were dichotomised between good and bad.","correct":"✓ The results were dichotomised into good and bad.","note":"Use 'into' to indicate the categories into which something is divided."}],"priority":"★★☆"},"related_words":{"derivatives":["dichotomy (noun): a division or contrast between two things that are or are represented as being opposed or entirely different.","dichotomous (adjective): divided or dividing into two sharply distinguished categories or parts."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'dichotomised' means to divide something into two opposite groups. It is often used in formal writing, especially in science or social science, when researchers want to simplify complex information by creating two categories. For example, a researcher might dichotomise people into 'smokers' and 'non-smokers' to study the effects of smoking. This makes it easier to compare the two groups, but it also means losing some of the details about individual differences within each group."},"example_sentences":[{"sentence":"The survey responses were dichotomised to simplify the analysis.","translation":"調査回答は分析を単純化するために二分化された。","type":"verb","meaning_category":"二分化"},{"sentence":"The continuous variable was dichotomised at the median.","translation":"連続変数は中央値で二分化された。","type":"verb","meaning_category":"二分化"},{"sentence":"The researcher dichotomised the patients into treatment and control groups.","translation":"研究者は患者を治療群と対照群に二分化した。","type":"verb","meaning_category":"二分化"}]}