{"word":"Avenin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アベニン：オート麦に含まれるタンパク質の一種。","english_definition":"A type of prolamin protein found in oats. It is similar to gluten found in wheat, but generally considered less allergenic.","examples":[{"sentence":"Avenin is a prolamin found in oats, similar to gluten in wheat.","translation":"アベニンはオート麦に含まれるプロラミンで、小麦のグルテンに似ています。"},{"sentence":"Some people with celiac disease may react to avenin, although it is less common than reactions to gluten.","translation":"セリアック病の人の中には、グルテンへの反応ほど一般的ではありませんが、アベニンに反応する人もいます。"}],"collocations":["oat avenin","avenin sensitivity","avenin intolerance","avenin content"],"synonyms":["oat prolamin"],"antonyms":[]},{"part_of_speech":"noun","definition":"オート麦の貯蔵タンパク質の一種。","english_definition":"A storage protein found in oats.","examples":[{"sentence":"Avenin is a major component of oat grain protein.","translation":"アベニンは、オート麦の穀物タンパク質の主要な構成要素です。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from Avena, the genus name for oats, plus the suffix -in, used to denote a protein.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈævənɪn/","syllables":"A-ven-in"},"inflection":{"noun_plural":"avenins"},"usage_notes":{"explanation":"Avenin is a prolamin protein found in oats. While it is similar to gluten, it is generally considered less allergenic. However, some individuals with celiac disease or gluten sensitivity may still experience a reaction to avenin.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Avenin is the same as gluten.","correct":"✓ Avenin is similar to gluten, but not the same.","note":"Avenin and gluten are both prolamin proteins, but they are not identical. Avenin is found in oats, while gluten is found in wheat, barley, and rye."},{"incorrect":"✗ All people with celiac disease react to avenin.","correct":"✓ Some people with celiac disease may react to avenin, but not all.","note":"While some individuals with celiac disease may react to avenin, it is less common than reactions to gluten."}],"priority":"★★☆"},"related_words":{"derivatives":["Avena (genus of oats)","Prolamin (type of protein)","Gluten (protein found in wheat, barley, and rye)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"Avenin is a technical term related to the protein composition of oats. Understanding this term requires a background in biology or nutrition. It is relevant for individuals with celiac disease or gluten sensitivity who are researching the safety of oats in their diet."},"example_sentences":[{"sentence":"The study investigated the allergenic potential of avenin in individuals with celiac disease.","translation":"その研究では、セリアック病患者におけるアベニンのアレルギー誘発性の可能性が調査されました。","type":"scientific","meaning_category":"protein"},{"sentence":"Oats contain avenin, a prolamin protein that is generally well-tolerated.","translation":"オート麦には、一般的に耐容性の高いプロラミンタンパク質であるアベニンが含まれています。","type":"nutritional","meaning_category":"protein"}]}