{"word":"bantet","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"(Indonesian, colloquial) stunted; undersized; not growing to the normal size","english_definition":"(of a person, animal, or plant) abnormally small or short; having impaired growth.","examples":[{"sentence":"Tanaman ini bantet karena tanahnya tidak subur.","translation":"This plant is stunted because the soil is not fertile."}],"collocations":["anak bantet (stunted child)","pertumbuhan bantet (stunted growth)"],"synonyms":["kerdil","pendek","terhambat pertumbuhannya"],"antonyms":["tinggi","besar","normal"],"cultural_note":"Often used to describe children who are not growing properly. Can sometimes be used in a derogatory way, so use with caution."}],"etymology":{"value":"Likely derived from Javanese or other regional Indonesian languages. The exact origin is uncertain, but it describes a condition of arrested or impaired growth.","priority":"low"},"pronunciation":{"ipa":"/ˈban.tɛt/","syllables":"ban-tet"},"inflection":{"notes":"Does not inflect; it is an adjective."},"usage_notes":{"explanation":"'Bantet' is primarily used in Indonesian to describe something (usually living) that is smaller than it should be due to a lack of proper development. It's important to consider the context when using this word, as it can be offensive.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"Rumah itu bantet.","correct":"Rumah itu kecil.","note":"'Bantet' is generally not used to describe inanimate objects like houses. Use 'kecil' (small) instead."}],"priority":"low"},"related_words":{"derivatives":[],"related_terms":["kerdil (dwarf)","pendek (short)","tinggi (tall)","besar (big)"],"priority":"low"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"low"},"readability_explanation":{"level":"Intermediate","text":"'Bantet' is a colloquial Indonesian term, primarily used to describe stunted growth in living things. It is not a formal word and can sometimes be considered impolite. It's important to use it carefully and be aware of the context."},"example_sentences":[{"sentence":"Karena kekurangan gizi, anak-anak di desa itu banyak yang bantet.","translation":"Due to malnutrition, many children in that village are stunted.","type":"adjective","meaning_category":"stunted growth"},{"sentence":"Petani itu khawatir karena padi yang ditanamnya tumbuh bantet.","translation":"The farmer was worried because the rice he planted was growing stunted.","type":"adjective","meaning_category":"stunted growth"}]}