{"word":"column-mounted","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"柱に取り付けられた、コラムに取り付けられた","english_definition":"Attached to or mounted on a column.","examples":[{"sentence":"The car has column-mounted gear shifters.","translation":"その車はコラムシフトのギアチェンジレバーを備えている。"},{"sentence":"The column-mounted display showed the current temperature.","translation":"柱に取り付けられたディスプレイには現在の気温が表示されていた。"},{"sentence":"They installed a column-mounted spotlight to illuminate the statue.","translation":"彼らは像を照らすために柱に取り付けられたスポットライトを設置した。"}],"collocations":["column-mounted gear shifter","column-mounted display","column-mounted spotlight","column-mounted controls"],"synonyms":["pillar-mounted","post-mounted","stand-mounted"],"antonyms":["dashboard-mounted","wall-mounted","floor-mounted"]},{"part_of_speech":"adjective","definition":"(自動車部品について)ステアリングコラムに取り付けられた","english_definition":"(Specifically regarding automotive parts) Attached to the steering column of a vehicle.","examples":[{"sentence":"The vehicle features column-mounted controls for the wipers and lights.","translation":"その車両はワイパーとライトのコラムに取り付けられたコントロールを備えている。"},{"sentence":"A column-mounted ignition switch is a common feature in older cars.","translation":"コラムに取り付けられたイグニッションスイッチは古い車によく見られる特徴だ。"}],"collocations":["column-mounted ignition switch","column-mounted stalk","column-mounted control"],"synonyms":["steering column-mounted"],"antonyms":["dashboard-mounted","console-mounted"]}],"etymology":{"value":"The term is formed by combining 'column' (a supporting pillar or structure) with 'mounted' (attached or fixed).","priority":"★★★"},"pronunciation":{"ipa":"/ˈkɒləm ˌmaʊntɪd/","syllables":"col-umn-mount-ed"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Column-mounted' generally describes something attached to a vertical support structure. In the context of automobiles, it specifically refers to items attached to the steering column. The term is descriptive and relatively straightforward in its application.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The column mounted on the wall.","correct":"✓ The shelf was wall-mounted. / ✓ The column was mounted on the wall.","note":"'Column-mounted' means attached to a column, not that the column itself is attached to something else. If the column is attached to the wall, it's not 'column-mounted'; something else is wall-mounted. "},{"incorrect":"✗ He has a column-mounted phone.","correct":"✓ He has a phone holder mounted on the column.","note":"While technically possible, it's more common to say that a phone holder or device is column-mounted, rather than the phone itself."}],"priority":"★★☆"},"related_words":{"derivatives":["mount (verb, noun)","mounting (noun)","column (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The term 'column-mounted' is relatively specific and technical. It means something is attached to a column, which is a vertical supporting structure. You'll often find it used to describe parts of a car, like the gear shifter or ignition switch, that are attached to the steering column. It's a compound adjective, so it combines two ideas into one. Understanding the meaning of 'column' and 'mounted' separately will help you understand the meaning of the whole term."},"example_sentences":[{"sentence":"The classic car had a column-mounted gear selector.","translation":"そのクラシックカーはコラムシフトのギアセレクターを備えていた。","type":"adjective","meaning_category":"自動車部品"},{"sentence":"A column-mounted fan provided extra cooling in the server room.","translation":"柱に取り付けられた扇風機がサーバー室に追加の冷却を提供した。","type":"adjective","meaning_category":"一般的な取り付け"},{"sentence":"The column-mounted information screen displayed train schedules.","translation":"柱に取り付けられた情報スクリーンには列車の時刻表が表示されていた。","type":"adjective","meaning_category":"一般的な取り付け"}]}