{"word":"unimmunized","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"予防接種を受けていない、免疫がない","english_definition":"Not immunized; not having received a vaccine to produce immunity to a disease.","examples":[{"sentence":"Unimmunized children are at greater risk of contracting measles.","translation":"予防接種を受けていない子供たちは、麻疹に感染するリスクがより高いです。"},{"sentence":"The outbreak spread quickly through the unimmunized population.","translation":"そのアウトブレイクは、予防接種を受けていない人々の間で急速に広がりました。"},{"sentence":"It is important to ensure that all children are immunized to prevent the spread of disease, as unimmunized individuals can pose a risk to others.","translation":"病気の蔓延を防ぐために、すべての子供たちが予防接種を受けるようにすることが重要です。予防接種を受けていない人は、他の人にリスクをもたらす可能性があります。"}],"collocations":["unimmunized children","unimmunized population","unimmunized against measles","remain unimmunized","risk to unimmunized"],"synonyms":["unvaccinated","non-immunized","susceptible","vulnerable"],"antonyms":["immunized","vaccinated","protected","immune"]}],"etymology":{"value":"The word 'unimmunized' is formed by adding the prefix 'un-' (meaning 'not') to the word 'immunized'. 'Immunized' comes from 'immunize', which means 'to make immune'. The root 'immune' comes from the Latin word 'immunis', meaning 'exempt from public service, untaxed, free'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnɪˈmjuːnaɪzd/","syllables":"un-im-mu-nized"},"inflection":{"notes":"This is an adjective, so it doesn't inflect like a verb. However, it can be used in comparative and superlative forms (more unimmunized, most unimmunized), although this is less common."},"usage_notes":{"explanation":"The term 'unimmunized' is typically used in medical and public health contexts to describe individuals who have not received vaccines that would protect them from specific diseases. It is often used when discussing the importance of vaccination programs and the risks associated with not being vaccinated. The term is generally neutral, but it can sometimes carry a negative connotation when used in discussions about public health, as unimmunized individuals can pose a risk to others.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unimmunized child.","correct":"✓ The unimmunized child is at risk.","note":"'Unimmunized' is an adjective and needs a noun to modify or to be part of a complete sentence. It doesn't function as a noun itself."},{"incorrect":"✗ He is unimmune.","correct":"✓ He is unimmunized.","note":"'Unimmune' is not a standard word. The correct term to describe someone who lacks immunity due to not being vaccinated is 'unimmunized'."},{"incorrect":"✗ The unimmunized people are safe.","correct":"✓ The unimmunized people are at risk.","note":"It is important to accurately portray the risks associated with being unimmunized. While individual circumstances vary, generally, unimmunized individuals are more vulnerable to certain diseases."}],"priority":"★★☆"},"related_words":{"derivatives":["immunize (verb)","immunization (noun)","immunity (noun)"],"phrasal_verbs":[],"related_medical_terms":["vaccine","vaccination","herd immunity","disease","infection","outbreak","epidemic","pandemic"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in medical and public health contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unimmunized' is a term used to describe someone who has not received a vaccine to protect them from a specific disease. It is formed by adding the prefix 'un-' to 'immunized,' indicating the absence of immunization. This word is most often encountered in discussions about public health, vaccination programs, and the risks associated with infectious diseases. Understanding this term is important for comprehending information related to healthcare and disease prevention."},"example_sentences":[{"sentence":"The doctor recommended that the **unimmunized** baby receive all necessary vaccinations.","translation":"医師は、予防接種を受けていない赤ちゃんが必要な予防接種をすべて受けることを推奨しました。","type":"adjective","meaning_category":"not vaccinated"},{"sentence":"The study focused on the impact of the measles outbreak on **unimmunized** populations.","translation":"その研究は、麻疹の発生が予防接種を受けていない人々に与える影響に焦点を当てました。","type":"adjective","meaning_category":"not vaccinated"},{"sentence":"Because she was **unimmunized**, she contracted the flu during the epidemic.","translation":"彼女は予防接種を受けていなかったので、流行中にインフルエンザにかかりました。","type":"adjective","meaning_category":"not vaccinated"}]}