{"word":"Stonebiter","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(ファンタジー)石を食べる者、石を噛む者","english_definition":"(Fantasy) A creature or being that consumes or gnaws on stone.","examples":[{"sentence":"The Stonebiter gnawed at the mountain, slowly carving a path through the rock.","translation":"ストーンバイターは山を噛み、ゆっくりと岩を削って道を作った。"},{"sentence":"Legends spoke of a Stonebiter that could devour entire castles.","translation":"伝説では、城全体を食い尽くすことができるストーンバイターについて語られていた。"}],"collocations":["stonebiter lair","stonebiter teeth","stonebiter diet"],"synonyms":["rock eater","stone eater"],"antonyms":[]}],"etymology":{"value":"A compound word formed from \"stone\" (a piece of rock) and \"biter\" (one who bites).","priority":"★★★"},"pronunciation":{"ipa":"/ˈstoʊnˌbaɪtər/","syllables":"stone-bi-ter"},"inflection":{"noun_plural":"Stonebiters"},"usage_notes":{"explanation":"This word is primarily used in fantasy literature and games to describe creatures with the ability to consume stone. It does not have a common real-world usage.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a stonebiter, so he eats everything.","correct":"✓ He is a stonebiter, so he eats rocks.","note":"Stonebiters specifically eat stone, not everything."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency. Primarily found in fantasy contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Stonebiter' is a compound word, easily understood as someone or something that bites stone. Its usage is almost exclusively within the realm of fantasy, making it less common in everyday language. Understanding requires familiarity with fantasy tropes.","priority":"★★☆"},"example_sentences":[{"sentence":"The dwarf warrior was known as Stonebiter for his incredible strength and resilience.","translation":"そのドワーフの戦士は、信じられないほどの力と回復力からストーンバイターとして知られていた。","type":"noun","meaning_category":"石を食べる者"},{"sentence":"The Stonebiter's cave was filled with the dust and debris of consumed rocks.","translation":"ストーンバイターの洞窟は、食べられた岩の塵と破片で満たされていた。","type":"noun","meaning_category":"石を食べる者"}]}