{"word":"persecutory","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"迫害的な、迫害妄想的な","english_definition":"relating to or characterized by persecution or a belief that one is being persecuted.","examples":[{"sentence":"He suffered from persecutory delusions, believing that everyone was out to get him.","translation":"彼は迫害妄想に苦しみ、誰もが自分を陥れようとしていると信じていた。"},{"sentence":"The patient exhibited persecutory behavior, accusing the staff of trying to harm him.","translation":"患者は迫害的な行動を示し、職員が自分を傷つけようとしていると非難した。"},{"sentence":"Persecutory thoughts can be a symptom of certain mental disorders.","translation":"迫害的な思考は、特定の精神疾患の症状である可能性がある。"}],"collocations":["persecutory delusions (迫害妄想)","persecutory behavior (迫害的な行動)","persecutory thoughts (迫害的な思考)","persecutory ideation (迫害観念)"],"synonyms":["paranoid","oppressive","tyrannical","abusive","harassing"],"antonyms":["supportive","benevolent","kind","compassionate"]}],"etymology":{"value":"Derived from 'persecute,' which comes from the Latin 'persequi,' meaning 'to follow persistently, pursue, harass.' The suffix '-ory' indicates a quality or function relating to the root word.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɜːrsɪˌkjuːtəri/","syllables":"per-se-cu-to-ry"},"inflection":{"notes":"Adjectives do not typically inflect in English, though they can be modified by adverbs (e.g., 'very persecutory')."},"usage_notes":{"explanation":"'Persecutory' is primarily used in psychological and psychiatric contexts to describe beliefs, thoughts, or behaviors related to the idea that one is being targeted, harassed, or harmed by others. It is often associated with paranoia and mental health conditions. While 'persecutory' can describe actual oppressive behavior, it more commonly refers to the subjective experience of being persecuted, even when no objective threat exists.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The persecutory government was overthrown.","correct":"✓ The oppressive government was overthrown.","note":"While 'persecutory' can describe actual oppression, 'oppressive' is a more common and direct way to describe a government that persecutes its people. 'Persecutory' is more often used in the context of mental health to describe paranoid beliefs. "},{"incorrect":"✗ He had a persecutory feeling.","correct":"✓ He had a persecutory delusion. / ✓ He had a feeling of being persecuted.","note":"'Persecutory' is often used to describe delusions or ideations. A 'feeling of being persecuted' is also correct."}],"priority":"★★☆"},"related_words":{"derivatives":["persecute (verb: to harass or oppress)","persecution (noun: the act of persecuting)","persecutor (noun: one who persecutes)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'persecutory' is a specialized term primarily used in the fields of psychology and psychiatry. It describes beliefs, thoughts, or behaviors related to the idea that one is being targeted, harassed, or harmed by others, often in the context of mental health conditions like paranoia. Understanding this word requires familiarity with psychological concepts and a high level of English proficiency. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The patient's persecutory delusions led him to distrust everyone around him.","translation":"患者の迫害妄想は、彼に周囲のすべての人を信用させなくさせた。","type":"adjective","meaning_category":"迫害妄想的な"},{"sentence":"The therapist worked with her to challenge her persecutory thoughts.","translation":"セラピストは彼女の迫害的な思考に異議を唱えるために彼女と協力した。","type":"adjective","meaning_category":"迫害的な思考"},{"sentence":"His persecutory behavior strained his relationships with family and friends.","translation":"彼の迫害的な行動は、家族や友人との関係を悪化させた。","type":"adjective","meaning_category":"迫害的な行動"}]}