{"word":"levelman","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"水平器を使用する人、または水平を測る人","english_definition":"A person who uses a level, or whose job is to determine levels.","examples":[{"sentence":"The construction crew included several levelmen to ensure the foundation was perfectly horizontal.","translation":"建設作業員には、基礎が完全に水平になるように、数人の水平出し作業員が含まれていました。"},{"sentence":"As a levelman, his primary responsibility was to accurately survey the land.","translation":"水平出し作業員として、彼の主な責任は土地を正確に測量することでした。"}],"collocations":["construction levelman","survey levelman"],"synonyms":["surveyor","leveller"],"antonyms":[]},{"part_of_speech":"noun","definition":"平等主義者、または社会の階級を廃止しようとする人","english_definition":"An advocate of social equality, or someone who seeks to abolish social distinctions.","examples":[{"sentence":"The levelman believed that everyone should have equal opportunities regardless of their background.","translation":"その平等主義者は、誰もがその出自に関係なく平等な機会を持つべきだと信じていました。"},{"sentence":"He was a strong levelman, arguing for the redistribution of wealth.","translation":"彼は強力な平等主義者であり、富の再分配を主張していました。"}],"collocations":["social levelman","political levelman"],"synonyms":["egalitarian","equalitarian"],"antonyms":["elitist","hierarchist"]}],"etymology":{"value":"The word 'levelman' is derived from 'level' (meaning horizontal or equal) and 'man' (referring to a person).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɛvəlˌmæn/","syllables":"lev-el-man"},"inflection":{"noun_plural":"levelmen"},"usage_notes":{"explanation":"The term 'levelman' can refer to someone who works with levels in construction or surveying, or to someone who advocates for social equality. The context usually makes it clear which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a level man.","correct":"✓ He is a levelman.","note":"Using 'level man' as two separate words changes the meaning. 'Levelman' is a specific term."}],"priority":"★☆☆"},"related_words":{"derivatives":["level","leveling","leveller"],"phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Levelman' is a relatively uncommon word with two main meanings. It can refer to a worker who uses leveling tools in construction or surveying, or to someone who promotes social equality. The context will usually indicate which meaning is intended. It's important to distinguish it from the more common word 'leveller', which often refers to someone who advocates for social equality."},"example_sentences":[{"sentence":"The levelman carefully adjusted the instrument to ensure an accurate reading.","translation":"水平出し作業員は、正確な測定値を確保するために、慎重に機器を調整しました。","type":"noun","meaning_category":"水平器を使用する人"},{"sentence":"As a levelman, she fought for equal rights for all citizens.","translation":"平等主義者として、彼女はすべての市民の平等な権利のために戦いました。","type":"noun","meaning_category":"平等主義者"}]}