{"word":"black-mouth","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(俗語)口の悪い人、悪口ばかり言う人","english_definition":"(slang) A person who habitually uses foul or abusive language; someone who is prone to making rude or offensive remarks.","examples":[{"sentence":"Don't pay any attention to him; he's just a black-mouth.","translation":"彼の言うことを気にしないで。彼はただの口の悪いやつだから。"},{"sentence":"She's got a real black-mouth; you never know what she's going to say.","translation":"彼女は本当に口が悪くて、何が出てくるかわからない。"}],"collocations":["have a black-mouth","be a black-mouth","call someone a black-mouth"],"synonyms":["foul-mouth","potty-mouth","swearer","abuser","slanderer","backbiter","mudslinger"],"antonyms":["diplomat","peacemaker","comforter"]},{"part_of_speech":"adjective","definition":"(俗語)口の悪い、悪口ばかり言う","english_definition":"(slang) Characterized by the use of foul or abusive language.","examples":[{"sentence":"He's known for his black-mouth comments.","translation":"彼は口の悪いコメントで知られている。"},{"sentence":"I can't stand her black-mouth attitude.","translation":"彼女の口の悪い態度には我慢できない。"}],"collocations":["black-mouth comments","black-mouth attitude","black-mouth language"],"synonyms":["foul-mouthed","potty-mouthed","abusive","offensive","rude","vulgar"],"antonyms":["polite","respectful","courteous"]}],"etymology":{"value":"The term likely originates from the association of 'black' with negativity and 'mouth' with speech. The implication is that the person's speech is tainted or corrupted, similar to the idea of a 'black heart'. The specific origin is somewhat obscure, but it's a relatively recent colloquialism.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈblækˌmaʊθ/","syllables":"black-mouth"},"inflection":{"notes":"The noun is countable. The adjective does not inflect."},"usage_notes":{"explanation":"'Black-mouth' is a derogatory term used to describe someone who frequently uses offensive, rude, or abusive language. It can be used as both a noun and an adjective. As a noun, it refers to the person themselves. As an adjective, it describes their speech, attitude, or language. The term implies that the person's words are harmful or unpleasant.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a black mouth face.","correct":"✓ He has a black-mouth. / ✓ He has a foul mouth.","note":"'Black-mouth' refers to the person's speech habits, not their physical appearance. Use 'black-mouth' alone or replace it with a similar term like 'foul mouth'."},{"incorrect":"✗ Her black-mouth was very hurtful.","correct":"✓ Her black-mouth comments were very hurtful. / ✓ Her abusive language was very hurtful.","note":"'Black-mouth' itself doesn't cause hurt; it's the comments or language that are hurtful. Specify what was said or use a more general term like 'abusive language'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["foul-mouthed","potty-mouthed","swearer","abusive","offensive","rude","vulgar","slanderer","backbiter","mudslinger"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - This is a relatively uncommon slang term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Black-mouth' is a slang term used to describe someone who frequently uses offensive or abusive language. It's a derogatory term, implying that the person's words are harmful or unpleasant. It can be used as both a noun (referring to the person) and an adjective (describing their speech or attitude). Because it's slang and somewhat informal, it's more common in spoken language than in formal writing. Understanding the negative connotation is key to using and interpreting the term correctly."},"example_sentences":[{"sentence":"The politician was criticized for his black-mouth remarks during the debate.","translation":"その政治家は討論会での口の悪い発言を批判された。","type":"adjective","meaning_category":"口の悪い"},{"sentence":"Nobody likes to be around him because he's such a black-mouth.","translation":"彼があまりにも口が悪いので、誰も彼の周りにいたがらない。","type":"noun","meaning_category":"口の悪い人"}]}