{"word":"Aerobranchia","meanings":[{"part_of_speech":"noun","definition":"A former taxonomic group of pulmonate gastropods (air-breathing snails and slugs) that have a lung rather than a gill.","english_definition":"An obsolete taxonomic group containing air-breathing snails and slugs that possess a lung instead of a gill.","examples":[{"sentence":"The Aerobranchia were once considered a distinct suborder of pulmonates.","translation":"かつて、有肺類（ゆうはいるい）の亜目として、エアロブランチア（有気肺類）が分類されていました。"},{"sentence":"The classification of Aerobranchia is no longer used in modern taxonomy.","translation":"エアロブランチア（有気肺類）の分類は、現代の分類学ではもはや使用されていません。"}],"synonyms":["Pulmonata (more modern term)"],"antonyms":[],"notes":"This term is outdated and no longer used in modern taxonomy. The group is now included within the Pulmonata. It is of historical interest only.","scientific_classification":{"kingdom":"Animalia","phylum":"Mollusca","class":"Gastropoda","subclass":"Heterobranchia","order":"Pulmonata"},"related_terms":["pulmonate","Gastropoda","Mollusca"]}],"etymology":{"value":"Derived from the Greek words 'aero-' (air) and 'branchia' (gills), reflecting the presence of a lung instead of gills.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛəroʊˈbræŋkiə/","syllables":"Ae-ro-bran-chi-a"},"inflection":{"notes":"Plural form: Aerobranchiae"},"usage_notes":{"explanation":"The term Aerobranchia is obsolete and should not be used in modern taxonomic discussions. Use Pulmonata instead.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"★★★"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low. The term is obsolete.","priority":"★★★"},"readability_explanation":{"level":"C2","text":"This term is highly specialized and related to obsolete biological classification. It is only relevant to those studying the history of taxonomy or older scientific literature. It is not part of the current scientific vocabulary.","note":"This term is outdated and no longer used in modern taxonomy. It is of historical interest only."},"example_sentences":[{"sentence":"Older texts may refer to certain land snails as members of the Aerobranchia.","translation":"古い文献では、特定の陸生巻貝がエアロブランチア（有気肺類）のメンバーとして言及されている場合があります。","type":"general","meaning_category":"historical classification"}]}