{"word":"lactodependent","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"Dependent on milk for nutrition or survival.","english_definition":"Relying on milk as the primary source of nourishment or sustenance.","examples":[{"sentence":"The newborn calf is lactodependent for the first few months of its life.","translation":"生まれたばかりの子牛は、生後数ヶ月間は乳に依存しています。"},{"sentence":"Many mammals are lactodependent during their infancy.","translation":"多くの哺乳類は、乳児期に乳に依存しています。"}],"collocations":["lactodependent infant","lactodependent mammal","highly lactodependent"],"synonyms":["milk-dependent","milk-fed","nursing"],"antonyms":["weaned","independent","self-sufficient"]}],"etymology":{"value":"Formed from 'lacto-' (combining form relating to milk) and 'dependent' (relying on someone or something for support).","priority":"Medium"},"pronunciation":{"ipa":"/ˌlæktoʊdɪˈpɛndənt/","syllables":"lac-to-de-pen-dent"},"inflection":{"notes":"Adjective; no specific inflectional forms."},"usage_notes":{"explanation":"The term 'lactodependent' is primarily used in biological or zoological contexts to describe young animals or infants that rely on milk for their nutritional needs. It highlights the critical role of milk in their early development and survival.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"The plant is lactodependent.","correct":"The plant requires specific nutrients.","note":"'Lactodependent' specifically refers to dependence on milk, so it's not applicable to plants or other organisms that don't consume milk."}],"priority":"Low"},"related_words":{"derivatives":["lactodependency (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Lactodependent' is a specialized term primarily used in scientific or technical contexts, specifically related to biology and zoology. It describes the state of being reliant on milk for nutrition, particularly in infant mammals. Due to its specific usage, it is not commonly encountered in general language. Understanding the prefixes and suffixes ('lacto-' meaning milk, and '-dependent' meaning reliant on) aids in deciphering its meaning."},"example_sentences":[{"sentence":"The survival of the orphaned cub depended on finding a substitute mother to provide lactodependent care.","translation":"親を亡くした子グマの生存は、乳に依存した世話をしてくれる代理の母親を見つけることができるかどうかにかかっていました。","type":"adjective","meaning_category":"Nutrition"},{"sentence":"Lactodependent offspring receive essential antibodies from their mother's milk, boosting their immune system.","translation":"乳に依存している子供は、母親の乳から不可欠な抗体を受け取り、免疫システムを高めます。","type":"adjective","meaning_category":"Biology"}]}