{"word":"engagement-related","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"婚約に関連する、または関与に関連する","english_definition":"Relating to or concerning engagement, either in the context of a formal agreement to be married or involvement/participation in something.","examples":[{"sentence":"The company hosted an engagement-related event to celebrate the upcoming wedding of two employees.","translation":"会社は、従業員二人の結婚を祝うために婚約関連のイベントを開催した。"},{"sentence":"The report analyzes engagement-related metrics to determine the effectiveness of the marketing campaign.","translation":"その報告書は、マーケティングキャンペーンの効果を判断するために、エンゲージメント関連の指標を分析する。"},{"sentence":"We need to address several engagement-related issues before the project can move forward.","translation":"プロジェクトを進める前に、いくつかの関与に関連する問題に対処する必要がある。"}],"collocations":["engagement-related expenses","engagement-related activities","engagement-related metrics","engagement-related strategies","engagement-related events"],"synonyms":["marriage-related","commitment-related","involvement-related","participation-related"],"antonyms":["disengagement-related","non-engagement-related"]}],"etymology":{"value":"The word is formed by combining \"engagement\" (referring to either a formal agreement to marry or involvement/participation) with \"related\" (meaning connected or associated).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ɪnˈɡeɪdʒmənt rɪˈleɪtɪd/","syllables":"in-gage-ment ri-la-ted"},"inflection":{"notes":"This is an adjective, so it does not inflect for number or tense."},"usage_notes":{"explanation":"The term \"engagement-related\" is used to describe things that are connected or associated with either the state of being engaged to be married or the act of being involved or participating in something. The specific meaning depends on the context in which it is used.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The engagement related party was a success.","correct":"✓ The engagement-related party was a success.","note":"Hyphenation is important to correctly link \"engagement\" and \"related\" as a single adjective modifying \"party\"."},{"incorrect":"✗ The engagement relating issues were discussed.","correct":"✓ The engagement-related issues were discussed.","note":"Using \"related\" is more concise and grammatically correct than \"relating\" in this context."}],"priority":"☆☆☆"},"related_words":{"derivatives":["engagement","related"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"\"Engagement-related\" is a compound adjective used in formal or professional contexts to describe something associated with engagement, either in the sense of being betrothed or involved in a project or activity. It is not a common word in everyday conversation."},"example_sentences":[{"sentence":"The company provided engagement-related training to its employees.","translation":"会社は従業員にエンゲージメント関連のトレーニングを提供した。","type":"general","meaning_category":"involvement/participation"},{"sentence":"They are planning several engagement-related activities for their wedding.","translation":"彼らは結婚式のためにいくつかの婚約関連の活動を計画している。","type":"general","meaning_category":"formal agreement to be married"},{"sentence":"The success of the campaign is tied to several engagement-related factors.","translation":"キャンペーンの成功は、いくつかのエンゲージメント関連の要因に関連している。","type":"general","meaning_category":"involvement/participation"}]}