{"word":"Egyptianise","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"エジプト風にする、エジプト化する","english_definition":"To make something Egyptian in character or style.","examples":[{"sentence":"The architect decided to Egyptianise the facade of the building.","translation":"建築家は建物のファサードをエジプト風にすることに決めた。"},{"sentence":"Many artists in the early 20th century sought to Egyptianise their work, drawing inspiration from ancient motifs.","translation":"20世紀初頭の多くの芸術家は、古代のモチーフからインスピレーションを得て、作品をエジプト化しようと試みた。"}],"collocations":["Egyptianise a building (建物をエジプト風にする)","Egyptianise art (芸術をエジプト風にする)","Egyptianise a design (デザインをエジプト風にする)"],"synonyms":["Aegyptianize"],"antonyms":["de-Egyptianise"]}],"etymology":{"value":"'Egyptian' + '-ise'.  From the adjective 'Egyptian' referring to Egypt, and the suffix '-ise' meaning 'to make'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈdʒɪpʃənaɪz/","syllables":"E-gyp-tian-ise"},"inflection":{"verb_forms":{"present_simple":["Egyptianise","Egyptianises"],"past_simple":"Egyptianised","past_participle":"Egyptianised","present_participle":"Egyptianising"}},"usage_notes":{"explanation":"'Egyptianise' is a relatively rare verb meaning to make something resemble or become like something from ancient Egypt. It can refer to architectural styles, artistic motifs, or even cultural practices. The alternative spelling 'Aegyptianize' is also seen.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The city was Egyptianised by the Romans.","correct":"✓ The city was Romanised by the Romans.","note":"Ensure the correct culture is being referenced. Romans Romanise, Egyptians Egyptianise."}],"priority":"★☆☆"},"related_words":{"derivatives":["Egyptian (adjective, noun)","Egyptianism (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Egyptianise' is a specialized term used to describe the act of making something resemble or take on the characteristics of ancient Egyptian culture, art, or architecture. It is not a commonly used word and would typically appear in contexts related to art history, archaeology, or architecture. Understanding the word requires familiarity with the cultural and historical context of ancient Egypt."},"example_sentences":[{"sentence":"The museum's new exhibit will Egyptianise the gallery space with hieroglyphics and artifacts.","translation":"美術館の新しい展示会では、象形文字や工芸品でギャラリースペースをエジプト風にする予定です。","type":"verb","meaning_category":"エジプト風にする"},{"sentence":"The fashion designer sought to Egyptianise her clothing line by incorporating elements of ancient Egyptian dress.","translation":"そのファッションデザイナーは、古代エジプトの衣装の要素を取り入れることで、自身の服のラインをエジプト風にしようとした。","type":"verb","meaning_category":"エジプト風にする"}]}