{"word":"Helvellaceae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"チャワンタケ科","english_definition":"a family of ascomycete fungi in the order Pezizales, characterized by stipitate or sessile apothecia with convoluted or ridged hymenia","examples":[{"sentence":"Helvellaceae includes genera such as Helvella, Gyromitra, and Discina.","translation":"チャワンタケ科には、アミガサタケ属、ヒロシメジ属、およびジャガイモタケ属などの属が含まれます。"}],"collocations":["Helvellaceae family","Helvellaceae species","Helvellaceae fungi"],"synonyms":["cup fungi","pezizales"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name 'Helvella' + '-aceae' (standard suffix for families in biological nomenclature). 'Helvella' is possibly derived from the Latin 'helvus' meaning yellowish or light brown, referring to the color of some species.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɛlvɛləˈseɪsiː/","syllables":"Hel-vel-la-ce-ae"},"inflection":{"noun_plural":"Helvellaceae (used as a collective plural)"},"usage_notes":{"explanation":"Helvellaceae is a family within the order Pezizales, which are commonly known as cup fungi. This family is characterized by its members having apothecia (cup-shaped or saddle-shaped fruiting bodies) that are either stalked (stipitate) or directly attached (sessile). The hymenium (fertile surface) is often convoluted or ridged, rather than smooth.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Helvellaceae is a genus.","correct":"✓ Helvellaceae is a family.","note":"Helvellaceae is a family of fungi, not a genus. Genera within the family include Helvella, Gyromitra, and others."}],"priority":"★☆☆"},"related_words":{"derivatives":["Helvella (genus)","Gyromitra (genus)","Discina (genus)"],"phrases":["Pezizales (order)","Ascomycete (phylum)","Apothecium (fruiting body)","Hymenium (fertile layer)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized scientific term)","frequency_google_ngram":"Low frequency (scientific literature)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Helvellaceae' is a technical term used in mycology (the study of fungi). It refers to a specific family of fungi within the order Pezizales, known for their cup-shaped or saddle-shaped fruiting bodies. Understanding this term requires familiarity with biological classification and fungal morphology."},"example_sentences":[{"sentence":"The identification of fungi within the Helvellaceae family often requires microscopic examination of spore structures.","translation":"チャワンタケ科の菌類を同定するには、多くの場合、胞子の構造を顕微鏡で検査する必要があります。","type":"scientific context","meaning_category":"fungal classification"},{"sentence":"Some species of Helvellaceae are edible, while others are toxic, so careful identification is crucial.","translation":"チャワンタケ科の一部の種は食用ですが、有毒な種もあるため、注意深い識別が重要です。","type":"general interest","meaning_category":"fungal edibility"}]}