{"word":"Andersonville","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"アンダーソンビル：アメリカ南北戦争中に存在した、連合国（南部連合）の捕虜収容所の場所、およびその収容所自体の名称。正式名称はキャンプ・サンプター (Camp Sumter)。ジョージア州アンダーソンビルに位置し、劣悪な環境と高い死亡率で知られる。","english_definition":"A Confederate prisoner-of-war camp during the American Civil War, located near Andersonville, Georgia. Officially named Camp Sumter, it was notorious for its overcrowded conditions and high death rate.","examples":[{"sentence":"Andersonville was one of the deadliest prisoner-of-war camps in American history.","translation":"アンダーソンビルは、アメリカの歴史の中で最も死亡率の高い捕虜収容所のひとつだった。"},{"sentence":"The conditions at Andersonville were appalling, with thousands of Union soldiers dying from disease and starvation.","translation":"アンダーソンビルの状況はひどく、何千人もの合衆国軍兵士が病気と飢餓で死亡した。"},{"sentence":"The commander of Andersonville, Henry Wirz, was later executed for war crimes.","translation":"アンダーソンビルの司令官、ヘンリー・ワーズは、後に戦争犯罪で処刑された。"}],"collocations":["Andersonville National Cemetery (アンダーソンビル国立墓地)","Andersonville Historic Site (アンダーソンビル史跡)","Camp Sumter (キャンプ・サンプター)","prisoner-of-war camp (捕虜収容所)","American Civil War (アメリカ南北戦争)"],"synonyms":["Camp Sumter"],"antonyms":[]}],"etymology":{"value":"地名に由来。アンダーソンビルは、ジョージア州メイコン郡の郡庁所在地であるアンダーソンビルという町の名前から来ている。この町は、セントラル・オブ・ジョージア鉄道の社長であったウィリアム・アンダーソンにちなんで名付けられた。","priority":"★★★"},"pronunciation":{"ipa":"/ˈændərsənˌvɪl/","syllables":"An-der-son-ville"},"inflection":{"notes":"名詞なので、複数形はありません。"},"usage_notes":{"explanation":"「**Andersonville**」は、アメリカ南北戦争の歴史において非常に重要な場所であり、悲劇的な出来事を象徴する言葉です。主に、ジョージア州にあった連合国の捕虜収容所を指し、その劣悪な環境と高い死亡率で知られています。歴史的な文脈で使用されることがほとんどで、現代の日常会話で使われることは稀です。関連語句として「Camp Sumter (キャンプ・サンプター)」という正式名称も覚えておくと良いでしょう。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Andersonville was a prison for Confederate soldiers.","correct":"✓ Andersonville was a prison for Union soldiers.","note":"アンダーソンビルは、連合国（南部連合）が運営していた、合衆国（北部連合）兵士のための捕虜収容所でした。"},{"incorrect":"✗ Andersonville is a city in Georgia.","correct":"✓ Andersonville is the location of a former prisoner-of-war camp in Georgia.","note":"アンダーソンビルは、かつて捕虜収容所があった場所であり、現在は史跡となっています。都市そのものではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":["Andersonville National Historic Site (アンダーソンビル国立史跡)","Andersonville National Cemetery (アンダーソンビル国立墓地)"],"phrases":["prisoner of war (POW) (捕虜)","Civil War (南北戦争)","Confederate States of America (アメリカ連合国)","Union Army (合衆国軍)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (歴史的固有名詞)","frequency_google_ngram":"低頻度 (Low frequency) - 歴史、特にアメリカ南北戦争に関する文脈でのみ使われる。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Andersonville**」はアメリカ南北戦争の歴史に特有の固有名詞であり、一般的には馴染みのない単語です。この単語は、ジョージア州に存在した悪名高い連合国の捕虜収容所を指し、合衆国軍の捕虜が劣悪な環境下で多数死亡した場所として知られています。この単語を理解するには、アメリカ南北戦争の歴史的背景と、捕虜収容所の悲惨な状況に関する知識が必要です。歴史的な文脈以外ではほとんど使用されません。"},"example_sentences":[{"sentence":"The story of Andersonville is a stark reminder of the brutality of war.","translation":"アンダーソンビルの物語は、戦争の残虐さを強く思い出させる。","type":"noun","meaning_category":"場所・収容所"},{"sentence":"Many books and documentaries have been made about the horrors of Andersonville.","translation":"アンダーソンビルの恐怖については、多くの書籍やドキュメンタリーが制作されている。","type":"noun","meaning_category":"場所・収容所"},{"sentence":"Visitors can tour the Andersonville National Historic Site to learn about the experiences of the prisoners held there.","translation":"訪問者はアンダーソンビル国立史跡を見学し、そこに収容されていた捕虜たちの経験について学ぶことができる。","type":"noun","meaning_category":"場所・史跡"}]}