{"word":"Metallism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"金属主義：貨幣の価値を、その貨幣を構成する金属の価値に基礎づける貨幣理論。","english_definition":"The monetary theory that the value of money is based on the value of the metal composing it.","examples":[{"sentence":"Metallism was a dominant monetary theory for centuries.","translation":"金属主義は何世紀にもわたって支配的な貨幣理論でした。"},{"sentence":"Under metallism, the value of a coin was directly tied to the market price of the metal it contained.","translation":"金属主義の下では、硬貨の価値は、その硬貨に含まれる金属の市場価格に直接結びついていました。"}],"collocations":["gold metallism","silver metallism","bimetallism (related concept)"],"synonyms":["metallic currency standard"],"antonyms":["chartalism","fiat money"],"notes":"Metallism is often contrasted with chartalism, which argues that money's value comes from government decree."}],"etymology":{"value":"From 'metal' + '-ism'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈmɛtəlɪzəm/","syllables":"met-al-lism"},"inflection":{"noun_plural":"metallisms"},"usage_notes":{"explanation":"Metallism is a historical monetary theory, less relevant in modern economies where fiat money systems prevail. It's important in understanding the history of economic thought.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Metallism is when the government prints money without any backing.","correct":"✓ Metallism is when the value of money is based on the metal it contains.","note":"Metallism is not about printing money; it's about the intrinsic value of the metal in the currency."}],"priority":"★★☆"},"related_words":{"derivatives":["metallist (noun)"],"related_terms":["bimetallism","monometallism","gold standard","silver standard"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Metallism' is a specialized term in economics, specifically related to monetary theory. It's not commonly used outside of academic or historical contexts. Understanding it requires some familiarity with economic principles."},"example_sentences":[{"sentence":"The debate between metallism and chartalism continues to influence modern monetary policy discussions.","translation":"金属主義と貨幣主義の間の議論は、現代の金融政策の議論に影響を与え続けています。","type":"general"},{"sentence":"Historically, metallism provided a stable, albeit inflexible, monetary system.","translation":"歴史的に、金属主義は安定していましたが、柔軟性のない金融システムを提供しました。","type":"historical"}]}