{"word":"phacotherapy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"白内障手術の一種である水晶体超音波乳化吸引術","english_definition":"A type of cataract surgery in which the eye's internal lens is emulsified with an ultrasonic handpiece and aspirated from the eye. The aspirated fluids are replaced with irrigation of balanced salt solution to maintain the anterior chamber.","examples":[{"sentence":"Phacotherapy is a common procedure for treating cataracts.","translation":"水晶体超音波乳化吸引術は、白内障の治療によく用いられる手術法です。"}],"collocations":["phacoemulsification","cataract surgery","IOL implantation"],"synonyms":["phacoemulsification","cataract extraction"],"antonyms":[]}],"etymology":{"value":"The term \"phacotherapy\" is derived from \"phaco-\" (referring to the lens of the eye) and \"-therapy\" (referring to treatment).","priority":"★★★"},"pronunciation":{"ipa":"/ˌfækoʊˈθɛrəpi/","syllables":"pha-co-ther-a-py"},"inflection":{"noun_plural":"phacotherapies"},"usage_notes":{"explanation":"Phacotherapy, more commonly known as phacoemulsification, is a modern cataract surgery technique. It involves using ultrasound to break up the clouded lens, which is then removed by suction. An artificial lens (IOL) is usually implanted to restore vision.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Phacotherapy is a type of medication.","correct":"✓ Phacotherapy is a type of surgery.","note":"Phacotherapy is a surgical procedure, not a medication."}],"priority":"★★☆"},"related_words":{"derivatives":["phacoemulsification","IOL","cataract"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Phacotherapy, also known as phacoemulsification, is a surgical procedure used to treat cataracts. It involves using ultrasound to break up the clouded lens of the eye, which is then removed and replaced with an artificial lens. This procedure is typically performed by an ophthalmologist and is considered a standard treatment for cataracts."},"example_sentences":[{"sentence":"The patient underwent phacotherapy to remove the cataract.","translation":"患者は白内障を除去するために水晶体超音波乳化吸引術を受けた。","type":"noun","meaning_category":"surgical procedure"},{"sentence":"Phacotherapy allows for smaller incisions and faster recovery times compared to traditional cataract surgery.","translation":"水晶体超音波乳化吸引術は、従来の白内障手術に比べて切開が小さく、回復が早い。","type":"noun","meaning_category":"surgical procedure"}]}