{"word":"dorsilateral","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"背外側の、背側外方の","english_definition":"Relating to the dorsal and lateral parts of a structure; situated on the back and side.","examples":[{"sentence":"The dorsilateral prefrontal cortex is involved in higher cognitive functions.","translation":"背外側前頭前皮質は高次認知機能に関与している。"},{"sentence":"The dorsilateral surface of the leaf is exposed to sunlight.","translation":"葉の背外側面は日光にさらされている。"}],"collocations":[],"synonyms":["posterolateral","dorsolateral"],"antonyms":["ventromedial","anterolateral"]}],"etymology":{"value":"From 'dorsal' (relating to the back) + 'lateral' (relating to the side).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɔːrsiˈlætərəl/","syllables":"dor-si-lat-er-al"},"inflection":{},"usage_notes":{"explanation":"'Dorsilateral' is a descriptive term used primarily in anatomy and biology to indicate a location that is both on the back (dorsal) and the side (lateral) of a structure. It's often used in describing the position of muscles, nerves, or regions of the brain.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ventrolateral area is the same as the dorsilateral area.","correct":"✓ The ventrolateral area is opposite the dorsilateral area.","note":"'Ventrolateral' refers to the front and side, while 'dorsilateral' refers to the back and side. They are not the same."}],"priority":"★★☆"},"related_words":{"derivatives":["dorsal","lateral"],"related_terms":["dorsolateral prefrontal cortex (DLPFC)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in scientific and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'dorsilateral' is a technical adjective used in scientific and medical contexts, particularly in anatomy and neuroscience. It describes a location that is both dorsal (towards the back) and lateral (towards the side) of a structure. Understanding this term requires familiarity with anatomical directional terminology."},"example_sentences":[{"sentence":"The researchers examined the effects of the drug on the dorsilateral striatum.","translation":"研究者らは、その薬物が背外側線条体に及ぼす影響を調べた。","type":"scientific","meaning_category":"anatomy"},{"sentence":"Damage to the dorsilateral prefrontal cortex can impair working memory.","translation":"背外側前頭前皮質の損傷は、ワーキングメモリを損なう可能性がある。","type":"medical","meaning_category":"neurology"}]}