{"word":"bacchanalize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(他動詞) 大酒宴を催す、どんちゃん騒ぎをする、バッカス祭のように騒ぐ","english_definition":"To celebrate or indulge in a wild, drunken revelry; to behave like participants in a Bacchanalia.","examples":[{"sentence":"They bacchanalized all night after the victory.","translation":"彼らは勝利の後、一晩中どんちゃん騒ぎをした。"},{"sentence":"The fraternity bacchanalized after winning the championship.","translation":"そのフラタニティは選手権で優勝した後、バッカス祭のように騒いだ。"}],"collocations":["bacchanalize all night","bacchanalize after a victory"],"synonyms":["revel","carouse","debauch","party","celebrate wildly"],"antonyms":["abstain","soberize"]},{"part_of_speech":"verb","transitivity":"vt","definition":"(他動詞) (人を) バッカス祭のように興奮させる、熱狂させる","english_definition":"To excite or intoxicate someone to a state of frenzy or wild enthusiasm, as if participating in a Bacchanalia.","examples":[{"sentence":"The music bacchanalized the crowd.","translation":"その音楽は群衆をバッカス祭のように熱狂させた。"},{"sentence":"The speaker's passionate words bacchanalized the audience.","translation":"演説者の情熱的な言葉は聴衆を熱狂させた。"}],"collocations":["bacchanalize the crowd","bacchanalize the audience"],"synonyms":["excite","intoxicate","frenzy","enthuse","inflame"],"antonyms":["calm","soothe","pacify"]}],"etymology":{"value":"From 'Bacchanalia', the Roman festivals of Bacchus (the god of wine), plus the suffix '-ize' (to make or become).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbækəˈneɪlaɪz/","syllables":"bac-cha-na-lize"},"inflection":{"verb_forms":{"present_simple":["bacchanalize","bacchanalizes"],"past_simple":"bacchanalized","past_participle":"bacchanalized","present_participle":"bacchanalizing"}},"usage_notes":{"explanation":"'Bacchanalize' is a relatively rare verb that describes engaging in or causing wild, drunken revelry reminiscent of the ancient Roman Bacchanalia. It can refer to the act of participating in such a celebration or the act of causing someone to become wildly excited or enthusiastic.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They bacchanalized with water.","correct":"✓ They bacchanalized with wine.","note":"Bacchanalizing typically involves alcohol, especially wine, due to the association with Bacchus, the god of wine."},{"incorrect":"✗ The quiet music bacchanalized the crowd.","correct":"✓ The loud music bacchanalized the crowd.","note":"Bacchanalizing implies excitement and frenzy, so the stimulus is usually something energetic or stimulating."}],"priority":"★☆☆"},"related_words":{"derivatives":["bacchanal (noun: a drunken reveler; a Bacchanalian festival)","bacchanalia (noun: a Roman festival of Bacchus; a drunken revel)","bacchanalian (adjective: relating to Bacchanalia; wildly drunken)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (very rare, specialized vocabulary)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'bacchanalize' is a sophisticated and rare term. It refers to participating in or causing a wild, drunken celebration similar to the ancient Roman festivals of Bacchus, the god of wine. This word is not commonly used in everyday conversation and is more likely to be found in literature or academic contexts. It implies a high degree of excitement and revelry, often involving alcohol."},"example_sentences":[{"sentence":"The students bacchanalized after their graduation ceremony, celebrating their academic achievements with unrestrained joy.","translation":"学生たちは卒業式の後、学業の成果を抑制のない喜びで祝い、どんちゃん騒ぎをした。","type":"verb","meaning_category":"大酒宴を催す"},{"sentence":"The charismatic leader's speech bacchanalized the crowd, filling them with fervor and a desire for change.","translation":"そのカリスマ的な指導者の演説は群衆を熱狂させ、熱意と変化への欲求で満たした。","type":"verb","meaning_category":"興奮させる"}]}