{"word":"Diedric","priority":"N/A","meanings":[{"part_of_speech":"proper noun","definition":"(Fantasy) A fictional race or group of beings, often associated with demons or gods in fantasy settings.","english_definition":"A fictional race or group of beings, often associated with demons or gods in fantasy settings.","examples":[{"sentence":"In the Elder Scrolls series, the Daedra, sometimes referred to as Diedric beings, are powerful entities from the realms of Oblivion.","translation":"Elder Scrollsシリーズでは、DaedraはDiedricな存在とも呼ばれ、オブリビオンの領域からの強力な存在です。"}],"collocations":["Diedric Prince","Diedric artifact","Diedric quest"],"synonyms":["Daedra"],"antonyms":[]}],"etymology":{"value":"Likely a constructed term for fantasy settings, possibly derived from Germanic or Norse-sounding elements.","priority":"★☆☆"},"pronunciation":{"ipa":"/daɪˈɛdrɪk/","syllables":"Di-ed-ric"},"inflection":{"notes":"Proper nouns do not typically inflect."},"usage_notes":{"explanation":"The term 'Diedric' is primarily used within the context of fantasy universes, particularly video games and literature. It often refers to beings or objects associated with demonic or divine powers within those fictional worlds. Its use is highly specific to these settings.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a diedric in the forest.","correct":"✓ I encountered a Daedra in the forest. / ✓ I read about Diedric Princes in the game's lore.","note":"Use 'Diedric' as an adjective or part of a proper noun (e.g., Diedric Prince), not as a standalone noun."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Daedra","Oblivion","Aedra"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency outside of specific fantasy contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Diedric' is highly specialized and primarily encountered in specific fantasy contexts, such as the Elder Scrolls video game series. Understanding its meaning requires familiarity with the lore of these fictional universes. It is not part of general English vocabulary."},"example_sentences":[{"sentence":"The museum displayed a collection of rare Diedric artifacts. ","translation":"博物館には、珍しいDiedricアーティファクトのコレクションが展示されていました。","type":"adjective","meaning_category":"Fantasy"},{"sentence":"The hero embarked on a quest to defeat the Diedric Prince.","translation":"主人公はDiedricの王子を倒すためのクエストに乗り出しました。","type":"noun phrase","meaning_category":"Fantasy"}]}