{"word":"Pancreaticoduodenostomy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"膵頭十二指腸切除術","english_definition":"A surgical procedure in which the head of the pancreas, the duodenum, the gallbladder, and part of the stomach are removed. It is used to treat tumors and other disorders of the pancreas, duodenum, and bile duct.","examples":[{"sentence":"The patient underwent a pancreaticoduodenostomy to remove the tumor.","translation":"患者は腫瘍を取り除くために膵頭十二指腸切除術を受けた。"}],"collocations":["Whipple procedure","pancreatic cancer","bile duct","duodenum","pancreas"],"synonyms":["Whipple procedure"],"antonyms":[]}],"etymology":{"value":"The term is derived from the combination of 'pancreatico-' (relating to the pancreas), 'duodeno-' (relating to the duodenum), and '-stomy' (surgical formation of an opening).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpæŋkriˌætɪkoʊˌduːoʊdəˈnɒstəmi/","syllables":"pan-cre-a-ti-co-du-o-de-nos-to-my"},"inflection":{"noun_plural":"Pancreaticoduodenostomies"},"usage_notes":{"explanation":"Pancreaticoduodenostomy, commonly known as the Whipple procedure, is a complex surgical operation most often performed to treat cancerous tumors on the head of the pancreas. It involves removing the head of the pancreas, the first part of the small intestine (duodenum), the gallbladder, and the bile duct. Sometimes, part of the stomach is also removed. After removing these structures, the surgeon reconnects the remaining pancreas and digestive organs to allow food to pass through the digestive system.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor performed a pancreaticoduodenostomy on the pancreas.","correct":"✓ The doctor performed a pancreaticoduodenostomy.","note":"The procedure is performed *on* the patient, not specifically on the pancreas (although the pancreas is involved)."},{"incorrect":"✗ Pancreaticoduodenostomy is a simple surgery.","correct":"✓ Pancreaticoduodenostomy is a complex surgery.","note":"It's crucial to understand that pancreaticoduodenostomy is a major and complex surgical procedure."}],"priority":"★★☆"},"related_words":{"derivatives":["pancreas","duodenum","resection","anastomosis","Whipple"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Pancreaticoduodenostomy is a highly technical term used in the medical field to describe a complex surgical procedure. Understanding this term requires advanced knowledge of anatomy, surgical procedures, and medical terminology. It is primarily used by healthcare professionals, surgeons, and medical researchers. Due to its complexity and specificity, it is rarely encountered in general conversation or non-medical contexts."},"example_sentences":[{"sentence":"After a thorough evaluation, the patient was scheduled for a pancreaticoduodenostomy.","translation":"詳細な評価の後、患者は膵頭十二指腸切除術の予定が組まれた。","type":"noun","meaning_category":"Surgical procedure"},{"sentence":"The pancreaticoduodenostomy successfully removed the tumor from the patient's pancreas.","translation":"膵頭十二指腸切除術は、患者の膵臓から腫瘍を摘出することに成功した。","type":"noun","meaning_category":"Surgical procedure outcome"}]}