{"word":"DTI","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"（経済）債務対所得比率","english_definition":"(finance) Debt-to-income ratio: A personal finance measure that compares an individual's total monthly debt payments to their gross monthly income.","examples":[{"sentence":"The bank uses DTI to assess the risk of lending to a borrower.","translation":"銀行はDTIを使って、借り手への融資リスクを評価します。"},{"sentence":"A high DTI may indicate that a person is overleveraged.","translation":"高いDTIは、その人が過剰な借り入れをしている可能性を示唆するかもしれません。"}],"collocations":["calculate DTI","high DTI","low DTI","DTI ratio","DTI limit"],"synonyms":["debt ratio","gearing ratio"],"antonyms":["income-to-debt ratio"]},{"part_of_speech":"noun","definition":"(政府組織) 貿易産業省 (Department of Trade and Industry)","english_definition":"(government organization, historical) Department of Trade and Industry: A former UK government department responsible for trade and industry.","examples":[{"sentence":"The DTI was responsible for promoting British exports.","translation":"DTIは英国の輸出促進を担当していました。"},{"sentence":"The DTI has since been replaced by other departments.","translation":"DTIはその後、他の省庁に取って代わられました。"}],"collocations":["former DTI","DTI policy","DTI regulations"],"synonyms":["(replaced by) BEIS (Department for Business, Energy and Industrial Strategy)"],"antonyms":[]}],"etymology":{"value":"An abbreviation of either 'Debt-To-Income' or 'Department of Trade and Industry', depending on the context.","priority":"★★★"},"pronunciation":{"ipa":"/ˌdiːˌtiːˈaɪ/","syllables":"Dee-Tee-Eye"},"inflection":{"noun_plural":"DTIs"},"usage_notes":{"explanation":"'DTI' has two main meanings depending on the context. In finance, it refers to the 'Debt-To-Income' ratio, a key metric for assessing financial risk. In a historical context, particularly related to the UK, it refers to the 'Department of Trade and Industry', a former government department.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company's DTI is very good, so they will get a loan.","correct":"✓ The company's financials are very good, so they will get a loan.","note":"DTI typically refers to an individual's debt-to-income ratio, not a company's. For companies, other financial metrics are used."},{"incorrect":"✗ I contacted the DTI for information on starting a business in the US.","correct":"✓ I contacted the Department of Commerce for information on starting a business in the US.","note":"The Department of Trade and Industry (DTI) was a UK government department. In the US, the Department of Commerce has similar responsibilities."}],"priority":"★★☆"},"related_words":{"derivatives":[],"acronyms":["BEIS (Department for Business, Energy and Industrial Strategy)","APR (Annual Percentage Rate)","LTV (Loan-to-Value)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1 (for financial context), B2 (for historical context)","frequency_google_ngram":"Moderate frequency, depending on the context.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'DTI' can refer to two different concepts: Debt-to-income ratio or the Department of Trade and Industry. The 'Debt-to-income ratio' is used in finance to assess how much of a person's income goes towards debt payments. A high DTI means a larger portion of income is used to pay off debts. The 'Department of Trade and Industry' was a former UK government department responsible for trade and industry matters. It's important to understand the context to know which meaning is intended."},"example_sentences":[{"sentence":"The lender requires a DTI of no more than 43% for mortgage approval.","translation":"貸し手は、住宅ローンの承認のために、DTIが43％以下であることを要求します。","type":"noun","meaning_category":"Debt-to-income ratio"},{"sentence":"The DTI played a key role in promoting innovation in the UK.","translation":"DTIは、英国におけるイノベーションの促進に重要な役割を果たしました。","type":"noun","meaning_category":"Department of Trade and Industry"}]}