{"word":"battener","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(舞台照明)バトンに吊り下げられた照明器具一式","english_definition":"A set of lighting instruments hung on a batten, especially in a theater.","examples":[{"sentence":"The stage manager adjusted the battener to achieve the desired lighting effect.","translation":"舞台監督は、望ましい照明効果を得るためにバッタナーを調整した。"}],"collocations":["lighting battener","stage battener"],"synonyms":["lighting strip","light bar"],"antonyms":[]},{"part_of_speech":"noun","definition":"(印刷) バタナー: 製本工程で本の背表紙を丸めるための道具","english_definition":"A tool used in bookbinding to round the spine of a book.","examples":[{"sentence":"The bookbinder carefully used the battener to shape the spine.","translation":"製本職人は注意深くバタナーを使って背表紙を成形した。"}],"collocations":["bookbinding battener"],"synonyms":["spine rounding tool"],"antonyms":[]}],"etymology":{"value":"Derived from 'batten,' referring to the bar or strip to which the lights are attached or the tool is made of.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbætənər/","syllables":"bat-ten-er"},"inflection":{"noun_plural":"batteners"},"usage_notes":{"explanation":"The term 'battener' is relatively specific to the fields of theater lighting and bookbinding. In theater, it refers to a set of lights, while in bookbinding, it's a tool. The context usually clarifies the intended meaning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a battener to fix the fence.","correct":"✓ He used a batten to fix the fence.","note":"'Batten' is the correct term for a strip of wood used for construction."}],"priority":"★☆☆"},"related_words":{"derivatives":["batten (noun): a strip of wood or metal used for fastening or support.","batten down (phrasal verb): to secure something tightly, especially in preparation for a storm."],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very specialized vocabulary)","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Battener' is a technical term primarily used in the specialized fields of theater lighting and bookbinding. Understanding its meaning requires familiarity with these contexts. In theater, it refers to a set of lighting instruments on a batten. In bookbinding, it denotes a tool for rounding the spine of a book. Due to its limited usage, it is not a common word in general English conversation."},"example_sentences":[{"sentence":"The lighting designer requested a specific configuration for the battener on stage left.","translation":"照明デザイナーは、舞台左側のバッタナーに特定の構成を要求した。","type":"noun","meaning_category":"theater lighting"},{"sentence":"Using the battener, the artisan carefully shaped the book's spine to ensure a comfortable grip.","translation":"職人はバタナーを使って、本が持ちやすくなるように丁寧に背表紙を成形した。","type":"noun","meaning_category":"bookbinding"}]}