{"word":"subtribual","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"亜部族の、小部族の","english_definition":"Relating to or characteristic of a subtribe.","examples":[{"sentence":"The subtribual divisions within the larger tribe were complex.","translation":"より大きな部族内の亜部族の区分は複雑だった。"},{"sentence":"Subtribual customs varied slightly from region to region.","translation":"亜部族の習慣は地域によってわずかに異なっていた。"}],"collocations":["subtribual affiliation","subtribual identity","subtribual organization"],"synonyms":["tribal","ethnic","clan-related"],"antonyms":["non-tribal","national"]},{"part_of_speech":"noun","definition":"亜部族民","english_definition":"A member of a subtribe.","examples":[{"sentence":"The subtribuals gathered for the annual ceremony.","translation":"亜部族民が年に一度の儀式のために集まった。"}],"collocations":["subtribual leader","subtribual elder"],"synonyms":["tribesman","clansman"],"antonyms":["outsider"]}],"etymology":{"value":"Derived from 'sub-' (meaning 'under' or 'below') and 'tribal' (relating to a tribe).","priority":"★★☆"},"pronunciation":{"ipa":"/sʌbˈtraɪbjuəl/","syllables":"sub-trib-u-al"},"inflection":{"notes":"The adjective form does not inflect. The noun form pluralizes regularly to 'subtribuals'."},"usage_notes":{"explanation":"'Subtribual' is used to describe something that relates to a subtribe, which is a smaller division within a larger tribe. It's often used in anthropological or sociological contexts when discussing the structure and organization of tribal societies. The term highlights the hierarchical or segmented nature of these societies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The subtribual is very important to the tribe.","correct":"✓ The subtribual group is very important to the tribe.","note":"'Subtribual' is an adjective; to refer to the people, use 'subtribual group' or 'subtribuals' as a noun."},{"incorrect":"✗ The subtribal customs are the same as the subtribual.","correct":"✓ The subtribal customs are the same as the subtribe's customs.","note":"Avoid using the adjective 'subtribual' when you mean the subtribe itself."}],"priority":"★★☆"},"related_words":{"derivatives":["subtribe","tribe","tribalism"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'subtribual' is relatively rare and specialized, primarily used in academic or anthropological contexts. It describes something related to a subtribe, which is a smaller group within a larger tribal structure. Understanding the term requires familiarity with concepts of tribal organization and social structures. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The anthropologist studied the subtribual relationships within the indigenous population.","translation":"人類学者は、先住民の亜部族間の関係を研究した。","type":"adjective","meaning_category":"亜部族の"},{"sentence":"The subtribuals maintained their unique cultural practices despite integration into the larger society.","translation":"亜部族民は、より大きな社会への統合にもかかわらず、独自の文化的慣習を維持した。","type":"noun","meaning_category":"亜部族民"}]}