{"word":"notself","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(精神分析) 自己とみなされないもの、自己の外部にあるもの、自己とは異なるもの","english_definition":"(psychoanalysis) something that is not considered part of the self; something external to or different from the self.","examples":[{"sentence":"In object relations theory, the infant gradually differentiates between self and notself.","translation":"対象関係論では、乳児は徐々に自己と非自己を区別する。"},{"sentence":"The 'notself' can include both external objects and internal experiences that are rejected by the ego.","translation":"「非自己」には、外部の対象と、自我によって拒絶される内部経験の両方が含まれる。"}],"collocations":["self and notself (自己と非自己)","differentiate self from notself (自己を非自己から区別する)","recognize notself (非自己を認識する)"],"synonyms":["other","external object","nonself"],"antonyms":["self","ego","internal object"]},{"part_of_speech":"noun","definition":"(哲学) 自己とは異なるもの、自己の意識の外にあるもの","english_definition":"(philosophy) that which is other than the self; that which exists outside of one's own consciousness.","examples":[{"sentence":"The philosopher explored the relationship between the self and the notself in his writings.","translation":"その哲学者は著作の中で、自己と非自己の関係を探求した。"},{"sentence":"The concept of the notself is crucial to understanding the limits of subjective experience.","translation":"非自己の概念は、主観的経験の限界を理解する上で重要である。"}],"collocations":["self versus notself (自己対非自己)","the boundary between self and notself (自己と非自己の境界)"],"synonyms":["external world","objective reality"],"antonyms":["subjective experience","self-awareness"]}],"etymology":{"value":"'not' + 'self'. A term used in psychoanalysis and philosophy to denote anything that is distinct from or external to the self.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnɒtˌsɛlf/","syllables":"not-self"},"inflection":{"notes":"単数形のみで使われることが多い"},"usage_notes":{"explanation":"The term 'notself' is primarily used in psychoanalysis and philosophy to describe anything that is not considered part of one's own self or consciousness. In psychoanalysis, particularly in object relations theory, it refers to the objects and experiences that the infant gradually learns to distinguish from its own self. In philosophy, it denotes the external world or objective reality that exists independently of the self. It is often used in contrast to the concept of 'self' to explore the boundaries of individual identity and experience.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is notself.","correct":"✓ He is not himself.","note":"'notself' is a noun, not an adjective. To describe someone who is not acting like their usual self, use 'not himself/herself' or 'out of character'."},{"incorrect":"✗ The notself is me.","correct":"✓ The notself is everything that is not me.","note":"'notself' refers to everything that is external to or different from the self, not the self itself."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["self","ego","object relations theory","subjective experience","objective reality","consciousness"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in academic and theoretical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Notself' is a specialized term primarily used in psychoanalysis and philosophy. It refers to anything that is considered separate from or external to one's own self or consciousness. Understanding this term requires familiarity with theoretical concepts in these fields, such as object relations theory in psychoanalysis or the distinction between subjective experience and objective reality in philosophy. It is not commonly used in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The infant's ability to distinguish between self and **notself** is a crucial developmental milestone.","translation":"乳児が自己と非自己を区別する能力は、重要な発達上のマイルストーンである。","type":"noun","meaning_category":"psychoanalysis"},{"sentence":"In his philosophical treatise, he explored the relationship between the self and the **notself**.","translation":"彼の哲学的論文の中で、彼は自己と非自己の関係を探求した。","type":"noun","meaning_category":"philosophy"},{"sentence":"The boundary between self and **notself** is not always clear-cut, especially in cases of altered states of consciousness.","translation":"自己と非自己の境界は、特に意識変容状態の場合には、必ずしも明確ではない。","type":"noun","meaning_category":"general concept"}]}