{"word":"xystos","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古代ギリシアの)屋根付きの運動場、または庭園の屋根付きの散歩道","english_definition":"A long, open portico or covered promenade, used by Greek athletes for exercise, especially in winter; also, a garden walk planted with trees.","examples":[{"sentence":"The athletes trained in the xystos during the winter months.","translation":"選手たちは冬の間、屋根付きの運動場でトレーニングをした。"},{"sentence":"The xystos provided a sheltered space for walking and conversation.","translation":"その屋根付きの散歩道は、散歩や会話のための保護された空間を提供した。"}],"collocations":["covered xystos","garden xystos","xystos of the gymnasium"],"synonyms":["portico","colonnade","promenade","covered walk","ambulatory"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek ξυστός (xystós, “scraped, smoothed, polished”), from ξύω (xýō, “I scrape, smooth, polish”).","priority":"★★★"},"pronunciation":{"ipa":"/ˈzɪstɒs/","syllables":"zys-tos"},"inflection":{"noun_plural":"xystoi or xystoses"},"usage_notes":{"explanation":"'Xystos' refers to a specific architectural feature in ancient Greek gymnasia and villas. It is not a commonly used word in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He relaxed in the xystos with a cup of coffee.","correct":"✓ He relaxed in the garden.","note":"'Xystos' specifically refers to an ancient Greek structure, not a generic relaxing space."}],"priority":"★☆☆"},"related_words":{"derivatives":["xyst (shortened form)"],"related_terms":["gymnasium","palaestra","peristyle"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Xystos' is a highly specialized term related to ancient Greek architecture and athletics. It's unlikely to be encountered outside of historical or archaeological contexts. Understanding requires familiarity with classical history and architectural terminology."},"example_sentences":[{"sentence":"The ancient gymnasium included a xystos for winter training.","translation":"古代の体育館には、冬のトレーニングのための屋根付き運動場が含まれていた。","type":"noun","meaning_category":"屋根付きの運動場"},{"sentence":"Archaeologists uncovered the remains of a xystos in the Roman villa.","translation":"考古学者たちは、ローマの別荘で屋根付きの散歩道の遺跡を発掘した。","type":"noun","meaning_category":"屋根付きの散歩道"}]}