{"word":"runeless","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ルーン文字のない、ルーン文字が使われていない","english_definition":"Without runes; not inscribed with runes.","examples":[{"sentence":"The ancient sword was runeless, suggesting it predated the use of runes in that region.","translation":"その古代の剣にはルーン文字が刻まれておらず、その地域でのルーン文字の使用よりも前のものだと示唆している。"},{"sentence":"A runeless stone stood silently in the field.","translation":"ルーン文字のない石が野原に静かに立っていた。"}],"collocations":["runeless sword","runeless stone","runeless artifact"],"synonyms":["uninscribed","unlettered"],"antonyms":["runed","inscribed","lettered"]}],"etymology":{"value":"\"rune\" + \"-less\". \"Rune\" comes from Old Norse \"rún\" meaning secret, mystery, or a runic character. \"-less\" is a suffix meaning without.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈruːnˌlɛs/","syllables":"rune-less"},"inflection":{"notes":"Comparative and superlative forms are not typically used with 'runeless'."},"usage_notes":{"explanation":"'Runeless' is a relatively rare word, primarily used in fantasy literature, historical contexts, or academic discussions related to runic inscriptions. It describes something that lacks runic symbols.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The runeless book was full of spells.","correct":"✓ The book was runeless, but it was full of spells.","note":"'Runeless' describes the absence of runes, not the content of the item. A runeless book could still contain spells written in another script."}],"priority":"★☆☆"},"related_words":{"derivatives":["rune","runic","runestone"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'runeless' is a niche term, primarily encountered in contexts involving mythology, fantasy literature, or historical studies of runic alphabets. Its meaning is straightforward, indicating the absence of runes, but its usage is limited to specific subject areas. Understanding the term requires familiarity with the concept of runes themselves."},"example_sentences":[{"sentence":"The scholars examined the runeless tablet, puzzled by the absence of any inscription.","translation":"学者たちはルーン文字のない石板を調べ、何も刻まれていないことに困惑した。","type":"adjective","meaning_category":"absence of runes"},{"sentence":"The wizard claimed the runeless staff possessed a different kind of magic.","translation":"魔法使いは、ルーン文字のない杖は別の種類の魔法を持っていると主張した。","type":"adjective","meaning_category":"absence of runes"}]}