{"word":"wampee","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ミカン科の果樹、またはその果実。東南アジア原産で、甘酸っぱい味がする。","english_definition":"A citrus fruit tree (Clausena lansium) native to Southeast Asia, or its edible, sweet and sour fruit.","examples":[{"sentence":"The wampee tree is cultivated for its fruit.","translation":"レンブの木はその果実のために栽培されている。"},{"sentence":"Wampee fruits are often eaten fresh or made into preserves.","translation":"レンブの果実はしばしば生で食べられたり、保存食に加工される。"}],"collocations":["wampee fruit","wampee tree","grow wampee","eat wampee"],"synonyms":["Clausena lansium"],"antonyms":[]},{"part_of_speech":"noun","definition":"(俗語) 中国人、または東アジア人に対する差別的な呼び方。","english_definition":"(slang, offensive) A derogatory term for a Chinese person or East Asian person.","examples":[{"sentence":"(歴史的文脈) In the past, the term 'wampee' was used as a racial slur.","translation":"(歴史的文脈) 過去には、「wampee」という言葉は人種差別的な中傷として使われていた。"},{"sentence":"(注意喚起) It is important to avoid using offensive language like 'wampee'.","translation":"(注意喚起) 「wampee」のような侮辱的な言葉の使用は避けることが重要である。"}],"collocations":["racial slur","offensive term","avoid using wampee"],"synonyms":["chink","gook","slant-eye"],"antonyms":[]}],"etymology":{"value":"語源は不明。果物の名前として使われる場合、中国語または東南アジアの言語に由来する可能性がある。差別用語として使われる場合の語源は不明確だが、侮蔑的な意味合いを持つ。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈwɒmpiː/","syllables":"wam-pee"},"inflection":{"noun_plural":"wampees"},"usage_notes":{"explanation":"「**wampee**」は主に東南アジア原産の果物の名前として使われます。しかし、差別的な意味合いを持つ侮辱語としても使われることがあるため、注意が必要です。特に、人種や民族に関する話題では、この言葉の使用を避けるべきです。果物の名前として使う場合でも、相手に誤解を与えないように文脈を考慮する必要があります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a wampee, so he must be good at math.","correct":"✓ He is Chinese, and he is good at math.","note":"人種や民族に基づいてステレオタイプな発言をすることは避けるべきです。'wampee' は侮辱的な言葉として使われることがあるため、使用は避けるべきです。"},{"incorrect":"✗ I bought some wampees at the store, but they were very offensive.","correct":"✓ I bought some wampees at the store, but they didn't taste very good.","note":"'offensive' は侮辱的な意味合いを持つ言葉であり、果物の味を表現するのには不適切です。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"不明","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**wampee**」という単語は、主に東南アジア原産の果物の名前として使われます。しかし、非常に重要な注意点として、この単語は中国人や東アジアの人々に対する侮辱的なスラングとしても使われることがあります。そのため、この単語を使う際には、文脈に細心の注意を払い、相手に不快感を与えないように十分に配慮する必要があります。特に、人種や民族に関する議論においては、この単語の使用を避けることが賢明です。果物の名前として使う場合でも、相手がその意味を知らない可能性があるため、説明を加えるなどの工夫が必要です。"},"example_sentences":[{"sentence":"The farmer harvested a large crop of wampees this year.","translation":"農家は今年、レンブを大量に収穫した。","type":"noun","meaning_category":"果物"},{"sentence":"(注意喚起) The term 'wampee' can be offensive and should be used with caution.","translation":"(注意喚起) 「wampee」という言葉は侮辱的である可能性があり、注意して使用する必要があります。","type":"noun","meaning_category":"侮辱語"}]}