{"word":"Unchurchlike","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"Not characteristic of or befitting a church or religious setting; lacking the qualities typically associated with a church, such as reverence, solemnity, or piety.","english_definition":"Not typical of or appropriate for a church; lacking reverence or piety.","examples":[{"sentence":"The loud music and casual attire at the event made it seem unchurchlike.","translation":"そのイベントでの騒々しい音楽とカジュアルな服装は、教会らしくないと感じさせた。"},{"sentence":"His unchurchlike behavior during the service was frowned upon by the other members.","translation":"彼の礼拝中の教会らしくない振る舞いは、他のメンバーから不快に思われた。"}],"collocations":["unchurchlike behavior","unchurchlike atmosphere","unchurchlike setting","unchurchlike conduct"],"synonyms":["irreligious","secular","worldly","profane","impious","disrespectful","irreverent"],"antonyms":["churchlike","religious","pious","reverent","devout","solemn"],"notes":"This word often implies a deviation from expected norms of behavior or atmosphere within a church or religious context."}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to 'churchlike' (resembling or appropriate for a church).","priority":"Medium"},"pronunciation":{"ipa":"/ʌnˈtʃɜːrtʃˌlaɪk/","syllables":"un-church-like"},"inflection":{"notes":"Adjective, does not inflect for number or gender."},"usage_notes":{"explanation":"'Unchurchlike' is used to describe something that does not fit the traditional image or atmosphere of a church. It often carries a negative connotation, suggesting a lack of respect or appropriateness within a religious setting.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"✗ The party was very unchurch.","correct":"✓ The party was very unchurchlike.","note":"'Unchurchlike' is an adjective and should be used to describe a noun. 'Unchurch' is not a standard word."}],"priority":"Low"},"related_words":{"derivatives":["churchlike","churchly","unchurch"],"related_concepts":["secular","profane","irreligious","irreverent"]},"level_frequency":{"frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"The word 'unchurchlike' is a relatively uncommon word used to describe something that is not typical or appropriate for a church setting. It implies a lack of reverence or piety. Understanding the prefixes 'un-' and the base word 'churchlike' is helpful in understanding its meaning."},"example_sentences":[{"sentence":"The comedian's jokes were considered unchurchlike by some members of the congregation.","translation":"そのコメディアンのジョークは、会衆のメンバーの一部から教会らしくないと見なされた。","type":"general","meaning_category":"general"},{"sentence":"The decorations in the church hall were surprisingly unchurchlike, featuring bright colors and modern art.","translation":"教会ホールの装飾は驚くほど教会らしくなく、明るい色と現代アートが特徴だった。","type":"descriptive","meaning_category":"descriptive"}]}