{"word":"religionistic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"宗教的なことばかりに熱心な、宗教的な形式主義にこだわる","english_definition":"excessively or affectedly religious; characterized by an excessive adherence to religious forms or rituals.","examples":[{"sentence":"His religionistic views alienated many of his friends.","translation":"彼の宗教的なことばかりに熱心な考え方は、多くの友人を遠ざけた。"},{"sentence":"The play criticized the religionistic practices of the time.","translation":"その劇は、当時の宗教的な形式主義を批判した。"}],"collocations":["religionistic fervor","religionistic piety","religionistic zeal"],"synonyms":["fanatical","zealous","dogmatic","bigoted","sanctimonious","pietistic"],"antonyms":["irreligious","secular","nonreligious","liberal","tolerant"]}],"etymology":{"value":"\"religion\" + \"-istic\".","priority":"★★★"},"pronunciation":{"ipa":"/rɪˌlɪdʒənˈɪstɪk/","syllables":"re-li-gion-is-tic"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"The term 'religionistic' carries a negative connotation, suggesting an excessive or superficial focus on religious forms and practices rather than genuine spirituality or ethical behavior. It often implies hypocrisy or a lack of true understanding of religious principles.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a religionistic approach to science.","correct":"✓ He has a dogmatic approach to science.","note":"'Religionistic' is specifically related to religious practices. For other areas, use 'dogmatic' or 'doctrinaire'."}],"priority":"★★☆"},"related_words":{"derivatives":["religionism (名詞: 宗教至上主義、宗教的偏狭さ)"],"related_terms":["religious","religion","pietistic","dogmatic","fanatical"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Religionistic' is a relatively uncommon word used to describe an excessive or affected adherence to religious forms or rituals, often implying a superficial or insincere religiosity. It is typically used in critical or analytical contexts to denote a negative or exaggerated aspect of religious practice."},"example_sentences":[{"sentence":"The author critiqued the religionistic tendencies within the church, arguing for a more authentic expression of faith.","translation":"著者は教会内の宗教的な形式主義の傾向を批判し、より本物の信仰の表現を主張した。","type":"adjective","meaning_category":"形式主義的な宗教"},{"sentence":"His religionistic pronouncements seemed more concerned with outward appearances than with genuine compassion.","translation":"彼の宗教的な発言は、真の思いやりよりも外見的なものに関心があるように思われた。","type":"adjective","meaning_category":"形式主義的な宗教"}]}