{"word":"grubbily","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"不潔に、汚らしく、みすぼらしく","english_definition":"in a dirty, messy, or slovenly manner; in a way that suggests poverty or neglect.","examples":[{"sentence":"The children were dressed grubbily, their clothes stained and torn.","translation":"子供たちは不潔な格好をしていて、服はシミだらけで破れていた。"},{"sentence":"He lived grubbily in a small, run-down apartment.","translation":"彼は小さくて荒れ果てたアパートでみすぼらしく暮らしていた。"},{"sentence":"The walls were grubbily painted a dull shade of gray.","translation":"壁はくすんだ灰色で汚らしく塗られていた。"}],"collocations":["dressed grubbily (不潔な格好をしている)","lived grubbily (みすぼらしく暮らしている)","grubbily painted (汚らしく塗られている)"],"synonyms":["dirtily","slovenly","shabbily","messily","squalidly","filthily"],"antonyms":["cleanly","neatly","smartly","tidily"]}],"etymology":{"value":"\"Grubbily\" comes from the adjective \"grubby,\" which is formed by adding the suffix \"-y\" (meaning \"characterized by or resembling\") to the noun \"grub.\" \"Grub\" originally referred to the larva of an insect, but later came to mean dirt or something dirty. Therefore, \"grubby\" means \"dirty\" or \"covered in dirt,\" and \"grubbily\" is the adverbial form, meaning \"in a dirty manner.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡrʌbɪli/","syllables":"grub-bi-ly"},"inflection":{"notes":"This is an adverb, so it does not have different forms for tense or number."},"usage_notes":{"explanation":"\"Grubbily\" describes an action or state that is characterized by dirtiness, messiness, or a lack of cleanliness. It often implies a state of neglect or poverty, suggesting that something or someone is not well cared for. The word can be used to describe the appearance of a person, a place, or an object.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The house was grubbily, but comfortable.","correct":"The house was grubby, but comfortable.","note":"\"Grubbily\" is an adverb used to describe how something is done. \"Grubby\" is an adjective used to describe the state of something. In this case, the house is being described, so the adjective \"grubby\" should be used."},{"incorrect":"He grubbily ate his dinner with clean hands.","correct":"He greedily ate his dinner with clean hands.","note":"\"Grubbily\" implies dirtiness or messiness. If someone is eating with clean hands, \"greedily\" (meaning eagerly or voraciously) might be a more appropriate word."}],"priority":"★★☆"},"related_words":{"derivatives":["grub (noun: larva of an insect; dirt)","grubby (adjective: dirty, messy, slovenly)","grubbiness (noun: the state of being grubby)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Grubbily' is an adverb that describes something done in a dirty or messy way. It's not a common word, so it's more likely to be found in advanced texts. It suggests a state of being unkempt or neglected. For example, 'The child played grubbily in the mud' means the child was playing in the mud in a dirty, messy way."},"example_sentences":[{"sentence":"He wiped his hands grubbily on his trousers.","translation":"彼はズボンに手を汚らしく拭いた。","type":"adverb","meaning_category":"不潔に"},{"sentence":"The old book was grubbily handled, its pages stained with fingerprints.","translation":"その古い本は汚らしく扱われ、ページには指紋の跡がついていた。","type":"adverb","meaning_category":"みすぼらしく"},{"sentence":"The children, tired and hungry, ate their sandwiches grubbily.","translation":"疲れてお腹を空かせた子供たちは、サンドイッチを汚らしく食べた。","type":"adverb","meaning_category":"不潔に"}]}