{"word":"anagogic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"神秘的解釈の、天国的な意味を持つ、霊的な意味を持つ","english_definition":"relating to or of the nature of anagoge; mystical or spiritual interpretation.","examples":[{"sentence":"The anagogic sense of the poem refers to the soul's union with God.","translation":"その詩のアナゴジー的意味は、魂と神との合一を指している。"},{"sentence":"Medieval theologians often interpreted scripture on four levels: literal, allegorical, moral, and anagogic.","translation":"中世の神学者は、聖書を文字通り、寓意的、道徳的、そしてアナゴジー的という4つのレベルで解釈することが多かった。"}],"collocations":["anagogic interpretation","anagogic sense","anagogic meaning"],"synonyms":["mystical","spiritual","allegorical","symbolic"],"antonyms":["literal","physical","worldly"]}],"etymology":{"value":"Late Middle English: from late Latin anagogicus, from Greek anagōgos ‘leading upwards’, from anagein ‘lead up’ (from ana ‘up’ + agein ‘to lead’).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌænəˈɡɒdʒɪk/","syllables":"an-a-go-gic"},"inflection":{"notes":"Adjectives do not typically inflect."},"usage_notes":{"explanation":"\"Anagogic\" is primarily used in theological or literary contexts to describe an interpretation that reveals a higher, spiritual, or eschatological meaning. It's often associated with the fourfold method of biblical interpretation, where it represents the ultimate destiny or heavenly reward.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The anagogic painting depicted a realistic scene.","correct":"✓ The painting had an anagogic meaning, representing the soul's journey to heaven.","note":"Anagogic refers to the interpretation or meaning, not the depiction itself. It's about the spiritual significance, not the literal representation."}],"priority":"★☆☆"},"related_words":{"derivatives":["anagoge (noun): A mystical or spiritual interpretation of a word, statement, or event.","anagogical (adjective): Alternative form of anagogic."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"anagogic\" is a specialized term primarily encountered in theological or advanced literary analysis. It refers to a method of interpretation that seeks to reveal a deeper, spiritual, or eschatological meaning beyond the literal or allegorical levels. Understanding requires familiarity with the history of biblical interpretation and philosophical concepts of spirituality.","priority":"★☆☆"},"example_sentences":[{"sentence":"The sermon explored the anagogic significance of the sacrament.","translation":"その説教は、聖餐の秘跡が持つ天国的な意味を探求した。","type":"adjective","meaning_category":"spiritual interpretation"},{"sentence":"Critics debated the anagogic elements in Dante's Divine Comedy.","translation":"批評家たちは、ダンテの神曲におけるアナゴジー的要素について議論した。","type":"adjective","meaning_category":"mystical meaning"}]}