{"word":"transvestism","priority":"3","meanings":[{"part_of_speech":"noun","definition":"異性装嗜好、異性装","english_definition":"The practice of dressing and acting in a style or manner traditionally associated with the opposite sex.","examples":[{"sentence":"Transvestism is not necessarily related to sexual orientation.","translation":"異性装嗜好は必ずしも性的指向と関係があるとは限りません。"},{"sentence":"The character's transvestism was explored in the play.","translation":"その登場人物の異性装嗜好は劇中で掘り下げられました。"}],"collocations":["cross-dressing","gender expression","sexual fetish"],"synonyms":["cross-dressing","gender impersonation","drag"],"antonyms":[]}],"etymology":{"value":"Coined in 1910 by Magnus Hirschfeld from Latin trans- 'across, beyond' + vestitus 'dressed' + -ism.","priority":"2"},"pronunciation":{"ipa":"/trænzˈvɛstɪzəm/","syllables":"trans-ves-tism"},"inflection":{"noun_plural":"transvestisms"},"usage_notes":{"explanation":"Transvestism is a term that has been historically used to describe the practice of cross-dressing. However, it is now often considered outdated and potentially offensive, as it was sometimes pathologized. The term 'cross-dressing' is generally preferred. It is important to note that cross-dressing is a form of gender expression and is not necessarily related to sexual orientation or gender identity.","priority":"3"},"common_mistakes":{"examples":[{"incorrect":"Transvestism is the same as being transgender.","correct":"Transvestism is not the same as being transgender. Transgender people have a gender identity that differs from their assigned sex at birth, while cross-dressers may or may not identify as transgender.","note":"Transvestism (cross-dressing) is about gender expression, while being transgender is about gender identity."}],"priority":"2"},"related_words":{"derivatives":["transvestite","cross-dresser","cross-dressing"],"phrasal_verbs":[],"priority":"3"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency","priority":"1"},"readability_explanation":{"level":"C1","text":"The word 'transvestism' refers to the practice of dressing and acting in a style traditionally associated with the opposite sex. It's important to understand that this term can be considered outdated and potentially offensive, as it has been historically associated with pathologizing cross-dressing. The term 'cross-dressing' is often preferred. It's also crucial to remember that cross-dressing is a form of gender expression and is distinct from gender identity and sexual orientation."},"example_sentences":[{"sentence":"Historically, transvestism was often misunderstood as a mental disorder.","translation":"歴史的に、異性装嗜好はしばしば精神疾患として誤解されていました。","type":"noun","meaning_category":"異性装嗜好"},{"sentence":"Many people who engage in cross-dressing do not identify as transvestites.","translation":"異性装をする多くの人々は、異性装嗜好者であるとは認識していません。","type":"noun","meaning_category":"異性装嗜好"}]}