{"word":"adipose-susceptible","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"Likely to accumulate fat or be affected by conditions related to fat accumulation.","english_definition":"Having a predisposition or susceptibility to the accumulation of fat or to conditions associated with fat accumulation.","examples":[{"sentence":"Individuals with certain genetic markers may be more adipose-susceptible.","translation":"特定の遺伝子マーカーを持つ個人は、脂肪が蓄積しやすい可能性があります。"},{"sentence":"The study investigated factors influencing adipose-susceptible phenotypes in mice.","translation":"その研究では、マウスにおける脂肪蓄積しやすい表現型に影響を与える要因を調査しました。"}],"collocations":["adipose-susceptible individuals","adipose-susceptible phenotypes","adipose-susceptible genes"],"synonyms":["fat-prone","obesity-prone","adiposity-prone"],"antonyms":["adipose-resistant","lean-prone"],"notes":"This term is often used in scientific or medical contexts related to obesity and metabolic disorders."}],"etymology":{"value":"The term is formed by combining 'adipose' (relating to fat) and 'susceptible' (likely to be affected by).","priority":"Low"},"pronunciation":{"ipa":"/ˈædɪpoʊs səˈsɛptəbəl/","syllables":"ad-i-pose sus-cep-ti-ble"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Adipose-susceptible' is used to describe organisms or individuals that are more likely to develop excess body fat or related health issues. It is commonly used in research settings when studying the genetic and environmental factors that contribute to obesity.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"The adipose-susceptible cells were resistant to insulin.","correct":"The adipose-susceptible individuals were resistant to insulin.","note":"The term usually refers to whole organisms or individuals, not individual cells."}],"priority":"Low"},"related_words":{"derivatives":["adiposity","susceptibility"],"related_terms":["obesity","metabolic syndrome","insulin resistance"]},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in scientific literature.","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Adipose-susceptible' is a technical term used in the fields of medicine and biology to describe a predisposition to accumulating fat. It is not commonly used in everyday language. Understanding this term requires familiarity with scientific vocabulary."},"example_sentences":[{"sentence":"The researchers identified several genes associated with an adipose-susceptible state.","translation":"研究者らは、脂肪蓄積しやすい状態に関連するいくつかの遺伝子を特定しました。","type":"adjective","meaning_category":"Likely to accumulate fat"},{"sentence":"Early life nutrition can influence whether an individual becomes adipose-susceptible later in life.","translation":"幼少期の栄養は、個人が将来脂肪蓄積しやすい体質になるかどうかに影響を与える可能性があります。","type":"adjective","meaning_category":"Likely to accumulate fat"}]}