{"word":"non-printing","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(文字などが)印刷されない、表示されない","english_definition":"Not designed to be printed or displayed; invisible when printed or displayed.","examples":[{"sentence":"Non-printing characters such as spaces and tabs are used for formatting.","translation":"スペースやタブなどの非印刷文字は、書式設定に使用されます。"},{"sentence":"The software allows you to insert non-printing notes for your own reference.","translation":"そのソフトウェアでは、自分自身のリファレンスとして非印刷のメモを挿入できます。"},{"sentence":"These comments are non-printing and will not appear in the final document.","translation":"これらのコメントは非印刷であり、最終ドキュメントには表示されません。"}],"collocations":["non-printing character","non-printing note","non-printing comment","non-printing element","non-printing guide"],"synonyms":["invisible","hidden","unprintable"],"antonyms":["printing","visible","printable"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to the word 'printing'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈprɪntɪŋ/","syllables":"non-print-ing"},"inflection":{"notes":"This word is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Non-printing' refers to elements or characters in a document or file that are not intended to be physically printed or displayed in the final output. These are often used for formatting, comments, or other metadata that are useful during the creation or editing process but should not be visible to the end user.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The non printing document was sent to the printer.","correct":"✓ The document with non-printing elements was sent to the printer.","note":"'Non-printing' describes the elements, not the document itself. It's more accurate to say the document contains non-printing elements. Alternatively, you could say 'The document was sent to the printer, but the non-printing elements were configured not to print.'"},{"incorrect":"✗ Use non printing ink for this project.","correct":"✓ Use invisible ink for this project.","note":"'Non-printing' refers to elements that are intentionally hidden, not to the ink itself. If you need ink that is invisible, use 'invisible ink'."}],"priority":"★★☆"},"related_words":{"derivatives":["non-printed"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The term 'non-printing' is typically used in the context of computer software, document editing, and graphic design. It refers to elements within a digital file that are not intended to be physically printed or displayed. Understanding this term requires familiarity with document formatting and software features. It is more commonly used by those with intermediate to advanced computer skills."},"example_sentences":[{"sentence":"The gridlines in the spreadsheet are set to be **non-printing**.","translation":"スプレッドシートのグリッド線は非印刷に設定されています。","type":"adjective","meaning_category":"印刷されない"},{"sentence":"She added a **non-printing** comment to explain the formula.","translation":"彼女は数式を説明するために非印刷のコメントを追加しました。","type":"adjective","meaning_category":"表示されない"},{"sentence":"Make sure the **non-printing** characters are hidden before sharing the document.","translation":"ドキュメントを共有する前に、非印刷文字が非表示になっていることを確認してください。","type":"adjective","meaning_category":"印刷されない"}]}