{"word":"time-rent","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(不動産) 定期借地権、期間を定めた土地の賃貸契約","english_definition":"(Real Estate) A leasehold interest in land for a fixed period of time, typically with periodic rent payments.","examples":[{"sentence":"The developer acquired the land through a time-rent agreement.","translation":"開発業者は定期借地権契約を通じてその土地を取得した。"},{"sentence":"The value of the property is affected by the terms of the time-rent.","translation":"その物件の価値は、定期借地権の条件によって影響を受ける。"}],"collocations":["time-rent agreement","time-rent contract","time-rent property","time-rent value"],"synonyms":["leasehold","ground lease","land lease"],"antonyms":["fee simple","freehold"]}],"etymology":{"value":"Compound word combining \"time\" (referring to the duration of the lease) and \"rent\" (referring to the periodic payments made for the use of the land).","priority":"N/A"},"pronunciation":{"ipa":"/ˈtaɪmˌrɛnt/","syllables":"time-rent"},"inflection":{"noun_plural":"time-rents"},"usage_notes":{"explanation":"\"Time-rent\" is a specialized term primarily used in real estate and legal contexts to describe a specific type of land lease agreement. It emphasizes that the lease is for a defined period, after which the rights to the land revert back to the original owner. This contrasts with owning the land outright (fee simple).","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He bought a time-rent.","correct":"✓ He acquired a time-rent. / ✓ He entered into a time-rent agreement.","note":"One does not typically \"buy\" a time-rent, but rather acquires it through a lease agreement."}],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low Frequency","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The term \"time-rent\" is a specialized legal and real estate term. Understanding requires familiarity with property law concepts such as leaseholds, ground leases, and fee simple ownership. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The city offered a 99-year time-rent on the waterfront property.","translation":"市はウォーターフロントの物件に99年間の定期借地権を提供した。","type":"noun","meaning_category":"定期借地権"},{"sentence":"The investor analyzed the potential returns from the time-rent before making a decision.","translation":"投資家は決定を下す前に、定期借地権からの潜在的な収益を分析した。","type":"noun","meaning_category":"定期借地権"}]}