{"word":"Prussian","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"プロイセンの、プロイセン人（またはその文化）に関する","english_definition":"relating to Prussia, its people, or their culture.","examples":[{"sentence":"The Prussian army was known for its discipline.","translation":"プロイセン軍は規律正しさで知られていた。"},{"sentence":"He studied Prussian history at university.","translation":"彼は大学でプロイセンの歴史を研究した。"},{"sentence":"The Prussian blue dye was widely used in paintings.","translation":"プロイセンブルーの染料は絵画で広く使われた。"}],"collocations":["Prussian army","Prussian history","Prussian blue","Prussian culture","Prussian state","Prussian virtues"],"synonyms":["Germanic","Teutonic"],"antonyms":[]},{"part_of_speech":"noun","definition":"プロイセン人","english_definition":"a person from Prussia.","examples":[{"sentence":"The Prussians played a significant role in German history.","translation":"プロイセン人はドイツの歴史において重要な役割を果たした。"},{"sentence":"Many Prussians emigrated to America in the 19th century.","translation":"多くのプロイセン人が19世紀にアメリカへ移住した。"}],"collocations":["Old Prussian","East Prussian"],"synonyms":["German"],"antonyms":[]}],"etymology":{"value":"From Prussia, a historical region and kingdom in Europe, primarily located in present-day Germany and Poland. The name Prussia comes from the Old Prussian people, a Baltic ethnic group.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈprʌʃən/","syllables":"Prus-sian"},"inflection":{"notes":"The noun form is both singular and plural (Prussians). The adjective form does not inflect."},"usage_notes":{"explanation":"The term \"Prussian\" refers to the historical kingdom of Prussia, which played a significant role in the unification of Germany. It is often associated with militarism, efficiency, and discipline. The adjective \"Prussian\" describes things related to this kingdom, its people, or its culture. Be mindful of the historical context when using this term, as it can evoke strong feelings related to German history and militarism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a person from Russia, so he is Prussian.","correct":"✓ He is a person from Prussia, so he is Prussian.","note":"Prussia and Russia are different countries. Prussia was a historical kingdom in what is now primarily Germany and Poland."},{"incorrect":"✗ Prussian is a language.","correct":"✓ Prussian is a demonym for people from Prussia. The Old Prussian language was a Baltic language.","note":"While there was an Old Prussian language, when referring to people, \"Prussian\" is used as a demonym (a noun referring to people from a specific place)."}],"priority":"★★☆"},"related_words":{"derivatives":["Prussia","Prussianism","Old Prussian (language)","East Prussia"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Prussian\" refers to the historical kingdom of Prussia, which existed primarily in what is now Germany and Poland. It is used to describe things related to this kingdom, its people, or its culture. The term often carries connotations of militarism, discipline, and efficiency due to the historical role of the Prussian army. It's important to be aware of this historical context when using the word. The term is not as commonly used today as Prussia ceased to exist as a separate entity after World War II.","priority":"★☆☆"},"example_sentences":[{"sentence":"The **Prussian** military reforms influenced armies around the world.","translation":"プロイセンの軍事改革は世界中の軍隊に影響を与えた。","type":"adjective","meaning_category":"relating to Prussia"},{"sentence":"Many **Prussians** were Protestants.","translation":"多くのプロイセン人はプロテスタントだった。","type":"noun","meaning_category":"person from Prussia"},{"sentence":"The **Prussian** blue pigment was a significant development in art history.","translation":"プロイセンブルーの顔料は美術史における重要な発展だった。","type":"adjective","meaning_category":"relating to Prussia"}]}