{"word":"ferroelectricity","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"強誘電性","english_definition":"The property of certain materials that exhibit spontaneous electric polarization that can be reversed by the application of an external electric field.","examples":[{"sentence":"Ferroelectricity is used in various electronic devices.","translation":"強誘電性は様々な電子機器に利用されている。"},{"sentence":"The material exhibits ferroelectricity at room temperature.","translation":"その物質は室温で強誘電性を示す。"}],"collocations":["exhibit ferroelectricity (強誘電性を示す)","ferroelectricity material (強誘電体)","study ferroelectricity (強誘電性を研究する)"],"synonyms":["spontaneous polarization","electric polarization"],"antonyms":["paraelectricity"]}],"etymology":{"value":"The term 'ferroelectricity' was coined by analogy with ferromagnetism, where a material exhibits spontaneous magnetic polarization. The prefix 'ferro-' refers to iron, but the phenomenon of ferroelectricity does not necessarily involve iron.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɛroʊɪlɛkˈtrɪsɪti/","syllables":"fer-ro-i-lec-tric-i-ty"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Ferroelectricity is a property of certain dielectric materials. These materials have a spontaneous electric polarization, meaning that they have an internal electric field even in the absence of an external field. This polarization can be reversed by applying an external electric field. Ferroelectric materials are used in a variety of applications, including capacitors, sensors, and actuators.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ferroelectricity is a magnetism.","correct":"✓ Ferroelectricity is an electrical property.","note":"Ferroelectricity is an electrical property, not a magnetic one. It is analogous to ferromagnetism but involves electric polarization instead of magnetic polarization."}],"priority":"★★☆"},"related_words":{"derivatives":["ferroelectric (adjective, noun)","ferroelectric material (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Ferroelectricity' is a technical term used in physics and materials science to describe a specific property of certain materials. Understanding this term requires a background in electromagnetism and solid-state physics. The key concept is spontaneous electric polarization, which is analogous to spontaneous magnetization in ferromagnetism. The term is relatively rare outside of scientific contexts."},"example_sentences":[{"sentence":"The discovery of new ferroelectricity materials is crucial for developing advanced electronic devices.","translation":"新しい強誘電性材料の発見は、高度な電子デバイスの開発にとって重要である。","type":"general","meaning_category":"General Usage"},{"sentence":"The hysteresis loop is a characteristic feature of ferroelectricity materials.","translation":"ヒステリシスループは、強誘電性材料の特性である。","type":"technical","meaning_category":"Technical Explanation"}]}