{"word":"ephemerides","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(天文学) 天体暦、天文位置表","english_definition":"(astronomy) tables giving the calculated positions of celestial objects at regular intervals.","examples":[{"sentence":"Astronomers use ephemerides to predict the locations of planets.","translation":"天文学者は天体暦を使って惑星の位置を予測します。"},{"sentence":"The ephemerides provide data for calculating eclipses.","translation":"その天体暦は、日食を計算するためのデータを提供します。"}],"collocations":["astronomical ephemerides","planetary ephemerides","solar ephemerides"],"synonyms":["astronomical tables","celestial almanac"],"antonyms":[]},{"part_of_speech":"noun","definition":"(占星術) ホロスコープ作成のための占星暦","english_definition":"(astrology) a table giving the daily positions of the planets, used by astrologers to draw up horoscopes.","examples":[{"sentence":"Astrologers consult ephemerides to determine planetary aspects.","translation":"占星術師は、惑星のアスペクトを決定するために占星暦を参照します。"},{"sentence":"The ephemerides are essential for astrological predictions.","translation":"占星暦は占星術的な予測に不可欠です。"}],"collocations":["astrological ephemerides","daily ephemerides"],"synonyms":["astrological almanac"],"antonyms":[]}],"etymology":{"value":"Late Latin ephemeris (plural ephemerides), from Greek ephemeris 'diary, journal', from ephēmeros 'lasting only one day'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈfɛmərɪdiːz/","syllables":"e-phem-er-i-des"},"inflection":{"noun_plural":"ephemerides (already plural, sometimes ephemeris is used as singular)"},"usage_notes":{"explanation":"'Ephemerides' refers to a table or data set that provides the calculated positions of celestial objects (planets, stars, etc.) at specific times. It is primarily used in astronomy and astrology. In astronomy, it's a crucial tool for predicting the locations of celestial bodies for observation and research. In astrology, it's used to determine planetary positions for creating horoscopes. The singular form is sometimes given as 'ephemeris', although 'ephemerides' is already plural.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used ephemeris to find the planets.","correct":"✓ I used ephemerides to find the planets.","note":"While 'ephemeris' can be used as a singular form, 'ephemerides' is the more common plural form, even when referring to a single set of tables."}],"priority":"★☆☆"},"related_words":{"derivatives":["ephemeral (adjective: lasting for a very short time)"],"related_terms":["astronomy","astrology","celestial mechanics","horoscope"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Ephemerides' is a technical term primarily used in the fields of astronomy and astrology. It refers to tables that provide calculated positions of celestial objects at specific times. Due to its specialized usage, it is not commonly encountered outside of these contexts. Understanding the term requires some familiarity with astronomy or astrology.","priority":"★☆☆"},"example_sentences":[{"sentence":"The astronomer consulted the **ephemerides** to determine the position of Mars.","translation":"天文学者は火星の位置を特定するために天体暦を参照した。","type":"noun","meaning_category":"astronomy"},{"sentence":"The astrologer used the **ephemerides** to create a birth chart.","translation":"占星術師は占星暦を使って出生図を作成した。","type":"noun","meaning_category":"astrology"}]}