{"word":"noninductive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"非帰納的な、誘導作用のない","english_definition":"Not inductive; lacking or not involving induction. In electrical contexts, refers to a circuit or component designed to minimize or eliminate inductance.","examples":[{"sentence":"A noninductive resistor is designed to have minimal self-inductance.","translation":"非誘導抵抗器は、自己インダクタンスを最小限に抑えるように設計されています。"},{"sentence":"The winding was designed to be noninductive to prevent unwanted electromagnetic interference.","translation":"その巻線は、不要な電磁干渉を防ぐために非誘導的になるように設計されました。"},{"sentence":"The circuit employed a noninductive load.","translation":"その回路は非誘導負荷を採用していました。"}],"collocations":["noninductive resistor","noninductive winding","noninductive load","noninductive circuit"],"synonyms":["resistance","capacitive","ohmic"],"antonyms":["inductive"],"related_terms":["inductance","induction","capacitor","resistor","circuit"],"domain":"Physics, Electrical Engineering"}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to 'inductive'. 'Inductive' relates to induction, particularly electromagnetic induction.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnɪnˈdʌktɪv/","syllables":"non-in-duc-tive"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more noninductive' and 'most noninductive', respectively, though these are rarely used."},"usage_notes":{"explanation":"'Noninductive' is primarily used in physics and electrical engineering to describe components or circuits where the effect of inductance is intentionally minimized or absent. This is often achieved through specific design techniques, such as counter-wound coils, to cancel out the magnetic fields that cause inductance. The term is most commonly applied to resistors, but can also describe other components or entire circuits.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The wire is non-conducting.","correct":"✓ The wire is non-inductive.","note":"'Non-conducting' means not able to conduct electricity, while 'noninductive' means not having inductance. They are different properties."},{"incorrect":"✗ A noninductive coil has high inductance.","correct":"✓ A noninductive coil has low inductance.","note":"'Noninductive' means having minimal or no inductance, so it cannot have high inductance."}],"priority":"★★☆"},"related_words":{"derivatives":["noninductively"],"related_concepts":["impedance","reactance","RL circuit","LC circuit"],"priority":"★★☆"},"level_frequency":{"frequency_corpus":"Low frequency. Technical term used in specific fields.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Noninductive' is a technical term primarily used in the fields of physics and electrical engineering. It describes something that does not exhibit or intentionally minimizes the property of inductance. Understanding this term requires familiarity with the concept of inductance, which is the tendency of an electrical conductor to oppose changes in the electric current flowing through it. A noninductive component is designed to counteract this tendency, often through specific design features that cancel out the magnetic fields that cause inductance. This term is not commonly used in everyday language."},"example_sentences":[{"sentence":"The technician used a noninductive resistor to calibrate the sensitive instrument.","translation":"技術者は、高感度機器を校正するために非誘導抵抗器を使用しました。","type":"example","meaning_category":"electrical engineering"},{"sentence":"The design of the coil was carefully optimized to be as noninductive as possible.","translation":"コイルの設計は、可能な限り非誘導的になるように注意深く最適化されました。","type":"example","meaning_category":"physics"},{"sentence":"Using a noninductive load can improve the stability of the amplifier circuit.","translation":"非誘導負荷を使用すると、増幅回路の安定性を向上させることができます。","type":"example","meaning_category":"electrical engineering"}]}