{"word":"sporulative","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(植物学)胞子を形成する、胞子性の","english_definition":"Producing or characterized by spores.","examples":[{"sentence":"The sporulative structures of the fungus were clearly visible under the microscope.","translation":"その菌類の胞子形成構造は顕微鏡下で明確に見えた。"},{"sentence":"Some bacteria are sporulative, allowing them to survive harsh conditions.","translation":"一部の細菌は胞子を形成し、それによって過酷な条件を生き延びることができる。"}],"collocations":["sporulative bacteria","sporulative fungus","sporulative structure"],"synonyms":["spore-forming","sporangial","sporic"],"antonyms":["nonsporulative","sterile"]}],"etymology":{"value":"Derived from 'spore' + '-ulative' (suffix indicating a tendency or capability).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈspɔːr.jʊ.leɪ.tɪv/","syllables":"spor-u-la-tive"},"inflection":{"notes":"Comparative and superlative forms are not commonly used for this adjective."},"usage_notes":{"explanation":"'Sporulative' is a technical term primarily used in botany and microbiology to describe organisms or structures that produce spores. It is often used in scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant is very sporulative. It has many flowers.","correct":"✓ The plant is very floriferous. It has many flowers.","note":"'Sporulative' refers to spore production, not flower production. 'Floriferous' describes abundant flowering."},{"incorrect":"✗ The sporulative process is very fast.","correct":"✓ The sporulation process is very fast.","note":"'Sporulation' is the correct noun form for the process of spore formation."}],"priority":"★★☆"},"related_words":{"derivatives":["spore (noun): a reproductive cell capable of developing into a new individual.","sporulation (noun): the process of spore formation.","sporulate (verb): to produce spores."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'sporulative' is a specialized adjective used in scientific contexts, particularly in botany and microbiology. It describes organisms or structures that produce spores. Understanding this term requires familiarity with basic biological concepts related to reproduction and survival strategies in plants, fungi, and bacteria. It is not commonly used in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The sporulative capacity of the fungus contributes to its widespread distribution.","translation":"その菌類の胞子形成能力が、その広範な分布に貢献している。","type":"adjective","meaning_category":"孢子を形成する"},{"sentence":"The researchers studied the sporulative behavior of different bacterial strains.","translation":"研究者たちは、さまざまな細菌株の胞子形成行動を研究した。","type":"adjective","meaning_category":"孢子性の"}]}