{"word":"radioscope","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"A device for examining objects using X-rays or other forms of radiation; a fluoroscope.","english_definition":"An instrument for rendering visible by means of X-rays the interior of an opaque body.","examples":[{"sentence":"The doctor used a radioscope to examine the patient's lungs.","translation":"医者は患者の肺を診るためにラジオスコープを使った。"},{"sentence":"Radioscopes are essential tools in medical diagnostics.","translation":"ラジオスコープは医療診断に不可欠な道具である。"}],"collocations":["medical radioscope","portable radioscope","digital radioscope"],"synonyms":["fluoroscope","X-ray machine"],"antonyms":[]}],"etymology":{"value":"From 'radio-' (referring to radiation) + '-scope' (instrument for viewing).","priority":"Medium"},"pronunciation":{"ipa":"/ˈreɪdiəˌskoʊp/","syllables":"ra-di-o-scope"},"inflection":{"noun_plural":"radioscopes"},"usage_notes":{"explanation":"The term 'radioscope' is somewhat archaic; 'fluoroscope' or 'X-ray machine' are more commonly used today. It specifically refers to a device that allows real-time viewing of the internal structures of an object using radiation, rather than capturing a static image.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"Using a radioscope, the image was captured.","correct":"Using a radioscope, the doctor viewed the internal organs.","note":"Radioscopes are used for direct viewing, not for capturing images."}],"priority":"Low"},"related_words":{"derivatives":["radioscopy (the process of using a radioscope)"],"related_terms":["radiography (X-ray photography)","fluoroscopy (real-time X-ray imaging)"],"priority":"Medium"},"level_frequency":{"frequency_google_ngram":"Very low frequency - mostly found in older texts or specialized medical contexts.","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Radioscope' is a technical term primarily used in medical or scientific contexts. It refers to a device that allows a user to view the internal structures of an object using X-rays or other forms of radiation. While once a common term, it has largely been replaced by 'fluoroscope' or 'X-ray machine' in modern usage. Understanding this term is helpful for interpreting older medical literature or understanding the history of medical imaging technology."},"example_sentences":[{"sentence":"The old hospital still used a radioscope for quick preliminary examinations.","translation":"その古い病院では、迅速な予備検査のためにラジオスコープをまだ使用していた。","type":"general","meaning_category":"Medical Imaging"},{"sentence":"The technician adjusted the settings on the radioscope before the procedure.","translation":"技術者は処置の前にラジオスコープの設定を調整した。","type":"technical","meaning_category":"Medical Equipment"}]}