{"word":"Liturgician","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"典礼学者、礼拝学研究者","english_definition":"A scholar of liturgy; one who studies the history, theology, and practice of public worship in religious traditions.","examples":[{"sentence":"The liturgician's expertise was invaluable in revising the church's service book.","translation":"その典礼学者の専門知識は、教会の礼拝式文の改訂において非常に貴重だった。"},{"sentence":"A conference of liturgicians discussed the challenges of adapting ancient rituals to contemporary contexts.","translation":"典礼学者たちの会議では、古代の儀式を現代の文脈に適応させることの課題について議論された。"}],"collocations":["leading liturgician","noted liturgician","consult with a liturgician","conference of liturgicians"],"synonyms":["liturgist","worship scholar","ritual scholar"],"antonyms":[]}],"etymology":{"value":"Derived from 'liturgy' (public worship) + '-ician' (suffix denoting a person engaged in a particular study or activity). The term 'liturgy' comes from Greek 'leitourgia' (public service, work done at public expense).","priority":"★★☆"},"pronunciation":{"ipa":"/lɪˈtɜːrdʒɪʃən/","syllables":"li-tur-gi-cian"},"inflection":{"noun_plural":"Liturgicians"},"usage_notes":{"explanation":"A 'liturgician' is a specialist in liturgy, which encompasses the forms, structures, and theological underpinnings of public worship. They often work with religious organizations to develop or revise liturgical practices. The term is relatively formal and specific, mainly used in academic or religious contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a liturgician of mathematics.","correct":"✓ He is a mathematician.","note":"'Liturgician' specifically refers to the study of religious liturgy, not other academic fields."}],"priority":"★★☆"},"related_words":{"derivatives":["liturgy","liturgical","liturgics"],"phrases":["liturgical studies","history of liturgy","theology of liturgy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'liturgician' is a specialized term used in academic and religious contexts to refer to a scholar of liturgy. Understanding this word requires familiarity with the concept of 'liturgy' itself, which is the customary public worship performed by a religious group. The word is not commonly encountered in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The professor, a renowned liturgician, lectured on the evolution of Christian worship.","translation":"その教授は、著名な典礼学者であり、キリスト教礼拝の進化について講義した。","type":"general","meaning_category":"scholar of liturgy"},{"sentence":"Liturgicians often consult historical texts to understand the origins of modern rituals.","translation":"典礼学者は、現代の儀式の起源を理解するために、歴史的な文献を参考にすることが多い。","type":"general","meaning_category":"scholar of liturgy"}]}