{"word":"provokingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"挑発的に、怒らせるように、扇動的に、刺激的に","english_definition":"In a manner that provokes, incites, or stimulates; in a way that is intended to cause annoyance, anger, or strong reaction.","examples":[{"sentence":"She smiled provokingly, knowing it would irritate him.","translation":"彼女は彼を苛立たせるだろうとわかっていて、挑発的に微笑んだ。"},{"sentence":"He spoke provokingly about sensitive topics, just to get a reaction.","translation":"彼は反応を得るためだけに、デリケートな話題について挑発的に話した。"},{"sentence":"The advertisement was designed to be provokingly controversial.","translation":"その広告は、挑発的に物議を醸すように設計されていた。"}],"collocations":["smile provokingly","speak provokingly","act provokingly","dress provokingly"],"synonyms":["irritatingly","annoyingly","offensively","seductively","teasingly","challengingly"],"antonyms":["soothingly","calmly","peacefully","inoffensively"]}],"etymology":{"value":"Derived from the word 'provoking' by adding the suffix '-ly'. 'Provoking' comes from the verb 'provoke', which originates from the Latin 'provocare', meaning 'to call forth, challenge'.","priority":"★★☆"},"pronunciation":{"ipa":"/prəˈvoʊkɪŋli/","syllables":"pro-vok-ing-ly"},"inflection":{"notes":"Adverb - no inflection"},"usage_notes":{"explanation":"'Provokingly' describes an action or behavior that is intended to elicit a strong emotional response, often negative, from someone. It can also describe something that is stimulating or intriguing in a way that invites further attention or discussion. The context usually determines whether the provocation is meant to be offensive or simply engaging.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She looked provokingly.","correct":"✓ She looked provocative.","note":"'Provokingly' is an adverb, describing how an action is performed. 'Provocative' is an adjective, describing a quality of a person or thing. Use 'provocative' to describe someone's appearance or behavior as intentionally stimulating or sexually suggestive, and 'provokingly' to describe the manner in which someone acts to provoke a reaction."}],"priority":"★★☆"},"related_words":{"derivatives":["provoke (verb)","provoking (adjective)","provocation (noun)","provocative (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Provokingly' is an adverb that describes something done in a way that is intended to cause a strong reaction, often anger or annoyance. It suggests a deliberate attempt to challenge or irritate someone. This word is not commonly used in everyday conversation and is more likely to appear in formal writing or discussions about behavior and motivation."},"example_sentences":[{"sentence":"He questioned her decisions provokingly, trying to undermine her confidence.","translation":"彼は彼女の自信を弱めようと、彼女の決定を挑発的に質問した。","type":"adverb","meaning_category":"挑発的に"},{"sentence":"The painting was hung provokingly off-center, drawing attention to its unusual composition.","translation":"その絵は挑発的に中心から外れて掛けられており、その珍しい構成に注目を集めていた。","type":"adverb","meaning_category":"刺激的に"},{"sentence":"She dressed provokingly for the party, hoping to attract attention.","translation":"彼女は注目を集めることを期待して、パーティーのために挑発的な服装をした。","type":"adverb","meaning_category":"扇動的に"}]}