{"word":"Bezoardic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"解毒作用のある、解毒剤の","english_definition":"Having the properties of a bezoar; possessing antidotal qualities.","examples":[{"sentence":"The bezoardic stone was believed to cure poisoning.","translation":"その解毒石は、中毒を治すと信じられていた。"},{"sentence":"The bezoardic properties of the herb were studied by the alchemists.","translation":"そのハーブの解毒特性は、錬金術師によって研究された。"}],"collocations":["bezoardic stone","bezoardic properties","bezoardic remedy"],"synonyms":["antidotal","detoxifying","antipoisonous"],"antonyms":["toxic","poisonous"]}],"etymology":{"value":"From 'bezoar' (a mass found in the alimentary canal of certain animals, formerly believed to have medicinal properties) + '-ic' (suffix indicating belonging or relating to).","priority":"★★★"},"pronunciation":{"ipa":"/ˌbiːzoʊˈɑːrdɪk/","syllables":"be-zo-ar-dic"},"inflection":{"notes":"Adjectives do not typically inflect in English, though they can be modified by adverbs (e.g., very bezoardic)."},"usage_notes":{"explanation":"'Bezoardic' is a relatively rare and somewhat archaic term, primarily used in historical or fantasy contexts when discussing remedies or antidotes. It refers to something that possesses the qualities of a bezoar, which was once highly valued for its supposed ability to counteract poisons.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bezoardic is a powerful antidote.","correct":"✓ A bezoar is a powerful antidote. / ✓ The bezoardic stone is a powerful antidote.","note":"'Bezoardic' is an adjective, so it needs to modify a noun. The noun 'bezoar' refers to the object itself."},{"incorrect":"✗ He used bezoardic as a noun.","correct":"✓ He used a bezoar as a remedy.","note":"'Bezoardic' is not a noun; it describes something that has the properties of a bezoar."}],"priority":"★★☆"},"related_words":{"derivatives":["bezoar"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Bezoardic' is a highly specialized and uncommon word. Understanding it requires familiarity with the historical belief in bezoars as antidotes. Its use is generally limited to contexts involving historical medicine, alchemy, or fantasy literature."},"example_sentences":[{"sentence":"The old apothecary touted the bezoardic effects of his special elixir.","translation":"その老いた薬屋は、彼の特別なエリクサーの解毒効果を宣伝した。","type":"adjective","meaning_category":"解毒作用のある"},{"sentence":"Many believed in the bezoardic power of the unicorn horn.","translation":"多くの人々が、ユニコーンの角の解毒力（解毒作用）を信じていた。","type":"adjective","meaning_category":"解毒作用のある"}]}