{"word":"antipolygamy","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"一夫多妻制反対、重婚反対","english_definition":"Opposition to polygamy (the practice or condition of having more than one spouse at the same time).","examples":[{"sentence":"The antipolygamy movement gained momentum in the late 19th century.","translation":"重婚反対運動は19世紀後半に勢いを増した。"},{"sentence":"Antipolygamy laws are in place in many countries.","translation":"重婚禁止法は多くの国で施行されている。"}],"collocations":["antipolygamy movement (重婚反対運動)","antipolygamy law (重婚禁止法)"],"synonyms":["monogamy advocacy","anti-bigamy"],"antonyms":["pro-polygamy","polygamy advocacy"]}],"etymology":{"value":"\"anti-\" (反対) + \"polygamy\" (一夫多妻制)","priority":"★★★"},"pronunciation":{"ipa":"/ˌænti.pəˈlɪɡəmi/","syllables":"an-ti-po-lyg-a-my"},"inflection":{"noun_plural":"antipolygamies"},"usage_notes":{"explanation":"\"Antipolygamy\" refers specifically to the opposition to the practice of polygamy. It is often used in historical or legal contexts when discussing movements or laws against plural marriage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He supports antipolygamy because he is polygamous.","correct":"✓ He supports antipolygamy because he believes in monogamy.","note":"Antipolygamy is opposition to polygamy, so a supporter of antipolygamy would not be polygamous."}],"priority":"★★☆"},"related_words":{"derivatives":["antipolygamist (重婚反対者)"],"related_terms":["polygamy (一夫多妻制)","monogamy (一夫一妻制)","bigamy (重婚)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Antipolygamy\" is a specialized term that is primarily used in legal, historical, and sociological contexts. It refers to the opposition to the practice of polygamy, which is the state of having more than one spouse at the same time. Understanding this term requires familiarity with related concepts such as \"polygamy,\" \"monogamy,\" and the historical and legal debates surrounding marriage. Due to its specific and somewhat academic usage, it is not a word commonly encountered in everyday conversation."},"example_sentences":[{"sentence":"The politician's stance on antipolygamy was a key issue in the election.","translation":"その政治家の重婚反対の姿勢は選挙における重要な争点だった。","type":"noun","meaning_category":"重婚反対"},{"sentence":"Antipolygamy sentiment was strong in the community due to religious beliefs.","translation":"宗教的信念により、地域社会では重婚反対の感情が強かった。","type":"noun","meaning_category":"重婚反対"}]}