{"word":"Nitralloy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"窒化鋼","english_definition":"A type of alloy steel containing nitrogen, used for parts requiring a hard surface.","examples":[{"sentence":"Nitralloy is often used in the manufacture of gears and valves.","translation":"窒化鋼は、歯車やバルブの製造によく使用されます。"}],"collocations":["Nitralloy steel","Nitralloy parts"],"synonyms":["nitriding steel"],"antonyms":[]}],"etymology":{"value":"A portmanteau of 'Nitride' and 'Alloy', reflecting its composition and the nitriding process it undergoes.","priority":"★★★"},"pronunciation":{"ipa":"/ˈnaɪtrəˌlɔɪ/","syllables":"Ni-tral-loy"},"inflection":{"notes":"Uncountable noun"},"usage_notes":{"explanation":"Nitralloy is a specific type of alloy steel known for its hardness and wear resistance, achieved through a nitriding process. It is primarily used in engineering applications where surface hardness is crucial.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need a nitralloy for this project.","correct":"✓ I need nitralloy for this project.","note":"'Nitralloy' is typically used as an uncountable noun, referring to the material itself."}],"priority":"★★☆"},"related_words":{"derivatives":["nitride","alloy","nitriding"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nitralloy' is a technical term used in engineering and materials science. It refers to a specific type of alloy steel that has been treated with nitrogen to increase its surface hardness. Understanding this term requires knowledge of metallurgy and material properties."},"example_sentences":[{"sentence":"The crankshaft was made of Nitralloy to withstand high stress.","translation":"クランクシャフトは、高い応力に耐えるために窒化鋼で作られていました。","type":"noun","meaning_category":"窒化鋼"},{"sentence":"Nitralloy provides excellent wear resistance in high-friction environments.","translation":"窒化鋼は、高摩擦環境で優れた耐摩耗性を提供します。","type":"noun","meaning_category":"窒化鋼"}]}