{"word":"remaintenance","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"再メンテナンス、再保守","english_definition":"The act of maintaining something again; a second or subsequent maintenance.","examples":[{"sentence":"The system required remaintenance after the initial fix failed.","translation":"最初の修正がうまくいかなかったため、システムは再メンテナンスが必要になった。"},{"sentence":"We scheduled a remaintenance to address the lingering issues.","translation":"残っている問題に対処するために、再メンテナンスを予定しました。"}],"collocations":["schedule remaintenance","require remaintenance","perform remaintenance"],"synonyms":["re-servicing","second maintenance","follow-up maintenance"],"antonyms":["initial maintenance","first maintenance"]}],"etymology":{"value":"The word is formed by adding the prefix 're-' (meaning 'again' or 'anew') to the word 'maintenance'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˈmeɪntənəns/","syllables":"re-main-te-nance"},"inflection":{"noun_plural":"remaintenances"},"usage_notes":{"explanation":"'Remaintenance' refers to a second or subsequent instance of maintenance performed on something, usually after an initial maintenance effort has proven insufficient or when new issues arise. It implies that the object or system has already undergone maintenance at least once.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The remaintenance was done by the same team that did the original maintenance.","correct":"✓ The re-maintenance was done by the same team that did the original maintenance.","note":"While 'remaintenance' is understandable, using 're-maintenance' with a hyphen can improve clarity."},{"incorrect":"✗ The system needs maintenance, not remaintenance.","correct":"✓ The system needs further maintenance.","note":"Use 'remaintenance' only if the system has already undergone maintenance at least once."}],"priority":"★☆☆"},"related_words":{"derivatives":["re-maintain (verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Remaintenance' is a relatively uncommon term used to describe a second or subsequent instance of maintenance. It is typically used in technical or engineering contexts where systems or equipment may require repeated maintenance efforts. The prefix 're-' indicates that the maintenance is being performed again. Understanding this term requires familiarity with the concept of maintenance and the function of the prefix 're-'. "},"example_sentences":[{"sentence":"The aircraft underwent remaintenance to correct the engine malfunction.","translation":"航空機はエンジンの故障を修正するために再メンテナンスを受けた。","type":"noun","meaning_category":"再保守"},{"sentence":"Due to unexpected wear, the bridge required remaintenance sooner than anticipated.","translation":"予期せぬ摩耗のため、橋は予想よりも早く再メンテナンスが必要になった。","type":"noun","meaning_category":"再メンテナンス"}]}