{"word":"pan-frying","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"フライパン焼き、浅い油での揚げ焼き","english_definition":"A cooking method in which food is cooked in a relatively shallow pan with a moderate amount of oil or fat.","examples":[{"sentence":"Pan-frying is a quick way to cook chicken breasts.","translation":"フライパン焼きは鶏むね肉を調理する手軽な方法です。"},{"sentence":"She prefers pan-frying fish to deep-frying it.","translation":"彼女は魚を揚げるよりもフライパン焼きにする方が好きです。"},{"sentence":"The recipe calls for pan-frying the vegetables until they are tender.","translation":"レシピでは、野菜が柔らかくなるまでフライパンで焼くように指示されています。"}],"collocations":["pan-frying chicken (鶏肉のフライパン焼き)","pan-frying fish (魚のフライパン焼き)","pan-frying vegetables (野菜のフライパン焼き)","shallow pan-frying (浅い油でのフライパン焼き)"],"synonyms":["sautéing","shallow frying"],"antonyms":["deep-frying","baking","boiling"]},{"part_of_speech":"verb","definition":"フライパンで焼く、浅い油で揚げ焼きする","english_definition":"To cook food in a relatively shallow pan with a moderate amount of oil or fat.","examples":[{"sentence":"I'm going to pan-fry some potatoes for dinner.","translation":"夕食にジャガイモをフライパンで焼くつもりです。"},{"sentence":"He pan-fried the steak to a perfect medium-rare.","translation":"彼はステーキを完璧なミディアムレアにフライパンで焼いた。"},{"sentence":"Make sure to pan-fry the onions until they are golden brown.","translation":"玉ねぎが黄金色になるまでフライパンで焼いてください。"}],"collocations":["pan-fry chicken (鶏肉をフライパンで焼く)","pan-fry fish (魚をフライパンで焼く)","pan-fry vegetables (野菜をフライパンで焼く)"],"synonyms":["sauté","shallow fry"],"antonyms":["deep-fry","bake","boil"]}],"etymology":{"value":"The term 'pan-frying' is a combination of 'pan' (referring to the cooking pan) and 'frying' (the process of cooking food in hot oil or fat). It describes the specific method of frying food in a pan with a shallow amount of oil.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpænˌfraɪɪŋ/","syllables":"pan-fry-ing"},"inflection":{"verb_forms":{"present_simple":["pan-fry","pan-fries"],"past_simple":"pan-fried","past_participle":"pan-fried","present_participle":"pan-frying"}},"usage_notes":{"explanation":"'Pan-frying' involves cooking food in a pan with a moderate amount of oil, enough to cover the bottom of the pan and partially submerge the food. This differs from 'deep-frying,' where the food is fully submerged in oil. Pan-frying typically results in a crispy exterior and a moist interior. It is a common method for cooking meats, fish, and vegetables.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I pan-fried the chicken in no oil.","correct":"✓ I pan-fried the chicken with a little oil.","note":"Pan-frying requires some oil to prevent sticking and to achieve the desired texture. Using no oil would be more akin to dry-frying or grilling."},{"incorrect":"✗ Pan-frying is the same as deep-frying.","correct":"✓ Pan-frying uses less oil than deep-frying.","note":"Pan-frying uses a shallow amount of oil, while deep-frying requires the food to be fully submerged in oil."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B1","frequency_google_ngram":"Relatively common in cooking contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"'Pan-frying' is a cooking term that means cooking food in a pan with some oil or fat. It's like frying, but you use less oil than when you deep-fry something. It's a common way to cook things like chicken, fish, or vegetables. You heat the pan with some oil, then put the food in the pan and cook it until it's brown and cooked through.","priority":"★★★"},"example_sentences":[{"sentence":"She is pan-frying some mushrooms for the omelet.","translation":"彼女はオムレツのためにマッシュルームをフライパンで焼いています。","type":"verb","meaning_category":"調理"},{"sentence":"The pan-frying technique gave the chicken a crispy skin.","translation":"フライパン焼きのテクニックで鶏肉の皮がパリパリになった。","type":"noun","meaning_category":"調理法"},{"sentence":"He learned how to pan-fry fish from his grandmother.","translation":"彼は祖母から魚のフライパン焼きの仕方を教わった。","type":"verb","meaning_category":"調理"},{"sentence":"Pan-frying is a healthier alternative to deep-frying.","translation":"フライパン焼きは、揚げ物よりも健康的な代替手段です。","type":"noun","meaning_category":"調理法"}]}