{"word":"epipastic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(医学)皮膚に塗布する、または皮膚に適用される","english_definition":"(medicine) Applied to or for application to the skin.","examples":[{"sentence":"The doctor prescribed an epipastic ointment for the rash.","translation":"医者は発疹のために皮膚に塗布する軟膏を処方した。"}],"collocations":["epipastic ointment","epipastic cream"],"synonyms":["topical","dermal","cutaneous"],"antonyms":[]}],"etymology":{"value":"From Greek ἐπί (epi, “on, upon”) + παστός (pastos, “sprinkled, plastered”), referring to something sprinkled or plastered on.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛpɪˈpæstɪk/","syllables":"e-pi-pas-tic"},"inflection":{"notes":"Adjective; comparative and superlative forms are typically formed using 'more' and 'most' (e.g., more epipastic, most epipastic)."},"usage_notes":{"explanation":"'Epipastic' is a relatively rare term, primarily used in medical or pharmaceutical contexts to describe substances designed for application to the skin. It emphasizes the method of application rather than the effect of the substance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The medicine was epipastic internally.","correct":"✓ The medicine was taken internally.","note":"'Epipastic' refers to external application; internal use would be described differently."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'epipastic' is a highly specialized term primarily encountered in medical or pharmaceutical contexts. Its meaning is relatively straightforward—referring to substances applied to the skin—but its limited usage makes it uncommon in general discourse. Understanding this term is mainly relevant for those in healthcare fields or those reading specialized medical literature."},"example_sentences":[{"sentence":"The pharmacist prepared an epipastic solution for the patient's eczema.","translation":"薬剤師は患者の湿疹のために皮膚に塗布する溶液を調合した。","type":"adjective","meaning_category":"Medical"},{"sentence":"Epipastic medications are often used to treat localized skin conditions.","translation":"皮膚に塗布する薬は、局所的な皮膚疾患の治療によく使用される。","type":"adjective","meaning_category":"Medical"}]}