{"word":"pleuro-peritoneum","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"胸膜腹膜","english_definition":"The serous membrane that lines the pleural and peritoneal cavities in certain animals, such as amphibians and reptiles.","examples":[{"sentence":"The pleuro-peritoneum separates the lungs from the abdominal organs in frogs.","translation":"胸膜腹膜はカエルにおいて肺を腹部臓器から分離する。"}],"collocations":[],"synonyms":["serosa","mesothelium"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'pleura' (side, rib) referring to the membrane lining the lungs, and 'peritoneum' (that which is stretched around) referring to the membrane lining the abdominal cavity.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌplʊəroʊˌpɛrɪtəˈniːəm/","syllables":"pleu-ro-per-i-to-ne-um"},"inflection":{"noun_plural":"pleuro-peritoneums or pleuro-peritonea"},"usage_notes":{"explanation":"The term 'pleuro-peritoneum' is primarily used in the context of comparative anatomy, specifically when describing the anatomy of animals where the pleural and peritoneal cavities are not fully separated. In mammals, these cavities are distinct, but in some lower vertebrates, a single membrane serves both functions.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["pleural","peritoneal","pleuroperitoneal"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency. Specialized anatomical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pleuro-peritoneum' is a highly specialized anatomical term primarily encountered in advanced biology or veterinary contexts. It refers to a serous membrane found in certain animals (e.g., amphibians, reptiles) that lines both the pleural (lung) and peritoneal (abdominal) cavities. This term is not commonly used in general English and requires a strong background in anatomy to understand fully."},"example_sentences":[{"sentence":"In amphibians, the lungs and abdominal organs are enclosed within a single cavity lined by the pleuro-peritoneum.","translation":"両生類では、肺と腹部臓器は胸膜腹膜によって裏打ちされた単一の腔内に囲まれている。","type":"scientific","meaning_category":"anatomy"}]}