{"word":"Euripidean","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"エウリピデス風の、エウリピデスの作品に特徴的な","english_definition":"relating to or characteristic of Euripides or his works.","examples":[{"sentence":"The play has a Euripidean quality, with its focus on the psychological struggles of the characters.","translation":"その劇は、登場人物の心理的な葛藤に焦点を当てている点で、エウリピデス風の性質を持っている。"},{"sentence":"A Euripidean tragedy typically explores themes of suffering, madness, and the irrationality of human behavior.","translation":"エウリピデスの悲劇は通常、苦しみ、狂気、人間の行動の不合理さといったテーマを探求する。"}],"collocations":["Euripidean tragedy","Euripidean drama","Euripidean style","Euripidean themes"],"synonyms":["tragic","dramatic","classical","Greek","Athenian"],"antonyms":["non-tragic","comedic"]},{"part_of_speech":"noun","definition":"エウリピデスの信奉者、エウリピデスの影響を受けた人","english_definition":"a follower or admirer of Euripides.","examples":[{"sentence":"He was a Euripidean at heart, always questioning traditional values.","translation":"彼は心の底ではエウリピデス主義者であり、常に伝統的な価値観に疑問を抱いていた。"}],"collocations":["a true Euripidean"],"synonyms":["admirer","follower","disciple","scholar"],"antonyms":["critic"]}],"etymology":{"value":"Derived from the name of the ancient Greek playwright Euripides (c. 480-406 BC) + -an (suffix indicating belonging or relation).","priority":"★★★"},"pronunciation":{"ipa":"/jʊˌrɪpɪˈdiːən/","syllables":"Eu-ri-pi-de-an"},"inflection":{"notes":"Adjective and noun forms exist. The adjective does not inflect. The noun can be pluralized as Euripideans."},"usage_notes":{"explanation":"'Euripidean' is used to describe something that is reminiscent of the style, themes, or dramatic techniques of the ancient Greek playwright Euripides. His plays often featured strong female characters, questioned traditional morality, and explored the darker aspects of human nature. Thus, 'Euripidean' can imply a focus on psychological realism, skepticism, and the exploration of difficult or controversial subjects.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The play was very Euripides.","correct":"✓ The play was very Euripidean.","note":"Use the adjective form 'Euripidean' rather than the name 'Euripides' to describe something that resembles his work."}],"priority":"★★☆"},"related_words":{"derivatives":["Euripides"],"related_terms":["Greek tragedy","classical drama","Athenian drama","Sophoclean","Aeschylean"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Euripidean' is a relatively uncommon word used in academic or literary contexts to describe something related to the works or style of the ancient Greek playwright Euripides. Understanding the characteristics of Euripides' plays (e.g., psychological realism, questioning of traditional values) is essential to understanding the meaning of 'Euripidean.'"},"example_sentences":[{"sentence":"The novel's exploration of moral ambiguity is distinctly Euripidean.","translation":"その小説における道徳的曖昧さの探求は、明らかにエウリピデス的である。","type":"adjective","meaning_category":"style/themes"},{"sentence":"As a Euripidean, she championed the rights of marginalized groups.","translation":"エウリピデス主義者として、彼女は社会的に疎外された人々の権利を擁護した。","type":"noun","meaning_category":"follower/admirer"},{"sentence":"The chorus in the play serves a function reminiscent of Euripidean drama.","translation":"その劇の合唱隊は、エウリピデスの劇を彷彿とさせる役割を果たしている。","type":"adjective","meaning_category":"style/themes"}]}