{"word":"antiprohibition","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"禁酒反対","english_definition":"Opposition to prohibition, especially the prohibition of alcohol.","examples":[{"sentence":"The antiprohibition movement gained momentum in the early 20th century.","translation":"20世紀初頭、禁酒反対運動は勢いを増した。"},{"sentence":"He was a strong advocate of antiprohibition, arguing for personal freedom.","translation":"彼は個人の自由を主張し、禁酒反対の強力な支持者だった。"}],"collocations":["antiprohibition league","antiprohibition sentiment","antiprohibition arguments","antiprohibition activists"],"synonyms":["anti-prohibitionism","opposition to prohibition"],"antonyms":["prohibition","prohibitionism"]},{"part_of_speech":"adjective","definition":"禁酒反対の","english_definition":"Opposing prohibition, especially the prohibition of alcohol.","examples":[{"sentence":"The antiprohibition party platform included repealing the 18th Amendment.","translation":"禁酒反対政党の政策綱領には、第18修正条項の撤廃が含まれていた。"},{"sentence":"Antiprohibition groups organized protests against the ban on alcohol.","translation":"禁酒反対団体は、アルコール禁止に対する抗議活動を組織した。"}],"collocations":["antiprohibition laws","antiprohibition policies","antiprohibition stance","antiprohibition rhetoric"],"synonyms":["anti-prohibitionist","opposed to prohibition"],"antonyms":["prohibitionist"]}],"etymology":{"value":"The word is formed by adding the prefix 'anti-' (meaning against) to 'prohibition' (the act of prohibiting, especially the banning of alcohol).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæntiˌproʊɪˈbɪʃən/","syllables":"an-ti-pro-hi-bi-tion"},"inflection":{"noun_plural":"antiprohibitions"},"usage_notes":{"explanation":"'Antiprohibition' refers specifically to the opposition to laws or policies that prohibit something, most commonly the prohibition of alcohol. It is often used in historical contexts, particularly when discussing the Prohibition era in the United States.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a antiprohibitionist.","correct":"✓ He is an antiprohibitionist.","note":"When using 'antiprohibitionist' as a noun, remember to use the article 'an' before it because it starts with a vowel sound."}],"priority":"★☆☆"},"related_words":{"derivatives":["antiprohibitionist (noun/adjective): A person who opposes prohibition.","prohibition (noun): The act of prohibiting something, especially the banning of alcohol.","prohibitionism (noun): The advocacy of prohibition."],"related_terms":["repeal (verb): To revoke or annul a law or act.","temperance (noun): Moderation or self-restraint, especially in eating and drinking."],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in historical or political contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Antiprohibition' is a term primarily encountered in historical or political discussions, specifically relating to the opposition of laws that prohibit certain activities, most notably the prohibition of alcohol. Understanding this term requires familiarity with the historical context of prohibition movements. It's a relatively specialized term, not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The failure of prohibition led to the rise of antiprohibition sentiment.","translation":"禁酒法の失敗は、禁酒反対感情の高まりにつながった。","type":"noun","meaning_category":"禁酒反対"},{"sentence":"Several antiprohibition organizations campaigned for the repeal of the Eighteenth Amendment.","translation":"いくつかの禁酒反対団体が、第18修正条項の撤廃を求めて運動した。","type":"adjective","meaning_category":"禁酒反対の"}]}