{"word":"confraternities","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(特に宗教的な目的のための)兄弟団、友愛会、親睦団体","english_definition":"plural of confraternity: a brotherhood, especially a religious one; a society or organization of men sharing a common interest or purpose.","examples":[{"sentence":"Many confraternities were established during the Middle Ages to provide mutual aid and support.","translation":"中世には、相互扶助と支援を提供するために多くの兄弟団が設立されました。"},{"sentence":"These confraternities played an important role in the religious and social life of the community.","translation":"これらの兄弟団は、地域社会の宗教的および社会生活において重要な役割を果たしました。"},{"sentence":"The museum has a collection of banners and artifacts from various local confraternities.","translation":"博物館には、地元のさまざまな兄弟団からの旗や工芸品のコレクションがあります。"}],"collocations":["religious confraternities (宗教的な兄弟団)","lay confraternities (在俗信徒の兄弟団)","join a confraternity (兄弟団に加入する)","members of a confraternity (兄弟団のメンバー)","historical confraternities (歴史的な兄弟団)"],"synonyms":["brotherhoods","societies","associations","guilds","fellowships","fraternities"],"antonyms":["N/A (antonyms are not typically used for this word)"]}],"etymology":{"value":"Derived from the Medieval Latin 'confraternitas', from 'con-' (together) + 'fraternitas' (brotherhood), from 'frater' (brother).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒnfrəˈtɜːrnɪtiz/","syllables":"con-fra-ter-ni-ties"},"inflection":{"noun_plural":"confraternities"},"usage_notes":{"explanation":"'Confraternities' refers specifically to organized groups, often with religious or charitable aims. It is a formal term and less commonly used in everyday conversation. It usually implies a historical or traditional context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a member of confraternity.","correct":"✓ He is a member of a confraternity.","note":"'Confraternity' is a countable noun and requires an article ('a' or 'the') when singular."},{"incorrect":"✗ The confraternities is very old.","correct":"✓ The confraternities are very old.","note":"'Confraternities' is plural, so it requires a plural verb ('are')."}],"priority":"★☆☆"},"related_words":{"derivatives":["confraternity (singular form)","fraternity (related but often refers to secular or student organizations)","fraternal (adjective relating to brothers or brotherhood)"],"phrasal_verbs":["N/A (phrasal verbs are not typically associated with this word)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'confraternities' is a relatively uncommon term, typically encountered in historical, religious, or academic contexts. It refers to organized groups or societies, often with a religious or charitable purpose, similar to brotherhoods or guilds. Due to its specialized usage, it's more likely to appear in advanced texts or discussions. Understanding its etymology (related to 'brotherhood') can aid in comprehension.","priority":"★☆☆"},"example_sentences":[{"sentence":"Historical records detail the activities of various confraternities in the city during the Renaissance.","translation":"歴史的記録は、ルネサンス期における市内の様々な兄弟団の活動を詳細に記述しています。","type":"general","meaning_category":"historical context"},{"sentence":"The confraternities organized processions and festivals to celebrate religious holidays.","translation":"兄弟団は、宗教的な休日を祝うために行列や祭りを組織しました。","type":"religious","meaning_category":"religious activities"},{"sentence":"Membership in these confraternities often provided social and economic benefits to its members.","translation":"これらの兄弟団への加入は、しばしばメンバーに社会的および経済的利益をもたらしました。","type":"social","meaning_category":"social benefits"}]}