{"word":"typeable","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(文字などが)タイプ可能な、入力可能な","english_definition":"Capable of being typed or entered using a keyboard or similar input device.","examples":[{"sentence":"This field is typeable; you can enter your name here.","translation":"この欄は入力可能です。ここに名前を入力できます。"},{"sentence":"Make sure the text box is typeable before you start entering data.","translation":"データを入力する前に、テキストボックスが入力可能であることを確認してください。"}],"collocations":["typeable character (入力可能な文字)","typeable field (入力可能な欄)","typeable area (入力可能な領域)","make typeable (入力可能にする)"],"synonyms":["enterable","inputtable"],"antonyms":["non-typeable","uneditable","read-only"]}],"etymology":{"value":"The word \"typeable\" is formed by adding the suffix \"-able\" to the verb \"type.\" The suffix \"-able\" means \"capable of\" or \"suitable for.\" Therefore, \"typeable\" literally means \"capable of being typed.\"","priority":"★★★"},"pronunciation":{"ipa":"/ˈtaɪpəbəl/","syllables":"ty-pa-ble"},"inflection":{"adjective_forms":{"comparative":"more typeable","superlative":"most typeable"}},"usage_notes":{"explanation":"\"Typeable\" is primarily used in the context of computer interfaces, software, and digital documents. It describes whether a user can input text into a specific area or field. It is a straightforward term with a clear and specific meaning, making it easy to understand and use.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The document is typeable but not printable.","correct":"✓ The document is editable but not printable.","note":"While \"typeable\" implies text can be entered, \"editable\" is a broader term that suggests the document can be modified in various ways, not just through typing. Use \"editable\" if you mean the document can be generally changed."},{"incorrect":"✗ Make sure the keyboard is typeable.","correct":"✓ Make sure the keyboard is working.","note":"Keyboards are generally assumed to be for typing, so saying a keyboard is \"typeable\" is redundant. Instead, say the keyboard is \"working\" or \"functional\"."}],"priority":"★★☆"},"related_words":{"derivatives":["type (verb, noun)","typing (noun)","typed (adjective)","untypeable (adjective)"],"related_terms":["editable","input","keyboard","text field","text box","form","data entry"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"typeable\" is a technical term mainly used in computing and digital contexts. It means that something, like a text field on a website or in a software application, allows you to enter text using a keyboard. It's not a word you'd use in everyday conversation, but it's helpful to know if you work with computers or software. The word is understandable if you know the base word \"type\" and the suffix \"-able,\" which means \"capable of.\"","priority":"★★★"},"example_sentences":[{"sentence":"The search bar is typeable, so you can enter your query directly.","translation":"検索バーは入力可能なので、クエリを直接入力できます。","type":"adjective","meaning_category":"入力可能な"},{"sentence":"Is this document typeable, or is it read-only?","translation":"このドキュメントは入力可能ですか、それとも読み取り専用ですか？","type":"adjective","meaning_category":"入力可能な"},{"sentence":"The form has several typeable fields for personal information.","translation":"フォームには個人情報を入力するための入力可能なフィールドがいくつかあります。","type":"adjective","meaning_category":"入力可能な"}]}