{"word":"polyphyly","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"多系統（群）、多源性","english_definition":"the condition of a taxonomic grouping containing organisms with similar characteristics but not derived from a common ancestor.","examples":[{"sentence":"Polyphyly is undesirable in phylogenetic classification.","translation":"多系統性は系統分類学において望ましくない。"},{"sentence":"The traditional grouping of algae is an example of polyphyly.","translation":"藻類の伝統的な分類は多系統性の例である。"}],"collocations":["exhibit polyphyly","avoid polyphyly","resolve polyphyly"],"synonyms":["artificial grouping","convergent evolution"],"antonyms":["monophyly","paraphyly"]},{"part_of_speech":"noun","definition":"（分類群の）多系統性を示す状態","english_definition":"a group of organisms that does not include the common ancestor.","examples":[{"sentence":"The polyphyly of the group was revealed by molecular data.","translation":"そのグループの多系統性は分子データによって明らかになった。"}],"collocations":["demonstrate polyphyly","evidence of polyphyly"],"synonyms":["non-monophyletic group"],"antonyms":["monophyletic group"]}],"etymology":{"value":"Derived from the Greek words 'poly' (many), 'phylo' (tribe or race), and '-y' (state or condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɒlɪˈfaɪli/","syllables":"pol-y-phy-ly"},"inflection":{"noun_plural":"polyphylies"},"usage_notes":{"explanation":"Polyphyly refers to a group of organisms that are clustered together based on similar traits, but these traits evolved independently in different lineages rather than being inherited from a common ancestor. Such groupings are considered unnatural in modern phylogenetic systematics because they do not reflect evolutionary relationships. Molecular data and cladistic analysis are often used to identify and correct polyphyletic groupings.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The species showed polyphyly because they were closely related.","correct":"✓ The species showed polyphyly because their similarities evolved independently.","note":"Polyphyly indicates that similarities are due to convergent evolution, not close relatedness from a common ancestor."}],"priority":"★☆☆"},"related_words":{"derivatives":["polyphyletic (adjective)"],"related_terms":["monophyly","paraphyly","phylogeny","cladistics","taxonomy"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Polyphyly' is a technical term used in biology, specifically in the fields of taxonomy and phylogenetics. It describes a situation where a group of organisms shares similar characteristics, but these characteristics have evolved independently in different lineages, rather than being inherited from a common ancestor. This concept is important for understanding evolutionary relationships and constructing accurate classifications of living organisms. Understanding polyphyly requires familiarity with basic evolutionary principles and taxonomic concepts."},"example_sentences":[{"sentence":"The polyphyly of warm-blooded animals was disproved by the discovery of a common ancestor with temperature regulation mechanisms.","translation":"恒温動物の多系統性は、体温調節機構を持つ共通祖先の発見によって否定された。","type":"noun","meaning_category":"多系統（群）"},{"sentence":"Traditional classifications based solely on morphology often resulted in polyphyly.","translation":"形態のみに基づいた伝統的な分類は、しばしば多系統性をもたらした。","type":"noun","meaning_category":"多系統（群）"}]}