{"word":"Celtic-style","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"ケルト風の、ケルト様式の","english_definition":"Relating to or characteristic of the style of art, music, or culture associated with the Celtic peoples.","examples":[{"sentence":"The museum features a collection of Celtic-style jewelry.","translation":"その博物館はケルト風の宝石類のコレクションを展示している。"},{"sentence":"The band played Celtic-style folk music.","translation":"そのバンドはケルト風のフォーク音楽を演奏した。"},{"sentence":"She decorated her house with Celtic-style patterns.","translation":"彼女は家をケルト風の模様で飾った。"}],"collocations":["Celtic-style knotwork","Celtic-style cross","Celtic-style music","Celtic-style art","Celtic-style design"],"synonyms":["Celtic","Gaelic","Irish","Scottish","Welsh"],"antonyms":["Non-Celtic"]}],"etymology":{"value":"Combination of 'Celtic' (referring to the Celtic peoples and their culture) and 'style' (a particular way of doing or presenting something).","priority":"Medium"},"pronunciation":{"ipa":"/ˈkɛltɪk staɪl/","syllables":"Cel-tic-style"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"'Celtic-style' is used to describe something that imitates or is inspired by the art, music, or cultural traditions of the Celtic peoples, particularly those of Ireland, Scotland, Wales, Cornwall, and Brittany. It often refers to specific visual motifs like knotwork, spirals, and crosses.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"The dress was Celtic style.","correct":"The dress was Celtic-style.","note":"'Celtic-style' is an adjective and should be used as such. Hyphenation is important."}],"priority":"Low"},"related_words":{"derivatives":["Celtic","style"],"phrases":["Celtic knot","Celtic cross","Celtic music","Celtic art"]},"level_frequency":{"notes":"The term is not extremely common but is recognizable, particularly in contexts related to art, music, and cultural heritage.","priority":"Low"},"readability_explanation":{"level":"Intermediate","text":"'Celtic-style' is a compound adjective used to describe something that resembles or is inspired by Celtic culture, art, or music. It's commonly used in contexts related to design, history, and cultural heritage. Understanding the term requires familiarity with the concept of Celtic culture."},"example_sentences":[{"sentence":"The artist created a beautiful Celtic-style tapestry.","translation":"そのアーティストは美しいケルト風のタペストリーを作った。","type":"general","meaning_category":"Art/Design"},{"sentence":"The pub had a cozy atmosphere with Celtic-style decor.","translation":"そのパブはケルト風の装飾で居心地の良い雰囲気だった。","type":"general","meaning_category":"Decoration"},{"sentence":"She enjoys listening to Celtic-style instrumental music.","translation":"彼女はケルト風のインストゥルメンタル音楽を聴くのが好きだ。","type":"general","meaning_category":"Music"}]}