{"word":"nonsynchronously","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"非同期的に、同時でない方法で","english_definition":"In a manner that is not synchronous; not occurring at the same time or rate.","examples":[{"sentence":"The data was transmitted nonsynchronously to avoid congestion.","translation":"輻輳を避けるため、データは非同期的に送信された。"},{"sentence":"The tasks were executed nonsynchronously, allowing for greater flexibility.","translation":"タスクは非同期的に実行され、より高い柔軟性が可能になった。"}],"collocations":["transmit nonsynchronously","execute nonsynchronously","process nonsynchronously","operate nonsynchronously"],"synonyms":["asynchronously","independently","separately","uncoordinatedly"],"antonyms":["synchronously","simultaneously","concurrently","coordinatedly"]}],"etymology":{"value":"\"non-\" (否定) + \"synchronously\" (同期的に)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈsɪŋkrənəsli/","syllables":"non-syn-chro-nous-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"\"Nonsynchronously\" describes actions or events that do not happen at the same time or are not coordinated in time. It is often used in technical contexts, such as computer science and telecommunications, to describe processes that do not rely on precise timing or synchronization. It emphasizes the lack of temporal coordination.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The system works nonsynchronous.","correct":"✓ The system works nonsynchronously.","note":"\"Nonsynchronous\" is an adjective, while \"nonsynchronously\" is an adverb. Use the adverb to describe how something is done."},{"incorrect":"✗ Nonsynchronously data transfer is faster.","correct":"✓ Nonsynchronous data transfer is faster.","note":"Here, \"nonsynchronous\" is used as an adjective to describe the type of data transfer."}],"priority":"★★☆"},"related_words":{"derivatives":["nonsynchronous (adjective)","asynchronous (adjective/adverb)","synchronously (adverb)","synchronous (adjective)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonsynchronously\" is a technical term used to describe processes or actions that do not happen at the same time or in a coordinated manner. It's the opposite of \"synchronously,\" which means happening at the same time. You'll often find this word in discussions about computer systems, data transfer, or other technical fields where timing and coordination are important. Because it's a specialized term, it's not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The messages were delivered nonsynchronously, so the order of arrival was not guaranteed.","translation":"メッセージは非同期的に配信されたため、到着順序は保証されなかった。","type":"adverb","meaning_category":"非同期的な配信"},{"sentence":"The application processes user requests nonsynchronously to maintain responsiveness.","translation":"アプリケーションは応答性を維持するために、ユーザーリクエストを非同期的に処理する。","type":"adverb","meaning_category":"非同期的な処理"},{"sentence":"Data updates are applied nonsynchronously to the database to improve performance.","translation":"データ更新はパフォーマンスを向上させるために、データベースに非同期的に適用される。","type":"adverb","meaning_category":"非同期的な更新"}]}