{"word":"subalary","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare) A salary that is less than a living wage; a very low salary.","english_definition":"A salary insufficient to cover basic living expenses.","examples":[{"sentence":"The company was criticized for paying subalaries to its employees, forcing them to rely on government assistance.","translation":"その会社は、従業員に生活賃金以下の給与を支払い、政府の援助に頼らざるを得ない状況にさせているとして批判された。"},{"sentence":"Many workers in the gig economy are earning subalaries, making it difficult to make ends meet.","translation":"ギグエコノミーの多くの労働者は生活賃金以下の給与を得ており、生活費を工面するのが難しい。"}],"collocations":["earn a subalary","pay a subalary","receive a subalary","live on a subalary"],"synonyms":["poverty wage","starvation wage","minimum wage (when insufficient)"],"antonyms":["living wage","fair wage","decent salary"]},{"part_of_speech":"adjective","definition":"(rare) Pertaining to or characterized by a salary that is less than a living wage.","english_definition":"Relating to or describing a salary insufficient to cover basic living expenses.","examples":[{"sentence":"The subalary jobs offered by the company were not enough to attract qualified candidates.","translation":"その会社が提供する生活賃金以下の仕事では、有能な人材を集めるには不十分だった。"},{"sentence":"The government is working to eliminate subalary employment and ensure that all workers earn a fair wage.","translation":"政府は生活賃金以下の雇用をなくし、すべての労働者が公正な賃金を得られるように取り組んでいる。"}],"collocations":["subalary job","subalary employment","subalary income"],"synonyms":["low-paying","underpaid"],"antonyms":["well-paying","highly compensated"]}],"etymology":{"value":"Formed by combining the prefix 'sub-' (meaning 'below' or 'less than') with 'salary'.","priority":"★★☆"},"pronunciation":{"ipa":"/sʌbˈsæləri/","syllables":"sub-al-a-ry"},"inflection":{"noun_plural":"subalaries","adjective_forms":{"comparative":"more subalary","superlative":"most subalary"}},"usage_notes":{"explanation":"The term 'subalary' is relatively rare and is primarily used in discussions about economic inequality and workers' rights. It emphasizes the inadequacy of a salary to meet basic needs, highlighting the challenges faced by low-wage workers. It is often used in a critical or disapproving context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The subalary was too much for the worker to handle.","correct":"✓ The subalary was too little for the worker to handle.","note":"'Subalary' refers to a low salary, so it cannot be 'too much'. Use 'too little' or rephrase to indicate the salary was insufficient."},{"incorrect":"✗ He was working at a sub salary job.","correct":"✓ He was working at a subalary job.","note":"When used as an adjective, 'subalary' is typically written as one word."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["minimum wage","living wage","poverty line","income inequality","workers' rights","wage gap","precarious employment","gig economy"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (very rare, specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Subalary' is a relatively uncommon term used to describe a salary that is so low it doesn't cover basic living expenses. It's often used in discussions about economic inequality and workers' rights. If you encounter this word, it's likely in a context criticizing low wages or advocating for a living wage. It's a combination of 'sub-' (meaning 'below') and 'salary,' so it literally means 'below a salary' in terms of providing a sufficient income."},"example_sentences":[{"sentence":"The report highlighted the prevalence of subalary jobs in the retail sector.","translation":"その報告書は、小売部門における生活賃金以下の仕事の蔓延を強調した。","type":"noun","meaning_category":"low salary"},{"sentence":"Many families are struggling to survive on subalary incomes.","translation":"多くの家族が生活賃金以下の収入でなんとか生き延びようとしている。","type":"adjective","meaning_category":"pertaining to low salary"},{"sentence":"The union is fighting for an end to subalary employment and a fair wage for all workers.","translation":"労働組合は、生活賃金以下の雇用を終わらせ、すべての労働者に公正な賃金を支払うよう求めて闘っている。","type":"noun","meaning_category":"low salary"}]}