{"word":"pseudacusis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"仮性聴覚、虚偽聴覚","english_definition":"A subjective sensation of hearing sounds that do not exist in the environment; auditory hallucination.","examples":[{"sentence":"The patient reported experiencing pseudacusis, describing the sounds as voices whispering his name.","translation":"患者は仮性聴覚を経験していると報告し、その音を自分の名前を囁く声だと説明した。"},{"sentence":"Pseudacusis can be a symptom of various neurological or psychiatric conditions.","translation":"仮性聴覚は、さまざまな神経学的または精神医学的状態の症状である可能性がある。"}],"collocations":["experience pseudacusis","report pseudacusis","symptom of pseudacusis"],"synonyms":["auditory hallucination","paracusia","phantom sound perception"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'pseudo-' (false) and 'acusis' (hearing).","priority":"★★★"},"pronunciation":{"ipa":"/ˌsjuːdəˈkuːsɪs/","syllables":"pseu-da-cu-sis"},"inflection":{"noun_plural":"pseudacuses"},"usage_notes":{"explanation":"Pseudacusis is a medical term referring to the false perception of sound. It is important to distinguish it from tinnitus, which is the perception of sound in the absence of external sound, but is not necessarily a hallucination. Pseudacusis is often associated with mental health conditions or neurological disorders.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has pseudacusis in his eyes.","correct":"✓ He has pseudacusis in his ears.","note":"Pseudacusis affects hearing, not vision."},{"incorrect":"✗ Pseudacusis is the same as tinnitus.","correct":"✓ Pseudacusis is a type of auditory hallucination, while tinnitus is the perception of sound without an external source.","note":"While both involve the perception of sound without an external source, pseudacusis is a hallucination, whereas tinnitus is not necessarily so."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudo- (prefix: false, deceptive)","acusis (hearing)","paracusia (a general term for hearing disorder or distortion)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pseudacusis' is a highly specialized medical term referring to auditory hallucinations. It is primarily used in clinical and academic contexts related to neurology, psychiatry, and audiology. Due to its technical nature, it is not commonly encountered in general language use."},"example_sentences":[{"sentence":"The psychiatrist explored the patient's history of pseudacusis to understand the underlying cause.","translation":"精神科医は、根本的な原因を理解するために、患者の仮性聴覚の病歴を調査した。","type":"noun","meaning_category":"仮性聴覚"},{"sentence":"Severe cases of pseudacusis may require pharmacological intervention.","translation":"重度の仮性聴覚の症例では、薬理学的介入が必要になる場合がある。","type":"noun","meaning_category":"仮性聴覚"}]}