{"word":"Regalism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"王権主義、王室至上主義","english_definition":"A political theory supporting the supremacy of the monarch; advocacy of monarchical rule.","examples":[{"sentence":"Regalism was a dominant ideology in many European countries during the medieval period.","translation":"王権主義は中世の多くのヨーロッパ諸国で支配的なイデオロギーでした。"},{"sentence":"The French Revolution challenged the principles of regalism.","translation":"フランス革命は王権主義の原則に異議を唱えました。"}],"collocations":["support regalism","oppose regalism","historical regalism"],"synonyms":["monarchism","royalism"],"antonyms":["republicanism","democracy"]}],"etymology":{"value":"Derived from 'regal,' meaning 'of or relating to a monarch,' and the suffix '-ism,' indicating a doctrine or belief system.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈriːɡəlɪzəm/","syllables":"re-gal-ism"},"inflection":{"noun_plural":"regalisms"},"usage_notes":{"explanation":"Regalism refers to the belief in or support for a monarchical form of government, where the monarch holds supreme authority. It is often associated with historical contexts and political theories that emphasize the divine right of kings or the inherent superiority of royal rule.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practices regalism in his daily life.","correct":"✓ He supports regalism as a political ideology.","note":"Regalism is a political ideology, not a personal practice."}],"priority":"★☆☆"},"related_words":{"derivatives":["regal (adjective)","regality (noun)","regalist (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Regalism' is a term used in political science and history to describe the advocacy or belief in monarchical rule. It is not a commonly used word in everyday conversation, but understanding it can be helpful for analyzing historical and political texts. The term is derived from 'regal,' which means 'royal' or 'of a king or queen.'"},"example_sentences":[{"sentence":"The debates surrounding regalism often involved discussions about the balance of power between the monarch and the people.","translation":"王権主義をめぐる議論は、しばしば君主と国民の間の権力バランスに関する議論を含んでいました。","type":"noun","meaning_category":"王権主義"},{"sentence":"Historically, regalism was justified by the concept of the divine right of kings.","translation":"歴史的に、王権主義は王の神権という概念によって正当化されていました。","type":"noun","meaning_category":"王権主義"}]}