{"word":"haircaps","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) スギゴケ属の植物","english_definition":"plural form of haircap: any of various mosses of the genus Polytrichum, characterized by their relatively large size and hair-like calyptrae (caps covering the developing spore capsules).","examples":[{"sentence":"The forest floor was covered in haircaps.","translation":"森の地面はスギゴケ属の植物で覆われていた。"},{"sentence":"Haircaps are often found in damp, shady areas.","translation":"スギゴケ属の植物は、湿った日陰の場所によく見られる。"}],"collocations":["forest haircaps","common haircaps","Polytrichum commune (common haircap moss)"],"synonyms":["Polytrichum","moss"],"antonyms":[]}],"etymology":{"value":"Derived from 'hair' referring to the hairy calyptra (a cap-like structure covering the developing spore capsule) and 'cap' referring to the cap-like shape of the calyptra.","priority":"★★☆"},"pronunciation":{"ipa":"ˈhɛərˌkæps","syllables":"hair-caps"},"inflection":{"noun_plural":"haircaps"},"usage_notes":{"explanation":"'Haircaps' refers specifically to mosses within the genus *Polytrichum*. These mosses are distinguished by their relatively large size compared to other mosses and the distinctive hairy calyptra that covers the spore capsule. The term is almost always used in the plural form because it refers to the group of plants rather than a single specimen.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a haircap in the forest.","correct":"✓ I saw some haircaps in the forest. / ✓ I saw a haircap moss in the forest.","note":"Since 'haircaps' refers to a group or species of moss, it's more common to use the plural form or specify 'haircap moss' when referring to a single plant. The singular 'a haircap' is technically correct but less frequently used."}],"priority":"★★☆"},"related_words":{"derivatives":["haircap (singular form, less common)","Polytrichum (genus name)","moss"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Haircaps' is a specialized term used in botany and ecology to refer to mosses of the genus *Polytrichum*. Understanding this term requires some familiarity with plant biology, specifically the characteristics of mosses. The key feature is the 'hairy cap' or calyptra that covers the spore capsule, distinguishing these mosses from others. This term is not commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"Various species of haircaps thrive in the acidic soils of the bog.","translation":"様々な種類のスギゴケ属の植物が、湿原の酸性土壌で生育している。","type":"noun","meaning_category":"スギゴケ属の植物"},{"sentence":"The haircaps provided a miniature forest landscape on the rock.","translation":"スギゴケ属の植物は、岩の上にミニチュアの森のような風景を作り出した。","type":"noun","meaning_category":"スギゴケ属の植物"}]}