{"word":"full-personed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(rare) Having a complete or fully developed personality; well-rounded.","english_definition":"(rare) Having a complete or fully developed personality; well-rounded.","examples":[{"sentence":"The goal of education should be to create full-personed individuals.","translation":"教育の目標は、人格が完全に発達した個人を育成することであるべきだ。"},{"sentence":"She was a full-personed character in the novel, with both strengths and weaknesses.","translation":"彼女は小説の中で、長所と短所を併せ持つ、人格が完全に発達した人物として描かれていた。"}],"collocations":["full-personed individual","full-personed character","full-personed development"],"synonyms":["well-rounded","fully developed","mature","complete","whole"],"antonyms":["undeveloped","immature","incomplete"]}],"etymology":{"value":"A compound word formed by combining \"full\" and \"personed.\" \"Full\" implies completeness, and \"personed\" relates to having a personality. The term suggests a state of being a complete person.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfʊl ˈpɜːrsənd/","syllables":"full-per-soned"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have typical inflections like verbs."},"usage_notes":{"explanation":"The term \"full-personed\" is relatively rare and not commonly used in everyday conversation. It is often found in discussions about education, psychology, or personal development where the emphasis is on the holistic development of an individual. It suggests a person who has developed their intellectual, emotional, social, and moral capacities to a high degree.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a very full-person.","correct":"✓ He is a very full-personed individual.","note":"\"Full-personed\" is an adjective, so it needs to modify a noun. Using \"individual\" or \"character\" makes the sentence grammatically correct."},{"incorrect":"✗ The course aims to full-person the students.","correct":"✓ The course aims to develop full-personed students.","note":"\"Full-personed\" is an adjective, not a verb. You cannot \"full-person\" someone. Instead, use a verb like \"develop\" to describe the process of becoming a full-personed individual."}],"priority":"★★☆"},"related_words":{"derivatives":["person (noun)","personality (noun)","personal (adjective)","personally (adverb)","full (adjective)","fully (adverb)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (rare)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"full-personed\" is a relatively uncommon and sophisticated term, primarily used in academic or philosophical contexts. It describes someone who has a complete and well-developed personality, encompassing intellectual, emotional, social, and moral aspects. Due to its rarity and nuanced meaning, it is best suited for advanced learners and those familiar with discussions on holistic personal development."},"example_sentences":[{"sentence":"The university strives to cultivate full-personed graduates who can contribute meaningfully to society.","translation":"その大学は、社会に有意義な貢献ができる、人格が完全に発達した卒業生を育成することを目指している。","type":"adjective","meaning_category":"well-rounded"},{"sentence":"A full-personed approach to education considers not only academic achievement but also emotional intelligence and ethical values.","translation":"教育における人格が完全に発達したアプローチは、学業成績だけでなく、心の知能指数や倫理観も考慮する。","type":"adjective","meaning_category":"well-rounded"}]}