{"word":"refinement-oriented","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"洗練指向の、改良重視の、改善志向の","english_definition":"Focused on or characterized by a desire for improvement, precision, and elegance; prioritizing the process of making something better through careful adjustments and attention to detail.","examples":[{"sentence":"The company adopted a refinement-oriented approach to product development, focusing on iterative improvements based on user feedback.","translation":"その会社は、ユーザーからのフィードバックに基づいた反復的な改善に焦点を当て、製品開発に洗練指向のアプローチを採用しました。"},{"sentence":"Her refinement-oriented mindset led her to meticulously edit and revise her writing until it was perfect.","translation":"彼女の改善志向の考え方は、完璧になるまで文章を細心の注意を払って編集し、修正することにつながりました。"},{"sentence":"A refinement-oriented strategy is crucial for achieving long-term success in a competitive market.","translation":"競争の激しい市場で長期的な成功を収めるには、改良重視の戦略が不可欠です。"}],"collocations":["refinement-oriented approach","refinement-oriented strategy","refinement-oriented mindset","refinement-oriented process","refinement-oriented design"],"synonyms":["improvement-focused","perfectionistic","detail-oriented","optimization-driven","quality-conscious"],"antonyms":["rough","crude","unrefined","careless","haphazard"]}],"etymology":{"value":"Combines 'refinement' (the process of improving something by making small changes) with 'oriented' (directed toward or interested in something).","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈfaɪnmənt ˈɔːriˌɛntɪd/","syllables":"re-fine-ment o-ri-en-ted"},"inflection":{"notes":"This is an adjective and does not have different forms."},"usage_notes":{"explanation":"\"Refinement-oriented\" is typically used to describe a process, strategy, or mindset that prioritizes continuous improvement and attention to detail. It suggests a commitment to making something the best it can be through careful adjustments and iterative changes. It's often used in technical, design, or business contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a refinement person.","correct":"✓ He is a refinement-oriented person.","note":"Use the adjective form \"refinement-oriented\" to describe a person's characteristic or approach."},{"incorrect":"✗ The project needs more refine.","correct":"✓ The project needs more refinement.","note":"\"Refine\" is a verb. Use the noun \"refinement\" to describe the process of improvement."}],"priority":"★★☆"},"related_words":{"derivatives":["refinement","oriented","refine"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency - specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Refinement-oriented\" is a specialized term used to describe something focused on continuous improvement and attention to detail. It's often used in professional or technical contexts to describe strategies, processes, or mindsets that prioritize making something better through careful adjustments. Because it's a compound adjective, it's more complex and less common in everyday language."},"example_sentences":[{"sentence":"The software development team adopted a refinement-oriented approach to debugging.","translation":"ソフトウェア開発チームは、デバッグに洗練指向のアプローチを採用しました。","type":"adjective","meaning_category":"洗練指向の"},{"sentence":"A refinement-oriented culture is essential for fostering innovation.","translation":"改善志向の文化は、イノベーションを促進するために不可欠です。","type":"adjective","meaning_category":"改善志向の"},{"sentence":"The artist's refinement-oriented technique involved layering paint and meticulously blending colors.","translation":"そのアーティストの改良重視の技法は、絵の具を重ね、色を細心の注意を払ってブレンドすることを含んでいました。","type":"adjective","meaning_category":"改良重視の"}]}