{"word":"pyramided","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"ピラミッド型に積み重ねる、ピラミッド型にする","english_definition":"To arrange or build in the shape of a pyramid; to stack or arrange in a pyramidal form.","examples":[{"sentence":"The oranges were pyramided high on the stand.","translation":"オレンジは屋台にピラミッド型に高く積み重ねられていた。"},{"sentence":"They pyramided the sand into a small hill.","translation":"彼らは砂をピラミッド型の小さな丘に積み上げた。"}],"collocations":["pyramid oranges","pyramid sand","pyramid boxes"],"synonyms":["stack","pile","heap","cone"],"antonyms":["scatter","disperse","flatten"]},{"part_of_speech":"verb","transitivity":"vi","definition":"ピラミッド型に増える、急増する","english_definition":"To increase rapidly in a way that resembles a pyramid, with a broad base and a narrow top; to grow exponentially.","examples":[{"sentence":"The company's debt pyramided over the years.","translation":"その会社の負債は年々ピラミッド型に増えていった。"},{"sentence":"Costs pyramided as the project progressed.","translation":"プロジェクトが進むにつれて、コストが急増した。"}],"collocations":["debt pyramided","costs pyramided","losses pyramided"],"synonyms":["escalate","mushroom","snowball","accumulate","proliferate"],"antonyms":["decrease","decline","reduce","diminish"]},{"part_of_speech":"verb","transitivity":"vt","definition":"ピラミッドスキームを行う、ねずみ講を行う","english_definition":"To operate or participate in a pyramid scheme, an unsustainable business model where early investors are paid with money from later investors.","examples":[{"sentence":"He was accused of pyramiding funds from investors.","translation":"彼は投資家からの資金をピラミッドスキームで運用したとして告発された。"},{"sentence":"The company pyramided its profits through illegal means.","translation":"その会社は違法な手段で利益をピラミッドスキームで増やした。"}],"collocations":["pyramid funds","pyramid profits","pyramid investments"],"synonyms":["scheme","defraud","swindle","exploit"],"antonyms":[]}],"etymology":{"value":"Derived from the word 'pyramid,' which comes from the Greek word 'pyramis,' referring to the shape of the ancient Egyptian structures. The verb form 'pyramided' implies the action of building or arranging something in that shape, or growing exponentially like a pyramid.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɪrəmɪdɪd/","syllables":"pi-ra-mid-ed"},"inflection":{"verb_forms":{"present_simple":["pyramid","pyramids"],"past_simple":"pyramided","past_participle":"pyramided","present_participle":"pyramiding"}},"usage_notes":{"explanation":"'Pyramided' can refer to the physical act of arranging objects in a pyramid shape, or to the abstract concept of something increasing rapidly. It also has a negative connotation when referring to pyramid schemes, which are fraudulent investment scams. The meaning is usually clear from the context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The books were pyramided on the table, making it hard to see.","correct":"✓ The books were piled on the table, making it hard to see.","note":"'Pyramided' implies a specific pyramid shape. If the books are just stacked haphazardly, 'piled' is a better word."},{"incorrect":"✗ She pyramided her savings by investing wisely.","correct":"✓ She increased her savings by investing wisely.","note":"If the savings increased through legitimate investments, 'increased' or 'grew' is more appropriate. 'Pyramided' suggests a pyramid scheme or unsustainable growth."}],"priority":"★★☆"},"related_words":{"derivatives":["pyramid (noun)","pyramidal (adjective)","pyramiding (noun - referring to the act of creating a pyramid scheme or exponential growth)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pyramided' is a relatively uncommon word that usually describes arranging items in a pyramid shape or, more abstractly, something increasing rapidly in a pyramid-like fashion. It is also used in the context of pyramid schemes, which are illegal financial scams. Understanding the context is important to correctly interpret the meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The apples were carefully pyramided in the display window.","translation":"リンゴは丁寧に陳列窓にピラミッド型に積み重ねられていた。","type":"verb","meaning_category":"ピラミッド型に積み重ねる"},{"sentence":"The number of cases pyramided during the epidemic.","translation":"流行の間、症例数が急増した。","type":"verb","meaning_category":"急増する"},{"sentence":"He was arrested for pyramiding money through a Ponzi scheme.","translation":"彼はポンジスキームで資金をピラミッド式に増やしたとして逮捕された。","type":"verb","meaning_category":"ピラミッドスキームを行う"}]}