{"word":"furzery","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A place where furze grows; a gorse field.","english_definition":"A place overgrown with furze; a gorse field.","examples":[{"sentence":"The sheep grazed peacefully in the furzery.","translation":"羊たちは平和にヒースの生い茂る原っぱで草を食んでいた。"},{"sentence":"The furzery was ablaze with yellow flowers in the spring.","translation":"春には、ヒースの原っぱは黄色い花で燃えるようだった。"}],"collocations":["extensive furzery","open furzery","flowering furzery"],"synonyms":["gorse field","heath","moor","common"],"antonyms":[]}],"etymology":{"value":"Derived from 'furze' (a spiny evergreen shrub) + '-ery' (a suffix denoting a place or collection).","priority":"★★★"},"pronunciation":{"ipa":"/ˈfɜːrzəri/","syllables":"fur-zer-y"},"inflection":{"noun_plural":"furzeries"},"usage_notes":{"explanation":"The word 'furzery' is relatively uncommon and primarily used in descriptive or literary contexts to evoke a specific type of landscape. It is more frequently encountered in British English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The furzery was full of trees.","correct":"✓ The furzery was full of gorse bushes.","note":"Furzery specifically refers to an area overgrown with furze (gorse), not trees. "},{"incorrect":"✗ He walked quickly through the furzery, avoiding the flowers.","correct":"✓ He walked carefully through the furzery, avoiding the thorns.","note":"Furze is known for its thorns, not just flowers. While it does flower, the thorns are a more prominent feature to avoid."}],"priority":"★★☆"},"related_words":{"derivatives":["furze (gorse)","furzy (covered with furze)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Furzery' is a niche word, primarily used in descriptive writing to denote a landscape dominated by furze (gorse). Its usage is rare, and understanding it requires familiarity with less common landscape terminology. It is unlikely to be encountered outside of literature or specialized contexts related to ecology or rural environments."},"example_sentences":[{"sentence":"The old map marked the area as a dangerous furzery.","translation":"古い地図はその地域を危険なヒースの原っぱとして示していた。","type":"noun","meaning_category":"place"},{"sentence":"The artist painted a vivid scene of the furzery in late summer.","translation":"その画家は晩夏のヒースの原っぱの鮮やかな風景を描いた。","type":"noun","meaning_category":"place"},{"sentence":"The wind howled across the desolate furzery.","translation":"風が荒涼としたヒースの原っぱを吹き荒れた。","type":"noun","meaning_category":"place"}]}