{"word":"FLB","priority":"☆☆☆","meanings":[{"part_of_speech":"acronym","definition":"(主にインターネットスラング) Failed Landing, Bro (着陸失敗、兄弟)","english_definition":"(Primarily internet slang) An abbreviation for \"Failed Landing, Bro\", used to indicate a failed attempt or action, often in a humorous context.","examples":[{"sentence":"He tried to do a backflip on his skateboard, but FLB.","translation":"彼はスケートボードでバックフリップをしようとしたが、失敗した。"},{"sentence":"FLB, I spilled coffee all over my keyboard.","translation":"やっちまった、キーボードにコーヒーをぶちまけてしまった。"}],"collocations":["FLB moment","epic FLB"],"synonyms":["fail","epic fail"],"antonyms":["win","success"]}],"etymology":{"value":"The acronym is derived from the initial letters of the phrase \"Failed Landing, Bro\". The \"Bro\" is often used as a general term of endearment or camaraderie, even when not addressing a male sibling.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛf.ɛlˈbiː/","syllables":"ef-el-bee"},"inflection":{},"usage_notes":{"explanation":"\"FLB\" is primarily used in online communication, such as forums, social media, and gaming environments. It is generally used informally and humorously to acknowledge a mistake or failure. The \"Bro\" part of the acronym adds a lighthearted and casual tone.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I got FLB on my test.","correct":"✓ I failed my test.","note":"FLB is very informal. Use \"failed\" in formal contexts."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'FLB' is a slang acronym primarily used online to indicate a failed attempt, often with a humorous tone. It is highly informal and not appropriate for formal communication. Understanding its meaning requires familiarity with internet slang and culture."},"example_sentences":[{"sentence":"I tried to fix the computer, but total FLB.","translation":"コンピュータを直そうとしたけど、完全に失敗した。","type":"acronym","meaning_category":"失敗"},{"sentence":"He attempted the trick shot, but it was a huge FLB.","translation":"彼はトリックショットを試みたが、大失敗だった。","type":"acronym","meaning_category":"失敗"}]}