{"word":"double-queue","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"二重待ち行列","english_definition":"A data structure that combines the properties of both a stack and a queue. Elements can be added or removed from either end.","examples":[{"sentence":"A double-queue allows for efficient insertion and deletion at both the head and tail.","translation":"二重待ち行列は、先頭と末尾の両方で効率的な挿入と削除を可能にします。"}],"collocations":["implement a double-queue","use a double-queue","double-queue data structure"],"synonyms":["deque","dequeue"],"antonyms":[]}],"etymology":{"value":"The term 'double-queue' is descriptive, indicating a queue-like structure that allows operations at both ends. It's often used interchangeably with 'deque' or 'dequeue', which are more common terms in computer science.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʌbəl kjuː/","syllables":"dou-ble queue"},"inflection":{},"usage_notes":{"explanation":"'Double-queue' is a less common term for what is more frequently referred to as a 'deque' (double-ended queue). It's a data structure that allows insertion and deletion of elements from both ends, combining features of both queues (FIFO) and stacks (LIFO). While 'double-queue' is understandable, 'deque' is the preferred and more widely recognized term in technical contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I implemented a double-queue using only arrays.","correct":"✓ I implemented a deque using only arrays.","note":"While 'double-queue' is understandable, 'deque' is the more standard term."}],"priority":"★★☆"},"related_words":{"derivatives":["deque","dequeue"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Double-queue' refers to a data structure that allows adding and removing items from both ends, similar to a 'deque'. It's a more advanced concept, typically encountered in computer science or programming contexts. While the term itself is descriptive, 'deque' is the more commonly used and recognized term in technical discussions."},"example_sentences":[{"sentence":"The double-queue was used to efficiently manage the history of commands.","translation":"二重待ち行列は、コマンドの履歴を効率的に管理するために使用されました。","type":"noun","meaning_category":"data structure"},{"sentence":"We can implement a double-queue using either linked lists or dynamic arrays.","translation":"連結リストまたは動的配列を使用して、二重待ち行列を実装できます。","type":"noun","meaning_category":"implementation"}]}