{"word":"Cystathionine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"シスタチオニン：含硫アミノ酸の一種で、メチオニン代謝の中間体。","english_definition":"A sulfur-containing amino acid that is an intermediate in methionine metabolism.","examples":[{"sentence":"Cystathionine is formed from homocysteine and serine.","translation":"シスタチオニンはホモシステインとセリンから生成される。"},{"sentence":"The enzyme cystathionine beta-synthase catalyzes the formation of cystathionine.","translation":"酵素シスタチオニンベータシンターゼはシスタチオニンの生成を触媒する。"}],"collocations":["cystathionine beta-synthase","cystathionine gamma-lyase","elevated cystathionine levels"],"synonyms":["None"],"antonyms":["None"]}],"etymology":{"value":"From 'cyst(e)ine' + 'thionine' (related to thionin, a sulfur-containing compound).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɪstəˈθaɪəˌniːn/","syllables":"Cys-ta-thi-o-nine"},"inflection":{"noun_plural":"cystathionines"},"usage_notes":{"explanation":"Cystathionine is a non-proteinogenic amino acid, meaning it is not directly incorporated into proteins during translation. It plays a crucial role in the transsulfuration pathway, which converts homocysteine to cysteine. Deficiencies in enzymes involved in cystathionine metabolism can lead to various metabolic disorders.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["cystathioninuria (名詞: シスタチオニン尿症)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な生化学・医学分野でのみ使用される。","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Cystathionine is a technical term used in biochemistry and medicine. It refers to a specific sulfur-containing amino acid involved in methionine metabolism. Understanding its role requires knowledge of metabolic pathways and enzyme functions. The term is primarily encountered in scientific literature and specialized medical contexts."},"example_sentences":[{"sentence":"The concentration of cystathionine in the plasma was significantly elevated in the patients with CBS deficiency.","translation":"CBS欠損症の患者では、血漿中のシスタチオニン濃度が有意に上昇していた。","type":"noun","meaning_category":"biochemistry"},{"sentence":"Cystathionine gamma-lyase cleaves cystathionine to produce cysteine, alpha-ketobutyrate, and ammonia.","translation":"シスタチオニンガンマリアーゼはシスタチオニンを切断して、システイン、アルファケト酪酸、およびアンモニアを生成する。","type":"noun","meaning_category":"biochemistry"}]}