{"word":"parfleshes","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"Rawhide containers or bags used by Native Americans, especially Plains Indians, for carrying food, clothing, and other personal belongings.","english_definition":"Containers or bags made from rawhide, typically used by Native Americans, especially Plains Indians, for transporting food, clothing, and personal items.","examples":[{"sentence":"The parfleshes were decorated with geometric designs.","translation":"パルフレッシュは幾何学模様で装飾されていました。"},{"sentence":"She packed her belongings into the parfleshes for the journey.","translation":"彼女は旅のために所持品をパルフレッシュに詰めました。"}],"collocations":["rawhide parfleshes","decorated parfleshes","packing parfleshes"],"synonyms":["rawhide bags","containers","pouches"],"antonyms":[]}],"etymology":{"value":"From French 'parfleche', alteration of 'pareflèche' (17th century), literally 'ward off arrow', from 'parer' (to ward off) + 'flèche' (arrow).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɑːrˌflɛʃɪz/","syllables":"par-flesh-es"},"inflection":{"noun_plural":"parfleshes"},"usage_notes":{"explanation":"'Parfleshes' refers specifically to rawhide containers used by Native Americans, particularly those of the Great Plains. They were durable and practical for nomadic lifestyles.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Parfleshes' is a specialized term related to Native American culture, specifically referring to rawhide containers. It is unlikely to be encountered in general English usage and is more commonly found in historical or anthropological contexts. Understanding the term requires knowledge of Native American material culture."},"example_sentences":[{"sentence":"The museum displayed a collection of antique parfleshes.","translation":"博物館にはアンティークのパルフレッシュのコレクションが展示されていました。","type":"noun","meaning_category":"containers"},{"sentence":"The parfleshes were essential for transporting goods across the plains.","translation":"パルフレッシュは平原を横断して物資を輸送するのに不可欠でした。","type":"noun","meaning_category":"containers"}]}