{"word":"unindexed","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"索引付けされていない、インデックスが作成されていない","english_definition":"Not indexed; lacking an index.","examples":[{"sentence":"The unindexed data made searching very slow.","translation":"索引付けされていないデータは、検索を非常に遅くした。"},{"sentence":"An unindexed book is difficult to navigate.","translation":"索引のない本は、ナビゲートするのが難しい。"},{"sentence":"We need to index these files, they are currently unindexed.","translation":"これらのファイルにインデックスを作成する必要があります。現在、インデックスが作成されていません。"}],"collocations":["unindexed data","unindexed files","unindexed documents","unindexed book","unindexed database"],"synonyms":["non-indexed"],"antonyms":["indexed"]},{"part_of_speech":"adjective","definition":"(検索エンジンなどによって)インデックス登録されていない","english_definition":"(Of a website or web page) not listed in a search engine's index.","examples":[{"sentence":"The new page is unindexed, so it won't appear in search results yet.","translation":"新しいページはインデックス登録されていないため、まだ検索結果には表示されません。"},{"sentence":"We need to submit the sitemap to get the website unindexed.","translation":"ウェブサイトのインデックス登録を解除するには、サイトマップを送信する必要があります。"},{"sentence":"An unindexed site has little chance of being found by users.","translation":"インデックス登録されていないサイトは、ユーザーに見つけられる可能性がほとんどありません。"}],"collocations":["unindexed website","unindexed page","unindexed site","unindexed content"],"synonyms":["not indexed","not crawled"],"antonyms":["indexed","crawled"]}],"etymology":{"value":"The word 'unindexed' is formed by adding the prefix 'un-' (meaning 'not') to the word 'indexed'.","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈɪndɛkst/","syllables":"un-in-dexed"},"inflection":{"notes":"This is an adjective and does not have different forms."},"usage_notes":{"explanation":"'Unindexed' typically refers to data, files, or websites that have not been processed to create an index. An index is a data structure that improves the speed of data retrieval operations on a database table at the cost of additional writes and storage space to maintain the index data structure. In the context of search engines, an unindexed website or page is one that the search engine has not yet crawled and added to its index, meaning it won't appear in search results.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unindex data was hard to find.","correct":"✓ The unindexed data was hard to find.","note":"The correct adjective is 'unindexed', not 'unindex'."}],"priority":"★★☆"},"related_words":{"derivatives":["index","indexing","indexer"],"related_terms":["search engine optimization (SEO)","crawling","indexing","search engine"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Unindexed' means that something hasn't been put into a list or system that helps you find it quickly. Imagine a library where the books aren't cataloged; that would be an 'unindexed' library, making it hard to find what you're looking for. In computers, it means files or websites aren't in a search engine's list, so people can't find them easily online. It's the opposite of 'indexed', which means something is in a searchable list or system."},"example_sentences":[{"sentence":"The search returned no results because the database was largely **unindexed**.","translation":"データベースがほとんど索引付けされていなかったため、検索結果は何も返されませんでした。","type":"adjective","meaning_category":"索引付けされていない"},{"sentence":"The website owner realized that many pages were **unindexed** by Google.","translation":"ウェブサイトの所有者は、多くのページがGoogleによってインデックス登録されていないことに気づきました。","type":"adjective","meaning_category":"インデックス登録されていない"},{"sentence":"Without proper indexing, the vast amount of **unindexed** information is practically useless.","translation":"適切なインデックス作成がなければ、膨大な量のインデックス化されていない情報は事実上役に立たない。","type":"adjective","meaning_category":"索引付けされていない"}]}