{"word":"Ricinine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"リシニン：トウゴマ（ヒマ）に含まれる有毒なアルカロイド","english_definition":"A toxic alkaloid found in the castor bean plant (Ricinus communis).","examples":[{"sentence":"Ricinine is less toxic than ricin.","translation":"リシニンはリシンよりも毒性が低い。"},{"sentence":"The presence of ricinine can be used to detect castor bean plants.","translation":"リシニンの存在は、トウゴマの検出に使用できる。"}],"collocations":["ricinine poisoning","detect ricinine"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from Ricinus, the genus name of the castor bean plant, plus the suffix -ine, commonly used for alkaloids.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈrɪsɪniːn/","syllables":"Ri-ci-nine"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Ricinine is an alkaloid found in all parts of the castor bean plant, but it is present in higher concentrations in the seeds. It is less toxic than ricin, another toxin found in castor beans. Ricinine is sometimes used as a biomarker to detect the presence of castor bean plants or their components.","priority":"☆☆☆"},"common_mistakes":{},"related_words":{"derivatives":["Ricin","Castor bean","Alkaloid"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Ricinine is a technical term related to chemistry and toxicology, specifically referring to a toxic alkaloid found in the castor bean plant. It is a relatively rare word, primarily encountered in scientific or technical contexts. Understanding requires familiarity with basic concepts in chemistry and plant biology."},"example_sentences":[{"sentence":"The study investigated the effects of ricinine on insect pests.","translation":"その研究は、リシニンが害虫に与える影響を調査した。","type":"noun","meaning_category":"toxic alkaloid"},{"sentence":"Ricinine levels were measured in various parts of the castor bean plant.","translation":"トウゴマの様々な部位におけるリシニンのレベルが測定された。","type":"noun","meaning_category":"toxic alkaloid"}]}