{"word":"anegado","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(主にスペイン語圏で使用)水没した、浸水した、水浸しの","english_definition":"(Primarily used in Spanish-speaking regions) flooded, submerged, waterlogged.","examples":[{"sentence":"El campo estaba anegado después de la lluvia torrencial.","translation":"The field was flooded after the torrential rain. (その畑は豪雨の後、水浸しだった。)"},{"sentence":"La ciudad quedó anegada por el desbordamiento del río.","translation":"The city was flooded by the overflowing river. (その都市は川の氾濫によって水没した。)"}],"collocations":["estar anegado (to be flooded)","campo anegado (flooded field)","zona anegada (flooded area)"],"synonyms":["inundado","sumergido","anegadizo"],"antonyms":["seco","desecado"],"related_words":["anegar (to flood)","anegamiento (flooding)"]}],"etymology":{"value":"Derived from the Spanish verb 'anegar,' which comes from the Latin 'negare' (to deny, refuse), with the prefix 'ad-' (to, towards). The semantic shift likely occurred from 'denying' the land its dryness by covering it with water.","priority":"N/A"},"pronunciation":{"ipa":"/aneˈɣaðo/ (Spanish)","syllables":"a-ne-ga-do"},"inflection":{"gender":"masculine","number":"singular"},"usage_notes":{"explanation":"'Anegado' is primarily used in Spanish to describe something that is covered or saturated with water, usually due to flooding or heavy rain. It is commonly used to describe fields, roads, or entire areas that are underwater. It is important to note that this word is not commonly used in English; the English equivalents are 'flooded,' 'submerged,' or 'waterlogged.'","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The anegado was very big.","correct":"The flood was very big. / The area was flooded.","note":"'Anegado' is not commonly used in English. Use 'flood' or 'flooded' instead."}],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency in English; high frequency in Spanish-speaking regions.","priority":"N/A"},"readability_explanation":{"level":"N/A","text":"'Anegado' is a Spanish word. If you are speaking English, use 'flooded' or 'waterlogged' instead. It describes a place that is covered in water, usually after heavy rain or a river overflowing."},"example_sentences":[{"sentence":"Después de la tormenta, el sótano estaba completamente anegado.","translation":"After the storm, the basement was completely flooded. (嵐の後、地下室は完全に水浸しだった。)"},{"sentence":"Las carreteras estaban anegadas y el tráfico era imposible.","translation":"The roads were flooded and traffic was impossible. (道路は水没しており、交通は不可能だった。)"}]}