{"word":"selfism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"利己主義、自己中心主義","english_definition":"The practice of basing morals on one's own self-interest; egoism.","examples":[{"sentence":"His selfism was apparent in his constant need to be the center of attention.","translation":"彼の自己中心主義は、常に注目を集めたいという欲求に明らかだった。"},{"sentence":"The company's culture promoted selfism, with employees prioritizing personal gain over teamwork.","translation":"その会社の文化は利己主義を助長し、従業員はチームワークよりも個人的な利益を優先していた。"}],"collocations":["pure selfism (純粋な利己主義)","blatant selfism (あからさまな利己主義)","promote selfism (利己主義を助長する)"],"synonyms":["egoism","selfishness","egotism","narcissism","self-centeredness"],"antonyms":["altruism","selflessness","benevolence","compassion"]}],"etymology":{"value":"\"Self\" + \"-ism\".","priority":"★★★"},"pronunciation":{"ipa":"/ˈsɛlfɪzəm/","syllables":"self-ism"},"inflection":{"noun_plural":"selfisms"},"usage_notes":{"explanation":"\"Selfism\" refers to the practice or belief of prioritizing one's own interests and well-being above those of others. It is often used negatively to describe behavior that is considered selfish or inconsiderate.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She practices selfism to take care of others.","correct":"✓ She practices selflessness to take care of others.","note":"\"Selfism\" means prioritizing oneself, while \"selflessness\" means prioritizing others."}],"priority":"★★☆"},"related_words":{"derivatives":["selfist (noun/adjective)"],"related_concepts":["egoism","selfishness","individualism"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Selfism\" is a more abstract term referring to the philosophical or behavioral tendency to prioritize one's own interests. It's less commonly used than \"selfishness\" but carries a similar negative connotation. Understanding the suffix \"-ism\" as denoting a belief system or practice helps in grasping the meaning."},"example_sentences":[{"sentence":"The politician's policies were criticized for promoting selfism and neglecting the needs of the poor.","translation":"その政治家の政策は、利己主義を助長し、貧困層のニーズを無視していると批判された。","type":"noun","meaning_category":"利己主義"},{"sentence":"In a society driven by selfism, cooperation and empathy become rare commodities.","translation":"利己主義に突き動かされた社会では、協力と共感は希少なものとなる。","type":"noun","meaning_category":"利己主義"},{"sentence":"Some argue that a degree of selfism is necessary for survival in a competitive world.","translation":"競争の激しい世界で生き残るためには、ある程度の利己主義が必要だと主張する人もいる。","type":"noun","meaning_category":"利己主義"}]}