{"word":"Pyramidellid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"トウガタガイ科の巻貝","english_definition":"Any marine snail of the family Pyramidellidae, characterized by their small, slender, turret-shaped shells. They are often ectoparasites on other marine invertebrates.","examples":[{"sentence":"Pyramidellids are known to be ectoparasites on various marine invertebrates.","translation":"トウガタガイ類は、さまざまな海洋無脊椎動物の外部寄生生物であることが知られています。"}],"collocations":["Pyramidellid snail","Pyramidellid gastropod"],"synonyms":["Eulimid","Turbonillid"],"antonyms":[]}],"etymology":{"value":"Derived from Pyramidellidae, the family name. Pyramidellidae comes from Pyramidella, a genus within the family, which is a diminutive of 'pyramis' (pyramid in Latin), referring to the shell shape.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɪrəˈmɪdɛlɪd/","syllables":"pi-ra-mid-el-lid"},"inflection":{"noun_plural":"Pyramidellids"},"usage_notes":{"explanation":"'Pyramidellid' refers to a specific type of small marine snail. They are distinguished by their parasitic lifestyle and their distinctive shell shape. The term is mainly used in marine biology and related fields.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I found a pyramidellid on the beach, it was very big.","correct":"✓ I found a pyramidellid on the beach, they are typically small.","note":"Pyramidellids are typically small, so describing one as 'very big' is unlikely. "},{"incorrect":"✗ Pyramidellid are a type of worm.","correct":"✓ Pyramidellids are a type of snail.","note":"Pyramidellids are snails (gastropods), not worms."}],"priority":"★★☆"},"related_words":{"derivatives":["Pyramidellidae (family)","Pyramidella (genus)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Pyramidellid' is a technical term used in marine biology to refer to a specific family of small, parasitic sea snails. Understanding this term requires familiarity with biological classification and marine ecosystems."},"example_sentences":[{"sentence":"The aquaculture farm suffered significant losses due to pyramidellid infestations on the shellfish.","translation":"その養殖場は、貝類へのトウガタガイ類の寄生により大きな損失を被った。","type":"noun","meaning_category":"marine biology"},{"sentence":"Researchers are studying the life cycle of pyramidellids to develop effective control strategies.","translation":"研究者たちは、効果的な防除戦略を開発するためにトウガタガイ類のライフサイクルを研究している。","type":"noun","meaning_category":"marine biology"}]}