{"word":"hijackers","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ハイジャック犯、乗っ取り犯","english_definition":"People who seize control of a vehicle, such as an airplane, bus, or ship, by force.","examples":[{"sentence":"The hijackers demanded a ransom for the passengers.","translation":"ハイジャック犯たちは乗客の身代金を要求した。"},{"sentence":"The plane was stormed by police, and the hijackers were arrested.","translation":"飛行機は警察によって突入され、ハイジャック犯たちは逮捕された。"},{"sentence":"The hijackers diverted the plane to another country.","translation":"ハイジャック犯たちは飛行機を別の国へ向かわせた。"}],"collocations":["plane hijackers (飛行機ハイジャック犯)","ship hijackers (船舶ハイジャック犯)","bus hijackers (バスハイジャック犯)","armed hijackers (武装したハイジャック犯)","the hijackers' demands (ハイジャック犯の要求)"],"synonyms":["skyjackers (飛行機の場合)","pirates (船舶の場合)","marauders"],"antonyms":["passengers","crew","victims"],"related_words":["hijack","hijacking"]}],"etymology":{"value":"The word 'hijacker' is derived from 'hijack', which originated in the United States in the 1920s. It initially referred to the theft of goods in transit, especially during Prohibition. The term was later applied to the seizure of airplanes, buses, and other vehicles.","priority":"★★☆"},"pronunciation":{"ipa":"ˈhaɪˌdʒækərz","syllables":"hi-jack-ers"},"inflection":{"noun_plural":"hijackers"},"usage_notes":{"explanation":"'Hijackers' refers specifically to the individuals who carry out the act of hijacking. The term implies the use of force or coercion to take control of a vehicle or other property. It is often used in the context of criminal activity and terrorism.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The hijacker was many.","correct":"✓ There were many hijackers.","note":"'Hijacker' is a countable noun, so it needs a plural form ('hijackers') when referring to multiple individuals. The sentence structure also needs adjustment."},{"incorrect":"✗ The hijackers was arrested.","correct":"✓ The hijackers were arrested.","note":"When referring to multiple hijackers, use the plural verb 'were' instead of 'was'."}],"priority":"★★☆"},"related_words":{"derivatives":["hijack (verb/noun)","hijacking (noun)"],"phrases":["hostage situation","takeover","seize control","forced landing"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent but commonly understood in news and media.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Hijackers' refers to the people who illegally take control of a vehicle, usually an airplane, bus, or ship, using force. This word is commonly used in news reports about such events. It is important to understand that 'hijackers' are committing a serious crime that endangers the lives of others. The word is often associated with terrorism or other forms of violent crime."},"example_sentences":[{"sentence":"The police negotiated with the **hijackers** for hours.","translation":"警察は何時間もハイジャック犯と交渉した。","type":"general"},{"sentence":"The **hijackers** threatened to harm the passengers if their demands were not met.","translation":"ハイジャック犯は、要求が満たされない場合、乗客に危害を加えると脅した。","type":"general"},{"sentence":"Security measures at airports have been increased to prevent **hijackers** from boarding planes.","translation":"ハイジャック犯が飛行機に搭乗するのを防ぐため、空港のセキュリティ対策が強化された。","type":"security"},{"sentence":"The **hijackers** were eventually overpowered by the passengers and crew.","translation":"ハイジャック犯は最終的に乗客と乗務員によって制圧された。","type":"resolution"}]}