{"word":"glandulous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"腺状の、腺質の、腺の多い","english_definition":"Resembling a gland; bearing glands; full of glands.","examples":[{"sentence":"The plant has glandulous hairs on its stem.","translation":"その植物は茎に腺毛がある。"},{"sentence":"The surface of the leaf is glandulous.","translation":"その葉の表面は腺質である。"}],"collocations":["glandulous tissue","glandulous epithelium"],"synonyms":["adenoid","glandular"],"antonyms":[]}],"etymology":{"value":"From Latin glandula, diminutive of glans, acorn.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡlændʒələs/","syllables":"glan-du-lous"},"inflection":{"notes":"Adjective, comparative and superlative forms are more glandulous, most glandulous, or more glandlike, most glandlike."},"usage_notes":{"explanation":"'Glandulous' is primarily a botanical and medical term. It describes something that either resembles a gland or is characterized by having many glands. It's not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The skin was glandulous.","correct":"✓ The skin was glandular.","note":"'Glandular' is a more common and general term to describe something related to glands. 'Glandulous' is more specific, often referring to the presence of many small glands or gland-like structures."}],"priority":"★★☆"},"related_words":{"derivatives":["gland","glandular","glandularity"],"related_terms":["adenoid","lymph node"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'glandulous' is a technical term primarily used in botany and medicine. It describes something that is either similar to a gland or has many glands. Due to its specialized usage, it is not commonly encountered in general English. Understanding requires a good vocabulary of scientific and medical terms."},"example_sentences":[{"sentence":"The plant's leaves were covered in tiny, glandulous hairs.","translation":"その植物の葉は、小さな腺毛で覆われていた。","type":"adjective","meaning_category":"腺の多い"},{"sentence":"The glandulous nature of the tissue was evident under microscopic examination.","translation":"その組織の腺質の性質は、顕微鏡検査で明らかだった。","type":"adjective","meaning_category":"腺質の"}]}