{"word":"spanless","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Lacking a span; not having a measurable or significant extent or reach.","english_definition":"Not having a span; without a measurable or significant extent or reach.","examples":[{"sentence":"The spanless void stretched before them, an abyss of nothingness.","translation":"彼らの前には、広がりを持たない虚無が広がっており、無の深淵であった。"},{"sentence":"The project was spanless in its ambition, lacking any practical boundaries.","translation":"そのプロジェクトは、その野心において広がりがなく、現実的な境界を欠いていた。"}],"collocations":["spanless void","spanless ambition","spanless reach"],"synonyms":["unmeasurable","boundless","limitless","immeasurable","unlimited"],"antonyms":["spanned","measurable","limited","bounded"]}],"etymology":{"value":"Formed from 'span' (a unit of measurement or extent) and the suffix '-less' (meaning without).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈspænləs/","syllables":"span-less"},"inflection":{"notes":"Comparative and superlative forms are not commonly used.","adjective_forms":{"comparative":null,"superlative":null}},"usage_notes":{"explanation":"'Spanless' is a relatively rare word, typically used in literary or descriptive contexts to emphasize the absence of measurable extent or reach. It often carries a sense of vastness or limitlessness, particularly when describing abstract concepts or metaphorical spaces.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bridge was spanless.","correct":"✓ The bridge had a short span.","note":"'Spanless' implies the complete absence of a span, which wouldn't apply to a bridge. Use 'short span' or 'small span' instead."},{"incorrect":"✗ The spanless bridge connected the two shores.","correct":"✓ The long bridge connected the two shores.","note":"A bridge, by definition, has a span. Use 'long' or another adjective to describe the span's length."}],"priority":"★★☆"},"related_words":{"derivatives":["span (noun)","span (verb)","-less (suffix)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Spanless' is a rare and sophisticated word used to describe something that lacks a measurable extent or reach. It is often found in literary or philosophical contexts to convey a sense of boundlessness or limitlessness. Because of its rarity and abstract usage, it is generally suitable for advanced learners of English."},"example_sentences":[{"sentence":"The artist sought to capture the spanless quality of the night sky.","translation":"そのアーティストは、夜空の広がりを持たない性質を捉えようとした。","type":"adjective","meaning_category":"Lacking a span"},{"sentence":"Her imagination was spanless, capable of conjuring worlds beyond comprehension.","translation":"彼女の想像力は広がりがなく、理解を超えた世界を思い描くことができた。","type":"adjective","meaning_category":"Lacking a span"}]}