{"word":"lyricisation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"歌詞化、歌詞をつけること、歌詞にすること","english_definition":"The act or process of turning something into lyrics, or adding lyrics to something.","examples":[{"sentence":"The lyricisation of the poem transformed it into a popular song.","translation":"その詩の歌詞化は、それを人気のある歌に変えた。"},{"sentence":"The band focused on the lyricisation of their instrumental tracks.","translation":"そのバンドは、インストゥルメンタルのトラックに歌詞をつけることに集中した。"}],"collocations":["lyricisation of a poem","lyricisation of instrumental music"],"synonyms":["lyricization","setting to music","adaptation into song"],"antonyms":["instrumentalization","de-lyricisation"]},{"part_of_speech":"noun","definition":"叙情詩化、叙情的にすること","english_definition":"The act of making something lyrical or expressing it in a lyrical manner.","examples":[{"sentence":"The lyricisation of the narrative made it more emotionally resonant.","translation":"その物語の叙情詩化は、より感情的に共鳴するようにした。"},{"sentence":"The director aimed for a lyricisation of everyday life in the film.","translation":"その監督は、映画の中で日常を叙情的に表現することを目指した。"}],"collocations":["lyricisation of a narrative","lyricisation of everyday life"],"synonyms":["lyricization","poeticization","romanticization"],"antonyms":["realism","depoeticization"]}],"etymology":{"value":"Derived from 'lyricise' (or 'lyricize'), which comes from 'lyric' (a short poem expressing personal emotion) + '-ise' (or '-ize', a suffix used to form verbs indicating action or process) + '-ation' (a suffix used to form nouns indicating a process or result).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌlɪrɪsaɪˈzeɪʃən/","syllables":"ly-ri-ci-sa-tion"},"inflection":{"noun_plural":"lyricisations"},"usage_notes":{"explanation":"'Lyricisation' refers to the process of adding lyrics to a piece of music or adapting a non-lyrical work into a lyrical format. It can also refer to making something more lyrical or poetic in style. The term is relatively uncommon, with 'lyricization' being a more frequently used variant.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lyricisation was done by the composer himself.","correct":"✓ The lyricisation was done by the lyricist.","note":"The person who writes the lyrics is typically called a 'lyricist', not a 'composer', although a composer might also write lyrics."}],"priority":"★★☆"},"related_words":{"derivatives":["lyricise","lyricize","lyrical","lyricist","lyrics"],"phrases":["lyrical adaptation","song adaptation"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lyricisation' is a relatively advanced term that describes the process of adding lyrics to music or making something more lyrical or poetic. It's often used in discussions about music, poetry, and artistic adaptation. The word itself is not commonly encountered in everyday language, but understanding its meaning can be helpful in analyzing and appreciating various forms of art.","note":"This word is not commonly used, so its readability is relatively low."},"example_sentences":[{"sentence":"The lyricisation of the folk tune gave it a wider appeal.","translation":"その民謡の歌詞化は、より広い層へのアピールをもたらした。","type":"general","meaning_category":"歌詞化"},{"sentence":"The play's lyricisation of grief was deeply moving.","translation":"その劇の悲しみの叙情的な表現は、深く感動的だった。","type":"general","meaning_category":"叙情詩化"}]}