{"word":"unimmanent","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(哲学)内住的でない、内在しない、超越的な","english_definition":"Not immanent; not remaining within or limited to the subject or agent; transcending the self.","examples":[{"sentence":"The concept of an unimmanent God suggests a deity that exists outside of the universe.","translation":"非内在的な神の概念は、宇宙の外に存在する神を示唆する。"},{"sentence":"His unimmanent thoughts were focused on matters beyond the physical world.","translation":"彼の超越的な思考は、物理的な世界を超えた事柄に集中していた。"}],"collocations":["unimmanent cause","unimmanent being","unimmanent principle"],"synonyms":["transcendent","external","otherworldly","objective"],"antonyms":["immanent","intrinsic","inherent","subjective"]}],"etymology":{"value":"From the prefix 'un-' (not) + 'immanent' (remaining within).","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnˈɪmənənt/","syllables":"un-im-ma-nent"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more unimmanent' and 'most unimmanent', respectively."},"usage_notes":{"explanation":"'Unimmanent' is primarily a philosophical term, often used in discussions of theology, metaphysics, and epistemology. It describes something that is not contained within or limited to a particular subject, mind, or system. It is the opposite of 'immanent', which refers to something that is inherent or intrinsic.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unimmanent energy flowed through the room.","correct":"✓ The transcendent energy flowed through the room.","note":"'Unimmanent' is not typically used to describe energy; 'transcendent' might be a better fit if the intent is to convey that the energy is beyond the physical."}],"priority":"★☆☆"},"related_words":{"derivatives":["immanent","immanence","transcendence","transcendent"],"antonyms":["immanent"],"related_concepts":["transcendentalism","theology","metaphysics","epistemology"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency. Primarily found in philosophical and theological texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unimmanent' is a high-level philosophical term that means 'not immanent' or 'transcendent'. It is used to describe something that exists outside of or beyond a particular subject, mind, or system. This word is rarely used outside of philosophical or theological contexts, and understanding it requires familiarity with related concepts such as immanence and transcendence."},"example_sentences":[{"sentence":"The philosopher argued that God is an unimmanent being, existing outside the confines of human understanding.","translation":"その哲学者は、神は人間の理解の範囲外に存在する非内在的な存在であると主張した。","type":"adjective","meaning_category":"Philosophical"},{"sentence":"Unlike immanent forces, unimmanent influences originate from beyond the observable universe.","translation":"内在的な力とは異なり、非内在的な影響は観測可能な宇宙の外から生じる。","type":"adjective","meaning_category":"Philosophical"}]}