{"word":"smoke-vomiting","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"The act of vomiting smoke, typically used in fantasy or metaphorical contexts.","english_definition":"The act of vomiting smoke, usually in a fictional or figurative sense.","examples":[{"sentence":"The dragon, wounded and enraged, began smoke-vomiting, filling the cavern with a choking haze.","translation":"傷つき激怒したドラゴンは、煙を吐き出し始め、洞窟を窒息させるような霞で満たした。"},{"sentence":"After the argument, he felt like he was smoke-vomiting all the anger he had bottled up.","translation":"口論の後、彼は溜め込んでいた怒りをすべて煙のように吐き出しているように感じた。"}],"collocations":["begin smoke-vomiting","smoke-vomiting dragon","metaphorical smoke-vomiting"],"synonyms":["spewing smoke","smoke regurgitation","smoke emission"],"antonyms":["N/A"]}],"etymology":{"value":"A compound word formed from 'smoke' (the visible suspension of carbon or other particles in air, typically after combustion) and 'vomiting' (the forceful expulsion of the contents of one's stomach through the mouth). The combination suggests a forceful expulsion of smoke.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsmoʊkˌvɒmɪtɪŋ/","syllables":"smoke-vom-it-ing"},"inflection":{"noun_plural":"smoke-vomitings"},"usage_notes":{"explanation":"The term 'smoke-vomiting' is not a standard or widely recognized word in the English language. It is primarily used in creative writing, particularly in fantasy or science fiction, to describe a creature or character expelling smoke from their mouth in a manner similar to vomiting. It can also be used metaphorically to describe the forceful expression of anger or other intense emotions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The car was smoke-vomiting after the accident.","correct":"✓ The car was emitting smoke after the accident.","note":"In real-world scenarios, use 'emitting smoke' or 'releasing smoke' instead of 'smoke-vomiting' to describe vehicles or machines. 'Smoke-vomiting' is best reserved for fictional or metaphorical contexts."}],"priority":"★☆☆"},"related_words":{"derivatives":["smoke (noun)","vomiting (noun)"],"phrasal_verbs":["N/A"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - not a standard term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Smoke-vomiting' is a compound word, not commonly found in everyday language. Its meaning is relatively straightforward, combining the concepts of 'smoke' and 'vomiting.' It is primarily used in creative or descriptive writing to evoke a vivid image of something forcefully expelling smoke. Due to its specialized usage, it is more likely to be encountered by advanced readers of literature.","priority":"★★☆"},"example_sentences":[{"sentence":"The ancient volcano, dormant for centuries, stirred and began smoke-vomiting into the twilight sky.","translation":"何世紀も休眠していた古代の火山が動き出し、夕暮れの空に煙を吐き出し始めた。","type":"noun","meaning_category":"descriptive"},{"sentence":"In his nightmare, he was smoke-vomiting words of hatred and regret.","translation":"彼の悪夢の中で、彼は憎しみと後悔の言葉を煙のように吐き出していた。","type":"noun","meaning_category":"metaphorical"}]}