{"word":"apomorphia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"アポモルヒネ：モルヒネを脱水して得られる化合物。催吐薬、パーキンソン病治療薬として使用される。","english_definition":"A synthetic morphine derivative, formed by dehydration, used as an emetic and in the treatment of Parkinson's disease.","examples":[{"sentence":"Apomorphia is used to treat Parkinson's disease.","translation":"アポモルヒネはパーキンソン病の治療に使われます。"},{"sentence":"Apomorphia can be administered as an injection.","translation":"アポモルヒネは注射で投与できます。"}],"collocations":["apomorphia injection","apomorphia hydrochloride"],"synonyms":["emetic","anti-Parkinson drug"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の apo- (離れて) + morphine (モルヒネ)に由来。モルヒネから派生した化合物であることを示す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæpoʊˈmɔːrfiə/","syllables":"a-po-mor-phi-a"},"inflection":{"noun_plural":"apomorphias"},"usage_notes":{"explanation":"Apomorphia is primarily known as a drug used in the treatment of Parkinson's disease. It acts as a dopamine receptor agonist. It is also used as an emetic, though less commonly now.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★★★"},"related_words":{"derivatives":["apomorphic (形容詞: 派生的な、アポモルフィーを示す)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Apomorphia is a specialized term primarily encountered in medical or pharmaceutical contexts. Understanding its usage requires familiarity with organic chemistry and pharmacology. The term refers to a specific chemical compound used for particular medical treatments, notably in neurology and emergency medicine for specific conditions. It is not a word commonly used in general conversation."},"example_sentences":[{"sentence":"The patient was given an apomorphia injection to manage their Parkinson's symptoms.","translation":"患者はパーキンソン病の症状を管理するためにアポモルヒネ注射を投与された。","type":"noun","meaning_category":"パーキンソン病治療薬"},{"sentence":"Apomorphia acts as a dopamine receptor agonist in the brain.","translation":"アポモルヒネは脳内でドーパミン受容体アゴニストとして作用する。","type":"noun","meaning_category":"薬剤"}]}