{"word":"dislady","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(slang, humorous) A woman who is considered to be unattractive, unkempt, or generally undesirable.","english_definition":"(slang, humorous) A woman who is considered to be unattractive, unkempt, or generally undesirable.","examples":[{"sentence":"She was acting like a total dislady at the party, spilling drinks and making a mess.","translation":"彼女はパーティーでまるでダメな女みたいに振る舞って、飲み物をこぼしたり散らかしたりしていた。"},{"sentence":"Don't be such a dislady! Clean yourself up before we go out.","translation":"そんなみっともない女みたいな格好しないで！出かける前に身なりを整えなさい。"}],"collocations":["act like a dislady","be a dislady","total dislady"],"synonyms":["messy woman","unattractive woman","slob","unfeminine woman"],"antonyms":["lady","classy woman","well-groomed woman"]}],"etymology":{"value":"A blend of 'dis-' (prefix indicating negation or disapproval) and 'lady'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɪsleɪdi/","syllables":"dis-la-dy"},"inflection":{"noun_plural":"disladies"},"usage_notes":{"explanation":"'Dislady' is a slang term, often used humorously or disparagingly, to describe a woman who is perceived as lacking traditional feminine qualities, being unkempt, or behaving in an unrefined manner. It is important to use this term with caution, as it can be offensive. The term is not widely recognized or used.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He called her a dislady because she was smart.","correct":"✓ He called her a dislady because she was messy and didn't care about her appearance.","note":"The term 'dislady' is typically used to describe a woman's appearance or behavior, not her intelligence or other positive qualities."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"None (slang)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Dislady' is a slang term, not commonly found in formal contexts. It is used to describe a woman in a derogatory or humorous way, suggesting she lacks the qualities traditionally associated with being a 'lady'. Due to its potentially offensive nature and limited usage, it is important to understand the context before using or interpreting this term."},"example_sentences":[{"sentence":"She showed up to the formal dinner looking like a total dislady.","translation":"彼女はきちんとした夕食会に、まるでみっともない女のような格好で現れた。","type":"noun","meaning_category":"unattractive woman"},{"sentence":"He jokingly called his friend a dislady because she was eating messy.","translation":"彼は友人がだらしなく食べていたので、冗談で彼女をみっともない女と呼んだ。","type":"noun","meaning_category":"unattractive woman"}]}