{"word":"Hebrews","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"ヘブライ人、ヘブライ語","english_definition":"A member of an ancient people living in what is now Israel and Palestine and, according to tradition, descended from the patriarch Jacob; the language of the ancient Hebrews.","examples":[{"sentence":"The Hebrews were enslaved in Egypt.","translation":"ヘブライ人はエジプトで奴隷にされていた。"},{"sentence":"Ancient Hebrew is a Semitic language.","translation":"古代ヘブライ語はセム語族の言語である。"}],"collocations":["ancient Hebrews","modern Hebrew","Hebrew Bible","Hebrew language"],"synonyms":["Israelites","Jews"],"antonyms":[]},{"part_of_speech":"noun","definition":"ヘブライ人への手紙（新約聖書の一書）","english_definition":"A book of the New Testament, traditionally attributed to the Apostle Paul.","examples":[{"sentence":"He studied the Book of Hebrews in seminary.","translation":"彼は神学校でヘブライ人への手紙を研究した。"}],"collocations":["Book of Hebrews","Letter to the Hebrews"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Old French Hebreu, from Late Latin Hebraeus, from Greek Hebraios, from Aramaic 'ebhrai, from Hebrew 'ibhri 'one from beyond', referring to Abraham, who came from beyond the Euphrates.","priority":"N/A"},"pronunciation":{"ipa":"/ˈhiːbruːz/","syllables":"He-brews"},"inflection":{"noun_plural":"Hebrews"},"usage_notes":{"explanation":"'Hebrews' can refer to the ancient people, the Hebrew language, or the New Testament book. Context is crucial to understanding the intended meaning. When referring to the ancient people, it is often used interchangeably with 'Israelites' or 'Jews', although there are nuances in historical and religious contexts.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"He speaks Hebrew fluently. I met a Hebrew yesterday.","correct":"He speaks Hebrew fluently. I met a Hebrew person/an Israeli yesterday.","note":"While 'Hebrew' can refer to a person, it's more common to use 'Hebrew person' or, if they are from Israel, 'Israeli'."}],"priority":"N/A"},"related_words":{"derivatives":["Hebraic (adjective): relating to the Hebrews or their language or culture","Hebraism (noun): a Hebrew idiom or characteristic"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"N/A","text":"The term 'Hebrews' is typically encountered in historical, religious, or linguistic contexts. Understanding its various meanings requires familiarity with these subjects."},"example_sentences":[{"sentence":"The history of the Hebrews is recorded in the Old Testament.","translation":"ヘブライ人の歴史は旧約聖書に記録されている。","type":"noun","meaning_category":"Ancient people"},{"sentence":"He is studying modern Hebrew at the university.","translation":"彼は大学で現代ヘブライ語を学んでいる。","type":"noun","meaning_category":"Language"},{"sentence":"The Letter to the Hebrews explores the relationship between Judaism and Christianity.","translation":"ヘブライ人への手紙は、ユダヤ教とキリスト教の関係を探求している。","type":"noun","meaning_category":"New Testament book"}]}