{"word":"pseudopapal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"偽の教皇の、教皇らしくない、教皇の権威を装った","english_definition":"Falsely appearing to be papal; pretending to be or resembling the pope or papal authority.","examples":[{"sentence":"The antipope established a pseudopapal court in Avignon.","translation":"対立教皇はアヴィニョンに偽の教皇庁を設立した。"},{"sentence":"His pronouncements had a pseudopapal tone, though he held no such office.","translation":"彼はそのような地位を持っていなかったが、彼の声明は教皇のような口調だった。"}],"collocations":["pseudopapal authority","pseudopapal pronouncements","pseudopapal claims"],"synonyms":["antipapal","counter-papal","mock-papal"],"antonyms":["papal","pontifical"]}],"etymology":{"value":"\"pseudo-\" (偽の) + \"papal\" (教皇の)","priority":"★★★"},"pronunciation":{"ipa":"ˌsjuːdoʊˈpeɪpəl","syllables":"pseu-do-pa-pal"},"inflection":{"notes":"変化なし"},"usage_notes":{"explanation":"\"Pseudopapal\" is typically used to describe something that imitates or falsely claims to be associated with the Pope or the papacy. It often carries a negative connotation, implying illegitimacy or a lack of genuine authority.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pseudopapal decree was accepted by all.","correct":"✓ The pseudopapal decree was rejected by most.","note":"Pseudopapal implies illegitimacy, so it's unlikely to be widely accepted."}],"priority":"★☆☆"},"related_words":{"derivatives":["pseudopope (名詞: 偽の教皇、対立教皇)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"pseudopapal\" is a highly specialized term, primarily used in historical or religious contexts to describe something falsely claiming to be associated with the Pope. Understanding requires familiarity with religious history and terminology. It's not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The historian described the antipope's actions as driven by pseudopapal ambition.","translation":"歴史家は、対立教皇の行動は偽の教皇としての野心に駆り立てられたものだと述べた。","type":"adjective","meaning_category":"教皇の権威を装った"},{"sentence":"The document was dismissed as a pseudopapal forgery.","translation":"その文書は偽の教皇による偽造文書として却下された。","type":"adjective","meaning_category":"偽の教皇の"}]}