{"word":"Andalusian-inspired","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"アンダルシア風の、アンダルシアの影響を受けた","english_definition":"Inspired by or characteristic of Andalusia, a region in southern Spain known for its rich history, Moorish influence, flamenco music, and unique architecture.","examples":[{"sentence":"The restaurant features Andalusian-inspired cuisine with a modern twist.","translation":"そのレストランは、現代的なアレンジを加えたアンダルシア風の料理を特徴としています。"},{"sentence":"The courtyard was designed with an Andalusian-inspired fountain and tilework.","translation":"中庭は、アンダルシア風の噴水とタイル細工でデザインされました。"},{"sentence":"The collection showcases Andalusian-inspired dresses with vibrant colors and intricate patterns.","translation":"そのコレクションは、鮮やかな色と複雑なパターンを持つアンダルシア風のドレスを展示しています。"}],"collocations":["Andalusian-inspired architecture","Andalusian-inspired cuisine","Andalusian-inspired design","Andalusian-inspired decor","Andalusian-inspired music","Andalusian-inspired style"],"synonyms":["Moorish-inspired","Spanish-inspired","Mediterranean-inspired"],"antonyms":[]}],"etymology":{"value":"Combines \"Andalusian\" (referring to Andalusia, a region of Spain) with \"inspired\" (meaning influenced or stimulated by).","priority":"N/A"},"pronunciation":{"ipa":"/ˌændəˈluːʒən ɪnˈspaɪərd/","syllables":"An-da-lu-sian in-spi-red"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"\"Andalusian-inspired\" is used to describe something that takes elements from the culture, art, architecture, or style of Andalusia. This can include specific design features like courtyards, fountains, tilework, and Moorish arches, as well as culinary elements like the use of olive oil, seafood, and spices. It suggests an aesthetic or thematic connection to the region.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The building is inspired of Andalusian architecture.","correct":"✓ The building is inspired by Andalusian architecture.","note":"Use 'inspired by' to indicate the source of inspiration."}],"priority":"N/A"},"related_words":{"derivatives":["Andalusia","Andalusian"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term \"Andalusian-inspired\" describes something that draws inspiration from the region of Andalusia in Spain. Andalusia is known for its unique blend of cultures, including Moorish influences, which are often reflected in its architecture, art, and cuisine. Therefore, \"Andalusian-inspired\" suggests a design or style that incorporates these elements, such as intricate tilework, arched doorways, or the use of vibrant colors. This term is more commonly used in contexts related to design, travel, and culture."},"example_sentences":[{"sentence":"The hotel's decor is Andalusian-inspired, featuring intricate tilework and vibrant colors.","translation":"ホテルの内装はアンダルシア風で、複雑なタイル細工と鮮やかな色が特徴です。","type":"adjective","meaning_category":"デザイン"},{"sentence":"We enjoyed a delicious Andalusian-inspired meal with fresh seafood and local wines.","translation":"新鮮なシーフードと地元のワインを使った、美味しいアンダルシア風の食事を楽しみました。","type":"adjective","meaning_category":"料理"},{"sentence":"The artist's latest collection is Andalusian-inspired, showcasing the region's rich cultural heritage.","translation":"アーティストの最新コレクションはアンダルシア風で、その地域の豊かな文化遺産を表現しています。","type":"adjective","meaning_category":"芸術"}]}