{"word":"unretinued","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(人)が、従者や家来を伴わない、付き添いのない","english_definition":"Not having a retinue; without attendants or followers.","examples":[{"sentence":"The king traveled unretinued through the countryside.","translation":"王は従者を伴わずに田舎を旅した。"},{"sentence":"She arrived at the party unretinued, preferring to mingle anonymously.","translation":"彼女は付き添いなしでパーティーに到着し、匿名で交流することを好んだ。"}],"collocations":["travel unretinued","arrive unretinued","appear unretinued"],"synonyms":["unaccompanied","unattended","solitary","alone"],"antonyms":["retinued","attended","accompanied"]},{"part_of_speech":"adjective","definition":"(物事)が、取り巻きや装飾のない、簡素な","english_definition":"Without the usual or expected accompaniment or ornamentation.","examples":[{"sentence":"The performance was unretinued, focusing solely on the actor's skill.","translation":"そのパフォーマンスは飾り気がなく、俳優のスキルのみに焦点が当てられていた。"},{"sentence":"He presented the facts unretinued, without embellishment or bias.","translation":"彼は事実を飾り立てたり偏見を持ったりすることなく、ありのままに提示した。"}],"collocations":["unretinued performance","unretinued facts","unretinued presentation"],"synonyms":["unadorned","plain","simple","austere"],"antonyms":["ornate","embellished","decorated"]}],"etymology":{"value":"\"Un-\" (not) + \"retinued\" (having a retinue). \"Retinue\" comes from the Old French word \"retenue,\" meaning \"body of retainers,\" from \"retenir\" (to retain).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌn.rɪˈtjuːnd/","syllables":"un-re-ti-nued"},"inflection":{"notes":"Adjective, so it can be used with adverbs of degree (e.g., very unretinued). Comparative and superlative forms (more unretinued, most unretinued) are possible, but less common."},"usage_notes":{"explanation":"\"Unretinued\" is a relatively uncommon word, primarily used in formal or literary contexts. It describes someone or something lacking the expected or usual attendants, followers, or embellishments. It often implies a deliberate choice to be without these things, or a situation where they are absent due to circumstance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unretinued of the king was surprising.","correct":"✓ The absence of a retinue for the king was surprising.","note":"\"Unretinued\" is an adjective, not a noun. You can't use it as the subject of a sentence in the same way you would use \"retinue.\" Instead, use a phrase like \"the absence of a retinue.\""},{"incorrect":"✗ He felt very unretinued at the party.","correct":"✓ He felt very alone at the party.","note":"While \"unretinued\" implies being without attendants, it doesn't directly translate to feeling lonely. Use \"alone\" or \"isolated\" to describe feelings of loneliness."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_adjectives":["unaccompanied","unattended","solitary","plain","simple","austere"],"related_nouns":["retinue","entourage","followers","attendants"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unretinued\" is a formal and uncommon term. It describes the state of being without a retinue, which is a group of attendants or followers. You'll typically find it in historical or literary contexts to emphasize the solitary or unadorned nature of a person or event. Because it's not a frequently used word, it's more likely to be encountered in advanced reading materials."},"example_sentences":[{"sentence":"The queen, preferring solitude, often walked unretinued in the palace gardens.","translation":"女王は孤独を好んだため、しばしば従者を伴わずに宮殿の庭を散歩した。","type":"adjective","meaning_category":"without attendants"},{"sentence":"The presentation of the evidence was unretinued, focusing solely on the facts.","translation":"証拠の提示は飾り気がなく、事実のみに焦点が当てられていた。","type":"adjective","meaning_category":"without ornamentation"}]}