{"word":"moltenly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"溶けて、溶融して、溶けたように","english_definition":"In a molten manner; as if molten.","examples":[{"sentence":"The lava flowed moltenly down the volcano's side.","translation":"溶岩は溶けたように火山の側面を流れ下った。"},{"sentence":"The metal glowed moltenly in the furnace.","translation":"金属は炉の中で溶けて光っていた。"}],"collocations":[],"synonyms":["liquefiedly","fusedly"],"antonyms":["solidly","frozenly"]}],"etymology":{"value":"Derived from the adjective 'molten' (meaning melted or liquefied by heat) with the addition of the adverbial suffix '-ly'. The word 'molten' comes from the past participle of the Middle English word 'melten' (to melt), which itself comes from the Old English word 'meltan'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmoʊltənli/","syllables":"mol-ten-ly"},"inflection":{"notes":"Adverb, no comparative or superlative forms."},"usage_notes":{"explanation":"'Moltenly' is a relatively rare adverb used to describe something happening in a molten or liquefied manner. It is most often used in descriptive writing, particularly when discussing volcanic activity, metalworking, or other processes involving high heat and melting. It emphasizes the flowing, liquid nature of the substance being described.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sun shone moltenly on the beach.","correct":"✓ The sun shone brightly on the beach.","note":"'Moltenly' specifically refers to something that is melted. Use 'brightly' or another appropriate adverb to describe the sun's shining. "},{"incorrect":"✗ She spoke moltenly about her passion.","correct":"✓ She spoke passionately about her passion.","note":"'Moltenly' refers to a physical state of being melted. Use 'passionately' to describe intense emotion."}],"priority":"★☆☆"},"related_words":{"derivatives":["molten (adjective)","melt (verb)","meltingly (adverb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Very rare, not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Moltenly' is a rare and specialized adverb. It's used to describe something happening in a way that resembles a melted substance. Because of its limited use, it is not commonly encountered and is more likely to be found in technical or descriptive writing related to geology, metallurgy, or similar fields. Understanding the base word 'molten' is essential to understanding 'moltenly'."},"example_sentences":[{"sentence":"The glassblower shaped the moltenly glowing glob into a delicate vase.","translation":"ガラス職人は、溶けて光る塊を繊細な花瓶の形に成形した。","type":"descriptive","meaning_category":"溶けて"},{"sentence":"The steel poured moltenly from the crucible into the mold.","translation":"鋼は溶けている状態でるつぼから鋳型へと流れ込んだ。","type":"descriptive","meaning_category":"溶融して"}]}