{"word":"close-fertilization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"自家受精","english_definition":"The fertilization of a plant with its own pollen.","examples":[{"sentence":"Close-fertilization is common in some plant species.","translation":"自家受精は一部の植物種では一般的です。"}],"collocations":["undergo close-fertilization (自家受精を行う)"],"synonyms":["self-fertilization","autogamy"],"antonyms":["cross-fertilization","allogamy"]}],"etymology":{"value":"Derived from 'close' meaning near or related, and 'fertilization', the process of fertilizing an egg, female animal, or plant, involving the fusion of male and female gametes to form a zygote.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌkloʊsˌfɜːrtɪlaɪˈzeɪʃən/","syllables":"close-fer-ti-li-za-tion"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Close-fertilization, also known as self-fertilization or autogamy, is a process where a plant fertilizes itself using its own pollen. This reproductive strategy is common in plants that are isolated or live in environments where cross-pollination is difficult.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"Close fertilization occurs when two different plants fertilize each other.","correct":"Close fertilization occurs when a plant fertilizes itself.","note":"Close fertilization is self-fertilization, not fertilization between different plants."}],"priority":"☆☆☆"},"related_words":{"derivatives":["close-fertilized (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":null,"priority":"☆☆☆"},"readability_explanation":{"level":null,"text":"Close-fertilization is a scientific term that describes the process where a plant fertilizes itself. It's not a commonly used term in everyday conversation, but it's important in biology and botany.","priority":"☆☆☆"},"example_sentences":[{"sentence":"Some plants have evolved mechanisms to prevent close-fertilization.","translation":"一部の植物は、自家受精を防ぐためのメカニズムを進化させてきた。","type":"general","meaning_category":"general"},{"sentence":"Close-fertilization can lead to reduced genetic diversity in plant populations.","translation":"自家受精は、植物個体群の遺伝的多様性の低下につながる可能性がある。","type":"general","meaning_category":"general"}]}