{"word":"girlery","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"少女たち、少女の世界、少女らしさ","english_definition":"Girls collectively; the world of girls; things associated with girls.","examples":[{"sentence":"The play was full of girlery, with its focus on friendships and first crushes.","translation":"その劇は、友情や初めての恋に焦点を当てており、少女らしさで満ち溢れていた。"},{"sentence":"She decorated her room with all sorts of girlery, from pink posters to stuffed animals.","translation":"彼女はピンクのポスターからぬいぐるみまで、あらゆる少女らしいもので部屋を飾った。"}],"collocations":["girlishness","girlhood","femininity"],"synonyms":["femaleness","maidenhood"],"antonyms":["boyhood","masculinity"]}],"etymology":{"value":"'Girl' + '-ery'. The suffix '-ery' is used to form nouns denoting a place of business or a collection of things.","priority":"★★☆"},"pronunciation":{"ipa":"ˈɡɜːrləri","syllables":"girl-er-y"},"inflection":{"noun_plural":"girlerys"},"usage_notes":{"explanation":"'Girlery' is a relatively uncommon word. It refers to girls as a group or the qualities, interests, or things associated with girls. It is often used to describe something that is particularly feminine or related to the experiences of girls.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was impressed by the girlery of the situation.","correct":"✓ He was impressed by the girlishness of the situation.","note":"'Girlishness' is a more common and widely understood term for the quality of being like a girl."}],"priority":"★☆☆"},"related_words":{"derivatives":["girlish","girlie"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"None","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Girlery' is a rare word that describes things associated with girls. It's not commonly used, so it's best to use more common words like 'girlishness' or 'femininity' instead."},"example_sentences":[{"sentence":"The store was filled with girlery, from sparkly dresses to colorful accessories.","translation":"その店は、キラキラしたドレスからカラフルなアクセサリーまで、少女らしいものでいっぱいだった。","type":"noun","meaning_category":"少女らしさ"},{"sentence":"The film explored the complexities of girlery in modern society.","translation":"その映画は、現代社会における少女らしさの複雑さを探求した。","type":"noun","meaning_category":"少女の世界"}]}