{"word":"bioavailability","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"生物学的利用能、バイオアベイラビリティ","english_definition":"the proportion of a drug or other substance which enters the circulation when introduced into the body and so is able to have an active effect.","examples":[{"sentence":"The bioavailability of the drug was significantly increased when taken with food.","translation":"その薬の生物学的利用能は、食事と一緒に摂取すると大幅に増加した。"},{"sentence":"Factors affecting bioavailability include the route of administration and the drug's formulation.","translation":"生物学的利用能に影響を与える要因には、投与経路と薬の製剤が含まれる。"},{"sentence":"Low bioavailability can limit the effectiveness of certain medications.","translation":"低い生物学的利用能は、特定の薬の効果を制限する可能性がある。"}],"collocations":["high bioavailability (高い生物学的利用能)","low bioavailability (低い生物学的利用能)","oral bioavailability (経口バイオアベイラビリティ)","relative bioavailability (相対的バイオアベイラビリティ)","absolute bioavailability (絶対的バイオアベイラビリティ)","increase bioavailability (生物学的利用能を上げる)","decrease bioavailability (生物学的利用能を下げる)","affect bioavailability (生物学的利用能に影響を与える)","bioavailability studies (生物学的利用能試験)"],"synonyms":["absorption","assimilation","uptake","pharmacokinetics"],"antonyms":["excretion","elimination"]},{"part_of_speech":"noun","definition":"(より広義に)栄養素などが体内で利用される割合","english_definition":"(more broadly) the degree to which a nutrient or other substance is absorbed and becomes available at the site of physiological activity in the body.","examples":[{"sentence":"The bioavailability of iron from plant-based sources is lower than from animal sources.","translation":"植物由来の鉄の生物学的利用能は、動物由来のものよりも低い。"},{"sentence":"Vitamin D bioavailability is enhanced by the presence of fat in the diet.","translation":"ビタミンDの生物学的利用能は、食事中の脂肪の存在によって高められる。"},{"sentence":"Understanding the bioavailability of nutrients is crucial for optimizing dietary intake.","translation":"栄養素の生物学的利用能を理解することは、食事摂取量を最適化するために重要である。"}],"collocations":["nutrient bioavailability (栄養素の生物学的利用能)","mineral bioavailability (ミネラルの生物学的利用能)","vitamin bioavailability (ビタミンの生物学的利用能)","increase nutrient bioavailability (栄養素の生物学的利用能を上げる)","improve bioavailability (生物学的利用能を改善する)"],"synonyms":["absorbability","digestibility","utilization","bioaccessibility"],"antonyms":["non-absorption","non-utilization"]}],"etymology":{"value":"'Bio-' (life) + 'available' (able to be used) + '-ity' (state or condition). The term combines the concepts of biological systems and the availability of a substance for use within those systems.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbaɪ.oʊ.əˌveɪləˈbɪlɪti/","syllables":"bi-o-a-vail-a-bil-i-ty"},"inflection":{"noun_plural":"bioavailabilities (まれに複数形で使われる)"},"usage_notes":{"explanation":"'Bioavailability' refers to the extent and rate at which an active drug ingredient or nutrient is absorbed from a drug product or dietary supplement and becomes available at the site of action in the body. It is a key parameter in pharmacokinetics and nutritional science. It is affected by various factors including the route of administration, the formulation of the substance, and individual physiological characteristics.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The bioavailability is good in the test tube.","correct":"✓ The drug shows good solubility in the test tube.","note":"Bioavailability refers to the substance's behavior *in vivo* (within a living organism), not *in vitro* (in a test tube). Solubility, stability, or other properties can be assessed *in vitro*."},{"incorrect":"✗ Bioavailability is the same as bioequivalence.","correct":"✓ Bioavailability is related to, but not the same as, bioequivalence.","note":"Bioavailability measures the rate and extent of absorption, while bioequivalence compares the bioavailability of different formulations of the same drug."},{"incorrect":"✗ High bioavailability always means better efficacy.","correct":"✓ High bioavailability doesn't always mean better efficacy; other factors are also important.","note":"While bioavailability is important, efficacy also depends on factors like target site concentration, receptor binding, and downstream effects."}],"priority":"★★☆"},"related_words":{"derivatives":["bioavailable (adjective)"],"phrases":["absolute bioavailability","relative bioavailability","oral bioavailability","first-pass effect","pharmacokinetics","pharmacodynamics"],"priority":"★★★"},"level_frequency":{"CEFR":"C1-C2 (専門用語)","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 医学、薬学、栄養学などの専門分野でよく使われる。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Bioavailability' is a technical term used primarily in medicine, pharmacology, and nutrition. It describes how much of a drug or nutrient gets into the bloodstream and is available to have an effect on the body. Several factors influence bioavailability, such as how the substance is administered (e.g., orally, intravenously), its chemical properties, and individual differences in metabolism. Understanding bioavailability is essential for determining appropriate dosages and maximizing the effectiveness of treatments or dietary interventions.","priority":"★★☆"},"example_sentences":[{"sentence":"The **bioavailability** of this new drug is being studied in clinical trials.","translation":"この新薬の生物学的利用能は臨床試験で研究されている。","type":"noun","meaning_category":"薬学"},{"sentence":"The **bioavailability** of iron can be increased by consuming it with vitamin C.","translation":"鉄の生物学的利用能は、ビタミンCと一緒に摂取することで高めることができる。","type":"noun","meaning_category":"栄養学"},{"sentence":"The intravenous route provides 100% **bioavailability**.","translation":"静脈内投与経路は100％の生物学的利用能を提供する。","type":"noun","meaning_category":"薬学"},{"sentence":"The researchers are investigating the factors that affect the **bioavailability** of this compound.","translation":"研究者たちは、この化合物の生物学的利用能に影響を与える要因を調査している。","type":"noun","meaning_category":"科学研究"}]}