{"word":"verrucosities","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)いぼ状の隆起、疣贅（ゆうぜい）","english_definition":"plural form of verrucosity: small wart-like projections or elevations on a surface.","examples":[{"sentence":"The surface of the leaf exhibited numerous verrucosities.","translation":"その葉の表面には多数のいぼ状の隆起が見られた。"},{"sentence":"The doctor noted the presence of verrucosities on the patient's skin.","translation":"医師は患者の皮膚に疣贅の存在を認めた。"}],"collocations":["cutaneous verrucosities (皮膚の疣贅)","valvular verrucosities (弁膜の疣贅)"],"synonyms":["warts","papules","nodules","excrescences"],"antonyms":[]}],"etymology":{"value":"Derived from 'verrucosity', which comes from the Latin word 'verrucosus', meaning 'full of warts' or 'warty'. 'Verruca' itself is the Latin word for 'wart'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌvɛrʊˈkɒsɪtiz/","syllables":"ver-ru-cos-i-ties"},"inflection":{"noun_plural":"verrucosities"},"usage_notes":{"explanation":"'Verrucosities' refers specifically to multiple wart-like projections or small, rough elevations. It is often used in medical or botanical contexts to describe the texture or appearance of a surface.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The verrucosities was observed on the leaf.","correct":"✓ The verrucosities were observed on the leaf.","note":"'Verrucosities' is a plural noun, so it requires a plural verb ('were')."},{"incorrect":"✗ He had a verrucosities on his hand.","correct":"✓ He had a verrucosity on his hand. / ✓ He had verrucosities on his hand.","note":"'Verrucosities' is plural; the singular form is 'verrucosity'. If referring to multiple warts, use the plural form."}],"priority":"★★☆"},"related_words":{"derivatives":["verruca (noun: a wart)","verrucous (adjective: warty, covered with warts)","verrucosity (noun: the state of being verrucose; a wart-like projection)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'verrucosities' is a highly technical term primarily used in medical and botanical fields. It refers to multiple small, wart-like projections or elevations on a surface. Due to its specialized nature, it is rarely encountered in general conversation or writing. Understanding this term requires a strong grasp of scientific vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"Microscopic examination revealed numerous verrucosities on the inner lining of the cyst.","translation":"顕微鏡検査により、嚢胞の内壁に多数の疣贅が認められた。","type":"noun","meaning_category":"いぼ状の隆起"},{"sentence":"The stem of the plant is characterized by prominent verrucosities.","translation":"その植物の茎は顕著な疣贅によって特徴づけられる。","type":"noun","meaning_category":"いぼ状の隆起"}]}