{"word":"appanaged","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"封土を与えられた、財産分与を受けた","english_definition":"Endowed with an appanage; having received an appanage.","examples":[{"sentence":"The appanaged prince was granted vast lands and resources.","translation":"封土を与えられた王子は、広大な土地と資源を与えられた。"},{"sentence":"Appanaged members of the royal family often held significant power within the kingdom.","translation":"財産分与を受けた王室のメンバーは、しばしば王国内で重要な権力を持っていた。"}],"collocations":["appanaged prince","appanaged member","appanaged estate"],"synonyms":["endowed","granted","invested","allotted","assigned"],"antonyms":["disinherited","deprived","unendowed"]}],"etymology":{"value":"The word \"appanaged\" comes from the noun \"appanage,\" which originates from the Old French word \"apanage,\" meaning \"provision for younger children.\" This, in turn, comes from \"apaner,\" meaning \"to endow.\" The root is \"a-\" (to) + \"panis\" (bread), signifying providing sustenance or livelihood.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈpænɪdʒd/","syllables":"ap-pan-aged"},"inflection":{"notes":"This is the past participle form used as an adjective."},"usage_notes":{"explanation":"\"Appanaged\" is a relatively rare word used to describe someone who has been granted an appanage, typically a younger son or member of a royal family. The term is most often found in historical or legal contexts. It implies a formal allocation of land or resources to provide for the person's maintenance and status.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The appanaged land was very appanaged.","correct":"✓ The appanaged land was very fertile.","note":"The word \"appanaged\" describes the *recipient* of the appanage, not the appanage itself. It is incorrect to use it to describe the qualities of the land or property. Instead, use descriptive adjectives like 'fertile,' 'vast,' or 'rich.'"},{"incorrect":"✗ He was appanaged with great honor.","correct":"✓ He was appanaged with vast lands.","note":"The word \"appanaged\" implies the provision of material resources, typically land or revenue. It is incorrect to use it with abstract concepts like 'honor.'"}],"priority":"★★☆"},"related_words":{"derivatives":["appanage (noun: 封土、財産分与)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Very rare - not typically included in CEFR vocabulary lists)","frequency_google_ngram":"非常に低頻度 (Extremely low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"appanaged\" is a highly specialized and rare term, primarily used in historical or legal contexts to describe someone who has been granted an appanage. An appanage is a provision, typically land or revenue, made for the maintenance of a younger son or member of a royal family. Due to its limited usage and specific historical connotation, it is considered an advanced vocabulary word and is not commonly encountered. Understanding requires familiarity with historical social structures and legal terminology.","priority":"★☆☆"},"example_sentences":[{"sentence":"The appanaged duke controlled a significant portion of the kingdom's resources.","translation":"封土を与えられた公爵は、王国の資源の重要な部分を管理していた。","type":"adjective","meaning_category":"封土を与えられた"},{"sentence":"As an appanaged member of the family, she was entitled to a substantial income from the estate.","translation":"財産分与を受けた家族の一員として、彼女はその地所からのかなりの収入を得る権利があった。","type":"adjective","meaning_category":"財産分与を受けた"}]}