{"word":"being-in-the-world","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"世界内存在 (せかいないそんざい): 人間存在の本質的なあり方を指す哲学的な概念で、単に世界の中に「存在する」のではなく、世界と深く関わり、世界の中で意味を生成し、世界によって影響を受ける存在のあり方を意味する。主にマルティン・ハイデッガーの哲学で用いられる。","english_definition":"(Philosophy) A philosophical concept, primarily associated with Martin Heidegger, referring to the essential way in which human beings exist. It emphasizes that humans do not merely exist 'in' the world as objects, but are fundamentally engaged with and shaped by the world, creating meaning within it.","examples":[{"sentence":"ハイデッガーは『存在と時間』の中で、世界内存在という概念を用いて人間存在の根本的な構造を分析した。","translation":"In *Being and Time*, Heidegger used the concept of being-in-the-world to analyze the fundamental structure of human existence."},{"sentence":"世界内存在の理解は、人間が世界から切り離された主体ではなく、常に世界との関係性の中で自己を形成していることを示唆する。","translation":"Understanding being-in-the-world suggests that humans are not subjects separated from the world, but are constantly forming themselves in relation to it."}],"collocations":["世界内存在の構造 (the structure of being-in-the-world)","世界内存在の分析 (the analysis of being-in-the-world)","世界内存在の概念 (the concept of being-in-the-world)","世界内存在の理解 (the understanding of being-in-the-world)"],"synonyms":["現存在 (Dasein, ダーザイン): ハイデッガー哲学における人間存在を指す言葉で、世界内存在と密接に関連する。","実存 (existence): 人間が自己の存在の意味を問い、選択し、責任を負うという存在のあり方。"],"antonyms":["客観的存在 (objective existence): 世界から独立して存在する客観的な事物や事実。","主観的存在 (subjective existence): 個人の意識や経験に依存する存在。"]}],"etymology":{"value":"この言葉は、ドイツ語の『In-der-Welt-Sein』を英語に翻訳したもので、ハイデッガーの哲学の中心概念である。ハイデッガーは、この言葉を用いて、人間存在が単に世界の中に物理的に存在するというだけでなく、世界と深く関わり、世界によって規定されるという存在のあり方を表現した。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbiːɪŋ ɪn ðə ˈwɜːld/","syllables":"be-ing in the world"},"inflection":{"notes":"名詞であり、複数形は通常用いられない。"},"usage_notes":{"explanation":"「**being-in-the-world**」は、哲学、特に実存主義の文脈で用いられる専門用語です。日常会話で使われることはほとんどありません。この概念は、人間存在が世界から切り離されたものではなく、常に世界との関係性の中で自己を形成しているという考え方を強調します。ハイデッガーの哲学を理解する上で重要な概念であり、『存在と時間』などの著作を読む際には必須の知識となります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Being in the world is the same as existing.","correct":"✓ Being-in-the-world is not simply existing, but being fundamentally engaged with the world.","note":"「being-in-the-world」は単なる存在ではなく、世界との関わりを強調する概念です。"},{"incorrect":"✗ Only humans have being-in-the-world.","correct":"✓ The concept of being-in-the-world is primarily applied to human existence in Heidegger's philosophy.","note":"この概念は主に人間存在に適用されますが、他の存在にも拡張して議論されることがあります。"}],"priority":"★★☆"},"related_words":{"derivatives":["Dasein (ダーザイン): ドイツ語で「現存在」を意味し、ハイデッガー哲学における人間存在を指す。","thrownness (投げ込み): 人間が自分の意志とは無関係に、ある特定の状況や世界に「投げ込まれる」という概念。","facticity (事実性): 人間が存在する上での避けられない事実や制約。","authenticity (真正性): 自己の可能性を認識し、責任を持って自己を形成すること。","inauthenticity (非真正性): 他者の期待や社会的な規範に盲従し、自己の可能性を放棄すること。"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (哲学分野の専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - 哲学の専門用語であり、一般的な文脈ではほとんど使用されない。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**being-in-the-world (世界内存在)**」は、哲学、特にマルティン・ハイデッガーの著作で使われる専門的な言葉です。これは、人間がただ世界に「いる」のではなく、世界と深く関わり、世界によって形作られる存在であることを意味します。この言葉は、人間が世界から切り離された主体ではなく、常に世界との関係の中で自分自身を理解する必要があるという考え方を表しています。哲学の文脈以外ではほとんど使われません。"},"example_sentences":[{"sentence":"Heidegger's concept of **being-in-the-world** emphasizes the interconnectedness of humans and their environment.","translation":"ハイデッガーの世界内存在の概念は、人間と彼らの環境との相互連結性を強調している。","type":"noun","meaning_category":"哲学"},{"sentence":"Understanding **being-in-the-world** requires recognizing that we are always already situated within a particular context.","translation":"世界内存在を理解するには、私たちが常にすでに特定の文脈の中に位置づけられていることを認識する必要がある。","type":"noun","meaning_category":"哲学"},{"sentence":"The experience of anxiety can reveal the fundamental structure of **being-in-the-world**.","translation":"不安の経験は、世界内存在の根本的な構造を明らかにする可能性がある。","type":"noun","meaning_category":"哲学"}]}