{"word":"Pokeweed","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ヨウシュヤマゴボウ","english_definition":"A tall, herbaceous plant with poisonous berries, belonging to the family Phytolaccaceae.","examples":[{"sentence":"Pokeweed berries are poisonous to humans.","translation":"ヨウシュヤマゴボウの実は人間にとって有毒です。"},{"sentence":"The birds eat pokeweed berries without any apparent harm.","translation":"鳥はヨウシュヤマゴボウの実を害もなく食べます。"}],"collocations":["pokeweed berry","pokeweed root","American pokeweed"],"synonyms":["inkberry","pigeonberry","poke"],"antonyms":[]},{"part_of_speech":"noun","definition":"ヨウシュヤマゴボウの葉を食用とする料理","english_definition":"A dish made from the leaves of the pokeweed plant, typically boiled.","examples":[{"sentence":"In some parts of the Southern United States, pokeweed is eaten as a spring green.","translation":"アメリカ合衆国南部の一部地域では、ヨウシュヤマゴボウは春の青菜として食べられています。"},{"sentence":"Preparing pokeweed properly is essential to remove the toxins.","translation":"毒素を取り除くためには、ヨウシュヤマゴボウを適切に調理することが不可欠です。"}],"collocations":["pokeweed salad","boiled pokeweed"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Poke' is derived from the Algonquian word for the plant. 'Weed' is a common suffix for wild plants.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpoʊkwiːd/","syllables":"poke-weed"},"inflection":{"noun_plural":"pokeweeds"},"usage_notes":{"explanation":"Pokeweed is a plant with both poisonous and edible parts. The berries and roots are poisonous, while the young leaves can be eaten if properly prepared. It's important to identify the plant correctly and cook it thoroughly to remove toxins before consumption.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate the pokeweed berries and now I feel sick.","correct":"✓ Pokeweed berries are poisonous and should not be eaten.","note":"Pokeweed berries are toxic and should not be consumed. Eating them can lead to illness."}],"priority":"★★☆"},"related_words":{"derivatives":["Phytolacca americana (scientific name)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pokeweed' refers to a specific plant, known scientifically as Phytolacca americana. It's not a commonly used word, so it's unlikely to be encountered in everyday conversation unless discussing botany or foraging. The plant has both poisonous and edible parts, requiring careful identification and preparation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The vibrant purple berries of the pokeweed stood out against the green foliage.","translation":"ヨウシュヤマゴボウの鮮やかな紫色の実が、緑の葉の中で際立っていた。","type":"noun","meaning_category":"plant"},{"sentence":"Some traditional recipes call for boiling pokeweed leaves multiple times to remove toxins.","translation":"伝統的なレシピの中には、毒素を取り除くためにヨウシュヤマゴボウの葉を何度も茹でるものがある。","type":"noun","meaning_category":"dish"}]}