{"word":"trough-fed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Fed from a trough; especially, overfed or fattened.","english_definition":"Fed from a trough; especially, overfed or fattened.","examples":[{"sentence":"The trough-fed pigs were ready for market.","translation":"桶で飼育された豚は市場に出す準備ができていた。"},{"sentence":"He criticized the trough-fed politicians who were out of touch with the common people.","translation":"彼は一般の人々と疎遠な、過剰に利益を得ている政治家たちを批判した。"}],"collocations":["trough-fed pigs","trough-fed cattle","trough-fed politicians"],"synonyms":["overfed","fattened","pampered"],"antonyms":["underfed","starved"]}],"etymology":{"value":"Combination of 'trough' (a long, narrow open container for animals to eat or drink from) and 'fed' (past participle of 'feed'). The term often carries a negative connotation, implying excessive feeding or benefiting from a source without deserving it.","priority":"N/A"},"pronunciation":{"ipa":"/ˈtrɒfˌfɛd/","syllables":"trough-fed"},"inflection":{},"usage_notes":{"explanation":"'Trough-fed' literally means 'fed from a trough,' but it often carries a figurative meaning, suggesting that someone is excessively benefiting from a particular source, often undeservedly. It is commonly used to describe animals that are fattened for slaughter or, metaphorically, people (especially politicians or those in positions of power) who are seen as greedy or corrupt.","priority":"N/A"},"common_mistakes":{},"related_words":{"derivatives":["trough"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The word 'trough-fed' is relatively uncommon and may not be familiar to many English speakers. It is often used in a figurative sense to criticize someone who is seen as benefiting excessively or unfairly from a particular source. Understanding the literal meaning of 'trough' (a feeding container for animals) is essential for grasping the figurative meaning of 'trough-fed.'"},"example_sentences":[{"sentence":"The trough-fed cattle were noticeably larger than those grazing in the pasture.","translation":"桶で飼育された牛は、牧草地で放牧されている牛よりも明らかに大きかった。","type":"literal","meaning_category":"animal husbandry"},{"sentence":"The journalist accused the senator of being a trough-fed politician, enriching himself at the public's expense.","translation":"ジャーナリストは、その上院議員が国民の犠牲の上に私腹を肥やす、過剰に利益を得ている政治家だと非難した。","type":"figurative","meaning_category":"politics"}]}