{"word":"unbuxom","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(女性が)ふくよかでない、豊満でない、魅力的なふっくらさがない","english_definition":"(of a woman) not buxom; lacking plumpness or attractiveness associated with a full figure.","examples":[{"sentence":"She was described as unbuxom, with a slender, almost boyish figure.","translation":"彼女はふくよかではなく、細身でほとんど少年のような体型だと描写された。"}],"collocations":["unbuxom figure","unbuxom appearance"],"synonyms":["slim","slender","thin","underdeveloped","lacking curves"],"antonyms":["buxom","plump","curvaceous","well-developed"]},{"part_of_speech":"adjective","definition":"(一般的に)魅力的でない、魅惑的でない","english_definition":"(generally) not attractive or alluring.","examples":[{"sentence":"The unbuxom style of the dress did little to flatter her figure.","translation":"そのふっくらさを強調しないドレスのスタイルは、彼女の体型をほとんど引き立てなかった。"}],"collocations":["unbuxom style","unbuxom design"],"synonyms":["unattractive","unalluring","plain","unappealing"],"antonyms":["attractive","alluring","appealing"]}],"etymology":{"value":"\"Un-\" (not) + \"buxom\". \"Buxom\" originally meant obedient or yielding, then came to mean healthy and robust, and eventually specifically referred to a full-figured woman. Therefore, \"unbuxom\" means the opposite of that.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈbʌksəm/","syllables":"un-bux-om"},"inflection":{"adjective_forms":{"comparative":"more unbuxom","superlative":"most unbuxom"}},"usage_notes":{"explanation":"\"Unbuxom\" is primarily used to describe a woman who does not have a full, curvaceous figure. It can also be used more generally to describe something that is not attractive or appealing. The word is relatively uncommon and may be considered somewhat dated or even offensive, depending on the context and audience. It is often used in contrast to the more common and positive term \"buxom.\"","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unbuxom man walked down the street.","correct":"✓ The slender man walked down the street.","note":"\"Unbuxom\" is almost exclusively used to describe women, not men. Use \"slender\", \"thin\", or another appropriate adjective for men."},{"incorrect":"✗ She found the dress to be unbuxom.","correct":"✓ She found the dress to be unflattering.","note":"If you mean the dress is not flattering, use \"unflattering\" instead of \"unbuxom\". \"Unbuxom\" describes the style or design, not the feeling about the dress."}],"priority":"★☆☆"},"related_words":{"derivatives":["buxom (adjective)","buxomly (adverb)","buxomness (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Unbuxom\" is a relatively rare and somewhat old-fashioned word. It describes a woman who is not full-figured or curvaceous, lacking the qualities traditionally associated with the term \"buxom.\" Because of its specificity and potential to be considered insensitive, it's not a word commonly encountered in everyday language. Understanding its meaning requires familiarity with the term \"buxom\" and an understanding of how prefixes like \"un-\" negate the meaning of the base word."},"example_sentences":[{"sentence":"The fashion magazine featured an unbuxom model in its latest editorial.","translation":"そのファッション雑誌は最新の特集でふくよかでないモデルを起用した。","type":"adjective","meaning_category":"ふくよかでない"},{"sentence":"Her unbuxom figure was a stark contrast to the voluptuous women in the paintings.","translation":"彼女のふくよかでない体型は、絵画の中の豊満な女性たちとは対照的だった。","type":"adjective","meaning_category":"ふくよかでない"},{"sentence":"The dress's unbuxom design did little to enhance her shape.","translation":"そのドレスのふっくらさを強調しないデザインは、彼女の体型をほとんど引き立てなかった。","type":"adjective","meaning_category":"魅力的でない"}]}