{"word":"piezocrystallization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"圧電結晶化：圧力を利用して結晶を成長させるプロセス","english_definition":"A process of crystal growth that utilizes pressure.","examples":[{"sentence":"Piezocrystallization is used to create crystals with specific properties.","translation":"圧電結晶化は、特定の特性を持つ結晶を作成するために使用されます。"},{"sentence":"The rate of piezocrystallization can be controlled by adjusting the pressure.","translation":"圧電結晶化の速度は、圧力を調整することで制御できます。"}],"collocations":["crystal growth","pressure-induced crystallization","material science"],"synonyms":["pressure crystallization"],"antonyms":[]}],"etymology":{"value":"The term combines \"piezo-\" (from Greek 'piezein' meaning to press or squeeze, referring to pressure) with \"crystallization\" (the process of forming crystals).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpaɪˌiːzoʊkrɪstələˈzeɪʃən/","syllables":"pi-e-zo-cris-tal-li-za-tion"},"inflection":{"noun_plural":"piezocrystallizations"},"usage_notes":{"explanation":"Piezocrystallization is a technique used in materials science and chemistry to control the formation of crystals by applying pressure. This method can influence the size, shape, and orientation of the resulting crystals.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["piezoelectric","crystallization","crystal"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Piezocrystallization is a specialized term used in materials science and chemistry. It refers to the process of using pressure to induce and control the formation of crystals. The term is derived from \"piezo-\" relating to pressure and \"crystallization\" referring to the crystal formation process. Understanding this term requires a background in materials science or a related field."},"example_sentences":[{"sentence":"The researchers investigated the effects of piezocrystallization on the mechanical properties of the material.","translation":"研究者たちは、圧電結晶化が材料の機械的特性に及ぼす影響を調査しました。","type":"noun","meaning_category":"圧電結晶化"},{"sentence":"Piezocrystallization allows for the creation of highly ordered crystalline structures.","translation":"圧電結晶化により、高度に秩序化された結晶構造の作成が可能になります。","type":"noun","meaning_category":"圧電結晶化"}]}