{"word":"museography","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"博物館学、博物館運営学、博物館技術","english_definition":"the study and practice of organizing, managing, and designing museums and exhibitions.","examples":[{"sentence":"Museography encompasses the principles of museum design, conservation, and education.","translation":"博物館学は、博物館のデザイン、保存、教育の原則を包含する。"},{"sentence":"The course provides an introduction to the theory and practice of museography.","translation":"このコースは、博物館学の理論と実践への入門を提供する。"},{"sentence":"Advances in museography have led to more engaging and interactive museum experiences.","translation":"博物館学の進歩は、より魅力的でインタラクティブな博物館体験につながっている。"}],"collocations":["principles of museography","theory of museography","practice of museography","contemporary museography","digital museography"],"synonyms":["museum studies","curatorship","exhibition design"],"antonyms":[]},{"part_of_speech":"noun","definition":"博物館の設計と展示技術","english_definition":"the art and technique of designing and arranging museum exhibitions.","examples":[{"sentence":"Effective museography can enhance the visitor's understanding and appreciation of the artifacts.","translation":"効果的な博物館の設計と展示技術は、訪問者の工芸品に対する理解と評価を高めることができる。"},{"sentence":"The museography of the new wing focused on creating a narrative flow through the exhibits.","translation":"新館の博物館の設計と展示技術は、展示を通して物語の流れを作り出すことに焦点を当てた。"},{"sentence":"Innovative museography techniques are used to present the collection in a fresh and engaging way.","translation":"革新的な博物館の設計と展示技術が、コレクションを新鮮で魅力的な方法で提示するために使用されている。"}],"collocations":["innovative museography","effective museography","exhibition museography","display museography"],"synonyms":["exhibition design","display techniques","museum presentation"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'mouseion' (museum) and 'graphia' (writing, description).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmjuːziˈɒɡrəfi/","syllables":"mu-se-og-ra-phy"},"inflection":{"noun_plural":"museographies"},"usage_notes":{"explanation":"Museography refers to the practical aspects of museum work, including exhibition design, conservation, and visitor experience. It is often used interchangeably with museum studies, but museography tends to focus more on the technical and practical skills required to run a museum, while museum studies is a broader academic field.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She studied museology.","correct":"✓ She studied museography. / ✓ She studied museum studies.","note":"Museology is a related but distinct field, often referring to the theory and philosophy of museums, while museography is more about the practical aspects. Museum studies is a broader term encompassing both. The terms are sometimes used interchangeably, but it's important to be aware of the subtle differences."}],"priority":"★★☆"},"related_words":{"derivatives":["museographer (noun: a person who studies or practices museography)"],"phrasal_verbs":[],"related_terms":["museum","exhibition","curator","archivist","conservation"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Museography is a specialized term referring to the study and practice of organizing and designing museums and exhibitions. It involves understanding the principles of museum design, conservation, and education to create engaging and informative experiences for visitors. This term is typically encountered in academic or professional contexts related to museums and cultural heritage.","priority":"★★☆"},"example_sentences":[{"sentence":"The professor specialized in the history and theory of museography.","translation":"その教授は博物館学の歴史と理論を専門としていた。","type":"noun","meaning_category":"博物館学"},{"sentence":"The exhibit's success was due to its innovative museography.","translation":"その展示の成功は、革新的な博物館の設計と展示技術のおかげだった。","type":"noun","meaning_category":"博物館の設計と展示技術"},{"sentence":"The museum offers a course in contemporary museography.","translation":"その博物館は現代博物館学のコースを提供している。","type":"noun","meaning_category":"博物館学"},{"sentence":"She is a leading expert in digital museography.","translation":"彼女はデジタル博物館学の第一人者である。","type":"noun","meaning_category":"博物館学"}]}