{"word":"Formica","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"メラミン樹脂化粧板、メラミンフォーム","english_definition":"A laminated plastic material used for countertops and other surfaces.","examples":[{"sentence":"The kitchen countertop was made of Formica.","translation":"キッチンのカウンタートップはフォルミカ製だった。"},{"sentence":"Formica is a durable and easy-to-clean surface.","translation":"フォルミカは耐久性があり、掃除が簡単な表面材だ。"}],"collocations":["Formica countertop","Formica table","Formica surface"],"synonyms":["laminate","plastic laminate","melamine resin"],"antonyms":[]},{"part_of_speech":"noun","definition":"(固有名詞) フォルミカ社 (積層プラスチック製造会社)","english_definition":"(trademark) A brand name for a laminated plastic. Also, the company that manufactures it.","examples":[{"sentence":"We bought Formica for our new kitchen.","translation":"新しいキッチンにフォルミカ社の製品を買った。"},{"sentence":"Formica is a well-known brand in the construction industry.","translation":"フォルミカは建設業界でよく知られたブランドだ。"}],"collocations":["Formica Group","Formica brand"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Formica is a trademarked name derived from 'for mica,' indicating its original use as a substitute for the mineral mica in electrical insulation.","priority":"★★☆"},"pronunciation":{"ipa":"/fɔːrˈmaɪkə/","syllables":"For-mi-ca"},"inflection":{"noun_plural":"Formicas"},"usage_notes":{"explanation":"Formica is primarily used as a noun referring to the laminated plastic material. It can also refer to the company that manufactures it. When referring to the material, it is often used generically, even if it's not actually made by Formica Corporation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to buy a formica.","correct":"✓ I need to buy some Formica.","note":"Formica is generally treated as an uncountable noun when referring to the material."}],"priority":"★★☆"},"related_words":{"derivatives":["laminate","melamine"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Formica' is a specific type of laminated plastic, often used for countertops and furniture. It's a brand name that has become somewhat genericized, meaning people often use 'Formica' to refer to any similar type of laminate, even if it's made by a different company. You'll typically encounter this word when discussing home improvement or interior design."},"example_sentences":[{"sentence":"The Formica table was easy to wipe clean after the kids made a mess.","translation":"子供たちが散らかした後、フォルミカのテーブルは簡単に拭き掃除できた。","type":"noun","meaning_category":"material"},{"sentence":"We chose a Formica countertop because it was more affordable than granite.","translation":"花崗岩よりも手頃な価格だったので、フォルミカのカウンタートップを選んだ。","type":"noun","meaning_category":"material"},{"sentence":"The company Formica has been around for over a century.","translation":"フォルミカ社は1世紀以上も前から存在している。","type":"noun","meaning_category":"company"}]}