{"word":"unsomatic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"Not related to or involving the body; not physical.","english_definition":"Not having a physical cause or basis; purely mental or emotional.","examples":[{"sentence":"The doctor suspected the patient's pain was unsomatic in origin.","translation":"医者は患者の痛みの原因が身体的なものではないと疑った。"},{"sentence":"Her anxiety was largely unsomatic, stemming from deep-seated fears.","translation":"彼女の不安は主に身体的なものではなく、根深い恐怖から生じていた。"}],"collocations":["unsomatic pain","unsomatic symptoms","unsomatic origin","unsomatic anxiety"],"synonyms":["psychological","emotional","mental","nonphysical"],"antonyms":["somatic","physical","bodily"]},{"part_of_speech":"adjective","definition":"Not relating to the soma or body of an organism.","english_definition":"Not part of the body of an organism; not somatic.","examples":[{"sentence":"The mutation was unsomatic, affecting only the reproductive cells.","translation":"その突然変異は体細胞性ではなく、生殖細胞のみに影響を与えた。"}],"collocations":["unsomatic mutation","unsomatic cells"],"synonyms":["germinal","reproductive"],"antonyms":["somatic"]}],"etymology":{"value":"Formed with the prefix 'un-' (not) + 'somatic' (relating to the body).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnsoʊˈmætɪk/","syllables":"un-so-mat-ic"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be used in comparative or superlative phrases (e.g., more unsomatic)."},"usage_notes":{"explanation":"'Unsomatic' is used to describe something that is not related to the body. It can refer to conditions or symptoms that are psychological or emotional in origin, rather than physical. It can also refer to genetic mutations that do not affect the body's cells but only the reproductive cells.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unsomatic exercise helped me relax.","correct":"✓ The somatic exercise helped me relax.","note":"'Unsomatic' refers to something not related to the body, so it would not be used to describe exercise. 'Somatic' exercise, which focuses on body awareness, would be more appropriate."},{"incorrect":"✗ He had an unsomatic illness.","correct":"✓ He had a psychological illness.","note":"While 'unsomatic' can describe an illness, it's more common to use terms like 'psychological' or 'emotional' illness to describe conditions with a mental or emotional basis."}],"priority":"★★☆"},"related_words":{"derivatives":["unsomatically"],"related_terms":["somatic","psychosomatic","somatization","soma"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unsomatic' is a relatively uncommon word used in medical and psychological contexts. It describes something that is not physical or bodily in nature, often referring to mental or emotional causes of symptoms or conditions. It can also be used in genetics to describe mutations that only affect reproductive cells. Understanding the root word 'somatic' (relating to the body) is essential to grasping the meaning of 'unsomatic'."},"example_sentences":[{"sentence":"The therapist explored the unsomatic roots of her depression.","translation":"セラピストは彼女の鬱の身体的ではない原因を探求した。","type":"general","meaning_category":"psychological origin"},{"sentence":"The unsomatic mutation would not affect the individual's lifespan.","translation":"その体細胞性ではない突然変異は、個人の寿命には影響を与えないだろう。","type":"genetic","meaning_category":"non-bodily mutation"}]}