{"word":"Erythrulose","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A tetrose monosaccharide (four-carbon sugar) used in some self-tanning cosmetics.","english_definition":"A tetrose monosaccharide (four-carbon sugar) with the chemical formula C4H8O4, used in some self-tanning cosmetics as a tanning agent.","examples":[{"sentence":"Erythrulose works similarly to DHA in self-tanning products, but it develops a tan more slowly.","translation":"エリスルロースは、セルフタンニング製品においてDHAと同様に作用しますが、よりゆっくりと日焼けを発達させます。"},{"sentence":"Some self-tanners combine erythrulose and DHA for a more natural-looking tan.","translation":"より自然な日焼けのために、エリスルロースとDHAを組み合わせたセルフタンナーもあります。"}],"collocations":["self-tanning","cosmetics","DHA","skin care"],"synonyms":["dihydroxyacetone (DHA)"],"antonyms":[],"related_terms":["tetrose","monosaccharide","sugar","carbohydrate"]}],"etymology":{"value":"Derived from the Greek 'erythros' meaning 'red' (referring to the reddish color of some solutions containing erythrulose) and '-ulose' which is a suffix used for ketose sugars.","priority":"★★★"},"pronunciation":{"ipa":"/ɪˌrɪθrəˈloʊs/","syllables":"e-ry-thro-lose"},"inflection":{"notes":"It is a noun, so it has no plural form."},"usage_notes":{"explanation":"Erythrulose is primarily known for its use in self-tanning products. It reacts with amino acids in the skin's surface to produce a browning effect, similar to how DHA (dihydroxyacetone) works. Erythrulose tends to produce a slightly redder tone compared to DHA, and the tan develops more slowly. Some products combine both ingredients to achieve a more natural and even tan.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Erythrulose is a type of protein.","correct":"✓ Erythrulose is a type of sugar.","note":"Erythrulose is a carbohydrate (specifically, a sugar), not a protein."},{"incorrect":"✗ Erythrulose makes your skin darker instantly.","correct":"✓ Erythrulose makes your skin darker gradually.","note":"Erythrulose develops a tan more slowly than DHA."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["dihydroxyacetone","self-tanner","tetrose","monosaccharide"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Erythrulose is a technical term primarily encountered in the context of cosmetic chemistry and dermatology, specifically related to self-tanning products. Understanding this term requires familiarity with basic concepts of organic chemistry (monosaccharides, ketoses) and the mechanisms of skin tanning. The term is not commonly used in everyday language."},"example_sentences":[{"sentence":"The self-tanner contained both DHA and erythrulose for a more balanced color.","translation":"そのセルフタンナーには、よりバランスの取れた色合いのためにDHAとエリスルロースの両方が含まれていました。","type":"example","meaning_category":"cosmetic ingredient"},{"sentence":"Erythrulose is a four-carbon sugar used in some tanning lotions.","translation":"エリスルロースは、いくつかの日焼けローションで使用されている4炭素糖です。","type":"example","meaning_category":"chemical description"}]}