{"word":"overgive","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"与えすぎる、過剰に与える","english_definition":"To give excessively or too much.","examples":[{"sentence":"She tends to overgive to her children, spoiling them in the process.","translation":"彼女は子供たちに与えすぎる傾向があり、その過程で彼らを甘やかしている。"},{"sentence":"It's easy to overgive when you want to show someone you care.","translation":"誰かを気にかけていることを示したいとき、与えすぎるのは簡単だ。"}],"collocations":["overgive gifts","overgive affection","overgive attention"],"synonyms":["overprovide","lavish","shower"],"antonyms":["undergive","deprive","withhold"]}],"etymology":{"value":"Formed by combining the prefix 'over-' (meaning excessively) with the verb 'give'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌoʊvərˈɡɪv/","syllables":"o-ver-give"},"inflection":{"verb_forms":{"present_simple":["overgive","overgives"],"past_simple":"overgave","past_participle":"overgiven","present_participle":"overgiving"}},"usage_notes":{"explanation":"'Overgive' implies giving more than is necessary or beneficial. It often carries a negative connotation, suggesting that the excessive giving may lead to problems or imbalances.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He overgave them money, so they didn't learn the value of work.","correct":"✓ He overgave money to them, so they didn't learn the value of work.","note":"When using 'overgive' with a direct object (what is given) and an indirect object (to whom it is given), it's common to use 'to' before the indirect object."},{"incorrect":"✗ She overgave, and now she has nothing left.","correct":"✓ She overgave, and now she has nothing left to give.","note":"The sentence is grammatically correct, but it might be clearer to add 'to give' at the end to emphasize the consequence of overgiving."}],"priority":"★★☆"},"related_words":{"derivatives":["overgiving (noun, adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Not commonly used)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Overgive' is a relatively uncommon word that means to give excessively or too much. It often implies that the excessive giving is not beneficial and may lead to negative consequences. The word is formed by adding the prefix 'over-' to the verb 'give'. It is generally used in contexts where the act of giving is being evaluated or criticized for being excessive."},"example_sentences":[{"sentence":"Parents sometimes overgive material possessions to compensate for a lack of emotional support.","translation":"親は時々、感情的なサポートの不足を補うために、物質的なものを与えすぎることがある。","type":"verb","meaning_category":"与えすぎる"},{"sentence":"It's important not to overgive in a relationship, as it can create an imbalance of power.","translation":"関係においては与えすぎないことが重要だ。なぜなら、力の不均衡が生じる可能性があるからだ。","type":"verb","meaning_category":"与えすぎる"},{"sentence":"The charity was accused of overgiving to certain organizations, leading to questions about their allocation of resources.","translation":"その慈善団体は、特定団体に与えすぎていると非難され、資源配分について疑問が生じた。","type":"verb","meaning_category":"与えすぎる"}]}