{"word":"Eerotema","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A question asked for rhetorical effect and not requiring an answer.","english_definition":"A rhetorical question; a question asked for effect rather than requiring an answer.","examples":[{"sentence":"The politician's speech was full of eerotemas, designed to engage the audience emotionally.","translation":"その政治家の演説は、聴衆の感情に訴えかけるように設計された、多くの反語的疑問で満たされていた。"},{"sentence":"'Who knows?' is a common eerotema used to express uncertainty.","translation":"「誰が知っているだろうか？」は、不確実性を表現するために使われる一般的な反語的疑問である。"},{"sentence":"The author used eerotema to provoke thought and reflection in the reader.","translation":"著者は、読者に思考と内省を促すために反語的疑問を用いた。"}],"collocations":["use of eerotema","rhetorical eerotema","common eerotema"],"synonyms":["rhetorical question"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek ἐρώτημα (erṓtēma, “question”).","priority":"★★★"},"pronunciation":{"ipa":"/ɪˈrɒtɪmə/","syllables":"E-ro-te-ma"},"inflection":{"noun_plural":"Eerotemas"},"usage_notes":{"explanation":"An eerotema is a figure of speech in the form of a question that is asked in order to make a point rather than to elicit an answer. The speaker or writer does not expect a response; instead, the question is used to assert or deny something implicitly.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He answered the eerotema directly.","correct":"✓ Eerotemas are not meant to be answered directly.","note":"Eerotemas are rhetorical questions and do not require or expect an answer."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Eerotema' is a relatively rare and advanced term referring to a rhetorical question, which is a question asked for effect rather than to receive an answer. It is typically used in formal contexts, such as literary analysis or rhetoric studies. Understanding this term requires a strong grasp of rhetorical devices and advanced vocabulary.","note":"This word is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The lawyer posed an eerotema to the jury, knowing they wouldn't answer aloud but would consider the implications.","translation":"弁護士は陪審員に反語的疑問を投げかけ、彼らが声に出して答えないことを承知の上で、その含意を検討させるように仕向けた。","type":"noun","meaning_category":"rhetorical question"},{"sentence":"Her speech was filled with eerotemas, designed to make the audience think critically about the issue.","translation":"彼女の演説は反語的疑問で満たされており、聴衆にその問題について批判的に考えさせるように意図されていた。","type":"noun","meaning_category":"rhetorical question"},{"sentence":"The poet often used eerotemas to evoke emotion and create a sense of unease in the reader.","translation":"その詩人はしばしば反語的疑問を用いて、読者の感情を喚起し、不安感を醸し出した。","type":"noun","meaning_category":"rhetorical question"}]}