{"word":"humidity-controlled","meanings":[{"part_of_speech":"adjective","definition":"湿度管理された、湿度調整機能付きの","english_definition":"Having a system or feature that regulates and maintains a specific level of humidity.","examples":[{"sentence":"The museum uses humidity-controlled display cases to protect delicate artifacts.","translation":"その美術館は、デリケートな展示品を保護するために湿度管理された展示ケースを使用しています。"},{"sentence":"We store our guitars in a humidity-controlled room to prevent damage from dryness or excessive moisture.","translation":"乾燥や過度の湿気による損傷を防ぐため、ギターは湿度管理された部屋に保管しています。"},{"sentence":"The laboratory has a humidity-controlled environment to ensure accurate experimental results.","translation":"その実験室は、正確な実験結果を保証するために湿度管理された環境を備えています。"}],"collocations":["humidity-controlled environment (湿度管理された環境)","humidity-controlled storage (湿度管理された保管)","humidity-controlled chamber (湿度管理されたチャンバー)","humidity-controlled room (湿度管理された部屋)","humidity-controlled container (湿度管理された容器)","humidity-controlled packaging (湿度管理された包装)"],"synonyms":["climate-controlled","temperature and humidity controlled","environmentally controlled"],"antonyms":["uncontrolled","non-regulated"]},{"part_of_speech":"adjective","definition":"湿度制御された","english_definition":"Designed or equipped to maintain a specific humidity level.","examples":[{"sentence":"The new refrigerator has a humidity-controlled crisper drawer to keep vegetables fresh longer.","translation":"新しい冷蔵庫には、野菜をより長く新鮮に保つための湿度制御されたクリスパー引き出しが付いています。"}],"collocations":["humidity-controlled crisper (湿度制御されたクリスパー)"],"synonyms":["humidity regulated","humidity stabilized"],"antonyms":["non-humidity-controlled"]}],"etymology":{"value":"The word is a compound adjective formed by combining \"humidity\" (the amount of moisture in the air) with \"controlled\" (regulated or managed).","priority":"★☆☆"},"pronunciation":{"ipa":"/hjuːˈmɪdɪti kənˈtroʊld/","syllables":"hu-mid-i-ty con-trolled"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"\"Humidity-controlled\" is typically used to describe spaces, containers, or devices that have systems in place to maintain a specific level of humidity. This is important for preserving items that are sensitive to moisture levels, such as musical instruments, artwork, documents, and certain types of food.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The room is humidity control.","correct":"✓ The room is humidity-controlled.","note":"\"Humidity control\" is a noun phrase referring to the act or means of controlling humidity. \"Humidity-controlled\" is the adjective describing something that has such control. "},{"incorrect":"✗ The humid controlled environment.","correct":"✓ The humidity-controlled environment.","note":"The correct order is \"humidity-controlled,\" not \"humid controlled.\""}],"priority":"★★☆"},"related_words":{"derivatives":["humidity (noun)","control (verb, noun)","controlled (adjective)"],"phrasal_verbs":[],"related_terms":["hygrometer (湿度計)","humidistat (湿度調節器)","dehumidifier (除湿器)","humidifier (加湿器)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, technical term.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"humidity-controlled\" is a technical adjective used to describe environments or devices that maintain a specific level of moisture in the air. It is commonly used in contexts where precise humidity levels are important, such as museums, laboratories, and storage facilities. Understanding this term requires familiarity with the concept of humidity and the ability to recognize compound adjectives.","priority":"★★☆"},"example_sentences":[{"sentence":"The wine cellar is humidity-controlled to ensure proper aging of the bottles.","translation":"ワインセラーは、ボトルが適切に熟成されるように湿度管理されています。","type":"general","meaning_category":"湿度管理された"},{"sentence":"The seeds are stored in a humidity-controlled environment to maintain their viability.","translation":"種子は、生存能力を維持するために湿度管理された環境に保管されています。","type":"general","meaning_category":"湿度管理された"}]}