{"word":"Indictee","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律)起訴された人、被告人","english_definition":"A person who has been formally accused of a crime by an indictment.","examples":[{"sentence":"The indictee pleaded not guilty to all charges.","translation":"被告人はすべての罪状について無罪を主張した。"},{"sentence":"The indictee was released on bail pending trial.","translation":"被告人は公判までの間、保釈された。"}],"collocations":["the indictee pleaded","the indictee was charged","the indictee was released"],"synonyms":["defendant","accused"],"antonyms":[]}],"etymology":{"value":"From the verb 'indict', meaning to formally accuse or charge with a crime. The suffix '-ee' denotes the person who is the recipient of the action (in this case, the indictment).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˌdaɪˈtiː/","syllables":"in-dic-tee"},"inflection":{"noun_plural":"indictees"},"usage_notes":{"explanation":"'Indictee' is a legal term referring specifically to someone who has been formally indicted, meaning a grand jury has found enough evidence to bring criminal charges. It is often used in legal documents and news reports about legal proceedings. The term is more formal than 'defendant' or 'accused'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The indictee was convicted before being indicted.","correct":"✓ The defendant was convicted after being indicted.","note":"An indictee is someone who has already been indicted. You cannot be convicted before being indicted."},{"incorrect":"✗ The indictee is the lawyer representing the accused.","correct":"✓ The indictee is the person accused of the crime.","note":"The indictee is the person accused, not the lawyer."}],"priority":"★★☆"},"related_words":{"derivatives":["indict (verb: to formally accuse)","indictment (noun: the formal accusation)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'indictee' is a formal legal term. It is used to specifically refer to a person who has been formally accused of a crime through an indictment by a grand jury. This term is most often encountered in legal contexts, such as court documents or news reports about legal proceedings. Because of its specific and formal usage, it is not a common word in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The indictee maintained his innocence throughout the trial.","translation":"被告人は裁判を通して一貫して無罪を主張した。","type":"noun","meaning_category":"起訴された人"},{"sentence":"The prosecution presented evidence against the indictee.","translation":"検察側は被告人に対する証拠を提出した。","type":"noun","meaning_category":"起訴された人"},{"sentence":"The indictee's lawyer argued for a dismissal of the charges.","translation":"被告人の弁護士は、起訴の取り下げを求めた。","type":"noun","meaning_category":"起訴された人"}]}