{"word":"congestion-inducing","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"渋滞を引き起こす、混雑を誘発する","english_definition":"Causing or likely to cause congestion, especially traffic congestion.","examples":[{"sentence":"The new development is congestion-inducing because it adds more cars to already crowded roads.","translation":"その新しい開発は、すでに混雑している道路にさらに車を追加するため、渋滞を引き起こす。"},{"sentence":"The policy was criticized for being congestion-inducing.","translation":"その政策は、渋滞を誘発するものとして批判された。"},{"sentence":"We need to find solutions to reduce congestion-inducing activities.","translation":"渋滞を誘発する活動を減らすための解決策を見つける必要がある。"}],"collocations":["congestion-inducing traffic","congestion-inducing policies","congestion-inducing factors","congestion-inducing infrastructure"],"synonyms":["traffic-generating","crowding","bottleneck-creating"],"antonyms":["congestion-reducing","congestion-alleviating"]}],"etymology":{"value":"The word is formed by combining 'congestion' (a state of overcrowding or blockage), 'inducing' (causing or bringing about), and joining them with a hyphen.","priority":"★★☆"},"pronunciation":{"ipa":"/kənˌdʒestʃən ɪnˈdjuːsɪŋ/","syllables":"con-ges-tion in-du-cing"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Congestion-inducing' is typically used to describe something that contributes to or worsens a state of congestion, most commonly traffic congestion. It is often used in discussions about urban planning, transportation policy, and infrastructure development.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The congestion inducing road.","correct":"✓ The congestion-inducing road.","note":"The hyphen is necessary to correctly form the compound adjective."},{"incorrect":"✗ The congestion induce road.","correct":"✓ The congestion-inducing road.","note":"The correct form is 'congestion-inducing' not 'congestion induce'."}],"priority":"★★☆"},"related_words":{"derivatives":["congestion (noun)","induce (verb)","inducing (adjective)"],"phrases":["traffic congestion","urban congestion"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'congestion-inducing' is a complex adjective used to describe something that causes or contributes to congestion, particularly in the context of traffic. It is often found in formal writing and discussions related to urban planning, transportation, and infrastructure. Understanding this term requires familiarity with the concept of congestion and the meaning of 'inducing' as causing or bringing about a particular state or condition."},"example_sentences":[{"sentence":"The lack of public transportation options is a major congestion-inducing factor in the city.","translation":"公共交通機関の選択肢の欠如は、都市における主要な渋滞誘発要因である。","type":"adjective","meaning_category":"渋滞を引き起こす"},{"sentence":"Building more lanes on the highway may seem like a solution, but it can actually be congestion-inducing in the long run.","translation":"高速道路の車線を増やすことは解決策のように思えるかもしれませんが、長期的には実際には渋滞を誘発する可能性があります。","type":"adjective","meaning_category":"渋滞を引き起こす"},{"sentence":"The city is implementing new strategies to reduce congestion-inducing events, such as road closures during peak hours.","translation":"市は、ピーク時の道路閉鎖など、渋滞を誘発するイベントを減らすための新しい戦略を実施しています。","type":"adjective","meaning_category":"渋滞を引き起こす"}]}