{"word":"shunpiked","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"（有料道路を避けて）裏道を通る、脇道を通る","english_definition":"To avoid a toll road by taking an alternate route, typically a side road or back road.","examples":[{"sentence":"We shunpiked the turnpike to save money on tolls.","translation":"料金を節約するために、有料道路を避けて裏道を通った。"},{"sentence":"They shunpiked the highway to enjoy the scenic route.","translation":"彼らは景色の良い道を楽しむために高速道路を避けて脇道を通った。"}],"collocations":["shunpike a turnpike","shunpike a toll road","shunpike the highway"],"synonyms":["bypass","detour","avoid","reroute"],"antonyms":["use toll road","take the turnpike"]},{"part_of_speech":"verb","transitivity":"vi","definition":"（有料道路を避けて）裏道を通る、脇道を通る","english_definition":"To travel on an alternate route to avoid a toll road.","examples":[{"sentence":"We decided to shunpike to avoid the expensive tolls.","translation":"高い通行料金を避けるために、裏道を通ることにした。"},{"sentence":"They often shunpike when traveling on a budget.","translation":"彼らは予算を抑えて旅行するときによく裏道を通る。"}],"collocations":["shunpike to save money","shunpike to avoid tolls"],"synonyms":["take back roads","take side roads","detour"],"antonyms":["use toll road","travel on the turnpike"]}],"etymology":{"value":"The word \"shunpike\" is a compound of \"shun\" (to avoid) and \"pike\" (short for \"turnpike,\" a type of toll road). It originated in the United States in the 19th century, when toll roads were common.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʃʌnˌpaɪkt/","syllables":"shun-piked"},"inflection":{"verb_forms":{"present_simple":["shunpike","shunpikes"],"past_simple":"shunpiked","past_participle":"shunpiked","present_participle":"shunpiking"}},"usage_notes":{"explanation":"\"Shunpiked\" specifically refers to avoiding toll roads by taking alternative routes. It often implies a desire to save money or to experience a more scenic or less congested route. The term is most commonly used in regions where toll roads are prevalent.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ We shunpiked the traffic jam.","correct":"✓ We avoided the traffic jam.","note":"\"Shunpike\" specifically refers to avoiding toll roads, not general traffic. Use \"avoid\" for traffic jams."},{"incorrect":"✗ He shunpiked the bill.","correct":"✓ He avoided the bill.","note":"\"Shunpike\" is not used to describe avoiding a bill or payment. Use \"avoid\" in that context."}],"priority":"★★☆"},"related_words":{"derivatives":["shunpiker (noun: someone who avoids toll roads)","shunpiking (noun: the act of avoiding toll roads)"],"phrasal_verbs":[],"related_terms":["toll road","turnpike","back road","side road"]},"level_frequency":{"CEFR":"N/A (Not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Shunpiked\" is a relatively uncommon word that specifically describes the action of avoiding a toll road by taking an alternative route, usually a back road or side road. The term is most often used in regions where toll roads are common and drivers may actively seek to avoid paying tolls. Understanding this word requires familiarity with the concept of toll roads and the practice of finding alternative routes to save money or enjoy a more scenic drive."},"example_sentences":[{"sentence":"They shunpiked the New Jersey Turnpike to avoid the high tolls.","translation":"彼らは高い通行料金を避けるためにニュージャージーターンパイクを避けて裏道を通った。","type":"verb","meaning_category":"avoiding toll road"},{"sentence":"We shunpiked through the countryside, enjoying the small towns along the way.","translation":"私たちは田舎道を裏道を通って、途中の小さな町を楽しんだ。","type":"verb","meaning_category":"avoiding toll road"},{"sentence":"Shunpiking can add time to your trip, but it can also be more scenic.","translation":"裏道を通ると旅行時間が長くなることがあるが、景色が良い場合もある。","type":"verb","meaning_category":"avoiding toll road"}]}