{"word":"keto-","priority":"★★☆","meanings":[{"part_of_speech":"prefix","definition":"ケト基を持つことを示す接頭辞","english_definition":"A prefix indicating the presence of a ketone group.","examples":[{"sentence":"Ketoacidosis is a metabolic state associated with elevated concentrations of ketone bodies.","translation":"ケトアシドーシスは、ケトン体の濃度上昇に関連する代謝状態です。"},{"sentence":"Ketogenesis is the biochemical process by which organisms produce ketone bodies.","translation":"ケトン生成は、生物がケトン体を生成する生化学的プロセスです。"}],"collocations":["ketoacidosis","ketogenesis","ketone","ketogenic"],"synonyms":["oxo-"],"antonyms":[]}],"etymology":{"value":"Derived from 'ketone', referring to a chemical compound containing a carbonyl group (C=O) bonded to two carbon atoms.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkiːtoʊ/","syllables":"kee-toh"},"inflection":{"notes":"Prefix, does not inflect."},"usage_notes":{"explanation":"'keto-' is a prefix used in chemistry and biochemistry to indicate the presence or involvement of a ketone group or ketone bodies. It's commonly seen in terms related to metabolic processes, especially those involving low carbohydrate intake or conditions like diabetes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am on a keto diet to lose weight, so I eat many keto.","correct":"✓ I am on a keto diet to lose weight, so I eat many ketogenic foods.","note":"'keto' alone is not a noun; use 'ketogenic' to describe foods suitable for a keto diet."}],"priority":"★★☆"},"related_words":{"derivatives":["ketone","ketogenic","ketoacid","ketolysis","ketogenesis"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The prefix 'keto-' is a specialized term primarily used in scientific and medical contexts. Understanding its meaning is essential for comprehending terms related to ketones, ketone bodies, and metabolic processes like ketogenesis and ketoacidosis. While not commonly encountered in everyday language, it's crucial in discussions about nutrition, biochemistry, and certain medical conditions."},"example_sentences":[{"sentence":"The patient was diagnosed with diabetic **keto**acidosis.","translation":"その患者は糖尿病性ケトアシドーシスと診断された。","type":"medical","meaning_category":"related to ketone bodies"},{"sentence":"A **keto**genic diet is often used for weight loss.","translation":"ケトジェニックダイエットは、しばしば減量のために用いられる。","type":"nutrition","meaning_category":"related to ketone bodies"},{"sentence":"**Keto**nes are produced when the body burns fat for energy.","translation":"ケトン体は、体がエネルギーのために脂肪を燃焼するときに生成される。","type":"biochemistry","meaning_category":"related to ketone bodies"}]}