{"word":"trochocephalia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"舟状頭蓋（しゅうじょうとうがい）","english_definition":"A type of craniosynostosis characterized by premature closure of the sagittal suture, resulting in a long, narrow skull shape resembling a boat or keel.","examples":[{"sentence":"Trochocephalia is often diagnosed in infancy.","translation":"舟状頭蓋はしばしば乳児期に診断される。"},{"sentence":"Surgical intervention is typically required to correct trochocephalia.","translation":"舟状頭蓋を矯正するには通常、外科的介入が必要となる。"}],"collocations":["sagittal suture","craniosynostosis","skull shape","surgical correction"],"synonyms":["scaphocephaly","dolichocephaly"],"antonyms":[]}],"etymology":{"value":"From Greek 'trochos' (wheel, referring to the keel of a ship) + 'kephale' (head) + '-ia' (suffix indicating a condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtrɒkoʊsɪˈfeɪliə/","syllables":"tro-cho-ce-pha-li-a"},"inflection":{"noun_plural":"trochocephalias"},"usage_notes":{"explanation":"Trochocephalia, also known as scaphocephaly or dolichocephaly, is a specific type of craniosynostosis where the sagittal suture (the fibrous joint between the two parietal bones of the skull) fuses prematurely. This premature fusion restricts lateral growth of the skull, causing it to elongate in an anterior-posterior direction. The resulting head shape is long and narrow, resembling an inverted boat or keel. Diagnosis is typically made through physical examination and confirmed with imaging studies such as X-rays or CT scans. Treatment usually involves surgical correction to release the fused suture and allow for normal brain and skull growth.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The baby has trochocephaly.","correct":"✓ The baby has trochocephalia.","note":"The correct term is 'trochocephalia,' not 'trochocephaly'."}],"priority":"★☆☆"},"related_words":{"derivatives":["craniosynostosis","scaphocephaly","dolichocephaly"],"medical_terms":["sagittal suture","parietal bones","cranial vault"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized medical term)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な医学用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Trochocephalia' is a highly specialized medical term referring to a specific type of craniosynostosis. Understanding this term requires knowledge of cranial anatomy, specifically the sagittal suture and parietal bones. It is primarily used within the medical field by healthcare professionals involved in diagnosing and treating craniofacial abnormalities. Due to its technical nature, it is unlikely to be encountered in general conversation or non-medical texts."},"example_sentences":[{"sentence":"The infant was diagnosed with trochocephalia based on the characteristic skull shape.","translation":"その乳児は特徴的な頭蓋の形状に基づいて舟状頭蓋と診断された。","type":"medical","meaning_category":"medical condition"},{"sentence":"Surgical intervention is the primary treatment for trochocephalia to allow for normal brain development.","translation":"脳の正常な発達を促すために、外科的介入が舟状頭蓋の主な治療法である。","type":"medical","meaning_category":"medical treatment"}]}