{"word":"contraceptionist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"避妊擁護者、避妊支持者","english_definition":"A person who advocates or supports contraception.","examples":[{"sentence":"She became a vocal contraceptionist after experiencing the challenges of unplanned pregnancies.","translation":"彼女は、予期せぬ妊娠の困難を経験した後、声高な避妊擁護者になった。"},{"sentence":"The contraceptionist argued that access to birth control is a fundamental right.","translation":"その避妊擁護者は、避妊へのアクセスは基本的人権であると主張した。"}],"collocations":["leading contraceptionist","vocal contraceptionist","prominent contraceptionist","support contraceptionist","oppose contraceptionist"],"synonyms":["birth control advocate","family planning supporter","pro-choice advocate"],"antonyms":["anti-contraceptionist","pro-life advocate","natalist"]}],"etymology":{"value":"The word is formed by combining \"contraception\" (the prevention of conception) with the suffix \"-ist\" (denoting a person who practices or is concerned with something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒntrəˈsepʃənɪst/","syllables":"con-tra-cep-tion-ist"},"inflection":{"noun_plural":"contraceptionists"},"usage_notes":{"explanation":"The term \"contraceptionist\" is primarily used to describe individuals who actively support and promote the use of contraception, often within a social, political, or medical context. It is a more specific term than simply \"someone who uses contraception,\" implying advocacy or support for its availability and use.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a contraception.","correct":"✓ He is a contraceptionist.","note":"\"Contraception\" is the method itself, while \"contraceptionist\" is the person who advocates for it."},{"incorrect":"✗ Contraceptionists are always women.","correct":"✓ Contraceptionists can be men or women.","note":"While the issue of contraception often affects women directly, both men and women can be contraceptionists."}],"priority":"★★☆"},"related_words":{"derivatives":["contraception (noun: 避妊)","contraceptive (adjective/noun: 避妊の、避妊具)"],"related_concepts":["family planning","reproductive health","sexual health","birth control","population control"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - The term is relatively specialized.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"contraceptionist\" is a specialized term referring to someone who actively supports or advocates for contraception. It is not a commonly used word in everyday conversation but is more likely to appear in discussions about reproductive rights, public health, or family planning. Understanding the term requires knowledge of the concept of contraception and the suffix \"-ist,\" which denotes a person who practices or is concerned with something."},"example_sentences":[{"sentence":"As a dedicated contraceptionist, she volunteered at a local family planning clinic.","translation":"熱心な避妊擁護者として、彼女は地元の家族計画クリニックでボランティアをした。","type":"noun","meaning_category":"避妊擁護者"},{"sentence":"The organization is comprised of doctors, nurses, and other contraceptionists dedicated to improving access to reproductive healthcare.","translation":"その組織は、生殖医療へのアクセス改善に尽力する医師、看護師、その他の避妊擁護者で構成されている。","type":"noun","meaning_category":"避妊擁護者"}]}