{"word":"conformally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"等角的に、共形的に","english_definition":"In a conformal manner; in a way that preserves angles locally.","examples":[{"sentence":"The map was conformally projected, preserving the shapes of small regions.","translation":"その地図は等角投影されており、小さな地域の形状を保持していた。"},{"sentence":"The Riemann mapping theorem states that any simply connected open subset of the complex plane can be mapped conformally onto the unit disk.","translation":"リーマンの写像定理は、複素平面の任意の単連結開部分集合が、単位円板上に等角的に写像できることを述べている。"}],"collocations":["conformally equivalent","conformally invariant","conformally mapped"],"synonyms":["isogonally"],"antonyms":[]}],"etymology":{"value":"From 'conformal' + '-ly'. 'Conformal' derives from 'conform', meaning to be similar in form or character, and ultimately from Latin 'conformare', to shape alike.","priority":"☆☆☆"},"pronunciation":{"ipa":"/kənˈfɔːrməli/","syllables":"con-form-al-ly"},"inflection":{"notes":"This is an adverb, so it does not inflect."},"usage_notes":{"explanation":"'Conformally' is an adverb used primarily in mathematics and physics, particularly in the context of complex analysis, geometry, and field theory. It describes transformations or mappings that preserve angles locally, although they may distort shapes and sizes. Conformal mappings are crucial in various applications, including cartography, fluid dynamics, and electromagnetism.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"The shapes were conformally.","correct":"The shapes were mapped conformally.","note":"'Conformally' is an adverb and should modify a verb, not be used as a predicate adjective."}],"priority":"☆☆☆"},"related_words":{"derivatives":["conformal (adjective)","conformality (noun)","conform (verb)","conformation (noun)"],"related_terms":["isogonal","angle-preserving","mapping","transformation"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Primarily used in technical contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'conformally' is highly specialized and technical, primarily used in advanced mathematics and physics. It describes a specific type of transformation that preserves angles. Understanding requires a background in complex analysis or differential geometry."},"example_sentences":[{"sentence":"The function maps the region conformally to another domain.","translation":"その関数は、ある領域を別の領域に等角的に写像する。","type":"general","meaning_category":"mapping"},{"sentence":"Conformally flat spacetimes are important in general relativity.","translation":"共形的に平坦な時空は、一般相対性理論において重要である。","type":"physics","meaning_category":"physics"}]}