{"word":"collibert","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(historical) A person in medieval Europe who was in a social class between serf and freeman, often associated with specific occupations or communities.","english_definition":"A person in medieval Europe who was in a social class between serf and freeman, often associated with specific occupations or communities.","examples":[{"sentence":"The colliberts of the village were responsible for maintaining the local roads.","translation":"村のコリバートたちは地元の道路の維持管理を担当していた。"},{"sentence":"Colliberts often had more rights than serfs but were still subject to certain obligations to the lord.","translation":"コリバートは農奴よりも多くの権利を持っていたが、それでも領主に対して特定の義務を負っていた。"}],"collocations":["village colliberts","status of collibert","collibert community"],"synonyms":["villein","bordar","cottar"],"antonyms":["serf","freeman"]}],"etymology":{"value":"The term 'collibert' is derived from medieval Latin, likely combining 'collum' (neck) and 'libertus' (freedman), suggesting a person with limited freedom.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒlɪbərt/","syllables":"col-li-bert"},"inflection":{"noun_plural":"colliberts"},"usage_notes":{"explanation":"The term 'collibert' is primarily historical, referring to a specific social class in medieval Europe. It is not commonly used in modern contexts. Understanding the term requires knowledge of medieval social structures.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a collibert and therefore had complete freedom.","correct":"✓ He was a collibert, which meant he had more freedom than a serf but was still bound by certain obligations.","note":"Colliberts were not completely free; they had obligations to their lord."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["serfdom","feudalism","manorialism"]},"level_frequency":{"CEFR":"N/A (historical term)","frequency_google_ngram":"Very low frequency - primarily used in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'collibert' is a specialized historical term, requiring a high level of understanding of medieval European social structures. It is unlikely to be encountered outside of academic or historical contexts. Understanding requires familiarity with concepts such as feudalism, serfdom, and manorialism."},"example_sentences":[{"sentence":"The records showed that many of the villagers were classified as colliberts.","translation":"記録によると、村人の多くはコリバートとして分類されていた。","type":"noun","meaning_category":"historical social class"},{"sentence":"The colliberts' obligations included providing labor to the lord's fields.","translation":"コリバートの義務には、領主の畑での労働提供が含まれていた。","type":"noun","meaning_category":"historical social class"}]}