{"word":"ecclesiasticism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"教会政治主義、教権主義、聖職者支配","english_definition":"Advocacy of the power of a church or clergy in political matters; adherence to the traditions and practices of a church.","examples":[{"sentence":"The country's history is marked by periods of intense ecclesiasticism.","translation":"その国の歴史は、激しい教会政治主義の時代によって特徴づけられています。"},{"sentence":"Critics accused the government of ecclesiasticism for its close ties to religious institutions.","translation":"批評家たちは、政府が宗教機関との緊密な関係のために教権主義であると非難しました。"}],"collocations":["political ecclesiasticism","religious ecclesiasticism","historical ecclesiasticism"],"synonyms":["clericalism","hierocracy","theocracy"],"antonyms":["secularism","laicism"]}],"etymology":{"value":"From 'ecclesiastic,' meaning relating to the church, plus '-ism,' a suffix indicating a doctrine, principle, or practice.","priority":"★★★"},"pronunciation":{"ipa":"/ɪˌkliːziˈæstɪsɪzəm/","syllables":"ec-cle-si-as-ti-ci-sm"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Ecclesiasticism' often carries a negative connotation, suggesting an undue or inappropriate influence of religious institutions in secular affairs. It can also refer to a rigid adherence to church traditions, sometimes seen as excessive or outdated.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ecclesiasticism was very quiet.","correct":"✓ The ecclesiasticism was very strong.","note":"'Ecclesiasticism' refers to a system or advocacy, not a quality that can be quiet. It is often described as strong, prevalent, or influential."}],"priority":"★★☆"},"related_words":{"derivatives":["ecclesiastic (adjective, noun)","ecclesiastical (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Ecclesiasticism' is a complex and relatively rare word, typically encountered in academic or historical contexts when discussing the role of the church in politics or society. Understanding its nuances requires familiarity with political science, religious history, and the separation of church and state."},"example_sentences":[{"sentence":"The rise of ecclesiasticism in the medieval era significantly shaped European politics.","translation":"中世における教会政治主義の台頭は、ヨーロッパの政治を大きく形作りました。","type":"noun","meaning_category":"教会政治主義"},{"sentence":"Many Enlightenment thinkers opposed ecclesiasticism, advocating for a separation of church and state.","translation":"啓蒙思想家の多くは教権主義に反対し、政教分離を主張しました。","type":"noun","meaning_category":"教権主義"}]}