{"word":"falsifiability","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"反証可能性、反証可能であること","english_definition":"The capacity for a statement, theory or hypothesis to be proven false.","examples":[{"sentence":"Popper argued that falsifiability is a key criterion for distinguishing scientific theories from non-scientific ones.","translation":"ポパーは、反証可能性が科学理論と非科学理論を区別するための重要な基準であると主張した。"},{"sentence":"The falsifiability of a hypothesis is what allows it to be tested and potentially refuted.","translation":"仮説の反証可能性こそが、その仮説が検証され、潜在的に反駁されることを可能にするものである。"},{"sentence":"Without falsifiability, a claim cannot be considered scientific.","translation":"反証可能性がなければ、主張は科学的とは見なされない。"}],"collocations":["lack of falsifiability (反証可能性の欠如)","criterion of falsifiability (反証可能性の基準)","test for falsifiability (反証可能性のテスト)","degree of falsifiability (反証可能性の度合い)"],"synonyms":["testability","refutability","disprovability"],"antonyms":["verifiability","provability","confirmability"]}],"etymology":{"value":"The word 'falsifiability' is derived from 'falsify', which comes from the Latin 'falsificare', meaning 'to make false'. The suffix '-ability' indicates the capacity or potential to be falsified.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɔːlsɪfaɪəˈbɪləti/","syllables":"fal-si-fi-a-bil-i-ty"},"inflection":{"notes":"It is an uncountable noun."},"usage_notes":{"explanation":"'Falsifiability' is a philosophical concept, most notably associated with Karl Popper's philosophy of science. It asserts that for a statement, hypothesis, or theory to be considered scientific, it must be inherently disprovable. That is, it must be possible to conceive of an observation or experiment that could potentially show the statement to be false. This does not mean that the statement *is* false, but rather that it *could* be proven false. This distinguishes scientific claims from non-scientific claims, which are often unfalsifiable.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The theory has a lot of falsifiability.","correct":"✓ The theory has a high degree of falsifiability.","note":"'Falsifiability' is an uncountable noun, so avoid using it with quantifiers like 'a lot of' that are typically used with countable nouns. Instead, use phrases like 'a high degree of falsifiability' or 'strong falsifiability'."},{"incorrect":"✗ Falsifiability means the theory is false.","correct":"✓ Falsifiability means the theory can be tested and potentially proven false.","note":"Falsifiability does not mean that a theory *is* false. It means that it *can* be tested and potentially shown to be false. It's a criterion for testability, not a statement of truth or falsehood."}],"priority":"★★☆"},"related_words":{"derivatives":["falsifiable (adjective)","falsify (verb)","falsification (noun)"],"related_concepts":["Popperian philosophy","scientific method","hypothesis testing","verificationism"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, primarily used in academic and philosophical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Falsifiability' is a term used in philosophy of science, particularly associated with Karl Popper. It means that for an idea or theory to be considered scientific, it must be possible to imagine a way to prove it wrong. This doesn't mean the idea *is* wrong, but that there's a way to test it. If there's no way to test if an idea is wrong, then it's not considered a scientific idea. It's a key concept in understanding what makes something scientific versus non-scientific.","priority":"★★☆"},"example_sentences":[{"sentence":"The scientist designed an experiment to test the falsifiability of his hypothesis.","translation":"科学者は、自身の仮説の反証可能性をテストするための実験を設計した。","type":"general","meaning_category":"反証可能性のテスト"},{"sentence":"One criticism of psychoanalysis is its lack of falsifiability.","translation":"精神分析への批判の一つは、その反証可能性の欠如である。","type":"general","meaning_category":"反証可能性の欠如"},{"sentence":"For a theory to be scientific, it must have a degree of falsifiability.","translation":"理論が科学的であるためには、ある程度の反証可能性がなければならない。","type":"general","meaning_category":"反証可能性の基準"}]}