{"word":"pluggable","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"プラグイン可能な、差し込み可能な、交換可能な","english_definition":"designed with the ability to be easily connected to or disconnected from a system or device; capable of being easily added or removed.","examples":[{"sentence":"This software has a pluggable architecture, allowing users to add new features easily.","translation":"このソフトウェアはプラグイン可能なアーキテクチャを持っており、ユーザーは新しい機能を簡単に追加できます。"},{"sentence":"The device uses pluggable modules for different functionalities.","translation":"そのデバイスは、さまざまな機能のためにプラグイン可能なモジュールを使用しています。"},{"sentence":"A pluggable component can be easily replaced with an updated version.","translation":"プラグイン可能なコンポーネントは、更新されたバージョンと簡単に交換できます。"}],"collocations":["pluggable architecture","pluggable module","pluggable component","pluggable system","pluggable interface"],"synonyms":["modular","interchangeable","replaceable","detachable","expandable"],"antonyms":["fixed","integrated","built-in","non-removable"]}],"etymology":{"value":"The word 'pluggable' is derived from the verb 'plug' (to insert a plug into a socket) and the suffix '-able' (capable of being).","priority":"★★★"},"pronunciation":{"ipa":"/ˈplʌɡəbəl/","syllables":"plug-ga-ble"},"inflection":{"notes":"This word is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Pluggable' describes something that can be easily added to or removed from a larger system. It is commonly used in the context of software, hardware, and systems design, where modularity and flexibility are important. The term implies that the component can be connected or disconnected without requiring significant modifications to the overall system.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The software is pluggable with new features.","correct":"✓ The software has a pluggable architecture.","note":"'Pluggable' describes the architecture or design, not the action of plugging in features directly. Use 'supports plugins' or 'is extensible with plugins' instead."},{"incorrect":"✗ The pluggable is broken.","correct":"✓ The pluggable module is broken.","note":"'Pluggable' is an adjective, so it needs to be followed by a noun (e.g., pluggable module, pluggable component)."}],"priority":"★★☆"},"related_words":{"derivatives":["plug (noun, verb)","plugin (noun)","plug-in (adjective)","unpluggable (adjective)"],"phrasal_verbs":[],"related_concepts":["modularity","extensibility","scalability","API (Application Programming Interface)","component-based architecture"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in technical contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Pluggable' is a technical term that means something can be easily added or removed from a system. Think of it like plugging in a lamp to an electrical outlet. The lamp is 'pluggable' because you can easily connect or disconnect it. In software, 'pluggable' means you can add new features (plugins) without changing the main program. This term is common in discussions about software and hardware design where flexibility is important.","priority":"★★★"},"example_sentences":[{"sentence":"The new sound card is pluggable into any standard computer.","translation":"その新しいサウンドカードは、どの標準的なコンピュータにもプラグイン可能です。","type":"adjective","meaning_category":"プラグイン可能な"},{"sentence":"The pluggable nature of the software allows for easy customization.","translation":"そのソフトウェアのプラグイン可能な性質により、簡単なカスタマイズが可能です。","type":"adjective","meaning_category":"プラグイン可能な"},{"sentence":"We designed a pluggable system so that users could easily add new functionality.","translation":"ユーザーが新しい機能を簡単に追加できるように、プラグイン可能なシステムを設計しました。","type":"adjective","meaning_category":"プラグイン可能な"}]}