{"word":"Chokerman","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(slang, derogatory) A person who is easily choked or falters under pressure; someone who performs poorly in critical situations.","english_definition":"(slang, derogatory) A person who is prone to choking or failing to perform well under pressure, especially in sports or competitive situations.","examples":[{"sentence":"He's a real Chokerman; he always messes up in the final moments.","translation":"彼は本当にチョーカーマンだ。いつも最後の瞬間にしくじる。"},{"sentence":"Don't be a Chokerman; stay calm and focus on the task.","translation":"チョーカーマンになるな。落ち着いて、タスクに集中しろ。"}],"collocations":["a classic Chokerman","Chokerman performance","Chokerman tendencies"],"synonyms":["choker","bottler","flake","failure"],"antonyms":["clutch performer","winner","champion"]}],"etymology":{"value":"Likely derived from the word 'choke,' referring to the act of failing under pressure, combined with 'man.' It is a relatively recent slang term.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʃoʊkərˌmæn/","syllables":"Cho-ker-man"},"inflection":{"noun_plural":"Chokermans"},"usage_notes":{"explanation":"'Chokerman' is a derogatory slang term used to describe someone who consistently fails to perform well in high-pressure situations. It is often used in sports contexts but can be applied to any situation where someone is expected to perform under stress. The term implies a lack of mental fortitude or an inability to handle pressure.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Chokerman because he is very strong.","correct":"✓ He is a Chokerman because he always fails under pressure.","note":"'Chokerman' implies failure under pressure, not strength. Using it to describe someone strong is incorrect."},{"incorrect":"✗ She is a Chokerman, she always wins.","correct":"✓ She is not a Chokerman, she always wins.","note":"'Chokerman' is the opposite of a winner; it describes someone who consistently loses or fails."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (slang)","frequency_google_ngram":"Low frequency (slang)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Chokerman' is a slang term, primarily used in informal contexts, to describe someone who consistently fails under pressure. It's often used in sports to criticize athletes who perform poorly in crucial moments. The term carries a negative connotation and implies a lack of mental toughness. Understanding the term requires familiarity with slang and informal language use."},"example_sentences":[{"sentence":"The team called him 'Chokerman' after he missed the game-winning shot.","translation":"彼は試合を決めるシュートを外した後、チームから「チョーカーマン」と呼ばれた。","type":"noun","meaning_category":"failure under pressure"},{"sentence":"He doesn't want to be known as a 'Chokerman,' so he practices his free throws every day.","translation":"彼は「チョーカーマン」として知られたくないので、毎日フリースローの練習をしている。","type":"noun","meaning_category":"failure under pressure"}]}