{"word":"Liliales","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ユリ目","english_definition":"An order of flowering plants, also known as the lilies, characterized by having flowers with parts in threes and often showy petals and sepals.","examples":[{"sentence":"Liliales includes families such as Liliaceae (true lilies), Smilacaceae (smilaxes), and Melanthiaceae.","translation":"ユリ目は、ユリ科（真のユリ）、シオデ科（シオデ類）、およびシュロソウ科などの科を含む。"}],"collocations":["belong to Liliales (ユリ目に属する)","members of Liliales (ユリ目のメンバー)"],"synonyms":["lily order"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name 'Lilium' (lily) + '-ales' (a suffix denoting an order in botanical classification).","priority":"★★★"},"pronunciation":{"ipa":"/lɪˈlaɪ.əliːz/","syllables":"Li-li-a-les"},"inflection":{"noun_plural":"Liliales (used as both singular and plural)"},"usage_notes":{"explanation":"Liliales is a taxonomic order used in botany to classify a group of flowering plants, commonly known as lilies and related plants. It is primarily used in scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Liliales is a family.","correct":"✓ Liliales is an order.","note":"Liliales is a taxonomic order, which is a higher-level classification than a family."}],"priority":"★★☆"},"related_words":{"derivatives":["Lilium (lily genus)","Liliaceae (lily family)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - primarily used in botanical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Liliales' is a scientific term referring to a specific order in the classification of flowering plants, commonly known as lilies. It is primarily used in botanical or academic contexts. Understanding this term requires familiarity with biological classification systems."},"example_sentences":[{"sentence":"The evolutionary relationships within Liliales have been studied extensively using molecular data.","translation":"ユリ目内の進化関係は、分子データを用いて広範囲に研究されてきた。","type":"noun","meaning_category":"scientific classification"},{"sentence":"Many plants in the Liliales order are valued for their ornamental flowers.","translation":"ユリ目に属する多くの植物は、観賞用の花として評価されている。","type":"noun","meaning_category":"plant characteristics"}]}