{"word":"intendancy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史) インテンダンス：スペイン植民地帝国において、行政、財政、軍事を担当した官職、またはその管轄区域。","english_definition":"(historical) An intendancy was a type of administrative division in the Spanish colonial empire, or the office of the intendant. An intendancy was governed by an intendant.","examples":[{"sentence":"The intendancy of Buenos Aires was a key administrative unit in the Viceroyalty of the Río de la Plata.","translation":"ブエノスアイレスのインテンダンスは、リオ・デ・ラ・プラタ副王領における重要な行政単位であった。"}],"collocations":["intendancy of (地名)","royal intendancy"],"synonyms":["government","administration","province","district"],"antonyms":[]}],"etymology":{"value":"From Spanish intendencia, from intendente (intendant) + -ia (-y).","priority":"★★★"},"pronunciation":{"ipa":"/ɪnˈtɛndənsi/","syllables":"in-ten-dan-cy"},"inflection":{"noun_plural":"intendancies"},"usage_notes":{"explanation":"The term 'intendancy' is primarily used in a historical context, specifically when discussing the administrative structure of the Spanish colonial empire. It refers to both the office held by an intendant (a high-ranking official) and the geographical area under their jurisdiction. The responsibilities of an intendant typically included overseeing finances, justice, and military affairs within their intendancy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He visited the intendancy in France.","correct":"✓ He visited the prefecture in France.","note":"'Intendancy' specifically refers to the Spanish colonial system. For French administrative divisions, 'prefecture' is more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["intendant (noun: a high-ranking official in the Spanish colonial system)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized historical term)","frequency_google_ngram":"Low frequency - primarily used in historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'intendancy' is a specialized historical term. It is most likely to be encountered in academic texts or historical discussions related to the Spanish colonial empire. Understanding the term requires familiarity with the administrative structures of that period. It is not part of general vocabulary.","note":"This word is not commonly used in modern English outside of historical contexts."},"example_sentences":[{"sentence":"The creation of intendancies aimed to centralize power in the Spanish colonies.","translation":"インテンダンスの創設は、スペイン植民地における権力の中央集権化を目的としていた。","type":"noun","meaning_category":"historical administrative division"},{"sentence":"The intendant was responsible for collecting taxes within his intendancy.","translation":"インテンダントは、自身のインテンダンス内での税金徴収を担当していた。","type":"noun","meaning_category":"historical administrative division"}]}