{"word":"Philo-German","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"親ドイツ的な、ドイツびいきの","english_definition":"Having or showing affection or admiration for Germany, German culture, or the German people.","examples":[{"sentence":"He was accused of being Philo-German because of his admiration for German philosophers.","translation":"彼はドイツの哲学者の崇拝していたため、親ドイツ的だと非難された。"},{"sentence":"The organization promotes Philo-German sentiment and cultural exchange.","translation":"その組織は親ドイツ的な感情と文化交流を促進している。"}],"collocations":["Philo-German sentiments","Philo-German views","Philo-German society"],"synonyms":["Germanophile","pro-German"],"antonyms":["Anti-German","Germanophobe"]},{"part_of_speech":"noun","definition":"親ドイツ主義者、ドイツびいきの人","english_definition":"A person who admires or supports Germany, German culture, or the German people.","examples":[{"sentence":"As a Philo-German, she enjoys attending German cultural events.","translation":"親ドイツ主義者として、彼女はドイツの文化イベントに参加することを楽しんでいる。"},{"sentence":"The Philo-Germans in the group advocated for closer ties with Germany.","translation":"グループ内の親ドイツ主義者たちは、ドイツとのより緊密な関係を提唱した。"}],"collocations":["ardent Philo-German","outspoken Philo-German"],"synonyms":["Germanophile","pro-German"],"antonyms":["Anti-German","Germanophobe"]}],"etymology":{"value":"Derived from the Greek 'philo-' (loving, fond of) combined with 'German', indicating a fondness for Germany or things German.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfaɪloʊˈdʒɜːrmən/","syllables":"Phi-lo-Ger-man"},"inflection":{"notes":"The noun form can be pluralized as 'Philo-Germans'."},"usage_notes":{"explanation":"'Philo-German' is used to describe someone or something that exhibits a positive attitude towards Germany, its culture, or its people. It's important to note that the term can sometimes carry political connotations, especially in historical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Philo-Germanic.","correct":"✓ He is a Philo-German.","note":"The correct term is 'Philo-German', not 'Philo-Germanic'."},{"incorrect":"✗ Philo-Germanism is bad.","correct":"✓ Having Philo-German sentiments is not inherently bad.","note":"While Philo-Germanism itself is not inherently negative, it's important to be aware of the potential political implications and historical context."}],"priority":"★★☆"},"related_words":{"derivatives":["Philo-Germanism (noun: 親ドイツ主義)"],"phrases":["Germanophile (親ドイツ主義者)","Anti-German (反ドイツ的な)","Germanophobia (ドイツ嫌悪症)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Philo-German' is relatively uncommon and is used to describe someone who has a fondness for Germany, its culture, or its people. It can be used in both a neutral and a political context, so understanding the surrounding information is important to grasp the intended meaning. It is often used in discussions about cultural exchange, historical relations, or political alignments.","priority":"★★☆"},"example_sentences":[{"sentence":"The professor's lectures often reflected his Philo-German leanings.","translation":"その教授の講義は、しばしば彼の親ドイツ的な傾向を反映していた。","type":"adjective","meaning_category":"親ドイツ的な"},{"sentence":"Many consider him a Philo-German because of his extensive research on German history.","translation":"多くの人は、彼がドイツの歴史に関する広範な研究を行っているため、彼を親ドイツ主義者と見なしている。","type":"noun","meaning_category":"親ドイツ主義者"}]}