{"word":"intersoled","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"(靴底を)張り替える、再ソールする","english_definition":"To replace the sole of a shoe.","examples":[{"sentence":"I had my boots intersoled because the soles were worn out.","translation":"靴底がすり減っていたので、ブーツの靴底を張り替えてもらった。"},{"sentence":"These shoes can be intersoled multiple times, extending their lifespan.","translation":"これらの靴は何度も靴底を張り替えることができ、寿命を延ばすことができる。"}],"collocations":["intersole shoes","intersole boots"],"synonyms":["resole","re-sole","replace the sole"],"antonyms":["wear out","discard"],"notes":"Typically refers to replacing the outer sole of a shoe, often when the upper part is still in good condition."}],"etymology":{"value":"Derived from 'inter-' (meaning between or among) and 'soled' (having a sole). The 'inter-' prefix suggests the process involves working within the layers of the shoe's construction.","priority":"★★☆"},"pronunciation":{"ipa":"ˌɪntərˈsoʊld","syllables":"in-ter-soled"},"inflection":{"verb_forms":{"present_simple":["intersole","intersoles"],"past_simple":"intersoled","past_participle":"intersoled","present_participle":"intersoling"}},"usage_notes":{"explanation":"'Intersoled' is a relatively uncommon word, primarily used in the context of shoe repair and maintenance. It specifically refers to the process of replacing the sole of a shoe, rather than replacing the entire shoe. This is often done to extend the life of the shoe, especially if the upper part is still in good condition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I intersoled the whole shoe.","correct":"✓ I intersoled the soles of the shoe.","note":"'Intersoled' refers specifically to the soles, not the entire shoe."}],"priority":"★★☆"},"related_words":{"derivatives":["intersole (noun: the new sole being used)","intersoling (noun: the act of replacing the sole)"],"related_terms":["sole","resole","shoe repair","cobbler"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Intersoled' is a technical term related to shoe repair. It means to replace the sole of a shoe, typically when the upper part of the shoe is still in good condition. Understanding this word requires familiarity with shoe construction and repair processes."},"example_sentences":[{"sentence":"The cobbler intersoled my favorite leather shoes, giving them a new lease on life.","translation":"靴職人は私のお気に入りの革靴の靴底を張り替えてくれ、靴が生き返った。","type":"verb","meaning_category":"shoe repair"},{"sentence":"Properly intersoled hiking boots can provide excellent traction on the trails.","translation":"適切に靴底を張り替えたハイキングブーツは、トレイルで優れた牽引力を発揮する。","type":"adjective (participle)","meaning_category":"shoe feature"}]}