{"word":"Canaanite","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"カナン人：古代カナン（現在のレバノン、シリア、イスラエル、パレスチナの一部）に居住していた人々。","english_definition":"A member of a Semitic people inhabiting ancient Canaan and Phoenicia from before the Israelite conquest until the first centuries BCE.","examples":[{"sentence":"The Canaanites worshipped various gods and goddesses.","translation":"カナン人は様々な神々を崇拝していた。"},{"sentence":"Archaeological evidence reveals much about the culture of the Canaanites.","translation":"考古学的証拠は、カナン人の文化について多くを明らかにしている。"}],"collocations":["ancient Canaanites","Canaanite culture","Canaanite religion","Canaanite city-states"],"synonyms":["Phoenician (特に沿岸部のカナン人)"],"antonyms":[]},{"part_of_speech":"adjective","definition":"カナン人の、カナンに関する","english_definition":"Relating to the Canaanites or their language and culture.","examples":[{"sentence":"Canaanite pottery has been found at numerous archaeological sites.","translation":"カナンの陶器は数多くの遺跡から発見されている。"},{"sentence":"The Canaanite language is closely related to Hebrew and Phoenician.","translation":"カナン語はヘブライ語とフェニキア語に密接に関連している。"}],"collocations":["Canaanite language","Canaanite pottery","Canaanite mythology","Canaanite art"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Late Middle English: from late Latin Chanaanites, from Greek Chanaan, from Hebrew Kena‘an, of unknown origin.","priority":"★★☆"},"pronunciation":{"ipa":"ˈkeɪnənaɪt","syllables":"Ca-naan-ite"},"inflection":{"noun_plural":"Canaanites"},"usage_notes":{"explanation":"The term \"Canaanite\" refers to both the people who lived in the ancient region of Canaan and to their culture and language. The Bible mentions the Canaanites as inhabitants of the Promised Land before the arrival of the Israelites. Archaeological and linguistic evidence provides further insights into their history and civilization.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Canaanite's religion was polytheistic.","correct":"✓ The Canaanites' religion was polytheistic.","note":"When referring to the religion of the Canaanite people in general, use the plural possessive 'Canaanites''."},{"incorrect":"✗ Canaanite language is the same as Hebrew.","correct":"✓ The Canaanite language is related to Hebrew.","note":"While related, Canaanite and Hebrew are distinct languages within the same Semitic language family."}],"priority":"★★☆"},"related_words":{"derivatives":["Canaan (noun: カナン - 古代の地名)"],"phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Canaanite\" refers to an ancient people inhabiting the region of Canaan, which corresponds to modern-day Israel, Palestine, Lebanon, and parts of Syria and Jordan. Understanding this word requires some knowledge of ancient history and biblical contexts. It is often used in discussions of archaeology, ancient religions, and the history of the Levant. The word is not commonly used in everyday conversation, so familiarity with it indicates a higher level of education or specialized knowledge."},"example_sentences":[{"sentence":"The Bible describes the conflicts between the Israelites and the **Canaanites**.","translation":"聖書はイスラエル人とカナン人との間の紛争について記述している。","type":"noun","meaning_category":"カナン人"},{"sentence":"Many scholars study the **Canaanite** pantheon of gods.","translation":"多くの学者がカナン人の神々の万神殿を研究している。","type":"adjective","meaning_category":"カナン人の"},{"sentence":"The **Canaanites** were skilled seafarers and traders.","translation":"カナン人は熟練した船乗りであり、貿易業者であった。","type":"noun","meaning_category":"カナン人"}]}