{"word":"anti-Israelism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"反イスラエル主義：イスラエルという国家の存在、政策、またはイデオロギーに反対する立場。","english_definition":"Opposition to the existence, policies, or ideology of the state of Israel.","examples":[{"sentence":"Some critics argue that certain forms of anti-Israelism can be a form of antisemitism.","translation":"一部の批評家は、特定の形の反イスラエル主義は反ユダヤ主義の一形態となり得ると主張している。"},{"sentence":"The debate over anti-Israelism often involves discussions about the Israeli-Palestinian conflict.","translation":"反イスラエル主義をめぐる議論は、しばしばイスラエル・パレスチナ紛争に関する議論を伴う。"},{"sentence":"He was accused of anti-Israelism after criticizing the government's policies.","translation":"彼は政府の政策を批判した後、反イスラエル主義者だと非難された。"}],"collocations":["criticism of Israel (イスラエル批判)","Israeli-Palestinian conflict (イスラエル・パレスチナ紛争)","political ideology (政治的イデオロギー)","antisemitism (反ユダヤ主義)","pro-Palestinian activism (親パレスチナ活動)"],"synonyms":["opposition to Israel","criticism of Israeli policies"],"antonyms":["pro-Israelism","Zionism"]},{"part_of_speech":"noun","definition":"イスラエルの国家としての正当性や存在そのものに反対するイデオロギーまたは運動。","english_definition":"An ideology or movement that opposes the legitimacy or existence of the state of Israel.","examples":[{"sentence":"Anti-Israelism is often conflated with antisemitism, though many argue they are distinct.","translation":"反イスラエル主義はしばしば反ユダヤ主義と混同されるが、多くの人がそれらは異なると主張している。"},{"sentence":"The rise of anti-Israelism on college campuses has been a topic of concern.","translation":"大学のキャンパスにおける反イスラエル主義の高まりは、懸念事項となっている。"}],"collocations":["ideological opposition (イデオロギー的反対)","political movement (政治運動)","college campus (大学のキャンパス)","antisemitic rhetoric (反ユダヤ主義的なレトリック)"],"synonyms":["anti-Zionism","opposition to Zionism"],"antonyms":["Zionism","support for Israel"]}],"etymology":{"value":"\"Anti-\"（反対）+ \"Israel\"（イスラエル）+ \"-ism\"（主義）から構成される。イスラエルという国家またはそのイデオロギーに対する反対意見や立場を表すために作られた言葉。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæntiˈɪzreɪlɪzəm/","syllables":"an-ti-Iz-ra-el-ism"},"inflection":{"noun_plural":"anti-Israelisms"},"usage_notes":{"explanation":"「anti-Israelism」は、イスラエルという国家の政策、行動、または存在そのものに対する反対意見を指す言葉です。この用語の使用はしばしば議論を呼び、特にそれが反ユダヤ主義とどのように関連しているかについて意見が分かれます。重要なのは、イスラエル政府の政策を批判することと、イスラエルという国家の存在そのものを否定することを区別することです。一部の批評家は、特定の反イスラエル的な言説が反ユダヤ主義的なステレオタイプや偏見を助長する可能性があると主張しています。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He supports anti-Israelism because he hates Jewish people.","correct":"✓ He opposes Israeli policies, but he is not antisemitic.","note":"反イスラエル主義と反ユダヤ主義を混同しないこと。イスラエルの政策に反対することは、必ずしもユダヤ人全体に対する憎悪を意味するわけではありません。"},{"incorrect":"✗ Anti-Israelism is always antisemitism.","correct":"✓ Some forms of anti-Israelism can be considered antisemitic, but not all.","note":"反イスラエル主義は常に反ユダヤ主義であるとは限りません。ただし、特定の表現や主張は反ユダヤ主義的な要素を含む可能性があります。"}],"priority":"★★☆"},"related_words":{"derivatives":["anti-Israel (形容詞：反イスラエルの)","anti-Zionism (反シオニズム)","Zionism (シオニズム)","antisemitism (反ユダヤ主義)","pro-Israel (親イスラエルの)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「anti-Israelism」は、イスラエルという国家やその政策に反対する立場を指す言葉であり、政治的、社会的な文脈で使われます。この言葉は、イスラエルの政策に対する批判から、イスラエルという国家の存在そのものを否定するイデオロギーまで、幅広い意味合いを含むことがあります。そのため、この言葉を使う際には、具体的な文脈や意図を明確にすることが重要です。また、反イスラエル主義と反ユダヤ主義は異なる概念ですが、一部の言説や行動は反ユダヤ主義的な要素を含む可能性があるため、注意が必要です。"},"example_sentences":[{"sentence":"The professor's lecture focused on the history of anti-Israelism in Europe.","translation":"教授の講義は、ヨーロッパにおける反イスラエル主義の歴史に焦点を当てていた。","type":"general","meaning_category":"反イスラエル主義の歴史"},{"sentence":"Critics of anti-Israelism argue that it often veils antisemitic sentiments.","translation":"反イスラエル主義の批判者たちは、それがしばしば反ユダヤ主義的な感情を覆い隠していると主張する。","type":"argument","meaning_category":"批判"},{"sentence":"The student group organized a debate on the topic of anti-Israelism and its implications.","translation":"学生団体は、反イスラエル主義とその影響に関する討論会を企画した。","type":"event","meaning_category":"討論会"},{"sentence":"Many people distinguish between criticizing Israeli policies and anti-Israelism.","translation":"多くの人々は、イスラエルの政策を批判することと反イスラエル主義を区別している。","type":"distinction","meaning_category":"区別"}]}