{"word":"unsuburbed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"郊外化されていない、郊外の特性を持たない","english_definition":"Not having the characteristics of a suburb; not suburbanized.","examples":[{"sentence":"The area remained unsuburbed despite the growth of the nearby city.","translation":"その地域は近隣都市の成長にもかかわらず、郊外化されずに残った。"},{"sentence":"They sought an unsuburbed location, far from the bustle of suburban life.","translation":"彼らは郊外生活の喧騒から遠く離れた、郊外化されていない場所を探し求めた。"}],"collocations":["unsuburbed area","unsuburbed location","remain unsuburbed"],"synonyms":["non-suburban","rural","undeveloped","unspoiled"],"antonyms":["suburbanized","developed","urbanized"]},{"part_of_speech":"verb (past participle)","definition":"郊外化されなかった","english_definition":"Not having been made suburban.","examples":[{"sentence":"The landscape remained largely unsuburbed.","translation":"その景観はほとんど郊外化されずに残った。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'un-' (否定の接頭辞) + 'suburbed' (suburb の過去分詞形)","priority":"★★★"},"pronunciation":{"ipa":"/ʌn.səˈbɜːbd/","syllables":"un-sub-urbed"},"inflection":{"notes":"Regular adjective. Verb form is past participle of a hypothetical verb 'to unsurb' (which is not commonly used)."},"usage_notes":{"explanation":"'Unsuburbed' is a relatively uncommon word, primarily used to describe areas or locations that have not undergone suburban development or transformation. It emphasizes the absence of suburban characteristics such as housing developments, shopping centers, and increased population density. It can also imply a preference for or preservation of a more rural or undeveloped environment.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The unsuburbed is better than the suburb.","correct":"An unsuburbed area is better than a suburban area.","note":"'Unsuburbed' is an adjective, so it needs a noun to modify. Using it as a noun is grammatically incorrect."}],"priority":"★★☆"},"related_words":{"derivatives":["suburb","suburban","suburbanize","suburbanization"],"phrases":["unspoiled","undeveloped","rural"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in CEFR-aligned materials)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unsuburbed' is a less common word that means 'not having the characteristics of a suburb' or 'not suburbanized.' It is used to describe areas that have not been developed into suburbs and retain a more rural or undeveloped character. Understanding this word requires familiarity with the concept of suburbanization and the use of the prefix 'un-' to negate a word's meaning."},"example_sentences":[{"sentence":"They were looking for an unsuburbed plot of land to build their dream home.","translation":"彼らは夢の家を建てるために、郊外化されていない土地を探していた。","type":"adjective","meaning_category":"Not suburbanized"},{"sentence":"The island's interior has remained largely unsuburbed, preserving its natural beauty.","translation":"その島の内部はほとんど郊外化されておらず、自然の美しさを保っている。","type":"adjective","meaning_category":"Not suburbanized"}]}