{"word":"Borotno","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A village in Belarus, known for a historical battle during the Polish-Soviet War.","english_definition":"A village in Belarus, notable as the site of a battle during the Polish-Soviet War.","examples":[{"sentence":"The Battle of Borotno was a significant engagement in the Polish-Soviet War.","translation":"ボロトノの戦いは、ポーランド・ソビエト戦争における重要な戦闘でした。"}],"collocations":["Battle of Borotno","Polish-Soviet War","Belarusian village"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Borotno' likely originates from local Belarusian or Slavic roots, potentially related to the landscape or historical significance of the area.","priority":"★☆☆"},"pronunciation":{"ipa":"/bɔˈrɔtnɔ/","syllables":"Bo-rot-no"},"inflection":{},"usage_notes":{"explanation":"'Borotno' is primarily known as a geographical location with historical importance. Its usage is typically limited to discussions of the Polish-Soviet War or regional Belarusian history.","priority":"★☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"related_places":["Belarus","Minsk Region"],"related_events":["Polish-Soviet War"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Borotno' is a proper noun referring to a specific location in Belarus. Its usage is highly specialized, primarily appearing in historical contexts related to the Polish-Soviet War. Understanding requires familiarity with Eastern European geography and military history."},"example_sentences":[{"sentence":"Borotno is a small village located in the Minsk Region of Belarus.","translation":"ボロトノはベラルーシのミンスク州に位置する小さな村です。","type":"geographical","meaning_category":"location"},{"sentence":"Historical accounts detail the fierce fighting that occurred during the Battle of Borotno.","translation":"歴史的記録は、ボロトノの戦いで起こった激しい戦闘について詳しく述べています。","type":"historical","meaning_category":"historical event"}]}