{"word":"cocuswood","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"コクタン、ココボロ","english_definition":"A dense, dark-colored tropical hardwood from trees of the genus Brya, especially Brya ebenus, used for making musical instruments and other fine objects.","examples":[{"sentence":"The clarinet was made of cocuswood.","translation":"そのクラリネットはコクタンで作られていた。"},{"sentence":"Cocuswood is prized for its tonal qualities in woodwind instruments.","translation":"コクタンは、木管楽器の音色の良さで珍重されている。"}],"collocations":["cocuswood clarinet","cocuswood flute","fine cocuswood"],"synonyms":["ebony","granadillo","kingwood","rosewood"],"antonyms":[]},{"part_of_speech":"noun","definition":"コクタンの木","english_definition":"The tree that yields cocuswood, especially Brya ebenus.","examples":[{"sentence":"The cocuswood tree is native to the Caribbean.","translation":"コクタンの木はカリブ海原産である。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From French 'coc bois' (literally 'coke wood'), referring to its charcoal-like appearance when burned.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkoʊkəsˌwʊd/","syllables":"co-cus-wood"},"inflection":{"noun_plural":"cocuswoods"},"usage_notes":{"explanation":"'Cocuswood' refers specifically to the dark, dense wood of trees in the genus Brya, particularly Brya ebenus. It is highly valued for its use in musical instruments, especially woodwinds, due to its tonal properties and stability. The term can also refer to the tree itself.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The furniture was made of cocoswood.","correct":"✓ The furniture was made of rosewood.","note":"'Cocoswood' is a misspelling. The correct term is 'cocuswood', but it is primarily used for musical instruments, not furniture. 'Rosewood' is a more common wood for furniture."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["ebony","rosewood","grenadilla","boxwood","hardwood"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cocuswood' is a relatively rare term referring to a specific type of dark, dense hardwood used primarily in the manufacture of musical instruments, particularly woodwind instruments like clarinets and oboes. It's a specialized term not commonly encountered outside of contexts related to woodworking, musical instrument making, or botany. Understanding the term requires familiarity with different types of wood and their uses."},"example_sentences":[{"sentence":"The antique oboe was crafted from the finest cocuswood.","translation":"そのアンティークのオーボエは、最高級のコクタンで作られていた。","type":"noun","meaning_category":"material"},{"sentence":"Cocuswood provides a rich, resonant tone for clarinets.","translation":"コクタンはクラリネットに豊かで響きの良い音色をもたらす。","type":"noun","meaning_category":"material property"}]}