{"word":"subthalamic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"視床下部の","english_definition":"Relating to or located below the thalamus.","examples":[{"sentence":"The subthalamic nucleus plays a crucial role in motor control.","translation":"視床下核は運動制御において重要な役割を果たす。"},{"sentence":"Subthalamic lesions can result in movement disorders.","translation":"視床下部の病変は運動障害を引き起こす可能性がある。"}],"collocations":["subthalamic nucleus","subthalamic region","subthalamic stimulation"],"synonyms":["hypothalamic","diencephalic"],"antonyms":[]}],"etymology":{"value":"From 'sub-' (below) + 'thalamic' (relating to the thalamus).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsʌbθəˈlæmɪk/","syllables":"sub-tha-lam-ic"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Subthalamic' is a specialized term used primarily in the fields of neuroscience, neuroanatomy, and medicine, particularly neurology and neurosurgery. It describes structures, regions, or processes located or occurring below the thalamus, a key structure in the brain involved in sensory relay and motor function. The most well-known structure associated with this term is the subthalamic nucleus (STN), a component of the basal ganglia.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The thalamic nucleus is below the subthalamic nucleus.","correct":"✓ The subthalamic nucleus is below the thalamus.","note":"Ensure correct anatomical relationships are stated. The subthalamic nucleus is inferior to (below) the thalamus."}],"priority":"★★☆"},"related_words":{"derivatives":["subthalamus","subthalamotomy"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - Primarily used in specialized scientific and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'subthalamic' is highly specialized and technical, primarily encountered in advanced neuroscience, neuroanatomy, and clinical neurology contexts. Understanding requires familiarity with brain anatomy and neurophysiological concepts. It's not typically used in general language or introductory science materials.","target_audience":"Neuroscientists, neurologists, neurosurgeons, and advanced students in related fields."},"example_sentences":[{"sentence":"Deep brain stimulation of the subthalamic nucleus is a treatment option for Parkinson's disease.","translation":"視床下核の深部脳刺激療法は、パーキンソン病の治療選択肢の一つである。","type":"medical","meaning_category":"anatomy"},{"sentence":"The subthalamic region is involved in the regulation of impulsive behavior.","translation":"視床下部領域は衝動的な行動の調節に関与している。","type":"neuroscience","meaning_category":"function"}]}