{"word":"apical","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"頂点の、先端の、頂生（ちょうせい）の","english_definition":"relating to the apex or tip of something.","examples":[{"sentence":"The apical bud is responsible for the plant's primary growth.","translation":"頂芽は植物の一次成長を担っている。"},{"sentence":"Apical meristems are found at the tips of roots and shoots.","translation":"頂端分裂組織は根と芽の先端に見られる。"},{"sentence":"The apical surface of the cell faces the lumen.","translation":"細胞の頂端面は内腔に面している。"}],"collocations":["apical bud (頂芽)","apical meristem (頂端分裂組織)","apical surface (頂端面)","apical dominance (頂端優勢)","apical cell (頂端細胞)"],"synonyms":["terminal","uppermost","summit"],"antonyms":["basal","lower","bottom"],"related_terms":["apex","tip","vertex"]}],"etymology":{"value":"Derived from Latin 'apex' meaning 'summit, peak, tip'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈeɪpɪkəl/","syllables":"a-pi-cal"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Apical' is most commonly used in biological and anatomical contexts to describe structures or features located at the apex or tip of an organ or cell. It's often used in botany to describe the location of buds or meristems. In zoology and anatomy, it can refer to the surface or part of a cell or organ that is located at the tip or apex.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The basal bud is at the top of the plant.","correct":"The apical bud is at the top of the plant.","note":"'Apical' refers to the tip or apex, while 'basal' refers to the base or bottom."}],"priority":"★★☆"},"related_words":{"derivatives":["apex (noun): the highest point or tip","apiary (noun): a place where bees are kept (related through the root 'apis' meaning bee, but conceptually linked to a 'top' or 'peak' location)"],"related_scientific_terms":["apical dominance (botany): the phenomenon where the main central stem of a plant is dominant over other side stems.","apical meristem (botany): the meristem at the tip of a shoot or root that causes the shoot or root to increase in length.","apical complex (zoology): a group of organelles found in apicomplexan parasites, used for penetrating host cells."]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency. Primarily found in scientific texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Apical' is a technical term primarily used in scientific contexts, especially in biology (botany and zoology) and anatomy. It describes something located at the apex or tip of a structure. Understanding this word requires familiarity with scientific vocabulary and concepts related to plant and animal anatomy and physiology. It's not commonly used in everyday language."},"example_sentences":[{"sentence":"The **apical** bud of the pine tree is protected by resin.","translation":"松の木の頂芽は樹脂によって保護されている。","type":"adjective","meaning_category":"頂点の"},{"sentence":"The **apical** surface of the epithelial cells is exposed to the external environment.","translation":"上皮細胞の頂端面は外部環境にさらされている。","type":"adjective","meaning_category":"先端の"},{"sentence":"**Apical** dominance ensures the plant grows taller rather than wider.","translation":"頂端優勢は、植物が横に広がるよりも高く成長することを保証する。","type":"adjective","meaning_category":"頂生の"}]}