{"word":"Hispanicize","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"ヒスパニック化する、ヒスパニック文化の影響を与える","english_definition":"To make or become Hispanic in character or culture.","examples":[{"sentence":"The city is becoming increasingly Hispanicized due to the growing Latino population.","translation":"ラテンアメリカ系の人口増加により、その都市はますますヒスパニック化している。"},{"sentence":"The restaurant sought to Hispanicize its menu by adding traditional dishes from Latin America.","translation":"そのレストランは、ラテンアメリカの伝統料理を加えることでメニューをヒスパニック化しようとした。"}],"collocations":["Hispanicize the culture","Hispanicize the menu","Hispanicize the community"],"synonyms":["Latinize","Spanishize"],"antonyms":["Anglicize","Europeanize"]},{"part_of_speech":"verb","transitivity":"vi","definition":"ヒスパニック化される、ヒスパニック文化の影響を受ける","english_definition":"To adopt Hispanic customs, language, or culture.","examples":[{"sentence":"Over time, many aspects of American culture have begun to Hispanicize.","translation":"時が経つにつれて、アメリカ文化の多くの側面がヒスパニック化し始めた。"},{"sentence":"As more people learn Spanish, the local dialect is starting to Hispanicize.","translation":"より多くの人々がスペイン語を学ぶにつれて、地元の言葉がヒスパニック化し始めている。"}],"collocations":["Hispanicize over time","Hispanicize gradually"],"synonyms":["become Latinized","become Spanishized"],"antonyms":["become Anglicized","become Europeanized"]}],"etymology":{"value":"Combination of \"Hispanic\" (relating to Spain or Spanish-speaking countries) and the suffix \"-ize\" (to cause to become).","priority":"★★☆"},"pronunciation":{"ipa":"/hɪˈspænɪsaɪz/","syllables":"His-pan-i-cize"},"inflection":{"verb_forms":{"present_simple":["Hispanicize","Hispanicizes"],"past_simple":"Hispanicized","past_participle":"Hispanicized","present_participle":"Hispanicizing"}},"usage_notes":{"explanation":"\"Hispanicize\" refers to the process of something or someone becoming more Hispanic in nature. This can involve adopting cultural practices, language, or other aspects associated with Hispanic culture. It's often used in the context of cultural shifts and influences.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The process of Hispanicize is happening quickly.","correct":"✓ The process of Hispanicizing is happening quickly.","note":"When used as a continuous action, use the present participle form \"Hispanicizing.\""},{"incorrect":"✗ They are going to Hispanicize.","correct":"✓ They are going to Hispanicize the area.","note":"When used transitively, it requires a direct object."}],"priority":"★★☆"},"related_words":{"derivatives":["Hispanicization (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Hispanicize\" is a term used to describe the process of something becoming more Hispanic in character, culture, or language. It is often used in academic or sociological contexts when discussing cultural assimilation or influence. The word implies a transformation towards Hispanic traits or customs."},"example_sentences":[{"sentence":"The neighborhood began to **Hispanicize** as more families from Latin America moved in.","translation":"ラテンアメリカからの家族がより多く引っ越してくるにつれて、その地域はヒスパニック化し始めた。","type":"verb","meaning_category":"文化的な影響を受ける"},{"sentence":"They decided to **Hispanicize** their business to better serve their clientele.","translation":"彼らは顧客により良いサービスを提供するために、ビジネスをヒスパニック化することを決定した。","type":"verb","meaning_category":"文化的な影響を与える"}]}