{"word":"two-principle","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"二原理論、二元論的原理","english_definition":"A theory or doctrine based on two fundamental principles, often opposing or complementary.","examples":[{"sentence":"The two-principle theory suggests that good and evil are inherent in the universe.","translation":"二原理論は、善と悪が宇宙に内在すると示唆している。"},{"sentence":"The philosophical debate centers on whether a two-principle or single-principle explanation is more accurate.","translation":"哲学的議論は、二原理的説明と単一原理的説明のどちらがより正確であるかに焦点を当てている。"}],"collocations":["two-principle system","two-principle explanation","two-principle approach"],"synonyms":["dualistic principle","bipartite principle"],"antonyms":["single-principle","monistic principle"]}],"etymology":{"value":"The term is formed by combining \"two\" indicating duality, and \"principle\" referring to a fundamental concept or basis.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtuː ˈprɪnsəpəl/","syllables":"two-prin-ci-ple"},"inflection":{"noun_plural":"two-principles"},"usage_notes":{"explanation":"The term \"two-principle\" is often used in philosophical, theological, and scientific contexts to describe systems or theories that rely on two fundamental and often contrasting elements. It is less common than \"dualism\" but can be used to describe specific instances of dualistic thinking.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He advocated a too-principle approach.","correct":"✓ He advocated a two-principle approach.","note":"The correct spelling is \"two-principle,\" not \"too-principle.\""},{"incorrect":"✗ The two principle theory is complex.","correct":"✓ The two-principle theory is complex.","note":"The correct spelling is \"two-principle,\" not \"two principle.\" It should be hyphenated when used as an adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["principle","dualism","bipartite"],"phrases":["dualistic theory","twofold principle"],"related_concepts":["Yin and Yang","good and evil","mind and body"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"two-principle\" is a specialized term primarily used in philosophical and theoretical discussions. It refers to a system or model based on two fundamental concepts or principles. Understanding this term requires familiarity with abstract and theoretical concepts. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The ancient philosophy explored the balance between the two-principle forces of creation and destruction.","translation":"古代哲学は、創造と破壊という二原理の力のバランスを探求した。","type":"noun","meaning_category":"Philosophical concept"},{"sentence":"The economic model operates on a two-principle system of supply and demand.","translation":"その経済モデルは、需要と供給という二原理のシステムで機能する。","type":"noun","meaning_category":"Economic theory"}]}