{"word":"physicalities","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"肉体的特徴、身体的特徴、外見","english_definition":"The physical attributes or characteristics of someone or something; bodily features or appearance.","examples":[{"sentence":"The actor was chosen for the role because his physicalities matched the character's description.","translation":"その俳優は、彼の肉体的特徴がキャラクターの説明と一致していたため、その役に選ばれました。"},{"sentence":"The physicalities of the landscape made it difficult to traverse.","translation":"その地形の身体的特徴のために、そこを横断するのは困難でした。"},{"sentence":"She was interested in the physicalities of dance and how the body moved.","translation":"彼女はダンスの身体的特徴と、体の動き方に興味がありました。"}],"collocations":["physicalities of the body","physicalities of the landscape","examine the physicalities"],"synonyms":["appearance","features","attributes","characteristics","form","build","constitution"],"antonyms":["spiritualities","mental aspects","intangibles"]}],"etymology":{"value":"The word \"physicalities\" is derived from \"physical,\" which comes from the Greek word \"physikos,\" meaning \"natural\" or \"relating to nature.\" The suffix \"-ities\" is added to denote qualities, conditions, or characteristics, thus \"physicalities\" refers to the physical qualities or characteristics of something.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɪzɪˈkælɪtiz/","syllables":"phi-si-cal-i-ties"},"inflection":{"noun_plural":"physicalities"},"usage_notes":{"explanation":"\"Physicalities\" is a plural noun that refers to the physical characteristics, attributes, or features of a person, object, or environment. It is often used when discussing the tangible or observable aspects of something, as opposed to its intangible or abstract qualities. The term can be applied to a wide range of subjects, including human anatomy, landscapes, and artistic creations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The physicality of the idea was hard to grasp.","correct":"✓ The physical aspects of the idea were hard to grasp.","note":"\"Physicalities\" refers to tangible attributes. Use \"aspects\" or \"elements\" when discussing abstract concepts. "},{"incorrect":"✗ He described the physicality of the plan.","correct":"✓ He described the physical details of the plan.","note":"Use \"details\" instead of \"physicality\" when referring to specific physical elements of a plan."}],"priority":"★☆☆"},"related_words":{"derivatives":["physical","physically","physician","physics"],"related_terms":["anatomy","physiology","morphology","structure","form"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"physicalities\" is a relatively uncommon term used to describe the physical attributes or characteristics of something, whether it's a person, object, or environment. It's often used in contexts where a detailed examination of physical features is important, such as in artistic descriptions, scientific analyses, or character portrayals. Because it's a more formal and specific term, it's less frequently used in everyday conversation and more often found in written or academic contexts."},"example_sentences":[{"sentence":"The sculptor paid close attention to the physicalities of the human form.","translation":"彫刻家は人間の形の肉体的特徴に細心の注意を払った。","type":"noun","meaning_category":"肉体的特徴"},{"sentence":"The physicalities of the terrain made it ideal for military defense.","translation":"その地形の身体的特徴は、軍事防衛に理想的でした。","type":"noun","meaning_category":"身体的特徴"},{"sentence":"Her physicalities were often commented on, but she valued her intelligence more.","translation":"彼女の身体的特徴はよく話題にされたが、彼女は自分の知性をより大切にしていた。","type":"noun","meaning_category":"外見"}]}