{"word":"Allodies","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(obsolete) Lands held in absolute ownership, without any feudal obligations or dues to a superior lord.","english_definition":"Lands held in absolute ownership, without acknowledging any superior lord or owing any services or rent; freehold estate.","examples":[{"sentence":"In the past, some lands were held as allodies, free from feudal obligations.","translation":"過去には、封建的な義務から解放された、完全所有権として土地が保有されていた。"}],"collocations":["hold land in allody","allodial title","allodial system"],"synonyms":["freehold","fee simple","absolute ownership"],"antonyms":["feudal tenure","leasehold"]}],"etymology":{"value":"From Medieval Latin *allodium*, from Frankish *alōd* ('full ownership'), from Proto-Germanic *al- ('entire, whole') + *ōþ- ('property, possession').","priority":"★★★"},"pronunciation":{"ipa":"/ˈælədiːz/","syllables":"Al-lo-dies"},"inflection":{"noun_plural":"Allodies"},"usage_notes":{"explanation":"'Allody' refers to land ownership that is free from any feudal obligations or superior landlord. This is in contrast to feudal systems where land ownership is tied to service or rent to a lord. The term is now largely historical and legal, as true allodial ownership is rare in modern legal systems.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has allodial rights to the property, so he has to pay rent.","correct":"✓ He has allodial rights to the property, so he doesn't have to pay rent.","note":"Allodial rights mean the owner does not owe rent or service to anyone."}],"priority":"★★☆"},"related_words":{"derivatives":["allodial (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Allody' is a technical term related to land ownership, specifically referring to land held in absolute ownership without any feudal obligations. It's a concept more relevant in historical and legal contexts, particularly when discussing the evolution of land tenure systems. Understanding requires familiarity with feudalism and property law.","priority":"★★☆"},"example_sentences":[{"sentence":"The concept of allodies is important in understanding the history of land ownership.","translation":"土地所有の歴史を理解する上で、完全所有権の概念は重要である。","type":"noun","meaning_category":"absolute ownership of land"},{"sentence":"Allodial titles are rare in modern legal systems.","translation":"現代の法制度では、完全所有権はまれである。","type":"noun","meaning_category":"absolute ownership of land"}]}