{"word":"lacunulose","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Having a surface full of pits or holes; pitted.","english_definition":"Having a surface full of pits or holes; pitted.","examples":[{"sentence":"The surface of the rock was lacunulose, making it difficult to climb.","translation":"その岩の表面は穴だらけで、登るのが難しかった。"},{"sentence":"The lacunulose texture of the dried mud indicated that it had been exposed to the elements for a long time.","translation":"乾燥した泥の穴だらけの質感は、それが長い間風雨にさらされていたことを示していた。"}],"collocations":["lacunulose surface","lacunulose texture","lacunulose rock"],"synonyms":["pitted","honeycombed","alveolate","porous","fenestrate"],"antonyms":["smooth","even","unpitted"]}],"etymology":{"value":"Derived from the Latin word 'lacuna,' meaning 'pit' or 'gap,' and the suffix '-ose,' indicating abundance or full of.","priority":"★★☆"},"pronunciation":{"ipa":"/ləˈkjuːnjʊləʊs/","syllables":"la-cu-nu-lose"},"inflection":{"notes":"Comparative and superlative forms are 'more lacunulose' and 'most lacunulose,' respectively, as it's a descriptive adjective."},"usage_notes":{"explanation":"'Lacunulose' is a descriptive term mainly used in scientific or technical contexts, such as geology, botany, or materials science, to describe surfaces characterized by numerous small pits or holes. It is not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lacunulose feeling of the fabric was very comfortable.","correct":"✓ The pitted feeling of the fabric was very comfortable.","note":"'Lacunulose' refers to the appearance of a surface with pits, not the feeling. Use 'pitted' or another descriptive word for texture. "},{"incorrect":"✗ The lacunulose structure was caused by erosion.","correct":"✓ The pitted structure was caused by erosion.","note":"While correct, 'pitted' is more common in general usage. 'Lacunulose' is more technical."}],"priority":"★☆☆"},"related_words":{"derivatives":["lacuna (noun): a gap or missing part","lacunar (adjective): relating to or having lacunae or pits"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Lacunulose' is a technical term used to describe a surface characterized by many small pits or holes. It is not commonly used in everyday conversation and is more likely to be encountered in scientific or technical writing, particularly in fields such as geology, botany, or materials science. Understanding this term requires a relatively advanced vocabulary. "},"example_sentences":[{"sentence":"The Martian landscape was described as heavily lacunulose due to the impact of numerous meteorites.","translation":"火星の地形は、多数の隕石の衝突により、穴だらけであると説明された。","type":"descriptive","meaning_category":"pitted"},{"sentence":"The lacunulose surface of the leaf helps to increase its surface area for photosynthesis.","translation":"葉の穴だらけの表面は、光合成のための表面積を増やすのに役立つ。","type":"technical","meaning_category":"pitted"},{"sentence":"The porous rock had a lacunulose appearance, making it ideal for filtering water.","translation":"その多孔質の岩石は穴だらけの外観をしており、水をろ過するのに理想的だった。","type":"scientific","meaning_category":"pitted"}]}