{"word":"arch-flamen","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"古代ローマにおける、特定の神（ユピテル、マルス、クィリヌス）に仕える最高位の神官","english_definition":"The chief priest of a particular god (Jupiter, Mars, or Quirinus) in ancient Rome.","examples":[{"sentence":"The arch-flamen of Jupiter held the highest rank among the flamines.","translation":"ユピテルの最高神官は、神官の中で最も高い地位にあった。"},{"sentence":"The arch-flamen was responsible for performing specific rituals and maintaining the sacred traditions.","translation":"最高神官は、特定の儀式を執り行い、神聖な伝統を維持する責任を負っていた。"}],"collocations":["arch-flamen of Jupiter","arch-flamen of Mars","arch-flamen of Quirinus"],"synonyms":["flamen dialis","flamen martialis","flamen quirinalis"],"antonyms":[]}],"etymology":{"value":"\"arch-\" (chief, principal) + \"flamen\" (a priest in ancient Rome devoted to a particular god).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɑːrtʃ ˈfleɪmən/","syllables":"arch-fla-men"},"inflection":{"noun_plural":"arch-flamens"},"usage_notes":{"explanation":"The term \"arch-flamen\" specifically refers to the chief priest serving one of the three major Roman gods: Jupiter (Flamen Dialis), Mars (Flamen Martialis), and Quirinus (Flamen Quirinalis). The Flamen Dialis (arch-flamen of Jupiter) was the most prestigious of these positions and was subject to numerous religious restrictions.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["flamen","flaminica"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Extremely low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term \"arch-flamen\" is a highly specialized term related to ancient Roman religion. It is unlikely to be encountered outside of academic or historical contexts. Understanding requires familiarity with Roman religious institutions and terminology."},"example_sentences":[{"sentence":"The arch-flamen presided over the most important religious ceremonies of the state.","translation":"最高神官は、国家の最も重要な宗教儀式を主宰した。","type":"example","meaning_category":"General"},{"sentence":"The duties of the arch-flamen of Mars included overseeing military festivals.","translation":"マルスの最高神官の義務には、軍事祭の監督が含まれていた。","type":"example","meaning_category":"Specific duties"}]}