{"word":"pre-Hieronymian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ヒエロニムス以前の","english_definition":"Of or pertaining to the time period before Jerome (c. 347 – 420 AD), particularly in reference to versions of the Bible.","examples":[{"sentence":"The pre-Hieronymian Latin texts show a variety of readings.","translation":"ヒエロニムス以前のラテン語テキストは、さまざまな読み方を示している。"},{"sentence":"Scholars study pre-Hieronymian manuscripts to understand the development of the Vulgate.","translation":"学者はウルガタ聖書の発展を理解するために、ヒエロニムス以前の写本を研究している。"}],"collocations":["pre-Hieronymian text","pre-Hieronymian version","pre-Hieronymian manuscript"],"synonyms":["pre-Vulgate"],"antonyms":["post-Hieronymian","Hieronymian"],"notes":"Used especially in the context of biblical studies and textual criticism."}],"etymology":{"value":"Formed from \"pre-\" (before) + \"Hieronymian\" (of or relating to Jerome). Jerome, also known as Saint Jerome, was a priest, confessor, theologian, and historian, who is best known for his translation of most of the Bible into Latin (the Vulgate).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpriːˌhaɪ.ə.rɒˈnɪ.mi.ən/","syllables":"pre-Hi-er-on-y-mi-an"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"The term 'pre-Hieronymian' is primarily used in academic and theological contexts when discussing the history of the Bible and its various translations. It helps distinguish between versions of the Bible that existed before Jerome's Vulgate and those that came after.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The pre-Jerome text...","correct":"The pre-Hieronymian text...","note":"While 'Jerome' is acceptable, 'Hieronymian' is the more formal and precise term in academic writing."}],"priority":"★★☆"},"related_words":{"derivatives":["Hieronymian","Vulgate"],"related_terms":["Old Latin Bible","Septuagint","textual criticism"]},"level_frequency":{"frequency_google_ngram":"Very low frequency - Primarily used in specialized academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'pre-Hieronymian' is a specialized term used in biblical studies and textual criticism to refer to texts or versions that predate Jerome's Vulgate translation of the Bible. Understanding this term requires familiarity with the historical context of biblical translation and the significance of Jerome's work."},"example_sentences":[{"sentence":"The survival of pre-Hieronymian biblical fragments offers valuable insights into the diversity of early Christian texts.","translation":"ヒエロニムス以前の聖書の断片の現存は、初期キリスト教のテキストの多様性に関する貴重な洞察を提供する。","type":"adjective","meaning_category":"historical context"},{"sentence":"Comparing pre-Hieronymian and Vulgate versions reveals significant textual variations.","translation":"ヒエロニムス以前のバージョンとウルガタ聖書バージョンを比較すると、重要なテキストのバリエーションが明らかになる。","type":"adjective","meaning_category":"textual comparison"}]}