{"word":"euploidy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"正倍数性、真正倍数性","english_definition":"the state of a cell or organism having an exact multiple of the haploid number of chromosomes.","examples":[{"sentence":"Euploidy is essential for normal development in many organisms.","translation":"正倍数性は多くの生物において正常な発達に不可欠である。"},{"sentence":"Polyploidy, a type of euploidy, is common in plants.","translation":"多倍数性（ポリプロイディー）は正倍数性の一種であり、植物によく見られる。"}],"collocations":["polyploidy (多倍数性)","aneuploidy (異数性)"],"synonyms":["polyploidy","monoploidy","diploidy","triploidy","tetraploidy"],"antonyms":["aneuploidy"]},{"part_of_speech":"noun","definition":"(より一般的に)染色体数がゲノムの完全なセットの整数倍である状態","english_definition":"(more generally) the state of having a chromosome number that is an exact multiple of a complete set of chromosomes.","examples":[{"sentence":"Euploidy ensures balanced gene expression.","translation":"正倍数性はバランスの取れた遺伝子発現を保証する。"}],"collocations":[],"synonyms":[],"antonyms":["aneuploidy"]}],"etymology":{"value":"From Greek 'eu-' (good, well) + 'ploidy' (referring to the number of sets of chromosomes).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈjuːˌplɔɪdi/","syllables":"eu-ploid-y"},"inflection":{"noun_plural":"euploidies"},"usage_notes":{"explanation":"Euploidy refers to a condition where a cell or organism has one or more complete sets of chromosomes. This is in contrast to aneuploidy, where there is an abnormal number of individual chromosomes (e.g., having one extra or one missing chromosome). Euploidy is often seen in plants and can lead to new species formation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cell showed euploidy with an extra chromosome.","correct":"✓ The cell showed aneuploidy with an extra chromosome.","note":"Euploidy means having a complete multiple of the haploid chromosome set. An extra single chromosome indicates aneuploidy."}],"priority":"★★☆"},"related_words":{"derivatives":["euploid (adjective, noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Euploidy' is a technical term in genetics referring to cells or organisms with a chromosome number that is an exact multiple of the haploid number. It is important in understanding chromosome abnormalities and evolution, particularly in plants. It is contrasted with 'aneuploidy,' which involves an abnormal number of individual chromosomes rather than complete sets."},"example_sentences":[{"sentence":"The study investigated the effects of euploidy on plant growth and development.","translation":"その研究は、正倍数性が植物の成長と発達に及ぼす影響を調査した。","type":"general","meaning_category":"general"},{"sentence":"Some crop species are naturally euploid, with multiple sets of chromosomes.","translation":"一部の作物種は自然に正倍数性であり、複数の染色体セットを持っている。","type":"specific","meaning_category":"specific"}]}