{"word":"Barletta","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"バルレッタ（イタリア、プーリア州の都市）","english_definition":"A city and comune located in the Apulia region of southeast Italy.","examples":[{"sentence":"Barletta is known for the Colossus of Barletta, a large bronze statue of a Roman emperor.","translation":"バルレッタは、ローマ皇帝の巨大な青銅像であるバルレッタの巨像で知られています。"},{"sentence":"The Battle of Barletta took place near the city in 1503.","translation":"バルレッタの戦いは1503年にこの都市の近くで起こりました。"}],"collocations":["Colossus of Barletta","Battle of Barletta"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name Barletta is thought to derive from the Hebrew word 'Beret' meaning 'new well'.","priority":"★☆☆"},"pronunciation":{"ipa":"/barˈlet.ta/","syllables":"Bar-let-ta"},"inflection":{},"usage_notes":{"explanation":"Barletta is a proper noun, referring to a specific city in Italy. It is generally used in geographical or historical contexts.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Barlettano (adjective/noun: relating to Barletta or a person from Barletta)"],"related_places":["Andria","Trani","Bari","Apulia","Italy"],"priority":"★★☆"},"level_frequency":{},"readability_explanation":{"level":"B2","text":"The word 'Barletta' is a proper noun referring to a specific city in Italy. Understanding its usage requires knowledge of Italian geography and history. It is not a common word in everyday English, but may appear in travel guides, historical texts, or news reports about Italy."},"example_sentences":[{"sentence":"We visited Barletta during our trip to southern Italy.","translation":"私たちは南イタリアへの旅行中にバルレッタを訪れました。","type":"general","meaning_category":"location"},{"sentence":"The architecture in Barletta is a mix of medieval and baroque styles.","translation":"バルレッタの建築様式は、中世とバロック様式が混ざり合っています。","type":"general","meaning_category":"location"},{"sentence":"Barletta is a coastal city with a rich history.","translation":"バルレッタは豊かな歴史を持つ沿岸都市です。","type":"general","meaning_category":"location"}]}