{"word":"thrombocytopenia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"血小板減少症","english_definition":"A condition characterized by an abnormally low level of platelets in the blood.","examples":[{"sentence":"Thrombocytopenia can be caused by various factors, including certain medications and autoimmune disorders.","translation":"血小板減少症は、特定の薬剤や自己免疫疾患を含む様々な要因によって引き起こされる可能性があります。"},{"sentence":"The doctor diagnosed her with thrombocytopenia after a routine blood test revealed a low platelet count.","translation":"医師は、定期的な血液検査で血小板数が少ないことが判明した後、彼女を血小板減少症と診断しました。"}],"collocations":["immune thrombocytopenia","severe thrombocytopenia","drug-induced thrombocytopenia","thrombocytopenia purpura"],"synonyms":["thrombopenia","low platelet count"],"antonyms":["thrombocytosis"]},{"part_of_speech":"noun","definition":"(より具体的に) 特発性血小板減少性紫斑病 (ITP)","english_definition":"(more specifically) Idiopathic thrombocytopenic purpura (ITP).","examples":[{"sentence":"ITP, also known as thrombocytopenia purpura, is an autoimmune disorder.","translation":"ITP（特発性血小板減少性紫斑病）は、自己免疫疾患です。"}],"collocations":["chronic thrombocytopenia","acute thrombocytopenia"],"synonyms":["ITP","idiopathic thrombocytopenic purpura"],"antonyms":[]}],"etymology":{"value":"From 'thrombo-' (relating to a clot), 'cyto-' (relating to a cell), 'penia' (deficiency).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌθrɒmboʊˌsaɪtəˈpiːniə/","syllables":"throm-bo-cy-to-pe-ni-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Thrombocytopenia is a medical term referring to a deficiency of platelets in the blood. Platelets are essential for blood clotting, so a low platelet count can lead to increased risk of bleeding and bruising. The condition can be caused by a variety of factors, including medications, infections, autoimmune disorders, and certain types of cancer.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Thrombocytopenia is a disease where you have too many platelets.","correct":"✓ Thrombocytopenia is a disease where you have too few platelets.","note":"Thrombocytopenia is characterized by a deficiency, not an excess, of platelets."}],"priority":"★★☆"},"related_words":{"derivatives":["thrombocytopenic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Thrombocytopenia' is a complex medical term referring to a condition where there is a lower-than-normal number of platelets in the blood. Platelets are crucial for blood clotting, and a deficiency can lead to bleeding issues. The causes of thrombocytopenia are varied, and diagnosis typically involves a blood test to assess platelet levels. Because it's a specialized medical term, it's primarily used and understood within healthcare contexts."},"example_sentences":[{"sentence":"The patient's lab results indicated severe thrombocytopenia, requiring immediate medical intervention.","translation":"患者の検査結果は重度の血小板減少症を示しており、直ちに医療介入が必要でした。","type":"noun","meaning_category":"血小板減少症"},{"sentence":"Drug-induced thrombocytopenia can occur as a side effect of certain medications.","translation":"薬剤誘発性血小板減少症は、特定の薬の副作用として発生する可能性があります。","type":"noun","meaning_category":"血小板減少症"}]}