{"word":"conchoid","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"コンコイド：ある点からの距離が一定である点を通る直線が、別の与えられた曲線と交わる点の軌跡。","english_definition":"A curve derived from another curve by marking off, on lines passing through a fixed point, a constant distance from their points of intersection with the given curve.","examples":[{"sentence":"The conchoid of Nicomedes was used by ancient Greek mathematicians to solve the problems of angle trisection and cube duplication.","translation":"ニコマデスのコンコイドは、古代ギリシャの数学者によって角の三等分問題と立方体倍積問題を解くために使用されました。"}],"collocations":["conchoid of Nicomedes"],"synonyms":["curve","geometric curve"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の 'konchoeides' (κογχοειδής) から派生し、'konchē' (κογχη) すなわち「貝殻」と '-oeides' (-οειδής) すなわち「～のような」を組み合わせた言葉。これは、特定のコンコイドの形状が貝殻に似ていることに由来する。","priority":"★★☆"},"pronunciation":{"ipa":"ˈkɒŋkɔɪd","syllables":"con-choid"},"inflection":{"noun_plural":"conchoids"},"usage_notes":{"explanation":"コンコイドは、幾何学における特殊な曲線の一種であり、特定の点（極）からの距離が一定である直線が、別の曲線（通常は直線または円）と交わる点の軌跡として定義される。コンコイドは、与えられた曲線と極の位置によって様々な形状を取り、古代ギリシャの数学者によって特定の幾何学的な問題を解くために用いられた。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The conchoid is a type of solid.","correct":"✓ The conchoid is a type of curve.","note":"コンコイドは立体ではなく、曲線です。"},{"incorrect":"✗ Conchoids are only based on circles.","correct":"✓ Conchoids can be based on any curve, but are commonly based on lines or circles.","note":"コンコイドは任意の曲線に基づいて作成できますが、直線または円が一般的です。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["cissoid","strophoid"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"非常に低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**conchoid**」は、数学、特に幾何学の分野で使われる専門用語です。これは、ある特定の点からの距離が一定である直線が、別の曲線と交わる点の軌跡として定義される曲線を指します。この単語は、数学や工学の高度な文脈でしか使われないため、一般的な日常会話には登場しません。この単語を理解するには、幾何学的な概念と曲線の定義に関する知識が必要です。"},"example_sentences":[{"sentence":"The equation of the conchoid can be expressed in polar coordinates.","translation":"コンコイドの式は極座標で表現できます。","type":"noun","meaning_category":"幾何学"},{"sentence":"The conchoid was studied by Nicomedes in connection with the problem of duplicating the cube.","translation":"コンコイドは、立方体倍積問題との関連でニコマデスによって研究されました。","type":"noun","meaning_category":"歴史的応用"}]}