{"word":"Alphatype","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A phototypesetting machine or system developed in the mid-20th century.","english_definition":"A brand of phototypesetting machine or system, popular in the mid-20th century, that used photographic techniques to generate type.","examples":[{"sentence":"The design studio upgraded from metal type to an Alphatype machine in the 1960s.","translation":"そのデザインスタジオは1960年代に活字からAlphatypeマシンにアップグレードした。"},{"sentence":"Alphatype systems were known for their flexibility in font selection.","translation":"Alphatypeシステムはフォント選択の柔軟性で知られていた。"}],"collocations":["Alphatype machine","Alphatype system","phototypesetting","font selection"],"synonyms":["phototypesetter","typesetting machine"],"antonyms":[]}],"etymology":{"value":"Derived from 'alpha' (referring to the alphabet) and 'type' (referring to typography).","priority":"N/A"},"pronunciation":{"ipa":"/ˈælfəˌtaɪp/","syllables":"Al-pha-type"},"inflection":{"notes":"Plural: Alphatypes"},"usage_notes":{"explanation":"'Alphatype' refers specifically to a brand of phototypesetting equipment. It's a historical term, as these machines have largely been replaced by digital typesetting systems. Use of the term implies a discussion of typesetting technology from the mid-20th century.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He used an alphatype font on his computer.","correct":"✓ He used a digital font on his computer.","note":"'Alphatype' refers to the machine, not the font itself. Use 'digital font' or specify the font name."}],"priority":"N/A"},"related_words":{"derivatives":["phototypesetting","typesetting","typography"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily in historical contexts related to printing and typography.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Alphatype' is a technical term related to the history of printing and typesetting. It refers to a specific brand of phototypesetting machine used in the mid-20th century. Understanding this term requires familiarity with the evolution of printing technology. It is not commonly used outside of discussions about the history of graphic design and printing.","priority":"N/A"},"example_sentences":[{"sentence":"The old printing house still had a working Alphatype machine.","translation":"その古い印刷所にはまだ稼働中のAlphatypeマシンがあった。","type":"noun","meaning_category":"phototypesetting machine"},{"sentence":"Alphatype technology revolutionized the speed of typesetting in the 1960s.","translation":"Alphatype技術は1960年代に写植の速度を革命的に向上させた。","type":"noun","meaning_category":"phototypesetting system"}]}