{"word":"rusty-branched","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"さびた枝を持つ、さび色の枝を持つ","english_definition":"Having branches that are rusty in color or appearance.","examples":[{"sentence":"The rusty-branched tree stood stark against the winter sky.","translation":"さび色の枝を持つ木が、冬の空を背景にくっきりと立っていた。"},{"sentence":"We walked through the rusty-branched forest, the leaves crunching under our feet.","translation":"私たちはさび色の枝を持つ森を歩き、足元で葉がカサカサと音を立てた。"}],"collocations":["rusty-branched tree","rusty-branched forest","rusty-branched shrub"],"synonyms":["rust-colored branches","reddish-brown branches"],"antonyms":["green-branched","leafy-branched","vibrant-branched"]}],"etymology":{"value":"The word is a compound adjective formed by combining \"rusty\" (resembling rust in color or texture) and \"branched\" (having branches).","priority":"★★★"},"pronunciation":{"ipa":"/ˈrʌsti ˈbræntʃt/","syllables":"rus-ty brancht"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"\"Rusty-branched\" is a descriptive adjective, often used in literature or nature writing to evoke a specific visual image. It suggests a tree or plant with branches that have a reddish-brown, oxidized appearance, similar to rust. The term can create a sense of age, decay, or a particular seasonal atmosphere.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tree was rusty branch.","correct":"✓ The tree was rusty-branched.","note":"\"Rusty-branched\" is a compound adjective, so it should be used to directly modify a noun. Avoid separating the adjective components."}],"priority":"★★☆"},"related_words":{"derivatives":["rusty (adjective)","branch (noun)","branched (adjective)"],"related_terms":["rust-colored","reddish-brown","oxidized"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (uncommon)","frequency_google_ngram":"Very low frequency - likely not found in common corpora.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Rusty-branched' is a descriptive adjective used to characterize something, typically a tree or shrub, as having branches that resemble rust in color or texture. Due to its specific and descriptive nature, it is not commonly used in everyday conversation but may appear in descriptive writing or literature. The term evokes a visual image of reddish-brown, aged, or weathered branches. Understanding the individual components, 'rusty' and 'branched,' aids in comprehending the word's meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The artist painted a landscape featuring a solitary, rusty-branched oak.","translation":"その画家は、孤独なさび色の枝を持つオークを描いた風景画を描いた。","type":"adjective","meaning_category":"description"},{"sentence":"The path wound through a grove of rusty-branched trees, their leaves long since fallen.","translation":"道はさび色の枝を持つ木の茂みを縫うように続き、葉はとうに落ちていた。","type":"adjective","meaning_category":"description"}]}