{"word":"unguardable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"守ることができない、防御できない、ガード不能な","english_definition":"impossible to guard or defend against; undefendable; (of a shot or move in sports) impossible to block or defend against.","examples":[{"sentence":"The castle was unguardable due to its weak walls.","translation":"その城は壁が弱いため、守ることができなかった。"},{"sentence":"His shot was unguardable; it went straight into the net.","translation":"彼のシュートはガード不能で、そのままネットに入った。"},{"sentence":"The vulnerability in the system made it unguardable against cyber attacks.","translation":"システムの脆弱性により、サイバー攻撃に対して防御不可能になった。"}],"collocations":["unguardable shot (ガード不能なシュート)","unguardable attack (防御不能な攻撃)","unguardable vulnerability (防御できない脆弱性)"],"synonyms":["undefendable","unprotectable","invulnerable (sometimes used figuratively, though technically means 'impossible to harm')"],"antonyms":["guardable","defendable","protectable"]}],"etymology":{"value":"prefix 'un-' (not) + 'guardable' (able to be guarded).","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈɡɑːrdəbəl/","syllables":"un-guard-a-ble"},"inflection":{"notes":"Adjective, comparative and superlative forms are possible but rare (more unguardable, most unguardable)."},"usage_notes":{"explanation":"'Unguardable' is most often used in the context of sports, particularly basketball or soccer, to describe a shot or move that is so skillful or well-executed that the opposing player cannot defend against it. It can also be used more broadly to describe something that is impossible to protect or defend, such as a physical location or a computer system.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The secret was unguardable.","correct":"✓ The secret was impossible to keep. / ✓ The secret was impossible to guard.","note":"While 'unguardable' can be used figuratively, it's more common to use 'impossible to keep' or 'impossible to guard' when referring to secrets or information."}],"priority":"★★☆"},"related_words":{"derivatives":["guard (verb, noun)","guardable (adjective)","unguarded (adjective)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Not commonly found in CEFR lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unguardable' is formed by adding the prefix 'un-' to 'guardable,' indicating the opposite meaning. It describes something that cannot be guarded or defended against. This word is often used in sports contexts to describe shots or moves that are very difficult or impossible to block. In more general contexts, it can refer to something that is impossible to protect or defend due to inherent weaknesses or vulnerabilities."},"example_sentences":[{"sentence":"The basketball player's crossover dribble made him virtually unguardable.","translation":"そのバスケットボール選手のクロスオーバードリブルは、彼を実質的にガード不能にした。","type":"adjective","meaning_category":"sports"},{"sentence":"The website's lack of security protocols made it unguardable against hackers.","translation":"そのウェブサイトのセキュリティプロトコルの欠如は、ハッカーに対して防御不可能にした。","type":"adjective","meaning_category":"general security"},{"sentence":"His speed and agility made his attacks unguardable.","translation":"彼のスピードと敏捷性は、彼の攻撃を防御不能にした。","type":"adjective","meaning_category":"general defense"}]}