{"word":"Omniactuality","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The state of encompassing all realities or possibilities in existence; the totality of all that is actual.","english_definition":"The state of encompassing all realities or possibilities in existence; the totality of all that is actual.","examples":[{"sentence":"The concept of omniactuality suggests that every possible reality exists in some form.","translation":"オムニアクチュアリティの概念は、あらゆる可能な現実が何らかの形で存在することを示唆している。"},{"sentence":"Philosophers debate whether omniactuality is a coherent or contradictory idea.","translation":"哲学者は、オムニアクチュアリティが一貫性のある考えなのか、矛盾した考えなのかを議論している。"}],"collocations":["the nature of omniactuality","the principle of omniactuality","explore omniactuality","understand omniactuality"],"synonyms":["total reality","universal existence","absolute actuality","complete existence"],"antonyms":["nonexistence","nothingness","unreality"]}],"etymology":{"value":"Derived from the Latin words 'omni' (all) and 'actuality' (the state of being actual or real).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒmniækˈtjuːæləti/","syllables":"om-ni-ac-tu-al-i-ty"},"inflection":{"noun_plural":"omniactualities"},"usage_notes":{"explanation":"'Omniactuality' is a philosophical term used to describe the concept that all possible realities or existences are, in some way, actual. It is often used in discussions of metaphysics, cosmology, and theoretical physics, particularly in the context of multiverse theories. The term is relatively rare and primarily found in academic or philosophical texts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The omniactuality is a simple concept.","correct":"✓ The concept of omniactuality is complex.","note":"Omniactuality is a complex philosophical concept and not easily simplified."},{"incorrect":"✗ He lived in omniactuality.","correct":"✓ He studied omniactuality.","note":"Omniactuality is a concept that is studied or discussed, not a place someone lives in."}],"priority":"★☆☆"},"related_words":{"derivatives":["omniactual (adjective)"],"related_concepts":["multiverse","modal realism","possible worlds","actuality","potentiality"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Primarily found in philosophical or theoretical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Omniactuality' is a highly abstract and philosophical term. It is typically encountered in advanced academic contexts, particularly in discussions related to metaphysics, cosmology, and theories of existence. Understanding this term requires familiarity with philosophical concepts and abstract reasoning. It is not commonly used in everyday language.","priority":"★☆☆"},"example_sentences":[{"sentence":"The theory of modal realism posits a form of omniactuality, where all possible worlds are equally real.","translation":"様相実在論の理論は、あらゆる可能な世界が等しく現実であるオムニアクチュアリティの一形態を仮定している。","type":"theoretical","meaning_category":"philosophical concept"},{"sentence":"Some physicists explore the idea of omniactuality in the context of multiverse theories.","translation":"一部の物理学者は、多元宇宙論の文脈でオムニアクチュアリティの概念を探求している。","type":"scientific","meaning_category":"theoretical physics"},{"sentence":"The philosophical implications of omniactuality are vast and complex, touching on questions of free will and determinism.","translation":"オムニアクチュアリティの哲学的含意は広大かつ複雑であり、自由意志と決定論の問題に触れている。","type":"philosophical","meaning_category":"metaphysics"}]}