{"word":"underframing","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"（鉄道車両などの）下部構造、台枠","english_definition":"The structural framework underneath a vehicle, especially a railway carriage or wagon.","examples":[{"sentence":"The underframing of the train car was reinforced to handle the heavy load.","translation":"その列車の客車の下部構造は、重い荷物を扱えるように補強された。"},{"sentence":"Damage to the underframing can compromise the safety of the entire vehicle.","translation":"下部構造への損傷は、車両全体の安全性を損なう可能性がある。"}],"collocations":["railway underframing (鉄道車両の下部構造)","carriage underframing (客車の下部構造)","wagon underframing (貨車の下部構造)","steel underframing (鋼鉄製の下部構造)"],"synonyms":["chassis","framework","substructure"],"antonyms":[],"notes":"Typically used in the context of railway vehicles, but can also refer to the undercarriage of other vehicles."}],"etymology":{"value":"Derived from 'under' (below) and 'framing' (the act or process of constructing a framework).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʌndərˌfreɪmɪŋ/","syllables":"un-der-fra-ming"},"inflection":{"noun_plural":"underframings"},"usage_notes":{"explanation":"'Underframing' refers specifically to the structural components located beneath a vehicle, providing support and stability. It is a technical term commonly used in engineering and transportation industries.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The underframing was made of wood, which is not very strong.","correct":"✓ The underframing was made of wood, which is not very durable.","note":"'Strong' refers to the ability to withstand force, while 'durable' refers to the ability to withstand wear and tear over time. In the context of structural components, 'durable' is more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["underframe (noun: a structural frame underneath a vehicle)","framing (noun: the act or process of constructing a framework)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Underframing' is a technical term primarily used in the context of vehicles, especially railway cars. It refers to the structural framework located underneath the vehicle, providing support and stability. Understanding this term requires familiarity with engineering and transportation concepts.","notes":"This term is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The engineers inspected the underframing for signs of corrosion.","translation":"エンジニアは腐食の兆候がないか下部構造を検査した。","type":"noun","meaning_category":"下部構造"},{"sentence":"The new design incorporates a lighter, yet stronger, underframing.","translation":"新しい設計には、より軽量でありながら、より強力な下部構造が組み込まれている。","type":"noun","meaning_category":"下部構造"}]}