{"word":"Drusi","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ドルーズ派の人、またはドルーズ派に関連するもの","english_definition":"A member of, or relating to, the Druze, an esoteric monotheistic religious community primarily residing in Lebanon, Syria, Israel, and Jordan.","examples":[{"sentence":"The Drusi are known for their unique religious beliefs.","translation":"ドルーズ派は、彼らの独特な宗教的信念で知られています。"},{"sentence":"He is a Drusi from Lebanon.","translation":"彼はレバノン出身のドルーズ派の人です。"},{"sentence":"Drusi villages are often located in mountainous regions.","translation":"ドルーズ派の村は、しばしば山岳地域に位置しています。"}],"collocations":["Drusi community","Drusi religion","Drusi village","Drusi culture"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the name of Muhammad bin Ismail Nashtakin ad-Darazi, an Ismaili scholar and preacher who came to be regarded as a heretic by the Druze themselves.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdruːzi/","syllables":"Dru-si"},"inflection":{"noun_plural":"Drusis"},"usage_notes":{"explanation":"The term \"Drusi\" refers to both the people and anything related to the Druze faith or culture. It's important to note that the Druze religion is esoteric, meaning that its teachings are not widely shared with outsiders.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Druze people.","correct":"✓ He is a Druze person. / ✓ He is a Drusi.","note":"\"Druze\" is used as an adjective or to refer to the religion itself. \"Drusi\" is the correct term for an individual. Alternatively, \"Druze person\" can be used."}],"priority":"★★☆"},"related_words":{"derivatives":["Druze (adjective, noun: relating to the Druze)","Druzeism (noun: the Druze religion)"],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"Drusi\" refers to a member of the Druze community, a religious group primarily located in the Middle East. Understanding this term requires some familiarity with the region and its diverse religious groups. It's important to use the term respectfully and accurately, recognizing the unique cultural and religious identity of the Druze people."},"example_sentences":[{"sentence":"Many **Drusi** served in the Israeli army.","translation":"多くのドルーズ派の人々がイスラエル軍に従軍しました。","type":"noun","meaning_category":"Person"},{"sentence":"The **Drusi** religion is a syncretic faith with elements of Islam, Christianity, and other traditions.","translation":"ドルーズ派の宗教は、イスラム教、キリスト教、その他の伝統の要素を持つ混合宗教です。","type":"adjective (used as noun)","meaning_category":"Religion"},{"sentence":"He visited a **Drusi** village in the mountains of Lebanon.","translation":"彼はレバノンの山にあるドルーズ派の村を訪れました。","type":"adjective","meaning_category":"Location"}]}