{"word":"haemogram","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"血液像、血球算定図","english_definition":"A blood test that provides information about the different types of blood cells, such as red blood cells, white blood cells, and platelets.","examples":[{"sentence":"The doctor ordered a haemogram to check for any abnormalities in my blood.","translation":"医師は私の血液に異常がないか確認するために血液像を指示した。"}],"collocations":["complete haemogram","full haemogram"],"synonyms":["complete blood count (CBC)","blood count"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'haemo-' (blood) and '-gram' (record).","priority":"★★☆"},"pronunciation":{"ipa":"ˈhiːməˌɡræm","syllables":"hee-mo-gram"},"inflection":{"noun_plural":"haemograms"},"usage_notes":{"explanation":"A haemogram, also known as a complete blood count (CBC), is a common blood test used to evaluate overall health and detect a wide range of disorders, including anemia, infection, and leukemia. It measures the levels of various blood components.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need a haemogram for my heart.","correct":"✓ I need a haemogram to check my blood cells.","note":"A haemogram is specifically for analyzing blood components, not directly related to heart function."}],"priority":"★★☆"},"related_words":{"derivatives":["haematology","haematologist"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A haemogram is a medical term referring to a blood test that measures and evaluates the different types of cells in your blood. It is used to assess overall health and detect various disorders. This term is primarily used in medical contexts.","note":"This term is more common in medical or scientific contexts."},"example_sentences":[{"sentence":"The haemogram revealed a slightly elevated white blood cell count.","translation":"血液像は、白血球数がわずかに上昇していることを明らかにした。","type":"medical","meaning_category":"blood test"},{"sentence":"A routine haemogram is often part of a comprehensive health checkup.","translation":"定期的な血液像は、包括的な健康診断の一部としてよく行われる。","type":"medical","meaning_category":"blood test"}]}