{"word":"tetragonal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"正方晶系の、四方晶系の","english_definition":"Relating to or denoting a crystal system in which there are three axes at right angles, two of which are equal.","examples":[{"sentence":"Tetragonal crystals are characterized by one four-fold axis of symmetry.","translation":"正方晶系の結晶は、1つの4回回転対称軸によって特徴づけられる。"},{"sentence":"The mineral has a tetragonal structure.","translation":"その鉱物は正方晶系の構造を持つ。"}],"collocations":["tetragonal crystal","tetragonal system","tetragonal structure"],"synonyms":["quadratic (less common)"],"antonyms":["cubic","orthorhombic","monoclinic","triclinic","hexagonal","trigonal"]},{"part_of_speech":"noun","definition":"正方晶系","english_definition":"The tetragonal crystal system.","examples":[{"sentence":"The mineral belongs to the tetragonal system.","translation":"その鉱物は正方晶系に属する。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From tetra- + -gonal, referring to the four-sided nature of the unit cell's base.","priority":"★★☆"},"pronunciation":{"ipa":"/tɛˈtræɡənəl/","syllables":"te-trag-o-nal"},"inflection":{"notes":"The adjective 'tetragonal' does not have different forms for comparative or superlative degrees. The noun form is simply 'tetragonal' referring to the system itself."},"usage_notes":{"explanation":"'Tetragonal' is primarily used in the context of crystallography and materials science to describe a specific crystal system. It's important to distinguish it from other crystal systems like cubic, hexagonal, or orthorhombic. The key characteristic of a tetragonal system is that it has three axes at right angles, with two axes of equal length and the third axis being of a different length.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The shape is tetragonal, like a cube.","correct":"✓ The shape is tetragonal, but unlike a cube, one axis is longer or shorter than the other two.","note":"A cube is cubic, not tetragonal. Tetragonal structures have two equal axes and one unequal axis, whereas cubic structures have three equal axes."}],"priority":"★★☆"},"related_words":{"derivatives":["tetragonality (noun): The degree to which a structure deviates from cubic symmetry to tetragonal symmetry."],"phrasal_verbs":[],"related_terms":["crystal system","crystallography","unit cell","axis of symmetry"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tetragonal' is a technical term used in crystallography to describe a specific crystal system. Understanding this term requires knowledge of basic crystallography concepts such as crystal lattices, axes, and symmetry. It's typically encountered in advanced science or engineering contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"Many high-temperature superconductors have a tetragonal crystal structure at room temperature.","translation":"多くの高温超伝導体は、室温で正方晶系の結晶構造を持つ。","type":"adjective","meaning_category":"Describing crystal structure"},{"sentence":"The material's tetragonal distortion affects its magnetic properties.","translation":"その材料の正方晶系の歪みが、その磁気特性に影響を与える。","type":"adjective","meaning_category":"Describing material properties"},{"sentence":"Analysis confirmed that the sample was a tetragonal phase.","translation":"分析により、サンプルが正方晶相であることが確認された。","type":"adjective","meaning_category":"Describing material phase"}]}