{"word":"genethliacally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"星占術的に、誕生星占いの方法で","english_definition":"In a genethliacal manner; according to the principles of genethliacal astrology.","examples":[{"sentence":"The events were interpreted genethliacally, linking them to the individual's birth chart.","translation":"その出来事は、個人の出生図と関連付けて、誕生星占術的に解釈されました。"}],"collocations":[],"synonyms":["astrologically","horoscopically"],"antonyms":[]}],"etymology":{"value":"Derived from 'genethliacal' (relating to genethliacs, or natal astrology) + '-ly' (forming adverbs). 'Genethliacal' comes from Greek 'genethliakos' (relating to birth).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdʒɛnəˈθlaɪək(ə)li/","syllables":"ge-neth-li-ac-al-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Genethliacally' is a specialized term primarily used in the context of astrology, specifically natal astrology (also known as genethlialogy). It describes actions or interpretations performed according to the principles and methods of analyzing birth charts to predict or understand a person's life and character.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["genethliac (noun): a practitioner of natal astrology","genethlialogy (noun): natal astrology"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Genethliacally' is a highly specialized term related to astrology. It is unlikely to be encountered outside of texts specifically discussing natal astrology and its techniques. Understanding requires familiarity with astrological terminology."},"example_sentences":[{"sentence":"The astrologer analyzed the birth chart genethliacally to determine the client's strengths and weaknesses.","translation":"占星術師は、クライアントの長所と短所を判断するために、出生図を誕生星占術的に分析しました。","type":"adverb","meaning_category":"星占術的に"}]}