{"word":"Un-Pythagorean","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Not conforming to or characteristic of the principles, teachings, or beliefs associated with Pythagoras or Pythagoreanism.","english_definition":"Not conforming to or characteristic of the principles, teachings, or beliefs associated with Pythagoras or Pythagoreanism.","examples":[{"sentence":"His approach to mathematics was considered un-Pythagorean because it emphasized practical applications over abstract theory.","translation":"彼の数学へのアプローチは、抽象的な理論よりも実践的な応用を重視していたため、非ピタゴラス的であると考えられていた。"},{"sentence":"The artist's rejection of geometric forms in favor of organic shapes was seen as an un-Pythagorean aesthetic choice.","translation":"幾何学的な形を拒否し、有機的な形を好む芸術家の態度は、非ピタゴラス的な美的選択と見なされた。"}],"collocations":["un-Pythagorean approach","un-Pythagorean view","un-Pythagorean philosophy","un-Pythagorean aesthetic"],"synonyms":["non-Pythagorean","anti-Pythagorean"],"antonyms":["Pythagorean"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to the word 'Pythagorean'. 'Pythagorean' refers to Pythagoras, a Greek philosopher and mathematician, or to his followers and their doctrines.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnpaɪˌθæɡəˈriːən/","syllables":"Un-Py-thag-o-re-an"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than forming comparative and superlative degrees (which are less common for this word)."},"usage_notes":{"explanation":"'Un-Pythagorean' is used to describe something that deviates from the core tenets of Pythagoreanism. This can relate to mathematics, philosophy, lifestyle, or any other area influenced by Pythagorean thought. It often implies a rejection or contradiction of Pythagorean principles.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is unpythagorean.","correct":"✓ He is un-Pythagorean.","note":"The hyphen is important for clarity, especially with less common words formed with prefixes."}],"priority":"★★★"},"related_words":{"derivatives":["Pythagorean","Pythagoreanism"],"related_terms":["Pythagoras","mathematics","philosophy","geometry","number theory"]},"level_frequency":{"CEFR":"C2 (Very low frequency, specialized vocabulary)","frequency_google_ngram":"Very low frequency, not commonly found in general text.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Un-Pythagorean' is a specialized term used to describe something that contradicts or deviates from the principles of Pythagoreanism. Understanding its meaning requires familiarity with the historical and philosophical context of Pythagoras and his followers. The term is rarely used outside of academic or philosophical discussions. The prefix 'un-' negates the meaning of 'Pythagorean,' indicating a departure from Pythagorean beliefs or practices."},"example_sentences":[{"sentence":"The empiricist's reliance on observation was seen as an un-Pythagorean method of gaining knowledge.","translation":"経験主義者の観察への依存は、知識を得るための非ピタゴラス的な方法と見なされた。","type":"adjective","meaning_category":"Not conforming to Pythagorean methods"},{"sentence":"His rejection of the idea that numbers are the basis of reality was an un-Pythagorean stance.","translation":"彼が数を現実の基礎とするという考えを拒否したのは、非ピタゴラス的な立場だった。","type":"adjective","meaning_category":"Deviating from Pythagorean beliefs"}]}