{"word":"biolytic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"生体溶解性の、生物溶解性の","english_definition":"Capable of causing the lysis or dissolution of cells or other biological materials.","examples":[{"sentence":"The biolytic enzyme effectively broke down the bacterial cell walls.","translation":"その生体溶解酵素は効果的に細菌の細胞壁を分解した。"},{"sentence":"Biolytic agents are used in certain medical treatments to dissolve unwanted tissues.","translation":"生体溶解剤は、特定の医療処置において不要な組織を溶解するために使用される。"}],"collocations":["biolytic enzyme","biolytic agent","biolytic activity"],"synonyms":["lytic","cytolytic","dissolving","degradative"],"antonyms":["biostatic","protective","stabilizing"]}],"etymology":{"value":"Derived from the Greek words 'bios' (life) and 'lysis' (loosening, dissolution).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbaɪoʊˈlɪtɪk/","syllables":"bi-o-ly-tic"},"inflection":{"notes":"Comparative and superlative forms are 'more biolytic' and 'most biolytic', respectively, as it is a descriptive adjective."},"usage_notes":{"explanation":"'Biolytic' describes substances or processes that break down biological materials. It is often used in scientific and medical contexts to describe enzymes, agents, or processes that cause cell lysis or tissue dissolution.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The substance was biolithic, causing the rock to erode.","correct":"✓ The substance was biolytic, causing the cells to dissolve.","note":"'Biolytic' refers to the breakdown of biological materials, not geological materials. 'Biolithic' is not a standard term."}],"priority":"★☆☆"},"related_words":{"derivatives":["biolysis (noun): the dissolution of biological materials.","biolytically (adverb): in a biolytic manner."],"related_terms":["lysis","cytolysis","enzyme","bacteria","cell"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily used in scientific and medical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Biolytic' is a technical term used in biology and medicine to describe something that can break down or dissolve cells or other biological materials. It is not a common word in everyday language and is primarily encountered in scientific research papers, medical journals, and related contexts. Understanding this term requires a background in biology or a related field."},"example_sentences":[{"sentence":"The research focused on the biolytic properties of the newly discovered compound.","translation":"その研究は、新しく発見された化合物の生体溶解特性に焦点を当てた。","type":"general","meaning_category":"general"},{"sentence":"Certain viruses exhibit biolytic behavior, destroying host cells during replication.","translation":"特定のウイルスは生体溶解性を示し、複製中に宿主細胞を破壊する。","type":"specific","meaning_category":"specific"}]}