{"word":"idealists","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"理想主義者、理想家","english_definition":"People who are guided more by ideals than by practical considerations.","examples":[{"sentence":"The world needs more idealists who are willing to fight for their beliefs.","translation":"世界は、自分の信念のために戦うことを厭わない、より多くの理想主義者を必要としている。"},{"sentence":"Idealists often face disappointment when their high expectations clash with reality.","translation":"理想主義者は、高い期待が現実と衝突するとき、しばしば失望に直面する。"},{"sentence":"He was surrounded by idealists who believed they could change the world.","translation":"彼は、世界を変えることができると信じる理想主義者に囲まれていた。"}],"collocations":["young idealists","political idealists","social idealists","romantic idealists","naive idealists"],"synonyms":["visionaries","utopians","dreamers","optimists","perfectionists"],"antonyms":["realists","pragmatists","cynics","pessimists"]},{"part_of_speech":"noun","definition":"(哲学)観念論者","english_definition":"Adherents to the philosophical theory of idealism.","examples":[{"sentence":"Idealists believe that reality is fundamentally mental or mentally constructed.","translation":"観念論者は、現実が根本的に精神的であるか、精神的に構築されていると信じている。"},{"sentence":"The debate between idealists and materialists has been a central theme in philosophy for centuries.","translation":"観念論者と唯物論者の間の議論は、何世紀にもわたって哲学の中心的なテーマとなっている。"}],"collocations":["philosophical idealists","subjective idealists","objective idealists","transcendental idealists"],"synonyms":["spiritualists","mentalists"],"antonyms":["materialists","physicalists"]}],"etymology":{"value":"The word \"idealist\" comes from the word \"ideal,\" which is derived from the Greek word \"idea,\" meaning \"form\" or \"pattern.\" The suffix \"-ist\" denotes a person who adheres to or advocates a particular belief system or ideology.","priority":"★★☆"},"pronunciation":{"ipa":"/aɪˈdiːəlɪsts/","syllables":"i-de-al-ists"},"inflection":{"noun_plural":"idealists"},"usage_notes":{"explanation":"The term \"idealists\" can refer to people who hold strong ideals and strive to achieve them, often in the face of opposition or practical difficulties. It can also refer to adherents of the philosophical doctrine of idealism, which posits that reality is fundamentally mental or spiritual in nature. The context usually makes it clear which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a very idealist person.","correct":"✓ He is a very idealistic person.","note":"Use the adjective \"idealistic\" to describe a person who is guided by ideals. \"Idealist\" is a noun referring to a person who holds ideals."},{"incorrect":"✗ The idealists society.","correct":"✓ The idealist society.","note":"Use the adjective \"idealist\" to describe a society that is based on ideals."}],"priority":"★★☆"},"related_words":{"derivatives":["ideal","idealism","idealistic","idealistically"],"phrases":["rose-tinted glasses","pie in the sky"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"idealists\" refers to people who prioritize their ideals and beliefs over practical considerations. They often have a strong vision for how the world should be and are motivated to work towards achieving that vision. The term can also refer to those who subscribe to the philosophical theory of idealism, which asserts that reality is fundamentally mental or spiritual. Understanding the context is crucial to interpreting the intended meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The young idealists were determined to change the world, one step at a time.","translation":"若い理想主義者たちは、一歩ずつ世界を変えることを決意していた。","type":"noun","meaning_category":"People guided by ideals"},{"sentence":"Many social reformers throughout history have been driven by idealistic visions of a more just and equitable society.","translation":"歴史を通して、多くの社会改革者は、より公正で公平な社会という理想的なビジョンに突き動かされてきた。","type":"noun","meaning_category":"People guided by ideals"},{"sentence":"Idealists in philosophy often argue that our perceptions shape our reality.","translation":"哲学における観念論者は、私たちの認識が現実を形作ると主張することが多い。","type":"noun","meaning_category":"Adherents to the philosophical theory of idealism"}]}