{"word":"stelography","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"碑文研究、碑文解読","english_definition":"The study or art of writing or deciphering inscriptions on stone monuments or steles.","examples":[{"sentence":"Stelography provides valuable insights into ancient cultures.","translation":"碑文研究は古代文化への貴重な洞察を提供する。"},{"sentence":"The archaeologist used stelography to understand the historical significance of the monument.","translation":"考古学者はその記念碑の歴史的意義を理解するために碑文研究を用いた。"}],"collocations":["ancient stelography","historical stelography","study of stelography","practice of stelography"],"synonyms":["epigraphy","paleography"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'stele' (στήλη) meaning 'stone slab or pillar' and 'graphy' (γραφία) meaning 'writing or description'.","priority":"★★★"},"pronunciation":{"ipa":"/stiːˈlɒɡrəfi/","syllables":"ste-log-ra-phy"},"inflection":{"noun_plural":"stelographies"},"usage_notes":{"explanation":"Stelography is a specialized field within epigraphy that focuses specifically on inscriptions found on steles, which are upright stone slabs or pillars often used as monuments or markers. It involves not only deciphering the text but also understanding the historical, cultural, and artistic context of the inscription.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is studying stelography as a type of geology.","correct":"✓ He is studying stelography as a branch of epigraphy or history.","note":"Stelography is related to the study of inscriptions, not geology."},{"incorrect":"✗ Stelography is the same as calligraphy.","correct":"✓ Stelography involves deciphering ancient inscriptions, while calligraphy is the art of beautiful handwriting.","note":"Stelography is about reading existing inscriptions, not creating them."}],"priority":"★☆☆"},"related_words":{"derivatives":["stelographer (noun: a person who studies or practices stelography)","stelographic (adjective: relating to stelography)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency - a specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Stelography is a highly specialized term referring to the study and interpretation of inscriptions found on steles (stone or wooden slabs used as monuments). It requires a deep understanding of ancient languages, historical contexts, and archaeological methods. This term is primarily used within academic and research settings related to archaeology, history, and classical studies."},"example_sentences":[{"sentence":"The stelography of the Rosetta Stone was crucial in deciphering Egyptian hieroglyphs.","translation":"ロゼッタストーンの碑文研究は、エジプトの象形文字の解読に不可欠だった。","type":"general","meaning_category":"碑文研究"},{"sentence":"His expertise in stelography allowed him to accurately date the ancient monument.","translation":"彼の碑文研究の専門知識により、古代の記念碑の年代を正確に特定することができた。","type":"general","meaning_category":"碑文研究"}]}