{"word":"quasi-fictitiously","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"半ば架空的に、ほとんどフィクションとして","english_definition":"In a manner that is partly fictional or resembling fiction; in a way that is not entirely factual or real.","examples":[{"sentence":"The events in the movie were presented quasi-fictitiously, blending historical facts with invented scenarios.","translation":"映画の中の出来事は、歴史的事実と創作されたシナリオを混ぜ合わせ、半ば架空的に描かれていた。"},{"sentence":"He quasi-fictitiously recounted his childhood adventures, embellishing them with exaggerated details.","translation":"彼は子供時代の冒険を、誇張された詳細で飾り立て、ほとんどフィクションとして語った。"}],"collocations":["present quasi-fictitiously","recount quasi-fictitiously","describe quasi-fictitiously"],"synonyms":["partly fictional","semi-fictional","almost fictional","not entirely factual"],"antonyms":["factually","realistically","authentically","verifiably"]}],"etymology":{"value":"The word is formed by combining \"quasi-\" (meaning resembling or having some, but not all, of the qualities of) with \"fictitiously\" (in a fictional manner).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkweɪzaɪ fɪkˈtɪʃəsli/","syllables":"qua-si-fic-ti-tious-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"\"Quasi-fictitiously\" describes something presented in a way that blends fact and fiction. It implies that while there might be some basis in reality, the account is not entirely true or accurate, often due to embellishment or invention.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wrote the story quasi-fictional.","correct":"✓ He wrote the story quasi-fictitiously.","note":"The adverb \"quasi-fictitiously\" is needed to modify the verb \"wrote,\" not the adjective \"quasi-fictional.\""}],"priority":"★★☆"},"related_words":{"derivatives":["quasi (adverb, adjective): seemingly; apparently but not really.","fictitiously (adverb): in a fictional or invented way.","fictitious (adjective): not real or true; imaginary or invented.","fiction (noun): literature in the form of prose, especially novels, that describes imaginary events and people."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"This word is relatively rare and complex, used to describe something that is presented in a way that blends fact and fiction. It's often used in academic or literary contexts to describe how stories or events are portrayed with a mix of truth and imagination."},"example_sentences":[{"sentence":"The author quasi-fictitiously portrayed the historical figure, taking liberties with their personal life.","translation":"その作家は、歴史上の人物を半ば架空的に描き、彼らの私生活を自由に脚色した。","type":"adverb","meaning_category":"manner of portrayal"},{"sentence":"The documentary quasi-fictitiously recreated the events, using actors and staged scenes.","translation":"そのドキュメンタリーは、俳優や演出されたシーンを使い、出来事をほとんどフィクションとして再現した。","type":"adverb","meaning_category":"method of recreation"}]}