{"word":"Precelebrations","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(通常複数形) 本番の祝賀行事の前に催される、予行演習的な祝い事、または前祝い","english_definition":"Celebrations that occur before the main event or official celebration.","examples":[{"sentence":"The wedding precelebrations included a rehearsal dinner and a welcome party.","translation":"結婚式のプレセレブレーションには、リハーサルディナーとウェルカムパーティーが含まれていました。"},{"sentence":"We're having precelebrations for her birthday all week.","translation":"彼女の誕生日の前祝いを今週ずっと行っています。"},{"sentence":"The company held precelebrations to commemorate its upcoming anniversary.","translation":"会社は、間近に迫った記念日を記念して、前祝いを開催しました。"}],"collocations":["wedding precelebrations (結婚式の前祝い)","birthday precelebrations (誕生日の前祝い)","anniversary precelebrations (記念日の前祝い)"],"synonyms":["pre-festivities","warm-up celebrations","pre-events"],"antonyms":["postcelebrations","after-party"]},{"part_of_speech":"noun","definition":"(単数形不可) 本番の祝賀行事の前に催される一連のイベント","english_definition":"A series of events that occur before the main event or official celebration.","examples":[{"sentence":"The precelebrations lasted for three days before the actual conference.","translation":"本会議の前に、3日間のプレセレブレーションが行われました。"},{"sentence":"The precelebrations are designed to build excitement for the festival.","translation":"プレセレブレーションは、フェスティバルへの期待感を高めるように設計されています。"}],"collocations":["week-long precelebrations (一週間にわたる前祝い)","three-day precelebrations (3日間の前祝い)"],"synonyms":["lead-up events","preliminary events","pre-activities"],"antonyms":["follow-up events","post-events"]}],"etymology":{"value":"The word \"precelebrations\" is formed by adding the prefix \"pre-\" (meaning 'before') to the word \"celebrations.\" This indicates that the celebrations occur before the main event or official celebration.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpriːˌsɛlɪˈbreɪʃənz/","syllables":"pre-cel-e-bra-tions"},"inflection":{"noun_plural":"precelebrations"},"usage_notes":{"explanation":"\"Precelebrations\" refers to events or activities that take place in anticipation of a larger, more significant celebration. It often involves gatherings, parties, or special events designed to build excitement and anticipation for the main event. The term is typically used in the plural form, as it usually involves a series of events rather than a single occasion.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ We had a precelebration for the wedding.","correct":"✓ We had precelebrations for the wedding.","note":"The term is typically used in the plural form, as it usually involves a series of events rather than a single occasion."},{"incorrect":"✗ The precelebration was very fun.","correct":"✓ The precelebrations were very fun.","note":"The term is typically used in the plural form, as it usually involves a series of events rather than a single occasion."}],"priority":"★★☆"},"related_words":{"derivatives":["celebration","celebrate","pre-party","pre-event"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"precelebrations\" is a compound word formed by adding the prefix \"pre-\" to \"celebrations.\" It refers to events or activities that occur before a main celebration, often to build excitement or anticipation. The word is not very common, but its meaning can be easily understood from its components. It is typically used in the plural form, as it usually involves a series of events rather than a single occasion."},"example_sentences":[{"sentence":"The bride's family organized several precelebrations leading up to the wedding day.","translation":"花嫁の家族は、結婚式当日までの数々の前祝いを企画しました。","type":"noun","meaning_category":"前祝い"},{"sentence":"The precelebrations for the conference included workshops and networking events.","translation":"会議の前祝いには、ワークショップや交流イベントが含まれていました。","type":"noun","meaning_category":"前祝い"},{"sentence":"The precelebrations helped to create a festive atmosphere before the main event.","translation":"前祝いは、本番のイベントの前に、お祝いの雰囲気を作り出すのに役立ちました。","type":"noun","meaning_category":"前祝い"}]}