{"word":"waterbear","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"クマムシ","english_definition":"A microscopic animal of the phylum Tardigrada, known for its resilience to extreme conditions.","examples":[{"sentence":"Waterbears can survive in outer space.","translation":"クマムシは宇宙空間でも生き残ることができる。"},{"sentence":"Scientists are studying waterbears to understand their unique survival mechanisms.","translation":"科学者たちはクマムシのユニークな生存メカニズムを理解するために研究している。"}],"collocations":["tardigrade","moss piglet"],"synonyms":["tardigrade","moss piglet"],"antonyms":[]}],"etymology":{"value":"The name \"water bear\" comes from the way they walk, reminiscent of a bear.","priority":"★★★"},"pronunciation":{"ipa":"/ˈwɔːtərˌbɛər/","syllables":"wa-ter-bear"},"inflection":{"noun_plural":"waterbears"},"usage_notes":{"explanation":"'Waterbear' is a common name for tardigrades, microscopic animals known for their ability to survive extreme conditions. They are often found in mosses and lichens.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a waterbear in my garden, it was huge!","correct":"✓ I saw something in my garden, it was huge! (But it wasn't a waterbear, they are microscopic)","note":"Waterbears are microscopic, so you can't see them with the naked eye."}],"priority":"★★☆"},"related_words":{"derivatives":["tardigrade"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The term 'waterbear' refers to a tardigrade, a microscopic animal famous for its ability to withstand extreme environmental conditions. While not a common term in everyday conversation, it appears in scientific contexts and discussions about extremophiles. Understanding the resilience of waterbears is of interest in fields like astrobiology and materials science."},"example_sentences":[{"sentence":"The **waterbear** is one of the most resilient animals on Earth.","translation":"クマムシは地球上で最も回復力のある動物の一つです。","type":"noun","meaning_category":"animal"},{"sentence":"Scientists have discovered that **waterbears** can survive radiation exposure.","translation":"科学者たちは、クマムシが放射線被ばくを生き残ることができることを発見しました。","type":"noun","meaning_category":"animal"}]}