{"word":"Ante-mosaic","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(考古学) ローマ時代以前のモザイク。特に、テッセラ（小さな石片）ではなく、より粗い素材で作られたもの。","english_definition":"(Archaeology) A mosaic dating from before the Roman period, especially one made of coarser materials rather than tesserae.","examples":[{"sentence":"The museum displayed a rare example of an Ante-mosaic from the Etruscan period.","translation":"博物館には、エトルリア時代からの珍しいアンテモザイクの例が展示されていました。"},{"sentence":"Researchers are studying the techniques used to create Ante-mosaics to understand the evolution of mosaic art.","translation":"研究者たちは、モザイクアートの進化を理解するために、アンテモザイクの作成に使用された技術を研究しています。"}],"collocations":["Etruscan Ante-mosaic","early Ante-mosaic","study of Ante-mosaics","Ante-mosaic technique"],"synonyms":["pre-Roman mosaic","early mosaic"],"antonyms":["Roman mosaic","tessellated mosaic"]}],"etymology":{"value":"\"Ante-\" (before) + \"mosaic\".  Refers to mosaics predating the Roman era and the use of tesserae.","priority":"★★★"},"pronunciation":{"ipa":"/ˌæntiːmoʊˈzeɪɪk/","syllables":"An-te-mo-sa-ic"},"inflection":{"notes":"単数形: Ante-mosaic, 複数形: Ante-mosaics"},"usage_notes":{"explanation":"The term \"Ante-mosaic\" is primarily used in archaeological and art historical contexts to distinguish early forms of mosaic art from the more refined and well-known Roman mosaics. These earlier mosaics often used pebbles or other readily available materials, and lacked the intricate designs and small, precisely cut tesserae of Roman mosaics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Ante-mosaic was made of tessera.","correct":"✓ The Ante-mosaic was made of pebbles.","note":"Ante-mosaics typically predate the use of tesserae, so they are usually made of coarser materials like pebbles or larger stones."}],"priority":"★★☆"},"related_words":{"derivatives":["mosaic","tessera","tessellated"],"related_terms":["opus vermiculatum","opus sectile"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Specialized term used in archaeology and art history.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Ante-mosaic\" is a specialized term used in archaeology and art history to refer to mosaics that predate the Roman period. These mosaics are often characterized by the use of coarser materials, such as pebbles, rather than the small, precisely cut tiles (tesserae) that are typical of Roman mosaics. Understanding this term requires familiarity with the history of mosaic art and archaeological terminology."},"example_sentences":[{"sentence":"The Ante-mosaic floor in the ancient villa provided valuable insights into the artistic practices of the time.","translation":"古代の別荘のアンテモザイクの床は、当時の芸術的慣習に関する貴重な洞察を提供しました。","type":"noun","meaning_category":"archaeology"},{"sentence":"Scholars debate the origins and development of Ante-mosaics in the Mediterranean region.","translation":"学者たちは、地中海地域におけるアンテモザイクの起源と発展について議論しています。","type":"noun","meaning_category":"art history"}]}