{"word":"Claybourne","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A surname of English origin.","english_definition":"A surname of English origin, likely derived from a place name.","examples":[{"sentence":"Mr. Claybourne is a well-respected member of the community.","translation":"クレイボーンさんは地域社会で尊敬されている人物です。"},{"sentence":"The Claybourne family has a long history in this town.","translation":"クレイボーン家はこの町で長い歴史を持っています。"}],"collocations":["Claybourne family","Mr. Claybourne","Claybourne Street"],"synonyms":[],"antonyms":[]},{"part_of_speech":"proper noun","definition":"A given name, sometimes used as a first name.","english_definition":"A masculine given name, derived from the surname.","examples":[{"sentence":"Claybourne is an unusual but strong name.","translation":"クレイボーンは珍しいですが、力強い名前です。"},{"sentence":"They named their son Claybourne after his grandfather.","translation":"彼らは祖父にちなんで息子をクレイボーンと名付けました。"}],"collocations":["Given name Claybourne","Named Claybourne"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Likely derived from a place name in England. The name combines 'clay' (referring to soil) and 'bourne' (meaning a small stream or boundary).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkleɪbɔːrn/","syllables":"Clay-bourne"},"inflection":{},"usage_notes":{"explanation":"'Claybourne' is primarily used as a surname. Its use as a given name is less common but not unheard of. As a surname, it indicates family lineage and origin. As a given name, it often carries a sense of tradition or uniqueness.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Claybourne' is a relatively uncommon name. Understanding its origin and usage requires some familiarity with English surnames and place names. The pronunciation is straightforward, but the spelling may be unfamiliar to some. Its usage is generally limited to identifying individuals or families.","priority":"★★☆"},"example_sentences":[{"sentence":"The author, John Claybourne, released his new book today.","translation":"作家のジョン・クレイボーンが本日、新刊を発売しました。","type":"noun","meaning_category":"Surname"},{"sentence":"Claybourne attended the meeting as a representative of the company.","translation":"クレイボーンは会社の代表として会議に出席しました。","type":"proper noun","meaning_category":"Given name"}]}