{"word":"uncommendatory","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"批判的な、非難する、褒めない","english_definition":"expressing disapproval or criticism; not commendatory.","examples":[{"sentence":"The review of the play was uncommendatory, highlighting several flaws in the acting and script.","translation":"その劇のレビューは批判的で、演技と脚本のいくつかの欠点を強調していた。"},{"sentence":"His uncommendatory remarks about her performance made her feel discouraged.","translation":"彼の彼女のパフォーマンスに対する褒めない発言は、彼女を落胆させた。"}],"collocations":["uncommendatory review","uncommendatory remarks","uncommendatory tone"],"synonyms":["critical","disapproving","censorious","negative","unflattering"],"antonyms":["commendatory","approving","laudatory","complimentary"]}],"etymology":{"value":"\"Un-\" (not) + \"commendatory\" (expressing praise).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnkəˈmendətɔːri/","syllables":"un-com-men-da-to-ry"},"inflection":{"adjective_forms":{"comparative":"more uncommendatory","superlative":"most uncommendatory"}},"usage_notes":{"explanation":"\"Uncommendatory\" is a relatively formal word used to describe something that expresses disapproval or lacks praise. It is often used in the context of reviews, critiques, or remarks about someone's work or performance. It implies a negative assessment without necessarily being overtly harsh.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The report was uncommendatory of the company's success.","correct":"✓ The report was uncommendatory of the company's efforts.","note":"\"Uncommendatory\" is typically used when something falls short of expectations or is deserving of criticism, not when something is successful. In the case of success, \"commendatory\" would be more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["commendatory (adjective: expressing praise)","commend (verb: to praise)","commendation (noun: praise)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"uncommendatory\" is a formal adjective that means expressing disapproval or criticism. It is the opposite of \"commendatory,\" which means expressing praise. The word is not commonly used in everyday conversation, but it might appear in formal writing, such as reviews or critiques. It is important to note that \"uncommendatory\" does not necessarily mean harsh or severe; it simply means lacking praise or expressing disapproval."},"example_sentences":[{"sentence":"The teacher gave an uncommendatory assessment of the student's essay.","translation":"先生は生徒のエッセイに対して褒めない評価を与えた。","type":"adjective","meaning_category":"批判的な"},{"sentence":"The article offered an uncommendatory view of the government's new policies.","translation":"その記事は政府の新しい政策に対する批判的な見解を示した。","type":"adjective","meaning_category":"非難する"},{"sentence":"The manager's uncommendatory feedback left the employee feeling demotivated.","translation":"マネージャーの褒めないフィードバックは、従業員をやる気をなくさせた。","type":"adjective","meaning_category":"褒めない"}]}