{"word":"Enlarger","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(写真)引き伸ばし機","english_definition":"A photographic instrument used to produce an enlarged print from a negative or transparency.","examples":[{"sentence":"He used an enlarger to make a large print of the photograph.","translation":"彼は引き伸ばし機を使ってその写真の大きなプリントを作成した。"},{"sentence":"The darkroom was equipped with several enlargers of different sizes.","translation":"暗室には様々なサイズの引き伸ばし機がいくつか備え付けられていた。"}],"collocations":["photographic enlarger","darkroom enlarger","use an enlarger","buy an enlarger"],"synonyms":["projector","photo enlarger"],"antonyms":[]}],"etymology":{"value":"From the verb 'enlarge', meaning 'to make larger'. The suffix '-er' indicates an instrument or device that performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈlɑːrdʒər/","syllables":"en-larg-er"},"inflection":{"noun_plural":"Enlargers"},"usage_notes":{"explanation":"An enlarger is a specialized piece of equipment used in photography, particularly in darkroom settings. It projects light through a negative or transparency onto photographic paper, allowing the image to be enlarged during the printing process.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a magnifier to make the print bigger.","correct":"✓ I used an enlarger to make the print bigger.","note":"A magnifier simply makes something appear larger, while an enlarger projects an image onto photographic paper to create a larger print."}],"priority":"★★☆"},"related_words":{"derivatives":["enlarge (verb)","enlargement (noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'enlarger' refers to a specific tool used in photography, primarily in traditional darkroom settings. It's not a commonly used word outside of this context. Understanding its meaning requires familiarity with photographic processes."},"example_sentences":[{"sentence":"The photographer adjusted the lens on the enlarger.","translation":"写真家は引き伸ばし機のレンズを調整した。","type":"noun","meaning_category":"引き伸ばし機"},{"sentence":"Using an enlarger, he created a mural-sized print from a small negative.","translation":"引き伸ばし機を使って、彼は小さなネガから壁画サイズのプリントを作成した。","type":"noun","meaning_category":"引き伸ばし機"}]}