{"word":"Enlarger","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(写真)引伸機","english_definition":"A piece of photographic equipment used to produce prints of negatives or slides at a size larger than the original.","examples":[{"sentence":"He used an enlarger to make a large print of the photograph.","translation":"彼は引伸機を使って、その写真の大きなプリントを作成した。"},{"sentence":"The darkroom was equipped with an enlarger and other photographic equipment.","translation":"暗室には、引伸機やその他の写真機材が備え付けられていた。"}],"collocations":["photographic enlarger","darkroom enlarger","use an enlarger","adjust the enlarger","buy an enlarger"],"synonyms":["projector","magnifier"],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'enlarge', meaning 'to make larger'. The suffix '-er' is added to indicate an instrument or device that performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈlɑːrdʒər/","syllables":"in-lar-ger"},"inflection":{"noun_plural":"Enlargers"},"usage_notes":{"explanation":"An 'enlarger' is specifically a piece of equipment used in photography to project an image from a negative or slide onto photographic paper, creating a larger print. It is a key tool in traditional darkroom photography.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a projector to enlarge the photo.","correct":"✓ He used an enlarger to enlarge the photo.","note":"While a projector can display images, an enlarger is specifically designed for photographic printing and allows for precise control over focus, exposure, and contrast."}],"priority":"★★☆"},"related_words":{"derivatives":["enlarge (verb)","enlargement (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, specific to photography contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'enlarger' is a technical term primarily used in the context of photography, specifically in traditional darkroom settings. It refers to a specialized device used to create larger prints from photographic negatives or slides. Understanding this term requires some familiarity with photographic processes."},"example_sentences":[{"sentence":"The photographer carefully adjusted the settings on the **enlarger**.","translation":"写真家は慎重に引伸機の設定を調整した。","type":"noun","meaning_category":"photographic equipment"},{"sentence":"With the **enlarger**, he could create prints that captured every detail of the original negative.","translation":"引伸機を使えば、彼は元のネガの細部まで捉えたプリントを作成できた。","type":"noun","meaning_category":"photographic equipment"}]}