{"word":"volcanoism","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"火山活動","english_definition":"The phenomenon of eruption of molten rock (magma) onto the surface of the Earth or a solid-surface planet or moon, where lava, pyroclastics, and volcanic gases erupt through a break in the surface called a vent. It includes all phenomena resulting from and causing magma within the crust or mantle of the body, to rise through the crust and form volcanic rocks on the surface.","examples":[{"sentence":"Volcanoism is responsible for the formation of many islands.","translation":"火山活動は多くの島の形成の原因となっている。"},{"sentence":"The area is known for its intense volcanoism.","translation":"その地域は激しい火山活動で知られている。"},{"sentence":"Studies of volcanoism help us understand the Earth's interior.","translation":"火山活動の研究は、地球の内部を理解するのに役立つ。"}],"collocations":["active volcanoism (活発な火山活動)","submarine volcanoism (海底火山活動)","intraplate volcanoism (プレート内火山活動)","volcanoism and tectonics (火山活動と構造運動)"],"synonyms":["volcanicity","volcanic activity","vulcanism"],"antonyms":[]}],"etymology":{"value":"The term 'volcanoism' is derived from 'volcano,' which ultimately comes from the name of the Roman god of fire, Vulcan. The suffix '-ism' is added to denote a process, condition, or doctrine. Therefore, 'volcanoism' refers to the processes and phenomena associated with volcanoes.","priority":"★★☆"},"pronunciation":{"ipa":"/vɒlˈkeɪnoʊɪzəm/","syllables":"vol-ca-no-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Volcanoism' is a geological term referring to the processes and phenomena associated with volcanoes, including eruptions, lava flows, and the release of gases. It is often used in scientific contexts when discussing the formation and activity of volcanoes. It's important to distinguish 'volcanoism' from 'volcano,' which is the physical landform resulting from these processes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The volcanoism is very high.","correct":"✓ Volcanic activity is very high.","note":"While 'volcanoism' refers to the processes, it's more common to describe the *activity* as high or intense. Using 'volcanic activity' is often clearer. Alternatively, 'The rate of volcanoism is high' is also correct."},{"incorrect":"✗ Volcanoism is a volcano.","correct":"✓ Volcanoism is the process that creates volcanoes.","note":"'Volcanoism' is the process, while a 'volcano' is the physical structure."}],"priority":"★★☆"},"related_words":{"derivatives":["volcano (noun: 火山)","volcanic (adjective: 火山の)","volcanically (adverb: 火山的に)","volcanologist (noun: 火山学者)","volcanology (noun: 火山学)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Volcanoism' is a specialized term used in geology to describe the processes related to volcanoes, such as eruptions and lava flows. It's not a word commonly used in everyday conversation but is important in scientific discussions about volcanoes and the Earth's geological activity. Understanding this term helps in reading and comprehending scientific texts about volcanoes."},"example_sentences":[{"sentence":"The study focused on the effects of volcanoism on the surrounding environment.","translation":"その研究は、火山活動が周辺環境に与える影響に焦点を当てた。","type":"noun","meaning_category":"火山活動"},{"sentence":"Ancient volcanoism played a significant role in shaping the landscape.","translation":"古代の火山活動は、景観の形成に重要な役割を果たした。","type":"noun","meaning_category":"火山活動"},{"sentence":"Scientists are monitoring the area for signs of increased volcanoism.","translation":"科学者たちは、火山活動の活発化の兆候がないか、その地域を監視している。","type":"noun","meaning_category":"火山活動"}]}