{"word":"Arithmomania","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"数に取りつかれること、数字への強迫観念、特定の数字を数える衝動","english_definition":"A mental disorder characterized by a compulsive preoccupation with numbers.","examples":[{"sentence":"His arithmomania caused him to count every step he took.","translation":"彼の数への強迫観念は、彼が歩くすべての歩数を数えさせる原因となった。"},{"sentence":"Arithmomania can manifest in different ways, such as counting objects or repeating numerical patterns.","translation":"数への強迫観念は、物を数えたり、数字のパターンを繰り返したりするなど、さまざまな形で現れることがある。"}],"collocations":["obsessive counting","compulsive behavior","mental disorder","anxiety disorder"],"synonyms":["number obsession","counting compulsion"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の「arithmos」（数）と「mania」（熱狂、狂気）の組み合わせに由来する。","priority":"★★★"},"pronunciation":{"ipa":"/ˌærɪθməˈmeɪniə/","syllables":"a-rith-mo-ma-ni-a"},"inflection":{"noun_plural":"arithmomanias"},"usage_notes":{"explanation":"Arithmomania is a specific type of obsessive-compulsive disorder (OCD) involving a compulsion to count. It is often associated with anxiety; the counting rituals are performed to reduce distress. The numbers themselves may or may not have special significance to the individual.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has arithmomania for prime numbers.","correct":"✓ He has arithmomania; he is obsessed with prime numbers.","note":"Arithmomania is the condition itself, not something one has 'for' something. Use it to describe the condition, and then separately explain the focus of the obsession."}],"priority":"★★☆"},"related_words":{"derivatives":["arithmomanic (形容詞: 数に取りつかれた)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Arithmomania is a relatively rare and specific term referring to a mental condition characterized by an obsession with numbers and counting. It falls under the umbrella of obsessive-compulsive disorders. Understanding this term requires a grasp of psychological terminology and the ability to comprehend complex mental health conditions. It's not a word commonly used in everyday conversation."},"example_sentences":[{"sentence":"The therapist diagnosed him with arithmomania after observing his compulsive counting rituals.","translation":"セラピストは、彼の強迫的なカウントの儀式を観察した後、彼を数への強迫観念と診断した。","type":"general","meaning_category":"definition"},{"sentence":"Arithmomania can significantly interfere with a person's daily life and ability to function normally.","translation":"数への強迫観念は、人の日常生活と正常に機能する能力を著しく妨げることがある。","type":"general","meaning_category":"definition"}]}