{"word":"askar","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(historical) A soldier in the armies of European colonial powers, especially in Africa.","english_definition":"A local soldier serving in the armies of the European colonial powers, especially in Africa.","examples":[{"sentence":"The German Schutztruppe in East Africa relied heavily on askaris.","translation":"ドイツ領東アフリカの植民地防衛軍は、アスカリに大きく依存していた。"},{"sentence":"The askaris were often recruited from different ethnic groups than the population they were policing.","translation":"アスカリは、警備対象の住民とは異なる民族グループから採用されることが多かった。"}],"collocations":["German askaris","local askaris","recruited as askaris"],"synonyms":["native soldier","colonial soldier"],"antonyms":[]}],"etymology":{"value":"From Arabic عسكري (ʿaskarīy), meaning \"soldier\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˈæskɑːr/","syllables":"as-kar"},"inflection":{"noun_plural":"askaris"},"usage_notes":{"explanation":"The term \"askar\" is primarily used in historical contexts to refer to indigenous soldiers serving European colonial powers, particularly in Africa. It is less commonly used today.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word 'askar' is a historical term referring to local soldiers employed by European colonial powers, mainly in Africa. It's not commonly used in modern English, and understanding it requires knowledge of colonial history. Therefore, it's considered a more advanced vocabulary word."},"example_sentences":[{"sentence":"The loyalty of the askaris was crucial to maintaining colonial control.","translation":"アスカリの忠誠心は、植民地支配を維持するために不可欠だった。","type":"noun","meaning_category":"soldier"},{"sentence":"Many askaris were veterans of previous conflicts.","translation":"多くのアスカリは、以前の紛争の退役軍人だった。","type":"noun","meaning_category":"soldier"}]}