{"word":"precreditor","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A creditor that existed before a specific event or time.","english_definition":"A creditor whose claim existed before a particular event or time, especially in the context of bankruptcy or restructuring.","examples":[{"sentence":"The precreditors will be paid before any new debts are settled.","translation":"特定の日付より前に債権を持っていた債権者は、新しい債務が決済される前に支払われます。"},{"sentence":"The restructuring plan prioritizes payments to precreditors.","translation":"再建計画では、特定の日付より前に債権を持っていた債権者への支払いが優先されます。"}],"collocations":["precreditor claims","precreditor debt","precreditor obligations"],"synonyms":["existing creditor","original creditor"],"antonyms":["postcreditor"]}],"etymology":{"value":"Formed by combining the prefix 'pre-' (meaning 'before') with the noun 'creditor'.","priority":"N/A"},"pronunciation":{"ipa":"/ˌpriːˈkrɛdɪtər/","syllables":"pre-cred-i-tor"},"inflection":{"noun_plural":"precreditors"},"usage_notes":{"explanation":"'Precreditor' is typically used in legal or financial contexts to distinguish between creditors whose claims arose before a certain date (such as the filing of bankruptcy) and those whose claims arose after that date. This distinction is important for determining the priority of claims in bankruptcy proceedings.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["creditor","debtor","bankruptcy"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The term 'precreditor' is a specialized term primarily used in legal and financial contexts, particularly in discussions related to bankruptcy and debt restructuring. It refers to a creditor whose claim existed before a specific event, such as the filing of bankruptcy. Understanding this term requires familiarity with legal and financial terminology."},"example_sentences":[{"sentence":"The court ruled in favor of the precreditors, ensuring they would receive priority in the repayment plan.","translation":"裁判所は、特定の日付より前に債権を持っていた債権者を支持し、返済計画において彼らが優先されることを保証しました。","type":"noun","meaning_category":"Creditor before a specific event"},{"sentence":"The company's restructuring plan aims to balance the interests of both precreditors and new investors.","translation":"その会社の再建計画は、特定の日付より前に債権を持っていた債権者と新しい投資家の両方の利益のバランスを取ることを目指しています。","type":"noun","meaning_category":"Creditor before a specific event"}]}