{"word":"Epikeia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(倫理学・法学) エピケイア：法の文言よりも精神を重視する解釈、または、法が想定していない特殊な状況において、法の精神に則り、法を文字通りには適用しないこと。","english_definition":"(Ethics, Jurisprudence) Epikeia: An equitable interpretation of the law that prioritizes its spirit over its literal wording, or the act of not applying the law literally in specific circumstances not foreseen by the legislator, in accordance with the spirit of the law.","examples":[{"sentence":"The principle of epikeia allows for exceptions to the law when following the letter of the law would lead to injustice.","translation":"エピケイアの原則は、法の文言に従うことが不正につながる場合に、法の例外を認める。"},{"sentence":"The judge applied epikeia in the case, recognizing the unique circumstances of the defendant.","translation":"裁判官は、被告の特殊な状況を認識し、その事例にエピケイアを適用した。"}],"collocations":["apply epikeia (エピケイアを適用する)","principle of epikeia (エピケイアの原則)","exercise epikeia (エピケイアを行使する)"],"synonyms":["equity","equitable interpretation","reasonable interpretation","dispensation"],"antonyms":["legalism","strict constructionism","literal interpretation"]}],"etymology":{"value":"ギリシャ語の ἐπιείκεια (epieikeia) に由来し、「適切さ、合理性、優しさ、寛容さ」といった意味を持つ。ἐπί (epi, 「上に、～に関して」) と εἰκός (eikos, 「もっともらしい、合理的な」) から構成される。アリストテレスがニコマコス倫理学でこの概念を詳細に論じたことで、西洋倫理思想における重要な概念となった。","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛpɪˈkeɪə/","syllables":"E-pi-kei-a"},"inflection":{"notes":"不可算名詞 (uncountable noun)"},"usage_notes":{"explanation":"「**Epikeia**」は、倫理学や法学において用いられる専門的な用語であり、日常会話で使われることは稀です。法の適用において、単に条文を字義通りに解釈するのではなく、法の目的や精神、個々の状況における正義を考慮することを指します。特に、法が想定していなかった状況や、条文通りの適用が不当な結果をもたらす場合に、エピケイアの原則が重要となります。カトリック神学においても、良心に従った行動を正当化する根拠として用いられます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used epikeia to break the law.","correct":"✓ He used epikeia to justify not strictly following the law in this specific case.","note":"エピケイアは、単に法を破ることを正当化するものではありません。法の精神に則り、より公正な結果をもたらすために、厳密な適用を避けることを意味します。"},{"incorrect":"✗ Epikeia is the same as breaking the law.","correct":"✓ Epikeia is not the same as breaking the law; it's about interpreting the law in a way that aligns with its intended purpose and justice.","note":"エピケイアは法の精神に沿った解釈であり、法を破ることとは異なります。"}],"priority":"★★☆"},"related_words":{"derivatives":["epieikeia (ギリシャ語の原語)","equitable (形容詞: 公正な、衡平な)","equity (名詞: 公正、衡平)"],"related_concepts":["natural law (自然法)","moral philosophy (倫理哲学)","casuistry (ケースワーカーによる倫理的判断)","legal interpretation (法的解釈)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (非常に専門的な語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門分野でのみ使用される語彙。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Epikeia**」は、法律や倫理の分野で使われる専門用語で、日常会話ではほとんど耳にしません。これは、法律を文字通りに解釈するのではなく、その背後にある意図や目的を考慮して、個々の状況に合わせて柔軟に適用するという考え方を指します。たとえば、法律が予期していなかった特殊なケースで、法律を厳格に守ると不公平な結果になる場合に、「epikeia」の原則が適用されることがあります。この概念を理解するには、法律や倫理に関する高度な知識が必要です。"},"example_sentences":[{"sentence":"The concept of **epikeia** is often discussed in the context of moral theology.","translation":"エピケイアの概念は、しばしば道徳神学の文脈で議論される。","type":"noun","meaning_category":"法の精神を重視する解釈"},{"sentence":"The judge's decision to show leniency was an example of **epikeia** in action.","translation":"裁判官が寛大な措置をとったことは、エピケイアの実践例であった。","type":"noun","meaning_category":"法の精神を重視する解釈"},{"sentence":"Some argue that **epikeia** can be a dangerous principle if not applied carefully.","translation":"注意深く適用されない場合、エピケイアは危険な原則になり得ると主張する人もいる。","type":"noun","meaning_category":"法の精神を重視する解釈"}]}