{"word":"Balaenidae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(動物) セミクジラ科","english_definition":"The family of right whales, characterized by their lack of a dorsal fin, long baleen plates, and V-shaped blowhole spray.","examples":[{"sentence":"The Balaenidae family includes the bowhead whale and the North Atlantic right whale.","translation":"セミクジラ科には、ホッキョククジラと北大西洋セミクジラが含まれます。"}],"collocations":["right whale","bowhead whale","whale conservation"],"synonyms":["right whale family"],"antonyms":[]}],"etymology":{"value":"From the genus name *Balaena*, derived from the Latin *balaena* meaning 'whale'. The suffix '-idae' is a standard taxonomic suffix used to denote a family.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbæləˈniːɪdiː/","syllables":"ba-lae-ni-dae"},"inflection":{"noun_plural":"Balaenidae (already plural as a family name)"},"usage_notes":{"explanation":"*Balaenidae* refers to the taxonomic family of right whales. It is usually used in scientific or zoological contexts. In general conversation, it's more common to refer to specific species within the family, such as the North Atlantic right whale or the bowhead whale.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ A Balaenidae is swimming.","correct":"✓ A right whale is swimming. / ✓ A member of the Balaenidae family is swimming.","note":"'Balaenidae' refers to the entire family. To refer to a single animal, use 'a right whale' or a more specific species name."}],"priority":"★★☆"},"related_words":{"derivatives":["Balaena (genus)","Eubalaena (genus)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Balaenidae' is a scientific term used to classify a specific family of whales known as right whales. This term is typically encountered in scientific literature, zoological studies, or discussions related to marine biology and conservation. Understanding this term requires familiarity with taxonomic classifications and some knowledge of whale biology."},"example_sentences":[{"sentence":"Conservation efforts are crucial for the survival of Balaenidae species.","translation":"セミクジラ科の種の生存には、保全活動が不可欠です。","type":"general","meaning_category":"conservation"},{"sentence":"The Balaenidae are characterized by their distinctive baleen plates.","translation":"セミクジラ科は、独特の鯨ひげ板によって特徴づけられます。","type":"morphology","meaning_category":"characteristics"},{"sentence":"Scientists study the migration patterns of Balaenidae in the Arctic.","translation":"科学者たちは、北極海におけるセミクジラ科の回遊パターンを研究しています。","type":"migration","meaning_category":"behavior"}]}