{"word":"integralidade","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"Qualidade ou estado de ser íntegro; integridade.","english_definition":"The quality or state of being whole or complete; integrity.","examples":[{"sentence":"A integralidade do sistema de saúde é essencial para o bem-estar da população.","translation":"The comprehensiveness of the health system is essential for the well-being of the population."},{"sentence":"A integralidade da obra foi mantida durante a restauração.","translation":"The integrity of the work was maintained during the restoration."}],"collocations":["preservar a integralidade","garantir a integralidade","perder a integralidade"],"synonyms":["integridade","totalidade","completude","inteireza"],"antonyms":["parcialidade","fragmentação"]},{"part_of_speech":"noun","definition":"(Na área da saúde) Atenção integral ao paciente, considerando todos os aspectos de sua saúde.","english_definition":"(In healthcare) Comprehensive care for the patient, considering all aspects of their health.","examples":[{"sentence":"A integralidade do cuidado inclui aspectos físicos, mentais e sociais.","translation":"Comprehensive care includes physical, mental, and social aspects."},{"sentence":"A equipe de saúde busca promover a integralidade no atendimento.","translation":"The healthcare team seeks to promote comprehensiveness in care."}],"collocations":["atenção à integralidade","promoção da integralidade","integralidade do cuidado"],"synonyms":["cuidado integral","atenção holística"],"antonyms":["cuidado fragmentado","atenção parcial"]}],"etymology":{"value":"Do latim 'integralitas, -atis'.","priority":"N/A"},"pronunciation":{"ipa":"/ĩ.te.ɡɾa.liˈda.dʒi/","syllables":"in-te-gra-li-da-de"},"inflection":{"noun_gender":"feminine","noun_plural":"integralidades"},"usage_notes":{"explanation":"O termo 'integralidade' pode se referir à qualidade de algo completo e inteiro, ou, mais especificamente no contexto da saúde, à abordagem holística e abrangente no cuidado ao paciente.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"A integralidade do sistema é importante, mas a parcialidade também tem seu lugar.","correct":"A integralidade do sistema é importante, mas a especialização também tem seu lugar.","note":"Não confundir 'parcialidade' com 'especialização'. Em vez de 'parcialidade', use 'especialização' para contrastar com a visão abrangente da integralidade."}],"priority":"N/A"},"related_words":{"derivatives":["íntegro","integrar","integral"],"related_terms":["holístico","abrangente","completo"],"priority":"N/A"},"level_frequency":{"frequency_corpus":"Moderada, especialmente em textos acadêmicos e da área da saúde.","priority":"N/A"},"readability_explanation":{"level":"Avançado","text":"O termo 'integralidade' é um substantivo que se refere à qualidade de ser completo, inteiro ou abrangente. No contexto da saúde, refere-se a uma abordagem que considera todos os aspectos da saúde de um indivíduo, incluindo físico, mental e social. É um conceito importante em políticas de saúde e práticas de cuidado."},"example_sentences":[{"sentence":"A integralidade do atendimento é um dos princípios do SUS.","translation":"Comprehensive care is one of the principles of the SUS (Brazilian Unified Health System).","type":"noun","meaning_category":"Saúde"},{"sentence":"É preciso garantir a integralidade dos direitos da criança e do adolescente.","translation":"It is necessary to guarantee the full range of rights of children and adolescents.","type":"noun","meaning_category":"Geral"}]}