{"word":"Leonurus","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"レオヌルス属（メディカルハーブとして知られるマザーワートなどを含む植物の属）","english_definition":"A genus of flowering plants in the family Lamiaceae (mint family). It includes species such as motherwort (Leonurus cardiaca), which is used in herbal medicine.","examples":[{"sentence":"Leonurus cardiaca is known for its calming properties.","translation":"レオヌルス・カルディアカ（マザーワート）は、その鎮静効果で知られています。"},{"sentence":"The genus Leonurus is native to Eurasia and Africa.","translation":"レオヌルス属は、ユーラシアとアフリカ原産です。"}],"collocations":["Leonurus cardiaca (マザーワート)","Leonurus sibiricus (シベリアンマザーワート)","Leonurus japonicus (カワミドリ)"],"synonyms":["motherwort","mint family plant"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'leon' (lion) and 'oura' (tail), referring to the shape of the plant's leaves.","priority":"★★☆"},"pronunciation":{"ipa":"/liːɒˈnjʊərəs/","syllables":"Le-o-nu-rus"},"inflection":{"notes":"Plural: Leonurus (属名のため、複数形は通常使用されません)"},"usage_notes":{"explanation":"'Leonurus' is primarily used in botanical and herbal contexts. When referring to a specific species, the full binomial name (e.g., Leonurus cardiaca) is typically used. In herbal medicine, 'Leonurus' may be used as a shorthand for 'motherwort' or other species within the genus.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I drink Leonurus tea every morning for energy.","correct":"✓ I drink motherwort tea every morning for its calming effect.","note":"Leonurus (マザーワート) は鎮静効果があるため、エネルギーのためではなく、リラックスのために飲まれることが多いです。"},{"incorrect":"✗ Leonurus is a type of tree.","correct":"✓ Leonurus is a type of herbaceous plant.","note":"Leonurus は木ではなく、草本植物です。"}],"priority":"★★☆"},"related_words":{"derivatives":["leonurine (レオヌリン - マザーワートに含まれるアルカロイド)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (専門的な文脈のみ)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Leonurus' is a scientific term referring to a genus of plants, primarily used in botany, herbal medicine, and related fields. Understanding of this term requires familiarity with botanical nomenclature and basic knowledge of plant classification. The most common species within this genus is 'Leonurus cardiaca' (motherwort), which is more widely known due to its medicinal properties. Therefore, encountering 'Leonurus' typically implies a discussion within a specialized context.","priority":"★★☆"},"example_sentences":[{"sentence":"The chemical composition of Leonurus species varies depending on the geographical location.","translation":"レオヌルス属の化学組成は、地理的な場所によって異なります。","type":"general","meaning_category":"botany"},{"sentence":"Traditional medicine practitioners often use Leonurus cardiaca to treat anxiety.","translation":"伝統医学の専門家は、不安を治療するためにレオヌルス・カルディアカ（マザーワート）をよく使用します。","type":"specific","meaning_category":"herbal medicine"},{"sentence":"Studies have shown that Leonurus extract has potential anti-inflammatory effects.","translation":"研究によると、レオヌルス抽出物には潜在的な抗炎症作用があることが示されています。","type":"specific","meaning_category":"scientific research"}]}