{"word":"Utraquist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史) ウトラキスト：15世紀のボヘミアの宗教改革運動の一派で、信徒への聖餐においてパンと葡萄酒の両方を授けることを主張したフス派の一派。","english_definition":"(historical) A member of a moderate faction of the Hussites in Bohemia who advocated administering communion in both kinds (bread and wine) to the laity.","examples":[{"sentence":"The Utraquists sought compromise with the Catholic Church.","translation":"ウトラキストはカトリック教会との妥協を模索した。"},{"sentence":"The Utraquist articles were a key point of contention in the Bohemian Reformation.","translation":"ウトラキストの条項は、ボヘミアの宗教改革における重要な争点であった。"}],"collocations":["Utraquist articles","Utraquist Church","Utraquist theology"],"synonyms":["Calixtine","Bohemian Brethren (sometimes)"],"antonyms":["Taborite (a more radical Hussite faction)","Catholic"],"notes":"The term 'Utraquist' comes from the Latin 'sub utraque specie,' meaning 'under both kinds,' referring to communion."}],"etymology":{"value":"From Latin *sub utrāque specie* 'under each form,' referring to the bread and wine of the Eucharist.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈjuːtrəkwɪst/","syllables":"U-tra-quist"},"inflection":{"noun_plural":"Utraquists"},"usage_notes":{"explanation":"The term 'Utraquist' is primarily used in historical contexts when discussing the Hussite movement and the religious landscape of 15th-century Bohemia. It is not a commonly used word in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was an Utraquist of the modern era.","correct":"✓ He was a supporter of communion in both kinds.","note":"'Utraquist' specifically refers to a historical group. Describing a modern person with similar beliefs would require a different phrasing."}],"priority":"★☆☆"},"related_words":{"derivatives":["Utraquism (noun: the beliefs and practices of the Utraquists)"],"related_terms":["Hussite","Bohemia","communion","Eucharist","Reformation"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very specialized vocabulary)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な歴史用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Utraquist' is a highly specialized historical term referring to a specific group within the Hussite movement in Bohemia. Understanding this term requires knowledge of 15th-century European religious history and the controversies surrounding the Eucharist. It is unlikely to be encountered outside of academic contexts dealing with this period."},"example_sentences":[{"sentence":"The Utraquist faction gained significant political power in Bohemia.","translation":"ウトラキスト派はボヘミアで大きな政治的権力を獲得した。","type":"noun","meaning_category":"historical group"},{"sentence":"The Utraquists allowed the laity to receive communion in both bread and wine.","translation":"ウトラキストは信徒がパンと葡萄酒の両方で聖餐を受けることを認めた。","type":"noun","meaning_category":"historical group"},{"sentence":"Utraquist theology attempted to reconcile Hussite beliefs with Catholic tradition.","translation":"ウトラキスト神学はフス派の信仰とカトリックの伝統を調和させようとした。","type":"adjective (implied)","meaning_category":"beliefs/theology"}]}