{"word":"polyphylesis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"多系統発生: 異なる系統に由来する形質が、収斂進化によって類似する現象。","english_definition":"The development of similar characteristics in different lineages due to convergent evolution.","examples":[{"sentence":"Polyphylesis can make it difficult to determine the true evolutionary relationships between organisms.","translation":"多系統発生は、生物間の真の進化関係を特定することを困難にする可能性がある。"}],"collocations":["convergent evolution","phylogenetic analysis","homoplasy"],"synonyms":["convergent evolution","homoplasy"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の「polys (多い)」+ 「phylon (種族、系統)」+ 「genesis (起源、発生)」に由来。","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɒlɪfaɪˈliːsɪs/","syllables":"pol-y-phy-le-sis"},"inflection":{"noun_plural":"polyphyleses"},"usage_notes":{"explanation":"系統学において、多系統発生は、異なる祖先を持つ生物が、類似した環境圧や選択圧によって、独立に類似した形質を発達させる現象を指します。これは、系統樹の構築や進化史の解釈を複雑にする要因となります。","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["polyphyletic (形容詞: 多系統の)"],"related_terms":["monophyly","paraphyly","phylogeny","cladistics"],"priority":"★★☆"},"level_frequency":{},"readability_explanation":{"level":"C2","text":"Polyphylesis is a term used in evolutionary biology to describe a situation where a group of organisms that are classified together do not share a unique common ancestor. This can occur due to convergent evolution, where different lineages independently evolve similar traits because they are adapting to similar environments or ecological niches. Understanding polyphylesis is important for accurately reconstructing phylogenetic relationships and avoiding misleading classifications."},"example_sentences":[{"sentence":"The classic example of polyphylesis is the evolution of warm-bloodedness in birds and mammals.","translation":"多系統発生の典型的な例は、鳥類と哺乳類における恒温性の進化である。","type":"noun","meaning_category":"多系統発生"},{"sentence":"Phylogenetic analyses must account for the possibility of polyphylesis to avoid inaccurate conclusions.","translation":"系統解析では、不正確な結論を避けるために、多系統発生の可能性を考慮する必要がある。","type":"noun","meaning_category":"多系統発生"}]}