{"word":"company-ordered","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"会社が命令した、会社が指示した","english_definition":"Ordered or instructed by a company; relating to something that a company has mandated or requested.","examples":[{"sentence":"The company-ordered training was mandatory for all new employees.","translation":"会社が指示した研修は、すべての新入社員にとって必須だった。"},{"sentence":"We had to comply with the company-ordered changes to the software.","translation":"ソフトウェアに対する会社が指示した変更に従わなければならなかった。"},{"sentence":"The company-ordered investigation revealed several instances of misconduct.","translation":"会社が指示した調査により、いくつかの不正行為が明らかになった。"}],"collocations":["company-ordered training","company-ordered investigation","company-ordered changes","company-ordered relocation","company-ordered audit"],"synonyms":["mandated by the company","company-directed","company-instructed","company-required","company-mandated"],"antonyms":["voluntary","optional","employee-initiated","self-directed","independent"],"notes":"This term is often used in the context of policies, procedures, investigations, or training programs that are required by a company for its employees."}],"etymology":{"value":"Combination of 'company' (referring to a business or organization) and 'ordered' (meaning instructed or commanded).","priority":"N/A"},"pronunciation":{"ipa":"/ˈkʌmpəni ˈɔːrdərd/","syllables":"com-pa-ny or-dered"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"The adjective 'company-ordered' is used to describe something that has been officially requested or mandated by a company. It implies that the action or item in question is not optional but is a requirement set forth by the employer.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The company ordered to do this.","correct":"✓ The company ordered us to do this. / ✓ This is company-ordered.","note":"'Company ordered' alone is not grammatically correct. It requires a subject and object (e.g., 'The company ordered us...'). 'Company-ordered' can be used as an adjective before a noun (e.g., 'company-ordered training')."},{"incorrect":"✗ The company ordered training. It was company ordered.","correct":"✓ The company ordered training. It was company-ordered.","note":"When used as an adjective, it should be hyphenated."}],"priority":"N/A"},"related_words":{"derivatives":["company (noun)","order (verb)","ordered (adjective)"],"related_terms":["company policy","corporate mandate","required by employer","employer-directed"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. This is a compound adjective, not a core vocabulary word.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'company-ordered' is a compound adjective indicating that something has been mandated or instructed by a company. It is generally used in professional or business contexts. Understanding the term requires knowledge of the individual words 'company' and 'ordered' and the ability to interpret them as a single descriptive unit."},"example_sentences":[{"sentence":"All employees must attend the company-ordered safety briefing.","translation":"すべての従業員は、会社が指示した安全説明会に参加しなければならない。","type":"adjective","meaning_category":"company instruction"},{"sentence":"The company-ordered audit revealed some financial discrepancies.","translation":"会社が指示した監査により、いくつかの財務上の矛盾が明らかになった。","type":"adjective","meaning_category":"company instruction"},{"sentence":"Due to the restructuring, a company-ordered relocation was necessary for some staff.","translation":"リストラのため、一部のスタッフには会社が指示した転勤が必要になった。","type":"adjective","meaning_category":"company instruction"}]}