{"word":"renownful","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"有名な、名声のある、高名な","english_definition":"having or characterized by renown; famous.","examples":[{"sentence":"The renownful artist's works are displayed in museums worldwide.","translation":"その高名な芸術家の作品は世界中の美術館に展示されています。"},{"sentence":"She is a renownful scientist in the field of genetics.","translation":"彼女は遺伝学の分野で有名な科学者です。"}],"collocations":["renownful artist","renownful scientist","renownful scholar","renownful leader"],"synonyms":["famous","celebrated","eminent","distinguished","noted","illustrious","reputable"],"antonyms":["unknown","obscure","unrecognized","anonymous"]}],"etymology":{"value":"\"Renownful\" is derived from \"renown,\" which comes from the Old French word \"renom,\" meaning \"fame, reputation.\" The suffix \"-ful\" indicates \"full of\" or \"characterized by.\" Therefore, \"renownful\" means \"full of renown\" or \"characterized by fame.\"","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈnaʊnfʊl/","syllables":"re-nown-ful"},"inflection":{"adjective_forms":{"comparative":"more renownful","superlative":"most renownful"}},"usage_notes":{"explanation":"\"Renownful\" is a relatively uncommon adjective that describes someone or something possessing great fame or a good reputation. While it is similar in meaning to \"famous,\" \"renowned,\" and \"celebrated,\" it is less frequently used in contemporary English. The word often implies a long-standing and widely recognized reputation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The city is renownful for its architecture.","correct":"✓ The city is renowned for its architecture.","note":"\"Renowned\" is a more common and preferred adjective to describe something famous. While \"renownful\" is technically correct, \"renowned\" is more widely accepted and used."},{"incorrect":"✗ He became renownful overnight.","correct":"✓ He became famous overnight.","note":"For sudden or recent fame, \"famous\" is generally more appropriate than \"renownful,\" which implies a more established and long-lasting reputation."}],"priority":"★★☆"},"related_words":{"derivatives":["renown (noun): fame, reputation","renowned (adjective): famous, celebrated"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - The word is relatively rare in modern usage.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Renownful\" is an adjective that means \"famous\" or \"having a good reputation.\" It is not as commonly used as \"famous\" or \"renowned.\" It is often used to describe people or things that have a long-standing and widely recognized reputation. Because it is less common, it is more likely to be found in formal writing or historical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The university is proud to have several renownful professors on its faculty.","translation":"その大学は、学部教員の中に何人かの高名な教授がいることを誇りに思っています。","type":"adjective","meaning_category":"有名"},{"sentence":"The renownful chef opened a new restaurant in the city.","translation":"その有名なシェフが市内に新しいレストランをオープンしました。","type":"adjective","meaning_category":"名声のある"},{"sentence":"Her renownful contributions to the field of medicine have saved countless lives.","translation":"彼女の医学分野への高名な貢献は、数えきれないほどの命を救ってきました。","type":"adjective","meaning_category":"高名な"}]}