{"word":"semi-metal","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"半金属","english_definition":"An element with properties intermediate between those of metals and nonmetals; metalloid.","examples":[{"sentence":"Silicon is a well-known semi-metal used in semiconductors.","translation":"シリコンは半導体に使われる有名な半金属です。"},{"sentence":"Some semi-metals can act as semiconductors under certain conditions.","translation":"いくつかの半金属は特定の条件下で半導体として機能することがあります。"}],"collocations":["semi-metal element","semi-metal properties","semi-metal conductivity"],"synonyms":["metalloid"],"antonyms":["metal","nonmetal"]},{"part_of_speech":"adjective","definition":"半金属の","english_definition":"Relating to or composed of a semi-metal.","examples":[{"sentence":"Semi-metal materials are used in the electronics industry.","translation":"半金属材料はエレクトロニクス産業で使用されています。"},{"sentence":"The semi-metal nature of arsenic makes it useful in certain alloys.","translation":"ヒ素の半金属的な性質は、特定の合金で役立ちます。"}],"collocations":["semi-metal material","semi-metal compound","semi-metal structure"],"synonyms":["metalloidal"],"antonyms":["metallic","nonmetallic"]}],"etymology":{"value":"The term 'semi-metal' is formed by combining the prefix 'semi-' (meaning half or partially) with the word 'metal'. This reflects the intermediate properties of these elements between metals and nonmetals.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɛmiˌmɛtəl/","syllables":"sem-i-met-al"},"inflection":{"notes":"Plural form of the noun: semi-metals. Adjective form does not change."},"usage_notes":{"explanation":"The term 'semi-metal' is often used interchangeably with 'metalloid'. These elements exhibit properties that are intermediate between those of metals and nonmetals. This means they may have some metallic characteristics (like electrical conductivity) under certain conditions, but not others. Common examples include silicon, germanium, arsenic, antimony, and tellurium.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Semi-metals are always good conductors of electricity.","correct":"✓ Semi-metals can be semiconductors, meaning their conductivity varies with conditions.","note":"Semi-metals are not always good conductors; their conductivity depends on factors like temperature and impurities."},{"incorrect":"✗ Semi-metals are the same as alloys.","correct":"✓ Semi-metals are elements with intermediate properties; alloys are mixtures of metals.","note":"Semi-metals are elements, while alloys are mixtures, usually of metals."}],"priority":"★★☆"},"related_words":{"derivatives":["semimetallic (adjective: relating to or having the properties of a semi-metal)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, primarily used in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Semi-metal' refers to elements that don't neatly fit into either the 'metal' or 'nonmetal' category. They have properties of both. A more common term for this is 'metalloid'. These elements are important in electronics because they can act as semiconductors, meaning their ability to conduct electricity can be controlled. Examples include silicon and germanium. The term is mostly used in science and technology contexts."},"example_sentences":[{"sentence":"Germanium is a semi-metal used in transistors.","translation":"ゲルマニウムはトランジスタに使われる半金属です。","type":"noun","meaning_category":"element"},{"sentence":"The conductivity of semi-metal compounds is temperature-dependent.","translation":"半金属化合物の伝導率は温度に依存します。","type":"adjective","meaning_category":"property"}]}