{"word":"globulin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"グロブリン (球状タンパク質の一種)","english_definition":"any of a group of simple proteins soluble in salt solutions and forming a large fraction of blood serum and muscle fluids.","examples":[{"sentence":"Globulins play a vital role in the immune system.","translation":"グロブリンは免疫系において重要な役割を果たします。"},{"sentence":"Immunoglobulins are a type of globulin that act as antibodies.","translation":"免疫グロブリンは抗体として働くグロブリンの一種です。"}],"collocations":["serum globulin (血清グロブリン)","immune globulin (免疫グロブリン)","alpha globulin (アルファグロブリン)","beta globulin (ベータグロブリン)","gamma globulin (ガンマグロブリン)"],"synonyms":["protein","albumin"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin 'globulus,' meaning 'small globe,' referring to the spherical shape of these proteins.","priority":"★★☆"},"pronunciation":{"ipa":"ˈɡlɒbjəlɪn","syllables":"glob-u-lin"},"inflection":{"noun_plural":"globulins"},"usage_notes":{"explanation":"Globulins are a class of proteins characterized by their solubility in salt solutions and their roughly spherical shape. They are a major component of blood serum and are essential for various biological functions, including immunity, transport, and enzyme activity. Different types of globulins are classified based on their electrophoretic mobility (alpha, beta, gamma). Gamma globulins, also known as immunoglobulins, are antibodies produced by the immune system to neutralize foreign invaders.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Globulin is a type of carbohydrate.","correct":"✓ Globulin is a type of protein.","note":"Globulins are proteins, not carbohydrates."},{"incorrect":"✗ Globulins are only found in plants.","correct":"✓ Globulins are found in animals, especially in blood serum and muscle fluids.","note":"Globulins are primarily associated with animal physiology."}],"priority":"★★☆"},"related_words":{"derivatives":["globular (adjective: 球状の)","immunoglobulin (noun: 免疫グロブリン)"],"phrases":["gamma globulin injection (ガンマグロブリン注射)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Globulin' refers to a specific type of protein found in blood and other bodily fluids. It's a technical term primarily used in biology, medicine, and biochemistry. Understanding globulins is important for comprehending immune responses and certain medical conditions. The term is not commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor ordered a blood test to check the patient's globulin levels.","translation":"医師は患者のグロブリン値を調べるために血液検査を指示した。","type":"noun","meaning_category":"protein"},{"sentence":"An increase in gamma globulin may indicate an infection.","translation":"ガンマグロブリンの増加は感染症を示唆する可能性がある。","type":"noun","meaning_category":"protein"},{"sentence":"Certain globulins transport hormones and lipids in the bloodstream.","translation":"特定のグロブリンは血流中でホルモンや脂質を輸送する。","type":"noun","meaning_category":"protein"}]}