{"word":"basichromatin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(細胞生物学)塩基好性クロマチン、活発に転写されているクロマチン領域","english_definition":"(cell biology) a form of chromatin that is less condensed and stains lightly, containing DNA that is actively transcribed.","examples":[{"sentence":"Basichromatin is associated with actively transcribed genes.","translation":"塩基好性クロマチンは活発に転写されている遺伝子と関連している。"},{"sentence":"The presence of basichromatin indicates a high level of gene expression.","translation":"塩基好性クロマチンの存在は高い遺伝子発現レベルを示唆する。"}],"collocations":["active chromatin","euchromatin","gene expression","DNA transcription"],"synonyms":["euchromatin","active chromatin"],"antonyms":["heterochromatin","condensed chromatin"]}],"etymology":{"value":"'basi-' (base-loving, referring to its affinity for basic dyes) + 'chromatin' (the material of chromosomes).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbeɪsɪˈkroʊmətɪn/","syllables":"ba-si-chro-ma-tin"},"inflection":{"noun_plural":"basichromatins"},"usage_notes":{"explanation":"Basichromatin is a type of chromatin that is loosely packed and contains genes that are actively being transcribed. It is the opposite of heterochromatin, which is tightly packed and contains genes that are not actively being transcribed. Basichromatin stains lightly with basic dyes, hence the name.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Basichromatin is tightly packed.","correct":"✓ Basichromatin is loosely packed.","note":"Basichromatin is, by definition, loosely packed, unlike heterochromatin."},{"incorrect":"✗ Basichromatin is not transcribed.","correct":"✓ Basichromatin is actively transcribed.","note":"Basichromatin contains DNA that is actively transcribed."}],"priority":"★★☆"},"related_words":{"derivatives":["chromatin","heterochromatin","euchromatin","chromosome"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Basichromatin is a technical term used in cell biology to describe a less condensed form of chromatin that is actively involved in gene transcription. It is essentially the 'active' form of chromatin, as opposed to heterochromatin, which is more condensed and inactive. Understanding this term requires some background knowledge in molecular biology and genetics."},"example_sentences":[{"sentence":"The abundance of basichromatin in a cell nucleus is often correlated with high transcriptional activity.","translation":"細胞核内の塩基好性クロマチンの豊富さは、しばしば高い転写活性と相関している。","type":"noun","meaning_category":"活発に転写されているクロマチン領域"},{"sentence":"Histone modifications play a crucial role in the formation and maintenance of basichromatin structures.","translation":"ヒストン修飾は、塩基好性クロマチン構造の形成と維持に重要な役割を果たす。","type":"noun","meaning_category":"活発に転写されているクロマチン領域"}]}