{"word":"unframable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(絵画・写真などが)額縁に入れることができない、額装に適さない","english_definition":"Not suitable for framing; unable to be put in a frame (e.g., a picture or photograph).","examples":[{"sentence":"The oddly shaped canvas made the painting unframable.","translation":"その奇妙な形のキャンバスは、絵を額縁に入れるのを不可能にした。"},{"sentence":"Due to its size, the poster was unframable.","translation":"そのポスターはサイズのために額装できなかった。"}],"collocations":["unframable picture","unframable photo","unframable artwork"],"synonyms":["unsuitable for framing","non-framable"],"antonyms":["framable","suitable for framing"]},{"part_of_speech":"adjective","definition":"(比喩的に)定義できない、枠にはめられない","english_definition":"(Figuratively) Impossible to define or categorize; not fitting into a specific framework.","examples":[{"sentence":"The artist's style was so unique that it was unframable.","translation":"そのアーティストのスタイルは非常にユニークで、枠にはめられなかった。"},{"sentence":"His ideas were so radical that they were unframable within the existing political discourse.","translation":"彼のアイデアは非常に過激で、既存の政治的議論の枠にはめられなかった。"}],"collocations":["unframable concept","unframable idea","unframable style"],"synonyms":["indefinable","uncategorizable","unclassifiable"],"antonyms":["definable","categorizable","classifiable"]}],"etymology":{"value":"The word \"unframable\" is formed by adding the prefix \"un-\" (meaning 'not') to the word \"framable,\" which itself is derived from \"frame\" (a structure that surrounds or supports something) and the suffix \"-able\" (meaning 'capable of being'). Thus, \"unframable\" literally means 'not capable of being framed'.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈfreɪməbəl/","syllables":"un-fra-ma-ble"},"inflection":{"adjective_forms":{"comparative":"more unframable","superlative":"most unframable"}},"usage_notes":{"explanation":"The word \"unframable\" is relatively uncommon and is primarily used in two contexts. First, it describes physical objects, such as paintings or photographs, that cannot be put into a frame due to their size, shape, or other characteristics. Second, it is used metaphorically to describe abstract concepts or ideas that are difficult or impossible to define or categorize within a specific framework. The metaphorical usage is less common than the literal usage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The problem was unframable, so we couldn't solve it.","correct":"✓ The problem was unsolvable, so we couldn't solve it.","note":"When referring to a problem that cannot be solved, use \"unsolvable\" instead of \"unframable.\" \"Unframable\" is more appropriate for describing something that cannot be defined or categorized."}],"priority":"★☆☆"},"related_words":{"derivatives":["frame","framable","framing"],"phrasal_verbs":[],"related_adjectives":["frameless"],"related_nouns":["frame","framework"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (not commonly found in CEFR level vocabulary lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unframable\" is a relatively uncommon word that is formed by adding the prefix \"un-\" to the word \"framable.\" It can be used to describe physical objects that cannot be put into a frame, or abstract concepts that cannot be easily defined or categorized. Because it is not a common word, it is more likely to be encountered in specialized contexts or in writing that uses more sophisticated vocabulary."},"example_sentences":[{"sentence":"The large, irregular tapestry was deemed unframable due to its unusual dimensions.","translation":"その大きく不規則なタペストリーは、その珍しい寸法のために額装できないと判断された。","type":"adjective","meaning_category":"額縁に入れることができない"},{"sentence":"The philosopher argued that human consciousness is essentially unframable, resisting any attempt at complete definition.","translation":"その哲学者は、人間の意識は本質的に枠にはめられず、完全な定義への試みに抵抗すると主張した。","type":"adjective","meaning_category":"定義できない"}]}