{"word":"leatmen","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A historical term for miners who had the right to lease land for mining in certain areas, particularly in the Mendip Hills of England.","english_definition":"A historical term for miners who had the right to lease land for mining in certain areas, particularly in the Mendip Hills of England.","examples":[{"sentence":"The leatmen of the Mendip Hills had unique customs and laws governing their mining activities.","translation":"メンディップ丘陵のリートメンは、彼らの採掘活動を規制する独自の慣習と法律を持っていました。"}],"collocations":["Mendip leatmen","rights of leatmen","customs of leatmen"],"synonyms":["miner","land leaser","customary miner"],"antonyms":[]}],"etymology":{"value":"The term 'leatman' is derived from 'leat', referring to a watercourse or channel, and 'man', indicating a person. It likely relates to the miners' association with water management or the use of watercourses in their mining operations.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈliːtmən/","syllables":"leat-man"},"inflection":{"noun_plural":"leatmen"},"usage_notes":{"explanation":"The term 'leatmen' is specific to historical contexts, particularly concerning mining rights and practices in certain regions of England, such as the Mendip Hills. It is not a commonly used term in modern English.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["leat (watercourse)"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - Primarily used in historical or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'leatmen' is a historical term referring to miners with specific rights in certain regions, particularly the Mendip Hills. It is not commonly used in modern English and is primarily encountered in historical texts or specialized discussions about mining history. Understanding the term requires knowledge of historical mining practices and regional customs."},"example_sentences":[{"sentence":"Historical records detail the disputes between landowners and the leatmen over mining rights.","translation":"歴史的記録は、鉱業権をめぐる地主とリートメンの間の紛争を詳述しています。","type":"noun","meaning_category":"historical mining term"}]}