{"word":"non-load-bearing","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(建築で)耐力壁でない、荷重を支えない","english_definition":"(of a wall or other structural member) not supporting any weight from above other than its own.","examples":[{"sentence":"The wall we removed was non-load-bearing, so it didn't affect the structural integrity of the house.","translation":"私たちが取り除いた壁は耐力壁ではなかったので、家の構造的な完全性には影響しませんでした。"},{"sentence":"A non-load-bearing partition wall can be easily moved or removed.","translation":"荷重を支えない間仕切り壁は簡単に移動または取り外しが可能です。"},{"sentence":"The architect specified that the interior walls should be non-load-bearing to allow for flexible space planning.","translation":"建築家は、柔軟な空間計画を可能にするために、内壁は荷重を支えないように指定しました。"}],"collocations":["non-load-bearing wall (耐力壁でない壁)","non-load-bearing partition (荷重を支えない間仕切り)","non-load-bearing structure (荷重を支えない構造)"],"synonyms":["partition wall","curtain wall"],"antonyms":["load-bearing","structural"],"notes":["Typically used in the context of construction and architecture."]}],"etymology":{"value":"Formed by adding the prefix 'non-' to 'load-bearing'. 'Load-bearing' itself is a compound adjective describing something that supports a load or weight.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn ˈloʊdˌbɛərɪŋ/","syllables":"non-load-bear-ing"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"'Non-load-bearing' is a technical term primarily used in architecture and construction. It refers to a wall or other structural element that does not support any significant weight from the structure above. Its main purpose is usually to divide space. Removing a non-load-bearing wall is generally less structurally risky than removing a load-bearing wall, but it's always essential to consult with a qualified professional before making any structural changes to a building.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The wall is not load bearing.","correct":"✓ The wall is non-load-bearing.","note":"While 'not load-bearing' is understandable, 'non-load-bearing' is the more common and technically correct term in architectural and construction contexts."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["load-bearing (耐力壁の、荷重を支える)","structural (構造の、構造上の)","partition (仕切り、間仕切り)","wall (壁)","architecture (建築)","construction (建設)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency - Primarily a technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Non-load-bearing' is a technical term used in construction and architecture. It describes a wall or other part of a building that doesn't hold up the weight of the structure above it. Instead, it mainly serves to divide rooms or spaces. Because it's a specialized term, you'll mostly find it in discussions about building design, renovation, or structural engineering. If you're not involved in these fields, you probably won't encounter it very often."},"example_sentences":[{"sentence":"Before starting the renovation, we confirmed with an engineer that the wall was indeed non-load-bearing.","translation":"改修を始める前に、壁が実際に耐力壁でないことをエンジニアに確認しました。","type":"example","meaning_category":"definition"},{"sentence":"Removing the non-load-bearing wall allowed us to create a more open floor plan.","translation":"耐力壁でない壁を取り除くことで、より開放的なフロアプランを作ることができました。","type":"example","meaning_category":"definition"},{"sentence":"The building plans clearly indicated which walls were load-bearing and which were non-load-bearing.","translation":"建物の設計図には、どの壁が耐力壁で、どの壁が耐力壁でないかが明確に示されていました。","type":"example","meaning_category":"definition"}]}