{"word":"Smooth-Cast","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A brand name for a type of liquid plastic resin used for casting.","english_definition":"A brand name for a series of liquid plastic resins known for their smooth, bubble-free castings, often used in art, model making, and special effects.","examples":[{"sentence":"I used Smooth-Cast 300 to create this prop.","translation":"この小道具を作るのにSmooth-Cast 300を使いました。"},{"sentence":"Smooth-Cast resins are easy to pigment and can be used for a variety of projects.","translation":"Smooth-Cast樹脂は着色が容易で、さまざまなプロジェクトに使用できます。"}],"collocations":["Smooth-Cast 300","Smooth-Cast 305","Smooth-Cast ONYX","cast with Smooth-Cast","pigment Smooth-Cast"],"synonyms":["casting resin","liquid plastic","polyurethane resin"],"antonyms":[]}],"etymology":{"value":"'Smooth' refers to the smooth surface finish achievable with the resin. 'Cast' refers to the casting process in which the liquid resin is poured into a mold.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsmuːθˌkæst/","syllables":"smooth-cast"},"inflection":{"notes":"It's a proper noun (brand name), so it doesn't have plural or verb forms."},"usage_notes":{"explanation":"'Smooth-Cast' is primarily used as a noun to refer to the specific brand of casting resin. It's known for its ease of use and ability to produce smooth, bubble-free castings, making it popular among artists, model makers, and special effects professionals.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to smooth cast this mold.","correct":"✓ I'm going to cast this mold with Smooth-Cast.","note":"'Smooth-Cast' is a noun (the name of the resin), not a verb. You cast *with* Smooth-Cast."}],"priority":"★★☆"},"related_words":{"derivatives":["Smooth-On (manufacturer of Smooth-Cast)","resin","casting","mold","pigment"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, specific to certain hobbies and industries.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Smooth-Cast' is a specialized term referring to a specific brand of casting resin. Understanding its use requires familiarity with the process of resin casting and model making. It is not a commonly used word outside of those specific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The detail on the miniature figure was captured perfectly using Smooth-Cast.","translation":"ミニチュアフィギュアのディテールは、Smooth-Castを使用して完璧に再現されました。","type":"noun","meaning_category":"casting resin"},{"sentence":"For a crystal-clear finish, many artists prefer Smooth-Cast 325.","translation":"クリスタルクリアな仕上がりのために、多くのアーティストはSmooth-Cast 325を好みます。","type":"noun","meaning_category":"casting resin"}]}