{"word":"Areostyle","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(建築)古代ギリシア建築において、柱間が柱の直径の4倍以上離れている柱列。","english_definition":"(architecture) A colonnade in ancient Greek architecture in which the columns are spaced four or more column diameters apart.","examples":[{"sentence":"The areostyle design was rarely used due to structural weaknesses.","translation":"柱間が広いアレオスタイルのデザインは、構造的な弱点のため、めったに使用されなかった。"}],"collocations":["areostyle colonnade","areostyle temple"],"synonyms":["wide-spaced columns"],"antonyms":["pycnostyle","systyle","diastyle","eustyle"],"notes":["Often compared to other column spacing styles: pycnostyle (1.5 diameters), systyle (2 diameters), diastyle (3 diameters), eustyle (2.25 diameters)."]}],"etymology":{"value":"Derived from Greek ἀραιός (araios) 'thin, wide-spaced' + στῦλος (stylos) 'column'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛəriˈoʊstaɪl/","syllables":"a-re-o-style"},"inflection":{"noun_plural":"areostyles"},"usage_notes":{"explanation":"The term 'areostyle' is primarily used in the context of classical architecture, specifically when discussing the column spacing in Greek temples and other structures. It indicates a very wide spacing between columns, which was not commonly employed due to structural challenges.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building was built in an areostyle way.","correct":"✓ The building featured an areostyle colonnade.","note":"'Areostyle' is a noun, so it describes the style of the colonnade, not a general manner of building."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["column","colonnade","architecture","Greek architecture","pycnostyle","systyle","diastyle","eustyle"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - specialized architectural term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Areostyle' is a highly specialized architectural term referring to a specific style of column spacing in ancient Greek architecture. Understanding this term requires familiarity with classical architectural principles and terminology. It's not commonly used outside of academic or professional discussions of architecture."},"example_sentences":[{"sentence":"The ruins revealed an areostyle structure, indicating a less common design choice.","translation":"遺跡は、あまり一般的ではない設計選択を示す、アレオスタイルの構造を明らかにした。","type":"descriptive","meaning_category":"architectural style"},{"sentence":"The architect noted the areostyle spacing, which allowed for more light but reduced structural integrity.","translation":"建築家はアレオスタイルの柱間隔に注目し、より多くの光を取り入れることができるが、構造的完全性を低下させることを指摘した。","type":"technical","meaning_category":"architectural analysis"}]}