{"word":"depasturage","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"放牧権、放牧地","english_definition":"The right of pasturing cattle or sheep; also, the pasture itself.","examples":[{"sentence":"The farmer had depasturage rights on the common land.","translation":"その農家は共有地での放牧権を持っていた。"},{"sentence":"The depasturage was rich and green, providing ample food for the livestock.","translation":"その放牧地は豊かで緑にあふれ、家畜に十分な食料を提供していた。"}],"collocations":["common of depasturage (共有放牧権)","right of depasturage (放牧権)"],"synonyms":["pasturage","grazing","pasture","commonage"],"antonyms":[]}],"etymology":{"value":"'Depasturage' comes from the Old French word 'depasturer', which means 'to graze' or 'to feed on pasture'. This originates from the Latin word 'depasturare', formed from 'de-' (completely) and 'pasturare' (to pasture), which in turn comes from 'pastus' (pasture, food).","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈpæstʃərɪdʒ/","syllables":"de-pas-tur-age"},"inflection":{"noun_plural":"depasturages"},"usage_notes":{"explanation":"'Depasturage' is a somewhat archaic or technical term, primarily used in legal or historical contexts related to land rights and agriculture. It refers both to the right to graze animals on a particular piece of land and to the land itself that is used for grazing. It is not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The depasturage was full of buildings.","correct":"✓ The depasturage was full of grazing animals.","note":"Depasturage refers to land used for grazing, so it should be associated with animals, not buildings."},{"incorrect":"✗ He depasturaged his cattle.","correct":"✓ He had depasturage rights for his cattle.","note":"'Depasturage' is a noun, not a verb. To describe the act of grazing, use 'graze' or 'pasture'."}],"priority":"★☆☆"},"related_words":{"derivatives":["depasture (verb, archaic: to graze, to feed on pasture)","pasture (noun: land covered with grass and other low plants suitable for grazing livestock, verb: to put animals in a pasture to graze)","pasturage (noun: pasture land, the act of grazing)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very low frequency)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Depasturage' is a specialized term primarily encountered in historical or legal contexts related to land rights and agricultural practices. It denotes both the right to graze animals on a specific piece of land and the land itself used for grazing. Due to its limited usage, it is not part of common vocabulary and is more likely to be found in academic texts or legal documents. Understanding its meaning requires familiarity with historical land management and agricultural terminology."},"example_sentences":[{"sentence":"The ancient documents detailed the extent of the depasturage rights granted to the villagers.","translation":"古代の文書には、村人に与えられた放牧権の範囲が詳細に記されていた。","type":"noun","meaning_category":"放牧権"},{"sentence":"The quality of the depasturage directly affected the health and productivity of the sheep.","translation":"放牧地の質は、羊の健康と生産性に直接影響を与えた。","type":"noun","meaning_category":"放牧地"}]}