{"word":"aggregatory","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"集合的な、集約的な、集計の","english_definition":"Forming or tending to form a collection or aggregate; relating to aggregation or summation.","examples":[{"sentence":"The aggregatory effect of these small changes is significant.","translation":"これらの小さな変化の集合的な効果は重要です。"},{"sentence":"Aggregatory data is used to analyze trends.","translation":"集約データは傾向を分析するために使用されます。"},{"sentence":"This is an aggregatory study, combining data from multiple sources.","translation":"これは複数のソースからのデータを組み合わせた集計研究です。"}],"collocations":["aggregatory effect","aggregatory data","aggregatory study","aggregatory process","aggregatory function"],"synonyms":["collective","cumulative","accumulative","summative","compiling"],"antonyms":["individual","separate","disaggregated"]}],"etymology":{"value":"Derived from 'aggregate,' with the suffix '-ory' indicating a tendency or function related to aggregation. 'Aggregate' comes from Latin 'aggregatus,' the past participle of 'aggregare,' meaning 'to bring together, add to a flock.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈæɡrɪɡəˌtɔːri/","syllables":"ag-gre-ga-to-ry"},"inflection":{"notes":"Adjectives do not typically inflect in English, aside from comparative and superlative forms (which are less common for this word)."},"usage_notes":{"explanation":"'Aggregatory' describes something that either forms an aggregate or relates to the process of aggregation. It is often used in scientific, statistical, or economic contexts to describe data, processes, or effects that involve combining individual elements into a larger whole. It emphasizes the cumulative or collective nature of something.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The individual cells had an aggregatory behavior.","correct":"✓ The cells exhibited aggregatory behavior.","note":"'Aggregatory' is an adjective describing the type of behavior, not directly modifying the subject. Use a verb like 'exhibit' or 'demonstrate' to show the behavior. "},{"incorrect":"✗ The aggregatory of the data was difficult.","correct":"✓ The aggregation of the data was difficult.","note":"'Aggregatory' is an adjective; the noun form is 'aggregation.'"}],"priority":"★★☆"},"related_words":{"derivatives":["aggregate (noun, verb, adjective)","aggregation (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Aggregatory' is a technical term often used in academic or professional contexts, particularly in fields like statistics, economics, and biology. It describes something that is related to the process of forming a collection or sum. Understanding this word requires familiarity with the concept of aggregation, which involves combining individual elements into a larger whole. It's not a word commonly used in everyday conversation."},"example_sentences":[{"sentence":"The study examined the aggregatory impact of small policy changes on the overall economy.","translation":"その研究では、小さな政策変更が経済全体に及ぼす集合的な影響を調査しました。","type":"adjective","meaning_category":"集合的な"},{"sentence":"Aggregatory statistics provide a broad overview of the population.","translation":"集計統計は、人口の広範な概要を提供します。","type":"adjective","meaning_category":"集計の"},{"sentence":"This model simulates the aggregatory behavior of particles in a fluid.","translation":"このモデルは、流体中の粒子の集合的な挙動をシミュレートします。","type":"adjective","meaning_category":"集合的な"}]}