{"word":"peshkash","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史)貢物、献上品、贈り物 (特にインド亜大陸において、支配者や高位の人物に贈られるもの)","english_definition":"(historical) A tribute, offering, or present, especially one presented to a ruler or high-ranking person in the Indian subcontinent.","examples":[{"sentence":"The Peshwa received a peshkash of jewels and gold from the visiting dignitaries.","translation":"ペシュワは訪問した高官たちから宝石と金の貢物を受け取った。"},{"sentence":"The local ruler offered a peshkash to the Mughal emperor to maintain peace.","translation":"地元の支配者は平和を維持するためにムガル皇帝に貢物を献上した。"}],"collocations":["offer a peshkash (貢物を献上する)","receive a peshkash (貢物を受け取る)","jeweled peshkash (宝石で飾られた貢物)","annual peshkash (年間の貢物)"],"synonyms":["tribute","offering","present","gift","nazrana"],"antonyms":[],"notes":"Often associated with the Mughal Empire and other historical kingdoms of India."}],"etymology":{"value":"From Persian *pīškeš* (پیشکش), meaning 'a present, offering, tribute', from *pīš* (پیش) 'before, in front' + *keš* (کش) 'drawing, pulling, offering'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɛʃkæʃ/","syllables":"pesh-kash"},"inflection":{"noun_plural":"peshkashes"},"usage_notes":{"explanation":"'Peshkash' is a historical term primarily used in the context of the Indian subcontinent, particularly during the Mughal era and other periods of princely states. It refers to a form of tribute or offering presented to rulers or high-ranking officials as a sign of respect, loyalty, or submission. The value and nature of the peshkash could vary widely, ranging from precious jewels and gold to agricultural products or other valuable commodities. The term is not commonly used in modern English outside of historical or academic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He gave a peshkash for his birthday.","correct":"✓ He received a peshkash for his birthday.","note":"Peshkash is usually given to someone of higher status, not received on one's birthday."},{"incorrect":"✗ The peshkash was a form of salary.","correct":"✓ The peshkash was a form of tribute.","note":"Peshkash is a tribute or offering, not a salary."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["khiraj (land tax)","jizya (poll tax on non-Muslims)","mansabdar (official in the Mughal Empire)","jagir (land grant)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not in common modern usage)","frequency_google_ngram":"Very low frequency (Primarily used in historical contexts)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Peshkash' is a specialized term primarily encountered in historical texts or academic discussions related to the Mughal Empire and other historical kingdoms of the Indian subcontinent. It denotes a tribute or offering presented to rulers or high-ranking officials, signifying respect, loyalty, or submission. Due to its limited usage in modern English, understanding the term requires familiarity with the historical context of the Indian subcontinent. It is not part of everyday vocabulary and is more likely to be encountered in advanced readings on history or culture."},"example_sentences":[{"sentence":"The Raja presented a lavish peshkash to the British Governor-General.","translation":"ラジャはイギリス総督に豪華な貢物を献上した。","type":"noun","meaning_category":"貢物"},{"sentence":"Historical records detail the annual peshkash paid by various provinces to the central Mughal treasury.","translation":"歴史的記録は、さまざまな州からムガル帝国の中央金庫に支払われた年間の貢物を詳しく述べている。","type":"noun","meaning_category":"貢物"},{"sentence":"The value of the peshkash reflected the power and wealth of the giver.","translation":"貢物の価値は、贈り手の権力と富を反映していた。","type":"noun","meaning_category":"貢物"}]}