{"word":"Megalopia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare) A condition in which objects appear larger than they actually are. A type of visual distortion.","english_definition":"A rare condition characterized by the visual perception that objects are larger than their actual size.","examples":[{"sentence":"The patient described experiencing megalopia during their migraine aura.","translation":"患者は偏頭痛の前兆中に、物体が実際よりも大きく見えるという巨大視症を経験したと述べた。"},{"sentence":"Megalopia can be a symptom of certain neurological conditions.","translation":"巨大視症は、特定の神経学的疾患の症状である可能性がある。"}],"collocations":["experience megalopia","suffer from megalopia","migraine-related megalopia"],"synonyms":["macropsia","Alice in Wonderland syndrome"],"antonyms":["micropsia"],"notes":"Megalopia is often associated with Alice in Wonderland syndrome and can be a symptom of migraines, brain tumors, or drug use. It is the opposite of micropsia, where objects appear smaller than they are.","wikipedia_link":"https://en.wikipedia.org/wiki/Alice_in_Wonderland_syndrome"}],"etymology":{"value":"From Greek μέγας (megas) meaning \"large\" and ὄψ (ops) meaning \"eye\" or \"vision\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɛɡəˈloʊpiə/","syllables":"Meg-a-lo-pi-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Megalopia is a relatively rare and specific term used in medical and psychological contexts to describe a particular type of visual distortion. It is not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had megalopia and thought he was a giant.","correct":"✓ He had megalomania and thought he was a giant.","note":"Megalopia is a visual distortion, while megalomania is a delusion of grandeur."}],"priority":"★★☆"},"related_words":{"derivatives":["megalopsia"],"related_terms":["micropsia","Alice in Wonderland syndrome","visual distortion","macropsia"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Megalopia' is a specialized term primarily used in medical and psychological contexts to describe the perceptual distortion where objects appear larger than their actual size. Due to its specific usage and technical nature, it is not commonly encountered in general language use. Understanding of this term often requires familiarity with medical terminology or psychological concepts related to visual perception disorders."},"example_sentences":[{"sentence":"During the episode of Alice in Wonderland syndrome, she experienced both megalopia and micropsia.","translation":"不思議の国のアリス症候群のエピソード中、彼女は巨大視症と小人症の両方を経験した。","type":"medical/psychological","meaning_category":"visual distortion"},{"sentence":"The doctor suspected megalopia based on the patient's description of their altered perception of size.","translation":"医師は患者の大きさの知覚の変化の説明に基づいて、巨大視症を疑った。","type":"medical/diagnostic","meaning_category":"visual distortion"}]}