{"word":"barrel-driving","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A dangerous stunt involving driving a car at high speed and rolling it over multiple times.","english_definition":"A stunt involving intentionally rolling a vehicle, usually a car, end-over-end.","examples":[{"sentence":"The movie featured a spectacular barrel-driving scene.","translation":"その映画には、壮大なバレル・ドライビングのシーンがあった。"},{"sentence":"He attempted a barrel-driving stunt but crashed.","translation":"彼はバレル・ドライビングのスタントを試みたが、クラッシュした。"}],"collocations":["perform a barrel-driving stunt","attempt a barrel-driving maneuver","barrel-driving accident"],"synonyms":["car rolling","vehicle rollover"],"antonyms":[]}],"etymology":{"value":"The term 'barrel-driving' likely originates from the visual similarity of a rolling car to a barrel rolling end-over-end.","priority":"N/A"},"pronunciation":{"ipa":"/ˈbærəlˌdraɪvɪŋ/","syllables":"bar-rel-dri-ving"},"inflection":{"noun_plural":"barrel-drivings"},"usage_notes":{"explanation":"'Barrel-driving' is a specific term for a dangerous stunt. It is not a common term and is usually used in the context of movies, stunts, or accidents.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He was barrel-driving down the street normally.","correct":"✓ He was driving recklessly down the street.","note":"Barrel-driving is not normal driving; it's an intentional stunt or the result of a loss of control."}],"priority":"N/A"},"related_words":{"derivatives":["barrel roll (aviation maneuver)","stunt driving","rollover accident"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Barrel-driving' refers to a specific and dangerous stunt where a vehicle is intentionally rolled over. Due to its specialized nature, it's not a common term and is primarily used in contexts related to stunts, movies, or accidents. It implies a lack of control or an intentional act of recklessness.","priority":"N/A"},"example_sentences":[{"sentence":"The daredevil planned a series of barrel-driving stunts for his next show.","translation":"その命知らずは、次のショーのために一連のバレル・ドライビング・スタントを計画した。","type":"noun","meaning_category":"Stunt"},{"sentence":"The barrel-driving accident resulted in serious injuries.","translation":"そのバレル・ドライビング事故は重傷を負う結果となった。","type":"noun","meaning_category":"Accident"}]}