{"word":"Zamboorak","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of light cannon or swivel gun, typically mounted on a camel, used historically in Middle Eastern and Asian warfare.","english_definition":"A light cannon or swivel gun, usually mounted on a camel, used historically in Middle Eastern and Asian warfare.","examples":[{"sentence":"The Zamboorak was a fearsome weapon in the desert warfare of the 18th century.","translation":"ザンブーラクは18世紀の砂漠戦における恐るべき武器でした。"},{"sentence":"Mounted on camels, Zambooraks provided mobile artillery support.","translation":"ラクダに搭載されたザンブーラクは、移動砲兵支援を提供しました。"}],"collocations":["camel-mounted Zamboorak","light Zamboorak","historical Zamboorak"],"synonyms":["swivel gun","camel gun"],"antonyms":[]}],"etymology":{"value":"Derived from Persian 'zamburak' (زنبورک), meaning 'little wasp,' likely referring to the sound or sting-like effect of the cannon.","priority":"★★★"},"pronunciation":{"ipa":"/zæmˈbʊəræk/","syllables":"zam-boo-rak"},"inflection":{"noun_plural":"Zambooraks"},"usage_notes":{"explanation":"The term 'Zamboorak' specifically refers to a type of light cannon or swivel gun that was characteristically mounted on camels for mobile warfare. It is primarily a historical term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a zamboorak to hunt deer.","correct":"✓ He used a rifle to hunt deer.","note":"Zambooraks were used in warfare, not typically for hunting."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Zamboorak' is a specialized historical term. Understanding requires knowledge of military history, particularly concerning Middle Eastern and Asian warfare. It's unlikely to be encountered outside of specific historical contexts."},"example_sentences":[{"sentence":"The Afghan army utilized Zambooraks effectively in several battles.","translation":"アフガン軍はいくつかの戦いでザンブーラクを効果的に利用しました。","type":"noun","meaning_category":"historical weapon"}]}