{"word":"buhrstone","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"石臼石、特に穀物を挽くのに用いられる多孔質の珪質岩","english_definition":"a hard, siliceous rock, usually porous, used especially for millstones for grinding grain.","examples":[{"sentence":"The mill used buhrstones to grind the wheat into flour.","translation":"その製粉所では、石臼石を使って小麦を挽いて小麦粉にしていた。"},{"sentence":"Buhrstone quarries were once a significant industry in the region.","translation":"石臼石の採石場は、かつてこの地域で重要な産業だった。"}],"collocations":["millstone","grind grain","quarry","siliceous rock"],"synonyms":["millstone","grindstone"],"antonyms":[]}],"etymology":{"value":"Derived from the Middle High German word 'burre' meaning 'millstone', which itself comes from the Old High German 'boro' meaning 'drill, borer'. The term refers to the porous nature of the stone, which allows it to effectively grind grains.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɜːrstoʊn/","syllables":"buhr-stone"},"inflection":{"noun_plural":"buhrstones"},"usage_notes":{"explanation":"Buhrstone refers specifically to a type of siliceous rock with a porous texture, making it ideal for use in millstones. Its rough surface provides the necessary friction to grind grains effectively. While 'millstone' is a more general term, 'buhrstone' specifies the material.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The buhrstone is made of granite.","correct":"✓ The buhrstone is a type of siliceous rock.","note":"Buhrstone is a specific type of siliceous rock, not granite."}],"priority":"★★☆"},"related_words":{"derivatives":["buhr (noun: a millstone)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency - Specialized term related to historical milling.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Buhrstone' is a specialized term primarily encountered in historical or technical contexts related to milling and grain processing. It refers to a specific type of siliceous rock used in millstones. Understanding this term requires familiarity with historical milling practices and geological terminology."},"example_sentences":[{"sentence":"The old mill still has its original buhrstone.","translation":"その古い製粉所には、まだ元の石臼石がある。","type":"noun","meaning_category":"stone for grinding"},{"sentence":"The texture of the buhrstone is essential for effective grinding.","translation":"石臼石の質感が効果的な粉砕に不可欠である。","type":"noun","meaning_category":"stone texture"}]}