{"word":"micronutrients","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"微量栄養素（びりょうえいようそ）","english_definition":"Nutrients required by the body in small amounts, including vitamins and minerals.","examples":[{"sentence":"Micronutrients are essential for maintaining good health.","translation":"微量栄養素は健康を維持するために不可欠です。"},{"sentence":"A balanced diet should provide all the necessary micronutrients.","translation":"バランスの取れた食事は、必要なすべての微量栄養素を提供するはずです。"},{"sentence":"Deficiencies in micronutrients can lead to various health problems.","translation":"微量栄養素の欠乏は、さまざまな健康問題を引き起こす可能性があります。"}],"collocations":["essential micronutrients (必須微量栄養素)","micronutrient deficiency (微量栄養素欠乏症)","micronutrient supplementation (微量栄養素補給)","micronutrient intake (微量栄養素摂取量)","micronutrient-rich foods (微量栄養素が豊富な食品)"],"synonyms":["vitamins","minerals","trace elements"],"antonyms":["macronutrients"],"related_terms":["vitamins","minerals","macronutrients","nutrients","nutrition","diet"],"notes":"Micronutrients are vital for various bodily functions, including immune function, growth, and development. They are distinct from macronutrients (carbohydrates, proteins, and fats), which are needed in larger quantities.","image":null}],"etymology":{"value":"The term 'micronutrients' is derived from the Greek word 'mikros' meaning small, combined with 'nutrient,' referring to the small quantities in which these nutrients are required by the body.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmaɪkroʊˈnuːtriənts/","syllables":"mi-cro-nu-tri-ents"},"inflection":{"noun_plural":"micronutrients"},"usage_notes":{"explanation":"'Micronutrients' refers collectively to vitamins and minerals, which are essential for health but needed in only small amounts. They play a crucial role in energy production, immune function, blood clotting, and other processes. Unlike macronutrients, micronutrients do not provide energy directly but are vital for the body to function properly.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Micronutrient is important for health.","correct":"✓ Micronutrients are important for health.","note":"'Micronutrients' is a plural noun and should be used with a plural verb."},{"incorrect":"✗ I take a lot of micronutrients every day.","correct":"✓ I take micronutrient supplements every day.","note":"While you can consume micronutrient-rich foods, the term is generally used to refer to the nutrients themselves, not the food containing them. When referring to supplements, use 'micronutrient supplements'."}],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively common in health and nutrition contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Micronutrients' are vitamins and minerals that your body needs in small amounts to stay healthy. They help with things like your immune system, growing, and making energy. You can get them from a balanced diet or supplements. Not getting enough micronutrients can cause health problems. They are different from 'macronutrients,' which are things like carbohydrates, proteins, and fats that your body needs in larger amounts."},"example_sentences":[{"sentence":"Fruits and vegetables are excellent sources of micronutrients.","translation":"果物と野菜は微量栄養素の優れた供給源です。","type":"general","meaning_category":"sources"},{"sentence":"The doctor recommended micronutrient supplementation to address the deficiency.","translation":"医師は欠乏症に対処するために微量栄養素の補給を推奨しました。","type":"medical","meaning_category":"supplementation"},{"sentence":"Micronutrient deficiencies are a major public health problem in many developing countries.","translation":"微量栄養素欠乏症は、多くの発展途上国における主要な公衆衛生上の問題です。","type":"public health","meaning_category":"deficiency"}]}