{"word":"stylet","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(医学)スタイレット、針の中に入れる細い針金","english_definition":"A slender probe or quill for medical or surgical use; especially, a wire inserted into a catheter or other tube to stiffen it or to clear a blockage.","examples":[{"sentence":"The doctor used a stylet to clear the blockage in the catheter.","translation":"医者はスタイレットを使ってカテーテル内の詰まりを取り除いた。"},{"sentence":"The stylet helps to guide the catheter during insertion.","translation":"スタイレットは挿入中にカテーテルを誘導するのに役立つ。"}],"collocations":["catheter stylet","guide stylet","remove stylet","insert stylet"],"synonyms":["probe","wire","needle","mandrel"],"antonyms":[]},{"part_of_speech":"noun","definition":"(古)鉄筆、尖筆","english_definition":"An ancient writing instrument; a pointed tool used for writing on wax tablets.","examples":[{"sentence":"The scribe used a stylet to inscribe the letters on the wax.","translation":"書記はスタイレットを使って蝋板に文字を刻んだ。"},{"sentence":"The Roman stylet was often made of bronze or iron.","translation":"ローマのスタイレットはしばしば青銅または鉄で作られていた。"}],"collocations":["bronze stylet","iron stylet","wax tablet","writing stylet"],"synonyms":["stylus","graver","scriber"],"antonyms":[]}],"etymology":{"value":"Derived from the French word 'stylet', which in turn comes from the Italian 'stiletto' (a small dagger). The original meaning related to a pointed instrument, evolving from writing tools to surgical instruments.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstaɪlɛt/","syllables":"sty-let"},"inflection":{"noun_plural":"stylets"},"usage_notes":{"explanation":"The term 'stylet' primarily refers to a slender medical instrument used to guide or clear catheters. It can also refer to an ancient writing tool. The medical usage is more common in contemporary contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The stylist used a stylet to cut my hair.","correct":"✓ The stylist used scissors to cut my hair.","note":"'Stylet' is a medical or historical tool, not a tool for hairstyling. A hairstylist uses scissors or other cutting tools."}],"priority":"★★☆"},"related_words":{"derivatives":["stiletto (related etymologically, referring to a type of dagger)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'stylet' is a specialized term primarily used in medical and historical contexts. It refers to a slender instrument used in surgical procedures or as an ancient writing tool. Due to its specific usage, it is not commonly encountered in everyday language. Understanding its meaning requires familiarity with medical or historical terminology."},"example_sentences":[{"sentence":"The nurse prepared the catheter and stylet for the procedure.","translation":"看護師は処置のためにカテーテルとスタイレットを準備した。","type":"noun","meaning_category":"medical instrument"},{"sentence":"Archaeologists discovered a bronze stylet at the ancient Roman site.","translation":"考古学者は古代ローマの遺跡で青銅のスタイレットを発見した。","type":"noun","meaning_category":"writing instrument"}]}