{"word":"diuretics","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"利尿薬","english_definition":"substances that promote increased urination","examples":[{"sentence":"The doctor prescribed diuretics to reduce the swelling in her legs.","translation":"医師は彼女の足の腫れを軽減するために利尿薬を処方した。"},{"sentence":"Some athletes use diuretics to quickly lose weight before competitions.","translation":"一部のアスリートは、競技前に素早く体重を落とすために利尿薬を使用します。"}],"collocations":["take diuretics","prescribe diuretics","natural diuretics"],"synonyms":["water pills"],"antonyms":[]}],"etymology":{"value":"From the Greek word 'dioureō' meaning 'to urinate', combined with the suffix '-tic' indicating an agent or substance.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdaɪjʊˈrɛtɪks/","syllables":"di-u-ret-ics"},"inflection":{"noun_plural":"diuretics (already plural, singular form is 'diuretic')"},"usage_notes":{"explanation":"'Diuretics' are primarily used to treat conditions where the body retains excess fluid, such as heart failure, kidney disease, and high blood pressure. They work by helping the kidneys remove more sodium and water from the body, which is then excreted in urine. It is important to use diuretics under medical supervision, as they can cause electrolyte imbalances and other side effects.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I took diuretic for my headache.","correct":"✓ I took an aspirin for my headache. / ✓ I took a diuretic for fluid retention.","note":"Diuretics are not typically used for headaches. They are used for fluid retention or high blood pressure."},{"incorrect":"✗ Diuretics are a good way to lose weight permanently.","correct":"✓ Diuretics can cause temporary weight loss, but it is not a healthy or permanent solution.","note":"Diuretics cause water loss, not fat loss, and can be dangerous if misused for weight loss."}],"priority":"★★☆"},"related_words":{"derivatives":["diuretic (adjective, noun)","diuresis (noun: increased or excessive production of urine)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, mainly used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'diuretics' refers to a class of medications or substances that increase the production of urine. This term is commonly encountered in medical contexts, such as when discussing treatments for conditions like hypertension or edema. Understanding the function and potential side effects of diuretics requires a relatively advanced understanding of physiology and medical terminology."},"example_sentences":[{"sentence":"The patient was prescribed **diuretics** to manage their high blood pressure.","translation":"患者は高血圧を管理するために利尿薬を処方された。","type":"noun","meaning_category":"medication"},{"sentence":"Some foods, like watermelon and cucumber, have natural **diuretic** properties.","translation":"スイカやキュウリなど、一部の食品には天然の利尿作用がある。","type":"adjective","meaning_category":"natural properties"},{"sentence":"Long-term use of **diuretics** can lead to potassium deficiency.","translation":"利尿薬の長期使用はカリウム欠乏症を引き起こす可能性がある。","type":"noun","meaning_category":"side effects"}]}