{"word":"Pearleye","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A small, silvery fish found in deep waters of the Atlantic and Pacific Oceans, belonging to the family Alepocephalidae.","english_definition":"A deep-sea fish of the family Alepocephalidae, typically small and silvery in color.","examples":[{"sentence":"The Pearleye is adapted to living in the dark, high-pressure environment of the deep sea.","translation":"メナダカ科の魚は深海の暗く、高圧の環境で生きるように適応している。"},{"sentence":"Scientists study Pearleye to understand deep-sea ecosystems.","translation":"科学者たちは深海の生態系を理解するためにメナダカ科の魚を研究している。"}],"collocations":["deep-sea pearleye","study pearleye","observe pearleye"],"synonyms":["alepocephalid"],"antonyms":[]}],"etymology":{"value":"The name \"Pearleye\" likely comes from the pearly, silvery appearance of the fish, especially its eyes.","priority":"N/A"},"pronunciation":{"ipa":"/ˈpɜːrlaɪ/","syllables":"Pearl-eye"},"inflection":{"noun_plural":"Pearleyes"},"usage_notes":{"explanation":"Pearleye is a relatively uncommon term, primarily used in marine biology and oceanography contexts. It refers to a specific type of deep-sea fish.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["Alepocephalidae (family name)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term \"Pearleye\" is specialized vocabulary related to marine biology. Understanding requires familiarity with scientific classification and deep-sea ecosystems."},"example_sentences":[{"sentence":"The research vessel captured several Pearleye specimens during its deep-sea trawl.","translation":"調査船は深海トロール中に数匹のメナダカ科の魚の標本を捕獲した。","type":"noun","meaning_category":"fish"},{"sentence":"Pearleye are known for their ability to survive in extreme ocean depths.","translation":"メナダカ科の魚は極端な深海で生き残る能力で知られている。","type":"noun","meaning_category":"fish"}]}