{"word":"Reinjury","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"再負傷、再発","english_definition":"An injury that occurs again after a previous injury has healed or seemingly healed.","examples":[{"sentence":"He suffered a reinjury to his knee during the game.","translation":"彼は試合中に膝を再負傷した。"},{"sentence":"Proper rehabilitation is crucial to prevent reinjury.","translation":"再負傷を防ぐためには適切なリハビリが不可欠です。"},{"sentence":"The doctor warned him about the risk of reinjury if he returned to sports too soon.","translation":"医者は彼に、早すぎるスポーツ復帰は再負傷のリスクがあると警告した。"}],"collocations":["prevent reinjury (再負傷を防ぐ)","risk of reinjury (再負傷のリスク)","knee reinjury (膝の再負傷)","ankle reinjury (足首の再負傷)","shoulder reinjury (肩の再負傷)"],"synonyms":["relapse","recurrence","re-aggravation"],"antonyms":["recovery","healing","cure"]}],"etymology":{"value":"Prefix 're-' (again) + 'injury' (damage or harm to the body).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˈɪndʒəri/","syllables":"re-in-ju-ry"},"inflection":{"noun_plural":"reinjuries"},"usage_notes":{"explanation":"'Reinjury' refers specifically to an injury that happens again in the same location or type as a previous injury. It's often used in the context of sports, physical therapy, and medicine. It implies that the area was previously injured and has been injured again, often due to premature return to activity or inadequate healing/rehabilitation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He got a new injury in his knee.","correct":"✓ He suffered a reinjury to his knee.","note":"Use 'reinjury' when the injury is to the same area as a previous one. 'New injury' implies a different location or type of injury."},{"incorrect":"✗ The reinjury was very painful than the first time.","correct":"✓ The reinjury was more painful than the first time.","note":"Use 'more' for the comparative form of adjectives ending in -ful, -ous, -ive, -ing, -ed, etc."}],"priority":"★★☆"},"related_words":{"derivatives":["reinjure (verb)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in medical and sports contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Reinjury' is a compound noun that means an injury that happens again after a previous injury. It is commonly used in medical and sports contexts, particularly when discussing recovery and rehabilitation. Understanding this word is important for discussing injury prevention and management.","priority":"★★★"},"example_sentences":[{"sentence":"The athlete's comeback was delayed due to a shoulder **reinjury**.","translation":"その運動選手の復帰は、肩の再負傷により遅れた。","type":"noun","meaning_category":"再負傷"},{"sentence":"To minimize the risk of **reinjury**, follow your doctor's instructions carefully.","translation":"再負傷のリスクを最小限に抑えるために、医師の指示に注意深く従ってください。","type":"noun","meaning_category":"再負傷"},{"sentence":"He is working with a physical therapist to strengthen his muscles and prevent **reinjury**.","translation":"彼は理学療法士と協力して筋肉を強化し、再負傷を防いでいます。","type":"noun","meaning_category":"再負傷"}]}