{"word":"unpropitiatory","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"宥和的でない、懐柔的でない、取り入ろうとしない","english_definition":"Not intended or likely to conciliate or appease; not propitiatory.","examples":[{"sentence":"His unpropitiatory remarks only served to anger the crowd further.","translation":"彼の宥和的でない発言は、群衆をさらに怒らせるだけだった。"},{"sentence":"The company's unpropitiatory stance in negotiations led to a breakdown in talks.","translation":"交渉における会社の非懐柔的な姿勢は、話し合いの決裂につながった。"}],"collocations":["unpropitiatory remarks","unpropitiatory stance","unpropitiatory attitude","unpropitiatory behavior"],"synonyms":["unconciliatory","unappeasing","unplacatory","antagonistic","hostile","inflexible","uncompromising"],"antonyms":["propitiatory","conciliatory","appeasing","placatory","friendly","compromising"]}],"etymology":{"value":"\"Un-\" (not) + \"propitiatory\" (intended to propitiate). \"Propitiatory\" comes from Latin \"propitiare\" (to appease).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnprəˈpɪʃiətɔːri/","syllables":"un-pro-pi-ti-a-to-ry"},"inflection":{"notes":"Adjectives do not inflect in English, but can form comparative and superlative forms (more unpropitiatory, most unpropitiatory)."},"usage_notes":{"explanation":"\"Unpropitiatory\" describes something (usually speech, behavior, or an attitude) that is not intended to appease or conciliate. It often implies a deliberate refusal to try to make someone feel better or more favorably inclined. It is a relatively uncommon word, often used in formal or literary contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The propitiatory remarks made the situation worse.","correct":"✓ The unpropitiatory remarks made the situation worse.","note":"Confusing \"propitiatory\" (intended to appease) with \"unpropitiatory\" (not intended to appease) can lead to the opposite meaning being conveyed."}],"priority":"★★☆"},"related_words":{"derivatives":["propitiate (verb): to appease or conciliate","propitiation (noun): the act of appeasing","propitiatory (adjective): intended to appease"],"antonyms":["conciliatory","appeasing","placatory"],"synonyms":["unconciliatory","unappeasing","antagonistic"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unpropitiatory' is a formal word describing actions or words that do not attempt to make someone feel calmer or more friendly. It's the opposite of trying to please or appease someone. You'd use it when someone is being deliberately unhelpful or confrontational."},"example_sentences":[{"sentence":"The ambassador's unpropitiatory response to the demands only escalated the conflict.","translation":"大使の要求に対する非宥和的な返答は、紛争を激化させただけだった。","type":"adjective","meaning_category":"Not intended to appease"},{"sentence":"Her unpropitiatory tone made it clear she had no intention of apologizing.","translation":"彼女の非懐柔的な口調は、謝罪するつもりがないことを明らかにした。","type":"adjective","meaning_category":"Not intended to appease"},{"sentence":"The politician's unpropitiatory comments were criticized by members of both parties.","translation":"その政治家の非宥和的なコメントは、両党の議員から批判された。","type":"adjective","meaning_category":"Not intended to appease"}]}