{"word":"plowbacks","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(会計) 内部留保、利益の再投資","english_definition":"(accounting) profits that are reinvested in the business instead of being paid out as dividends.","examples":[{"sentence":"The company's growth was largely due to consistent plowbacks of its earnings.","translation":"その会社の成長は、主に一貫した利益の内部留保によるものでした。"},{"sentence":"Plowbacks allow the company to fund research and development without incurring debt.","translation":"内部留保により、会社は負債を抱えることなく研究開発に資金を投入できます。"}],"collocations":["retained earnings","profit reinvestment","internal financing"],"synonyms":["retained earnings","profit reinvestment","internal financing"],"antonyms":["dividends","payouts"]},{"part_of_speech":"noun","definition":"(農業) すき返し、耕うん","english_definition":"(agriculture) the practice of plowing under a crop to improve the soil.","examples":[{"sentence":"Plowbacks of cover crops can significantly improve soil fertility.","translation":"被覆作物のすき返しは、土壌の肥沃度を大幅に向上させることができます。"},{"sentence":"Plowbacks are an environmentally friendly way to enrich the soil.","translation":"すき返しは、環境に優しい土壌改良方法です。"}],"collocations":["green manure","cover crop incorporation","soil enrichment"],"synonyms":["green manure","cover crop incorporation","soil enrichment"],"antonyms":[]}],"etymology":{"value":"The word 'plowback' is formed by combining 'plow' (referring to the agricultural practice of turning over soil) and 'back' (indicating the return or reinvestment of something). In the context of finance, it signifies the 'plowing back' of profits into the business.","priority":"★★★"},"pronunciation":{"ipa":"/ˈplaʊˌbæks/","syllables":"plow-backs"},"inflection":{"noun_plural":"plowbacks"},"usage_notes":{"explanation":"The term 'plowbacks' has two primary meanings depending on the context:\n\n1.  **Accounting/Finance:** Refers to the practice of reinvesting profits back into a company rather than distributing them as dividends. This is a common strategy for companies seeking growth and expansion.\n2.  **Agriculture:** Refers to the agricultural technique of plowing under a crop (often a cover crop or green manure) to enrich the soil. This is a sustainable farming practice.\n\nIt's important to understand the context to determine the intended meaning of 'plowbacks.'","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The plowbacks were distributed to shareholders.","correct":"✓ Dividends were distributed to shareholders.","note":"Plowbacks are *not* distributed to shareholders; they are reinvested in the company. Dividends are the payments made to shareholders."},{"incorrect":"✗ The company used plowbacks to pay off its debt.","correct":"✓ The company used retained earnings to pay off its debt.","note":"While plowbacks (retained earnings) *can* be used to pay off debt, it's more common to say 'retained earnings' in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["plowback (singular noun)","reinvest","reinvestment","retained earnings","cover crop","green manure"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Plowbacks' is a term with specialized meanings in finance and agriculture. In finance, it refers to the practice of reinvesting a company's profits back into the business instead of distributing them as dividends. This is a strategy for growth. In agriculture, it describes the process of plowing under a crop to improve the soil. Understanding the context is essential to correctly interpret the meaning of 'plowbacks.'"},"example_sentences":[{"sentence":"The company's aggressive plowbacks strategy fueled its rapid expansion into new markets.","translation":"その会社の積極的な内部留保戦略が、新たな市場への急速な拡大を促進した。","type":"noun","meaning_category":"Accounting/Finance"},{"sentence":"Plowbacks of legumes can naturally increase nitrogen levels in the soil.","translation":"マメ科植物のすき返しは、土壌中の窒素レベルを自然に高めることができる。","type":"noun","meaning_category":"Agriculture"}]}