{"word":"unrabbinic","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Not conforming to or characteristic of rabbinic teachings or traditions.","english_definition":"Not in accordance with rabbinic law or tradition.","examples":[{"sentence":"The scholar argued that the practice was unrabbinic and should be discontinued.","translation":"その学者は、その慣習はラビの教えに反しており、中止すべきだと主張した。"},{"sentence":"His unrabbinic views caused controversy within the community.","translation":"彼のラビの教えに沿わない見解は、コミュニティ内で論争を引き起こした。"}],"collocations":["unrabbinic practice","unrabbinic view","unrabbinic interpretation"],"synonyms":["non-rabbinic","anti-rabbinic","heterodox"],"antonyms":["rabbinic","orthodox"]}],"etymology":{"value":"Formed from the prefix 'un-' (not) and 'rabbinic'.","priority":"N/A"},"pronunciation":{"ipa":"/ˌʌn.rəˈbɪn.ɪk/","syllables":"un-rab-bin-ic"},"inflection":{"notes":"Adjectives do not inflect in English, other than to form comparative and superlative forms, which are not commonly used for 'unrabbinic'."},"usage_notes":{"explanation":"'Unrabbinic' is used to describe something that deviates from established rabbinic principles, laws, or customs. It often carries a negative connotation, implying that the subject is incorrect, inappropriate, or heretical from a rabbinic perspective.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["rabbinic","rabbi","rabbinical"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The word 'unrabbinic' is a specialized term primarily used in religious or academic contexts related to Judaism. It signifies a deviation from or contradiction of rabbinic teachings and traditions. Due to its specific usage and the relative unfamiliarity of rabbinic law to the general public, it is considered a high-level vocabulary word."},"example_sentences":[{"sentence":"The proposed change to the ritual was deemed unrabbinic by the leading authorities.","translation":"その儀式への提案された変更は、主要な当局によってラビの教えに反すると見なされた。","type":"adjective","meaning_category":"Not conforming to rabbinic teachings"},{"sentence":"Some historians argue that certain aspects of early Christianity were unrabbinic in origin.","translation":"一部の歴史家は、初期キリスト教の特定の側面は、起源がラビの教えに沿わないものだったと主張している。","type":"adjective","meaning_category":"Not conforming to rabbinic teachings"}]}