{"word":"hypermorphic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(遺伝学) 遺伝子の変異が、その遺伝子の通常の機能を過剰に発現させること、またはそのような変異を持つ遺伝子に関連する","english_definition":"(genetics) Relating to a gene mutation that causes an excessive expression of the gene's normal function, or to a gene with such a mutation.","examples":[{"sentence":"The hypermorphic allele resulted in increased production of the protein.","translation":"そのハイパーモルフ型対立遺伝子は、タンパク質の生産量の増加をもたらした。"},{"sentence":"Hypermorphic mutations can lead to developmental abnormalities.","translation":"ハイパーモルフ型変異は、発達異常につながる可能性がある。"}],"collocations":["hypermorphic allele","hypermorphic mutation","hypermorphic gene"],"synonyms":["gain-of-function","overactive"],"antonyms":["hypomorphic","loss-of-function"]}],"etymology":{"value":"'Hypermorphic' is derived from the Greek words 'hyper' (meaning 'above' or 'excessive') and 'morphe' (meaning 'form' or 'shape'), combined with the suffix '-ic' (relating to). It describes a mutation that results in an overproduction or increased activity of a gene's normal function.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpərˈmɔːrfɪk/","syllables":"hy-per-mor-phic"},"inflection":{"notes":"It is an adjective, so it can be used to describe nouns. It does not have different forms for gender or number."},"usage_notes":{"explanation":"In genetics, a 'hypermorphic' mutation leads to an increased level of gene expression or activity compared to the normal, wild-type allele. This can result in an overproduction of the gene product or an enhanced function. Hypermorphic mutations are a type of gain-of-function mutation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The gene was hypermorphic because it was deleted.","correct":"✓ The gene was hypermorphic because it was overexpressed.","note":"Hypermorphic mutations involve increased function, not deletion. Deletion would be a loss-of-function mutation."}],"priority":"★★☆"},"related_words":{"derivatives":["hypermorph (noun)"],"related_terms":["gain-of-function mutation","loss-of-function mutation","neomorphic","antimorphic","allele","mutation"]},"level_frequency":{"frequency_google_ngram":"Low frequency. It is a technical term used primarily in genetics.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'hypermorphic' is a technical term used in genetics to describe a type of gene mutation. Specifically, it refers to a mutation that causes a gene to be more active than normal. This increased activity can lead to an overproduction of the gene's product or an enhancement of its function. Understanding this term requires a basic knowledge of genetics and mutation types."},"example_sentences":[{"sentence":"The researchers identified a hypermorphic mutation in the signaling pathway.","translation":"研究者たちは、シグナル伝達経路におけるハイパーモルフ型変異を特定した。","type":"general","meaning_category":"genetics"},{"sentence":"The observed phenotype was due to a hypermorphic allele of the regulatory gene.","translation":"観察された表現型は、調節遺伝子のハイパーモルフ型対立遺伝子によるものだった。","type":"specific","meaning_category":"genetics"}]}