{"word":"tough-footed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Having tough feet; able to walk on rough ground without discomfort.","english_definition":"Having feet that are resistant to injury or discomfort, especially when walking on rough or uneven surfaces.","examples":[{"sentence":"The mountain goats are tough-footed, allowing them to navigate the rocky terrain with ease.","translation":"その山のヤギは足が丈夫なので、岩だらけの地形を容易に移動できます。"},{"sentence":"Years of hiking had made her tough-footed, so she barely noticed the sharp stones.","translation":"長年のハイキングで彼女の足は丈夫になり、鋭い石にもほとんど気づきませんでした。"}],"collocations":["tough-footed animal","tough-footed hiker","tough-footed traveler"],"synonyms":["hard-footed","thick-skinned","calloused"],"antonyms":["tender-footed","soft-footed","delicate"],"notes":"This word describes someone or something with feet that are resistant to pain or injury from rough surfaces."}],"etymology":{"value":"Combination of 'tough' (resistant, strong) and 'footed' (having feet of a certain type).","priority":"N/A"},"pronunciation":{"ipa":"/ˈtʌfˌfʊtɪd/","syllables":"tough-foot-ed"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"The term 'tough-footed' is typically used to describe animals or people who can easily walk or climb on rough terrain without experiencing discomfort or injury to their feet. It implies a certain resilience and adaptation to challenging environments.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"He is tough-footed in the argument.","correct":"He is strong-willed in the argument.","note":"'Tough-footed' refers specifically to the feet's resilience, not general stubbornness."}],"priority":"N/A"},"related_words":{"derivatives":[],"related_terms":["tough","foot","footed"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Tough-footed' is a descriptive adjective used to indicate that someone or something has feet that are resistant to injury or discomfort, especially when walking on rough or uneven surfaces. It's not a commonly used word, but its meaning is relatively straightforward to understand based on its component parts: 'tough' (strong, durable) and 'footed' (having feet)."},"example_sentences":[{"sentence":"The Bedouin people are known for being tough-footed, able to traverse the desert sands with ease.","translation":"ベドウィンの人々は、足が丈夫で、砂漠の砂を容易に横断できることで知られています。","type":"adjective","meaning_category":"physical ability"},{"sentence":"The tough-footed goats climbed the steep cliffs effortlessly.","translation":"足の丈夫なヤギは、急な崖を楽々と登りました。","type":"adjective","meaning_category":"animal characteristic"}]}