{"word":"scrimpness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"けちけちしていること、倹約、節約","english_definition":"The quality or state of being scrimp; stinginess; parsimony; economy.","examples":[{"sentence":"The scrimpness of the budget made it difficult to complete the project.","translation":"予算のけちけちした様子から、プロジェクトを完了することが困難になった。"},{"sentence":"Her scrimpness with money allowed her to save a considerable amount.","translation":"彼女の金銭に対する倹約さによって、かなりの金額を貯蓄することができた。"}],"collocations":["budget scrimpness","financial scrimpness"],"synonyms":["stinginess","parsimony","frugality","thriftiness","economy","meanness"],"antonyms":["generosity","extravagance","lavishness","prodigality"]}],"etymology":{"value":"Derived from the adjective 'scrimp', meaning 'meager, scanty', with the addition of the noun-forming suffix '-ness'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈskrɪmpnəs/","syllables":"scrimp-ness"},"inflection":{"noun_plural":"scrimpnesses (rarely used)"},"usage_notes":{"explanation":"'Scrimpness' refers to the quality of being extremely frugal or economical, often to the point of being stingy. It describes a situation or behavior characterized by a lack of generosity or willingness to spend money. It is not a commonly used word, and its use may sound somewhat formal or archaic.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The scrimpness of the food was delicious.","correct":"✓ The scrimpness of the food was apparent.","note":"'Scrimpness' describes the quality of being meager or stingy, not the taste of food. Use it to describe the quantity or quality of something being insufficient or limited."},{"incorrect":"✗ He showed scrimpness to his friends.","correct":"✓ He showed scrimpness in his spending.","note":"'Scrimpness' is a quality or state. Use it to describe a general tendency or characteristic, not a specific action towards someone."}],"priority":"★★☆"},"related_words":{"derivatives":["scrimp (verb)","scrimpy (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly used)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Scrimpness' is a relatively uncommon word that describes the quality of being extremely frugal or stingy. It is used to describe situations or behaviors characterized by a lack of generosity or a willingness to spend money. Because of its rarity, it is more likely to be encountered in formal writing or historical contexts. Understanding the word requires a good vocabulary and an ability to infer meaning from context."},"example_sentences":[{"sentence":"The project suffered from the **scrimpness** of its funding.","translation":"そのプロジェクトは資金のけちけちした様子に苦しんだ。","type":"general"},{"sentence":"The **scrimpness** of the portions at the restaurant was disappointing.","translation":"レストランの料理の量がけちけちしていたのは残念だった。","type":"general"}]}