{"word":"white hunter","priority":"低","meanings":[{"part_of_speech":"noun","definition":"(歴史的に)アフリカでの大規模な狩猟旅行を案内する白人","english_definition":"(historically) a white person who guided big-game hunting expeditions in Africa.","examples":[{"sentence":"The white hunter led the wealthy tourists on safari.","translation":"白人ハンターは裕福な観光客をサファリに案内した。"},{"sentence":"He aspired to be a famous white hunter like his father.","translation":"彼は父親のような有名な白人ハンターになることを夢見ていた。"}],"collocations":["big-game hunting","safari guide","professional hunter"],"synonyms":["safari leader","hunting guide"],"antonyms":[]},{"part_of_speech":"noun","definition":"(比喩的に)危険な状況や冒険的な活動を率いる人","english_definition":"(figuratively) someone who leads others in a dangerous or adventurous activity.","examples":[{"sentence":"The tech entrepreneur became a white hunter in the world of venture capital.","translation":"そのテクノロジー起業家は、ベンチャーキャピタルの世界で危険な状況を率いる人となった。"}],"collocations":[],"synonyms":["leader","pioneer","adventurer"],"antonyms":[]}],"etymology":{"value":"この用語は、20世紀初頭に、主に東アフリカで富裕層の顧客のために大規模な狩猟旅行を組織し、案内した白人プロのハンターを指すために生まれた。","priority":"中"},"pronunciation":{"ipa":"/ˈwaɪt ˈhʌntər/","syllables":"white hunt-er"},"inflection":{"noun_plural":"white hunters"},"usage_notes":{"explanation":"この用語は歴史的な背景を持ち、植民地時代の権力構造と関連付けられることが多い。現代では、この用語の使用は問題視される可能性があり、より中立的な用語（例：サファリガイド、プロのハンター）が好まれる。比喩的な意味で使用される場合もあるが、注意が必要である。","priority":"高"},"common_mistakes":{"examples":[{"incorrect":"He is a whitehunter.","correct":"He is a white hunter.","note":"複合語であり、スペースが必要。"},{"incorrect":"They hired a white hunter for their vacation in Europe.","correct":"They hired a hunting guide for their vacation in Europe.","note":"通常、この用語はアフリカの文脈でのみ使用される。"}],"priority":"中"},"related_words":{"derivatives":["hunting","safari","guide"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低い","priority":"低"},"readability_explanation":{"level":"C1","text":"The term \"white hunter\" has historical connotations related to big-game hunting in Africa, often associated with colonialism. While it can be used figuratively, it's important to be aware of its potential to be offensive. In modern contexts, more neutral terms like \"safari guide\" or \"hunting guide\" are generally preferred. Understanding the historical context is crucial for interpreting its meaning and potential implications."},"example_sentences":[{"sentence":"In the early 20th century, the white hunter was a common figure in East Africa.","translation":"20世紀初頭、白人ハンターは東アフリカでよく見られる人物だった。","type":"noun","meaning_category":"historical context"},{"sentence":"The film portrayed a stereotypical image of the white hunter.","translation":"その映画は、白人ハンターのステレオタイプなイメージを描写していた。","type":"noun","meaning_category":"stereotypical representation"},{"sentence":"Modern safari companies prefer to use the term 'professional guide' rather than 'white hunter'.","translation":"現代のサファリ会社は、「白人ハンター」よりも「プロのガイド」という用語を使うことを好む。","type":"noun","meaning_category":"modern usage"}]}