{"word":"Entoprocta","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"内肛動物","english_definition":"A phylum of mostly sessile aquatic animals, also known as Kamptozoa, characterized by a circular or U-shaped crown of ciliated tentacles surrounding both the mouth and anus.","examples":[{"sentence":"Entoprocts are found in both marine and freshwater environments.","translation":"内肛動物は海洋と淡水環境の両方で見られる。"},{"sentence":"The Entoprocta are filter feeders, using their tentacles to capture food particles from the water.","translation":"内肛動物は濾過摂食者であり、触手を使って水中の食物粒子を捕獲する。"}],"collocations":["marine entoprocts","freshwater entoprocts","sessile entoprocts","colonial entoprocts"],"synonyms":["Kamptozoa"],"antonyms":[]}],"etymology":{"value":"From Greek ἐντός (entós, \"within\") + πρωκτός (prōktós, \"anus\"), referring to the position of the anus within the tentacular crown.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛntoʊˈprɒktə/","syllables":"En-to-proc-ta"},"inflection":{"noun_plural":"Entoprocts"},"usage_notes":{"explanation":"Entoprocta is a phylum name used in scientific classification. It is often used in biological and zoological contexts. The term Kamptozoa is considered a synonym, although some classifications may treat them differently.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Entoprocta is a type of insect.","correct":"✓ Entoprocta is a phylum of aquatic animals.","note":"Entoprocta are not insects; they are a distinct phylum of aquatic animals."}],"priority":"★★☆"},"related_words":{"derivatives":["entoproct (noun, a single animal of the phylum Entoprocta)","entoproctan (adjective, relating to Entoprocta)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency. Primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Entoprocta' is a technical term used in zoology and marine biology to refer to a specific phylum of aquatic animals. Understanding this term requires familiarity with biological classification systems and terminology. It is not commonly used outside of scientific contexts."},"example_sentences":[{"sentence":"Research on Entoprocta contributes to our understanding of invertebrate evolution.","translation":"内肛動物の研究は、無脊椎動物の進化の理解に貢献する。","type":"general","meaning_category":"scientific study"},{"sentence":"Colonies of Entoprocta can be found attached to various substrates in the ocean.","translation":"内肛動物の群体は、海洋の様々な基質に付着しているのが見られる。","type":"habitat","meaning_category":"ecological distribution"}]}