{"word":"lubricant-compatible","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"潤滑剤適合性の、潤滑剤と適合する","english_definition":"Able to be used with or not damaged by lubricants; designed to function properly in the presence of lubricants.","examples":[{"sentence":"The seals are made of a lubricant-compatible material to ensure long-term performance.","translation":"シールは長期的な性能を保証するために、潤滑剤適合性のある材料で作られています。"},{"sentence":"Choose a lubricant-compatible adhesive for bonding these components.","translation":"これらの部品を接合するには、潤滑剤適合性のある接着剤を選択してください。"},{"sentence":"The O-rings are lubricant-compatible, preventing swelling or degradation when exposed to oil.","translation":"Oリングは潤滑剤適合性があり、オイルにさらされても膨張や劣化を防ぎます。"}],"collocations":["lubricant-compatible material","lubricant-compatible adhesive","lubricant-compatible O-ring","lubricant-compatible grease","lubricant-compatible plastic"],"synonyms":["oil-resistant","grease-resistant","chemically compatible with lubricants"],"antonyms":["lubricant-incompatible","oil-sensitive","grease-sensitive"]}],"etymology":{"value":"The word is a compound of 'lubricant' (a substance used to reduce friction), and 'compatible' (able to exist or occur together without conflict).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈluːbrɪkənt kəmˈpætɪbəl/","syllables":"lu-bri-cant com-pat-i-ble"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Lubricant-compatible' is a technical term used to describe materials or components that are designed to withstand exposure to lubricants without degrading or losing their functionality. It is commonly used in engineering, manufacturing, and automotive industries.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ This plastic is not compatible with lubricant.","correct":"✓ This plastic is not lubricant-compatible. / ✓ This plastic is not compatible with lubricants.","note":"The adjective 'lubricant-compatible' directly describes the material. Alternatively, use 'compatible with lubricants' to express the same meaning."}],"priority":"☆☆☆"},"related_words":{"derivatives":["compatibility (noun)","lubricant (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Lubricant-compatible' is a specialized term used in technical contexts, particularly in engineering and manufacturing. It describes the ability of a material or component to function properly when exposed to lubricants, without undergoing degradation or failure. Understanding this term requires familiarity with technical vocabulary and concepts related to material science and engineering."},"example_sentences":[{"sentence":"Ensure that the rubber seals are made of a **lubricant-compatible** material to prevent premature failure.","translation":"ゴムシールが早期の故障を防ぐために、潤滑剤適合性のある材料で作られていることを確認してください。","type":"adjective","meaning_category":"潤滑剤適合性"},{"sentence":"This **lubricant-compatible** grease is designed for use in high-temperature applications.","translation":"この潤滑剤適合性グリースは、高温用途向けに設計されています。","type":"adjective","meaning_category":"潤滑剤適合性"},{"sentence":"The manufacturer recommends using only **lubricant-compatible** cleaning solutions on this equipment.","translation":"製造元は、この機器には潤滑剤適合性のある洗浄液のみを使用することを推奨しています。","type":"adjective","meaning_category":"潤滑剤適合性"}]}