{"word":"demand-curbing","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"需要抑制の、需要を抑制する","english_definition":"Designed or intended to reduce or limit demand, especially for energy or resources.","examples":[{"sentence":"The city implemented several demand-curbing measures to reduce water consumption during the drought.","translation":"その都市は干ばつ期間中の水の消費量を減らすために、いくつかの需要抑制策を実施した。"},{"sentence":"Demand-curbing strategies are essential for achieving sustainable energy consumption.","translation":"需要抑制戦略は、持続可能なエネルギー消費を達成するために不可欠である。"}],"collocations":["demand-curbing measures (需要抑制策)","demand-curbing policies (需要抑制政策)","demand-curbing strategies (需要抑制戦略)","demand-curbing effect (需要抑制効果)"],"synonyms":["demand-reducing","demand-limiting","consumption-reducing"],"antonyms":["demand-increasing","demand-stimulating"],"notes":"Often used in the context of energy, water, or resource management."}],"etymology":{"value":"Composed of 'demand' (the need or desire for a product or service) and 'curbing' (restricting or controlling).","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈmændˌkɜːrbɪŋ/","syllables":"de-mand-curb-ing"},"inflection":{"notes":"This is an adjective, so it does not have typical inflectional forms."},"usage_notes":{"explanation":"The term 'demand-curbing' is typically used in discussions related to resource management, economics, and environmental policy. It refers to efforts aimed at reducing the amount of a particular resource or product that is consumed or requested. These efforts can include policy changes, technological innovations, or behavioral interventions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The demand-curbing is important.","correct":"✓ Demand-curbing measures are important.","note":"'Demand-curbing' is an adjective and needs to be followed by a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["demand (noun, verb)","curb (noun, verb)"],"related_terms":["demand management","energy conservation","water conservation","resource management"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency. Specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'demand-curbing' is a specialized term often used in the context of economics, environmental science, and public policy. It describes strategies or measures designed to reduce the consumption or demand for a particular resource, such as water or energy. Because it is a compound adjective, understanding the individual words ('demand' and 'curbing') is helpful in grasping the overall meaning. The term is more likely to be encountered in academic or professional settings rather than in everyday conversation."},"example_sentences":[{"sentence":"The government introduced demand-curbing regulations to address the energy crisis.","translation":"政府はエネルギー危機に対処するために、需要抑制規制を導入した。","type":"adjective","meaning_category":"需要抑制の"},{"sentence":"Smart meters can play a significant role in demand-curbing efforts by providing real-time feedback on energy usage.","translation":"スマートメーターは、エネルギー使用量に関するリアルタイムのフィードバックを提供することにより、需要抑制の取り組みにおいて重要な役割を果たすことができる。","type":"adjective","meaning_category":"需要抑制の"}]}