{"word":"exolingually","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"外国語を用いて、または外国語学習を通じて","english_definition":"Using a foreign language; or through foreign language learning.","examples":[{"sentence":"The students communicated exolingually during the international exchange program.","translation":"学生たちは国際交流プログラムの間、外国語を用いてコミュニケーションをとった。"},{"sentence":"She acquired new cultural insights exolingually by reading literature in the original language.","translation":"彼女は原語で文学を読むことによって、外国語学習を通して新たな文化的洞察を得た。"}],"collocations":["communicate exolingually","learn exolingually","acquire exolingually"],"synonyms":["through a foreign language","via a second language"],"antonyms":["endolingually (using a native language)"]}],"etymology":{"value":"Derived from 'exolingual', which combines 'exo-' (meaning 'outside' or 'foreign') and 'lingual' (relating to language).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛksoʊˈlɪŋɡwəli/","syllables":"ex-o-lin-gual-ly"},"inflection":{"notes":"This is an adverb, so it does not have different forms."},"usage_notes":{"explanation":"'Exolingually' describes actions or processes that occur through the use or learning of a foreign language. It emphasizes the role of a non-native language in communication, learning, or cultural exchange. It is often used in the context of language acquisition, intercultural communication, and translation studies.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He learned the culture exolinguistically.","correct":"✓ He learned about the culture exolingually.","note":"'Exolingually' describes the means of learning (through a foreign language), not the direct object of learning. Use 'about' to specify the topic being learned."}],"priority":"★★☆"},"related_words":{"derivatives":["exolingual (adjective)","exolinguistics (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Exolingually' is a specialized term primarily used in academic contexts, particularly in fields like linguistics, language acquisition, and intercultural communication. It describes processes or actions that occur through the use or learning of a foreign language. Due to its specific and technical nature, it is not commonly encountered in everyday language. Understanding requires familiarity with linguistic terminology and concepts. "},"example_sentences":[{"sentence":"The research investigated how learners develop pragmatic competence exolingually.","translation":"その研究は、学習者がどのように外国語学習を通して語用論的能力を発達させるかを調査した。","type":"adverb","meaning_category":"foreign language learning"},{"sentence":"In multilingual classrooms, students often need to negotiate meaning exolingually.","translation":"多言語教室では、学生はしばしば外国語を用いて意味を交渉する必要がある。","type":"adverb","meaning_category":"using a foreign language"}]}