{"word":"girdlingly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"取り囲むように、輪状に","english_definition":"In a manner that encircles or surrounds.","examples":[{"sentence":"The ivy grew girdlingly around the old oak tree.","translation":"ツタは古い樫の木の周りを輪状に取り囲むように成長した。"},{"sentence":"The fog settled girdlingly around the mountain peak.","translation":"霧は山の頂上を取り囲むように立ち込めた。"}],"collocations":["grow girdlingly","settle girdlingly"],"synonyms":["encirclingly","surroundingly","encompassingly"],"antonyms":["unrestrictedly","freely"]}],"etymology":{"value":"Derived from the verb 'girdle,' meaning to encircle or surround, with the addition of the adverbial suffix '-ingly.'","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡɜːrdlɪŋli/","syllables":"gir-dling-ly"},"inflection":{"notes":"This is an adverb, so it does not inflect."},"usage_notes":{"explanation":"'Girdlingly' describes an action or manner of encircling something. It is not a commonly used word, but it is precise in describing something that grows or spreads in a circular fashion around an object.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rope was girdling around the box.","correct":"✓ The rope was girdled around the box.","note":"'Girdling' is an adverb, not a verb. Use 'girdled' as the past participle of the verb 'girdle' to describe the state of being encircled."}],"priority":"★☆☆"},"related_words":{"derivatives":["girdle (noun, verb)","girdling (adjective, present participle)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Girdlingly' is a rare and sophisticated adverb that describes something encircling or surrounding something else. It is most likely to be encountered in descriptive writing, particularly in nature writing or in contexts where precise spatial relationships are important. Because of its rarity, it is unlikely to be understood by non-native speakers or those with limited vocabulary. It is best used when a more common adverb like 'around' or 'encirclingly' does not provide sufficient precision or nuance."},"example_sentences":[{"sentence":"The morning mist clung girdlingly to the valley floor.","translation":"朝霧は谷底を輪状に取り囲むようにまとわりついた。","type":"descriptive","meaning_category":"encircling"},{"sentence":"The climbing rose twined girdlingly around the garden arch.","translation":"つるバラは庭のアーチを輪状に絡み付いた。","type":"descriptive","meaning_category":"encircling"}]}