{"word":"paganizer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"One who converts others to paganism or incorporates pagan elements into a system of belief.","english_definition":"A person who converts others to paganism or introduces pagan elements into something.","examples":[{"sentence":"The historical figure was seen as a paganizer by the early church for his tolerance of non-Christian beliefs.","translation":"その歴史上の人物は、キリスト教以外の信仰に対する寛容さから、初期の教会によって異教徒化者と見なされた。"},{"sentence":"Some critics accused the author of being a paganizer for including mythological themes in his work.","translation":"一部の批評家は、著者が作品に神話的なテーマを含めたことを理由に、彼を異教徒化者であると非難した。"}],"collocations":["convert to paganism","introduce pagan elements","religious syncretism"],"synonyms":["paganist","idolater","heathenizer"],"antonyms":["Christianizer","evangelist","missionary"]}],"etymology":{"value":"Derived from 'pagan' (one who is not Christian, Muslim, or Jewish) and the suffix '-izer' (one who performs a specified action).","priority":"★★★"},"pronunciation":{"ipa":"ˈpeɪɡənaɪzər","syllables":"pay-guh-nize-er"},"inflection":{"noun_plural":"paganizers"},"usage_notes":{"explanation":"The term 'paganizer' is often used in a historical or critical context to describe someone who promotes or integrates pagan beliefs and practices. It can be used neutrally or pejoratively depending on the context and the speaker's viewpoint.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a paganizer because he is pagan.","correct":"✓ He is a pagan because he practices paganism. / He is a paganizer because he tries to convert others to paganism.","note":"Being a pagan doesn't automatically make someone a 'paganizer.' A paganizer actively tries to convert others or incorporate pagan elements."}],"priority":"★☆☆"},"related_words":{"derivatives":["paganize (verb)","paganization (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Rare","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'paganizer' is a relatively uncommon term used to describe someone who converts or influences others towards pagan beliefs or incorporates pagan elements into other systems. It is often found in historical or religious discussions. The term implies an active role in promoting paganism rather than simply being a pagan oneself."},"example_sentences":[{"sentence":"The Roman emperor Julian was considered a paganizer due to his efforts to revive traditional Roman religion.","translation":"ローマ皇帝ユリアヌスは、伝統的なローマ宗教を復興させようとしたため、異教徒化者と見なされた。","type":"noun","meaning_category":"One who converts to paganism"},{"sentence":"Critics accused the artist of being a paganizer for incorporating elements of nature worship into his paintings.","translation":"批評家たちは、その芸術家が自然崇拝の要素を絵画に取り入れたことを理由に、彼を異教徒化者であると非難した。","type":"noun","meaning_category":"One who introduces pagan elements"}]}