{"word":"symphysiotomy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"恥骨結合離開術（恥骨結合を切開して骨盤を広げる外科手術。難産の際に胎児を娩出するために行われたが、現代ではほとんど行われない）","english_definition":"A surgical procedure in which the cartilage of the pubic symphysis is divided to widen the pelvis, allowing childbirth when there is a mechanical obstruction.","examples":[{"sentence":"Symphysiotomy was once used to facilitate childbirth in cases of obstructed labor.","translation":"恥骨結合離開術は、かつて分娩障害の場合に分娩を容易にするために用いられていた。"},{"sentence":"Due to ethical concerns and advancements in obstetrics, symphysiotomy is now rarely performed.","translation":"倫理的な懸念と産科学の進歩により、恥骨結合離開術は現在ではほとんど行われない。"}],"collocations":["perform a symphysiotomy","undergo symphysiotomy","historical use of symphysiotomy"],"synonyms":["pelviotomy","pubiotomy"],"antonyms":[]},{"part_of_speech":"noun","definition":"(歴史的に) 難産に対する代替手段として行われた外科手術","english_definition":"(Historically) A surgical alternative to cesarean section performed in cases of obstructed labor, particularly when resources for cesarean section were limited.","examples":[{"sentence":"In some regions with limited access to healthcare, symphysiotomy was used as a last resort.","translation":"医療へのアクセスが限られた地域では、恥骨結合離開術が最後の手段として用いられた。"},{"sentence":"The procedure was often controversial due to its potential complications and lack of proper pain management.","translation":"この手術は、潜在的な合併症や適切な疼痛管理の欠如から、しばしば議論の的となった。"}],"collocations":["alternative to cesarean section","historical obstetrical practice","ethical considerations of symphysiotomy"],"synonyms":["historical childbirth procedure"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'symphysis' (a growing together) and 'tomē' (a cutting).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɪmfɪziˈɒtəmi/","syllables":"sim-phy-si-ot-o-my"},"inflection":{"noun_plural":"symphysiotomies"},"usage_notes":{"explanation":"Symphysiotomy is a rarely performed surgical procedure with a controversial history. It is important to note that this procedure is distinct from a cesarean section and is generally only discussed in historical or ethical contexts. Modern obstetrical practices favor cesarean sections due to their improved safety profile.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Symphysiotomy is a common procedure today.","correct":"✓ Symphysiotomy is a rarely performed procedure today.","note":"Symphysiotomy is not a common procedure in modern obstetrics."},{"incorrect":"✗ Symphysiotomy is the same as a C-section.","correct":"✓ Symphysiotomy is different from a C-section.","note":"Symphysiotomy involves cutting the pubic symphysis, while a C-section involves surgically delivering the baby through the abdomen and uterus."}],"priority":"★★☆"},"related_words":{"derivatives":["symphysis","otomy","pelviotomy","pubiotomy"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Specialized medical term)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Symphysiotomy' is a highly specialized medical term referring to a surgical procedure that is rarely performed in modern obstetrics. It involves cutting the cartilage of the pubic symphysis to widen the pelvis for childbirth. Understanding this term requires a background in medical terminology and an awareness of historical obstetrical practices. The procedure is often discussed in the context of medical ethics and historical alternatives to cesarean sections."},"example_sentences":[{"sentence":"Symphysiotomy was historically performed when cesarean sections were not readily available.","translation":"恥骨結合離開術は、歴史的に帝王切開が容易に利用できなかった場合に実施された。","type":"noun","meaning_category":"surgical procedure"},{"sentence":"The ethics of symphysiotomy have been widely debated due to concerns about patient consent and safety.","translation":"恥骨結合離開術の倫理は、患者の同意と安全性に関する懸念から広く議論されてきた。","type":"noun","meaning_category":"surgical procedure"}]}