{"word":"unembezzled","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"横領されていない、着服されていない","english_definition":"Not embezzled; (of funds or assets) not misappropriated or stolen.","examples":[{"sentence":"The audit confirmed that all funds were unembezzled.","translation":"監査により、すべての資金が横領されていないことが確認されました。"},{"sentence":"We are pleased to report that the company's assets remain unembezzled.","translation":"会社の資産が横領されていないことをご報告いたします。"}],"collocations":["unembezzled funds","unembezzled assets","remain unembezzled"],"synonyms":["unmisappropriated","unpilfered","unthieved","undefalcated"],"antonyms":["embezzled","misappropriated","stolen","defalcated"]}],"etymology":{"value":"prefix 'un-' (not) + 'embezzled' (past participle of 'embezzle').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnɪmˈbɛzəld/","syllables":"un-em-bez-zled"},"inflection":{"notes":"This is an adjective and does not have typical inflectional forms."},"usage_notes":{"explanation":"'Unembezzled' is a relatively rare and formal word, primarily used in legal, financial, or auditing contexts. It indicates that funds or assets have not been subjected to embezzlement, meaning they have not been fraudulently appropriated or stolen. The word is often used in reports or statements to provide assurance that funds are accounted for properly.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unembezzled money was used to buy new equipment.","correct":"✓ The money, which was unembezzled, was used to buy new equipment. / ✓ The funds were confirmed to be unembezzled and were used to buy new equipment.","note":"It's more common to state that funds are 'unembezzled' as a confirmation after an audit or investigation, rather than as a direct descriptor before their use. The phrasing should emphasize the verification of the funds' status."}],"priority":"★☆☆"},"related_words":{"derivatives":["embezzle (verb): to steal or misappropriate funds.","embezzlement (noun): the act of stealing or misappropriating funds.","un- (prefix): not."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unembezzled' is a formal and uncommon term primarily used in legal or financial contexts. It describes funds or assets that have not been misappropriated or stolen through embezzlement. Due to its specialized usage and the relative infrequency of the term, it is considered a high-level vocabulary word. Understanding the term requires familiarity with the concept of embezzlement and the function of the prefix 'un-' to negate the meaning of the base word."},"example_sentences":[{"sentence":"The independent audit verified that all the pension funds remained unembezzled.","translation":"独立監査により、すべての年金基金が横領されていないことが確認されました。","type":"adjective","meaning_category":"not embezzled"},{"sentence":"The report certified that the company's assets were fully accounted for and unembezzled.","translation":"報告書は、会社の資産が完全に説明され、横領されていないことを証明しました。","type":"adjective","meaning_category":"not embezzled"}]}