{"word":"untartarized","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Not treated with tartaric acid or tartrates; not subjected to a process to remove or reduce tartrates.","english_definition":"Describing a substance, especially wine, that has not undergone tartrate stabilization.","examples":[{"sentence":"This wine is untartarized, so some crystal formation may occur at low temperatures.","translation":"このワインは酒石酸安定化処理を行っていないため、低温で結晶が生成される可能性があります。"}],"collocations":["untartarized wine","untartarized beer"],"synonyms":["unfiltered","unprocessed"],"antonyms":["tartarized","stabilized"]},{"part_of_speech":"adjective","definition":"(Figuratively) In a natural or unaltered state; not refined or processed.","english_definition":"(Figuratively) In a natural or unaltered state; not refined or processed.","examples":[{"sentence":"His untartarized opinions were refreshing in the polished world of politics.","translation":"彼の自然な意見は、洗練された政界では新鮮だった。"}],"collocations":["untartarized opinions","untartarized views"],"synonyms":["unrefined","unprocessed","natural","raw"],"antonyms":["refined","processed"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to 'tartarized,' which means treated with tartaric acid or tartrates.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈtɑːrtəraɪzd/","syllables":"un-tar-tar-ized"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Untartarized' primarily refers to wine or other beverages that have not been stabilized to prevent the formation of tartrate crystals. Figuratively, it can describe something that is in its natural, unrefined state.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The untartarized juice tasted better because it had more sugar.","correct":"✓ The untartarized juice tasted more natural.","note":"Untartarized does not directly relate to sugar content but to the presence of tartrates and the lack of stabilization. The correct usage focuses on the natural or unprocessed state."}],"priority":"★☆☆"},"related_words":{"derivatives":["tartarize","tartarization","tartrate"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Very specialized vocabulary)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Untartarized' is a highly specialized term primarily used in the context of winemaking and brewing. It describes a product that has not undergone a process to remove or stabilize tartrates, which are naturally occurring crystalline deposits. Understanding this term requires familiarity with wine production processes. Figurative use is rare but implies a natural, unprocessed state."},"example_sentences":[{"sentence":"The winemaker chose to release an untartarized Riesling to showcase its natural character.","translation":"そのワインメーカーは、自然な特性を表現するために、酒石酸安定化処理を行っていないリースリングをリリースすることを選んだ。","type":"adjective","meaning_category":"Wine production"},{"sentence":"His untartarized approach to problem-solving often led to innovative solutions.","translation":"彼の自然な問題解決へのアプローチは、しばしば革新的な解決策につながった。","type":"adjective","meaning_category":"Figurative"}]}