{"word":"vowel-rhyming","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"母音韻、母音脚韻：単語の最後の強調された母音とその後の音（もしあれば）が一致する韻。","english_definition":"A type of rhyme in which the last stressed vowel and all subsequent sounds (if any) are identical in two or more words.","examples":[{"sentence":"'Hat' and 'cat' are examples of vowel-rhyming words.","translation":"「Hat」と「cat」は母音韻の例です。"},{"sentence":"Vowel-rhyming is a common technique in poetry and songwriting.","translation":"母音韻は詩や作詞でよく使われる技法です。"}],"collocations":["perfect rhyme","slant rhyme","eye rhyme","identical rhyme"],"synonyms":["perfect rhyme","true rhyme","full rhyme"],"antonyms":["consonant rhyme","half rhyme"]}],"etymology":{"value":"The term 'vowel-rhyming' is derived from the combination of 'vowel' (a speech sound made with the vocal tract open) and 'rhyming' (having or ending with an identical or corresponding sound).","priority":"★★★"},"pronunciation":{"ipa":"/ˈvaʊəlˌraɪmɪŋ/","syllables":"vow-el-rhym-ing"},"inflection":{"notes":"This is a noun, so it does not inflect like a verb or adjective."},"usage_notes":{"explanation":"Vowel-rhyming is a specific type of rhyme that focuses on the matching of vowel sounds, along with any following consonant sounds, in the stressed syllables of words. It is often considered a 'perfect' or 'true' rhyme.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Using only the vowel sound without considering the following consonants is vowel-rhyming.","correct":"Vowel-rhyming requires matching both the vowel sound and any subsequent consonant sounds.","note":"It's important to match both the vowel and any following consonants for it to be considered vowel-rhyming."}],"priority":"★★☆"},"related_words":{"derivatives":["rhyme","vowel","consonant","syllable"],"phrases":["rhyme scheme","end rhyme","internal rhyme"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency. This is a technical term related to linguistics and poetry.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Vowel-rhyming' is a term used in the study of poetry and linguistics. It refers to a type of rhyme where the stressed vowel sound and any following consonant sounds are the same in two or more words. For example, 'cat' and 'hat' are vowel rhymes because the 'a' sound and the 't' sound match. Understanding this term requires some familiarity with linguistic concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The poet used vowel-rhyming to create a sense of harmony in the verse.","translation":"詩人は母音韻を使って詩にハーモニーの感覚を生み出した。","type":"general","meaning_category":"general"},{"sentence":"An example of vowel-rhyming is found in the words 'bright' and 'light'.","translation":"母音韻の例は、「bright」と「light」という単語に見られる。","type":"example","meaning_category":"example"}]}