{"word":"cross-denominationally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"宗派を超えて、宗派間の協力によって","english_definition":"In a way that involves or transcends different religious denominations; through cooperation between different religious denominations.","examples":[{"sentence":"The charity operates cross-denominationally, providing aid to people of all faiths.","translation":"その慈善団体は宗派を超えて活動し、あらゆる信仰の人々に援助を提供している。"},{"sentence":"The project was a cross-denominational effort, bringing together volunteers from various churches.","translation":"そのプロジェクトは宗派間の協力によるもので、様々な教会のボランティアが集まった。"}],"collocations":["work cross-denominationally (宗派を超えて働く)","operate cross-denominationally (宗派を超えて活動する)","collaborate cross-denominationally (宗派を超えて協力する)","support cross-denominationally (宗派を超えて支援する)"],"synonyms":["interdenominationally","ecumenically","non-denominationally"],"antonyms":["denominationally","sectarianly"]}],"etymology":{"value":"「cross-」(～を横断する、～を超える) + 「denominational」(宗派の) + 「-ly」(副詞語尾)。異なる宗派間の境界を越えて、協力や活動が行われることを示す。","priority":"★★★"},"pronunciation":{"ipa":"/ˌkrɒs.dɪˌnɒm.ɪˈneɪ.ʃən.əl.i/","syllables":"cross-di-nom-i-na-tion-al-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Cross-denominationally' describes activities or efforts that involve multiple religious denominations working together or that are not limited to a single denomination. It emphasizes inclusivity and cooperation across different religious groups. It is often used in the context of charitable work, community projects, or religious dialogue.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The church is cross-denomination.","correct":"✓ The church works cross-denominationally.","note":"'Cross-denomination' is not typically used as an adjective. Use 'cross-denominational' as an adjective, or 'cross-denominationally' as an adverb to describe how something is done."}],"priority":"★★☆"},"related_words":{"derivatives":["cross-denominational (adjective: 宗派を超えた)","denomination (noun: 宗派)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'cross-denominationally' is a relatively advanced term used to describe activities or collaborations that span across different religious denominations. It implies a sense of inclusivity and cooperation between various religious groups, setting aside specific denominational differences for a common goal or purpose. Due to its specific and somewhat formal usage, it is more likely to be encountered in academic, religious, or organizational contexts rather than in everyday conversation."},"example_sentences":[{"sentence":"The relief effort was organized cross-denominationally to ensure aid reached all those in need, regardless of their religious background.","translation":"救援活動は、宗教的背景に関わらず、支援を必要とするすべての人々に確実に届けるために、宗派を超えて組織された。","type":"adverb","meaning_category":"宗派を超えて"},{"sentence":"The interfaith council promotes understanding and cooperation by working cross-denominationally on various community projects.","translation":"異宗派間協議会は、様々な地域社会プロジェクトに宗派を超えて取り組むことで、理解と協力を促進している。","type":"adverb","meaning_category":"宗派間の協力によって"}]}