{"word":"immunocompetent","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"免疫能を有する、免疫応答ができる","english_definition":"Having a normal immune system capable of responding effectively to antigens.","examples":[{"sentence":"An immunocompetent individual is able to fight off infections effectively.","translation":"免疫能を有する人は、感染症に対して効果的に抵抗することができます。"},{"sentence":"The patient was immunocompetent and responded well to the treatment.","translation":"その患者は免疫能を有しており、治療によく反応しました。"},{"sentence":"Immunocompetent cells are essential for adaptive immunity.","translation":"免疫能を有する細胞は、適応免疫に不可欠です。"}],"collocations":["immunocompetent host","immunocompetent cells","immunocompetent patient","become immunocompetent","remain immunocompetent"],"synonyms":["immunologically competent","immunologically responsive","immune-capable"],"antonyms":["immunocompromised","immunodeficient","immunosuppressed"]}],"etymology":{"value":"Derived from 'immuno-' (relating to immunity) + 'competent' (having the necessary ability or qualities).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪmjunoʊˈkɒmpɪtənt/","syllables":"im-mu-no-com-pe-tent"},"inflection":{"notes":"This word does not have different inflections."},"usage_notes":{"explanation":"'Immunocompetent' describes the state of having a healthy and functioning immune system. It is often used in medical contexts to describe patients who are able to mount an effective immune response. The term is important in distinguishing individuals who can naturally fight off infections from those who are immunocompromised and more susceptible to infections.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The immunocompetent patient needs to avoid crowds.","correct":"✓ The immunocompromised patient needs to avoid crowds.","note":"Immunocompetent patients generally do not need to avoid crowds unless there is another underlying condition. Immunocompromised patients, on the other hand, have weakened immune systems and need to take extra precautions."},{"incorrect":"✗ Immunocompetent is a noun.","correct":"✓ Immunocompetent is an adjective.","note":"'Immunocompetent' describes a state or condition and is therefore an adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["immunocompetence (noun)"],"related_terms":["immune system","immunity","antigen","immune response","immunocompromised","immunodeficiency","immunosuppression"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively infrequent, primarily used in medical and scientific contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'immunocompetent' is a specialized term used in medical and biological contexts. It describes the state of having a normal, functioning immune system capable of effectively responding to foreign substances (antigens). Understanding this term requires some background knowledge in immunology. It's the opposite of 'immunocompromised,' which describes a weakened immune system."},"example_sentences":[{"sentence":"The immunocompetent host cleared the virus without any medical intervention.","translation":"免疫能を有する宿主は、医学的介入なしにウイルスを排除しました。","type":"general","meaning_category":"general"},{"sentence":"Testing for immunocompetence is crucial in evaluating patients before organ transplantation.","translation":"臓器移植前の患者を評価する上で、免疫能の検査は非常に重要です。","type":"medical","meaning_category":"medical"},{"sentence":"Even immunocompetent individuals can experience severe symptoms from certain infections.","translation":"免疫能を有する人でさえ、特定の感染症から重篤な症状を経験することがあります。","type":"general","meaning_category":"general"}]}