{"word":"unvolatilized","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"揮発しない、不揮発性の","english_definition":"Not volatilized; not readily evaporated at normal temperatures.","examples":[{"sentence":"The unvolatilized residue remained after heating the sample.","translation":"サンプルを加熱した後、不揮発性の残留物が残った。"},{"sentence":"Unvolatilized organic compounds can persist in the environment for extended periods.","translation":"不揮発性の有機化合物は、環境中に長期間残留することがある。"}],"collocations":["unvolatilized residue","unvolatilized organic compounds"],"synonyms":["non-volatile","stable","fixed"],"antonyms":["volatile","evaporative","unstable"]}],"etymology":{"value":"Derived from 'volatilized' (past participle of 'volatilize'), with the addition of the prefix 'un-' indicating negation. 'Volatilize' comes from 'volatile', which originates from the Latin word 'volatilis', meaning 'able to fly' or 'flying', referring to the tendency of a substance to evaporate quickly like a bird taking flight.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈvɒlətəˌlaɪzd/","syllables":"un-vol-a-til-ized"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It can also be used in comparative and superlative forms, though these are less common (more unvolatilized, most unvolatilized)."},"usage_notes":{"explanation":"'Unvolatilized' is primarily used in scientific and technical contexts, particularly in chemistry, environmental science, and engineering. It describes substances that do not easily evaporate or change into a gaseous state under normal conditions. The term is often used to differentiate between substances that evaporate readily and those that remain in a liquid or solid state.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unvolatilized liquid quickly disappeared.","correct":"✓ The volatile liquid quickly disappeared.","note":"'Unvolatilized' means it *doesn't* easily evaporate. If it quickly disappeared, it was likely volatile."},{"incorrect":"✗ The unvolatilized gas was released into the atmosphere.","correct":"✓ The gas was released into the atmosphere. / ✓ The unvolatilized liquid/solid was heated until it became a gas and was released into the atmosphere.","note":"Gases are, by definition, already in a gaseous state. Something 'unvolatilized' would typically be a liquid or solid that *could* become a gas, but isn't easily."}],"priority":"★★☆"},"related_words":{"derivatives":["volatilize (verb)","volatilization (noun)","volatile (adjective)","non-volatile (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - primarily used in technical and scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unvolatilized' is a technical term used to describe substances that do not easily evaporate or turn into a gas at normal temperatures. It's the opposite of 'volatile,' which describes substances that do evaporate easily. You'll typically find this word in scientific or technical writing, especially in fields like chemistry or environmental science, when discussing the behavior of different materials. Understanding this word requires a good grasp of scientific concepts related to evaporation and the properties of different substances.","priority":"★★☆"},"example_sentences":[{"sentence":"The analysis focused on the unvolatilized components of the sample.","translation":"分析は、サンプル中の不揮発性成分に焦点を当てた。","type":"adjective","meaning_category":"describing a substance that does not easily evaporate"},{"sentence":"The unvolatilized oil created a persistent stain on the fabric.","translation":"不揮発性の油は、布地に落ちにくいシミを作った。","type":"adjective","meaning_category":"describing a substance that does not easily evaporate"},{"sentence":"The experiment aimed to separate the volatile from the unvolatilized compounds.","translation":"その実験の目的は、揮発性化合物と不揮発性化合物を分離することだった。","type":"adjective","meaning_category":"describing a substance that does not easily evaporate"}]}