{"word":"insensibility","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"無感覚、知覚麻痺、意識不明","english_definition":"The state of being without feeling or sensation; lack of physical or emotional feeling; unconsciousness.","examples":[{"sentence":"The patient was in a state of complete insensibility after the accident.","translation":"患者は事故後、完全に意識不明の状態だった。"},{"sentence":"The cold caused insensibility in her fingers.","translation":"寒さで彼女の指は感覚を失った。"},{"sentence":"He showed an insensibility to the suffering of others.","translation":"彼は他者の苦しみに対して無感覚だった。"}],"collocations":["complete insensibility (完全な無感覚)","physical insensibility (身体的な無感覚)","emotional insensibility (感情的な無感覚)","fall into insensibility (意識不明に陥る)"],"synonyms":["unconsciousness","numbness","apathy","indifference","torpor","stupor"],"antonyms":["consciousness","sensitivity","awareness","feeling"]}],"etymology":{"value":"Late Middle English: from Old French, from late Latin insensibilitas, from Latin insensibilis 'imperceptible' (see insensible).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˌsɛnsəˈbɪləti/","syllables":"in-sen-si-bil-i-ty"},"inflection":{"noun_plural":"insensibilities (稀に、感受性の欠如の複数の形態を指す場合)"},"usage_notes":{"explanation":"\"Insensibility\" refers to a lack of feeling or awareness. It can describe a physical state, such as numbness caused by cold or injury, or a mental or emotional state, such as indifference to the feelings of others. It can also refer to unconsciousness. The word implies a lack of responsiveness to stimuli.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed insensibility for the poor.","correct":"✓ He showed insensibility to the poor.","note":"The correct preposition to use with \"insensibility\" when referring to a lack of feeling towards something is \"to.\""},{"incorrect":"✗ She had a insensibility in her leg.","correct":"✓ She had insensibility in her leg. / ✓ She had a lack of sensation in her leg.","note":"\"Insensibility\" is an uncountable noun in this context, so it doesn't usually take the indefinite article \"a.\" If you want to use an article, rephrase the sentence."}],"priority":"★★☆"},"related_words":{"derivatives":["insensible (adjective: 無感覚の、意識のない、無神経な)","insensibly (adverb: 無感覚に、気づかないうちに)"],"antonyms":["sensibility (noun: 感受性、感じやすさ)","sensitive (adjective: 敏感な、感じやすい)"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - フォーマルな文脈や専門的な議論で使われることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Insensibility\" is a formal word that means a lack of physical or emotional feeling, or a state of being unconscious. It's used to describe someone who can't feel pain, or someone who doesn't seem to care about the feelings of others. It's also used in medical contexts to describe a state of unconsciousness. Because it's a more advanced word, it's not used as often as simpler words like \"numbness\" or \"unconsciousness.\""},"example_sentences":[{"sentence":"The drug induced a state of insensibility.","translation":"その薬は無感覚の状態を引き起こした。","type":"noun","meaning_category":"無感覚、知覚麻痺"},{"sentence":"His insensibility to criticism made him difficult to work with.","translation":"彼は批判に対して無感覚だったので、一緒に仕事をするのが難しかった。","type":"noun","meaning_category":"感情の欠如"},{"sentence":"The doctor checked for any signs of insensibility in the patient's limbs.","translation":"医師は患者の四肢に無感覚の兆候がないか確認した。","type":"noun","meaning_category":"知覚麻痺"},{"sentence":"After the shock, she felt a strange insensibility.","translation":"ショックの後、彼女は奇妙な無感覚を感じた。","type":"noun","meaning_category":"無感覚"}]}