{"word":"adenomatous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"腺腫性の","english_definition":"relating to or resembling an adenoma (a benign tumor of glandular tissue).","examples":[{"sentence":"The patient was diagnosed with an adenomatous polyp in the colon.","translation":"患者は大腸に腺腫性ポリープがあると診断された。"},{"sentence":"Adenomatous changes were observed in the biopsy sample.","translation":"生検サンプルにおいて腺腫性の変化が観察された。"}],"collocations":["adenomatous polyp","adenomatous hyperplasia","adenomatous tissue","adenomatous changes"],"synonyms":["glandular","tumorous"],"antonyms":["normal","healthy"]}],"etymology":{"value":"From 'adenoma' (a benign tumor of glandular origin) + '-ous' (suffix indicating possession or resemblance). 'Adenoma' comes from Greek 'adēn' (gland) + '-oma' (tumor).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌædɪˈnɒmətəs/","syllables":"ad-e-nom-a-tous"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Adenomatous' is primarily used in medical contexts to describe tissues or growths that have characteristics of adenomas. It is often used in pathology reports and discussions about cancer risk, as some adenomatous polyps can become cancerous over time.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The adenomatous was removed during surgery.","correct":"✓ The adenomatous polyp was removed during surgery.","note":"'Adenomatous' is an adjective and needs to modify a noun, such as 'polyp', 'tissue', or 'growth'."},{"incorrect":"✗ The cells were adenoma.","correct":"✓ The cells were adenomatous.","note":"'Adenoma' is a noun, while 'adenomatous' is an adjective. Use the adjective to describe the cells."}],"priority":"★★☆"},"related_words":{"derivatives":["adenoma (noun: a benign tumor of glandular origin)","adenomatosis (noun: a condition characterized by multiple adenomas)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in medical and scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'adenomatous' is a technical term used in medicine, specifically in pathology and oncology. It describes something that is related to or resembles an adenoma, which is a non-cancerous tumor of glandular tissue. Due to its specialized use, it is not commonly encountered outside of medical or scientific contexts."},"example_sentences":[{"sentence":"The colonoscopy revealed several small adenomatous polyps.","translation":"大腸内視鏡検査でいくつかの小さな腺腫性ポリープが発見された。","type":"general","meaning_category":"relating to adenoma"},{"sentence":"Histological examination confirmed the presence of adenomatous tissue in the sample.","translation":"組織学的検査により、サンプル中に腺腫性組織の存在が確認された。","type":"medical","meaning_category":"resembling adenoma"}]}