{"word":"weaponization","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"兵器化、武器化","english_definition":"The act of converting something into a weapon or using it to cause harm.","examples":[{"sentence":"The weaponization of social media is a growing concern.","translation":"ソーシャルメディアの兵器化は、ますます懸念されています。"},{"sentence":"There are ethical concerns about the weaponization of artificial intelligence.","translation":"人工知能の兵器化には倫理的な懸念があります。"},{"sentence":"The weaponization of information can be used to manipulate public opinion.","translation":"情報の兵器化は、世論を操作するために使用される可能性があります。"}],"collocations":["weaponization of space","weaponization of information","weaponization of AI","weaponization of data","weaponization of social media"],"synonyms":["arming","militarization"],"antonyms":["de-escalation","peaceful use"]}],"etymology":{"value":"The word 'weaponization' is formed by combining 'weapon' with the suffix '-ization,' which denotes the process of making something into a specific state or form.","priority":"★★★"},"pronunciation":{"ipa":"/ˌwɛpənɪˈzeɪʃən/","syllables":"wea-pon-i-za-tion"},"inflection":{"noun_plural":"weaponizations"},"usage_notes":{"explanation":"'Weaponization' refers to the process of turning something not originally intended as a weapon into one, or using something in a way that causes harm or is intended to cause harm. This term is often used in discussions about technology, information, and other non-traditional areas where the potential for misuse exists.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The weaponisation of the virus caused a pandemic.","correct":"The weaponization of the virus caused a pandemic.","note":"'Weaponization' is the standard spelling in American English. 'Weaponisation' is the British English spelling."}],"priority":"★★☆"},"related_words":{"derivatives":["weaponize (verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, but increasing in recent years due to discussions about technology and information warfare.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Weaponization' is a term used to describe the process of turning something into a weapon or using it in a harmful way. It often refers to the misuse of technology, information, or other resources that were not originally intended for destructive purposes. Understanding this term is important for discussions about ethics, security, and the potential dangers of technological advancements."},"example_sentences":[{"sentence":"The **weaponization** of drones has raised serious ethical questions.","translation":"ドローンの兵器化は、深刻な倫理的問題を提起しています。","type":"noun","meaning_category":"兵器化"},{"sentence":"The company denied any involvement in the **weaponization** of their technology.","translation":"その会社は、自社の技術の兵器化への関与を否定しました。","type":"noun","meaning_category":"兵器化"},{"sentence":"The report warned about the potential for the **weaponization** of personal data.","translation":"その報告書は、個人データの兵器化の可能性について警告しました。","type":"noun","meaning_category":"兵器化"}]}