{"word":"terminologists","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"用語論者、専門用語研究者","english_definition":"plural of terminologist: a person who studies or specializes in terminology.","examples":[{"sentence":"Terminologists play a crucial role in standardizing language within specific fields.","translation":"用語論者は、特定の分野における言語の標準化において重要な役割を果たします。"},{"sentence":"The terminologists at the conference discussed the challenges of translating technical terms.","translation":"会議の用語論者たちは、専門用語の翻訳における課題について議論しました。"}],"collocations":["work as terminologists","a team of terminologists","conference of terminologists"],"synonyms":["lexicographer","linguist","etymologist"],"antonyms":[]}],"etymology":{"value":"The word \"terminologist\" is derived from \"terminology\" (the body of terms used with a particular technical application in a subject of study, theory, profession, etc.) + \"-ist\" (a suffix denoting a person who practices or is concerned with something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtɜːrmɪˈnɒlədʒɪsts/","syllables":"ter-mi-nol-o-gists"},"inflection":{"noun_plural":"terminologists"},"usage_notes":{"explanation":"\"Terminologists\" refers to multiple individuals who are experts in terminology. They are involved in the study, development, and standardization of terms within specific domains. They often work in fields such as translation, technical writing, and knowledge management.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The terminologist are working on the project.","correct":"✓ The terminologists are working on the project.","note":"Since \"terminologists\" is plural, use the plural form of the verb \"are\"."},{"incorrect":"✗ He is one of the terminologist.","correct":"✓ He is one of the terminologists.","note":"When referring to one person among a group of terminologists, use the plural form \"terminologists\"."}],"priority":"★★☆"},"related_words":{"derivatives":["terminology","terminological"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"terminologists\" is a specialized term used to describe professionals who study and manage terminology, particularly in technical or specialized fields. It is not a commonly used word in everyday conversation but is relevant in academic, technical, and linguistic contexts. Understanding the role of terminologists requires familiarity with concepts related to language standardization and knowledge management."},"example_sentences":[{"sentence":"The team of **terminologists** collaborated to create a comprehensive glossary for the new software.","translation":"用語論者のチームは協力して、新しいソフトウェアのための包括的な用語集を作成しました。","type":"noun","meaning_category":"専門用語研究者"},{"sentence":"**Terminologists** often consult with subject matter experts to ensure the accuracy of definitions.","translation":"用語論者は、定義の正確性を確保するために、しばしば専門分野の専門家と協議します。","type":"noun","meaning_category":"専門用語研究者"}]}