{"word":"Legerities","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"軽率な行為、軽薄さ、浮わついた態度","english_definition":"Instances of frivolous or lighthearted behavior; lack of seriousness; levity.","examples":[{"sentence":"His legerities at the meeting were inappropriate.","translation":"彼の会議での軽率な態度は不適切だった。"},{"sentence":"She was known for her legerities and carefree spirit.","translation":"彼女は軽薄さと気ままな精神で知られていた。"}],"collocations":["display legerities","commit legerities","youthful legerities"],"synonyms":["frivolity","levity","lightheartedness","flippancy","carelessness"],"antonyms":["seriousness","gravity","solemnity","earnestness"]}],"etymology":{"value":"Derived from the word 'legerity,' which comes from the Latin 'levitas,' meaning lightness or frivolity. The suffix '-ities' is added to denote instances or acts of being lighthearted.","priority":"★★☆"},"pronunciation":{"ipa":"/ləˈdʒerɪtiz/","syllables":"le-ger-i-ties"},"inflection":{"noun_plural":"N/A (already plural)"},"usage_notes":{"explanation":"'Legerities' refers to specific instances or acts of being frivolous or lighthearted. It is often used to describe behaviors or attitudes that lack seriousness or are inappropriately carefree, especially in formal or serious contexts. The word emphasizes the occurrence of such behaviors rather than the general quality of being lighthearted.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The legerity of the situation was concerning.","correct":"✓ The legerities displayed in the situation were concerning.","note":"Use 'legerities' to refer to specific instances of lighthearted behavior, not the general quality of a situation."},{"incorrect":"✗ He showed legerity during the serious discussion.","correct":"✓ He showed legerities during the serious discussion.","note":"Use the plural form 'legerities' to indicate multiple instances or acts of frivolity."}],"priority":"★★☆"},"related_words":{"derivatives":["legerity (noun: lightness, frivolity)","levity (noun: lightness of mind, lack of seriousness)","frivolous (adjective: not having any serious purpose or value)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Legerities' is a relatively uncommon word that describes specific instances of lighthearted or frivolous behavior. It is used to point out actions or attitudes that lack seriousness, especially when such behavior is inappropriate or unexpected. The word is more formal and less frequently used than synonyms like 'frivolity' or 'lightheartedness.'"},"example_sentences":[{"sentence":"The politician's legerities during the press conference drew criticism.","translation":"政治家の記者会見での軽率な態度は批判を呼んだ。","type":"noun","meaning_category":"軽率な行為"},{"sentence":"Despite the solemn occasion, some guests displayed regrettable legerities.","translation":"厳粛な機会にもかかわらず、一部のゲストは残念ながら軽率な態度を示した。","type":"noun","meaning_category":"軽薄さ"},{"sentence":"The teacher reprimanded the students for their constant legerities in class.","translation":"教師は生徒たちの授業中の絶え間ない軽率な行為を叱責した。","type":"noun","meaning_category":"浮わついた態度"}]}