{"word":"legitimatable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"正当化できる、合法化できる","english_definition":"Capable of being legitimated or made legitimate.","examples":[{"sentence":"The company's actions, while questionable, were ultimately legitimatable under the existing regulations.","translation":"その会社の行動は疑わしいものの、最終的には既存の規制の下で正当化できるものでした。"},{"sentence":"The government sought to make the new policy legitimatable through public consultation.","translation":"政府は、国民との協議を通じて、新しい政策を正当化できるように努めました。"}],"collocations":["easily legitimatable","hardly legitimatable","potentially legitimatable"],"synonyms":["justifiable","defensible","ratifiable","validatable","sanctionable"],"antonyms":["illegitimate","unjustifiable","indefensible","invalid"],"related_words":["legitimate","legitimation","legitimately","legitimacy"]}],"etymology":{"value":"Derived from 'legitimate' (to make lawful or justifiable) + '-ate' (suffix indicating a verb form) + '-able' (suffix indicating capability).","priority":"★★☆"},"pronunciation":{"ipa":"/lɪˈdʒɪtɪmeɪtəbəl/","syllables":"le-git-i-ma-ta-ble"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Legitimatable' is a relatively uncommon word. It describes something that has the potential to be made legitimate, lawful, or justifiable. It implies a process or action that can be taken to achieve legitimacy. It is often used in contexts related to law, politics, and ethics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The legitimatable government.","correct":"✓ The legitimate government.","note":"Use 'legitimate' to describe a government that is already recognized as lawful. 'Legitimatable' implies the government is in the process of becoming legitimate."},{"incorrect":"✗ The action was legitimatable, so it was already legitimate.","correct":"✓ The action was legitimatable, meaning steps could be taken to make it legitimate.","note":"'Legitimatable' means capable of being made legitimate, not that it is already legitimate."}],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Legitimatable' is a complex word that means something can be made legal, acceptable, or justifiable. It suggests a possibility or potential for something to become legitimate through certain actions or processes. This word is rarely used in everyday conversation and is more common in formal or academic contexts, particularly when discussing law, politics, or ethics."},"example_sentences":[{"sentence":"The proposed changes to the constitution were not easily legitimatable given the strong public opposition.","translation":"憲法改正案は、国民の強い反対があるため、容易に正当化できるものではありませんでした。","type":"adjective","meaning_category":"正当化できる"},{"sentence":"The company needed to find a way to make their business practices legitimatable in the eyes of the consumer.","translation":"会社は、消費者の目に自社のビジネス慣行を正当化できるようにする方法を見つける必要がありました。","type":"adjective","meaning_category":"合法化できる"}]}