{"word":"Iago","priority":"★★☆","meanings":[{"part_of_speech":"proper noun","definition":"イアーゴ：シェイクスピアの戯曲『オセロー』に登場する悪役。オセローの旗手であり、嫉妬と策略によってオセローを破滅に導く。","english_definition":"A character in Shakespeare's play 'Othello'. He is Othello's ensign and the antagonist who uses jealousy and manipulation to bring about Othello's downfall.","examples":[{"sentence":"Iago is one of Shakespeare's most famous villains.","translation":"イアーゴはシェイクスピアの最も有名な悪役の一人です。"},{"sentence":"The character of Iago is known for his cunning and deceit.","translation":"イアーゴというキャラクターは、その狡猾さと欺瞞で知られています。"}],"collocations":["evil Iago","manipulative Iago","Iago's plot","Iago's soliloquy"],"synonyms":["antagonist","villain","schemer","manipulator"],"antonyms":["protagonist","hero"],"notes":"The name 'Iago' is often associated with treachery and deceit."}],"etymology":{"value":"The origin of the name 'Iago' is debated, but it is believed to be a variant of 'Jacob' or 'James'. In Spanish, 'Iago' is a form of 'Santiago', the patron saint of Spain.","priority":"★★☆"},"pronunciation":{"ipa":"/iˈɑːɡoʊ/","syllables":"I-a-go"},"inflection":{},"usage_notes":{"explanation":"'Iago' is primarily known as the name of the villain in Shakespeare's 'Othello'. The character is a master manipulator who uses deception and false accusations to drive Othello to madness and murder. The name itself has become synonymous with evil, treachery, and cunning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Iago is a hero in Othello.","correct":"✓ Iago is a villain in Othello.","note":"Iago is the antagonist, not the hero, in Shakespeare's play."}],"priority":"★★☆"},"related_words":{"derivatives":["Iagoesque (adjective: resembling Iago in cunning or treachery)"],"characters":["Othello","Desdemona","Cassio","Emilia"],"plays":["Othello"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency (primarily associated with Shakespearean studies)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Iago' is a proper noun referring to a specific character in Shakespeare's 'Othello'. Understanding the term requires familiarity with the play and its characters. The name is often used in literary analysis and discussions of dramatic villains. The term may also be used metaphorically to describe someone who is manipulative or treacherous."},"example_sentences":[{"sentence":"The politician was described as an Iago for his ability to manipulate events behind the scenes.","translation":"その政治家は、舞台裏で出来事を操る能力から、イアーゴのようだと評された。","type":"proper noun","meaning_category":"character in Shakespeare's play Othello (metaphorical)"},{"sentence":"In Shakespeare's Othello, Iago's lies lead to tragedy.","translation":"シェイクスピアのオセローでは、イアーゴの嘘が悲劇につながる。","type":"proper noun","meaning_category":"character in Shakespeare's play Othello"},{"sentence":"The Iago-like character in the novel plotted against the protagonist.","translation":"小説の中のイアーゴのようなキャラクターは、主人公に対して陰謀を企てた。","type":"proper noun","meaning_category":"character in Shakespeare's play Othello (metaphorical)"}]}