{"word":"red-figured","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"（古代ギリシアの陶器について）赤像式の","english_definition":"(of ancient Greek pottery) having red figures on a black background.","examples":[{"sentence":"Red-figured pottery was a major style in ancient Greece.","translation":"赤像式陶器は古代ギリシアにおける主要な様式でした。"},{"sentence":"The museum has a large collection of red-figured vases.","translation":"その美術館は赤像式壺の大きなコレクションを持っています。"}],"collocations":["red-figured vase (赤像式壺)","red-figured pottery (赤像式陶器)","red-figured style (赤像式)"],"synonyms":[],"antonyms":["black-figured"]}],"etymology":{"value":"'Red' + 'figured'. Refers to the technique where figures are depicted in red against a black background on ancient Greek pottery. This was achieved by painting the background with a black slip, leaving the figures in the natural red color of the clay.","priority":"★★★"},"pronunciation":{"ipa":"/ˌrɛdˈfɪɡərd/","syllables":"red-fig-ured"},"inflection":{"notes":"Does not inflect; it is an adjective."},"usage_notes":{"explanation":"The term 'red-figured' is almost exclusively used in the context of ancient Greek pottery. It describes a specific style and technique that was prominent from around 520 BC onwards, superseding the earlier black-figured style. The red-figured technique allowed for greater detail and naturalism in the depiction of figures.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The red-figured painting was beautiful.","correct":"✓ The red-figured pottery was beautiful.","note":"The term specifically refers to pottery, not painting in general."}],"priority":"★★☆"},"related_words":{"derivatives":["figure (名詞: 図、像)"],"related_terms":["black-figured (黒像式の)","pottery (陶器)","vase (壺)","ancient Greece (古代ギリシア)","slip (化粧土)"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Specialized term.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Red-figured' is a specialized term used in art history, specifically when discussing ancient Greek pottery. It describes a technique where the figures are left in the natural red color of the clay, while the background is painted black. Understanding this term requires some knowledge of ancient Greek art and culture."},"example_sentences":[{"sentence":"The artist skillfully depicted mythological scenes on the red-figured kylix.","translation":"その芸術家は赤像式のキュリクスに神話の場面を巧みに描いた。","type":"adjective","meaning_category":"赤像式の"},{"sentence":"Scholars study red-figured pottery to learn about ancient Greek life and beliefs.","translation":"学者は古代ギリシアの生活と信仰について学ぶために赤像式陶器を研究する。","type":"adjective","meaning_category":"赤像式の"}]}