{"word":"brightener","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(洗濯用)蛍光増白剤、蛍光染料","english_definition":"A substance, such as a fluorescent dye, added to laundry detergents or other products to make them appear whiter or brighter.","examples":[{"sentence":"This detergent contains optical brighteners to make your clothes look whiter.","translation":"この洗剤には、衣類をより白く見せるための蛍光増白剤が含まれています。"},{"sentence":"Optical brighteners work by absorbing ultraviolet light and re-emitting it as visible blue light.","translation":"蛍光増白剤は、紫外線を吸収し、可視青色光として再放出することで機能します。"}],"collocations":["optical brightener","fluorescent brightener","laundry brightener"],"synonyms":["fluorescent whitening agent","optical whitening agent","whitening agent"],"antonyms":["dulling agent"]},{"part_of_speech":"noun","definition":"(化粧品)ハイライト、肌を明るく見せる化粧品","english_definition":"A cosmetic product used to highlight certain areas of the face, making them appear brighter and more radiant.","examples":[{"sentence":"She used a brightener on her cheekbones to enhance her features.","translation":"彼女は顔立ちを際立たせるために、頬骨にハイライトを使った。"},{"sentence":"This brightener contains light-reflecting particles for a luminous finish.","translation":"このハイライトには、光を反射する粒子が含まれており、輝きのある仕上がりになります。"}],"collocations":["skin brightener","complexion brightener","face brightener"],"synonyms":["highlighter","illuminator"],"antonyms":["contouring powder"]}],"etymology":{"value":"Derived from 'brighten' (to make or become brighter) + '-er' (suffix indicating an agent or substance).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈbraɪtənər/","syllables":"bright-en-er"},"inflection":{"noun_plural":"brighteners"},"usage_notes":{"explanation":"The term 'brightener' typically refers to substances that enhance the perceived brightness or whiteness of materials. In the context of laundry, it refers to optical brighteners or fluorescent dyes. In cosmetics, it refers to products used to highlight and illuminate the skin. The specific meaning depends on the context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used brightener on my clothes to make them colorful.","correct":"✓ I used brightener on my clothes to make them whiter.","note":"Brighteners are used to enhance whiteness, not color."},{"incorrect":"✗ He is a brightener, always making people happy.","correct":"✓ He is a cheerful person, always making people happy.","note":"'Brightener' is not commonly used to describe a person who brings joy. Use 'cheerful person' or similar phrases instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["brighten","brightening"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'brightener' is generally used in two main contexts: laundry and cosmetics. In laundry, it refers to substances that make clothes appear whiter. In cosmetics, it refers to products that highlight and illuminate the skin. Understanding the context is key to interpreting the meaning correctly. It is not a very common word in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The laundry detergent contains a **brightener** to make whites look whiter.","translation":"その洗濯洗剤には、白いものをより白く見せるための蛍光増白剤が含まれています。","type":"noun","meaning_category":"laundry"},{"sentence":"She applied a **brightener** to the inner corners of her eyes to make them look more awake.","translation":"彼女は目をよりぱっちりと見せるために、目頭にハイライトを塗った。","type":"noun","meaning_category":"cosmetics"}]}