{"word":"fine-graded","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"細かく段階分けされた、きめ細かく分類された","english_definition":"Divided into small increments or categories; characterized by a high degree of precision or differentiation.","examples":[{"sentence":"The museum uses a fine-graded system for classifying artifacts by age and origin.","translation":"その博物館は、遺物を年代と起源によって分類するために、きめ細かく段階分けされたシステムを使用している。"},{"sentence":"The software offers fine-graded control over image editing parameters.","translation":"そのソフトウェアは、画像編集パラメータに対するきめ細かい制御を提供する。"},{"sentence":"The teacher provided fine-graded feedback on each student's essay.","translation":"先生は生徒一人ひとりのエッセイに対して、きめ細かいフィードバックを提供した。"}],"collocations":["fine-graded control","fine-graded feedback","fine-graded classification","fine-graded analysis","fine-graded approach"],"synonyms":["detailed","precise","granular","nuanced","refined","graduated"],"antonyms":["coarse-grained","broad","general","undifferentiated"]},{"part_of_speech":"adjective","definition":"(土壌、砂などが)粒度が細かい、粒径が揃っている","english_definition":"(of soil, sand, etc.) Consisting of or characterized by small, uniform particles.","examples":[{"sentence":"The fine-graded sand is ideal for making sandcastles.","translation":"その粒度の細かい砂は、砂の城を作るのに最適だ。"},{"sentence":"The plants thrive in fine-graded soil that retains moisture well.","translation":"その植物は、水分をよく保持する粒径の揃った土壌でよく育つ。"}],"collocations":["fine-graded sand","fine-graded soil","fine-graded sediment"],"synonyms":["fine-grained","fine-textured","smooth","powdery"],"antonyms":["coarse-grained","rough","gravelly"]}],"etymology":{"value":"The word \"fine-graded\" is a compound adjective formed by combining \"fine\" (meaning small, refined, or precise) and \"graded\" (meaning arranged in a series of steps or levels). The combination suggests a system or material that is divided into small, distinct categories or particles.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfaɪnˈɡreɪdɪd/","syllables":"fine-gra-ded"},"inflection":{"notes":"As an adjective, \"fine-graded\" does not have different inflections (e.g., comparative or superlative forms)."},"usage_notes":{"explanation":"\"Fine-graded\" is used to describe systems, materials, or processes that are characterized by a high degree of precision or differentiation. It implies that something is divided into small, distinct categories or particles, allowing for greater control, accuracy, or detail. The term is often used in technical or scientific contexts, such as soil science, image processing, or data analysis.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The fine-graded system was very good-graded.","correct":"✓ The fine-graded system was very well-designed.","note":"Avoid redundant use of \"graded.\" Use other adjectives like \"well-designed,\" \"precise,\" or \"detailed\" to describe the quality of the system. "},{"incorrect":"✗ The soil was fine-grade.","correct":"✓ The soil was fine-graded.","note":"Use the correct form, \"fine-graded,\" as it is a compound adjective. Using \"fine-grade\" is grammatically incorrect in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["grade (noun, verb)","grading (noun, verb)","fine (adjective)","finely (adverb)"],"related_terms":["granular","detailed","precise","nuanced","refined","graduated","fine-grained","fine-textured"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. More common in technical or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Fine-graded\" is a technical term that describes something divided into small, precise steps or categories. It's used to show that something is very detailed and carefully differentiated. You'll often find it in scientific or technical writing, where accuracy and precision are important. For example, a fine-graded analysis is a very detailed and thorough analysis. It indicates a high level of control and accuracy. This term is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The company uses a **fine-graded** risk assessment to identify potential threats.","translation":"その会社は、潜在的な脅威を特定するために、きめ細かいリスク評価を使用している。","type":"general","meaning_category":"きめ細かい分類"},{"sentence":"The artist used **fine-graded** pigments to achieve subtle color variations in the painting.","translation":"そのアーティストは、絵画の微妙な色の変化を実現するために、粒度が細かい顔料を使用した。","type":"general","meaning_category":"きめ細かい分類"},{"sentence":"The software allows for **fine-graded** control over the audio settings.","translation":"そのソフトウェアは、オーディオ設定に対するきめ細かい制御を可能にする。","type":"general","meaning_category":"きめ細かい分類"},{"sentence":"The **fine-graded** sand is perfect for building sandcastles.","translation":"その粒度の細かい砂は、砂の城を建てるのに最適だ。","type":"soil","meaning_category":"粒度が細かい"}]}