{"word":"undiscriminated","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"区別されていない、無差別の、差別されていない","english_definition":"Not distinguished or differentiated; not subject to discrimination; treated equally.","examples":[{"sentence":"The information was undiscriminated and lacked specific details.","translation":"その情報は区別されておらず、具体的な詳細に欠けていた。"},{"sentence":"The law ensures that all citizens are treated undiscriminated.","translation":"その法律は、すべての市民が無差別に扱われることを保証する。"}],"collocations":["undiscriminated information","undiscriminated treatment","undiscriminated access"],"synonyms":["indiscriminate","unselective","non-discriminatory","equal"],"antonyms":["discriminated","selective","discriminatory","unequal"]}],"etymology":{"value":"\"Undiscriminated\" is formed by adding the prefix \"un-\" (meaning \"not\") to the word \"discriminated.\" \"Discriminated\" comes from the Latin word \"discriminare,\" meaning \"to divide, separate, distinguish.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndɪˈskrɪmɪneɪtɪd/","syllables":"un-dis-crim-i-nat-ed"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have different forms for gender or number."},"usage_notes":{"explanation":"\"Undiscriminated\" generally means something is not differentiated or is treated equally without bias. It can describe information that lacks specific details or people who are treated without discrimination.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The undiscriminated people felt relieved.","correct":"✓ The non-discriminated people felt relieved. / ✓ The people who were not discriminated against felt relieved.","note":"While \"undiscriminated\" can mean \"not discriminated against,\" it's less common and can sound awkward. It's better to use \"non-discriminated\" or rephrase the sentence. "},{"incorrect":"✗ The undiscriminated data made analysis hard.","correct":"✓ The undifferentiated data made analysis hard.","note":"When referring to data or information, \"undifferentiated\" or \"indiscriminate\" is a more common and clearer choice than \"undiscriminated.\""}],"priority":"★★☆"},"related_words":{"derivatives":["discriminate (verb)","discrimination (noun)","discriminatory (adjective)","indiscriminate (adjective)","undiscriminating (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"undiscriminated\" is a relatively uncommon word that means something has not been distinguished or differentiated, or is treated equally without bias. It is often used in formal or legal contexts to describe the absence of discrimination. Because it's not frequently used, it's important to ensure clarity when using it, as it can be easily misunderstood. Consider using synonyms like \"non-discriminatory\" or rephrasing the sentence for better understanding."},"example_sentences":[{"sentence":"The charity provides undiscriminated aid to all refugees, regardless of their origin.","translation":"その慈善団体は、出身地に関係なく、すべての難民に無差別の援助を提供している。","type":"adjective","meaning_category":"無差別の"},{"sentence":"The system ensures undiscriminated access to resources for all employees.","translation":"そのシステムは、すべての従業員がリソースに無差別にアクセスできることを保証する。","type":"adjective","meaning_category":"無差別の"},{"sentence":"The undiscriminated mass of data made it difficult to draw any meaningful conclusions.","translation":"区別されていない大量のデータは、意味のある結論を引き出すことを困難にした。","type":"adjective","meaning_category":"区別されていない"}]}