{"word":"script-follower","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"台本通りに行動する人、指示に忠実な人、マニュアル人間","english_definition":"A person who strictly adheres to a script, instructions, or a predetermined plan, often without showing initiative or independent thought.","examples":[{"sentence":"He's such a script-follower; he never deviates from the instructions, even when it would be more efficient.","translation":"彼は本当にマニュアル人間で、もっと効率的な時でも指示から決して逸脱しない。"},{"sentence":"The actor was criticized for being a script-follower, lacking originality in his performance.","translation":"その俳優は台本通りに演じるだけで、演技にオリジナリティがないと批判された。"},{"sentence":"The company needs innovators, not script-followers, to stay competitive.","translation":"会社が競争力を維持するためには、指示に忠実な人ではなく、革新的な人材が必要だ。"}],"collocations":["strict script-follower","obedient script-follower","mere script-follower","die-hard script-follower"],"synonyms":["obedient","compliant","unimaginative","conventional","formulaic","by-the-book","rule-follower","manual-follower"],"antonyms":["innovator","original","creative","independent","unconventional","maverick","trailblazer","free thinker"]}],"etymology":{"value":"The term is a compound word formed by combining \"script\" (referring to a written text or plan) and \"follower\" (someone who adheres to or imitates something). The term implies a lack of independent thought or deviation from the established guidelines.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈskrɪptˌfɒləʊər/","syllables":"script-fol-low-er"},"inflection":{"noun_plural":"script-followers"},"usage_notes":{"explanation":"\"Script-follower\" is often used in a slightly derogatory way to describe someone who lacks creativity, initiative, or independent thinking. It implies that the person is overly reliant on instructions and unable to adapt to changing circumstances or think outside the box. The term can be used in various contexts, including business, arts, and everyday life.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a good script-follower because he is very intelligent.","correct":"✓ He is a good worker because he is very intelligent and follows instructions well.","note":"Being a \"script-follower\" doesn't necessarily imply intelligence, but rather obedience to instructions. If the person is intelligent and follows instructions, it's better to highlight both qualities separately."},{"incorrect":"✗ She is a script-follower, so she is a leader.","correct":"✓ She is a good manager, but not a visionary leader.","note":"A \"script-follower\" is usually not a leader, as leadership often requires independent thinking and decision-making. If the person is a good manager but lacks vision, it's better to describe them as such."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["rule-follower","by-the-book","yes-man","drone","cog in the machine"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR vocabulary lists)","frequency_google_ngram":"Low frequency (relatively uncommon term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Script-follower\" is a term used to describe someone who strictly follows instructions or a predetermined plan without showing much independent thought or creativity. It's often used in a slightly negative way to suggest that the person lacks initiative or the ability to adapt to changing situations. The term is not very common, but it's easily understood by native English speakers.","priority":"★★☆"},"example_sentences":[{"sentence":"The project failed because the team consisted only of script-followers who couldn't adapt to the unexpected challenges.","translation":"そのプロジェクトは、予期せぬ課題に対応できない指示に忠実な人たちだけで構成されていたため、失敗に終わった。","type":"noun","meaning_category":"Lack of initiative"},{"sentence":"In a creative industry, being a script-follower can limit your potential for growth and innovation.","translation":"創造的な業界では、指示に忠実なだけでは、成長と革新の可能性を制限する可能性がある。","type":"noun","meaning_category":"Limiting creativity"},{"sentence":"The manager valued script-followers who consistently delivered results, even if they weren't particularly innovative.","translation":"そのマネージャーは、特に革新的でなくても、常に結果を出す指示に忠実な人を評価した。","type":"noun","meaning_category":"Valued for obedience"},{"sentence":"He was criticized for being a script-follower, unable to think outside the box and come up with new solutions.","translation":"彼は指示に忠実なだけで、固定観念にとらわれずに新しい解決策を生み出すことができないと批判された。","type":"noun","meaning_category":"Inability to innovate"}]}