{"word":"psychoid","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"心理的な性質を持つが、完全に精神的なものではないもの。心と物質の中間的な性質を持つもの。","english_definition":"Resembling the mental or psychic; having characteristics intermediate between the mental and the physical.","examples":[{"sentence":"The concept of the psychoid is used to describe phenomena that are influenced by both psychological and physical factors.","translation":"サイコイドの概念は、心理的要因と物理的要因の両方の影響を受ける現象を説明するために使用されます。"},{"sentence":"Some researchers believe that psychosomatic illnesses have a psychoid origin.","translation":"一部の研究者は、心身症はサイコイド的な起源を持つと考えています。"}],"collocations":["psychoid phenomenon","psychoid level","psychoid origin"],"synonyms":["quasi-psychic","para-psychological"],"antonyms":["purely physical","purely mental"]},{"part_of_speech":"noun","definition":"心と物質の中間的な性質を持つもの。特に、ユング心理学において、元型の物質的な表現を指す。","english_definition":"Something that has characteristics intermediate between the mental and the physical; in Jungian psychology, a material representation of an archetype.","examples":[{"sentence":"Jung described the archetype as having a psychoid aspect, meaning it can manifest in both the psyche and the physical world.","translation":"ユングは、元型はサイコイド的な側面を持つと説明しました。つまり、それは精神と物理的な世界の両方に現れる可能性があります。"},{"sentence":"The alchemical process, according to Jung, was a way of working with the psychoid nature of the unconscious.","translation":"ユングによれば、錬金術のプロセスは、無意識のサイコイド的な性質を扱う方法でした。"}],"collocations":["Jungian psychoid","archetypal psychoid"],"synonyms":["archetypal image (in some contexts)"],"antonyms":[]}],"etymology":{"value":"The term \"psychoid\" is derived from the Greek words \"psyche\" (ψυχή), meaning \"soul\" or \"mind,\" and \"-oid\" (οειδής), meaning \"resembling\" or \"having the form of.\" It was coined to describe phenomena that resemble the mental but are not entirely mental.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsaɪkɔɪd/","syllables":"psy-choid"},"inflection":{"noun_plural":"psychoids"},"usage_notes":{"explanation":"The term \"psychoid\" is primarily used in psychology, particularly in Jungian psychology, to describe phenomena that exist on the border between the mental and the physical. It suggests that certain psychological processes can have a material or physical manifestation, and vice versa. The concept is often used to explain psychosomatic illnesses, synchronicity, and other phenomena that seem to defy a purely materialistic or purely mental explanation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The psychoid is purely a mental construct.","correct":"✓ The psychoid has both mental and physical aspects.","note":"The psychoid is defined by its intermediate nature between the mental and the physical; it is not purely mental."},{"incorrect":"✗ Psychoid refers to a specific mental illness.","correct":"✓ Psychoid is a concept used to describe phenomena with both psychological and physical aspects.","note":"Psychoid is a theoretical concept, not a specific diagnosis of mental illness."}],"priority":"★★☆"},"related_words":{"derivatives":["psyche","psychic","psychology","psychosomatic"],"phrases":["collective unconscious","archetype","synchronicity"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low frequency - Specialized term in psychology.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term \"psychoid\" is a specialized term primarily used in psychology, particularly within the framework of Jungian psychology. It describes something that is neither purely mental nor purely physical, but rather exists in an intermediate state between the two. It is often used to explain phenomena that seem to bridge the gap between mind and matter, such as psychosomatic symptoms or synchronistic events. Understanding this term requires familiarity with basic psychological concepts and potentially some knowledge of Jungian theory."},"example_sentences":[{"sentence":"The dream image had a strong psychoid component, suggesting a connection to the dreamer's physical state.","translation":"その夢のイメージは強いサイコイド的な要素を持っており、夢を見た人の身体的な状態とのつながりを示唆していました。","type":"adjective","meaning_category":"心理的性質を持つ"},{"sentence":"Jung explored the psychoid nature of the archetype through his studies of alchemy.","translation":"ユングは、錬金術の研究を通して、元型のサイコイド的な性質を探求しました。","type":"noun","meaning_category":"心と物質の中間的な性質を持つもの"}]}