{"word":"snobographer","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A person who writes about or documents snobs and their behavior. This is often done in a satirical or critical way.","english_definition":"A person who writes about or documents snobs and their behavior, often in a satirical or critical way.","examples":[{"sentence":"The columnist became a snobographer, chronicling the absurd habits of the wealthy elite.","translation":"そのコラムニストはスノボグラファーとなり、富裕層のエリートたちのばかげた習慣を記録した。"},{"sentence":"As a snobographer, she attended exclusive parties to observe and report on the social climbers.","translation":"スノボグラファーとして、彼女は社交界の成り上がり者を観察し、報告するために、特別なパーティーに出席した。"}],"collocations":["social snobographer","satirical snobographer","documenting snobographer"],"synonyms":["social commentator","cultural critic","satirist"],"antonyms":[]}],"etymology":{"value":"A blend of 'snob' (a person who believes that their tastes are superior to those of others) and '-grapher' (someone who writes or documents something).","priority":"★★☆"},"pronunciation":{"ipa":"/snɒˈbɒɡrəfər/","syllables":"snob-og-ra-pher"},"inflection":{"noun_plural":"snobographers"},"usage_notes":{"explanation":"The term 'snobographer' is not widely recognized or used. It is a neologism, likely coined to describe someone who observes and writes about snobs and their social circles, often with a critical or humorous perspective.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a snobographer of famous people.","correct":"✓ He is a snobographer who writes about famous people.","note":"The term itself implies writing or documenting, so avoid redundant phrasing."}],"priority":"★★☆"},"related_words":{"derivatives":["snob","snobbery","-grapher","graphy"],"related_terms":["sociology","social commentary","satire"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - likely a neologism.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Snobographer' is a niche term, likely understood by those familiar with social commentary or satire. It combines 'snob' and '-grapher' to describe someone who documents or writes about snobs. Due to its infrequent use, it may require explanation or context for a broader audience."},"example_sentences":[{"sentence":"The author is known as a snobographer, dissecting the lifestyles of the upper class in her novels.","translation":"その作家はスノボグラファーとして知られており、小説の中で上流階級のライフスタイルを分析している。","type":"noun","meaning_category":"social commentary"},{"sentence":"His blog established him as a snobographer, offering witty observations on the pretentiousness of the art world.","translation":"彼のブログは彼をスノボグラファーとして確立し、美術界の気取りに対する機知に富んだ観察を提供している。","type":"noun","meaning_category":"social criticism"}]}