{"word":"classical-leaning","meanings":[{"part_of_speech":"adjective","definition":"古典的な傾向がある、古典的な要素を取り入れている","english_definition":"Having a tendency towards or incorporating elements of classical music, art, literature, or culture.","examples":[{"sentence":"The band's new album has a classical-leaning sound, with string arrangements and complex harmonies.","translation":"そのバンドの新しいアルバムは、ストリングスのアレンジや複雑なハーモニーなど、クラシック音楽の要素を取り入れたサウンドになっている。"},{"sentence":"Her art is classical-leaning, drawing inspiration from Renaissance masters.","translation":"彼女の芸術は、ルネサンスの巨匠からインスピレーションを得ており、古典的な傾向がある。"},{"sentence":"The architect designed a classical-leaning building with columns and symmetrical facades.","translation":"その建築家は、柱や対称的なファサードを備えた、古典的な傾向のある建物を設計した。"}],"collocations":["classical-leaning music","classical-leaning art","classical-leaning architecture","classical-leaning design","classical-leaning style"],"synonyms":["classicized","neo-classical","traditionalist","academic"],"antonyms":["modern","avant-garde","experimental","contemporary"]}],"etymology":{"value":"複合語であり、「classical」（古典的な）と「leaning」（傾向がある）から構成される。","priority":"★★★"},"pronunciation":{"ipa":null,"syllables":"clas-si-cal-lean-ing"},"inflection":{},"usage_notes":{"explanation":"「classical-leaning」は、ある事物やスタイルが、古典的な特徴や要素を部分的に取り入れていることを示す形容詞です。完全に古典的であるわけではなく、現代的な要素と古典的な要素が混ざり合っているニュアンスがあります。音楽、美術、建築、文学など、幅広い分野で使用できます。","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["classical","leaning"],"related_terms":["classicism","neoclassicism","traditionalism"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term 'classical-leaning' describes something that is not fully classical but has elements or tendencies in that direction. It suggests a partial influence or inspiration from classical styles, without being a strict adherence to them. This term is often used in art, music, and architecture to indicate a blend of classical and contemporary elements."},"example_sentences":[{"sentence":"The composer's later works became more classical-leaning, incorporating traditional forms.","translation":"その作曲家の後期の作品は、伝統的な形式を取り入れ、より古典的な傾向を帯びてきた。","type":"general","meaning_category":"傾向がある"},{"sentence":"The interior design was classical-leaning, with ornate details and a neutral color palette.","translation":"そのインテリアデザインは、華やかなディテールとニュートラルなカラーパレットで、古典的な傾向があった。","type":"general","meaning_category":"要素を取り入れている"}]}