{"word":"nonsacerdotal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"聖職者でない、聖職者に関係しない","english_definition":"Not sacerdotal; not pertaining to priests or the priesthood.","examples":[{"sentence":"The organization is nonsacerdotal in nature, focusing on community service rather than religious rituals.","translation":"その組織は本質的に聖職者に関係なく、宗教的な儀式よりも地域奉仕に焦点を当てています。"},{"sentence":"He held a nonsacerdotal position within the church, working on administrative tasks.","translation":"彼は教会内で聖職者ではない役職に就き、管理業務を行っていました。"}],"collocations":["nonsacerdotal role","nonsacerdotal duties","nonsacerdotal functions"],"synonyms":["lay","secular","nonclerical"],"antonyms":["sacerdotal","clerical","priestly"]}],"etymology":{"value":"\"non-\" (not) + \"sacerdotal\" (relating to priests). Sacerdotal comes from Latin \"sacerdos\" (priest).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˌsæsərˈdoʊtəl/","syllables":"non-sa-cer-do-tal"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"\"Nonsacerdotal\" is used to describe something that is not related to priests or the priesthood. It often contrasts with \"sacerdotal,\" which describes things associated with priests or their functions. The term is relatively formal and not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sacerdotal members were nonsacerdotal.","correct":"✓ The lay members were nonsacerdotal.","note":"Sacerdotal members are, by definition, not nonsacerdotal. Use \"lay members\" to refer to non-priestly members."}],"priority":"★★☆"},"related_words":{"derivatives":["sacerdotalism (名詞: 聖職者主義)"],"related_terms":["sacerdotal (形容詞: 聖職者の、聖職者的な)","laity (名詞: 平信徒)","clergy (名詞: 聖職者)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"nonsacerdotal\" is a formal and specialized term, primarily used in religious or historical contexts. It means \"not related to priests or the priesthood.\" Understanding this word requires familiarity with the term \"sacerdotal\" and the prefix \"non-\". Due to its specific and infrequent usage, it is considered an advanced vocabulary word.","priority":"★☆☆"},"example_sentences":[{"sentence":"The committee included both sacerdotal and nonsacerdotal members to ensure a balanced perspective.","translation":"委員会はバランスの取れた視点を確保するために、聖職者と聖職者でないメンバーの両方を含んでいました。","type":"general","meaning_category":"general"},{"sentence":"Nonsacerdotal roles in the church often involve administrative or charitable work.","translation":"教会における聖職者でない役割は、しばしば管理業務や慈善活動を含みます。","type":"general","meaning_category":"general"}]}