{"word":"Kyanization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"木材の防腐処理法の一種で、塩化第二水銀（昇汞）の水溶液に木材を浸す方法。","english_definition":"A wood preservation process involving the impregnation of wood with a solution of mercuric chloride (corrosive sublimate).","examples":[{"sentence":"Kyanization was once a popular method for preserving wood used in railway ties.","translation":"キアニゼーションはかつて、鉄道の枕木に使用される木材の防腐処理法として一般的でした。"}],"collocations":["Kyanization process","mercuric chloride solution"],"synonyms":["wood preservation","timber treatment"],"antonyms":[]}],"etymology":{"value":"John Howard Kyan (1774–1850), a British chemist, who patented the process in 1832. The suffix '-ization' denotes the process or act of doing something.","priority":"★★★"},"pronunciation":{"ipa":"/ˌkaɪənaɪˈzeɪʃən/","syllables":"ky-an-i-za-tion"},"inflection":{"noun_plural":"Kyanizations"},"usage_notes":{"explanation":"Kyanization is a historical wood preservation method that is less commonly used today due to the toxicity of mercuric chloride.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Cyanization is the same as Kyanization.","correct":"✓ Cyanization and Kyanization are different processes. Kyanization uses mercuric chloride, while cyanidation uses cyanide compounds.","note":"Cyanization refers to a process involving cyanide compounds, while Kyanization specifically refers to the wood preservation method using mercuric chloride."}],"priority":"★★☆"},"related_words":{"derivatives":["Kyanize (verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Kyanization is a specialized term related to historical wood preservation techniques. Understanding requires knowledge of chemistry and historical industrial processes. Due to the toxicity of the chemicals involved, the process is not widely used today, making the term relatively uncommon."},"example_sentences":[{"sentence":"The old railway bridge was built using timber treated by Kyanization.","translation":"その古い鉄道橋は、キアニゼーションによって処理された木材を使用して建設されました。","type":"noun","meaning_category":"wood preservation"}]}