{"word":"dramaturgist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"劇作家、演出家、脚本家、劇評家、演劇研究家","english_definition":"a literary editor on the staff of a theatre who consults with authors and edits texts.","examples":[{"sentence":"The dramaturgist helped the playwright refine the script.","translation":"ドラマツルクは劇作家が脚本を洗練させるのを手伝った。"},{"sentence":"The theater hired a dramaturgist to improve the quality of their productions.","translation":"劇場は作品の質を向上させるためにドラマツルクを雇った。"}],"collocations":["work as a dramaturgist","hire a dramaturgist","consult with a dramaturgist"],"synonyms":["dramaturge","playwright","scriptwriter","dramatic advisor"],"antonyms":[]}],"etymology":{"value":"'Dramaturg' + '-ist'. 'Dramaturg' is from German Dramaturg, from French dramaturge, from Greek dramatourgos 'playwright, dramatic poet', from drama 'drama' + ergos 'worker'.","priority":"★★☆"},"pronunciation":{"ipa":"ˈdræmətɜːrdʒɪst","syllables":"dra-ma-tur-gist"},"inflection":{"noun_plural":"dramaturgists"},"usage_notes":{"explanation":"A dramaturgist is a literary advisor or editor for a theater. They work with playwrights to develop and refine scripts, research the historical and cultural context of plays, and advise directors and actors on interpretation. The role of a dramaturgist varies depending on the theater and the production.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a dramaturgist of the play.","correct":"✓ He is the dramaturgist for the play.","note":"Use 'for' to indicate the play the dramaturgist is working on."}],"priority":"★★☆"},"related_words":{"derivatives":["dramaturgy","dramatic","drama","dramaturge"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'dramaturgist' refers to a specialist in theater who helps with the development and analysis of plays. This role is more common in professional theater settings, and the word itself is not frequently used in everyday conversation. Understanding this word can help in discussions about theater and play production."},"example_sentences":[{"sentence":"The dramaturgist provided valuable feedback on the script's structure.","translation":"ドラマツルクは脚本の構成について貴重なフィードバックを提供した。","type":"general","meaning_category":"literary editor"},{"sentence":"As a dramaturgist, she researched the historical context of the play.","translation":"ドラマツルクとして、彼女はその劇の歴史的背景を調査した。","type":"general","meaning_category":"literary editor"}]}