{"word":"Chromocyte","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A colored cell; specifically, a colored blood cell.","english_definition":"A colored cell; specifically, a colored blood cell.","examples":[{"sentence":"Chromocytes are essential for oxygen transport in the blood.","translation":"色素細胞は血液中の酸素輸送に不可欠です。"}],"collocations":[],"synonyms":["erythrocyte","leukocyte"],"antonyms":[],"notes":"This term is rarely used in modern medical terminology. Erythrocyte (red blood cell) and leukocyte (white blood cell) are the preferred terms.","related_terms":[]}],"etymology":{"value":"From the Greek words 'chroma' (color) and 'kytos' (cell).","priority":"★★★"},"pronunciation":{"ipa":"/ˈkroʊməˌsaɪt/","syllables":"chro-mo-cyte"},"inflection":{"noun_plural":"chromocytes"},"usage_notes":{"explanation":"The term 'chromocyte' is an older, more general term for colored cells, particularly blood cells. In modern usage, more specific terms like 'erythrocyte' (red blood cell) and 'leukocyte' (white blood cell) are preferred. Therefore, 'chromocyte' is rarely used in contemporary medical or biological contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Chromocytes are only red blood cells.","correct":"✓ Chromocytes can refer to both red and white blood cells, though the term is rarely used today.","note":"While 'chromocyte' can refer to colored blood cells, it's not limited to just red blood cells. However, it's more accurate and common to use 'erythrocyte' for red blood cells and 'leukocyte' for white blood cells."}],"priority":"★☆☆"},"related_words":{"derivatives":["chromatic","chromosome","dichromatic"],"related_terms":["erythrocyte","leukocyte","hematology"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - rarely used in modern texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Chromocyte' is a highly specialized term, rarely encountered outside of historical or very specific scientific contexts. Understanding its meaning requires knowledge of basic cell biology and etymology (Greek roots). Modern scientific literature almost exclusively uses more specific terms like 'erythrocyte' and 'leukocyte' instead. Therefore, this term is not suitable for general language learners."},"example_sentences":[{"sentence":"The study of chromocytes was crucial in early hematological research.","translation":"色素細胞の研究は初期の血液学研究において重要でした。","type":"noun","meaning_category":"historical context"},{"sentence":"While the term chromocyte is general, it often refers to colored blood cells.","translation":"色素細胞という用語は一般的ですが、多くの場合、着色された血液細胞を指します。","type":"noun","meaning_category":"general definition"}]}