{"word":"reapportioning","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(議席などを)再配分する、再割り当てする","english_definition":"To redistribute or reallocate something, especially seats in a legislative body, among different regions or constituencies.","examples":[{"sentence":"The state is reapportioning its legislative districts based on the new census data.","translation":"州は新しい国勢調査のデータに基づいて、立法管轄区を再配分している。"},{"sentence":"Reapportioning the budget requires careful consideration of each department's needs.","translation":"予算を再配分するには、各部署のニーズを慎重に検討する必要がある。"}],"collocations":["reapportion legislative districts (立法管轄区を再配分する)","reapportion funds (資金を再配分する)","reapportion resources (資源を再配分する)","reapportion seats (議席を再配分する)"],"synonyms":["redistribute","reallocate","reassign","reorganize","readjust"],"antonyms":["maintain","retain","keep","preserve"]}],"etymology":{"value":"The word \"reapportion\" is formed by adding the prefix \"re-\" (meaning again or anew) to \"apportion,\" which means to divide and assign proportionally. \"Apportion\" comes from the Latin word \"portio,\" meaning a share or part.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriː.əˈpɔːr.ʃən.ɪŋ/","syllables":"re-ap-por-tion-ing"},"inflection":{"verb_forms":{"present_simple":["reapportions"],"past_simple":"reapportioned","past_participle":"reapportioned","present_participle":"reapportioning"}},"usage_notes":{"explanation":"\"Reapportioning\" specifically refers to the act of redistributing something that was previously apportioned or allocated. It often involves adjusting the distribution based on new data, changing circumstances, or revised priorities. The term is commonly used in the context of political representation, where legislative seats are reapportioned among states or districts to reflect population changes. However, it can also apply to the reallocation of resources, funds, or other assets within an organization or system.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The reapportioning was done quick.","correct":"✓ The reapportioning was done quickly.","note":"\"Quick\" is an adjective, while \"quickly\" is an adverb. Because it modifies the verb \"was done\", you should use the adverb \"quickly\"."},{"incorrect":"✗ They are reapportioning the seats, but it's a reapportion.","correct":"✓ They are reapportioning the seats, but it's a reapportionment.","note":"The noun form of reapportion is reapportionment."}],"priority":"★★☆"},"related_words":{"derivatives":["reapportionment (noun: 再配分、再割り当て)","apportion (verb: 配分する、割り当てる)","apportionment (noun: 配分、割り当て)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'reapportioning' refers to the process of redistributing or reallocating something, typically in a proportional manner. It's often used in political contexts to describe the redistribution of legislative seats based on population changes. Understanding this word requires familiarity with concepts of allocation, distribution, and proportional representation. It's a more advanced term, so it's less commonly encountered in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The committee is currently reapportioning the budget to better reflect the company's strategic goals.","translation":"委員会は現在、会社の戦略目標をより良く反映するために予算を再配分している。","type":"verb","meaning_category":"再配分する (予算)"},{"sentence":"The reapportioning of congressional districts is a contentious issue in many states.","translation":"連邦議会選挙区の再配分は、多くの州で議論の的となる問題だ。","type":"verb","meaning_category":"再配分する (選挙区)"},{"sentence":"The organization is reapportioning its resources to focus on its core mission.","translation":"その組織は、その中心的な使命に焦点を当てるために、リソースを再配分している。","type":"verb","meaning_category":"再配分する (資源)"}]}