{"word":"treasonish","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"反逆罪を思わせる、反逆罪に近い、裏切り行為を暗示する","english_definition":"Resembling or suggesting treason; having the characteristics of treason.","examples":[{"sentence":"His actions were considered treasonish by some members of the government.","translation":"彼の行動は政府の一部議員によって反逆罪に近いと見なされた。"},{"sentence":"The article contained treasonish sentiments that sparked public outrage.","translation":"その記事には、大衆の怒りを引き起こした反逆罪を思わせる感情が含まれていた。"}],"collocations":["treasonish behavior","treasonish sentiments","treasonish acts","treasonish talk"],"synonyms":["seditious","subversive","disloyal","rebellious","traitorous"],"antonyms":["loyal","patriotic","faithful","obedient"]},{"part_of_speech":"adjective","definition":"(比喩的に)信頼を裏切るような、不誠実な","english_definition":"(Figuratively) Betraying trust or confidence; disloyal.","examples":[{"sentence":"To reveal her secret would be a treasonish act against their friendship.","translation":"彼女の秘密を明かすことは、彼らの友情に対する裏切り行為となるだろう。"},{"sentence":"He felt a treasonish guilt for even considering the offer from their competitor.","translation":"彼は競合他社からの申し出を検討することさえ、裏切り行為のような罪悪感を覚えた。"}],"collocations":["treasonish act","treasonish guilt","treasonish feeling"],"synonyms":["betraying","disloyal","unfaithful","deceitful"],"antonyms":["trustworthy","reliable","honest","faithful"]}],"etymology":{"value":"The word 'treasonish' is formed by adding the suffix '-ish' to the word 'treason.' The suffix '-ish' indicates a resemblance to or having the characteristics of the root word. Therefore, 'treasonish' means 'resembling treason' or 'having the characteristics of treason.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtriːzənɪʃ/","syllables":"trea-son-ish"},"inflection":{"notes":"Since 'treasonish' is an adjective, it can be modified by adverbs such as 'very,' 'somewhat,' or 'slightly.' It also has comparative and superlative forms (more treasonish, most treasonish), although these are less common."},"usage_notes":{"explanation":"'Treasonish' is used to describe actions, sentiments, or behaviors that are similar to treason but may not meet the strict legal definition of treason. It often implies a strong sense of disloyalty or betrayal. The term is not as commonly used as 'treasonous' or 'traitorous,' and it may be considered somewhat informal.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The treasonish committed by the spy was unforgivable.","correct":"The treason committed by the spy was unforgivable. / The treasonish actions of the spy were unforgivable.","note":"'Treasonish' is an adjective, so it should modify a noun. 'Treason' is a noun and refers to the act itself."},{"incorrect":"He was acting very treasonish, so he was arrested for treason.","correct":"He was acting in a treasonish manner, but he was not arrested because his actions did not legally constitute treason.","note":"'Treasonish' implies resemblance to treason, but not necessarily the actual crime. Arrest for treason requires meeting the legal definition of treason."}],"priority":"★★☆"},"related_words":{"derivatives":["treason (noun): the crime of betraying one's country, especially by attempting to kill or overthrow the sovereign or government.","treasonous (adjective): involving or guilty of treason.","traitor (noun): a person who betrays a friend, country, principle, etc.","traitorous (adjective): relating to or characteristic of a traitor.","sedition (noun): conduct or speech inciting people to rebel against the authority of a state or monarch.","seditious (adjective): inciting or causing people to rebel against the authority of a state or monarch."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (The word is not common enough to be included in CEFR levels.)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Treasonish' is a relatively uncommon word used to describe something that resembles or suggests treason but does not fully qualify as treason. It implies disloyalty or betrayal. Because it is not a common word, understanding its meaning requires a good vocabulary and the ability to infer meaning from the root word 'treason' and the suffix '-ish.'"},"example_sentences":[{"sentence":"The politician's speech contained treasonish undertones that worried many voters.","translation":"その政治家の演説には、多くの有権者を不安にさせる反逆罪を思わせる含みがあった。","type":"adjective","meaning_category":"resembling treason"},{"sentence":"His treasonish behavior towards his former allies ultimately led to his downfall.","translation":"彼の元同盟国に対する反逆罪を思わせる行動は、最終的に彼の失脚につながった。","type":"adjective","meaning_category":"resembling treason"},{"sentence":"She felt a treasonish pang of guilt when she considered accepting the job offer from a rival company.","translation":"彼女はライバル会社からの求人を受け入れることを検討したとき、裏切り行為のような罪悪感を覚えた。","type":"adjective","meaning_category":"betraying trust"}]}