{"word":"fugitively","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"逃亡者として、逃亡するように、一時的に、束の間","english_definition":"In a manner characteristic of a fugitive; in a fleeting or transient manner.","examples":[{"sentence":"He lived fugitively, moving from place to place to avoid capture.","translation":"彼は捕まるのを避けるために、場所から場所へと移動しながら、逃亡者として生きていた。"},{"sentence":"The sunlight shone fugitively through the clouds.","translation":"太陽の光は雲間から束の間、逃げるように差し込んだ。"},{"sentence":"She glanced fugitively at the letter, then quickly looked away.","translation":"彼女は手紙をちらっと逃げるように見て、すぐに目をそらした。"}],"collocations":["live fugitively","glance fugitively","shine fugitively"],"synonyms":["fleetingly","transiently","evasively","secretly","temporarily"],"antonyms":["permanently","openly","publicly","stably"]}],"etymology":{"value":"Derived from the word 'fugitive' by adding the suffix '-ly'. 'Fugitive' comes from the Latin 'fugitivus', from 'fugere' meaning 'to flee'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfjuːdʒɪtɪvli/","syllables":"fu-gi-tive-ly"},"inflection":{"notes":"Adverb - no inflection"},"usage_notes":{"explanation":"'Fugitively' describes an action or state that is characteristic of someone who is trying to avoid being caught or noticed. It can also describe something that is brief or fleeting. The word implies a sense of urgency, secrecy, or impermanence. It is not a commonly used word, and its use often lends a dramatic or literary tone to writing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted fugitively at the party, making everyone suspicious.","correct":"✓ He acted suspiciously at the party, making everyone suspicious.","note":"'Fugitively' describes the *manner* of fleeing or transience, not general suspicious behavior. Use 'suspiciously' for the latter."},{"incorrect":"✗ The information was presented fugitively, so it was hard to understand.","correct":"✓ The information was presented fleetingly, so it was hard to understand.","note":"If you mean 'briefly' or 'in a way that lacks detail,' use 'fleetingly' or 'briefly' instead of 'fugitively'."}],"priority":"★☆☆"},"related_words":{"derivatives":["fugitive (noun, adjective)","fugacious (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Fugitively' is an adverb that means 'in a way that resembles a fugitive' or 'in a fleeting manner'. It's not a common word, so it's more likely to be found in formal writing or literature. It suggests someone or something is acting like they are trying to escape or avoid being seen, or that something is happening very briefly. Because it's not frequently used, simpler alternatives like 'fleetingly' or 'evasively' might be more appropriate in everyday conversation."},"example_sentences":[{"sentence":"The suspect moved fugitively through the crowded streets, hoping to blend in.","translation":"容疑者は人混みの多い通りを、溶け込もうとしながら逃亡者のように移動した。","type":"adverb","meaning_category":"逃亡者として"},{"sentence":"Her gaze rested fugitively on his face before she turned away, blushing.","translation":"彼女の視線は、赤面しながら顔をそむける前に、彼の顔に束の間だけ留まった。","type":"adverb","meaning_category":"一時的に"},{"sentence":"He spoke fugitively about his past, revealing only small details.","translation":"彼は過去について、わずかな詳細だけを明かし、逃げるように話した。","type":"adverb","meaning_category":"逃亡するように"}]}