{"word":"notary","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"公証人","english_definition":"A person authorized to perform certain legal formalities, especially to draw up or certify contracts, deeds, and other documents for use in other jurisdictions.","examples":[{"sentence":"I need to find a notary to witness my signature.","translation":"署名を証明してくれる公証人を探す必要があります。"},{"sentence":"The notary stamped the document with their official seal.","translation":"公証人は公印で書類に捺印しました。"},{"sentence":"A notary public can administer oaths and affirmations.","translation":"公証人は宣誓供述をさせることができます。"}],"collocations":["notary public (公証人)","find a notary (公証人を探す)","notary services (公証サービス)","notarize a document (書類を公証する)","witness a signature (署名を証明する)","official seal (公印)"],"synonyms":["certifying officer","commissioner of oaths","legal witness"],"antonyms":[]}],"etymology":{"value":"From the Latin word \"notarius,\" meaning a scribe, shorthand writer, or clerk.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnoʊtəri/","syllables":"no-ta-ry"},"inflection":{"noun_plural":"notaries"},"usage_notes":{"explanation":"A \"notary\" or \"notary public\" is a person legally authorized to administer oaths, witness signatures on documents, and perform other official acts. Their primary role is to deter fraud and ensure the proper execution of important documents. Notaries are often used for documents that need to be recognized in other countries. The specific powers and requirements for becoming a notary vary by jurisdiction.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need a notery to sign this.","correct":"✓ I need a notary to sign this.","note":"Correct spelling is \"notary\", not \"notery\"."},{"incorrect":"✗ Only lawyers can be notaries.","correct":"✓ Not all notaries are lawyers, and not all lawyers are notaries.","note":"While some lawyers may also be notaries, the role of a notary is distinct from that of a lawyer, and many notaries are not lawyers."}],"priority":"★★☆"},"related_words":{"derivatives":["notarize (verb: to authenticate or certify (a document) by affixing a notary's seal and signature.)","notarization (noun: the act of notarizing a document)","notarial (adjective: relating to a notary)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but common in legal and business contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"notary\" refers to a person authorized to perform certain legal formalities, such as witnessing signatures on documents and administering oaths. This word is commonly used in legal and business contexts when discussing the authentication of documents. Understanding the role of a notary is important when dealing with legal paperwork or international transactions."},"example_sentences":[{"sentence":"The bank requires a **notary** to verify the identity of the signer.","translation":"銀行は署名者の身元を確認するために公証人を必要とします。","type":"noun","meaning_category":"公証人"},{"sentence":"She went to a **notary** to get her affidavit sworn.","translation":"彼女は宣誓供述書に署名してもらうために公証人のところへ行った。","type":"noun","meaning_category":"公証人"},{"sentence":"Before sending the contract overseas, make sure to have it signed and stamped by a **notary**.","translation":"契約書を海外に送る前に、必ず公証人の署名と捺印を受けてください。","type":"noun","meaning_category":"公証人"}]}