{"word":"sannups","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(slang, plural only) A variant of 'sandals', often referring to sandals worn with socks.","english_definition":"(slang, plural only) A humorous or derogatory term for sandals, especially when worn with socks.","examples":[{"sentence":"Look at those tourists wearing sannups; what a fashion faux pas!","translation":"あの観光客たちのサンヌップを見てよ。なんてファッションの失敗だ！"},{"sentence":"He's rocking the sannups-and-socks look today.","translation":"彼は今日、サンヌップと靴下のスタイルで決めてるね。"}],"collocations":["wearing sannups","sannups and socks"],"synonyms":["sandals","socks and sandals"],"antonyms":[]}],"etymology":{"value":"Likely a playful alteration of 'sandals', perhaps influenced by the sound of 'snaps' or other similar words. The term emphasizes the perceived awkwardness or unfashionableness of the footwear, especially when combined with socks.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsænʌps/","syllables":"san-nups"},"inflection":{"noun_plural":"sannups (only used in plural)"},"usage_notes":{"explanation":"'Sannups' is primarily a slang term, often used humorously or derisively. It specifically refers to sandals, and often carries the connotation of being unfashionable, especially when worn with socks. The term is not widely used and may not be understood by everyone.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a new pair of sannup.","correct":"✓ I bought a new pair of sannups.","note":"The word 'sannups' is almost exclusively used in the plural form."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["sandals","socks and sandals","fashion faux pas"]},"level_frequency":{"CEFR":"N/A (slang, uncommon)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Sannups' is a slang term, so it's not something you'd typically find in formal writing. It's used humorously to refer to sandals, especially when worn with socks, which is often considered a fashion mistake. If you're not familiar with slang, you might not understand this word, but it's good to be aware of it if you encounter it in casual conversation or online."},"example_sentences":[{"sentence":"He committed the ultimate fashion crime: wearing sannups with socks.","translation":"彼が究極のファッション犯罪を犯した。サンヌップと靴下を履いていたんだ。","type":"noun","meaning_category":"sandals (worn with socks)"},{"sentence":"Those tourists are sporting some serious sannups.","translation":"あの観光客たちは、かなり本格的なサンヌップを履いているね。","type":"noun","meaning_category":"sandals"}]}