{"word":"nonmiscible","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"混和しない、混ざり合わない","english_definition":"(of liquids) not forming a homogeneous mixture when added together.","examples":[{"sentence":"Oil and water are nonmiscible.","translation":"油と水は混ざり合わない。"},{"sentence":"These two solvents are nonmiscible, so they form separate layers.","translation":"これらの二つの溶媒は混ざり合わないので、分離した層を形成する。"}],"collocations":["nonmiscible liquids","nonmiscible solvents"],"synonyms":["immiscible","unmixable"],"antonyms":["miscible","mixable"]}],"etymology":{"value":"\"non-\" (not) + \"miscible\" (capable of being mixed).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈmɪsɪbəl/","syllables":"non-mis-ci-ble"},"inflection":{"notes":"Invariable adjective"},"usage_notes":{"explanation":"\"Nonmiscible\" is typically used in scientific contexts, particularly in chemistry and physics, to describe liquids that do not dissolve or mix homogeneously. It is often used interchangeably with \"immiscible,\" although \"immiscible\" is more common.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The two substances are nonmiscible, creating a solution.","correct":"✓ The two substances are nonmiscible, creating separate layers.","note":"Nonmiscible substances do not create a solution; they form separate layers."}],"priority":"★★☆"},"related_words":{"derivatives":["miscibility (noun): the property of being miscible"],"related_terms":["immiscible","miscible","solution","solvent","mixture"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonmiscible\" is a technical term used in chemistry and physics to describe liquids that do not mix to form a homogeneous solution. It's the opposite of \"miscible.\" Understanding this word requires knowledge of basic scientific concepts related to solutions and mixtures. It's not commonly used in everyday language."},"example_sentences":[{"sentence":"The experiment demonstrated that the two organic compounds were completely nonmiscible.","translation":"その実験は、2つの有機化合物が完全に混ざり合わないことを示した。","type":"adjective","meaning_category":"混ざり合わない"},{"sentence":"Due to their differing polarities, the alcohol and the oil remained nonmiscible.","translation":"極性の違いにより、アルコールと油は混ざり合わないままだった。","type":"adjective","meaning_category":"混ざり合わない"}]}