{"word":"world-fearing","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"世をはばかる、世間を恐れる","english_definition":"Apprehensive or fearful of the world or worldly matters; timid or shy in social situations.","examples":[{"sentence":"The world-fearing hermit lived a solitary life, avoiding all contact with society.","translation":"世をはばかる隠者は、社会との接触を一切避け、孤独な生活を送った。"},{"sentence":"Her world-fearing nature made it difficult for her to make friends.","translation":"彼女の世間を恐れる性格のせいで、友達を作るのが難しかった。"},{"sentence":"He was a world-fearing young man, unsure of how to navigate social situations.","translation":"彼は世間を恐れる青年で、社会的な状況をどう乗り切ればよいのかわからなかった。"}],"collocations":["world-fearing hermit (世をはばかる隠者)","world-fearing nature (世間を恐れる性格)","world-fearing person (世間を恐れる人)"],"synonyms":["timid","shy","retiring","bashful","diffident","socially anxious","introverted"],"antonyms":["outgoing","extroverted","confident","bold","gregarious"]}],"etymology":{"value":"\"World\" + \"fearing\". \"World\" refers to the earth and its inhabitants or worldly matters. \"Fearing\" means feeling fear or apprehension. The compound adjective describes someone who is afraid or apprehensive of the world and its social interactions.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɜːldˌfɪərɪŋ/","syllables":"world-fear-ing"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"\"World-fearing\" describes a person who is timid, shy, or apprehensive about interacting with the world or participating in social situations. It suggests a fear of judgment, criticism, or the complexities of worldly matters. The term is relatively uncommon and often used in literary or descriptive contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a world-fearing of heights.","correct":"✓ He is afraid of heights.","note":"\"World-fearing\" specifically relates to social anxiety or fear of worldly matters, not specific phobias like fear of heights. Use \"afraid of heights\" instead."},{"incorrect":"✗ The world-fearing building stood tall.","correct":"✓ The imposing building stood tall.","note":"\"World-fearing\" describes a person's characteristic, not an object. Use a different adjective to describe a building."}],"priority":"★★☆"},"related_words":{"derivatives":["fearful (形容詞: 恐ろしい、心配な)","fear (名詞: 恐怖、心配；動詞: 恐れる、心配する)","worldliness (名詞: 世俗性、世間慣れ)"],"phrases":["social anxiety","shyness","timidity"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Uncommon word)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"world-fearing\" is a relatively uncommon adjective that describes someone who is apprehensive or fearful of the world and social interactions. It implies a sense of timidity, shyness, or social anxiety. Due to its infrequent use, it is more likely to be encountered in literary or descriptive contexts rather than everyday conversation."},"example_sentences":[{"sentence":"The world-fearing child clung to his mother's leg, hesitant to approach the other children.","translation":"世間を恐れる子供は、他の子供たちに近づくのをためらい、母親の足にしがみついた。","type":"adjective","meaning_category":"世をはばかる"},{"sentence":"Despite her talent, her world-fearing disposition prevented her from pursuing a career in the performing arts.","translation":"才能があるにもかかわらず、彼女の世間を恐れる性格が、舞台芸術のキャリアを追求することを妨げた。","type":"adjective","meaning_category":"世をはばかる"},{"sentence":"He overcame his world-fearing tendencies by gradually exposing himself to social situations.","translation":"彼は徐々に社会的な状況に身を置くことで、世間を恐れる傾向を克服した。","type":"adjective","meaning_category":"世をはばかる"}]}