{"word":"Orientalist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"東洋学者、オリエンタリスト","english_definition":"A scholar of Oriental studies; a person specializing in the study of the Orient.","examples":[{"sentence":"He is a renowned Orientalist specializing in Japanese literature.","translation":"彼は日本文学を専門とする著名な東洋学者です。"},{"sentence":"The conference brought together Orientalists from around the world.","translation":"その会議には世界中の東洋学者が集まりました。"}],"collocations":["renowned Orientalist","leading Orientalist","prominent Orientalist"],"synonyms":["Asian scholar","Eastern scholar"],"antonyms":["Western scholar","Occidentalist"]},{"part_of_speech":"noun","definition":"オリエンタリズムの支持者、オリエンタリズム的な見方をする人","english_definition":"A person who adheres to the principles of Orientalism, often involving a romanticized or stereotypical view of the East.","examples":[{"sentence":"Critics accused the author of being an Orientalist for his portrayal of Asian cultures.","translation":"批評家たちは、著者のアジア文化の描写がオリエンタリズム的であると非難しました。"},{"sentence":"The film was criticized for its Orientalist stereotypes.","translation":"その映画はオリエンタリズム的なステレオタイプで批判されました。"}],"collocations":["critical Orientalist","naive Orientalist","Western Orientalist"],"synonyms":["stereotyper of the East","romanticizer of Asia"],"antonyms":["critic of Orientalism"]},{"part_of_speech":"adjective","definition":"オリエンタリズムの、東洋学の","english_definition":"Relating to Orientalism or Oriental studies.","examples":[{"sentence":"The museum has a large collection of Orientalist art.","translation":"その美術館はオリエンタリズム美術の膨大なコレクションを所蔵しています。"},{"sentence":"Orientalist paintings often depict scenes from the Middle East.","translation":"オリエンタリズム絵画は中東の風景を描写することが多いです。"}],"collocations":["Orientalist art","Orientalist literature","Orientalist perspective"],"synonyms":["Eastern","Asian"],"antonyms":["Western","Occidental"]}],"etymology":{"value":"The term 'Orientalist' comes from 'Oriental,' referring to the Orient (the East). It originated in the 18th century to describe scholars who studied Eastern languages, cultures, and history. In the late 20th century, particularly after Edward Said's 'Orientalism,' the term acquired a critical connotation, referring to the Western representation of the East in a romanticized, stereotypical, or patronizing way.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɔːriˈentəlɪst/","syllables":"Or-i-en-tal-ist"},"inflection":{"noun_plural":"Orientalists"},"usage_notes":{"explanation":"The term 'Orientalist' has two main senses. Originally, it referred to scholars who studied the languages, literature, history, and cultures of the Orient (the East). However, since the publication of Edward Said's 'Orientalism' in 1978, the term has often been used critically to describe a Western approach to the East that is seen as romanticizing, distorting, or stereotyping Eastern cultures. When using the term, it's important to be aware of this critical connotation and to clarify which sense is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an orientalist in the positive sense.","correct":"✓ He is an Orientalist in the original sense. / ✓ He is a scholar of Oriental studies.","note":"To avoid negative connotations, specify 'original sense' or use 'scholar of Oriental studies.'"},{"incorrect":"✗ The painting is very orientalist and beautiful.","correct":"✓ The painting is in the Orientalist style and beautiful. / ✓ The painting reflects Orientalist themes and is beautiful.","note":"Use 'in the Orientalist style' or 'reflects Orientalist themes' to be more precise."}],"priority":"★★☆"},"related_words":{"derivatives":["Orientalism","Oriental","Orient"],"related_terms":["Occidentalist","Occidentalism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Orientalist' can be tricky because it has two meanings. One is a neutral term for someone who studies the East. The other, more common today, is a critical term for someone who presents the East in a stereotypical or biased way, often based on Western assumptions. Be careful which meaning you intend when you use this word. It's often safer to use 'scholar of Oriental studies' or 'person who studies Asian cultures' if you want to avoid the negative meaning.","priority":"★★★"},"example_sentences":[{"sentence":"The museum features works by both Eastern artists and Western **Orientalist** painters.","translation":"その美術館には、東洋の芸術家と西洋のオリエンタリストの画家による作品が展示されています。","type":"adjective","meaning_category":"オリエンタリズムの"},{"sentence":"As an **Orientalist**, he dedicated his life to understanding Chinese philosophy.","translation":"東洋学者として、彼は中国哲学の理解に生涯を捧げました。","type":"noun","meaning_category":"東洋学者"},{"sentence":"The book critiques the **Orientalist** perspective in Western literature.","translation":"その本は、西洋文学におけるオリエンタリズム的な視点を批判しています。","type":"adjective","meaning_category":"オリエンタリズムの"},{"sentence":"She challenged the **Orientalist** assumptions in the historical narrative.","translation":"彼女は歴史的記述におけるオリエンタリズム的な前提に異議を唱えました。","type":"adjective","meaning_category":"オリエンタリズムの"}]}