{"word":"flat-foot","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"扁平足","english_definition":"A condition in which the arch of the foot collapses, with the entire sole of the foot coming into complete or near-complete contact with the ground.","examples":[{"sentence":"He developed flat-foot after years of standing for long hours at work.","translation":"彼は長年仕事で立ち続けた結果、扁平足になった。"},{"sentence":"Flat-foot can cause pain in the feet, ankles, and knees.","translation":"扁平足は足、足首、膝に痛みをもたらすことがある。"}],"collocations":["have flat-foot","develop flat-foot","treat flat-foot","severe flat-foot","flexible flat-foot"],"synonyms":["pes planus","fallen arches"],"antonyms":["arched foot","high arches"]},{"part_of_speech":"noun","definition":"(軽蔑的な意味で)警官、特に制服警官","english_definition":"(derogatory) A police officer, especially one in uniform.","examples":[{"sentence":"The flat-foot told us to move along.","translation":"その警官は私たちに立ち去るように言った。"},{"sentence":"Watch out, there's a flat-foot on the corner.","translation":"気をつけろ、角に警官がいるぞ。"}],"collocations":["local flat-foot","beat flat-foot"],"synonyms":["cop","officer","police officer","law enforcement"],"antonyms":[]}],"etymology":{"value":"The term 'flat-foot' likely originated from the observation that people with pes planus (flat feet) have feet that appear 'flat' when standing. The derogatory slang term for a police officer may have arisen from the perception that police officers, especially those on foot patrol, often suffered from flat feet due to long hours of walking and standing.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈflæt.fʊt/","syllables":"flat-foot"},"inflection":{"noun_plural":"flat-feet"},"usage_notes":{"explanation":"The term 'flat-foot' has two distinct meanings: a medical condition (pes planus) and a derogatory term for a police officer. The medical term is straightforward and refers to the physical condition of having collapsed foot arches. The slang term for a police officer is considered offensive and should be used with caution, if at all.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a flat foot.","correct":"✓ He has flat feet. / ✓ He has flat-foot.","note":"When referring to the condition of having flat feet, use the plural 'flat feet' or the singular noun 'flat-foot'."},{"incorrect":"✗ The flat-foot was very kind and helpful.","correct":"✓ The police officer was very kind and helpful.","note":"Using 'flat-foot' to refer to a police officer can be offensive. It's better to use neutral terms like 'police officer' or 'officer'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_medical_terms":["pronation","supination","orthotics","arch support"],"related_police_slang_terms":["pig","the fuzz","the heat"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (medical context), C1 (slang context)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Flat-foot' has two main meanings. One is a medical term for a condition where the arch of the foot collapses. The other is a slang term for a police officer, which is often considered offensive. Understanding the context is important to know which meaning is intended. The medical term is more common in discussions about health, while the slang term is less common and should be used carefully."},"example_sentences":[{"sentence":"Wearing arch supports can help alleviate the symptoms of flat-foot.","translation":"土踏まずのサポートを着用すると、扁平足の症状を緩和するのに役立ちます。","type":"noun","meaning_category":"medical condition"},{"sentence":"The old movies often portrayed flat-feet as bumbling and incompetent.","translation":"昔の映画では、警官はドジで無能な人物として描かれることが多かった。","type":"noun","meaning_category":"derogatory term for police officer"}]}