{"word":"refraction","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"屈折","english_definition":"The change in direction of a wave passing from one medium to another or from a gradual change in the medium.","examples":[{"sentence":"The refraction of light through a prism creates a rainbow.","translation":"プリズムを通る光の屈折が虹を作り出す。"},{"sentence":"Atmospheric refraction can cause stars to appear higher in the sky than they actually are.","translation":"大気による屈折は、星が実際よりも空高くに見える原因となることがある。"},{"sentence":"The refraction of sound waves can affect how far sound travels.","translation":"音波の屈折は、音が伝わる距離に影響を与えることがある。"}],"collocations":["angle of refraction (屈折角)","index of refraction (屈折率)","atmospheric refraction (大気屈折)","refraction of light (光の屈折)","refraction of sound (音の屈折)"],"synonyms":["bending","deflection","distortion"],"antonyms":[]}],"etymology":{"value":"From Latin refractio, from refractus, past participle of refringere ('to break back, break open'), from re- ('back') + frangere ('to break').","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈfrækʃən/","syllables":"re-frac-tion"},"inflection":{"noun_plural":"refractions"},"usage_notes":{"explanation":"'Refraction' specifically refers to the bending of waves (such as light or sound) as they pass from one medium to another, or through a medium with a changing density. It's a key concept in physics and optics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The reflection caused the image to be distorted.","correct":"✓ The refraction caused the image to be distorted.","note":"'Reflection' is when a wave bounces off a surface, while 'refraction' is when a wave bends as it passes through a medium. Use 'refraction' when describing the bending of light or sound."}],"priority":"★☆☆"},"related_words":{"derivatives":["refract (verb: to subject to refraction)","refractive (adjective: relating to refraction)","refractor (noun: a lens or prism that refracts light)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Refraction' is a term used in physics to describe how waves, like light or sound, change direction when they move from one substance to another. This bending happens because the speed of the wave changes. It's important for understanding how lenses work and why things sometimes look distorted when viewed through water or air.","priority":"★☆☆"},"example_sentences":[{"sentence":"The **refraction** of light through water makes objects appear larger.","translation":"水を通る光の屈折により、物体が大きく見える。","type":"general","meaning_category":"general"},{"sentence":"Scientists study **refraction** to understand the properties of different materials.","translation":"科学者たちは、様々な物質の特性を理解するために屈折を研究する。","type":"scientific","meaning_category":"scientific"},{"sentence":"The **refraction** of radio waves can affect communication signals.","translation":"電波の屈折は、通信信号に影響を与えることがある。","type":"technical","meaning_category":"technical"}]}