{"word":"preternaturalism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"超自然主義；自然法則を超える現象や存在を信じること","english_definition":"The belief in phenomena or beings that transcend the laws of nature; belief in the preternatural.","examples":[{"sentence":"Preternaturalism often involves belief in angels, demons, and other spiritual entities.","translation":"超自然主義はしばしば天使、悪魔、その他の霊的存在への信仰を伴う。"},{"sentence":"His writings explore the intersection of science and preternaturalism.","translation":"彼の著作は科学と超自然主義の交差点を考察している。"}],"collocations":["belief in preternaturalism","study of preternaturalism","preternaturalism and religion","preternaturalism and science"],"synonyms":["supernaturalism","spiritualism","paranormalism"],"antonyms":["naturalism","materialism","atheism"]}],"etymology":{"value":"\"Preternaturalism\" is derived from \"preternatural,\" which comes from the Latin \"praeter naturam,\" meaning \"beyond nature.\" The suffix \"-ism\" denotes a belief system or doctrine.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːtərˈnætʃərəlɪzəm/","syllables":"pree-ter-nat-u-ral-i-zem"},"inflection":{"noun_plural":"preternaturalisms (rarely used)"},"usage_notes":{"explanation":"\"Preternaturalism\" refers to a belief system that accepts phenomena beyond the scope of what is considered natural or scientifically explainable. It often involves a belief in spiritual entities or forces that can influence the natural world. It is similar to supernaturalism, but some distinguish preternaturalism as relating to phenomena that are outside of, but do not necessarily violate, natural laws, while supernaturalism involves phenomena that violate natural laws.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practices preternaturalism as a hobby.","correct":"✓ He is interested in preternaturalism.","note":"Preternaturalism is a belief system, not a practice. One can be interested in or believe in preternaturalism, but not 'practice' it. Instead, one might practice rituals associated with a preternatural belief system."},{"incorrect":"✗ Preternaturalism is the same as science.","correct":"✓ Preternaturalism is distinct from science.","note":"Preternaturalism is based on beliefs that go beyond the natural world and scientific explanation, while science is based on empirical evidence and observation of the natural world."}],"priority":"★☆☆"},"related_words":{"derivatives":["preternatural (adjective: beyond what is natural or normal)","preternaturally (adverb: in a preternatural manner)"],"related_terms":["supernatural","paranormal","spiritualism","occultism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - a relatively uncommon term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Preternaturalism\" is a term that refers to the belief in things that exist outside of the natural world and cannot be explained by science. It's a complex concept often discussed in philosophy, religion, and literature. Understanding this term requires a good grasp of abstract ideas and the ability to differentiate between natural and supernatural phenomena. It is not a commonly used word.","priority":"★☆☆"},"example_sentences":[{"sentence":"The author explored themes of preternaturalism in his gothic novel.","translation":"その作家はゴシック小説で超自然主義のテーマを探求した。","type":"general","meaning_category":"belief system"},{"sentence":"The debate between science and preternaturalism continues to this day.","translation":"科学と超自然主義の間の議論は今日まで続いている。","type":"general","meaning_category":"belief system"},{"sentence":"Some cultures have a strong tradition of preternaturalism, with stories of spirits and magic interwoven into daily life.","translation":"いくつかの文化には超自然主義の強い伝統があり、精霊や魔法の物語が日常生活に織り込まれている。","type":"general","meaning_category":"belief system"}]}