{"word":"Mongolioid","priority":"低","meanings":[{"part_of_speech":"名詞, 形容詞","definition":"(人類学において、現在は非推奨) モンゴロイド。かつての人種分類における、東アジア、東南アジア、シベリア、北極圏、アメリカ先住民などの人々を指す言葉。","english_definition":"(Anthropology, now deprecated) A term formerly used to refer to a racial classification of humans, including populations from East Asia, Southeast Asia, Siberia, the Arctic, and the indigenous peoples of the Americas.","examples":[{"sentence":"The term 'Mongolioid' is now considered outdated and offensive.","translation":"「モンゴロイド」という言葉は、現在では時代遅れで侮辱的であると考えられています。"},{"sentence":"Historically, Mongoloid traits were used to classify certain populations.","translation":"歴史的に、モンゴロイドの特徴は、特定の人々を分類するために使用されていました。"}],"collocations":[],"synonyms":["Asian","East Asian","Mongoloid race (非推奨)"],"antonyms":["Caucasoid","Negroid"],"notes":"この用語は、科学的根拠が薄弱であり、人種差別的な意味合いを含むため、現代の人類学では使用されません。"}],"etymology":{"value":"'Mongol'（モンゴル人）と '-oid'（～のような）を組み合わせた言葉。19世紀に人種分類のために作られた。","priority":"中"},"pronunciation":{"ipa":"/mɒŋˈɡɒlɔɪd/","syllables":"Mon-gol-oid"},"inflection":{"noun_plural":"Mongolioids"},"usage_notes":{"explanation":"この用語は、人種分類において歴史的に使用されていましたが、現代では科学的妥当性がなく、差別的な意味合いを持つため、使用は避けるべきです。より正確で尊重的な表現を使用することが推奨されます。","priority":"高"},"common_mistakes":{"examples":[{"incorrect":"✗ It is accurate to describe someone as Mongoloid.","correct":"✓ It is not accurate or respectful to describe someone as Mongoloid.","note":"この用語は、人種差別的な意味合いを持つため、使用すべきではありません。"}],"priority":"高"},"related_words":{"derivatives":["Mongol","-oid"],"related_terms":["Race","Ethnicity","Human variation"]},"level_frequency":{"frequency_google_ngram":"中","CEFR":"不明"},"readability_explanation":{"level":"高","text":"この用語は、人類学の歴史的な文脈で登場しますが、現代では差別的な意味合いを持つため、使用は推奨されません。この単語に出会った場合は、その歴史的背景と現代における不適切さを理解することが重要です。"},"example_sentences":[{"sentence":"The use of the term 'Mongolioid' is now widely discouraged in scientific and social contexts.","translation":"「モンゴロイド」という用語の使用は、現在では科学的および社会的な文脈で広く推奨されていません。","type":"説明","meaning_category":"説明"}]}