{"word":"buphthalmic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"牛眼の、牛眼症の","english_definition":"Relating to or affected by buphthalmos (abnormal enlargement of the eyeball).","examples":[{"sentence":"The child was diagnosed with buphthalmic glaucoma.","translation":"その子供は牛眼緑内障と診断された。"},{"sentence":"Buphthalmic changes can be observed in advanced cases of congenital glaucoma.","translation":"牛眼症の変化は、先天性緑内障の進行した症例で観察されることがある。"}],"collocations":["buphthalmic glaucoma (牛眼緑内障)","buphthalmic eye (牛眼)"],"synonyms":["megalophthalmos","hydrophthalmos"],"antonyms":[]}],"etymology":{"value":"From Greek 'bous' (ox) + 'ophthalmos' (eye), referring to the enlarged appearance of the eye resembling that of an ox.","priority":"★★☆"},"pronunciation":{"ipa":"/bʊfˈθælmɪk/","syllables":"buf-THAL-mik"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Buphthalmic' is a technical term used in ophthalmology to describe the condition of buphthalmos, characterized by an abnormal enlargement of the eyeball, often due to congenital glaucoma. It is primarily used in medical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient's eyes were buphthalmic and painful.","correct":"✓ The patient had buphthalmos, and his eyes were painful.","note":"'Buphthalmic' is an adjective describing the condition, not a direct descriptor of the eyes themselves. It's better to say the patient 'had buphthalmos' or 'presented with buphthalmos'."}],"priority":"★☆☆"},"related_words":{"derivatives":["buphthalmos (noun: 牛眼症)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (Technical/Medical)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Buphthalmic' is a specialized medical term referring to the condition of buphthalmos, which is an abnormal enlargement of the eyeball. This term is primarily used in ophthalmology and is not commonly encountered in general language. Understanding this word requires knowledge of medical terminology.","priority":"★☆☆"},"example_sentences":[{"sentence":"The veterinarian noted buphthalmic changes in the calf's left eye.","translation":"獣医は子牛の左目に牛眼症の変化を認めた。","type":"adjective","meaning_category":"牛眼の"},{"sentence":"Early diagnosis is crucial in managing buphthalmic glaucoma to prevent further vision loss.","translation":"さらなる視力喪失を防ぐためには、牛眼緑内障の早期診断が重要である。","type":"adjective","meaning_category":"牛眼症の"}]}