{"word":"harlequinize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"道化師のようにする、道化師の衣装を着せる、道化芝居風にする","english_definition":"To make like a harlequin; to dress in the costume of a harlequin; to make something resemble a harlequinade.","examples":[{"sentence":"The stage was harlequinized with bright colors and exaggerated props.","translation":"舞台は鮮やかな色彩と誇張された小道具で道化芝居のように飾られていた。"},{"sentence":"The children harlequinized themselves for the costume party.","translation":"子供たちは仮装パーティーのために道化師の衣装を着た。"}],"collocations":["harlequinize a stage","harlequinize a costume","harlequinize an event"],"synonyms":["decorate","adorn","embellish","disguise","masquerade"],"antonyms":["simplify","plain","undress"]}],"etymology":{"value":"From 'harlequin' (a masked character in traditional pantomime) + '-ize' (a suffix indicating to make or become).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɑːrləˈkwɪnaɪz/","syllables":"har-le-quin-ize"},"inflection":{"verb_forms":{"present_simple":["harlequinize","harlequinizes"],"past_simple":"harlequinized","past_participle":"harlequinized","present_participle":"harlequinizing"}},"usage_notes":{"explanation":"'Harlequinize' is a relatively rare verb that means to transform something or someone to resemble a harlequin, often involving bright colors, patchwork patterns, or theatrical elements. It can also mean to make something resemble a harlequinade, a type of comedic theatrical performance.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artist harlequinized the painting with realistic details.","correct":"✓ The artist harlequinized the painting with fantastical and exaggerated details.","note":"Harlequinizing typically involves exaggeration and fantasy, not realism."}],"priority":"★☆☆"},"related_words":{"derivatives":["harlequin (noun)","harlequinade (noun)"],"phrases":["harlequin pattern","harlequin costume"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Harlequinize' is a rare and specialized verb. It describes the act of making something resemble a harlequin, a character from traditional pantomime known for colorful, patterned costumes and comedic performances. Understanding this word requires familiarity with the harlequin character and theatrical traditions."},"example_sentences":[{"sentence":"The design team decided to harlequinize the storefront to attract attention.","translation":"デザインチームは注目を集めるために、店の正面を道化師風に飾ることにした。","type":"verb","meaning_category":"decorate"},{"sentence":"The actors harlequinized their faces with bold makeup for the performance.","translation":"俳優たちは公演のために、大胆なメイクで顔を道化師のようにした。","type":"verb","meaning_category":"disguise"}]}