{"word":"colorable","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(法律)一見もっともらしい、見せかけだけの、名ばかりの","english_definition":"(law) appearing to be true or valid but actually false or invalid; plausible but ultimately deceptive.","examples":[{"sentence":"The company presented a colorable claim of ownership, but it lacked sufficient evidence to support it.","translation":"その会社は一見もっともらしい所有権の主張を提示したが、それを裏付ける十分な証拠がなかった。"},{"sentence":"The argument was colorable, designed to mislead the court.","translation":"その議論は見せかけだけで、裁判所を欺くように仕組まれていた。"},{"sentence":"He had a colorable excuse for being late, but no one believed him.","translation":"彼には遅刻に対するもっともらしい言い訳があったが、誰も信じなかった。"}],"collocations":["colorable claim","colorable title","colorable excuse","colorable argument","colorable pretense"],"synonyms":["plausible","specious","ostensible","superficial","illusory","deceptive","sham"],"antonyms":["genuine","authentic","bona fide","valid","legitimate","real","sincere"]},{"part_of_speech":"adjective","definition":"着色可能な、染色可能な","english_definition":"capable of being colored or dyed.","examples":[{"sentence":"This fabric is easily colorable with natural dyes.","translation":"この生地は天然染料で簡単に着色できる。"},{"sentence":"The plastic material is colorable, allowing for a wide range of product designs.","translation":"そのプラスチック素材は着色可能で、幅広い製品デザインに対応できる。"}],"collocations":["colorable fabric","colorable material","easily colorable"],"synonyms":["dyeable","tintable","stainable"],"antonyms":["non-colorable","non-dyeable"]}],"etymology":{"value":"From 'color' + '-able'. The legal sense likely derives from the idea of something having the appearance of legality or validity, like something 'colored' to look a certain way.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkʌlərəbəl/","syllables":"col-or-a-ble"},"inflection":{"adjective_forms":{"comparative":"more colorable","superlative":"most colorable"}},"usage_notes":{"explanation":"The word 'colorable' has two distinct meanings. In a legal context, it describes something that appears valid or legitimate on the surface but is actually false or deceptive. In a more general sense, it means capable of being colored or dyed. The legal meaning is more common in formal or legal writing, while the coloring meaning is used in contexts related to materials and manufacturing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The painting was very colorable.","correct":"✓ The painting was very colorful.","note":"'Colorable' (capable of being colored) is often confused with 'colorful' (full of color)."},{"incorrect":"✗ He had a colorable alibi.","correct":"✓ He had a colorable excuse.","note":"In the legal sense, 'colorable' is often used with words like 'claim,' 'title,' or 'excuse.'"}],"priority":"★★☆"},"related_words":{"derivatives":["colorability (noun): the quality of being colorable"],"related_terms":["color (noun/verb): the property possessed by an object of producing different sensations on the eye as a result of the way the object reflects or emits light.","coloration (noun): the appearance of something with regard to color."]},"level_frequency":{"CEFR":"C2 (legal sense), B2 (coloring sense)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Colorable' is a word with two main meanings. The first, and more common in legal contexts, means something that appears to be true or valid but is actually false or misleading. Think of it as something that is 'colored' to look legitimate. The second, less common meaning, simply means capable of being colored or dyed. It's important to understand the context to determine which meaning is intended. The legal sense is more abstract and requires a higher level of vocabulary understanding."},"example_sentences":[{"sentence":"The lawyer argued that the contract was a colorable attempt to avoid taxes.","translation":"弁護士は、その契約は税金を回避するための見せかけの試みであると主張した。","type":"adjective","meaning_category":"legal"},{"sentence":"The artist used a colorable clay to create vibrant sculptures.","translation":"その芸術家は、鮮やかな彫刻を作るために着色可能な粘土を使用した。","type":"adjective","meaning_category":"coloring"},{"sentence":"The politician offered a colorable explanation for his actions, but the public remained skeptical.","translation":"政治家は彼の行動に対するもっともらしい説明を提示したが、大衆は懐疑的なままだった。","type":"adjective","meaning_category":"legal"},{"sentence":"This type of wood is highly colorable and takes stain well.","translation":"この種類の木材は着色性が高く、ステインがよく染み込む。","type":"adjective","meaning_category":"coloring"}]}