{"word":"callusing","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(皮膚が)胼胝(たこ)になること、または胼胝を形成すること。","english_definition":"The process of skin developing calluses, or forming a callus.","examples":[{"sentence":"The constant friction caused callusing on her hands.","translation":"絶え間ない摩擦が彼女の手に胼胝を形成させた。"},{"sentence":"Callusing is a natural response to repeated pressure.","translation":"胼胝の形成は、繰り返される圧力に対する自然な反応である。"}],"collocations":["prevent callusing","reduce callusing","promote callusing"],"synonyms":["hardening","thickening","induration"],"antonyms":["softening","thinning"]},{"part_of_speech":"noun","definition":"胼胝(たこ)ができること、またはその状態。","english_definition":"The formation or presence of calluses.","examples":[{"sentence":"Callusing of the fingertips is common among guitar players.","translation":"ギター奏者の間では、指先の胼胝形成はよく見られる。"},{"sentence":"Proper gloves can minimize callusing during weightlifting.","translation":"適切な手袋は、重量挙げ中の胼胝形成を最小限に抑えることができる。"}],"collocations":["degree of callusing","extent of callusing","minimize callusing"],"synonyms":["callus formation","thickening","hardening"],"antonyms":["softening","thinning"]}],"etymology":{"value":"The word \"callusing\" is derived from the word \"callus,\" which comes from the Latin word \"callus\" meaning \"hard skin.\" The suffix \"-ing\" indicates a process or action.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈkæləsɪŋ/","syllables":"cal-lus-ing"},"inflection":{"verb_forms":{"present_participle":"callusing","gerund":"callusing"},"noun_plural":"callusings"},"usage_notes":{"explanation":"\"Callusing\" refers to the process of developing calluses, which are thickened and hardened areas of skin that form in response to repeated friction, pressure, or irritation. It can be used as a verb (in its present participle form) or as a noun.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The callusing is pain.","correct":"✓ The callusing is painful.","note":"\"Callusing\" refers to the process or state, while \"painful\" describes the sensation. Use \"painful\" to describe the sensation caused by calluses."},{"incorrect":"✗ He has a callusing on his foot.","correct":"✓ He has calluses on his foot.","note":"\"Callusing\" is the process or state. Use \"calluses\" (plural of \"callus\") to refer to the hardened areas of skin themselves."}],"priority":"☆☆☆"},"related_words":{"derivatives":["callus","calloused"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term \"callusing\" is a technical term related to dermatology and biology. It describes the process by which skin becomes thickened and hardened due to repeated friction or pressure. It is often used in contexts related to physical activities, occupations, or medical conditions that involve repetitive stress on the skin. Understanding this word requires a good command of scientific or medical vocabulary."},"example_sentences":[{"sentence":"Regular guitar practice led to significant callusing on his fingertips.","translation":"定期的なギターの練習は、彼の指先に著しい胼胝形成をもたらした。","type":"noun","meaning_category":"Process of forming calluses"},{"sentence":"The gardener's hands showed evidence of years of callusing from working with tools.","translation":"庭師の手は、道具を使った長年の作業による胼胝形成の証拠を示していた。","type":"noun","meaning_category":"State of having calluses"},{"sentence":"To prevent callusing, wear gloves when handling rough materials.","translation":"胼胝形成を防ぐためには、粗い素材を扱う際に手袋を着用してください。","type":"noun","meaning_category":"Prevention of callus formation"},{"sentence":"The athlete's feet were prone to callusing due to the constant impact during running.","translation":"その運動選手は、ランニング中の絶え間ない衝撃のために、足に胼胝ができやすかった。","type":"noun","meaning_category":"Tendency to form calluses"}]}