{"word":"cryogens","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"極低温物質、クライオジェン","english_definition":"Substances used to produce very low temperatures.","examples":[{"sentence":"Liquid nitrogen and liquid helium are common cryogens.","translation":"液体窒素と液体ヘリウムは一般的なクライオジェンです。"},{"sentence":"Cryogens are used in various applications, including MRI machines and the preservation of biological samples.","translation":"クライオジェンは、MRI装置や生物学的サンプルの保存など、さまざまな用途で使用されています。"}],"collocations":["liquid cryogens","cryogen storage","cryogen tank"],"synonyms":["refrigerant","coolant"],"antonyms":["heat source"]}],"etymology":{"value":"The word \"cryogen\" comes from the Greek words \"κρύος\" (kryos), meaning \"icy cold,\" and \"γενής\" (genēs), meaning \"producing.\"","priority":"★★☆"},"pronunciation":{"ipa":"ˈkraɪəˌdʒɛnz","syllables":"cry-o-gens"},"inflection":{"noun_plural":"cryogens"},"usage_notes":{"explanation":"Cryogens are substances that are used to achieve and maintain extremely low temperatures, typically below -150°C (-238°F). They are often used in scientific research, medicine, and industry for various applications that require such low temperatures.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Cryogen is used for cooling.","correct":"✓ Cryogens are used for cooling.","note":"Since it is often used in plural form, it is better to use cryogens."}],"priority":"★★☆"},"related_words":{"derivatives":["cryogenic (adjective)","cryogenics (noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Cryogens\" are substances used to create very cold temperatures. They're used in science, medicine, and industry. Common examples include liquid nitrogen and helium. The word itself comes from Greek roots meaning \"icy cold\" and \"producing.\" Understanding this term is useful in contexts involving low-temperature applications."},"example_sentences":[{"sentence":"The laboratory uses cryogens to maintain the integrity of biological samples.","translation":"その研究室では、生物学的サンプルの完全性を維持するためにクライオジェンを使用しています。","type":"noun","meaning_category":"極低温物質"},{"sentence":"Proper handling of cryogens is essential to prevent burns and other hazards.","translation":"クライオジェンの適切な取り扱いは、火傷やその他の危険を防ぐために不可欠です。","type":"noun","meaning_category":"極低温物質"}]}