{"word":"hydroperitoneum","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"腹水","english_definition":"The accumulation of serous fluid in the peritoneal cavity.","examples":[{"sentence":"The patient was diagnosed with hydroperitoneum due to liver failure.","translation":"患者は肝不全による腹水と診断された。"},{"sentence":"Hydroperitoneum can be a sign of various underlying medical conditions.","translation":"腹水は様々な基礎疾患の兆候となりうる。"}],"collocations":["ascites due to hydroperitoneum","treatment for hydroperitoneum"],"synonyms":["ascites","peritoneal effusion"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'hydro-' (water), 'peritoneum' (the membrane lining the abdominal cavity).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪdroʊˌpɛrɪtəˈniːəm/","syllables":"hy-dro-per-i-to-ne-um"},"inflection":{"noun_plural":"hydroperitoneums"},"usage_notes":{"explanation":"'Hydroperitoneum' is a medical term referring specifically to the presence of serous fluid in the peritoneal cavity. It's often used interchangeably with 'ascites,' though ascites can also refer to fluid accumulation due to other causes, such as blood or pus.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor said he had hydroperitoneum in his lungs.","correct":"✓ The doctor said he had hydroperitoneum in his abdomen.","note":"Hydroperitoneum specifically refers to fluid in the abdominal cavity (peritoneal cavity), not the lungs."}],"priority":"★★☆"},"related_words":{"derivatives":["peritoneal","peritonitis"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hydroperitoneum' is a highly specialized medical term. Understanding it requires knowledge of medical terminology, specifically relating to the anatomy of the abdomen and the nature of fluid imbalances within the body. It is not a term commonly used outside of medical contexts."},"example_sentences":[{"sentence":"Diagnostic paracentesis was performed to analyze the fluid from the hydroperitoneum.","translation":"腹水から採取した体液を分析するために、診断的腹腔穿刺が行われた。","type":"medical","meaning_category":"fluid accumulation"},{"sentence":"The severity of the hydroperitoneum was assessed using ultrasound imaging.","translation":"腹水の重症度は、超音波画像検査を用いて評価された。","type":"medical","meaning_category":"fluid accumulation"}]}