{"word":"nonenviably","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"うらやましくないほどに、羨望の的ではないほどに","english_definition":"in a way that does not inspire envy or is not desirable.","examples":[{"sentence":"He was nonenviably stuck with the task of cleaning up the mess.","translation":"彼はうらやましくないことに、その散らかった場所を片付けるという仕事に縛り付けられた。"},{"sentence":"She found herself nonenviably in the position of having to deliver the bad news.","translation":"彼女は羨望の的ではないことに、悪い知らせを伝えなければならない立場にいることに気づいた。"}],"collocations":["nonenviably stuck","nonenviably in the position","nonenviably saddled"],"synonyms":["undesirably","unattractively","unfavorably"],"antonyms":["enviably","desirably","favorably"]}],"etymology":{"value":"'non-' (否定の接頭辞) + 'enviably' (羨ましく)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈɛnviəbli/","syllables":"non-en-vi-a-bly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"'Nonenviably' is used to describe situations or conditions that are undesirable or not to be envied. It emphasizes that something is not something one would want to experience or possess. It is often used to describe tasks, positions, or circumstances that are difficult, unpleasant, or unfortunate.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She was nonenviable in her new role.","correct":"✓ She was nonenviably in her new role.","note":"'nonenviable' is an adjective, while 'nonenviably' is an adverb. Make sure to use the correct form to modify the appropriate part of speech."}],"priority":"★★☆"},"related_words":{"derivatives":["enviable (adjective: 羨ましい)","enviably (adverb: 羨ましく)","envy (noun: 羨望; verb: 羨む)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonenviably\" means in a way that is not desirable or does not inspire envy. It's used to describe situations or conditions that are unpleasant or unfortunate. It's not a common word, so it's more likely to be found in formal writing or speech.","priority":"★★☆"},"example_sentences":[{"sentence":"The junior employee was nonenviably tasked with cleaning the office kitchen every Friday.","translation":"その新入社員は、うらやましくないことに毎週金曜日にオフィスのキッチンを掃除する仕事を任された。","type":"adverb","meaning_category":"Undesirable task"},{"sentence":"The small business owner found herself nonenviably in debt after the economic downturn.","translation":"その中小企業のオーナーは、景気後退後、うらやましくないことに借金を抱えていることに気づいた。","type":"adverb","meaning_category":"Unfortunate situation"}]}