{"word":"catadioptric","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(光学系が)反射屈折式の","english_definition":"(of an optical system) using both reflection and refraction.","examples":[{"sentence":"A catadioptric lens combines lenses and mirrors.","translation":"反射屈折レンズはレンズと鏡を組み合わせたものです。"},{"sentence":"Catadioptric systems are often used in telescopes.","translation":"反射屈折式システムは望遠鏡によく使用されます。"}],"collocations":["catadioptric lens","catadioptric telescope","catadioptric system"],"synonyms":["reflective-refractive"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'kata' (downward, against), 'dioptra' (an instrument for measuring angles), and 'optikos' (relating to sight).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkætədɪˈɒptrɪk/","syllables":"ca-ta-di-op-tric"},"inflection":{"notes":"This word does not have common inflections."},"usage_notes":{"explanation":"'Catadioptric' is a technical term primarily used in optics and astronomy. It describes optical systems that achieve image formation using both lenses (refraction) and mirrors (reflection). These systems are often used where a long focal length is required in a compact design, such as in certain types of telescopes and camera lenses.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The camera has a catatropic lens.","correct":"✓ The camera has a catadioptric lens.","note":"'Catatropic' is not the correct term; the correct adjective is 'catadioptric'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["dioptric","refraction","reflection","optics"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'catadioptric' is a highly specialized term primarily encountered in the fields of optics, astronomy, and photography. It describes systems that combine both lenses (refraction) and mirrors (reflection) to form an image. Due to its technical nature, it is not commonly used in everyday language and is typically found in scientific or technical contexts. Understanding requires a basic knowledge of optical principles.","priority":"★★☆"},"example_sentences":[{"sentence":"The Schmidt-Cassegrain telescope is a popular example of a catadioptric design.","translation":"シュミットカセグレン式望遠鏡は、反射屈折式設計の一般的な例です。","type":"general","meaning_category":"description"},{"sentence":"Catadioptric lenses offer a compact alternative to traditional telephoto lenses.","translation":"反射屈折レンズは、従来の望遠レンズに代わるコンパクトな代替手段を提供します。","type":"general","meaning_category":"description"}]}