{"word":"Bombacaceae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"パンヤ科（APG体系ではアオイ科に含む）","english_definition":"A family of flowering plants now included in the Malvaceae (mallow) family by the APG system. It formerly included genera such as Bombax (the type genus), Ceiba, Durio, and Adansonia.","examples":[{"sentence":"The Bombacaceae family is known for its large trees and distinctive fruits.","translation":"パンヤ科はその大きな木と特徴的な果実で知られています。"}],"collocations":[],"synonyms":["Malvaceae (in APG system)"],"antonyms":[]}],"etymology":{"value":"Formed from the genus name 'Bombax' + '-aceae' (standard suffix for plant families).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbɒmbəˈkeɪsiːˌaɪ/","syllables":"Bom-ba-ca-ce-ae"},"inflection":{"noun_plural":"Bombacaceaes / Bombacaceae"},"usage_notes":{"explanation":"The Bombacaceae family is no longer recognized as a distinct family in the APG (Angiosperm Phylogeny Group) system of plant classification. Genera formerly placed in Bombacaceae are now included in the Malvaceae (mallow) family. The name may still be encountered in older botanical literature.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Bombax (genus)","Ceiba (genus)","Durio (genus)","Adansonia (genus)"],"priority":"★★☆"},"level_frequency":{},"readability_explanation":{"level":"C2","text":"'Bombacaceae' is a botanical term referring to a plant family. It is primarily used in scientific contexts, specifically in botany and related fields. The term is less common in general language. Understanding requires knowledge of plant taxonomy."},"example_sentences":[{"sentence":"In older classifications, the baobab tree (Adansonia) was placed in the Bombacaceae family.","translation":"古い分類では、バオバブの木（Adansonia）はパンヤ科に分類されていました。","type":"noun","meaning_category":"植物学"},{"sentence":"The APG system reclassified many genera of Bombacaceae into the Malvaceae family.","translation":"APG体系では、パンヤ科の多くの属がアオイ科に再分類されました。","type":"noun","meaning_category":"植物学"}]}