{"word":"cryptogenous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"原因不明の、起源が隠されている","english_definition":"Of unknown or obscure origin; having a hidden or concealed origin.","examples":[{"sentence":"The disease was cryptogenous, with no clear cause identified.","translation":"その病気は原因不明で、明確な原因は特定されなかった。"},{"sentence":"The cryptogenous nature of the phenomenon made it difficult to study.","translation":"その現象の原因不明な性質が、研究を困難にした。"}],"collocations":["cryptogenous disease (原因不明の病気)","cryptogenous origin (隠された起源)","cryptogenous infection (原因不明の感染症)"],"synonyms":["idiopathic","obscure","unexplained","hidden","latent"],"antonyms":["known","obvious","evident","clear","manifest"]}],"etymology":{"value":"Derived from the Greek words 'crypto-' (meaning hidden or concealed) and '-genous' (meaning produced or originated).","priority":"★★★"},"pronunciation":{"ipa":"/krɪpˈtɒdʒənəs/","syllables":"crypt-o-ge-nous"},"inflection":{"notes":"Adjective, no specific inflectional forms other than comparative/superlative (more cryptogenous, most cryptogenous)."},"usage_notes":{"explanation":"The term 'cryptogenous' is often used in medical or scientific contexts to describe conditions or phenomena where the cause or origin is not readily apparent or has not yet been discovered. It implies a sense of mystery or obscurity surrounding the source or genesis of something.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cryptogenous solution was easily identified.","correct":"✓ The cause of the problem, initially cryptogenous, was eventually identified.","note":"'Cryptogenous' implies the cause is initially unknown. Once identified, it's no longer appropriate to use this term."}],"priority":"★★☆"},"related_words":{"derivatives":["cryptogenesis (noun: the origin or generation of something hidden or obscure)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency. Specialized or technical vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Cryptogenous' is a specialized term primarily used in scientific or medical contexts. It describes something whose origin or cause is unknown or hidden. Understanding this word requires a strong vocabulary and familiarity with technical language. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The etiology of the cryptogenous stroke remained a mystery despite extensive testing.","translation":"広範な検査にもかかわらず、原因不明の脳卒中の病因は謎のままだった。","type":"medical","meaning_category":"cause unknown"},{"sentence":"Researchers investigated the cryptogenous factors contributing to the decline in bee populations.","translation":"研究者たちは、ミツバチの個体数減少に寄与する原因不明の要因を調査した。","type":"scientific","meaning_category":"obscure origin"}]}