{"word":"Jezabel","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"イゼベル：旧約聖書に登場するフェニキア出身の王女で、イスラエル王アハブの妻。バアル信仰をイスラエルに導入しようとしたため、預言者エリヤと対立し、最終的に悲惨な死を遂げた。","english_definition":"(Biblical) Jezebel: A Phoenician princess in the Old Testament, wife of King Ahab of Israel. She opposed the prophet Elijah and promoted the worship of Baal, leading to her eventual tragic death.","examples":[{"sentence":"Jezebel is a figure of wickedness in the Bible.","translation":"イゼベルは聖書において邪悪な人物として描かれている。"},{"sentence":"The story of Jezebel is a cautionary tale about the dangers of idolatry.","translation":"イゼベルの物語は、偶像崇拝の危険性についての教訓的な物語である。"}],"collocations":["a Jezebel figure (イゼベルのような人物)","the story of Jezebel (イゼベルの物語)"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(軽蔑的に) あばずれ女、悪女、妖婦。イゼベルのイメージから転じて、不道徳で魅惑的な女性を指す。","english_definition":"(derogatory) A wicked, immoral, or seductive woman. Derived from the biblical figure of Jezebel.","examples":[{"sentence":"Some critics accused her of being a Jezebel because of her provocative clothing.","translation":"彼女の挑発的な服装を理由に、一部の批評家は彼女をあばずれ女だと非難した。"},{"sentence":"The character was portrayed as a scheming Jezebel.","translation":"その登場人物は、陰謀を企む悪女として描かれていた。"}],"collocations":["a scheming Jezebel (陰謀を企む悪女)","a seductive Jezebel (誘惑的な悪女)"],"synonyms":["siren","femme fatale","vamp","hussy"],"antonyms":[]}],"etymology":{"value":"ヘブライ語の 'Izevel (אִיזֶבֶל)' に由来し、「バアルに貞節な」または「バアルの妻」を意味する可能性がある。旧約聖書に登場する人物にちなんで名付けられた。","priority":"★★★"},"pronunciation":{"ipa":"/ˈdʒɛzəbəl/","syllables":"Jez-a-bel"},"inflection":{"notes":"可算名詞"},"usage_notes":{"explanation":"「**Jezebel**」は、主に旧約聖書に登場する人物の名前として知られています。しかし、その人物像から派生して、不道徳で魅惑的な女性を指す軽蔑的な言葉としても使われます。この用法は非常に否定的で侮辱的な意味合いを持つため、使用には注意が必要です。聖書に詳しい人や文学に親しんでいる人にはすぐに意味が伝わる言葉ですが、そうでない場合は誤解を招く可能性もあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She was a Jezebel because she was very beautiful.","correct":"✓ She was called a Jezebel because she was seen as manipulative and immoral.","note":"美しさだけでは「Jezebel」とは言えません。道徳的に問題のある行動や、人を操るような性格が伴う場合に用いられます。"},{"incorrect":"✗ He admired her for being a strong Jezebel.","correct":"✓ (Unlikely, as the term is usually negative) He saw her as a powerful, independent woman, though others might call her a Jezebel.","note":"「Jezebel」は通常、否定的な意味合いで使われるため、肯定的な意味で使うのは不自然です。どうしても肯定的な意味で使いたい場合は、皮肉や反語的なニュアンスを含ませる必要があります。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (固有名詞、文学的な参照)","frequency_google_ngram":"低頻度 (Low frequency) - 一般的な会話ではあまり使われない。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Jezebel**」は、聖書に登場する人物の名前であり、転じて、不道徳で魅惑的な女性を指す言葉としても使われます。この言葉は、聖書や文学に精通している人には理解しやすいですが、そうでない人には意味が伝わりにくい可能性があります。また、非常に否定的な意味合いを持つため、使う場面には注意が必要です。この単語を使う場合は、その背景にある物語や意味を理解しておくことが重要です。"},"example_sentences":[{"sentence":"The preacher condemned the modern Jezebels who tempted men with their beauty.","translation":"その牧師は、美しさで男性を誘惑する現代のイゼベルたちを非難した。","type":"noun","meaning_category":"あばずれ女"},{"sentence":"Jezebel's story is a warning against the dangers of unchecked power and religious intolerance.","translation":"イゼベルの物語は、抑制のない権力と宗教的不寛容の危険性に対する警告である。","type":"noun","meaning_category":"聖書の人物"},{"sentence":"She played the role of a cunning Jezebel in the play.","translation":"彼女はその劇で、ずる賢いイゼベルの役を演じた。","type":"noun","meaning_category":"悪女"}]}