{"word":"unitario","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(政治)中央集権的な、統一主義の","english_definition":"(politics) relating to or supporting a centralized government or a unified system.","examples":[{"sentence":"El gobierno unitario impuso sus políticas a todas las provincias.","translation":"The unitary government imposed its policies on all the provinces.","language":"es"},{"sentence":"El sistema unitario de salud busca la igualdad en el acceso a los servicios.","translation":"The unitary healthcare system seeks equality in access to services.","language":"es"}],"collocations":["gobierno unitario (unitary government)","estado unitario (unitary state)","sistema unitario (unitary system)"],"synonyms":["centralista","uniforme","único"],"antonyms":["federal","descentralizado","plural"]},{"part_of_speech":"noun","definition":"(歴史) (主にアルゼンチンの)中央集権主義者、統一主義者","english_definition":"(historical) (mainly in Argentina) a supporter of centralism or a unitary system of government.","examples":[{"sentence":"Los unitarios se oponían al federalismo de los caudillos.","translation":"The Unitarians opposed the federalism of the caudillos.","language":"es"},{"sentence":"La lucha entre federales y unitarios marcó la historia argentina.","translation":"The struggle between federalists and Unitarians marked Argentine history.","language":"es"}],"collocations":["federales y unitarios (federalists and unitarians)","partido unitario (unitarian party)"],"synonyms":["centralista"],"antonyms":["federal"]}],"etymology":{"value":"Derivado del latín 'unitas' (unidad) + el sufijo '-ario' (relativo a).","translation":"Derived from the Latin 'unitas' (unity) + the suffix '-ario' (related to).","language":"es"},"pronunciation":{"ipa":"/unitaɾjo/","language":"es"},"inflection":{"notes":"Masculine singular: unitario; Feminine singular: unitaria; Masculine plural: unitarios; Feminine plural: unitarias.","language":"es"},"usage_notes":{"explanation":"En el contexto histórico de Argentina, 'unitario' se refiere a los partidarios de un gobierno centralizado en Buenos Aires durante el siglo XIX, en contraposición a los 'federales', que defendían la autonomía de las provincias. En un sentido más general, 'unitario' describe cualquier sistema o ideología que promueva la unificación y centralización del poder.","translation":"In the historical context of Argentina, 'unitario' refers to supporters of a centralized government in Buenos Aires during the 19th century, in opposition to the 'federales', who defended the autonomy of the provinces. In a more general sense, 'unitario' describes any system or ideology that promotes unification and centralization of power.","language":"es"},"common_mistakes":{"examples":[{"incorrect":"El gobierno es unitario, pero las provincias son autónomas.","correct":"El gobierno es centralista, pero las provincias son autónomas.","note":"'Unitario' implica un sistema centralizado, por lo que la autonomía provincial sería contradictoria. 'Centralista' podría ser más apropiado.","language":"es"}],"translation":"'Unitario' implies a centralized system, so provincial autonomy would be contradictory. 'Centralista' might be more appropriate.","language":"es"},"related_words":{"derivatives":["unidad (unity)","unión (union)","unificar (to unify)","unilateral (unilateral)"],"language":"es"},"level_frequency":{"notes":"El término 'unitario' es de uso relativamente frecuente en contextos políticos e históricos, especialmente en relación con la historia de Argentina y otros países latinoamericanos.","language":"es"},"readability_explanation":{"level":"B2","text":"'Unitario' se usa principalmente en contextos políticos e históricos para describir sistemas o ideologías que favorecen un gobierno centralizado y una administración unificada. En la historia argentina, se refiere a un bando político específico del siglo XIX. Es importante entender el contexto para interpretar correctamente el significado.","translation":"'Unitario' is mainly used in political and historical contexts to describe systems or ideologies that favor a centralized government and unified administration. In Argentine history, it refers to a specific political faction of the 19th century. It's important to understand the context to correctly interpret the meaning.","language":"es"},"example_sentences":[{"sentence":"La Constitución establece un estado unitario con descentralización administrativa.","translation":"The Constitution establishes a unitary state with administrative decentralization.","type":"adjective","meaning_category":"Centralized","language":"es"},{"sentence":"Los unitarios defendían la preeminencia de Buenos Aires sobre las demás provincias.","translation":"The Unitarians defended the preeminence of Buenos Aires over the other provinces.","type":"noun","meaning_category":"Centralist","language":"es"}]}