{"word":"Rastafarianism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ラスタファリ運動、ラスタファリアニズム","english_definition":"A religious and cultural movement that originated in Jamaica in the 1930s.","examples":[{"sentence":"Rastafarianism is characterized by a belief in Haile Selassie I as God incarnate.","translation":"ラスタファリ運動は、ハイレ・セラシエ1世を神の化身として信じることを特徴とする。"},{"sentence":"Many Rastafarians follow a strict dietary code known as 'ital'.","translation":"多くのラスタファリアンは、「アイタル」として知られる厳格な食の規範に従う。"},{"sentence":"Reggae music is closely associated with Rastafarianism.","translation":"レゲエ音楽はラスタファリ運動と密接に関連している。"}],"collocations":["Rastafarian beliefs (ラスタファリの信仰)","Rastafarian culture (ラスタファリの文化)","Rastafarian music (ラスタファリの音楽)","Rastafarian community (ラスタファリのコミュニティ)","practice Rastafarianism (ラスタファリ運動を実践する)"],"synonyms":["Rasta","Rastafari"],"antonyms":[]}],"etymology":{"value":"The term 'Rastafarianism' is derived from Ras Tafari, the pre-coronation name of Haile Selassie I, the former Emperor of Ethiopia. 'Ras' is an Ethiopian title meaning 'head' or 'prince'. The suffix '-ianism' denotes a belief system or ideology.","priority":"★★★"},"pronunciation":{"ipa":"/ˌrɑːstəˈfɑːriənɪzəm/","syllables":"Ras-ta-far-i-an-is-m"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Rastafarianism is more than just a religion; it's a way of life, encompassing music, diet, language, and a distinct worldview. Key tenets include the divinity of Haile Selassie I, a connection to Africa (particularly Ethiopia), and a rejection of 'Babylon' (the perceived corrupt Western society). The use of cannabis (ganja) is often a sacramental practice.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Rastafarianism.","correct":"✓ He is a Rastafarian.","note":"'Rastafarianism' is the name of the belief system; a follower is a 'Rastafarian'."},{"incorrect":"✗ Rastafarianism believe in Jah.","correct":"✓ Rastafarianism believes in Jah.","note":"'Rastafarianism' is a singular noun, so it takes a singular verb."}],"priority":"★★☆"},"related_words":{"derivatives":["Rastafarian (noun/adjective): A follower of Rastafarianism; relating to Rastafarianism.","Rasta (noun/adjective): Shortened form of Rastafarian.","Jah (noun): The Rastafarian name for God.","Ital (adjective): Relating to the Rastafarian dietary code.","Dreadlocks (noun): A hairstyle often associated with Rastafarians."],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"比較的低い (Relatively low) - 特定の文脈や文化的な議論で現れる。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Rastafarianism' refers to a religious and cultural movement originating in Jamaica. It's important to understand that it's a complex system of beliefs and practices, not just a style or fashion. Key concepts include the divinity of Haile Selassie I, a connection to Africa, and a rejection of Western materialism. The term itself can be used in academic or cultural discussions, requiring a nuanced understanding of its historical and social context."},"example_sentences":[{"sentence":"The documentary explored the origins and development of Rastafarianism.","translation":"そのドキュメンタリーはラスタファリ運動の起源と発展を探求した。","type":"noun","meaning_category":"ラスタファリ運動"},{"sentence":"Rastafarianism emphasizes the importance of living in harmony with nature.","translation":"ラスタファリ運動は自然との調和を重視する。","type":"noun","meaning_category":"ラスタファリ運動"},{"sentence":"He is deeply involved in the study of Rastafarianism.","translation":"彼はラスタファリ運動の研究に深く関わっている。","type":"noun","meaning_category":"ラスタファリ運動"}]}