{"word":"bimetalism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"複本位制、金銀複本位制","english_definition":"A monetary standard in which the value of the monetary unit is defined as equivalent to certain quantities of two metals, typically gold and silver, creating a fixed rate of exchange between them.","examples":[{"sentence":"The debate over bimetalism was a major issue in late 19th-century American politics.","translation":"複本位制をめぐる議論は、19世紀後半のアメリカ政治における主要な問題でした。"},{"sentence":"Proponents of bimetalism believed it would lead to greater economic stability.","translation":"複本位制の支持者たちは、それがより大きな経済的安定につながると信じていました。"}],"collocations":["abandon bimetalism (複本位制を放棄する)","adopt bimetalism (複本位制を採用する)","support bimetalism (複本位制を支持する)","the bimetalism standard (複本位制)"],"synonyms":["dual standard"],"antonyms":["monometallism","gold standard","silver standard"]}],"etymology":{"value":"'bi-' (two) + 'metal' + '-ism' (doctrine, system).","priority":"★★★"},"pronunciation":{"ipa":"/baɪˈmɛtəlɪzəm/","syllables":"bi-met-al-ism"},"inflection":{"noun_plural":"bimetalisms"},"usage_notes":{"explanation":"Bimetalism is a historical monetary system. It is rarely practiced today. The term is most often encountered in the context of historical discussions, particularly regarding 19th-century economic policy debates.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He advocated for bimetallic.","correct":"✓ He advocated for bimetalism.","note":"'Bimetallic' is an adjective (relating to two metals), while 'bimetalism' is the noun (the monetary system)."},{"incorrect":"✗ Bimetalism is when a country only uses gold.","correct":"✓ Bimetalism is when a country uses two metals, typically gold and silver, as a monetary standard.","note":"Bimetalism involves two metals, not just one."}],"priority":"★★☆"},"related_words":{"derivatives":["bimetallic (adjective: relating to or made of two metals)"],"related_concepts":["gold standard","silver standard","free silver","monetary policy","currency","Gresham's Law"],"priority":"★★☆"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Bimetalism' refers to a specific historical monetary system where a country recognizes a fixed ratio between two metals, typically gold and silver, as legal tender. Understanding this term requires knowledge of economic history and monetary policy. It's not commonly used in everyday conversation but appears in discussions of economic history."},"example_sentences":[{"sentence":"The Populist Party in the United States strongly advocated for bimetalism in the late 19th century.","translation":"アメリカの人民党は、19世紀後半に複本位制を強く主張しました。","type":"example","meaning_category":"historical context"},{"sentence":"The adoption of bimetalism was seen by some as a way to increase the money supply and alleviate economic hardship.","translation":"複本位制の採用は、貨幣供給量を増やし、経済的苦難を軽減する方法として一部の人々に見られていました。","type":"example","meaning_category":"economic theory"}]}