{"word":"Volgograd","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ヴォルゴグラード（ロシア南西部の都市、旧称スターリングラード）","english_definition":"A city in southwestern Russia, formerly known as Stalingrad.","examples":[{"sentence":"Volgograd is a major industrial city in Russia.","translation":"ヴォルゴグラードはロシアの主要な工業都市です。"},{"sentence":"The Battle of Stalingrad took place in Volgograd during World War II.","translation":"第二次世界大戦中、スターリングラードの戦いがヴォルゴグラードで行われました。"}],"collocations":["city of Volgograd","Volgograd Oblast","Battle of Volgograd","visit Volgograd","Volgograd State University"],"synonyms":["Stalingrad (historical name)","Tsaritsyn (historical name)"],"antonyms":[]}],"etymology":{"value":"The name Volgograd is derived from the Volga River and the Russian word 'gorod' (city). It was renamed Volgograd in 1961. Prior to that, it was known as Stalingrad (1925-1961) and Tsaritsyn (before 1925).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvɒlɡəɡræd/","syllables":"Vol-go-grad"},"inflection":{"notes":"Proper noun, no plural form."},"usage_notes":{"explanation":"Volgograd is a city in Russia with significant historical importance, particularly for its role in World War II as the site of the Battle of Stalingrad. The city's name has changed over time, reflecting different periods in Russian history. When discussing historical events prior to 1961, the name Stalingrad is often used.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Volgograd is in Ukraine.","correct":"✓ Volgograd is in Russia.","note":"Volgograd is located in Russia, not Ukraine."},{"incorrect":"✗ Volgograd is a small village.","correct":"✓ Volgograd is a major city.","note":"Volgograd is a significant city, not a small village."}],"priority":"★☆☆"},"related_words":{"derivatives":["Volgograd Oblast (ヴォルゴグラード州)"],"related_places":["Moscow","Saint Petersburg","Kazan","Rostov-on-Don"],"historical_terms":["Stalingrad","Battle of Stalingrad","Eastern Front"],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but well-known due to historical significance.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Volgograd' is a city name that appears in discussions of Russian geography and history, especially concerning World War II. Understanding its historical context (formerly Stalingrad) is important. While not a common word in everyday conversation, it is significant in specific historical and geographical contexts."},"example_sentences":[{"sentence":"The Mamayev Kurgan memorial complex in Volgograd commemorates the Battle of Stalingrad.","translation":"ヴォルゴグラードのママイの丘記念複合施設は、スターリングラードの戦いを記念しています。","type":"example","meaning_category":"location"},{"sentence":"Volgograd is situated on the banks of the Volga River.","translation":"ヴォルゴグラードはヴォルガ川の岸辺に位置しています。","type":"example","meaning_category":"location"},{"sentence":"Many tourists visit Volgograd to see the historical sites related to World War II.","translation":"多くの観光客が第二次世界大戦に関連する史跡を見るためにヴォルゴグラードを訪れます。","type":"example","meaning_category":"tourism"}]}