{"word":"sapindaship","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A hypothetical or humorous term for the relationship or bond between members of the Sapinda family (Sapindaceae), a botanical family including plants like maples, buckeyes, lychees, and rambutans. It could also refer to a vessel or ship carrying Sapinda plants or products.","english_definition":"A neologism or humorous term referring to the familial connection within the Sapindaceae plant family, or a ship transporting Sapinda plants.","examples":[{"sentence":"The botanist jokingly referred to the 'sapindaship' between lychees and maples due to their shared genetic ancestry.","translation":"植物学者は、ライチとカエデが遺伝的な祖先を共有していることから、冗談めかして両者の関係を「サピンダシップ」と呼んだ。"},{"sentence":"The sapindaship sailed into port laden with lychees and rambutans.","translation":"そのサピンダシップは、ライチとランブータンを満載して港に入港した。"}],"collocations":["genetic sapindaship","botanical sapindaship","metaphorical sapindaship","the sapindaship sailed"],"synonyms":["kinship (植物の系統関係)","relationship (植物の系統関係)","vessel (植物を運ぶ船の場合)","ship (植物を運ぶ船の場合)"],"antonyms":[]}],"etymology":{"value":"A blend of 'Sapinda' (referring to the Sapindaceae family) and '-ship' (denoting a relationship, state, or condition, or a vessel).","priority":"★★☆"},"pronunciation":{"ipa":"/səˈpɪndəˌʃɪp/","syllables":"sa-pin-da-ship"},"inflection":{"noun_plural":"sapindaships"},"usage_notes":{"explanation":"This word is not a standard English term and is primarily used in a humorous or specialized context, such as within botanical circles or in creative writing. Its meaning is derived from the combination of the plant family name and the suffix '-ship,' which implies a connection or vessel.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sapindaship was evident in their similar leaf structures, but also in their taste.","correct":"✓ The sapindaship was evident in their similar leaf structures, but their taste was quite different.","note":"植物の系統関係は、必ずしも味などの表現型に現れるとは限りません。"},{"incorrect":"✗ I booked a ticket on the sapindaship to the botanical gardens.","correct":"✓ I booked a ticket on the ferry to the botanical gardens.","note":"「sapindaship」は植物を運ぶ船を指す言葉として一般的ではありません。植物園に行く場合は、通常の船や交通手段を指す言葉を使うのが適切です。"}],"priority":"★☆☆"},"related_words":{"derivatives":["Sapindaceae (サピンダ科)","Sapindus (ムクロジ属)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (not a standard word)","frequency_google_ngram":"Very low frequency (neologism)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Sapindaship' is a neologism, not a standard English word. Its meaning is derived from combining 'Sapinda' (referring to the Sapindaceae plant family) and '-ship' (indicating a relationship or a vessel). Therefore, understanding requires familiarity with botanical nomenclature and word formation processes. It is primarily used in humorous or specialized contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The professor discussed the fascinating 'sapindaship' between the various members of the Sapindaceae family.","translation":"教授は、サピンダ科のさまざまなメンバー間の興味深い「サピンダシップ」について議論した。","type":"noun","meaning_category":"植物の系統関係"},{"sentence":"In a whimsical story, the 'sapindaship' set sail to deliver exotic fruits to distant lands.","translation":"奇抜な物語の中で、「サピンダシップ」は異国の果物を遠い国々に届けるために出航した。","type":"noun","meaning_category":"植物を運ぶ船"}]}