{"word":"pseudoroyally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"見せかけだけ王室のように、または、偽の王室のやり方で","english_definition":"In a manner that is falsely or superficially regal or royal.","examples":[{"sentence":"She acted pseudoroyally, expecting everyone to cater to her whims.","translation":"彼女は見せかけだけ王室のように振る舞い、誰もが自分の気まぐれに応えることを期待した。"},{"sentence":"The hotel staff treated the visiting celebrity pseudoroyally, giving her special treatment.","translation":"ホテルのスタッフは、訪問中のセレブリティを偽の王室のように扱い、特別な待遇を与えた。"}],"collocations":["behave pseudoroyally","treat someone pseudoroyally"],"synonyms":["affectedly","pretentiously","ostentatiously","pompously"],"antonyms":["humbly","modestly","unassumingly"]}],"etymology":{"value":"The word is formed by combining \"pseudo-\" (meaning false or imitation) with \"royally\" (in a royal manner).","priority":"★★★"},"pronunciation":{"ipa":"ˌsjuːdoʊˈrɔɪəli","syllables":"pseu-do-roy-al-ly"},"inflection":{"notes":"This is an adverb, so it does not inflect."},"usage_notes":{"explanation":"The word \"pseudoroyally\" is used to describe behavior or treatment that imitates or pretends to be royal, often in a superficial or exaggerated way. It implies that the person or thing being described is not genuinely royal but is trying to appear so.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She lived pseudoroyal.","correct":"✓ She lived pseudoroyally.","note":"\"Pseudoroyal\" is an adjective, while \"pseudoroyally\" is the adverb. Use the adverb to modify a verb."},{"incorrect":"✗ He treat her pseudoroyal.","correct":"✓ He treated her pseudoroyally.","note":"Use the adverb form to describe how someone is treated."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudo (prefix meaning false or imitation)","royal (adjective: relating to a king or queen)","royally (adverb: in a royal manner)"],"phrases":["pseudoroyal (adjective)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"pseudoroyally\" is a relatively uncommon word that combines the prefix \"pseudo-\" (meaning false or imitation) with the adverb \"royally.\" It describes actions or behaviors that imitate or pretend to be royal, often in a superficial or exaggerated way. This word is typically used in more formal or descriptive contexts to convey a sense of artificiality or pretense in the way someone acts or is treated."},"example_sentences":[{"sentence":"The reality show contestant, after winning a challenge, began to act pseudoroyally, demanding special privileges.","translation":"リアリティ番組の参加者は、チャレンジに勝利した後、特別な特権を要求し始め、見せかけだけ王室のように振る舞い始めた。","type":"adverb","meaning_category":"false royalty"},{"sentence":"The company's marketing campaign treated its customers pseudoroyally, offering them exclusive deals and personalized service.","translation":"その会社のマーケティングキャンペーンは、顧客を偽の王室のように扱い、特別な取引やパーソナライズされたサービスを提供した。","type":"adverb","meaning_category":"pretended royalty"}]}