{"word":"epiphanized","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vi","definition":"（人が）突然の悟りを得た、啓示を受けた","english_definition":"To have experienced a sudden and profound realization or insight; to have had an epiphany.","examples":[{"sentence":"She epiphanized during her meditation and finally understood the meaning of life.","translation":"彼女は瞑想中に悟りを開き、ついに人生の意味を理解した。"},{"sentence":"After years of struggling, he epiphanized and realized his true calling.","translation":"長年の苦労の末、彼は啓示を受け、自分の本当の使命に気づいた。"}],"collocations":["epiphanize during meditation","epiphanize about life","epiphanize and understand"],"synonyms":["realize","understand","comprehend","grasp","perceive","awaken","enlighten"],"antonyms":["confused","ignorant","unaware","oblivious"]},{"part_of_speech":"verb","transitivity":"vt","definition":"（場所・物が）啓示された、神聖化された、顕現された","english_definition":"To have been revealed, manifested, or made sacred, often in a sudden or striking way.","examples":[{"sentence":"The mountain was epiphanized by the rising sun, revealing its majestic beauty.","translation":"山は昇る太陽によって照らされ、その雄大な美しさを顕現した。"},{"sentence":"The ancient temple was epiphanized as a place of great spiritual power.","translation":"その古代寺院は、偉大な精神的力を持つ場所として神聖化された。"}],"collocations":["epiphanize a location","epiphanize a sacred object","epiphanize a concept"],"synonyms":["reveal","manifest","divinize","sanctify","consecrate","illuminate"],"antonyms":["obscure","hide","conceal","veil"]}],"etymology":{"value":"The word \"epiphanized\" is derived from the verb \"epiphanize,\" which comes from \"epiphany.\" \"Epiphany\" originates from the Greek word \"epiphaneia\" (ἐπιφάνεια), meaning \"manifestation\" or \"appearance.\" It combines \"epi-\" (ἐπί-) meaning \"upon\" or \"over,\" and \"phainein\" (φαίνειν) meaning \"to show\" or \"to appear.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈpɪfənaɪzd/","syllables":"e-piph-a-nized"},"inflection":{"verb_forms":{"present_simple":["epiphanizes"],"past_simple":"epiphanized","past_participle":"epiphanized","present_participle":"epiphanizing"}},"usage_notes":{"explanation":"The word \"epiphanized\" is relatively rare and primarily used in literary or philosophical contexts. It describes the experience of having an epiphany, a moment of sudden and profound understanding. It can also refer to something being revealed or made sacred in a striking way. The intransitive form (vi) describes a person having an epiphany, while the transitive form (vt) describes something being revealed or made sacred.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was very epiphanized about the situation.","correct":"✓ He had an epiphany about the situation.","note":"It's more common to say \"He had an epiphany\" rather than \"He was epiphanized.\" The latter sounds awkward to many native speakers."},{"incorrect":"✗ The epiphanized event changed his life.","correct":"✓ The epiphany changed his life.","note":"It is more common to use the noun \"epiphany\" to describe the event itself, rather than using the past participle \"epiphanized\" as an adjective."}],"priority":"★☆☆"},"related_words":{"derivatives":["epiphany (noun: a sudden and profound realization)","epiphanic (adjective: relating to or characteristic of an epiphany)","epiphanize (verb: to experience or cause an epiphany)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Extremely low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"epiphanized\" is a rare and sophisticated term. It is derived from \"epiphany,\" which refers to a sudden and profound realization or insight. Using \"epiphanized\" suggests that someone or something has undergone a transformative experience of revelation. This word is typically found in advanced literary or philosophical texts. It is important to understand the context in which it is used, as it implies a significant and often spiritual or intellectual awakening."},"example_sentences":[{"sentence":"She **epiphanized** during her solitary retreat, finally understanding her life's purpose.","translation":"彼女は孤独な隠遁生活中に悟りを開き、ついに自分の人生の目的を理解した。","type":"verb (vi)","meaning_category":"悟りを得た"},{"sentence":"The old church was **epiphanized** by the stained glass windows, which cast colorful patterns on the floor.","translation":"その古い教会は、床に色とりどりの模様を映し出すステンドグラスの窓によって神聖化された。","type":"verb (vt)","meaning_category":"顕現された"}]}