{"word":"nonepically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"In a manner that is not epic; without the characteristics of an epic.","english_definition":"In a way that lacks the grand scale, heroic themes, or elevated style of an epic narrative.","examples":[{"sentence":"The story unfolded nonepically, focusing on the mundane details of everyday life.","translation":"物語は叙事的ではなく、日常生活のありふれた細部に焦点を当てて展開された。"},{"sentence":"He described the event nonepically, avoiding any exaggeration or embellishment.","translation":"彼はその出来事を誇張や美化を避け、叙事詩的にではなく説明した。"}],"collocations":["describe nonepically","unfold nonepically","portray nonepically"],"synonyms":["unremarkably","ordinarily","modestly","unimpressively"],"antonyms":["epically","grandiosely","heroically","monumentally"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (not) to 'epically'. 'Epically' is derived from 'epic', referring to a long narrative poem or a work of art celebrating heroic or legendary figures or events.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈɛpɪkli/","syllables":"non-ep-i-cal-ly"},"inflection":{"notes":"Adverbs do not typically inflect. This is the standard form."},"usage_notes":{"explanation":"'Nonepically' is used to describe something that is deliberately presented without the grandeur, scope, or heroic qualities typically associated with epic narratives. It suggests a focus on realism, ordinariness, or a deliberate subversion of epic conventions. It is relatively rare.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He nonepically told a epic story.","correct":"✓ He told the story nonepically.","note":"The adverb 'nonepically' should modify the verb ('told'), not the adjective 'epic'. The correct sentence structure places the adverb closer to the verb it modifies."}],"priority":"★★☆"},"related_words":{"derivatives":["nonepic (adjective)","epic (noun, adjective)","epically (adverb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nonepically' means 'not in an epic manner'. Use this word when describing something that lacks the characteristics of an epic, such as grand scale, heroic themes, or an elevated style. It's a relatively rare word, so it's best used when you specifically want to contrast something with the epic tradition.","example":"The film portrayed the war nonepically, focusing on the soldiers' daily struggles rather than grand battles."},"example_sentences":[{"sentence":"The author chose to portray the historical event nonepically, emphasizing the everyday lives of ordinary people rather than the actions of heroes.","translation":"作者は歴史的出来事を叙事詩的にではなく、英雄の行動よりも一般の人々の日常生活を強調して描くことを選択した。","type":"adverb","meaning_category":"manner"}]}