{"word":"subvirile","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"やや男性的でない、男性的な特徴が弱い","english_definition":"Not fully virile; having less than normal masculine characteristics.","examples":[{"sentence":"The patient exhibited subvirile traits, such as a lack of facial hair and a high-pitched voice.","translation":"その患者は、ひげの欠如や高い声など、男性的な特徴が弱い兆候を示した。"}],"collocations":[],"synonyms":["effeminate","unmanly","weakly masculine"],"antonyms":["virile","masculine","manly"]}],"etymology":{"value":"'Sub-' (below, less than) + 'virile' (having masculine characteristics).","priority":"★★★"},"pronunciation":{"ipa":"/sʌbˈvɪraɪl/","syllables":"sub-vi-rile"},"inflection":{"notes":"Comparative and superlative forms are typically constructed using 'more subvirile' and 'most subvirile', respectively."},"usage_notes":{"explanation":"'Subvirile' is a term used to describe someone, typically male, who exhibits fewer or weaker masculine characteristics than what is considered normal. It is often used in a medical or clinical context. The term can be considered somewhat outdated and potentially offensive, depending on the context and intent.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a subvirile woman.","correct":"✓ The term 'subvirile' is typically applied to males.","note":"The term 'subvirile' describes the lack of masculine characteristics, so it is generally used in reference to males."}],"priority":"★★☆"},"related_words":{"derivatives":["subvirility (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Subvirile' is a relatively rare and technical term, primarily used in medical or clinical contexts to describe a deficiency in masculine traits. Due to its potential for misuse and offense, it's important to use this term with caution and sensitivity, and only when it is clinically appropriate. It is not part of common everyday vocabulary."},"example_sentences":[{"sentence":"Endocrine disorders can sometimes lead to a subvirile condition in men.","translation":"内分泌障害は、男性において男性的な特徴が弱い状態を引き起こすことがある。","type":"adjective","meaning_category":"医学的な状態"},{"sentence":"The doctor noted the patient's subvirile appearance during the examination.","translation":"医師は診察中に患者の男性的な特徴が弱い外見に注目した。","type":"adjective","meaning_category":"医学的な状態"}]}