{"word":"rapine","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"略奪、強奪、暴行","english_definition":"the violent seizure of someone's property; plunder; pillage; also, rape.","examples":[{"sentence":"The village suffered from rapine at the hands of the invading army.","translation":"その村は侵略軍による略奪の被害を受けた。"},{"sentence":"The history books detail the rapine committed during the war.","translation":"歴史書には、その戦争中に犯された略奪行為が詳しく記されている。"},{"sentence":"The city was subjected to rapine and destruction.","translation":"その都市は略奪と破壊にさらされた。"}],"collocations":["commit rapine","suffer rapine","scenes of rapine"],"synonyms":["plunder","pillage","loot","spoliation","despoliation","depredation","sack","marauding","ravaging","rape"],"antonyms":["restitution","restoration","compensation"]}],"etymology":{"value":"From Middle English [term], from Old French [term], from Latin *rapina* (“robbery, plunder”), from *rapere* (“to seize, carry off”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈræpaɪn/","syllables":"rap-ine"},"inflection":{"noun_plural":"rapines"},"usage_notes":{"explanation":"'Rapine' is a formal and somewhat archaic term referring to the forceful seizure of property, often in the context of war or invasion. It can also, though less commonly today, refer to the act of rape. The word emphasizes the violence and illegality of the act.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The rapine of the forest was caused by deforestation.","correct":"The despoliation/destruction of the forest was caused by deforestation.","note":"While 'rapine' can refer to forceful seizure, it is typically used for property or people, not natural resources. 'Despoliation' or 'destruction' is more appropriate for environmental contexts."}],"priority":"★☆☆"},"related_words":{"derivatives":["rapacious (adjective): aggressively greedy or grasping","rapaciously (adverb)","rapacity (noun): aggressive greed or grasping nature","rape (verb/noun): unlawful sexual activity carried out forcibly or with a person incapable of valid consent"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Rapine' is a relatively uncommon and formal word that describes the act of forcibly seizing property, especially during wartime. It's a strong term that emphasizes the violence and injustice of the act. Because of its infrequent use and formal tone, it's typically encountered in historical texts or legal contexts rather than everyday conversation."},"example_sentences":[{"sentence":"The invaders engaged in widespread rapine, looting homes and businesses.","translation":"侵略者たちは広範囲に略奪を行い、家や店を襲った。","type":"noun","meaning_category":"略奪"},{"sentence":"The chronicles of the time vividly describe the rapine and destruction inflicted upon the conquered cities.","translation":"当時の年代記は、征服された都市に与えられた略奪と破壊を鮮やかに描写している。","type":"noun","meaning_category":"略奪"},{"sentence":"The rapine of the countryside left many families destitute.","translation":"田舎の略奪により、多くの家族が困窮した。","type":"noun","meaning_category":"略奪"}]}