{"word":"progenitive","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"生殖力のある、繁殖力のある、子孫を生み出す","english_definition":"having the power of generating or producing offspring; reproductive; fertile.","examples":[{"sentence":"The progenitive capacity of rabbits is well-known.","translation":"ウサギの生殖能力はよく知られている。"},{"sentence":"He studied the progenitive organs of various species.","translation":"彼は様々な種の生殖器官を研究した。"}],"collocations":["progenitive power","progenitive organs","progenitive capacity"],"synonyms":["reproductive","fertile","fruitful","generative","procreative"],"antonyms":["sterile","infertile","barren"]}],"etymology":{"value":"Late Middle English: from Latin progenitivus, from progenies 'descent, offspring' (from pro- 'forth' + gignere 'beget').","priority":"★★☆"},"pronunciation":{"ipa":"/proʊˈdʒenɪtɪv/","syllables":"pro-gen-i-tive"},"inflection":{"notes":"adjective, comparative and superlative forms are possible (more progenitive, most progenitive), but rarely used."},"usage_notes":{"explanation":"'Progenitive' is a relatively uncommon word, primarily used in biological or formal contexts to describe the ability to reproduce. It emphasizes the capacity to generate offspring or descendants. It is more formal than 'reproductive' or 'fertile'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The progenitive of the company was a small workshop.","correct":"✓ The progenitor of the company was a small workshop.","note":"'Progenitive' (adjective) describes the ability to reproduce. 'Progenitor' (noun) refers to an ancestor or originator. They are different parts of speech with distinct meanings."}],"priority":"★★☆"},"related_words":{"derivatives":["progenitor (noun: 先祖、創始者)","progeny (noun: 子孫)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Not commonly used in everyday language.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Progenitive' is a formal and technical term primarily used in biological or academic contexts. It describes the ability or capacity to reproduce and generate offspring. Due to its specialized usage, it is not commonly encountered in general conversation or writing. Understanding of related terms like 'progenitor' and 'progeny' can aid in comprehending its meaning."},"example_sentences":[{"sentence":"The study focused on the progenitive potential of endangered species.","translation":"その研究は、絶滅危惧種の繁殖能力に焦点を当てた。","type":"adjective","meaning_category":"生殖力のある"},{"sentence":"The progenitive cells are responsible for the continuous renewal of the tissue.","translation":"その生殖細胞は、組織の継続的な再生を担っている。","type":"adjective","meaning_category":"子孫を生み出す"}]}