{"word":"nonprohibition","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"禁止しないこと、非禁止、禁止の欠如","english_definition":"The absence of prohibition; the state of not being prohibited.","examples":[{"sentence":"The law allows for nonprohibition of certain activities under specific circumstances.","translation":"その法律は、特定の状況下での特定の活動の非禁止を認めている。"},{"sentence":"The company's policy is based on nonprohibition unless there is a clear risk.","translation":"その会社の方針は、明確なリスクがない限り、非禁止に基づいている。"}],"collocations":["policy of nonprohibition (非禁止の方針)","principle of nonprohibition (非禁止の原則)"],"synonyms":["permission","allowance","authorization","freedom","liberty"],"antonyms":["prohibition","ban","restriction","interdiction"]}],"etymology":{"value":"\"non-\" (否定の接頭辞) + \"prohibition\" (禁止)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˌproʊɪˈbɪʃən/","syllables":"non-pro-hi-bi-tion"},"inflection":{"noun_plural":"nonprohibitions"},"usage_notes":{"explanation":"\"Nonprohibition\" is a formal term that refers to the state where something is not forbidden or banned. It's often used in legal, policy, or regulatory contexts. It emphasizes the absence of a restriction rather than the presence of permission.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonprohibition allowed them to do whatever they wanted without any rules.","correct":"✓ The nonprohibition meant they could engage in those activities without facing legal penalties, but rules might still apply.","note":"Nonprohibition doesn't necessarily mean a complete lack of rules or regulations; it simply means the activity isn't explicitly banned by law or policy."}],"priority":"★☆☆"},"related_words":{"derivatives":["prohibition (禁止)","prohibit (禁止する)","unprohibited (禁止されていない)"],"antonyms":["ban","embargo","interdiction","restriction","veto"],"synonyms":["allowance","authorization","freedom","liberty","permission"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Nonprohibition\" is a formal and relatively uncommon word. It means that something is *not* prohibited. It's often used in legal or policy discussions when describing the absence of a ban or restriction on a particular activity. For example, if a law states the \"nonprohibition of certain types of speech,\" it means those types of speech are allowed.","priority":"★★☆"},"example_sentences":[{"sentence":"The city council debated the nonprohibition of short-term rentals in residential areas.","translation":"市議会は、住宅地における短期賃貸の非禁止について議論した。","type":"noun","meaning_category":"absence of prohibition"},{"sentence":"The government's stance is one of nonprohibition regarding the use of personal drones, within certain safety guidelines.","translation":"政府の立場は、特定の安全ガイドライン内での個人用ドローンの使用に関する非禁止である。","type":"noun","meaning_category":"absence of prohibition"}]}