{"word":"hot-drawn","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"熱間引抜きされた、熱間圧延された","english_definition":"(of metal) shaped by being drawn or rolled while hot.","examples":[{"sentence":"hot-drawn steel tubing","translation":"熱間引抜き鋼管"},{"sentence":"The hot-drawn process improves the metal's strength.","translation":"熱間引抜き加工は金属の強度を向上させる。"}],"collocations":["hot-drawn steel","hot-drawn tubing","hot-drawn process"],"synonyms":["hot-rolled","drawn","rolled"],"antonyms":["cold-drawn"]},{"part_of_speech":"verb","definition":"(verb) to produce metal shapes by hot drawing.","english_definition":"to shape metal by pulling it through a die while hot.","examples":[{"sentence":"The steel is hot-drawn to create seamless pipes.","translation":"鋼は熱間引抜きされてシームレスパイプになる。"}],"collocations":["hot-draw steel","hot-draw tubing"],"synonyms":["hot-roll","draw","roll"],"antonyms":["cold-draw"]}],"etymology":{"value":"The term combines \"hot\" referring to the high temperature of the metal, and \"drawn\" referring to the process of pulling the metal through a die to shape it.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɒt ˈdrɔːn/","syllables":"hot-drawn"},"inflection":{"notes":"The word \"hot-drawn\" does not inflect; it remains the same regardless of tense or number."},"usage_notes":{"explanation":"\"Hot-drawn\" describes a manufacturing process where metal is shaped while hot, making it more malleable. This contrasts with \"cold-drawn,\" where the metal is shaped at room temperature. The hot-drawn process is often used to create seamless tubes and improve the metal's strength and uniformity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The metal was hot draw.","correct":"✓ The metal was hot-drawn.","note":"\"Hot-drawn\" is an adjective describing the process. Using \"hot draw\" is grammatically incorrect."}],"priority":"★★☆"},"related_words":{"derivatives":["hot-drawing"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"hot-drawn\" is a technical term used in manufacturing and engineering. It describes a process where metal is shaped by pulling it through a die while it is hot. This process is used to create metal products with specific shapes and improved strength. Understanding this term requires some knowledge of metalworking processes."},"example_sentences":[{"sentence":"The company specializes in manufacturing hot-drawn steel bars.","translation":"その会社は熱間引抜き鋼棒の製造を専門としている。","type":"adjective","meaning_category":"熱間引抜きされた"},{"sentence":"The hot-drawn process allows for the creation of seamless tubes.","translation":"熱間引抜き加工により、シームレスチューブの製造が可能になる。","type":"adjective","meaning_category":"熱間引抜きされた"}]}