{"word":"outwishing","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人)よりも強く願う、(人)の願いを上回る","english_definition":"To surpass someone in wishing; to wish more strongly or effectively than someone else.","examples":[{"sentence":"She was outwishing everyone else in the competition, determined to win.","translation":"彼女は勝つ決意で、競争相手の誰よりも強く願っていた。"},{"sentence":"No matter how much they wished for it, they couldn't outwish the magic spell.","translation":"彼らがどれだけ願っても、魔法の呪文を上回ることはできなかった。"}],"collocations":["outwish someone in a competition","outwish a magic spell"],"synonyms":["surpass in wishing","exceed in wishing","wish more strongly than"],"antonyms":["underwish","wish less strongly than"]},{"part_of_speech":"verb","transitivity":"vt","definition":"(物事)が起こることを願うのをやめる、(物事)が起こることを願うよりもむしろ別のことを願う","english_definition":"To stop wishing for something; to wish for something else instead.","examples":[{"sentence":"He started outwishing for fame and fortune, realizing that happiness was more important.","translation":"彼は名声や富を願うのをやめ、幸福の方がもっと重要だと気づいた。"},{"sentence":"After the accident, she outwished she had ever taken that road.","translation":"事故の後、彼女はその道を二度と通らないことを願った。"}],"collocations":["outwish for fame","outwish a past event"],"synonyms":["stop wishing for","wish against","regret wishing for"],"antonyms":["continue wishing for","persist in wishing for"]}],"etymology":{"value":"The word 'outwishing' is formed by adding the prefix 'out-' to the verb 'wishing.' The prefix 'out-' generally means 'more than' or 'to surpass,' indicating exceeding someone in the act of wishing or wishing for something else instead.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌaʊtˈwɪʃɪŋ/","syllables":"out-wish-ing"},"inflection":{"verb_forms":{"present_simple":["outwish","outwishes"],"past_simple":"outwished","past_participle":"outwished","present_participle":"outwishing"}},"usage_notes":{"explanation":"'Outwishing' is a relatively rare word, often used in contexts where the intensity or direction of wishing is being compared or contrasted. It can imply either surpassing someone in the strength of their wish or changing one's wish to something different. The context usually clarifies which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is outwishing to go to the party.","correct":"✓ She is outwishing everyone else to go to the party.","note":"When used in the sense of surpassing someone in wishing, it requires an object (someone being outwished)."},{"incorrect":"✗ He outwishing for the rain to stop.","correct":"✓ He outwished for the rain to stop, hoping for sunshine instead.","note":"When used in the sense of changing one's wish, it often implies a contrast or a new desire."}],"priority":"★★☆"},"related_words":{"derivatives":["outwish (verb)","wishing (verb, noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR vocabulary lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Outwishing' is a complex word that combines the act of wishing with the concept of surpassing or changing one's desires. It is not commonly used and requires a good understanding of both the prefix 'out-' and the verb 'wish.' Understanding the context is crucial to interpreting its intended meaning, whether it's about wishing more strongly than someone else or changing what one wishes for.","priority":"★★☆"},"example_sentences":[{"sentence":"The children were outwishing each other for the biggest piece of cake.","translation":"子供たちは一番大きなケーキを、お互いよりも強く願っていた。","type":"verb","meaning_category":"Surpassing in wishing"},{"sentence":"He began outwishing his earlier ambition, realizing it was not what he truly wanted.","translation":"彼は以前の野心を願うのをやめ始め、それが本当に望んでいるものではないことに気づいた。","type":"verb","meaning_category":"Changing one's wish"}]}