{"word":"Freeholding","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自由保有権、完全所有権","english_definition":"The ownership of land or property in perpetuity, without owing rent or service to any superior; absolute ownership.","examples":[{"sentence":"Freeholding is the most complete form of land ownership.","translation":"自由保有権は、土地所有の最も完全な形態です。"},{"sentence":"The company acquired the freeholding of the building.","translation":"その会社は建物の完全所有権を取得しました。"}],"collocations":["acquire freeholding","transfer freeholding","own freeholding","freeholding property","freeholding land"],"synonyms":["fee simple","absolute ownership","full ownership"],"antonyms":["leasehold","tenancy"]},{"part_of_speech":"adjective","definition":"自由保有の、完全所有の","english_definition":"Relating to or denoting land or property held in freeholding.","examples":[{"sentence":"The property is offered on a freeholding basis.","translation":"その物件は自由保有の条件で提供されています。"},{"sentence":"They are selling their freeholding interest in the farm.","translation":"彼らは農場の自由保有権を売却しています。"}],"collocations":["freeholding property","freeholding interest","freeholding estate"],"synonyms":["fee simple","absolutely owned"],"antonyms":["leasehold","tenanted"]}],"etymology":{"value":"Derived from 'freehold,' combining 'free' (denoting freedom from obligation) and 'hold' (denoting possession or tenure). The '-ing' suffix indicates a state, condition, or action related to freeholding.","priority":"★★★"},"pronunciation":{"ipa":"ˈfriːˌhoʊldɪŋ","syllables":"free-hold-ing"},"inflection":{"noun_plural":"freeholdings"},"usage_notes":{"explanation":"'Freeholding' refers to the most comprehensive type of property ownership, where the owner has the right to use, sell, lease, or bequeath the property without restrictions from a landlord or other superior. It contrasts with 'leasehold,' where the property is held for a fixed term under a lease agreement. In real estate contexts, understanding the difference between freeholding and leaseholding is crucial for determining the extent of ownership rights.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a freeholding lease.","correct":"✓ I have a freeholding. / ✓ I have a leasehold.","note":"'Freeholding' and 'leasehold' are mutually exclusive. A lease cannot be a freeholding, and vice versa."},{"incorrect":"✗ Freeholding means you don't pay any taxes.","correct":"✓ Freeholding means you own the property outright, but you are still responsible for property taxes.","note":"Freeholding confers ownership, but it does not exempt the owner from obligations like property taxes."}],"priority":"★★☆"},"related_words":{"derivatives":["freehold","freeholder"],"phrasal_verbs":[],"related_concepts":["fee simple","leasehold","tenure","property law","real estate"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Freeholding' is a legal term denoting absolute ownership of land or property. This means the owner has unrestricted rights to use, sell, or transfer the property. It's a concept frequently encountered in property law and real estate transactions, contrasting with other forms of land tenure like leasehold, where ownership is limited to a specific period. Understanding 'freeholding' is essential for comprehending property rights and obligations.","priority":"★★☆"},"example_sentences":[{"sentence":"The family has maintained the freeholding of the farm for generations.","translation":"その家族は何世代にもわたって農場の自由保有権を維持してきました。","type":"noun","meaning_category":"完全所有権"},{"sentence":"The advertisement specified that the land was available on a freeholding basis.","translation":"広告には、その土地が自由保有の条件で利用可能であることが明記されていました。","type":"adjective","meaning_category":"自由保有の"},{"sentence":"They decided to convert their leasehold property into a freeholding.","translation":"彼らはリースホールドの物件を自由保有権に転換することを決定しました。","type":"noun","meaning_category":"完全所有権"},{"sentence":"The freeholding interest in the commercial building was sold to a private investor.","translation":"商業ビルの自由保有権は、個人投資家に売却されました。","type":"noun","meaning_category":"完全所有権"}]}