{"word":"layshaft","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"副軸（変速機内の、主軸とカウンターシャフトの間にある軸）","english_definition":"An intermediate shaft within a gearbox which carries gears, but does not transfer the primary drive power. It is used to indirectly connect the input shaft to the output shaft. Also known as a countershaft.","examples":[{"sentence":"The layshaft in this gearbox is damaged and needs replacing.","translation":"このギアボックスの副軸が損傷しており、交換が必要です。"},{"sentence":"The mechanic inspected the layshaft for wear and tear.","translation":"整備士は副軸の摩耗を点検しました。"}],"collocations":["gearbox layshaft","replace layshaft","inspect layshaft","damaged layshaft"],"synonyms":["countershaft","intermediate shaft"],"antonyms":["mainshaft","input shaft","output shaft"]}],"etymology":{"value":"The term 'layshaft' comes from its function of 'laying' between the input and output shafts, supporting the gears.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈleɪʃɑːft/","syllables":"lay-shaft"},"inflection":{"noun_plural":"layshafts"},"usage_notes":{"explanation":"A layshaft is a component in a gearbox, particularly in manual transmissions. It's an auxiliary shaft that receives power from the input shaft and transmits it to the output shaft via gears. It doesn't directly transmit power from input to output.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The layshaft directly connects the engine to the wheels.","correct":"✓ The layshaft indirectly connects the engine to the wheels through the main shaft.","note":"The layshaft is an intermediate shaft and does not directly connect the engine to the wheels."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'layshaft' is technical and specific to mechanical engineering, particularly in the context of gearboxes and transmissions. Understanding requires familiarity with automotive or mechanical terminology."},"example_sentences":[{"sentence":"The layshaft allows for multiple gear ratios in the transmission.","translation":"副軸により、トランスミッションで複数のギア比が可能になります。","type":"noun","meaning_category":"component"},{"sentence":"The noise was traced back to a worn bearing on the layshaft.","translation":"その異音は、副軸の摩耗したベアリングに起因することが判明しました。","type":"noun","meaning_category":"component"}]}