{"word":"appellatory","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"命名の、呼称の、名称に関する","english_definition":"relating to a name or title; giving a name.","examples":[{"sentence":"The appellatory function of language is to provide names for things.","translation":"言語の命名機能は、物事に名前を与えることである。"},{"sentence":"An appellatory adjective is one that is used to name or designate something.","translation":"命名形容詞とは、何かを命名または指定するために使用される形容詞である。"}],"collocations":["appellatory term","appellatory function","appellatory adjective"],"synonyms":["designatory","nominative","titular","designating","naming"],"antonyms":[],"notes":"Often used in linguistic or formal contexts."}],"etymology":{"value":"From Latin appellare, meaning 'to call by name, address'. Related to 'appeal'.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈpɛləˌtɔːri/","syllables":"ap-pel-la-to-ry"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than to form comparative and superlative degrees (which are rare for 'appellatory')."},"usage_notes":{"explanation":"'Appellatory' is a relatively rare word, most often encountered in academic or technical discussions of language, linguistics, or naming conventions. It describes something that relates to the act of naming or calling something by a name.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The appellatory of the book was very long.","correct":"✓ The title of the book was very long.","note":"'Appellatory' is an adjective, not a noun. Use 'title' or 'name' instead of 'appellatory' as a noun."}],"priority":"★☆☆"},"related_words":{"derivatives":["appellation (noun): a name or title.","appellatively (adverb): in a way that names or designates."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Appellatory' is a formal and uncommon word. It is best used in academic or highly specialized contexts when discussing the function of naming or designating something. It is not suitable for general conversation or writing. Understanding its etymology (from the Latin 'appellare', meaning 'to call by name') can aid in comprehension."},"example_sentences":[{"sentence":"The appellatory system of this tribe is based on kinship.","translation":"この部族の命名体系は親族関係に基づいている。","type":"adjective","meaning_category":"Naming system"},{"sentence":"The appellatory power of language allows us to categorize and understand the world around us.","translation":"言語の命名力によって、私たちは周囲の世界を分類し理解することができる。","type":"adjective","meaning_category":"Function of language"}]}