{"word":"sentisection","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare) The practice of dissecting or vivisecting sentient beings, especially animals, for scientific research or experimentation.","english_definition":"The practice of dissecting or vivisecting sentient beings, especially animals, for scientific research or experimentation.","examples":[{"sentence":"The ethical implications of sentisection are widely debated.","translation":"知覚力のある生物の解剖、特に動物実験の倫理的影響は広く議論されている。"},{"sentence":"Sentisection raises concerns about animal welfare and the justification of causing suffering for scientific advancement.","translation":"知覚力のある生物の解剖は、動物福祉と科学の進歩のために苦痛を与えることの正当性について懸念を引き起こす。"}],"collocations":["ethical concerns of sentisection","debate on sentisection","alternatives to sentisection"],"synonyms":["vivisection","animal experimentation","animal research"],"antonyms":["animal rights","animal welfare","humane treatment"]}],"etymology":{"value":"A blend of 'sentient' and 'section' (as in dissection).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɛntiˈsɛkʃən/","syllables":"sen-ti-sec-tion"},"inflection":{"noun_plural":"sentisections"},"usage_notes":{"explanation":"The term 'sentisection' is relatively rare and often used in discussions about animal ethics and welfare. It specifically highlights the sentience (ability to feel and perceive) of the animals being subjected to dissection or vivisection. The term is often used critically to emphasize the ethical concerns associated with such practices.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sentisection was performed without anesthesia.","correct":"✓ The vivisection was performed without anesthesia.","note":"'Vivisection' is the more common term. 'Sentisection' emphasizes the sentience of the animal."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["sentient","dissection","vivisection","animal ethics","animal welfare"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - A relatively rare term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sentisection' is a specialized term referring to the dissection or vivisection of sentient beings, particularly animals. It is not a common word and is primarily used in the context of ethical debates surrounding animal experimentation. Understanding this term requires familiarity with concepts like sentience and vivisection. Due to its specific and somewhat technical nature, it is more likely to be encountered in academic or specialized discussions."},"example_sentences":[{"sentence":"Opponents of sentisection argue that it is morally wrong to inflict pain on sentient animals for scientific purposes.","translation":"知覚力のある生物の解剖の反対者は、科学目的のために知覚力のある動物に痛みを与えるのは道徳的に間違っていると主張する。","type":"noun","meaning_category":"practice of dissecting sentient animals"},{"sentence":"The use of alternatives to sentisection is increasingly encouraged in research.","translation":"研究では、知覚力のある生物の解剖の代替手段の使用がますます奨励されている。","type":"noun","meaning_category":"practice of dissecting sentient animals"}]}