{"word":"Bheestie","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(historical) A water carrier, especially in India and other parts of South Asia, typically using a goatskin bag (mashak) to transport water.","english_definition":"A water carrier, especially in India and other parts of South Asia, typically using a goatskin bag (mashak) to transport water.","examples":[{"sentence":"The bheestie quenched the soldiers' thirst with cool water from his mashak.","translation":"ビースティーは、ゴートスキンの袋から出した冷たい水で兵士たちの渇きを癒した。"}],"collocations":["water carrier","goatskin bag","mashak"],"synonyms":["waterman","water seller"],"antonyms":[]}],"etymology":{"value":"From Hindi भिश्ती (bhištī), from Persian بهشتی (behešti, “belonging to paradise”), from بهشت (behešt, “paradise”). The name derives from the belief that a bheestie's act of providing water is a charitable deed that earns them a place in paradise.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbiːsti/","syllables":"Bhees-tie"},"inflection":{"noun_plural":"Bheesties"},"usage_notes":{"explanation":"The term 'Bheestie' is primarily historical and cultural, referring to a specific profession in South Asia. It is not commonly used in modern English outside of historical or cultural contexts.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Bheestie' is a niche term, primarily used in historical or cultural contexts related to South Asia. It refers to a specific profession of water carriers who traditionally used goatskin bags. Due to its limited usage, it is not part of common English vocabulary and would likely be unfamiliar to most English speakers. Understanding the term requires knowledge of South Asian history and culture."},"example_sentences":[{"sentence":"In the arid landscape, the arrival of the bheestie was a welcome sight.","translation":"乾燥した風景の中で、ビースティーの到着は歓迎すべき光景だった。","type":"noun","meaning_category":"water carrier"}]}