{"word":"horn-plate","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(動物の)角板、角質板","english_definition":"A plate made of horn or a horny substance; a protective plate made of horn-like material.","examples":[{"sentence":"The fossil showed remnants of a horn-plate on the animal's head.","translation":"その化石は、動物の頭部に角板の痕跡を示していた。"},{"sentence":"Some dinosaurs had elaborate horn-plates for defense.","translation":"一部の恐竜は、防御のために精巧な角板を持っていた。"}],"collocations":["dinosaur horn-plate","fossil horn-plate","protective horn-plate"],"synonyms":["scute","scale","bony plate"],"antonyms":[]}],"etymology":{"value":"Combination of 'horn' (referring to the animal horn) and 'plate' (referring to a flat, rigid piece of material).","priority":"★★★"},"pronunciation":{"ipa":"/ˈhɔːrnˌpleɪt/","syllables":"horn-plate"},"inflection":{"noun_plural":"horn-plates"},"usage_notes":{"explanation":"'Horn-plate' typically refers to a protective or decorative plate made of horn or a similar material. It is often used in the context of paleontology or zoology to describe features of extinct or extant animals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The animal had a horn plate all over its body.","correct":"✓ The animal had horn-plates all over its body.","note":"When referring to multiple plates, use the plural form 'horn-plates'."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'horn-plate' is a technical term used in zoology and paleontology. It refers to a plate-like structure made of horn or a similar material, often found on the heads or bodies of animals. Understanding this term requires familiarity with scientific vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The triceratops is known for its distinctive horn-plate.","translation":"トリケラトプスはその特徴的な角板で知られている。","type":"noun","meaning_category":"animal anatomy"},{"sentence":"Archaeologists discovered a decorative horn-plate in the ancient burial site.","translation":"考古学者は古代の埋葬地で装飾的な角板を発見した。","type":"noun","meaning_category":"archaeology"}]}