{"word":"usucapient","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律) 取得時効によって財産を取得する人","english_definition":"(law) A person who acquires property by usucaption.","examples":[{"sentence":"The usucapient must demonstrate continuous possession of the land for the statutory period.","translation":"取得時効によって財産を取得する者は、法定期間にわたって土地を継続的に占有していることを証明しなければならない。"}],"collocations":["become usucapient","the usucapient's rights"],"synonyms":["acquirer by prescription"],"antonyms":["original owner","prior possessor"]},{"part_of_speech":"adjective","definition":"(法律) 取得時効によって財産を取得する","english_definition":"(law) Acquiring property by usucaption.","examples":[{"sentence":"The usucapient possession must be open and notorious.","translation":"取得時効による占有は、公然かつ周知でなければならない。"}],"collocations":["usucapient possession","usucapient title"],"synonyms":["prescriptive"],"antonyms":["original","prior"]}],"etymology":{"value":"From Latin *ūsū capere* (“to take by usage”), from *ūsus* (“use”) + *capere* (“to take”).","priority":"★★☆"},"pronunciation":{"ipa":"/juːˈsjuːkəpiənt/","syllables":"u-su-ca-pi-ent"},"inflection":{"noun_plural":"usucapients"},"usage_notes":{"explanation":"'Usucapient' is a legal term, primarily used in property law, referring to the person who is in the process of acquiring or has acquired ownership of property through usucaption (adverse possession). It is not a commonly used word outside of legal contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The usucapient inherited the property.","correct":"✓ The usucapient acquired the property through adverse possession.","note":"Usucaption (adverse possession) is a specific legal mechanism for acquiring property rights, distinct from inheritance or purchase."}],"priority":"★☆☆"},"related_words":{"derivatives":["usucapt (verb: to acquire property by usucaption)","usucaption (noun: acquisition of property by possession for a statutory period)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'usucapient' is a specialized legal term referring to someone who gains ownership of property through usucaption, also known as adverse possession. This process involves possessing property openly, continuously, and without the owner's permission for a period defined by law. Understanding this term requires familiarity with legal concepts related to property rights and acquisition. It is rarely used outside of legal contexts and academic discussions of property law."},"example_sentences":[{"sentence":"As the **usucapient**, she had cultivated the land for over twenty years, eventually gaining legal title.","translation":"取得時効により財産を取得する者として、彼女は20年以上にわたって土地を耕作し、最終的に法的権利を取得した。","type":"noun","meaning_category":"person acquiring property by usucaption"},{"sentence":"The **usucapient** party must demonstrate a clear intent to claim ownership of the disputed land.","translation":"取得時効により財産を取得する当事者は、係争中の土地の所有権を主張する明確な意思を示さなければならない。","type":"noun","meaning_category":"person acquiring property by usucaption"},{"sentence":"The court examined the **usucapient** claims to determine if all requirements for adverse possession had been met.","translation":"裁判所は、取得時効による請求を検討し、占有による取得のすべての要件が満たされているかどうかを判断した。","type":"adjective","meaning_category":"related to acquiring property by usucaption"}]}