{"word":"revelability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The quality of being able to be revealed or disclosed.","english_definition":"The quality or state of being revelable; capable of being revealed or disclosed.","examples":[{"sentence":"The revelability of the secret depended on whether anyone would betray it.","translation":"その秘密が明らかになるかどうかは、誰かがそれを裏切るかどうかにかかっていた。"},{"sentence":"The document's revelability was a matter of legal debate.","translation":"その文書の公開可能性は、法的な議論の対象だった。"}],"collocations":["high revelability","low revelability","assess the revelability","determine the revelability"],"synonyms":["disclosability","discoverability","uncoverability","exposability"],"antonyms":["unrevelability","invisibility","obscurity","concealment"]}],"etymology":{"value":"Derived from 'revelable,' which comes from 'reveal' (to make known) + '-able' (capable of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌrɛvəˈleɪbɪlɪti/","syllables":"rev-e-la-bil-i-ty"},"inflection":{"noun_plural":"revelabilities"},"usage_notes":{"explanation":"'Revelability' is a relatively uncommon noun that describes the extent to which something can be revealed or made known. It is often used in contexts where secrecy or confidentiality is a concern. The term implies a potential for disclosure, whether intentional or unintentional.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The revelability of the information was high, so it was kept secret.","correct":"✓ The revelability of the information was high, so extra precautions were taken to keep it secret.","note":"High revelability means it's easy to reveal, so keeping it secret would require extra effort."},{"incorrect":"✗ The revelability was very secret.","correct":"✓ The potential for revelation was high, but the information remained secret.","note":"'Revelability' itself isn't secret; it's the *potential* for something to be revealed."}],"priority":"★★☆"},"related_words":{"derivatives":["reveal","revelation","revelable","revealing"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Revelability' is a complex and relatively rare word. It refers to the quality of something being able to be revealed or disclosed. You would typically encounter this word in academic or technical contexts where the potential for information to be uncovered is being discussed. Understanding requires a good grasp of abstract nouns and the nuances of the suffix '-ability.'"},"example_sentences":[{"sentence":"The analyst assessed the revelability of the company's financial data.","translation":"アナリストは、その会社の財務データの公開可能性を評価した。","type":"general","meaning_category":"quality of being able to be revealed"},{"sentence":"Due to the sensitive nature of the project, its revelability was kept to a minimum.","translation":"プロジェクトの機密性の高い性質のため、その公開可能性は最小限に抑えられた。","type":"general","meaning_category":"quality of being able to be revealed"},{"sentence":"The revelability of the source's identity posed a significant risk to their safety.","translation":"情報源の身元が明らかになる可能性は、彼らの安全にとって重大なリスクとなった。","type":"general","meaning_category":"quality of being able to be revealed"}]}