{"word":"Daemonies","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(plural only) A fictional species of intelligent beings in Philip Pullman's 'His Dark Materials' trilogy. They are the external physical manifestation of a person's 'inner self' that takes the form of an animal.","english_definition":"(plural only) A fictional species of intelligent beings in Philip Pullman's 'His Dark Materials' trilogy. They are the external physical manifestation of a person's 'inner self' that takes the form of an animal.","examples":[{"sentence":"In 'His Dark Materials', children's daemonies can change form, but after puberty, a person's daemonie settles into a fixed animal form that reflects their true character.","translation":"『His Dark Materials』では、子供たちのダイモ二ーは姿を変えることができますが、思春期を過ぎると、その人の真の性格を反映した固定された動物の姿に落ち着きます。"}],"collocations":["a person's daemonie","settled daemonie","changing daemonie"],"synonyms":["daemons (more common spelling)"],"antonyms":[]}],"etymology":{"value":"A variant spelling of 'daemons', influenced by the classical Greek spelling 'δαίμονες' (daimones), the plural of 'δαίμων' (daimōn), meaning a divine power, guiding spirit, or inner genius. Philip Pullman uses this spelling to distinguish his fictional beings from traditional demons.","priority":"★★☆"},"pronunciation":{"ipa":"/deɪˈmoʊniːz/","syllables":"Dei-mo-nies"},"inflection":{"noun_plural":"Daemonies (already plural)"},"usage_notes":{"explanation":"'Daemonies' (or more commonly 'daemons') is a term specific to Philip Pullman's 'His Dark Materials' trilogy. It refers to the animal-shaped manifestations of a person's inner self. The spelling 'daemonies' is less common than 'daemons', but both refer to the same concept within the context of the books. Outside of this context, 'daemons' typically refers to malevolent spirits or demons in religious or mythological contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a daemonie in my dream, it was scary.","correct":"✓ I saw a daemon in my dream, it was scary.","note":"Outside of the context of 'His Dark Materials', 'daemon' is the more common spelling for a supernatural being. If referring to Pullman's books, either 'daemon' or 'daemonie' is acceptable, but 'daemon' is still more frequent."}],"priority":"★★☆"},"related_words":{"derivatives":["daemon (singular form)"],"phrasal_verbs":[],"related_terms":["Dust","anima","spirit animal","inner self"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Literary term)","frequency_google_ngram":"Low (Specific to the 'His Dark Materials' series)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Daemonies' is a term primarily encountered in the context of Philip Pullman's 'His Dark Materials' trilogy. Understanding the term requires familiarity with the fictional world and its concepts. It represents a sophisticated literary concept related to the human psyche and its external manifestation. The word itself is a variant of 'daemons', but with a specific meaning within the books' narrative."},"example_sentences":[{"sentence":"Lyra's daemonie, Pantalaimon, often took the form of a moth when she was a child.","translation":"ライラのダイモ二ーであるパンタライモンは、子供の頃はよく蛾の姿をとっていた。","type":"noun","meaning_category":"Fictional beings"},{"sentence":"The relationship between a person and their daemonie is central to the themes of 'His Dark Materials'.","translation":"人とダイモ二ーの関係は、『His Dark Materials』のテーマの中心である。","type":"noun","meaning_category":"Fictional beings"}]}