{"word":"proteins","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"タンパク質","english_definition":"Nutrients the body uses to build and maintain its cells and tissues.","examples":[{"sentence":"Proteins are essential for building muscle.","translation":"タンパク質は筋肉を作るのに不可欠です。"},{"sentence":"Eggs are a good source of protein.","translation":"卵は良質なタンパク質の供給源です。"},{"sentence":"The body breaks down proteins into amino acids.","translation":"体はタンパク質をアミノ酸に分解します。"}],"collocations":["high-protein diet (高タンパク質食)","protein synthesis (タンパク質合成)","dietary protein (食事性タンパク質)","plant-based protein (植物性タンパク質)","animal protein (動物性タンパク質)","protein shake (プロテインシェイク)","complete protein (完全タンパク質)"],"synonyms":["albumin","globulin"],"antonyms":["carbohydrates","fats"]}],"etymology":{"value":"Derived from the Greek word \"proteios,\" meaning \"of the first rank\" or \"primary,\" reflecting the essential role of proteins in living organisms.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈproʊtiːnz/","syllables":"pro-teins"},"inflection":{"noun_plural":"proteins (already plural)"},"usage_notes":{"explanation":"\"Proteins\" refers to a class of complex organic compounds that are essential parts of all living organisms and participate in virtually every process within cells. They are composed of amino acids linked together by peptide bonds. Proteins have many functions, including structural support, catalyzing biochemical reactions (enzymes), transporting molecules, and regulating gene expression. The term is generally used in the plural form when referring to proteins in general or multiple types of proteins.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Protein is important for building muscle.","correct":"✓ Protein is important for building muscle. / ✓ Proteins are important for building muscle.","note":"When referring to the general class of nutrients, \"protein\" (singular, uncountable) is correct. To emphasize the variety or individual types, \"proteins\" (plural) can be used."},{"incorrect":"✗ I eat a lot of protein for build muscle.","correct":"✓ I eat a lot of protein to build muscle.","note":"The correct preposition to use with the infinitive of purpose is \"to.\" Also, \"build\" is the base form of the verb."},{"incorrect":"✗ Proteins are make up of amino acids.","correct":"✓ Proteins are made up of amino acids.","note":"The correct passive voice construction is \"are made up of.\" The past participle \"made\" is required."}],"priority":"★★☆"},"related_words":{"derivatives":["proteinaceous (形容詞: タンパク質性の)","protease (名詞: プロテアーゼ、タンパク質分解酵素)","proteomic (形容詞: プロテオミクス、タンパク質全体を研究する)","proteomics (名詞: プロテオミクス)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"比較的高頻度 (Relatively high frequency), especially in contexts related to health, nutrition, and biology.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"\"Proteins\" are very important nutrients that our bodies need to grow and stay healthy. They help build and repair tissues, like muscles. You can find proteins in foods like meat, eggs, beans, and nuts. Eating enough protein is important for everyone, especially growing children and athletes.","priority":"★★☆"},"example_sentences":[{"sentence":"The nutritional value of the food lies in its high **proteins** content.","translation":"その食品の栄養価は、タンパク質含有量が高いことにある。","type":"noun","meaning_category":"栄養"},{"sentence":"Some people take **proteins** supplements to enhance muscle growth.","translation":"筋肉の成長を促進するために、タンパク質サプリメントを摂取する人もいる。","type":"noun","meaning_category":"サプリメント"},{"sentence":"Enzymes are biological **proteins** that speed up chemical reactions.","translation":"酵素は、化学反応を促進する生物学的タンパク質である。","type":"noun","meaning_category":"生物学"},{"sentence":"A balanced diet should include adequate amounts of **proteins**, carbohydrates, and fats.","translation":"バランスの取れた食事には、適切な量のタンパク質、炭水化物、脂肪が含まれている必要がある。","type":"noun","meaning_category":"栄養"}],"japanese_reading":"たんぱくしつ"}