{"word":"liege-manship","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The skills, qualities, or practices associated with being a loyal and dutiful follower or vassal to a lord or sovereign; the art of serving one's liege effectively.","english_definition":"The skills, qualities, or practices associated with being a loyal and dutiful follower or vassal to a lord or sovereign; the art of serving one's liege effectively.","examples":[{"sentence":"His liege-manship was evident in his unwavering support for the king, even in times of crisis.","translation":"彼の忠誠心は、危機に瀕した時でさえ、国王への揺るぎない支持に明らかだった。"},{"sentence":"The young knight trained diligently to perfect his liege-manship, hoping to earn the favor of his lord.","translation":"若い騎士は、領主の寵愛を得ることを願い、忠誠心を完璧にするために熱心に訓練した。"}],"collocations":["demonstrate liege-manship","practice liege-manship","qualities of liege-manship","art of liege-manship"],"synonyms":["loyalty","fealty","vassalage","allegiance","devotion","servitude"],"antonyms":["treachery","disloyalty","rebellion","insubordination"]}],"etymology":{"value":"A compound word formed by combining 'liege' (a feudal superior to whom allegiance and service are owed) with '-manship' (a suffix denoting skill, art, or practice). The term evokes the historical context of feudalism and the relationship between a lord and his vassals.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈliːdʒmənˌʃɪp/","syllables":"liege-man-ship"},"inflection":{"noun_plural":"liege-manships"},"usage_notes":{"explanation":"'Liege-manship' is a relatively rare and somewhat archaic term, primarily used in contexts that reference or evoke feudal societies and relationships. It emphasizes the active and skillful performance of duties and obligations owed to a superior, rather than simply the state of being a vassal.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed great leadership in his liege-manship.","correct":"✓ He showed great dedication in his liege-manship.","note":"'Liege-manship' refers to the skills of a follower, not a leader. Use words like 'dedication,' 'loyalty,' or 'devotion' instead of 'leadership'."},{"incorrect":"✗ Her liege-manship was questioned because she became the queen.","correct":"✓ Her liege-manship was questioned before she became the queen.","note":"'Liege-manship' is about serving a superior. Once someone becomes a ruler, the concept of 'liege-manship' no longer applies to them in the same way."}],"priority":"★☆☆"},"related_words":{"derivatives":["liege (noun, adjective)","man (noun, in the sense of a vassal)","-ship (suffix)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency. The term is not commonly found in modern texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Liege-manship' is a sophisticated term that requires an understanding of feudal history and social structures. It describes the qualities and skills needed to be a loyal and effective vassal, emphasizing the active role of service and devotion to a lord or sovereign. The word is rarely used in contemporary contexts and is more likely to appear in historical fiction, academic texts, or discussions of feudalism."},"example_sentences":[{"sentence":"The success of the kingdom depended not only on the king's leadership but also on the liege-manship of his loyal knights.","translation":"王国の成功は、国王のリーダーシップだけでなく、忠実な騎士たちの忠誠心にもかかっていた。","type":"noun","meaning_category":"loyalty and service"},{"sentence":"He studied ancient texts to understand the true meaning of liege-manship and how to best serve his lord.","translation":"彼は領主に最善を尽くす方法と忠誠心の真の意味を理解するために、古代のテキストを研究した。","type":"noun","meaning_category":"skills of a vassal"},{"sentence":"The code of chivalry emphasized the importance of honor and liege-manship among knights.","translation":"騎士道精神は、騎士の間での名誉と忠誠心の重要性を強調した。","type":"noun","meaning_category":"code of conduct"}]}