{"word":"significand","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(言語学) 記号内容、意味内容：記号の概念的または精神的な構成要素。記号表現によって表される概念。","english_definition":"(linguistics) The conceptual or mental component of a sign; the concept represented by a signifier.","examples":[{"sentence":"In semiotics, the significand is one part of the sign, the other being the signifier.","translation":"記号学では、記号内容は記号の一部であり、もう一方は記号表現である。"},{"sentence":"The word 'tree' has a signifier (the sounds or letters) and a significand (the concept of a tree).","translation":"「木」という言葉には、記号表現（音や文字）と記号内容（木の概念）がある。"}],"collocations":["signifier and significand (記号表現と記号内容)","Saussure's theory of the sign (ソシュールの記号理論)"],"synonyms":["concept","meaning","sense","denotation","connotation"],"antonyms":["signifier (記号表現)"]},{"part_of_speech":"noun","definition":"(数学、計算機科学) 有効数字部：浮動小数点数における、仮数（仮数部）のこと。","english_definition":"(mathematics, computer science) The mantissa of a floating-point number.","examples":[{"sentence":"The significand represents the significant digits of the number.","translation":"有効数字部は、その数の有効数字を表す。"},{"sentence":"The precision of a floating-point number is determined by the number of bits in the significand.","translation":"浮動小数点数の精度は、有効数字部のビット数によって決まる。"}],"collocations":["floating-point number (浮動小数点数)","mantissa (仮数)","exponent (指数)"],"synonyms":["mantissa","coefficient"],"antonyms":["exponent (指数)"]}],"etymology":{"value":"From Latin *significans*, present participle of *significare* ('to signify').","priority":"★★☆"},"pronunciation":{"ipa":"/sɪɡˈnɪfɪkænd/","syllables":"sig-nif-i-cand"},"inflection":{"noun_plural":"significands"},"usage_notes":{"explanation":"In linguistics, 'significand' is a technical term from semiotics, particularly associated with the work of Ferdinand de Saussure. It refers to the mental concept associated with a word or sign. In computer science and mathematics, it refers to the mantissa of a floating-point number.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The significand is the physical form of the word.","correct":"✓ The signifier is the physical form of the word.","note":"The significand is the concept, while the signifier is the physical form (sound or written form)."},{"incorrect":"✗ The significand is the same as the exponent.","correct":"✓ The significand is the mantissa.","note":"In floating-point numbers, the significand is the mantissa, and the exponent is a separate part of the representation."}],"priority":"★★☆"},"related_words":{"derivatives":["signify (動詞: 意味する、表す)","signification (名詞: 意味、意義)","significant (形容詞: 重要な、意味のある)"],"related_terms":["semiotics (記号学)","signifier (記号表現)","floating-point (浮動小数点)","mantissa (仮数)","exponent (指数)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - 専門分野でのみ使用される語彙。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'significand' has two primary uses: in linguistics and in computer science/mathematics. In linguistics, particularly within semiotics, it refers to the mental concept or meaning associated with a sign, as opposed to the signifier, which is the physical form of the sign (e.g., the word or image). In computer science and mathematics, it refers to the mantissa of a floating-point number, representing the significant digits of that number. Understanding the context is crucial to interpreting the intended meaning of 'significand'."},"example_sentences":[{"sentence":"Saussure argued that the relationship between the signifier and the **significand** is arbitrary.","translation":"ソシュールは、記号表現と記号内容の関係は恣意的であると主張した。","type":"noun","meaning_category":"linguistics"},{"sentence":"The **significand** of the floating-point number determines its precision.","translation":"浮動小数点数の有効数字部は、その精度を決定する。","type":"noun","meaning_category":"computer science/mathematics"}]}