{"word":"socmen","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(historical) A class of free peasants in Anglo-Saxon England, holding land by socage tenure.","english_definition":"In Anglo-Saxon England, a class of free peasants who held land by socage tenure, owing services to their lord but not being bound to the land like serfs.","examples":[{"sentence":"The socmen formed a significant portion of the rural population in the Danelaw.","translation":"ソクメンはデーンロウ地方の農村人口のかなりの部分を占めていた。"},{"sentence":"Unlike villeins, socmen had greater freedom and could sell their land with the lord's permission.","translation":"ヴィレインとは異なり、ソクメンはより大きな自由を持ち、領主の許可を得て土地を売ることができた。"}],"collocations":["socman's land","socage tenure","Danelaw socmen"],"synonyms":["free peasant","sokeman"],"antonyms":["villein","serf","bondman"]}],"etymology":{"value":"Derived from the Old English 'sōcman,' meaning 'a man entitled to seek (a court or jurisdiction),' from 'sōc' (jurisdiction, privilege) + 'man' (man).","priority":"★★☆"},"pronunciation":{"ipa":"ˈsɒkmən","syllables":"soc-men"},"inflection":{"noun_plural":"socmen"},"usage_notes":{"explanation":"'Socmen' refers to a specific social class in Anglo-Saxon England, particularly prevalent in the Danelaw (areas under Danish law). They were free peasants who held land through socage tenure, meaning they owed certain services or payments to their lord but were not tied to the land as serfs were. This term is primarily used in historical contexts when discussing the social and economic structures of early medieval England.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The socmen were slaves of the Anglo-Saxon lords.","correct":"✓ The socmen were free peasants who owed services to their lords.","note":"Socmen were free, not slaves. They had obligations but were not bound to the land like serfs."},{"incorrect":"✗ Socmen were primarily found in Norman England.","correct":"✓ Socmen were primarily found in Anglo-Saxon England, especially in the Danelaw.","note":"Socmen existed before the Norman Conquest, particularly in areas influenced by Danish law."}],"priority":"★★☆"},"related_words":{"derivatives":["socage (noun: a form of land tenure involving fixed services)","soke (noun: a jurisdiction or territory subject to a particular lord)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - primarily used in historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Socmen' is a historical term referring to a class of free peasants in Anglo-Saxon England who held land by socage tenure. Understanding this term requires knowledge of medieval English social structures and landholding systems. They were distinct from serfs or villeins, as they had more freedom and rights, including the ability to sell their land with the lord's permission. This term is mainly encountered in historical studies and academic texts related to early English history.","priority":"★★☆"},"example_sentences":[{"sentence":"The Domesday Book provides valuable information about the distribution and status of socmen across England.","translation":"ドゥームズデイ・ブックは、イングランド全土におけるソクメンの分布と地位に関する貴重な情報を提供している。","type":"noun","meaning_category":"historical class"},{"sentence":"Socmen in the Danelaw often had more favorable terms of tenure compared to peasants in other regions.","translation":"デーンロウのソクメンは、他の地域の農民と比較して、より有利な保有条件を持っていることが多かった。","type":"noun","meaning_category":"historical class"}]}