{"word":"cinquefoils","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"キジムシロ属の植物","english_definition":"A plant of the genus Potentilla, typically having five leaflets to each leaf.","examples":[{"sentence":"The garden was filled with various cinquefoils, adding a touch of wild beauty.","translation":"庭は様々なキジムシロ属の植物で満たされ、野生の美しさを添えていた。"},{"sentence":"Cinquefoils are known for their medicinal properties in some traditional practices.","translation":"キジムシロ属の植物は、伝統的な慣習において薬効があることで知られている。"}],"collocations":["wild cinquefoil","creeping cinquefoil","silver cinquefoil"],"synonyms":["potentilla"],"antonyms":[]}],"etymology":{"value":"Derived from the French word 'cinquefoil', meaning 'five leaves'. This comes from Latin 'quinque' (five) and 'folium' (leaf).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɪŋkfɔɪlz/","syllables":"cinque-foils"},"inflection":{"noun_plural":"cinquefoils"},"usage_notes":{"explanation":"'Cinquefoils' refers to plants in the genus *Potentilla*. They are characterized by having leaves that are divided into five leaflets, though some species may have more. The name literally means 'five leaves'. They are often found in temperate regions and are used in gardens for their attractive foliage and flowers.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a cinquefoil with only three leaves.","correct":"✓ I saw a potentilla with only three leaves.","note":"While some potentilla species may have leaves with more or less than five leaflets, the defining characteristic of cinquefoils is generally the five leaflets. If it has three, it might be a different plant altogether."}],"priority":"★☆☆"},"related_words":{"derivatives":["potentilla"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cinquefoils' are plants belonging to the genus *Potentilla*. They are named for their five-leafleted foliage. The term is botanical and may not be familiar to those outside of botany or gardening. The word is of French and Latin origin, reflecting its historical classification.","priority":"★☆☆"},"example_sentences":[{"sentence":"The meadow was dotted with yellow cinquefoils.","translation":"草原には黄色いキジムシロ属の植物が点在していた。","type":"noun","meaning_category":"plant"},{"sentence":"She added dried cinquefoils to her herbal tea blend.","translation":"彼女は乾燥させたキジムシロ属の植物をハーブティーのブレンドに加えた。","type":"noun","meaning_category":"plant"}]}