{"word":"scabridity","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ざらざらしていること、粗面性","english_definition":"the state or quality of being scabrid; roughness.","examples":[{"sentence":"The scabridity of the leaf surface helps to reduce water loss.","translation":"葉の表面の粗面性は、水分の損失を減らすのに役立ちます。"},{"sentence":"The artist emphasized the scabridity of the rock in his sculpture.","translation":"アーティストは彫刻で岩のざらざらした質感を強調しました。"}],"collocations":["surface scabridity","leaf scabridity"],"synonyms":["roughness","asperity","unevenness","coarseness"],"antonyms":["smoothness","evenness","flatness"]}],"etymology":{"value":"Derived from 'scabrid', which comes from the Latin word 'scaber' meaning 'rough' or 'scabby'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌskæbrɪˈdɪti/","syllables":"scab-rid-i-ty"},"inflection":{"noun_plural":"scabridities"},"usage_notes":{"explanation":"'Scabridity' is a relatively uncommon word used to describe the quality of having a rough surface. It is often used in scientific or technical contexts, such as botany or materials science, to describe the texture of leaves, rocks, or other materials.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The scabridity was very smooth.","correct":"✓ The surface had a high degree of scabridity.","note":"Scabridity refers to roughness, so it cannot be smooth. Use it to describe the degree or characteristic of roughness."}],"priority":"★★☆"},"related_words":{"derivatives":["scabrid (adjective: rough, having a rough surface)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Scabridity' is a technical term referring to the quality of being rough or having a rough surface. It's not commonly used in everyday language and is more likely to appear in scientific or technical contexts when describing textures or surface properties."},"example_sentences":[{"sentence":"The high scabridity of the sandpaper makes it effective for removing paint.","translation":"サンドペーパーの高い粗面性が、塗料の除去に効果的です。","type":"noun","meaning_category":"roughness"},{"sentence":"Botanists study the scabridity of plant leaves to understand their adaptations.","translation":"植物学者は、植物の葉の粗面性を研究して、その適応を理解します。","type":"noun","meaning_category":"roughness"}]}