{"word":"Pyonephrotic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"膿腎症の、腎盂腎炎による腎臓の腫脹に関連する","english_definition":"Relating to or affected by pyonephrosis, a condition involving distension of the kidney with pus due to infection.","examples":[{"sentence":"The patient was diagnosed with a pyonephrotic kidney.","translation":"患者は膿腎症の腎臓と診断された。"},{"sentence":"Pyonephrotic changes were evident on the CT scan.","translation":"CTスキャンで膿腎症の変化が明らかになった。"}],"collocations":["pyonephrotic kidney","pyonephrotic changes","pyonephrotic patient"],"synonyms":["infected kidney","suppurative kidney"],"antonyms":["healthy kidney","normal kidney"]}],"etymology":{"value":"Derived from the Greek roots 'pyo-' (pus), 'nephro-' (kidney), and '-tic' (relating to).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpaɪoʊnɪˈfrɒtɪk/","syllables":"py-o-ne-phro-tic"},"inflection":{"notes":"The word 'pyonephrotic' is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Pyonephrotic' is a medical term specifically used to describe conditions or features associated with pyonephrosis, which is a severe kidney infection leading to pus accumulation and kidney distension. It's typically used in medical contexts, such as radiology reports or clinical discussions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The kidney was pyonephrosis.","correct":"✓ The kidney was pyonephrotic.","note":"'Pyonephrosis' is the name of the condition, while 'pyonephrotic' is the adjective describing something related to that condition."}],"priority":"★★☆"},"related_words":{"derivatives":["pyonephrosis (noun: 膿腎症)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily used in medical or scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pyonephrotic' is a specialized medical term used to describe conditions related to pyonephrosis, a severe kidney infection. It is primarily encountered in medical reports, textbooks, and discussions among healthcare professionals. Understanding this term requires a background in medical terminology."},"example_sentences":[{"sentence":"The ultrasound revealed a significantly enlarged and pyonephrotic right kidney.","translation":"超音波検査で、右腎臓が著しく肥大し、膿腎症であることが明らかになった。","type":"adjective","meaning_category":"medical condition"},{"sentence":"Prompt treatment is necessary to prevent complications from a pyonephrotic kidney.","translation":"膿腎症の腎臓からの合併症を防ぐためには、迅速な治療が必要です。","type":"adjective","meaning_category":"medical condition"}]}