{"word":"trigonic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(結晶が)三角面双像の、三方晶系の","english_definition":"(of a crystal) having trigons or triangular markings on its faces; belonging to the trigonal crystal system.","examples":[{"sentence":"Trigonic crystals often exhibit interesting surface features.","translation":"三角面双像の結晶は、興味深い表面構造を示すことが多い。"},{"sentence":"The mineral is classified as trigonic based on its crystal structure.","translation":"その鉱物は、結晶構造に基づいて三方晶系に分類される。"}],"collocations":["trigonic crystal","trigonic system","trigonic symmetry"],"synonyms":["trigonal"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek τρῐ́γωνον (trígōnon, “triangle”) + -ic.","priority":"☆☆☆"},"pronunciation":{"ipa":"/traɪˈɡɒnɪk/","syllables":"tri-gon-ic"},"inflection":{"notes":"Comparative and superlative forms are not commonly used for this adjective."},"usage_notes":{"explanation":"The term \"trigonic\" is primarily used in mineralogy and crystallography to describe crystals that exhibit trigonal symmetry or have triangular markings on their faces. It is a relatively specialized term.","priority":"☆☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["trigon (noun): A triangle, especially one with three equal sides.","trigonal (adjective): Relating to or having the form of a triangle; having three-fold symmetry."],"priority":"☆☆☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The adjective \"trigonic\" is a technical term primarily used in the fields of mineralogy and crystallography. It describes crystals that exhibit trigonal symmetry or have triangular markings on their faces. The term is not commonly encountered outside of these specialized contexts."},"example_sentences":[{"sentence":"The quartz crystal displayed a distinct trigonic habit.","translation":"その石英結晶は、明確な三角面双像の晶癖を示した。","type":"adjective","meaning_category":"crystallography"},{"sentence":"Analysis revealed the presence of trigonic symmetry in the sample.","translation":"分析により、サンプル中に三方晶系の対称性が存在することが明らかになった。","type":"adjective","meaning_category":"crystallography"}]}