{"word":"Hyperthymia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"過剰記憶症候群：異常に詳細な自伝的記憶を持つ状態。","english_definition":"A condition that leads people to be able to recall an abnormally large number of life experiences in vivid detail.","examples":[{"sentence":"People with hyperthymia can often recall what they were doing on specific dates many years ago.","translation":"過剰記憶症候群の人は、何年も前の特定の日付に何をしていたかをしばしば思い出すことができる。"},{"sentence":"Hyperthymia is not the same as having a photographic memory; it specifically relates to autobiographical memories.","translation":"過剰記憶症候群は写真記憶とは異なり、特に自伝的記憶に関連する。"}],"collocations":["possess hyperthymia","study hyperthymia","diagnose hyperthymia"],"synonyms":["highly superior autobiographical memory (HSAM)"],"antonyms":["amnesia","forgetfulness"]},{"part_of_speech":"noun","definition":"高揚気分：軽躁病または躁病に関連する、持続的な高揚した気分または過度の幸福感。","english_definition":"A persistent elevated mood or excessive cheerfulness, often associated with hypomania or mania.","examples":[{"sentence":"Hyperthymia can be a symptom of bipolar disorder.","translation":"高揚気分は双極性障害の症状である可能性がある。"},{"sentence":"Unlike normal happiness, hyperthymia can be disruptive and impair judgment.","translation":"通常の幸福感とは異なり、高揚気分は破壊的で判断力を損なう可能性がある。"}],"collocations":["experience hyperthymia","suffer from hyperthymia","manage hyperthymia"],"synonyms":["hypomania","mania","elevated mood"],"antonyms":["depression","dysthymia"]}],"etymology":{"value":"ギリシャ語の「hyper-」（過剰な）と「thymos」（気分、感情）に由来。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpərˈθaɪmiə/","syllables":"hy-per-thy-mi-a"},"inflection":{"noun_plural":"hyperthymias"},"usage_notes":{"explanation":"「Hyperthymia」は、文脈によって2つの異なる意味を持つ医学用語です。1つ目は、非常に詳細な自伝的記憶を持つ状態（過剰記憶症候群）を指します。2つ目は、躁病または軽躁病に関連する持続的な高揚した気分（高揚気分）を指します。どちらの意味で使用されているかは、文脈から判断する必要があります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has hyperthymia, so he never forgets anything he reads in books.","correct":"✓ He has hyperthymia, so he never forgets anything about his own life.","note":"過剰記憶症候群は、自伝的記憶に特に関連しており、読んだ内容などの一般的な記憶とは異なります。"},{"incorrect":"✗ She is always happy; she must have hyperthymia.","correct":"✓ She is always happy; however, hyperthymia is a persistent elevated mood that can be disruptive.","note":"常に幸せであることと高揚気分は異なります。高揚気分は病的な状態であり、判断力を損なう可能性があります。"}],"priority":"★★☆"},"related_words":{"derivatives":["hyperthymic (形容詞: 過剰記憶症候群の、高揚気分の)"],"related_medical_terms":["bipolar disorder","mania","hypomania","dysthymia","amnesia"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な医学用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Hyperthymia**」は、主に医学や心理学の分野で使用される専門用語です。大きく分けて2つの意味があり、1つは「過剰記憶症候群」という、非常に詳細な自伝的記憶を持つ状態を指します。もう1つは「高揚気分」という、躁病や軽躁病に見られる持続的な高揚した気分を指します。日常会話で使われることは稀で、専門的な文脈でのみ使用されることが多いです。文脈によって意味が異なるため、注意が必要です。"},"example_sentences":[{"sentence":"Research into hyperthymia may provide insights into the nature of memory.","translation":"過剰記憶症候群の研究は、記憶の性質に関する洞察を提供する可能性がある。","type":"noun","meaning_category":"過剰記憶症候群"},{"sentence":"The patient exhibited hyperthymia, characterized by an unusually cheerful disposition.","translation":"患者は、異常に陽気な気質を特徴とする高揚気分を示した。","type":"noun","meaning_category":"高揚気分"}]}