{"word":"lamnoid","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ネズミザメ目の","english_definition":"Relating to or belonging to the order Lamniformes (mackerel sharks).","examples":[{"sentence":"The great white shark is a lamnoid shark.","translation":"ホオジロザメはネズミザメ目のサメです。"}],"collocations":[],"synonyms":["lamniform"],"antonyms":[]},{"part_of_speech":"noun","definition":"ネズミザメ目のサメ","english_definition":"A shark belonging to the order Lamniformes.","examples":[{"sentence":"Lamnoids are characterized by their spindle-shaped bodies and two dorsal fins.","translation":"ネズミザメ目のサメは、紡錘形の体と2つの背びれを持つことが特徴です。"}],"collocations":[],"synonyms":["lamniform shark"],"antonyms":[]}],"etymology":{"value":"From the order name Lamniformes, derived from the genus *Lamna* (mackerel sharks) + -oid (resembling).","priority":"★★★"},"pronunciation":{"ipa":"/ˈlæmnɔɪd/","syllables":"lam-noid"},"inflection":{"noun_plural":"lamnoids"},"usage_notes":{"explanation":"'Lamnoid' is a term used in marine biology and ichthyology to refer to sharks belonging to the order Lamniformes. This order includes well-known sharks such as the great white shark, mackerel shark, and thresher shark. The term can be used as both an adjective and a noun.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Lamniformes (noun: the order of mackerel sharks)","Lamna (noun: a genus of mackerel sharks)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'lamnoid' is a technical term used in the field of marine biology, specifically when discussing sharks. It refers to sharks belonging to the order Lamniformes, which includes several well-known species. Due to its specialized nature, it is not commonly used in everyday language."},"example_sentences":[{"sentence":"The lamnoid sharks are apex predators in many marine ecosystems.","translation":"ネズミザメ目のサメは、多くの海洋生態系における頂点捕食者です。","type":"noun","meaning_category":"ネズミザメ目のサメ"},{"sentence":"Lamnoid characteristics include a heterocercal tail and well-developed teeth.","translation":"ネズミザメ目の特徴には、異尾と発達した歯が含まれます。","type":"adjective","meaning_category":"ネズミザメ目の"}]}