{"word":"bibliokleptomania","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"窃書症、書物窃盗癖","english_definition":"A compulsion to steal books.","examples":[{"sentence":"His bibliokleptomania led him to amass a large, illicit library.","translation":"彼の窃書症は、彼に大規模な違法な図書館を築かせた。"},{"sentence":"Bibliokleptomania is a rare but documented psychological disorder.","translation":"窃書症はまれだが、記録されている心理的障害である。"}],"collocations":["suffer from bibliokleptomania","diagnosed with bibliokleptomania","treat bibliokleptomania"],"synonyms":["book thievery","compulsive book theft"],"antonyms":["bibliophilia","book collecting"]}],"etymology":{"value":"Derived from the Greek words 'biblio' (book), 'klepto' (to steal), and 'mania' (madness, obsession).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbɪbli.oʊˌklɛptoʊˈmeɪniə/","syllables":"bib-li-o-klep-to-ma-ni-a"},"inflection":{"noun_plural":"bibliokleptomanias"},"usage_notes":{"explanation":"Bibliokleptomania is considered a psychological disorder characterized by the compulsive stealing of books, often without any financial need or intent to sell them. It is related to kleptomania, which is a more general impulse control disorder involving the urge to steal.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a bibliokleptomaniac, so he loves books.","correct":"✓ He is a bibliokleptomaniac, so he steals books.","note":"Bibliokleptomania is the compulsion to steal books, not simply a love of books (bibliophilia)."},{"incorrect":"✗ Bibliokleptomania is when you read a lot of books.","correct":"✓ Bibliokleptomania is when you compulsively steal books.","note":"It's about stealing, not reading."}],"priority":"★★☆"},"related_words":{"derivatives":["bibliokleptomaniac (noun: a person who suffers from bibliokleptomania)","kleptomania (noun: a general compulsion to steal)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare word)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Bibliokleptomania' is a very rare and specialized term referring to the compulsive stealing of books. It combines elements from Greek roots related to books, stealing, and mania, indicating an obsessive or compulsive behavior. Due to its rarity, it's unlikely to be encountered outside of specialized contexts such as psychology or discussions of rare disorders."},"example_sentences":[{"sentence":"The psychiatrist suspected bibliokleptomania when he learned the patient had hundreds of stolen books.","translation":"精神科医は、患者が数百冊の盗まれた本を持っていることを知ったとき、窃書症を疑った。","type":"general","meaning_category":"compulsive stealing of books"},{"sentence":"While bibliophilia is a love for books, bibliokleptomania is the irresistible urge to steal them.","translation":"愛書癖が本への愛であるのに対し、窃書症は本を盗みたいという抑えきれない衝動である。","type":"contrast","meaning_category":"compulsive stealing of books"}]}