{"word":"nonprocreation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"非生殖、子孫を作らないこと","english_definition":"The practice or state of not procreating; the choice or condition of not producing offspring.","examples":[{"sentence":"Some people choose nonprocreation for environmental reasons.","translation":"環境上の理由から非生殖を選ぶ人もいる。"},{"sentence":"The organization promotes nonprocreation as a solution to overpopulation.","translation":"その組織は人口過多の解決策として非生殖を推進している。"},{"sentence":"Nonprocreation can be a personal decision based on various factors.","translation":"非生殖は様々な要因に基づく個人的な決定となり得る。"}],"collocations":["voluntary nonprocreation (自発的非生殖)","ethical nonprocreation (倫理的非生殖)","advocate for nonprocreation (非生殖の提唱者)"],"synonyms":["childlessness","sterility","antinatalism"],"antonyms":["procreation","reproduction","breeding"]}],"etymology":{"value":"\"Non-\" (否定) + \"procreation\" (生殖)。","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˌproʊkriˈeɪʃən/","syllables":"non-pro-cre-a-tion"},"inflection":{"noun_plural":"nonprocreations"},"usage_notes":{"explanation":"\"Nonprocreation\" is a formal term referring to the act or state of not producing offspring. It is often used in discussions about population control, environmental ethics, and personal reproductive choices. The term can be neutral or carry specific ideological connotations depending on the context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Non-procreation is when you don't have kids.","correct":"✓ Nonprocreation is the practice of not having children.","note":"The corrected sentence provides a more formal and accurate definition."},{"incorrect":"✗ He is nonprocreation.","correct":"✓ He practices nonprocreation. / ✓ He is choosing nonprocreation.","note":"\"Nonprocreation\" is a noun, not an adjective. Use the correct verb form to describe someone's actions or choices."}],"priority":"★★☆"},"related_words":{"derivatives":["nonprocreative (adjective)"],"phrases":["antinatalism (反出生主義)","childfree (子供のいないことを肯定的に捉える)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonprocreation\" is a formal term used to describe the act or state of not producing offspring. It is often encountered in academic or philosophical discussions related to population control, environmental ethics, or personal reproductive choices. Understanding this term requires a good grasp of abstract concepts and formal vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The couple made a conscious decision of nonprocreation.","translation":"その夫婦は意識的に非生殖の決断をした。","type":"general","meaning_category":"General Use"},{"sentence":"Some environmentalists advocate nonprocreation to reduce the strain on the planet's resources.","translation":"一部の環境保護論者は地球の資源への負担を軽減するために非生殖を提唱している。","type":"ethical","meaning_category":"Ethical/Environmental"},{"sentence":"The study examined the social attitudes towards nonprocreation.","translation":"その研究は非生殖に対する社会的な態度を調査した。","type":"social","meaning_category":"Social Studies"}]}