{"word":"Platonism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"プラトン主義：プラトンの哲学体系、またはそれに影響を受けた哲学思想","english_definition":"The philosophy of Plato or systems of thought derived from it.","examples":[{"sentence":"Platonism emphasizes the distinction between the world of appearances and the world of Forms.","translation":"プラトン主義は、現象世界とイデア界の区別を強調する。"},{"sentence":"Many Renaissance thinkers were influenced by Platonism.","translation":"ルネサンス期の思想家の多くはプラトン主義の影響を受けた。"}],"collocations":["Neoplatonism (新プラトン主義)","Platonic love (プラトニックラブ、精神的な愛)","Theory of Forms (イデア論)"],"synonyms":["Idealism","Realism (in the philosophical sense)"],"antonyms":["Materialism","Empiricism"]}],"etymology":{"value":"Derived from the name of the ancient Greek philosopher Plato (Πλάτων).","priority":"★★★"},"pronunciation":{"ipa":"ˈpleɪtoʊnɪzəm","syllables":"Pla-to-nism"},"inflection":{"notes":"This is a noun and does not inflect for number in the typical way (though one could discuss 'Platonisms' to refer to different interpretations)."},"usage_notes":{"explanation":"\"Platonism\" refers to the philosophical ideas associated with Plato, including his theory of Forms, his emphasis on reason and intellect, and his belief in the immortality of the soul. It often contrasts with materialism and empiricism, which emphasize the importance of sensory experience.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a follower of Platon.","correct":"✓ He is a follower of Platonism. / ✓ He is a Platonist.","note":"\"Platon\" is the name of the philosopher, not the philosophical system. Use \"Platonism\" to refer to the philosophy, or \"Platonist\" to refer to a follower of Platonism."}],"priority":"★★☆"},"related_words":{"derivatives":["Platonic (形容詞：プラトンの、プラトン的な)","Platonist (名詞：プラトン主義者)","Neoplatonism (新プラトン主義)","Neoplatonist (新プラトン主義者)"],"phrases":["Theory of Forms","Allegory of the Cave","Platonic Solids"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent, but common in philosophical discussions.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"\"Platonism\" is a term used in philosophy to describe the ideas of Plato, a famous ancient Greek philosopher. It involves complex concepts such as the distinction between the physical world and the world of Forms (perfect, unchanging ideas). Understanding Platonism requires familiarity with philosophical terminology and abstract thought. It's often discussed in higher-level academic contexts."},"example_sentences":[{"sentence":"The professor lectured on the core tenets of Platonism.","translation":"教授はプラトン主義の中核となる教義について講義した。","type":"general","meaning_category":"definition"},{"sentence":"Her art reflects a strong influence from Platonism, particularly the concept of ideal forms.","translation":"彼女の芸術はプラトン主義、特にイデアの概念からの強い影響を反映している。","type":"application","meaning_category":"influence"},{"sentence":"Critics of Platonism argue that its dualistic view of reality is overly simplistic.","translation":"プラトン主義の批判者たちは、その二元論的な現実観が単純化されすぎていると主張する。","type":"criticism","meaning_category":"critique"}]}