{"word":"patroclinous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(遺伝子が)父親似の、父性遺伝の","english_definition":"Exhibiting or pertaining to patrocliny; resembling the father more than the mother.","examples":[{"sentence":"The child's strong jawline is a patroclinous trait, clearly inherited from his father.","translation":"その子のしっかりした顎のラインは父性遺伝の特徴で、父親から明らかに受け継がれている。"},{"sentence":"Patroclinous inheritance can sometimes lead to children looking remarkably like their fathers.","translation":"父性遺伝は、時に子供たちが父親に著しく似た外見になることがある。"}],"collocations":["patroclinous trait (父性遺伝の形質)","patroclinous inheritance (父性遺伝)"],"synonyms":["paternal","father-like","patrilineal"],"antonyms":["matroclinous","maternal","mother-like"]},{"part_of_speech":"adjective","definition":"(生物学) 父親に似た特徴を持つ","english_definition":"(Biology) Having characteristics more similar to the father than to the mother.","examples":[{"sentence":"The patroclinous offspring displayed the father's resistance to a certain disease.","translation":"その父親似の子孫は、父親が持っていた特定の病気への抵抗性を示した。"}],"collocations":["patroclinous offspring (父親似の子孫)","patroclinous features (父親似の特徴)"],"synonyms":["paternally similar","father-resembling"],"antonyms":["matroclinously similar","mother-resembling"]}],"etymology":{"value":"Derived from the Greek words 'patēr' (father) and 'klinein' (to lean, incline).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpætrəˈklaɪnəs/","syllables":"pa-tro-cli-nous"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more patroclinous' and 'most patroclinous'. "},"usage_notes":{"explanation":"'Patroclinous' is a term primarily used in genetics and biology to describe offspring that more closely resemble their father in terms of inherited traits. It is often contrasted with 'matroclinous', which describes offspring that more closely resemble their mother.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patroclinous child was raised by his mother only.","correct":"✓ The child was patroclinous, resembling his father, but was raised by his mother only.","note":"'Patroclinous' describes genetic similarity, not necessarily the upbringing or family structure."}],"priority":"★☆☆"},"related_words":{"derivatives":["patrocliny (noun: the condition of being patroclinous)"],"phrasal_verbs":[],"related_terms":["matroclinous (adjective: resembling the mother more than the father)","inheritance (noun: the passing on of genetic traits)","genetics (noun: the study of heredity and the variation of inherited characteristics)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Patroclinous' is a specialized term used in genetics to describe offspring that exhibit traits more similar to their father than their mother. It is a relatively rare word, typically encountered in scientific or academic contexts related to heredity and genetics. Understanding the term requires a basic knowledge of genetic inheritance and the concepts of paternal and maternal traits."},"example_sentences":[{"sentence":"The patroclinous foal inherited its father's speed and agility.","translation":"その父親似の仔馬は、父親のスピードと敏捷性を受け継いだ。","type":"adjective","meaning_category":"genetics"},{"sentence":"Scientists studied the patroclinous characteristics of the plant to understand the dominant genes.","translation":"科学者たちは、優性遺伝子を理解するために、その植物の父親似の特徴を研究した。","type":"adjective","meaning_category":"genetics"}]}