{"word":"Catdom","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"The realm, community, or collective of cats.","english_definition":"The world of cats; the collective community of cats; the state or condition of being a cat.","examples":[{"sentence":"Welcome to Catdom, where felines rule and humans serve.","translation":"猫界へようこそ。そこでは猫が支配し、人間が仕えます。"},{"sentence":"She immersed herself in the study of Catdom, learning about their habits and history.","translation":"彼女は猫界の研究に没頭し、彼らの習慣や歴史について学びました。"},{"sentence":"The laws of Catdom are simple: eat, sleep, and be adored.","translation":"猫界の法則は単純です。食べ、寝て、愛されること。"}],"collocations":["the ruler of Catdom","the laws of Catdom","the history of Catdom","the citizens of Catdom"],"synonyms":["feline world","cat society","cat community","cat kingdom"],"antonyms":["dogdom","humankind","human society"]}],"etymology":{"value":"A combination of 'cat' and the suffix '-dom', indicating a realm or state.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkæt.dəm/","syllables":"Cat-dom"},"inflection":{"noun_plural":"Catdoms"},"usage_notes":{"explanation":"'Catdom' is a somewhat whimsical or imaginative term, often used in a lighthearted or humorous way to refer to the world or community of cats. It is not a formal or widely recognized term but is used creatively in literature, fantasy, or informal contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The catdom is very large.","correct":"✓ Catdom is very large.","note":"'Catdom' itself refers to the entire realm or community, so adding 'the' is often unnecessary unless referring to a specific, defined area within it."},{"incorrect":"✗ Catdoms is a place where cats live.","correct":"✓ Catdom is a place where cats live.","note":"When referring to the general concept, 'Catdom' is typically used as a singular noun."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"None (not a standard CEFR word)","frequency_google_ngram":"Low frequency - not a common term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Catdom' is a creative and imaginative term, not commonly found in everyday language. Its understanding relies on recognizing the combination of 'cat' and '-dom' to infer the meaning of a realm or community of cats. It is more likely to be encountered in fictional works or creative writing. Therefore, it requires a higher level of vocabulary and inferential skills to understand. "},"example_sentences":[{"sentence":"In the heart of Catdom, a new queen was crowned.","translation":"猫界の中心で、新しい女王が戴冠しました。","type":"noun","meaning_category":"Realm of cats"},{"sentence":"The ancient texts spoke of the legendary heroes of Catdom.","translation":"古代の文献は、猫界の伝説的な英雄について語っていました。","type":"noun","meaning_category":"Community of cats"},{"sentence":"She dreamed of a world where all cats lived in peace and harmony, a true Catdom.","translation":"彼女はすべての猫が平和と調和の中で暮らす世界、真の猫界を夢見ていました。","type":"noun","meaning_category":"State of being a cat"}]}