{"word":"Re-hellenize","priority":"Low","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"To restore or bring back Hellenic (Greek) culture, language, or influence.","english_definition":"To restore or bring back Hellenic (Greek) culture, language, or influence.","examples":[{"sentence":"The movement sought to re-hellenize the region after centuries of foreign rule.","translation":"その運動は、数世紀にわたる外国の支配の後、その地域を再ギリシャ化しようと試みた。"},{"sentence":"Efforts were made to re-hellenize the local dialect by promoting the use of classical Greek terms.","translation":"古典ギリシャ語の用語の使用を促進することにより、現地の方言を再ギリシャ化する試みがなされた。"}],"collocations":["re-hellenize a region","re-hellenize the language","re-hellenize the culture"],"synonyms":["revive Greek culture","restore Hellenism","reintroduce Greek influence"],"antonyms":["de-hellenize","westernize","romanize"]}],"etymology":{"value":"Formed by adding the prefix \"re-\" (meaning again or anew) to the word \"Hellenize\" (meaning to make Greek in character or to adopt Greek culture).","priority":"Medium"},"pronunciation":{"ipa":"/ˌriːˈhɛlənaɪz/","syllables":"Ree-hel-len-ize"},"inflection":{"verb_forms":{"present_simple":["re-hellenize","re-hellenizes"],"past_simple":"re-hellenized","past_participle":"re-hellenized","present_participle":"re-hellenizing"}},"usage_notes":{"explanation":"The term \"re-hellenize\" is typically used in historical or cultural contexts to describe efforts to revive or restore Greek culture, language, or influence in a region or among a population. It often implies a previous period of Hellenization followed by a decline or suppression of Greek elements.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"✗ The country was re-hellenized with new technology.","correct":"✓ The country was re-hellenized with Greek traditions.","note":"Re-hellenization refers specifically to the restoration of Greek culture, language, or influence, not general modernization."}],"priority":"Low"},"related_words":{"derivatives":["Hellenize","Hellenization","Hellenic"],"phrases":["Re-Hellenization"],"priority":"Medium"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C2","text":"The word 're-hellenize' is a specialized term used in historical and cultural studies. It describes the process of restoring or reviving Greek (Hellenic) culture, language, or influence in a place or society. This term is not commonly used in everyday conversation and is more likely to be encountered in academic or scholarly contexts dealing with ancient or historical Greece and its impact on other cultures."},"example_sentences":[{"sentence":"Historians studied the attempts to re-hellenize the coastal cities after the Roman Empire.","translation":"歴史家たちは、ローマ帝国の後、沿岸都市を再ギリシャ化しようとした試みを研究した。","type":"verb","meaning_category":"Restoring Greek culture"},{"sentence":"The university implemented a program to re-hellenize the study of ancient texts.","translation":"大学は古代のテキストの研究を再ギリシャ化するためのプログラムを実施した。","type":"verb","meaning_category":"Restoring Greek language"}]}