{"word":"pseudohallucinatory","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"仮性幻覚性の、偽幻覚性の","english_definition":"Relating to or characterized by pseudohallucinations, which are vivid mental images or experiences that are recognized as not being real.","examples":[{"sentence":"The patient reported pseudohallucinatory experiences, such as seeing vivid colors that he knew were not actually present.","translation":"患者は、実際には存在しないと認識している鮮やかな色を見るなど、仮性幻覚的な体験を報告しました。"},{"sentence":"Pseudohallucinatory phenomena can be associated with certain neurological conditions.","translation":"仮性幻覚現象は、特定の神経学的状態に関連している可能性があります。"}],"collocations":["pseudohallucinatory experiences","pseudohallucinatory phenomena","pseudohallucinatory state"],"synonyms":["illusory","vivid imagery","mental imagery"],"antonyms":["realistic","veridical","perceptual"]},{"part_of_speech":"adjective","definition":"（比喩的に）現実感のない、非現実的な","english_definition":"(Figuratively) Lacking a sense of reality; unreal.","examples":[{"sentence":"The artist's work had a pseudohallucinatory quality, blurring the line between reality and imagination.","translation":"その芸術家の作品には、現実と想像の境界線を曖昧にする、仮性幻覚的な質があった。"}],"collocations":["pseudohallucinatory quality","pseudohallucinatory atmosphere"],"synonyms":["surreal","dreamlike","phantasmagoric"],"antonyms":["realistic","grounded","tangible"]}],"etymology":{"value":"The word is formed from 'pseudo-' (meaning false or imitation) + 'hallucinatory' (relating to hallucinations). It describes experiences that resemble hallucinations but are recognized by the individual as not being real.","priority":"★★☆"},"pronunciation":{"ipa":"ˌsjuːdoʊhəˈluːsɪnətɔːri","syllables":"pseu-do-hal-lu-cin-a-to-ry"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than for comparative and superlative forms (which are less common for longer words like this)."},"usage_notes":{"explanation":"'Pseudohallucinatory' describes experiences that are vivid and may resemble hallucinations, but the key difference is that the person experiencing them recognizes that they are not real or externally generated. This contrasts with true hallucinations, where the person believes the experience is real. It is often used in the context of mental health, neurology, and altered states of consciousness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was having pseudohallucinations and believed they were real.","correct":"✓ He was having pseudohallucinations, but he knew they weren't real.","note":"The defining characteristic of pseudohallucinations is that the person knows they are not real. If they believe they are real, it would be a true hallucination."}],"priority":"★☆☆"},"related_words":{"derivatives":["pseudohallucination (noun)"],"phrases":["altered state of consciousness","mental imagery","perceptual distortion"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'pseudohallucinatory' is a specialized term primarily used in the fields of psychology, psychiatry, and neurology. It refers to experiences that are similar to hallucinations in their vividness and sensory qualities, but differ in that the individual experiencing them recognizes that they are not real or externally generated. Understanding this term requires a grasp of the distinction between internal mental processes and external reality. It's not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The patient described the visual phenomena as pseudohallucinatory, acknowledging that they were internal images rather than external perceptions.","translation":"患者は、その視覚現象を仮性幻覚的であると説明し、それらが外部からの知覚ではなく、内部のイメージであることを認めた。","type":"medical/psychological context","meaning_category":"仮性幻覚性の"},{"sentence":"The novel created a pseudohallucinatory atmosphere, blurring the boundaries between the protagonist's inner world and external reality.","translation":"その小説は、主人公の内面世界と外部現実の境界線を曖昧にする、仮性幻覚的な雰囲気を作り出した。","type":"literary/artistic context","meaning_category":"非現実的な"}]}