{"word":"misconsecrate","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(教会などを)誤って聖別する、不適切に聖別する","english_definition":"To consecrate wrongly or improperly.","examples":[{"sentence":"The old chapel was misconsecrated, leading to its eventual abandonment.","translation":"その古い礼拝堂は誤って聖別されたため、最終的には放棄されることになった。"},{"sentence":"Some historians argue that the site was misconsecrated due to a misunderstanding of ancient rituals.","translation":"一部の歴史家は、古代の儀式の誤解により、その場所が誤って聖別されたと主張している。"}],"collocations":["misconsecrate a church","misconsecrate a site"],"synonyms":["desecrate","profane","unhallow"],"antonyms":["consecrate","hallow","sanctify"]}],"etymology":{"value":"\"mis-\" (wrongly) + \"consecrate\" (to make sacred).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɪsˈkɒnsɪkreɪt/","syllables":"mis-con-se-crate"},"inflection":{"verb_forms":{"present_simple":["misconsecrate","misconsecrates"],"past_simple":"misconsecrated","past_participle":"misconsecrated","present_participle":"misconsecrating"}},"usage_notes":{"explanation":"\"Misconsecrate\" is a relatively rare word, primarily used in religious or historical contexts. It implies that a place or object intended for sacred use was consecrated in an incorrect or inappropriate manner, rendering the consecration invalid or ineffective.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The priest misconsecrated the wine by drinking it all.","correct":"✓ The priest desecrated the wine by drinking it all.","note":"\"Misconsecrate\" refers to an improper act of consecration, not a deliberate act of defilement. \"Desecrate\" is more appropriate for intentionally violating something sacred."}],"priority":"★★☆"},"related_words":{"derivatives":["misconsecration (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely rare.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'misconsecrate' is a highly specialized term, primarily encountered in theological or historical discussions related to religious practices. It denotes an error or impropriety in the act of consecration, rendering the object or place not truly sacred. Due to its rarity and specific context, it is unlikely to be encountered by non-specialists."},"example_sentences":[{"sentence":"The ancient temple was believed to have been misconsecrated by a rival sect.","translation":"その古代寺院は、対立宗派によって誤って聖別されたと信じられていた。","type":"verb","meaning_category":"Improper consecration"},{"sentence":"A historian argued that the site had been misconsecrated, leading to its diminished religious significance.","translation":"ある歴史家は、その場所が誤って聖別されたため、宗教的な重要性が低下したと主張した。","type":"verb","meaning_category":"Improper consecration"}]}