{"word":"non-nociceptive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"侵害受容性でない、侵害受容に関与しない","english_definition":"Not relating to or involving nociception (the sensory nervous system's response to certain harmful or potentially harmful stimuli).","examples":[{"sentence":"Non-nociceptive sensory input can also modulate pain perception.","translation":"非侵害受容性の感覚入力もまた、痛みの知覚を調節することができる。"},{"sentence":"The study focused on distinguishing between nociceptive and non-nociceptive neurons.","translation":"その研究は、侵害受容性ニューロンと非侵害受容性ニューロンを区別することに焦点を当てた。"}],"collocations":["non-nociceptive neuron (非侵害受容性ニューロン)","non-nociceptive stimulus (非侵害受容性刺激)","non-nociceptive pathway (非侵害受容性経路)"],"synonyms":["non-painful","non-noxious"],"antonyms":["nociceptive","painful","noxious"]}],"etymology":{"value":"\"non-\" (否定) + \"nociceptive\" (侵害受容性の)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˌnoʊsɪˈsɛptɪv/","syllables":"non-no-ci-cep-tive"},"inflection":{"notes":"形容詞なので、比較級・最上級は通常使用しません。"},"usage_notes":{"explanation":"\"Non-nociceptive\" is a term used in the context of sensory physiology and pain research. It describes stimuli, neurons, or pathways that do not activate or transmit signals related to nociception, which is the process by which the body detects and responds to potentially harmful stimuli. It's often used to differentiate between sensory inputs that cause pain and those that do not.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient reported non-nociception in their arm.","correct":"✓ The patient reported a lack of nociception/sensation in their arm.","note":"\"Non-nociception\" isn't typically used to describe a state or sensation. Instead, it's used to describe stimuli, neurons, or pathways. To describe a lack of pain sensation, use \"lack of nociception\" or \"lack of sensation.\""}],"priority":"★★☆"},"related_words":{"derivatives":["nociception (侵害受容)","nociceptor (侵害受容器)","nociceptive (侵害受容性の)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (専門的な文脈でのみ使用される)","frequency_google_ngram":"低頻度 (Low frequency) - 医学・生理学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Non-nociceptive\" is a specialized term used in medicine and physiology to describe something that is not related to the sensation of pain. It's used to distinguish between different types of sensory information that the body receives. If something is non-nociceptive, it means it doesn't trigger the body's pain response. This term is primarily found in scientific and medical contexts.","example_sentences":[]},"example_sentences":[{"sentence":"Massage therapy can stimulate non-nociceptive pathways, potentially reducing pain.","translation":"マッサージ療法は非侵害受容性経路を刺激し、潜在的に痛みを軽減する可能性がある。","type":"adjective","meaning_category":"侵害受容性でない"}]}