{"word":"Salpid","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A free-swimming marine invertebrate of the class Thaliacea (formerly Salpidae), having a transparent, barrel-shaped body.","english_definition":"A free-swimming marine invertebrate of the class Thaliacea, having a transparent, barrel-shaped body.","examples":[{"sentence":"Salpids are important grazers of phytoplankton in the ocean.","translation":"サルパは海洋における植物プランクトンの重要な捕食者です。"},{"sentence":"Some salpid species form long chains of individuals.","translation":"サルパの中には、個体が長い鎖状になる種もいます。"}],"collocations":["salpid bloom","salpid chain","salpid population","salpid filter feeding"],"synonyms":["sea squirt","tunicate"],"antonyms":[]}],"etymology":{"value":"From New Latin Salpidae, from Salpa (the type genus) + -idae.","priority":"N/A"},"pronunciation":{"ipa":"/ˈsælpɪd/","syllables":"sal-pid"},"inflection":{"noun_plural":"salpids"},"usage_notes":{"explanation":"Salpids are gelatinous zooplankton that play a significant role in the marine food web and carbon cycle. They are known for their ability to rapidly reproduce and form large blooms.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["Salpidae (family name)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Salpid' is a scientific term referring to a specific type of marine invertebrate. Understanding requires familiarity with marine biology and zoological classification. The term is rarely used in general conversation."},"example_sentences":[{"sentence":"The research focused on the role of salpids in carbon sequestration.","translation":"その研究は、炭素隔離におけるサルパの役割に焦点を当てていた。","type":"noun","meaning_category":"marine invertebrate"},{"sentence":"Salpid blooms can have a significant impact on phytoplankton populations.","translation":"サルパの大量発生は、植物プランクトンの個体数に大きな影響を与える可能性がある。","type":"noun","meaning_category":"marine invertebrate"}]}