{"word":"mushrebiyeh","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"マシュラビーヤ（アラビア建築の伝統的な木製の出窓）","english_definition":"an oriel window enclosed with carved wood latticework located on the second story or higher of a building, often used in traditional Arabic architecture.","examples":[{"sentence":"The old house had a beautiful mushrebiyeh overlooking the street.","translation":"その古い家には、通りを見下ろす美しいマシュラビーヤがあった。"},{"sentence":"Mushrebiyehs were designed to provide shade and ventilation.","translation":"マシュラビーヤは、日陰と換気を提供するために設計された。"}],"collocations":["traditional mushrebiyeh","wooden mushrebiyeh","ornate mushrebiyeh"],"synonyms":["mashrabiya","mashrabiyah","moucharabieh","shanasheel"],"antonyms":[]},{"part_of_speech":"noun","definition":"マシュラビーヤ様式の装飾","english_definition":"a type of decorative latticework or screen inspired by the design of traditional mushrebiyehs.","examples":[{"sentence":"The modern building incorporated a mushrebiyeh-inspired facade.","translation":"その現代的な建物は、マシュラビーヤに触発されたファサードを取り入れた。"}],"collocations":["mushrebiyeh screen","mushrebiyeh facade","mushrebiyeh pattern"],"synonyms":["latticework","screen","jali"],"antonyms":[]}],"etymology":{"value":"From Arabic مَشْرَبِيَّة‎ (mašrabiyya), from شَرِبَ‎ (šariba, “to drink”). Originally a place where water jars were placed to be cooled by evaporation.","priority":"★★☆"},"pronunciation":{"ipa":"/mʊʃrəˈbiːə/","syllables":"mush-re-bi-yeh"},"inflection":{"noun_plural":"mushrebiyehs"},"usage_notes":{"explanation":"'Mushrebiyeh' refers to a specific architectural element, a type of oriel window with wooden latticework, common in traditional Arabic homes. It is designed to provide privacy, shade, and ventilation. The term can also refer to decorative elements inspired by this architectural feature.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a beautiful mashrabiya in the window, it was made of metal.","correct":"✓ I saw a beautiful mashrabiya in the window, it was made of wood.","note":"Mashrabiyas are traditionally made of wood."}],"priority":"★☆☆"},"related_words":{"derivatives":["mashrabiya","mashrabiyah","moucharabieh","shanasheel"],"related_terms":["Arabic architecture","Islamic architecture","latticework","oriel window"]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word 'mushrebiyeh' refers to a specific element of traditional Arabic architecture. It's a type of window with intricate wooden latticework. Because it's a specialized term related to a particular cultural context, it's not commonly used in everyday English. Understanding its meaning requires some familiarity with architectural terms and Middle Eastern culture."},"example_sentences":[{"sentence":"The intricate **mushrebiyeh** allowed the women of the house to observe the street without being seen.","translation":"複雑なマシュラビーヤのおかげで、家の女性たちは見られることなく通りを観察することができた。","type":"noun","meaning_category":"architectural feature"},{"sentence":"The restaurant's decor included a modern interpretation of a **mushrebiyeh** screen.","translation":"レストランの装飾には、マシュラビーヤのスクリーンの現代的な解釈が含まれていた。","type":"noun","meaning_category":"decorative element"}]}