{"word":"sclerophyllous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"硬葉の、強葉植物の","english_definition":"(of vegetation) having hard, leathery, evergreen leaves that are adapted to reduce water loss.","examples":[{"sentence":"Sclerophyllous vegetation is common in Mediterranean climates.","translation":"硬葉植物は地中海性気候でよく見られる。"},{"sentence":"Eucalyptus trees are a typical example of sclerophyllous plants.","translation":"ユーカリの木は硬葉植物の典型的な例である。"}],"collocations":["sclerophyllous vegetation (硬葉植物)","sclerophyllous forest (硬葉樹林)","sclerophyllous shrubland (硬葉低木林)"],"synonyms":["xerophytic","evergreen","hard-leaved"],"antonyms":["deciduous","broadleaf"],"notes":"Often used to describe vegetation in Mediterranean climates, such as those found in Australia, South Africa, and California."}],"etymology":{"value":"Derived from the Greek words 'skleros' (hard) and 'phyllon' (leaf).","priority":"★★★"},"pronunciation":{"ipa":"/ˌsklɛrəˈfɪləs/","syllables":"scle-ro-phyl-lous"},"inflection":{"notes":"Does not inflect (only exists in adjective form)."},"usage_notes":{"explanation":"'Sclerophyllous' is primarily used in botanical and ecological contexts to describe plants with specific leaf adaptations for dry or nutrient-poor environments.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sclerophyllous tree lost its leaves in the winter.","correct":"✓ The sclerophyllous tree is evergreen and does not lose its leaves in the winter.","note":"Sclerophyllous plants are typically evergreen, so they do not lose their leaves seasonally."}],"priority":"★★☆"},"related_words":{"derivatives":["sclerophyll (noun: a sclerophyllous plant or vegetation)","sclerophylly (noun: the characteristic of having sclerophyllous leaves)"],"related_terms":["xerophyte (noun: a plant adapted to dry conditions)","Mediterranean climate (noun: a climate characterized by warm, dry summers and mild, wet winters)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sclerophyllous' is a technical term used in botany and ecology to describe plants with hard, leathery leaves adapted to dry environments. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The Australian landscape is dominated by sclerophyllous forests.","translation":"オーストラリアの景観は硬葉樹林に支配されている。","type":"general","meaning_category":"descriptive"},{"sentence":"Sclerophyllous plants are well-adapted to fire-prone environments.","translation":"硬葉植物は火災が起こりやすい環境によく適応している。","type":"ecological","meaning_category":"adaptation"}]}