{"word":"usucapion","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律)取得時効","english_definition":"(Law) The acquisition of ownership of something by long possession.","examples":[{"sentence":"Usucapion is a method of acquiring property rights through continuous possession over a statutory period.","translation":"取得時効は、法定期間にわたる継続的な占有を通じて財産権を取得する方法です。"},{"sentence":"The requirements for usucapion vary depending on the jurisdiction.","translation":"取得時効の要件は、管轄区域によって異なります。"}],"collocations":["acquire property by usucapion (取得時効によって財産を取得する)","elements of usucapion (取得時効の要件)","period of usucapion (取得時効期間)"],"synonyms":["adverse possession","prescription"],"antonyms":[]}],"etymology":{"value":"From Latin usucapio, from usus (use) + capio (take, seize).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌjuːzjuˈkeɪʃən/","syllables":"u-su-ca-pi-on"},"inflection":{"noun_plural":"usucapions"},"usage_notes":{"explanation":"Usucapion is a legal term referring to the acquisition of ownership of property through long, continuous, and adverse possession. It is often used interchangeably with 'adverse possession,' although there may be subtle differences in specific legal contexts. The requirements for establishing usucapion typically include open and notorious possession, continuous possession for a statutory period, hostile or adverse possession (i.e., without the owner's permission), and sometimes payment of property taxes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He claimed usucapion of the car after borrowing it for a week.","correct":"✓ He could not claim usucapion of the car after borrowing it for a week, as the possession was not continuous for the statutory period.","note":"Usucapion requires continuous possession for a statutory period, which is much longer than a week. Borrowing does not constitute adverse possession."}],"priority":"★☆☆"},"related_words":{"derivatives":["usucapt (noun: one who acquires property by usucapion)","usucaptible (adjective: capable of being acquired by usucapion)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Usucapion' is a highly specialized legal term referring to the acquisition of property rights through long-term possession that is open, continuous, and adverse to the rights of the original owner. Understanding this term requires familiarity with legal concepts related to property law and real estate. It's not commonly used outside of legal contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The farmer successfully claimed usucapion of the disputed land after cultivating it for over twenty years.","translation":"その農家は、20年以上にわたってその紛争地を耕作した後、取得時効を主張することに成功しました。","type":"noun","meaning_category":"取得時効"},{"sentence":"The doctrine of usucapion is designed to resolve uncertainties in land ownership.","translation":"取得時効の法理は、土地所有権の不確実性を解消するために設けられています。","type":"noun","meaning_category":"取得時効"}]}