{"word":"tree-feeding","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(農業)樹木への施肥、樹木施肥","english_definition":"The practice of applying fertilizer or nutrients directly to trees, typically through methods such as soil injection, trunk injection, or foliar application.","examples":[{"sentence":"Tree-feeding is essential for maintaining the health and productivity of orchards.","translation":"樹木施肥は、果樹園の健康と生産性を維持するために不可欠です。"},{"sentence":"Soil testing helps determine the appropriate tree-feeding strategy for specific nutrient deficiencies.","translation":"土壌検査は、特定の栄養欠乏症に対する適切な樹木施肥戦略を決定するのに役立ちます。"},{"sentence":"Trunk injection is a tree-feeding technique used to deliver nutrients directly into the tree's vascular system.","translation":"幹部注射は、栄養素を樹木の維管束系に直接送達するために使用される樹木施肥技術です。"}],"collocations":["soil injection tree-feeding","trunk injection tree-feeding","foliar tree-feeding","tree-feeding program","tree-feeding schedule"],"synonyms":["tree fertilization","tree nutrient application"],"antonyms":[]}],"etymology":{"value":"Compound word formed by combining \"tree\" and \"feeding\", indicating the act of providing nourishment to trees.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtriːˌfiːdɪŋ/","syllables":"tree-feed-ing"},"inflection":{"noun_plural":"tree-feedings"},"usage_notes":{"explanation":"\"Tree-feeding\" refers specifically to the practice of providing nutrients to trees to enhance their growth, health, and productivity. It is commonly used in agricultural and horticultural contexts, particularly in orchards, plantations, and urban forestry. The term emphasizes the direct application of nutrients to trees, distinguishing it from general soil fertilization.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The tree-feeding was done by watering the leaves.","correct":"✓ The tree-feeding was done by foliar application.","note":"While watering the leaves can be a method of tree-feeding (foliar application), it's more accurate to describe the method specifically. \"Watering the leaves\" is too general."},{"incorrect":"✗ Tree-feeding is only for young trees.","correct":"✓ Tree-feeding is beneficial for trees of all ages.","note":"Tree-feeding is not limited to young trees; mature trees also benefit from nutrient supplementation."}],"priority":"★★☆"},"related_words":{"derivatives":["fertilizer","nutrient","soil injection","trunk injection","foliar application","arboriculture","horticulture"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"tree-feeding\" is a specialized term used in the fields of agriculture, horticulture, and arboriculture. It refers to the practice of providing nutrients directly to trees to improve their health and productivity. Understanding this term requires familiarity with agricultural and horticultural practices. The concept is relatively straightforward, but the term itself is not commonly used in everyday language."},"example_sentences":[{"sentence":"Proper tree-feeding can prevent nutrient deficiencies and improve tree vigor.","translation":"適切な樹木施肥は、栄養欠乏症を防ぎ、樹木の活力を高めることができます。","type":"general"},{"sentence":"The orchard manager implemented a tree-feeding program to increase fruit yield.","translation":"果樹園の管理者は、果実の収量を増やすために樹木施肥プログラムを実施しました。","type":"agricultural"},{"sentence":"Soil analysis is crucial for determining the correct tree-feeding formulation.","translation":"土壌分析は、適切な樹木施肥配合を決定するために重要です。","type":"scientific"}]}