{"word":"Morwong","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A type of edible marine fish found in Australian waters.","english_definition":"Any of several species of edible marine fish belonging to the family Cheilodactylidae, found in Australian waters.","examples":[{"sentence":"We caught a Morwong while fishing off the coast of Tasmania.","translation":"タスマニアの沖合で釣りをしているときにMorwongを捕まえました。"},{"sentence":"Morwong is a popular fish for grilling or baking.","translation":"Morwongはグリルやオーブン焼きに人気の魚です。"}],"collocations":["catch a Morwong","grill Morwong","bake Morwong","Morwong fillet"],"synonyms":["Trumpeter","Jackass Fish"],"antonyms":[]}],"etymology":{"value":"The name \"Morwong\" is believed to be of Aboriginal origin.","priority":"N/A"},"pronunciation":{"ipa":"/ˈmɔːrwɒŋ/","syllables":"Mor-wong"},"inflection":{"noun_plural":"Morwongs"},"usage_notes":{"explanation":"Morwong is a common name applied to several species of fish within the Cheilodactylidae family. They are typically found in the cooler waters around southern Australia. They are popular among anglers and are also commercially fished.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"N/A","text":"Morwong is a specific term for a type of fish, so its readability depends on the reader's familiarity with Australian marine life and cuisine. It is not a commonly used word outside of contexts related to fishing, seafood, or Australian regional topics."},"example_sentences":[{"sentence":"The chef prepared a delicious Morwong dish with lemon and herbs.","translation":"シェフはレモンとハーブを使ったおいしいMorwong料理を作りました。","type":"noun","meaning_category":"fish"},{"sentence":"Many recreational fishers target Morwong due to their tasty flesh.","translation":"多くのレクリエーション漁師は、身がおいしいことからMorwongをターゲットにしています。","type":"noun","meaning_category":"fish"}]}