{"word":"divergingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"分岐して、分かれて、異なって","english_definition":"In a diverging manner; in a way that separates or moves in different directions; differently.","examples":[{"sentence":"The two paths led divergingly into the forest.","translation":"二つの道はそれぞれ分かれて森の中へと続いていた。"},{"sentence":"The researchers' opinions differed divergingly on the interpretation of the data.","translation":"研究者たちの意見は、データの解釈に関して異なっていた。"},{"sentence":"The streams flowed divergingly from the mountain peak.","translation":"小川は山の頂上からそれぞれ分かれて流れた。"}],"collocations":["flow divergingly","differ divergingly","lead divergingly"],"synonyms":["separately","distinctly","differently","variously","disparately","apart","asunder"],"antonyms":["convergingly","similarly","identically","uniformly","together","unitedly"]}],"etymology":{"value":"The word \"divergingly\" is formed by adding the suffix \"-ly\" to the adjective \"diverging.\" \"Diverging\" comes from the verb \"diverge,\" which originates from the Latin word \"divergere,\" meaning \"to bend away, go in different directions.\" \"Di-\" means \"apart\" and \"vergere\" means \"to bend, turn.\"","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˈvɜːrdʒɪŋli/","syllables":"di-verg-ing-ly"},"inflection":{"notes":"As an adverb, \"divergingly\" does not have different forms for tense or number. It modifies verbs, adjectives, or other adverbs."},"usage_notes":{"explanation":"\"Divergingly\" is an adverb that describes an action or state that is moving or developing in different directions or ways. It is often used to emphasize the separation or distinction between two or more things. While not a commonly used word, it is appropriate in formal or technical contexts where precision is needed to describe a separation or difference.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The roads were divergingly similar.","correct":"✓ The roads were divergingly different.","note":"\"Divergingly\" implies a difference or separation, so it should be used with words that indicate contrast rather than similarity."},{"incorrect":"✗ They walked divergingly together.","correct":"✓ They walked divergingly, each going their own way.","note":"\"Divergingly\" suggests movement in different directions, so it is contradictory to use it with words like \"together\" that imply unity or convergence."}],"priority":"★★☆"},"related_words":{"derivatives":["diverge (verb)","divergence (noun)","divergent (adjective)","diverging (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"divergingly\" is an adverb that describes something moving or developing in different directions or ways. It's not a common word, so it's mostly used in formal writing or when you want to be very precise about something separating or differing. If you're talking about opinions or paths that are splitting apart, \"divergingly\" can be a good choice, but in everyday conversation, simpler words like \"separately\" or \"differently\" are usually preferred."},"example_sentences":[{"sentence":"The branches of the tree grew divergingly, creating a wide canopy.","translation":"木の枝はそれぞれ分かれて成長し、広い樹冠を形成した。","type":"descriptive","meaning_category":"separating directions"},{"sentence":"The two companies approached the problem divergingly, leading to different solutions.","translation":"その二つの会社はそれぞれ異なる方法で問題に取り組み、異なる解決策に至った。","type":"comparative","meaning_category":"different approaches"},{"sentence":"The rivers flowed divergingly across the plain.","translation":"川は平原をそれぞれ分かれて流れた。","type":"descriptive","meaning_category":"separating directions"}]}