{"word":"intromittence","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(哲学)対象が感覚に影響を与えること、知覚作用","english_definition":"(philosophy) The action of something entering or being admitted; especially, the supposed action of an object in sending an image of itself into the eye.","examples":[{"sentence":"The theory of intromittence explains vision as the result of images entering the eye.","translation":"イントロミッションの理論は、視覚を、像が眼に入る結果として説明する。"},{"sentence":"Ancient philosophers debated whether vision was based on intromittence or extramission.","translation":"古代の哲学者は、視覚がイントロミッションに基づくのか、それともエクストラミッションに基づくのかを議論した。"}],"collocations":["theory of intromittence","visual intromittence"],"synonyms":["perception","sensation","impression","extromission (antonym)"],"antonyms":["extromission"]}],"etymology":{"value":"From Latin *intro-* (inward) + *mittere* (to send).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪntrəˈmɪtəns/","syllables":"in-tro-mit-tence"},"inflection":{"noun_plural":"intromittences"},"usage_notes":{"explanation":"'Intromittence' is a term primarily used in philosophy, particularly in discussions about theories of vision and perception. It refers to the idea that visual perception occurs because objects send images or representations of themselves into the eye. This is in contrast to 'extramission,' the theory that vision occurs because the eye sends out rays to perceive objects. The term is relatively rare in modern usage outside of philosophical or historical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The intromittence of the data was successful.","correct":"✓ The transmission of the data was successful.","note":"'Intromittence' is specifically related to philosophical theories of perception, not general transmission or entry. Use 'transmission' or 'entry' in other contexts."}],"priority":"★☆☆"},"related_words":{"derivatives":["intromit (verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Intromittence' is a specialized term primarily found in philosophical discussions, specifically those related to the history of theories of vision. It describes the concept of external objects sending images or representations into the eye to enable sight. Due to its limited application and abstract nature, it is considered an advanced vocabulary word."},"example_sentences":[{"sentence":"The ancient Greeks debated the merits of intromittence versus extramission in explaining how we see.","translation":"古代ギリシャ人は、我々がどのように見るかを説明する上で、イントロミッションとエクストラミッションのどちらが優れているかを議論した。","type":"noun","meaning_category":"philosophy"},{"sentence":"According to the theory of intromittence, light carries information from an object to the eye.","translation":"イントロミッションの理論によれば、光は物体から眼へ情報を運ぶ。","type":"noun","meaning_category":"philosophy"}]}