{"word":"wordbuilding","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"造語、語形成、語構成","english_definition":"The process of forming new words from existing words or morphemes; the study of this process.","examples":[{"sentence":"Wordbuilding is an important aspect of vocabulary acquisition.","translation":"造語は語彙習得の重要な側面です。"},{"sentence":"The suffix '-ness' is commonly used in wordbuilding to form nouns from adjectives.","translation":"接尾辞「-ness」は、形容詞から名詞を形成するために造語でよく使用されます。"}],"collocations":["wordbuilding exercise","wordbuilding skills","methods of wordbuilding","processes of wordbuilding"],"synonyms":["morphology","lexical derivation","neology"],"antonyms":[]}],"etymology":{"value":"A compound word formed from 'word' and 'building', reflecting the process of constructing new words.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɜːrdˌbɪldɪŋ/","syllables":"word-build-ing"},"inflection":{"noun_plural":"wordbuildings"},"usage_notes":{"explanation":"'Wordbuilding' refers to the techniques used to create new words, such as affixation (adding prefixes or suffixes), compounding (combining two or more words), and conversion (changing the grammatical function of a word). It is a key concept in linguistics and language learning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Word building is important for language learning.","correct":"✓ Wordbuilding is important for language learning.","note":"While 'word building' (two separate words) can be understood, 'wordbuilding' (one word) is the more established and commonly used term in linguistics."}],"priority":"★★☆"},"related_words":{"derivatives":["word","build","builder"],"phrasal_verbs":[],"compounds":["affixation","compounding","conversion","derivation"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Wordbuilding' is a term used in linguistics to describe how new words are created. It involves processes like adding prefixes or suffixes to existing words, combining words together, or changing the grammatical function of a word. Understanding wordbuilding can help you learn new vocabulary more effectively."},"example_sentences":[{"sentence":"The course focuses on practical wordbuilding techniques.","translation":"そのコースは、実践的な造語技術に焦点を当てています。","type":"noun","meaning_category":"造語"},{"sentence":"Students learn about wordbuilding through various exercises.","translation":"学生はさまざまな演習を通して造語について学びます。","type":"noun","meaning_category":"造語"},{"sentence":"Understanding wordbuilding can significantly improve reading comprehension.","translation":"造語を理解することは、読解力を大幅に向上させる可能性があります。","type":"noun","meaning_category":"造語"}]}