{"word":"blackleggery","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ストライキ破り、争議行為破壊","english_definition":"The practice of working or using workers who continue to work during a strike; strike-breaking.","examples":[{"sentence":"The union condemned the company's use of blackleggery during the strike.","translation":"労働組合は、ストライキ中の会社のストライキ破りの使用を非難した。"},{"sentence":"Blackleggery undermines the power of collective bargaining.","translation":"ストライキ破りは団体交渉の力を弱める。"}],"collocations":["use of blackleggery","condemn blackleggery","fight against blackleggery"],"synonyms":["strike-breaking","scabbing"],"antonyms":["supporting the strike","union solidarity"]}],"etymology":{"value":"The term 'blackleg' originated in the 17th century, referring to someone who cheated at gambling, specifically cards. The 'black leg' referred to a leg discolored by disease or a black gaiter worn to conceal a limp, suggesting dishonesty. By the 19th century, it was applied to those who betrayed their fellow workers by working during a strike. The suffix '-ery' denotes a practice or activity.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌblækˈlɛɡəri/","syllables":"black-leg-ger-y"},"inflection":{"noun_plural":"blackleggeries (rarely used)"},"usage_notes":{"explanation":"'Blackleggery' is a strongly negative term, implying betrayal of fellow workers and undermining collective action. It is often used in labor disputes and carries a significant emotional charge. The term is less common in general use but remains relevant in discussions of labor rights and union activity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was accused of blackleggery, so he joined the strike.","correct":"✓ He was accused of blackleggery, so he was ostracized by the strikers.","note":"Accusation of blackleggery would lead to being shunned by striking workers, not joining the strike."}],"priority":"★★☆"},"related_words":{"derivatives":["blackleg (noun: strike-breaker)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Blackleggery' is a specialized term primarily used in the context of labor disputes and union activities. It refers to the practice of working during a strike, which is generally viewed negatively by striking workers and unions. Understanding this term requires familiarity with labor relations and the dynamics of collective bargaining."},"example_sentences":[{"sentence":"The union accused the company of using **blackleggery** to break the strike.","translation":"労働組合は、会社がストライキを鎮圧するためにストライキ破りを使ったと非難した。","type":"noun","meaning_category":"ストライキ破り"},{"sentence":"**Blackleggery** is seen as a betrayal of solidarity among workers.","translation":"ストライキ破りは、労働者間の連帯の裏切りと見なされる。","type":"noun","meaning_category":"争議行為破壊"}]}