{"word":"symmorphic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(結晶学で)空間群が点群と並進群の半直積であること、つまり、空間群が点群の対称性を持ち、かつ、格子並進のみを含む並進群を持つこと。","english_definition":"(Crystallography) Describing a space group that is a semidirect product of a point group and a translation group; that is, a space group that contains all the symmetry of a point group, and a translation group containing only lattice translations.","examples":[{"sentence":"The crystal structure is symmorphic, meaning that the symmetry operations all pass through a single point.","translation":"その結晶構造はシンモルフィックであり、つまり、すべての対称操作が一点を通過する。"},{"sentence":"Symmorphic space groups are relatively simple to analyze compared to non-symmorphic ones.","translation":"シンモルフィック空間群は、非シンモルフィック空間群と比較して解析が比較的簡単である。"}],"collocations":["symmorphic space group","symmorphic crystal structure"],"synonyms":["holosymmetric"],"antonyms":["non-symmorphic"]},{"part_of_speech":"adjective","definition":"(一般的に)対称性を保つ、または対称性を持つ。","english_definition":"(Generally) Maintaining or possessing symmetry.","examples":[{"sentence":"The design exhibits symmorphic properties, with a clear balance and repetition of elements.","translation":"そのデザインはシンモルフィックな特性を示しており、要素の明確なバランスと繰り返しが見られる。"}],"collocations":[],"synonyms":["symmetric","symmetrical"],"antonyms":["asymmetric","asymmetrical"]}],"etymology":{"value":"ギリシャ語の「sym-」（共に）と「morphē」（形、形状）に由来する。これは、結晶構造における対称性の特定のタイプ、つまり、点群の対称性と格子並進の組み合わせを指す。","priority":"★★☆"},"pronunciation":{"ipa":"/sɪˈmɔːrfɪk/","syllables":"sym-mor-phic"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"「**symmorphic**」は主に結晶学の分野で使用される専門用語です。結晶構造の空間群がシンモルフィックであるとは、その空間群が点群の対称性をすべて含み、かつ格子並進のみを含む並進群を持つことを意味します。これは、結晶構造の対称性を解析する上で重要な概念です。結晶学以外の分野では、より一般的な「対称的な」という意味で使用されることもありますが、頻度は高くありません。非シンモルフィック空間群と比較して、シンモルフィック空間群は対称性の解析が容易であるとされます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The molecule is symmorphic because it has atoms.","correct":"✓ The molecule is symmorphic because its space group is symmorphic.","note":"分子が原子を持つことと、その空間群がシンモルフィックであることは直接的な関係はありません。シンモルフィックであるかどうかは、空間群の対称操作に依存します。"},{"incorrect":"✗ Symmorphic structures are always more complex.","correct":"✓ Symmorphic structures are generally simpler to analyze.","note":"シンモルフィック構造は、一般的に非シンモルフィック構造よりも解析が容易です。"}],"priority":"★★☆"},"related_words":{"derivatives":["symmorphy (名詞: シンモルフィー、シンモルフィックな状態)","non-symmorphic (形容詞: 非シンモルフィックな)"],"related_terms":["space group","point group","translation group","crystal structure","crystallography"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門分野でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**symmorphic**」は、結晶学という科学の分野で使われる専門的な言葉です。特に、結晶の中の原子の並び方（結晶構造）の対称性について説明するときに使われます。結晶構造が「シンモルフィック」であるとは、その構造が特定のタイプの対称性を持っていることを意味します。この言葉は、結晶の性質を理解したり、新しい材料を設計したりする際に役立ちます。一般の人が日常会話で使うことはほとんどありません。"},"example_sentences":[{"sentence":"The symmorphic nature of the crystal simplifies the determination of its physical properties.","translation":"結晶のシンモルフィックな性質は、その物理的特性の決定を簡素化する。","type":"adjective","meaning_category":"結晶学"},{"sentence":"This material exhibits a symmorphic structure, which allows for efficient computation of its electronic band structure.","translation":"この材料はシンモルフィックな構造を示し、それにより電子バンド構造の効率的な計算が可能になる。","type":"adjective","meaning_category":"結晶学"}]}