{"word":"Egyptianization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"エジプト化；エジプト風にすること、エジプト文化の影響を受けること","english_definition":"The process of becoming Egyptian in character or culture; the adoption or imposition of Egyptian characteristics or culture.","examples":[{"sentence":"The Roman Empire underwent a degree of Egyptianization after its conquest of Egypt.","translation":"ローマ帝国はエジプト征服後、ある程度のエジプト化を経験した。"},{"sentence":"The spread of Egyptian religious beliefs and artistic styles led to the Egyptianization of neighboring regions.","translation":"エジプトの宗教的信念と芸術様式の広がりは、近隣地域のエジプト化をもたらした。"}],"collocations":["cultural Egyptianization","religious Egyptianization","artistic Egyptianization"],"synonyms":["Egyptification","Egyptianism"],"antonyms":["De-Egyptianization"]}],"etymology":{"value":"Formed from \"Egyptian\" + \"-ization\".","priority":"★★★"},"pronunciation":{"ipa":"/ɪˌdʒɪpʃənaɪˈzeɪʃən/","syllables":"E-gyp-tian-i-za-tion"},"inflection":{"noun_plural":"Egyptianizations"},"usage_notes":{"explanation":"\"Egyptianization\" refers to the process by which something or someone takes on Egyptian characteristics, customs, or cultural elements. It can describe the adoption of Egyptian culture by non-Egyptians, or the imposition of Egyptian culture on conquered territories. The term is often used in historical or archaeological contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Egyptianization of the pyramids.","correct":"✓ The Egyptianization of architecture in the region.","note":"Egyptianization is a process, not an object. It's incorrect to say the Egyptianization of the pyramids, as the pyramids themselves are part of Egyptian culture. It's more appropriate to discuss the Egyptianization of other cultures or aspects of life."}],"priority":"★☆☆"},"related_words":{"derivatives":["Egyptianize (verb)","Egyptian (adjective, noun)"],"related_terms":["Egyptology","Ancient Egypt","Pharaoh","Hieroglyphics"]},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Egyptianization\" is a relatively complex term used to describe the process of something becoming more Egyptian in character or culture. It is most often encountered in historical, archaeological, or anthropological contexts when discussing the influence of ancient Egyptian culture on other regions or societies. Understanding the term requires familiarity with the history and culture of ancient Egypt."},"example_sentences":[{"sentence":"The Ptolemaic dynasty saw a significant Egyptianization of Greek rulers.","translation":"プトレマイオス朝時代には、ギリシャ人支配者の著しいエジプト化が見られた。","type":"general"},{"sentence":"Archaeological evidence suggests a gradual Egyptianization of Nubian burial practices.","translation":"考古学的証拠は、ヌビアの埋葬慣習の段階的なエジプト化を示唆している。","type":"historical"},{"sentence":"The temple architecture shows a clear Egyptianization of earlier local styles.","translation":"その寺院建築は、初期の地方様式のエジプト化を明確に示している。","type":"cultural"}]}