{"word":"tarentism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"タランティズム：14世紀から17世紀にかけて南イタリアで流行したとされる、タランチュラの毒グモに噛まれたことによって引き起こされるとされる精神疾患。特徴的な症状は、激しい興奮状態、踊りへの衝動、痙攣、幻覚など。治療法として、音楽（特にタランテラ）に合わせて踊り続けることが推奨された。","english_definition":"A psychological illness or mass hysteria characterized by an uncontrollable urge to dance, believed in Southern Italy between the 14th and 17th centuries to result from the bite of the tarantula spider. The condition was characterized by extreme excitement, frenzied dancing, convulsions, and hallucinations, and was treated by music (especially the tarantella) and dancing.","examples":[{"sentence":"The outbreak of tarentism in the village caused widespread panic.","translation":"村でのタランティズムの発生は広範囲にわたるパニックを引き起こした。"},{"sentence":"Some historians believe tarentism was a form of social protest.","translation":"一部の歴史家は、タランティズムは社会的な抗議の一形態だったと考えている。"},{"sentence":"The tarantella dance is thought to have originated as a cure for tarentism.","translation":"タランテラダンスは、タランティズムの治療法として始まったと考えられている。"}],"collocations":["outbreak of tarentism (タランティズムの発生)","symptoms of tarentism (タランティズムの症状)","cure for tarentism (タランティズムの治療法)","tarantella and tarentism (タランテラとタランティズム)"],"synonyms":["dancing mania","choreomania"],"antonyms":[]}],"etymology":{"value":"イタリア語の「tarantismo」に由来し、これはタランチュラ (tarantula) の生息地であるイタリアの都市タラント (Taranto) に関連する。タラントでタランチュラに噛まれたことがタランティズムの原因であると信じられていた。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtærənˌtɪzəm/","syllables":"ta-ren-tiz-m"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"「**tarentism**」は歴史的な用語であり、現代医学では精神疾患や集団ヒステリーの一種として解釈されることが多いです。タランチュラの毒が原因であるという説は、現在では否定されています。タランテラダンスは、この病気の治療法として発展したと考えられています。現代では、この用語はほとんど使われず、歴史的な文脈でのみ見られます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was diagnosed with tarentism after being bitten by a spider in his garden.","correct":"✓ He exhibited symptoms resembling tarentism, characterized by uncontrollable dancing.","note":"タランティズムは、現代医学ではタランチュラの咬傷が直接的な原因とは考えられていません。"},{"incorrect":"✗ Tarentism is a common disease in modern Italy.","correct":"✓ Tarentism was a historical phenomenon primarily observed in Southern Italy between the 14th and 17th centuries.","note":"タランティズムは現代の病気ではなく、歴史的な現象です。"}],"priority":"★★☆"},"related_words":{"derivatives":["tarantella (名詞: タランテラダンス)","tarantula (名詞: タランチュラ)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (非常に専門的な用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 歴史的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**tarentism**」は、14世紀から17世紀にかけて南イタリアで発生したとされる、タランチュラの咬傷が原因と信じられていた精神疾患を指す専門用語です。主な症状は、制御不能な踊りの衝動、興奮、痙攣、幻覚などです。治療法として、タランテラダンスが用いられました。現代医学では、集団ヒステリーや精神疾患の一種として解釈されています。歴史的な文脈でのみ使用される、非常に専門的な用語です。"},"example_sentences":[{"sentence":"The historical accounts of **tarentism** describe people dancing uncontrollably for days.","translation":"タランティズムの歴史的な記録は、人々が何日も制御不能に踊り続ける様子を描写している。","type":"noun","meaning_category":"タランティズム (病気)"},{"sentence":"The origins of the tarantella dance are linked to the supposed cure for **tarentism**.","translation":"タランテラダンスの起源は、タランティズムの治療法とされているものに関連している。","type":"noun","meaning_category":"タランティズム (病気)"}]}