{"word":"impersuadableness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"説得できないこと、頑固さ、不屈の精神","english_definition":"The state or quality of being impersuadable; the inability to be persuaded.","examples":[{"sentence":"His impersuadableness on the matter was frustrating to the others.","translation":"その件に関する彼の説得の難しさは、他の人々にとってイライラの種だった。"},{"sentence":"The impersuadableness of the committee made it difficult to reach a consensus.","translation":"委員会の頑固さのために、合意に達することが困難だった。"}],"collocations":["inherent impersuadableness","sheer impersuadableness"],"synonyms":["obstinacy","intractability","stubbornness","inflexibility","adamancy"],"antonyms":["persuadability","tractability","flexibility","openness","amenability"]}],"etymology":{"value":"Formed from \"impersuadable\" (not able to be persuaded) + \"-ness\" (a suffix denoting a state or quality). \"Impersuadable\" is derived from \"persuadable\" with the prefix \"im-\" (not). \"Persuadable\" comes from the verb \"persuade\".","priority":"★★☆"},"pronunciation":{"ipa":"ɪmˌpɜːrˈsweɪdəbəlnəs","syllables":"im-per-sua-da-ble-ness"},"inflection":{"noun_plural":"impersuadablenesses (rare)"},"usage_notes":{"explanation":"\"Impersuadableness\" is a relatively rare and formal word. It describes a strong resistance to persuasion or influence. It's often used in contexts where someone's stubbornness or unwillingness to change their mind is a significant factor.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a great impersuadableness.","correct":"✓ He showed great impersuadableness.","note":"\"Impersuadableness\" is an uncountable noun, so it doesn't take the indefinite article \"a\"."},{"incorrect":"✗ Her impersuadableness was because she was angry.","correct":"✓ Her impersuadableness was due to her anger.","note":"The correct preposition to use with \"due to\" is \"to\"."}],"priority":"★★☆"},"related_words":{"derivatives":["impersuadable (adjective: not able to be persuaded)","persuade (verb: to convince someone)","persuasion (noun: the act of persuading)","persuasive (adjective: able to persuade)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (very advanced vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Impersuadableness\" is a complex and rare word, indicating a very high level of English proficiency. It describes the quality of being impossible to persuade. Due to its rarity, it is unlikely to be encountered or used by non-native speakers except in very formal or academic contexts."},"example_sentences":[{"sentence":"The negotiator was frustrated by the client's impersuadableness, which made reaching an agreement impossible.","translation":"交渉担当者は、クライアントの説得の難しさに苛立ち、合意に達することが不可能になった。","type":"general","meaning_category":"説得できないこと"},{"sentence":"Her inherent impersuadableness stemmed from a deep-seated distrust of authority.","translation":"彼女の生来の頑固さは、権威に対する根深い不信感から生じていた。","type":"general","meaning_category":"頑固さ"},{"sentence":"The sheer impersuadableness of his argument made it difficult to engage in a productive discussion.","translation":"彼の議論の全く説得力のないことが、生産的な議論をすることを困難にした。","type":"general","meaning_category":"不屈の精神"}]}