{"word":"superinsistence","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"過剰な主張、過度な主張、しつこい主張","english_definition":"Excessive or overly persistent insistence.","examples":[{"sentence":"His superinsistence on following the rules made him unpopular.","translation":"彼の規則遵守に対する過剰な主張は、彼を不人気にした。"},{"sentence":"The company's superinsistence on meeting deadlines led to burnout among employees.","translation":"会社の納期厳守に対するしつこい主張は、従業員の燃え尽き症候群につながった。"}],"collocations":["superinsistence on","superinsistence leads to"],"synonyms":["overinsistence","excessive insistence","persistent demand","dogged insistence"],"antonyms":["acquiescence","compliance","yielding","flexibility"]}],"etymology":{"value":"'super-' (超、過剰) + 'insistence' (主張)","priority":"★★★"},"pronunciation":{"ipa":"/ˌsuːpərɪnˈsɪstəns/","syllables":"su-per-in-sis-tence"},"inflection":{"noun_plural":"superinsistences"},"usage_notes":{"explanation":"'Superinsistence' is a relatively uncommon word that describes an extreme level of insistence. It often carries a negative connotation, suggesting that the insistence is unreasonable or counterproductive.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed superinsistence to finish the work.","correct":"✓ He showed superinsistence in finishing the work. / ✓ He was superinsistent on finishing the work.","note":"'Superinsistence' is a noun and typically requires a preposition like 'in' or 'on' to connect it to the action being insisted upon. Alternatively, use the adjective form 'superinsistent'."}],"priority":"★★☆"},"related_words":{"derivatives":["superinsistent (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Superinsistence' is a less common, more formal word that means a very strong and often excessive insistence. It's used when someone is pushing for something in a way that might be seen as too much or unreasonable. You'll typically find this word in more academic or professional writing, not in everyday conversation."},"example_sentences":[{"sentence":"The negotiator's superinsistence on every detail prolonged the contract talks.","translation":"交渉担当者の細部への過剰な主張が、契約交渉を長引かせた。","type":"noun","meaning_category":"過剰な主張"},{"sentence":"Her superinsistence that she was right, despite the evidence, frustrated everyone.","translation":"証拠があるにもかかわらず、彼女が自分が正しいと過剰に主張したため、誰もが不満を感じた。","type":"noun","meaning_category":"しつこい主張"}]}