{"word":"car-centrism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自動車中心主義、車社会","english_definition":"The prioritization of private automobile transportation over other modes, such as walking, cycling, and public transit, in urban planning and infrastructure development.","examples":[{"sentence":"Car-centrism has led to sprawling suburbs and increased traffic congestion.","translation":"自動車中心主義は、郊外の拡大と交通渋滞の増加につながった。"},{"sentence":"Many urban planners are now advocating for policies that reduce car-centrism and promote sustainable transportation.","translation":"多くの都市計画家は現在、自動車中心主義を減らし、持続可能な交通を促進する政策を提唱している。"},{"sentence":"The city's infrastructure reflects a long history of car-centrism, with wide roads and ample parking.","translation":"その都市のインフラは、広い道路と十分な駐車場を備え、自動車中心主義の長い歴史を反映している。"}],"collocations":["urban car-centrism","overcoming car-centrism","effects of car-centrism","challenge car-centrism","combat car-centrism","reduce car-centrism","fight car-centrism"],"synonyms":["automobile dependence","auto-oriented development","car dependency"],"antonyms":["transit-oriented development","pedestrian-friendly design","sustainable transportation"]},{"part_of_speech":"noun","definition":"自動車を過度に重視する考え方や社会構造","english_definition":"A mindset or societal structure that excessively favors and relies on automobiles for transportation, often to the detriment of other forms of mobility and community well-being.","examples":[{"sentence":"Car-centrism can negatively impact public health by reducing physical activity and increasing air pollution.","translation":"自動車中心主義は、身体活動の減少と大気汚染の増加により、公衆衛生に悪影響を与える可能性がある。"},{"sentence":"The shift away from car-centrism requires a change in cultural attitudes and investment in alternative transportation options.","translation":"自動車中心主義からの脱却には、文化的な態度の変化と代替交通手段への投資が必要である。"},{"sentence":"Car-centrism often results in a built environment that is hostile to pedestrians and cyclists.","translation":"自動車中心主義は、歩行者や自転車利用者にとって不快な都市環境をもたらすことが多い。"}],"collocations":["culture of car-centrism","ideology of car-centrism","problems of car-centrism","costs of car-centrism","critique of car-centrism"],"synonyms":["automobile bias","auto-centricity","car culture"],"antonyms":["sustainable urbanism","people-centered design","active transportation"]}],"etymology":{"value":"A compound word formed from \"car\" (referring to automobiles) and \"centrism\" (the belief that something is central or most important). The term emerged in the late 20th century as a critical perspective on urban planning and transportation policy.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɑːrˌsɛn.trɪ.zəm/","syllables":"car-cen-trism"},"inflection":{"notes":"Uncountable noun"},"usage_notes":{"explanation":"\"Car-centrism\" is a critical term used to describe the dominance of automobile transportation in urban planning and societal attitudes. It often implies a negative view of this prioritization, highlighting the associated problems such as traffic congestion, pollution, urban sprawl, and reduced accessibility for non-drivers. The term is frequently used in discussions about sustainable transportation, urban design, and environmental policy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Car-centrism is good because it allows people to travel easily.","correct":"✓ While car-centrism offers convenience, it also has negative consequences like pollution and traffic.","note":"Car-centrism is often viewed critically due to its negative impacts. A more balanced statement acknowledges both the benefits and drawbacks."},{"incorrect":"✗ The city is car-centrism.","correct":"✓ The city is car-centric. / ✓ The city exhibits car-centrism.","note":"\"Car-centrism\" is a noun, so it's more appropriate to say the city \"exhibits car-centrism\" or is \"car-centric\" (using the adjectival form)."}],"priority":"★★☆"},"related_words":{"derivatives":["car-centric (adjective)","anti-car (adjective)"],"phrases":["induced demand","urban sprawl","complete streets","walkable cities","bike-friendly cities","public transit"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1-C2 (Specialized vocabulary related to urban planning and environmental studies)","frequency_google_ngram":"Relatively low frequency, but increasing in recent years due to growing awareness of sustainable transportation issues.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Car-centrism\" is a term used to describe how cities and societies are often designed to prioritize cars over other forms of transportation like walking, biking, and public transit. It's often used when discussing the negative effects of this prioritization, such as pollution, traffic congestion, and a lack of accessibility for people who don't drive. The word is commonly found in discussions about urban planning, environmental sustainability, and alternative transportation methods.","priority":"★★☆"},"example_sentences":[{"sentence":"The city's focus on highways is a clear example of **car-centrism**.","translation":"その都市の高速道路への注力は、自動車中心主義の明確な例である。","type":"noun","meaning_category":"Prioritization of automobiles"},{"sentence":"**Car-centrism** has made it difficult for pedestrians to safely navigate the city.","translation":"自動車中心主義は、歩行者が安全に市内を移動することを困難にしている。","type":"noun","meaning_category":"Negative impacts of automobile prioritization"},{"sentence":"Breaking away from **car-centrism** requires investment in public transportation.","translation":"自動車中心主義から脱却するには、公共交通機関への投資が必要である。","type":"noun","meaning_category":"Solutions to car-centrism"},{"sentence":"The **car-centrism** of the 1950s led to the development of sprawling suburbs.","translation":"1950年代の自動車中心主義は、郊外の拡大につながった。","type":"noun","meaning_category":"Historical context of car-centrism"}]}