{"word":"cochlidiid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A moth of the family Cochlidiidae; a cup moth or stinging slug moth.","english_definition":"A moth of the family Cochlidiidae, characterized by their stout, hairy larvae that resemble slugs and often possess stinging spines.","examples":[{"sentence":"The cochlidiid larvae are known for their unique defense mechanisms.","translation":"コクリオイデス科の幼虫は、その独特な防御機構で知られています。"}],"collocations":["cochlidiid larva","cochlidiid moth","stinging cochlidiid"],"synonyms":["cup moth","stinging slug moth"],"antonyms":[]}],"etymology":{"value":"Derived from the family name Cochlidiidae, which is based on the genus Cochlidion.","priority":"★★★"},"pronunciation":{"ipa":"/ˌkɒkliˈdaɪɪd/","syllables":"coch-li-di-id"},"inflection":{"noun_plural":"cochlidiids"},"usage_notes":{"explanation":"'Cochlidiid' refers specifically to moths belonging to the family Cochlidiidae. These moths are notable for their slug-like larvae, which often have stinging spines. The term is primarily used in entomology and related scientific fields.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a cochlidiid butterfly.","correct":"✓ I saw a cochlidiid moth.","note":"Cochlidiids are moths, not butterflies."},{"incorrect":"✗ The cochlidiid is a type of beetle.","correct":"✓ The cochlidiid is a type of moth.","note":"Cochlidiids are moths, belonging to the Lepidoptera order, not beetles."}],"priority":"★★☆"},"related_words":{"derivatives":["Cochlidiidae"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'cochlidiid' is a specialized term used in entomology to refer to moths of the family Cochlidiidae. These moths are characterized by their unique larvae, which resemble slugs and often possess stinging spines. The term is not commonly used outside of scientific contexts. Understanding this term requires a background in biology or entomology."},"example_sentences":[{"sentence":"The cochlidiid caterpillar moved slowly across the leaf.","translation":"コクリオイデス科の毛虫がゆっくりと葉の上を移動した。","type":"noun","meaning_category":"moth"},{"sentence":"Researchers are studying the venom of the stinging cochlidiid.","translation":"研究者たちは、刺すコクリオイデス科の毒を研究している。","type":"noun","meaning_category":"moth"}]}