{"word":"OB","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(主に日本で) Old Boyの略。卒業生、特に母校に貢献する年配の卒業生を指す。","english_definition":"(Mainly in Japan) Abbreviation for Old Boy. Refers to a graduate, especially an older alumnus who contributes to their alma mater.","examples":[{"sentence":"彼は大学のOBとして、後輩の指導に熱心だ。","translation":"As an OB of the university, he is enthusiastic about mentoring younger students.","note":"This example shows the common usage of OB in Japanese context."},{"sentence":"OB会に出席して、昔の仲間たちと再会した。","translation":"I attended the OB association meeting and reunited with old friends.","note":"This shows the use of OB in the context of alumni gatherings."}],"collocations":["OB会 (OB-kai): Alumni association meeting","大学のOB (Daigaku no OB): University alumnus","会社のOB (Kaisha no OB): Company alumnus"],"synonyms":["卒業生 (Sotsugyōsei)","同窓生 (Dōsōsei)","先輩 (Senpai)"],"antonyms":["新入生 (Shinnyūsei)","後輩 (Kōhai)"]},{"part_of_speech":"noun","definition":"(医療) Obstetricsの略。産科。","english_definition":"(Medical) Abbreviation for Obstetrics. The branch of medicine concerned with childbirth and the care of women before, during, and after pregnancy.","examples":[{"sentence":"彼女はOBの専門医だ。","translation":"She is a specialist in OB.","note":"This example shows the use of OB in a medical context."},{"sentence":"OB/GYNとは、産婦人科のことだ。","translation":"OB/GYN refers to obstetrics and gynecology.","note":"This clarifies that OB is often paired with GYN to refer to the combined field."}],"collocations":["OB/GYN: 産婦人科 (Sanfujinka)","OB specialist: 産科専門医 (Sanka senmon'i)"],"synonyms":["産科 (Sanka)"],"antonyms":["(None)"]}],"etymology":{"value":"'OB' is an abbreviation. In the context of alumni, it's short for 'Old Boy' (or 'Old Boys' collectively). In the medical context, it's short for 'Obstetrics'.","priority":"★★★"},"pronunciation":{"ipa":"/oː biː/","syllables":"o-bi"},"inflection":{"notes":"As an abbreviation, 'OB' generally does not inflect. Plural is sometimes indicated as 'OBたち' or 'OBs' in Japanese."},"usage_notes":{"explanation":"The meaning of 'OB' depends heavily on the context. In general conversation in Japan, it most commonly refers to alumni, especially those who maintain a connection with their former school or company. In medical settings, it refers to obstetrics. Without context, it can be ambiguous.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"彼はOBです。(Intended meaning: He is an alumnus, but spoken to someone unfamiliar with the abbreviation)","correct":"彼は卒業生です。(Kare wa sotsugyōsei desu.)","note":"When speaking to someone who might not understand the abbreviation 'OB', it's better to use the full word '卒業生' (sotsugyōsei)."},{"incorrect":"彼女はOBの病棟に勤務しています。(Intended meaning: She works in the obstetrics ward, but spoken outside a medical context)","correct":"彼女は産科の病棟に勤務しています。(Kanojo wa sanka no byōtō ni kinmu shite imasu.)","note":"In non-medical contexts, use '産科' (sanka) to avoid confusion."}],"priority":"★★☆"},"related_words":{"derivatives":["(None - it's an abbreviation)"],"phrasal_verbs":["(None)"],"related_terms":["OG (Old Girl): 女子卒業生","リクルーター (Rikurūtā): Recruiter (often OBs who recruit for their companies)","産婦人科医 (Sanfujinkai): Obstetrician-gynecologist"],"priority":"★★☆"},"level_frequency":{"CEFR":"(Not applicable, as it's a context-dependent abbreviation)","frequency_google_ngram":"Moderate frequency in Japan, especially in contexts related to education and employment.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"'OB' is an abbreviation that has different meanings depending on the context. In Japan, it usually refers to a male alumnus ('Old Boy') of a school or company. In a medical setting, it stands for 'Obstetrics' (産科). It's important to understand the context to know which meaning is intended. If you're not sure if the other person knows the abbreviation, it's better to use the full word, like '卒業生' (sotsugyōsei) for alumnus or '産科' (sanka) for obstetrics."},"example_sentences":[{"sentence":"彼は大学のOBとして、学生たちの就職活動を支援している。","translation":"As a university OB, he supports students' job hunting activities.","type":"noun","meaning_category":"Alumnus"},{"sentence":"彼女は産科（OB）の看護師として働いている。","translation":"She works as a nurse in obstetrics (OB).","type":"noun","meaning_category":"Obstetrics"},{"sentence":"OB訪問で、会社の雰囲気を知ることができた。","translation":"I was able to learn about the company's atmosphere through an OB visit.","type":"noun","meaning_category":"Alumnus (visiting an alumnus at their workplace)"}]}