{"word":"faller","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(特に木を)切り倒す人、伐採者","english_definition":"a person who fells trees, especially as a job.","examples":[{"sentence":"The faller carefully assessed the tree before cutting it down.","translation":"伐採者は木を切り倒す前に注意深く評価した。"},{"sentence":"Faller jobs are dangerous and require expertise.","translation":"伐採者の仕事は危険で、専門知識が必要です。"}],"collocations":["tree faller","timber faller"],"synonyms":["lumberjack","logger","woodcutter","feller"],"antonyms":[]},{"part_of_speech":"noun","definition":"落下する人、倒れる人","english_definition":"someone who falls or collapses.","examples":[{"sentence":"The faller was quickly helped to their feet.","translation":"倒れた人はすぐに立ち上がるのを助けられた。"},{"sentence":"The sudden faller was rushed to the hospital.","translation":"突然倒れた人は病院に運ばれた。"}],"collocations":[],"synonyms":["tumbler","stumbler"],"antonyms":[]}],"etymology":{"value":"The word \"faller\" is derived from the verb \"fall,\" with the suffix \"-er\" indicating a person or thing that performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɔːlər/","syllables":"fall-er"},"inflection":{"noun_plural":"fallers"},"usage_notes":{"explanation":"The term \"faller\" is most commonly used to describe someone whose job is to cut down trees. It can also refer to someone who has fallen, but this usage is less common.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The faller is a very quiet person.","correct":"The feller is a very quiet person.","note":"Distinguish between \"faller\" (one who fells trees or falls down) and \"feller\" (synonym for faller, specifically a tree cutter)."},{"incorrect":"The faller of the building was tragic.","correct":"The collapse of the building was tragic.","note":"Use \"faller\" for people, not buildings. Use collapse, destruction, etc. for buildings."}],"priority":"★★☆"},"related_words":{"derivatives":["fall (verb)","falling (adjective)","fell (verb, past tense of fall)","felling (noun, the act of cutting down trees)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"faller\" has two primary meanings. The first, and more common, meaning refers to a person whose job is to cut down trees. The second meaning refers to someone who falls. The context usually makes it clear which meaning is intended. The word is derived from the verb \"fall,\" so understanding the basic meaning of \"fall\" is helpful in understanding \"faller.\""},"example_sentences":[{"sentence":"The experienced **faller** could bring down a tree in minutes.","translation":"経験豊富な伐採者は数分で木を倒すことができた。","type":"noun","meaning_category":"伐採者"},{"sentence":"The **faller** was injured after tripping on a branch.","translation":"倒れた人は枝につまずいて怪我をした。","type":"noun","meaning_category":"倒れた人"}]}