{"word":"Medicophysics","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The application of physics to medicine; medical physics.","english_definition":"The branch of physics concerned with the application of physics principles to medicine and healthcare.","examples":[{"sentence":"The field of medicophysics is essential for advancing medical imaging techniques.","translation":"医療物理学の分野は、医用画像技術を進歩させるために不可欠です。"},{"sentence":"Medicophysics plays a crucial role in radiation therapy planning and delivery.","translation":"医療物理学は、放射線治療の計画と実施において重要な役割を果たします。"}],"collocations":["medical physics","radiation therapy","medical imaging","nuclear medicine","health physics"],"synonyms":["medical physics","biophysics","health physics"],"antonyms":[]},{"part_of_speech":"noun","definition":"A less common or older term for medical physics.","english_definition":"An older or less frequently used term to describe the field now commonly known as medical physics.","examples":[{"sentence":"In the past, medicophysics was used to describe the application of physics to medical problems.","translation":"以前は、医療物理学は物理学の医学的問題への応用を説明するために使用されていました。"}],"collocations":["historical term","medical physics"],"synonyms":["medical physics"],"antonyms":[]}],"etymology":{"value":"A combination of 'medico-' (referring to medicine) and 'physics' (the science of matter and energy).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɛdɪkoʊˈfɪzɪks/","syllables":"me-di-co-phy-sics"},"inflection":{"noun_plural":"Medicophysics (uncommon plural form)"},"usage_notes":{"explanation":"The term 'medicophysics' is largely synonymous with 'medical physics.' While 'medical physics' is the more common and widely accepted term today, 'medicophysics' may be encountered in older literature or used by some individuals or institutions. Both terms refer to the application of physics principles to medical and healthcare settings, including areas such as medical imaging, radiation therapy, nuclear medicine, and health physics.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am studying medicophysics, so I am a doctor.","correct":"✓ I am studying medicophysics, which involves applying physics to medicine.","note":"Studying medicophysics does not make someone a medical doctor. It involves applying physics principles to medical problems. It's a distinct field from medicine, although it works closely with it."}],"priority":"★★☆"},"related_words":{"derivatives":["medical physicist","radiology","oncology","nuclear medicine"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Rare","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Medicophysics' is a specialized term primarily used in academic and professional contexts related to medicine and physics. It refers to the application of physics principles to medical and healthcare settings. While 'medical physics' is more commonly used, understanding 'medicophysics' is useful for those in related fields. Knowledge of physics and medical terminology is helpful for understanding this term."},"example_sentences":[{"sentence":"The conference featured several presentations on the latest advancements in medicophysics.","translation":"その会議では、医療物理学の最新の進歩に関するいくつかのプレゼンテーションが行われました。","type":"noun","meaning_category":"application of physics to medicine"},{"sentence":"Medicophysics research is essential for improving the accuracy of radiation therapy.","translation":"医療物理学の研究は、放射線治療の精度を向上させるために不可欠です。","type":"noun","meaning_category":"application of physics to medicine"}]}