{"word":"dragonkind","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"竜族、竜の種類、竜の性質","english_definition":"The race or species of dragons; the collective of dragons; the nature or essence of dragons.","examples":[{"sentence":"The ancient prophecies spoke of a time when dragonkind would return to rule the skies.","translation":"古代の予言は、竜族が空を支配するために帰還する時について語っていた。"},{"sentence":"He felt a strange kinship with dragonkind, a connection he couldn't explain.","translation":"彼は竜族との奇妙な親近感を感じ、説明できないつながりを感じていた。"},{"sentence":"The paladin vowed to protect the realm from the destructive power of dragonkind.","translation":"パラディンは、竜族の破壊的な力から王国を守ることを誓った。"}],"collocations":["ancient dragonkind (古代の竜族)","powerful dragonkind (強力な竜族)","the future of dragonkind (竜族の未来)","the fate of dragonkind (竜族の運命)","the wisdom of dragonkind (竜族の知恵)"],"synonyms":["dragon race","dragon species","dragonfolk","wyrmkind","draconic beings"],"antonyms":["humanity","mankind","elfkind","dwarfkind"]},{"part_of_speech":"adjective","definition":"竜族の、竜のような性質を持つ","english_definition":"Of or pertaining to the race or species of dragons; having the nature or essence of dragons.","examples":[{"sentence":"The dragonkind magic was unlike anything he had ever encountered.","translation":"その竜族の魔法は、彼がこれまでに出会ったことのないものだった。"},{"sentence":"She possessed a dragonkind spirit, fierce and untamable.","translation":"彼女は竜族のような精神を持っており、獰猛で飼いならすことができなかった。"},{"sentence":"The artifact pulsed with dragonkind energy.","translation":"そのアーティファクトは、竜族のエネルギーで脈打っていた。"}],"collocations":["dragonkind magic (竜族の魔法)","dragonkind spirit (竜族の精神)","dragonkind energy (竜族のエネルギー)","dragonkind power (竜族の力)","dragonkind heritage (竜族の遺産)"],"synonyms":["draconic","dragonish","dragonlike","wyrmish"],"antonyms":["human","elven","dwarvish"]}],"etymology":{"value":"A compound word formed from \"dragon\" and \"kind\". \"Dragon\" comes from Old French and ultimately from Greek δράκων (drákōn), meaning \"serpent, giant seafish\". \"Kind\" comes from Old English cynd, meaning \"nature, species, race, sort\". Thus, \"dragonkind\" refers to the race, species, or nature of dragons.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdræɡənˌkaɪnd/","syllables":"drag-on-kind"},"inflection":{"noun_plural":"dragonkinds (rarely used)","notes":"As a noun, dragonkind is often used as an uncountable noun, referring to the collective of dragons. The plural form, dragonkinds, is less common. As an adjective, it does not inflect."},"usage_notes":{"explanation":"\"Dragonkind\" is primarily used in fantasy literature, games, and related contexts to refer to the collective of dragons as a race or species. It can also refer to the inherent nature or essence of dragons. As an adjective, it describes something that is of or pertaining to dragons. The term is often used to evoke a sense of ancient power, mystery, and connection to the draconic world.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The dragonkind are a noble species.","correct":"✓ Dragonkind is a noble species.","note":"When referring to the collective of dragons as a single entity, use the singular form of the verb (is). If referring to individual groups of dragons, \"dragon kinds\" or \"dragon species\" might be more appropriate."},{"incorrect":"✗ He had a dragonkind scale in his pocket.","correct":"✓ He had a dragon scale in his pocket.","note":"When referring to a single item (e.g., a scale), it's more common to use \"dragon scale\" rather than \"dragonkind scale\"."}],"priority":"★☆☆"},"related_words":{"derivatives":["dragon","draconic","dragonish","dragonlike","wyrm"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Not typically found in standard language learning materials)","frequency_google_ngram":"Low frequency (primarily used in fantasy literature and games)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Dragonkind\" is a relatively uncommon word, primarily used in fantasy contexts. It refers to the collective of dragons as a race or species, or to the inherent nature of dragons. Understanding the word requires familiarity with fantasy tropes and vocabulary. While not part of standard English vocabulary, its meaning can be inferred from its constituent parts: \"dragon\" and \"kind\" (meaning race or species)."},"example_sentences":[{"sentence":"The fate of dragonkind rested on the shoulders of the young hero.","translation":"竜族の運命は、若い英雄の肩にかかっていた。","type":"noun","meaning_category":"竜族 (collective)"},{"sentence":"The ancient texts spoke of the dragonkind's wisdom and power.","translation":"古代の文献は、竜族の知恵と力について語っていた。","type":"noun","meaning_category":"竜族 (collective)"},{"sentence":"She felt a deep connection to the dragonkind spirit of the mountains.","translation":"彼女は山々の竜族の精神との深いつながりを感じた。","type":"adjective","meaning_category":"竜族の (nature)"},{"sentence":"The dragonkind magic was both powerful and unpredictable.","translation":"その竜族の魔法は、強力であると同時に予測不可能だった。","type":"adjective","meaning_category":"竜族の (magic)"}]}