{"word":"Alismoid","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Resembling or related to the plant genus *Alisma* (water plantains).","english_definition":"Having characteristics similar to or associated with the plant genus *Alisma*.","examples":[{"sentence":"The leaf structure was described as alismoid, exhibiting broad, parallel venation similar to water plantains.","translation":"その葉の構造は、ヘラオモダカ属の植物に似た広くて平行な葉脈を示し、ヘラオモダカ型であると記述された。"}],"collocations":["alismoid leaf","alismoid venation"],"synonyms":["alisma-like"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name *Alisma* and the suffix '-oid', meaning 'resembling'.","priority":"★☆☆"},"pronunciation":{"ipa":"/əˈlɪzmɔɪd/","syllables":"a-lis-moid"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are not commonly used for 'alismoid'."},"usage_notes":{"explanation":"'Alismoid' is a botanical term used to describe features that are similar to those found in plants of the genus *Alisma*. It is most often used in describing leaf shapes and venation patterns.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The alismoid was found near the river.","correct":"✓ The alismoid leaf was found near the river.","note":"'Alismoid' is an adjective, so it needs to modify a noun. Using it as a noun is incorrect."}],"priority":"★☆☆"},"related_words":{"derivatives":["Alisma (genus)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency. Specialized botanical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Alismoid' is a technical term used in botany to describe something that resembles or is related to the plant genus *Alisma*, commonly known as water plantains. It is typically used in scientific or highly specialized contexts. Understanding requires familiarity with botanical terminology. "},"example_sentences":[{"sentence":"The fossilized leaf displayed an alismoid shape, suggesting a wetland environment.","translation":"その化石化した葉はヘラオモダカ型を示し、湿地の環境を示唆していた。","type":"adjective","meaning_category":"botany"},{"sentence":"Alismoid venation is characterized by parallel veins running from the base to the tip of the leaf.","translation":"ヘラオモダカ型の葉脈は、葉の基部から先端まで平行に走る葉脈によって特徴づけられる。","type":"adjective","meaning_category":"botany"}]}