{"word":"snow-blanketed","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"雪に覆われた、雪で覆い隠された","english_definition":"covered with a blanket of snow.","examples":[{"sentence":"The snow-blanketed fields stretched as far as the eye could see.","translation":"雪に覆われた野原は、見渡す限り広がっていた。"},{"sentence":"The village looked picturesque, snow-blanketed and peaceful.","translation":"その村は、雪に覆われ、平和で絵のように美しかった。"},{"sentence":"We woke up to a snow-blanketed landscape.","translation":"私たちは雪に覆われた景色の中で目を覚ました。"}],"collocations":["snow-blanketed landscape (雪に覆われた景色)","snow-blanketed fields (雪に覆われた野原)","snow-blanketed mountains (雪に覆われた山々)","snow-blanketed streets (雪に覆われた通り)"],"synonyms":["snow-covered","snow-laden","snowy","white with snow"],"antonyms":["snowless","bare","uncovered"],"notes":"This word is often used to describe a scene or landscape after a snowfall."}],"etymology":{"value":"The word is a compound adjective formed by combining 'snow' (referring to frozen precipitation) and 'blanketed' (meaning covered with a blanket). The term evokes the image of a blanket of snow covering the ground.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsnoʊ ˈblæŋkɪtɪd/","syllables":"snow-blan-ket-ed"},"inflection":{"notes":"This is an adjective and does not have different forms for gender or number."},"usage_notes":{"explanation":"'Snow-blanketed' is a descriptive adjective used to vividly portray a scene where snow has covered a surface, similar to how a blanket covers something. It is frequently used in literature and descriptive writing to create a visual image of winter landscapes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The snow blanketed was beautiful.","correct":"✓ The snow-blanketed landscape was beautiful.","note":"'Snow-blanketed' is an adjective and needs to modify a noun. It cannot stand alone as a subject or object."},{"incorrect":"✗ The snow blanketed.","correct":"✓ The ground was snow-blanketed.","note":"'Snow-blanketed' is an adjective, not a verb. It describes something that is covered in snow."}],"priority":"★★☆"},"related_words":{"derivatives":["snow (noun)","blanket (noun, verb)"],"related_terms":["snow-covered","snowfall","winter wonderland","whiteout"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, but easily understood due to the common words it is composed of.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Snow-blanketed' is a compound adjective that combines the familiar words 'snow' and 'blanket'. It is used to describe something that is covered in snow, like a field or a house. While not a very common word, its meaning is easily understood because of the common words it is made from. It is often used in descriptive writing to create a vivid image of a winter scene."},"example_sentences":[{"sentence":"The snow-blanketed forest was silent except for the crunch of our boots.","translation":"雪に覆われた森は、私たちのブーツの音以外は静まり返っていた。","type":"descriptive","meaning_category":"covered in snow"},{"sentence":"From the mountaintop, we could see the snow-blanketed valley below.","translation":"山頂から、眼下には雪に覆われた谷が見えた。","type":"descriptive","meaning_category":"covered in snow"},{"sentence":"The snow-blanketed rooftops of the town sparkled in the morning sun.","translation":"雪に覆われた町の屋根は、朝日に輝いていた。","type":"descriptive","meaning_category":"covered in snow"}]}