{"word":"cellarous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(ワインについて)セラーのような香りのする、貯蔵庫のような香りのする","english_definition":"(chiefly of wine) having aromas reminiscent of a cellar or storage area; earthy, musty, or damp.","examples":[{"sentence":"This wine has a cellarous quality, with hints of damp earth and old wood.","translation":"このワインは、湿った土や古い木材のヒントがあり、セラーのような品質を持っています。"},{"sentence":"The cellarous notes in the wine added complexity to its overall profile.","translation":"ワインのセラーのようなノートは、その全体的なプロファイルに複雑さを加えました。"}],"collocations":["cellarous aroma","cellarous notes","cellarous quality","cellarous character","cellarous bouquet"],"synonyms":["earthy","musty","damp","underground","cave-like","storage-like"],"antonyms":["fresh","fruity","floral","clean","bright"]}],"etymology":{"value":"Derived from 'cellar' (地下室、貯蔵庫) + '-ous' (～のような性質を持つことを示す接尾辞).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɛlərəs/","syllables":"cel-lar-ous"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more cellarous' and 'most cellarous', respectively, although these are rarely used."},"usage_notes":{"explanation":"'Cellarous' is primarily used in wine tasting and wine descriptions to denote a specific type of aroma or flavor profile. It's generally used to describe wines that have been aged or stored for a long time, and have developed earthy, musty, or damp notes that are reminiscent of a cellar environment. The term can have both positive and negative connotations, depending on the context and the overall balance of the wine. In some cases, a slight cellarous note can add complexity and interest, while in other cases it can indicate a flaw or spoilage.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The cellarous taste made the wine taste fresh.","correct":"✓ The cellarous taste made the wine taste earthy.","note":"'Cellarous' describes earthy or musty flavors, not fresh ones."},{"incorrect":"✗ The cellarous smell was from the flowers.","correct":"✓ The cellarous smell was from the wine.","note":"'Cellarous' refers to smells associated with cellars or aged wines, not flowers."}],"priority":"★★☆"},"related_words":{"derivatives":["cellar (名詞: 地下室、貯蔵庫)","cellared (形容詞: 地下室に貯蔵された)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'cellarous' is a specialized term primarily used in the context of wine tasting and wine description. It describes a specific aroma or flavor profile reminiscent of a cellar, often associated with aged wines. Understanding this term requires familiarity with wine vocabulary and sensory analysis. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The old Burgundy had a distinctly cellarous nose, with hints of mushroom and forest floor.","translation":"その古いブルゴーニュワインは、キノコや森の地面のヒントがあり、明らかにセラーのような香りがありました。","type":"adjective","meaning_category":"ワインの香り"},{"sentence":"Some critics found the wine's cellarous character to be a sign of age and complexity, while others deemed it a flaw.","translation":"批評家の中には、ワインのセラーのような特徴を熟成と複雑さの兆候と見なす人もいれば、欠陥と見なす人もいました。","type":"adjective","meaning_category":"ワインの特徴"}]}