{"word":"monstrify","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"怪物にする、異形化する、醜くする","english_definition":"To transform into a monster; to make monstrous or grotesque.","examples":[{"sentence":"The artist used digital tools to monstrify the human face in his artwork.","translation":"そのアーティストは、デジタルツールを使って、彼の芸術作品の中で人間の顔を怪物のように変形させた。"},{"sentence":"The chemical spill monstrified the local wildlife, causing grotesque mutations.","translation":"化学物質の流出は、地域の野生生物を怪物化させ、グロテスクな突然変異を引き起こした。"},{"sentence":"The director monstrified the villain's appearance to emphasize his evil nature.","translation":"監督は、悪役の邪悪な性質を強調するために、彼の外見を怪物のように変えた。"}],"collocations":["monstrify a face","monstrify an image","monstrify a character"],"synonyms":["deform","distort","grotesque","uglify","transform"],"antonyms":["beautify","enhance","improve"]}],"etymology":{"value":"\"Monstrify\" is derived from the word \"monster\" and the suffix \"-ify,\" which means \"to make\" or \"to cause to become.\"","priority":"★★☆"},"pronunciation":{"ipa":"ˈmɒnstrɪfaɪ","syllables":"mon-stri-fy"},"inflection":{"verb_forms":{"present_simple":["monstrify","monstrifies"],"past_simple":"monstrified","past_participle":"monstrified","present_participle":"monstrifying"}},"usage_notes":{"explanation":"\"Monstrify\" is a relatively rare and somewhat informal verb. It is often used in creative contexts, such as art, literature, and film, to describe the act of making something or someone appear monstrous or grotesque. It can also be used metaphorically to describe the act of distorting or exaggerating something to make it seem more frightening or negative.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The story monstrified me.","correct":"✓ The story frightened me.","note":"\"Monstrify\" is used to describe the act of transforming something into a monster, not to describe the feeling of being frightened. Use \"frighten\" or \"scare\" to describe the feeling of fear."}],"priority":"★☆☆"},"related_words":{"derivatives":["monstrous (adjective: 怪物のような、恐ろしい)","monster (noun: 怪物)","monstrosity (noun: 怪物性、巨大なもの、奇形)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"\"Monstrify\" is a less common verb that means to transform something into a monster or to make it appear monstrous. It's often used in creative writing or when discussing visual arts where something is intentionally made to look grotesque or frightening. Because it's not a frequently used word, it's more likely to be understood by advanced English speakers.","priority":"★☆☆"},"example_sentences":[{"sentence":"The special effects artist monstrified the actor for his role as a zombie.","translation":"特殊効果アーティストは、俳優をゾンビ役のために怪物のように変身させた。","type":"verb","meaning_category":"怪物にする"},{"sentence":"The propaganda monstrified the enemy, portraying them as inhuman.","translation":"プロパガンダは敵を怪物化し、彼らを非人間的に描いた。","type":"verb","meaning_category":"異形化する"},{"sentence":"The filter on the app can monstrify your selfies with grotesque features.","translation":"アプリのフィルターは、あなたの自撮りをグロテスクな特徴で怪物のように変えることができる。","type":"verb","meaning_category":"醜くする"}]}