{"word":"burn-nose","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(slang, derogatory) A person who is excessively eager to please or impress; a brown-noser.","english_definition":"(slang, derogatory) A person who tries to win favor from superiors through flattery; a sycophant.","examples":[{"sentence":"He's such a burn-nose, always sucking up to the boss.","translation":"彼は本当にごますりで、いつも上司に取り入ろうとしている。"}],"collocations":["to be a burn-nose","a typical burn-nose"],"synonyms":["brown-noser","sycophant","bootlicker","flatterer","yes-man"],"antonyms":["rebel","dissenter"]}],"etymology":{"value":"Likely a variation of 'brown-nose', with 'burn' perhaps suggesting an even more intense or irritating form of flattery.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈbɜːrnˌnoʊz/","syllables":"burn-nose"},"inflection":{"noun_plural":"burn-noses"},"usage_notes":{"explanation":"'Burn-nose' is a slang term, often considered derogatory, used to describe someone who excessively flatters or tries to please people in positions of authority, usually for personal gain. It's less common than 'brown-nose' but carries a similar meaning and negative connotation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a burn-nose person.","correct":"He is a burn-nose.","note":"'Burn-nose' is already a noun referring to a person, so adding 'person' is redundant."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Burn-nose' is a slang term used to describe someone who excessively flatters people in positions of authority. It is similar in meaning to 'brown-noser' but is less common. The term is generally considered derogatory. Because it is slang, it is not typically used in formal contexts."},"example_sentences":[{"sentence":"Don't be such a burn-nose; the manager can see right through your fake compliments.","translation":"そんなにごますりをするな。マネージャーは君の偽りの褒め言葉を見抜いているよ。","type":"noun","meaning_category":"derogatory term for a flatterer"}]}