{"word":"soberize","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人)を酔いから覚ます、正気に戻す","english_definition":"to make (someone) sober; to restore to a state of sobriety.","examples":[{"sentence":"They tried to soberize him with coffee and a cold shower.","translation":"彼らはコーヒーと冷たいシャワーで彼を酔いから覚まそうとした。"},{"sentence":"The shock of the accident soberized him instantly.","translation":"事故の衝撃で彼はすぐに正気に戻った。"}],"collocations":["soberize someone up","soberize oneself"],"synonyms":["sober up","make sober","restore to sobriety","clear-headed","clear one's head"],"antonyms":["intoxicate","inebriate","make drunk"]},{"part_of_speech":"verb","transitivity":"vt","definition":"(雰囲気、状況など)を落ち着かせる、冷静にする","english_definition":"to make (something) more serious or subdued; to make less frivolous or exciting.","examples":[{"sentence":"The economic crisis soberized the mood of the nation.","translation":"経済危機は国民の雰囲気を落ち着かせた。"},{"sentence":"The news of the tragedy soberized the celebration.","translation":"悲劇の知らせは祝賀会を冷静にした。"}],"collocations":["soberize the mood","soberize the atmosphere"],"synonyms":["tone down","subdue","moderate","temper","calm"],"antonyms":["excite","enliven","animate"]}],"etymology":{"value":"\"Sober\" + \"-ize\". \"Sober\" comes from Latin \"sobrius\" meaning \"temperate, moderate, sensible.\" The suffix \"-ize\" means \"to make, to render.\" Therefore, \"soberize\" means \"to make sober.\"","priority":"★★☆"},"pronunciation":{"ipa":"ˈsoʊbəraɪz","syllables":"so-ber-ize"},"inflection":{"verb_forms":{"present_simple":["soberize","soberizes"],"past_simple":"soberized","past_participle":"soberized","present_participle":"soberizing"}},"usage_notes":{"explanation":"\"Soberize\" is a verb that primarily means to make someone sober, usually from alcohol intoxication. It can also be used in a more figurative sense to describe making a situation or atmosphere more serious or subdued. The term is less common than \"sober up,\" but it conveys a similar meaning in a more formal or technical context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He soberized himself by drinking more alcohol.","correct":"✓ He tried to soberize himself by drinking coffee.","note":"Drinking more alcohol would not soberize someone; it would have the opposite effect. Soberizing involves methods to reduce the effects of alcohol, such as drinking water, coffee, or resting."},{"incorrect":"✗ The party soberized quickly after the music started.","correct":"✓ The party soberized quickly after the police arrived.","note":"Parties don't soberize because of music, but rather because of an event that causes people to become more serious or subdued, such as the arrival of the police or bad news."}],"priority":"★☆☆"},"related_words":{"derivatives":["soberization (noun)"],"phrasal_verbs":["sober up"],"related_terms":["sober (adjective, verb)","sobriety (noun)","intoxicate (verb)","inebriate (verb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Soberize\" is a relatively uncommon verb that means to make someone sober or to make a situation more serious. It is often used in formal or technical contexts. It is derived from the word \"sober,\" which means not drunk or serious, and the suffix \"-ize,\" which means to make. The word is not commonly used in everyday conversation, but it is helpful to know its meaning for understanding more complex texts or discussions.","priority":"★☆☆"},"example_sentences":[{"sentence":"The cold air seemed to soberize her thoughts.","translation":"冷たい空気は彼女の思考を冷静にしたようだった。","type":"verb","meaning_category":"落ち着かせる"},{"sentence":"The police used various methods to soberize the suspect before questioning him.","translation":"警察は容疑者を尋問する前に、彼を酔いから覚ますために様々な方法を用いた。","type":"verb","meaning_category":"酔いから覚ます"}]}