{"word":"ovigenic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(魚類について)卵形成に必要な栄養のほとんどを卵黄に蓄え、摂食をほとんどまたは全く行わない","english_definition":"(of fish) relying primarily or entirely on yolk reserves for egg development, with little or no feeding during oogenesis.","examples":[{"sentence":"Ovigenic fish typically spawn multiple batches of eggs.","translation":"卵生魚は通常、複数の卵を産みます。"},{"sentence":"The cod is an example of an ovigenic species.","translation":"タラは卵生種の例です。"}],"collocations":["ovigenic oogenesis","ovigenic reproduction","ovigenic strategy"],"synonyms":["lecithotrophic","yolk-dependent"],"antonyms":["synonymous with capital breeding, but not directly antonymous"]},{"part_of_speech":"adjective","definition":"卵発生中に外部からの栄養供給に依存しない","english_definition":"Not depending on external food supply during egg development.","examples":[{"sentence":"The ovigenic teleost fish does not feed during the reproductive cycle.","translation":"卵生の硬骨魚は繁殖期に餌を食べません。"}],"collocations":["ovigenic teleost","ovigenic fish"],"synonyms":["autogenous"],"antonyms":["heterogenous"]}],"etymology":{"value":"Derived from the Latin words 'ovum' (egg) and 'genus' (origin, birth).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊvɪˈdʒɛnɪk/","syllables":"o-vi-gen-ic"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"'Ovigenic' is a term primarily used in ichthyology (the study of fish) to describe a reproductive strategy where the female fish relies almost exclusively on the nutrients stored in the yolk of the egg for its development. These fish typically do not feed, or feed very little, during the period when their eggs are maturing. This is in contrast to fish that feed actively during egg development, supplementing the yolk reserves with nutrients obtained from their environment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The ovigenic fish are feeding a lot.","correct":"✓ The ovigenic fish are not feeding a lot.","note":"Ovigenic fish typically do not feed much during oogenesis."}],"priority":"★★☆"},"related_words":{"derivatives":["oogenesis","vitellogenesis","lecithotrophy"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'ovigenic' is a specialized term used in the field of fish biology. It describes a specific reproductive strategy where fish rely on yolk reserves in their eggs for development, rather than feeding during this process. Understanding this term requires some background knowledge in biology and reproductive strategies of fish."},"example_sentences":[{"sentence":"The **ovigenic** nature of the species allows for rapid reproduction in nutrient-poor environments.","translation":"その種の卵生の性質は、栄養の乏しい環境での迅速な繁殖を可能にする。","type":"general","meaning_category":"general"},{"sentence":"**Ovigenic** fish often exhibit a clear trade-off between egg size and number.","translation":"卵生魚は、卵のサイズと数の間に明確なトレードオフを示すことが多い。","type":"scientific","meaning_category":"scientific"}]}