{"word":"underlawyer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare) An assistant or subordinate lawyer; a lawyer of lesser rank or experience.","english_definition":"A lawyer who is subordinate to or assists another lawyer, typically one with more experience or higher rank.","examples":[{"sentence":"The senior partner assigned the underlawyer to research the case law.","translation":"上級パートナーは、その事件の判例を調査するために、下位の弁護士を割り当てた。"},{"sentence":"As an underlawyer, she gained valuable experience working on complex litigation.","translation":"下位の弁護士として、彼女は複雑な訴訟に取り組むことで貴重な経験を積んだ。"}],"collocations":["senior partner and underlawyer","underlawyer's responsibilities","mentoring an underlawyer"],"synonyms":["junior lawyer","associate attorney","legal assistant","subordinate counsel"],"antonyms":["senior lawyer","partner","lead counsel"]}],"etymology":{"value":"Formed by combining \"under-\" (meaning subordinate or lower in rank) with \"lawyer\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʌndərˌlɔɪər/","syllables":"un-der-law-yer"},"inflection":{"noun_plural":"underlawyers"},"usage_notes":{"explanation":"The term \"underlawyer\" is not commonly used in modern legal practice. Terms like \"associate attorney\", \"junior lawyer\", or \"legal assistant\" are more prevalent. The word may carry a slightly negative or demeaning connotation, suggesting a lack of importance or skill.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The underlawyer was responsible for arguing the case in court.","correct":"✓ The junior lawyer was responsible for arguing the case in court.","note":"It's more common to use 'junior lawyer' or 'associate attorney' in this context."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"underlawyer\" is a rare and somewhat archaic term for a junior or subordinate lawyer. Modern legal terminology typically uses terms like \"associate attorney\" or \"junior lawyer\" to describe this role. The term may not be widely understood or accepted in contemporary legal practice."},"example_sentences":[{"sentence":"The underlawyer diligently prepared the documents for the trial.","translation":"下位の弁護士は、裁判のための書類を熱心に準備した。","type":"noun","meaning_category":"subordinate lawyer"},{"sentence":"He started his career as an underlawyer before becoming a partner at the firm.","translation":"彼は事務所のパートナーになる前に、下位の弁護士としてキャリアをスタートさせた。","type":"noun","meaning_category":"subordinate lawyer"}]}