{"word":"recategorized","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"再分類する、別のカテゴリーに分類し直す","english_definition":"To categorize again or differently. To assign to a new or different category.","examples":[{"sentence":"The library recategorized several books to better reflect their content.","translation":"図書館は、内容をより適切に反映させるために、いくつかの本を再分類した。"},{"sentence":"The company recategorized its expenses for better budget tracking.","translation":"会社は予算管理を改善するために経費を再分類した。"},{"sentence":"The scientist recategorized the species after new genetic evidence emerged.","translation":"科学者は新たな遺伝的証拠が出てきた後、その種を再分類した。"}],"collocations":["recategorize items","recategorize expenses","recategorize data","recategorize species"],"synonyms":["reclassify","rearrange","reorganize","re-sort","re-group"],"antonyms":["none (generally no direct antonyms, but 'maintain category' or 'keep categorized' could be considered opposites in context)"]}],"etymology":{"value":"The word is formed by adding the prefix 're-' (meaning 'again' or 'anew') to the word 'categorize'. 'Categorize' comes from 'category', which originates from the Greek word 'kategoria' (accusation, predicate).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˈkætəɡəˌraɪzd/","syllables":"ree-cat-e-go-rized"},"inflection":{"verb_forms":{"present_simple":["recategorize","recategorizes"],"past_simple":"recategorized","past_participle":"recategorized","present_participle":"recategorizing"}},"usage_notes":{"explanation":"'Recategorize' implies a previous categorization existed and is now being changed. It suggests a deliberate act of reassignment based on new information, a change in perspective, or a need for improved organization. It is commonly used in contexts involving data, information, or objects that need to be organized into specific groups or classes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The system was recategorized by the new software.","correct":"✓ The data was recategorized by the new software.","note":"'Recategorize' usually applies to the items being categorized, not the system doing the categorization. The system might be *used* to recategorize the data. "},{"incorrect":"✗ We recategorized about the project.","correct":"✓ We recategorized the project.","note":"'Recategorize' is a transitive verb and requires a direct object (the thing being recategorized). The preposition 'about' is incorrect in this context."}],"priority":"★☆☆"},"related_words":{"derivatives":["recategorization (noun)"],"phrasal_verbs":["none common"],"related_terms":["categorize","category","classification","taxonomy","reclassify"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency. Specialized or technical vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Recategorized' is a relatively advanced word that means to categorize something again or to put it into a different category. It is often used in formal contexts, such as in scientific research, library science, or business administration, where items or information need to be organized and re-organized into different groups based on specific criteria. Understanding this word implies a grasp of the concept of categorization itself and the ability to recognize when a re-evaluation and reassignment are necessary."},"example_sentences":[{"sentence":"The museum recategorized its artifacts to provide a more accurate historical context.","translation":"博物館は、より正確な歴史的背景を提供するために、所蔵品を再分類した。","type":"verb","meaning_category":"再分類する"},{"sentence":"The marketing team recategorized customers based on their recent purchasing behavior.","translation":"マーケティングチームは、最近の購買行動に基づいて顧客を再分類した。","type":"verb","meaning_category":"再分類する"},{"sentence":"The documents were recategorized to improve search efficiency.","translation":"ドキュメントは検索効率を向上させるために再分類された。","type":"verb","meaning_category":"再分類する"}]}