{"word":"Finno-Tatar","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"フィン・タタール語派の、またはそれらに関連する","english_definition":"Relating to or denoting the Finno-Ugric and Turkic language families, or the hypothetical common origin of these.","examples":[{"sentence":"The Finno-Tatar theory has been largely discredited by modern linguistics.","translation":"フィン・タタール説は、現代言語学によってほぼ否定されています。"}],"collocations":["Finno-Tatar languages","Finno-Tatar origins"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"フィン・タタール語派","english_definition":"A largely obsolete term for a proposed language family including the Finno-Ugric and Turkic languages.","examples":[{"sentence":"Early linguists attempted to classify Hungarian as a Finno-Tatar language.","translation":"初期の言語学者は、ハンガリー語をフィン・タタール語として分類しようと試みました。"}],"collocations":["Finno-Tatar hypothesis","Finno-Tatar family"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"A compound of 'Finno-' (referring to Finno-Ugric languages) and 'Tatar' (referring to Turkic languages), reflecting the now-discredited theory of a common origin.","priority":"★★★"},"pronunciation":{"ipa":"/ˌfɪnoʊˈtɑːtər/","syllables":"Fi-no-Ta-tar"},"inflection":{},"usage_notes":{"explanation":"The term 'Finno-Tatar' is largely obsolete and considered inaccurate in modern linguistics. It reflects an outdated theory that the Finno-Ugric and Turkic language families share a common ancestor. While the term may still be encountered in older texts, it is generally avoided in contemporary academic discourse.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["Finno-Ugric","Turkic"],"related_terms":[]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term 'Finno-Tatar' is a specialized term primarily encountered in historical linguistic contexts. Understanding requires familiarity with language family classifications and the history of linguistic theory. It is not commonly used in general English.","priority":"★★☆"},"example_sentences":[{"sentence":"The concept of a unified Finno-Tatar language group is no longer accepted by most linguists.","translation":"統一されたフィン・タタール語族という概念は、もはやほとんどの言語学者に受け入れられていません。","type":"general","meaning_category":"linguistics"},{"sentence":"Historical texts sometimes refer to Hungarian as having Finno-Tatar roots.","translation":"歴史的な文献では、ハンガリー語がフィン・タタール語のルーツを持つと記述されていることがあります。","type":"historical","meaning_category":"linguistics"}]}