{"word":"Hunnish","priority":"低","meanings":[{"part_of_speech":"adjective","definition":"フン族の、フン族に関する","english_definition":"Relating to the Huns, their language, or their culture.","examples":[{"sentence":"The Hunnish empire stretched across much of Eastern Europe.","translation":"フン族の帝国は東ヨーロッパの大部分に広がっていた。"},{"sentence":"Hunnish artifacts are rare finds in archaeological digs.","translation":"フン族の遺物は、考古学的発掘調査では稀な発見物である。"}],"collocations":["Hunnish empire","Hunnish language","Hunnish culture","Hunnish invasion"],"synonyms":["Hunnic"],"antonyms":[]},{"part_of_speech":"adjective","definition":"野蛮な、破壊的な、残忍な","english_definition":"barbaric; destructive; ruthless.","examples":[{"sentence":"The invaders displayed Hunnish cruelty towards the conquered people.","translation":"侵略者たちは征服された人々に対してフン族のような残虐性を示した。"},{"sentence":"His Hunnish behavior shocked everyone at the party.","translation":"彼の野蛮な振る舞いはパーティーの皆を驚かせた。"}],"collocations":["Hunnish cruelty","Hunnish destruction","Hunnish behavior"],"synonyms":["barbaric","savage","ruthless","destructive","vandalistic"],"antonyms":["civilized","humane","gentle"]}],"etymology":{"value":"From 'Hun' + '-ish'. Referring to the Huns, a nomadic people who migrated into Europe in the 4th century. The term often carries connotations of barbarism and destruction due to their historical reputation.","priority":"中"},"pronunciation":{"ipa":"/ˈhʌnɪʃ/","syllables":"Hun-nish","audio_url":null},"inflection":{"notes":"Adjective; no specific inflections."},"usage_notes":{"explanation":"'Hunnish' can refer literally to the Huns and their culture. More commonly, it's used metaphorically to describe behavior that is considered barbaric, destructive, or ruthless. The metaphorical use is more frequent than the literal historical reference.","priority":"高"},"common_mistakes":{"examples":[{"incorrect":"The city was destroyed in a Hunnish way.","correct":"The city was destroyed in a Hunnish manner.","note":"'Manner' is often a more appropriate noun to use with 'Hunnish' when describing a way of acting."}],"priority":"中"},"related_words":{"derivatives":["Hun","Hunnic"],"phrases":[],"priority":"高"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低","priority":"低"},"readability_explanation":{"level":"C1","text":"The word 'Hunnish' has two primary uses. It can directly relate to the historical Huns, a nomadic group. More commonly, it's used figuratively to describe actions or behaviors that are savage, destructive, or ruthless, drawing on the historical reputation of the Huns. The figurative use requires understanding of historical context to fully grasp the intended meaning."},"example_sentences":[{"sentence":"Archaeologists have uncovered several Hunnish burial sites.","translation":"考古学者たちはいくつかのフン族の埋葬地を発掘した。","type":"adjective","meaning_category":"フン族の"},{"sentence":"The invaders treated the villagers with Hunnish brutality.","translation":"侵略者たちは村人たちをフン族のような残虐さで扱った。","type":"adjective","meaning_category":"野蛮な"}]}