{"word":"orniscopic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"鳥類観察の、鳥類観察に関する","english_definition":"Relating to or used in ornithoscopy (divination using the observation of birds).","examples":[{"sentence":"The orniscopic practices of the ancient Romans were closely tied to their political decisions.","translation":"古代ローマ人の鳥占い（鳥類観察による占い）は、彼らの政治的決定と密接に結びついていた。"},{"sentence":"An orniscopic interpretation of the birds' flight patterns suggested a favorable outcome for the battle.","translation":"鳥の飛行パターンを鳥占い的に解釈すると、その戦いの結果は良好であることが示唆された。"}],"collocations":["orniscopic observation","orniscopic interpretation","orniscopic practice"],"synonyms":["auspicious","divinatory","soothsaying"],"antonyms":[]}],"etymology":{"value":"Derived from the Ancient Greek words \"ornis\" (ὄρνις) meaning \"bird\" and \"skopeō\" (σκοπέω) meaning \"I view, examine, inspect\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɔːrnɪˈskɒpɪk/","syllables":"or-ni-sco-pic"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"The term \"orniscopic\" specifically relates to the practice of ornithoscopy, which is a form of divination that involves observing the flight and behavior of birds to interpret omens or predict future events. It is often used in historical or anthropological contexts when discussing ancient religious or cultural practices.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The orniscopic device helped them see birds better.","correct":"✓ Binoculars helped them see birds better.","note":"\"Orniscopic\" refers to divination by observing birds, not to devices used for birdwatching. Use terms like \"binoculars\" or \"telescope\" for birdwatching equipment."}],"priority":"★☆☆"},"related_words":{"derivatives":["ornithoscopy (noun): the practice of divination by observing birds","ornithoscopist (noun): a person who practices ornithoscopy"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"orniscopic\" is a highly specialized term primarily used in historical, anthropological, or classical studies contexts. It refers specifically to the practice of ornithoscopy, an ancient form of divination. Due to its narrow application and infrequent use, it is considered an advanced vocabulary word. Understanding its etymology helps to grasp its meaning, as it directly combines the Greek roots for \"bird\" and \"observation.\""},"example_sentences":[{"sentence":"The priest offered an orniscopic reading of the flock's movements before the battle.","translation":"司祭は戦闘の前に、群れの動きを鳥占い的に解釈して示した。","type":"adjective","meaning_category":"鳥類観察の・鳥占いに関する"},{"sentence":"Ancient texts describe orniscopic rituals used to determine the will of the gods.","translation":"古代の文献には、神々の意志を決定するために用いられた鳥占い儀式が記述されている。","type":"adjective","meaning_category":"鳥類観察の・鳥占いに関する"}]}