{"word":"aquifoliaceous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"モチノキ科の","english_definition":"Of or pertaining to the Aquifoliaceae family of plants, which includes hollies.","examples":[{"sentence":"The garden featured many aquifoliaceous shrubs, providing year-round greenery.","translation":"その庭園には多くのモチノキ科の低木があり、一年中緑を提供していました。"},{"sentence":"Aquifoliaceous plants are known for their characteristic berries and evergreen leaves.","translation":"モチノキ科の植物は、特徴的な果実と常緑の葉で知られています。"}],"collocations":["aquifoliaceous shrub","aquifoliaceous tree","aquifoliaceous leaves","aquifoliaceous berries"],"synonyms":["holly-like"],"antonyms":[]}],"etymology":{"value":"From the Latin words 'aquifolium' (holly) and '-aceous' (resembling or belonging to).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌækwɪˌfoʊliˈeɪʃəs/","syllables":"a-qui-fo-li-a-ce-ous"},"inflection":{},"usage_notes":{"explanation":"'Aquifoliaceous' is a botanical term specifically used to describe plants belonging to or resembling the Aquifoliaceae family, which is best known for the holly genus (Ilex). It's a relatively uncommon word outside of botanical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant had aquifoliaceous flowers.","correct":"✓ The plant had flowers.","note":"Aquifoliaceous refers to the plant family, not the flower type. While hollies do flower, the term doesn't describe the flowers themselves."}],"priority":"★★☆"},"related_words":{"derivatives":["Aquifoliaceae (noun: the holly family of plants)","Ilex (noun: the genus of holly plants)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - a specialized botanical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Aquifoliaceous' is a technical term used in botany. It describes plants that belong to or resemble the Aquifoliaceae family, which includes hollies. This word is unlikely to be encountered outside of specialized botanical or horticultural contexts."},"example_sentences":[{"sentence":"The botanist identified the specimen as an aquifoliaceous species based on its leaf structure.","translation":"植物学者は、その標本の葉の構造から、モチノキ科の種であると特定しました。","type":"adjective","meaning_category":"植物学"},{"sentence":"Many aquifoliaceous plants are popular choices for landscaping due to their hardiness.","translation":"多くのモチノキ科の植物は、その丈夫さから、景観緑化によく選ばれます。","type":"adjective","meaning_category":"植物学"}]}