{"word":"metabolite","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"代謝産物、代謝物","english_definition":"A substance formed in or necessary for metabolism.","examples":[{"sentence":"This drug is broken down into several metabolites in the liver.","translation":"この薬は肝臓でいくつかの代謝産物に分解される。"},{"sentence":"The researchers studied the levels of various metabolites in the blood.","translation":"研究者たちは血液中の様々な代謝産物のレベルを調査した。"},{"sentence":"Some metabolites are toxic and need to be eliminated from the body.","translation":"一部の代謝産物は有毒であり、体内から除去する必要がある。"}],"collocations":["primary metabolite (一次代謝産物)","secondary metabolite (二次代謝産物)","toxic metabolite (有毒代謝産物)","drug metabolite (薬物代謝産物)","metabolite profiling (代謝産物プロファイリング)","metabolite analysis (代謝産物分析)"],"synonyms":["metabolic product","intermediate"],"antonyms":[]}],"etymology":{"value":"'Metabolite' comes from 'metabolism' + '-ite'. 'Metabolism' itself comes from Greek 'metabole' meaning 'change'. Therefore, a metabolite is something that is changed or produced during metabolism.","priority":"★★★"},"pronunciation":{"ipa":"/məˈtæbəlaɪt/","syllables":"me-tab-o-lite"},"inflection":{"noun_plural":"metabolites"},"usage_notes":{"explanation":"A metabolite is a general term for any substance produced during metabolism. Metabolism is the set of chemical processes that occur in living organisms to maintain life. These processes include the breakdown of substances to obtain energy (catabolism) and the synthesis of new substances (anabolism). Metabolites can be small molecules like glucose or amino acids, or larger molecules like proteins or lipids. They can be intermediates in metabolic pathways, end products of metabolism, or waste products that need to be eliminated from the body.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The metabolite is a process.","correct":"✓ The metabolite is a substance.","note":"A metabolite is a substance or molecule, not a process. Metabolism is the process."},{"incorrect":"✗ Metabolites are only bad for you.","correct":"✓ Some metabolites are toxic, but others are essential for life.","note":"While some metabolites are toxic, many are essential for normal bodily functions."}],"priority":"★★☆"},"related_words":{"derivatives":["metabolic (形容詞: 代謝の)","metabolism (名詞: 代謝)","metabolize (動詞: 代謝する)"],"compounds":["primary metabolite (一次代謝産物)","secondary metabolite (二次代謝産物)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"比較的低い (Relatively low) - 専門的な文脈で使われる語彙。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Metabolite' is a technical term used in biology, biochemistry, and medicine. It refers to any substance produced or used during metabolism, which is the set of chemical processes that keep living organisms alive. Metabolites can be anything from small molecules like sugars and amino acids to larger molecules like proteins and fats. They play various roles, such as providing energy, building cells, and eliminating waste. The term is often encountered in scientific research and medical contexts when discussing how the body processes drugs, nutrients, and other substances. Understanding the concept of metabolites requires some background knowledge in biology and chemistry."},"example_sentences":[{"sentence":"The study identified several novel metabolites associated with the disease.","translation":"その研究は、その疾患に関連するいくつかの新規代謝産物を特定した。","type":"noun","meaning_category":"代謝産物"},{"sentence":"The concentration of this metabolite increases after exercise.","translation":"この代謝産物の濃度は運動後に増加する。","type":"noun","meaning_category":"代謝産物"},{"sentence":"The drug's active metabolite is responsible for its therapeutic effects.","translation":"その薬物の活性代謝産物がその治療効果の原因である。","type":"noun","meaning_category":"代謝産物"}]}