{"word":"Radiolucency","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"放射線透過性、X線透過性","english_definition":"The property of being transparent to X-rays or other forms of radiation. A radiolucent substance allows radiation to pass through it with minimal absorption.","examples":[{"sentence":"The radiolucency of the lung tissue allows for clear visualization of the pulmonary vessels.","translation":"肺組織の放射線透過性により、肺血管の鮮明な視覚化が可能になる。"},{"sentence":"Air is highly radiolucent, appearing dark on X-ray images.","translation":"空気は放射線透過性が高く、X線画像では暗く見える。"},{"sentence":"Increased radiolucency in a bone may indicate osteoporosis.","translation":"骨の放射線透過性の増加は、骨粗鬆症を示唆する可能性がある。"}],"collocations":["increased radiolucency","decreased radiolucency","area of radiolucency","radiolucency of bone","radiolucency of lung"],"synonyms":["transparency to radiation","X-ray transparency","diaphaneity"],"antonyms":["radiopacity","opacity to radiation"]}],"etymology":{"value":"Derived from 'radio-' (referring to radiation) and 'lucency' (the state of being translucent or allowing light to pass through).","priority":"★★☆"},"pronunciation":{"ipa":"ˌreɪdioʊˈluːsənsi","syllables":"ra-di-o-lu-cen-cy"},"inflection":{"noun_plural":"Radiolucencies"},"usage_notes":{"explanation":"Radiolucency refers specifically to the degree to which a substance allows radiation, especially X-rays, to pass through it. In medical imaging, radiolucent areas appear darker on X-rays because more radiation has passed through and reached the detector. It's a crucial concept in interpreting medical images like X-rays, CT scans, and fluoroscopy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The bone is radiolucent because it absorbs a lot of radiation.","correct":"✓ The bone is radiolucent because it allows radiation to pass through.","note":"Radiolucency means allowing radiation to pass through, not absorbing it. Substances that absorb radiation are radiopaque."},{"incorrect":"✗ Radiolucency is the same as radiopacity.","correct":"✓ Radiolucency is the opposite of radiopacity.","note":"Radiolucency and radiopacity are opposite concepts. Radiolucent substances appear dark on X-rays, while radiopaque substances appear light."}],"priority":"★★☆"},"related_words":{"derivatives":["radiolucent (adjective)"],"related_terms":["radiopaque","radiopacity","X-ray","radiation","computed tomography (CT)","magnetic resonance imaging (MRI)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Radiolucency' is a technical term used in medical imaging. It describes how easily X-rays or other radiation can pass through a substance. If something is radiolucent, it means radiation goes through it easily, and it will appear dark on an X-ray image. This is important for doctors to see different tissues and structures inside the body. For example, air is radiolucent, while bone is less so. Understanding radiolucency helps doctors diagnose medical conditions.","priority":"★★☆"},"example_sentences":[{"sentence":"The **radiolucency** of the air-filled lungs contrasts sharply with the **radiopacity** of the bones in the chest.","translation":"空気で満たされた肺の放射線透過性は、胸部の骨の放射線不透過性と著しく対照的である。","type":"noun","meaning_category":"放射線透過性"},{"sentence":"Areas of increased **radiolucency** on the dental X-ray may indicate tooth decay.","translation":"歯科X線写真上の放射線透過性の増加した領域は、虫歯を示唆する可能性がある。","type":"noun","meaning_category":"放射線透過性"},{"sentence":"The physician noted the **radiolucency** of the patient's lungs, suggesting possible emphysema.","translation":"医師は患者の肺の放射線透過性に注目し、肺気腫の可能性を示唆した。","type":"noun","meaning_category":"放射線透過性"}]}