{"word":"townscape","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"街並み、市街景観","english_definition":"The visual appearance of a town or urban area; the combination of natural and built elements that create the character of a town.","examples":[{"sentence":"The townscape is dominated by the old church.","translation":"その街並みは古い教会がひときわ目立っている。"},{"sentence":"The council is working to preserve the townscape.","translation":"市議会は街並みの保全に取り組んでいる。"},{"sentence":"New buildings should be designed to complement the existing townscape.","translation":"新しい建物は既存の街並みに調和するように設計されるべきだ。"}],"collocations":["urban townscape","historic townscape","preserve the townscape","enhance the townscape","destroy the townscape"],"synonyms":["cityscape","streetscape","urban landscape","urban scene"],"antonyms":["landscape","countryside"]},{"part_of_speech":"noun","definition":"（街並みをテーマにした）絵画、写真","english_definition":"A painting, drawing, or photograph depicting a town or urban area.","examples":[{"sentence":"He painted a beautiful townscape of the old city.","translation":"彼は古い街の美しい街並みの絵を描いた。"},{"sentence":"The exhibition features townscapes by local artists.","translation":"その展覧会では、地元のアーティストによる街並みの絵画が展示されている。"}],"collocations":["paint a townscape","photograph a townscape","townscape painting","townscape photography"],"synonyms":["urban painting","cityscape art"],"antonyms":[]}],"etymology":{"value":"\"Town\" + \"-scape\". \"Scape\" is a suffix denoting a view or scene.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtaʊnskɛɪp/","syllables":"town-scape"},"inflection":{"noun_plural":"townscapes"},"usage_notes":{"explanation":"\"Townscape\" refers to the overall visual character and appearance of a town or city. It encompasses buildings, streets, open spaces, and other elements that contribute to the unique identity of the urban environment. The term is often used in the context of urban planning, architecture, and conservation to emphasize the importance of preserving and enhancing the aesthetic qualities of towns and cities.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The town's landscape is beautiful.","correct":"✓ The town's townscape is beautiful.","note":"\"Landscape\" refers to a broader natural environment, while \"townscape\" specifically refers to the visual appearance of a town or urban area."},{"incorrect":"✗ I took a picture of the city's town.","correct":"✓ I took a picture of the city's townscape.","note":"\"Town\" refers to the settlement itself, while \"townscape\" refers to its visual appearance."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"townscape\" is used to describe the way a town or city looks. It includes all the buildings, streets, and other things that make up the visual character of the place. It's often used when talking about planning and protecting the beauty of towns and cities. It's more specific than \"landscape,\" which refers to a wider area of land, including natural features."},"example_sentences":[{"sentence":"The historic townscape attracts many tourists.","translation":"歴史的な街並みは多くの観光客を魅了する。","type":"noun","meaning_category":"街並み"},{"sentence":"The artist is known for his detailed townscape paintings.","translation":"その画家は、詳細な街並みの絵画で知られている。","type":"noun","meaning_category":"絵画"}]}