{"word":"farinaceously","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"粉状に、粉質で、デンプン質に","english_definition":"In a farinaceous manner; having the texture or qualities of flour or starch.","examples":[{"sentence":"The potatoes were cooked farinaceously, resulting in a fluffy texture.","translation":"ジャガイモは粉質に調理され、その結果、ふっくらとした食感になった。"},{"sentence":"The sauce thickened farinaceously as the starch was added.","translation":"デンプンを加えるにつれて、ソースはデンプン質に濃くなった。"}],"collocations":["cook farinaceously","thicken farinaceously"],"synonyms":["starchy","floury"],"antonyms":[]}],"etymology":{"value":"Derived from \"farinaceous\" (adjective meaning 'consisting of or made of flour or starch') + the suffix \"-ly\" (forming adverbs). \"Farinaceous\" comes from Latin \"farina\" (flour).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfærɪˈneɪʃəsli/","syllables":"fa-ri-na-ce-ous-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"The adverb \"farinaceously\" describes the manner in which something is done, specifically relating to a floury or starchy texture or quality. It is often used in culinary contexts to describe how food is cooked or prepared to achieve a particular texture.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bread was farinaceous, it tasted farinaceously.","correct":"✓ The bread was farinaceous; it tasted starchy.","note":"'Farinaceous' is the adjective to describe the bread itself. 'Farinaceously' describes how something is done or prepared."}],"priority":"★☆☆"},"related_words":{"derivatives":["farinaceous (adjective)","farina (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Farinaceously' is a highly specialized term, primarily used in culinary or scientific contexts. It describes something done in a manner that results in a floury or starchy texture. Due to its limited use, it's unlikely to be encountered outside of these specific fields."},"example_sentences":[{"sentence":"The chef prepared the dough farinaceously to ensure a light and airy bread.","translation":"シェフは、軽くてふわふわのパンになるように、生地を粉質に準備した。","type":"adverb","meaning_category":"manner of preparation"},{"sentence":"The sauce thickened farinaceously, creating a smooth and creamy consistency.","translation":"ソースはデンプン質に濃くなり、滑らかでクリーミーな一貫性が生まれた。","type":"adverb","meaning_category":"manner of thickening"}]}