{"word":"utility-powered","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"電力会社から供給される電力で動く、公共電力網に接続された","english_definition":"Powered by electricity supplied by a utility company; connected to the public power grid.","examples":[{"sentence":"The house is utility-powered, so we don't need to worry about generators.","translation":"この家は公共電力で動くので、発電機を心配する必要はありません。"},{"sentence":"Utility-powered vehicles are becoming more common as charging infrastructure improves.","translation":"充電インフラが改善されるにつれて、公共電力で動く車両がより一般的になっています。"},{"sentence":"The factory relies on a utility-powered system for its operations.","translation":"その工場は、操業のために公共電力によるシステムに依存しています。"}],"collocations":["utility-powered grid (公共電力網)","utility-powered vehicle (公共電力で動く車両)","utility-powered equipment (公共電力で動く設備)","utility-powered system (公共電力システム)"],"synonyms":["grid-powered","mains-powered","electricity-powered"],"antonyms":["battery-powered","solar-powered","generator-powered","off-grid"],"notes":"This term is often used to distinguish between devices or systems that rely on the public electricity grid versus those that use alternative power sources like batteries, solar panels, or generators."}],"etymology":{"value":"A combination of 'utility' (referring to a public service provider, especially for electricity) and 'powered' (meaning supplied with power).","priority":"N/A"},"pronunciation":{"ipa":"juːˈtɪlɪti ˈpaʊərd/","syllables":"u-til-i-ty pow-ered"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"The term 'utility-powered' is used to specify that a device, system, or building receives its electricity from the public grid, managed by a utility company. It's often used in contexts where alternative power sources are also being discussed.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The car is utility powered by solar panels.","correct":"The car is solar-powered.","note":"'Utility-powered' means powered by the public electrical grid, not by solar panels."}],"priority":"N/A"},"related_words":{"derivatives":["utility (noun)","power (noun, verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Technical term.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Utility-powered' is a technical term used to describe something that runs on electricity from the public grid, which is provided by a utility company. It's often used when comparing it to other power sources like solar or batteries. You'll typically find this term in discussions about energy, infrastructure, or technology."},"example_sentences":[{"sentence":"The new apartment building is fully utility-powered.","translation":"その新しいアパートは完全に公共電力で動いています。","type":"adjective","meaning_category":"電力会社から供給される電力で動く"},{"sentence":"The city is investing in utility-powered charging stations for electric vehicles.","translation":"市は電気自動車用の公共電力充電ステーションに投資しています。","type":"adjective","meaning_category":"電力会社から供給される電力で動く"}]}