{"word":"nonpursuit","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(通常は法律またはビジネスの文脈で)追求しないこと、追跡しないこと、訴追しないこと","english_definition":"the act or state of not pursuing something, especially a legal claim or business opportunity.","examples":[{"sentence":"The company decided on a policy of nonpursuit of minor copyright infringements.","translation":"その会社は、軽微な著作権侵害を追求しないという方針を決定した。"},{"sentence":"His nonpursuit of the contract allowed a competitor to win the bid.","translation":"彼が契約を追求しなかったため、競合他社が入札を獲得することができた。"},{"sentence":"The police's nonpursuit of the suspect raised questions about their commitment to justice.","translation":"警察が容疑者を追跡しなかったことは、彼らの正義へのコミットメントに対する疑問を投げかけた。"}],"collocations":["policy of nonpursuit","decision of nonpursuit","strategy of nonpursuit"],"synonyms":["inaction","non-prosecution","abandonment","cessation","forbearance"],"antonyms":["pursuit","prosecution","endeavor","quest"]}],"etymology":{"value":"\"non-\" (否定) + \"pursuit\" (追求)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnpərˈsuːt/","syllables":"non-pur-suit"},"inflection":{"noun_plural":"nonpursuits"},"usage_notes":{"explanation":"\"Nonpursuit\" is generally used in formal contexts, such as legal, business, or strategic discussions. It implies a deliberate decision not to follow a particular course of action, often because it is deemed impractical, costly, or strategically disadvantageous. It is often used to describe a conscious choice to refrain from pursuing a legal case, a business deal, or a strategic objective.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonpursuit was very happy.","correct":"✓ The nonpursuit was a strategic decision.","note":"\"Nonpursuit\" describes an action or decision, not a feeling or emotion. Therefore, it cannot be described as 'happy'."},{"incorrect":"✗ He nonpursuited the suspect.","correct":"✓ He engaged in nonpursuit of the suspect.","note":"\"Nonpursuit\" is a noun, not a verb. To describe the act of not pursuing, use a phrase like 'engaged in nonpursuit' or 'chose nonpursuit'."}],"priority":"★★☆"},"related_words":{"derivatives":["pursue","pursuer","pursuable"],"phrasal_verbs":[],"related_concepts":["strategic inaction","opportunity cost","risk assessment","cost-benefit analysis"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonpursuit\" is a formal term that means the act of not pursuing something. It is often used in legal or business contexts to describe a decision not to pursue a case, opportunity, or objective. Because it is a more complex and less common word, it is generally appropriate for advanced English speakers or writers who need to discuss strategic decisions or legal matters in detail."},"example_sentences":[{"sentence":"The company's nonpursuit of the lawsuit saved them considerable legal fees.","translation":"その会社が訴訟を追求しなかったことで、かなりの弁護士費用を節約できた。","type":"example","meaning_category":"legal/business"},{"sentence":"His nonpursuit of further education was a personal choice.","translation":"彼がそれ以上の教育を追求しなかったのは個人的な選択だった。","type":"example","meaning_category":"personal"},{"sentence":"The government's nonpursuit of certain tax evaders has been criticized.","translation":"政府が特定の脱税者を追及しないことは批判されている。","type":"example","meaning_category":"governmental"}]}