{"word":"valedictorian","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"卒業生総代、卒業生代表","english_definition":"the student, usually with the highest grades, who delivers the farewell speech at a graduation ceremony.","examples":[{"sentence":"She was chosen as the valedictorian of her graduating class.","translation":"彼女は卒業クラスの卒業生総代に選ばれた。"},{"sentence":"The valedictorian's speech was both inspiring and humorous.","translation":"卒業生総代の演説は、感動的でありユーモラスでもあった。"},{"sentence":"Being named valedictorian is a great honor.","translation":"卒業生総代に指名されることは、大変な名誉である。"}],"collocations":["valedictorian speech (卒業生総代の演説)","named valedictorian (卒業生総代に指名される)","become valedictorian (卒業生総代になる)","former valedictorian (以前の卒業生総代)"],"synonyms":["top student","highest-ranking graduate","class speaker"],"antonyms":["salutatorian (次席卒業生)"],"related_terms":["graduation","commencement","honor graduate","dean's list","GPA (grade point average)"]}],"etymology":{"value":"From Latin *valedicere* ('to say farewell'), from *valē* ('farewell') + *dicere* ('to say').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌvælɪdɪkˈtɔːriən/","syllables":"va-le-dic-to-ri-an"},"inflection":{"noun_plural":"valedictorians"},"usage_notes":{"explanation":"The *valedictorian* is typically the student with the highest academic standing in their graduating class. They are selected to give a speech at the graduation ceremony, reflecting on their experiences and offering words of wisdom or encouragement to their fellow graduates. The term is most commonly used in the United States and Canada.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was the valedictorian for the class.","correct":"✓ He was the valedictorian of the class.","note":"Use 'of' to indicate the class or graduating year the valedictorian represents."},{"incorrect":"✗ She valedictorianed the graduation.","correct":"✓ She was the valedictorian at the graduation. / ✓ She gave the valedictory speech at the graduation.","note":"'Valedictorian' is a noun, not a verb. To describe the act of giving the speech, use 'gave the valedictory speech'."}],"priority":"★★☆"},"related_words":{"derivatives":["valediction (別れの言葉、告辞)","valedictory (別れの、告別の)"],"phrasal_verbs":[],"related_concepts":["academic achievement","graduation honors","public speaking","leadership"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but well-known within academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'valedictorian' refers to the student who achieves the highest academic rank in their graduating class and is given the honor of delivering a farewell speech at the graduation ceremony. This term is primarily used in the context of education, particularly in the United States and Canada. Understanding the term requires a familiarity with the structure and traditions of higher education.","priority":"★★☆"},"example_sentences":[{"sentence":"As valedictorian, she delivered a powerful message about the importance of education.","translation":"卒業生総代として、彼女は教育の重要性について力強いメッセージを送った。","type":"noun","meaning_category":"卒業生総代"},{"sentence":"The university president congratulated the valedictorian on her outstanding academic performance.","translation":"大学の学長は、卒業生総代の傑出した学業成績を祝福した。","type":"noun","meaning_category":"卒業生総代"},{"sentence":"Many former valedictorians have gone on to achieve great success in their respective fields.","translation":"多くの元卒業生総代が、それぞれの分野で大きな成功を収めている。","type":"noun","meaning_category":"卒業生総代"}]}