{"word":"alchemists","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"錬金術師（複数形）","english_definition":"plural of alchemist: practitioners of alchemy, an early form of chemistry and philosophy that sought to transform base metals into gold, discover a universal elixir, and achieve immortality.","examples":[{"sentence":"The alchemists of the Middle Ages were searching for the philosopher's stone.","translation":"中世の錬金術師たちは賢者の石を探していた。"},{"sentence":"Some alchemists were also interested in medicine and the prolongation of life.","translation":"錬金術師の中には、医学や生命の延長に関心を持つ者もいた。"}],"collocations":["medieval alchemists (中世の錬金術師)","famous alchemists (有名な錬金術師)","secret alchemists (秘密の錬金術師)","the work of alchemists (錬金術師の仕事)","ancient alchemists (古代の錬金術師)"],"synonyms":["chemists (historical context)","experimental philosophers","hermeticists"],"antonyms":[]}],"etymology":{"value":"Derived from 'alchemist', which comes from Middle English alkemist, from Old French alquemiste, from Medieval Latin alchimista, from Arabic al-kīmiyā (الْكِيمِيَاء), from Ancient Greek khēmeía (χημεία), meaning 'art of transmuting metals'. The 'al-' is the Arabic definite article.","priority":"★★★"},"pronunciation":{"ipa":"/ˈælkəmɪsts/","syllables":"al-che-mists"},"inflection":{"noun_plural":"alchemists"},"usage_notes":{"explanation":"'Alchemists' refers specifically to multiple individuals who practiced alchemy. Alchemy was a blend of philosophy, mysticism, and early science, aiming to transmute base metals into gold, find a universal cure for diseases, and achieve immortality. While often viewed as pseudoscience today, alchemy contributed to the development of modern chemistry and scientific methodology. The term is usually used in historical contexts, referring to practitioners from ancient times through the 17th century.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an alchemists.","correct":"✓ He is an alchemist.","note":"'Alchemists' is the plural form. Use 'alchemist' for a single person."},{"incorrect":"✗ Alchemy are practiced by alchemists.","correct":"✓ Alchemy is practiced by alchemists.","note":"'Alchemy' is a singular noun, so it takes a singular verb."}],"priority":"★★☆"},"related_words":{"derivatives":["alchemy (錬金術)","alchemical (錬金術の)","alchemically (錬金術的に)"],"phrases":["the philosopher's stone (賢者の石)","elixir of life (エリクサー、生命の霊薬)","transmutation (変換、転換)"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but commonly encountered in literature and historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Alchemists' refers to people who practiced alchemy, an ancient practice that combined elements of chemistry, philosophy, and mysticism. They tried to turn ordinary metals into gold, find a way to live forever, and create a cure for all diseases. While modern science doesn't recognize alchemy as a valid science, it was important in the history of science and influenced the development of chemistry. You'll often see the word 'alchemists' in books or movies about history or fantasy."},"example_sentences":[{"sentence":"Many **alchemists** believed in the existence of the philosopher's stone.","translation":"多くの錬金術師は賢者の石の存在を信じていた。","type":"noun","meaning_category":"practitioners of alchemy"},{"sentence":"Some **alchemists** were supported by wealthy patrons who hoped to benefit from their discoveries.","translation":"一部の錬金術師は、彼らの発見から利益を得ることを期待する裕福な後援者に支援されていた。","type":"noun","meaning_category":"practitioners of alchemy"},{"sentence":"The writings of ancient **alchemists** are filled with symbolism and allegory.","translation":"古代の錬金術師の著作は、象徴主義と寓意に満ちている。","type":"noun","meaning_category":"practitioners of alchemy"}]}