{"word":"Slavonically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"スラブ語的に、スラブ民族風に","english_definition":"In a manner characteristic of Slavic languages or Slavic peoples.","examples":[{"sentence":"She sang the folk song Slavonically, with a soulful and expressive voice.","translation":"彼女は、心のこもった表現力豊かな声で、その民謡をスラブ民族風に歌った。"},{"sentence":"The dance was performed Slavonically, featuring energetic steps and traditional costumes.","translation":"そのダンスは、エネルギッシュなステップと伝統的な衣装を特徴とする、スラブ民族風に披露された。"}],"collocations":["sing Slavonically","dance Slavonically","speak Slavonically"],"synonyms":["Slavically"],"antonyms":[]}],"etymology":{"value":"Formed from 'Slavonic' (relating to Slavic languages or peoples) with the adverbial suffix '-ally'.","priority":"★★★"},"pronunciation":{"ipa":"/sləˈvɒnɪkli/","syllables":"Sla-von-i-cal-ly"},"inflection":{},"usage_notes":{"explanation":"'Slavonically' is used to describe something done in a way that is typical or characteristic of Slavic languages, cultures, or peoples. It often implies a style, manner, or method that is associated with Slavic traditions. It is relatively uncommon.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Slavonic (adjective, noun)","Slavic (adjective, noun)"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Slavonically' is a relatively rare adverb used to describe something done in a manner characteristic of Slavic languages or cultures. Its usage requires familiarity with the term 'Slavonic' and an understanding of cultural nuances. It is more likely to be encountered in specialized contexts related to linguistics, anthropology, or cultural studies."},"example_sentences":[{"sentence":"The music was arranged Slavonically, incorporating traditional instruments and harmonies.","translation":"その音楽は、伝統的な楽器とハーモニーを取り入れて、スラブ民族風に編曲された。","type":"adverb","meaning_category":"スラブ民族風に"},{"sentence":"He described the customs of the region Slavonically, emphasizing the unique cultural heritage.","translation":"彼はその地域の習慣を、独特の文化遺産を強調して、スラブ民族風に説明した。","type":"adverb","meaning_category":"スラブ民族風に"}]}