{"word":"hoggishly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"貪欲に、がっつくように、自分勝手に","english_definition":"in a greedy, selfish, or piggish manner.","examples":[{"sentence":"He ate the entire cake hoggishly, without offering any to his friends.","translation":"彼は友達に分け与えることもなく、ケーキを全部がつがつと貪欲に食べた。"},{"sentence":"The company hoggishly acquired smaller businesses to eliminate competition.","translation":"その会社は競争を排除するために、小さな会社を貪欲に買収した。"},{"sentence":"She hoggishly hoarded all the office supplies for herself.","translation":"彼女はオフィス用品をすべて自分のために独り占めにした。"}],"collocations":["eat hoggishly","acquire hoggishly","hoard hoggishly","behave hoggishly"],"synonyms":["greedily","selfishly","voraciously","rapaciously","gluttonously","pigishly"],"antonyms":["generously","selflessly","altruistically"]}],"etymology":{"value":"\"Hoggishly\" is derived from the word \"hoggish,\" which means resembling a hog (pig) in behavior or characteristics, especially in being greedy or selfish. The suffix \"-ly\" is added to transform it into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɒɡɪʃli/","syllables":"hog-gish-ly"},"inflection":{"notes":"This word is an adverb, so it does not have different forms for gender or number."},"usage_notes":{"explanation":"\"Hoggishly\" describes an action performed in a greedy or selfish manner, often implying a lack of consideration for others. It is typically used to describe someone's behavior related to food, resources, or power. The word carries a negative connotation, suggesting disapproval of the action being described.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He hoggishly is eating.","correct":"✓ He is eating hoggishly.","note":"As an adverb, \"hoggishly\" typically modifies a verb and should be placed after the verb or after the object of the verb."},{"incorrect":"✗ The hoggishly behavior was unacceptable.","correct":"✓ The hoggish behavior was unacceptable.","note":"\"Hoggishly\" is an adverb and cannot be used to describe a noun. Use the adjective \"hoggish\" instead."}],"priority":"★★☆"},"related_words":{"derivatives":["hoggish (adjective: greedy, selfish)","hog (noun: a pig; a greedy person)"],"phrases":["to act hoggishly","to behave hoggishly"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"hoggishly\" is an adverb that describes acting in a greedy or selfish way, like a pig. It's not a common word, so it's used in more advanced or descriptive writing to strongly convey someone's selfish behavior. Think of someone eating all the food without sharing – that's behaving hoggishly."},"example_sentences":[{"sentence":"The children rushed to the table and ate the cookies hoggishly.","translation":"子供たちはテーブルに駆け寄り、クッキーをがつがつと貪欲に食べた。","type":"example","meaning_category":"greedily eating"},{"sentence":"He hoggishly kept all the best toys for himself, not letting anyone else play with them.","translation":"彼は一番良いおもちゃをすべて自分のものにして、誰にも遊ばせなかった。","type":"example","meaning_category":"selfishly keeping"},{"sentence":"The politician hoggishly seized power, ignoring the needs of the people.","translation":"その政治家は人々のニーズを無視して、貪欲に権力を掌握した。","type":"example","meaning_category":"selfishly seizing power"}]}