{"word":"Vandalization","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"破壊行為、公共物毀損","english_definition":"The action involving deliberate destruction or damage to public or private property.","examples":[{"sentence":"The vandalization of the statue caused public outrage.","translation":"その彫像の破壊行為は、世間の怒りを引き起こした。"},{"sentence":"The city council is trying to reduce vandalization in parks.","translation":"市議会は公園での破壊行為を減らそうとしている。"},{"sentence":"Graffiti is often considered a form of vandalization.","translation":"落書きはしばしば破壊行為の一種とみなされる。"}],"collocations":["act of vandalization","prevent vandalization","reduce vandalization","report vandalization","vandalization of property","public vandalization"],"synonyms":["vandalism","destruction","damage","defacement","sabotage"],"antonyms":["preservation","conservation","maintenance","repair"]}],"etymology":{"value":"The word 'vandalization' is derived from 'vandal,' referring to the East Germanic tribe known for their sack of Rome in 455 AD. The suffix '-ization' turns it into a noun denoting the act or process of vandalizing.","priority":"★★★"},"pronunciation":{"ipa":"ˌvændəlaɪˈzeɪʃən","syllables":"van-dal-i-za-tion"},"inflection":{"noun_plural":"vandalizations"},"usage_notes":{"explanation":"'Vandalization' refers specifically to acts of deliberate destruction or damage to property, often public property. It is a more formal term than 'vandalism.' While 'vandalism' can refer to a general tendency towards destructive behavior, 'vandalization' typically refers to a specific instance or series of instances of such behavior.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The vandalization was happen last night.","correct":"✓ The vandalization happened last night.","note":"'Vandalization' is a noun, so it cannot be used as a verb. Use a verb like 'happened' to describe the event. Alternatively, use 'vandalize' as a verb: 'Someone vandalized the building last night.'"},{"incorrect":"✗ The vandalization is increasing. We must stop them.","correct":"✓ Vandalism is increasing. We must stop them.","note":"'Vandalism' is the more general term for the phenomenon, while 'vandalization' is more specific to individual acts. In this context, 'vandalism' is more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["vandal (noun): A person who deliberately destroys or damages property.","vandalize (verb): To deliberately destroy or damage property.","vandalistic (adjective): Characterized by or involving vandalism."],"synonyms":["destruction","damage","defacement","sabotage","malice","mischief","wrecking"],"antonyms":["construction","creation","restoration","repair","building","fixing"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Vandalization' is a formal noun referring to the act of deliberately damaging or destroying property. It's often used in legal or official contexts when discussing specific instances of vandalism. The word implies intentional and malicious damage. It is less common than 'vandalism,' which is a more general term for such behavior. Understanding the context is important to differentiate it from similar terms like 'damage' or 'destruction,' which may not always imply intentional maliciousness."},"example_sentences":[{"sentence":"The recent vandalization of the park benches has angered local residents.","translation":"最近の公園のベンチの破壊行為は、地元の住民を怒らせている。","type":"noun","meaning_category":"破壊行為"},{"sentence":"Police are investigating the vandalization of several businesses downtown.","translation":"警察は、ダウンタウンのいくつかの企業の破壊行為を捜査している。","type":"noun","meaning_category":"公共物毀損"},{"sentence":"The cost of repairing the vandalization to the school was significant.","translation":"学校への破壊行為の修理費用はかなりの額になった。","type":"noun","meaning_category":"損害"}]}