{"word":"Spathiflorae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物学) スパティフロラエ (旧分類における単子葉植物の一群。現在はAPG体系では使用されない)","english_definition":"(botany, obsolete) Spathiflorae (an obsolete group of monocotyledonous plants; not used in the APG system).","examples":[{"sentence":"The Spathiflorae were characterized by having a spathe and spadix.","translation":"スパティフロラエは、仏炎苞と肉穂花序を持つことを特徴としていた。"}],"collocations":[],"synonyms":["Arales (アレース目, より現代的な分類)"],"antonyms":[]}],"etymology":{"value":"New Latin, from *spatha* (spathe) + *florae* (plural of *flora*, flora).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌspæθɪˈflɔːriː/","syllables":"Spa-thi-flo-rae"},"inflection":{"notes":"Plural noun"},"usage_notes":{"explanation":"*Spathiflorae* is an outdated botanical name for a group of monocotyledonous plants, characterized by having a spathe (a large bract enclosing a flower cluster) and a spadix (a fleshy spike bearing many small flowers). This classification is no longer used in modern plant taxonomy, such as the APG system, which relies on genetic and molecular data. The plants formerly classified as Spathiflorae are now generally placed in the order Arales or other related orders. The term may still be encountered in older botanical texts.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["spathe","spadix"],"related_terms":["Arales","Araceae (サトイモ科)","Monocotyledons (単子葉植物)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily found in botanical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term *Spathiflorae* is a technical term used in botany, specifically in older classification systems. It refers to a group of monocotyledonous plants characterized by a spathe and spadix. Understanding this term requires familiarity with botanical terminology and the history of plant classification. It is not commonly used in general language.","priority":"★★☆"},"example_sentences":[{"sentence":"In the Engler system, plants like Araceae were classified under Spathiflorae.","translation":"エングラー体系では、サトイモ科のような植物はスパティフロラエに分類されていた。","type":"example","meaning_category":"botanical classification"}]}