{"word":"Champac","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"キンコウボク（金香木）: モクレン科オガタマノキ属の常緑高木。香りの良い花を咲かせる。","english_definition":"A tropical Asian tree (Magnolia champaca, syn. Michelia champaca) of the magnolia family, with fragrant yellow or orange flowers.","examples":[{"sentence":"The air was filled with the sweet fragrance of Champac flowers.","translation":"空気はキンコウボクの花の甘い香りで満たされていた。"},{"sentence":"Champac essential oil is used in perfumery.","translation":"キンコウボクのエッセンシャルオイルは香水に使われる。"}],"collocations":["Champac essential oil","Champac flower","Champac tree"],"synonyms":["Magnolia champaca","Michelia champaca"],"antonyms":[]}],"etymology":{"value":"The name 'Champac' is derived from the Sanskrit word 'campaka'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtʃæmpæk/","syllables":"Cham-pac"},"inflection":{"notes":"単数形: Champac, 複数形: Champacs"},"usage_notes":{"explanation":"'Champac' refers to a specific species of magnolia tree known for its highly fragrant flowers. It is often used in perfumes and traditional medicine.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I planted a champak in my garden, it's a kind of rose.","correct":"✓ I planted a Champac in my garden, it's a type of magnolia.","note":"Champac is a type of magnolia, not a rose."}],"priority":"★★☆"},"related_words":{"derivatives":["Champaca (alternative spelling)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Champac' is a specialized term referring to a specific type of magnolia tree, primarily known for its fragrant flowers. Understanding this word requires some botanical knowledge or familiarity with tropical Asian flora."},"example_sentences":[{"sentence":"The temple gardens were filled with the intoxicating scent of blooming Champac trees.","translation":"寺院の庭園は、咲き誇るキンコウボクの木の酔わせるような香りで満たされていた。","type":"noun","meaning_category":"tree"},{"sentence":"In India, Champac flowers are often used in religious ceremonies and offerings.","translation":"インドでは、キンコウボクの花は宗教的な儀式や供え物によく使われる。","type":"noun","meaning_category":"flower"}]}