{"word":"cross-index","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"相互参照する、相互索引をつける","english_definition":"To index (items in a collection of data) under more than one heading, in order to facilitate retrieval.","examples":[{"sentence":"The librarian cross-indexed the books by author, title, and subject.","translation":"図書館員は、著者、タイトル、および主題によって本を相互参照した。"},{"sentence":"We need to cross-index these documents so that they can be easily found using different keywords.","translation":"これらのドキュメントを相互参照して、さまざまなキーワードを使用して簡単に見つけられるようにする必要があります。"}],"collocations":["cross-index data","cross-index documents","cross-index information"],"synonyms":["index","catalog","classify","categorize"],"antonyms":["unindex"]},{"part_of_speech":"noun","definition":"相互索引、相互参照","english_definition":"An index that allows the user to find items by looking under more than one heading.","examples":[{"sentence":"The cross-index in this database makes it easy to find related information.","translation":"このデータベースの相互索引を使用すると、関連情報を簡単に見つけることができます。"},{"sentence":"A well-designed cross-index is essential for efficient information retrieval.","translation":"適切に設計された相互索引は、効率的な情報検索に不可欠です。"}],"collocations":["database cross-index","comprehensive cross-index","efficient cross-index"],"synonyms":["index","reference","catalog","listing"],"antonyms":[]}],"etymology":{"value":"'Cross-' (indicating intersection or connection) + 'index' (a list of items with references). The term combines the idea of indexing with the concept of multiple connections or references.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkrɔsˌɪn.dɛks/","syllables":"cross-in-dex"},"inflection":{"verb_forms":{"present_simple":["cross-index","cross-indexes"],"past_simple":"cross-indexed","past_participle":"cross-indexed","present_participle":"cross-indexing"},"noun_plural":"cross-indexes"},"usage_notes":{"explanation":"'Cross-index' is used in the context of information management and retrieval. As a verb, it describes the process of creating multiple indexes for the same data, allowing users to find the data through different search terms. As a noun, it refers to the index itself, which provides these multiple access points.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The data was cross index.","correct":"✓ The data was cross-indexed.","note":"When used as a verb in the past tense or as a past participle, 'cross-index' should be 'cross-indexed'."},{"incorrect":"✗ The cross-indexes are very important for data retrieval.","correct":"✓ The cross-index is very important for data retrieval.","note":"When referring to the system or method, 'cross-index' is often used as a singular noun, even if it involves multiple indexes."}],"priority":"★★☆"},"related_words":{"derivatives":["cross-referencing"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'cross-index' is technical and specific to information management. It means to create an index with multiple entry points so that information can be found in various ways. Understanding this term requires familiarity with indexing concepts and database management."},"example_sentences":[{"sentence":"The software automatically cross-indexes new entries in the database.","translation":"ソフトウェアは、データベース内の新しいエントリを自動的に相互参照します。","type":"verb","meaning_category":"相互参照する"},{"sentence":"A comprehensive cross-index is crucial for navigating the complex archive.","translation":"包括的な相互索引は、複雑なアーカイブをナビゲートするために重要です。","type":"noun","meaning_category":"相互索引"},{"sentence":"The researcher cross-indexed the survey responses by age, gender, and income.","translation":"研究者は、年齢、性別、および収入によって調査回答を相互参照しました。","type":"verb","meaning_category":"相互参照する"},{"sentence":"The cross-index allowed users to quickly find relevant articles.","translation":"相互索引により、ユーザーは関連する記事をすばやく見つけることができました。","type":"noun","meaning_category":"相互索引"}]}