{"word":"curdable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"凝固させることができる、カード化できる","english_definition":"Capable of being curdled; able to be transformed into curds.","examples":[{"sentence":"This milk is easily curdable, making it ideal for cheese production.","translation":"この牛乳は凝固しやすく、チーズの製造に最適です。"},{"sentence":"The protein content of the solution makes it highly curdable.","translation":"その溶液のタンパク質含有量は、それを非常に凝固しやすくしています。"}],"collocations":["easily curdable","highly curdable","curdable milk","curdable substance"],"synonyms":["coagulable","clottable"],"antonyms":["uncoagulable","non-curdable"]}],"etymology":{"value":"The word 'curdable' is derived from 'curd' (the solid part of milk that separates when it coagulates) and the suffix '-able' (indicating capability or suitability).","priority":"★★★"},"pronunciation":{"ipa":"/ˈkɜːrdəbəl/","syllables":"curd-a-ble"},"inflection":{"notes":"Adjectives in English do not inflect in the same way as verbs or nouns. They typically have comparative (more curdable) and superlative (most curdable) forms, though these are often formed using 'more' and 'most' rather than inflectional suffixes."},"usage_notes":{"explanation":"'Curdable' is a descriptive adjective primarily used in the context of dairy products, particularly milk. It describes the property of a liquid, most commonly milk, to be able to form curds when subjected to certain processes such as the addition of acid or rennet. It is a technical term used in food science, cheesemaking, and related fields.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The curdable is on the table.","correct":"The curdable milk is on the table.","note":"'Curdable' is an adjective and needs to modify a noun. It cannot stand alone as a noun."},{"incorrect":"This cheese is curdable.","correct":"This milk is curdable.","note":"'Curdable' describes the *potential* of a liquid to form curds, not the state of a solid cheese."}],"priority":"★★☆"},"related_words":{"derivatives":["curd (noun): The solid part of milk that separates when it coagulates.","curdling (noun): The process of milk turning into curds.","curdle (verb): To turn into curds; to coagulate."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Technical term, not typically found in general language learning)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Curdable' is a specialized term primarily used in the context of food science and cheesemaking. It describes the ability of a liquid, usually milk, to be transformed into curds. This transformation typically occurs through the addition of an acid or enzyme (like rennet) that causes the proteins in the milk to coagulate. Because of its technical nature, it is not a word commonly encountered in everyday language but is important for those studying or working in related fields."},"example_sentences":[{"sentence":"The farmer tested the milk to ensure it was sufficiently curdable for the cheesemaking process.","translation":"農家は、チーズ製造プロセスに十分な凝固性があることを確認するために、牛乳をテストしました。","type":"adjective","meaning_category":"capable of being curdled"},{"sentence":"Only fresh, high-quality milk is truly curdable and produces the best cheese.","translation":"新鮮で高品質の牛乳のみが真に凝固可能であり、最高のチーズを生産します。","type":"adjective","meaning_category":"capable of being curdled"}]}