{"word":"Eccl","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(聖書)伝道者の書 (Ecclesiastes) の略称","english_definition":"Abbreviation for the Book of Ecclesiastes in the Bible.","examples":[{"sentence":"Eccl. 1:1 refers to the words of the Preacher, the son of David, king in Jerusalem.","translation":"伝道の書1章1節は、エルサレムで王であったダビデの子、伝道者の言葉に言及している。"}],"collocations":["Eccl. 1:1 (伝道の書1章1節)","Book of Eccl (伝道の書)"],"synonyms":["Ecclesiastes"],"antonyms":[]}],"etymology":{"value":"'Eccl' is a shortened form of 'Ecclesiastes', which comes from the Greek word 'ekklesiastes' meaning 'a member of an assembly' or 'a preacher'.","priority":"★★☆"},"pronunciation":{"ipa":"/iːˈkliːziˌæstiːz/ (for Ecclesiastes)","syllables":"Ec-cle-si-as-tes (for Ecclesiastes)"},"inflection":{"notes":"It is an abbreviation of a proper noun, so it does not have plural forms or inflections."},"usage_notes":{"explanation":"'Eccl' is almost exclusively used as an abbreviation in biblical references. It's a shorthand way to refer to the Book of Ecclesiastes, especially in footnotes, citations, or study guides. It is not commonly used in spoken language or general writing.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I read an interesting article about Eccl.","correct":"✓ I read an interesting article about Ecclesiastes.","note":"Use the full name 'Ecclesiastes' in general writing unless you are specifically citing a verse or using it in a context where abbreviations are standard."}],"priority":"★★☆"},"related_words":{"derivatives":["Ecclesiastes (noun: 伝道者の書)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Specific to religious or academic contexts)","frequency_google_ngram":"Low frequency (低頻度) - primarily in religious or academic texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Eccl' is an abbreviation primarily encountered in religious or academic contexts, specifically when referencing the Book of Ecclesiastes in the Bible. Understanding its meaning requires familiarity with biblical literature. In general writing, it's preferable to use the full name 'Ecclesiastes' for clarity unless the context explicitly calls for abbreviations."},"example_sentences":[{"sentence":"The verse is found in Eccl. 3:1.","translation":"その聖句は伝道の書3章1節にある。","type":"noun","meaning_category":"Abbreviation for Ecclesiastes"},{"sentence":"He quoted from Eccl. to support his argument.","translation":"彼は自分の主張を裏付けるために伝道の書から引用した。","type":"noun","meaning_category":"Abbreviation for Ecclesiastes"}]}