{"word":"Patao","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Philippines) A fermented mung bean paste, used as a condiment.","english_definition":"A fermented mung bean paste, used as a condiment in Filipino cuisine.","examples":[{"sentence":"Patao is often used as a dipping sauce for fried foods.","translation":"パタオは揚げ物のつけダレとしてよく使われます。"},{"sentence":"The dish was flavored with a hint of patao.","translation":"その料理はパタオの風味が少し加えられていた。"}],"collocations":["with rice","as a condiment","fermented patao"],"synonyms":["mung bean paste","fermented bean paste"],"antonyms":[]}],"etymology":{"value":"Likely derived from a local Philippine language, possibly related to the fermentation process or the appearance of the paste. Further research is needed for a definitive etymology.","priority":"★★☆"},"pronunciation":{"ipa":"/pɐˈtaʊ/","syllables":"Pa-tao"},"inflection":{"noun_plural":"Pataos"},"usage_notes":{"explanation":"Patao is a regional specialty, primarily found in the Philippines. It's a fermented paste made from mung beans, and its flavor is savory and slightly tangy. It is not widely known outside of the Philippines.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used miso instead of patao.","correct":"✓ I used miso instead of patao. (This is acceptable if patao is unavailable, but miso has a different flavor profile.)","note":"Miso can be a substitute, but it's not a direct equivalent in flavor."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Patao is a specialized culinary term primarily used within the context of Filipino cuisine. Understanding and using this term requires familiarity with the specific dishes and ingredients of that region. Therefore, its readability and comprehension are geared towards individuals with a pre-existing knowledge base in this area."},"example_sentences":[{"sentence":"The authentic Filipino dish included homemade Patao.","translation":"その本格的なフィリピン料理には自家製のパタオが使われていた。","type":"noun","meaning_category":"condiment"},{"sentence":"She learned how to make Patao from her grandmother's recipe.","translation":"彼女は祖母のレシピからパタオの作り方を学んだ。","type":"noun","meaning_category":"condiment"}]}