{"word":"Rheumatology","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"リウマチ学：関節、筋肉、骨、および自己免疫疾患に影響を与える医学の分野","english_definition":"The branch of medicine dealing with the diagnosis and treatment of rheumatic diseases, which affect the joints, muscles, bones, and immune system.","examples":[{"sentence":"She is a specialist in rheumatology.","translation":"彼女はリウマチ学の専門家です。"},{"sentence":"Rheumatology involves the study of autoimmune disorders.","translation":"リウマチ学は自己免疫疾患の研究を含みます。"}],"collocations":["rheumatology clinic","rheumatology department","pediatric rheumatology"],"synonyms":["arthritis specialist","rheumatic medicine"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'rheuma' (meaning 'flowing' or 'flux') and '-logy' (meaning 'the study of'). The term 'rheuma' was historically used to describe the flowing of humors believed to cause rheumatic diseases.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌruːməˈtɒlədʒi/","syllables":"ru-ma-tol-o-gy"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Rheumatology is a specialized field of medicine focused on diagnosing and treating a wide range of conditions, including arthritis, autoimmune diseases, and musculoskeletal disorders. Rheumatologists are trained to manage these complex conditions, often using medications, physical therapy, and lifestyle modifications.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a rheumatology in my knee.","correct":"✓ I have a rheumatological condition in my knee.","note":"Rheumatology is the field of study, not the condition itself. Use 'rheumatological condition' or specify the condition (e.g., arthritis)."},{"incorrect":"✗ Rheumatology is a surgery.","correct":"✓ Rheumatology is a field of medicine.","note":"Rheumatology primarily involves medical management rather than surgical procedures, although rheumatologists may refer patients for surgery when necessary."}],"priority":"★★☆"},"related_words":{"derivatives":["rheumatologist (noun: リウマチ医)","rheumatic (adjective: リウマチ性の)","rheumatism (noun: リウマチ)","rheumatoid (adjective: リウマチ様の)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Rheumatology' is a specialized medical term referring to the study and treatment of rheumatic diseases. These diseases affect the joints, muscles, bones, and immune system. If you encounter this word, it's likely in the context of medical discussions or articles related to conditions like arthritis, lupus, or other autoimmune disorders. Understanding this term is essential for comprehending medical information related to these conditions."},"example_sentences":[{"sentence":"The patient was referred to the rheumatology clinic for further evaluation.","translation":"患者はさらなる評価のためにリウマチ科外来に紹介されました。","type":"noun","meaning_category":"リウマチ学"},{"sentence":"Advances in rheumatology have significantly improved the management of rheumatoid arthritis.","translation":"リウマチ学の進歩は、関節リウマチの管理を大幅に改善しました。","type":"noun","meaning_category":"リウマチ学"},{"sentence":"She is doing research in the field of pediatric rheumatology.","translation":"彼女は小児リウマチ学の分野で研究をしています。","type":"noun","meaning_category":"リウマチ学"}]}