{"word":"meatorrhaphy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"尿道口縫合術：尿道口の狭窄を外科的に修復する手術。","english_definition":"Surgical repair of a constricted urethral meatus.","examples":[{"sentence":"Meatorrhaphy is performed to widen the urethral opening.","translation":"尿道口縫合術は、尿道口を広げるために行われます。"},{"sentence":"The patient underwent meatorrhaphy to correct the meatal stenosis.","translation":"患者は尿道口狭窄を矯正するために尿道口縫合術を受けた。"}],"collocations":["urethral meatorrhaphy","perform meatorrhaphy","post-meatorrhaphy care"],"synonyms":["meatotomy","urethral dilation"],"antonyms":[]}],"etymology":{"value":"The term 'meatorrhaphy' is derived from the Greek words 'meatus' (an opening or passage) and 'rhaphy' (surgical suturing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmiːətɔˈræfi/","syllables":"me-a-tor-rha-phy"},"inflection":{"noun_plural":"meatorrhaphies"},"usage_notes":{"explanation":"Meatorrhaphy is a surgical procedure primarily used in cases of meatal stenosis, a condition where the opening of the urethra is abnormally narrow. This procedure aims to alleviate urinary flow obstruction and prevent complications such as urinary tract infections. It is more invasive than meatotomy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor performed a meatotomy instead of meatorrhaphy for the complex stenosis.","correct":"✓ The doctor performed a meatorrhaphy instead of meatotomy for the complex stenosis.","note":"Meatorrhaphy is used for more complex cases than meatotomy."}],"priority":"★★☆"},"related_words":{"derivatives":["meatus","urethra","stenosis","meatotomy"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Meatorrhaphy' is a highly specialized medical term referring to a surgical procedure. Understanding this term requires a background in medical terminology and urology. The word's complexity and specific context make it suitable for advanced learners or professionals in the medical field."},"example_sentences":[{"sentence":"Following the meatorrhaphy, the patient reported improved urinary flow.","translation":"尿道口縫合術後、患者は尿の流れが改善したと報告した。","type":"medical","meaning_category":"surgical procedure"},{"sentence":"The success of the meatorrhaphy was evaluated by measuring the post-operative urinary flow rate.","translation":"尿道口縫合術の成功は、術後の尿流量を測定することによって評価された。","type":"medical","meaning_category":"surgical procedure"}]}