{"word":"Physiform","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Relating to or having a physical form or structure.","english_definition":"Having a defined physical shape or structure; pertaining to the physical form of something.","examples":[{"sentence":"The physiform properties of the material were analyzed in the lab.","translation":"その材料の物理的な特性が実験室で分析された。"},{"sentence":"The artist sought to capture the physiform essence of the landscape.","translation":"そのアーティストは、風景の物理的な本質を捉えようとした。"}],"collocations":["physiform properties","physiform structure","physiform analysis","physiform essence"],"synonyms":["physical","corporeal","tangible","material","concrete"],"antonyms":["amorphous","immaterial","spiritual","abstract"]}],"etymology":{"value":"Derived from the combination of 'physi-' (referring to physical or natural) and '-form' (referring to shape or structure).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɪzɪˌfɔrm/","syllables":"phi-si-form"},"inflection":{"notes":"The word 'physiform' primarily functions as an adjective and does not typically have plural or verb forms."},"usage_notes":{"explanation":"'Physiform' is used to describe something that has a definite physical shape or structure. It is often used in scientific or technical contexts to emphasize the physical aspects of an object or substance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The physiform of the idea was hard to grasp.","correct":"✓ The physical form of the idea was hard to grasp.","note":"'Physiform' refers to actual physical shape, not abstract concepts. Use 'physical' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["physi- (prefix relating to the body or nature)","-form (suffix relating to shape or structure)"],"related_terms":["physical","morphology","structure","anatomy"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency (relatively uncommon).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Physiform' is a relatively uncommon word, primarily used in technical or scientific contexts to describe something with a defined physical shape or structure. It emphasizes the tangible, material aspects of an object or substance. Understanding the etymology (physi- + -form) can help in grasping its meaning. It is not typically used in everyday conversation."},"example_sentences":[{"sentence":"The physiform characteristics of the crystal were examined using X-ray diffraction.","translation":"その結晶の物理的な特性は、X線回折を用いて調べられた。","type":"adjective","meaning_category":"physical structure"},{"sentence":"The sculptor aimed to create a physiform representation of the human body.","translation":"その彫刻家は、人体の物理的な表現を創造することを目指した。","type":"adjective","meaning_category":"physical form"}]}