{"word":"olamic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Relating to or characteristic of the Olam, a concept in Jewish mysticism referring to the spiritual realms or worlds.","english_definition":"Relating to or characteristic of the Olam, a concept in Jewish mysticism referring to the spiritual realms or worlds.","examples":[{"sentence":"The olamic structure is complex and multi-layered, according to Kabbalistic teachings.","translation":"カバラの教えによれば、オラミック構造は複雑で多層的です。"}],"collocations":[],"synonyms":["spiritual","mystical","transcendental"],"antonyms":["material","physical"]}],"etymology":{"value":"Derived from the Hebrew word 'Olam' (עולם), meaning 'world,' 'universe,' or 'eternity.' In Kabbalah, it refers to the various spiritual realms or worlds.","priority":"★★★"},"pronunciation":{"ipa":"/oʊˈlæmɪk/","syllables":"o-lam-ic"},"inflection":{},"usage_notes":{"explanation":"The term 'olamic' is primarily used within the context of Jewish mysticism, particularly Kabbalah, to describe concepts, structures, or attributes related to the spiritual worlds or realms beyond the physical world. It is not a commonly used word in everyday English.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Olam (noun): The world, universe, or eternity in Hebrew; in Kabbalah, the spiritual realms.","Olamic (adjective): Relating to the Olam."]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The word 'olamic' is highly specialized and primarily used in the context of Jewish mysticism, specifically Kabbalah. Understanding requires familiarity with Kabbalistic concepts and terminology. Due to its limited usage and specific context, it is not generally encountered in standard English texts or conversations."},"example_sentences":[{"sentence":"The Kabbalists describe the olamic hierarchy as a series of emanations from the Divine.","translation":"カバリストは、オラミックな階層を神からの流出の連続として説明しています。","type":"adjective","meaning_category":"Relating to the Olam"},{"sentence":"Olamic cosmology provides a framework for understanding the relationship between the physical and spiritual worlds.","translation":"オラミック宇宙論は、物理的な世界と精神的な世界の間の関係を理解するための枠組みを提供します。","type":"adjective","meaning_category":"Relating to the Olam"}]}