{"word":"Phytosaur","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"植物竜（植物食性爬虫類に似た絶滅した主竜類）","english_definition":"An extinct group of large, mostly semiaquatic Late Triassic archosauriform reptiles resembling crocodiles and alligators.","examples":[{"sentence":"Phytosaurs were among the dominant predators of the Late Triassic period.","translation":"植物竜は三畳紀後期の支配的な捕食者の一つでした。"},{"sentence":"The long snout of a phytosaur is similar to that of a modern gharial.","translation":"植物竜の長い鼻面は、現代のガビアルのものと似ています。"}],"collocations":["phytosaur skull (植物竜の頭蓋骨)","phytosaur fossil (植物竜の化石)","Triassic phytosaur (三畳紀の植物竜)"],"synonyms":["none"],"antonyms":["none"]}],"etymology":{"value":"ギリシャ語の 'phyton' (植物) + 'sauros' (トカゲ) から。初期の化石が植物の化石と誤認されたことに由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfaɪtəˌsɔːr/","syllables":"Phy-to-saur"},"inflection":{"noun_plural":"Phytosaurs"},"usage_notes":{"explanation":"Phytosaurs were large, crocodile-like reptiles that lived during the Late Triassic period. They are not dinosaurs, but are related to crocodiles and alligators. Their nostrils were located near their eyes, unlike crocodiles, whose nostrils are at the end of their snout.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Phytosaurs are dinosaurs.","correct":"✓ Phytosaurs are archosauriform reptiles.","note":"Phytosaurs are often confused with dinosaurs, but they are a distinct group of reptiles. They are more closely related to crocodiles and alligators."}],"priority":"★☆☆"},"related_words":{"derivatives":["phytosauria (植物竜亜目)"],"phrases":["none"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Phytosaurs are an extinct group of archosauriform reptiles that superficially resembled modern crocodilians. They lived during the Late Triassic period and were characterized by their long snouts and nostrils located near their eyes. While they share some similarities with crocodiles, they are not directly related and represent a distinct evolutionary lineage. The name 'Phytosaur' is derived from a historical misidentification of their fossils with plant remains."},"example_sentences":[{"sentence":"Scientists have discovered new phytosaur fossils in North America.","translation":"科学者たちは北米で新たな植物竜の化石を発見した。","type":"general","meaning_category":"general"},{"sentence":"The phytosaur's teeth suggest it was a carnivorous predator.","translation":"その植物竜の歯は、それが肉食性の捕食者であったことを示唆している。","type":"physical characteristics","meaning_category":"characteristics"}]}