{"word":"bicentricity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"二心性、両心性","english_definition":"The state or quality of having two centers; the condition of being centered on two things.","examples":[{"sentence":"The bicentricity of the novel's plot, focusing on both the protagonist's personal life and their professional career, creates a complex narrative.","translation":"主人公の私生活と職業生活の両方に焦点を当てた小説のプロットの二心性は、複雑な物語を生み出している。"}],"collocations":["bicentricity of plot","bicentricity of focus"],"synonyms":["dual focus","double centering"],"antonyms":["unicentricity","single focus"]}],"etymology":{"value":"Derived from the prefix 'bi-' (meaning 'two') and 'centricity,' which refers to the state of being centered.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbaɪsɛnˈtrɪsɪti/","syllables":"bi-cen-tric-i-ty"},"inflection":{"noun_plural":"bicentricities"},"usage_notes":{"explanation":"'Bicentricity' is often used in literary criticism, sociology, and psychology to describe situations or concepts that revolve around two central points or ideas. It is relatively uncommon in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bicentricity of the circle was obvious.","correct":"✓ A circle does not exhibit bicentricity; it is unicentric.","note":"Bicentricity implies two centers, which is not applicable to a standard circle."}],"priority":"★★☆"},"related_words":{"derivatives":["bicentric (adjective)"],"related_terms":["eccentricity","centricity"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Bicentricity' is a specialized term primarily used in academic and theoretical contexts. Understanding requires familiarity with abstract concepts and a strong vocabulary. It is not typically encountered in general reading or conversation."},"example_sentences":[{"sentence":"The author explores the bicentricity of modern life, torn between tradition and innovation.","translation":"著者は、伝統と革新の間で引き裂かれる現代生活の二心性を探求している。","type":"general","meaning_category":"dual focus"},{"sentence":"The study examines the bicentricity in political discourse, where power is divided between two major parties.","translation":"その研究は、権力が二大政党に分かれている政治的言説における二心性を検証している。","type":"academic","meaning_category":"divided power"}]}