{"word":"untoileted","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"トイレトレーニングが済んでいない、おむつをしている","english_definition":"Not yet toilet-trained; still wearing diapers.","examples":[{"sentence":"The untoileted toddler was wearing a diaper.","translation":"トイレトレーニングが済んでいない幼児はおむつをしていた。"},{"sentence":"Many parents find toilet training an untoileted child challenging.","translation":"多くの親は、トイレトレーニングが済んでいない子供のトイレトレーニングを難しいと感じている。"}],"collocations":["untoileted child","untoileted toddler","untoileted infant"],"synonyms":["not toilet-trained","diapered","in diapers"],"antonyms":["toilet-trained","potty-trained","trained"],"notes":"This term is often used in the context of childcare, parenting, and developmental milestones."}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to the word 'toileted', which is derived from 'toilet' (referring to the process of using a toilet).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˈtɔɪlɪtɪd/","syllables":"un-toi-let-ed"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Untoileted' is a descriptive term used to indicate that a person, usually a young child, has not yet completed toilet training and is still reliant on diapers or similar absorbent products. It is a more formal or clinical way of saying 'not toilet-trained'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The untoileted dog made a mess on the carpet.","correct":"✓ The untrained dog made a mess on the carpet.","note":"'Untoileted' is typically used only for humans, especially children. For animals, use 'untrained' or 'not house-trained'."},{"incorrect":"✗ She is untoileted because she is lazy.","correct":"✓ She is untoileted because she is too young to be toilet-trained.","note":"'Untoileted' refers to a developmental stage, not a behavioral choice. Use it to describe children who are not yet developmentally ready for toilet training."}],"priority":"★★☆"},"related_words":{"derivatives":["toilet (noun)","toilet-trained (adjective)","toilet training (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'untoileted' is a relatively uncommon term used to describe someone, typically a young child, who has not yet been toilet-trained. It is formed by adding the prefix 'un-' to 'toileted,' indicating the negation of being toilet-trained. This word is more formal and less frequently used in everyday conversation, often appearing in contexts related to childcare, parenting, or developmental discussions. Understanding the prefix 'un-' and the base word 'toileted' is key to grasping its meaning."},"example_sentences":[{"sentence":"The daycare center accepts both toileted and **untoileted** children.","translation":"その保育所は、トイレトレーニングが済んだ子供も済んでいない子供も受け入れている。","type":"adjective","meaning_category":"Not toilet-trained"},{"sentence":"Changing facilities are available for **untoileted** infants.","translation":"トイレトレーニングが済んでいない乳幼児のためのおむつ交換台が利用可能です。","type":"adjective","meaning_category":"Not toilet-trained"}]}