{"word":"Pediculina","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"An order of parasitic insects that includes lice.","english_definition":"An obsolete taxonomic order that historically included parasitic lice; now generally classified within the order Phthiraptera.","examples":[{"sentence":"Pediculina were once considered a distinct order of insects.","translation":"かつて、Pediculinaは昆虫の独立した目であると考えられていました。"},{"sentence":"Modern taxonomy has reclassified the Pediculina into different suborders within Phthiraptera.","translation":"現代の分類学では、PediculinaはPhthiraptera内の異なる亜目に再分類されています。"}],"collocations":["Order Pediculina","Class Insecta, Order Pediculina","Phthiraptera (formerly Pediculina)"],"synonyms":["Phthiraptera","lice","parasitic lice"],"antonyms":[]}],"etymology":{"value":"From Latin 'pediculus' (louse) + '-ina' (suffix used to form taxonomic names).","priority":"★★☆"},"pronunciation":{"ipa":"/pɪˌdɪkjʊˈlaɪnə/","syllables":"pe-dic-u-li-na"},"inflection":{"noun_plural":"Pediculina (although rarely used in plural form)"},"usage_notes":{"explanation":"'Pediculina' is largely an obsolete term in modern taxonomy. While you may encounter it in older texts, the preferred term is now 'Phthiraptera', which encompasses all lice. Use with caution, as it may not be universally understood.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Pediculina is a single species of louse.","correct":"✓ Phthiraptera (formerly Pediculina) is an order that includes many species of lice.","note":"Pediculina (now Phthiraptera) is an order, not a single species."}],"priority":"★★☆"},"related_words":{"derivatives":["pediculicide (a substance that kills lice)","pediculosis (an infestation of lice)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (scientific term, not in common usage)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pediculina' is a technical term primarily used in historical or scientific contexts related to insect taxonomy. Understanding requires familiarity with biological classification systems and the history of entomology. It is unlikely to be encountered in general English usage. The more current and widely accepted term is 'Phthiraptera'."},"example_sentences":[{"sentence":"Older entomological texts often refer to lice as belonging to the order Pediculina.","translation":"古い昆虫学の文献では、シラミはしばしばPediculina目に属するものとして言及されています。","type":"noun","meaning_category":"Taxonomic classification"},{"sentence":"The classification of Pediculina has been revised in light of modern phylogenetic studies.","translation":"Pediculinaの分類は、現代の系統発生学的研究に照らして修正されました。","type":"noun","meaning_category":"Taxonomic classification"}]}