{"word":"Polylith","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(建築)複数の石またはコンクリートの要素から構成される構造物","english_definition":"A structure consisting of multiple stone or concrete elements.","examples":[{"sentence":"The ancient temple was a polylith, with massive stones carefully fitted together.","translation":"その古代寺院は巨大な石が注意深く組み合わされた複合石造建築だった。"}],"collocations":["ancient polylith","stone polylith","concrete polylith"],"synonyms":["megalithic structure","stone construction"],"antonyms":["monolith"]}],"etymology":{"value":"Derived from the Greek words 'poly' (meaning 'many') and 'lithos' (meaning 'stone').","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɒlɪlɪθ/","syllables":"Pol-y-lith"},"inflection":{"noun_plural":"Polyliths"},"usage_notes":{"explanation":"The term 'polylith' is primarily used in architectural and archaeological contexts to describe structures built from multiple large stones or concrete components. It emphasizes the composite nature of the construction. It is less commonly used than 'megalithic structure' but provides a more specific description of the construction method.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The polylith was made of a single piece of stone.","correct":"✓ The monolith was made of a single piece of stone.","note":"A polylith consists of multiple stones, whereas a monolith is a single stone."}],"priority":"★★☆"},"related_words":{"derivatives":["polylithic (adjective: relating to or consisting of multiple stones)"],"related_terms":["megalith","monolith","dolmen","cromlech"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Specialized vocabulary used in architecture and archaeology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Polylith' is a specialized term used in architecture and archaeology to describe a structure made of multiple large stones or concrete elements. It's derived from Greek roots meaning 'many stones.' Understanding this term requires familiarity with architectural terminology and ancient construction methods. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The excavation revealed a complex polylith dating back to the Bronze Age.","translation":"発掘調査により、青銅器時代に遡る複雑な複合石造建築が明らかになった。","type":"noun","meaning_category":"architecture"},{"sentence":"The polylith was constructed using advanced engineering techniques for its time.","translation":"その複合石造建築は、当時の高度な工学技術を用いて建設された。","type":"noun","meaning_category":"archaeology"}]}