{"word":"periodization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(スポーツトレーニングにおける)ピリオダイゼーション、期間設定","english_definition":"The systematic planning of athletic or physical training. The aim is to reach the best possible performance in the most important competition of the year. It involves progressive cycling of various aspects of a training program during a specific period.","examples":[{"sentence":"The coach implemented a periodization plan to optimize the athletes' performance for the championship.","translation":"コーチは、選手権に向けてアスリートのパフォーマンスを最適化するために、ピリオダイゼーション計画を実施した。"},{"sentence":"Effective periodization requires careful consideration of training volume, intensity, and recovery.","translation":"効果的なピリオダイゼーションには、トレーニング量、強度、および回復の慎重な検討が必要である。"}],"collocations":["training periodization","sports periodization","periodization plan","periodization cycle","implement periodization","periodization strategy"],"synonyms":["training cycle","program design","structured training"],"antonyms":["random training","unstructured training"]}],"etymology":{"value":"Derived from 'period,' referring to a specific length of time, and the suffix '-ization,' indicating a process or system.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌpɪəriədaɪˈzeɪʃən/","syllables":"pe-ri-o-di-za-tion"},"inflection":{"noun_plural":"periodizations"},"usage_notes":{"explanation":"Periodization is a structured approach to training that involves cycling through different phases to optimize performance and prevent overtraining. These phases typically include preparation, competition, and transition periods. The goal is to peak at the right time for key events.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used periodisation in his diet.","correct":"✓ He used a cyclical diet plan.","note":"Periodization is specific to training. For diet, use 'cyclical diet plan' or similar terms."}],"priority":"☆☆☆"},"related_words":{"derivatives":["periodize (verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Periodization' refers to a complex training methodology used in sports and physical fitness. It involves dividing a training plan into specific periods or phases, each with its own goals and objectives. This approach is used to optimize performance, prevent overtraining, and ensure that athletes are at their peak condition for important competitions. Understanding periodization requires knowledge of sports science and training principles."},"example_sentences":[{"sentence":"Proper periodization is essential for maximizing strength gains.","translation":"適切なピリオダイゼーションは、筋力増加を最大化するために不可欠である。","type":"general","meaning_category":"sports training"},{"sentence":"The periodization model included phases for hypertrophy, strength, and power.","translation":"ピリオダイゼーションモデルには、肥大、筋力、およびパワーの段階が含まれていた。","type":"specific","meaning_category":"sports training phases"}]}