{"word":"Aspidocephali","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古生物学)盾頭類：古生代に生息した無顎類のグループ。","english_definition":"(Paleontology) An obsolete term for a group of extinct jawless fishes from the Paleozoic era, now considered paraphyletic.","examples":[{"sentence":"The Aspidocephali were characterized by their heavy, bony head shields.","translation":"盾頭類は、重く骨質の頭部シールドによって特徴づけられた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from Greek 'aspis' (shield) and 'kephale' (head), referring to the prominent head shield.","priority":"★★★"},"pronunciation":{"ipa":"/ˌæspɪdəˈsɛfəlaɪ/","syllables":"As-pi-do-ceph-a-li"},"inflection":{"noun_plural":"Aspidocephali (already plural)"},"usage_notes":{"explanation":"The term 'Aspidocephali' is largely obsolete in modern paleontology. The group was defined based on shared primitive features (symplesiomorphies) rather than shared derived features (synapomorphies), making it a paraphyletic group. These fishes are now classified in various groups within the Pteraspidomorphi or other basal vertebrate lineages.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":[],"related_terms":["Pteraspidomorphi","Heterostraci","Agnatha","Paleozoic","paraphyletic"],"priority":"★★★"},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term 'Aspidocephali' is a technical term used in paleontology and evolutionary biology, specifically in the context of early vertebrate evolution. Understanding requires familiarity with cladistics and the concept of paraphyletic groups. The term is not commonly encountered outside of specialized literature. "},"example_sentences":[{"sentence":"Early classifications placed these armored jawless fishes within the Aspidocephali.","translation":"初期の分類では、これらの装甲された無顎類は盾頭類に分類されていた。","type":"noun","meaning_category":"古生物学"},{"sentence":"The Aspidocephali are no longer considered a valid taxonomic group.","translation":"盾頭類はもはや有効な分類群とは見なされていない。","type":"noun","meaning_category":"古生物学"}]}