{"word":"hissingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"シューッという音を立てて、シューシュー言いながら","english_definition":"In a manner that produces a hissing sound.","examples":[{"sentence":"The snake moved hissingly through the grass.","translation":"蛇はシューッと音を立てながら草むらを移動した。"},{"sentence":"The tire deflated hissingly.","translation":"タイヤはシューシュー音を立てながら空気が抜けた。"},{"sentence":"He spoke hissingly, trying not to be overheard.","translation":"彼は人に聞かれないように、シューッと声をひそめて話した。"}],"collocations":["move hissingly","speak hissingly","deflate hissingly"],"synonyms":["sibilantly","wheezingly"],"antonyms":[]}],"etymology":{"value":"The word \"hissingly\" is derived from the verb \"hiss\" and the suffix \"-ingly\". \"Hiss\" comes from the Old English word \"hyscan,\" which is imitative of the sound itself. The suffix \"-ingly\" transforms the verb into an adverb, indicating the manner in which something is done.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɪsɪŋli/","syllables":"his-sing-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"\"Hissingly\" is an adverb that describes an action performed with a hissing sound. It is often used to describe the movement or sound of snakes, escaping gas or steam, or a person speaking in a hushed, angry tone. It emphasizes the presence and quality of the hissing sound during the action.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cat looked hissingly at the dog.","correct":"✓ The cat hissed at the dog.","note":"While \"hissingly\" can be used, it's more common to use the verb \"hiss\" directly to describe the cat's action. \"The cat hissed at the dog\" is more natural. Using \"hissingly\" implies more about the *manner* of the looking, which might not be the intent."},{"incorrect":"✗ The water boiled hissingly.","correct":"✓ The water hissed as it boiled.","note":"It's more common to describe the water 'hissing' as a separate action during boiling rather than using \"hissingly\" to describe the boiling itself. The revised sentence is more idiomatic."}],"priority":"★★☆"},"related_words":{"derivatives":["hiss (noun, verb)","hissing (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"hissingly\" is an adverb that describes something done in a way that makes a hissing sound. It's not a very common word, and you'll mostly find it in descriptive writing to add detail to a scene. For example, if a snake moves through grass, you might say it moved \"hissingly\" to emphasize the sound it makes. It's formed by adding \"-ingly\" to the adjective form of \"hiss,\" making it clear how the action is performed."},"example_sentences":[{"sentence":"The steam escaped hissingly from the valve.","translation":"蒸気がバルブからシューッと音を立てて漏れ出した。","type":"adverb","meaning_category":"manner of sound"},{"sentence":"He whispered hissingly, 'Get out!'","translation":"彼は『出て行け！』とシューッと声をひそめて言った。","type":"adverb","meaning_category":"manner of speaking"},{"sentence":"The punctured balloon deflated hissingly on the floor.","translation":"穴の空いた風船は床の上でシューシュー音を立てながらしぼんだ。","type":"adverb","meaning_category":"manner of deflation"}]}