{"word":"electromagnetize","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"電磁化する、電磁石にする","english_definition":"To convert (a metal object) into an electromagnet; to magnetize by means of an electric current.","examples":[{"sentence":"The coil of wire electromagnetizes the iron core.","translation":"コイルのワイヤーが鉄心を電磁化する。"},{"sentence":"We can electromagnetize the nail by wrapping it in wire and running a current through the wire.","translation":"釘にワイヤーを巻き付け、ワイヤーに電流を流すことで、釘を電磁化できます。"}],"collocations":["electromagnetize a core","electromagnetize a metal","electromagnetize with current"],"synonyms":["magnetize","energize","charge"],"antonyms":["demagnetize","de-energize"]}],"etymology":{"value":"'electro-' (electricity) + 'magnetize' (to make magnetic). The word combines the concepts of electricity and magnetism to describe the process of creating a magnet using electric current.","priority":"★★★"},"pronunciation":{"ipa":"/ɪˌlɛktroʊˈmæɡnəˌtaɪz/","syllables":"e-lec-tro-mag-ne-tize"},"inflection":{"verb_forms":{"present_simple":["electromagnetize","electromagnetizes"],"past_simple":"electromagnetized","past_participle":"electromagnetized","present_participle":"electromagnetizing"}},"usage_notes":{"explanation":"'Electromagnetize' specifically refers to the process of making something magnetic by using electricity. It's commonly used in the context of creating electromagnets, where a coil of wire wrapped around a ferromagnetic core becomes magnetic when an electric current passes through the wire.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The metal was electricized.","correct":"✓ The metal was electromagnetized.","note":"'Electricized' generally means to supply with electricity or to shock with electricity, while 'electromagnetized' specifically refers to making something magnetic using electricity."}],"priority":"★★☆"},"related_words":{"derivatives":["electromagnet (noun): A magnet consisting of a coil of wire, often wound around a core of iron or other ferromagnetic material, that is magnetized when an electric current is passed through the wire.","electromagnetism (noun): The interaction of electric currents or fields and magnetic fields.","electromagnetic (adjective): Relating to electromagnetism or electromagnets."],"related_terms":["magnetism","electricity","solenoid","ferromagnetic"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Electromagnetize' is a technical term used to describe the process of making something magnetic using electricity. It's most often used in scientific or engineering contexts when discussing electromagnets and their applications. Understanding this word requires a basic knowledge of electricity and magnetism.","priority":"★★☆"},"example_sentences":[{"sentence":"The experiment demonstrated how to electromagnetize a steel rod.","translation":"その実験は、鋼鉄の棒を電磁化する方法を示した。","type":"general","meaning_category":"電磁化する"},{"sentence":"By varying the current, we can control how strongly the core is electromagnetized.","translation":"電流を変化させることで、コアがどれだけ強く電磁化されるかを制御できる。","type":"technical","meaning_category":"電磁化する"},{"sentence":"The device uses a powerful current to electromagnetize the target material.","translation":"その装置は、強力な電流を使用してターゲットの材料を電磁化する。","type":"technical","meaning_category":"電磁化する"}]}