{"word":"unnicknamed","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"ニックネームがつけられていない、愛称で呼ばれていない","english_definition":"Not having a nickname; not called by a familiar or pet name.","examples":[{"sentence":"The celebrity, surprisingly, remained unnicknamed by the press.","translation":"驚くべきことに、その有名人はマスコミからニックネームをつけられることはなかった。"},{"sentence":"The town, though historic, is unnicknamed and simply referred to by its official name.","translation":"その町は歴史があるにもかかわらず、ニックネームはなく、単に正式名称で呼ばれている。"}],"collocations":["remain unnicknamed","be unnicknamed","an unnicknamed place"],"synonyms":["without a nickname","not nicknamed","unnamed"],"antonyms":["nicknamed","titled","named with a nickname"]}],"etymology":{"value":"The word is formed by adding the prefix \"un-\" (meaning 'not') to the past participle \"nicknamed.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˈnɪkneɪmd/","syllables":"un-nick-named"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. There are no comparative or superlative forms."},"usage_notes":{"explanation":"The word \"unnicknamed\" is relatively rare. It is used to describe someone or something that does not have a nickname, often implying that it is unusual or unexpected. It's most commonly used in formal or descriptive contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was unnicknamed to his friends.","correct":"✓ He was unnicknamed by his friends.","note":"The correct preposition to use is 'by', not 'to'. The phrase should be 'unnicknamed by' when indicating who didn't give the nickname."},{"incorrect":"✗ The unnicknamed state.","correct":"✓ The state remains unnicknamed.","note":"It's more common to use a verb with 'unnicknamed' to show the state of not having a nickname, rather than directly modifying a noun, unless the context is very clear."}],"priority":"★★☆"},"related_words":{"derivatives":["nickname (noun, verb)","nicknaming (verb - present participle)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Not commonly used)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"unnicknamed\" is a relatively uncommon and formal term. It is best understood by those with a strong vocabulary and a good grasp of prefixes and root words. Its usage is typically limited to descriptive or analytical contexts where the absence of a nickname is noteworthy. Understanding the root word \"nickname\" is essential for comprehending the meaning of \"unnicknamed.\""},"example_sentences":[{"sentence":"Despite his fame, the athlete remained surprisingly unnicknamed by his fans.","translation":"彼の名声にもかかわらず、その運動選手は驚くほどファンからニックネームをつけられることはなかった。","type":"adjective","meaning_category":"descriptive"},{"sentence":"The small village, steeped in history, is unnicknamed and retains its original, somewhat lengthy name.","translation":"歴史に彩られたその小さな村は、ニックネームがなく、やや長い元の名前を保持している。","type":"adjective","meaning_category":"descriptive"},{"sentence":"The project, though innovative, was unnicknamed, perhaps due to its complexity.","translation":"そのプロジェクトは革新的ではあったが、おそらくその複雑さからか、ニックネームはつけられなかった。","type":"adjective","meaning_category":"descriptive"}]}