{"word":"Diotrephes","priority":"低","meanings":[{"part_of_speech":"noun","definition":"ディオトレフェス：新約聖書（ヨハネの第三の手紙）に登場する人物。教会内で指導的立場にあったが、使徒ヨハネの権威を認めず、兄弟たちを拒絶したとされる。自己中心的で権力を乱用した人物として描かれている。","english_definition":"Diotrephes: A figure mentioned in the New Testament (Third Epistle of John) who held a leadership position within a church but rejected the authority of the Apostle John and refused to welcome fellow believers. He is portrayed as self-centered and abusing his power.","examples":[{"sentence":"Diotrephes loved to be first, and he did not receive us.","translation":"ディオトレフェスは第一人者であることを好み、私たちを受け入れなかった。"},{"sentence":"The apostle John criticized Diotrephes for his pride and lack of hospitality.","translation":"使徒ヨハネは、ディオトレフェスの傲慢さと歓待の欠如を批判した。"}],"collocations":["Diotrephes who loves to have the preeminence (第一人者であることを好むディオトレフェス)","the actions of Diotrephes (ディオトレフェスの行動)","following the example of Diotrephes (ディオトレフェスの例に従うこと)"],"synonyms":["self-seeking leader","uncharitable church leader","power-hungry individual"],"antonyms":["hospitable leader","humble servant","charitable person"]}],"etymology":{"value":"ギリシャ語の Διοτρεφής (Diotrephēs) に由来し、「ゼウスによって養われた」または「ゼウスによって育てられた」という意味を持つ。","priority":"中"},"pronunciation":{"ipa":"/daɪˈɒtrəfiːz/","syllables":"Di-o-tre-phes"},"inflection":{"notes":"固有名詞のため、複数形や活用形はありません。"},"usage_notes":{"explanation":"「**Diotrephes**」は、聖書に登場する人物の名前であり、現代では比喩的に、権力を乱用し、自己中心的で、他人を受け入れない人物を指すことがあります。主に宗教的な文脈で使用されます。","priority":"低"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a Diotrephes, always helping others.","correct":"✓ He was like Diotrephes, always seeking his own advantage.","note":"ディオトレフェスは利己的な人物として描かれているため、他人を助ける人物の例えとしては不適切です。"},{"incorrect":"✗ Diotrephes was a good example of a church leader.","correct":"✓ Diotrephes was a bad example of a church leader.","note":"ディオトレフェスは教会指導者として悪い例として描かれています。"}],"priority":"低"},"related_words":{"derivatives":["Diotrephes-like (ディオトレフェスのような)"],"related_scripture":["ヨハネの第三の手紙 (Third Epistle of John)"],"priority":"中"},"level_frequency":{"CEFR":"該当なし (聖書に登場する固有名詞)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 一般的な語彙ではない。","priority":"低"},"readability_explanation":{"level":"C2","text":"「**Diotrephes**」は、聖書に登場する固有名詞であり、一般的な語彙ではありません。聖書や宗教的な文脈以外ではほとんど使用されません。理解するには、聖書の知識と、比喩的な意味で使用される場合の文脈理解が必要です。リーダーシップや権力に関する議論で、否定的な例として引き合いに出されることがあります。"},"example_sentences":[{"sentence":"The pastor warned against becoming like Diotrephes, seeking power and excluding others.","translation":"牧師は、権力を求め、他人を排除するディオトレフェスのようになることを戒めた。","type":"noun","meaning_category":"自己中心的な指導者"},{"sentence":"His behavior reminded me of Diotrephes in the Bible.","translation":"彼の行動は、聖書のディオトレフェスを思い出させた。","type":"noun","meaning_category":"自己中心的な指導者"},{"sentence":"The church needed to avoid the spirit of Diotrephes.","translation":"教会はディオトレフェスの精神を避ける必要があった。","type":"noun","meaning_category":"自己中心的な指導者"}]}