{"word":"three-dimensionality","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"三次元性、立体性","english_definition":"The quality of having three dimensions: length, width, and height. The state of appearing to have depth or thickness.","examples":[{"sentence":"The artist skillfully captured the three-dimensionality of the sculpture.","translation":"その芸術家は彫刻の三次元性を巧みに捉えた。"},{"sentence":"Virtual reality aims to create a sense of three-dimensionality for the user.","translation":"バーチャルリアリティは、ユーザーに三次元感覚を作り出すことを目指している。"},{"sentence":"The software allows you to view the object in full three-dimensionality.","translation":"そのソフトウェアを使用すると、オブジェクトを完全な三次元で見ることができる。"}],"collocations":["achieve three-dimensionality","enhance three-dimensionality","create three-dimensionality","sense of three-dimensionality","lack of three-dimensionality","perceive three-dimensionality","visualize three-dimensionality"],"synonyms":["3D","stereoscopic","depth","perspective","spatiality"],"antonyms":["two-dimensionality","flatness"]},{"part_of_speech":"noun","definition":"（比喩的に）多面性、複雑さ、奥行き","english_definition":"(Figuratively) The quality of being complex, multifaceted, or having depth in a non-physical sense.","examples":[{"sentence":"The author gave the characters a remarkable three-dimensionality, making them feel very real.","translation":"その作家は登場人物に驚くべき多面性を与え、彼らを非常にリアルに感じさせた。"},{"sentence":"The issue has a certain three-dimensionality that makes it difficult to understand fully.","translation":"その問題には、完全に理解することを困難にするある種の複雑さがある。"},{"sentence":"The director wanted to add three-dimensionality to the story by exploring the characters' backstories.","translation":"監督は登場人物の過去を探求することで、物語に奥行きを加えたいと考えた。"}],"collocations":["add three-dimensionality","lack of three-dimensionality","explore three-dimensionality","character three-dimensionality","narrative three-dimensionality","intellectual three-dimensionality"],"synonyms":["complexity","depth","multifacetedness","subtlety","nuance"],"antonyms":["simplicity","superficiality","shallowness"]}],"etymology":{"value":"Formed by combining \"three-dimensional\" with the suffix \"-ity\", which denotes a state or quality. \"Three-dimensional\" itself comes from \"three\" + \"dimension\", referring to the three spatial dimensions of length, width, and height.","priority":"★★☆"},"pronunciation":{"ipa":"/θriː daɪˌmɛnʃəˈnælɪti/","syllables":"three-di-men-sion-al-i-ty (7 syllables)"},"inflection":{"notes":"This is a noun and does not have inflectional forms like verbs or adjectives."},"usage_notes":{"explanation":"\"**Three-dimensionality**\" primarily refers to the physical property of having three dimensions, allowing for depth and volume. It is commonly used in contexts related to art, design, technology, and science. Figuratively, it can describe the complexity or depth of a concept, character, or situation. The figurative use emphasizes that something is not simple or one-dimensional but has multiple layers and aspects to consider.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The movie had a good three-dimensional.","correct":"✓ The movie had good three-dimensionality.","note":"\"Three-dimensionality\" is a noun, so it should not be used as an adjective. Use it to describe the quality or state of being three-dimensional."},{"incorrect":"✗ The three-dimensionality was very three-dimensional.","correct":"✓ The three-dimensionality was well-executed. / ✓ The three-dimensionality was impressive.","note":"Avoid redundant phrasing. Instead of saying something is \"very three-dimensional,\" describe the quality of the three-dimensionality (e.g., well-executed, impressive, realistic)."}],"priority":"★★☆"},"related_words":{"derivatives":["three-dimensional (adjective)","dimension (noun)","dimensional (adjective)"],"related_terms":["3D","stereoscopy","holography","spatial reasoning","spatial awareness"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, more common in specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"**three-dimensionality**\" refers to the quality of something having three dimensions (length, width, and height), giving it depth and volume. It is often used in discussions about art, technology, and design, where creating a sense of depth is important. Figuratively, it can describe the complexity or depth of a character, story, or idea. Understanding this word requires a good grasp of abstract concepts and specialized vocabulary. It is not commonly used in everyday conversation but is more prevalent in academic or technical contexts."},"example_sentences":[{"sentence":"The new display technology offers stunning three-dimensionality.","translation":"その新しいディスプレイ技術は、驚くほど立体感を提供する。","type":"noun","meaning_category":"三次元性 (physical)"},{"sentence":"The author added three-dimensionality to the characters by exploring their pasts.","translation":"作家は登場人物の過去を探求することで、彼らに多面性を加えた。","type":"noun","meaning_category":"多面性 (figurative)"},{"sentence":"The lack of three-dimensionality in the painting made it appear flat.","translation":"絵画に立体感が欠けていたため、平面的に見えた。","type":"noun","meaning_category":"三次元性 (physical)"},{"sentence":"The issue has a certain three-dimensionality that makes it difficult to resolve.","translation":"その問題には、解決を困難にするある種の複雑さがある。","type":"noun","meaning_category":"多面性 (figurative)"}]}