{"word":"D-Notice","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(英国の)D通知、報道規制通知：政府が報道機関に対し、国家安全保障上の理由から特定の情報を報道しないよう要請する公式通知","english_definition":"(In the UK) An official request from the government to news organizations not to publish certain information for reasons of national security.","examples":[{"sentence":"The government issued a D-Notice to prevent the publication of details about the secret operation.","translation":"政府は秘密作戦の詳細の公表を防ぐため、D通知を発行した。"},{"sentence":"The use of D-Notices has been controversial, with some arguing it restricts freedom of the press.","translation":"D通知の使用は物議を醸しており、報道の自由を制限するものだと主張する者もいる。"}],"collocations":["issue a D-Notice","send out a D-Notice","D-Notice system","national security D-Notice"],"synonyms":["Defence Advisory Notice (DAN)"],"antonyms":[]},{"part_of_speech":"noun","definition":"(一般的に)報道規制要請、報道自粛要請：政府または当局が報道機関に対し、特定の情報の報道を控えるよう求めること。","english_definition":"A request, generally from a government or authority, to news organizations to refrain from publishing certain information.","examples":[{"sentence":"The ministry sent out a D-Notice regarding the sensitive nature of the ongoing investigation.","translation":"省庁は進行中の捜査の機密性に関して、報道自粛要請を送付した。"}],"collocations":["issue a D-Notice","send out a D-Notice","voluntary D-Notice"],"synonyms":["press censorship request","news embargo request"],"antonyms":[]}],"etymology":{"value":"元々はイギリスで使用されていた用語で、'Defence Notice' の略称として始まり、後に 'D-Notice' として知られるようになった。政府が報道機関に国家安全保障に関わる情報の公開を控えるよう求める公式な要請である。","priority":"★★☆"},"pronunciation":{"ipa":"ˈdiːˌnoʊtɪs","syllables":"Dee-No-tis"},"inflection":{"notes":"複数形は D-Notices"},"usage_notes":{"explanation":"D-Noticeは、主にイギリスで使用される用語で、政府が報道機関に対し、国家安全保障上の理由から特定の情報を報道しないよう要請する公式な通知を指します。近年では、Defence Advisory Notice (DAN)という名称に変更されましたが、D-Noticeという用語も依然として使用されています。D-Noticeは、政府が報道の自由を制限する手段として批判されることもありますが、国家安全保障を維持するために必要であるという意見もあります。D-Noticeは、法的拘束力を持つものではなく、報道機関の自主的な協力に基づいています。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The D-Notice was legally binding, so the newspaper had to comply.","correct":"✓ The D-Notice is not legally binding, but the newspaper chose to comply.","note":"D-Notices are not legally binding; compliance is voluntary."},{"incorrect":"✗ The government used a D-Notice to censor all negative news.","correct":"✓ The government used a D-Notice to prevent the publication of specific information related to national security.","note":"D-Notices are intended for national security matters, not general censorship."}],"priority":"★★☆"},"related_words":{"derivatives":["DAN (Defence Advisory Notice)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「D-Notice」は、イギリスで使われる専門用語で、政府が報道機関に特定の情報を公開しないように求める公式な要請を指します。これは、国家安全保障に関わる情報が漏洩するのを防ぐために行われます。D-Noticeは法的拘束力を持たず、報道機関の自主的な協力に依存しています。この制度は、報道の自由とのバランスが常に議論の対象となっています。現在は Defence Advisory Notice (DAN) と呼ばれることもあります。"},"example_sentences":[{"sentence":"The Ministry of Defence issued a D-Notice to prevent the media from reporting on the troop deployment.","translation":"国防省は、メディアが軍隊の配備について報道することを防ぐためにD通知を発行した。","type":"example","meaning_category":"報道規制通知"},{"sentence":"The use of D-Notices is a controversial topic, as it can be seen as a form of censorship.","translation":"D通知の使用は、検閲の一形態と見なされる可能性があるため、議論の的となっている。","type":"example","meaning_category":"報道規制通知"}]}