{"word":"Buntal","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Philippines) A type of small, poisonous pufferfish.","english_definition":"(Philippines) Any of various species of small, often poisonous pufferfish found in Philippine waters.","examples":[{"sentence":"Be careful when eating fish in the Philippines, some vendors might sell Buntal.","translation":"フィリピンで魚を食べる際は注意してください。一部の業者はブンタルを販売している可能性があります。"}],"collocations":["eating Buntal","avoid Buntal","poisonous Buntal"],"synonyms":["pufferfish","blowfish","tetrodotoxin fish"],"antonyms":[]}],"etymology":{"value":"Likely derived from a local Philippine language.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈbʊntɑl/","syllables":"Bun-tal"},"inflection":{"noun_plural":"Buntals"},"usage_notes":{"explanation":"'Buntal' specifically refers to certain species of pufferfish found in the Philippines, known for containing tetrodotoxin. It is important to note that consuming these fish can be dangerous if not prepared properly.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate Buntal last night and felt fine.","correct":"✓ Eating Buntal can be dangerous due to the tetrodotoxin.","note":"Even if someone feels fine after eating Buntal, it doesn't negate the potential danger. It's important to emphasize the risk."}],"priority":"★☆☆"},"related_words":{"derivatives":["tetrodotoxin"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Buntal' is a specialized term referring to a specific type of pufferfish found in the Philippines. Understanding requires knowledge of Philippine cuisine and the potential dangers of consuming improperly prepared pufferfish. Due to the cultural and scientific context, it is not considered a common word. "},"example_sentences":[{"sentence":"The local fisherman warned us about the dangers of eating improperly prepared Buntal.","translation":"地元の漁師は、不適切に調理されたブンタルを食べることの危険性について警告しました。","type":"noun","meaning_category":"fish"}]}