{"word":"pallidly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"青白く、顔色悪く、生気なく","english_definition":"In a pallid manner; in a way that is pale, lacking color, or lacking vitality.","examples":[{"sentence":"She smiled pallidly, her face still drained of color.","translation":"彼女は顔色が悪く、まだ血の気が引けたまま、青白い笑みを浮かべた。"},{"sentence":"The moon shone pallidly through the clouds.","translation":"月が雲間から青白く光っていた。"},{"sentence":"He stared pallidly at the screen, his energy depleted.","translation":"彼は生気を失い、青白い顔で画面を見つめていた。"}],"collocations":["smile pallidly","shine pallidly","stare pallidly","appear pallidly"],"synonyms":["palely","wanly","ashenly","colorlessly","anaemically","sickly"],"antonyms":["rosily","ruddy","vibrantly","healthily"]}],"etymology":{"value":"Derived from the adjective 'pallid' (pale, lacking color) and the suffix '-ly' (forming an adverb). 'Pallid' comes from the Latin word 'pallidus', which is derived from 'pallere' (to be pale).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpælɪdli/","syllables":"pal-lid-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Pallidly' describes the manner in which something is done or appears, emphasizing a lack of color or vitality. It is often used to describe a person's complexion or the appearance of something that lacks vibrancy. The word carries a slightly negative connotation, suggesting illness, weakness, or a lack of energy. It is more formal and less common in everyday speech than synonyms like 'palely'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The tree grew pallidly in the shade.","correct":"✓ The tree grew palely in the shade.","note":"While 'pallidly' could technically be used, 'palely' is a more common and natural choice to describe the color of a tree in the shade. 'Pallidly' is more often used to describe a person's complexion or something that should have color but lacks it."},{"incorrect":"✗ He sang pallidly with great enthusiasm.","correct":"✓ He sang enthusiastically, but his voice was pallid.","note":"'Pallidly' suggests a lack of vitality. Singing with enthusiasm would contradict this. It's more appropriate to describe the voice itself as pallid, separate from the manner of singing."}],"priority":"★★☆"},"related_words":{"derivatives":["pallid (adjective: pale, lacking color)","pallidness (noun: the state of being pallid)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pallidly' is an adverb that describes something done in a pale or colorless manner. It's not a common word, and you'll mostly find it in literature or formal writing. It suggests a lack of vitality or health, often used to describe someone's face or complexion. Because it's a more advanced word, simpler alternatives like 'palely' or 'wanly' are often preferred in everyday conversation."},"example_sentences":[{"sentence":"The patient lay pallidly in the hospital bed, barely conscious.","translation":"患者はほとんど意識がなく、青白い顔で病院のベッドに横たわっていた。","type":"adverb","meaning_category":"青白く"},{"sentence":"The light filtered pallidly through the dusty windowpanes.","translation":"光が埃っぽい窓ガラスを通して青白く差し込んだ。","type":"adverb","meaning_category":"生気なく"},{"sentence":"He smiled pallidly, trying to reassure her despite his own fear.","translation":"彼は恐怖を押し隠し、彼女を安心させようと青白い笑みを浮かべた。","type":"adverb","meaning_category":"顔色悪く"}]}