{"word":"Noctor","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(slang, Ireland) A person who is perceived as being overly concerned with rules and regulations, often in a petty or officious manner.","english_definition":"(slang, Ireland) A person who is perceived as being overly concerned with rules and regulations, often in a petty or officious manner.","examples":[{"sentence":"He's such a noctor, always telling people what they can't do.","translation":"彼は本当に規則にうるさい人で、いつも人に何をしてはいけないか言っている。"},{"sentence":"Don't be such a noctor, let them have some fun.","translation":"そんなに規則にうるさくしないで、彼らに少し楽しませてあげて。"}],"collocations":["being a noctor","acting like a noctor"],"synonyms":["jobsworth","rulemonger","petty official","nitpicker"],"antonyms":["easygoing","laid-back"]}],"etymology":{"value":"Likely a blend of 'knocker' (someone who criticizes or finds fault) and 'doctor' (implying someone who is overly concerned with details). The term is primarily used in Ireland.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnɒktər/","syllables":"Noc-tor"},"inflection":{"noun_plural":"noctors"},"usage_notes":{"explanation":"The term 'noctor' is a slang term, primarily used in Ireland, to describe someone who is seen as being excessively strict or officious, especially regarding rules and regulations. It carries a negative connotation, implying that the person is being unnecessarily pedantic or controlling.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He's a noctor because he's very kind.","correct":"✓ He's a noctor because he's very strict about the rules.","note":"'Noctor' is used for someone who is strict and officious, not generally for someone who is kind."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (slang, regional)","frequency_google_ngram":"Low frequency - primarily used in Ireland.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Noctor' is a slang term, mainly used in Ireland, to describe someone who is overly strict and officious, particularly when it comes to enforcing rules and regulations. It's a derogatory term, suggesting that the person is being unnecessarily pedantic or controlling. Understanding this term requires familiarity with Irish slang and cultural context."},"example_sentences":[{"sentence":"The lifeguard was being a real noctor, blowing his whistle at everyone who stepped out of line.","translation":"ライフガードは本当に規則にうるさい人で、少しでも規則から外れた人には皆に笛を吹いていた。","type":"noun","meaning_category":"Person overly concerned with rules"},{"sentence":"Our new manager is a total noctor; he's already implemented a dozen new policies.","translation":"新しいマネージャーは完全に規則にうるさい人で、すでに12もの新しい規則を導入した。","type":"noun","meaning_category":"Person overly concerned with rules"}]}