{"word":"extravertive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"外向的な、外交的な","english_definition":"Directed outward; characterized by interest in or concern primarily with what is outside oneself; outgoing and socially confident.","examples":[{"sentence":"She has an extravertive personality and enjoys meeting new people.","translation":"彼女は外向的な性格で、新しい人に会うのを楽しんでいます。"},{"sentence":"His extravertive nature made him a natural leader.","translation":"彼の外交的な性質が、彼を生まれながらのリーダーにしました。"}],"collocations":["extravertive personality","extravertive behavior","extravertive tendencies"],"synonyms":["extroverted","outgoing","sociable","gregarious","assertive","confident"],"antonyms":["introvertive","introverted","shy","reserved","withdrawn"]}],"etymology":{"value":"Formed from 'extravert' (also spelled 'extrovert') + '-ive'. 'Extravert' is a back-formation from 'extraversion' (also spelled 'extroversion'), coined by Carl Jung from Latin 'extra' (outside) + 'vertere' (to turn).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌekstrəˈvɜːrtɪv/","syllables":"ex-tra-vert-ive"},"inflection":{"notes":"Adjectives do not typically inflect in English, aside from comparative and superlative forms.","adjective_forms":{"comparative":"more extravertive","superlative":"most extravertive"}},"usage_notes":{"explanation":"'Extravertive' is a less common variant of 'extroverted', both describing someone who is outgoing, sociable, and gains energy from being around others. While 'extroverted' is the more frequently used term, 'extravertive' is still valid and conveys the same general meaning. The choice between the two often comes down to personal preference or stylistic considerations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an extravertive person that likes to be alone.","correct":"✓ He is an extravertive person who enjoys being around others.","note":"Extravertive people generally enjoy being around others, so liking to be alone contradicts the meaning."},{"incorrect":"✗ She is extravertive, so she is always happy.","correct":"✓ She is extravertive, so she is often cheerful.","note":"While extravertive people tend to be cheerful, it's not accurate to say they are *always* happy."}],"priority":"★★☆"},"related_words":{"derivatives":["extravert (noun/adjective)","extraversion (noun)"],"related_terms":["introvertive","introverted","ambivert"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (low frequency)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Extravertive' is a formal adjective describing someone who is outgoing and enjoys socializing. It's related to the more common term 'extroverted.' Understanding this word requires familiarity with psychological terms and a good vocabulary. It is not a commonly used word, so it is more likely to be encountered in written texts or formal discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The company sought candidates with strong leadership skills and an extravertive approach to problem-solving.","translation":"その会社は、強力なリーダーシップスキルと、問題解決への外向的なアプローチを持つ候補者を求めていました。","type":"adjective","meaning_category":"外向的な"},{"sentence":"Her extravertive nature made her an excellent salesperson, as she easily connected with potential clients.","translation":"彼女の外交的な性格は、潜在的な顧客と容易につながることができたため、彼女を優れたセールスパーソンにしました。","type":"adjective","meaning_category":"外交的な"},{"sentence":"Despite being naturally shy, he adopted an extravertive persona when performing on stage.","translation":"生まれつき内気でしたが、彼はステージでパフォーマンスをするときは外向的なペルソナを採用しました。","type":"adjective","meaning_category":"外向的な"}]}