{"word":"untreatability","priority":"low","meanings":[{"part_of_speech":"noun","definition":"治療不能性、治療の難しさ","english_definition":"The state or quality of being untreatable; the condition of not being able to be treated or cured.","examples":[{"sentence":"The untreatability of some cancers makes them particularly devastating.","translation":"一部のがんの治療不能性は、それらを特に破壊的なものにしています。"},{"sentence":"Doctors are researching new methods to overcome the untreatability of certain viral infections.","translation":"医師たちは、特定のウイルス感染症の治療不能性を克服するための新しい方法を研究しています。"}],"collocations":["high untreatability","inherent untreatability","relative untreatability"],"synonyms":["incurability","irremediability","hopelessness"],"antonyms":["treatability","curability","remediability"]}],"etymology":{"value":"Formed from \"untreatable\" (not able to be treated) with the suffix \"-ity\" (denoting a state or quality).","priority":"low"},"pronunciation":{"ipa":"ʌnˌtriːtəˈbɪləti","syllables":"un-treat-a-bil-i-ty"},"inflection":{"noun_plural":"untreatabilities (rarely used)"},"usage_notes":{"explanation":"\"Untreatability\" is a noun that refers to the condition or quality of something (usually a disease or condition) being impossible or very difficult to treat successfully. It is often used in medical contexts.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The untreatability is a big problem.","correct":"The untreatability of the disease is a big problem.","note":"It is better to specify what is untreatable."}],"priority":"low"},"related_words":{"derivatives":["untreatable (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"low"},"readability_explanation":{"level":"C1","text":"The word \"untreatability\" is a complex noun used in formal contexts, particularly in medicine. It describes the state of a disease or condition being impossible or extremely difficult to treat successfully. Understanding this word requires a good grasp of abstract nouns and medical terminology."},"example_sentences":[{"sentence":"The primary challenge in managing this disease is its inherent untreatability.","translation":"この疾患の管理における主な課題は、その固有の治療不能性です。","type":"general","meaning_category":"general"},{"sentence":"Researchers are focused on understanding the genetic factors contributing to the untreatability of this specific type of tumor.","translation":"研究者たちは、この特定の種類の腫瘍の治療不能性に寄与する遺伝的要因の理解に焦点を当てています。","type":"medical","meaning_category":"medical"}]}