{"word":"focusers","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(plural only) Devices used to adjust the focus of an optical instrument, such as a telescope or microscope.","english_definition":"Plural form of focuser: devices used to adjust the focus of an optical instrument.","examples":[{"sentence":"The telescope's focusers allowed for precise adjustments to the image.","translation":"望遠鏡の接眼部は、画像の正確な調整を可能にした。"},{"sentence":"High-quality focusers are essential for astrophotography.","translation":"高品質の接眼部は、天体写真撮影に不可欠である。"}],"collocations":["telescope focusers","microscope focusers","precision focusers","dual-speed focusers"],"synonyms":["focusing mechanisms","focusing devices"],"antonyms":[]}],"etymology":{"value":"Derived from 'focuser,' which is a combination of 'focus' (the point of convergence of light rays) and '-er' (a suffix denoting an agent or device).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfoʊkəsərz/","syllables":"fo-cus-ers"},"inflection":{"noun_plural":"focusers"},"usage_notes":{"explanation":"'Focusers' specifically refers to the plural form of 'focuser,' which is a component of optical instruments. It is not a commonly used word outside of technical contexts related to optics and astronomy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The focusers was broken.","correct":"✓ The focusers were broken.","note":"'Focusers' is plural, so it requires a plural verb form ('were')."},{"incorrect":"✗ He adjusted the focuser on both telescopes.","correct":"✓ He adjusted the focusers on both telescopes.","note":"If referring to multiple telescopes, use the plural form 'focusers' to indicate that each telescope has its own focuser."}],"priority":"★★☆"},"related_words":{"derivatives":["focuser","focus","focusing","in-focus","out-of-focus"],"phrasal_verbs":[],"related_terms":["eyepiece","telescope","microscope","optics","astronomy","astrophotography"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Technical vocabulary)","frequency_google_ngram":"Low frequency (Specific to technical fields)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Focusers' is a technical term primarily used in the context of optical instruments like telescopes and microscopes. It refers to the devices that allow for precise adjustment of the image focus. Due to its specialized nature, it is not part of common everyday vocabulary and is more likely to be encountered in scientific or technical texts. Understanding the term requires familiarity with basic optical concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The astronomer carefully adjusted the telescope's focusers to get a clear view of the nebula.","translation":"天文学者は星雲をはっきりと見るために、望遠鏡の接眼部を注意深く調整した。","type":"noun","meaning_category":"optical instruments"},{"sentence":"These high-precision focusers allow for extremely fine adjustments when imaging faint objects.","translation":"これらの高精度接眼部は、微弱な物体を撮影する際に非常に細かい調整を可能にする。","type":"noun","meaning_category":"astronomy"},{"sentence":"The microscope's focusers were essential for examining the cellular structures.","translation":"顕微鏡の接眼部は、細胞構造を調べるために不可欠だった。","type":"noun","meaning_category":"microscopy"}]}