{"word":"amps","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(電気) アンペア (ampere) の複数形","english_definition":"Plural form of ampere. The base unit of electric current in the International System of Units (SI).","examples":[{"sentence":"The circuit breaker tripped because it was drawing too many amps.","translation":"回路ブレーカーは、過剰なアンペア数を消費していたために作動した。"},{"sentence":"How many amps does this appliance require?","translation":"この器具は、何アンペア必要ですか？"}],"collocations":["draw amps","supply amps","measure amps","high amps","low amps"],"synonyms":["ampere","A"],"antonyms":[]}],"etymology":{"value":"Derived from the surname of André-Marie Ampère, a French physicist and mathematician who is considered one of the founders of classical electromagnetism.","priority":"★★★"},"pronunciation":{"ipa":"/æmps/","syllables":"amps"},"inflection":{"noun_plural":"amps"},"usage_notes":{"explanation":"'Amps' is the plural form of 'ampere', the unit of electric current. It's used to describe the rate of flow of electrical charge. Higher amperage means more current is flowing.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The voltage is more important than amps.","correct":"The voltage is as important as the amperage.","note":"When comparing voltage and amperage, use the noun form 'amperage' instead of 'amps' for consistency."}],"priority":"★★☆"},"related_words":{"derivatives":["ampere","amperage"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Amps' refers to the unit of electric current, ampere. It's a technical term used in electronics and electrical engineering. Understanding the concept of amperage is crucial for working with electrical circuits and appliances. A higher amperage indicates a greater flow of electric charge."},"example_sentences":[{"sentence":"The power supply delivers 5 amps at 12 volts.","translation":"その電源は、12ボルトで5アンペアを供給する。","type":"noun","meaning_category":"electrical current"},{"sentence":"Check the fuse rating to see how many amps it can handle.","translation":"ヒューズが処理できるアンペア数を確認するために、定格をチェックしてください。","type":"noun","meaning_category":"electrical capacity"}]}