{"word":"misidentifications","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"誤認、誤同定","english_definition":"instances of incorrectly identifying someone or something.","examples":[{"sentence":"The witness made several misidentifications during the lineup.","translation":"証人は、面通しでいくつかの誤認をした。"},{"sentence":"Misidentifications of plants can lead to serious health problems.","translation":"植物の誤同定は、深刻な健康問題につながる可能性がある。"},{"sentence":"The report highlighted the high number of misidentifications in the criminal justice system.","translation":"その報告書は、刑事司法制度における誤認の多さを強調した。"}],"collocations":["facial misidentification (顔の誤認)","eyewitness misidentification (目撃者の誤認)","plant misidentification (植物の誤同定)","species misidentification (種の誤同定)","criminal misidentification (犯罪者の誤認)"],"synonyms":["mistaken identity","false identification","erroneous identification","wrong identification"],"antonyms":["accurate identification","correct identification","proper identification"]}],"etymology":{"value":"\"mis-\" (誤った) + \"identification\" (識別、同定)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɪs.aɪˌdɛn.tɪ.fɪˈkeɪ.ʃənz/","syllables":"mis-i-den-ti-fi-ca-tions"},"inflection":{"noun_plural":"misidentifications"},"usage_notes":{"explanation":"\"Misidentifications\" is the plural form of \"misidentification,\" which refers to instances where someone or something is incorrectly identified. This term is often used in contexts such as eyewitness testimony, plant identification, and species classification, where accuracy is crucial. The singular form, \"misidentification,\" refers to a single instance of incorrect identification.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The misidentification was happened because of poor lighting.","correct":"✓ The misidentification happened because of poor lighting.","note":"\"Misidentification\" is a noun, so it does not need to be used with \"was happened.\" Use \"happened\" as the main verb."},{"incorrect":"✗ There was many misidentification in the report.","correct":"✓ There were many misidentifications in the report.","note":"Since \"misidentifications\" is plural, use the plural form of the verb \"to be,\" which is \"were.\""},{"incorrect":"✗ The misidentifications are a serious problem, but it is often overlooked.","correct":"✓ The misidentifications are a serious problem, but they are often overlooked.","note":"Since the subject is plural (\"misidentifications\"), the pronoun should also be plural (\"they\")."}],"priority":"★★☆"},"related_words":{"derivatives":["misidentify (verb: 誤って識別する)","identification (noun: 識別、同定)","identify (verb: 識別する、同定する)"],"antonyms":["identification (noun: 識別、同定)"],"related_concepts":["eyewitness testimony (目撃証言)","lineup (面通し)","forensic science (法科学)","taxonomy (分類学)","plant identification (植物の識別)","species identification (種の識別)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"misidentifications\" refers to instances where someone or something is incorrectly identified. It is a relatively uncommon word, but it is important in contexts where accurate identification is crucial, such as in legal proceedings (eyewitness testimony) or scientific research (species identification). Understanding this word requires a good grasp of the meaning of \"identification\" and the prefix \"mis-\", which indicates something done wrongly or incorrectly."},"example_sentences":[{"sentence":"The high rate of eyewitness misidentifications is a major concern in the legal system.","translation":"目撃者の誤認率が高いことは、司法制度における大きな懸念事項である。","type":"noun","meaning_category":"誤認"},{"sentence":"Several misidentifications of the suspect led to a wrongful arrest.","translation":"容疑者のいくつかの誤認が不当逮捕につながった。","type":"noun","meaning_category":"誤認"},{"sentence":"Careful analysis is needed to avoid misidentifications of similar plant species.","translation":"類似した植物種の誤同定を避けるためには、注意深い分析が必要である。","type":"noun","meaning_category":"誤同定"}]}