{"word":"calyculus","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物学) 小萼; 頭状花序に見られる総苞片の輪","english_definition":"(botany) A set of bracts resembling a calyx, found below the true calyx in some flowers; an involucre of bracts around the head of a composite flower.","examples":[{"sentence":"The calyculus of the *Hibiscus* flower is composed of several small bracts.","translation":"フヨウの花の小萼は、いくつかの小さな苞葉で構成されている。"},{"sentence":"The dandelion's calyculus helps to protect the developing flower head.","translation":"タンポポの小萼は、発達中の頭状花序を保護するのに役立つ。"}],"collocations":["possessing a calyculus","calyculus bracts","beneath the calyx and calyculus"],"synonyms":["epicalyx","involucre"],"antonyms":[]}],"etymology":{"value":"ラテン語の *calyculus*, calyx (萼) の指小形。","priority":"★★★"},"pronunciation":{"ipa":"/kəˈlɪkjʊləs/","syllables":"ca-ly-cu-lus"},"inflection":{"noun_plural":"calyculi"},"usage_notes":{"explanation":"The term *calyculus* is primarily used in botany to describe a structure that resembles a calyx but is actually a set of bracts located below the true calyx or surrounding the flower head in composite flowers. It is important to distinguish it from the true calyx, which is formed from the sepals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The calyculus is the same as the calyx.","correct":"✓ The calyculus is a structure resembling a calyx but is not the same.","note":"The calyculus is a separate structure from the calyx, although it resembles it. It consists of bracts, not sepals."}],"priority":"★★☆"},"related_words":{"derivatives":["calyx"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Extremely low frequency. Specialized botanical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word *calyculus* is a specialized botanical term referring to a structure resembling a calyx but composed of bracts rather than sepals. It is primarily encountered in botanical descriptions and texts. Understanding this term requires a strong background in botany and plant morphology."},"example_sentences":[{"sentence":"The presence of a distinct calyculus is a key characteristic in identifying certain species of plants.","translation":"明確な小萼の存在は、特定の植物種を識別する上で重要な特徴である。","type":"definition","meaning_category":"botany"}]}