{"word":"idiobiology","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"個体生物学、個別生物学：個々の生物個体の特異性や独自性を重視する生物学の一分野。","english_definition":"The study of individual organisms, emphasizing their unique characteristics and life histories.","examples":[{"sentence":"Idiobiology focuses on the specific traits of each organism, rather than broad generalizations.","translation":"個体生物学は、広範な一般化ではなく、各生物個体の具体的な特徴に焦点を当てます。"},{"sentence":"The researcher used idiobiological methods to understand the development of a particular plant species.","translation":"研究者は、特定の植物種の成長を理解するために個体生物学的な手法を用いました。"}],"collocations":["idiobiological approach","idiobiological study","idiobiological research"],"synonyms":["individual biology","organismal biology","specific biology"],"antonyms":["population biology","general biology"]}],"etymology":{"value":"'idio-' (ギリシャ語の 'idios' = 自身の、特有の) + 'biology' (生物学)","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪdioʊbaɪˈɒlədʒi/","syllables":"i-di-o-bi-ol-o-gy"},"inflection":{"noun_plural":"idiobiologies"},"usage_notes":{"explanation":"Idiobiology is a specialized term in biology, focusing on the unique aspects of individual organisms. It contrasts with approaches that emphasize general principles applicable to populations or entire species.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The study used a general biological approach, not idiobiology.","correct":"✓ The study used a general biological approach, not an idiobiological one.","note":"When referring to the approach, use the adjective 'idiobiological' rather than the noun 'idiobiology'."}],"priority":"★☆☆"},"related_words":{"derivatives":["idiobiological (adjective)"],"related_terms":["biology","ecology","evolutionary biology"]},"level_frequency":{"frequency_google_ngram":"Low frequency (専門用語)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Idiobiology is a specialized term used in the field of biology to describe the study of individual organisms with an emphasis on their unique characteristics. This term is not commonly used outside of scientific contexts. Understanding this term requires a strong background in biology and scientific terminology."},"example_sentences":[{"sentence":"The idiobiology of the rare orchid revealed unique adaptations to its specific environment.","translation":"その希少な蘭の個体生物学は、その特定の環境への独特な適応を示した。","type":"noun","meaning_category":"個体生物学"},{"sentence":"An idiobiological analysis was performed to understand the specific genetic makeup of the individual.","translation":"個体の特定の遺伝子構成を理解するために、個体生物学的分析が実施された。","type":"adjective","meaning_category":"個体生物学的な"}]}