{"word":"Wichita","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ウィチタ (アメリカ合衆国カンザス州南部の都市)","english_definition":"A city in south-central Kansas, United States. It is the county seat of Sedgwick County and the most populous city in the state.","examples":[{"sentence":"Wichita is known for its aviation industry.","translation":"ウィチタは航空産業で知られています。"},{"sentence":"I'm flying to Wichita next week for a business trip.","translation":"来週、出張でウィチタに飛びます。"}],"collocations":["Wichita, Kansas","City of Wichita","Wichita metropolitan area"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The city is named after the Wichita Native American tribe, who historically inhabited the area.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɪtʃɪtɔː/","syllables":"Wi-chi-ta"},"inflection":{"notes":"Proper noun, singular"},"usage_notes":{"explanation":"Wichita is primarily used as a proper noun to refer to the city in Kansas. It is also sometimes used in reference to the Wichita people, though this is less common.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":["Wichitan (noun: a resident of Wichita; adjective: relating to Wichita)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively infrequent, except in contexts related to Kansas or aviation.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Wichita' is a proper noun referring to a specific city in Kansas. Its usage is generally limited to contexts discussing the city itself, the state of Kansas, or possibly the aviation industry, as Wichita has a significant presence in that sector. Understanding its meaning is straightforward, but its frequency outside of these specific contexts is relatively low."},"example_sentences":[{"sentence":"The population of Wichita is approximately 400,000.","translation":"ウィチタの人口は約40万人です。","type":"noun","meaning_category":"City"},{"sentence":"Boeing has a large manufacturing facility in Wichita.","translation":"ボーイングはウィチタに大規模な製造施設を持っています。","type":"noun","meaning_category":"City"},{"sentence":"We visited the Wichita Art Museum during our trip.","translation":"旅行中にウィチタ美術館を訪れました。","type":"noun","meaning_category":"City"}]}