{"word":"Intersexualities","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"間性 (かんせい): 性染色体、性腺、または生殖器が典型的には男性または女性として分類されない状態を指す包括的な用語。","english_definition":"A general term used for a variety of conditions in which a person is born with a reproductive or sexual anatomy that doesn't seem to fit the typical definitions of female or male.","examples":[{"sentence":"Intersexualities can manifest in many different ways, and each individual's experience is unique.","translation":"間性はさまざまな形で現れる可能性があり、個々の経験はそれぞれ異なります。"},{"sentence":"Understanding and acceptance of intersexualities are crucial for promoting inclusivity and respect for all individuals.","translation":"間性に対する理解と受容は、すべての人々に対する包括性と尊重を促進するために重要です。"}],"collocations":["intersex condition (間性の状態)","intersex variation (間性の多様性)","intersex rights (間性の権利)","atypical sex characteristics (非典型的な性徴)","differences of sex development (性分化疾患)"],"synonyms":["differences of sex development (DSD)","variations in sex characteristics","atypical sexual development"],"antonyms":["typical sexual development","binary sex characteristics"]},{"part_of_speech":"noun","definition":"(複数形) 間性の状態の多様性、または間性を持つ人々。","english_definition":"(plural) The diverse range of conditions that fall under the umbrella term 'intersex,' or the individuals who have these conditions.","examples":[{"sentence":"Research on intersexualities is essential to better understand the biological and social aspects of sex development.","translation":"間性に関する研究は、性発達の生物学的および社会的側面をより良く理解するために不可欠です。"},{"sentence":"Advocates for intersexualities are working to end non-consensual medical interventions on intersex infants.","translation":"間性の擁護者たちは、間性の乳児に対する非合意的な医療介入を終わらせるために活動しています。"}],"collocations":["intersex community (間性コミュニティ)","intersex advocacy (間性の擁護)","intersex awareness (間性の認識)","intersex studies (間性研究)"],"synonyms":["intersex people","individuals with intersex variations"],"antonyms":[]}],"etymology":{"value":"\"Inter-\" (間に) + \"sexual\" (性的な) + \"-ities\" (複数形を示す接尾辞)。19世紀後半から20世紀初頭にかけて、生物学および医学の分野で使用され始めた。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪntərsekʃuˈælətiz/","syllables":"in-ter-sex-u-al-i-ties"},"inflection":{"noun_plural":"Intersexualities"},"usage_notes":{"explanation":"\"Intersexualities\" (複数形) は、単に生物学的な状態を指すだけでなく、間性を持つ人々の多様な経験、アイデンティティ、および社会的な課題を含む、より広範な概念を指すために使用されることがあります。医学的な文脈だけでなく、社会学、ジェンダー研究、人権などの分野でも使用されます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Intersexuality is a choice.","correct":"✓ Intersexuality is a biological variation.","note":"Intersexuality は選択ではなく、生まれつきの生物学的な状態です。"},{"incorrect":"✗ All intersex people identify as neither male nor female.","correct":"✓ Intersex people have diverse gender identities, some identify as male, female, both, or neither.","note":"間性の人々は多様なジェンダーアイデンティティを持っており、男性、女性、両方、またはどちらでもないと認識する人もいます。"},{"incorrect":"✗ Intersexuality is the same as being transgender.","correct":"✓ Intersexuality relates to biological sex characteristics, while transgender relates to gender identity.","note":"間性は生物学的な性徴に関連し、トランスジェンダーはジェンダーアイデンティティに関連します。"}],"priority":"★★☆"},"related_words":{"derivatives":["intersex (形容詞/名詞)","intersexuality (名詞 - 単数形)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈で使用されることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Intersexualities\" は、人が生まれたときに、典型的な男性または女性の定義に当てはまらない生殖器または性的構造を持っている状態を指す用語です。これは、さまざまな生物学的要因によって引き起こされる可能性があり、個人の性的発達に影響を与える可能性があります。この用語は、医学、生物学、社会科学などの専門的な文脈でよく使用され、間性者の多様な経験と課題を理解するために重要です。間性者の権利と医療に関する議論で頻繁に登場します。"},"example_sentences":[{"sentence":"The study examined the genetic factors contributing to various intersexualities.","translation":"その研究は、さまざまな間性に寄与する遺伝的要因を調査しました。","type":"noun","meaning_category":"間性の状態の多様性"},{"sentence":"Advocates are working to raise awareness about the challenges faced by individuals with intersexualities.","translation":"擁護者たちは、間性を持つ個人が直面する課題についての意識を高めるために活動しています。","type":"noun","meaning_category":"間性を持つ人々"},{"sentence":"Intersexualities are not a new phenomenon; they have been documented throughout history and across cultures.","translation":"間性は新しい現象ではなく、歴史を通じて、またさまざまな文化において記録されてきました。","type":"noun","meaning_category":"間性の状態の多様性"},{"sentence":"Medical professionals are increasingly recognizing the importance of providing sensitive and informed care to individuals with intersexualities.","translation":"医療専門家は、間性を持つ個人に、思いやりがあり、情報に基づいたケアを提供することの重要性をますます認識しています。","type":"noun","meaning_category":"間性を持つ人々"}]}