{"word":"Passivation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"不動態化、不活性化","english_definition":"The process of making a material passive, especially rendering it less susceptible to corrosion.","examples":[{"sentence":"Passivation of stainless steel increases its resistance to rust.","translation":"ステンレス鋼の不動態化は、錆に対する耐性を高めます。"},{"sentence":"The passivation layer protects the metal from further oxidation.","translation":"不動態化層は、金属をさらなる酸化から保護します。"}],"collocations":["passivation layer (不動態化層)","chemical passivation (化学的不動態化)","surface passivation (表面不動態化)"],"synonyms":["deactivation","inertization","protection"],"antonyms":["activation","corrosion"]}],"etymology":{"value":"The term 'passivation' comes from the word 'passive,' referring to a state of inactivity or resistance. It is derived from the Latin word 'passivus,' meaning 'capable of feeling or suffering.' In the context of materials science, it describes the process of making a material less reactive, as if it were in a 'passive' state.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpæsɪˈveɪʃən/","syllables":"pas-si-va-tion"},"inflection":{"noun_plural":"Passivations"},"usage_notes":{"explanation":"'Passivation' is primarily used in materials science and chemistry to describe the process by which a material becomes less reactive, typically due to the formation of a protective layer on its surface. This term is commonly associated with metals, where passivation prevents corrosion. It can also refer to similar processes in semiconductors and other materials.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The passivation was done by activating the metal.","correct":"✓ The passivation was done by deactivating the metal surface.","note":"Passivation involves making a material less reactive, not more reactive. Therefore, it's about deactivating the surface, not activating it."},{"incorrect":"✗ Passivation is the same as corrosion.","correct":"✓ Passivation prevents corrosion.","note":"Passivation is a process that prevents corrosion, not the process of corrosion itself."}],"priority":"★★☆"},"related_words":{"derivatives":["passivate (verb)","passive (adjective)","passivity (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Passivation' is a technical term used in chemistry and materials science. It describes the process of making a material less reactive, often by forming a protective layer on its surface. This term is most commonly encountered in discussions about corrosion resistance in metals, such as stainless steel. Understanding this term requires some background knowledge in chemistry or materials science."},"example_sentences":[{"sentence":"Electrochemical passivation is used to improve the corrosion resistance of the alloy.","translation":"電気化学的不動態化は、合金の耐食性を向上させるために使用されます。","type":"noun","meaning_category":"不動態化"},{"sentence":"The passivation process involves creating a thin oxide layer on the metal surface.","translation":"不動態化プロセスには、金属表面に薄い酸化物層を作成することが含まれます。","type":"noun","meaning_category":"不動態化"},{"sentence":"Proper passivation is crucial for maintaining the longevity of electronic components.","translation":"適切な不動態化は、電子部品の寿命を維持するために非常に重要です。","type":"noun","meaning_category":"不動態化"}]}