{"word":"Lurchers","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)ルーチャー：特定の種類の狩猟犬の雑種。一般的に、視覚ハウンド（サイトハウンド）と牧羊犬またはテリアの交配種。","english_definition":"(plural noun) A type of mixed-breed dog, typically a cross between a sighthound and a working breed such as a collie or terrier, used for hunting.","examples":[{"sentence":"Lurchers are often used for poaching rabbits and hares.","translation":"ルーチャーはしばしばウサギやノウサギの密猟に使われます。"},{"sentence":"The lurchers took off after the hare, their long legs eating up the ground.","translation":"ルーチャーたちはノウサギを追いかけ、長い脚で地面をどんどん進んでいった。"}],"collocations":["lurcher puppy","working lurcher","bedlington lurcher","deerhound lurcher"],"synonyms":["mongrel","crossbreed","mixed-breed dog"],"antonyms":[]}],"etymology":{"value":"「lurch」という単語（よろめく、傾く）に関連している可能性がある。ルーチャーの不規則な走り方や、獲物を追いかける際の予測不能な動きに由来すると考えられる。あるいは、ロマニー語起源であるという説もある。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɜːrtʃərz/","syllables":"lurch-ers"},"inflection":{"noun_plural":"Lurchers"},"usage_notes":{"explanation":"「Lurcher」は特定の犬種を指す言葉ではなく、視覚ハウンド（サイトハウンド）系の犬種と、牧羊犬やテリアなどのワーキングドッグを交配させた雑種犬を指します。優れた視力とスピードを持ち、狩猟能力が高いのが特徴です。外見や性格は交配する犬種によって大きく異なります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a lurcher puppy from a reputable breeder.","correct":"✓ I bought a lurcher puppy. (Breeders of lurchers are less common, as they are often bred for working ability rather than show.)","note":"ルーチャーは通常、意図的に繁殖される犬種ではないため、血統書付きの「ルーチャー」は存在しません。信頼できるブリーダーから購入するという表現は不自然です。"},{"incorrect":"✗ Lurchers are a recognized breed by the Kennel Club.","correct":"✓ Lurchers are not a recognized breed by the Kennel Club.","note":"ルーチャーは主要な犬種クラブによって公認された犬種ではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_breeds":["Greyhound","Whippet","Collie","Terrier","Bedlington Terrier","Deerhound"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「Lurchers」は、特定の種類の雑種犬を指す専門用語です。犬に詳しい人や、狩猟犬に関心のある人以外には馴染みがないかもしれません。この単語は、視覚ハウンド（サイトハウンド）とワーキングドッグの交配種を指し、その外見や能力は交配する犬種によって大きく異なります。犬種に関する知識がある程度必要となるため、理解するにはやや高度な語彙力が必要です。"},"example_sentences":[{"sentence":"The farmer used his lurchers to control the rabbit population on his land.","translation":"その農家はルーチャーを使って土地のウサギの数を管理していました。","type":"noun","meaning_category":"狩猟犬"},{"sentence":"These lurchers are known for their speed and agility in the field.","translation":"これらのルーチャーは、野原でのスピードと敏捷性で知られています。","type":"noun","meaning_category":"狩猟犬"}]}