{"word":"pin-feather","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"筆毛、鞘毛（さやげ）：成長中の羽毛で、まだ鞘（さや）に包まれているもの。","english_definition":"a developing feather that is still encased in a sheath.","examples":[{"sentence":"The bird was covered in pin-feathers as it was molting.","translation":"その鳥は換羽期で、筆毛で覆われていた。"},{"sentence":"Pin-feathers are more difficult to pluck than mature feathers.","translation":"筆毛は成熟した羽毛よりもむしり取るのが難しい。"}],"collocations":["pluck pin-feathers (筆毛をむしる)","covered in pin-feathers (筆毛で覆われている)"],"synonyms":["blood feather","developing feather"],"antonyms":["mature feather","fully-grown feather"]}],"etymology":{"value":"\"pin\"（針）と \"feather\"（羽毛）の組み合わせ。筆毛が針のように見えることに由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɪnˌfɛðər/","syllables":"pin-feath-er"},"inflection":{"noun_plural":"pin-feathers"},"usage_notes":{"explanation":"Pin-feathers are new feathers that are still developing. They are encased in a protective sheath that is rich in blood supply, hence the alternative name \"blood feather\". They are more sensitive than mature feathers and can cause discomfort to the bird if damaged. Removing pin-feathers during plucking is more difficult and can damage the skin.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bird has many pins on its body.","correct":"✓ The bird has many pin-feathers on its body.","note":"\"Pin\" alone refers to a small, sharp object. Use \"pin-feather\" to specifically refer to the developing feather."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["feather","molting","bird","plumage","quill"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"低頻度 (Low frequency) - 鳥類学や養鶏などの専門分野で使われることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"pin-feather\" refers to a specific stage in the development of a bird's feather. It's a relatively specialized term, primarily used in contexts related to birds, such as ornithology, poultry farming, or pet bird care. Understanding the term requires some familiarity with bird anatomy and the process of molting. It is not a commonly used word in everyday conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The parrot preened its pin-feathers carefully.","translation":"そのオウムは筆毛を丁寧に手入れしていた。","type":"noun","meaning_category":"筆毛"},{"sentence":"The chef removed the pin-feathers from the duck before cooking it.","translation":"シェフは調理する前に鴨から筆毛を取り除いた。","type":"noun","meaning_category":"筆毛"},{"sentence":"The vet examined the bird's plumage, noting the presence of several pin-feathers.","translation":"獣医は鳥の羽毛を検査し、いくつかの筆毛の存在に気づいた。","type":"noun","meaning_category":"筆毛"}]}