{"word":"she-peace","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"女性による平和、女性が主導する平和運動、女性の平和への貢献","english_definition":"Peace achieved or promoted by women; a peace movement led by women; women's contribution to peace.","examples":[{"sentence":"The organization advocates for she-peace, emphasizing the importance of women's involvement in conflict resolution.","translation":"その組織は、女性による平和を提唱し、紛争解決における女性の関与の重要性を強調している。"},{"sentence":"She-peace initiatives often focus on addressing the root causes of conflict and promoting reconciliation.","translation":"女性による平和の取り組みは、紛争の根本原因に対処し、和解を促進することに焦点を当てることが多い。"},{"sentence":"The conference highlighted the role of women in building she-peace around the world.","translation":"会議では、世界中で女性が平和を構築する役割が強調された。"}],"collocations":["building she-peace (女性による平和構築)","promoting she-peace (女性による平和の促進)","advocating for she-peace (女性による平和を提唱する)","she-peace initiatives (女性による平和の取り組み)","she-peace movement (女性による平和運動)"],"synonyms":["women's peace","feminist peace","gendered peace"],"antonyms":["male-dominated peace","patriarchal peace"],"notes":"This term emphasizes the unique perspectives and contributions of women in achieving and maintaining peace. It often involves challenging traditional, male-dominated approaches to conflict resolution."}],"etymology":{"value":"A compound word formed by combining 'she' (referring to women) and 'peace'. The term highlights the specific role and agency of women in peacebuilding.","priority":"★★☆"},"pronunciation":{"ipa":"/ʃiː piːs/","syllables":"shee-peace"},"inflection":{"notes":"Plural form is 'she-peaces'."},"usage_notes":{"explanation":"'She-peace' is a relatively new term used to emphasize the importance of women's participation and leadership in peace processes. It often implies a different approach to peacebuilding, one that prioritizes non-violence, reconciliation, and addressing the root causes of conflict. The term is often used in academic and activist contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The she-peace was achieved through military intervention.","correct":"✓ The she-peace was achieved through dialogue and negotiation.","note":"'She-peace' typically implies non-violent and inclusive approaches to peacebuilding, so it would be contradictory to associate it with military intervention."}],"priority":"★☆☆"},"related_words":{"derivatives":["she (pronoun)","peace (noun)","peacebuilding (noun)","peacekeeping (noun)","feminism (noun)","gender equality (noun)"],"phrases":["women, peace and security (WPS) agenda","gender-sensitive peacebuilding","inclusive peace processes"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - This is a relatively new and specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'She-peace' is a specialized term used in discussions about peacebuilding and gender studies. It signifies peace that is achieved or promoted by women, often emphasizing non-violent and inclusive approaches. Understanding this term requires familiarity with feminist perspectives on peace and conflict resolution."},"example_sentences":[{"sentence":"The documentary explored the impact of she-peace initiatives in post-conflict societies.","translation":"そのドキュメンタリーは、紛争後の社会における女性による平和の取り組みの影響を探求した。","type":"noun","meaning_category":"女性による平和の取り組み"},{"sentence":"She argued that a lasting peace could only be achieved through a she-peace approach.","translation":"彼女は、永続的な平和は女性による平和のアプローチを通じてのみ達成できると主張した。","type":"noun","meaning_category":"女性による平和"},{"sentence":"The she-peace movement has gained momentum in recent years.","translation":"女性による平和運動は近年勢いを増している。","type":"noun","meaning_category":"女性による平和運動"}]}