{"word":"repersuade","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"再び説得する、再説得する","english_definition":"To persuade (someone) again; to persuade (someone) to change their mind back to a previous position.","examples":[{"sentence":"After initially disagreeing, I managed to repersuade him to support the project.","translation":"最初は反対していたが、彼を再説得してプロジェクトを支持してもらうことができた。"},{"sentence":"She tried to repersuade her friend to come to the party, but she remained firm in her decision.","translation":"彼女は友人をパーティーに来るように再説得しようとしたが、友人の決意は固かった。"}],"collocations":["repersuade someone to do something (～するように再説得する)","repersuade someone back (～を元の状態に戻すように再説得する)"],"synonyms":["reconvince","persuade again","talk around again"],"antonyms":["dissuade","unpersuade"]},{"part_of_speech":"verb","transitivity":"vt","definition":"（以前に説得した人を）再び説得して元の意見に戻す","english_definition":"To persuade (someone) to revert to a previously held opinion or course of action.","examples":[{"sentence":"The company had changed its policy, but a customer backlash repersuaded them to revert to the original plan.","translation":"会社は方針を変更したが、顧客からの反発を受け、元の計画に戻るよう再説得された。"},{"sentence":"The politician was repersuaded by his advisors to reconsider his stance on the issue.","translation":"その政治家は顧問たちに説得され、その問題に対する姿勢を再考することにした。"}],"collocations":["repersuade someone to reconsider (再考するように説得する)","repersuade someone to revert (元の状態に戻るように説得する)"],"synonyms":["restore belief","bring back around","reverse persuasion"],"antonyms":[]}],"etymology":{"value":"The word 'repersuade' is formed by adding the prefix 're-' (meaning 'again' or 'back') to the word 'persuade'. It suggests either persuading someone a second time or persuading them to return to a previous belief or action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːpərˈsweɪd/","syllables":"re-per-swade"},"inflection":{"verb_forms":{"present_simple":["repersuade","repersuades"],"past_simple":"repersuaded","past_participle":"repersuaded","present_participle":"repersuading"}},"usage_notes":{"explanation":"'Repersuade' is used when someone has already been persuaded of something, and then either changes their mind or needs to be convinced again. It implies a reversal or a second attempt at persuasion. The word is not as common as 'persuade' or 'convince,' but it is useful in specific contexts where re-convincing is necessary.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I tried to repersuade him, but he was already persuaded.","correct":"✓ I tried to repersuade him, but he had already been persuaded by someone else.","note":"The first sentence is grammatically correct, but semantically redundant. It's better to specify that someone else persuaded him to change his mind."},{"incorrect":"✗ She repersuaded her decision.","correct":"✓ She repersuaded him to change his decision.","note":"'Re-persuade' requires an object (the person being persuaded) and often a specific action or belief to which they are being persuaded."}],"priority":"★★☆"},"related_words":{"derivatives":["repersuasion (noun)"],"phrasal_verbs":[],"related_verbs":["persuade","convince","reconvince"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'repersuade' is a relatively uncommon verb that means to persuade someone again, often to return to a previous belief or course of action. It's used in situations where someone has changed their mind or been convinced of something different, and you are trying to convince them once more. Because it's not a frequently used word, it's more common in formal writing or speech.","priority":"★★☆"},"example_sentences":[{"sentence":"The negotiator had to repersuade the parties involved after the initial agreement fell apart.","translation":"交渉担当者は、最初の合意が崩壊した後、関係者を再説得する必要があった。","type":"general"},{"sentence":"Despite the evidence, it was difficult to repersuade the jury of his innocence.","translation":"証拠があったにもかかわらず、陪審員に彼の無罪を再説得するのは困難だった。","type":"legal"},{"sentence":"The marketing team tried to repersuade customers that the product was worth the higher price.","translation":"マーケティングチームは、製品がより高い価格に見合う価値があると顧客を再説得しようとした。","type":"business"}]}