{"word":"re-ensphere","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"再び球体で囲む、再び球状にする","english_definition":"To enclose or surround again within a sphere; to restore to a spherical shape.","examples":[{"sentence":"The artist carefully re-ensphered the delicate glass sculpture after repairing it.","translation":"芸術家は修理後、繊細なガラス彫刻を注意深く再び球体で囲んだ。"},{"sentence":"The process re-enspheres the gas molecules, creating a stable and contained environment.","translation":"そのプロセスはガス分子を再び球状にし、安定した密閉環境を作り出す。"}],"collocations":[],"synonyms":["encapsulate","enclose","surround","sphere","round"],"antonyms":["uncover","expose","release"]}],"etymology":{"value":"\"re-\" (again) + \"ensphere\" (to enclose in a sphere). \"Ensphere\" is derived from \"en-\" (in, within) + \"sphere\" (a round body).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːɪnˈsfɪər/","syllables":"re-in-sphere"},"inflection":{"verb_forms":{"present_simple":["re-ensphere","re-enspheres"],"past_simple":"re-ensphered","past_participle":"re-ensphered","present_participle":"re-ensphering"}},"usage_notes":{"explanation":"The word \"re-ensphere\" is relatively rare and technical. It implies a process of enclosing something within a sphere again, often after it has been removed or the spherical enclosure has been disrupted. It can be used in both literal and figurative contexts, but is most commonly found in scientific or technical writing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The scientist re-ensphered the data.","correct":"✓ The scientist encapsulated the data.","note":"\"Re-ensphere\" typically refers to physical objects. For abstract concepts like data, \"encapsulate\" is a more appropriate term."}],"priority":"★☆☆"},"related_words":{"derivatives":["ensphere","sphere","spherical","re-","en-"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 're-ensphere' is a highly specialized term, rarely used outside of technical or scientific contexts. It describes the action of enclosing something again within a spherical shape or environment. Understanding this word requires a strong vocabulary and familiarity with scientific concepts. Due to its rarity, it is not commonly encountered in everyday language or general reading materials."},"example_sentences":[{"sentence":"The lab technician had to carefully re-ensphere the sample to prevent contamination.","translation":"実験技師は汚染を防ぐために、サンプルを注意深く再び球体で囲む必要があった。","type":"verb","meaning_category":"再び球体で囲む"},{"sentence":"The machine is designed to re-ensphere the fuel pellets after processing.","translation":"その機械は、処理後に燃料ペレットを再び球状にするように設計されている。","type":"verb","meaning_category":"再び球状にする"}]}