{"word":"greyish-blue-green","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"灰色がかった青緑色の","english_definition":"Having a color that is a mix of grey, blue, and green.","examples":[{"sentence":"The sea was a greyish-blue-green color on that cloudy day.","translation":"その曇りの日、海は灰色がかった青緑色だった。"},{"sentence":"She painted the walls a greyish-blue-green to create a calming atmosphere.","translation":"彼女は落ち着いた雰囲気を作り出すために、壁を灰色がかった青緑色に塗った。"}],"collocations":["greyish-blue-green eyes","greyish-blue-green paint","greyish-blue-green fabric"],"synonyms":["muted teal","dusty turquoise","greyish aquamarine"],"antonyms":[],"notes":"This color is often associated with the sea, sky, or natural landscapes."}],"etymology":{"value":"Combination of the words 'greyish', 'blue', and 'green', indicating a color that is a blend of these three hues.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌɡreɪɪʃ ˈbluː ˈɡriːn/","syllables":"grey-ish blue green"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Greyish-blue-green' is a descriptive adjective used to specify a color that lies between grey, blue, and green. It suggests a muted or toned-down version of these colors, often evoking a sense of calmness or subtlety.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"The car was greyish blue green.","correct":"The car was greyish-blue-green.","note":"Hyphens are important to connect the words and indicate a single color description."}],"priority":"☆☆☆"},"related_words":{"derivatives":[],"related_colors":["grey","blue","green","teal","aquamarine","turquoise"],"priority":"☆☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. This is a very specific color description.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"This term is quite specific and not commonly used in everyday conversation. It's more likely to appear in descriptive writing, art, or design contexts where precise color identification is needed. Understanding the individual colors (grey, blue, green) is helpful in visualizing the combined hue."},"example_sentences":[{"sentence":"The old boat was painted a faded greyish-blue-green.","translation":"その古いボートは色あせた灰色がかった青緑色に塗られていた。","type":"adjective","meaning_category":"color"},{"sentence":"The artist tried to capture the greyish-blue-green of the distant mountains.","translation":"その画家は遠くの山の灰色がかった青緑色を捉えようとした。","type":"adjective","meaning_category":"color"}]}