{"word":"crabber","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"カニ漁師、カニを捕る人","english_definition":"a person who catches crabs, either commercially or recreationally.","examples":[{"sentence":"He worked as a crabber for many years, fishing the Chesapeake Bay.","translation":"彼は長年カニ漁師として働き、チェサピーク湾で漁をしていた。"},{"sentence":"The local crabbers are worried about the declining crab population.","translation":"地元のカニ漁師たちはカニの個体数の減少を心配している。"},{"sentence":"A recreational crabber can catch a limited number of crabs per day.","translation":"趣味でカニを捕る人は、1日に捕獲できるカニの数が制限されている。"}],"collocations":["commercial crabber (商業カニ漁師)","recreational crabber (趣味のカニ漁師)","crabber boat (カニ漁船)","crabber license (カニ漁免許)"],"synonyms":["crab fisherman","crab trapper"],"antonyms":[]}],"etymology":{"value":"'Crab' (カニ) + '-er' (～する人)","priority":"★★★"},"pronunciation":{"ipa":"/ˈkræbər/","syllables":"crab-ber"},"inflection":{"noun_plural":"crabbers"},"usage_notes":{"explanation":"'Crabber' specifically refers to someone who catches crabs. This can be their profession (commercial crabber) or a hobby (recreational crabber). The term is most commonly used in regions where crabbing is a significant activity, such as coastal areas.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a crabber, so he catches fish.","correct":"He is a crabber, so he catches crabs.","note":"Crabbers catch crabs, not fish."}],"priority":"★☆☆"},"related_words":{"derivatives":["crabbing (名詞: カニ漁)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'crabber' is a noun that refers to someone who catches crabs. It is a relatively specific term, primarily used in coastal regions where crab fishing is common. The word is formed by adding the suffix '-er' to the word 'crab', indicating a person who performs the action associated with the base word. Understanding the context of crab fishing is helpful for comprehending the meaning of 'crabber'."},"example_sentences":[{"sentence":"The old crabber knew all the best spots to find blue crabs.","translation":"その年老いたカニ漁師は、アオガニを見つけるのに最適な場所をすべて知っていた。","type":"noun","meaning_category":"カニ漁師"},{"sentence":"Many crabbers use crab pots to catch large numbers of crabs.","translation":"多くのカニ漁師は、大量のカニを捕獲するためにカニかごを使用する。","type":"noun","meaning_category":"カニ漁師"},{"sentence":"The life of a crabber can be challenging due to the unpredictable weather.","translation":"カニ漁師の生活は、予測不可能な天候のために困難なものになることがある。","type":"noun","meaning_category":"カニ漁師"}]}