{"word":"proscribable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"禁止できる、禁じられるべき","english_definition":"deserving to be proscribed; liable to proscription.","examples":[{"sentence":"The organization's activities were deemed proscribable due to their violent nature.","translation":"その組織の活動は、その暴力的な性質から禁止されるべきだと判断された。"},{"sentence":"Some argue that certain forms of speech are proscribable because they incite hatred.","translation":"憎悪を煽る特定の種類の言論は、禁止されるべきだと主張する人もいる。"}],"collocations":["deemed proscribable","arguably proscribable","potentially proscribable"],"synonyms":["bannable","forbidden","outlawed","unlawful","illegitimate"],"antonyms":["allowable","permissible","legal","legitimate","lawful"]}],"etymology":{"value":"proscribe + -able. Proscribe comes from Latin 'proscribere' (to outlaw, publish the name of an outlaw), from pro- 'before' + scribere 'to write'.","priority":"★★☆"},"pronunciation":{"ipa":"/proʊˈskraɪbəbəl/","syllables":"pro-scrib-a-ble"},"inflection":{"adjective_forms":{"comparative":"more proscribable","superlative":"most proscribable"}},"usage_notes":{"explanation":"'Proscribable' is a relatively rare word that describes something that deserves to be banned or outlawed, typically due to being harmful, dangerous, or against established laws or principles. It often appears in legal or political contexts when discussing whether certain actions, groups, or ideas should be prohibited.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The medicine was proscribable by the doctor.","correct":"✓ The medicine was proscribed by the doctor.","note":"'Proscribable' describes something that *can* be proscribed. 'Proscribed' means it *has* been proscribed."},{"incorrect":"✗ The idea is proscribable, but we support it.","correct":"✓ The idea is controversial, but we support it.","note":"If you support an idea, it's unlikely to be accurately described as 'proscribable'."}],"priority":"★★☆"},"related_words":{"derivatives":["proscribe (verb: to forbid, outlaw)","proscription (noun: the act of proscribing; a ban)","proscriptive (adjective: tending to proscribe)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Proscribable' is a formal and uncommon word. It means something that is worthy of being officially banned or forbidden, usually because it is considered dangerous or harmful to society. You'll most likely encounter it in legal or political discussions. It's related to the more common verb 'proscribe', which means to officially forbid something."},"example_sentences":[{"sentence":"The government considered whether the group's activities were proscribable under existing anti-terrorism laws.","translation":"政府は、その団体の活動が既存のテロ対策法の下で禁止されるべきかどうかを検討した。","type":"adjective","meaning_category":"禁止できる"},{"sentence":"Many believe that hate speech is proscribable because of the harm it inflicts on vulnerable communities.","translation":"多くの人々は、ヘイトスピーチは脆弱なコミュニティに与える害のために禁止されるべきだと信じている。","type":"adjective","meaning_category":"禁じられるべき"},{"sentence":"The debate centered on whether the proposed regulations were overly broad and captured conduct that was not truly proscribable.","translation":"議論は、提案された規制が過度に広範であり、真に禁止されるべきではない行為を捉えているかどうかに集中した。","type":"adjective","meaning_category":"禁止できる"}]}