{"word":"edificatory","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"教訓的な、啓発的な、ためになる","english_definition":"providing moral or intellectual instruction; improving the mind or morals.","examples":[{"sentence":"The lecture was highly edificatory, offering new insights into the subject.","translation":"その講義は非常に教訓的で、その主題に関する新たな洞察を提供した。"},{"sentence":"Edificatory literature aims to uplift and enlighten the reader.","translation":"教訓的な文学は、読者を高揚させ、啓発することを目的としている。"},{"sentence":"His speech was intended to be edificatory, but it came across as preachy.","translation":"彼の演説は教訓的であることを意図していたが、説教臭く聞こえた。"}],"collocations":["edificatory lecture (教訓的な講義)","edificatory literature (教訓的な文学)","edificatory speech (教訓的な演説)","edificatory purpose (教訓的な目的)","edificatory value (教訓的な価値)"],"synonyms":["instructive","educational","informative","enlightening","didactic","moralizing","improving","uplifting"],"antonyms":["uninstructive","uninformative","unhelpful","deleterious","harmful","corrupting"]}],"etymology":{"value":"Late Middle English: from Latin *aedificatorius*, from *aedificare* 'build' (from *aedes* 'dwelling' + *facere* 'make'). The sense is 'building up' in a moral or intellectual sense.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛdɪˈfɪkətɔːri/","syllables":"ed-i-fi-ca-to-ry"},"inflection":{"notes":"Adjectives do not inflect in English, but can form comparative and superlative forms (more edificatory, most edificatory)."},"usage_notes":{"explanation":"\"**Edificatory**\" describes something that is intended to improve someone morally or intellectually. It often implies a deliberate effort to provide instruction or guidance. The word can sometimes have a slightly negative connotation if the instruction is perceived as being overly moralizing or preachy. It is more formal and less common than words like \"educational\" or \"instructive\".","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The movie was very entertaining but not very edificatory.","correct":"✓ The movie was very entertaining but not very instructive.","note":"In general conversation, \"instructive\" or \"educational\" are more common choices than \"edificatory\". Use \"edificatory\" when you want to specifically emphasize moral or intellectual improvement."},{"incorrect":"✗ He found the experience edificatory.","correct":"✓ He found the experience edifying.","note":"\"Edifying\" is a more common and natural-sounding synonym for \"edificatory\" when describing an experience."}],"priority":"★★☆"},"related_words":{"derivatives":["edify (verb: to instruct or improve morally or intellectually)","edification (noun: the instruction or improvement of a person morally or intellectually)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (Uncommon word, likely encountered in academic or literary contexts)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"**edificatory**\" is a formal and somewhat rare adjective that describes something that provides moral or intellectual instruction or improvement. It's often used in academic or literary contexts when discussing works that aim to uplift or enlighten the reader. Because it's not a commonly used word, it's important to understand its specific meaning and use it appropriately to avoid sounding pretentious."},"example_sentences":[{"sentence":"The professor's lectures were always edificatory and thought-provoking.","translation":"教授の講義は常に教訓的で、考えさせられるものだった。","type":"general","meaning_category":"教訓的な"},{"sentence":"She found the book to be highly edificatory, offering valuable insights into human nature.","translation":"彼女はその本が非常に教訓的であると感じ、人間の本質に関する貴重な洞察を提供していると感じた。","type":"literature","meaning_category":"啓発的な"},{"sentence":"The museum's exhibits were designed to be both entertaining and edificatory.","translation":"博物館の展示は、娯楽性と教訓性の両方を提供するように設計されていた。","type":"museum","meaning_category":"ためになる"}]}