{"word":"orthographically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"正字法的に、綴り字の規則に従って","english_definition":"in a manner that relates to or follows the rules of orthography (the conventional spelling system of a language).","examples":[{"sentence":"The word is orthographically complex, with several silent letters.","translation":"その単語は正字法的に複雑で、いくつかの黙字が含まれている。"},{"sentence":"The text was checked orthographically to ensure correct spelling.","translation":"テキストは正しい綴りを確認するために、正字法的にチェックされた。"},{"sentence":"Orthographically, the two words are very similar, but they have different meanings.","translation":"正字法的に見ると、その二つの単語は非常に似ているが、意味は異なる。"}],"collocations":["orthographically correct (正字法的に正しい)","orthographically similar (正字法的に類似している)","orthographically distinct (正字法的に明確に区別される)"],"synonyms":["spelling-wise","in terms of spelling","according to spelling rules"],"antonyms":["phonetically","pronunciation-wise"]}],"etymology":{"value":"From \"orthographic\" (relating to orthography) + \"-ally\" (forming adverbs). \"Orthographic\" comes from Greek \"orthos\" (correct, straight) + \"graphē\" (writing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɔːrθəˈɡræfɪkli/","syllables":"or-tho-graph-i-cal-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"\"Orthographically\" is used to describe something in relation to the spelling of words, particularly concerning whether it adheres to the conventional spelling rules of a language. It is often used in linguistics, education, and writing contexts where correct spelling is important.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The word is orthographical complex.","correct":"✓ The word is orthographically complex.","note":"\"Orthographical\" is an adjective, while \"orthographically\" is an adverb. Use the adverb to modify an adjective or verb."}],"priority":"★★☆"},"related_words":{"derivatives":["orthographic (adjective)","orthography (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"orthographically\" is used to describe something in terms of its spelling, especially if it follows the rules of spelling correctly. It's a more technical term that you might find in discussions about language, writing, or education. For example, you might say two words are \"orthographically similar\" if they are spelled in a similar way, even if they sound different. It's not a word you'd use in everyday conversation, but it's useful in more formal or academic contexts."},"example_sentences":[{"sentence":"The software checks documents orthographically.","translation":"そのソフトウェアは文書を正字法的にチェックする。","type":"general","meaning_category":"general"},{"sentence":"The two words are orthographically distinct but phonetically similar.","translation":"その二つの単語は正字法的には異なるが、音声的には類似している。","type":"comparison","meaning_category":"comparison"},{"sentence":"The student struggled to spell the word orthographically.","translation":"その学生は、その単語を正字法的に綴るのに苦労した。","type":"difficulty","meaning_category":"difficulty"}]}