{"word":"Tithebook","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史)十分の一税台帳：教会に納めるべき十分の一税の記録を記載した帳簿","english_definition":"(historical) A book in which tithes (a tenth of one's produce or earnings paid to the church) were recorded.","examples":[{"sentence":"The tithebook provided valuable information about the agricultural practices of the village.","translation":"十分の一税台帳は、村の農業慣行に関する貴重な情報を提供した。"},{"sentence":"Researchers consulted the tithebook to determine the economic status of families in the parish.","translation":"研究者たちは、教区の家族の経済状況を判断するために十分の一税台帳を参照した。"}],"collocations":["consult the tithebook (十分の一税台帳を参照する)","examine the tithebook (十分の一税台帳を調べる)","record in the tithebook (十分の一税台帳に記録する)"],"synonyms":["tithe register","tithe record"],"antonyms":[]}],"etymology":{"value":"'Tithe'（十分の一税）+ 'book'（帳簿）。十分の一税の記録を保管するために使用された帳簿であることを示す複合語。","priority":"★★★"},"pronunciation":{"ipa":"/ˈtaɪðbʊk/","syllables":"ti-the-book"},"inflection":{"noun_plural":"Tithebooks"},"usage_notes":{"explanation":"Tithebooks are historical documents that provide insights into the economic and social history of a region. They were primarily used in Europe, especially during the medieval and early modern periods, to keep track of the tithes owed and paid to the church. These books can reveal information about land ownership, agricultural production, and the wealth distribution within a community.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He found a very old titlebook in the attic.","correct":"✓ He found a very old tithebook in the attic.","note":"'Tithebook' (十分の一税台帳) と 'titlebook' (権利証書) を混同しないように注意してください。"}],"priority":"★★☆"},"related_words":{"derivatives":["tithe (十分の一税)","titheable (十分の一税を課税できる)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 歴史研究や系図学の文脈でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Tithebook' is a specialized term primarily encountered in historical research, genealogy, and related fields. It refers to a historical record of tithes, which were payments (typically a tenth of one's income or produce) made to the church. Understanding this term requires familiarity with historical economic and religious practices. Due to its limited usage and specialized context, it is not part of common vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The local historical society digitized the old tithebook to make it accessible to researchers.","translation":"地元の歴史協会は、研究者がアクセスできるように、古い十分の一税台帳をデジタル化した。","type":"noun","meaning_category":"historical record"},{"sentence":"Analysis of the tithebook revealed a significant increase in wheat production during that period.","translation":"十分の一税台帳の分析により、その期間中の小麦生産量が大幅に増加したことが明らかになった。","type":"noun","meaning_category":"historical document"}]}