{"word":"transcoding","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"トランスコーディング","english_definition":"The process of converting media from one encoding format to another.","examples":[{"sentence":"Transcoding is necessary to make the video compatible with different devices.","translation":"ビデオをさまざまなデバイスに対応させるには、トランスコーディングが必要です。"},{"sentence":"The software supports transcoding of various video and audio formats.","translation":"そのソフトウェアは、さまざまなビデオおよびオーディオ形式のトランスコーディングをサポートしています。"}],"collocations":["video transcoding","audio transcoding","real-time transcoding","batch transcoding"],"synonyms":["encoding conversion","format conversion"],"antonyms":[]}],"etymology":{"value":"The word \"transcoding\" is a combination of \"trans-\" (meaning across or beyond) and \"coding\" (referring to the process of encoding data).","priority":"★★★"},"pronunciation":{"ipa":"/trænsˈkoʊdɪŋ/","syllables":"trans-cod-ing"},"inflection":{"noun_plural":"transcodings"},"usage_notes":{"explanation":"Transcoding is primarily used in the context of digital media, such as video and audio. It's essential for ensuring compatibility across different devices, platforms, and networks.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Transcoding is the same as encoding.","correct":"✓ Transcoding involves decoding and then re-encoding the media.","note":"Transcoding is not the same as encoding. Encoding is the process of converting data into a specific format, while transcoding involves converting from one encoded format to another."}],"priority":"★★☆"},"related_words":{"derivatives":["transcode (verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Transcoding is a technical term primarily used in the field of digital media and computer science. It refers to the process of converting digital media files (such as video or audio) from one format or encoding to another. This is often necessary to ensure compatibility with different devices, software, or bandwidth limitations. The term is generally understood by professionals working with digital media, but may not be familiar to the general public."},"example_sentences":[{"sentence":"The server is busy transcoding the video files for mobile devices.","translation":"サーバーは、モバイルデバイス用のビデオファイルのトランスコーディングでビジー状態です。","type":"noun","meaning_category":"トランスコーディング"},{"sentence":"Real-time transcoding allows users to stream video content on devices with limited bandwidth.","translation":"リアルタイムトランスコーディングにより、ユーザーは帯域幅が制限されたデバイスでビデオコンテンツをストリーミングできます。","type":"noun","meaning_category":"トランスコーディング"}]}