{"word":"lexicality","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(言語学)語彙性、語彙らしさ：ある文字列が、既存の語彙項目（単語、句、イディオムなど）として認識される度合い。","english_definition":"(linguistics) The degree to which a string of sounds or letters is recognized as a pre-existing lexical item (word, phrase, idiom, etc.).","examples":[{"sentence":"The lexicality of 'unblick' is low, as it is not a recognized word in English.","translation":"「unblick」という文字列の語彙性は低い。なぜなら、それは英語で認識された単語ではないからだ。"},{"sentence":"The high lexicality of 'kick the bucket' makes it easily understood as an idiom.","translation":"「kick the bucket」という文字列の語彙性が高いので、イディオムとして容易に理解される。"},{"sentence":"Lexicality plays a crucial role in word recognition and language processing.","translation":"語彙性は、単語の認識と言語処理において重要な役割を果たす。"}],"collocations":["high lexicality (高い語彙性)","low lexicality (低い語彙性)","degree of lexicality (語彙性の度合い)","lexicality effect (語彙性効果)","lexicality decision task (語彙性判断課題)"],"synonyms":["wordlikeness","lexical quality","vocabulary status"],"antonyms":["non-lexicality","non-word status"]},{"part_of_speech":"noun","definition":"(心理学)語彙性：心理学実験において、刺激が単語であるか非単語であるかを区別する特性。","english_definition":"(psychology) In psychological experiments, the property of a stimulus being a word as opposed to a non-word.","examples":[{"sentence":"The study examined the effect of lexicality on reaction time in a word recognition task.","translation":"その研究は、単語認識課題における反応時間に対する語彙性の効果を調べた。"},{"sentence":"Participants were asked to make a lexicality decision for each presented stimulus.","translation":"参加者は、提示された各刺激について語彙性判断を行うように求められた。"},{"sentence":"The lexicality manipulation allowed researchers to isolate the cognitive processes involved in accessing lexical memory.","translation":"語彙性の操作により、研究者は語彙記憶へのアクセスに関わる認知プロセスを特定することができた。"}],"collocations":["lexicality effect (語彙性効果)","lexicality decision (語彙性判断)","lexicality manipulation (語彙性操作)","lexicality task (語彙性課題)"],"synonyms":["word status","word/non-word distinction"],"antonyms":["non-lexicality","non-word status"]}],"etymology":{"value":"Derived from 'lexical' (relating to the vocabulary of a language) + '-ity' (a suffix denoting a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌlɛksɪˈkælɪti/","syllables":"lex-i-cal-i-ty"},"inflection":{"noun_plural":"lexicalities"},"usage_notes":{"explanation":"'Lexicality' refers to the quality of being a recognized word or lexical item. It is often used in linguistics and psychology to describe how easily a string of letters or sounds is processed as a meaningful unit. In psychology, lexicality is often manipulated in experiments to study word recognition and memory.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lexicality of the sentence was high.","correct":"✓ The grammaticality of the sentence was high.","note":"'Lexicality' refers to the word-like quality of individual words or strings, not entire sentences. For sentences, 'grammaticality' (correctness of grammar) is more appropriate."},{"incorrect":"✗ Lexicality is the same as meaning.","correct":"✓ Lexicality is related to, but not the same as, meaning.","note":"Lexicality refers to whether something is recognized as a word, while meaning refers to the semantic content of that word. A string can have high lexicality but still be meaningless (e.g., a nonsense word that sounds like a real word)."}],"priority":"★★☆"},"related_words":{"derivatives":["lexical (adjective)","lexically (adverb)","lexicon (noun)"],"related_terms":["word frequency","semantic priming","phonological awareness","morphology"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lexicality' is a technical term used in linguistics and psychology. It refers to the degree to which a string of sounds or letters is recognized as a real word or part of the vocabulary. It's often used in research contexts when studying how people process language and recognize words. The term is not commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The high **lexicality** of common words allows for rapid processing.","translation":"一般的な単語の高い語彙性により、迅速な処理が可能になる。","type":"noun","meaning_category":"語彙性 (linguistics)"},{"sentence":"The **lexicality** effect demonstrates that people respond faster to real words than to non-words.","translation":"語彙性効果は、人々が非単語よりも実際の単語に対してより速く反応することを示している。","type":"noun","meaning_category":"語彙性 (psychology)"},{"sentence":"The researchers controlled for **lexicality** when designing the experiment.","translation":"研究者たちは、実験を設計する際に語彙性を考慮した。","type":"noun","meaning_category":"語彙性 (general)"}]}