{"word":"cultivar-dependent","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"品種依存性の、栽培品種に依存する","english_definition":"Relating to or characterized by a dependence on the specific cultivar (cultivated variety) of a plant. This means that the trait, characteristic, or behavior being described is significantly influenced or determined by the plant's specific cultivar.","examples":[{"sentence":"Disease resistance in this crop is cultivar-dependent; some cultivars are highly resistant, while others are susceptible.","translation":"この作物の病害抵抗性は品種依存性であり、一部の品種は非常に抵抗性がありますが、他の品種は感受性があります。"},{"sentence":"The flowering time of these plants is cultivar-dependent, varying by several weeks between different varieties.","translation":"これらの植物の開花時期は品種依存性であり、品種によって数週間異なります。"},{"sentence":"Nutrient requirements can be cultivar-dependent, so it's important to research the specific needs of your chosen variety.","translation":"栄養要求量は品種依存性である可能性があるため、選択した品種の特定のニーズを調査することが重要です。"}],"collocations":["cultivar-dependent resistance","cultivar-dependent yield","cultivar-dependent flowering time","cultivar-dependent susceptibility"],"synonyms":["variety-specific","strain-dependent","genotype-dependent"],"antonyms":["cultivar-independent","variety-independent","strain-independent"]}],"etymology":{"value":"The term is formed by combining \"cultivar\" (a cultivated variety of a plant) with \"dependent,\" indicating that something is reliant on the specific cultivar.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkʌltɪˌvɑːr dɪˈpɛndənt/","syllables":"cul-ti-var-de-pen-dent"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are not commonly used with this term due to its specific meaning."},"usage_notes":{"explanation":"'Cultivar-dependent' is used in agricultural, horticultural, and botanical contexts to describe traits or characteristics that vary significantly between different cultivars of the same species. This term is important for understanding how genetic variation within a species can influence its behavior, performance, or response to environmental factors.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The effect is species-dependent, not cultivar-dependent.","correct":"✓ The effect is cultivar-dependent, not species-dependent.","note":"Ensure that the dependence is truly on the cultivar level, not a broader species level. If the trait varies between species, 'species-dependent' is more accurate."},{"incorrect":"✗ This trait is always cultivar-dependent.","correct":"✓ This trait can be cultivar-dependent in some cases.","note":"Avoid overgeneralization. Not all traits are cultivar-dependent; some may be influenced by environmental factors or other genetic factors."}],"priority":"★★☆"},"related_words":{"derivatives":["cultivar","dependent","dependence"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - specialized vocabulary used in scientific or technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cultivar-dependent' is a specialized term used in botany, horticulture, and agriculture. It describes a trait or characteristic that is significantly influenced by the specific cultivated variety (cultivar) of a plant. Understanding this term requires knowledge of plant biology and the concept of cultivars. It is typically encountered in scientific literature, agricultural reports, or specialized gardening guides."},"example_sentences":[{"sentence":"The level of antioxidants in blueberries is highly cultivar-dependent.","translation":"ブルーベリーの抗酸化物質のレベルは、品種によって大きく異なります。","type":"adjective","meaning_category":"品種依存性の"},{"sentence":"Herbicide resistance can be cultivar-dependent, requiring careful selection of varieties for weed control.","translation":"除草剤耐性は品種依存性である可能性があり、雑草防除のために品種を慎重に選択する必要があります。","type":"adjective","meaning_category":"品種依存性の"},{"sentence":"Storage life of apples is often cultivar-dependent, with some varieties lasting much longer than others.","translation":"リンゴの貯蔵寿命は品種依存性であることが多く、品種によっては他の品種よりもはるかに長く貯蔵できます。","type":"adjective","meaning_category":"品種依存性の"}]}