{"word":"whoredom","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"売春、不品行、不貞","english_definition":"sexual immorality, especially on the part of a woman; prostitution or promiscuity.","examples":[{"sentence":"The preacher condemned whoredom from the pulpit.","translation":"牧師は説教壇から売春を非難した。"},{"sentence":"In the past, whoredom was often severely punished.","translation":"昔は、売春はしばしば厳しく罰せられた。"},{"sentence":"The novel explores themes of sin and whoredom.","translation":"その小説は罪と不品行をテーマにしている。"}],"collocations":["commit whoredom (売春を行う)","practice whoredom (売春を行う)","condemn whoredom (売春を非難する)"],"synonyms":["prostitution","fornication","adultery","lewdness","immorality","licentiousness","promiscuity"],"antonyms":["chastity","virtue","purity","fidelity"]}],"etymology":{"value":"Old English *hordōm*, from *hōre* (whore) + *-dōm* (suffix denoting state, condition, or domain).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɔːrdəm/","syllables":"whore-dom"},"inflection":{"noun_plural":"whoredoms"},"usage_notes":{"explanation":"'Whoredom' is a somewhat archaic and moralistic term for sexual immorality, particularly on the part of a woman. It often carries strong negative connotations and is associated with religious or traditional views on sexual behavior. In modern usage, more neutral terms like 'promiscuity' or 'sexual immorality' are generally preferred.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He accused her of whoredom because she had many friends.","correct":"✓ He wrongly accused her of whoredom because she had many friends.","note":"Having many friends is not equivalent to whoredom. The term refers to sexual activity outside of marriage. The accusation is likely unfounded and unfair."},{"incorrect":"✗ Whoredom is a good way to make money.","correct":"✓ Prostitution is sometimes seen as a way to make money, but it has many negative consequences.","note":"While prostitution may be a means of income for some, it is associated with exploitation, health risks, and social stigma. It is not generally considered a 'good' way to make money."}],"priority":"★☆☆"},"related_words":{"derivatives":["whore (名詞: 売春婦)","whorish (形容詞: 売春婦のような、不品行な)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'whoredom' is relatively uncommon in modern English and is typically encountered in older texts or discussions of morality and religion. Its usage often implies a judgmental or critical perspective on sexual behavior outside of marriage. Understanding the term requires familiarity with historical and cultural contexts where such judgments were more prevalent."},"example_sentences":[{"sentence":"The king's advisor warned him against the dangers of whoredom and excess.","translation":"王の顧問は、王に売春と過度の浪費の危険について警告した。","type":"noun","meaning_category":"sexual immorality"},{"sentence":"The play depicted the tragic consequences of whoredom in a strict society.","translation":"その劇は、厳格な社会における売春の悲劇的な結果を描いた。","type":"noun","meaning_category":"sexual immorality"},{"sentence":"She was ostracized by the community for her alleged whoredom.","translation":"彼女は、噂された不品行のために地域社会から追放された。","type":"noun","meaning_category":"sexual immorality"}]}