{"word":"historicoprophetic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"歴史的預言の、歴史的預言に関する","english_definition":"Relating to or characterized by a method of interpreting prophecy that sees it as unfolding throughout history.","examples":[{"sentence":"The historicoprophetic approach to biblical interpretation views the book of Revelation as a symbolic representation of the entire sweep of Christian history.","translation":"聖書解釈への歴史的預言的アプローチは、ヨハネの黙示録をキリスト教史全体の象徴的な表現と見なします。"}],"collocations":["historicoprophetic interpretation","historicoprophetic approach","historicoprophetic view"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Historic' + 'prophetic'. A combination of the terms 'historic' and 'prophetic', reflecting the interpretation of prophecy as it unfolds throughout history.","priority":"★★★"},"pronunciation":{"ipa":"/hɪˌstɒrɪkoʊprəˈfɛtɪk/","syllables":"hi-stor-i-co-pro-phet-ic"},"inflection":{"notes":"Adjective, no inflections"},"usage_notes":{"explanation":"The term 'historicoprophetic' is primarily used in theological contexts, specifically within certain Christian traditions, to describe a particular way of interpreting biblical prophecies. This method understands prophecies as having a continuous fulfillment throughout history, rather than being limited to a specific event or time period.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["historicism","prophecy","prophetic"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - specialized term.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'historicoprophetic' is a highly specialized term primarily used in theological discussions, particularly within certain Christian traditions. It describes a method of interpreting biblical prophecies as unfolding continuously throughout history. Due to its niche usage and complex meaning, it is not commonly encountered outside of these specific contexts."},"example_sentences":[{"sentence":"The preacher presented a historicoprophetic interpretation of the Book of Daniel.","translation":"牧師はダニエル書の歴史的預言的解釈を提示しました。","type":"adjective","meaning_category":"歴史的預言の"}]}