{"word":"Uzara","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ウツァラ：南アフリカ原産のキョウチクトウ科の植物で、伝統医学で下痢、疝痛、月経困難症などの治療に用いられる。根は薬効成分を含み、抽出物や製剤として利用される。","english_definition":"Uzara is a plant in the Apocynaceae family native to South Africa. It is used in traditional medicine to treat conditions such as diarrhea, colic, and dysmenorrhea. The root contains medicinal compounds and is used in extracts and preparations.","examples":[{"sentence":"Uzara is traditionally used in South Africa to treat digestive ailments.","translation":"ウツァラは伝統的に南アフリカで消化器系の疾患の治療に用いられています。"},{"sentence":"The root of the Uzara plant contains compounds with anti-diarrheal properties.","translation":"ウツァラの根には、止瀉作用のある化合物が含まれています。"}],"collocations":["Uzara root (ウツァラの根)","Uzara extract (ウツァラ抽出物)","traditional Uzara medicine (伝統的なウツァラ医学)"],"synonyms":["なし"],"antonyms":["なし"]}],"etymology":{"value":"「Uzara」という名前は、この植物に対する現地の名前（おそらくズールー語またはコーサ語）に由来すると考えられています。","priority":"★★☆"},"pronunciation":{"ipa":"/uˈzɑːrə/","syllables":"U-za-ra"},"inflection":{"notes":"単数形のみ"},"usage_notes":{"explanation":"「Uzara」は、主に薬用植物としての文脈で使用されます。伝統医学、植物学、薬学などの分野で言及されることがあります。一般的な会話ではあまり使われません。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought some uzara for my garden.","correct":"✓ I bought some flowers for my garden.","note":"Uzaraは一般的な園芸植物ではありません。薬用目的で使用されることが多いです。"}],"priority":"★☆☆"},"related_words":{"derivatives":["uzarin (ウツァリン：ウツァラに含まれる配糖体)"],"phrasal_verbs":["なし"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「Uzara」は、南アフリカ原産の薬用植物の名前です。伝統医学で特定の症状の治療に用いられることがあり、薬学や植物学の分野で言及されることがあります。一般的な単語ではないため、専門的な知識がない限り、日常会話で使用されることはほとんどありません。"},"example_sentences":[{"sentence":"The efficacy of Uzara in treating diarrhea has been studied.","translation":"下痢の治療におけるウツァラの有効性が研究されています。","type":"noun","meaning_category":"薬用植物"},{"sentence":"Traditional healers in South Africa use Uzara to alleviate menstrual pain.","translation":"南アフリカの伝統的な治療師は、月経痛を緩和するためにウツァラを使用します。","type":"noun","meaning_category":"薬用植物"}]}