{"word":"publicly-determined","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"公的に決定された、公衆によって決定された","english_definition":"determined or decided by the public or through a public process.","examples":[{"sentence":"The budget for the new park was publicly-determined through a series of town hall meetings.","translation":"新しい公園の予算は、一連のタウンホールミーティングを通じて公的に決定されました。"},{"sentence":"The selection of the winning design was publicly-determined via an online vote.","translation":"最優秀デザインの選定は、オンライン投票によって公的に決定されました。"},{"sentence":"The policy changes were publicly-determined after extensive consultation with community stakeholders.","translation":"政策変更は、地域社会の利害関係者との広範な協議を経て公的に決定されました。"}],"collocations":["publicly-determined budget (公的に決定された予算)","publicly-determined policy (公的に決定された政策)","publicly-determined outcome (公的に決定された結果)","publicly-determined process (公的に決定されたプロセス)"],"synonyms":["democratically-determined","collectively-decided","community-driven","openly-decided"],"antonyms":["privately-determined","secretly-decided","unilaterally-decided","authoritatively-determined"]}],"etymology":{"value":"The word is formed by combining 'publicly' (in a public manner) with 'determined' (decided or settled).","priority":"★★★"},"pronunciation":{"ipa":null,"syllables":"pub-lic-ly-de-ter-mined"},"inflection":{"notes":"This is an adjective and does not have inflections like verbs or nouns."},"usage_notes":{"explanation":"'Publicly-determined' is used to describe processes, decisions, or outcomes that are the result of public input, participation, or voting. It emphasizes that the decision-making process was transparent and involved the community or general public. It is often used in the context of government, policy-making, and community projects.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The publicly determined.","correct":"✓ The decision was publicly-determined.","note":"'Publicly-determined' is an adjective and needs to modify a noun. It cannot stand alone as a sentence."},{"incorrect":"✗ public determined","correct":"✓ publicly-determined","note":"The adverb 'publicly' is needed to modify the verb 'determined', indicating how the determination was made."}],"priority":"★★☆"},"related_words":{"derivatives":["public (noun, adjective)","determine (verb)","determination (noun)","publicly (adverb)"],"phrases":["public participation","public consultation","democratic process","community involvement"],"priority":"★★★"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency. The term is relatively specialized and not commonly used in everyday conversation.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Publicly-determined' means that something has been decided by the public, usually through a process where people can give their opinions or vote. It's often used when talking about government decisions or community projects to show that the decision was made openly and with the involvement of the people it affects. This term is more formal and less common in everyday conversation, so you're more likely to see it in news articles or official documents."},"example_sentences":[{"sentence":"The city council announced that the location of the new library would be publicly-determined through a series of community workshops.","translation":"市議会は、新しい図書館の場所は、一連の地域社会ワークショップを通じて公的に決定されると発表しました。","type":"example","meaning_category":"General Usage"},{"sentence":"The standards for air quality were publicly-determined after a lengthy debate involving scientists, environmental groups, and local residents.","translation":"大気質の基準は、科学者、環境団体、および地域住民が参加する長年の議論の末、公的に決定されました。","type":"example","meaning_category":"Policy Making"},{"sentence":"The curriculum for the new school was publicly-determined based on feedback from parents, teachers, and students.","translation":"新しい学校のカリキュラムは、保護者、教師、および生徒からのフィードバックに基づいて公的に決定されました。","type":"example","meaning_category":"Education"}]}