{"word":"Anaerobia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"嫌気性生物","english_definition":"Organisms that do not require oxygen for growth. They may react negatively or even die if oxygen is present.","examples":[{"sentence":"Anaerobia are commonly found in soil, water, and the digestive tracts of animals.","translation":"嫌気性生物は一般的に土壌、水、および動物の消化管に見られる。"}],"collocations":["obligate anaerobia","facultative anaerobia"],"synonyms":["anaerobe"],"antonyms":["aerobe"]}],"etymology":{"value":"Derived from the Greek words 'an-' (not), 'aer' (air), and 'bios' (life), indicating life without air.","priority":"★★☆"},"pronunciation":{"ipa":"ˌænəˈroʊbiə","syllables":"An-aer-o-bi-a"},"inflection":{"noun_plural":"Anaerobias"},"usage_notes":{"explanation":"Anaerobia refers to a group of microorganisms that do not require oxygen for growth. They are classified based on their response to oxygen, such as obligate anaerobes (which cannot survive in the presence of oxygen) and facultative anaerobes (which can grow with or without oxygen).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Anaerobia is a type of bacteria that needs oxygen to survive.","correct":"✓ Anaerobia is a type of bacteria that does not need oxygen to survive.","note":"Anaerobia do not require oxygen to survive."}],"priority":"★★☆"},"related_words":{"derivatives":["anaerobic (adjective)","anaerobically (adverb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Anaerobia' refers to organisms that thrive in the absence of oxygen. These organisms are crucial in various environmental processes and can be found in diverse habitats such as soil, deep-sea environments, and within the bodies of animals. Understanding anaerobia is important in fields like microbiology, medicine, and environmental science."},"example_sentences":[{"sentence":"Some species of Anaerobia are used in industrial processes like biogas production.","translation":"嫌気性生物のいくつかの種は、バイオガス生産のような工業プロセスで使用される。","type":"general","meaning_category":"industrial processes"},{"sentence":"The growth of Anaerobia in wounds can lead to serious infections.","translation":"創傷における嫌気性生物の成長は、深刻な感染症につながる可能性がある。","type":"medical","meaning_category":"medical"}]}