{"word":"corecipient","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"共同受領者、共同受取人","english_definition":"A person who receives something jointly with another or others.","examples":[{"sentence":"The prize was awarded to the corecipients of the research grant.","translation":"その賞は研究助成金の共同受領者に授与されました。"},{"sentence":"The corecipients of the inheritance had to agree on how to divide the assets.","translation":"相続の共同受取人は、資産をどのように分割するかについて合意する必要がありました。"}],"collocations":["award corecipient","inheritance corecipient","grant corecipient"],"synonyms":["joint recipient","shared recipient","cobeneficiary"],"antonyms":["sole recipient","single recipient"]}],"etymology":{"value":"The word \"corecipient\" is formed by combining the prefix \"co-\" (meaning \"jointly\" or \"together\") with the word \"recipient\" (meaning \"one who receives\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkoʊrɪˈsɪpiənt/","syllables":"co-re-cip-i-ent"},"inflection":{"noun_plural":"corecipients"},"usage_notes":{"explanation":"\"Corecipient\" is used to describe individuals who share in the receipt of something, such as an award, grant, inheritance, or benefit. It indicates that the item or benefit is not received by one person alone but is shared among multiple individuals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a corecipient of the award, but he did all the work.","correct":"✓ He is a recipient of the award, and he did most of the work.","note":"If one person did almost all the work, it might be more accurate to describe them as the main recipient, even if others are listed as corecipients."},{"incorrect":"✗ The corecipient was surprised to find they had to share the prize.","correct":"✓ The recipients were surprised to find they had to share the prize.","note":"The term 'corecipient' implies that the sharing aspect was known beforehand. If the sharing was unexpected, 'recipients' is more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["co- (prefix)","recipient"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"corecipient\" is a relatively uncommon term used in formal contexts to describe someone who shares the receipt of something with others. It's often used in legal, academic, or professional settings when discussing awards, grants, or inheritances that are jointly received. Understanding the prefix \"co-\" is helpful in deciphering the meaning."},"example_sentences":[{"sentence":"The two scientists were named corecipients of the Nobel Prize in Physics.","translation":"その二人の科学者は、ノーベル物理学賞の共同受賞者に指名された。","type":"noun","meaning_category":"共同受領者"},{"sentence":"As corecipients of the grant, they were jointly responsible for the project's success.","translation":"助成金の共同受領者として、彼らはプロジェクトの成功に対して共同で責任を負っていた。","type":"noun","meaning_category":"共同受領者"}]}