{"word":"underwarp","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(織物)下縦糸、下地縦糸","english_definition":"The lower warp in a fabric, especially one that is more complex or layered.","examples":[{"sentence":"The intricate pattern relied on the careful manipulation of both the warp and the underwarp.","translation":"その複雑な模様は、縦糸と下縦糸の注意深い操作にかかっていた。"},{"sentence":"The underwarp provided the structural support for the decorative weft threads.","translation":"下縦糸は、装飾的な横糸を支える構造的な役割を果たした。"}],"collocations":["woven underwarp","strong underwarp","complex underwarp"],"synonyms":["warp","ground warp","foundation warp"],"antonyms":["weft","overwarp"]}],"etymology":{"value":"'Under-' (below) + 'warp' (the threads stretched lengthwise on a loom).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʌndərwɔːrp/","syllables":"un-der-warp"},"inflection":{"noun_plural":"underwarps"},"usage_notes":{"explanation":"'Underwarp' is a technical term primarily used in the context of weaving and textile production. It refers to the lower layer of warp threads in a fabric, especially when the fabric has multiple layers or a complex structure. It is less commonly used than 'warp' itself.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The underwarp was used as the main design element.","correct":"✓ The weft was used as the main design element.","note":"The underwarp typically provides structural support, while the weft often forms the visible design. Using the underwarp as the main design element would be unusual."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Underwarp' is a specialized term related to weaving. It's unlikely to be encountered outside of technical discussions or texts on textile production. Understanding requires knowledge of weaving processes and terminology."},"example_sentences":[{"sentence":"The strength of the fabric depended on the tension of the underwarp.","translation":"生地の強度は、下縦糸の張力にかかっていた。","type":"noun","meaning_category":"織物"},{"sentence":"The weaver carefully adjusted the underwarp to create the desired texture.","translation":"織工は、望む質感を作り出すために、下縦糸を注意深く調整した。","type":"noun","meaning_category":"織物"}]}