{"word":"unstatuesque","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"彫像的でない、彫像のような美しさを持たない","english_definition":"Not having the beauty or imposing appearance of a statue; lacking the qualities of a statue.","examples":[{"sentence":"Her figure was described as unstatuesque, lacking the classical proportions often depicted in sculptures.","translation":"彼女の体型は彫像的ではなく、彫刻に描かれるような古典的なプロポーションに欠けていると評された。"},{"sentence":"Despite her talent, her unstatuesque appearance made it difficult for her to get roles in historical dramas.","translation":"才能があるにもかかわらず、彼女の彫像的でない外見は、時代劇で役を得るのを難しくした。"}],"collocations":["unstatuesque figure","unstatuesque appearance","unstatuesque build"],"synonyms":["homely","plain","unattractive","ordinary","unimposing"],"antonyms":["statuesque","beautiful","imposing","striking","elegant"]}],"etymology":{"value":"Derived from \"statuesque\" (resembling a statue, especially in dignity, pose, or beauty) with the prefix \"un-\" (not).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˌstætʃuˈɛsk/","syllables":"un-stat-u-esque"},"inflection":{"adjective_forms":{"comparative":"more unstatuesque","superlative":"most unstatuesque"}},"usage_notes":{"explanation":"\"Unstatuesque\" is used to describe someone or something that does not possess the qualities associated with a statue, such as a dignified pose, striking beauty, or imposing appearance. It often implies a lack of classical or idealized beauty.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She was unstatuesque because she was very tall.","correct":"✓ She was unstatuesque because her proportions were not classically balanced.","note":"Being tall does not necessarily make someone unstatuesque. The term refers to a lack of idealized or classical beauty, often related to proportions or posture."}],"priority":"★★☆"},"related_words":{"derivatives":["statuesque (adjective: resembling a statue, especially in dignity, pose, or beauty)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unstatuesque\" is a relatively uncommon word used to describe someone or something that lacks the qualities of a statue, such as a dignified or imposing appearance, or classical beauty. It is formed by adding the prefix \"un-\" to \"statuesque,\" which means resembling a statue. The word is often used in literary or descriptive contexts. Understanding the meaning of \"statuesque\" is essential to understanding \"unstatuesque.\""},"example_sentences":[{"sentence":"Her unstatuesque frame made her an unlikely candidate for the role of a Greek goddess.","translation":"彼女の彫像的でない体格は、ギリシャの女神の役にはふさわしくないように思われた。","type":"adjective","meaning_category":"appearance"},{"sentence":"The dancer's movements were graceful, but her overall appearance was unstatuesque.","translation":"ダンサーの動きは優雅だったが、全体的な外見は彫像的ではなかった。","type":"adjective","meaning_category":"appearance"},{"sentence":"Despite her unstatuesque build, she possessed a captivating charm.","translation":"彼女は彫像的ではない体格にもかかわらず、人を魅了する魅力を持っていた。","type":"adjective","meaning_category":"appearance"}]}