{"word":"substantivalism","priority":"低","meanings":[{"part_of_speech":"名詞","definition":"実体主義：空間や時間が、それ自体で独立した実体であるという哲学的な立場。","english_definition":"The philosophical position that space and time are substances in their own right, existing independently of the objects and events that occupy them.","examples":[{"sentence":"Substantivalism posits that space is not merely a relation between objects, but a real entity.","translation":"実体主義は、空間は単に物体間の関係ではなく、現実の存在であると仮定する。"},{"sentence":"The debate between substantivalism and relationalism is central to understanding the nature of spacetime.","translation":"実体主義と関係主義の間の議論は、時空の性質を理解する上で中心となる。"}],"collocations":["spatial substantivalism (空間実体主義)","temporal substantivalism (時間実体主義)","relationalism vs. substantivalism (関係主義対実体主義)"],"synonyms":["absolutism (絶対主義 - 空間・時間に関する哲学において)"],"antonyms":["relationalism (関係主義 - 空間や時間は物体間の関係に依存するという立場)"],"related_terms":["absolute space (絶対空間)","absolute time (絶対時間)","spacetime (時空)","Leibniz's Law (ライプニッツの法則)","Newtonian physics (ニュートン物理学)","general relativity (一般相対性理論)"]}],"etymology":{"value":"'Substantival'（実体的な）+ '-ism'（主義）。'Substantival'は'substance'（実体）に由来する。","priority":"中"},"pronunciation":{"notes":"通常、学術的な文脈で使用されるため、一般的な発音記号は提供されていません。"},"usage_notes":{"explanation":"Substantivalismは、主に哲学、特に空間と時間の哲学において用いられる専門用語です。この立場は、空間と時間が物理的な物体や出来事とは独立して存在するという考え方を主張します。対照的な立場は関係主義であり、これは空間と時間は物体間の関係によって定義されると主張します。この概念は、ニュートン力学と一般相対性理論の解釈において重要な役割を果たします。","priority":"高"},"level_frequency":{"priority":"低","notes":"学術的な文脈以外ではほとんど使用されません。"},"readability_explanation":{"level":"高","text":"「実体主義」は、空間や時間が物体や出来事とは独立して存在する実体であるという哲学的な考え方です。これは、空間や時間は物体間の関係によってのみ定義されるとする「関係主義」とは対照的です。この概念は、物理学や哲学の高度な議論で現れます。"},"example_sentences":[{"sentence":"One argument for substantivalism is that it provides a straightforward explanation for inertial effects.","translation":"実体主義の議論の一つは、慣性効果に対する直接的な説明を提供することである。","type":"説明","meaning_category":"哲学"},{"sentence":"Critics of substantivalism often argue that it introduces unnecessary metaphysical baggage.","translation":"実体主義の批判者は、それが不必要な形而上学的負担をもたらすと主張することが多い。","type":"議論","meaning_category":"哲学"}]}