{"word":"Fatimid","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ファーティマ朝 (909年 - 1171年): 北アフリカを支配したイスラム教シーア派の王朝。カリフを称した。","english_definition":"A member of the Fatimid dynasty, an Ismaili Shia caliphate that ruled a large area of North Africa, from 909 to 1171 AD.","examples":[{"sentence":"The Fatimids established their capital in Cairo.","translation":"ファーティマ朝はカイロに首都を建設した。"},{"sentence":"Fatimid art and architecture flourished during their rule.","translation":"ファーティマ朝の統治下で、美術と建築が栄えた。"}],"collocations":["Fatimid Caliphate","Fatimid dynasty","Fatimid art","Fatimid architecture"],"synonyms":[],"antonyms":[]},{"part_of_speech":"adjective","definition":"ファーティマ朝の、ファーティマ朝に関する","english_definition":"Relating to the Fatimid dynasty or the Fatimid Caliphate.","examples":[{"sentence":"Fatimid coins have been found throughout the Mediterranean.","translation":"ファーティマ朝の硬貨は地中海全域で発見されている。"},{"sentence":"The Fatimid period was a significant era in Egyptian history.","translation":"ファーティマ朝時代はエジプト史における重要な時代だった。"}],"collocations":["Fatimid period","Fatimid coins","Fatimid influence"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after Fatima, the daughter of the Prophet Muhammad, from whom the dynasty claimed descent.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfætɪmɪd/","syllables":"Fa-ti-mid"},"inflection":{"notes":"The noun is countable. The adjective does not inflect."},"usage_notes":{"explanation":"The term 'Fatimid' refers specifically to the dynasty and its associated culture, art, and historical period. It's important to distinguish it from other Islamic dynasties.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Fatimids were Sunni Muslims.","correct":"✓ The Fatimids were Shia Muslims.","note":"The Fatimids were a Shia dynasty, specifically Ismaili Shia."}],"priority":"★★☆"},"related_words":{"derivatives":["Fatima (名前)","Ismaili (イスマイール派)","Caliphate (カリフ制)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in historical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'Fatimid' is primarily encountered in historical contexts, specifically when discussing the Fatimid Caliphate that existed from the 10th to 12th centuries. Understanding the term requires some familiarity with Islamic history and the different branches of Islam (Shia vs. Sunni)."},"example_sentences":[{"sentence":"The Fatimid Caliphate controlled trade routes across North Africa.","translation":"ファーティマ朝は北アフリカの交易路を支配した。","type":"noun","meaning_category":"王朝"},{"sentence":"Fatimid architecture is characterized by its unique blend of Islamic and local styles.","translation":"ファーティマ朝の建築は、イスラム様式と現地の様式が独特に融合しているのが特徴だ。","type":"adjective","meaning_category":"王朝に関する"}]}