{"word":"choreographer","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"振付師、振り付け家","english_definition":"A person who composes the sequence of steps and moves for a performance of dance, especially in a ballet or stage show.","examples":[{"sentence":"The choreographer created a stunning ballet.","translation":"その振付師は素晴らしいバレエを作り上げた。"},{"sentence":"She is a famous choreographer known for her innovative style.","translation":"彼女は革新的なスタイルで知られる有名な振付師です。"},{"sentence":"The dancers worked closely with the choreographer to perfect the routine.","translation":"ダンサーたちは振付師と密接に協力して、ルーティンを完璧なものにしました。"}],"collocations":["ballet choreographer","dance choreographer","stage choreographer","work with a choreographer","hire a choreographer"],"synonyms":["dance creator","dance designer","movement director"],"antonyms":[]}],"etymology":{"value":"The word \"choreographer\" is derived from the words \"choreography\" and the suffix \"-er\" (denoting a person who does something). \"Choreography\" comes from the Greek words \"khoreia\" (dance) and \"graphia\" (writing or notation). Therefore, a choreographer is literally someone who \"writes\" or designs dances.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɔːriˈɒɡrəfər/","syllables":"cho-re-og-ra-pher"},"inflection":{"noun_plural":"choreographers"},"usage_notes":{"explanation":"A choreographer is responsible for creating and arranging the movements and steps in a dance performance. They work with dancers to develop and refine the choreography, often incorporating their own artistic vision and style. Choreographers can work in various genres, including ballet, modern dance, musical theater, film, and television.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a choreography.","correct":"✓ She is a choreographer.","note":"\"Choreography\" is the art of designing dance movements, while \"choreographer\" is the person who creates the choreography."},{"incorrect":"✗ He choreographs the dance very good.","correct":"✓ He choreographs the dance very well.","note":"\"Well\" is an adverb that describes how the dance is choreographed, while \"good\" is an adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["choreograph (verb: to compose the choreography for a dance)","choreographic (adjective: relating to choreography or a choreographer)","choreography (noun: the art of creating and arranging dances)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but commonly used in contexts related to dance and performing arts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"choreographer\" refers to a person who creates dances. It's a more advanced word that you'll typically encounter when discussing dance performances, ballet, or musical theater. The word itself is derived from \"choreography,\" which is the art of designing dance movements. If you're interested in dance, you'll likely come across this word.","priority":"★★☆"},"example_sentences":[{"sentence":"The **choreographer** carefully planned each movement to tell a story.","translation":"振付師は物語を伝えるために、それぞれの動きを注意深く計画した。","type":"noun","meaning_category":"振付師"},{"sentence":"The dancers praised the **choreographer** for her innovative ideas.","translation":"ダンサーたちは、その振付師の革新的なアイデアを称賛した。","type":"noun","meaning_category":"振付師"},{"sentence":"He hired a **choreographer** to help him with his wedding dance.","translation":"彼は結婚式のダンスを手伝ってもらうために振付師を雇った。","type":"noun","meaning_category":"振付師"},{"sentence":"The **choreographer's** work was praised for its originality and creativity.","translation":"その振付師の作品は、その独創性と創造性で称賛された。","type":"noun","meaning_category":"振付師"}]}