{"word":"chorioepithelioma","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"絨毛癌（じゅうもうがん）","english_definition":"A malignant tumor of the uterus or at the site of an ectopic pregnancy; develops from trophoblastic cells.","examples":[{"sentence":"Chorioepithelioma is a rare form of cancer that occurs in women, usually after pregnancy.","translation":"絨毛癌はまれな癌の一種で、通常は妊娠後に女性に発生します。"},{"sentence":"Treatment for chorioepithelioma often involves chemotherapy.","translation":"絨毛癌の治療には化学療法が用いられることが多いです。"}],"collocations":["gestational chorioepithelioma","non-gestational chorioepithelioma","treatment of chorioepithelioma","diagnosis of chorioepithelioma"],"synonyms":["choriocarcinoma","trophoblastic tumor"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'chorion' (membrane around the fetus), 'epithelio-' (referring to epithelium, the tissue lining body cavities and surfaces), and '-oma' (tumor).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɔːrioʊˌepɪθiːliˈoʊmə/","syllables":"cho-ri-o-e-pi-the-li-o-ma"},"inflection":{"noun_plural":"chorioepitheliomas"},"usage_notes":{"explanation":"Chorioepithelioma, also known as choriocarcinoma, is a rare and aggressive type of cancer that most often occurs in the uterus following a pregnancy. It arises from trophoblastic cells, which are cells that normally form the placenta during pregnancy. While it is most commonly associated with pregnancy, it can also occur in non-pregnant women and, rarely, in men. Early diagnosis and treatment are crucial due to its aggressive nature.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Chorioepithelioma is a virus.","correct":"✓ Chorioepithelioma is a type of cancer.","note":"Chorioepithelioma is a malignant tumor, not a viral infection."},{"incorrect":"✗ Chorioepithelioma only affects pregnant women.","correct":"✓ Chorioepithelioma most commonly affects women after pregnancy, but it can also occur in non-pregnant women and, rarely, in men.","note":"While primarily associated with pregnancy, it can occur in other contexts."}],"priority":"★★☆"},"related_words":{"derivatives":["choriocarcinoma","trophoblast","gestational trophoblastic disease (GTD)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Chorioepithelioma' is a highly specialized medical term referring to a rare type of cancerous tumor. Understanding this term requires a strong background in biology and medicine. The word's etymology reflects its origin from the tissues of the chorion, and its classification as a malignant tumor (indicated by the '-oma' suffix). Due to its rarity and specialized context, it is unlikely to be encountered outside of medical settings."},"example_sentences":[{"sentence":"The patient was diagnosed with chorioepithelioma after elevated hCG levels were detected.","translation":"患者は、hCGレベルの上昇が検出された後、絨毛癌と診断されました。","type":"noun","meaning_category":"medical condition"},{"sentence":"Chemotherapy is the primary treatment for chorioepithelioma, often resulting in a high cure rate.","translation":"化学療法は絨毛癌の主要な治療法であり、多くの場合、高い治癒率をもたらします。","type":"noun","meaning_category":"medical treatment"}]}