{"word":"Tonking","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A region in northern Vietnam, also known as Bắc Kỳ.","english_definition":"A historical name for the northernmost part of Vietnam, situated north of Annam. It is also known as Bắc Kỳ in Vietnamese.","examples":[{"sentence":"The French established a protectorate over Tonking in the late 19th century.","translation":"フランスは19世紀後半にトンキンに保護領を設立した。"},{"sentence":"Hanoi is located in the heart of Tonking.","translation":"ハノイはトンキンの中心部に位置している。"}],"collocations":["Gulf of Tonkin","Tonkin Delta","French Tonkin"],"synonyms":["Bắc Kỳ (Vietnamese)"],"antonyms":[]},{"part_of_speech":"adjective","definition":"Relating to Tonkin.","english_definition":"Of or pertaining to the region of Tonkin.","examples":[{"sentence":"Tonking cuisine is known for its unique flavors.","translation":"トンキン料理はその独特な風味で知られている。"},{"sentence":"The Tonking people have a rich cultural heritage.","translation":"トンキンの人々は豊かな文化遺産を持っている。"}],"collocations":["Tonking cuisine","Tonking people","Tonking culture"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from Động Kinh, the former name of Hanoi, which was the capital of the region.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɒŋkɪŋ/","syllables":"Ton-king"},"inflection":{},"usage_notes":{"explanation":"'Tonking' is primarily a geographical and historical term referring to northern Vietnam. It's less commonly used today, with 'northern Vietnam' being more prevalent. However, it still appears in historical contexts and when discussing specific cultural or regional aspects related to that area.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He lives in Tonkin, Vietnam's southern region.","correct":"✓ He lives in Tonkin, Vietnam's northern region.","note":"Tonkin refers to the northern part of Vietnam, not the southern part."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Primarily used in historical or geographical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Tonking' is relatively uncommon in modern English, mainly appearing in historical or geographical discussions about Vietnam. It refers specifically to the northern region of Vietnam. Understanding its historical context is crucial when encountering this term. It is not part of everyday vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The Gulf of Tonkin incident played a significant role in the escalation of the Vietnam War.","translation":"トンキン湾事件はベトナム戦争のエスカレーションにおいて重要な役割を果たした。","type":"noun","meaning_category":"Region in Northern Vietnam"},{"sentence":"Traditional Tonking architecture can still be seen in some parts of Hanoi.","translation":"伝統的なトンキンの建築はハノイの一部で今も見ることができる。","type":"adjective","meaning_category":"Relating to Tonkin"}]}