{"word":"maleficio","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(スペイン語) 呪い、魔術、悪い行い","english_definition":"(Spanish) A curse, spell, or act of witchcraft; an evil deed.","examples":[{"sentence":"La anciana fue acusada de realizar maleficios contra el pueblo.","translation":"The old woman was accused of performing maleficios (curses/witchcraft) against the town.","language":"es"},{"sentence":"Se creía que el maleficio era la causa de todas las desgracias.","translation":"It was believed that the maleficio (curse) was the cause of all the misfortunes.","language":"es"}],"collocations":["hacer un maleficio (to cast a curse)","romper un maleficio (to break a curse)","víctima de un maleficio (victim of a curse)"],"synonyms":["maldición (curse)","hechizo (spell)","brujería (witchcraft)","sortilegio (sorcery)"],"antonyms":["bendición (blessing)","protección (protection)"],"notes":"Often associated with folk beliefs and superstitions."}],"etymology":{"value":"From Latin 'maleficium', meaning 'evil deed, wrongdoing', from 'maleficus' (doing evil), from 'male' (badly) + 'facere' (to do).","priority":"★★★"},"pronunciation":{"ipa":"/maleˈfiθjo/ (Spain), /maleˈfisjo/ (Latin America)","syllables":"ma-le-fi-cio"},"inflection":{"noun_plural":"maleficios"},"usage_notes":{"explanation":"'Maleficio' is a Spanish word primarily used to refer to a curse, spell, or act of witchcraft intended to cause harm. It can also refer more broadly to an evil or harmful deed. The term is often encountered in contexts related to folklore, superstition, and historical accounts of witchcraft.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"El maleficio causó felicidad.","correct":"El maleficio causó desgracia.","note":"Maleficios cause misfortune, not happiness."}],"priority":"★★☆"},"related_words":{"derivatives":["maléfico (evil, harmful)","maleficiar (to bewitch, to harm)"],"phrases":["estar bajo un maleficio (to be under a curse)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in Spanish-speaking regions and contexts related to folklore and witchcraft.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'maleficio' is a relatively uncommon term primarily used in Spanish. It refers to a curse, spell, or act of witchcraft intended to cause harm. It is often found in literature, historical texts, or discussions related to folklore and superstition. Understanding the word requires familiarity with Spanish vocabulary and cultural contexts related to witchcraft and curses."},"example_sentences":[{"sentence":"Se dice que la casa está bajo un maleficio desde hace siglos.","translation":"It is said that the house has been under a curse for centuries.","language":"es","type":"noun","meaning_category":"curse"},{"sentence":"El chamán intentó romper el maleficio que afectaba a la familia.","translation":"The shaman tried to break the curse that was affecting the family.","language":"es","type":"noun","meaning_category":"curse"},{"sentence":"Los aldeanos temían los maleficios de la bruja.","translation":"The villagers feared the witch's maleficios (curses/spells).","language":"es","type":"noun","meaning_category":"witchcraft"}]}