{"word":"banig","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"woven mat (typically made of palm leaves or other natural fibers) used for sleeping or sitting on, common in the Philippines and other Southeast Asian countries","english_definition":"A handwoven mat usually used in East Asia and the Philippines for sleeping and sitting.","examples":[{"sentence":"We spread the banig on the sand for a picnic.","translation":"ピクニックのために砂浜にバニッグを広げた。"},{"sentence":"The children slept soundly on the banig.","translation":"子供たちはバニッグの上でぐっすり眠った。"},{"sentence":"She carefully folded the banig after use.","translation":"彼女は使用後、丁寧にバニッグを畳んだ。"}],"collocations":["spread a banig","sleep on a banig","weave a banig","roll up a banig"],"synonyms":["mat","sleeping mat","woven mat"],"antonyms":[]}],"etymology":{"value":"Likely derived from Proto-Malayo-Polynesian *baNiR, meaning 'mat'. Cognates can be found in other Austronesian languages.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɑːnɪɡ/","syllables":"ba-nig"},"inflection":{"noun_plural":"banigs"},"usage_notes":{"explanation":"A 'banig' is more than just a mat; it's a cultural item, especially in the Philippines. It's often used for sleeping, sitting, or even as a decorative piece. The quality and design can vary greatly, with some being simple and functional, while others are intricate works of art. It is often associated with rural life and traditional Filipino culture.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I put the banig on the bed.","correct":"✓ I put the banig on the floor.","note":"Banigs are typically used on the floor, not on beds. Using it on a bed would be unusual."},{"incorrect":"✗ She bought a banig made of plastic.","correct":"✓ She bought a banig made of palm leaves.","note":"Traditional banigs are made of natural fibers like palm leaves, pandan, or sea grass. A plastic mat would not typically be called a banig."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency (specific to Southeast Asia)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'banig' refers to a traditional woven mat commonly used in the Philippines and other Southeast Asian countries. It's typically made from natural fibers like palm leaves or sea grass. While not a widely known word outside of these regions, understanding it provides insight into the culture and traditions of these areas.","priority":"★★☆"},"example_sentences":[{"sentence":"Every Filipino household has at least one **banig**.","translation":"どのフィリピンの家庭にも少なくとも一枚はバニッグがある。","type":"noun","meaning_category":"woven mat"},{"sentence":"The family gathered on the **banig** to eat their meal.","translation":"家族は食事をするためにバニッグの上に集まった。","type":"noun","meaning_category":"woven mat"},{"sentence":"The intricate designs on the **banig** showed the weaver's skill.","translation":"バニッグの複雑なデザインは、織り手の技術を示していた。","type":"noun","meaning_category":"woven mat"}]}