{"word":"Orme","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(地名) グレート・オームまたはリトル・オーム (イギリス、ウェールズ北部の石灰岩の岬)","english_definition":"A headland or promontory, specifically either the Great Orme or the Little Orme, both limestone headlands in North Wales, UK.","examples":[{"sentence":"We visited the Great Orme during our trip to Llandudno.","translation":"私たちは、スランドゥドノへの旅行中にグレート・オームを訪れました。"},{"sentence":"The Little Orme is smaller and less visited than its larger counterpart.","translation":"リトル・オームは、大きい方のグレート・オームよりも小さく、訪れる人も少ないです。"}],"collocations":["Great Orme","Little Orme","Orme tramway","Orme landscape"],"synonyms":["headland","promontory","cape","point"],"antonyms":[]},{"part_of_speech":"proper noun","definition":"(姓) オーム (英語圏の姓)","english_definition":"A surname of English origin.","examples":[{"sentence":"Mr. Orme is a well-respected member of the community.","translation":"オーム氏は地域社会で尊敬されている人物です。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Orme' is believed to derive from the Old Norse word 'ormr', meaning 'sea serpent' or 'worm', likely referring to the shape of the headland. The surname 'Orme' may have originated from a personal name of Norse origin.","priority":"★★☆"},"pronunciation":{"ipa":"/ɔːrm/","syllables":"Orme"},"inflection":{},"usage_notes":{"explanation":"'Orme' is primarily used as a geographical term to refer to either the Great Orme or the Little Orme in North Wales. It can also be encountered as a surname. When used as a geographical term, it is usually capitalized.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to visit orme.","correct":"✓ I'm going to visit the Orme. / ✓ I'm going to visit the Great Orme.","note":"When referring to the Great Orme or Little Orme, it is usually preceded by 'the', or specified as 'Great Orme' or 'Little Orme' ."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_places":["Llandudno","Conwy"],"related_people":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively low frequency, primarily associated with specific locations and surnames.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'Orme' is relatively uncommon outside of specific geographical contexts, primarily referring to the Great Orme and Little Orme in North Wales. It may also be encountered as a surname. Understanding the term requires familiarity with British geography or genealogy. The etymology is related to Old Norse, which may be of interest to those studying language origins."},"example_sentences":[{"sentence":"The **Orme** offers stunning views of the Irish Sea.","translation":"オームからはアイルランド海の素晴らしい景色を眺めることができます。","type":"noun","meaning_category":"地名 (グレート・オームまたはリトル・オーム)"},{"sentence":"We climbed to the top of the Great **Orme**.","translation":"私たちはグレート・オームの頂上まで登りました。","type":"noun","meaning_category":"地名 (グレート・オーム)"},{"sentence":"**Orme** family history can be traced back to the 16th century.","translation":"オーム家の歴史は16世紀まで遡ることができます。","type":"proper noun","meaning_category":"姓"}]}