{"word":"loanword-rich","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"外来語が豊富な、借用語を多く含む","english_definition":"characterized by a high number of loanwords; containing many words adopted from other languages.","examples":[{"sentence":"English is a loanword-rich language, incorporating words from Latin, French, and many other languages.","translation":"英語は外来語が豊富な言語であり、ラテン語、フランス語、その他多くの言語からの単語を取り入れています。"},{"sentence":"Japanese, while having its own unique vocabulary, is also quite loanword-rich, especially with words from English.","translation":"日本語は、独自の語彙を持ちながらも、特に英語からの外来語が豊富です。"}],"collocations":["loanword-rich vocabulary","loanword-rich text","loanword-rich language"],"synonyms":["borrowing-heavy","foreign-influenced","lexically diverse (in terms of origin)"],"antonyms":["native-based","pure (in terms of vocabulary origin)","nativist"],"notes":"This term is often used in linguistics to describe languages that have readily adopted words from other languages over time."}],"etymology":{"value":"Combination of 'loanword' (a word adopted from another language) and 'rich' (having a lot of something).","priority":"★★★"},"pronunciation":{"ipa":"/ˈloʊnˌwɜːrd rɪtʃ/","syllables":"loan-word rich"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"The term 'loanword-rich' is used to describe languages that have incorporated a significant number of words from other languages into their vocabulary. This is a common phenomenon in language evolution and can be influenced by factors such as trade, cultural exchange, and conquest.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The language is very loanword.","correct":"✓ The language is very loanword-rich.","note":"'Loanword' is a noun. 'Loanword-rich' is the adjective form needed to describe the language."}],"priority":"★★☆"},"related_words":{"derivatives":["loanword (noun)","borrowing (noun)","etymology (noun)","lexicon (noun)"],"related_terms":["creole language","pidgin language","language contact"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency. Primarily used in academic or linguistic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Loanword-rich' is a term used to describe a language that has many words adopted from other languages. It's often used in discussions about linguistics or language history. For example, you might say that English is a 'loanword-rich' language because it has taken words from Latin, French, and many other languages over time. This term is more common in academic or specialized contexts. "},"example_sentences":[{"sentence":"The professor described Swahili as a loanword-rich language due to its extensive Arabic and English influences.","translation":"教授は、スワヒリ語がアラビア語と英語からの影響を大きく受けているため、外来語が豊富な言語であると説明しました。","type":"general","meaning_category":"general"},{"sentence":"A loanword-rich vocabulary can make a language easier to learn for speakers of related languages.","translation":"外来語が豊富な語彙は、関連する言語の話し手にとって言語を習得しやすくする可能性があります。","type":"general","meaning_category":"general"}]}