{"word":"untorpid","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Not torpid; not lacking in energy or vigor; active; lively.","english_definition":"Not in a state of torpor; not sluggish or inactive; energetic and lively.","examples":[{"sentence":"The untorpid mind seeks constant stimulation and learning.","translation":"停滞しない心は、絶え間ない刺激と学習を求める。"},{"sentence":"Despite the cold weather, the children remained untorpid, playing energetically in the snow.","translation":"寒い気候にもかかわらず、子供たちは活発なままで、雪の中で元気に遊んでいた。"}],"collocations":["untorpid mind","untorpid spirit","remain untorpid","untorpid activity"],"synonyms":["active","lively","energetic","vigorous","animated","alert","awake","brisk"],"antonyms":["torpid","sluggish","lethargic","inactive","dull","apathetic","dormant"]},{"part_of_speech":"adjective","definition":"Free from numbness or insensitivity.","english_definition":"Not numb or lacking sensation; feeling and responsive.","examples":[{"sentence":"After the massage, her limbs felt untorpid and full of sensation.","translation":"マッサージの後、彼女の手足は麻痺がなくなり、感覚に満ち溢れていた。"}],"collocations":["untorpid limbs","untorpid senses"],"synonyms":["sensitive","responsive","feeling","aware"],"antonyms":["numb","insensitive","unfeeling","torpid"]}],"etymology":{"value":"Formed from the prefix 'un-' (not) and 'torpid'.","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈtɔːrpɪd/","syllables":"un-tor-pid"},"inflection":{"adjective_forms":{"comparative":"more untorpid","superlative":"most untorpid"}},"usage_notes":{"explanation":"'Untorpid' is a relatively rare word that directly opposes the state of torpor, meaning lacking energy or being sluggish. It can refer to both physical and mental states, indicating liveliness, activity, and responsiveness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The untorpid turtle quickly crossed the finish line.","correct":"✓ The energetic rabbit quickly crossed the finish line.","note":"Turtles are generally known for being slow, so 'untorpid' would not typically describe a turtle. An animal known for speed and energy, like a rabbit, would be more appropriate."},{"incorrect":"✗ The medicine made him untorpid and sleepy.","correct":"✓ The medicine made him torpid and sleepy.","note":"If the medicine induces sleepiness, it would cause torpor, not the opposite. 'Untorpid' implies the absence of sluggishness or sleepiness."}],"priority":"★★☆"},"related_words":{"derivatives":["untorpidly","untorpidness"],"related_terms":["torpid","torpor"]},"level_frequency":{"CEFR":"N/A (Very rare - not typically found in CEFR vocabulary lists)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Untorpid' is an uncommon word, best suited for advanced English speakers and writers. It is used to describe something that is the opposite of 'torpid,' meaning not sluggish, inactive, or lacking energy. Understanding and using this word effectively requires a strong grasp of vocabulary and nuance."},"example_sentences":[{"sentence":"The speaker's untorpid delivery kept the audience engaged throughout the presentation.","translation":"講演者の活発な話し方は、プレゼンテーションの間、聴衆を引きつけ続けた。","type":"adjective","meaning_category":"active, lively"},{"sentence":"After a refreshing nap, she felt untorpid and ready to tackle the day's challenges.","translation":"さわやかな昼寝の後、彼女は麻痺がなくなり、その日の課題に取り組む準備ができていた。","type":"adjective","meaning_category":"energetic, responsive"}]}