{"word":"homebrew","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自家製ビール、自家醸造酒","english_definition":"beer or other alcoholic beverage made at home.","examples":[{"sentence":"He enjoys making homebrew in his basement.","translation":"彼は地下室で自家製ビールを作るのを楽しんでいます。"},{"sentence":"The local homebrew club has a monthly tasting event.","translation":"地元の自家醸造クラブは月例の試飲会を開催しています。"}],"collocations":["make homebrew (自家製ビールを作る)","drink homebrew (自家製ビールを飲む)","homebrew kit (自家製ビールキット)","homebrew club (自家製ビールクラブ)"],"synonyms":["homemade beer","craft beer (often used more broadly)"],"antonyms":["commercial beer","store-bought beer"]},{"part_of_speech":"adjective","definition":"自家製の、自家醸造の","english_definition":"made or brewed at home.","examples":[{"sentence":"They served homebrew beer at the party.","translation":"彼らはパーティーで自家製ビールを出しました。"},{"sentence":"He used a homebrew recipe he found online.","translation":"彼はインターネットで見つけた自家製レシピを使いました。"}],"collocations":["homebrew beer (自家製ビール)","homebrew recipe (自家製レシピ)","homebrew equipment (自家製機材)"],"synonyms":["homemade","DIY"],"antonyms":["commercial","store-bought"]},{"part_of_speech":"noun","definition":"(コンピューター) 非公式に開発されたソフトウェア、自作ソフトウェア","english_definition":"(computing) software developed unofficially, especially for a closed or proprietary system.","examples":[{"sentence":"He installed homebrew software on his jailbroken iPhone.","translation":"彼は脱獄したiPhoneに非公式に開発されたソフトウェアをインストールしました。"},{"sentence":"The homebrew community is very active in developing emulators.","translation":"非公式ソフトウェアコミュニティはエミュレーターの開発に非常に積極的です。"}],"collocations":["homebrew software (非公式ソフトウェア)","homebrew game (非公式ゲーム)","homebrew community (非公式ソフトウェアコミュニティ)"],"synonyms":["unofficial software","custom software","DIY software"],"antonyms":["official software","commercial software"]}],"etymology":{"value":"'Home' + 'brew'. 'Brew' refers to the process of making beer or other alcoholic beverages. The term originated from the practice of making beer at home rather than in a commercial brewery.","priority":"★★★"},"pronunciation":{"ipa":"/ˈhoʊm.bruː/","syllables":"home-brew"},"inflection":{"notes":"単数形・複数形は homebrew (不可算名詞として扱われることが多い)。"},"usage_notes":{"explanation":"'Homebrew' primarily refers to beer or other alcoholic beverages made at home for personal consumption, often as a hobby. In computing, it refers to software developed by hobbyists or enthusiasts, especially for systems where official development is restricted (e.g., game consoles, mobile devices). The computing sense often implies a degree of technical skill and a spirit of independent creation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a homebrew from the store.","correct":"✓ I bought a craft beer from the store. / ✓ I made homebrew.","note":"'Homebrew' implies it was made at home, not purchased from a store. Use 'craft beer' for commercially produced beer with a similar style."},{"incorrect":"✗ He is selling homebrews without a license.","correct":"✓ He is selling homemade beer without a license.","note":"Selling homebrew without a license is illegal in many places. If it's being sold, it's generally not considered homebrew."}],"priority":"★★☆"},"related_words":{"derivatives":["homebrewer (自家製ビール醸造者)","brewing (醸造)","brewery (醸造所)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"比較的低い (Relatively low), but increasing in popularity due to the craft beer movement.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'homebrew' is generally understood to mean beer or other alcoholic beverages made at home for personal consumption. It is also used in the context of computing to describe software developed by hobbyists or enthusiasts, particularly for closed or proprietary systems. The term implies a degree of technical skill and a spirit of independent creation. Understanding the context is important to determine the intended meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"Making homebrew is a fun and rewarding hobby.","translation":"自家製ビールを作ることは楽しくてやりがいのある趣味です。","type":"noun","meaning_category":"自家製ビール"},{"sentence":"The homebrew community is dedicated to creating innovative software.","translation":"非公式ソフトウェアコミュニティは革新的なソフトウェアの作成に専念しています。","type":"noun","meaning_category":"非公式ソフトウェア"},{"sentence":"He entered his homebrew pale ale in the competition.","translation":"彼は自作のペールエールをコンテストに出品しました。","type":"adjective","meaning_category":"自家製の"}]}