{"word":"agisms","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"年齢差別、年齢による偏見や差別","english_definition":"Discrimination and prejudice against people based on their age.","examples":[{"sentence":"Agisms in the workplace can prevent older workers from getting promotions.","translation":"職場での年齢差別は、高齢の労働者が昇進するのを妨げる可能性があります。"},{"sentence":"The film explores the agisms prevalent in the entertainment industry.","translation":"その映画は、エンターテイメント業界に蔓延する年齢差別を探求しています。"},{"sentence":"We need to challenge agisms and promote respect for people of all ages.","translation":"私たちは年齢差別に対抗し、すべての年齢の人々への敬意を促進する必要があります。"}],"collocations":["combat agisms","challenge agisms","address agisms","fight agisms","institutional agisms","everyday agisms","internalized agisms"],"synonyms":["age discrimination","ageism","age bias","age prejudice"],"antonyms":["age equality","age inclusivity","age diversity","age acceptance"]}],"etymology":{"value":"The word 'agisms' is the plural form of 'agism,' which is a relatively recent term coined in the late 1960s by Robert Butler to describe discrimination against seniors, paralleling sexism and racism. It is derived from 'age' with the suffix '-ism,' indicating a system of beliefs or behaviors that discriminate against a particular group.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈeɪdʒɪzəmz/","syllables":"a-gi-sms"},"inflection":{"noun_plural":"agisms"},"usage_notes":{"explanation":"'Agisms' refers to the multiple forms or instances of ageism that can occur in society. It is often used to highlight the various ways in which age-based discrimination manifests, whether it's in employment, healthcare, media representation, or everyday interactions. The term emphasizes that ageism is not a monolithic issue but rather a collection of biased attitudes, stereotypes, and discriminatory practices.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed agism towards the young people.","correct":"✓ He showed agism towards young people. / ✓ He exhibited agisms towards young people.","note":"While 'agism' can be used in the singular, 'agisms' is used to highlight the multiple ways in which ageism can manifest."},{"incorrect":"✗ Agisms is a serious problem.","correct":"✓ Agism is a serious problem. / ✓ Agisms are serious problems.","note":"'Agism' is singular and takes a singular verb. 'Agisms' is plural and takes a plural verb."}],"priority":"★★☆"},"related_words":{"derivatives":["ageism","ageist","anti-ageist"],"related_terms":["discrimination","prejudice","stereotyping","ableism","sexism","racism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Agisms' is a term used to describe the various forms of discrimination and prejudice based on age. It's a more nuanced term than 'ageism,' highlighting that age-related bias can manifest in multiple ways across different contexts. Understanding this term is essential for discussing and addressing systemic inequalities affecting people of all ages. It is often used in academic or activist contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The report identified several agisms within the company's hiring practices.","translation":"その報告書は、会社の採用慣行におけるいくつかの年齢差別を特定しました。","type":"noun","meaning_category":"age discrimination"},{"sentence":"Educational programs are needed to combat the agisms that affect older adults.","translation":"高齢者に影響を与える年齢差別に対抗するためには、教育プログラムが必要です。","type":"noun","meaning_category":"age discrimination"},{"sentence":"The organization aims to dismantle agisms in healthcare and social services.","translation":"その組織は、医療および社会サービスにおける年齢差別をなくすことを目指しています。","type":"noun","meaning_category":"age discrimination"}]}