{"word":"Agastrophus","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A genus of beetles in the family Chrysomelidae (leaf beetles).","english_definition":"A genus of beetles belonging to the family Chrysomelidae, commonly known as leaf beetles.","examples":[{"sentence":"The Agastrophus genus includes several species of leaf beetles found in specific regions.","translation":"Agastrophus属には、特定の地域で見られるいくつかのハムシ種が含まれています。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Agastrophus' likely derives from Greek roots, combining 'agastos' (admirable, wonderful) with 'strophos' (band, girdle), possibly referencing a distinctive marking or feature of the beetles.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæɡəˈstrɒfəs/","syllables":"A-gas-tro-phus"},"inflection":{"noun_plural":"Agastrophus (scientific names often remain the same in plural)"},"usage_notes":{"explanation":"'Agastrophus' is a scientific term used in zoology to classify a specific group of leaf beetles. It is primarily encountered in scientific literature and taxonomic databases.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"related_terms":["Chrysomelidae (family)","leaf beetle"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (scientific term)","frequency_google_ngram":"Very low frequency (scientific term)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Agastrophus' is a technical term used in the field of entomology (the study of insects). It refers to a specific genus within the leaf beetle family (Chrysomelidae). Understanding and use of this term is generally limited to those with a background in biology or related scientific disciplines."},"example_sentences":[{"sentence":"Researchers are studying the feeding habits of Agastrophus beetles on various plant species.","translation":"研究者たちは、さまざまな植物種に対するAgastrophusの甲虫の食性を研究しています。","type":"scientific","meaning_category":"beetle genus"}]}