{"word":"individualists","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"個人主義者たち、個人を尊重する人たち","english_definition":"plural of individualist: people who advocate or practice individualism; people who are independent and self-reliant.","examples":[{"sentence":"The country was founded by individualists who valued freedom above all else.","translation":"その国は、何よりも自由を重んじる個人主義者たちによって建国された。"},{"sentence":"A society of individualists may find it difficult to agree on common goals.","translation":"個人主義者の社会では、共通の目標について合意することが難しいかもしれない。"},{"sentence":"She admired the individualists who dared to challenge the status quo.","translation":"彼女は、現状に敢えて異議を唱える個人主義者たちを尊敬していた。"}],"collocations":["group of individualists (個人主義者の集団)","society of individualists (個人主義者の社会)","nation of individualists (個人主義者の国)","independent individualists (自立した個人主義者)","strong individualists (強い個人主義者)"],"synonyms":["nonconformists","free spirits","loners","mavericks","originals","self-reliant people","independent thinkers"],"antonyms":["conformists","collectivists","team players"]},{"part_of_speech":"noun","definition":"(集合的に) 個人主義を重んじる人々","english_definition":"people who prioritize individual rights and freedoms over collective interests.","examples":[{"sentence":"Individualists tend to be skeptical of government intervention in their lives.","translation":"個人主義者たちは、政府が彼らの生活に介入することに懐疑的な傾向がある。"},{"sentence":"The rise of individualists has led to a decline in traditional community values.","translation":"個人主義者の増加は、伝統的な地域社会の価値観の低下につながっている。"}],"collocations":["rise of individualists (個人主義者の台頭)","influence of individualists (個人主義者の影響)","beliefs of individualists (個人主義者の信念)","values of individualists (個人主義者の価値観)"],"synonyms":["libertarians","autonomists","self-determiners"],"antonyms":["communitarians","socialists"]}],"etymology":{"value":"The word \"individualist\" is derived from \"individual,\" which comes from the Latin \"individuus,\" meaning \"indivisible\" or \"that cannot be divided.\" The suffix \"-ist\" denotes a person who adheres to or advocates a particular ideology or principle.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪndɪˈvɪdʒuəlɪsts/","syllables":"in-di-vi-du-al-ists"},"inflection":{"noun_plural":"individualists"},"usage_notes":{"explanation":"\"Individualists\" refers to multiple people who subscribe to the philosophy of individualism. This philosophy emphasizes the importance of individual freedom, self-reliance, and personal responsibility. Individualists often prioritize their own goals and values over those of the group or society as a whole. The term can also describe people who are simply independent and unconventional in their thoughts and actions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is one of the individualist.","correct":"✓ He is one of the individualists.","note":"When referring to someone as one of a group of individualists, use the plural form \"individualists.\" The singular form \"individualist\" is used when referring to someone as an individual person who holds individualistic beliefs."},{"incorrect":"✗ The individualists believes in freedom.","correct":"✓ The individualists believe in freedom.","note":"When using \"individualists\" as a plural noun, the verb should be in the plural form as well. Therefore, use \"believe\" instead of \"believes.\""}],"priority":"★★☆"},"related_words":{"derivatives":["individualism (個人主義)","individualistic (個人主義的な)","individual (個人)"],"related_concepts":["autonomy (自律性)","self-reliance (自立)","independence (独立)","liberty (自由)","personal responsibility (個人的責任)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but used in discussions of political and social philosophy.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"individualists\" refers to a group of people who strongly believe in individualism. Individualism is the idea that each person is unique and should have the freedom to make their own choices and be responsible for their own actions. Individualists often value independence and self-reliance. This term is often used in discussions about politics, society, and philosophy.","priority":"★★☆"},"example_sentences":[{"sentence":"The conference brought together a diverse group of **individualists** from around the world.","translation":"その会議には、世界中から多様な個人主義者が集まった。","type":"noun","meaning_category":"個人主義者たち"},{"sentence":"These **individualists** are known for their innovative and unconventional approaches to problem-solving.","translation":"これらの個人主義者は、問題解決に対する革新的で型破りなアプローチで知られている。","type":"noun","meaning_category":"個人主義者たち"},{"sentence":"The novel explores the tension between the needs of society and the desires of **individualists**.","translation":"その小説は、社会のニーズと個人主義者の願望の間の緊張を探求している。","type":"noun","meaning_category":"個人主義者たち"},{"sentence":"A collection of essays examined the role of **individualists** in shaping modern culture.","translation":"エッセイ集は、現代文化の形成における個人主義者の役割を検証した。","type":"noun","meaning_category":"個人主義者たち"}]}