{"word":"Anthropolitic","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A political system or ideology centered on the human condition, human rights, and human well-being.","english_definition":"A political system or ideology centered on the human condition, human rights, and human well-being.","examples":[{"sentence":"The anthropolitic approach emphasizes the importance of social justice and equality.","translation":"人類政治的アプローチは、社会正義と平等の重要性を強調する。"},{"sentence":"Some scholars argue that anthropolitic thought can provide a framework for addressing global challenges.","translation":"人類政治思想は、地球規模の課題に取り組むための枠組みを提供できると主張する学者もいる。"}],"collocations":["anthropolitic approach","anthropolitic thought","anthropolitic framework"],"synonyms":["humanistic politics","people-centered politics"],"antonyms":[]}],"etymology":{"value":"Derived from the combination of \"anthropo-\" (referring to humans) and \"politic\" (referring to politics).","priority":"★★★"},"pronunciation":{"ipa":"ˌænθroʊˈpɒlɪtɪk","syllables":"An-thro-po-lit-ic"},"inflection":{},"usage_notes":{"explanation":"The term \"anthropolitic\" is not widely used and may be considered a neologism. It is used to describe political systems or ideologies that prioritize human welfare and rights.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["anthropolitical (adjective)"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term \"anthropolitic\" is a relatively uncommon and specialized term, often used in academic or philosophical contexts to describe a political system or ideology focused on human well-being and rights. Due to its limited usage, it is considered a high-level vocabulary word."},"example_sentences":[{"sentence":"The anthropolitic movement seeks to create a society where every individual has the opportunity to thrive.","translation":"人類政治運動は、すべての個人が繁栄する機会を持つ社会の創造を目指している。","type":"noun","meaning_category":"Political ideology"},{"sentence":"An anthropolitic perspective can help us understand the root causes of social inequality.","translation":"人類政治的視点は、社会的不平等の根本原因を理解するのに役立つ。","type":"noun","meaning_category":"Political system"}]}