{"word":"title-holding","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"タイトルを保持している、選手権保持者の","english_definition":"Currently holding a title, especially a championship title in sports or other competitive fields.","examples":[{"sentence":"The title-holding boxer entered the ring with confidence.","translation":"タイトル保持者のボクサーは自信を持ってリングに上がった。"},{"sentence":"Our team is the title-holding champion from last year's tournament.","translation":"私たちのチームは昨年のトーナメントのタイトル保持者です。"},{"sentence":"She is the title-holding chess master, undefeated for three years.","translation":"彼女はタイトル保持者のチェスマスターで、3年間無敗です。"}],"collocations":["title-holding champion","title-holding team","title-holding player","defend the title as a title-holding champion"],"synonyms":["reigning","champion","incumbent","defending champion"],"antonyms":["challenger","contender"],"notes":"Often used in sports and competitive contexts."}],"etymology":{"value":"A compound word formed by combining \"title\" (referring to a championship or honor) and \"holding\" (meaning possessing or retaining).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtaɪtəlˌhoʊldɪŋ/","syllables":"ti-tle-hold-ing"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb. It can be used to modify nouns in singular or plural forms."},"usage_notes":{"explanation":"The term 'title-holding' is specifically used to describe someone or a team that currently possesses a championship title. It implies that they have won the title previously and are still the current holders. It is most commonly used in the context of sports, but can also apply to other competitive fields like beauty pageants, academic competitions, or even business contexts where a company might hold a 'title' of market leadership.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a title-hold player.","correct":"✓ He is a title-holding player.","note":"The correct form is 'title-holding' with the '-ing' suffix, indicating the action of holding the title is ongoing. 'Title-hold' is grammatically incorrect."},{"incorrect":"✗ She is the title-hold champion for three years.","correct":"✓ She has been the title-holding champion for three years.","note":"To indicate the duration of holding the title, use the present perfect continuous tense or present perfect tense with 'title-holding' adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["titleholder (noun: someone who holds a title)"],"phrasal_verbs":[],"related_terms":["title defense","championship","reigning champion","incumbent"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency, specific to sports and competitive contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Title-holding' is a compound adjective used to describe someone or a team that currently possesses a championship title. It is most frequently encountered in sports reporting and discussions about competitive events. The term implies that the individual or team has previously won the title and is now in a position to defend it against challengers. Understanding the term requires familiarity with the concept of championship titles and competitive hierarchies."},"example_sentences":[{"sentence":"The **title-holding** team prepared rigorously for the upcoming match.","translation":"タイトル保持チームは、次の試合に向けて念入りに準備をした。","type":"adjective","meaning_category":"選手権保持者の"},{"sentence":"As the **title-holding** champion, she had the pressure of defending her crown.","translation":"タイトル保持チャンピオンとして、彼女は王座を守るというプレッシャーを抱えていた。","type":"adjective","meaning_category":"選手権保持者の"},{"sentence":"The **title-holding** company faced stiff competition from emerging startups.","translation":"タイトル保持企業は、新興企業からの厳しい競争に直面した。","type":"adjective","meaning_category":"選手権保持者の"}]}