{"word":"city-loving","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"都市を愛する、都市生活を好む","english_definition":"Having a strong affection for cities and urban life.","examples":[{"sentence":"She's a city-loving person who enjoys the hustle and bustle of urban environments.","translation":"彼女は都市を愛する人で、都会の喧騒を楽しんでいます。"},{"sentence":"They are city-loving millennials who prefer apartments in downtown areas.","translation":"彼らは都市生活を好むミレニアル世代で、ダウンタウンのアパートを好みます。"},{"sentence":"Despite growing up in the countryside, he became a city-loving resident after moving to New York.","translation":"田舎で育ったにもかかわらず、ニューヨークに引っ越した後、彼は都市を愛する住民になりました。"}],"collocations":["city-loving people","city-loving millennials","city-loving resident","city-loving lifestyle","city-loving heart"],"synonyms":["urbanophile","pro-urban","city enthusiast","urban-minded","urban-oriented"],"antonyms":["rural-loving","country-loving","ruralist","anti-urban"],"notes":"This word is often used to describe someone who enjoys the fast-paced, diverse, and culturally rich environment of cities. It implies a preference for urban amenities and experiences over rural or suburban settings."}],"etymology":{"value":"A compound word formed by combining 'city' (referring to an urban area) and 'loving' (expressing affection or fondness). The combination indicates a strong liking or preference for cities.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɪtiˌlʌvɪŋ/","syllables":"cit-y-lov-ing"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'City-loving' is used to describe individuals who find cities appealing and enjoyable. It suggests an appreciation for the unique qualities of urban life, such as cultural diversity, career opportunities, and access to various amenities.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a city loving.","correct":"✓ He is city-loving.","note":"'City-loving' functions as an adjective describing the person. The article 'a' should be followed by the adjective directly."},{"incorrect":"✗ She is very city love.","correct":"✓ She is very city-loving.","note":"'City-loving' is the adjective form; 'city love' is not grammatically correct in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["city (noun)","loving (adjective)"],"related_concepts":["urbanization","urban planning","urban culture","urban lifestyle","urban sprawl","urban decay"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency. Not a common word, but easily understood.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"'City-loving' means that someone really likes cities. It's used to describe people who enjoy living in a city and like the things that cities have to offer, such as many shops, restaurants, and cultural activities. If you say someone is 'city-loving,' it means they prefer city life over living in the countryside or a small town."},"example_sentences":[{"sentence":"As a city-loving architect, she specialized in designing sustainable urban spaces.","translation":"都市を愛する建築家として、彼女は持続可能な都市空間の設計を専門としていました。","type":"adjective","meaning_category":"Preference for urban spaces"},{"sentence":"The city-loving couple always chose to vacation in bustling metropolitan areas.","translation":"その都市を愛するカップルはいつも賑やかな都市部で休暇を過ごすことを選びました。","type":"adjective","meaning_category":"Preference for urban vacations"},{"sentence":"Despite the high cost of living, he remained a city-loving resident, drawn to the vibrant culture and diverse opportunities.","translation":"高い生活費にもかかわらず、彼は活気に満ちた文化と多様な機会に惹かれ、都市を愛する住民であり続けました。","type":"adjective","meaning_category":"Preference despite challenges"}]}