{"word":"cangan","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(historical) A type of heavy wooden cangue used as a form of punishment in ancient China.","english_definition":"A heavy wooden collar or frame used as a form of public humiliation and punishment in China and other East Asian countries.","examples":[{"sentence":"The prisoner was forced to wear the cangan as he was paraded through the streets.","translation":"囚人は街中を引き回される際に、チャンガンを着用させられた。"}],"collocations":["wear a cangan","punished with a cangan"],"synonyms":["cangue","wooden collar"],"antonyms":[]}],"etymology":{"value":"From Chinese 枷杻 (jiā niǔ), referring to the cangue.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkæŋɡən/","syllables":"can-gan"},"inflection":{"noun_plural":"cangans"},"usage_notes":{"explanation":"The term 'cangan' specifically refers to the heavy wooden cangue used in ancient China. It is often used in historical contexts or when discussing traditional Chinese punishments. The term 'cangue' is a more general term for this type of punishment device used across East Asia.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was wearing a collar.","correct":"✓ He was wearing a cangan.","note":"While a cangan is a type of collar, it's a specific type of heavy wooden punishment device. Using 'collar' alone doesn't convey the same meaning."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["cangue","punishment","stocks","pillory"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cangan' is a specialized term referring to a historical form of punishment in China. Understanding this word requires knowledge of historical contexts and penal systems. It is not commonly used in modern English, and its usage is typically limited to discussions of history or culture."},"example_sentences":[{"sentence":"Historical accounts describe the cangan as a heavy burden for those accused of minor crimes.","translation":"歴史的な記録では、チャンガンは軽犯罪で告発された人々にとって重い負担として記述されている。","type":"noun","meaning_category":"historical punishment"},{"sentence":"The weight of the cangan made it difficult for the prisoner to move or eat.","translation":"チャンガンの重さのために、囚人は動いたり食事をしたりすることが困難だった。","type":"noun","meaning_category":"historical punishment"}]}