{"word":"Siphonophore","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"管クラゲ類：浮遊性の腔腸動物で、多くの個虫（ポリプやメデューサ）が集まって群体を形成し、それぞれが特定の役割（捕食、遊泳、生殖など）を担う。","english_definition":"A floating colonial hydrozoan (class Hydrozoa) composed of many individual zooids (polyps and medusae) each specialized for a particular function (e.g., feeding, swimming, reproduction).","examples":[{"sentence":"The Portuguese man-of-war is a well-known siphonophore.","translation":"カツオノエボシはよく知られた管クラゲ類です。"},{"sentence":"Siphonophores exhibit a high degree of polymorphism among their zooids.","translation":"管クラゲ類は、個虫間で高度な多形性を示します。"}],"collocations":["siphonophore colony (管クラゲの群体)","Portuguese man-of-war (カツオノエボシ)","zooid polymorphism (個虫の多形性)"],"synonyms":["hydrozoan colony","colonial cnidarian"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の 'siphon' (管) + 'phoros' (運ぶ、持つ) に由来。これは、一部の個虫が管状の構造を持つこと、および群体全体が管のような形を形成することに由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/saɪˈfɒnəfɔːr/","syllables":"Si-phon-o-phore"},"inflection":{"noun_plural":"Siphonophores"},"usage_notes":{"explanation":"Siphonophores are not a single organism, but a colony of specialized zooids working together. Each zooid has a specific function, such as feeding, defense, or reproduction. They are found in marine environments worldwide. The Portuguese man-of-war is a famous, and dangerous, example.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ A siphonophore is a jellyfish.","correct":"✓ A siphonophore is a colonial hydrozoan.","note":"Siphonophores are related to jellyfish, but are not true jellyfish. They are colonial organisms, while jellyfish are single organisms."}],"priority":"★☆☆"},"related_words":{"derivatives":["siphonophoran (形容詞：管クラゲ類の)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な生物学用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Siphonophore' is a scientific term referring to a type of marine animal that is not a single organism, but a colony of many smaller, specialized units called zooids. These zooids work together, with each having a specific job like feeding or protection. A well-known example is the Portuguese man-of-war. This term is typically used in biology and marine science contexts."},"example_sentences":[{"sentence":"The deep-sea expedition discovered a new species of siphonophore.","translation":"深海探査で、管クラゲ類の新しい種が発見された。","type":"noun","meaning_category":"管クラゲ類"},{"sentence":"Siphonophores use nematocysts to capture their prey.","translation":"管クラゲ類は、刺胞を使って獲物を捕獲する。","type":"noun","meaning_category":"管クラゲ類"}]}