{"word":"adminiculation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律)間接的な証拠、傍証、補助的な証拠","english_definition":"(law) corroborative evidence; evidence tending to support evidence already given.","examples":[{"sentence":"The prosecution presented several pieces of adminiculation to strengthen their case.","translation":"検察側は、事件を強化するためにいくつかの傍証を提示した。"},{"sentence":"While not direct proof, the adminiculation suggested a connection between the suspects.","translation":"直接的な証拠ではないが、傍証は容疑者間のつながりを示唆していた。"}],"collocations":["circumstantial adminiculation","corroborative adminiculation"],"synonyms":["corroboration","support","confirmation","evidence","proof"],"antonyms":["contradiction","disproof","refutation"]}],"etymology":{"value":"From Latin *adminiculum*, meaning 'support, prop,' from *adminiculari* 'to prop up,' from *ad-* 'to' + *manus* 'hand'.","priority":"★★☆"},"pronunciation":{"ipa":"/ədˌmɪnɪkjʊˈleɪʃən/","syllables":"ad-min-ic-u-la-tion"},"inflection":{"noun_plural":"adminiculations"},"usage_notes":{"explanation":"'Adminiculation' is a relatively rare and formal term, primarily used in legal contexts. It refers to indirect or circumstantial evidence that supports or strengthens other evidence, rather than directly proving a fact. It is often used to describe a chain of evidence that, when considered together, points to a particular conclusion.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The witness provided direct adminiculation of the crime.","correct":"✓ The witness provided direct evidence of the crime.","note":"Adminiculation is by definition indirect or circumstantial. Direct evidence is not adminiculation."},{"incorrect":"✗ The lawyer used adminiculation to disprove the alibi.","correct":"✓ The lawyer used evidence to disprove the alibi.","note":"Adminiculation supports a claim, it doesn't disprove one. Disproving requires refutation or contradiction."}],"priority":"★☆☆"},"related_words":{"derivatives":["adminicular (adjective)"],"phrases":["chain of adminiculation"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (very rare, legal context)","frequency_google_ngram":"非常に低頻度 (Extremely low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Adminiculation' is a highly specialized term primarily encountered in legal settings. It denotes indirect or supporting evidence that bolsters a case without directly proving a fact. Understanding this term requires familiarity with legal terminology and concepts of evidence. Its rarity makes it unlikely to be encountered outside of formal legal discussions or texts."},"example_sentences":[{"sentence":"The detective gathered various pieces of adminiculation to build a strong case against the suspect.","translation":"刑事は容疑者に対する強力な訴訟を構築するために、様々な傍証を集めた。","type":"noun","meaning_category":"証拠"},{"sentence":"The lawyer argued that the adminiculation was insufficient to convict his client.","translation":"弁護士は、傍証は彼のクライアントを有罪にするには不十分であると主張した。","type":"noun","meaning_category":"証拠"},{"sentence":"The judge considered the adminiculation presented by both sides before making a ruling.","translation":"裁判官は判決を下す前に、両側から提示された傍証を検討した。","type":"noun","meaning_category":"証拠"}]}