{"word":"adulatingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"お世辞を言うように、へつらうように、追従的に","english_definition":"in an adulatory manner; with excessive flattery or praise.","examples":[{"sentence":"The fans greeted the pop star adulatingly.","translation":"ファンはそのポップスターを追従的に迎えた。"},{"sentence":"She spoke of her mentor adulatingly, praising his every achievement.","translation":"彼女は自分の指導者のことを、そのあらゆる功績を褒め称え、へつらうように語った。"}],"collocations":["greet someone adulatingly (誰かを追従的に迎える)","speak adulatingly (へつらうように話す)","describe someone adulatingly (誰かを追従的に描写する)"],"synonyms":["flatteringly","obsequiously","sycophantically","servilely","fulsomely","ingratiatingly"],"antonyms":["critically","disparagingly","objectively"]}],"etymology":{"value":"From the adjective 'adulatory' (expressing or involving excessive admiration or flattery) + '-ly' (suffix forming adverbs). 'Adulatory' comes from the Latin 'adulari' (to flatter).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈædjʊleɪtɪŋli/","syllables":"ad-ju-lat-ing-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Adulatingly' describes actions done with excessive flattery or praise, often to gain favor or advantage. It suggests a level of insincerity or exaggeration in the expression of admiration. The word is relatively formal and not commonly used in everyday conversation. It is stronger than simply praising someone; it implies an almost fawning level of admiration.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She adulatingly helped him with his work.","correct":"✓ She helped him with his work adulatingly.","note":"The adverb 'adulatingly' should modify the verb 'helped,' describing the *manner* in which she helped, not the act of helping itself. Placing it immediately before the verb can be awkward. Placing it after the verb or at the beginning of the sentence is usually clearer."},{"incorrect":"✗ He adulatingly felt about the situation.","correct":"✓ He felt adulatory about the situation.","note":"'Adulatingly' is an adverb and modifies verbs, adjectives, or other adverbs. 'Adulatory' is an adjective and describes nouns. The sentence requires an adjective to describe his feelings."}],"priority":"★★☆"},"related_words":{"derivatives":["adulate (verb: to praise excessively or servilely)","adulation (noun: excessive admiration or flattery)","adulatory (adjective: expressing or involving excessive admiration or flattery)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - a relatively rare word.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Adulatingly' is an advanced word describing actions performed with excessive flattery or praise. It's used to show that someone is praising another person in a way that seems insincere or exaggerated, often to gain favor. Because of its nuanced meaning and relatively low frequency, it's more likely to be encountered in formal writing or speech."},"example_sentences":[{"sentence":"The courtiers bowed adulatingly before the queen.","translation":"廷臣たちは女王の前にへつらうようにひざまずいた。","type":"adverb","meaning_category":"お世辞を言うように"},{"sentence":"He wrote about the director adulatingly, ignoring any potential flaws in his work.","translation":"彼は監督の作品の潜在的な欠点を無視して、追従的に書いた。","type":"adverb","meaning_category":"へつらうように"},{"sentence":"The biographer described the celebrity's early life adulatingly, creating a hagiographic portrait.","translation":"伝記作家はその有名人の初期の人生を追従的に描写し、聖人伝のような肖像を作り上げた。","type":"adverb","meaning_category":"追従的に"}]}