{"word":"paratitles","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(書籍、記事などの)周辺情報、パラテクスト (タイトル、目次、序文、奥付、カバーデザイン、挿絵など、本文を取り囲み、読者の解釈に影響を与える要素)","english_definition":"The supplementary material that surrounds and presents a main text, such as titles, prefaces, epigraphs, dedications, illustrations, and cover designs, which influence a reader's interpretation of the text.","examples":[{"sentence":"Genette's theory of paratexts explores how these elements shape our understanding of a literary work.","translation":"ジュネットのパラテクスト理論は、これらの要素が文学作品の理解をどのように形作るかを考察する。"},{"sentence":"The paratitles of a book can be just as important as the text itself in conveying the author's intentions.","translation":"本のパラテクストは、著者の意図を伝える上で、本文自体と同じくらい重要である。"},{"sentence":"Analyzing the paratitles of early printed books provides insights into the publishing practices of the time.","translation":"初期の印刷本のパラテクストを分析することで、当時の出版慣行についての洞察が得られる。"}],"collocations":["paratextual analysis (パラテクスト分析)","thresholds of interpretation (解釈の閾)","peritext (ペリテクスト - 本文に物理的に隣接するパラテクスト)","epitext (エピテクスト - 本文から物理的に離れたパラテクスト)"],"synonyms":["supplementary material","framing devices","peripheral texts","thresholds of interpretation"],"antonyms":["main text","core content"]},{"part_of_speech":"noun","definition":"(デジタルメディアにおける)メタデータ、タグ、説明文など、コンテンツを説明し、アクセスを容易にする情報","english_definition":"In digital media, metadata, tags, descriptions, and other information that describes and facilitates access to content.","examples":[{"sentence":"Effective use of paratitles, such as meta descriptions and alt text, can improve a website's search engine ranking.","translation":"メタディスクリプションや代替テキストなどのパラテクストを効果的に使用することで、ウェブサイトの検索エンジンランキングを向上させることができる。"},{"sentence":"The paratitles associated with a video on YouTube include the title, description, tags, and thumbnail image.","translation":"YouTubeの動画に関連付けられたパラテクストには、タイトル、説明、タグ、サムネイル画像が含まれる。"},{"sentence":"Digital paratitles play a crucial role in organizing and retrieving information in online databases.","translation":"デジタルパラテクストは、オンラインデータベースにおける情報の整理と検索において重要な役割を果たす。"}],"collocations":["metadata (メタデータ)","tags (タグ)","descriptions (説明文)","alt text (代替テキスト)","search engine optimization (SEO - 検索エンジン最適化)"],"synonyms":["metadata","tags","descriptions","labels","indexical information"],"antonyms":["content","data"]}],"etymology":{"value":"The term \"paratitles\" is derived from the French word \"paratexte,\" coined by Gérard Genette in his 1987 book *Seuils* (Thresholds). It combines the prefix \"para-\" (meaning \"beside\" or \"alongside\") with \"text,\" indicating elements that exist alongside the main text.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpærəˈtaɪtəlz/","syllables":"par-a-ti-tles"},"inflection":{"noun_plural":"paratitles"},"usage_notes":{"explanation":"The term \"paratitles\" refers to the supplementary elements that surround and present a main text, influencing its interpretation. In print media, these include titles, prefaces, illustrations, and cover designs. In digital media, they encompass metadata, tags, and descriptions. The concept, popularized by Gérard Genette, highlights how these peripheral elements shape a reader's or user's understanding and engagement with the core content. Understanding paratitles is crucial for analyzing how texts are framed, marketed, and received.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The paratitle is the main text itself.","correct":"✓ The paratitle is supplementary to the main text.","note":"Paratitles are supplementary materials that surround the main text, not the text itself."},{"incorrect":"✗ Paratitles are only relevant to print books.","correct":"✓ Paratitles are also relevant to digital media, including websites and videos.","note":"The concept of paratitles extends beyond print media to include digital content and its associated metadata."}],"priority":"★★☆"},"related_words":{"derivatives":["paratext (単数形)","paratextual (形容詞)"],"related_terms":["peritext (本文に物理的に隣接するパラテクスト)","epitext (本文から物理的に離れたパラテクスト)","authorial paratext (著者によって作成されたパラテクスト)","editorial paratext (編集者によって作成されたパラテクスト)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in academic and literary studies contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"paratitles\" is primarily used in academic contexts, particularly in literary theory and media studies. It refers to the supplementary elements that frame and present a main text, influencing its interpretation. These elements can include titles, prefaces, cover designs, metadata, tags, and descriptions. Understanding the concept of paratitles requires familiarity with critical theory and media analysis. It is not a commonly used term in general conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The book's cover design, a key paratitle, immediately signals its genre.","translation":"本のカバーデザインは、重要なパラテクストであり、そのジャンルをすぐに示している。","type":"noun","meaning_category":"周辺情報 (書籍)"},{"sentence":"Metadata serves as paratitles for digital content, helping users find relevant information.","translation":"メタデータはデジタルコンテンツのパラテクストとして機能し、ユーザーが関連情報を見つけるのに役立つ。","type":"noun","meaning_category":"周辺情報 (デジタルメディア)"},{"sentence":"A paratextual analysis of the novel reveals the publisher's marketing strategy.","translation":"その小説のパラテクスト分析は、出版社のマーケティング戦略を明らかにする。","type":"noun","meaning_category":"周辺情報 (書籍)"},{"sentence":"The alt text on an image acts as a paratitle, providing context for visually impaired users.","translation":"画像の代替テキストはパラテクストとして機能し、視覚障碍者のユーザーにコンテキストを提供する。","type":"noun","meaning_category":"周辺情報 (デジタルメディア)"}]}