{"word":"sunspot","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"太陽黒点","english_definition":"a spot or patch appearing from time to time on the sun's surface, appearing dark by contrast with its surroundings.","examples":[{"sentence":"Sunspots are cooler areas on the Sun's surface.","translation":"太陽黒点は太陽表面の比較的低温な領域です。"},{"sentence":"The number of sunspots varies in an 11-year cycle.","translation":"太陽黒点の数は11年周期で変動します。"},{"sentence":"Scientists study sunspots to understand the Sun's magnetic activity.","translation":"科学者たちは太陽の磁気活動を理解するために太陽黒点を研究します。"}],"collocations":["sunspot activity (太陽黒点活動)","sunspot cycle (太陽黒点周期)","observe sunspots (太陽黒点を観測する)","count sunspots (太陽黒点を数える)","measure sunspots (太陽黒点を測定する)"],"synonyms":["solar spot"],"antonyms":[]}],"etymology":{"value":"'Sun' + 'spot'. First used in the early 17th century.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsʌn.spɒt/","syllables":"sun-spot"},"inflection":{"noun_plural":"sunspots"},"usage_notes":{"explanation":"Sunspots are temporary phenomena on the Sun's photosphere that appear as dark spots compared to surrounding regions. They are caused by intense magnetic activity, which inhibits convection and results in reduced surface temperature. The number of sunspots varies over an approximately 11-year solar cycle. Studying sunspots helps scientists understand the Sun's magnetic field and its influence on Earth.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The sunspot is very hot.","correct":"✓ The sunspot is relatively cooler than the surrounding areas.","note":"Sunspots appear dark because they are cooler than the surrounding photosphere, not hotter."},{"incorrect":"✗ Sunspots cause global warming.","correct":"✓ Sunspots are related to solar activity, but the direct link to global warming is complex and debated.","note":"While sunspot activity is related to solar activity, the direct impact on global warming is a complex and debated topic."}],"priority":"★★☆"},"related_words":{"derivatives":["sunspotter (noun: someone who observes or studies sunspots)"],"phrases":["solar cycle (太陽周期)","solar flare (太陽フレア)","photosphere (光球)","magnetosphere (磁気圏)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, mainly used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Sunspot' refers to dark spots on the Sun's surface. These spots are cooler than the surrounding areas and are caused by strong magnetic activity. The number of sunspots changes in an 11-year cycle. Understanding sunspots is important for studying the Sun's behavior and its effects on Earth. This term is commonly used in science and astronomy.","priority":"★★☆"},"example_sentences":[{"sentence":"The astronomer used a telescope to observe the **sunspot**.","translation":"天文学者は望遠鏡を使って太陽黒点を観測した。","type":"noun","meaning_category":"太陽黒点"},{"sentence":"Increased **sunspot** activity can affect radio communications on Earth.","translation":"太陽黒点活動の増加は地球上の無線通信に影響を与える可能性がある。","type":"noun","meaning_category":"太陽黒点"},{"sentence":"The **sunspot** cycle has a period of approximately 11 years.","translation":"太陽黒点周期は約11年である。","type":"noun","meaning_category":"太陽黒点"}]}