{"word":"Callipees","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(historical) A Native American people who lived in present-day South Carolina during the early colonial period.","english_definition":"An indigenous people inhabiting the region of present-day South Carolina during the early colonial era.","examples":[{"sentence":"The Callipees were encountered by early European explorers in the 16th century.","translation":"カリピーズは16世紀初頭にヨーロッパの探検家によって遭遇された。"},{"sentence":"Historical records about the Callipees are scarce.","translation":"カリピーズに関する歴史的記録は乏しい。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Likely derived from a Native American language, but the exact origin and meaning are uncertain due to limited documentation.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌkæləˈpiːz/","syllables":"Cal-li-pees"},"inflection":{"noun_plural":"Callipees"},"usage_notes":{"explanation":"The term 'Callipees' refers to a specific group of Native Americans encountered during the early years of European colonization in what is now South Carolina. Information about them is limited, and they are not as well-known as some other tribes of the region.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"related_tribes":["Cusabo","Edisto","Sewee"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"'Callipees' is a historical term referring to a specific group of Native Americans. It is not a commonly used word and would primarily be encountered in historical texts or academic discussions about the early colonial period of South Carolina. Due to the limited information available about them, understanding requires some background knowledge of the region's history."},"example_sentences":[{"sentence":"Early maps of South Carolina sometimes indicate the location of Callipees villages.","translation":"サウスカロライナの初期の地図には、カリピーズの村の位置が示されていることがある。","type":"noun","meaning_category":"historical"},{"sentence":"The interaction between the Callipees and European settlers is poorly documented.","translation":"カリピーズとヨーロッパ人入植者との間の交流は、十分に記録されていない。","type":"noun","meaning_category":"historical"}]}