{"word":"reabsorption","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"再吸収","english_definition":"The process by which a substance that has already been absorbed into the body is absorbed again.","examples":[{"sentence":"Reabsorption of water occurs in the kidneys.","translation":"水の再吸収は腎臓で行われる。"},{"sentence":"The reabsorption of nutrients is essential for maintaining homeostasis.","translation":"栄養素の再吸収は、恒常性を維持するために不可欠である。"}],"collocations":["tubular reabsorption (尿細管再吸収)","renal reabsorption (腎再吸収)","electrolyte reabsorption (電解質再吸収)","water reabsorption (水再吸収)","nutrient reabsorption (栄養素再吸収)"],"synonyms":["reuptake","resorption"],"antonyms":["secretion","excretion"]}],"etymology":{"value":"The word \"reabsorption\" is formed by combining the prefix \"re-\" (meaning again) with the word \"absorption\" (the process of absorbing).","priority":"★★★"},"pronunciation":{"ipa":"/ˌriːəbˈzɔːrpʃən/","syllables":"re-ab-sorp-tion"},"inflection":{"noun_plural":"reabsorptions"},"usage_notes":{"explanation":"\"Reabsorption\" refers to the process where a substance that has already been absorbed by the body is taken back into the system. This is crucial in various physiological processes, particularly in the kidneys where water, electrolytes, and other essential substances are reabsorbed from the filtrate back into the bloodstream, preventing their loss from the body. The term is commonly used in medical and scientific contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The body's absorption of nutrients.","correct":"The body's reabsorption of nutrients.","note":"Use 'reabsorption' when referring to the process of absorbing something that has already been absorbed once."},{"incorrect":"Reabsorption is the same as secretion.","correct":"Reabsorption is the opposite of secretion.","note":"Reabsorption is the process of taking back substances, while secretion is the process of releasing them."}],"priority":"★★☆"},"related_words":{"derivatives":["reabsorb (verb)","absorb (verb)","absorption (noun)"],"phrasal_verbs":[],"related_terms":["kidney","nephron","tubule","glomerulus","filtrate","electrolyte","homeostasis"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific and medical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"\"Reabsorption\" is a technical term primarily used in biology and medicine. It describes the process where a substance that has already been absorbed by the body is taken back into the system. A common example is the reabsorption of water and nutrients in the kidneys. Because it is a specialized term, it is more commonly encountered in scientific literature or medical discussions."},"example_sentences":[{"sentence":"The kidneys play a vital role in the reabsorption of electrolytes.","translation":"腎臓は電解質の再吸収において重要な役割を果たす。","type":"general","meaning_category":"general"},{"sentence":"Hormones can affect the rate of water reabsorption in the renal tubules.","translation":"ホルモンは腎尿細管における水の再吸収速度に影響を与える可能性がある。","type":"physiology","meaning_category":"physiology"},{"sentence":"Impaired reabsorption can lead to various health problems.","translation":"再吸収の障害は、さまざまな健康問題を引き起こす可能性がある。","type":"medical","meaning_category":"medical"}]}