{"word":"foregirth","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(馬具)前腹帯、胸繋","english_definition":"A strap that passes around the chest of a horse to secure a saddle or harness.","examples":[{"sentence":"The foregirth kept the saddle from slipping back.","translation":"前腹帯は鞍が後ろにずれるのを防いだ。"}],"collocations":["tighten the foregirth","loosen the foregirth"],"synonyms":["breastplate","breast girth"],"antonyms":[]}],"etymology":{"value":"'Fore-' (前) + 'girth' (腹帯)","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɔːrɡɜːθ/","syllables":"fore-girth"},"inflection":{"noun_plural":"foregirths"},"usage_notes":{"explanation":"A foregirth is a piece of horse tack, specifically a strap that goes around the horse's chest, just in front of the front legs. It is used to help keep the saddle or harness in place, especially on horses with a sloping shoulder or those used for activities where the saddle might slip back.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The foregirth was around the horse's waist.","correct":"✓ The foregirth was around the horse's chest.","note":"The foregirth goes around the chest, not the waist."}],"priority":"★★☆"},"related_words":{"derivatives":["girth"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'foregirth' is a specialized term related to horse riding and tack. It refers to a specific strap used in equestrian activities. Due to its niche usage, it is not commonly encountered outside of contexts involving horses. Understanding the term requires familiarity with equestrian equipment.","priority":"★★☆"},"example_sentences":[{"sentence":"Make sure the foregirth isn't too tight, or it will restrict the horse's breathing.","translation":"前腹帯がきつすぎないように注意してください。馬の呼吸を妨げる可能性があります。","type":"noun","meaning_category":"horse tack"},{"sentence":"The rider adjusted the foregirth before mounting the horse.","translation":"騎手は馬に乗る前に前腹帯を調整した。","type":"noun","meaning_category":"horse tack"}]}