{"word":"T-fitting","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"T字継手、T型継手","english_definition":"A pipe fitting that is shaped like the letter T, used to connect three pipes together.","examples":[{"sentence":"The plumber used a T-fitting to connect the pipes under the sink.","translation":"配管工は、シンクの下のパイプを接続するためにT字継手を使用した。"},{"sentence":"We need to buy a T-fitting to complete the plumbing project.","translation":"配管プロジェクトを完了するには、T字継手を購入する必要があります。"}],"collocations":["plumbing T-fitting","PVC T-fitting","copper T-fitting","threaded T-fitting","reducing T-fitting"],"synonyms":["tee","T-connector"],"antonyms":[]}],"etymology":{"value":"The name comes from the fitting's resemblance to the letter 'T'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtiːˌfɪtɪŋ/","syllables":"T-fit-ting"},"inflection":{"noun_plural":"T-fittings"},"usage_notes":{"explanation":"A T-fitting is a common type of pipe fitting used in plumbing and piping systems. It allows for a branch connection to be made from a main pipe run. T-fittings are available in various materials (e.g., PVC, copper, steel) and sizes to accommodate different pipe diameters and applications.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need a tee fitting for the water line.","correct":"✓ I need a T-fitting for the water line.","note":"While 'tee' is sometimes used informally, 'T-fitting' is the more technically correct term."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The term 'T-fitting' is a technical term used in plumbing and construction. It refers to a specific type of pipe fitting shaped like the letter 'T'. Understanding this term is essential for anyone working in these fields or undertaking DIY plumbing projects. The difficulty arises from its specialized vocabulary rather than complex grammar."},"example_sentences":[{"sentence":"The **T-fitting** allowed us to split the water supply to two different faucets.","translation":"T字継手のおかげで、給水を2つの異なる蛇口に分岐させることができました。","type":"noun","meaning_category":"T字継手"},{"sentence":"Make sure to use the correct size **T-fitting** for your pipe diameter.","translation":"パイプの直径に合った正しいサイズのT字継手を使用してください。","type":"noun","meaning_category":"T字継手"}]}