{"word":"daysack","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主にイギリス英語) 日帰り旅行用リュックサック、デイパック","english_definition":"(mainly British English) a small rucksack for carrying things on a day trip or hike.","examples":[{"sentence":"I packed a sandwich and a bottle of water in my daysack.","translation":"日帰り用リュックサックにサンドイッチと水のボトルを詰めた。"},{"sentence":"She carried her camera and guidebook in her daysack.","translation":"彼女はカメラとガイドブックを日帰り用リュックサックに入れて持ち歩いた。"}],"collocations":["pack a daysack","carry a daysack","small daysack","large daysack"],"synonyms":["daypack","backpack","rucksack","knapsack"],"antonyms":[]}],"etymology":{"value":"'Day' + 'sack'.  A sack intended for use during the day, especially for carrying supplies on a day trip.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdeɪsæk/","syllables":"day-sack"},"inflection":{"noun_plural":"daysacks"},"usage_notes":{"explanation":"'Daysack' is primarily a British English term. In American English, 'daypack' is the more common term. Both refer to a small backpack suitable for carrying items needed for a day's outing.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I went hiking with my daysack, but it was too big.","correct":"✓ I went hiking with my daysack, but it was too heavy. / ✓ I went hiking with my daysack, but it was too full.","note":"Daysacks are typically small, so saying it was 'too big' is less common than saying it was 'too heavy' or 'too full'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"A2","text":"A 'daysack' is a small bag that you carry on your back. It's used for carrying things you need for a day trip, like food, water, or a map. It's another word for 'daypack'."},"example_sentences":[{"sentence":"He always takes a daysack when he goes hiking.","translation":"彼はハイキングに行くときはいつも日帰り用リュックサックを持っていく。","type":"noun","meaning_category":"日帰り用リュックサック"},{"sentence":"The daysack was lightweight and comfortable to wear.","translation":"その日帰り用リュックサックは軽量で、着心地が良かった。","type":"noun","meaning_category":"日帰り用リュックサック"}]}