{"word":"effortfully","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"努力して、苦労して、骨を折って","english_definition":"in a manner requiring effort or exertion; with difficulty or strain.","examples":[{"sentence":"She effortfully climbed the steep hill, her breath coming in ragged gasps.","translation":"彼女は息を切らしながら、苦労して急な丘を登った。"},{"sentence":"He effortfully lifted the heavy box, straining his muscles.","translation":"彼は筋肉を痛めながら、苦労して重い箱を持ち上げた。"},{"sentence":"The team worked effortfully to complete the project on time.","translation":"チームは時間内にプロジェクトを完了させるために、努力して働いた。"}],"collocations":["work effortfully","climb effortfully","lift effortfully","try effortfully","speak effortfully"],"synonyms":["laboriously","strenuously","arduously","toilsomely","with difficulty","with great effort","with much effort"],"antonyms":["effortlessly","easily","smoothly","naturally","without effort"]}],"etymology":{"value":"\"Effortfully\" is derived from the word \"effortful,\" which is formed by combining the noun \"effort\" with the suffix \"-ful\" (meaning full of or characterized by). The adverbial form \"effortfully\" is then created by adding the suffix \"-ly\" to \"effortful.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˈefərtfəli/","syllables":"ef-fort-ful-ly"},"inflection":{"notes":"As an adverb, \"effortfully\" does not have different inflections."},"usage_notes":{"explanation":"\"Effortfully\" describes actions performed with noticeable effort or difficulty. It emphasizes the exertion or strain involved in the activity. It is often used to describe physical actions, but can also be applied to mental or emotional endeavors that require significant effort. The word is less common than its antonym, \"effortlessly,\" but it is useful for highlighting the struggle or difficulty associated with a particular task.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He tried effortful to solve the problem.","correct":"✓ He tried effortfully to solve the problem.","note":"\"Effortful\" is an adjective, so it cannot directly modify a verb. Use the adverb \"effortfully\" to describe how the action is performed."},{"incorrect":"✗ She completed the task with effortful.","correct":"✓ She completed the task effortfully. / ✓ She completed the task with effort.","note":"\"Effortful\" is an adjective and cannot be used as an adverb. Use \"effortfully\" or the noun \"effort\" with the preposition \"with.\""}],"priority":"★★☆"},"related_words":{"derivatives":["effort (noun)","effortful (adjective)","effortless (adjective)","effortlessly (adverb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Effortfully\" is an adverb that describes doing something with a lot of effort or difficulty. It's used when you want to emphasize that an action requires significant exertion or strain. It's not a very common word, so it's more likely to be found in formal writing or when someone wants to specifically highlight the difficulty of a task. For example, \"He effortfully pushed the car out of the mud\" means he had to use a lot of strength and struggle to move the car.","example_sentences":[{"sentence":"The old man effortfully climbed the stairs, pausing to catch his breath on each step.","translation":"その老人は、一段一段息を切らしながら、苦労して階段を上った。","type":"general"},{"sentence":"She effortfully crafted each word, trying to convey the depth of her emotions.","translation":"彼女は感情の深さを伝えようと、言葉の一つ一つを苦心して選び抜いた。","type":"general"},{"sentence":"He effortfully swam against the strong current, his muscles burning with fatigue.","translation":"彼は強い流れに逆らって、筋肉が疲労で燃えるように感じながら、苦労して泳いだ。","type":"physical exertion"}]}}