{"word":"eagres","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"plural of eagre (a tidal bore)","english_definition":"plural form of the word 'eagre', which refers to a tidal bore, a tidal phenomenon in which the leading edge of the incoming tide forms a wave (or waves) of water that travels up a river or narrow bay against the direction of the river or bay's current.","examples":[{"sentence":"The local villagers eagerly awaited the arrival of the eagres.","translation":"地元の村人たちは、遡上波の到来を心待ちにしていた。"},{"sentence":"The powerful eagres surged up the Severn Estuary.","translation":"強力な遡上波がセヴァーン川の河口を押し寄せた。"}],"collocations":["powerful eagres","observe the eagres","arrival of the eagres"],"synonyms":["tidal bores","bore tides"],"antonyms":[]}],"etymology":{"value":"From 'eagre', which has uncertain origins, possibly related to Old English 'ēa' (river) or a Celtic source.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈiːɡərz/","syllables":"ea-gres"},"inflection":{"noun_plural":"eagres"},"usage_notes":{"explanation":"The word 'eagres' is simply the plural form of 'eagre'. An 'eagre' is a specific type of tidal bore, a relatively rare phenomenon. Therefore, the word is not commonly used in everyday conversation but is more likely to appear in geographical or scientific contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The eagre were impressive.","correct":"✓ The eagres were impressive.","note":"When referring to multiple tidal bores, use the plural form 'eagres'."}],"priority":"★★☆"},"related_words":{"derivatives":["eagre"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'eagres' is the plural form of 'eagre', a relatively uncommon term referring to a tidal bore. Understanding this word requires familiarity with geographical phenomena and scientific vocabulary. It is unlikely to be encountered in everyday conversation but may appear in specialized texts or documentaries about rivers and tides."},"example_sentences":[{"sentence":"Photographers traveled from afar to capture the spectacular sight of the eagres.","translation":"写真家たちは、その壮観な遡上波の光景を捉えるために遠方からやってきた。","type":"noun","meaning_category":"plural of eagre"},{"sentence":"The height of the eagres varied depending on the river's depth and the tide's strength.","translation":"遡上波の高さは、川の深さと潮の強さによって異なった。","type":"noun","meaning_category":"plural of eagre"}]}