{"word":"regrater","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史的な意味合いで)買い占め業者、転売人。特に、市場で商品を購入し、同じ市場内でより高い価格で再販する人。","english_definition":"(historical) One who buys up provisions in a market, and sells them again in the same market or within four miles of it.","examples":[{"sentence":"In the past, regraters were often viewed negatively for artificially inflating prices.","translation":"過去には、買い占め業者は価格を人為的に釣り上げているとして、しばしば否定的に見られていた。"},{"sentence":"Laws were enacted to prevent regraters from monopolizing essential goods.","translation":"買い占め業者が生活必需品を独占するのを防ぐために法律が制定された。"}],"collocations":["forestaller, regrater, and engrosser (買い占め業者、転売人、独占業者)"],"synonyms":["huckster","peddler","monger","middleman","speculator"],"antonyms":[]},{"part_of_speech":"noun","definition":"(現代的な意味合いで、軽蔑的な意味合いで)転売人、特に人気のある商品やチケットを買い占め、高値で転売する人。","english_definition":"(modern, derogatory) A reseller, especially one who buys up popular items or tickets and resells them at inflated prices.","examples":[{"sentence":"The concert tickets were all bought up by regraters within minutes of going on sale.","translation":"コンサートのチケットは発売開始から数分で転売人によって買い占められた。"},{"sentence":"Many people are frustrated by regraters who profit from reselling limited-edition items.","translation":"多くの人々は、限定版商品を転売して利益を得る転売人に不満を感じている。"}],"collocations":["ticket regrater","scalper"],"synonyms":["scalper","reseller","profiteer"],"antonyms":[]}],"etymology":{"value":"Old French 'regrater' (to scrape again, retail), from re- (again) + grater (to scrape). Originally referred to scraping or cleaning goods for resale, later applied to the practice of buying and reselling in the same market.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈɡreɪtər/","syllables":"re-gra-ter"},"inflection":{"noun_plural":"regraters"},"usage_notes":{"explanation":"The term 'regrater' has historical roots in market regulations and negative connotations associated with price manipulation. While less commonly used today, it still appears in discussions about ticket scalping, reselling limited-edition items, and other forms of arbitrage where individuals profit from reselling goods at inflated prices. The term often carries a negative connotation, implying unfair or unethical practices.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a regrater because he likes to buy things.","correct":"✓ He is a regrater because he buys things to resell them for a profit.","note":"A regrater specifically buys items with the intention of reselling them for a profit, not just for personal use. The intent to resell is crucial to the definition."}],"priority":"★☆☆"},"related_words":{"derivatives":["regrate (verb, archaic: to buy and resell)","regratry (noun, archaic: the act of regrating)"],"phrases":["ticket regrating (チケットの転売)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Regrater' is a relatively uncommon word with historical and legal connotations. It refers to someone who buys goods, especially food or tickets, and resells them in the same market or area for a profit. This practice was often seen as unethical because it could artificially inflate prices. While the word is not frequently used in modern English, it can still be found in discussions about price gouging and ticket scalping. Understanding the historical context is helpful for interpreting its meaning."},"example_sentences":[{"sentence":"The town council attempted to control regraters who were driving up the price of grain.","translation":"町議会は穀物の価格をつり上げている転売業者を規制しようとした。","type":"noun","meaning_category":"買い占め業者"},{"sentence":"Online platforms have made it easier for regraters to resell tickets at exorbitant prices.","translation":"オンラインプラットフォームは、転売業者が法外な価格でチケットを転売することを容易にした。","type":"noun","meaning_category":"転売人"}]}