{"word":"Phaeomelanin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"フェオメラニン：赤色から黄色の色素で、哺乳類において髪、皮膚、羽毛に見られる。","english_definition":"A type of melanin pigment found in mammals, responsible for red and yellow hues in hair, skin, and feathers.","examples":[{"sentence":"Phaeomelanin gives red hair its distinctive color.","translation":"フェオメラニンは、赤毛に独特の色を与えます。"},{"sentence":"The relative amount of phaeomelanin and eumelanin determines hair color.","translation":"フェオメラニンとユーメラニンの相対的な量が髪の色を決定します。"}],"collocations":["phaeomelanin production","phaeomelanin synthesis","high phaeomelanin levels"],"synonyms":["red pigment","yellow pigment"],"antonyms":["eumelanin"]}],"etymology":{"value":"ギリシャ語の 'phaios' (暗い色の) + 'melas' (黒い) + '-in' (化学物質を示す接尾辞) に由来する。名前は、この色素が他のメラニンよりも淡い色合いであることから来ている。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfiːoʊˈmɛlənɪn/","syllables":"fee-o-mel-a-nin"},"inflection":{"noun_plural":"phaeomelanins"},"usage_notes":{"explanation":"Phaeomelanin is a type of melanin, a pigment responsible for coloration in animals. Unlike eumelanin, which produces brown and black colors, phaeomelanin produces red and yellow colors. The ratio of phaeomelanin to eumelanin determines the specific color of hair, skin, and feathers.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Pheomelanin is only found in redheads.","correct":"✓ Phaeomelanin is more prevalent in redheads, but is present in varying amounts in individuals with blonde or light brown hair as well.","note":"Phaeomelanin is not exclusive to redheads but is present in varying degrees in individuals with other hair colors. The amount determines the color expression."}],"priority":"★★☆"},"related_words":{"derivatives":["melanin","eumelanin","pigmentation"],"related_terms":["melanocyte","MC1R gene","pigment"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Phaeomelanin is a specialized term in biology and genetics, specifically related to pigmentation. Understanding requires familiarity with basic concepts of biology, genetics, and chemistry. The term is primarily used in scientific and technical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The presence of phaeomelanin in the skin can increase susceptibility to UV damage.","translation":"皮膚中のフェオメラニンの存在は、紫外線による損傷を受けやすくする可能性があります。","type":"scientific"},{"sentence":"Genetic studies have linked variations in the MC1R gene to increased phaeomelanin production.","translation":"遺伝子研究により、MC1R遺伝子の変異がフェオメラニンの生成増加に関連付けられています。","type":"scientific"}]}