{"word":"unhymned","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"賛美歌で歌われていない、賛美歌が作られていない","english_definition":"Not celebrated in hymns; not having hymns written about it.","examples":[{"sentence":"The beauty of the remote valley remained unhymned by poets or composers.","translation":"その人里離れた谷の美しさは、詩人や作曲家によって賛美歌で歌われることはなかった。"},{"sentence":"Many acts of everyday heroism go unhymned.","translation":"日々の英雄的行為の多くは、賛美歌で歌われることなく過ぎ去る。"}],"collocations":["unhymned beauty","unhymned heroism","unhymned virtue"],"synonyms":["unsung","uncelebrated","unpraised","unrecognized"],"antonyms":["hymned","celebrated","praised","recognized"]}],"etymology":{"value":"\"un-\" (not) + \"hymned\" (celebrated in a hymn).","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈhɪmd/","syllables":"un-hymned"},"inflection":{"notes":"This word does not have plural forms or comparative/superlative forms, as it is an adjective."},"usage_notes":{"explanation":"The word \"unhymned\" is relatively rare and literary. It is typically used to describe something that deserves to be praised or celebrated, but has not been, especially in a formal or religious way (like a hymn). It often carries a sense of something overlooked or forgotten.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unhymned song played on the radio.","correct":"✓ The unsung song played on the radio.","note":"\"Unhymned\" refers to something that has not been celebrated *in a hymn*, not just any song. \"Unsung\" is more general and appropriate for a song that is not well-known."}],"priority":"★★☆"},"related_words":{"derivatives":["hymn (noun): a religious song or poem of praise to God or a god.","hymnal (noun): a collection of hymns.","hymning (verb): singing hymns."],"related_concepts":["praise","worship","celebration","recognition","poetry","music"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unhymned\" is a sophisticated term used to describe something that has not been celebrated or praised in a formal, often religious, way, specifically through hymns. It implies that the subject deserves recognition but has been overlooked or forgotten. This word is not commonly used in everyday conversation and is more likely to be found in literary or academic contexts."},"example_sentences":[{"sentence":"The sacrifices of the frontline workers during the pandemic remained largely unhymned.","translation":"パンデミック中の最前線労働者の犠牲は、ほとんど賛美されることなく過ぎ去った。","type":"adjective","meaning_category":"Not celebrated in hymns"},{"sentence":"Though the invention had greatly improved lives, its creator died unhymned and in poverty.","translation":"その発明は人々の生活を大いに改善したが、その発明者は賛美されることもなく、貧困の中で亡くなった。","type":"adjective","meaning_category":"Not celebrated in hymns"}]}