{"word":"hematoscope","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"分光比色計、血液分光器","english_definition":"An instrument for spectroscopically examining blood; a type of spectrophotometer used to measure the color and spectral properties of blood.","examples":[{"sentence":"The hematoscope is used to determine the concentration of hemoglobin in a blood sample.","translation":"ヘマトスコープは、血液サンプル中のヘモグロビンの濃度を測定するために使用されます。"}],"collocations":["use a hematoscope","hematoscope reading","calibrate the hematoscope"],"synonyms":["spectrophotometer","hemoglobinometer"],"antonyms":[]}],"etymology":{"value":"From Greek 'haima' (blood) + 'skopeō' (to view, examine).","priority":"★★☆"},"pronunciation":{"ipa":"/hɪˈmætəˌskoʊp/","syllables":"he-ma-to-scope"},"inflection":{"noun_plural":"hematoscopes"},"usage_notes":{"explanation":"A hematoscope is a scientific instrument used primarily in medical laboratories for analyzing blood samples. It works by passing light through the sample and measuring the amount of light absorbed or transmitted at different wavelengths. This allows for the determination of various properties of the blood, such as hemoglobin concentration and oxygen saturation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor used a hematoscope to take blood from the patient.","correct":"✓ The doctor used a needle to take blood from the patient, then analyzed it with a hematoscope.","note":"A hematoscope is used to analyze blood, not to draw it."}],"priority":"★★☆"},"related_words":{"derivatives":["hematoscopy (noun: the examination of blood using a hematoscope)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'hematoscope' is highly specialized, primarily encountered within medical or scientific contexts related to hematology and laboratory analysis. Understanding its function necessitates familiarity with spectrophotometry and blood analysis techniques. Due to its limited applicability outside these specific fields, it is considered a term of advanced scientific vocabulary."},"example_sentences":[{"sentence":"The lab technician calibrated the hematoscope before analyzing the patient's blood sample.","translation":"検査技師は、患者の血液サンプルを分析する前にヘマトスコープを校正しました。","type":"general","meaning_category":"instrument"},{"sentence":"Using the hematoscope, they were able to precisely measure the hemoglobin levels.","translation":"ヘマトスコープを使用して、彼らはヘモグロビンのレベルを正確に測定することができました。","type":"general","meaning_category":"measurement"}]}