{"word":"dead-drunkenness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"泥酔、死んだように酔っ払うこと","english_definition":"A state of extreme intoxication, resembling a state of unconsciousness or near death.","examples":[{"sentence":"He was in a state of dead-drunkenness after the party.","translation":"彼はパーティーの後、泥酔状態だった。"},{"sentence":"The police found him in a dead-drunkenness sleep on the park bench.","translation":"警察は彼が公園のベンチで泥酔して眠っているのを見つけた。"}],"collocations":["fall into dead-drunkenness (泥酔状態に陥る)","sleep in dead-drunkenness (泥酔して眠る)"],"synonyms":["drunken stupor","extreme intoxication","oblivious drunkenness"],"antonyms":["sobriety","clear-headedness"]}],"etymology":{"value":"'Dead' emphasizes the extreme state of intoxication, suggesting a loss of consciousness or control, combined with 'drunkenness', the state of being drunk.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɛdˈdrʌŋkənnəs/","syllables":"dead-drunk-en-ness"},"inflection":{"noun_plural":"dead-drunkennesses (rare)"},"usage_notes":{"explanation":"'Dead-drunkenness' is a somewhat archaic or literary term used to describe a state of extreme intoxication. It implies a level of inebriation where the person is virtually unresponsive or unconscious due to alcohol consumption. It is not a commonly used term in modern everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was dead-drunkenness.","correct":"✓ He was in a state of dead-drunkenness.","note":"'Dead-drunkenness' is a noun, so it needs to be used with appropriate articles or prepositions."}],"priority":"★★☆"},"related_words":{"derivatives":["dead-drunk (adjective: 泥酔した)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Not commonly used in modern English)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Dead-drunkenness' is a relatively uncommon and somewhat archaic term that describes a state of extreme intoxication, bordering on unconsciousness. It is not part of everyday vocabulary and is more likely to be encountered in literature or historical contexts. The term is self-explanatory, combining 'dead' to emphasize the severity and 'drunkenness' to indicate the state of intoxication."},"example_sentences":[{"sentence":"The old sailor recounted tales of his youthful adventures and bouts of dead-drunkenness.","translation":"その老船乗りは、若い頃の冒険と泥酔の日々について語った。","type":"noun","meaning_category":"泥酔"},{"sentence":"After consuming a bottle of whiskey, he succumbed to dead-drunkenness.","translation":"ウイスキーを一本飲み干した後、彼は泥酔状態に陥った。","type":"noun","meaning_category":"泥酔"}]}