{"word":"Palamite","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A follower of Gregory Palamas, a 14th-century Byzantine theologian.","english_definition":"A follower of Gregory Palamas, a 14th-century Byzantine theologian, and his teachings on hesychasm and the distinction between God's essence and energies.","examples":[{"sentence":"The Palamites defended the hesychastic practice of inner prayer.","translation":"パラマイトは、内的な祈りの静寂主義の実践を擁護した。"}],"collocations":["Palamite theology","Palamite controversy"],"synonyms":["Gregorian","Hesychast"],"antonyms":[]}],"etymology":{"value":"Derived from the name of Gregory Palamas (1296–1359), a Byzantine theologian and archbishop of Thessaloniki.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpæləmaɪt/","syllables":"Pal-a-mite"},"inflection":{"noun_plural":"Palamites"},"usage_notes":{"explanation":"The term 'Palamite' is primarily used in the context of Eastern Orthodox theology and history. It refers to those who adhere to the teachings of Gregory Palamas, particularly his doctrine of the divine energies, which are distinct from the divine essence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Palamites are a type of mineral.","correct":"✓ Palamites are followers of Gregory Palamas.","note":"Palamite refers to a person adhering to a specific theological doctrine, not a mineral or other object."}],"priority":"★★☆"},"related_words":{"derivatives":["Palamism (noun: The theological doctrines of Gregory Palamas.)","Hesychasm (noun: A mystical tradition of contemplative prayer in the Eastern Orthodox Church.)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Palamite' is highly specialized and primarily encountered in theological or historical discussions related to Eastern Orthodox Christianity. Understanding requires familiarity with the specific doctrines and historical context of Gregory Palamas and the hesychast controversy.","priority":"★★☆"},"example_sentences":[{"sentence":"The council affirmed the teachings of Gregory Palamas, thus supporting the Palamite position.","translation":"その会議はグレゴリオ・パラマスの教えを肯定し、パラマイトの立場を支持した。","type":"noun","meaning_category":"Religious Follower"},{"sentence":"Palamite theology emphasizes the real participation of believers in the divine energies.","translation":"パラマイト神学は、信者が神のエネルギーに実際に参加することを強調する。","type":"adjective (implied)","meaning_category":"Theological Doctrine"}]}