{"word":"Ethnarchy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"民族長制、民族支配","english_definition":"The rule over a people or nation; a government over an ethnic group.","examples":[{"sentence":"The region was under the ethnarchy of a local chieftain.","translation":"その地域は地元の首長による民族長制下にあった。"},{"sentence":"Some historians consider Herod's rule an ethnarchy rather than a kingdom.","translation":"一部の歴史家は、ヘロデの統治を王国ではなく民族長制とみなしている。"}],"collocations":["local ethnarchy","Herod's ethnarchy"],"synonyms":["chieftaincy","principality","tribal rule"],"antonyms":[]},{"part_of_speech":"noun","definition":"民族長制国家、民族支配国家","english_definition":"A territory or state ruled by an ethnarch.","examples":[{"sentence":"The ethnarchy was relatively small, encompassing only a few villages.","translation":"その民族長制国家は比較的小規模で、いくつかの村落しか含まれていなかった。"}],"collocations":["small ethnarchy","independent ethnarchy"],"synonyms":["principality","territory","state"],"antonyms":[]}],"etymology":{"value":"Derived from Greek words 'ethnos' (ἔθνος) meaning 'nation, people' and 'archē' (ἀρχή) meaning 'rule, command'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛθnɑːrki/","syllables":"eth-nar-chy"},"inflection":{"noun_plural":"ethnarchies"},"usage_notes":{"explanation":"'Ethnarchy' refers to a form of government or a territory where rule is based on ethnic or national lines. It is often used in historical contexts to describe a state or region ruled by an 'ethnarch,' a leader specifically governing an ethnic group. The term emphasizes the ethnic or national identity as the basis of governance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ethnarchy was based on democratic principles.","correct":"✓ The ethnarchy was based on ethnic principles.","note":"Ethnarchies are based on ethnic or national identity, not necessarily democratic principles."}],"priority":"★☆☆"},"related_words":{"derivatives":["ethnarch (noun: the ruler of an ethnarchy)"],"related_terms":["ethnocracy","ethnic group","nation-state"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Ethnarchy' is a relatively rare and specialized term used primarily in historical or political science contexts. It describes a form of government or a territory where rule is based on ethnic or national identity. Understanding this term requires familiarity with concepts of ethnicity, governance, and historical political structures."},"example_sentences":[{"sentence":"The ethnarchy of Judea was established after the death of Herod the Great.","translation":"ユダヤの民族長制は、ヘロデ大王の死後に確立された。","type":"noun","meaning_category":"民族長制国家"},{"sentence":"The ethnarch was responsible for maintaining peace and order within his ethnic community.","translation":"民族長は、自身の民族コミュニティ内の平和と秩序を維持する責任があった。","type":"noun","meaning_category":"民族長制"}]}