{"word":"irrationalising","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(心理学)不合理化する、正当化する","english_definition":"(psychology) attempting to explain or justify (irrational behavior or beliefs) with logical reasons, even if those reasons are not the real ones.","examples":[{"sentence":"He was irrationalising his decision to quit his job by saying he needed more time for his family, but everyone knew he was just burnt out.","translation":"彼は家族のためにもっと時間が必要だと言って、仕事を辞めるという決断を正当化しようとしていたが、誰もが彼がただ燃え尽きていたことを知っていた。"},{"sentence":"She was irrationalising her fear of flying by focusing on the statistical improbability of a plane crash.","translation":"彼女は飛行機事故の統計的なありえなさに焦点を当てることで、飛行機に乗る恐怖を正当化していた。"}],"collocations":["irrationalising behavior","irrationalising beliefs","irrationalising decisions"],"synonyms":["rationalizing","justifying","excusing"],"antonyms":["acknowledging","accepting","confronting"]}],"etymology":{"value":"'irrational' + '-ise' (or '-ize') + '-ing'. 'Irrational' comes from Latin 'irrationalis', meaning 'not endowed with reason'. The suffix '-ise' (or '-ize') turns it into a verb, and '-ing' indicates the present participle or gerund form.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈræʃənəˌlaɪzɪŋ/","syllables":"ir-ra-tion-a-lis-ing"},"inflection":{"verb_forms":{"present_simple":["irrationalise","irrationalises"],"past_simple":"irrationalised","past_participle":"irrationalised","present_participle":"irrationalising"}},"usage_notes":{"explanation":"'Irrationalising' is the present participle and gerund form of the verb 'irrationalise'. It describes the act of attempting to justify irrational behavior or beliefs with seemingly logical reasons. This is often a defense mechanism to avoid confronting the true reasons or emotions behind the behavior or belief. It is closely related to 'rationalizing', and the two terms are often used interchangeably.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was irrationalising the truth.","correct":"✓ He was irrationalising his actions.","note":"'Irrationalising' is typically used to describe the act of justifying one's own behavior or beliefs, not to distort the truth. Use 'distorting' or 'misrepresenting' for the latter."},{"incorrect":"✗ She is very irrationalising.","correct":"✓ She is very irrational.","note":"'Irrationalising' is a verb form. To describe someone as being prone to irrational thought, use the adjective 'irrational'."}],"priority":"★★☆"},"related_words":{"derivatives":["irrationalise (verb)","irrationalization (noun)","irrational (adjective)","rationalise (verb)","rationalization (noun)","rational (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Irrationalising' is a relatively uncommon word that describes the act of trying to justify illogical or unreasonable thoughts or actions by creating seemingly logical explanations. It is often used in psychology to describe a defense mechanism. Because it is a more advanced term, it is more likely to be encountered in academic or professional contexts related to psychology or behavioral science."},"example_sentences":[{"sentence":"The politician was accused of irrationalising his controversial policies by presenting misleading statistics.","translation":"その政治家は、誤解を招く統計を提示することで、物議を醸す政策を不合理化していると非難された。","type":"verb","meaning_category":"正当化する"},{"sentence":"By irrationalising her addiction, she avoided seeking help.","translation":"彼女は自分の依存症を不合理化することで、助けを求めることを避けた。","type":"verb","meaning_category":"正当化する"},{"sentence":"He spent hours irrationalising why he hadn't finished the project on time.","translation":"彼はなぜ時間通りにプロジェクトを終えられなかったのかを不合理化するのに何時間も費やした。","type":"verb","meaning_category":"正当化する"}]}