{"word":"submaniacally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"狂信的に、熱狂的に、マニアックに","english_definition":"In a submaniacal manner; exhibiting or characterized by a state of abnormally elevated mood, energy, and activity, but to a lesser degree than mania.","examples":[{"sentence":"He worked submaniacally on the project, barely sleeping or eating.","translation":"彼はほとんど寝食を忘れ、プロジェクトに狂信的に取り組んだ。"},{"sentence":"She cleaned the house submaniacally, driven by an unusual burst of energy.","translation":"彼女は異常なほどのエネルギーに突き動かされ、家を熱狂的に掃除した。"}],"collocations":["work submaniacally","clean submaniacally","focus submaniacally"],"synonyms":["obsessively","fanatically","zealously","intensely","hyperactively"],"antonyms":["calmly","moderately","lethargically"]}],"etymology":{"value":"Formed by combining 'submaniacal' (relating to submania, a less severe form of mania) with the adverbial suffix '-ly'.","priority":"★★☆"},"pronunciation":{"ipa":"/sʌbmeɪˈnaɪəkəli/","syllables":"sub-ma-ni-ac-al-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Submaniacally' describes behavior that is similar to that of someone experiencing mania (a state of abnormally elevated mood, energy, and activity), but to a lesser degree. It suggests an intense, driven, and sometimes frenetic approach to an activity or task. The term is relatively rare and often used in psychological or clinical contexts, but can also be used more broadly to describe someone who is extremely enthusiastic or energetic about something.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was submaniacally calm.","correct":"✓ He was intensely focused.","note":"'Submaniacally' implies a high level of energy and activity, so it cannot be used to describe calmness."},{"incorrect":"✗ She submaniacally ate a sandwich.","correct":"✓ She ate the sandwich quickly.","note":"'Submaniacally' is used to describe the manner of doing something with great intensity and energy, not simply the act of doing it. Eating a sandwich quickly doesn't necessarily imply a submaniacal state."}],"priority":"★★☆"},"related_words":{"derivatives":["submania (noun): A less severe form of mania.","maniacally (adverb): In a maniacal manner; wildly; frenziedly.","manic (adjective): Relating to or affected by mania."],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - The term is relatively rare.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Submaniacally' is a rare and complex word describing behavior resembling mania but less severe. It implies an abnormally elevated mood, energy, and activity level directed intensely towards a specific task or goal. Understanding requires familiarity with psychological terms like 'mania' and the ability to infer meaning from the combination of 'sub-' (less than) and 'maniacally' (in a frenzied manner). Its usage is typically limited to formal or technical contexts."},"example_sentences":[{"sentence":"Driven by inspiration, the artist painted submaniacally for days, completing a series of masterpieces.","translation":"インスピレーションに駆り立てられ、そのアーティストは何日間も狂信的に絵を描き続け、一連の傑作を完成させた。","type":"adverb","meaning_category":"狂信的に"},{"sentence":"The entrepreneur worked submaniacally to launch the startup, sacrificing sleep and personal life.","translation":"その起業家は寝る間も惜しんで私生活を犠牲にし、スタートアップを立ち上げるために狂信的に働いた。","type":"adverb","meaning_category":"熱狂的に"},{"sentence":"The programmer coded submaniacally to meet the project deadline, fueled by caffeine and determination.","translation":"そのプログラマーはカフェインと決意を燃料に、プロジェクトの締め切りに間に合わせるために狂信的にコーディングを行った。","type":"adverb","meaning_category":"マニアックに"}]}