{"word":"kelleg","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(dialectal, Scotland) A type of seaweed, specifically Laminaria digitata, used as food or fertilizer.","english_definition":"(dialectal, Scotland) A type of seaweed, specifically Laminaria digitata, used as food or fertilizer.","examples":[{"sentence":"The crofters gathered kelleg from the shore to enrich their fields.","translation":"小作人たちは畑を肥沃にするために海岸からケルレッグを集めた。"}],"collocations":["gather kelleg","use kelleg as fertilizer"],"synonyms":["tangle","seaweed","laminaria digitata"],"antonyms":[]}],"etymology":{"value":"Likely from a Scottish Gaelic word related to seaweed or kelp.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɛlɪɡ/","syllables":"kel-leg"},"inflection":{"noun_plural":"kellegs"},"usage_notes":{"explanation":"'Kelleg' is a regional term primarily used in Scotland, specifically referring to Laminaria digitata, a type of seaweed also known as oarweed or tangle. It has historical significance in coastal communities as a source of food and as a natural fertilizer for agricultural purposes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a kelleg swimming in the ocean.","correct":"✓ I saw kelp swimming in the ocean.","note":"'Kelleg' refers to a specific type of seaweed, not a general term for all seaweed. Use 'kelp' for general references."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["kelp","seaweed","Laminaria"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Kelleg' is a highly specialized and regional term, primarily used in Scotland to refer to a specific type of seaweed (Laminaria digitata). Due to its limited usage and regional specificity, it is unlikely to be encountered in general English contexts. Understanding and use of this term is typically limited to those familiar with Scottish coastal environments or specialized studies in botany or agriculture."},"example_sentences":[{"sentence":"The islanders traditionally harvested kelleg for use in their gardens.","translation":"島民は伝統的に庭で使用するためにケルレッグを収穫した。","type":"noun","meaning_category":"seaweed"}]}