{"word":"prosopotocia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(修辞学)死者または不在者を人格化して語らせる修辞技法、擬人化","english_definition":"(rhetoric) A figure of speech in which an imaginary or absent person is represented as speaking or acting. Personification.","examples":[{"sentence":"In his eulogy, the speaker used prosopotocia to give voice to the deceased.","translation":"彼の弔辞の中で、演説者はプロソポトシアを用いて故人に語らせた。"},{"sentence":"The poem employed prosopotocia, allowing the river to narrate its own history.","translation":"その詩はプロソポトシアを用いて、川に自身の歴史を語らせた。"}],"collocations":["use prosopotocia","employ prosopotocia","rhetorical prosopotocia"],"synonyms":["personification","anthropomorphism","impersonation","ventriloquism (in a literary sense)"],"antonyms":[],"notes":"Prosopotocia is often used to add emotional depth or a unique perspective to writing or speech."}],"etymology":{"value":"Derived from Greek προσῶπον (prosōpon) meaning \"face, mask, character\" and ποιεῖν (poiein) meaning \"to make, to do, to create\". Literally, \"to make a face or character.\"","priority":"★★★"},"pronunciation":{"ipa":"/ˌproʊsoʊpəˈtoʊʃiə/","syllables":"pro-so-po-to-ci-a"},"inflection":{"noun_plural":"prosopotocias"},"usage_notes":{"explanation":"Prosopotocia is a rhetorical device used to give a voice or agency to inanimate objects, abstract concepts, or absent figures. It is a form of personification, but specifically involves creating a speech or action for the entity being represented. It is commonly used in literature, speeches, and other forms of persuasive communication to evoke emotion, create vivid imagery, or present a unique perspective.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used personification, which is a type of prosopotocia.","correct":"✓ He used prosopotocia, which is a type of personification.","note":"Prosopotocia is a *type* of personification, not the other way around."},{"incorrect":"✗ The author used prosopopoeia instead of prosopotocia.","correct":"✓ The author used prosopotocia.","note":"While similar, prosopopoeia is a broader term for assuming another's identity, while prosopotocia specifically gives speech or action to the absent or inanimate."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["personification","prosopopoeia","rhetoric","figure of speech"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Prosopotocia' is a sophisticated rhetorical term referring to the act of giving voice or agency to someone or something that is absent, dead, or inanimate. It's a specific type of personification where the speaker or writer imagines what the absent entity would say or do. This term is rarely used in everyday conversation and is more common in literary analysis or rhetorical studies. Understanding it requires a strong grasp of rhetorical devices and literary theory."},"example_sentences":[{"sentence":"The historian employed prosopotocia, imagining Lincoln's address to the nation during the crisis.","translation":"歴史家はプロソポトシアを用いて、危機時のリンカーンの国民への演説を想像した。","type":"example","meaning_category":"rhetoric"},{"sentence":"Through prosopotocia, the author allowed the ancient tree to share its wisdom with the reader.","translation":"プロソポトシアを通して、著者は古代の木がその知恵を読者と共有することを可能にした。","type":"example","meaning_category":"rhetoric"},{"sentence":"The lawyer used prosopotocia in his closing argument, giving a voice to the victim.","translation":"弁護士は最終弁論でプロソポトシアを用いて、被害者に声を届けた。","type":"example","meaning_category":"rhetoric"}]}