{"word":"introspector","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"内省家、自己分析家","english_definition":"A person who examines their own thoughts and feelings.","examples":[{"sentence":"He was a deep introspector, always questioning his motives.","translation":"彼は深い内省家で、常に自分の動機を疑っていた。"},{"sentence":"As an introspector, she spent hours journaling about her experiences.","translation":"自己分析家として、彼女は自分の経験について日記をつけるのに何時間も費やした。"}],"collocations":["deep introspector","avid introspector"],"synonyms":["self-examiner","self-analyzer","contemplator"],"antonyms":["extrovert","shallow thinker"]},{"part_of_speech":"noun","definition":"(プログラミング)イントロスペクター、リフレクション機構","english_definition":"(computing) A tool or mechanism that allows a program to examine the properties of objects at runtime.","examples":[{"sentence":"The Java introspector can be used to discover the methods of a class.","translation":"Javaのイントロスペクターは、クラスのメソッドを見つけるために使用できる。"},{"sentence":"Using an introspector, the application can dynamically adapt to different data structures.","translation":"イントロスペクターを使用することで、アプリケーションはさまざまなデータ構造に動的に適応できる。"}],"collocations":["Java introspector","bean introspector"],"synonyms":["reflection API","reflection mechanism"],"antonyms":[]}],"etymology":{"value":"From 'introspection' (the examination of one's own thoughts or feelings) + '-or' (a suffix denoting a person or thing that performs an action).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪntrəˈspektər/","syllables":"in-tro-spec-tor"},"inflection":{"noun_plural":"introspectors"},"usage_notes":{"explanation":"The word \"introspector\" has two main uses. The first refers to a person who is prone to introspection, examining their own thoughts and feelings. The second is a technical term in computer science, referring to a tool or mechanism that allows a program to examine the properties of objects at runtime. The context usually makes it clear which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a good introspective.","correct":"✓ She is a good introspector.","note":"\"Introspective\" is an adjective, while \"introspector\" is a noun referring to a person. Use \"introspector\" when referring to someone who introspects."}],"priority":"★☆☆"},"related_words":{"derivatives":["introspect (verb)","introspection (noun)","introspective (adjective)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"introspector\" is relatively uncommon. In general usage, it refers to someone who frequently engages in introspection, examining their own thoughts and feelings. In a computing context, it refers to a tool or mechanism used to examine the properties of objects at runtime. Understanding the context is key to interpreting the intended meaning."},"example_sentences":[{"sentence":"The therapist encouraged her to be an introspector and explore her emotions.","translation":"セラピストは彼女に内省家になり、自分の感情を探求するように勧めた。","type":"noun","meaning_category":"内省家"},{"sentence":"The software used an introspector to determine the available methods of the object.","translation":"そのソフトウェアはイントロスペクターを使用して、オブジェクトの利用可能なメソッドを特定した。","type":"noun","meaning_category":"(プログラミング)イントロスペクター"}]}