{"word":"Oligomenorrhea","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"稀発月経","english_definition":"Infrequent or very light menstruation.","examples":[{"sentence":"Oligomenorrhea can be caused by hormonal imbalances.","translation":"稀発月経はホルモンバランスの乱れによって引き起こされることがあります。"},{"sentence":"She was diagnosed with oligomenorrhea after experiencing irregular periods.","translation":"彼女は不規則な月経を経験した後、稀発月経と診断されました。"}],"collocations":["cause of oligomenorrhea (稀発月経の原因)","diagnosis of oligomenorrhea (稀発月経の診断)","treatment for oligomenorrhea (稀発月経の治療)"],"synonyms":["infrequent menstruation","irregular periods"],"antonyms":["amenorrhea (無月経)","menorrhagia (過多月経)"]}],"etymology":{"value":"ギリシャ語の 'oligo-' (少ない) + 'men-' (月、月経) + '-rrhea' (流れ) に由来します。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒlɪɡoʊˌmɛnəˈriːə/","syllables":"o-li-go-me-no-rre-a"},"inflection":{"noun_plural":"oligomenorrheas"},"usage_notes":{"explanation":"Oligomenorrhea is a medical term referring to infrequent menstrual periods, typically defined as having periods that occur more than 35 days apart or having fewer than nine periods per year. It is a symptom, not a disease, and can be caused by various factors including hormonal imbalances, stress, excessive exercise, eating disorders, or certain medical conditions. Diagnosis usually involves a physical exam, blood tests, and possibly imaging studies. Treatment depends on the underlying cause.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Oligomenorrhea is a disease.","correct":"✓ Oligomenorrhea is a symptom.","note":"Oligomenorrhea is a symptom of an underlying issue, not a disease itself."},{"incorrect":"✗ Oligomenorrhea means heavy periods.","correct":"✓ Oligomenorrhea means infrequent or light periods.","note":"Oligomenorrhea is characterized by infrequent or light menstrual flow, not heavy flow."}],"priority":"★★☆"},"related_words":{"derivatives":["oligomenorrheic (形容詞: 稀発月経の)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"低頻度 (Low frequency) - 医学用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Oligomenorrhea is a medical term that describes infrequent menstrual periods. This means that a woman experiencing oligomenorrhea has periods that occur less often than normal, usually more than 35 days apart. It's important to understand that oligomenorrhea is usually a symptom of an underlying issue, such as hormonal imbalances or other medical conditions, rather than a disease itself. If you experience infrequent periods, it's best to consult a healthcare professional for evaluation and guidance."},"example_sentences":[{"sentence":"She consulted her doctor about her oligomenorrhea.","translation":"彼女は稀発月経について医師に相談しました。","type":"general","meaning_category":"general"},{"sentence":"Hormonal imbalances are a common cause of oligomenorrhea.","translation":"ホルモンバランスの乱れは稀発月経の一般的な原因です。","type":"cause","meaning_category":"cause"},{"sentence":"Treatment for oligomenorrhea depends on the underlying cause.","translation":"稀発月経の治療は根本的な原因によって異なります。","type":"treatment","meaning_category":"treatment"}]}