{"word":"Photophane","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of translucent material or image that appears to change or become more visible when light is shone through it.","english_definition":"A picture or design made on translucent porcelain, glass, or similar material that is nearly invisible until light is shone through it from behind.","examples":[{"sentence":"The antique photophane lamp revealed a hidden scene when lit.","translation":"そのアンティークのフォトファンランプは、明かりを灯すと隠された場面を明らかにした。"},{"sentence":"Photophanes were popular decorative items in the 19th century.","translation":"フォトファンは19世紀に人気のある装飾品だった。"}],"collocations":["antique photophane","photophane lamp","translucent photophane"],"synonyms":["lithophane"],"antonyms":[]}],"etymology":{"value":"The word 'photophane' is derived from the Greek words 'photo' (light) and 'phane' (to appear or show).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfoʊtoʊfeɪn/","syllables":"pho-to-phane"},"inflection":{"noun_plural":"photophanes"},"usage_notes":{"explanation":"Photophanes are typically made from porcelain or other translucent materials. The image is created by varying the thickness of the material, so that when light shines through, the thicker areas appear darker and the thinner areas appear lighter, creating a grayscale image.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a lithophane, it must be a photophane.","correct":"✓ I saw a lithophane, which is a type of photophane.","note":"'Lithophane' is a more common term for this type of image. 'Photophane' is a broader term that can encompass other light-sensitive images."}],"priority":"★☆☆"},"related_words":{"derivatives":["photophany (noun: the art or process of creating photophanes)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Photophane' refers to a specific type of translucent artwork where an image becomes visible when light is shone through it. It's a relatively rare term, often used in the context of antique collectibles or art history. Understanding the term requires familiarity with art and design concepts."},"example_sentences":[{"sentence":"The museum displayed a rare collection of 19th-century photophanes.","translation":"その博物館は、19世紀の貴重なフォトファンのコレクションを展示した。","type":"noun","meaning_category":"object"},{"sentence":"Creating a photophane requires precise control over the thickness of the porcelain.","translation":"フォトファンを作成するには、磁器の厚さを正確に制御する必要がある。","type":"noun","meaning_category":"process"}]}