{"word":"non-dischargeable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(法律)免責されない、破産宣告によっても債務が免除されない","english_definition":"(of a debt) not able to be discharged in bankruptcy; not eligible for forgiveness through bankruptcy proceedings.","examples":[{"sentence":"Student loans are often non-dischargeable in bankruptcy.","translation":"学生ローンは、多くの場合、破産宣告によっても免責されない。"},{"sentence":"Certain types of tax debts are non-dischargeable.","translation":"特定の種類の税金債務は免責されない。"},{"sentence":"Debts arising from fraud may be considered non-dischargeable.","translation":"詐欺に起因する債務は、免責されないとみなされる場合がある。"}],"collocations":["non-dischargeable debt","non-dischargeable obligation","declare a debt non-dischargeable"],"synonyms":["unforgivable (in a legal context)","non-bankruptable"],"antonyms":["dischargeable","forgivable (in a legal context)"]},{"part_of_speech":"adjective","definition":"(一般的に)解放されない、免除されない","english_definition":"Not capable of being discharged or released.","examples":[{"sentence":"His responsibility for the accident was non-dischargeable.","translation":"その事故に対する彼の責任は免れるものではなかった。"}],"collocations":["non-dischargeable responsibility"],"synonyms":["inescapable","unavoidable"],"antonyms":["dischargeable","avoidable"]}],"etymology":{"value":"The word is formed by adding the prefix \"non-\" (meaning \"not\") to the word \"dischargeable.\" \"Dischargeable\" comes from \"discharge,\" which in a legal context means to release someone from a debt or obligation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒn dɪsˈtʃɑːrdʒəbəl/","syllables":"non-dis-charge-a-ble"},"inflection":{"notes":"Adjectives do not typically inflect, but can be modified by adverbs (e.g., very non-dischargeable)."},"usage_notes":{"explanation":"The term \"non-dischargeable\" is primarily used in legal and financial contexts, specifically relating to bankruptcy law. It refers to debts or obligations that a debtor is still responsible for paying even after going through bankruptcy proceedings. Common examples include student loans, certain tax debts, and debts resulting from fraudulent activities. Outside of legal or financial discussions, the term is rarely used.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The debt was non-discharge.","correct":"✓ The debt was non-dischargeable.","note":"\"Non-discharge\" is not an adjective. The correct form is \"non-dischargeable.\""},{"incorrect":"✗ Only dischargeable debts are bad.","correct":"✓ Non-dischargeable debts are often considered more burdensome.","note":"The adjective describes the type of debt, not its inherent quality."}],"priority":"★★☆"},"related_words":{"derivatives":["non-dischargeability (noun)"],"phrases":["discharge in bankruptcy","bankruptcy code","creditor","debtor"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized legal vocabulary)","frequency_google_ngram":"Low frequency - primarily used in legal and financial documents.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"non-dischargeable\" is a legal term, most often encountered in discussions about bankruptcy. It describes a debt that cannot be forgiven or eliminated through bankruptcy proceedings. This means that even after a person declares bankruptcy, they are still legally obligated to repay the non-dischargeable debt. Examples of non-dischargeable debts often include student loans, certain tax obligations, and debts resulting from fraud. Because it is a specialized term, it is not commonly used in everyday conversation. Understanding its meaning requires some familiarity with legal and financial concepts.","priority":"★★★"},"example_sentences":[{"sentence":"The court ruled that the debt was non-dischargeable due to fraudulent activity.","translation":"裁判所は、詐欺行為があったため、その債務は免責されないと判断した。","type":"adjective","meaning_category":"Legal/Financial"},{"sentence":"Many people struggle with non-dischargeable student loan debt for years.","translation":"多くの人々が、免責されない学生ローン債務に長年苦しんでいる。","type":"adjective","meaning_category":"Legal/Financial"},{"sentence":"Understanding which debts are non-dischargeable is crucial when considering bankruptcy.","translation":"どの債務が免責されないかを理解することは、破産を検討する上で非常に重要である。","type":"adjective","meaning_category":"Legal/Financial"}]}