{"word":"pseudo-urate","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"偽尿酸塩","english_definition":"A crystalline deposit in synovial fluid that resembles urate crystals but is composed of calcium pyrophosphate dihydrate.","examples":[{"sentence":"The synovial fluid analysis revealed pseudo-urate crystals, indicating calcium pyrophosphate deposition disease (CPPD).","translation":"滑液分析の結果、偽尿酸塩結晶が検出され、ピロリン酸カルシウム結晶沈着症（CPPD）が示唆された。"}],"collocations":["pseudo-urate crystals","synovial fluid pseudo-urate","pseudo-urate deposition"],"synonyms":["calcium pyrophosphate dihydrate crystals"],"antonyms":[]}],"etymology":{"value":"The term \"pseudo-urate\" is derived from \"pseudo-\" (Greek for false or resembling) + \"urate\" (salt of uric acid). It describes crystals that look like urate but are chemically different.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsjuːdoʊˈjʊəreɪt/","syllables":"pseu-do-u-rate"},"inflection":{"noun_plural":"pseudo-urates"},"usage_notes":{"explanation":"Pseudo-urate crystals are typically identified through polarized light microscopy of synovial fluid. They are associated with calcium pyrophosphate deposition disease (CPPD), also known as pseudogout. Unlike urate crystals, which are associated with gout, pseudo-urate crystals are composed of calcium pyrophosphate dihydrate.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient has pseudo-urate, indicating gout.","correct":"✓ The patient has pseudo-urate crystals, indicating CPPD (pseudogout).","note":"Pseudo-urate crystals are associated with CPPD (pseudogout), not gout, which is associated with urate crystals."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudogout","CPPD (calcium pyrophosphate deposition disease)","urate","uric acid"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"pseudo-urate\" is a specialized term used in medicine, particularly in rheumatology, to describe calcium pyrophosphate dihydrate crystals found in synovial fluid. It is relevant to the diagnosis of calcium pyrophosphate deposition disease (CPPD), also known as pseudogout. Understanding this term requires a background in medical terminology and crystal identification.","priority":"★★☆"},"example_sentences":[{"sentence":"Polarized light microscopy is used to differentiate between urate and pseudo-urate crystals in synovial fluid.","translation":"偏光顕微鏡検査は、滑液中の尿酸塩結晶と偽尿酸塩結晶を区別するために使用される。","type":"noun","meaning_category":"medical diagnosis"},{"sentence":"The presence of pseudo-urate crystals confirmed the diagnosis of calcium pyrophosphate deposition disease.","translation":"偽尿酸塩結晶の存在により、ピロリン酸カルシウム結晶沈着症の診断が確定した。","type":"noun","meaning_category":"medical diagnosis"}]}