{"word":"merchant-tailor","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(歴史的な職業) 顧客から注文を受けて服を作る仕立屋。特に、生地を自分で仕入れて販売し、顧客に合わせた服を仕立てる職人。","english_definition":"(historical) A tailor who makes clothes to order for individual customers, especially one who also sells the cloth from which the clothes are made.","examples":[{"sentence":"In the 18th century, the merchant-tailor was a prominent figure in London's fashion scene.","translation":"18世紀には、マーチャント・テイラーはロンドンのファッションシーンで著名な人物でした。"},{"sentence":"He went to the merchant-tailor to have a suit custom-made.","translation":"彼はマーチャント・テイラーのところへ、スーツをオーダーメイドしてもらいに行った。"}],"collocations":["custom-made suit (オーダーメイドのスーツ)","cloth merchant (生地商人)","bespoke tailoring (ビスポーク仕立て)"],"synonyms":["tailor","bespoke tailor","draper"],"antonyms":["ready-to-wear retailer"],"notes":["The term emphasizes the tailor's role as both a seller of fabric and a maker of clothing.","This profession was more common in past centuries, before mass-produced clothing became widespread."],"related_occupations":["weaver","seamstress","haberdasher"]}],"etymology":{"value":"The term combines 'merchant,' referring to the selling of goods (in this case, cloth), and 'tailor,' referring to the craft of making clothes.","priority":"★★★"},"pronunciation":{"ipa":"/ˈmɜːrtʃənt ˈteɪlər/","syllables":"mer-chant-tai-lor"},"inflection":{"noun_plural":"merchant-tailors"},"usage_notes":{"explanation":"The term 'merchant-tailor' is somewhat archaic, referring to a historical occupation. Today, tailors may or may not sell their own fabric, and the term is less commonly used. The emphasis is on custom-made clothing rather than ready-to-wear items.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a merchant tailor shop.","correct":"✓ He is a merchant-tailor. / ✓ He owns a merchant-tailor shop.","note":"'Merchant-tailor' refers to the person, not the shop. To refer to the shop, use 'merchant-tailor shop' or 'tailor shop'."}],"priority":"★★☆"},"related_words":{"derivatives":["merchant (noun)","tailor (noun/verb)","tailoring (noun)"],"related_professions":["draper","haberdasher","clothier"]},"level_frequency":{"frequency_google_ngram":"Low frequency - mainly used in historical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'merchant-tailor' is specialized and primarily used in historical contexts to describe a tailor who also sells fabric. Understanding the term requires knowledge of historical trade practices and the evolution of the tailoring profession. It is not commonly used in modern English.","notes":"This term is more likely to be encountered in historical novels, academic texts, or discussions about the history of fashion and trade."},"example_sentences":[{"sentence":"The wealthy gentleman consulted the merchant-tailor for a new coat.","translation":"その裕福な紳士は、新しいコートについてマーチャント・テイラーに相談した。","type":"example","meaning_category":"historical context"},{"sentence":"Many merchant-tailors in the 17th century were also successful businessmen.","translation":"17世紀の多くのマーチャント・テイラーは、成功した実業家でもあった。","type":"example","meaning_category":"historical context"},{"sentence":"The merchant-tailor carefully measured the customer for a bespoke suit.","translation":"マーチャント・テイラーは、オーダーメイドのスーツのために顧客を注意深く採寸した。","type":"example","meaning_category":"historical context"}]}