{"word":"forsung","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A hypothetical or fictional element or substance, often used in science fiction or fantasy contexts. Its properties and effects are usually vaguely defined and serve a plot-related purpose.","english_definition":"A hypothetical or fictional element or substance, often used in science fiction or fantasy contexts. Its properties and effects are usually vaguely defined and serve a plot-related purpose.","examples":[{"sentence":"The spaceship's engine ran on forsung, a rare and powerful element found only on the planet Xylos.","translation":"その宇宙船のエンジンはforsungで動いていた。forsungは惑星Xylosでのみ見つかる希少で強力な元素である。"},{"sentence":"The wizard used forsung crystals to amplify his magical abilities.","translation":"魔法使いは魔法能力を増幅するためにforsungクリスタルを使用した。"}],"collocations":["forsung crystal","forsung energy","forsung reactor","mine forsung","extract forsung"],"synonyms":["unobtainium","fictional element","hypothetical substance"],"antonyms":[]}],"etymology":{"value":"Likely a made-up word, possibly intended to sound futuristic or scientific. It does not have a known etymological origin.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈfɔːrsʌŋ/","syllables":"for-sung"},"inflection":{"noun_plural":"forsungs"},"usage_notes":{"explanation":"\"Forsung\" is typically used as a placeholder name for a fictional element or substance in speculative fiction. Its properties are usually determined by the needs of the story, rather than any established scientific principles. The word itself has no real-world meaning or usage outside of these contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Forsung is a real element on the periodic table.","correct":"✓ Forsung is a fictional element often used in science fiction.","note":"Forsung is not a real element."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["science fiction","fantasy","worldbuilding","magic system"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - Primarily found in specific fictional works or discussions about speculative fiction.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"forsung\" is not a common word and is likely to be encountered only in science fiction or fantasy contexts. Understanding it requires familiarity with the conventions of speculative fiction, where authors often invent new elements or substances to drive the plot. The word itself is straightforward, but its meaning is entirely dependent on the fictional context in which it appears."},"example_sentences":[{"sentence":"The scientists discovered a new form of forsung with unusual properties.","translation":"科学者たちは、異常な特性を持つforsungの新しい形態を発見した。","type":"noun","meaning_category":"fictional element"},{"sentence":"The plot revolved around the quest to control the world's supply of forsung.","translation":"物語は、世界のforsungの供給を支配するための探求を中心に展開した。","type":"noun","meaning_category":"fictional element"}]}