{"word":"surfperches","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A family (Embiotocidae) of ray-finned fish, found in the Pacific Ocean, typically in shallow coastal waters.","english_definition":"Plural form of surfperch. A family (Embiotocidae) of ray-finned fish, found in the Pacific Ocean, typically in shallow coastal waters.","examples":[{"sentence":"Surfperches are a popular target for anglers in California.","translation":"サーフパーチはカリフォルニアで釣り人に人気のターゲットです。"},{"sentence":"Several species of surfperches are viviparous, giving birth to live young.","translation":"サーフパーチのいくつかの種は胎生で、生きた稚魚を産みます。"}],"collocations":["catch surfperches","surfperch fishing","species of surfperches"],"synonyms":["Embiotocidae (family name)"],"antonyms":[]}],"etymology":{"value":"From 'surf' (referring to their habitat in surf zones) + 'perch' (resembling perch-like fish).","priority":"N/A"},"pronunciation":{"ipa":"/ˈsɜːrfˌpɜːrtʃɪz/","syllables":"surf-perch-es"},"inflection":{"noun_plural":"surfperches"},"usage_notes":{"explanation":"'Surfperches' refers to multiple fish of the family Embiotocidae. They are commonly found in the surf zones of the Pacific Ocean and are often targeted by recreational fishermen.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["surfperch"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"N/A","text":"This word refers to a specific family of fish and is not commonly used in everyday conversation. Its usage is primarily limited to contexts related to marine biology, fishing, or coastal ecosystems."},"example_sentences":[{"sentence":"The tide was high, and the surfperches were biting well.","translation":"満潮で、サーフパーチの食いつきが良かった。","type":"noun","meaning_category":"fish"},{"sentence":"Scientists are studying the population dynamics of surfperches in the region.","translation":"科学者たちは、この地域のサーフパーチの個体数動態を研究しています。","type":"noun","meaning_category":"fish"}]}