{"word":"Cystinuria","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"シスチン尿症","english_definition":"A hereditary metabolic disorder characterized by the impaired transport of cystine and certain other amino acids, resulting in the formation of cystine stones in the kidneys, ureters, and bladder.","examples":[{"sentence":"Cystinuria is caused by a mutation in genes responsible for amino acid transport in the kidneys.","translation":"シスチン尿症は、腎臓におけるアミノ酸輸送に関わる遺伝子の変異によって引き起こされる。"},{"sentence":"Patients with cystinuria often require lifelong management to prevent kidney stone formation.","translation":"シスチン尿症の患者は、腎臓結石の形成を防ぐために生涯にわたる管理が必要となることが多い。"}],"collocations":["cystine stones (シスチン結石)","amino acid transport (アミノ酸輸送)","kidney stones (腎臓結石)","genetic disorder (遺伝性疾患)"],"synonyms":["cystine lithiasis"],"antonyms":[]}],"etymology":{"value":"The term \"cystinuria\" is derived from \"cystine\" (an amino acid) and \"-uria\" (denoting the presence of a substance in the urine).","priority":"★★☆"},"pronunciation":{"ipa":"ˌsɪstɪˈnjʊəriə","syllables":"Cys-ti-nu-ri-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Cystinuria is a genetic disorder affecting the transport of cystine and other amino acids in the kidneys, leading to the formation of cystine stones. Diagnosis typically involves urine analysis and genetic testing. Management includes increased fluid intake, dietary modifications, and medications to reduce cystine levels in the urine.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Cystinuria is a bacterial infection of the urinary tract.","correct":"✓ Cystinuria is a genetic disorder affecting amino acid transport in the kidneys.","note":"Cystinuria is a genetic disorder, not a bacterial infection."},{"incorrect":"✗ Cystinuria can be cured with antibiotics.","correct":"✓ Cystinuria is managed with increased fluid intake, dietary changes, and medications to reduce cystine levels.","note":"Cystinuria cannot be cured with antibiotics; management focuses on preventing stone formation."}],"priority":"★★☆"},"related_words":{"derivatives":["cystine (シスチン)","amino acid (アミノ酸)","nephrolithiasis (腎結石症)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Cystinuria is a rare genetic disorder characterized by impaired cystine transport, leading to kidney stone formation. Management involves lifelong strategies to reduce cystine levels and prevent complications. Due to its complexity and specialized medical context, understanding requires advanced knowledge of genetics and nephrology."},"example_sentences":[{"sentence":"Early diagnosis of cystinuria is crucial to prevent recurrent kidney stone formation.","translation":"再発性の腎臓結石の形成を防ぐためには、シスチン尿症の早期診断が重要である。","type":"general","meaning_category":"medical"},{"sentence":"Genetic counseling is recommended for families with a history of cystinuria.","translation":"シスチン尿症の家族歴がある家族には、遺伝カウンセリングが推奨される。","type":"general","meaning_category":"medical"}]}