{"word":"lip-labour","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"空約束、口先だけの努力、言葉だけの仕事","english_definition":"Talk or promises that are not supported by actions or results; empty words or promises.","examples":[{"sentence":"The politician's speech was full of lip-labour, but lacked concrete plans.","translation":"その政治家の演説は口先だけの約束ばかりで、具体的な計画がなかった。"},{"sentence":"We've heard enough lip-labour; now we need to see some real action.","translation":"口先だけの努力はもう聞き飽きた。今必要なのは実際の行動だ。"},{"sentence":"All that talk about change was just lip-labour – nothing ever improved.","translation":"変化についての話はすべて口先だけだった。何も改善されなかった。"}],"collocations":["empty lip-labour","mere lip-labour","political lip-labour"],"synonyms":["empty promises","idle talk","hot air","insincere words","false assurances","empty rhetoric"],"antonyms":["action","deeds","results","concrete plans","tangible progress"]}],"etymology":{"value":"A figurative expression combining 'lip' (referring to speech) and 'labour' (referring to work or effort). It suggests that the work is only being done with the lips, i.e., through speech, without any real effort or action behind it.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɪpˌleɪbər/","syllables":"lip-la-bour"},"inflection":{"notes":"Uncountable noun."},"usage_notes":{"explanation":"'Lip-labour' is typically used in a negative context to criticize someone for making promises or talking about doing something without actually taking any action. It implies insincerity or a lack of commitment. The term is relatively uncommon but can be effective in conveying the idea of empty rhetoric.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He did a lot of lip-labours to get elected.","correct":"✓ He engaged in a lot of lip-labour to get elected.","note":"'Lip-labour' is an uncountable noun, so it doesn't take a plural form. Use 'engaged in lip-labour' or 'used lip-labour' instead."},{"incorrect":"✗ She is full of lip-labour and actions.","correct":"✓ She is full of lip-labour but lacks actions.","note":"'Lip-labour' implies a lack of action, so it's contradictory to say someone is full of both. Use 'but lacks actions' or a similar construction to highlight the contrast."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["rhetoric","empty talk","bluster","grandstanding","posturing"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lip-labour' is a relatively uncommon term that refers to talk or promises that are not backed up by real action. It's often used to criticize politicians or others who make grand statements without following through. Understanding this term requires a good grasp of figurative language and an awareness of its negative connotation.","priority":"★★☆"},"example_sentences":[{"sentence":"The company's commitment to sustainability turned out to be just lip-labour.","translation":"その会社の持続可能性への取り組みは、結局のところ口先だけだった。","type":"noun","meaning_category":"empty promises"},{"sentence":"Don't be fooled by his lip-labour; look at his actual achievements.","translation":"彼の口先だけの言葉に騙されないで、実際の業績を見てください。","type":"noun","meaning_category":"empty promises"},{"sentence":"The community is tired of the government's lip-labour and demands real change.","translation":"地域社会は政府の口先だけの言葉にうんざりしており、真の変化を求めている。","type":"noun","meaning_category":"empty promises"}]}