{"word":"Polycotyledony","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"多子葉性：植物の種子に複数の子葉がある状態","english_definition":"The condition of having more than two cotyledons (seed leaves) in a seed.","examples":[{"sentence":"Polycotyledony is relatively rare in most plant species.","translation":"多子葉性はほとんどの植物種では比較的まれである。"},{"sentence":"Some plants exhibit polycotyledony due to genetic mutations or environmental factors.","translation":"いくつかの植物は、遺伝的突然変異または環境要因により多子葉性を示す。"}],"collocations":["exhibit polycotyledony","rare polycotyledony","seed polycotyledony"],"synonyms":["multiple cotyledons","polyembryony (sometimes related)"],"antonyms":["monocotyledony","dicotyledony"]},{"part_of_speech":"noun","definition":"多子葉植物：複数の子葉を持つ植物","english_definition":"A plant possessing more than two cotyledons.","examples":[{"sentence":"While dicotyledonous plants have two cotyledons, some instances of polycotyledony can occur.","translation":"双子葉植物は2つの子葉を持つが、多子葉性の例が発生することがある。"},{"sentence":"The seedling displayed polycotyledony, with three cotyledons emerging from the seed.","translation":"その苗は多子葉性を示し、種子から3つの子葉が現れた。"}],"collocations":["polycotyledonous seedling","rare polycotyledonous plant"],"synonyms":["plant with multiple cotyledons"],"antonyms":["dicotyledonous plant","monocotyledonous plant"]}],"etymology":{"value":"Derived from the Greek words 'poly' (meaning many), 'cotyledon' (seed leaf), and '-y' (state or condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɒlɪˌkɒtɪˈliːdəni/","syllables":"pol-y-cot-y-le-do-ny"},"inflection":{"noun_plural":"polycotyledonies"},"usage_notes":{"explanation":"Polycotyledony is a botanical term primarily used in plant biology and botany. It describes a deviation from the typical number of cotyledons (seed leaves) found in seeds. While most angiosperms are either monocots (one cotyledon) or dicots (two cotyledons), polycotyledony refers to the presence of three or more cotyledons. This condition is relatively rare and can be caused by genetic abnormalities, environmental stress, or other developmental factors.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant is polycotyledon.","correct":"✓ The plant exhibits polycotyledony.","note":"'Polycotyledon' itself is not commonly used as an adjective. Instead, use 'polycotyledonous' or describe the plant as 'exhibiting polycotyledony'"},{"incorrect":"✗ Polycotyledony only occurs in monocots.","correct":"✓ Polycotyledony is rare but can occur in dicots.","note":"Polycotyledony is a deviation from the norm and can occur in plants that are typically dicots."}],"priority":"★☆☆"},"related_words":{"derivatives":["polycotyledonous (adjective)"],"phrasal_verbs":[],"related_terms":["cotyledon","monocotyledon","dicotyledon","embryo","seedling","angiosperm"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency (Specialized botanical term)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Polycotyledony' is a specialized botanical term referring to the condition where a plant seed has more than the usual number of cotyledons (seed leaves). Typically, plants are either monocotyledonous (one cotyledon) or dicotyledonous (two cotyledons). Polycotyledony describes the rare occurrence of three or more cotyledons. This term is primarily used in botany, plant biology, and related scientific fields. Understanding requires a background in plant anatomy and development."},"example_sentences":[{"sentence":"The scientist observed polycotyledony in a small percentage of the seedlings.","translation":"科学者は、ごくわずかの割合の苗で多子葉性を観察した。","type":"noun","meaning_category":"多子葉性"},{"sentence":"This polycotyledonous seedling has three cotyledons instead of the usual two.","translation":"この多子葉性の苗は、通常2つではなく3つの子葉を持っている。","type":"adjective","meaning_category":"多子葉性の"},{"sentence":"Research suggests that polycotyledony can sometimes be induced by specific environmental conditions.","translation":"研究は、多子葉性が特定の環境条件によって誘発されることがあることを示唆している。","type":"noun","meaning_category":"多子葉性"},{"sentence":"The occurrence of polycotyledony is often considered an anomaly in plant development.","translation":"多子葉性の発生は、植物の発生における異常と見なされることが多い。","type":"noun","meaning_category":"多子葉性"}]}