{"word":"cyclist-friendly","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"自転車利用者に優しい、自転車に配慮した","english_definition":"Designed to be convenient or safe for cyclists; accommodating or welcoming to cyclists.","examples":[{"sentence":"The city has become more cyclist-friendly in recent years, with new bike lanes and improved infrastructure.","translation":"近年、その都市は新しい自転車専用レーンや改善されたインフラにより、自転車利用者にとってより優しい都市になった。"},{"sentence":"This hotel is cyclist-friendly, offering secure bike storage and repair tools.","translation":"このホテルは自転車利用者に優しく、安全な自転車保管場所と修理用具を提供している。"},{"sentence":"We need to make our roads more cyclist-friendly to encourage more people to cycle.","translation":"より多くの人々に自転車に乗ってもらうために、道路をもっと自転車に配慮したものにする必要がある。"}],"collocations":["cyclist-friendly city","cyclist-friendly route","cyclist-friendly infrastructure","cyclist-friendly hotel","cyclist-friendly policies"],"synonyms":["bike-friendly","bicycle-friendly"],"antonyms":["cyclist-unfriendly","bike-unfriendly","bicycle-unfriendly"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'cyclist' (a person who rides a bicycle) and 'friendly' (kind, helpful, or welcoming). It describes something that is designed or adapted to be suitable or welcoming for cyclists.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsaɪklɪst ˈfrendli/","syllables":"cy-clist-friend-ly"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Cyclist-friendly' is used to describe places, routes, policies, or facilities that are designed or adapted to make cycling easier, safer, and more enjoyable. It often implies the presence of features such as bike lanes, bike racks, repair stations, or policies that support cycling.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The city is very friendly to cyclists.","correct":"✓ The city is very cyclist-friendly.","note":"While 'friendly to cyclists' is understandable, 'cyclist-friendly' is a more concise and commonly used term."}],"priority":"★★☆"},"related_words":{"derivatives":["cyclist","friendly"],"related_terms":["bike lane","bike path","cycle route","cycling infrastructure","bike-sharing program"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but increasing in recent years.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Cyclist-friendly' is a compound adjective that is relatively straightforward to understand. It is used to describe something that is designed to be convenient or safe for cyclists. The term is commonly used in discussions about urban planning, transportation, and tourism.","priority":"★★★"},"example_sentences":[{"sentence":"The new bridge includes a cyclist-friendly path separated from vehicle traffic.","translation":"新しい橋には、自動車の交通から分離された自転車利用者に優しい道が含まれている。","type":"general","meaning_category":"Designated path"},{"sentence":"Many cafes in the area are cyclist-friendly, offering discounts to those arriving by bike.","translation":"この地域の多くのカフェは自転車利用者に優しく、自転車で到着する人に割引を提供している。","type":"general","meaning_category":"Cafe discounts"},{"sentence":"The government is implementing cyclist-friendly policies to reduce traffic congestion.","translation":"政府は交通渋滞を緩和するために、自転車利用者に優しい政策を実施している。","type":"general","meaning_category":"Government policies"}]}