{"word":"self-dosage","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"自己投与、自己投薬","english_definition":"The act of administering medication to oneself.","examples":[{"sentence":"The doctor warned against self-dosage without proper consultation.","translation":"医師は適切な相談なしに自己投薬することに警告した。"},{"sentence":"Self-dosage can be dangerous if not done correctly.","translation":"自己投与は正しく行われないと危険な場合がある。"}],"collocations":["avoid self-dosage (自己投与を避ける)","risks of self-dosage (自己投与のリスク)"],"synonyms":["self-medication","self-administration"],"antonyms":["professional administration","medical supervision"]}],"etymology":{"value":"'Self-' (自分自身) + 'dosage' (投与量) の組み合わせ。","priority":"★★★"},"pronunciation":{"ipa":"/ˌselfˈdoʊsɪdʒ/","syllables":"self-do-sage"},"inflection":{"noun_plural":"self-dosages"},"usage_notes":{"explanation":"'Self-dosage' refers to the act of administering medication to oneself, often without the supervision of a healthcare professional. It is generally discouraged due to the potential for misuse, incorrect dosage, and adverse reactions. The term is commonly used in medical and pharmaceutical contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I self-dosage myself with antibiotics.","correct":"✓ I engaged in self-dosage with antibiotics.","note":"'Self-dosage' is a noun, so it's used as the subject or object of a sentence. Use a verb like 'engage in' or 'practice' to describe the act of self-administering medication."},{"incorrect":"✗ Self-dosage is good for minor illnesses.","correct":"✓ Self-medication for minor illnesses may be acceptable in some cases, but always consult a healthcare professional.","note":"While self-medication (a synonym of self-dosage) might be acceptable for very minor issues, it's important to emphasize the need for professional advice to avoid potential risks."}],"priority":"★★☆"},"related_words":{"derivatives":["self-medicate (verb: 自己投薬する)","dosage (noun: 投与量)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Self-dosage' is a more formal term for 'self-medication,' referring to the act of giving oneself medicine. It's often used in medical discussions and carries a slightly negative connotation due to the risks involved in taking medicine without a doctor's guidance. It's important to understand that while some over-the-counter medications are safe for self-administration, consulting a healthcare professional is always recommended, especially for prescription drugs or serious conditions."},"example_sentences":[{"sentence":"The dangers of unregulated self-dosage are well-documented in medical literature.","translation":"規制されていない自己投与の危険性は医学文献で十分に文書化されている。","type":"noun","meaning_category":"自己投与"},{"sentence":"Patients should be educated about the potential risks of self-dosage.","translation":"患者は自己投与の潜在的なリスクについて教育されるべきである。","type":"noun","meaning_category":"自己投与"}]}