{"word":"lorarii","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古代ローマ) 鞭打ち人、鞭打ち奴隷","english_definition":"(Ancient Rome) Whippers, slaves who whipped other slaves as punishment or to keep them working.","examples":[{"sentence":"The lorarii were responsible for maintaining order among the other slaves.","translation":"ロラーリーは他の奴隷の秩序を維持する責任があった。"},{"sentence":"A lorarius would use a whip to encourage slaves to work harder.","translation":"ロラーリウスは、奴隷にもっと働くように促すために鞭を使った。"}],"collocations":["lorarius et carnifex (鞭打ち人と処刑人)"],"synonyms":["flagellator","carnifex (sometimes)"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'lorum,' meaning a leather strap or thong, referring to the whip they used.","priority":"★★★"},"pronunciation":{"ipa":"/loˈraːri.iː/","syllables":"lo-ra-ri-i"},"inflection":{"noun_plural":"lorarii (already plural)","noun_singular":"lorarius"},"usage_notes":{"explanation":"'Lorarii' refers specifically to slaves in ancient Rome whose job was to whip other slaves. They were essentially slave overseers who used corporal punishment to enforce discipline and productivity. The singular form is 'lorarius.'","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a lorarius who fought in the arena.","correct":"✓ He was a lorarius who whipped other slaves.","note":"Lorarii were not gladiators; their role was to punish other slaves."}],"priority":"★★☆"},"related_words":{"derivatives":["lorum (Latin - leather strap, thong)"],"phrases":["flagrum (whip)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - specific to historical contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Lorarii' is a highly specialized term referring to a specific role in ancient Roman society. Understanding requires knowledge of Roman slavery practices. The term is rarely encountered outside of historical or academic contexts.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The cries of the slaves echoed as the lorarii wielded their whips.","translation":"ロラーリーが鞭を振るうと、奴隷たちの叫び声が響き渡った。","type":"noun","meaning_category":"鞭打ち人"},{"sentence":"The lorarius was feared by all the other slaves on the plantation.","translation":"その農園の他のすべての奴隷は、ロラーリウスを恐れていた。","type":"noun","meaning_category":"鞭打ち人"}]}