{"word":"Thiopental","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"チオペンタール (バルビツール酸系の麻酔薬)","english_definition":"A barbiturate derivative used as a general anesthetic, sedative, and anticonvulsant.","examples":[{"sentence":"Thiopental is commonly used for induction of anesthesia.","translation":"チオペンタールは麻酔導入によく使用される。"},{"sentence":"The patient was given thiopental to induce a coma.","translation":"患者は昏睡状態を誘発するためにチオペンタールを投与された。"}],"collocations":["thiopental sodium","thiopental anesthesia","induce anesthesia with thiopental"],"synonyms":["Pentothal","thiopentone"],"antonyms":[]}],"etymology":{"value":"Derived from the chemical structure, containing sulfur (thio-) and pentyl group, combined with 'barbital' (a barbiturate).","priority":"★★☆"},"pronunciation":{"ipa":"ˌθaɪ.oʊˈpɛntəl","syllables":"Thi-o-pen-tal"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Thiopental is a short-acting barbiturate that is primarily used for inducing anesthesia. It is also used in medically induced comas and, historically, as a truth serum. Its use has declined somewhat due to the availability of newer, safer anesthetic agents.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Thiopental is a type of painkiller.","correct":"✓ Thiopental is a type of anesthetic.","note":"Thiopental is primarily an anesthetic, not a painkiller (analgesic)."},{"incorrect":"✗ You can buy thiopental over the counter.","correct":"✓ Thiopental is a prescription medication administered by medical professionals.","note":"Thiopental is a controlled substance and requires a prescription and administration by trained medical personnel."}],"priority":"★★☆"},"related_words":{"derivatives":["barbiturate","anesthetic","sedative","anticonvulsant"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Thiopental' is a specialized term primarily encountered in medical contexts. Understanding its usage requires familiarity with pharmacology and anesthesia. The term is not commonly used in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The veterinarian used thiopental to anesthetize the dog before surgery.","translation":"獣医は手術前に犬を麻酔するためにチオペンタールを使用した。","type":"medical","meaning_category":"anesthesia"},{"sentence":"Thiopental was administered intravenously to quickly induce unconsciousness.","translation":"意識を速やかに消失させるために、チオペンタールが静脈内投与された。","type":"medical","meaning_category":"anesthesia"}]}