{"word":"Strombolian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ストロンボリ式噴火の、ストロンボリ火山のような","english_definition":"Relating to or characterized by Strombolian eruptions; resembling Stromboli volcano in its eruptive style.","examples":[{"sentence":"The volcano exhibited Strombolian activity, with frequent bursts of gas and lava.","translation":"その火山はストロンボリ式活動を示し、ガスと溶岩の頻繁な噴出が見られた。"},{"sentence":"Strombolian eruptions are relatively mild compared to Plinian eruptions.","translation":"ストロンボリ式噴火は、プリニー式噴火と比較して比較的穏やかである。"}],"collocations":["Strombolian eruption","Strombolian activity","Strombolian volcano"],"synonyms":["volcanic","eruptive"],"antonyms":["plinian","vulcanian"]},{"part_of_speech":"noun","definition":"ストロンボリ式噴火","english_definition":"A type of volcanic eruption characterized by moderate bursts of expanding gases that eject clots of incandescent lava in cyclical or nearly continuous small eruptions.","examples":[{"sentence":"The Strombolian was characterized by discrete explosions of lava.","translation":"そのストロンボリ式噴火は、溶岩の個別の爆発によって特徴付けられた。"}],"collocations":["experience a Strombolian","observe a Strombolian"],"synonyms":["volcanic eruption"],"antonyms":[]}],"etymology":{"value":"Named after the volcano Stromboli, an island north of Sicily, Italy, which has frequent, moderate eruptions.","priority":"★★★"},"pronunciation":{"ipa":"/strɒmˈboʊliən/","syllables":"Strom-bo-li-an"},"inflection":{"notes":"Adjective and noun forms exist. Noun is typically used as a singular uncountable noun."},"usage_notes":{"explanation":"'Strombolian' describes a specific type of volcanic eruption. It's named after the Stromboli volcano, known for its frequent, relatively mild eruptions. The adjective form describes something related to this type of eruption, while the noun form refers to the eruption itself. It is a technical term used in volcanology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The volcano was strombolianing.","correct":"✓ The volcano was exhibiting Strombolian activity.","note":"'Strombolian' is not typically used as a verb. Use a phrase like 'exhibiting Strombolian activity' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["Stromboli (volcano name)","volcanology (study of volcanoes)","volcanic (related to volcanoes)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Strombolian' is a technical term related to volcanology. It refers to a specific type of volcanic eruption characterized by moderate bursts of gas and lava. Understanding this term requires knowledge of geological processes and vocabulary. It is typically used in scientific contexts and is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The geologist described the recent activity as **Strombolian**.","translation":"地質学者は最近の活動をストロンボリ式と説明した。","type":"adjective","meaning_category":"volcanic activity"},{"sentence":"The **Strombolian** sent lava bombs high into the air.","translation":"ストロンボリ式噴火は溶岩爆弾を空高く噴き上げた。","type":"noun","meaning_category":"volcanic eruption"}]}