{"word":"unicursal","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"一筆書きできる、単一の線で描ける","english_definition":"(of a figure or design) able to be traced or drawn continuously without lifting the pen or pencil from the paper and without retracing any part.","examples":[{"sentence":"The unicursal hexagram is a symbol that can be drawn in a single continuous line.","translation":"一筆書き六芒星は、一本の連続した線で描けるシンボルです。"},{"sentence":"Many labyrinths are designed to be unicursal, providing a single path from entrance to center.","translation":"多くの迷路は一筆書きできるように設計されており、入口から中心まで一本の道筋を提供します。"}],"collocations":["unicursal path","unicursal labyrinth","unicursal design","unicursal figure"],"synonyms":["single-line","continuous-line"],"antonyms":["multicursal","discontinuous"]},{"part_of_speech":"adjective","definition":"(数学)単葉的な","english_definition":"(mathematics) (of an algebraic curve) capable of being parameterized by rational functions of a single variable.","examples":[{"sentence":"A conic section is a unicursal curve.","translation":"円錐曲線は単葉的な曲線です。"}],"collocations":[],"synonyms":["rational"],"antonyms":["non-unicursal"]}],"etymology":{"value":"Derived from the Latin words 'uni-' (meaning 'one') and 'cursus' (meaning 'course' or 'path'). The term combines these elements to describe something that can be traced in a single course or path.","priority":"★★★"},"pronunciation":{"ipa":"/ˌjuːnɪˈkɜːrsəl/","syllables":"u-ni-cur-sal"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"The term 'unicursal' is most commonly encountered in contexts related to geometry, design, and symbolism, where the ability to draw a figure in a single continuous line is significant. It also has a more specialized meaning in mathematics, particularly in the field of algebraic geometry.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The shape was unicursal because it had only one line.","correct":"✓ The shape was unicursal because it could be drawn without lifting the pen.","note":"Unicursal specifically refers to the ability to draw a figure continuously, not simply having one line."}],"priority":"★☆☆"},"related_words":{"derivatives":["unicursality (noun)"],"phrases":[],"related_concepts":["labyrinth","hexagram","geometry","topology","algebraic curve"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unicursal' is a relatively uncommon term, primarily used in technical or specialized contexts. It describes a figure or design that can be drawn in a single continuous line without lifting the pen or retracing any part. Understanding the term requires familiarity with basic geometric concepts and an appreciation for the properties of continuous lines and paths. It is often encountered in discussions of labyrinths, geometric symbols, and mathematical curves."},"example_sentences":[{"sentence":"The artist created a stunning unicursal design for the logo.","translation":"そのアーティストは、ロゴのために見事な一筆書きのデザインを作成しました。","type":"general","meaning_category":"design"},{"sentence":"The unicursal labyrinth provided a meditative path to the center.","translation":"その一筆書き迷路は、中心への瞑想的な道を提供しました。","type":"general","meaning_category":"labyrinth"},{"sentence":"The mathematician proved that the curve was unicursal.","translation":"数学者はその曲線が単葉的であることを証明しました。","type":"mathematical","meaning_category":"mathematics"}]}