{"word":"orometry","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"山地の測定学、特に山地の高さの測定","english_definition":"The science or art of measuring mountains, especially their heights.","examples":[{"sentence":"Orometry is essential for creating accurate topographical maps of mountainous regions.","translation":"山地測定学は、山岳地域の正確な地形図を作成するために不可欠です。"},{"sentence":"Advancements in orometry have allowed for more precise determination of mountain elevations.","translation":"山地測定学の進歩により、山の標高をより正確に決定できるようになりました。"}],"collocations":["mountain orometry","precise orometry","geodetic orometry"],"synonyms":["hypsometry","altimetry","mountain measurement"],"antonyms":[]},{"part_of_speech":"noun","definition":"地形の高さの測定全般","english_definition":"The measurement of the elevation of landforms in general.","examples":[{"sentence":"Orometry plays a crucial role in understanding the Earth's surface.","translation":"地形測定学は、地球の表面を理解する上で重要な役割を果たします。"}],"collocations":["landform orometry","digital orometry"],"synonyms":["topographic measurement","elevation measurement"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の「oros」（山）と「metron」（測定）に由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/ɔːˈrɒmɪtri/","syllables":"o-rom-e-try"},"inflection":{"noun_plural":"orometries"},"usage_notes":{"explanation":"Orometry is a specialized term primarily used in geography, geology, and surveying. It specifically refers to the measurement of mountains and landforms, particularly their heights and elevations. It is closely related to hypsometry and altimetry, but orometry often encompasses a broader study of mountain characteristics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Orometry is the study of rocks.","correct":"✓ Orometry is the study of measuring mountains.","note":"Orometry is about measuring mountains and landforms, not studying rocks (which is geology or petrology)."},{"incorrect":"✗ Orometry is used to predict the weather.","correct":"✓ Orometry is used to measure the height of mountains.","note":"Orometry is about measuring elevations, not predicting weather (which is meteorology)."}],"priority":"★★☆"},"related_words":{"derivatives":["orometer (名詞: 山地の高さを測定する器具)"],"related_terms":["topography","geodesy","altimetry","hypsometry","geomorphology"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Orometry is a technical term referring to the measurement of mountains and landforms, particularly their elevations. It is a specialized field within geography and geology, involving precise measurement techniques to determine the height and shape of terrain. Understanding this term requires familiarity with scientific vocabulary related to mapping and surveying.","priority":"★★☆"},"example_sentences":[{"sentence":"Modern orometry techniques utilize satellite data for efficient elevation mapping.","translation":"現代の山地測定技術は、効率的な標高マッピングのために衛星データを利用しています。","type":"general","meaning_category":"mountain measurement"},{"sentence":"The orometry of the Himalayas presents unique challenges due to the extreme altitudes.","translation":"ヒマラヤ山脈の山地測定は、極端な高度のために独特の課題を抱えています。","type":"specific","meaning_category":"mountain height measurement"}]}