{"word":"paradichlorbenzol","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"パラジクロロベンゼン（防虫剤、殺虫剤として使用される有機化合物）","english_definition":"A chemical compound used as a deodorant, insecticide, and fumigant.","examples":[{"sentence":"Paradichlorbenzol is commonly used in mothballs.","translation":"パラジクロロベンゼンは一般的に防虫剤に使用されます。"},{"sentence":"The strong smell of paradichlorbenzol filled the closet.","translation":"パラジクロロベンゼンの強い臭いがクローゼットに充満していました。"}],"collocations":["mothballs","deodorant","insecticide"],"synonyms":["PDB","1,4-dichlorobenzene"],"antonyms":[]},{"part_of_speech":"noun","definition":"(化学式) C₆H₄Cl₂","english_definition":"Chemical formula: C₆H₄Cl₂","examples":[{"sentence":"The chemical formula of paradichlorbenzol is C₆H₄Cl₂.","translation":"パラジクロロベンゼンの化学式はC₆H₄Cl₂です。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"\"para-\" (位置を示す接頭辞) + \"dichlorobenzene\" (ジクロロベンゼン)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpærəˌdaɪˌklɔːrəˈbɛnziːn/","syllables":"pa-ra-di-chlo-ro-ben-zene"},"inflection":{"noun_plural":"paradichlorbenzols"},"usage_notes":{"explanation":"Paradichlorbenzol is a chemical compound primarily recognized for its use as a fumigant, insecticide, and deodorant. It is commonly found in mothballs and toilet bowl deodorizers. Due to its potential health hazards, its use is becoming less common, with alternatives being preferred.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate paradichlorbenzol.","correct":"✓ I used paradichlorbenzol as a moth repellent.","note":"Paradichlorbenzol is not for consumption. It's a chemical used for specific purposes like pest control."}],"priority":"★★☆"},"related_words":{"derivatives":["dichlorobenzene"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Paradichlorbenzol is a specialized term primarily encountered in contexts related to chemistry, pest control, or product safety. Its usage is typically limited to technical or informational materials concerning these fields, making it less common in general conversation or everyday texts. Understanding its properties and applications requires a familiarity with chemical nomenclature and the effects of volatile organic compounds."},"example_sentences":[{"sentence":"Exposure to high concentrations of paradichlorbenzol can cause health problems.","translation":"高濃度のパラジクロロベンゼンへの暴露は健康問題を引き起こす可能性があります。","type":"noun","meaning_category":"health hazard"},{"sentence":"Many older homes still have the lingering smell of paradichlorbenzol from mothballs.","translation":"多くの古い家では、防虫剤のパラジクロロベンゼンの臭いがまだ残っています。","type":"noun","meaning_category":"common usage"}]}