{"word":"Skunkdom","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"The realm, state, or characteristics of being a skunk; skunkiness.","english_definition":"The collective attributes, behaviors, or qualities associated with skunks, or a state resembling that associated with skunks.","examples":[{"sentence":"The pervasive odor hinted at the skunkdom residing nearby.","translation":"あたりに漂う臭いは、近くにスカンクの領域があることを示唆していた。"},{"sentence":"His actions reeked of skunkdom, betraying a lack of integrity.","translation":"彼の行動は誠実さに欠け、スカンクのような性質を漂わせていた。"}],"collocations":["the essence of skunkdom","the odor of skunkdom","enter skunkdom","leave skunkdom"],"synonyms":["skunkiness","skunkery","skunk nature","skunk state"],"antonyms":["purity","cleanliness","honesty","integrity"]}],"etymology":{"value":"Derived from \"skunk\" + \"-dom\", indicating a state, condition, or domain associated with skunks.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskʌŋkdəm/","syllables":"skunk-dom"},"inflection":{"noun_plural":"Skunkdoms"},"usage_notes":{"explanation":"\"Skunkdom\" is primarily used figuratively to describe a state or condition characterized by unpleasantness, offensiveness, or a lack of integrity, similar to the perceived characteristics of skunks. It is not a commonly used word and often carries a humorous or derogatory connotation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The skunkdom is very cute.","correct":"✓ The skunk is very cute.","note":"\"Skunkdom\" refers to the state or realm of skunks, not individual skunks. Use \"skunk\" to refer to the animal itself."},{"incorrect":"✗ He was born in skunkdom.","correct":"✓ He exhibited skunk-like behavior.","note":"\"Skunkdom\" is not a place of birth but a condition or quality. Use it metaphorically to describe behavior."}],"priority":"★☆☆"},"related_words":{"derivatives":["skunk (noun)","skunky (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Skunkdom\" is a rare and somewhat humorous or derogatory term used to describe a state or condition characterized by unpleasant or offensive qualities associated with skunks. It's not part of common vocabulary and is more likely to be encountered in creative writing or figurative speech. Understanding its meaning requires familiarity with the negative connotations associated with skunks."},"example_sentences":[{"sentence":"The political scandal plunged the nation into a state of skunkdom.","translation":"その政治スキャンダルは国をスカンクのような状態に陥れた。","type":"noun","meaning_category":"state of unpleasantness"},{"sentence":"His deceitful actions revealed the true skunkdom of his character.","translation":"彼の欺瞞的な行動は彼の性格のスカンクのような本質を明らかにした。","type":"noun","meaning_category":"lack of integrity"}]}