{"word":"polychromatism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"多色性、多色現象 (生物学において、個体群内で複数の異なる色彩や模様が存在する現象)","english_definition":"The condition of having or exhibiting many colors; specifically, in biology, the occurrence of two or more different color forms in a population of a species.","examples":[{"sentence":"Polychromatism is common in many insect species, such as ladybugs.","translation":"多色性は、テントウムシのような多くの昆虫種において一般的です。"},{"sentence":"The polychromatism observed in this species is thought to be related to camouflage.","translation":"この種に見られる多色性は、カモフラージュに関連していると考えられています。"},{"sentence":"Genetic factors play a significant role in determining the polychromatism of certain butterfly populations.","translation":"遺伝的要因は、特定の蝶の個体群の多色性を決定する上で重要な役割を果たします。"}],"collocations":["exhibit polychromatism (多色性を示す)","genetic polychromatism (遺伝的多色性)","environmental polychromatism (環境的多色性)","polychromatism in insects (昆虫における多色性)","polychromatism in butterflies (蝶における多色性)"],"synonyms":["multicoloration","variegation","color polymorphism"],"antonyms":["monochromatism (単色性)"]}],"etymology":{"value":"Derived from the Greek words 'poly' (meaning 'many') + 'chroma' (meaning 'color') + '-ism' (denoting a condition or characteristic).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɒlɪˈkroʊmətɪzəm/","syllables":"pol-y-chro-ma-tism"},"inflection":{"notes":"Uncountable noun"},"usage_notes":{"explanation":"'Polychromatism' is a term primarily used in biology and genetics to describe the existence of multiple distinct color morphs within a single population of a species. It's different from simple variation in color intensity; polychromatism involves discrete, non-overlapping color forms. The different color forms are often genetically determined, but environmental factors can also play a role.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artist used polychromatism in his painting.","correct":"✓ The artist used a polychromatic palette in his painting.","note":"While 'polychromatism' refers to the phenomenon of having many colors, it's not typically used to describe the use of many colors in art. Instead, use 'polychromatic' or 'multicolored' to describe the artwork itself."},{"incorrect":"✗ Polychromatism is the same as polymorphism.","correct":"✓ Polychromatism is a type of polymorphism.","note":"Polychromatism is a specific type of polymorphism that relates to color. Polymorphism is a broader term referring to the existence of different forms (morphs) within a population, which can include differences in size, shape, or behavior, in addition to color."}],"priority":"★★☆"},"related_words":{"derivatives":["polychromatic (adjective: having many colors)","polychrome (adjective/noun: multicolored, an object decorated in many colors)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Polychromatism' is a scientific term used in biology, particularly in genetics and ecology. It refers to the presence of multiple, distinct color variations within a population of a single species. This is different from simple color variation; polychromatism involves discrete color morphs. The term is relatively rare outside of scientific contexts. Understanding the etymology (poly- meaning 'many', chroma- meaning 'color') can help in remembering the meaning."},"example_sentences":[{"sentence":"The **polychromatism** in the snail population allows for better adaptation to different substrates.","translation":"そのカタツムリの個体群における多色性は、異なる基質へのより良い適応を可能にする。","type":"noun","meaning_category":"多色性 (生物学)"},{"sentence":"Researchers are studying the genetic basis of **polychromatism** in these beetles.","translation":"研究者たちは、これらの甲虫における多色性の遺伝的基盤を研究している。","type":"noun","meaning_category":"多色性 (生物学)"},{"sentence":"Environmental factors can influence the expression of **polychromatism** in some species.","translation":"環境的要因は、いくつかの種における多色性の発現に影響を与える可能性がある。","type":"noun","meaning_category":"多色性 (生物学)"}]}