{"word":"distributed-negative","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(言語学) 分配否定の、分散否定の","english_definition":"(linguistics) Relating to a type of negative construction where the negative element appears to be distributed across multiple parts of the sentence, often involving indefinite pronouns or adverbs.","examples":[{"sentence":"The sentence 'Nobody saw nothing' is an example of a distributed-negative construction.","translation":"「誰も何も見なかった」という文は、分配否定構文の例です。"},{"sentence":"Distributed-negative constructions can be ambiguous, as they may be interpreted as either a genuine negative or a form of emphatic affirmation.","translation":"分配否定構文は曖昧になる可能性があり、純粋な否定として解釈されることも、強調的な肯定の一種として解釈されることもあります。"}],"collocations":["distributed-negative construction","distributed-negative sentence","distributed-negative marker"],"synonyms":["multiple negation","negative concord"],"antonyms":["standard negation","single negation"]}],"etymology":{"value":"The term combines 'distributed' (referring to the spread of the negative element) and 'negative' (indicating the negation itself).","priority":"N/A"},"pronunciation":{"ipa":"/dɪˈstrɪbjutɪd ˈnɛɡətɪv/","syllables":"dis-trib-ut-ed neg-a-tive"},"inflection":{"notes":"As an adjective, it does not have plural forms or comparative/superlative degrees."},"usage_notes":{"explanation":"'Distributed-negative' is a technical term used in linguistics, specifically in the study of syntax and semantics. It describes sentences where negation is expressed through multiple negative elements, such as negative pronouns (e.g., 'nobody') and negative adverbs (e.g., 'never'). The interpretation of such constructions can vary across languages; in some languages, they reinforce the negation, while in others, they may cancel each other out (though this is less common).","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The distributed-negative sentence means positive.","correct":"✓ The distributed-negative sentence can sometimes be interpreted as emphatic affirmation, but it primarily functions as a negation.","note":"While distributed-negative constructions can sometimes be interpreted as emphatic affirmations, their primary function is usually to express negation."}],"priority":"N/A"},"related_words":{"derivatives":["distribution","negative","negation","concord"],"related_terms":["negative concord","multiple negation","double negative","triple negative"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily used in academic linguistics.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Distributed-negative' is a linguistic term that refers to a specific type of sentence construction where negation is expressed through multiple negative elements distributed throughout the sentence. This concept is typically discussed in advanced linguistics courses and research papers, making it a complex topic for non-linguists. Understanding this term requires familiarity with syntactic and semantic analysis."},"example_sentences":[{"sentence":"The analysis of distributed-negative constructions is crucial for understanding the grammar of certain languages.","translation":"分配否定構文の分析は、特定の言語の文法を理解するために不可欠です。","type":"general","meaning_category":"linguistics"},{"sentence":"In some dialects, distributed-negative sentences are considered grammatically correct.","translation":"一部の方言では、分配否定文は文法的に正しいと見なされています。","type":"example","meaning_category":"grammar"}]}