{"word":"Hypnum","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ハイゴケ属 (イタチノシッポゴケ科の蘚類の一属)","english_definition":"A genus of mosses in the family Hypnaceae.","examples":[{"sentence":"Hypnum mosses are often found in moist environments.","translation":"ハイゴケ属のコケは、湿った環境でよく見られる。"}],"collocations":["Hypnum cupressiforme (スギゴケ)","Hypnum imponens"],"synonyms":["moss","bryophyte"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'hypnos' meaning 'sleep', possibly referring to the moss's soft, covering nature.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɪpnəm/","syllables":"Hyp-num"},"inflection":{"noun_plural":"Hypnums"},"usage_notes":{"explanation":"'Hypnum' is a scientific term used to classify a specific genus of moss. It is most often encountered in botanical contexts or discussions related to ecology and plant biology.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a hypnum in my garden.","correct":"✓ I saw a Hypnum moss in my garden.","note":"'Hypnum' refers to the genus, so it's more accurate to specify 'Hypnum moss' or a specific species within the genus."}],"priority":"★★☆"},"related_words":{"derivatives":["Hypnaceae (イタチノシッポゴケ科)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hypnum' is a technical term used in botany to refer to a specific genus of mosses. Understanding this term requires familiarity with scientific classification and terminology related to plant biology. It is unlikely to be encountered in general conversation and is primarily used in academic or specialized contexts."},"example_sentences":[{"sentence":"The forest floor was covered in a thick carpet of Hypnum.","translation":"森林の地面はハイゴケ属の厚い絨毯で覆われていた。","type":"noun","meaning_category":"植物学"},{"sentence":"Scientists are studying the ecological role of Hypnum in wetland ecosystems.","translation":"科学者たちは湿地生態系におけるハイゴケ属の生態学的役割を研究している。","type":"noun","meaning_category":"植物学"}]}