{"word":"kymogram","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"キモグラフ、記録図、運動記録図","english_definition":"A graphic record produced by a kymograph.","examples":[{"sentence":"The kymogram showed a clear pattern of muscle contractions.","translation":"キモグラムは筋肉の収縮の明確なパターンを示した。"},{"sentence":"Analysis of the kymogram revealed irregularities in the heart rhythm.","translation":"キモグラムの分析により、心臓のリズムの不規則性が明らかになった。"}],"collocations":["analyze a kymogram","interpret a kymogram","record a kymogram","kymogram analysis"],"synonyms":["recording","graph","chart"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'kyma' (wave) and 'gramma' (something written or drawn).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkaɪməˌɡræm/","syllables":"ky-mo-gram"},"inflection":{"noun_plural":"kymograms"},"usage_notes":{"explanation":"A kymogram is a visual representation of a physiological event, such as muscle contraction or blood pressure changes, recorded over time using a kymograph. It is often used in scientific and medical research.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The kymogram was used to measure the temperature.","correct":"✓ The kymogram was used to measure the muscle contractions.","note":"Kymograms are used to measure physiological events that change over time, not static measurements like temperature."}],"priority":"★☆☆"},"related_words":{"derivatives":["kymograph"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A kymogram is a specialized term primarily used in scientific and medical contexts. It refers to a visual record of physiological events over time, typically produced by a kymograph. Understanding this term requires familiarity with scientific instrumentation and data analysis techniques.","priority":"★★☆"},"example_sentences":[{"sentence":"The researchers studied the kymogram to understand the effects of the drug on heart rate.","translation":"研究者たちは、薬物が心拍数に与える影響を理解するためにキモグラムを調べた。","type":"noun","meaning_category":"記録図"},{"sentence":"The kymogram clearly showed the increase in pressure during the experiment.","translation":"キモグラムは、実験中の圧力の上昇を明確に示した。","type":"noun","meaning_category":"記録図"}]}