{"word":"microbrewery","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"小規模醸造所、地ビール醸造所","english_definition":"A small brewery that produces limited quantities of beer, typically for local consumption.","examples":[{"sentence":"The town boasts a popular microbrewery known for its unique craft beers.","translation":"その町は、ユニークなクラフトビールで知られる人気の小規模醸造所を誇っています。"},{"sentence":"Many microbreweries offer tours and tastings to showcase their brewing process.","translation":"多くの小規模醸造所が、醸造工程を紹介するためにツアーや試飲を提供しています。"},{"sentence":"The microbrewery scene has exploded in recent years, with new breweries opening across the country.","translation":"近年、小規模醸造所のシーンは爆発的に拡大し、全国各地で新しい醸造所がオープンしています。"}],"collocations":["craft beer","local brewery","brewpub","small-batch beer","independent brewery"],"synonyms":["craft brewery","brewpub","small brewery"],"antonyms":["large-scale brewery","major brewery","mass-production brewery"]}],"etymology":{"value":"'Micro-' comes from the Greek word 'mikros' meaning small. 'Brewery' refers to a place where beer is brewed. The term 'microbrewery' emerged in the late 20th century to distinguish small, independent breweries from larger, mass-producing companies.","priority":"★★★"},"pronunciation":{"ipa":"/ˈmaɪkroʊˌbruːəri/","syllables":"mi-cro-brew-er-y"},"inflection":{"noun_plural":"microbreweries"},"usage_notes":{"explanation":"A microbrewery is characterized by its small production volume and focus on quality and unique flavors. They often emphasize traditional brewing methods and use high-quality ingredients. The term is often used interchangeably with 'craft brewery,' although some may consider 'craft brewery' to encompass a slightly broader range of breweries.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I visited a microbrewery and had a microbeer.","correct":"✓ I visited a microbrewery and had a craft beer.","note":"While 'microbrewery' refers to the brewery itself, the beer produced is typically called 'craft beer' or simply 'beer'."},{"incorrect":"✗ This microbrewery is very macro.","correct":"✓ This microbrewery is quite small.","note":"'Micro' and 'macro' are antonyms. A microbrewery, by definition, is not a large-scale operation."}],"priority":"★★☆"},"related_words":{"derivatives":["microbrewed (adjective)"],"phrasal_verbs":[],"related_terms":["craft beer","ale","lager","hops","malt","brewmaster","brewery","homebrewing","brewpub"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but increasing in recent years due to the popularity of craft beer.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Microbrewery' refers to a small, independent brewery that produces beer in limited quantities. These breweries often focus on unique flavors and high-quality ingredients, distinguishing themselves from larger, mass-production breweries. The term is commonly used in discussions about craft beer and the local brewing industry. Understanding the term requires familiarity with the craft beer movement and the distinctions between small-scale and large-scale beer production."},"example_sentences":[{"sentence":"The local microbrewery offers a wide selection of IPAs and stouts.","translation":"地元の小規模醸造所では、さまざまな種類のIPAやスタウトを提供しています。","type":"noun","meaning_category":"小規模醸造所"},{"sentence":"We spent the afternoon touring a microbrewery and sampling their beers.","translation":"私たちは午後を小規模醸造所の見学とビールの試飲に費やしました。","type":"noun","meaning_category":"小規模醸造所"},{"sentence":"The rise of microbreweries has transformed the beer industry.","translation":"小規模醸造所の台頭は、ビール業界を変革しました。","type":"noun","meaning_category":"小規模醸造所"}]}