{"word":"monosperm","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"単精子の、単精子性の","english_definition":"Having only one seed; developing from a single sperm.","examples":[{"sentence":"A monosperm fruit contains only one seed.","translation":"単精子性の果実は種を一つしか含んでいない。"},{"sentence":"Monosperm fertilization is the normal process in mammals.","translation":"単精子受精は哺乳類における正常なプロセスである。"}],"collocations":["monosperm fruit","monosperm fertilization"],"synonyms":["uniseeded"],"antonyms":["polysperm","multiseeded"]}],"etymology":{"value":"Derived from the Greek words 'monos' (single, alone) and 'sperma' (seed).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɒnəˌspɜːrm/","syllables":"mon-o-sperm"},"inflection":{"notes":"The word 'monosperm' is primarily used as an adjective. The related noun form is 'monospermy' (the condition of having only one seed or being fertilized by only one sperm)."},"usage_notes":{"explanation":"'Monosperm' is a technical term primarily used in botany and reproductive biology to describe structures or processes involving a single seed or sperm. It is often used in contrast to 'polysperm' or 'multiseeded' to highlight the difference.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant is monospermous because it has many seeds.","correct":"✓ The plant is monospermous because each fruit has only one seed.","note":"'Monospermous' refers to each fruit or structure having only one seed, not the entire plant having many seeds overall."}],"priority":"★☆☆"},"related_words":{"derivatives":["monospermy (noun): the condition of having only one seed or being fertilized by only one sperm)"],"related_terms":["polysperm","oligospermia","spermatogenesis"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - primarily a technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Monosperm' is a specialized term used in scientific contexts, particularly in botany and reproductive biology. It describes something that has only one seed or involves a single sperm. The word is not commonly used in everyday language and is more likely to be encountered in academic or technical discussions. Understanding the term requires familiarity with basic biological concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The researcher studied the development of monosperm fruits in the lab.","translation":"研究者は実験室で単精子性の果実の発達を研究した。","type":"general","meaning_category":"botany"},{"sentence":"Monosperm fertilization ensures the correct number of chromosomes in the offspring.","translation":"単精子受精は子孫における正しい数の染色体を保証する。","type":"general","meaning_category":"reproductive biology"}]}