{"word":"deworming","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"駆虫、寄生虫駆除","english_definition":"The process of removing parasitic worms (helminths) from the body of a human or animal.","examples":[{"sentence":"Regular deworming is essential for maintaining the health of pets.","translation":"定期的な駆虫はペットの健康を維持するために不可欠です。"},{"sentence":"Deworming programs are implemented in many developing countries to combat parasitic infections in children.","translation":"駆虫プログラムは、多くの発展途上国で子供たちの寄生虫感染症と闘うために実施されています。"}],"collocations":["deworming medication","deworming treatment","deworming program","routine deworming","mass deworming"],"synonyms":["anthelmintic treatment","worming","vermifugation"],"antonyms":[]}],"etymology":{"value":"Derived from \"de-\" (meaning removal or reversal) and \"worming\" (referring to the process of removing worms).","priority":"★★☆"},"pronunciation":{"ipa":"/diːˈwɜːrmɪŋ/","syllables":"dee-worm-ing"},"inflection":{"noun_plural":"dewormings"},"usage_notes":{"explanation":"\"Deworming\" refers specifically to the process of eliminating parasitic worms. It is commonly used in the context of veterinary medicine (for pets and livestock) and public health (especially in regions where parasitic worm infections are prevalent). The term often implies the use of medication (anthelmintics) to kill or expel the worms.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to deworm my dog from fleas.","correct":"✓ I need to deworm my dog. / ✓ I need to treat my dog for fleas.","note":"Deworming specifically refers to removing worms, not fleas or other external parasites. For fleas, use terms like \"flea treatment\" or \"flea control.\""},{"incorrect":"✗ Deworming is only for animals.","correct":"✓ Deworming is important for both humans and animals.","note":"While commonly associated with animals, deworming is also relevant for humans, especially in areas with high rates of parasitic worm infections."}],"priority":"★★☆"},"related_words":{"derivatives":["deworm (verb): to administer a deworming treatment","anthelmintic (noun/adjective): a medication used to kill parasitic worms"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in veterinary and public health contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Deworming\" is a term used to describe the process of getting rid of parasitic worms from the body, whether it's a person or an animal. It's often used in discussions about pet care or public health initiatives in areas where worm infections are common. The word implies using some kind of medicine to kill or remove these worms. It's important to remember that \"deworming\" specifically addresses worm infections, not other types of parasites like fleas or ticks."},"example_sentences":[{"sentence":"The vet recommended a deworming schedule for our puppy.","translation":"獣医は私たちの犬の子供のための駆虫スケジュールを推奨しました。","type":"noun","meaning_category":"寄生虫駆除"},{"sentence":"Mass deworming campaigns can significantly reduce the prevalence of intestinal worms in children.","translation":"集団駆虫キャンペーンは、子供たちの腸内寄生虫の蔓延を大幅に減らすことができます。","type":"noun","meaning_category":"寄生虫駆除"},{"sentence":"Before traveling abroad, consult your doctor about necessary vaccinations and deworming precautions.","translation":"海外旅行に行く前に、必要な予防接種と駆虫の注意点について医師に相談してください。","type":"noun","meaning_category":"寄生虫駆除"}]}