{"word":"illuminometer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"照度計","english_definition":"An instrument for measuring illuminance (the amount of light falling on a surface).","examples":[{"sentence":"The illuminometer reading showed that the light level was insufficient for reading.","translation":"照度計の測定値は、読書をするには光量が不十分であることを示していた。"},{"sentence":"The photographer used an illuminometer to ensure proper lighting for the portrait.","translation":"写真家は、ポートレート撮影のために適切な照明を確保するため、照度計を使用した。"}],"collocations":["take an illuminometer reading","calibrate an illuminometer","digital illuminometer","portable illuminometer"],"synonyms":["light meter","lux meter","photometer"],"antonyms":[]}],"etymology":{"value":"From 'illumino-' (referring to illumination) + '-meter' (measuring instrument).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˌluːmɪˈnɒmɪtər/","syllables":"il-lu-mi-nom-e-ter"},"inflection":{"noun_plural":"illuminometers"},"usage_notes":{"explanation":"An illuminometer is a specific type of light meter designed to measure illuminance, which is the amount of light falling on a surface. It is often used in photography, lighting design, and workplace safety to ensure adequate lighting levels. It's important to distinguish it from other types of light meters that measure different aspects of light, such as luminance or color temperature.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Use a thermometer to measure illuminance.","correct":"✓ Use an illuminometer to measure illuminance.","note":"A thermometer measures temperature, while an illuminometer measures illuminance."},{"incorrect":"✗ The illuminometer measures the brightness of the light source itself.","correct":"✓ The illuminometer measures the amount of light falling on a surface.","note":"An illuminometer measures illuminance, which is the light falling on a surface, not the brightness of the light source."}],"priority":"★★☆"},"related_words":{"derivatives":["illuminance (noun: the amount of light falling on a surface)","illumination (noun: the act of lighting something up)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"An illuminometer is a device used to measure how much light is hitting a surface. It's important for making sure there's enough light for different activities, like reading or working. It's a specialized tool used in fields like photography, lighting design, and workplace safety. The key thing to remember is that it measures the light on a surface, not the brightness of the light itself."},"example_sentences":[{"sentence":"The engineer used an illuminometer to check the lighting levels in the office.","translation":"エンジニアは、事務所の照明レベルを確認するために照度計を使用した。","type":"noun","meaning_category":"measurement"},{"sentence":"The illuminometer showed a reading of 500 lux.","translation":"照度計は500ルクスの測定値を示した。","type":"noun","meaning_category":"measurement"},{"sentence":"The photographer relied on the illuminometer to set the correct exposure for the indoor shoot.","translation":"写真家は、屋内撮影の適切な露出を設定するために照度計を頼りにした。","type":"noun","meaning_category":"photography"}]}