{"word":"jingoist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"強硬な愛国主義者、好戦的な愛国主義者","english_definition":"a person who professes their patriotism loudly and excessively, favoring vigilant preparedness for war and an aggressive foreign policy; a bellicose nationalist.","examples":[{"sentence":"The politician was labeled a jingoist for his aggressive stance on foreign policy.","translation":"その政治家は、攻撃的な外交政策のために強硬な愛国主義者だとレッテルを貼られた。"},{"sentence":"Jingoists often advocate for military intervention in international conflicts.","translation":"好戦的な愛国主義者は、国際紛争への軍事介入を主張することが多い。"},{"sentence":"The newspaper was accused of jingoism for its biased reporting on the war.","translation":"その新聞は、戦争に関する偏った報道で好戦的愛国主義だと非難された。"}],"collocations":["extreme jingoist","nationalist jingoist","patriotic jingoist","war jingoist"],"synonyms":["chauvinist","nationalist","warmonger","hawk","flag-waver"],"antonyms":["pacifist","dove","internationalist"]},{"part_of_speech":"adjective","definition":"強硬な愛国主義の、好戦的な愛国主義の","english_definition":"characterized by extreme patriotism, especially in the form of aggressive or warlike foreign policy.","examples":[{"sentence":"The jingoist rhetoric fueled public support for the war.","translation":"好戦的な愛国主義のレトリックが、戦争に対する国民の支持を煽った。"},{"sentence":"The jingoist press called for immediate military action.","translation":"好戦的な愛国主義の報道機関は、即時の軍事行動を要求した。"},{"sentence":"He criticized the jingoist attitude of the government.","translation":"彼は政府の好戦的な愛国主義的態度を批判した。"}],"collocations":["jingoist attitude","jingoist rhetoric","jingoist policy","jingoist fervor"],"synonyms":["chauvinistic","nationalistic","warlike","belligerent","militaristic"],"antonyms":["pacifistic","peaceful","conciliatory"]}],"etymology":{"value":"元々は1870年代後半のイギリスで、ロシア・トルコ戦争においてトルコを支持するスローガン「We don't want to fight, but by Jingo if we do...」から生まれた言葉。 Jingo は、誓いの言葉として使われていた婉曲表現。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒɪŋɡoʊɪst/","syllables":"jin-go-ist"},"inflection":{"noun_plural":"jingoists"},"usage_notes":{"explanation":"「**jingoist**」は、単に愛国心を持つ人ではなく、それを過剰に主張し、他国に対して攻撃的な姿勢を取る人を指します。しばしば、自国の優位性を信じ、他国を軽視する傾向があります。この言葉は、批判的な意味合いで使われることがほとんどです。名詞としても形容詞としても使用できます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a patriot, not a jingoist, because he loves his country.","correct":"✓ He is a patriot, not a jingoist, because he doesn't advocate for war.","note":"愛国心を持つこと自体は jingoism ではありません。戦争を支持したり、攻撃的な外交政策を主張したりする点が jingoism の特徴です。"},{"incorrect":"✗ The jingoist is very friendly and welcoming to foreigners.","correct":"✓ The jingoist is suspicious and hostile towards foreigners.","note":"Jingoists は、外国人に対して友好的であることは稀です。自国中心主義的な考え方を持つため、外国人に対して不信感や敵意を抱くことがあります。"}],"priority":"★★☆"},"related_words":{"derivatives":["jingoism (名詞: 強硬な愛国主義、好戦的な愛国主義)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**jingoist**」は、自分の国をとても愛しているけれど、その愛し方が少し行き過ぎていて、他の国に対して攻撃的な態度をとる人のことを言います。たとえば、戦争をすぐに始めようとしたり、他の国の人を見下したりするような人が「jingoist」と呼ばれます。この言葉は、あまり良い意味では使われません。ニュースや歴史の本でよく見かける言葉です。"},"example_sentences":[{"sentence":"The speaker's jingoist remarks were met with disapproval.","translation":"演説者の好戦的な愛国主義的発言は、不評を買った。","type":"adjective","meaning_category":"好戦的な愛国主義の"},{"sentence":"He was accused of being a jingoist for supporting the invasion.","translation":"彼は侵略を支持したことで、好戦的な愛国主義者だと非難された。","type":"noun","meaning_category":"強硬な愛国主義者"}]}