{"word":"Gelatinobromide","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ゼラチン臭化銀 (写真フィルムや印画紙の感光材料)","english_definition":"A light-sensitive compound of gelatin and silver bromide, used in photographic films and papers.","examples":[{"sentence":"Gelatinobromide is a key component in traditional photography.","translation":"ゼラチン臭化銀は、伝統的な写真における重要な要素です。"},{"sentence":"The gelatinobromide emulsion is coated onto the film base.","translation":"ゼラチン臭化銀乳剤は、フィルムベース上に塗布されます。"}],"collocations":["gelatinobromide emulsion","gelatinobromide process"],"synonyms":["silver halide emulsion"],"antonyms":[]}],"etymology":{"value":"'Gelatino-' refers to gelatin, the binding agent. 'Bromide' refers to silver bromide, the light-sensitive chemical.","priority":"★★☆"},"pronunciation":{"ipa":"/dʒəˌlætɪnoʊˈbroʊmaɪd/","syllables":"je-lat-i-no-bro-mide"},"inflection":{"noun_plural":"gelatinobromides"},"usage_notes":{"explanation":"'Gelatinobromide' specifically refers to the combination of gelatin and silver bromide used as a light-sensitive emulsion in photography. It's a technical term primarily used in the context of historical or scientific discussions about photography.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ gelatin bromide","correct":"✓ gelatinobromide","note":"The term is usually written as one word."}],"priority":"★☆☆"},"related_words":{"derivatives":["gelatin","bromide","silver bromide","emulsion"],"related_terms":["photography","film","photographic paper","hologenography"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Gelatinobromide' is a highly technical term specific to the field of photography, particularly in the context of traditional, film-based photography. Understanding this term requires familiarity with the chemical processes involved in creating photographic emulsions. It is unlikely to be encountered outside of specialized texts or discussions on the history of photography."},"example_sentences":[{"sentence":"The development of gelatinobromide emulsions revolutionized photography by significantly increasing the sensitivity of photographic materials.","translation":"ゼラチン臭化銀乳剤の開発は、写真材料の感度を大幅に向上させることで、写真技術に革命をもたらしました。","type":"noun","meaning_category":"technical"},{"sentence":"Early photographic plates used a gelatinobromide coating to capture images.","translation":"初期の写真乾板は、画像を捉えるためにゼラチン臭化銀コーティングを使用していました。","type":"noun","meaning_category":"historical"}]}