{"word":"autoicous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(植物学) 雌雄同株の、自家受粉性の","english_definition":"(botany) Having male and female reproductive structures on the same plant, but on separate branches or in separate inflorescences; capable of self-fertilization.","examples":[{"sentence":"Autoicous mosses have both antheridia and archegonia on the same plant.","translation":"雌雄同株のコケは、同じ植物上に造精器と造卵器の両方を持つ。"}],"collocations":["autoicous moss","autoicous plant"],"synonyms":["monoecious","self-fertile"],"antonyms":["dioecious","heteroecious"]}],"etymology":{"value":"Derived from the Greek words 'auto' (self) and 'oikos' (house), referring to the 'self-house' or single plant having both male and female reproductive organs.","priority":"★★☆"},"pronunciation":{"ipa":"/ɔːˈtɔɪɪkəs/","syllables":"au-toi-cous"},"inflection":{"notes":"Comparative and superlative forms are not typically used for this adjective."},"usage_notes":{"explanation":"'Autoicous' is a botanical term specifically used to describe plants, especially mosses, that have both male (antheridia) and female (archegonia) reproductive structures on the same plant, but these structures are located separately, either on different branches or in different inflorescences. This arrangement allows for both self-fertilization and cross-fertilization. It is important to note that while 'monoecious' is a more general term for plants having both male and female flowers on the same plant, 'autoicous' specifies that these structures are separated.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The animal is autoicous.","correct":"✓ The plant is autoicous.","note":"'Autoicous' is specifically used for plants, not animals."},{"incorrect":"✗ The flower is autoicous because it has both stamens and pistils in the same flower.","correct":"✓ The plant is monoecious; if the male and female structures were on separate parts of the same plant, it could be described as autoicous.","note":"If the male and female parts are in the same flower, the plant is not autoicous, but rather a perfect flower. Autoicous refers to separate structures on the same plant."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["monoecious","dioecious","heteroecious","antheridium","archegonium","self-fertilization","cross-fertilization"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Autoicous' is a technical term used in botany to describe a specific type of plant reproductive strategy. It refers to plants that have both male and female reproductive organs on the same individual plant, but these organs are located separately, such as on different branches. This is a more specific term than 'monoecious,' which simply means having both male and female flowers on the same plant. Understanding this term requires a background in plant biology and reproductive strategies."},"example_sentences":[{"sentence":"The autoicous nature of this moss species allows it to reproduce even in isolated environments.","translation":"このコケ種の雌雄同株性は、孤立した環境でも繁殖を可能にする。","type":"adjective","meaning_category":"botany"},{"sentence":"Unlike dioecious plants, autoicous plants do not require a separate male plant for fertilization.","translation":"雌雄異株の植物とは異なり、雌雄同株の植物は受精のために別の雄株を必要としない。","type":"adjective","meaning_category":"botany"}]}