{"word":"dioestrous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(動物が)発情休止期の","english_definition":"Relating to or being the period of sexual quiescence between periods of oestrus in female mammals that have more than one oestrous cycle per year.","examples":[{"sentence":"The ewe is dioestrous.","translation":"その雌羊は発情休止期である。"},{"sentence":"Dioestrous animals are not receptive to mating.","translation":"発情休止期の動物は交尾を受け入れない。"}],"collocations":["dioestrous animal","dioestrous period"],"synonyms":["anestrous","anestrus"],"antonyms":["oestrous","estrous"]}],"etymology":{"value":"From the Greek 'di-' (two, double) + 'oestrus'. Refers to the period between two oestrus cycles.","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˈiːstrəs/","syllables":"di-oes-trous"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. Comparative and superlative forms (more dioestrous, most dioestrous) are possible but rare."},"usage_notes":{"explanation":"'Dioestrous' is a term used in veterinary medicine and animal physiology to describe the phase in the estrous cycle of some mammals. It specifically refers to the period of sexual inactivity between periods of heat (oestrus). It's a relatively technical term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The animal is dioestrus.","correct":"✓ The animal is dioestrous.","note":"'Dioestrous' is the adjective form. 'Dioestrus' is the noun form referring to the state."}],"priority":"★☆☆"},"related_words":{"derivatives":["dioestrus (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Dioestrous' is a highly specialized term used in the context of animal reproduction, specifically describing a phase in the estrous cycle. Understanding this term requires knowledge of biology and animal physiology. It is unlikely to be encountered outside of scientific or veterinary contexts."},"example_sentences":[{"sentence":"During the dioestrous phase, progesterone levels are typically elevated.","translation":"発情休止期の間、プロゲステロンのレベルは通常上昇する。","type":"general","meaning_category":"physiology"},{"sentence":"Management of dioestrous cows focuses on maintaining good health and nutrition.","translation":"発情休止期の牛の管理は、良好な健康と栄養の維持に焦点を当てる。","type":"veterinary","meaning_category":"animal management"}]}