{"word":"unaccommodated","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"収容されていない、宿泊施設が提供されていない","english_definition":"Not provided with accommodation or lodging; not having suitable facilities or arrangements.","examples":[{"sentence":"The refugees were unaccommodated and forced to sleep in the streets.","translation":"難民たちは収容されず、路上で寝ることを余儀なくされた。"},{"sentence":"The conference was overbooked, leaving several attendees unaccommodated.","translation":"会議は予約超過となり、数人の参加者は宿泊施設が提供されなかった。"},{"sentence":"The homeless population remains largely unaccommodated by the city's shelters.","translation":"ホームレスの人々は、市のシェルターによってほとんど収容されていない。"}],"collocations":["unaccommodated refugees (収容されていない難民)","unaccommodated guests (宿泊施設が提供されていない客)","remain unaccommodated (収容されていない状態が続く)","largely unaccommodated (大部分が収容されていない)"],"synonyms":["unsheltered","unhoused","unlodged","unsettled","unsupported"],"antonyms":["accommodated","sheltered","housed","lodged","settled","supported"]},{"part_of_speech":"adjective","definition":"(比喩的に)受け入れられていない、考慮されていない、適応されていない","english_definition":"(Figuratively) Not taken into account; not adapted or adjusted to; not fitting in.","examples":[{"sentence":"His radical ideas were unaccommodated by the conservative establishment.","translation":"彼の過激な考えは、保守的な体制には受け入れられなかった。"},{"sentence":"The new software is unaccommodated to older operating systems.","translation":"新しいソフトウェアは、古いオペレーティングシステムには対応していない。"},{"sentence":"Her needs were unaccommodated in the rigid structure of the organization.","translation":"彼女のニーズは、組織の硬直した構造の中では考慮されなかった。"}],"collocations":["unaccommodated needs (考慮されていないニーズ)","unaccommodated ideas (受け入れられていない考え)","unaccommodated to (～に対応していない)"],"synonyms":["unaccepted","unconsidered","unadapted","unadjusted","unsuited","incompatible"],"antonyms":["accepted","considered","adapted","adjusted","suited","compatible"]}],"etymology":{"value":"Formed from the prefix 'un-' (not) and the past participle 'accommodated' of the verb 'accommodate'. 'Accommodate' comes from the Latin 'accommodare', meaning 'to fit, adjust, adapt, make fit'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnəˈkɒmədeɪtɪd/","syllables":"un-ac-com-mo-da-ted"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb. It can be modified by adverbs (e.g., 'largely unaccommodated')."},"usage_notes":{"explanation":"'Unaccommodated' is used to describe a state of lacking accommodation, either literally (in terms of housing or lodging) or figuratively (in terms of acceptance or adaptation). It often implies a lack of provision or suitability. The figurative sense is less common than the literal sense.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The hotel was unaccommodating to our needs.","correct":"✓ The hotel was unaccommodating. / ✓ The hotel did not accommodate our needs.","note":"'Unaccommodating' (without the '-ed') means unwilling to help or make concessions. 'Unaccommodated' means not provided with accommodation. The intended meaning dictates the correct word choice."},{"incorrect":"✗ The software is unaccommodated with the new update.","correct":"✓ The software is unaccommodated to the new update.","note":"When using 'unaccommodated' in the figurative sense of 'not adapted to', the correct preposition is usually 'to'."}],"priority":"★★☆"},"related_words":{"derivatives":["accommodate (verb)","accommodation (noun)","unaccommodating (adjective)"],"phrases":["unaccommodated man (シェイクスピアの『リア王』に登場する表現で、衣服や財産など、文明的なものを一切持たない人間の本質を指す)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. The word is relatively rare in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unaccommodated' is a relatively uncommon and formal word. It means 'not provided with accommodation' or, figuratively, 'not taken into account or adapted to'. It is most often used in formal writing or speech when discussing issues of housing, refugees, or the compatibility of systems or ideas. Because of its relative rarity, it is more likely to be encountered by advanced English learners. It is important to distinguish it from 'unaccommodating', which means 'unwilling to help'.","priority":"★★☆"},"example_sentences":[{"sentence":"The music festival left many attendees unaccommodated, forcing them to camp in nearby fields.","translation":"その音楽祭では多くの参加者が収容されず、近くの野原でキャンプすることを余儀なくされた。","type":"adjective","meaning_category":"収容されていない"},{"sentence":"The new regulations are unaccommodated to the specific needs of small businesses.","translation":"新しい規制は、中小企業の特定のニーズに対応していない。","type":"adjective","meaning_category":"受け入れられていない"},{"sentence":"The influx of tourists left many visitors unaccommodated during the peak season.","translation":"観光客の流入により、ピークシーズン中に多くの観光客が宿泊施設を提供されなかった。","type":"adjective","meaning_category":"収容されていない"},{"sentence":"His unconventional views were unaccommodated by the traditional academic community.","translation":"彼の型破りな見解は、伝統的な学術界には受け入れられなかった。","type":"adjective","meaning_category":"受け入れられていない"}]}