{"word":"antinoness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A person who is opposed to nuns or the monastic life for women.","english_definition":"A person who is opposed to nuns or the monastic life for women.","examples":[{"sentence":"The speaker was described as an antinoness due to her critical views on the convent system.","translation":"その講演者は、修道院制度に対する批判的な見解から、反修道女主義者であると評された。"}],"collocations":["staunch antinoness","vocal antinoness"],"synonyms":["anti-monastic","anti-clerical"],"antonyms":["pro-nun","supporter of nuns"]}],"etymology":{"value":"Formed by adding the prefix 'anti-' (meaning against) to 'noness' (a female member of a religious order).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæntiˈnʌnəs/","syllables":"an-ti-no-ness"},"inflection":{"noun_plural":"antinonesses"},"usage_notes":{"explanation":"The term 'antinoness' is relatively rare and specific, referring to someone who actively opposes the institution of nuns or the monastic life for women. It is often used in historical or sociological contexts when discussing attitudes towards religious orders.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"She is an antinoness because she doesn't like religion.","correct":"She is an antinoness because she specifically opposes the role and practices of nuns.","note":"Antinoness specifically refers to opposition to nuns, not necessarily to all religion."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["nun","monasticism","convent","monastery","anti-clericalism"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'antinoness' is a niche term, unlikely to be encountered except in specialized discussions about religious history or sociology. Understanding requires familiarity with the concepts of monasticism and religious orders for women."},"example_sentences":[{"sentence":"Historically, some reformers were labeled as antinonesses due to their efforts to dissolve convents.","translation":"歴史的に、一部の改革者は修道院の解散を試みたため、反修道女主義者と見なされた。","type":"noun","meaning_category":"opposition to nuns"},{"sentence":"Her book presents a nuanced view, challenging both the supporters and the antinonesses in the debate.","translation":"彼女の著書は、議論における支持者と反修道女主義者の両方に異議を唱え、ニュアンスのある見解を示している。","type":"noun","meaning_category":"opposition to nuns"}]}