{"word":"syllabaria","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"音節文字、音節文字表","english_definition":"A writing system where each symbol represents a syllable. Also, a table or list of such symbols.","examples":[{"sentence":"Cherokee is written using a syllabary.","translation":"チェロキー語は音節文字を使って書かれます。"},{"sentence":"The Linear B script is a syllabary.","translation":"線文字Bは音節文字です。"},{"sentence":"A syllabary contains symbols representing consonant-vowel combinations.","translation":"音節文字は子音と母音の組み合わせを表す記号を含んでいます。"}],"collocations":["Cherokee syllabary","Japanese syllabaries (hiragana and katakana)","Linear B syllabary","create a syllabary","learn a syllabary","use a syllabary"],"synonyms":["syllabic script","syllabic alphabet"],"antonyms":["alphabet","ideogram","logogram"]}],"etymology":{"value":"Derived from 'syllable' + '-ary'.","priority":"★★★"},"pronunciation":{"ipa":"/sɪˈlæbəriə/","syllables":"syl-lab-a-ri-a"},"inflection":{"noun_plural":"syllabaries"},"usage_notes":{"explanation":"'Syllabary' refers to a writing system where each character represents a syllable, which is a unit of pronunciation having one vowel sound, with or without surrounding consonants. Japanese hiragana and katakana are examples of syllabaries. A syllabary differs from an alphabet, where each character represents a single phoneme (speech sound), and from logographic systems, where each character represents a word or morpheme.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He wrote in alphabet, not syllabary.","correct":"✓ He wrote in an alphabet, not a syllabary.","note":"'Alphabet' and 'syllabary' are countable nouns and usually require an article ('a', 'an', or 'the') when used in a general sense."},{"incorrect":"✗ Syllabaries is easier than alphabets.","correct":"✓ Syllabaries are easier than alphabets.","note":"'Syllabaries' is a plural noun and requires a plural verb ('are')."}],"priority":"★★☆"},"related_words":{"derivatives":["syllabic (adjective: relating to or based on syllables)","syllable (noun: a unit of pronunciation having one vowel sound, with or without surrounding consonants)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'syllabary' is a specialized term used in linguistics and the study of writing systems. It refers to a system where each written symbol represents a syllable. This is different from an alphabet, where each symbol represents a single sound. Understanding this term requires some familiarity with linguistic concepts. Examples of syllabaries include the Japanese hiragana and katakana scripts, and the Cherokee script."},"example_sentences":[{"sentence":"The ancient Minoan Linear A script is believed to be a syllabary.","translation":"古代ミノアの線文字Aは音節文字であると考えられています。","type":"general"},{"sentence":"Learning a syllabary can be easier for some learners than learning an alphabet.","translation":"音節文字を学ぶことは、アルファベットを学ぶよりも一部の学習者にとって容易な場合があります。","type":"general"},{"sentence":"The symbols in a syllabary often represent a consonant-vowel combination.","translation":"音節文字の記号は、しばしば子音と母音の組み合わせを表します。","type":"general"}]}