{"word":"alecithic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(生物学)卵黄がほとんど、または全くない卵について記述する","english_definition":"(biology) describing an egg that has little or no yolk.","examples":[{"sentence":"Alecithic eggs rely on the mother's body to provide nutrients to the developing embryo.","translation":"無黄卵は、発生中の胚に栄養を供給するために母体の体に依存している。"}],"collocations":[],"synonyms":["oligolecithal"],"antonyms":["telolecithal","macrolecithal","megalecithal"]}],"etymology":{"value":"'a-' (without) + 'lecithos' (yolk) + '-ic'. 'Lecithos' is from Greek meaning 'yolk of egg'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌeɪləˈsɪθɪk/","syllables":"a-le-ci-thic"},"inflection":{},"usage_notes":{"explanation":"'Alecithic' is primarily used in the context of biology, specifically when discussing different types of eggs based on the amount of yolk they contain. It is not a commonly used word outside of this scientific context.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["lecithal","lecithin"],"related_terms":["telolecithal","oligolecithal","macrolecithal","yolk"]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The word 'alecithic' is a highly specialized term used in biology, specifically in embryology and developmental biology. It describes a type of egg cell that contains very little or no yolk. Yolk is the nutrient-rich material that nourishes the developing embryo. Alecithic eggs are found in organisms where the developing embryo receives nutrients directly from the mother, such as in placental mammals. This term is not typically encountered outside of advanced biology courses or scientific literature."},"example_sentences":[{"sentence":"The eggs of placental mammals are typically alecithic.","translation":"有胎盤哺乳類の卵は通常、無黄卵である。","type":"scientific","meaning_category":"biology"},{"sentence":"In alecithic eggs, the embryo relies entirely on maternal resources for nutrition.","translation":"無黄卵では、胚は栄養のために完全に母体の資源に依存している。","type":"scientific","meaning_category":"biology"}]}