{"word":"perorator","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"長広舌をふるう人、演説家ぶる人、くどくどと話す人","english_definition":"a person who makes long, pompous speeches; a windbag.","examples":[{"sentence":"He was a terrible perorator, boring everyone with his endless speeches.","translation":"彼はひどいペロレーターで、終わりのない演説でみんなを退屈させた。"},{"sentence":"The perorator held the audience captive with his elaborate language and dramatic gestures.","translation":"そのペロレーターは、手の込んだ言葉と劇的な身振りで聴衆を魅了した。"},{"sentence":"Don't be such a perorator; get to the point!","translation":"そんなに長広舌をふるわないで、要点を言って！"}],"collocations":["a pompous perorator","an endless perorator","a boring perorator"],"synonyms":["windbag","rhetorician","orator","haranguer","bombast","pontificator"],"antonyms":["succinct speaker","concise speaker","laconic speaker"]}],"etymology":{"value":"'Perorator' is derived from the Latin word 'perorare,' meaning 'to speak at length, to plead at length, to conclude a speech.' 'Perorare' itself comes from 'per-' (thoroughly) + 'orare' (to speak, plead).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɛrəreɪtər/","syllables":"per-o-ra-tor"},"inflection":{"noun_plural":"perorators"},"usage_notes":{"explanation":"'Perorator' is typically used in a negative or critical way to describe someone who speaks at great length, often in a pompous or tedious manner. It implies that the speaker is overly verbose and perhaps self-important. The term is not commonly used in everyday conversation but is more often found in literature or formal writing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She was a great perorator because she spoke quietly and briefly.","correct":"✓ She was a great speaker because she spoke eloquently and persuasively.","note":"A 'perorator' is someone who speaks at length, often tediously, so the opposite would be true."},{"incorrect":"✗ He perorated his way through the grocery store, buying all the items.","correct":"✓ He spoke at length about politics at the grocery store, annoying other shoppers.","note":"'Perorate' is not a verb that describes an action like buying groceries; it describes the act of giving a long, often pompous speech."}],"priority":"★☆☆"},"related_words":{"derivatives":["perorate (verb)","peroration (noun)"],"phrases":["long-winded speech","pompous rhetoric","tedious speaker"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'perorator' is a relatively uncommon and sophisticated term used to describe someone who speaks at length, often in a pompous or tedious manner. It's not a word typically used in everyday conversation, making it suitable for advanced learners who are familiar with more formal or literary language. Understanding this word requires a grasp of nuance and context, as it carries a negative connotation."},"example_sentences":[{"sentence":"The senator was known as a skilled perorator, capable of holding the floor for hours.","translation":"その上院議員は、何時間も演壇を占拠できる熟練したペロレーターとして知られていた。","type":"noun","meaning_category":"長広舌をふるう人"},{"sentence":"The audience grew restless as the perorator continued his rambling speech.","translation":"ペロレーターがとりとめのない演説を続けるにつれて、聴衆は落ち着きをなくした。","type":"noun","meaning_category":"くどくどと話す人"},{"sentence":"His reputation as a perorator preceded him, so few people looked forward to his presentations.","translation":"彼のペロレーターとしての評判は先行していたので、彼のプレゼンテーションを楽しみにしている人はほとんどいなかった。","type":"noun","meaning_category":"演説家ぶる人"}]}