{"word":"abhorring","priority":"★★★","meanings":[{"part_of_speech":"verb (present participle)","definition":"(強く)嫌悪する、忌み嫌う","english_definition":"regarding with disgust and hatred.","examples":[{"sentence":"She is abhorring violence in any form.","translation":"彼女はあらゆる形の暴力を強く嫌悪している。"},{"sentence":"He was abhorring the idea of having to work on weekends.","translation":"彼は週末に働かなければならないという考えを忌み嫌っていた。"}],"collocations":["abhorring violence","abhorring the thought","abhorring the idea"],"synonyms":["detesting","hating","loathing","despising","abominating"],"antonyms":["loving","admiring","relishing","enjoying"]}],"etymology":{"value":"The word \"abhor\" comes from the Latin word \"abhorrēre,\" meaning \"to shrink back from, shudder at.\" It is formed from \"ab-\" (away, from) and \"horrēre\" (to bristle, shudder). The present participle \"abhorring\" reflects the ongoing state of feeling such disgust.","priority":"★★☆"},"pronunciation":{"ipa":"/əbˈhɔːrɪŋ/","syllables":"ab-hor-ring"},"inflection":{"verb_forms":{"present_simple":["abhor","abhors"],"past_simple":"abhorred","past_participle":"abhorred","present_participle":"abhorring"}},"usage_notes":{"explanation":"\"Abhorring\" describes a strong feeling of repugnance or aversion. It is a more intense word than \"disliking\" or \"hating.\" It suggests a feeling of disgust and revulsion. The present participle form indicates that this feeling is currently being experienced.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am abhorring to eat that.","correct":"✓ I abhor eating that. / ✓ I abhor to eat that.","note":"\"Abhor\" can be followed by a gerund (eating) or an infinitive (to eat), but not directly by \"to\" before the verb. Using a gerund is more common."},{"incorrect":"✗ He is abhorring of spiders.","correct":"✓ He abhors spiders.","note":"While you can say \"He is abhorrent to me,\" meaning he is disgusting, \"abhorring\" is the present participle of the verb \"abhor,\" meaning to strongly dislike. Therefore, \"He abhors spiders\" is the correct usage to express his strong dislike."}],"priority":"★★☆"},"related_words":{"derivatives":["abhor (verb)","abhorrent (adjective)","abhorrence (noun)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, but used in formal writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Abhorring\" is a formal and strong word that means to hate something very much. It's not used in everyday conversation very often. You would typically find it in more formal writing or when someone wants to express a very strong feeling of disgust or aversion. It's stronger than just \"disliking\" something; it's more like finding something completely unacceptable or morally wrong."},"example_sentences":[{"sentence":"The politician was abhorring corruption and promised to fight against it.","translation":"その政治家は汚職を強く嫌悪し、それと戦うことを約束した。","type":"verb (present participle)","meaning_category":"嫌悪する"},{"sentence":"She is abhorring the mistreatment of animals.","translation":"彼女は動物虐待を忌み嫌っている。","type":"verb (present participle)","meaning_category":"嫌悪する"},{"sentence":"Many people are abhorring the violence shown in the movie.","translation":"多くの人々がその映画に示されている暴力に嫌悪感を抱いている。","type":"verb (present participle)","meaning_category":"嫌悪する"}]}