{"word":"word-catcher","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare) A person who is skilled at remembering or collecting words; a lexicographer or etymologist.","english_definition":"A person skilled at remembering or collecting words; a lexicographer or etymologist.","examples":[{"sentence":"He was a true word-catcher, always noting down interesting or unusual terms.","translation":"彼は真のワードキャッチャーで、常に興味深い、または珍しい言葉を書き留めていた。"},{"sentence":"As a dedicated word-catcher, she spent years compiling her own dictionary.","translation":"献身的なワードキャッチャーとして、彼女は何年もかけて自分自身の辞書を編集した。"}],"collocations":["skilled word-catcher","dedicated word-catcher","avid word-catcher"],"synonyms":["lexicographer","etymologist","philologist","word collector","linguist"],"antonyms":[]}],"etymology":{"value":"Likely a compound word formed from 'word' and 'catcher', indicating someone who 'catches' or collects words.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɜːrdˌkætʃər/","syllables":"word-catch-er"},"inflection":{"noun_plural":"word-catchers"},"usage_notes":{"explanation":"The term 'word-catcher' is relatively rare and not widely recognized. It is often used in a literary or descriptive context to refer to someone with a particular interest or skill in words. It is not a formal or technical term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a word catcher.","correct":"✓ He is a word-catcher.","note":"The hyphen is important to indicate that it is a compound noun."}],"priority":"★☆☆"},"related_words":{"derivatives":["word catching (noun, gerund)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (rare)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'word-catcher' is a relatively uncommon and evocative term, likely understood by those with a strong interest in language and etymology. Its meaning is fairly transparent from its component parts, but its rarity means it is unlikely to be encountered in everyday language. Understanding requires a good vocabulary and an appreciation for figurative language."},"example_sentences":[{"sentence":"The old scholar was known as a word-catcher, always eager to learn the origins of new terms.","translation":"その老学者はワードキャッチャーとして知られており、常に新しい言葉の起源を学ぶことに熱心だった。","type":"noun","meaning_category":"lexicographer"},{"sentence":"Her passion for language made her a natural word-catcher, able to recall obscure vocabulary with ease.","translation":"彼女の言語への情熱は、彼女を生まれながらのワードキャッチャーにし、難解な語彙を容易に思い出すことができた。","type":"noun","meaning_category":"etymologist"}]}