{"word":"Uptearing","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"The act of tearing something up; the state of being torn up.","english_definition":"The act of forcibly removing or tearing something from a surface or position, often resulting in damage or destruction.","examples":[{"sentence":"The uptearing of the old carpet revealed a beautiful hardwood floor beneath.","translation":"古いカーペットを剥がしたところ、下に美しい堅木張りの床が現れた。"},{"sentence":"The storm caused the uptearing of trees and power lines throughout the city.","translation":"嵐により、街中の木々や電線が引き抜かれる被害が発生した。"},{"sentence":"The uptearing of the pavement made it difficult to drive down the street.","translation":"舗装が剥がれて、通りを運転するのが困難になった。"}],"collocations":["cause uptearing","result in uptearing","prevent uptearing","massive uptearing","complete uptearing"],"synonyms":["ripping up","tearing up","uprooting","removal","extraction","dislodgement"],"antonyms":["planting","affixing","securing","attaching","embedding"]}],"etymology":{"value":"Derived from the verb phrase 'tear up' with the addition of the prefix 'up-' to emphasize the upward or outward direction of the tearing action.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌpˈtɛərɪŋ/","syllables":"up-tear-ing"},"inflection":{"noun_plural":"Uptearings"},"usage_notes":{"explanation":"'Uptearing' is typically used to describe a forceful removal or destruction, often involving a vertical or upward motion. It can apply to physical objects being torn from a surface, or to more abstract concepts, such as the disruption of a plan or system.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The uptearing was very damage.","correct":"✓ The uptearing caused a lot of damage.","note":"'Uptearing' is a noun, so it cannot be used as an adjective to describe 'damage'. Instead, use it as the subject of a sentence to indicate the cause of the damage."},{"incorrect":"✗ He uptearing the paper.","correct":"✓ He tore up the paper.","note":"'Uptearing' is a noun. If you want to describe the action of tearing, use the verb 'tear up'."}],"priority":"★★☆"},"related_words":{"derivatives":["tear (verb, noun)","uproot (verb)","rip (verb, noun)"],"phrasal_verbs":["tear up (verb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Uptearing' is a relatively uncommon noun that describes the act of tearing something up, often with force. It is typically used in contexts where something is being forcibly removed or destroyed, such as in descriptions of natural disasters or construction processes. The word is formed by combining 'up' and 'tearing', indicating an upward or outward motion of tearing. Understanding the context in which it is used is crucial, as it is not a frequently encountered word.","priority":"★★☆"},"example_sentences":[{"sentence":"The **uptearing** of the old building made way for the new skyscraper.","translation":"古い建物の取り壊しにより、新しい超高層ビルの建設が可能になった。","type":"noun","meaning_category":"removal/destruction"},{"sentence":"The hurricane caused the **uptearing** of trees and significant damage to property.","translation":"ハリケーンにより、木々が引き抜かれ、財産に大きな損害が出た。","type":"noun","meaning_category":"damage/destruction"},{"sentence":"The **uptearing** of the floorboards revealed a hidden compartment.","translation":"床板を剥がしたところ、隠し区画が現れた。","type":"noun","meaning_category":"removal/discovery"}]}