{"word":"appendency","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"付随物、付属品、付録","english_definition":"something that is added or attached to something else; an adjunct or appendage.","examples":[{"sentence":"The document had several appendencies providing additional details.","translation":"その文書には、追加の詳細を提供するいくつかの付録があった。"},{"sentence":"The new software includes several appendencies to enhance functionality.","translation":"新しいソフトウェアには、機能を強化するためのいくつかの付属品が含まれている。"}],"collocations":["additional appendency","technical appendency","detailed appendency"],"synonyms":["adjunct","attachment","addition","accessory","supplement"],"antonyms":["main body","core","principal element"]}],"etymology":{"value":"Derived from 'append' (to add as a supplement or accessory) + '-ency' (a suffix indicating a state, quality, or action).","priority":"★★★"},"pronunciation":{"ipa":"/əˈpɛndənsi/","syllables":"ap-pen-den-cy"},"inflection":{"noun_plural":"appendencies"},"usage_notes":{"explanation":"'Appendency' refers to something that is added or attached to something else, serving as a supplement or accessory. It is often used in formal or technical contexts to describe additional materials or features that enhance or support the main subject.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The appendency was crucial to the main argument.","correct":"✓ The appendix was crucial to the main argument.","note":"'Appendency' and 'appendix' are sometimes confused. 'Appendix' is more commonly used to refer to supplementary material at the end of a book or document."},{"incorrect":"✗ He showed great appendency to the project.","correct":"✓ He showed great dedication to the project.","note":"'Appendency' should not be used to describe personal qualities like dedication or commitment."}],"priority":"★★☆"},"related_words":{"derivatives":["append (verb): to add as a supplement or accessory","appendant (adjective): attached or belonging to something else; accessory or incidental"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Appendency' is a formal term referring to something added as a supplement or accessory. It is typically used in technical or academic contexts to describe additional materials or features that enhance the main subject. The word is not commonly used in everyday conversation, so familiarity with formal vocabulary is necessary to understand and use it correctly."},"example_sentences":[{"sentence":"The report includes an appendency detailing the experimental methods.","translation":"その報告書には、実験方法を詳述した付録が含まれている。","type":"general","meaning_category":"付録"},{"sentence":"The software upgrade offers several appendencies to improve user experience.","translation":"そのソフトウェアのアップグレードは、ユーザーエクスペリエンスを向上させるためのいくつかの付属品を提供する。","type":"technical","meaning_category":"付属品"},{"sentence":"The legal document contains an appendency outlining the terms and conditions.","translation":"その法的文書には、利用規約を概説した付録が含まれている。","type":"legal","meaning_category":"付随物"}]}