{"word":"trickster","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"いたずら者、詐欺師、トリックスター (神話や物語に登場する、知恵や策略を使って他人を欺いたり、いたずらをしたりする人物)","english_definition":"a person who deceives or plays tricks on others; in mythology and folklore, a character who uses cunning and deceit to play pranks or achieve their goals, often violating social norms.","examples":[{"sentence":"He was a real trickster, always playing pranks on his friends.","translation":"彼は本当にいたずら好きで、いつも友達にいたずらをしていた。"},{"sentence":"The coyote is a common trickster figure in Native American folklore.","translation":"コヨーテは、ネイティブアメリカンの民話によく登場するトリックスターである。"},{"sentence":"The trickster used his cunning to outsmart the powerful king.","translation":"トリックスターは、そのずる賢さを使って、力のある王を出し抜いた。"}],"collocations":["a classic trickster","a clever trickster","a mischievous trickster","a legendary trickster","trickster figure","trickster god","trickster archetype"],"synonyms":["deceiver","cheater","swindler","fraudster","prankster","joker","mischief-maker","rogue","rascal","scamp"],"antonyms":["honest person","straightforward person","trustworthy person"]}],"etymology":{"value":"「trick」（策略、いたずら）に接尾辞「-ster」（～する人）が付いたもの。","priority":"★★★"},"pronunciation":{"ipa":"/ˈtrɪkstər/","syllables":"trick-ster"},"inflection":{"noun_plural":"tricksters"},"usage_notes":{"explanation":"「**trickster**」は、単に「いたずら好き」というだけでなく、知恵や策略を使って他人を欺いたり、社会のルールを破ったりする人物を指すことが多いです。神話や物語に登場するキャラクターを指す場合、単なる悪者ではなく、文化的な意味合いを持つことがあります。例えば、社会の秩序を揺るがしたり、新しい価値観をもたらしたりする役割を担うことがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a trickster because he is very funny.","correct":"✓ He is a trickster because he is very clever at deceiving people.","note":"「trickster」は単に面白い人ではなく、他人を欺くことに長けている人を指します。"},{"incorrect":"✗ Tricksters are always bad people.","correct":"✓ Tricksters are not always bad people; they can sometimes bring positive change.","note":"トリックスターは必ずしも悪い人ではありません。物語によっては、社会に変化をもたらす役割を果たすこともあります。"}],"priority":"★★☆"},"related_words":{"derivatives":["trick (名詞/動詞: 策略、いたずら、だます)","tricky (形容詞: 巧妙な、扱いにくい、油断のならない)","trickery (名詞: 策略、ごまかし)"],"idioms_phrases":["play a trick on someone (人にいたずらをする)","have a trick up one's sleeve (奥の手を持っている)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"比較的低頻度 (Relatively low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"trickster\" refers to someone who uses tricks and deception to achieve their goals. This word is often used in the context of mythology and folklore to describe characters who are clever, mischievous, and often break social rules. While they may cause trouble, tricksters can also bring about positive change or reveal important truths. Understanding the cultural context in which the word is used is important for interpreting its meaning correctly."},"example_sentences":[{"sentence":"Loki is a well-known trickster in Norse mythology.","translation":"ロキは北欧神話でよく知られたトリックスターである。","type":"noun","meaning_category":"神話の登場人物"},{"sentence":"The politician was accused of being a trickster, making promises he couldn't keep.","translation":"その政治家は、守れない約束ばかりしている詐欺師だと非難された。","type":"noun","meaning_category":"策略家、詐欺師"},{"sentence":"The trickster fooled the villagers into giving him all their food.","translation":"トリックスターは村人たちを騙して、彼らの食料をすべて奪い取った。","type":"noun","meaning_category":"いたずら者"}]}