{"word":"karmouth","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(slang, derogatory) A person who is perceived as being overly critical, negative, or pessimistic.","english_definition":"(slang, derogatory) A person who is perceived as being overly critical, negative, or pessimistic.","examples":[{"sentence":"Don't be such a karmouth, try to look on the bright side!","translation":"そんなに批判的にならないで、良い面を見るようにして！"},{"sentence":"He's such a karmouth, he always finds something to complain about.","translation":"彼はとても批判的で、いつも何か文句を言っている。"}],"collocations":["stop being a karmouth","a real karmouth","such a karmouth"],"synonyms":["complainer","critic","pessimist","cynic","downer"],"antonyms":["optimist","positive person","cheerleader"]}],"etymology":{"value":"Likely a blend of 'karma' (referring to negative energy or fate) and 'mouth' (referring to the act of speaking negatively). The term suggests that the person's negativity will bring bad karma upon themselves or others.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɑːrmaʊθ/","syllables":"kar-mouth"},"inflection":{"noun_plural":"karmouths"},"usage_notes":{"explanation":"'Karmouth' is a slang term, often used informally and humorously, to describe someone who is seen as excessively negative or critical. It implies that the person's negativity is so pervasive that it affects their 'karma' or overall fate. The term is usually derogatory, but can sometimes be used playfully among friends.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He's a very karmouth person.","correct":"✓ He's a real karmouth. / ✓ He's such a karmouth.","note":"'Karmouth' is primarily used as a noun to describe a person, not as an adjective to describe a quality."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (slang, not typically included in CEFR levels)","frequency_google_ngram":"Very low frequency (slang term)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Karmouth' is a slang term, meaning it's not typically found in formal writing or academic contexts. It's used informally to describe someone who is perceived as being overly negative or critical. Because it's slang, its meaning can vary slightly depending on the context and the speaker's intention. Understanding the term requires familiarity with informal language and the concept of 'karma' as it relates to negative energy or fate."},"example_sentences":[{"sentence":"My brother is such a **karmouth**, he always expects the worst.","translation":"私の兄弟はとても批判的で、いつも最悪の事態を予想している。","type":"noun","meaning_category":"critical person"},{"sentence":"Try not to be a **karmouth** and focus on the good things in life.","translation":"批判的にならないで、人生の良いことに焦点を当ててみて。","type":"noun","meaning_category":"negative person"}]}