{"word":"varicellar","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"水痘（水疱瘡）の、水痘に関連する","english_definition":"Relating to or caused by varicella (chickenpox).","examples":[{"sentence":"The varicellar rash is highly contagious.","translation":"水痘の発疹は非常に伝染性が高いです。"},{"sentence":"Varicellar pneumonia is a rare but serious complication of chickenpox.","translation":"水痘肺炎はまれですが、水痘の重篤な合併症です。"}],"collocations":["varicellar rash","varicellar pneumonia","varicellar zoster virus (VZV)"],"synonyms":["chickenpox-related"],"antonyms":[]}],"etymology":{"value":"Derived from 'varicella', the scientific name for chickenpox, with the addition of the adjective-forming suffix '-ar'. 'Varicella' itself is a diminutive of 'variola', meaning smallpox, reflecting the smaller size of the lesions in chickenpox compared to smallpox.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌværɪˈsɛlər/","syllables":"va-ri-cel-lar"},"inflection":{"notes":"Adjective, so it can be used to modify nouns."},"usage_notes":{"explanation":"'Varicellar' is a relatively uncommon adjective used in medical contexts to specifically describe something related to or caused by the varicella-zoster virus (VZV), which causes chickenpox. It is most often encountered in medical literature or discussions about the disease.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The child had a varicella rash.","correct":"✓ The child had a varicellar rash.","note":"'Varicella' is the name of the disease, while 'varicellar' is the adjective describing something related to the disease."}],"priority":"★☆☆"},"related_words":{"derivatives":["varicella (noun): chickenpox","varicella-zoster virus (noun): the virus that causes chickenpox and shingles"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Varicellar' is a technical term exclusively used in medical or scientific contexts. Understanding its meaning requires familiarity with medical terminology and the specific disease it describes, chickenpox (varicella). Due to its specialized usage, it is not typically encountered in general English.","priority":"★★☆"},"example_sentences":[{"sentence":"The patient presented with a classic varicellar exanthem.","translation":"患者は典型的な水痘性発疹を呈した。","type":"adjective","meaning_category":"水痘の・関連する"},{"sentence":"Varicellar vaccines have significantly reduced the incidence of chickenpox.","translation":"水痘ワクチンは水痘の発生率を大幅に減少させた。","type":"adjective","meaning_category":"水痘の・関連する"}]}