{"word":"self-chastised","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"自己を厳しく罰した、自己を深く悔いた","english_definition":"Having severely criticized or punished oneself; feeling deep remorse or regret for one's actions.","examples":[{"sentence":"He was self-chastised for his careless mistake.","translation":"彼は不注意なミスを深く悔いた。"},{"sentence":"The self-chastised student apologized to the teacher.","translation":"自己を厳しく罰した生徒は先生に謝罪した。"},{"sentence":"She felt self-chastised after realizing the impact of her words.","translation":"彼女は自分の言葉の影響に気づいた後、深く悔いた。"}],"collocations":["feel self-chastised","become self-chastised","remain self-chastised"],"synonyms":["remorseful","contrite","penitent","regretful","ashamed","reproachful","self-reproachful"],"antonyms":["unrepentant","unapologetic","shameless","complacent"]}],"etymology":{"value":"The word is formed by combining \"self-\" (referring to oneself) with the past participle of \"chastise\" (to punish or criticize severely). Thus, \"self-chastised\" literally means having punished or criticized oneself.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌselfˈtʃæstaɪzd/","syllables":"self-chas-tized"},"inflection":{"notes":"This is an adjective, so it does not have plural forms. Comparative and superlative forms are possible (more self-chastised, most self-chastised), but less common."},"usage_notes":{"explanation":"\"Self-chastised\" describes a state of intense self-criticism and regret. It implies a strong sense of personal responsibility and a willingness to acknowledge one's own flaws or errors. The term often suggests a more profound and internal form of punishment than simply feeling guilty; it involves active self-reproach.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was self-chastised by his parents.","correct":"✓ He was chastised by his parents. / ✓ He was self-chastised for his actions.","note":"\"Self-chastised\" means that the person is chastising *themselves*. If someone else is doing the chastising, use \"chastised\" alone. If the person is feeling regret because of their own actions, use \"self-chastised for his actions\"."},{"incorrect":"✗ She felt self-chastised, so she punished her child.","correct":"✓ She felt guilty, so she punished her child.","note":"\"Self-chastised\" refers to the feeling of punishing *oneself*. Punishing someone else is not self-chastisement."}],"priority":"★★☆"},"related_words":{"derivatives":["chastise (verb: to punish or criticize severely)","chastisement (noun: the act of punishing or criticizing severely)","self-criticism (noun: the act of criticizing oneself)","self-punishment (noun: the act of punishing oneself)"],"related_concepts":["guilt","remorse","penance","atonement","self-reproach","contrition"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Uncommon, but may appear in advanced literature or psychological contexts)","frequency_google_ngram":"Low frequency - Not a commonly used word in everyday language.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"self-chastised\" is relatively uncommon and formal. It describes someone who is severely criticizing or punishing themselves, often due to feelings of guilt or regret. Understanding this word requires a good vocabulary and the ability to understand complex emotions and self-reflection. It is more likely to be found in literature or formal writing than in everyday conversation."},"example_sentences":[{"sentence":"After the disastrous presentation, he was utterly self-chastised and couldn't face his colleagues.","translation":"悲惨なプレゼンテーションの後、彼は完全に自己を悔いて、同僚に顔向けできなかった。","type":"adjective","meaning_category":"自己を深く悔いた"},{"sentence":"The politician, self-chastised for his ethical lapse, resigned from his position.","translation":"倫理的な過ちを深く悔いた政治家は、辞任した。","type":"adjective","meaning_category":"自己を厳しく罰した"},{"sentence":"She remained self-chastised for years, unable to forgive herself for the mistake.","translation":"彼女は何年も自己を悔い続け、その過ちを許すことができなかった。","type":"adjective","meaning_category":"自己を深く悔いた"}]}