{"word":"Shikse","priority":"低","meanings":[{"part_of_speech":"noun","definition":"(ユダヤ教徒でない)若い女性、少女。しばしば軽蔑的な意味合いを含む。","english_definition":"A non-Jewish young woman or girl. Often used in a derogatory way.","examples":[{"sentence":"Some Orthodox Jews use the term 'shikse' to refer to non-Jewish women.","translation":"一部の正統派ユダヤ教徒は、ユダヤ教徒でない女性を指す言葉として「シクシャ」という言葉を使う。"},{"sentence":"The term 'shikse' can be offensive to non-Jewish women.","translation":"「シクシャ」という言葉は、ユダヤ教徒でない女性にとって侮辱的なものとなりうる。"}],"collocations":[],"synonyms":["gentile woman","non-Jewish girl"],"antonyms":["Jewish girl","Jewish woman"]}],"etymology":{"value":"イディッシュ語の「shiksa」（שיקסע）に由来し、これはヘブライ語の「sheketz」（שֶׁקֶץ）から派生した。「sheketz」は「忌まわしいもの、不浄なもの」を意味する。","priority":"中"},"pronunciation":{"ipa":"/ˈʃɪksə/","syllables":"Shik-se"},"inflection":{"noun_plural":"shikses"},"usage_notes":{"explanation":"「**Shikse**」は、ユダヤ教徒でない若い女性を指す言葉ですが、しばしば軽蔑的な意味合いを伴います。この言葉は、特に正統派ユダヤ教のコミュニティで使用されることがありますが、ユダヤ教徒でない人々にとっては侮辱的であると感じられる可能性があります。使用する際には、その意味合いと相手への影響を十分に考慮する必要があります。","priority":"高"},"common_mistakes":{"examples":[{"incorrect":"Using 'shikse' as a neutral term for a non-Jewish woman.","correct":"Avoid using 'shikse' unless you are certain it will not be offensive. Use 'non-Jewish woman' instead.","note":"「シクシャ」という言葉を中立的な意味合いで使用することは避けるべきです。代わりに「ユダヤ教徒でない女性」という言葉を使用してください。"}],"priority":"中"},"related_words":{"derivatives":[],"phrases":[],"related_terms":["Shiksa appeal (ユダヤ人男性が非ユダヤ人女性に魅力を感じること)","goy (ユダヤ教徒でない男性)","goyim (ユダヤ教徒でない人々)"],"priority":"中"},"level_frequency":{"frequency_google_ngram":"低い","priority":"低"},"readability_explanation":{"level":"C2","text":"The term \"**shikse**\" is a Yiddish word, derived from Hebrew, used to refer to a non-Jewish woman or girl. It is important to understand that this term is often considered derogatory and offensive, particularly by non-Jewish individuals. Its use can perpetuate negative stereotypes and be seen as disrespectful. Therefore, it is generally advisable to avoid using this term unless you are certain it will not cause offense. In most contexts, using the phrase \"non-Jewish woman\" is a more neutral and respectful alternative."},"example_sentences":[{"sentence":"He was warned against marrying a shikse by his orthodox family.","translation":"彼は正統派の家族から、非ユダヤ教徒の女性と結婚しないように警告された。","type":"noun","meaning_category":"derogatory term"},{"sentence":"The novel explores the complex relationship between a Jewish man and a shikse.","translation":"その小説は、ユダヤ人男性と非ユダヤ人女性の複雑な関係を探求している。","type":"noun","meaning_category":"derogatory term"}]}