{"word":"Jahvism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヤハウェ唯一崇拝、ヤハウェ至上主義","english_definition":"The exclusive worship of Yahweh; Yahweh-onlyism.","examples":[{"sentence":"Jahvism became the dominant religion in ancient Israel.","translation":"ヤハウェ唯一崇拝は古代イスラエルにおいて支配的な宗教となった。"}],"collocations":["Early Jahvism","Biblical Jahvism"],"synonyms":["Yahweh-onlyism","Monolatry"],"antonyms":["Polytheism"]},{"part_of_speech":"noun","definition":"ヤハウェ至上主義者（の集団）","english_definition":"Adherence to Yahweh-onlyism; a group adhering to Yahweh-onlyism.","examples":[{"sentence":"The Jahvism movement sought to eliminate the worship of other gods.","translation":"ヤハウェ至上主義運動は他の神々の崇拝を排除しようとした。"}],"collocations":["Jahvism movement"],"synonyms":["Yahweh-onlyist"],"antonyms":[]}],"etymology":{"value":"Derived from 'Yahweh' (a transliteration of the Hebrew name of God) with the suffix '-ism' indicating a belief system or practice.","priority":"★★★"},"pronunciation":{"ipa":"/ˈjɑːvɪzəm/","syllables":"Jah-vi-sm"},"inflection":{"noun_plural":"Jahvisms"},"usage_notes":{"explanation":"'Jahvism' refers to the religious belief system in ancient Israel that emphasized the exclusive worship of Yahweh, often to the exclusion or suppression of other deities. It is closely related to the development of monotheism in Judaism. The term is often used in religious studies and theology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Jahvism is the same as Judaism.","correct":"✓ Jahvism is a precursor to monotheistic Judaism.","note":"Jahvism is a specific phase in the development of Israelite religion, not entirely synonymous with modern Judaism."}],"priority":"★★☆"},"related_words":{"derivatives":["Yahweh","Monotheism","Henotheism"],"related_terms":["Israelite religion","Old Testament","Biblical studies"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in academic and theological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Jahvism' is a term used in religious studies to describe the historical development of the worship of Yahweh in ancient Israel, particularly the transition from polytheism or henotheism to monolatry and eventually monotheism. It is a specialized term, primarily encountered in academic or theological discussions. Understanding requires familiarity with religious history and terminology."},"example_sentences":[{"sentence":"The rise of Jahvism marked a significant shift in Israelite religious practices.","translation":"ヤハウェ至上主義の台頭は、イスラエル人の宗教的慣習における重要な変化を示した。","type":"general"},{"sentence":"Scholars debate the precise origins and characteristics of early Jahvism.","translation":"学者たちは、初期のヤハウェ至上主義の正確な起源と特徴について議論している。","type":"academic"},{"sentence":"Jahvism promoted the idea of a covenant between Yahweh and the people of Israel.","translation":"ヤハウェ至上主義は、ヤハウェとイスラエルの民との間の契約という考えを推進した。","type":"theological"}]}