{"word":"unquadded","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(印刷)クワッド（quad）が挿入されていない、空白が適切に配置されていない","english_definition":"(Printing) Not having quads (blank spaces) inserted; not properly spaced.","examples":[{"sentence":"The text appeared jumbled and unprofessional because it was unquadded.","translation":"テキストは、空白が適切に配置されていなかったため、ごちゃごちゃしてプロフェッショナルに見えませんでした。"},{"sentence":"The compositor was reprimanded for leaving the document unquadded.","translation":"植字工は、ドキュメントを空白が適切に配置されていない状態で放置したとして叱責されました。"}],"collocations":["unquadded text","unquadded document","leave unquadded"],"synonyms":["misaligned","unjustified","improperly spaced"],"antonyms":["quadded","justified","properly spaced"]},{"part_of_speech":"verb","definition":"(印刷)クワッド（quad）を挿入しない、空白を適切に配置しない","english_definition":"(Printing) To fail to insert quads (blank spaces); to fail to space properly.","examples":[{"sentence":"The apprentice unquadded the last line, making it difficult to read.","translation":"見習いは最後の行に空白を適切に配置しなかったため、読みにくくなりました。"},{"sentence":"He accidentally unquadded the paragraph while rushing to meet the deadline.","translation":"彼は締め切りに間に合わせようと急いでいるうちに、誤って段落の空白を適切に配置しませんでした。"}],"collocations":["unquadded a line","unquadded a paragraph","accidentally unquadded"],"synonyms":["misalign","misspace"],"antonyms":["quad","justify","space properly"]}],"etymology":{"value":"Derived from \"quad,\" a printing term for a blank space, with the prefix \"un-\" indicating negation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˈkwɒdɪd/","syllables":"un-quad-ded"},"inflection":{"verb_forms":{"present_simple":["unquad","unquads"],"past_simple":"unquadded","past_participle":"unquadded","present_participle":"unquadding"},"adjective_forms":{}},"usage_notes":{"explanation":"The term \"unquadded\" is specific to the field of printing and typography. It describes text that lacks proper spacing due to the absence of quads, which are blank spaces used to align and justify text. This can result in a jumbled or unprofessional appearance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unquadded code was difficult to debug.","correct":"✓ The unformatted code was difficult to debug.","note":"While \"unquadded\" refers to spacing in printing, the term \"unformatted\" is more appropriate for code."}],"priority":"★☆☆"},"related_words":{"derivatives":["quad","quads","quadding"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Unquadded\" is a technical term primarily used in printing and typography. It refers to text that has not been properly spaced, specifically lacking the insertion of \"quads\" (blank spaces) to achieve alignment or justification. Understanding this term requires familiarity with printing processes and terminology. It is not commonly used in general conversation or writing. The opposite of unquadded is quadded. "},"example_sentences":[{"sentence":"The unquadded lines made the document look amateurish.","translation":"空白が適切に配置されていない行は、ドキュメントを見劣りさせました。","type":"adjective","meaning_category":"Improperly spaced"},{"sentence":"The typesetter accidentally unquadded the final paragraph.","translation":"植字工は誤って最後の段落の空白を適切に配置しませんでした。","type":"verb","meaning_category":"Fail to space properly"}]}