{"word":"Codifiers","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) 成文化する人、体系化する人、法典編纂者","english_definition":"(plural) people who codify something, especially laws or rules","examples":[{"sentence":"The codifiers of the French civil code aimed to create a clear and comprehensive legal system.","translation":"フランス民法の法典編纂者たちは、明確で包括的な法体系を作り上げることを目指した。"},{"sentence":"Modern software development relies on codifiers who can translate complex ideas into functional code.","translation":"現代のソフトウェア開発は、複雑なアイデアを機能的なコードに変換できる体系化する人々に依存している。"}],"collocations":["legal codifiers (法律の法典編纂者)","software codifiers (ソフトウェアの体系化者)","historical codifiers (歴史的な体系化者)"],"synonyms":["systematizers","organizers","compilers","compilers","arrangers"],"antonyms":["disorganizers","chaotics"]}],"etymology":{"value":"The word \"codifiers\" is the plural form of \"codifier.\" \"Codifier\" is derived from the verb \"codify,\" which comes from the Latin word \"codex\" (meaning \"book\" or \"collection of laws\") and the suffix \"-fy\" (meaning \"to make\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkoʊdəˌfaɪərz/","syllables":"co-di-fi-ers"},"inflection":{"noun_plural":"Codifiers"},"usage_notes":{"explanation":"\"Codifiers\" refers to individuals or groups involved in the process of codification. Codification involves systematically collecting, arranging, and writing down laws, rules, or principles into a code or system. This term is often used in legal, historical, and software development contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The codifiers is working on the project.","correct":"✓ The codifiers are working on the project.","note":"\"Codifiers\" is a plural noun, so it requires a plural verb form (are)."},{"incorrect":"✗ The codifiers codified the law, but it was not good.","correct":"✓ The codifiers codified the law, but their codification was not good.","note":"The noun for the result of codifying is \"codification.\""}],"priority":"★★☆"},"related_words":{"derivatives":["codify (verb: to arrange laws or rules into a systematic code)","codification (noun: the process of codifying)","code (noun: a systematic collection of laws or rules)"],"related_terms":["compiler","systematizer","organizer"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"codifiers\" is a relatively advanced term referring to individuals who engage in the process of codifying information, rules, or laws. This typically involves organizing and systematizing complex material into a clear and coherent code or system. The term is most often encountered in legal, historical, or technical contexts."},"example_sentences":[{"sentence":"The legal scholars acted as **codifiers**, organizing centuries of legal precedents into a coherent legal framework.","translation":"その法学者たちは**法典編纂者**として活動し、何世紀にもわたる判例をまとめて一貫性のある法的枠組みを構築した。","type":"noun","meaning_category":"成文化する人"},{"sentence":"The **codifiers** of the programming language aimed to create a standard that would be easy for developers to use.","translation":"そのプログラミング言語の**体系化者**たちは、開発者が使いやすい標準を作成することを目指した。","type":"noun","meaning_category":"体系化する人"},{"sentence":"The historical **codifiers** played a crucial role in preserving and organizing ancient texts.","translation":"歴史的な**体系化者**たちは、古代のテキストを保存し、整理する上で重要な役割を果たした。","type":"noun","meaning_category":"体系化する人"}]}