{"word":"acicular","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"針状の、針状結晶の","english_definition":"needle-shaped; having the form of needles or crystals resembling needles.","examples":[{"sentence":"Acicular crystals of rutile are found in some metamorphic rocks.","translation":"金紅石の針状結晶は、いくつかの変成岩に見られる。"},{"sentence":"The acicular leaves of pine trees are well-adapted to dry climates.","translation":"松の木の針状の葉は、乾燥した気候によく適応している。"}],"collocations":["acicular crystal","acicular structure","acicular ferrite"],"synonyms":["needle-shaped","aciculate","prismatic","columnar"],"antonyms":["massive","granular","equant"]}],"etymology":{"value":"From Latin 'acicula' (small needle) + '-ar' (suffix denoting resemblance or relation).","priority":"★★★"},"pronunciation":{"ipa":"/əˈsɪkjʊlər/","syllables":"a-cic-u-lar"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be used in comparative and superlative forms (more acicular, most acicular)."},"usage_notes":{"explanation":"'Acicular' is primarily used in scientific and technical contexts, particularly in geology (describing mineral crystals) and botany (describing leaf shapes). It is a relatively uncommon word in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The acicular building was very tall.","correct":"The needle-like building was very tall.","note":"'Acicular' is best used to describe natural formations or microscopic structures, not large objects like buildings. 'Needle-like' is a more appropriate term for general usage."}],"priority":"★★☆"},"related_words":{"derivatives":["acicularity (noun): the state of being acicular"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Acicular' is a technical term primarily used in scientific fields like geology and botany. It describes something that is shaped like a needle. Due to its specialized usage, it is not commonly encountered in general English texts and is more likely to appear in academic or professional writing related to these fields. Understanding the word requires familiarity with scientific vocabulary and concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The mineral sample contained numerous acicular crystals of quartz.","translation":"その鉱物標本には、多数の針状の石英結晶が含まれていた。","type":"general","meaning_category":"describing mineral crystals"},{"sentence":"Acicular ice crystals formed on the cold windowpane.","translation":"冷たい窓ガラスに針状の氷の結晶ができた。","type":"general","meaning_category":"describing ice crystals"},{"sentence":"The acicular shape of the leaves reduces water loss in arid environments.","translation":"葉の針状の形状は、乾燥した環境での水分の損失を減らす。","type":"general","meaning_category":"describing leaf shape"}]}