{"word":"Moism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"墨家 (ぼっか): 中国の戦国時代に現れた哲学思想およびその学派。兼愛 (博愛)・非攻 (平和主義)・節用 (質素倹約) などを説いた。","english_definition":"Moism is an ancient Chinese philosophy that advocated universal love, non-aggression, frugality, and meritocracy.","examples":[{"sentence":"Moism was a significant philosophical school during the Warring States period in China.","translation":"墨家は中国の戦国時代において重要な哲学学派であった。"},{"sentence":"The core tenet of Moism is universal love, treating everyone equally.","translation":"墨家の中心的な教義は、すべての人を平等に扱う兼愛である。"}],"collocations":["墨家の教義 (Doctrines of Moism)","兼愛 (Universal love)","非攻 (Non-aggression)","節用 (Frugality)"],"synonyms":["墨学 (Moxue)"],"antonyms":["儒家 (Confucianism)","道家 (Taoism)"]},{"part_of_speech":"noun","definition":"墨家の信奉者、墨者 (ぼくしゃ)","english_definition":"A follower or adherent of Moism; a Mohist.","examples":[{"sentence":"The Mohists were known for their strong organizational skills and willingness to defend their beliefs.","translation":"墨者は、その強い組織力と信念を守る意志で知られていた。"}],"collocations":["墨者集団 (Mohist group)","墨家の指導者 (Mohist leader)"],"synonyms":["墨者 (Mohist)"],"antonyms":[]}],"etymology":{"value":"Derived from the Chinese name '墨子' (Mòzǐ), the founder of Moism, combined with the suffix '-ism' to denote a system of thought or doctrine.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmoʊ.ɪzəm/","syllables":"Mo-ism"},"inflection":{"noun_plural":"No plural form is commonly used."},"usage_notes":{"explanation":"'Moism' refers to both the philosophical school of thought and its followers. It is less commonly discussed than Confucianism or Taoism but played a significant role in ancient Chinese intellectual history. The term is primarily used in academic or historical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Moism is a religion.","correct":"✓ Moism is a philosophy.","note":"Moism is a philosophical school of thought, not a religion, although it has ethical and moral principles."}],"priority":"★☆☆"},"related_words":{"derivatives":["Mohist (noun/adjective): A follower of Moism; relating to Moism.","Mòzǐ (noun): The founder of Moism."],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in academic and historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Moism' is a term relating to a specific philosophical school from ancient China. Understanding requires familiarity with Chinese history and philosophy. The term is infrequent in general conversation and mainly appears in academic or historical discussions."},"example_sentences":[{"sentence":"The principles of Moism emphasized practical benefits for the people.","translation":"墨家の原理は、人々のための実用的な利益を強調した。","type":"noun","meaning_category":"Philosophy"},{"sentence":"Mohists believed in defending the weak and opposing unjust wars.","translation":"墨者は、弱者を守り、不正な戦争に反対することを信じていた。","type":"noun","meaning_category":"Followers"}]}