{"word":"trochart","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(外科) 穿刺針、トロカール","english_definition":"A surgical instrument consisting of a sharp-pointed rod within a tube, used to puncture a body cavity (such as the abdomen or chest) for aspiration of fluid or insertion of medication or instruments.","examples":[{"sentence":"The doctor used a trochart to drain the fluid from the patient's chest.","translation":"医師はトロカールを使って患者の胸から液体を排出した。"},{"sentence":"A veterinary trochart is used to relieve bloat in livestock.","translation":"獣医用トロカールは、家畜の鼓腸を緩和するために使用される。"}],"collocations":["insert a trochart (トロカールを挿入する)","remove a trochart (トロカールを取り出す)","veterinary trochart (獣医用トロカール)","abdominal trochart (腹部トロカール)"],"synonyms":["cannula","drainage catheter"],"antonyms":[]}],"etymology":{"value":"Derived from the French word 'trocart', which itself comes from 'trois-quarts', meaning 'three-quarters'. This refers to the three cutting edges of the original instrument's tip.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtroʊkɑːrt/","syllables":"tro-chart"},"inflection":{"noun_plural":"trocharts"},"usage_notes":{"explanation":"A trochart is a medical instrument used to access enclosed body cavities, primarily for draining fluids or gases. It consists of an obturator (the sharp-pointed rod) and a cannula (the hollow tube). The obturator is used to puncture the tissue, and then it is removed, leaving the cannula in place to allow for drainage or insertion of other instruments. Trocharts are used in various medical fields, including surgery, veterinary medicine, and emergency medicine.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The trochart was used to cut the tissue.","correct":"✓ The trochart was used to puncture the tissue.","note":"A trochart is primarily used for puncturing or creating an access point, not for cutting tissue extensively. Other instruments are used for cutting. "},{"incorrect":"✗ Trochar is the plural form.","correct":"✓ Trocharts is the plural form.","note":"The plural of trochart is trocharts."}],"priority":"★★☆"},"related_words":{"derivatives":["trocharization (名詞: トロカール穿刺)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (Specialized medical vocabulary)","frequency_google_ngram":"Low frequency (専門的な医療用語)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A 'trochart' is a specialized medical term referring to a surgical instrument used to puncture body cavities for drainage or access. It's a word primarily encountered in medical contexts and is not part of everyday vocabulary. Understanding its function requires knowledge of medical procedures.","priority":"★☆☆"},"example_sentences":[{"sentence":"The surgeon made a small incision before inserting the trochart.","translation":"外科医はトロカールを挿入する前に小さな切開を入れた。","type":"noun","meaning_category":"instrument"},{"sentence":"The trochart allowed for the rapid drainage of the pleural effusion.","translation":"トロカールにより、胸水の迅速な排出が可能になった。","type":"noun","meaning_category":"instrument"},{"sentence":"A large-bore trochart was used to decompress the tension pneumothorax.","translation":"太いトロカールを使用して、緊張性気胸を減圧した。","type":"noun","meaning_category":"instrument"}]}