{"word":"nullities","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"無効なもの、無価値なもの、存在しないもの、重要でないもの","english_definition":"things that are of no importance or value; things that are legally void or invalid.","examples":[{"sentence":"The contract was declared one of the nullities by the court.","translation":"その契約は裁判所によって無効と宣言された。"},{"sentence":"He dismissed their concerns as nullities.","translation":"彼は彼らの懸念を無価値なものとして無視した。"},{"sentence":"The law treated women as legal nullities.","translation":"その法律は女性を法的に存在しないものとして扱った。"}],"collocations":["legal nullities (法的な無効)","utter nullities (完全な無価値)"],"synonyms":["invalidities","nothings","worthlessness","insignificance","nonentities"],"antonyms":["validities","importance","significance","entities"]}],"etymology":{"value":"Late Middle English: from Old French nullite, from late Latin nullitas, from Latin nullus 'not any' (from ne 'not' + ullus 'any').","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnʌlətiz/","syllables":"nul-li-ties"},"inflection":{"noun_plural":"nullities"},"usage_notes":{"explanation":"'Nullities' refers to things that have no legal force or are considered to be of no importance. It can also describe things that are nonexistent or without value. Often used in legal or philosophical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nullities of the argument was obvious.","correct":"✓ The nullity of the argument was obvious.","note":"'Nullities' is plural, so it doesn't fit well with 'was'. If referring to the argument as a whole, use the singular 'nullity'."},{"incorrect":"✗ He filled his life with nullities.","correct":"✓ He filled his life with trivialities.","note":"While 'nullities' can mean things of no importance, 'trivialities' is often a more common and natural-sounding word for everyday unimportant things."}],"priority":"★☆☆"},"related_words":{"derivatives":["nullity (singular form)","null (adjective: having no legal force; noun: a thing that is legally void)","annul (verb: to declare invalid)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nullities' is a relatively uncommon word that refers to things that are legally invalid or of no importance. It's often used in formal or legal contexts. The singular form is 'nullity'. Understanding this word requires a good grasp of abstract concepts and formal language."},"example_sentences":[{"sentence":"The court declared the previous ruling one of the nullities.","translation":"裁判所は以前の判決を無効なものの一つと宣言した。","type":"noun","meaning_category":"無効なもの"},{"sentence":"The philosopher argued that many commonly held beliefs are mere nullities.","translation":"その哲学者は、一般的に信じられている多くの信念は単なる無価値なものだと主張した。","type":"noun","meaning_category":"無価値なもの"},{"sentence":"The politician dismissed the concerns of the protesters as nullities.","translation":"その政治家は抗議者たちの懸念を重要でないものとして無視した。","type":"noun","meaning_category":"重要でないもの"}]}