{"word":"margrave","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"辺境伯（へんきょうはく）","english_definition":"A hereditary title of nobility, originally designating the military governor of a march or border territory.","examples":[{"sentence":"The margrave ruled over the eastern march.","translation":"その辺境伯は東部の辺境地帯を統治していた。"},{"sentence":"Margraves were important figures in the Holy Roman Empire.","translation":"辺境伯は神聖ローマ帝国において重要な人物だった。"}],"collocations":["holy roman empire margrave","margrave of brandenburg"],"synonyms":["marquis","markgraf"],"antonyms":[]}],"etymology":{"value":"From Middle High German *markgrāve*, from Old High German *marchgrāvo*, equivalent to *mark* (“march, border territory”) + *grāvo* (“count”).","priority":"★★☆"},"pronunciation":{"ipa":"ˈmɑːrɡreɪv","syllables":"mar-grave"},"inflection":{"noun_plural":"margraves"},"usage_notes":{"explanation":"A margrave was a count who ruled a march, which was a border territory in medieval Europe. The title was especially common in the Holy Roman Empire. The rank of margrave was generally higher than that of a count but lower than that of a duke. The female equivalent is a margravine.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He was a marquis, also known as a margrave in Germany.","correct":"He was a margrave, a title similar to a marquis but used in specific regions like Germany.","note":"While the titles are similar, margrave is specific to certain regions, particularly within the Holy Roman Empire, whereas marquis is more general."}],"priority":"★☆☆"},"related_words":{"derivatives":["margraviate","margravine"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'margrave' refers to a historical title of nobility, specifically a count who ruled a border territory or march. It's a relatively obscure term, primarily encountered in historical contexts related to the Holy Roman Empire and other European realms. Understanding requires familiarity with European feudal systems and titles of nobility.","priority":"★☆☆"},"example_sentences":[{"sentence":"The margrave's duty was to defend the border against invaders.","translation":"辺境伯の義務は侵略者から国境を守ることだった。","type":"noun","meaning_category":"title"},{"sentence":"The margrave held considerable power within his territory.","translation":"その辺境伯は自身の領土内でかなりの権力を持っていた。","type":"noun","meaning_category":"title"}]}