{"word":"groupism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"集団主義、仲間意識","english_definition":"The practice of thinking and behaving based on group affiliation, often leading to in-group favoritism and out-group prejudice.","examples":[{"sentence":"Groupism can lead to discrimination against those who are not part of the dominant group.","translation":"集団主義は、支配的なグループに属さない人々に対する差別につながる可能性があります。"},{"sentence":"The company's culture was characterized by strong groupism, with employees primarily identifying with their departments.","translation":"その会社の文化は強い集団主義によって特徴づけられ、従業員は主に自分の部署に一体感を持っていました。"},{"sentence":"Excessive groupism can stifle creativity and innovation by discouraging dissenting opinions.","translation":"過度な集団主義は、異論を抑制することで創造性と革新性を阻害する可能性があります。"}],"collocations":["in-group favoritism (内集団びいき)","out-group prejudice (外集団への偏見)","social identity (社会的アイデンティティ)","conformity (同調)","tribalism (部族主義)"],"synonyms":["collectivism","tribalism","cliquism","factionalism","in-group bias"],"antonyms":["individualism","universalism","impartiality","objectivity"]},{"part_of_speech":"noun","definition":"（社会学で）集団間の対立や差別を強調する理論またはイデオロギー","english_definition":"(In sociology) a theory or ideology that emphasizes conflict and discrimination between groups.","examples":[{"sentence":"Some sociologists argue that groupism is an inherent part of human social behavior.","translation":"一部の社会学者は、集団主義は人間の社会行動に内在する部分であると主張しています。"},{"sentence":"Critical race theory is sometimes accused of promoting groupism by focusing on racial disparities.","translation":"批判的人種理論は、人種間の格差に焦点を当てることで集団主義を助長していると非難されることがあります。"}],"collocations":["critical race theory (批判的人種理論)","social stratification (社会階層化)","identity politics (アイデンティティ政治)","conflict theory (対立理論)"],"synonyms":["conflict theory","social stratification"],"antonyms":["functionalism","structuralism"]}],"etymology":{"value":"Formed from 'group' + '-ism'.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈɡruːpɪzəm/","syllables":"group-ism"},"inflection":{"notes":"Noun, uncountable."},"usage_notes":{"explanation":"'Groupism' refers to the tendency to prioritize and favor one's own group, often leading to negative consequences such as discrimination or prejudice against other groups. It can also describe a sociological theory that emphasizes intergroup conflict. The term is often used critically, highlighting the potential dangers of excessive loyalty to a particular group.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a lot of groupist.","correct":"✓ He showed a lot of groupism.","note":"'Groupism' is a noun. 'Groupist' is not a commonly used word."}],"priority":"★☆☆"},"related_words":{"derivatives":["groupist (adjective, rarely used)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Groupism' is a more complex term referring to the practice of prioritizing one's own group, often leading to negative consequences like discrimination. It can also describe a sociological theory emphasizing intergroup conflict. It's less common in everyday conversation but appears in discussions about social behavior, politics, and organizational culture."},"example_sentences":[{"sentence":"The rise of nationalism can be seen as a form of groupism.","translation":"国家主義の台頭は、集団主義の一形態と見なすことができます。","type":"noun","meaning_category":"集団主義"},{"sentence":"The company tried to combat groupism by promoting cross-departmental collaboration.","translation":"会社は部門間の協力を促進することで、集団主義に対抗しようとしました。","type":"noun","meaning_category":"集団主義"},{"sentence":"Groupism can be a barrier to creating a truly inclusive society.","translation":"集団主義は、真に包容的な社会を築く上での障壁となる可能性があります。","type":"noun","meaning_category":"集団主義"}]}