{"word":"power-law","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"べき乗則（べきじょうそく）","english_definition":"A functional relationship between two quantities, where a relative change in one quantity results in a proportional relative change in the other quantity, independent of the initial size of those quantities: one quantity varies as a power of another.","examples":[{"sentence":"The distribution of city sizes often follows a power-law.","translation":"都市の規模の分布は、しばしばべき乗則に従う。"},{"sentence":"Zipf's law is an example of a power-law distribution.","translation":"ジップの法則は、べき乗則分布の一例である。"}],"collocations":["power-law distribution (べき乗則分布)","follow a power-law (べき乗則に従う)","power-law exponent (べき指数)"],"synonyms":["scale-free distribution"],"antonyms":[]}],"etymology":{"value":"The term 'power-law' is derived from the mathematical form of the relationship, where one variable is proportional to a power of another variable.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpaʊər lɔː/","syllables":"pow-er-law"},"inflection":{"noun_plural":"power-laws"},"usage_notes":{"explanation":"A power-law describes a relationship where a change in one quantity leads to a proportional change in another, regardless of their initial sizes. This is common in various phenomena, including city sizes, word frequencies, and network structures.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The data shows a linear relationship, not a power-law.","correct":"✓ The data shows a linear relationship, not a power-law relationship.","note":"It is better to clarify it is a power-law relationship."}],"priority":"★★★"},"related_words":{"derivatives":["power law exponent","power law distribution"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, mainly used in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'power-law' refers to a specific mathematical relationship where one quantity varies as a power of another. This concept is often used in scientific and technical fields to describe phenomena where small changes in one variable can lead to large, disproportionate changes in another. Understanding power-laws requires familiarity with mathematical concepts and their applications in various domains."},"example_sentences":[{"sentence":"The frequency of earthquakes often follows a power-law distribution.","translation":"地震の頻度は、しばしばべき乗則分布に従う。","type":"noun","meaning_category":"べき乗則"},{"sentence":"The network's structure exhibits a power-law degree distribution.","translation":"そのネットワークの構造は、べき乗則の次数分布を示す。","type":"noun","meaning_category":"べき乗則"}]}