{"word":"adiabolist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"One who denies the existence of the devil or devils.","english_definition":"A person who denies the existence of the devil.","examples":[{"sentence":"The adiabolist argued that evil is a human construct, not the work of a supernatural being.","translation":"悪魔否定論者は、悪は超自然的な存在の仕業ではなく、人間の作り出した概念だと主張した。"}],"collocations":["a convinced adiabolist","philosophical adiabolist"],"synonyms":["atheist","non-believer","skeptic"],"antonyms":["diabolist","theist"]}],"etymology":{"value":"From 'a-' (denoting absence) + 'diabolist' (one who believes in the devil).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌeɪdaɪˈæbəlɪst/","syllables":"a-di-a-bo-list"},"inflection":{"noun_plural":"adiabolists"},"usage_notes":{"explanation":"'Adiabolist' is a relatively rare term used to describe someone who does not believe in the existence of the devil or devils. It is often used in theological or philosophical discussions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an adiabolist because he is a diabolist.","correct":"✓ He is an adiabolist because he doesn't believe in the devil.","note":"An adiabolist denies the existence of the devil, while a diabolist believes in or worships the devil."}],"priority":"★★☆"},"related_words":{"derivatives":["adiabolism (noun: the denial of the existence of the devil)"],"related_terms":["diabolatry (noun: devil worship)","diabolical (adjective: relating to or characteristic of the devil)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'adiabolist' is highly specialized and rarely used outside of theological or philosophical contexts. Understanding requires familiarity with the concept of diabolism and the prefixes used to negate terms."},"example_sentences":[{"sentence":"As an adiabolist, she dismissed the notion of demonic influence in human affairs.","translation":"悪魔否定論者として、彼女は人間の出来事における悪魔の影響という概念を退けた。","type":"noun","meaning_category":"denial of the devil"},{"sentence":"The philosophical debate centered on whether one could be moral without believing in a devil, a question often posed to adiabolists.","translation":"哲学的な議論は、悪魔の存在を信じなくても道徳的になれるのかどうかに焦点を当てており、それはしばしば悪魔否定論者に投げかけられる質問だ。","type":"noun","meaning_category":"denial of the devil"}]}