{"word":"porcelanous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"磁器のような、陶器のような","english_definition":"resembling porcelain; having a smooth, glossy, and translucent appearance like porcelain.","examples":[{"sentence":"The shell had a porcelanous texture.","translation":"その貝殻は磁器のような質感を持っていた。"},{"sentence":"The paint finish was porcelanous, giving the surface a smooth sheen.","translation":"その塗料の仕上がりは陶器のようで、表面につややかな光沢を与えていた。"}],"collocations":["porcelanous shell","porcelanous surface","porcelanous finish"],"synonyms":["ceramic-like","china-like","glossy","smooth","translucent"],"antonyms":["rough","dull","opaque"]}],"etymology":{"value":"Derived from \"porcelain\" + \"-ous\". \"Porcelain\" comes from Italian \"porcellana\" (cowrie shell), used to describe the fine texture of porcelain resembling the shell.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɔːrsəˈleɪnəs/","syllables":"por-ce-la-nous"},"inflection":{"notes":"Adjective; comparative and superlative forms are \"more porcelanous\" and \"most porcelanous\", respectively."},"usage_notes":{"explanation":"\"Porcelanous\" is primarily used to describe materials or surfaces that have a smooth, glossy, and often translucent appearance, similar to that of porcelain. It is commonly used in the context of describing shells, finishes, or other materials where a porcelain-like quality is desired.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The porcelanous was beautiful.","correct":"✓ The porcelanous surface was beautiful.","note":"\"Porcelanous\" is an adjective and needs to modify a noun. Using it as a noun is incorrect."}],"priority":"★☆☆"},"related_words":{"derivatives":["porcelain (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"porcelanous\" is a technical adjective used to describe something that has a smooth, glossy, and translucent appearance similar to porcelain. It is not commonly used in everyday language and is more likely to be found in descriptive or technical contexts, such as in descriptions of materials or finishes. Understanding the word requires familiarity with the characteristics of porcelain itself."},"example_sentences":[{"sentence":"The fossilized egg had a smooth, porcelanous exterior.","translation":"その化石化した卵は、滑らかな磁器のような外観をしていた。","type":"adjective","meaning_category":"磁器のような"},{"sentence":"The artist used a porcelanous glaze to achieve the desired effect on the ceramic sculpture.","translation":"そのアーティストは、陶器の彫刻に望ましい効果を得るために、磁器のような釉薬を使用した。","type":"adjective","meaning_category":"磁器のような"}]}