{"word":"chromamammalian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Relating to or exhibiting characteristics of both color (chroma) and mammals. This term is highly specific and likely rare, potentially used in scientific or fictional contexts.","english_definition":"Describing something that combines the properties of color and mammals.","examples":[{"sentence":"The chromamammalian artwork depicted fantastical creatures with vibrant, mammalian features.","translation":"その色彩哺乳類のアートワークは、鮮やかな哺乳類の特徴を持つ空想的な生き物を描いていた。"},{"sentence":"In the science fiction novel, the chromamammalian species possessed the ability to camouflage by changing the color of their fur.","translation":"そのSF小説では、色彩哺乳類の種は毛皮の色を変えることでカモフラージュする能力を持っていた。"}],"collocations":["chromamammalian species","chromamammalian artwork","chromamammalian features"],"synonyms":["color-mammal","mammalian-colored"],"antonyms":[]}],"etymology":{"value":"A combination of 'chroma' (from Greek χρῶμα meaning color) and 'mammalian' (relating to mammals).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkroʊməˈmæməlɪən/","syllables":"chro-ma-mam-ma-li-an"},"inflection":{"adjective_forms":{}},"usage_notes":{"explanation":"This word is highly specialized and not commonly used. Its usage is primarily limited to contexts where the combination of color and mammalian characteristics is relevant, such as in describing fictional creatures or in scientific discussions of animal coloration.","priority":"★☆☆"},"common_mistakes":{},"related_words":{"derivatives":["chroma","mammal","chromatic","mammalian"],"related_terms":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency - likely a neologism or highly specialized term.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"This is a very rare and specialized term. Understanding requires knowledge of the root words 'chroma' (color) and 'mammalian' (relating to mammals). Usage is limited to highly specific contexts. "},"example_sentences":[]}