{"word":"unkid","priority":"★☆☆","meanings":[{"part_of_speech":"verb","definition":"(rare, nonstandard) To remove the qualities of a kid (child) from something; to make something less childish or immature.","english_definition":"(rare, nonstandard) To remove the qualities of a kid (child) from something; to make something less childish or immature.","examples":[{"sentence":"The author tried to unkid the story, making it more appealing to adults.","translation":"作者はその物語から子供っぽさを取り除き、大人にも魅力的にしようとした。"},{"sentence":"The company needed to unkid its marketing strategy to attract a more professional clientele.","translation":"会社はよりプロフェッショナルな顧客層を引きつけるために、マーケティング戦略から子供っぽさを取り除く必要があった。"}],"collocations":["unkid a story","unkid a marketing strategy","unkid a design"],"synonyms":["dejuvenilize","mature","grow up"],"antonyms":["kid","childify"]}],"etymology":{"value":"Formed by adding the prefix \"un-\" (meaning \"not\" or \"reverse\") to the word \"kid.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈkɪd/","syllables":"un-kid"},"inflection":{"verb_forms":{"present_simple":["unkid","unkids"],"past_simple":"unkidded","past_participle":"unkidded","present_participle":"unkidding"}},"usage_notes":{"explanation":"\"Unkid\" is a rare and nonstandard verb. It is formed by adding the prefix \"un-\" to the word \"kid,\" suggesting the removal of childish or immature qualities. Its usage is primarily found in informal contexts and may not be widely recognized or accepted in formal writing. It is often used humorously or creatively to describe the process of making something more adult-like or sophisticated.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The parent unkidded their child.","correct":"✓ The parent helped their child mature.","note":"Using \"unkid\" to describe a person is awkward. It's better to use phrases like \"helped them mature\" or \"encouraged them to grow up.\""},{"incorrect":"✗ The design was unkidded.","correct":"✓ The design was made more sophisticated.","note":"Passive voice with \"unkid\" can sound strange. Rephrasing to use more common verbs like \"sophisticated\" or \"matured\" is preferable."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["dejuvenilize","mature","sophisticate"]},"level_frequency":{"CEFR":"N/A (not commonly used)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Unkid\" is a rare and somewhat humorous word. It's not part of standard English vocabulary, so it's unlikely to be encountered in everyday reading or conversation. If you come across it, understand that it means to remove childish qualities from something. Because it's nonstandard, it's best to avoid using it in formal writing."},"example_sentences":[{"sentence":"The director wanted to unkid the play, making it appeal to a wider audience.","translation":"監督は演劇から子供っぽさを取り除き、より幅広い観客にアピールするようにした。","type":"verb","meaning_category":"remove childish qualities"},{"sentence":"They had to unkid the website design to attract serious investors.","translation":"彼らは真剣な投資家を引きつけるために、ウェブサイトのデザインから子供っぽさを取り除く必要があった。","type":"verb","meaning_category":"make less childish"}]}