{"word":"phorometry","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"眼科検査の一種で、フォロプターという器具を用いて、様々なレンズを通して視力を測定し、最適な矯正度数を決定する検査。","english_definition":"The process of measuring refractive error and other vision characteristics using a phoropter to determine the optimal lens correction for a patient.","examples":[{"sentence":"Phorometry is a key step in a comprehensive eye exam.","translation":"フォロメトリーは、包括的な眼科検査における重要なステップです。"},{"sentence":"The doctor used phorometry to determine my eyeglass prescription.","translation":"医師はフォロメトリーを用いて、私の眼鏡の処方箋を決定しました。"}],"collocations":["perform phorometry","undergo phorometry","phorometry test","automated phorometry","subjective phorometry"],"synonyms":["refraction","subjective refraction","vision testing","eye examination"],"antonyms":[]}],"etymology":{"value":"「phorometry」は、「phoropter」（視力測定器）に「-metry」（測定）を組み合わせた造語。 「phoropter」自体は、ギリシャ語の「phoros」（運ぶ、持つ）と「optos」（見える、視覚の）に由来し、様々なレンズを「運ぶ」ことで視力を測定する器具であることを意味する。","priority":"★★☆"},"pronunciation":{"ipa":"/fɔˈrɒmətri/","syllables":"pho-rom-e-try"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Phorometry is a subjective test, meaning that the patient's responses are crucial in determining the best lens correction. The examiner presents different lens options and asks the patient which lens provides the clearest vision. This process helps to refine the prescription and address various visual problems, such as nearsightedness, farsightedness, astigmatism, and presbyopia. Modern phoropters can be manual or automated, but the underlying principle remains the same: to precisely measure the refractive error of the eye.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I had a phorometry done on my eyes.","correct":"✓ I had phorometry done on my eyes.","note":"'a' is not needed before phorometry"},{"incorrect":"✗ Phorometry is a type of eye disease.","correct":"✓ Phorometry is a type of eye exam.","note":"Phorometry is a test, not a disease."}],"priority":"★★☆"},"related_words":{"derivatives":["phoropter","refraction","optometry","ophthalmology"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"低頻度 (Low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Phorometry is a specialized term in the field of optometry, referring to the process of using a phoropter to measure refractive error and determine the optimal lens correction for a patient's vision. It involves subjective feedback from the patient to refine the prescription and address various visual problems. This term is primarily used by eye care professionals.","priority":"★☆☆"},"example_sentences":[{"sentence":"The optometrist used phorometry to assess the patient's vision.","translation":"検眼医はフォロメトリーを用いて患者の視力を評価した。","type":"general","meaning_category":"視力測定"},{"sentence":"Automated phorometry can speed up the refraction process.","translation":"自動フォロメトリーは屈折測定プロセスをスピードアップできる。","type":"technical","meaning_category":"自動化された測定"},{"sentence":"Subjective responses are crucial during phorometry to determine the best lens.","translation":"最適なレンズを決定するためには、フォロメトリー中の主観的な回答が重要である。","type":"technical","meaning_category":"主観的な測定"}]}