{"word":"disparity-widening","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"格差拡大の、不均衡を拡大する","english_definition":"Increasing the difference or inequality between two or more things.","examples":[{"sentence":"The disparity-widening effects of globalization are a major concern.","translation":"グローバル化の格差拡大効果は大きな懸念事項です。"},{"sentence":"Policies aimed at reducing inequality should avoid disparity-widening outcomes.","translation":"不平等を減らすことを目的とした政策は、格差拡大の結果を避けるべきです。"}],"collocations":["disparity-widening effect","disparity-widening policy","disparity-widening trend"],"synonyms":["inequality-increasing","gap-increasing","difference-amplifying"],"antonyms":["disparity-reducing","inequality-decreasing","gap-narrowing"]}],"etymology":{"value":"Derived from the noun 'disparity' (inequality, difference) and the verb 'widen' (to make or become wider). The present participle 'widening' is used adjectivally to describe something that causes disparity to increase.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈspærɪti ˈwaɪdnɪŋ/","syllables":"di-spar-i-ty wide-ning"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"'Disparity-widening' is typically used to describe trends, policies, or effects that increase the gap between different groups, such as income levels, access to resources, or opportunities. It is often used in discussions of economics, social policy, and global development.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The disparity widening is a problem.","correct":"✓ Disparity widening is a problem. / ✓ The disparity-widening trend is a problem.","note":"'Disparity widening' can function as a noun phrase, but it's often better to use 'disparity-widening' as an adjective modifying a noun like 'trend' or 'effect' for clarity."}],"priority":"★★☆"},"related_words":{"derivatives":["disparity","widen","widening","inequality","gap"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. More common in academic or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Disparity-widening' is a complex term used to describe something that makes inequalities between groups larger. It is often used in discussions about economics, social justice, and policy. Because it is a compound adjective, it is important to understand the meaning of both 'disparity' (difference, inequality) and 'widening' (increasing) to fully grasp its meaning. This term is more common in formal or academic writing.","priority":"★★☆"},"example_sentences":[{"sentence":"Technological advancements can have disparity-widening consequences if access to technology is not equitable.","translation":"技術の進歩は、技術へのアクセスが公平でない場合、格差拡大の結果をもたらす可能性があります。","type":"adjective","meaning_category":"格差拡大"},{"sentence":"The government implemented a disparity-widening tax reform that benefited the wealthy.","translation":"政府は富裕層に有利な格差拡大税制改革を実施した。","type":"adjective","meaning_category":"格差拡大"}]}