{"word":"neurodiversity-denying","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"神経多様性を否定する、神経多様性の概念に反対する","english_definition":"Opposing or denying the concept of neurodiversity, which asserts that neurological differences like autism, ADHD, and dyslexia are natural variations rather than deficits.","examples":[{"sentence":"The organization's policies were seen as neurodiversity-denying because they focused solely on correcting perceived impairments.","translation":"その組織の政策は、認識された障害の矯正のみに焦点を当てていたため、神経多様性を否定するものと見なされた。"},{"sentence":"Some parents, influenced by outdated medical models, can be neurodiversity-denying in their approach to their child's autism.","translation":"一部の親は、時代遅れの医療モデルの影響を受けて、子供の自閉症に対するアプローチにおいて神経多様性を否定することがある。"}],"collocations":["neurodiversity-denying approach","neurodiversity-denying attitude","neurodiversity-denying policies","neurodiversity-denying language"],"synonyms":["anti-neurodiversity","neurodiversity-skeptical","deficit-focused","pathology-focused"],"antonyms":["neurodiversity-affirming","neurodiversity-supportive","inclusionary","acceptance-based"],"notes":"This term is often used critically to describe perspectives or actions that are seen as undermining the acceptance and support of neurodivergent individuals."}],"etymology":{"value":"Formed by combining \"neurodiversity\" with \"-denying,\" indicating opposition to or denial of the principles of neurodiversity.","priority":"Medium"},"pronunciation":{"notes":"Pronunciation would follow the standard rules for English compound words, with stress likely on the \"neuro-\" and \"-de-\" syllables."},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"The term 'neurodiversity-denying' is used to describe viewpoints or practices that contradict the neurodiversity paradigm. This paradigm emphasizes the value and acceptance of neurological differences, such as autism, ADHD, dyslexia, and others, as natural human variations rather than diseases or disorders that need to be cured. A neurodiversity-denying perspective often focuses on fixing or normalizing neurodivergent traits, rather than accommodating and celebrating them.","priority":"High"},"related_words":{"related_terms":["neurodiversity","neurodivergent","neurotypical","ableism","medical model of disability","social model of disability"]},"level_frequency":{"notes":"This is a relatively new and specialized term, so frequency in general language is low. It is more common in discussions related to disability rights, education, and psychology."}}