{"word":"subcriminal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"犯罪未満の、犯罪に準ずる、犯罪的傾向のある","english_definition":"relating to behavior or actions that are not strictly criminal but are considered morally questionable or indicative of criminal tendencies.","examples":[{"sentence":"His actions were subcriminal, though not illegal.","translation":"彼の行動は違法ではなかったが、犯罪に準ずるものだった。"},{"sentence":"The company engaged in subcriminal practices to increase profits.","translation":"その会社は利益を上げるために、犯罪的傾向のある行為を行った。"}],"collocations":["subcriminal behavior","subcriminal activities","subcriminal practices"],"synonyms":["morally questionable","unethical","borderline criminal","quasi-criminal"],"antonyms":["legal","ethical","lawful"]},{"part_of_speech":"noun","definition":"犯罪未満の行為者、犯罪的傾向のある人","english_definition":"a person whose behavior or actions are not strictly criminal but are considered morally questionable or indicative of criminal tendencies.","examples":[{"sentence":"The report identified several subcriminals within the organization.","translation":"その報告書は、組織内に複数の犯罪的傾向のある人物を特定した。"}],"collocations":["identify subcriminals","a group of subcriminals"],"synonyms":["potential offender","borderline delinquent"],"antonyms":["law-abiding citizen"]}],"etymology":{"value":"\"sub-\" (under, below) + \"criminal\" (relating to crime). Indicates something less than fully criminal but approaching that state.","priority":"★★☆"},"pronunciation":{"ipa":"/sʌbˈkrɪmɪnl/","syllables":"sub-crim-i-nal"},"inflection":{"noun_plural":"subcriminals"},"usage_notes":{"explanation":"\"Subcriminal\" refers to actions or individuals that are not technically illegal but are close to being so, often involving unethical or morally dubious behavior. It suggests a tendency towards criminal activity without crossing the legal threshold.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a subcriminal lawyer.","correct":"✓ He was a lawyer engaged in subcriminal activities.","note":"\"Subcriminal\" should describe the actions or tendencies, not directly modify a profession. Instead, describe the person's actions as subcriminal."}],"priority":"★★☆"},"related_words":{"derivatives":["subcrime (noun): actions or behaviors that are less than fully criminal but still problematic."],"related_terms":["criminal","delinquent","unethical","illegal"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"subcriminal\" is a relatively rare and complex term used to describe behavior or individuals that are on the verge of being criminal but do not technically break the law. It often implies unethical or morally questionable actions that suggest a propensity for criminal behavior. Understanding this word requires a nuanced grasp of legal and ethical boundaries."},"example_sentences":[{"sentence":"The politician's shady dealings were considered subcriminal by many.","translation":"その政治家の怪しい取引は、多くの人によって犯罪に準ずるものと見なされた。","type":"adjective","meaning_category":"犯罪未満の"},{"sentence":"The investigation focused on identifying subcriminals within the company who were involved in fraudulent activities.","translation":"捜査は、不正行為に関与していた社内の犯罪的傾向のある人物を特定することに焦点を当てた。","type":"noun","meaning_category":"犯罪未満の行為者"}]}