{"word":"ecclesiolatry","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"教会崇拝、教会至上主義","english_definition":"excessive devotion or reverence for a church or ecclesiastical system.","examples":[{"sentence":"His ecclesiolatry led him to defend the church's actions without question.","translation":"彼の教会崇拝は、教会側の行動を無条件に擁護させた。"},{"sentence":"Some critics accuse the organization of ecclesiolatry, prioritizing institutional loyalty over ethical concerns.","translation":"一部の批評家は、その組織を教会至上主義だと非難しており、倫理的な懸念よりも組織への忠誠を優先している。"}],"collocations":["excessive ecclesiolatry","blind ecclesiolatry","institutional ecclesiolatry"],"synonyms":["churcholatry","institutionalism","sectarianism"],"antonyms":["anti-clericalism","secularism","religious skepticism"]}],"etymology":{"value":"Derived from the Greek words 'ekklesia' (church) and 'latreia' (worship).","priority":"★★★"},"pronunciation":{"ipa":"/ɪˌkliːziˈɒlətri/","syllables":"ec-cle-si-o-la-try"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Ecclesiolatry' refers to an excessive or idolatrous devotion to the church as an institution, often to the point where institutional loyalty and preservation are valued above ethical considerations or genuine spiritual concerns. It is often used in a critical or negative context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practiced ecclesiolatry by attending church every day.","correct":"✓ He demonstrated religious devotion by attending church every day.","note":"Attending church regularly is religious devotion, not necessarily ecclesiolatry, which implies excessive or misplaced reverence for the institution itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["ecclesiolater (noun: one who practices ecclesiolatry)","ecclesiolatrous (adjective: characterized by ecclesiolatry)"],"related_terms":["ecclesiology (the study of the church)","idolatry (the worship of idols)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Ecclesiolatry' is a relatively rare and specialized term. It is used to describe an excessive or misplaced reverence for the church as an institution. It is often used in theological or sociological discussions. Understanding requires familiarity with the concept of idolatry and a critical perspective on institutional religion."},"example_sentences":[{"sentence":"The author criticized the tendency towards ecclesiolatry within the established religious order.","translation":"著者（作家）は、既存の宗教秩序における教会崇拝の傾向を批判した。","type":"general","meaning_category":"general"},{"sentence":"Some argue that prioritizing church finances over community needs is a form of ecclesiolatry.","translation":"教会財政を地域社会のニーズよりも優先することは、教会崇拝の一形態であると主張する人もいる。","type":"example","meaning_category":"example"}]}