{"word":"Synarchy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"協治主義、協同統治","english_definition":"Government by a committee or council; co-sovereignty.","examples":[{"sentence":"The political system was based on the principles of Synarchy.","translation":"その政治システムは協治主義の原則に基づいていました。"},{"sentence":"Some theorists believe that Synarchy is the ideal form of government.","translation":"一部の理論家は、協治主義が理想的な政府の形態であると信じています。"}],"collocations":["establish a synarchy","promote synarchy","principles of synarchy"],"synonyms":["co-rule","joint rule","coalition government"],"antonyms":["autocracy","monarchy","dictatorship"]},{"part_of_speech":"noun","definition":"(歴史的な文脈で) 複数のエリート集団による支配体制","english_definition":"(In a historical context) A form of political rule by a secret society or elite group.","examples":[{"sentence":"Some historians claim that the French Revolution was influenced by Synarchy.","translation":"一部の歴史家は、フランス革命が協治主義の影響を受けたと主張しています。"},{"sentence":"The concept of Synarchy has been linked to various conspiracy theories.","translation":"協治主義の概念は、さまざまな陰謀論と関連付けられています。"}],"collocations":["secret synarchy","historical synarchy","influence of synarchy"],"synonyms":["elite rule","oligarchy","plutocracy"],"antonyms":["democracy","republic"]}],"etymology":{"value":"Derived from the Greek words 'syn' (together) and 'arche' (rule).","priority":"★★☆"},"pronunciation":{"ipa":"ˈsɪnɑːrki","syllables":"Syn-ar-chy"},"inflection":{"noun_plural":"Synarchies"},"usage_notes":{"explanation":"Synarchy refers to a form of government where power is shared among multiple individuals or groups. It can also refer to a more specific historical or theoretical concept involving secret societies or elite groups. The term is relatively uncommon in everyday language and is more often encountered in political science, history, or discussions of conspiracy theories.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The country was in a state of synarchy, with one person ruling.","correct":"✓ The country was in a state of autocracy, with one person ruling.","note":"Synarchy involves multiple rulers or groups, not a single person. Autocracy is the correct term for single-person rule."}],"priority":"★☆☆"},"related_words":{"derivatives":["synarchic (adjective)","synarchist (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Synarchy' is a relatively uncommon term primarily used in political science and historical contexts. It refers to a system of government where power is shared among multiple individuals or groups, often in a collaborative or co-sovereign manner. Understanding this term requires familiarity with political theory and historical concepts related to governance and power structures."},"example_sentences":[{"sentence":"The proposed government structure aimed to establish a synarchy among different ethnic groups.","translation":"提案された政府構造は、異なる民族グループ間の協治主義を確立することを目的としていました。","type":"noun","meaning_category":"協同統治"},{"sentence":"Some scholars argue that the Roman Empire, in its later stages, exhibited characteristics of a synarchy.","translation":"一部の学者は、ローマ帝国が末期において協治主義の特徴を示していたと主張しています。","type":"noun","meaning_category":"協同統治"},{"sentence":"The synarchic council was formed to represent the interests of various factions within the organization.","translation":"組織内のさまざまな派閥の利益を代表するために、協治主義評議会が設立されました。","type":"noun","meaning_category":"協同統治"}]}