{"word":"Taeniasis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"有鉤条虫症（Taenia solium）または無鉤条虫症（Taenia saginata）による寄生虫感染症","english_definition":"A parasitic infection caused by the tapeworm species Taenia solium (pork tapeworm) or Taenia saginata (beef tapeworm).","examples":[{"sentence":"Taeniasis is typically contracted by eating undercooked pork or beef containing tapeworm cysts.","translation":"有鉤条虫症は通常、条虫嚢胞を含む加熱不十分な豚肉または牛肉を食べることによって感染します。"},{"sentence":"Symptoms of taeniasis can include abdominal pain, nausea, and weight loss.","translation":"有鉤条虫症の症状には、腹痛、吐き気、および体重減少が含まれる場合があります。"},{"sentence":"Diagnosis of taeniasis is usually made by examining stool samples for tapeworm eggs or segments.","translation":"有鉤条虫症の診断は通常、便サンプルを調べて条虫の卵または片節を確認することによって行われます。"}],"collocations":["contract taeniasis","diagnose taeniasis","treat taeniasis","pork taeniasis","beef taeniasis"],"synonyms":["tapeworm infection","cysticercosis (for T. solium)"],"antonyms":[]}],"etymology":{"value":"The term \"taeniasis\" comes from the genus name \"Taenia,\" which is derived from the Greek word ταινία (tainia) meaning \"ribbon\" or \"tape,\" referring to the tapeworm's flat, ribbon-like shape. The suffix \"-iasis\" indicates a disease or condition.","priority":"★★☆"},"pronunciation":{"ipa":"/tiːˈnaɪəsɪs/","syllables":"tee-NI-a-sis"},"inflection":{"noun_plural":"taeniases"},"usage_notes":{"explanation":"Taeniasis refers specifically to the intestinal infection caused by adult tapeworms of the Taenia species. It's important to distinguish taeniasis from cysticercosis, which is caused by the larval cysts of Taenia solium and can affect various tissues, including the brain.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Taeniasis is caused by bacteria.","correct":"✓ Taeniasis is caused by a tapeworm.","note":"Taeniasis is a parasitic infection, not a bacterial one."},{"incorrect":"✗ You can get taeniasis from drinking contaminated water.","correct":"✓ You can get taeniasis from eating undercooked meat.","note":"Taeniasis is primarily transmitted through the consumption of undercooked meat containing tapeworm cysts."}],"priority":"★★☆"},"related_words":{"derivatives":["Taenia (genus name)","Taeniidae (family name)","cysticercosis (related disease caused by T. solium larvae)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Taeniasis' is a technical term referring to a specific parasitic infection caused by tapeworms of the Taenia genus. Understanding this term requires knowledge of parasitic diseases and medical terminology. It is typically encountered in medical or veterinary contexts. The distinction between taeniasis and cysticercosis (caused by the larval stage of one species) is important for accurate diagnosis and treatment."},"example_sentences":[{"sentence":"Proper cooking of meat is essential to prevent **taeniasis**.","translation":"有鉤条虫症を予防するには、肉を適切に調理することが不可欠です。","type":"general","meaning_category":"prevention"},{"sentence":"The doctor suspected **taeniasis** after the patient reported abdominal discomfort and weight loss.","translation":"医師は、患者が腹部の不快感と体重減少を訴えた後、有鉤条虫症を疑った。","type":"diagnosis","meaning_category":"symptoms"},{"sentence":"Treatment for **taeniasis** typically involves antiparasitic medications.","translation":"有鉤条虫症の治療には通常、駆虫薬が用いられる。","type":"treatment","meaning_category":"treatment"}]}