{"word":"Lirella","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A long, narrow apothecium (fruiting body) found in some lichens, resembling a small line or scratch.","english_definition":"A long, narrow apothecium found in some lichens, resembling a small line or scratch.","examples":[{"sentence":"The lirellae on this script lichen are very prominent.","translation":"この文字ゴケの線状子器は非常に目立つ。"}],"collocations":["script lichen","apothecium","fruiting body"],"synonyms":["apothecium (in some contexts)"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word 'lira,' meaning 'lyre,' referring to the shape of the apothecium resembling the strings of a lyre.","priority":"★★☆"},"pronunciation":{"ipa":"/laɪˈrɛlə/","syllables":"Li-rel-la"},"inflection":{"noun_plural":"lirellae"},"usage_notes":{"explanation":"'Lirella' is a botanical term specifically used in the context of lichenology. It refers to a type of apothecium, which is a cup-shaped or disc-shaped structure that produces spores in lichens. The lirellae are elongated and narrow, often appearing as lines or scratches on the surface of the lichen thallus.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lirella was growing on the tree bark.","correct":"✓ The lichen with lirellae was growing on the tree bark.","note":"'Lirella' refers to the apothecium, not the entire lichen. It's more accurate to say 'lichen with lirellae' or 'lirellate lichen'."}],"priority":"★★☆"},"related_words":{"derivatives":["lirellate (adjective: possessing lirellae)"],"related_terms":["lichen","apothecium","thallus","ascospore"]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency - specialized botanical term.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Lirella' is a highly specialized term used in the field of lichenology to describe a specific type of apothecium found in certain lichens. Due to its niche usage, it is unlikely to be encountered outside of scientific literature or botanical studies focused on lichens. Understanding this term requires familiarity with lichen morphology and reproductive structures."},"example_sentences":[{"sentence":"The diagnostic feature of this lichen species is its prominent lirellae.","translation":"この地衣類の診断上の特徴は、その顕著な線状子器である。","type":"noun","meaning_category":"lichen morphology"},{"sentence":"Microscopic examination revealed the presence of ascospores within the lirellae.","translation":"顕微鏡検査により、線状子器内に子嚢胞子の存在が明らかになった。","type":"noun","meaning_category":"lichen reproduction"}]}