{"word":"inclusiveness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"包括性、包容力、受容性、全てを受け入れること","english_definition":"the quality of including all people or groups; the practice or policy of providing equal access to opportunities and resources for people who might otherwise be excluded or marginalized, such as those having physical or mental disabilities or belonging to other minority groups.","examples":[{"sentence":"The company is committed to inclusiveness and diversity in the workplace.","translation":"その会社は職場における包括性と多様性に力を入れています。"},{"sentence":"The school promotes a culture of inclusiveness where every student feels valued.","translation":"その学校はすべての生徒が尊重されていると感じられるような包括的な文化を推進しています。"},{"sentence":"Inclusiveness is essential for creating a fair and just society.","translation":"包括性は公正で公平な社会を築くために不可欠です。"},{"sentence":"The policy aims to promote inclusiveness and combat discrimination.","translation":"その政策は包括性を促進し、差別と闘うことを目的としています。"}],"collocations":["promote inclusiveness (包括性を促進する)","foster inclusiveness (包括性を育む)","demonstrate inclusiveness (包括性を示す)","lack of inclusiveness (包括性の欠如)","inclusiveness and diversity (包括性と多様性)","culture of inclusiveness (包括性の文化)"],"synonyms":["comprehensiveness","integration","acceptance","openness","tolerance","diversity","equality","equity"],"antonyms":["exclusiveness","exclusion","discrimination","segregation","isolation","narrowness"]}],"etymology":{"value":"The word 'inclusiveness' is derived from 'inclusive,' which comes from the Latin word 'includere,' meaning 'to shut in, enclose.' Over time, the meaning evolved to encompass the idea of including or containing something. The suffix '-ness' is added to form the noun, indicating the state or quality of being inclusive.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈkluːsɪvnəs/","syllables":"in-clu-sive-ness"},"inflection":{"noun_plural":"inclusivenesses (rarely used, as it is generally an abstract concept)"},"usage_notes":{"explanation":"'Inclusiveness' refers to the practice of including and accepting all individuals, regardless of their background, identity, or circumstances. It emphasizes creating environments where everyone feels valued, respected, and has equal access to opportunities. It is often used in discussions related to social justice, diversity and equity, and organizational culture. It is a broader concept than simply 'tolerance' as it actively seeks to integrate and empower marginalized groups.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The inclusiveness of the group was very include.","correct":"✓ The inclusiveness of the group was very high.","note":"'Include' is a verb, while 'inclusiveness' is a noun. Avoid using the verb form where the noun is required."},{"incorrect":"✗ The inclusiveness is when you let everyone in.","correct":"✓ Inclusiveness is the practice of letting everyone in.","note":"'Inclusiveness' is a concept or quality, not a specific action. Use a definition or explanation to clarify its meaning."},{"incorrect":"✗ They have a very inclusive.","correct":"✓ They have a very inclusive policy. / ✓ They have a very high level of inclusiveness.","note":"'Inclusive' is an adjective, so it needs to modify a noun. 'Inclusiveness' is the noun form."}],"priority":"★★☆"},"related_words":{"derivatives":["inclusive (adjective)","inclusively (adverb)","include (verb)","inclusion (noun)"],"antonyms":["exclusivity","exclusionary","discriminatory"],"synonyms":["comprehensiveness","integration","acceptance","openness","tolerance","diversity","equality","equity"],"priority":"★★★"},"level_frequency":{"CEFR":"B2-C1 (often used in academic and professional contexts)","frequency_google_ngram":"Moderately frequent (increasing in usage in recent years)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Inclusiveness' is a noun that describes the quality of including all people or groups. It's often used in discussions about creating fair and equitable environments in workplaces, schools, and communities. It means making sure that everyone feels welcome, valued, and has equal opportunities, regardless of their background or identity. It's a key concept in promoting social justice and diversity.","priority":"★★☆"},"example_sentences":[{"sentence":"The company's commitment to **inclusiveness** is evident in its hiring practices.","translation":"その会社の包括性への取り組みは、採用慣行に明らかである。","type":"noun","meaning_category":"包括性"},{"sentence":"The organization strives to promote **inclusiveness** in all its activities.","translation":"その組織は、すべての活動において包括性を促進するよう努めている。","type":"noun","meaning_category":"包括性"},{"sentence":"A lack of **inclusiveness** can lead to feelings of isolation and alienation.","translation":"包括性の欠如は、孤立感や疎外感につながる可能性がある。","type":"noun","meaning_category":"包括性"},{"sentence":"The project aims to increase **inclusiveness** for people with disabilities.","translation":"そのプロジェクトは、障害を持つ人々の包括性を高めることを目的としている。","type":"noun","meaning_category":"包括性"},{"sentence":"**Inclusiveness** is a core value of the community.","translation":"包括性はコミュニティの中核的な価値観である。","type":"noun","meaning_category":"包括性"}]}