{"word":"recureless","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"治療不能の、救いようのない","english_definition":"Incurable; beyond remedy or cure.","examples":[{"sentence":"The disease was recureless, and the patient's condition deteriorated rapidly.","translation":"その病気は治療不能であり、患者の状態は急速に悪化した。"},{"sentence":"His grief was recureless, a deep wound that time could not heal.","translation":"彼の悲しみは救いようがなく、時が癒すことのできない深い傷だった。"}],"collocations":["recureless disease","recureless wound","recureless sorrow"],"synonyms":["incurable","irremediable","hopeless","terminal","fatal"],"antonyms":["curable","remediable","treatable","hopeful"]}],"etymology":{"value":"\"Recureless\" is formed by adding the suffix \"-less\" (meaning \"without\") to the word \"recure.\" \"Recure\" is an obsolete verb meaning \"to cure again\" or \"to restore to health.\" Thus, \"recureless\" literally means \"without the possibility of being cured again\" or \"beyond restoration to health.\"","priority":"★★★"},"pronunciation":{"ipa":"/rɪˈkjʊrləs/","syllables":"re-cure-less"},"inflection":{"notes":"Since \"recureless\" is an adjective, its inflection is limited. It does not have plural forms. Comparative and superlative forms (more recureless, most recureless) are possible but rare."},"usage_notes":{"explanation":"\"Recureless\" is a relatively rare and somewhat archaic word, primarily used in formal or literary contexts. It emphasizes the absolute lack of any possibility of cure or remedy. While synonyms like \"incurable\" are more common, \"recureless\" adds a sense of finality and hopelessness.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor said the injury was recureless, but he recovered.","correct":"✓ The doctor said the injury was severe, but he recovered.","note":"Using \"recureless\" implies a complete absence of any possibility of recovery. If the patient recovers, it's inappropriate to describe the condition as \"recureless.\""},{"incorrect":"✗ She felt recureless after failing the exam.","correct":"✓ She felt hopeless after failing the exam.","note":"\"Recureless\" is typically used for physical or medical conditions, not emotional states. \"Hopeless\" is a better choice for describing feelings of despair."}],"priority":"★★☆"},"related_words":{"derivatives":["recure (obsolete verb: to cure again)"],"related_concepts":["terminal illness","incurable disease","palliative care","hospice"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"recureless\" is a rare and formal term meaning \"incurable\" or \"beyond remedy.\" It is not commonly used in everyday language and is more likely to be encountered in older literature or specialized medical contexts. Understanding its meaning requires a strong vocabulary and familiarity with less common word formations."},"example_sentences":[{"sentence":"The ancient text described a plague so virulent that its victims were deemed recureless.","translation":"その古代の文書には、非常に悪性で、犠牲者が治療不能とみなされる疫病について記述されていた。","type":"adjective","meaning_category":"Incurable disease"},{"sentence":"Despite the doctor's best efforts, the patient's condition remained recureless.","translation":"医師の最善の努力にもかかわらず、患者の状態は治療不能のままだった。","type":"adjective","meaning_category":"Beyond remedy"},{"sentence":"The wound, festering for weeks, had become a recureless source of pain.","translation":"数週間化膿した傷は、治療不能な痛みの源となっていた。","type":"adjective","meaning_category":"Incurable wound"}]}