{"word":"Polemoscope","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A device for producing an image on a screen from a distance.","english_definition":"An optical instrument that creates a distant image on a screen, allowing the viewer to see events or scenes from afar.","examples":[{"sentence":"The polemoscope was used to observe the battlefield from a safe distance.","translation":"そのポレモスコープは、安全な距離から戦場を観察するために使用されました。"},{"sentence":"Early versions of the polemoscope were cumbersome and difficult to transport.","translation":"初期のポレモスコープは、かさばり、輸送が困難でした。"}],"collocations":["use a polemoscope","observe with a polemoscope","develop a polemoscope","invent a polemoscope"],"synonyms":["telescope","periscope","camera obscura"],"antonyms":[]}],"etymology":{"value":"The word \"polemoscope\" comes from the Greek words \"polemos\" (πόλεμος), meaning \"war,\" and \"skopeō\" (σκοπέω), meaning \"to view\" or \"to watch.\" Thus, a polemoscope is literally a \"war-viewer.\"","priority":"★★☆"},"pronunciation":{"ipa":"/pəˈlɛməˌskoʊp/","syllables":"po-le-mo-scope"},"inflection":{"noun_plural":"polemoscopes"},"usage_notes":{"explanation":"A polemoscope is primarily a historical term, referring to early optical devices used for viewing distant scenes, particularly in military contexts. It is not a commonly used word in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used the polemoscope to take a picture.","correct":"✓ He used the polemoscope to observe the scene.","note":"A polemoscope is for viewing, not taking pictures."},{"incorrect":"✗ The polemoscope is a modern invention.","correct":"✓ The polemoscope is an early invention.","note":"The polemoscope is an older device, not a modern one."}],"priority":"★☆☆"},"related_words":{"derivatives":["polemoscopic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - a historical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"polemoscope\" is highly specialized and rarely encountered outside of historical or technical contexts related to optics and military history. Understanding requires familiarity with Greek root words and historical scientific instruments."},"example_sentences":[{"sentence":"The inventor demonstrated the polemoscope's ability to project images onto a screen.","translation":"発明者は、ポレモスコープが画像をスクリーンに投影する能力を実証しました。","type":"noun","meaning_category":"optical instrument"},{"sentence":"Using the polemoscope, the general could survey the enemy's positions without exposing himself to danger.","translation":"将軍はポレモスコープを使用して、危険に身をさらすことなく敵の位置を調査できました。","type":"noun","meaning_category":"military viewing device"}]}