{"word":"semishrub","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"半低木、亜低木","english_definition":"a plant with a woody base whose upper parts die back during the winter","examples":[{"sentence":"Lavender is a well-known semishrub.","translation":"ラベンダーはよく知られた半低木です。"},{"sentence":"Many semishrubs are drought-resistant.","translation":"多くの半低木は耐乾性があります。"}],"collocations":["woody semishrub","herbaceous semishrub"],"synonyms":["suffrutescent plant"],"antonyms":["tree","shrub","herb"]}],"etymology":{"value":"\"semi-\" (半分) + \"shrub\" (低木)","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsemiʃrʌb/","syllables":"sem-i-shrub"},"inflection":{"noun_plural":"semishrubs"},"usage_notes":{"explanation":"Semishrubs are plants that have a woody base that persists through the winter, but their upper parts die back each year, similar to herbaceous plants. This characteristic distinguishes them from true shrubs, which have fully woody stems that remain above ground year-round.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ A semishrub is a type of tree.","correct":"✓ A semishrub is a type of plant that is smaller than a tree and has some woody stems.","note":"Semishrubs are not trees; they are smaller plants with partially woody stems."},{"incorrect":"✗ Semishrubs are completely herbaceous.","correct":"✓ Semishrubs have a woody base but herbaceous upper parts.","note":"Semishrubs are not completely herbaceous; they have a woody base."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"semishrub\" is a botanical term used to describe a specific type of plant that is not commonly encountered in everyday language. Understanding the term requires some knowledge of plant morphology and classification. Semishrubs are plants that have a woody base but herbaceous upper parts that die back in winter, which is a concept that may not be familiar to non-botanists."},"example_sentences":[{"sentence":"The garden was filled with various semishrubs, adding texture and interest to the landscape.","translation":"庭は様々な半低木で満たされ、景観に質感と面白さを加えていました。","type":"general","meaning_category":"description"},{"sentence":"Many alpine plants are semishrubs, adapted to harsh conditions.","translation":"多くの高山植物は半低木であり、厳しい環境に適応しています。","type":"ecological","meaning_category":"habitat"}]}