{"word":"slave-making","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"奴隷を作る、奴隷化する","english_definition":"Engaged in or relating to the practice of capturing and enslaving other individuals or groups.","examples":[{"sentence":"Slave-making ants raid other ant colonies to steal their larvae.","translation":"奴隷を作るアリは、他のアリのコロニーを襲撃して幼虫を盗みます。"},{"sentence":"The slave-making behavior of these insects is a fascinating example of social parasitism.","translation":"これらの昆虫の奴隷を作る行動は、社会寄生の一例として興味深いものです。"}],"collocations":["slave-making ants","slave-making behavior","slave-making raids"],"synonyms":["enslaving","subjugating","oppressive"],"antonyms":["liberating","freeing","emancipating"]},{"part_of_speech":"noun","definition":"奴隷作り、奴隷化","english_definition":"The act or practice of capturing and enslaving other individuals or groups.","examples":[{"sentence":"Slave-making was a common practice in ancient societies.","translation":"奴隷作りは古代社会では一般的な慣習でした。"},{"sentence":"The abolition of slave-making was a major victory for human rights.","translation":"奴隷作りの廃止は、人権にとって大きな勝利でした。"}],"collocations":["practice of slave-making","abolition of slave-making"],"synonyms":["enslavement","subjugation","oppression"],"antonyms":["liberation","freedom","emancipation"]}],"etymology":{"value":"The term 'slave-making' is derived from the combination of 'slave' (a person held in servitude) and 'making' (the act of creating or causing something to be). It describes the process or activity of turning individuals into slaves.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsleɪvˌmeɪkɪŋ/","syllables":"slave-mak-ing"},"inflection":{"notes":"The word 'slave-making' can function as both an adjective and a noun, so its inflection depends on its usage in a sentence. As an adjective, it does not inflect. As a noun, it is generally used in the singular form."},"usage_notes":{"explanation":"The term 'slave-making' is often used in the context of social insects, particularly ants, that exhibit this behavior. It can also refer to historical or contemporary practices of human enslavement. It is important to use the term with sensitivity, especially when discussing human enslavement.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The ants are slave-making each other.","correct":"✓ The ants are slave-making.","note":"'Slave-making' is an adjective describing the ants' behavior, not a reflexive action."},{"incorrect":"✗ Slavemaking is good.","correct":"✓ Slave-making is unethical.","note":"When discussing human enslavement, it's crucial to emphasize its immorality and unethical nature."}],"priority":"★★☆"},"related_words":{"derivatives":["slave (noun)","slavery (noun)","enslavement (noun)","enslave (verb)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'slave-making' is a complex concept that requires an understanding of both slavery and the processes involved in creating or perpetuating it. It is often used in specialized contexts, such as entomology (the study of insects) or historical discussions of human enslavement. The term carries significant ethical and moral weight, particularly when applied to human societies."},"example_sentences":[{"sentence":"The slave-making ants captured larvae from a neighboring colony.","translation":"奴隷を作るアリは、隣接するコロニーから幼虫を捕獲しました。","type":"adjective","meaning_category":"奴隷を作る"},{"sentence":"Slave-making is a brutal practice that has caused immense suffering throughout history.","translation":"奴隷作りは、歴史を通じて多大な苦しみをもたらした残忍な慣習です。","type":"noun","meaning_category":"奴隷作り"}]}