{"word":"extrovertly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"外向的に、社交的に、積極的に","english_definition":"in an extroverted manner; in a way that is outgoing, sociable, and confident.","examples":[{"sentence":"She behaved extrovertly at the party, making friends easily.","translation":"彼女はパーティーで外向的に振る舞い、すぐに友達を作った。"},{"sentence":"He expressed his opinions extrovertly, not afraid to speak his mind.","translation":"彼は自分の意見を外向的に表現し、自分の考えを言うことを恐れなかった。"},{"sentence":"The new employee extrovertly introduced himself to the team.","translation":"新しい従業員はチームに積極的に自己紹介をした。"}],"collocations":["behave extrovertly","express oneself extrovertly","act extrovertly","communicate extrovertly","interact extrovertly"],"synonyms":["outgoingly","sociably","gregariously","affably","amiably","assertively","confidently"],"antonyms":["introvertly","shyly","reservedly","timidly","hesitantly"]}],"etymology":{"value":"Derived from 'extrovert' (noun or adjective) + '-ly' (suffix forming adverbs). 'Extrovert' itself comes from Latin 'extra' (outside) and 'vertere' (to turn), reflecting the idea of being outwardly focused.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈekstrəvɜːrtli/","syllables":"ex-tro-vert-ly"},"inflection":{"notes":"As an adverb, 'extrovertly' does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Extrovertly' describes actions or behaviors that are characteristic of an extrovert, someone who gains energy from being around other people and is typically outgoing and sociable. It emphasizes the manner in which something is done, highlighting the outgoing and confident nature of the action.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is extrovertly.","correct":"✓ She is extroverted.","note":"'Extrovertly' is an adverb and modifies verbs, adjectives, or other adverbs. 'Extroverted' is an adjective and describes nouns. The sentence requires an adjective to describe 'she'."},{"incorrect":"✗ He acted in a extrovertly way.","correct":"✓ He acted in an extroverted way. / ✓ He acted extrovertly.","note":"'Extrovertly' is already an adverb, so it doesn't need 'in a ... way'. If you want to use 'way', you need the adjective 'extroverted'."}],"priority":"★★☆"},"related_words":{"derivatives":["extrovert (noun, adjective)","extroversion (noun)","introvertly (adverb)","ambivertly (adverb - less common, describing someone who exhibits both extroverted and introverted traits)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1-C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'extrovertly' is used to describe how someone acts in a way that is typical of an extrovert. An extrovert is someone who is outgoing, enjoys being around people, and is often confident and assertive. So, if someone behaves 'extrovertly,' it means they are acting in a sociable, confident, and outgoing manner. This word is not as common as 'extrovert' itself, so it's more likely to be encountered in advanced texts or discussions about personality traits."},"example_sentences":[{"sentence":"He approached the task extrovertly, immediately taking charge and delegating responsibilities.","translation":"彼はその仕事に外向的に取り組み、すぐに主導権を握って責任を分担した。","type":"adverb","meaning_category":"manner of action"},{"sentence":"She extrovertly shared her experiences with the audience, captivating them with her enthusiasm.","translation":"彼女は自分の経験を外向的に聴衆に共有し、熱意で彼らを魅了した。","type":"adverb","meaning_category":"communication style"},{"sentence":"The sales representative extrovertly greeted each customer as they entered the store.","translation":"その販売員は、店に入ってくる客一人一人に外向的に挨拶をした。","type":"adverb","meaning_category":"social interaction"}]}