{"word":"Quinquagesimal","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"五旬節の、四旬節直前の日曜日に関する","english_definition":"Relating to Quinquagesima Sunday, the Sunday immediately preceding Lent.","examples":[{"sentence":"The Quinquagesimal sermon focused on the importance of love and charity.","translation":"五旬節の日曜日の説教は、愛と慈善の重要性に焦点を当てていた。"}],"collocations":["Quinquagesima Sunday","Quinquagesimal sermon"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"五旬節の日曜日","english_definition":"Quinquagesima Sunday; the Sunday immediately preceding Lent.","examples":[{"sentence":"Quinquagesimal is the last Sunday before the Lenten season begins.","translation":"五旬節の日曜日は、四旬節が始まる前の最後の日曜日です。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Latin *quinquagesimus* meaning 'fiftieth', referring to the approximate number of days before Easter.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkwɪŋkwədʒɛˈsɪməl/","syllables":"quin-qua-ge-si-mal"},"inflection":{},"usage_notes":{"explanation":"*Quinquagesimal* specifically refers to the Sunday before Ash Wednesday, marking the beginning of Lent in the Western Christian liturgical calendar. It is derived from the Latin word for 'fiftieth', alluding to the approximate fifty days before Easter. The term is most often encountered in religious contexts.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Quinquagesima Sunday"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"*Quinquagesimal* is a highly specialized term primarily used within the context of the Western Christian liturgical calendar. Its usage is confined to discussions of religious observances and traditions, making it unlikely to be encountered outside of such contexts. Understanding the term necessitates familiarity with Christian liturgical seasons and terminology."},"example_sentences":[{"sentence":"The choir prepared a special anthem for Quinquagesimal Sunday.","translation":"聖歌隊は五旬節の日曜日のために特別な賛歌を準備した。","type":"noun","meaning_category":"五旬節の日曜日"},{"sentence":"The readings for Quinquagesimal often emphasize themes of love and faith.","translation":"五旬節の日曜日の聖書朗読は、愛と信仰のテーマを強調することが多い。","type":"adjective","meaning_category":"五旬節の"}]}