{"word":"facebow","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"フェイスボウ（歯科医療器具）","english_definition":"A caliper-like device used in dentistry to record the spatial relationship of the maxillary arch to the temporomandibular joints (TMJs) or other anatomical reference points. It is used to transfer this relationship to an articulator.","examples":[{"sentence":"The dentist used a facebow to accurately mount the patient's cast on the articulator.","translation":"歯科医はフェイスボウを使用して、患者の模型を咬合器に正確に装着した。"},{"sentence":"Proper use of a facebow helps to ensure accurate occlusal relationships in dental restorations.","translation":"フェイスボウを適切に使用することで、歯科修復物における正確な咬合関係が保証される。"}],"collocations":["use a facebow","record with a facebow","articulator mounting with a facebow"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term 'facebow' is a compound word derived from 'face' and 'bow,' reflecting its function of relating the dental arches to the face and skull.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfeɪsbaʊ/","syllables":"face-bow"},"inflection":{"noun_plural":"facebows"},"usage_notes":{"explanation":"A facebow is a crucial instrument in prosthodontics and restorative dentistry. It helps transfer the patient's maxillary arch position to an articulator, which simulates jaw movements. This ensures that dental restorations, such as crowns, bridges, and dentures, are fabricated to fit the patient's natural bite and jaw movements, minimizing occlusal interferences and improving comfort.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The facebow was used to take an impression of the teeth.","correct":"✓ The facebow was used to record the relationship of the maxillary arch to the TMJs.","note":"A facebow does not take an impression; it records the spatial relationship of the maxillary arch. Impressions are taken with impression materials. "},{"incorrect":"✗ The facebow is used to adjust the patient's bite directly in the mouth.","correct":"✓ The facebow is used to transfer the patient's jaw relationship to an articulator for adjustment.","note":"The facebow records the relationship which is then used on an articulator, not directly in the mouth."}],"priority":"★★☆"},"related_words":{"derivatives":["articulator","temporomandibular joint (TMJ)","maxillary arch","mandibular arch","occlusion","prosthodontics","restorative dentistry"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'facebow' is a specialized term used in dentistry, specifically in prosthodontics and restorative dentistry. It refers to a caliper-like instrument used to record the spatial relationship of the maxillary arch to the temporomandibular joints (TMJs) or other anatomical reference points. Understanding its function requires knowledge of dental anatomy and procedures. It is primarily used by dental professionals. "},"example_sentences":[{"sentence":"The facebow transfer is a critical step in the fabrication of complete dentures.","translation":"フェイスボウのトランスファーは、総義歯の製作における重要なステップである。","type":"noun","meaning_category":"歯科医療器具"},{"sentence":"The dentist adjusted the articulator based on the facebow record.","translation":"歯科医はフェイスボウの記録に基づいて咬合器を調整した。","type":"noun","meaning_category":"歯科医療器具"}]}