{"word":"monologuing","priority":"★☆☆","meanings":[{"part_of_speech":"verb","definition":"(動詞 monologue の現在分詞) 長々と独り言を言う、一方的に話し続ける","english_definition":"(present participle of monologue) to engage in a long speech or discourse by one person, often dominating the conversation and preventing others from speaking.","examples":[{"sentence":"He was monologuing about his achievements for hours, not letting anyone else get a word in.","translation":"彼は何時間も自分の業績について一方的に話し続け、他の誰にも口を挟ませなかった。"},{"sentence":"She started monologuing about her cats, and I knew I was in for a long conversation.","translation":"彼女は自分の猫について一方的に話し始めたので、長い会話になるだろうと覚悟した。"},{"sentence":"I tried to change the subject, but he just kept monologuing.","translation":"話題を変えようとしたが、彼は一方的に話し続けた。"}],"collocations":["start monologuing","keep monologuing","monologue about","monologue at someone"],"synonyms":["speechifying","pontificating","lecturing","haranguing","orating"],"antonyms":["dialoguing","conversing","discussing","listening"]},{"part_of_speech":"noun","definition":"(名詞) 長々と独り言を言うこと、一方的に話し続けること","english_definition":"(gerund or present participle as a noun) the act of engaging in a long speech or discourse by one person, often dominating the conversation and preventing others from speaking.","examples":[{"sentence":"His monologuing was so tiresome that people started avoiding him.","translation":"彼の一方的な話し方はとても退屈だったので、人々は彼を避けるようになった。"},{"sentence":"I couldn't stand the constant monologuing; I needed a real conversation.","translation":"一方的な話し方には我慢できなかった。私は本当の会話が必要だった。"},{"sentence":"The problem with him is his excessive monologuing.","translation":"彼の一番の問題は、一方的に話しすぎることだ。"}],"collocations":["excessive monologuing","constant monologuing","habitual monologuing"],"synonyms":["speechifying","pontification","lecturing","haranguing","oration"],"antonyms":["dialogue","conversation","discussion","listening"]}],"etymology":{"value":"Derived from 'monologue', which comes from the Greek 'monos' (single) and 'logos' (speech). 'Monologuing' is the present participle form, used as a verb or gerund.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɒnəlɒɡɪŋ/","syllables":"mon-o-log-uing"},"inflection":{"verb_forms":{"present_simple":["monologue","monologues"],"past_simple":"monologued","past_participle":"monologued","present_participle":"monologuing"},"noun_plural":"N/A (uncountable when used as a gerund)"},"usage_notes":{"explanation":"'Monologuing' describes the act of delivering a long, uninterrupted speech, often without regard for the listener's interest or participation. It implies a lack of genuine conversation and can be perceived negatively. As a verb, it describes the action of giving such a speech. As a noun (gerund), it refers to the activity itself.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was monologuing to himself.","correct":"✓ He was monologuing. / ✓ He was talking to himself.","note":"'Monologuing' already implies a one-sided speech, so adding 'to himself' is redundant unless emphasizing the speaker is literally alone."},{"incorrect":"✗ She is a monologuing person.","correct":"✓ She is a monologuer. / ✓ She tends to monologue.","note":"To describe someone who frequently monologues, use 'monologuer' (a person who delivers monologues) or say 'She tends to monologue'."}],"priority":"★★☆"},"related_words":{"derivatives":["monologue (noun: a long speech by one person)","monologuer (noun: a person who delivers monologues)"],"phrasal_verbs":["N/A"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1 (relatively infrequent, but understood in context)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Monologuing' refers to the act of someone giving a long speech in a conversation, often preventing others from speaking or participating. It's like a one-way street where only one person is talking. This word is used to describe someone who dominates a conversation and doesn't allow others to share their thoughts or opinions. It's often seen as a negative behavior because it doesn't allow for a balanced exchange of ideas."},"example_sentences":[{"sentence":"The professor was known for his monologuing during lectures, rarely allowing students to ask questions.","translation":"その教授は講義中の一方的な話し方で知られており、学生に質問させることはほとんどなかった。","type":"verb","meaning_category":"長々と独り言を言う"},{"sentence":"I got bored of his constant monologuing and decided to leave the conversation.","translation":"彼の一方的な話し方に飽きてしまったので、会話から離れることにした。","type":"noun","meaning_category":"長々と独り言を言うこと"},{"sentence":"Instead of a dialogue, we were subjected to his endless monologuing.","translation":"対話の代わりに、私たちは彼のエンドレスな一方的な話し方にさらされた。","type":"noun","meaning_category":"長々と独り言を言うこと"},{"sentence":"She realized she was monologuing and made an effort to include others in the discussion.","translation":"彼女は自分が一方的に話していることに気づき、他の人を議論に含めるように努めた。","type":"verb","meaning_category":"長々と独り言を言う"}]}