{"word":"gigantism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"巨人症","english_definition":"A condition caused by overproduction of growth hormone in childhood, resulting in excessive height and body size.","examples":[{"sentence":"Gigantism is usually caused by a tumor on the pituitary gland.","translation":"巨人症は通常、脳下垂体の腫瘍によって引き起こされます。"},{"sentence":"Symptoms of gigantism include excessive growth and joint pain.","translation":"巨人症の症状には、過剰な成長と関節痛が含まれます。"}],"collocations":["pituitary gigantism","cerebral gigantism"],"synonyms":["macrosomia","giantism"],"antonyms":["dwarfism"]}],"etymology":{"value":"From 'giant' + '-ism'. 'Giant' comes from Old French 'geant', from Latin 'gigas', from Greek 'gigas' (γίγας), referring to the giants in Greek mythology. The suffix '-ism' denotes a condition or state.","priority":"★★★"},"pronunciation":{"ipa":"/dʒaɪˈɡæntɪzəm/","syllables":"gi-gan-tism"},"inflection":{"noun_plural":"gigantisms"},"usage_notes":{"explanation":"Gigantism is a medical condition, specifically related to excessive growth due to hormonal imbalance during childhood. It's important to distinguish it from simply being very tall. The term is primarily used in medical contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has gigantism, so he is very tall.","correct":"✓ He has gigantism, which is why he is very tall.","note":"'Gigantism' is the condition that causes excessive height, so the phrasing should reflect this cause-and-effect relationship."}],"priority":"★★☆"},"related_words":{"derivatives":["gigantic (adjective: extremely large)","giant (noun: a very large person or thing)","acromegaly (noun: a similar condition in adults)"],"medical_terms":["pituitary adenoma","growth hormone"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Gigantism' is a specialized medical term referring to a specific condition caused by hormonal imbalance leading to excessive growth in children. It is not a common word in everyday conversation but is used in medical and scientific contexts. Understanding this term requires some knowledge of biology and medicine."},"example_sentences":[{"sentence":"The doctor diagnosed the child with gigantism after observing his rapid growth rate.","translation":"医師は、子供の急速な成長率を観察した後、巨人症と診断しました。","type":"medical","meaning_category":"medical condition"},{"sentence":"Early diagnosis of gigantism is crucial to manage its potential complications.","translation":"巨人症の早期診断は、潜在的な合併症を管理するために重要です。","type":"medical","meaning_category":"medical condition"}]}