{"word":"syllabism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"音節文字体系、音節主義","english_definition":"A writing system in which each symbol represents a syllable; the principle of representing words or morphemes by syllables.","examples":[{"sentence":"Japanese hiragana and katakana are examples of syllabism.","translation":"日本のひらがなとカタカナは音節文字体系の例です。"},{"sentence":"The Linear B script is considered to be a form of syllabism.","translation":"線文字Bは音節文字体系の一形態と考えられています。"}],"collocations":["syllabic script","syllabic writing system","Linear B syllabism"],"synonyms":["syllabary","syllabic writing","phonetic syllabism"],"antonyms":["alphabetism","alphabetical writing","logography"]},{"part_of_speech":"noun","definition":"音節主義（詩における音節数に基づく韻律）","english_definition":"The principle or practice of composing poetry based on the number of syllables in each line, rather than stress patterns or rhyme.","examples":[{"sentence":"Some modern poets have experimented with syllabism in their work.","translation":"現代詩人の中には、作品で音節主義を試みている者がいます。"},{"sentence":"Syllabism allows for a different kind of rhythmic structure in poetry.","translation":"音節主義は詩において異なる種類のリズム構造を可能にします。"}],"collocations":["syllabic verse","syllabic meter","syllabic poetry"],"synonyms":["syllabic verse","syllabic meter"],"antonyms":["accentual verse","stress-timed verse"]}],"etymology":{"value":"From 'syllable' + '-ism'.","priority":"★★★"},"pronunciation":{"ipa":"ˈsɪləbɪzəm","syllables":"syl-la-bism"},"inflection":{"noun_plural":"syllabisms"},"usage_notes":{"explanation":"'Syllabism' refers to two distinct concepts: a writing system and a poetic technique. In linguistics, it denotes a writing system where symbols represent syllables. In poetry, it refers to a method of versification based on syllable count.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The syllabism is a type of alphabet.","correct":"✓ A syllabary is a type of writing system, distinct from an alphabet.","note":"Syllabism refers to a writing system where symbols represent syllables, unlike an alphabet where symbols represent individual sounds (phonemes)."},{"incorrect":"✗ Syllabism is easy to learn because it has fewer characters.","correct":"✓ The ease of learning a syllabic script depends on the specific script and the learner's background.","note":"While some syllabic scripts may have fewer characters than logographic systems, their ease of learning varies."}],"priority":"★★☆"},"related_words":{"derivatives":["syllabic","syllable","syllabary"],"related_terms":["logography","alphabet","phoneme","morpheme","meter","verse"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Syllabism' is a term used in linguistics and literary studies. It refers to a writing system where symbols represent syllables, and a poetic technique where verse is structured by syllable count rather than stress. Understanding this term requires familiarity with concepts in writing systems and poetic meter.","priority":"★★☆"},"example_sentences":[{"sentence":"Hiragana is a clear example of syllabism in the Japanese writing system.","translation":"ひらがなは日本語の文字体系における音節文字体系の明確な例です。","type":"linguistics","meaning_category":"writing system"},{"sentence":"The poet used syllabism to create a unique rhythmic effect in the poem.","translation":"その詩人は音節主義を用いて、詩に独特のリズム効果を生み出しました。","type":"poetry","meaning_category":"poetic technique"}]}