{"word":"Ureterolithiasis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"尿管結石症","english_definition":"The presence of a calculus (stone) in the ureter.","examples":[{"sentence":"The patient was diagnosed with ureterolithiasis after experiencing severe flank pain.","translation":"患者は激しい側腹部痛を訴え、尿管結石症と診断された。"}],"collocations":["ureteral stone","kidney stone","renal colic","hematuria"],"synonyms":["ureteral calculi","ureteric stone","ureter stone"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'ureter' (the tube carrying urine from the kidney to the bladder), 'lithos' (stone), and 'iasis' (process, condition).","priority":"★★☆"},"pronunciation":{"ipa":"/juˌritərəˈlɪθiəsɪs/","syllables":"u-re-ter-o-li-thi-a-sis"},"inflection":{"noun_plural":"Ureterolithiases"},"usage_notes":{"explanation":"Ureterolithiasis refers specifically to the condition where a stone is located within the ureter. It is often associated with kidney stones that have passed into the ureter. The condition can cause significant pain and may require medical intervention for stone removal.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient has ureterolithiasis in his kidney.","correct":"✓ The patient has a kidney stone that has passed into his ureter.","note":"Ureterolithiasis refers to a stone specifically in the ureter. A stone in the kidney is nephrolithiasis or a kidney stone."}],"priority":"★☆☆"},"related_words":{"derivatives":["nephrolithiasis (kidney stones)","lithiasis (stone formation)","ureter (the tube carrying urine from the kidney to the bladder)"],"medical_terms":["renal colic (pain associated with kidney stones)","hematuria (blood in the urine)","extracorporeal shock wave lithotripsy (ESWL) (a non-invasive procedure to break up kidney stones)","ureteroscopy (a procedure to visualize and treat the ureter)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Ureterolithiasis' is a technical medical term referring to the presence of a stone in the ureter. It's primarily used in medical contexts and is not commonly encountered in everyday language. Understanding this term requires knowledge of medical terminology related to the urinary system and stone formation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The patient presented with severe flank pain and was subsequently diagnosed with ureterolithiasis.","translation":"患者は激しい側腹部痛を訴え、その後、尿管結石症と診断された。","type":"general","meaning_category":"diagnosis"},{"sentence":"Treatment options for ureterolithiasis include pain management, medical expulsive therapy, and surgical intervention.","translation":"尿管結石症の治療選択肢には、疼痛管理、薬物排石療法、および外科的介入が含まれる。","type":"general","meaning_category":"treatment"}]}