{"word":"deterger","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"洗剤","english_definition":"A cleansing substance; specifically, a synthetic cleansing agent that emulsifies oils and suspends dirt.","examples":[{"sentence":"Use a mild deterger to wash the delicate fabrics.","translation":"デリケートな生地を洗うには、中性洗剤を使用してください。"},{"sentence":"This deterger is effective at removing grease stains.","translation":"この洗剤は油汚れの除去に効果的です。"}],"collocations":["mild deterger (中性洗剤)","synthetic deterger (合成洗剤)","laundry deterger (洗濯洗剤)","dish deterger (食器用洗剤)"],"synonyms":["cleanser","cleaning agent","soap","washing powder"],"antonyms":[],"notes":"Deterger is often used to refer to synthetic cleaning agents, as opposed to traditional soaps made from fats and oils."}],"etymology":{"value":"From Latin 'detergere' meaning 'to wipe off, cleanse', from 'de-' (away) + 'tergere' (to wipe).","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈtɜːrdʒər/","syllables":"di-ter-ger"},"inflection":{"noun_plural":"detergers"},"usage_notes":{"explanation":"'Deterger' is a more technical or formal term for 'detergent'. It is often used in scientific or industrial contexts. In everyday conversation, 'detergent' is more common.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used deterger on my skin and it irritated it.","correct":"✓ I used detergent on my skin and it irritated it. / ✓ I used soap on my skin and it irritated it.","note":"Using a strong deterger directly on the skin can cause irritation. Soap or milder cleansers are generally recommended for skin. 'Detergent' is more common in this context."}],"priority":"★☆☆"},"related_words":{"derivatives":["detergency (名詞: 洗浄力)"],"related_terms":["detergent (より一般的な語)","soap (石鹸)","cleanser (クレンザー)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Deterger' is a less common and more formal word for 'detergent'. It refers to a cleaning substance, especially a synthetic one. You're more likely to encounter this word in technical or scientific contexts rather than in everyday conversation. If you're unsure, using the word 'detergent' is usually a safer bet for general communication."},"example_sentences":[{"sentence":"The laboratory uses a specialized deterger to clean glassware.","translation":"その研究所では、ガラス製品を洗浄するために特殊な洗剤を使用しています。","type":"general","meaning_category":"洗剤"},{"sentence":"Environmental regulations require biodegradable detergers in many cleaning products.","translation":"環境規制により、多くの洗浄製品に生分解性洗剤が義務付けられています。","type":"general","meaning_category":"洗剤"}]}