{"word":"re-emission","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"再放出、再放射","english_definition":"The act or process of emitting something again; specifically, the release of previously absorbed or captured energy or particles.","examples":[{"sentence":"The re-emission of carbon dioxide from the soil contributes to greenhouse gases.","translation":"土壌からの二酸化炭素の再放出は、温室効果ガスに寄与する。"},{"sentence":"The material's ability to absorb and then re-emit light is used in various technologies.","translation":"その物質が光を吸収し、その後再放出する能力は、様々な技術で利用されている。"},{"sentence":"Re-emission of radiation can occur at different wavelengths.","translation":"放射線の再放出は、異なる波長で起こりうる。"}],"collocations":["carbon dioxide re-emission","radiation re-emission","energy re-emission"],"synonyms":["re-radiation","re-release"],"antonyms":["absorption","capture"]}],"etymology":{"value":"The word is formed by adding the prefix 're-' (meaning again) to the word 'emission' (the act of emitting or giving out).","priority":"★★★"},"pronunciation":{"ipa":"/ˌriːɪˈmɪʃən/","syllables":"re-i-mis-sion"},"inflection":{"noun_plural":"re-emissions"},"usage_notes":{"explanation":"'Re-emission' is commonly used in scientific and technical contexts, particularly in discussions about physics, chemistry, and environmental science. It refers to the process where a substance absorbs energy (such as light or heat) and then releases it again, often in a different form or at a different wavelength.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The reemission was very quick.","correct":"✓ The re-emission was very quick.","note":"Hyphen is needed."}],"priority":"★★☆"},"related_words":{"derivatives":["emit","emission","re-emit"],"related_scientific_terms":["fluorescence","phosphorescence","blackbody radiation"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 're-emission' refers to the process of something being emitted again after it has been absorbed or captured. It's often used in scientific contexts, particularly when discussing energy, radiation, or gases. Understanding the prefix 're-' is helpful, as it indicates repetition or doing something again. The word is relatively technical and not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The re-emission of photons from the excited atoms created a visible glow.","translation":"励起された原子からの光子の再放出が、目に見える光を作り出した。","type":"general","meaning_category":"再放出"},{"sentence":"The study focused on the re-emission rate of methane from thawing permafrost.","translation":"その研究は、融解する永久凍土からのメタンの再放出率に焦点を当てた。","type":"environmental science","meaning_category":"再放出"},{"sentence":"The efficiency of the solar panel was affected by the re-emission of infrared radiation.","translation":"太陽電池パネルの効率は、赤外線の再放出によって影響を受けた。","type":"physics","meaning_category":"再放出"}]}