{"word":"out-of-home","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"家庭外の、屋外の","english_definition":"relating to advertising or activities that reach consumers when they are outside their homes.","examples":[{"sentence":"Out-of-home advertising includes billboards, posters, and transit advertising.","translation":"アウト・オブ・ホーム広告には、看板、ポスター、交通広告が含まれます。"},{"sentence":"The company is investing heavily in out-of-home marketing.","translation":"その会社は、アウト・オブ・ホームマーケティングに多額の投資をしています。"},{"sentence":"Out-of-home media can be very effective in reaching a large audience.","translation":"アウト・オブ・ホームメディアは、多くの聴衆にリーチするのに非常に効果的です。"}],"collocations":["out-of-home advertising","out-of-home media","out-of-home marketing","out-of-home entertainment"],"synonyms":["outdoor","ambient","public"],"antonyms":["in-home","indoor","domestic"]},{"part_of_speech":"noun","definition":"（集合的に）家庭外広告、OOH","english_definition":"advertising that reaches the consumer while they are outside the home; also known as OOH.","examples":[{"sentence":"Out-of-home is seeing a resurgence in popularity.","translation":"アウト・オブ・ホーム広告は人気が再燃しています。"},{"sentence":"Brands are increasingly using out-of-home to connect with consumers on the go.","translation":"ブランドは、外出中の消費者とつながるために、アウト・オブ・ホーム広告をますます利用しています。"},{"sentence":"The out-of-home industry is constantly evolving with new technologies.","translation":"アウト・オブ・ホーム業界は、常に新しい技術で進化しています。"}],"collocations":["OOH (abbreviation for out-of-home)","out-of-home advertising spend","out-of-home campaign"],"synonyms":["outdoor advertising","OOH advertising"],"antonyms":["in-home advertising"]}],"etymology":{"value":"The term 'out-of-home' is a relatively recent term, coined to describe advertising and marketing efforts that target consumers outside of their residences. It's a descriptive term that clearly distinguishes this form of advertising from in-home advertising, such as television, radio, and print media.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌaʊt əv ˈhoʊm/","syllables":"out-of-home"},"inflection":{"notes":"It functions primarily as an adjective and a noun. There are no inflections."},"usage_notes":{"explanation":"'Out-of-home' (OOH) refers to any advertising that reaches consumers when they are outside of their homes. This includes a wide range of formats, such as billboards, posters, transit advertising (ads on buses, trains, and in stations), street furniture (ads on bus shelters, benches, and kiosks), digital out-of-home (DOOH) displays, and place-based advertising (ads in specific locations like gyms, bars, and restaurants). OOH advertising is often used to build brand awareness, reinforce messaging, and drive traffic to retail locations. It's a broad term encompassing many different types of advertising media.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The out of home advertising is very effective.","correct":"✓ The out-of-home advertising is very effective.","note":"The correct spelling includes hyphens between 'out,' 'of,' and 'home' when used as an adjective. Without the hyphens, it's grammatically incorrect. However, when used as a noun, it is sometimes written without hyphens, but 'out-of-home' is preferred."},{"incorrect":"✗ We are doing out of home marketing on the internet.","correct":"✓ We are doing online marketing. / ✓ We are doing out-of-home marketing in public spaces.","note":"Out-of-home marketing, by definition, occurs outside the home. Marketing on the internet is considered online or digital marketing."}],"priority":"★★☆"},"related_words":{"derivatives":["OOH (abbreviation for out-of-home)","DOOH (abbreviation for digital out-of-home)"],"phrasal_verbs":[],"related_concepts":["billboard","poster","transit advertising","street furniture","digital signage","ambient advertising","guerilla marketing"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively frequent in marketing and advertising contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Out-of-home' is a term used in marketing and advertising to describe efforts that reach people when they are not at home. Think of billboards you see while driving, posters in bus stops, or ads on the sides of buses. These are all examples of out-of-home advertising. The term is often shortened to 'OOH.' It's a key concept in marketing, especially for businesses trying to reach a wide audience in public spaces.","priority":"★★☆"},"example_sentences":[{"sentence":"The **out-of-home** campaign generated significant brand awareness.","translation":"そのアウト・オブ・ホームキャンペーンは、ブランド認知度を大幅に向上させました。","type":"adjective","meaning_category":"Advertising"},{"sentence":"**Out-of-home** is a growing sector in the advertising industry.","translation":"アウト・オブ・ホーム広告は、広告業界で成長している分野です。","type":"noun","meaning_category":"Advertising"},{"sentence":"Digital **out-of-home** (DOOH) offers dynamic and interactive advertising opportunities.","translation":"デジタルアウト・オブ・ホーム（DOOH）は、ダイナミックでインタラクティブな広告機会を提供します。","type":"adjective","meaning_category":"Advertising"},{"sentence":"We need to analyze the effectiveness of our **out-of-home** placements.","translation":"アウト・オブ・ホーム広告の配置の効果を分析する必要があります。","type":"noun","meaning_category":"Advertising"}]}