{"word":"Strafers","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(slang, video games) Players who utilize strafing techniques extensively, often to gain a competitive advantage.","english_definition":"(slang, video games) Players who utilize strafing techniques extensively, often to gain a competitive advantage. Strafing involves moving sideways while facing an opponent, making it harder for them to hit you while allowing you to maintain your aim.","examples":[{"sentence":"The lobby was full of strafers, making it difficult to land a shot.","translation":"ロビーはストラファーだらけで、ショットを当てるのが難しかった。"},{"sentence":"He's a skilled strafer; try to anticipate his movements.","translation":"彼は熟練したストラファーだ。彼の動きを予測するように心がけて。"}],"collocations":["skilled strafer","pro strafer","noob strafer","strafing techniques","strafing movement"],"synonyms":["dodger","sidestepper","evader"],"antonyms":["stationary target","easy target"]}],"etymology":{"value":"Derived from 'strafe,' referring to attacking ground targets from low-flying aircraft, moving sideways. The term was then adopted in video game culture to describe a similar movement pattern used by players.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈstreɪfərz/","syllables":"stray-ferz"},"inflection":{"noun_plural":"Strafers"},"usage_notes":{"explanation":"'Strafers' is a slang term primarily used within the context of video games, particularly first-person shooters (FPS). It describes players who heavily rely on strafing as a core gameplay mechanic. The term can sometimes carry a slightly negative connotation, implying that the player is excessively reliant on this technique or is difficult to hit because of it.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The strafers are very strategic.","correct":"✓ The strafers are very skilled at strafing.","note":"'Strafers' refers to the players, not the technique itself. Use 'skilled at strafing' to describe their ability."},{"incorrect":"✗ Strafers is a bad strategy.","correct":"✓ Strafing is a common strategy.","note":"'Strafing' (gerund) refers to the technique, while 'strafers' refers to the players."}],"priority":"★☆☆"},"related_words":{"derivatives":["strafe (verb, noun)","strafing (verb, noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency (specific to gaming communities)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Strafers' is a slang term specific to video gaming, particularly first-person shooters. It refers to players who frequently use strafing, which is moving sideways while facing an opponent, to avoid being hit. This term is not commonly used outside of gaming contexts and may not be understood by those unfamiliar with video game terminology."},"example_sentences":[{"sentence":"The team's success was largely due to their coordinated strafing maneuvers; they were a team of strafers.","translation":"チームの成功は、主に彼らの連携した strafing の動きによるものでした。彼らは strafer のチームでした。","type":"noun","meaning_category":"video games"},{"sentence":"Watch out for the strafers in the next room; they're hard to hit.","translation":"次の部屋の strafer に気を付けて。彼らは当てにくい。","type":"noun","meaning_category":"video games"}]}