{"word":"euthyneural","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(動物学) 直神経性の、直神経類の","english_definition":"(zoology) Having a straight and un-twisted nerve cord; belonging to the Euthyneura.","examples":[{"sentence":"Euthyneural gastropods have a nervous system where the visceral loop is not twisted.","translation":"直神経類の腹足類は、内臓神経環がねじれていない神経系を持つ。"}],"collocations":["euthyneural gastropod","euthyneural nervous system"],"synonyms":[],"antonyms":["streptoneural"]}],"etymology":{"value":"From Greek εὐθύς (euthys, “straight”) + νεῦρον (neuron, “nerve”).","priority":"★★☆"},"pronunciation":{"ipa":"/juːˈθaɪ.njuː.rəl/","syllables":"eu-thy-neu-ral"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"The term 'euthyneural' is primarily used in zoology, specifically when describing the nervous system of certain invertebrates, particularly gastropods (snails and slugs). It indicates a more primitive or ancestral state where the nerve cords are not twisted or crossed. This is in contrast to 'streptoneural' organisms, where the nerve cords are twisted into a figure-eight shape.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":["Euthyneura (noun: a taxonomic group of gastropods with a euthyneural nervous system)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'euthyneural' is a highly specialized zoological term. It is used to describe a specific anatomical feature (a straight, untwisted nerve cord) found in certain groups of animals, particularly gastropods. Its usage is limited to scientific contexts, and a strong background in zoology or comparative anatomy is needed to understand it. It is not a word encountered in general English usage."},"example_sentences":[{"sentence":"The evolutionary history of gastropods can be traced by examining the transition from streptoneural to euthyneural nervous systems.","translation":"腹足類の進化の歴史は、ストレプトニューラルの神経系からユーチニューラルの神経系への移行を調べることで辿ることができる。","type":"scientific","meaning_category":"zoology"}]}