{"word":"ethnicism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"民族主義、民族至上主義、民族偏重主義","english_definition":"An emphasis on ethnic identity, often accompanied by a belief in the superiority of one's own ethnic group. It can also refer to prejudice or discrimination based on ethnicity.","examples":[{"sentence":"Ethnicism can lead to conflict and discrimination.","translation":"民族主義は紛争や差別につながる可能性がある。"},{"sentence":"The rise of ethnicism in the region has caused concern among international observers.","translation":"その地域における民族主義の高まりは、国際的な監視者の間で懸念を引き起こしている。"},{"sentence":"The government is trying to combat ethnicism by promoting multiculturalism.","translation":"政府は多文化主義を推進することで民族主義と戦おうとしている。"}],"collocations":["promote ethnicism (民族主義を助長する)","combat ethnicism (民族主義と戦う)","rise of ethnicism (民族主義の高まり)","dangers of ethnicism (民族主義の危険性)"],"synonyms":["tribalism","nationalism","ethnocentrism","xenophobia","chauvinism","racism"],"antonyms":["multiculturalism","cosmopolitanism","internationalism","inclusion","tolerance"]}],"etymology":{"value":"\"Ethnicism\" is derived from \"ethnic\" (relating to a population subgroup with a common national or cultural tradition) + \"-ism\" (a suffix denoting a doctrine, principle, or ideology).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛθnɪsɪzəm/","syllables":"eth-ni-ci-sm"},"inflection":{"noun_plural":"ethnicisms"},"usage_notes":{"explanation":"\"Ethnicism\" is a complex term that can have both neutral and negative connotations. In a neutral sense, it simply refers to the recognition and celebration of ethnic identity and culture. However, it often carries a negative connotation, implying a belief in the superiority of one's own ethnic group and/or prejudice or discrimination against other ethnic groups. It is often used interchangeably with terms like \"tribalism\" or \"ethnocentrism,\" although these terms may have slightly different nuances. The term is often used in discussions of political conflict, social inequality, and cultural identity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Ethnicism is always a bad thing.","correct":"✓ Ethnicism can be a source of conflict and discrimination, but it can also be a source of cultural pride and identity.","note":"While ethnicism can have negative consequences, it is important to recognize that it can also be a source of cultural pride and identity for many people. It's important to avoid generalizations and consider the specific context in which the term is being used."},{"incorrect":"✗ Ethnicism and racism are the same thing.","correct":"✓ Ethnicism and racism are related, but they are not the same thing. Racism is discrimination based on race, while ethnicism is discrimination based on ethnicity.","note":"Racism is a specific form of prejudice and discrimination based on perceived racial differences, while ethnicism is based on cultural or national origin. While the two concepts are related and can overlap, they are not identical."}],"priority":"★★☆"},"related_words":{"derivatives":["ethnic (adjective, noun)","ethnicity (noun)","ethnocentrism (noun)","ethnicist (noun)"],"phrases":["ethnic cleansing","ethnic conflict","ethnic diversity","ethnic group","ethnic identity"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but used in academic and political contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Ethnicism\" is a more complex term that refers to an emphasis on ethnic identity. It can involve a sense of pride in one's own ethnic group, but it can also lead to prejudice or discrimination against other ethnic groups. It's often used in discussions about politics, culture, and social issues. Understanding this word requires a good grasp of abstract concepts and social dynamics. It's important to understand the context in which the word is used to fully grasp its meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The politician was accused of promoting ethnicism by appealing to nationalist sentiments.","translation":"その政治家は、ナショナリスト的な感情に訴えることで民族主義を助長していると非難された。","type":"general","meaning_category":"民族主義"},{"sentence":"The museum's exhibit explored the history of ethnicism in the region.","translation":"その博物館の展示は、その地域における民族主義の歴史を探求した。","type":"general","meaning_category":"民族主義"},{"sentence":"The organization works to combat ethnicism and promote understanding between different ethnic groups.","translation":"その組織は民族主義と戦い、異なる民族グループ間の理解を促進するために活動している。","type":"general","meaning_category":"民族主義"}]}