{"word":"obedientiary","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"服従の、従順の、命令に従う義務のある","english_definition":"pertaining to or characterized by obedience; subject to a command or duty.","examples":[{"sentence":"The obedientiary monks followed the abbot's instructions without question.","translation":"従順な修道士たちは、何の疑問も持たずに修道院長の指示に従った。"},{"sentence":"As an obedientiary member of the team, he always completed his tasks promptly.","translation":"チームの従順なメンバーとして、彼は常に迅速にタスクを完了させた。"}],"collocations":["obedientiary monk (従順な修道士)","obedientiary servant (従順な召使い)","obedientiary duty (服従の義務)"],"synonyms":["submissive","compliant","docile","dutiful","tractable"],"antonyms":["disobedient","rebellious","insubordinate","defiant"]},{"part_of_speech":"noun","definition":"（歴史的に）修道院などで特定の職務を割り当てられた人、職務を負う人","english_definition":"(historical) a person in a monastery or similar institution who holds a particular office or is assigned a specific duty.","examples":[{"sentence":"The obedientiaries of the abbey each had their own responsibilities, from managing the gardens to overseeing the library.","translation":"修道院の職務者はそれぞれ、庭園の管理から図書館の監督まで、独自の責任を負っていた。"},{"sentence":"The records listed the names of all the obedientiaries and their respective roles within the monastic community.","translation":"記録には、すべての職務者の名前と、修道院コミュニティ内でのそれぞれの役割が記載されていた。"}],"collocations":["monastic obedientiary (修道院の職務者)","abbey obedientiary (大修道院の職務者)"],"synonyms":["official","functionary","officeholder"],"antonyms":[]}],"etymology":{"value":"Derived from 'obedient,' with the suffix '-iary' indicating a person or thing associated with or characterized by the root word.","priority":"★★☆"},"pronunciation":{"ipa":"/oʊˌbiːdiˈɛntʃəri/","syllables":"o-be-di-ent-ia-ry"},"inflection":{"noun_plural":"obedientiaries"},"usage_notes":{"explanation":"The term 'obedientiary' is relatively rare in modern English. As an adjective, it describes someone or something characterized by obedience. As a noun (primarily in historical contexts), it refers to individuals within religious or monastic orders who held specific offices or duties and were expected to be obedient to their superiors.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was an obedientiary to his parents.","correct":"✓ He was obedient to his parents.","note":"When referring to someone being obedient, use the adjective 'obedient' followed by 'to'. 'Obedientiary' as an adjective describes something related to obedience, not the act of being obedient itself."}],"priority":"★★☆"},"related_words":{"derivatives":["obedience","obedient"],"related_terms":["monastery","abbey","vow","duty","office"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'obedientiary' is a relatively rare and specialized term, primarily encountered in historical or religious contexts. As an adjective, it signifies something characterized by or related to obedience. As a noun, it refers to individuals within monastic or religious orders who held specific offices or duties and were expected to be obedient to their superiors. Due to its limited usage and specialized context, it is considered a high-level vocabulary word."},"example_sentences":[{"sentence":"The obedientiary prior was responsible for the daily operations of the monastery.","translation":"従順な副院長は、修道院の日常業務を担当していた。","type":"noun","meaning_category":"職務を負う人"},{"sentence":"The obedientiary nature of the soldier ensured that orders were followed precisely.","translation":"兵士の従順な性質は、命令が正確に実行されることを保証した。","type":"adjective","meaning_category":"従順の"}]}