{"word":"transvenom","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A venom that has been modified or altered, often to reduce its toxicity or to study its components.","english_definition":"A modified or altered venom, often with reduced toxicity or for research purposes.","examples":[{"sentence":"The transvenom was less potent than the original snake venom.","translation":"そのトランスベノムは元のヘビ毒よりも毒性が低かった。"},{"sentence":"Researchers are studying the effects of transvenom on cancer cells.","translation":"研究者たちはトランスベノムが癌細胞に与える影響を研究している。"}],"collocations":["modified transvenom","synthetic transvenom","transvenom research","study of transvenom"],"synonyms":["modified venom","altered venom","detoxified venom"],"antonyms":["natural venom","unmodified venom"]}],"etymology":{"value":"Likely a combination of \"trans-\" (meaning across, beyond, or changed) and \"venom\".","priority":"★★★"},"pronunciation":{"ipa":"/trænzˈvɛnəm/","syllables":"trans-ven-om"},"inflection":{"noun_plural":"transvenoms"},"usage_notes":{"explanation":"The term \"transvenom\" is not widely recognized and may be specific to certain research or medical contexts. It generally refers to venom that has undergone some form of modification, such as detoxification or alteration of its components.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The transvenom is a type of snake.","correct":"✓ The transvenom is a modified form of snake venom.","note":"Transvenom is not an animal; it's a modified substance derived from venom."}],"priority":"★★☆"},"related_words":{"derivatives":["transvenomation (noun: the process of creating or using transvenom)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - likely a specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Transvenom\" is a highly specialized term, primarily used in scientific or medical contexts. It refers to venom that has been modified, often to reduce its toxicity or to isolate specific components for research. Understanding this term requires a strong background in biology, pharmacology, or related fields. It is not part of common vocabulary. "},"example_sentences":[{"sentence":"The transvenom was created by removing the most toxic proteins from the original venom.","translation":"そのトランスベノムは、元の毒から最も毒性の高いタンパク質を除去することによって作成された。","type":"noun","meaning_category":"modified venom"},{"sentence":"Scientists are exploring the potential therapeutic applications of transvenom in treating autoimmune diseases.","translation":"科学者たちは、自己免疫疾患の治療におけるトランスベノムの潜在的な治療応用を研究している。","type":"noun","meaning_category":"modified venom"}]}