{"word":"unstony","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"石っぽくない、石を含まない、岩がない","english_definition":"Not stony; free from stones or rocks.","examples":[{"sentence":"The soil was unstony and easy to plow.","translation":"その土壌は石っぽくなく、耕しやすかった。"},{"sentence":"They sought an unstony path through the forest.","translation":"彼らは森の中の岩のない道を探した。"}],"collocations":["unstony ground","unstony soil","unstony path"],"synonyms":["rockless","stone-free","smooth","clear","unrocky"],"antonyms":["stony","rocky","rough","pebbly"]},{"part_of_speech":"adjective","definition":"冷たくない、無情でない、思いやりがある","english_definition":"Not stony-hearted; compassionate; sympathetic.","examples":[{"sentence":"Her unstony gaze softened as she listened to the child's story.","translation":"彼女の冷たくない視線は、子供の話を聞いているうちに和らいだ。"},{"sentence":"He showed an unstony willingness to help those in need.","translation":"彼は困っている人々を助けることに思いやりを示した。"}],"collocations":["unstony heart","unstony gaze","unstony nature"],"synonyms":["compassionate","sympathetic","kind","gentle","tender","caring"],"antonyms":["stony-hearted","cold","unfeeling","callous","unsympathetic"]}],"etymology":{"value":"\"Un-\" (not) + \"stony\" (of or like stone).","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈstoʊni/","syllables":"un-sto-ny"},"inflection":{"adjective_forms":{"comparative":"more unstony","superlative":"most unstony"}},"usage_notes":{"explanation":"\"Unstony\" is a relatively uncommon word, primarily used to describe something that lacks stones or rocks, or to describe someone who is not cold-hearted or unfeeling. Its usage is often in contrast to the more common word \"stony,\" emphasizing the absence of stone-like qualities.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unstony road was very difficult to walk on.","correct":"✓ The stony road was very difficult to walk on.","note":"An unstony road would be easy to walk on, as it lacks stones. A stony road, full of stones, would be difficult."},{"incorrect":"✗ He gave her an unstony look of anger.","correct":"✓ He gave her a stony look of anger.","note":"A stony look implies coldness or lack of emotion, which aligns with anger. An unstony look would imply the opposite."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in CEFR levels)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"unstony\" is a relatively rare and sophisticated term. It is formed by adding the prefix \"un-\" to \"stony,\" which means \"like stone\" or \"full of stones.\" Therefore, \"unstony\" means the opposite: \"not like stone\" or \"free from stones.\" The word can be used literally to describe ground or soil that does not contain rocks, or figuratively to describe someone who is not cold-hearted or unfeeling. Because of its infrequent use and nuanced meaning, it is more likely to be encountered in advanced texts or specialized contexts."},"example_sentences":[{"sentence":"The farmer preferred to cultivate the unstony fields for planting crops.","translation":"農家は作物を植えるために石のない畑を耕すことを好んだ。","type":"adjective","meaning_category":"石を含まない"},{"sentence":"Despite his gruff exterior, he possessed an unstony heart and a deep capacity for empathy.","translation":"彼はぶっきらぼうな外見にもかかわらず、冷たくない心と深い共感の能力を持っていた。","type":"adjective","meaning_category":"思いやりがある"}]}