{"word":"bumpiness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"凸凹、でこぼこ、不整、不均一","english_definition":"The state or quality of being bumpy; unevenness of a surface.","examples":[{"sentence":"The bumpiness of the road made the ride uncomfortable.","translation":"道路の凸凹のせいで乗り心地が悪かった。"},{"sentence":"The bumpiness of the terrain made hiking difficult.","translation":"地形の凸凹のせいでハイキングが困難だった。"},{"sentence":"The bumpiness of the cake frosting showed it wasn't done by a professional.","translation":"ケーキのアイシングの凸凹から、プロの仕事ではないことがわかった。"}],"collocations":["road bumpiness","surface bumpiness","terrain bumpiness"],"synonyms":["unevenness","roughness","jaggedness","irregularity","asperity"],"antonyms":["smoothness","evenness","flatness"]}],"etymology":{"value":"Derived from the adjective 'bumpy' which comes from 'bump' (a swelling or protuberance). The suffix '-ness' is added to create the noun form indicating the quality of being bumpy.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbʌmpinəs/","syllables":"bump-i-ness"},"inflection":{"noun_plural":"bumpinesses (rarely used)"},"usage_notes":{"explanation":"'Bumpiness' refers to the degree to which a surface is uneven or has bumps. It is generally used to describe physical surfaces like roads, terrain, or objects. It's not typically used to describe abstract concepts. The word emphasizes the presence and degree of unevenness.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The bumpiness of the idea made it difficult to understand.","correct":"✓ The complexity of the idea made it difficult to understand.","note":"'Bumpiness' is generally used for physical surfaces, not abstract concepts. Use 'complexity' or 'difficulty' instead."},{"incorrect":"✗ He complained about the bumpiness of the water.","correct":"✓ He complained about the choppiness of the water.","note":"For water, 'choppiness' is a more appropriate term than 'bumpiness'."}],"priority":"★★☆"},"related_words":{"derivatives":["bumpy (adjective)","bump (noun, verb)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Bumpiness' is a noun that describes how uneven or rough a surface is. It's used when you want to talk about the quality of having bumps or irregularities. It's not a very common word, so you'll mostly find it in more descriptive or technical contexts. For example, you might read about the 'bumpiness of a road' in a travel review or the 'bumpiness of a machined surface' in an engineering report.","priority":"★★★"},"example_sentences":[{"sentence":"The **bumpiness** of the unpaved road rattled the car.","translation":"舗装されていない道路の凸凹が車をガタガタさせた。","type":"noun","meaning_category":"凸凹"},{"sentence":"The **bumpiness** of the landing caused some turbulence.","translation":"着陸の際の揺れがいくらかの乱気流を引き起こした。","type":"noun","meaning_category":"でこぼこ"},{"sentence":"The **bumpiness** of the freshly plowed field made it difficult to walk across.","translation":"耕したばかりの畑の凸凹は歩くのを困難にした。","type":"noun","meaning_category":"不整"}]}