{"word":"detumescence","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(医学)腫脹の軽減、勃起の消失","english_definition":"(medicine) the subsidence of swelling; the abatement of sexual excitement with the disappearance of erection.","examples":[{"sentence":"The detumescence of the penis occurred rapidly after ejaculation.","translation":"射精後、陰茎の勃起は急速に消失した。"},{"sentence":"The medication helped with the detumescence of the swollen tissue.","translation":"その薬は腫れた組織の腫脹を軽減するのに役立った。"}],"collocations":["penile detumescence (陰茎の勃起消失)","rapid detumescence (急速な腫脹軽減/勃起消失)"],"synonyms":["subsidence","abatement","resolution","deflation"],"antonyms":["tumescence","erection","swelling"]}],"etymology":{"value":"From Latin 'detumescere', meaning 'to cease swelling', from 'de-' (away from) + 'tumescere' (to begin to swell), from 'tumescere' (to swell).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdiːtjuːˈmɛsəns/","syllables":"de-tu-mes-cence"},"inflection":{"noun_plural":"detumescences"},"usage_notes":{"explanation":"'Detumescence' is a technical term primarily used in medical or biological contexts. It refers specifically to the reduction of swelling or the return of an organ to its normal size, most commonly used in reference to the penis after erection. It is not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The detumescence of the argument led to a peaceful resolution.","correct":"✓ The subsidence of the argument led to a peaceful resolution.","note":"'Detumescence' is typically used in a medical or physiological context related to swelling or erection. For arguments or other abstract concepts, use 'subsidence' or 'abatement'."}],"priority":"★☆☆"},"related_words":{"derivatives":["detumescent (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Detumescence' is a highly specialized term primarily encountered in medical or scientific literature. It denotes the reversal of swelling or the cessation of an erection. Due to its specific and technical nature, it is not commonly used in general conversation and is more likely to be found in academic or clinical contexts."},"example_sentences":[{"sentence":"Following the successful treatment, there was a noticeable detumescence of the affected area.","translation":"治療が成功した後、患部の顕著な腫脹軽減が見られた。","type":"noun","meaning_category":"腫脹の軽減"},{"sentence":"The study examined the physiological processes involved in penile detumescence.","translation":"その研究は、陰茎の勃起消失に関与する生理学的プロセスを調査した。","type":"noun","meaning_category":"勃起の消失"}]}