{"word":"Anti-Fourierist","priority":"low","meanings":[{"part_of_speech":"noun","definition":"A person who opposes or rejects the ideas, theories, or methods of Joseph Fourier, particularly his mathematical theory of heat conduction and Fourier analysis.","english_definition":"A person who opposes or rejects the ideas, theories, or methods of Joseph Fourier, particularly his mathematical theory of heat conduction and Fourier analysis.","examples":[{"sentence":"The scientific community was divided, with some prominent anti-Fourierists questioning the validity of his heat equation.","translation":"科学界は分裂し、著名な反フーリエ主義者の中には、彼の熱方程式の妥当性に疑問を呈する者もいた。"}],"collocations":["oppose Fourier's theories","reject Fourier analysis","criticize Fourier's methods"],"synonyms":["Fourier critic","Fourier skeptic"],"antonyms":["Fourierist","pro-Fourier"],"notes":"This term is primarily used in historical contexts related to the development of mathematical physics and engineering. It refers to those who initially resisted or doubted Fourier's groundbreaking work.","related_terms":["Fourier analysis","Fourier transform","heat equation","Joseph Fourier"]}],"etymology":{"value":"Formed by combining 'anti-' (against) with 'Fourierist' (a follower or supporter of Joseph Fourier).","priority":"medium"},"pronunciation":{"ipa":"/ˌænti ˈfʊrieɪɪst/","syllables":"An-ti-Four-i-est"},"inflection":{"noun_plural":"Anti-Fourierists"},"usage_notes":{"explanation":"The term 'Anti-Fourierist' is used to describe individuals who, during and after Joseph Fourier's time, opposed his mathematical theories, especially those related to heat conduction and harmonic analysis. This opposition often stemmed from concerns about the rigor and generality of Fourier's methods.","priority":"medium"},"level_frequency":{"frequency_google_ngram":"Very low frequency - Primarily used in specialized historical or academic contexts.","priority":"low"},"readability_explanation":{"level":"C2","text":"The term 'Anti-Fourierist' is highly specialized and primarily encountered in academic or historical discussions related to mathematics, physics, and engineering. Understanding its meaning requires familiarity with the work of Joseph Fourier and the controversies surrounding his theories. It is unlikely to be encountered in general language use."},"example_sentences":[{"sentence":"Early anti-Fourierists argued that his series expansions lacked sufficient mathematical justification.","translation":"初期の反フーリエ主義者は、彼の級数展開には十分な数学的根拠がないと主張した。","type":"general"},{"sentence":"Some engineers, initially anti-Fourierist, later adopted Fourier analysis as a powerful tool for signal processing.","translation":"一部のエンジニアは、当初は反フーリエ主義者であったが、後にフーリエ解析を信号処理の強力なツールとして採用した。","type":"historical"}]}