{"word":"gougingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"法外な値段で、ぼったくりで","english_definition":"In a manner characterized by charging excessively high prices; in a way that exploits customers, especially during times of scarcity or emergency.","examples":[{"sentence":"The vendor was gougingly selling water bottles for $10 each during the heatwave.","translation":"その業者は熱波の間、法外な値段で1本10ドルで水筒を売っていた。"},{"sentence":"Some businesses gougingly increased prices after the natural disaster.","translation":"自然災害の後、一部の企業はぼったくり価格で値段を上げた。"}],"collocations":["charge gougingly","price gougingly","sell gougingly"],"synonyms":["extortionately","exploitatively","unconscionably","rip-off"],"antonyms":["fairly","reasonably","equitably"]}],"etymology":{"value":"Derived from the adjective 'gouging,' which describes the act of charging excessively high prices. 'Gouging' itself comes from the verb 'gouge,' meaning to scoop or force out something, often with a sharp object. The metaphorical extension to pricing implies that customers are being 'gouged' or exploited for their money.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡaʊdʒɪŋli/","syllables":"goug-ing-ly"},"inflection":{"notes":"This is an adverb, so it does not inflect."},"usage_notes":{"explanation":"'**Gougingly**' describes an action related to pricing, specifically when prices are unfairly high. It's often used in situations where there's a shortage or emergency, and businesses take advantage of the situation to make excessive profits. The word carries a strong negative connotation, implying unethical or immoral behavior.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He gougingly smiled.","correct":"✓ He smiled widely.","note":"'Gougingly' relates specifically to pricing and exploitation, not general actions or emotions."}],"priority":"★☆☆"},"related_words":{"derivatives":["gouge (verb, noun)","gouging (adjective, noun)","price gouging (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word '**gougingly**' is a relatively uncommon adverb that describes the act of charging excessively high prices, especially in situations where people are vulnerable, such as during a natural disaster or emergency. It implies unethical behavior and exploitation. Because of its specific and negative connotation, it is not frequently used in everyday conversation but may appear in news reports or discussions about business ethics."},"example_sentences":[{"sentence":"The company was accused of gougingly raising prices on essential supplies during the pandemic.","translation":"その会社は、パンデミックの際に生活必需品の価格を法外に引き上げたと非難された。","type":"adverb","meaning_category":"法外な値段で"},{"sentence":"They were gougingly selling tickets to the concert for ten times their original value.","translation":"彼らはコンサートのチケットを元の価格の10倍でぼったくり価格で売っていた。","type":"adverb","meaning_category":"ぼったくりで"}]}