{"word":"Guajira","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(コロンビアとベネズエラの国境に位置する)グアヒラ半島","english_definition":"A peninsula in northern South America, located on the border between Colombia and Venezuela.","examples":[{"sentence":"The Guajira Peninsula is known for its desert landscapes and indigenous communities.","translation":"グアヒラ半島は、砂漠の風景と先住民族のコミュニティで知られています。"}],"collocations":["Guajira Peninsula","La Guajira","indigenous Guajira communities"],"synonyms":["La Guajira (Spanish)"],"antonyms":[]},{"part_of_speech":"noun","definition":"(コロンビアの県)グアヒラ県","english_definition":"A department (administrative division) of Colombia, located on the Guajira Peninsula.","examples":[{"sentence":"Riohacha is the capital of the Guajira department.","translation":"リオアチャはグアヒラ県の県都です。"}],"collocations":["Guajira department","department of Guajira"],"synonyms":["La Guajira (Spanish)"],"antonyms":[]},{"part_of_speech":"noun","definition":"(音楽ジャンル)グアヒーラ (キューバ音楽のスタイル)","english_definition":"A Cuban musical style, a type of son cubano, characterized by a moderate tempo and a lyrical, often melancholic melody.","examples":[{"sentence":"The guajira is often associated with rural life and themes of love and longing.","translation":"グアヒーラはしばしば農村生活や愛と憧憬のテーマと関連付けられています。"}],"collocations":["Cuban guajira","guajira song","guajira rhythm"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name \"Guajira\" is derived from the indigenous Wayuu people who inhabit the peninsula.","priority":"★★☆"},"pronunciation":{"ipa":"/ɡwaˈxiɾa/","syllables":"Gua-ji-ra"},"inflection":{"notes":"As a proper noun, it does not typically inflect."},"usage_notes":{"explanation":"\"Guajira\" can refer to a geographical location (the peninsula or the department in Colombia) or a style of Cuban music. When referring to the geographical locations, it is often preceded by \"La\" in Spanish. When referring to the music genre, it is typically used without an article.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to Guajira to listen the music.","correct":"✓ I'm going to listen to guajira music.","note":"When referring to the music genre, use it as an adjective or specify 'guajira music' rather than using 'the guajira'."}],"priority":"★★☆"},"related_words":{"derivatives":["Guajiro (masculine form, often used to refer to a person from the Guajira region or a rural Cuban)","Guajira (feminine form, often used to refer to a woman from the Guajira region or a rural Cuban)","Wayuu (the indigenous people of the Guajira Peninsula)"],"phrases":["Son guajiro (a related style of Cuban music)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Guajira' is a term with multiple meanings, primarily referring to a geographical location in northern South America (the Guajira Peninsula, shared by Colombia and Venezuela, and the Guajira Department in Colombia) and a style of Cuban music. Understanding the context is crucial to interpreting the intended meaning. The term is more specialized and less commonly encountered in general English conversation, making it suitable for advanced learners."},"example_sentences":[{"sentence":"We visited the Guajira Peninsula during our trip to Colombia.","translation":"コロンビア旅行中にグアヒラ半島を訪れました。","type":"noun","meaning_category":"Geographical location"},{"sentence":"The guajira is a popular genre of Cuban music.","translation":"グアヒーラはキューバ音楽の人気ジャンルです。","type":"noun","meaning_category":"Music genre"},{"sentence":"The Wayuu people are the indigenous inhabitants of La Guajira.","translation":"ワユー族はラ・グアヒラの先住民族です。","type":"noun","meaning_category":"Geographical location"}]}