{"word":"overclosely","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"過度に密接に、近寄りすぎて、過剰に注意深く","english_definition":"In an excessively close or attentive manner; with too much scrutiny or proximity.","examples":[{"sentence":"He watched her overclosely, making her uncomfortable.","translation":"彼は彼女を過度に注意深く見つめ、彼女を不快にさせた。"},{"sentence":"The fabric was woven overclosely, resulting in a stiff texture.","translation":"その生地は過度に密に織られていたため、硬い質感になった。"},{"sentence":"They monitored the data overclosely, hoping to catch any anomalies.","translation":"彼らはデータを過剰に注意深く監視し、異常を捉えようと試みた。"}],"collocations":["watch overclosely","monitor overclosely","examine overclosely","woven overclosely"],"synonyms":["excessively closely","too attentively","unduly near","intrusively"],"antonyms":["carelessly","distantly","negligently","superficially"]}],"etymology":{"value":"prefix \"over-\" (excessively) + \"closely\" (in a close manner)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊvərˈkloʊsli/","syllables":"o-ver-clo-se-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Overclosely' describes an action done with an excessive degree of closeness, attention, or scrutiny. It implies that the action is perhaps intrusive, uncomfortable, or results in a negative outcome due to its intensity. This word is not as commonly used as 'closely' or 'very closely', suggesting a more specific and often negative connotation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She held the baby overclosely to her.","correct":"✓ She held the baby very closely to her.","note":"While 'overclosely' is grammatically correct, 'very closely' is more commonly used and sounds more natural in many contexts."},{"incorrect":"✗ The manager overclosely managed the team.","correct":"✓ The manager micromanaged the team.","note":"'Micromanaged' is a more common and idiomatic way to express managing a team too closely."}],"priority":"★★☆"},"related_words":{"derivatives":["overclose (adjective, verb)"],"phrases":["too close for comfort"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Overclosely' is an uncommon adverb used to describe actions performed with an excessive degree of closeness or attention. It suggests that the action is perhaps intrusive or uncomfortable due to its intensity. Because of its relatively low frequency, it's more suitable for advanced learners who wish to convey a precise and nuanced meaning. In many cases, more common alternatives like 'very closely' or 'too attentively' might be preferred for clarity."},"example_sentences":[{"sentence":"The detective examined the evidence overclosely, searching for any minute detail.","translation":"刑事は証拠を過度に注意深く調べ、微細な点も見逃さないように探した。","type":"adverb","meaning_category":"excessive scrutiny"},{"sentence":"The security guard watched the suspect overclosely, making sure he didn't try to escape.","translation":"警備員は容疑者が逃げようとしないか、過度に注意深く監視した。","type":"adverb","meaning_category":"excessive attention"},{"sentence":"The artist studied the painting overclosely, trying to understand the technique.","translation":"芸術家はその絵画を過剰に注意深く研究し、技法を理解しようとした。","type":"adverb","meaning_category":"excessive attention"}]}