{"word":"nonplay","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(スポーツ)試合が中断している状態、プレーが行われていない時間","english_definition":"A period during a game or match when active play is stopped or not occurring.","examples":[{"sentence":"The referee called a timeout, resulting in a period of nonplay.","translation":"審判がタイムアウトを宣告し、試合が中断した。"},{"sentence":"During the nonplay, the coach gathered the team for a strategy discussion.","translation":"試合が中断している間、コーチはチームを集めて戦略について話し合った。"},{"sentence":"The long rain delay caused an extended period of nonplay.","translation":"長時間の雨天中断により、試合が長引いた。"}],"collocations":["period of nonplay","extended nonplay","resume nonplay","end nonplay"],"synonyms":["downtime","intermission","break","pause","stoppage"],"antonyms":["play","action","game","match"]},{"part_of_speech":"adjective","definition":"(スポーツ)プレーが行われていない、試合が中断している","english_definition":"Relating to a period when active play is stopped or not occurring.","examples":[{"sentence":"The nonplay period allowed the injured player to receive medical attention.","translation":"試合が中断している間、負傷した選手は治療を受けることができた。"},{"sentence":"Nonplay activities include warm-ups, cool-downs, and team meetings.","translation":"試合が行われていない時の活動には、ウォームアップ、クールダウン、チームミーティングなどが含まれる。"},{"sentence":"The nonplay time is often used for commercial breaks during televised games.","translation":"試合が中断している時間は、テレビ中継中にコマーシャルが流れることが多い。"}],"collocations":["nonplay period","nonplay activities","nonplay time"],"synonyms":["inactive","paused","stopped"],"antonyms":["active","playing","in play"]}],"etymology":{"value":"The word 'nonplay' is formed by combining the prefix 'non-' (meaning 'not') with the word 'play'. It literally means 'not play'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnɒnpleɪ/","syllables":"non-play"},"inflection":{"noun_plural":"nonplays"},"usage_notes":{"explanation":"'Nonplay' is primarily used in the context of sports and games to describe the time when the actual playing action is halted or not taking place. It's often used to differentiate between the active parts of a game and the breaks or pauses in between.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The players were doing non-play during the game.","correct":"✓ The players were resting during the nonplay.","note":"'Nonplay' refers to the period, not the action itself. Use 'resting', 'waiting', etc., to describe what players are doing during nonplay."},{"incorrect":"✗ The nonplay was very exciting.","correct":"✓ The play was very exciting.","note":"'Nonplay' is generally not exciting; it's the 'play' that is exciting."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["timeout","intermission","halftime","stoppage time","injury time"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'nonplay' is a specialized term mainly used in sports contexts. It describes the time when the game is stopped, like during timeouts or between periods. It's not a common word in everyday conversation, so understanding its specific use in sports is important."},"example_sentences":[{"sentence":"During the nonplay, the coach gave the players important instructions.","translation":"試合が中断している間、コーチは選手たちに重要な指示を与えた。","type":"noun","meaning_category":"試合が中断している状態"},{"sentence":"The nonplay period allowed the injured player to receive treatment on the field.","translation":"試合が中断している時間を利用して、負傷した選手はフィールドで治療を受けることができた。","type":"adjective","meaning_category":"試合が中断している"}]}