{"word":"pembongkaran","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"the act of dismantling or demolishing something; demolition; dismantling","english_definition":"The act of taking something apart, demolishing, or dismantling it.","examples":[{"sentence":"Pembongkaran bangunan itu memakan waktu berminggu-minggu.","translation":"The demolition of the building took weeks.","english_translation":"The demolition of the building took weeks."},{"sentence":"Pembongkaran mesin itu dilakukan dengan hati-hati.","translation":"The dismantling of the machine was done carefully.","english_translation":"The dismantling of the machine was done carefully."},{"sentence":"Pemerintah daerah mengumumkan rencana pembongkaran rumah-rumah ilegal.","translation":"The local government announced plans for the demolition of illegal houses.","english_translation":"The local government announced plans for the demolition of illegal houses."}],"collocations":["pembongkaran bangunan (building demolition)","pembongkaran rumah (house demolition)","pembongkaran mesin (machine dismantling)","proses pembongkaran (dismantling process)"],"synonyms":["perobohan","penghancuran","demolisi","pembatalan","penguraian"],"antonyms":["pembangunan","perakitan","pendirian"]}],"etymology":{"value":"Derived from the Indonesian word 'bongkar' (to dismantle, to take apart) with the prefix 'pe(m)-' and suffix '-an' to form a noun.","priority":"★★☆"},"pronunciation":{"ipa":"/pəm.boŋ.ka.ran/","syllables":"pəm-boŋ-ka-ran"},"inflection":{"notes":"This is a noun, so it does not inflect for tense or person."},"usage_notes":{"explanation":"'Pembongkaran' refers to the process or act of taking something apart, either physically demolishing a structure or carefully dismantling a machine. The context usually indicates whether it's a destructive demolition or a careful dismantling.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Saya melihat pembongkaran itu. (Intended meaning: I saw the dismantling.)","correct":"Saya melihat proses pembongkaran itu.","note":"It's better to specify 'proses pembongkaran' (the dismantling process) to avoid ambiguity if you mean the process, not the result."},{"incorrect":"Pembongkaran itu sangat cepat. (Intended meaning: The demolition was very fast.)","correct":"Proses pembongkaran itu sangat cepat.","note":"Similar to the previous example, specifying 'proses pembongkaran' clarifies that you're referring to the speed of the dismantling process."}],"priority":"★★☆"},"related_words":{"derivatives":["bongkar (verb: to dismantle, to take apart)","membongkar (verb: to dismantle, to take apart)","terbongkar (adjective: dismantled, exposed)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively frequent in Indonesian texts, especially in news reports about construction or legal matters.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Pembongkaran' is a noun that describes the act of dismantling or demolishing something. It's commonly used in contexts related to construction, demolition, or dismantling of machinery. The word implies a process of taking something apart, either carefully or destructively. It is a more formal word than its root verb 'bongkar'."},"example_sentences":[{"sentence":"Tim ahli melakukan pembongkaran bom yang ditemukan di pusat kota.","translation":"The expert team carried out the dismantling of the bomb found in the city center.","type":"general","meaning_category":"dismantling"},{"sentence":"Pembongkaran bangunan tua itu dilakukan untuk memberi ruang bagi pembangunan gedung baru.","translation":"The demolition of the old building was carried out to make way for the construction of a new building.","type":"general","meaning_category":"demolition"},{"sentence":"Pembongkaran rahasia itu akhirnya terbongkar oleh media.","translation":"The unveiling of the secret was finally exposed by the media.","type":"figurative","meaning_category":"unveiling (figurative)"}]}