{"word":"ballet-devoted","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"バレエに献身的な、バレエに熱心な","english_definition":"Dedicated or very enthusiastic about ballet.","examples":[{"sentence":"She is a ballet-devoted dancer, practicing for hours every day.","translation":"彼女はバレエに献身的なダンサーで、毎日何時間も練習しています。"},{"sentence":"The ballet-devoted audience always attends every performance.","translation":"バレエに熱心な観客は、いつもすべての公演に足を運びます。"},{"sentence":"He is a ballet-devoted patron, supporting the company with generous donations.","translation":"彼はバレエに熱心な後援者で、寛大な寄付で劇団を支援しています。"}],"collocations":["ballet-devoted dancer","ballet-devoted audience","ballet-devoted fan","ballet-devoted patron","ballet-devoted student"],"synonyms":["ballet-loving","ballet-enthusiastic","ballet-passionate","dedicated to ballet","enthusiastic about ballet"],"antonyms":["ballet-indifferent","uninterested in ballet","apathetic to ballet"]}],"etymology":{"value":"The word is a compound adjective formed by combining \"ballet\" (referring to the dance form) and \"devoted\" (meaning dedicated or very enthusiastic).","priority":"N/A"},"pronunciation":{"ipa":"/ˌbæleɪ dɪˈvoʊtɪd/","syllables":"bal-let-de-vot-ed"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb or noun."},"usage_notes":{"explanation":"\"Ballet-devoted\" is used to describe someone who has a strong passion for and dedication to ballet. It can describe dancers, fans, patrons, or anyone with a deep commitment to ballet. It emphasizes the person's enthusiasm and dedication.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"She is a ballet devoted.","correct":"She is a ballet-devoted dancer.","note":"\"Ballet-devoted\" is an adjective and needs to modify a noun."}],"priority":"N/A"},"related_words":{"derivatives":["devoted","devotion","ballet"],"related_terms":["balletomane","ballet dancer","ballet company","ballet school"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Rare - This is a relatively uncommon compound adjective.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term \"ballet-devoted\" is a compound adjective that describes someone who is very dedicated to or enthusiastic about ballet. It is a relatively uncommon term, so it is likely to be understood by those with a strong interest in ballet or a good vocabulary. The word is straightforward to understand, as it combines the familiar word \"ballet\" with \"devoted,\" which means dedicated or enthusiastic."},"example_sentences":[{"sentence":"The competition was filled with ballet-devoted students hoping to win a scholarship.","translation":"コンクールは、奨学金獲得を願うバレエに熱心な学生たちでいっぱいでした。","type":"adjective","meaning_category":"バレエに熱心な学生"},{"sentence":"Her ballet-devoted parents supported her dream of becoming a professional dancer.","translation":"彼女のバレエに熱心な両親は、プロのダンサーになるという彼女の夢を応援しました。","type":"adjective","meaning_category":"バレエに熱心な両親"},{"sentence":"The ballet-devoted community gathered to celebrate the company's anniversary.","translation":"バレエに熱心なコミュニティが集まり、劇団の記念日を祝いました。","type":"adjective","meaning_category":"バレエに熱心なコミュニティ"}]}