{"word":"castanet","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"カスタネット","english_definition":"a percussion instrument (idiophone) consisting of a pair of concave shells joined on one edge by a string. They are held in the hand and clicked together, typically to accompany Spanish dancing.","examples":[{"sentence":"She played the castanets with great skill.","translation":"彼女は素晴らしい腕前でカスタネットを演奏した。"},{"sentence":"The flamenco dancer used castanets to create a rhythmic beat.","translation":"フラメンコのダンサーはカスタネットを使ってリズミカルなビートを作り出した。"}],"collocations":["play the castanets","castanet player","flamenco castanets","wooden castanets"],"synonyms":["clappers","bones","rattles"],"antonyms":[]}],"etymology":{"value":"From French castagnette, from Spanish castañeta, diminutive of castaña (\"chestnut\"), from Latin castanea, from Ancient Greek καστάνεια (kastáneia). The instrument is named after the chestnut because of its shape.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkæstəˈnɛt/","syllables":"cas-ta-net"},"inflection":{"noun_plural":"castanets"},"usage_notes":{"explanation":"Castanets are typically associated with Spanish music and dance, particularly flamenco. They are held in the hand and clicked together to create a rhythmic sound. The instrument is made of wood, traditionally chestnut wood, hence the name.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I played the castanet.","correct":"✓ I played the castanets.","note":"Castanets are always used in pairs, so the plural form is almost always used."}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"A **castanet** is a percussion instrument, specifically a pair of small, concave shells made of wood, ivory, or plastic. These shells are connected by a string and are held in the hand. By clicking the shells together, a sharp, rhythmic sound is produced. Castanets are most commonly associated with Spanish music and dance, especially flamenco, where they are used to accentuate the rhythm and add to the overall performance. The word itself comes from the Spanish word for chestnut (`castaña`), due to the instrument's resemblance to the shape of a chestnut. While not a common instrument in many genres of music, its distinctive sound makes it easily recognizable in Spanish and Latin American musical contexts."},"example_sentences":[{"sentence":"The dancer's hands moved with incredible speed as she played the **castanets**.","translation":"ダンサーは信じられないほどの速さで手を動かしながらカスタネットを演奏した。","type":"noun","meaning_category":"instrument"},{"sentence":"The rhythmic clicking of the **castanets** filled the room.","translation":"カスタネットのリズミカルな音が部屋中に響き渡った。","type":"noun","meaning_category":"sound"},{"sentence":"The **castanets** added a traditional Spanish flair to the performance.","translation":"カスタネットは演奏に伝統的なスペインの趣を加えた。","type":"noun","meaning_category":"cultural significance"}]}