{"word":"Hangnest","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A bird's nest that hangs from a branch or other support.","english_definition":"A nest, typically woven, that hangs from a branch or other support, such as those built by orioles.","examples":[{"sentence":"The oriole built a beautiful hangnest in the willow tree.","translation":"そのコウライウグイスは、柳の木に美しい吊り巣を作った。"},{"sentence":"We spotted a hangnest swaying gently in the breeze.","translation":"そよ風にそっと揺れる吊り巣を見つけた。"}],"collocations":["oriole hangnest","woven hangnest"],"synonyms":["pendant nest","hanging nest"],"antonyms":[]}],"etymology":{"value":"Combination of \"hang\" (to suspend or be suspended) and \"nest\" (a structure built by birds for laying eggs and raising young).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhæŋˌnɛst/","syllables":"Hang-nest"},"inflection":{"noun_plural":"Hangnests"},"usage_notes":{"explanation":"The term \"hangnest\" is primarily descriptive, referring to the physical structure of the nest rather than a specific type of bird. It is often used to describe the nests of orioles, but can apply to any bird that builds a hanging nest.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a hangnest of squirrels.","correct":"✓ I saw a nest of squirrels.","note":"Squirrels typically build nests in tree cavities or dreys (leaf nests), not hanging nests."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'hangnest' is a relatively uncommon term, primarily used in ornithology or nature observation. Understanding requires familiarity with basic bird nest terminology and the concept of hanging structures. The word itself is straightforward, but its specialized usage may limit comprehension for general audiences."},"example_sentences":[{"sentence":"The intricate design of the oriole's hangnest is a marvel of natural engineering.","translation":"コウライウグイスの吊り巣の複雑なデザインは、自然工学の驚異である。","type":"noun","meaning_category":"bird's nest"},{"sentence":"Birdwatchers often search for hangnests during the nesting season.","translation":"バードウォッチャーは、営巣期によく吊り巣を探す。","type":"noun","meaning_category":"bird's nest"}]}