{"word":"censurability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"検閲可能性、検閲されやすさ","english_definition":"The extent to which something can be censored, or is susceptible to censorship.","examples":[{"sentence":"The platform's design aims to minimize censurability.","translation":"そのプラットフォームの設計は、検閲可能性を最小限に抑えることを目的としています。"},{"sentence":"Decentralized systems often boast greater resistance to censurability.","translation":"分散型システムは、しばしば検閲に対するより大きな耐性を誇ります。"},{"sentence":"The censurability of information on the internet is a growing concern.","translation":"インターネット上の情報の検閲可能性は、ますます懸念されています。"}],"collocations":["high censurability","low censurability","degree of censurability","resistance to censurability","minimize censurability","maximize censurability"],"synonyms":["susceptibility to censorship","vulnerability to censorship","censorability"],"antonyms":["censorship resistance","uncensorability","censorship immunity"]}],"etymology":{"value":"Derived from 'censurable' (deserving of censure) and the suffix '-ity' (state or quality of).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌsɛnʃərəˈbɪləti/","syllables":"cen-sur-a-bil-i-ty"},"inflection":{"noun_plural":"censurabilities"},"usage_notes":{"explanation":"'Censurability' is a relatively technical term, often used in discussions about internet freedom, blockchain technology, and decentralized systems. It refers to how easily a particular piece of content or a system can be censored or controlled by a central authority. High censurability means it's easy to censor, while low censurability (or uncensorability) means it's difficult or impossible to censor.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The censurability are high.","correct":"✓ The censurability is high.","note":"'Censurability' is typically used as an uncountable noun, so it takes a singular verb."}],"priority":"☆☆☆"},"related_words":{"derivatives":["censor (verb, noun)","censorship (noun)","censurable (adjective)","uncensorable (adjective)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in specialized contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Censurability' is a complex term related to the ease with which something can be censored. It's often used in discussions about freedom of speech, especially in the context of the internet and decentralized technologies. Understanding this term requires familiarity with concepts like censorship, decentralization, and control of information."},"example_sentences":[{"sentence":"The developers prioritized uncensorability in the design of the cryptocurrency.","translation":"開発者は、暗号通貨の設計において、検閲不可能性を優先しました。","type":"example","meaning_category":"general"},{"sentence":"The government's attempts to increase the censurability of online content have been met with resistance.","translation":"政府によるオンラインコンテンツの検閲可能性を高めようとする試みは、抵抗に遭っています。","type":"example","meaning_category":"general"},{"sentence":"One of the key advantages of blockchain technology is its inherent resistance to censurability.","translation":"ブロックチェーン技術の重要な利点の1つは、その本質的な検閲耐性です。","type":"example","meaning_category":"general"}]}