{"word":"hydroextractor","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"脱水機、遠心脱水機","english_definition":"A machine that removes water from materials by centrifugal action.","examples":[{"sentence":"The laundry was spun in a hydroextractor to remove excess water before drying.","translation":"洗濯物は乾燥前に余分な水分を取り除くために脱水機にかけられた。"},{"sentence":"Hydroextractors are commonly used in textile mills to dry fabrics quickly.","translation":"脱水機は、織物工場で生地を素早く乾燥させるためによく使用される。"}],"collocations":["industrial hydroextractor","centrifugal hydroextractor","laundry hydroextractor"],"synonyms":["centrifuge","spin dryer"],"antonyms":[]}],"etymology":{"value":"\"hydro-\" (water) + \"extractor\" (something that extracts).","priority":"★★★"},"pronunciation":{"ipa":"/ˌhaɪdroʊɪkˈstræktər/","syllables":"hy-dro-ex-trac-tor"},"inflection":{"noun_plural":"hydroextractors"},"usage_notes":{"explanation":"A hydroextractor is a specific type of machine used to remove liquids, particularly water, from solid materials using centrifugal force. It's commonly used in industrial settings, such as laundries and textile mills.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I put the clothes in the dryer to hydroextract them.","correct":"✓ I put the clothes in the hydroextractor to remove the water.","note":"A dryer uses heat to evaporate water, while a hydroextractor uses centrifugal force to spin the water out. They are different machines."}],"priority":"★☆☆"},"related_words":{"derivatives":["hydroextraction (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'hydroextractor' refers to a specialized piece of equipment that uses centrifugal force to remove water from materials. It's primarily used in industrial or commercial settings, such as laundries or textile mills, rather than in typical household contexts. Understanding the term implies familiarity with industrial processes and equipment.","priority":"★★☆"},"example_sentences":[{"sentence":"The textile factory uses a large hydroextractor to dry the newly dyed fabrics.","translation":"その繊維工場では、新しく染色された生地を乾燥させるために大型の脱水機を使用している。","type":"noun","meaning_category":"machine"},{"sentence":"After washing the vegetables, the farmer used a hydroextractor to remove excess water before packing them.","translation":"野菜を洗った後、農家は梱包する前に余分な水分を取り除くために脱水機を使用した。","type":"noun","meaning_category":"machine"}]}