{"word":"monoecism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"雌雄同株 (しゆうどうしゅ)","english_definition":"The condition of having separate male and female flowers or cones on the same plant.","examples":[{"sentence":"Corn is a classic example of monoecism, with the tassel being the male flower and the ear being the female flower.","translation":"トウモロコシは雌雄同株の典型的な例であり、雄穂が雄花、穂が雌花である。"},{"sentence":"Many species of pine trees exhibit monoecism.","translation":"多くの種類のマツが雌雄同株性を示す。"}],"collocations":["exhibit monoecism","example of monoecism"],"synonyms":["monoecy"],"antonyms":["dioecism"]},{"part_of_speech":"noun","definition":"(動物学において) 雌雄同体","english_definition":"(Zoology) The condition of being hermaphroditic; having both male and female reproductive organs in the same individual.","examples":[{"sentence":"Earthworms are an example of monoecism in the animal kingdom.","translation":"ミミズは動物界における雌雄同体の例である。"}],"collocations":[],"synonyms":["hermaphroditism"],"antonyms":["gonochorism"]}],"etymology":{"value":"Derived from the Greek words 'monos' meaning 'single' and 'oikos' meaning 'house', referring to the single 'house' (plant) bearing both male and female reproductive structures.","priority":"★★★"},"pronunciation":{"ipa":"/məˈniːsɪzəm/","syllables":"mo-noe-ci-sm"},"inflection":{"noun_plural":"monoecisms"},"usage_notes":{"explanation":"The term 'monoecism' primarily refers to plants that have separate male and female flowers or cones on the same individual plant. In zoology, it can refer to hermaphroditism, where an individual animal possesses both male and female reproductive organs. The botanical usage is more common.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Monoecism refers to having only male reproductive organs.","correct":"✓ Monoecism refers to having both male and female reproductive structures on the same plant.","note":"Monoecism involves both male and female structures, not just male."}],"priority":"★★☆"},"related_words":{"derivatives":["monoecious (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Monoecism' is a technical term used in botany and zoology. In botany, it describes plants that have separate male and female flowers on the same plant. In zoology, it can refer to hermaphroditism. Understanding this term requires a background in biology.","priority":"★★☆"},"example_sentences":[{"sentence":"The cucumber plant demonstrates monoecism by producing both male and female flowers.","translation":"キュウリの植物は雄花と雌花の両方を生成することで雌雄同株性を示す。","type":"botany","meaning_category":"雌雄同株 (植物)"},{"sentence":"While less common in animals, monoecism allows for self-fertilization in some species.","translation":"動物ではあまり一般的ではないが、雌雄同体は一部の種で自家受精を可能にする。","type":"zoology","meaning_category":"雌雄同体 (動物)"}]}