{"word":"lipid-reactive","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"脂質反応性の、脂質と反応する","english_definition":"Capable of reacting with lipids.","examples":[{"sentence":"The antibody is lipid-reactive and binds to phospholipids.","translation":"その抗体は脂質反応性であり、リン脂質に結合します。"},{"sentence":"Lipid-reactive T cells have been implicated in autoimmune diseases.","translation":"脂質反応性T細胞は自己免疫疾患に関与していると考えられています。"}],"collocations":["lipid-reactive antibody","lipid-reactive T cell","lipid-reactive molecule"],"synonyms":["lipid-binding","lipid-interacting"],"antonyms":[]}],"etymology":{"value":"Composed of 'lipid' (a type of fat molecule) and 'reactive' (having a tendency to react chemically).","priority":"N/A"},"pronunciation":{"ipa":"N/A","syllables":"lip-id-re-ac-tive"},"inflection":{"notes":"Adjective. Comparative: more lipid-reactive; Superlative: most lipid-reactive."},"usage_notes":{"explanation":"'Lipid-reactive' is primarily used in scientific and medical contexts to describe substances, such as antibodies or T cells, that can specifically bind to or react with lipids. This reactivity is often relevant in understanding immune responses, autoimmune diseases, and lipid metabolism.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["lipid","reactive","reactivity"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - primarily used in scientific literature.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The term 'lipid-reactive' is a technical term primarily used in scientific and medical fields. It describes something that has the ability to react with lipids, which are a class of fats and fat-like substances important in biology. Understanding this term requires a background in biology, chemistry, or medicine."},"example_sentences":[{"sentence":"The study identified several lipid-reactive antibodies in patients with the disease.","translation":"その研究では、その疾患の患者においていくつかの脂質反応性抗体が特定された。","type":"scientific","meaning_category":"脂質反応性抗体"},{"sentence":"Lipid-reactive T cells are being investigated as potential therapeutic targets.","translation":"脂質反応性T細胞は、潜在的な治療標的として研究されている。","type":"scientific","meaning_category":"脂質反応性T細胞"}]}