{"word":"bucolicism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"牧歌主義、田園趣味、田園生活への憧憬","english_definition":"An idealized view of rural life; pastoralism.","examples":[{"sentence":"The painting embodies bucolicism with its depiction of shepherds and idyllic landscapes.","translation":"その絵は、羊飼いと牧歌的な風景の描写によって、牧歌主義を体現している。"},{"sentence":"His bucolicism led him to leave the city and start a farm.","translation":"彼の牧歌主義は、彼を都市を離れて農場を始める気にさせた。"},{"sentence":"The poem's bucolicism offers a romanticized escape from the harsh realities of urban life.","translation":"その詩の牧歌主義は、都市生活の厳しい現実からのロマンチックな逃避を提供する。"}],"collocations":["embrace bucolicism","romantic bucolicism","rural bucolicism","pastoral bucolicism"],"synonyms":["pastoralism","ruralism","idyllicism","arcadianism"],"antonyms":["urbanism","cosmopolitanism","industrialism"]}],"etymology":{"value":"Derived from 'bucolic,' meaning relating to the pleasant aspects of the countryside and country life, which comes from the Greek 'boukolikos,' meaning 'of herdsmen, pastoral,' from 'boukolos,' meaning 'herdsman, cowherd,' from 'bous' meaning 'ox, cow.' The suffix '-ism' denotes a doctrine, principle, or theory.","priority":"★★☆"},"pronunciation":{"ipa":"/bjuːˈkɒlɪsɪzəm/","syllables":"bu-col-i-cism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Bucolicism' refers to the aesthetic and philosophical concept of idealizing rural life, often portraying it as simpler, more peaceful, and more virtuous than urban existence. It involves a romanticized view that may not accurately reflect the realities of agricultural or rural communities. It is often expressed in art, literature, and lifestyle choices.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He lived a bucolic life in the city.","correct":"✓ He lived a bucolic life in the countryside.","note":"Bucolicism implies a rural setting, so it's contradictory to use it in reference to city life."},{"incorrect":"✗ The bucolicism was very industrialized.","correct":"✓ The area lacked bucolicism due to industrialization.","note":"Bucolicism and industrialization are generally opposing concepts."}],"priority":"★★☆"},"related_words":{"derivatives":["bucolic (adjective, noun)","bucolically (adverb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Bucolicism' is a relatively advanced term that describes the idealization of rural life. It suggests a romantic and often unrealistic view of the countryside as a place of peace, simplicity, and virtue. This term is often used in discussions of art, literature, and social philosophy, where the contrast between urban and rural values is explored. Understanding this word requires familiarity with abstract concepts and cultural critiques of modern life."},"example_sentences":[{"sentence":"The novel's **bucolicism** presents a nostalgic vision of rural England.","translation":"その小説の牧歌主義は、イギリスの田園地帯のノスタルジックなビジョンを提示している。","type":"noun","meaning_category":"田園生活への憧憬"},{"sentence":"Her **bucolicism** inspired her to create a garden filled with wildflowers and native plants.","translation":"彼女の牧歌主義は、彼女に野生の花や在来植物でいっぱいの庭を作る気にさせた。","type":"noun","meaning_category":"田園趣味"},{"sentence":"Critics argue that the film's **bucolicism** ignores the hardships faced by farmers.","translation":"批評家たちは、その映画の牧歌主義が農家が直面する苦難を無視していると主張している。","type":"noun","meaning_category":"牧歌主義"}]}