{"word":"hygrology","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"水文学、水文科学","english_definition":"The science dealing with the properties, distribution, and effects of water on the earth's surface, in the soil and underlying rocks, and in the atmosphere.","examples":[{"sentence":"Hygrology is essential for managing water resources.","translation":"水文学は水資源の管理に不可欠です。"},{"sentence":"The hygrology of the region is complex due to the varied terrain.","translation":"その地域の水文学は、多様な地形のために複雑です。"}],"collocations":["applied hygrology","regional hygrology","study of hygrology"],"synonyms":["hydrology","hydroscience","water science"],"antonyms":[]}],"etymology":{"value":"From Greek 'hygro-' (relating to moisture) + '-logy' (study of).","priority":"★★☆"},"pronunciation":{"ipa":"/haɪˈɡrɒlədʒi/","syllables":"hy-grol-o-gy"},"inflection":{"noun_plural":"hygrologies"},"usage_notes":{"explanation":"'Hygrology' is often used interchangeably with 'hydrology', although some sources may differentiate them slightly, with 'hygrology' sometimes referring more specifically to the study of surface and subsurface water.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a hygrologist in the biology department.","correct":"✓ He is a hygrologist in the geology or environmental science department.","note":"Hygrology is related to earth science, not biology."}],"priority":"★★☆"},"related_words":{"derivatives":["hygrologic (adjective)","hygrologist (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Hygrology is a specialized term used in earth science and environmental studies. It refers to the study of water, its properties, distribution, and effects on the Earth. Understanding this term requires familiarity with scientific vocabulary and concepts related to water resources and environmental processes."},"example_sentences":[{"sentence":"The course covers various aspects of hygrology, including groundwater flow and surface runoff.","translation":"そのコースでは、地下水の流れや地表流出など、水文学のさまざまな側面を扱います。","type":"general"},{"sentence":"Advances in hygrology have improved our ability to predict floods.","translation":"水文学の進歩により、洪水を予測する能力が向上しました。","type":"application"}]}