{"word":"matronship","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"婦長[寮母]の地位[職務]","english_definition":"The position or role of a matron, especially in a school, hospital, or other institution.","examples":[{"sentence":"She applied for the matronship at the boarding school.","translation":"彼女は寄宿学校の婦長の職に応募した。"},{"sentence":"The responsibilities of the matronship included overseeing the students' welfare.","translation":"婦長の職務には、生徒たちの福祉を監督することが含まれていた。"},{"sentence":"Her dedication to her matronship was evident in the care she provided.","translation":"彼女の婦長としての献身は、彼女が提供するケアに明らかだった。"}],"collocations":["apply for a matronship","hold a matronship","the duties of a matronship","the responsibilities of a matronship"],"synonyms":["headship","superintendence","wardenship","directorship","leadership"],"antonyms":[]}],"etymology":{"value":"Formed from 'matron' (a woman in charge of domestic and medical arrangements at a boarding school or other institution) + '-ship' (a suffix denoting a state, condition, office, or dignity).","priority":"★★★"},"pronunciation":{"ipa":"/ˈmeɪtrənʃɪp/","syllables":"may-tron-ship"},"inflection":{"noun_plural":"matronships"},"usage_notes":{"explanation":"The term 'matronship' is most commonly used in the context of boarding schools, hospitals (historically), and other residential institutions. It refers to the position held by a matron, who is responsible for the well-being and care of the residents or students. The role often involves a combination of domestic, medical, and pastoral duties. The term is becoming less common as traditional roles evolve.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She worked as a matronship for many years.","correct":"✓ She held the matronship for many years. / ✓ She worked as a matron for many years.","note":"'Matronship' refers to the position itself, not the person. Use 'held the matronship' or 'worked as a matron' to describe someone performing the role."},{"incorrect":"✗ The matronship is a very easy job.","correct":"✓ The matronship involves many responsibilities.","note":"Avoid generalizations about the difficulty of the role. Instead, focus on specific aspects of the position."}],"priority":"★☆☆"},"related_words":{"derivatives":["matron","matronly"],"phrasal_verbs":[],"related_concepts":["boarding school","hospital administration","pastoral care"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - primarily used in specific contexts (historical or institutional).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'matronship' refers to the role or position of a matron, typically in a school, hospital, or similar institution. It implies a position of responsibility for the welfare and care of others. The term is somewhat formal and less commonly used in modern contexts, often replaced by more contemporary titles such as 'residential supervisor' or 'student welfare officer'."},"example_sentences":[{"sentence":"The advertisement sought a candidate with experience in a similar matronship.","translation":"その広告は、同様の婦長の職務経験がある候補者を求めていた。","type":"general","meaning_category":"position/role"},{"sentence":"During her matronship, she implemented several improvements to the students' living conditions.","translation":"彼女の婦長在任中、彼女は生徒たちの生活環境にいくつかの改善を実施した。","type":"general","meaning_category":"position/role"},{"sentence":"The responsibilities of the matronship were demanding but rewarding.","translation":"婦長の職務は大変だったが、やりがいもあった。","type":"general","meaning_category":"position/role"}]}