{"word":"vice-haunted","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(of a place or person) persistently troubled or influenced by immoral or wicked behavior.","english_definition":"Troubled or plagued by immoral or wicked behavior or influences.","examples":[{"sentence":"The old part of the city was described as vice-haunted, with gambling dens and brothels on every corner.","translation":"その都市の旧市街は、いたるところに賭博場や売春宿があり、悪徳に取り憑かれていると描写されていた。"},{"sentence":"His dreams were vice-haunted, filled with temptations and regrets.","translation":"彼の夢は悪徳に取り憑かれており、誘惑と後悔に満ちていた。"}],"collocations":["vice-haunted city","vice-haunted dreams","vice-haunted past"],"synonyms":["corrupt","immoral","wicked","sinful","debauched","tainted","plagued","beset"],"antonyms":["virtuous","moral","pure","innocent"]}],"etymology":{"value":"A combination of 'vice' (immoral or wicked behavior) and 'haunted' (persistently troubled or influenced by something, often a ghost or spirit). The term suggests that the place or person is constantly affected by or struggling with immoral influences.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvaɪsˌhɔːntɪd/","syllables":"vice-haunt-ed"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"'Vice-haunted' is a descriptive adjective, often used in literature or historical contexts to evoke a sense of moral decay or corruption. It is more figurative than literal, suggesting a pervasive atmosphere of immorality rather than actual supernatural haunting. It can describe both physical locations and the internal state of a person.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He lived in a vice-haunted house, with ghosts of criminals.","correct":"✓ He lived in a vice-haunted neighborhood, with a history of crime.","note":"'Vice-haunted' is more about moral corruption than literal ghosts. Focus on the immoral activities or influences. "},{"incorrect":"✗ She felt vice-haunted because she ate too much cake.","correct":"✓ She felt guilt-haunted because she ate too much cake.","note":"'Vice-haunted' implies more serious immoral behavior than simple overindulgence. Use 'guilt-haunted' or 'regret-haunted' for minor transgressions."}],"priority":"★☆☆"},"related_words":{"derivatives":["vice (noun: immoral or wicked behavior)","haunted (adjective: visited by ghosts; persistently affected by something)"],"phrasal_verbs":[],"related_adjectives":["guilt-haunted","fear-haunted","memory-haunted"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - more common in literature and historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'vice-haunted' is a relatively uncommon and evocative adjective. It suggests that a place or person is persistently troubled or influenced by immoral or wicked behavior. The term is figurative, implying a pervasive atmosphere of corruption rather than literal haunting. Understanding requires a grasp of both 'vice' (immorality) and 'haunted' (persistently affected)."},"example_sentences":[{"sentence":"The old port town was vice-haunted, a haven for smugglers and pirates.","translation":"その古い港町は悪徳に取り憑かれており、密輸業者や海賊の避難所だった。","type":"adjective","meaning_category":"Immoral Influence"},{"sentence":"His past was vice-haunted, filled with choices he deeply regretted.","translation":"彼の過去は悪徳に取り憑かれており、深く後悔している選択に満ちていた。","type":"adjective","meaning_category":"Personal Turmoil"},{"sentence":"The novel depicted a vice-haunted society, where corruption was rampant.","translation":"その小説は、腐敗が蔓延する悪徳に取り憑かれた社会を描写していた。","type":"adjective","meaning_category":"Social Corruption"}]}