{"word":"nutrition-minded","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"栄養に気を配る、栄養に関心が高い","english_definition":"Having a strong awareness of and concern for the nutritional content of food; health-conscious regarding diet.","examples":[{"sentence":"She is a nutrition-minded individual who always reads food labels carefully.","translation":"彼女は栄養に気を配る人で、いつも食品のラベルを注意深く読んでいます。"},{"sentence":"More and more people are becoming nutrition-minded and choosing healthier options.","translation":"ますます多くの人々が栄養に関心を持つようになり、より健康的な選択肢を選ぶようになっています。"},{"sentence":"The restaurant caters to nutrition-minded customers by offering low-calorie and organic dishes.","translation":"そのレストランは、低カロリーでオーガニックな料理を提供することで、栄養に関心のある顧客に対応しています。"}],"collocations":["be nutrition-minded","become nutrition-minded","nutrition-minded consumer","nutrition-minded approach","nutrition-minded diet"],"synonyms":["health-conscious","diet-conscious","food-conscious","health-aware","nutritionally aware"],"antonyms":["unhealthy","indifferent to nutrition","unconcerned about nutrition","nutrition-ignorant"]},{"part_of_speech":"adjective","definition":"栄養を重視した、栄養を考慮した","english_definition":"Designed or characterized by an emphasis on good nutrition.","examples":[{"sentence":"The school implemented a nutrition-minded lunch program to improve students' health.","translation":"学校は生徒の健康を改善するために、栄養を重視した給食プログラムを実施しました。"},{"sentence":"The chef created a nutrition-minded menu that was both delicious and healthy.","translation":"シェフは美味しくて健康的な、栄養を考慮したメニューを作りました。"},{"sentence":"This cookbook offers nutrition-minded recipes for busy families.","translation":"この料理本は、忙しい家族のために栄養を考慮したレシピを提供しています。"}],"collocations":["nutrition-minded recipe","nutrition-minded menu","nutrition-minded program","nutrition-minded approach","nutrition-minded food"],"synonyms":["nutritious","healthy","wholesome","nutritionally balanced","healthful"],"antonyms":["unhealthy","nutritionally poor","unwholesome"]}],"etymology":{"value":"A compound word formed by combining 'nutrition' (from Latin 'nutritio', meaning nourishment) and 'minded' (having a particular disposition or focus of mind).","priority":"★★☆"},"pronunciation":{"ipa":"/njuːˈtrɪʃənˌmaɪndɪd/","syllables":"nu-tri-tion-mind-ed"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Nutrition-minded' describes someone who pays close attention to the nutritional value of food or something that is designed with a focus on good nutrition. It implies a proactive and conscious effort to prioritize health through diet. It is often used in the context of food choices, dietary habits, and health-related programs or products.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"She is very nutrition-mind.","correct":"She is very nutrition-minded.","note":"'Nutrition-minded' is an adjective, so it needs to be used correctly to describe the person. 'Nutrition-mind' is not a correct form."},{"incorrect":"The food is nutrition-minded.","correct":"The food is nutrition-minded/nutritious.","note":"While 'nutrition-minded' can describe food, it is more common to use 'nutritious' to describe the food itself. 'Nutrition-minded' is better used to describe a recipe or menu."}],"priority":"★★☆"},"related_words":{"derivatives":["nutrition","nutritionally","minded"],"phrasal_verbs":[],"related_terms":["health-conscious","diet","healthy eating","nutritious food","wellness"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but increasing with health awareness.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'nutrition-minded' is used to describe someone who is very aware of and concerned about the nutritional value of food. It's often used in discussions about healthy eating, dieting, and wellness. It's a more advanced term than simply saying someone 'eats healthy' because it implies a deeper understanding and focus on nutrition. You might see it in articles about health, fitness, or food trends."},"example_sentences":[{"sentence":"As a nutrition-minded parent, she always packs healthy snacks for her children.","translation":"栄養に気を配る親として、彼女はいつも子供たちのために健康的なおやつを詰めます。","type":"adjective","meaning_category":"栄養に気を配る"},{"sentence":"The company promotes a nutrition-minded culture by providing healthy meals for its employees.","translation":"その会社は従業員に健康的な食事を提供することで、栄養を重視する文化を推進しています。","type":"adjective","meaning_category":"栄養を重視した"},{"sentence":"More athletes are becoming nutrition-minded to improve their performance.","translation":"より多くのアスリートがパフォーマンスを向上させるために栄養に気を配るようになっています。","type":"adjective","meaning_category":"栄養に気を配る"},{"sentence":"This is a nutrition-minded recipe that is both delicious and easy to prepare.","translation":"これは美味しくて簡単に作れる、栄養を考慮したレシピです。","type":"adjective","meaning_category":"栄養を考慮した"}]}