{"word":"Theologisation","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"The act or process of theologising; the development or interpretation of something in theological terms.","english_definition":"The act or process of interpreting something from a theological perspective or developing it into a theological system.","examples":[{"sentence":"Theologisation of political concepts can lead to religious justifications for certain policies.","translation":"政治的概念の神学化は、特定の政策に対する宗教的正当化につながる可能性があります。"},{"sentence":"Theologisation of nature involves understanding the natural world through a religious lens.","translation":"自然の神学化には、宗教的レンズを通して自然界を理解することが含まれます。"}],"collocations":["process of theologisation","cultural theologisation","political theologisation"],"synonyms":["theologizing","theological interpretation","religious interpretation"],"antonyms":["secularization","demythologization"]}],"etymology":{"value":"Derived from 'theologise' (to treat theologically) + '-ation' (suffix indicating a process or action).","priority":"Medium"},"pronunciation":{"ipa":"/θiˌɒlədʒaɪˈzeɪʃən/","syllables":"the-o-lo-gi-sa-tion"},"inflection":{"noun_plural":"Theologisations"},"usage_notes":{"explanation":"'Theologisation' refers to the process of applying theological principles or interpretations to something, often to give it a religious or moral dimension. It can involve reinterpreting existing concepts or practices in light of religious beliefs.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"Theologization is when you study theology.","correct":"Theologization is the process of applying theological concepts to other areas.","note":"Theologization is not merely studying theology, but applying theological principles to other fields or concepts."}],"priority":"Low"},"related_words":{"derivatives":["theologise","theologian","theological","theology"],"related_terms":["religious studies","hermeneutics","exegesis"],"priority":"Medium"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"C2","text":"'Theologisation' is a complex term used in academic and theological contexts. It refers to the process of interpreting ideas, concepts, or practices through a theological framework. Understanding this term requires familiarity with theological discourse and abstract reasoning."},"example_sentences":[{"sentence":"Theologisation of suffering is a common theme in many religions.","translation":"苦しみの神学化は多くの宗教における共通のテーマです。","type":"general","meaning_category":"theological interpretation"},{"sentence":"Some scholars criticize the theologisation of secular concepts.","translation":"一部の学者は世俗的な概念の神学化を批判しています。","type":"academic","meaning_category":"application of theology"}]}