{"word":"gastronomy-focused","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"美食に焦点を当てた、美食学に特化した","english_definition":"Centered on or emphasizing gastronomy, the art and science of good eating.","examples":[{"sentence":"The city's tourism industry is becoming increasingly gastronomy-focused, attracting food lovers from around the world.","translation":"その都市の観光産業はますます美食に焦点を当てるようになり、世界中から食を愛する人々を魅了している。"},{"sentence":"This is a gastronomy-focused tour that explores the region's culinary heritage.","translation":"これは、その地域の食文化遺産を探求する美食に焦点を当てたツアーです。"},{"sentence":"The restaurant's menu is gastronomy-focused, featuring innovative dishes made with locally sourced ingredients.","translation":"そのレストランのメニューは美食に焦点を当てており、地元産の食材を使った革新的な料理が特徴です。"}],"collocations":["gastronomy-focused tour","gastronomy-focused restaurant","gastronomy-focused event","gastronomy-focused approach","gastronomy-focused education"],"synonyms":["culinary-focused","food-centric","gourmet-oriented","epicurean","foodie"],"antonyms":["non-culinary","general interest","non-food"],"related_words":["gastronomy","culinary","foodie","gourmet","epicurean","cuisine"]}],"etymology":{"value":"Combination of 'gastronomy' (from Greek 'gastros' meaning stomach and 'nomos' meaning law or knowledge) and 'focused' (having one's attention directed).","priority":"N/A"},"pronunciation":{"ipa":"/ˌɡæˈstrɒnəmi ˈfoʊkəst/","syllables":"gas-tron-o-my-fo-cused"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"The term 'gastronomy-focused' is used to describe something that prioritizes or emphasizes the aspects of gastronomy, which includes not only the preparation and consumption of food but also the cultural, social, and historical contexts surrounding it. It is often used in the context of tourism, education, and the restaurant industry.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"gastronomy focus","correct":"gastronomy-focused","note":"The correct form is an adjective using '-focused'."}]},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, used in specialized contexts.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'gastronomy-focused' is a compound adjective used to describe something that is centered on or emphasizes gastronomy. Gastronomy refers to the art and science of good eating, encompassing the preparation, presentation, and appreciation of food. This term is typically used in contexts related to tourism, culinary arts, and fine dining."},"example_sentences":[{"sentence":"The region is developing a gastronomy-focused tourism strategy to attract more visitors.","translation":"その地域は、より多くの観光客を誘致するために、美食に焦点を当てた観光戦略を策定している。","type":"adjective","meaning_category":"美食に焦点を当てた"},{"sentence":"The new culinary school offers a gastronomy-focused curriculum.","translation":"その新しい料理学校は、美食に焦点を当てたカリキュラムを提供している。","type":"adjective","meaning_category":"美食に焦点を当てた"}]}