{"word":"hirsutogenic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"多毛症を引き起こす、または多毛症を促進する","english_definition":"Causing or promoting hirsutism (excessive hair growth).","examples":[{"sentence":"Certain medications can have hirsutogenic effects.","translation":"特定の薬は多毛症を引き起こす可能性があります。"},{"sentence":"The hirsutogenic properties of this compound are being studied.","translation":"この化合物の多毛症を引き起こす特性が研究されています。"}],"collocations":["hirsutogenic effect","hirsutogenic properties","hirsutogenic medication","hirsutogenic agent"],"synonyms":["hair-growth-inducing","trichogenous"],"antonyms":["anti-hirsutism","hair-growth-inhibiting"]}],"etymology":{"value":"Derived from 'hirsute' (hairy) + '-o-' (connecting vowel) + '-genic' (producing).","priority":"★★☆"},"pronunciation":{"ipa":"/hɜːrˌsuːtəˈdʒɛnɪk/","syllables":"hir-su-to-gen-ic"},"inflection":{"notes":"Adjective; comparative and superlative forms are possible (more hirsutogenic, most hirsutogenic), but not commonly used."},"usage_notes":{"explanation":"'Hirsutogenic' is a relatively specialized term primarily used in medical or scientific contexts. It describes something that causes or increases hair growth, especially in women, in areas where hair growth is typically minimal or absent (e.g., face, chest). It's often used when discussing medications, hormones, or other substances that can lead to hirsutism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cream is hirsutogenic, so it will remove hair.","correct":"✓ The cream is hirsutogenic, so it will cause hair growth.","note":"'Hirsutogenic' means causing hair growth, not removing it. The opposite effect would be 'hair-growth-inhibiting' or 'hair-removing'."}],"priority":"★★☆"},"related_words":{"derivatives":["hirsutism (noun: 多毛症)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hirsutogenic' is a technical term primarily used in medical and scientific contexts. It describes substances or conditions that cause or promote hirsutism, which is excessive hair growth, especially in women. Understanding this term requires knowledge of medical terminology and a high level of English proficiency."},"example_sentences":[{"sentence":"The doctor suspected a hirsutogenic cause for the patient's excessive hair growth.","translation":"医師は、患者の過剰な発毛の原因として、多毛症を引き起こす要因を疑った。","type":"adjective","meaning_category":"多毛症を引き起こす"},{"sentence":"This steroid has known hirsutogenic side effects.","translation":"このステロイドには、多毛症を引き起こす副作用があることが知られている。","type":"adjective","meaning_category":"多毛症を引き起こす"}]}