{"word":"tip-eared","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Having ears with pointed or distinctively shaped tips.","english_definition":"Having ears with a distinctive shape at the tip, often pointed or slightly deformed.","examples":[{"sentence":"The stray cat was easily identifiable by its tip-eared appearance, a result of many street fights.","translation":"その野良猫は、数々の喧嘩の結果である、先のとがった耳の形によって容易に識別できた。"},{"sentence":"The veterinarian noted that the feral cat was tip-eared, indicating it had been spayed or neutered as part of a trap-neuter-release program.","translation":"獣医は、その野良猫の耳がカットされていることに気づき、それは捕獲・避妊手術・リリースのプログラムの一環として避妊または去勢手術を受けたことを示していると述べた。"},{"sentence":"The lynx is a tip-eared animal, with black tufts of fur at the end of each ear.","translation":"オオヤマネコは、耳の先に黒い房毛がある、先のとがった耳の動物である。"}],"collocations":["tip-eared cat","tip-eared lynx","tip-eared appearance"],"synonyms":["pointed-eared","prick-eared"],"antonyms":["lop-eared","droop-eared"]}],"etymology":{"value":"The word 'tip-eared' is a compound adjective formed by combining 'tip' (referring to the end or point of something) and 'eared' (having ears). The combination describes the characteristic of having distinctively shaped tips on the ears.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɪpɪərd/","syllables":"tip-eared"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more tip-eared' and 'most tip-eared', respectively, though rarely used."},"usage_notes":{"explanation":"'Tip-eared' is most commonly used to describe animals, particularly cats, where the tips of the ears have been altered, either naturally or through human intervention (such as TNR programs for feral cats). It can also describe animals with naturally pointed or tufted ears, like lynxes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The cat was tip eared.","correct":"✓ The cat was tip-eared.","note":"The correct form is 'tip-eared,' a compound adjective. Hyphenation is necessary."}],"priority":"★★☆"},"related_words":{"derivatives":["tip","ear","eared"],"phrasal_verbs":[],"related_terms":["ear-tipped","ear-notched"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'tip-eared' is a relatively uncommon adjective used to describe animals with distinctively shaped ear tips. Its meaning is straightforward, combining 'tip' and 'eared' to indicate the characteristic feature. It is most often encountered in contexts related to animal descriptions, wildlife, or veterinary medicine."},"example_sentences":[{"sentence":"The rescue organization often identifies feral cats by their tip-eared appearance after they have been through a trap-neuter-release program.","translation":"救助団体は、捕獲・避妊手術・リリースのプログラムを経た野良猫を、耳のカットされた外見によって識別することが多い。","type":"descriptive","meaning_category":"descriptive"},{"sentence":"The artist drew a detailed sketch of the tip-eared fox, highlighting its unique features.","translation":"アーティストは、先のとがった耳のキツネの詳細なスケッチを描き、そのユニークな特徴を強調した。","type":"descriptive","meaning_category":"descriptive"},{"sentence":"The biologist studied the genetic variations that led to the tip-eared phenotype in the local rabbit population.","translation":"生物学者は、地域のウサギの個体群における先のとがった耳の表現型をもたらす遺伝的変異を研究した。","type":"scientific","meaning_category":"scientific"}]}