{"word":"garbler","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(情報を)歪曲する人、誤って伝える人","english_definition":"a person who distorts or mutilates information, a text, etc.; one who garbles.","examples":[{"sentence":"He was known as a garbler of facts, never letting the truth get in the way of a good story.","translation":"彼は事実を歪曲する人として知られており、面白い話のためなら真実を邪魔させることは決してなかった。"},{"sentence":"The report accused the journalist of being a garbler, twisting quotes to fit his narrative.","translation":"その報告書は、ジャーナリストが自身の物語に合うように引用を歪曲する、情報を歪曲する人だと非難した。"}],"collocations":["a notorious garbler (悪名高い歪曲者)","a persistent garbler (常習的な歪曲者)","a willful garbler (意図的な歪曲者)"],"synonyms":["distorter","mangler","misrepresenter","falsifier","perverter"],"antonyms":["truth-teller","verifier","clarifier"]}],"etymology":{"value":"The word 'garbler' comes from the verb 'garble,' which originally meant 'to sift' or 'to select.' Over time, it took on the meaning of 'to distort' or 'to mutilate,' likely because the process of sifting could lead to the removal or alteration of parts.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡɑːrbələr/","syllables":"gar-bler"},"inflection":{"noun_plural":"garblers"},"usage_notes":{"explanation":"'Garbler' is typically used to describe someone who intentionally or habitually presents information in a misleading or inaccurate way. The term often implies a deliberate attempt to deceive or manipulate. It's stronger than simply making a mistake; it suggests a pattern of distortion.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a garbler of the truth, so we should believe him.","correct":"✓ He is a garbler of the truth, so we should not believe him.","note":"Since a garbler distorts the truth, it is illogical to say we should believe them."},{"incorrect":"✗ The garbler fixed the document.","correct":"✓ The editor fixed the document.","note":"A garbler distorts; they do not fix or correct."}],"priority":"★☆☆"},"related_words":{"derivatives":["garble (verb: to distort; noun: a distortion)","garbled (adjective: distorted)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'garbler' is not commonly used in everyday conversation. It is more frequently found in formal writing or discussions about media, journalism, or historical accounts where the accuracy of information is being questioned. Understanding this word requires a good grasp of vocabulary related to truth, deception, and communication.","priority":"★★☆"},"example_sentences":[{"sentence":"The historian accused his rival of being a **garbler** of historical facts.","translation":"その歴史家は、ライバルが歴史的事実を歪曲する人だと非難した。","type":"noun","meaning_category":"distorter"},{"sentence":"The politician dismissed the journalist as a known **garbler** of information.","translation":"その政治家は、そのジャーナリストを情報歪曲者として一蹴した。","type":"noun","meaning_category":"misrepresenter"},{"sentence":"Don't trust anything he says; he's a notorious **garbler**.","translation":"彼の言うことは何も信用するな。彼は悪名高い歪曲者だ。","type":"noun","meaning_category":"falsifier"}]}