{"word":"Materialian","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(哲学)唯物論者、物質主義者","english_definition":"A person who adheres to materialism, the philosophical belief that only matter and energy exist and that consciousness is a result of physical interactions.","examples":[{"sentence":"As a Materialian, he believed that all phenomena, including consciousness, could be explained by physical processes.","translation":"唯物論者として、彼は意識を含むすべての現象は物理的なプロセスで説明できると信じていた。"}],"collocations":["philosophical Materialian","strict Materialian"],"synonyms":["materialist"],"antonyms":["idealist","spiritualist"]},{"part_of_speech":"adjective","definition":"唯物論の、物質主義の","english_definition":"Relating to or characteristic of materialism, the philosophical belief that only matter and energy exist.","examples":[{"sentence":"The Materialian view of the world excludes any supernatural or spiritual explanations.","translation":"唯物論的な世界観は、いかなる超自然的または精神的な説明も排除する。"}],"collocations":["Materialian philosophy","Materialian worldview"],"synonyms":["materialistic"],"antonyms":["idealistic","spiritual"]}],"etymology":{"value":"Derived from 'material' + '-ian'. 'Material' comes from Latin 'materia' (matter).","priority":"★★☆"},"pronunciation":{"ipa":"/məˌtɪəriˈeɪliən/","syllables":"ma-te-ri-a-li-an"},"inflection":{"noun_plural":"Materialians"},"usage_notes":{"explanation":"The term 'Materialian' is often used in philosophical contexts to describe someone who believes in materialism. It's less commonly used than 'materialist', but it carries the same fundamental meaning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a very Materialian person, always buying expensive things.","correct":"✓ He is a very materialistic person, always buying expensive things.","note":"In everyday language, 'materialistic' is more commonly used to describe someone who is excessively concerned with material possessions, while 'Materialian' is more specifically used in a philosophical context."}],"priority":"★★☆"},"related_words":{"derivatives":["materialism","materialist","materialistic"],"related_terms":["matter","energy","philosophy"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Materialian' is a relatively uncommon term, primarily used in philosophical discussions. It refers to someone who believes in materialism, the idea that only physical matter exists. It's important to distinguish it from 'materialistic,' which describes someone overly concerned with possessions."},"example_sentences":[{"sentence":"The debate centered on whether a Materialian account of consciousness was possible.","translation":"議論は、意識の唯物論的な説明が可能かどうかに集中した。","type":"adjective","meaning_category":"唯物論の"},{"sentence":"As a committed Materialian, she rejected any notion of a soul or afterlife.","translation":"熱心な唯物論者として、彼女は魂や死後の世界の概念を一切否定した。","type":"noun","meaning_category":"唯物論者"}]}