{"word":"nonvirility","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"男性らしくないこと、男らしさの欠如、インポテンツ","english_definition":"the state or condition of not being virile; lack of virility; impotence.","examples":[{"sentence":"The character suffered from nonvirility, which affected his self-esteem.","translation":"そのキャラクターは男らしさの欠如に苦しみ、それが彼の自尊心に影響を与えた。"},{"sentence":"The treatment aimed to address the patient's nonvirility.","translation":"その治療は患者のインポテンツに対処することを目的としていた。"}],"collocations":["lack of virility","cause of nonvirility","treatment for nonvirility"],"synonyms":["impotence","emasculation","lack of masculinity","effeminacy","weakness"],"antonyms":["virility","masculinity","potency","strength"]}],"etymology":{"value":"\"non-\" (否定) + \"virility\" (男らしさ)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnvɪˈrɪləti/","syllables":"non-vi-ri-li-ty"},"inflection":{"noun_plural":"nonvirilities (rare)"},"usage_notes":{"explanation":"\"Nonvirility\" is a relatively uncommon and formal term. It refers specifically to the lack of masculine characteristics or the inability to perform sexually as a male. It is often used in medical or psychological contexts. More common and less formal terms include \"impotence\" or simply describing the specific symptoms or conditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a nonvirility behavior.","correct":"✓ He showed nonvirile behavior.","note":"\"Nonvirility\" is a noun. The adjective form is \"nonvirile.\""},{"incorrect":"✗ The nonvirility of the plant was evident.","correct":"✓ The lack of vigor in the plant was evident.","note":"\"Nonvirility\" is specifically related to males. For plants or other non-male entities, use terms like \"lack of vigor,\" \"sterility,\" or other appropriate descriptors."}],"priority":"★★☆"},"related_words":{"derivatives":["nonvirile (adjective)"],"phrases":["lack of virility","male infertility"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonvirility\" is a formal and uncommon term referring to the lack of masculine traits or sexual potency in a male. It is typically used in medical or psychological contexts. Due to its specialized nature, it is not part of everyday vocabulary and is more likely to be encountered in academic or professional settings. Understanding its meaning requires a good grasp of vocabulary related to sexuality and masculinity."},"example_sentences":[{"sentence":"His feelings of inadequacy stemmed from his perceived nonvirility.","translation":"彼の不全感は、彼が認識している男らしさの欠如から生じていた。","type":"general"},{"sentence":"The study investigated the causes and treatments for nonvirility in older men.","translation":"その研究は、高齢男性における男らしさの欠如の原因と治療法を調査した。","type":"medical"},{"sentence":"The novel explored themes of identity and masculinity, including the protagonist's struggle with nonvirility.","translation":"その小説は、アイデンティティと男らしさのテーマを探求し、主人公の男らしさの欠如との葛藤を含んでいた。","type":"literary"}]}