{"word":"ASPCA","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"米国動物虐待防止協会 (American Society for the Prevention of Cruelty to Animals)","english_definition":"American Society for the Prevention of Cruelty to Animals: a non-profit organization dedicated to preventing cruelty to animals.","examples":[{"sentence":"The ASPCA is dedicated to rescuing animals from abuse and neglect.","translation":"ASPCAは虐待やネグレクトから動物を救うことに尽力しています。"},{"sentence":"They donated to the ASPCA to support their animal welfare programs.","translation":"彼らはASPCAの動物福祉プログラムを支援するために寄付をしました。"}],"collocations":["donate to the ASPCA (ASPCAに寄付する)","ASPCA shelter (ASPCAのシェルター)","ASPCA adoption (ASPCAでの里親探し)"],"synonyms":["animal welfare organization","animal rescue organization"],"antonyms":[]}],"etymology":{"value":"The acronym stands for American Society for the Prevention of Cruelty to Animals. It was the first humane society to be established in North America.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌeɪ.es.piːˌsiːˈeɪ/","syllables":"A-S-P-C-A"},"inflection":{"notes":"It is an acronym that functions as a noun."},"usage_notes":{"explanation":"The ASPCA is a well-known organization in the United States dedicated to animal welfare. It focuses on rescuing animals, preventing animal cruelty, and advocating for animal rights. The organization operates animal shelters, provides veterinary care, and offers adoption services.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I work for the ASCPA.","correct":"✓ I work for the ASPCA.","note":"Ensure the correct capitalization of the acronym."},{"incorrect":"✗ The ASPCA are a great organization.","correct":"✓ The ASPCA is a great organization.","note":"Although it represents a group of people, ASPCA is treated as a singular entity."}],"priority":"★★☆"},"related_words":{"derivatives":["animal cruelty","animal welfare","animal rights","humane society","shelter"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively frequent in American English contexts related to animal welfare.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"ASPCA is an acronym for the American Society for the Prevention of Cruelty to Animals. It is a well-known organization in the United States that works to protect animals from cruelty and neglect. Understanding this term is helpful when discussing animal welfare issues in the US.","priority":"★★★"},"example_sentences":[{"sentence":"The ASPCA rescued over 5,000 animals last year.","translation":"ASPCAは昨年、5,000匹以上の動物を救助しました。","type":"general","meaning_category":"animal rescue"},{"sentence":"You can adopt a pet from the ASPCA.","translation":"ASPCAからペットを里親として迎えることができます。","type":"general","meaning_category":"animal adoption"},{"sentence":"The ASPCA works to prevent animal cruelty through education and legislation.","translation":"ASPCAは教育と法律を通じて動物虐待の防止に取り組んでいます。","type":"general","meaning_category":"animal cruelty prevention"}]}