{"word":"lithochromatics","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"岩石の色素形成、岩石の色彩研究","english_definition":"The study of the colors in rocks; the formation of colors in rocks.","examples":[{"sentence":"Lithochromatics helps geologists understand the composition and history of rock formations.","translation":"岩石の色彩研究は、地質学者が岩石の構成と歴史を理解するのに役立ちます。"},{"sentence":"The lithochromatics of this sandstone reveals the presence of iron oxides.","translation":"この砂岩の岩石色彩は、酸化鉄の存在を明らかにしています。"}],"collocations":["study of lithochromatics","lithochromatics analysis","lithochromatics of sandstone"],"synonyms":["rock color analysis","petrocolorimetry"],"antonyms":[]}],"etymology":{"value":"The word is derived from the Greek words 'lithos' (stone) and 'chroma' (color), combined with the suffix '-ics' indicating a field of study.","priority":"★★★"},"pronunciation":{"ipa":"/ˌlɪθoʊkroʊˈmætɪks/","syllables":"li-tho-chro-mat-ics"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Lithochromatics is a specialized term primarily used in geology and related fields to describe the study or characteristics of colors found in rocks. It is not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lithochromatics are beautiful.","correct":"✓ The lithochromatics is interesting.","note":"Lithochromatics is generally used as a singular noun referring to the study or property itself, not as a plural referring to multiple instances."}],"priority":"★★☆"},"related_words":{"derivatives":["lithochrome (a colored mineral or pigment used in lithography)","chromatic (relating to color or colors)"],"phrases":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Lithochromatics' is a highly specialized term used in geology. It refers to the study of colors in rocks, which can provide insights into their composition and formation history. Due to its technical nature, it is unlikely to be encountered outside of academic or professional contexts related to earth sciences."},"example_sentences":[{"sentence":"The professor specialized in the study of lithochromatics to better understand mineral composition.","translation":"その教授は鉱物組成をより良く理解するために、岩石の色彩研究を専門としていました。","type":"noun","meaning_category":"岩石の色彩研究"},{"sentence":"Detailed lithochromatics analysis revealed the presence of rare earth elements in the sample.","translation":"詳細な岩石色彩分析により、サンプル中の希土類元素の存在が明らかになりました。","type":"noun","meaning_category":"岩石の色彩研究"}]}