{"word":"cryptomnesic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"潜在記憶の、暗号記憶の","english_definition":"Relating to cryptomnesia; having or showing cryptomnesia.","examples":[{"sentence":"The patient exhibited cryptomnesic tendencies, unknowingly recalling past experiences as original ideas.","translation":"その患者は潜在記憶の傾向を示し、過去の経験を無意識のうちに独創的なアイデアとして思い出していた。"}],"collocations":["cryptomnesic experience","cryptomnesic recall","cryptomnesic plagiarism"],"synonyms":["unconscious memory","implicit memory","latent memory"],"antonyms":["conscious memory","explicit memory"]}],"etymology":{"value":"Derived from 'cryptomnesia,' which combines 'crypto-' (hidden, secret) with '-mnesia' (related to memory).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkrɪptoʊmˈniːsɪk/","syllables":"cryp-tom-ne-sic"},"inflection":{"notes":"The adjective 'cryptomnesic' does not have different forms for gender or number."},"usage_notes":{"explanation":"'Cryptomnesic' is an adjective used to describe something related to cryptomnesia, which is the phenomenon where a forgotten memory returns without it being recognized as such by the subject, who believes it is something new and original. It is often used in discussions of creativity, plagiarism, and psychological phenomena.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a cryptomnesia episode.","correct":"✓ He had a cryptomnesic experience.","note":"'Cryptomnesia' is the phenomenon itself, while 'cryptomnesic' describes something related to that phenomenon. Use 'cryptomnesic experience' to describe an instance of cryptomnesia."}],"priority":"★★☆"},"related_words":{"derivatives":["cryptomnesia (noun)","cryptomnesically (adverb)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Cryptomnesic' is a highly specialized term primarily used in psychology, philosophy, and discussions of creativity. It describes something related to cryptomnesia, a phenomenon where a forgotten memory returns but is not recognized as such, leading the individual to believe it is a new and original idea. Due to its specific and technical nature, it is not commonly encountered outside of academic or professional contexts. Understanding the root term 'cryptomnesia' is essential for comprehending the meaning of 'cryptomnesic.'"},"example_sentences":[{"sentence":"The author's work showed cryptomnesic similarities to an earlier, lesser-known novel.","translation":"その作家の作品は、以前のあまり知られていない小説と潜在記憶による類似性を示していた。","type":"adjective","meaning_category":"Relating to cryptomnesia"},{"sentence":"His cryptomnesic recollection of the melody led him to believe he had composed it himself.","translation":"彼の潜在記憶によるその旋律の想起は、彼自身が作曲したと思い込ませた。","type":"adjective","meaning_category":"Relating to cryptomnesia"}]}