{"word":"Weanoc","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史) アメリカ先住民の部族名。バージニア州に居住していたアルゴンキン語族の部族。","english_definition":"(historical) A Native American tribe, an Algonquian-speaking people who resided in Virginia.","examples":[{"sentence":"The Weanoc people were part of the Powhatan Confederacy.","translation":"ウィーノック族はポウハタン連邦の一部でした。"},{"sentence":"Historical records mention the Weanoc's interactions with early English settlers.","translation":"歴史的記録には、ウィーノック族と初期のイギリス人入植者との交流が記されています。"}],"collocations":["Weanoc tribe","Weanoc Indians","Powhatan Confederacy"],"synonyms":["none (specific to this tribe)"],"antonyms":["none (specific to this tribe)"]}],"etymology":{"value":"Originates from the Weanoc language (Algonquian), meaning is not definitively known.","priority":"★★★"},"pronunciation":{"ipa":"ˈwiːˌnɒk","syllables":"Wee-noc"},"inflection":{"noun_plural":"Weanocs"},"usage_notes":{"explanation":"'Weanoc' refers specifically to a historical Native American tribe. Information about them is limited, and they are primarily known through historical accounts of the Powhatan Confederacy and early colonial interactions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Weanoc are a modern, thriving tribe.","correct":"✓ The Weanoc were a historical tribe that is no longer extant as a distinct group.","note":"The Weanoc, as a distinct tribe, no longer exist. They were a historical group."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_tribes":["Powhatan","Pamunkey","Appomattoc"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily found in historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Weanoc' is a specialized term referring to a specific historical Native American tribe. Its usage is primarily limited to historical or anthropological contexts. Understanding requires familiarity with the history of Native American tribes in the Virginia region.","priority":"★★★"},"example_sentences":[{"sentence":"Archaeological evidence provides insights into the life of the Weanoc.","translation":"考古学的証拠は、ウィーノック族の生活に関する洞察を提供します。","type":"historical context","meaning_category":"tribe"},{"sentence":"The Weanoc's territory was located near the James River.","translation":"ウィーノック族の領土はジェームズ川の近くに位置していました。","type":"geographical context","meaning_category":"tribe"}]}