{"word":"glossing","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"注釈、注釈をつけること、光沢出し","english_definition":"The act of adding notes or comments to explain something; giving something a shiny surface.","examples":[{"sentence":"The glossing of ancient texts helps us understand their meaning.","translation":"古代文書への注釈は、その意味を理解するのに役立つ。"},{"sentence":"The furniture received a final glossing to enhance its appearance.","translation":"家具は外観を向上させるために最終的な光沢出しを受けた。"}],"collocations":["text glossing","surface glossing","annotation","explanation","polishing"],"synonyms":["annotation","explanation","commentary","elucidation","polish","shine"],"antonyms":["obscuring","confusing","dulling"]},{"part_of_speech":"verb","definition":"（テキストに）注釈をつける、ごまかす","english_definition":"To provide notes or comments to explain something; to give a deceptively attractive appearance to something.","examples":[{"sentence":"Scholars are glossing the manuscript to make it accessible to a wider audience.","translation":"学者は、より多くの読者が読めるように原稿に注釈をつけている。"},{"sentence":"She tried to gloss over the mistake, but everyone noticed it.","translation":"彼女はその間違いをごまかそうとしたが、皆が気づいた。"}],"collocations":["gloss a text","gloss over a mistake","annotate","explain","varnish"],"synonyms":["annotate","explain","elucidate","interpret","varnish","cover up","whitewash"],"antonyms":["confuse","obscure","reveal","expose"]}],"etymology":{"value":"The word 'glossing' comes from 'gloss', which originates from the Greek word 'glossa' meaning 'tongue' or 'language'. In medieval times, 'gloss' referred to an explanation of a difficult word or passage, written in the margin or between the lines of a manuscript. Over time, it also came to mean giving something a shiny or attractive surface.","priority":"★★☆"},"pronunciation":{"ipa":"ˈɡlɒsɪŋ","syllables":"gloss-ing"},"inflection":{"verb_forms":{"present_participle":"glossing","past_simple":"glossed","past_participle":"glossed"}},"usage_notes":{"explanation":"'Glossing' can refer to the act of adding explanatory notes to a text, often to clarify difficult or obscure passages. It can also refer to the process of making something shiny or polished. When used figuratively, 'glossing over' means to avoid discussing something unpleasant or to make it seem less important than it really is.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is glossing the floor with words.","correct":"He is glossing over the problem with words.","note":"'Glossing over' is the correct phrasal verb to use when someone is trying to avoid addressing an issue directly."}],"priority":"★★☆"},"related_words":{"derivatives":["gloss (noun, verb)","glossary (noun)","glossy (adjective)"],"phrasal_verbs":["gloss over"],"related_terms":["annotation","exegesis","commentary"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Glossing' has two main meanings: adding explanatory notes to a text to make it easier to understand, and making something shiny. Figuratively, 'glossing over' means avoiding or downplaying something negative. This word is more common in academic or technical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The professor spent hours glossing the ancient manuscript.","translation":"教授は何時間もかけて古代原稿に注釈をつけた。","type":"verb","meaning_category":"Annotating"},{"sentence":"The company tried to gloss over the environmental damage caused by the factory.","translation":"会社は工場による環境被害をごまかそうとした。","type":"verb","meaning_category":"Avoiding"},{"sentence":"The glossing on the magazine cover made the model's skin look flawless.","translation":"雑誌の表紙の光沢出しで、モデルの肌は完璧に見えた。","type":"noun","meaning_category":"Polishing"},{"sentence":"Text glossing is essential for understanding complex academic papers.","translation":"テキストへの注釈は、複雑な学術論文を理解するために不可欠である。","type":"noun","meaning_category":"Annotation"}]}