{"word":"Expressionistically","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"表現主義的に","english_definition":"In a manner that relates to or is characteristic of expressionism.","examples":[{"sentence":"The film was shot expressionistically, with distorted angles and exaggerated lighting.","translation":"その映画は表現主義的に撮影され、歪んだアングルと誇張された照明が用いられていた。"},{"sentence":"The artist painted expressionistically, conveying intense emotions through bold colors and brushstrokes.","translation":"その芸術家は表現主義的に描き、大胆な色彩と筆致を通して強烈な感情を伝えた。"}],"collocations":["paint expressionistically","shoot expressionistically","depict expressionistically"],"synonyms":["emotionally","subjectively","intensely","dramatically"],"antonyms":["realistically","naturalistically","objectively"]}],"etymology":{"value":"Derived from \"expressionistic\" (adjective) + \"-ally\" (suffix forming adverbs). \"Expressionistic\" comes from \"expressionism,\" a modernist movement originating in Germany at the beginning of the 20th century.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪkˌspreʃəˈnɪstɪkli/","syllables":"ex-pres-sion-is-ti-cal-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"The adverb \"expressionistically\" describes something done in the style of expressionism, an artistic movement that emphasizes subjective feeling and intense emotional expression over objective reality. It is used to describe art, literature, film, and other forms of creative expression.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He expressionistic painted the picture.","correct":"✓ He painted the picture expressionistically.","note":"Adverbs typically modify verbs and are placed either before or after the verb, or at the beginning or end of the sentence for emphasis. In this case, placing it after the verb 'painted' is more natural."}],"priority":"★★☆"},"related_words":{"derivatives":["expressionism (noun)","expressionistic (adjective)","expressionist (noun/adjective)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"expressionistically\" is an adverb that describes something done in the style of expressionism. Expressionism is an artistic movement that emphasizes subjective feeling and intense emotional expression over objective reality. The word is typically used in discussions of art, literature, and film. It is not a common word in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The play was staged expressionistically, with stark sets and exaggerated performances.","translation":"その劇は表現主義的に演出され、簡素な舞台セットと誇張された演技が用いられた。","type":"general","meaning_category":"style"},{"sentence":"The writer described the scene expressionistically, focusing on the character's inner turmoil.","translation":"その作家は、登場人物の内面の葛藤に焦点を当て、表現主義的にその場面を描写した。","type":"general","meaning_category":"style"}]}