{"word":"cup-tossing","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A divination method involving interpreting the patterns formed by tea leaves, coffee grounds, or other sediment left in a cup after drinking.","english_definition":"The practice of telling fortunes by interpreting the patterns of tea leaves, coffee grounds, or other sediment left in a cup after drinking.","examples":[{"sentence":"She learned cup-tossing from her grandmother, who was known for her accurate predictions.","translation":"彼女は正確な予測で知られていた祖母からカップ占い（茶葉占い）を学んだ。"},{"sentence":"The fortune teller offered a cup-tossing session to reveal insights into my future.","translation":"占い師は私の未来についての洞察を明らかにするために、カップ占い（茶葉占い）のセッションを提供した。"}],"collocations":["practice cup-tossing","learn cup-tossing","offer cup-tossing sessions","interpret cup-tossing patterns"],"synonyms":["tasseography","tasseomancy","tea leaf reading","coffee ground reading"],"antonyms":[]}],"etymology":{"value":"Derived from the practice of tossing or swirling a cup to distribute the tea leaves or coffee grounds, followed by interpreting the resulting patterns.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkʌpˌtɔsɪŋ/","syllables":"cup-tos-sing"},"inflection":{"noun_plural":"N/A (uncountable)"},"usage_notes":{"explanation":"Cup-tossing, also known as tasseography or tasseomancy, is a traditional method of divination used to gain insights into the future or to understand current situations. The process involves drinking tea or coffee, leaving a small amount of liquid with sediment at the bottom of the cup, swirling the cup, and then interpreting the shapes and patterns formed by the sediment. This practice is often associated with fortune-telling and cultural traditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I read a cup-tossing yesterday.","correct":"✓ I had a cup-tossing session yesterday.","note":"'Cup-tossing' refers to the practice itself. To describe an instance of having your fortune read, use 'cup-tossing session'."},{"incorrect":"✗ Cup-tossing are an ancient art.","correct":"✓ Cup-tossing is an ancient art.","note":"'Cup-tossing' as a practice is singular, so use the singular verb 'is'."}],"priority":"★★☆"},"related_words":{"derivatives":["tasseography","tasseomancy"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low Frequency","priority":"★★★"},"readability_explanation":{"level":"C2","text":"'Cup-tossing' refers to a specific divination practice involving tea leaves or coffee grounds. Understanding this term requires familiarity with divination and fortune-telling traditions. The word itself is straightforward, but the concept may be unfamiliar to those outside of specific cultural contexts. The term is relatively uncommon in everyday conversation, making it more suitable for advanced learners or those with a specific interest in the topic."},"example_sentences":[{"sentence":"The old woman specialized in cup-tossing, reading fortunes from the patterns of tea leaves.","translation":"その老女はカップ占いを専門とし、茶葉の模様から運勢を読み取っていた。","type":"noun","meaning_category":"Divination"},{"sentence":"After finishing her Turkish coffee, she prepared the cup for cup-tossing.","translation":"彼女はトルココーヒーを飲み終えた後、カップ占い（コーヒー占い）の準備をした。","type":"noun","meaning_category":"Divination"}]}