{"word":"republicanisation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"共和制化、共和主義化","english_definition":"The process of making a country or system more republican; the adoption or promotion of republican principles.","examples":[{"sentence":"The republicanisation of the education system was a key policy of the new government.","translation":"教育制度の共和制化は、新政府の重要な政策でした。"},{"sentence":"The movement advocated for the republicanisation of the monarchy.","translation":"その運動は君主制の共和制化を主張しました。"}],"collocations":["complete republicanisation","gradual republicanisation","republicanisation movement","republicanisation policy"],"synonyms":["democratization","republicanism","political reform"],"antonyms":["monarchism","autocracy"]}],"etymology":{"value":"\"Republican\" + \"-isation\".  Republican comes from republic, from Latin res publica \"a public affair\". -isation is a suffix denoting a process or action.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˌpʌblɪkənaɪˈzeɪʃən/","syllables":"re-pub-li-ca-ni-sa-tion"},"inflection":{"noun_plural":"republicanisations"},"usage_notes":{"explanation":"Republicanisation refers to the process of transitioning a political system or institution toward republican principles. This often involves replacing monarchical or autocratic elements with democratic and representative structures. The term is most commonly used in political science and history.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The republicanization was happen quickly.","correct":"✓ The republicanisation happened quickly.","note":"Republicanisation is a noun, so it should be used as the subject of the sentence.  'Happen' is a verb, so the noun form is needed."},{"incorrect":"✗ They are republicanising the country.","correct":"✓ They are undertaking the republicanisation of the country.","note":"While 'republicanise' is a verb, 'republicanisation' as a noun is often used to describe the overall process."}],"priority":"★★☆"},"related_words":{"derivatives":["republicanise (verb)","republican (adjective, noun)","republicanism (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'republicanisation' is a complex term related to political science and history, specifically referring to the process of making a country or system more republican. It is not commonly used in everyday conversation and is more likely to appear in academic or political contexts. Understanding this word requires familiarity with the concept of republicanism and political systems. "},"example_sentences":[{"sentence":"The French Revolution led to the republicanisation of France.","translation":"フランス革命はフランスの共和制化につながった。","type":"general","meaning_category":"historical event"},{"sentence":"The government implemented several policies aimed at the republicanisation of the civil service.","translation":"政府は公務員の共和制化を目的としたいくつかの政策を実施した。","type":"policy","meaning_category":"political reform"},{"sentence":"The republicanisation of the media landscape is a complex and ongoing process.","translation":"メディア環境の共和制化は複雑で進行中のプロセスです。","type":"current affairs","meaning_category":"political reform"}]}