{"word":"harmotomic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(数学)調和的な、調和平均に関する","english_definition":"(mathematics) relating to or exhibiting harmonic motion, a harmonic series, or a harmonic mean.","examples":[{"sentence":"The harmotomic mean is a type of average that is useful in certain situations.","translation":"調和平均は、特定の状況で役立つ平均の一種です。"},{"sentence":"Harmotomic functions are important in the study of partial differential equations.","translation":"調和関数は、偏微分方程式の研究において重要です。"}],"collocations":["harmotomic mean (調和平均)","harmotomic function (調和関数)","harmotomic series (調和級数)"],"synonyms":["harmonic"],"antonyms":["arithmetic","geometric"]}],"etymology":{"value":"The term \"harmotomic\" is derived from \"harmonic\" and refers to mathematical properties related to harmonic series and means.","priority":"★★☆"},"pronunciation":{"ipa":"/hɑːrˌmoʊˈtɒmɪk/","syllables":"har-mo-tom-ic"},"inflection":{"notes":"The word 'harmotomic' is an adjective and does not have plural forms or different inflections."},"usage_notes":{"explanation":"The term 'harmotomic' is primarily used in mathematical contexts, specifically when discussing harmonic means, harmonic series, or harmonic functions. It is a more specialized term than 'harmonic' and is often used to emphasize the specific mathematical properties being discussed.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The harmotomic color of the painting was beautiful.","correct":"✓ The harmonic color of the painting was beautiful.","note":"'Harmotomic' is specific to mathematical contexts. Use 'harmonic' when referring to general harmony or aesthetics."}],"priority":"★★☆"},"related_words":{"derivatives":["harmonic (形容詞: 調和的な)","harmonic mean (名詞: 調和平均)","harmonic series (名詞: 調和級数)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized mathematical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'harmotomic' is highly specialized and primarily used within advanced mathematical contexts. It refers to properties related to harmonic means, series, or functions, and is not commonly encountered outside of these specific areas of study. Understanding requires a strong background in mathematics. "},"example_sentences":[{"sentence":"The harmotomic mean of 2 and 8 is 3.2.","translation":"2と8の調和平均は3.2です。","type":"adjective","meaning_category":"mathematical"},{"sentence":"The harmotomic series diverges, although it does so very slowly.","translation":"調和級数は発散しますが、その速度は非常に遅いです。","type":"adjective","meaning_category":"mathematical"}]}