{"word":"intellectualism","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"知性主義、知識偏重主義、知的活動重視","english_definition":"the exercise of the intellect at the expense of emotions; devotion to intellectual pursuits; the doctrine that knowledge is wholly or chiefly derived from pure reason.","examples":[{"sentence":"His intellectualism made him seem aloof and detached from everyday concerns.","translation":"彼の知性主義は、彼を日常的な関心事からかけ離れた、よそよそしい存在に見させた。"},{"sentence":"The university fostered an atmosphere of intellectualism, encouraging students to engage in critical thinking and debate.","translation":"その大学は知性主義の雰囲気を醸成し、学生たちが批判的思考や討論に参加することを奨励した。"},{"sentence":"Some critics argue that modern society suffers from an excess of intellectualism, neglecting the importance of emotional intelligence.","translation":"一部の批評家は、現代社会は知識偏重主義に陥っており、感情的知性の重要性を軽視していると主張する。"}],"collocations":["academic intellectualism (学術的知性主義)","political intellectualism (政治的知性主義)","philosophical intellectualism (哲学的知性主義)","embrace intellectualism (知性主義を受け入れる)","reject intellectualism (知性主義を拒否する)","foster intellectualism (知性主義を育む)","promote intellectualism (知性主義を促進する)"],"synonyms":["rationalism","cerebralism","highbrowism","erudition","scholarship","intellectuality"],"antonyms":["emotionalism","irrationality","anti-intellectualism","philistinism","sentimentalism"]}],"etymology":{"value":"Derived from 'intellectual' + '-ism'. 'Intellectual' comes from Latin 'intellectualis', pertaining to the intellect. '-ism' is a suffix denoting a doctrine, principle, or practice.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪntəˈlektʃuəlɪzəm/","syllables":"in-tel-lec-tu-al-ism"},"inflection":{"notes":"This is a noun and does not inflect."},"usage_notes":{"explanation":"'Intellectualism' can have both positive and negative connotations. Positively, it refers to a commitment to intellectual pursuits, critical thinking, and the pursuit of knowledge. Negatively, it can imply an excessive focus on intellect at the expense of emotions, practical considerations, or common sense. It is often used to describe a philosophical or cultural movement that emphasizes reason and logic as the primary sources of knowledge.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a person of intellectualism.","correct":"✓ He is an intellectual. / ✓ He possesses intellectualism.","note":"'Intellectualism' is a concept or a system of thought, not a personal attribute. Use 'intellectual' to describe a person who is highly intelligent and enjoys intellectual pursuits."},{"incorrect":"✗ Intellectualism is always good.","correct":"✓ Intellectualism can be beneficial, but it should be balanced with emotional intelligence.","note":"While intellectualism has its merits, it's important to acknowledge that an overemphasis on intellect can lead to detachment from emotions and practical concerns. A balanced approach is often more effective."}],"priority":"★★☆"},"related_words":{"derivatives":["intellectual (noun, adjective)","intellect (noun)","intellectualize (verb)","intellectually (adverb)"],"idioms_phrases":["ivory tower (隔離された学問の世界)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in academic and philosophical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Intellectualism' is a complex term that refers to the emphasis on intellect and reason, often in academic or philosophical contexts. It can describe a dedication to intellectual pursuits or, more critically, an overreliance on intellect at the expense of emotions or practical considerations. The word is frequently used in discussions about education, culture, and the role of intellectuals in society. Understanding the nuances of 'intellectualism' requires familiarity with abstract concepts and critical thinking skills."},"example_sentences":[{"sentence":"The rise of scientific thinking in the 17th century marked a significant shift towards intellectualism.","translation":"17世紀の科学的思考の台頭は、知性主義への大きな転換を示した。","type":"general","meaning_category":"general"},{"sentence":"Some argue that the modern emphasis on standardized testing stifles true intellectualism in schools.","translation":"現代の標準化されたテストの重視は、学校における真の知性主義を阻害していると主張する人もいる。","type":"education","meaning_category":"education"},{"sentence":"Her intellectualism was evident in her ability to analyze complex issues and articulate her ideas clearly.","translation":"彼女の知性主義は、複雑な問題を分析し、自分の考えを明確に表現する能力に明らかだった。","type":"personal attribute","meaning_category":"personal attribute"},{"sentence":"The movement was criticized for its elitist intellectualism, which alienated many ordinary people.","translation":"その運動は、多くの一般の人々を疎外するエリート主義的な知性主義であると批判された。","type":"criticism","meaning_category":"criticism"}]}