{"word":"Typhoean","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"テュポーン（ギリシア神話の怪物）の、テュポーンのような","english_definition":"Of or relating to Typhon (a monstrous giant in Greek mythology); resembling Typhon.","examples":[{"sentence":"The Typhoean rage of the storm was terrifying.","translation":"嵐のテュポーンのような激怒は恐ろしかった。"},{"sentence":"The creature had a Typhoean appearance, with multiple heads and serpentine features.","translation":"その生物は複数の頭と蛇のような特徴を持ち、テュポーンのような外見をしていた。"}],"collocations":["Typhoean rage","Typhoean monster","Typhoean forces"],"synonyms":["monstrous","gigantic","destructive","chaotic"],"antonyms":["gentle","peaceful","benevolent"]},{"part_of_speech":"noun","definition":"テュポーンに関連するもの、テュポーンのようなもの","english_definition":"Something related to or resembling Typhon.","examples":[{"sentence":"The volcanic eruption was a Typhoean event, shaking the earth and filling the sky with ash.","translation":"その火山噴火は、地球を揺るがし、空を火山灰で満たす、テュポーンのような出来事だった。"}],"collocations":["a Typhoean outburst","a Typhoean force"],"synonyms":["cataclysm","monster"],"antonyms":[]}],"etymology":{"value":"From Typhon, the name of a monstrous giant in Greek mythology, often associated with storms and volcanic activity. The suffix '-ean' indicates belonging or relating to.","priority":"★★★"},"pronunciation":{"ipa":"/taɪˈfiːən/","syllables":"Ty-pho-e-an"},"inflection":{"notes":"Adjective forms: comparative - more Typhoean, superlative - most Typhoean. Noun form is rare, but can be pluralized as Typhoeans."},"usage_notes":{"explanation":"The term 'Typhoean' is relatively rare and primarily used in literary or mythological contexts to describe something that is monstrous, chaotic, or destructive, reminiscent of the mythological figure Typhon. It can also be used metaphorically to describe powerful natural forces or events.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The typhoon was typhoean.","correct":"✓ The typhoon was Typhonic.","note":"While 'Typhoean' and 'Typhonic' are related, 'Typhonic' is more commonly used to describe things related to typhoons (tropical cyclones). 'Typhoean' is more specifically linked to the mythological figure Typhon."}],"priority":"★★☆"},"related_words":{"derivatives":["Typhon","Typhonic"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Typhoean' is a sophisticated term primarily encountered in literature, mythology, or specialized academic contexts. Understanding requires familiarity with Greek mythology, specifically the figure of Typhon, a monstrous and destructive giant. The word is used to describe something that possesses similar qualities of monstrousness, chaos, or destructiveness. Due to its rarity and specific cultural reference, it is not typically used in everyday conversation."},"example_sentences":[{"sentence":"The earthquake unleashed a Typhoean fury upon the coastal cities.","translation":"地震は沿岸都市にテュポーンのような激怒を解き放った。","type":"adjective","meaning_category":"destructive force"},{"sentence":"The artist depicted the monster with Typhoean features, emphasizing its grotesque and terrifying nature.","translation":"芸術家は怪物をテュポーンのような特徴で描き、そのグロテスクで恐ろしい性質を強調した。","type":"adjective","meaning_category":"monstrous appearance"}]}