{"word":"tulchan","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史)偽の司教、名ばかりの司教 (スコットランドの歴史において、教会の財産を管理するために任命されたが、実際には貴族の利益のために働いた司教)","english_definition":"(historical) a false bishop; a nominal bishop (in Scottish history, a bishop appointed to manage church property but actually working for the benefit of a nobleman).","examples":[{"sentence":"The Earl of Argyll appointed his own tulchan to control the church lands.","translation":"アーガイル伯爵は教会の土地を管理するために、彼自身の偽の司教を任命した。"},{"sentence":"Many saw the tulchan bishops as a corrupt system that exploited the church's wealth.","translation":"多くの人々は、偽の司教たちを教会の富を搾取する腐敗したシステムと見なした。"}],"collocations":["tulchan bishop","appoint a tulchan","tulchan system"],"synonyms":["nominal bishop","puppet bishop","sham bishop"],"antonyms":[]}],"etymology":{"value":"スコットランド・ゲール語の「tulachan」（小さな丘、塚）に由来する。比喩的に、子牛の皮を詰めて作った偽の牛を意味し、乳を搾るために親牛をだますために使われた。同様に、tulchan bishopは、教会の財産を搾取するために貴族によって利用された。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʌltʃən/","syllables":"tul-chan"},"inflection":{"noun_plural":"tulchans"},"usage_notes":{"explanation":"「**tulchan**」は、主にスコットランドの歴史において使われる言葉で、現代英語ではほとんど使われません。これは、16世紀から17世紀にかけて、スコットランドの教会制度において、貴族が教会の財産を管理するために任命した、名ばかりの司教を指します。この言葉は、搾乳するために親牛を欺くために使われた、子牛の皮で作られた偽の牛に由来します。tulchan bishopsは、教会の利益よりも貴族の利益を優先したため、しばしば批判されました。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a tulchan of the forest.","correct":"✓ (This sentence doesn't make sense. Tulchan refers to a specific historical context.)","note":"「tulchan」は、特定の歴史的背景（スコットランドの教会制度）でのみ意味を持ちます。一般的な文脈で使用することはできません。"},{"incorrect":"✗ The tulchan was a real bishop.","correct":"✓ The tulchan was a nominal bishop, controlled by a nobleman.","note":"「tulchan」は名ばかりの司教であり、貴族によって操られていました。本物の司教ではありません。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"related_historical_terms":["Scottish Reformation","Episcopacy","Presbyterianism"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (非常にまれな単語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - ほとんど歴史的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**tulchan**」は非常に特殊で、歴史的な意味合いを持つ単語です。スコットランドの歴史、特に16世紀から17世紀の教会制度に精通している人でない限り、この単語に出会うことはほとんどありません。この単語は、貴族が教会の財産を管理するために任命した、名ばかりの司教を指します。この司教は、実際には教会の利益よりも貴族の利益を優先するため、批判の対象となりました。現代英語ではほとんど使われません。"},"example_sentences":[{"sentence":"The appointment of the tulchan was a controversial move by the Duke.","translation":"偽の司教の任命は、公爵による物議を醸す動きだった。","type":"noun","meaning_category":"歴史的な偽の司教"},{"sentence":"The tulchan system was eventually abolished, leading to reforms in the church.","translation":"偽の司教制度は最終的に廃止され、教会改革につながった。","type":"noun","meaning_category":"歴史的な偽の司教"}]}