{"word":"Weberian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"マックス・ヴェーバー（Max Weber）の、または彼に関連する","english_definition":"Relating to or characteristic of the sociological theories or methodology of Max Weber.","examples":[{"sentence":"Weberian sociology emphasizes the importance of understanding the subjective meanings individuals attach to their actions.","translation":"ヴェーバー社会学は、個人が自身の行動に付与する主観的な意味を理解することの重要性を強調する。"},{"sentence":"The Weberian model of bureaucracy is characterized by hierarchy, specialization, and impersonal rules.","translation":"ヴェーバーの官僚制モデルは、階層、専門化、および非個人的な規則によって特徴付けられる。"}],"collocations":["Weberian sociology","Weberian bureaucracy","Weberian analysis","Weberian theory"],"synonyms":["Weberian","Max Weber's","relating to Max Weber"],"antonyms":[]},{"part_of_speech":"noun","definition":"マックス・ヴェーバーの信奉者、または彼の理論を研究する人","english_definition":"A follower of Max Weber or someone who studies his theories.","examples":[{"sentence":"Weberians often debate the relevance of his ideas in contemporary society.","translation":"ヴェーバー主義者は、現代社会における彼の思想の妥当性についてしばしば議論する。"}],"collocations":["leading Weberians","contemporary Weberians"],"synonyms":["Weber scholar","Weber follower"],"antonyms":[]}],"etymology":{"value":"Derived from the name of Max Weber (1864-1920), a German sociologist, philosopher, jurist, and political economist, plus the suffix '-ian' indicating association or origin.","priority":"★★★"},"pronunciation":{"ipa":"/wɪˈbɪəriən/","syllables":"We-ber-i-an"},"inflection":{"noun_plural":"Weberians"},"usage_notes":{"explanation":"The term \"Weberian\" is primarily used in academic contexts, especially in sociology, political science, and economics, to refer to concepts, theories, or approaches developed by or associated with Max Weber. It often implies a focus on rationalization, bureaucracy, the Protestant ethic, and the subjective understanding of social action.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Weberian is a good person.","correct":"✓ A Weberian is a scholar of Weber's work.","note":"\"Weberian\" as a noun refers to someone who studies or follows Weber's theories, not necessarily someone who is morally good."}],"priority":"★★☆"},"related_words":{"derivatives":["Weber","Weberism","Weberianism"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in academic writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"Weberian\" is a specialized term primarily used in academic fields such as sociology, political science, and economics. It refers to ideas, theories, or methodologies associated with the German sociologist Max Weber. Understanding this term requires familiarity with Weber's key concepts, such as bureaucracy, rationalization, and the Protestant ethic. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The professor gave a lecture on **Weberian** perspectives on social stratification.","translation":"教授は社会階層に関するヴェーバー的な視点について講義を行った。","type":"adjective","meaning_category":"relating to Max Weber"},{"sentence":"Many **Weberians** argue that his theories are still relevant today.","translation":"多くのヴェーバー主義者は、彼の理論が今日でも妥当であると主張する。","type":"noun","meaning_category":"follower of Max Weber"}]}