{"word":"adenovirus","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"アデノウイルス","english_definition":"A group of viruses that can cause a variety of illnesses, including the common cold, bronchitis, pneumonia, diarrhea, pinkeye (conjunctivitis), and cystitis.","examples":[{"sentence":"Adenovirus infections are common, especially in children.","translation":"アデノウイルス感染症は一般的で、特に子供によく見られます。"},{"sentence":"The doctor suspects an adenovirus is causing the patient's respiratory symptoms.","translation":"医師は、アデノウイルスが患者の呼吸器症状を引き起こしている疑いを持っています。"},{"sentence":"Adenoviruses can spread through the air, by close personal contact, or through contaminated surfaces.","translation":"アデノウイルスは、空気感染、濃厚接触、または汚染された表面を介して感染が広がることがあります。"}],"collocations":["adenovirus infection","adenovirus pneumonia","adenovirus conjunctivitis","adenovirus vaccine"],"synonyms":["virus"],"antonyms":[]}],"etymology":{"value":"Derived from 'adeno-' (from Greek 'adēn' meaning 'gland', referring to the adenoid tissue from which the virus was first isolated) and 'virus'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌædɪnoʊˈvaɪrəs/","syllables":"ad-e-no-vi-rus"},"inflection":{"noun_plural":"adenoviruses"},"usage_notes":{"explanation":"Adenoviruses are a group of common viruses that can cause a range of illnesses. While many adenovirus infections cause mild symptoms, some can be more serious, especially in people with weakened immune systems or underlying respiratory or cardiac diseases. There are many different types (serotypes) of adenoviruses, and infection with one type does not necessarily provide immunity against other types.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Adenovirus are a virus.","correct":"✓ Adenovirus is a virus.","note":"'Adenovirus' is a singular noun, so it takes a singular verb ('is')."},{"incorrect":"✗ I have a adenovirus.","correct":"✓ I have an adenovirus infection.","note":"It's more common to say 'adenovirus infection' rather than 'adenovirus' alone when referring to the illness. If you mean the virus itself, you can say 'I have adenovirus' but the infection is more common."}],"priority":"★★☆"},"related_words":{"derivatives":["adenoviral (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2 (in medical contexts)","frequency_google_ngram":"Relatively low frequency, primarily used in medical and scientific contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Adenovirus' is a term primarily used in medical and scientific contexts. It refers to a group of viruses that can cause various illnesses, such as the common cold, conjunctivitis, and pneumonia. The term is most likely to be encountered in discussions about infectious diseases, public health, or medical research. Understanding the term is important for comprehending information related to viral infections and their impact on health.","priority":"★★☆"},"example_sentences":[{"sentence":"The patient was diagnosed with adenovirus pneumonia.","translation":"患者はアデノウイルス肺炎と診断されました。","type":"medical","meaning_category":"illness"},{"sentence":"Adenovirus vectors are used in some gene therapies.","translation":"アデノウイルスベクターは、一部の遺伝子治療で使用されています。","type":"scientific","meaning_category":"medical research"},{"sentence":"Schools often see outbreaks of adenovirus infections.","translation":"学校では、アデノウイルス感染症の集団発生がよく見られます。","type":"public health","meaning_category":"disease outbreak"}]}