{"word":"electrofusion","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"電気融着（電熱融着）","english_definition":"A welding process used to join plastic pipes and fittings using electrical resistance to generate heat.","examples":[{"sentence":"Electrofusion is commonly used for joining polyethylene (PE) and polypropylene (PP) pipes.","translation":"電気融着は、ポリエチレン（PE）およびポリプロピレン（PP）パイプの接合によく使用されます。"},{"sentence":"The electrofusion fitting contains a heating coil that melts the plastic when electricity is applied.","translation":"電気融着継手には、電気を流すとプラスチックを溶かす発熱コイルが含まれています。"},{"sentence":"Proper surface preparation is crucial for a successful electrofusion joint.","translation":"電気融着による接合を成功させるには、適切な表面処理が不可欠です。"}],"collocations":["electrofusion fitting","electrofusion welding","electrofusion joint","electrofusion coupler","electrofusion process"],"synonyms":["heat fusion","resistance welding"],"antonyms":[]}],"etymology":{"value":"\"Electro-\" (electricity) + \"fusion\" (melting, joining). The term describes the process of fusing materials together using electrical resistance to generate heat.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˌlɛktroʊˈfjuːʒən/","syllables":"e-lec-tro-fu-sion"},"inflection":{"notes":"単数形"},"usage_notes":{"explanation":"Electrofusion is a specific type of welding process primarily used for joining plastic pipes and fittings. It involves using a fitting with an embedded heating element. When electricity is applied, the heating element melts the plastic, creating a strong, leak-proof joint. The process requires careful control of parameters like voltage and fusion time to ensure a reliable connection.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ electro fusion","correct":"✓ electrofusion","note":"The term is typically written as one word, 'electrofusion,' not two separate words."},{"incorrect":"✗ electrofusioning","correct":"✓ electrofusion","note":"'Electrofusion' is primarily used as a noun. While you can describe the *process* of performing electrofusion, the term itself doesn't typically take an '-ing' form."}],"priority":"★★☆"},"related_words":{"derivatives":["electrofusible (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency, technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Electrofusion' is a technical term referring to a specific welding process used to join plastic pipes. It involves using a fitting with a built-in heating element that melts the plastic to create a strong joint. The process requires careful control and is commonly used for polyethylene and polypropylene pipes. Because it's a specialized term, it's not commonly used in everyday conversation but is important in engineering and construction contexts. Understanding the term requires familiarity with welding and plastic materials."},"example_sentences":[{"sentence":"The gas company used **electrofusion** to repair the damaged pipeline.","translation":"ガス会社は、損傷したパイプラインを修理するために電気融着を使用しました。","type":"noun","meaning_category":"welding process"},{"sentence":"The **electrofusion** fitting ensures a leak-proof connection between the pipes.","translation":"電気融着継手は、パイプ間の漏れのない接続を保証します。","type":"noun","meaning_category":"fitting"},{"sentence":"The technician carefully monitored the **electrofusion** process to prevent overheating.","translation":"技術者は、過熱を防ぐために電気融着プロセスを注意深く監視しました。","type":"noun","meaning_category":"process"}]}