{"word":"dwarfness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"小人症、矮小症","english_definition":"The state or condition of being a dwarf; smallness; stunted growth.","examples":[{"sentence":"The child's dwarfness was apparent from a young age.","translation":"その子供の小人症は幼い頃から明らかだった。"},{"sentence":"Dwarfness can be caused by a variety of genetic or hormonal factors.","translation":"小人症は、さまざまな遺伝的またはホルモン的要因によって引き起こされる可能性がある。"}],"collocations":["genetic dwarfness (遺伝性の小人症)","hormonal dwarfness (ホルモン性の小人症)"],"synonyms":["short stature","nanism","microsomia"],"antonyms":["gigantism","tallness","largeness"]}],"etymology":{"value":"\"Dwarf\" + \"-ness\". \"Dwarf\" comes from Old English \"dweorg\", referring to a mythical being of small stature. The suffix \"-ness\" indicates a state or condition.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdwɔːfnəs/","syllables":"dwarf-ness"},"inflection":{"noun_plural":"dwarfnesses (rarely used)"},"usage_notes":{"explanation":"\"Dwarfness\" refers to the condition of being a dwarf, typically characterized by significantly reduced height. It is a medical term, though sometimes considered insensitive, and \"short stature\" is often preferred. The term can also refer to the general quality of being small or stunted.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a dwarfness.","correct":"✓ He has dwarfism. / ✓ He has dwarfness.","note":"While \"dwarfness\" is a valid term, \"dwarfism\" is more commonly used in medical contexts."}],"priority":"★★☆"},"related_words":{"derivatives":["dwarf (noun, adjective, verb)","dwarfism (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word \"dwarfness\" is a relatively uncommon term referring to the condition of being a dwarf or having short stature. It is often used in medical or scientific contexts. While understandable, the term \"dwarfism\" is more frequently used to describe the medical condition. The word is formed by adding the suffix \"-ness\" to the word \"dwarf,\" indicating a state or quality."},"example_sentences":[{"sentence":"The study examined the genetic causes of dwarfness in certain populations.","translation":"その研究は、特定の集団における小人症の遺伝的要因を調査した。","type":"noun","meaning_category":"medical condition"},{"sentence":"The dwarfness of the bonsai tree was carefully maintained through pruning.","translation":"盆栽の矮小性は、剪定によって注意深く維持された。","type":"noun","meaning_category":"small size"}]}