{"word":"bunglingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"下手くそに、不器用に、しくじって","english_definition":"in a clumsy or inept manner; awkwardly; incompetently.","examples":[{"sentence":"He bunglingly tried to fix the shelf, but it only made things worse.","translation":"彼は棚を下手くそに修理しようとしたが、事態を悪化させただけだった。"},{"sentence":"The project was bunglingly managed and ultimately failed.","translation":"そのプロジェクトは不器用に管理され、最終的に失敗した。"},{"sentence":"She bunglingly apologized, making the situation even more awkward.","translation":"彼女は下手くそに謝罪し、状況をさらに気まずくした。"}],"collocations":["handle something bunglingly (何かを下手くそに扱う)","manage something bunglingly (何かを不器用に管理する)","attempt something bunglingly (何かを下手くそに試みる)"],"synonyms":["clumsily","awkwardly","ineptly","incompetently","unskillfully","maladroitly","ham-fistedly"],"antonyms":["skillfully","adeptly","competently","deftly","gracefully"]}],"etymology":{"value":"Derived from the adjective 'bungling' (clumsy, inept) by adding the suffix '-ly' to form an adverb. 'Bungling' itself is likely derived from 'bungle,' meaning to perform a task clumsily or incompetently.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbʌŋɡlɪŋli/","syllables":"bung-gling-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Bunglingly' describes the manner in which an action is performed, emphasizing the lack of skill or competence involved. It suggests a level of clumsiness or ineptitude that results in a poor outcome. The word is relatively uncommon in everyday speech but can be used to add emphasis to the poor quality of an action.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He bunglingly is doing the job.","correct":"✓ He is doing the job bunglingly.","note":"Adverbs of manner (like 'bunglingly') typically follow the verb or the object of the verb, rather than being placed between the subject and the verb."},{"incorrect":"✗ She acted bungling.","correct":"✓ She acted bunglingly.","note":"'Bunglingly' is an adverb and should be used to modify a verb. 'Bungling' (without the -ly) is an adjective. If you want to use an adjective, you would need a linking verb: 'She is bungling.'"}],"priority":"★★☆"},"related_words":{"derivatives":["bungle (verb: to perform a task clumsily or incompetently; noun: a clumsy or inept performance)","bungler (noun: a person who performs tasks clumsily or incompetently)","bungling (adjective: clumsy, inept)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Uncommon word, likely encountered in advanced texts)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Bunglingly' is an advanced adverb that describes doing something in a clumsy or unskilled way. It's not a common word, so you'll mostly find it in writing, especially when someone wants to emphasize how poorly something was done. If you're not sure about using it, simpler words like 'clumsily' or 'awkwardly' are good alternatives."},"example_sentences":[{"sentence":"The inexperienced technician bunglingly attempted to repair the equipment, causing further damage.","translation":"経験の浅い技術者は、その機器を下手くそに修理しようとし、さらなる損傷を引き起こした。","type":"adverb","meaning_category":"clumsily"},{"sentence":"The government bunglingly handled the crisis, leading to widespread public dissatisfaction.","translation":"政府は危機を不器用に処理し、国民の広範な不満につながった。","type":"adverb","meaning_category":"ineptly"},{"sentence":"He bunglingly tried to hide the evidence, but his nervousness gave him away.","translation":"彼は下手くそに証拠を隠そうとしたが、彼の緊張が彼を裏切った。","type":"adverb","meaning_category":"awkwardly"}]}