{"word":"Pardahs","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(historical) A system of religious and social practices that enforce gender segregation, especially in some Muslim communities. It involves women concealing themselves from men, either through physical segregation of living spaces or through the wearing of concealing clothing such as a burqa or hijab.","english_definition":"A system of religious and social practices that enforce gender segregation, especially in some Muslim communities. It involves women concealing themselves from men, either through physical segregation of living spaces or through the wearing of concealing clothing such as a burqa or hijab.","examples":[{"sentence":"The custom of Pardahs was strictly observed in that household.","translation":"その家庭では、Pardahsの慣習が厳格に守られていた。"},{"sentence":"Many women find Pardahs to be a restrictive practice.","translation":"多くの女性がPardahsを拘束的な慣習だと感じている。"}],"collocations":["observe Pardahs","practice Pardahs","strict Pardahs"],"synonyms":["gender segregation","female seclusion","purdah"],"antonyms":["gender integration","social mixing"],"notes":"Often capitalized, especially when referring to a specific system or practice."}],"etymology":{"value":"From Persian پرده (parda), meaning 'curtain' or 'veil'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɑːrdɑːz/","syllables":"Par-dahs"},"inflection":{"noun_plural":"Pardahs (can be used as singular or plural depending on context)"},"usage_notes":{"explanation":"'Pardahs' refers to the practice of gender segregation, particularly the concealment of women from men. It is often associated with specific cultural and religious contexts, primarily within some Muslim communities. The term can refer to the physical separation of spaces or the wearing of concealing garments.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is wearing pardah.","correct":"✓ She is observing pardah. / ✓ She is wearing a burqa (or hijab).","note":"'Pardah' refers to the system or practice, not the garment itself. Use specific terms like 'burqa' or 'hijab' to describe the clothing."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_concepts":["burqa","hijab","niqab","chador","gender roles","social customs","religious practices"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in academic or cultural discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pardahs' is a term referring to the practice of gender segregation and the veiling of women, primarily within certain Muslim communities. It is a culturally specific term that is often discussed in the context of religious studies, sociology, or cultural anthropology. Understanding the term requires awareness of the social and historical contexts in which it is practiced."},"example_sentences":[{"sentence":"The anthropologist studied the impact of Pardahs on women's social mobility.","translation":"人類学者は、Pardahsが女性の社会的流動性に与える影響を研究した。","type":"noun","meaning_category":"gender segregation"},{"sentence":"In some traditional societies, Pardahs is seen as a symbol of honor and protection for women.","translation":"一部の伝統的な社会では、Pardahsは女性の名誉と保護の象徴と見なされている。","type":"noun","meaning_category":"social custom"}]}