{"word":"reabsolve","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"再び赦免する、再免罪する","english_definition":"To absolve again; to grant absolution a second time.","examples":[{"sentence":"The priest decided to reabsolve the penitent after further confession.","translation":"司祭は、さらなる告解の後、その懺悔者を再び赦免することに決めた。"},{"sentence":"The council considered whether they could reabsolve the knight of his previous transgressions.","translation":"評議会は、騎士の過去の違反行為について、彼を再び免罪できるかどうかを検討した。"}],"collocations":["reabsolve someone of their sins","reabsolve a penitent"],"synonyms":["exonerate","vindicate","acquit","forgive","pardon"],"antonyms":["condemn","convict","accuse","censure"]}],"etymology":{"value":"The word \"reabsolve\" is formed by adding the prefix \"re-\" (meaning \"again\" or \"anew\") to the word \"absolve.\" \"Absolve\" comes from the Latin word \"absolvere,\" which means \"to set free, acquit, complete, finish.\" It is composed of \"ab-\" (from, away) and \"solvere\" (to loosen, release, dissolve).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːəbˈzɒlv/","syllables":"re-ab-solve"},"inflection":{"verb_forms":{"present_simple":["reabsolve","reabsolves"],"past_simple":"reabsolved","past_participle":"reabsolved","present_participle":"reabsolving"}},"usage_notes":{"explanation":"\"Reabsolve\" is a relatively rare word, primarily used in religious contexts, particularly within Christianity, where absolution is a formal declaration of forgiveness of sins. It implies that a previous absolution was either questioned, deemed insufficient, or required renewal due to further transgressions. Outside of religious contexts, its usage is extremely limited.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The judge reabsolved the criminal before the trial.","correct":"✓ The judge acquitted the criminal before the trial.","note":"\"Reabsolve\" usually implies a religious context of forgiveness, while \"acquit\" is more appropriate for legal contexts."},{"incorrect":"✗ He was reabsolved for his good deeds.","correct":"✓ He was rewarded for his good deeds.","note":"\"Reabsolve\" is specifically for forgiveness of sins or wrongdoings, not a general reward for positive actions."}],"priority":"★★☆"},"related_words":{"derivatives":["absolution","absolve","re-absolving"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Word not commonly found in CEFR levels)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"reabsolve\" is a specialized term primarily used in religious contexts, specifically within Christianity. It means to grant absolution again, implying a renewal or repetition of forgiveness. Due to its limited and specific usage, it is not commonly encountered in general English and would be considered advanced vocabulary."},"example_sentences":[{"sentence":"After a period of reflection, the bishop decided to reabsolve the priest.","translation":"熟考の末、司教はその司祭を再び赦免することに決めた。","type":"verb","meaning_category":"Religious context"},{"sentence":"The church has the power to reabsolve those who sincerely repent.","translation":"教会は、心から悔い改める人々を再び赦免する力を持っている。","type":"verb","meaning_category":"Religious context"}]}