{"word":"calefaction","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"加熱、熱すること","english_definition":"The act of heating or warming something.","examples":[{"sentence":"The calefaction of the metal caused it to expand.","translation":"その金属の加熱は、金属を膨張させた。"},{"sentence":"Calefaction is a common process in many industrial applications.","translation":"加熱は多くの産業用途で一般的なプロセスである。"}],"collocations":["process of calefaction","industrial calefaction"],"synonyms":["heating","warming","ignition","combustion"],"antonyms":["cooling","refrigeration","freezing"]},{"part_of_speech":"noun","definition":"(物理学)ライデンフロスト現象。液体が、沸点よりはるかに高い高温の表面に接触したときに、蒸気層を生成し、急速な沸騰を防ぐ現象。","english_definition":"(physics) The Leidenfrost effect; the phenomenon where a liquid, in near contact with a hot surface significantly above its boiling point, produces an insulating vapor layer keeping the liquid from boiling rapidly.","examples":[{"sentence":"Due to calefaction, the water droplets danced on the hot plate.","translation":"加熱のため、水滴は熱いプレートの上で踊った。"},{"sentence":"The Leidenfrost effect, also known as calefaction, is used in some demonstrations.","translation":"ライデンフロスト効果、別名加熱は、いくつかのデモンストレーションで使用される。"}],"collocations":["Leidenfrost effect","calefaction point","calefaction temperature"],"synonyms":["Leidenfrost effect"],"antonyms":[]}],"etymology":{"value":"From Latin calefacere, meaning \"to make warm,\" from calere \"to be warm\" + facere \"to make\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkæləˈfækʃən/","syllables":"ca-le-fac-tion"},"inflection":{"noun_plural":"calefactions"},"usage_notes":{"explanation":"While 'calefaction' generally refers to heating, it is also specifically used in physics to describe the Leidenfrost effect. The context will determine the intended meaning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The calefaction was very cold.","correct":"✓ The calefaction process required high temperatures.","note":"Calefaction refers to heating, so it cannot be cold. The process or object being heated can be at a certain temperature."}],"priority":"★☆☆"},"related_words":{"derivatives":["calefacient (adjective: producing heat; noun: a heating agent)","calefactory (adjective: serving to heat; noun: a room for warming)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Calefaction' is a technical term, primarily used in scientific or industrial contexts to describe the process of heating something. It also has a specific meaning in physics related to the Leidenfrost effect. Due to its specialized usage, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The **calefaction** of the reaction vessel is essential for maintaining the desired reaction rate.","translation":"反応容器の加熱は、所望の反応速度を維持するために不可欠である。","type":"noun","meaning_category":"heating"},{"sentence":"The phenomenon of **calefaction** explains why the liquid doesn't immediately boil on the hot surface.","translation":"加熱の現象は、液体が熱い表面ですぐに沸騰しない理由を説明する。","type":"noun","meaning_category":"Leidenfrost effect"}]}