{"word":"Improbableness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ありそうもないこと、起こりそうもないこと、起こる見込みのなさ、信じがたいこと","english_definition":"The state or quality of being improbable; unlikelihood.","examples":[{"sentence":"The improbableness of his story made it difficult to believe.","translation":"彼の話があまりにもありそうもないことだったので、信じるのが難しかった。"},{"sentence":"She was struck by the improbableness of finding her keys in that location.","translation":"彼女はその場所に鍵があるなんてありえないと思い、驚いた。"},{"sentence":"The improbableness of winning the lottery doesn't stop people from buying tickets.","translation":"宝くじに当たる見込みのなさにもかかわらず、人々はチケットを買い続けている。"}],"collocations":["high improbableness (高い非現実性)","sheer improbableness (全くありえないこと)","inherent improbableness (内在的な非現実性)"],"synonyms":["unlikelihood","impossibility","doubtfulness","uncertainty","remoteness","implausibility","questionableness"],"antonyms":["probability","likelihood","certainty","plausibility","credibility"]}],"etymology":{"value":"\"Improbableness\" is formed from \"improbable\" (not likely to be true or to happen) + \"-ness\" (a suffix denoting a state or quality). \"Improbable\" comes from Latin \"improbalis\" (not provable, unlikely), from \"im-\" (not) + \"probabilis\" (probable).","priority":"★★★"},"pronunciation":{"ipa":"/ɪmˈprɒbəbəlnəs/","syllables":"im-prob-a-ble-ness"},"inflection":{"noun_plural":"Improbablenesses (rarely used)"},"usage_notes":{"explanation":"\"Improbableness\" refers to the degree to which something is unlikely to happen or be true. It is often used when discussing events, situations, or claims that defy expectations or seem highly improbable. It is a formal term and less commonly used in everyday conversation compared to its adjective form, \"improbable.\"","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The improbableness is very high.","correct":"✓ The degree of improbableness is very high.","note":"While grammatically correct, it's more natural to say 'The degree of improbableness' or 'The improbability' is very high."},{"incorrect":"✗ The improbableness of the event was shocked me.","correct":"✓ The improbableness of the event shocked me.","note":"Ensure correct verb tense and subject-verb agreement."}],"priority":"★★☆"},"related_words":{"derivatives":["improbable (adjective)","improbably (adverb)"],"related_terms":["probability","possible","impossible","likely","unlikely"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"improbableness\" is a noun that describes the quality or state of being improbable, or not likely to happen or be true. It's a more formal and less frequently used word than its adjective form, \"improbable.\" You'd use it to discuss the unlikelihood of something, especially in academic or analytical contexts. For example, you might discuss the \"improbableness\" of a certain event occurring given specific circumstances.","example_sentences":[]}}