{"word":"Shadblows","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"アメリカザイフリボク（植物）","english_definition":"plural form of shadblow: A North American tree or shrub of the genus Amelanchier, especially Amelanchier canadensis, having white flowers and small, edible pomes.","examples":[{"sentence":"The shadblows were in full bloom along the riverbank.","translation":"川岸沿いではアメリカザイフリボクが満開だった。"}],"collocations":["shadblow flowers","shadblow tree","shadblow fruit"],"synonyms":["serviceberry","amelanchier"],"antonyms":[]}],"etymology":{"value":"The name \"shadblow\" comes from the early blooming of these trees, which coincides with the time when shad (a type of fish) swim upstream to spawn.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʃædˌbloʊz/","syllables":"shad-blows"},"inflection":{"noun_plural":"Shadblows"},"usage_notes":{"explanation":"\"Shadblows\" is the plural form of \"shadblow,\" referring to multiple trees or shrubs of the Amelanchier genus. It's a relatively uncommon word, mostly used in botanical or regional contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a shadblows in the garden.","correct":"✓ I saw shadblows in the garden. / ✓ I saw a shadblow in the garden.","note":"When referring to multiple trees, use the plural form \"shadblows.\" When referring to a single tree, use the singular form \"shadblow.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["shadblow (singular form)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"shadblows\" is a relatively obscure term referring to a specific type of North American tree or shrub. Due to its specialized nature, it is unlikely to be encountered outside of botanical contexts or regional literature. Understanding this term requires a good vocabulary related to botany and North American flora."},"example_sentences":[{"sentence":"The hillside was covered in shadblows, their white blossoms creating a beautiful scene.","translation":"丘の中腹はアメリカザイフリボクで覆われており、その白い花が美しい景色を作り出していた。","type":"noun","meaning_category":"植物（複数）"},{"sentence":"We collected the ripe fruit from the shadblows to make jam.","translation":"ジャムを作るために、アメリカザイフリボクから熟した果実を集めた。","type":"noun","meaning_category":"植物（複数）"}]}