{"word":"publish-subscribe","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"パブリッシュ・サブスクライブ (pub/sub): メッセージング・パターンの一種で、メッセージの送信者（パブリッシャー）が特定の受信者（サブスクライバー）を意識せずにメッセージを送信し、サブスクライバーは関心のあるトピックやメッセージを購読することでメッセージを受信する。","english_definition":"A messaging pattern where senders of messages (publishers) do not program the messages to be sent directly to specific receivers (subscribers), but instead categorize published messages into classes without knowledge of which subscribers, if any, there may be. Subscribers, in turn, express interest in one or more classes, and only receive messages that are of interest, without knowledge of which publishers, if any, there are.","examples":[{"sentence":"The publish-subscribe pattern allows for loose coupling between components.","translation":"パブリッシュ・サブスクライブ・パターンは、コンポーネント間の疎結合を可能にする。"},{"sentence":"We implemented a publish-subscribe system for real-time data updates.","translation":"リアルタイムのデータ更新のために、パブリッシュ・サブスクライブ・システムを実装した。"},{"sentence":"Message queues are often used to implement publish-subscribe architectures.","translation":"メッセージキューは、パブリッシュ・サブスクライブ・アーキテクチャを実装するためによく使用される。"}],"collocations":["publish-subscribe pattern","publish-subscribe system","implement publish-subscribe","publish-subscribe architecture","message queue publish-subscribe"],"synonyms":["pub/sub","message queuing","event-driven architecture"],"antonyms":["point-to-point messaging","request-response"]}],"etymology":{"value":"「publish」は情報を公開・配信すること、「subscribe」は情報を受け取るために登録することを意味し、これらの動作を組み合わせたパターンを表す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpʌblɪʃ səbˈskraɪb/","syllables":"pub-lish sub-scribe"},"inflection":{"notes":"通常、名詞として使用される。動詞として使用する場合は、「パブリッシュ・サブスクライブ・モデルに従う」のように表現する。"},"usage_notes":{"explanation":"パブリッシュ・サブスクライブは、大規模な分散システムやイベント駆動型アプリケーションでよく使用されるアーキテクチャ・パターンです。パブリッシャーとサブスクライバーが直接通信しないため、システムの柔軟性とスケーラビリティが向上します。メッセージは通常、トピックまたはチャネルに基づいてフィルタリングされます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ publish and subscribe","correct":"✓ publish-subscribe","note":"複合語としてハイフンで繋ぐのが一般的。"},{"incorrect":"✗ The publisher knows who the subscribers are.","correct":"✓ The publisher does not know who the subscribers are.","note":"パブリッシュ・サブスクライブの重要な特徴は、パブリッシャーがサブスクライバーを意識しないこと。"}],"priority":"★★☆"},"related_words":{"derivatives":["publisher","subscriber","topic","channel","message queue","broker"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"低頻度 (Low frequency) - 技術的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**publish-subscribe**」は、ソフトウェア設計におけるアーキテクチャ・パターンの一つで、情報の発信者（publisher）と受信者（subscriber）が直接的に互いを知らなくても、情報を伝達できる仕組みのことです。publisherは特定のtopic（話題）に関する情報を発信し、subscriberは関心のあるtopicをsubscribe（購読）することで、その情報を受け取ります。このパターンは、システムを疎結合にし、柔軟性と拡張性を高める効果があります。専門的なIT分野でよく使われる用語です。"},"example_sentences":[{"sentence":"The company adopted a publish-subscribe model for its internal communication system.","translation":"その会社は、社内コミュニケーションシステムにパブリッシュ・サブスクライブ・モデルを採用した。","type":"noun","meaning_category":"アーキテクチャ・パターン"},{"sentence":"Using publish-subscribe, different microservices can communicate without direct dependencies.","translation":"パブリッシュ・サブスクライブを使用することで、異なるマイクロサービスが直接的な依存関係なしに通信できる。","type":"noun","meaning_category":"アーキテクチャ・パターン"},{"sentence":"The message broker is a key component in a publish-subscribe architecture.","translation":"メッセージブローカーは、パブリッシュ・サブスクライブ・アーキテクチャにおける重要なコンポーネントである。","type":"noun","meaning_category":"アーキテクチャ・パターン"}]}