{"word":"nitently","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"(造語) 意図的に、注意深く (Intentionally, attentively - likely a blend of 'intently' and 'intentionally', but not a standard word)","english_definition":"(Neologism) Intentionally, attentively; likely a blend of 'intently' and 'intentionally', but not a standard word. It suggests doing something with both purpose and focus.","examples":[{"sentence":"He stared nitently at the screen, trying to decipher the code.","translation":"彼はコードを解読しようと、画面を意図的に、かつ注意深く見つめた。","context":"This usage implies both a deliberate act and focused attention."},{"sentence":"She listened nitently to the instructions, wanting to get everything right.","translation":"彼女はすべてを正しく理解しようと、指示を意図的に、かつ注意深く聞いた。","context":"This usage suggests a deliberate effort to pay close attention."}],"collocations":["stare nitently","listen nitently","observe nitently","work nitently"],"synonyms":["intently","intentionally","deliberately","attentively","purposefully","consciously"],"antonyms":["unintentionally","inattentively","carelessly","negligently","accidentally"]}],"etymology":{"value":"A blend of 'intently' and 'intentionally'. 'Intently' comes from 'intent', meaning having purpose or determination. 'Intentionally' comes from 'intention', meaning a plan or aim. The combination suggests doing something with both purpose and focus.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈnɪtəntli/","syllables":"ni-tent-ly"},"inflection":{"notes":"As an adverb, it does not inflect."},"usage_notes":{"explanation":"'Nitently' is not a standard English word. It appears to be a blend (or portmanteau) of 'intently' and 'intentionally'. While not formally recognized, its potential meaning can be inferred from its constituent parts. It suggests doing something with both a clear purpose (intentionally) and focused attention (intently). The word is most likely to appear in informal writing or as a deliberate creative choice.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✓ He nitently went to the store.","correct":"✓ He intentionally went to the store. / ✓ He intently watched the show.","note":"Since 'nitently' is not a standard word, it's best to use either 'intentionally' or 'intently' depending on the intended meaning. If you mean to convey purpose, use 'intentionally'. If you mean to convey focused attention, use 'intently'."}],"priority":"★★★"},"related_words":{"derivatives":[],"related_forms":["intently","intentionally","intent","intention"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (not a standard word)","frequency_google_ngram":"Very low (as it is not a standard word)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Nitently' is a non-standard word, likely a blend of 'intently' and 'intentionally'. Understanding its meaning requires recognizing the constituent parts and inferring the intended combination of purpose and focus. It is not suitable for formal writing and should be used with caution, primarily in creative or informal contexts where the neologism is intentional."},"example_sentences":[{"sentence":"She studied the ancient text nitently, determined to unlock its secrets.","translation":"彼女は古代のテキストを、その秘密を解き明かそうと意図的に、かつ注意深く研究した。","type":"adverb","meaning_category":"Intentionally and attentively"},{"sentence":"He listened nitently to the speaker, absorbing every word.","translation":"彼は講演者の言葉を一つ一つ聞き漏らすまいと、意図的に、かつ注意深く聞いた。","type":"adverb","meaning_category":"Intentionally and attentively"}]}