{"word":"self-cutting","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自傷行為、自切行為","english_definition":"The act of deliberately harming one's own body, such as cutting, burning, or scratching, usually as a way to cope with emotional pain.","examples":[{"sentence":"Self-cutting is often a sign of deeper emotional distress.","translation":"自傷行為は、しばしばより深い感情的な苦痛の兆候です。"},{"sentence":"She turned to self-cutting as a way to deal with her anxiety.","translation":"彼女は不安に対処する方法として自傷行為に頼りました。"},{"sentence":"Support groups can help individuals struggling with self-cutting.","translation":"サポートグループは、自傷行為に苦しんでいる人々を助けることができます。"}],"collocations":["engage in self-cutting (自傷行為を行う)","history of self-cutting (自傷行為の既往歴)","self-cutting behavior (自傷行為)","self-cutting scars (自傷行為の傷跡)","cope with self-cutting (自傷行為に対処する)","overcome self-cutting (自傷行為を克服する)"],"synonyms":["self-harm","self-mutilation","non-suicidal self-injury (NSSI)"],"antonyms":["self-care","self-love","self-compassion"]},{"part_of_speech":"adjective","definition":"自傷行為をする、自切行為を行う","english_definition":"Relating to or characterized by the act of deliberately harming one's own body.","examples":[{"sentence":"The therapist specializes in treating self-cutting patients.","translation":"そのセラピストは、自傷行為をする患者の治療を専門としています。"},{"sentence":"Self-cutting behavior requires professional intervention.","translation":"自傷行為は専門家の介入を必要とします。"},{"sentence":"There are resources available for individuals with self-cutting tendencies.","translation":"自傷行為の傾向がある人のための利用可能なリソースがあります。"}],"collocations":["self-cutting tendencies (自傷行為の傾向)","self-cutting patient (自傷行為をする患者)","self-cutting behavior (自傷行為)"],"synonyms":["self-harming","self-mutilating"],"antonyms":["non-harming","non-violent"]}],"etymology":{"value":"The term 'self-cutting' is a compound word formed from 'self' (referring to oneself) and 'cutting' (the act of using a sharp object to make incisions on the skin). It directly describes the action of cutting oneself.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌselfˈkʌtɪŋ/","syllables":"self-cut-ting"},"inflection":{"notes":"As a noun, it is generally uncountable. As an adjective, it does not have typical inflectional forms."},"usage_notes":{"explanation":"'Self-cutting' is a term used to describe the act of intentionally harming one's own body, most commonly by making cuts on the skin. It is often a coping mechanism for dealing with intense emotional pain, stress, or trauma. It's important to note that self-cutting is not typically a suicide attempt, although it can increase the risk of suicide. The term 'self-harm' is a broader term that encompasses self-cutting as well as other forms of self-injury, such as burning, scratching, hitting, or head-banging. When discussing this topic, it's important to use sensitive and respectful language and to avoid sensationalizing or stigmatizing the behavior.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a self-cut person.","correct":"✓ He is a self-cutting person. / ✓ He engages in self-cutting.","note":"'Self-cut' is not a commonly used term. Use 'self-cutting' as an adjective or describe the behavior directly."},{"incorrect":"✗ Self-cutting is always a suicide attempt.","correct":"✓ Self-cutting is not always a suicide attempt, but it can increase the risk.","note":"It's important to understand that self-cutting is often a coping mechanism, not necessarily a suicide attempt, although it can be a risk factor."}],"priority":"★★☆"},"related_words":{"derivatives":["self-harm","self-mutilation","cutting (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but increasing in usage due to greater awareness of mental health issues.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Self-cutting' is a term specifically referring to the act of intentionally cutting one's own skin, typically as a coping mechanism for emotional distress. It's a subset of the broader term 'self-harm,' which includes various forms of self-inflicted injury. Understanding this term requires sensitivity and awareness of mental health issues. It is important to differentiate self-cutting from suicide attempts, although self-cutting can be a risk factor for suicide. The term is often used in clinical and therapeutic contexts, as well as in discussions about mental health and well-being. Due to the sensitive nature of the topic, it's crucial to use respectful and non-stigmatizing language when discussing self-cutting.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor asked about any history of **self-cutting**.","translation":"医師は自傷行為の既往歴について尋ねました。","type":"noun","meaning_category":"自傷行為"},{"sentence":"She sought therapy to address her **self-cutting** behavior.","translation":"彼女は自傷行為に対処するためにセラピーを受けました。","type":"adjective","meaning_category":"自傷行為をする"},{"sentence":"**Self-cutting** can provide a temporary release from emotional pain.","translation":"自傷行為は一時的に感情的な苦痛からの解放をもたらすことがあります。","type":"noun","meaning_category":"自傷行為"},{"sentence":"The support group focuses on helping individuals overcome **self-cutting**.","translation":"そのサポートグループは、個人が自傷行為を克服するのを支援することに焦点を当てています。","type":"noun","meaning_category":"自傷行為"},{"sentence":"Understanding the reasons behind **self-cutting** is crucial for effective treatment.","translation":"自傷行為の背後にある理由を理解することは、効果的な治療のために重要です。","type":"noun","meaning_category":"自傷行為"}]}