{"word":"Sadducees","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"サドカイ派 (古代ユダヤ教の宗派の一つ。律法を文字通りに解釈し、復活や天使の存在を否定した)","english_definition":"A member of a Jewish sect or party of the time of Jesus Christ that denied the resurrection of the dead, the existence of spirits, and the authority of oral tradition, emphasizing the importance of Temple worship.","examples":[{"sentence":"The Sadducees were known for their strict interpretation of the Torah.","translation":"サドカイ派は、トーラー（モーセ五書）を厳格に解釈することで知られていた。"},{"sentence":"The Gospels describe conflicts between Jesus and the Sadducees.","translation":"福音書には、イエスとサドカイ派の対立が描かれている。"}],"collocations":["the Sadducees and the Pharisees (サドカイ派とパリサイ派)","Sadducee doctrine (サドカイ派の教義)","Sadducee beliefs (サドカイ派の信仰)"],"synonyms":["none - specific religious group"],"antonyms":["Pharisees (パリサイ派)"],"notes":"The Sadducees were primarily associated with the priestly aristocracy and the Temple in Jerusalem."}],"etymology":{"value":"Late Latin *Sadducaei*, from Greek *Saddoukaioi*, from Hebrew *Ṣĕdûqîm*, plural of *Ṣādôqî* 'Zadokite', referring to the priestly family descended from Zadok, who officiated in the Temple of Solomon.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsædjʊˌsiːz/","syllables":"Sad-du-cees"},"inflection":{"noun_plural":"Sadducees (already plural)"},"usage_notes":{"explanation":"The Sadducees were a prominent Jewish sect during the Second Temple period. They held significant political and religious power, particularly through their control of the Temple. Their beliefs differed from those of the Pharisees, another influential Jewish group, especially regarding the afterlife and the interpretation of Jewish law. The Sadducees' influence declined after the destruction of the Second Temple in 70 CE.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Sadducee was a belief.","correct":"✓ Sadducee was a member of a religious group.","note":"Sadducee refers to a person belonging to the Sadducees, not the belief system itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["Sadducean (adjective: サドカイ派の)","Sadducism (noun: サドカイ派の教義)"],"historical_context":["Second Temple period (第二神殿時代)","Pharisees (パリサイ派)","Sanhedrin (サンヘドリン、古代イスラエルの最高法院)","Torah (トーラー、モーセ五書)","Temple in Jerusalem (エルサレム神殿)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low frequency - primarily found in religious or historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Sadducees' refers to a specific Jewish sect that existed during the Second Temple period. Understanding this term requires knowledge of ancient Jewish history and religious movements. They were an aristocratic group associated with the Temple and had theological differences with other groups like the Pharisees. Their beliefs and role are often discussed in religious studies and historical contexts related to Judaism and early Christianity."},"example_sentences":[{"sentence":"The New Testament often mentions the debates between Jesus and the **Sadducees**.","translation":"新約聖書には、イエスとサドカイ派の間の議論がしばしば言及されている。","type":"historical/religious context","meaning_category":"historical/religious group"},{"sentence":"Unlike the Pharisees, the **Sadducees** did not believe in the resurrection of the dead.","translation":"パリサイ派とは異なり、サドカイ派は死者の復活を信じていなかった。","type":"theological difference","meaning_category":"theological difference"},{"sentence":"The **Sadducees** held considerable power in the Sanhedrin.","translation":"サドカイ派はサンヘドリン（古代イスラエルの最高法院）でかなりの権力を持っていた。","type":"political power","meaning_category":"political power"}]}