{"word":"neurasthenically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"神経衰弱的に、神経衰弱の状態で","english_definition":"In a manner characteristic of or related to neurasthenia; in a way that shows symptoms of neurasthenia.","examples":[{"sentence":"He approached the task neurasthenically, overwhelmed by its complexity.","translation":"彼はその仕事の複雑さに圧倒され、神経衰弱的に取り組んだ。"},{"sentence":"She described her feelings neurasthenically, expressing a deep sense of fatigue and anxiety.","translation":"彼女は自身の疲労感と不安感を深く表出し、神経衰弱的に自分の気持ちを説明した。"}],"collocations":["act neurasthenically","describe neurasthenically","feel neurasthenically"],"synonyms":["weakly","feebly","listlessly","apathetically","debilitatedly"],"antonyms":["energetically","vigorously","robustly","healthily"]},{"part_of_speech":"adverb","definition":"過敏に、神経質に","english_definition":"In an overly sensitive or nervous manner.","examples":[{"sentence":"He reacted neurasthenically to the slightest criticism.","translation":"彼はごくわずかな批判にも神経質に反応した。"},{"sentence":"She worried neurasthenically about the smallest details of the event.","translation":"彼女はイベントの細部に至るまで神経質に心配した。"}],"collocations":["react neurasthenically","worry neurasthenically"],"synonyms":["nervously","anxiously","apprehensively","sensitively","irritable"],"antonyms":["calmly","peacefully","placidly","composedly"]}],"etymology":{"value":"The word is formed by adding the suffix '-ly' to the adjective 'neurasthenic'. 'Neurasthenic' comes from 'neurasthenia', a term coined in the late 19th century to describe a condition characterized by fatigue, anxiety, and other nervous symptoms. 'Neurasthenia' is derived from the Greek words 'neuron' (nerve) and 'asthenia' (weakness).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnjʊərəsˈθɛnɪkli/","syllables":"neu-ras-then-i-cal-ly"},"inflection":{"notes":"As an adverb, 'neurasthenically' does not have different forms for gender, number, or case. It modifies verbs, adjectives, or other adverbs."},"usage_notes":{"explanation":"'Neurasthenically' describes actions or states that are characteristic of neurasthenia, a now somewhat outdated term for a condition involving chronic fatigue, anxiety, and a variety of other physical and psychological symptoms. It can also describe someone acting in an overly sensitive or nervous manner. Because 'neurasthenia' is not a commonly used diagnosis today, the word 'neurasthenically' is relatively rare.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He walked neurasthenically down the street, full of energy.","correct":"✓ He walked slowly and weakly down the street, showing signs of fatigue.","note":"'Neurasthenically' implies a lack of energy and a state of exhaustion, so it cannot be used to describe someone full of energy."},{"incorrect":"✗ She smiled neurasthenically, radiating joy and confidence.","correct":"✓ She smiled weakly, trying to hide her fatigue.","note":"A neurasthenic state is characterized by fatigue and a lack of vitality, so it is contradictory to describe someone radiating joy and confidence while acting neurasthenically."}],"priority":"★★☆"},"related_words":{"derivatives":["neurasthenia (noun): 神経衰弱","neurasthenic (adjective): 神経衰弱の、神経衰弱的な"],"related_terms":["asthenia (noun): 無力症、衰弱","neurosis (noun): 神経症","anxiety (noun): 不安","fatigue (noun): 疲労"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"neurasthenically\" is a highly specialized term related to the outdated medical diagnosis of neurasthenia, a condition characterized by chronic fatigue and a variety of other symptoms. It is rarely used in modern English and is most likely to be encountered in older literature or historical contexts. Understanding the word requires familiarity with the concept of neurasthenia and its associated symptoms. Therefore, it is considered a C2 level word due to its low frequency and specialized meaning."},"example_sentences":[{"sentence":"The character in the novel behaved neurasthenically, constantly complaining of fatigue and headaches.","translation":"小説の登場人物は神経衰弱的に振る舞い、常に疲労と頭痛について不満を述べていた。","type":"general","meaning_category":"manner of behavior"},{"sentence":"She described her symptoms neurasthenically, listing a range of physical and emotional complaints.","translation":"彼女は神経衰弱的に自分の症状を説明し、身体的および感情的な不満を列挙した。","type":"general","meaning_category":"manner of description"},{"sentence":"He approached his work neurasthenically, lacking the energy and enthusiasm he once had.","translation":"彼は以前のようなエネルギーと熱意を欠き、神経衰弱的に仕事に取り組んだ。","type":"general","meaning_category":"manner of working"}]}