{"word":"Boonk","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(slang) A person who steals or commits petty crimes, often for attention or social media clout.","english_definition":"(slang) A person who steals or commits petty crimes, often for attention or social media clout.","examples":[{"sentence":"He's such a boonk, always shoplifting and posting it online.","translation":"彼は本当にブーンクだ、いつも万引きしてそれをオンラインに投稿している。"},{"sentence":"Don't be a boonk; it's not cool to steal.","translation":"ブーンクになるな。盗むのはかっこ悪い。"}],"collocations":["boonk gang","boonk life"],"synonyms":["thief","shoplifter","petty criminal","clout chaser"],"antonyms":["law-abiding citizen"]},{"part_of_speech":"verb","definition":"(slang) To steal or commit petty crimes, often for attention or social media clout.","english_definition":"(slang) To steal or commit petty crimes, often for attention or social media clout.","examples":[{"sentence":"They were boonking at the convenience store.","translation":"彼らはコンビニでブーンク行為をしていた。"},{"sentence":"He boonked a candy bar and ran out of the store.","translation":"彼はお菓子をブーンクして店から走り去った。"}],"collocations":["get boonked","go boonking"],"synonyms":["steal","shoplift","commit petty theft"],"antonyms":["pay","purchase"]}],"etymology":{"value":"Likely originated from social media, possibly referencing a specific individual known for such behavior. The exact origin is unclear.","priority":"★☆☆"},"pronunciation":{"ipa":"/buːŋk/","syllables":"boonk"},"inflection":{"verb_forms":{"present_simple":["boonk","boonks"],"past_simple":"boonked","past_participle":"boonked","present_participle":"boonking"},"noun_plural":"boonks"},"usage_notes":{"explanation":"'Boonk' is a slang term that is primarily used by younger generations, especially on social media. It refers to someone who engages in petty theft or other minor illegal activities, often for attention or to gain popularity online. The term carries a negative connotation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a boonk because he works hard.","correct":"✓ He is a boonk because he steals things.","note":"'Boonk' specifically refers to someone who steals or commits petty crimes, not someone who works hard."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Slang, not typically included in CEFR)","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Boonk' is a slang term, primarily used online and among younger people, to describe someone who steals or commits petty crimes, often for attention or social media clout. It's a relatively recent term and not widely understood outside of specific online communities. Due to its slang nature, it's not appropriate for formal contexts."},"example_sentences":[{"sentence":"The group of teenagers were caught boonking snacks from the grocery store.","translation":"その10代のグループは食料品店でお菓子をブーンクしているところを捕まった。","type":"verb","meaning_category":"Stealing"},{"sentence":"He became known as a boonk after posting videos of himself stealing on Instagram.","translation":"彼はインスタグラムで盗みを働く動画を投稿した後、ブーンクとして知られるようになった。","type":"noun","meaning_category":"Petty criminal"}]}