{"word":"Cecrops","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"ケクロプス：アテナイの伝説的な初代の王。上半身は人間、下半身は蛇の姿で描かれる。文化英雄として、結婚制度、埋葬の儀式、文字の導入などをアテナイにもたらしたとされる。","english_definition":"In Greek mythology, Cecrops was the mythical first king of Attica. He was depicted as being half-man, half-snake. He is credited with introducing marriage, burial rites, and writing to Attica.","examples":[{"sentence":"Cecrops was said to be autochthonous, born directly from the earth.","translation":"ケクロプスは土着の民であり、直接大地から生まれたと言われている。"},{"sentence":"The Acropolis was originally called Cecropia in his honor.","translation":"アクロポリスはもともと彼の名誉を称えてケクロピアと呼ばれていた。"}],"collocations":["Cecrops I","King Cecrops","Cecropia (Acropolis)"],"synonyms":["N/A"],"antonyms":["N/A"]}],"etymology":{"value":"ギリシア語の Κέκροψ (Kékrops) に由来。語源は不明。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsiːkrɒps/","syllables":"Ce-crops"},"inflection":{"notes":"固有名詞のため、複数形はありません。"},"usage_notes":{"explanation":"Cecrops はギリシア神話に登場するアテナイの初代王の名前です。神話上の人物であり、歴史的な証拠はありません。美術作品では、上半身が人間、下半身が蛇の姿で描かれることが一般的です。アテナイの文化や社会の基礎を築いた英雄として語り継がれています。","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["Cecropia (アクロポリスの旧名)","Cecropian (ケクロプスの、ケクロプスに由来する)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低い (Very low frequency) - 神話や歴史に関する文脈でのみ見られる。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Cecrops**」は、ギリシャ神話に登場するアテナイの初代王の名前です。この単語は、古代ギリシャの歴史や神話に関する文献を読む場合にのみ遭遇する可能性が高いです。一般的な会話や現代のテキストではほとんど使用されません。アテナイの歴史や文化に興味がある人にとっては重要な単語ですが、一般的な英語学習者にとっては優先度の低い語彙です。"},"example_sentences":[{"sentence":"According to legend, Cecrops judged the contest between Athena and Poseidon for patronage of Athens.","translation":"伝説によると、ケクロプスはアテナとポセイドンがアテネの守護神の座を争った競技の審判を務めた。","type":"noun","meaning_category":"神話上の王"},{"sentence":"The Cecropia moth is named after Cecrops, alluding to the moth's large size and the king's legendary stature.","translation":"ケクロピア蛾は、その蛾の大きさと王の伝説的な地位を暗示して、ケクロプスにちなんで名付けられた。","type":"noun","meaning_category":"その他 (間接的な言及)"}]}