{"word":"nonsocial","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"非社交的な、社会性がない、社会生活を好まない","english_definition":"Not sociable; not enjoying or seeking the company of others.","examples":[{"sentence":"He is a nonsocial person who prefers to spend time alone.","translation":"彼は一人で過ごすことを好む非社交的な人です。"},{"sentence":"The cat's nonsocial behavior made it difficult to introduce it to the other pets.","translation":"その猫の非社交的な行動のせいで、他のペットと馴染ませるのが難しかった。"},{"sentence":"Her nonsocial tendencies were often misinterpreted as rudeness.","translation":"彼女の非社交的な傾向は、しばしば無礼と誤解された。"}],"collocations":["nonsocial behavior","nonsocial activities","nonsocial personality","nonsocial tendencies"],"synonyms":["unsociable","introverted","reclusive","withdrawn","aloof","solitary"],"antonyms":["sociable","gregarious","outgoing","extroverted","social"],"notes":"'Nonsocial' often implies a preference for solitude rather than an inability to socialize."}],"etymology":{"value":"'Non-' (not) + 'social' (relating to society or its organization). First used in the early 20th century.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈsoʊʃəl/","syllables":"non-so-cial"},"inflection":{"notes":"Since 'nonsocial' is an adjective, its inflection is limited to comparative and superlative forms, though these are rarely used: more nonsocial, most nonsocial."},"usage_notes":{"explanation":"'Nonsocial' describes someone or something that is not inclined to participate in social activities or seek social interaction. It is often used to describe personality traits or behaviors. It is distinct from 'antisocial,' which implies active opposition to social norms or harm to others.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is antisocial and nonsocial.","correct":"✓ He is nonsocial, preferring to spend time alone.","note":"While both terms relate to social interaction, 'antisocial' implies a disregard for social norms or the rights of others, whereas 'nonsocial' simply means not seeking or enjoying social interaction. Using both together can be redundant or inaccurate."},{"incorrect":"✗ The nonsocial butterfly.","correct":"✓ The introverted person.","note":"'Nonsocial' describes a lack of interest in social interaction, which contradicts the image of a social butterfly. 'Introverted' might be a more appropriate term."}],"priority":"★★☆"},"related_words":{"derivatives":["nonsocially (adverb)","nonsociality (noun)"],"antonyms":["social","sociable","gregarious","outgoing","extroverted"],"related_terms":["asocial (more severe form of social withdrawal)","antisocial (actively opposed to social norms)","introvert (person who gains energy from solitude)"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Nonsocial' is a word used to describe someone who doesn't enjoy being around other people or participating in social activities. It's important to distinguish it from 'antisocial,' which describes someone who actively goes against social rules or harms others. 'Nonsocial' simply means preferring to be alone or not seeking out social interactions. It's a more neutral term than 'antisocial.'"},"example_sentences":[{"sentence":"Her **nonsocial** nature led her to choose a career that allowed her to work independently.","translation":"彼女の非社交的な性質から、彼女は独立して働くことができるキャリアを選んだ。","type":"adjective","meaning_category":"非社交的な"},{"sentence":"The study examined the **nonsocial** behavior of children with autism.","translation":"その研究は、自閉症の子供たちの非社交的な行動を調べた。","type":"adjective","meaning_category":"社会性がない"},{"sentence":"He adopted a **nonsocial** lifestyle after retiring to the countryside.","translation":"彼は田舎に引退した後、非社交的なライフスタイルを採用した。","type":"adjective","meaning_category":"社会生活を好まない"}]}