{"word":"single-skilled","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"単一の技能しか持たない、単能工の","english_definition":"Having or requiring only one skill; unskilled or semi-skilled.","examples":[{"sentence":"The job requires single-skilled workers to operate the machines.","translation":"その仕事では、機械を操作するための単一の技能しか持たない労働者が必要とされます。"},{"sentence":"He was considered a single-skilled laborer, limiting his employment opportunities.","translation":"彼は単能工とみなされ、雇用機会が限られていました。"}],"collocations":["single-skilled worker (単能工)","single-skilled labor (単一技能労働)"],"synonyms":["unskilled","semi-skilled","limited-skill"],"antonyms":["multi-skilled","versatile","skilled"],"notes":["Often used in contrast to 'multi-skilled' to describe a workforce or individual with limited capabilities."]}],"etymology":{"value":"Combination of 'single' and 'skilled', indicating a focus on one specific skill.","priority":"☆☆☆"},"pronunciation":{"ipa":null,"syllables":"sin-gle-skilled"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"The term 'single-skilled' is often used in the context of labor and employment to describe workers who possess or require only one specific skill. This can be a limiting factor in terms of job opportunities and career advancement, especially in industries that value versatility and adaptability. It is often contrasted with 'multi-skilled', which refers to workers who possess a range of different skills.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a single skilled worker.","correct":"He is a single-skilled worker.","note":"The hyphen is important to connect the two words into a single adjective."}],"priority":"☆☆☆"},"related_words":{"derivatives":["skill","skilled","unskilled","multi-skilled"],"related_terms":["labor","workforce","employment","job market"]},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'single-skilled' is a relatively specialized term used in the context of labor economics and human resources. It describes a worker who possesses or requires only one specific skill, often in contrast to 'multi-skilled' workers who possess a range of different skills. The term implies a limitation in terms of job opportunities and career advancement, as single-skilled workers may be less adaptable to changing job requirements."},"example_sentences":[{"sentence":"The factory relies on a large number of single-skilled employees for its assembly line.","translation":"その工場は、組み立てラインのために多数の単能工の従業員に依存しています。","type":"adjective","meaning_category":"単一技能"},{"sentence":"Investing in training can help single-skilled workers become more versatile and improve their job prospects.","translation":"研修への投資は、単能工の労働者がより多才になり、雇用見通しを改善するのに役立ちます。","type":"adjective","meaning_category":"単一技能"}]}