{"word":"Eurytomid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"キバチの仲間であるフシダニバチ科の昆虫","english_definition":"Any insect of the family Eurytomidae, which are chalcid wasps.","examples":[{"sentence":"Eurytomids can be either beneficial or harmful to agriculture, depending on the species.","translation":"フシダニバチ科の昆虫は、種によって農業に有益にも有害にもなり得る。"}],"collocations":["eurytomid wasp","eurytomid larvae","eurytomid damage"],"synonyms":["chalcid wasp"],"antonyms":[]}],"etymology":{"value":"The name Eurytomidae comes from the genus name Eurytoma, which is derived from the Greek words 'eurys' meaning 'wide' and 'tome' meaning 'cut'. This likely refers to the shape of the insect's body.","priority":"★★☆"},"pronunciation":{"ipa":"/jʊˈrɪtəmɪd/","syllables":"Eu-ry-to-mid"},"inflection":{"noun_plural":"Eurytomids"},"usage_notes":{"explanation":"Eurytomids are a diverse group of wasps, with many species exhibiting specialized life cycles. Some are parasitoids, attacking other insects, while others are phytophagous, feeding on plants. This makes them important in both natural ecosystems and agricultural settings.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The eurytomid is a type of bee.","correct":"✓ The eurytomid is a type of wasp.","note":"Eurytomids are wasps, not bees."}],"priority":"★★☆"},"related_words":{"derivatives":["Eurytoma (genus)","Eurytomidae (family)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な昆虫学の文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'eurytomid' refers to a specific family of chalcid wasps (Eurytomidae). Understanding this term requires a background in entomology or a related field. The text discusses their ecological roles as parasitoids or phytophagous insects, which can be beneficial or detrimental to agriculture. The etymology of the name is rooted in Greek, referencing the physical characteristics of these insects.","priority":"★☆☆"},"example_sentences":[{"sentence":"The wheat crop suffered significant damage from eurytomid infestation.","translation":"小麦の収穫はフシダニバチの蔓延により大きな被害を受けた。","type":"noun","meaning_category":"insect"},{"sentence":"Researchers are studying the potential of using eurytomids as biological control agents.","translation":"研究者たちは、フシダニバチを生物的防除剤として利用する可能性を研究している。","type":"noun","meaning_category":"insect"}]}