{"word":"Labadist","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"A member of a 17th-century Christian sect founded by Jean de Labadie.","english_definition":"A follower of the 17th-century pietist sect founded by Jean de Labadie.","examples":[{"sentence":"The Labadists were known for their communal living and emphasis on spiritual purity.","translation":"ラバディストは、共同生活と精神的な純粋さを重視することで知られていました。"}],"synonyms":["Labadie follower"],"antonyms":[]},{"part_of_speech":"adjective","definition":"Relating to the Labadists or their beliefs.","english_definition":"Of or pertaining to the Labadists or their religious principles.","examples":[{"sentence":"Labadist communities were established in various parts of Europe and North America.","translation":"ラバディストのコミュニティは、ヨーロッパや北米の様々な場所に設立されました。"}],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the name of the founder, Jean de Labadie (1610-1674).","priority":"Medium"},"pronunciation":{"ipa":"/ˈlæbədɪst/","syllables":"La-ba-dist"},"inflection":{"noun_plural":"Labadists"},"usage_notes":{"explanation":"The term 'Labadist' refers to a specific religious group and is not commonly used outside of historical or religious contexts.","priority":"Medium"},"common_mistakes":{"examples":[],"priority":"Low"},"related_words":{"derivatives":["Labadism (the religious beliefs and practices of the Labadists)"],"related_terms":["pietism","sect","communalism"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C2","text":"The word 'Labadist' is a specialized term related to a specific historical religious group. It is unlikely to be encountered in general English usage and is primarily found in academic or historical texts. Understanding requires knowledge of 17th-century religious history."},"example_sentences":[{"sentence":"The Labadist community at Bohemia Manor was a significant example of early communal living in America.","translation":"ボヘミア・マナーのラバディスト・コミュニティは、アメリカにおける初期の共同生活の重要な例でした。","type":"noun","meaning_category":"Member of a sect"},{"sentence":"Labadist principles emphasized separation from the world and a focus on inner spirituality.","translation":"ラバディストの原則は、世俗からの分離と内面の精神性に焦点を当てることを強調していました。","type":"adjective","meaning_category":"Relating to the Labadists"}]}