{"word":"far-sought","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"苦労して探し求めた、遠くまで探しに行った、遠方から取り寄せた","english_definition":"obtained or achieved only after a long and difficult search; brought from a distant place.","examples":[{"sentence":"The solution to the problem was far-sought, requiring expertise from multiple fields.","translation":"その問題の解決策は苦労して探し求められたもので、複数の分野からの専門知識を必要とした。"},{"sentence":"The rare spices used in the dish were far-sought, imported from remote regions of the world.","translation":"その料理に使われた珍しい香辛料は遠方から取り寄せられたもので、世界の遠隔地から輸入された。"}],"collocations":["far-sought solution (苦労して探し求めた解決策)","far-sought spices (遠方から取り寄せた香辛料)","far-sought knowledge (苦労して探し求めた知識)"],"synonyms":["hard-won","difficult to obtain","imported","exotic","remote"],"antonyms":["easily obtained","readily available","local","common"]},{"part_of_speech":"adjective","definition":"大げさな、不自然な、無理のある","english_definition":"strained or artificial; not natural or spontaneous.","examples":[{"sentence":"His explanation seemed far-sought, as if he were trying too hard to justify his actions.","translation":"彼の説明は無理があるように思われた。まるで自分の行動を正当化しようと必死になっているかのようだった。"},{"sentence":"The connection between the two events was far-sought and unconvincing.","translation":"二つの出来事の間のつながりは大げさで、説得力に欠けていた。"}],"collocations":["far-sought explanation (無理のある説明)","far-sought connection (大げさなつながり)","far-sought justification (不自然な正当化)"],"synonyms":["contrived","forced","artificial","strained","unnatural"],"antonyms":["natural","spontaneous","genuine"]}],"etymology":{"value":"'Far' + 'sought' (過去分詞 of 'seek'). Originally meant 'sought from afar'. The sense of 'strained' or 'contrived' likely developed from the idea of something being searched for too diligently, resulting in an unnatural or forced outcome.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɑːrˈsɔːt/","syllables":"far-sought"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Far-sought' can have two main senses:\n\n1.  **Difficult to obtain:** This refers to something that requires a long and arduous search to find or achieve. It often implies that the thing being sought is rare, valuable, or requires specialized knowledge to acquire.\n\n2.  **Strained or artificial:** This sense implies that something is forced, unnatural, or contrived. It suggests that someone is trying too hard to make a connection or explanation, resulting in something that lacks authenticity or credibility.\n\nThe context usually makes it clear which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The far-sought solution was easy to implement.","correct":"✓ The hard-won solution was easy to implement.","note":"If the solution was easy to implement, 'far-sought' is likely inappropriate. 'Hard-won' would be a better fit if the solution was difficult to find but easy to implement once found."},{"incorrect":"✗ The far-sought flowers grew in my garden.","correct":"✓ The exotic flowers grew in my garden.","note":"If the flowers grew in your garden, they are not 'far-sought' in the sense of being brought from a distant place. 'Exotic' might be a better choice."}],"priority":"★★☆"},"related_words":{"derivatives":["far (adverb)","sought (verb)","seek (verb)"],"phrases":["far and wide (idiom)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Far-sought' is a relatively uncommon word with two main meanings. The first meaning is that something was difficult to find or obtain, requiring a long and arduous search. The second meaning is that something is strained, artificial, or unnatural. The context usually makes it clear which meaning is intended. Because it's not a common word, it's best to use it when you specifically want to convey the idea of a long and difficult search or something being forced or contrived."},"example_sentences":[{"sentence":"The researchers presented a far-sought theory that challenged conventional wisdom.","translation":"研究者たちは、従来の知恵に挑戦する、無理のある理論を発表した。","type":"adjective","meaning_category":"strained or artificial"},{"sentence":"The far-sought artifact was finally discovered after decades of searching.","translation":"その苦労して探し求めた工芸品は、数十年の探索の末についに発見された。","type":"adjective","meaning_category":"difficult to obtain"}]}