{"word":"hyposalivation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"唾液分泌低下症、唾液減少症","english_definition":"A condition in which the salivary glands in the mouth do not make enough saliva.","examples":[{"sentence":"Hyposalivation can lead to difficulties in swallowing and speaking.","translation":"唾液分泌低下症は、嚥下や発話の困難につながる可能性があります。"},{"sentence":"Medications can sometimes cause hyposalivation as a side effect.","translation":"薬が副作用として唾液分泌低下症を引き起こすことがあります。"},{"sentence":"Treatment for hyposalivation focuses on stimulating saliva production and managing symptoms.","translation":"唾液分泌低下症の治療は、唾液の産生を刺激し、症状を管理することに重点を置いています。"}],"collocations":["severe hyposalivation (重度の唾液分泌低下症)","mild hyposalivation (軽度の唾液分泌低下症)","drug-induced hyposalivation (薬物誘発性唾液分泌低下症)","radiation-induced hyposalivation (放射線誘発性唾液分泌低下症)","xerostomia and hyposalivation (口腔乾燥症と唾液分泌低下症)"],"synonyms":["xerostomia (口腔乾燥症)","salivary gland hypofunction (唾液腺機能低下)"],"antonyms":["hypersalivation (唾液過多症、多唾症)","ptyalism (多唾症)"]}],"etymology":{"value":"The term 'hyposalivation' is formed from the Greek prefix 'hypo-' meaning 'under' or 'below normal', 'saliva' referring to the watery substance secreted into the mouth by the salivary glands, and the suffix '-ation' indicating a condition or process.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpoʊˌseɪlɪˈveɪʃən/","syllables":"hy-po-sa-li-va-tion"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Hyposalivation is a medical term used to describe the objective decrease in saliva production. It is often associated with xerostomia, which is the subjective feeling of dry mouth. However, a person can experience xerostomia without having measurable hyposalivation, and vice versa. Diagnosis of hyposalivation typically involves measuring the amount of saliva produced over a specific period.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have hyposalivation, so my mouth is very wet.","correct":"✓ I have hyposalivation, so my mouth is very dry.","note":"Hyposalivation means reduced saliva production, leading to a dry mouth, not a wet mouth."},{"incorrect":"✗ Hyposalivation is the same as having too much saliva.","correct":"✓ Hyposalivation is the same as having too little saliva.","note":"Hyposalivation refers to insufficient saliva production, the opposite of having too much saliva."}],"priority":"★★☆"},"related_words":{"derivatives":["hyposalivatory (adjective: relating to hyposalivation)"],"phrasal_verbs":null,"related_medical_terms":["xerostomia (口腔乾燥症)","sialadenitis (唾液腺炎)","Sjögren's syndrome (シェーグレン症候群)","salivary glands (唾液腺)","saliva (唾液)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hyposalivation' is a technical term primarily used in medical contexts. It refers to the objective reduction in saliva production by the salivary glands. This condition can lead to symptoms of dry mouth (xerostomia), but the two terms are not interchangeable. Understanding this term requires a background in basic medical terminology. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The patient reported difficulty swallowing due to hyposalivation.","translation":"患者は唾液分泌低下のため、嚥下困難を訴えた。","type":"medical","meaning_category":"symptom"},{"sentence":"Radiation therapy to the head and neck can often result in hyposalivation.","translation":"頭頸部への放射線療法は、しばしば唾液分泌低下を引き起こすことがある。","type":"medical","meaning_category":"cause"},{"sentence":"Artificial saliva can help manage the discomfort associated with hyposalivation.","translation":"人工唾液は、唾液分泌低下に伴う不快感を管理するのに役立つ。","type":"medical","meaning_category":"treatment"}]}