{"word":"half-blooded","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(人について)混血の、純血でない","english_definition":"(of a person) having parents of different races or ethnic groups; not of pure blood or breed.","examples":[{"sentence":"He was a half-blooded elf, with one human parent.","translation":"彼は片親が人間のハーフエルフだった。"},{"sentence":"The dog is half-blooded, a mix of Labrador and Golden Retriever.","translation":"その犬はラブラドールとゴールデンレトリバーの混血だ。"}],"collocations":["half-blooded elf","half-blooded wizard","half-blooded dog","half-blooded horse"],"synonyms":["mixed-race","biracial","crossbred","hybrid"],"antonyms":["purebred","full-blooded"]},{"part_of_speech":"adjective","definition":"(軽蔑的に)中途半端な、不完全な","english_definition":"(derogatory) incomplete; imperfect; lacking full commitment or enthusiasm.","examples":[{"sentence":"It was a half-blooded attempt to fix the problem.","translation":"それは問題を解決しようとする中途半端な試みだった。"},{"sentence":"His performance was half-blooded and lacked energy.","translation":"彼の演技は中途半端で、エネルギーに欠けていた。"}],"collocations":["half-blooded effort","half-blooded attempt","half-blooded performance"],"synonyms":["lukewarm","halfhearted","tepid","unenthusiastic"],"antonyms":["wholehearted","enthusiastic","committed"]}],"etymology":{"value":"'Half' + 'blooded'. The term originally referred to animals of mixed breed. Its application to humans, particularly in contexts of race or ethnicity, carries a complex history and can be considered offensive depending on the context and intent.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhæfˈblʌdɪd/","syllables":"half-blood-ed"},"inflection":{"notes":"Adjective; no comparative or superlative forms."},"usage_notes":{"explanation":"The term 'half-blooded' has a complex and potentially offensive history, particularly when used in reference to people. It is most safely used to describe animals of mixed breed. When describing people, it is crucial to be aware of the potential for offense and to consider using more neutral and respectful terms like 'mixed-race' or 'biracial'. The derogatory sense should be avoided unless the intent is to explicitly criticize a lack of commitment or enthusiasm. The term is also common in fantasy fiction, such as the Harry Potter series, where it has specific connotations within the fictional world.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a half-blooded American.","correct":"✓ He is of mixed American heritage. / ✓ He has partial American ancestry.","note":"Using 'half-blooded' to describe nationality can be insensitive. It's better to use phrases like 'of mixed heritage' or 'has partial ancestry'."},{"incorrect":"✗ She gave a half-blooded performance, and everyone loved it.","correct":"✓ She gave a halfhearted performance, and everyone still loved it.","note":"When referring to a lack of enthusiasm, 'halfhearted' is a more common and less potentially offensive alternative to 'half-blooded'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Context-dependent; not typically taught in standard language courses)","frequency_google_ngram":"Low frequency, but usage spikes in specific contexts (e.g., fantasy literature).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'half-blooded' is generally understood to mean of mixed heritage or breed. However, its usage can be problematic due to its historical association with discriminatory contexts. It is important to be aware of the potential for offense when using this term, especially when referring to people. In many cases, more neutral and respectful alternatives are available. The term is also used in fantasy literature to describe characters of mixed magical heritage, where it may carry specific connotations within the fictional world."},"example_sentences":[{"sentence":"The half-blooded horse was known for its stamina and agility.","translation":"その混血の馬は、スタミナと敏捷性で知られていた。","type":"adjective","meaning_category":"mixed breed (animal)"},{"sentence":"He was a half-blooded wizard, which made him an outcast in some circles.","translation":"彼はハーフの魔法使いだったので、一部のコミュニティではのけ者にされていた。","type":"adjective","meaning_category":"mixed heritage (fantasy context)"},{"sentence":"The project failed because of a half-blooded effort from the team.","translation":"プロジェクトは、チームのメンバーの中途半端な努力が原因で失敗した。","type":"adjective","meaning_category":"incomplete effort"}]}