{"word":"unabstractedness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The state or quality of being unabstracted; concreteness; particularity.","english_definition":"The state or quality of not being abstract; concreteness; particularity.","examples":[{"sentence":"The unabstractedness of the artwork made it very relatable.","translation":"そのアートワークの具体性が、非常に共感を呼びました。"},{"sentence":"The author emphasized the unabstractedness of his experiences in his memoir.","translation":"著者は回顧録の中で、自身の経験の具体性を強調しました。"}],"collocations":["emphasize unabstractedness","preserve unabstractedness","appreciate unabstractedness"],"synonyms":["concreteness","particularity","specificity","tangibility","actuality"],"antonyms":["abstractedness","abstraction","generality","vagueness"]}],"etymology":{"value":"Formed from \"un-\" (not) + \"abstracted\" (removed from concrete reality) + \"-ness\" (state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"ˌʌnˈæbstræktɪdnəs","syllables":"un-ab-stract-ed-ness"},"inflection":{"noun_plural":"unabstractednesses (rare)"},"usage_notes":{"explanation":"\"Unabstractedness\" refers to the degree to which something is concrete, specific, and directly related to experience rather than being theoretical or generalized. It is often used in discussions of art, literature, and philosophy to describe a focus on tangible details and immediate realities.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unabstractedness is good.","correct":"✓ The unabstractedness of the object is good.","note":"It's better to specify what possesses the quality of unabstractedness."}],"priority":"★☆☆"},"related_words":{"derivatives":["abstracted","abstractedness","unabstracted"],"related_terms":["concrete","specific","tangible","actual"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Unabstractedness\" is a complex term used to describe the quality of being concrete and specific rather than abstract or general. It is most often encountered in academic or philosophical contexts. Understanding this word requires a strong grasp of abstract concepts and the ability to differentiate between the general and the particular."},"example_sentences":[{"sentence":"The power of the documentary lies in its raw, unabstractedness depiction of everyday life.","translation":"そのドキュメンタリーの力は、日常生活の生の、具体的な描写にある。","type":"general","meaning_category":"concreteness"},{"sentence":"The artist aimed for unabstractedness in his paintings, capturing the minute details of each scene.","translation":"そのアーティストは絵画において具体性を目指し、各シーンの細部を捉えた。","type":"art","meaning_category":"particularity"},{"sentence":"The philosopher argued for the importance of unabstractedness in ethical decision-making, emphasizing the need to consider individual circumstances.","translation":"その哲学者は、倫理的な意思決定において具体性の重要性を主張し、個々の状況を考慮する必要性を強調した。","type":"philosophy","meaning_category":"specificity"}]}