{"word":"repunishable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"処罰に値する、再び処罰できる","english_definition":"deserving of punishment again; capable of being punished again.","examples":[{"sentence":"The crime, being a repeat offense, was repunishable under the law.","translation":"その犯罪は再犯であるため、法律の下で再び処罰に値した。"},{"sentence":"While the initial infraction was forgiven, subsequent violations would be repunishable.","translation":"最初の違反は許されたが、その後の違反は再び処罰される可能性がある。"}],"collocations":["repunishable offense","repunishable act","repunishable by law"],"synonyms":["punishable again","liable to further punishment"],"antonyms":["unpunishable","exempt from punishment"]}],"etymology":{"value":"The word is formed by adding the prefix 're-' (again) to 'punishable' (deserving punishment).","priority":"★★★"},"pronunciation":{"ipa":"/riːˈpʌnɪʃəbəl/","syllables":"re-pun-ish-a-ble"},"inflection":{"adjective_forms":{"comparative":"more repunishable","superlative":"most repunishable"}},"usage_notes":{"explanation":"'Repunishable' is a relatively rare word, typically used in legal or formal contexts to indicate that an action or offense can be punished more than once, especially if it is repeated. It often implies that the initial punishment was not a sufficient deterrent.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The repunishable action was a simple mistake.","correct":"✓ The punishable action was a simple mistake.","note":"Ensure the action genuinely warrants further punishment due to repetition or severity. If it's a first-time offense, use 'punishable' instead."},{"incorrect":"✗ The crime is repunishable, but he was already freed.","correct":"✓ The crime is punishable, but he was already freed.","note":"If the person has been freed and cannot be tried again due to legal reasons (e.g., double jeopardy), the action might be 'punishable' in principle but not practically 'repunishable' in that specific case."}],"priority":"★★☆"},"related_words":{"derivatives":["punish","punishable","punishment","re- (prefix)"],"related_terms":["double jeopardy (法律用語: 二重処罰の禁止)","recidivism (再犯)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Repunishable' is a formal and relatively uncommon term, mostly used in legal or official contexts. It means that an action can be punished again, usually because it is a repeat offense. Understanding this word requires a good grasp of legal terminology and the concept of repeated offenses. It is not typically used in everyday conversation."},"example_sentences":[{"sentence":"The company's policy stated that any violation of the safety regulations was repunishable.","translation":"会社の規定では、安全規則の違反はすべて再び処罰の対象となると定められていた。","type":"general","meaning_category":"General Usage"},{"sentence":"Under the new legislation, certain types of fraud are repunishable with increased severity.","translation":"新しい法律の下では、特定の種類の詐欺はより重い刑罰で再び処罰される。","type":"legal","meaning_category":"Legal Context"}]}