{"word":"froward","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"強情な、わがままな、つむじ曲がりの、反抗的な","english_definition":"habitually disposed to disobedience and opposition; perverse; difficult to deal with.","examples":[{"sentence":"The froward child refused to obey his parents.","translation":"その強情な子供は両親の言うことを聞こうとしなかった。"},{"sentence":"Her froward behavior made it difficult to reason with her.","translation":"彼女のつむじ曲がりの態度は、彼女と道理を説くことを困難にした。"},{"sentence":"He was known for his froward and uncooperative attitude.","translation":"彼は強情で非協力的な態度で知られていた。"}],"collocations":["froward child (強情な子供)","froward behavior (わがままな振る舞い)","froward disposition (つむじ曲がりの性格)","froward youth (反抗的な若者)"],"synonyms":["obstinate","willful","stubborn","perverse","rebellious","contrary","wayward","disobedient","fractious"],"antonyms":["obedient","docile","compliant","tractable","amenable","cooperative"]}],"etymology":{"value":"Middle English: from *fro* (from Old Norse *frá* 'from') + *ward* (in the direction of). The original sense was 'turned away, adverse', later 'perverse'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfroʊərd/","syllables":"frow-ard"},"inflection":{"adjective_forms":{"comparative":"more froward","superlative":"most froward"}},"usage_notes":{"explanation":"\"Froward\" is a somewhat archaic or literary term used to describe someone who is habitually disobedient, stubborn, and resistant to guidance or control. It implies a deliberate and persistent opposition to what is expected or desired. While the word is not commonly used in modern everyday conversation, it can still be found in literature and formal writing. It is stronger than simply being 'naughty' or 'mischievous'; it suggests a deeply ingrained tendency towards contrariness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was froward to help others.","correct":"✓ He was froward and refused to help others.","note":"\"Froward\" implies a negative disposition; it's not used to describe someone who is eager to help. It describes someone who is unwilling to cooperate or obey. The sentence should reflect this negative connotation."},{"incorrect":"✗ The frowardness of the situation was difficult to manage.","correct":"✓ The frowardness of the child was difficult to manage.","note":"\"Frowardness\" describes a quality of a person (or sometimes an animal), not a situation. The sentence should be rephrased to correctly attribute the frowardness to an individual."}],"priority":"★★☆"},"related_words":{"derivatives":["frowardly (adverb: in a froward manner)","frowardness (noun: the quality of being froward)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (rarely used in modern English, but might be encountered in older literature)","frequency_google_ngram":"Very low frequency - an archaic term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Froward\" is an uncommon word that means stubbornly disobedient and difficult to manage. It's not used much in everyday conversation but you might find it in older books or formal writing. It describes someone who is deliberately contrary and resists being told what to do. Think of a child who constantly refuses to follow instructions – that child could be described as froward."},"example_sentences":[{"sentence":"The teacher struggled to control the **froward** student.","translation":"先生はその強情な生徒を制御するのに苦労した。","type":"adjective","meaning_category":"強情な、わがままな"},{"sentence":"His **froward** nature made him unpopular with his peers.","translation":"彼のつむじ曲がりの性格は、彼を同級生に不人気にした。","type":"adjective","meaning_category":"つむじ曲がりの"},{"sentence":"She regretted her **froward** words as soon as she had spoken them.","translation":"彼女は自分のわがままな言葉を口にした途端に後悔した。","type":"adjective","meaning_category":"反抗的な"}]}