{"word":"Statocracy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"国家統制政治、官僚政治","english_definition":"A form of government in which the state has total control, often through a powerful bureaucracy.","examples":[{"sentence":"The country was becoming a statocracy, with the government controlling every aspect of life.","translation":"その国は、政府が生活のあらゆる側面を管理する国家統制政治になりつつあった。"},{"sentence":"Critics argued that the new policies would lead to a statocracy.","translation":"批評家たちは、新しい政策が国家統制政治につながると主張した。"}],"collocations":["emerging statocracy","creeping statocracy","total statocracy","bureaucratic statocracy"],"synonyms":["state control","bureaucratic rule","authoritarianism","totalitarianism"],"antonyms":["democracy","anarchy","libertarianism"]}],"etymology":{"value":"\"Statocracy\" is a blend of \"state\" and \"-ocracy\" (from Greek \"kratos\", meaning \"power\" or \"rule\"). It implies rule by the state or its bureaucracy.","priority":"★★☆"},"pronunciation":{"ipa":"/stəˈtɒkrəsi/","syllables":"sta-toc-ra-cy"},"inflection":{"noun_plural":"statocracies"},"usage_notes":{"explanation":"\"Statocracy\" is often used critically to describe a system where the state's power is excessive, and individual freedoms are curtailed. It is not a commonly used term, but it is useful in describing systems where the government's control is pervasive.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The statocracy was very democratical.","correct":"✓ The statocracy was not very democratic.","note":"Statocracy is the opposite of democracy, so describing it as 'democratical' is contradictory."},{"incorrect":"✗ He supported statocracy because he believed in individual freedom.","correct":"✓ He opposed statocracy because he believed in individual freedom.","note":"Statocracy involves state control, which is often seen as conflicting with individual freedom."}],"priority":"★★☆"},"related_words":{"derivatives":["statocratic (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Statocracy\" is a relatively uncommon term used to describe a system where the state has overwhelming control, often through a powerful bureaucracy. It is usually used in a critical context to suggest that the state's power is excessive and infringes upon individual liberties. Understanding this term requires a good grasp of political science vocabulary.","example_sentences":[]}}