{"word":"Spermatitis","priority":"Low","meanings":[{"part_of_speech":"Noun","definition":"Inflammation of the spermatic cord.","english_definition":"Inflammation of the spermatic cord, the cord-like structure in males that contains the vas deferens, blood vessels, and nerves.","examples":[{"sentence":"The patient was diagnosed with spermatitis after experiencing pain and swelling in the scrotum.","translation":"患者は陰嚢の痛みと腫れを訴え、精索炎と診断された。"}],"collocations":["Acute spermatitis","Chronic spermatitis","Bacterial spermatitis","Spermatitis treatment","Spermatitis symptoms"],"synonyms":["Funiculitis","Inflammation of the spermatic cord"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'sperma' (seed) and '-itis' (inflammation).","priority":"Medium"},"pronunciation":{"ipa":"/ˌspɜːrməˈtaɪtɪs/","syllables":"sper-ma-ti-tis"},"inflection":{"noun_plural":"spermatitides (rare)"},"usage_notes":{"explanation":"Spermatitis is a relatively rare condition, often associated with infection or trauma. It can cause pain, swelling, and tenderness in the scrotum. Diagnosis typically involves a physical examination and may include imaging studies or cultures. Treatment often involves antibiotics and pain management.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"Spermatitis is the same as epididymitis.","correct":"Spermatitis involves inflammation of the spermatic cord, while epididymitis involves inflammation of the epididymis.","note":"Spermatitis and epididymitis are distinct conditions affecting different structures in the male reproductive system."}],"priority":"Low"},"related_words":{"derivatives":["Spermatic","Itis"],"related_medical_terms":["Epididymitis","Orchitis","Urethritis"]},"level_frequency":{"frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Spermatitis' is a medical term referring to the inflammation of the spermatic cord. Understanding this term requires a basic knowledge of medical terminology and male reproductive anatomy. It's important to distinguish it from other similar conditions like epididymitis or orchitis. The word is not commonly used outside of medical contexts."},"example_sentences":[{"sentence":"The doctor suspected spermatitis based on the patient's reported pain along the spermatic cord.","translation":"医師は患者が訴える精索に沿った痛みから精索炎を疑った。","type":"medical","meaning_category":"inflammation"},{"sentence":"Chronic spermatitis can lead to persistent discomfort and may require long-term management.","translation":"慢性精索炎は持続的な不快感を引き起こす可能性があり、長期的な管理が必要となる場合がある。","type":"medical","meaning_category":"inflammation"}]}