{"word":"Neo-Hebrew","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"現代ヘブライ語","english_definition":"The modern form of the Hebrew language, revived as a spoken language in the late 19th and early 20th centuries.","examples":[{"sentence":"Neo-Hebrew is the official language of Israel.","translation":"現代ヘブライ語はイスラエルの公用語です。"},{"sentence":"Learning Neo-Hebrew allows one to read modern Israeli literature.","translation":"現代ヘブライ語を学ぶことで、現代イスラエル文学を読むことができます。"}],"collocations":["Modern Hebrew","Israeli Hebrew"],"synonyms":["Modern Hebrew","Israeli Hebrew"],"antonyms":["Biblical Hebrew","Classical Hebrew"]}],"etymology":{"value":"A constructed term referring to the revived form of Hebrew. It distinguishes the modern spoken language from its classical and biblical forms.","priority":"★★★"},"pronunciation":{"ipa":"/ˌniːoʊ ˈhiːbruː/","syllables":"Ne-o-He-brew"},"inflection":{"notes":"It is a noun, so plural form is Neo-Hebrews, but not commonly used."},"usage_notes":{"explanation":"Neo-Hebrew refers specifically to the modern, spoken version of Hebrew, particularly as it is used in Israel today. It differs from Biblical or Classical Hebrew in grammar, vocabulary, and pronunciation, reflecting its adaptation to modern life and influences from other languages.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He speaks Hebrew, but I don't know if it's Neo-Hebrew or not.","correct":"✓ He speaks Hebrew, but I don't know if it's modern Hebrew or not.","note":"Using 'modern Hebrew' is more common and easily understood than 'Neo-Hebrew'."}],"priority":"★★☆"},"related_words":{"derivatives":["Hebrew","Biblical Hebrew","Modern Hebrew","Israeli Hebrew"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Neo-Hebrew' is a specific term used in linguistics and language studies to differentiate the modern, spoken form of Hebrew from its ancient forms. It's not commonly used in everyday conversation but is important in academic contexts when discussing the evolution of the Hebrew language."},"example_sentences":[{"sentence":"The revival of Neo-Hebrew is a unique example of language revitalization.","translation":"現代ヘブライ語の復興は、言語復興のユニークな例です。","type":"noun","meaning_category":"language"},{"sentence":"Neo-Hebrew incorporates many words and phrases borrowed from European languages.","translation":"現代ヘブライ語には、ヨーロッパの言語から借用された多くの単語やフレーズが含まれています。","type":"noun","meaning_category":"language"}]}