{"word":"shepherdage","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"羊飼いの仕事、羊飼いの技術、羊飼いの管理","english_definition":"The occupation, art, or management of a shepherd.","examples":[{"sentence":"His shepherdage was known throughout the region for its skill and care.","translation":"彼の羊飼いの仕事は、その技術と注意深さで地域全体に知られていた。"},{"sentence":"The book detailed the traditional methods of shepherdage in the mountains.","translation":"その本は、山岳地帯における伝統的な羊飼いの管理方法を詳しく説明していた。"}],"collocations":["traditional shepherdage","modern shepherdage","skilled shepherdage"],"synonyms":["shepherding","pastoralism","sheep-farming"],"antonyms":[]}],"etymology":{"value":"shepherd + -age","priority":"★★★"},"pronunciation":{"ipa":"ˈʃɛpərdɪdʒ","syllables":"shep-herd-age"},"inflection":{"noun_plural":"shepherdages"},"usage_notes":{"explanation":"\"Shepherdage\" is a relatively uncommon noun that refers specifically to the work, skill, or management associated with being a shepherd. It encompasses the knowledge and practices involved in caring for sheep.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practices shepherdage every day with his sheep.","correct":"✓ He practices shepherding every day with his sheep.","note":"\"Shepherding\" is a more common and natural-sounding term for the act of tending sheep on a daily basis."}],"priority":"★★☆"},"related_words":{"derivatives":["shepherd","shepherding"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word \"shepherdage\" is a formal and less common term for the occupation or skill of a shepherd. It is more likely to be found in academic or historical texts discussing pastoral practices. The more common term for the act of tending sheep is \"shepherding.\""},"example_sentences":[{"sentence":"The ancient texts described the principles of good shepherdage.","translation":"古代の文献は、優れた羊飼いの管理の原則を記述していた。","type":"noun","meaning_category":"羊飼いの管理"},{"sentence":"His family had a long tradition of skilled shepherdage.","translation":"彼の家族は、熟練した羊飼いの仕事の長い伝統を持っていた。","type":"noun","meaning_category":"羊飼いの仕事"},{"sentence":"The course taught the basics of modern shepherdage techniques.","translation":"そのコースでは、現代の羊飼いの技術の基礎を教えていた。","type":"noun","meaning_category":"羊飼いの技術"}]}