{"word":"cinerarium","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"納骨堂、遺骨安置所","english_definition":"A place for the respectful storage of cinerary urns, typically a room or building.","examples":[{"sentence":"The family chose a niche in the cinerarium to hold the urn.","translation":"家族は骨壷を安置するために納骨堂のニッチを選んだ。"},{"sentence":"Many modern cemeteries include a cinerarium for cremated remains.","translation":"多くの現代的な墓地には、火葬された遺骨のための納骨堂が含まれている。"}],"collocations":["cinerary urn","cremated remains","niche in a cinerarium"],"synonyms":["columbarium","ossuary"],"antonyms":[]}],"etymology":{"value":"From Latin cinerarius, from cinis (ashes).","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɪnəˈrɛəriəm/","syllables":"ci-ne-rar-i-um"},"inflection":{"noun_plural":"cineraria"},"usage_notes":{"explanation":"A cinerarium is specifically designed for the storage of cremated remains, often in urns. It is distinct from a mausoleum, which houses entire bodies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They buried the ashes in the cinerarium.","correct":"✓ They placed the urn in the cinerarium.","note":"Ashes are not buried in a cinerarium; they are stored in urns or other containers."}],"priority":"★★☆"},"related_words":{"derivatives":["cinerary (adjective: relating to ashes or cremation)","cinereal (adjective: ash-colored)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'cinerarium' is a specialized term primarily used in the context of funeral practices and architecture related to the storage of cremated remains. It is not commonly encountered in everyday language and would typically appear in formal or technical discussions about cemeteries, memorial sites, or end-of-life arrangements. Understanding this term requires familiarity with funerary customs and related vocabulary."},"example_sentences":[{"sentence":"The modern cinerarium was designed with individual niches for each urn.","translation":"現代的な納骨堂は、各骨壷のために個別のニッチが設計されていた。","type":"noun","meaning_category":"遺骨安置所"},{"sentence":"The cemetery's cinerarium offers a peaceful setting for remembrance.","translation":"その墓地の納骨堂は、追悼のための静かな環境を提供している。","type":"noun","meaning_category":"遺骨安置所"}]}