{"word":"self-projection","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自己投影、自己投射","english_definition":"The attribution of one's own ideas, feelings, or attitudes to other people or objects.","examples":[{"sentence":"His constant criticism of others is often seen as self-projection.","translation":"彼の他人への絶え間ない批判は、しばしば自己投影と見なされる。"},{"sentence":"The author's personal experiences heavily influenced the characters, leading to self-projection in their actions.","translation":"作者の個人的な経験は登場人物に大きな影響を与え、彼らの行動に自己投影が見られた。"},{"sentence":"Understanding self-projection can help improve interpersonal relationships.","translation":"自己投影を理解することは、対人関係の改善に役立つ。"}],"collocations":["defense mechanism","psychological concept","attribute feelings","personal experiences","influence behavior"],"synonyms":["attribution","externalization","displacement"],"antonyms":["introspection","self-awareness","self-reflection"]},{"part_of_speech":"noun","definition":"（心理学）自己投影（防衛機制の一種）","english_definition":"(Psychology) A defense mechanism in which a person unconsciously rejects his or her own unacceptable attributes or qualities and projects them onto someone else.","examples":[{"sentence":"The bully's behavior is often a case of self-projection, where they attribute their own insecurities to others.","translation":"いじめっ子の行動は、多くの場合、自己投影の例であり、彼らは自身の不安を他人に投影している。"},{"sentence":"Self-projection can be a way to avoid facing one's own flaws.","translation":"自己投影は、自身の欠点に直面することを避けるための手段となり得る。"},{"sentence":"Therapy can help individuals recognize and address their self-projection tendencies.","translation":"セラピーは、個人が自己投影の傾向を認識し、対処するのに役立つ。"}],"collocations":["defense mechanism","psychological defense","unconscious process","attribute insecurities","avoid facing flaws"],"synonyms":["displacement","scapegoating","blaming"],"antonyms":["self-acceptance","acknowledgment","owning one's flaws"]}],"etymology":{"value":"The term is formed by combining 'self' (referring to oneself) and 'projection' (the act of attributing something to another). The concept originates from psychoanalytic theory, particularly the work of Sigmund Freud.","priority":"★★★"},"pronunciation":{"ipa":"/ˌself.prəˈdʒek.ʃən/","syllables":"self-pro-jec-tion"},"inflection":{"noun_plural":"self-projections"},"usage_notes":{"explanation":"'Self-projection' refers to the unconscious process of attributing one's own thoughts, feelings, or motives to another person. It is often used as a defense mechanism to avoid acknowledging one's own unacceptable qualities or behaviors. In everyday conversation, it can describe someone who consistently sees their own traits in others.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is projecting himself.","correct":"✓ He is using self-projection. / ✓ He is projecting his feelings.","note":"'Self-projection' is a noun. To describe the act of projecting, use 'project' with an object (e.g., feelings, thoughts)."},{"incorrect":"✗ She has a lot of self-projections for the future.","correct":"✓ She has a lot of plans for the future.","note":"'Self-projection' refers to a psychological process, not future plans or goals. Use 'plans,' 'goals,' or 'aspirations' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["project (verb)","projection (noun)","projective (adjective)"],"phrasal_verbs":[],"related_concepts":["defense mechanism","psychoanalysis","cognitive bias","attribution theory"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in psychological or analytical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Self-projection' is a term primarily used in psychology to describe the unconscious process of attributing one's own thoughts, feelings, or motives to another person. It is often a defense mechanism to avoid acknowledging personal flaws. The term is more common in academic or therapeutic contexts rather than everyday conversation. Understanding the concept requires some familiarity with psychological principles.","priority":"★★☆"},"example_sentences":[{"sentence":"Her accusations of dishonesty were a clear case of self-projection.","translation":"彼女の不正直だという非難は、自己投影の明らかな例だった。","type":"noun","meaning_category":"psychological defense"},{"sentence":"The therapist helped him recognize his self-projection tendencies in his relationships.","translation":"セラピストは、彼が人間関係における自己投影の傾向を認識するのを助けた。","type":"noun","meaning_category":"psychological concept"},{"sentence":"He didn't realize he was using self-projection to avoid dealing with his own anger.","translation":"彼は、自身の怒りに向き合うことを避けるために自己投影を使っていることに気づいていなかった。","type":"noun","meaning_category":"defense mechanism"},{"sentence":"The critic's review seemed more like self-projection than an objective assessment of the film.","translation":"批評家のレビューは、映画の客観的な評価というよりは、自己投影のように思えた。","type":"noun","meaning_category":"attribution of feelings"}]}