{"word":"Intracephalic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"脳内の、頭蓋内の","english_definition":"Located or occurring within the brain or cranium.","examples":[{"sentence":"The intracephalic hemorrhage required immediate surgery.","translation":"脳内出血のため、直ちに手術が必要となった。"},{"sentence":"Intracephalic pressure can be a sign of serious injury.","translation":"脳内圧は重傷の兆候となりうる。"}],"collocations":["intracephalic pressure","intracephalic hemorrhage","intracephalic tumor"],"synonyms":["intracranial","cerebral"],"antonyms":["extracephalic"]}],"etymology":{"value":"The word \"intracephalic\" is formed from the prefix \"intra-\" (meaning within) combined with \"cephalic\" (relating to the head or brain), which itself comes from the Greek word \"kephalē\" (κέφαλη) meaning \"head.\"","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪntrəˈsɛfəlɪk/","syllables":"in-tra-ceph-a-lic"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"\"Intracephalic\" is a technical term used in medical and scientific contexts to describe something that is located or occurs within the brain or the cranial cavity. It is often used in discussions of injuries, diseases, or conditions affecting the brain.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor examined the extracephalic region for signs of injury.","correct":"✓ The doctor examined the intracephalic region for signs of injury.","note":"\"Intracephalic\" refers to within the brain, while \"extracephalic\" would refer to outside the brain but still within the head, or possibly even outside the head entirely. Using the wrong prefix changes the meaning significantly."}],"priority":"★★☆"},"related_words":{"derivatives":["intracranial (adjective): within the skull","encephalon (noun): the brain"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"intracephalic\" is a highly specialized medical term. It is typically encountered in scientific literature, medical reports, or discussions among healthcare professionals. Due to its technical nature, it is not commonly used in everyday language. Understanding the term requires knowledge of medical terminology and anatomy."},"example_sentences":[{"sentence":"An intracephalic aneurysm was detected during the MRI scan.","translation":"MRI検査中に脳内動脈瘤が検出された。","type":"medical","meaning_category":"within the brain"},{"sentence":"The drug is designed to target intracephalic receptors.","translation":"その薬は脳内の受容体を標的とするように設計されている。","type":"scientific","meaning_category":"within the brain"}]}