{"word":"unparcelled","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"区画されていない、分割されていない","english_definition":"Not divided into parcels or portions; undivided.","examples":[{"sentence":"The land remained unparcelled for many years.","translation":"その土地は長年区画されないままだった。"},{"sentence":"The estate was sold as one unparcelled unit.","translation":"その地所は分割されていない一つの単位として売却された。"}],"collocations":["unparcelled land","unparcelled estate"],"synonyms":["undivided","whole","intact"],"antonyms":["parcelled","divided","sectioned"]}],"etymology":{"value":"The word 'unparcelled' is formed by adding the prefix 'un-' (meaning 'not') to the word 'parcelled'. 'Parcelled' itself comes from 'parcel', which originally meant a small package or bundle, and later came to mean a piece of land.","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈpɑːrsəld/","syllables":"un-par-celled"},"inflection":{"notes":"This is an adjective, so it does not have different forms for tense. It can be used in comparative and superlative forms (more unparcelled, most unparcelled), but this is rare."},"usage_notes":{"explanation":"'Unparcelled' is a relatively uncommon word, primarily used in formal or legal contexts when describing land or property that has not been divided into smaller portions or parcels. It emphasizes the state of being undivided.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unparcelled gift was difficult to wrap.","correct":"✓ The single gift was difficult to wrap.","note":"'Unparcelled' refers to land or property, not to gifts or other objects. Use 'single' or 'undivided' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["parcel (noun, verb)","parcelled (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unparcelled' is a specialized term primarily used in legal or real estate contexts. It describes land or property that has not been divided into smaller, distinct portions. Understanding this word requires familiarity with the concept of land division and property law."},"example_sentences":[{"sentence":"The unparcelled acreage provided a vast, open space for development.","translation":"区画されていない広大な土地は、開発のための広々としたオープンスペースを提供した。","type":"adjective","meaning_category":"undivided land"},{"sentence":"The family decided to keep the land unparcelled to maintain its natural state.","translation":"家族は土地を自然な状態に保つために、区画しないことを決めた。","type":"adjective","meaning_category":"undivided land"}]}