{"word":"loathsomeness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"嫌悪感、憎悪、忌まわしさ、不快さ、嫌悪感を抱かせる性質","english_definition":"the quality or state of being loathsome; causing feelings of disgust, aversion, or intense dislike.","examples":[{"sentence":"The loathsomeness of the crime shocked the entire community.","translation":"その犯罪の忌まわしさは地域社会全体に衝撃を与えた。"},{"sentence":"He couldn't hide his disgust at the loathsomeness of the situation.","translation":"彼はその状況の不快さに対する嫌悪感を隠すことができなかった。"},{"sentence":"The loathsomeness of the dictator's actions led to widespread rebellion.","translation":"独裁者の行動の忌まわしさが広範囲にわたる反乱につながった。"}],"collocations":["extreme loathsomeness (極度の嫌悪感)","utter loathsomeness (完全な嫌悪感)","inherent loathsomeness (生来の嫌悪感)","moral loathsomeness (道徳的な嫌悪感)"],"synonyms":["repulsiveness","abhorrence","detestability","odiousness","disgustingness","revoltingness","nastiness","vileness","repugnance"],"antonyms":["attractiveness","pleasantness","delightfulness","agreeableness","desirability","loveliness"]}],"etymology":{"value":"Derived from the adjective 'loathsome,' which comes from 'loath' (reluctant, unwilling, averse) + '-some' (suffix indicating a quality or tendency). The suffix '-ness' is added to 'loathsomeness' to form the noun, indicating the state or quality of being loathsome.","priority":"★★★"},"pronunciation":{"ipa":"/ˈloʊθsəmnəs/","syllables":"loath-some-ness"},"inflection":{"noun_plural":"loathsomeness (uncountable noun)"},"usage_notes":{"explanation":"'Loathsomeness' is a noun that describes the quality of something that inspires strong feelings of disgust, aversion, or intense dislike. It is often used to describe actions, behaviors, or conditions that are morally reprehensible or physically repulsive. The word implies a deep-seated feeling of revulsion. It is a relatively formal word and is not commonly used in everyday conversation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The loathsomeness person.","correct":"The loathsome person.","note":"'Loathsomeness' is a noun, not an adjective. To describe a person who is loathsome, use the adjective 'loathsome.'"},{"incorrect":"I felt loathsomeness.","correct":"I felt loathing.","note":"'Loathsomeness' is the quality of being loathsome, not the feeling itself. The feeling of disgust or aversion is 'loathing.'"}],"priority":"★★☆"},"related_words":{"derivatives":["loathsome (adjective: causing feelings of disgust or aversion)","loathe (verb: to feel intense dislike or disgust for)","loathing (noun: a feeling of intense dislike or disgust)","loath (adjective: reluctant; unwilling)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Loathsomeness' is a relatively uncommon and formal word. It is used to describe the quality of something that causes strong feelings of disgust or aversion. Understanding the word requires a good vocabulary and an ability to comprehend abstract concepts. It is more likely to be encountered in literature, academic writing, or formal speeches than in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The sheer loathsomeness of the crime made it difficult to even discuss.","translation":"その犯罪のあまりの忌まわしさに、議論することさえ困難だった。","type":"noun","meaning_category":"嫌悪感、忌まわしさ"},{"sentence":"The loathsomeness of his betrayal was unforgivable.","translation":"彼の裏切りの忌まわしさは許しがたいものだった。","type":"noun","meaning_category":"嫌悪感、憎悪"},{"sentence":"She was overwhelmed by the loathsomeness of the conditions in the prison.","translation":"彼女は刑務所の状況の忌まわしさに圧倒された。","type":"noun","meaning_category":"不快さ"}]}