{"word":"Fabulists","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"作り話をする人、寓話作家","english_definition":"A person who tells or creates fables; a person who tells lies or fabricates stories.","examples":[{"sentence":"The fabulists of old used animals to convey moral lessons.","translation":"昔の寓話作家たちは動物を使って道徳的な教訓を伝えた。"},{"sentence":"He dismissed the politician as a fabulist, claiming that his promises were empty.","translation":"彼は政治家のことを作り話をする人だと切り捨て、彼の約束は空虚だと主張した。"}],"collocations":["literary fabulist","political fabulist"],"synonyms":["storyteller","liar","fabricator","mythmaker","raconteur"],"antonyms":["truth-teller","historian","reporter"]}],"etymology":{"value":"Derived from 'fabulist', which comes from the Latin 'fabula' meaning 'story' or 'fable'.","priority":"★★★"},"pronunciation":{"ipa":"ˈfæbjʊlɪsts","syllables":"fab-u-lists"},"inflection":{"noun_plural":"Fabulists"},"usage_notes":{"explanation":"'Fabulists' refers to individuals who create or tell fables, often with a moral or allegorical purpose. It can also refer to people who habitually tell lies or fabricate stories, especially to deceive or impress others. The term carries a slightly negative connotation when used to describe someone who lies.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a good fabulist because he always tells the truth.","correct":"✓ He is a good storyteller, but not a fabulist, because he always tells the truth.","note":"Fabulists are associated with making up stories, so someone who tells the truth would not be described as one."}],"priority":"★★☆"},"related_words":{"derivatives":["fable","fabulism","fabulistic"],"phrases":["fabulist tradition","fabulist literature"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'fabulists' is not commonly used in everyday conversation. It is more likely to appear in literary or academic contexts when discussing storytelling, mythology, or instances of deception. Understanding the word requires familiarity with the concept of fables and the act of fabrication."},"example_sentences":[{"sentence":"The ancient Greek fabulists, like Aesop, are still read today.","translation":"イソップのような古代ギリシャの寓話作家たちは、今日でも読まれている。","type":"general","meaning_category":"storyteller"},{"sentence":"Critics accused the author of being a fabulist, distorting historical events for dramatic effect.","translation":"批評家たちは、その作家が劇的な効果のために歴史的な出来事を歪曲する作り話をする人だと非難した。","type":"general","meaning_category":"liar"}]}