{"word":"nonadornment","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"装飾の欠如、無装飾、飾り気のないこと","english_definition":"The state of being without adornment; lack of ornamentation.","examples":[{"sentence":"The beauty of the room lay in its simplicity and nonadornment.","translation":"その部屋の美しさは、そのシンプルさと装飾のなさの中にあった。"},{"sentence":"The artist favored nonadornment, believing it allowed the true form to shine.","translation":"そのアーティストは無装飾を好み、それによって真の形が輝きを放つと信じていた。"},{"sentence":"The philosophy of nonadornment extends to her personal style as well.","translation":"無装飾の哲学は、彼女の個人的なスタイルにも及んでいる。"}],"collocations":["simple nonadornment (シンプルな無装飾)","austere nonadornment (質素な無装飾)","deliberate nonadornment (意図的な無装飾)","studied nonadornment (計算された無装飾)"],"synonyms":["simplicity","plainness","unadornment","austerity","bareness","lack of embellishment"],"antonyms":["adornment","embellishment","ornamentation","decoration","elaboration"]}],"etymology":{"value":"\"Non-\" (否定の接頭辞) + \"adornment\" (装飾)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnəˈdɔːrnmənt/","syllables":"non-a-dorn-ment"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"\"Nonadornment\" is a relatively formal term that emphasizes the absence of decoration or embellishment. It is often used in discussions of art, architecture, design, and personal style, where the lack of adornment is a deliberate choice or aesthetic principle. It can also imply a sense of simplicity, purity, or authenticity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonadornment was very beautiful.","correct":"✓ The lack of adornment was very beautiful. / ✓ The simplicity was very beautiful.","note":"While grammatically correct, using \"nonadornment\" as a subject can sound awkward. It's often better to rephrase using \"lack of adornment\" or a synonym like \"simplicity.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["adornment (装飾)","unadorned (飾りのない)"],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nonadornment\" is a formal term that means the absence of decoration or ornamentation. It is often used in discussions about art, design, or philosophy where simplicity and lack of embellishment are valued. The word itself is formed by adding the prefix \"non-\" to \"adornment,\" which means decoration. Understanding this word requires a relatively advanced vocabulary and an understanding of abstract concepts related to aesthetics and design. It is not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The architect chose nonadornment to highlight the building's clean lines.","translation":"建築家は、建物のすっきりとしたラインを強調するために無装飾を選んだ。","type":"general","meaning_category":"lack of ornamentation"},{"sentence":"Her preference for nonadornment reflected her minimalist lifestyle.","translation":"彼女の無装飾の好みは、彼女のミニマリストなライフスタイルを反映していた。","type":"personal style","meaning_category":"lack of ornamentation"},{"sentence":"The museum's exhibit focused on the beauty of nonadornment in ancient pottery.","translation":"博物館の展示は、古代の陶器における無装飾の美しさに焦点を当てていた。","type":"art","meaning_category":"lack of ornamentation"}]}