{"word":"queer-spirited","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"風変わりな精神の、奇妙な心の、異質な精神を持つ","english_definition":"Having a spirit or disposition that is unconventional, eccentric, or odd.","examples":[{"sentence":"The artist was known for his queer-spirited approach to painting.","translation":"その芸術家は、絵画に対する風変わりな精神で知られていた。"},{"sentence":"Her queer-spirited nature made her a fascinating and unpredictable friend.","translation":"彼女の奇妙な心の持ち主である性質が、彼女を魅力的で予測不可能な友人にした。"},{"sentence":"The novel features a queer-spirited protagonist who challenges societal norms.","translation":"その小説は、社会の規範に挑戦する異質な精神を持つ主人公を特徴としている。"}],"collocations":["queer-spirited artist","queer-spirited individual","queer-spirited approach","queer-spirited nature","queer-spirited character"],"synonyms":["unconventional","eccentric","odd","peculiar","unorthodox","idiosyncratic","whimsical","unusual","strange","singular"],"antonyms":["conventional","ordinary","normal","typical","commonplace"]},{"part_of_speech":"adjective","definition":"（古用法）元気の良い、活発な","english_definition":"(Archaic) Lively; spirited.","examples":[{"sentence":"The old horse, though aged, was still queer-spirited.","translation":"その老いた馬は、年老いてはいたが、まだ元気だった。"}],"collocations":["queer-spirited horse","queer-spirited youth"],"synonyms":["lively","spirited","vigorous","animated","vivacious"],"antonyms":["lethargic","sluggish","dull"]}],"etymology":{"value":"The term combines \"queer,\" originally meaning strange or odd, with \"spirited,\" indicating a particular disposition or character. The meaning has evolved over time, reflecting changes in the connotations of \"queer.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkwɪər ˈspɪrɪtɪd/","syllables":"queer-spir-it-ed"},"inflection":{"notes":"Adjective; comparative and superlative forms are generally formed using \"more\" and \"most\" (e.g., more queer-spirited, most queer-spirited)."},"usage_notes":{"explanation":"The term \"queer-spirited\" can have two primary interpretations. The more common, contemporary usage refers to someone with an unconventional, eccentric, or odd disposition. In this sense, it describes a personality that deviates from the norm. The archaic usage refers to liveliness and vigor, though this is rarely encountered today. Context is crucial to understanding the intended meaning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a queer-spirited in the traditional sense.","correct":"✓ He was queer-spirited in the unconventional sense.","note":"Ensure the context clarifies whether you are referring to the archaic sense of lively or the modern sense of unconventional."},{"incorrect":"✗ The term is often used to describe someone's sexual orientation.","correct":"✓ The term describes someone's personality or disposition, not necessarily their sexual orientation.","note":"While \"queer\" can refer to sexual orientation, \"queer-spirited\" primarily describes a personality trait."}],"priority":"★★☆"},"related_words":{"derivatives":["queer (adjective, noun, verb)","spirit (noun)","spirited (adjective)"],"phrases":["free-spirited","odd-spirited","eccentric-spirited"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Rare and nuanced usage)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Queer-spirited\" is a relatively uncommon term that describes someone with an unconventional, eccentric, or odd personality. It suggests a disposition that deviates from societal norms. The word \"queer\" originally meant strange or odd, and when combined with \"spirited,\" it describes a particular kind of character. It is important to distinguish this term from the use of \"queer\" to describe sexual orientation, as \"queer-spirited\" primarily refers to personality. The archaic meaning of lively or spirited is rarely used today. Context is key to understanding the intended meaning."},"example_sentences":[{"sentence":"The author's queer-spirited characters often find themselves at odds with the conservative society around them.","translation":"その作家の風変わりな精神の登場人物は、しばしば周囲の保守的な社会と対立する。","type":"adjective","meaning_category":"unconventional"},{"sentence":"Despite his age, he remained queer-spirited and full of energy.","translation":"彼は年齢にもかかわらず、元気でエネルギーに満ち溢れていた。","type":"adjective","meaning_category":"lively (archaic)"},{"sentence":"Her queer-spirited ideas challenged the status quo and inspired others to think differently.","translation":"彼女の異質な精神のアイデアは現状に挑戦し、他の人に異なる考え方を促した。","type":"adjective","meaning_category":"unconventional"}]}