{"word":"side-hustling","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"副業をすること、本業以外に収入を得るための活動","english_definition":"The act of pursuing a side hustle, which is a part-time job or business undertaken in addition to one's primary employment, typically for supplemental income.","examples":[{"sentence":"Side-hustling has become increasingly popular among millennials looking to supplement their income.","translation":"副業は、収入を補いたいと考えているミレニアル世代の間でますます人気が高まっています。"},{"sentence":"She's been side-hustling as a freelance writer to pay off her student loans faster.","translation":"彼女は学資ローンの返済を早く済ませるために、フリーランスのライターとして副業をしています。"},{"sentence":"Side-hustling allows him to explore his passions while still having the security of a full-time job.","translation":"副業をすることで、彼はフルタイムの仕事の安定性を保ちながら、自分の情熱を探求することができます。"}],"collocations":["start side-hustling","successful side-hustling","profitable side-hustling","creative side-hustling"],"synonyms":["moonlighting","freelancing","entrepreneurship","side job","gig economy"],"antonyms":["full-time employment","main job","primary occupation"]}],"etymology":{"value":"Derived from the term 'side hustle,' which combines 'side' (referring to something secondary or additional) and 'hustle' (meaning to work hard or energetically, especially to make money). The '-ing' suffix turns it into a gerund or present participle, denoting the activity itself.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsaɪdˌhʌslɪŋ/","syllables":"side-hus-tling"},"inflection":{"noun_forms":{"singular":"side-hustling","plural":null},"verb_forms":{"present_participle":"side-hustling","gerund":"side-hustling"}},"usage_notes":{"explanation":"'Side-hustling' refers specifically to the *activity* of having a side hustle. It emphasizes the active pursuit and effort involved in generating additional income outside of one's main job. It's a modern term often associated with entrepreneurship, creativity, and financial independence.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a side-hustling.","correct":"✓ He is side-hustling. / ✓ He is doing side-hustling.","note":"'Side-hustling' is often used as a gerund (noun) describing the activity. You can say 'He is side-hustling' (less common) or 'He is doing side-hustling' (more common). To describe someone who does side hustles, you would say 'He is a side hustler.'"},{"incorrect":"✗ Side-hustling is a job.","correct":"✓ Side-hustling is an activity. / ✓ A side hustle is a job.","note":"'Side-hustling' is the *activity* of having a side hustle. A 'side hustle' itself can be considered a job or business."}],"priority":"★★☆"},"related_words":{"derivatives":["side hustle (noun: 副業)","side hustler (noun: 副業をする人)"],"phrasal_verbs":[],"related_terms":["entrepreneur","freelancer","gig worker","self-employment","passive income","financial independence"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Moderately frequent (比較的新しい用語)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Side-hustling' is a term used to describe the activity of earning money from a part-time job or business in addition to your main job. It's a modern concept often associated with people who are entrepreneurial and looking to increase their income or pursue their passions. The term implies an active effort to generate extra income.","priority":"★★☆"},"example_sentences":[{"sentence":"Many young professionals are turning to side-hustling to supplement their income and gain new skills.","translation":"多くの若い専門家が、収入を補い、新しいスキルを習得するために副業を始めています。","type":"noun","meaning_category":"副業をすること"},{"sentence":"Side-hustling can be a great way to explore your interests and build a business on the side.","translation":"副業は、自分の興味を探求し、本業の傍らでビジネスを構築するのに最適な方法です。","type":"noun","meaning_category":"副業をすること"},{"sentence":"She found success in side-hustling as a virtual assistant, managing social media for small businesses.","translation":"彼女は中小企業のソーシャルメディアを管理するバーチャルアシスタントとして副業で成功を収めました。","type":"noun","meaning_category":"副業をすること"}]}