{"word":"focalisation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(物語論における)焦点化、焦点的視点","english_definition":"(in narratology) the perspective through which a narrative is presented; the point of view from which the story is told.","examples":[{"sentence":"The novel uses internal focalisation, allowing the reader to experience the events through the protagonist's eyes.","translation":"その小説は内的焦点化を用いており、読者は主人公の視点を通して出来事を体験できる。"},{"sentence":"Shifting focalisation between characters provides a more complete understanding of the story.","translation":"登場人物間で焦点化をシフトさせることで、物語をより完全に理解できる。"},{"sentence":"The use of external focalisation creates a sense of distance between the reader and the characters.","translation":"外的焦点化を用いることで、読者と登場人物の間に距離感が生まれる。"}],"collocations":["internal focalisation (内的焦点化)","external focalisation (外的焦点化)","zero focalisation (ゼロ焦点化)","point of view","narrative perspective"],"synonyms":["point of view","perspective","narrative voice","viewpoint"],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'focalise' (or 'focalize' in American English), which means to bring into focus or to concentrate. The term gained prominence in narratology through the work of Gérard Genette, a French literary theorist.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfəʊkəlaɪˈzeɪʃən/","syllables":"fo-ca-li-sa-tion"},"inflection":{"noun_plural":"focalisations"},"usage_notes":{"explanation":"'Focalisation' is a narratological term referring to the perspective or filter through which a story is presented. It's not simply who is telling the story (narration), but rather who is seeing or perceiving the events. Gérard Genette distinguished between 'who is narrating?' (narration) and 'who is seeing?' (focalisation). There are three main types:\n\n*   **Internal Focalisation:** The story is presented through the perspective of a single character. The reader only knows what that character knows or perceives.\n*   **External Focalisation:** The narrator describes the events from an outside perspective, without access to the characters' thoughts or feelings.\n*   **Zero Focalisation:** An omniscient narrator knows everything about the characters and events, and can access their thoughts and feelings. This is sometimes referred to as non-focalisation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The focalisation was narrated by the main character.","correct":"✓ The story was focalised through the main character.","note":"Focalisation is not *narrated*, it is the *perspective through which* the story is told. Narration refers to the act of telling the story, while focalisation refers to the perspective from which the story is viewed."},{"incorrect":"✗ The author uses focalisation to tell the story.","correct":"✓ The author uses focalisation to shape the reader's understanding of the story.","note":"While technically correct, it's more precise to say that focalisation shapes the *reader's understanding* or *perspective* rather than simply 'telling' the story. Narration tells the story; focalisation shapes how it is perceived."}],"priority":"★★☆"},"related_words":{"derivatives":["focalise (verb)","focalize (verb - American English)","focaliser (noun)","focalizer (noun - American English)"],"related_terms":["narratology","narration","point of view","perspective","narrative","omniscient narrator","limited narrator"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - a specialized term used primarily in literary studies.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Focalisation' is a term used in the study of stories (narratology). It refers to the perspective from which the story is told – who is 'seeing' the events. Think of it like a camera lens: is the camera inside a character's head (internal focalisation), outside observing (external focalisation), or able to see everything (zero focalisation)? Understanding focalisation helps you analyze how a story creates empathy, distance, or suspense. It's more about *how* the story is presented than *who* is telling it."},"example_sentences":[{"sentence":"The film's use of subjective camera angles enhances the internal **focalisation**.","translation":"その映画における主観的なカメラアングルの使用は、内的焦点化を高める。","type":"noun","meaning_category":"焦点的視点"},{"sentence":"Through external **focalisation**, the reader only knows what the character does, not what they think.","translation":"外的焦点化を通して、読者は登場人物が何をするかを知るだけで、何を考えているかは知らない。","type":"noun","meaning_category":"焦点的視点"},{"sentence":"Genette's theory of **focalisation** revolutionized narrative analysis.","translation":"ジュネットの焦点化理論は、物語分析に革命をもたらした。","type":"noun","meaning_category":"焦点的視点"}]}