{"word":"guarded-looking","meanings":[{"part_of_speech":"adjective","definition":"用心深い顔つきの、警戒しているような表情の","english_definition":"having an appearance that suggests caution, wariness, or a reluctance to reveal one's true feelings or thoughts.","examples":[{"sentence":"The suspect gave a guarded-looking glance to the detective.","translation":"容疑者は刑事に対して用心深い顔つきでちらっと目をやった。"},{"sentence":"She had a guarded-looking expression, as if she didn't trust anyone.","translation":"彼女は誰のことも信用していないかのように、警戒しているような表情をしていた。"},{"sentence":"Despite his friendly words, he had a guarded-looking demeanor.","translation":"友好的な言葉とは裏腹に、彼は用心深い様子だった。"}],"collocations":["guarded-looking expression","guarded-looking glance","guarded-looking demeanor","guarded-looking face","guarded-looking eyes"],"synonyms":["wary","cautious","suspicious","distrustful","reserved","noncommittal","circumspect"],"antonyms":["open","trusting","candid","forthcoming","naive","unsuspecting"],"related_words":["guarded (形容詞: 用心深い、警戒している)","look (名詞: 外見、表情)"],"level_frequency":{},"usage_notes":{"explanation":"\"Guarded-looking\" describes someone whose appearance suggests they are being careful about what they say or do, often because they are suspicious or trying to hide something. It focuses on the visual impression of caution or wariness.","priority":"★★★"},"pronunciation":{},"inflection":{},"etymology":{},"common_mistakes":{},"readability_explanation":{"level":"B2","text":"\"Guarded-looking\" is a compound adjective that combines \"guarded\" (cautious, careful) and \"looking\" (referring to appearance). It describes someone whose face or expression suggests they are being cautious or wary. This word is most often used to describe someone's facial expression or demeanor when they are feeling uncertain, suspicious, or unwilling to reveal their true thoughts or feelings. It implies a sense of reserve or a lack of openness."},"example_sentences":[{"sentence":"The witness gave a guarded-looking response when asked about the incident.","translation":"証人は事件について尋ねられた際、用心深い顔つきで答えた。","type":"general"},{"sentence":"The politician had a guarded-looking smile during the press conference.","translation":"政治家は記者会見中、用心深い顔つきで微笑んだ。","type":"general"},{"sentence":"The new employee had a guarded-looking attitude, making it difficult to get to know them.","translation":"新しい従業員は用心深い態度で、なかなか打ち解けられなかった。","type":"general"}]}]}