{"word":"Kashyapa","priority":"★★☆","meanings":[{"part_of_speech":"proper noun","definition":"(ヒンドゥー教/仏教) カシャパ（迦葉） - 古代インドの聖仙（リシ）の名。ヒンドゥー教の神話や仏教経典に登場する重要な人物","english_definition":"In Hindu/Buddhist traditions: An ancient sage (rishi) appearing in Hindu mythology and Buddhist scriptures as a significant figure.","examples":[{"sentence":"Kashyapa is considered one of the Saptarishi (seven great sages) in Hinduism.","translation":"カシャパはヒンドゥー教におけるサプタリシ（七人の偉大な聖仙）の一人とされる。"},{"sentence":"In Buddhist texts, Mahakashyapa was a principal disciple of Buddha.","translation":"仏典では、摩訶迦葉（マハーカシャパ）は仏陀の主要な弟子であった。"}],"cultural_context":["ヒンドゥー教ではプラジャーパティ（生物の創造者）の一人とされる","仏教では仏陀の十大弟子の一人「摩訶迦葉」として知られる","ジャイナ教の経典にも言及あり"],"synonyms":["Maharishi Kashyapa","Kasyapa (別綴り)"]},{"part_of_speech":"proper noun","definition":"(現代インド) カシャパ姓 - インドのブラフミン（僧侶階級）に多い姓氏の一つ","english_definition":"A common Brahmin surname in modern India.","examples":[{"sentence":"Dr. Rajiv Kashyapa is a renowned historian from Delhi.","translation":"ラジーヴ・カシャパ博士はデリー出身の著名な歴史学者である。"}]}],"etymology":{"value":"サンスクリット語「कश्यप (Kaśyapa)」に由来。語源は「कश्य (kaśya)」（亀）＋「प (pa)」（飲む者）で「亀を飲む者」を意味するとされるが、正確な語源は不明。古代インドの聖仙名として紀元前1000年以前から文献に登場。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkʌʃjəpə/","syllables":"Kash-ya-pa"},"cultural_notes":{"explanation":"カシャパはインド文化圏で極めて重要な文化的・宗教的象徴です。ヒンドゥー教では創造神話に関わり、仏教では初期教団の指導者として重要な役割を果たしました。特に仏教における摩訶迦葉（マハーカシャパ）は、仏陀から直接教えを受け継いだとされ、禅宗では初祖とみなされることもあります。現代インドではブラフミン階級の由緒ある姓として受け継がれています。","priority":"★★★"},"related_figures":[{"name":"Mahakashyapa (摩訶迦葉)","description":"仏陀の十大弟子の筆頭。頭陀行（苦行）で知られ、霊鷲山で仏陀の「拈華微笑」の教えを受けたとされる"},{"name":"Kashyapa Buddha (迦葉仏)","description":"過去七仏の第六仏。釈迦仏以前の仏陀"}],"level_frequency":{"CEFR":"C2 (専門的な宗教/文化文脈)","frequency_google_ngram":"低頻度 (Low frequency) - 主に宗教/学術文脈で使用","priority":"★☆☆"},"example_sentences":[{"sentence":"According to Hindu texts, Kashyapa married the thirteen daughters of Daksha.","translation":"ヒンドゥー教の文献によれば、カシャパはダクシャの13人の娘たちと結婚した。","context":"ヒンドゥー神話"},{"sentence":"The Kashyapa Samhita is an ancient text on Ayurveda.","translation":"カシャパ・サンヒターはアーユルヴェーダに関する古代文献である。","context":"インド医学"},{"sentence":"Mahakashyapa presided over the First Buddhist Council after Buddha's parinirvana.","translation":"摩訶迦葉は仏陀の入滅後、第一結集を主宰した。","context":"仏教史"}]}