{"word":"puddingstone","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"礫岩（れきがん）の一種で、丸みを帯びた小石が自然のセメントで固められたもの。","english_definition":"A type of conglomerate rock consisting of rounded pebbles naturally cemented together.","examples":[{"sentence":"The walls of the old building were made of puddingstone.","translation":"その古い建物の壁はプディングストーンでできていた。"},{"sentence":"Puddingstone is often used for decorative purposes.","translation":"プディングストーンは装飾目的でよく使われる。"}],"collocations":["puddingstone conglomerate","jasper puddingstone","glacial puddingstone"],"synonyms":["conglomerate","pebble conglomerate"],"antonyms":[]}],"etymology":{"value":"その見た目がプディングに似ていることから名付けられた。小石がフルーツケーキやプディングの中のドライフルーツのように見えるため。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpʊdɪŋˌstoʊn/","syllables":"pud-ding-stone"},"inflection":{"noun_plural":"puddingstones"},"usage_notes":{"explanation":"Puddingstone is a type of sedimentary rock. The pebbles within the stone are typically well-rounded and can be composed of various materials such as quartz, jasper, and other minerals. The 'cement' that binds the pebbles together is usually made of silica, calcite, or iron oxide.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I found a pudding stone on the beach.","correct":"✓ I found a puddingstone on the beach.","note":"The word is one word, not two. 'Pudding stone' is not correct."}],"priority":"★★★"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Puddingstone is a relatively uncommon geological term referring to a specific type of conglomerate rock characterized by its rounded pebbles cemented together, resembling a pudding or conglomerate dessert. Understanding requires some familiarity with basic geology and rock types."},"example_sentences":[{"sentence":"The fireplace was constructed from colorful pieces of puddingstone.","translation":"暖炉は色とりどりのプディングストーンで造られていた。","type":"noun","meaning_category":"礫岩"},{"sentence":"Geologists study puddingstone to understand ancient river systems.","translation":"地質学者は古代の河川システムを理解するためにプディングストーンを研究する。","type":"noun","meaning_category":"礫岩"}]}