{"word":"consignors","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)委託者、発送人","english_definition":"(plural form) people or companies that consign goods to another party for sale or distribution; shippers.","examples":[{"sentence":"The consignors were responsible for packaging the goods securely.","translation":"委託者たちは商品を安全に梱包する責任があった。"},{"sentence":"We need to verify the identities of all consignors before accepting their shipments.","translation":"出荷を受け入れる前に、すべての委託者の身元を確認する必要があります。"},{"sentence":"The list of consignors included both domestic and international businesses.","translation":"委託者リストには、国内および海外の企業が含まれていました。"}],"collocations":["list of consignors (委託者リスト)","identify consignors (委託者を特定する)","verify consignors (委託者を確認する)","major consignors (主要な委託者)","domestic consignors (国内の委託者)","international consignors (海外の委託者)"],"synonyms":["shippers","senders","forwarders","dispatchers","transferors"],"antonyms":["consignees","receivers"]},{"part_of_speech":"noun","definition":"(法律)委託販売人、委託者","english_definition":"(law) A person who consigns goods to an agent for sale.","examples":[{"sentence":"The consignors retain ownership of the goods until they are sold.","translation":"委託者は商品が販売されるまで所有権を保持します。"},{"sentence":"The agreement outlines the responsibilities of both the consignors and the consignees.","translation":"契約書には、委託者と受託者の両方の責任が概説されています。"},{"sentence":"The consignors are entitled to a commission on each sale.","translation":"委託者は各販売に対して手数料を受け取る権利があります。"}],"collocations":["agreement between consignors and consignees (委託者と受託者間の契約)","rights of consignors (委託者の権利)","responsibilities of consignors (委託者の責任)","obligations of consignors (委託者の義務)"],"synonyms":["principal","owner","bailor"],"antonyms":["consignee","agent","bailee"]}],"etymology":{"value":"Derived from 'consignor,' which comes from 'consign' (to send goods to someone to sell) + '-or' (agent suffix). 'Consign' comes from Latin 'consignare' (to seal, register), from 'com-' (together) + 'signare' (to mark, seal).","priority":"★★☆"},"pronunciation":{"ipa":"/kənˈsaɪnərz/","syllables":"con-sign-ors"},"inflection":{"noun_plural":"consignors"},"usage_notes":{"explanation":"'Consignors' is the plural form of 'consignor.' It refers to multiple individuals or entities that send goods to another party (the consignee) for the purpose of sale or distribution. The consignors retain ownership of the goods until they are sold by the consignee. This term is commonly used in business, shipping, and legal contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The consignors is responsible for the shipment.","correct":"✓ The consignors are responsible for the shipment.","note":"Since 'consignors' is plural, use the plural form of the verb ('are' instead of 'is')."},{"incorrect":"✗ The consignors send the goods to the customer directly.","correct":"✓ The consignors send the goods to the consignee.","note":"Consignors send goods to a consignee, who then sells or distributes them. They do not typically send goods directly to the end customer."}],"priority":"★★☆"},"related_words":{"derivatives":["consignor (singular form of consignors)","consign (verb: to send goods to someone to sell)","consignment (noun: the act of consigning; goods that are consigned)","consignee (noun: the person or company to whom goods are consigned)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in business and legal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Consignors' refers to multiple parties who send goods to another party (consignee) for sale or distribution, while retaining ownership until the goods are sold. This term is primarily used in business, logistics, and legal contexts. Understanding this term requires familiarity with business and legal terminology related to shipping and sales agreements."},"example_sentences":[{"sentence":"The **consignors** provided detailed invoices for all the goods shipped.","translation":"委託者たちは出荷されたすべての商品について詳細な請求書を提供した。","type":"noun","meaning_category":"委託者"},{"sentence":"Many of the **consignors** were small business owners looking to expand their market reach.","translation":"委託者の多くは、市場の範囲を拡大しようとしている中小企業のオーナーでした。","type":"noun","meaning_category":"委託者"},{"sentence":"The contract outlined the responsibilities of the **consignors** in case of damage during transit.","translation":"契約書には、輸送中の損傷の場合における委託者の責任が概説されていました。","type":"noun","meaning_category":"委託者"}]}