{"word":"Intrametropolitan","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"大都市圏内の、都市圏内の","english_definition":"Located or operating within a single metropolitan area.","examples":[{"sentence":"Intrametropolitan migration patterns are influenced by housing costs.","translation":"都市圏内の移住パターンは住宅コストの影響を受ける。"},{"sentence":"The study focused on intrametropolitan commuting distances.","translation":"その研究は都市圏内の通勤距離に焦点を当てた。"}],"collocations":["intrametropolitan area","intrametropolitan transport","intrametropolitan commuting"],"synonyms":["urban","metropolitan","local"],"antonyms":["intermetropolitan","rural","exurban"]}],"etymology":{"value":"The word \"intrametropolitan\" is formed by combining the prefix \"intra-\" (meaning within) with \"metropolitan\" (relating to a metropolis or urban area).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌɪntrəmɛtrəˈpɒlɪtən/","syllables":"in-tra-me-tro-po-li-tan"},"inflection":{"notes":"Adjective, no inflection."},"usage_notes":{"explanation":"\"Intrametropolitan\" is used to describe something that exists or occurs within the boundaries of a single metropolitan area. It is often used in the context of urban planning, transportation, and demographics. It distinguishes activities or phenomena that are contained within a single urban region from those that occur between different metropolitan areas (intermetropolitan) or in rural areas.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The intrametropolitan train connects different cities.","correct":"✓ The intermetropolitan train connects different cities.","note":"Intrametropolitan refers to connections within a single metropolitan area, while intermetropolitan refers to connections between different metropolitan areas."}],"priority":"★☆☆"},"related_words":{"derivatives":["metropolitan","intermetropolitan"],"phrasal_verbs":[],"related_terms":["urban","suburban","exurban","rural"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"intrametropolitan\" is a specialized term primarily used in academic or professional contexts related to urban studies, geography, and planning. It is not commonly used in everyday language. Understanding the prefix \"intra-\" (within) and the term \"metropolitan\" (relating to a city and its surrounding areas) is essential to grasp its meaning. The word helps to specify activities, patterns, or phenomena that occur inside a single urban region, as opposed to between different urban regions or in non-urban areas."},"example_sentences":[{"sentence":"The report analyzed intrametropolitan variations in income levels.","translation":"その報告書は都市圏内の所得水準の変動を分析した。","type":"general","meaning_category":"General usage"},{"sentence":"Efficient intrametropolitan transportation is crucial for economic growth.","translation":"効率的な都市圏内交通は経済成長に不可欠である。","type":"transportation","meaning_category":"Transportation"},{"sentence":"Intrametropolitan residential segregation remains a significant social issue.","translation":"都市圏内の居住 segregation は依然として重要な社会問題である。","type":"social issues","meaning_category":"Social Issues"}]}