{"word":"cogitatively","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"熟考的に、思索的に、深く考えて","english_definition":"In a thoughtful or meditative manner; with deep consideration.","examples":[{"sentence":"He stroked his chin cogitatively, considering the problem before him.","translation":"彼は顎をさすりながら、目の前の問題を熟考的に考えた。"},{"sentence":"She listened cogitatively to the speaker, absorbing every detail.","translation":"彼女は講演者の話を思索的に聞き、細部まで吸収した。"}],"collocations":["ponder cogitatively","consider cogitatively","reflect cogitatively","think cogitatively"],"synonyms":["thoughtfully","meditatively","reflectively","deliberately","intently","pensively"],"antonyms":["thoughtlessly","superficially","rashly","frivolously"]}],"etymology":{"value":"Derived from the adjective 'cogitative', which comes from the Latin 'cogitare' (to think, consider). The suffix '-ly' transforms it into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒdʒɪˈteɪtɪvli/","syllables":"cog-i-ta-tive-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Cogitatively' is used to describe actions performed in a deeply thoughtful or reflective manner. It implies a level of seriousness and intent in one's thinking. It is not a commonly used word, and its use often lends a formal or intellectual tone to the writing or speech.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He cogitatively smiled.","correct":"✓ He smiled thoughtfully.","note":"'Cogitatively' describes the manner of thinking, not the manner of expressing emotion. 'Thoughtfully' is a better fit here."},{"incorrect":"✗ She cogitatively ran to the store.","correct":"✓ She thoughtfully considered her shopping list before running to the store.","note":"'Cogitatively' implies deep thought, which is unlikely to be associated with running. A more appropriate usage involves a thoughtful consideration before acting."}],"priority":"★★☆"},"related_words":{"derivatives":["cogitate (verb: to think deeply about something)","cogitation (noun: the act of thinking deeply about something)","cogitative (adjective: characterized by or involving careful thought)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Cogitatively' is a formal and uncommon adverb that describes the act of thinking deeply and reflectively. It is typically used in academic or literary contexts to convey a sense of serious and deliberate contemplation. Due to its rarity, it is more likely to be encountered in written rather than spoken English, and understanding its meaning requires a strong vocabulary and familiarity with formal language."},"example_sentences":[{"sentence":"The professor paused, stroking his beard cogitatively before answering the student's complex question.","translation":"教授は学生の複雑な質問に答える前に、顎ひげを撫でながら熟考的に間を置いた。","type":"adverb","meaning_category":"熟考的に"},{"sentence":"She studied the ancient text cogitatively, searching for hidden meanings and historical context.","translation":"彼女は古代のテキストを思索的に研究し、隠された意味と歴史的背景を探した。","type":"adverb","meaning_category":"思索的に"},{"sentence":"He approached the ethical dilemma cogitatively, weighing each possible outcome with careful consideration.","translation":"彼は倫理的なジレンマに熟考的に取り組み、起こりうるすべての結果を慎重に検討した。","type":"adverb","meaning_category":"深く考えて"}]}