{"word":"Kuchean","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"クチャ語の、クチャに関連する","english_definition":"Relating to the Kuchean language or the ancient city of Kucha.","examples":[{"sentence":"Kuchean texts provide valuable insights into Tocharian languages.","translation":"クチャ語のテキストは、トカラ語族に関する貴重な洞察を提供します。"},{"sentence":"The Kuchean kingdom played a significant role in the Silk Road trade.","translation":"クチャ王国はシルクロードの貿易において重要な役割を果たしました。"}],"collocations":["Kuchean language","Kuchean kingdom","Kuchean art","Kuchean manuscripts"],"synonyms":["Tocharian A","Kucha"],"antonyms":[]},{"part_of_speech":"noun","definition":"クチャ語","english_definition":"An extinct Indo-European language of the Tocharian branch, spoken in the ancient kingdom of Kucha.","examples":[{"sentence":"Kuchean is also known as Tocharian A.","translation":"クチャ語はトカラ語Aとしても知られています。"},{"sentence":"Scholars have reconstructed aspects of Kuchean grammar.","translation":"学者たちはクチャ語の文法のある側面を再構築しました。"}],"collocations":["Tocharian A","extinct language","Indo-European language"],"synonyms":["Tocharian A"],"antonyms":[]}],"etymology":{"value":"From Kucha, the name of an ancient oasis city-state on the Silk Road, plus the suffix '-ean'.","priority":"★★☆"},"pronunciation":{"ipa":"/kuːˈtʃiːən/","syllables":"Ku-che-an"},"inflection":{"notes":"N/A"},"usage_notes":{"explanation":"'Kuchean' refers specifically to the language and culture of the ancient city-state of Kucha, located on the Silk Road. It is often used in the context of linguistics, history, and archaeology when discussing the Tocharian languages and the history of Central Asia.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Kuchean is a modern language spoken in China.","correct":"✓ Kuchean was an ancient language spoken in the kingdom of Kucha.","note":"Kuchean is an extinct language, not a modern one."}],"priority":"★☆☆"},"related_words":{"derivatives":["Kucha","Tocharian"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Kuchean' is specialized and primarily encountered in academic contexts related to linguistics, history, and archaeology. Understanding requires familiarity with the history of the Silk Road and the Tocharian languages."},"example_sentences":[{"sentence":"The discovery of Kuchean manuscripts shed light on the religious practices of the region.","translation":"クチャ語の写本の発見は、その地域の宗教的慣習に光を当てました。","type":"adjective","meaning_category":"Relating to Kucha"},{"sentence":"The study of Kuchean provides insights into the evolution of Indo-European languages.","translation":"クチャ語の研究は、インド・ヨーロッパ語族の進化に関する洞察を提供します。","type":"noun","meaning_category":"Kuchean language"}]}