{"word":"Jeremian","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"エレミヤの、エレミヤ風の","english_definition":"Relating to or characteristic of the prophet Jeremiah or his writings; lamenting or mournful.","examples":[{"sentence":"The poem had a Jeremian tone, full of sorrow and regret.","translation":"その詩はエレミヤ風の調子で、悲しみと後悔に満ちていた。"},{"sentence":"He delivered a Jeremian warning about the impending doom of the city.","translation":"彼は都市に迫る破滅について、エレミヤのような警告を発した。"}],"collocations":["Jeremian lament","Jeremian prophecy","Jeremian warning"],"synonyms":["lamenting","mournful","plaintive","elegiac","threnodic"],"antonyms":["joyful","optimistic","cheerful"]},{"part_of_speech":"noun","definition":"悲観論者、悲嘆に暮れる人","english_definition":"A person who is pessimistic or given to lamentation.","examples":[{"sentence":"Don't be such a Jeremian; things aren't as bad as they seem.","translation":"そんなに悲観的にならないで。物事は見かけほど悪くないよ。"},{"sentence":"The Jeremians in the group predicted the project's inevitable failure.","translation":"グループの悲観論者たちは、プロジェクトの必然的な失敗を予測した。"}],"collocations":["a political Jeremian","an economic Jeremian"],"synonyms":["pessimist","doomsayer","prophet of doom","Cassandra"],"antonyms":["optimist","Pollyanna"]}],"etymology":{"value":"Derived from the name of the Hebrew prophet Jeremiah, known for his prophecies of doom and lamentations over the destruction of Jerusalem.","priority":"★★★"},"pronunciation":{"ipa":"/ˌdʒɛrəˈmaɪən/","syllables":"Je-re-mi-an"},"inflection":{"notes":"The noun form can be pluralized as 'Jeremians'."},"usage_notes":{"explanation":"The word 'Jeremian' is relatively uncommon. As an adjective, it describes something that is reminiscent of the prophet Jeremiah's style, which is characterized by sorrow, lamentation, and warnings of impending doom. As a noun, it refers to a person who is pessimistic and prone to making dire predictions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a Jeremia attitude.","correct":"✓ He had a Jeremian attitude.","note":"The correct adjective form is 'Jeremian', not 'Jeremia'."}],"priority":"★☆☆"},"related_words":{"derivatives":["Jeremiad (noun: a long, mournful complaint or lamentation)"],"phrases":["prophet Jeremiah","Book of Jeremiah"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Jeremian' is a relatively rare word, primarily used in literary or historical contexts to describe something reminiscent of the prophet Jeremiah's style, characterized by lamentation and warnings of doom. It can also refer to a person who is pessimistic and prone to making dire predictions. Understanding the reference to the prophet Jeremiah is key to understanding the word's meaning."},"example_sentences":[{"sentence":"The historian wrote in a distinctly Jeremian style, emphasizing the decline of the empire.","translation":"その歴史家は明らかにエレミヤ風の文体で書き、帝国の衰退を強調した。","type":"adjective","meaning_category":"エレミヤの、エレミヤ風の"},{"sentence":"The economic analysts were dismissed as Jeremians for their gloomy forecasts.","translation":"経済アナリストたちは、その暗い予測のために悲観論者として退けられた。","type":"noun","meaning_category":"悲観論者"}]}