{"word":"Unipersonalist","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"A person who believes in Unipersonalism, a nontrinitarian Christian belief that God is absolutely one person, in contrast to the Trinity.","english_definition":"A proponent or believer in Unipersonalism, a theological doctrine asserting that God is a single person, rejecting the concept of the Trinity.","examples":[{"sentence":"The debate between Trinitarians and Unipersonalists has a long history in Christian theology.","translation":"三位一体論者と単一体人格論者の間の議論は、キリスト教神学において長い歴史を持つ。"},{"sentence":"Some early Christian groups held Unipersonalist views.","translation":"初期のキリスト教グループの中には、単一体人格論の考えを持っていたものもあった。"}],"collocations":["Unipersonalist theology","Unipersonalist view","debate with Trinitarians"],"synonyms":["Monarchianist","Sabellian"],"antonyms":["Trinitarian"]},{"part_of_speech":"adjective","definition":"Relating to or characteristic of Unipersonalism.","english_definition":"Pertaining to or characteristic of Unipersonalism; advocating the belief in one person as God.","examples":[{"sentence":"Unipersonalist arguments often focus on biblical passages that emphasize the oneness of God.","translation":"単一体人格論の議論は、神の唯一性を強調する聖書の箇所に焦点を当てることが多い。"},{"sentence":"The Unipersonalist perspective differs significantly from mainstream Christian doctrine.","translation":"単一体人格論的な視点は、主流のキリスト教の教義とは大きく異なる。"}],"collocations":["Unipersonalist doctrine","Unipersonalist interpretation","Unipersonalist perspective"],"synonyms":["Monarchian","Sabellian"],"antonyms":["Trinitarian"]}],"etymology":{"value":"Derived from 'Unipersonalism,' which combines 'uni-' (one) + 'personal' (relating to a person) + '-ism' (doctrine or belief).","priority":"Medium"},"pronunciation":{"ipa":"/ˌjuːnɪˈpɜːrsənəlɪst/","syllables":"U-ni-per-son-a-list"},"inflection":{"noun_plural":"Unipersonalists"},"usage_notes":{"explanation":"'Unipersonalist' is primarily used in theological contexts when discussing different views on the nature of God within Christianity. It is important to use this term accurately to avoid misrepresenting theological positions.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Unitarian, so he must be a Unipersonalist.","correct":"✓ He is a Unitarian, and some Unitarians hold Unipersonalist views, but not all.","note":"While some Unitarians may hold Unipersonalist views, the terms are not interchangeable. Unitarianism is a broader theological movement."}],"priority":"Low"},"related_words":{"derivatives":["Unipersonalism","Personalism","Monotheism"],"related_terms":["Trinity","Unitarianism","Modalism","Sabellianism"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C2","text":"The term 'Unipersonalist' is highly specialized and primarily used in theological discussions. Understanding requires familiarity with Christian theology and nontrinitarian beliefs. The term is rarely encountered outside of academic or religious contexts."},"example_sentences":[{"sentence":"As a Unipersonalist, he rejected the traditional doctrine of the Trinity.","translation":"単一体人格論者として、彼は伝統的な三位一体の教義を拒否した。","type":"noun","meaning_category":"Believer in Unipersonalism"},{"sentence":"The Unipersonalist interpretation of scripture emphasizes the singularity of God.","translation":"聖書の単一体人格論的解釈は、神の単一性を強調する。","type":"adjective","meaning_category":"Relating to Unipersonalism"}]}