{"word":"soulical","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"霊的な、魂に関する","english_definition":"relating to the soul or spiritual matters","examples":[{"sentence":"The ceremony had a deep soulical significance.","translation":"その儀式には深い霊的な意義があった。"},{"sentence":"Her music touches something soulical in listeners.","translation":"彼女の音楽は聴く者の魂に触れる何かがある。"}],"notes":"This is a rare and somewhat archaic term, primarily used in theological or philosophical contexts. It's often considered a synonym for 'spiritual' but with more emphasis on the soul itself rather than spirit.","synonyms":["spiritual","psychical","inner"],"antonyms":["physical","corporeal","material"]}],"etymology":{"value":"Late 16th century: from soul + -ical, perhaps modeled on physical. The formation parallels words like 'physical' (physic + -al) but applied to the soul rather than the body.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈsoʊlɪkəl/","syllables":"soul-i-cal"},"usage_notes":{"explanation":"This term is extremely rare in modern usage. It appears occasionally in older theological texts or poetic contexts. Most modern writers would use 'spiritual' instead. When encountered, it typically carries a more psychological or inward-focused connotation than 'spiritual,' emphasizing the individual soul's experiences rather than connection to divine realms.","priority":"★☆☆"},"related_words":{"derivatives":[],"similar":["spiritual","psychical","noetic","pneumatic (in theological sense)"]},"level_frequency":{"CEFR":"Not applicable (extremely rare term)","frequency_google_ngram":"Extremely low - appears fewer than 0.000001% of the time in English texts","priority":"★☆☆"},"example_sentences":[{"sentence":"The ancient text describes soulical transformations during meditation.","translation":"古代の文献は瞑想中の魂の変容を描写している。","type":"adjective","meaning_category":"霊的な"},{"sentence":"His approach to healing considers both physical and soulical aspects.","translation":"彼の癒しのアプローチは身体的側面と魂的側面の両方を考慮する。","type":"adjective","meaning_category":"魂に関する"}]}