{"word":"Coercible","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"強制可能な、強制できる","english_definition":"Capable of being coerced; able to be compelled by force or intimidation.","examples":[{"sentence":"The witness was coercible, and the lawyer knew he could manipulate her testimony.","translation":"その証人は強制可能であり、弁護士は彼女の証言を操作できると知っていた。"},{"sentence":"The software's settings were coercible, allowing administrators to enforce specific configurations.","translation":"そのソフトウェアの設定は強制可能であり、管理者は特定の構成を強制することができた。"}],"collocations":["coercible witness (強制可能な証人)","coercible setting (強制可能な設定)","coercible behavior (強制可能な行動)"],"synonyms":["compellable","enforceable","amenable","susceptible"],"antonyms":["unyielding","resistant","intractable","uncoercible"]}],"etymology":{"value":"Derived from the verb 'coerce,' with the addition of the suffix '-ible' (or '-able'), indicating capability or possibility. 'Coerce' comes from the Latin 'coercere,' meaning 'to restrain, control, or compel.'","priority":"★★☆"},"pronunciation":{"ipa":"/koʊˈɜːrsɪbəl/","syllables":"co-er-ci-ble"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more coercible' and 'most coercible,' respectively."},"usage_notes":{"explanation":"'Coercible' describes something or someone that can be forced or compelled to do something against their will. It implies a susceptibility to coercion, whether through physical force, threats, or other forms of pressure. The term is often used in legal, political, or technical contexts to describe the enforceability or manipulability of certain actions, settings, or individuals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The coercible evidence was thrown out of court.","correct":"✓ The coerced evidence was thrown out of court.","note":"'Coercible' describes the *potential* to be coerced, whereas 'coerced' describes something that *has been* coerced. In this case, the evidence was actually coerced, not just capable of being coerced."},{"incorrect":"✗ The system was coercible to unauthorized access.","correct":"✓ The system was susceptible to unauthorized access.","note":"While 'coercible' can imply susceptibility, it's more accurate to use 'susceptible' or 'vulnerable' when describing a system's weakness to unauthorized access. 'Coercible' typically applies to actions or settings that can be enforced, not vulnerabilities."}],"priority":"★★☆"},"related_words":{"derivatives":["coerce (verb)","coercion (noun)","coercive (adjective)","uncoercible (adjective)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Coercible' is a relatively uncommon word that means 'capable of being coerced.' It is used to describe something or someone that can be forced or compelled to do something against their will. This word is more often found in formal or technical contexts, such as legal or political discussions. Because it is not a common word, it is important to understand its meaning and context before using it."},"example_sentences":[{"sentence":"The contract was deemed invalid because the signature was obtained under coercible circumstances.","translation":"その契約は、署名が強制可能な状況下で得られたため、無効とみなされた。","type":"general","meaning_category":"強制可能な状況"},{"sentence":"The software settings were designed to be coercible, allowing administrators to enforce security policies.","translation":"そのソフトウェアの設定は強制可能になるように設計されており、管理者はセキュリティポリシーを強制できる。","type":"technical","meaning_category":"強制可能な設定"},{"sentence":"The witness's testimony was questionable because she seemed coercible.","translation":"その証人の証言は、彼女が強制可能に見えたため、疑わしかった。","type":"legal","meaning_category":"強制可能な証人"}]}