{"word":"Olivet","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"オリーブ山 (Mount of Olives)","english_definition":"A mountain ridge east of Jerusalem, mentioned in the Bible.","examples":[{"sentence":"Jesus often went to Olivet to pray.","translation":"イエスは祈るためにしばしばオリーブ山に行った。"},{"sentence":"The Mount of Olivet offers a panoramic view of Jerusalem.","translation":"オリーブ山からはエルサレムのパノラマの景色が見渡せる。"}],"collocations":["Mount of Olivet","Garden of Gethsemane (ゲッセマネの園 - オリーブ山の麓にある)"],"synonyms":["Mount of Olives"],"antonyms":[]},{"part_of_speech":"proper noun","definition":"オリヴェ (フランスの都市)","english_definition":"A commune in the Loiret department in north-central France.","examples":[{"sentence":"Olivet is located near Orléans.","translation":"オリヴェはオルレアンの近くに位置している。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Latin *Olivetum*, meaning 'place of olive trees'. Referring to the abundance of olive trees on the Mount of Olives. For the French city, the name likely has similar origins related to olive cultivation in the region.","priority":"★★☆"},"pronunciation":{"ipa":"ˈɒlɪvɛt","syllables":"O-li-vet"},"inflection":{},"usage_notes":{"explanation":"\"Olivet\" is primarily known as the Mount of Olives, a significant location in the Bible, especially in the New Testament. It's associated with events in the life of Jesus. Less commonly, it refers to the French town of Olivet. When encountering the word, consider the context to determine whether it refers to the biblical site or the French commune.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Olivet is a sea.","correct":"✓ Olivet is a mountain.","note":"Olivet is a mountain (the Mount of Olives), not a body of water."}],"priority":"★☆☆"},"related_words":{"derivatives":["Olive (オリーブ)","Olive branch (オリーブの枝 - 平和の象徴)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Olivet\" is a proper noun with two main meanings: the Mount of Olives, a historically and religiously significant mountain near Jerusalem, and a town in France. Understanding the context is crucial to determine the intended meaning. The Mount of Olives is more widely known due to its biblical importance. The word is not commonly used in everyday conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The Garden of Gethsemane is on the western slope of the Mount of Olivet.","translation":"ゲッセマネの園はオリーブ山の西側の斜面にある。","type":"noun","meaning_category":"オリーブ山"},{"sentence":"Olivet is a charming town with a rich history.","translation":"オリヴェは豊かな歴史を持つ魅力的な町です。","type":"proper noun","meaning_category":"フランスの都市"}]}