{"word":"Mirzas","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"Plural form of Mirza. Mirza is a historical title of Persian origin, denoting a royal or aristocratic lineage.","english_definition":"Plural of Mirza, a title of Persian origin used to designate princes or members of the high aristocracy.","examples":[{"sentence":"The Mughal court was filled with Mirzas and other nobles.","translation":"ムガル帝国の宮廷は、ミルザ家の人々やその他の貴族でいっぱいだった。"},{"sentence":"Many Mirzas held important positions in the government.","translation":"多くのミルザ家の者が政府の重要な地位を占めていた。"}],"collocations":["The Mirzas of Persia","The Mughal Mirzas"],"synonyms":["Princes","Nobles","Aristocrats"],"antonyms":[]}],"etymology":{"value":"From Persian 'Mirza' (میرزا), a contraction of 'Amirzadeh' (امیرزاده), meaning 'son of a prince' or 'born of a prince'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɜːrzəz/","syllables":"Mir-zas"},"inflection":{"noun_plural":"Mirzas"},"usage_notes":{"explanation":"'Mirzas' refers to multiple individuals holding the title 'Mirza', typically indicating a family or group of aristocratic or royal descent. It is often used in historical contexts related to Persian, Mughal, or other related cultures.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["Mirza","Amirzadeh"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency due to its specific historical and cultural context.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mirzas' is a plural noun referring to multiple individuals who hold the title 'Mirza,' a historical title of Persian origin indicating royal or aristocratic lineage. This term is primarily encountered in historical or cultural contexts related to Persia, the Mughal Empire, or other regions influenced by Persian culture. Understanding this term requires familiarity with historical social structures and titles of nobility."},"example_sentences":[{"sentence":"The chronicles mention several Mirzas who played key roles in the dynasty.","translation":"年代記には、王朝で重要な役割を果たした数人のミルザ家の者が記録されている。","type":"noun","meaning_category":"Historical Title"},{"sentence":"The Mirzas were known for their patronage of the arts.","translation":"ミルザ家は芸術の擁護者として知られていた。","type":"noun","meaning_category":"Aristocracy"}]}