{"word":"Millionairism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A system or ideology that promotes or favors the interests of millionaires; the pursuit of becoming a millionaire or the values associated with being a millionaire.","english_definition":"A system or ideology that promotes or favors the interests of millionaires; the pursuit of becoming a millionaire or the values associated with being a millionaire.","examples":[{"sentence":"The politician was accused of promoting millionairism through his tax policies.","translation":"その政治家は、彼の税制政策を通じて富豪主義を推進していると非難された。"},{"sentence":"Some argue that millionairism leads to increased social inequality.","translation":"富豪主義は社会的不平等の増大につながると主張する人もいる。"}],"collocations":["promote millionairism","criticize millionairism","effects of millionairism"],"synonyms":["wealth worship","plutocracy","affluenza"],"antonyms":["egalitarianism","socialism","communism"]}],"etymology":{"value":"Derived from 'millionaire' (someone who possesses a million or more units of currency) with the suffix '-ism' (denoting a doctrine, principle, or ideology).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɪljənˈɛərɪzəm/","syllables":"mil-ion-air-ism"},"inflection":{"noun_plural":"Millionairisms"},"usage_notes":{"explanation":"'Millionairism' is a relatively uncommon term that describes an ideology or system centered around the interests and values of millionaires. It often carries a negative connotation, suggesting that the pursuit of wealth and the interests of the wealthy are prioritized over broader social concerns.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He supports millionairism because he is a millionaire.","correct":"✓ He supports millionairism because he believes it benefits the economy.","note":"Supporting millionairism doesn't automatically mean someone is a millionaire, but rather that they believe in the principles or benefits associated with it."}],"priority":"★☆☆"},"related_words":{"derivatives":["millionaire","-ism"],"related_concepts":["capitalism","wealth inequality","social mobility"]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Millionairism' is a complex and rare term. It refers to a system of beliefs or practices that favor the interests of millionaires. Understanding this word requires a good grasp of economic and political concepts, as it is often used in discussions about wealth distribution and social inequality. It's important to note that this term can carry a negative connotation, implying that the interests of the wealthy are prioritized over those of the general population."},"example_sentences":[{"sentence":"Critics argue that the government's policies are fostering millionairism at the expense of the working class.","translation":"批判者たちは、政府の政策が労働者階級を犠牲にして富豪主義を助長していると主張している。","type":"general","meaning_category":"ideology"},{"sentence":"The rise of millionairism has led to increased scrutiny of wealth accumulation and its societal impact.","translation":"富豪主義の台頭は、富の蓄積とその社会への影響に対する精査の強化につながっている。","type":"general","meaning_category":"ideology"}]}