{"word":"trashrack","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(水路・ダムなどの)除塵設備、ごみ除去格子","english_definition":"A screen or grating used to prevent debris from entering a water intake or other hydraulic structure.","examples":[{"sentence":"The trashrack prevented large debris from entering the dam's intake.","translation":"除塵設備は、大きなゴミがダムの取水口に入るのを防ぎました。"},{"sentence":"Regular cleaning of the trashrack is essential to maintain efficient water flow.","translation":"効率的な水の流れを維持するためには、除塵設備の定期的な清掃が不可欠です。"}],"collocations":["clean the trashrack (除塵設備を清掃する)","install a trashrack (除塵設備を設置する)","trashrack design (除塵設備の設計)","trashrack maintenance (除塵設備のメンテナンス)"],"synonyms":["screen","grating","debris screen","intake screen"],"antonyms":[]}],"etymology":{"value":"'Trash' (ごみ) + 'rack' (格子) の複合語。水路や取水口からゴミを取り除くための格子状の構造物を指す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtræʃˌræk/","syllables":"trash-rack"},"inflection":{"noun_plural":"trashracks"},"usage_notes":{"explanation":"'Trashrack' は、水力発電所、灌漑システム、下水処理場などの水路や取水口に設置され、大きなゴミや浮遊物が設備に流入するのを防ぐために使用される専門用語です。定期的なメンテナンスと清掃が必要です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The trashrack was full of trash.","correct":"✓ The trashrack was full of debris.","note":"'Trash' は一般家庭から出るようなゴミを指すことが多いですが、'trashrack' が除去するものは、木の枝、葉、大きなゴミなど、水路を流れる自然由来のものが多いため、'debris' (瓦礫、ゴミ) を使う方がより適切です。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - 特定の分野でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Trashrack' is a technical term used in the context of water management and hydraulic engineering. It refers to a screen or grating placed at the entrance of a water intake or other hydraulic structure to prevent large debris from entering and potentially damaging the equipment or obstructing the flow of water. This term is not commonly used in everyday conversation and is primarily encountered in technical documents or discussions related to water infrastructure. Understanding this term requires familiarity with the vocabulary of engineering and water resource management."},"example_sentences":[{"sentence":"The city invested in a new trashrack system to protect its water supply.","translation":"市は、給水を保護するために新しい除塵設備システムに投資しました。","type":"noun","meaning_category":"除塵設備"},{"sentence":"Divers were sent to clear the accumulated debris from the trashrack.","translation":"ダイバーが派遣され、除塵設備から蓄積されたゴミを取り除きました。","type":"noun","meaning_category":"除塵設備"}]}