{"word":"Acidite","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A type of igneous rock characterized by a high silica content and alkali feldspar composition, specifically containing more sodium than potassium. It is the extrusive equivalent of syenite.","english_definition":"An extrusive igneous rock with high silica content and alkali feldspar composition, richer in sodium than potassium; the extrusive equivalent of syenite.","examples":[{"sentence":"The volcanic landscape was dominated by flows of Acidite.","translation":"その火山地形はアシダイトの溶岩流によって特徴づけられていた。"},{"sentence":"Analysis of the rock sample confirmed it to be an Acidite.","translation":"岩石試料の分析により、それがアシダイトであることが確認された。"}],"collocations":["Acidite lava","Acidite flow","Acidite composition","Acidite rock","Acidite sample"],"synonyms":["alkali rhyolite","comendite","pantellerite"],"antonyms":[]}],"etymology":{"value":"Derived from 'acid' (referring to the high silica content) and the suffix '-ite' (commonly used for rock names).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈæsɪdaɪt/","syllables":"A-ci-dite"},"inflection":{"noun_plural":"Acidites"},"usage_notes":{"explanation":"Acidite is primarily a geological term used to classify a specific type of volcanic rock. It is relatively uncommon in everyday language and is mainly used in scientific and technical contexts related to geology and petrology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The acidite was very quiet.","correct":"✓ The Acidite sample was analyzed in the lab.","note":"'Acidite' refers to a rock type, not a state of being. Avoid using it in contexts where adjectives describing conditions are needed."}],"priority":"★★☆"},"related_words":{"derivatives":["acidic","acidification"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency; primarily a technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Acidite' is a technical term used in geology to describe a specific type of volcanic rock. Understanding this term requires knowledge of igneous rock classification and petrology. It is not commonly used outside of geological contexts."},"example_sentences":[{"sentence":"The geological survey identified several outcrops of Acidite in the region.","translation":"地質調査により、その地域でいくつかのアシダイトの露頭が確認された。","type":"noun","meaning_category":"Rock type"},{"sentence":"The chemical composition of the Acidite sample indicated a high concentration of sodium feldspar.","translation":"アシダイト試料の化学組成は、ナトリウム長石の高濃度を示していた。","type":"noun","meaning_category":"Rock type"}]}