{"word":"nondemolition","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"非破壊の、解体しない","english_definition":"Not involving demolition; preserving the existing structure or materials.","examples":[{"sentence":"The project used nondemolition methods to renovate the historic building.","translation":"そのプロジェクトでは、歴史的建造物を改修するために非破壊的な方法が用いられた。"},{"sentence":"Nondemolition testing can help identify structural weaknesses without causing damage.","translation":"非破壊検査は、損傷を与えることなく構造的な弱点を特定するのに役立つ。"}],"collocations":["nondemolition testing (非破壊検査)","nondemolition renovation (非破壊改修)","nondemolition methods (非破壊的な方法)"],"synonyms":["non-destructive","preservation-based","conservation-oriented"],"antonyms":["demolition","destructive"]}],"etymology":{"value":"Formed by adding the prefix \"non-\" (meaning \"not\") to the word \"demolition\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˌdɛməˈlɪʃən/","syllables":"non-de-mo-li-tion"},"inflection":{"notes":"This word is an adjective, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"\"Nondemolition\" is typically used in the context of construction, renovation, or testing where the goal is to avoid destroying or dismantling existing structures or materials. It emphasizes a preservation-focused approach.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The nondemolition building was beautiful.","correct":"✓ The building was renovated using nondemolition techniques.","note":"\"Nondemolition\" describes the *method* or *process*, not the building itself. It's better to say the building was renovated using nondemolition methods."}],"priority":"★★☆"},"related_words":{"derivatives":["demolition (noun)","demolish (verb)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Nondemolition\" is a specialized term used in construction, engineering, and related fields. It means that something is done without tearing down or destroying existing structures. If you see this word, it usually means that the focus is on preserving something rather than destroying it. It is formed by adding \"non-\" to \"demolition,\" which means tearing down."},"example_sentences":[{"sentence":"The company specializes in nondemolition asbestos removal.","translation":"その会社は、非破壊的なアスベスト除去を専門としている。","type":"adjective","meaning_category":"非破壊の"},{"sentence":"We opted for a nondemolition approach to repairing the foundation.","translation":"私たちは、基礎を修理するために非破壊的なアプローチを選んだ。","type":"adjective","meaning_category":"解体しない"}]}