{"word":"defiler","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"汚す者、冒涜者、堕落させる者","english_definition":"A person or thing that defiles; one who corrupts, pollutes, or violates the sanctity of something.","examples":[{"sentence":"He was branded a defiler of the temple after vandalizing the sacred space.","translation":"彼は神聖な場所を破壊した後、神殿の冒涜者として非難された。"},{"sentence":"The corporation was seen as a defiler of the environment due to its polluting practices.","translation":"その企業は、汚染行為により環境を汚染する者と見なされた。"},{"sentence":"She accused him of being a defiler of their relationship by betraying her trust.","translation":"彼女は彼が彼女の信頼を裏切ることで、彼らの関係を堕落させる者だと非難した。"}],"collocations":["a defiler of the environment","a defiler of sacred places","a defiler of traditions","a defiler of innocence"],"synonyms":["polluter","corruptor","profaner","violator","desecrator","contaminator"],"antonyms":["purifier","protector","preserver"]}],"etymology":{"value":"Derived from the verb 'defile,' which comes from the Old French 'defouler,' meaning 'to trample on, violate,' ultimately from Latin 'de-' (completely) + 'fullo' (to clean, scour, or trample cloth). The '-er' suffix indicates a person who performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈfaɪlər/","syllables":"de-fil-er"},"inflection":{"noun_plural":"defilers"},"usage_notes":{"explanation":"'Defiler' is typically used in contexts where something sacred, pure, or highly valued is being corrupted or violated. It often carries a strong negative connotation. The term can be applied to individuals, groups, or even abstract concepts that are seen as corrupting influences.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a defiler of the law, but he is not defiling anything.","correct":"He is a defiler of the law, but he is not currently defiling anything.","note":"The verb 'defiling' requires a direct object. If the action isn't happening, the sentence is grammatically incorrect."},{"incorrect":"The defiler is good person.","correct":"The defiler is a bad person.","note":"'Defiler' has a negative connotation, implying a person who does bad things. Therefore, describing a defiler as a 'good person' is contradictory."}],"priority":"★★☆"},"related_words":{"derivatives":["defile (verb): to make foul, dirty, or unclean; to pollute; to corrupt.","defilement (noun): the act of defiling; pollution; corruption.","undefiled (adjective): not defiled; pure; uncorrupted."],"phrases":["None common"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'defiler' is a relatively uncommon and sophisticated term used to describe someone who corrupts or pollutes something considered sacred or pure. It is often found in literature, religious texts, or formal discussions about morality and ethics. Understanding the word requires a grasp of abstract concepts and nuanced vocabulary."},"example_sentences":[{"sentence":"The ancient texts warned against the defilers of the sacred grove.","translation":"古代の文献は、聖なる森を汚す者たちに対して警告していた。","type":"noun","meaning_category":"汚す者、冒涜者"},{"sentence":"Environmental activists protested against the company, labeling it a defiler of the river.","translation":"環境活動家たちは、その会社を川の汚染者だと非難し、抗議活動を行った。","type":"noun","meaning_category":"汚す者、冒涜者"},{"sentence":"He was seen as a defiler of tradition for advocating radical changes to the established customs.","translation":"彼は確立された慣習への急進的な変化を提唱したため、伝統を堕落させる者と見なされた。","type":"noun","meaning_category":"汚す者、冒涜者"}]}