{"word":"Pinkertonism","priority":"低","meanings":[{"part_of_speech":"名詞","definition":"ピンカートン探偵社のやり方、特に労働争議におけるスト破りや労働者へのスパイ活動を指す言葉。","english_definition":"The methods and practices of the Pinkerton National Detective Agency, especially the use of strikebreakers and spies against labor unions.","examples":[{"sentence":"The miners accused the company of resorting to Pinkertonism to suppress their strike.","translation":"鉱山労働者たちは、会社がストを鎮圧するためにピンカートン探偵社のやり方に頼っていると非難した。"},{"sentence":"Pinkertonism was widely condemned by labor activists as a form of union busting.","translation":"ピンカートン探偵社のやり方は、労働運動家たちから組合潰しの一形態として広く非難された。"}],"collocations":["resort to Pinkertonism (ピンカートン探偵社のやり方に頼る)","Pinkertonism tactics (ピンカートン探偵社の戦術)","anti-Pinkertonism (反ピンカートン探偵社主義)"],"synonyms":["union busting","strikebreaking","labor spying"],"antonyms":[],"notes":"しばしば否定的な意味合いで使用される。"}],"etymology":{"value":"ピンカートン探偵社（Pinkerton National Detective Agency）の創設者であるアラン・ピンカートン（Allan Pinkerton）の名前に由来する。19世紀後半から20世紀初頭にかけて、同社は労働争議において企業側の用心棒やスト破りとして活動し、その強硬な手法が批判された。","priority":"中"},"pronunciation":{"ipa":"/ˈpɪŋkərtənɪzəm/","syllables":"Pin-ker-ton-ism"},"inflection":{"noun_plural":"Pinkertonisms (複数形はまれ)"},"usage_notes":{"explanation":"「Pinkertonism」は、歴史的な文脈において、企業が労働組合の活動を抑圧するために用いた強硬な手段を批判的に指す言葉です。現代では、同様の企業側の労働争議への介入を指して比喩的に用いられることもあります。","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"✗ The company embraced Pinkertonism to support the workers.","correct":"✓ The company was accused of using Pinkertonism against the workers.","note":"Pinkertonismは労働者弾圧の手法を指すため、労働者を支援するために用いるという文脈は不適切。"},{"incorrect":"✗ Pinkertonism is a modern approach to labor relations.","correct":"✓ Pinkertonism is a historical term referring to past labor practices.","note":"Pinkertonismは歴史的な用語であり、現代的な労働関係の手法とは言えない。"}],"priority":"低"},"related_words":{"derivatives":["Pinkerton (ピンカートン探偵社の社員、または関連するもの)"],"related_historical_events":["Homestead Strike (ホームステッドストライキ)","Pullman Strike (プルマンストライキ)"],"priority":"中"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度","priority":"低"},"readability_explanation":{"level":"C1","text":"「Pinkertonism」は、歴史的な文脈で使用される専門用語です。19世紀後半から20世紀初頭にかけて、ピンカートン探偵社が労働争議において企業側の用心棒やスト破りとして活動したことに由来します。この言葉は、企業が労働組合の活動を抑圧するために用いた強硬な手段を批判的に指す際に使用されます。労働史や社会運動史に関する知識があると、この単語の意味をより深く理解できます。"},"example_sentences":[{"sentence":"The use of private security forces in the strike was seen by many as a return to Pinkertonism.","translation":"そのストライキにおける私設警備部隊の利用は、多くの人々によってピンカートン探偵社のやり方への回帰と見なされた。","type":"noun","meaning_category":"労働争議におけるスト破りやスパイ活動"},{"sentence":"Historians often cite the Homestead Strike as a prime example of Pinkertonism in action.","translation":"歴史家はしばしば、ホームステッドストライキをピンカートン探偵社のやり方が実際に用いられた代表的な例として挙げる。","type":"noun","meaning_category":"労働争議におけるスト破りやスパイ活動"}]}