{"word":"non-driving","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"運転しない、運転を伴わない","english_definition":"Not involving driving; not related to the act of operating a vehicle.","examples":[{"sentence":"The conference included several non-driving activities, such as walking tours and museum visits.","translation":"その会議には、ウォーキングツアーや美術館訪問など、運転を伴わないアクティビティがいくつか含まれていました。"},{"sentence":"We are looking for a non-driving job that allows me to work from home.","translation":"在宅勤務ができる運転を伴わない仕事を探しています。"},{"sentence":"This medication may cause drowsiness, so it's important to avoid any driving or non-driving tasks that require alertness.","translation":"この薬は眠気を催す可能性があるため、運転や注意力を必要とする運転以外の作業は避けることが重要です。"}],"collocations":["non-driving job","non-driving activities","non-driving tasks"],"synonyms":["non-vehicular","sedentary (in some contexts)"],"antonyms":["driving","vehicular"]},{"part_of_speech":"noun","definition":"運転をしないこと","english_definition":"The state of not driving.","examples":[{"sentence":"His doctor recommended non-driving for a week after the surgery.","translation":"手術後、医師は1週間運転を控えることを勧めました。"},{"sentence":"We promote non-driving as a way to reduce traffic congestion and pollution.","translation":"交通渋滞と汚染を減らす方法として、運転をしないことを推進しています。"}],"collocations":["promote non-driving","recommend non-driving"],"synonyms":["abstaining from driving"],"antonyms":["driving"]}],"etymology":{"value":"Formed by adding the prefix \"non-\" (meaning \"not\") to the word \"driving\".","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn ˈdraɪvɪŋ/","syllables":"non-dri-ving"},"inflection":{"notes":"This word does not have typical inflections as it's a compound word. The plural form as a noun is rare."},"usage_notes":{"explanation":"'Non-driving' is generally used to describe activities, jobs, or situations that do not involve operating a motor vehicle. It is often used in contrast to 'driving' to highlight the absence of driving. It can also be used to describe the state of not driving, especially when it is a recommendation or requirement.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a non driving license.","correct":"✓ He doesn't have a driving license. / ✓ He has a non-driver ID.","note":"'Non-driving license' is not a common term. Instead, it's better to say 'He doesn't have a driving license' or, if referring to an identification card for non-drivers, 'non-driver ID'."}],"priority":"★★☆"},"related_words":{"derivatives":["driver","driving","non-driver"],"related_terms":["autonomous vehicle","public transportation","telecommuting"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Non-driving' is a straightforward compound word meaning 'not driving'. It is typically used in contexts where it is necessary to specify that an activity, job, or state does not involve operating a vehicle. It is more common in formal or technical contexts than in everyday conversation."},"example_sentences":[{"sentence":"The company offers a non-driving delivery service to customers in the area.","translation":"その会社は、地域のお客様に運転を伴わない配達サービスを提供しています。","type":"adjective","meaning_category":"運転しない"},{"sentence":"After the accident, she made a conscious decision to pursue non-driving modes of transportation.","translation":"事故後、彼女は意識的に運転をしない交通手段を選ぶことにしました。","type":"noun","meaning_category":"運転をしないこと"},{"sentence":"Many remote jobs are non-driving positions, allowing employees to work from home.","translation":"多くのリモートの仕事は、運転を伴わないポジションであり、従業員は自宅で働くことができます。","type":"adjective","meaning_category":"運転しない"}]}