{"word":"well-desired","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"強く望まれている、切望されている","english_definition":"Highly or greatly desired; eagerly sought after.","examples":[{"sentence":"The new smartphone is a well-desired item among tech enthusiasts.","translation":"その新しいスマートフォンは、テクノロジー愛好家の間で非常に人気のある商品です。"},{"sentence":"Peace and stability are well-desired outcomes for the region.","translation":"平和と安定は、その地域にとって強く望まれている結果です。"},{"sentence":"A well-desired vacation is what she needs after all her hard work.","translation":"彼女が一生懸命働いた後には、切望されている休暇が必要です。"}],"collocations":["well-desired outcome","well-desired item","well-desired goal","well-desired result","well-desired vacation"],"synonyms":["coveted","sought-after","in demand","popular","highly valued","cherished","yearned for"],"antonyms":["undesired","unwanted","unpopular","rejected","unwelcome"]}],"etymology":{"value":"The word is a compound adjective formed by combining \"well\" (meaning to a great extent or degree) with \"desired\" (past participle of the verb \"desire\", meaning to want something strongly). The combination indicates that something is wanted or desired to a great extent.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌwɛl dɪˈzaɪərd/","syllables":"well-de-sired"},"inflection":{"notes":"As an adjective, it can be modified by adverbs (e.g., 'very well-desired') but does not have comparative or superlative forms."},"usage_notes":{"explanation":"\"Well-desired\" is used to describe something that is highly valued and wanted by many people. It emphasizes the strong level of desire or demand for a particular item, outcome, or experience. It is often used in formal or descriptive contexts to highlight the desirability of something.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The well desired car.","correct":"✓ The well-desired car.","note":"Hyphenation is important when using \"well\" as part of a compound adjective before a noun. Without the hyphen, it might be misinterpreted as \"the car is desired well\" which doesn't make sense."},{"incorrect":"✗ The result was well desire.","correct":"✓ The result was well-desired.","note":"Ensure the correct form of \"desire\" is used. As a compound adjective, it should be \"well-desired\" (past participle form)."}],"priority":"★★☆"},"related_words":{"derivatives":["desire (noun, verb)","desirable (adjective)","desirability (noun)","undesired (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency compared to more common adjectives like 'popular' or 'sought-after'.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Well-desired\" is a somewhat sophisticated adjective used to describe something that is highly wanted or sought after. It is formed by combining \"well\" (meaning to a great extent) with \"desired\" (meaning wanted). This word is less common in everyday conversation and more likely to appear in formal writing or descriptive contexts where the speaker or writer wants to emphasize the high level of desire for something. Understanding this word can enhance comprehension of nuanced language in complex texts."},"example_sentences":[{"sentence":"The scholarship is a well-desired opportunity for students from disadvantaged backgrounds.","translation":"その奨学金は、恵まれない環境の学生にとって非常に望ましい機会です。","type":"adjective","meaning_category":"切望されている"},{"sentence":"A well-desired work-life balance is often difficult to achieve in today's demanding professional world.","translation":"今日の要求の厳しい専門職の世界では、切望されているワークライフバランスを達成することはしばしば困難です。","type":"adjective","meaning_category":"切望されている"},{"sentence":"The company's innovative products quickly became well-desired by consumers.","translation":"その会社の革新的な製品は、すぐに消費者から強く望まれるようになりました。","type":"adjective","meaning_category":"切望されている"}]}