{"word":"stern-wheeler","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"船尾外輪船、スターンホイーラー","english_definition":"A steamboat that is propelled by a paddle wheel located at the stern (rear) of the vessel.","examples":[{"sentence":"The stern-wheeler slowly made its way up the Mississippi River.","translation":"その船尾外輪船はゆっくりとミシシッピ川を遡っていった。"},{"sentence":"Stern-wheelers were a common sight on American rivers in the 19th century.","translation":"船尾外輪船は19世紀のアメリカの川ではよく見られる光景だった。"}],"collocations":["river stern-wheeler","historic stern-wheeler","paddle stern-wheeler","operate a stern-wheeler","ride a stern-wheeler"],"synonyms":["paddle steamer","paddle wheeler","steamboat"],"antonyms":[]}],"etymology":{"value":"The term 'stern-wheeler' is a compound word. 'Stern' refers to the rear part of a ship or boat. 'Wheeler' refers to a vessel propelled by a wheel. Therefore, 'stern-wheeler' literally means a vessel propelled by a wheel located at its stern.","priority":"★★★"},"pronunciation":{"ipa":"/ˈstɜːrnˌwiːlər/","syllables":"stern-wheel-er"},"inflection":{"noun_plural":"stern-wheelers"},"usage_notes":{"explanation":"'Stern-wheeler' specifically refers to steamboats that use a paddle wheel at the back (stern) for propulsion. These were particularly popular on rivers in the 19th and early 20th centuries, especially in North America. They are often associated with the Mississippi River and other large river systems.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The stern-wheeler has a wheel on the side.","correct":"✓ The stern-wheeler has a wheel on the stern.","note":"Stern-wheelers have the paddle wheel at the stern (rear), not on the side."},{"incorrect":"✗ Stern-wheelers are common on the ocean.","correct":"✓ Stern-wheelers are common on rivers.","note":"Stern-wheelers are designed for river navigation, not ocean travel."}],"priority":"★★☆"},"related_words":{"derivatives":["stern (noun: the rear part of a ship)","wheel (noun: a circular object that revolves on an axle)","steamboat (noun: a boat powered by steam)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Stern-wheeler' is a specialized term referring to a type of steamboat with a paddle wheel located at the stern (rear). Understanding this term requires some familiarity with nautical vocabulary and historical river transportation. The word is most commonly encountered in contexts related to the history of river travel, particularly in North America.","priority":"★★☆"},"example_sentences":[{"sentence":"The old stern-wheeler was a beautiful sight as it churned up the river.","translation":"その古い船尾外輪船が川をかき立てながら進む姿は美しい光景だった。","type":"noun","meaning_category":"description"},{"sentence":"Many tourists enjoy taking rides on restored stern-wheelers.","translation":"多くの観光客が復元された船尾外輪船に乗るのを楽しんでいる。","type":"noun","meaning_category":"tourism"},{"sentence":"The captain skillfully maneuvered the stern-wheeler through the narrow channel.","translation":"船長は熟練した操縦で船尾外輪船を狭い水路を通り抜けた。","type":"noun","meaning_category":"navigation"}]}