{"word":"Gummatous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ゴム腫性の、ゴム腫を特徴とする","english_definition":"Relating to or characterized by gummas (a characteristic soft, noncancerous growth typically resulting from tertiary syphilis).","examples":[{"sentence":"The patient presented with gummatous lesions on their skin.","translation":"患者は皮膚にゴム腫性の病変を呈した。"},{"sentence":"Gummatous syphilis is a late-stage manifestation of the disease.","translation":"ゴム腫性梅毒は、この疾患の後期症状である。"}],"collocations":["gummatous lesion","gummatous syphilis","gummatous ulceration"],"synonyms":["syphilomatous"],"antonyms":[]}],"etymology":{"value":"Derived from 'gumma,' referring to the rubbery or gummy texture of the lesions, plus the suffix '-ous,' indicating a quality or characteristic of.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡʌmətəs/","syllables":"gum-ma-tous"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. Comparative and superlative forms are possible but rare (more gummatous, most gummatous)."},"usage_notes":{"explanation":"'Gummatous' is a medical term primarily used in the context of tertiary syphilis. It describes lesions or conditions that are characterized by the presence of gummas. Its usage is largely confined to medical or scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The skin was gummatous and itchy.","correct":"✓ The skin exhibited gummatous lesions and was itchy.","note":"While 'gummatous' describes the nature of the lesion, it's better to specify the presence of lesions. Itchiness is a separate symptom."}],"priority":"★☆☆"},"related_words":{"derivatives":["gumma (noun: a soft, noncancerous growth associated with tertiary syphilis)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - Primarily a medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Gummatous' is a highly specialized medical term. Understanding it requires knowledge of pathology and infectious diseases, specifically syphilis. It is not commonly encountered outside of medical literature or clinical settings."},"example_sentences":[{"sentence":"Histological examination revealed gummatous inflammation in the affected tissue.","translation":"組織学的検査により、患部にゴム腫性炎症が認められた。","type":"adjective","meaning_category":"Medical pathology"},{"sentence":"The differential diagnosis included gummatous tuberculosis.","translation":"鑑別診断にはゴム腫性結核が含まれていた。","type":"adjective","meaning_category":"Medical diagnosis"}]}