{"word":"Jawboning","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(特に政府による)口先介入、口頭による説得、口頭指導","english_definition":"The act or practice of attempting to persuade or pressure individuals or businesses to take or refrain from taking certain actions through the use of public statements, speeches, or informal communications, rather than through formal regulations or legislation; especially by a government official.","examples":[{"sentence":"The president used jawboning to try to control inflation.","translation":"大統領はインフレを抑制するために口頭介入を行った。"},{"sentence":"The central bank engaged in jawboning to discourage excessive lending.","translation":"中央銀行は過剰な貸し出しを抑制するために口頭指導を行った。"},{"sentence":"Critics argue that jawboning is ineffective without the threat of stronger action.","translation":"批判家たちは、より強力な措置の脅しがなければ、口頭介入は効果がないと主張する。"}],"collocations":["engage in jawboning","use jawboning","government jawboning","presidential jawboning","economic jawboning"],"synonyms":["persuasion","exhortation","pressure","arm-twisting","informal influence"],"antonyms":["regulation","legislation","formal control","mandate"]},{"part_of_speech":"verb","definition":"(口頭で)説得する、圧力をかける、指導する","english_definition":"To attempt to persuade or pressure (someone) to do or refrain from doing something through public statements or informal communications.","examples":[{"sentence":"The government jawboned the company into lowering its prices.","translation":"政府はその企業に値下げするよう口頭で圧力をかけた。"},{"sentence":"The union leader jawboned the members to accept the contract.","translation":"労働組合のリーダーは組合員に契約を受け入れるよう口頭で説得した。"},{"sentence":"He jawboned the investors to remain patient during the economic downturn.","translation":"彼は投資家たちに景気低迷の間、辛抱強く待つよう口頭で指導した。"}],"collocations":["jawbone someone into doing something","jawbone someone to do something"],"synonyms":["persuade","exhort","pressure","influence","dissuade"],"antonyms":["mandate","regulate","legislate"]}],"etymology":{"value":"The term combines \"jaw\" (referring to talking) and \"bone\" (referring to strength or force). It suggests using one's jaw, or speech, as a tool to exert force or influence. The term gained prominence in the mid-20th century, particularly in the context of government economic policy.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒɔˌboʊnɪŋ/","syllables":"jaw-bon-ing"},"inflection":{"verb_forms":{"present_simple":["jawbone","jawbones"],"past_simple":"jawboned","past_participle":"jawboned","present_participle":"jawboning"},"noun_plural":"jawbonings"},"usage_notes":{"explanation":"\"Jawboning\" typically refers to actions taken by government officials or other influential figures to influence behavior without resorting to formal legal or regulatory measures. It often involves public statements, speeches, or private communications aimed at persuading businesses, organizations, or individuals to act in a certain way. The effectiveness of jawboning can vary depending on the credibility and influence of the person doing the jawboning, as well as the specific context and goals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The jawboning was written into law.","correct":"✓ The jawboning replaced the need for a law.","note":"Jawboning is an alternative to formal legal action, not something that is codified into law. It is used *instead* of legislation. "},{"incorrect":"✗ He jawboned with his fists.","correct":"✓ He jawboned with his words.","note":"Jawboning involves verbal persuasion, not physical force. The 'jaw' refers to the mouth and speaking."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["moral suasion","public pressure","economic policy","regulation","deregulation"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"比較的低頻度 (Relatively low frequency), but used in economics and political science contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Jawboning\" is a specialized term primarily used in economics and political science. It describes the act of government officials attempting to influence businesses or individuals through public statements and informal pressure, rather than through formal laws or regulations. Understanding this term requires familiarity with concepts of economic policy and government influence. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The Treasury Secretary used **jawboning** to try to stabilize the currency markets.","translation":"財務長官は通貨市場を安定させるために口頭介入を行った。","type":"noun","meaning_category":"口先介入"},{"sentence":"The regulator **jawboned** the banks into increasing their lending to small businesses.","translation":"規制当局は銀行に対し、中小企業への融資を増やすよう口頭で圧力をかけた。","type":"verb","meaning_category":"説得する"},{"sentence":"Some economists believe that **jawboning** is an ineffective tool for managing the economy.","translation":"一部の経済学者は、口頭介入は経済を管理するための効果的な手段ではないと考えている。","type":"noun","meaning_category":"口先介入"},{"sentence":"The governor **jawboned** the protesters, urging them to remain peaceful.","translation":"知事は抗議者たちに平和的であることを促し、口頭で説得した。","type":"verb","meaning_category":"説得する"}]}