{"word":"domesticatedly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"飼い慣らされたように、家庭的に、おとなしく","english_definition":"In a manner that indicates being tamed or accustomed to living in or around human habitations; in a way that suggests being docile or well-behaved within a household.","examples":[{"sentence":"The cat sat domesticatedly by the fireplace, purring softly.","translation":"猫は暖炉のそばに飼い慣らされたようにおとなしく座り、静かに喉を鳴らしていた。"},{"sentence":"He behaved domesticatedly during the family gathering, helping with chores and engaging in polite conversation.","translation":"彼は家族の集まりの間、家庭的に振る舞い、雑用を手伝ったり、丁寧な会話をしたりしていた。"}],"collocations":["behave domesticatedly","sit domesticatedly","live domesticatedly"],"synonyms":["tamely","docilely","submissively","meekly","obediently","civilly"],"antonyms":["wildly","untamedly","ferally","uncontrollably"]}],"etymology":{"value":"Derived from the adjective 'domesticated,' which comes from the verb 'domesticate.' 'Domesticate' originates from the Latin word 'domesticus,' meaning 'belonging to the house.' The suffix '-ly' is added to form the adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/dəˈmɛstɪˌkeɪtɪdli/","syllables":"do-mes-ti-cat-ed-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Domesticatedly' describes the manner in which someone or something behaves in a tamed, household-oriented, or obedient way. It is not a very common word, and its use often implies a contrast to a more wild or untamed state. It can be used to describe animals or, less commonly, people.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The dog domesticatedly barked at the mailman.","correct":"✓ The dog barked domesticatedly at the mailman.","note":"Adverbs typically modify verbs, adjectives, or other adverbs. Ensure the adverb is placed correctly to modify the intended word. In this case, 'domesticatedly' describes how the dog barked, not the dog itself."},{"incorrect":"✗ She lived very domesticatedly in the city.","correct":"✓ She lived a very domesticated life in the city.","note":"'Domesticatedly' is an adverb, so it modifies a verb. To describe her life, use the adjective 'domesticated' with a noun like 'life'."}],"priority":"★☆☆"},"related_words":{"derivatives":["domesticate (verb)","domesticated (adjective)","domestication (noun)","domestic (adjective, noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'domesticatedly' is an adverb that describes something done in a manner that is tame, accustomed to living with humans, or well-behaved within a household setting. It's not a commonly used word, so it's more likely to be encountered in formal writing or when specifically describing the behavior of an animal or person in a domestic context. Understanding the root word 'domesticate' helps in grasping its meaning.","priority":"★☆☆"},"example_sentences":[{"sentence":"The parrot perched domesticatedly on its stand, occasionally mimicking human speech.","translation":"オウムは飼い慣らされたようにスタンドにとまり、時折人間の言葉を真似ていた。","type":"adverb","meaning_category":"tame behavior"},{"sentence":"Although he was known for his rebellious youth, he now lived domesticatedly, enjoying gardening and quiet evenings at home.","translation":"彼は反抗的な若者として知られていたが、今では家庭的に暮らし、ガーデニングや家で静かな夜を過ごすことを楽しんでいる。","type":"adverb","meaning_category":"household-oriented behavior"}]}