{"word":"lesion-induced","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"病変誘発性の、損傷誘発性の","english_definition":"Caused by or resulting from a lesion (an area of damaged tissue).","examples":[{"sentence":"The study investigated lesion-induced behavioral changes in rats.","translation":"その研究では、ラットにおける病変誘発性の行動変化を調査した。"},{"sentence":"Lesion-induced plasticity in the brain can sometimes lead to functional recovery.","translation":"脳における病変誘発性の可塑性は、時に機能回復につながることがある。"}],"collocations":["lesion-induced damage","lesion-induced plasticity","lesion-induced behavioral changes"],"synonyms":["damage-induced","injury-related","trauma-caused"],"antonyms":["naturally occurring","spontaneous"],"notes":"This term is commonly used in medical and scientific contexts, particularly in neuroscience and pathology."}],"etymology":{"value":"Formed by combining 'lesion' (from Latin 'laesio', meaning 'injury') and 'induced' (from Latin 'inducere', meaning 'to lead in, bring in, introduce').","priority":"Medium"},"pronunciation":{"ipa":"/ˈliːʒən ɪnˈdjuːst/","syllables":"le-sion in-duced"},"inflection":{"notes":"Adjectives do not typically inflect in English, though they can be used in comparative and superlative forms with 'more' and 'most' or '-er' and '-est' when appropriate, but this is not common for this particular adjective."},"usage_notes":{"explanation":"'Lesion-induced' is used to describe effects or conditions that are directly caused by a lesion. It implies a causal relationship between the lesion and the observed outcome.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"The lesion induced.","correct":"The lesion-induced effect.","note":"'Lesion-induced' is an adjective and needs to modify a noun."}],"priority":"Low"},"related_words":{"derivatives":["lesion","induced","induce"],"related_terms":["brain lesion","spinal cord lesion","experimental lesion"]},"level_frequency":{"notes":"This term is relatively infrequent in general language but common in specialized medical and scientific literature.","priority":"Low"},"readability_explanation":{"level":"C1","text":"The term 'lesion-induced' is technical and specific to medical and scientific contexts, referring to conditions or effects caused by a lesion (damaged tissue). It is used in research and clinical settings to describe the relationship between a lesion and its consequences. Understanding this term requires familiarity with medical terminology."},"example_sentences":[{"sentence":"The lesion-induced deficits were assessed using a battery of cognitive tests.","translation":"病変誘発性の機能低下は、一連の認知テストを用いて評価された。","type":"general","meaning_category":"Medical"},{"sentence":"Researchers are studying lesion-induced neuroplasticity to develop new rehabilitation strategies.","translation":"研究者たちは、新たなリハビリテーション戦略を開発するために、病変誘発性の神経可塑性を研究している。","type":"research","meaning_category":"Scientific"}]}