{"word":"calculating","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"計算高い、打算的な、策略的な","english_definition":"acting in a scheming and ruthlessly determined way to achieve one's goals; shrewd and cunning.","examples":[{"sentence":"He was a cold and calculating businessman.","translation":"彼は冷徹で計算高いビジネスマンだった。"},{"sentence":"She gave him a calculating look.","translation":"彼女は彼に打算的な目を向けた。"},{"sentence":"They made a calculating decision to invest in the company.","translation":"彼らはその会社に投資するという策略的な決定を下した。"}],"collocations":["calculating look (打算的な目つき)","calculating mind (計算高い性格)","calculating move (策略的な行動)","calculating risk (計算されたリスク)"],"synonyms":["scheming","cunning","crafty","wily","devious","Machiavellian","shrewd","pragmatic","opportunistic"],"antonyms":["naive","unsuspecting","trusting","sincere","genuine","honest","forthright","impulsive","spontaneous"]},{"part_of_speech":"verb","definition":"calculateの現在分詞","english_definition":"present participle of calculate","examples":[{"sentence":"She is calculating the cost of the project.","translation":"彼女はそのプロジェクトの費用を計算している。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The word 'calculating' comes from the verb 'calculate,' which originates from the Latin word 'calculare,' meaning 'to count' or 'to reckon.' 'Calculare' itself is derived from 'calculus,' meaning 'small stone' or 'pebble,' as pebbles were used for counting and calculations in ancient times. The figurative sense of 'calculating' as 'scheming' or 'devising' developed later, implying a careful and deliberate assessment of actions to achieve a desired outcome.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkælkjuleɪtɪŋ/","syllables":"cal-cu-lat-ing"},"inflection":{"notes":"This word has inflections as a verb (calculating, calculates, calculated, calculated) and can be used as an adjective."},"usage_notes":{"explanation":"When used as an adjective, 'calculating' describes someone who carefully plans their actions to gain an advantage, often in a cold or manipulative way. It implies a lack of spontaneity and a focus on achieving a specific goal, sometimes at the expense of others. The term often carries a negative connotation, suggesting that the person is untrustworthy or self-serving.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is very calculating with his emotions.","correct":"✓ He is very calculating in his actions. / ✓ He is very calculating about his finances.","note":"'Calculating' typically describes actions, decisions, or strategies rather than emotions directly. It refers to a deliberate and strategic approach to achieving a goal. You can be calculating *in* your actions or calculating *about* something specific (like finances)."},{"incorrect":"✗ She is a calculating person, so she is always happy.","correct":"✓ She is a calculating person, so she is always successful.","note":"Being 'calculating' doesn't necessarily mean someone is happy. It implies they are strategic and focused on achieving their goals, which might lead to success, but not necessarily happiness. The connection needs to be logical."}],"priority":"★★☆"},"related_words":{"derivatives":["calculate (verb)","calculation (noun)","calculator (noun)","calculatingly (adverb)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent, but understood by most native speakers.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'calculating' is used to describe someone who is very strategic and plans their actions carefully, often in a way that is seen as manipulative or cold. It's more complex than simply being organized or thoughtful; it implies a degree of self-interest and a willingness to exploit situations or people to achieve a goal. This term is not commonly used in everyday conversation, but it is often found in literature, news articles, and discussions about politics or business where strategic and sometimes ruthless behavior is being described."},"example_sentences":[{"sentence":"Her **calculating** nature made her a formidable opponent in negotiations.","translation":"彼女の計算高い性格は、交渉において手ごわい相手となった。","type":"adjective","meaning_category":"策略的な"},{"sentence":"He gave a **calculating** smile, revealing nothing of his true intentions.","translation":"彼は計算された笑みを浮かべ、真の意図を何も明かさなかった。","type":"adjective","meaning_category":"打算的な"},{"sentence":"The company's **calculating** strategy led to a significant increase in profits.","translation":"その会社の策略的な戦略は、利益の大幅な増加につながった。","type":"adjective","meaning_category":"策略的な"},{"sentence":"She was **calculating** the odds of winning the lottery.","translation":"彼女は宝くじに当たる確率を計算していた。","type":"verb (present participle)","meaning_category":"計算する"}]}