{"word":"Hematoglobulin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヘマトグロブリン","english_definition":"A compound of heme and globin; the protein of the red blood cells that carries oxygen from the lungs to the tissues.","examples":[{"sentence":"The hematoglobulin level in the blood was measured.","translation":"血液中のヘマトグロブリンのレベルが測定された。"}],"collocations":["hematoglobulin level","hematoglobulin concentration"],"synonyms":["hemoglobin"],"antonyms":[]}],"etymology":{"value":"Derived from 'heme' (from Greek 'haima' meaning blood) + 'globin' (from Latin 'globus' meaning globe or sphere, referring to the protein's shape) + '-in' (a suffix used for proteins).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhiːməˈɡlɒbjəlɪn/","syllables":"he-ma-to-glo-bu-lin"},"inflection":{"noun_plural":"hematoglobulins"},"usage_notes":{"explanation":"Hematoglobulin is an older or less precise term for what is now more commonly referred to as hemoglobin. Hemoglobin is the protein molecule in red blood cells that carries oxygen from the lungs to the body's tissues and returns carbon dioxide from the tissues back to the lungs. While 'hematoglobulin' might be encountered in older texts, 'hemoglobin' is the preferred term in modern scientific and medical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The hematoglobulin is a type of white blood cell.","correct":"✓ The hematoglobulin is a protein found in red blood cells.","note":"Hematoglobulin (hemoglobin) is found in red blood cells, not white blood cells."}],"priority":"★★☆"},"related_words":{"derivatives":["heme","globin","hemoglobinopathy","hemoglobinuria"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hematoglobulin' is a technical term primarily used in medical and scientific contexts. It refers to the oxygen-carrying protein in red blood cells, now more commonly known as 'hemoglobin'. Understanding this term is useful for reading scientific literature related to blood and oxygen transport.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor ordered a blood test to check the hematoglobulin levels.","translation":"医師はヘマトグロブリンのレベルを調べるために血液検査を指示した。","type":"noun","meaning_category":"protein in red blood cells"}]}