{"word":"wipeability","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"拭き取りやすさ、拭き取り性能","english_definition":"The quality or state of being easily wiped clean.","examples":[{"sentence":"The wipeability of this surface cleaner is excellent; it removes grime with minimal effort.","translation":"この表面クリーナーの拭き取りやすさは抜群で、最小限の労力で汚れを取り除きます。"},{"sentence":"Consider the wipeability of the material when choosing countertops for your kitchen.","translation":"キッチンのカウンタートップを選ぶ際には、素材の拭き取りやすさを考慮してください。"},{"sentence":"This paint boasts superior wipeability, allowing you to easily clean up spills and messes.","translation":"この塗料は優れた拭き取りやすさを誇り、こぼれたものや汚れを簡単にきれいにできます。"}],"collocations":["excellent wipeability (優れた拭き取りやすさ)","poor wipeability (拭き取りにくさ)","improve wipeability (拭き取りやすさを改善する)","test wipeability (拭き取りやすさをテストする)"],"synonyms":["cleanability","washability","removability"],"antonyms":["stainability","indelibility"]}],"etymology":{"value":"Derived from the verb 'wipe' (to clean by rubbing) and the suffix '-ability' (the capacity to do something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌwaɪpəˈbɪləti/","syllables":"wi-pa-bil-i-ty"},"inflection":{"noun_plural":"wipeabilities"},"usage_notes":{"explanation":"'Wipeability' is a relatively modern term, often used in marketing and product descriptions to highlight the ease with which a surface or material can be cleaned. It is commonly applied to paints, coatings, fabrics, and cleaning products.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The wipeability is very wipe.","correct":"✓ The wipeability is very good.","note":"'Wipe' is a verb, not an adjective to describe the quality of wipeability. Use adjectives like 'good,' 'excellent,' or 'poor' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["wipe (verb)","wipe (noun)","wipable (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR vocabulary lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Wipeability' is a technical term used to describe how easily a surface can be cleaned by wiping. It's often used in the context of product descriptions for paints, fabrics, and cleaning supplies. Understanding this word requires a familiarity with the base word 'wipe' and the suffix '-ability,' which indicates the capacity or quality of being able to do something.","priority":"★★☆"},"example_sentences":[{"sentence":"The new whiteboard has excellent wipeability, making it easy to erase markers.","translation":"新しいホワイトボードは拭き取りやすさが抜群で、マーカーを簡単に消すことができます。","type":"noun","meaning_category":"拭き取りやすさ"},{"sentence":"Manufacturers often test the wipeability of their products to ensure customer satisfaction.","translation":"メーカーは顧客満足度を確保するために、製品の拭き取りやすさをテストすることがよくあります。","type":"noun","meaning_category":"拭き取りやすさ"},{"sentence":"The wipeability of this fabric makes it ideal for use in children's clothing.","translation":"この生地の拭き取りやすさは、子供服での使用に最適です。","type":"noun","meaning_category":"拭き取りやすさ"}]}