{"word":"Judas-tree","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ハナズオウ（花蘇芳）","english_definition":"A deciduous tree or shrub of the genus Cercis, especially Cercis siliquastrum, native to the Mediterranean region, with pink or purplish-pink flowers that bloom in spring before the leaves appear.","examples":[{"sentence":"The Judas-tree is known for its beautiful pink blossoms in spring.","translation":"ハナズオウは、春の美しいピンクの花で知られています。"},{"sentence":"We planted a Judas-tree in our garden.","translation":"私たちは庭にハナズオウを植えました。"}],"collocations":["plant a Judas-tree","Judas-tree blossom","pink Judas-tree"],"synonyms":["Cercis siliquastrum","love tree"],"antonyms":[]},{"part_of_speech":"noun","definition":"(歴史的)ユダの木：ユダがキリストを裏切った後に首を吊ったとされる木","english_definition":"(Historical) A tree from which Judas Iscariot is said to have hanged himself after betraying Jesus Christ.","examples":[{"sentence":"Legend has it that Judas hanged himself from a Judas-tree.","translation":"伝説によれば、ユダはハナズオウの木で首を吊ったとされています。"}],"collocations":["Judas Iscariot","hang from a Judas-tree"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Judas-tree' is believed to be derived from the reddish-purple color of its flowers, which resemble the color of Judas Iscariot's face after he betrayed Jesus. Another theory suggests that the name comes from the French name 'Arbre de Judée' (tree of Judea), referring to the region where the tree is native.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒuːdəsˌtriː/","syllables":"Ju-das-tree"},"inflection":{"noun_plural":"Judas-trees"},"usage_notes":{"explanation":"The term 'Judas-tree' primarily refers to the Cercis siliquastrum, a tree known for its vibrant pink flowers. The association with Judas Iscariot is more of a historical or legendary connection, not a common usage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Judas-tree is a type of pine tree.","correct":"✓ Judas-tree is a type of flowering tree.","note":"Judas-tree is not a pine tree; it's a flowering tree."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Cercis (genus)","deciduous tree","flowering tree"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Judas-tree' is a specific term referring to a particular type of tree (Cercis siliquastrum) known for its pink flowers and historical association with Judas Iscariot. Understanding this term requires knowledge of botany and possibly some familiarity with biblical history.","priority":"★★☆"},"example_sentences":[{"sentence":"The **Judas-tree** in our yard is in full bloom this spring.","translation":"庭のハナズオウが今年の春は満開です。","type":"noun","meaning_category":"ハナズオウ"},{"sentence":"The **Judas-tree** is native to the Mediterranean region.","translation":"ハナズオウは地中海地域原産です。","type":"noun","meaning_category":"ハナズオウ"},{"sentence":"The legend says that Judas hanged himself on a **Judas-tree**.","translation":"伝説によれば、ユダはハナズオウの木で首を吊ったとされています。","type":"noun","meaning_category":"ユダの木 (歴史的)"}]}