{"word":"Snider","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A type of breech-loading rifle used in the 19th century.","english_definition":"A type of breech-loading rifle converted from muzzle-loaders, used by the British Army in the 19th century.","examples":[{"sentence":"The soldiers were equipped with Snider rifles.","translation":"兵士たちはスナイダー銃を装備していた。"}],"collocations":["Snider rifle","Snider action"],"synonyms":[],"antonyms":[]},{"part_of_speech":"proper noun","definition":"A surname.","english_definition":"A surname of Dutch or German origin.","examples":[{"sentence":"Mr. Snider is a well-respected member of the community.","translation":"スナイダーさんは地域社会で尊敬されている人物だ。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after Jacob Snider, an American inventor who designed the breech-loading mechanism.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsnaɪdər/","syllables":"Snid-er"},"inflection":{"notes":"Proper noun; plural form Sniders (for multiple people or rifles)."},"usage_notes":{"explanation":"'Snider' primarily refers to a specific type of rifle. As a surname, it is relatively common in English-speaking countries, particularly those with historical Dutch or German populations.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency (as a rifle type); Moderate frequency (as a surname).","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The word 'Snider' has two main uses. It refers to a specific type of 19th-century rifle and is also a surname. Its usage is relatively specialized, particularly concerning the rifle. Understanding the context is crucial to interpreting its meaning correctly."},"example_sentences":[{"sentence":"The museum displayed a rare Snider rifle from the Crimean War.","translation":"博物館にはクリミア戦争時代の珍しいスナイダー銃が展示されていた。","type":"noun","meaning_category":"Rifle"},{"sentence":"The Snider family has lived in this town for generations.","translation":"スナイダー家はこの町に何世代も住んでいる。","type":"proper noun","meaning_category":"Surname"}]}