{"word":"lysergic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"リゼルグ酸の、リゼルグ酸由来の","english_definition":"Relating to or derived from lysergic acid.","examples":[{"sentence":"Lysergic acid diethylamide (LSD) is a well-known hallucinogen.","translation":"リゼルグ酸ジエチルアミド（LSD）はよく知られた幻覚剤です。"},{"sentence":"Lysergic acid derivatives have various pharmacological effects.","translation":"リゼルグ酸誘導体は様々な薬理学的効果を持ちます。"}],"collocations":["lysergic acid","lysergic acid diethylamide (LSD)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'lysergic acid', which originates from the Greek 'lysis' (loosening, dissolution) and 'ergot', referring to the fungus from which it was first derived.","priority":"★★☆"},"pronunciation":{"ipa":"/laɪˈsɜːrdʒɪk/","syllables":"ly-ser-gic"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Lysergic' is primarily used in scientific or technical contexts when discussing compounds related to lysergic acid, particularly in chemistry, pharmacology, and medicine. It is most commonly encountered in the full name of LSD (lysergic acid diethylamide).","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["lysergide (noun): a synthetic drug derived from lysergic acid, such as LSD","lysergic acid (noun): a chemical compound from which many hallucinogens are derived"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - primarily used in scientific or technical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'lysergic' is a technical term primarily encountered in scientific, medical, or pharmacological contexts. Understanding its meaning requires familiarity with organic chemistry and the effects of certain psychoactive substances. It is not typically used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The chemist studied the effects of various lysergic compounds.","translation":"化学者は様々なリゼルグ酸化合物の効果を研究しました。","type":"adjective","meaning_category":"リゼルグ酸の"},{"sentence":"The synthesis of lysergic acid derivatives is a complex process.","translation":"リゼルグ酸誘導体の合成は複雑なプロセスです。","type":"adjective","meaning_category":"リゼルグ酸由来の"}]}