{"word":"unsocializing","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"intransitive","definition":"(意図的に)社交性を失う、非社交的になる、社会との関わりを避ける","english_definition":"The act of withdrawing from social interaction or activities; becoming less social or deliberately avoiding socialization.","examples":[{"sentence":"After a long week of work, I enjoy unsocializing on the weekends by staying home and reading.","translation":"長い一週間の仕事の後、週末は家にいて読書をして社交性を失うことを楽しんでいます。"},{"sentence":"He's been unsocializing lately, preferring to spend his time alone.","translation":"彼は最近、一人で過ごすことを好んで、社交性を失いつつあります。"},{"sentence":"The pandemic forced many people into unsocializing habits.","translation":"パンデミックは多くの人々を非社交的な習慣に追い込みました。"}],"collocations":["unsocializing behavior","unsocializing habits","unsocializing tendencies"],"synonyms":["withdrawing","isolating","avoiding socialization","becoming reclusive"],"antonyms":["socializing","interacting","mingling","networking"]},{"part_of_speech":"adjective","definition":"社交性を失わせる、非社交的にする、社会との関わりを避けるようにさせる","english_definition":"Causing or encouraging a decrease in social interaction or activities.","examples":[{"sentence":"The isolating nature of his job was unsocializing.","translation":"彼の仕事の孤立した性質は、彼を非社交的にさせていた。"},{"sentence":"Excessive screen time can have an unsocializing effect on children.","translation":"過度のスクリーンタイムは、子供たちに非社交的な影響を与える可能性があります。"}],"collocations":["unsocializing effect","unsocializing influence"],"synonyms":["isolating","alienating","detaching"],"antonyms":["socializing","integrating","connecting"]}],"etymology":{"value":"Derived from 'unsocialize,' which is formed by adding the prefix 'un-' (meaning 'not' or 'opposite of') to 'socialize' (to participate in social activities or mix socially with others). The '-ing' suffix indicates a continuous or ongoing action.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈsoʊʃəlaɪzɪŋ/","syllables":"un-so-sha-liz-ing"},"inflection":{"verb_forms":{"present_participle":"unsocializing"},"adjective_forms":{}},"usage_notes":{"explanation":"'Unsocializing' refers to the process or act of reducing one's social interaction or becoming less social. It can be a deliberate choice or a consequence of certain circumstances. The term is often used to describe behavior that leads to isolation or a decrease in social activities.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm unsocializing with my friends.","correct":"✓ I'm unsocializing by staying home.","note":"'Unsocializing' typically describes the action itself rather than being 'done with' someone. It's more about the method or activity that leads to less social interaction."},{"incorrect":"✗ He is very unsocializing.","correct":"✓ He is becoming unsocialized. / ✓ He is unsocializing a lot.","note":"'Unsocializing' is more commonly used as a verb describing a process or action rather than an adjective describing a state of being. Use 'unsocialized' as an adjective or rephrase to use 'unsocializing' as a verb."}],"priority":"★★☆"},"related_words":{"derivatives":["unsocialized (adjective: not socialized; lacking social skills or interaction)","socialize (verb: to participate in social activities)","socialization (noun: the process of learning to behave in a way that is acceptable to society)"],"antonyms":["socializing","social","gregarious","outgoing","extroverted"],"related_concepts":["isolation","withdrawal","reclusion","introversion"]},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unsocializing' is a relatively uncommon word that describes the act of reducing or avoiding social interaction. It is often used to explain behavior where someone is deliberately withdrawing from social activities or becoming less social. Understanding this word requires a good grasp of the prefix 'un-' and the base word 'socialize.'"},"example_sentences":[{"sentence":"She found unsocializing after work helped her recharge.","translation":"彼女は仕事の後に社交性を失うことが、充電に役立つことを見つけました。","type":"verb","meaning_category":"Withdrawing from social interaction"},{"sentence":"The unsocializing effects of remote work can be detrimental to team cohesion.","translation":"リモートワークの非社交的な影響は、チームの結束に悪影響を及ぼす可能性があります。","type":"adjective","meaning_category":"Causing a decrease in social interaction"}]}