{"word":"detemporalize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(時間的な制約、文脈、または特定の時間との関連性)を取り除く、超越する、普遍化する","english_definition":"to remove from or transcend temporal constraints, context, or association with a specific time; to make timeless or universal.","examples":[{"sentence":"The artist sought to detemporalize the subject matter, rendering it relevant across generations.","translation":"その芸術家は主題から時間的な制約を取り除き、世代を超えて関連性を持たせようとした。"},{"sentence":"By detemporalizing the narrative, the author created a story that felt both ancient and contemporary.","translation":"物語から時間的な制約を取り除くことで、作者は古代と現代の両方を感じさせる物語を作り出した。"},{"sentence":"The goal of the philosophical argument was to detemporalize the concept of justice, making it applicable in any era.","translation":"その哲学的議論の目標は、正義の概念から時間的な制約を取り除き、あらゆる時代に適用できるようにすることだった。"}],"collocations":["detemporalize art (芸術から時間性を除く)","detemporalize a narrative (物語から時間性を除く)","detemporalize a concept (概念から時間性を除く)","detemporalize history (歴史から時間性を除く)"],"synonyms":["universalize","decontextualize","abstract","generalize","eternalize","transcend","timelessize"],"antonyms":["temporalize","historicize","contextualize","localize","specify"]},{"part_of_speech":"verb","transitivity":"vi","definition":"時間的な関連性を失う、時代を超越する","english_definition":"to lose temporal relevance; to become timeless.","examples":[{"sentence":"The myth detemporalized over centuries of retelling, becoming a story about universal human experiences.","translation":"その神話は何世紀にもわたる語り直しの中で時間的な関連性を失い、普遍的な人間の経験についての物語となった。"},{"sentence":"As the technology became obsolete, its design detemporalized, becoming a relic of a bygone era.","translation":"その技術が廃れるにつれて、そのデザインは時間的な関連性を失い、過ぎ去った時代の遺物となった。"}],"collocations":["a myth detemporalizes (神話が時間性を失う)","a design detemporalizes (デザインが時間性を失う)"],"synonyms":["become timeless","become universal","lose temporal relevance"],"antonyms":["become dated","become specific to a time"]}],"etymology":{"value":"Formed from \"de-\" (meaning \"remove\" or \"reverse\") + \"temporalize\" (meaning \"to make temporal\" or \"to relate to time\"). Thus, \"detemporalize\" literally means \"to remove the temporal aspects from something.\"","priority":"★★☆"},"pronunciation":{"ipa":"/diːˈtɛmpərəlˌaɪz/","syllables":"de-tem-po-ral-ize"},"inflection":{"verb_forms":{"present_simple":["detemporalize","detemporalizes"],"past_simple":"detemporalized","past_participle":"detemporalized","present_participle":"detemporalizing"}},"usage_notes":{"explanation":"\"Demporalize\" is primarily used in academic or theoretical contexts, particularly in discussions of art, literature, philosophy, and history. It describes the process of removing or transcending the specific temporal context of something, making it applicable or relevant across different times and places. It is often used to describe the creation of timeless or universal themes and ideas. The term can also be used intransitively to describe something that naturally loses its temporal relevance over time.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artist detemporalized the painting by adding modern elements.","correct":"✓ The artist detemporalized the painting by removing elements specific to a particular time period.","note":"Adding modern elements would likely *temporalize* (contextualize in a specific time) the painting, not detemporalize it. Detemporalization involves removing time-specific elements. "},{"incorrect":"✗ The detemporalized event was very exciting.","correct":"✓ The historical event was very exciting.","note":"\"Detemporalized\" is not typically used to describe an event itself, but rather the *representation* or *interpretation* of an event. It's more common to refer to a historical event."}],"priority":"★★☆"},"related_words":{"derivatives":["detemporalization (noun)"],"phrases":["detemporalized narrative","detemporalized art","detemporalized history"],"related_concepts":["timelessness","universality","abstraction","decontextualization"]},"level_frequency":{"CEFR":"C2 (very specialized vocabulary)","frequency_google_ngram":"Very low frequency. The term is primarily used in academic writing and specialized discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Detemporalize\" is a sophisticated term that means to remove something from its specific time period or context, making it seem timeless or universally relevant. It's often used in discussions about art, literature, and philosophy to describe how artists or thinkers create works that resonate across different eras. For example, an artist might detemporalize a painting by removing any details that would identify it with a particular historical moment. This makes the painting feel relevant to viewers in any time period. The word is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The author attempted to **detemporalize** the characters, making their struggles relatable to modern readers.","translation":"作者は登場人物から時間的な制約を取り除き、彼らの苦闘を現代の読者にも共感できるようにしようとした。","type":"verb","meaning_category":"remove temporal constraints"},{"sentence":"The ancient myth has **detemporalized** over time, its original context largely forgotten.","translation":"古代の神話は時を経て時間的な関連性を失い、その元の文脈はほとんど忘れ去られている。","type":"verb","meaning_category":"lose temporal relevance"},{"sentence":"Critics praised the film's ability to **detemporalize** the themes of love and loss.","translation":"批評家たちは、その映画が愛と喪失というテーマから時間的な制約を取り除く能力を称賛した。","type":"verb","meaning_category":"remove temporal constraints"},{"sentence":"The museum exhibit aimed to **detemporalize** the artifacts, presenting them as objects of enduring human significance.","translation":"その博物館の展示は、人工物から時間的な制約を取り除き、永続的な人間の重要性を持つ物として提示することを目指した。","type":"verb","meaning_category":"remove temporal constraints"}]}