{"word":"co-agency","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"共同主体性、協働主体性、共同エージェンシー","english_definition":"The capacity of individuals to act together to shape their circumstances; shared agency; the ability of multiple agents to act together towards a common goal.","examples":[{"sentence":"The success of the project depended on the co-agency of all team members.","translation":"プロジェクトの成功は、チームメンバー全員の共同主体性にかかっていた。"},{"sentence":"Effective learning often involves co-agency between students and teachers.","translation":"効果的な学習には、生徒と教師の間の協働主体性がしばしば伴う。"},{"sentence":"The concept of co-agency is crucial for understanding collaborative problem-solving.","translation":"共同主体性の概念は、協調的な問題解決を理解する上で重要である。"}],"collocations":["foster co-agency (共同主体性を育む)","promote co-agency (共同主体性を促進する)","develop co-agency (共同主体性を発展させる)","exercise co-agency (共同主体性を発揮する)","shared co-agency (共有された共同主体性)"],"synonyms":["shared agency","collective agency","joint agency","collaborative agency"],"antonyms":["individual agency","independent agency"]}],"etymology":{"value":"\"Co-\" (共に) + \"agency\" (主体性、行動力)。複数の主体が共同で行動する能力を表す造語。","priority":"★★★"},"pronunciation":{"ipa":"/ˌkoʊˈeɪdʒənsi/","syllables":"co-a-gen-cy"},"inflection":{"noun_plural":"co-agencies"},"usage_notes":{"explanation":"\"Co-agency\" refers to the shared capacity of individuals or entities to act together and influence their environment or achieve common goals. It emphasizes the collaborative and interdependent nature of agency, where multiple actors contribute to a collective outcome. This concept is often used in fields such as education, psychology, sociology, and organizational studies to understand how individuals work together to shape their circumstances and achieve shared objectives. It highlights the importance of communication, coordination, and mutual support in collaborative endeavors.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The co-agency was responsible for the decision.","correct":"✓ The team demonstrated co-agency in making the decision.","note":"\"Co-agency\" refers to a capacity or process, not an entity. It's better to say that a group *demonstrated* co-agency, rather than saying the co-agency *was responsible*."},{"incorrect":"✗ Co-agency is the same as individual agency.","correct":"✓ Co-agency is different from individual agency; it involves shared responsibility and action.","note":"Co-agency is not the same as individual agency. It emphasizes the collaborative and shared nature of agency, whereas individual agency focuses on the capacity of a single person to act independently."}],"priority":"★★☆"},"related_words":{"derivatives":["agency (主体性、行動力)","agent (主体、行為者)","co-agent (共同行為者)","collective action (集団行動)","collaboration (協働)","shared responsibility (共同責任)"],"phrases":["distributed agency (分散型主体性)","collective efficacy (集合的効力感)","collaborative learning (協調学習)","teamwork (チームワーク)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Co-agency\" is a concept that describes the shared ability of people to work together to make things happen. It's like when a group of friends decides to organize a party – they all contribute their ideas and efforts to make it a success. This idea is used in different fields like education and teamwork to understand how people can achieve more when they collaborate and share responsibility. It's about recognizing that everyone's input matters and that working together can lead to better outcomes.","priority":"★★★"},"example_sentences":[{"sentence":"The students showed strong **co-agency** by organizing a successful fundraising event.","translation":"学生たちは、成功した資金調達イベントを企画することで、強い共同主体性を示した。","type":"general","meaning_category":"共同主体性"},{"sentence":"The project's success relied on the effective **co-agency** between the different departments.","translation":"プロジェクトの成功は、異なる部門間の効果的な共同主体性に依存していた。","type":"general","meaning_category":"共同主体性"},{"sentence":"Teachers can foster **co-agency** in the classroom by encouraging students to work together on projects.","translation":"教師は、生徒たちがプロジェクトで協力し合うことを奨励することで、教室で共同主体性を育むことができる。","type":"general","meaning_category":"共同主体性"}]}