{"word":"Abscission","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物の)離層形成、脱落","english_definition":"The natural detachment of parts of a plant, typically dead leaves and ripe fruit.","examples":[{"sentence":"Abscission is controlled by hormones such as ethylene and auxin.","translation":"離層形成はエチレンやオーキシンといったホルモンによって制御される。"},{"sentence":"The abscission of leaves in autumn is a common phenomenon.","translation":"秋の落葉は一般的な現象である。"}],"collocations":["leaf abscission (落葉)","fruit abscission (落果)","abscission layer (離層)"],"synonyms":["shedding","detachment","separation","falling off"],"antonyms":["attachment","retention"]}],"etymology":{"value":"From Latin abscissio, from abscindere (to cut off), from ab- (away) + scindere (to cut, split).","priority":"★★☆"},"pronunciation":{"ipa":"/æbˈsɪʒən/","syllables":"ab-sci-sion"},"inflection":{"noun_plural":"Abscissions"},"usage_notes":{"explanation":"Abscission refers to the process by which plants shed various parts, such as leaves, fruits, flowers, or stems. This process is crucial for plant survival, allowing them to conserve resources, eliminate damaged or infected tissues, and disperse seeds. The abscission layer, a specialized zone of cells, forms at the base of the plant part to be shed, facilitating its detachment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The abscission was caused by a disease.","correct":"✓ The abscission was triggered by hormonal changes.","note":"Abscission is a natural process, not a disease itself. While diseases can induce premature abscission, the process itself is usually triggered by hormonal signals or environmental factors."}],"priority":"★★☆"},"related_words":{"derivatives":["abscise (verb: to shed or detach)","abscisic acid (noun: a plant hormone involved in abscission and dormancy)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Abscission' is a technical term primarily used in botany and plant physiology. It describes the natural process by which plants shed parts such as leaves, fruits, and flowers. Understanding this term requires a familiarity with plant biology concepts. It's not commonly used in everyday language."},"example_sentences":[{"sentence":"The premature abscission of apples can lead to significant crop losses.","translation":"リンゴの早期落果は、重大な収穫量の損失につながる可能性があります。","type":"noun","meaning_category":"脱落"},{"sentence":"Researchers are studying the genes that regulate abscission in Arabidopsis.","translation":"研究者らは、シロイヌナズナの離層形成を制御する遺伝子を研究しています。","type":"noun","meaning_category":"離層形成"},{"sentence":"Ethylene promotes abscission by increasing the activity of cell wall-degrading enzymes.","translation":"エチレンは、細胞壁分解酵素の活性を高めることによって離層形成を促進します。","type":"noun","meaning_category":"離層形成"}]}