{"word":"neuromodulator","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"神経修飾物質：神経伝達物質の放出または効果を調整する物質。神経伝達物質とは異なり、ニューロモジュレーターはシナプス間隙を横断して直接作用するのではなく、より広範囲に作用し、複数のニューロンの興奮性を変化させることができる。","english_definition":"A substance that alters the release of or response to a neurotransmitter. Unlike neurotransmitters, neuromodulators do not act directly by crossing a synapse but act on a wider scale to alter the excitability of multiple neurons.","examples":[{"sentence":"Dopamine acts as both a neurotransmitter and a neuromodulator in different brain circuits.","translation":"ドーパミンは、異なる脳回路において神経伝達物質と神経修飾物質の両方として機能する。"},{"sentence":"Neuromodulators can influence mood, attention, and sleep.","translation":"神経修飾物質は、気分、注意、および睡眠に影響を与える可能性がある。"}],"collocations":["release of neuromodulator","effect of neuromodulator","dopamine as a neuromodulator","serotonin as a neuromodulator","acetylcholine as a neuromodulator"],"synonyms":["neurotransmitter (in some contexts)","hormone (in some contexts)"],"antonyms":["neurotransmitter (in some contexts)"]},{"part_of_speech":"verb","definition":"（動詞として使用される場合、まれ）神経修飾物質を使用して神経活動を調整する。","english_definition":"(verb, rare) To modulate neural activity using a neuromodulator.","examples":[{"sentence":"Researchers are exploring ways to neuromodulate specific brain regions to treat neurological disorders.","translation":"研究者たちは、神経疾患を治療するために特定の脳領域を神経修飾する方法を模索している。"}],"collocations":["neuromodulate brain activity","neuromodulate neural circuits"],"synonyms":["modulate","regulate"],"antonyms":["disrupt"]}],"etymology":{"value":"'neuro-' (nerve) + 'modulator' (something that modulates or adjusts).","priority":"★★★"},"pronunciation":{"ipa":"/ˌnjʊəroʊˈmɒdjʊleɪtər/","syllables":"neu-ro-mod-u-la-tor"},"inflection":{"noun_plural":"neuromodulators"},"usage_notes":{"explanation":"Neuromodulators are chemicals in the nervous system that influence the activity of neurons. They are distinct from neurotransmitters in that they do not directly cause action potentials but instead alter the way neurons respond to neurotransmitters. Common examples include dopamine, serotonin, and acetylcholine, which play roles in various brain functions such as mood, attention, and learning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Neurotransmitters are the same as neuromodulators.","correct":"✓ Neuromodulators influence neurotransmitters.","note":"Neuromodulators modulate the activity of neurotransmitters, but they are not the same thing."}],"priority":"★★☆"},"related_words":{"derivatives":["neuromodulation","neuromodulatory"],"phrases":["dopaminergic neuromodulation","serotonergic neuromodulation"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in scientific and medical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'neuromodulator' refers to a substance that influences the activity of neurons in the nervous system. Unlike neurotransmitters, which directly transmit signals between neurons, neuromodulators have a broader effect, altering how neurons respond to neurotransmitters. They play a role in regulating various brain functions, such as mood, attention, and learning. This term is commonly used in neuroscience and related fields."},"example_sentences":[{"sentence":"Serotonin is a key **neuromodulator** involved in regulating mood and sleep.","translation":"セロトニンは、気分と睡眠の調節に関与する重要な神経修飾物質である。","type":"noun","meaning_category":"substance that alters neural activity"},{"sentence":"The drug aims to **neuromodulate** specific brain circuits to alleviate symptoms of depression.","translation":"この薬は、うつ病の症状を緩和するために特定の脳回路を神経修飾することを目的としている。","type":"verb","meaning_category":"modulate neural activity"}]}