{"word":"Alpid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アルプス・ヒマラヤ造山帯","english_definition":"The Alpide belt or Alpine-Himalayan orogenic belt is a seismic and orogenic belt that includes an array of mountain ranges extending for more than 15,000 km along the southern margin of Eurasia, stretching from Java to Sumatra, through the Himalayas, the Middle East, and Southern Europe to the Atlantic. It is the second most seismically active region in the world, after the Circum-Pacific Belt.","examples":[{"sentence":"The Alpid belt is a result of the collision of the African, Arabian, and Indian plates with the Eurasian plate.","translation":"アルプス・ヒマラヤ造山帯は、アフリカ、アラビア、インドプレートがユーラシアプレートと衝突した結果である。"}],"collocations":["Alpid belt","Alpine-Himalayan orogenic belt"],"synonyms":["Alpine-Himalayan belt"],"antonyms":[]}],"etymology":{"value":"Derived from 'Alps' and '-id' (a suffix used to form names of mountain ranges or orogenic belts).","priority":"★★★"},"pronunciation":{"ipa":"/ˈælpɪd/","syllables":"Al-pid"},"inflection":{"notes":"This is a proper noun, so it does not have plural forms in the typical sense. It is generally used in the singular to refer to the entire orogenic belt."},"usage_notes":{"explanation":"'Alpid' refers specifically to the Alpine-Himalayan orogenic belt, a major geological feature on Earth. It's a technical term used in geology and related fields. It is not commonly used in everyday conversation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Alpid mountains are very high.","correct":"✓ The mountains in the Alpid belt are very high.","note":"'Alpid' refers to the entire belt, not a specific set of mountains. You would say 'mountains in the Alpid belt' or refer to specific ranges within it (e.g., the Alps, the Himalayas)."}],"priority":"★★☆"},"related_words":{"derivatives":["Alpine (related to the Alps)","Himalayan (related to the Himalayas)","Orogenic (related to mountain building)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Alpid' is a technical term used in geology to refer to the Alpine-Himalayan orogenic belt. Understanding this term requires knowledge of plate tectonics and orogeny (mountain building processes). It is not a word commonly used outside of scientific contexts.","priority":"★★★"},"example_sentences":[{"sentence":"The Alpid belt is characterized by intense seismic activity.","translation":"アルプス・ヒマラヤ造山帯は、激しい地震活動を特徴とする。","type":"general","meaning_category":"definition"},{"sentence":"The formation of the Alpid belt began with the closure of the Tethys Ocean.","translation":"アルプス・ヒマラヤ造山帯の形成は、テチス海の閉鎖とともに始まった。","type":"geological","meaning_category":"formation"}]}