{"word":"antisyndicalism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"反サンディカリスム：サンディカリスムの原則や戦術に反対する思想・運動。","english_definition":"Opposition to syndicalism, a revolutionary movement advocating the replacement of capitalism with worker-controlled industrial organizations.","examples":[{"sentence":"The government adopted a policy of antisyndicalism to suppress labor unrest.","translation":"政府は労働不安を鎮圧するために反サンディカリスム政策を採用した。"},{"sentence":"Antisyndicalism was a common stance among business owners and conservative politicians.","translation":"反サンディカリスムは、経営者や保守的な政治家の間で一般的な立場だった。"}],"collocations":["policy of antisyndicalism","movement of antisyndicalism"],"synonyms":["anti-unionism","anti-labor"],"antonyms":["syndicalism","pro-labor"]}],"etymology":{"value":"\"anti-\"（反対）+ \"syndicalism\"（サンディカリスム）から構成される。","priority":"★★★"},"pronunciation":{"ipa":"/ˌæntiˈsɪndɪkəlɪzəm/","syllables":"an-ti-syn-di-cal-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"\"Antisyndicalism\"は、サンディカリスムという特定の政治・経済思想に対する反対を指す専門的な用語です。歴史的な文脈で使用されることが多く、現代の労働運動や政治に関する議論ではあまり一般的ではありません。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He supported antisyndicalism because he was a socialist.","correct":"✓ He opposed syndicalism because he was a socialist.","note":"社会主義者は、サンディカリスムの代替案を支持する可能性がありますが、必ずしも反サンディカリスムを支持するわけではありません。"},{"incorrect":"✗ Antisyndicalism is the same as being against all unions.","correct":"✓ Antisyndicalism is specifically against syndicalism, not necessarily all unions.","note":"反サンディカリスムは、すべての労働組合に反対するものではなく、サンディカリスムの特定の原則に反対するものです。"}],"priority":"★★☆"},"related_words":{"derivatives":["antisyndicalist (反サンディカリスム主義者)"],"related_terms":["syndicalism","labor movement","socialism","anarchism"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"低頻度 (Low frequency) - 専門的な歴史・政治用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**antisyndicalism**」は、サンディカリスムという労働運動の思想に反対する立場を指す専門用語です。サンディカリスムは、労働者が産業を直接管理すべきだと主張する革命的な思想です。したがって、反サンディカリスムは、そのような労働者による管理に反対する立場を意味します。この言葉は、歴史的な文脈や政治学の議論で使われることが多く、一般的な日常会話ではあまり使われません。"},"example_sentences":[{"sentence":"The rise of antisyndicalism in the early 20th century led to increased government intervention in labor disputes.","translation":"20世紀初頭の反サンディカリスムの高まりは、労働紛争における政府の介入の増加につながった。","type":"noun","meaning_category":"反サンディカリスム"},{"sentence":"Many businesses supported antisyndicalism as a way to maintain control over their operations.","translation":"多くの企業は、事業運営の支配を維持する方法として反サンディカリスムを支持した。","type":"noun","meaning_category":"反サンディカリスム"}]}