{"word":"Porpoise","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ネズミイルカ","english_definition":"A small toothed whale with a rounded snout, typically found in coastal waters.","examples":[{"sentence":"A pod of porpoises swam alongside the boat.","translation":"ネズミイルカの群れがボートと並んで泳いだ。"},{"sentence":"Porpoises are often mistaken for dolphins.","translation":"ネズミイルカはしばしばイルカと間違われる。"}],"collocations":["harbor porpoise","Dall's porpoise","pod of porpoises"],"synonyms":["dolphin","whale"],"antonyms":[]}],"etymology":{"value":"The word \"porpoise\" comes from the Old French word \"porpais\", which in turn comes from the Medieval Latin word \"porcopiscus\", a combination of \"porcus\" (pig) and \"piscis\" (fish). This likely refers to the animal's rounded shape.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɔːrpəs/","syllables":"por-poise"},"inflection":{"noun_plural":"porpoises"},"usage_notes":{"explanation":"Porpoises are marine mammals, closely related to dolphins and whales. They are generally smaller than dolphins and have a more rounded body shape and a blunt snout. They are often found in coastal waters and are known for their playful behavior.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a dolphin, it was definitely a porpoise.","correct":"✓ I saw a porpoise, it was definitely a porpoise.","note":"Be sure to distinguish between dolphins and porpoises. They are different animals, although related."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_species":["dolphin","whale"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"porpoise\" refers to a specific type of marine mammal, a small toothed whale. It's less common than \"dolphin\" or \"whale,\" so it's typically encountered in more specialized contexts, such as nature documentaries or scientific articles. Understanding the distinction between porpoises and dolphins requires some familiarity with marine biology.","priority":"★★☆"},"example_sentences":[{"sentence":"The **porpoise** surfaced briefly before diving back into the ocean.","translation":"ネズミイルカは海に潜る前に一瞬だけ水面に顔を出した。","type":"noun","meaning_category":"animal"},{"sentence":"Scientists are studying the behavior of **porpoises** in the Baltic Sea.","translation":"科学者たちはバルト海におけるネズミイルカの行動を研究している。","type":"noun","meaning_category":"animal"}]}