{"word":"holy-mindedness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"敬虔(けいけん)な心、神聖(しんせい)な精神(せいしん)、信心深(しんじんぶか)さ","english_definition":"The quality or state of being holy-minded; devotion to sacred things; piety.","examples":[{"sentence":"Her holy-mindedness was evident in her daily prayers and acts of charity.","translation":"彼女の敬虔な心は、日々の祈りと慈善活動に明らかだった。"},{"sentence":"The monk's holy-mindedness inspired many to seek a deeper spiritual connection.","translation":"その僧侶の神聖な精神は、多くの人々に、より深い精神的なつながりを求めるように促した。"},{"sentence":"Holy-mindedness is often associated with a strong belief in a higher power and a commitment to living a virtuous life.","translation":"敬虔な心は、しばしば、より高次の存在への強い信仰と、道徳的な生活を送るという決意と関連付けられる。"}],"collocations":["demonstrate holy-mindedness","express holy-mindedness","inspire holy-mindedness","cultivate holy-mindedness","lack holy-mindedness"],"synonyms":["piety","devoutness","godliness","sanctity","religiousness","spirituality","reverence","faithfulness","righteousness"],"antonyms":["impiety","profanity","worldliness","secularity","irreligion","atheism","agnosticism"]}],"etymology":{"value":"The word is formed by combining 'holy' (sacred, dedicated to God) with 'mindedness' (the state of having a particular kind of mind or way of thinking). Thus, 'holy-mindedness' refers to the state of having a mind focused on holy or sacred things.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhoʊliˈmaɪndɪdnəs/","syllables":"ho-ly-mind-ed-ness"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Holy-mindedness' is a somewhat formal or literary term that describes a deep and sincere devotion to religious or spiritual principles. It suggests a consistent focus on sacred things and a commitment to living in accordance with one's faith. The term is often used in religious contexts to describe individuals who are exemplary in their piety and dedication.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She showed holy-mindedness by going to church sometimes.","correct":"✓ She showed holy-mindedness through her consistent attendance at church, daily prayers, and acts of service to others.","note":"'Holy-mindedness' implies a consistent and pervasive devotion, not just occasional acts of religious observance."},{"incorrect":"✗ His holy-mindedness made him judgmental of others.","correct":"✓ His religious zeal made him judgmental of others.","note":"While 'holy-mindedness' implies devotion, it should not be confused with judgmentalism or self-righteousness. If the person is being critical or judgmental, 'religious zeal' or 'self-righteousness' might be more appropriate terms."}],"priority":"★☆☆"},"related_words":{"derivatives":["holy (adjective)","mindedness (noun)","holy-minded (adjective)"],"phrasal_verbs":null,"related_concepts":["sanctification","spiritual discipline","religious devotion","pietism","asceticism","mysticism","theology","ethics","virtue","faith"],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Holy-mindedness' is a relatively uncommon and abstract term, typically found in religious or philosophical contexts. It refers to a state of deep religious devotion and a strong focus on sacred or spiritual matters. Understanding this term requires a good vocabulary and familiarity with religious concepts."},"example_sentences":[{"sentence":"The nun's life was a testament to her unwavering holy-mindedness.","translation":"その修道女の人生は、彼女の揺るぎない敬虔な心の証だった。","type":"general","meaning_category":"敬虔な心"},{"sentence":"He was admired for his holy-mindedness and commitment to serving the poor.","translation":"彼は、その敬虔な心と貧しい人々に奉仕するという献身によって賞賛された。","type":"general","meaning_category":"神聖な精神"},{"sentence":"The author explored the theme of holy-mindedness in his novel, contrasting it with the materialism of modern society.","translation":"その作家は、小説の中で敬虔な心のテーマを探求し、それを現代社会の物質主義と対比させた。","type":"literary","meaning_category":"敬虔な心"}]}