{"word":"perfusion-reducing","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"血流を減少させる、灌流を減少させる","english_definition":"Having the effect of reducing perfusion (the passage of fluid through the circulatory system or lymphatic system to an organ or a tissue).","examples":[{"sentence":"A perfusion-reducing agent can be used to treat certain medical conditions.","translation":"灌流を減少させる薬剤は、特定の病状の治療に使用できます。"},{"sentence":"The study investigated the effects of a perfusion-reducing intervention on tumor growth.","translation":"その研究では、腫瘍の成長に対する灌流を減少させる介入の効果を調査しました。"}],"collocations":["perfusion-reducing agent","perfusion-reducing intervention","perfusion-reducing effect"],"synonyms":["vasoconstrictive","blood flow-reducing"],"antonyms":["perfusion-enhancing","vasodilatory"]}],"etymology":{"value":"Derived from 'perfusion' (the act of perfusing) and 'reducing' (making smaller or less).","priority":"N/A"},"pronunciation":{"ipa":"/pərˈfjuːʒən rɪˈdjuːsɪŋ/","syllables":"per-fu-sion re-duc-ing"},"inflection":{"notes":"Adjective; does not inflect"},"usage_notes":{"explanation":"'Perfusion-reducing' is a descriptive adjective used in medical and scientific contexts to describe substances, treatments, or conditions that decrease the flow of blood or other fluids to a specific area of the body. It is often used in the context of treating tumors or other conditions where reducing blood supply is beneficial.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["perfusion","reduce","reducing"],"phrasal_verbs":[],"related_terms":["ischemia","hypoperfusion","vasoconstriction"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The term 'perfusion-reducing' is a specialized term primarily used in medical and scientific contexts. Understanding requires knowledge of the term 'perfusion,' which refers to the passage of fluid through the circulatory or lymphatic system to an organ or tissue. The adjective describes something that has the effect of decreasing this flow. Due to its specialized nature, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The drug is designed to have a perfusion-reducing effect on the inflamed tissue.","translation":"その薬は、炎症を起こした組織への灌流を減少させる効果を持つように設計されています。","type":"adjective","meaning_category":"血流を減少させる"},{"sentence":"A perfusion-reducing strategy was employed to limit blood loss during the surgery.","translation":"手術中の出血を制限するために、灌流を減少させる戦略が採用されました。","type":"adjective","meaning_category":"灌流を減少させる"}]}