{"word":"contek","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(slang, Indonesian) Short for 'konten' (content), referring to online content, usually of low quality or unoriginal.","english_definition":"(slang, Indonesian) A shortened, often derogatory term for 'content', usually referring to low-quality or unoriginal online material.","examples":[{"sentence":"Ah, itu mah cuma contek doang, gak ada yang original.","translation":"Ah, that's just copied content, nothing original."},{"sentence":"Banyak banget contek sampah di internet sekarang.","translation":"There's so much garbage content on the internet these days."}],"collocations":["contek sampah (garbage content)","contek murahan (cheap content)","bikin contek (to create content)"],"synonyms":["konten (content - Indonesian)","sampah (garbage - Indonesian, when referring to quality)"],"antonyms":["original","kreatif (creative - Indonesian)"]}],"etymology":{"value":"A shortening of the Indonesian word 'konten', which itself is a loanword from the English word 'content'.","priority":"N/A"},"pronunciation":{"ipa":"/ˈkɔn.tɛk/","syllables":"kon-tek"},"inflection":{"notes":"As a noun, 'contek' does not change form for pluralization in Indonesian slang. It is used as is."},"usage_notes":{"explanation":"'Contek' is a slang term used in Indonesian, primarily online, to refer to content. It often carries a negative connotation, implying that the content is unoriginal, low-quality, or simply 'garbage'. It's a more informal and often critical way to refer to online material.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"Using 'contek' in formal settings.","correct":"Using 'konten' or 'isi' (Indonesian for 'content') in formal settings.","note":"'Contek' is slang and inappropriate for formal communication."}],"priority":"N/A"},"related_words":{"derivatives":["konten (content - Indonesian)","plagiat (plagiarism - Indonesian)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily used in Indonesian online slang.","priority":"N/A"},"readability_explanation":{"level":"Difficult for non-Indonesian speakers. Requires understanding of Indonesian slang and online culture.","text":"'Contek' is an Indonesian slang word derived from 'konten' (content). It's usually used to describe online content that is considered low quality, unoriginal, or simply copied from somewhere else. It's important to note that this word has a negative connotation."},"example_sentences":[{"sentence":"Jangan percaya semua contek yang kamu lihat di internet.","translation":"Don't believe all the content you see on the internet (because it's probably low quality/fake).","type":"noun","meaning_category":"Low-quality online content"},{"sentence":"Dia cuma bisa bikin contek, gak ada ide sendiri.","translation":"He can only create copied content, he doesn't have any original ideas.","type":"noun","meaning_category":"Unoriginal online content"}]}