{"word":"non-deportable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"国外追放できない、強制送還できない","english_definition":"Not subject to deportation; not able to be deported.","examples":[{"sentence":"The judge ruled that the defendant was non-deportable due to his long-term residency and family ties.","translation":"裁判官は、被告の長年の居住歴と家族関係から、被告は国外追放できないと判断した。"},{"sentence":"Certain immigrants with protected status are considered non-deportable.","translation":"保護された地位を持つ特定の移民は、国外追放できないと見なされる。"}],"collocations":["non-deportable alien","non-deportable resident","non-deportable status"],"synonyms":["protected from deportation","exempt from deportation"],"antonyms":["deportable","subject to deportation"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to the word 'deportable'. 'Deportable' itself comes from 'deport', meaning to expel (a foreigner) from a country, which originates from the Latin 'deportare' (to carry away).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒn.dɪˈpɔːr.tə.bəl/","syllables":"non-de-por-ta-ble"},"inflection":{"notes":"Adjectives do not inflect in English, but can be modified by adverbs (e.g., 'highly non-deportable')."},"usage_notes":{"explanation":"'Non-deportable' is a legal term, often used in immigration law. It describes individuals who, for various reasons (such as refugee status, asylum, or other legal protections), cannot be deported from a country, even if they might otherwise be eligible for deportation. The term implies a legal or protected status that prevents deportation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is non deportable.","correct":"✓ He is non-deportable.","note":"The correct form is 'non-deportable', with the hyphen. Using two separate words is grammatically incorrect."},{"incorrect":"✗ She is non-deportable because she likes the country.","correct":"✓ She is non-deportable because she has been granted asylum.","note":"'Non-deportable' status is based on legal grounds, not personal preference. Asylum, refugee status, or other legal protections are valid reasons for being non-deportable."}],"priority":"★★☆"},"related_words":{"derivatives":["deport (verb)","deportation (noun)","deportable (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in legal and political contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Non-deportable' is a specialized term primarily used in legal and immigration contexts. It describes the status of an individual who cannot be legally deported from a country, typically due to specific legal protections or circumstances. Understanding this term requires familiarity with legal and immigration terminology. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The lawyer argued that his client was non-deportable under international law.","translation":"弁護士は、依頼人は国際法の下で国外追放できないと主張した。","type":"adjective","meaning_category":"Legal Status"},{"sentence":"The new legislation aims to protect non-deportable residents from unjust removal.","translation":"新しい法律は、不当な追放から国外追放できない居住者を保護することを目的としている。","type":"adjective","meaning_category":"Legal Protection"}]}