{"word":"Herzl","priority":"N/A","meanings":[{"part_of_speech":"proper noun","definition":"ヘルツル：オーストリア・ハンガリー帝国出身のジャーナリスト、作家、シオニズム運動の創始者","english_definition":"Theodor Herzl (1860-1904): An Austro-Hungarian Jewish journalist, playwright, political activist, and writer who was the father of modern political Zionism.","examples":[{"sentence":"Theodor Herzl is considered the father of modern Zionism.","translation":"テオドール・ヘルツルは現代シオニズムの父と考えられている。"},{"sentence":"Herzl's book 'Der Judenstaat' outlined his vision for a Jewish state.","translation":"ヘルツルの著書『ユダヤ人国家』は、彼のユダヤ人国家に対するビジョンを概説した。"}],"collocations":["Theodor Herzl","Herzl's vision","Herzl's book 'Der Judenstaat'","Father of modern Zionism"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Herzl' is a German surname.","priority":"N/A"},"pronunciation":{"ipa":"/ˈhɛərtsəl/","syllables":"Hertz-el"},"inflection":{},"usage_notes":{"explanation":"'Herzl' refers specifically to Theodor Herzl, a key figure in Jewish history and the founder of modern Zionism. When discussing the history of Zionism or the establishment of the State of Israel, Herzl's name is frequently mentioned.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["Herzlian (adjective: relating to Herzl or his ideas)","Zionism (noun: a political movement for the establishment and support of a Jewish state in Palestine)"],"priority":"★★★"},"level_frequency":{},"readability_explanation":{"level":"N/A","text":"'Herzl' is a proper noun, specifically the surname of Theodor Herzl, a central figure in the history of Zionism. Understanding the significance of Herzl is important for understanding the history of the State of Israel and the Zionist movement."},"example_sentences":[{"sentence":"Theodor Herzl convened the First Zionist Congress in Basel in 1897.","translation":"テオドール・ヘルツルは1897年にバーゼルで第1回シオニスト会議を招集した。","type":"example","meaning_category":"Historical Context"},{"sentence":"Many streets and institutions in Israel are named after Herzl.","translation":"イスラエルでは多くの通りや機関がヘルツルの名にちなんで名付けられている。","type":"example","meaning_category":"Legacy"}]}