{"word":"sagos","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"サゴヤシから採取されるデンプン、またはそれから作られた食品","english_definition":"A starch extracted from the pith of various palm trees, especially the sago palm, or a food made from it.","examples":[{"sentence":"Sagos are a staple food in some parts of Southeast Asia and the Pacific.","translation":"サゴは東南アジアや太平洋地域の一部で主食です。"},{"sentence":"Sago pudding is a traditional dessert made with sagos, milk, and sugar.","translation":"サゴプディングは、サゴ、牛乳、砂糖で作られる伝統的なデザートです。"}],"collocations":["sago palm","sago pudding","sago flour"],"synonyms":["tapioca","starch"],"antonyms":[]}],"etymology":{"value":"Derived from the Malay word 'sagu', which refers to the sago palm and the starch extracted from it.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈseɪɡoʊz/","syllables":"sa-gos"},"inflection":{"noun_plural":"sagos"},"usage_notes":{"explanation":"'Sagos' is the plural form of 'sago'. 'Sago' refers to both the starch and the food made from it. It is often used in desserts and as a thickening agent in cooking.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I eat sago every day for breakfast.","correct":"✓ I eat sago every day for breakfast.","note":"'Sago' is the correct term; 'sagos' is the plural form, but in this context, 'sago' is used to refer to the food in general."}],"priority":"★☆☆"},"related_words":{"derivatives":["sago (singular form)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Sagos' refers to the plural form of 'sago,' which is a starch extracted from the pith of sago palm trees. It's a less common term in everyday English but may appear in discussions about food, particularly in the context of Southeast Asian and Pacific cuisines. Understanding its origin and usage is helpful for comprehending texts related to these topics."},"example_sentences":[{"sentence":"The texture of the sagos in the pudding was delightfully chewy.","translation":"プリンに入っているサゴの食感は、とてもモチモチしていた。","type":"noun","meaning_category":"starch"},{"sentence":"Different varieties of sagos are used in various regional dishes.","translation":"さまざまな種類のサゴが、さまざまな地域の料理に使われている。","type":"noun","meaning_category":"starch"}]}