{"word":"unresolvedly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"未解決のまま、決着がつかないまま","english_definition":"In an unresolved manner; without resolution or settlement.","examples":[{"sentence":"The issue remained unresolvedly in the meeting, requiring further discussion.","translation":"その問題は会議で未解決のまま残り、さらなる議論が必要となった。"},{"sentence":"They parted unresolvedly, leaving the future of their relationship uncertain.","translation":"彼らは決着がつかないまま別れ、二人の関係の将来は不確かなものとなった。"}],"collocations":["remain unresolvedly","part unresolvedly"],"synonyms":["indecisively","inconclusively","ambiguously"],"antonyms":["resolvedly","decisively","conclusively"]}],"etymology":{"value":"Derived from the adjective 'unresolved' (not resolved or decided) with the addition of the adverbial suffix '-ly'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnrɪˈzɒlvdli/","syllables":"un-re-solved-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Unresolvedly' describes actions or situations that lack a clear resolution or decision. It emphasizes the state of being unsettled or incomplete. It is not a commonly used word, and its use can sometimes sound formal or awkward. Consider using alternative phrases like 'without resolution' or 'in an unresolved manner' for clearer communication.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He spoke unresolvedly about his plans.","correct":"✓ He spoke vaguely/indecisively about his plans.","note":"'Unresolvedly' typically describes the state of a problem or situation, not the manner of speaking. Use 'vaguely' or 'indecisively' to describe how someone speaks about their plans. "},{"incorrect":"✗ The problem was unresolvedly.","correct":"✓ The problem was unresolved.","note":"'Unresolvedly' is an adverb and should modify a verb or adjective. 'Unresolved' is an adjective and can describe the state of the problem."}],"priority":"★★☆"},"related_words":{"derivatives":["unresolved (adjective)","resolve (verb)","resolution (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unresolvedly' means 'in a way that is not resolved or settled.' It's used to describe situations or problems that haven't been decided or solved. Because it's not a common word, it's better to use simpler phrases like 'without a resolution' or 'in an unresolved manner' to make your writing clearer. It's more often used in formal writing or discussions about complex issues."},"example_sentences":[{"sentence":"The negotiation ended unresolvedly, with both sides still disagreeing on key points.","translation":"交渉は未解決のまま終わり、双方は依然として重要な点で意見が一致しなかった。","type":"adverb","meaning_category":"manner"},{"sentence":"The question of who was responsible remained unresolvedly after the investigation.","translation":"誰が責任者であるかの問題は、調査後も未解決のままだった。","type":"adverb","meaning_category":"state"}]}