{"word":"decontamination","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"除染、汚染除去","english_definition":"The removal or neutralization of dangerous substances, such as radioactive, chemical, or biological agents, from a person, object, or area.","examples":[{"sentence":"The firefighters underwent decontamination after battling the chemical fire.","translation":"消防士たちは化学火災と戦った後、除染を受けた。"},{"sentence":"Decontamination of the affected area is crucial to prevent further spread of the contamination.","translation":"汚染のさらなる拡大を防ぐためには、影響を受けた地域の除染が不可欠である。"},{"sentence":"The laboratory has strict decontamination protocols to ensure the safety of its personnel.","translation":"その研究所には、職員の安全を確保するための厳格な除染プロトコルがある。"}],"collocations":["area decontamination (地域除染)","personnel decontamination (人員除染)","surface decontamination (表面除染)","chemical decontamination (化学的除染)","radioactive decontamination (放射性除染)","biological decontamination (生物学的除染)","emergency decontamination (緊急除染)","complete decontamination (完全除染)"],"synonyms":["purification","sterilization","cleansing","sanitation","disinfection"],"antonyms":["contamination","pollution"]}],"etymology":{"value":"The word \"decontamination\" is formed by combining the prefix \"de-\" (meaning removal or reversal) with the word \"contamination\" (the state of being impure or unfit).","priority":"★★☆"},"pronunciation":{"ipa":"/diːkənˌtæmɪˈneɪʃən/","syllables":"de-con-tam-i-na-tion"},"inflection":{"noun_plural":"decontaminations"},"usage_notes":{"explanation":"\"Decontamination\" refers to the process of removing or neutralizing contaminants, making something safe to use or inhabit. It is commonly used in contexts involving hazardous materials, such as radioactive substances, chemical spills, or biological agents. The goal of decontamination is to reduce the level of contamination to an acceptable or safe level.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The decontamination was doing by the team.","correct":"✓ The decontamination was done by the team.","note":"\"Decontamination\" is a noun, not a verb. Use the correct verb form (e.g., \"was done\") to describe the action of decontaminating."},{"incorrect":"✗ They decontaminated the area from pollution.","correct":"✓ They decontaminated the area of pollution.","note":"The correct preposition to use with \"decontaminate\" is \"of,\" not \"from.\" You decontaminate something *of* a contaminant."}],"priority":"★★☆"},"related_words":{"derivatives":["decontaminate (verb)","decontaminated (adjective)","decontaminating (adjective)","decontaminator (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in specific contexts (e.g., environmental science, medicine, emergency response).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Decontamination\" is a specialized term that refers to the process of removing or neutralizing contaminants from a person, object, or area. It is often used in contexts involving hazardous materials, such as radioactive substances, chemical spills, or biological agents. The word is formed by adding the prefix \"de-\" to \"contamination,\" indicating the removal of the contaminant. Understanding this term requires some familiarity with scientific or technical vocabulary."},"example_sentences":[{"sentence":"The **decontamination** process involved washing the affected area with a special solution.","translation":"除染プロセスでは、影響を受けた地域を特殊な溶液で洗浄した。","type":"noun","meaning_category":"除染"},{"sentence":"Proper **decontamination** procedures are essential for preventing the spread of infectious diseases.","translation":"適切な除染手順は、感染症の蔓延を防ぐために不可欠である。","type":"noun","meaning_category":"除染"},{"sentence":"The cost of the **decontamination** effort was estimated to be in the millions of dollars.","translation":"除染作業の費用は数百万ドルと見積もられた。","type":"noun","meaning_category":"除染"}]}