{"word":"non-magnetizable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"磁化できない、磁化されない","english_definition":"Not capable of being magnetized; not susceptible to magnetization.","examples":[{"sentence":"Stainless steel is often used in applications where a non-magnetizable material is required.","translation":"ステンレス鋼は、磁化できない材料が必要な用途でよく使用されます。"},{"sentence":"The device is constructed with non-magnetizable components to prevent interference with sensitive instruments.","translation":"その装置は、高感度機器との干渉を防ぐために、非磁性部品で構成されています。"}],"collocations":["non-magnetizable material","non-magnetizable alloy","non-magnetizable component"],"synonyms":["nonmagnetic","unmagnetizable","paramagnetic (weakly, but not permanently, magnetizable)"],"antonyms":["magnetizable","magnetic","ferromagnetic (strongly magnetizable)"]},{"part_of_speech":"adjective","definition":"磁性を帯びていない","english_definition":"Not having any magnetic properties.","examples":[{"sentence":"The sample was tested and confirmed to be non-magnetizable.","translation":"サンプルをテストした結果、磁化できないことが確認されました。"}],"collocations":["completely non-magnetizable"],"synonyms":["nonmagnetic","unmagnetized"],"antonyms":["magnetized"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to 'magnetizable'. 'Magnetizable' comes from 'magnetize' (to make magnetic) + '-able' (capable of being).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈmæɡnɪtaɪzəbəl/","syllables":"non-mag-net-iz-a-ble"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It can also be used in comparative and superlative forms, although this is rare (e.g., 'more non-magnetizable')."},"usage_notes":{"explanation":"'Non-magnetizable' is a technical term used in physics, engineering, and materials science to describe materials that cannot be easily magnetized or do not retain magnetism. It is often used interchangeably with 'nonmagnetic', although 'nonmagnetic' can also refer to materials that simply lack magnetic properties altogether. The term is important when designing equipment or structures where magnetic interference is undesirable.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The metal is non magnetizable.","correct":"✓ The metal is non-magnetizable.","note":"The correct spelling is 'non-magnetizable', with a hyphen. It's also important to use the correct adjective form."},{"incorrect":"✗ This material is un-magnet.","correct":"✓ This material is non-magnetizable.","note":"'Un-magnet' is not a correct term. The correct term is 'non-magnetizable' or 'nonmagnetic'."}],"priority":"★★☆"},"related_words":{"derivatives":["non-magnetizability (noun): The property of not being magnetizable.","magnetizable (adjective): Capable of being magnetized.","magnetization (noun): The process of making something magnetic.","magnet (noun): An object that produces a magnetic field.","magnetic (adjective): Having properties of a magnet."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Non-magnetizable' is a technical term primarily used in scientific and engineering contexts. It describes materials that resist becoming magnetized or do not retain magnetic properties. Understanding this term requires familiarity with basic concepts of magnetism and material science. It's important to distinguish it from 'nonmagnetic,' which can sometimes be used interchangeably but also refers to materials lacking magnetic properties altogether. The term is relevant when designing systems where magnetic interference needs to be minimized."},"example_sentences":[{"sentence":"The housing of the MRI machine is made of a non-magnetizable alloy to ensure accurate imaging.","translation":"MRI装置の筐体は、正確な画像処理を保証するために、非磁性合金で作られています。","type":"adjective","meaning_category":"cannot be magnetized"},{"sentence":"For this experiment, it is crucial to use a non-magnetizable needle.","translation":"この実験では、磁化できない針を使用することが重要です。","type":"adjective","meaning_category":"cannot be magnetized"}]}