{"word":"Pigwiggen","priority":"低","meanings":[{"part_of_speech":"noun","definition":"(妖精)ピグウィッゲン","english_definition":"A fairy; a small, lively, and often mischievous fairy.","examples":[{"sentence":"Pigwiggen is a name sometimes given to fairies in English folklore.","translation":"ピグウィッゲンは、イギリスの民間伝承で妖精に与えられる名前の一つです。"}],"collocations":[],"synonyms":["fairy","pixie","sprite","elf"],"antonyms":[]}],"etymology":{"value":"The name 'Pigwiggen' is of uncertain origin, but it is thought to be a whimsical or fanciful name created for a fairy character. It appears in Michael Drayton's poem 'Nymphidia, the Court of Fairy' (1627), where Pigwiggen is the knight of the fairy court and the lover of Queen Mab.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɪɡˈwɪɡən/","syllables":"Pig-wig-gen"},"inflection":{"noun_plural":"Pigwiggens (rarely used)"},"usage_notes":{"explanation":"'Pigwiggen' is primarily known as the name of a fairy knight in Michael Drayton's poem 'Nymphidia'. It is not a commonly used term in modern English, but it may be recognized in the context of literature or folklore studies. The name itself suggests something small, lively, and perhaps a bit silly or comical.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Queen Mab","Nymphidia","fairy lore","folklore"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (not in common usage)","frequency_google_ngram":"非常に低頻度 (Extremely low frequency) - ほとんど文学作品でのみ見られる。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pigwiggen' is a very uncommon word, primarily known from Michael Drayton's poem 'Nymphidia'. It refers to a fairy knight and is not part of everyday vocabulary. Understanding this word requires familiarity with English literature and folklore. Its usage is limited to specific contexts related to fairy tales and literary analysis."},"example_sentences":[{"sentence":"In Drayton's 'Nymphidia', Pigwiggen is a valiant fairy knight.","translation":"ドレイトンの『ニンフィディア』では、ピグウィッゲンは勇敢な妖精の騎士です。","type":"noun","meaning_category":"妖精"},{"sentence":"The character of Pigwiggen adds a whimsical touch to the fairy court.","translation":"ピグウィッゲンのキャラクターは、妖精の宮廷に風変わりな趣を加えています。","type":"noun","meaning_category":"妖精"}]}