{"word":"Morris-Pike","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A type of weapon used in the 16th and 17th centuries, combining features of the musket and the pike. It was essentially a musket with a long pike-like extension that could be used as a rest for the musket or as a melee weapon.","english_definition":"A historical firearm-pike hybrid weapon.","examples":[{"sentence":"The museum displayed a rare Morris-Pike, showcasing its unique design.","translation":"博物館には珍しいモリスパイクが展示されており、その独特なデザインを紹介していました。"},{"sentence":"Historical accounts mention the use of Morris-Pikes by certain infantry units during the early 17th century.","translation":"歴史的記録には、17世紀初頭に特定の歩兵部隊がモリスパイクを使用していたことが記載されています。"}],"collocations":["use a Morris-Pike","display a Morris-Pike","historical Morris-Pike"],"synonyms":["firearm-pike","musket-pike"],"antonyms":[]}],"etymology":{"value":"The name 'Morris-Pike' likely comes from a combination of terms referencing its components or origin, possibly involving a person's name (Morris) and the weapon type (Pike).","priority":"N/A"},"pronunciation":{"ipa":"/ˈmɒrɪs paɪk/","syllables":"Mor-ris Pike"},"inflection":{"noun_plural":"Morris-Pikes"},"usage_notes":{"explanation":"The Morris-Pike is a relatively obscure historical weapon, not commonly encountered in general usage. It is primarily of interest to military historians and reenactors.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The term 'Morris-Pike' is highly specialized and unlikely to be encountered outside of historical or military contexts. Understanding requires familiarity with historical weaponry.","priority":"N/A"},"example_sentences":[{"sentence":"The soldier carried a heavy Morris-Pike into battle.","translation":"兵士は重いモリスパイクを戦場に運びました。","type":"noun","meaning_category":"weapon"},{"sentence":"The reenactment group demonstrated the use of the Morris-Pike.","translation":"再現グループはモリスパイクの使用法を実演しました。","type":"noun","meaning_category":"weapon"}]}