{"word":"hyperplagiarism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ある作品の大部分をコピーし、元の作品の構造やスタイルを模倣することによって著作権侵害を行うこと。","english_definition":"A form of copyright infringement that involves copying a substantial portion of a work, while maintaining the original work's structure and style.","examples":[{"sentence":"The author was accused of hyperplagiarism after it was discovered that large sections of his book were nearly identical to another author's work.","translation":"その著者は、彼の本の大部分が別の著者の作品とほぼ同一であることが判明した後、ハイパー盗作の疑いをかけられた。"},{"sentence":"Hyperplagiarism can be difficult to detect because it often involves subtle changes to the copied material.","translation":"ハイパー盗作は、コピーされた素材に微妙な変更が加えられていることが多いため、検出が難しい場合がある。"}],"collocations":["commit hyperplagiarism","avoid hyperplagiarism","detect hyperplagiarism","accuse of hyperplagiarism"],"synonyms":["extensive plagiarism","wholesale plagiarism","structural plagiarism"],"antonyms":["original work","authentic creation"]}],"etymology":{"value":"\"hyper-\" (過剰な、非常に) + \"plagiarism\" (盗作) から構成される。元の作品の大部分をコピーすることから、通常の盗作よりも程度が甚だしいことを意味する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpərˈpleɪdʒərɪzəm/","syllables":"hy-per-pla-gia-rism"},"inflection":{"noun_plural":"hyperplagiarisms"},"usage_notes":{"explanation":"\"hyperplagiarism\"は、通常の盗作よりも深刻な著作権侵害を指す専門的な用語です。単に一部をコピーするのではなく、作品の構造やスタイル全体を模倣する場合に使われます。学術論文、書籍、記事など、様々な種類の著作物において問題となる可能性があります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He did a hyperplagiarism.","correct":"✓ He committed hyperplagiarism.","note":"\"hyperplagiarism\" は名詞であり、行為を表す場合は \"commit hyperplagiarism\" のように動詞と組み合わせて使用する。"},{"incorrect":"✗ Hyperplagiarism is when you copy a small part of someone's work.","correct":"✓ Hyperplagiarism is when you copy a large part of someone's work, including its structure and style.","note":"ハイパー盗作は、作品の大部分をコピーし、構造やスタイルを模倣することを指す。"}],"priority":"★★☆"},"related_words":{"derivatives":["plagiarism","self-plagiarism","plagiarize"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈で使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Hyperplagiarism\" is a term used to describe a severe form of plagiarism where a large portion of a work is copied, including its structure and style. It's a more extensive form of plagiarism than simply copying a few sentences or paragraphs. This term is often used in academic or legal contexts when discussing copyright infringement. It's important to understand that hyperplagiarism involves not only copying content but also mimicking the way the original work is organized and presented."},"example_sentences":[{"sentence":"The investigation revealed several instances of hyperplagiarism in the student's thesis.","translation":"調査の結果、学生の論文にハイパー盗作の事例がいくつか見つかった。","type":"noun","meaning_category":"著作権侵害"},{"sentence":"To avoid hyperplagiarism, researchers should always properly cite their sources and ensure that their work is original.","translation":"ハイパー盗作を避けるために、研究者は常に適切な引用を行い、自分の作品がオリジナルであることを確認する必要がある。","type":"noun","meaning_category":"著作権侵害"}]}