{"word":"Puebloan","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"プエブロ族の、プエブロ文化の","english_definition":"Relating to the Pueblo people or their culture.","examples":[{"sentence":"Puebloan architecture is characterized by adobe structures.","translation":"プエブロの建築は、日干しレンガの構造が特徴です。"},{"sentence":"The museum features Puebloan pottery and artifacts.","translation":"その博物館は、プエブロの陶器や工芸品を展示しています。"}],"collocations":["Puebloan architecture","Puebloan pottery","Puebloan culture","Puebloan people"],"synonyms":["Ancestral Puebloan"],"antonyms":[]},{"part_of_speech":"noun","definition":"プエブロ族の人、プエブロ文化の人","english_definition":"A member of the Pueblo people.","examples":[{"sentence":"The Puebloans are known for their traditional ceremonies.","translation":"プエブロ族は、伝統的な儀式で知られています。"},{"sentence":"Many Puebloans live in the southwestern United States.","translation":"多くのプエブロ族の人々が、アメリカ合衆国南西部に住んでいます。"}],"collocations":["Puebloan people","Puebloan tribe"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From 'Pueblo' (Spanish for 'village') + '-an' (suffix indicating belonging or origin).","priority":"★★★"},"pronunciation":{"ipa":"/ˈpwɛbloʊən/","syllables":"Pweb-lo-an"},"inflection":{"noun_plural":"Puebloans"},"usage_notes":{"explanation":"'Puebloan' refers to both the people and the culture of the Pueblo people, who are Native Americans living primarily in the Southwestern United States. It can be used as an adjective to describe things related to the Pueblo people or culture (e.g., Puebloan pottery) or as a noun to refer to a member of the Pueblo people.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Puebloan is a language.","correct":"✓ Puebloan refers to a group of people and their culture, not a single language. They speak various languages.","note":"Puebloan refers to the people and their culture, not a specific language. The Pueblo people speak various languages, including Keresan, Tanoan, and Zuni."}],"priority":"★★☆"},"related_words":{"derivatives":["Pueblo (noun: a town or village in the southwestern United States, especially one built by Native Americans)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in contexts related to Southwestern US history and culture.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Puebloan' is a term used in the context of the Southwestern United States to describe the Native American people known as the Pueblo people and their culture. It is often used in discussions of archaeology, history, and anthropology related to the region. The word may not be commonly encountered outside of these specific contexts."},"example_sentences":[{"sentence":"The ancient Puebloan ruins are a popular tourist attraction.","translation":"古代プエブロの遺跡は、人気の観光名所です。","type":"adjective","meaning_category":"プエブロ族の、プエブロ文化の"},{"sentence":"Many Puebloans continue to practice traditional farming methods.","translation":"多くのプエブロ族の人々は、伝統的な農法を続けています。","type":"noun","meaning_category":"プエブロ族の人"}]}