{"word":"Gentilism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"異教信仰、異教徒であること","english_definition":"The state of being a Gentile; heathenism; paganism.","examples":[{"sentence":"The early Christians sought to convert people from Gentilism to Christianity.","translation":"初期のキリスト教徒は、異教信仰からキリスト教への改宗を人々に求めました。"}],"collocations":["conversion from Gentilism","practice of Gentilism"],"synonyms":["paganism","heathenism","idolatry"],"antonyms":["Christianity","monotheism"]},{"part_of_speech":"noun","definition":"ユダヤ教徒ではない人々、異邦人","english_definition":"People who are not Jewish; Gentiles collectively.","examples":[{"sentence":"The term 'Gentilism' is used to refer to the customs and beliefs of non-Jewish people.","translation":"「Gentilism」という用語は、ユダヤ教徒ではない人々の習慣や信仰を指すために使用されます。"}],"collocations":["Gentilism and Judaism","customs of Gentilism"],"synonyms":["Gentile world","non-Jewish culture"],"antonyms":["Judaism","Jewish culture"]}],"etymology":{"value":"From the word 'Gentile', which comes from the Latin 'gentilis', meaning 'belonging to a gens or clan, or nation'; hence, 'non-Jewish, non-Christian'.","priority":"★★☆"},"pronunciation":{"ipa":"ˈdʒɛntɪlɪzəm","syllables":"Gen-til-ism"},"inflection":{"noun_plural":"Gentilisms (rarely used)"},"usage_notes":{"explanation":"'Gentilism' is a term with historical and religious significance, primarily used in the context of Judaism and early Christianity. It refers to the practices, beliefs, and culture of people who are not Jewish (Gentiles). It can also refer to paganism or heathenism, especially in historical contexts when Christianity was spreading in the Roman Empire. The term is less commonly used today, with 'Gentile' being more frequent when referring to non-Jewish people.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practiced Gentilism by going to church every Sunday.","correct":"✓ He practiced Christianity by going to church every Sunday.","note":"Gentilism refers to non-Jewish or non-Christian practices. Going to church is a Christian practice."},{"incorrect":"✗ Gentilism is a modern religion.","correct":"✓ Gentilism is a term referring to ancient pagan religions or non-Jewish cultures.","note":"Gentilism does not refer to a specific modern religion but rather to non-Jewish or non-Christian religious and cultural practices."}],"priority":"★★☆"},"related_words":{"derivatives":["Gentile","Gentilish"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Gentilism' is a relatively uncommon term that mainly appears in historical or religious contexts, specifically when discussing Judaism or early Christianity. It refers to the practices and beliefs of people who are not Jewish (Gentiles) or, historically, to paganism. Due to its specific and somewhat archaic usage, it is more likely to be encountered in academic or religious texts rather than in everyday conversation."},"example_sentences":[{"sentence":"The Roman Empire was characterized by a mix of religious beliefs, including both traditional Roman paganism and emerging Christian beliefs challenging Gentilism.","translation":"ローマ帝国は、伝統的なローマの異教信仰と、Gentilismに挑戦する新興のキリスト教の信仰を含む、さまざまな宗教的信念によって特徴づけられました。","type":"noun","meaning_category":"異教信仰"},{"sentence":"Early Jewish communities often interacted with people of various cultural backgrounds, leading to discussions and interactions between Judaism and Gentilism.","translation":"初期のユダヤ人コミュニティは、さまざまな文化的背景を持つ人々と交流することが多く、ユダヤ教とGentilismの間の議論と交流につながりました。","type":"noun","meaning_category":"ユダヤ教徒ではない人々"}]}