{"word":"ethereally","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"優美に、この世のものとは思えないほど美しく、幽玄に","english_definition":"in a way that is extremely delicate and light; in a way that seems too perfect for this world; in a way that is spiritual or otherworldly.","examples":[{"sentence":"The dancer moved ethereally across the stage.","translation":"そのダンサーは舞台の上を優美に舞った。"},{"sentence":"The light filtered ethereally through the trees.","translation":"光が木々の間から幽玄に差し込んだ。"},{"sentence":"She was ethereally beautiful in her white dress.","translation":"彼女は白いドレスを着て、この世のものとは思えないほど美しかった。"}],"collocations":["move ethereally","shine ethereally","appear ethereally","ethereally beautiful","ethereally light"],"synonyms":["delicately","gracefully","airily","spiritually","otherworldly","heavenly","sublimely","rarefiedly"],"antonyms":["heavily","clumsily","earthily","materially"]}],"etymology":{"value":"\"ethereal\" + \"-ly\". \"Ethereal\" は、中世ラテン語の \"aethereus\" （高空の、天空の）に由来し、さらにギリシャ語の \"aithēr\" （上空の澄んだ空気、天空）に遡る。","priority":"★★★"},"pronunciation":{"ipa":"/ɪˈθɪəriəli/","syllables":"e-the-re-al-ly"},"inflection":{"notes":"Adverb - no inflection"},"usage_notes":{"explanation":"\"Ethereally\" describes something done or existing in a way that is delicate, light, and often seemingly not of this world. It suggests a sense of spirituality, grace, and otherworldliness. It is often used to describe light, movement, or beauty.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She sang ethereal.","correct":"✓ She sang ethereally.","note":"\"Ethereal\" is an adjective, so it cannot be used to describe how someone sings. Use the adverb \"ethereally\" instead."},{"incorrect":"✗ The room was filled with ethereally.","correct":"✓ The room was filled with an ethereal light.","note":"\"Ethereally\" is an adverb, so it cannot be used as a noun. You need to use a noun phrase like \"ethereal light\"."}],"priority":"★★☆"},"related_words":{"derivatives":["ethereal (adjective)","etherealness (noun)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Ethereally\" is an advanced adverb used to describe something done in a very delicate, light, and almost spiritual or otherworldly way. It suggests a sense of beauty and grace that is not quite of this world. It's not a common word, but it's useful for describing things that are exceptionally beautiful or delicate. It is derived from the adjective \"ethereal\", which means \"extremely delicate and light in a way that seems too perfect for this world.\""},"example_sentences":[{"sentence":"The mist swirled ethereally around the ancient castle.","translation":"霧が古城の周りを幽玄に渦巻いた。","type":"adverb","meaning_category":"優美に、幽玄に"},{"sentence":"The soprano's voice soared ethereally, filling the concert hall.","translation":"ソプラノ歌手の声がコンサートホールに響き渡り、この世のものとは思えないほど美しかった。","type":"adverb","meaning_category":"優美に、この世のものとは思えないほど美しく"},{"sentence":"The bride looked ethereally beautiful as she walked down the aisle.","translation":"花嫁はバージンロードを歩くとき、この世のものとは思えないほど美しかった。","type":"adverb","meaning_category":"優美に、この世のものとは思えないほど美しく"}]}