{"word":"Pseudo-Turk","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A non-Turk who adopts or imitates Turkish culture, language, or customs.","english_definition":"A person who is not of Turkish origin but emulates or adopts Turkish culture, language, or customs.","examples":[{"sentence":"He was often mistaken for a Turk, but he was actually a Pseudo-Turk who had studied Turkish history and culture extensively.","translation":"彼はよくトルコ人と間違えられたが、実はトルコ史と文化を広範に研究した疑似トルコ人だった。"},{"sentence":"Some scholars use the term 'Pseudo-Turk' to describe groups that adopted Turkic languages and customs without being ethnically Turkic.","translation":"一部の学者は、「疑似トルコ人」という用語を、民族的にトルコ人ではないが、トルコ語族の言語と習慣を採用した集団を記述するために使用する。"}],"collocations":["cultural Pseudo-Turk","linguistic Pseudo-Turk","historical Pseudo-Turk"],"synonyms":["Turkophile","Turk imitator","cultural adopter"],"antonyms":["Turk","anti-Turk"]},{"part_of_speech":"adjective","definition":"Relating to or characteristic of a Pseudo-Turk.","english_definition":"Relating to or characteristic of a Pseudo-Turk; imitating or adopting Turkish culture or customs.","examples":[{"sentence":"The pseudo-Turk cultural displays were interesting, but lacked authenticity.","translation":"疑似トルコ文化の展示は興味深かったが、真正性に欠けていた。"},{"sentence":"His pseudo-Turk mannerisms were a result of his deep immersion in Turkish media.","translation":"彼の疑似トルコ的な物腰は、トルコのメディアに深く浸っていた結果だった。"}],"collocations":["pseudo-Turk culture","pseudo-Turk customs","pseudo-Turk identity"],"synonyms":["Turkic-imitating","Turkophilic","culturally adoptive"],"antonyms":["authentic Turkic","genuinely Turkish"]}],"etymology":{"value":"Formed by combining the prefix 'pseudo-' (meaning false or imitation) with 'Turk'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsjuːdoʊˈtɜːrk/","syllables":"pseu-do-Turk"},"inflection":{"noun_plural":"Pseudo-Turks"},"usage_notes":{"explanation":"The term 'Pseudo-Turk' can be used in both neutral and pejorative ways, depending on the context. It generally refers to someone who is not ethnically Turkish but has adopted Turkish cultural elements. It is important to use the term with sensitivity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Pseudo-Turk because he lives in Turkey.","correct":"✓ He is a Pseudo-Turk because he adopted Turkish customs despite not being Turkish.","note":"Living in Turkey does not make someone a Pseudo-Turk; it is the adoption of Turkish culture by a non-Turk."}],"priority":"★★☆"},"related_words":{"derivatives":["Pseudo-Turkism"],"related_terms":["Turk","Turkification","Turkophile"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pseudo-Turk' is a term used to describe someone who is not Turkish by origin but adopts Turkish culture, language, or customs. It is formed from 'pseudo-' meaning 'false' or 'imitation' and 'Turk'. Use of this term requires sensitivity, as it can sometimes be seen as pejorative depending on the context and intent."},"example_sentences":[{"sentence":"The author explored the phenomenon of Pseudo-Turks in the Ottoman Empire.","translation":"著者（作者）は、オスマン帝国における疑似トルコ人の現象を調査しました。","type":"noun","meaning_category":"cultural imitation"},{"sentence":"His pseudo-Turk attire was part of his performance.","translation":"彼の疑似トルコ的な服装は、彼のパフォーマンスの一部でした。","type":"adjective","meaning_category":"cultural imitation"}]}