{"word":"unneutered","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"去勢されていない、避妊されていない","english_definition":"not neutered; having testicles or ovaries intact.","examples":[{"sentence":"An unneutered male cat is more likely to roam and fight.","translation":"去勢されていない雄猫は、うろついたり喧嘩したりする可能性が高いです。"},{"sentence":"Unneutered female dogs can attract unwanted male attention.","translation":"避妊されていない雌犬は、望ましくない雄の注意を引く可能性があります。"},{"sentence":"It is important to consider the health and behavioral implications of keeping an animal unneutered.","translation":"動物を去勢・避妊せずに飼育することの健康と行動への影響を考慮することが重要です。"}],"collocations":["unneutered male (去勢されていない雄)","unneutered female (避妊されていない雌)","unneutered pet (去勢・避妊されていないペット)"],"synonyms":["intact","unspayed","uncastrated"],"antonyms":["neutered","spayed","castrated"]}],"etymology":{"value":"\"Un-\" (否定の接頭辞) + \"neutered\" (去勢された)。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˈnuːtərd/","syllables":"un-neu-tered"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"\"Unneutered\" is used to describe animals that have not undergone surgical sterilization (castration for males, spaying for females). It is often used in the context of pet ownership, animal welfare, and population control.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unneutered dog is very friendly.","correct":"✓ The unneutered dog is very friendly, but he tends to roam.","note":"While friendliness is a positive trait, it's important to also acknowledge the potential behavioral issues associated with unneutered animals, such as roaming, aggression, and unwanted breeding."},{"incorrect":"✗ You should neuter your dog, so he doesn't become unneutered.","correct":"✓ You should neuter your dog, so he doesn't reproduce.","note":"The opposite of neutered is unneutered. The purpose of neutering is to prevent reproduction."}],"priority":"★★☆"},"related_words":{"derivatives":["neuter (動詞: 去勢する、避妊する; 名詞: 去勢された動物)","neutering (名詞: 去勢手術、避妊手術)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"比較的低頻度 (Relatively low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Unneutered\" is a term used to describe animals that have not had their reproductive organs surgically removed. This is a more technical term, often used in veterinary or animal welfare contexts. Understanding this word is important for discussions about pet ownership, animal health, and responsible breeding practices."},"example_sentences":[{"sentence":"The shelter has many unneutered cats available for adoption.","translation":"そのシェルターには、去勢されていない猫がたくさん里親を募集しています。","type":"adjective","meaning_category":"去勢されていない"},{"sentence":"Unneutered animals contribute to the overpopulation problem.","translation":"去勢されていない動物は、過剰な繁殖の問題に貢献しています。","type":"adjective","meaning_category":"去勢されていない"},{"sentence":"We recommend that all pet owners have their animals neutered or spayed to prevent unwanted litters.","translation":"望まない出産を防ぐために、すべてのペットの飼い主は動物を去勢または避妊することを推奨します。","type":"adjective","meaning_category":"去勢されていない"}]}