{"word":"yellow-lettered","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"黄色の文字で書かれた、黄色の文字が使われた","english_definition":"written or printed in yellow letters.","examples":[{"sentence":"The sign had a yellow-lettered warning about the danger.","translation":"その標識には、危険に関する黄色の文字で書かれた警告があった。"},{"sentence":"He noticed the yellow-lettered books on the shelf.","translation":"彼は棚にある黄色の文字で書かれた本に気づいた。"}],"collocations":["yellow-lettered sign (黄色の文字で書かれた標識)","yellow-lettered warning (黄色の文字で書かれた警告)","yellow-lettered title (黄色の文字で書かれたタイトル)"],"synonyms":["gold-lettered (金色の文字で書かれた)"],"antonyms":["black-lettered (黒色の文字で書かれた)","white-lettered (白色の文字で書かれた)"]}],"etymology":{"value":"The word is formed by combining the adjective 'yellow' with 'lettered', meaning having letters. The hyphen connects the two words to form a compound adjective.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈjɛloʊˌlɛtərd/","syllables":"yel-low-let-tered"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"'Yellow-lettered' is a descriptive adjective used to specify that the letters or text are in the color yellow. It is commonly used to describe signs, books, or other items where the color of the letters is a notable feature.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The yellow lettered sign was hard to read.","correct":"✓ The yellow-lettered sign was hard to read.","note":"When using multiple adjectives before a noun, and they act as a single unit describing the noun, they are often hyphenated. In this case, 'yellow' and 'lettered' combine to describe the sign, so they should be hyphenated."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'yellow-lettered' is a compound adjective that describes something written or printed in yellow letters. It is relatively straightforward to understand, but its usage is not very common, making it more suitable for advanced learners. The term is formed by combining 'yellow' (the color) and 'lettered' (having letters), indicating that the letters are of yellow color."},"example_sentences":[{"sentence":"The old manuscript had a title page with yellow-lettered calligraphy.","translation":"その古い原稿には、黄色の文字で書かれたカリグラフィーのタイトルページがあった。","type":"adjective","meaning_category":"文字の色"},{"sentence":"The store's window display featured a yellow-lettered sign advertising a sale.","translation":"その店のウィンドウディスプレイには、セールを宣伝する黄色の文字で書かれた看板が飾られていた。","type":"adjective","meaning_category":"文字の色"}]}