{"word":"colegislator","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"共同立法者、共に立法を行う議員","english_definition":"A fellow legislator; a member of a legislative body who works with others to create laws.","examples":[{"sentence":"As a colegislator, I value your input on this bill.","translation":"共同立法者として、この法案に対するあなたの意見を尊重します。"},{"sentence":"The senator met with his colegislators to discuss the upcoming vote.","translation":"上院議員は、今後の投票について議論するために、共同立法者たちと会いました。"},{"sentence":"Effective colegislators are able to build consensus and compromise.","translation":"有能な共同立法者は、合意形成と妥協をすることができます。"}],"collocations":["fellow colegislator","bipartisan colegislators","influential colegislator"],"synonyms":["legislative colleague","fellow lawmaker","member of parliament","representative","senator"],"antonyms":[]}],"etymology":{"value":"The word \"colegislator\" is formed by combining the prefix \"co-\" (meaning \"together\" or \"jointly\") with the word \"legislator\" (a person who makes laws).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkoʊˈlɛdʒɪˌsleɪtər/","syllables":"co-leg-is-la-tor"},"inflection":{"noun_plural":"colegislators"},"usage_notes":{"explanation":"\"Colegislator\" is a formal term used primarily in political contexts to refer to another member of a legislative body. It emphasizes the collaborative nature of lawmaking. The term is relatively uncommon in everyday conversation but is frequently used in political discourse, academic writing, and news reports about legislative activities.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is my co-legislator in the company.","correct":"✓ He is my colleague in the company.","note":"\"Colegislator\" specifically refers to members of a legislative body, not colleagues in a business or other organization."},{"incorrect":"✗ The colegislator make law.","correct":"✓ The colegislators make laws.","note":"The noun is countable, so it needs to be pluralized to match the plural verb."}],"priority":"★★★"},"related_words":{"derivatives":["colegislation (noun: the act of legislating together)"],"phrases":["work with colegislators","meet with colegislators","build consensus among colegislators"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★★★"},"readability_explanation":{"level":"C1","text":"The word \"colegislator\" is a formal term used in political contexts. It refers to a fellow member of a legislative body (like a parliament or congress) who works with others to create laws. Understanding this word requires familiarity with political terminology and the legislative process."},"example_sentences":[{"sentence":"The two **colegislators** worked together to draft the new bill.","translation":"その二人の共同立法者は協力して新しい法案を作成した。","type":"noun","meaning_category":"共同立法者"},{"sentence":"She reached out to her **colegislators** across party lines to gain support for the amendment.","translation":"彼女は修正案への支持を得るために、党派を超えて共同立法者たちに働きかけた。","type":"noun","meaning_category":"共同立法者"}]}