{"word":"sleepcoat","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古語)寝間着、ナイトガウン","english_definition":"(archaic) A loose robe or gown worn for sleeping; a nightgown or dressing gown.","examples":[{"sentence":"He donned his sleepcoat before retiring for the night.","translation":"彼は寝る前に寝間着を羽織った。"},{"sentence":"The gentleman wore a silk sleepcoat while reading in his study.","translation":"紳士は書斎で読書をする際に絹の寝間着を着用していた。"}],"collocations":["wear a sleepcoat","put on a sleepcoat","silk sleepcoat","velvet sleepcoat"],"synonyms":["nightgown","dressing gown","robe","nightshirt"],"antonyms":["daywear","outerwear"]}],"etymology":{"value":"\"Sleep\" + \"coat\".  Combination of the words 'sleep' referring to the act of sleeping, and 'coat' referring to a garment worn on the upper body.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsliːpkoʊt/","syllables":"sleep-coat"},"inflection":{"noun_plural":"sleepcoats"},"usage_notes":{"explanation":"The term 'sleepcoat' is largely archaic and rarely used in modern English.  It refers to a loose, comfortable garment worn for sleeping or relaxing at home, similar to a dressing gown or nightgown.  The term is more commonly found in older literature.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I wear a sleepcoat to the office.","correct":"✓ I wear a dressing gown at home.","note":"Sleepcoats are for sleeping or relaxing at home, not for wearing to the office."}],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (archaic)","frequency_google_ngram":"Very Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'sleepcoat' is an archaic term that is not commonly used in modern English. It refers to a type of loose robe or gown worn for sleeping, similar to a nightgown or dressing gown. Due to its infrequent usage, understanding this word requires familiarity with older literature and historical contexts."},"example_sentences":[{"sentence":"In the old painting, the nobleman is depicted wearing a richly embroidered sleepcoat.","translation":"その古い絵画では、貴族が豪華な刺繍が施された寝間着を身に着けて描かれている。","type":"noun","meaning_category":"寝間着"},{"sentence":"She changed into her sleepcoat and settled down with a book.","translation":"彼女は寝間着に着替えて、本を読んで落ち着いた。","type":"noun","meaning_category":"寝間着"}]}