{"word":"unemigrant","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(まれ) 移民でない人、移民しない人","english_definition":"(rare) A person who does not emigrate; a non-emigrant.","examples":[{"sentence":"The vast majority of the population remained unemigrants, staying in their ancestral lands.","translation":"人口の大部分は移民せず、祖先の土地に留まりました。"},{"sentence":"He was an unemigrant by choice, preferring the familiar comforts of his homeland.","translation":"彼は自らの選択で移民せず、故郷の慣れ親しんだ快適さを好みました。"}],"collocations":["become an unemigrant","remain an unemigrant"],"synonyms":["non-emigrant","stayer"],"antonyms":["emigrant","immigrant"]},{"part_of_speech":"adjective","definition":"(まれ) 移民しない、移民でない","english_definition":"(rare) Not emigrating; not relating to emigration.","examples":[{"sentence":"The unemigrant population experienced different social changes compared to those who left.","translation":"移民しなかった人々は、移住した人々とは異なる社会変化を経験しました。"},{"sentence":"Unemigrant communities often retain stronger ties to their cultural heritage.","translation":"移民しないコミュニティは、多くの場合、文化的遺産との結びつきをより強く保持しています。"}],"collocations":["unemigrant population","unemigrant community"],"synonyms":["non-emigrating"],"antonyms":["emigrating"]}],"etymology":{"value":"\"un-\" (否定の接頭辞) + \"emigrant\". \"Emigrant\" は \"e-\" (外へ) + \"migrant\" (移動する人) に由来します。つまり、文字通りには「外へ移動しない人」を意味します。","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈɛmɪɡrənt/","syllables":"un-em-i-grant"},"inflection":{"noun_plural":"unemigrants","adjective_forms":{}},"usage_notes":{"explanation":"\"Unemigrant\" は非常にまれな単語であり、一般的には \"non-emigrant\" がより一般的です。主に学術的な文脈や、移民と非移民を対比させる必要がある場合に用いられます。日常会話ではほとんど使用されません。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an unemigrant to Canada.","correct":"✓ He is not an emigrant to Canada.","note":"\"Unemigrant\" は移民しない人そのものを指すため、方向を示す前置詞 \"to\" と共に使うのは不適切です。移民しないことを表現する場合は、否定形 \"not an emigrant\" を使います。"},{"incorrect":"✗ The unemigrant of people from the village is small.","correct":"✓ The number of emigrants from the village is small. / ✓ The number of people who did not emigrate from the village is large.","note":"文脈によっては、移民の数を表現したいのか、移民しなかった人の数を表現したいのかを明確にする必要があります。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["emigrant","immigrant","migration","non-emigrant"]},"level_frequency":{"CEFR":"N/A (非常にまれな単語)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Unemigrant\" is a rare and somewhat technical term. It is formed by adding the prefix \"un-\" to \"emigrant,\" indicating someone who does not emigrate. This word is primarily used in academic or formal contexts when contrasting emigrants with those who remain in their home country. Due to its infrequent use, it is not commonly understood and may require explanation. In most cases, using the phrase \"non-emigrant\" is a more accessible and widely understood alternative."},"example_sentences":[{"sentence":"Studies comparing emigrant and unemigrant populations can reveal important insights into the effects of migration.","translation":"移民と移民しなかった人々の集団を比較する研究は、移住の影響に関する重要な洞察を明らかにすることができます。","type":"noun","meaning_category":"移民でない人"},{"sentence":"The unemigrant families maintained traditional customs more readily than those who moved abroad.","translation":"移民しなかった家族は、海外に移住した家族よりも伝統的な習慣をより容易に維持しました。","type":"adjective","meaning_category":"移民しない"}]}