{"word":"bay-winged","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"茶褐色の翼を持つ","english_definition":"Having bay-colored wings. (Bay is a reddish-brown color, often used to describe horses.)","examples":[{"sentence":"The bay-winged cowbird is a common sight in this area.","translation":"茶褐色の翼を持つコウウチョウは、この地域でよく見かける鳥です。"},{"sentence":"We spotted a bay-winged bunting perched on the fence.","translation":"私たちは茶褐色の翼を持つホオジロが柵にとまっているのを見つけました。"}],"collocations":["bay-winged cowbird","bay-winged bunting"],"synonyms":["reddish-brown winged","rufous-winged"],"antonyms":[]}],"etymology":{"value":"'Bay' (a reddish-brown color) + 'winged' (having wings).","priority":"★★★"},"pronunciation":{"ipa":"/ˈbeɪˌwɪŋd/","syllables":"bay-winged"},"inflection":{"notes":"This is an adjective, so it doesn't inflect."},"usage_notes":{"explanation":"This term is most often used in ornithology (the study of birds) to describe species with wings that are a bay (reddish-brown) color. It's a descriptive term rather than a common everyday word.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bird was bay-winged, but it was blue.","correct":"✓ The bird was bay-winged; its wings were reddish-brown.","note":"'Bay' specifically refers to a reddish-brown color, so it can't be used to describe something that is blue."}],"priority":"★☆☆"},"related_words":{"derivatives":["bay (noun: a reddish-brown color)","winged (adjective: having wings)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very specialized vocabulary)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'bay-winged' is a specialized adjective used primarily in ornithology to describe birds with reddish-brown wings. Understanding this term requires familiarity with color terminology and basic bird identification vocabulary. Due to its limited usage and specialized context, it is considered advanced vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The field guide identified the bird as a bay-winged tanager.","translation":"そのフィールドガイドは、その鳥を茶褐色の翼を持つフウキンチョウだと特定しました。","type":"adjective","meaning_category":"description"},{"sentence":"The photographer captured a stunning image of a bay-winged bird in flight.","translation":"写真家は、飛行中の茶褐色の翼を持つ鳥の素晴らしい画像を捉えました。","type":"adjective","meaning_category":"description"}]}