{"word":"Osiandrian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Relating to Andreas Osiander or his theological views.","english_definition":"Relating to or characteristic of the theological views of Andreas Osiander, a German theologian of the Reformation.","examples":[{"sentence":"Osiandrian theology was controversial during the Reformation.","translation":"オジアンダーの神学は宗教改革期に論争の的となった。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"A follower of Andreas Osiander or his theological views.","english_definition":"A follower or adherent of the theological views of Andreas Osiander.","examples":[{"sentence":"Some considered him an Osiandrian because of his beliefs.","translation":"彼の信念から、彼をオジアンダー派と見なす者もいた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the name of Andreas Osiander (1498-1552), a German Protestant theologian, with the suffix '-ian' indicating association or adherence.","priority":"★★★"},"pronunciation":{"ipa":"/ˌoʊziˈændriən/","syllables":"O-si-an-dri-an"},"inflection":{},"usage_notes":{"explanation":"The term 'Osiandrian' is primarily used in historical and theological contexts to refer to the specific doctrines and followers of Andreas Osiander. His views on justification, particularly the idea that Christ's righteousness is infused into believers rather than imputed, were controversial.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Osiander","Osiandrism"],"related_terms":["Lutheran","Reformation","Protestant"],"priority":"★★☆"},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The word 'Osiandrian' is highly specialized and primarily encountered in academic or theological discussions related to the Reformation period. Understanding requires familiarity with 16th-century theological debates. "},"example_sentences":[{"sentence":"The Osiandrian controversy centered on the nature of justification.","translation":"オジアンダー論争は、義認の本質を中心としていた。","type":"adjective","meaning_category":"Relating to Andreas Osiander"},{"sentence":"The Osiandrians held distinct views on Christ's righteousness.","translation":"オジアンダー派は、キリストの義について独特の見解を持っていた。","type":"noun","meaning_category":"Follower of Andreas Osiander"}]}