{"word":"psychognosis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"霊視、透視、人の心を読む能力","english_definition":"The purported ability to discern the character or thoughts of another person through extrasensory perception; the ability to gain knowledge of a person's character or past events through paranormal means.","examples":[{"sentence":"Some believe that psychognosis can be used to solve crimes by gaining insight into the perpetrator's mind.","translation":"霊視は、犯人の心の内を知ることによって犯罪を解決するために使用できると信じる人もいます。"},{"sentence":"The psychic claimed to have psychognosis, allowing her to see events from the past associated with an object.","translation":"その霊媒は、霊視能力を持っていると主張し、物体に関連する過去の出来事を見ることができると述べました。"}],"collocations":["possess psychognosis","develop psychognosis","use psychognosis","psychognosis abilities","paranormal psychognosis"],"synonyms":["clairvoyance","telepathy","mind-reading","extrasensory perception","second sight"],"antonyms":["ignorance","incomprehension","lack of understanding"]}],"etymology":{"value":"Derived from the Greek words 'psycho-' (relating to the mind or soul) and 'gnosis' (knowledge).","priority":"★★★"},"pronunciation":{"ipa":"/ˌsaɪkoʊɡˈnoʊsɪs/","syllables":"psy-cho-gno-sis"},"inflection":{"noun_plural":"psychognoses"},"usage_notes":{"explanation":"Psychognosis is a term used in parapsychology to describe the alleged ability to gain knowledge about a person's character, thoughts, or past events through extrasensory means. It is often associated with psychics and mediums. The term is not widely recognized in mainstream science.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Psychognosis is a scientifically proven method for understanding people.","correct":"✓ Psychognosis is a purported paranormal ability, not a scientifically proven method.","note":"It is important to note that psychognosis is not scientifically validated."},{"incorrect":"✗ He used psychognosis to diagnose the patient's illness.","correct":"✓ He claimed to use psychognosis to understand the patient's emotional state.","note":"Psychognosis is generally related to understanding a person's character or past, not medical diagnosis."}],"priority":"★★☆"},"related_words":{"derivatives":["psychognostic (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Not commonly used)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Psychognosis' is a specialized term primarily used in the context of parapsychology and psychic phenomena. It refers to the supposed ability to gain insights into a person's character or past events through extrasensory perception. Due to its limited usage and association with paranormal claims, it is not part of common vocabulary. Understanding the term requires familiarity with concepts of ESP and psychic abilities.","priority":"★★☆"},"example_sentences":[{"sentence":"The detective consulted a psychic who claimed to have psychognosis to help solve the cold case.","translation":"刑事は、未解決事件の解決を助けるために、霊視能力を持つと主張する霊媒に相談しました。","type":"general","meaning_category":"霊視"},{"sentence":"Skeptics argue that claims of psychognosis are often based on vague statements and cold reading techniques.","translation":"懐疑論者は、霊視の主張はしばしば曖昧な発言とコールドリーディングのテクニックに基づいていると主張します。","type":"critical","meaning_category":"霊視"},{"sentence":"In some fictional works, characters with psychognosis can touch an object and instantly know its history.","translation":"いくつかのフィクション作品では、霊視能力を持つキャラクターは物体に触れると、その歴史を瞬時に知ることができます。","type":"fictional","meaning_category":"霊視"}]}