{"word":"de-standardization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"標準化解除、非標準化","english_definition":"The act or process of removing or reversing standardization; the state of being no longer standardized.","examples":[{"sentence":"The de-standardization of education can lead to a wider range of teaching methods.","translation":"教育の非標準化は、より幅広い教育方法につながる可能性があります。"},{"sentence":"There is a growing trend towards de-standardization in the software industry.","translation":"ソフトウェア業界では、非標準化の傾向が強まっています。"},{"sentence":"The de-standardization of products allows for greater customization.","translation":"製品の非標準化により、より高度なカスタマイズが可能になります。"}],"collocations":["complete de-standardization","partial de-standardization","policy of de-standardization","process of de-standardization"],"synonyms":["non-standardization","diversification","heterogenization"],"antonyms":["standardization","normalization","uniformity"]}],"etymology":{"value":"Formed by adding the prefix 'de-' (meaning 'removal' or 'reversal') to the word 'standardization'.","priority":"★★☆"},"pronunciation":{"ipa":"/diːˌstændərdaɪˈzeɪʃən/","syllables":"de-stan-dard-i-za-tion"},"inflection":{"noun_plural":"de-standardizations"},"usage_notes":{"explanation":"'De-standardization' refers to the process of moving away from established standards. This can occur in various fields, such as education, technology, and manufacturing. It often implies a move towards greater flexibility, customization, or diversity. The term is relatively formal and is often used in academic or technical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The de-standardization is good for all.","correct":"✓ De-standardization can be beneficial in certain contexts, but not necessarily for all.","note":"De-standardization is not inherently good or bad; its value depends on the specific context and goals."},{"incorrect":"✗ We need to de-standardize everything.","correct":"✓ We need to evaluate which aspects can benefit from de-standardization.","note":"Complete de-standardization may not be practical or desirable. Selective de-standardization is often more effective."}],"priority":"★★☆"},"related_words":{"derivatives":["de-standardize (verb)","standardization (noun)","standard (noun, adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'De-standardization' is a complex term that describes the process of moving away from established norms or standards. It's often used in discussions about changes in systems or processes, such as in education or industry, where there is a shift towards more varied or customized approaches. Understanding this term requires a good grasp of abstract concepts and specialized vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The company implemented a de-standardization strategy to better cater to local markets.","translation":"その会社は、現地の市場により良く対応するために、非標準化戦略を実施しました。","type":"noun","meaning_category":"非標準化 (戦略)"},{"sentence":"The de-standardization of testing methods has raised concerns about comparability.","translation":"試験方法の非標準化は、比較可能性に関する懸念を引き起こしています。","type":"noun","meaning_category":"非標準化 (試験方法)"},{"sentence":"De-standardization allows for more innovative solutions to emerge.","translation":"非標準化により、より革新的なソリューションが生まれる可能性があります。","type":"noun","meaning_category":"非標準化 (結果)"}]}