{"word":"cockscomb","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"鶏冠（とさか）","english_definition":"the fleshy red crest on the head of a domestic fowl, especially a rooster.","examples":[{"sentence":"The rooster's cockscomb was bright red.","translation":"その雄鶏の鶏冠は鮮やかな赤色だった。"}],"collocations":["bright red cockscomb","large cockscomb"],"synonyms":["comb","crest"]},{"part_of_speech":"noun","definition":"ケイトウ（鶏頭）の花","english_definition":"a plant of the genus Celosia, especially Celosia cristata, with brightly colored flower heads resembling a cockscomb.","examples":[{"sentence":"She planted cockscombs in her garden.","translation":"彼女は庭にケイトウを植えた。"}],"collocations":["red cockscomb","yellow cockscomb","cockscomb flower"],"synonyms":["celosia"]},{"part_of_speech":"noun","definition":"（軽蔑的に）お洒落な人、気取り屋","english_definition":"(derogatory) a conceited, showy person; a fop.","examples":[{"sentence":"He was a cockscomb, always concerned with his appearance.","translation":"彼は気取り屋で、いつも自分の外見ばかり気にしていた。"}],"collocations":["arrant cockscomb"],"synonyms":["fop","dandy","coxcomb"]},{"part_of_speech":"noun","definition":"（古語）愚か者、ばか","english_definition":"(archaic) a fool; a simpleton.","examples":[{"sentence":"Don't be such a cockscomb!","translation":"そんな馬鹿なことをするな！"}],"collocations":[],"synonyms":["fool","simpleton","idiot"]}],"etymology":{"value":"'Cockscomb' is a compound word derived from 'cock' (referring to a male chicken) and 'comb' (referring to the crest on its head). The flower's name comes from its resemblance to a rooster's comb. The derogatory sense likely arose from associating showy, vain individuals with the flamboyant appearance of a rooster's comb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒkskoʊm/","syllables":"cocks-comb"},"inflection":{"noun_plural":"cockscombs"},"usage_notes":{"explanation":"'Cockscomb' has several meanings, ranging from the literal (the crest on a rooster's head) to the botanical (the Celosia flower) and the figurative (a derogatory term for a vain or foolish person). The derogatory senses are less common in modern usage. When used to describe a person, it is considered quite old-fashioned.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wore a cockscomb on his head to the party.","correct":"✓ He wore a hat resembling a cockscomb to the party.","note":"Unless referring to an actual rooster's comb, it's more common to say someone wore something *resembling* a cockscomb, especially if referring to a hat or hairstyle."}],"priority":"★☆☆"},"related_words":{"derivatives":["cockscombed (adjective)"],"phrases":[],"related_terms":["comb (general term for crest)","rooster","celosia"]},"level_frequency":{"CEFR":"(Not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'cockscomb' has multiple meanings, some of which are archaic or derogatory. It's important to understand the context to interpret the intended meaning correctly. The primary meaning refers to the crest on a rooster's head, while another meaning refers to a type of flower. The derogatory meaning, referring to a vain or foolish person, is less common in modern usage and may be considered offensive. Therefore, careful consideration of the context is necessary when encountering this word."},"example_sentences":[{"sentence":"The farmer admired the rooster's bright red cockscomb.","translation":"農夫は雄鶏の鮮やかな赤い鶏冠を称賛した。","type":"noun","meaning_category":"鶏冠"},{"sentence":"She added cockscombs to the flower arrangement for a pop of color.","translation":"彼女は花に彩りを添えるためにケイトウをフラワーアレンジメントに加えた。","type":"noun","meaning_category":"ケイトウの花"},{"sentence":"He was considered a cockscomb for his extravagant clothing and haughty demeanor.","translation":"彼は派手な服装と傲慢な態度で気取り屋だと思われていた。","type":"noun","meaning_category":"お洒落な人 (軽蔑的に)"}]}