{"word":"lamprophyric","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"斑糲岩質の、ラプロファイア組織の","english_definition":"Pertaining to or having a texture like that of lamprophyre; characterized by the presence of large, conspicuous phenocrysts (crystals) of mafic minerals (such as biotite, amphibole, or pyroxene) in a fine-grained groundmass.","examples":[{"sentence":"The rock sample exhibited a lamprophyric texture, with visible biotite phenocrysts.","translation":"その岩石サンプルは、目に見える黒雲母の斑晶を持つ、斑糲岩質の組織を示した。"}],"collocations":["lamprophyric texture","lamprophyric dikes","lamprophyric rocks"],"synonyms":["porphyritic (in a general sense, but lamprophyric specifically refers to mafic phenocrysts)"],"antonyms":[]}],"etymology":{"value":"Derived from 'lamprophyre' (a type of igneous rock) + '-ic' (suffix indicating pertaining to). 'Lamprophyre' itself comes from the Greek 'lampros' (shining) + 'phyre' (rock, texture), referring to the shiny appearance of the mafic phenocrysts.","priority":"★★★"},"pronunciation":{"ipa":"/ˌlæmprəˈfɪrɪk/","syllables":"lam-pro-phyr-ic"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"The term 'lamprophyric' is primarily used in geology and petrology to describe the texture of certain igneous rocks, specifically those belonging to the lamprophyre family. It indicates a distinctive porphyritic texture where large, well-formed crystals (phenocrysts) of dark, magnesium- and iron-rich (mafic) minerals are embedded in a fine-grained or glassy groundmass. The term is highly technical and rarely used outside of geological contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The lamprophyric rock was light in color.","correct":"✓ The lamprophyric rock contained dark, mafic minerals.","note":"Lamprophyric rocks are typically dark in color due to the abundance of mafic minerals."}],"priority":"★★☆"},"related_words":{"derivatives":["lamprophyre (noun: the rock type itself)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (Very specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Lamprophyric' is a highly specialized term used exclusively in geology to describe a specific rock texture. It refers to igneous rocks characterized by large, visible crystals of dark, mafic minerals within a finer-grained matrix. Due to its technical nature, it is unlikely to be encountered outside of advanced geological studies or literature."},"example_sentences":[{"sentence":"The thin section revealed a beautiful lamprophyric texture with euhedral amphibole crystals.","translation":"薄片は、自形の角閃石結晶を持つ美しい斑糲岩質の組織を明らかにした。","type":"adjective","meaning_category":"texture description"},{"sentence":"The lamprophyric dike cut through the granite formation.","translation":"斑糲岩質の岩脈が花崗岩層を横切って走っていた。","type":"adjective","meaning_category":"geological context"}]}