{"word":"electroacoustically","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"電気音響的に","english_definition":"In a manner relating to electroacoustics, the branch of physics and engineering concerned with the design and application of devices that convert electrical energy into acoustic energy (sound), or vice versa.","examples":[{"sentence":"The music was enhanced electroacoustically to create a more immersive experience.","translation":"その音楽は、より没入感のある体験を生み出すために電気音響的に強化されました。"},{"sentence":"Electroacoustically modified instruments were used in the performance.","translation":"電気音響的に改造された楽器が演奏で使用されました。"},{"sentence":"The room was designed electroacoustically to minimize reverberation.","translation":"その部屋は、残響を最小限に抑えるために電気音響的に設計されました。"}],"collocations":["electroacoustically modified","electroacoustically designed","electroacoustically enhanced"],"synonyms":["electronically","sonically","acoustically"],"antonyms":[]}],"etymology":{"value":"Derived from 'electroacoustic' (combining 'electro-' relating to electricity and 'acoustic' relating to sound) + '-ally' (suffix forming adverbs).","priority":"★★★"},"pronunciation":{"ipa":"/ɪˌlɛktroʊəˈkuːstɪkli/","syllables":"e-lec-tro-a-cou-sti-cal-ly"},"inflection":{"notes":"Adverb, so no inflection."},"usage_notes":{"explanation":"'Electroacoustically' describes actions or processes that involve both electrical and acoustic principles. It is often used in contexts related to sound recording, amplification, reproduction, and analysis. It implies the use of technology to manipulate or enhance sound.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The concert was electroacoustic.","correct":"The concert was electroacoustically enhanced.","note":"'Electroacoustic' is an adjective, while 'electroacoustically' is an adverb. Use the adverb to describe how something was done."}],"priority":"★★☆"},"related_words":{"derivatives":["electroacoustic (adjective)","electroacoustics (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'electroacoustically' is a technical term used to describe something done using both electrical and acoustic principles. It's most often found in discussions about sound engineering, music production, or the design of spaces for optimal sound quality. If you encounter this word, it usually means that technology is being used to manipulate or improve sound in some way."},"example_sentences":[{"sentence":"The singer's voice was amplified electroacoustically for the large audience.","translation":"歌手の声は、大勢の観客のために電気音響的に増幅されました。","type":"general","meaning_category":"amplification"},{"sentence":"The composer manipulated the sounds electroacoustically to create a unique soundscape.","translation":"作曲家は、ユニークなサウンドスケープを作成するために、電気音響的に音を操作しました。","type":"music","meaning_category":"sound manipulation"},{"sentence":"The concert hall was designed electroacoustically to ensure optimal sound quality.","translation":"コンサートホールは、最適な音質を確保するために電気音響的に設計されました。","type":"engineering","meaning_category":"design"}]}