{"word":"prejudgment","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"先入観、予断、偏見","english_definition":"A premature judgment or opinion; an opinion formed before sufficient knowledge or deliberation.","examples":[{"sentence":"The committee made their decision without pre-judgment.","translation":"委員会は先入観なしに決定を下した。"},{"sentence":"Her pre-judgment of the situation led to a misunderstanding.","translation":"彼女の状況に対する予断が誤解を招いた。"},{"sentence":"Avoid pre-judgment based on appearances.","translation":"外見に基づく先入観は避けるべきだ。"}],"collocations":["avoid pre-judgment (先入観を避ける)","without pre-judgment (先入観なしに)","based on pre-judgment (先入観に基づいて)"],"synonyms":["preconception","bias","prejudice","assumption","forejudgment"],"antonyms":["objectivity","impartiality","fairness"]}],"etymology":{"value":"'Pre-' (before) + 'judgment' (the act of judging).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌpriːˈdʒʌdʒmənt/","syllables":"pre-judge-ment"},"inflection":{"noun_plural":"prejudgments"},"usage_notes":{"explanation":"'Prejudgment' refers to forming an opinion or making a judgment before having all the necessary information. It often implies unfairness or bias. It's important to distinguish it from 'judgment,' which is a reasoned decision based on available evidence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He showed pre-judgment against her because she was new.","correct":"He showed prejudice against her because she was new.","note":"'Prejudice' is more commonly used to describe a negative attitude or feeling towards a person or group based on stereotypes or preconceived notions. While 'prejudgment' can imply prejudice, it focuses more on the act of forming an opinion prematurely."}],"priority":"★☆☆"},"related_words":{"derivatives":["prejudge (verb): to judge prematurely","prejudiced (adjective): having or showing a bias"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Prejudgment' is a formal term that describes the act of forming an opinion or making a decision before having all the necessary information. It often suggests unfairness or bias. This word is less common in everyday conversation and more likely to appear in formal writing or discussions about ethics, fairness, or decision-making processes."},"example_sentences":[{"sentence":"The lawyer argued that the jury's pre-judgment of the defendant made a fair trial impossible.","translation":"弁護士は、陪審員の被告に対する先入観が公正な裁判を不可能にしたと主張した。","type":"noun","meaning_category":"先入観"},{"sentence":"The company's policy is to evaluate all applications without pre-judgment.","translation":"会社のポリシーは、すべての申請を先入観なしに評価することだ。","type":"noun","meaning_category":"予断"},{"sentence":"It is crucial to approach new situations without pre-judgment to foster open-mindedness.","translation":"偏見を持たずに新しい状況に接することは、偏見のない心を持つために重要だ。","type":"noun","meaning_category":"偏見"}]}