{"word":"inaudibility","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"聞こえなさ、聴取不能","english_definition":"The state or quality of being inaudible; the inability to be heard.","examples":[{"sentence":"The inaudibility of his whisper made it impossible to understand him.","translation":"彼のささやき声が聞こえなかったため、彼を理解することは不可能だった。"},{"sentence":"Due to the poor acoustics, there was complete inaudibility in the back of the room.","translation":"音響が悪いため、部屋の後ろでは全く聞こえなかった。"}],"collocations":["complete inaudibility (完全に聞こえないこと)","near inaudibility (ほとんど聞こえないこと)","problem of inaudibility (聞こえなさの問題)"],"synonyms":["unhearability","imperceptibility","faintness","silence"],"antonyms":["audibility","hearability","perceptibility","loudness"]}],"etymology":{"value":"Formed from the prefix 'in-' (not), the adjective 'audible' (capable of being heard), and the suffix '-ity' (state or quality).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪnˌɔːdəˈbɪləti/","syllables":"in-au-di-bil-i-ty"},"inflection":{"noun_plural":"inaudibilities"},"usage_notes":{"explanation":"'Inaudibility' refers to the condition where something cannot be heard, either due to its faintness, distance, or other factors affecting sound transmission. It is often used in discussions about sound quality, acoustics, or communication difficulties.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The inaudibility was because of the loud noise.","correct":"✓ The inaudibility was due to the loud noise.","note":"Use 'due to' or 'because of' to indicate the cause of the inaudibility."},{"incorrect":"✗ He spoke with inaudible.","correct":"✓ He spoke with inaudibility.","note":"'Inaudibility' is a noun, so it should be used to describe the state or quality of not being heard."}],"priority":"★★☆"},"related_words":{"derivatives":["inaudible (adjective: not able to be heard)","inaudibly (adverb: in a way that cannot be heard)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Inaudibility' is a formal term used to describe the state of not being able to hear something. This word is not commonly used in everyday conversation and is more likely to appear in technical or academic contexts related to acoustics, sound engineering, or communication studies. It implies a complete or near-complete absence of sound perception."},"example_sentences":[{"sentence":"The recording suffered from frequent periods of inaudibility, making it difficult to transcribe.","translation":"録音には頻繁に聞こえない部分があり、書き起こしが困難だった。","type":"general","meaning_category":"聞こえなさ"},{"sentence":"The judge noted the inaudibility of the witness's testimony due to the distance from the microphone.","translation":"裁判官は、マイクからの距離のために証人の証言が聞こえなかったことを指摘した。","type":"legal","meaning_category":"聞こえなさ"},{"sentence":"The engineers worked to reduce the inaudibility of the warning signals in the factory.","translation":"エンジニアたちは、工場内の警告信号が聞こえにくい状態を改善するために尽力した。","type":"technical","meaning_category":"聞こえなさ"}]}