{"word":"Medicaid","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"メディケイド（米国における低所得者向けの医療扶助制度）","english_definition":"A joint federal and state government program in the United States that provides health insurance coverage to millions of low-income Americans, including children, pregnant women, seniors, and people with disabilities.","examples":[{"sentence":"Medicaid provides essential healthcare services to vulnerable populations.","translation":"メディケイドは脆弱な人々にとって不可欠な医療サービスを提供します。"},{"sentence":"Eligibility for Medicaid varies by state.","translation":"メディケイドの受給資格は州によって異なります。"},{"sentence":"The expansion of Medicaid has significantly increased healthcare access.","translation":"メディケイドの拡大は医療へのアクセスを大幅に増加させました。"}],"collocations":["Medicaid expansion (メディケイドの拡大)","Medicaid coverage (メディケイドの保障範囲)","Medicaid eligibility (メディケイドの受給資格)","Medicaid benefits (メディケイドの給付)","Medicaid recipient (メディケイド受給者)","Medicaid program (メディケイドプログラム)"],"synonyms":["government-sponsored healthcare","public health insurance","socialized medicine (批判的な文脈で)"],"antonyms":["private health insurance","employer-sponsored insurance"]},{"part_of_speech":"noun","definition":"（一般的に）低所得者向け公的医療扶助","english_definition":"Generally, public health assistance for low-income individuals.","examples":[{"sentence":"Many countries have Medicaid-like programs to ensure healthcare access for the poor.","translation":"多くの国が、貧困層の医療アクセスを確保するためにメディケイドのような制度を持っています。"}],"collocations":[],"synonyms":["public healthcare","social welfare healthcare"],"antonyms":["private healthcare"]}],"etymology":{"value":"The term 'Medicaid' was established in the United States as part of the Social Security Amendments of 1965. It is a portmanteau of 'medical' and 'aid,' reflecting its purpose of providing medical assistance to those in need.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɛdɪˌkeɪd/","syllables":"Me-di-caid"},"inflection":{"notes":"Medicaid is a proper noun and typically does not have a plural form."},"usage_notes":{"explanation":"'Medicaid' specifically refers to the U.S. healthcare program. While other countries may have similar programs, it's important to use the correct terminology when discussing healthcare systems outside of the United States. The program is jointly funded by the federal government and individual states, and each state has some flexibility in administering its Medicaid program.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a Medicaid card from Canada.","correct":"✓ I have a health insurance card from Canada.","note":"Medicaid is specific to the United States. If referring to a similar program in another country, use the general term 'health insurance' or the specific name of that country's program."},{"incorrect":"✗ Medicaid is only for old people.","correct":"✓ Medicaid is for low-income individuals, including children, pregnant women, seniors, and people with disabilities.","note":"Medicaid serves various demographics, not just the elderly. It is primarily based on income level."}],"priority":"★★☆"},"related_words":{"derivatives":["Medicaid-eligible (メディケイド受給資格のある)","Medicaid expansion (メディケイド拡大)"],"related_terms":["Medicare (メディケア - 高齢者および障害者向け医療保険)","Affordable Care Act (ACA) (医療費負担適正化法)","CHIP (Children's Health Insurance Program) (児童医療保険プログラム)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (専門的な文脈で)","frequency_google_ngram":"比較的頻繁 (Relatively frequent) - 特にアメリカの政治・経済・社会に関する文脈で。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Medicaid' is a term primarily used in the United States to refer to a specific government program that provides healthcare to low-income individuals and families. Understanding the term requires familiarity with the U.S. healthcare system and social welfare programs. The program is complex, with eligibility requirements and benefits varying by state. Discussions involving Medicaid often involve policy debates, funding issues, and the impact on vulnerable populations. Therefore, a high level of reading comprehension is needed to fully grasp the nuances of the term and its implications."},"example_sentences":[{"sentence":"She qualified for **Medicaid** after losing her job.","translation":"彼女は失業後、メディケイドの受給資格を得ました。","type":"noun","meaning_category":"医療扶助制度"},{"sentence":"The state is considering expanding **Medicaid** coverage to more residents.","translation":"その州は、より多くの住民にメディケイドの保障範囲を拡大することを検討しています。","type":"noun","meaning_category":"医療扶助制度"},{"sentence":"Many hospitals rely on **Medicaid** reimbursements to stay afloat.","translation":"多くの病院は、経営を維持するためにメディケイドの払い戻しに頼っています。","type":"noun","meaning_category":"医療扶助制度"}]}