{"word":"lead-lapped","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(rare, technical) Covered or lined with lead; also, protected or shielded by lead.","english_definition":"Covered or lined with lead; also, protected or shielded by lead.","examples":[{"sentence":"The x-ray machine had a lead-lapped shield to protect the technician.","translation":"そのX線装置には、技術者を保護するための鉛で覆われたシールドがあった。"},{"sentence":"The old water pipes were lead-lapped, which posed a health risk.","translation":"古い水道管は鉛で覆われており、健康上のリスクがあった。"}],"collocations":["lead-lapped shield","lead-lapped pipes","lead-lapped container"],"synonyms":["lead-lined","lead-covered","lead-shielded"],"antonyms":["unshielded","unprotected"]}],"etymology":{"value":"Combination of 'lead' (the metal) and 'lapped' (covered, wrapped around).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɛd læpt/","syllables":"lead-lapped"},"inflection":{"notes":"This word is an adjective and does not inflect."},"usage_notes":{"explanation":"The term 'lead-lapped' is relatively uncommon and is typically found in technical or historical contexts where the use of lead as a protective material is relevant. It describes something that has been covered, lined, or shielded with lead, often to provide radiation protection or to prevent corrosion.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lead-lapped door was made of gold.","correct":"✓ The lead-lapped door had a lead lining.","note":"'Lead-lapped' describes the covering or lining material, not the base material of the object itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["lead (noun)","lap (verb)","lead-lining (noun)","lead-shielding (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'lead-lapped' is a specialized adjective used to describe something that is covered or lined with lead. It is not commonly used in everyday language and is more likely to be encountered in technical or historical contexts. Understanding this term requires familiarity with the properties and uses of lead as a protective material."},"example_sentences":[{"sentence":"The nuclear waste container was lead-lapped to prevent radiation leakage.","translation":"放射能漏れを防ぐため、核廃棄物容器は鉛で覆われていた。","type":"adjective","meaning_category":"covered with lead"},{"sentence":"For safety, the old x-ray equipment was stored in a lead-lapped room.","translation":"安全のため、古いX線装置は鉛で覆われた部屋に保管されていた。","type":"adjective","meaning_category":"shielded by lead"}]}