{"word":"voidably","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"無効にできる状態で、取り消しうる状態で","english_definition":"In a manner that can be voided or annulled; in a way that is not absolutely null but can be made so.","examples":[{"sentence":"The contract was voidably obtained due to misrepresentation.","translation":"その契約は不実表示により無効にできる状態で取得された。"},{"sentence":"The agreement is voidably invalid if one party was under duress.","translation":"一方の当事者が強要されていた場合、その合意は取り消しうる状態になる。"}],"collocations":["voidably defective","voidably liable","voidably unenforceable"],"synonyms":["revocably","annullably","rescindably"],"antonyms":["irrevocably","unassailably","validly"]}],"etymology":{"value":"Derived from 'voidable,' which comes from 'void' (empty, null) + '-able' (capable of being).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvɔɪdəbli/","syllables":"voi-da-bly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Voidably' describes the state of something, typically a contract or agreement, that is not automatically invalid but can be declared invalid by one of the parties involved due to specific circumstances like fraud, misrepresentation, or duress. It implies a right to rescind or annul the agreement.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The contract was voidably valid.","correct":"✓ The contract was voidable, but not yet void.","note":"'Voidably valid' is contradictory. Something 'voidable' is potentially invalid, not currently valid. It's in a state where it *could* be made void, but hasn't been yet."},{"incorrect":"✗ He acted voidably.","correct":"✓ The contract was entered into voidably.","note":"'Voidably' typically modifies actions related to agreements or contracts, not general actions of a person. It's more common to say the *agreement* was entered into voidably, rather than saying *he acted* voidably."}],"priority":"★★☆"},"related_words":{"derivatives":["voidable (adjective)","void (adjective, noun, verb)","avoid (verb)"],"phrases":["voidable contract","voidable title","voidable preference"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in legal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Voidably' is an adverb used in legal contexts to describe something that can be made void or invalid. It is derived from the adjective 'voidable,' which means that an agreement or contract is not automatically invalid but can be cancelled or revoked by one of the parties involved due to certain circumstances such as fraud or misrepresentation. The adverb 'voidably' indicates the manner in which the agreement or contract can be treated—that is, in a way that allows for its annulment. This term is not commonly used in everyday language and is primarily found in legal documents and discussions."},"example_sentences":[{"sentence":"The transaction was deemed voidably fraudulent by the court.","translation":"その取引は裁判所によって無効にできる詐欺的行為とみなされた。","type":"adverb","meaning_category":"In a manner that can be voided"},{"sentence":"The minor entered into the agreement voidably, giving him the option to disaffirm it upon reaching adulthood.","translation":"未成年者はその合意を取り消しうる状態で締結したので、成人後にそれを否認する選択肢がある。","type":"adverb","meaning_category":"In a manner that can be annulled"}]}