{"word":"Hexapoda","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"六脚亜綱：昆虫類を含む節足動物の分類群","english_definition":"A subphylum of arthropods that includes the insects and their close relatives, characterized by having a body divided into three parts (head, thorax, and abdomen) and six legs.","examples":[{"sentence":"Insects belong to the subphylum Hexapoda.","translation":"昆虫は六脚亜綱に属する。"},{"sentence":"The study of Hexapoda is essential for understanding terrestrial ecosystems.","translation":"六脚亜綱の研究は、陸上生態系を理解する上で不可欠である。"}],"collocations":["Hexapoda species","Hexapoda classification","study of Hexapoda"],"synonyms":["Insecta (昆虫綱, often used interchangeably but Insecta is a class within Hexapoda)"],"antonyms":[]}],"etymology":{"value":"Derived from Greek 'hexa-' (six) and 'poda' (feet), referring to the six legs characteristic of this group.","priority":"★★★"},"pronunciation":{"ipa":"/hɛkˈsæpədə/","syllables":"Hex-ap-o-da"},"inflection":{"noun_plural":"Hexapods"},"usage_notes":{"explanation":"'Hexapoda' is a scientific term used in biology and zoology to classify arthropods with six legs. While often used interchangeably with 'Insecta' (insects), Hexapoda also includes other related groups that may not be strictly classified as insects.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Hexapoda are all insects.","correct":"✓ Hexapoda include insects, but also other related arthropods.","note":"While insects are the most prominent group within Hexapoda, the subphylum also encompasses other related arthropods that are not strictly insects."}],"priority":"★☆☆"},"related_words":{"derivatives":["hexapod (adjective: relating to six-legged arthropods; noun: a six-legged arthropod)","Insecta (昆虫綱: a class within Hexapoda)"],"phrases":[]},"level_frequency":{"CEFR":"C2 (scientific vocabulary)","frequency_google_ngram":"Low frequency (scientific context)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hexapoda' is a technical term used in the field of zoology to refer to a specific subphylum of arthropods characterized by having six legs. It is primarily encountered in scientific literature, textbooks, and academic discussions related to entomology and invertebrate zoology. Understanding this term requires a background in biology or related scientific disciplines."},"example_sentences":[{"sentence":"The diversity of Hexapoda is unparalleled in the animal kingdom.","translation":"六脚亜綱の多様性は動物界において比類がない。","type":"general","meaning_category":"classification"},{"sentence":"Many agricultural pests are members of the Hexapoda.","translation":"多くの農業害虫は六脚亜綱に属する。","type":"ecological","meaning_category":"ecological"}]}