{"word":"Klephtism","priority":"低","meanings":[{"part_of_speech":"noun","definition":"ギリシャにおける、オスマン帝国支配に対する武装抵抗運動、またはそのイデオロギー","english_definition":"A form of armed resistance and social banditry practiced by Klephts in Ottoman Greece. It is characterized by guerrilla warfare, raiding, and defiance of Ottoman authority.","examples":[{"sentence":"Klephtism played a significant role in the Greek War of Independence.","translation":"クレフティズムはギリシャ独立戦争において重要な役割を果たした。"},{"sentence":"The ballads often romanticized the life of the Klephts and their struggle against the Ottomans.","translation":"バラッドはしばしばクレフテスの生活とオスマン帝国に対する彼らの闘争をロマンチックに描いた。"}],"collocations":["Klephtic ballads","Klephtic songs","Greek Klephts","Ottoman rule","armed resistance","social banditry"],"synonyms":["social banditry","resistance movement","guerrilla warfare"],"antonyms":["collaboration","submission"]}],"etymology":{"value":"Derived from the Greek word 'κλέφτης' (kléftis), meaning 'thief' or 'bandit'. The term was initially used pejoratively by the Ottomans to describe the Greek rebels, but it was later embraced by the Greeks themselves as a symbol of resistance.","priority":"中"},"pronunciation":{"ipa":"/ˈklɛftɪzəm/","syllables":"klep-htism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Klephtism is a historical term specifically referring to the activities and ideology of the Klephts in Greece during the Ottoman period. It is often associated with themes of national liberation, social justice, and resistance against foreign oppression. While the term 'banditry' is sometimes used, it is important to recognize the political and social context of Klephtism as a form of resistance.","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"✗ He supported banditry.","correct":"✓ He supported Klephtism.","note":"Use 'Klephtism' when referring to the specific historical and political context of Greek resistance against Ottoman rule, rather than general banditry."}],"priority":"低"},"related_words":{"derivatives":["Klepht (noun: a member of the Klephts)","Klephtic (adjective: relating to Klephts or Klephtism)"],"phrases":["Klephtic songs (songs about the Klephts)","Klephtic ballads (ballads about the Klephts)"],"priority":"中"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低い (Very low frequency) - 専門的な歴史用語","priority":"低"},"readability_explanation":{"level":"C2","text":"'Klephtism' is a specialized historical term referring to a specific form of resistance in Ottoman Greece. Understanding this term requires knowledge of Greek history and the Ottoman Empire. It is not a commonly used word and is typically encountered in academic or historical contexts."},"example_sentences":[{"sentence":"The spirit of Klephtism fueled the Greek desire for independence.","translation":"クレフティズムの精神は、ギリシャの独立への願望を掻き立てた。","type":"general","meaning_category":"historical context"},{"sentence":"Many Greek folk songs celebrate the bravery and cunning of the Klephts.","translation":"多くのギリシャ民謡は、クレフテスの勇敢さと狡猾さを称えている。","type":"cultural","meaning_category":"cultural significance"}]}