{"word":"hydrographer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"水路学者、水路測量技師","english_definition":"A person who studies and maps bodies of water such as oceans, rivers, and lakes.","examples":[{"sentence":"The hydrographer used sonar to map the ocean floor.","translation":"その水路学者は、海底を地図化するためにソナーを使用した。"},{"sentence":"Hydrographers play a crucial role in ensuring safe navigation.","translation":"水路学者は、安全な航行を確保する上で重要な役割を果たしている。"},{"sentence":"She works as a hydrographer for the national oceanographic agency.","translation":"彼女は国立海洋機関で水路学者として働いている。"}],"collocations":["charting the seas","mapping the ocean floor","conducting hydrographic surveys","working on nautical charts"],"synonyms":["chartmaker","marine surveyor","oceanographer (related, but broader)"],"antonyms":[]}],"etymology":{"value":"From 'hydro-' (related to water) + '-grapher' (one who writes or maps).","priority":"★★★"},"pronunciation":{"ipa":"/haɪˈdrɒɡrəfər/","syllables":"hy-dro-graph-er"},"inflection":{"noun_plural":"hydrographers"},"usage_notes":{"explanation":"A hydrographer's work is essential for creating and updating nautical charts and publications. They collect and analyze data about water depth, tides, currents, and the shape of coastlines. Their work supports safe navigation, coastal management, and environmental protection.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a hydrologist, studying water resources.","correct":"He is a hydrographer, mapping underwater features.","note":"Hydrography focuses on mapping water bodies for navigation and safety, while hydrology studies the properties and distribution of water on Earth."}],"priority":"★★☆"},"related_words":{"derivatives":["hydrography (noun: the science of surveying and charting bodies of water)","hydrographic (adjective: relating to hydrography)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"This term is specialized and technical, relating to the field of mapping and studying bodies of water. It is not commonly used in everyday conversation but is important in maritime and scientific contexts."},"example_sentences":[{"sentence":"The hydrographer deployed a remotely operated vehicle to inspect the shipwreck.","translation":"その水路学者は、難破船を調査するために遠隔操作の車両を展開した。","type":"general","meaning_category":"Mapping and Surveying"},{"sentence":"Accurate data from hydrographers is vital for updating nautical charts.","translation":"水路学者からの正確なデータは、航海図を更新するために不可欠である。","type":"general","meaning_category":"Navigation Safety"},{"sentence":"The hydrographer's report detailed the changes in the coastline due to erosion.","translation":"その水路学者の報告書は、浸食による海岸線の変化を詳細に記述していた。","type":"general","meaning_category":"Coastal Management"}]}