{"word":"double-negative","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"二重否定","english_definition":"A statement containing two negative elements, which may cancel each other out to create an affirmative statement, or may intensify the negative meaning.","examples":[{"sentence":"'I don't know nothing' is a double negative.","translation":"「I don't know nothing（私は何も知らないことはない）」は二重否定です。"},{"sentence":"The use of double negatives is often considered grammatically incorrect in standard English.","translation":"二重否定の使用は、標準英語では文法的に誤っていると見なされることが多いです。"}],"collocations":["avoid double negatives (二重否定を避ける)","use a double negative (二重否定を使う)","grammatical double negative (文法的な二重否定)"],"synonyms":["negative concord"],"antonyms":["affirmative statement"]},{"part_of_speech":"adjective","definition":"二重否定の","english_definition":"Relating to or characterized by the presence of two negative elements.","examples":[{"sentence":"The sentence contains a double-negative construction.","translation":"その文は二重否定の構造を含んでいます。"}],"collocations":["double-negative construction (二重否定の構造)","double-negative sentence (二重否定の文)"],"synonyms":[],"antonyms":["affirmative"]}],"etymology":{"value":"The term 'double-negative' is a compound word formed from 'double' (meaning two) and 'negative' (expressing negation or denial). It refers to the presence of two negative elements within the same clause or statement.","priority":"★★☆"},"pronunciation":{"ipa":"ˌdʌbəlˈnɛɡətɪv","syllables":"dub-ble-neg-a-tiv"},"inflection":{"noun_plural":"double-negatives"},"usage_notes":{"explanation":"A double negative is a construction in which two forms of negation are used in the same clause. In some languages, such as Spanish or Russian, double negatives are used to reinforce the negation. However, in standard English, double negatives are generally considered grammatically incorrect because they often cancel each other out, resulting in an affirmative meaning. For example, 'I don't know nothing' is technically equivalent to 'I know something,' although it is typically used to emphasize the negation in non-standard dialects.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I can't get no satisfaction.","correct":"✓ I can't get any satisfaction. / ✓ I can get no satisfaction.","note":"The first sentence uses a double negative, which is generally considered incorrect in standard English. The corrected sentences avoid the double negative. The first uses 'any' instead of 'no', and the second uses only one negative ('no')."},{"incorrect":"✗ He didn't say nothing.","correct":"✓ He didn't say anything. / ✓ He said nothing.","note":"Again, this is a double negative. The corrected sentences use 'anything' or 'nothing' to avoid the double negative."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, mainly used in linguistic or grammatical discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'double negative' refers to a grammatical construction where two negative words are used in the same clause. In standard English, this is often considered incorrect because the two negatives can cancel each other out, creating a positive meaning. However, in some dialects or other languages, double negatives are used to emphasize the negative meaning. Understanding double negatives is important for both grammar and effective communication."},"example_sentences":[{"sentence":"The phrase 'I can't hardly wait' is an example of a double-negative.","translation":"「I can't hardly wait（ほとんど待てないことはない）」というフレーズは二重否定の例です。","type":"noun","meaning_category":"二重否定"},{"sentence":"Using double-negative constructions can make your writing confusing.","translation":"二重否定の構造を使うと、文章が混乱する可能性があります。","type":"adjective","meaning_category":"二重否定の"},{"sentence":"In some dialects, double negatives are used for emphasis, not to create a positive meaning.","translation":"一部の方言では、二重否定は肯定的な意味を作るためではなく、強調のために使用されます。","type":"noun","meaning_category":"二重否定"},{"sentence":"The teacher explained the rules about using double negatives in formal writing.","translation":"先生は、フォーマルな文章で二重否定を使用する際のルールについて説明しました。","type":"noun","meaning_category":"二重否定"}]}