{"word":"Allodian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(法律)完全所有の、封建的義務のない","english_definition":"(law) held in absolute ownership; free of feudal obligations.","examples":[{"sentence":"Allodial land is owned outright, without any superior lord.","translation":"完全所有地は、いかなる上位の領主も存在せず、完全に所有されている。"},{"sentence":"In some jurisdictions, all land is ultimately owned by the government, so true allodial title is impossible.","translation":"一部の法域では、すべての土地は最終的に政府が所有しているため、真の完全所有権は不可能である。"}],"collocations":["allodial title","allodial land","allodial system"],"synonyms":["freehold","absolute ownership"],"antonyms":["feudal","leasehold"]}],"etymology":{"value":"Derived from Medieval Latin 'allodium,' meaning 'freehold estate,' from Germanic roots.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈloʊdiən/","syllables":"al-lo-di-an"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"'Allodial' refers to a type of land ownership where the land is owned completely, without any obligations to a lord or superior. This is in contrast to feudal systems where land ownership is based on a hierarchy of obligations. True allodial title is rare in modern legal systems.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The allodial system is common in Europe.","correct":"✓ The feudal system was common in Europe.","note":"The feudal system was more common historically in Europe, not the allodial system."}],"priority":"★☆☆"},"related_words":{"derivatives":["allodium (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Allodial' is a specialized legal term referring to absolute land ownership without feudal obligations. It is rarely used outside of legal contexts. Understanding requires familiarity with concepts of land tenure and historical legal systems."},"example_sentences":[{"sentence":"The concept of allodial ownership is central to understanding property rights in certain legal systems.","translation":"完全所有の概念は、特定の法制度における財産権を理解する上で中心となる。","type":"adjective","meaning_category":"legal"},{"sentence":"He sought to establish an allodial title to the land, free from any encumbrances.","translation":"彼は、いかなる負担もない、その土地に対する完全所有権を確立しようとした。","type":"adjective","meaning_category":"legal"}]}