{"word":"FIMS","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Functional Independence Measure) 機能的自立度評価法","english_definition":"(Functional Independence Measure) a basic indicator of disability. It is a standardized assessment tool used to measure a person's level of independence in performing basic activities of daily living (ADL).","examples":[{"sentence":"The patient's FIMS score improved significantly after rehabilitation.","translation":"リハビリテーション後、患者のFIMSスコアは大幅に改善しました。"},{"sentence":"FIMS is used to track progress in rehabilitation programs.","translation":"FIMSはリハビリテーションプログラムの進捗状況を追跡するために使用されます。"}],"collocations":["FIMS score (FIMSスコア)","FIMS assessment (FIMS評価)","FIMS data (FIMSデータ)"],"synonyms":["Functional Independence Measure"],"antonyms":[]}],"etymology":{"value":"An acronym for Functional Independence Measure.","priority":"★★★"},"pronunciation":{"ipa":"/fɪmz/","syllables":"fims"},"inflection":{"notes":"This is a noun and does not inflect."},"usage_notes":{"explanation":"FIMS is a widely used assessment tool in rehabilitation settings to measure a patient's functional abilities. It assesses both motor and cognitive functions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ FIM is a assessment tool.","correct":"✓ FIMS is an assessment tool.","note":"FIMS is the correct acronym. FIM is not correct."}],"priority":"★★★"},"related_words":{"derivatives":["FIM (related but not the same, refers to Fédération Internationale de Motocyclisme)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"FIMS (Functional Independence Measure) is a standardized assessment tool used primarily in healthcare settings, particularly in rehabilitation. It measures a patient's level of independence in performing activities of daily living (ADLs). The tool is used by healthcare professionals to track progress and outcomes in rehabilitation programs. Understanding FIMS requires familiarity with medical terminology and rehabilitation practices."},"example_sentences":[{"sentence":"The therapists used FIMS to evaluate the patient's ability to perform daily tasks.","translation":"セラピストはFIMSを用いて、患者が日常的なタスクを実行する能力を評価しました。","type":"noun","meaning_category":"Functional Independence Measure"}]}