{"word":"vulgarised","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(英国英語)（vulgarizeの英国スペル）大衆化する、通俗化する、下品にする","english_definition":"(British spelling of vulgarize) to make something acceptable to or used by the general public; to make something crude, indecent, or obscene.","examples":[{"sentence":"The media have vulgarised the concept of heroism.","translation":"メディアは英雄という概念を大衆化してしまった。"},{"sentence":"The play was vulgarised for a television audience.","translation":"その劇はテレビ視聴者向けに通俗化された。"}],"collocations":["vulgarise a concept","vulgarise a play"],"synonyms":["popularize","debase","coarsen"],"antonyms":["ennoble","refine"]}],"etymology":{"value":"'Vulgarise' is derived from 'vulgar', which comes from the Latin word 'vulgus' meaning 'common people'. The suffix '-ise' (or '-ize' in American English) is used to form verbs, indicating the act of making something vulgar or common.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈvʌlɡəraɪzd/","syllables":"vul-gar-ised"},"inflection":{"verb_forms":{"present_simple":["vulgarise","vulgarises"],"past_simple":"vulgarised","past_participle":"vulgarised","present_participle":"vulgarising"}},"usage_notes":{"explanation":"'Vulgarise' (or 'vulgarize' in American English) typically implies making something less refined or sophisticated, often to appeal to a wider audience. It can also mean to make something crude or offensive. The term is often used critically, suggesting a loss of quality or integrity.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He vulgarised his language in order to impress the queen.","correct":"✓ He vulgarised his language in order to impress his friends.","note":"Vulgarising language is usually done to appeal to a common or less refined audience, not to impress someone of high status like a queen."}],"priority":"☆☆☆"},"related_words":{"derivatives":["vulgar (adjective): lacking refinement or good taste; crude","vulgarity (noun): the state or quality of being vulgar","vulgarization (noun): the act of making something vulgar"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word 'vulgarised' means to make something common or crude. It's often used when something has been simplified or made less refined to appeal to a wider audience, sometimes with negative connotations. It's not a very common word, so it's more likely to be encountered in advanced texts or discussions about culture and media."},"example_sentences":[{"sentence":"The director was criticised for having vulgarised the original novel.","translation":"監督は、原作小説を大衆化しすぎたとして批判された。","type":"verb","meaning_category":"大衆化する"},{"sentence":"The debate has been vulgarised by personal attacks.","translation":"その討論は、個人攻撃によって下品になってしまった。","type":"verb","meaning_category":"下品にする"}]}