{"word":"inelasticity","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"非弾性、弾力性のなさ、不弾性","english_definition":"The state or quality of being inelastic; lack of elasticity.","examples":[{"sentence":"The inelasticity of demand for essential goods means that price changes have little effect on the quantity purchased.","translation":"生活必需品に対する需要の非弾力性とは、価格の変化が購入量にほとんど影響を与えないことを意味します。"},{"sentence":"The inelasticity of supply in the short term can lead to significant price fluctuations.","translation":"短期的な供給の非弾力性は、大幅な価格変動につながる可能性があります。"},{"sentence":"The inelasticity of the material made it unsuitable for the intended application.","translation":"その材料の非弾性により、意図された用途には不向きでした。"}],"collocations":["demand inelasticity (需要の非弾性)","supply inelasticity (供給の非弾性)","price inelasticity (価格の非弾性)","inelasticity of demand (需要の非弾性)","inelasticity of supply (供給の非弾性)"],"synonyms":["rigidity","inflexibility","stiffness","unyieldingness","lack of resilience"],"antonyms":["elasticity","flexibility","resilience","pliability"]}],"etymology":{"value":"'In-' (否定) + 'elasticity' (弾性)","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪnɪlæˈstɪsəti/","syllables":"in-e-las-tic-i-ty"},"inflection":{"noun_plural":"inelasticities"},"usage_notes":{"explanation":"'Inelasticity' is the opposite of 'elasticity'. It refers to the degree to which a supply or demand curve reacts to a change in price. If a curve is inelastic, the quantity demanded or supplied is relatively unresponsive to price changes. In economics, it is often used to describe goods or services that consumers will continue to purchase regardless of price fluctuations, such as essential medicines or gasoline. In materials science, it describes a material's inability to deform elastically under stress.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The inelasticity person.","correct":"An inelastic person.","note":"'Inelasticity' is a noun, not an adjective, so it cannot directly describe a person. You would need to use a different construction, such as 'a person with inelastic views' or 'an inflexible person'."},{"incorrect":"The product has high inelasticity.","correct":"The product has low elasticity. / The product has high price inelasticity.","note":"High inelasticity means that demand or supply is not very responsive to price changes. It's more accurate to say 'low elasticity' or 'high price inelasticity' to specify the type of inelasticity."}],"priority":"★★☆"},"related_words":{"derivatives":["inelastic (adjective)","inelastically (adverb)"],"related_concepts":["elasticity","demand curve","supply curve","price elasticity of demand","price elasticity of supply"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Inelasticity' is a term primarily used in economics and materials science. In economics, it describes how much the quantity demanded or supplied of a good or service changes when its price changes. If demand is inelastic, it means that even if the price goes up or down, people will still buy roughly the same amount. For example, if the price of gasoline increases, people may still need to buy it to get to work. In materials science, it refers to a material's lack of ability to return to its original shape after being deformed. This term is relatively uncommon in everyday conversation and is more frequently encountered in academic or technical contexts."},"example_sentences":[{"sentence":"The **inelasticity** of the labor supply made it difficult to find workers even with increased wages.","translation":"労働供給の非弾力性により、賃金を引き上げても労働者を見つけるのが困難でした。","type":"general","meaning_category":"general"},{"sentence":"Due to the **inelasticity** of demand, the company was able to raise prices without significantly impacting sales volume.","translation":"需要の非弾力性のおかげで、その会社は販売量に大きな影響を与えることなく価格を引き上げることができました。","type":"economics","meaning_category":"economics"},{"sentence":"The **inelasticity** of the polymer at low temperatures caused it to fracture easily.","translation":"低温でのポリマーの非弾性により、それは容易に破壊されました。","type":"materials science","meaning_category":"materials science"}]}