{"word":"archorrhagia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"直腸からの出血","english_definition":"Hemorrhage from the rectum.","examples":[{"sentence":"The patient presented with archorrhagia and abdominal pain.","translation":"患者は直腸出血と腹痛を訴えて来院した。"}],"synonyms":["rectal bleeding","proctorrhagia"],"antonyms":[]}],"etymology":{"value":"The term \"archorrhagia\" comes from the Greek words \"archos\" (meaning rectum or anus) and \"rhagia\" (meaning to burst forth or excessive flow, especially of blood).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɑːrkəˈreɪdʒ(i)ə/","syllables":"ar-cho-rra-gia"},"inflection":{"noun_plural":"archorrhagias"},"usage_notes":{"explanation":"Archorrhagia specifically refers to bleeding originating from the rectum, the final section of the large intestine. It is a symptom that can be caused by various conditions, including hemorrhoids, anal fissures, inflammatory bowel disease (IBD), or colorectal cancer. The color and amount of blood can provide clues about the source and severity of the bleeding.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient had archorrhagia from the nose.","correct":"✓ The patient had epistaxis.","note":"Archorrhagia specifically refers to rectal bleeding. Nosebleeds are referred to as epistaxis."}],"priority":"★★☆"},"related_words":{"derivatives":["archo- (prefix relating to the rectum or anus)","-rrhagia (suffix indicating excessive flow, especially of blood)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency. This is a specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Archorrhagia\" is a technical medical term referring to bleeding from the rectum. It is not commonly used in everyday language and is primarily encountered in medical contexts. Understanding this term is important for healthcare professionals and those studying medical terminology. The term is constructed from Greek roots, reflecting its scientific origin."},"example_sentences":[{"sentence":"The doctor noted archorrhagia in the patient's medical history.","translation":"医師は患者の病歴に直腸出血の記録があることを書き留めた。","type":"noun","meaning_category":"medical symptom"},{"sentence":"Persistent archorrhagia requires further investigation to determine the underlying cause.","translation":"持続的な直腸出血は、根本的な原因を特定するためにさらなる調査が必要です。","type":"noun","meaning_category":"medical symptom"}]}