{"word":"Jaspoid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A rock composed primarily of jasper, but with a less pure composition or exhibiting different characteristics.","english_definition":"A rock that is similar to jasper but does not meet all the criteria to be classified as true jasper. It may have impurities or different color patterns.","examples":[{"sentence":"The geology student identified the rock as a jaspoid due to its jasper-like appearance but inconsistent hardness.","translation":"地質学の学生は、その岩石がジャスパーに似た外観を持つものの、硬度が一定でないため、ジャスポイドであると特定した。"},{"sentence":"Many jaspoids are found in areas with significant jasper deposits, often as a transitional form.","translation":"多くのジャスポイドは、ジャスパーの堆積が著しい地域で、しばしば中間的な形態として見られる。"}],"collocations":["jasper-like appearance","transitional form","significant jasper deposits","identify as a jaspoid"],"synonyms":["jasperoid","impure jasper","jasper variant"],"antonyms":[]}],"etymology":{"value":"Derived from 'jasper,' with the suffix '-oid' indicating resemblance or similarity.","priority":"★★☆"},"pronunciation":{"ipa":"ˈdʒæspɔɪd","syllables":"jas-poid"},"inflection":{"noun_plural":"jaspoids"},"usage_notes":{"explanation":"'Jaspoid' is used to describe rocks that have the general characteristics of jasper but lack the purity or consistency to be classified as true jasper. It is often used in geological contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The gem was pure jasper, a true jaspoid.","correct":"✓ The gem was pure jasper.","note":"True jasper cannot be a jaspoid, as jaspoids are by definition not pure jasper."}],"priority":"★★☆"},"related_words":{"derivatives":["jasper","jasperoid"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word 'jaspoid' is a technical term used in geology to describe a rock that resembles jasper but is not pure jasper. It is typically used in scientific or academic contexts related to mineralogy and geology."},"example_sentences":[{"sentence":"The mineral collector displayed a variety of jaspers and jaspoids in his collection.","translation":"鉱物収集家は、彼のコレクションの中に様々なジャスパーとジャスポイドを展示した。","type":"noun","meaning_category":"geology"},{"sentence":"The jaspoid rock showed interesting patterns of red and brown.","translation":"そのジャスポイドの岩石は、赤と茶色の興味深い模様を示していた。","type":"noun","meaning_category":"geology"}]}