{"word":"monoscopy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"単眼視、単眼観察","english_definition":"The viewing of an image with only one eye.","examples":[{"sentence":"Monoscopy is often used in situations where stereoscopic vision is not required or is impractical.","translation":"単眼視は、立体視が必要ない、または非現実的な状況でよく使用されます。"},{"sentence":"The experiment involved monoscopy to isolate the visual input to one eye.","translation":"その実験では、片方の目への視覚入力を分離するために単眼視が用いられました。"}],"collocations":["monoscopic vision","monoscopic display","monoscopic image","monoscopic rendering"],"synonyms":["single-eye viewing","uniocular vision"],"antonyms":["stereoscopy","stereoscopic vision"]},{"part_of_speech":"noun","definition":"単眼視による画像、単眼画像","english_definition":"An image or display intended to be viewed with only one eye.","examples":[{"sentence":"The game was rendered in monoscopy for compatibility with older devices.","translation":"そのゲームは、古いデバイスとの互換性のために単眼画像でレンダリングされました。"},{"sentence":"The monoscopy provided a clear view of the object, but lacked depth perception.","translation":"その単眼画像は、対象物を鮮明に表示しましたが、奥行き知覚が欠けていました。"}],"collocations":["monoscopic content","monoscopic video","monoscopic rendering"],"synonyms":["2D image","non-stereoscopic image"],"antonyms":["stereoscopic image","3D image"]}],"etymology":{"value":"Derived from the Greek words 'monos' (single, alone) and 'skopeō' (to view, examine).","priority":"★★☆"},"pronunciation":{"ipa":"/məˈnɒskəpi/","syllables":"mo-nos-co-py"},"inflection":{"noun_plural":"monoscopies"},"usage_notes":{"explanation":"Monoscopy refers to the process or technique of viewing an image or scene with only one eye. It is the opposite of stereoscopy, which uses two images to create a sense of depth. Monoscopy is common in many everyday viewing situations, such as looking at a computer screen or reading a book. It is also used in some types of medical examinations and scientific experiments.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Monoscopy is the same as stereoscopy.","correct":"✓ Monoscopy is the opposite of stereoscopy.","note":"Monoscopy involves viewing with one eye, while stereoscopy involves viewing with two eyes to create a 3D effect."},{"incorrect":"✗ Monoscopy can only be used for medical purposes.","correct":"✓ Monoscopy is used in many everyday situations, such as viewing a computer screen.","note":"Monoscopy is common in many non-medical contexts."}],"priority":"★★☆"},"related_words":{"derivatives":["monoscopic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Monoscopy' is a technical term that refers to viewing an image with only one eye, as opposed to stereoscopy, which uses two eyes to create a 3D effect. It's often used in contexts where 3D viewing is not necessary or possible, such as on standard computer screens or in certain scientific experiments. The term is derived from Greek roots, 'monos' meaning 'single' and 'skopeō' meaning 'to view'. Understanding this term is helpful in fields like visual science, computer graphics, and medical imaging.","priority":"★★☆"},"example_sentences":[{"sentence":"The VR application offered both stereoscopy and monoscopy modes.","translation":"そのVRアプリケーションは、立体視モードと単眼視モードの両方を提供しました。","type":"noun","meaning_category":"単眼視"},{"sentence":"The surgeon used monoscopy during the procedure to get a clear view of the area.","translation":"外科医は、その処置中に患部を鮮明に観察するために単眼視を使用しました。","type":"noun","meaning_category":"単眼視"},{"sentence":"The game was designed for monoscopy, so it can be played on any standard monitor.","translation":"そのゲームは単眼視用に設計されているため、標準的なモニターでプレイできます。","type":"noun","meaning_category":"単眼画像"}]}