{"word":"mehitzah","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(ユダヤ教) 会堂やシナゴーグにおいて、男性と女性の座席を区切る仕切り、特に正統派ユダヤ教において義務付けられているもの","english_definition":"(Judaism) A partition, especially one required in Orthodox Judaism, separating men and women in a synagogue or other place of worship.","examples":[{"sentence":"The mehitzah was tall enough to prevent the women from being seen by the men during prayer.","translation":"メヒツァは、祈りの間、女性が男性から見えないように十分に高いものでした。"},{"sentence":"The height and material of the mehitzah are often subjects of debate within Orthodox communities.","translation":"メヒツァの高さと材質は、正統派コミュニティ内でしばしば議論の対象となります。"}],"collocations":["build a mehitzah","install a mehitzah","the height of the mehitzah","a temporary mehitzah"],"synonyms":["partition","divider","screen","barrier"],"antonyms":[]}],"etymology":{"value":"ヘブライ語 מְחִצָּה (məḥiṣṣā) から派生し、「仕切り」または「分離」を意味する。動詞 חָצַץ (ḥāṣaṣ)「分離する、仕切る」に関連する。","priority":"★★☆"},"pronunciation":{"ipa":"/məˈhɪtsə/","syllables":"me-hit-zah"},"inflection":{"noun_plural":"mehitzahs or mechitzot (ヘブライ語複数形)"},"usage_notes":{"explanation":"「**mehitzah**」は、ユダヤ教のシナゴーグ（会堂）やその他の礼拝場所で使用される、男性と女性の座席を区切るための物理的な仕切りを指す専門用語です。特に正統派ユダヤ教において、男女が分離して礼拝することがハラハー（ユダヤ法の総称）によって義務付けられているため、メヒツァは重要な役割を果たします。メヒツァの高さ、材質、配置は、コミュニティや解釈によって異なり、議論の対象となることもあります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The mechitzah was made of glass so people could see each other.","correct":"✓ The mechitzah was made of opaque material to ensure separation.","note":"メヒツァは通常、男女を分離するために不透明な素材で作られます。透明な素材では分離の目的を果たせません。"},{"incorrect":"✗ All synagogues have a mehitzah.","correct":"✓ Orthodox synagogues typically have a mehitzah.","note":"メヒツァは主に正統派ユダヤ教のシナゴーグで見られます。改革派や保守派のシナゴーグでは、メヒツァがない場合や、異なる形式の分離を採用している場合があります。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["halakha (ユダヤ法)","synagogue (シナゴーグ、会堂)","Orthodox Judaism (正統派ユダヤ教)","gender separation (男女分離)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - ユダヤ教関連の文脈でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**mehitzah**」は、正統派ユダヤ教のシナゴーグにおける男女分離のための仕切りを指す専門用語です。この単語は、ユダヤ教の慣習や文化に特有であり、一般的な英語の語彙には含まれません。メヒツァの存在意義や具体的な形態は、ハラハー（ユダヤ法）の解釈やコミュニティの慣習によって異なります。したがって、この単語を理解するには、ユダヤ教の背景知識が必要です。"},"example_sentences":[{"sentence":"The community debated whether the new mehitzah should be made of wood or fabric.","translation":"コミュニティは、新しいメヒツァを木製にするか布製にするかについて議論した。","type":"noun","meaning_category":"仕切り"},{"sentence":"The rabbi explained the importance of the mehitzah in maintaining modesty and focus during prayer.","translation":"ラビは、祈りの間、慎み深さと集中力を維持するためにメヒツァが重要であることを説明した。","type":"noun","meaning_category":"仕切り"},{"sentence":"Some members felt that the current mehitzah was too low and did not provide adequate separation.","translation":"一部のメンバーは、現在のメヒツァが低すぎて十分な分離を提供していないと感じた。","type":"noun","meaning_category":"仕切り"}]}