{"word":"English-supportive","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Providing support or assistance for learning or using the English language; designed to aid those who speak English or are learning to speak English.","english_definition":"Designed to aid or assist those who speak English or are learning to speak English; providing support for the English language.","examples":[{"sentence":"The website offers many English-supportive resources for international students.","translation":"そのウェブサイトは、留学生のために多くの英語学習支援リソースを提供しています。"},{"sentence":"The software includes an English-supportive interface to help users navigate the program easily.","translation":"そのソフトウェアには、ユーザーがプログラムを簡単に操作できるように、英語をサポートするインターフェースが含まれています。"},{"sentence":"The school provides an English-supportive environment for students whose first language is not English.","translation":"その学校は、第一言語が英語ではない学生のために、英語学習を支援する環境を提供しています。"}],"collocations":["English-supportive resources","English-supportive environment","English-supportive materials","English-supportive tools","English-supportive features","English-supportive curriculum"],"synonyms":["English-friendly","English-assisting","English-aiding","English-oriented","ESL-supportive"],"antonyms":[]}],"etymology":{"value":"Combination of 'English' (referring to the English language) and 'supportive' (providing support or assistance).","priority":"N/A"},"pronunciation":{"ipa":"ɪŋɡlɪʃ-səˈpɔːrtɪv","syllables":"Eng-lish-sup-port-ive"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"The term 'English-supportive' is often used to describe resources, environments, or systems that are designed to help people who speak English or are learning to speak English. It emphasizes the provision of assistance and tools to facilitate English language use and acquisition.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ English support","correct":"✓ English-supportive","note":"While 'English support' can be used, 'English-supportive' is a more specific adjective describing something that provides support."}],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["ESL (English as a Second Language)","EFL (English as a Foreign Language)","language support","language assistance"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"B2","text":"The term 'English-supportive' is a compound adjective used to describe something that aids or assists individuals in using or learning the English language. It's commonly found in educational or technological contexts, referring to resources, environments, or features designed to facilitate English language acquisition or usage. Understanding this term helps in recognizing materials or settings that are specifically tailored to support English speakers or learners."},"example_sentences":[{"sentence":"The library offers a range of English-supportive books and multimedia.","translation":"図書館では、さまざまな英語学習支援書籍やマルチメディアを提供しています。","type":"adjective","meaning_category":"Providing support for English language learning"},{"sentence":"The company's customer service is English-supportive, with agents fluent in English.","translation":"その会社のカスタマーサービスは英語をサポートしており、エージェントは英語に堪能です。","type":"adjective","meaning_category":"Providing support for English speakers"}]}