{"word":"non-criminal","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"非犯罪的な、犯罪的でない","english_definition":"not involving or relating to crime; not breaking the law.","examples":[{"sentence":"The organization promotes non-criminal solutions to community problems.","translation":"その組織は、地域の問題に対する非犯罪的な解決策を推進しています。"},{"sentence":"His actions, while unethical, were non-criminal.","translation":"彼の行動は、倫理的ではないものの、犯罪的ではありませんでした。"},{"sentence":"We need to distinguish between criminal and non-criminal behavior.","translation":"私たちは、犯罪的な行動と非犯罪的な行動を区別する必要があります。"}],"collocations":["non-criminal activity","non-criminal behavior","non-criminal offense","non-criminal record","non-criminal conduct"],"synonyms":["lawful","legal","legitimate","licit","non-illegal"],"antonyms":["criminal","illegal","unlawful","illicit"]},{"part_of_speech":"noun","definition":"非犯罪者","english_definition":"a person who has not committed a crime.","examples":[{"sentence":"The police are focused on catching criminals, not harassing non-criminals.","translation":"警察は犯罪者を捕まえることに焦点を当てており、非犯罪者を嫌がらせすることはありません。"},{"sentence":"The rights of non-criminals must also be protected.","translation":"非犯罪者の権利も保護されなければなりません。"},{"sentence":"It is important to treat everyone as a non-criminal until proven guilty.","translation":"有罪が証明されるまでは、すべての人を非犯罪者として扱うことが重要です。"}],"collocations":["treat as a non-criminal","rights of non-criminals","protect non-criminals"],"synonyms":["law-abiding citizen","innocent person"],"antonyms":["criminal","offender","lawbreaker"]}],"etymology":{"value":"'Non-' (not) + 'criminal' (relating to crime). Formed by adding the prefix 'non-' to the word 'criminal'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈkrɪmɪnl/","syllables":"non-crim-i-nal"},"inflection":{"noun_plural":"non-criminals"},"usage_notes":{"explanation":"'Non-criminal' is a straightforward term used to describe anything or anyone not associated with crime. It's often used in legal and social contexts to differentiate between actions or individuals that are within the boundaries of the law and those that are not. It is important to note that 'non-criminal' does not necessarily imply 'good' or 'ethical'; it simply means that the action or person has not broken the law.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a non criminal person.","correct":"✓ He was a non-criminal.","note":"'Non-criminal' is already an adjective, so adding 'person' is redundant. However, it's more natural to say 'He was not a criminal.'"},{"incorrect":"✗ The non criminal activity was very suspicious.","correct":"✓ The non-criminal activity was very suspicious.","note":"While grammatically correct, it's important to consider if there's a better way to phrase the sentence to avoid confusion. For example, 'The activity, though legal, was very suspicious.'"}],"priority":"★★☆"},"related_words":{"derivatives":["non-crime (noun: an act that is not a crime)","decriminalize (verb: to remove or reduce the criminal status of)"],"phrases":["non-criminal justice system"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but used in legal and social contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word 'non-criminal' is used to describe something that is not related to crime or breaking the law. It's often used in formal settings like legal discussions or news reports. It's a straightforward word, but it's important to understand the context in which it's used, as it doesn't necessarily mean 'good' or 'ethical,' just that something isn't against the law. You might see it used to describe activities or behaviors that are legal but might be considered morally questionable."},"example_sentences":[{"sentence":"The police are more interested in pursuing criminal cases than non-criminal ones.","translation":"警察は非犯罪的な事件よりも犯罪事件を追及することに興味を持っています。","type":"adjective","meaning_category":"非犯罪的"},{"sentence":"As a non-criminal, he had no prior experience with the justice system.","translation":"非犯罪者として、彼は司法制度の経験がありませんでした。","type":"noun","meaning_category":"非犯罪者"},{"sentence":"The report focused on the causes of both criminal and non-criminal behavior in teenagers.","translation":"その報告書は、十代の若者の犯罪的行動と非犯罪的行動の両方の原因に焦点を当てていました。","type":"adjective","meaning_category":"非犯罪的"},{"sentence":"The organization provides support for both victims of crime and non-criminals in the community.","translation":"その組織は、犯罪被害者と地域社会の非犯罪者の両方に支援を提供しています。","type":"noun","meaning_category":"非犯罪者"}]}