{"word":"browser-sensitive","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"ブラウザ依存の、ブラウザによって動作が異なる","english_definition":"(of software, especially web applications) behaving differently or displaying differently depending on the web browser being used.","examples":[{"sentence":"This website is browser-sensitive; it looks different in Chrome than it does in Firefox.","translation":"このウェブサイトはブラウザ依存です。Chromeで表示されるのとFirefoxで表示されるのが異なります。"},{"sentence":"The JavaScript code is browser-sensitive, requiring different implementations for Internet Explorer and other browsers.","translation":"このJavaScriptコードはブラウザ依存であり、Internet Explorerと他のブラウザで異なる実装が必要です。"}],"collocations":["browser-sensitive code","browser-sensitive design","browser-sensitive website","browser-sensitive application"],"synonyms":["browser-dependent","browser-specific"],"antonyms":["browser-independent","cross-browser compatible"],"notes":"This term is often used to describe a negative quality of web development, as developers generally aim for cross-browser compatibility."}],"etymology":{"value":"The term is formed by combining \"browser\" (referring to a web browser) and \"sensitive\" (meaning easily affected or influenced).","priority":"N/A"},"pronunciation":{"ipa":"/ˈbraʊzər ˈsɛnsətɪv/","syllables":"brow-ser-sen-si-tive"},"inflection":{"notes":"Adjectives do not inflect in English."},"usage_notes":{"explanation":"The term 'browser-sensitive' describes software, particularly web applications or websites, that do not render or function consistently across different web browsers. This is often due to variations in how browsers interpret web standards (like HTML, CSS, and JavaScript) or due to the use of browser-specific features or hacks. Modern web development practices aim to minimize browser sensitivity through the use of standardized code and thorough testing across multiple browsers.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The website is very sensitive.","correct":"✓ The website is browser-sensitive.","note":"'Sensitive' alone is too general. 'Browser-sensitive' specifies the dependency on web browsers."},{"incorrect":"✗ The code is browser-sensitively.","correct":"✓ The code is browser-sensitive.","note":"'Browser-sensitive' is an adjective, so it modifies a noun directly. 'Browser-sensitively' is not a standard term."}],"priority":"★★☆"},"related_words":{"derivatives":["browser (noun): A web browser application.","sensitive (adjective): Easily affected or influenced."],"related_terms":["cross-browser compatibility (noun): The ability of a website or application to function correctly across different web browsers.","browser compatibility (noun): The degree to which a website or application functions correctly across different web browsers.","web standards (noun): The set of formal specifications and technologies that define the World Wide Web."],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency, technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Browser-sensitive' is a technical term used in web development to describe situations where a website or web application behaves or looks different depending on the web browser being used. This often happens because different browsers interpret web standards in slightly different ways, or because developers have used browser-specific code. The goal of modern web development is to create websites that are 'cross-browser compatible,' meaning they work well on all major browsers, thereby avoiding browser sensitivity."},"example_sentences":[{"sentence":"The developers had to rewrite sections of the code to make the application less browser-sensitive.","translation":"開発者は、アプリケーションのブラウザ依存性を減らすためにコードの一部を書き直す必要がありました。","type":"adjective","meaning_category":"ブラウザ依存の"},{"sentence":"Browser-sensitive issues can be difficult to debug because they only appear in certain browsers.","translation":"ブラウザ依存の問題は、特定のブラウザでのみ発生するため、デバッグが難しい場合があります。","type":"adjective","meaning_category":"ブラウザ依存の"}]}