{"word":"Fraternalist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"友愛主義者、博愛主義者、兄弟愛を重んじる人","english_definition":"An advocate or supporter of fraternalism; someone who promotes brotherhood, mutual support, and social connection.","examples":[{"sentence":"He was a dedicated fraternalist, always working to strengthen the bonds within his community.","translation":"彼は献身的な友愛主義者で、常に地域社会内の絆を強化するために働いていました。"},{"sentence":"The fraternalist organization aimed to provide support and resources to its members.","translation":"その友愛主義団体は、メンバーにサポートとリソースを提供することを目指していました。"}],"collocations":["fraternalist organization","dedicated fraternalist","active fraternalist"],"synonyms":["humanitarian","philanthropist","altruist","brotherhood advocate"],"antonyms":["individualist","isolationist"]},{"part_of_speech":"adjective","definition":"友愛主義の、博愛主義の、兄弟愛に基づく","english_definition":"Relating to or characteristic of fraternalism; promoting brotherhood, mutual support, and social connection.","examples":[{"sentence":"The fraternalist principles of the organization guided its actions.","translation":"その団体の友愛主義的な原則が、その行動を導いた。"},{"sentence":"They adopted a fraternalist approach to solving the community's problems.","translation":"彼らは地域社会の問題を解決するために、友愛主義的なアプローチを採用した。"}],"collocations":["fraternalist principles","fraternalist approach","fraternalist ideals"],"synonyms":["brotherly","amicable","benevolent","cooperative"],"antonyms":["individualistic","competitive","antagonistic"]}],"etymology":{"value":"The word \"fraternalist\" is derived from \"fraternalism,\" which comes from the Latin word \"frater,\" meaning \"brother.\" The suffix \"-ist\" indicates a person who adheres to or advocates a particular belief or ideology.","priority":"★★☆"},"pronunciation":{"ipa":"/frəˈtɜːrnəlɪst/","syllables":"fra-ter-nal-ist"},"inflection":{"noun_plural":"fraternalists"},"usage_notes":{"explanation":"The term \"fraternalist\" is often used to describe individuals or organizations that emphasize brotherhood, mutual aid, and social connection. It can refer to members of fraternal societies, as well as those who advocate for policies and practices that promote social solidarity and cooperation. The word can be used both as a noun and an adjective.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a fraternalist person.","correct":"✓ He is a fraternalist.","note":"When used as a noun, \"fraternalist\" refers to a person, so \"person\" is redundant."},{"incorrect":"✗ The organization promotes fraternalism ideals.","correct":"✓ The organization promotes fraternalist ideals.","note":"When used as an adjective, \"fraternalist\" should be used to modify the noun \"ideals.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["fraternalism","fraternal","fraternally","fraternity"],"phrasal_verbs":[],"related_concepts":["brotherhood","sisterhood","community","solidarity","mutual aid","social connection"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"fraternalist\" refers to someone who supports or believes in fraternalism, which is the principle of brotherhood and mutual support. It is a relatively uncommon word, often used in academic or philosophical contexts to describe individuals or groups who promote social solidarity and cooperation. Understanding the root word \"fraternal\" (related to brothers) can help in grasping the meaning of \"fraternalist.\""},"example_sentences":[{"sentence":"As a committed **fraternalist**, he volunteered his time to support local charities.","translation":"献身的な友愛主義者として、彼は地元の慈善団体を支援するために時間を割いてボランティア活動を行った。","type":"noun","meaning_category":"友愛主義者"},{"sentence":"The organization's **fraternalist** approach to community development fostered strong relationships among residents.","translation":"その団体の地域開発に対する友愛主義的なアプローチは、住民間の強固な関係を育んだ。","type":"adjective","meaning_category":"友愛主義の"}]}