{"word":"diet-culture","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"ダイエット文化：痩せていることを理想とし、体重、体型、食事制限に過剰な価値を置く社会的な信念や行動様式","english_definition":"A system of beliefs that equates thinness to health and moral virtue; promotes weight loss as a means of attaining higher status; and demonizes certain foods or eating patterns.","examples":[{"sentence":"Diet culture is pervasive in our society, influencing everything from advertising to personal relationships.","translation":"ダイエット文化は私たちの社会に蔓延しており、広告から人間関係まであらゆるものに影響を与えています。"},{"sentence":"Many people are actively working to dismantle diet culture and promote body positivity.","translation":"多くの人々が積極的にダイエット文化を解体し、ボディポジティブを推進しようと努めています。"},{"sentence":"Diet culture can lead to disordered eating and negative body image.","translation":"ダイエット文化は、摂食障害やネガティブなボディイメージにつながる可能性があります。"}],"collocations":["toxic diet culture (有害なダイエット文化)","dismantle diet culture (ダイエット文化を解体する)","challenge diet culture (ダイエット文化に異議を唱える)","escape diet culture (ダイエット文化から抜け出す)","promote body positivity against diet culture (ダイエット文化に対抗してボディポジティブを推進する)"],"synonyms":["weight stigma","thin ideal","body shaming","fatphobia"],"antonyms":["body positivity","body neutrality","health at every size (HAES)"]},{"part_of_speech":"noun","definition":"(より広義に) 特定の食事療法やライフスタイルを過度に重視する傾向","english_definition":"More broadly, the tendency to place excessive emphasis on specific diets or lifestyles as the key to health and happiness.","examples":[{"sentence":"The constant promotion of restrictive diets is a hallmark of diet culture.","translation":"制限的な食事療法を絶えず宣伝することは、ダイエット文化の特徴です。"},{"sentence":"Even seemingly 'healthy' eating habits can be part of diet culture if they are driven by fear of weight gain.","translation":"一見「健康的な」食習慣でさえ、体重増加への恐怖によって動機づけられている場合、ダイエット文化の一部となり得ます。"}],"collocations":["restrictive diets (制限的な食事療法)","fad diets (一時的な流行のダイエット)","clean eating (クリーンイーティング)","wellness culture (ウェルネス文化)"],"synonyms":["orthorexia","restrictive eating","obsessive dieting"],"antonyms":["intuitive eating","mindful eating"]}],"etymology":{"value":"'Diet'（食事療法）と 'culture'（文化）の組み合わせ。痩身を追求する現代社会の傾向を批判的に表現するために比較的新しく作られた言葉。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdaɪət ˌkʌltʃər/","syllables":"di-et-cul-ture"},"inflection":{"notes":"可算名詞としても、不可算名詞としても扱われる。複数形は 'diet-cultures'。"},"usage_notes":{"explanation":"'Diet culture' は、単に「ダイエット」を指すのではなく、痩せていることを過度に重視する社会的な価値観や信念体系全体を指します。体重や体型を自己価値の基準とする傾向、特定の食品を悪者扱いする風潮、食事制限を美徳とする考え方などが含まれます。ボディポジティブ運動やHAES（Health at Every Size）の概念と対立することが多いです。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm just on a diet, it's not diet culture.","correct":"✓ Being on a diet can be part of diet culture if it's driven by unrealistic expectations or negative self-image.","note":"ダイエット自体は必ずしも悪いものではありませんが、過度な痩身願望や自己否定的な感情が伴う場合は、ダイエット文化の一部となり得ます。"},{"incorrect":"✗ Diet culture is just about being healthy.","correct":"✓ Diet culture is about equating thinness with health and moral virtue, which is not always accurate or healthy.","note":"ダイエット文化は、健康よりも痩せていることを重視する傾向があります。必ずしも健康的な行動を促進するとは限りません。"}],"priority":"★★☆"},"related_words":{"derivatives":["diet (名詞, 動詞)","culture (名詞)","body image (ボディイメージ)","body positivity (ボディポジティブ)","fatphobia (肥満嫌悪)","weight stigma (体重差別)"],"idioms_phrases":["N/A"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"比較的新しい用語のため、頻度は高くないが、社会的な議論の中で増加傾向にある。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Diet culture'は、痩身を理想とする社会的な価値観や信念体系を指す、比較的新しい用語です。この言葉は、体重や体型を自己価値の基準とする傾向、特定の食品を悪者扱いする風潮、食事制限を美徳とする考え方などを批判的に表現するために用いられます。ボディポジティブ運動やHAES（Health at Every Size）の概念と対立することが多いです。この用語を理解するには、社会的な文脈や関連する概念（ボディイメージ、体重差別など）についての知識が必要です。"},"example_sentences":[{"sentence":"Social media often perpetuates harmful messages about diet culture.","translation":"ソーシャルメディアは、しばしばダイエット文化に関する有害なメッセージを永続させています。","type":"noun","meaning_category":"痩身を理想とする社会的な信念や行動様式"},{"sentence":"Many activists are working to create a world free from the pressures of diet culture.","translation":"多くの活動家が、ダイエット文化のプレッシャーから解放された世界を創造するために活動しています。","type":"noun","meaning_category":"痩身を理想とする社会的な信念や行動様式"},{"sentence":"It's important to be mindful of the ways in which diet culture can affect our mental health.","translation":"ダイエット文化が私たちの精神的な健康にどのような影響を与える可能性があるかに注意することが重要です。","type":"noun","meaning_category":"痩身を理想とする社会的な信念や行動様式"}]}