{"word":"dynamic weight","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"動的重量 (dōteki jūryō): A weight or load that changes over time, either in magnitude or position, often due to movement or external forces. It contrasts with static weight, which remains constant.","english_definition":"A weight or load that changes over time, either in magnitude or position, often due to movement or external forces. It contrasts with static weight, which remains constant.","examples":[{"sentence":"The bridge's structural analysis must account for the dynamic weight of vehicles crossing it.","translation":"橋の構造解析では、橋を渡る車両の動的重量を考慮する必要があります。"},{"sentence":"Understanding the dynamic weight distribution is crucial for designing stable robots.","translation":"安定したロボットを設計するには、動的重量配分の理解が不可欠です。"},{"sentence":"The crane's control system adjusts to the dynamic weight of the suspended load to prevent swaying.","translation":"クレーンの制御システムは、揺れを防ぐために、吊り下げられた荷物の動的重量に合わせて調整します。"}],"collocations":["dynamic weight distribution","dynamic weight analysis","dynamic weight compensation","dynamic weight measurement","dynamic weight loading"],"synonyms":["variable load","changing weight","fluctuating weight"],"antonyms":["static weight","constant load","fixed weight"]}],"etymology":{"value":"The term 'dynamic weight' is a combination of 'dynamic,' referring to change or movement, and 'weight,' referring to the force of gravity on an object. It describes a weight that is not static but rather changes due to various factors.","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˈnæmɪk weɪt/","syllables":"dy-nam-ic weight"},"inflection":{"noun_plural":"dynamic weights"},"usage_notes":{"explanation":"Dynamic weight is a crucial concept in engineering, physics, and robotics. It is used to describe loads that vary over time, which can significantly impact the stability and performance of systems. Unlike static weight, which is constant, dynamic weight requires careful consideration of factors such as acceleration, vibration, and external forces.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The dynamic weight is the same as the static weight.","correct":"✓ The dynamic weight changes over time, unlike the static weight.","note":"Dynamic weight is not the same as static weight; it varies while static weight remains constant."},{"incorrect":"✗ We only need to consider static weight in this analysis.","correct":"✓ We need to consider both static and dynamic weight in this analysis.","note":"In many real-world scenarios, both static and dynamic weights must be considered for accurate analysis."}],"priority":"★★☆"},"related_words":{"derivatives":["dynamic (adjective)","weight (noun)","weighting (noun)"],"related_terms":["static weight","load","force","acceleration","vibration","stress","strain"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dynamic weight' is a technical term used in fields like engineering and physics. It refers to a weight or load that changes over time, often due to movement or external forces. Understanding this concept requires a solid grasp of physics and engineering principles. It is contrasted with 'static weight,' which remains constant. This term is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The engineers calculated the dynamic weight of the train as it crossed the bridge.","translation":"エンジニアは、列車が橋を渡る際の動的重量を計算しました。","type":"noun","meaning_category":"動的重量"},{"sentence":"The robot's control system compensates for the dynamic weight of its arm during movement.","translation":"ロボットの制御システムは、動作中のアームの動的重量を補正します。","type":"noun","meaning_category":"動的重量"},{"sentence":"Accurate measurement of dynamic weight is essential for ensuring the stability of the aircraft.","translation":"航空機の安定性を確保するためには、動的重量の正確な測定が不可欠です。","type":"noun","meaning_category":"動的重量"}]}