{"word":"non-trustee","priority":"low","meanings":[{"part_of_speech":"noun","definition":"(法律) 非受託者：信託財産を管理・運用する義務を負わない者。","english_definition":"(Law) A person who is not a trustee; someone who does not have the legal obligation to manage and administer trust assets.","examples":[{"sentence":"As a non-trustee, he has no authority over the trust fund.","translation":"非受託者として、彼は信託基金に対する権限を持っていません。"},{"sentence":"The beneficiaries are non-trustees and therefore do not manage the assets directly.","translation":"受益者は非受託者であるため、資産を直接管理しません。"}],"collocations":["act as a non-trustee","role of a non-trustee","distinguish between trustee and non-trustee"],"synonyms":["non-fiduciary","outsider","third party"],"antonyms":["trustee","fiduciary"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to the word 'trustee'.","priority":"low"},"pronunciation":{"ipa":"/ˌnɒn trʌˈstiː/","syllables":"non-trus-tee"},"inflection":{"noun_plural":"non-trustees"},"usage_notes":{"explanation":"The term 'non-trustee' is primarily used in legal and financial contexts to differentiate individuals or entities that do not have the responsibilities and obligations associated with managing trust assets. It's often used in contrast to 'trustee' to clarify roles and responsibilities within a trust arrangement.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"He is a non-trustee, so he can make all the decisions about the trust.","correct":"He is a non-trustee, so he cannot make decisions about the trust.","note":"Non-trustees do not have decision-making power over the trust."}],"priority":"low"},"related_words":{"derivatives":["trust","trustee","trusteeship","non-","fiduciary","beneficiary"],"phrases":["breach of trust","trust agreement","trust fund"]},"level_frequency":{"level":"C2","frequency_google_ngram":"low"},"readability_explanation":{"level":"C1","text":"The term 'non-trustee' is a legal term used to describe someone who is not responsible for managing a trust. Understanding this term requires knowledge of legal and financial concepts related to trusts. It is generally used in formal or technical contexts."},"example_sentences":[{"sentence":"The lawyer explained the difference between a trustee and a non-trustee to the client.","translation":"弁護士は、受託者と非受託者の違いをクライアントに説明しました。","type":"noun","meaning_category":"legal"},{"sentence":"As a non-trustee shareholder, he could not vote on the trust's investments.","translation":"非受託者の株主として、彼は信託の投資について投票できませんでした。","type":"noun","meaning_category":"financial"}]}