{"word":"internationalists","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"国際主義者、国際協調主義者","english_definition":"Advocates of cooperation and understanding between nations.","examples":[{"sentence":"The internationalists believed that global cooperation was essential for peace.","translation":"国際主義者たちは、世界的な協力が平和に不可欠だと信じていた。"},{"sentence":"The political party attracted many internationalists who supported free trade and open borders.","translation":"その政党は、自由貿易と国境開放を支持する多くの国際協調主義者を引きつけた。"}],"collocations":["global internationalists","political internationalists","economic internationalists"],"synonyms":["globalists","cosmopolitans","world citizens"],"antonyms":["nationalists","isolationists","protectionists"]}],"etymology":{"value":"The word 'internationalist' is derived from 'international' (existing or occurring between nations) combined with the suffix '-ist' (a person who advocates or practices a specified thing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪntərˈnæʃənəlɪsts/","syllables":"in-ter-na-tion-al-ists"},"inflection":{"noun_plural":"internationalists"},"usage_notes":{"explanation":"'Internationalists' refers to people who believe in and promote cooperation, understanding, and interconnectedness between nations. They often advocate for international organizations, treaties, and policies that foster global collaboration. The term is often used in contrast to 'nationalists' or 'isolationists,' who prioritize their own nation's interests over international cooperation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an internationalist, so he only cares about his country.","correct":"✓ He is an internationalist, so he cares about all countries.","note":"Internationalists care about all countries, not just their own."},{"incorrect":"✗ Internationalists believe in strong borders.","correct":"✓ Internationalists believe in open borders and cooperation.","note":"Internationalists typically advocate for open borders and cooperation, not strong borders."}],"priority":"★★☆"},"related_words":{"derivatives":["internationalism (noun: the principle of cooperation among nations, for the promotion of their common good)","international (adjective: existing or occurring between nations)","internationally (adverb: with respect to relations between nations)"],"phrases":["internationalist movement","internationalist policies","internationalist organizations"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent, but used in political and academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'internationalists' is used to describe people who support cooperation and understanding between different countries. They often believe that working together globally is important for solving problems like climate change, poverty, and war. This word is often used in discussions about politics and global issues, so it is helpful to understand its meaning if you are following these topics."},"example_sentences":[{"sentence":"The group of internationalists met to discuss ways to promote peace.","translation":"その国際主義者のグループは、平和を促進する方法について話し合うために会合を開いた。","type":"noun","meaning_category":"国際主義者"},{"sentence":"The professor was known for his internationalist views on trade.","translation":"その教授は、貿易に関する国際協調主義的な見解で知られていた。","type":"noun","meaning_category":"国際協調主義者"},{"sentence":"The internationalists argued that cooperation was key to solving global issues.","translation":"国際主義者たちは、協力が地球規模の問題を解決する鍵だと主張した。","type":"noun","meaning_category":"国際主義者"}]}