{"word":"demi-puppet","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of puppet where only the upper half of the body is represented.","english_definition":"A puppet that only represents the upper half of a character's body.","examples":[{"sentence":"The show featured several demi-puppets performing comedic skits.","translation":"そのショーでは、いくつかのデミパペットがコメディスキットを演じた。"},{"sentence":"Creating a demi-puppet requires careful attention to the character's facial expressions and gestures.","translation":"デミパペットの制作には、キャラクターの表情やジェスチャーに細心の注意を払う必要がある。"}],"collocations":["puppet show","puppet theater","marionette","hand puppet"],"synonyms":["half-puppet","torso puppet"],"antonyms":[]}],"etymology":{"value":"The term 'demi-' comes from the French word meaning 'half'. It is combined with 'puppet' to describe a puppet that is only half-bodied.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈdɛmi ˈpʌpɪt/","syllables":"de-mi-pup-pet"},"inflection":{"noun_plural":"demi-puppets"},"usage_notes":{"explanation":"The term 'demi-puppet' is relatively uncommon. It is used to specifically describe puppets that only portray the upper half of a character. These puppets are often used in performances where the puppeteer needs to focus on facial expressions and upper body movements.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a demi puppet show last night.","correct":"✓ I saw a demi-puppet show last night.","note":"The correct spelling is 'demi-puppet' with a hyphen."}],"priority":"★☆☆"},"related_words":{"derivatives":["demi (prefix meaning half)","puppet","puppetry"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'demi-puppet' is specialized and not commonly used. It refers to a puppet that only represents the upper half of a character's body. This term is most likely encountered in contexts related to puppetry, theater, or performance arts."},"example_sentences":[{"sentence":"The children were fascinated by the expressive faces of the demi-puppets.","translation":"子供たちはデミパペットの表情豊かな顔に魅了された。","type":"noun","meaning_category":"puppet type"},{"sentence":"The demi-puppet was designed to look like a famous historical figure.","translation":"そのデミパペットは、有名な歴史上の人物に似せてデザインされた。","type":"noun","meaning_category":"puppet type"}]}