{"word":"Lobbers","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) ロブを打つ人たち、ロブを多用する人たち","english_definition":"(plural) People who hit lobs, people who frequently use lobs in a game (tennis, etc.).","examples":[{"sentence":"The opposing team consisted of skilled lobbers, making it difficult to attack directly.","translation":"相手チームは熟練したロブを打つ人たちで構成されており、直接攻撃するのが困難だった。"},{"sentence":"The lobbers gained an advantage by forcing their opponents to the back of the court.","translation":"ロブを多用する人たちは、相手をコートの後ろに追い込むことで有利な立場を得た。"}],"collocations":["skilled lobbers (熟練したロブを打つ人たち)","tactical lobbers (戦術的なロブを打つ人たち)"],"synonyms":["lob players"],"antonyms":["attackers","rushers"]},{"part_of_speech":"noun","definition":"(複数形, スラング) 大きくて垂れ下がった胸","english_definition":"(plural, slang) Large, pendulous breasts.","examples":[{"sentence":"(Caution: Potentially offensive) She was known for her impressive lobbers.","translation":"（注意：不快感を与える可能性あり）彼女は印象的なロブ（スラング）で知られていた。"}],"collocations":[],"synonyms":["boobs","breasts","tits"],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'lob,' referring to the act of hitting a ball in a high arc. The suffix '-ers' indicates people who perform this action. The slang usage is a figurative extension, relating the shape of the breasts to the arc of a lobbed ball.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɒbərz/","syllables":"Lob-bers"},"inflection":{"noun_plural":"lobbers"},"usage_notes":{"explanation":"The term 'lobbers' primarily refers to players who frequently use lobs in sports like tennis or badminton. However, it's crucial to be aware of the slang usage, which is potentially offensive. Context is key to understanding the intended meaning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The lobbers was a good strategy.","correct":"✓ Lobbing was a good strategy.","note":"'Lobbers' refers to the people, not the action. Use 'lobbing' to describe the strategy. "},{"incorrect":"✗ He is a lobber, she is a lobber, they are lobber.","correct":"✓ He is a lobber, she is a lobber, they are lobbers.","note":"When referring to multiple people, use the plural form 'lobbers'."}],"priority":"★★☆"},"related_words":{"derivatives":["lob (verb, noun)","lobbing (gerund)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2 (sports context), C2 (slang context)","frequency_google_ngram":"Low frequency (sports context), Very low frequency (slang context)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'lobbers' has two distinct meanings. In a sports context, it refers to players who frequently use the 'lob' technique, hitting the ball high into the air. In slang, it's a vulgar term for large breasts. The sports meaning is less common than the base word 'lob,' and the slang meaning is highly informal and potentially offensive. Therefore, careful attention to context is essential to avoid misinterpretation.","priority":"★★☆"},"example_sentences":[{"sentence":"The tennis match was frustrating because their opponents were persistent **lobbers**.","translation":"そのテニスの試合は、対戦相手がしつこくロブを打ってくるのでイライラした。","type":"noun","meaning_category":"sports"},{"sentence":"(Caution: Potentially offensive) Some found her confident display of her **lobbers** empowering.","translation":"（注意：不快感を与える可能性あり）彼女が自信を持ってロブ（スラング）を披露する姿に、力を得ると感じる人もいた。","type":"noun","meaning_category":"slang"}]}