{"word":"self-neglecting","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"自己をないがしろにする、自己管理を怠る","english_definition":"Failing to care for oneself properly; neglecting one's own needs and well-being.","examples":[{"sentence":"The social worker was concerned about the self-neglecting elderly man who lived alone.","translation":"ソーシャルワーカーは、一人暮らしで自己管理を怠っている高齢男性を心配していた。"},{"sentence":"Her self-neglecting behavior was a sign of deeper emotional issues.","translation":"彼女の自己をないがしろにする行動は、より深い感情的な問題を抱えている兆候だった。"},{"sentence":"He became increasingly self-neglecting after losing his job.","translation":"彼は失業後、ますます自己管理を怠るようになった。"}],"collocations":["self-neglecting behavior","self-neglecting elderly","become self-neglecting","severely self-neglecting"],"synonyms":["negligent","careless","inattentive to oneself","self-harming (in extreme cases)"],"antonyms":["self-caring","self-sufficient","responsible","attentive to oneself"]}],"etymology":{"value":"Derived from the combination of 'self-' (referring to oneself) and 'neglecting' (failing to care for or attend to).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌself nɪˈɡlektɪŋ/","syllables":"self-ne-glect-ing"},"inflection":{"notes":"Adjective; no specific inflectional forms beyond comparative/superlative (more self-neglecting, most self-neglecting)."},"usage_notes":{"explanation":"'Self-neglecting' describes a state or behavior where an individual fails to adequately attend to their own personal needs, including hygiene, health, nutrition, and safety. It can be a symptom of various underlying issues such as depression, cognitive impairment, or social isolation. It is often used in social work, healthcare, and psychological contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a self-neglect person.","correct":"✓ He is a self-neglecting person.","note":"'Self-neglect' is a noun, while 'self-neglecting' is an adjective that describes the person or behavior. Use the adjective form to describe the person. Alternatively, you could say, 'He is a person who engages in self-neglect'."},{"incorrect":"✗ She is self-neglected.","correct":"✓ She is self-neglecting.","note":"'Self-neglected' implies that someone else is neglecting her. 'Self-neglecting' means she is neglecting herself."}],"priority":"★★☆"},"related_words":{"derivatives":["self-neglect (noun: 自己をないがしろにすること、自己管理の怠慢)"],"phrasal_verbs":[],"related_adjectives":["neglectful","careless"],"related_nouns":["negligence","carelessness"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'self-neglecting' is relatively specialized and is most often encountered in professional contexts, such as social work, healthcare, and psychology. It describes the condition of someone who does not adequately take care of their own basic needs. Understanding the term requires a good vocabulary and an understanding of the nuances of self-care and well-being. It's not a word typically used in everyday conversation."},"example_sentences":[{"sentence":"The case worker documented several instances of self-neglecting behavior in the client's home.","translation":"ケースワーカーは、クライアントの自宅で自己管理を怠る行動の事例をいくつか記録した。","type":"adjective","meaning_category":"自己管理を怠る"},{"sentence":"It's important to distinguish between self-neglecting and simply having different priorities.","translation":"自己管理を怠ることと、単に優先順位が異なることを区別することが重要です。","type":"adjective","meaning_category":"自己管理を怠る"},{"sentence":"The hospital staff were trained to identify and assist self-neglecting patients.","translation":"病院のスタッフは、自己管理を怠る患者を特定し、支援するように訓練された。","type":"adjective","meaning_category":"自己管理を怠る"}]}