{"word":"electropathology","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"電気生理病理学：電気的刺激に対する組織や細胞の病理学的変化の研究","english_definition":"The study of pathological changes in tissues and cells in response to electrical stimulation.","examples":[{"sentence":"Electropathology is crucial for understanding the effects of electrical therapies.","translation":"電気生理病理学は、電気療法の効果を理解する上で重要です。"},{"sentence":"The electropathology of cardiac tissue is a complex field.","translation":"心臓組織の電気生理病理学は複雑な分野です。"}],"collocations":["cardiac electropathology","neural electropathology"],"synonyms":["bioelectromagnetics","electrophysiology"],"antonyms":[]}],"etymology":{"value":"'electro-' (電気) + 'pathology' (病理学)","priority":"★★★"},"pronunciation":{"ipa":"/ɪˌlɛktroʊpæˈθɒlədʒi/","syllables":"e-lec-tro-pa-thol-o-gy"},"inflection":{"noun_plural":"electropathologies"},"usage_notes":{"explanation":"Electropathology is a specialized field within pathology that focuses on the impact of electrical currents and fields on biological tissues. It is often used in the context of medical treatments involving electrical stimulation, such as cardiac pacing or deep brain stimulation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I am studying electric pathology.","correct":"✓ I am studying electropathology.","note":"'Electropathology' specifically refers to the study of pathological changes due to electrical stimulation, while 'electric pathology' is a less common and less precise term."}],"priority":"★☆☆"},"related_words":{"derivatives":["electropathological (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Electropathology is a highly specialized term used in medical and scientific contexts. It requires a strong understanding of both electrical principles and pathology. The term is rarely encountered outside of these specific fields."},"example_sentences":[{"sentence":"Research in electropathology has led to advancements in neuromodulation techniques.","translation":"電気生理病理学の研究は、神経調節技術の進歩につながっています。","type":"general","meaning_category":"study of pathological changes"},{"sentence":"The electropathology findings revealed significant cellular damage after exposure to high-intensity electrical fields.","translation":"電気生理病理学的な所見から、高強度の電場に曝露された後、重大な細胞損傷が明らかになりました。","type":"research","meaning_category":"pathological findings"}]}