{"word":"Jinja","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ジンジャ (ウガンダの都市)","english_definition":"A city in Uganda, located on the shores of Lake Victoria, known as the source of the Nile River.","examples":[{"sentence":"Jinja is a popular tourist destination for white-water rafting.","translation":"ジンジャは、ホワイトウォーターラフティングの人気観光地です。"},{"sentence":"The city of Jinja is located in southern Uganda.","translation":"ジンジャ市はウガンダ南部に位置しています。"}],"collocations":["source of the Nile (ナイル川の源流)","white-water rafting (ホワイトウォーターラフティング)","Lake Victoria (ビクトリア湖)"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"Jinja (Python テンプレートエンジン)","english_definition":"A popular and flexible template engine for the Python programming language.","examples":[{"sentence":"Jinja is often used for generating HTML pages dynamically.","translation":"Jinjaは、HTMLページを動的に生成するためによく使用されます。"},{"sentence":"With Jinja, you can easily separate the presentation layer from the application logic.","translation":"Jinjaを使用すると、プレゼンテーション層をアプリケーションロジックから簡単に分離できます。"}],"collocations":["template engine (テンプレートエンジン)","HTML generation (HTML生成)","Python programming (Pythonプログラミング)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The city of Jinja is named after the local language word for 'rock' because of the rocky landscape near the source of the Nile.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdʒɪndʒə/","syllables":"Jin-ja"},"inflection":{"notes":"Noun, no plural form needed."},"usage_notes":{"explanation":"'Jinja' refers to two distinct things: a city in Uganda and a Python template engine. The context will usually make it clear which one is being referred to. When referring to the city, it's often associated with the Nile River and adventure tourism. When referring to the template engine, it's associated with web development and Python programming.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I went to Jinja to learn Python.","correct":"✓ I used Jinja to generate HTML with Python.","note":"This clarifies the usage of Jinja as a template engine within the Python context."},{"incorrect":"✗ Jinja is a country.","correct":"✓ Jinja is a city in Uganda.","note":"This corrects the misconception about Jinja's geographical identity."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Flask (Python web framework)","Django (Python web framework)","template (テンプレート)","Python (パイソン)","HTML (エイチティーエムエル)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specific noun)","frequency_google_ngram":"Relatively low frequency, but common in specific contexts (Python development, Ugandan geography).","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Jinja' is a proper noun that can refer to either a city in Uganda or a Python template engine. Understanding the context is crucial to interpreting its meaning. In geographical contexts, it refers to a city known for being near the source of the Nile. In programming contexts, it refers to a tool used for generating dynamic content with Python.","priority":"★★★"},"example_sentences":[{"sentence":"We visited Jinja to see the source of the Nile.","translation":"ナイル川の源流を見るためにジンジャを訪れました。","type":"Location","meaning_category":"Ugandan City"},{"sentence":"I used Jinja to create dynamic web pages with Python.","translation":"Pythonで動的なウェブページを作成するためにJinjaを使用しました。","type":"Technology","meaning_category":"Python Template Engine"}]}