{"word":"unbotanical","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"植物学的でない、植物学に関係がない","english_definition":"Not botanical; unrelated to botany or plants.","examples":[{"sentence":"The museum's collection included many unbotanical items, such as historical artifacts and geological specimens.","translation":"その博物館のコレクションには、歴史的な工芸品や地質標本など、植物学とは関係のないものが多く含まれていました。"},{"sentence":"His interests were primarily unbotanical, focusing on mathematics and physics.","translation":"彼の興味は主に植物学とは関係がなく、数学と物理学に集中していました。"}],"collocations":["unbotanical subjects","unbotanical interests","unbotanical collection"],"synonyms":["nonbotanical","non-botanical","non-vegetative","unhorticultural"],"antonyms":["botanical","vegetative","horticultural"]}],"etymology":{"value":"接頭辞 un- (否定) + botanical","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnbəˈtænɪkəl/","syllables":"un-bo-tan-i-cal"},"inflection":{"notes":"形容詞なので比較変化はありますが、通常は使われません。"},"usage_notes":{"explanation":"\"unbotanical\" は、何かが植物学または植物に関係がないことを示すために使用されます。これは、特定のコレクション、興味、または研究分野が植物学の範囲外であることを説明するために使用される場合があります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unbotanical garden was full of rocks.","correct":"✓ The garden, which was unbotanical, was full of rocks.","note":"unbotanical garden という表現は矛盾しているため、庭園全体が植物学と無関係であるという意味にはなりません。庭園の一部が植物学的な要素を含んでいないことを示唆する文脈でのみ使用できます。"}],"priority":"★★☆"},"related_words":{"derivatives":["botanical","botanically","botany"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Unbotanical\" is a relatively uncommon word used to describe something unrelated to botany, the study of plants. Its usage is generally limited to academic or specialized contexts where the distinction between botanical and non-botanical subjects is relevant. Understanding the word requires familiarity with the term \"botanical\" and the function of the prefix \"un-\" to negate or reverse the meaning of a word."},"example_sentences":[{"sentence":"The exhibit included both botanical and unbotanical specimens to provide a comprehensive overview of natural history.","translation":"その展示には、自然史の包括的な概要を提供するために、植物学的標本と非植物学的標本の両方が含まれていました。","type":"general","meaning_category":"general"},{"sentence":"Her research interests were primarily unbotanical, focusing on animal behavior and ecology.","translation":"彼女の研究対象は主に植物学とは関係がなく、動物の行動と生態学に焦点を当てていました。","type":"general","meaning_category":"general"}]}