{"word":"Nicosia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ニコシア：キプロスの首都であり、最大の都市","english_definition":"The capital and largest city of Cyprus. It is located near the centre of the island, on the Pedieos River.","examples":[{"sentence":"Nicosia is the only divided capital city in the world.","translation":"ニコシアは世界で唯一の分断された首都です。"},{"sentence":"The old city of Nicosia is surrounded by Venetian walls.","translation":"ニコシアの旧市街はヴェネツィア時代の城壁に囲まれています。"}],"collocations":["capital of Cyprus","divided city","old city of Nicosia"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The origin of the name 'Nicosia' is uncertain. One theory suggests it comes from the Greek 'λευκός' (leukos), meaning 'white,' referring to the white poplar trees in the area. Another theory links it to the ancient settlement of Ledra.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɪkəˈsiːə/","syllables":"Ni-co-si-a"},"inflection":{},"usage_notes":{"explanation":"Nicosia is the capital of Cyprus and is unique as the world's last divided capital. The city is split between the Republic of Cyprus (Greek Cypriot) and the Turkish Republic of Northern Cyprus. The 'Green Line,' a UN-controlled buffer zone, separates the two sides.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Nicosian (adjective/noun)"],"related_places":["Northern Cyprus","Republic of Cyprus","Kyrenia","Larnaca","Limassol"],"priority":"★☆☆"},"level_frequency":{},"readability_explanation":{"level":"B2","text":"Nicosia is a city name, specifically the capital of Cyprus. It's important to understand its geopolitical context as a divided city. The name itself doesn't have many variations or complex usages, but understanding its location and significance is key to understanding news or discussions about Cyprus. "},"example_sentences":[{"sentence":"Visitors to Nicosia can cross the border at designated checkpoints.","translation":"ニコシアへの訪問者は、指定された検問所で国境を越えることができます。","type":"example","meaning_category":"location"},{"sentence":"The history of Nicosia reflects the complex history of Cyprus.","translation":"ニコシアの歴史は、キプロスの複雑な歴史を反映しています。","type":"example","meaning_category":"history"}]}