{"word":"pietisticalness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"信心深さぶること、信心過剰、偽善的な信心深さ","english_definition":"The quality or state of being pietistical; excessive or affected piety; religious hypocrisy.","examples":[{"sentence":"His pietisticalness was seen as a facade to hide his true intentions.","translation":"彼の信心深さぶった態度は、彼の本当の意図を隠すための見せかけだと見られていた。"},{"sentence":"The critic attacked the pietisticalness of the novel, finding its religious themes insincere.","translation":"批評家はその小説の信心深さぶった点を批判し、その宗教的なテーマが誠実さに欠けると判断した。"}],"collocations":["affected pietisticalness (見せかけの信心深さ)","religious pietisticalness (宗教的な信心深さぶること)"],"synonyms":["sanctimoniousness","hypocrisy","piousness","self-righteousness","moralizing","cant","affectation of piety"],"antonyms":["sincerity","genuineness","honesty","authenticity"]}],"etymology":{"value":"Derived from 'pietistical,' which comes from 'pietist,' referring to a member of Pietism, a 17th-18th century movement within Lutheranism that emphasized personal piety and religious experience. The suffix '-ness' turns the adjective into a noun.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpaɪɪˈtɪstɪkəlnəs/","syllables":"pi-e-tis-ti-cal-ness"},"inflection":{"noun_plural":"(uncountable noun, no plural form)"},"usage_notes":{"explanation":"'Pietisticalness' is a noun that describes the quality of being pietistical, which often carries a negative connotation. It suggests that someone is excessively or insincerely pious, often to the point of hypocrisy. It is used to criticize or question the genuineness of someone's religious devotion.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed great pietisticalness by donating all his money.","correct":"✓ He showed great generosity by donating all his money.","note":"While donating money can be an act of piety, 'pietisticalness' implies insincerity or a showy display of piety. 'Generosity' is a more appropriate term if the act is seen as sincere. If you want to imply insincerity, you could say, 'He showed great pietisticalness by publicly announcing his donation.'"},{"incorrect":"✗ The pietisticalness of the church was inspiring.","correct":"✓ The piety of the church was inspiring.","note":"'Pietisticalness' generally has a negative connotation, implying insincerity. If you want to express genuine religious devotion, use 'piety' instead."}],"priority":"★★☆"},"related_words":{"derivatives":["pietist (名詞: ピエティスト、敬虔主義者)","pietistic (形容詞: 敬虔主義の)","pietistically (副詞: 敬虔主義的に)"],"phrases":["display of pietisticalness (信心深さぶった態度)","air of pietisticalness (信心深さぶった雰囲気)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pietisticalness' is a relatively rare and complex word. It describes the quality of being excessively or insincerely pious, often with a negative connotation of hypocrisy. It is typically used in academic or literary contexts to critique or analyze religious behavior or attitudes. Understanding the word requires a grasp of the historical context of Pietism and the nuances of religious language."},"example_sentences":[{"sentence":"The politician's sudden display of pietisticalness during the election campaign raised suspicions about his true motives.","translation":"選挙運動中の政治家の突然の信心深さぶった態度は、彼の本当の動機に対する疑念を抱かせた。","type":"general","meaning_category":"general"},{"sentence":"The novel satirizes the pietisticalness of the wealthy characters, exposing their moral hypocrisy.","translation":"その小説は、裕福な登場人物の信心深さぶった態度を風刺し、彼らの道徳的な偽善を暴露している。","type":"literary","meaning_category":"literary"}]}