{"word":"coral-built","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"サンゴで建てられた、サンゴを材料として作られた","english_definition":"Constructed or made from coral.","examples":[{"sentence":"The island features a coral-built church that has stood for centuries.","translation":"その島には、何世紀も前から建っているサンゴで建てられた教会があります。"},{"sentence":"The old walls were coral-built, showcasing the island's unique architecture.","translation":"古い壁はサンゴで建てられており、島のユニークな建築様式を示しています。"}],"collocations":["coral-built house","coral-built structure","coral-built wall"],"synonyms":["coral","coral-stone","coral-constructed"],"antonyms":["brick-built","stone-built","wood-built"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'coral' (referring to the marine invertebrate or its skeletal remains) and 'built' (past participle of 'build', meaning constructed or made).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒrəl bɪlt/","syllables":"cor-al-built"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"The term 'coral-built' is used to describe structures or objects that are primarily constructed using coral as the main building material. This is often seen in island regions where coral is readily available. The term emphasizes the unique material used in the construction.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The house was build coral.","correct":"✓ The house was coral-built.","note":"'Coral-built' is a compound adjective. Avoid separating 'coral' and 'built' with other words when describing the construction material."}],"priority":"★☆☆"},"related_words":{"derivatives":["coral (noun)","built (verb)","coral stone (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'coral-built' is a descriptive adjective commonly used in contexts related to architecture, construction, or geography, particularly when discussing island regions where coral is a prevalent building material. Understanding the term requires knowledge of both 'coral' and the concept of construction. It is not a commonly used term in everyday conversation, making it more suitable for advanced English speakers or those with specific interests in related fields."},"example_sentences":[{"sentence":"The ancient fort was coral-built, a testament to the islanders' ingenuity.","translation":"古代の砦はサンゴで建てられており、島民の創意工夫の証です。","type":"general","meaning_category":"description"},{"sentence":"Many of the older homes on the island are coral-built, reflecting the local architectural traditions.","translation":"島の古い家屋の多くはサンゴで建てられており、地元の建築様式を反映しています。","type":"general","meaning_category":"description"}]}