{"word":"uncased","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"大文字小文字の区別がない、大文字小文字を区別しない","english_definition":"Not having a distinction between uppercase and lowercase letters; case-insensitive.","examples":[{"sentence":"The search is uncased, so it will find both 'apple' and 'Apple'.","translation":"この検索は大文字小文字を区別しないので、「apple」と「Apple」の両方を見つけます。"},{"sentence":"We need to perform an uncased comparison of the strings.","translation":"文字列の大文字小文字を区別しない比較を行う必要があります。"}],"collocations":["uncased search","uncased comparison","uncased index"],"synonyms":["case-insensitive"],"antonyms":["cased","case-sensitive"]}],"etymology":{"value":"The word 'uncased' is formed by adding the prefix 'un-' (meaning 'not') to the word 'cased'. 'Cased' in this context refers to the distinction between uppercase and lowercase letters, as in 'case-sensitive'. Therefore, 'uncased' means 'not cased' or 'without case distinction'.","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈkeɪst/","syllables":"un-cased"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Uncased' is primarily used in technical contexts, especially in computer science and programming, to describe operations or data where the difference between uppercase and lowercase letters is ignored. It is the opposite of 'cased' or 'case-sensitive'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The uncased letter was delivered.","correct":"✓ The unaddressed letter was delivered.","note":"'Uncased' refers to case sensitivity, not whether a letter has an address. Use 'unaddressed' for a letter without an address."},{"incorrect":"✗ The uncased document was difficult to read.","correct":"✓ The unformatted document was difficult to read.","note":"'Uncased' does not mean 'unformatted'. Use 'unformatted' to describe a document lacking formatting."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["case-sensitive","case-insensitive","uppercase","lowercase","collation","string comparison"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'uncased' is a technical term primarily used in computer science and programming. It describes a situation where the distinction between uppercase and lowercase letters is ignored. This is important in contexts like searching or comparing text, where you might want to find 'Apple' even if the user types 'apple'. Understanding this term requires some familiarity with technical concepts related to text processing and data manipulation."},"example_sentences":[{"sentence":"The database query used an uncased search to find all matching entries.","translation":"データベースクエリは、一致するすべてのエントリを見つけるために、大文字小文字を区別しない検索を使用しました。","type":"example","meaning_category":"case-insensitive search"},{"sentence":"An uncased index can improve search performance by ignoring letter case.","translation":"大文字小文字を区別しないインデックスは、文字の大小を無視することで検索パフォーマンスを向上させることができます。","type":"example","meaning_category":"case-insensitive index"},{"sentence":"The programming language offers functions for both cased and uncased string comparisons.","translation":"そのプログラミング言語は、大文字小文字を区別する文字列比較と、大文字小文字を区別しない文字列比較の両方の関数を提供します。","type":"example","meaning_category":"case-insensitive comparison"}]}