{"word":"polyarchist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"多元主義者、多数者支配論者","english_definition":"An advocate or supporter of polyarchy, a form of government in which power is distributed among multiple centers or groups.","examples":[{"sentence":"The political scientist is known as a prominent polyarchist.","translation":"その政治学者は著名な多元主義者として知られている。"},{"sentence":"Polyarchists believe in the importance of decentralizing power.","translation":"多数者支配論者は権力を分散させることの重要性を信じている。"}],"collocations":["a leading polyarchist","a dedicated polyarchist"],"synonyms":["pluralist","decentralist"],"antonyms":["monarchist","autocrat"]},{"part_of_speech":"adjective","definition":"多元主義の、多数者支配論の","english_definition":"Relating to or characteristic of polyarchy or polyarchists.","examples":[{"sentence":"The country's political system is based on polyarchist principles.","translation":"その国の政治システムは多元主義の原則に基づいている。"},{"sentence":"The polyarchist approach emphasizes the role of multiple actors in governance.","translation":"多数者支配論的アプローチは、統治における複数の主体の役割を強調する。"}],"collocations":["polyarchist system","polyarchist principles"],"synonyms":["pluralistic","decentralized"],"antonyms":["monarchic","autocratic"]}],"etymology":{"value":"The word \"polyarchist\" is derived from \"polyarchy,\" which comes from the Greek words \"poly\" (meaning \"many\") and \"arche\" (meaning \"rule\" or \"governance\").","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɒliˈɑːrkɪst/","syllables":"pol-y-ar-chist"},"inflection":{"noun_plural":"polyarchists","adjective_forms":{}},"usage_notes":{"explanation":"The term \"polyarchist\" is primarily used in political science and political theory to describe individuals who support or advocate for polyarchy. Polyarchy refers to a form of government characterized by multiple centers of power, decentralization, and the involvement of various groups and actors in decision-making processes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a polyarchist of the monarchy.","correct":"✓ He is an opponent of the monarchy and supports polyarchy.","note":"Polyarchy is the opposite of monarchy, so one cannot be a polyarchist *of* a monarchy."}],"priority":"★☆☆"},"related_words":{"derivatives":["polyarchy","polyarchical"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"polyarchist\" is a specialized word primarily used in political science and political theory. It refers to someone who supports or advocates for polyarchy, a system of governance characterized by multiple centers of power and the involvement of various groups. Understanding this term requires familiarity with political science concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"As a committed **polyarchist**, she actively promotes democratic reforms.","translation":"熱心な多元主義者として、彼女は積極的に民主主義改革を推進している。","type":"noun","meaning_category":"多元主義者"},{"sentence":"The **polyarchist** model of governance aims to prevent the concentration of power.","translation":"多数者支配論的な統治モデルは、権力の集中を防ぐことを目的としている。","type":"adjective","meaning_category":"多元主義の"}]}