{"word":"archhumbug","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"大ペテン師、大山師、偽善者","english_definition":"A supreme or principal humbug; a person who is the epitome of humbuggery.","examples":[{"sentence":"He was considered the archhumbug of the political scene, making promises he never intended to keep.","translation":"彼は政界の大ペテン師とみなされ、守るつもりのない約束をしていた。"},{"sentence":"The critic described the artist's work as archhumbug, devoid of any real substance.","translation":"評論家はその芸術家の作品を、本質を欠いた大山師と評した。"}],"collocations":["political archhumbug","artistic archhumbug"],"synonyms":["impostor","charlatan","fraud","deceiver","hypocrite"],"antonyms":["genuine","sincere","authentic"]}],"etymology":{"value":"'Arch-' (chief, principal) + 'humbug' (deception, nonsense). The term likely arose in the 19th century to describe someone who was the ultimate practitioner of deceit.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɑːrtʃˈhʌmbʌɡ/","syllables":"arch-hum-bug"},"inflection":{"noun_plural":"archhumbugs"},"usage_notes":{"explanation":"'Archhumbug' is a relatively rare and somewhat archaic term used to describe someone who is considered the ultimate or most egregious example of a humbug. It implies a high degree of deception, hypocrisy, or pretense. The term is often used in a critical or satirical context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was an archhumbug person.","correct":"✓ He was an archhumbug.","note":"'Archhumbug' is a noun, so it doesn't need to be followed by 'person'."},{"incorrect":"✗ She archhumbugged her way to the top.","correct":"✓ She used humbuggery to get to the top.","note":"'Archhumbug' is primarily used as a noun, not a verb."}],"priority":"★★☆"},"related_words":{"derivatives":["humbug (noun, verb)","humbuggery (noun)"],"phrases":["the archhumbug of..."],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Archhumbug' is a rare and sophisticated term used to describe someone considered the epitome of deception or hypocrisy. It's not commonly used in everyday language and is more likely to be found in literature or formal writing. Understanding the word requires a good grasp of vocabulary and an understanding of the nuances of language."},"example_sentences":[{"sentence":"The journalist exposed the CEO as an archhumbug, revealing his fraudulent business practices.","translation":"ジャーナリストはCEOの不正なビジネス慣行を暴露し、彼を大ペテン師として暴いた。","type":"noun","meaning_category":"大ペテン師"},{"sentence":"His elaborate claims of expertise were nothing more than archhumbug.","translation":"彼の専門知識に関する手の込んだ主張は、単なる大山師に過ぎなかった。","type":"noun","meaning_category":"大山師"}]}