{"word":"CMTC","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"Cutis Marmorata Telangiectatica Congenita (先天性血管拡張性大理石様皮斑)","english_definition":"A rare congenital vascular malformation characterized by a persistent, generalized cutis marmorata-like pattern, telangiectasia, and sometimes associated with other anomalies.","examples":[{"sentence":"The infant was diagnosed with CMTC shortly after birth due to the distinct mottling of their skin.","translation":"その乳児は、出生後すぐに、特徴的な皮膚のまだら模様によりCMTCと診断された。"},{"sentence":"CMTC is a rare condition, and its exact cause is still unknown.","translation":"CMTCはまれな疾患であり、その正確な原因はまだ不明である。"}],"collocations":["diagnose CMTC","CMTC diagnosis","CMTC symptoms","CMTC treatment","CMTC patient"],"synonyms":["Van Lohuizen syndrome"],"antonyms":[]}],"etymology":{"value":"Acronym derived from the name of the condition: Cutis Marmorata Telangiectatica Congenita. 'Cutis Marmorata' refers to the marbled skin appearance, 'Telangiectatica' refers to the presence of telangiectasias (dilated blood vessels), and 'Congenita' indicates that the condition is present at birth.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsiːˌemˌtiːˈsiː/","syllables":"C-M-T-C"},"inflection":{"noun_plural":"CMTCs"},"usage_notes":{"explanation":"CMTC is primarily used in medical contexts when discussing or diagnosing this specific congenital vascular condition. It's important to note that this is a rare condition, so the term is not commonly encountered outside of medical literature or discussions among healthcare professionals.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The baby has CMT.","correct":"✓ The baby has CMTC.","note":"CMT refers to Charcot-Marie-Tooth disease, a different condition. Always use CMTC for Cutis Marmorata Telangiectatica Congenita."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["vascular malformation","cutis marmorata","telangiectasia","congenital disorder"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Very low frequency - Primarily used in medical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"CMTC is a highly specialized medical term. Understanding it requires a strong background in medicine, specifically in dermatology and vascular abnormalities. Due to its rarity and technical nature, it is not part of general vocabulary."},"example_sentences":[{"sentence":"Genetic testing is sometimes performed to rule out other conditions with similar symptoms to CMTC.","translation":"遺伝子検査は、CMTCと同様の症状を持つ他の疾患を除外するために実施されることがある。","type":"noun","meaning_category":"Medical Condition"},{"sentence":"Parents of children with CMTC often seek support groups for information and shared experiences.","translation":"CMTCの子供を持つ親は、情報や経験を共有するためにサポートグループを探すことが多い。","type":"noun","meaning_category":"Medical Condition"}]}