{"word":"unannouncable","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"(通常、ニュースや情報について)発表できない、公表できない、発表するのに適さない","english_definition":"Not suitable or able to be announced, typically due to being too sensitive, confidential, or embarrassing.","examples":[{"sentence":"The details of the settlement are unannouncable due to a confidentiality agreement.","translation":"和解の詳細は、機密保持契約のため発表できません。"},{"sentence":"The company deemed the product recall unannouncable, fearing a stock market crash.","translation":"会社は、株式市場の暴落を恐れて、製品のリコールを発表できないと判断しました。"},{"sentence":"His reasons for resigning were unannouncable; he simply stated personal reasons.","translation":"彼の辞任理由は発表できませんでした。彼は単に個人的な理由を述べました。"}],"collocations":["unannouncable news","unannouncable secret","unannouncable information","deem unannouncable","remain unannouncable"],"synonyms":["unpublishable","undisclosable","confidential","secret","private","unrevealable","unspeakable"],"antonyms":["announcable","publishable","disclosable","public","revealable"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to 'announcable', which itself comes from 'announce' + '-able' (capable of being).","priority":"medium"},"pronunciation":{"ipa":"/ˌʌnəˈnaʊnsəbəl/","syllables":"un-an-noun-ca-ble"},"inflection":{"notes":"Adjectives in English do not inflect for number or gender. Comparative and superlative forms are 'more unannouncable' and 'most unannouncable', respectively, but are rarely used."},"usage_notes":{"explanation":"'Unannouncable' is typically used in formal contexts to describe information that cannot be made public for legal, ethical, or strategic reasons. It often implies that the information is sensitive or potentially damaging if revealed. The word is relatively rare, and more common alternatives like 'confidential' or 'undisclosable' are often preferred.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The party was unannouncable.","correct":"The party was unannounced.","note":"'Unannouncable' refers to the information about something, not the event itself. Use 'unannounced' to mean without prior notice."}],"priority":"low"},"related_words":{"derivatives":["announce (verb)","announcement (noun)","announcer (noun)","announcable (adjective)","unannounced (adjective)"],"priority":"medium"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"low"},"readability_explanation":{"level":"C1","text":"The word 'unannouncable' is a relatively rare and formal term. It is used to describe information or news that cannot be made public, often because it is confidential, sensitive, or legally restricted. Understanding the word requires a good vocabulary and an understanding of formal language. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The reasons for the company's sudden closure were deemed unannouncable by legal counsel.","translation":"会社の突然の閉鎖理由は、法律顧問によって発表できないと判断されました。","type":"general","meaning_category":"unable to be announced"},{"sentence":"Due to ongoing negotiations, the terms of the agreement remain unannouncable.","translation":"現在交渉中のため、合意条件は発表できません。","type":"legal","meaning_category":"unable to be announced due to legal reasons"},{"sentence":"The details of the medical diagnosis were unannouncable to the press, respecting patient privacy.","translation":"患者のプライバシーを尊重し、医学的診断の詳細は報道機関に発表できませんでした。","type":"medical","meaning_category":"unable to be announced due to privacy"}]}