{"word":"estopped","priority":"★☆☆","meanings":[{"part_of_speech":"verb","definition":"(法律)禁反言の適用を受けた","english_definition":"(law) past tense and past participle of estop: prevented from denying or alleging a fact because of one's previous actions or words.","examples":[{"sentence":"The defendant was estopped from denying the validity of the contract.","translation":"被告は、契約の有効性を否定することを禁反言により妨げられた。"},{"sentence":"She was estopped from claiming ownership of the property.","translation":"彼女は、その不動産の所有権を主張することを禁反言により妨げられた。"}],"collocations":["be estopped from","estopped from denying","estopped from claiming"],"synonyms":["barred","prevented","prohibited","precluded"],"antonyms":["allowed","permitted","enabled"]}],"etymology":{"value":"Derived from the verb 'estop,' which comes from Old French 'estoper' meaning 'to stop up,' from Vulgar Latin 'stuppare,' to stop with tow, from Latin 'stuppa' meaning 'the coarse part of flax or hemp.'","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈstɒpt/","syllables":"e-stopped"},"inflection":{"verb_forms":{"present_simple":["estop","estops"],"past_simple":"estopped","past_participle":"estopped","present_participle":"estopping"}},"usage_notes":{"explanation":"'Estopped' is the past tense and past participle of the verb 'estop.' It is a legal term that means someone is prevented from asserting a right or fact that contradicts their previous actions, statements, or conduct. This prevention is based on the principle of equity and fairness, ensuring that individuals are held accountable for their prior representations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was stopped to claim the prize.","correct":"✓ He was estopped from claiming the prize.","note":"'Estopped' has a specific legal meaning related to being prevented from denying or alleging something due to prior actions. 'Stopped' is a general term for being halted or prevented."},{"incorrect":"✗ The estop person.","correct":"✓ The estopped person.","note":"'Estop' is a verb. The correct usage in the past participle form is 'estopped' to describe someone who is subject to estoppel."}],"priority":"★★☆"},"related_words":{"derivatives":["estop (verb): to prevent by estoppel","estoppel (noun): the principle which precludes a person from asserting something contrary to what is implied by a previous action or statement of that person or by a previous pertinent judicial determination"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - a specialized legal term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Estopped' is a highly specialized legal term. It indicates that someone is legally barred from asserting a claim or right because their prior actions, statements, or conduct would make it unfair or unjust for them to do so. This term is primarily used in legal contexts and requires a solid understanding of legal principles to use and interpret correctly. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The company was estopped from pursuing the patent infringement claim due to its prior licensing agreement.","translation":"その会社は、以前のライセンス契約により、特許侵害の訴えを追及することを禁反言により妨げられた。","type":"verb","meaning_category":"legal"},{"sentence":"Because he publicly endorsed the product, he was estopped from later criticizing its quality.","translation":"彼が公にその製品を支持したため、後になってその品質を批判することを禁反言により妨げられた。","type":"verb","meaning_category":"legal"},{"sentence":"The principle of promissory estoppel estopped the bank from enforcing the original loan terms.","translation":"約束的禁反言の原則により、銀行は元の融資条件を強制することが禁じられた。","type":"verb","meaning_category":"legal"}]}