{"word":"devisor","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律) 遺言によって不動産を譲る人、遺贈者","english_definition":"(law) A person who bequeaths real property by will; a testator.","examples":[{"sentence":"The devisor specified in his will that the property should go to his eldest son.","translation":"遺贈者は遺言の中で、その不動産を長男に譲るよう指定した。"},{"sentence":"The devisor must have the legal capacity to make a will.","translation":"遺贈者は遺言を作成する法的能力を有していなければならない。"}],"collocations":["the devisor's will (遺贈者の遺言)","the devisor's intent (遺贈者の意図)","the devisor's estate (遺贈者の財産)"],"synonyms":["testator","bequeather"],"antonyms":["devisee"]}],"etymology":{"value":"From Anglo-Norman *devisour*, from Old French *deviseur* (one who devises or plans), from *deviser* (to divide, devise, plan), from Latin *dividere* (to divide).","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈvaɪzər/","syllables":"de-vi-sor"},"inflection":{"noun_plural":"devisors"},"usage_notes":{"explanation":"The term 'devisor' is specifically used in the context of wills and real property (land and buildings). It refers to the person making the will who is giving away real estate. The recipient is called the 'devisee'. This term is less common in everyday language and primarily used in legal settings. It is important to note that the term applies to real property, while 'testator' can refer to someone leaving personal property as well.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The devisor left all of her personal belongings to her daughter.","correct":"✓ The testatrix left all of her personal belongings to her daughter.","note":"'Devisor' refers to someone who leaves real property (land, buildings), while 'testatrix' (female) or 'testator' (male) refers to someone who leaves personal property (possessions, money)."},{"incorrect":"✗ The devisor received the property.","correct":"✓ The devisee received the property.","note":"The devisor is the one giving the property, the devisee is the one receiving it."}],"priority":"★★☆"},"related_words":{"derivatives":["devise (verb: to plan, invent, or bequeath)","devisee (noun: the person who receives real property by will)","devise (noun: a clause in a will transferring real property)"],"legal_terms":["will","testament","bequest","legacy","estate","probate"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Legal Term)","frequency_google_ngram":"Low frequency - Primarily used in legal documents and discussions.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Devisor' is a legal term referring to someone who leaves real property (land and buildings) to another person in their will. It's essential to understand this term within the context of estate law and wills. The person who receives the property is called the 'devisee.' This word is not commonly used in everyday conversation and is primarily found in legal documents and discussions related to estate planning and inheritance.","priority":"★★☆"},"example_sentences":[{"sentence":"The devisor clearly outlined in the will how the land should be divided among his grandchildren.","translation":"遺贈者は遺言の中で、その土地を孫たちにどのように分割すべきかを明確に記述した。","type":"noun","meaning_category":"legal"},{"sentence":"As the devisor, she had the right to change her will at any time before her death.","translation":"遺贈者として、彼女は亡くなる前であればいつでも遺言を変更する権利を有していた。","type":"noun","meaning_category":"legal"},{"sentence":"The court examined the devisor's mental state to ensure the will was valid.","translation":"裁判所は、遺言が有効であることを確認するために、遺贈者の精神状態を調査した。","type":"noun","meaning_category":"legal"}]}