{"word":"narratable","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"物語として語ることができる、物語る価値のある","english_definition":"Capable of being narrated; suitable for or lending itself to narration.","examples":[{"sentence":"The events of that day were scarcely narratable.","translation":"その日の出来事はほとんど語るに値しないものでした。"},{"sentence":"The story, though complex, was ultimately narratable.","translation":"その物語は複雑ではあるものの、最終的には語ることができました。"},{"sentence":"Whether or not an experience is narratable depends on the individual's ability to articulate it.","translation":"経験が物語として語れるかどうかは、それを明確に表現する個人の能力に依存します。"}],"collocations":["easily narratable (容易に語ることができる)","scarcely narratable (ほとんど語ることができない)","highly narratable (非常に語る価値のある)","the narratable quality (物語として語れる性質)"],"synonyms":["storyable","relatable","reportable","describable","recountable"],"antonyms":["unutterable","indescribable","ineffable","unrelatable"]},{"part_of_speech":"adjective","definition":"物語の形にすることができる、物語化できる","english_definition":"Capable of being put into the form of a narrative.","examples":[{"sentence":"The historical data was narratable, allowing for a compelling historical account.","translation":"その歴史的データは物語化可能であり、説得力のある歴史的記述を可能にしました。"},{"sentence":"The abstract concepts were made narratable through the use of metaphors.","translation":"抽象的な概念は、比喩を用いることで物語化されました。"}],"collocations":["made narratable (物語化された)","easily made narratable (容易に物語化できる)"],"synonyms":["story-like","narrative-form","dramatizable"],"antonyms":["non-narrative","non-dramatic"]}],"etymology":{"value":"From 'narrate' + '-able'. 'Narrate' comes from Latin 'narrare' meaning 'to tell, relate'. The suffix '-able' indicates capability or suitability.","priority":"★★☆"},"pronunciation":{"ipa":"ˈnærəteɪbəl","syllables":"nar-ra-ta-ble"},"inflection":{"notes":"Adjective, comparative and superlative forms are 'more narratable' and 'most narratable' respectively."},"usage_notes":{"explanation":"'Narratable' is used to describe something that can be turned into a story or that is suitable for being told as a story. It often implies that the subject matter is interesting, coherent, or meaningful enough to be worth narrating. It can also refer to the ability to structure information into a narrative format.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The feeling was not narratable. I couldn't describe it.","correct":"The feeling was ineffable. I couldn't describe it.","note":"'Narratable' means capable of being narrated, not necessarily difficult to describe. 'Ineffable' is a better choice for something beyond description."},{"incorrect":"The data is narratable, so we can make a movie.","correct":"The data is adaptable into a narrative, so we can make a movie.","note":"'Narratable' describes the quality of being able to be narrated. 'Adaptable into a narrative' is clearer when referring to transforming data into a story."}],"priority":"★☆☆"},"related_words":{"derivatives":["narration (名詞: 物語ること、ナレーション)","narrative (名詞: 物語、記述)","narrator (名詞: 語り手)","narrate (動詞: 物語る)"],"related_concepts":["storytelling","narratology","diegesis","mimesis"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Narratable' means something can be told as a story or is suitable for being made into a story. It implies that the subject is interesting or coherent enough to be worth narrating. It's a relatively uncommon word, often used in academic or literary contexts when discussing the nature of stories and storytelling. It suggests that something has the qualities needed to form a narrative, such as a clear sequence of events or a meaningful theme."},"example_sentences":[{"sentence":"The patient's medical history, while complex, was ultimately narratable, providing insights into the progression of the disease.","translation":"患者の病歴は複雑ではあるものの、最終的には物語として語ることができ、病気の進行に関する洞察を提供しました。","type":"adjective","meaning_category":"物語として語ることができる"},{"sentence":"The author sought to make the scientific concepts narratable for a wider audience.","translation":"著者は、科学的な概念をより多くの読者にとって物語化できるように努めました。","type":"adjective","meaning_category":"物語の形にすることができる"},{"sentence":"Not all experiences are easily narratable; some defy simple storytelling.","translation":"すべての経験が簡単に物語として語れるわけではありません。単純な物語化を拒むものもあります。","type":"adjective","meaning_category":"物語として語ることができる"},{"sentence":"The film explored the narratable aspects of everyday life.","translation":"その映画は、日常生活の物語として語れる側面を探求しました。","type":"adjective","meaning_category":"物語として語ることができる"}]}