{"word":"Metoestrus","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(獣医)発情後期：哺乳類の雌の発情周期における発情期後、黄体期に入るまでの期間。子宮内膜が厚くなり、妊娠の準備をする。","english_definition":"(Veterinary Medicine) The period in the estrous cycle of female mammals immediately following estrus, characterized by a decline in estrogen levels and the formation of the corpus luteum. The uterine lining thickens in preparation for pregnancy.","examples":[{"sentence":"The veterinarian determined the dog was in metoestrus based on the vaginal cytology.","translation":"獣医は膣細胞診に基づいて、犬が発情後期にあると判断した。"},{"sentence":"During metoestrus, the female's behavior changes as she is no longer receptive to mating.","translation":"発情後期の間、メスの行動は変化し、もはや交尾を受け入れなくなる。"}],"collocations":["vaginal cytology during metoestrus","hormone levels in metoestrus","behavioral changes in metoestrus"],"synonyms":["diestrus (early)","postestrus"],"antonyms":["proestrus","estrus"]}],"etymology":{"value":"Derived from the Greek words 'meta' (after, beyond) and 'oestrus' (heat, frenzy, sexual desire), indicating the period after the peak of estrus.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmiːtoʊˈiːstrəs/","syllables":"me-to-es-trus"},"inflection":{"noun_plural":"metoestruses"},"usage_notes":{"explanation":"Metoestrus is a specific term used in veterinary medicine and animal science to describe a particular stage in the estrous cycle of female mammals. It is important to note that this term is not commonly used in human reproductive biology, where different terminology is employed.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The animal is in metestrus and is receptive to mating.","correct":"✓ The animal is in estrus and is receptive to mating.","note":"Animals are receptive to mating during estrus, not metoestrus."}],"priority":"★★☆"},"related_words":{"derivatives":["metestrous (adjective)"],"related_terms":["estrous cycle","proestrus","estrus","diestrus","anestrus"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Metoestrus' is a technical term used in veterinary medicine to describe a specific stage in the reproductive cycle of female mammals. It follows the period of 'estrus' (heat) and involves hormonal and physiological changes preparing the uterus for potential pregnancy. Understanding this term requires knowledge of animal reproductive biology. It is not a term commonly used outside of scientific or veterinary contexts."},"example_sentences":[{"sentence":"The levels of progesterone begin to rise during the metoestrus phase.","translation":"プロゲステロンのレベルは発情後期に上昇し始める。","type":"scientific","meaning_category":"physiology"},{"sentence":"Changes in the vaginal epithelium are characteristic of metoestrus.","translation":"膣上皮の変化は発情後期の特性である。","type":"scientific","meaning_category":"cytology"}]}