{"word":"Docilu","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Brazilian Portuguese, informal) A person who is easily deceived or manipulated; a naive or gullible person.","english_definition":"(Brazilian Portuguese, informal) A person who is easily deceived or manipulated; a naive or gullible person.","examples":[{"sentence":"Ele é tão docilu que acredita em tudo que lhe dizem.","translation":"He is so gullible that he believes everything they tell him.","type":"example"},{"sentence":"Não seja docilu, desconfie de ofertas muito boas para serem verdade.","translation":"Don't be naive, be suspicious of offers that are too good to be true.","type":"example"}],"collocations":["ser docilu (to be gullible)","pessoa docilu (gullible person)"],"synonyms":["ingênuo","crédulo","bobo","tolo"],"antonyms":["esperto","astuto","malandro"]}],"etymology":{"value":"Derived from the adjective 'dócil' (docile), with the suffix '-u' added to create a noun denoting someone who possesses the quality of being docile to an extreme degree.","priority":"★★★"},"pronunciation":{"ipa":"/doˈsilu/","syllables":"Do-ci-lu"},"inflection":{"gender":"masculine","plural":"docilus"},"usage_notes":{"explanation":"'Docilu' is a Brazilian Portuguese term used to describe someone who is easily fooled or taken advantage of due to their naivety or gullibility. It's often used in informal contexts to warn someone against being too trusting or to describe someone who consistently falls for scams or tricks.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Ele é muito dócil.","correct":"Ele é muito docilu.","note":"'Dócil' means 'docile' or 'obedient,' while 'docilu' specifically refers to someone who is gullible or easily deceived."}],"priority":"★★☆"},"related_words":{"derivatives":["dócil (docile)","docilidade (docility)"],"related_terms":["otário","trouxa"]},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'docilu' is a Brazilian Portuguese term that describes a person who is easily deceived or manipulated due to their naivety or gullibility. It is more commonly used in informal settings and may not be widely understood outside of Brazil. The term is derived from the adjective 'dócil,' meaning 'docile,' but carries a more negative connotation, implying a lack of awareness or critical thinking skills."},"example_sentences":[{"sentence":"Cuidado para não ser docilu e cair em golpes online.","translation":"Be careful not to be gullible and fall for online scams.","type":"example"},{"sentence":"O vendedor se aproveitou do fato de ele ser docilu para vender um produto defeituoso.","translation":"The seller took advantage of the fact that he was gullible to sell a defective product.","type":"example"}]}