{"word":"sex-dependent","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"性別依存の、性別によって異なる","english_definition":"Varying or occurring differently depending on the sex of an individual.","examples":[{"sentence":"The expression of this gene is sex-dependent.","translation":"この遺伝子の発現は性別依存的です。"},{"sentence":"The symptoms of the disease can be sex-dependent, with males showing different signs than females.","translation":"この病気の症状は性別によって異なり、男性と女性で異なる兆候を示すことがあります。"},{"sentence":"Drug metabolism can be sex-dependent, affecting dosage requirements.","translation":"薬物代謝は性別依存的であり、投与量に影響を与える可能性があります。"}],"collocations":["sex-dependent manner","sex-dependent differences","sex-dependent effects","sex-dependent expression","sex-dependent inheritance"],"synonyms":["sex-linked","gender-specific","sex-related","sex-influenced"],"antonyms":["sex-independent","gender-neutral"]},{"part_of_speech":"adjective","definition":"(統計学)性別を考慮した、性別で層別化された","english_definition":"(Statistics) Stratified or analyzed by sex.","examples":[{"sentence":"The study presented sex-dependent data on the prevalence of the condition.","translation":"その研究では、この状態の有病率に関する性別を考慮したデータが提示されました。"},{"sentence":"A sex-dependent analysis revealed significant disparities in outcomes.","translation":"性別を考慮した分析により、転帰に大きな格差があることが明らかになりました。"}],"collocations":["sex-dependent analysis","sex-dependent data","sex-dependent models"],"synonyms":["sex-stratified","gender-stratified"],"antonyms":["pooled (data)","combined (data)"]}],"etymology":{"value":"Formed from 'sex' + 'dependent'. Indicates that something is reliant on or varies according to the sex of the individual.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsɛks dɪˈpɛndənt/","syllables":"sex-de-pen-dent"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than forming comparative and superlative forms (more sex-dependent, most sex-dependent), though these are not common for this term."},"usage_notes":{"explanation":"'Sex-dependent' is used in scientific and medical contexts to describe phenomena that differ between males and females. This can include genetic expression, disease symptoms, drug responses, and other biological processes. It is important to use this term accurately to avoid generalizations and to promote a better understanding of sex differences in health and disease.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The disease is sex dependent.","correct":"✓ The disease is sex-dependent.","note":"Hyphenation is important for clarity. 'Sex-dependent' is a compound adjective and should be hyphenated when used before a noun."},{"incorrect":"✗ This effect depends of sex.","correct":"✓ This effect depends on sex.","note":"The correct preposition to use with 'depends' is 'on'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["sex-linked","gender-specific","sex differences","sexual dimorphism","sex hormone","gender bias"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific and medical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'sex-dependent' is used in scientific and medical contexts to describe something that varies or occurs differently based on the sex (male or female) of an individual. It implies that the phenomenon being described is influenced by biological differences between the sexes. This term is commonly used in research papers, medical reports, and other technical documents. Understanding this term requires a good grasp of scientific vocabulary and concepts related to biology and medicine."},"example_sentences":[{"sentence":"The risk of developing osteoporosis is sex-dependent, with women being more susceptible after menopause.","translation":"骨粗鬆症を発症するリスクは性別依存的であり、女性は閉経後に罹患しやすくなります。","type":"general","meaning_category":"medical"},{"sentence":"The study investigated the sex-dependent effects of the drug on liver function.","translation":"その研究では、薬物が肝機能に及ぼす性別依存的な影響を調査しました。","type":"scientific","meaning_category":"pharmacology"},{"sentence":"Sex-dependent inheritance patterns can be observed in certain genetic disorders.","translation":"特定の遺伝性疾患では、性別依存的な遺伝パターンが観察されることがあります。","type":"genetic","meaning_category":"genetics"}]}