{"word":"influxionism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(数学)流率法、微分積分学の初期の名称 (主に歴史的な文脈で使用)","english_definition":"(mathematics) An early name for calculus, specifically the method of fluxions developed by Isaac Newton. Used primarily in historical contexts.","examples":[{"sentence":"Newton's influxionism provided a powerful tool for solving problems in physics and astronomy.","translation":"ニュートンの流率法は、物理学や天文学の問題を解決するための強力なツールを提供した。"},{"sentence":"The debate between Leibniz and Newton over the invention of calculus involved different notations and approaches, with Newton advocating for influxionism.","translation":"ライプニッツとニュートンの微積分発明論争は、異なる記法とアプローチを伴い、ニュートンは流率法を擁護した。"}],"collocations":["Newtonian influxionism","method of fluxions","development of influxionism","history of influxionism"],"synonyms":["calculus","method of fluxions","differential calculus","integral calculus"],"antonyms":[]}],"etymology":{"value":"The term \"influxionism\" derives from \"influxion,\" which Newton used to describe the rate of change of a variable. The word \"influxion\" comes from the Latin word \"influxio,\" meaning \"a flowing in.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈflʌkʃənɪzəm/","syllables":"in-flux-ion-ism"},"inflection":{"noun_plural":"influxionisms"},"usage_notes":{"explanation":"\"Influxionism\" is a historical term primarily used in the context of Isaac Newton's development of calculus. It refers specifically to Newton's method of \"fluxions\" (rates of change) and \"fluents\" (variables whose rates of change are being considered). The term is rarely used in modern mathematics, where \"calculus\" is the standard term. When encountered, it is almost always in discussions of the history of mathematics or physics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Modern engineers use influxionism to design bridges.","correct":"✓ Modern engineers use calculus to design bridges.","note":"\"Influxionism\" is an outdated term. Use \"calculus\" in modern contexts."},{"incorrect":"✗ Influxionism is a branch of algebra.","correct":"✓ Influxionism is an early form of calculus.","note":"Influxionism is related to calculus, not algebra."}],"priority":"★★☆"},"related_words":{"derivatives":["influxion (noun: a flowing in; Newton's term for a derivative or rate of change)","fluent (noun: Newton's term for a variable whose rate of change is being considered)","fluxion (noun: Newton's term for a derivative or rate of change)"],"related_terms":["calculus","differential calculus","integral calculus","Newtonian mechanics","Leibnizian calculus"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (very specialized vocabulary, primarily historical)","frequency_google_ngram":"Very low frequency. The term is rarely used outside of historical or academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"influxionism\" is highly specialized and primarily encountered in historical discussions of mathematics, specifically related to Isaac Newton's development of calculus. It is not part of the standard modern mathematical vocabulary. Understanding requires familiarity with the history of calculus and the contributions of Newton. If you are not studying the history of mathematics, you are unlikely to encounter this term. When it appears, it is usually in the context of comparing Newton's approach to that of Leibniz, who developed a different notation for calculus. The modern term for this field of mathematics is simply \"calculus.\""},"example_sentences":[{"sentence":"The development of influxionism by Newton was a major breakthrough in mathematical physics.","translation":"ニュートンによる流率法の開発は、数理物理学における大きな躍進だった。","type":"noun","meaning_category":"historical mathematics"},{"sentence":"Early applications of influxionism included calculating areas under curves and finding tangents to curves.","translation":"流率法の初期の応用には、曲線の下の面積の計算や曲線への接線の発見が含まれていた。","type":"noun","meaning_category":"historical mathematics"},{"sentence":"While Leibniz's notation for calculus is more widely used today, Newton's influxionism was crucial in the initial development of the field.","translation":"ライプニッツの微積分の記法は今日より広く使用されているが、ニュートンの流率法はこの分野の初期の開発において重要だった。","type":"noun","meaning_category":"historical mathematics"}]}