{"word":"nonreclamation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"不回収、非再生、非復元","english_definition":"The failure or refusal to reclaim something; the state of not being reclaimed.","examples":[{"sentence":"The nonreclamation of the land after mining caused significant environmental damage.","translation":"採掘後の土地の不回収は、重大な環境破壊を引き起こした。"},{"sentence":"Due to the cost, nonreclamation of the materials was the only option.","translation":"コストのために、材料の非再生が唯一の選択肢だった。"}],"collocations":["land nonreclamation","material nonreclamation","site nonreclamation"],"synonyms":["abandonment","disuse","neglect"],"antonyms":["reclamation","recovery","restoration"]}],"etymology":{"value":"'non-' (否定) + 'reclamation' (回収、再生、復元)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˌrɛkləˈmeɪʃən/","syllables":"non-rec-la-ma-tion"},"inflection":{"noun_plural":"nonreclamations"},"usage_notes":{"explanation":"'Nonreclamation' refers to a situation where something that could or should be reclaimed, recovered, or restored is not. This can apply to various contexts, such as land after mining, materials after use, or even abstract concepts like rights or identities. It emphasizes the absence of an effort to bring something back to a previous state or to reuse it.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonreclamation was a problem.","correct":"✓ The nonreclamation of the site was a problem.","note":"It's better to specify what is not being reclaimed for clarity."}],"priority":"★★☆"},"related_words":{"derivatives":["reclaim","reclamation"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nonreclamation' is a relatively uncommon term that describes the state of something not being reclaimed or restored. It's often used in environmental or industrial contexts to refer to the failure to recover or reuse resources or land. Understanding this term requires a good grasp of the prefix 'non-' and the root word 'reclamation.'"},"example_sentences":[{"sentence":"The company faced criticism for the widespread nonreclamation of its mining sites.","translation":"その会社は、採掘現場の広範囲にわたる不回収について批判に直面した。","type":"general","meaning_category":"不回収"},{"sentence":"The high cost of processing led to the nonreclamation of valuable metals from the waste stream.","translation":"処理コストが高いため、廃棄物から貴重な金属を再生することはできなかった。","type":"technical","meaning_category":"非再生"}]}