{"word":"phlegmatist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"冷静沈着な人、粘液質の人（古代医学における気質の一つ）","english_definition":"A person who has a phlegmatic temperament; a person who is calm, unemotional, and stolid.","examples":[{"sentence":"He was a phlegmatist, rarely showing any strong emotion.","translation":"彼は冷静沈着な人で、強い感情をほとんど表に出すことがなかった。"},{"sentence":"As a phlegmatist, she was well-suited to handle stressful situations with composure.","translation":"冷静沈着な性格だったので、彼女は落ち着いてストレスの多い状況に対処するのに適していた。"}],"collocations":["phlegmatic temperament","remain phlegmatic","typical phlegmatist"],"synonyms":["stoic","impassive person","calm individual","unemotional person"],"antonyms":["choleric","sanguine","melancholic"]}],"etymology":{"value":"Derived from 'phlegmatic,' which comes from the Greek word 'phlegma' meaning 'inflammation,' 'humor (bodily fluid),' or 'sluggishness.' In ancient medicine, phlegm was one of the four humors, and an excess of it was thought to cause a calm, unemotional temperament. The suffix '-ist' denotes a person who possesses or is characterized by the quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈflɛɡmətɪst/","syllables":"phleg-ma-tist"},"inflection":{"noun_plural":"phlegmatists"},"usage_notes":{"explanation":"The term 'phlegmatist' refers to a person whose temperament is characterized by calmness, lack of emotional expression, and a generally stolid demeanor. It is related to the ancient medical concept of the four humors, where an excess of phlegm was believed to cause this personality type. While the four humors theory is no longer scientifically valid, the term 'phlegmatic' and, by extension, 'phlegmatist' are still used to describe someone who is habitually calm and unemotional.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a very phlegmatic person, so he is a phlegmatist.","correct":"✓ He is a phlegmatic person; therefore, he can be described as a phlegmatist.","note":"While 'phlegmatic' describes the temperament, 'phlegmatist' is the noun referring to the person with that temperament. The first sentence is not grammatically incorrect, but the second is more precise."}],"priority":"★☆☆"},"related_words":{"derivatives":["phlegmatic (adjective: having a calm, unemotional disposition)","phlegm (noun: thick mucus in the respiratory passages)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Phlegmatist' is a relatively uncommon word that describes a person who is characteristically calm, unemotional, and not easily excited. It is derived from the older medical theory of humors, where phlegm was believed to influence temperament. Understanding this word requires a good vocabulary and familiarity with older concepts of personality. It is more likely to be encountered in literature or discussions of historical psychology.","priority":"★☆☆"},"example_sentences":[{"sentence":"The negotiator, a natural phlegmatist, remained calm even as tensions rose.","translation":"交渉人は生まれつき冷静沈着な性格で、緊張が高まる中でも冷静さを保った。","type":"noun","meaning_category":"calm person"},{"sentence":"As a true phlegmatist, she rarely displayed any outward signs of stress or worry.","translation":"真の冷静沈着な人として、彼女はストレスや心配を表に出すことはほとんどなかった。","type":"noun","meaning_category":"unemotional person"}]}