{"word":"enterprisingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"進取的に、企業家精神をもって、積極的に","english_definition":"in an enterprising manner; with initiative and willingness to undertake new or difficult projects.","examples":[{"sentence":"She enterprisingly sought out new clients for the company.","translation":"彼女は進取的に会社の新しい顧客を探し出した。"},{"sentence":"He enterprisingly developed a new product line that became very successful.","translation":"彼は企業家精神をもって新しい製品ラインを開発し、それが非常に成功した。"},{"sentence":"The students enterprisingly organized a fundraising event for the school.","translation":"学生たちは積極的に学校のための資金調達イベントを企画した。"}],"collocations":["act enterprisingly","approach enterprisingly","develop enterprisingly","organize enterprisingly","seek enterprisingly"],"synonyms":["resourcefully","innovatively","ambitiously","proactively","dynamically","creatively"],"antonyms":["passively","unimaginatively","unambitiously","indolently"]}],"etymology":{"value":"enterprising + -ly","priority":"★★☆"},"pronunciation":{"ipa":"/ˌentərˈpraɪzɪŋli/","syllables":"en-ter-pris-ing-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Enterprisingly' describes actions done with initiative, creativity, and a willingness to take risks to achieve a goal. It often implies a business or entrepreneurial context, but can also refer to any situation where someone shows initiative and resourcefulness.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He enterprisingly is working on a new project.","correct":"✓ He is working enterprisingly on a new project. / ✓ He is enterprisingly working on a new project.","note":"Adverbs of manner (like 'enterprisingly') are usually placed either after the verb or before the verb if there is an auxiliary verb. Placing it between the auxiliary and main verb is also acceptable, but less common."},{"incorrect":"✗ She showed enterprisingly in her approach.","correct":"✓ She showed an enterprising approach.","note":"'Enterprisingly' is an adverb and modifies verbs, adjectives, or other adverbs. To describe a noun (like 'approach'), use the adjective 'enterprising'."}],"priority":"★★☆"},"related_words":{"derivatives":["enterprising (adjective)","enterprise (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Enterprisingly' is an adverb that means doing something with initiative, creativity, and a willingness to take risks. It's used to describe how someone approaches a task or situation, highlighting their proactive and resourceful nature. This word is not commonly used in everyday conversation, making it suitable for advanced learners."},"example_sentences":[{"sentence":"The company **enterprisingly** adapted its business model to meet the changing market demands.","translation":"その会社は変化する市場の需要に対応するために、進取的にビジネスモデルを適応させた。","type":"adverb","meaning_category":"進取的に"},{"sentence":"He **enterprisingly** used social media to promote his small business.","translation":"彼は企業家精神をもってソーシャルメディアを使って彼の小さなビジネスを宣伝した。","type":"adverb","meaning_category":"企業家精神をもって"},{"sentence":"The team **enterprisingly** sought out partnerships to expand their reach.","translation":"チームは積極的にリーチを拡大するためにパートナーシップを探し求めた。","type":"adverb","meaning_category":"積極的に"}]}