{"word":"Phonelescope","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(SF) A fictional device for seeing and hearing distant events or people, often used in early science fiction.","english_definition":"A fictional device, commonly featured in early science fiction, that allows users to both see and hear events or people at a distance.","examples":[{"sentence":"In the old science fiction stories, people used phonelescopes to communicate across vast distances.","translation":"昔のSF小説では、人々はフォネレスコープを使って遠く離れた場所と通信していた。"},{"sentence":"The inventor claimed his phonelescope could show live images from other planets.","translation":"発明家は、彼のフォネレスコープが他の惑星からのライブ映像を表示できると主張した。"}],"collocations":["invent a phonelescope","use a phonelescope","look into a phonelescope","a fictional phonelescope"],"synonyms":["videophone","telescreen","viewscreen","communicator"],"antonyms":[]}],"etymology":{"value":"A portmanteau of 'phone' (from telephone, referring to sound) and 'telescope' (referring to seeing at a distance).","priority":"★★☆"},"pronunciation":{"ipa":"/foʊˈnɛləskoʊp/","syllables":"Pho-ne-le-scope"},"inflection":{"noun_plural":"phonelescopes"},"usage_notes":{"explanation":"'Phonelescope' is primarily a term found in older science fiction, often pre-dating the invention of real-world technologies like video conferencing. It represents an early vision of long-distance communication.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw her through my phonelescope last night.","correct":"✓ I saw her on a video call last night.","note":"Phonelescope is a fictional device, so real-world scenarios should use modern terms like 'video call'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_concepts":["telephone","telescope","videophone","science fiction","futuristic technology"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (not a standard English word)","frequency_google_ngram":"Very low frequency (primarily found in science fiction literature)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Phonelescope' is a specialized term primarily encountered in science fiction contexts. Understanding it requires familiarity with the genre and the concept of futuristic communication devices. It is not part of everyday vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The protagonist in the novel used a phonelescope to spy on his enemies.","translation":"小説の主人公は、フォネレスコープを使って敵をスパイした。","type":"general","meaning_category":"fictional device"},{"sentence":"Early science fiction writers often imagined a world filled with phonelescopes and flying cars.","translation":"初期のSF作家は、フォネレスコープと空飛ぶ車で満たされた世界を想像することが多かった。","type":"historical context","meaning_category":"fictional device"}]}