{"word":"hypochrosis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(病理学)低色素症：組織または細胞における色素の減少、特に赤血球におけるヘモグロビンの減少。","english_definition":"(pathology) A condition of abnormally low pigmentation, especially of red blood cells, indicating a decreased concentration of hemoglobin.","examples":[{"sentence":"Hypochrosis in red blood cells can be indicative of iron deficiency anemia.","translation":"赤血球における低色素症は、鉄欠乏性貧血の兆候である可能性がある。"}],"collocations":["red blood cell hypochrosis","severe hypochrosis","mild hypochrosis"],"synonyms":["hypopigmentation","achromia"],"antonyms":["hyperchromia","hypermelanosis"]}],"etymology":{"value":"ギリシャ語の「hypo-」（下、不足）と「chroma」（色）に由来。","priority":"★★★"},"pronunciation":{"ipa":"/ˌhaɪpoʊˈkroʊsɪs/","syllables":"hy-po-chro-sis"},"inflection":{"noun_plural":"hypochroses"},"usage_notes":{"explanation":"Hypochrosis is primarily a medical term used in pathology to describe the reduced coloration of cells or tissues. It is most commonly associated with red blood cells and is a key feature in diagnosing certain types of anemia.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor diagnosed him with hypochromia.","correct":"✓ The doctor diagnosed hypochrosis in his red blood cells.","note":"Hypochromia is a related term and describes the state of being hypochromic, while hypochrosis is the condition or process. The terms are closely related but not interchangeable."}],"priority":"★★☆"},"related_words":{"derivatives":["hypochromic (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学・病理学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Hypochrosis is a technical term used in the field of medicine, specifically in pathology and hematology. It refers to the condition where cells or tissues, particularly red blood cells, exhibit a lower than normal level of pigmentation. This is often due to a reduced concentration of hemoglobin. Understanding this term requires a background in biology or medicine. It's not a word commonly used in everyday conversation.","priority":"★★★"},"example_sentences":[{"sentence":"Microscopic examination revealed marked hypochrosis in the patient's erythrocytes.","translation":"顕微鏡検査により、患者の赤血球に著しい低色素症が認められた。","type":"noun","meaning_category":"医学"},{"sentence":"Hypochrosis is a common finding in iron deficiency anemia.","translation":"低色素症は鉄欠乏性貧血でよく見られる所見である。","type":"noun","meaning_category":"医学"}]}