{"word":"slant-eye","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"つり目、(侮蔑的に)アジア人","english_definition":"(derogatory) A person of Asian descent, especially one with eyes that appear to slant upwards.","examples":[{"sentence":"He was called 'slant-eye' in the playground.","translation":"彼は遊び場で「つり目」と呼ばれた。"},{"sentence":"The term 'slant-eye' is considered a racial slur.","translation":"「つり目」という言葉は人種差別的な中傷とみなされている。"}],"collocations":[],"synonyms":["chink","gook","yellow","oriental (offensive)"],"antonyms":[],"usage_notes":"This term is highly offensive and should not be used. It is a derogatory term used to insult people of Asian descent by mocking their perceived physical characteristics."},{"part_of_speech":"adjective","definition":"つり目の、(侮蔑的に)アジア人に対する","english_definition":"(derogatory) Having eyes that appear to slant upwards; relating to or characteristic of people of Asian descent.","examples":[{"sentence":"The cartoon depicted the character with slant-eye features.","translation":"その漫画は、つり目の特徴を持つキャラクターを描いていた。"},{"sentence":"The slant-eye stereotype is harmful and inaccurate.","translation":"つり目というステレオタイプは有害で不正確だ。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term refers to the perceived slanting shape of the eyes of some people of Asian descent. It is considered a derogatory term because it is used to mock and dehumanize people based on their physical appearance.","priority":"★★★"},"pronunciation":{"ipa":"/ˈslænt aɪ/","syllables":"slant-eye"},"inflection":{},"usage_notes":{"explanation":"The term 'slant-eye' is a highly offensive and derogatory term used to describe people of Asian descent. It is considered a racial slur and should never be used. The term is based on a perceived physical characteristic and is used to mock and dehumanize people. Using this term can cause significant harm and offense.","priority":"★★★"},"common_mistakes":{},"related_words":{},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term 'slant-eye' is a highly offensive racial slur used to denigrate people of Asian descent. It is important to recognize this term as harmful and avoid using it under any circumstances. The term perpetuates harmful stereotypes and contributes to discrimination and prejudice."},"example_sentences":[{"sentence":"(offensive) He used a **slant-eye** gesture to mock the tourist.","translation":"(侮辱的) 彼は観光客を嘲笑するために、つり目のジェスチャーを使った。","type":"example","meaning_category":"offensive"}]}