{"word":"Mata-Mata","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"マタマタ (カメの一種)","english_definition":"A South American freshwater turtle (Chelus fimbriata) characterized by a large, flattened head and neck covered in fringes and flaps of skin.","examples":[{"sentence":"The mata-mata turtle's unique appearance helps it blend in with its surroundings.","translation":"マタマタのユニークな外見は、周囲の環境に溶け込むのに役立ちます。"},{"sentence":"Mata-matas are ambush predators, waiting for fish to swim close before striking.","translation":"マタマタは待ち伏せ型の捕食者で、魚が近づいてくるのを待ってから攻撃します。"}],"collocations":["mata-mata turtle","Chelus fimbriata","freshwater turtle","ambush predator"],"synonyms":["Chelus fimbriata"],"antonyms":[]},{"part_of_speech":"noun","definition":"(比喩的に) 隠れて待ち伏せする人","english_definition":"(figuratively) A person who hides and waits to ambush someone.","examples":[{"sentence":"The detective acted like a mata-mata, patiently observing the suspect's movements.","translation":"刑事はマタマタのように、辛抱強く容疑者の動きを観察しました。"}],"collocations":["act like a mata-mata","wait like a mata-mata"],"synonyms":["ambusher","lurker"],"antonyms":[]}],"etymology":{"value":"The name \"mata-mata\" is believed to be of indigenous origin, possibly from a local language in South America where the turtle is found. The exact meaning and origin are not definitively known.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɑːtəˈmɑːtə/","syllables":"Ma-ta-Ma-ta"},"inflection":{"noun_plural":"mata-matas"},"usage_notes":{"explanation":"The term \"mata-mata\" primarily refers to the turtle species *Chelus fimbriata*. The figurative use of the term to describe someone who ambushes is less common.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a mata-mata in the ocean.","correct":"✓ I saw a mata-mata in the river.","note":"Mata-matas are freshwater turtles, so they are found in rivers and swamps, not in the ocean."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Mata-mata\" is a specialized term referring to a specific species of South American freshwater turtle. Its usage is generally limited to scientific or zoological contexts, or when discussing the wildlife of the Amazon basin. The figurative use of the term is rare and would require a clear context to be understood. Due to its specific nature and limited usage, it is not considered part of the general English vocabulary."},"example_sentences":[{"sentence":"The **mata-mata** turtle is a master of camouflage.","translation":"マタマタはカモフラージュの名人です。","type":"noun","meaning_category":"turtle"},{"sentence":"The spy was a **mata-mata**, waiting for the perfect moment to strike.","translation":"スパイはマタマタのように、完璧な瞬間を待っていました。","type":"noun","meaning_category":"figurative"}]}