{"word":"mystagogue","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(古代ギリシャの密儀宗教における) 入門者への秘儀伝授者、指導者","english_definition":"A person who instructs others in religious mysteries or initiates others into a secret cult; an interpreter of mystical principles or beliefs.","examples":[{"sentence":"The mystagogue guided the initiates through the sacred rituals.","translation":"秘儀伝授者は、入門者たちを神聖な儀式へと導いた。"},{"sentence":"He served as a mystagogue, revealing the hidden meanings of the ancient texts.","translation":"彼は秘儀伝授者として、古代文書に隠された意味を明らかにした。"}],"collocations":["religious mystagogue","ancient mystagogue","spiritual mystagogue"],"synonyms":["initiator","hierophant","guru","teacher","spiritual guide"],"antonyms":["neophyte","initiate","novice"]}],"etymology":{"value":"From Ancient Greek μῠσταγωγός (mustagōgós), from μύστης (mústēs, “initiate”) + ἀγωγός (agōgós, “leader, guide”).","priority":"★★☆"},"pronunciation":{"ipa":"ˈmɪstəˌɡɔɡ","syllables":"mis-ta-gogue"},"inflection":{"noun_plural":"mystagogues"},"usage_notes":{"explanation":"The term \"mystagogue\" refers to someone who guides others through religious mysteries or initiates them into a cult. It can also refer to someone who interprets mystical principles or beliefs. The word is often used in the context of ancient Greek mystery religions but can also be applied to other contexts where secret knowledge or initiation is involved.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He was a mystagogue of science.","correct":"He was a proponent/expert of science.","note":"Mystagogue is generally used in a religious or mystical context, not in science."}],"priority":"★☆☆"},"related_words":{"derivatives":["mystagogy (n.)"],"related_terms":["mystery","mystical","initiation"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"mystagogue\" is a relatively rare and specialized term, primarily used in historical or religious contexts to describe someone who initiates others into religious mysteries or interprets mystical beliefs. Understanding the word requires familiarity with concepts of initiation, secret knowledge, and ancient religious practices. Due to its limited usage and specialized meaning, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"In the Eleusinian Mysteries, the mystagogue played a crucial role in guiding the initiates.","translation":"エレウシスの秘儀において、秘儀伝授者は入門者を導く上で重要な役割を果たした。","type":"noun","meaning_category":"religious initiation"},{"sentence":"The author presented himself as a mystagogue, revealing the supposed secrets of the universe.","translation":"著者は自身を秘儀伝授者として提示し、宇宙の秘密とされるものを明らかにした。","type":"noun","meaning_category":"interpreter of mystical beliefs"}]}