{"word":"Lutheranize","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"ルター派に改宗させる、ルター派の教義を広める","english_definition":"To convert to or bring under the influence of Lutheranism; to imbue with Lutheran principles.","examples":[{"sentence":"The missionaries attempted to Lutheranize the indigenous population.","translation":"宣教師たちは先住民をルター派に改宗させようと試みた。"},{"sentence":"The region was Lutheranized during the Reformation.","translation":"その地域は宗教改革の間にルター派化された。"}],"collocations":["Lutheranize a population (住民をルター派化する)","Lutheranize the church (教会をルター派化する)"],"synonyms":["convert to Lutheranism","reform","proselytize"],"antonyms":["Catholicize","Orthodoxize"]},{"part_of_speech":"verb","transitivity":"vi","definition":"ルター派に改宗する","english_definition":"To become Lutheran.","examples":[{"sentence":"Many people chose to Lutheranize during the Reformation.","translation":"多くの人々が宗教改革の間にルター派に改宗することを選んだ。"}],"collocations":["Lutheranize from Catholicism (カトリックからルター派に改宗する)"],"synonyms":["convert to Lutheranism"],"antonyms":["Catholicize","Orthodoxize"]}],"etymology":{"value":"Lutheran + -ize.  From the proper noun 'Lutheran', referring to Martin Luther and his theological doctrines, combined with the suffix '-ize', indicating a process of becoming or converting to.","priority":"★★★"},"pronunciation":{"ipa":"/ˈluːθəraɪz/","syllables":"Lu-ther-an-ize"},"inflection":{"verb_forms":{"present_simple":["Lutheranize","Lutheranizes"],"past_simple":"Lutheranized","past_participle":"Lutheranized","present_participle":"Lutheranizing"}},"usage_notes":{"explanation":"'Lutheranize' refers to the process of converting individuals or communities to Lutheranism, a major branch of Protestant Christianity based on the teachings of Martin Luther. It can also refer to the act of infusing something with Lutheran principles or characteristics. The term is most often used in historical or religious contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He Lutheranized the building.","correct":"✓ He Lutheranized the community.","note":"'Lutheranize' typically refers to converting people or institutions, not physical structures. While you could theoretically 'Lutheranize' a church by changing its doctrines, it's not commonly used for buildings. "},{"incorrect":"✗ They are Lutheranizing.","correct":"✓ They are converting to Lutheranism.","note":"While grammatically correct, 'They are Lutheranizing' is less common than 'They are converting to Lutheranism' or 'They are becoming Lutheran'. The latter are more natural ways to express the action of converting."}],"priority":"★★☆"},"related_words":{"derivatives":["Lutheran (noun, adjective)","Lutheranism (noun)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency. The term is specific to religious and historical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Lutheranize' is a specialized term primarily used in religious or historical contexts to describe the process of converting to or instilling the principles of Lutheranism. It requires familiarity with the history of the Reformation and the theological distinctions of Lutheranism. Due to its specific and somewhat technical nature, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The king sought to Lutheranize his kingdom to break from papal authority.","translation":"王はローマ教皇の権威から脱却するために、王国をルター派化しようとした。","type":"verb","meaning_category":"改宗させる"},{"sentence":"Over time, the village Lutheranized, adopting the new Protestant faith.","translation":"時が経つにつれて、その村はルター派化し、新しいプロテスタントの信仰を採用した。","type":"verb","meaning_category":"改宗する"}]}