{"word":"Whample","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(rare, dialectal) To walk clumsily or heavily; to waddle.","english_definition":"To walk clumsily or heavily; to waddle.","examples":[{"sentence":"He whampled down the street, his arms swinging wildly.","translation":"彼は腕を大きく振りながら、通りをよたよたと歩いた。"},{"sentence":"The child whampled around in his oversized boots.","translation":"子供は大きすぎるブーツを履いてよたよたと歩き回った。"}],"collocations":["whample along","whample down","whample around"],"synonyms":["waddle","lumber","stumble","trudge"],"antonyms":[]},{"part_of_speech":"noun","definition":"(rare, dialectal) A clumsy or heavy walk; a waddle.","english_definition":"A clumsy or heavy walk; a waddle.","examples":[{"sentence":"He had a peculiar whample that made everyone stare.","translation":"彼には奇妙なよたよた歩きがあり、誰もが見つめた。"},{"sentence":"The bear's whample was comical to watch.","translation":"熊のよたよた歩きは見ていて滑稽だった。"}],"collocations":[],"synonyms":["waddle","lumbering gait"],"antonyms":[]}],"etymology":{"value":"Origin uncertain; possibly related to 'wamble' (to move unsteadily) or a blend of 'whack' and 'trample'. Primarily found in regional dialects of English.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈwæmpəl/","syllables":"Wham-ple"},"inflection":{"verb_forms":{"present_simple":["whample","whamples"],"past_simple":"whampled","past_participle":"whampled","present_participle":"whampling"},"noun_plural":"whamples"},"usage_notes":{"explanation":"'Whample' is a rare and somewhat humorous word, primarily found in regional dialects. It describes a heavy, clumsy, or unsteady way of walking, similar to a waddle. It is not in common usage and may not be understood by all English speakers.","priority":"★☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["whampler (noun: someone who whamples)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (not in common usage)","frequency_google_ngram":"Very low frequency; primarily found in dialectal texts.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Whample' is a rare dialectal term, primarily used to describe a clumsy or heavy way of walking. Due to its infrequent usage, it is unlikely to be encountered in standard English. Understanding this word requires familiarity with regional dialects and a strong vocabulary. It is more likely to be found in literature that aims to capture the nuances of specific regional speech patterns."},"example_sentences":[{"sentence":"The old man whampled across the room, leaning heavily on his cane.","translation":"老人は杖に大きく寄りかかりながら、部屋をよたよたと横切った。","type":"verb","meaning_category":"clumsy walk"},{"sentence":"The penguin's whample was endearing to the children watching.","translation":"ペンギンのよたよた歩きは、見ている子供たちにとって愛らしかった。","type":"noun","meaning_category":"clumsy walk"}]}