{"word":"dysbarism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"潜水病、減圧症","english_definition":"A medical condition resulting from changes in ambient pressure; decompression sickness.","examples":[{"sentence":"Divers are at risk of dysbarism if they ascend too quickly.","translation":"ダイバーは、浮上速度が速すぎると潜水病のリスクがある。"},{"sentence":"Symptoms of dysbarism can include joint pain, dizziness, and paralysis.","translation":"潜水病の症状には、関節痛、めまい、麻痺などがある。"}],"collocations":["decompression dysbarism","arterial gas embolism dysbarism"],"synonyms":["decompression sickness","the bends","caisson disease"],"antonyms":[]},{"part_of_speech":"noun","definition":"高山病","english_definition":"Medical problems resulting from changes in ambient pressure at high altitude.","examples":[{"sentence":"Climbers can experience dysbarism due to the reduced air pressure at high altitudes.","translation":"登山者は高地での気圧低下により、高山病を経験することがある。"},{"sentence":"Symptoms of altitude-related dysbarism include headache, nausea, and fatigue.","translation":"高山病に関連する潜水病の症状には、頭痛、吐き気、疲労などがある。"}],"collocations":["altitude dysbarism"],"synonyms":["altitude sickness","mountain sickness"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek roots 'dys-' (meaning bad or difficult) and 'baros' (meaning weight or pressure), combined with the suffix '-ism' (denoting a condition or state).","priority":"★★☆"},"pronunciation":{"ipa":"/dɪsˈbɛərɪzəm/","syllables":"dis-bar-ism"},"inflection":{"noun_plural":"dysbarisms"},"usage_notes":{"explanation":"Dysbarism is a general term for medical conditions caused by changes in ambient pressure. It is most commonly associated with diving (decompression sickness) and high-altitude climbing (altitude sickness). The specific symptoms and treatments vary depending on the type and severity of the condition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has dysbarism because he is stressed.","correct":"✓ He has dysbarism because he ascended too quickly while diving.","note":"Dysbarism is caused by pressure changes, not stress."},{"incorrect":"✗ Dysbarism is a contagious disease.","correct":"✓ Dysbarism is a condition caused by pressure changes.","note":"Dysbarism is not contagious."}],"priority":"★★☆"},"related_words":{"derivatives":["dysbaric (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Dysbarism is a technical term used in medicine and physiology to describe conditions caused by changes in ambient pressure. It is most relevant in the context of diving and high-altitude activities. Understanding this term requires a background in these areas or medical knowledge.","priority":"★☆☆"},"example_sentences":[{"sentence":"The pilot experienced dysbarism due to the rapid decompression of the aircraft.","translation":"パイロットは航空機の急速な減圧により、潜水病を経験した。","type":"noun","meaning_category":"減圧症"},{"sentence":"Proper acclimatization can help prevent dysbarism at high altitudes.","translation":"適切な順応は、高地での潜水病の予防に役立つ。","type":"noun","meaning_category":"高山病"}]}