{"word":"capital-derived","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"資本に由来する、資本から派生した","english_definition":"Obtained or originating from capital, especially financial capital.","examples":[{"sentence":"The company's capital-derived income was reinvested in research and development.","translation":"その会社の資本から得られた収入は、研究開発に再投資された。"},{"sentence":"Capital-derived assets are subject to different tax regulations.","translation":"資本から派生した資産は、異なる税制規制の対象となる。"}],"collocations":["capital-derived income (資本から得られた収入)","capital-derived assets (資本から派生した資産)","capital-derived investment (資本から派生した投資)"],"synonyms":["investment-based","asset-based","finance-related"],"antonyms":["labor-derived","resource-derived","consumption-derived"]}],"etymology":{"value":"The term is formed by combining 'capital' (referring to financial assets or resources) and 'derived' (meaning obtained or originating from a source).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkæpɪtəl dɪˈraɪvd/","syllables":"cap-i-tal de-rived"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Capital-derived' is typically used in financial, economic, or accounting contexts to describe something that originates from or is based on capital assets. It is used to differentiate from other sources of income or value, such as labor or natural resources.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The capital-derived of the project was very high.","correct":"✓ The capital required for the project was very high.","note":"'Capital-derived' is an adjective, so it modifies a noun. 'Capital' itself can be used as a noun to refer to the funds needed for a project."},{"incorrect":"✗ The company is capital-derived.","correct":"✓ The company's income is capital-derived.","note":"'Capital-derived' describes the source of something, not the company itself. The company *receives* capital-derived income or has capital-derived assets."}],"priority":"★★☆"},"related_words":{"derivatives":["capital (noun)","derive (verb)","derivative (noun/adjective)"],"phrases":["capital gains","capital investment","return on capital"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - primarily used in specialized financial or economic discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Capital-derived' is a technical term used in finance and economics. It describes something that comes from capital, which usually means money or assets used for investment. This term is not commonly used in everyday conversation and is more likely to be found in financial reports, academic papers, or business discussions. Understanding this term requires knowledge of basic economic concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The fund's capital-derived returns exceeded market expectations.","translation":"そのファンドの資本から得られた収益は、市場の予想を上回った。","type":"adjective","meaning_category":"Finance"},{"sentence":"The company relies heavily on capital-derived revenue to fund its expansion.","translation":"その会社は、事業拡大の資金を資本から得られる収益に大きく依存している。","type":"adjective","meaning_category":"Business"},{"sentence":"Capital-derived wealth can perpetuate economic inequality if not properly managed.","translation":"資本から派生した富は、適切に管理されない場合、経済的不平等を永続させる可能性がある。","type":"adjective","meaning_category":"Economics"}]}