{"word":"perpetuation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"永続化、存続、固定化","english_definition":"the act of causing something to continue indefinitely; the act of preserving something valued from oblivion or change.","examples":[{"sentence":"The perpetuation of stereotypes can have harmful effects.","translation":"固定観念の永続化は有害な影響を及ぼす可能性がある。"},{"sentence":"The perpetuation of the family name was his primary concern.","translation":"家名の存続が彼の主な関心事だった。"},{"sentence":"They are working towards the perpetuation of traditional crafts.","translation":"彼らは伝統工芸の存続に向けて活動している。"}],"collocations":["perpetuation of a myth (神話の永続化)","perpetuation of a stereotype (固定観念の永続化)","perpetuation of a tradition (伝統の存続)","perpetuation of power (権力の固定化)","self-perpetuation (自己永続化)"],"synonyms":["continuation","preservation","maintenance","prolongation","preservation","conservation"],"antonyms":["cessation","termination","abolition","extinction"]}],"etymology":{"value":"late Middle English: from late Latin perpetuatio(n-), from perpetuare ‘make perpetual’, from perpetuus ‘continuous’ (see perpetual).","priority":"★★☆"},"pronunciation":{"ipa":"/pərˌpetʃuˈeɪʃən/","syllables":"per-pet-u-a-tion"},"inflection":{"noun_plural":"perpetuations"},"usage_notes":{"explanation":"\"Perpetuation\" refers to the act of making something continue for a long or unlimited time. It often implies a conscious effort to maintain or preserve something, such as a tradition, belief, or system. It can also refer to the continuation of something negative, like a stereotype or inequality.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The perpetuation of the problem was solved by the new policy.","correct":"✓ The perpetuation of the problem was prevented by the new policy.","note":"\"Perpetuation\" refers to the continuation of something, not the solution to a problem. Use \"prevention\" or a similar word to indicate stopping the problem from continuing."},{"incorrect":"✗ He was responsible for the perpetuation of the building.","correct":"✓ He was responsible for the maintenance of the building.","note":"While \"perpetuation\" can imply maintaining something, it's more commonly used for abstract concepts or traditions. For physical objects like buildings, \"maintenance\" or \"preservation\" are more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["perpetuate (verb: 永続させる、存続させる)","perpetual (adjective: 永続的な、絶え間ない)","perpetually (adverb: 永続的に、絶え間なく)"],"phrasal_verbs":[],"related_concepts":["legacy","inheritance","sustainability","conservation","preservation"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"perpetuation\" is a formal term that means to cause something to continue for a long time. It's often used in discussions about social issues, traditions, or systems that people want to maintain or change. Because it's a more advanced word, it's not commonly used in everyday conversation, but it's important to understand its meaning when reading academic or journalistic texts."},"example_sentences":[{"sentence":"The museum is dedicated to the perpetuation of local history.","translation":"その博物館は、地域の歴史の永続化に尽力している。","type":"general","meaning_category":"preservation of culture"},{"sentence":"The perpetuation of poverty is a complex social problem.","translation":"貧困の永続化は複雑な社会問題だ。","type":"social issue","meaning_category":"continuation of negative conditions"},{"sentence":"The company's success relies on the perpetuation of its brand image.","translation":"その会社の成功は、ブランドイメージの永続化にかかっている。","type":"business","meaning_category":"maintenance of brand"}]}