{"word":"Uni-modal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"単一の様式による、単一のモダリティの","english_definition":"Relating to or using only one mode or modality.","examples":[{"sentence":"The system uses a uni-modal input, relying solely on voice commands.","translation":"そのシステムは音声コマンドのみに依存する単一様式の入力を利用している。"},{"sentence":"A uni-modal distribution has only one peak.","translation":"単峰性の分布はピークを一つしか持たない。"}],"collocations":["uni-modal input","uni-modal distribution","uni-modal data"],"synonyms":["single-modal"],"antonyms":["multi-modal","bi-modal"]},{"part_of_speech":"adjective","definition":"統計学において、単峰性の","english_definition":"(Statistics) Having only one mode.","examples":[{"sentence":"The data exhibits a clear uni-modal pattern.","translation":"そのデータは明確な単峰性のパターンを示す。"}],"collocations":["uni-modal distribution"],"synonyms":["single-peaked"],"antonyms":["multi-modal","bi-modal"]}],"etymology":{"value":"'Uni-' (one) + 'modal' (relating to a mode or modality).","priority":"★★★"},"pronunciation":{"ipa":"/ˌjuːnɪˈmoʊdl/","syllables":"U-ni-mo-dal"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"The term 'uni-modal' is used in various fields to describe something that involves or exhibits only one mode or modality. In the context of human-computer interaction, it refers to systems that rely on a single type of input (e.g., voice or touch). In statistics, it describes distributions with a single peak.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The uni-modal system used both audio and video.","correct":"✓ The multi-modal system used both audio and video.","note":"Uni-modal means single mode, so using both audio and video would be multi-modal."}],"priority":"★★☆"},"related_words":{"derivatives":["unimodality (noun)"],"phrasal_verbs":[],"related_terms":["mode","modality","multi-modal","bi-modal"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Uni-modal' is a technical term used to describe something that operates in or exhibits only one mode or modality. It is often used in the context of data analysis (e.g., a uni-modal distribution) or human-computer interaction (e.g., a uni-modal input system). The prefix 'uni-' indicates 'one', and 'modal' refers to a particular mode or way of doing something. Understanding this term requires familiarity with the concept of modes and modalities within a specific field."},"example_sentences":[{"sentence":"The study focused on the effectiveness of uni-modal learning strategies.","translation":"その研究は単一様式の学習戦略の有効性に焦点を当てた。","type":"adjective","meaning_category":"単一の様式による"},{"sentence":"The histogram showed a clear uni-modal distribution, indicating a central tendency in the data.","translation":"ヒストグラムは明確な単峰性の分布を示し、データに中心傾向があることを示していた。","type":"adjective","meaning_category":"統計学において、単峰性の"}]}