{"word":"kleptic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"窃盗癖のある、盗み癖のある","english_definition":"relating to or characterized by kleptomania.","examples":[{"sentence":"The kleptic patient was caught stealing again.","translation":"その窃盗癖のある患者は再び盗みを働いているところを捕まった。"},{"sentence":"Her kleptic tendencies caused her a lot of trouble.","translation":"彼女の盗み癖は彼女に多くの問題を引き起こした。"}],"collocations":["kleptic behavior","kleptic tendencies","kleptic patient"],"synonyms":["kleptomaniac","thieving","pilfering"],"antonyms":["honest","non-thieving"]}],"etymology":{"value":"Derived from 'kleptomania', a word coined in German in the early 19th century from Greek 'kleptes' (thief) + 'mania' (madness).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈklɛptɪk/","syllables":"klep-tic"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be used in comparative and superlative forms (more kleptic, most kleptic)."},"usage_notes":{"explanation":"'Kleptic' is used to describe someone who has a tendency to steal, often due to a psychological condition known as kleptomania. It is less commonly used than 'kleptomaniac', which is a noun referring to a person with kleptomania. The adjective 'kleptic' directly describes the behavior or tendencies related to this condition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a kleptic.","correct":"✓ He is kleptomaniac. / ✓ He has kleptic tendencies.","note":"'Kleptic' is an adjective, not a noun. Use 'kleptomaniac' as a noun or rephrase to use 'kleptic' as an adjective."},{"incorrect":"✗ She was kleptic the money.","correct":"✓ She stole the money. / ✓ She exhibited kleptic behavior.","note":"'Kleptic' describes a characteristic or tendency, not the act of stealing itself. Use 'steal' or rephrase to describe the behavior."}],"priority":"★★☆"},"related_words":{"derivatives":["kleptomania (名詞: 窃盗症)","kleptomaniac (名詞: 窃盗症患者、窃盗癖のある人)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Kleptic' is a relatively uncommon adjective used to describe something related to or characterized by kleptomania, a mental disorder involving an impulse to steal. It's more frequently encountered in medical or psychological contexts when discussing the symptoms or behaviors associated with this condition. A more common term to describe a person with this condition is 'kleptomaniac'. Understanding the distinction between the adjective 'kleptic' and the noun 'kleptomaniac' is important for precise language use in these contexts."},"example_sentences":[{"sentence":"The doctor suspected the patient's actions were due to a kleptic impulse.","translation":"医師は患者の行動が窃盗衝動によるものだと疑った。","type":"adjective","meaning_category":"窃盗癖のある"},{"sentence":"The kleptic nature of her actions was evident in the lack of need for the stolen items.","translation":"彼女の行動の窃盗癖的な性質は、盗まれた品物が必要とされていないことから明らかだった。","type":"adjective","meaning_category":"盗み癖のある"}]}