{"word":"Hindi","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"ヒンディー語","english_definition":"An Indo-Aryan language spoken in northern India and parts of Pakistan. It is one of the official languages of India.","examples":[{"sentence":"Hindi is spoken by millions of people in India.","translation":"ヒンディー語はインドで何百万人もの人々によって話されています。"},{"sentence":"She is learning Hindi to better communicate with her family.","translation":"彼女は家族とのコミュニケーションをより良くするためにヒンディー語を学んでいます。"}],"collocations":["learn Hindi","speak Hindi","Hindi language","Hindi film","Hindi literature"],"synonyms":["Hindustani"],"antonyms":[]},{"part_of_speech":"adjective","definition":"ヒンディー語の、ヒンディー語に関する","english_definition":"Relating to Hindi language or the Hindi-speaking people.","examples":[{"sentence":"This is a Hindi movie with English subtitles.","translation":"これは英語字幕付きのヒンディー語映画です。"},{"sentence":"He has a good command of Hindi grammar.","translation":"彼はヒンディー語の文法に精通しています。"}],"collocations":["Hindi film industry","Hindi grammar","Hindi literature","Hindi songs"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Persian hindī (هندی), meaning 'of or belonging to Hind (India)'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈhɪndi/","syllables":"Hin-di"},"inflection":{"noun_plural":"Hindis"},"usage_notes":{"explanation":"Hindi is one of the two official languages of the Union government of India, the other being English. It is widely spoken in the northern and central parts of India. While Hindi and Urdu share a common colloquial base known as Hindustani, they diverge in formal vocabulary; Hindi draws more heavily on Sanskrit, while Urdu incorporates more Persian and Arabic words.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I speak Hindu.","correct":"✓ I speak Hindi.","note":"'Hindu' refers to a follower of Hinduism, while 'Hindi' is the language."},{"incorrect":"✗ Hindi is a very easy language to learn, isn't it?","correct":"✓ Hindi is a very easy language to learn, isn't it?","note":"While opinions on language difficulty vary, this is a subjective statement and not grammatically incorrect."}],"priority":"★★☆"},"related_words":{"derivatives":["Hindustani (noun/adjective): A common colloquial language base shared by Hindi and Urdu.","Hindi belt (noun): The region in India where Hindi is widely spoken."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Relatively common, especially in contexts related to India and language learning.","priority":"★★☆"},"readability_explanation":{"level":"B1","text":"'Hindi' is a word that refers to a language spoken in India. It's like saying 'English' or 'Spanish'. You can use it to say you speak Hindi, or that something is in Hindi, like a Hindi movie. It's a common word when talking about India and its culture."},"example_sentences":[{"sentence":"Many Bollywood movies are made in Hindi.","translation":"多くのボリウッド映画はヒンディー語で作られています。","type":"adjective","meaning_category":"Language"},{"sentence":"Do you know how to speak Hindi?","translation":"あなたはヒンディー語を話せますか？","type":"noun","meaning_category":"Language"},{"sentence":"She is taking a Hindi class at the community center.","translation":"彼女はコミュニティセンターでヒンディー語のクラスを受講しています。","type":"noun","meaning_category":"Language"},{"sentence":"The sign was written in both English and Hindi.","translation":"標識は英語とヒンディー語の両方で書かれていました。","type":"adjective","meaning_category":"Language"}]}