{"word":"eclogue","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"牧歌、田園詩","english_definition":"a short poem, especially a pastoral poem, in the form of a dialogue or soliloquy.","examples":[{"sentence":"Virgil's Eclogues are famous examples of pastoral poetry.","translation":"ウェルギリウスの牧歌は、田園詩の有名な例です。"},{"sentence":"The eclogue featured shepherds exchanging verses.","translation":"その牧歌は、羊飼いたちが詩を交換する様子を描いていた。"}],"collocations":["pastoral eclogue","write an eclogue","read eclogues"],"synonyms":["pastoral","idyll","bucolic","poem","verse"],"antonyms":[]}],"etymology":{"value":"From Latin ecloga, from Ancient Greek ἐκλογή (eklogḗ, \"selection\"), from ἐκλέγω (eklégō, \"I pick out, select\"), from ἐκ (ek, \"out\") + λέγω (légō, \"I say, speak\"). Originally, the term referred to a selection of poems, but it later became associated with pastoral themes.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛklɒɡ/","syllables":"ec-logue","audio_url":null},"inflection":{"noun_plural":"eclogues"},"usage_notes":{"explanation":"An eclogue is a specific type of poem, typically featuring shepherds or rural settings. It often involves dialogues or soliloquies and explores themes of love, nature, or simple life. The term is relatively uncommon in modern English outside of literary contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wrote a eclogue about the city.","correct":"✓ He wrote an eclogue about the countryside.","note":"Eclogues are traditionally set in rural or pastoral settings, not urban environments."}],"priority":"★☆☆"},"related_words":{"derivatives":["eclogist"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 文学研究や詩に関する文脈でのみ使われる。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'eclogue' is a specialized term used in literary studies to refer to a specific type of pastoral poem. It is not commonly used in everyday language. Understanding the term requires familiarity with classical literature and poetic forms."},"example_sentences":[{"sentence":"The professor lectured on the history of the eclogue in Western literature.","translation":"教授は西洋文学における牧歌の歴史について講義した。","type":"noun","meaning_category":"牧歌、田園詩"},{"sentence":"Spenser's 'Shepheardes Calender' is a collection of twelve eclogues.","translation":"スペンサーの『羊飼いの暦』は12の牧歌を集めたものである。","type":"noun","meaning_category":"牧歌、田園詩"}]}