{"word":"head-shaking","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"首を横に振ること、首振り","english_definition":"The act of shaking one's head from side to side, typically to indicate disapproval, disagreement, disbelief, or negation.","examples":[{"sentence":"There was much head-shaking among the audience after the politician's controversial statement.","translation":"政治家の物議を醸す発言の後、聴衆の間では首を横に振る人が多かった。"},{"sentence":"His head-shaking indicated that he didn't believe a word I was saying.","translation":"彼の首振りは、私が言っていることを全く信じていないことを示していた。"},{"sentence":"With a slight head-shaking, she expressed her disappointment.","translation":"わずかに首を振って、彼女は落胆を表明した。"}],"collocations":["slow head-shaking (ゆっくりとした首振り)","vigorous head-shaking (激しい首振り)","perplexed head-shaking (困惑した首振り)","disapproving head-shaking (不承認の首振り)"],"synonyms":["shaking one's head","negative head movement","disapproving gesture"],"antonyms":["head-nodding","nodding one's head","affirmative gesture"]},{"part_of_speech":"adjective","definition":"首を横に振るような、首を横に振ることを表す","english_definition":"Expressing disapproval, disagreement, disbelief, or negation by shaking one's head.","examples":[{"sentence":"The proposal was met with head-shaking disapproval from the committee members.","translation":"その提案は、委員会メンバーからの首を横に振るような不承認に迎えられた。"},{"sentence":"He received a head-shaking response when he asked for a raise.","translation":"彼は昇給を求めた時、首を横に振るような反応を受けた。"},{"sentence":"The head-shaking news of the company's bankruptcy spread quickly.","translation":"会社の倒産という首を横に振るようなニュースはすぐに広まった。"}],"collocations":["head-shaking disapproval (首を横に振るような不承認)","head-shaking response (首を横に振るような反応)","head-shaking news (首を横に振るようなニュース)"],"synonyms":["disapproving","negative","skeptical","doubtful"],"antonyms":["approving","affirmative","positive"]}],"etymology":{"value":"The word is a compound of \"head\" and \"shaking\", describing the physical action of moving the head from side to side.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈhɛdˌʃeɪkɪŋ/","syllables":"head-shak-ing"},"inflection":{"notes":"The word can function as both a noun (describing the action) and an adjective (describing something characterized by the action)."},"usage_notes":{"explanation":"\"Head-shaking\" is a nonverbal form of communication that typically conveys negative sentiments. The specific meaning can vary depending on the context and the intensity of the head movement. It is often used to indicate disagreement, disbelief, disapproval, or negation. In some cultures, the meaning may differ, so it's important to be aware of cultural differences in nonverbal communication.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a head-shaking for the idea.","correct":"✓ He showed head-shaking at the idea. / ✓ He shook his head at the idea.","note":"When using \"head-shaking\" as a noun, it often requires a preposition like \"at\" or \"in response to\". Alternatively, the verb form \"shook his head\" is a more common and natural way to express the action."},{"incorrect":"✗ The head-shaking was very express.","correct":"✓ The head-shaking was very expressive.","note":"The correct adjective to describe the quality of the head-shaking is \"expressive\", not \"express\"."}],"priority":"★☆☆"},"related_words":{"derivatives":["headshake (noun, a single instance of shaking the head)"],"phrasal_verbs":[],"related_gestures":["head-nodding (opposite gesture, indicating agreement or affirmation)","shrugging (indicating indifference or lack of knowledge)","eye-rolling (indicating disbelief or annoyance)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but understandable in context.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"head-shaking\" is a relatively straightforward compound word that describes the action of shaking one's head. It is most commonly used to express disapproval, disagreement, or disbelief. The term is generally understandable in context, but it is not as common as the verb phrase \"shaking one's head.\" Understanding the nuances of nonverbal communication, such as head-shaking, is important for effective communication in various social and professional settings."},"example_sentences":[{"sentence":"The teacher responded with head-shaking disapproval when the student claimed he hadn't done his homework.","translation":"先生は、生徒が宿題をしていないと言ったとき、首を横に振って不承認を示した。","type":"noun","meaning_category":"disapproval"},{"sentence":"Her head-shaking response made it clear that she didn't agree with the plan.","translation":"彼女の首を横に振る反応は、彼女がその計画に同意していないことを明らかにした。","type":"adjective","meaning_category":"disagreement"},{"sentence":"There was a lot of head-shaking in the audience after the company announced its losses.","translation":"会社が損失を発表した後、聴衆の間では首を横に振る人が多かった。","type":"noun","meaning_category":"disbelief"},{"sentence":"The news of the scandal was met with head-shaking condemnation from the public.","translation":"そのスキャンダルのニュースは、一般の人々からの首を横に振るような非難に迎えられた。","type":"adjective","meaning_category":"condemnation"}]}