{"word":"geolocated","priority":"★★☆","meanings":[{"part_of_speech":"verb (past participle & adjective)","definition":"地理的に位置が特定された、ジオロケーションされた","english_definition":"having had its geographical location determined; identified with respect to its location on Earth.","examples":[{"sentence":"The missing hiker was geolocated using their smartphone's GPS.","translation":"行方不明のハイカーは、スマートフォンのGPSを使って地理的に位置が特定された。"},{"sentence":"Geolocated data can be used to track migration patterns.","translation":"地理的に位置情報が特定されたデータは、移動パターンを追跡するために使用できる。"},{"sentence":"All photos uploaded to the website are automatically geolocated.","translation":"ウェブサイトにアップロードされたすべての写真は自動的にジオロケーションされる。"}],"collocations":["geolocated data (ジオロケーションされたデータ)","geolocated image (ジオロケーションされた画像)","geolocated information (ジオロケーションされた情報)","geolocated photograph (ジオロケーションされた写真)"],"synonyms":["located","positioned","situated","mapped","tracked"],"antonyms":["unlocated","unpositioned","unmapped"]},{"part_of_speech":"verb (past participle & adjective)","definition":"ジオロケーション技術を用いて特定された、ジオタグが付与された","english_definition":"identified or tagged with geographical coordinates using geolocation technology.","examples":[{"sentence":"The geolocated tweets provided valuable insights during the disaster.","translation":"ジオロケーション技術を用いて位置情報が特定されたツイートは、災害時に貴重な情報を提供した。"},{"sentence":"The app uses geolocated notifications to alert users to nearby points of interest.","translation":"そのアプリはジオロケーション技術を用いて位置情報が特定された通知を使用し、近くの関心のある場所をユーザーに警告する。"}],"collocations":["geolocated tweets (ジオロケーションされたツイート)","geolocated notifications (ジオロケーションされた通知)","geolocated posts (ジオロケーションされた投稿)","geolocated content (ジオロケーションされたコンテンツ)"],"synonyms":["geotagged","location-aware","location-based"],"antonyms":["non-geotagged","location-agnostic"]}],"etymology":{"value":"The word 'geolocated' is derived from 'geolocation,' which combines 'geo-' (from Greek 'γή' (gē) meaning 'earth') and 'location' (from Latin 'locātiō' meaning 'a placing, situation'). The term refers to the process of determining the geographical location of something.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdʒiːoʊləʊˈkeɪtɪd/","syllables":"ge-o-lo-cat-ed"},"inflection":{"notes":"'Geolocated' is the past participle and adjective form of the verb 'geolocate.' The base verb 'geolocate' conjugates as follows: present: geolocate, geolocates; past: geolocated; present participle: geolocating."},"usage_notes":{"explanation":"'Geolocated' is used to describe something whose geographical location has been determined, typically through technologies like GPS, Wi-Fi, or IP addresses. It is often used in the context of data, images, social media posts, and mobile devices. The term implies that the location information is attached to or associated with the item being described.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The photo was geolocating.","correct":"✓ The photo was geolocated.","note":"'Geolocating' is the present participle and describes the *process* of determining location. 'Geolocated' is the past participle and describes something that *has had* its location determined."},{"incorrect":"✗ The geolocated of the phone helped find it.","correct":"✓ The geolocation of the phone helped find it.","note":"'Geolocated' is an adjective or past participle. The noun form is 'geolocation'."}],"priority":"★★☆"},"related_words":{"derivatives":["geolocation (noun: the process of determining the geographical location of something)","geolocate (verb: to determine the geographical location of something)","geolocating (present participle: the act of determining geographical location)","geotag (verb/noun: to add geographical metadata to a photograph or other media)","geospatial (adjective: relating to data that is associated with a particular location)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but increasing due to the prevalence of location-based technologies.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Geolocated' means that something's location on Earth has been found using technology like GPS. You'll often see it used to describe photos, data, or devices. For example, a 'geolocated photo' is a picture that has its location information saved with it. It's a technical term, but it's becoming more common as location services become more widely used."},"example_sentences":[{"sentence":"The **geolocated** data helped researchers understand the migration patterns of birds.","translation":"ジオロケーションされたデータは、研究者が鳥の移動パターンを理解するのに役立った。","type":"adjective","meaning_category":"位置が特定された"},{"sentence":"The app uses **geolocated** notifications to alert users about nearby events.","translation":"このアプリは、ジオロケーションされた通知を使用して、近くのイベントについてユーザーに警告する。","type":"adjective","meaning_category":"ジオロケーション技術を用いて特定された"},{"sentence":"The police were able to find the stolen car because it was **geolocated**.","translation":"警察は、盗まれた車がジオロケーションされていたため、それを見つけることができた。","type":"verb (past participle)","meaning_category":"位置が特定された"},{"sentence":"All images uploaded to the platform are automatically **geolocated** using GPS data.","translation":"プラットフォームにアップロードされたすべての画像は、GPSデータを使用して自動的にジオロケーションされる。","type":"verb (past participle)","meaning_category":"ジオロケーション技術を用いて特定された"}]}