{"word":"Ponos","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(ギリシア神話) 苦難、労苦、苦労、努力の擬人化された神","english_definition":"(Greek mythology) The personification of toil, labor, and hardship.","examples":[{"sentence":"In Hesiod's Works and Days, Ponos is described as one of the evils released from Pandora's jar.","translation":"ヘシオドスの『仕事と日』では、ポノスはパンドラの箱から解き放たれた悪の一つとして記述されている。"}],"collocations":[],"synonyms":["Labor","Hardship","Toil","Suffering"],"antonyms":["Hedone (pleasure)"],"notes":"Often associated with Algea (pains) and other negative concepts."}],"etymology":{"value":"From the Ancient Greek word 'πόνος' (pónos) meaning 'toil, labor, hardship, distress'.","priority":"★★★"},"pronunciation":{"ipa":"ˈpoʊnɒs","syllables":"Po-nos"},"inflection":{"notes":"Proper noun, typically not inflected."},"usage_notes":{"explanation":"Ponos is a relatively obscure figure in Greek mythology, mainly appearing in literary contexts.  It is not a commonly used word outside of discussions of mythology or classical literature.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"related_concepts":["Algea (pains)","Pandora's jar","Greek mythology"]},"level_frequency":{"frequency_google_ngram":"Very low frequency - Primarily found in academic or mythological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Ponos' is highly specialized and primarily encountered within the study of Greek mythology or classical literature. A comprehensive understanding necessitates familiarity with ancient Greek concepts and literary sources. Its usage is virtually nonexistent in contemporary everyday language."},"example_sentences":[{"sentence":"The ancient Greeks viewed Ponos as an unavoidable aspect of human existence.","translation":"古代ギリシア人はポノスを人間の存在の避けられない側面と見なした。","type":"general","meaning_category":"苦難の神"},{"sentence":"Ponos and Algea were often depicted together, symbolizing the inseparable nature of toil and pain.","translation":"ポノスとアルゲアはしばしば一緒に描かれ、労苦と苦痛の切り離せない性質を象徴していた。","type":"mythological context","meaning_category":"関連する概念"}]}