{"word":"butlery","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"配膳室、食器室","english_definition":"A room, often between the kitchen and dining room, used for preparing food, storing dishes, and sometimes washing dishes.","examples":[{"sentence":"The butlery was well-stocked with fine china and silverware.","translation":"配膳室には上質な陶磁器と銀食器が豊富に保管されていた。"},{"sentence":"She arranged the flowers in the butlery before placing them on the dining table.","translation":"彼女は花をダイニングテーブルに飾る前に、配膳室で花を活けた。"}],"collocations":["pantry butlery","walk-in butlery","modern butlery","traditional butlery"],"synonyms":["pantry","scullery","serving room","dish room"],"antonyms":[]},{"part_of_speech":"noun","definition":"執事の職務、執事の仕事","english_definition":"The duties or position of a butler.","examples":[{"sentence":"His butlery included managing the household staff and overseeing formal dinners.","translation":"彼の執事の職務には、家政婦の管理と正式な夕食会の監督が含まれていた。"},{"sentence":"She studied butlery at a prestigious school to learn the art of impeccable service.","translation":"彼女は完璧なサービス技術を学ぶために、名門校で執事の職務について学んだ。"}],"collocations":["professional butlery","estate butlery","private butlery","household butlery"],"synonyms":["stewardship","house management","service"],"antonyms":[]}],"etymology":{"value":"The word \"butlery\" is derived from \"butler,\" which comes from the Old French \"bouteillier,\" meaning \"bottle bearer\" or \"wine steward.\" The suffix \"-y\" is added to denote a place or a function related to the butler.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbʌtləri/","syllables":"but-ler-y"},"inflection":{"noun_plural":"butleries"},"usage_notes":{"explanation":"The word \"butlery\" can refer to either a room used for serving and storing dishes or to the job and duties of a butler. The context usually makes it clear which meaning is intended. When referring to the room, it is often located between the kitchen and dining room for convenience in serving meals. When referring to the job, it involves managing household staff, overseeing events, and ensuring the smooth operation of a household.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The butlery was responsible for cooking the meals.","correct":"✓ The kitchen was responsible for cooking the meals.","note":"The butlery is typically used for preparing and serving food, not for cooking. Cooking is done in the kitchen."},{"incorrect":"✗ He worked as a butlery in the hotel.","correct":"✓ He worked as a butler in the hotel.","note":"\"Butlery\" refers to the job itself, not the person doing the job. The correct term for the person is \"butler.\""}],"priority":"★★☆"},"related_words":{"derivatives":["butler (noun: 執事)","butlering (verb: 執事の仕事をする)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"butlery\" is a relatively uncommon word. It can refer to a room used for serving and storing dishes, or to the job and duties of a butler. Understanding the context is important to determine the intended meaning. This word is more likely to be encountered in literature, historical contexts, or discussions about large estates and formal households."},"example_sentences":[{"sentence":"The antique china was carefully stored in the **butlery**.","translation":"アンティークの陶磁器は配膳室に丁寧に保管されていた。","type":"noun","meaning_category":"配膳室"},{"sentence":"She dedicated her life to the art of **butlery**, serving prominent families with grace and precision.","translation":"彼女は卓越した優雅さと正確さで著名な家族に仕え、執事の職務に生涯を捧げた。","type":"noun","meaning_category":"執事の職務"}]}