{"word":"Origenian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"オリゲネスの、またはオリゲネスに関する","english_definition":"Of or pertaining to Origen, a 3rd-century Christian scholar and theologian, or to his teachings.","examples":[{"sentence":"Origenian theology was influential in the early Church.","translation":"オリゲネスの神学は初期教会に大きな影響を与えた。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"オリゲネスの信奉者、オリゲネス主義者","english_definition":"A follower of Origen or his teachings; an Origenist.","examples":[{"sentence":"The Origenians held controversial views on the pre-existence of souls.","translation":"オリゲネス主義者たちは、魂の先在について議論の余地のある見解を持っていた。"}],"collocations":[],"synonyms":["Origenist"],"antonyms":[]}],"etymology":{"value":"From the name Origen, a prominent early Christian theologian, + -ian (suffix indicating origin or association).","priority":"★★☆"},"pronunciation":{"ipa":"/ɔːrɪˈdʒiːniən/","syllables":"O-ri-ge-ni-an"},"inflection":{},"usage_notes":{"explanation":"The term 'Origenian' is primarily used in historical and theological contexts to refer to aspects related to Origen of Alexandria and his theological doctrines. Origen's teachings were influential but also controversial, and the term often carries connotations of specific theological positions associated with him, such as apocatastasis (universal salvation) and the pre-existence of souls.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Origenism (オリゲネス主義)"],"related_terms":["Origen (オリゲネス)"]},"level_frequency":{"frequency_google_ngram":"Very low frequency - Primarily used in theological and historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Origenian' is highly specialized and primarily encountered in theological or historical discussions related to the figure of Origen of Alexandria and his theological contributions. Understanding its meaning requires familiarity with early Christian history and theology. It is not a word commonly used in general discourse."},"example_sentences":[{"sentence":"The debate centered on the interpretation of Origenian cosmology.","translation":"議論の中心は、オリゲネスの宇宙論の解釈だった。","type":"adjective","meaning_category":"オリゲネスの"},{"sentence":"Some scholars consider him an Origenian due to his belief in universal salvation.","translation":"普遍救済を信じていることから、彼をオリゲネス主義者と見なす学者もいる。","type":"noun","meaning_category":"オリゲネス主義者"}]}