{"word":"Burdine","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A surname, likely of English or French origin.","english_definition":"A surname, likely of English or French origin.","examples":[{"sentence":"I met a woman named Burdine at the conference.","translation":"私は会議でバーダインという名前の女性に会いました。"},{"sentence":"The Burdine family has lived in this town for generations.","translation":"バーダイン家はこの町に何世代も住んでいます。"}],"collocations":["Mr. Burdine","Ms. Burdine","The Burdine family"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The surname Burdine is thought to be derived from a place name or occupational name. It may be of English origin, possibly related to a place called 'Burden' or derived from the Old English 'burh' (fortified place) and 'dun' (hill). Alternatively, it could be of French origin, possibly a variant of 'Bourdaine', a name associated with a type of tree.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɜːrdɪn/","syllables":"Bur-dine"},"inflection":{"notes":"Proper noun; plural: Burdines"},"usage_notes":{"explanation":"'Burdine' is primarily used as a surname. Its frequency as a given name is very low. When encountering this word, it is almost always referring to a person's last name.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am going to see Burdine tomorrow.","correct":"✓ I am going to see Mr./Ms. Burdine tomorrow.","note":"When referring to someone by their last name, it's generally more formal to use a title (Mr., Ms., Dr., etc.)."},{"incorrect":"✗ The Burdine's house is on the corner.","correct":"✓ The Burdines' house is on the corner.","note":"To indicate possession by a plural surname, place the apostrophe after the 's'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"variant_spellings":["Bourdine","Burden"],"related_surnames":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency as a surname.","priority":"★☆☆"},"readability_explanation":{"level":"N/A","text":"'Burdine' is a surname and therefore not typically part of general vocabulary. Its usage is limited to contexts involving individuals or families with that last name.","priority":"★★★"},"example_sentences":[{"sentence":"John Burdine is the CEO of the company.","translation":"ジョン・バーダインはその会社のCEOです。","type":"noun","meaning_category":"surname"},{"sentence":"The Burdine estate was sold at auction.","translation":"バーダイン家の地所がオークションで売却されました。","type":"noun","meaning_category":"surname"}]}