{"word":"Phytozoa","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"植物性鞭毛虫類","english_definition":"A former taxonomic grouping of flagellate protozoa that contain chloroplasts and are therefore photosynthetic. Now largely obsolete.","examples":[{"sentence":"Phytozoa were once considered a distinct group within the protozoa.","translation":"かつて、植物性鞭毛虫類は原生動物の中で独立したグループであると考えられていました。"}],"collocations":[],"synonyms":["Euglenoids","Phytoplankton"],"antonyms":[]}],"etymology":{"value":"From Greek 'phyto-' (plant) + 'zoa' (animals). Reflecting the historical classification of these organisms as having both plant and animal characteristics.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfaɪtoʊˈzoʊə/","syllables":"Phy-to-zo-a"},"inflection":{"noun_plural":"Phytozoans (rare)"},"usage_notes":{"explanation":"The term 'Phytozoa' is largely obsolete in modern taxonomy. Organisms formerly classified as Phytozoa are now typically classified within various algal groups, based on evolutionary relationships determined by molecular data. The term may still be encountered in older literature.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["phytozoic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Phytozoa' is a historical term used to describe flagellate protozoa that possess chloroplasts and perform photosynthesis. This term is now largely obsolete in modern biological classification, as these organisms are now classified based on their evolutionary relationships determined through molecular data. It is primarily encountered in older scientific literature. Understanding requires knowledge of basic biological taxonomy and the history of protist classification."},"example_sentences":[{"sentence":"Early classifications placed many algae-like protists within the Phytozoa.","translation":"初期の分類では、多くの藻類のような原生生物が植物性鞭毛虫類に分類されていました。","type":"noun","meaning_category":"植物性鞭毛虫類"}]}