{"word":"progesterone","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"プロゲステロン（黄体ホルモン）","english_definition":"A steroid hormone released by the corpus luteum in the ovary and responsible for preparing the uterus for pregnancy.","examples":[{"sentence":"Progesterone levels rise during the second half of the menstrual cycle.","translation":"プロゲステロンのレベルは月経周期の後半に上昇します。"},{"sentence":"Progesterone is often used in hormone replacement therapy.","translation":"プロゲステロンはホルモン補充療法でよく使用されます。"},{"sentence":"Some birth control pills contain progesterone.","translation":"一部の避妊薬にはプロゲステロンが含まれています。"}],"collocations":["progesterone level (プロゲステロン値)","progesterone therapy (プロゲステロン療法)","synthetic progesterone (合成プロゲステロン)","low progesterone (低プロゲステロン)","increase progesterone (プロゲステロンを増やす)"],"synonyms":["pregnanediol (プロゲステロンの代謝産物)"],"antonyms":[]}],"etymology":{"value":"Derived from the prefix 'pro-' (meaning 'promoting'), the root 'gest-' (from 'gestation', meaning pregnancy), and the suffix '-one' (indicating a steroid hormone).","priority":"★★☆"},"pronunciation":{"ipa":"/proʊˈdʒestəroʊn/","syllables":"pro-ges-ter-one"},"inflection":{"noun_plural":"progesterones"},"usage_notes":{"explanation":"Progesterone is a crucial hormone in the female reproductive system. It plays a key role in the menstrual cycle, pregnancy, and embryogenesis. It is produced mainly by the corpus luteum in the ovary during the second half of the menstrual cycle. If pregnancy occurs, the placenta also produces progesterone. Progesterone prepares the lining of the uterus (endometrium) to receive and sustain a fertilized egg. It also prevents the uterus from contracting, which could lead to miscarriage. Synthetic forms of progesterone, called progestins, are used in birth control pills and hormone replacement therapy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Progesterone is only important for men.","correct":"✓ Progesterone is primarily important for women, although men also produce small amounts.","note":"Progesterone is primarily a female hormone, although males produce it in small amounts from the adrenal glands and testes."},{"incorrect":"✗ Progesterone is the same as estrogen.","correct":"✓ Progesterone and estrogen are both sex hormones, but they have different functions.","note":"Progesterone and estrogen are both important sex hormones, but they have distinct roles in the body."}],"priority":"★★☆"},"related_words":{"derivatives":["progestin (合成プロゲステロン)","progestational (プロゲステロン作用の)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Progesterone' is a technical term used in biology and medicine, specifically related to female reproductive health. It refers to a steroid hormone produced by the ovaries (corpus luteum) and placenta, playing a vital role in the menstrual cycle and pregnancy. Understanding this term requires a background in biology or medicine, as it's not commonly used in everyday conversation. It's important to note that progesterone is distinct from estrogen, though both are female sex hormones. Progestins are synthetic forms of progesterone used in medications like birth control pills and hormone replacement therapy."},"example_sentences":[{"sentence":"The doctor prescribed progesterone supplements to help regulate her menstrual cycle.","translation":"医師は彼女の月経周期を整えるためにプロゲステロンのサプリメントを処方しました。","type":"noun","meaning_category":"hormone"},{"sentence":"Low progesterone levels can contribute to difficulties in conceiving.","translation":"プロゲステロン値が低いと妊娠しにくくなることがあります。","type":"noun","meaning_category":"hormone"},{"sentence":"Progesterone helps to maintain the uterine lining during pregnancy.","translation":"プロゲステロンは妊娠中に子宮内膜を維持するのを助けます。","type":"noun","meaning_category":"hormone"}]}