{"word":"box-bordered","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"箱型の境界線で囲まれた","english_definition":"Enclosed or surrounded by a border that resembles a box.","examples":[{"sentence":"The text was displayed in a box-bordered frame.","translation":"テキストは箱型の境界線で囲まれたフレームに表示されました。"},{"sentence":"She created a box-bordered design for the invitation.","translation":"彼女は招待状のために箱型の境界線で囲まれたデザインを作成しました。"}],"collocations":["box-bordered frame","box-bordered design","box-bordered table"],"synonyms":["bordered","framed","outlined"],"antonyms":["borderless","unbordered"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'box' (referring to a rectangular shape) and 'bordered' (meaning having a border).","priority":"★★★"},"pronunciation":{"ipa":"/ˈbɒks ˈbɔːrdərd/","syllables":"box-bor-dered"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Box-bordered' is typically used to describe visual elements, such as text, images, or designs, that are surrounded by a distinct, rectangular border. It is often used in graphic design, web design, and typography to emphasize or separate content.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The box bordered was around the image.","correct":"✓ The box border was around the image. / ✓ The image was box-bordered.","note":"'Box-bordered' is an adjective, so it should be used to describe a noun. 'Box border' (two separate words) can be used as a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["box (noun)","border (noun, verb)","bordered (adjective)"],"phrasal_verbs":[],"related_adjectives":["bordered","framed","outlined"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'box-bordered' is a relatively specific and descriptive adjective. It is easily understood if the reader is familiar with basic design terminology and the concept of borders. Its usage is straightforward and not prone to misinterpretation, assuming the context involves visual elements."},"example_sentences":[{"sentence":"The website featured a box-bordered section for important announcements.","translation":"そのウェブサイトには、重要な告知のために箱型の境界線で囲まれたセクションがありました。","type":"descriptive","meaning_category":"visual design"},{"sentence":"Each photograph in the album had a neat, box-bordered edge.","translation":"アルバムの各写真は、きちんとした箱型の境界線の縁がありました。","type":"descriptive","meaning_category":"photography"}]}