{"word":"megaseme","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(linguistics) A semantic unit that is larger than a morpheme or a word, such as a phrase, clause, sentence, or even a paragraph.","english_definition":"A semantic unit larger than a morpheme or word, such as a phrase, clause, sentence, or paragraph.","examples":[{"sentence":"The entire paragraph functioned as a single megaseme, conveying a complex idea.","translation":"段落全体が、複雑な概念を伝える単一のメガセームとして機能した。"}],"collocations":["analyze a megaseme","identify megasemes","megasemic analysis"],"synonyms":["macro-semantic unit","discourse unit"],"antonyms":["morpheme","lexeme"]}],"etymology":{"value":"From *mega-* (large) + *seme* (a unit of meaning).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɛɡəsiːm/","syllables":"me-ga-seme"},"inflection":{"noun_plural":"megasemes"},"usage_notes":{"explanation":"The term 'megaseme' is primarily used in linguistics, particularly in semantics and discourse analysis, to describe units of meaning that extend beyond individual words. It helps in analyzing how meaning is constructed across larger stretches of text or speech.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The megaseme was only one word long.","correct":"✓ The word itself was a morpheme.","note":"A megaseme is, by definition, larger than a single word. Use 'morpheme' or 'lexeme' for single-word semantic units."}],"priority":"★★☆"},"related_words":{"derivatives":["megasemic (adjective)"],"related_terms":["seme","morpheme","lexeme","discourse analysis","semantics"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Primarily a term used in academic linguistics.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'megaseme' is a specialized term used in advanced linguistic analysis. It refers to a unit of meaning that is larger than a single word or morpheme, encompassing phrases, clauses, sentences, or even entire paragraphs. Understanding this term requires familiarity with linguistic concepts such as semantics and discourse analysis. It is not commonly used outside of academic contexts. "},"example_sentences":[{"sentence":"The linguist argued that the entire poem should be interpreted as a single, unified megaseme.","translation":"その言語学者は、詩全体が単一の統合されたメガセームとして解釈されるべきだと主張した。","type":"noun","meaning_category":"linguistics"},{"sentence":"Megasemic analysis revealed the underlying themes of the novel.","translation":"メガセーム分析により、小説の根底にあるテーマが明らかになった。","type":"noun","meaning_category":"linguistics"}]}