{"word":"mammogenic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"乳腺の発達を促進する、乳房形成を促す","english_definition":"Stimulating the development of the mammary glands; promoting mammogenesis.","examples":[{"sentence":"Mammogenic hormones are essential for breast development during puberty and pregnancy.","translation":"乳腺形成ホルモンは、思春期および妊娠中の乳房の発達に不可欠です。"},{"sentence":"Certain growth factors have mammogenic effects on mammary tissue.","translation":"特定の成長因子は、乳腺組織に乳腺形成効果をもたらします。"}],"collocations":["mammogenic hormone","mammogenic effect","mammogenic activity","mammogenic substance"],"synonyms":["mammatropic","lactogenic","prolactin-like"],"antonyms":["anti-mammogenic"],"related_terms":["mammogenesis","mammary gland","prolactin","estrogen","growth hormone"]}],"etymology":{"value":"Derived from 'mammo-' (referring to the mammary gland) and '-genic' (producing or generating).","priority":"★★★"},"pronunciation":{"ipa":"/ˌmæməˈdʒɛnɪk/","syllables":"mam-mo-gen-ic"},"inflection":{"notes":"Does not inflect; it's an adjective."},"usage_notes":{"explanation":"'Mammogenic' is a technical term primarily used in biology, endocrinology, and medicine to describe substances or hormones that stimulate the growth and development of the mammary glands. It is often used in the context of research related to breast development, lactation, and breast cancer.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The mammogenic drug caused a decrease in breast size.","correct":"The anti-mammogenic drug caused a decrease in breast size.","note":"'Mammogenic' means promoting breast growth, so a drug that decreases breast size would be 'anti-mammogenic'."}],"priority":"★★☆"},"related_words":{"derivatives":["mammogen (noun: a mammogenic substance)","mammogenesis (noun: the development of the mammary glands)"],"related_medical_terms":["mastogenesis (similar to mammogenesis)","lactation (milk production)","breast cancer (related to abnormal mammogenic activity)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - primarily a scientific/medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Mammogenic' is a specialized term used in the fields of biology and medicine, specifically relating to the stimulation of mammary gland development. It is not commonly used in everyday language. Understanding this term requires a background in biology or medicine, specifically knowledge of hormones and glandular development. The word is formed by combining 'mammo-' (referring to the mammary gland) and '-genic' (producing or generating), indicating its function to promote the growth of mammary tissue."},"example_sentences":[{"sentence":"Estrogen is a key mammogenic hormone involved in female breast development.","translation":"エストロゲンは、女性の乳房の発達に関与する重要な乳腺形成ホルモンです。","type":"general","meaning_category":"hormonal action"},{"sentence":"The study investigated the mammogenic effects of a novel growth factor on mammary epithelial cells.","translation":"その研究では、新規成長因子が乳腺上皮細胞に及ぼす乳腺形成効果が調査されました。","type":"research","meaning_category":"research context"}]}