{"word":"feminocentricity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"女性中心主義、女性本位主義","english_definition":"A perspective or ideology that centers on women's experiences, values, and perspectives, often to the exclusion or marginalization of other genders.","examples":[{"sentence":"Some critics argue that the policy exhibits feminocentricity by prioritizing women's needs over men's.","translation":"一部の批評家は、その政策が女性のニーズを男性のニーズよりも優先することで女性中心主義を示していると主張している。"},{"sentence":"The novel's feminocentricity offers a unique perspective on historical events.","translation":"その小説の女性中心主義は、歴史的出来事に対する独特な視点を提供している。"}],"collocations":["exhibit feminocentricity","criticize for feminocentricity","feminocentric perspective","feminocentric approach"],"synonyms":["gynocentrism","female-centeredness"],"antonyms":["androcentricity","masculinocentricity","gender equality","gender neutrality"]}],"etymology":{"value":"A combination of 'femin(ine)' (relating to women), 'centro-' (from Greek kentron, meaning 'center'), and '-icity' (a suffix denoting state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɛmɪnoʊsɛnˈtrɪsɪti/","syllables":"fe-min-o-cen-tric-i-ty"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Feminocentricity refers to a worldview or ideology that places women and their experiences at the center of analysis and understanding. It can be used descriptively to analyze texts, policies, or social structures that prioritize women. However, it is often used critically to suggest that this prioritization is excessive or unfair to other genders. It is important to distinguish feminocentricity from feminism, which advocates for gender equality. Feminocentricity, in contrast, can be seen as promoting female superiority or exclusivity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The study showed feminocentricity in the data.","correct":"✓ The study suggested a feminocentric bias in the data.","note":"'Feminocentricity' is an ideology or perspective, not a measurable quality in data. Use 'feminocentric bias' instead."},{"incorrect":"✗ Feminocentricity is the same as feminism.","correct":"✓ Feminocentricity is different from feminism; it focuses on women's experiences, sometimes to the exclusion of others, while feminism advocates for gender equality.","note":"Feminocentricity and feminism are distinct concepts. Feminism seeks equality, while feminocentricity centers on women, potentially excluding other perspectives."}],"priority":"★★☆"},"related_words":{"derivatives":["feminocentric","feminocentrism"],"phrases":["female chauvinism","gender bias","gender essentialism"],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Feminocentricity' is a complex term used in academic and critical discussions to describe a perspective that centers on women's experiences, often to the exclusion of other genders. It's important to understand that this term is often used critically to point out a potential bias, rather than as a neutral description. It is different from 'feminism,' which advocates for gender equality. This term is not commonly used in everyday conversation and is more likely to be encountered in academic texts or discussions about gender studies and social theory."},"example_sentences":[{"sentence":"The author's feminocentric approach to history highlighted the contributions of women who were often overlooked.","translation":"その著者の女性中心主義的な歴史へのアプローチは、見過ごされがちだった女性たちの貢献を強調した。","type":"general","meaning_category":"general"},{"sentence":"Critics argued that the curriculum's feminocentricity neglected the experiences and perspectives of boys and men.","translation":"批評家たちは、カリキュラムの女性中心主義が少年や男性の経験や視点を無視していると主張した。","type":"critical","meaning_category":"critical"}]}