{"word":"alkyd","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"アルキド樹脂","english_definition":"A type of polyester resin modified by the addition of fatty acids and other components. Alkyd resins are used in paints and other coatings.","examples":[{"sentence":"Alkyd paints are known for their durability and gloss.","translation":"アルキド塗料は、耐久性と光沢で知られています。"},{"sentence":"The artist used alkyd mediums to thin the oil paints.","translation":"その画家は、油絵の具を薄めるためにアルキドメディウムを使用した。"}],"collocations":["alkyd resin","alkyd paint","modified alkyd","long-oil alkyd","short-oil alkyd"],"synonyms":["polyester resin","coating resin"],"antonyms":[]}],"etymology":{"value":"Derived from the words 'alcohol' and 'acid', reflecting the chemical composition of alkyd resins.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈæl.kɪd/","syllables":"al-kyd"},"inflection":{"noun_plural":"alkyds"},"usage_notes":{"explanation":"Alkyd resins are synthetic resins formed by the reaction of polyhydric alcohols and polybasic acids. They are commonly modified with oils or fatty acids. They are widely used in coatings due to their good adhesion, flexibility, and weather resistance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a alkyd paint.","correct":"✓ I used an alkyd paint.","note":"'Alkyd' starts with a vowel sound, so use 'an' instead of 'a'."}],"priority":"★★☆"},"related_words":{"derivatives":["alkydal","glyptal"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'alkyd' refers to a specific type of synthetic resin used primarily in paints and coatings. Understanding the term requires some familiarity with chemistry, particularly the concepts of polyesters, fatty acids, and resins. The usage is typically found in technical contexts related to paints, coatings, and industrial chemistry."},"example_sentences":[{"sentence":"The old boat was coated with a layer of durable alkyd paint.","translation":"その古いボートは、耐久性のあるアルキド塗料の層でコーティングされていた。","type":"noun","meaning_category":"material"},{"sentence":"The laboratory synthesized a new type of alkyd resin with improved weather resistance.","translation":"その研究所は、耐候性が向上した新しいタイプのアルキド樹脂を合成した。","type":"noun","meaning_category":"chemistry"}]}