{"word":"historicize","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"歴史的視点から考察する、歴史的文脈に位置づける、歴史化する","english_definition":"To treat as historical; to place in or interpret in the context of history.","examples":[{"sentence":"We need to historicize these events to understand their true significance.","translation":"これらの出来事の真の重要性を理解するためには、歴史的視点から考察する必要がある。"},{"sentence":"The professor historicized the novel by examining its social and political background.","translation":"教授は、その小説の社会的・政治的背景を調べることによって、歴史的文脈に位置づけた。"},{"sentence":"It's important to historicize the debate surrounding climate change.","translation":"気候変動をめぐる議論を歴史化することが重要だ。"}],"collocations":["historicize an event (出来事を歴史化する)","historicize a concept (概念を歴史化する)","historicize a text (テキストを歴史化する)","historicize a figure (人物を歴史化する)"],"synonyms":["contextualize","situate","frame historically","interpret historically"],"antonyms":["dehistoricize","ahistoricize","essentialize","universalize"]}],"etymology":{"value":"'Historic' + '-ize'.  From 'historic' meaning 'belonging to or associated with history' and '-ize' a suffix used to form verbs meaning 'to make, treat, or subject to'.","priority":"★★☆"},"pronunciation":{"ipa":"/hɪˈstɒrɪsaɪz/","syllables":"hi-stor-i-cize"},"inflection":{"verb_forms":{"present_simple":["historicize","historicizes"],"past_simple":"historicized","past_participle":"historicized","present_participle":"historicizing"}},"usage_notes":{"explanation":"'Historicize' is often used in academic and critical writing to emphasize the importance of understanding something within its specific historical context. It suggests a deeper analysis than simply acknowledging that something happened in the past. It often implies challenging universal or essentialist views by showing how phenomena are shaped by particular historical conditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The museum historicized the artifacts by displaying them.","correct":"✓ The museum contextualized the artifacts by displaying them with historical information.","note":"Simply displaying artifacts isn't historicizing. Historicizing involves providing a deeper analysis of the artifacts' historical significance and context."},{"incorrect":"✗ He tried to historicize his personal problems.","correct":"✓ He tried to understand his personal problems in the context of his family history.","note":"'Historicize' is usually applied to broader social, cultural, or intellectual phenomena, not individual personal issues."}],"priority":"★★☆"},"related_words":{"derivatives":["historicization (名詞: 歴史化)","historical (形容詞: 歴史的な)","history (名詞: 歴史)","historicism (名詞: 歴史主義)","historian (名詞: 歴史家)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 主に学術的な文脈で使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Historicize' means to understand something by looking at its history and the time it happened in. It's like putting a puzzle piece into the bigger picture of the past. When you historicize something, you don't just say it happened, but you explain why it happened the way it did because of the time and place it was in. This word is often used in books and discussions about history, culture, and ideas."},"example_sentences":[{"sentence":"Scholars often **historicize** literary works to reveal their cultural and political underpinnings.","translation":"学者たちは、文学作品の文化的・政治的基盤を明らかにするために、しばしば歴史的視点から考察する。","type":"verb","meaning_category":"歴史的視点から考察する"},{"sentence":"The author **historicized** the development of the internet in his book.","translation":"著者は著書の中で、インターネットの発展を歴史的文脈に位置づけた。","type":"verb","meaning_category":"歴史的文脈に位置づける"},{"sentence":"Feminist theory has helped to **historicize** the concept of gender.","translation":"フェミニスト理論は、ジェンダーという概念を歴史化するのに役立ってきた。","type":"verb","meaning_category":"歴史化する"}]}