{"word":"pseudoanthropology","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"疑似人類学、エセ人類学","english_definition":"beliefs and practices that claim to be anthropological but do not adhere to the scientific method or established anthropological principles.","examples":[{"sentence":"The book was criticized for its reliance on pseudoanthropology to support its claims about ancient civilizations.","translation":"その本は、古代文明に関する主張を裏付けるために、疑似人類学に依存しているとして批判された。"},{"sentence":"Pseudoanthropology often promotes racist or culturally insensitive ideas.","translation":"疑似人類学は、人種差別的または文化的に無神経な考えを助長することが多い。"}],"collocations":["popular pseudoanthropology","historical pseudoanthropology"],"synonyms":["fringe anthropology","non-scientific anthropology"],"antonyms":["scientific anthropology","academic anthropology"]}],"etymology":{"value":"\"pseudo-\" (偽の) + \"anthropology\" (人類学)","priority":"★★★"},"pronunciation":{"ipa":"/ˌsjuːdoʊˌænθrəˈpɒlədʒi/","syllables":"pseu-do-an-thro-pol-o-gy"},"inflection":{"noun_plural":"pseudoanthropologies"},"usage_notes":{"explanation":"Pseudoanthropology refers to beliefs and practices presented as anthropological but lacking scientific rigor. It often involves unsubstantiated claims about human origins, cultural evolution, or racial differences. It is important to distinguish pseudoanthropology from legitimate anthropological research, which is based on empirical evidence and peer review.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She studies pseudoanthropology at the university.","correct":"✓ She studies anthropology, but is interested in pseudoanthropological theories.","note":"Pseudoanthropology is not a recognized academic discipline. It is a term used to criticize unscientific or misleading claims about humanity."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudoanthropological (adjective)"],"related_terms":["anthropology","pseudoscience","cultural appropriation","racism","ethnography"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pseudoanthropology' is a term used to describe ideas or practices that pretend to be based on anthropology (the study of humans and their societies) but are not scientific or accurate. It often involves making claims about human history, culture, or race that are not supported by real evidence. It's important to be able to tell the difference between real anthropology and pseudoanthropology.","priority":"★★★"},"example_sentences":[{"sentence":"Critics accused the author of using pseudoanthropology to justify his controversial theories.","translation":"批評家たちは、著者が物議を醸す理論を正当化するために疑似人類学を利用していると非難した。","type":"general","meaning_category":"definition"},{"sentence":"Many popular books on ancient civilizations are based on pseudoanthropology rather than actual archaeological evidence.","translation":"古代文明に関する多くの人気のある本は、実際の考古学的証拠ではなく、疑似人類学に基づいている。","type":"general","meaning_category":"definition"}]}