{"word":"unnavigably","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"航行できないほどに、航行困難なほどに","english_definition":"In a manner that makes navigation impossible or very difficult.","examples":[{"sentence":"The river was unnavigably shallow during the drought.","translation":"干ばつの間、川は航行できないほど浅かった。"},{"sentence":"The dense fog made the sea unnavigably dangerous.","translation":"濃い霧が海を航行できないほど危険にした。"},{"sentence":"The channel was unnavigably blocked by debris after the storm.","translation":"嵐の後、水路は瓦礫で航行できないほど塞がれていた。"}],"collocations":["unnavigably shallow","unnavigably dangerous","unnavigably blocked"],"synonyms":["impassably","unfeasibly","impossibly"],"antonyms":["navigably","feasibly","possibly"]}],"etymology":{"value":"Formed from \"un-\" (not) + \"navigably\" (in a navigable manner). \"Navigably\" is derived from \"navigable\" (capable of being navigated) + \"-ly\" (adverbial suffix).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈnævɪɡəbli/","syllables":"un-nav-i-ga-bly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Unnavigably' describes a condition or situation that prevents or severely hinders navigation. It is typically used to describe waterways, but can be applied to other environments where movement is difficult. It emphasizes the impossibility or extreme difficulty of traversing a particular route.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The road was unnavigably.","correct":"✓ The road was unnavigable.","note":"'Unnavigably' is an adverb, modifying a verb or adjective. 'Unnavigable' is an adjective, describing a noun."},{"incorrect":"✗ The ship unnavigably sailed.","correct":"✓ The ship sailed unnavigably slowly. / ✓ The ship sailed with unnavigable difficulty.","note":"'Unnavigably' should modify how the sailing occurred, not the action of sailing itself. The sentences are still awkward; rephrasing is recommended."}],"priority":"★★☆"},"related_words":{"derivatives":["unnavigable (adjective): not navigable; impossible to travel on by water.","navigate (verb): to direct the course of a ship, aircraft, or other vehicle.","navigation (noun): the process or activity of accurately ascertaining one's position and planning and following a route."]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unnavigably' is a complex adverb that means 'in a way that makes navigation impossible or extremely difficult.' It is formed by adding the prefix 'un-' to 'navigably,' which itself comes from 'navigable' (able to be navigated). This word is relatively rare and is typically used in formal or technical contexts when discussing waterways or other routes where movement is restricted. Understanding the root words 'navigate' and 'navigable' is essential to grasping the meaning of 'unnavigably.'"},"example_sentences":[{"sentence":"The ice floes made the Arctic waters unnavigably treacherous.","translation":"氷盤が北極海を航行できないほど危険にした。","type":"adverb","meaning_category":"航行困難なほどに"},{"sentence":"The river became unnavigably polluted, harming the local ecosystem.","translation":"川は航行できないほど汚染され、地域の生態系に害を及ぼした。","type":"adverb","meaning_category":"航行困難なほどに"},{"sentence":"The forest was so dense that it was unnavigably overgrown.","translation":"その森はとても密集していて、航行できないほど草木が生い茂っていた。","type":"adverb","meaning_category":"航行困難なほどに"}]}