{"word":"hormonally-independent","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ホルモン非依存性の","english_definition":"Not dependent on hormones for growth or function.","examples":[{"sentence":"This cell line is hormonally-independent, meaning it can proliferate without the presence of specific hormones.","translation":"この細胞株はホルモン非依存性であり、特定のホルモンが存在しなくても増殖できることを意味します。"},{"sentence":"Hormonally-independent tumors are often more difficult to treat with hormone therapy.","translation":"ホルモン非依存性腫瘍は、ホルモン療法での治療がより困難なことが多いです。"}],"collocations":["hormonally-independent cell line","hormonally-independent tumor","hormonally-independent growth"],"synonyms":["hormone-insensitive","hormone-unresponsive"],"antonyms":["hormone-dependent","hormone-sensitive"]},{"part_of_speech":"adjective","definition":"(比喩的に)外部からの影響を受けにくい、自律的な","english_definition":"(Figuratively) Not easily influenced by external factors; autonomous.","examples":[{"sentence":"The company aimed to create a hormonally-independent business model, less susceptible to market fluctuations.","translation":"その会社は、市場の変動の影響を受けにくい、ホルモン非依存性のビジネスモデルを構築することを目指しました。"}],"collocations":["hormonally-independent business model","hormonally-independent decision-making"],"synonyms":["autonomous","self-sufficient","independent","self-regulating"],"antonyms":["dependent","influenced","susceptible"]}],"etymology":{"value":"The term is formed by combining 'hormonally' (relating to hormones) and 'independent' (not dependent).","priority":"★★★"},"pronunciation":{"ipa":null,"syllables":"hor-mon-al-ly-in-de-pend-ent"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term 'hormonally-independent' is primarily used in a medical or biological context to describe cells, tissues, or tumors that do not require hormones to grow or function. It can also be used metaphorically to describe something that is self-sufficient or not easily influenced by external factors.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The hormonally independent patient received hormone therapy.","correct":"The hormone-dependent patient received hormone therapy.","note":"Hormone therapy is typically used for hormone-dependent conditions, not hormonally-independent ones."}],"priority":"★★☆"},"related_words":{"derivatives":["hormone","independent","hormonally","independence"],"phrases":["hormone receptor","hormone therapy","hormone replacement therapy"],"priority":"★★★"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency. Primarily found in scientific or medical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hormonally-independent' is a technical term primarily used in scientific and medical contexts. It describes something that does not rely on hormones for its function or growth. Understanding this term requires familiarity with basic biological concepts, particularly the role of hormones in regulating cellular processes. The figurative use of the term is less common and implies autonomy or resistance to external influence."},"example_sentences":[{"sentence":"The researchers studied the growth of hormonally-independent breast cancer cells in vitro.","translation":"研究者たちは、試験管内でホルモン非依存性乳がん細胞の成長を研究しました。","type":"adjective","meaning_category":"Medical/Biological"},{"sentence":"The company strived to create a hormonally-independent supply chain to mitigate risks.","translation":"その会社は、リスクを軽減するために、ホルモン非依存性のサプライチェーンを構築しようと努めました。","type":"adjective","meaning_category":"Figurative"}]}