{"word":"transcribers","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"文字起こしをする人たち、書き写す人たち","english_definition":"plural of transcriber: people who transcribe (copy or convert data into another format).","examples":[{"sentence":"The audio files were sent to a team of transcribers.","translation":"音声ファイルは、文字起こしをする人たちのチームに送られました。"},{"sentence":"The transcribers had difficulty understanding the speaker's accent.","translation":"書き写す人たちは、話者のアクセントを理解するのに苦労しました。"}],"collocations":["audio transcribers","legal transcribers","medical transcribers"],"synonyms":["copyists","scribes","recorders"],"antonyms":[]}],"etymology":{"value":"From 'transcribe' (to write over, copy) + '-er' (agent suffix indicating a person who performs the action).","priority":"★★☆"},"pronunciation":{"ipa":"/trænˈskraɪbərz/","syllables":"tran-scrib-ers"},"inflection":{"noun_plural":"transcribers"},"usage_notes":{"explanation":"'Transcribers' refers to multiple individuals whose job or task involves transcribing. This can involve converting audio or video recordings into text, or copying information from one format to another. The context often implies the type of material being transcribed (e.g., legal documents, medical records, audio recordings).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The transcriber are working hard.","correct":"✓ The transcribers are working hard.","note":"Since 'transcribers' is plural, use the plural form of the verb 'are'."},{"incorrect":"✗ There was only one transcribers available.","correct":"✓ There was only one transcriber available.","note":"When referring to a single person, use the singular form 'transcriber'."}],"priority":"★★☆"},"related_words":{"derivatives":["transcribe","transcription","transcribed"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Transcribers' is a plural noun referring to multiple people who perform transcription, which is the process of converting speech or data into written form. This word is typically used in professional or academic contexts where transcription services are required. Understanding this word implies familiarity with the concept of transcription and the roles involved in it."},"example_sentences":[{"sentence":"The company hired several freelance transcribers to handle the increased workload.","translation":"その会社は、増えた仕事量を処理するために、数人のフリーランスの文字起こし者を雇いました。","type":"noun","meaning_category":"people who transcribe"},{"sentence":"Our team of experienced transcribers ensures accurate and timely delivery of all transcripts.","translation":"経験豊富な文字起こし者のチームが、すべての文字起こし原稿の正確かつタイムリーな納品を保証します。","type":"noun","meaning_category":"people who transcribe"}]}