{"word":"nonterritorially","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"非領土的に、領土を持たずに","english_definition":"In a manner that does not involve or relate to territory; without having or controlling land.","examples":[{"sentence":"The organization operates nonterritorially, focusing on global issues rather than specific regions.","translation":"その組織は非領土的に活動し、特定の地域ではなく地球規模の問題に焦点を当てています。"},{"sentence":"The company provides its services nonterritorially, reaching customers worldwide through the internet.","translation":"その会社は非領土的にサービスを提供し、インターネットを通じて世界中の顧客にリーチしています。"}],"collocations":["operate nonterritorially","provide services nonterritorially","exist nonterritorially","govern nonterritorially"],"synonyms":["globally","internationally","transnationally","without borders","without land"],"antonyms":["territorially","locally","regionally","nationally"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to the adverb 'territorially'. 'Territorially' is derived from 'territory' (land under jurisdiction) with the suffix '-al' (relating to) and '-ly' (in a manner). Thus, 'nonterritorially' means 'in a manner not related to territory'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˌtɛrɪˈtɔːriəli/","syllables":"non-ter-ri-to-ri-al-ly"},"inflection":{"notes":"As an adverb, 'nonterritorially' does not have different inflections."},"usage_notes":{"explanation":"'Nonterritorially' is used to describe actions, organizations, or entities that do not rely on or are not confined to specific geographic territories. It is often used in the context of global operations, international law, or virtual environments where traditional territorial boundaries are not relevant. The term emphasizes a lack of physical or geographical constraints.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The group worked non-territory.","correct":"✓ The group worked nonterritorially.","note":"'Nonterritorially' is an adverb, so it modifies a verb. 'Non-territory' is not a correct phrase in this context."},{"incorrect":"✗ They are a nonterritorial organization.","correct":"✓ They operate nonterritorially.","note":"While 'nonterritorial organization' might be understood, 'operate nonterritorially' is a more precise and common way to express that an organization's operations are not bound by territory."}],"priority":"★★☆"},"related_words":{"derivatives":["nonterritorial (adjective)","territorial (adjective)","territory (noun)"],"phrases":["nonterritorial waters","nonterritorial jurisdiction","nonterritorial governance"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'nonterritorially' is a complex adverb used to describe something that is done without regard to physical territory or boundaries. It is often used in academic or professional contexts when discussing international relations, global business, or online activities. Understanding the word requires familiarity with the base word 'territory' and the negative prefix 'non-'. It is not a common word in everyday conversation."},"example_sentences":[{"sentence":"The internet allows businesses to operate nonterritorially, reaching customers around the globe.","translation":"インターネットにより、企業は非領土的に事業を展開し、世界中の顧客にリーチできます。","type":"general"},{"sentence":"Some international organizations govern nonterritorially, addressing issues that transcend national borders.","translation":"一部の国際機関は非領土的に統治を行い、国境を越えた問題に取り組んでいます。","type":"political/organizational"},{"sentence":"Cybersecurity threats often operate nonterritorially, making them difficult to trace and combat.","translation":"サイバーセキュリティの脅威はしばしば非領土的に活動するため、追跡や対処が困難です。","type":"technical"}]}