{"word":"Congonhas","priority":"★☆☆","meanings":[{"part_of_speech":"proper noun","definition":"コンゴーニャス (ブラジルのミナスジェライス州にある都市)","english_definition":"A city in the state of Minas Gerais, Brazil. It is known for its baroque architecture and sculptures by Aleijadinho.","examples":[{"sentence":"Congonhas is a historical city in Brazil.","translation":"コンゴーニャスはブラジルの歴史的な都市です。"},{"sentence":"The Sanctuary of Bom Jesus de Matosinhos in Congonhas is a UNESCO World Heritage Site.","translation":"コンゴーニャスのボン・ジェズス・デ・マトジーニョス聖堂は、ユネスコの世界遺産です。"}],"collocations":["Sanctuary of Bom Jesus de Matosinhos","Minas Gerais","Aleijadinho"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Congonhas' is derived from a type of plant abundant in the region.","priority":"★★☆"},"pronunciation":{"ipa":"/kõˈɡõɲɐs/","syllables":"Con-gon-has"},"inflection":{},"usage_notes":{"explanation":"Congonhas is primarily known as a city in Brazil famous for its historical and artistic significance, particularly the works of the sculptor Aleijadinho.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":[],"related_places":["Ouro Preto","Belo Horizonte"],"related_people":["Aleijadinho"]},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, mainly used in contexts related to Brazilian history, art, and travel.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Congonhas' refers to a specific location in Brazil, making it a proper noun. Understanding its significance requires knowledge of Brazilian history, art, and geography. The word is likely encountered in travel guides, historical texts, or art-related discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"We visited the historic churches in Congonhas.","translation":"私たちはコンゴーニャスの歴史的な教会を訪れました。","type":"general","meaning_category":"location"},{"sentence":"The sculptures of the prophets in Congonhas are masterpieces of baroque art.","translation":"コンゴーニャスの預言者たちの彫刻は、バロック美術の傑作です。","type":"art","meaning_category":"art"}]}