{"word":"Ascensions","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)上昇、昇進、即位、キリストの昇天","english_definition":"Plural form of ascension: the act of rising to an important position or a higher level; the act of ascending; (Christianity) the ascent of Christ into heaven.","examples":[{"sentence":"The ascensions of several executives led to changes in company policy.","translation":"数人の幹部の上昇（昇進）は、会社の方針の変更につながった。"},{"sentence":"The ascensions of the climbers were carefully documented.","translation":"登山者たちの上昇は注意深く記録された。"},{"sentence":"The church celebrates the Ascensions of Jesus into Heaven.","translation":"教会はイエスの昇天を祝う。"}],"collocations":["political ascensions","spiritual ascensions","mountain ascensions"],"synonyms":["rise","ascent","elevation","promotion","advancement"],"antonyms":["descent","fall","decline"]},{"part_of_speech":"noun","definition":"(地名)アセンション島 (セントヘレナ、アセンションおよびトリスタンダクーニャの一部)","english_definition":"The plural form of Ascension; may refer to multiple instances of the island or related geographical features.","examples":[{"sentence":"We studied the geology of the islands, including the Ascensions.","translation":"私たちはアセンション諸島を含む、その島の地質を研究しました。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From 'ascension', derived from Latin 'ascensionem' (nominative ascensio) meaning 'a mounting up, ascent', from past participle stem of ascendere 'to climb up, ascend'.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈsɛnʃənz/","syllables":"a-scen-sions"},"inflection":{"noun_plural":"Ascensions"},"usage_notes":{"explanation":"'Ascensions' is the plural form of 'ascension'. It can refer to multiple instances of rising or ascending, such as multiple promotions within a company or multiple ascents of a mountain. It can also refer to the Christian holiday, though 'Ascension' is more common for the singular event. Rarely, it could refer to multiple instances of Ascension Island or related geographical features.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ascension was difficult. There were many ascensions.","correct":"✓ The ascent was difficult. There were many ascents.","note":"'Ascension' refers more to the act or process of ascending, or a specific religious event. 'Ascent' is more commonly used to refer to a physical climb or rise."}],"priority":"★★☆"},"related_words":{"derivatives":["ascension","ascend","ascendant","ascensional"],"phrasal_verbs":[],"related_concepts":["climbing","promotion","religion","Christianity","geography"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ascensions' is a plural noun that primarily refers to multiple instances of rising or ascending, whether in a physical sense (like climbing) or a metaphorical sense (like gaining a higher position). It can also refer to the Christian holiday of Ascension, although the singular form is more common. The word is relatively formal and less frequently used in everyday conversation, making it more common in academic or specialized contexts."},"example_sentences":[{"sentence":"The political ascensions of several leaders changed the country's direction.","translation":"数人の指導者の政治的上昇（昇進）が、国の方向性を変えた。","type":"noun","meaning_category":"昇進"},{"sentence":"Documented ascensions of Mount Everest have increased over the years.","translation":"エベレスト山の記録された上昇（登山）は、年々増加している。","type":"noun","meaning_category":"上昇"},{"sentence":"The theological discussions centered on the Ascensions of Christ.","translation":"神学的議論は、キリストの昇天を中心に展開された。","type":"noun","meaning_category":"キリストの昇天"}]}