{"word":"multi-wavelength","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"多波長の","english_definition":"Involving or utilizing multiple wavelengths of electromagnetic radiation, typically across a broad spectrum.","examples":[{"sentence":"Multi-wavelength observations are crucial for understanding the complex processes in active galaxies.","translation":"多波長観測は、活動銀河における複雑なプロセスを理解するために不可欠です。"},{"sentence":"The multi-wavelength data revealed the presence of a previously undetected supernova remnant.","translation":"多波長データにより、これまで検出されていなかった超新星残骸の存在が明らかになりました。"},{"sentence":"Multi-wavelength imaging is used in medical diagnostics to enhance the contrast of different tissues.","translation":"多波長イメージングは、さまざまな組織のコントラストを高めるために医療診断で使用されます。"}],"collocations":["multi-wavelength astronomy","multi-wavelength data","multi-wavelength observations","multi-wavelength imaging","multi-wavelength analysis"],"synonyms":["polychromatic","broadband"],"antonyms":["monochromatic","single-wavelength"]},{"part_of_speech":"noun","definition":"多波長（の）","english_definition":"The use of multiple wavelengths of electromagnetic radiation for observation, analysis, or imaging.","examples":[{"sentence":"The study of the object was conducted using multi-wavelength techniques.","translation":"その物体の研究は、多波長技術を用いて行われました。"},{"sentence":"Multi-wavelength provides a more complete picture of the phenomenon.","translation":"多波長は、その現象のより完全な像を提供します。"}],"collocations":["use of multi-wavelength","multi-wavelength approach","multi-wavelength study"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term is formed by combining the prefix 'multi-' (meaning many or multiple) with 'wavelength', indicating the use of multiple wavelengths of electromagnetic radiation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmʌltiˈweɪvˌlɛŋθ/","syllables":"mul-ti-wave-length"},"inflection":{"notes":"The term 'multi-wavelength' primarily functions as an adjective. It can also be used as a noun to refer to the technique itself, but this is less common."},"usage_notes":{"explanation":"'Multi-wavelength' is commonly used in scientific fields such as astronomy, physics, and medical imaging. It refers to the practice of collecting and analyzing data across a wide range of the electromagnetic spectrum, including radio waves, infrared, visible light, ultraviolet, X-rays, and gamma rays. This approach provides a more comprehensive understanding of the observed phenomena, as different wavelengths reveal different aspects of the object or process under investigation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ single-wavelength data was used.","correct":"✓ Single-wavelength data was used.","note":"Hyphenate 'single-wavelength' when used as an adjective before a noun."},{"incorrect":"✗ The multiwavelength is important.","correct":"✓ Multi-wavelength data is important.","note":"'Multi-wavelength' is usually an adjective. If referring to the technique, use 'multi-wavelength analysis' or similar."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["electromagnetic spectrum","wavelength","spectroscopy","astronomy","physics","imaging"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency - Primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'multi-wavelength' is primarily used in scientific and technical contexts, particularly in fields like astronomy, physics, and medical imaging. It describes methods or data that involve multiple wavelengths of electromagnetic radiation. Understanding this term requires familiarity with basic concepts of the electromagnetic spectrum and the properties of different wavelengths. The term is not commonly used in everyday language."},"example_sentences":[{"sentence":"The team conducted a **multi-wavelength** survey of the galaxy.","translation":"チームは、その銀河の多波長サーベイを実施しました。","type":"adjective","meaning_category":"Describing a survey"},{"sentence":"**Multi-wavelength** observations are essential for studying black holes.","translation":"多波長観測は、ブラックホールを研究するために不可欠です。","type":"noun (as a concept)","meaning_category":"Referring to the technique"},{"sentence":"The **multi-wavelength** approach allowed them to identify the source of the gamma-ray burst.","translation":"多波長アプローチにより、彼らはガンマ線バーストの発生源を特定することができました。","type":"adjective","meaning_category":"Describing an approach"}]}