{"word":"benignly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"優しく、親切に、穏やかに、慈悲深く","english_definition":"in a gentle, kind, or benevolent manner; favorably.","examples":[{"sentence":"The old woman smiled benignly at the children.","translation":"老婆は子供たちに優しく微笑んだ。"},{"sentence":"The judge looked upon the defendant benignly.","translation":"裁判官は被告を慈悲深く見つめた。"},{"sentence":"The weather treated the crops benignly this year.","translation":"今年は天候が穏やかで、作物は順調に育った。"}],"collocations":["smile benignly","look upon benignly","treat benignly"],"synonyms":["kindly","gently","benevolently","favorably","graciously","compassionately"],"antonyms":["harshly","severely","cruelly","malignantly"]}],"etymology":{"value":"benign + -ly","priority":"★★☆"},"pronunciation":{"ipa":"/bɪˈnaɪnli/","syllables":"be-nign-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"\"Benignly\" describes actions or appearances that are gentle, kind, or favorable. It often implies a position of authority or seniority from which kindness is extended. It can also describe conditions that are favorable or gentle, such as weather.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He behaved benignly, so everyone was afraid of him.","correct":"✓ He behaved harshly, so everyone was afraid of him.","note":"\"Benignly\" implies kindness and gentleness, not fear. The opposite of benignly, such as \"harshly,\" would be more appropriate in this context."},{"incorrect":"✗ The tumor grew benignly.","correct":"✓ The tumor grew slowly.","note":"While \"benign\" describes a non-cancerous tumor, \"benignly\" is not typically used to describe the growth of a tumor. Instead, describe the growth directly (e.g., slowly, steadily)."}],"priority":"★★☆"},"related_words":{"derivatives":["benign (adjective)","benignity (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"benignly\" is an adverb that describes something done in a kind, gentle, or favorable way. It's not a very common word, and you're more likely to see its adjective form, \"benign.\" It's often used to describe someone in a position of power or authority acting kindly. It can also be used to describe something that has a good or favorable effect.","priority":"★★☆"},"example_sentences":[{"sentence":"The teacher smiled benignly at the student who answered the question correctly.","translation":"先生は正しく答えた生徒に優しく微笑んだ。","type":"general","meaning_category":"優しく・親切に"},{"sentence":"The government looked benignly on the new project, offering support and resources.","translation":"政府はその新しいプロジェクトを好意的に見て、支援と資源を提供した。","type":"general","meaning_category":"好意的に"},{"sentence":"The sun shone benignly, warming the earth after a long winter.","translation":"太陽は優しく輝き、長い冬の後に大地を暖めた。","type":"general","meaning_category":"穏やかに"}]}