{"word":"uredo-fruit","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A fruit that is produced by a plant infected with a rust fungus, specifically a uredinial fungus, and bearing urediniospores.","english_definition":"A fruit produced by a plant infected with a rust fungus, bearing urediniospores.","examples":[{"sentence":"The uredo-fruit was covered in orange pustules.","translation":"そのuredo-fruitはオレンジ色の膿疱で覆われていた。"},{"sentence":"The farmer identified the disease by the presence of uredo-fruits on his crops.","translation":"農家は作物にuredo-fruitがあることで病気を特定した。"}],"collocations":["uredinial fungus","rust fungus","urediniospores","infected plant"],"synonyms":["rust-infected fruit"],"antonyms":[]}],"etymology":{"value":"Derived from 'uredo', referring to the uredinial stage of rust fungi, and 'fruit', indicating the plant's reproductive structure.","priority":"★★★"},"pronunciation":{"ipa":"/juˈriːdoʊˌfruːt/","syllables":"u-re-do-fruit"},"inflection":{"noun_plural":"uredo-fruits"},"usage_notes":{"explanation":"This term is primarily used in plant pathology and mycology to describe the altered fruit structure resulting from a rust fungal infection. The fruit is typically not edible and serves as a site for the production and dispersal of urediniospores, which spread the infection.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant produced normal fruits and uredo-fruits.","correct":"✓ The plant produced normal fruits and, separately, exhibited uredo-fruits due to the rust infection.","note":"Uredo-fruits are not normal fruits but are the result of a pathological condition caused by fungal infection."}],"priority":"★★☆"},"related_words":{"derivatives":["uredo (noun: the uredinial stage of a rust fungus)","uredinial (adjective: relating to the uredinial stage)","urediniospore (noun: a type of spore produced in the uredinial stage)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency (Specialized term)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'uredo-fruit' is highly specialized, primarily used within the fields of mycology and plant pathology. It refers to a fruit that has been pathologically altered due to infection by a rust fungus, specifically during the uredinial stage. Understanding requires knowledge of fungal life cycles and plant diseases. The term is not commonly encountered outside of scientific literature and discussions within these specialized domains."},"example_sentences":[{"sentence":"Microscopic examination revealed numerous urediniospores on the surface of the uredo-fruit.","translation":"顕微鏡検査により、uredo-fruitの表面に多数のurediniosporeが観察された。","type":"scientific","meaning_category":"description"},{"sentence":"The presence of uredo-fruits indicates a severe rust infection in the orchard.","translation":"uredo-fruitの存在は、果樹園における深刻なサビ病の感染を示している。","type":"agricultural","meaning_category":"diagnosis"}]}