{"word":"peptonized","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"ペプトン化された、ペプトンに分解された","english_definition":"(of food or other substances) having been treated with pepsin to break down proteins into peptones, making it more easily digestible.","examples":[{"sentence":"Peptonized milk is sometimes used for infants with digestive problems.","translation":"ペプトン化された牛乳は、消化器系の問題がある乳児に使用されることがあります。"},{"sentence":"The peptonized beef extract was used as a nutrient source for the bacteria.","translation":"ペプトン化された牛肉エキスは、バクテリアの栄養源として使用されました。"}],"collocations":["peptonized milk","peptonized beef extract","peptonized food"],"synonyms":["predigested","hydrolyzed"],"antonyms":["unprocessed","whole"]},{"part_of_speech":"verb","definition":"ペプトン化する (peptonize の過去分詞)","english_definition":"past participle of peptonize: to treat (food or other substances) with pepsin to break down proteins into peptones.","examples":[{"sentence":"The milk was peptonized to make it easier for the patient to digest.","translation":"牛乳は、患者が消化しやすくするためにペプトン化されました。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Peptonized' is derived from the verb 'peptonize,' which comes from 'peptone' (a product of protein digestion) + '-ize' (a suffix indicating a process or action).","priority":"★★☆"},"pronunciation":{"ipa":"ˈpeptəˌnaɪzd","syllables":"pep-to-nized"},"inflection":{"notes":"This is the past participle and adjective form of the verb 'peptonize'."},"usage_notes":{"explanation":"'Peptonized' describes something that has undergone peptonization, a process where proteins are broken down into smaller, more soluble peptones. This is typically done to make food or other substances more easily digestible or absorbable. It is often used in medical or nutritional contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The peptonized food was very protein-rich.","correct":"✓ The peptonized food was easily digestible.","note":"Peptonization breaks down proteins, so while the original substance may have been protein-rich, the peptonized product is characterized by its digestibility, not necessarily its protein content."}],"priority":"★★☆"},"related_words":{"derivatives":["peptonize (verb)","peptonization (noun)","peptone (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'peptonized' is a technical term primarily used in contexts related to nutrition, medicine, and biochemistry. It refers to a substance, typically food, that has been treated to break down its proteins into smaller, more easily digestible components called peptones. Understanding this word requires familiarity with basic concepts of protein digestion and enzymatic processes. It is not commonly encountered in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor recommended peptonized baby food for the infant with malabsorption issues.","translation":"医師は、吸収不良の問題がある乳児にペプトン化されたベビーフードを勧めました。","type":"adjective","meaning_category":"ペプトン化された"},{"sentence":"The sample was peptonized to facilitate the analysis of its amino acid content.","translation":"サンプルは、アミノ酸含有量の分析を容易にするためにペプトン化されました。","type":"verb (past participle)","meaning_category":"ペプトン化された"}]}