{"word":"Affectationist","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"A person who uses affectation; one who affects a particular manner or style, often to impress others.","english_definition":"A person characterized by affectation; someone who adopts artificial behaviors or mannerisms to impress or deceive others.","examples":[{"sentence":"The affectationist's elaborate speech and exaggerated gestures were seen as insincere.","translation":"その気取り屋の凝った話し方と大げさな身振りは、誠実ではないと見なされた。"},{"sentence":"He was regarded as an affectationist because of his pretentious displays of knowledge.","translation":"彼は知識をこれみよがしに見せびらかすため、気取り屋と見なされた。"}],"collocations":["affected manner","affected speech","affected style"],"synonyms":["poseur","pretender","show-off","fop","dandy"],"antonyms":["genuine","sincere","authentic"]}],"etymology":{"value":"Derived from 'affectation' (the act of affecting or assuming an artificial manner) + '-ist' (a suffix denoting a person who practices or is concerned with something).","priority":"Medium"},"pronunciation":{"ipa":"/əˌfɛkˈteɪʃənɪst/","syllables":"uh-fek-tay-shuh-nist"},"inflection":{"noun_plural":"Affectationists"},"usage_notes":{"explanation":"The term 'affectationist' is used to describe someone who habitually uses affectation. It implies a deliberate attempt to impress or deceive through artificial behavior.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"He is a true artist, not an affectationist.","correct":"He is a true artist, not an affecter.","note":"'Affecter' might be used instead, though 'affectationist' is more specific in implying a habitual practice of affectation."}],"priority":"Low"},"related_words":{"derivatives":["affectation","affected","affectedly"],"related_terms":["pose","pretension","mannerism"]},"level_frequency":{"frequency_google_ngram":"Very Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"The word 'affectationist' is relatively uncommon and implies a sophisticated understanding of social behaviors and motivations. It is used to describe someone who consistently uses artificial mannerisms to impress or deceive, suggesting a critical or negative view of their character."},"example_sentences":[{"sentence":"The critic described the actor as an affectationist, noting his unnatural delivery of lines.","translation":"評論家は、その俳優のセリフ回しが不自然であると指摘し、気取り屋だと評した。","type":"general","meaning_category":"General Use"},{"sentence":"She dismissed him as merely an affectationist, uninterested in genuine connection.","translation":"彼女は彼を単なる気取り屋として一蹴し、真のつながりには興味がないと判断した。","type":"character assessment","meaning_category":"Character Assessment"}]}