{"word":"Oralities","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"口頭性、口述性、口承文化、口頭伝承","english_definition":"The qualities or characteristics of spoken communication, traditions, and cultures; the state of being oral.","examples":[{"sentence":"The project explores the oralities of indigenous communities.","translation":"そのプロジェクトは、先住民族コミュニティの口頭性を探求する。"},{"sentence":"Oralities play a crucial role in preserving cultural heritage.","translation":"口頭性は、文化遺産の保存において重要な役割を果たす。"},{"sentence":"The study examines the shift from oralities to literacy.","translation":"その研究は、口頭性から識字への移行を検証する。"}],"collocations":["oral cultures","oral traditions","primary orality","secondary orality"],"synonyms":["spoken language","verbal communication","oral tradition","storytelling"],"antonyms":["literacy","written language","written communication"]}],"etymology":{"value":"Derived from 'oral', with the suffix '-ities' indicating qualities, characteristics, or instances of being oral.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɔːrælɪtiz/","syllables":"o-ral-i-ties"},"inflection":{"noun_plural":"oralities"},"usage_notes":{"explanation":"'Oralities' refers to the characteristics and dynamics of cultures that rely on spoken communication rather than written text. It encompasses various aspects such as storytelling, oral traditions, and the transmission of knowledge through spoken word. It is often used in anthropological, sociological, and linguistic contexts to describe and analyze cultures where spoken language is the primary means of communication and cultural preservation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The oralities is important for understanding their culture.","correct":"✓ Oralities are important for understanding their culture.","note":"'Oralities' is generally used as a plural noun, referring to the various aspects and characteristics of oral culture."}],"priority":"★☆☆"},"related_words":{"derivatives":["oral","orality"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Oralities' is a more academic term referring to the characteristics of oral cultures and traditions. It is used in fields like anthropology and linguistics to discuss how cultures transmit knowledge and values through spoken language rather than written text. Understanding this term helps in analyzing cultural practices and communication styles in societies that prioritize spoken communication."},"example_sentences":[{"sentence":"The museum exhibit highlighted the diverse oralities of African tribes.","translation":"博物館の展示では、アフリカの部族の多様な口頭性が強調されていた。","type":"noun","meaning_category":"口頭性"},{"sentence":"Researchers are studying the impact of technology on traditional oralities.","translation":"研究者たちは、伝統的な口頭性に対するテクノロジーの影響を研究している。","type":"noun","meaning_category":"口頭性"},{"sentence":"The preservation of oralities is essential for maintaining cultural identity.","translation":"口頭性の保存は、文化的なアイデンティティを維持するために不可欠である。","type":"noun","meaning_category":"口頭性"}]}