{"word":"ejection","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"放出、排出、噴出","english_definition":"The act of forcing something out; expulsion.","examples":[{"sentence":"The ejection of smoke from the chimney was visible from miles away.","translation":"煙突からの煙の放出は何マイルも先から見えた。"},{"sentence":"The volcano's ejection of lava created a spectacular display.","translation":"火山からの溶岩の噴出は壮観な光景を作り出した。"}],"collocations":["ejection of gas","ejection of fluid","ejection of particles"],"synonyms":["expulsion","discharge","emission","release","discharge"],"antonyms":["absorption","intake","retention"]},{"part_of_speech":"noun","definition":"追放、排除、退去","english_definition":"The act of forcing someone to leave a place or position.","examples":[{"sentence":"His ejection from the team was a result of his poor behavior.","translation":"彼のチームからの追放は、彼の悪い行いの結果だった。"},{"sentence":"The unruly fan faced ejection from the stadium.","translation":"手に負えないファンはスタジアムからの退去を命じられた。"}],"collocations":["ejection from school","ejection from a club","ejection from a game"],"synonyms":["expulsion","removal","dismissal","banishment","ousting"],"antonyms":["admission","acceptance","inclusion"]},{"part_of_speech":"noun","definition":"（航空機の）射出、緊急脱出","english_definition":"The forced discharge of a pilot from an aircraft in an emergency, typically using an ejection seat.","examples":[{"sentence":"The pilot made a successful ejection before the plane crashed.","translation":"パイロットは飛行機が墜落する前に、射出に成功した。"},{"sentence":"The ejection seat saved his life.","translation":"射出座席が彼の命を救った。"}],"collocations":["ejection seat","emergency ejection","forced ejection"],"synonyms":["bailout","escape","emergency exit"],"antonyms":[]}],"etymology":{"value":"From Latin ējectiōnem (nominative ējectiō) \"a throwing out, casting out,\" noun of action from past participle stem of ēicere \"to cast out, throw out; expel, banish,\" from ex \"out\" (see ex-) + iacere \"to throw\" (from PIE root *ye- \"to throw, impel\").","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈdʒekʃən/","syllables":"e-jec-tion"},"inflection":{"noun_plural":"ejections"},"usage_notes":{"explanation":"The word \"ejection\" refers to the act of forcing something out, whether it's a substance, a person, or a pilot from an aircraft. It can be used in various contexts, from describing volcanic eruptions to disciplinary actions. The specific meaning depends on the context in which it is used. In aviation, it specifically refers to the use of an ejection seat to escape a failing aircraft.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The injection of the pilot was successful.","correct":"✓ The ejection of the pilot was successful.","note":"\"Injection\" means to insert something, while \"ejection\" means to force something out."},{"incorrect":"✗ The expulsion of the lava was a great ejection.","correct":"✓ The expulsion of the lava was a great eruption.","note":"While \"ejection\" can refer to the expulsion of lava, \"eruption\" is a more common and specific term for a volcanic event."}],"priority":"★★☆"},"related_words":{"derivatives":["eject (verb)","ejector (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but appears in technical and formal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Ejection\" is a formal word that describes the act of forcing something out. It can refer to the expulsion of substances like smoke or lava, the removal of someone from a place or position, or the emergency escape of a pilot from an aircraft using an ejection seat. The word is often used in technical or formal contexts and may not be familiar to casual English speakers. Understanding the context is important to determine the specific meaning of \"ejection.\"","priority":"★★☆"},"example_sentences":[{"sentence":"The **ejection** of the pilot was a last resort.","translation":"パイロットの射出は最後の手段だった。","type":"noun","meaning_category":"射出"},{"sentence":"The **ejection** of waste products is a vital bodily function.","translation":"老廃物の排出は、生命維持に不可欠な身体機能である。","type":"noun","meaning_category":"放出"},{"sentence":"His **ejection** from the club was a major setback for his career.","translation":"彼のクラブからの追放は、彼のキャリアにとって大きな痛手だった。","type":"noun","meaning_category":"追放"}]}