{"word":"re-enfeoffment","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史)再封授、再封建","english_definition":"(historical) The act of enfeoffing again; a second or renewed enfeoffment.","examples":[{"sentence":"The re-enfeoffment of the vassal was necessary after the death of the previous lord.","translation":"以前の領主の死後、家臣の再封授が必要となった。"},{"sentence":"Re-enfeoffment was a common practice to transfer land ownership while avoiding certain feudal dues.","translation":"再封授は、特定の封建的義務を回避しながら土地所有権を移転するための一般的な慣習であった。"}],"collocations":["re-enfeoffment of land","re-enfeoffment to a new tenant"],"synonyms":["regrant","re-investiture"],"antonyms":[]},{"part_of_speech":"noun","definition":"(法律)再封授証書","english_definition":"(law) A deed or instrument effecting a re-enfeoffment.","examples":[{"sentence":"The re-enfeoffment document outlined the terms of the new land tenure.","translation":"再封授証書は、新たな土地保有の条件を概説していた。"}],"collocations":["re-enfeoffment deed","re-enfeoffment instrument"],"synonyms":["regrant document","re-investiture deed"],"antonyms":[]}],"etymology":{"value":"Derived from \"re-\" (again) + \"enfeoffment\" (the act of investing with a fief or feudal tenancy).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːɪnˈfiːfmənt/","syllables":"re-in-feoff-ment"},"inflection":{"noun_plural":"re-enfeoffments"},"usage_notes":{"explanation":"\"Re-enfeoffment\" is a historical term primarily used in the context of feudalism. It refers to the act of granting land or a fief again, often to the same person or their heir, or to a new tenant. This process was sometimes used to circumvent feudal obligations or to update the terms of land tenure. The term is rarely used in modern contexts outside of historical discussions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The king made a reenfeoffment of the land.","correct":"✓ The king made a re-enfeoffment of the land.","note":"The correct spelling includes a hyphen: re-enfeoffment."}],"priority":"★★☆"},"related_words":{"derivatives":["enfeoff (verb: to invest with a fief)","enfeoffment (noun: the act of investing with a fief)","feoff (noun: a fief or feudal landholding)","feoffee (noun: a person who is granted a feoff)","feoffor (noun: a person who grants a feoff)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized historical term)","frequency_google_ngram":"Very low frequency - primarily used in historical texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Re-enfeoffment\" is a technical term related to feudal history. It signifies the act of granting land or a fief again, either to the original tenant or to a new one. This practice was often employed to transfer land ownership or to avoid certain feudal dues. Understanding this term requires a solid grasp of feudal systems and historical legal practices. Its usage is largely confined to historical or legal contexts dealing with feudalism.","priority":"★★☆"},"example_sentences":[{"sentence":"The lord ordered a re-enfeoffment of the manor to his eldest son.","translation":"領主は荘園の再封授を長男に命じた。","type":"noun","meaning_category":"再封授"},{"sentence":"The re-enfeoffment document specified the services owed by the new tenant.","translation":"再封授証書は、新しいテナントが負うべき義務を明記していた。","type":"noun","meaning_category":"再封授証書"}]}