{"word":"most-liked","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"最も好かれている、一番人気のある","english_definition":"liked by more people than anything or anyone else","examples":[{"sentence":"She was the most-liked teacher in the school.","translation":"彼女は学校で一番人気の先生でした。"}],"collocations":["most-liked post","most-liked video","most-liked comment","most-liked song"],"synonyms":["favorite","popular","best-loved"],"antonyms":["least-liked","most-hated"]}],"etymology":{"value":"Combination of 'most' (superlative of 'much' or 'many') and 'liked' (past participle of 'like'). Indicates the highest degree of being liked.","priority":"N/A"},"pronunciation":{"ipa":"/ˈmoʊst ˈlaɪkt/","syllables":"most-liked"},"inflection":{"notes":"Adjective; does not inflect further."},"usage_notes":{"explanation":"'Most-liked' is typically used in contexts where there is a clear ranking or comparison of preferences, such as on social media platforms, in surveys, or within a group of options. It indicates the item or person that has received the greatest amount of positive feedback or appreciation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ This is the most liked of all comments.","correct":"✓ This is the most-liked comment of all.","note":"Using 'most-liked' as a compound adjective before the noun is more concise and common than separating 'most' and 'liked'."},{"incorrect":"✗ She is the most liked teacher.","correct":"✓ She is the most-liked teacher.","note":"Hyphenating 'most-liked' when it precedes the noun it modifies makes it clear that it's a single compound adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["like","liked","liking","most"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively frequent in online contexts, especially social media.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Most-liked' is a compound adjective used to describe something that is preferred by the largest number of people. It is commonly used in online contexts, such as social media, to indicate the content that has received the most positive feedback. The term is relatively straightforward, but understanding its usage is important for comprehending online discussions and rankings."},"example_sentences":[{"sentence":"The most-liked photo on her Instagram account was a picture of her dog.","translation":"彼女のインスタグラムアカウントで最も好かれている写真は、彼女の犬の写真でした。","type":"adjective","meaning_category":"一番人気"},{"sentence":"Which video is the most-liked on this channel?","translation":"このチャンネルで一番人気のビデオはどれですか？","type":"adjective","meaning_category":"一番人気"},{"sentence":"The most-liked suggestion was to offer free shipping.","translation":"最も好かれた提案は、送料無料を提供することでした。","type":"adjective","meaning_category":"一番人気"}]}