{"word":"putteringly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"(機械などが)ポツポツと音を立てて、ぶつぶつ言いながら、のろのろと","english_definition":"in a manner characterized by a soft, intermittent sound (as of an engine); in a fussy, ineffective way; in a slow, leisurely way.","examples":[{"sentence":"The old engine ran putteringly, struggling to maintain speed.","translation":"古いエンジンはポツポツと音を立てながら、速度を維持するのに苦労していた。"},{"sentence":"He worked putteringly in the garden, never quite finishing any task.","translation":"彼は庭でぶつぶつ言いながら作業をしていたが、結局どの作業も終えることはなかった。"},{"sentence":"She moved putteringly about the house, tidying up here and there.","translation":"彼女は家の中をのろのろと動き回り、あちこちを片付けていた。"}],"collocations":["run putteringly","work putteringly","move putteringly"],"synonyms":["sputteringly","ineffectually","leisurely","slowly","aimlessly"],"antonyms":["powerfully","efficiently","quickly","purposefully"]}],"etymology":{"value":"Derived from the verb 'putter' (to make a soft, intermittent sound; to busy oneself in an aimless way) with the addition of the adverbial suffix '-ingly'. The verb 'putter' is likely imitative in origin, reflecting the sound it describes.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpʌtərɪŋli/","syllables":"put-ter-ing-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Putteringly' describes an action performed in a way that is both characterized by a soft, intermittent sound (as of an engine) and also somewhat aimless or ineffective. It can also describe movement that is slow and leisurely. The word often carries a connotation of gentle activity without a strong sense of purpose.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The car drove putteringly down the highway at 80 mph.","correct":"✓ The car drove slowly down the highway at 80 mph.","note":"'Putteringly' implies a lack of power or speed, so it's not appropriate to use it to describe something moving quickly."},{"incorrect":"✗ She sang putteringly on the stage.","correct":"✓ She sang softly on the stage.","note":"'Putteringly' refers to a specific type of sound, not just any soft sound. 'Softly' would be a more appropriate descriptor for singing."}],"priority":"★★☆"},"related_words":{"derivatives":["putter (verb: to make a soft, intermittent sound; to busy oneself in an aimless way; noun: a person who putters)","puttering (adjective: characterized by puttering)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (not commonly found in CEFR level vocabulary lists)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Putteringly' is a relatively uncommon adverb that describes an action done in a way that is both characterized by a soft, intermittent sound (like a small engine) and somewhat aimless or ineffective. It suggests a gentle, unhurried, and perhaps slightly disorganized manner of doing something. Because of its specific meaning and relatively low frequency, it is more likely to be encountered in advanced texts or contexts. Understanding the verb 'putter' is helpful in grasping the meaning of 'putteringly.'"},"example_sentences":[{"sentence":"The motorboat chugged putteringly across the lake.","translation":"モーターボートは湖をポツポツと音を立てながら進んだ。","type":"general"},{"sentence":"He spent the afternoon putteringly repairing his bicycle.","translation":"彼は午後を自転車の修理にぶつぶつ言いながら費やした。","type":"general"},{"sentence":"The old woman walked putteringly down the lane, stopping to admire the flowers.","translation":"老婆はのろのろと小道を歩き、花を鑑賞するために立ち止まった。","type":"general"}]}