{"word":"dilatometer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"膨張計","english_definition":"An instrument for measuring the expansion of a solid, liquid, or gas caused by changes in temperature or pressure.","examples":[{"sentence":"The dilatometer is used to measure the thermal expansion coefficient of the material.","translation":"膨張計は、材料の熱膨張係数を測定するために使用されます。"},{"sentence":"Different types of dilatometers exist for various applications.","translation":"様々な用途のために、異なる種類の膨張計が存在します。"}],"collocations":["thermal dilatometer (熱膨張計)","push-rod dilatometer (プッシュロッド式膨張計)","optical dilatometer (光学式膨張計)","measure with a dilatometer (膨張計で測定する)"],"synonyms":["expansometer"],"antonyms":[]}],"etymology":{"value":"From 'dilate' (to widen, expand) + '-o-' (connecting vowel) + '-meter' (measuring instrument).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdaɪləˈtɑːmɪtər/","syllables":"di-la-tom-e-ter"},"inflection":{"noun_plural":"dilatometers"},"usage_notes":{"explanation":"A dilatometer is a scientific instrument used to measure the change in volume of a substance as a function of temperature or pressure. It is commonly used in materials science and engineering to determine the thermal expansion coefficients of solids, liquids, and gases. Different types of dilatometers exist, each suited for specific materials and temperature ranges.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The dilatometer measures the temperature directly.","correct":"✓ The dilatometer measures the change in volume due to temperature.","note":"A dilatometer measures the change in volume or length, not the temperature itself. Temperature is a controlled variable in the experiment."}],"priority":"★☆☆"},"related_words":{"derivatives":["dilatation (膨張)","dilation (拡張)"],"related_terms":["thermomechanical analysis (TMA) (熱機械分析)","thermal expansion (熱膨張)","coefficient of thermal expansion (熱膨張係数)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'dilatometer' is a technical term used in scientific and engineering contexts, specifically related to materials science and thermal analysis. Understanding requires knowledge of physics and material properties. The word itself implies a device for measuring expansion, which is a key concept in thermal behavior of materials."},"example_sentences":[{"sentence":"The engineer used a high-precision dilatometer to analyze the expansion of the alloy.","translation":"エンジニアは、合金の膨張を分析するために高精度の膨張計を使用しました。","type":"general"},{"sentence":"The data from the dilatometer helped determine the optimal operating temperature for the device.","translation":"膨張計からのデータは、デバイスの最適な動作温度を決定するのに役立ちました。","type":"application"}]}