{"word":"Basidiomycetes","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"担子菌類","english_definition":"a large class of fungi (subdivision Basidiomycota) that produce sexually by means of basidiospores. They include mushrooms, puffballs, rusts, and smuts.","examples":[{"sentence":"Mushrooms are a well-known example of Basidiomycetes.","translation":"キノコは担子菌類のよく知られた例です。"},{"sentence":"Basidiomycetes play an important role in forest ecosystems.","translation":"担子菌類は森林生態系において重要な役割を果たしています。"}],"collocations":["Basidiomycetes fungi (担子菌類)","Basidiomycetes spores (担子菌類の胞子)","classify as Basidiomycetes (担子菌類に分類する)"],"synonyms":["Basidiomycota (より上位の分類群)"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'basis' (base, foundation) and 'mykes' (fungus), referring to the basidium, the structure on which the spores are produced.","priority":"★★☆"},"pronunciation":{"ipa":"/bəˌsɪdi.oʊmaɪˈsiːtiːz/","syllables":"ba-sid-i-o-my-ce-tes"},"inflection":{"noun_plural":"Basidiomycetes (already plural in form, often used as a singular collective noun)"},"usage_notes":{"explanation":"'Basidiomycetes' refers to a large and diverse group of fungi characterized by the production of basidiospores on basidia. It's a taxonomic term used in biology and mycology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Basidiomycete is a type of mushroom.","correct":"✓ A basidiomycete is a type of fungus. / ✓ Mushrooms are a type of basidiomycete.","note":"'Basidiomycete' (singular) refers to an individual fungus within the Basidiomycetes class. Mushrooms are examples of basidiomycetes, but not all basidiomycetes are mushrooms."}],"priority":"★★☆"},"related_words":{"derivatives":["basidium (担子器)","basidiospore (担子胞子)","Basidiomycota (担子菌門)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門的な学術用語)","frequency_google_ngram":"低頻度 (Low frequency) - 専門分野でのみ使用される単語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Basidiomycetes' is a technical term used in biology, specifically in mycology (the study of fungi). It refers to a large group of fungi that produce spores on structures called basidia. Understanding this term requires some background knowledge in biology or mycology. It is not commonly used in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"Many edible mushrooms belong to the class Basidiomycetes.","translation":"多くの食用キノコは担子菌類に属する。","type":"noun","meaning_category":"分類群"},{"sentence":"Scientists study the genetic diversity of Basidiomycetes to understand their evolution.","translation":"科学者たちは担子菌類の遺伝的多様性を研究して、その進化を理解しようとしている。","type":"noun","meaning_category":"分類群"}]}