{"word":"intermunicipality","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"市町村間連携、複数の市町村にまたがる地域","english_definition":"An area or organization involving or relating to multiple municipalities.","examples":[{"sentence":"The intermunicipality agreement allows for shared services between the towns.","translation":"その市町村間協定により、各町はサービスを共有できる。"},{"sentence":"The project is an intermunicipality initiative to improve transportation.","translation":"そのプロジェクトは、交通機関を改善するための市町村間連携の取り組みである。"}],"collocations":["intermunicipality cooperation (市町村間協力)","intermunicipality agreement (市町村間協定)","intermunicipality project (市町村間プロジェクト)"],"synonyms":["regional","multi-jurisdictional"],"antonyms":["local","municipal"]}],"etymology":{"value":"Derived from the prefix 'inter-' (between, among) and 'municipality' (a city or town with local government).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪntərˌmjuːˌnɪsɪˈpæləti/","syllables":"in-ter-mu-ni-ci-pa-li-ty"},"inflection":{"noun_plural":"intermunicipalities"},"usage_notes":{"explanation":"'Intermunicipality' refers to something that involves or connects multiple municipalities. It's often used in the context of agreements, projects, or organizations that span across different municipal boundaries.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The intermunicipality is only for cities.","correct":"✓ The intermunicipality is for cities and towns.","note":"Intermunicipalities can include various types of municipalities, not just cities."}],"priority":"★☆☆"},"related_words":{"derivatives":["intermunicipal (adjective)"],"related_terms":["municipality","municipal","regionalism","cooperation"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Intermunicipality' is a term used to describe collaborations, agreements, or projects that involve multiple municipalities (cities, towns, or districts with their own local government). It's often used in formal or technical contexts related to regional planning, governance, or shared services. The term implies a level of cooperation and coordination between different local government entities to achieve common goals or address shared challenges."},"example_sentences":[{"sentence":"The intermunicipality transit system serves three neighboring towns.","translation":"その市町村間交通システムは、隣接する3つの町にサービスを提供している。","type":"noun","meaning_category":"市町村間連携"},{"sentence":"The intermunicipality water agreement ensures a stable water supply for all residents.","translation":"その市町村間水道協定は、すべての住民に安定した水の供給を保証する。","type":"noun","meaning_category":"市町村間連携"}]}