{"word":"Ottomanize","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"オスマン帝国化する、オスマン帝国の影響下におく","english_definition":"To bring under Ottoman rule or influence; to make Ottoman in character or culture.","examples":[{"sentence":"The government sought to Ottomanize the newly conquered territories.","translation":"政府は新たに征服した地域をオスマン帝国化しようとした。"},{"sentence":"The architecture of the city was Ottomanized over several centuries.","translation":"その都市の建築は数世紀にわたってオスマン帝国化された。"}],"collocations":["Ottomanize a region","Ottomanize the culture","Ottomanize the administration"],"synonyms":["Turkify","Islamize","integrate into the Ottoman Empire"],"antonyms":["De-Ottomanize","Westernize","Europeanize"]},{"part_of_speech":"verb","transitivity":"vi","definition":"オスマン帝国の影響を受ける、オスマン風になる","english_definition":"To become Ottoman in character or culture.","examples":[{"sentence":"The local customs gradually Ottomanized.","translation":"地元の習慣は徐々にオスマン風になった。"},{"sentence":"The cuisine in that region began to Ottomanize after the conquest.","translation":"その地域の料理は征服後、オスマン風になり始めた。"}],"collocations":["Ottomanize gradually","Ottomanize over time"],"synonyms":["become Turkified","become Islamized"],"antonyms":["De-Ottomanize","become Westernized","become Europeanized"]}],"etymology":{"value":"From 'Ottoman' (referring to the Ottoman Empire) + '-ize' (a suffix indicating a process of becoming or causing to become).","priority":"★★★"},"pronunciation":{"ipa":"/ˈɒtəmənaɪz/","syllables":"Ot-to-man-ize"},"inflection":{"verb_forms":{"present_simple":["Ottomanize","Ottomanizes"],"past_simple":"Ottomanized","past_participle":"Ottomanized","present_participle":"Ottomanizing"}},"usage_notes":{"explanation":"'Ottomanize' refers to the process of something or someone becoming more like the Ottoman Empire in terms of culture, administration, or control. It can be used to describe both the active process of imposing Ottoman influence and the passive process of adopting Ottoman characteristics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The city was Ottomanized with French architecture.","correct":"✓ The city was Ottomanized, incorporating some French architectural elements.","note":"Ottomanizing means adopting Ottoman characteristics, so it's contradictory to say something was Ottomanized with non-Ottoman elements. Instead, specify that Ottomanization included incorporating some foreign elements."}],"priority":"★☆☆"},"related_words":{"derivatives":["Ottomanization (noun): The process of becoming Ottomanized.","Ottoman (adjective/noun): Relating to the Ottoman Empire."],"historical_context":["Janissaries","Devshirme system","Millets"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in historical or academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ottomanize' is a specialized term primarily used in historical contexts to describe the process of something coming under the influence or control of the Ottoman Empire. It implies a cultural, administrative, or political transformation towards Ottoman norms and practices. The word is relatively uncommon in everyday language and is more likely to be encountered in academic or historical discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The Balkans were significantly Ottomanized during the centuries of Ottoman rule.","translation":"バルカン半島はオスマン帝国の支配下にあった数世紀の間に大きくオスマン帝国化された。","type":"verb","meaning_category":"Bringing under Ottoman influence"},{"sentence":"The local legal system was Ottomanized to align with Islamic law.","translation":"地元の法制度はイスラム法に合わせるためにオスマン帝国化された。","type":"verb","meaning_category":"Making Ottoman in character"},{"sentence":"Over time, the region's identity Ottomanized, blending local traditions with Ottoman customs.","translation":"時が経つにつれて、その地域のアイデンティティはオスマン帝国化され、地元の伝統とオスマン帝国の習慣が混ざり合った。","type":"verb","meaning_category":"Becoming Ottoman in culture"}]}