{"word":"Hellandite","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A rare silicate mineral containing calcium, yttrium, boron, silicon, and oxygen.","english_definition":"A rare silicate mineral with the chemical formula (Ca,Y,[])6(Al,Fe3+)Al(B,Be)Si4O20(OH)4.","examples":[{"sentence":"The sample was identified as Hellandite through X-ray diffraction.","translation":"そのサンプルは、X線回折によってヘランダイトであると特定されました。"},{"sentence":"Hellandite is often found in granitic pegmatites.","translation":"ヘランダイトは、しばしば花崗岩質のペグマタイト中に見られます。"}],"collocations":["Hellandite crystal","Hellandite mineral","Rare Hellandite","Yttrium Hellandite"],"synonyms":["None (mineral name)"],"antonyms":["None (mineral name)"]}],"etymology":{"value":"Named after the Norwegian politician Amund Helland (1846-1918).","priority":"★★★"},"pronunciation":{"ipa":"ˈhɛlənˌdaɪt","syllables":"Hel-lan-dite"},"inflection":{"noun_plural":"Hellandites"},"usage_notes":{"explanation":"Hellandite is a relatively obscure mineral, primarily of interest to mineralogists and collectors. Its occurrence is rare, and it's not typically encountered outside of scientific or hobbyist contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I found a hellandite in my backyard.","correct":"✓ Finding Hellandite in a typical backyard is highly improbable.","note":"Hellandite is a rare mineral and not commonly found. It is more likely to be found in specific geological settings."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_minerals":["Gadolinite","Allanite","Thalenite"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare, specialized vocabulary)","frequency_google_ngram":"Very low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Hellandite is a very rare mineral name, primarily used in geology and mineralogy. Understanding its meaning requires a background in earth sciences. The term is not generally used in everyday conversation."},"example_sentences":[{"sentence":"The chemical composition of Hellandite varies slightly depending on the location of its formation.","translation":"ヘランダイトの化学組成は、その形成場所によってわずかに異なります。","type":"scientific","meaning_category":"chemical composition"},{"sentence":"Researchers analyzed the crystal structure of Hellandite to understand its properties.","translation":"研究者たちは、その特性を理解するためにヘランダイトの結晶構造を分析しました。","type":"scientific","meaning_category":"crystal structure"}]}