{"word":"prosophist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A sophist; one who makes a show of wisdom.","english_definition":"A person who makes a display of their supposed wisdom or knowledge; a sophist.","examples":[{"sentence":"The speaker was a prosophist, using complex language to obscure simple ideas.","translation":"その講演者はプロソフィストであり、単純な考えを曖昧にするために複雑な言葉を使用した。"},{"sentence":"Don't be fooled by his rhetoric; he's just a prosophist trying to impress you.","translation":"彼のレトリックに騙されないでください。彼はただあなたに感銘を与えようとしているプロソフィストです。"}],"collocations":["pseudo-intellectual","philosophaster","wordspinner"],"synonyms":["sophist","pseudo-intellectual","philosophaster"],"antonyms":["sage","wise person","philosopher"]}],"etymology":{"value":"Derived from 'proso-', a prefix meaning 'towards' or 'in front of', combined with 'sophist'. It suggests someone who presents themselves as a sophist or wise person.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈprɒsəfɪst/","syllables":"pros-o-phist"},"inflection":{"noun_plural":"prosophists"},"usage_notes":{"explanation":"The term 'prosophist' is somewhat rare and often carries a negative connotation, implying that the person is more concerned with appearing wise than with genuine wisdom or truth. It is similar to 'sophist' but can emphasize the performative aspect of displaying knowledge.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a true prosophist, seeking genuine wisdom.","correct":"He is a prosophist, seeking to appear wise rather than to be genuinely wise.","note":"'Prosophist' implies a focus on the appearance of wisdom, not genuine wisdom itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["prosophistic (adjective)","prosophistry (noun)"],"phrases":[]},"level_frequency":{"CEFR":"N/A (Rare word)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Prosophist' is a relatively rare and advanced word. It describes someone who pretends to be wise or knowledgeable, often using clever but ultimately empty arguments. Understanding this word requires a grasp of the history of philosophy and the distinction between genuine wisdom and mere rhetoric."},"example_sentences":[{"sentence":"The politician's speech was full of prosophist arguments, designed to confuse rather than enlighten.","translation":"その政治家の演説は、啓発するよりも混乱させるように設計された、プロソフィスト的な議論でいっぱいだった。","type":"noun","meaning_category":"sophist"},{"sentence":"He was accused of being a prosophist, more interested in winning debates than in finding the truth.","translation":"彼は真実を見つけることよりも議論に勝つことに関心があるプロソフィストであると非難された。","type":"noun","meaning_category":"sophist"}]}