{"word":"infrastructure-oriented","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"インフラ重視の、インフラ指向の","english_definition":"Focused on or prioritizing infrastructure development and investment.","examples":[{"sentence":"The government adopted an infrastructure-oriented approach to stimulate economic growth.","translation":"政府は経済成長を刺激するために、インフラ重視のアプローチを採用した。"},{"sentence":"The new policy is infrastructure-oriented, allocating significant funds to transportation and energy projects.","translation":"新しい政策はインフラ指向であり、輸送およびエネルギープロジェクトに多額の資金を割り当てている。"}],"collocations":["infrastructure-oriented policy (インフラ重視の政策)","infrastructure-oriented investment (インフラ重視の投資)","infrastructure-oriented development (インフラ重視の開発)"],"synonyms":["infrastructure-focused","infrastructure-driven"],"antonyms":["service-oriented","consumer-oriented"]}],"etymology":{"value":"Composed of 'infrastructure' (the basic physical and organizational structures needed for a society or enterprise to operate) and 'oriented' (directed or focused towards).","priority":"N/A"},"pronunciation":{"ipa":"/ˌɪnfrəˈstrʌktʃər ˈɔːrientɪd/","syllables":"in-fra-struc-ture-o-ri-ent-ed"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"'Infrastructure-oriented' describes a strategy, policy, or approach that places a high priority on developing and improving infrastructure. This often involves significant investment in areas such as transportation (roads, railways, airports), energy (power grids, pipelines), communication (telecommunications networks), and water management (dams, water treatment plants). The goal is typically to support economic growth, improve quality of life, and enhance competitiveness.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The city is oriented infrastructure.","correct":"✓ The city is infrastructure-oriented.","note":"The correct word order is 'infrastructure-oriented' as a compound adjective."}],"priority":"N/A"},"related_words":{"derivatives":["infrastructure (noun)","oriented (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1-C2","frequency_google_ngram":"Low frequency - specialized term.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Infrastructure-oriented' is a specialized term used in economics, politics, and urban planning to describe policies or strategies that prioritize investment in infrastructure. It implies a focus on long-term development and the creation of a foundation for economic activity. Understanding this term requires familiarity with the concept of infrastructure and the implications of prioritizing its development."},"example_sentences":[{"sentence":"The country's infrastructure-oriented development plan aims to modernize its transportation network.","translation":"その国のインフラ重視の開発計画は、輸送ネットワークの近代化を目指している。","type":"general","meaning_category":"general"},{"sentence":"An infrastructure-oriented approach can create jobs and stimulate economic activity in the short term.","translation":"インフラ重視のアプローチは、短期的に雇用を創出し、経済活動を刺激することができる。","type":"economic","meaning_category":"economic"}]}