{"word":"reservicing","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(金融) 住宅ローン債権の再サービス業務","english_definition":"The process of transferring the servicing rights of a mortgage loan from one servicer to another.","examples":[{"sentence":"The bank decided to sell the reservicing rights of its mortgage portfolio.","translation":"銀行は住宅ローンポートフォリオの再サービス業務権を売却することを決定した。"},{"sentence":"Reservicing can lead to changes in where borrowers send their payments.","translation":"再サービス業務によって、借り手が支払いを送る場所が変わることがある。"}],"collocations":["sell reservicing rights","transfer reservicing","mortgage reservicing"],"synonyms":["mortgage servicing transfer"],"antonyms":[]}],"etymology":{"value":"Derived from \"re-\" (again) + \"servicing\" (the act of providing service for a loan).","priority":"★★★"},"pronunciation":{"ipa":"/ˌriːˈsɜːrvɪsɪŋ/","syllables":"re-ser-vic-ing"},"inflection":{"noun_plural":"reservicings"},"usage_notes":{"explanation":"\"Reservicing\" is a term primarily used in the mortgage industry to describe the transfer of mortgage servicing rights. It's important to note that the underlying loan terms remain the same; only the entity responsible for collecting payments, managing escrow accounts, and handling customer service changes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The reservicing affected the loan terms.","correct":"✓ The reservicing affected where I send my payments.","note":"Reservicing only affects the servicing of the loan, not the loan terms themselves."}],"priority":"★★☆"},"related_words":{"derivatives":["servicer","mortgage servicing","subservicing"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Reservicing\" is a specialized term within the mortgage industry. It refers to the transfer of the responsibility for servicing a mortgage loan from one company to another. This typically involves tasks such as collecting payments, managing escrow accounts, and handling borrower inquiries. While the loan terms remain unchanged, borrowers may need to adjust to a new point of contact and payment procedures."},"example_sentences":[{"sentence":"The homeowner received a letter notifying them of the **reservicing** of their mortgage.","translation":"住宅所有者は、住宅ローンの再サービス業務に関する通知を受け取った。","type":"noun","meaning_category":"再サービス業務"},{"sentence":"Due to the **reservicing**, borrowers must now send their payments to a different address.","translation":"再サービス業務のため、借り手は支払いを別の住所に送る必要が生じた。","type":"noun","meaning_category":"再サービス業務"}]}