{"word":"Fertilisability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"受精能、受精可能性","english_definition":"The capacity to be fertilized; the ability of an egg or ovule to be successfully fertilized by sperm or pollen.","examples":[{"sentence":"The soil's increased fertilisability led to a higher crop yield.","translation":"土壌の受精能の向上は、より高い収穫量につながった。"},{"sentence":"Researchers are studying the fertilisability of different plant species.","translation":"研究者たちは、異なる植物種の受精能を研究している。"}],"collocations":["soil fertilisability","plant fertilisability","egg fertilisability","ovule fertilisability"],"synonyms":["fecundity","fertility","receptivity","conceptibility"],"antonyms":["infertility","sterility"]}],"etymology":{"value":"Derived from 'fertilizable' (capable of being fertilized) + '-ity' (suffix denoting a state or condition). 'Fertilizable' comes from 'fertilize' + '-able'. 'Fertilize' originates from Latin 'fertilis' (fruitful, fertile).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɜːrtɪlaɪzəˈbɪləti/","syllables":"fer-ti-li-sa-bi-li-ty"},"inflection":{"noun_plural":"Fertilisabilities"},"usage_notes":{"explanation":"'Fertilisability' refers specifically to the potential or capacity for fertilization to occur. It is often used in scientific or agricultural contexts to describe the characteristics of soil, plants, or reproductive cells that influence the likelihood of successful fertilization. It is less commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The fertilisability of the idea was low.","correct":"✓ The feasibility of the idea was low.","note":"'Fertilisability' is specifically related to biological fertilization. For abstract concepts, use 'feasibility' or 'viability' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["fertilizable","fertilize","fertilization","fertile","fertility"],"related_terms":["infertility","sterility","fecundity"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Fertilisability' is a technical term primarily used in biology, agriculture, and related fields. It refers to the capacity or potential for something to be fertilized, such as an egg, ovule, or soil. It is not a common word in everyday conversation and is more likely to be encountered in scientific literature or discussions. Understanding this word requires a grasp of the concept of fertilization and its related processes.","priority":"★★☆"},"example_sentences":[{"sentence":"The study examined the impact of different nutrient levels on the fertilisability of the soil.","translation":"その研究では、異なる栄養レベルが土壌の受精能に与える影響を調査した。","type":"scientific","meaning_category":"soil science"},{"sentence":"Improved techniques have enhanced the fertilisability of crops in arid regions.","translation":"改良された技術により、乾燥地域における作物の受精能が向上した。","type":"agricultural","meaning_category":"agriculture"},{"sentence":"Researchers are investigating factors affecting the fertilisability of human eggs.","translation":"研究者たちは、ヒトの卵子の受精能に影響を与える要因を調査している。","type":"biological","meaning_category":"biology"}]}