{"word":"investor-owned","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"投資家所有の、株主所有の","english_definition":"Owned by investors, typically shareholders, who have a financial stake in the company or organization.","examples":[{"sentence":"The hospital is investor-owned, so it needs to generate a profit.","translation":"その病院は投資家所有なので、利益を上げる必要があります。"},{"sentence":"Investor-owned utilities are often subject to different regulations than publicly owned ones.","translation":"投資家所有の公益事業は、公営のものとは異なる規制を受けることが多いです。"},{"sentence":"The company transitioned from a family-owned business to an investor-owned corporation.","translation":"その会社は家族経営から投資家所有の株式会社へと移行しました."}],"collocations":["investor-owned company","investor-owned utility","investor-owned hospital","privately held","shareholder-owned"],"synonyms":["privately held","shareholder-owned","for-profit","commercial"],"antonyms":["publicly owned","state-owned","government-owned","non-profit"]}],"etymology":{"value":"Combination of 'investor' (one who invests money) and 'owned' (past participle of 'own', to possess). The term describes an entity whose ownership is held by investors.","priority":"★★★"},"pronunciation":{"ipa":"/ɪnˈvɛstər oʊnd/","syllables":"in-ves-tor-owned"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"The term 'investor-owned' is used to describe a business or organization where the ownership is held by investors, typically through shares of stock. This is in contrast to publicly owned entities, which are owned by the government, or non-profit organizations, which are not owned by individuals seeking a financial return. Investor-owned entities are generally expected to generate a profit for their investors.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The city owned hospital was investor-owned.","correct":"✓ The city-owned hospital was not investor-owned.","note":"Investor-owned and publicly-owned are mutually exclusive. A hospital cannot be both owned by the city and by investors."},{"incorrect":"✗ The investor owned company was giving away all its profits.","correct":"✓ The investor-owned company was expected to generate profits.","note":"Investor-owned companies are generally expected to generate profits for their investors. Giving away all profits would be unusual."}],"priority":"★★☆"},"related_words":{"derivatives":["investor","investment","ownership","shareholder"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'investor-owned' describes a company or organization that is owned by investors. This means that individuals or groups have put money into the company with the expectation of receiving a return on their investment, usually through profits or increased value of their shares. This is different from companies owned by the government or non-profit organizations. The term is often used in business and finance contexts."},"example_sentences":[{"sentence":"The investor-owned power company announced record profits this quarter.","translation":"その投資家所有の電力会社は、今四半期に過去最高の利益を発表しました。","type":"adjective","meaning_category":"general"},{"sentence":"Many investor-owned healthcare providers are facing scrutiny over rising costs.","translation":"多くの投資家所有の医療機関は、コスト上昇に関して精査を受けています。","type":"adjective","meaning_category":"business"},{"sentence":"The debate continues over whether essential services should be investor-owned or publicly managed.","translation":"不可欠なサービスは投資家所有であるべきか、公的に管理されるべきかについての議論が続いています。","type":"adjective","meaning_category":"policy"}]}