{"word":"unblued","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Not blued; lacking a blue color or finish; not having undergone a bluing process.","english_definition":"Not having been subjected to a bluing process; lacking a blue color or finish.","examples":[{"sentence":"The unblued steel parts were more susceptible to rust.","translation":"青染めされていない鋼鉄部品は錆びやすかった。"},{"sentence":"He preferred the unblued look of the gun barrel.","translation":"彼は銃身の青染めされていない外観を好んだ。"}],"collocations":["unblued steel","unblued gun barrel","unblued finish"],"synonyms":["undyed","uncolored","unpainted"],"antonyms":["blued","colored","dyed"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to the word 'blued' (having been treated with a bluing process or having a blue color).","priority":"N/A"},"pronunciation":{"ipa":"/ʌnˈbluːd/","syllables":"un-blued"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns."},"usage_notes":{"explanation":"'Unblued' typically refers to metal objects, particularly firearms, that have not undergone a bluing process. Bluing is a chemical process that creates a protective coating on steel to prevent rust and corrosion, and it often imparts a blue-black color. 'Unblued' indicates the absence of this protective and aesthetic treatment.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The sky was unblued because of the pollution.","correct":"✓ The sky was not blue because of the pollution.","note":"'Unblued' is generally used to describe manufactured items that could have been blued, not naturally occurring phenomena like the sky."}],"priority":"N/A"},"related_words":{"derivatives":["blue","bluing"],"related_terms":["steel","metal","finish","coating","rust","corrosion"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The word 'unblued' is a technical term primarily used in the context of metalworking, particularly firearms. It describes a metal surface that has not been treated with a bluing process, which is a chemical treatment to protect against rust and give a blue-black finish. Understanding this term requires familiarity with metal finishing techniques."},"example_sentences":[{"sentence":"The antique rifle had an unblued receiver, indicating its age.","translation":"そのアンティークライフルは、レシーバーが青染めされておらず、その年代を示していた。","type":"adjective","meaning_category":"describing a metal object"},{"sentence":"He preferred the natural look of the unblued knife blade.","translation":"彼は青染めされていないナイフの刃の自然な外観を好んだ。","type":"adjective","meaning_category":"describing a metal object"}]}