{"word":"mola","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(クナ族の)モラ、アップリケ刺繍","english_definition":"a colorful textile art form made by the Kuna people of Panama and Colombia, typically involving reverse appliqué.","examples":[{"sentence":"The mola is a traditional art form of the Kuna people.","translation":"モラはクナ族の伝統的な芸術形式です。"},{"sentence":"She bought a beautiful mola as a souvenir.","translation":"彼女は美しいモラをお土産に買いました。"},{"sentence":"The intricate designs of the mola often depict animals, plants, and stories from Kuna culture.","translation":"モラの複雑なデザインは、動物、植物、クナ族の文化からの物語を描いていることが多いです。"}],"collocations":["Kuna mola","mola design","mola art","mola panel","mola blouse"],"synonyms":["appliqué","textile art","fabric art"],"antonyms":[]}],"etymology":{"value":"From the Kuna language word for 'shirt' or 'clothing'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmoʊlə/","syllables":"mo-la"},"inflection":{"noun_plural":"molas"},"usage_notes":{"explanation":"A mola is a hand-made textile art form created by the Kuna indigenous people of Panama and Colombia. Molas are typically made using a reverse appliqué technique, where multiple layers of fabric are sewn together, and then parts of each layer are cut away to reveal the colors and designs of the layers underneath. Molas often depict scenes from Kuna legends, animals, plants, and everyday life. They are used as clothing panels and also sold as art pieces.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a mola in Japan.","correct":"✓ I saw a mola in Panama. / ✓ I saw a mola-inspired design in Japan.","note":"Molas are traditionally made by the Kuna people in Panama and Colombia. Seeing a genuine mola outside of these regions is less common, so specifying a mola-inspired design or that it was seen in Panama would be more accurate."}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"(Not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'mola' refers to a specific type of textile art made by the Kuna people, an indigenous group from Panama and Colombia. It's not a common word in everyday English, so you're most likely to encounter it when reading about art, culture, or the indigenous peoples of Central America. Understanding the cultural context is important when using this word."},"example_sentences":[{"sentence":"The museum displayed a vibrant collection of **molas**.","translation":"博物館は鮮やかなモラのコレクションを展示しました。","type":"noun","meaning_category":"モラ (展示品)"},{"sentence":"She learned the art of making **molas** from her grandmother.","translation":"彼女は祖母からモラ作りの技術を学びました。","type":"noun","meaning_category":"モラ (制作)"},{"sentence":"The **mola** on her blouse was intricately designed.","translation":"彼女のブラウスのモラは精巧にデザインされていました。","type":"noun","meaning_category":"モラ (衣服)"}]}