{"word":"Solanales","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ナス目","english_definition":"An order of flowering plants, also known as the nightshades, including families such as Solanaceae (nightshade family), Convolvulaceae (morning glory family), and others.","examples":[{"sentence":"The Solanales order contains many economically important plants.","translation":"ナス目は経済的に重要な植物を多く含んでいます。"},{"sentence":"Tomatoes, potatoes, and eggplants belong to the Solanaceae family within the Solanales.","translation":"トマト、ジャガイモ、ナスはナス目に属するナス科の植物です。"}],"collocations":["belong to Solanales","Solanales family","Solanales species"],"synonyms":["nightshades"],"antonyms":[]}],"etymology":{"value":"Derived from Solanaceae, the name of the nightshade family, which is derived from Solanum, the genus of plants that includes the nightshades.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsoʊləˈneɪliːz/","syllables":"So-la-na-les"},"inflection":{"noun_plural":"Solanales"},"usage_notes":{"explanation":"'Solanales' refers to a taxonomic order in botany. It's primarily used in scientific or academic contexts when discussing plant classification and relationships. It's not a commonly used term in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Solanales are animals.","correct":"✓ The Solanales are plants.","note":"Solanales refers to a plant order, not animals."},{"incorrect":"✗ Solanales is a type of flower.","correct":"✓ Solanales is an order of flowering plants.","note":"Solanales is a broader classification than just a type of flower."}],"priority":"★★☆"},"related_words":{"derivatives":["Solanaceae (nightshade family)","Solanum (genus of nightshades)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Solanales' is a scientific term used in botany to classify a specific order of flowering plants. Understanding this term requires familiarity with biological classification systems. It's typically encountered in academic or scientific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"Many plants in the order Solanales are known for their medicinal properties.","translation":"ナス目に属する多くの植物は薬効があることで知られています。","type":"noun","meaning_category":"植物分類"},{"sentence":"The evolutionary relationships within the Solanales have been extensively studied using molecular data.","translation":"ナス目内の進化関係は、分子データを用いて広範囲に研究されてきました。","type":"noun","meaning_category":"植物分類"}]}