{"word":"Doenitz","priority":"☆☆☆","meanings":[{"part_of_speech":"proper noun","definition":"デーニッツ：ドイツの海軍元帥、第二次世界大戦中に潜水艦隊を指揮し、戦後短期間ドイツの指導者となった。","english_definition":"A German admiral who played a major role in the naval history of World War II. He was the commander of the U-boat fleet and briefly succeeded Adolf Hitler as the head of state of Germany.","examples":[{"sentence":"Karl Doenitz succeeded Hitler as President of Germany.","translation":"カール・デーニッツは、ヒトラーの後を継いでドイツの大統領となった。"},{"sentence":"Doenitz was convicted of war crimes at the Nuremberg trials.","translation":"デーニッツはニュルンベルク裁判で戦争犯罪の罪で有罪判決を受けた。"}],"collocations":["U-boat commander (潜水艦隊司令官)","Nuremberg trials (ニュルンベルク裁判)","German Navy (ドイツ海軍)","Head of State (国家元首)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Doenitz' is of German origin.","priority":"☆☆☆"},"pronunciation":{"ipa":"ˈdøːnɪts","syllables":"Doe-nitz"},"inflection":{},"usage_notes":{"explanation":"Doenitz is primarily known as a historical figure. When discussing World War II or naval history, the name may appear.","priority":"☆☆☆"},"common_mistakes":{},"related_words":{"derivatives":[],"related_figures":["Adolf Hitler","Erich Raeder"],"related_terms":["U-boat","World War II","Kriegsmarine"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The word 'Doenitz' is a proper noun referring to a specific historical figure. Understanding its significance requires knowledge of World War II history, particularly the role of the German Navy and submarine warfare. The name is more likely to appear in historical texts, documentaries, or academic discussions related to this period."},"example_sentences":[{"sentence":"Admiral Doenitz implemented the strategy of unrestricted submarine warfare.","translation":"デーニッツ提督は無制限潜水艦作戦の戦略を実行した。","type":"example","meaning_category":"historical context"},{"sentence":"Doenitz's leadership had a significant impact on the course of the naval war.","translation":"デーニッツの指導力は、海戦の経過に大きな影響を与えた。","type":"example","meaning_category":"historical context"}]}