{"word":"pasteurize","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"低温殺菌する","english_definition":"to heat food, especially liquids such as milk, to a specific temperature for a period of time in order to kill microorganisms that could cause disease or spoilage.","examples":[{"sentence":"Milk is pasteurized to kill harmful bacteria.","translation":"牛乳は有害なバクテリアを殺菌するために低温殺菌されます。"},{"sentence":"Pasteurized juice has a longer shelf life.","translation":"低温殺菌されたジュースは、より長い保存期間を持ちます。"},{"sentence":"The process of pasteurizing milk was developed by Louis Pasteur.","translation":"牛乳の低温殺菌のプロセスは、ルイ・パスツールによって開発されました。"}],"collocations":["pasteurize milk (牛乳を低温殺菌する)","pasteurize juice (ジュースを低温殺菌する)","pasteurize eggs (卵を低温殺菌する)"],"synonyms":["sterilize","heat-treat","sanitize"],"antonyms":["raw","unpasteurized"]}],"etymology":{"value":"Named after Louis Pasteur, the French scientist who developed the process. The suffix '-ize' indicates 'to subject to' or 'to treat with'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpæstʃəraɪz/","syllables":"pas-teur-ize"},"inflection":{"verb_forms":{"present_simple":["pasteurize","pasteurizes"],"past_simple":"pasteurized","past_participle":"pasteurized","present_participle":"pasteurizing"}},"usage_notes":{"explanation":"Pasteurization is a heat treatment process used to kill harmful microorganisms in food and beverages, extending their shelf life and making them safer for consumption. It does not sterilize the product completely, but reduces the number of viable pathogens to a level where they are unlikely to cause disease.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The milk was pasteurized for too long and it burned.","correct":"✓ The milk was heated for too long and it burned.","note":"Pasteurization involves heating to a specific temperature, but overdoing it can cause burning. Use 'heated' for general heating, 'pasteurized' specifically for the process. Also, burning is not a typical result of pasteurization, so consider the context."},{"incorrect":"✗ You can pasteurize water to make it safe.","correct":"✓ You can boil water to make it safe. / ✓ You can filter water to make it safe.","note":"Pasteurization is usually applied to milk, juice, and eggs. For water, boiling or filtering is more common to kill pathogens."}],"priority":"★★☆"},"related_words":{"derivatives":["pasteurization (noun: 低温殺菌)","pasteurizer (noun: 低温殺菌器)"],"phrasal_verbs":[],"related_terms":["sterilization","homogenization","ultra-pasteurization"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, technical term.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Pasteurize' means to heat food, especially liquids like milk, to a specific temperature for a certain time to kill harmful germs. This makes the food safer to eat and last longer. It's named after Louis Pasteur, who invented the process. You'll often see this word on food labels, especially for dairy products and juices. It's a more technical term, so you might not use it every day, but it's important to understand in the context of food safety."},"example_sentences":[{"sentence":"The dairy factory pasteurizes all of its milk before packaging.","translation":"その酪農工場は、包装する前にすべての牛乳を低温殺菌します。","type":"verb","meaning_category":"food processing"},{"sentence":"Pasteurized eggs are often used in recipes that don't involve cooking.","translation":"低温殺菌された卵は、加熱調理しないレシピでよく使用されます。","type":"adjective (as part of 'pasteurized eggs')","meaning_category":"food safety"},{"sentence":"The label indicates whether the juice has been pasteurized or not.","translation":"ラベルには、ジュースが低温殺菌されているかどうかが記載されています。","type":"verb","meaning_category":"food labeling"}]}