{"word":"radiobiology","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"放射線生物学","english_definition":"The branch of biology that studies the effects of ionizing radiation on living organisms.","examples":[{"sentence":"Radiobiology is crucial for understanding the risks and benefits of radiation therapy.","translation":"放射線生物学は、放射線療法の危険性と利点を理解するために重要です。"},{"sentence":"Research in radiobiology has led to improvements in cancer treatment.","translation":"放射線生物学の研究は、がん治療の改善につながっています。"}],"collocations":["radiation therapy","cancer treatment","ionizing radiation","cellular damage","DNA repair"],"synonyms":["radiation biology","radiation biophysics"],"antonyms":[]}],"etymology":{"value":"Derived from 'radio-' (referring to radiation), 'bio-' (referring to life or living organisms), and '-logy' (the study of).","priority":"★★☆"},"pronunciation":{"ipa":"ˌreɪdioʊbaɪˈɒlədʒi","syllables":"ra-di-o-bi-ol-o-gy"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Radiobiology is an interdisciplinary field that combines aspects of biology, physics, and medicine. It focuses on the mechanisms by which radiation affects cells, tissues, and organisms, and how these effects can be manipulated for therapeutic purposes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Radio biology is important for cancer treatment.","correct":"✓ Radiobiology is important for cancer treatment.","note":"The correct spelling is 'radiobiology,' not 'radio biology'."}],"priority":"★★☆"},"related_words":{"derivatives":["radiobiological (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Radiobiology is a specialized term used in scientific and medical contexts. It refers to the study of how radiation affects living things. Understanding this term requires familiarity with basic concepts in biology and physics. It is commonly used in discussions about cancer treatment, radiation safety, and the effects of nuclear events on the environment and human health."},"example_sentences":[{"sentence":"The principles of radiobiology guide the safe and effective use of radiation in medicine.","translation":"放射線生物学の原則は、医学における放射線の安全かつ効果的な使用を導きます。","type":"general","meaning_category":"general"},{"sentence":"Advances in radiobiology have led to more targeted and less toxic radiation therapies.","translation":"放射線生物学の進歩により、より標的を絞り、毒性の低い放射線療法が開発されました。","type":"research","meaning_category":"research"},{"sentence":"Radiobiology research explores the mechanisms of radiation-induced DNA damage and repair.","translation":"放射線生物学の研究では、放射線によって誘発されるDNA損傷と修復のメカニズムが探求されています。","type":"research","meaning_category":"research"}]}