{"word":"nacarine","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"真珠光沢のある、真珠のような","english_definition":"Having a pearly luster; resembling mother-of-pearl.","examples":[{"sentence":"The inside of the shell was nacarine and iridescent.","translation":"貝殻の内側は真珠光沢があり、虹色に輝いていた。"},{"sentence":"The nacarine finish gave the jewelry a delicate sheen.","translation":"真珠光沢の仕上げが、その宝石に繊細な光沢を与えた。"}],"collocations":["nacarine luster","nacarine sheen","nacarine surface"],"synonyms":["pearly","opalescent","iridescent","nacreous"],"antonyms":["dull","matte"]}],"etymology":{"value":"Derived from the French word 'nacre', meaning mother-of-pearl, which comes from the Arabic 'naqqarah' (نقارة), meaning 'shell'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnækəˌriːn/","syllables":"nac-a-rine"},"inflection":{"notes":"This word is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Nacarine' is used to describe something that has a shimmering, iridescent quality similar to that of mother-of-pearl. It is often used in descriptions of jewelry, shells, or other decorative items. The word evokes a sense of elegance and delicacy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The color was nacarine blue.","correct":"✓ The color was a nacarine blue.","note":"When using 'nacarine' to describe a color, it's better to use 'a nacarine blue' rather than directly modifying the color name."}],"priority":"★☆☆"},"related_words":{"derivatives":["nacre (noun: mother-of-pearl)","nacreous (adjective: relating to or resembling nacre)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Specialized or uncommon vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nacarine' is a relatively uncommon word used to describe a pearly or opalescent appearance, similar to mother-of-pearl. It is often found in descriptive writing about jewelry, shells, or other decorative objects where the author wants to convey a sense of shimmering beauty. Due to its specialized nature, it is more likely to be encountered in advanced texts or by those with a particular interest in decorative arts or natural history."},"example_sentences":[{"sentence":"The light reflected off the nacarine buttons of her blouse.","translation":"光が彼女のブラウスの真珠光沢のあるボタンに反射した。","type":"adjective","meaning_category":"真珠光沢のある"},{"sentence":"The artist used nacarine pigments to create a luminous effect in the painting.","translation":"その画家は、絵画に発光効果を生み出すために真珠光沢の顔料を使用した。","type":"adjective","meaning_category":"真珠のような"}]}