{"word":"sigillation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"封印術、シジル作成","english_definition":"The act, process, or art of creating and using sigils, which are symbolic representations of a desired outcome or intention. It is a technique used in various forms of magic and chaos magic.","examples":[{"sentence":"Sigillation involves condensing a desire into a symbolic form.","translation":"シジル作成は、願望を象徴的な形に凝縮することを含む。"},{"sentence":"He practiced sigillation to manifest his goals.","translation":"彼は目標を具現化するためにシジル作成を行った。"}],"collocations":["create a sigil","activate a sigil","chaos magic sigillation"],"synonyms":["symbolic magic","chaos magic","glyph magic"],"antonyms":[]}],"etymology":{"value":"Derived from 'sigil,' which comes from the Latin 'sigillum,' meaning 'seal' or 'signature.' The suffix '-ation' denotes a process or action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɪdʒɪˈleɪʃən/","syllables":"si-gil-la-tion"},"inflection":{"noun_plural":"sigillations"},"usage_notes":{"explanation":"Sigillation is a technique primarily associated with chaos magic, but it can be found in other magical systems as well. It involves formulating a desire, creating a visual symbol (the sigil) to represent that desire, and then charging the sigil with energy, often through altered states of consciousness. The goal is to bypass the conscious mind and plant the intention directly into the subconscious.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used sigillation to seal the letter.","correct":"✓ He used a seal to seal the letter. / ✓ He practiced sigillation magic.","note":"Sigillation refers to the magical practice of creating sigils, not the act of physically sealing something. Use 'seal' for physical sealing."},{"incorrect":"✗ Sigillation is a type of religion.","correct":"✓ Sigillation is a technique used in magic.","note":"Sigillation is a magical technique, not a religion in itself."}],"priority":"★★☆"},"related_words":{"derivatives":["sigil (noun: a symbol created for a specific magical purpose)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Sigillation' is a specialized term primarily used in the context of magic, particularly chaos magic. It refers to the process of creating and using sigils, which are symbolic representations of a desired outcome. Understanding this term requires familiarity with magical practices and symbolism. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The magician explained the process of **sigillation** to his apprentices.","translation":"魔術師は弟子たちにシジル作成の過程を説明した。","type":"noun","meaning_category":"封印術、シジル作成"},{"sentence":"Through **sigillation**, she hoped to influence events in her life.","translation":"シジル作成を通して、彼女は自分の人生における出来事に影響を与えたいと願った。","type":"noun","meaning_category":"封印術、シジル作成"}]}