{"word":"detrainment","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(鉄道)列車からの乗客の降車、特に緊急時や計画外の降車","english_definition":"The act of passengers disembarking from a train, especially in an emergency or unscheduled situation.","examples":[{"sentence":"Following the derailment, the detrainment of passengers was carried out in an orderly fashion.","translation":"脱線事故後、乗客の降車は整然と行われた。"},{"sentence":"The detrainment process was slow due to the steep embankment.","translation":"急な土手のため、降車プロセスは遅かった。"},{"sentence":"Emergency detrainment procedures were activated after the fire was detected.","translation":"火災が検知された後、緊急降車手順が作動した。"}],"collocations":["emergency detrainment","detrainment procedure","detrainment plan","safe detrainment"],"synonyms":["disembarkation","alighting","debarkation"],"antonyms":["embarkation","entrainment"],"related_words":["train","passenger","disembark","emergency","railroad","derailment"]}],"etymology":{"value":"Derived from \"de-\" (meaning \"from\" or \"away\") and \"entrainment\" (the act of boarding a train).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdiːtreɪnˈmɛnt/","syllables":"de-train-ment"},"inflection":{"noun_plural":"detrainments"},"usage_notes":{"explanation":"The term \"detrainment\" is often used in the context of railway safety and emergency planning. It refers specifically to the process of passengers exiting a train, particularly when it is not at a designated station or platform. This can occur due to accidents, mechanical failures, or other unforeseen circumstances. The focus is usually on ensuring the safe and efficient removal of passengers from the train.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The detrainment of the airplane passengers was difficult.","correct":"The disembarkation of the airplane passengers was difficult.","note":"\"Detrainment\" is specifically used for trains, not airplanes."}],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - technical term related to railways.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Detrainment' refers to the process of passengers getting off a train, especially when it's not at a regular station stop. This term is often used in discussions about railway safety and emergency procedures. It's not a common word in everyday conversation, but you might encounter it in news reports or technical documents related to trains."},"example_sentences":[{"sentence":"The railway company conducted a drill to improve the efficiency of emergency detrainment.","translation":"鉄道会社は緊急降車の効率を改善するための訓練を実施した。","type":"noun","meaning_category":"降車"},{"sentence":"Clear instructions are essential for safe detrainment in the event of an accident.","translation":"事故発生時の安全な降車には、明確な指示が不可欠である。","type":"noun","meaning_category":"降車"},{"sentence":"The detrainment area was secured by first responders.","translation":"降車エリアは、初期対応者によって確保された。","type":"noun","meaning_category":"降車"}]}