{"word":"criminating","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"罪を負わせる、有罪にする、告発する","english_definition":"Serving to incriminate; tending to show guilt.","examples":[{"sentence":"The evidence was criminating and led to his arrest.","translation":"その証拠は有罪を示すもので、彼の逮捕につながった。"},{"sentence":"The document contained criminating information.","translation":"その文書には罪を負わせる情報が含まれていた。"}],"collocations":["criminating evidence","criminating information","criminating testimony"],"synonyms":["incriminating","accusatory","damning","implicating"],"antonyms":["exculpatory","vindicating","absolving"]},{"part_of_speech":"verb","definition":"罪を負わせる、有罪にする、告発する (criminateの現在分詞)","english_definition":"Present participle of criminate: to accuse of or involve in a crime or wrongful act.","examples":[{"sentence":"He was criminating himself with his own words.","translation":"彼は自分の言葉で自分自身を告発していた。"}],"collocations":["criminating oneself"],"synonyms":["implicating","accusing","inculpating"],"antonyms":["exonerating","absolving","vindicating"]}],"etymology":{"value":"From the verb 'criminate', which comes from Latin 'crimen' (charge, accusation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkrɪmɪneɪtɪŋ/","syllables":"crim-i-nat-ing"},"inflection":{"verb_forms":{"present_participle":"criminating"}},"usage_notes":{"explanation":"'Criminating' is primarily used as an adjective to describe evidence, information, or testimony that tends to show someone's involvement in a crime or wrongdoing. It can also be used as the present participle of the verb 'criminate,' indicating the act of accusing or implicating someone. The word carries a strong negative connotation, suggesting guilt or culpability.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The criminating person was arrested.","correct":"✓ The accused person was arrested.","note":"'Criminating' describes the evidence or information, not the person. Use 'accused' or 'suspect' to describe the person. "},{"incorrect":"✗ The evidence was criminated.","correct":"✓ The evidence was criminating.","note":"'Criminating' is the adjective form to describe the evidence. 'Criminated' would be the past participle of the verb, which is less common in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["criminate (verb): to accuse of or involve in a crime.","incriminate (verb): to accuse of or present proof of a crime.","incrimination (noun): the act of incriminating or the state of being incriminated.","criminal (noun/adjective): a person who has committed a crime; relating to crime."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Criminating' is a formal and relatively uncommon word, primarily used in legal or investigative contexts. It describes evidence or information that suggests someone is guilty of a crime or wrongdoing. Because of its specific and technical usage, it is more likely to be encountered in advanced texts or professional settings. It's important to distinguish it from the more common word 'criminal,' which refers to a person who has committed a crime."},"example_sentences":[{"sentence":"The detective presented the criminating documents to the court.","translation":"刑事は有罪を示す書類を裁判所に提出した。","type":"adjective","meaning_category":"罪を負わせる"},{"sentence":"His own testimony was criminating, as it revealed his involvement in the conspiracy.","translation":"彼の証言は、陰謀への関与を明らかにしたため、有罪を示すものだった。","type":"adjective","meaning_category":"罪を負わせる"},{"sentence":"The lawyer argued that the evidence was not sufficiently criminating to warrant a conviction.","translation":"弁護士は、その証拠は有罪判決を正当化するほど十分に有罪を示すものではないと主張した。","type":"adjective","meaning_category":"罪を負わせる"}]}