{"word":"Ronsardian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ロンサール（Pierre de Ronsard）の、または、ロンサールのスタイルに似た","english_definition":"Of or pertaining to Pierre de Ronsard or his style of poetry.","examples":[{"sentence":"The poem has a Ronsardian quality in its focus on beauty and the fleeting nature of time.","translation":"その詩は、美と時の儚さに焦点を当てている点で、ロンサール風の趣がある。"}],"collocations":["Ronsardian sonnet","Ronsardian style","Ronsardian themes"],"synonyms":["Petrarchan","lyrical","elegiac"],"antonyms":[]}],"etymology":{"value":"Pierre de Ronsard (1524-1585), a French poet, and the suffix \"-ian\".","priority":"★★★"},"pronunciation":{"ipa":"/rɒnˈsɑːrdiən/","syllables":"Ron-sar-di-an"},"inflection":{"notes":"This word does not have different inflections."},"usage_notes":{"explanation":"The term \"Ronsardian\" is used to describe something related to Pierre de Ronsard, a prominent French poet of the 16th century. It often refers to his style of poetry, which is characterized by its focus on themes of love, beauty, the passage of time, and the carpe diem (seize the day) motif. It can also be used more broadly to describe works that share similar thematic or stylistic elements.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The painting had a Ronsardian feel to it, even though it was painted by an Italian artist.","correct":"✓ The painting had a Ronsardian feel to it, even though Ronsard was a poet.","note":"Ronsard was a poet, not a painter. The term refers to his poetic style, not visual arts."}],"priority":"★★☆"},"related_words":{"derivatives":["Ronsard (noun: Pierre de Ronsard himself)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Very low frequency - specialized literary term.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word \"Ronsardian\" is a highly specialized term used in literary criticism and history. It requires familiarity with the works and style of Pierre de Ronsard, a 16th-century French poet. Understanding this word implies a sophisticated knowledge of literary history and terminology. It is not commonly used outside of academic or specialized literary contexts."},"example_sentences":[{"sentence":"The poet adopted a Ronsardian approach, emphasizing the ephemeral nature of beauty.","translation":"その詩人はロンサール風のアプローチを採用し、美の儚さを強調した。","type":"adjective","meaning_category":"style of poetry"},{"sentence":"Her sonnets are reminiscent of the Ronsardian tradition, celebrating love and nature.","translation":"彼女のソネットは、愛と自然を称賛するロンサールの伝統を彷彿とさせる。","type":"adjective","meaning_category":"style of poetry"}]}