{"word":"urethrorrhagia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"尿道出血","english_definition":"Bleeding from the urethra.","examples":[{"sentence":"The patient presented with urethrorrhagia after the catheter insertion.","translation":"患者はカテーテル挿入後、尿道出血を呈した。"},{"sentence":"Urethrorrhagia can be a symptom of various underlying conditions.","translation":"尿道出血は、さまざまな基礎疾患の症状である可能性がある。"}],"collocations":["cause of urethrorrhagia (尿道出血の原因)","treatment for urethrorrhagia (尿道出血の治療)","persistent urethrorrhagia (持続的な尿道出血)"],"synonyms":["urethral bleeding"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'urethra' (οὐρήθρα) meaning urethra, 'rho' (ῥόος) meaning flow or discharge, and 'rhagia' (ῥαγία) meaning bursting forth or hemorrhage.","priority":"★★☆"},"pronunciation":{"ipa":"/juˌriːθrəˈreɪdʒ(i)ə/","syllables":"u-re-thr(o)-rrh(a)-gia"},"inflection":{"noun_plural":"urethrorrhagias"},"usage_notes":{"explanation":"Urethrorrhagia refers specifically to bleeding originating from the urethra, the tube that carries urine from the bladder to outside the body. It is important to differentiate this from hematuria (blood in the urine), which may originate from the kidneys, ureters, bladder, or urethra.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient had urethrorrhagia and hematuria, which are the same thing.","correct":"✓ The patient had urethrorrhagia and hematuria, indicating bleeding from the urethra and potentially other parts of the urinary tract, respectively.","note":"Urethrorrhagia is bleeding specifically from the urethra, while hematuria is blood in the urine, which can come from various parts of the urinary tract."}],"priority":"★★☆"},"related_words":{"derivatives":["urethra","rrhagia","hematuria"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Urethrorrhagia' is a medical term referring to bleeding from the urethra. It is not a commonly used word outside of medical contexts. Understanding this term requires knowledge of medical terminology and anatomy."},"example_sentences":[{"sentence":"The doctor examined the patient to determine the cause of the urethrorrhagia.","translation":"医師は尿道出血の原因を特定するために患者を診察した。","type":"general","meaning_category":"General Use"},{"sentence":"Urethrorrhagia can be a sign of urethral trauma or infection.","translation":"尿道出血は、尿道外傷または感染症の兆候である可能性がある。","type":"medical","meaning_category":"Medical Context"}]}