{"word":"legislatorially","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"立法的に、法律によって、法律の面から","english_definition":"In a legislative manner; by means of legislation; from a legislative perspective.","examples":[{"sentence":"The issue was addressed legislatorially through the passage of a new bill.","translation":"その問題は、新しい法案の可決を通じて立法的に対処された。"},{"sentence":"Legislatorially speaking, the proposed changes would require significant amendments to existing laws.","translation":"法律的に言えば、提案された変更は既存の法律に対する大幅な修正を必要とするだろう。"}],"collocations":["address something legislatorially","deal with something legislatorially","approach something legislatorially","view something legislatorially"],"synonyms":["legally","statutorily","judicially","constitutionally"],"antonyms":["extra-legally","unconstitutionally"]}],"etymology":{"value":"Formed from 'legislatorial' (relating to a legislature or legislation) + '-ly' (adverbial suffix). 'Legislatorial' is derived from 'legislator' (a person who makes laws) + '-ial' (adjectival suffix). 'Legislator' comes from Latin 'lex' (law) + 'lator' (proposer, mover).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌlɛdʒɪsləˈtɔːriəli/","syllables":"le-gis-la-to-ri-al-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Legislatorially' is a formal adverb used to describe actions or viewpoints related to the process of making laws or the perspective of a legislature. It is most commonly found in legal, political, and academic contexts. It emphasizes that something is being considered or done from the standpoint of lawmaking.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The problem was solved legislatorially by the community.","correct":"✓ The problem was solved legally by the community.","note":"'Legislatorially' refers specifically to actions taken through legislation. If the community solved the problem through other means, 'legally' or 'officially' might be more appropriate."},{"incorrect":"✗ He acted legislatorially without any legal basis.","correct":"✓ He acted illegally without any legal basis.","note":"'Legislatorially' implies a basis in lawmaking. Acting without a legal basis would be 'illegally' or 'unlawfully'."}],"priority":"★☆☆"},"related_words":{"derivatives":["legislative (adjective)","legislator (noun)","legislation (noun)","legislate (verb)"],"related_terms":["legal","statutory","judicial","constitutional"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Legislatorially' is a highly specialized term primarily used in legal and political contexts. It describes actions or considerations that are specifically related to the process of making laws. Due to its infrequent use and specialized meaning, it is considered a C2 level word. Understanding requires familiarity with legal and political terminology."},"example_sentences":[{"sentence":"The environmental policy was debated legislatorially for several months before a consensus was reached.","translation":"環境政策は、合意に達するまで数ヶ月間、立法的に議論された。","type":"adverb","meaning_category":"法律によって"},{"sentence":"The issue of healthcare reform must be addressed legislatorially to ensure comprehensive coverage.","translation":"医療改革の問題は、包括的な保障を確実にするために、立法的に対処されなければならない。","type":"adverb","meaning_category":"法律の面から"}]}