{"word":"L-lysine","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"L-リジン (必須アミノ酸の一種)","english_definition":"An essential amino acid that is a building block for protein in the body. It is important for growth, tissue repair, and immune function.","examples":[{"sentence":"L-lysine is an essential amino acid that the body cannot produce on its own.","translation":"L-リジンは、体が自力で生成できない必須アミノ酸です。"},{"sentence":"Some people take L-lysine supplements to prevent or treat herpes simplex infections.","translation":"単純ヘルペス感染症の予防や治療のために、L-リジンのサプリメントを摂取する人もいます。"}],"collocations":["L-lysine supplement","L-lysine deficiency","L-lysine benefits","L-lysine dosage"],"synonyms":["lysine"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'lysis', meaning 'loosening' or 'decomposition', referring to its role in breaking down proteins. The 'L-' prefix indicates the specific stereoisomer of lysine.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌɛlˈlaɪsiːn/","syllables":"el-ly-seen"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"L-lysine is an essential amino acid, meaning that it cannot be synthesized by the human body and must be obtained through diet or supplementation. It plays a crucial role in various bodily functions, including protein synthesis, calcium absorption, and immune system support. It is often used to prevent or treat herpes simplex infections (cold sores).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I take lysine for vitamin C.","correct":"✓ I take L-lysine for herpes.","note":"L-lysine is not a substitute for vitamin C. It is often used for herpes prevention or treatment."}],"priority":"★☆☆"},"related_words":{"derivatives":["lysine (general term for the amino acid)","amino acid","essential amino acid"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"L-lysine is a technical term referring to an essential amino acid. It's primarily encountered in discussions related to nutrition, health, and biochemistry. Understanding its role requires some background knowledge in these fields.","priority":"★☆☆"},"example_sentences":[{"sentence":"Foods rich in protein, such as meat and beans, are good sources of L-lysine.","translation":"肉や豆などのタンパク質が豊富な食品は、L-リジンの良い供給源です。","type":"noun","meaning_category":"essential amino acid"},{"sentence":"The doctor recommended an L-lysine supplement to help with my cold sores.","translation":"医師は私の口唇ヘルペスを治療するためにL-リジンサプリメントを勧めました。","type":"noun","meaning_category":"essential amino acid"}]}