{"word":"envenomation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"毒注入、毒作用、毒化","english_definition":"The process by which venom is injected by a venomous animal; the state of being poisoned by venom.","examples":[{"sentence":"Envenomation by snakes can cause severe tissue damage.","translation":"ヘビによる毒注入は、重度の組織損傷を引き起こす可能性があります。"},{"sentence":"Prompt medical attention is crucial in cases of envenomation.","translation":"毒作用の事例では、迅速な医療措置が重要です。"},{"sentence":"The severity of envenomation depends on the species and amount of venom injected.","translation":"毒作用の重症度は、種と注入された毒の量によって異なります."}],"collocations":["snake envenomation (ヘビ毒注入)","spider envenomation (クモ毒注入)","scorpion envenomation (サソリ毒注入)","treat envenomation (毒作用を治療する)","prevent envenomation (毒作用を予防する)"],"synonyms":["poisoning","intoxication","toxication"],"antonyms":["detoxification"]}],"etymology":{"value":"From 'envenom' (to poison) + '-ation' (a suffix denoting an action or process). 'Envenom' comes from Old French 'envenimer', meaning 'to poison', derived from 'venim' (venom).","priority":"★★☆"},"pronunciation":{"ipa":"/ɛnˌvɛnəˈmeɪʃən/","syllables":"en-ven-o-ma-tion"},"inflection":{"noun_plural":"envenomations"},"usage_notes":{"explanation":"'Envenomation' specifically refers to the injection of venom, typically by animals like snakes, spiders, or scorpions. It is distinct from general poisoning, which can occur through ingestion, inhalation, or absorption. The term is commonly used in medical and scientific contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The envenomation was caused by a toxic substance.","correct":"✓ The envenomation was caused by snake venom.","note":"'Envenomation' specifically refers to venom injected by animals, not general toxic substances."},{"incorrect":"✗ He suffered from poisoning after the envenomation.","correct":"✓ He suffered from poisoning after the snake envenomation.","note":"While envenomation leads to poisoning, 'envenomation' highlights the injection mechanism."}],"priority":"★★☆"},"related_words":{"derivatives":["envenom (verb: to poison with venom)","venom (noun: poisonous substance secreted by animals)","venomous (adjective: capable of injecting venom)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Envenomation' is a technical term referring to the process of venom being injected, usually by an animal. It is most often used in medical or scientific contexts to describe the effects of venom and the treatment required. Because it's a specific and less common term, it's typically encountered in advanced texts or discussions related to toxicology or zoology."},"example_sentences":[{"sentence":"The child experienced severe envenomation after being bitten by a rattlesnake.","translation":"その子供はガラガラヘビに噛まれた後、重度の毒作用を経験しました。","type":"noun","meaning_category":"毒注入"},{"sentence":"Antivenom is the primary treatment for envenomation from venomous snakes.","translation":"抗毒素は、有毒なヘビからの毒作用に対する主要な治療法です。","type":"noun","meaning_category":"毒作用"},{"sentence":"Researchers are studying the effects of envenomation on the nervous system.","translation":"研究者たちは、神経系に対する毒作用の影響を研究しています。","type":"noun","meaning_category":"毒作用"}]}