{"word":"accordantly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"調和して、一致して、したがって、それに応じて","english_definition":"in a manner that is in agreement or harmony; correspondingly.","examples":[{"sentence":"The plan was implemented accordantly with the committee's recommendations.","translation":"その計画は委員会の勧告と一致して実施された。"},{"sentence":"We acted accordantly to the rules and regulations.","translation":"私たちは規則と規制に従って行動した。"},{"sentence":"The music and dance moved accordantly, creating a beautiful performance.","translation":"音楽とダンスは調和して動き、美しいパフォーマンスを生み出した。"},{"sentence":"He adjusted his schedule accordantly to accommodate the new project.","translation":"彼は新しいプロジェクトに対応するために、それに応じてスケジュールを調整した。"}],"collocations":["act accordantly","implement accordantly","move accordantly","adjust accordantly"],"synonyms":["harmoniously","consonantly","agreeably","correspondingly","accordingly","consequently"],"antonyms":["discordantly","inconsistently","disagreeably"]}],"etymology":{"value":"The word 'accordantly' is derived from 'accordant', which comes from the Middle English 'accordant', from Old French 'acordant', present participle of 'acorder' meaning 'to reconcile, agree', from Latin 'accordare' meaning 'to bring into accord'. The suffix '-ly' turns it into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈkɔːrdəntli/","syllables":"ac-cord-ant-ly"},"inflection":{"notes":"As an adverb, 'accordantly' does not have different forms."},"usage_notes":{"explanation":"'Accordantly' is an adverb that describes actions or situations that are in agreement or harmony with something else. It's often used in formal or technical contexts to indicate that something is done in accordance with a specific rule, plan, or recommendation. It can also mean 'therefore' or 'consequently', indicating that something happens as a result of a previous action or decision. It is less commonly used than its synonym 'accordingly'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The team worked accordantly, they achieved their goals.","correct":"✓ The team worked accordantly; therefore, they achieved their goals. / ✓ The team worked accordantly, and as a result, they achieved their goals.","note":"When using 'accordantly' to mean 'therefore' or 'consequently', it's important to connect the clauses correctly. A semicolon or a phrase like 'as a result' can help to make the connection clearer."},{"incorrect":"✗ The colors were not accordantly.","correct":"✓ The colors were not accordant.","note":"'Accordantly' is an adverb and should be used to modify verbs, adjectives, or other adverbs. 'Accordant' is the adjective form and should be used to describe nouns."}],"priority":"★★☆"},"related_words":{"derivatives":["accordant (adjective)","accord (noun, verb)","according (adjective)","accordingly (adverb)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Accordantly' is a formal adverb that means 'in agreement or harmony with' or 'consequently'. It is not a commonly used word and is more likely to be found in formal writing or technical contexts. It indicates that something is done in accordance with a specific rule, plan, or recommendation. It can also mean 'therefore' or 'as a result'. Because of its formality and less frequent use, it is considered a C1 level word.","example_sentences":[]},"example_sentences":[{"sentence":"The project was designed accordantly with the client's specifications.","translation":"そのプロジェクトはクライアントの仕様と一致して設計された。","type":"adverb","meaning_category":"調和して、一致して"},{"sentence":"The data was analyzed, and the report was written accordantly.","translation":"データが分析され、それに応じてレポートが作成された。","type":"adverb","meaning_category":"したがって、それに応じて"}]}