{"word":"healthy-boned","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Having healthy bones; possessing strong and well-developed bones.","english_definition":"Having bones that are strong, dense, and free from disease or weakness.","examples":[{"sentence":"The doctor said the child was healthy-boned and had a good chance of avoiding osteoporosis later in life.","translation":"医師は、その子供は骨が健康で、将来骨粗鬆症になる可能性は低いと言った。"},{"sentence":"A diet rich in calcium and vitamin D is essential for staying healthy-boned.","translation":"カルシウムとビタミンDが豊富な食事は、健康な骨を維持するために不可欠です。"},{"sentence":"Regular exercise contributes to a healthy-boned physique.","translation":"定期的な運動は、健康な骨格の体格に貢献します。"}],"collocations":["healthy-boned child","healthy-boned adult","healthy-boned physique","stay healthy-boned","remain healthy-boned"],"synonyms":["strong-boned","robust-boned","sound-boned","dense-boned"],"antonyms":["weak-boned","fragile-boned","osteoporotic"],"notes":["This term is often used in the context of nutrition, exercise, and overall health. It emphasizes the importance of maintaining bone health throughout life."]}],"etymology":{"value":"A compound adjective formed by combining 'healthy' and 'boned'. 'Healthy' refers to good health, and 'boned' refers to having bones.","priority":"N/A"},"pronunciation":{"ipa":"/ˈhɛlθi boʊnd/","syllables":"hel-thy-boned"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have different forms for gender or number."},"usage_notes":{"explanation":"'Healthy-boned' is a descriptive adjective used to indicate that someone has strong and healthy bones. It's often used in discussions about nutrition, exercise, and bone health, particularly in relation to preventing conditions like osteoporosis.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a healthy boned person.","correct":"✓ He is a healthy-boned person.","note":"The hyphen is important to connect the two words and create a compound adjective."},{"incorrect":"✗ The healthy boned are important.","correct":"✓ Healthy bones are important.","note":"When referring to the general concept of healthy bones, it's better to use the plural noun 'bones' rather than the adjective 'healthy-boned' as a noun."}],"priority":"N/A"},"related_words":{"derivatives":["health (noun)","bone (noun)","boned (adjective)"],"related_terms":["bone health","bone density","osteoporosis","calcium","vitamin D","bone strength"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency; not a commonly used term.","priority":"N/A"},"readability_explanation":{"level":"B2","text":"'Healthy-boned' is a compound adjective meaning 'having healthy bones'. It is used to describe someone whose bones are strong and not prone to fractures or diseases like osteoporosis. This term is often found in health-related contexts, such as articles about nutrition and exercise for bone health. While not a very common term, its meaning is relatively straightforward to understand."},"example_sentences":[{"sentence":"Milk and yogurt are good sources of calcium, which helps to keep you healthy-boned.","translation":"牛乳とヨーグルトはカルシウムの良い供給源であり、健康な骨を維持するのに役立ちます。","type":"adjective","meaning_category":"Having healthy bones"},{"sentence":"She followed a diet rich in vitamin D to ensure she remained healthy-boned throughout her pregnancy.","translation":"彼女は妊娠中ずっと健康な骨を維持するために、ビタミンDが豊富な食事を摂った。","type":"adjective","meaning_category":"Having healthy bones"},{"sentence":"Weight-bearing exercises, like walking and running, are great for building a healthy-boned body.","translation":"ウォーキングやランニングのような体重をかける運動は、健康な骨格を作るのに最適です。","type":"adjective","meaning_category":"Having healthy bones"}]}