{"word":"uncomforted","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"慰められていない、慰められていない状態の、心が満たされない","english_definition":"not having received comfort or consolation; feeling distressed and without solace.","examples":[{"sentence":"She sat alone, uncomforted by the kind words of her friends.","translation":"彼女は一人で座り、友人たちの優しい言葉にも慰められなかった。"},{"sentence":"The child remained uncomforted despite his mother's attempts to soothe him.","translation":"母親がなだめようとしても、子供は慰められないままだった。"},{"sentence":"He felt uncomforted by the empty promises of politicians.","translation":"彼は政治家たちの空虚な約束に慰められない気持ちだった。"}],"collocations":["feel uncomforted","remain uncomforted","leave someone uncomforted"],"synonyms":["disconsolate","inconsolable","distressed","unhappy","sad","forlorn","desolate","wretched","miserable"],"antonyms":["comforted","solaced","consoled","happy","content","at ease"]},{"part_of_speech":"adjective","definition":"（場所などが）快適でない、居心地の悪い","english_definition":"(of a place or situation) not providing comfort or ease; uncomfortable.","examples":[{"sentence":"The room was cold and uncomforted, offering no respite from the storm outside.","translation":"部屋は寒くて快適ではなく、外の嵐からの休息を与えてくれなかった。"},{"sentence":"They sat in the uncomforted waiting room, anxiously awaiting news.","translation":"彼らは快適とは言えない待合室に座り、不安そうにニュースを待っていた。"}],"collocations":["an uncomforted room","an uncomforted space"],"synonyms":["uncomfortable","inhospitable","bleak","dreary","cheerless","uninviting"],"antonyms":["comfortable","cozy","inviting","pleasant"]}],"etymology":{"value":"\"Un-\" (not) + \"comforted\" (past participle of \"comfort\"). \"Comfort\" comes from Old French \"confort,\" meaning \"strength, help, encouragement,\" ultimately from Latin \"confortare,\" meaning \"to strengthen greatly.\"","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈkʌmfərtɪd/","syllables":"un-com-fort-ed"},"inflection":{"notes":"Adjective; comparative and superlative forms are typically \"more uncomforted\" and \"most uncomforted,\" respectively, though these are rarely used."},"usage_notes":{"explanation":"\"Uncomforted\" describes a state of lacking comfort or consolation. It emphasizes the absence of relief from distress, sadness, or unease. It can refer to a person's emotional state or the characteristics of a place that fails to provide comfort. The word often carries a sense of vulnerability and a need for solace.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"She was uncomforted to hear the news.","correct":"She was uncomforted by the news.","note":"The correct preposition to use with \"uncomforted\" is typically \"by.\""},{"incorrect":"The uncomforted child was crying.","correct":"The uncomforted child was crying, or The child was uncomforted.","note":"While grammatically correct, the phrasing \"The uncomforted child\" can sound awkward. It's often better to use \"The child was uncomforted\" or rephrase to something like \"The distressed child was crying.\""}],"priority":"★★☆"},"related_words":{"derivatives":["uncomforting (adjective: not providing comfort)","comfort (noun: a state of physical ease and freedom from pain or constraint; solace or consolation)","comfort (verb: ease the grief or distress of)","comfortable (adjective: (of a person) physically relaxed and free from constraint; providing physical ease and relaxation)"],"idioms_phrases":["There are no common idioms or phrases that directly include the word \"uncomforted.\" However, related idioms about comfort and consolation can provide context."],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"uncomforted\" is relatively uncommon and implies a state of lacking solace or consolation. It is more literary and nuanced than simply saying someone is \"sad\" or \"unhappy.\" Understanding its meaning requires a good grasp of vocabulary related to emotions and states of being. It is more likely to be encountered in literature or formal writing.","priority":"★★☆"},"example_sentences":[{"sentence":"The refugees arrived at the camp, cold, hungry, and uncomforted.","translation":"難民たちは寒く、空腹で、慰められない状態でキャンプに到着した。","type":"adjective","meaning_category":"Not having received comfort"},{"sentence":"He died uncomforted, regretting the choices he had made in life.","translation":"彼は慰められることなく、人生で犯した選択を後悔しながら死んだ。","type":"adjective","meaning_category":"Not having received comfort"},{"sentence":"The stark, uncomforted room offered little solace to the grieving family.","translation":"殺風景で快適とは言えない部屋は、悲しむ家族にほとんど慰めを与えなかった。","type":"adjective","meaning_category":"Not providing comfort or ease"}]}