{"word":"Eudendrium","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"a genus of hydroids in the family Eudendriidae","english_definition":"A genus of hydroids belonging to the family Eudendriidae, characterized by their branching, tree-like structure and the presence of perisarc only on the stem and branches, not extending to the hydranths.","examples":[{"sentence":"Specimens of Eudendrium were collected from the rocky intertidal zone.","translation":"岩の多い潮間帯からEudendriumの標本が収集されました。"},{"sentence":"The Eudendrium colony exhibited a distinct morphology compared to other hydroids in the aquarium.","translation":"水槽内の他のヒドロ虫と比較して、Eudendriumの群体は明確な形態を示しました。"}],"collocations":["Eudendrium colony","Eudendrium ramosum","Eudendrium growth","Eudendrium habitat","Eudendrium species"],"synonyms":["hydroid","hydrozoan","cnidarian"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'eu' (meaning 'good' or 'well') and 'dendron' (meaning 'tree'), referring to the branching, tree-like structure of the colony.","priority":"★★☆"},"pronunciation":{"ipa":"/juːˈdɛndriəm/","syllables":"Eu-den-dri-um"},"inflection":{"noun_plural":"Eudendriums or Eudendria"},"usage_notes":{"explanation":"Eudendrium is a genus name used in biological classification. It refers to a specific group of hydroids, which are colonial cnidarians related to jellyfish and corals. The term is primarily used in scientific contexts, such as marine biology, zoology, and ecology. When discussing Eudendrium, it's important to note that it represents a specific taxonomic group with characteristic features.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Eudendrium is a type of algae.","correct":"✓ The Eudendrium is a type of hydroid.","note":"Eudendrium is a hydroid, not an alga."},{"incorrect":"✗ Eudendrium are single-celled organisms.","correct":"✓ Eudendrium are colonial organisms.","note":"Eudendrium are colonial organisms, not single-celled."}],"priority":"★★☆"},"related_words":{"derivatives":["Eudendriidae (family)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Eudendrium' is a scientific term referring to a specific genus of hydroids, which are colonial marine organisms. The word is mainly encountered in academic or scientific contexts related to marine biology, zoology, or ecology. Understanding the term requires familiarity with biological classification and the characteristics of hydroids. Due to its specialized usage, it is not commonly found in general texts.","priority":"★★☆"},"example_sentences":[{"sentence":"The researchers studied the feeding behavior of Eudendrium in controlled laboratory conditions.","translation":"研究者らは、制御された実験室条件下でEudendriumの摂食行動を研究しました。","type":"noun","meaning_category":"hydroid genus"},{"sentence":"Eudendrium ramosum is a common species found in many coastal regions.","translation":"Eudendrium ramosumは、多くの沿岸地域で見られる一般的な種です。","type":"noun","meaning_category":"hydroid genus"},{"sentence":"The presence of Eudendrium indicates a healthy marine ecosystem.","translation":"Eudendriumの存在は、健全な海洋生態系を示しています。","type":"noun","meaning_category":"hydroid genus"}]}