{"word":"Osirify","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"To transform or elevate someone or something to a state of godliness or immortality, inspired by the Egyptian god Osiris.","english_definition":"To transform or elevate someone or something to a state of godliness or immortality, inspired by the Egyptian god Osiris.","examples":[{"sentence":"The artist sought to Osirify the mundane objects of daily life through his sculptures.","translation":"そのアーティストは、彫刻を通して日常生活のありふれた物を神聖で不滅なものへと変えようと試みた。"},{"sentence":"The poet's words Osirified the fallen hero, ensuring his legend would live on.","translation":"詩人の言葉は、倒れた英雄を神格化し、彼の伝説が生き続けることを確実にした。"}],"collocations":["Osirify a hero","Osirify an idea","Osirify a concept","Osirify mundane objects"],"synonyms":["immortalize","deify","canonize","elevate","glorify"],"antonyms":["degrade","demote","abase"]}],"etymology":{"value":"Derived from the name of the Egyptian god Osiris, associated with resurrection and immortality, combined with the suffix '-ify', meaning 'to make or become'.","priority":"★★★"},"pronunciation":{"ipa":"/oʊˈsɪrɪfaɪ/","syllables":"O-sir-i-fy"},"inflection":{"verb_forms":{"present_simple":["Osirify","Osirifies"],"past_simple":"Osirified","past_participle":"Osirified","present_participle":"Osirifying"}},"usage_notes":{"explanation":"'Osirify' is a neologism, a newly coined word, used to describe the act of bestowing a kind of immortality or godlike status upon someone or something. It is not a commonly used word and would be understood primarily in contexts where Egyptian mythology or the concept of immortalization is relevant.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pharaoh was Osirified by the construction.","correct":"✓ The pharaoh was Osirified after death.","note":"Osirification is typically associated with transformation after death or a significant elevation in status, not during life or by ordinary actions."}],"priority":"★☆☆"},"related_words":{"derivatives":["Osirification (noun)"],"related_concepts":["Osiris","Egyptian mythology","immortality","deification"]},"level_frequency":{"CEFR":"N/A (neologism)","frequency_google_ngram":"Very low frequency (neologism)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Osirify' is a highly specialized and rare term. Understanding it requires familiarity with Egyptian mythology, specifically the role of Osiris, and the general concept of deification or immortalization. It is unlikely to be encountered outside of specific academic or creative contexts. The word's meaning is relatively transparent, given knowledge of its components (Osiris + -ify)."},"example_sentences":[{"sentence":"The museum's exhibit aimed to Osirify the ancient artifacts, presenting them as timeless treasures.","translation":"博物館の展示は、古代の工芸品を時代を超越した宝物として提示し、それらを神聖化することを目指した。","type":"verb","meaning_category":"Transform to godliness"},{"sentence":"Through his art, he sought to Osirify the memory of his lost loved one.","translation":"彼の芸術を通して、彼は失われた愛する人の記憶を神聖化しようと努めた。","type":"verb","meaning_category":"Elevate to immortality"}]}