{"word":"unreusability","priority":"low","meanings":[{"part_of_speech":"noun","definition":"The state or quality of not being reusable; the inability to be reused.","english_definition":"The quality or state of being not reusable.","examples":[{"sentence":"The unreusability of the packaging materials is a major environmental concern.","translation":"その包装材の再利用不可能性は、主要な環境問題である。"},{"sentence":"The unreusability of certain code components led to increased development time.","translation":"特定のコードコンポーネントの再利用不可能性は、開発時間の増加につながった。"}],"collocations":["high unreusability","inherent unreusability","design for unreusability"],"synonyms":["non-reusability","disposability"],"antonyms":["reusability"],"related_terms":["reuse","reusable","unusable"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to 'reusability'.","priority":"medium"},"pronunciation":{"ipa":"ʌnˌjuːzəˈbɪləti","syllables":"un-re-us-a-bil-i-ty"},"inflection":{"noun_plural":"unreusabilities"},"usage_notes":{"explanation":"'Unreusability' is often used in technical contexts, such as software engineering or manufacturing, to describe components or materials that cannot be used again for their original purpose or a similar one. It highlights a limitation or a design flaw.","priority":"medium"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in technical or specialized contexts.","priority":"low"},"readability_explanation":{"level":"C1","text":"'Unreusability' is a relatively uncommon word that means something cannot be used again. It's often used when talking about things like packaging or software code, where being able to reuse items is important. If something has 'unreusability,' it means it's designed or made in a way that prevents it from being used more than once."},"example_sentences":[{"sentence":"The company addressed the issue of the product's unreusability by redesigning it with recyclable materials.","translation":"その会社は、リサイクル可能な材料で製品を再設計することにより、製品の再利用不可能性の問題に対処した。","type":"general"},{"sentence":"The unreusability of the legacy code made it necessary to rewrite the entire system.","translation":"レガシーコードの再利用不可能性により、システム全体を書き換える必要が生じた。","type":"technical"}]}