{"word":"reconciliations","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"和解、仲直り、雪解け、調整、一致、清算","english_definition":"The restoration of friendly relations; the action of making one view or belief compatible with another; the process of comparing one's financial records with those of an external source.","examples":[{"sentence":"After a long feud, the two families finally reached a reconciliation.","translation":"長年の確執の後、その二つの家族はついに和解に至った。"},{"sentence":"The reconciliation of faith and reason is a complex philosophical problem.","translation":"信仰と理性の調和は複雑な哲学的な問題である。"},{"sentence":"The bank reconciliation is an important accounting procedure.","translation":"銀行勘定調整は重要な会計手続きである。"}],"collocations":["reach a reconciliation (和解に達する)","seek reconciliation (和解を求める)","bank reconciliation (銀行勘定調整)","reconciliation process (和解のプロセス)","reconciliation committee (和解委員会)"],"synonyms":["agreement","harmony","resolution","settlement","appeasement","adjustment","alignment","verification"],"antonyms":["discord","conflict","disagreement","separation","estrangement"]}],"etymology":{"value":"Derived from the Latin word 'reconciliare,' meaning 'to restore, reunite, bring together again.' This is composed of 're-' (again) and 'conciliare' (to bring together, unite).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌrekənˌsɪliˈeɪʃənz/","syllables":"re-con-cil-i-a-tions"},"inflection":{"noun_plural":"reconciliations"},"usage_notes":{"explanation":"'Reconciliations' is the plural form of 'reconciliation.' It refers to multiple instances of restoring friendly relations, aligning differing views, or verifying financial records. The specific meaning depends on the context. In personal relationships, it signifies multiple acts of making amends. In finance, it refers to the periodic process of verifying and adjusting financial records.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The reconciliation were difficult.","correct":"✓ The reconciliations were difficult.","note":"Use the plural form 'reconciliations' when referring to multiple instances."},{"incorrect":"✗ I need a reconciliation with my bank.","correct":"✓ I need to do a reconciliation with my bank.","note":"'Reconciliation' in a financial context refers to the process of comparing records, not the act of having a relationship with the bank."}],"priority":"★★☆"},"related_words":{"derivatives":["reconcile (verb: to restore friendly relations; to make compatible)","reconcilable (adjective: capable of being reconciled)","irreconcilable (adjective: incapable of being reconciled)"],"phrasal_verbs":["reconcile with (to become friendly with someone again)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in specific contexts (e.g., finance, politics).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Reconciliations' is a complex term with multiple meanings, often used in formal or technical contexts. It generally refers to the act of bringing things into agreement or harmony. In personal relationships, it means restoring friendly relations after a disagreement. In finance, it refers to the process of verifying and adjusting financial records to ensure they match. Understanding the specific context is crucial for interpreting the meaning correctly."},"example_sentences":[{"sentence":"The peace treaty included several provisions for future reconciliations between the warring nations.","translation":"和平条約には、交戦国間の将来の和解のためのいくつかの条項が含まれていた。","type":"noun","meaning_category":"和解"},{"sentence":"Regular reconciliations of bank statements are essential for detecting fraud.","translation":"銀行取引明細書の定期的な調整は、不正行為を検出するために不可欠である。","type":"noun","meaning_category":"調整"},{"sentence":"The reconciliations of their differing political views proved impossible.","translation":"彼らの異なる政治的見解の調和は不可能であることが判明した。","type":"noun","meaning_category":"一致"}]}