{"word":"polyhemic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(医学)多血性の、赤血球過多の","english_definition":"(medicine) relating to or characterized by polycythemia; having an abnormally increased concentration of hemoglobin in the blood, through either reduction of plasma volume or increase in red cell numbers.","examples":[{"sentence":"The patient was diagnosed with a polyhemic condition.","translation":"その患者は多血性の状態と診断された。"},{"sentence":"Polyhemic individuals may experience increased risk of blood clots.","translation":"多血性の人は血栓のリスクが高まる可能性がある。"}],"collocations":["polyhemic condition","polyhemic state","polyhemic patient"],"synonyms":["polycythemic","erythrocytotic","hyperglobulic"],"antonyms":["anemic","hypohemic"]}],"etymology":{"value":"Derived from the Greek words 'poly' (meaning 'many' or 'much'), 'hem' (referring to blood), and '-ic' (a suffix indicating relationship or characteristic of). Thus, 'polyhemic' literally means 'having much blood'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɒliˈhiːmɪk/","syllables":"pol-y-he-mic"},"inflection":{"notes":"The word 'polyhemic' is an adjective and does not have different inflections."},"usage_notes":{"explanation":"The term 'polyhemic' is primarily used in medical contexts to describe conditions related to an excess of red blood cells or hemoglobin in the blood. It is often used interchangeably with 'polycythemic', although 'polycythemia' is the more commonly used term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The polyhemic solution was used for the experiment.","correct":"✓ The polycythemic blood sample was used for the experiment.","note":"While 'polyhemic' is technically correct, 'polycythemic' is the more standard and recognized term in medical literature."}],"priority":"★★☆"},"related_words":{"derivatives":["polycythemia (名詞: 多血症)","hemic (形容詞: 血液の、血の)"],"related_terms":["erythrocyte (赤血球)","hemoglobin (ヘモグロビン)","hematocrit (ヘマトクリット)"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Polyhemic' is a technical term primarily encountered in medical contexts. It describes a condition characterized by an abnormally high concentration of hemoglobin in the blood, often due to an increase in red blood cell numbers. While technically correct, it's less frequently used than its synonym, 'polycythemic'. Understanding this term requires a background in medical terminology and physiology."},"example_sentences":[{"sentence":"The doctor suspected a polyhemic state based on the patient's elevated hematocrit levels.","translation":"医師は患者のヘマトクリット値の上昇に基づいて多血性の状態を疑った。","type":"adjective","meaning_category":"多血性の"},{"sentence":"Treatment for polyhemic conditions often involves phlebotomy to reduce blood volume.","translation":"多血性の状態の治療には、しばしば血液量を減らすための瀉血が含まれる。","type":"adjective","meaning_category":"多血性の"}]}