{"word":"nighttime-worsened","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(症状などが)夜間に悪化する","english_definition":"(of a symptom or condition) becoming worse during the night.","examples":[{"sentence":"The patient reported nighttime-worsened pain in their lower back.","translation":"患者は腰の夜間悪化痛を訴えた。"},{"sentence":"Her asthma was nighttime-worsened, causing her to wake up coughing.","translation":"彼女の喘息は夜間に悪化し、咳で目が覚める原因となった。"},{"sentence":"We need to determine if the patient's symptoms are nighttime-worsened.","translation":"患者の症状が夜間に悪化するかどうかを判断する必要があります。"}],"collocations":["nighttime-worsened pain (夜間悪化痛)","nighttime-worsened symptoms (夜間悪化症状)","nighttime-worsened asthma (夜間悪化喘息)","nighttime-worsened cough (夜間悪化咳)"],"synonyms":["nocturnally exacerbated","night-aggravated","night-exacerbated"],"antonyms":["daytime-improved","daytime-alleviated"],"notes":"This term is often used in medical contexts to describe conditions that worsen at night."}],"etymology":{"value":"A compound word formed by combining \"nighttime\" (the time of night) with \"worsened\" (having become worse).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnaɪttaɪm ˈwɜːrsənd/","syllables":"night-time wor-sened"},"inflection":{"notes":"This is an adjective and does not have different forms."},"usage_notes":{"explanation":"\"Nighttime-worsened\" is used to specifically indicate that a condition or symptom becomes more severe or pronounced during the night. It's commonly used in medical descriptions and patient reports.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The pain was worsened at nighttime.","correct":"✓ The pain was nighttime-worsened.","note":"\"Nighttime-worsened\" is an adjective that directly modifies the noun. Using \"worsened at nighttime\" is grammatically correct but less concise."}],"priority":"★★☆"},"related_words":{"derivatives":["nighttime (noun, adjective)","worsened (verb, adjective)","nocturnal (adjective)","exacerbated (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1 (Specialized vocabulary, primarily used in medical contexts)","frequency_google_ngram":"Low frequency, primarily used in medical or scientific writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"nighttime-worsened\" is a specialized adjective used to describe symptoms or conditions that become more severe during the night. Due to its specific and technical nature, it is more commonly found in medical or scientific contexts. It's important to understand that it directly modifies a noun to indicate the timing of the worsening, rather than simply stating that something worsened at night."},"example_sentences":[{"sentence":"The patient's restless legs syndrome was significantly nighttime-worsened.","translation":"患者のむずむず脚症候群は夜間に著しく悪化した。","type":"adjective","meaning_category":"Medical Condition"},{"sentence":"The doctor documented the patient's nighttime-worsened cough in their medical records.","translation":"医師は患者の夜間悪化咳を診療記録に記載した。","type":"adjective","meaning_category":"Medical Symptom"},{"sentence":"The study investigated the causes of nighttime-worsened symptoms in patients with rheumatoid arthritis.","translation":"その研究は、関節リウマチ患者における夜間悪化症状の原因を調査した。","type":"adjective","meaning_category":"Medical Research"}]}