{"word":"proscriptional","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"禁止的な、禁止の、禁令的な","english_definition":"relating to or involving proscription; characterized by or involving prohibition or condemnation.","examples":[{"sentence":"The law was proscriptional in nature, forbidding certain activities.","translation":"その法律は本質的に禁止的であり、特定の活動を禁じていた。"},{"sentence":"The dictator's regime was known for its proscriptional policies.","translation":"その独裁者の政権は、禁止的な政策で知られていた。"},{"sentence":"The document contained a proscriptional clause that restricted the use of the land.","translation":"その文書には、土地の使用を制限する禁止条項が含まれていた。"}],"collocations":["proscriptional law (禁止法)","proscriptional policy (禁止政策)","proscriptional clause (禁止条項)","proscriptional measure (禁止措置)","proscriptional approach (禁止的なアプローチ)"],"synonyms":["prohibitive","restrictive","inhibitory","banning","condemnatory"],"antonyms":["permissive","prescriptive","allowing","enabling"]}],"etymology":{"value":"Derived from 'proscription,' which comes from Latin 'proscribere' (to outlaw, publish the name of a person as condemned and liable to death), from 'pro-' (before) + 'scribere' (to write).","priority":"★★☆"},"pronunciation":{"ipa":"/proʊˈskrɪpʃənəl/","syllables":"pro-scrip-tion-al"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Proscriptional' describes something that prohibits or restricts actions, behaviors, or practices. It often implies a formal or legal ban. It contrasts with 'prescriptive,' which dictates what *should* be done.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The proscriptional advice helped him succeed.","correct":"✓ The prescriptive advice helped him succeed.","note":"'Proscriptional' means forbidding, while 'prescriptive' means recommending or requiring a specific action. Use 'prescriptive' when something is being recommended or required, not forbidden."},{"incorrect":"✗ The proscriptional nature of the event made it very popular.","correct":"✓ The exclusive nature of the event made it very popular.","note":"'Proscriptional' implies a ban, which usually doesn't increase popularity. 'Exclusive' or another term might be more appropriate if the event was popular because it was limited to a select group."}],"priority":"★☆☆"},"related_words":{"derivatives":["proscribe (verb): to forbid, outlaw","proscription (noun): the act of proscribing; a ban or condemnation","proscriptive (adjective): tending to proscribe"],"antonyms":["prescriptive (adjective): stating what should be done"],"related_concepts":["censorship","regulation","restriction","ban","outlawing"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Proscriptional' is a formal and relatively rare word used to describe something that involves or relates to the act of forbidding or condemning. It's often used in legal, political, or academic contexts to describe laws, policies, or measures that prohibit certain actions or behaviors. Understanding this word requires a strong vocabulary and familiarity with formal language."},"example_sentences":[{"sentence":"The government implemented proscriptional measures to curb the spread of misinformation.","translation":"政府は誤情報の拡散を抑制するために禁止的な措置を実施した。","type":"general"},{"sentence":"The code of conduct included several proscriptional rules regarding employee behavior.","translation":"その行動規範には、従業員の行動に関するいくつかの禁止規則が含まれていた。","type":"legal/business"},{"sentence":"The academic paper analyzed the proscriptional effects of the legislation on freedom of speech.","translation":"その学術論文は、その法律が言論の自由にもたらす禁止的な影響を分析した。","type":"academic"}]}