{"word":"non-solubility","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"不溶性、溶解しない性質","english_definition":"The property of being insoluble; the inability to dissolve in a particular solvent.","examples":[{"sentence":"The non-solubility of the compound in water makes it difficult to study.","translation":"その化合物の水への不溶性により、研究が困難になっている。"},{"sentence":"Due to its non-solubility, the substance precipitates out of the solution.","translation":"その物質は不溶性のため、溶液から沈殿する。"}],"collocations":["exhibit non-solubility","degree of non-solubility","cause of non-solubility"],"synonyms":["insolubility","undissolvability"],"antonyms":["solubility"],"related_terms":["soluble","solvent","dissolve","precipitation"]}],"etymology":{"value":"Derived from 'non-' (prefix meaning 'not'), combined with 'solubility' (the ability to dissolve).","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˌsɒljʊˈbɪləti/","syllables":"non-sol-u-bil-i-ty"},"inflection":{"noun_plural":"non-solubilities (rare)"},"usage_notes":{"explanation":"'Non-solubility' is a technical term primarily used in chemistry, materials science, and related fields to describe substances that do not dissolve, or dissolve only to a very limited extent, in a particular solvent. It is often used to explain or predict the behavior of materials in different environments.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The non-solubility is good for this application.","correct":"The non-solubility is beneficial for this application.","note":"'Good' is a less precise term than 'beneficial' or 'advantageous' when describing a technical property like non-solubility."}],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Non-solubility' refers to the state of a substance that cannot be dissolved in a specific liquid (solvent). It's used in scientific contexts, such as chemistry or materials science, to describe why a material doesn't mix with a particular liquid. Understanding non-solubility is important for predicting how materials will behave in different solutions or environments.","priority":"★★★"},"example_sentences":[{"sentence":"The non-solubility of calcium carbonate in pure water is essential for the formation of limestone caves.","translation":"炭酸カルシウムの純粋な水への不溶性は、石灰岩の洞窟の形成に不可欠である。","type":"general","meaning_category":"property"},{"sentence":"The drug's non-solubility in lipids limits its ability to cross the blood-brain barrier.","translation":"その薬物の脂質への不溶性は、血液脳関門を通過する能力を制限する。","type":"medical","meaning_category":"application"}]}