{"word":"wise-heart","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"賢い心、思慮深い心","english_definition":"A heart characterized by wisdom and thoughtfulness.","examples":[{"sentence":"She approached the problem with a wise-heart, considering all angles before making a decision.","translation":"彼女は賢い心で問題に取り組み、決断を下す前にあらゆる角度を検討した。"},{"sentence":"His wise-heart guided him to make compassionate choices.","translation":"彼の思慮深い心は、彼を思いやりのある選択へと導いた。"}],"collocations":["a wise-heart approach","a wise-heart decision","a wise-heart guide"],"synonyms":["thoughtful","prudent","sagacious","discerning","insightful"],"antonyms":["foolish","rash","imprudent"]},{"part_of_speech":"adjective","definition":"賢明な心の、思慮深い心の","english_definition":"Having a heart characterized by wisdom and thoughtfulness.","examples":[{"sentence":"He is known for his wise-heart approach to leadership.","translation":"彼はリーダーシップに対する賢明な心の持ち主として知られている。"},{"sentence":"A wise-heart person always considers the consequences of their actions.","translation":"思慮深い心の人は、常に自分の行動の結果を考慮する。"}],"collocations":["wise-heart approach","wise-heart person","wise-heart leadership"],"synonyms":["thoughtful","prudent","sagacious","discerning","insightful"],"antonyms":["foolish","rash","imprudent"]}],"etymology":{"value":"Compound word combining 'wise' (having or showing experience, knowledge, and good judgment) and 'heart' (the organ regarded as the center of emotion or feeling).","priority":"★★★"},"pronunciation":{"ipa":"/waɪzˌhɑːrt/","syllables":"wise-heart"},"inflection":{"noun_plural":"wise-hearts"},"usage_notes":{"explanation":"The term 'wise-heart' is often used to describe someone who not only possesses intelligence but also applies it with empathy, understanding, and a deep consideration for others. It suggests a balance between intellect and emotional intelligence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a wise heart.","correct":"✓ He has a wise-heart.","note":"When used as a compound adjective, it's typically hyphenated. However, both forms can be acceptable depending on context and style. 'Wise heart' can also be used as two separate words, but it might lose some of the specific nuance of the compound term."}],"priority":"★☆☆"},"related_words":{"derivatives":["wise","heart","wisdom","heartfelt"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR vocabulary lists)","frequency_google_ngram":"Low frequency (relatively uncommon)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Wise-heart' is a relatively uncommon term that implies a deep level of both intellectual and emotional understanding. It's used to describe someone who makes decisions and approaches situations with both intelligence and empathy. The term is more nuanced than simply 'wise' and suggests a more holistic and compassionate approach to life."},"example_sentences":[{"sentence":"Her wise-heart counsel helped many people through difficult times.","translation":"彼女の思慮深い心の助言は、多くの人々が困難な時期を乗り越えるのに役立った。","type":"noun","meaning_category":"賢い心"},{"sentence":"The leader's wise-heart nature inspired trust and loyalty.","translation":"リーダーの賢明な心の性質は、信頼と忠誠心を刺激した。","type":"adjective","meaning_category":"賢明な心の"}]}