{"word":"karyomiton","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(細胞生物学) 紡錘糸形成時に核膜が消失した後、染色体が紡錘体の中央部に集合する段階。","english_definition":"(cell biology) The stage in mitosis or meiosis after the nuclear envelope has broken down, when the chromosomes align at the metaphase plate.","examples":[{"sentence":"Karyomiton is a critical stage in cell division, ensuring accurate chromosome segregation.","translation":"カリオミトンは細胞分裂における重要な段階であり、正確な染色体の分離を保証する。"}],"collocations":["karyomiton stage","enter karyomiton","observe karyomiton"],"synonyms":["metaphase","chromosome alignment","equatorial plate stage"],"antonyms":["prophase","anaphase","telophase"]}],"etymology":{"value":"ギリシャ語の 'karyon' (核) + 'mitos' (糸) に由来し、核内で糸状の染色体が整列する様子を表す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkærioʊˈmaɪtən/","syllables":"ka-ry-o-mi-ton"},"inflection":{"noun_plural":"karyomitons"},"usage_notes":{"explanation":"Karyomiton is a technical term used primarily in cell biology and genetics. It refers specifically to the metaphase stage of cell division (mitosis or meiosis) where chromosomes are aligned at the metaphase plate, ready for segregation. It is not a commonly used term outside of scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cell is in karyokinesis. It's in karyomiton.","correct":"✓ The cell is in karyokinesis. Specifically, it's in karyomiton (metaphase).","note":"Karyokinesis refers to the division of the nucleus, which encompasses several stages including karyomiton (metaphase). Karyomiton is a specific stage within karyokinesis."}],"priority":"★☆☆"},"related_words":{"derivatives":["karyokinesis (核分裂)","mitosis (有糸分裂)","meiosis (減数分裂)","chromosome (染色体)","metaphase (中期)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な科学用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Karyomiton' is a highly specialized term used in cell biology to describe the metaphase stage of cell division. Understanding this term requires prior knowledge of cell division processes like mitosis and meiosis, as well as familiarity with terms like chromosomes and metaphase plate. It is not typically encountered outside of advanced biology or genetics contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"During karyomiton, the chromosomes are attached to spindle fibers at their centromeres.","translation":"カリオミトン期には、染色体はセントロメアで紡錘糸に付着している。","type":"scientific","meaning_category":"cell biology"},{"sentence":"The observation of karyomiton under a microscope allows researchers to study chromosome behavior.","translation":"顕微鏡下でのカリオミトンの観察は、研究者が染色体の挙動を研究することを可能にする。","type":"scientific","meaning_category":"cell biology"}]}