{"word":"containability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"封じ込めやすさ、抑制の可能性、収容性","english_definition":"The ability to be contained or controlled; the degree to which something can be prevented from spreading or escaping.","examples":[{"sentence":"The containability of the virus is a major concern for public health officials.","translation":"そのウイルスの封じ込めやすさは、公衆衛生当局にとって大きな懸念事項です。"},{"sentence":"The high containability of the fire allowed firefighters to quickly extinguish the flames.","translation":"その火事の封じ込めやすさのおかげで、消防士はすぐに炎を消し止めることができました。"},{"sentence":"Researchers are studying the containability of nuclear waste in different storage facilities.","translation":"研究者たちは、さまざまな貯蔵施設における核廃棄物の収容性を研究しています。"}],"collocations":["high containability (高い封じ込めやすさ)","low containability (低い封じ込めやすさ)","assess containability (封じ込めやすさを評価する)","improve containability (封じ込めやすさを改善する)"],"synonyms":["manageability","controllability","restrainability","suppressibility","curbability"],"antonyms":["uncontainability","unmanageability","uncontrollability","unstoppability"]}],"etymology":{"value":"The word \"containability\" is formed by adding the suffix \"-ability\" to the word \"containable.\" \"Containable\" comes from the verb \"contain,\" which originates from the Latin word \"continere,\" meaning \"to hold together, enclose, restrain.\"","priority":"★★☆"},"pronunciation":{"ipa":"/kənˌteɪnəˈbɪləti/","syllables":"con-tain-a-bil-i-ty"},"inflection":{"noun_plural":"containabilities (rarely used)"},"usage_notes":{"explanation":"\"Containability\" refers to the quality or state of being able to be contained. It is often used in contexts where preventing the spread or escape of something is important, such as in discussions of infectious diseases, fires, or hazardous materials. The term emphasizes the degree to which control can be exerted over something, rather than simply whether it can be contained at all.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The containability was very good.","correct":"✓ The containability of the fire was very good.","note":"It's better to specify what is being contained (e.g., \"the containability of the fire\") rather than using \"containability\" in isolation. This provides more context and clarity."},{"incorrect":"✗ The containability is containing the spread.","correct":"✓ Containment is containing the spread. / ✓ The containability allows for containing the spread.","note":"\"Containability\" is a quality or potential, not an action. Use \"containment\" (the action of containing) or rephrase the sentence to show how the containability enables containment."}],"priority":"★★☆"},"related_words":{"derivatives":["contain (verb)","container (noun)","containment (noun)","containable (adjective)","uncontainable (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in technical or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Containability\" is a relatively advanced word that describes how easily something can be controlled or prevented from spreading. It's often used in discussions about things like viruses, fires, or hazardous materials. For example, if a disease has high containability, it means it's easier to stop it from spreading to other people. The word focuses on the potential for control rather than the act of controlling itself."},"example_sentences":[{"sentence":"The study assessed the containability of different strains of the influenza virus.","translation":"その研究では、インフルエンザウイルスのさまざまな株の封じ込めやすさを評価しました。","type":"noun","meaning_category":"封じ込めやすさ"},{"sentence":"Due to the building's fire-resistant design, the fire's containability was significantly improved.","translation":"建物の耐火設計のおかげで、火事の封じ込めやすさが大幅に向上しました。","type":"noun","meaning_category":"封じ込めやすさ"},{"sentence":"The government implemented strict measures to increase the containability of the radioactive leak.","translation":"政府は放射性物質の漏洩の封じ込めやすさを高めるために厳格な措置を実施しました。","type":"noun","meaning_category":"封じ込めやすさ"}]}