{"word":"Platycodon","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"キキョウ（桔梗）","english_definition":"A genus of herbaceous perennial flowering plants native to East Asia, belonging to the family Campanulaceae; specifically, Platycodon grandiflorus.","examples":[{"sentence":"The Platycodon is a beautiful addition to any garden.","translation":"キキョウはどんな庭にも美しい彩りを添えます。"},{"sentence":"Platycodon grandiflorus is known for its balloon-like buds.","translation":"キキョウは、風船のような蕾で知られています。"}],"collocations":["Platycodon grandiflorus (キキョウの学名)","Platycodon root (キキョウの根)","grow Platycodon (キキョウを育てる)"],"synonyms":["balloon flower","Chinese bellflower"],"antonyms":[]}],"etymology":{"value":"The name 'Platycodon' is derived from the Greek words 'platys' (broad) and 'codon' (bell), referring to the broad, bell-shaped flowers.","priority":"★★★"},"pronunciation":{"ipa":"/ˌplætɪˈkoʊdɒn/","syllables":"Plat-y-co-don"},"inflection":{"noun_plural":"Platycodons"},"usage_notes":{"explanation":"'Platycodon' refers to the genus of plants, but is most commonly used to refer to the species Platycodon grandiflorus, the balloon flower. It is often used in gardens for its attractive flowers and is also used in traditional medicine.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Platycodon flower yesterday, it was blue.","correct":"✓ I saw a Platycodon flower yesterday; it was blue.","note":"When joining two independent clauses, use a semicolon or separate sentences. Comma splices should be avoided in formal writing."}],"priority":"★★☆"},"related_words":{"derivatives":["Platycodin (キキョウから抽出されるサポニン)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Platycodon' is a botanical term referring to a specific genus of flowering plants, most notably the balloon flower (Platycodon grandiflorus). Understanding this term requires a basic knowledge of botany and plant classification. The word is relatively uncommon in everyday conversation but may appear in gardening or botanical contexts."},"example_sentences":[{"sentence":"The garden featured a variety of East Asian plants, including the elegant Platycodon.","translation":"その庭園には、優雅なキキョウをはじめ、さまざまな東アジアの植物が植えられていた。","type":"noun","meaning_category":"キキョウ"},{"sentence":"Platycodon roots are used in traditional Chinese medicine for their medicinal properties.","translation":"キキョウの根は、薬効があるため、伝統的な中国医学で使用されている。","type":"noun","meaning_category":"キキョウ"}]}