{"word":"Neonomianism","priority":"低","meanings":[{"part_of_speech":"名詞","definition":"新律法主義：カルヴァン主義神学における、救いは恵みによる信仰のみによるが、その信仰は新しい律法（キリストの律法）への従順によって証明されるという見解。","english_definition":"(Theology) The view in Calvinistic theology that salvation is by grace through faith alone, but that this faith is demonstrated by obedience to a new law (the law of Christ).","examples":[{"sentence":"Neonomianism attempts to reconcile grace and works in the process of salvation.","translation":"新律法主義は、救いの過程において恵みと行いを調和させようと試みます。"},{"sentence":"Some critics argue that neonomianism undermines the doctrine of salvation by grace alone.","translation":"一部の批評家は、新律法主義が恵みのみによる救いの教義を弱めると主張しています。"}],"collocations":["oppose neonomianism (新律法主義に反対する)","criticize neonomianism (新律法主義を批判する)","defend against neonomianism (新律法主義から擁護する)"],"synonyms":["Modified Calvinism","Hypothetical Universalism"],"antonyms":["Antinomianism (反律法主義)","Hyper-Calvinism (超カルヴァン主義)"]}],"etymology":{"value":"'Neo-' (新しい) + 'nomian' (律法の) + '-ism' (主義)。ギリシャ語の 'nomos' (律法) に由来。","priority":"中"},"pronunciation":{"ipa":"/ˌniːoʊˈnoʊmiənɪzəm/","syllables":"Ne-o-no-mi-an-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Neonomianism is a theological term primarily used within Calvinistic circles to describe a specific understanding of the relationship between faith, works, and salvation. It suggests that while salvation is ultimately by grace through faith, genuine faith will inevitably produce obedience to God's commands, effectively a 'new law.' This view is often contrasted with both antinomianism (which rejects the relevance of law for Christians) and more traditional forms of Calvinism that emphasize the sovereignty of God in salvation.","priority":"高"},"common_mistakes":{"examples":[{"incorrect":"✗ Neonomianism is the belief that salvation is earned through works.","correct":"✓ Neonomianism is the belief that salvation is by grace through faith, demonstrated by obedience.","note":"Neonomianism does not teach that salvation is earned through works, but that genuine faith will result in obedience."}],"priority":"中"},"related_words":{"derivatives":["Neonomian (新律法主義者)"],"phrasal_verbs":null,"priority":"低"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な神学用語。","priority":"低"},"readability_explanation":{"level":"C2","text":"Neonomianism is a complex theological concept within Calvinistic theology. It posits that while salvation is achieved through grace and faith, this faith is validated by adherence to a 'new law' or the law of Christ. This concept is often debated in relation to antinomianism (rejection of law) and traditional Calvinism, requiring a deep understanding of theological doctrines to fully grasp its nuances."},"example_sentences":[{"sentence":"The debate over neonomianism caused a significant split within the denomination.","translation":"新律法主義に関する議論は、その教団内で大きな分裂を引き起こしました。","type":"general","meaning_category":"theological debate"},{"sentence":"Some theologians view neonomianism as a compromise between grace and legalism.","translation":"一部の神学者は、新律法主義を恵みと律法主義の妥協と見なしています。","type":"theological","meaning_category":"theological interpretation"}]}