{"word":"syncopation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"シンコペーション、切分法","english_definition":"A displacement of the regular metrical accent in music caused by stressing notes on weak beats or between the beats.","examples":[{"sentence":"The song uses a lot of syncopation to create a jazzy feel.","translation":"その曲はジャズのような雰囲気を作り出すために、多くのシンコペーションを使用しています。"},{"sentence":"Syncopation is common in many types of music, including jazz, reggae, and funk.","translation":"シンコペーションは、ジャズ、レゲエ、ファンクなど、多くの種類の音楽で一般的です。"},{"sentence":"The drummer added syncopation to the rhythm to make it more interesting.","translation":"ドラマーはリズムをより面白くするために、シンコペーションを加えました。"}],"collocations":["use syncopation","add syncopation","create syncopation","rhythmic syncopation","heavy syncopation"],"synonyms":["off-beat","irregular rhythm","displaced accent"],"antonyms":["regular rhythm","on-beat"]}],"etymology":{"value":"From Late Latin *syncopa*, from Ancient Greek *synkopḗ* (συγκοπή) 'a cutting short, elision of a letter', from *synkóptō* (συγκόπτω) 'strike together, cut up, cut short'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɪŋkəˈpeɪʃən/","syllables":"syn-co-pa-tion"},"inflection":{"noun_plural":"syncopations"},"usage_notes":{"explanation":"Syncopation is a musical term referring to a rhythmic device where the emphasis is placed on unexpected beats or parts of beats. It creates a sense of rhythmic surprise and can make music sound more lively and interesting. It's often used in genres like jazz, funk, and reggae.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The song has a lot of syncopations.","correct":"✓ The song has a lot of syncopation.","note":"Syncopation is often used as an uncountable noun, especially when referring to the general use of the technique. However, 'syncopations' can be used to refer to specific instances or types of syncopation."},{"incorrect":"✗ Syncopation is when you play on the beat.","correct":"✓ Syncopation is when you play off the beat.","note":"Syncopation involves playing notes off the regular beat, not on it."}],"priority":"★★☆"},"related_words":{"derivatives":["syncopate (verb)","syncopated (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, specialized musical term.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Syncopation' is a musical term that describes a rhythm where the emphasis is placed on beats that are normally weak or unexpected. This creates a feeling of rhythmic surprise and complexity. It's a common technique in genres like jazz and funk. Understanding syncopation requires some knowledge of musical theory and rhythm.","priority":"★★★"},"example_sentences":[{"sentence":"The pianist used syncopation to create a complex and interesting melody.","translation":"ピアニストはシンコペーションを使って、複雑で面白いメロディーを作り出しました。","type":"general","meaning_category":"Musical technique"},{"sentence":"The syncopation in the drum part gave the song a unique groove.","translation":"ドラムパートのシンコペーションが、その曲に独特のグルーヴ感を与えました。","type":"general","meaning_category":"Rhythmic effect"},{"sentence":"Many jazz standards rely heavily on syncopation.","translation":"多くのジャズのスタンダードナンバーは、シンコペーションに大きく依存しています。","type":"general","meaning_category":"Genre characteristic"}]}