{"word":"pencraft","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"執筆技術、文章力、文筆業","english_definition":"The art or skill of writing; literary skill or ability; authorship.","examples":[{"sentence":"His pencraft was evident in the vivid descriptions of the landscape.","translation":"彼の文章力は、風景の生き生きとした描写に明らかだった。"},{"sentence":"She honed her pencraft through years of practice and dedication.","translation":"彼女は長年の練習と献身を通して、自身の執筆技術を磨いた。"},{"sentence":"The novelist's pencraft made his stories come alive for the reader.","translation":"その小説家の文章力は、彼の物語を読者にとって生き生きとしたものにした。"}],"collocations":["literary pencraft","fine pencraft","masterful pencraft","honing pencraft","developing pencraft","practicing pencraft"],"synonyms":["writing skill","literary skill","authorship","penmanship","composition","style","art of writing"],"antonyms":["illiteracy","inarticulateness","poor writing"],"notes":"Often used to describe the quality or style of someone's writing."}],"etymology":{"value":"A compound word formed from 'pen' (referring to the instrument used for writing) and 'craft' (referring to a skill or art).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɛnˌkræft/","syllables":"pen-craft"},"inflection":{"noun_plural":"pencrafts (rarely used)"},"usage_notes":{"explanation":"'Pencraft' is a relatively uncommon word, primarily used in literary contexts to emphasize the skill and artistry involved in writing. It is often used to praise or critique a writer's technique and style.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a good pencraft in mathematics.","correct":"✓ He has a good skill in mathematics.","note":"'Pencraft' specifically refers to writing skills, not skills in other areas. Use 'skill' or a more specific term for other abilities."},{"incorrect":"✗ The pencraft is on the table.","correct":"✓ The pen is on the table.","note":"'Pencraft' refers to the skill of writing, not the physical writing instrument. Use 'pen' to refer to the writing tool."}],"priority":"★☆☆"},"related_words":{"derivatives":["penman (noun: a skilled writer or calligrapher)","penmanship (noun: the art or manner of handwriting)","craft (noun: a skill or art; verb: to make skillfully)"],"related_concepts":["literature","writing","authorship","style","composition","rhetoric"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (uncommon word, used in specialized literary contexts)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pencraft' is a sophisticated word that refers to the skill and artistry of writing. It's not commonly used in everyday conversation but is more often found in literary discussions or writing critiques. Understanding this word helps in appreciating the nuances of writing and the effort involved in crafting well-written pieces.","note":"This word is more likely to be encountered in academic or literary settings."},"example_sentences":[{"sentence":"Her masterful **pencraft** captivated readers from the very first page.","translation":"彼女の卓越した文章力は、最初から読者を魅了した。","type":"general","meaning_category":"執筆技術"},{"sentence":"The course aims to improve students' **pencraft** through various writing exercises.","translation":"このコースは、様々な執筆練習を通して学生の文章力を向上させることを目的としている。","type":"educational","meaning_category":"執筆技術"},{"sentence":"The critic praised the author's **pencraft**, noting the elegant prose and compelling narrative.","translation":"評論家は、著者の文章力を称賛し、その優雅な散文と魅力的な物語を指摘した。","type":"literary criticism","meaning_category":"文章力"}]}