{"word":"Aonach","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(アイルランド・スコットランドの)市場、集会、競技会","english_definition":"(Irish and Scottish Gaelic) A fair, assembly, or gathering; especially a traditional Highland gathering or sports competition.","examples":[{"sentence":"The Aonach was a lively event, filled with music and dancing.","translation":"そのアオナッハは、音楽と踊りで賑わう活気のあるイベントだった。"},{"sentence":"They traveled to the Aonach to trade goods and compete in the games.","translation":"彼らは商品取引と競技会への参加のためにアオナッハへ旅立った。"}],"collocations":["Aonach Mòr (スコットランドの山の名前)"],"synonyms":["fair","gathering","assembly","market","festival"],"antonyms":[]}],"etymology":{"value":"古アイルランド語の 'oenach' に由来し、'集会、市場' を意味する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈiːnəx/","syllables":"ee-nuhkh"},"inflection":{"noun_plural":"Aonachs"},"usage_notes":{"explanation":"'Aonach' は、特にアイルランドやスコットランドのゲール文化圏における伝統的な市場、集会、競技会を指す言葉です。ハイランド・ゲームのようなスポーツ競技会や、音楽、ダンス、文化的な展示などが行われるイベントを指すことが多いです。現代では、地名やイベント名として使われることがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I went to the Aonach to buy a car.","correct":"✓ I went to the Aonach to buy local crafts.","note":"Aonachは伝統的な市場や集会であり、現代的な自動車販売の場ではありません。地元の工芸品や伝統的な商品が取引されることが多いです。"},{"incorrect":"✗ The Aonach is a quiet and solitary place.","correct":"✓ The Aonach is a lively and bustling place.","note":"Aonachは通常、多くの人々が集まり、活気にあふれた場所です。静かで孤独な場所ではありません。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Highland games","Ceilidh","Gaelic"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - ゲール文化圏に特有の単語であり、一般的な英語の語彙ではありません。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Aonach' is a specialized term primarily used in the context of Irish and Scottish Gaelic culture. It refers to a traditional gathering, fair, or assembly, often involving sports competitions, music, and cultural displays. Due to its specific cultural context and limited usage outside of Gaelic-speaking regions, it is considered an advanced vocabulary word. Understanding its meaning requires familiarity with Gaelic traditions and history."},"example_sentences":[{"sentence":"The annual Aonach drew crowds from all over the Highlands.","translation":"毎年恒例のアオナッハには、ハイランド地方各地から人々が集まった。","type":"noun","meaning_category":"集会・市場"},{"sentence":"Traditional Gaelic music filled the air at the Aonach.","translation":"アオナッハでは、伝統的なゲール音楽が会場に響き渡った。","type":"noun","meaning_category":"集会・市場"},{"sentence":"The Aonach featured competitions in caber tossing and other Highland games.","translation":"アオナッハでは、丸太投げなどのハイランド・ゲームの競技会が開催された。","type":"noun","meaning_category":"集会・市場"}]}