{"word":"attitude-based","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"態度に基づいた、態度を基準とした","english_definition":"Based on or determined by attitudes.","examples":[{"sentence":"The company uses attitude-based marketing to target specific consumer groups.","translation":"その会社は、特定の消費者グループをターゲットとするために、態度に基づいたマーケティングを使用しています。"},{"sentence":"The evaluation system is attitude-based, focusing on the employee's approach to their work.","translation":"評価システムは態度に基づいており、従業員の仕事への取り組み方に焦点を当てています。"}],"collocations":["attitude-based assessment","attitude-based marketing","attitude-based evaluation"],"synonyms":["opinion-based","belief-based","perspective-based"],"antonyms":["fact-based","evidence-based","data-driven"]}],"etymology":{"value":"The word is formed by combining 'attitude' with '-based', indicating that something is founded on or derived from attitudes.","priority":"N/A"},"pronunciation":{"ipa":"/ˈætɪtjuːdˌbeɪst/","syllables":"at-ti-tude-based"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Attitude-based' is used to describe systems, approaches, or evaluations that rely on people's attitudes, opinions, or beliefs rather than objective data or facts. It is commonly used in fields like marketing, psychology, and human resources.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The decision was attitude, based on the survey results.","correct":"✓ The decision was attitude-based, based on the survey results.","note":"The correct form is 'attitude-based' as a compound adjective."}],"priority":"N/A"},"related_words":{"derivatives":["attitude","based"],"related_terms":["behavior-based","skill-based","knowledge-based"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'attitude-based' is a compound adjective used to describe something that is based on or influenced by attitudes. It's commonly used in professional or academic contexts, such as marketing or psychology, where understanding people's attitudes is important. The word itself is straightforward, but understanding its use requires familiarity with these fields."},"example_sentences":[{"sentence":"The study employed an attitude-based approach to understand consumer preferences.","translation":"その研究では、消費者の好みを理解するために、態度に基づいたアプローチを採用しました。","type":"adjective","meaning_category":"態度に基づいた"},{"sentence":"Attitude-based training programs can improve employee engagement.","translation":"態度に基づいたトレーニングプログラムは、従業員のエンゲージメントを向上させることができます。","type":"adjective","meaning_category":"態度に基づいた"}]}