{"word":"Statospore","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"成層圏胞子：特定の細菌や菌類によって生成される、大気の上層（成層圏）で生存できると仮定された耐久性の高い胞子。","english_definition":"A highly resistant spore, supposedly produced by certain bacteria and fungi, that is hypothesized to be capable of surviving in the upper layers of the atmosphere (the stratosphere).","examples":[{"sentence":"The existence of statospores is debated, but their potential role in panspermia is of interest.","translation":"成層圏胞子の存在は議論の余地がありますが、パンスペルミアにおける潜在的な役割は興味深いです。"}],"collocations":["collect statospores","detect statospores","statospore sampling"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'strato-' (層、成層圏を意味する接頭辞) + 'spore' (胞子)","priority":"★★★"},"pronunciation":{"ipa":"/ˈstætəˌspɔːr/","syllables":"sta-to-spore"},"inflection":{"noun_plural":"statospores"},"usage_notes":{"explanation":"Statosporeという単語は、科学的な文脈、特に宇宙生物学や微生物生態学において使用されます。成層圏という極限環境で生存できる胞子の存在は、地球外生命の起源や拡散に関する議論に関連しています。","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["stratosphere","spore","panspermia"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低い頻度 (Very low frequency) - 専門用語。","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'statospore' refers to a hypothetical type of spore believed to be capable of surviving in the stratosphere. Its usage is limited to scientific discussions, particularly in fields like astrobiology and microbiology, where the possibility of life existing or being transported in extreme atmospheric conditions is considered. Understanding this term requires familiarity with scientific terminology related to spores, atmospheric layers, and the concept of panspermia."},"example_sentences":[{"sentence":"Scientists are investigating whether certain microorganisms can produce statospores capable of withstanding high levels of radiation.","translation":"科学者たちは、特定の微生物が高いレベルの放射線に耐えることができる成層圏胞子を生成できるかどうかを調査しています。","type":"scientific research","meaning_category":"microbiology"},{"sentence":"The theory of panspermia suggests that statospores could potentially travel between planets.","translation":"パンスペルミアの理論は、成層圏胞子が惑星間を移動する可能性があることを示唆しています。","type":"theoretical biology","meaning_category":"astrobiology"}]}