{"word":"transgressor","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"違反者、侵害者、罪人","english_definition":"a person who violates a law, command, moral code, etc.; a sinner.","examples":[{"sentence":"He was labeled a transgressor for defying the church's teachings.","translation":"彼は教会の教えに逆らったため、違反者とされた。"},{"sentence":"The transgressors were punished according to the severity of their crimes.","translation":"違反者たちは、その犯罪の重さに応じて処罰された。"},{"sentence":"She saw herself as a transgressor, unworthy of forgiveness.","translation":"彼女は自分自身を許しを得るに値しない罪人だと考えていた。"}],"collocations":["a moral transgressor (道徳的な違反者)","a legal transgressor (法的な違反者)","a habitual transgressor (常習的な違反者)","a minor transgressor (軽微な違反者)"],"synonyms":["offender","sinner","violator","wrongdoer","malefactor","criminal"],"antonyms":["law-abider","saint","righteous person"]}],"etymology":{"value":"Late Middle English: from Old French transgresseur, from Latin transgressor, from transgress- 'stepped across', from trans- 'across' + gradi 'to step'.","priority":"★★★"},"pronunciation":{"ipa":"/trænzˈɡrɛsər/","syllables":"trans-gress-or"},"inflection":{"noun_plural":"transgressors"},"usage_notes":{"explanation":"The term 'transgressor' is often used in formal or legal contexts to describe someone who has broken a rule or law. It carries a more serious or moral weight than simply calling someone a 'rule-breaker'. It can also be used in a religious context to refer to someone who has sinned.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a transgressor of the speed limit.","correct":"He is a transgressor because he exceeded the speed limit. / He transgressed the speed limit.","note":"'Transgressor' is a noun, referring to the person. To describe the act, use the verb 'transgress'."},{"incorrect":"She is a big transgressor.","correct":"She is a major transgressor. / She is a serious transgressor.","note":"Use adjectives like 'major' or 'serious' to describe the severity of the transgression, rather than 'big'."}],"priority":"★★☆"},"related_words":{"derivatives":["transgress (verb: to violate a law or moral code)","transgression (noun: an act of violating a law or moral code)","transgressive (adjective: violating or going beyond the bounds of what is acceptable)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Transgressor' is a formal word that means someone who breaks a rule, law, or moral principle. It's not commonly used in everyday conversation. You're more likely to find it in legal documents, religious texts, or philosophical discussions. It implies a serious violation or a deliberate crossing of boundaries.","priority":"★★☆"},"example_sentences":[{"sentence":"The judge sentenced the transgressor to community service.","translation":"裁判官は違反者に社会奉仕活動を命じた。","type":"noun","meaning_category":"違反者"},{"sentence":"History remembers him as a transgressor against the established order.","translation":"歴史は彼を既存の秩序に対する違反者として記憶している。","type":"noun","meaning_category":"違反者"},{"sentence":"The novel explores the psychology of a moral transgressor.","translation":"その小説は、道徳的な違反者の心理を探求している。","type":"noun","meaning_category":"罪人"}]}