{"word":"oximetry","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"オキシメトリー、経皮的酸素飽和度測定法","english_definition":"The measurement of oxygen saturation of arterial blood noninvasively, typically using a pulse oximeter.","examples":[{"sentence":"Pulse oximetry is a common method for monitoring oxygen levels in patients.","translation":"パルスオキシメトリーは、患者の酸素レベルをモニタリングするための一般的な方法です。"},{"sentence":"Oximetry can help detect hypoxemia, a condition of abnormally low oxygen levels in the blood.","translation":"オキシメトリーは、血液中の酸素レベルが異常に低い状態である低酸素血症の検出に役立ちます。"}],"collocations":["pulse oximetry (パルスオキシメトリー)","continuous oximetry (持続的オキシメトリー)","home oximetry (在宅オキシメトリー)"],"synonyms":["pulse oximetry","oxygen saturation measurement","SpO2 measurement"],"antonyms":[]}],"etymology":{"value":"Derived from 'oxy-' (referring to oxygen) + '-metry' (referring to measurement).","priority":"★★☆"},"pronunciation":{"ipa":"/ɒkˈsɪmɪtri/","syllables":"ox-im-e-try"},"inflection":{"noun_plural":"oximetries"},"usage_notes":{"explanation":"Oximetry is a non-invasive method used to measure the oxygen saturation level in the blood. It is often performed using a pulse oximeter, which is a device that clips onto a finger, toe, or earlobe. The measurement is usually expressed as SpO2 (peripheral oxygen saturation), which indicates the percentage of hemoglobin in the blood that is saturated with oxygen. Oximetry is commonly used in hospitals, clinics, and at home to monitor patients with respiratory or cardiovascular conditions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Oximetry is a treatment for low oxygen levels.","correct":"✓ Oximetry is a method for measuring oxygen levels.","note":"Oximetry is a diagnostic tool, not a treatment. Treatment for low oxygen levels may include supplemental oxygen. "},{"incorrect":"✗ Oximetry is always accurate.","correct":"✓ Oximetry can be affected by factors such as poor circulation or nail polish.","note":"Oximetry readings can be affected by various factors, so it's important to consider these when interpreting the results."}],"priority":"★★☆"},"related_words":{"derivatives":["oximeter (名詞: オキシメーター)","hypoxemia (名詞: 低酸素血症)","oxygen saturation (名詞: 酸素飽和度)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Oximetry is a technical term referring to the non-invasive measurement of oxygen saturation in the blood. It is primarily used in medical contexts to assess a patient's respiratory status. The term is most commonly encountered in healthcare settings or in discussions related to respiratory health. Understanding the term is crucial for healthcare professionals and individuals monitoring their oxygen levels due to respiratory conditions. "},"example_sentences":[{"sentence":"The doctor ordered oximetry to assess the patient's respiratory function.","translation":"医師は患者の呼吸機能を評価するためにオキシメトリーを指示しました。","type":"general","meaning_category":"measurement"},{"sentence":"Continuous oximetry is used to monitor oxygen saturation during sleep studies.","translation":"持続的オキシメトリーは、睡眠検査中の酸素飽和度を監視するために使用されます。","type":"medical","meaning_category":"monitoring"}]}