{"word":"Laudist","priority":"低","meanings":[{"part_of_speech":"noun","definition":"(歴史) Laudの信奉者、またはLaudの教会的原則を支持した人","english_definition":"(historical) A follower or supporter of William Laud or his ecclesiastical principles.","examples":[{"sentence":"The Laudists were known for their emphasis on ritual and ceremony in the Church of England.","translation":"ローディストは、イングランド教会における儀式と典礼の重視で知られていました。"}],"collocations":["High Church Laudist","Anti-Laudist","Laudist reforms"],"synonyms":["High Churchman","Arminian (in the context of the Church of England)"],"antonyms":["Puritan","Calvinist (in the context of the Church of England)"]}],"etymology":{"value":"William Laud (1573–1645), Archbishop of Canterbury + '-ist'.","priority":"中"},"pronunciation":{"ipa":"ˈlɔːdɪst","syllables":"Lau-dist"},"inflection":{"noun_plural":"Laudists"},"usage_notes":{"explanation":"The term 'Laudist' refers to those who followed the religious and political ideas of William Laud, Archbishop of Canterbury under Charles I of England. Laud promoted a more ritualistic and hierarchical form of Anglicanism, which was opposed by Puritans and other more Calvinistic Protestants. The term is primarily historical.","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"He was a Laudist in the modern sense.","correct":"He was a High Church Anglican.","note":"'Laudist' is a historical term and not typically used to describe contemporary religious views."}],"priority":"低"},"related_words":{"derivatives":["Laudian (adjective, noun)","Laudianism (noun)"],"related_historical_figures":["William Laud","Charles I of England"],"related_events":["English Civil War","Religious controversies of the 17th century"]},"level_frequency":{"frequency_google_ngram":"Very low frequency - Primarily used in historical contexts.","priority":"低"},"readability_explanation":{"level":"C1","text":"'Laudist' is a term primarily encountered in historical texts relating to the Church of England in the 17th century. Understanding requires familiarity with the religious and political context of that era, including the controversies between Anglicans, Puritans, and other Protestant groups. The term is not commonly used in contemporary English. "},"example_sentences":[{"sentence":"The policies of the Laudists were a major cause of tension leading up to the English Civil War.","translation":"ローディストの政策は、イングランド内戦につながる緊張の主な原因でした。","type":"historical context","meaning_category":"supporter of William Laud"},{"sentence":"Many Puritans viewed the Laudists as crypto-Papists due to their emphasis on ceremony.","translation":"多くのピューリタンは、ローディストを儀式を重視するため、隠れカトリック教徒と見なしていました。","type":"historical context","meaning_category":"follower of Laudian principles"}]}