{"word":"UV-reactive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"紫外線に反応する、紫外線照射下で蛍光を発する","english_definition":"Exhibiting fluorescence or other visible effects when exposed to ultraviolet (UV) light.","examples":[{"sentence":"The paint is UV-reactive, glowing brightly under a blacklight.","translation":"その塗料は紫外線に反応し、ブラックライトの下で明るく光る。"},{"sentence":"Many minerals are UV-reactive, displaying different colors when exposed to UV light.","translation":"多くの鉱物は紫外線に反応し、紫外線を当てると異なる色を示す。"},{"sentence":"The security features on the banknote include UV-reactive ink.","translation":"その紙幣のセキュリティ機能には、紫外線に反応するインクが含まれている。"}],"collocations":["UV-reactive dye","UV-reactive ink","UV-reactive material","UV-reactive paint","UV-reactive pigment","UV-reactive plastic"],"synonyms":["fluorescent","phosphorescent"],"antonyms":["UV-resistant","UV-stable","non-fluorescent"]}],"etymology":{"value":"Composed of 'UV' (ultraviolet) and 'reactive' (tending to react). Indicates a substance's tendency to react to ultraviolet light by exhibiting fluorescence or other visual changes.","priority":"★★★"},"pronunciation":{"ipa":"ˌjuːˈviː riˈæktɪv","syllables":"U-V re-ac-tive"},"inflection":{"notes":"Does not inflect. Adjective only."},"usage_notes":{"explanation":"'UV-reactive' describes materials that change their appearance, typically by glowing or changing color, when exposed to ultraviolet light. This property is used in various applications, including security features, art, and scientific research. The term is often used interchangeably with 'fluorescent' but specifically refers to the cause of the fluorescence (UV light exposure).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The material is UV-react.","correct":"✓ The material is UV-reactive.","note":"'UV-reactive' is the correct adjective form. 'UV-react' is not standard usage."},{"incorrect":"✗ UV-reactive is only for blacklights.","correct":"✓ UV-reactive materials react to ultraviolet light, which includes blacklights but also natural sunlight.","note":"While often demonstrated with blacklights, UV-reactive materials respond to any source of UV light."}],"priority":"★★☆"},"related_words":{"derivatives":["reactivity"],"phrasal_verbs":[],"related_terms":["ultraviolet","fluorescence","phosphorescence","blacklight"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'UV-reactive' describes a material's ability to exhibit fluorescence or other visible effects when exposed to ultraviolet light. This is a technical term used in science, art, and security. Understanding the term requires knowledge of ultraviolet light and fluorescence. It is commonly used in product descriptions and scientific literature.","priority":"★★☆"},"example_sentences":[{"sentence":"The artist used UV-reactive paint to create a mural that glows in the dark.","translation":"アーティストは、暗闇で光る壁画を作成するために、紫外線反応性の塗料を使用しました。","type":"example","meaning_category":"general usage"},{"sentence":"The counterfeit banknotes lacked the UV-reactive security thread.","translation":"偽造紙幣には、紫外線反応性のセキュリティスレッドがありませんでした。","type":"example","meaning_category":"security"},{"sentence":"Scientists are studying UV-reactive polymers for use in advanced sensors.","translation":"科学者たちは、高度なセンサーでの使用のために紫外線反応性ポリマーを研究しています。","type":"example","meaning_category":"scientific research"}]}