{"word":"Corollaries","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)系、当然の結果、推論","english_definition":"(plural) A proposition that follows from (and is often appended to) one already proved; something that naturally follows; an easily drawn inference.","examples":[{"sentence":"The increase in spending is a direct corollary of the government's policies.","translation":"支出の増加は政府の政策の直接的な帰結である。"},{"sentence":"As a corollary to the theorem, we can state that...","translation":"定理の系として、次のように述べることができる。"}],"collocations":["direct corollary","important corollary","obvious corollary"],"synonyms":["consequence","result","outcome","conclusion","deduction","inference"],"antonyms":[]}],"etymology":{"value":"From Latin corollarium ('a gift, gratuity; an inference, deduction'), from corolla ('a small garland, chaplet, wreath'), diminutive of corona ('a garland, crown'). The sense evolved from a 'little gift' to a 'little extra' or 'something that follows easily'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒrəˈlɛriz/","syllables":"co-rol-lar-ies"},"inflection":{"noun_singular":"corollary"},"usage_notes":{"explanation":"'Corollaries' is the plural form of 'corollary'. A corollary is a statement that follows easily and obviously from a previously proven statement or theorem. It's used in mathematics, logic, and general reasoning to denote a natural consequence or inference. It often implies a direct and easily understood relationship.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The corollaries was obvious.","correct":"✓ The corollaries were obvious.","note":"'Corollaries' is plural, so it requires a plural verb ('were')."},{"incorrect":"✗ The corollary are important.","correct":"✓ The corollaries are important.","note":"Ensure subject-verb agreement. 'Corollaries' (plural) requires 'are' (plural)."}],"priority":"★★☆"},"related_words":{"derivatives":["corollary (singular noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Corollaries' refers to multiple propositions or inferences that naturally follow from a previously established theorem or statement. It's a term commonly used in academic and formal contexts, particularly in mathematics, logic, and philosophical discussions. Understanding this word requires a grasp of formal reasoning and the relationship between different statements or ideas. It signifies a direct and easily derived consequence.","priority":"★★☆"},"example_sentences":[{"sentence":"The economic crisis had several unfortunate corollaries, including increased unemployment and poverty.","translation":"経済危機は、失業と貧困の増加を含むいくつかの不幸な帰結をもたらした。","type":"noun","meaning_category":"consequence"},{"sentence":"As corollaries to the main theorem, we can easily prove these three additional statements.","translation":"主要な定理の系として、これら3つの追加のステートメントを簡単に証明できます。","type":"noun","meaning_category":"inference"},{"sentence":"One of the corollaries of the new environmental policy is a reduction in carbon emissions.","translation":"新しい環境政策の帰結の1つは、炭素排出量の削減です。","type":"noun","meaning_category":"result"}]}