{"word":"retransitioner","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A person who has transitioned to live as a different gender than they were assigned at birth, and who later transitions back to living as their original gender or a different gender identity.","english_definition":"A person who transitions, then transitions again, often back to their original gender or to another gender identity.","examples":[{"sentence":"Some retransitioners find that their initial transition was not the right path for them.","translation":"再移行者の中には、最初の移行が自分にとって正しい道ではなかったと気づく人もいます。"},{"sentence":"Support groups for retransitioners are becoming more common.","translation":"再移行者のためのサポートグループが増えてきています。"}],"collocations":["detransition","transition","gender identity","gender dysphoria"],"synonyms":["detransitioner"],"antonyms":[]}],"etymology":{"value":"Formed by adding the prefix 're-' (meaning 'again' or 'back') to 'transitioner'.","priority":"N/A"},"pronunciation":{"ipa":"/ˌriːtrænˈzɪʃənər/","syllables":"re-tran-si-tion-er"},"inflection":{"noun_plural":"retransitioners"},"usage_notes":{"explanation":"The term 'retransitioner' is relatively new and is used to describe individuals who have undergone a transition process and then subsequently transition again. This can involve returning to their birth-assigned gender or transitioning to a different gender identity altogether. The reasons for retransitioning can vary widely and may include changes in personal identity, experiences of discrimination, or challenges related to medical or social aspects of transitioning.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["retransition (noun/verb)","transitioner","detransition"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - This is a relatively new and uncommon term.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The word 'retransitioner' refers to someone who has transitioned genders and then transitions again, often back to their original gender or to another gender identity. This term is used in discussions about gender identity and transition experiences. Understanding this word requires familiarity with the concept of gender transition itself."},"example_sentences":[{"sentence":"The documentary explored the experiences of several retransitioners and their reasons for changing their gender presentation again.","translation":"そのドキュメンタリーは、数人の再移行者の経験と、彼らが再び性別の表現を変えた理由を探求した。","type":"noun","meaning_category":"person who transitions again"},{"sentence":"Support for retransitioners is crucial to ensure their well-being and acceptance.","translation":"再移行者への支援は、彼らの幸福と受容を確実にするために不可欠である。","type":"noun","meaning_category":"person who transitions again"}]}