{"word":"resilement","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律)契約の取り消し、撤回、破棄","english_definition":"(law) The act of withdrawing from or retracting a contract, agreement, or commitment; rescission.","examples":[{"sentence":"The resilement of the contract was due to unforeseen circumstances.","translation":"契約の取り消しは、予期せぬ状況によるものでした。"},{"sentence":"The company sought resilement from the agreement after discovering the hidden clauses.","translation":"その会社は、隠された条項を発見した後、契約の破棄を求めました。"}],"collocations":["contract resilement","agreement resilement","right of resilement"],"synonyms":["rescission","withdrawal","retraction","cancellation","revocation","repudiation"],"antonyms":["ratification","affirmation","validation","confirmation"]}],"etymology":{"value":"Derived from the French word 'résiliement', which itself comes from the Latin 'resilire' meaning 'to spring back, recoil'.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈzaɪlmənt/","syllables":"re-sile-ment"},"inflection":{"noun_plural":"resilements"},"usage_notes":{"explanation":"'Resilement' is a formal and relatively rare term, primarily used in legal contexts to refer to the act of withdrawing from or canceling a contract or agreement. It is often used synonymously with 'rescission', 'retraction', or 'cancellation'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The resilement was done verbally.","correct":"✓ The resilement was executed in writing.","note":"Resilement typically requires formal documentation, so it is usually executed in writing rather than verbally."},{"incorrect":"✗ He resiled the contract.","correct":"✓ He sought resilement from the contract.","note":"'Resilement' is a noun, so it is more appropriate to use phrases like 'seek resilement' or 'obtain resilement' rather than using it as a verb."}],"priority":"★☆☆"},"related_words":{"derivatives":["resile (verb: to withdraw, retract)","resilient (adjective: able to recover quickly from difficulties)"],"phrases":["right of resilement (the legal right to withdraw from a contract within a specified period)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (Rare and specialized legal vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Resilement' is a highly formal and technical term primarily encountered in legal contexts. It refers to the act of formally withdrawing from or canceling a contract or agreement. Due to its specialized usage, it is not commonly used in everyday language and is more likely to be found in legal documents or scholarly articles. Understanding this term requires familiarity with legal concepts and terminology."},"example_sentences":[{"sentence":"The clause provided a clear path for resilement should the project fail to meet its objectives.","translation":"その条項は、プロジェクトが目標を達成できなかった場合に契約を取り消す明確な道筋を示していました。","type":"noun","meaning_category":"契約の取り消し"},{"sentence":"Due to the breach of trust, the client sought resilement from the service agreement.","translation":"信頼の侵害により、クライアントはサービス契約の破棄を求めました。","type":"noun","meaning_category":"契約の破棄"}]}