{"word":"repulsor","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"反発するもの、反発させる力、反発装置","english_definition":"Something that repels; a device or force that causes repulsion.","examples":[{"sentence":"The magnets acted as repulsors, pushing each other away.","translation":"その磁石は反発装置として働き、互いに押し合った。"},{"sentence":"He designed a repulsor field to protect the perimeter.","translation":"彼は周囲を保護するために反発フィールドを設計した。"},{"sentence":"The repulsor technology allowed the vehicle to hover above the ground.","translation":"その反発技術によって、車両は地上をホバーすることができた。"}],"collocations":["repulsor field (反発フィールド)","repulsor beam (反発ビーム)","magnetic repulsor (磁気反発装置)","repulsor lift (反発リフト)"],"synonyms":["deflector","barrier","shield"],"antonyms":["attractor"]},{"part_of_speech":"noun","definition":"(主にSF作品で)反重力装置、反重力エンジン","english_definition":"(chiefly in science fiction) a device or engine that creates a force opposing gravity, allowing for levitation or flight.","examples":[{"sentence":"The spaceship used repulsors to navigate through the asteroid field.","translation":"その宇宙船は、小惑星帯を航行するために反重力装置を使用した。"},{"sentence":"His suit was equipped with repulsors, allowing him to fly.","translation":"彼のスーツには反重力装置が装備されており、飛行することができた。"},{"sentence":"The hovercraft relied on repulsors for propulsion and maneuverability.","translation":"そのホバークラフトは、推進力と操縦性のために反重力エンジンに依存していた。"}],"collocations":["repulsor engine (反重力エンジン)","repulsor technology (反重力技術)","repulsor craft (反重力機)","repulsor beam (反重力ビーム)"],"synonyms":["antigravity device","levitator","hover engine"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word \"repellere,\" meaning \"to drive back\" or \"to repel.\" The suffix \"-or\" indicates an agent or device that performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈpʌlsər/","syllables":"re-pul-sor"},"inflection":{"noun_plural":"repulsors"},"usage_notes":{"explanation":"The word \"repulsor\" is often used in science fiction to describe devices that create a force that opposes gravity or causes objects to repel each other. In real-world contexts, it can refer to any device or force that causes repulsion, such as magnetic repulsion. The term is less common in everyday language and more prevalent in technical or fictional settings.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The repulsor attracted the object.","correct":"✓ The repulsor repelled the object.","note":"Repulsors cause repulsion, not attraction. Therefore, using \"attracted\" is incorrect."},{"incorrect":"✗ He used a repulsor to pull the object closer.","correct":"✓ He used a repulsor to push the object away.","note":"The function of a repulsor is to push away, not to pull closer."}],"priority":"★★☆"},"related_words":{"derivatives":["repel (verb)","repulsion (noun)","repulsive (adjective)"],"related_terms":["magnetic repulsion","electrostatic repulsion","antigravity"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Technical or Science Fiction)","frequency_google_ngram":"Low frequency - Primarily used in specific technical or fictional contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word \"repulsor\" is a technical term, often found in science fiction, referring to a device or force that causes repulsion or opposes gravity. It is derived from the verb \"repel,\" meaning to drive back or push away. The term is not commonly used in everyday language and is more likely to appear in specialized or fictional contexts. Understanding its meaning requires a familiarity with scientific or science fiction concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The spaceship's repulsors allowed it to navigate the dense asteroid field.","translation":"宇宙船の反重力装置によって、密集した小惑星帯を航行することができた。","type":"noun","meaning_category":"反重力装置"},{"sentence":"The magnetic repulsor kept the two objects from touching.","translation":"磁気反発装置は、2つの物体が接触するのを防いだ。","type":"noun","meaning_category":"反発装置"},{"sentence":"The inventor claimed his repulsor technology could revolutionize transportation.","translation":"発明者は、彼の反発技術が輸送に革命をもたらすと主張した。","type":"noun","meaning_category":"反発技術"},{"sentence":"The repulsor field protected the base from incoming projectiles.","translation":"反発フィールドは、基地を飛来する発射物から保護した。","type":"noun","meaning_category":"反発フィールド"}]}