{"word":"heteroplastic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"異種移植の、異所形成の","english_definition":"Relating to the transplantation of tissue between individuals of different species; relating to heteroplasia.","examples":[{"sentence":"A heteroplastic graft involves transplanting tissue from one species to another.","translation":"異種移植片は、ある種から別の種へ組織を移植することを含む。"},{"sentence":"Heteroplastic ossification refers to the formation of bone in abnormal locations.","translation":"異所性骨化とは、異常な場所に骨が形成されることを指す。"}],"collocations":["heteroplastic graft","heteroplastic transplantation","heteroplastic ossification"],"synonyms":["xenoplastic","heterotopic"],"antonyms":["autoplastic","homoplastic"]}],"etymology":{"value":"Derived from the Greek words 'hetero-' (different) and 'plastic' (capable of being shaped or molded).","priority":"★★★"},"pronunciation":{"ipa":"/ˌhɛtərəˈplæstɪk/","syllables":"het-er-o-plas-tic"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Heteroplastic' is used in biological and medical contexts to describe processes or materials involving different species or abnormal tissue formation. It is often used in discussions of transplantation, grafting, and developmental biology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The surgery was heteroplastic, so the patient recovered quickly.","correct":"✓ The surgery involved a heteroplastic graft, which carries a risk of rejection.","note":"'Heteroplastic' describes the type of graft or process, not the outcome of surgery. It implies a higher risk of rejection due to the tissue being from a different species."}],"priority":"★★☆"},"related_words":{"derivatives":["heteroplasty (noun): the transplantation of tissue between different species or to an abnormal location.","heteroplasia (noun): the presence of different genetic material within the same cell or individual."],"related_terms":["autograft","allograft","xenograft","homograft","transplantation","grafting"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Heteroplastic' is a technical term primarily used in biology and medicine, specifically in the context of transplantation and tissue development. Understanding this term requires familiarity with basic concepts in these fields, such as the difference between species and the process of tissue grafting. Due to its specialized nature, it is not commonly encountered outside of scientific literature and advanced medical discussions."},"example_sentences":[{"sentence":"The heteroplastic transplant was rejected by the patient's immune system.","translation":"異種移植は患者の免疫系によって拒絶された。","type":"general","meaning_category":"異種移植"},{"sentence":"Heteroplastic bone formation can occur after certain types of injuries.","translation":"異所性骨形成は、特定の種類の怪我の後に発生する可能性がある。","type":"medical","meaning_category":"異所形成"}]}