{"word":"unrequickened","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Not made alive again; not revived.","english_definition":"Not restored to life; not revived or made active again.","examples":[{"sentence":"The unrequickened memories lay dormant in the old book.","translation":"再び活気づけられることのない記憶は、古い本の中で休眠状態にあった。"},{"sentence":"His unrequickened spirit remained subdued after the tragedy.","translation":"彼の再び活気づけられることのない精神は、悲劇の後も沈んだままだった。"}],"collocations":["unrequickened memories","unrequickened spirit","unrequickened hope"],"synonyms":["unrevived","dormant","inactive","lifeless","subdued"],"antonyms":["revived","quickened","animated","lively"]}],"etymology":{"value":"Formed from \"un-\" (not) + \"requicken\" (to make alive again). \"Requicken\" itself comes from \"re-\" (again) + \"quicken\" (to make alive), with \"quicken\" derived from Old English \"cwiccan\" (to make alive).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌn.rɪˈkwɪkənd/","syllables":"un-re-quick-ened"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have different forms for gender or number."},"usage_notes":{"explanation":"\"Unrequickened\" is a relatively rare and somewhat archaic word. It describes something that has not been brought back to life or activity. It is often used in a metaphorical sense to describe things like memories, spirits, or hopes that have not been revived or rekindled.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unrequickened engine started immediately.","correct":"✓ The engine, after some effort, was requickened.","note":"\"Unrequickened\" implies a lack of revival. An engine that starts immediately is not \"unrequickened.\" Instead, use \"requicken\" to describe successfully reviving something."}],"priority":"★☆☆"},"related_words":{"derivatives":["requicken (verb): to make alive again","quicken (verb): to make alive, to accelerate","quick (adjective): alive, fast","quickness (noun): liveliness, speed"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"\"Unrequickened\" is a rare and formal word meaning 'not brought back to life or activity.' It's used in literary or philosophical contexts to describe something that remains dormant or unrevived. Due to its rarity, it's not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The unrequickened embers of the fire provided no warmth.","translation":"再び火がつかない残り火は暖かさを与えなかった。","type":"adjective","meaning_category":"Not revived"},{"sentence":"His unrequickened enthusiasm made him a poor leader.","translation":"彼の再び燃え上がることのない熱意は、彼を頼りない指導者にした。","type":"adjective","meaning_category":"Not revived"}]}