{"word":"salvageably","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"救済可能なように、再利用可能なように、活用可能なように","english_definition":"in a manner that allows something to be saved from loss or destruction; in a way that something can be recovered and used again.","examples":[{"sentence":"The data was damaged, but salvageably so.","translation":"データは破損していたが、救済可能な状態だった。"},{"sentence":"Although the building was severely damaged, it was salvageably intact.","translation":"建物はひどく損傷していたが、再利用可能な状態だった。"}],"collocations":["salvageably damaged","salvageably intact","salvageably recoverable"],"synonyms":["recoverably","redeemably","retrievably"],"antonyms":["irrecoverably","irredeemably","unsalvageably"]}],"etymology":{"value":"Derived from 'salvageable' (capable of being salvaged) + '-ly' (forming an adverb). 'Salvageable' comes from 'salvage' (to rescue or save) + '-able' (capable of). 'Salvage' ultimately comes from Medieval Latin 'salvare' (to save).","priority":"★★★"},"pronunciation":{"ipa":"/ˈsælvɪdʒəbli/","syllables":"sal-vage-a-bly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Salvageably' is used to describe the degree to which something can be saved or recovered. It implies that although there may be damage or loss, there is still potential for rescue or reuse. It is often used in technical or formal contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The situation was salvageably, so we gave up.","correct":"✓ The situation was not salvageably, so we gave up.","note":"'Salvageably' implies a possibility of rescue or recovery. Using it in a context where something is given up suggests a misunderstanding of its meaning."}],"priority":"★★☆"},"related_words":{"derivatives":["salvage (verb, noun)","salvageable (adjective)","unsalvageable (adjective)","salvager (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Salvageably' is an advanced adverb that describes the manner in which something can be saved or recovered from loss or destruction. It's used in situations where there is damage or potential loss, but there's still a possibility of rescuing or reusing the item or situation. It's not a commonly used word and is more likely to appear in formal or technical contexts."},"example_sentences":[{"sentence":"The ship's cargo was only salvageably damaged, allowing the company to recoup some of its losses.","translation":"船の貨物は救済可能な程度の損傷しか受けておらず、会社は損失の一部を取り戻すことができた。","type":"adverb","meaning_category":"救済可能なように"},{"sentence":"The old computer system was salvageably, so they decided to upgrade rather than replace it entirely.","translation":"古いコンピュータシステムは活用可能だったので、完全に交換するのではなくアップグレードすることにした。","type":"adverb","meaning_category":"活用可能なように"}]}