{"word":"Neutralists","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A group or movement advocating for neutrality, especially in political or ideological conflicts.","english_definition":"Individuals or groups who advocate for a position of neutrality, particularly in political or ideological conflicts.","examples":[{"sentence":"The Neutralists argued that Switzerland should remain uninvolved in the European conflict.","translation":"中立主義者たちは、スイスはヨーロッパの紛争に関与すべきではないと主張した。"},{"sentence":"During the Cold War, various Neutralist movements emerged, advocating for non-alignment with either the United States or the Soviet Union.","translation":"冷戦中、様々な中立主義運動が現れ、アメリカ合衆国またはソビエト連邦のいずれにも非同盟を主張した。"}],"collocations":["political neutralists","ideological neutralists","peaceful neutralists","strict neutralists"],"synonyms":["non-aligned","impartial","non-interventionist","pacifist"],"antonyms":["partisan","interventionist","aligned"]}],"etymology":{"value":"Derived from 'neutral' (from Latin 'neutralis', meaning 'of neither side') with the suffix '-ist' indicating an advocate or follower of a particular ideology.","priority":"N/A"},"pronunciation":{"ipa":"/ˈnjuːtrələsts/","syllables":"neu-tral-ists"},"inflection":{"noun_plural":"Neutralists"},"usage_notes":{"explanation":"'Neutralists' refers to people who actively support or promote the idea of neutrality. This often involves advocating for a country or group to remain impartial and not take sides in conflicts or disputes. The term can apply to various contexts, including politics, ideology, and even personal relationships.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The neutralists country.","correct":"✓ The neutralist country.","note":"'Neutralists' is a plural noun referring to people, while 'neutralist' (without the 's') can be used as an adjective to describe something related to neutrality."}],"priority":"N/A"},"related_words":{"derivatives":["neutral","neutrality","neutralism","neutralist"],"related_concepts":["non-alignment","impartiality","pacifism","isolationism"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'Neutralists' denotes individuals or groups actively promoting neutrality, particularly in political or ideological contexts. Understanding the term requires familiarity with the concept of neutrality and the suffix '-ist,' which signifies an advocate or follower of a particular ideology. The word is relatively uncommon but important in discussions of international relations and political theory."},"example_sentences":[{"sentence":"The conference brought together Neutralists from around the world to discuss strategies for promoting peace.","translation":"その会議は、平和を促進するための戦略を議論するために、世界中から中立主義者を集めた。","type":"noun","meaning_category":"advocates of neutrality"},{"sentence":"Some critics argue that the Neutralists' position is unrealistic in the face of global threats.","translation":"一部の批評家は、中立主義者の立場は、世界的な脅威に直面して非現実的であると主張している。","type":"noun","meaning_category":"advocates of neutrality"}]}