{"word":"lithographers","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"リトグラフ作家、リトグラフ製作者","english_definition":"plural of lithographer: a person who makes lithographs.","examples":[{"sentence":"The lithographers carefully prepared the stones for printing.","translation":"リトグラフ作家たちは、印刷のために石を注意深く準備しました。"},{"sentence":"These lithographers are known for their detailed and artistic prints.","translation":"これらのリトグラフ作家は、その詳細で芸術的な版画で知られています。"}],"collocations":["master lithographers","talented lithographers","skilled lithographers"],"synonyms":["printmakers","graphic artists","stone printers"],"antonyms":[]}],"etymology":{"value":"From \"lithographer,\" which comes from lithography (the process of printing from a flat stone or metal plate) + -er (denoting a person who does something). Lithography itself comes from the Greek words \"lithos\" (stone) and \"graphe\" (writing).","priority":"★★☆"},"pronunciation":{"ipa":"/lɪˈθɒɡrəfərz/","syllables":"li-thog-ra-phers"},"inflection":{"noun_plural":"lithographers"},"usage_notes":{"explanation":"\"Lithographers\" refers specifically to individuals skilled in the art and craft of lithography. They are responsible for creating the original artwork or transferring existing images onto lithographic stones or plates, preparing the printing surface, and overseeing the printing process. The term implies a level of expertise in this particular printing technique.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lithographers used paints to create the image.","correct":"✓ The lithographers used specialized inks and greasy crayons to create the image.","note":"Lithography uses specific materials like greasy crayons or tusche for drawing on the stone or plate, not paints. Paints are used in other art forms, but not typically in lithography."},{"incorrect":"✗ The lithographers made a photograph.","correct":"✓ The lithographers made a lithograph.","note":"Lithographers create lithographs, which are prints made using the lithographic process. They do not make photographs, although photography can be involved in the process of creating a lithograph."}],"priority":"★★☆"},"related_words":{"derivatives":["lithograph","lithographic","lithography"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"lithographers\" refers to people who create lithographs. A lithograph is a type of print made using a flat stone or metal plate. The lithographer draws on the stone or plate with a greasy substance, treats it with chemicals, and then uses it to make prints. This word is specialized and related to the art of printmaking."},"example_sentences":[{"sentence":"The museum featured an exhibit of early 20th-century lithographers.","translation":"その美術館では、20世紀初頭のリトグラフ作家の展覧会が開催されました。","type":"noun","meaning_category":"リトグラフ作家"},{"sentence":"Many skilled lithographers worked in the printing industry during the 19th century.","translation":"19世紀には、多くの熟練したリトグラフ作家が印刷業界で働いていました。","type":"noun","meaning_category":"リトグラフ作家"}]}