{"word":"unexemplified","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"実例のない、例示されていない","english_definition":"Not shown or illustrated by example; not exemplified.","examples":[{"sentence":"The concept remained unexemplified, leaving the students confused.","translation":"その概念は実例のないままだったので、学生たちは混乱した。"},{"sentence":"An unexemplified principle is difficult to grasp.","translation":"例示されていない原理は把握するのが難しい。"}],"collocations":["unexemplified concept","unexemplified principle","remain unexemplified"],"synonyms":["unillustrated","unexplained","unclarified","unspecified"],"antonyms":["exemplified","illustrated","explained","clarified","specified"]}],"etymology":{"value":"Formed from 'un-' (not) + 'exemplified' (shown by example), which is the past participle of 'exemplify' (to illustrate by example).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnɪɡˈzemplɪfaɪd/","syllables":"un-ex-em-pli-fied"},"inflection":{"notes":"Adjective; does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Unexemplified' is used to describe something, typically a concept or idea, that has not been made clear or understandable through the use of examples. It often implies a lack of clarity or completeness in explanation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unexemplified student struggled with the assignment.","correct":"✓ The student, lacking examples, struggled with the assignment.","note":"'Unexemplified' describes the concept or principle, not the person. It means the concept was not shown with examples, not that the student is unexemplified."},{"incorrect":"✗ The theory was unexemplified by the professor.","correct":"✓ The theory was left unexemplified by the professor.","note":"'Left unexemplified' is more common than 'was unexemplified by'. It emphasizes the state of lacking examples."}],"priority":"★★☆"},"related_words":{"derivatives":["exemplify (verb)","exemplification (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unexemplified' is a relatively uncommon word used in formal or academic contexts. It describes something that hasn't been made clear or understandable through examples. If a teacher presents a complex idea without any examples, that idea could be described as 'unexemplified.' Because it's not a common word, it's important to use it in contexts where the meaning will be clear, or to rephrase using more common vocabulary."},"example_sentences":[{"sentence":"The abstract argument was presented in an unexemplified manner, making it difficult to follow.","translation":"抽象的な議論は例示されない方法で提示されたため、理解するのが困難だった。","type":"general","meaning_category":"実例のない"},{"sentence":"Without concrete cases, the legal principle remained unexemplified and theoretical.","translation":"具体的な事例がないため、その法的原則は例示されず、理論的なままだった。","type":"general","meaning_category":"例示されていない"}]}