{"word":"Serranids","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"スズキ目ハタ科に属する魚類の総称","english_definition":"A family of perciform fishes, many of which are known as sea basses, groupers, and fairy basslets.","examples":[{"sentence":"Serranids are often found in coral reefs.","translation":"ハタ科の魚はサンゴ礁でよく見られる。"}],"collocations":["coral reef serranids (サンゴ礁に生息するハタ科魚類)","large serranids (大型のハタ科魚類)"],"synonyms":["sea basses","groupers"],"antonyms":[]}],"etymology":{"value":"Derived from the family name Serranidae, which comes from the Latin word \"serra\" meaning \"saw,\" referring to the serrated edges of some of their opercula (gill covers).","priority":"★★☆"},"pronunciation":{"ipa":"/səˈrænɪdz/","syllables":"ser-ran-ids"},"inflection":{"noun_plural":"Serranids"},"usage_notes":{"explanation":"\"Serranids\" is a plural noun used to refer to multiple members of the Serranidae family. When referring to a single fish, it's more common to use the common name such as \"sea bass\" or \"grouper,\" or the specific species name.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ A serranids is swimming.","correct":"✓ A serranid is swimming. / ✓ A sea bass is swimming.","note":"\"Serranids\" is plural. To refer to one, use \"serranid\" (though less common) or a common name like \"sea bass.\""}],"priority":"★★☆"},"related_words":{"derivatives":["Serranidae (ハタ科)","sea bass (スズキ)","grouper (ハタ)","fairy basslet (ベニハナダイ)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"\"Serranids\" is a scientific term referring to a specific family of fish. Understanding and using this term requires some knowledge of marine biology and fish classification. It is more likely to be encountered in scientific literature or specialized contexts.","note":"This word is more common in scientific contexts."},"example_sentences":[{"sentence":"Many different species of serranids inhabit the waters around the island.","translation":"その島の周辺海域には、さまざまな種類のハタ科魚類が生息している。","type":"general","meaning_category":"general"},{"sentence":"The study focused on the feeding habits of serranids in the coral reef ecosystem.","translation":"その研究は、サンゴ礁生態系におけるハタ科魚類の食性に着目した。","type":"scientific","meaning_category":"scientific"}]}