{"word":"Parachorea","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"舞踏病様不随意運動","english_definition":"A neurological disorder characterized by involuntary, jerky movements similar to chorea, but also including dystonic postures and sustained muscle contractions. It is often associated with Huntington's disease or other underlying conditions.","examples":[{"sentence":"The patient presented with symptoms of Parachorea, including uncontrolled movements of the limbs and facial grimacing.","translation":"患者は、四肢の制御不能な動きや顔のしかめ面など、舞踏病様不随意運動の症状を呈した。"}],"collocations":["develop Parachorea","symptoms of Parachorea","Parachorea associated with Huntington's disease"],"synonyms":["chorea","dystonia","athetosis"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'para' (meaning 'beside' or 'near') and 'chorea' (meaning 'dance'). It suggests movements that are similar to, but distinct from, chorea.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpærəkəˈriːə/","syllables":"par-a-cho-re-a"},"inflection":{"noun_plural":"Parachoreas"},"usage_notes":{"explanation":"'Parachorea' is a medical term used to describe a specific type of movement disorder. It is important to note that it is a symptom, not a disease itself, and can be caused by various underlying conditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor diagnosed him with Parachorea disease.","correct":"✓ The doctor diagnosed him with Parachorea.","note":"Parachorea is a syndrome or symptom complex, not a disease itself. Therefore, it's more accurate to say someone has Parachorea, rather than Parachorea disease."}],"priority":"★☆☆"},"related_words":{"derivatives":["Parachoreic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Parachorea' is a highly specialized medical term used within the field of neurology. Understanding and use of this term requires advanced knowledge of medical terminology and movement disorders. It is unlikely to be encountered outside of medical contexts. "},"example_sentences":[{"sentence":"The neurologist observed Parachorea in the patient's gait.","translation":"神経科医は患者の歩行に舞踏病様不随意運動を観察した。","type":"medical observation","meaning_category":"symptom"},{"sentence":"Treatment for Parachorea focuses on managing the underlying cause.","translation":"舞踏病様不随意運動の治療は、根本原因の管理に焦点を当てる。","type":"medical treatment","meaning_category":"treatment"}]}