{"word":"ungloating","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(人を)出し抜いたり、打ち負かしたりしても、得意げにならない、勝ち誇らない","english_definition":"Not expressing or feeling excessive satisfaction or triumph over someone else's misfortune or defeat; not gloating.","examples":[{"sentence":"Despite winning the championship, the team remained ungloating and showed respect for their opponents.","translation":"優勝したにもかかわらず、チームは得意げにならず、対戦相手に敬意を払った。"},{"sentence":"Her ungloating response to his failure was a testament to her character.","translation":"彼の失敗に対する彼女の勝ち誇らない態度は、彼女の人格を証明するものだった。"}],"collocations":["ungloating manner","ungloating attitude","ungloating response"],"synonyms":["modest","humble","restrained","unassuming","gracious"],"antonyms":["gloating","triumphant","smug","boastful","exultant"]}],"etymology":{"value":"接頭辞 un- (否定) + gloating (得意げな)","priority":"★★☆"},"pronunciation":{"ipa":"/ʌŋˈɡloʊtɪŋ/","syllables":"un-glo-ting"},"inflection":{"adjective_forms":{"comparative":"more ungloating","superlative":"most ungloating"}},"usage_notes":{"explanation":"\"Ungloating\" describes someone who does not take pleasure in another person's failure or misfortune. It suggests a sense of empathy and restraint, even in situations where one might be tempted to celebrate their own success at another's expense. It is the opposite of \"gloating,\" which implies an excessive and often malicious satisfaction in someone else's suffering.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was ungloating about his success, so everyone disliked him.","correct":"✓ He was gloating about his success, so everyone disliked him.","note":"Ungloating means the opposite of gloating, so the sentence should reflect that. Gloating is what would cause others to dislike him."},{"incorrect":"✗ She gave an ungloating smile.","correct":"✓ She gave a gracious smile.","note":"A smile is usually described with words like gracious, kind, or gentle, rather than ungloating. Ungloating describes an overall attitude or response."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_words":["gloat","gloatingly","gloating"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"ungloating\" is a relatively uncommon and sophisticated term. It describes the quality of not expressing or feeling pleasure at someone else's misfortune. Understanding this word requires a good grasp of the prefix \"un-\" (meaning \"not\") and the word \"gloating\" (meaning to feel or express great, often malicious, pleasure about someone else's misfortune). It is most likely to be encountered in formal writing or discussions about ethics and behavior."},"example_sentences":[{"sentence":"The politician's ungloating acceptance speech won him widespread respect.","translation":"その政治家の勝ち誇らない就任演説は、彼に幅広い尊敬を集めた。","type":"adjective","meaning_category":"not triumphant"},{"sentence":"She remained ungloating even after her rival's embarrassing defeat.","translation":"彼女はライバルの恥ずかしい敗北の後でも、勝ち誇らなかった。","type":"adjective","meaning_category":"not taking pleasure in another's misfortune"}]}