{"word":"meteoroid","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"流星体","english_definition":"A small rocky or metallic body travelling through space.","examples":[{"sentence":"Meteoroids range in size from dust grains to small asteroids.","translation":"流星体の大きさは、塵の粒子から小さな小惑星まで様々です。"},{"sentence":"When a meteoroid enters the Earth's atmosphere, it becomes a meteor.","translation":"流星体が地球の大気圏に突入すると、流星になります。"}],"collocations":["meteoroid stream","meteoroid impact","interplanetary meteoroid"],"synonyms":["space rock","asteroid fragment"],"antonyms":[]}],"etymology":{"value":"Derived from 'meteor' (Greek 'meteōros' meaning 'high in the air') and '-oid' (meaning 'resembling').","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmiːtiərɔɪd/","syllables":"me-te-or-oid"},"inflection":{"noun_plural":"meteoroids"},"usage_notes":{"explanation":"A meteoroid is a small rocky or metallic body in outer space. It is significantly smaller than an asteroid and ranges in size from dust grains to small asteroids. When a meteoroid enters the Earth's atmosphere, it becomes a meteor, commonly known as a shooting star. If a meteor survives its passage through the atmosphere and impacts the Earth's surface, it is then called a meteorite.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ A meteorite is in space before entering the atmosphere.","correct":"✓ A meteoroid is in space before entering the atmosphere.","note":"A meteoroid is in space. A meteor is in the atmosphere. A meteorite is on the ground."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["meteor","meteorite","asteroid","comet"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Meteoroid' refers to a small piece of rock or metal that travels through space. It's smaller than an asteroid. When it enters Earth's atmosphere, it becomes a 'meteor' (shooting star). If it hits the ground, it's called a 'meteorite'. Knowing the difference between these terms helps in understanding space-related topics."},"example_sentences":[{"sentence":"Scientists study meteoroids to learn about the early solar system.","translation":"科学者たちは、初期の太陽系について知るために流星体を研究します。","type":"general","meaning_category":"science"},{"sentence":"The spacecraft encountered a stream of meteoroids during its mission.","translation":"その宇宙船は、ミッション中に流星体の群れに遭遇しました。","type":"general","meaning_category":"space exploration"}]}