{"word":"Mythopoetised","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"神話化する、神話的に表現する","english_definition":"To create or express something in a mythological or legendary form; to turn something into a myth.","examples":[{"sentence":"The author mythopoetised the hero's journey, imbuing it with archetypal significance.","translation":"その作家は英雄の旅を神話化し、原型的な意義を吹き込んだ。"},{"sentence":"The film mythopoetises the events of the war, creating a heroic narrative.","translation":"その映画は戦争の出来事を神話化し、英雄的な物語を創り出している。"}],"collocations":["mythopoetise a story","mythopoetise a figure","mythopoetise an event"],"synonyms":["mythologize","romanticize","idealize","fictionalize"],"antonyms":["demystify","deconstruct","realize","historicize"]}],"etymology":{"value":"'Myth' + 'poetise'. 'Myth' is from Greek 'mythos' meaning story or legend. 'Poetise' means to make into poetry or to treat in a poetic way.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɪθəˈpɔɪtɪˌsaɪzd/","syllables":"mi-tho-po-e-tised"},"inflection":{"verb_forms":{"present_simple":["mythopoetise","mythopoetises"],"past_simple":"mythopoetised","past_participle":"mythopoetised","present_participle":"mythopoetising"}},"usage_notes":{"explanation":"'Mythopoetise' is a verb that means to create or express something in a mythological or legendary form. It is often used to describe the process of turning historical events or figures into myths. The term is relatively rare and is often used in literary or academic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The event was mythopoetic.","correct":"✓ The event was mythopoetised.","note":"'Mythopoetic' is an adjective relating to mythopoeia or the creation of myths, while 'mythopoetised' is the past tense and past participle of the verb 'mythopoetise', meaning to turn something into a myth."}],"priority":"★☆☆"},"related_words":{"derivatives":["mythopoeia (noun: myth-making, the creation of myths)","mythopoetic (adjective: relating to mythopoeia)","mythopoesis (noun: the process of creating myths)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'mythopoetised' is a complex and rare term, primarily used in literary and academic contexts. It means to transform something into a myth or to express it in a mythological way. Understanding this word requires a strong grasp of both mythology and literary theory. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"Critics argued that the director mythopoetised the protagonist, turning him into an unrealistic hero.","translation":"批評家たちは、監督が主人公を神話化し、非現実的な英雄に変えたと主張した。","type":"verb","meaning_category":"神話化する"},{"sentence":"The poet mythopoetised the landscape, imbuing it with symbolic meaning.","translation":"その詩人は風景を神話化し、象徴的な意味を吹き込んだ。","type":"verb","meaning_category":"神話的に表現する"}]}