{"word":"gastronomically","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"美食的に、美食の観点から","english_definition":"with regard to gastronomy; in a way that relates to the art or science of good eating.","examples":[{"sentence":"The restaurant is gastronomically ambitious, offering a tasting menu with rare ingredients.","translation":"そのレストランは美食的に意欲的で、珍しい食材を使ったテイスティングメニューを提供している。"},{"sentence":"Gastronomically speaking, the region is known for its seafood.","translation":"美食的に言えば、その地域はシーフードで知られている。"},{"sentence":"The chef approaches cooking gastronomically, focusing on the science behind flavor combinations.","translation":"そのシェフは料理を美食的に捉え、味の組み合わせの背後にある科学に焦点を当てている。"}],"collocations":["gastronomically adventurous","gastronomically diverse","gastronomically interesting","gastronomically significant","gastronomically superior"],"synonyms":["culinarily","epicureanly","gourmetly"],"antonyms":[]}],"etymology":{"value":"\"Gastronomical\" + \"-ly\". \"Gastronomical\" is derived from \"gastronomy\" + \"-ical\". \"Gastronomy\" comes from Greek \"gastros\" (stomach) + \"nomos\" (law, arrangement, custom).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɡæstrəˈnɒmɪkli/","syllables":"gas-tro-nom-i-cal-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"\"Gastronomically\" is an adverb that describes something from the perspective of gastronomy, which is the art and science of good eating. It's often used to describe restaurants, regions, or dishes that are particularly interesting or significant from a culinary point of view. It emphasizes the quality, preparation, and presentation of food.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The city is very gastronomy.","correct":"✓ The city is gastronomically rich.","note":"\"Gastronomy\" is a noun (the art or science of good eating), while \"gastronomically\" is an adverb (in a way that relates to gastronomy). You need an adverb to modify an adjective like \"rich.\""},{"incorrect":"✗ He cooked gastronomically.","correct":"✓ He cooked with a gastronomical approach.","note":"While \"cooked gastronomically\" is technically correct, it's more common to say \"He cooked with a gastronomical approach\" or \"He approached cooking gastronomically\" to emphasize the thoughtful and scientific nature of the cooking."}],"priority":"★★☆"},"related_words":{"derivatives":["gastronomy (noun: the art or science of good eating)","gastronomic (adjective: relating to gastronomy)","gastronome (noun: a gourmet; a lover of good food)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word \"gastronomically\" is an advanced term related to the field of gastronomy, which is the art and science of good eating. It's used to describe something in terms of its culinary qualities, often implying a high level of skill, knowledge, or appreciation for food. Because it's a specialized term, it's more likely to be encountered in formal writing or discussions about food and culture."},"example_sentences":[{"sentence":"The region is known gastronomically for its unique blend of spices.","translation":"その地域は、独特のスパイスのブレンドで美食的に知られています。","type":"adverb","meaning_category":"美食の観点から"},{"sentence":"The chef's approach is gastronomically innovative, pushing the boundaries of traditional cuisine.","translation":"そのシェフのアプローチは美食的に革新的で、伝統的な料理の境界を押し広げています。","type":"adverb","meaning_category":"美食の観点から"},{"sentence":"Gastronomically, the festival offered a diverse range of flavors from around the world.","translation":"美食的に、その祭りは世界中の多様な味を提供していました。","type":"adverb","meaning_category":"美食の観点から"}]}