{"word":"perfective","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(文法)完了相の、完結相の","english_definition":"(grammar) relating to a verb aspect that expresses an action as completed or viewed as a single whole.","examples":[{"sentence":"The perfective aspect indicates that the action is completed.","translation":"完了相は、動作が完了したことを示します。"},{"sentence":"In the sentence 'I have eaten', 'have eaten' is in the perfective aspect.","translation":"「私は食べた」という文では、「食べた」は完了相です。"}],"collocations":["perfective aspect","perfective verb","perfective form"],"synonyms":["completive","terminative"],"antonyms":["imperfective","progressive","continuous"]},{"part_of_speech":"noun","definition":"(文法)完了相、完結相","english_definition":"(grammar) a verb aspect that expresses an action as completed or viewed as a single whole.","examples":[{"sentence":"The perfective is often used to describe completed actions in the past.","translation":"完了相は、過去の完了した動作を記述するためによく使用されます。"},{"sentence":"Many languages have a distinct morphological marking for the perfective.","translation":"多くの言語には、完了相のための明確な形態的標識があります。"}],"collocations":["use of the perfective","perfective marker","perfective and imperfective"],"synonyms":["completive aspect","terminative aspect"],"antonyms":["imperfective aspect","progressive aspect","continuous aspect"]}],"etymology":{"value":"Derived from the Latin word 'perfectus', the past participle of 'perficere' meaning 'to complete' or 'to finish'. The term 'perfective' in grammar reflects this sense of completion.","priority":"★★☆"},"pronunciation":{"ipa":"/pərˈfɛktɪv/","syllables":"per-fec-tive"},"inflection":{"noun_plural":"perfectives"},"usage_notes":{"explanation":"In linguistics, 'perfective' refers to a verb aspect that presents an action or event as a completed whole, without focusing on its internal phases or duration. It contrasts with the 'imperfective' aspect, which focuses on the ongoing or habitual nature of an action. The perfective aspect is often used to describe actions that have a clear beginning and end.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The perfective tense is used to describe ongoing actions.","correct":"✓ The perfective aspect is used to describe completed actions.","note":"The perfective is an aspect, not a tense. Tense refers to the time of the action (past, present, future), while aspect refers to how the action is viewed (completed, ongoing, habitual)."},{"incorrect":"✗ Perfective verbs are always in the past tense.","correct":"✓ Perfective verbs can be in various tenses, but they always indicate a completed action.","note":"The perfective aspect can be used with various tenses. For example, 'I will have finished' is future perfective."}],"priority":"★★☆"},"related_words":{"derivatives":["perfect (adjective, noun, verb)","perfection (noun)","perfectly (adverb)"],"related_terms":["aspect","imperfective","progressive","tense","verb morphology"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized academic vocabulary)","frequency_google_ngram":"Low frequency (specialized term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'perfective' is a technical term used in grammar and linguistics. It describes how a verb presents an action: as a completed whole, without focusing on its duration or internal stages. It is often contrasted with the 'imperfective' aspect, which presents an action as ongoing or habitual. Understanding the perfective aspect is important for analyzing verb forms in many languages.","priority":"★★☆"},"example_sentences":[{"sentence":"The aorist tense in Ancient Greek often expresses the perfective aspect.","translation":"古代ギリシャ語のアオリスト時制は、しばしば完了相を表します。","type":"adjective","meaning_category":"(文法)完了相の"},{"sentence":"The perfective is used to describe actions that have a definite end point.","translation":"完了相は、明確な終了点を持つ動作を記述するために使用されます。","type":"noun","meaning_category":"(文法)完了相"},{"sentence":"The Russian verb system heavily relies on the distinction between perfective and imperfective aspects.","translation":"ロシア語の動詞体系は、完了相と不完了相の区別に大きく依存しています。","type":"adjective","meaning_category":"(文法)完了相の"}]}