{"word":"Intraphilosophic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"哲学内部の、哲学内部に関する","english_definition":"Relating to or existing within the realm of philosophy itself; pertaining to discussions, debates, or concepts internal to philosophy.","examples":[{"sentence":"The debate was intraphilosophic, concerning the nuances of Kantian ethics.","translation":"その議論は哲学内部のもので、カント倫理学のニュアンスに関するものだった。"},{"sentence":"An intraphilosophic understanding of the problem is necessary before engaging with other disciplines.","translation":"他の分野と関わる前に、その問題に対する哲学内部の理解が必要である。"}],"collocations":["intraphilosophic debate","intraphilosophic discussion","intraphilosophic analysis","intraphilosophic perspective"],"synonyms":["philosophical","theoretical","academic","esoteric"],"antonyms":["practical","applied","interdisciplinary"]}],"etymology":{"value":"Formed from the prefix 'intra-' (within) combined with 'philosophic' (relating to philosophy).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪntrəfɪləˈsɒfɪk/","syllables":"in-tra-phi-lo-soph-ic"},"inflection":{"notes":"Adjectives do not inflect in English, except for comparative and superlative forms, which are not commonly used with this word."},"usage_notes":{"explanation":"'Intraphilosophic' is used to describe something that is happening within the field of philosophy, often referring to debates, discussions, or analyses that are highly specific to philosophical concepts and theories. It suggests a focus on internal consistency and coherence within philosophical thought.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The argument was interphilosophic.","correct":"✓ The argument was intraphilosophic.","note":"'Interphilosophic' would imply a discussion between different philosophies, while 'intraphilosophic' implies a discussion within a single philosophy or within the field of philosophy generally."}],"priority":"★★☆"},"related_words":{"derivatives":["philosophy","philosophical","intra-"],"related_concepts":["metaphilosophy","epistemology","ethics","ontology"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'intraphilosophic' is a highly specialized term used primarily in academic philosophical discourse. Understanding requires familiarity with philosophical terminology and concepts. Its usage is limited to contexts where internal philosophical matters are being discussed."},"example_sentences":[{"sentence":"The paper offers an intraphilosophic critique of contemporary moral realism.","translation":"その論文は、現代の道徳的実在論に対する哲学内部の批判を提供する。","type":"general","meaning_category":"philosophical critique"},{"sentence":"The intraphilosophic implications of quantum mechanics are still being explored.","translation":"量子力学の哲学内部の含意はまだ探求されている。","type":"general","meaning_category":"implications"}]}