{"word":"Parliamentarian","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"国会議員、議会主義者","english_definition":"a member of parliament; an advocate of parliamentary government.","examples":[{"sentence":"He is a respected Parliamentarian with years of experience.","translation":"彼は長年の経験を持つ、尊敬される国会議員です。"},{"sentence":"The Parliamentarians debated the new bill for hours.","translation":"国会議員たちは新しい法案について何時間も議論した。"},{"sentence":"She is a strong Parliamentarian, dedicated to serving her constituents.","translation":"彼女は強力な議会主義者であり、選挙区民に奉仕することに尽力している。"}],"collocations":["elected Parliamentarian","senior Parliamentarian","opposition Parliamentarian","ruling party Parliamentarian"],"synonyms":["legislator","congressman/congresswoman","senator","MP (Member of Parliament)"],"antonyms":[]}],"etymology":{"value":"'Parliament' + '-arian'.  'Parliament' is from Old French 'parlement' (a speaking, conference), from parler (to speak).  '-arian' denotes an advocate or member of a group.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɑːrlɪmənˈteəriən/","syllables":"par-li-men-tar-i-an"},"inflection":{"noun_plural":"Parliamentarians"},"usage_notes":{"explanation":"'Parliamentarian' refers to a member of a parliament, the legislative body of a country. It can also refer to someone who supports the principles of parliamentary government. The term is most commonly used in countries that have a parliamentary system, such as the United Kingdom, Canada, and Australia. In the United States, the equivalent terms are 'congressman,' 'congresswoman,' or 'senator.'","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a parliament.","correct":"✓ He is a Parliamentarian.","note":"'Parliament' is the institution; 'Parliamentarian' is the person who is a member of that institution."},{"incorrect":"✗ She is parliamentarian.","correct":"✓ She is a Parliamentarian.","note":"'Parliamentarian' is a noun, so it needs an article ('a' or 'an') when referring to a single person."}],"priority":"★★☆"},"related_words":{"derivatives":["parliament (noun: 議会)","parliamentary (adjective: 議会の)","parliamentarism (noun: 議会主義)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"比較的低い (Relatively low).  More common in political contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Parliamentarian' is used in political contexts to refer to a member of a parliament or someone who supports parliamentary government. It is not a commonly used word in everyday conversation, so it is more likely to be encountered in news articles, political discussions, or academic texts. Understanding the term requires knowledge of political systems and institutions."},"example_sentences":[{"sentence":"The young Parliamentarian made a passionate speech about education reform.","translation":"その若い国会議員は教育改革について情熱的な演説を行った。","type":"noun","meaning_category":"国会議員"},{"sentence":"As a strong Parliamentarian, she believed in the power of debate and compromise.","translation":"強力な議会主義者として、彼女は議論と妥協の力を信じていた。","type":"noun","meaning_category":"議会主義者"},{"sentence":"Several Parliamentarians voiced their concerns about the proposed budget cuts.","translation":"数人の国会議員が、提案された予算削減について懸念を表明した。","type":"noun","meaning_category":"国会議員"}]}