{"word":"lamellophone","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ラメラフォン（舌状楽器）：振動する舌（ラメラ）を使って音を出す楽器の総称。ムビラ、カリンバなどが代表的。","english_definition":"A musical instrument that creates sound by plucking vibrating tongues or tines (lamellae), typically made of metal or bamboo, which are attached to a soundboard or resonator.","examples":[{"sentence":"The mbira is a type of lamellophone popular in Zimbabwe.","translation":"ムビラはジンバブエで人気のあるラメラフォンの一種です。"},{"sentence":"Lamellophones are often used in African folk music.","translation":"ラメラフォンはアフリカの民族音楽でよく使用されます。"},{"sentence":"The kalimba, also known as a thumb piano, is a small and portable lamellophone.","translation":"カリンバは、サムピアノとしても知られ、小型で持ち運び可能なラメラフォンです。"}],"collocations":["play a lamellophone (ラメラフォンを演奏する)","traditional lamellophone (伝統的なラメラフォン)","African lamellophone (アフリカのラメラフォン)","lamellophone music (ラメラフォンの音楽)"],"synonyms":["thumb piano","mbira","kalimba","tine instrument"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin 'lamella' (small plate or scale) and the Greek 'phone' (sound).","priority":"★★☆"},"pronunciation":{"ipa":"/ləˈmɛləˌfoʊn/","syllables":"la-mel-lo-phone"},"inflection":{"noun_plural":"lamellophones"},"usage_notes":{"explanation":"A lamellophone is a broad category of musical instruments rather than a specific instrument itself. The term encompasses a wide variety of instruments from different cultures that share the common characteristic of producing sound through vibrating lamellae (tongues). The most well-known examples are the mbira and the kalimba, but many other less familiar instruments also fall under this classification.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I play the lamellophone very good.","correct":"✓ I play the lamellophone very well.","note":"'Well' is an adverb and should be used to modify the verb 'play'. 'Good' is an adjective."},{"incorrect":"✗ Lamellophone are easy to learn.","correct":"✓ Lamellophones are easy to learn.","note":"'Lamellophone' is a countable noun, so it needs to be pluralized when referring to multiple instruments."}],"priority":"★☆☆"},"related_words":{"derivatives":["lamella (名詞: 薄板、薄片)"],"phrasal_verbs":[],"instruments":["mbira","kalimba","marímbula","likembe","sanza","tympani"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'lamellophone' is a specialized term used in musicology and ethnomusicology to classify a group of musical instruments. It's not commonly used in everyday conversation. Understanding the term requires familiarity with musical instrument classification and terminology. The word itself is derived from Latin and Greek roots, which may not be immediately obvious to all learners. Therefore, this term is best suited for advanced learners or those with a specific interest in music. "},"example_sentences":[{"sentence":"The museum's collection includes a diverse range of lamellophones from across Africa.","translation":"その博物館のコレクションには、アフリカ各地の多様なラメラフォンが含まれています。","type":"noun","meaning_category":"instrument"},{"sentence":"The musician demonstrated the unique sounds of the lamellophone during the workshop.","translation":"その音楽家はワークショップでラメラフォンの独特な音色を実演しました。","type":"noun","meaning_category":"instrument"},{"sentence":"Research suggests that lamellophones have a long and rich history in many cultures.","translation":"研究によると、ラメラフォンは多くの文化において長く豊かな歴史を持っていることが示唆されています。","type":"noun","meaning_category":"instrument"}]}