{"word":"Martialization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(軍隊による)軍事化、軍政化、軍隊化","english_definition":"The process of organizing or training civilians for military service; the act of imposing military rule or control over a civilian population or area.","examples":[{"sentence":"The martialization of society during wartime led to significant changes in daily life.","translation":"戦時中の社会の軍事化は、日常生活に大きな変化をもたらした。"},{"sentence":"There were concerns about the increasing martialization of the police force.","translation":"警察力の軍隊化が進んでいることへの懸念があった。"},{"sentence":"The government denied any plans for the martialization of the region.","translation":"政府はその地域の軍政化計画を否定した。"}],"collocations":["increasing martialization (軍事化の進行)","complete martialization (完全な軍事化)","prevent martialization (軍事化を防ぐ)","martialization of society (社会の軍事化)","martialization of the police (警察の軍事化)"],"synonyms":["militarization","militarisation (British spelling)","militarism","military build-up","imposition of military rule","politicization of the military"],"antonyms":["demilitarization","civilianization","pacification","peacekeeping","civil control"]},{"part_of_speech":"noun","definition":"(比喩的に)軍隊のような規律や構造を導入すること","english_definition":"(Figuratively) The act of imposing a military-like discipline or structure on a civilian organization or activity.","examples":[{"sentence":"The new CEO's martialization of the company's management style was met with resistance from employees.","translation":"新しいCEOによる会社の経営スタイルの軍隊化は、従業員からの抵抗に遭った。"},{"sentence":"Critics argued that the martialization of education was stifling creativity and independent thinking.","translation":"批判者たちは、教育の軍隊化が創造性と独立した思考を抑圧していると主張した。"}],"collocations":["martialization of management (経営の軍隊化)","martialization of education (教育の軍隊化)","martialization of the workplace (職場の軍隊化)"],"synonyms":["regimentation","disciplining","structuring","formalization","standardization"],"antonyms":["deregulation","deformalization","loosening","flexibilization"]}],"etymology":{"value":"Derived from 'martial,' relating to war or the military, and the suffix '-ization,' indicating a process or action of becoming.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɑːrʃəlaɪˈzeɪʃən/","syllables":"mar-tial-i-za-tion"},"inflection":{"noun_plural":"martializations"},"usage_notes":{"explanation":"'Martialization' refers to the process of preparing for or implementing military control or influence. It can describe the literal transformation of a civilian entity into a military one, or the metaphorical imposition of military-style discipline and structure. The term often carries negative connotations, suggesting a loss of civil liberties or individual freedoms.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The martialization was happened suddenly.","correct":"✓ The martialization happened suddenly.","note":"'Martialization' is a noun and doesn't require an auxiliary verb like 'was' in this context. The correct sentence structure is subject + verb + adverb."},{"incorrect":"✗ They are martializing the society.","correct":"✓ They are militarizing the society. / ✓ They are imposing martial law on the society.","note":"While 'martializing' could be used, 'militarizing' is the more common and natural verb form to describe the act of making a society more military-like. If military rule is being imposed, 'imposing martial law' is more accurate."}],"priority":"★★☆"},"related_words":{"derivatives":["martial (adjective)","martial law (noun)","martial (noun - archaic)","militarize (verb)","militarization (noun)"],"phrases":["under martial law"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Martialization' is a formal term used to describe the process by which a society or organization becomes more militaristic or is placed under military control. It's often used in political science, history, and sociology to analyze the relationship between the military and civilian spheres. Understanding the term requires a grasp of abstract concepts like power, control, and social transformation. The word is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The government's response to the protests involved a gradual martialization of the capital city.","translation":"政府の抗議デモへの対応は、首都の段階的な軍事化を伴った。","type":"noun","meaning_category":"軍事化"},{"sentence":"The martialization of the workforce led to increased efficiency but also decreased employee morale.","translation":"労働力の軍隊化は効率の向上につながったが、従業員の士気も低下させた。","type":"noun","meaning_category":"軍隊のような規律の導入"},{"sentence":"The declaration of martialization allowed the military to take control of essential services.","translation":"軍政化の宣言により、軍は不可欠なサービスの管理を引き継ぐことができた。","type":"noun","meaning_category":"軍政化"}]}