{"word":"propatronage","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The act of advocating for or supporting a patron or system of patronage; favorable endorsement of patronage.","english_definition":"Advocacy or support for a patron or system of patronage.","examples":[{"sentence":"His speech was seen as blatant propatronage, praising the existing system without addressing its flaws.","translation":"彼の演説は、欠点に触れずに既存の制度を称賛する、あからさまなプロパトロネージと見なされた。"},{"sentence":"The article criticized the politician's propatronage stance, arguing it perpetuated inequality.","translation":"その記事は、政治家のプロパトロネージの姿勢を批判し、それが不平等を永続させると主張した。"}],"collocations":["express propatronage","criticize propatronage","defend propatronage"],"synonyms":["support for patronage","endorsement of patronage","advocacy of patronage"],"antonyms":["anti-patronage","opposition to patronage"]}],"etymology":{"value":"Derived from \"pro-\" (meaning \"in favor of\") combined with \"patronage\" (the support, encouragement, privilege, or financial aid that an organization or individual bestows to another).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊˈpeɪtrənɪdʒ/","syllables":"pro-pa-tron-age"},"inflection":{"noun_plural":"propatronages"},"usage_notes":{"explanation":"\"Propatronage\" is a relatively rare term, often used in political or sociological contexts to describe the act of actively supporting or defending a system of patronage. It implies a positive view of patronage, even when others might see it as problematic.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company's propatronage led to increased diversity.","correct":"✓ The company's patronage led to increased diversity.","note":"\"Propatronage\" describes the act of supporting patronage, not the patronage itself. In this context, simply using \"patronage\" is more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["patronage","patron","patronize"],"related_terms":["clientelism","nepotism","cronyism"]},"level_frequency":{"CEFR":"N/A (rare word)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"propatronage\" is a niche term used to describe support for a system of patronage, which involves granting favors or benefits. Because it is not commonly used, it is considered a high-level vocabulary word. Understanding the word requires knowledge of the prefix \"pro-\" and the concept of \"patronage.\""},"example_sentences":[{"sentence":"The senator's propatronage of local businesses was a key part of his economic policy.","translation":"上院議員による地元企業へのプロパトロネージは、彼の経済政策の重要な部分だった。","type":"example","meaning_category":"support for patronage"},{"sentence":"Critics accused the administration of propatronage, alleging that contracts were awarded based on connections rather than merit.","translation":"批評家たちは、政権が縁故主義を支持していると非難し、契約は能力ではなくコネに基づいて授与されていると主張した。","type":"example","meaning_category":"support for patronage"}]}