{"word":"coccygodynia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"尾骨痛","english_definition":"pain in the coccyx (tailbone).","examples":[{"sentence":"The patient complained of coccygodynia after a fall.","translation":"患者は転倒後、尾骨痛を訴えた。"},{"sentence":"Coccygodynia can be caused by trauma or repetitive strain.","translation":"尾骨痛は外傷または繰り返しの負荷によって引き起こされることがある。"}],"collocations":["chronic coccygodynia (慢性尾骨痛)","post-traumatic coccygodynia (外傷後尾骨痛)"],"synonyms":["coccydynia","tailbone pain"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'kokkyx' (cuckoo, referring to the shape of the coccyx resembling a cuckoo's beak) and 'odynē' (pain).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒk.sɪˈɡɒdɪniə/","syllables":"coc-cy-go-dyn-i-a"},"inflection":{"noun_plural":"coccygodynias"},"usage_notes":{"explanation":"Coccygodynia refers specifically to pain localized in the region of the coccyx. It can be caused by direct trauma (such as a fall), repetitive strain, or in some cases, the cause is unknown (idiopathic). Diagnosis typically involves a physical examination and imaging studies may be performed to rule out other causes of pain.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I have pain in my tail, it must be coccygodynia.","correct":"✓ I have pain in my tailbone, it might be coccygodynia.","note":"While 'tail' is sometimes used informally, 'tailbone' is the more accurate and common term. Also, self-diagnosis should be avoided; it's best to consult a medical professional."}],"priority":"★☆☆"},"related_words":{"derivatives":["coccyx (noun: 尾骨)","coccydynia (noun: 尾骨痛 - alternative spelling)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Coccygodynia' is a medical term referring to pain in the tailbone area. It is not a commonly used word outside of medical settings. If you experience persistent pain in your tailbone, it is best to consult a healthcare professional for diagnosis and treatment."},"example_sentences":[{"sentence":"The doctor diagnosed her with coccygodynia after the examination.","translation":"診察後、医師は彼女を尾骨痛と診断した。","type":"general","meaning_category":"diagnosis"},{"sentence":"Sitting for long periods exacerbated his coccygodynia.","translation":"長時間の座位は彼の尾骨痛を悪化させた。","type":"general","meaning_category":"symptoms"},{"sentence":"Physical therapy can be an effective treatment for coccygodynia.","translation":"理学療法は尾骨痛の効果的な治療法となり得る。","type":"general","meaning_category":"treatment"}]}