{"word":"unballetic","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"バレエ的でない、バレエの原則や美学に反する","english_definition":"Not characteristic of or conforming to the principles or aesthetics of ballet.","examples":[{"sentence":"The dancer's movements were unballetic, lacking the grace and precision expected in ballet.","translation":"そのダンサーの動きはバレエ的ではなく、バレエに期待される優雅さと正確さに欠けていた。"},{"sentence":"The choreography incorporated unballetic elements, such as sharp, angular movements, to create a modern and unconventional piece.","translation":"その振り付けは、鋭く角ばった動きなど、バレエ的でない要素を取り入れ、現代的で型破りな作品を作り出した。"}],"collocations":["unballetic movement","unballetic choreography","unballetic style"],"synonyms":["non-balletic","anti-balletic"],"antonyms":["balletic"],"notes":"Typically used to describe movements, styles, or choreography that deviate from traditional ballet. Often used in the context of modern or contemporary dance.","related_words":["ballet","balletic","choreography","dance","modern dance","contemporary dance"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to the word 'balletic'.","priority":"medium"},"pronunciation":{"ipa":"/ˌʌnbæˈlɛtɪk/","syllables":"un-bal-let-ic"},"inflection":{},"usage_notes":{"explanation":"'Unballetic' is used to describe something that does not adhere to the conventions or aesthetics of ballet. It can be used in a descriptive or critical way, depending on the context.","priority":"medium"},"common_mistakes":{},"level_frequency":{},"readability_explanation":{"level":"Difficult","text":"The word 'unballetic' is a specialized term used in the context of dance, particularly when discussing ballet and its deviations. Understanding the term requires familiarity with ballet's principles and aesthetics."},"example_sentences":[{"sentence":"The reviewer criticized the performance for its unballetic qualities.","translation":"評論家は、そのパフォーマンスがバレエ的でない点を批判した。","type":"general","meaning_category":"general"},{"sentence":"The choreographer deliberately incorporated unballetic movements to challenge traditional ballet norms.","translation":"振付師は、伝統的なバレエの規範に挑戦するために、意図的にバレエ的でない動きを取り入れた。","type":"general","meaning_category":"general"}]}