{"word":"unbiliously","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"快活に、不機嫌でなく、胆汁質でなく","english_definition":"In a cheerful, good-humored manner; not biliously (i.e., not ill-tempered or choleric).","examples":[{"sentence":"He greeted them unbiliously, a stark contrast to his usual grumpy demeanor.","translation":"彼はいつもの不機嫌な態度とは対照的に、快活に彼らを迎え入れた。"},{"sentence":"She approached the task unbiliously, determined to maintain a positive attitude.","translation":"彼女は前向きな姿勢を維持しようと決意し、快活にその仕事に取り組みました。"}],"collocations":["greet unbiliously","approach unbiliously","react unbiliously"],"synonyms":["cheerfully","good-humoredly","pleasantly","amiably","genially"],"antonyms":["biliously","grumpily","irascibly","cholericly","bad-temperedly"]}],"etymology":{"value":"Formed from \"un-\" (not) + \"bilious\" (affected by or associated with biliousness, i.e., ill temper or liver disorder) + \"-ly\" (adverbial suffix).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈbɪliəsli/","syllables":"un-bil-ious-ly"},"inflection":{"notes":"Adverb; no inflection."},"usage_notes":{"explanation":"\"Unbiliously\" is a somewhat rare and formal adverb. It describes an action or manner that is the opposite of being bilious, meaning it is cheerful, good-humored, and free from ill temper or irritability. The word is often used to emphasize a positive or pleasant demeanor, especially in situations where one might expect the opposite.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He unbiliously ate the cake.","correct":"✓ He cheerfully ate the cake.","note":"\"Unbiliously\" describes a manner or attitude, not a physical action like eating. Use a more appropriate adverb like \"cheerfully\" or \"happily\" instead."},{"incorrect":"✗ The weather was unbiliously sunny.","correct":"✓ The weather was pleasantly sunny.","note":"\"Unbiliously\" refers to a person's disposition, not the characteristics of weather. Use \"pleasantly\" or another descriptive adverb instead."}],"priority":"★★☆"},"related_words":{"derivatives":["bilious (adjective: ill-tempered, choleric; relating to bile or liver disorder)","biliousness (noun: ill temper, irritability; excessive secretion of bile)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely rare.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"unbiliously\" is a rare and sophisticated term. It describes someone acting in a cheerful and good-humored way, especially when they might be expected to be grumpy or irritable. Because of its rarity and connection to the more common word \"bilious\" (meaning bad-tempered or relating to liver problems), it is best used in formal writing or speech where a precise and nuanced description is desired."},"example_sentences":[{"sentence":"Despite the setbacks, she approached the project unbiliously, inspiring her team with her optimism.","translation":"挫折にもかかわらず、彼女は快活にプロジェクトに取り組み、その楽観主義でチームを鼓舞した。","type":"adverb","meaning_category":"cheerfully"},{"sentence":"He responded to the criticism unbiliously, surprising everyone with his calm and collected demeanor.","translation":"彼は批判に対して快活に応じ、その冷静沈着な態度で皆を驚かせた。","type":"adverb","meaning_category":"good-humoredly"}]}