{"word":"Aparavidya","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アパラヴィディヤー：ヒンドゥー哲学において、物質世界と経験的な知識に関連する下位の知識。リグ・ヴェーダ、ヤジュル・ヴェーダ、サーマ・ヴェーダ、アタルヴァ・ヴェーダなどのヴェーダの知識、およびその補助分野（フォネティクス、文法、韻律、天文学など）を含む。","english_definition":"Aparavidya: In Hindu philosophy, lower knowledge pertaining to the material world and empirical knowledge; includes knowledge of the Vedas (Rigveda, Yajurveda, Samaveda, Atharvaveda) and its ancillary fields (phonetics, grammar, metrics, astronomy, etc.).","examples":[{"sentence":"アパラヴィディヤーは、現象世界の理解に不可欠である。","translation":"Aparavidya is essential for understanding the phenomenal world."},{"sentence":"アパラヴィディヤーを習得することは、パラヴィディヤーへの準備段階である。","translation":"Mastering Aparavidya is a preparatory stage for Paravidya."}],"collocations":["学ぶアパラヴィディヤー (manabu aparavidya) - to learn Aparavidya","習得するアパラヴィディヤー (shuutoku suru aparavidya) - to master Aparavidya"],"synonyms":["下位知識 (kai chishiki)","経験的知識 (keiken teki chishiki)"],"antonyms":["パラヴィディヤー (Paravidya)","上位知識 (joui chishiki)"]}],"etymology":{"value":"サンスクリット語の「apara」（下位の、低い）と「vidya」（知識）の組み合わせに由来する。","priority":"★★★"},"pronunciation":{"ipa":"/apaɾaʋidjaː/","syllables":"a-pa-ra-vi-di-yaa"},"inflection":{"notes":"名詞なので、複数形や活用形はありません。"},"usage_notes":{"explanation":"アパラヴィディヤーは、ヒンドゥー哲学における知識の二分法の一部であり、パラヴィディヤー（上位知識、精神的な知識）と対比されます。アパラヴィディヤーは、物質世界、科学、芸術、言語など、経験的に検証可能な知識の領域を指します。これは、パラヴィディヤー（自己認識、精神的な悟り）への準備段階と見なされます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ アパラヴィディヤーは究極の真実である。","correct":"✓ アパラヴィディヤーは現象世界の理解に役立つ知識である。","note":"アパラヴィディヤーは究極の真実ではなく、現象世界の理解に役立つ知識です。"},{"incorrect":"✗ アパラヴィディヤーは精神的な悟りのための知識である。","correct":"✓ アパラヴィディヤーはパラヴィディヤー（精神的な悟りのための知識）への準備段階である。","note":"アパラヴィディヤーはパラヴィディヤーへの準備段階です。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_concepts":["パラヴィディヤー (Paravidya)","ヴェーダ (Veda)","ウパニシャッド (Upanishad)","ヒンドゥー哲学 (Hindu philosophy)","知識の二分法 (knowledge dichotomy)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「アパラヴィディヤー」は、ヒンドゥー哲学の専門用語であり、日常会話ではほとんど使用されません。この言葉は、経験的な知識や物質世界に関する知識を指し、精神的な知識である「パラヴィディヤー」と対比されます。この概念を理解するには、ヒンドゥー哲学の基本的な知識構造を把握している必要があります。"},"example_sentences":[{"sentence":"アパラヴィディヤーは、ヴェーダの知識体系を通じて伝えられる。","translation":"Aparavidya is conveyed through the knowledge system of the Vedas.","type":"general","meaning_category":"知識"},{"sentence":"アパラヴィディヤーとパラヴィディヤーの区別は、古代インドの知識観を反映している。","translation":"The distinction between Aparavidya and Paravidya reflects the ancient Indian view of knowledge.","type":"philosophical","meaning_category":"哲学"}]}