{"word":"half-timber","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"木骨構造","english_definition":"A type of construction in which walls are made of timber framing with the spaces between the timbers filled with wattle and daub, brick, or other materials.","examples":[{"sentence":"The old house was built using half-timber construction.","translation":"その古い家は木骨構造で建てられました。"},{"sentence":"Many half-timber buildings can be found in the historic district.","translation":"歴史地区には多くの木骨構造の建物が見られます。"}],"collocations":["half-timber house","half-timber construction","half-timber building"],"synonyms":["timber framing","fachwerk (German)"],"antonyms":[]}],"etymology":{"value":"The term 'half-timber' refers to the fact that only half of the timber (the framing) is visible, with the other half being concealed by the infill material.","priority":"★★★"},"pronunciation":{"ipa":"/ˌhæfˈtɪmbər/","syllables":"half-tim-ber"},"inflection":{"noun_plural":"half-timbers"},"usage_notes":{"explanation":"'Half-timber' is primarily used to describe a specific construction style, particularly common in medieval and early modern buildings in Europe. The term emphasizes the visible wooden frame filled with other materials.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The house is made of half timber.","correct":"✓ The house is half-timbered. / ✓ The house is a half-timber house.","note":"'Half-timber' is a noun. To use it as an adjective, use 'half-timbered' or 'half-timber house'."}],"priority":"★★☆"},"related_words":{"derivatives":["half-timbered (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Half-timber' refers to a specific architectural style where buildings have exposed wooden frames with spaces filled by other materials. It is most often used in historical contexts when describing buildings in Europe, particularly from the medieval and early modern periods. It's a relatively specialized term, so understanding requires some familiarity with architectural vocabulary."},"example_sentences":[{"sentence":"The village is famous for its well-preserved half-timber houses.","translation":"その村は、保存状態の良い木骨構造の家々で有名です。","type":"noun","meaning_category":"木骨構造"},{"sentence":"The half-timbered construction is a characteristic feature of the region.","translation":"木骨構造はその地域の特徴的な特徴です。","type":"adjective (half-timbered)","meaning_category":"木骨構造の"}]}