{"word":"coarticulation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"調音結合、連接","english_definition":"the articulation of two or more speech sounds together, so that one influences the other.","examples":[{"sentence":"Coarticulation is a common phenomenon in speech.","translation":"調音結合は音声における一般的な現象です。"},{"sentence":"The pronunciation of a word can change due to coarticulation.","translation":"単語の発音は調音結合によって変化することがあります。"},{"sentence":"Understanding coarticulation is important for speech recognition.","translation":"調音結合を理解することは音声認識において重要です。"}],"collocations":["anticipatory coarticulation","carryover coarticulation","coarticulation effect","degree of coarticulation"],"synonyms":["speech blending","phonetic assimilation"],"antonyms":[]}],"etymology":{"value":"'Co-' (together) + 'articulation' (the act of producing speech sounds). The term describes how speech sounds are produced in a connected way, influencing each other.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkoʊɑːrˌtɪkjʊˈleɪʃən/","syllables":"co-ar-tic-u-la-tion"},"inflection":{"noun_plural":"coarticulations"},"usage_notes":{"explanation":"Coarticulation refers to the overlapping of articulatory gestures in speech production. It happens because speakers don't produce each sound in isolation but rather blend them together. There are two main types: anticipatory (or right-to-left) coarticulation, where a sound is influenced by a following sound, and carryover (or left-to-right) coarticulation, where a sound is influenced by a preceding sound.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Coarticulation is when you speak clearly.","correct":"✓ Coarticulation is when speech sounds influence each other.","note":"Coarticulation is about the blending of sounds, not speaking clearly in a general sense."},{"incorrect":"✗ Coarticulation only happens in fast speech.","correct":"✓ Coarticulation happens in both fast and slow speech, but is more noticeable in fast speech.","note":"While more apparent in fast speech, coarticulation occurs in all speech rates."}],"priority":"★★☆"},"related_words":{"derivatives":["coarticulate (verb, adjective)"],"related_terms":["phonetics","phonology","articulation","assimilation","speech production"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency (specialized term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Coarticulation' is a technical term used in phonetics and linguistics to describe how the production of one speech sound overlaps with the production of another. This means that when we speak, we don't produce each sound in isolation; instead, our articulators (tongue, lips, etc.) are already moving into position for the next sound while we are still producing the current one. This blending of sounds is what coarticulation refers to. Understanding this concept is important for fields like speech recognition and speech therapy."},"example_sentences":[{"sentence":"The word 'soon' demonstrates coarticulation because the lips begin to round for the 'oo' sound during the 's' sound.","translation":"「soon」という単語は、「s」の音を発音している間に唇が「oo」の音のために丸め始められるため、調音結合を示しています。","type":"example","meaning_category":"speech production"},{"sentence":"Anticipatory coarticulation can be seen when the tongue anticipates the vowel sound in the word 'key'.","translation":"先行的調音結合は、「key」という単語で舌が母音の音を予測するときに見られます。","type":"example","meaning_category":"anticipation"},{"sentence":"Carryover coarticulation occurs when the nasal quality of 'm' affects the preceding vowel in 'ham'.","translation":"持ち越し調音結合は、「ham」という単語で「m」の鼻音性が先行する母音に影響を与えるときに発生します。","type":"example","meaning_category":"carryover effect"}]}