{"word":"fellen","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(古語または方言) fellの過去分詞形 (主に木を切り倒す意味で使われる)","english_definition":"(Archaic or dialectal) past participle of 'fell', primarily used in the context of cutting down trees.","examples":[{"sentence":"The ancient forest was filled with trees that had been fellen by generations of lumberjacks.","translation":"古代の森は、何世代にもわたる木こりによって切り倒された木々で満たされていた。"},{"sentence":"Many oaks had been fellen to make way for the new road.","translation":"新しい道路を作るために、多くの樫の木が切り倒された。"}],"collocations":["had been fellen (切り倒されていた)","trees fellen (切り倒された木々)"],"synonyms":["cut down","hewn","chopped down"],"antonyms":["standing","growing"]}],"etymology":{"value":"'Fellen' is an archaic or dialectal past participle of the verb 'fell'. 'Fell' itself comes from Old English 'fellan', meaning 'to cause to fall, strike down, cut down'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɛlən/","syllables":"fel-len"},"inflection":{"verb_forms":{"present_simple":["fell"],"past_simple":"fell","past_participle":["fallen","fellen (archaic)"],"present_participle":"felling"}},"usage_notes":{"explanation":"'Fellen' is rarely used in modern English. The standard past participle of 'fell' (to cut down) is 'fallen'. 'Fellen' survives mainly in dialects or in deliberately archaic writing, particularly when referring to the felling of trees. Be aware that 'fallen' is also the past participle of 'fall' (to descend), so context is crucial.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has fellen in love.","correct":"✓ He has fallen in love.","note":"When referring to the act of falling (descending), the correct past participle is 'fallen', not 'fellen'."},{"incorrect":"✗ The tree was fallen by the storm.","correct":"✓ The tree was felled by the storm. / ✓ The tree had fallen during the storm.","note":"'Fell' (to cut down) and 'fall' (to descend) are different verbs. If the tree was cut down, use 'felled'. If it collapsed on its own, use 'fallen'."}],"priority":"★★☆"},"related_words":{"derivatives":["fell (verb - to cut down)","felling (noun - the act of cutting down trees)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare in modern usage)","frequency_google_ngram":"Extremely low frequency in modern usage.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Fellen' is an archaic form of the past participle of the verb 'fell' (to cut down), primarily used in reference to trees. It is rarely encountered in contemporary English and is more likely to appear in older literature or specific dialects. Modern English typically uses 'fallen' as the past participle of 'fell' in this context, although 'fallen' is also the past participle of the verb 'fall' (to descend), requiring careful attention to context. Due to its rarity, understanding 'fellen' is more relevant for comprehending older texts rather than for active use.","note":"This word is very rare in modern English."},"example_sentences":[{"sentence":"The woodsman spoke of the many trees that had been fellen in that part of the forest.","translation":"その木こりは、森のその地域で切り倒された多くの木々について語った。","type":"verb (past participle)","meaning_category":"切り倒された"},{"sentence":"In days of old, great oaks were fellen to build ships.","translation":"昔は、船を建造するために巨大な樫の木が切り倒された。","type":"verb (past participle)","meaning_category":"切り倒された"},{"sentence":"The path was blocked by a tree that had been fellen across it.","translation":"道は、その上に切り倒された木によって塞がれていた。","type":"verb (past participle)","meaning_category":"切り倒された"}]}