{"word":"standard-gage","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"標準軌の","english_definition":"Relating to or being the standard gauge for railroads, which is 4 feet 8.5 inches (1.435 meters) between the rails.","examples":[{"sentence":"The standard-gage railway allowed for efficient transport of goods.","translation":"標準軌の鉄道は、効率的な物資輸送を可能にした。"},{"sentence":"Most of the country's railway network is standard-gage.","translation":"その国の鉄道網のほとんどは標準軌である。"}],"collocations":["standard-gage railway","standard-gage track","standard-gage locomotive"],"synonyms":["standard gauge"],"antonyms":["narrow-gage","broad-gage"]}],"etymology":{"value":"Combination of 'standard' and 'gage' (alternative spelling of 'gauge'). 'Standard' refers to the established norm or requirement, and 'gauge' refers to the distance between the rails.","priority":"★★★"},"pronunciation":{"ipa":"/ˈstændərd ˌɡeɪdʒ/","syllables":"stan-dard-gage"},"inflection":{"notes":"Since it is an adjective, it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Standard-gage' is primarily used in the context of railways to specify that the track width conforms to the standard measurement of 4 feet 8.5 inches (1.435 meters). It distinguishes railways from those using narrow-gage or broad-gage tracks.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The train runs on a standard-gage track, so it's very wide.","correct":"✓ The train runs on a standard-gage track.","note":"Standard-gage is the most common gauge, so it is not particularly wide compared to other types of gauges."}],"priority":"★★☆"},"related_words":{"derivatives":["standard gauge (noun)"],"phrasal_verbs":[],"related_terms":["narrow-gage","broad-gage","railway","track","gauge"],"priority":"★★★"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Standard-gage' is a technical term primarily used in the context of railway engineering and history. It refers to the standard width of railway tracks, which is 4 feet 8.5 inches (1.435 meters). Understanding this term requires some familiarity with railway systems and their specifications."},"example_sentences":[{"sentence":"The new high-speed line will be built using standard-gage tracks.","translation":"新しい高速路線は標準軌の線路を使用して建設される予定です。","type":"general","meaning_category":"standard gauge"},{"sentence":"Converting the railway to standard-gage would improve interoperability with neighboring countries.","translation":"鉄道を標準軌に変換することで、近隣諸国との相互運用性が向上するでしょう。","type":"technical","meaning_category":"standard gauge"}]}