{"word":"Japanism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"日本趣味、日本風、日本的特質","english_definition":"The influence of Japanese art, culture, and design on Western art and culture, especially during the late 19th century. Also, a word, expression, custom, or other feature characteristic of Japan or the Japanese language.","examples":[{"sentence":"Japanism was a major influence on Impressionist painters.","translation":"日本趣味は印象派の画家に大きな影響を与えた。"},{"sentence":"The exhibition explored the impact of Japanism on Western fashion.","translation":"その展覧会は日本趣味が西洋のファッションに与えた影響を探求した。"},{"sentence":"That phrase is a Japanism; it doesn't translate well into English.","translation":"そのフレーズは日本的な表現で、英語にうまく翻訳できない。"}],"collocations":["influence of Japanism","impact of Japanism","study of Japanism","elements of Japanism"],"synonyms":["Japonisme (French)","Japanese influence","Japanese style","Japanese characteristic"],"antonyms":[]}],"etymology":{"value":"Formed from \"Japan\" + \"-ism\". The term arose in the late 19th century to describe the Western fascination with Japanese art and culture.","priority":"★★★"},"pronunciation":{"ipa":"/dʒəˈpænɪzəm/","syllables":"Ja-pan-ism"},"inflection":{"noun_plural":"Japanisms"},"usage_notes":{"explanation":"\"Japanism\" refers to the incorporation of Japanese aesthetics, techniques, or cultural elements into Western art, design, and culture. It can also refer to a specific word, phrase, or custom that is unique to Japan. The term is most often associated with the late 19th century, when Japanese art, particularly ukiyo-e prints, had a significant impact on Western artists.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Japanism.","correct":"✓ He is interested in Japanism.","note":"\"Japanism\" refers to a cultural influence or a specific Japanese trait, not a person. To describe a person interested in Japanese culture, use \"He is interested in Japanism\" or \"He is a Japanophile.\""},{"incorrect":"✗ Japanism is only about anime.","correct":"✓ Japanism includes various aspects of Japanese culture, including art, design, and customs.","note":"While anime can be a part of modern Japanese cultural influence, \"Japanism\" encompasses a broader range of artistic and cultural elements, particularly those that influenced Western art in the late 19th century."}],"priority":"★★☆"},"related_words":{"derivatives":["Japonisme (French term for Japanism)","Japanesque (in the style of Japan)","Japanophile (a person who loves or admires Japan and Japanese things)"],"phrases":["ukiyo-e (Japanese woodblock prints)","art nouveau (art movement influenced by Japanism)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1-C2","frequency_google_ngram":"Relatively low frequency, mainly used in academic or art-related contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Japanism\" is a term used to describe the influence of Japanese art and culture on Western art, especially during the late 19th century. It also refers to a characteristic feature of Japan or the Japanese language. The word is more commonly used in academic or art history contexts when discussing the impact of Japanese aesthetics on Western artists and designers. Understanding the historical context of this term is important for interpreting its meaning accurately."},"example_sentences":[{"sentence":"Many Impressionist artists were deeply influenced by Japanism.","translation":"多くの印象派の画家は日本趣味に深く影響を受けた。","type":"general","meaning_category":"Influence on art"},{"sentence":"The use of asymmetry in modern design often reflects Japanism.","translation":"現代デザインにおける非対称性の使用は、しばしば日本趣味を反映している。","type":"design","meaning_category":"Influence on design"},{"sentence":"The exhibition showcased various examples of Japanism in Western paintings.","translation":"その展覧会では、西洋絵画における日本趣味の様々な例が展示された。","type":"art exhibition","meaning_category":"Art exhibition"},{"sentence":"The word 'karoshi' is a Japanism that has entered the English lexicon.","translation":"「過労死」という言葉は、英語の語彙に入った日本的な表現である。","type":"linguistics","meaning_category":"Linguistics"}]}