{"word":"metagenetic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(地質学)変成作用に関連する、または変成作用によって生じた","english_definition":"Relating to or produced by metamorphism (in geology).","examples":[{"sentence":"The metagenetic rocks showed signs of intense pressure and heat.","translation":"その変成岩は強い圧力と熱の兆候を示していた。"},{"sentence":"Metagenetic processes can alter the composition and structure of rocks.","translation":"変成作用は岩石の組成と構造を変化させる可能性がある。"}],"collocations":["metagenetic rock","metagenetic process","metagenetic environment"],"synonyms":["metamorphic","altered"],"antonyms":["unaltered","igneous","sedimentary"]}],"etymology":{"value":"The word \"metagenetic\" is formed from the prefix \"meta-\" (meaning change or transformation) combined with \"genetic\" (relating to origin or formation). In geology, it specifically refers to the transformation of rocks through metamorphism.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɛtədʒəˈnɛtɪk/","syllables":"me-ta-ge-net-ic"},"inflection":{"notes":"Since it's an adjective, it can be used in comparative and superlative forms, though rarely: more metagenetic, most metagenetic."},"usage_notes":{"explanation":"The term 'metagenetic' is primarily used in geology to describe rocks, processes, or environments that have undergone metamorphism. Metamorphism involves the alteration of rocks through heat, pressure, or chemical activity, resulting in changes to their mineral composition and texture.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The metagenetic algorithm was used to optimize the process.","correct":"✓ A genetic algorithm was used to optimize the process.","note":"'Metagenetic' is specific to geology. For algorithms, use 'genetic algorithm'."}],"priority":"★★☆"},"related_words":{"derivatives":["metagenesis (noun): alternation of generations","metamorphism (noun): the process of change in rocks"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Metagenetic' is a technical term used in geology. It describes something that has been changed by metamorphism, which is the alteration of rocks by heat, pressure, or chemical activity. This term is not commonly used outside of geology. Understanding requires knowledge of geological processes.","priority":"★★☆"},"example_sentences":[{"sentence":"The study focused on the metagenetic effects on shale formations.","translation":"その研究は、頁岩層に対する変成作用の影響に焦点を当てた。","type":"general","meaning_category":"Geology"},{"sentence":"Analysis of the metagenetic minerals revealed the history of the rock's transformation.","translation":"変成鉱物の分析により、岩石の変成の歴史が明らかになった。","type":"technical","meaning_category":"Geology"}]}