{"word":"asteism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"上品な皮肉、洗練されたユーモア、または一見無邪気に見えるが実際には人を傷つける意図のある婉曲な嘲笑","english_definition":"A polite and ingenious manner of irony; refined and well-bred banter; a delicate and good-humored kind of mockery, which under the appearance of simplicity conveys a concealed sarcasm.","examples":[{"sentence":"His speech was full of asteism, making it difficult to discern his true feelings.","translation":"彼の演説はアステイズムに満ちており、彼の真の感情を理解するのは困難だった。"},{"sentence":"The comedian's asteism was appreciated by the sophisticated audience.","translation":"そのコメディアンのアステイズムは、洗練された観客に高く評価された。"},{"sentence":"Asteism is a subtle form of humor that requires intelligence to both deliver and understand.","translation":"アステイズムは、伝えるにも理解するにも知性を必要とする、繊細なユーモアの形である。"}],"collocations":["display asteism","employ asteism","subtle asteism","witty asteism"],"synonyms":["banter","irony","sarcasm","wit","mockery","raillery"],"antonyms":["sincerity","earnestness","solemnity"]}],"etymology":{"value":"Derived from the Greek word 'asteismos' (ἀστεϊσμός), meaning 'urbanity, polite wit'. It is related to 'asteios' (ἀστεῖος), meaning 'townsman, polite, witty, refined'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈæstiˌɪzəm/","syllables":"as-te-ism"},"inflection":{"noun_plural":"asteisms"},"usage_notes":{"explanation":"Asteism is a relatively rare and sophisticated form of humor. It involves a subtle and often indirect way of making a point, often through irony or gentle mockery. It is considered a refined form of wit, appreciated by those who understand its nuances. It is not intended to be overtly offensive, but rather to amuse and engage the listener or reader on an intellectual level.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used asteism to insult people directly.","correct":"✓ He used asteism to subtly mock people.","note":"Asteism is not direct insult, but subtle mockery."},{"incorrect":"✗ Asteism is the same as sarcasm.","correct":"✓ Asteism is a refined form of irony, distinct from harsh sarcasm.","note":"Asteism is more refined and polite than typical sarcasm."}],"priority":"★☆☆"},"related_words":{"derivatives":["asteious (Greek adjective: urbane, witty)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Asteism' is a rare and sophisticated term referring to a refined, subtle, and polite form of irony or wit. It involves a delicate and often indirect way of making a point, often through gentle mockery or banter. Understanding 'asteism' requires a high level of linguistic and cultural awareness, as it is not a common or easily recognizable concept. It is primarily used in academic or literary contexts when discussing rhetoric or humor.","priority":"★☆☆"},"example_sentences":[{"sentence":"The professor's lecture was filled with subtle asteism, which kept the students engaged.","translation":"教授の講義は微妙なアステイズムに満ちており、学生たちの関心を引き続けた。","type":"general","meaning_category":"上品な皮肉"},{"sentence":"Her asteism was so refined that many didn't realize she was teasing them.","translation":"彼女のアステイズムは非常に洗練されていたため、多くの人は彼女がからかっていることに気づかなかった。","type":"general","meaning_category":"上品な皮肉"},{"sentence":"The play employed asteism to critique societal norms in a humorous way.","translation":"その劇は、ユーモラスな方法で社会規範を批判するためにアステイズムを用いた。","type":"general","meaning_category":"上品な皮肉"}]}