{"word":"leukotomy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ロボトミー、白質切截術","english_definition":"a surgical operation in which some of the nerve fibers in the brain are cut, formerly used to treat mental illness.","examples":[{"sentence":"Leukotomy was a controversial treatment for mental disorders.","translation":"ロボトミーは精神疾患に対する物議を醸す治療法だった。"},{"sentence":"The use of leukotomy has largely been replaced by drug therapy.","translation":"ロボトミーの使用は、主に薬物療法に取って代わられている。"}],"collocations":["prefrontal leukotomy","transorbital leukotomy"],"synonyms":["lobotomy","prefrontal lobotomy","psychosurgery"],"antonyms":[]}],"etymology":{"value":"From Greek 'leuko-' (white) + 'tome' (cutting). Refers to the cutting of white matter in the brain.","priority":"★★☆"},"pronunciation":{"ipa":"/ljuːˈkɒtəmi/","syllables":"lu-kot-o-my"},"inflection":{"noun_plural":"leukotomies"},"usage_notes":{"explanation":"Leukotomy is a largely outdated surgical procedure. It is important to use this term with sensitivity due to its historical context and the ethical concerns surrounding its use.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a leukotomy for his headache.","correct":"✓ He had a leukotomy for his severe mental illness.","note":"Leukotomy was primarily used for severe mental illnesses, not common conditions like headaches."}],"priority":"★☆☆"},"related_words":{"derivatives":["leukotome (surgical instrument used in a leukotomy)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Leukotomy' is a highly specialized term referring to a specific and now largely obsolete surgical procedure. Understanding requires knowledge of medical history and terminology. It is rarely encountered outside of medical or historical contexts."},"example_sentences":[{"sentence":"The patient underwent a leukotomy in an attempt to alleviate his severe schizophrenia.","translation":"患者は重度の統合失調症を緩和するためにロボトミー手術を受けた。","type":"noun","meaning_category":"surgical procedure"},{"sentence":"The ethical implications of leukotomy are still debated today.","translation":"ロボトミーの倫理的影響については、今日でも議論されている。","type":"noun","meaning_category":"ethical implications"}]}