{"word":"autumnity","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"秋らしさ、秋の趣、秋の雰囲気","english_definition":"The quality or state of being autumnal; the characteristics or atmosphere associated with autumn.","examples":[{"sentence":"The painting captured the very autumnity of the forest, with its golden leaves and misty air.","translation":"その絵は、黄金色の葉と霧がかった空気で、まさに森の秋らしさを捉えていた。"},{"sentence":"There's a certain autumnity in the air today, a crispness and a hint of woodsmoke.","translation":"今日は空気に秋らしさがあり、清々しさと焚き火の香りが漂っている。"}],"collocations":["capture the autumnity","feel the autumnity","sense of autumnity"],"synonyms":["autumnal atmosphere","fall feeling","autumnal charm","autumnal spirit"],"antonyms":["springlike quality","summery atmosphere","wintery feel"]}],"etymology":{"value":"Formed from \"autumn\" + \"-ity\" (a suffix used to form nouns expressing a state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ɔːˈtʌmnɪti/","syllables":"au-tum-ni-ty"},"inflection":{"noun_plural":"autumnities"},"usage_notes":{"explanation":"\"Autumnity\" is a relatively uncommon word used to describe the essence or qualities associated with autumn. It is often used in a descriptive or poetic context to evoke the feeling of the season.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The autumnity was very hot this year.","correct":"✓ The autumn was very hot this year.","note":"\"Autumnity\" refers to the quality of being autumnal, not the season itself. Use \"autumn\" to refer to the season. "},{"incorrect":"✗ I prefer summerity to autumnity.","correct":"✓ I prefer summer to autumn.","note":"\"Autumnity\" and \"summerity\" are not commonly used in contrast. Use \"summer\" and \"autumn\" instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["autumnal (adjective: of, like, or occurring in autumn)","autumn (noun: the season after summer and before winter)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (rare and literary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Autumnity\" is a rather rare word that describes the feeling or qualities of autumn. It's used when you want to talk about the essence of autumn, like the colors, smells, and general atmosphere of the season. You won't hear it very often in everyday conversation, but you might find it in descriptive writing or poetry. It's a more abstract way of referring to the feeling of autumn.","priority":"★★☆"},"example_sentences":[{"sentence":"The artist tried to convey the deep autumnity of the landscape in his painting.","translation":"その画家は、絵の中で風景の深い秋らしさを伝えようとした。","type":"noun","meaning_category":"秋の趣"},{"sentence":"The old house had a certain autumnity about it, with its ivy-covered walls and crackling fireplace.","translation":"その古い家は、ツタで覆われた壁とパチパチと音を立てる暖炉があり、どこか秋の趣があった。","type":"noun","meaning_category":"秋の雰囲気"}]}