{"word":"diplexer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ダイプレクサ（異なる周波数帯の信号を合成または分離する電子回路）","english_definition":"A passive electronic component that implements frequency-domain multiplexing. One port is connected to a common circuit, and the other two ports are connected to circuits that operate at different frequencies.","examples":[{"sentence":"The diplexer allows the antenna to be used for both transmitting and receiving signals.","translation":"ダイプレクサにより、アンテナは信号の送信と受信の両方に使用できます。"},{"sentence":"A diplexer is used to combine the signals from two different transmitters into a single antenna.","translation":"ダイプレクサは、2つの異なる送信機からの信号を1つのアンテナに結合するために使用されます。"}],"collocations":["antenna diplexer","RF diplexer","duplexer (similar function, but typically for transmit and receive)"],"synonyms":["frequency multiplexer","filter combiner"],"antonyms":["splitter (divides a signal)"]}],"etymology":{"value":"Derived from 'di-' (two) + 'plex' (braid or interweave) + '-er' (suffix indicating an agent or device). The term reflects the device's function of handling two different frequency bands.","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˈplɛksər/","syllables":"di-plex-er"},"inflection":{"noun_plural":"diplexers"},"usage_notes":{"explanation":"A diplexer is a specific type of frequency-selective device used to combine or separate signals based on their frequency. It is commonly used in radio communication systems, satellite communication, and other applications where multiple frequency bands need to be handled by a single antenna or transmission line. A diplexer allows multiple transmitters or receivers to operate simultaneously on the same antenna without interfering with each other. It is a passive device, meaning it does not require external power to operate.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Use a duplexer instead of a diplexer for combining different frequency bands.","correct":"✓ Use a diplexer for combining different frequency bands.","note":"A duplexer is typically used for separating transmit and receive signals at the same frequency, while a diplexer is used for combining or separating different frequency bands."}],"priority":"★★☆"},"related_words":{"derivatives":["diplexing (the process of using a diplexer)"],"phrasal_verbs":[],"related_concepts":["multiplexer","demultiplexer","filter","frequency-division multiplexing (FDM)","antenna","transceiver"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A **diplexer** is a device used in electronics to either combine or separate signals that operate at different frequencies. Imagine you have two different radio stations that want to broadcast their signals using the same antenna. A diplexer allows both stations to transmit their signals without interfering with each other. It does this by using filters that only allow specific frequencies to pass through. So, one radio station's signal goes through one filter, and the other station's signal goes through a different filter, and then they are combined to be sent through the antenna. The opposite happens when receiving signals: the diplexer separates the incoming signal into the different frequency bands. This is useful in many communication systems, like satellite communication and wireless networks, where it's necessary to handle multiple frequencies at the same time.","priority":"★☆☆"},"example_sentences":[{"sentence":"The **diplexer** allows the transmitter and receiver to share a single antenna.","translation":"ダイプレクサにより、送信機と受信機は単一のアンテナを共有できます。","type":"noun","meaning_category":"electronics component"},{"sentence":"We used a **diplexer** to combine the signals from two different wireless networks.","translation":"2つの異なるワイヤレスネットワークからの信号を結合するために、ダイプレクサを使用しました。","type":"noun","meaning_category":"electronics component"},{"sentence":"The satellite dish uses a **diplexer** to separate the incoming and outgoing signals.","translation":"衛星放送受信アンテナは、ダイプレクサを使用して、入ってくる信号と出ていく信号を分離します。","type":"noun","meaning_category":"electronics component"}]}