{"word":"henotic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(historical, theology) tending to unite or reconcile differing or opposing parties; designed to promote union.","english_definition":"Designed to promote union or reconciliation, especially in religious matters; tending to unite or reconcile differing or opposing parties.","examples":[{"sentence":"The emperor issued a henotic decree in an attempt to unify the various Christian factions.","translation":"皇帝は、様々なキリスト教派閥を統一しようと、ヘノティコン（統一令）を発布した。"}],"collocations":["henotic decree","henotic formula","henotic policy"],"synonyms":["unifying","reconciliatory","conciliatory","harmonizing","integrative"],"antonyms":["divisive","separatist","factional"]}],"etymology":{"value":"From the Greek word 'ἑνωτικός' (henōtikos), meaning 'tending to unite,' derived from 'ἑνόω' (henoō), 'to unite,' and ultimately from 'ἕν' (hen), 'one.'","priority":"★★☆"},"pronunciation":{"ipa":"/hɪˈnɒtɪk/","syllables":"he-not-ic"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more henotic' and 'most henotic,' respectively, though rarely used."},"usage_notes":{"explanation":"The term 'henotic' is primarily used in historical and theological contexts, specifically when discussing attempts to reconcile differing factions within a religious or political body. It often refers to decrees or policies aimed at achieving unity, even if through compromise or ambiguous language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The henotic energy of the team led to victory.","correct":"✓ The unifying spirit of the team led to victory.","note":"'Henotic' is specifically related to attempts at religious or political reconciliation, not general teamwork or unity."}],"priority":"★☆☆"},"related_words":{"derivatives":["henosis (noun): mystical union with God or the ultimate principle"],"related_terms":["ecumenism","reconciliation","unification","syncretism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency; primarily found in academic texts on history and theology.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Henotic' is a highly specialized term primarily encountered in historical and theological discussions. It describes something designed to promote unity, especially in religious contexts, often through compromise or the blurring of doctrinal differences. Its usage requires a strong understanding of historical and religious terminology. Due to its limited application, it is not a word commonly used in everyday language."},"example_sentences":[{"sentence":"The Byzantine emperor hoped his henotic edict would quell the religious disputes in Egypt.","translation":"ビザンツ皇帝は、彼のヘノティコン（統一令）がエジプトの宗教的紛争を鎮めることを願った。","type":"adjective","meaning_category":"unifying"},{"sentence":"The document was criticized for its henotic language, which obscured key theological differences.","translation":"その文書は、主要な神学的差異を曖昧にするヘノティコン的な言葉遣いであると批判された。","type":"adjective","meaning_category":"reconciliatory"}]}