{"word":"tepefied","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Made into a tepefaction; reduced to ashes.","english_definition":"Converted into ashes; reduced to a state of ashes.","examples":[{"sentence":"The ancient scrolls were tepefied by the fire.","translation":"古代の巻物は火によって灰になった。"},{"sentence":"After the volcanic eruption, the landscape was tepefied.","translation":"火山噴火の後、景観は灰になった。"}],"collocations":[],"synonyms":["ashed","incinerated","cremated","reduced to ashes"],"antonyms":[],"notes":"This word is relatively rare and primarily used in scientific or historical contexts when describing the process of something being turned to ashes."}],"etymology":{"value":"Derived from 'tepefaction', which comes from Latin 'tepescere', meaning 'to become warm'. The connection to ashes comes from the idea of something being burned and reduced to a warm, ashen state.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɛpɪfaɪd/","syllables":"te-pe-fied"},"inflection":{"adjective_forms":{"comparative":null,"superlative":null}},"usage_notes":{"explanation":"'Tepefied' is a rather uncommon word. It is most likely to be encountered in texts that discuss historical events involving intense heat or destruction, such as volcanic eruptions or large fires.","priority":"★☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["tepefaction (noun): The act or process of reducing to ashes."],"priority":"★☆☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Tepefied' is a highly specialized and rare word. It is unlikely to be encountered outside of technical or historical contexts. Understanding its meaning requires knowledge of Latin roots and a sophisticated vocabulary.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The remains of the building were completely tepefied after the intense blaze.","translation":"激しい炎の後、建物の残骸は完全に灰になった。","type":"adjective","meaning_category":"Reduced to ashes"},{"sentence":"The intense heat tepefied the organic matter in the soil.","translation":"強烈な熱が土壌中の有機物を灰にした。","type":"adjective","meaning_category":"Reduced to ashes"}]}