{"word":"ambiversive","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"内向性と外交性の両方の特徴を併せ持つ、状況に応じて内向的にも外交的にもなれる","english_definition":"Having characteristics of both introversion and extroversion; able to be both introverted and extroverted depending on the situation.","examples":[{"sentence":"As an ambiversive person, she enjoys both quiet evenings alone and lively social gatherings.","translation":"両向的な性格として、彼女は静かな夜を一人で楽しむことも、賑やかな社交的な集まりも楽しむ。"},{"sentence":"Ambiversive individuals can adapt to different social situations more easily than those who are strictly introverted or extroverted.","translation":"両向的な人は、厳密に内向的または外交的な人よりも、さまざまな社会的な状況に容易に適応できる。"},{"sentence":"Understanding that I am ambiversive helps me manage my energy levels and social interactions more effectively.","translation":"自分が両向的だと理解することで、エネルギーレベルと社会的な相互作用をより効果的に管理できる。"}],"collocations":["ambiversive personality (両向的な性格)","ambiversive tendencies (両向的な傾向)","being ambiversive (両向的であること)","an ambiversive approach (両向的なアプローチ)"],"synonyms":["balanced","adaptable","versatile","middle-of-the-road"],"antonyms":["introverted","extroverted"]},{"part_of_speech":"noun","definition":"内向性と外交性の両方の特徴を併せ持つ人、状況に応じて内向的にも外交的にもなれる人","english_definition":"A person who has characteristics of both introversion and extroversion; someone who is able to be both introverted and extroverted depending on the situation.","examples":[{"sentence":"Ambiversives often make good leaders because they can understand and relate to both introverted and extroverted team members.","translation":"両向的な人は、内向的なチームメンバーと外交的なチームメンバーの両方を理解し、共感できるため、優れたリーダーになることが多い。"},{"sentence":"As an ambiversive, he found himself comfortable in both large conferences and small, intimate meetings.","translation":"両向的な人として、彼は大規模な会議と小規模で親密な会議の両方で快適に過ごせた。"},{"sentence":"Many people identify as ambiversives, finding that they don't fit neatly into either the introverted or extroverted category.","translation":"多くの人が自分を両向的な人だと認識しており、内向的または外交的なカテゴリーのいずれにもきちんと当てはまらないと感じている。"}],"collocations":["an ambiversive individual (両向的な個人)","identify as an ambiversive (両向的な人だと認識する)","being an ambiversive (両向的な人であること)"],"synonyms":["balanced individual","adaptable person","versatile person"],"antonyms":["introvert","extrovert"]}],"etymology":{"value":"The word \"ambiversive\" is derived from the combination of \"ambi-\" (meaning both) and \"versive\" (relating to turning or tending). It was coined to describe individuals who exhibit characteristics of both introversion and extroversion.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæmbɪˈvɜːrsɪv/","syllables":"am-bi-ver-sive"},"inflection":{"adjective_forms":{"comparative":"more ambiversive","superlative":"most ambiversive"},"noun_plural":"ambiversives"},"usage_notes":{"explanation":"\"Ambiversive\" describes a personality type that falls between introversion and extroversion. Ambiversives can enjoy social interaction but also value solitude, adapting their behavior to the situation. They are not simply inconsistent but rather possess a balanced set of traits. The term is often used in psychology and self-help contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is ambivert.","correct":"✓ She is an ambivert.","note":"When using \"ambivert\" as a noun, it typically requires an article (a/an)."},{"incorrect":"✗ He is very ambiversive all the time.","correct":"✓ He is ambiversive, adapting to different situations.","note":"Ambiversion is about adaptability, not a constant state. It's better to emphasize their ability to adjust."}],"priority":"★★☆"},"related_words":{"derivatives":["ambiversion (名詞: 両向性)"],"phrases":["fall between introversion and extroversion (内向性と外交性の間に位置する)","exhibit both introverted and extroverted traits (内向的および外交的な特徴の両方を示す)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but increasing in usage.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"ambiversive\" describes someone who has a mix of both introverted and extroverted qualities. This means they can enjoy being social and outgoing at times, but they also need and appreciate time alone to recharge. Think of it as being flexible in social situations, rather than always being one way or the other. It's a more nuanced way to describe personality than just saying someone is an introvert or an extrovert."},"example_sentences":[{"sentence":"The **ambiversive** manager was able to effectively communicate with both the outgoing sales team and the more reserved engineering department.","translation":"その両向的なマネージャーは、外交的な営業チームと、より控えめなエンジニアリング部門の両方と効果的にコミュニケーションをとることができた。","type":"adjective","meaning_category":"内向性と外交性の両方の特徴を併せ持つ"},{"sentence":"As an **ambiversive**, she knew when to lead a brainstorming session and when to step back and let others contribute.","translation":"両向的な人として、彼女はいつブレインストーミングセッションを主導し、いつ一歩引いて他の人に貢献させるべきかを知っていた。","type":"noun","meaning_category":"内向性と外交性の両方の特徴を併せ持つ人"},{"sentence":"Understanding her **ambiversive** nature helped her to choose a career that allowed for both collaborative projects and independent work.","translation":"彼女の両向的な性質を理解することで、共同プロジェクトと独立した作業の両方が可能なキャリアを選択することができた。","type":"adjective","meaning_category":"内向性と外交性の両方の特徴を併せ持つ"}]}