{"word":"Apostoless","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A female apostle.","english_definition":"A female apostle.","examples":[{"sentence":"In some Christian traditions, certain female figures are recognized as apostolesses for their significant roles in spreading the gospel.","translation":"一部のキリスト教の伝統では、福音を広める上で重要な役割を果たした特定の女性が、女性使徒として認められています。"}],"collocations":["Female apostle","Early Christian women","Religious figure"],"synonyms":["Female disciple","Woman apostle"],"antonyms":[]}],"etymology":{"value":"Derived from 'apostle' with the addition of a feminine suffix.","priority":"N/A"},"pronunciation":{"ipa":"/əˈpɒs.təl.ɛs/","syllables":"a-pos-tol-ess"},"inflection":{"noun_plural":"Apostolesses"},"usage_notes":{"explanation":"The term 'Apostoless' is not widely used and can be controversial. It is used to refer to women who held a similar role and status to the male apostles in early Christianity.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ She was an apostle, not an apostoless.","correct":"✓ She was considered an apostoless by some.","note":"The term is not universally accepted, so it's important to use it carefully and acknowledge that it's a specific interpretation."}],"priority":"N/A"},"related_words":{"derivatives":["Apostle","Apostolic"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The term 'Apostoless' is a rare and specialized term used in religious contexts to refer to female figures who played a significant role in early Christian history, similar to that of the male apostles. Its usage is not widespread and can be subject to interpretation and debate within religious communities. Understanding its meaning requires familiarity with religious history and terminology."},"example_sentences":[{"sentence":"Some scholars argue that Mary Magdalene should be considered an Apostoless due to her role as the first witness to the resurrection.","translation":"一部の学者は、マグダラのマリアが復活の最初の証人としての役割を果たしたため、女性使徒と見なされるべきだと主張しています。","type":"noun","meaning_category":"Female Apostle"}]}