{"word":"phytoserologic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"植物血清学の、植物血清学的な","english_definition":"Relating to phytoserology, the study of plant relationships using serological techniques.","examples":[{"sentence":"Phytoserologic methods can be used to determine the taxonomic relationships between different plant species.","translation":"植物血清学的な方法は、異なる植物種間の分類学的関係を決定するために使用できます。"}],"collocations":["phytoserologic analysis","phytoserologic studies","phytoserologic data"],"synonyms":["serological","immunological"],"antonyms":[]}],"etymology":{"value":"The term 'phytoserologic' is derived from 'phyto-' (prefix meaning 'plant'), 'sero-' (relating to serum), and '-logic' (relating to the study or science of).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌfaɪtoʊˌsɪərəˈlɒdʒɪk/","syllables":"phy-to-se-ro-log-ic"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Phytoserologic' is a specialized term used in botany and plant taxonomy. It refers to the application of serological techniques (studying the reactions between antigens and antibodies) to understand the relationships and classifications of plants.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The phytoserological test was done on animals.","correct":"✓ The phytoserologic test was done on plants.","note":"Phytoserologic tests are specifically for plants, not animals."}],"priority":"☆☆☆"},"related_words":{"derivatives":["phytoserology (noun): 植物血清学"],"related_terms":["serology","phytochemistry","plant taxonomy"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'phytoserologic' is highly specialized and primarily used within the fields of botany and plant taxonomy. Understanding requires familiarity with serology (the study of serum and immune responses) and its application to plant biology. Due to its technical nature, it's not commonly encountered outside of scientific literature and advanced academic discussions."},"example_sentences":[{"sentence":"The phytoserologic analysis provided valuable insights into the evolutionary relationships of the Solanaceae family.","translation":"植物血清学的分析は、ナス科の進化的関係に関する貴重な洞察を提供しました。","type":"general","meaning_category":"植物血清学の"}]}