{"word":"somdiel","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(archaic) A type of small, sharp-pointed dagger or knife, especially one used in Scotland.","english_definition":"An archaic term for a small, sharp-pointed dagger or knife, particularly one associated with Scotland.","examples":[{"sentence":"He carried a somdiel hidden in his boot.","translation":"彼はブーツの中にソムディールを隠し持っていた。"},{"sentence":"The Highlander drew his somdiel with a swift motion.","translation":"ハイランダーは素早い動きでソムディールを抜いた。"}],"collocations":["carry a somdiel","draw a somdiel","hidden somdiel"],"synonyms":["dirk","dagger","knife"],"antonyms":[]}],"etymology":{"value":"Origin uncertain, possibly from Scottish Gaelic. The term is archaic and rarely used in modern English.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈsɒmdiːl/","syllables":"som-diel"},"inflection":{"noun_plural":"somdiels"},"usage_notes":{"explanation":"The word 'somdiel' is an archaic term, primarily used in historical contexts related to Scotland. It refers to a type of small dagger or knife. The term is not commonly used in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["dirk","sgian-dubh"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - An archaic term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'somdiel' is a rare, archaic term. It is unlikely to be encountered outside of historical texts or specialized literature related to Scotland. Understanding requires familiarity with historical weaponry and Scottish culture."},"example_sentences":[{"sentence":"The historical novel described a fierce battle where warriors wielded swords and somdiels.","translation":"その歴史小説は、戦士たちが剣とソムディールを振るう激しい戦いを描写していた。","type":"noun","meaning_category":"dagger"},{"sentence":"He found an antique somdiel in the old trunk.","translation":"彼は古いトランクの中でアンティークのソムディールを見つけた。","type":"noun","meaning_category":"dagger"}]}