{"word":"sulphuring","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"硫黄処理、硫化処理","english_definition":"The act or process of treating something with sulfur.","examples":[{"sentence":"Sulphuring is a common practice in winemaking to prevent oxidation.","translation":"硫黄処理は、酸化を防ぐためにワイン製造でよく行われる。"},{"sentence":"The sulphuring of dried fruits helps to preserve their color and prevent spoilage.","translation":"乾燥果物の硫黄処理は、色を保ち、腐敗を防ぐのに役立つ。"}],"collocations":["sulphuring process","sulphuring grapes","sulphuring fruit"],"synonyms":["sulfuration","sulfiting"],"antonyms":[]},{"part_of_speech":"verb","definition":"硫黄処理する、硫化する (sulfurの動名詞)","english_definition":"Present participle of sulfur: to treat something with sulfur.","examples":[{"sentence":"They are sulphuring the grapes to protect them from mold.","translation":"彼らはブドウをカビから守るために硫黄処理している。"},{"sentence":"The farmer is sulphuring his crops to control pests.","translation":"農家は害虫を駆除するために作物を硫黄処理している。"}],"collocations":["sulphuring crops","sulphuring wine","sulphuring food"],"synonyms":["sulfurizing","sulfating"],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'sulfur' (or 'sulphur'), which comes from the Latin word 'sulfurium' or 'sulphur,' meaning sulfur. The '-ing' suffix indicates a process or action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsʌlfərɪŋ/","syllables":"sul-phur-ing"},"inflection":{"verb_forms":{"present_participle":"sulphuring","past_simple":"","past_participle":""},"noun_plural":""},"usage_notes":{"explanation":"'Sulphuring' refers to the process of treating something with sulfur, often to preserve it or protect it from pests or oxidation. It is commonly used in agriculture and food processing. The spelling 'sulphuring' is more common in British English, while 'sulfuring' is more common in American English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sulphuring is very toxic for humans.","correct":"✓ Sulfur dioxide, a byproduct of sulphuring, can be harmful in high concentrations.","note":"While the process itself isn't directly toxic, the sulfur dioxide produced can be harmful in high concentrations."},{"incorrect":"✗ Sulphuring is only used for grapes.","correct":"✓ Sulphuring is used for various fruits, vegetables, and even in some industrial processes.","note":"Sulphuring has various applications beyond just grapes."}],"priority":"★★☆"},"related_words":{"derivatives":["sulfur","sulfuric","sulfide","sulfite","sulfate"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sulphuring' describes the process of treating something with sulfur, often to preserve it or protect it from pests or oxidation. This term is most frequently encountered in the context of food preservation, particularly with dried fruits and winemaking, and in agriculture for pest control. Understanding this word requires familiarity with the chemical element sulfur and its applications in these specific fields."},"example_sentences":[{"sentence":"The ancient Egyptians practiced sulphuring to preserve mummies.","translation":"古代エジプト人はミイラを保存するために硫黄処理を行った。","type":"noun","meaning_category":"硫黄処理"},{"sentence":"The winemaker is carefully sulphuring the wine to prevent spoilage.","translation":"ワインメーカーは腐敗を防ぐために慎重にワインを硫黄処理している。","type":"verb","meaning_category":"硫黄処理する"}]}