{"word":"scurrilousness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"下品さ、口汚さ、悪口、中傷","english_definition":"the quality of being scurrilous; the use of or expression of scandalous claims about someone with the intention of damaging their reputation.","examples":[{"sentence":"The scurrilousness of the article shocked many readers.","translation":"その記事の口汚さ（下品さ）は多くの読者を衝撃させた。"},{"sentence":"He was known for the scurrilousness of his attacks on political opponents.","translation":"彼は政敵に対する中傷的な攻撃で知られていた。"},{"sentence":"The politician condemned the scurrilousness of the rumors being spread about him.","translation":"政治家は彼について広まっている噂の中傷性を非難した。"}],"collocations":["scurrilousness of rumors","scurrilousness of attacks","scurrilousness of allegations","scurrilousness of a campaign"],"synonyms":["defamation","vilification","calumny","slander","libel","abusiveness","coarseness","vulgarity"],"antonyms":["decency","respectfulness","civility","courtesy","decorum"]}],"etymology":{"value":"派生語: scurrilous (形容詞) + -ness (名詞化接尾辞)。scurrilous は、古フランス語の 'escureleus' (道化師のような、冗談好きの) に由来し、ラテン語の 'scurra' (道化師、軽薄な人) から派生した。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskʌrələsnəs/","syllables":"scur-ril-ous-ness"},"inflection":{"noun_plural":"N/A (不可算名詞)"},"usage_notes":{"explanation":"\"Scurrilousness\" refers to the quality or state of being scurrilous. It describes language or behavior that is vulgar, abusive, and intended to harm someone's reputation. It often involves spreading false or exaggerated claims. The term emphasizes the offensive and damaging nature of the communication.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The scurrilousness was very happy.","correct":"✓ The scurrilousness was shocking.","note":"\"Scurrilousness\" is a quality or characteristic, not a person or thing that can experience emotions like happiness. It's used to describe the nature of something, like a statement or article."},{"incorrect":"✗ He showed scurrilousness to his friend.","correct":"✓ He showed scurrilous behavior to his friend.","note":"\"Scurrilousness\" is a quality, not an action. The correct usage would be to say he showed scurrilous behavior or made scurrilous remarks."}],"priority":"★★☆"},"related_words":{"derivatives":["scurrilous (形容詞: 口汚い、下品な、中傷的な)","scurrilously (副詞: 口汚く、下品に、中傷的に)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Scurrilousness\" is a complex word referring to the quality of using abusive and defamatory language to harm someone's reputation. It's not commonly used in everyday conversation but appears in formal writing or discussions about ethics, politics, or media. Understanding this word requires a strong vocabulary and comprehension of abstract concepts related to communication and reputation. It's often found in contexts discussing libel, slander, or unethical behavior.","priority":"★☆☆"},"example_sentences":[{"sentence":"The newspaper article was filled with scurrilousness, attacking the politician's character without any evidence.","translation":"その新聞記事は中傷に満ちており、証拠もなく政治家の人物を攻撃していた。","type":"general","meaning_category":"中傷"},{"sentence":"The level of scurrilousness in the online debate was appalling.","translation":"オンライン討論における下品さのレベルはひどいものだった。","type":"general","meaning_category":"下品さ"},{"sentence":"She refused to engage in the scurrilousness of the political campaign.","translation":"彼女は政治キャンペーンの中傷に加わることを拒否した。","type":"general","meaning_category":"中傷"}]}