{"word":"data-connected","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"データ通信が可能な、データ接続された","english_definition":"Capable of connecting to and transmitting data, typically wirelessly.","examples":[{"sentence":"The new smartwatch is data-connected, allowing users to receive notifications and track fitness metrics without a smartphone.","translation":"その新しいスマートウォッチはデータ通信が可能で、スマートフォンなしで通知を受け取ったり、フィットネスの指標を追跡したりできます。"},{"sentence":"Data-connected devices are becoming increasingly common in the Internet of Things (IoT).","translation":"データ接続されたデバイスは、モノのインターネット（IoT）でますます一般的になっています。"},{"sentence":"The company offers data-connected solutions for remote monitoring of industrial equipment.","translation":"その会社は、産業機器のリモート監視のためのデータ接続ソリューションを提供しています。"}],"collocations":["data-connected device","data-connected car","data-connected system","data-connected solution","data-connected world"],"synonyms":["networked","online","wireless","connected","digital"],"antonyms":["offline","disconnected","isolated","analog"]}],"etymology":{"value":"The term 'data-connected' is a compound adjective formed by combining 'data' (information processed or stored by a computer) and 'connected' (linked or joined together). It describes a device or system that has the ability to link to a network and transmit data.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdeɪtə kəˈnektɪd/","syllables":"da-ta-con-nec-ted"},"inflection":{"notes":"This is an adjective, so it does not inflect for number or gender."},"usage_notes":{"explanation":"'Data-connected' is commonly used to describe devices or systems that can communicate and exchange data, often wirelessly. It emphasizes the ability to transmit and receive information, making it a key feature in modern technology and the Internet of Things. The term highlights the connectivity aspect of a device, distinguishing it from those that operate in isolation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The device is connect data.","correct":"✓ The device is data-connected.","note":"The correct term is 'data-connected,' not 'connect data.'"},{"incorrect":"✗ The data connect device.","correct":"✓ The data-connected device.","note":"'Data-connected' is an adjective and should be used to describe a noun, such as 'device.'"}],"priority":"★★☆"},"related_words":{"derivatives":["data connection","data connectivity","connectedness"],"phrasal_verbs":[],"related_terms":["IoT (Internet of Things)","M2M (Machine-to-Machine)","wireless communication","network connectivity","smart device"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but increasing due to the growth of IoT.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Data-connected' is a term used to describe devices that can connect to a network and share data. It's common in discussions about technology, especially the Internet of Things (IoT), where many devices are designed to communicate with each other. If a device is 'data-connected,' it means it can send and receive information, often wirelessly, making it part of a larger network. Think of smartwatches, smart home devices, and industrial sensors as examples of data-connected devices."},"example_sentences":[{"sentence":"The **data-connected** car provides real-time traffic updates and navigation.","translation":"データ接続された車は、リアルタイムの交通情報とナビゲーションを提供します。","type":"adjective","meaning_category":"データ通信が可能な"},{"sentence":"Farmers are using **data-connected** sensors to monitor soil conditions and optimize irrigation.","translation":"農家は、データ接続されたセンサーを使用して土壌の状態を監視し、灌漑を最適化しています。","type":"adjective","meaning_category":"データ接続された"},{"sentence":"The **data-connected** nature of the system allows for remote diagnostics and troubleshooting.","translation":"システムのデータ接続された性質により、リモート診断とトラブルシューティングが可能になります。","type":"adjective","meaning_category":"データ通信が可能な"}]}