{"word":"self-quotation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自己引用、自身の過去の著作からの引用","english_definition":"The act of quoting one's own previously written or spoken words.","examples":[{"sentence":"The author's self-quotation in the introduction seemed a bit narcissistic.","translation":"著者が序文で自己引用しているのは、少し自己陶酔的に見えた。"},{"sentence":"Academic papers often include self-quotation to build upon previous research.","translation":"学術論文では、過去の研究に基づいて自己引用がよく含まれる。"},{"sentence":"Excessive self-quotation can be seen as a way to inflate one's publication record.","translation":"過度な自己引用は、出版記録を水増しする方法と見なされる可能性がある。"}],"collocations":["avoid self-quotation (自己引用を避ける)","excessive self-quotation (過度な自己引用)","justified self-quotation (正当化された自己引用)","strategic self-quotation (戦略的な自己引用)"],"synonyms":["auto-citation"],"antonyms":["plagiarism (盗用)","original work (オリジナル作品)"]},{"part_of_speech":"noun","definition":"（比喩的に）過去の自分に固執すること、進歩のなさ","english_definition":"(Figuratively) A clinging to one's past self; a lack of progress or originality.","examples":[{"sentence":"His constant repetition of old ideas was a form of intellectual self-quotation.","translation":"彼の古いアイデアの絶え間ない繰り返しは、知的な自己引用の一形態だった。"},{"sentence":"The artist's work suffered from self-quotation, lacking any new inspiration.","translation":"そのアーティストの作品は自己引用に苦しみ、新たなインスピレーションを欠いていた。"}],"collocations":["intellectual self-quotation (知的な自己引用)","artistic self-quotation (芸術的な自己引用)"],"synonyms":["repetition","stagnation","lack of originality"],"antonyms":["innovation","progress","originality"]}],"etymology":{"value":"\"self-\" (自身) + \"quotation\" (引用)。自身の著作から引用するという行為を直接的に表す複合語。","priority":"★★★"},"pronunciation":{"ipa":"/ˌself.kwoʊˈteɪ.ʃən/","syllables":"self-quo-ta-tion"},"inflection":{"noun_plural":"self-quotations"},"usage_notes":{"explanation":"\"**Self-quotation**\" refers to the practice of an author or speaker citing their own previous work. While it is sometimes necessary and acceptable, particularly in academic contexts to build upon one's own research, it can also be viewed negatively if used excessively or inappropriately. It can be seen as a form of self-promotion or a way to avoid engaging with other scholars' ideas. In a broader sense, it can also refer to a lack of originality or a reliance on past ideas.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He made a self quote in his essay.","correct":"✓ He included a self-quotation in his essay.","note":"\"Self-quotation\" is a noun, so use verbs like \"include,\" \"use,\" or \"make reference to\" instead of \"quote\" as a verb. \"Self-quote\" is sometimes used informally as a verb, but it's less common and less formal than using \"self-quotation\" as a noun."},{"incorrect":"✗ Self-quotation is always plagiarism.","correct":"✓ Self-quotation can be problematic, but it is not always plagiarism.","note":"Self-quotation is not necessarily plagiarism, as plagiarism involves using someone else's work without attribution. However, excessive or misleading self-quotation can raise ethical concerns."}],"priority":"★★☆"},"related_words":{"derivatives":["self-cite (verb: 自己引用する)","self-referential (adjective: 自己言及的な)","citation (noun: 引用)","quote (verb/noun: 引用する/引用)"],"phrases":["auto-citation (自己引用)","citation analysis (引用分析)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"比較的低い (Relatively low) - 学術的な文脈でよく使われる。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"**Self-quotation**\" is a term used to describe when someone quotes their own previous work. It's often found in academic writing, where researchers might refer back to their earlier studies. While it's not always a bad thing, using too much self-quotation can be seen as self-serving or lacking in originality. It's important to use it sparingly and only when it adds value to the current work. The term can also be used more broadly to describe someone who keeps repeating old ideas instead of coming up with new ones."},"example_sentences":[{"sentence":"The professor defended his **self-quotation** by arguing that it provided necessary context.","translation":"教授は、自己引用が必要な文脈を提供すると主張して、自己引用を擁護した。","type":"noun","meaning_category":"自己引用"},{"sentence":"The overuse of **self-quotation** in her dissertation raised concerns among the committee members.","translation":"彼女の論文における自己引用の多用は、委員会メンバーの間で懸念を引き起こした。","type":"noun","meaning_category":"自己引用"},{"sentence":"He was accused of intellectual **self-quotation** for recycling the same arguments in every debate.","translation":"彼はすべての討論で同じ議論を繰り返したため、知的な自己引用で非難された。","type":"noun","meaning_category":"過去の自分に固執すること"}]}