{"word":"neologically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"新語を用いて、新語的に","english_definition":"In a neological manner; using or relating to neologisms (newly coined words or expressions).","examples":[{"sentence":"The text was written neologically, incorporating many recently created terms.","translation":"その文章は新語的に書かれており、最近作られた多くの言葉を取り入れていた。"},{"sentence":"She spoke neologically, which made it difficult for some to understand her.","translation":"彼女は新語を用いて話したので、一部の人々には彼女を理解することが難しかった。"}],"collocations":["speak neologically","write neologically","use neologically"],"synonyms":["innovatively","newly","creatively","inventively"],"antonyms":["traditionally","conventionally","classically"]}],"etymology":{"value":"Formed from \"neological\" + \"-ly\". \"Neological\" comes from \"neology\" (the introduction or use of new words or new meanings of existing words), which is derived from Greek \"neos\" (new) + \"-logy\" (study of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌniːəˈlɒdʒɪkli/","syllables":"ne-o-log-i-cal-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"The adverb \"neologically\" describes something done in a way that involves the creation or use of new words or expressions. It is often used in contexts related to language, literature, or technology, where new terms are frequently introduced.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He described the process neologic.","correct":"✓ He described the process neologically.","note":"\"Neologic\" is an adjective, while \"neologically\" is an adverb. Use the adverb to modify a verb."}],"priority":"★★☆"},"related_words":{"derivatives":["neological (adjective)","neologism (noun)","neologist (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'neologically' is an advanced term used to describe the act of using or creating new words or expressions. It's not commonly used in everyday conversation but is more likely to appear in academic or specialized contexts related to language and linguistics. Understanding this word requires a good grasp of word formation and the concept of neologisms."},"example_sentences":[{"sentence":"The author neologically introduced several terms to describe the novel technology.","translation":"著者はその新しい技術を説明するために、新語を用いていくつかの用語を紹介した。","type":"general","meaning_category":"新語を用いて"},{"sentence":"The software documentation was written neologically, making it difficult for older users to understand.","translation":"そのソフトウェアのドキュメントは新語を用いて書かれていたため、高齢のユーザーには理解が難しかった。","type":"technical","meaning_category":"新語を用いて"}]}