{"word":"hematocytometer","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"血球計算盤","english_definition":"A counting chamber device used to count cells.","examples":[{"sentence":"The technician used a hematocytometer to count the number of red blood cells in the sample.","translation":"技師は血球計算盤を使って、サンプル中の赤血球数を数えた。"}],"collocations":["use a hematocytometer","count cells with a hematocytometer","Neubauer hematocytometer"],"synonyms":["cell counter","counting chamber"],"antonyms":[]}],"etymology":{"value":"The word \"hematocytometer\" is derived from the Greek words \"hema\" (blood), \"cyto\" (cell), and \"meter\" (measure).","priority":"★★★"},"pronunciation":{"ipa":"/ˌhiːmætəˌsaɪˈtɒmɪtər/","syllables":"he-ma-to-cy-tom-e-ter"},"inflection":{"noun_plural":"hematocytometers"},"usage_notes":{"explanation":"A hematocytometer is a specialized microscope slide with a grid of precise dimensions etched on its surface. It is used to count cells in a known volume of fluid, allowing for the determination of cell concentration.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used the hematocytometer to measure the blood.","correct":"✓ I used the hematocytometer to count the cells in the blood.","note":"A hematocytometer is used for counting cells, not for measuring blood volume or other properties of blood."}],"priority":"★★☆"},"related_words":{"derivatives":["hemocytometry (blood cell counting)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"hematocytometer\" is a technical term primarily used in medical and laboratory settings. Understanding its meaning requires familiarity with biological and medical terminology. It refers to a specific tool used for cell counting, particularly blood cells, and is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The laboratory assistant carefully loaded the sample onto the **hematocytometer**.","translation":"実験助手は注意深くサンプルを血球計算盤にロードした。","type":"general","meaning_category":"instrument"},{"sentence":"Using the **hematocytometer**, we were able to determine the concentration of yeast cells in the culture.","translation":"血球計算盤を使って、培養液中の酵母細胞の濃度を測定することができた。","type":"scientific","meaning_category":"measurement"},{"sentence":"The **hematocytometer** is an essential tool in cell biology research.","translation":"血球計算盤は細胞生物学研究に不可欠なツールです。","type":"research","meaning_category":"research tool"}]}