{"word":"Jewishly","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"ユダヤ教の慣習に従って、ユダヤ教的に","english_definition":"In a manner conforming to Jewish customs, laws, or traditions.","examples":[{"sentence":"They lived Jewishly, observing the Sabbath and holidays.","translation":"彼らはユダヤ教的に生活し、安息日と祝日を守っていた。"},{"sentence":"The meal was prepared Jewishly, following kosher dietary laws.","translation":"食事はユダヤ教的に調理され、コシェル（適正な）食事法に従っていた。"},{"sentence":"He approached the problem Jewishly, seeking guidance from rabbinic teachings.","translation":"彼はユダヤ教的に問題に取り組み、ラビの教えから導きを求めた。"}],"collocations":["live Jewishly (ユダヤ教的に生活する)","observe Jewishly (ユダヤ教的に守る)","practice Jewishly (ユダヤ教的に実践する)","prepare Jewishly (ユダヤ教的に準備する)","act Jewishly (ユダヤ教的に行動する)","think Jewishly (ユダヤ教的に考える)"],"synonyms":["religiously","traditionally","observantly","piously","devoutly","according to Jewish law","in a Jewish manner","in a Jewish way"],"antonyms":["secularly","non-religiously","atheistically","irreligiously","profanely","worldly","agnostically"]}],"etymology":{"value":"The word 'Jewishly' is derived from 'Jewish' (belonging to or relating to the Jewish people or religion) with the addition of the suffix '-ly', which transforms it into an adverb indicating a manner or way of doing something.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdʒuːɪʃli/","syllables":"Jew-ish-ly"},"inflection":{"notes":"Since 'Jewishly' is an adverb, it does not have plural forms or comparative/superlative degrees."},"usage_notes":{"explanation":"'Jewishly' is an adverb that describes actions or behaviors performed in accordance with Jewish customs, laws, or traditions. It is used to emphasize that something is done in a way that is consistent with Jewish religious or cultural practices. It is often used in contexts related to religious observance, dietary laws (kashrut), and ethical conduct.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He Jewishly celebrated Christmas.","correct":"✓ He did not celebrate Christmas, as it is not a Jewish holiday.","note":"Celebrating Christmas is not consistent with Jewish tradition. Therefore, using 'Jewishly' in this context is incorrect. Jewish holidays would be more appropriate."},{"incorrect":"✗ She Jewishly ate pork.","correct":"✓ She did not eat pork, as it is not kosher.","note":"Eating pork is contrary to kosher dietary laws. Therefore, using 'Jewishly' in this context is incorrect."},{"incorrect":"✗ They Jewishly went to church.","correct":"✓ They went to synagogue.","note":"Going to church is not consistent with Jewish practice. Jews go to synagogue."}],"priority":"★★☆"},"related_words":{"derivatives":["Jewish (adjective)","Jew (noun)","Judaism (noun)"],"phrases":["act Jewishly","live Jewishly","think Jewishly","observe Jewishly"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Jewishly' is an adverb that means 'in a manner conforming to Jewish customs, laws, or traditions.' It is used to describe how something is done in accordance with Jewish practices. This word is not commonly used in everyday conversation and is more likely to be found in religious or cultural contexts. Understanding its meaning requires familiarity with Jewish customs and traditions."},"example_sentences":[{"sentence":"The family observed the Sabbath Jewishly, refraining from work and spending time in prayer and study.","translation":"その家族は安息日をユダヤ教的に守り、仕事を控え、祈りと学習に時間を費やした。","type":"general","meaning_category":"religious observance"},{"sentence":"The restaurant prepared its meals Jewishly, adhering to strict kosher guidelines.","translation":"そのレストランは食事をユダヤ教的に調理し、厳格なコシェルのガイドラインを遵守した。","type":"general","meaning_category":"dietary laws"},{"sentence":"He approached business dealings Jewishly, emphasizing honesty and ethical conduct.","translation":"彼はビジネス取引にユダヤ教的に取り組み、誠実さと倫理的な行動を強調した。","type":"general","meaning_category":"ethical conduct"}]}