{"word":"vadio","meanings":[{"part_of_speech":"noun","definition":"(historical) A type of tax or tribute paid in medieval Spain, particularly in the Kingdom of León and Castile, often in exchange for protection or to avoid conflict.","english_definition":"A tax or tribute paid in medieval Spain, especially in the Kingdom of León and Castile, often for protection or to avoid conflict.","examples":[{"sentence":"The villagers paid vadio to the local lord to ensure their safety.","translation":"村人たちは安全を確保するために、地元の領主にヴァディオを支払った。"},{"sentence":"Historical records indicate that the vadio was a significant source of revenue for the kingdom.","translation":"歴史的記録によれば、ヴァディオは王国にとって重要な収入源であった。"}],"collocations":["pay vadio","collect vadio","vadio payment","royal vadio"],"synonyms":["tribute","tax","protection money","paria"],"antonyms":[]}],"etymology":{"value":"The term 'vadio' comes from the Latin word 'vadium,' meaning 'pledge' or 'security.' This reflects the nature of the payment as a guarantee of protection or peace.","priority":"★★★"},"pronunciation":{"ipa":"/ˈvaðjo/","syllables":"va-di-o"},"inflection":{"noun_plural":"vadios"},"usage_notes":{"explanation":"The term 'vadio' is primarily used in the context of medieval Spanish history. It refers to a specific type of payment made to rulers or lords, often to ensure protection from raids or other forms of violence. It is similar to the concept of 'paria' paid to the Christian kingdoms by the Taifa states in Al-Andalus.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The vadio was a form of feudal service.","correct":"The vadio was a form of tax or tribute.","note":"Vadio was a monetary payment, not a service."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["paria","tribute","tax","feudalism","medieval Spain"]},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency - primarily used in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'vadio' is a specialized term related to medieval Spanish history. It is unlikely to be encountered outside of academic or historical contexts. Understanding the term requires knowledge of the political and economic systems of medieval Spain."},"example_sentences":[{"sentence":"The kingdom relied heavily on the vadio collected from smaller territories.","translation":"王国は、より小さな領土から徴収されたヴァディオに大きく依存していた。","type":"noun","meaning_category":"historical tax"},{"sentence":"Paying the vadio was often the only way for communities to avoid being raided.","translation":"ヴァディオを支払うことは、コミュニティが襲撃されるのを避けるための唯一の方法であることが多かった。","type":"noun","meaning_category":"historical tax"}]}