{"word":"Furnariidae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"カマドドリ科：スズメ目に属する鳥類の科の一つ。中南米に分布する。","english_definition":"The ovenbirds, a family of passerine birds found in Central and South America.","examples":[{"sentence":"Furnariids are known for building elaborate mud nests.","translation":"カマドドリ科の鳥は、手の込んだ泥の巣を作ることで知られています。"}],"collocations":[],"synonyms":["ovenbirds"],"antonyms":[]}],"etymology":{"value":"New Latin, from Furnarius (the genus name) + -idae (standard suffix for zoological family names). Furnarius is derived from Latin 'furnus' (oven), referring to the oven-like shape of the mud nests built by some species in this family.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfʊərnəˈraɪɪdiː/","syllables":"Fur-na-ri-i-dae"},"inflection":{"noun_plural":"Furnariids"},"usage_notes":{"explanation":"'Furnariidae' is a scientific term used in ornithology to classify a specific family of birds. It is primarily used in scientific contexts, such as research papers, field guides, and taxonomic discussions. In general conversation, the term 'ovenbirds' is more commonly used.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["furnariid (noun, adjective)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low frequency (scientific term)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Furnariidae' is a highly specialized term used within the field of ornithology (the study of birds). Understanding and using this term requires advanced knowledge of biological classification and taxonomy. It is not typically encountered in general English usage."},"example_sentences":[{"sentence":"The Furnariidae family exhibits a wide range of nesting behaviors.","translation":"カマドドリ科は、幅広い営巣行動を示します。","type":"noun","meaning_category":"Taxonomy"},{"sentence":"Many species within the Furnariidae are adapted to diverse habitats.","translation":"カマドドリ科の多くの種は、多様な生息地に適応しています。","type":"noun","meaning_category":"Ecology"}]}