{"word":"nondeprecatively","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"控えめに、軽蔑的でなく、軽んじることなく","english_definition":"In a manner that is not deprecative; without belittling or disparaging.","examples":[{"sentence":"He spoke of his rival nondeprecatively, praising his skills and accomplishments.","translation":"彼はライバルのことを軽蔑的にではなく、そのスキルと功績を褒め称えた。"},{"sentence":"She described the project nondeprecatively, highlighting its potential benefits.","translation":"彼女はそのプロジェクトを軽んじることなく説明し、その潜在的な利点を強調した。"}],"collocations":["speak nondeprecatively","describe nondeprecatively","treat nondeprecatively"],"synonyms":["respectfully","appreciatively","complimentary","favorably"],"antonyms":["deprecatively","disparagingly","belittlingly","derogatorily"]}],"etymology":{"value":"Derived from \"nondeprecative,\" which is formed by adding the prefix \"non-\" (meaning \"not\") to \"deprecative.\" \"Deprecative\" comes from \"deprecate,\" meaning to express disapproval of or belittle.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒn.dɪˈprek.ə.tɪv.li/","syllables":"non-de-prec-a-tive-ly"},"inflection":{"notes":"Adverb, so it does not inflect."},"usage_notes":{"explanation":"The adverb \"nondeprecatively\" describes the manner in which something is said or done, emphasizing that it is done without any intention to belittle or disparage. It is used to highlight a respectful or appreciative approach.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He looked at her nondeprecatively.","correct":"✓ He looked at her respectfully.","note":"Looking at someone nondeprecatively isn't commonly expressed this way. Use a more direct synonym like 'respectfully' instead."},{"incorrect":"✗ She acted nondeprecatively towards the suggestion.","correct":"✓ She responded nondeprecatively to the suggestion.","note":"'Acted' is too broad. Use a verb that specifies how the person behaved, such as 'responded' or 'spoke'."}],"priority":"★☆☆"},"related_words":{"derivatives":["nondeprecative (adjective)","deprecate (verb)","deprecation (noun)"],"antonyms":["deprecatingly","disparagingly"],"synonyms":["respectfully","appreciatively"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Nondeprecatively' is a formal and relatively rare word. It describes doing something without belittling or showing disapproval. It's often used in academic or professional contexts to emphasize respect and impartiality. You're more likely to encounter this word in written text than in everyday conversation."},"example_sentences":[{"sentence":"The manager evaluated the employee's performance nondeprecatively, focusing on areas for improvement rather than dwelling on mistakes.","translation":"マネージャーは従業員の業績を軽んじることなく評価し、間違いにこだわるのではなく、改善の余地がある分野に焦点を当てた。","type":"general","meaning_category":"manner of speaking"},{"sentence":"The historian wrote about the controversial figure nondeprecatively, aiming to present a balanced and objective account.","translation":"歴史家はその物議を醸した人物について、バランスの取れた客観的な説明をすることを目的として、軽蔑的に書くことはなかった。","type":"writing","meaning_category":"impartiality"}]}