{"word":"Erethisia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(生物学)カゲロウ目の昆虫の亜成虫","english_definition":"(Zoology) The subimago stage of a mayfly (order Ephemeroptera).","examples":[{"sentence":"The Erethisia emerges from the nymphal skin.","translation":"亜成虫は幼虫の皮から羽化する。"}],"collocations":[],"synonyms":["subimago"],"antonyms":["nymph","imago"]}],"etymology":{"value":"Derived from Ancient Greek roots referring to the ephemeral nature of this life stage.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛrɪˈθɪziə/","syllables":"E-re-thi-si-a"},"inflection":{"noun_plural":"Erethisias"},"usage_notes":{"explanation":"The term 'Erethisia' is primarily used in entomology when discussing the life cycle of mayflies. It refers specifically to the stage between the nymph and the adult (imago). This stage is unique to mayflies, as they are the only insects that molt after developing functional wings.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Erethisia is the adult mayfly.","correct":"✓ The Erethisia is the subimago stage of a mayfly.","note":"The Erethisia is not the adult stage; it's the subimago, which molts into the adult."}],"priority":"★★☆"},"related_words":{"derivatives":["Erethisial (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - Primarily a technical term used in entomology.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Erethisia' is a highly specialized term used in entomology to describe the subimago stage of mayflies. Understanding this term requires a background in insect biology and life cycles. It's not commonly encountered outside of scientific contexts.","priority":"★★★"},"example_sentences":[{"sentence":"The delicate wings of the Erethisia are easily damaged.","translation":"亜成虫の繊細な翅は傷つきやすい。","type":"noun","meaning_category":"Biology"},{"sentence":"Entomologists study the Erethisia to understand mayfly development.","translation":"昆虫学者はカゲロウの発達を理解するために亜成虫を研究する。","type":"noun","meaning_category":"Biology"}]}