{"word":"nisbah","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(イスラム法)相続における女性の相続分","english_definition":"(Islamic law) The share of inheritance a woman receives, typically half of what a man receives.","examples":[{"sentence":"Under the principles of nisbah, a daughter inherits half the share of her brother.","translation":"ニスバの原則の下では、娘は兄弟の相続分の半分を相続する。"}],"collocations":["inheritance nisbah","Islamic nisbah"],"synonyms":["inheritance share","female inheritance portion"],"antonyms":["male inheritance portion"]}],"etymology":{"value":"From Arabic نِسْبَة (nisba), meaning \"proportion\" or \"ratio\".","priority":"★★★"},"pronunciation":{"ipa":"/ˈnɪzbɑː/","syllables":"Niz-bah"},"inflection":{"noun_plural":"nisbahs"},"usage_notes":{"explanation":"The term 'nisbah' is specific to Islamic inheritance law and refers to the proportional share a female relative receives in inheritance, which is generally half the share a male relative of the same degree receives. This is based on interpretations of the Quran and Hadith.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The nisbah is the same for all female relatives.","correct":"The nisbah varies depending on the relationship to the deceased.","note":"The exact share (nisbah) varies based on the relationship to the deceased and the presence of other heirs."}],"priority":"★★☆"},"related_words":{"derivatives":["fara'id (Islamic inheritance laws)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Nisbah' is a term specific to Islamic inheritance law, referring to the proportional share a female relative receives, typically half of what a male relative receives. Understanding this term requires familiarity with Islamic legal principles. It is not commonly used outside of discussions of Islamic law or inheritance.","priority":"★★★"},"example_sentences":[{"sentence":"The calculation of the nisbah is a complex process involving several factors.","translation":"ニスバの計算は、いくつかの要因を含む複雑なプロセスです。","type":"noun","meaning_category":"inheritance share"},{"sentence":"The nisbah ensures that female relatives receive a portion of the inheritance.","translation":"ニスバは、女性の親族が相続の一部を受け取ることを保証します。","type":"noun","meaning_category":"inheritance share"}]}