{"word":"stroboradiograph","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ストロボラジオグラフ：ストロボスコープとX線撮影を組み合わせた医療画像技術、またはそれによって作成された画像","english_definition":"A medical imaging technique combining stroboscopy and radiography, or an image produced by this technique.","examples":[{"sentence":"The stroboradiograph clearly showed the movement of the vocal cords.","translation":"ストロボラジオグラフは声帯の動きを明確に示した。"},{"sentence":"Stroboradiography is used to diagnose certain vocal cord disorders.","translation":"ストロボラジオグラフィーは、特定の声帯障害の診断に使用される。"}],"collocations":["vocal cord stroboradiograph (声帯ストロボラジオグラフ)"],"synonyms":["videostroboscopy","laryngostroboscopy"],"antonyms":[]}],"etymology":{"value":"「stroboscope」（ストロボスコープ）、「radio-」（放射線）、「-graph」（記録）の組み合わせ。ストロボスコープの原理を利用して、X線を用いて動いている物体を観察・記録する技術に由来する。","priority":"★★★"},"pronunciation":{"ipa":"/ˌstroʊbəʊˈreɪdiəɡræf/","syllables":"stro-bo-ra-di-o-graph"},"inflection":{"noun_plural":"stroboradiographs"},"usage_notes":{"explanation":"Stroboradiography is a specialized medical imaging technique primarily used to visualize the movement of the vocal cords. It combines the principles of stroboscopy, which uses intermittent light to create the illusion of slow motion, with radiography, which uses X-rays to penetrate and visualize internal structures. The resulting images allow clinicians to assess the vibratory patterns of the vocal cords during speech, aiding in the diagnosis of various voice disorders.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ stroboradiography","correct":"✓ stroboradiograph","note":"stroboradiograph is the noun, stroboradiography is the process."}],"priority":"★☆☆"},"related_words":{"derivatives":["stroboradiography (名詞: ストロボラジオグラフィー)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Stroboradiograph is a highly specialized term in the field of medical imaging, specifically related to techniques for visualizing the movement of vocal cords. It combines stroboscopic and radiographic methods to create images that allow clinicians to assess vocal cord function. Due to its technical nature and limited application, it is not a commonly encountered word outside of medical contexts. Understanding requires familiarity with both stroboscopy and radiography.","priority":"★☆☆"},"example_sentences":[{"sentence":"The ENT specialist reviewed the stroboradiograph to assess the patient's vocal cord function.","translation":"耳鼻咽喉科医は患者の声帯機能を評価するためにストロボラジオグラフを検討した。","type":"noun","meaning_category":"医療画像"},{"sentence":"The stroboradiograph revealed a slight asymmetry in the vocal cord vibration.","translation":"ストロボラジオグラフは声帯振動のわずかな非対称性を示した。","type":"noun","meaning_category":"医療画像"}]}