{"word":"hypogynic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(植物学) 雌しべが他の花器官よりも上位にあること、子房上位であること","english_definition":"(botany) Having the ovary superior, with the other floral parts (sepals, petals, and stamens) inserted below it.","examples":[{"sentence":"The flower is hypogynic, with the petals and sepals attached below the ovary.","translation":"その花は子房上位で、花弁と萼片は子房の下についている。"}],"collocations":["hypogynous flower","hypogyny"],"synonyms":["superior ovary"],"antonyms":["epigynous","perigynous"]}],"etymology":{"value":"From the Greek words 'hypo' (under) and 'gynē' (woman, pistil).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpəˈdʒɪnɪk/","syllables":"hy-po-gyn-ic"},"inflection":{"notes":"Comparative and superlative forms are possible but rare (more hypogynic, most hypogynic)."},"usage_notes":{"explanation":"'Hypogynic' is a botanical term used to describe the arrangement of floral parts in relation to the ovary. In a hypogynic flower, the ovary is positioned above the other floral organs (sepals, petals, and stamens), which are attached to the receptacle below the ovary. This is also referred to as having a superior ovary. This term is important in plant classification and identification.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The hypogynic flower has the ovary below the petals.","correct":"✓ The hypogynic flower has the ovary above the petals.","note":"Hypogynic flowers have the ovary positioned *above* the other floral parts."}],"priority":"★★☆"},"related_words":{"derivatives":["hypogyny (noun): the condition of having a superior ovary"],"related_terms":["epigynous","perigynous","ovary","pistil","receptacle","flower parts"]},"level_frequency":{"frequency_google_ngram":"Low frequency - specialized botanical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hypogynic' is a specialized botanical term describing the position of the ovary in a flower relative to other floral parts. It indicates that the ovary is superior, meaning it is positioned above the attachment points of the sepals, petals, and stamens. Understanding this term is crucial for detailed plant anatomy and classification. It is typically encountered in advanced botany texts or courses."},"example_sentences":[{"sentence":"The lily is an example of a hypogynic flower.","translation":"ユリは子房上位の花の例である。","type":"general","meaning_category":"子房上位の花の例"},{"sentence":"In hypogynic flowers, the receptacle is convex or conical.","translation":"子房上位の花では、花托は凸状または円錐状である。","type":"technical","meaning_category":"花托の形状"}]}