{"word":"well-dominated","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(数学、特に圏論において)十分に支配された、適切な支配構造を持つ","english_definition":"(Mathematics, especially in category theory) Having a suitable dominance structure; possessing properties that make it 'well-behaved' with respect to dominance.","examples":[{"sentence":"A well-dominated category allows for a rich theory of subobjects.","translation":"十分に支配された圏は、部分対象の豊かな理論を可能にする。"},{"sentence":"The category of sets is well-dominated.","translation":"集合の圏は十分に支配されている。"}],"collocations":["well-dominated category","well-dominated topos"],"synonyms":["dominical","regular","well-behaved"],"antonyms":["ill-dominated","poorly-dominated"]}],"etymology":{"value":"The term 'well-dominated' is formed by combining 'well' (indicating a positive or desirable quality) with 'dominated' (referring to the mathematical concept of dominance). It signifies that the object or structure in question possesses a dominance relation that satisfies certain desirable properties.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌwɛlˈdɒmɪneɪtɪd/","syllables":"well-dom-i-nat-ed"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. Comparative and superlative forms are possible but less common (more well-dominated, most well-dominated)."},"usage_notes":{"explanation":"In category theory, a 'well-dominated' category possesses a dominance structure that allows for a robust theory of subobjects and relations. The precise definition varies depending on the context but generally involves the existence of a subobject classifier and other related properties. This concept is important for generalizing set-theoretic notions to more abstract categories.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The space is dominated well.","correct":"✓ The space is well-dominated.","note":"The adjective 'well-dominated' should be used directly to describe the space, not as an adverb-verb construction ('dominated well')."},{"incorrect":"✗ Well dominated is when a category has subobjects.","correct":"✓ A well-dominated category has a rich structure of subobjects.","note":"'Well-dominated' is an adjective describing a category, not a state or event. The corrected sentence emphasizes the structural properties of such a category."}],"priority":"★★☆"},"related_words":{"derivatives":["dominate","dominance","subobject","category theory","topos"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in specialized mathematical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'well-dominated' is highly specialized and primarily used within the context of advanced mathematics, particularly category theory. Understanding its meaning requires familiarity with concepts such as dominance structures, subobject classifiers, and the general framework of categorical logic. It is not typically encountered outside of this specific mathematical domain.","priority":"★★★"},"example_sentences":[{"sentence":"The category of sets is a classic example of a **well-dominated** category.","translation":"集合の圏は、十分に支配された圏の典型的な例である。","type":"adjective","meaning_category":"数学における十分な支配構造を持つ"},{"sentence":"In a **well-dominated** topos, the subobject classifier plays a crucial role in defining logical operations.","translation":"十分に支配されたトポスでは、部分対象分類子が論理演算を定義する上で重要な役割を果たす。","type":"adjective","meaning_category":"数学における適切な支配構造を持つ"}]}