{"word":"endophyte","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"内生菌、植物内生菌","english_definition":"A plant, especially a bacterium or fungus, that lives inside another plant.","examples":[{"sentence":"Endophytes can help plants resist disease.","translation":"内生菌は植物が病気に抵抗するのを助けることができる。"},{"sentence":"Some endophytes produce toxins that deter herbivores.","translation":"一部の内生菌は、草食動物を阻止する毒素を生成する。"}],"collocations":["fungal endophyte","bacterial endophyte","plant endophyte","endophyte community","endophyte diversity","endophyte colonization"],"synonyms":["intracellular symbiont","plant symbiont"],"antonyms":[]}],"etymology":{"value":"From the Greek words \"endon\" (within) and \"phyton\" (plant).","priority":"★★☆"},"pronunciation":{"ipa":"ˈɛndoʊfaɪt","syllables":"en-do-phyte"},"inflection":{"noun_plural":"endophytes"},"usage_notes":{"explanation":"Endophytes are microorganisms that live within plant tissues without causing apparent harm to the host plant. They can be bacteria or fungi, and they often provide benefits to the plant, such as increased resistance to stress, improved nutrient uptake, or protection from pests and diseases.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The endophyte was living on the plant.","correct":"✓ The endophyte was living in the plant.","note":"Endophytes live inside plant tissues, so use \"in\" instead of \"on\"."}],"priority":"★☆☆"},"related_words":{"derivatives":["endophytic (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"endophyte\" refers to a plant, bacterium, or fungus that lives inside another plant. These organisms often have a symbiotic relationship with their host, meaning that they both benefit from the interaction. Endophytes can help plants resist disease, improve nutrient uptake, or protect against pests. The study of endophytes is important in agriculture and ecology."},"example_sentences":[{"sentence":"Researchers are studying the potential of endophytes to improve crop yields.","translation":"研究者たちは、内生菌が作物の収量を改善する可能性について研究している。","type":"general","meaning_category":"general"},{"sentence":"The grass species is known to harbor a variety of fungal endophytes.","translation":"そのイネ科植物は、さまざまな真菌内生菌を宿していることで知られている。","type":"specific","meaning_category":"specific"},{"sentence":"Certain endophytes can enhance a plant's tolerance to drought stress.","translation":"特定の植物内生菌は、植物の干ばつストレスに対する耐性を高めることができる。","type":"scientific","meaning_category":"scientific"}]}