{"word":"Bonus","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ボーナス、賞与、特別手当","english_definition":"An extra amount of money given as a reward or incentive in addition to a regular salary or wage.","examples":[{"sentence":"She received a Christmas bonus from her employer.","translation":"彼女は雇用主からクリスマスボーナスを受け取った。"},{"sentence":"The company offers performance-based bonuses.","translation":"その会社は業績に基づいたボーナスを提供している。"},{"sentence":"He got a bonus for exceeding his sales targets.","translation":"彼は販売目標を超えたため、ボーナスをもらった。"}],"collocations":["Christmas bonus (クリスマスボーナス)","performance bonus (業績ボーナス)","signing bonus (契約ボーナス)","year-end bonus (年末ボーナス)"],"synonyms":["reward","incentive","premium","gratuity","perk"],"antonyms":["penalty","deduction"]},{"part_of_speech":"noun","definition":"(ゲームなどの)ボーナス、特典、追加点","english_definition":"Something welcome and often unexpected that is received in addition to what was expected or due.","examples":[{"sentence":"The game includes a bonus level for skilled players.","translation":"そのゲームには、熟練したプレイヤーのためのボーナスレベルが含まれている。"},{"sentence":"As a bonus, the hotel offered free breakfast.","translation":"特典として、ホテルは無料の朝食を提供した。"},{"sentence":"The software has a bonus feature that allows you to customize the interface.","translation":"そのソフトウェアには、インターフェースをカスタマイズできるボーナス機能がある。"}],"collocations":["bonus points (ボーナスポイント)","bonus level (ボーナスレベル)","bonus feature (ボーナス機能)","as a bonus (おまけに、特典として)"],"synonyms":["extra","perk","advantage","addition","plus"],"antonyms":["disadvantage","drawback"]},{"part_of_speech":"adjective","definition":"ボーナスの、追加の、特典の","english_definition":"Providing or being an extra benefit or advantage.","examples":[{"sentence":"The company offered bonus shares to its employees.","translation":"会社は従業員に追加の株式を提供した。"},{"sentence":"We received a bonus discount on our purchase.","translation":"購入時にボーナス割引を受けました。"},{"sentence":"This product comes with a bonus gift.","translation":"この製品にはボーナスギフトが付属しています。"}],"collocations":["bonus shares (ボーナス株式)","bonus discount (ボーナス割引)","bonus gift (ボーナスギフト)"],"synonyms":["additional","extra","supplementary"],"antonyms":["standard","regular"]}],"etymology":{"value":"The word \"bonus\" comes directly from Latin, where it means \"good.\" It was adopted into English to refer to something good that is received in addition to what is expected or required.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈboʊnəs/","syllables":"bo-nus"},"inflection":{"noun_plural":"bonuses"},"usage_notes":{"explanation":"The term \"bonus\" typically refers to something extra or additional that is received, often as a reward or incentive. It can apply to financial compensation, such as a year-end bonus at work, or to extra features or advantages, such as a bonus level in a video game. The context usually makes it clear whether the term is referring to money, benefits, or features.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I received a bonusses this year.","correct":"✓ I received bonuses this year.","note":"The plural of \"bonus\" is \"bonuses,\" not \"bonusses.\""},{"incorrect":"✗ He got a bonus because of he worked hard.","correct":"✓ He got a bonus because he worked hard.","note":"Avoid unnecessary prepositions like \"of\" after \"because.\""},{"incorrect":"✗ The bonus is very good to motivate employees.","correct":"✓ The bonus is very good for motivating employees.","note":"Use the preposition \"for\" to indicate the purpose or benefit of something."}],"priority":"★★☆"},"related_words":{"derivatives":["bonused (adjective: having received a bonus)"],"phrases":["signing bonus (契約ボーナス)","performance bonus (業績ボーナス)","year-end bonus (年末ボーナス)"],"priority":"★★★"},"level_frequency":{"CEFR":"B1","frequency_google_ngram":"Relatively frequent.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"The word \"bonus\" is commonly used to describe something extra that you get, usually money or a special feature. It's often used in workplaces to describe extra pay for good work, like a \"Christmas bonus.\" It can also refer to extra things in games or products, like a \"bonus level\" or a \"bonus gift.\" It's a fairly common word and easy to understand in most contexts."},"example_sentences":[{"sentence":"The company gave each employee a generous year-end bonus.","translation":"会社は各従業員に寛大な年末ボーナスを与えた。","type":"noun","meaning_category":"Financial reward"},{"sentence":"As a bonus, the software includes a free antivirus program.","translation":"特典として、そのソフトウェアには無料のアンチウイルスプログラムが含まれている。","type":"noun","meaning_category":"Additional feature"},{"sentence":"He was motivated to work harder by the possibility of earning a bonus.","translation":"彼はボーナスを獲得できる可能性に動機づけられ、より一生懸命働いた。","type":"noun","meaning_category":"Incentive"},{"sentence":"The game has several hidden bonus levels that are difficult to find.","translation":"そのゲームには、見つけるのが難しい隠されたボーナスレベルがいくつかある。","type":"noun","meaning_category":"Game feature"},{"sentence":"The bonus shares were a welcome addition to their investment portfolio.","translation":"ボーナス株式は、彼らの投資ポートフォリオへの歓迎すべき追加となった。","type":"adjective","meaning_category":"Additional benefit"}]}