{"word":"gestatory","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"妊娠の、妊娠に関する","english_definition":"relating to or denoting gestation or pregnancy.","examples":[{"sentence":"The gestatory period for humans is approximately nine months.","translation":"人間の妊娠期間は約9ヶ月です。"},{"sentence":"Gestatory diabetes requires careful monitoring.","translation":"妊娠糖尿病は注意深いモニタリングが必要です。"}],"collocations":["gestatory period","gestatory diabetes","gestatory age"],"synonyms":["pregnant","gravid","expectant","prenatal"],"antonyms":["nonpregnant"]}],"etymology":{"value":"Derived from the Latin word \"gestare,\" meaning \"to carry\" or \"bear,\" referring to the carrying of a fetus during pregnancy.","priority":"★★☆"},"pronunciation":{"ipa":"ˈdʒɛstəˌtɔri","syllables":"ges-ta-to-ry"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term \"gestatory\" is primarily used in medical and scientific contexts to describe conditions, processes, or periods related to pregnancy. It is not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She has a gestatory baby.","correct":"✓ She is gestating a baby. / ✓ She is pregnant.","note":"\"Gestatory\" describes the state or period of pregnancy, not the baby itself. Use \"gestating\" to describe the process or \"pregnant\" to describe the state of the mother."}],"priority":"★☆☆"},"related_words":{"derivatives":["gestation (noun: the process of carrying a fetus in the womb)","gestate (verb: to carry a fetus in the womb during pregnancy)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in specialized medical or scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"gestatory\" is a technical term primarily used in medical or biological contexts. It refers to the period of gestation, or pregnancy. Due to its specific and somewhat uncommon usage, it is generally encountered in advanced texts or discussions related to these fields. Understanding the root word \"gestation\" is helpful in grasping its meaning.","priority":"★☆☆"},"example_sentences":[{"sentence":"The researchers studied the effects of certain drugs on the gestatory development of mice.","translation":"研究者たちは、特定の薬物がマウスの妊娠中の発育に及ぼす影響を研究した。","type":"adjective","meaning_category":"妊娠の、妊娠に関する"},{"sentence":"Proper nutrition is crucial during the gestatory period.","translation":"適切な栄養は妊娠期間中に非常に重要です。","type":"adjective","meaning_category":"妊娠の、妊娠に関する"}]}