{"word":"summable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"合計可能な、総和を求められる","english_definition":"Capable of being summed; having a finite sum.","examples":[{"sentence":"The sequence is summable because the sum of its absolute values converges.","translation":"その数列は、絶対値の和が収束するため、合計可能です。"},{"sentence":"A summable function is one for which the integral of its absolute value is finite.","translation":"合計可能な関数とは、その絶対値の積分が有限である関数です。"}],"collocations":["summable sequence (合計可能な数列)","summable function (合計可能な関数)"],"synonyms":["integrable (積分可能な)","convergent (収束する)"],"antonyms":["non-summable (合計不可能な)","divergent (発散する)"]}],"etymology":{"value":"From 'sum' + '-able'.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈsʌməbəl/","syllables":"sum-ma-ble"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more summable' and 'most summable' respectively, though these are rarely used."},"usage_notes":{"explanation":"'Summable' is a term primarily used in mathematics, especially in real analysis and functional analysis. It describes a sequence or function whose sum or integral (respectively) exists and is finite. It is often used in the context of infinite series and integrals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The data is summable to find the average.","correct":"✓ The data can be summed to find the average.","note":"'Summable' describes the property of a sequence or function, not the action of summing. Use 'can be summed' or 'can be added' for the action."}],"priority":"☆☆☆"},"related_words":{"derivatives":["sum (名詞、動詞)","summation (名詞)","summability (名詞)"],"related_concepts":["convergence (収束)","divergence (発散)","series (数列)","integral (積分)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in mathematical contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Summable' is a technical term used in advanced mathematics. It describes a sequence or function that, when its terms are added together (in the case of a sequence) or integrated (in the case of a function), results in a finite value. This concept is important in areas like real analysis and functional analysis. It is not a word used in everyday conversation."},"example_sentences":[{"sentence":"The Fourier series of a square-integrable function is summable in the mean.","translation":"二乗可積分関数のフーリエ級数は、平均収束の意味で合計可能です。","type":"adjective","meaning_category":"合計可能な (数学)"},{"sentence":"A sequence is summable if the limit of its partial sums exists and is finite.","translation":"数列の部分和の極限が存在し、有限である場合、その数列は合計可能です。","type":"adjective","meaning_category":"合計可能な (数学)"}]}