{"word":"emaciatedly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"やつれて、衰弱して、骨と皮ばかりになって","english_definition":"In an emaciated manner; in a way that is abnormally thin or weak, especially because of illness or a lack of food.","examples":[{"sentence":"The stray dog wandered the streets, emaciatedly searching for food.","translation":"その野良犬は、やつれた様子で食べ物を探して通りをさまよっていた。"},{"sentence":"The prisoner looked emaciatedly at the camera, a stark reminder of the harsh conditions.","translation":"囚人はやつれた様子でカメラを見つめ、過酷な状況を痛烈に思い出させた。"}],"collocations":["look emaciatedly","appear emaciatedly","walk emaciatedly"],"synonyms":["thinly","weakly","gauntly","scrawnily","skinnyly"],"antonyms":["healthily","robustly","stoutly","plumply"]}],"etymology":{"value":"Derived from the adjective 'emaciated' by adding the suffix '-ly'. 'Emaciated' comes from the Latin 'emaciare', meaning 'to make lean'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈmeɪʃieɪtɪdli/","syllables":"e-ma-ci-at-ed-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Emaciatedly' describes the manner in which an action is performed, emphasizing the thin and weak state of the subject. It is often used to evoke a sense of pity or concern. The word is relatively uncommon.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The model posed emaciatedly for the camera, promoting an unhealthy body image.","correct":"✓ The model posed in an emaciated manner for the camera, promoting an unhealthy body image.","note":"While 'emaciatedly' is a valid word, using the phrase 'in an emaciated manner' can sometimes sound more natural and avoid awkward phrasing. However, in the corrected sentence, it would be better to avoid the word altogether due to the negative connotation."}],"priority":"★★☆"},"related_words":{"derivatives":["emaciate (verb: to make abnormally thin or weak)","emaciated (adjective: abnormally thin or weak)","emaciation (noun: the state of being abnormally thin or weak)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Emaciatedly' is an advanced adverb describing the manner of an action, emphasizing extreme thinness and weakness, often due to illness or lack of food. It is not a commonly used word and is more likely to appear in formal writing or literature. Understanding the root word 'emaciated' is helpful for comprehending its meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The refugees, having walked for days without food, moved emaciatedly towards the aid station.","translation":"難民たちは、何日も食べ物なしで歩き続け、やつれた様子で救援所に向かった。","type":"adverb","meaning_category":"manner"},{"sentence":"The patient, weakened by the disease, coughed emaciatedly into a handkerchief.","translation":"患者は病気で弱り、やつれた様子でハンカチに咳をした。","type":"adverb","meaning_category":"manner"}]}