{"word":"defeminize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"女性らしさを奪う、女性らしさをなくす、男性化する","english_definition":"To remove or reduce feminine characteristics or qualities from (someone or something); to make masculine.","examples":[{"sentence":"The author was accused of defeminizing the female characters in his novel.","translation":"その作家は、小説の女性キャラクターから女性らしさを奪っていると非難された。"},{"sentence":"Some argue that certain social trends are defeminizing women.","translation":"特定の社会的な傾向が女性から女性らしさを奪っていると主張する人もいる。"},{"sentence":"He tried to defeminize his voice to sound more authoritative.","translation":"彼はより権威的に聞こえるように、自分の声から女性らしさをなくそうとした。"}],"collocations":["defeminize someone's appearance (外見から女性らしさを奪う)","defeminize a role (役割から女性らしさを奪う)"],"synonyms":["masculinize","emasculate","desexualize"],"antonyms":["feminize"]},{"part_of_speech":"verb","transitivity":"vi","definition":"女性らしさがなくなる、男性化する","english_definition":"To lose feminine characteristics or qualities; to become masculine.","examples":[{"sentence":"Over time, her style defeminized as she adopted a more practical approach to clothing.","translation":"時が経つにつれて、彼女の服装はより実用的なアプローチを採用するにつれて、女性らしさがなくなった。"}],"collocations":[],"synonyms":["masculinize","become masculine"],"antonyms":["feminize"]}],"etymology":{"value":"de- (除去) + feminize (女性化する)","priority":"★★★"},"pronunciation":{"ipa":"/diːˈfɛmɪnaɪz/","syllables":"de-fem-i-nize"},"inflection":{"verb_forms":{"present_simple":["defeminize","defeminizes"],"past_simple":"defeminized","past_participle":"defeminized","present_participle":"defeminizing"}},"usage_notes":{"explanation":"\"Defeminize\" is often used in discussions about gender roles, representation in media, and societal expectations. It can carry negative connotations when it implies a devaluation of femininity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He defeminized by cutting his hair short.","correct":"✓ He defeminized his appearance by cutting his hair short.","note":"Defeminize is often transitive, requiring a direct object (what is being defeminized)."},{"incorrect":"✗ The defeminize of women in the workplace is a problem.","correct":"✓ The defeminization of women in the workplace is a problem.","note":"The noun form is 'defeminization'."}],"priority":"★★☆"},"related_words":{"derivatives":["defeminization (名詞: 女性らしさを奪うこと、男性化)"],"phrasal_verbs":[],"related_terms":["feminize","masculinize","gender","gender roles"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Defeminize' is a relatively uncommon word used to describe the process of removing or reducing feminine qualities or characteristics. It's often used in academic or critical contexts when discussing gender, representation, and societal expectations. The word can imply a negative judgment about femininity, so it should be used carefully."},"example_sentences":[{"sentence":"The director chose to defeminize the character to make her seem stronger.","translation":"監督は、そのキャラクターをより強く見せるために、彼女から女性らしさを奪うことを選択した。","type":"verb (vt)","meaning_category":"女性らしさを奪う"},{"sentence":"Some critics argue that the new uniform policy defeminizes the female officers.","translation":"一部の批評家は、新しい制服規定が女性警官から女性らしさを奪っていると主張している。","type":"verb (vt)","meaning_category":"女性らしさを奪う"},{"sentence":"Her style gradually defeminized as she focused more on her career.","translation":"彼女のスタイルは、キャリアに集中するにつれて徐々に女性らしさがなくなった。","type":"verb (vi)","meaning_category":"女性らしさがなくなる"}]}