{"word":"documentarse","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"(再帰動詞) 文書で証明する、証拠立てる、裏付ける","english_definition":"(reflexive verb) to document oneself; to gather information or evidence about something; to research thoroughly.","examples":[{"sentence":"Antes de escribir el artículo, debes documentarte bien sobre el tema.","translation":"記事を書く前に、そのテーマについてよく調べて文書で裏付けるべきだ。","type":"example"},{"sentence":"El abogado se documentó exhaustivamente para el juicio.","translation":"弁護士は裁判のために徹底的に資料を集めて裏付けた。","type":"example"},{"sentence":"Es importante documentarse antes de tomar una decisión importante.","translation":"重要な決定を下す前に、資料を集めて裏付けることが重要だ。","type":"example"}],"collocations":["documentarse sobre algo (～について調べる)","documentarse para un juicio (裁判のために調べる)","documentarse exhaustivamente (徹底的に調べる)"],"synonyms":["informarse","investigar","estudiar","recopilar información","recabar datos"],"antonyms":["desinformarse","ignorar"],"related_words":["documento (document)","documentación (documentation)","documentado (documented)"]}],"etymology":{"value":"Derives from the verb 'documentar' (to document) with the reflexive pronoun 'se'. 'Documentar' comes from the Latin 'documentum' (proof, lesson).","priority":"N/A"},"pronunciation":{"ipa":"/do.ku.menˈtaɾ.se/","syllables":"do-cu-men-tar-se"},"inflection":{"verb_forms":{"present_simple":["me documento","te documentas","se documenta","nos documentamos","os documentáis","se documentan"],"present_subjunctive":["me documente","te documentes","se documente","nos documentemos","os documentéis","se documenten"],"past_participle":"documentado"},"notes":"This is a reflexive verb, so it requires reflexive pronouns (me, te, se, nos, os, se)."},"usage_notes":{"explanation":"'Documentarse' is a reflexive verb that implies a thorough process of gathering information, researching, and collecting evidence about a specific topic. It suggests a proactive effort to become well-informed before making a decision, writing something, or participating in a debate. The verb emphasizes the importance of having solid evidence and a strong understanding of the subject matter.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ Yo documento sobre el tema.","correct":"✓ Yo me documento sobre el tema.","note":"Since 'documentarse' is a reflexive verb, the reflexive pronoun 'me' is necessary."},{"incorrect":"✗ Documentar sobre el tema.","correct":"✓ Documentarse sobre el tema.","note":"The infinitive form must include the reflexive pronoun 'se'."}],"priority":"N/A"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Moderate","priority":"N/A"},"readability_explanation":{"level":"B2","text":"'Documentarse' is a verb used to describe the action of gathering information and evidence about a topic. It is a reflexive verb, so it requires a reflexive pronoun. It is commonly used in academic, professional, and journalistic contexts to emphasize the importance of being well-informed before making a decision or expressing an opinion. It implies a thorough and systematic approach to research."},"example_sentences":[{"sentence":"Los periodistas deben documentarse antes de publicar una noticia.","translation":"Journalists must research before publishing a news story.","type":"example"},{"sentence":"Para el trabajo de investigación, es necesario documentarse en varias fuentes.","translation":"For the research paper, it is necessary to research in various sources.","type":"example"},{"sentence":"Antes de invertir en la bolsa, debes documentarte sobre las empresas.","translation":"Before investing in the stock market, you must research the companies.","type":"example"}]}