{"word":"Fondak","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Slang, derogatory) A person who is considered foolish, inept, or socially awkward.","english_definition":"A derogatory slang term for someone considered foolish, inept, or socially awkward.","examples":[{"sentence":"Don't be such a fondak, you're embarrassing yourself.","translation":"そんな間抜けなことするな、恥ずかしいぞ。"},{"sentence":"He's a total fondak, always messing things up.","translation":"彼はどうしようもない間抜けで、いつも物事をめちゃくちゃにする。"}],"collocations":["total fondak","complete fondak"],"synonyms":["fool","idiot","moron","klutz","dork","nerd"],"antonyms":["genius","expert","professional"]}],"etymology":{"value":"Origin is uncertain, possibly a Yiddish or Eastern European slang term.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈfɒndæk/","syllables":"Fon-dak"},"inflection":{"noun_plural":"fondaks"},"usage_notes":{"explanation":"'Fondak' is a derogatory slang term, and its use is generally considered offensive. It is used to insult someone by implying they are foolish or incompetent.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is very fondak of her.","correct":"✗ N/A (Fondak is not used in this context.)","note":"'Fondak' is a noun, not an adjective, and cannot be used to describe someone's feelings towards another person."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Fondak' is a highly informal and derogatory slang term, rarely encountered in standard English. Understanding its meaning requires familiarity with slang and potentially Yiddish or Eastern European cultural contexts. Its use should be avoided in formal or polite settings."},"example_sentences":[{"sentence":"Stop acting like a fondak and get the job done right.","translation":"間抜けな真似はやめて、ちゃんと仕事をしろ。","type":"noun","meaning_category":"derogatory term"},{"sentence":"He tripped and spilled his drink, what a fondak.","translation":"彼はつまずいて飲み物をこぼした、なんて間抜けなんだ。","type":"noun","meaning_category":"derogatory term"}]}