{"word":"itemized","priority":"☆☆☆","meanings":[{"part_of_speech":"verb (past participle)","definition":"明細書を作成された、項目別にされた","english_definition":"presented as a list of individual items; broken down into specific details.","examples":[{"sentence":"The bill was itemized, showing each charge separately.","translation":"請求書は項目別に記載され、各料金が個別に示されていました。"},{"sentence":"We received an itemized list of expenses for the trip.","translation":"旅行の費用明細書を受け取りました。"}],"collocations":["itemized bill","itemized list","itemized receipt","itemized statement"],"synonyms":["detailed","specified","enumerated","listed","categorized"],"antonyms":["summarized","aggregated","lumped together"]},{"part_of_speech":"adjective","definition":"項目別になっている、明細が記載されている","english_definition":"presented in the form of a list of individual items with details.","examples":[{"sentence":"An itemized invoice is easier to understand.","translation":"項目別の請求書は理解しやすいです。"},{"sentence":"The itemized budget provided a clear picture of where the money was going.","translation":"項目別の予算は、お金がどこに使われているかを明確に示していました。"}],"collocations":["itemized invoice","itemized budget","itemized deductions"],"synonyms":["detailed","specific","particularized","individualized"],"antonyms":["general","broad","unspecified"]}],"etymology":{"value":"The word \"itemized\" comes from the verb \"itemize,\" which originated in the late 19th century.  It is formed from the word \"item\" (meaning a single thing in a list or collection) and the suffix \"-ize\" (meaning to make or treat in a specified way). Thus, \"itemize\" means to list or specify items individually.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈaɪtəmaɪzd/","syllables":"I-tem-ized"},"inflection":{"notes":"This is the past participle form of the verb \"itemize\" and can also function as an adjective."},"usage_notes":{"explanation":"\"Itemized\" is used to describe something that has been broken down into individual components or items, usually in a list format. It is commonly used in financial contexts (bills, invoices, budgets) to provide a clear and detailed breakdown of costs or expenses. The emphasis is on clarity and transparency, allowing the reader to see exactly what each item is and how much it costs.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"The itemized were on the table.","correct":"The itemized bill was on the table.","note":"\"Itemized\" functions as an adjective or a past participle. It needs to modify a noun (like \"bill,\" \"list,\" etc.) or be part of a verb phrase (e.g., \"The bill was itemized\")."},{"incorrect":"I itemized the bill. Now it is itemizeding.","correct":"I itemized the bill. Now it is itemized.","note":"The correct form to describe the state of being itemized is the past participle \"itemized,\" not a made-up present participle like \"itemizeding.\""}],"priority":"☆☆☆"},"related_words":{"derivatives":["itemize (verb)","itemization (noun)","item (noun)"],"phrasal_verbs":[],"related_concepts":["budgeting","accounting","finance","inventory","cataloging"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"The word 'itemized' means that something has been broken down into a list of individual parts. You'll often see it in financial documents, like bills or invoices, where each charge or expense is listed separately. It helps you understand exactly what you're paying for. For example, an itemized grocery list would show the price of each item you bought, rather than just a total amount."},"example_sentences":[{"sentence":"The hotel provided an itemized bill at checkout.","translation":"ホテルはチェックアウト時に項目別の請求書を提供しました。","type":"adjective","meaning_category":"detailed"},{"sentence":"All deductions must be itemized on your tax return.","translation":"すべての控除は納税申告書に項目別に記載する必要があります。","type":"adjective","meaning_category":"specified"},{"sentence":"The expenses were carefully itemized for the audit.","translation":"監査のために費用は注意深く項目別にされました。","type":"verb (past participle)","meaning_category":"listed"}]}