{"word":"tear-composed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"涙で構成された、涙で満たされた、涙でできた","english_definition":"Made of or characterized by tears.","examples":[{"sentence":"Her face was tear-composed after hearing the sad news.","translation":"悲しい知らせを聞いた後、彼女の顔は涙でいっぱいだった。"},{"sentence":"The poem described a tear-composed landscape of sorrow.","translation":"その詩は、悲しみの涙で構成された風景を描写していた。"}],"collocations":["tear-composed face","tear-composed eyes","tear-composed poem"],"synonyms":["lachrymose","tearful","weepy","sad","sorrowful"],"antonyms":["joyful","happy","cheerful"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'tear' (referring to the liquid secreted from the eyes) with 'composed' (meaning made up of or characterized by).","priority":"N/A"},"pronunciation":{"ipa":"/ˈtɪər kəmˈpoʊzd/","syllables":"tear-com-posed"},"inflection":{"adjective_forms":{"comparative":"more tear-composed","superlative":"most tear-composed"}},"usage_notes":{"explanation":"'Tear-composed' is a descriptive adjective that suggests something is either made of tears or heavily influenced or characterized by tears. It is not a commonly used word, and may sound somewhat poetic or literary. It is often used to describe faces, eyes, or artistic works that express deep sorrow or sadness.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The tear-composed house was beautiful.","correct":"✓ The house was filled with tearful people.","note":"'Tear-composed' is typically used to describe something directly related to tears, such as a face or eyes, not a house. In this case, 'tearful' would be more appropriate."}],"priority":"N/A"},"related_words":{"derivatives":["tear (noun)","composed (adjective)","teardrop (noun)","tearful (adjective)","teary (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - not a common word.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Tear-composed' is a relatively uncommon and sophisticated adjective. It is used to describe something that is made of tears or heavily influenced by tears. Due to its infrequent usage, it is more likely to be encountered in literary or poetic contexts. Understanding the meaning requires a good grasp of vocabulary and the ability to interpret figurative language."},"example_sentences":[{"sentence":"Her letter was a tear-composed apology, filled with remorse and regret.","translation":"彼女の手紙は涙で綴られた謝罪であり、後悔と自責の念に満ちていた。","type":"adjective","meaning_category":"characterized by tears"},{"sentence":"The artist created a tear-composed sculpture to represent the suffering of the refugees.","translation":"アーティストは、難民の苦しみを表現するために、涙で構成された彫刻を制作した。","type":"adjective","meaning_category":"made of tears"}]}