{"word":"degaussing","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"消磁","english_definition":"The process of decreasing or eliminating an unwanted magnetic field.","examples":[{"sentence":"Degaussing is often used to erase data on magnetic storage media.","translation":"消磁は、磁気記憶媒体上のデータを消去するためによく使用されます。"},{"sentence":"The degaussing of the ship was done to protect it from magnetic mines.","translation":"船の消磁は、磁気機雷から保護するために行われました。"}],"collocations":["magnetic degaussing","tape degaussing","hard drive degaussing"],"synonyms":["demagnetization"],"antonyms":["magnetization"]},{"part_of_speech":"verb","definition":"消磁する","english_definition":"To decrease or eliminate an unwanted magnetic field from something.","examples":[{"sentence":"The technician is degaussing the monitor to remove the color distortions.","translation":"技術者は、色の歪みを取り除くためにモニターを消磁しています。"},{"sentence":"We need to degauss the equipment before using it in the sensitive area.","translation":"機密エリアで使用する前に、機器を消磁する必要があります。"}],"collocations":["degauss a tape","degauss a hard drive","degauss a CRT monitor"],"synonyms":["demagnetize"],"antonyms":["magnetize"]}],"etymology":{"value":"The word 'degaussing' comes from the name of German mathematician and physicist Carl Friedrich Gauss, whose name is also the source of the unit of magnetic induction. The prefix 'de-' means 'removal of'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdiːˈɡaʊsɪŋ/","syllables":"de-gauss-ing"},"inflection":{"verb_forms":{"present_simple":["degauss","degausses"],"past_simple":"degaussed","past_participle":"degaussed","present_participle":"degaussing"},"noun_plural":"degaussings"},"usage_notes":{"explanation":"'Degaussing' refers to the process of reducing or eliminating magnetic fields. It's commonly used in the context of erasing data from magnetic storage devices or reducing magnetic signatures of ships to avoid detection.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to degause the hard drive.","correct":"✓ I'm going to degauss the hard drive.","note":"The correct spelling is 'degauss', not 'degause'."},{"incorrect":"✗ The degaussing is very quick. It only takes a moment.","correct":"✓ The degaussing process is very quick. It only takes a moment.","note":"'Degaussing' refers to the process itself. If you want to refer to the action, use 'degaussing process'."}],"priority":"★★☆"},"related_words":{"derivatives":["degausser"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Degaussing' is a technical term related to magnetism and data security. It refers to the process of reducing or eliminating a magnetic field. This term is often used in discussions about erasing data from hard drives or protecting ships from magnetic mines. Understanding this term requires some knowledge of physics and technology."},"example_sentences":[{"sentence":"The company uses a powerful degausser for secure data destruction through degaussing.","translation":"会社は、消磁による安全なデータ破壊のために強力な消磁器を使用しています。","type":"noun","meaning_category":"消磁"},{"sentence":"Before disposing of old hard drives, it's essential to degauss them to prevent data breaches.","translation":"古いハードドライブを廃棄する前に、データ漏洩を防ぐために消磁することが不可欠です。","type":"verb","meaning_category":"消磁する"}]}