{"word":"spittoon","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"痰壺、唾壺","english_definition":"a receptacle for spit.","examples":[{"sentence":"The old saloon had several spittoons scattered around the floor.","translation":"その古い酒場には、床のあちこちにいくつかの痰壺が散らばっていた。"},{"sentence":"He aimed his spit into the spittoon.","translation":"彼は痰壺に唾を吐き入れた。"}],"collocations":["brass spittoon","dental spittoon"],"synonyms":["cuspidor"],"antonyms":[]}],"etymology":{"value":"19世紀初頭に英語に入った単語で、フランス語の'crachoir'（唾を吐くための容器）に由来する。さらに遡ると、'cracher'（唾を吐く）という動詞にたどり着き、これは擬音語的な起源を持つ。","priority":"★★☆"},"pronunciation":{"ipa":"/spɪˈtuːn/","syllables":"spi-toon"},"inflection":{"noun_plural":"spittoons"},"usage_notes":{"explanation":"Spittoons were common in public places, especially in the 19th and early 20th centuries, to provide a sanitary way for people to spit, particularly those who chewed tobacco. They are now rarely seen except in historical settings or museums.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a spittoon as a vase.","correct":"✓ He used a vase as a spittoon. (unlikely but grammatically correct)","note":"Spittoons are designed for spitting, not for holding flowers. Using a vase as a spittoon is more plausible, though still unusual."}],"priority":"★☆☆"},"related_words":{"derivatives":["spit (verb/noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Very uncommon word)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"spittoon\" refers to a specific type of receptacle that was historically used for spitting, especially in public places. It is not a commonly used word in modern English, as the practice of using spittoons has largely disappeared. Therefore, understanding this word requires some knowledge of historical practices and vocabulary. It is more likely to be encountered in literature, historical texts, or museums.","priority":"★☆☆"},"example_sentences":[{"sentence":"The museum displayed a collection of antique spittoons.","translation":"その博物館には、アンティークの痰壺のコレクションが展示されていた。","type":"noun","meaning_category":"痰壺"},{"sentence":"In the old West, spittoons were a common sight in saloons.","translation":"古き良き西部時代には、酒場では痰壺はよく見かける光景だった。","type":"noun","meaning_category":"痰壺"}]}