{"word":"fictionalized","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"小説化された、脚色された、虚構化された","english_definition":"adapted into a fictional form, often based on real events or people but with added or altered details.","examples":[{"sentence":"The movie is a fictionalized account of the historical event.","translation":"その映画は、その歴史的出来事を小説化したものです。"},{"sentence":"She wrote a fictionalized biography of the famous artist.","translation":"彼女はその有名な芸術家の小説化された伝記を書いた。"},{"sentence":"The author admitted that the characters were fictionalized versions of people he knew.","translation":"著者は、登場人物が知っている人々を虚構化したものであることを認めた。"}],"collocations":["fictionalized account","fictionalized biography","fictionalized version","highly fictionalized","slightly fictionalized"],"synonyms":["imagined","fabricated","invented","dramatized","embellished"],"antonyms":["factual","nonfictional","documentary","historical","accurate"]},{"part_of_speech":"verb","definition":"fictionalizeの過去分詞、または形容詞的に使用","english_definition":"past participle of the verb 'fictionalize', also used as an adjective.","examples":[{"sentence":"The events were heavily fictionalized for dramatic effect.","translation":"出来事は劇的な効果のために大幅に脚色された。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Fictionalize' + '-ed'. 'Fictionalize' comes from 'fiction' + '-al' + '-ize'. 'Fiction' comes from Latin 'fictio', from 'fingere' meaning 'to shape, form, invent'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɪkʃənəˌlaɪzd/","syllables":"fic-tion-al-ized"},"inflection":{"notes":"This is the past participle form of the verb 'fictionalize' and also functions as an adjective."},"usage_notes":{"explanation":"'Fictionalized' describes something that started as real but has been changed or added to in order to make it a story. It implies that while there may be some truth to the original source, the version being presented is not entirely accurate. It's often used in the context of movies, books, and other forms of media.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The fictionalized story was based on true events, so it was completely factual.","correct":"✓ The fictionalized story was based on true events, but it contained many inaccuracies.","note":"'Fictionalized' implies that the story is not completely factual, even if it is based on true events."},{"incorrect":"✗ The documentary was fictionalized.","correct":"✓ The documentary used dramatic reenactments.","note":"Documentaries aim to be factual, so they are not usually 'fictionalized'. Instead, they might use dramatic reenactments to illustrate events."}],"priority":"★★☆"},"related_words":{"derivatives":["fictionalize (verb)","fiction (noun)","fictional (adjective)","fictionally (adverb)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Fictionalized' means that something has been made into a story, often based on real events but with changes or additions. It's used to describe accounts that are not entirely factual because they have been altered for dramatic or artistic purposes. This term is more common in discussions about literature, film, and historical narratives where the line between fact and fiction is blurred."},"example_sentences":[{"sentence":"The novel is a fictionalized version of the author's childhood.","translation":"その小説は、著者の子供時代を小説化したものです。","type":"adjective","meaning_category":"小説化された"},{"sentence":"The historical drama heavily fictionalized the events to create a more compelling narrative.","translation":"その歴史ドラマは、より魅力的な物語を作り出すために、出来事を大幅に脚色した。","type":"adjective","meaning_category":"脚色された"},{"sentence":"The play presented a fictionalized account of the queen's life.","translation":"その劇は、女王の生涯を虚構化したものでした。","type":"adjective","meaning_category":"虚構化された"}]}