{"word":"immunizzarsi","priority":"N/A","meanings":[{"part_of_speech":"verb","transitivity":"v rifl","definition":"免疫を獲得する、免疫をつける、予防接種を受ける","english_definition":"to become immune; to get vaccinated; to immunize oneself","examples":[{"sentence":"È importante immunizzarsi contro l'influenza ogni anno.","translation":"毎年インフルエンザの予防接種を受けることが重要です。"},{"sentence":"Dopo aver avuto la malattia, si è immunizzato naturalmente.","translation":"病気にかかった後、彼は自然に免疫を獲得しました。"},{"sentence":"Per viaggiare in alcuni paesi, è necessario immunizzarsi contro determinate malattie.","translation":"一部の国に旅行するには、特定の病気に対する予防接種を受ける必要があります。"}],"collocations":["immunizzarsi contro l'influenza (インフルエンザの予防接種を受ける)","immunizzarsi naturalmente (自然に免疫を獲得する)","immunizzarsi con un vaccino (ワクチンで免疫をつける)"],"synonyms":["vaccinarsi","proteggersi","difendersi"],"antonyms":["ammalarsi","infettarsi"]}],"etymology":{"value":"Dal verbo 'immunizzare' con l'aggiunta del pronome riflessivo '-si'. 'Immunizzare' deriva dal latino 'immunis', che significa 'esente da obblighi, libero da tasse', poi esteso al significato di 'protetto da malattie'.","priority":"N/A"},"pronunciation":{"ipa":"/immunidˈdzarsi/","syllables":"im-mu-niz-zar-si"},"inflection":{"verb_forms":{"presente":"mi immunizzo, ti immunizzi, si immunizza, ci immunizziamo, vi immunizzate, si immunizzano","passato_prossimo":"mi sono immunizzato/a, ti sei immunizzato/a, si è immunizzato/a, ci siamo immunizzati/e, vi siete immunizzati/e, si sono immunizzati/e","imperfetto":"mi immunizzavo, ti immunizzavi, si immunizzava, ci immunizzavamo, vi immunizzavate, si immunizzavano","futuro_semplice":"mi immunizzerò, ti immunizzerai, si immunizzerà, ci immunizzeremo, vi immunizzerete, si immunizzeranno","congiuntivo_presente":"che io mi immunizzi, che tu ti immunizzi, che lui si immunizzi, che noi ci immunizziamo, che voi vi immunizzate, che loro si immunizzino","condizionale_presente":"mi immunizzerei, ti immunizzeresti, si immunizzerebbe, ci immunizzeremmo, vi immunizzereste, si immunizzerebbero","imperativo":"immunizzati (tu), immunizzatevi (voi)"}},"usage_notes":{"explanation":"'Immunizzarsi' è un verbo riflessivo che indica l'azione di rendersi immuni a una malattia, sia attraverso la vaccinazione che attraverso l'esposizione naturale alla malattia. Il pronome riflessivo '-si' è essenziale per indicare che l'azione è compiuta dal soggetto su se stesso.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"immunizzare","correct":"immunizzarsi","note":"'Immunizzare' è un verbo transitivo (immunizzare qualcuno), mentre 'immunizzarsi' è riflessivo (immunizzare se stessi)."},{"incorrect":"immunirsi","correct":"immunizzarsi","note":"'Immunirsi' è un verbo esistente, ma meno comune e con una sfumatura leggermente diversa (dotarsi di immunità). 'Immunizzarsi' è più specifico per l'azione di vaccinarsi o diventare immune. "}],"priority":"N/A"},"related_words":{"derivatives":["immunizzazione (immunization)","immune (immune)","immunità (immunity)","vaccino (vaccine)","vaccinazione (vaccination)"],"phrases":["campagna di immunizzazione (immunization campaign)"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relativamente frequente in contesti medici e scientifici.","priority":"N/A"},"readability_explanation":{"level":"B2","text":"Il verbo 'immunizzarsi' è utilizzato in contesti medici e scientifici per descrivere il processo di acquisizione dell'immunità a una malattia. È un verbo riflessivo, quindi richiede il pronome riflessivo ('mi', 'ti', 'si', 'ci', 'vi', 'si'). La comprensione del termine è importante per la lettura di articoli scientifici, notizie relative alla salute pubblica e per la comunicazione con professionisti sanitari."},"example_sentences":[{"sentence":"I bambini devono immunizzarsi contro il morbillo.","translation":"Children need to be immunized against measles.","type":"general","meaning_category":"vaccination"},{"sentence":"La popolazione si sta immunizzando grazie alla campagna vaccinale.","translation":"The population is becoming immune thanks to the vaccination campaign.","type":"general","meaning_category":"vaccination"},{"sentence":"È possibile immunizzarsi naturalmente dopo aver contratto la varicella.","translation":"It is possible to become naturally immune after contracting chickenpox.","type":"general","meaning_category":"natural immunity"}]}