{"word":"fawningly","priority":"★★★","meanings":[{"part_of_speech":"adverb","definition":"追従的に、媚びへつらって、おべっかを使って","english_definition":"in an excessively flattering or submissive manner; obsequiously.","examples":[{"sentence":"He behaved fawningly towards his boss, hoping for a promotion.","translation":"彼は昇進を期待して、上司に媚びへつらうように振る舞った。"},{"sentence":"She smiled fawningly at the celebrity, eager to get an autograph.","translation":"彼女はサインをもらいたくて、その有名人におべっか笑いを浮かべた。"},{"sentence":"The waiter attended to the wealthy customers fawningly.","translation":"ウェイターは金持ちの客に追従的に接した。"}],"collocations":["behave fawningly","smile fawningly","attend fawningly"],"synonyms":["obsequiously","sycophantically","subserviently","servilely","ingratiatingly","flatteringly","smarmily","slavishly"],"antonyms":["honestly","sincerely","genuinely","authentically","frankly","candidly"]}],"etymology":{"value":"The word \"fawningly\" comes from the verb \"fawn,\" which originates from Old English *fagian, meaning \"to rejoice, flatter.\" The suffix \"-ing\" turns it into a present participle, and \"-ly\" transforms it into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɔːnɪŋli/","syllables":"fawn-ing-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"\"Fawningly\" describes an action done in a way that is excessively flattering or submissive, often with the intention of gaining favor or advantage. It implies insincerity and a lack of genuine respect. The behavior is often seen as exaggerated and transparent in its attempt to please.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was fawningly honest.","correct":"✓ He was being fawningly polite.","note":"\"Fawningly\" implies insincerity, so it cannot be used with words like \"honest\" or \"genuine.\" It should be paired with actions or behaviors that can be exaggerated or insincere, such as \"polite,\" \"attentive,\" or \"complimentary.\""},{"incorrect":"✗ She fawningly her boss.","correct":"✓ She fawned over her boss.","note":"\"Fawningly\" is an adverb, so it modifies a verb. The verb form is \"fawn,\" often used with the preposition \"over\" to indicate excessive attention and flattery directed towards someone."}],"priority":"★★☆"},"related_words":{"derivatives":["fawn (verb, noun)","fawning (adjective)"],"idioms_phrases":["fawn over someone"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"fawningly\" is used to describe behavior that is excessively flattering and submissive, often in a way that seems insincere. It's a more advanced word, so you'll typically find it in more sophisticated writing or speech. If someone is acting \"fawningly,\" they are trying very hard to please someone, often to gain an advantage, and their behavior may seem exaggerated or artificial.","priority":"★★☆"},"example_sentences":[{"sentence":"The intern spoke fawningly of the CEO's leadership skills.","translation":"インターンはCEOのリーダーシップスキルについて、追従的に語った。","type":"adverb","meaning_category":"excessively flattering"},{"sentence":"He followed the celebrity around fawningly, hoping for a photo opportunity.","translation":"彼は写真撮影の機会を期待して、その有名人の後を媚びへつらいながらついて回った。","type":"adverb","meaning_category":"submissive manner"},{"sentence":"The sales representative greeted the potential client fawningly.","translation":"その営業担当者は、見込み客に媚びへつらうように挨拶した。","type":"adverb","meaning_category":"ingratiatingly"}]}