{"word":"criterional","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"基準の、標準の、判断基準に関する","english_definition":"Relating to or based on a criterion or criteria; serving as a standard or benchmark for judgment.","examples":[{"sentence":"The criterional validity of the test was assessed by comparing its results with other established measures.","translation":"そのテストの基準妥当性は、その結果を他の確立された尺度と比較することによって評価された。"},{"sentence":"The criterional attributes for selecting candidates included experience, education, and communication skills.","translation":"候補者を選ぶための基準となる属性には、経験、教育、コミュニケーションスキルが含まれていた。"}],"collocations":["criterional validity","criterional attributes","criterional variables","criterional measures","criterional analysis"],"synonyms":["standard","benchmark","normative","evaluative","judgmental"],"antonyms":["non-criterial","subjective","arbitrary"]}],"etymology":{"value":"The word 'criterional' is derived from 'criterion,' which comes from the Greek word 'kriterion,' meaning 'a standard for judgment.' The suffix '-al' is added to form an adjective.","priority":"★★☆"},"pronunciation":{"ipa":"/kraɪˈtɪəriənəl/","syllables":"cri-te-ri-o-nal"},"inflection":{"notes":"Adjective; comparative and superlative forms are typically formed using 'more' and 'most' (e.g., more criterional, most criterional)."},"usage_notes":{"explanation":"'Criterional' is an adjective that describes something related to or based on a criterion or criteria. It is often used in academic, scientific, or technical contexts to refer to standards or benchmarks used for evaluation or judgment. While 'criterial' is a more commonly used synonym, 'criterional' can add a slightly more formal or technical tone.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The criterional is important for evaluation.","correct":"✓ The criterion is important for evaluation.","note":"'Criterional' is an adjective and should be used to modify a noun. 'Criterion' is the noun form. Ensure the correct part of speech is used."},{"incorrect":"✗ The criterional of success are clear.","correct":"✓ The criteria of success are clear.","note":"'Criteria' is the plural form of 'criterion.' Use the plural form when referring to multiple standards."}],"priority":"★★☆"},"related_words":{"derivatives":["criterion (noun: a standard or principle by which something is judged)","criteria (noun: plural of criterion)","criterial (adjective: relating to a criterion; more common synonym)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in academic or technical writing.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Criterional' is a relatively uncommon adjective that means 'relating to a criterion or criteria.' It is used in formal or technical contexts, particularly in fields like research, evaluation, and assessment, where standards or benchmarks are employed. Understanding this word requires familiarity with the concept of a 'criterion' as a standard for judgment and the ability to recognize its adjectival form. While 'criterial' is a more frequently used synonym, 'criterional' can be encountered in specialized texts."},"example_sentences":[{"sentence":"The criterional data were analyzed to determine the effectiveness of the intervention.","translation":"介入の効果を判断するために、基準となるデータが分析された。","type":"adjective","meaning_category":"基準の"},{"sentence":"The selection process was based on criterional requirements outlined in the job description.","translation":"選考プロセスは、職務記述書に概説されている基準要件に基づいて行われた。","type":"adjective","meaning_category":"標準の"},{"sentence":"The study examined the criterional relationships between job satisfaction and employee performance.","translation":"その研究では、仕事の満足度と従業員のパフォーマンスの間の基準関係が調べられた。","type":"adjective","meaning_category":"判断基準に関する"}]}