{"word":"jargonels","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of pear, known for its elongated shape and sweet flavor.","english_definition":"A variety of pear, typically long and narrow in shape, with a sweet and juicy flesh.","examples":[{"sentence":"The jargonels were ripe and ready to be harvested.","translation":"そのjargonelsは熟していて、収穫の準備ができていた。"},{"sentence":"She made a delicious pie with the jargonels from her garden.","translation":"彼女は庭で採れたjargonelsでおいしいパイを作った。"}],"collocations":["jargonel pear","ripe jargonels","jargonel tree"],"synonyms":["pear variety","elongated pear"],"antonyms":[]}],"etymology":{"value":"The etymology of 'jargonel' is somewhat uncertain, but it is believed to be derived from a French word, possibly related to 'giroflier' (clove tree), suggesting a spicy or aromatic quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒɑːrɡənɛlz/","syllables":"jar-go-nels"},"inflection":{"noun_plural":"jargonels"},"usage_notes":{"explanation":"'Jargonels' refers specifically to a type of pear, so it is used in contexts related to fruit, gardening, cooking, or agriculture. It is not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate a jargonel yesterday, it was an apple.","correct":"✓ I ate a jargonel yesterday, it was a pear.","note":"Jargonel is a type of pear, not an apple."}],"priority":"★☆☆"},"related_words":{"derivatives":["None"],"phrasal_verbs":["None"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Jargonels' is a specialized term referring to a specific variety of pear. It is unlikely to be encountered outside of contexts related to fruit cultivation, historical texts about fruit, or specialized culinary discussions. Understanding this word requires a relatively advanced vocabulary and familiarity with different types of fruit.","priority":"★☆☆"},"example_sentences":[{"sentence":"The old orchard was known for its rare jargonels.","translation":"その古い果樹園は珍しいjargonelsで知られていた。","type":"noun","meaning_category":"fruit"},{"sentence":"Jargonels are best eaten when they are slightly soft to the touch.","translation":"Jargonelsは、触ると少し柔らかいときに食べるのが一番おいしい。","type":"noun","meaning_category":"fruit"}]}