{"word":"supererogate","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vi","definition":"(義務以上の)余分の善行を行う、過剰な行いをする","english_definition":"to do more than duty requires.","examples":[{"sentence":"It is not required that one supererogate, but it is admirable when one does.","translation":"余分の善行を行うことは必須ではないが、行うことは賞賛に値する。"},{"sentence":"The saint was known to supererogate in his acts of charity.","translation":"その聖人は、慈善行為において義務以上のことをすることで知られていた。"}],"collocations":["supererogate acts of charity","supererogate acts of kindness"],"synonyms":["go above and beyond","do more than required","overfulfill","exceed expectations"],"antonyms":["fail to meet expectations","underperform","be derelict in duty"]}],"etymology":{"value":"From Latin supererogatus, past participle of supererogare, from super- 'above' + erogare 'to pay out' (from e- 'out' + rogare 'to ask').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsuːpərəˈrɒɡeɪt/","syllables":"su-per-er-o-gate"},"inflection":{"verb_forms":{"present_simple":["supererogate","supererogates"],"past_simple":"supererogated","past_participle":"supererogated","present_participle":"supererogating"}},"usage_notes":{"explanation":"\"Supererogate\" refers to performing actions that are beyond what is morally required or expected. It is often used in philosophical or ethical contexts to describe acts of extreme generosity, self-sacrifice, or heroism. These actions are considered morally good but not obligatory.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He supererogated his homework.","correct":"✓ He went above and beyond in his homework.","note":"\"Supererogate\" is typically used for acts of charity, kindness, or moral duty, not for ordinary tasks like homework."},{"incorrect":"✗ She is a supererogated person.","correct":"✓ She is a person who supererogates.","note":"\"Supererogate\" is a verb, not an adjective. To describe a person who performs supererogatory actions, use a phrase like \"a person who supererogates\" or \"a supererogating person\"."}],"priority":"★☆☆"},"related_words":{"derivatives":["supererogation (noun: the performance of more than is asked or demanded)","supererogatory (adjective: beyond what is asked or strictly required)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Supererogate\" is a highly specialized and uncommon word, primarily used in philosophical and ethical discussions. It describes actions that are morally good but exceed the requirements of duty. Understanding this word requires a strong grasp of ethical theory and abstract concepts. Due to its rarity and specific context, it is unlikely to be encountered outside of academic or philosophical settings."},"example_sentences":[{"sentence":"The volunteer decided to supererogate by staying late to help clean up after the event.","translation":"そのボランティアは、イベント後の清掃を手伝うために遅くまで残るという、義務以上の行為をすることにした。","type":"verb","meaning_category":"余分の善行を行う"},{"sentence":"While not expected, it is commendable to supererogate in acts of service to the community.","translation":"期待されてはいないが、地域社会への奉仕活動において義務以上のことを行うことは称賛に値する。","type":"verb","meaning_category":"過剰な行いをする"}]}