{"word":"procbal","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Hypothetical) A type of ball used in a sport or game, possibly involving specific rules or properties.","english_definition":"(Hypothetical) A type of ball used in a sport or game, possibly involving specific rules or properties. This word is not widely recognized or used.","examples":[{"sentence":"The rules of the game require the procbal to be handled with gloves.","translation":"そのゲームの規則では、プロクボールは手袋をして扱わなければならない。"},{"sentence":"He kicked the procbal with surprising force.","translation":"彼は驚くほどの力でプロクボールを蹴った。"}],"collocations":["kick the procbal","throw the procbal","handle the procbal","procbal game","procbal team"],"synonyms":["ball (generic)","sphere"],"antonyms":[]}],"etymology":{"value":"Likely a neologism or a made-up word. The etymology is uncertain as it is not a standard English word.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈproʊkbɔl/","syllables":"proc-bal"},"inflection":{"noun_plural":"procbals"},"usage_notes":{"explanation":"The word 'procbal' is not a commonly recognized word in English. It appears to be a neologism or a made-up word, possibly intended to refer to a specific type of ball in a fictional context or a niche sport. Its usage is extremely limited.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a new procbal for playing basketball.","correct":"✓ I bought a new basketball.","note":"Use 'basketball' instead of 'procbal' unless referring to a specific fictional or niche context."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Not a standard English word)","frequency_google_ngram":"Extremely low frequency. Not found in standard corpora.","priority":"★☆☆"},"readability_explanation":{"level":"Difficult due to unfamiliarity. Requires understanding of neologisms.","text":"'Procbal' is not a common word. If you encounter it, it likely refers to a specific type of ball within a particular game or fictional setting. Without additional context, its exact meaning is unclear."},"example_sentences":[{"sentence":"The children invented a new game using a procbal.","translation":"子供たちはプロクボールを使った新しいゲームを発明した。","type":"noun","meaning_category":"Hypothetical ball"},{"sentence":"The rules regarding the procbal are complex and require careful study.","translation":"プロクボールに関する規則は複雑で、注意深い研究が必要です。","type":"noun","meaning_category":"Hypothetical ball"}]}