{"word":"nonequilaterally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"不等辺的に","english_definition":"In a manner that is not equilateral; relating to or having unequal sides.","examples":[{"sentence":"The triangle was constructed nonequilaterally, with each side a different length.","translation":"その三角形は不等辺的に構成され、各辺の長さが異なっていた。"}],"collocations":[],"synonyms":["unequally","asymmetrically"],"antonyms":["equilaterally","symmetrically"]}],"etymology":{"value":"Derived from the adjective \"nonequilateral,\" which combines the prefix \"non-\" (meaning \"not\") with \"equilateral\" (meaning \"having all sides equal\").","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌnɒnɪˌkwɪləˈtɛrəli/","syllables":"non-i-quil-a-ter-al-ly"},"inflection":{},"usage_notes":{"explanation":"This word is primarily used in mathematical or geometric contexts to describe shapes, particularly triangles, that do not have all sides of equal length. It is relatively uncommon in everyday language.","priority":"☆☆☆"},"common_mistakes":{},"related_words":{"derivatives":["nonequilateral (adjective)","equilateral (adjective)","equilaterally (adverb)"],"related_terms":["scalene (triangle)","isosceles (triangle)"]},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word \"nonequilaterally\" is a technical term primarily used in geometry. It describes something done or constructed in a way that does not result in equal sides. It's a rare word, mostly found in specialized contexts related to mathematics. Understanding the root word \"equilateral\" is essential to grasping its meaning."},"example_sentences":[{"sentence":"The pieces were arranged nonequilaterally to create an asymmetrical pattern.","translation":"その部品は非等辺的に配置され、非対称なパターンを作り出した。","type":"adverb","meaning_category":"unequally"},{"sentence":"The structure was built nonequilaterally, resulting in an unstable foundation.","translation":"その構造物は不等辺的に建てられ、不安定な基礎となった。","type":"adverb","meaning_category":"unequally"}]}