{"word":"recloseable","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"再び閉じることができる、再封可能な","english_definition":"capable of being closed again after being opened.","examples":[{"sentence":"This bag has a recloseable zipper.","translation":"この袋は再封可能なジッパーが付いています。"},{"sentence":"The container is designed with a recloseable lid to keep the food fresh.","translation":"その容器は、食品を新鮮に保つために再封可能な蓋で設計されています。"}],"collocations":["recloseable bag","recloseable container","recloseable lid","recloseable zipper"],"synonyms":["resealable","reclosable"],"antonyms":["non-recloseable","non-resealable"]}],"etymology":{"value":"The word \"recloseable\" is formed by adding the prefix \"re-\" (meaning \"again\" or \"back\") to the word \"closeable\" (meaning \"capable of being closed\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˈkloʊzəbəl/","syllables":"re-clos-a-ble"},"inflection":{"notes":"This is an adjective, so it doesn't have plural forms or verb conjugations."},"usage_notes":{"explanation":"\"Recloseable\" is typically used to describe packaging or containers that can be opened and then securely closed again, often to maintain freshness or prevent spillage. It is a descriptive adjective commonly found in marketing and product descriptions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The recloseable was broken.","correct":"✓ The recloseable zipper was broken.","note":"\"Recloseable\" is an adjective and needs to be followed by a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["reclose (verb): to close again","reclosure (noun): the act of closing again"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'recloseable' is a descriptive adjective used to indicate that something can be closed again after being opened. It's commonly used in contexts related to packaging, containers, and products designed to be resealed for convenience or preservation. Understanding the prefix 're-' helps to grasp the meaning of the word. It is not a very common word, but its meaning is relatively straightforward once the prefix is understood."},"example_sentences":[{"sentence":"The cereal comes in a recloseable bag to maintain freshness.","translation":"そのシリアルは、鮮度を保つために再封可能な袋に入っています。","type":"example","meaning_category":"packaging"},{"sentence":"This reusable water bottle has a recloseable cap.","translation":"この再利用可能なウォーターボトルには、再封可能なキャップが付いています。","type":"example","meaning_category":"containers"},{"sentence":"The snack package features a recloseable design, making it easy to store leftovers.","translation":"そのスナックのパッケージは再封可能なデザインで、残り物を簡単に保管できます。","type":"example","meaning_category":"design"}]}