{"word":"empty-armed","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"腕に何も抱いていない、空の腕の","english_definition":"Not holding anything in one's arms; having empty arms. Often used to describe a feeling of loss or longing, particularly for a child.","examples":[{"sentence":"She stood there, empty-armed, watching her children leave for college.","translation":"彼女はそこに、腕に何も抱かずに、子供たちが大学へ出発するのを見送っていた。"},{"sentence":"The empty-armed mother grieved for her lost child.","translation":"腕に何も抱けない母親は、失った子供を嘆き悲しんだ。"}],"collocations":["stand empty-armed","empty-armed mother","empty-armed father"],"synonyms":["childless","bereaved","unfulfilled","longing"],"antonyms":["fulfilled","content","nurturing","expectant"]},{"part_of_speech":"adjective","definition":"(比喩的に)失ったものや欠けているものを嘆いている、空虚な気持ちの","english_definition":"(Figurative) Grieving for something lost or missing; feeling empty or unfulfilled.","examples":[{"sentence":"After the project ended, he felt empty-armed and aimless.","translation":"プロジェクトが終わった後、彼は空虚な気持ちになり、目的を失った。"},{"sentence":"The city seemed empty-armed without the annual festival.","translation":"その都市は、毎年恒例の祭りがなくなり、空虚に感じられた。"}],"collocations":["feel empty-armed","empty-armed and aimless","empty-armed without"],"synonyms":["desolate","hollow","vacant","yearning","aching"],"antonyms":["complete","whole","satisfied","gratified"]}],"etymology":{"value":"A compound adjective formed from 'empty' and 'armed'. The literal meaning refers to the physical state of having nothing held in one's arms. The figurative meaning extends from this, suggesting a sense of loss or lack, especially of something that would normally be held or cherished.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌempti ˈɑːrmd/","syllables":"emp-ty-armed"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Empty-armed' is most often used to describe the emotional state of someone who has lost a child or is unable to have children, conveying a sense of profound loss and longing. It can also be used more broadly to describe a feeling of emptiness or lack after losing something important, such as a project, a relationship, or a sense of purpose. The word evokes a strong visual image of arms that should be holding something precious but are instead empty.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She felt empty-armed with happiness.","correct":"✓ She felt empty-armed with sadness.","note":"'Empty-armed' typically describes feelings of sadness, loss, or longing, not happiness."},{"incorrect":"✗ He is an empty-armed person.","correct":"✓ He is an empty-handed person. / ✓ He is feeling empty-armed.","note":"'Empty-armed' describes a temporary state of feeling loss or longing, not a permanent personality trait. 'Empty-handed' is used to describe someone who has nothing to give or offer."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'empty-armed' is a relatively uncommon and evocative term, primarily used in literature or more formal writing to describe a deep sense of loss, particularly the loss of a child or the inability to have children. It creates a powerful image of arms that should be holding someone or something precious but are instead empty, conveying feelings of grief, longing, and unfulfillment. The figurative use of the term can extend to other types of loss or lack, but it always carries a strong emotional weight. Due to its specific and emotional connotations, it's not typically used in everyday conversation but is more appropriate for expressing profound emotions in writing or more formal speech."},"example_sentences":[{"sentence":"The war widow stood empty-armed by the graveside, her heart heavy with sorrow.","translation":"戦争未亡人は、腕に何も抱かずに墓のそばに立ち、心は悲しみで重かった。","type":"adjective","meaning_category":"Loss and grief"},{"sentence":"She longed to be a mother, but remained empty-armed for many years.","translation":"彼女は母親になることを切望していたが、長年腕に何も抱けないままだった。","type":"adjective","meaning_category":"Childlessness"},{"sentence":"After the company closed, he felt empty-armed and unsure of his future.","translation":"会社が閉鎖された後、彼は空虚な気持ちになり、自分の将来に不安を感じた。","type":"adjective","meaning_category":"Loss of purpose"},{"sentence":"The city felt empty-armed after the mass exodus of its residents.","translation":"住民の大規模な脱出後、その都市は空虚に感じられた。","type":"adjective","meaning_category":"Loss of community"}]}