{"word":"Unsights","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(plural only) Things that are unpleasant to look at; eyesores.","english_definition":"Things that are unpleasant to look at; eyesores.","examples":[{"sentence":"The derelict buildings were unsights in the otherwise beautiful landscape.","translation":"その廃墟となった建物は、それ以外は美しい景観の中で、見苦しいものでした。"}],"collocations":[],"synonyms":["eyesores","blots on the landscape","disfigurements"],"antonyms":["sights","beauties","attractions"]}],"etymology":{"value":"Derived from 'unsightly', with the plural form indicating multiple instances of unpleasant sights.","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈsaɪts/","syllables":"Un-sights"},"inflection":{"noun_plural":"Unsights"},"usage_notes":{"explanation":"'Unsights' is a plural noun referring to multiple things that are unpleasant or ugly to look at. It is often used to describe things that detract from the beauty of a landscape or environment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The unsight was removed from the park.","correct":"The eyesore was removed from the park. / The unsights were removed from the park.","note":"'Unsights' is a plural noun, so it should be used when referring to multiple unpleasant things. If referring to a single thing, use 'eyesore' or rephrase the sentence."}],"priority":"★★★"},"related_words":{"derivatives":["unsightly (adjective: unpleasant to look at)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unsights' is a relatively uncommon word, generally used in more formal or descriptive contexts to refer to multiple things that are unpleasant to look at. Understanding the root word 'unsightly' is helpful for grasping its meaning. It is not a word typically encountered in everyday conversation."},"example_sentences":[{"sentence":"The abandoned cars were major unsights in the neighborhood.","translation":"その放置された車は、近隣の主要な見苦しいものでした。","type":"noun","meaning_category":"Unpleasant sights"},{"sentence":"Efforts were made to remove the unsights from the tourist area.","translation":"観光地から見苦しいものを取り除く努力がなされました。","type":"noun","meaning_category":"Unpleasant sights"}]}