{"word":"figurately","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"比喩的に、修辞的に","english_definition":"in a figurative manner; metaphorically","examples":[{"sentence":"He was, figuratively speaking, drowning in paperwork.","translation":"彼は、比喩的に言えば、書類の海で溺れていた。"},{"sentence":"The company is, figuratively, bleeding money.","translation":"その会社は、比喩的に、お金を垂れ流している。"}],"collocations":["figuratively speaking"],"synonyms":["metaphorically","symbolically","allegorically"],"antonyms":["literally","actually","verbatim"]}],"etymology":{"value":"late 14c., \"having the nature of a figure of speech,\" from Old French figuratif and directly from Latin figurativus \"metaphorical,\" from figuratus, past participle of figurare \"to form, shape,\" also \"represent in effigy, imagine,\" from figura \"a shape, form, figure; a figure of speech, a word or phrase used in a non-literal sense,\" related to fingere \"to shape, form, devise,\" from PIE root *dheigh- \"to form, build.\" The meaning \"representing by a figure or likeness\" is from early 15c. Related: Figuratively.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɪɡjərətɪvli/","syllables":"fig-ur-a-tive-ly"},"inflection":{},"usage_notes":{"explanation":"'Figuratively' is used to indicate that a statement should not be taken literally, but rather as a metaphor or analogy. It often clarifies that the speaker is using imaginative language to express an idea or feeling.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He literally died, figuratively speaking.","correct":"✓ He figuratively died, meaning he suffered a great setback.","note":"'Literally' and 'figuratively' are opposites. You cannot literally die in a figurative sense. If someone literally died, it means they actually died. If they figuratively died, it means they experienced a major failure or setback."}],"priority":"★★☆"},"related_words":{"derivatives":["figure","figurative","figuration"],"phrases":["figuratively speaking"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"relatively low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'figuratively' means in a metaphorical or non-literal way. It's used to show that something is being described using a figure of speech, rather than in a strict, factual sense. Because it's often used in more complex discussions and writing, it's considered a C1 level word."},"example_sentences":[{"sentence":"The project, figuratively speaking, was a complete disaster.","translation":"そのプロジェクトは、比喩的に言えば、完全な失敗だった。","type":"example","meaning_category":"metaphorical"},{"sentence":"He was figuratively swimming upstream against the current of public opinion.","translation":"彼は、比喩的に、世論の流れに逆らって上流に向かって泳いでいた。","type":"example","meaning_category":"metaphorical"}]}