{"word":"fictility","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"陶器、陶芸品、焼き物","english_definition":"The quality of being fictile; a fictile substance or work; pottery, earthenware, or any product of the potter's art.","examples":[{"sentence":"The museum displayed a wide range of fictility from ancient civilizations.","translation":"博物館には古代文明の様々な陶芸品が展示されていた。"},{"sentence":"Her collection included examples of fictility from different regions.","translation":"彼女のコレクションには様々な地域の陶芸品が含まれていた。"}],"collocations":["ancient fictility","regional fictility","collection of fictility"],"synonyms":["pottery","ceramics","earthenware","terra cotta"],"antonyms":[]}],"etymology":{"value":"From Latin fictilis, from fingere 'to shape, form, mold'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɪkˈtɪlɪti/","syllables":"fic-til-i-ty"},"inflection":{"noun_plural":"fictilities"},"usage_notes":{"explanation":"\"Fictility\" is a somewhat archaic or technical term referring to pottery or earthenware. It emphasizes the quality of being molded or shaped, reflecting the process of creating such objects. It is not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She admired the fictility of the sculpture.","correct":"✓ She admired the artistry of the sculpture.","note":"\"Fictility\" specifically refers to pottery or earthenware. For other types of sculpture, use terms like \"artistry,\" \"craftsmanship,\" or \"skill.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["fictile (adjective: capable of being molded or shaped; made of pottery)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Fictility\" is a rare and specialized term primarily used in academic or technical contexts related to archaeology, art history, or ceramics. It refers specifically to objects made from clay that have been shaped and fired, such as pottery or earthenware. Due to its limited usage, it is not typically encountered in general English. Understanding this word requires a strong vocabulary and familiarity with the subject matter. "},"example_sentences":[{"sentence":"The archaeological dig unearthed fragments of ancient Roman fictility.","translation":"その考古学的発掘調査で、古代ローマの陶芸品の破片が発掘された。","type":"noun","meaning_category":"陶器、陶芸品"},{"sentence":"The exhibit showcased the fictility of various indigenous cultures.","translation":"その展示会では、様々な先住民族の陶芸品が展示された。","type":"noun","meaning_category":"陶器、陶芸品"}]}