{"word":"monoaminergic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"モノアミン作動性の","english_definition":"Relating to or involving monoamines, especially as neurotransmitters.","examples":[{"sentence":"Monoaminergic pathways play a crucial role in mood regulation.","translation":"モノアミン作動性経路は、気分調節において重要な役割を果たします。"},{"sentence":"Many antidepressant drugs affect monoaminergic neurotransmission.","translation":"多くの抗うつ薬は、モノアミン作動性の神経伝達に影響を与えます。"}],"collocations":["monoaminergic neuron","monoaminergic system","monoaminergic neurotransmission","monoaminergic pathway"],"synonyms":["biogenic amine-related"],"antonyms":[]}],"etymology":{"value":"Derived from 'monoamine' (a compound containing one amine group) + '-ergic' (relating to or activated by).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌmɒnoʊˌæmɪnˈɜːrdʒɪk/","syllables":"mo-no-a-min-er-gic"},"inflection":{"notes":"This is an adjective and does not have different forms."},"usage_notes":{"explanation":"'Monoaminergic' is a term used in neuroscience and pharmacology to describe processes, neurons, or drugs that involve or affect monoamines. Monoamines are a class of neurotransmitters including dopamine, norepinephrine (noradrenaline), serotonin, and histamine. This term is often used in the context of discussing the mechanisms of action of drugs that affect mood, behavior, and neurological function.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The drug is monoaminergic, so it will increase GABA.","correct":"✓ The drug is monoaminergic, so it will affect dopamine, serotonin, or norepinephrine.","note":"Monoaminergic drugs primarily affect monoamine neurotransmitters, not GABA."}],"priority":"☆☆☆"},"related_words":{"derivatives":["monoamine","adrenergic","cholinergic","serotonergic","dopaminergic"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'monoaminergic' is highly specialized and primarily used within the fields of neuroscience, pharmacology, and related medical disciplines. Understanding this term requires a solid foundation in neurochemistry and the function of neurotransmitters. It is not commonly encountered outside of these specific contexts."},"example_sentences":[{"sentence":"The researchers investigated the effects of the compound on monoaminergic neurotransmission in the brain.","translation":"研究者たちは、その化合物が脳内のモノアミン作動性神経伝達に及ぼす影響を調査しました。","type":"scientific","meaning_category":"neuroscience"},{"sentence":"Selective serotonin reuptake inhibitors (SSRIs) are a class of monoaminergic antidepressants.","translation":"選択的セロトニン再取り込み阻害薬（SSRI）は、モノアミン作動性の抗うつ薬の一種です。","type":"medical","meaning_category":"pharmacology"}]}