{"word":"impedance","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"インピーダンス（交流回路における電気抵抗の類似概念）","english_definition":"the effective resistance of an electrical circuit or component to alternating current, arising from the combined effects of ohmic resistance and reactance.","examples":[{"sentence":"The impedance of the circuit is 50 ohms.","translation":"その回路のインピーダンスは50オームです。"},{"sentence":"Matching the impedance of the antenna to the transmission line is crucial for efficient signal transfer.","translation":"アンテナのインピーダンスを伝送線路に整合させることは、効率的な信号伝送のために重要です。"},{"sentence":"The speaker's impedance is 8 ohms.","translation":"そのスピーカーのインピーダンスは8オームです。"}],"collocations":["characteristic impedance (特性インピーダンス)","input impedance (入力インピーダンス)","output impedance (出力インピーダンス)","low impedance (低インピーダンス)","high impedance (高インピーダンス)","impedance matching (インピーダンス整合)"],"synonyms":["AC resistance","reactance","resistance"],"antonyms":["admittance"],"related_terms":["resistance","reactance","capacitor","inductor","AC circuit","Ohm's law"],"technical_domains":["electrical engineering","electronics","physics"]}],"etymology":{"value":"Derived from 'impede' (to delay or prevent) and '-ance' (a suffix indicating a state or quality). The term was coined to describe the opposition to alternating current flow, analogous to resistance in direct current circuits.","priority":"★★★"},"pronunciation":{"ipa":"/ɪmˈpiːdəns/","syllables":"im-ped-ance"},"inflection":{"noun_plural":"impedances"},"usage_notes":{"explanation":"Impedance is a measure of the opposition to alternating current (AC) in an electrical circuit. It's similar to resistance in a direct current (DC) circuit, but it also takes into account the effects of capacitance and inductance, which affect AC signals differently than DC signals. Impedance is a complex quantity, having both magnitude and phase. Impedance matching is a technique used to maximize power transfer between two circuits by ensuring that their impedances are equal or conjugate.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The impedance is measured in volts.","correct":"✓ The impedance is measured in ohms.","note":"Impedance is measured in ohms (Ω), not volts (V). Volts are a measure of electrical potential difference."},{"incorrect":"✗ Impedance only affects DC circuits.","correct":"✓ Impedance only affects AC circuits.","note":"Impedance is a concept primarily associated with AC circuits, where the effects of capacitance and inductance are significant. Resistance is the primary opposition to current flow in DC circuits."}],"priority":"★★☆"},"related_words":{"derivatives":["impedimetric (adjective: relating to or measured by impedance)"],"related_terms":["admittance (逆アドミタンス: the reciprocal of impedance)","reactance (リアクタンス: the opposition to alternating current due to capacitance or inductance)","resistance (電気抵抗: the opposition to current flow in a direct current circuit)","capacitor (コンデンサ: an electrical component that stores energy in an electric field)","inductor (インダクタ: an electrical component that stores energy in a magnetic field)"],"priority":"★★★"},"level_frequency":{"frequency_corpus":"Low frequency (専門用語)","frequency_google_ngram":"Relatively low frequency (専門用語)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Impedance' is a technical term used in electrical engineering and physics to describe how much a circuit opposes the flow of alternating current (AC). It's like resistance, but it also includes the effects of components like capacitors and inductors. Impedance is important for designing circuits that efficiently transfer electrical signals. It is typically used in higher level studies and technical applications."},"example_sentences":[{"sentence":"The **impedance** of the transmission line must be carefully controlled to minimize signal reflections.","translation":"信号の反射を最小限に抑えるためには、伝送線の**インピーダンス**を慎重に制御する必要があります。","type":"general","meaning_category":"電気抵抗の類似概念"},{"sentence":"The engineer used an **impedance** analyzer to characterize the properties of the material.","translation":"エンジニアは、材料の特性を評価するために**インピーダンス**アナライザを使用しました。","type":"technical","meaning_category":"電気抵抗の類似概念"},{"sentence":"**Impedance** matching is essential for maximizing power transfer in RF circuits.","translation":"RF回路で電力伝送を最大化するには、**インピーダンス**整合が不可欠です。","type":"technical","meaning_category":"電気抵抗の類似概念"}]}