{"word":"alloyed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"合金にされた、合金の","english_definition":"(of a metal) combined with one or more other elements, usually metals, to improve its properties.","examples":[{"sentence":"The alloyed steel is much stronger than pure iron.","translation":"合金鋼は純粋な鉄よりもはるかに強い。"},{"sentence":"Alloyed metals are used in aircraft construction for their strength and lightness.","translation":"合金金属は、その強度と軽量性から航空機の構造に使用されています。"}],"collocations":["alloyed steel","alloyed metal","alloyed with"],"synonyms":["combined","mixed","blended","tempered"],"antonyms":["pure","unalloyed"]},{"part_of_speech":"adjective","definition":"（喜びなどが）不純な、混じりけのある、損なわれた","english_definition":"(of joy, pleasure, etc.) diminished or spoiled by the presence of something unpleasant.","examples":[{"sentence":"Their happiness was alloyed by the news of the accident.","translation":"彼らの幸福は事故の知らせによって損なわれた。"},{"sentence":"The victory was alloyed with sadness because of the injuries sustained by the team.","translation":"その勝利は、チームが負った怪我のために悲しみによって損なわれた。"}],"collocations":["alloyed happiness","alloyed joy","alloyed pleasure","alloyed with"],"synonyms":["impaired","spoiled","tainted","marred","diminished","mixed"],"antonyms":["pure","unadulterated","unmixed","unspoiled"]}],"etymology":{"value":"Derived from the verb 'alloy,' which comes from Old French 'aloi' meaning 'mixture,' from Latin 'ad-' (to) + 'ligare' (to bind). The sense of 'debased' or 'impaired' likely arose from the idea that mixing something with a pure substance reduces its value or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈlɔɪd/","syllables":"al-loyed"},"inflection":{"notes":"'Alloyed' is the past participle and adjective form of the verb 'alloy.'"},"usage_notes":{"explanation":"'Alloyed' can refer to the literal process of creating an alloy, or it can be used metaphorically to describe something that is mixed with or diminished by something else, typically something negative. When referring to metals, it describes the state of being combined with other elements. When referring to emotions or experiences, it describes the state of being tainted or lessened by something unpleasant.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The alloyed was strong.","correct":"The alloyed steel was strong.","note":"'Alloyed' is an adjective and needs to modify a noun. It cannot stand alone as a noun."},{"incorrect":"Her joy was alloyed with happiness.","correct":"Her joy was alloyed with sadness.","note":"When used metaphorically, 'alloyed' implies that something positive is diminished by something negative. Using it with another positive emotion is contradictory."}],"priority":"★★☆"},"related_words":{"derivatives":["alloy (noun, verb)","alloying (noun)"],"phrases":["unalloyed (adj.) - pure, not mixed with anything else (often used to describe emotions or feelings)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'alloyed' has two main meanings. Literally, it describes a metal that has been combined with other elements to improve its properties. Metaphorically, it describes a feeling or experience that is mixed with something unpleasant, diminishing the overall positive effect. The metaphorical use is more abstract and requires a higher level of understanding. It's important to understand the context to determine which meaning is intended."},"example_sentences":[{"sentence":"The **alloyed** aluminum is resistant to corrosion.","translation":"その合金アルミニウムは耐腐食性がある。","type":"adjective","meaning_category":"合金にされた"},{"sentence":"His success was **alloyed** with regret for the opportunities he had missed.","translation":"彼の成功は、彼が逃した機会への後悔によって損なわれた。","type":"adjective","meaning_category":"（喜びなどが）不純な"}]}