{"word":"neurotypical-focused","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"神経定型者に焦点を当てた、神経定型者中心の","english_definition":"Designed or intended primarily for neurotypical individuals; prioritizing the needs and preferences of neurotypical people.","examples":[{"sentence":"The design of the office space is neurotypical-focused, with bright lights and open layouts that can be overwhelming for some neurodivergent individuals.","translation":"そのオフィス空間のデザインは神経定型者中心で、明るい照明と開放的なレイアウトは、一部の神経多様性を持つ人々にとっては圧倒される可能性があります。"},{"sentence":"Many educational systems are neurotypical-focused, which can create challenges for students with learning differences.","translation":"多くの教育システムは神経定型者中心であり、学習に違いがある生徒にとって課題が生じる可能性があります。"}],"collocations":["neurotypical-focused design","neurotypical-focused education","neurotypical-focused approach","neurotypical-focused environment"],"synonyms":["NT-centric","neurotypical-normative"],"antonyms":["neurodivergent-friendly","neurodiversity-affirming"],"notes":"This term is often used critically to point out how systems and environments may unintentionally exclude or disadvantage neurodivergent individuals.","tags":["neurodiversity","accessibility"]}],"etymology":{"value":"A compound word formed by combining 'neurotypical' (referring to individuals with typical neurological development) and 'focused' (indicating a primary emphasis or orientation).","priority":"medium"},"pronunciation":{"ipa":"/ˌnjʊəroʊˈtɪpɪkəl ˈfoʊkəst/","syllables":"neu-ro-typ-i-cal fo-cused"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Neurotypical-focused' is used to describe systems, designs, or approaches that are primarily tailored to the needs and expectations of neurotypical individuals. It often implies a lack of consideration for the needs of neurodivergent people, such as those with autism, ADHD, or other neurological differences. The term is often used in discussions about accessibility, inclusion, and neurodiversity.","priority":"high"},"common_mistakes":{"examples":[{"incorrect":"The program is neurotypical-focus.","correct":"The program is neurotypical-focused.","note":"The correct form is 'neurotypical-focused,' using the past participle of 'focus' to function as an adjective."}],"priority":"medium"},"related_words":{"derivatives":["neurotypical","neurodivergent","neurodiversity"],"related_terms":["ableism","inclusion","accessibility"]},"level_frequency":{"frequency_google_ngram":"Low frequency, primarily used in specialized contexts related to neurodiversity.","priority":"low"},"readability_explanation":{"level":"C1","text":"This term is relatively specialized and is primarily used in discussions related to neurodiversity, accessibility, and inclusion. Understanding requires familiarity with the concept of neurotypicality and neurodiversity."},"example_sentences":[{"sentence":"The website's design is neurotypical-focused, making it difficult for users with ADHD to navigate.","translation":"そのウェブサイトのデザインは神経定型者中心であり、ADHDのユーザーがナビゲートするのが困難になっています。","type":"adjective","meaning_category":"design"},{"sentence":"The company is trying to move away from a neurotypical-focused hiring process to be more inclusive.","translation":"その会社は、より包括的になるために、神経定型者中心の採用プロセスから脱却しようとしています。","type":"adjective","meaning_category":"hiring process"}]}