{"word":"asexuality","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"無性愛","english_definition":"A sexual orientation characterized by a lack of sexual attraction to others.","examples":[{"sentence":"Asexuality is a sexual orientation, not a choice.","translation":"無性愛は性的指向であり、選択ではありません。"},{"sentence":"Some asexual people still desire romantic relationships.","translation":"無性愛者の中にも、恋愛関係を望む人がいます。"},{"sentence":"Understanding asexuality helps to promote inclusivity.","translation":"無性愛を理解することは、包括性を促進するのに役立ちます。"}],"collocations":["asexual spectrum","asexual community","experience asexuality","identify as asexual","asexual identity"],"synonyms":["nonsexuality","lack of sexual attraction"],"antonyms":["sexuality","sexual attraction"]},{"part_of_speech":"noun","definition":"無性生殖","english_definition":"A type of reproduction that does not involve the fusion of gametes or change in the number of chromosomes.","examples":[{"sentence":"Bacteria reproduce through asexuality, such as binary fission.","translation":"バクテリアは二分裂のような無性生殖によって繁殖します。"},{"sentence":"Some plants can reproduce both sexually and asexually.","translation":"植物の中には、有性生殖と無性生殖の両方が可能なものがあります。"},{"sentence":"Asexuality allows for rapid population growth in favorable conditions.","translation":"無性生殖は、好ましい条件下での急速な個体数増加を可能にします。"}],"collocations":["asexual reproduction","asexual propagation","binary fission","vegetative reproduction"],"synonyms":["agamogenesis","vegetative reproduction"],"antonyms":["sexual reproduction"]}],"etymology":{"value":"From 'a-' (meaning 'not' or 'without') + 'sexuality'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌeɪˌsekʃuˈæləti/","syllables":"a-sex-u-al-i-ty"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Asexuality' can refer to either a lack of sexual attraction or a form of reproduction that doesn't involve sex. Context is crucial for understanding which meaning is intended. When referring to sexual orientation, it's important to remember that asexuality is a spectrum, and asexual individuals may have varying experiences and feelings about relationships, romance, and attraction.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Asexuality is the same as celibacy.","correct":"Asexuality is a sexual orientation, while celibacy is a choice to abstain from sexual activity.","note":"Asexuality is a lack of sexual attraction, whereas celibacy is a voluntary choice to not engage in sexual activity, regardless of attraction."},{"incorrect":"Asexual people can't experience love or romantic attraction.","correct":"Asexual people may or may not experience romantic attraction; asexuality is specifically the lack of sexual attraction.","note":"Asexuality refers to the lack of sexual attraction. Romantic attraction is a separate concept, and asexual individuals can experience romantic attraction."}],"priority":"★★☆"},"related_words":{"derivatives":["asexual (adjective)","asexually (adverb)","asexualize (verb)"],"phrasal_verbs":null,"priority":"★★★"},"level_frequency":{"CEFR":null,"frequency_google_ngram":null,"priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Asexuality' is a term that refers to either a lack of sexual attraction towards others or a form of reproduction that does not involve sex. In the context of sexual orientation, it's important to understand that asexuality is a spectrum, meaning that experiences can vary widely among asexual individuals. Some asexual people may experience romantic attraction but not sexual attraction, while others may not experience any form of attraction. In biology, asexuality refers to a method of reproduction where offspring arise from a single organism, without the fusion of gametes. Understanding the context is key to interpreting the meaning of 'asexuality' correctly."},"example_sentences":[{"sentence":"She identifies as asexual and is active in the asexual community.","translation":"彼女は無性愛者であることを自認しており、無性愛コミュニティで活動しています。","type":"noun","meaning_category":"Sexual Orientation"},{"sentence":"Many single-celled organisms reproduce through asexual reproduction.","translation":"多くの単細胞生物は無性生殖によって繁殖します。","type":"noun","meaning_category":"Asexual Reproduction"},{"sentence":"Asexual individuals have diverse experiences regarding relationships and attraction.","translation":"無性愛者たちは、人間関係や魅力に関して多様な経験を持っています。","type":"adjective","meaning_category":"Sexual Orientation (related adjective)"}]}