{"word":"tonneaued","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(自動車が)トノーカバーで覆われた","english_definition":"(of a vehicle) fitted with a tonneau cover.","examples":[{"sentence":"The tonneaued roadster gleamed in the sun.","translation":"トノーカバーで覆われたロードスターが太陽の下で輝いていた。"}],"collocations":["tonneaued roadster","tonneaued sports car"],"synonyms":["covered","protected"],"antonyms":["uncovered","exposed"]}],"etymology":{"value":"Derived from the noun 'tonneau', referring to the rear passenger compartment of early automobiles or a cover for the rear seats of a convertible or pickup truck.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɒnoʊd/","syllables":"ton-neaued"},"inflection":{"notes":"Past participle of 'tonneau' used as an adjective."},"usage_notes":{"explanation":"'Tonneaued' is primarily used to describe vehicles, especially roadsters or pickup trucks, that have a tonneau cover. A tonneau cover is a protective covering that fits over the open rear passenger area or the bed of a truck, typically to protect it from the elements or to improve aerodynamics. The term is relatively specialized and mainly encountered in automotive contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The car was tonneaued with mud.","correct":"✓ The car was covered with mud.","note":"'Tonneaued' describes the presence of a tonneau cover, not simply being covered in something."}],"priority":"★★☆"},"related_words":{"derivatives":["tonneau (noun)","tonneau cover (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'tonneaued' is a specialized term primarily used in automotive contexts to describe a vehicle fitted with a tonneau cover. Understanding this term requires familiarity with automotive terminology and a relatively advanced vocabulary. It is not commonly used in everyday conversation and is more likely to be encountered in technical descriptions or historical discussions of automobiles."},"example_sentences":[{"sentence":"The vintage roadster, tonneaued and polished, was the star of the car show.","translation":"トノーカバーで覆われ、磨き上げられたそのヴィンテージロードスターは、カーショーの主役だった。","type":"adjective","meaning_category":"Describing a vehicle with a tonneau cover"}]}