{"word":"tare","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"風袋、容器の重さ、正味重量を計算する際に差し引かれる重量","english_definition":"the weight of the packaging or container that is deducted from the gross weight to determine the net weight.","examples":[{"sentence":"The tare weight of the truck was 5,000 pounds.","translation":"そのトラックの風袋重量は5,000ポンドだった。"},{"sentence":"Make sure to deduct the tare before calculating the net weight of the shipment.","translation":"出荷物の正味重量を計算する前に、必ず風袋を差し引いてください。"}],"collocations":["tare weight","deduct the tare","calculate the tare"],"synonyms":["container weight","packaging weight"],"antonyms":["net weight","gross weight"]},{"part_of_speech":"verb","definition":"風袋重量を量る、風袋を差し引く","english_definition":"to determine or deduct the tare weight.","examples":[{"sentence":"We need to tare the scale before weighing the ingredients.","translation":"材料を量る前に、スケールの風袋重量を量る必要があります。"},{"sentence":"The scale has a button to tare the weight.","translation":"そのスケールには風袋重量を差し引くボタンが付いています。"}],"collocations":["tare the scale","tare the weight"],"synonyms":["zero the scale","deduct the weight"],"antonyms":["weigh without tare"]},{"part_of_speech":"noun","definition":"(植物)カラスノエンドウ、穀物畑の雑草","english_definition":"a vetch, especially as a weed in cornfields.","examples":[{"sentence":"The farmer spent hours pulling tares from the wheat field.","translation":"農夫は麦畑からカラスノエンドウを抜き取るのに何時間も費やした。"},{"sentence":"Tares can reduce the yield of a grain crop.","translation":"カラスノエンドウは穀物の収穫量を減らす可能性がある。"}],"collocations":["pull tares","wheat and tares"],"synonyms":["vetch","weed"],"antonyms":[]}],"etymology":{"value":"The noun meaning 'weight of container' comes from Middle French 'tare', from Italian 'tara', from Arabic ' طرح (ṭarḥ)' meaning 'something rejected, deduction'. The noun meaning 'vetch' comes from Old English 'tæter', of Germanic origin.","priority":"★★☆"},"pronunciation":{"ipa":"/tɛər/","syllables":"tare"},"inflection":{"noun_plural":"tares","verb_forms":{"present_simple":["tare","tares"],"past_simple":"tared","past_participle":"tared","present_participle":"taring"}},"usage_notes":{"explanation":"The word \"tare\" has two distinct meanings. In a business or shipping context, it refers to the weight of a container or packaging, which is subtracted from the gross weight to find the net weight. In agriculture, it refers to a type of vetch, often considered a weed in grain fields.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He used the tare to measure the flour.","correct":"✓ He used the scale to measure the flour. Then he tared the scale to zero it out.","note":"\"Tare\" is not the measuring device itself, but the weight that is subtracted or the act of subtracting it. Use \"scale\" for the measuring device."},{"incorrect":"✗ The tares are growing in the garden, they are so beautiful.","correct":"✓ The vetches are growing in the garden, they are so beautiful.","note":"While \"tare\" refers to a specific type of vetch considered a weed, \"vetch\" is a broader term for the plant. If you find them beautiful, it's more likely a cultivated vetch rather than a weed-like tare."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2 (technical usage)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"tare\" is a somewhat specialized term. Its primary use is in contexts related to weighing goods, shipping, and commerce, where it refers to the weight of the container or packaging itself. This weight is then subtracted from the total weight (gross weight) to determine the net weight of the contents. A secondary, less common meaning refers to a type of vetch, often regarded as a weed in agricultural settings. Understanding the context is key to interpreting the intended meaning of \"tare\".","priority":"★☆☆"},"example_sentences":[{"sentence":"The recipe calls for 500 grams of flour, not including the **tare** weight of the bowl.","translation":"レシピでは、ボウルの風袋重量を含めずに500グラムの小麦粉が必要です。","type":"noun","meaning_category":"風袋重量"},{"sentence":"**Tare** the scale before adding the ingredients to get an accurate measurement.","translation":"正確な測定値を得るには、材料を加える前にスケールの風袋重量を差し引いてください。","type":"verb","meaning_category":"風袋を差し引く"},{"sentence":"The farmer spent the morning removing **tares** from the barley field.","translation":"農夫は午前中、大麦畑からカラスノエンドウを取り除くのに費やしました。","type":"noun","meaning_category":"カラスノエンドウ"}]}