{"word":"enervators","priority":"low","meanings":[{"part_of_speech":"noun","definition":"Something that causes a loss of energy or vitality.","english_definition":"Things that cause someone to feel drained of energy or vitality.","examples":[{"sentence":"The long commute and demanding job were real enervators.","translation":"長い通勤と要求の多い仕事は、本当にエネルギーを奪うものだった。"},{"sentence":"Stressful situations are often enervators for many people.","translation":"ストレスの多い状況は、多くの人にとってしばしばエネルギーを奪うものである。"}],"collocations":["physical enervators","mental enervators","emotional enervators"],"synonyms":["drain","exhaust","sap","deplete"],"antonyms":["energizer","stimulant","invigorator"]},{"part_of_speech":"noun","definition":"People who cause a loss of energy or vitality in others.","english_definition":"People who cause others to feel drained of energy or vitality.","examples":[{"sentence":"Avoid enervators who constantly complain and bring you down.","translation":"常に不平を言い、あなたを落ち込ませるような、エネルギーを奪う人たちを避けなさい。"},{"sentence":"Some colleagues can be enervators, making the workplace unpleasant.","translation":"同僚の中には、職場を不快にする、エネルギーを奪う人がいるかもしれない。"}],"collocations":["negative enervators","toxic enervators"],"synonyms":["downer","energy vampire"],"antonyms":["inspirer","motivator","uplifter"]}],"etymology":{"value":"Derived from 'enervate' (to weaken or drain of energy) + '-or' (a suffix indicating a person or thing that performs an action).","priority":"medium"},"pronunciation":{"ipa":"/ˈɛnərveɪtərz/","syllables":"e-ner-va-tors"},"inflection":{"noun_plural":"enervators"},"usage_notes":{"explanation":"'Enervators' refers to things or people that cause a loss of energy, vitality, or enthusiasm. It is often used to describe factors that contribute to fatigue, stress, or a general feeling of being drained.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The enervators are enervating.","correct":"The enervators are enervating things or people.","note":"'Enervator' is the thing or person that causes the enervation, not the act of enervating itself."}],"priority":"low"},"related_words":{"derivatives":["enervate","enervation"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"low"},"readability_explanation":{"level":"C1","text":"'Enervators' are things or people that make you feel tired or lacking energy. It's a more sophisticated way to describe something that drains your vitality. Use it when you want to sound precise about what's causing your fatigue or lack of enthusiasm."},"example_sentences":[{"sentence":"The constant noise and interruptions were major enervators during the workday.","translation":"絶え間ない騒音と中断は、勤務時間中の主要なエネルギーを奪うものだった。","type":"noun","meaning_category":"cause of energy loss"},{"sentence":"She identified the negative people in her life as enervators and began to distance herself from them.","translation":"彼女は人生における否定的な人々をエネルギーを奪う人たちだと認識し、彼らから距離を置き始めた。","type":"noun","meaning_category":"people causing energy loss"}]}