{"word":"electrotropism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"電気刺激に対する植物の成長または運動の方向性反応","english_definition":"The directional growth or movement response of a plant to an electrical stimulus.","examples":[{"sentence":"Electrotropism can be observed in the roots of certain plants when exposed to a weak electric field.","translation":"弱い電場にさらされると、特定の植物の根に電気屈性が見られることがあります。"},{"sentence":"The study of electrotropism helps understand how plants respond to environmental stimuli.","translation":"電気屈性の研究は、植物が環境刺激にどのように反応するかを理解するのに役立ちます。"}],"collocations":["positive electrotropism (正の電気屈性)","negative electrotropism (負の電気屈性)","exhibit electrotropism (電気屈性を示す)","induce electrotropism (電気屈性を誘導する)"],"synonyms":["galvanotropism"],"antonyms":[]}],"etymology":{"value":"\"electro-\" (電気) + \"tropism\" (方向性のある成長または運動)","priority":"★★★"},"pronunciation":{"ipa":"/ɪˌlɛktroʊˈtroʊpɪzəm/","syllables":"e-lec-tro-tro-pism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Electrotropism is a specific type of tropism, which is a plant's response to an external stimulus by growing or moving in a particular direction. In electrotropism, the stimulus is an electrical field. Plants may exhibit positive electrotropism (growing towards the electric field) or negative electrotropism (growing away from the electric field). The mechanisms behind electrotropism are not fully understood, but it is believed to involve the redistribution of ions and changes in membrane potential within plant cells.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant showed electrotropism when exposed to light.","correct":"✓ The plant showed phototropism when exposed to light.","note":"Electrotropism is a response to electrical stimuli, not light. The response to light is called phototropism."}],"priority":"★★☆"},"related_words":{"derivatives":["electrotropic (adjective)"],"related_terms":["tropism","phototropism","geotropism","hydrotropism","thigmotropism"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - a specialized term in plant biology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Electrotropism is a scientific term describing how plants grow or move in response to electricity. It's not a common word, but it's important in plant biology. If a plant grows towards electricity, it's called positive electrotropism. If it grows away, it's negative electrotropism. This term is usually used in scientific studies about plants and their environment."},"example_sentences":[{"sentence":"The roots of the seedlings displayed positive electrotropism, growing towards the cathode.","translation":"苗の根は正の電気屈性を示し、陰極に向かって成長しました。","type":"example","meaning_category":"directional growth"},{"sentence":"Scientists are investigating the role of electrotropism in nutrient uptake by plants.","translation":"科学者たちは、植物による栄養素の取り込みにおける電気屈性の役割を調査しています。","type":"example","meaning_category":"environmental stimuli"}]}