{"word":"hypocorism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"愛称、愛称形、親愛語","english_definition":"A pet name, diminutive, or term of endearment.","examples":[{"sentence":"'Liz' is a hypocorism of 'Elizabeth'.","translation":"「リズ」は「エリザベス」の愛称です。"},{"sentence":"'Daddy' and 'Mommy' are hypocorisms used by children.","translation":"「パパ」と「ママ」は子供たちが使う愛称です。"},{"sentence":"Many languages have specific hypocoristic suffixes.","translation":"多くの言語には特定の愛称を作る接尾辞があります。"}],"collocations":["form a hypocorism","use a hypocorism","hypocoristic suffix","diminutive hypocorism"],"synonyms":["pet name","term of endearment","diminutive","nickname"],"antonyms":["formal name","full name"]}],"etymology":{"value":"From Ancient Greek ὑποκορίζομαι (hupokorízomai, “to use pet names”), from ὑπό (hupó, “under, mildly”) + κορίζομαι (korízomai, “to caress”), from κόρη (kórē, “girl”).","priority":"★★★"},"pronunciation":{"ipa":"/haɪˈpɒkərɪzəm/","syllables":"hy-po-co-ri-sm"},"inflection":{"noun_plural":"hypocorisms"},"usage_notes":{"explanation":"A hypocorism is a word or name used to express affection or familiarity. It is often a shortened or altered version of a proper name, or a completely different word used as a term of endearment. Hypocorisms are common in many languages and cultures, and they play a significant role in interpersonal communication by creating a sense of closeness and intimacy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a hypocorism to insult her.","correct":"✓ He used a derogatory term to insult her.","note":"Hypocorisms are generally terms of endearment, not insults. Use 'derogatory term' or a more specific word for insults."},{"incorrect":"✗ Hypocorism is a type of formal language.","correct":"✓ Hypocorism is a type of informal language.","note":"Hypocorisms are informal and affectionate, not formal."}],"priority":"★★☆"},"related_words":{"derivatives":["hypocoristic (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hypocorism' is a somewhat technical term referring to a pet name or term of endearment. It's not a word you'd use in everyday conversation, but it's useful in linguistic discussions or when analyzing interpersonal communication. Think of it as the formal word for the cute names we use for loved ones."},"example_sentences":[{"sentence":"Her given name was Margaret, but everyone called her Peggy, a common hypocorism.","translation":"彼女の本名はマーガレットでしたが、みんなはペギーと呼んでいました。それは一般的な愛称です。","type":"example","meaning_category":"愛称の例"},{"sentence":"'Sweetheart' and 'darling' are common hypocorisms used to express affection.","translation":"「スウィートハート」と「ダーリン」は愛情表現に使われる一般的な愛称です。","type":"example","meaning_category":"愛情表現の例"},{"sentence":"The linguist studied the use of hypocorisms in different cultures.","translation":"言語学者は異なる文化における愛称の使用を研究しました。","type":"example","meaning_category":"学術的な使用例"}]}