{"word":"mutually-agreed","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"相互に合意された、双方合意の","english_definition":"agreed upon by all parties involved; decided or arranged by mutual consent.","examples":[{"sentence":"The meeting was postponed to a mutually-agreed date.","translation":"会議は双方合意の日程に延期された。"},{"sentence":"We reached a mutually-agreed settlement.","translation":"私たちは双方合意の和解に達した。"},{"sentence":"The terms of the contract were mutually-agreed.","translation":"契約条件は相互に合意されたものだった。"}],"collocations":["mutually-agreed terms (相互合意の条件)","mutually-agreed date (相互合意の日)","mutually-agreed settlement (相互合意の和解)","mutually-agreed upon (相互に合意された)"],"synonyms":["consensual","jointly agreed","by common consent","collectively agreed","amicably agreed"],"antonyms":["unilateral","imposed","forced","dictated"]}],"etymology":{"value":"The term is a compound adjective formed by combining 'mutually' (meaning 'in a mutual or reciprocal manner') and 'agreed' (the past participle of 'agree', meaning 'having the same opinion about something'). The combination indicates that the agreement was reached by all parties involved.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmjuːtʃuəli əˈɡriːd/","syllables":"mu-tu-al-ly a-greed"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Mutually-agreed' is used to emphasize that an agreement or decision was not made unilaterally but through the consent and agreement of all parties involved. It is commonly used in formal contexts such as legal documents, contracts, and business negotiations to ensure clarity and avoid misunderstandings. The term implies a collaborative and consensual process.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The mutually agreed settlement was reached by one party.","correct":"✓ The mutually agreed settlement was reached by all parties.","note":"'Mutually-agreed' implies that all parties were involved in reaching the agreement. Saying it was reached by one party is contradictory."},{"incorrect":"✗ We mutually agreed to the terms, but I still disagree with them.","correct":"✓ We agreed to the terms, even though I still disagree with them.","note":"If you disagree with the terms, it cannot be 'mutually-agreed'. You can 'agree' to something for practical reasons, even if you don't personally agree with it, but it wouldn't be considered 'mutually-agreed'."},{"incorrect":"✗ The date was agreed mutually.","correct":"✓ The date was mutually agreed.","note":"The correct phrasing is 'mutually agreed date' or 'the date was mutually agreed upon.' Using 'agreed mutually' is grammatically awkward."}],"priority":"★★☆"},"related_words":{"derivatives":["mutual (adjective: reciprocal; shared)","agreement (noun: a state of accord)","agree (verb: to have the same opinion about something)"],"phrasal_verbs":["agree on/upon (to come to an understanding or consensus)","agree to (to consent to something)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in formal and legal contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Mutually-agreed' is a formal term used to describe something that has been agreed upon by all parties involved. It emphasizes the consensual nature of the agreement. This term is often found in legal or business contexts where it's important to highlight that all parties have given their consent. It implies a collaborative process where everyone has had a say in the final decision. It is a compound adjective, meaning it combines two words to create a single descriptive term. Understanding this term is useful for comprehending formal agreements and negotiations."},"example_sentences":[{"sentence":"The project timeline was established based on a **mutually-agreed** schedule.","translation":"プロジェクトのタイムラインは、相互に合意されたスケジュールに基づいて確立された。","type":"adjective","meaning_category":"双方合意の"},{"sentence":"The company and the union reached a **mutually-agreed** contract after weeks of negotiations.","translation":"会社と労働組合は、数週間の交渉の末、相互合意の契約に達した。","type":"adjective","meaning_category":"相互に合意された"},{"sentence":"They decided on a **mutually-agreed** location for the conference to accommodate attendees from different regions.","translation":"彼らは、さまざまな地域からの参加者に対応するために、会議の場所を相互に合意された場所に決定した。","type":"adjective","meaning_category":"双方合意の"}]}