{"word":"arrays","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"配列 (プログラミング)","english_definition":"A structured collection of elements (variables or values), each identified by at least one array index or key. Arrays are typically used to store collections of similar data types.","examples":[{"sentence":"In many programming languages, arrays are used to store a list of numbers.","translation":"多くのプログラミング言語では、配列は数値のリストを格納するために使用されます。"},{"sentence":"Arrays allow efficient access to elements based on their index.","translation":"配列を使用すると、インデックスに基づいて要素に効率的にアクセスできます。"},{"sentence":"Multi-dimensional arrays can be used to represent matrices or tables.","translation":"多次元配列は、行列またはテーブルを表すために使用できます。"}],"collocations":["array of integers","array of strings","multi-dimensional array","accessing array elements","array index","array bounds"],"synonyms":["list","collection","table","matrix"],"antonyms":[]}],"etymology":{"value":"The word 'array' comes from the Old French word 'arrai,' which means 'order' or 'arrangement.' In the context of programming, it refers to an ordered arrangement of data elements.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈreɪz/","syllables":"a-rrays"},"inflection":{"noun_singular":"array","noun_plural":"arrays"},"usage_notes":{"explanation":"In programming, an array is a fundamental data structure used to store a collection of elements of the same data type. Each element in an array is accessed using an index, which is typically an integer. Arrays can be one-dimensional (a simple list) or multi-dimensional (e.g., a matrix or table). The size of an array is usually fixed when it is created. Arrays are used extensively in various programming tasks, such as storing lists of numbers, strings, or objects.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I added a string to the integer array.","correct":"✓ I added a string to the array of strings. / ✓ I added an integer to the integer array.","note":"Arrays typically store elements of the same data type. Adding an element of a different data type can lead to errors or unexpected behavior."},{"incorrect":"✗ The array index started at 1.","correct":"✓ The array index started at 0.","note":"In many programming languages (like C, C++, Java, Python), array indices start at 0, not 1. This is a common source of off-by-one errors."},{"incorrect":"✗ I accessed the array element at index 10, but the array only had 5 elements.","correct":"✓ I accessed the array element at index 4, because the array only had 5 elements and the indexes start at 0.","note":"Accessing an array element outside the valid index range (array bounds) can cause a runtime error or unexpected behavior."}],"priority":"★★☆"},"related_words":{"derivatives":["arraylist","array_slice","numpy array (Python)","jagged array"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2 (in a technical context)","frequency_google_ngram":"Relatively low frequency outside of technical documentation and programming contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Arrays' are ordered collections of data elements, typically of the same type, used in computer programming. Each element is identified by an index, allowing for efficient access and manipulation. Understanding arrays is crucial for tasks involving data storage, algorithms, and data structures. They can be one-dimensional (like a list) or multi-dimensional (like a table). Common operations include accessing elements, iterating through the array, and modifying values. Arrays are a fundamental concept in computer science and are used extensively in various programming languages."},"example_sentences":[{"sentence":"The function returns an array of integers.","translation":"その関数は整数の配列を返します。","type":"noun","meaning_category":"配列"},{"sentence":"We can iterate through the array using a for loop.","translation":"forループを使用して配列を反復処理できます。","type":"noun","meaning_category":"配列"},{"sentence":"The elements of the array are stored in contiguous memory locations.","translation":"配列の要素は、連続したメモリ位置に格納されます。","type":"noun","meaning_category":"配列"}]}