{"word":"fibrinosis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"線維素症、フィブリン沈着症","english_definition":"The formation or presence of an excess of fibrin in a tissue or organ.","examples":[{"sentence":"Pulmonary fibrinosis can lead to impaired lung function.","translation":"肺線維素症は肺機能の低下につながる可能性があります。"},{"sentence":"Fibrinosis is a common feature of many inflammatory diseases.","translation":"線維素症は多くの炎症性疾患の一般的な特徴です。"}],"collocations":["pulmonary fibrinosis (肺線維素症)","peritoneal fibrinosis (腹膜線維素症)"],"synonyms":["fibrosis","fibrinous inflammation"],"antonyms":[]}],"etymology":{"value":"Derived from 'fibrin' (a fibrous protein involved in blood clotting) + '-osis' (a suffix indicating a condition or process, often a disease).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfaɪbrɪˈnoʊsɪs/","syllables":"fi-bri-no-sis"},"inflection":{"noun_plural":"fibrinoses"},"usage_notes":{"explanation":"Fibrinosis refers to the excessive accumulation or deposition of fibrin, a protein involved in blood clotting, in tissues or organs. It is often associated with inflammation and can lead to fibrosis (scarring). The term is primarily used in medical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["fibrin (線維素)","fibrosis (線維症)","fibrinous (線維性の)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学専門用語。","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Fibrinosis' is a highly specialized medical term referring to the excessive deposition of fibrin in tissues, often associated with inflammation and potentially leading to fibrosis. It is primarily encountered in medical literature and discussions. Understanding requires a strong background in biology and medicine."},"example_sentences":[{"sentence":"Chronic inflammation can result in progressive peritoneal fibrinosis.","translation":"慢性的な炎症は進行性の腹膜線維素症を引き起こす可能性があります。","type":"general","meaning_category":"病理"},{"sentence":"The biopsy revealed evidence of significant fibrinosis in the lung tissue.","translation":"生検の結果、肺組織に有意な線維素症の証拠が認められました。","type":"medical","meaning_category":"診断"}]}