{"word":"forisfamiliate","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(法律) (特にスコットランド法) (親が) (子供を)独立させる、勘当する、(子供に)財産管理の権利を与える","english_definition":"(law, especially in Scots law) to release (a child) from parental control; to emancipate; to give (a child) the right to manage their own affairs and property.","examples":[{"sentence":"The father forisfamiliated his eldest son, granting him control over his inheritance.","translation":"父親は長男を独立させ、相続財産の管理権を与えた。"},{"sentence":"By forisfamiliating their daughter, the parents allowed her to enter into contracts and own property in her own name.","translation":"娘を独立させることで、両親は彼女が自分の名義で契約を結んだり、財産を所有したりすることを許可した。"}],"collocations":["forisfamiliate a child","act of forisfamiliating","legal forisfamiliation"],"synonyms":["emancipate","release","free","liberate"],"antonyms":["control","restrict","subjugate"]}],"etymology":{"value":"From Medieval Latin *forisfamiliatus*, past participle of *forisfamiliare*, from Latin *foris* ('outside') + *familia* ('family'). Literally, 'to put outside the family'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɔːrɪsfəˈmɪliˌeɪt/","syllables":"fo-ris-fa-mi-li-ate"},"inflection":{"verb_forms":{"present_simple":["forisfamiliate","forisfamiliates"],"past_simple":"forisfamiliated","past_participle":"forisfamiliated","present_participle":"forisfamiliating"}},"usage_notes":{"explanation":"The term *forisfamiliate* is primarily used in legal contexts, particularly in Scots law and historical legal discussions. It refers to the formal act of a parent granting a child independence and the right to manage their own affairs, effectively removing them from parental control. This is distinct from general emancipation, as it often involves specific legal procedures and recognition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The teenager forisfamiliated himself from his parents.","correct":"✓ The parents forisfamiliated their teenage son.","note":"The verb *forisfamiliate* is transitive; the parents (or legal guardians) perform the action on the child. The child cannot *forisfamiliate* themselves."},{"incorrect":"✗ Forisfamiliating is the same as adoption.","correct":"✓ Forisfamiliating is the opposite of adoption; it grants independence, while adoption establishes a new parent-child relationship.","note":"*Forisfamiliating* grants independence; adoption creates a new family relationship."}],"priority":"★★☆"},"related_words":{"derivatives":["forisfamiliation (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare, legal term)","frequency_google_ngram":"Very low frequency - primarily a legal term with limited usage.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word *forisfamiliate* is a highly specialized legal term, primarily used in Scots law and historical legal contexts. It describes the act of a parent formally granting a child independence and the right to manage their own affairs, effectively removing them from parental control. Due to its rarity and specific legal meaning, it is unlikely to be encountered outside of legal texts or discussions. Understanding requires familiarity with legal terminology and historical legal practices."},"example_sentences":[{"sentence":"The court documents detailed the process by which the father sought to forisfamiliate his daughter.","translation":"裁判所の文書には、父親が娘を独立させようとした経緯が詳しく記載されていた。","type":"verb","meaning_category":"legal"},{"sentence":"Forisfamiliating the heir was a strategic move to ensure the estate's proper management.","translation":"相続人を独立させることは、遺産の適切な管理を確実にするための戦略的な動きだった。","type":"verb","meaning_category":"legal"}]}