{"word":"retention-centric","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"顧客維持（リテンション）を重視する、顧客維持を中心に考える","english_definition":"Focused on or prioritizing customer retention; designed or oriented to maximize the number of customers who continue to do business with a company over time.","examples":[{"sentence":"Our marketing strategy is retention-centric, focusing on building long-term relationships with existing customers.","translation":"当社のマーケティング戦略は顧客維持を重視しており、既存顧客との長期的な関係構築に焦点を当てています。"},{"sentence":"A retention-centric approach requires understanding customer needs and providing excellent service.","translation":"顧客維持を中心としたアプローチでは、顧客のニーズを理解し、優れたサービスを提供する必要があります。"},{"sentence":"The company shifted from an acquisition-centric to a retention-centric model to improve profitability.","translation":"その会社は、収益性を改善するために、顧客獲得中心のモデルから顧客維持中心のモデルへと移行しました。"}],"collocations":["retention-centric strategy (顧客維持中心の戦略)","retention-centric approach (顧客維持中心のアプローチ)","retention-centric model (顧客維持中心のモデル)","retention-centric marketing (顧客維持中心のマーケティング)","retention-centric design (顧客維持中心のデザイン)"],"synonyms":["customer-retention focused","loyalty-driven","customer-centric (in the context of retaining existing customers)"],"antonyms":["acquisition-centric","sales-driven","growth-at-all-costs"]},{"part_of_speech":"adjective","definition":"（情報や知識の）保持を重視する、記憶保持を中心に考える","english_definition":"Focused on or prioritizing the retention of information or knowledge; designed or oriented to maximize the amount of information that is remembered or maintained.","examples":[{"sentence":"The new training program is retention-centric, incorporating spaced repetition and active recall techniques.","translation":"新しいトレーニングプログラムは、間隔反復と能動的想起の手法を取り入れ、情報保持を重視しています。"},{"sentence":"A retention-centric learning environment encourages students to actively engage with the material.","translation":"記憶保持を中心とした学習環境は、学生が教材に積極的に関わることを奨励します。"},{"sentence":"The course design is retention-centric, with regular quizzes and reviews to reinforce learning.","translation":"このコース設計は、学習内容を定着させるために、定期的な小テストと復習を取り入れ、記憶保持を重視しています。"}],"collocations":["retention-centric training (保持中心のトレーニング)","retention-centric learning (保持中心の学習)","retention-centric design (保持中心のデザイン)","retention-centric education (保持中心の教育)"],"synonyms":["memory-focused","knowledge-retention oriented","learning-retention focused"],"antonyms":["information-access focused","discovery-oriented"]}],"etymology":{"value":"Combination of \"retention\" (the act of keeping something) and \"-centric\" (focused on or centered around).","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈtɛnʃən ˈsɛntrɪk/","syllables":"re-ten-tion-cen-tric"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"\"**retention-centric**\" is a compound adjective that describes something designed or focused primarily on retaining customers, information, or knowledge. It is often used in business and education contexts. In a business context, it emphasizes the importance of keeping existing customers rather than solely focusing on acquiring new ones. In an educational context, it emphasizes the importance of remembering and retaining information rather than simply accessing it.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is retention centric.","correct":"✓ The company is retention-centric.","note":"Hyphen is required between \"retention\" and \"centric\" to form a compound adjective."},{"incorrect":"✗ We need to be more retention's centric.","correct":"✓ We need to be more retention-centric.","note":"Possessive form is incorrect. Use the adjective form."}],"priority":"★★☆"},"related_words":{"derivatives":["retention (名詞: 保持、維持)","centric (形容詞: 中心的な)","customer retention (顧客維持)","knowledge retention (知識保持)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency, specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"**retention-centric**\" is a specialized term primarily used in business and educational contexts. It means that something is designed or focused primarily on keeping or retaining something, whether it's customers, information, or knowledge. Understanding the meaning of \"retention\" (the act of keeping something) and \"-centric\" (focused on) is key to understanding the term. It's not a common word in everyday conversation, but it's important to understand in specific professional contexts."},"example_sentences":[{"sentence":"The software's design is **retention-centric**, encouraging users to return daily.","translation":"そのソフトウェアの設計は顧客維持を重視しており、ユーザーが毎日戻ってくるように促しています。","type":"adjective","meaning_category":"Customer Retention"},{"sentence":"The course uses **retention-centric** techniques to help students remember key concepts.","translation":"このコースでは、学生が重要な概念を記憶するのに役立つ、記憶保持を中心とした手法を使用しています。","type":"adjective","meaning_category":"Knowledge Retention"}]}