{"word":"Doraville","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"アメリカ合衆国ジョージア州ディカーブ郡にある都市","english_definition":"A city in DeKalb County, Georgia, United States.","examples":[{"sentence":"Doraville is known for its diverse community and international restaurants.","translation":"ドラビルは、多様なコミュニティと国際的なレストランで知られています。"},{"sentence":"I live in Doraville, near the Buford Highway.","translation":"私はドラビルの、ビュフォードハイウェイの近くに住んでいます。"}],"collocations":["live in Doraville","visit Doraville","Doraville, Georgia"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The city was named after Dora Jack, the wife of the superintendent of the Southern Railway. The \"ville\" suffix is a common element in American place names, derived from the French word for \"town\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɔːrəˈvɪl/","syllables":"Do-ra-ville"},"inflection":{},"usage_notes":{"explanation":"Doraville is a suburban city located northeast of Atlanta, Georgia. It's known for its large immigrant population, particularly Korean and Hispanic communities. Buford Highway, which runs through Doraville, is famous for its diverse array of international restaurants and businesses.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"related_places":["Atlanta","Chamblee","Brookhaven","Norcross"]},"level_frequency":{"frequency_google_ngram":"Low frequency, primarily used in the context of Georgia, USA.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"Doraville is a city name, so understanding it requires geographical knowledge of the Atlanta metropolitan area. The context usually involves discussions about the city's demographics, cultural diversity, or location relative to other Atlanta suburbs.","priority":"★☆☆"},"example_sentences":[{"sentence":"The city of Doraville is undergoing significant redevelopment efforts.","translation":"ドラビル市は大規模な再開発の取り組みを行っています。","type":"noun","meaning_category":"City"},{"sentence":"Many Korean businesses are located in Doraville.","translation":"多くの韓国系企業がドラビルにあります。","type":"noun","meaning_category":"City"},{"sentence":"Doraville is a suburb of Atlanta.","translation":"ドラビルはアトランタの郊外都市です。","type":"noun","meaning_category":"City"}]}