{"word":"angulates","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"角度をつける、角ばらせる","english_definition":"to form or shape into an angle or angles; to give an angular form to.","examples":[{"sentence":"The architect angulated the building's facade to maximize sunlight.","translation":"建築家は、日光を最大限に取り込むために建物のファサードに角度をつけた。"},{"sentence":"The sculptor carefully angulated the metal to create a dynamic effect.","translation":"彫刻家は、ダイナミックな効果を生み出すために金属に注意深く角度をつけた。"}],"collocations":["angulate a line","angulate a surface","angulate a design"],"synonyms":["bend","curve","corner","form an angle","shape"],"antonyms":["round","smooth","curve"]},{"part_of_speech":"verb","transitivity":"vi","definition":"角度をなす、角をなす","english_definition":"to form an angle; to have an angular shape.","examples":[{"sentence":"The branches of the tree angulate sharply upwards.","translation":"木の枝は鋭角に上に向かって伸びている。"},{"sentence":"The coastline angulates irregularly along the bay.","translation":"海岸線は湾に沿って不規則に角度をなしている。"}],"collocations":["angulate upwards","angulate downwards","angulate sharply"],"synonyms":["form an angle","diverge","bend","corner"],"antonyms":["run straight","smoothly curve"]},{"part_of_speech":"adjective","definition":"角度のある、角ばった","english_definition":"having angles; angular.","examples":[{"sentence":"The angulate leaves of the maple tree are easily recognizable.","translation":"カエデの角度のある葉は簡単に見分けられる。"},{"sentence":"The angulate design of the furniture gave the room a modern feel.","translation":"家具の角ばったデザインは、部屋にモダンな雰囲気を与えた。"}],"collocations":["angulate leaves","angulate design","angulate shape"],"synonyms":["angular","cornered","pointed","sharp-cornered"],"antonyms":["rounded","curved","smooth"]}],"etymology":{"value":"Derived from the Latin word \"angulatus,\" the past participle of \"angulare,\" meaning \"to make angular\" or \"to form into an angle.\" This comes from \"angulus,\" meaning \"angle\" or \"corner.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˈæŋɡjʊleɪts/","syllables":"an-gu-lates"},"inflection":{"verb_forms":{"present_simple":["angulate","angulates"],"past_simple":"angulated","past_participle":"angulated","present_participle":"angulating"},"noun_plural":"Not applicable (usually used as a verb or adjective)"},"usage_notes":{"explanation":"The word \"angulate\" is relatively uncommon in everyday language. It is more frequently used in technical or descriptive contexts, such as architecture, geometry, botany, and zoology, to describe something that has angles or is formed into angles. As a verb, it means to create or form an angle, while as an adjective, it describes something that possesses angles.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The river angulates smoothly.","correct":"✓ The river meanders smoothly.","note":"\"Angulate\" implies sharp angles, not smooth curves. Use \"meander\" for smooth curves. "},{"incorrect":"✗ He angulated the circle.","correct":"✓ He approximated the circle with a polygon.","note":"A circle cannot be angulated, as it is defined by its continuous curve. Use a term like \"approximated with a polygon\" to describe a shape with angles that resembles a circle."}],"priority":"★★☆"},"related_words":{"derivatives":["angulation (noun: the act of forming an angle; the state of being angular)","angular (adjective: having angles; sharp-cornered)","angle (noun: the space between two lines or surfaces that meet)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"angulate\" is a relatively advanced term, primarily used in technical or specialized contexts. It describes the process of forming something into an angle or the characteristic of having angles. Understanding its usage requires a familiarity with geometry or technical descriptions in fields like architecture or botany. It is not commonly encountered in everyday conversation or general writing."},"example_sentences":[{"sentence":"The surveyor used a theodolite to accurately angulate the boundaries of the property.","translation":"測量技師は、セオドライトを使用して、その土地の境界線を正確に角度測定した。","type":"verb (vt)","meaning_category":"角度をつける"},{"sentence":"The branches of the shrub angulate sharply, creating a dense thicket.","translation":"低木の枝は鋭角に伸びており、密集したやぶを形成している。","type":"verb (vi)","meaning_category":"角度をなす"},{"sentence":"The angulate pattern of the tiles gave the floor a unique texture.","translation":"タイルの角度のあるパターンは、床に独特の質感を与えた。","type":"adjective","meaning_category":"角度のある"}]}