{"word":"craniognomic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"頭蓋相の、頭蓋骨の形状から性格や能力を判断する","english_definition":"Relating to craniognomy, the study of the relationship between the skull's features and a person's character or abilities.","examples":[{"sentence":"The old book described craniognomic methods for analyzing a person's potential.","translation":"その古い本は、人の潜在能力を分析するための頭蓋相学的な方法を説明していた。"},{"sentence":"Some historical figures believed in craniognomic principles.","translation":"歴史上の人物の中には、頭蓋相学の原則を信じていた者もいた。"}],"collocations":["craniognomic analysis","craniognomic methods","craniognomic principles"],"synonyms":["phrenological","cephalometric"],"antonyms":[]}],"etymology":{"value":"Derived from 'cranio-' (referring to the cranium or skull) and 'gnomic' (referring to gnomy, an obsolete term for phrenology or the study of character from facial features).","priority":"★★★"},"pronunciation":{"ipa":"/ˌkreɪnɪoʊɡˈnɒmɪk/","syllables":"cra-ni-o-gno-mic"},"inflection":{"notes":"Adjective; no specific inflections."},"usage_notes":{"explanation":"'Craniognomic' is a term relating to the obsolete practice of attempting to determine a person's character or abilities based on the features of their skull. It is closely related to phrenology and is generally considered a pseudoscience.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He used craniognomic to treat the patient.","correct":"✓ He used craniometry to measure the skull.","note":"Craniognomy is a pseudoscience, not a treatment. Craniometry is the measurement of the skull. "},{"incorrect":"✗ Craniognomic is a modern scientific method.","correct":"✓ Craniognomy is considered a pseudoscience.","note":"Craniognomy is not a recognized scientific method."}],"priority":"★★★"},"related_words":{"derivatives":["craniognomy"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Craniognomic' is a highly specialized term related to the historical pseudoscience of craniognomy, which attempted to correlate skull features with character traits. Due to its limited use and technical nature, it is not commonly encountered outside specific historical or scientific contexts."},"example_sentences":[{"sentence":"The 19th-century scientist applied a craniognomic approach to understanding human behavior.","translation":"19世紀の科学者は、人間の行動を理解するために頭蓋相学的なアプローチを適用した。","type":"adjective","meaning_category":"頭蓋相の"}]}