{"word":"ruby-eyed","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"ルビーのような目をしている、またはルビーのように赤い目をした","english_definition":"Having eyes that are like rubies in color; having red eyes.","examples":[{"sentence":"The ruby-eyed kitten peered out from under the porch.","translation":"ルビー色の目をした子猫が、玄関のポーチの下から覗き込んだ。"},{"sentence":"The villain was described as ruby-eyed, adding to his menacing appearance.","translation":"悪役はルビーのような目をしていると描写され、彼の脅威的な外見をさらに際立たせていた。"}],"collocations":["a ruby-eyed cat","a ruby-eyed demon","ruby-eyed and fierce"],"synonyms":["red-eyed","crimson-eyed","jewel-eyed"],"antonyms":["blue-eyed","green-eyed"]},{"part_of_speech":"adjective","definition":"（比喩的に）酒に酔って目が赤くなっている","english_definition":"(Figuratively) Having eyes reddened by alcohol consumption.","examples":[{"sentence":"After a night at the pub, he was ruby-eyed and unsteady on his feet.","translation":"パブで一晩過ごした後、彼は目が赤くなり、足元がおぼつかなかった。"}],"collocations":["ruby-eyed drunk","ruby-eyed and staggering"],"synonyms":["bloodshot","bleary-eyed","boozy-eyed"],"antonyms":["sober","clear-eyed"]}],"etymology":{"value":"The term is a compound adjective formed by combining \"ruby\" (a precious stone known for its deep red color) with \"-eyed\" (having eyes of a specified kind).","priority":"★★★"},"pronunciation":{"ipa":"/ˈruːbi aɪd/","syllables":"ru-by-eyed"},"inflection":{"notes":"This is an adjective and does not change form."},"usage_notes":{"explanation":"\"ruby-eyed\" is a descriptive adjective, typically used to describe the color of someone's or something's eyes. It can be used literally to describe eyes that are naturally red or figuratively to describe eyes reddened by alcohol or other causes. The term often evokes a sense of intensity or otherworldliness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is ruby eye.","correct":"✓ He is ruby-eyed.","note":"The correct form is the compound adjective 'ruby-eyed' not 'ruby eye'."},{"incorrect":"✗ The ruby-eyed dog was blue.","correct":"✓ The ruby-eyed dog was brown.","note":"'Ruby-eyed' refers to the color of the eyes, not the overall color of the subject."}],"priority":"★★☆"},"related_words":{"derivatives":["ruby (noun)","eyed (suffix)"],"phrases":["ruby red","red-eyed"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR vocabulary lists)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"ruby-eyed\" is a descriptive adjective that is not commonly used in everyday conversation. It is more often found in literature or descriptive writing to create a vivid image of someone or something with red eyes. The term is relatively easy to understand, as it combines the familiar word \"ruby\" with the suffix \"-eyed.\" However, its infrequent use may make it less familiar to language learners."},"example_sentences":[{"sentence":"The artist painted the dragon with ruby-eyed intensity.","translation":"画家はルビー色の目をした激しい竜を描いた。","type":"literal","meaning_category":"ルビーのような目"},{"sentence":"He stumbled out of the bar, a ruby-eyed mess.","translation":"彼はバーからよろめき出てきた、目は赤くぐちゃぐちゃだった。","type":"figurative","meaning_category":"酒に酔った"}]}