{"word":"voice-oriented","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"音声指向の、音声を中心とした","english_definition":"Designed or optimized for use with voice commands or voice input; focused on voice as the primary mode of interaction.","examples":[{"sentence":"The new app is voice-oriented, allowing users to control it entirely with spoken commands.","translation":"その新しいアプリは音声指向で、ユーザーは完全に音声コマンドで制御できます。"},{"sentence":"We are developing a voice-oriented interface for the elderly who may have difficulty using traditional interfaces.","translation":"従来のインターフェースの使用が難しい高齢者向けに、音声指向のインターフェースを開発しています。"},{"sentence":"The company is investing heavily in voice-oriented technologies to improve accessibility.","translation":"その会社は、アクセシビリティを向上させるために、音声指向の技術に多額の投資をしています。"}],"collocations":["voice-oriented application","voice-oriented technology","voice-oriented interface","voice-oriented system","voice-oriented design"],"synonyms":["voice-activated","speech-based","voice-controlled"],"antonyms":["GUI-based","text-based","visually-oriented"]}],"etymology":{"value":"Combination of 'voice' and 'oriented'. 'Voice' refers to the sound produced by humans when speaking or singing. 'Oriented' means directed towards or focused on something.","priority":"★★★"},"pronunciation":{"ipa":"/ˈvɔɪs ˌɔːriˌɛntɪd/","syllables":"voice-o-ri-en-ted"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"'Voice-oriented' describes systems, applications, or technologies that prioritize voice as the main way users interact with them. This often involves voice recognition and speech synthesis technologies. It's often used in the context of accessibility, hands-free operation, or user convenience.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The program is voice oriented.","correct":"✓ The program is voice-oriented.","note":"The hyphen is important to connect the two words and create a compound adjective."},{"incorrect":"✗ The voice oriented system are efficient.","correct":"✓ The voice-oriented system is efficient.","note":"Ensure subject-verb agreement. 'System' is singular, so use 'is'."}],"priority":"★★☆"},"related_words":{"derivatives":["voice","oriented","orientation"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Voice-oriented' is an adjective used to describe things that are designed to be used primarily with your voice. Think of apps or devices where you can talk to them to make them do things. It's a more technical term, so you might see it in articles about technology or accessibility.","priority":"★★☆"},"example_sentences":[{"sentence":"The car's navigation system is voice-oriented, allowing drivers to set destinations without taking their hands off the wheel.","translation":"その車のナビゲーションシステムは音声指向で、運転者はハンドルから手を離さずに目的地を設定できます。","type":"adjective","meaning_category":"Design"},{"sentence":"Many smart home devices are voice-oriented, making it easy to control lights and appliances with simple commands.","translation":"多くのスマートホームデバイスは音声指向で、簡単なコマンドで照明や家電製品を簡単に制御できます。","type":"adjective","meaning_category":"Technology"},{"sentence":"The software company is developing a voice-oriented solution for transcribing medical records.","translation":"そのソフトウェア会社は、医療記録を書き起こすための音声指向のソリューションを開発しています。","type":"adjective","meaning_category":"Application"}]}