{"word":"prefriendship","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"友情が始まる前の段階、友情関係が成立する前の状態","english_definition":"The state or period before a friendship is established.","examples":[{"sentence":"Their prefriendship was marked by polite but distant interactions.","translation":"彼らの友情が始まる前は、丁寧だがよそよそしいやり取りが特徴だった。"},{"sentence":"The prefriendship phase can be awkward as people try to determine if they are compatible.","translation":"友情が始まる前の段階は、人々が互いに相性が良いかどうかを判断しようとするため、気まずくなることがある。"}],"collocations":["a period of prefriendship","the prefriendship phase","mutual prefriendship"],"synonyms":["acquaintanceship","early acquaintance","preliminary connection"],"antonyms":["friendship","established friendship","close relationship"]}],"etymology":{"value":"\"pre-\" (～の前) + \"friendship\" (友情)","priority":"★★★"},"pronunciation":{"ipa":"/ˌpriːˈfrɛndʃɪp/","syllables":"pree-friend-ship"},"inflection":{"noun_plural":"prefriendships"},"usage_notes":{"explanation":"\"Prefriendship\" describes the time before two people become friends. It's often characterized by getting-to-know-you interactions, determining compatibility, and building initial trust. This term is relatively uncommon and may sound somewhat formal or academic.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They were in prefriendship for many years, but never became friends.","correct":"✓ They were acquaintances for many years, but never became friends.","note":"If the relationship never progresses to friendship, \"acquaintances\" is a more appropriate term than \"prefriendship.\""}],"priority":"☆☆☆"},"related_words":{"derivatives":["pre- (prefix: before)","friend (noun: a person whom one knows and with whom one has a bond of mutual affection)","friendship (noun: a state of mutual affection and cooperation)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Prefriendship' is a less common word that describes the period before a friendship is established. It's useful for discussing the initial stages of a relationship where people are getting to know each other but haven't yet formed a strong bond. Because it's not a frequently used term, it's best used in situations where a precise and somewhat formal description is needed."},"example_sentences":[{"sentence":"During their **prefriendship**, they discovered shared interests in hiking and photography.","translation":"友情が始まる前の段階で、彼らはハイキングと写真撮影という共通の趣味を見つけた。","type":"noun","meaning_category":"初期段階"},{"sentence":"The awkwardness of **prefriendship** faded as they spent more time together.","translation":"一緒に過ごす時間が増えるにつれて、友情が始まる前の気まずさは薄れていった。","type":"noun","meaning_category":"初期段階の感情"}]}