{"word":"prison-bursting","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"刑務所を襲撃する、刑務所から脱走する","english_definition":"Relating to or involving the act of forcibly breaking into or escaping from a prison.","examples":[{"sentence":"The film featured a prison-bursting scene with daring escapes.","translation":"その映画は大胆な脱走劇を伴う刑務所襲撃のシーンを特色としていた。"},{"sentence":"The gang was known for their prison-bursting activities.","translation":"そのギャングは刑務所襲撃活動で知られていた。"}],"collocations":["prison-bursting attempt (刑務所襲撃の試み)","prison-bursting gang (刑務所襲撃ギャング)","prison-bursting plot (刑務所襲撃計画)"],"synonyms":["jailbreaking","prison escaping","prison raiding"],"antonyms":["prison-guarding","prison-maintaining"]}],"etymology":{"value":"The word is a compound of \"prison\" and \"bursting,\" indicating an action of breaking into or out of a prison.","priority":"★★★"},"pronunciation":{"ipa":"/ˈprɪzən ˌbɜːrstɪŋ/","syllables":"pris-on-burst-ing"},"inflection":{"notes":"This is an adjective, so it does not inflect in the same way as verbs or nouns."},"usage_notes":{"explanation":"The term 'prison-bursting' is often used in the context of action movies, crime novels, or historical accounts of daring escapes. It implies a forceful and often violent attempt to breach the security of a prison, either to free inmates or to escape oneself.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was prison-bursting the jail.","correct":"✓ He was bursting out of prison.","note":"'Prison-bursting' is an adjective, not a verb. Use phrasal verbs like 'burst out of prison' for the action."}],"priority":"★★☆"},"related_words":{"derivatives":["prison (noun)","bursting (verb)"],"phrasal_verbs":["burst out of (prison)"],"related_concepts":["jailbreak","escape","prison riot","rescue mission"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'prison-bursting' is a relatively uncommon compound adjective used to describe events or activities related to forcibly breaking into or escaping from a prison. It is more likely to be found in descriptive or narrative contexts, such as crime fiction or historical accounts, rather than in everyday conversation. The word combines the familiar noun 'prison' with the '-ing' form of the verb 'burst,' indicating a dynamic and forceful action. Understanding the meaning requires familiarity with both root words and the concept of compound adjectives."},"example_sentences":[{"sentence":"The novel described a daring prison-bursting operation orchestrated by a group of inmates.","translation":"その小説は、囚人グループによって計画された大胆な刑務所襲撃作戦を描写していた。","type":"adjective","meaning_category":"descriptive"},{"sentence":"The authorities were on high alert due to rumors of a planned prison-bursting attempt.","translation":"当局は、計画された刑務所襲撃の試みの噂のために厳戒態勢をとっていた。","type":"adjective","meaning_category":"event"}]}