{"word":"spoiledly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"甘やかされて、わがままに、ほしいままに","english_definition":"In a spoiled manner; in a way that shows the negative effects of being treated too well or given too much.","examples":[{"sentence":"The child acted spoiledly, demanding more toys despite already having many.","translation":"その子供は甘やかされたように振る舞い、すでにたくさんのおもちゃを持っているにもかかわらず、もっとおもちゃを要求した。"},{"sentence":"She behaved spoiledly at the restaurant, complaining about everything.","translation":"彼女はレストランでわがままに振る舞い、何にでも文句を言った。"},{"sentence":"He spent his inheritance spoiledly, without any regard for the future.","translation":"彼は相続財産をほしいままに使い、将来のことを全く考えなかった。"}],"collocations":["act spoiledly","behave spoiledly","live spoiledly","spend spoiledly"],"synonyms":["selfishly","self-indulgently","capriciously","petulantly","bratty"],"antonyms":["modestly","humbly","selflessly","responsibly"]}],"etymology":{"value":"The word \"spoiledly\" is derived from the adjective \"spoiled,\" which comes from the verb \"spoil.\" The suffix \"-ly\" is added to form the adverb. \"Spoil\" originally meant to plunder or strip of possessions, but its meaning evolved to mean to damage or ruin something, and eventually to overindulge someone, especially a child.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈspɔɪlədli/","syllables":"spoil-ed-ly"},"inflection":{"notes":"Adverbs do not typically inflect; however, this word is formed by adding '-ly' to the adjective 'spoiled'."},"usage_notes":{"explanation":"\"Spoiledly\" describes an action or behavior that exhibits the characteristics of someone who has been spoiled. It implies a lack of consideration for others, excessive demands, and a general sense of entitlement. This adverb is often used to criticize or negatively describe someone's actions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She spoiledly the child.","correct":"✓ She spoiled the child.","note":"\"Spoiledly\" is an adverb and modifies verbs, adjectives, or other adverbs. \"Spoil\" is the verb meaning to overindulge. Use \"spoiledly\" to describe how someone acts, not to describe the act of spoiling itself."},{"incorrect":"✗ He is spoiledly.","correct":"✓ He is spoiled. / ✓ He acts spoiledly.","note":"\"Spoiledly\" is an adverb and cannot be used as a predicate adjective. Use \"spoiled\" as the adjective or use a verb like \"act\" or \"behave\" and modify it with \"spoiledly.\""}],"priority":"★★☆"},"related_words":{"derivatives":["spoil (verb)","spoiled (adjective)","spoiling (noun)","spoiler (noun)"],"phrasal_verbs":[],"related_adjectives":["spoiled","bratty","pampered"],"related_nouns":["spoiled brat","spoiled child"]},"level_frequency":{"CEFR":"B2 (Likely understood but not commonly used)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"spoiledly\" describes how someone behaves when they have been given too much attention, praise, or material possessions, leading to negative traits like being demanding, entitled, or inconsiderate. It's not a very common word, but it's useful for describing actions that show the negative effects of being spoiled. It's important to remember that \"spoiledly\" is an adverb, so it modifies verbs, adjectives, or other adverbs, not nouns."},"example_sentences":[{"sentence":"The prince acted spoiledly, refusing to eat anything that wasn't prepared exactly to his liking.","translation":"王子は甘やかされたように振る舞い、自分の好みに正確に調理されていないものは何も食べようとしなかった。","type":"adverb","meaning_category":"甘やかされて"},{"sentence":"She spent her parents' money spoiledly, buying expensive clothes and jewelry.","translation":"彼女は両親のお金をほしいままに使い、高価な服や宝石を買った。","type":"adverb","meaning_category":"ほしいままに"},{"sentence":"He complained spoiledly about the slow service, even though the restaurant was very busy.","translation":"彼はレストランが非常に混雑していたにもかかわらず、サービスの遅さにわがままに文句を言った。","type":"adverb","meaning_category":"わがままに"}]}