{"word":"premutinied","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"(rare, archaic) past tense and past participle of 'premutiny': to show signs of or engage in actions leading up to a mutiny before the actual mutiny occurs.","english_definition":"(rare, archaic) Showed signs of or engaged in actions leading up to a mutiny before the actual mutiny occurred.","examples":[{"sentence":"The crew premutinied for several weeks before finally seizing control of the ship.","translation":"乗組員は船を乗っ取る数週間前から反乱の兆候を見せていた。"}],"collocations":[],"synonyms":["insubordinate","rebellious","discontented"],"antonyms":["obedient","loyal","submissive"]}],"etymology":{"value":"Derived from 'pre-' (before) + 'mutiny' (an open rebellion against constituted authority, especially by sailors or soldiers against their officers).","priority":"N/A"},"pronunciation":{"ipa":"/ˌpriːˈmjuːtɪniːd/","syllables":"pre-mu-ti-nied"},"inflection":{"verb_forms":{"present_simple":["premutiny","premutinies"],"past_simple":"premutinied","past_participle":"premutinied","present_participle":"premutinying"}},"usage_notes":{"explanation":"'Premutinied' is an extremely rare and archaic word. It describes the state of showing signs of or engaging in actions that precede a full-blown mutiny. It is unlikely to be encountered in modern usage.","priority":"N/A"},"common_mistakes":{},"related_words":{"derivatives":["premutiny (verb, noun)","mutiny (noun, verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Extremely rare; not found in common corpora.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"This word is highly specialized and unlikely to be encountered outside of historical or academic contexts related to naval or military history. Its meaning is relatively transparent given the prefix 'pre-' and the root word 'mutiny,' but its rarity makes it unsuitable for general language learners."},"example_sentences":[{"sentence":"The historical records indicated that the sailors had premutinied for weeks, engaging in acts of sabotage and insubordination.","translation":"歴史的記録は、船員たちが数週間前からサボタージュや反抗行為を行い、反乱の兆候を見せていたことを示している。","type":"verb","meaning_category":"showing signs of mutiny"}]}