{"word":"Watergate","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ウォーターゲート事件（米国政治スキャンダル）","english_definition":"A major political scandal in the United States involving the abuse of power and bribery and obstruction of justice; an illegal break-in at the Democratic National Committee offices in the Watergate complex in Washington was covered up by high-level officials in the Nixon administration.","examples":[{"sentence":"The Watergate scandal led to Nixon's resignation.","translation":"ウォーターゲート事件はニクソンの辞任につながった。"},{"sentence":"Watergate remains a symbol of political corruption.","translation":"ウォーターゲートは政治腐敗の象徴であり続けている。"}],"collocations":["Watergate scandal","Watergate break-in","Watergate tapes","post-Watergate era"],"synonyms":["Nixon scandal"],"antonyms":[]},{"part_of_speech":"noun","definition":"（一般的に）スキャンダル、不正行為","english_definition":"Any scandal involving abuses of power, corruption, or cover-ups.","examples":[{"sentence":"This new controversy has become their latest 'Watergate'.","translation":"この新たな論争は、彼らにとって最新の「ウォーターゲート」となった。"},{"sentence":"The media is calling it 'Travelgate', a clear reference to Watergate.","translation":"メディアはそれを「トラベルゲート」と呼んでおり、ウォーターゲートを明らかに意識している。"}],"collocations":["a political Watergate","a corporate Watergate"],"synonyms":["scandal","cover-up","corruption"],"antonyms":[]}],"etymology":{"value":"The name comes from the Watergate Hotel and office complex in Washington, D.C., where the Democratic National Committee headquarters were located and burglarized in 1972.","priority":"★★★"},"pronunciation":{"ipa":"/ˈwɔːtərɡeɪt/","syllables":"Wa-ter-gate"},"inflection":{"noun_plural":"Watergates (rarely used)"},"usage_notes":{"explanation":"'Watergate' primarily refers to the specific political scandal involving President Nixon. However, it's also used more generally to describe any significant scandal, especially those involving political corruption, abuse of power, or attempts to cover up wrongdoing. When used in this broader sense, it's often attached as a suffix to the name of the event or issue (e.g., 'Deflategate', 'Bridgegate').","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was involved in the water gate scandal.","correct":"✓ He was involved in the Watergate scandal.","note":"'Watergate' is a proper noun and should be capitalized."},{"incorrect":"✗ The watergate lead to his downfall.","correct":"✓ Watergate led to his downfall.","note":"'Watergate' is a proper noun and should be capitalized."}],"priority":"★★☆"},"related_words":{"derivatives":["Watergate baby (a politician elected in the wake of the Watergate scandal)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively high frequency, especially in historical or political contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Watergate' is a term primarily associated with a specific historical event: the Watergate scandal involving President Nixon. Understanding its meaning requires knowledge of this historical context. It is also used more broadly to refer to any significant political scandal involving corruption, abuse of power, or cover-ups. Its usage often implies a serious breach of trust and ethical misconduct.","priority":"★★☆"},"example_sentences":[{"sentence":"The **Watergate** scandal shook the nation's confidence in its leaders.","translation":"ウォーターゲート事件は、国の指導者に対する国民の信頼を揺るがした。","type":"noun","meaning_category":"ウォーターゲート事件"},{"sentence":"Some see this latest controversy as their own version of **Watergate**.","translation":"この最新の論争を、彼ら自身のウォーターゲート事件と見なす人もいる。","type":"noun","meaning_category":"スキャンダル"}]}