{"word":"Anti-mosaical","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"反モーセ的な、モーセの律法に反対する","english_definition":"Opposed to or rejecting the Mosaic law or principles.","examples":[{"sentence":"The group held anti-mosaical views, advocating for a more liberal interpretation of religious texts.","translation":"そのグループは反モーセ的な見解を持ち、宗教文書のより自由な解釈を提唱した。"},{"sentence":"His writings were considered anti-mosaical by some, as they challenged traditional interpretations of the Torah.","translation":"彼の著作は、トーラーの伝統的な解釈に異議を唱えたため、一部の人々によって反モーセ的であると見なされた。"}],"collocations":["anti-mosaical views","anti-mosaical arguments","anti-mosaical teachings"],"synonyms":["non-Mosaic","un-Mosaic","heterodox","dissenting"],"antonyms":["mosaical","pro-Mosaic","orthodox","traditional"]}],"etymology":{"value":"\"Anti-\" (反対) + \"mosaical\" (モーセの、モーセ律法の)","priority":"Medium"},"pronunciation":{"ipa":"/ˌæntiːmoʊˈzeɪɪkəl/","syllables":"An-ti-mo-sai-i-cal"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"The term \"Anti-mosaical\" is used to describe beliefs, arguments, or teachings that are in opposition to the Mosaic law, which is traditionally attributed to Moses in the Hebrew Bible. It is often used in theological or religious contexts to discuss differing interpretations or rejections of Mosaic principles.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"✗ He was very anti-mosaical in his approach to art.","correct":"✓ His views on religious law were anti-mosaical.","note":"The term is typically used in religious or theological contexts, not generally applied to art or other unrelated subjects."}],"priority":"Low"},"related_words":{"derivatives":["Anti-Mosaic (noun or adjective)"],"related_terms":["Mosaic","Mosaic law","Torah","Old Testament","Judaism","Christianity","Theology"]},"level_frequency":{"frequency_google_ngram":"Very Low Frequency","priority":"Low"},"readability_explanation":{"level":"C2","text":"The term \"Anti-mosaical\" is a specialized term primarily used in theological or religious discussions. Understanding requires familiarity with the Mosaic law and its significance within Judaism and Christianity. Due to its specific and relatively rare usage, it is considered an advanced term."},"example_sentences":[{"sentence":"The philosopher presented an anti-mosaical argument against strict adherence to ancient laws.","translation":"その哲学者は、古代の法律への厳格な遵守に反対する反モーセ的な議論を提示した。","type":"general","meaning_category":"反モーセ的な議論"},{"sentence":"Some early Christian sects were labeled as anti-mosaical because they rejected certain aspects of Jewish law.","translation":"初期のキリスト教宗派の中には、ユダヤ教の律法の特定の側面を拒否したため、反モーセ的であると見なされたものがあった。","type":"historical","meaning_category":"歴史的な文脈での反モーセ的"}]}