{"word":"non-radiant","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"放射しない、光を放たない、熱を放射しない","english_definition":"Not radiating; not emitting radiation, light, or heat.","examples":[{"sentence":"A non-radiant heater warms objects directly without heating the air.","translation":"非放射ヒーターは、空気を暖めることなく物体を直接暖めます。"},{"sentence":"The material is non-radiant, so it doesn't glow in the dark.","translation":"その素材は放射性ではないので、暗闇で光りません。"},{"sentence":"Non-radiant energy transfer involves the transfer of energy without the emission of photons.","translation":"非放射エネルギー移動は、光子の放出を伴わないエネルギー移動を伴います。"}],"collocations":["non-radiant energy","non-radiant heat","non-radiant transfer","non-radiant process"],"synonyms":["non-emitting","dark","unilluminated"],"antonyms":["radiant","emitting","luminous","glowing"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to the word 'radiant'. 'Radiant' comes from the Latin word 'radians', the present participle of 'radiare', meaning 'to emit rays, shine'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈreɪdiənt/","syllables":"non-ra-di-ant"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Non-radiant' is used to describe something that does not emit energy in the form of radiation, light, or heat. It's often used in scientific and technical contexts. It is the direct opposite of 'radiant'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sun is non-radiant at night.","correct":"✓ The sun is non-radiant to us at night. / The sun's light does not reach us at night.","note":"The sun is always radiating, but its light may not reach us. The statement needs clarification. Alternatively, rephrase to indicate the absence of light reaching the observer."},{"incorrect":"✗ Non-radiant is a good thing for nuclear waste.","correct":"✓ Being non-radiant is a desirable characteristic for nuclear waste.","note":"'Non-radiant' is a property. It's better to say that *being* non-radiant is desirable."}],"priority":"★★☆"},"related_words":{"derivatives":["nonradiation (noun): absence of radiation"],"related_terms":["radiation (noun): the emission of energy as electromagnetic waves or as moving subatomic particles.","radiant (adjective): emitting light or heat; shining or glowing brightly."]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Non-radiant' is a technical term used to describe something that does not emit radiation, light, or heat. It's used in scientific and engineering contexts, so it's not a common word in everyday conversation. Understanding the meaning of 'radiant' is essential to understanding 'non-radiant'."},"example_sentences":[{"sentence":"The black paint was chosen because it is non-radiant and absorbs light well.","translation":"その黒い塗料は、放射性がなく、光をよく吸収するため選ばれました。","type":"adjective","meaning_category":"not emitting light"},{"sentence":"Non-radiant cooling systems are becoming more popular due to their energy efficiency.","translation":"非放射冷却システムは、エネルギー効率の高さから人気が高まっています。","type":"adjective","meaning_category":"not emitting heat"},{"sentence":"The detector is designed to be insensitive to non-radiant forms of energy.","translation":"その検出器は、非放射型のエネルギーに感度が低くなるように設計されています。","type":"adjective","meaning_category":"not emitting radiation"}]}