{"word":"demagnetization","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"消磁、非磁化","english_definition":"The process of removing or reducing a magnetic field.","examples":[{"sentence":"The demagnetization of the recording head improved the sound quality.","translation":"記録ヘッドの消磁により、音質が向上した。"},{"sentence":"Demagnetization can be achieved by heating the material above its Curie temperature.","translation":"消磁は、材料をキュリー温度以上に加熱することで達成できる。"}],"collocations":["thermal demagnetization (熱消磁)","alternating field demagnetization (交流磁場消磁)","demagnetization factor (反磁場係数)"],"synonyms":["degaussing","magnetic neutralization"],"antonyms":["magnetization"]}],"etymology":{"value":"Derived from 'demagnetize' (to remove magnetism), which combines the prefix 'de-' (meaning 'removal' or 'reversal') with 'magnetize' (to induce magnetism).","priority":"★★☆"},"pronunciation":{"ipa":"/diːˌmæɡnɪtaɪˈzeɪʃən/","syllables":"dee-mag-ni-ti-za-tion"},"inflection":{"noun_plural":"demagnetizations"},"usage_notes":{"explanation":"'Demagnetization' refers to the process of reducing or eliminating the magnetic field of a material or object. It is commonly used in contexts such as data security (erasing data from magnetic storage devices), industrial processes, and scientific research. The term is often used in physics, engineering, and materials science.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The demagnetization was happen to the magnet.","correct":"✓ Demagnetization occurred in the magnet.","note":"'Demagnetization' is a noun, so it's more appropriate to say it 'occurred' or 'happened' rather than using it as a verb directly."},{"incorrect":"✗ Demagnetization is when you make something magnetic.","correct":"✓ Demagnetization is when you remove magnetism from something.","note":"Demagnetization is the opposite of magnetization; it's the removal, not the creation, of magnetism."}],"priority":"★★☆"},"related_words":{"derivatives":["demagnetize (verb)","demagnetized (adjective)","demagnetizer (noun)"],"related_terms":["magnetization","magnetic field","coercivity","remanence"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Demagnetization' is a technical term that describes the process of removing or reducing a magnetic field. It's often used in scientific or engineering contexts. Understanding this term requires knowledge of basic magnetism and related concepts. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The hard drive underwent demagnetization to ensure data security.","translation":"データセキュリティを確保するために、ハードドライブは消磁処理を受けた。","type":"general","meaning_category":"消磁"},{"sentence":"Thermal demagnetization is a common method used in paleomagnetism.","translation":"熱消磁は古地磁気学で一般的に使用される方法である。","type":"technical","meaning_category":"消磁"},{"sentence":"The demagnetization factor affects the effective magnetic field within the material.","translation":"反磁場係数は、材料内の有効磁場に影響を与える。","type":"technical","meaning_category":"消磁"}]}