{"word":"antiadiaphorist","priority":"低","meanings":[{"part_of_speech":"noun","definition":"(歴史)アディアフォラ論争において、アディアフォラ（信仰に関わらないとされる事柄）に反対する人。特に、信仰の自由を擁護し、宗教的な儀式や慣習の強制に反対した16世紀のプロテスタント神学者。","english_definition":"(historical) A person who opposed adiaphorism in the Adiaphoristic Controversy; specifically, a 16th-century Protestant theologian who defended religious freedom and opposed the imposition of religious ceremonies or practices considered indifferent.","examples":[{"sentence":"The antiadiaphorists argued that even seemingly indifferent matters could compromise one's faith if imposed by authority.","translation":"反アディアフォラ主義者たちは、たとえ一見無関係な事柄であっても、権威によって強制されれば信仰を損なう可能性があると主張した。"}],"collocations":["adiaphoristic controversy","religious freedom","theological debate"],"synonyms":["confessionalist","strict constructionist"],"antonyms":["adiaphorist","latitudinarian"],"notes":"This term is primarily used in historical and theological contexts."}],"etymology":{"value":"The word is formed from \"anti-\" (against) + \"adiaphorist\" (one who believes in adiaphora).","priority":"中"},"pronunciation":{"ipa":"/ˌæntiˌeɪdiəˈfɔːrɪst/","syllables":"an-ti-a-di-a-pho-rist"},"inflection":{"noun_plural":"antiadiaphorists"},"usage_notes":{"explanation":"The term is specific to the historical context of the Adiaphoristic Controversy during the Reformation. It refers to those who believed that certain religious practices, even if not explicitly commanded or forbidden in scripture, were not indifferent and could affect one's faith.","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"✗ He was an antiadiaphorist in his political views.","correct":"✓ He was a staunch defender of religious freedom.","note":"The term is specific to religious and theological contexts, not general political views."}],"priority":"低"},"related_words":{"derivatives":["antiadiaphorism (noun)"],"related_terms":["adiaphora","adiaphorist","Reformation","Philipp Melanchthon","Matthias Flacius"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"低"},"readability_explanation":{"level":"C2","text":"The word \"antiadiaphorist\" is a highly specialized term used in the context of Reformation history and theology. It refers to someone who opposed the view that certain religious practices are indifferent (adiaphora) and do not affect salvation. Understanding this term requires knowledge of 16th-century religious debates. It is unlikely to be encountered outside of academic or historical discussions."}}