{"word":"indefectibility","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主にキリスト教神学) 不滅性、堕落しない性質、誤りえない性質","english_definition":"The quality or state of being indefectible; specifically, in Christian theology, the doctrine that the Church, in its essential nature, will remain until the end of time, without falling away from the truth.","examples":[{"sentence":"The indefectibility of the Church is a key tenet of Catholic theology.","translation":"教会の不滅性は、カトリック神学の重要な教義です。"},{"sentence":"Some theologians debate the precise meaning and extent of the Church's indefectibility.","translation":"一部の神学者は、教会の不滅性の正確な意味と範囲について議論しています。"}],"collocations":["Church's indefectibility (教会の不滅性)","doctrine of indefectibility (不滅性の教義)"],"synonyms":["infallibility","incorruptibility","permanence","immutability"],"antonyms":["defectibility","corruptibility","mutability","impermanence"]}],"etymology":{"value":"Derived from the Late Latin word \"indefectibilis,\" meaning \"not liable to fail or be deficient.\" This is formed from the prefix \"in-\" (not) + \"defectibilis\" (liable to fail), which comes from \"deficere\" (to fail, to desert).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪndɪˌfɛktɪˈbɪlɪti/","syllables":"in-di-fec-ti-bil-i-ty"},"inflection":{"noun_plural":"indefectibilities"},"usage_notes":{"explanation":"\"Indefectibility\" is primarily a theological term, particularly within Roman Catholicism, Eastern Orthodoxy, and some other Christian denominations. It refers to the idea that the Church, as a whole, cannot permanently fall away from essential Christian doctrines. It does not mean that individual members or leaders of the Church are incapable of sin or error, but rather that the Church as a divinely instituted body will be preserved in truth until the end of time. The term is often used in discussions about the authority and trustworthiness of the Church's teachings.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The indefectibility of the pope means he can never make a mistake.","correct":"✓ The infallibility of the pope means he is incapable of error when speaking ex cathedra on matters of faith and morals.","note":"Indefectibility applies to the Church as a whole, while infallibility, in Catholic theology, specifically applies to the Pope under certain conditions (ex cathedra teachings)."},{"incorrect":"✗ Indefectibility guarantees that all members of the church will be perfect.","correct":"✓ Indefectibility guarantees that the Church will not fall away from essential truths, but it does not guarantee the perfection of its members.","note":"Indefectibility does not imply the perfection of individual members, but rather the preservation of the Church in truth."}],"priority":"★☆☆"},"related_words":{"derivatives":["indefectible (adjective)"],"related_terms":["infallibility","heresy","apostasy","dogma","doctrine"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Indefectibility\" is a complex theological term primarily used in Christian contexts, especially within Catholicism and Eastern Orthodoxy. It describes the characteristic of the Church to remain faithful to its essential doctrines until the end of time. This term is not commonly used in everyday language and requires a deep understanding of theological concepts to comprehend fully. It is more likely to be encountered in academic or religious texts. Understanding this word requires familiarity with theological discourse and the specific doctrines it relates to."},"example_sentences":[{"sentence":"The doctrine of **indefectibility** assures believers that the Church will always uphold the true teachings of Christ.","translation":"不滅性の教義は、教会が常にキリストの真の教えを支持することを信者に保証します。","type":"general","meaning_category":"theological doctrine"},{"sentence":"Despite facing numerous challenges throughout history, the Church maintains its **indefectibility**.","translation":"歴史を通じて数々の課題に直面してきたにもかかわらず、教会はその不滅性を維持しています。","type":"historical","meaning_category":"historical context"},{"sentence":"Critics of the Church often challenge the concept of **indefectibility**, pointing to historical errors and scandals.","translation":"教会の批判者は、歴史的な誤りやスキャンダルを指摘して、不滅性の概念に異議を唱えることがよくあります。","type":"critical","meaning_category":"critical perspective"}]}