{"word":"undiagrammed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(文法) 図解されていない、図式化されていない","english_definition":"Not diagrammed; not represented in a diagram. (grammar) Not having been subjected to sentence diagramming.","examples":[{"sentence":"The complex sentence remained undiagrammed due to its intricate structure.","translation":"その複雑な文は、複雑な構造のため図解されないままだった。"},{"sentence":"The teacher asked the students to diagram the sentence, but some parts remained undiagrammed.","translation":"先生は生徒にその文を図解するように頼んだが、一部は図解されないままだった。"}],"collocations":["remain undiagrammed","parts undiagrammed"],"synonyms":["unmapped","uncharted","unillustrated"],"antonyms":["diagrammed","charted","illustrated"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to the word 'diagrammed', the past participle of the verb 'diagram'. 'Diagram' itself comes from Greek 'diagramma' (figure, plan), from 'diagraphein' (to mark out by lines).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˈdaɪəˌɡræmd/","syllables":"un-di-a-grammed"},"inflection":{"notes":"This word does not inflect as it is an adjective."},"usage_notes":{"explanation":"'Undiagrammed' is primarily used in the context of grammar and linguistics, specifically referring to sentences or phrases that have not been visually represented using a diagram. Sentence diagramming is a method of visually representing the grammatical structure of a sentence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The undiagrammed instructions were difficult to follow.","correct":"✓ The unillustrated instructions were difficult to follow.","note":"'Undiagrammed' is specific to grammatical diagrams. For general illustrations, use 'unillustrated'."}],"priority":"★☆☆"},"related_words":{"derivatives":["diagram (noun, verb)","diagrammatic (adjective)","diagrammatically (adverb)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'undiagrammed' is a specialized term primarily used in the field of grammar and linguistics. It describes something that has not been represented visually using a diagram. Understanding this word requires familiarity with the concept of diagramming sentences, a method used to visually represent grammatical structure. Therefore, its readability is higher, suitable for advanced learners or those in related fields."},"example_sentences":[{"sentence":"The professor noted that several sentences in the student's essay were grammatically complex and remained undiagrammed.","translation":"教授は、学生のエッセイのいくつかの文が文法的に複雑で、図解されていないままであると指摘した。","type":"adjective","meaning_category":"(文法) 図解されていない"}]}