{"word":"unimperiously","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"横柄でない様子で、尊大でない様子で","english_definition":"in a manner that is not imperious; without being domineering or arrogant.","examples":[{"sentence":"She asked the question unimperiously, with genuine curiosity.","translation":"彼女は横柄な態度ではなく、純粋な好奇心からその質問をした。"},{"sentence":"He offered his assistance unimperiously, making it clear he was there to help, not to take over.","translation":"彼は尊大な態度ではなく、手助けを申し出て、自分が支配するのではなく、助けるためにそこにいることを明確にした。"}],"collocations":["speak unimperiously","act unimperiously","behave unimperiously"],"synonyms":["humbly","modestly","meekly","respectfully","politely","gently"],"antonyms":["imperiously","arrogantly","domineeringly","haughtily","pompously"]}],"etymology":{"value":"\"un-\" (not) + \"imperiously\" (in an imperious manner). \"Imperious\" comes from Latin \"imperiosus\" (commanding, powerful), from \"imperium\" (command, power, empire).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnɪmˈpɪəriəsli/","syllables":"un-im-pe-ri-ous-ly"},"inflection":{"notes":"Adverb; no inflection."},"usage_notes":{"explanation":"\"Unimperiously\" describes actions or behaviors that lack the qualities of being imperious. An imperious person acts in a domineering, arrogant, or haughty manner, as if they have unlimited power or authority. Therefore, to act \"unimperiously\" is to act without such arrogance or assumption of power. This adverb is relatively rare and is typically used in formal writing or speech to emphasize the absence of domineering behavior.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She unimperiously ignored him.","correct":"✓ She politely ignored him.","note":"Ignoring someone is difficult to do unimperiously. It is better to use a different adverb such as 'politely' or 'respectfully' to convey a more appropriate meaning."},{"incorrect":"✗ The unimperiously king.","correct":"✓ The king acted unimperiously.","note":"\"Unimperiously\" is an adverb and modifies a verb. It cannot be used to describe a noun directly. Instead, describe how someone acts or behaves."}],"priority":"★★☆"},"related_words":{"derivatives":["imperious (adjective)","imperiously (adverb)","imperiousness (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Unimperiously\" means doing something without acting like you're in charge or better than others. It's the opposite of being bossy or arrogant. This word is not very common and is used in formal contexts to describe someone who is respectful and humble. Think of it as the way a kind and considerate leader might behave, making sure not to come across as superior or demanding."},"example_sentences":[{"sentence":"The queen, known for her humility, greeted the villagers unimperiously.","translation":"謙虚さで知られる女王は、村人たちを横柄な態度ではなく迎え入れた。","type":"adverb","meaning_category":"not domineering"},{"sentence":"He offered his opinion unimperiously, making sure to acknowledge the expertise of others in the room.","translation":"彼は部屋にいる他の専門家の知識を認め、尊大な態度ではなく自分の意見を述べた。","type":"adverb","meaning_category":"not arrogant"},{"sentence":"She accepted the award unimperiously, giving credit to her team and mentors.","translation":"彼女はチームと指導者に感謝の意を表し、横柄な態度ではなく賞を受け取った。","type":"adverb","meaning_category":"not haughty"}]}