{"word":"hysterogenetic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ヒステリーを引き起こす、ヒステリーの原因となる","english_definition":"Causing or tending to cause hysteria.","examples":[{"sentence":"The doctor believed the patient's environment was hysterogenetic.","translation":"医者は患者の環境がヒステリーの原因になっていると考えていた。"}],"collocations":[],"synonyms":["hysteria-inducing","stressful","traumatic"],"antonyms":["calming","soothing"]}],"etymology":{"value":"From the Greek words 'hystero-' (relating to the uterus) and 'genetic' (relating to origin or production). Historically, hysteria was often associated with the uterus, hence the term.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɪstəroʊdʒəˈnɛtɪk/","syllables":"his-te-ro-ge-net-ic"},"inflection":{},"usage_notes":{"explanation":"The term 'hysterogenetic' is relatively rare and often used in medical or psychological contexts. It implies that something has the capacity to trigger or contribute to the development of hysteria, a condition characterized by emotional excess and physical symptoms.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["hysterogen (noun: a substance or factor that causes hysteria)","hysteria (noun: a condition characterized by emotional excess)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hysterogenetic' is a highly specialized term, primarily used in medical or psychological contexts to describe something that causes or contributes to hysteria. Due to its limited use and technical nature, it is not commonly encountered in general language. Understanding requires knowledge of medical terminology and the historical association of hysteria with the uterus."},"example_sentences":[{"sentence":"The novel's graphic descriptions were considered hysterogenetic by some critics.","translation":"その小説の生々しい描写は、一部の批評家によってヒステリーを引き起こすと見なされた。","type":"general","meaning_category":"causing hysteria"},{"sentence":"The therapist explored whether the patient's childhood trauma was hysterogenetic.","translation":"セラピストは、患者の子供時代のトラウマがヒステリーの原因であるかどうかを調査した。","type":"medical","meaning_category":"causing hysteria"}]}