{"word":"thunder-guiding","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Guiding or directing thunder; often used in mythology or fantasy to describe beings or objects that control or influence thunder.","english_definition":"Describing something that guides or directs thunder, often in a mythological or fantastical context.","examples":[{"sentence":"The thunder-guiding deity commanded the storm to cease.","translation":"雷を操る神は嵐が止むように命じた。"},{"sentence":"His staff was said to be thunder-guiding, capable of summoning storms.","translation":"彼の杖は雷を導くとされ、嵐を呼び起こすことができた。"}],"collocations":["thunder-guiding deity","thunder-guiding staff","thunder-guiding power"],"synonyms":["thunder-controlling","storm-commanding","lightning-wielding"],"antonyms":["thunder-obeying","thunder-receiving"]}],"etymology":{"value":"A compound word formed by combining \"thunder\" (referring to the loud crash of sound accompanying a lightning discharge) and \"guiding\" (indicating the act of directing or controlling).","priority":"★★★"},"pronunciation":{"ipa":"/ˈθʌndərˌɡaɪdɪŋ/","syllables":"thun-der-guid-ing"},"inflection":{"notes":"This word is primarily used as an adjective and does not typically have different inflections."},"usage_notes":{"explanation":"The term \"thunder-guiding\" is not commonly found in everyday language. It is more often used in creative writing, such as fantasy novels or mythological descriptions, to evoke a sense of power and control over natural forces. It suggests an entity or object that can influence or direct the path and intensity of thunder.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was thunder guiding the weather.","correct":"✓ He was thunder-guiding the weather.","note":"The correct form is \"thunder-guiding\" (with a hyphen) when used as a compound adjective. The verb form would require a different construction."}],"priority":"☆☆☆"},"related_words":{"derivatives":["thunder","guiding","thunderous","guide"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Not a standard CEFR word)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term \"thunder-guiding\" is a niche adjective, primarily found in fantasy or mythological contexts. It describes something that controls or directs thunder, combining \"thunder\" (the sound of a storm) with \"guiding\" (the act of directing). Due to its specialized usage, it is not part of standard language curricula and would be considered advanced vocabulary. Understanding requires familiarity with both compound words and the themes of mythology or fantasy. "},"example_sentences":[{"sentence":"The ancient texts spoke of a thunder-guiding artifact hidden deep within the mountains.","translation":"古代の文献には、山奥深くに隠された雷を操るアーティファクトについて書かれていた。","type":"adjective","meaning_category":"mythological/fantasy"},{"sentence":"As the storm raged, the shaman performed a ritual, hoping to become thunder-guiding.","translation":"嵐が吹き荒れる中、シャーマンは雷を操る存在になることを願って儀式を行った。","type":"adjective","meaning_category":"spiritual/ceremonial"}]}