{"word":"biosimilar","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"バイオシミラー、バイオ後続品","english_definition":"A biological product that is highly similar to an already approved biological product (reference product).","examples":[{"sentence":"Biosimilars offer a more affordable alternative to expensive biologic drugs.","translation":"バイオシミラーは、高価なバイオ医薬品のより手頃な代替品を提供する。"},{"sentence":"The development of biosimilars has increased competition in the pharmaceutical market.","translation":"バイオシミラーの開発は、医薬品市場における競争を激化させている。"}],"collocations":["develop a biosimilar (バイオシミラーを開発する)","approve a biosimilar (バイオシミラーを承認する)","biosimilar drug (バイオシミラー医薬品)","reference product (参照製品)","interchangeable biosimilar (互換性のあるバイオシミラー)"],"synonyms":["follow-on biologic","subsequent entry biologic"],"antonyms":["reference product","innovator biologic"]},{"part_of_speech":"adjective","definition":"バイオシミラーの","english_definition":"Relating to a biosimilar.","examples":[{"sentence":"The company is focusing on the development of biosimilar products.","translation":"その会社はバイオシミラー製品の開発に注力している。"},{"sentence":"Biosimilar competition is expected to drive down prices.","translation":"バイオシミラーの競争は価格を下げるだろうと予想されている。"}],"collocations":["biosimilar product (バイオシミラー製品)","biosimilar competition (バイオシミラー競争)","biosimilar market (バイオシミラー市場)"],"synonyms":["follow-on biologic","subsequent entry biologic"],"antonyms":["innovator"]}],"etymology":{"value":"'Bio-' (biological) + 'similar' (similar to an existing biological product).","priority":"★★★"},"pronunciation":{"ipa":"/ˌbaɪoʊˈsɪmɪlər/","syllables":"bi-o-sim-i-lar"},"inflection":{"noun_plural":"biosimilars"},"usage_notes":{"explanation":"A biosimilar is not a generic version of a biologic drug. Biologics are complex molecules derived from living organisms, making it impossible to create an exact copy. Instead, a biosimilar is highly similar to the reference product, with no clinically meaningful differences in safety, purity, and potency.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Biosimilars are identical to the original biologic drugs.","correct":"✓ Biosimilars are highly similar, but not identical, to the original biologic drugs.","note":"Biosimilars are similar but not identical due to the complexity of biological manufacturing processes."},{"incorrect":"✗ Biosimilars are always cheaper and therefore better.","correct":"✓ Biosimilars are typically cheaper, but the decision to use a biosimilar should be made in consultation with a healthcare professional.","note":"While biosimilars are often more affordable, the choice should be based on clinical considerations and professional advice."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["biologic","biopharmaceutical","generic drug","pharmaceuticals","clinical trial"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency but increasing due to growing importance in pharmaceutical discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'biosimilar' refers to a biological medicine that is very similar to another already approved biological medicine (known as the 'reference product'). Because biological medicines are made from living cells, it's impossible to make an exact copy like you can with regular chemical drugs (generics). Instead, a biosimilar has to prove it is highly similar in terms of its structure, function, and clinical effect. The goal of biosimilars is to provide more treatment options and potentially lower healthcare costs, but they are not exactly the same as the original biologic medicine."},"example_sentences":[{"sentence":"The introduction of **biosimilars** has the potential to reduce healthcare costs.","translation":"バイオシミラーの導入は、医療費を削減する可能性を秘めている。","type":"noun","meaning_category":"バイオシミラー"},{"sentence":"The **biosimilar** drug was approved after rigorous testing.","translation":"そのバイオシミラー医薬品は、厳格な試験の後に承認された。","type":"adjective","meaning_category":"バイオシミラーの"},{"sentence":"Doctors carefully evaluate **biosimilars** before prescribing them to patients.","translation":"医師は、バイオシミラーを患者に処方する前に慎重に評価する。","type":"noun","meaning_category":"バイオシミラー"},{"sentence":"The company is investing heavily in **biosimilar** research and development.","translation":"その会社はバイオシミラーの研究開発に多額の投資を行っている。","type":"adjective","meaning_category":"バイオシミラーの"}]}