{"word":"unwagered","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"賭けられていない、賭けの対象となっていない","english_definition":"Not wagered; not subject to a bet or gamble.","examples":[{"sentence":"The money remained unwagered in his account.","translation":"そのお金は彼の口座の中で賭けられることなく残っていた。"},{"sentence":"The outcome was unwagered, as no one had placed a bet on it.","translation":"誰もそれに賭けていなかったので、結果は賭けの対象となっていなかった。"}],"collocations":["unwagered amount","unwagered funds","unwagered balance"],"synonyms":["unbet","unrisked","unspent"],"antonyms":["wagered","bet","risked"]}],"etymology":{"value":"'Un-' (not) + 'wagered' (past participle of 'wager', meaning to bet).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈweɪdʒərd/","syllables":"un-wa-gerd"},"inflection":{"notes":"Adjective; does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Unwagered' is typically used in contexts related to gambling, finance, or risk assessment, indicating that a particular amount or asset has not been subjected to a bet or speculative investment. It often implies a state of being untouched or uncommitted to a potential loss or gain.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unwagered player sat at the table.","correct":"✓ The player sat at the table, having unwagered funds.","note":"'Unwagered' describes the state of the funds or assets, not the person. A player can *have* unwagered funds."}],"priority":"★☆☆"},"related_words":{"derivatives":["wager (verb, noun)","wagering (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'unwagered' is a specialized term primarily used in contexts related to gambling and finance. It describes something that has not been bet or risked. Due to its limited use, it is not commonly encountered in everyday language and is more likely to appear in technical or industry-specific materials."},"example_sentences":[{"sentence":"The casino held a large sum of unwagered money at the end of the night.","translation":"カジノは夜の終わりに、多額の賭けられていないお金を保有していた。","type":"adjective","meaning_category":"賭けられていない"},{"sentence":"The unwagered portion of the investment portfolio was kept in a low-risk account.","translation":"投資ポートフォリオの賭けられていない部分は、低リスク口座に保管されていた。","type":"adjective","meaning_category":"賭けの対象となっていない"}]}