{"word":"pryers","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(plural of pryer) a person who pries; someone who is nosy or unduly curious about the affairs of others.","english_definition":"plural form of 'pryer': a person who inquires too closely into a person's private affairs.","examples":[{"sentence":"The neighbors were a bunch of pryers, always watching what we were doing.","translation":"近所の人たちは詮索好きで、いつも私たちの行動を監視していた。"},{"sentence":"She didn't like pryers asking about her personal life.","translation":"彼女は自分の私生活について詮索する人が嫌いだった。"}],"collocations":["a bunch of pryers","nosy pryers","busybody pryers"],"synonyms":["busybody","snoop","meddler","nosy parker","curious person"],"antonyms":["reticent person","private person","discreet person"]}],"etymology":{"value":"Derived from the verb 'pry,' meaning to inquire impertinently or unnecessarily into something. The suffix '-er' is added to form a noun denoting a person who performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpraɪərz/","syllables":"pry-ers"},"inflection":{"noun_plural":"pryers"},"usage_notes":{"explanation":"'Pryers' is the plural form of 'pryer,' which refers to people who are excessively curious about the private matters of others. It carries a negative connotation, implying that such curiosity is unwelcome and intrusive. The term is often used to describe individuals who snoop, eavesdrop, or ask overly personal questions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pryers was always asking questions.","correct":"✓ The pryers were always asking questions.","note":"'Pryers' is a plural noun, so it requires a plural verb ('were')."},{"incorrect":"✗ He is a pryers.","correct":"✓ He is a pryer. / ✓ They are pryers.","note":"When referring to one person, use the singular form 'pryer.' When referring to multiple people, use the plural form 'pryers'."}],"priority":"★★☆"},"related_words":{"derivatives":["pry (verb): to inquire too closely into a person's private affairs.","prying (adjective): excessively interested in someone's private affairs."],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pryers' is a relatively uncommon word used to describe people who are excessively curious and intrusive into the private lives of others. It is the plural form of 'pryer,' which is derived from the verb 'pry.' The word carries a negative connotation, suggesting that the individuals' curiosity is unwelcome and inappropriate. Understanding the meaning requires a good vocabulary and an awareness of social boundaries.","priority":"★★☆"},"example_sentences":[{"sentence":"The neighborhood busybodies were known as the biggest pryers in town.","translation":"その近所の詮索好きたちは、町で一番の詮索好きとして知られていた。","type":"noun","meaning_category":"nosy people"},{"sentence":"She hated having pryers around, always asking personal questions.","translation":"彼女はいつも個人的な質問をしてくる詮索好きな人が周りにいるのが嫌だった。","type":"noun","meaning_category":"intrusive individuals"},{"sentence":"The tabloids are full of pryers trying to dig up dirt on celebrities.","translation":"タブロイド紙は、有名人のスキャンダルを暴こうとする詮索好きな人たちでいっぱいだ。","type":"noun","meaning_category":"snoops"}]}