{"word":"vagotonic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"迷走神経緊張症の、迷走神経優位の","english_definition":"Relating to or characterized by increased activity of the vagus nerve.","examples":[{"sentence":"The patient exhibited vagotonic symptoms such as bradycardia and hypotension.","translation":"その患者は徐脈や低血圧などの迷走神経緊張症の症状を示した。"},{"sentence":"Vagotonic individuals may be more prone to vasovagal syncope.","translation":"迷走神経優位の人は、血管迷走神経性失神を起こしやすいかもしれない。"}],"collocations":["vagotonic state","vagotonic symptoms","vagotonic response"],"synonyms":["parasympathomimetic","cholinergic"],"antonyms":["sympathomimetic","adrenergic"]}],"etymology":{"value":"Derived from 'vagus' (referring to the vagus nerve) and 'tonic' (relating to tone or tension).","priority":"★★★"},"pronunciation":{"ipa":"/ˌveɪɡəˈtɒnɪk/","syllables":"va-go-ton-ic"},"inflection":{"notes":"Adjective; comparative and superlative forms are generally formed using 'more' and 'most' (e.g., more vagotonic, most vagotonic)."},"usage_notes":{"explanation":"'Vagotonic' describes a physiological state where the vagus nerve, a major component of the parasympathetic nervous system, has increased activity. This can result in various effects, such as a lowered heart rate, decreased blood pressure, and increased digestive activity. It is often used in medical contexts to describe conditions or individuals exhibiting these characteristics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The athlete was vagotonic after running the marathon.","correct":"✓ The athlete's sympathetic nervous system was dominant after running the marathon.","note":"After intense exercise, the sympathetic nervous system is typically dominant, not the parasympathetic (vagotonic) system."},{"incorrect":"✗ Vagotonic is a disease.","correct":"✓ Vagotonia is a condition or state, not a disease.","note":"'Vagotonia' refers to a state of increased vagal tone, not a specific disease."}],"priority":"★★☆"},"related_words":{"derivatives":["vagus nerve","vagal tone","vagal stimulation","vagal response","vagal maneuver","vagatonia (noun: 迷走神経緊張症)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in medical and scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Vagotonic' is a specialized term primarily used in medical and physiological contexts. It describes a state characterized by increased activity of the vagus nerve, leading to specific physiological effects such as decreased heart rate and blood pressure. Understanding this term requires knowledge of the autonomic nervous system and its components. It is not commonly used outside of scientific or medical discussions."},"example_sentences":[{"sentence":"Regular meditation can promote a more **vagotonic** state.","translation":"定期的な瞑想は、より迷走神経優位な状態を促進することができる。","type":"adjective","meaning_category":"迷走神経緊張症の"},{"sentence":"The medication aims to reduce the **vagotonic** effects on the heart.","translation":"その薬は、心臓に対する迷走神経緊張症の影響を軽減することを目的としている。","type":"adjective","meaning_category":"迷走神経優位の"}]}