{"word":"Semite","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"セム語族の人、セム族の人","english_definition":"a member of any of the peoples who speak or spoke a Semitic language, including in particular the Jews and Arabs.","examples":[{"sentence":"Arabs and Jews are both Semites.","translation":"アラブ人とユダヤ人はどちらもセム族です。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"セム語派の言語","english_definition":"a language of the Semitic family.","examples":[],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"1850, from French Sémite, from Late Latin Semita \"descendant of Shem,\" from Greek Sēm, from Hebrew Shem, name of one of the three sons of Noah (Genesis x, 21ff), from whom the Semitic peoples were traditionally said to be descended. The term was introduced to general use by German historian August Ludwig von Schlözer (1781).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsiːmaɪt/","syllables":"Se-mite"},"inflection":{"noun_plural":"Semites"},"usage_notes":{"explanation":"The term \"Semite\" refers to people who speak or spoke Semitic languages. However, it is often mistakenly used as a synonym for \"Jew,\" which is incorrect. While Jews are Semites, not all Semites are Jews. Arabs, for example, are also Semites.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ All Semites are Jews.","correct":"✓ Some Semites are Jews.","note":"Not all Semites are Jews. Arabs are also Semites."},{"incorrect":"✗ Semite is a race.","correct":"✓ Semite refers to people who speak Semitic languages.","note":"Semite refers to a linguistic group, not a race."}],"priority":"★★☆"},"related_words":{"derivatives":["Semitic (adjective, noun)","Anti-Semite (noun)","Anti-Semitism (noun)"],"priority":"★★☆"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The word \"Semite\" refers to people who speak Semitic languages, such as Hebrew and Arabic. It's important to remember that this term is about language, not race or religion. The term is often misused, especially in the context of \"Anti-Semitism,\" which is prejudice against Jewish people. Understanding the correct meaning of \"Semite\" is crucial for clear communication and avoiding harmful stereotypes."},"example_sentences":[{"sentence":"Hebrew and Arabic are Semitic languages spoken by Semites.","translation":"ヘブライ語とアラビア語は、セム族の人々が話すセム語派の言語です。","type":"general","meaning_category":"セム語族"},{"sentence":"The study of Semitic languages is a fascinating field.","translation":"セム語派の言語の研究は魅力的な分野です。","type":"linguistics","meaning_category":"セム語派"}]}