{"word":"cosponsorships","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(法案などの)共同提案、共同後援","english_definition":"The act of cosponsoring a bill or resolution; the state of being cosponsored.","examples":[{"sentence":"The bill has gained numerous cosponsorships from both parties.","translation":"その法案は両党から多数の共同提案を得ている。"},{"sentence":"We are seeking cosponsorships for this important legislation.","translation":"この重要な法案に対する共同提案を求めています。"}],"collocations":["seek cosponsorships (共同提案を求める)","gain cosponsorships (共同提案を得る)","bipartisan cosponsorships (超党派の共同提案)"],"synonyms":["joint sponsorship","co-signature","endorsement"],"antonyms":["sole sponsorship"]},{"part_of_speech":"noun","definition":"(集合的に)共同提案者、共同後援者","english_definition":"The group of people who cosponsor a bill or resolution.","examples":[{"sentence":"The cosponsorships represent a broad range of interests.","translation":"共同提案者たちは幅広い関心を代表している。"},{"sentence":"The number of cosponsorships indicates the bill's popularity.","translation":"共同提案者の数は、法案の人気を示している。"}],"collocations":["a list of cosponsorships (共同提案者リスト)","the cosponsorships of the bill (法案の共同提案者たち)"],"synonyms":["cosponsors","supporters","backers"],"antonyms":["opponents"]}],"etymology":{"value":"The word is formed by adding the prefix 'co-' (meaning 'together' or 'jointly') to 'sponsorships', which is the plural form of 'sponsorship' (the act of supporting or promoting something).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌkoʊˈspɒnsərʃɪps/","syllables":"co-spon-sor-ships"},"inflection":{"noun_plural":"cosponsorships"},"usage_notes":{"explanation":"The term 'cosponsorships' is primarily used in a political or legislative context, referring to the act of multiple individuals (usually legislators) jointly supporting and promoting a particular bill or resolution. It can also refer to the individuals themselves who are cosponsoring the legislation. The number of cosponsorships a bill receives is often seen as an indicator of its likelihood of success.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bill had many cosponsorship.","correct":"✓ The bill had many cosponsorships.","note":"Since it refers to multiple instances of cosponsorship or a group of cosponsors, it's usually used in the plural form."}],"priority":"★☆☆"},"related_words":{"derivatives":["cosponsor (noun/verb)","sponsorship (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cosponsorships' is a term mainly used in political contexts. It refers to the act of multiple people jointly supporting a bill or resolution, or to the group of people who are doing the cosponsoring. It is not a common word in everyday conversation. Understanding its meaning is helpful for following political news and discussions.","priority":"★☆☆"},"example_sentences":[{"sentence":"The senator announced the cosponsorships for her new healthcare bill.","translation":"上院議員は、彼女の新しい医療法案に対する共同提案を発表した。","type":"noun","meaning_category":"共同提案"},{"sentence":"The number of cosponsorships is a good indicator of the bill's chances of passing.","translation":"共同提案者の数は、法案が可決される可能性を示す良い指標となる。","type":"noun","meaning_category":"共同提案"},{"sentence":"The bill is gaining momentum as more representatives add their cosponsorships.","translation":"より多くの議員が共同提案者として加わるにつれて、法案は勢いを増している。","type":"noun","meaning_category":"共同提案"}]}