{"word":"subterminal","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"終端に近い、終端直前の","english_definition":"Situated near the end or extremity of something, but not at the very end.","examples":[{"sentence":"The lesion was located in the subterminal ileum.","translation":"その病変は回腸の終端近くに位置していた。"},{"sentence":"The subterminal bud will develop into a new branch.","translation":"終端直前の芽は新しい枝に発達するだろう。"}],"collocations":["subterminal bud","subterminal lesion","subterminal position"],"synonyms":["near-terminal","preterminal"],"antonyms":["terminal"]},{"part_of_speech":"noun","definition":"（昆虫学）亜端毛","english_definition":"(Entomology) A bristle or hair situated near the tip of an insect appendage.","examples":[{"sentence":"The subterminal bristles are important for species identification.","translation":"亜端毛は種の識別に重要である。"}],"collocations":["subterminal bristle","subterminal hair"],"synonyms":[]}],"etymology":{"value":"From sub- (near) + terminal (end).","priority":"★★★"},"pronunciation":{"ipa":"/sʌbˈtɜːrmɪnəl/","syllables":"sub-ter-mi-nal"},"inflection":{"notes":"Adjective: Comparative - more subterminal, Superlative - most subterminal. Noun: Plural - subterminals"},"usage_notes":{"explanation":"'Subterminal' indicates a position or characteristic that is close to the end but not exactly at the end. It's often used in technical or scientific contexts, such as biology, anatomy, and botany.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The terminal was subterminal to the main station.","correct":"The station was subterminal to the main terminal.","note":"Ensure the object being described is actually near the end. A terminal cannot be subterminal to a station, but a station can be subterminal to a terminal."}],"priority":"★★☆"},"related_words":{"derivatives":["subterminally (adverb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'subterminal' is a technical term used to describe something located near the end, but not at the very end. It is commonly used in scientific and medical contexts. Understanding the prefixes 'sub-' (meaning near or below) and 'terminal' (meaning end) can help in deciphering the word's meaning. This word is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The tumor was located in the subterminal portion of the colon.","translation":"腫瘍は結腸の終端近くの部分に位置していた。","type":"adjective","meaning_category":"終端に近い"},{"sentence":"The insect's subterminal hairs were used to identify the species.","translation":"その昆虫の亜端毛は種の識別に用いられた。","type":"noun","meaning_category":"亜端毛"}]}