{"word":"Clabularia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A genus of soft corals in the family Clavulariidae.","english_definition":"A genus of soft corals in the family Clavulariidae, characterized by encrusting colonies and individual polyps arising from a mat-like base.","examples":[{"sentence":"We observed several colonies of Clabularia during our dive.","translation":"ダイビング中にいくつかのクラブラリアの群体を観察しました。"},{"sentence":"Clabularia species are often found in shallow, tropical waters.","translation":"クラブラリア種は浅い熱帯の海域でよく見られます。"}],"collocations":["Clabularia viridis","Clabularia colonies","Clabularia morphology"],"synonyms":["soft coral","gorgonian","sea pen"],"antonyms":[]}],"etymology":{"value":"Derived from Latin 'clabula' (small club) + '-aria' (suffix denoting association or resemblance), referring to the club-shaped polyps.","priority":"★★☆"},"pronunciation":{"ipa":"/klæbjʊˈlɛəriə/","syllables":"Cla-bu-la-ri-a"},"inflection":{"noun_plural":"Clabularia (usually treated as a mass noun)"},"usage_notes":{"explanation":"'Clabularia' refers to a specific genus of soft corals. It's a scientific term used in marine biology and related fields. When discussing multiple colonies or species, the term remains 'Clabularia' as it is often treated as a mass noun.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a clabularia at the aquarium.","correct":"✓ I saw some Clabularia at the aquarium.","note":"'Clabularia' is a genus name, so it's more accurate to say 'some Clabularia' or 'a Clabularia colony' rather than 'a clabularia'."}],"priority":"★☆☆"},"related_words":{"derivatives":["Clavulariidae (family)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (scientific term)","frequency_google_ngram":"Very low frequency (scientific context)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Clabularia' is a scientific term referring to a specific genus of soft corals. It is primarily used in marine biology, oceanography, and related academic or research contexts. Understanding this term requires familiarity with biological classification and marine ecosystems."},"example_sentences":[{"sentence":"The researchers studied the growth patterns of Clabularia in controlled environments.","translation":"研究者たちは、制御された環境下でのクラブラリアの成長パターンを研究しました。","type":"noun","meaning_category":"soft coral genus"},{"sentence":"Different species of Clabularia exhibit varying colors and polyp sizes.","translation":"クラブラリアの異なる種は、さまざまな色とポリプのサイズを示します。","type":"noun","meaning_category":"soft coral genus"}]}