{"word":"crystallochemical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"結晶化学的な","english_definition":"Relating to crystallochemistry, the study of the chemical composition and structure of crystalline materials.","examples":[{"sentence":"The crystallochemical properties of the mineral were analyzed using X-ray diffraction.","translation":"その鉱物の結晶化学的特性は、X線回折を用いて分析された。"},{"sentence":"Crystallochemical considerations are important in understanding the behavior of solid-state materials.","translation":"結晶化学的考察は、固体材料の挙動を理解する上で重要である。"}],"collocations":["crystallochemical analysis","crystallochemical properties","crystallochemical structure","crystallochemical behavior"],"synonyms":["chemical","structural","compositional"],"antonyms":[]}],"etymology":{"value":"Derived from \"crystallochemistry,\" which combines \"crystal\" (from Greek \"krystallos,\" meaning clear ice or rock crystal) and \"chemistry\" (the study of substances and their properties).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkrɪstəloʊˈkɛmɪkəl/","syllables":"crys-tal-lo-chem-i-cal"},"inflection":{"notes":"Adjective, no inflection."},"usage_notes":{"explanation":"'Crystallochemical' is a specialized term used in the fields of chemistry, mineralogy, and materials science. It describes the chemical aspects of crystalline structures, including composition, bonding, and arrangement of atoms. It's often used when discussing the relationship between a crystal's chemical makeup and its physical properties.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The crystallochemical is important for the material.","correct":"✓ The crystallochemical property is important for the material.","note":"'Crystallochemical' is an adjective, so it needs to modify a noun. Using it as a noun is incorrect."}],"priority":"★☆☆"},"related_words":{"derivatives":["crystallochemistry (noun): The study of the chemical composition and structure of crystalline materials.","crystal (noun): A solid substance with a regular, repeating arrangement of atoms or molecules."],"priority":"★★☆"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency - Specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Crystallochemical' is a technical term used in scientific contexts, specifically in fields like chemistry, mineralogy, and materials science. Understanding this term requires familiarity with basic chemistry concepts and the structure of crystals. It is not commonly used in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The crystallochemical formula of the compound was determined using spectroscopic methods.","translation":"その化合物の結晶化学式は、分光法を用いて決定された。","type":"example","meaning_category":"chemical composition"},{"sentence":"Understanding the crystallochemical environment of the active site is crucial for catalyst design.","translation":"活性部位の結晶化学的環境を理解することは、触媒設計にとって重要である。","type":"example","meaning_category":"structural properties"}]}