{"word":"Farmwife","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"農家の妻、農婦","english_definition":"A woman who lives and works on a farm, especially the wife of a farmer.","examples":[{"sentence":"The farmwife tended to the chickens and gathered eggs each morning.","translation":"農家の妻は毎朝ニワトリの世話をし、卵を集めた。"},{"sentence":"The life of a farmwife is filled with hard work and dedication.","translation":"農家の妻の生活は、大変な仕事と献身に満ちている。"}],"collocations":["hardworking farmwife","traditional farmwife","modern farmwife","farmwife duties","farmwife skills"],"synonyms":["farmer's wife","agricultural worker (female)","rural woman"],"antonyms":["city dweller","urbanite"]}],"etymology":{"value":"Compound of 'farm' and 'wife'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfɑːrmwaɪf/","syllables":"farm-wife"},"inflection":{"noun_plural":"farmwives"},"usage_notes":{"explanation":"The term 'farmwife' traditionally refers to a woman who is married to a farmer and actively participates in the work and management of the farm. The role of a farmwife can vary greatly depending on the size and type of farm, as well as cultural and historical contexts. In modern usage, the term may also refer to any woman who lives and works on a farm, regardless of marital status.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a farm wife.","correct":"✓ She is a farmwife.","note":"'Farmwife' is typically written as one word."}],"priority":"★★☆"},"related_words":{"derivatives":["farm","wife","farmer"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'farmwife' is a compound noun that refers to a woman who lives and works on a farm, typically as the wife of a farmer. It suggests a traditional role involving both domestic duties and agricultural labor. While the term is still used, it may be considered somewhat old-fashioned or gendered in contemporary contexts, where more inclusive terms like 'farmer' or 'agricultural worker' might be preferred to describe a woman working in agriculture. The meaning is generally straightforward, but understanding the historical and cultural implications of the term can provide a deeper appreciation of its significance."},"example_sentences":[{"sentence":"The **farmwife** skillfully managed both the household and the farm's finances.","translation":"その農家の妻は、家計と農場の財政の両方を巧みに管理した。","type":"noun","meaning_category":"農家の妻"},{"sentence":"Many **farmwives** contribute significantly to the success of their family farms.","translation":"多くの農家の妻が、家族経営の農場の成功に大きく貢献している。","type":"noun","meaning_category":"農家の妻"},{"sentence":"The **farmwife** woke before dawn to begin her daily chores.","translation":"その農家の妻は、毎日の雑用を始めるために夜明け前に起きた。","type":"noun","meaning_category":"農家の妻"}]}