{"word":"nondoing","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"無為、作為のなさ、何もしないこと","english_definition":"The state of inaction or non-intervention; absence of doing.","examples":[{"sentence":"The success of the project depended on skillful nondoing at critical moments.","translation":"プロジェクトの成功は、重要な瞬間の巧みな無為にかかっていた。"},{"sentence":"Taoist philosophy emphasizes the importance of nondoing to achieve harmony with nature.","translation":"道教哲学は、自然との調和を達成するために無為の重要性を強調している。"}],"collocations":["skillful nondoing (巧みな無為)","strategic nondoing (戦略的な無為)","conscious nondoing (意識的な無為)"],"synonyms":["inaction","nonaction","passivity","nonintervention","abstention"],"antonyms":["action","doing","intervention","activity"]},{"part_of_speech":"noun","definition":"(仏教)無為、作為を離れた境地","english_definition":"(Buddhism) A state of non-striving or non-attachment; acting without attachment to results.","examples":[{"sentence":"Through meditation, one can achieve a state of nondoing and inner peace.","translation":"瞑想を通して、人は無為の境地と心の平安を達成することができる。"},{"sentence":"The master taught that true wisdom comes from nondoing, not from forced effort.","translation":"師は、真の知恵は強制的な努力からではなく、無為から生まれると教えた。"}],"collocations":["state of nondoing (無為の境地)","path of nondoing (無為の道)","practice of nondoing (無為の実践)"],"synonyms":["wu wei (Chinese)","non-striving","non-attachment","effortless action"],"antonyms":["striving","attachment","effortful action"]}],"etymology":{"value":"Formed by adding the prefix 'non-' to the word 'doing'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈduːɪŋ/","syllables":"non-do-ing"},"inflection":{"noun_plural":"nondoings (rarely used)"},"usage_notes":{"explanation":"'Nondoing' is a relatively uncommon word that refers to the state of not doing something, often with a connotation of strategic inaction or non-interference. In a philosophical or spiritual context, particularly in Taoism and Buddhism, it refers to a state of acting without attachment to results or striving, often translated from the Chinese term 'wu wei'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practices nondoing by lazy.","correct":"✓ He practices nondoing by being mindful and non-interfering.","note":"'Nondoing' is not simply laziness; it implies a conscious choice of inaction. The correction clarifies this distinction."},{"incorrect":"✗ Nondoing is when you don't do anything ever.","correct":"✓ Nondoing is a state of strategic inaction, not perpetual inactivity.","note":"'Nondoing' is not about never doing anything, but about choosing when *not* to act. The correction emphasizes the strategic aspect."}],"priority":"★★☆"},"related_words":{"derivatives":["non-doer"],"phrases":["wu wei (道教の概念)"],"related_concepts":["Taoism","Buddhism","minimalism","strategic inaction"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nondoing' is a rare and abstract term, primarily used in philosophical or spiritual contexts, particularly when discussing Taoism or Buddhism. It refers to a state of inaction or non-intervention that is often strategic or deliberate, rather than simply being lazy or passive. Understanding this term requires familiarity with these philosophical concepts. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The manager's nondoing allowed the team to find their own solutions.","translation":"マネージャーの無為は、チームが自分たちで解決策を見つけることを可能にした。","type":"noun","meaning_category":"無為"},{"sentence":"In Zen Buddhism, nondoing is considered a path to enlightenment.","translation":"禅仏教では、無為は悟りへの道とされている。","type":"noun","meaning_category":"無為 (仏教)"},{"sentence":"Sometimes, the best approach is nondoing, allowing events to unfold naturally.","translation":"時には、最良のアプローチは無為であり、出来事が自然に展開するのを許すことである。","type":"noun","meaning_category":"無為"},{"sentence":"The art of nondoing requires careful observation and understanding of the situation.","translation":"無為の技術は、状況の注意深い観察と理解を必要とする。","type":"noun","meaning_category":"無為"}]}