{"word":"communicably","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"伝達可能に、伝染可能に、意思疎通できるように","english_definition":"In a way that can be communicated or transmitted; in a way that allows for effective communication.","examples":[{"sentence":"The disease is communicably transmitted through airborne droplets.","translation":"その病気は、空気中の飛沫を介して伝染可能に伝播する。"},{"sentence":"The information should be presented communicably to ensure everyone understands it.","translation":"情報を誰もが理解できるように、意思疎通しやすい形で提示する必要がある。"}],"collocations":["communicably transmitted","communicably presented","communicably expressed"],"synonyms":["understandably","clearly","accessibly","transmitably","contagiously"],"antonyms":["incommunicably","unintelligibly","obscurely"]}],"etymology":{"value":"Formed from 'communicable' (capable of being communicated) + '-ly' (adverbial suffix). 'Communicable' comes from Latin 'communicare' (to share, impart, make common).","priority":"★★☆"},"pronunciation":{"ipa":"/kəˈmjuːnɪkəbli/","syllables":"com-mu-ni-ca-bly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Communicably' describes the manner in which something is communicated or transmitted. It emphasizes the ease or possibility of communication or transmission. It is often used in medical contexts to describe how a disease spreads, or in educational or professional contexts to describe how information is conveyed.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ideas were communicably, but not clearly.","correct":"✓ The ideas were communicable, but not clearly.","note":"'Communicably' is an adverb, modifying a verb or adjective. 'Communicable' is an adjective, describing a noun. The sentence requires an adjective to describe the ideas."},{"incorrect":"✗ He spoke communicably.","correct":"✓ He spoke communicatively.","note":"'Communicably' refers to the ability to be transmitted. 'Communicatively' refers to the manner of speaking, emphasizing effective communication."}],"priority":"★★☆"},"related_words":{"derivatives":["communicable (adjective)","communicate (verb)","communication (noun)","communicative (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Communicably' means in a way that something can be easily shared or understood. It's used when talking about how ideas or diseases spread. For example, a disease that is 'communicably transmitted' spreads easily from person to person. It's a formal word, not used very often in everyday conversation."},"example_sentences":[{"sentence":"The findings were presented communicably, ensuring that even non-experts could grasp the key concepts.","translation":"調査結果は伝達可能に提示され、専門家でなくても主要な概念を把握できるようにした。","type":"adverb","meaning_category":"easily understood"},{"sentence":"The virus is highly communicably, making it difficult to contain its spread.","translation":"そのウイルスは非常に伝染性が高く、蔓延を抑えるのが難しい。","type":"adverb","meaning_category":"easily transmitted"}]}