{"word":"overbanded","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Having too many bands or stripes.","english_definition":"Excessively marked with bands or stripes.","examples":[{"sentence":"The overbanded agate was not as valuable as the one with fewer bands.","translation":"縞模様が多すぎるめのうは、縞模様が少ないものほど価値がなかった。"},{"sentence":"The textile was considered flawed due to its overbanded pattern.","translation":"その織物は、縞模様が多すぎるため欠陥があると見なされた。"}],"collocations":["overbanded agate","overbanded textile","overbanded pattern"],"synonyms":["overstriped","excessively banded"],"antonyms":["underbanded","plain"]},{"part_of_speech":"adjective","definition":"(Of birds) Having too many bands placed on their legs for identification.","english_definition":"(Specifically of birds) Having an excessive number of identification bands on their legs.","examples":[{"sentence":"The ornithologist realized the bird was overbanded, potentially hindering its movement.","translation":"鳥類学者は、その鳥の足にバンドが多すぎることに気づき、それが動きを妨げる可能性があると考えた。"},{"sentence":"Overbanded birds are more likely to suffer injuries.","translation":"バンドが多すぎる鳥は、怪我をする可能性が高くなる。"}],"collocations":["overbanded bird","overbanded pigeon","overbanded leg"],"synonyms":["excessively banded (bird)"],"antonyms":["underbanded (bird)"]}],"etymology":{"value":"Formed from the prefix 'over-' (excessively) and the past participle of 'band' (to mark with a band).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌoʊvərˈbændɪd/","syllables":"o-ver-ban-ded"},"inflection":{"notes":"Adjective; does not inflect for number or gender."},"usage_notes":{"explanation":"'Overbanded' is a descriptive term indicating an excess of bands or stripes. It's most commonly used in two contexts: describing geological specimens (like agate) or textiles with too many bands, and describing birds that have been fitted with too many identification bands on their legs. In the latter case, it often implies a negative impact on the bird's well-being.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bird was overbanded with joy.","correct":"✓ The bird was banded and released with joy.","note":"'Overbanded' refers to a physical characteristic, not an emotional state. Using it to describe feelings is incorrect."}],"priority":"★☆☆"},"related_words":{"derivatives":["band","banding","underbanded"],"related_terms":["ringed (bird)","striped"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Overbanded' is a relatively uncommon word used to describe something that has too many bands or stripes. It's often used in scientific or technical contexts, such as describing geological samples or birds that have been tagged for research. The word is formed by adding the prefix 'over-' to the word 'banded', indicating an excess. Because it's a specialized term, it's not typically encountered in everyday conversation."},"example_sentences":[{"sentence":"The geologist noted the overbanded nature of the rock sample.","translation":"地質学者は、岩石サンプルの縞模様が多すぎる性質に注目した。","type":"general","meaning_category":"general"},{"sentence":"The conservationist worried that the overbanded eagle would have difficulty flying.","translation":"自然保護活動家は、バンドが多すぎるワシが飛行困難になることを心配した。","type":"ornithology","meaning_category":"ornithology"}]}