{"word":"radiotropism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"放射線屈性：生物（特に植物）が放射線源に向かって、または放射線源から離れて成長する性質。","english_definition":"The growth or movement of an organism, especially a plant, in response to radiation.","examples":[{"sentence":"The radiotropism of certain fungi allows them to thrive near radioactive materials.","translation":"特定の菌類の放射線屈性により、それらは放射性物質の近くで繁殖することができます。"},{"sentence":"Studies have shown that radiotropism can be both positive and negative, depending on the type and intensity of radiation.","translation":"研究によると、放射線屈性は、放射線の種類と強度に応じて、正と負の両方になる可能性があります。"}],"collocations":["positive radiotropism (正の放射線屈性)","negative radiotropism (負の放射線屈性)"],"synonyms":["radiation tropism"],"antonyms":[]}],"etymology":{"value":"\"radio-\"（放射線）+ \"tropism\"（屈性、成長または運動の方向性）から構成される。","priority":"★★☆"},"pronunciation":{"ipa":"ˌreɪdi.oʊˈtroʊpɪzəm","syllables":"ra-di-o-tro-pi-sm"},"inflection":{"noun_plural":"radiotropisms"},"usage_notes":{"explanation":"Radiotropism is a relatively rare phenomenon, primarily observed in plants and fungi. It is a type of tropism, which is a biological phenomenon indicating growth or turning movement of a biological organism, usually a plant, in response to an environmental stimulus. In the case of radiotropism, the stimulus is radiation. Positive radiotropism refers to growth towards the radiation source, while negative radiotropism refers to growth away from the radiation source.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant showed radiotropism to the sun.","correct":"✓ The plant showed phototropism to the sun.","note":"Radiotropism is a response to radiation, not sunlight. The response to sunlight is called phototropism."}],"priority":"★☆☆"},"related_words":{"derivatives":["radiotropic (形容詞：放射線屈性の)","tropism (名詞：屈性)","phototropism (名詞：光屈性)","geotropism (名詞：重力屈性)","hydrotropism (名詞：水屈性)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Radiotropism is a scientific term used in biology to describe how organisms, especially plants and fungi, respond to radiation. It's not a common word, but it's important in understanding how certain organisms can adapt to environments with high levels of radiation. If an organism grows towards the radiation source, it's called positive radiotropism, and if it grows away, it's negative radiotropism."},"example_sentences":[{"sentence":"Following the nuclear accident, scientists studied the radiotropism of local plant life.","translation":"原子力事故後、科学者たちは地元の植物の放射線屈性を研究しました。","type":"noun","meaning_category":"放射線屈性"},{"sentence":"The experiment aimed to determine whether the fungus exhibited positive or negative radiotropism.","translation":"その実験は、菌類が正の放射線屈性を示すか負の放射線屈性を示すかを判断することを目的としていました。","type":"noun","meaning_category":"放射線屈性"}]}