{"word":"polemicism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"論争主義、論争好き、論争的な性質","english_definition":"The practice of engaging in or inclination towards controversy, argument, or disputation; a tendency to argue aggressively or controversially.","examples":[{"sentence":"His writing is often criticized for its polemicism, as he frequently attacks opposing viewpoints.","translation":"彼の文章は、反対意見を頻繁に攻撃するため、その論争主義がしばしば批判される。"},{"sentence":"The debate was marked by intense polemicism, with each side unwilling to compromise.","translation":"その討論は激しい論争主義によって特徴づけられ、どちらの側も妥協を拒んだ。"},{"sentence":"She avoided polemicism in her speech, focusing instead on finding common ground.","translation":"彼女は演説で論争主義を避け、代わりに共通点を見つけることに焦点を当てた。"}],"collocations":["intense polemicism","avoid polemicism","political polemicism","religious polemicism","intellectual polemicism"],"synonyms":["argumentativeness","controversiality","disputatiousness","belligerence","aggressiveness","contentiousness"],"antonyms":["agreement","harmony","concord","compromise","conciliation"]}],"etymology":{"value":"Derived from 'polemic', which comes from the Greek 'polemikos' meaning 'warlike, hostile', from 'polemos' meaning 'war'. The suffix '-ism' denotes a practice, system, or ideology. Thus, 'polemicism' signifies the practice or tendency of engaging in warlike or hostile debate.","priority":"★★☆"},"pronunciation":{"ipa":"/pəˈlɛmɪsɪzəm/","syllables":"po-lem-i-ci-sm"},"inflection":{"noun_plural":"polemicisms (rarely used)"},"usage_notes":{"explanation":"'Polemicism' describes a tendency or practice, often viewed negatively, of engaging in heated or aggressive debate. It implies a focus on attacking opposing views rather than seeking common ground or understanding. While 'polemic' can refer to a specific piece of writing or speech, 'polemicism' refers to the general inclination or practice.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The polemicism of the peace treaty surprised everyone.","correct":"✓ The polemical nature of the peace treaty surprised everyone.","note":"'Polemicism' refers to the tendency to engage in controversy, not a quality of an object. 'Polemical' would be more appropriate to describe the treaty itself."},{"incorrect":"✗ He showed great polemicism in resolving the dispute.","correct":"✓ He showed great skill in resolving the dispute.","note":"'Polemicism' implies argumentativeness, not skill in resolving disputes. A different word like 'diplomacy' or 'skill' would be more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["polemic (noun, adjective)","polemical (adjective)","polemicist (noun)"],"phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Polemicism' is a relatively uncommon term that refers to the practice of engaging in aggressive or controversial debate. It often implies a focus on attacking opposing viewpoints rather than seeking common ground. Understanding this word requires a grasp of more advanced vocabulary and abstract concepts related to argumentation and rhetoric. It is typically encountered in academic or intellectual contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The article was criticized for its excessive polemicism and lack of balanced analysis.","translation":"その記事は、過度の論争主義とバランスの取れた分析の欠如で批判された。","type":"general","meaning_category":"論争主義"},{"sentence":"His polemicism alienated many potential allies.","translation":"彼の論争主義は多くの潜在的な同盟者を遠ざけた。","type":"general","meaning_category":"論争主義"},{"sentence":"The conference aimed to move beyond polemicism and foster genuine dialogue.","translation":"その会議は、論争主義を超えて、真の対話を育むことを目指した。","type":"general","meaning_category":"論争主義"}]}