{"word":"ticket-selling","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"チケット販売","english_definition":"The act or business of selling tickets, especially for events or transportation.","examples":[{"sentence":"The ticket-selling for the concert starts next week.","translation":"そのコンサートのチケット販売は来週から始まります。"},{"sentence":"Online ticket-selling has become increasingly popular.","translation":"オンラインでのチケット販売はますます人気が高まっています。"},{"sentence":"They made a lot of money from ticket-selling.","translation":"彼らはチケット販売で多くのお金を稼ぎました。"}],"collocations":["online ticket-selling","advance ticket-selling","ticket-selling agency","ticket-selling website"],"synonyms":["ticketing","ticket sales"],"antonyms":[]}],"etymology":{"value":"Compound word formed by combining \"ticket\" and \"selling\".","priority":"★★★"},"pronunciation":{"ipa":"/ˈtɪkɪtˌsɛlɪŋ/","syllables":"tick-et-sell-ing"},"inflection":{"noun_plural":"ticket-sellings (rarely used)"},"usage_notes":{"explanation":"\"Ticket-selling\" refers to the activity of selling tickets, often for events such as concerts, sports games, or transportation. It can encompass various methods, including online platforms, physical ticket booths, and authorized agents. The term is commonly used in contexts related to event management, marketing, and commerce.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The ticket-sell is good.","correct":"✓ The ticket-selling is good.","note":"\"Ticket-selling\" is a noun describing the activity, while \"ticket-sell\" is not a standard term. Use \"ticket sales\" as an alternative."},{"incorrect":"✗ He is a ticket-selling.","correct":"✓ He is a ticket seller.","note":"To describe a person who sells tickets, use \"ticket seller\" or \"ticket agent\" instead of \"ticket-selling\"."}],"priority":"★★☆"},"related_words":{"derivatives":["ticket seller","ticket agent","ticket sales","ticketing"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Ticket-selling\" is a compound noun that describes the activity of selling tickets, usually for events or transportation. It's a straightforward term, but its usage is more common in professional or business contexts related to event management or sales. Understanding the term is helpful for comprehending discussions about event planning, marketing strategies, and revenue generation.","priority":"★★☆"},"example_sentences":[{"sentence":"The company specializes in online ticket-selling for major sporting events.","translation":"その会社は主要なスポーツイベントのオンラインチケット販売を専門としています。","type":"general","meaning_category":"チケット販売"},{"sentence":"The success of the festival depended on effective ticket-selling strategies.","translation":"そのフェスティバルの成功は、効果的なチケット販売戦略にかかっていました。","type":"general","meaning_category":"チケット販売"},{"sentence":"They invested heavily in their ticket-selling infrastructure.","translation":"彼らはチケット販売のインフラに多額の投資をしました。","type":"general","meaning_category":"チケット販売"}]}