{"word":"cuppings","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(コーヒーの)カッピング、テイスティング","english_definition":"The practice of observing the tastes and aromas of brewed coffee.","examples":[{"sentence":"We held a cuppings session to evaluate the new coffee beans.","translation":"新しいコーヒー豆を評価するために、カッピングセッションを開催しました。"},{"sentence":"The cuppings revealed a complex flavor profile with notes of chocolate and cherry.","translation":"カッピングによって、チョコレートとチェリーのノートを持つ複雑な風味特性が明らかになりました。"}],"collocations":["coffee cuppings","cuppings session","blind cuppings"],"synonyms":["coffee tasting"],"antonyms":[]},{"part_of_speech":"noun","definition":"(伝統医療の)吸い玉療法","english_definition":"A traditional medicine practice in which a therapist puts special cups on your skin for a few minutes to create suction.","examples":[{"sentence":"He received cuppings therapy to relieve his back pain.","translation":"彼は背中の痛みを和らげるために吸い玉療法を受けました。"},{"sentence":"The athlete used cuppings to help with muscle recovery.","translation":"そのアスリートは筋肉の回復を助けるために吸い玉療法を利用しました。"}],"collocations":["wet cuppings","dry cuppings","cuppings therapy"],"synonyms":["vacuum therapy"],"antonyms":[]}],"etymology":{"value":"The word \"cuppings\" is derived from the practice of using cups to taste coffee or as part of traditional cupping therapy.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkʌpɪŋz/","syllables":"cup-pings"},"inflection":{"noun_plural":"cuppings"},"usage_notes":{"explanation":"The term \"cuppings\" refers to two distinct practices: coffee tasting and a form of traditional medicine. In the context of coffee, it describes the process of evaluating the taste and aroma of brewed coffee. In traditional medicine, it refers to a therapy where cups are used to create suction on the skin. The context usually makes it clear which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to a cupping tomorrow.","correct":"✓ I'm going to a cuppings session tomorrow.","note":"When referring to coffee tasting, it's more common to say 'cuppings session' to clarify the event. Alternatively, 'I'm going to a coffee tasting tomorrow' is also correct."},{"incorrect":"✗ He had a cupping done for his back pain.","correct":"✓ He had cuppings done for his back pain.","note":"When referring to the therapy, 'cuppings' is typically used in the plural form."}],"priority":"★★☆"},"related_words":{"derivatives":["cup (noun, verb)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"cuppings\" has two main meanings. One refers to the practice of tasting and evaluating coffee, often used by coffee professionals. The other refers to a traditional medicine technique where cups are applied to the skin to create suction. The meaning is usually clear from the context, but it's important to be aware of both possibilities.","priority":"★★☆"},"example_sentences":[{"sentence":"The coffee **cuppings** helped us identify the best beans.","translation":"コーヒーのカッピングは、私たちが最高の豆を特定するのに役立ちました。","type":"noun","meaning_category":"Coffee Tasting"},{"sentence":"She tried **cuppings** to alleviate her muscle soreness.","translation":"彼女は筋肉痛を和らげるために吸い玉療法を試しました。","type":"noun","meaning_category":"Traditional Medicine"}]}