{"word":"predismissal","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"解雇前の、解雇予告期間中の","english_definition":"Relating to the period before a dismissal, especially in the context of employment law.","examples":[{"sentence":"The employee was placed on administrative leave during the predismissal investigation.","translation":"従業員は解雇前の調査期間中、自宅待機を命じられた。"},{"sentence":"Predismissal procedures must be followed to ensure fairness and avoid legal challenges.","translation":"公正さを確保し、法的異議申し立てを避けるためには、解雇前の手続きを遵守する必要がある。"}],"collocations":["predismissal investigation","predismissal procedure","predismissal hearing","predismissal suspension"],"synonyms":["pre-termination","pre-discharge"],"antonyms":["postdismissal"],"notes":"This term is primarily used in legal and human resources contexts. It refers to actions, investigations, or hearings that occur before an employee is formally dismissed from their job.","related_terms":["wrongful dismissal","termination","employment law","human resources"]}],"etymology":{"value":"Formed by adding the prefix 'pre-' (before) to 'dismissal' (the act of being dismissed).","priority":"N/A"},"pronunciation":{"ipa":"/ˌpriːdɪˈsmɪsəl/","syllables":"pre-dis-mis-sal"},"inflection":{"notes":"This word is primarily used as an adjective. It does not have typical inflections like verbs or nouns."},"usage_notes":{"explanation":"'Predismissal' is a term used in the context of employment law and human resources to describe actions or events that occur before an employee is formally dismissed from their position. It often refers to investigations, hearings, or other procedures undertaken by the employer to determine whether there are grounds for dismissal and to ensure that the dismissal is fair and lawful.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The predismissal was handled poorly.","correct":"✓ The predismissal investigation was handled poorly.","note":"'Predismissal' is an adjective, so it needs to modify a noun (like 'investigation,' 'hearing,' or 'procedure')."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Primarily used in legal and HR contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'predismissal' is a specialized term used in legal and HR contexts. It refers to the period or actions taken before an employee is formally dismissed from their job. Understanding this term requires familiarity with employment law and HR practices."},"example_sentences":[{"sentence":"The company conducted a thorough predismissal review before terminating the employee.","translation":"会社は従業員を解雇する前に、徹底的な解雇前審査を実施した。","type":"adjective","meaning_category":"解雇前の"},{"sentence":"The employee was given an opportunity to respond to the allegations during the predismissal hearing.","translation":"従業員は解雇前のヒアリングで、申し立てに対して反論する機会を与えられた。","type":"adjective","meaning_category":"解雇前の"}]}