{"word":"infamously","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"悪名高く、不名誉にも、評判悪く","english_definition":"in a way that is well known for being bad or evil; notoriously.","examples":[{"sentence":"The restaurant is infamously known for its terrible service.","translation":"そのレストランは、ひどいサービスで悪名高い。"},{"sentence":"He was infamously involved in the scandal.","translation":"彼は不名誉にもそのスキャンダルに関与していた。"},{"sentence":"The battle is infamously remembered for its brutality.","translation":"その戦いは、その残虐性で悪名高く記憶されている。"}],"collocations":["infamously known","infamously remembered","infamously described","infamously bad","infamously difficult"],"synonyms":["notoriously","scandalously","disgracefully","shamefully","wickedly","egregiously"],"antonyms":["famously","honorably","reputably","nobly"]}],"etymology":{"value":"\"Infamously\" is derived from \"infamous,\" which comes from the Latin word \"infamis,\" meaning \"of ill fame, notorious.\" \"In-\" means \"not,\" and \"fama\" means \"fame\" or \"reputation.\" The addition of the suffix \"-ly\" turns the adjective into an adverb.","priority":"★★★"},"pronunciation":{"ipa":"/ɪnˈfeɪməsli/","syllables":"in-fa-mous-ly"},"inflection":{"notes":"As an adverb, \"infamously\" does not have different inflections."},"usage_notes":{"explanation":"\"Infamously\" is used to describe something that is famous or well-known, but for negative reasons. It emphasizes the negative reputation or notoriety of the subject. It's stronger than simply saying something is \"bad\" because it implies widespread knowledge of the negativity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She was famously a liar.","correct":"✓ She was infamously a liar.","note":"Use \"infamously\" when the fame is due to negative qualities or actions, not positive ones."},{"incorrect":"✗ The movie was infamously good.","correct":"✓ The movie was famously good.","note":"\"Infamously\" cannot be used to describe something positive."}],"priority":"★★☆"},"related_words":{"derivatives":["infamous (adjective)","infamy (noun)"],"phrases":["infamous last words"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but used in formal and journalistic contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word \"infamously\" is used to describe something that is well-known for negative reasons. It's a more formal and sophisticated way of saying something is \"bad\" or \"notorious.\" It's often used in news articles or historical accounts to describe events or people that are remembered for their negative impact or actions. For example, \"The dictator is infamously known for his human rights abuses.\" This means that the dictator is widely known and remembered for his bad actions related to human rights.","priority":"★★☆"},"example_sentences":[{"sentence":"The trial is infamously known for its biased judge.","translation":"その裁判は、偏った判事で悪名高い。","type":"general","meaning_category":"悪名高い"},{"sentence":"He infamously betrayed his friends for personal gain.","translation":"彼は個人的な利益のために不名誉にも友人を裏切った。","type":"general","meaning_category":"不名誉にも"},{"sentence":"The company is infamously slow to respond to customer complaints.","translation":"その会社は、顧客からの苦情への対応が非常に遅いことで評判が悪い。","type":"general","meaning_category":"評判悪く"}]}