{"word":"Sporotrichosis","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"スポロトリコーシス（皮膚真菌症の一種）","english_definition":"A fungal infection caused by the fungus Sporothrix schenckii, typically affecting the skin, but can also affect other organs.","examples":[{"sentence":"The gardener developed sporotrichosis after handling rose bushes.","translation":"その庭師はバラの茂みを扱った後、スポロトリコーシスを発症した。"},{"sentence":"Sporotrichosis is treated with antifungal medications.","translation":"スポロトリコーシスは抗真菌薬で治療される。"}],"collocations":["cutaneous sporotrichosis (皮膚スポロトリコーシス)","pulmonary sporotrichosis (肺スポロトリコーシス)","disseminated sporotrichosis (播種性スポロトリコーシス)"],"synonyms":["rose gardener's disease"],"antonyms":[]}],"etymology":{"value":"From the genus name *Sporothrix* (from Greek 'sporos' meaning seed or spore, and 'thrix' meaning hair or fungus) + -osis (denoting a disease or condition).","priority":"★★★"},"pronunciation":{"ipa":"/ˌspɔːroʊtrɪˈkoʊsɪs/","syllables":"spo-ro-tri-cho-sis"},"inflection":{"noun_plural":"sporotrichoses"},"usage_notes":{"explanation":"Sporotrichosis is typically acquired through traumatic inoculation of fungal spores into the skin, often from plants or soil. It is more common in individuals who work with plants, such as gardeners and farmers. While cutaneous sporotrichosis is the most common form, the infection can spread to other parts of the body in rare cases, leading to more serious conditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Sporotrichosis is a bacterial infection.","correct":"✓ Sporotrichosis is a fungal infection.","note":"Sporotrichosis is caused by a fungus, not bacteria."},{"incorrect":"✗ You can catch sporotrichosis from someone coughing.","correct":"✓ Sporotrichosis is usually contracted through direct contact with the fungus, often through a cut or puncture wound.","note":"Sporotrichosis is not typically transmitted from person to person."}],"priority":"★★☆"},"related_words":{"derivatives":["sporothrix (属名)","sporotrichotic (形容詞)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Sporotrichosis is a relatively rare fungal infection typically contracted through contact with contaminated plant matter or soil. The infection usually manifests as skin lesions, but in some cases, it can spread to other parts of the body. Treatment typically involves antifungal medications. The term is primarily used in medical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor suspected sporotrichosis based on the patient's symptoms and history of gardening.","translation":"医師は患者の症状と園芸の経歴から、スポロトリコーシスを疑った。","type":"general","meaning_category":"diagnosis"},{"sentence":"Early diagnosis and treatment of sporotrichosis are important to prevent complications.","translation":"スポロトリコーシスの早期診断と治療は、合併症を防ぐために重要である。","type":"general","meaning_category":"treatment"},{"sentence":"Cutaneous sporotrichosis often presents as a series of nodules along the lymphatic vessels.","translation":"皮膚スポロトリコーシスは、しばしばリンパ管に沿って一連の結節として現れる。","type":"medical","meaning_category":"symptoms"}]}