{"word":"convivially","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"打ち解けて、陽気に、懇親的に、楽しく親睦を深めるように","english_definition":"in a friendly, lively, and enjoyable way; in a manner that promotes sociability and good company.","examples":[{"sentence":"The guests chatted convivially around the fireplace.","translation":"客たちは暖炉の周りで打ち解けておしゃべりをした。"},{"sentence":"They spent the evening convivially, sharing stories and laughter.","translation":"彼らはその夜を陽気に過ごし、物語を語り合い、笑い合った。"},{"sentence":"The business deal was sealed convivially over a celebratory dinner.","translation":"そのビジネス取引は、祝賀ディナーで楽しく親睦を深めながら締結された。"}],"collocations":["chat convivially","dine convivially","spend time convivially","gather convivially","celebrate convivially"],"synonyms":["sociably","genially","amiably","cordially","gregariously","festively","merrily","jovially"],"antonyms":["unsociably","reservedly","formally","stiffly","distantly"]}],"etymology":{"value":"Derived from the adjective 'convivial,' which comes from the Latin 'convivialis,' meaning 'relating to a feast or banquet,' from 'convivium,' meaning 'a feast,' from 'convivere,' meaning 'to live together, feast together,' from 'com-' (together) + 'vivere' (to live). The adverbial form is created by adding the suffix '-ly' to 'convivial.'","priority":"★★☆"},"pronunciation":{"ipa":"/kənˈvɪviəli/","syllables":"con-viv-i-al-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Convivially' describes actions or behaviors that are characterized by friendliness, warmth, and a desire to enjoy the company of others. It suggests a relaxed and pleasant atmosphere where people feel comfortable interacting and sharing experiences. It is often used to describe social gatherings, meals, or events where the emphasis is on camaraderie and good cheer.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The atmosphere was convivially.","correct":"✓ The atmosphere was convivial.","note":"'Convivially' is an adverb and modifies verbs, adjectives, or other adverbs. 'Convivial' is an adjective and describes nouns. In the incorrect example, an adverb is used where an adjective is needed to describe the noun 'atmosphere.'"},{"incorrect":"✗ They acted convivial.","correct":"✓ They acted convivially.","note":"'Convivial' is an adjective, so it cannot directly modify the verb 'acted.' The adverb 'convivially' is needed to describe how they acted."}],"priority":"★★☆"},"related_words":{"derivatives":["convivial (adjective: friendly, lively, and enjoyable)","conviviality (noun: the quality of being friendly, lively, and enjoyable; sociability)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"convivially\" describes how something is done in a friendly, lively, and enjoyable way, often involving good company and a pleasant atmosphere. It's used to describe actions or behaviors that are sociable and promote a sense of camaraderie. Since it is not a common word, understanding its root word \"convivial\" (friendly, lively) can help grasp its meaning. It is more frequently encountered in formal writing or descriptions of social events."},"example_sentences":[{"sentence":"The team celebrated their victory convivially at a local pub.","translation":"チームは地元のパブで勝利を打ち解けて祝った。","type":"adverb","meaning_category":"manner"},{"sentence":"The conference provided an opportunity for researchers to network convivially.","translation":"その会議は、研究者たちが懇親的に交流する機会を提供した。","type":"adverb","meaning_category":"manner"},{"sentence":"Despite their initial differences, the diplomats negotiated convivially and reached an agreement.","translation":"当初の意見の相違にもかかわらず、外交官たちは友好的に交渉し、合意に達した。","type":"adverb","meaning_category":"manner"}]}