{"word":"spell-raised","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(ファンタジー)魔法によって強化された、魔法的に強化された","english_definition":"(fantasy) Enhanced or augmented through magical means; magically empowered.","examples":[{"sentence":"The hero wielded a spell-raised sword that glowed with arcane energy.","translation":"英雄は、秘術のエネルギーで輝く、魔法によって強化された剣を振るった。"},{"sentence":"The ancient city was protected by spell-raised golems.","translation":"古代都市は、魔法的に強化されたゴーレムによって守られていた。"},{"sentence":"Her spell-raised abilities allowed her to manipulate the elements.","translation":"彼女の魔法的に強化された能力により、彼女は元素を操ることができた。"}],"collocations":["spell-raised sword","spell-raised golem","spell-raised abilities","spell-raised defenses","spell-raised armor"],"synonyms":["magically enhanced","enchanted","imbued with magic","magically empowered"],"antonyms":["mundane","unenchanted","non-magical"]}],"etymology":{"value":"A compound word formed from 'spell' (referring to a magical incantation or effect) and 'raised' (implying an increase in power or ability). The combination suggests that something has been elevated or enhanced through the use of magic.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈspɛlˌreɪzd/","syllables":"spell-raised"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have different forms for gender or number."},"usage_notes":{"explanation":"The term 'spell-raised' is primarily used in fantasy literature, games, and other fictional contexts. It describes something that has been improved or enhanced by magical spells or enchantments. It's often used to describe weapons, armor, creatures, or abilities that have been made more powerful or effective through magic.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The spell-raised is very strong.","correct":"✓ The spell-raised warrior is very strong.","note":"'Spell-raised' is an adjective and needs to modify a noun. It cannot stand alone as a subject or object."},{"incorrect":"✗ He spell-raised the sword.","correct":"✓ He used magic to raise the sword's power. / He enchanted the sword.","note":"'Spell-raised' is an adjective, not a verb. To describe the act of enhancing something with magic, use verbs like 'enchant,' 'imbue,' or 'empower'."}],"priority":"★★☆"},"related_words":{"derivatives":["spellcasting","enchantment","magic","empowered"],"phrases":["imbued with magic","magically enhanced","arcane energy"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specific to fantasy genre)","frequency_google_ngram":"Low frequency (Primarily used in fantasy contexts)","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'spell-raised' is a compound adjective commonly found in fantasy literature and gaming. It describes something that has been enhanced or empowered through magical means. Understanding this term requires familiarity with fantasy genre conventions. It's not typically used in everyday conversation or non-fiction writing. The word combines 'spell,' referring to magic, and 'raised,' indicating an increase in power or status. Therefore, a 'spell-raised' object or being has been magically improved.","priority":"★★☆"},"example_sentences":[{"sentence":"The spell-raised shield deflected the dragon's fiery breath.","translation":"魔法で強化された盾は、ドラゴンの炎の息をそらした。","type":"adjective","meaning_category":"magically enhanced"},{"sentence":"The spell-raised knight was nearly invincible in battle.","translation":"魔法で強化された騎士は、戦闘でほとんど無敵だった。","type":"adjective","meaning_category":"magically empowered"},{"sentence":"The spell-raised artifact pulsed with ancient power.","translation":"魔法で強化されたアーティファクトは、古代の力で脈打っていた。","type":"adjective","meaning_category":"magically enhanced"}]}