{"word":"Precisionist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"精密主義者、厳密主義者","english_definition":"An artist or architect belonging to or influenced by Precisionism, an early 20th-century American art movement characterized by simplified, geometric forms and industrial subjects.","examples":[{"sentence":"The Precisionists celebrated the beauty of the machine age.","translation":"精密主義者たちは機械時代の美しさを称賛した。"},{"sentence":"Charles Sheeler was a prominent Precisionist painter.","translation":"チャールズ・シーラーは著名な精密主義の画家だった。"}],"collocations":["Precisionist art","Precisionist painting","Precisionist architecture"],"synonyms":["Cubist","Futurist","Modernist"],"antonyms":["Realist","Impressionist"]},{"part_of_speech":"adjective","definition":"精密主義の、厳密主義の","english_definition":"Relating to or characteristic of Precisionism.","examples":[{"sentence":"The painting has a Precisionist style, with clean lines and sharp edges.","translation":"その絵は、クリーンな線とシャープなエッジを持つ精密主義のスタイルを持っている。"},{"sentence":"The architect designed the building with a Precisionist aesthetic.","translation":"建築家は精密主義の美学で建物を設計した。"}],"collocations":["Precisionist style","Precisionist aesthetic","Precisionist approach"],"synonyms":["geometric","abstract","industrial"],"antonyms":["realistic","impressionistic"]}],"etymology":{"value":"The term 'Precisionism' was coined in the early 20th century to describe American artists who depicted industrial and architectural subjects with a focus on clean lines, geometric forms, and a sense of order.","priority":"★★★"},"pronunciation":{"ipa":"/prɪˈsɪʒənɪst/","syllables":"pre-ci-sion-ist"},"inflection":{"noun_plural":"Precisionists"},"usage_notes":{"explanation":"'Precisionist' refers to both the artists and the style of art that emerged in America between World War I and World War II. It is characterized by its focus on industrial and architectural subjects, rendered with sharp, clean lines and geometric forms. The movement sought to find beauty in the modern, industrial landscape.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a precisionist in his daily life, always organizing everything perfectly.","correct":"✓ He is a perfectionist in his daily life, always organizing everything perfectly.","note":"'Precisionist' refers specifically to the art movement. For someone who is meticulous in their daily life, 'perfectionist' is more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["Precisionism (noun): The art movement itself."],"phrasal_verbs":[],"related_terms":["Cubism","Futurism","Modernism","Art Deco"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'Precisionist' is specific to the art world, referring to a particular movement in American art during the early 20th century. Understanding the term requires familiarity with art history and movements such as Cubism and Futurism, which influenced Precisionism. The word is not commonly used outside of discussions about art history or architectural design.","priority":"★★★"},"example_sentences":[{"sentence":"Georgia O'Keeffe's cityscapes are often associated with the Precisionist movement, although she never formally joined it.","translation":"ジョージア・オキーフの都市景観は、彼女が正式に参加したことはないものの、しばしば精密主義運動と関連付けられる。","type":"noun","meaning_category":"art movement"},{"sentence":"The architect's design reflected a Precisionist sensibility, emphasizing clean lines and geometric shapes.","translation":"建築家のデザインは、クリーンなラインと幾何学的な形状を強調し、精密主義的な感性を反映していた。","type":"adjective","meaning_category":"style and design"}]}