{"word":"intergradation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"漸移、中間段階、移行段階","english_definition":"A gradual change from one condition or state to another; a series of intermediate stages between two extremes.","examples":[{"sentence":"The intergradation between the two species makes it difficult to classify them distinctly.","translation":"その二つの種の間には漸移が見られるため、明確に分類することが難しい。"},{"sentence":"There is a clear intergradation in color from the center to the edge of the flower.","translation":"その花の中心から縁にかけて、色の段階的な変化（漸移）がはっきりと見られる。"},{"sentence":"The intergradation of dialects across the region makes it hard to draw a clear boundary.","translation":"その地域の方言の漸移のために、明確な境界線を引くことは難しい。"}],"collocations":["show intergradation","exhibit intergradation","gradual intergradation","clear intergradation"],"synonyms":["gradation","transition","gradation","continuum","series","sequence"],"antonyms":["discontinuity","separation","distinction","divergence"]}],"etymology":{"value":"Formed from 'inter-' (between) + 'gradation' (a series of stages).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˌtɜːrɡreɪˈdeɪʃən/","syllables":"in-ter-gra-da-tion"},"inflection":{"noun_plural":"intergradations"},"usage_notes":{"explanation":"'Intergradation' describes a situation where distinct categories blend into each other through a series of intermediate forms. It is often used in biology to describe species that are not clearly distinct, or in linguistics to describe dialects that gradually change across a region. It implies a continuous spectrum rather than discrete categories.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The intergradation was sudden.","correct":"✓ The transition was sudden.","note":"'Intergradation' implies a gradual change, so it cannot be sudden. Use 'transition' instead."},{"incorrect":"✗ There is a clear intergradation, so we can easily distinguish them.","correct":"✓ There is a clear distinction, so we can easily distinguish them.","note":"'Intergradation' makes it difficult to distinguish things, so the opposite is true."}],"priority":"★★☆"},"related_words":{"derivatives":["intergrade (verb, noun)","gradation (noun)","grade (verb, noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'intergradation' is a somewhat technical term referring to the gradual blending or transition between two distinct categories or states. It is often used in scientific or academic contexts, particularly in biology, linguistics, or geography, to describe situations where clear boundaries are difficult to define due to a continuous spectrum of variation. Understanding this word requires a good vocabulary and familiarity with abstract concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The **intergradation** of plant species along the mountain slope was evident.","translation":"山の斜面に沿った植物種の漸移は明らかだった。","type":"general","meaning_category":"漸移"},{"sentence":"The **intergradation** between traditional and modern art forms is a key feature of contemporary culture.","translation":"伝統的な芸術形式と現代的な芸術形式の間の漸移は、現代文化の重要な特徴である。","type":"general","meaning_category":"漸移"},{"sentence":"The study focused on the **intergradation** of soil types across the valley.","translation":"その研究は、谷にわたる土壌タイプの漸移に焦点を当てた。","type":"scientific","meaning_category":"漸移"}]}