{"word":"duco","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(オーストラリア英語、古語) デュコ塗装、ラッカー塗装","english_definition":"(Australian English, dated) A type of lacquer or enamel finish for vehicles and furniture.","examples":[{"sentence":"The car had a beautiful duco finish.","translation":"その車は美しいデュコ塗装が施されていた。"},{"sentence":"He restored the old table with a fresh coat of duco.","translation":"彼は古いテーブルをデュコ塗装で塗り直して修復した。"}],"collocations":["duco finish","duco paint","duco spray"],"synonyms":["lacquer","enamel","paint"],"antonyms":[]},{"part_of_speech":"verb","definition":"(オーストラリア英語、古語) デュコ塗装する、ラッカー塗装する","english_definition":"(Australian English, dated) To apply a duco finish to something.","examples":[{"sentence":"He ducoed the car in his garage.","translation":"彼はガレージで車をデュコ塗装した。"},{"sentence":"The furniture was ducoed in a bright color.","translation":"その家具は明るい色でデュコ塗装されていた。"}],"collocations":["duco a car","duco furniture"],"synonyms":["lacquer","enamel","paint"],"antonyms":[]}],"etymology":{"value":"Derived from the brand name 'Duco', a popular brand of lacquer paint in the early 20th century.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdjuːkoʊ/","syllables":"du-co"},"inflection":{"verb_forms":{"present_simple":["duco","ducoes"],"past_simple":"ducoed","past_participle":"ducoed","present_participle":"ducoing"},"noun_plural":"ducoes"},"usage_notes":{"explanation":"'Duco' is primarily an Australian English term, and its use is now considered dated. It refers specifically to a type of lacquer or enamel finish that was commonly used on cars and furniture in the early to mid-20th century. While the term might still be understood by older Australians, it is not in common usage today.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to duco my house with oil paint.","correct":"✓ I'm going to paint my house with oil paint.","note":"'Duco' refers to a specific type of lacquer or enamel, not just any kind of paint. Using 'paint' is more general and accurate in most contexts."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, mostly in Australian English contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'duco' is a dated term, primarily used in Australian English, referring to a specific type of lacquer or enamel finish. Its usage is infrequent in modern English, making it a term that would likely only be encountered by those familiar with historical or specialized contexts related to automotive or furniture finishing. Understanding the term requires knowledge of historical paint technologies and regional vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The vintage car was meticulously restored with its original duco finish.","translation":"そのヴィンテージカーは、オリジナルのデュコ塗装で細心の注意を払って修復された。","type":"noun","meaning_category":"塗装"},{"sentence":"He decided to duco the old dresser to give it a new look.","translation":"彼は古いドレッサーをデュコ塗装して、新しい外観にすることにした。","type":"verb","meaning_category":"塗装する"}]}