{"word":"Bronzers","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ブロンザー（日焼けしたような肌色を演出する化粧品）","english_definition":"Cosmetic products used to give the skin a tanned appearance.","examples":[{"sentence":"She applied bronzers to her cheeks to give her face a sun-kissed glow.","translation":"彼女は頬にブロンザーを塗って、日焼けしたような輝きを顔に与えた。"},{"sentence":"Bronzers are available in various forms, including powders, creams, and liquids.","translation":"ブロンザーは、パウダー、クリーム、リキッドなど、さまざまな形態で入手できる。"}],"collocations":["apply bronzer","matte bronzer","shimmer bronzer","bronzer brush","bronzer palette"],"synonyms":["tanning powder","sunless tanner"],"antonyms":["highlighter","foundation"],"notes":"Bronzers is the plural form of bronzer."}],"etymology":{"value":"Derived from the word 'bronze', referring to the brownish color associated with a sun tan.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbrɒnzərz/","syllables":"bron-zers"},"inflection":{"noun_plural":"Bronzers"},"usage_notes":{"explanation":"'Bronzers' are primarily used in makeup to mimic the effect of sun-tanned skin without sun exposure. They are typically applied to areas where the sun would naturally hit, such as the cheeks, forehead, nose, and chin.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I use bronzer for cover my acne.","correct":"✓ I use foundation to cover my acne, and bronzer to add color.","note":"Bronzer is for adding color, not for covering blemishes."},{"incorrect":"✗ He wears bronzers.","correct":"✓ She wears bronzer.","note":"Bronzer is typically associated with feminine makeup, though anyone can use it."}],"priority":"★★☆"},"related_words":{"derivatives":["bronzer (singular form)","bronze (color)","tan (skin color)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Bronzers' are cosmetic products used to make the skin look tanned. They are applied to the face to give a sun-kissed appearance without the need for sun exposure. Understanding the term requires some familiarity with makeup and beauty products."},"example_sentences":[{"sentence":"She experimented with different shades of bronzers to find the perfect match for her skin tone.","translation":"彼女は自分の肌色にぴったりの色を見つけるために、さまざまな色のブロンザーを試した。","type":"noun","meaning_category":"cosmetics"},{"sentence":"Many people prefer using matte bronzers for a more natural look.","translation":"多くの人々は、より自然な仕上がりのためにマットなブロンザーを使うことを好む。","type":"noun","meaning_category":"cosmetics"}]}