{"word":"quadrivalence","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(化学)四価、原子価が4であること","english_definition":"The state of being quadrivalent; the property of having a valence of four.","examples":[{"sentence":"The quadrivalence of carbon allows it to form a wide variety of organic compounds.","translation":"炭素の四価性により、多様な有機化合物を形成できる。"}],"collocations":["exhibit quadrivalence","demonstrate quadrivalence"],"synonyms":["tetravalence"],"antonyms":["monovalence","divalence","trivalence"]},{"part_of_speech":"noun","definition":"(免疫学)四価ワクチン、4種類の抗原を含むワクチン","english_definition":"A quadrivalent vaccine; a vaccine that protects against four different strains or types of a disease.","examples":[{"sentence":"The quadrivalence vaccine protects against four strains of influenza.","translation":"その四価ワクチンは4種類のインフルエンザ株から保護する。"}],"collocations":["administer quadrivalence","develop quadrivalence"],"synonyms":["tetravalent vaccine"],"antonyms":["monovalent vaccine","bivalent vaccine","trivalent vaccine"]}],"etymology":{"value":"From the combination of \"quadri-\" (meaning four) and \"valence\" (referring to the combining power of an atom or the protective ability of a vaccine).","priority":"★★★"},"pronunciation":{"ipa":"/ˌkwɒdrɪˈveɪləns/","syllables":"quad-ri-va-lence"},"inflection":{"noun_plural":"quadrivalences"},"usage_notes":{"explanation":"The term \"quadrivalence\" is used in two main contexts: chemistry and immunology. In chemistry, it refers to the ability of an atom to form four chemical bonds. In immunology, it refers to a vaccine that protects against four different strains or types of a disease.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The quadrivalence of oxygen is important for water formation.","correct":"✓ The divalence of oxygen is important for water formation.","note":"Oxygen is divalent, not quadrivalent. Carbon is a common example of a quadrivalent element."}],"priority":"★★☆"},"related_words":{"derivatives":["quadrivalent (adjective)"],"related_terms":["valence","tetravalent","vaccine","influenza"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word \"quadrivalence\" is a technical term used in chemistry and immunology. In chemistry, it describes an atom's ability to form four chemical bonds. In immunology, it refers to a vaccine that protects against four different strains of a disease. Understanding this word requires knowledge of these fields.","priority":"★★★"},"example_sentences":[{"sentence":"The **quadrivalence** of the metal ion allowed it to form complex structures.","translation":"その金属イオンの四価性により、複雑な構造を形成できた。","type":"noun","meaning_category":"Chemistry"},{"sentence":"The new **quadrivalence** vaccine is expected to provide broader protection against the virus.","translation":"その新しい四価ワクチンは、そのウイルスに対するより広範な保護を提供すると期待されている。","type":"noun","meaning_category":"Immunology"}]}