{"word":"Contemporising","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"現在化する、現代風にする、同時代化する","english_definition":"To make something more modern or suitable for the present time.","examples":[{"sentence":"The director is contemporising Shakespeare's play by setting it in a modern city.","translation":"監督はシェイクスピアの劇を現代の都市を舞台にすることで現代風にしている。"},{"sentence":"The museum is contemporising its exhibits to attract a younger audience.","translation":"博物館は若い観客を引きつけるために展示を現代化している。"}],"collocations":["contemporise a play","contemporise an exhibit","contemporise a design"],"synonyms":["modernizing","updating","revamping","revising","adapting"],"antonyms":["antiquating","archaizing","obsoleting"]}],"etymology":{"value":"From the verb 'contemporise,' which comes from 'contemporary' (existing or occurring at the same time) + '-ize' (a suffix indicating to make or become).","priority":"☆☆☆"},"pronunciation":{"ipa":"/kənˈtempəraɪzɪŋ/","syllables":"con-tem-po-ris-ing"},"inflection":{"verb_forms":{"present_participle":"contemporising"}},"usage_notes":{"explanation":"'Contemporising' refers to the act of making something, typically art, literature, or design, more relevant or appealing to a modern audience. It often involves updating elements to reflect current trends, values, or technologies.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is contemporising the old car with new tires.","correct":"✓ He is modernizing the old car with new tires.","note":"'Contemporising' is usually used for cultural or artistic works, not for simple updates like tires on a car. 'Modernizing' is more appropriate here."}],"priority":"☆☆☆"},"related_words":{"derivatives":["contemporise (verb)","contemporary (adjective, noun)","contemporization (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Contemporising' is a relatively advanced term used to describe the process of making something more modern or relevant to the present time. It is often used in the context of arts, culture, and design where older works are adapted to appeal to current audiences. The word implies a conscious effort to update or modernize something while maintaining its core essence."},"example_sentences":[{"sentence":"The artist is contemporising traditional folk music by adding electronic beats.","translation":"そのアーティストは伝統的なフォーク音楽に電子ビートを加えることで現代風にしている。","type":"verb","meaning_category":"現在化する"},{"sentence":"The author aimed at contemporising the classic novel for young readers.","translation":"その作家は古典小説を若い読者向けに現代風にすることを目的とした。","type":"verb","meaning_category":"現代風にする"}]}