{"word":"chytridial","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ツボカビ目の、ツボカビに特徴的な","english_definition":"Relating to or characteristic of chytrids (fungi in the order Chytridiales).","examples":[{"sentence":"The chytridial zoospores are motile with a single posterior flagellum.","translation":"そのツボカビの遊走子は、単一の後方鞭毛を持って運動性がある。"},{"sentence":"Chytridial infections can be devastating to amphibian populations.","translation":"ツボカビ感染症は、両生類の個体群にとって壊滅的なものとなりうる。"}],"collocations":["chytridial infection","chytridial zoospores"],"synonyms":["chytridiomycetous"],"antonyms":[]}],"etymology":{"value":"Derived from the order name 'Chytridiales' + '-al' (suffix indicating belonging or relation). The term 'Chytridiales' comes from the Greek 'chytridion' meaning 'little pot', referring to the shape of the zoosporangium.","priority":"★★☆"},"pronunciation":{"ipa":"/kɪˈtrɪdiəl/","syllables":"chy-trid-i-al"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"'Chytridial' is a specialized term used in mycology (the study of fungi) and related fields such as ecology and conservation biology. It is most often encountered in scientific literature or discussions concerning fungal diseases, particularly those affecting amphibians.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bacteria was chytridial.","correct":"✓ The fungus was chytridial.","note":"Chytrids are fungi, not bacteria."}],"priority":"★☆☆"},"related_words":{"derivatives":["Chytrid (noun: a fungus belonging to the Chytridiales order)","Chytridiomycota (noun: the phylum containing the chytrids)","Chytridiomycosis (noun: the disease caused by chytrid fungi, especially Batrachochytrium dendrobatidis)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. A technical term used primarily in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Chytridial' is a highly specialized term used within the field of mycology and related biological sciences. Understanding its meaning requires familiarity with the classification and characteristics of fungi, particularly the Chytridiales order. It is unlikely to be encountered outside of scientific or technical contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The study investigated the effects of chytridial pathogens on frog populations.","translation":"その研究は、ツボカビ病原体がカエルの個体群に及ぼす影響を調査した。","type":"general","meaning_category":"general"},{"sentence":"Microscopic examination revealed the presence of chytridial sporangia in the infected tissue.","translation":"顕微鏡検査により、感染した組織にツボカビの胞子嚢の存在が明らかになった。","type":"technical","meaning_category":"technical"}]}