{"word":"Wahiawa","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ワヒアワ：アメリカ合衆国ハワイ州オアフ島にある地名。国勢調査指定地域 (CDP)。","english_definition":"Wahiawa: A census-designated place (CDP) located in Honolulu County, on the island of Oʻahu, Hawaiʻi, United States.","examples":[{"sentence":"Wahiawa is located in the central part of Oahu.","translation":"ワヒアワはオアフ島の中央部に位置しています。"},{"sentence":"The pineapple industry was once a major part of Wahiawa's economy.","translation":"パイナップル産業はかつてワヒアワの経済の主要な部分でした。"}],"collocations":["Wahiawa, Hawaii","Central Oahu","pineapple fields"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Wahiawa' comes from the Hawaiian language, possibly meaning 'place of noise' or 'noisy place,' referring to the sounds of water rushing through the area.","priority":"★★☆"},"pronunciation":{"ipa":"/wɑːˈhiːɑːwɑː/","syllables":"Wa-hi-a-wa"},"inflection":{"notes":"Proper noun, does not inflect"},"usage_notes":{"explanation":"Wahiawa is a town located in the central part of Oahu, Hawaii. It is known for its historical connection to the pineapple industry and its proximity to military installations like Schofield Barracks. The area has a distinct local culture and a mix of residential and commercial areas.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Wahiawa is on Maui.","correct":"✓ Wahiawa is on Oahu.","note":"Wahiawa is located on the island of Oahu, not Maui."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_places":["Oahu","Honolulu","Schofield Barracks"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, specific to Hawaii.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"Wahiawa is a place name, specifically a town in central Oahu, Hawaii. It's important to know that it's a place name and its location. The name itself is Hawaiian in origin. Knowledge of Wahiawa is more relevant if you're discussing Hawaiian geography, history, or culture."},"example_sentences":[{"sentence":"Many residents of Wahiawa work at Schofield Barracks.","translation":"ワヒアワの多くの住民はスコフィールドバラックスで働いています。","type":"example","meaning_category":"Location and Economy"},{"sentence":"Lake Wilson is a popular recreational spot near Wahiawa.","translation":"ウィルソン湖はワヒアワ近郊の人気のあるレクリエーションスポットです。","type":"example","meaning_category":"Location and Recreation"}]}