{"word":"Native-inspired","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ネイティブ（先住民）の文化や伝統からインスピレーションを得た、影響を受けた","english_definition":"Inspired by or influenced by the culture, traditions, or art of indigenous peoples.","examples":[{"sentence":"The clothing line features Native-inspired designs.","translation":"その服飾ラインは、先住民の文化からインスピレーションを得たデザインが特徴です。"},{"sentence":"The artist creates Native-inspired sculptures using local materials.","translation":"そのアーティストは、地元の素材を使って先住民の文化からインスピレーションを受けた彫刻を制作しています。"},{"sentence":"The restaurant's menu includes Native-inspired dishes made with traditional ingredients.","translation":"そのレストランのメニューには、伝統的な食材を使った先住民の文化からインスピレーションを受けた料理が含まれています。"}],"collocations":["Native-inspired art (先住民の文化からインスピレーションを受けたアート)","Native-inspired design (先住民の文化からインスピレーションを受けたデザイン)","Native-inspired jewelry (先住民の文化からインスピレーションを受けたジュエリー)","Native-inspired cuisine (先住民の文化からインスピレーションを受けた料理)"],"synonyms":["indigenous-inspired","tribal-inspired","aboriginal-inspired"],"antonyms":["Western-inspired","modern-inspired","contemporary-inspired"]}],"etymology":{"value":"「Native」は「その土地固有の、先住の」を意味し、「inspired」は「インスピレーションを受けた、影響を受けた」を意味します。この複合語は、ある作品やデザインが、先住民の文化や芸術から着想を得ていることを示します。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈneɪtɪv ɪnˈspaɪərd/","syllables":"Na-tive in-spired"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"「**Native-inspired**」は、主にデザイン、アート、料理、ファッションなどの分野で使用され、作品が先住民の文化、伝統、芸術様式から影響を受けていることを示します。ただし、この用語を使用する際には、文化的な盗用や不適切な表現を避けるため、先住民の文化に対する敬意を払うことが重要です。作品が実際に先住民のコミュニティと協力して制作されたり、彼らの承認を得ている場合は、より適切に使用できます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building is Native-inspired from Europe.","correct":"✓ The building is Native-inspired.","note":"「Native」は特定の地域の先住民を指すため、ヨーロッパの先住民という表現は一般的ではありません。特定の地域を指す場合は、その地域の先住民の文化からインスピレーションを受けていることを明示する必要があります。"},{"incorrect":"✗ This is a Native-inspired but it's not really Native.","correct":"✓ This is Native-inspired, but it is not authentically Native.","note":"「Native-inspired」は、あくまでインスピレーションを受けていることを意味し、完全に先住民の文化そのものであるわけではありません。「authentically Native」という表現を使うことで、本物ではないことをより明確に伝えることができます。"}],"priority":"★★☆"},"related_words":{"derivatives":["Native (名詞/形容詞: 先住民、その土地固有の)","inspired (形容詞: インスピレーションを受けた、感動的な)","inspiration (名詞: インスピレーション、着想)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C1 (専門的な分野で使用されるため)","frequency_google_ngram":"低頻度 (Low frequency) - 特定の分野で使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Native-inspired**」は、ある作品やデザインが、先住民の文化や伝統からインスピレーションを受けていることを表す言葉です。この言葉は、アート、ファッション、料理など、さまざまな分野で使用されます。ただし、この言葉を使う際には、文化的な盗用や不適切な表現を避けるため、先住民の文化に対する敬意を払うことが重要です。作品が実際に先住民のコミュニティと協力して制作されたり、彼らの承認を得ている場合は、より適切に使用できます。"},"example_sentences":[{"sentence":"The museum features a collection of Native-inspired pottery.","translation":"その美術館は、先住民の文化からインスピレーションを受けた陶器のコレクションを展示しています。","type":"adjective","meaning_category":"先住民の文化からインスピレーションを得た"},{"sentence":"The chef creates innovative dishes using Native-inspired techniques.","translation":"そのシェフは、先住民の文化からインスピレーションを受けた技術を使って革新的な料理を作り出しています。","type":"adjective","meaning_category":"先住民の文化からインスピレーションを得た"},{"sentence":"The architect designed a Native-inspired community center that reflects the local heritage.","translation":"その建築家は、地元の遺産を反映した先住民の文化からインスピレーションを受けたコミュニティセンターを設計しました。","type":"adjective","meaning_category":"先住民の文化からインスピレーションを得た"}]}