{"word":"Germanic-derived","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"ゲルマン語派に由来する、ゲルマン語起源の","english_definition":"Originating from or derived from the Germanic languages.","examples":[{"sentence":"Many English words are Germanic-derived, reflecting the Anglo-Saxon influence.","translation":"多くの英単語はゲルマン語起源であり、アングロ・サクソン人の影響を反映している。"},{"sentence":"The word 'house' is a Germanic-derived term.","translation":"「house（家）」という単語はゲルマン語起源の言葉である。"},{"sentence":"A large portion of the English vocabulary is Germanic-derived, especially common, everyday words.","translation":"英語の語彙の大部分はゲルマン語に由来しており、特に一般的で日常的な単語に多い。"}],"collocations":["Germanic-derived word","Germanic-derived vocabulary","Germanic-derived language","Germanic-derived origin"],"synonyms":["Germanic in origin","from Germanic languages","of Germanic etymology"],"antonyms":["Romance-derived","Latin-derived","Greek-derived"]}],"etymology":{"value":"\"Germanic\" + \"derived\". \"Germanic\" refers to the Germanic languages, a branch of the Indo-European language family. \"Derived\" means originating or stemming from something. Thus, \"Germanic-derived\" means originating from the Germanic languages.","priority":"★★★"},"pronunciation":{"ipa":"/dʒɜːrˈmænɪk dɪˈraɪvd/","syllables":"Ger-man-ic de-rived"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"The term \"Germanic-derived\" is used to describe words or linguistic features that have their roots in the Germanic language family. This is particularly relevant in the context of English, which has a significant portion of its vocabulary originating from Old English (Anglo-Saxon), a West Germanic language. It is often used in contrast to words derived from Latin or Greek.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The word is German-derived.","correct":"✓ The word is Germanic-derived.","note":"Use \"Germanic\" to refer to the language family, not \"German\", which refers specifically to the German language."}],"priority":"★★☆"},"related_words":{"derivatives":["Germanic (adjective, noun)","derive (verb)","derivation (noun)"],"related_terms":["Indo-European","West Germanic","Old English","Proto-Germanic"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency, primarily used in linguistic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"Germanic-derived\" is typically used in academic or linguistic contexts. It refers to words or linguistic features that originate from the Germanic language family. Understanding the term requires familiarity with linguistic terminology and the history of languages, particularly the influence of Germanic languages on English."},"example_sentences":[{"sentence":"Many common English nouns, such as 'water' and 'land', are Germanic-derived.","translation":"「water（水）」や「land（土地）」のような多くの一般的な英名詞はゲルマン語起源である。","type":"adjective","meaning_category":"Origin"},{"sentence":"The study analyzed the proportion of Germanic-derived words in modern English.","translation":"その研究は、現代英語におけるゲルマン語起源の単語の割合を分析した。","type":"adjective","meaning_category":"Linguistics"},{"sentence":"Compared to Latin-derived words, Germanic-derived terms often have a simpler structure.","translation":"ラテン語起源の単語と比較して、ゲルマン語起源の用語はしばしばより単純な構造を持っている。","type":"adjective","meaning_category":"Comparison"}]}