{"word":"truth-cowed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Intimidated or silenced by the truth; feeling shame or fear in the face of undeniable facts.","english_definition":"Feeling intimidated, silenced, or ashamed by the truth; unable to speak or act freely due to the overwhelming power of factual evidence.","examples":[{"sentence":"The politician, truth-cowed by the leaked documents, could only stammer a weak denial.","translation":"政治家は、リークされた文書によって真実を突きつけられ、おどおどと弱い否定を繰り返すことしかできなかった。"},{"sentence":"The defendant, truth-cowed by the overwhelming evidence, finally confessed to the crime.","translation":"被告は、圧倒的な証拠によって真実を突きつけられ、ついに犯罪を自白した。"},{"sentence":"Many citizens, truth-cowed by the government's propaganda, remained silent despite their doubts.","translation":"多くの市民は、政府のプロパガンダによって真実を突きつけられ、疑念を抱きながらも沈黙を守った。"}],"collocations":["truth-cowed silence","truth-cowed confession","truth-cowed resignation","truth-cowed apology"],"synonyms":["intimidated","silenced","ashamed","humbled","overwhelmed","subdued","repressed"],"antonyms":["emboldened","liberated","empowered","truthful","honest","outspoken"]}],"etymology":{"value":"A compound word formed from 'truth' (the state of being in accordance with fact or reality) and 'cowed' (past participle of 'cow', meaning to intimidate or subdue by show of strength or authority). The word suggests a state of being subdued or silenced by the power of truth.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtruːθˌkaʊd/","syllables":"truth-cowed"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns and can be used in comparative and superlative forms (more truth-cowed, most truth-cowed), although these are rare."},"usage_notes":{"explanation":"'Truth-cowed' describes a state of being where someone is so overwhelmed by the truth that they are rendered silent, ashamed, or unable to act freely. It often implies a situation where the truth is undeniable and exposes wrongdoing or falsehoods. The term is relatively uncommon and may be considered somewhat literary or evocative. It suggests a psychological impact of truth, leading to a loss of confidence or agency.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was truth-cowed to speak.","correct":"✓ He was truth-cowed into silence. / ✓ He was truth-cowed and unable to speak.","note":"The phrase typically implies a state of being rather than a direct action. It's better to use it to describe the resulting state (silence, shame) or to use a construction that indicates the truth caused the state. "},{"incorrect":"✗ The truth-cowed man was very happy.","correct":"✓ The truth-cowed man was visibly shaken.","note":"The adjective implies a negative emotional state. It's unlikely someone would be happy if they are truth-cowed."}],"priority":"★★☆"},"related_words":{"derivatives":["cow (verb - to intimidate)","cowed (adjective - intimidated)","truth (noun - the state of being in accordance with fact or reality)"],"phrases":["face the truth","speak truth to power","the power of truth"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Very low frequency (rare word)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Truth-cowed' is a sophisticated and uncommon adjective that describes someone who is intimidated or silenced by the truth. It suggests that the truth is so powerful or damning that it causes the person to feel ashamed, fearful, or unable to speak or act freely. The word combines the concept of 'truth' with the idea of being 'cowed' (intimidated), creating a vivid image of someone being subdued by the weight of factual evidence. Because of its rarity and nuanced meaning, it is best suited for advanced English speakers and writers. "},"example_sentences":[{"sentence":"The CEO, truth-cowed by the whistleblower's testimony, resigned from his position.","translation":"CEOは、内部告発者の証言によって真実を突きつけられ、辞任した。","type":"adjective","meaning_category":"Intimidated by truth"},{"sentence":"Her truth-cowed expression revealed the guilt she had been hiding for years.","translation":"彼女の真実を突きつけられたような表情は、何年も隠してきた罪悪感を露呈した。","type":"adjective","meaning_category":"Ashamed by truth"},{"sentence":"The witness, truth-cowed by the prosecutor's relentless questioning, finally admitted to perjury.","translation":"証人は、検察官の容赦ない尋問によって真実を突きつけられ、ついに偽証を認めた。","type":"adjective","meaning_category":"Silenced by truth"}]}