{"word":"seedily","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"みすぼらしく、薄汚く、いかがわしく","english_definition":"In a seedy manner; shabbily, sleazily, or disreputably.","examples":[{"sentence":"The hotel room was seedily furnished, with stained carpets and peeling wallpaper.","translation":"そのホテルの部屋は、染みのついたカーペットと剥がれかけた壁紙で、みすぼらしく家具が置かれていた。"},{"sentence":"He lived seedily on the outskirts of town, avoiding contact with respectable society.","translation":"彼は町の郊外で、まともな社会との接触を避けながら、いかがわしく暮らしていた。"},{"sentence":"The bar was seedily lit, with a few shady characters lurking in the corners.","translation":"そのバーは薄暗く照らされ、隅には怪しげな人物が数人潜んでいた。"}],"collocations":["live seedily","seedily furnished","seedily lit"],"synonyms":["shabbily","sleazily","squalidly","disreputably","unkemptly","grungily","dingily"],"antonyms":["respectably","cleanly","smartly","elegantly"]}],"etymology":{"value":"Derived from the adjective 'seedy', which originally meant 'full of seeds' but later came to mean 'worn out' or 'shabby'. The adverb 'seedily' is formed by adding the suffix '-ly' to 'seedy'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsiːdɪli/","syllables":"see-di-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"'Seedily' describes something done or existing in a seedy manner, implying a state of disrepair, shabbiness, or moral disrepute. It often suggests a place or person that is run-down, neglected, or associated with questionable activities. The word carries a negative connotation and is used to describe something undesirable or unpleasant.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The garden was seedily planted.","correct":"The garden was poorly planted.","note":"'Seedily' refers to a state of shabbiness or disrepute, not the act of planting seeds. Use 'poorly' or another appropriate adverb to describe the quality of planting."}],"priority":"★★☆"},"related_words":{"derivatives":["seedy (adjective: shabby, disreputable)","seediness (noun: the state of being seedy)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Seedily' is an adverb that describes something done in a 'seedy' manner. 'Seedy' refers to something that is run-down, shabby, or disreputable. Therefore, 'seedily' suggests that something is done in a way that is not respectable or is associated with unpleasant or questionable circumstances. This word is not commonly used and is more likely to be found in literature or descriptive writing.","priority":"★★☆"},"example_sentences":[{"sentence":"The neighborhood had become seedily dangerous over the years.","translation":"その地域は長年にわたり、みすぼらしく危険になっていった。","type":"adverb","meaning_category":"みすぼらしく、いかがわしく"},{"sentence":"He dressed seedily in old, torn clothes.","translation":"彼は古くて破れた服を着て、みすぼらしく身なりをしていた。","type":"adverb","meaning_category":"みすぼらしく、いかがわしく"},{"sentence":"The club was seedily decorated with cheap, flashing lights.","translation":"そのクラブは、安っぽい点滅するライトで、いかがわしく装飾されていた。","type":"adverb","meaning_category":"みすぼらしく、いかがわしく"}]}