{"word":"Pompilidae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ベッコウバチ科 (昆虫の分類群)","english_definition":"a family of wasps (order Hymenoptera) known as spider wasps, characterized by their habit of hunting spiders to provision their nests.","examples":[{"sentence":"The Pompilidae are a diverse family of wasps found worldwide.","translation":"ベッコウバチ科は世界中に見られる多様なハチの科です。"},{"sentence":"A spider wasp (Pompilidae) was observed dragging a paralyzed spider across the ground.","translation":"麻痺させたクモを地面に引きずっているベッコウバチ（ベッコウバチ科）が観察されました。"}],"collocations":["spider wasp","wasp family","insect order"],"synonyms":["spider wasps"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name *Pompilus*, which is of uncertain origin, possibly related to the Greek word 'pompilos' referring to a pilot or guide, perhaps alluding to the wasp's ability to find and capture spiders. The suffix '-idae' is a standard taxonomic suffix indicating a family.","priority":"★★☆"},"pronunciation":{"ipa":"/pɒmˈpɪlɪdiː/","syllables":"Pom-pil-i-dae"},"inflection":{"noun_plural":"Pompilidae (科名のため、複数形は通常用いない)"},"usage_notes":{"explanation":"*Pompilidae* refers specifically to the scientific family name for spider wasps. When referring to a single wasp, it's more common to use 'spider wasp'. In scientific contexts, *Pompilidae* is used to denote the entire family and its characteristics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ A Pompilidae are hunting spiders.","correct":"✓ Pompilidae hunt spiders.","note":"*Pompilidae* は科全体を指すため、複数扱いとなります。ただし、単数のベッコウバチを指す場合は 'a spider wasp' を使用します。"},{"incorrect":"✗ Pompilidaes are dangerous.","correct":"✓ Pompilidae are not generally dangerous to humans.","note":"科名 *Pompilidae* の複数形は存在しません。"}],"priority":"★★☆"},"related_words":{"derivatives":["Pompilus (属名)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な生物学の文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pompilidae' is a scientific term referring to the family of spider wasps. It is primarily used in academic or scientific contexts when discussing the taxonomy, behavior, or ecology of these insects. Due to its specialized nature, it is not commonly encountered in general language use. Understanding this term requires familiarity with biological nomenclature and insect classification."},"example_sentences":[{"sentence":"Members of the Pompilidae family exhibit a fascinating hunting behavior.","translation":"ベッコウバチ科のメンバーは、魅力的な狩猟行動を示します。","type":"noun","meaning_category":"生物学"},{"sentence":"Researchers are studying the venom composition of various Pompilidae species.","translation":"研究者たちは、さまざまなベッコウバチ科の種の毒の組成を研究しています。","type":"noun","meaning_category":"生物学"}]}