{"word":"Tetrazole","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"テトラゾール：5員環の複素環式化合物で、4つの窒素原子と1つの炭素原子からなる。","english_definition":"A five-membered heterocyclic organic compound consisting of a 5-membered ring with four nitrogen atoms and one carbon atom.","examples":[{"sentence":"Tetrazole is a versatile building block in organic synthesis.","translation":"テトラゾールは有機合成における汎用性の高い構成要素です。"},{"sentence":"Substituted tetrazoles are used in pharmaceuticals and explosives.","translation":"置換テトラゾールは医薬品や爆薬に使用されています。"}],"collocations":["tetrazole derivative","substituted tetrazole","tetrazole synthesis"],"synonyms":["pentazole (unstable)"],"antonyms":[]},{"part_of_speech":"noun","definition":"テトラゾール基：テトラゾール環から誘導される官能基。","english_definition":"The tetrazole group, a functional group derived from the tetrazole ring.","examples":[{"sentence":"The tetrazole group can mimic the carboxylic acid group in some applications.","translation":"テトラゾール基は、いくつかの用途でカルボン酸基を模倣することができます。"}],"collocations":["tetrazole moiety","tetrazole ring"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name \"tetrazole\" is derived from the Greek \"tetra\" (four) referring to the four nitrogen atoms, and \"azole\", a suffix used for five-membered heterocyclic compounds containing at least one nitrogen atom.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɛtrəzoʊl/","syllables":"te-tra-zole"},"inflection":{"noun_plural":"tetrazoles"},"usage_notes":{"explanation":"Tetrazoles are important in medicinal chemistry as bioisosteres of carboxylic acids and amides. They are also used in energetic materials. Due to the high nitrogen content, some tetrazoles can be explosive.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ tetrazol","correct":"✓ tetrazole","note":"The correct spelling is 'tetrazole' not 'tetrazol'."}],"priority":"★☆☆"},"related_words":{"derivatives":["tetrazolium","aminotetrazole"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tetrazole' is a technical term in organic chemistry, referring to a specific type of heterocyclic compound. Understanding its properties and uses requires advanced knowledge in chemistry."},"example_sentences":[{"sentence":"The synthesis of tetrazole derivatives is an active area of research.","translation":"テトラゾール誘導体の合成は活発な研究分野です。","type":"noun","meaning_category":"chemical compound"},{"sentence":"The tetrazole ring provides enhanced stability compared to other nitrogen-rich heterocycles.","translation":"テトラゾール環は、他の窒素リッチな複素環式化合物と比較して、より高い安定性を提供します。","type":"noun","meaning_category":"chemical structure"}]}