{"word":"retreatist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(社会学) 逃避主義者、隠遁主義者：社会の目標や手段を拒否し、社会から孤立しようとする人。","english_definition":"(sociology) a person who rejects both the goals and the accepted means of achieving them in a society, and attempts to withdraw from society.","examples":[{"sentence":"The retreatist seeks escape from societal pressures through isolation.","translation":"逃避主義者は、孤立を通して社会的な圧力からの逃避を求める。"},{"sentence":"Some see hermits as retreatists, withdrawing from the world.","translation":"隠遁者を、世間から身を引く逃避主義者と見る人もいる。"}],"collocations":["social retreatist","cultural retreatist"],"synonyms":["hermit","recluse","isolationist","escapist"],"antonyms":["conformist","innovator","rebel","ritualist"]},{"part_of_speech":"adjective","definition":"逃避主義の、隠遁主義の：社会の目標や手段を拒否し、社会から孤立しようとする傾向がある。","english_definition":"relating to or characteristic of retreatism; tending to withdraw from society and reject its goals and means.","examples":[{"sentence":"Retreatist behavior is often a response to feelings of alienation.","translation":"逃避主義的な行動は、疎外感への反応であることが多い。"},{"sentence":"The retreatist subculture offered an alternative to mainstream values.","translation":"逃避主義的なサブカルチャーは、主流の価値観に対する代替案を提供した。"}],"collocations":["retreatist behavior","retreatist lifestyle","retreatist tendencies"],"synonyms":["escapist","isolationist","withdrawing"],"antonyms":["conformist","innovative","rebellious"]}],"etymology":{"value":"「retreat」 (後退する、引きこもる) + 「-ist」 (主義者) から派生。社会学者のロバート・K・マートンが、社会の目標と手段の両方を拒否する個人を指すために使用した。","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈtriːtɪst/","syllables":"re-treat-ist"},"inflection":{"noun_plural":"retreatists"},"usage_notes":{"explanation":"「**retreatist**」は、社会学の文脈でよく使われる専門用語です。ロバート・K・マートンのストレイン理論において、逸脱行動の一つの類型として定義されています。社会が是認する目標（成功、富など）と、それを達成するための手段（教育、労働など）の両方を拒否し、社会から身を引こうとする人々を指します。薬物中毒者やホームレスなどがその例として挙げられることがあります。ただし、単に内向的な性格や、宗教的な理由で隠遁生活を送る人を指すわけではありません。社会からの疎外感や、目標達成の手段がないと感じることが、retreatismの動機となります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a retreatist because he likes to stay home.","correct":"✓ He might be introverted, but that doesn't necessarily make him a retreatist. A retreatist actively rejects societal norms and withdraws.","note":"単に家にいるのが好きなだけでは、retreatistとは言えません。社会の規範を積極的に拒否し、社会から孤立しようとする場合にのみ、retreatistと呼べます。"},{"incorrect":"✗ Retreatist is a good way to live.","correct":"✓ Retreatism is a response to societal pressures, but its effectiveness is debatable.","note":"retreatistは、社会学的な分類であり、生き方に対する価値判断ではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":["retreatism (名詞: 逃避主義)","retreat (名詞/動詞: 後退、退却、隠居)"],"related_concepts":["strain theory","anomie","deviance"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (社会学の専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - 一般的な語彙ではない。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**retreatist**」は、社会学で使われる言葉で、社会が大切にしている目標や、それを達成する方法をどちらも受け入れず、社会から離れて暮らそうとする人を指します。例えば、社会での成功を求めず、仕事もしないで、ひっそりと暮らすような人です。これは、ロバート・K・マートンという学者が考えた「ストレイン理論」という考え方の一部です。日常会話ではあまり使いませんが、社会学の本や記事を読むときに出てくることがあります。"},"example_sentences":[{"sentence":"The sociologist studied the retreatist community living in the mountains.","translation":"社会学者は、山に住む逃避主義者のコミュニティを研究した。","type":"noun","meaning_category":"逃避主義者"},{"sentence":"His retreatist lifestyle was a reaction to the pressures of corporate life.","translation":"彼の逃避主義的なライフスタイルは、企業生活のプレッシャーへの反発だった。","type":"adjective","meaning_category":"逃避主義の"},{"sentence":"Drug addiction can sometimes be seen as a form of retreatism.","translation":"薬物中毒は、時に逃避主義の一形態と見なされることがある。","type":"noun","meaning_category":"逃避主義者"}]}