{"word":"Amphibolite","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"角閃岩（かくせんがん）：主に角閃石と斜長石からなる変成岩","english_definition":"A metamorphic rock consisting mainly of amphibole and plagioclase feldspar, with little or no quartz.","examples":[{"sentence":"The bedrock in this area is primarily amphibolite.","translation":"この地域の基盤岩は主に角閃岩である。"},{"sentence":"Amphibolite is often formed by the metamorphism of basalt or gabbro.","translation":"角閃岩はしばしば玄武岩や斑れい岩の変成作用によって形成される。"}],"collocations":["amphibolite facies (角閃岩相)","hornblende amphibolite (普通角閃石角閃岩)","garnet amphibolite (柘榴石角閃岩)"],"synonyms":["metabasalt (メタ玄武岩)","hornblende schist (角閃石片岩)"],"antonyms":[]}],"etymology":{"value":"「amphibole（角閃石）」と「-lite（岩）」を組み合わせた言葉。角閃石を主成分とする岩石であることを示す。","priority":"★★☆"},"pronunciation":{"ipa":"/æmˈfɪbəlaɪt/","syllables":"am-phi-bo-lite"},"inflection":{"noun_plural":"amphibolites"},"usage_notes":{"explanation":"Amphibolite is a metamorphic rock, meaning it is formed from other rocks that have been changed by heat and pressure. It is primarily composed of amphibole minerals (such as hornblende) and plagioclase feldspar. The absence or near-absence of quartz distinguishes it from other metamorphic rocks. Amphibolite can be used in construction, but its primary importance lies in its use for understanding the metamorphic history of a region.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Amphibolite is a type of igneous rock.","correct":"✓ Amphibolite is a type of metamorphic rock.","note":"Amphibolite is formed through metamorphism, not from magma or lava. Igneous rocks are formed from cooled magma or lava."},{"incorrect":"✗ Amphibolite always contains a large amount of quartz.","correct":"✓ Amphibolite contains little or no quartz.","note":"The defining characteristic of amphibolite is the dominance of amphibole and plagioclase, with very little or no quartz."}],"priority":"★★☆"},"related_words":{"derivatives":["amphibole (角閃石)","metamorphism (変成作用)","plagioclase (斜長石)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 地質学の専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Amphibolite**」は、主に角閃石と斜長石で構成される変成岩を指す地質学の専門用語です。これは、既存の岩石が熱と圧力によって変化して形成される岩石の一種です。この単語は、地質学や岩石学の文脈でのみ使用される可能性が高く、一般的な会話ではほとんど使用されません。地質学の研究や専門的な議論において、岩石の種類を正確に特定するために使用されます。"},"example_sentences":[{"sentence":"The geologists analyzed the amphibolite samples to determine the metamorphic conditions.","translation":"地質学者たちは、変成条件を特定するために角閃岩のサンプルを分析した。","type":"noun","meaning_category":"岩石学"},{"sentence":"The presence of amphibolite indicates a high-grade metamorphic environment.","translation":"角閃岩の存在は、高度な変成環境を示している。","type":"noun","meaning_category":"地質学"}]}