{"word":"tundra","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ツンドラ","english_definition":"a vast, flat, treeless Arctic region of Europe, Asia, and North America in which the subsoil is permanently frozen.","examples":[{"sentence":"The tundra is a harsh environment for most plants and animals.","translation":"ツンドラはほとんどの植物や動物にとって厳しい環境です。"},{"sentence":"Permafrost underlies much of the tundra.","translation":"永久凍土がツンドラの大部分の地下にあります。"},{"sentence":"The tundra is characterized by low-growing vegetation such as mosses and lichens.","translation":"ツンドラは、コケや地衣類のような背の低い植生によって特徴づけられます。"}],"collocations":["Arctic tundra","Alpine tundra","coastal tundra","permafrost tundra","tundra ecosystem","tundra vegetation","tundra climate"],"synonyms":["barren land","arctic plain","frozen plain","wilderness"],"antonyms":["forest","woodland","grassland"]}],"etymology":{"value":"The word \"tundra\" comes from the Kildin Sami word \"tūndâr\", meaning \"uplands\", \"treeless plain\".","priority":"★★★"},"pronunciation":{"ipa":"/ˈtʌndrə/","syllables":"tun-dra"},"inflection":{"noun_plural":"tundras"},"usage_notes":{"explanation":"Tundra refers specifically to a biome characterized by permafrost (permanently frozen subsoil), low temperatures, and a short growing season. It's typically found in high-latitude regions (Arctic tundra) or high-altitude regions (Alpine tundra). The term describes both the geographic area and the ecosystem found there.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The tundra is full of tall trees.","correct":"✓ The tundra is treeless or has only low-growing vegetation.","note":"Tundra is defined by the absence of trees due to the harsh climate and permafrost. While some dwarf shrubs may exist, tall trees are not a characteristic feature."},{"incorrect":"✗ Tundra is found only in Antarctica.","correct":"✓ Tundra is found in the Arctic regions of North America, Europe, and Asia, as well as in some high-altitude areas.","note":"While Antarctica has a tundra-like environment, the term \"tundra\" is more commonly associated with the Arctic and alpine regions."}],"priority":"★★☆"},"related_words":{"derivatives":["tundral (adjective: relating to tundra)"],"phrasal_verbs":[],"related_terms":["permafrost","biome","ecosystem","Arctic","Alpine","lichen","moss"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in geographical and environmental contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word \"tundra\" refers to a specific type of biome, a large naturally occurring community of flora and fauna occupying a major habitat. It's characterized by very cold temperatures, a short growing season, and permafrost. Because it's a specific geographical and ecological term, it's more common in scientific or environmental discussions than in everyday conversation. Understanding the concept of a biome is helpful for understanding the meaning of \"tundra.\""},"example_sentences":[{"sentence":"The changing climate is having a significant impact on the Arctic **tundra**.","translation":"気候変動は北極ツンドラに大きな影響を与えています。","type":"noun","meaning_category":"geography/environment"},{"sentence":"The **tundra** ecosystem supports a unique variety of plant and animal life.","translation":"ツンドラ生態系は、独特の多様な動植物を支えています。","type":"noun","meaning_category":"ecology"},{"sentence":"Oil exploration in the **tundra** regions poses a threat to the fragile environment.","translation":"ツンドラ地域での石油探査は、脆弱な環境への脅威となっています。","type":"noun","meaning_category":"environmental issues"}]}