{"word":"non-keratinized","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"非角化性の","english_definition":"Not keratinized; lacking keratin or not having undergone the process of keratinization.","examples":[{"sentence":"The lining of the esophagus is non-keratinized stratified squamous epithelium.","translation":"食道の裏層は非角化重層扁平上皮である。"},{"sentence":"Non-keratinized epithelium is found in moist areas of the body.","translation":"非角化上皮は体の湿った部分に見られる。"}],"collocations":["non-keratinized squamous epithelium","non-keratinized mucosa"],"synonyms":["unkeratinized"],"antonyms":["keratinized"]},{"part_of_speech":"adjective","definition":"（細胞または組織について）角質化されていない、ケラチン化されていない","english_definition":"(of cells or tissues) not having undergone keratinization, a process where cells accumulate keratin.","examples":[{"sentence":"The cells of the inner cheek are non-keratinized.","translation":"頬の内側の細胞は角質化されていない。"}],"collocations":[],"synonyms":["unkeratinized"],"antonyms":["keratinized"]}],"etymology":{"value":"Prefix 'non-' (not) + 'keratinized' (having undergone keratinization).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌnɒnˈkerətɪnaɪzd/","syllables":"non-ker-at-in-ized"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"'Non-keratinized' describes tissues or cells that do not contain keratin, a tough, fibrous protein. These tissues are typically found in moist environments where flexibility and permeability are required, such as the lining of the mouth, esophagus, and vagina. The opposite of 'non-keratinized' is 'keratinized', which describes tissues containing keratin, providing a tough, protective barrier, such as the skin's surface.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"The skin is non-keratinized.","correct":"The skin is keratinized.","note":"The outer layer of skin (epidermis) is keratinized, not non-keratinized."}],"priority":"☆☆☆"},"related_words":{"derivatives":["keratin","keratinize","keratinization"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Non-keratinized' is a technical term used in biology and medicine to describe tissues that do not contain keratin. It is typically used in the context of describing epithelial tissues, such as those found in the lining of the mouth or esophagus. Understanding this term requires a background in biology or medicine."},"example_sentences":[{"sentence":"The oral mucosa is composed of non-keratinized stratified squamous epithelium.","translation":"口腔粘膜は非角化重層扁平上皮で構成されている。","type":"scientific","meaning_category":"anatomy"},{"sentence":"Unlike skin, the esophageal lining is non-keratinized, allowing for greater flexibility.","translation":"皮膚とは異なり、食道の内層は非角化性であり、より高い柔軟性を可能にする。","type":"scientific","meaning_category":"anatomy"}]}