{"word":"multiprocessor","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"マルチプロセッサ、多重プロセッサ","english_definition":"A computer system with two or more central processing units (CPUs) that can execute instructions simultaneously.","examples":[{"sentence":"A server with a multiprocessor can handle a large number of requests at the same time.","translation":"マルチプロセッサを搭載したサーバーは、多数のリクエストを同時に処理できます。"},{"sentence":"Multiprocessor systems are commonly used in high-performance computing.","translation":"マルチプロセッサシステムは、高性能コンピューティングで一般的に使用されます。"},{"sentence":"The software is designed to take advantage of the multiprocessor architecture.","translation":"そのソフトウェアは、マルチプロセッサアーキテクチャを活用するように設計されています。"}],"collocations":["multiprocessor system","multiprocessor architecture","symmetric multiprocessor (SMP)","multiprocessor scheduling","multiprocessor synchronization"],"synonyms":["parallel processor","multi-core processor"],"antonyms":["uniprocessor","single-processor"],"related_terms":["CPU","core","parallel processing","concurrency","thread","process"]}],"etymology":{"value":"The term \"multiprocessor\" is formed by combining the prefix \"multi-\" (meaning many or multiple) with the word \"processor.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmʌltiˈprɑːsesər/","syllables":"mul-ti-pro-ces-sor"},"inflection":{"noun_plural":"multiprocessors"},"usage_notes":{"explanation":"A multiprocessor system contains multiple CPUs that can execute instructions concurrently, enabling parallel processing. This is different from a multi-core processor, where multiple cores reside on a single CPU chip. Multiprocessors are often used in servers, workstations, and high-performance computing environments to improve performance and throughput.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The computer has many processor.","correct":"✓ The computer has a multiprocessor. / ✓ The computer has multiple processors.","note":"'Multiprocessor' is a single word referring to a system with multiple processors. 'Many processor' is grammatically incorrect. Use 'multiple processors' if you want to emphasize the individual processors. "},{"incorrect":"✗ Multiprocessor is same as multi-core.","correct":"✓ Multiprocessors are different from multi-core processors, although the terms are sometimes used interchangeably.","note":"While both terms refer to systems with multiple processing units, a multiprocessor has multiple physical CPUs, while a multi-core processor has multiple cores on a single CPU."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_concepts":["parallel computing","distributed computing","cluster computing","high-performance computing (HPC)","symmetric multiprocessing (SMP)","massively parallel processing (MPP)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"multiprocessor\" is a technical term used in computer science and engineering. It refers to a computer system that has multiple central processing units (CPUs), allowing it to perform multiple tasks simultaneously. Understanding this term requires familiarity with computer architecture and parallel processing concepts. It is typically encountered in advanced computer science courses, technical documentation, and research papers.","priority":"★☆☆"},"example_sentences":[{"sentence":"The new server is equipped with a powerful multiprocessor to handle the increased workload.","translation":"新しいサーバーには、増加したワークロードを処理するために強力なマルチプロセッサが搭載されています。","type":"general"},{"sentence":"Multiprocessor scheduling algorithms are crucial for optimizing performance in parallel computing environments.","translation":"マルチプロセッサスケジューリングアルゴリズムは、並列コンピューティング環境でのパフォーマンスを最適化するために重要です。","type":"technical"},{"sentence":"The use of a multiprocessor significantly reduced the processing time for complex simulations.","translation":"マルチプロセッサの使用により、複雑なシミュレーションの処理時間が大幅に短縮されました。","type":"technical"}]}