{"word":"nonencroachment","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"不侵略、不可侵、非侵害","english_definition":"The principle or policy of not encroaching on or invading the territory, rights, or property of others.","examples":[{"sentence":"The treaty ensured nonencroachment of the border regions.","translation":"その条約は国境地域の不侵略を保証した。"},{"sentence":"We need a clear policy of nonencroachment on indigenous lands.","translation":"私たちは先住民の土地に対する明確な非侵害政策を必要としている。"},{"sentence":"The company promised nonencroachment on the privacy of its users.","translation":"その会社はユーザーのプライバシーの非侵害を約束した。"}],"collocations":["policy of nonencroachment (不侵略政策)","treaty of nonencroachment (不侵略条約)","principle of nonencroachment (不侵略の原則)","agreement of nonencroachment (不侵略協定)"],"synonyms":["nonaggression","noninterference","non-invasion","non-intrusion"],"antonyms":["encroachment","aggression","invasion","intrusion"]}],"etymology":{"value":"\"Non-\" (否定) + \"encroachment\" (侵入、侵害)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnɪnˈkroʊtʃmənt/","syllables":"non-en-croach-ment"},"inflection":{"noun_plural":"nonencroachments"},"usage_notes":{"explanation":"\"Nonencroachment\" is a formal term that refers to the avoidance of infringing upon the rights, territory, or property of others. It is often used in legal, political, and diplomatic contexts to describe agreements or policies aimed at preventing aggression or interference. The term emphasizes the proactive effort to respect boundaries and avoid crossing into areas that belong to others.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonencroachment was broken by the neighboring country.","correct":"✓ The nonencroachment agreement was broken by the neighboring country.","note":"\"Nonencroachment\" itself is a principle or policy. It's more accurate to say that a \"nonencroachment agreement\" or \"treaty\" was broken, rather than the abstract concept itself. "},{"incorrect":"✗ They ensured nonencroachment to the land.","correct":"✓ They ensured nonencroachment on the land.","note":"The correct preposition to use with \"nonencroachment\" when referring to territory or rights is \"on.\" So, it should be \"nonencroachment on the land/rights/property.\""}],"priority":"★★☆"},"related_words":{"derivatives":["encroach (verb: 侵入する、侵害する)","encroachment (noun: 侵入、侵害)"],"phrasal_verbs":[],"related_concepts":["sovereignty","territorial integrity","international law","diplomacy","self-determination"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈で使われることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Nonencroachment\" is a formal and somewhat rare word that means avoiding intrusion or infringement on someone else's territory, rights, or property. It's often used in legal or political contexts when discussing agreements or policies that aim to prevent one party from interfering with another. Understanding this word requires a good grasp of abstract concepts and formal language.","priority":"★★☆"},"example_sentences":[{"sentence":"The government is committed to a policy of nonencroachment on private property.","translation":"政府は私有財産に対する不侵略政策を約束している。","type":"general","meaning_category":"不侵略政策"},{"sentence":"The two nations signed a treaty of nonencroachment to maintain peace.","translation":"その二国は平和を維持するために不侵略条約に署名した。","type":"diplomatic","meaning_category":"不侵略条約"},{"sentence":"The company's code of ethics includes a commitment to nonencroachment on user privacy.","translation":"その会社の倫理規定には、ユーザーのプライバシーの非侵害へのコミットメントが含まれている。","type":"ethical","meaning_category":"プライバシーの非侵害"}]}