{"word":"encephalization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"脳化、脳化指数","english_definition":"The evolutionary increase in the size of the brain relative to body size. Also, a measure of relative brain size defined as the ratio between actual brain mass and predicted brain mass for an animal of a given size.","examples":[{"sentence":"Encephalization is a key trend in human evolution.","translation":"脳化は人類進化における重要な傾向です。"},{"sentence":"The encephalization quotient (EQ) is used to compare brain size across different species.","translation":"脳化指数（EQ）は、異なる種間での脳の大きさを比較するために使用されます。"}],"collocations":["encephalization quotient (EQ)","degree of encephalization","human encephalization","positive encephalization","relative encephalization"],"synonyms":["cerebralization","brain enlargement","brain evolution"],"antonyms":[]}],"etymology":{"value":"From 'encephalon' (Greek for 'brain') + '-ization' (process of becoming).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˌsɛfəlaɪˈzeɪʃən/","syllables":"en-ceph-a-li-za-tion"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Encephalization refers to both the process of brain enlargement during evolution and a specific measurement (encephalization quotient or EQ) used to compare brain sizes across species, taking body size into account. EQ is a more accurate measure of intelligence potential than absolute brain size.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["encephalon","encephalitic"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency. Primarily used in scientific contexts, especially in evolutionary biology and neuroscience.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Encephalization' is a technical term primarily used in the fields of evolutionary biology and neuroscience. It refers to the increase in brain size relative to body size during the course of evolution. The encephalization quotient (EQ) is a specific measurement used to compare the relative brain size of different species. Understanding this term requires a background in biology or related scientific disciplines."},"example_sentences":[{"sentence":"Increased encephalization in primates is associated with greater cognitive abilities.","translation":"霊長類における脳化の増大は、より高い認知能力と関連している。","type":"general","meaning_category":"evolutionary biology"},{"sentence":"The fossil record shows a clear trend of encephalization in the hominin lineage.","translation":"化石記録は、ヒト族の系統における脳化の明確な傾向を示している。","type":"paleontology","meaning_category":"evolutionary trend"},{"sentence":"The encephalization quotient is calculated by comparing the actual brain mass to the predicted brain mass for an animal of a given size.","translation":"脳化指数は、実際の脳質量を、特定のサイズの動物に対して予測される脳質量と比較することによって計算される。","type":"neuroscience","meaning_category":"measurement"}]}