{"word":"Carrnan","priority":"☆☆☆","meanings":[{"part_of_speech":"proper noun","definition":"A rare surname, likely of Scottish or Irish origin.","english_definition":"A surname, likely of Scottish or Irish origin. Its etymology is uncertain, but it may be a variant of surnames like Carnan or Curran.","examples":[{"sentence":"Mr. Carrnan is the new history teacher.","translation":"カーナン先生が新しい歴史の先生です。"},{"sentence":"I've never met anyone else with the last name Carrnan before.","translation":"カーナンという苗字の人に会ったことがありません。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The etymology of Carrnan is uncertain. It may be a variant of surnames such as Carnan or Curran. Curran is an Anglicized form of the Gaelic Ó Corráin, meaning 'descendant of Corrán'. Corrán is a personal name derived from corra, meaning 'spear'.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈkærnən/","syllables":"Car-nan"},"inflection":{},"usage_notes":{"explanation":"Carrnan is a relatively rare surname. Its origin is likely Scottish or Irish. Due to its rarity, there are no common usages or idioms associated with it.","priority":"★☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"related_surnames":["Carnan","Curran"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"Carrnan is a rare surname. Its meaning and origin are uncertain, but it is likely of Scottish or Irish origin. Because it is a proper noun and a surname, it is generally used in formal contexts or when referring to a specific individual or family. Due to its rarity, it is unlikely to be encountered frequently. "},"example_sentences":[{"sentence":"The Carrnan family has lived in this town for generations.","translation":"カーナン家はこの町に何世代も住んでいます。","type":"example","meaning_category":"Surname usage"},{"sentence":"Dr. Carrnan is a leading expert in her field.","translation":"カーナン博士は彼女の分野の第一人者です。","type":"example","meaning_category":"Surname usage"}]}