{"word":"vasculum","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"採集箱、植物採集箱","english_definition":"A portable container used by botanists for keeping gathered plants fresh.","examples":[{"sentence":"The botanist carefully placed the delicate flower into their vasculum.","translation":"植物学者は慎重に繊細な花を採集箱に入れた。"},{"sentence":"Old vasculums are sometimes seen as antique collectibles.","translation":"古い採集箱は時々アンティークの収集品として見られる。"}],"collocations":["carry a vasculum","antique vasculum","collecting vasculum"],"synonyms":["collecting box","plant press container"],"antonyms":[]}],"etymology":{"value":"From Latin 'vasculum', diminutive of 'vas' meaning 'vessel'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvæskjʊləm/","syllables":"vas-cu-lum"},"inflection":{"noun_plural":"vascula or vasculums"},"usage_notes":{"explanation":"A vasculum is a specialized container, primarily used in botany, to keep collected plant specimens fresh for transport and later study. While not in common usage outside of botanical contexts, it represents a specific tool in the field of plant science.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He stored water in his vasculum.","correct":"✓ He stored the plant specimens in his vasculum.","note":"Vasculums are for plant specimens, not generally for liquids."}],"priority":"★☆☆"},"related_words":{"derivatives":["vascular (adjective: relating to vessels, especially blood vessels)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'vasculum' is a specialized term primarily used in botany. It refers to a container used to keep collected plant specimens fresh. Due to its limited usage to a specific field, it is not commonly encountered in general English conversation or writing."},"example_sentences":[{"sentence":"The historical account described the botanist's use of a vasculum during the expedition.","translation":"その歴史的な記述は、探検中の植物学者の採集箱の使用について説明していた。","type":"noun","meaning_category":"採集箱"},{"sentence":"The museum displayed a collection of antique botanical tools, including a well-preserved vasculum.","translation":"博物館には、保存状態の良い採集箱を含む、アンティークの植物学ツールが展示されていた。","type":"noun","meaning_category":"採集箱"}]}