{"word":"Underdressing","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"軽装、普段着すぎること、場違いな服装をすること","english_definition":"The act of dressing too casually or informally for a particular occasion or event; wearing clothes that are not formal enough.","examples":[{"sentence":"Underdressing for a wedding can be disrespectful to the couple.","translation":"結婚式に軽装で行くことは、新郎新婦に対して失礼にあたる可能性があります。"},{"sentence":"He was criticized for underdressing at the formal gala.","translation":"彼はフォーマルなガラパーティーに軽装で参加したことで批判されました。"},{"sentence":"She worried about underdressing for the important business meeting.","translation":"彼女は重要なビジネス会議に軽装で行くことを心配していました。"}],"collocations":["avoid underdressing","risk underdressing","the consequences of underdressing"],"synonyms":["casual attire","informal wear","inappropriate clothing"],"antonyms":["overdressing","formal wear"]},{"part_of_speech":"verb","definition":"(人が)軽装をする、普段着すぎる、場違いな服装をする","english_definition":"To dress too casually or informally for a particular occasion or event.","examples":[{"sentence":"You might underdress if you wear jeans to a black-tie event.","translation":"もしあなたがブラックタイのイベントにジーンズを履いて行けば、軽装すぎるかもしれません。"},{"sentence":"He didn't want to underdress for his job interview.","translation":"彼は就職面接に軽装で行きたくありませんでした。"},{"sentence":"She made sure not to underdress when meeting her partner's parents for the first time.","translation":"彼女はパートナーの両親に初めて会うとき、軽装にならないように気をつけました。"}],"collocations":["underdress for an event","underdress for a meeting","underdress for a party"],"synonyms":["dress casually","dress informally","wear casual clothes"],"antonyms":["overdress","dress formally"]}],"etymology":{"value":"The word 'underdressing' is formed by combining the prefix 'under-' (meaning 'beneath' or 'insufficiently') with the word 'dressing' (referring to the act of putting on clothes). It literally means 'dressing insufficiently' or 'not dressing enough' for a particular situation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndərˈdrɛsɪŋ/","syllables":"un-der-dress-ing"},"inflection":{"noun_plural":"underdressings","verb_forms":{"present_simple":["underdress","underdresses"],"past_simple":"underdressed","past_participle":"underdressed","present_participle":"underdressing"}},"usage_notes":{"explanation":"'Underdressing' refers to the act of wearing clothes that are too casual or informal for a specific event or occasion. It implies a lack of formality or appropriateness in one's attire. The noun form refers to the state or act of being underdressed, while the verb form describes the action of dressing too casually.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was underdressed with jeans and a t-shirt.","correct":"✓ He was underdressed in jeans and a t-shirt.","note":"Use the preposition 'in' to describe what someone is wearing when they are underdressed."},{"incorrect":"✗ Underdressing is always bad.","correct":"✓ Underdressing can be inappropriate depending on the occasion.","note":"Whether underdressing is 'bad' depends on the context. It is not always inherently negative, but can be inappropriate in certain situations."}],"priority":"★★☆"},"related_words":{"derivatives":["underdressed (adjective: dressed too casually)"],"antonyms":["overdressing (noun: dressing too formally)","overdressed (adjective: dressed too formally)"],"related_terms":["dress code","attire","fashion","style","casual wear","formal wear"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Underdressing' means wearing clothes that are too casual or informal for a specific event or situation. It's the opposite of 'overdressing,' which means wearing clothes that are too formal. Understanding this word helps you choose appropriate clothing for different occasions, ensuring you are neither too casual nor too formal. It's important to consider the dress code and the expectations of the event you are attending.","priority":"★★☆"},"example_sentences":[{"sentence":"She realized she was underdressing when she saw everyone else in cocktail dresses.","translation":"彼女は他の人が皆カクテルドレスを着ているのを見て、自分が軽装すぎると気づいた。","type":"noun","meaning_category":"軽装"},{"sentence":"He didn't want to underdress for the important business meeting, so he wore a suit.","translation":"彼は重要なビジネス会議に軽装で行きたくなかったので、スーツを着た。","type":"verb","meaning_category":"軽装をする"},{"sentence":"The invitation stated 'business casual,' so underdressing would be wearing jeans and a t-shirt.","translation":"招待状には「ビジネスカジュアル」と記載されていたので、軽装とはジーンズとTシャツを着ることだろう。","type":"noun","meaning_category":"軽装"},{"sentence":"It's better to overdress than to underdress for a job interview.","translation":"就職面接には、軽装で行くよりも、きちんとした服装で行く方が良い。","type":"verb","meaning_category":"軽装をする"},{"sentence":"She felt uncomfortable because she was underdressed compared to the other guests.","translation":"彼女は他のゲストと比べて軽装だったので、居心地が悪かった。","type":"adjective","meaning_category":"軽装の"}]}