{"word":"vehicle-reliant","meanings":[{"part_of_speech":"adjective","definition":"車両依存の、車に頼っている、車社会の","english_definition":"Dependent on vehicles, especially cars, for transportation.","examples":[{"sentence":"The suburban sprawl has created a vehicle-reliant society.","translation":"郊外のスプロール化は、車両依存社会を生み出した。"},{"sentence":"Many rural areas are vehicle-reliant due to the lack of public transportation.","translation":"公共交通機関が不足しているため、多くの地方地域は車両依存である。"},{"sentence":"Reducing our carbon footprint requires moving away from a vehicle-reliant lifestyle.","translation":"二酸化炭素排出量を削減するには、車両依存のライフスタイルから脱却する必要がある。"}],"collocations":["vehicle-reliant society (車両依存社会)","vehicle-reliant infrastructure (車両依存のインフラ)","vehicle-reliant transportation (車両依存の交通)","become vehicle-reliant (車両依存になる)","less vehicle-reliant (車両依存度が低い)"],"synonyms":["car-dependent","auto-dependent","automobile-reliant"],"antonyms":["transit-oriented","pedestrian-friendly","bike-friendly","walkable"],"related_words":["vehicle (車両)","reliance (依存)","transportation (交通)","infrastructure (インフラ)","urban planning (都市計画)"],"level_frequency":{"estimated_frequency":"Uncommon","notes":"This term is used in discussions about urban planning, transportation, and environmental sustainability.","priority":"★☆☆"},"usage_notes":{"explanation":"The term \"vehicle-reliant\" describes situations where people heavily depend on personal vehicles, especially cars, for their daily transportation needs. This often results from factors such as suburban development, limited public transportation options, and infrastructure designed primarily for cars. It is often used in discussions about urban planning, environmental sustainability, and transportation policy.","priority":"★★☆"},"example_sentences":[{"sentence":"The city's layout makes it difficult to live without a car, creating a highly vehicle-reliant population.","translation":"その都市のレイアウトは、車なしでの生活を困難にし、高度な車両依存の住民を生み出している。","type":"general"},{"sentence":"Investing in public transportation can help reduce our reliance on vehicles and create a more sustainable transportation system.","translation":"公共交通機関への投資は、車両への依存を減らし、より持続可能な交通システムを構築するのに役立つ。","type":"solution"},{"sentence":"Vehicle-reliant communities often face challenges related to traffic congestion, air pollution, and limited accessibility for non-drivers.","translation":"車両依存のコミュニティは、交通渋滞、大気汚染、運転しない人のアクセス制限に関連する課題に直面することが多い。","type":"problem"}]}]}