{"word":"spandrils","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(建築)アーチとアーチ、またはアーチと長方形の枠の間の壁面。","english_definition":"(architecture) the roughly triangular space enclosed by the curves of adjacent arches and a horizontal member connecting their apexes; also, the space between one side of an arch and a straight line enclosing it.","examples":[{"sentence":"The spandrils above the arches were decorated with intricate carvings.","translation":"アーチの上のスパンドレルは、複雑な彫刻で装飾されていました。"},{"sentence":"The design incorporated spandrils filled with stained glass.","translation":"そのデザインは、ステンドグラスで満たされたスパンドレルを取り入れていました。"}],"collocations":["decorate spandrils","fill spandrils with","carved spandrils"],"synonyms":["panel","tympanum","surface"],"antonyms":[]},{"part_of_speech":"noun","definition":"(生物学)進化の副産物として生じた、特定の機能を持たない形質。","english_definition":"(biology) a phenotypic trait that is a byproduct of the evolution of some other characteristic, rather than a direct product of adaptive selection.","examples":[{"sentence":"Some argue that the human chin is a spandrel, serving no specific purpose.","translation":"人間の顎はスパンドレルであり、特定の目的を果たしていないと主張する人もいます。"},{"sentence":"The concept of spandrils is used to explain non-adaptive features in evolution.","translation":"スパンドレルの概念は、進化における非適応的な特徴を説明するために使用されます。"}],"collocations":["evolutionary spandrel","biological spandrel","non-adaptive spandrel"],"synonyms":["byproduct","side effect","non-adaptive trait"],"antonyms":[]}],"etymology":{"value":"The word 'spandrel' comes from the Old French word 'espandre', meaning 'to spread out'. This refers to the way the surface spreads out between arches or between an arch and a rectangular frame. The biological usage is a metaphorical extension of the architectural term, popularized by Stephen Jay Gould and Richard Lewontin in their 1979 paper 'The Spandrels of San Marco and the Panglossian Paradigm: A Critique of the Adaptationist Programme'.","priority":"★★☆"},"pronunciation":{"ipa":"ˈspændrəl/","syllables":"span-drel"},"inflection":{"noun_plural":"spandrils"},"usage_notes":{"explanation":"The term 'spandrel' has two main uses: one in architecture and one in evolutionary biology. In architecture, it refers to the space between arches or between an arch and a rectangular boundary. In evolutionary biology, it refers to features that arise as byproducts of other evolutionary changes, rather than through direct selection. The biological usage is a metaphorical extension of the architectural term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The spandrel was used for structural support.","correct":"✓ The spandrel was primarily decorative.","note":"Spandrils are often decorative rather than structural. While they do fill a space, their main purpose is usually aesthetic."},{"incorrect":"✗ Spandrels are always adaptive.","correct":"✓ Spandrils are non-adaptive by definition (in the biological sense).","note":"In biology, spandrils are defined as non-adaptive traits, meaning they did not arise through natural selection for a specific purpose."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["pendentive (建築)","adaptation (生物)","exaptation (生物)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'spandrel' is a technical term used in architecture and evolutionary biology. In architecture, it refers to the space between arches or between an arch and a rectangular frame. In evolutionary biology, it refers to a trait that arises as a byproduct of other evolutionary changes, rather than through direct selection. Understanding this word requires knowledge of these specific fields."},"example_sentences":[{"sentence":"The architect designed the building with elaborate spandrils.","translation":"建築家は凝ったスパンドレルを持つ建物を設計しました。","type":"noun","meaning_category":"architecture"},{"sentence":"The researchers discussed whether the trait was an adaptation or a spandrel.","translation":"研究者たちは、その形質が適応であるかスパンドレルであるかを議論しました。","type":"noun","meaning_category":"biology"}]}