{"word":"Absolutists","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"絶対主義者たち、絶対論者たち","english_definition":"Plural form of 'absolutist': Advocates or adherents of absolutism, which can refer to various doctrines, including absolute monarchy, ethical absolutism, or epistemological absolutism.","examples":[{"sentence":"The absolutists in the French court supported the king's divine right to rule.","translation":"フランス宮廷の絶対主義者たちは、王の統治権は神から与えられたものであると支持した。"},{"sentence":"Ethical absolutists believe that certain moral principles are universally binding, regardless of context.","translation":"倫理的絶対主義者たちは、特定の道徳原則は文脈に関わらず普遍的に拘束力を持つと信じている。"}],"collocations":["political absolutists (政治的絶対主義者)","ethical absolutists (倫理的絶対主義者)","religious absolutists (宗教的絶対主義者)"],"synonyms":["authoritarians","dogmatists","totalitarians","fundamentalists"],"antonyms":["relativists","pluralists","liberals","democrats"]}],"etymology":{"value":"Derived from 'absolutist,' which comes from 'absolute.' 'Absolute' originates from Latin 'absolutus,' the past participle of 'absolvere,' meaning 'to set free, acquit, complete.' The '-ist' suffix denotes a person who believes in or adheres to a particular doctrine or ideology.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈæbsəluːtɪsts/","syllables":"Ab-so-lu-tists"},"inflection":{"noun_plural":"Absolutists"},"usage_notes":{"explanation":"'Absolutists' refers to multiple individuals who subscribe to absolutism. The specific meaning of 'absolutism' depends on the context. In political philosophy, it often refers to absolute monarchy or authoritarianism. In ethics, it denotes the belief in absolute moral standards. In epistemology, it suggests that there are absolute truths that can be known. The term is often used critically to describe those who are perceived as inflexible or dogmatic in their beliefs.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The absolutist believed in democracy.","correct":"✓ The democrat believed in democracy.","note":"Absolutists typically do not support democracy, which emphasizes distributed power and popular sovereignty. The opposite is true."},{"incorrect":"✗ Absolutists are always open to compromise.","correct":"✓ Relativists are often open to compromise.","note":"Absolutists tend to hold firm to their principles and are less likely to compromise."}],"priority":"★★☆"},"related_words":{"derivatives":["absolutist (noun, adjective)","absolutism (noun)","absolute (adjective, noun)","absolutely (adverb)"],"antonyms":["relativist","pluralist"],"related_concepts":["authoritarianism","totalitarianism","ethical absolutism","moral relativism","epistemological absolutism"]},"level_frequency":{"frequency_google_ngram":"Relatively low frequency. More common in academic or philosophical discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Absolutists' is a term primarily used in academic, philosophical, or political contexts. It refers to individuals who adhere to the principles of absolutism, which can encompass various domains such as politics, ethics, or epistemology. Understanding the term requires familiarity with abstract concepts and nuanced distinctions between different philosophical viewpoints. The word is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"Many political theorists have criticized the actions of historical absolutists, citing their suppression of individual rights.","translation":"多くの政治理論家は、歴史的な絶対主義者たちの行動を批判し、彼らが個人の権利を抑圧したことを指摘している。","type":"noun","meaning_category":"political philosophy"},{"sentence":"Ethical absolutists argue that certain actions are inherently wrong, regardless of cultural context.","translation":"倫理的絶対主義者たちは、特定の行動は文化的背景に関わらず本質的に間違っていると主張する。","type":"noun","meaning_category":"ethics"},{"sentence":"The absolutists refused to consider any alternative viewpoints, clinging rigidly to their own beliefs.","translation":"その絶対主義者たちは、いかなる代替的な視点も考慮することを拒否し、自身の信念に固執した。","type":"noun","meaning_category":"general belief"}]}