{"word":"parthenogenesis","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"単為生殖（たんいせいしょく）","english_definition":"A form of asexual reproduction in which an egg can develop into an embryo without being fertilized by a sperm.","examples":[{"sentence":"Parthenogenesis is observed in some insects, fish, and reptiles.","translation":"単為生殖は、一部の昆虫、魚、爬虫類に見られる。"},{"sentence":"Some species can reproduce both sexually and through parthenogenesis.","translation":"一部の種は、有性生殖と単為生殖の両方で繁殖できる。"}],"collocations":["artificial parthenogenesis (人為的単為生殖)","obligate parthenogenesis (絶対単為生殖)","facultative parthenogenesis (条件的単為生殖)"],"synonyms":["asexual reproduction"],"antonyms":["sexual reproduction"]}],"etymology":{"value":"ギリシャ語の 'parthenos' (処女) + 'genesis' (起源、誕生) に由来する。つまり、「処女からの誕生」という意味。","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɑːrθɪnəˈdʒɛnɪsɪs/","syllables":"par-the-no-gen-e-sis"},"inflection":{"noun_plural":"parthenogeneses"},"usage_notes":{"explanation":"Parthenogenesis is a natural form of reproduction in which growth and development of embryos occur without fertilization. It occurs naturally in some plant and animal species, including invertebrates (e.g., water fleas, aphids, bees, some ants and parasitic wasps), vertebrates (e.g., some fish, reptiles, and very rarely birds). It can also be induced artificially in some species.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Parthenogenesis is a type of sexual reproduction.","correct":"✓ Parthenogenesis is a type of asexual reproduction.","note":"Parthenogenesis is a form of asexual reproduction, not sexual reproduction."}],"priority":"★★☆"},"related_words":{"derivatives":["parthenogenetic (形容詞: 単為生殖の)"],"priority":"★★☆"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Parthenogenesis is a biological term referring to a type of reproduction where an egg develops into an embryo without fertilization by sperm. It's observed in certain plants and animals. The term itself is derived from Greek roots, meaning 'virgin birth.' This process can be natural or artificially induced. Understanding this term requires a background in biology or related scientific fields."},"example_sentences":[{"sentence":"The whiptail lizard reproduces through parthenogenesis.","translation":"ムチオトカゲは単為生殖によって繁殖する。","type":"example","meaning_category":"biological reproduction"},{"sentence":"Scientists are studying the mechanisms of parthenogenesis in various species.","translation":"科学者たちは様々な種における単為生殖のメカニズムを研究している。","type":"example","meaning_category":"scientific study"}]}