{"word":"cyrtograph","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"（特に、大きな地図を作るために）曲面を平面に変換するのに用いられる製図器","english_definition":"A drawing instrument used to transfer the curvature of a surface to a plane, especially for making large maps.","examples":[{"sentence":"The cartographer used a cyrtograph to accurately depict the Earth's surface on a flat map.","translation":"その地図製作者は、地球の表面を平面地図上に正確に描写するために、キルトグラフを使用した。"}],"collocations":["use a cyrtograph","design a cyrtograph","calibrate a cyrtograph"],"synonyms":["map projection instrument","cartographic tool"],"antonyms":[]}],"etymology":{"value":"The word \"cyrtograph\" comes from the Greek words \"kyrtos\" (κυρτός), meaning curved, and \"graphō\" (γράφω), meaning to write or draw.","priority":"★★★"},"pronunciation":{"ipa":"ˈsɜːrtəˌɡræf","syllables":"cyr-to-graph"},"inflection":{"noun_plural":"cyrtographs"},"usage_notes":{"explanation":"A cyrtograph is a specialized tool used in cartography to address the challenge of representing a curved surface (like the Earth) on a flat plane (like a map). It is designed to minimize distortion when transferring geographical features from a globe to a map. This term is not commonly used in everyday language, but is relevant in fields such as geography, cartography, and surveying.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a cyrtograph to write my name.","correct":"✓ I used a pen to write my name.","note":"A cyrtograph is a mapping tool, not a writing instrument. Use a pen or pencil for writing."}],"priority":"★☆☆"},"related_words":{"derivatives":["cartography","cartographer","graph"],"related_terms":["map projection","geodesy","surveying"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term \"cyrtograph\" refers to a specialized instrument used in cartography for transferring curved surfaces onto a plane, particularly in mapmaking. It is a technical term not commonly encountered outside of specialized fields such as geography and surveying. Understanding its function requires familiarity with the challenges of map projection and the principles of geodesy."},"example_sentences":[{"sentence":"The historical cyrtograph in the museum demonstrated the evolution of mapmaking techniques.","translation":"博物館にある歴史的なキルトグラフは、地図製作技術の進化を示していた。","type":"noun","meaning_category":"製図器"},{"sentence":"Engineers designed an advanced cyrtograph to improve the accuracy of topographical maps.","translation":"エンジニアは、地形図の精度を向上させるために、高度なキルトグラフを設計した。","type":"noun","meaning_category":"製図器"}]}