{"word":"overtide","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"高潮、高潮位","english_definition":"A higher than normal high tide.","examples":[{"sentence":"The overtide caused flooding in the coastal areas.","translation":"高潮が沿岸地域で洪水を引き起こした。"},{"sentence":"Coastal communities are vulnerable to damage from overtides.","translation":"沿岸地域社会は高潮による被害を受けやすい。"}],"collocations":["cause overtide","overtide damage","overtide flooding"],"synonyms":["high water","storm surge","tidal surge"],"antonyms":["undertide","low tide"]},{"part_of_speech":"noun","definition":"高潮時に発生する強い潮流","english_definition":"A strong tidal current occurring during a higher than normal high tide.","examples":[{"sentence":"The overtide created dangerous conditions for ships entering the harbor.","translation":"高潮は港に入る船にとって危険な状況を作り出した。"},{"sentence":"Navigation can be difficult due to the strong currents of the overtide.","translation":"高潮の強い潮流のため、航行が困難になることがある。"}],"collocations":["strong overtide","overtide current","overtide navigation"],"synonyms":["tidal bore","strong current","tidal flow"],"antonyms":["slack water"]}],"etymology":{"value":"'Over-' (above, beyond) + 'tide' (the periodic rise and fall of the sea).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈoʊvərtaɪd/","syllables":"o-ver-tide"},"inflection":{"noun_plural":"overtides"},"usage_notes":{"explanation":"'Overtide' refers to a high tide that is higher than the usual high tide, often caused by meteorological conditions such as storms. It can also refer to the strong currents associated with such tides. It's a term primarily used in coastal and maritime contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The overtide was low today.","correct":"✓ The tide was low today.","note":"'Overtide' specifically refers to a higher-than-normal high tide, not a low tide. Use 'low tide' to describe a low water level."},{"incorrect":"✗ The overtide is caused by the sun.","correct":"✓ The overtide can be influenced by the sun and moon but is primarily caused by weather conditions.","note":"While the sun and moon influence tides, overtides are mainly caused by weather events like storms and strong winds."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["tide","high tide","low tide","storm surge","tidal surge","undertow"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Overtide' is a specialized term used in coastal and maritime contexts to describe a higher-than-normal high tide, often caused by storms or other weather conditions. It can also refer to the strong currents associated with these tides. Understanding this term requires familiarity with basic tidal concepts and meteorological influences on coastal waters."},"example_sentences":[{"sentence":"The coastal town prepared for potential flooding as the overtide approached.","translation":"沿岸の町は高潮が近づくにつれて、起こりうる洪水に備えた。","type":"noun","meaning_category":"高潮"},{"sentence":"The strong overtide made navigation through the channel extremely hazardous.","translation":"強い高潮は水路の航行を極めて危険にした。","type":"noun","meaning_category":"高潮時に発生する強い潮流"}]}