{"word":"Erotylidae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"オサムシダマシ科","english_definition":"A family of beetles, commonly known as the pleasing fungus beetles. They are found worldwide and feed on fungi.","examples":[{"sentence":"The Erotylidae family includes many colorful and patterned species.","translation":"オサムシダマシ科には、色彩豊かで模様のある種が多く含まれています。"}],"collocations":["pleasing fungus beetles","fungus feeders"],"synonyms":["pleasing fungus beetles"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'eros' (love, beauty) and 'tylos' (knot, swelling), referring to the often colorful and rounded appearance of these beetles.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛroʊˈtɪlɪdiː/","syllables":"E-ro-ty-li-dae"},"inflection":{"noun_plural":"Erotylids or Erotylidae"},"usage_notes":{"explanation":"Erotylidae is a taxonomic term used in entomology. It refers to a specific family within the order Coleoptera (beetles). When discussing individual beetles, it's more common to use the term 'pleasing fungus beetle' or refer to specific genera or species within the family.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw an Erotylidae on my rose bush.","correct":"✓ I saw an Erotylid on the fungus growing on the tree.","note":"Erotylidae beetles primarily feed on fungi, not rose bushes."}],"priority":"★☆☆"},"related_words":{"derivatives":["Erotylid (singular form of the noun)"],"phrasal_verbs":[],"genera":["Triplax","Dacne","Megalodacne","Ischyrus"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な生物学用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Erotylidae' is a scientific term used by entomologists and those studying beetles. It refers to a specific family of beetles known for feeding on fungi. Understanding this term requires knowledge of biological classification and entomology. It is unlikely to be encountered in general conversation or everyday reading material.","priority":"★☆☆"},"example_sentences":[{"sentence":"Researchers are studying the diversity of Erotylidae in tropical rainforests.","translation":"研究者たちは熱帯雨林におけるオサムシダマシ科の多様性を研究している。","type":"noun","meaning_category":"オサムシダマシ科"},{"sentence":"Many Erotylidae species exhibit bright colors and patterns.","translation":"多くのオサムシダマシ科の種は、鮮やかな色彩と模様を示す。","type":"noun","meaning_category":"オサムシダマシ科"}]}