{"word":"hyposensitizing","priority":"★☆☆","meanings":[{"part_of_speech":"verb (gerund or present participle)","definition":"(アレルギーなどを)減感作する、脱感作する","english_definition":"reducing sensitivity to an allergen by repeated exposure to small doses of it.","examples":[{"sentence":"Hyposensitizing is a treatment for allergies that involves gradually exposing the patient to increasing amounts of the allergen.","translation":"減感作療法は、患者をアレルゲンに徐々に増加する量で暴露するアレルギーの治療法です。"},{"sentence":"Hyposensitizing can be effective in reducing the severity of allergic reactions.","translation":"減感作療法は、アレルギー反応の重症度を軽減するのに効果的です。"}],"collocations":["hyposensitizing injections","hyposensitizing therapy","undergoing hyposensitizing"],"synonyms":["desensitizing","immunotherapy","allergy shots"],"antonyms":["sensitizing"]}],"etymology":{"value":"The word 'hyposensitizing' is formed from 'hypo-' (meaning 'under' or 'less than normal'), 'sensitizing' (making sensitive), and '-ing' (indicating a process or action).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpoʊˈsɛnsɪtaɪzɪŋ/","syllables":"hy-po-sen-si-tiz-ing"},"inflection":{"verb_forms":{"present_simple":["hyposensitizes"],"past_simple":"hyposensitized","past_participle":"hyposensitized","present_participle":"hyposensitizing"}},"usage_notes":{"explanation":"'Hyposensitizing' refers to the process of reducing a person's sensitivity to an allergen. It is commonly used in the context of allergy treatments, where a patient is given small, gradually increasing doses of the allergen to build tolerance and reduce allergic reactions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm hyposensitizing to pollen by avoiding it completely.","correct":"✓ I'm hyposensitizing to pollen through allergy shots.","note":"Hyposensitizing involves controlled exposure to the allergen, not complete avoidance."},{"incorrect":"✗ Hyposensitizing is a quick cure for allergies.","correct":"✓ Hyposensitizing is a long-term treatment for allergies.","note":"Hyposensitizing is a gradual process that takes time to build tolerance."}],"priority":"★★☆"},"related_words":{"derivatives":["hyposensitize","hyposensitization","desensitize","desensitization"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hyposensitizing' is a specialized term primarily used in medical contexts, specifically in allergy treatment. It refers to the process of gradually reducing a person's sensitivity to an allergen by administering small, controlled doses of the substance. This term is more likely to be encountered in medical literature or discussions about allergy management. Understanding this term requires knowledge of medical terminology and allergy-related concepts."},"example_sentences":[{"sentence":"The doctor recommended hyposensitizing injections to treat my grass allergy.","translation":"医師は私のイネ科植物アレルギーを治療するために減感作注射を勧めました。","type":"verb (gerund)","meaning_category":"減感作する"},{"sentence":"Hyposensitizing is a process that can take several years to complete.","translation":"減感作療法は完了するまでに数年かかることがあります。","type":"verb (gerund)","meaning_category":"減感作する"},{"sentence":"She is currently hyposensitizing to dust mites.","translation":"彼女は現在、ダニに対して減感作療法を受けています。","type":"verb (present participle)","meaning_category":"減感作する"}]}