{"word":"hagging","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"現在分詞または動名詞としての\"hag\"","english_definition":"Present participle or gerund of \"hag\". See the definition of \"hag\" for more information.","examples":[{"sentence":"She was hagging him mercilessly about his weight.","translation":"彼女は彼の体重について容赦なく彼をいじめていた。"},{"sentence":"Stop the hagging! It's not funny anymore.","translation":"いじめはやめて！もう面白くないよ。"}],"collocations":["hagging someone about something"],"synonyms":["teasing","badgering","nagging","bullying"],"antonyms":["complimenting","praising"]},{"part_of_speech":"noun","definition":"いじめ、嫌がらせ","english_definition":"The act of teasing or bullying someone persistently.","examples":[{"sentence":"The hagging at school was making his life miserable.","translation":"学校でのいじめが彼の生活を惨めなものにしていた。"}],"collocations":["stop the hagging"],"synonyms":["teasing","bullying","harassment"],"antonyms":["support","encouragement"]}],"etymology":{"value":"Derived from the verb \"hag\", which itself is of uncertain origin, possibly related to \"hack\" or other words suggesting cutting or tearing, metaphorically applied to relentless criticism or torment.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhæɡɪŋ/","syllables":"hag-ging"},"inflection":{"verb_forms":{"present_simple":["hag","hags"],"past_simple":"hagged","past_participle":"hagged","present_participle":"hagging"}},"usage_notes":{"explanation":"\"Hagging\" is the present participle and gerund form of the verb \"hag\". The verb \"hag\" means to harass, tease, or torment someone persistently. The noun form refers to the act of harassing or teasing. It's a relatively uncommon word, often used in informal contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She was hagging with the shopkeeper over the price.","correct":"✓ She was haggling with the shopkeeper over the price.","note":"\"Hagging\" (teasing) is different from \"haggling\" (bargaining)."},{"incorrect":"✗ The old woman was hagging around the house.","correct":"✓ The old woman was hobbling around the house.","note":"\"Hagging\" (teasing) is different from \"hobbling\" (walking with difficulty)."}],"priority":"★★☆"},"related_words":{"derivatives":["hag (noun: an ugly old woman; a witch; a tormenting person)","hagged (adjective: looking exhausted and unwell)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"\"Hagging\" is an uncommon word meaning to persistently tease, harass, or torment someone. It is the present participle of the verb \"hag\". The noun form refers to the act of teasing or bullying. It is important to distinguish it from similar-sounding words like \"haggling\" (bargaining) and \"hobbling\" (walking with difficulty). The word carries a negative connotation, suggesting relentless and unpleasant behavior."},"example_sentences":[{"sentence":"The older boys were always hagging the younger ones.","translation":"年上の男の子たちはいつも年下の子たちをいじめていた。","type":"verb","meaning_category":"Teasing/Harassing"},{"sentence":"The constant hagging from his boss made him want to quit.","translation":"上司からの絶え間ない嫌がらせが彼を辞めさせたくなった。","type":"noun","meaning_category":"Harassment"}]}