{"word":"epinephrine","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"エピネフリン、アドレナリン","english_definition":"a hormone secreted by the adrenal medulla upon stimulation by the central nervous system, that increases blood pressure, heart rate, and blood sugar levels and prepares the body for fight or flight; also used as a medication to treat severe allergic reactions (anaphylaxis).","examples":[{"sentence":"Epinephrine is released during times of stress.","translation":"エピネフリンはストレス時に放出される。"},{"sentence":"The doctor administered epinephrine to counteract the allergic reaction.","translation":"医師はアレルギー反応を打ち消すためにエピネフリンを投与した。"},{"sentence":"An EpiPen delivers a measured dose of epinephrine.","translation":"エピペンは一定量のエピネフリンを投与する。"}],"collocations":["administer epinephrine (エピネフリンを投与する)","inject epinephrine (エピネフリンを注射する)","epinephrine auto-injector (エピネフリン自己注射器)","epinephrine pen (エピネフリンペン)","epinephrine dose (エピネフリンの投与量)","epinephrine level (エピネフリンのレベル)"],"synonyms":["adrenaline"],"antonyms":["None (antagonists exist, but not direct antonyms)"]},{"part_of_speech":"noun","definition":"(薬理学)血管収縮薬、気管支拡張薬としてのエピネフリン","english_definition":"a synthetic form of this hormone used as a drug to treat various conditions, including asthma, cardiac arrest, and anaphylaxis.","examples":[{"sentence":"Epinephrine is a common treatment for anaphylactic shock.","translation":"エピネフリンはアナフィラキシーショックの一般的な治療法である。"},{"sentence":"The paramedics used epinephrine to restart his heart.","translation":"救急隊員はエピネフリンを使って彼の心臓を再始動させた。"},{"sentence":"Epinephrine can help open up the airways during an asthma attack.","translation":"エピネフリンは喘息発作時に気道を広げるのに役立つ。"}],"collocations":["epinephrine injection (エピネフリン注射)","epinephrine solution (エピネフリン溶液)","epinephrine side effects (エピネフリンの副作用)","epinephrine use (エピネフリンの使用)","epinephrine effects (エピネフリンの効果)"],"synonyms":["adrenaline"],"antonyms":["None (antagonists exist, but not direct antonyms)"]}],"etymology":{"value":"Derived from 'epi-' (upon, above), 'nephros' (kidney) and '-ine' (chemical suffix). Literally, 'upon the kidney', referring to the adrenal glands located above the kidneys.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛpɪˈnɛfrɪn/","syllables":"e-pi-neph-rine"},"inflection":{"noun_plural":"epinephrine (usually used as a non-count noun)"},"usage_notes":{"explanation":"'Epinephrine' and 'adrenaline' are often used interchangeably, but 'epinephrine' is the preferred term in scientific and medical contexts. 'Adrenaline' is more commonly used in general conversation. Epinephrine is crucial in emergency situations, particularly for treating anaphylaxis.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to take epinephrine every day for my allergies.","correct":"✓ I only need to use epinephrine during a severe allergic reaction.","note":"Epinephrine is not a daily medication; it's used for emergency treatment of severe allergic reactions."},{"incorrect":"✗ Epinephrine is the same as an antihistamine.","correct":"✓ Epinephrine is different from an antihistamine; it's used for more severe reactions.","note":"Epinephrine is a more potent medication used for severe allergic reactions, while antihistamines are used for milder symptoms."}],"priority":"★★☆"},"related_words":{"derivatives":["norepinephrine (ノルエピネフリン)","adrenergic (アドレナリン作動性の)","EpiPen (エピペン)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in medical and scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Epinephrine' is a technical term primarily used in medical and scientific contexts to refer to a hormone that increases heart rate, blood pressure, and blood sugar levels. It is also used as a medication, most notably in EpiPens for treating severe allergic reactions (anaphylaxis). Understanding its function is important in medical fields, but it is not a word commonly used in everyday conversation. It's crucial to know that epinephrine is not a daily medication but an emergency treatment.","priority":"★★☆"},"example_sentences":[{"sentence":"The patient's blood pressure increased after the epinephrine injection.","translation":"エピネフリン注射後、患者の血圧が上昇した。","type":"noun","meaning_category":"Physiological effect"},{"sentence":"The EpiPen contains a pre-measured dose of epinephrine.","translation":"エピペンにはあらかじめ測定された量のエピネフリンが含まれている。","type":"noun","meaning_category":"Medication"},{"sentence":"Epinephrine is crucial in the treatment of anaphylaxis.","translation":"エピネフリンはアナフィラキシーの治療に不可欠である。","type":"noun","meaning_category":"Medical treatment"},{"sentence":"The body releases epinephrine in response to stress.","translation":"体はストレスに反応してエピネフリンを放出する。","type":"noun","meaning_category":"Hormone"}]}