{"word":"magnetostriction","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"磁歪（じわい）: 強磁性体の磁化に伴う寸法の変化","english_definition":"The property of ferromagnetic materials that causes them to change their shape or dimensions during the process of magnetization.","examples":[{"sentence":"Magnetostriction is used in ultrasonic transducers.","translation":"磁歪は超音波トランスデューサに使用されます。"},{"sentence":"The magnetostriction effect can cause unwanted vibrations in electrical equipment.","translation":"磁歪効果は、電気機器に不要な振動を引き起こす可能性があります。"}],"collocations":["exhibit magnetostriction","use magnetostriction","magnetostriction effect","giant magnetostriction"],"synonyms":["Joule effect (related, but specifically for length changes)"],"antonyms":[],"notes":"Magnetostriction is a material property, not a process. It is an intrinsic property of certain materials. The effect can be positive (elongation) or negative (contraction) depending on the material and the direction of the applied magnetic field."}],"etymology":{"value":"Derived from 'magneto-' (referring to magnetism) and 'striction' (referring to constriction or change in dimension).","priority":"★★★"},"pronunciation":{"ipa":"/mæɡˌniːtoʊstrɪkʃən/","syllables":"mag-ne-to-stric-tion"},"inflection":{"noun_plural":"magnetostrictions"},"usage_notes":{"explanation":"Magnetostriction is a phenomenon where a ferromagnetic material changes its shape or dimensions when subjected to a magnetic field. This effect is used in various applications, including sensors, actuators, and transducers. The magnitude and direction of the dimensional change depend on the material's properties and the strength and orientation of the applied magnetic field. Giant magnetostriction refers to materials exhibiting exceptionally large dimensional changes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Magnetostriction is when a material becomes magnetic.","correct":"✓ Magnetostriction is when a material changes shape in response to a magnetic field.","note":"Magnetostriction is about dimensional change, not becoming magnetic."},{"incorrect":"✗ All materials exhibit magnetostriction.","correct":"✓ Only ferromagnetic materials exhibit magnetostriction.","note":"Magnetostriction is specific to ferromagnetic materials."}],"priority":"★★★"},"related_words":{"derivatives":["magnetostrictive (adjective)"],"related_terms":["ferromagnetism","magnetic field","transducer","actuator","sensor"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in scientific and engineering contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Magnetostriction' is a technical term used in physics and engineering to describe the change in shape or size of a ferromagnetic material when it is exposed to a magnetic field. It's important to understand that this effect is specific to certain materials and is used in devices like sensors and actuators. The amount of change depends on the material and the strength of the magnetic field. This term is not commonly used in everyday conversation, but it's important in specific scientific and engineering fields."},"example_sentences":[{"sentence":"The ultrasonic transducer utilizes the principle of magnetostriction.","translation":"その超音波トランスデューサは磁歪の原理を利用している。","type":"scientific","meaning_category":"application"},{"sentence":"The researchers are investigating new materials with enhanced magnetostriction properties.","translation":"研究者たちは、強化された磁歪特性を持つ新しい材料を調査している。","type":"research","meaning_category":"material science"}]}