{"word":"decerebrate","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"除脳する","english_definition":"to remove the cerebrum of (an animal), typically to study the functions of the remaining parts of the brain.","examples":[{"sentence":"The researchers decerebrated the rats to study their brainstem reflexes.","translation":"研究者たちは脳幹反射を研究するためにラットを除脳した。"}],"collocations":["decerebrate an animal","perform decerebration"],"synonyms":["encephale","excerebrate"],"antonyms":[]},{"part_of_speech":"adjective","definition":"除脳された","english_definition":"having had the cerebrum removed.","examples":[{"sentence":"The decerebrate animal exhibited signs of decerebrate rigidity.","translation":"除脳された動物は除脳硬直の兆候を示した。"}],"collocations":["decerebrate animal","decerebrate preparation"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Latin de- (removal) + cerebrum (brain).","priority":"★★☆"},"pronunciation":{"ipa":"/diːˈsɛrəˌbreɪt/","syllables":"de-cer-e-brate"},"inflection":{"verb_forms":{"present_simple":["decerebrate","decerebrates"],"past_simple":"decerebrated","past_participle":"decerebrated","present_participle":"decerebrating"}},"usage_notes":{"explanation":"'Decerebrate' is a technical term primarily used in the context of neuroscience and experimental biology. It refers to the surgical removal or functional disconnection of the cerebral hemispheres of the brain. The procedure is often performed on animals to study the functions of the brainstem and other subcortical structures. The adjective 'decerebrate' describes an animal or preparation that has undergone this procedure. In clinical settings, 'decerebrate rigidity' refers to a specific type of abnormal posturing seen in patients with severe brain injury.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient was decerebrated after the accident.","correct":"✓ The patient exhibited decerebrate posturing after the accident.","note":"'Decerebrate' as a verb refers to the surgical procedure. In clinical contexts, it's more accurate to describe the patient as exhibiting 'decerebrate posturing' or 'decerebrate rigidity' if they display the characteristic abnormal posture."}],"priority":"★☆☆"},"related_words":{"derivatives":["decerebration (noun)","decerebrate rigidity (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'decerebrate' is highly specialized and primarily encountered in scientific or medical contexts. It describes the process of removing the cerebrum (the main part of the brain) or the state of being without a cerebrum. This term is not commonly used in everyday language and requires a strong understanding of neuroanatomy to comprehend fully.","priority":"★☆☆"},"example_sentences":[{"sentence":"The neurosurgeon decided to decerebrate the animal for experimental purposes.","translation":"脳神経外科医は実験目的でその動物を除脳することに決めた。","type":"verb","meaning_category":"除脳する"},{"sentence":"The decerebrate posture observed in the patient indicated severe brain damage.","translation":"患者に見られた除脳姿勢は重度の脳損傷を示していた。","type":"adjective","meaning_category":"除脳された"}]}