{"word":"Empiriocritical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"経験批判論の、経験批判主義の","english_definition":"Relating to empiriocriticism, a philosophical theory that asserts that experience is the only source of knowledge.","examples":[{"sentence":"The empiriocritical approach emphasizes the importance of sensory experience.","translation":"経験批判論的なアプローチは、感覚経験の重要性を強調する。"},{"sentence":"He was a proponent of empiriocritical philosophy.","translation":"彼は経験批判論の哲学の支持者だった。"}],"collocations":["empiriocritical philosophy","empiriocritical approach","empiriocritical theory"],"synonyms":["positivist","empiricist","phenomenalist"],"antonyms":["metaphysical","speculative"]}],"etymology":{"value":"Formed from 'empirio-' (referring to experience) + 'critical' (referring to critical analysis) + '-al'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪmˌpɪrioʊˈkrɪtɪkəl/","syllables":"im-pi-ri-o-crit-i-cal"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Empiriocritical' is primarily used in philosophical contexts to describe ideas, theories, or approaches that align with empiriocriticism. It is not a commonly used word outside of academic discussions of philosophy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has an empiriocritical view on the weather.","correct":"✓ He has an empirical view on the weather.","note":"'Empiriocritical' is a specific philosophical term, while 'empirical' is a more general term referring to observation and experience."}],"priority":"★☆☆"},"related_words":{"derivatives":["empiriocriticism (noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Empiriocritical' is a highly specialized term used within the field of philosophy. Understanding requires familiarity with the philosophical movement of empiriocriticism, which posits that knowledge is derived solely from experience and critical analysis thereof. The term is rarely encountered outside of advanced philosophical discussions."},"example_sentences":[{"sentence":"The book offers an empiriocritical analysis of scientific methodology.","translation":"その本は科学的方法論の経験批判論的な分析を提供する。","type":"adjective","meaning_category":"Relating to empiriocriticism"},{"sentence":"His empiriocritical stance led him to reject metaphysical explanations.","translation":"彼の経験批判論的な立場は、彼に形而上学的な説明を拒否させた。","type":"adjective","meaning_category":"Relating to empiriocriticism"}]}