{"word":"donor-supported","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"寄付者によって支援されている、寄付によって運営されている","english_definition":"maintained or sustained by donations from individuals or organizations.","examples":[{"sentence":"The radio station is donor-supported, so it relies on listener contributions.","translation":"そのラジオ局は寄付によって運営されているため、リスナーからの寄付に頼っています。"},{"sentence":"Many public broadcasting services are donor-supported.","translation":"多くの公共放送サービスは寄付によって支援されています。"},{"sentence":"This is a donor-supported project, and we appreciate any contributions.","translation":"これは寄付によって支援されているプロジェクトであり、皆様からのご支援に感謝いたします。"}],"collocations":["donor-supported organization","donor-supported program","donor-supported project","donor-supported radio","donor-supported television","donor-supported research"],"synonyms":["charity-funded","donation-based","philanthropically funded","contribution-supported"],"antonyms":["government-funded","privately owned","for-profit"]}],"etymology":{"value":"The term is a compound adjective formed by combining 'donor' (a person or group that gives something) with 'supported' (maintained or sustained). It directly indicates the means of financial or material support.","priority":"N/A"},"pronunciation":{"ipa":"/ˈdoʊnər səˈpɔːrtɪd/","syllables":"do-nor-sup-port-ed"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"'Donor-supported' is used to describe organizations, projects, or services that receive financial backing primarily from donations. This term is common in the non-profit sector, including public broadcasting, charities, and research institutions. It emphasizes the reliance on voluntary contributions rather than government funding, commercial revenue, or other sources.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The company is donor support.","correct":"The company is donor-supported.","note":"'Donor-supported' is an adjective, so it should be used to describe a noun. 'Donor support' can be a noun phrase referring to the act of donating or the assistance provided by donors."},{"incorrect":"This program is support by donors.","correct":"This program is supported by donors. / This is a donor-supported program.","note":"Ensure the correct verb tense and adjective usage. 'Supported by donors' is a passive construction, while 'donor-supported' is a direct adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["donor","support","donation","funding","charity","philanthropy"],"phrases":["crowd-funded","grant-funded","non-profit","NGO (Non-Governmental Organization)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent, but common in specific contexts (e.g., non-profit sector).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'donor-supported' is relatively straightforward. It means that something (like a radio station, a charity, or a project) receives its funding primarily from donations made by individuals or organizations, rather than from the government, from selling products, or from other sources. Understanding this term requires a basic knowledge of how non-profit organizations are funded. It's most commonly encountered in contexts related to charities, public broadcasting, and research. "},"example_sentences":[{"sentence":"The museum is a donor-supported institution, relying on the generosity of its patrons.","translation":"その美術館は寄付者の寛大さに頼る、寄付によって運営されている施設です。","type":"adjective","meaning_category":"寄付によって運営されている"},{"sentence":"We are grateful for the continued support of our donor-supported programs.","translation":"寄付によって支援されている私たちのプログラムへの継続的なご支援に感謝いたします。","type":"adjective","meaning_category":"寄付によって支援されている"},{"sentence":"The organization's website highlights the impact of its donor-supported initiatives.","translation":"その団体のウェブサイトでは、寄付によって支援されているイニシアチブの影響を強調しています。","type":"adjective","meaning_category":"寄付によって支援されている"}]}