{"word":"neurodiverse","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"神経多様性のある、ニューロダイバーシティの","english_definition":"Having a neurological condition (such as autism or ADHD) that results in differences in learning and behavioral traits.","examples":[{"sentence":"The company is committed to creating a neurodiverse workforce.","translation":"その会社は、神経多様性のある労働力を創出することに尽力しています。"},{"sentence":"Neurodiverse individuals often possess unique talents and perspectives.","translation":"神経多様性のある人々は、しばしば独自の才能と視点を持っています。"},{"sentence":"The school provides support for neurodiverse students.","translation":"その学校は、神経多様性のある学生に支援を提供しています。"}],"collocations":["neurodiverse workforce (神経多様性のある労働力)","neurodiverse individuals (神経多様性のある人々)","neurodiverse students (神経多様性のある学生)","neurodiverse team (神経多様性のあるチーム)","neurodiverse population (神経多様性のある人口)"],"synonyms":["neurodivergent"],"antonyms":["neurotypical"]},{"part_of_speech":"adjective","definition":"神経多様性を包含する、ニューロダイバーシティを尊重する","english_definition":"Relating to or characterized by neurodiversity.","examples":[{"sentence":"We need to create a more neurodiverse-friendly environment.","translation":"私たちは、より神経多様性を尊重する環境を作る必要があります。"},{"sentence":"The conference focused on neurodiverse perspectives in the workplace.","translation":"その会議は、職場における神経多様性の視点に焦点を当てました。"}],"collocations":["neurodiverse-friendly (神経多様性を尊重する)","neurodiverse perspective (神経多様性の視点)"],"synonyms":["neurodiversity-affirming"],"antonyms":[]}],"etymology":{"value":"The term 'neurodiverse' is derived from 'neurodiversity,' a concept coined by Judy Singer in the late 1990s. It combines 'neuro-' (referring to the nervous system) and 'diverse' (meaning varied or different).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnjʊəroʊdaɪˈvɜːrs/","syllables":"neu-ro-di-verse"},"inflection":{"notes":"This is an adjective, so it has comparative and superlative forms (more neurodiverse, most neurodiverse), although these are not commonly used."},"usage_notes":{"explanation":"'Neurodiverse' is an adjective used to describe individuals or groups who exhibit neurodiversity, meaning they have variations in brain function and behavioral traits. It is often used in the context of conditions like autism, ADHD, dyslexia, and other neurological differences. It emphasizes that these differences are natural variations rather than deficits. The term is used to promote inclusion and understanding of neurological differences.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a neurodiversity person.","correct":"✓ He is a neurodiverse person. / ✓ He is a person with neurodiversity.","note":"'Neurodiverse' is an adjective, so it modifies a noun. 'Neurodiversity' is a noun that refers to the concept itself."},{"incorrect":"✗ Neurodiverse is a disease.","correct":"✓ Neurodiversity is not a disease.","note":"Neurodiversity is not a disease or disorder but a natural variation in human neurology."}],"priority":"★★☆"},"related_words":{"derivatives":["neurodiversity (noun)","neurodivergent (adjective)","neurotypically (adverb)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low but increasing in recent years.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Neurodiverse' is a term used to describe people whose brains work differently from what is considered 'typical.' This can include people with autism, ADHD, dyslexia, and other neurological conditions. The word emphasizes that these differences are natural variations and strengths, rather than deficits or problems. It's a term used to promote acceptance and understanding of different ways of thinking and learning."},"example_sentences":[{"sentence":"The company values its neurodiverse employees for their unique problem-solving skills.","translation":"その会社は、神経多様性のある従業員の独自の課題解決能力を高く評価しています。","type":"adjective","meaning_category":"Having neurological differences"},{"sentence":"Creating a neurodiverse environment is crucial for fostering innovation.","translation":"神経多様性のある環境を作ることは、イノベーションを促進するために不可欠です。","type":"adjective","meaning_category":"Relating to neurodiversity"}]}