{"word":"opulencia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"富裕、富豪、贅沢、豪華絢爛","english_definition":"wealth; riches; affluence; abundance; luxury; lavishness; splendor.","examples":[{"sentence":"La opulencia de su mansión era evidente.","translation":"彼の邸宅の富裕さは明らかだった。"},{"sentence":"Vivían en una opulencia que pocos podían permitirse.","translation":"彼らはごくわずかな人しか許容できない富裕さの中で暮らしていた。"},{"sentence":"La opulencia de la fiesta era impresionante.","translation":"パーティーの豪華絢爛さは印象的だった。"}],"collocations":["derroche de opulencia (富の浪費)","vida de opulencia (富裕な生活)","símbolo de opulencia (富の象徴)"],"synonyms":["riqueza","abundancia","lujo","fastuosidad","pompa","esplendor"],"antonyms":["pobreza","escasez","austeridad","modestia"]}],"etymology":{"value":"Del latín opulentia, derivado de opulens (rico, poderoso).","priority":"★★☆"},"pronunciation":{"ipa":"/opuˈlenθja/ (Spain), /opuˈlensja/ (Latin America)","syllables":"o-pu-len-cia"},"inflection":{"noun_gender":"feminine","noun_plural":"opulencias"},"usage_notes":{"explanation":"Opulencia se refiere a un estado de gran riqueza y abundancia, a menudo manifestado en un estilo de vida lujoso y ostentoso. Implica no solo la posesión de bienes materiales, sino también la exhibición de estos de una manera llamativa. Se usa para describir tanto la riqueza en sí misma como las manifestaciones externas de esa riqueza.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ La opulencia es bueno para la sociedad.","correct":"✓ La opulencia no siempre es buena para la sociedad.","note":"Opulencia es un sustantivo femenino, por lo que debe concordar con adjetivos femeninos. Además, la opulencia en sí misma no es inherentemente buena o mala, depende del contexto y de cómo se obtiene y se utiliza."}],"priority":"★★☆"},"related_words":{"derivatives":["opulento (adjective: opulent, wealthy)"],"phrases":["en la opulencia (in opulence, in luxury)"],"priority":"★★☆"},"level_frequency":{"frequency_corpus":"Relatively infrequent. More common in literary or formal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Opulencia' is a relatively advanced word referring to great wealth and luxury. It's more common in formal writing or when describing historical periods of great wealth. Understanding this word helps in comprehending texts that discuss economic disparities or historical displays of wealth."},"example_sentences":[{"sentence":"El palacio real era un ejemplo de opulencia y poder.","translation":"The royal palace was an example of opulence and power.","type":"general","meaning_category":"wealth/luxury"},{"sentence":"La opulencia de la cena contrastaba con la pobreza del pueblo.","translation":"The opulence of the dinner contrasted with the poverty of the town.","type":"contrast","meaning_category":"contrast"},{"sentence":"Muchos criticaron la opulencia mostrada durante la crisis económica.","translation":"Many criticized the opulence displayed during the economic crisis.","type":"criticism","meaning_category":"criticism"}]}