{"word":"mass-wasted","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(slang, often humorous) Extremely intoxicated or impaired by drugs or alcohol, to the point of being incapacitated or behaving erratically; severely drunk or high.","english_definition":"(slang, often humorous) Extremely intoxicated or impaired by drugs or alcohol, to the point of being incapacitated or behaving erratically; severely drunk or high.","examples":[{"sentence":"After the party, he was completely mass-wasted and couldn't even stand up.","translation":"パーティーの後、彼は完全に酔いつぶれて、立ち上がることさえできなかった。"},{"sentence":"They found him mass-wasted in the park, mumbling incoherently.","translation":"彼らは彼が公園でひどく酔っぱらって、意味不明なことをぶつぶつ言っているのを見つけた。"},{"sentence":"She got mass-wasted and started dancing on the table.","translation":"彼女はひどく酔っぱらって、テーブルの上で踊り始めた。"}],"collocations":["get mass-wasted","completely mass-wasted","totally mass-wasted"],"synonyms":["hammered","smashed","plastered","wasted","intoxicated","drunk","high","blitzed","bombed","shitfaced","legless","out of one's mind"],"antonyms":["sober","clear-headed","straight"],"notes":["This term is slang and can be considered vulgar or offensive in formal contexts. It implies a very high level of intoxication."]}],"etymology":{"value":"Likely a combination of 'mass' (implying a large quantity or degree) and 'wasted' (slang for intoxicated or impaired). The term suggests being intoxicated to a very significant or extreme extent.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌmæsˈweɪstɪd/","syllables":"mass-wast-ed"},"inflection":{"notes":"The word 'mass-wasted' is an adjective and does not have typical inflectional forms (e.g., comparative or superlative)."},"usage_notes":{"explanation":"'Mass-wasted' is a slang term used to describe someone who is extremely intoxicated, usually from alcohol or drugs. It is more emphatic than simply saying someone is 'drunk' or 'high,' implying a state of severe impairment. The term is often used humorously, but it can also carry negative connotations, especially when describing someone's behavior while in this state.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was mass-wasted of alcohol.","correct":"✓ He was mass-wasted from alcohol.","note":"The preposition 'from' is typically used to indicate the cause of the intoxication."},{"incorrect":"✗ She mass-wasted all night.","correct":"✓ She got mass-wasted all night.","note":"'Get mass-wasted' is a common phrase used to describe becoming extremely intoxicated."}],"priority":"★☆☆"},"related_words":{"derivatives":["wasted","mass","massively"],"phrasal_verbs":["N/A"],"related_terms":["intoxicated","impaired","under the influence"]},"level_frequency":{"CEFR":"N/A (Slang, not typically included in CEFR levels)","frequency_google_ngram":"Low frequency (primarily slang usage)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Mass-wasted' is a slang term indicating extreme intoxication, typically from alcohol or drugs. It's a colloquial expression, more intense than 'drunk' or 'high,' implying significant impairment and potential loss of control. Due to its informal and potentially offensive nature, it's rarely used in formal contexts. Understanding the term requires familiarity with slang and informal language use."},"example_sentences":[{"sentence":"By midnight, half the party guests were completely mass-wasted.","translation":"真夜中までに、パーティーの参加者の半分は完全に酔いつぶれていた。","type":"adjective","meaning_category":"Intoxicated"},{"sentence":"He made a fool of himself because he got mass-wasted at the company event.","translation":"彼は会社のイベントでひどく酔っぱらって、恥をかいた。","type":"adjective","meaning_category":"Intoxicated"},{"sentence":"The police found him mass-wasted behind the wheel of his car.","translation":"警察は彼がひどく酔っぱらった状態で車のハンドルを握っているのを発見した。","type":"adjective","meaning_category":"Intoxicated"}]}