{"word":"subtype-selective","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"亜型選択的な、サブタイプ選択的な","english_definition":"Exhibiting selectivity for a specific subtype of a receptor, enzyme, or other biological target.","examples":[{"sentence":"The new drug is subtype-selective for the dopamine D3 receptor.","translation":"その新薬はドーパミンD3受容体に対してサブタイプ選択的である。"},{"sentence":"Subtype-selective inhibitors are crucial for studying the function of individual isoforms.","translation":"サブタイプ選択的な阻害剤は、個々のアイソフォームの機能を研究する上で重要である。"}],"collocations":["subtype-selective agonist","subtype-selective antagonist","subtype-selective inhibitor","subtype-selective binding"],"synonyms":["isoform-selective","receptor subtype-specific"],"antonyms":["non-selective","broad-spectrum"]},{"part_of_speech":"adjective","definition":"（医学・生物学において）特定のサブタイプのみに作用する、または影響を与える","english_definition":"(In medicine or biology) Acting on or affecting only a specific subtype.","examples":[{"sentence":"A subtype-selective antibody was developed to target the cancer cells.","translation":"がん細胞を標的とするサブタイプ選択的抗体が開発された。"},{"sentence":"The treatment is designed to be subtype-selective, minimizing side effects.","translation":"この治療法はサブタイプ選択的に設計されており、副作用を最小限に抑える。"}],"collocations":["subtype-selective antibody","subtype-selective treatment","subtype-selective therapy"],"synonyms":["subtype-specific","target-specific"],"antonyms":["non-specific","broad-acting"]}],"etymology":{"value":"Combination of 'subtype' (a subdivision of a type) and 'selective' (having the power or tendency to select; characterized by selection).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈsʌbˌtaɪp sɪˈlɛktɪv/","syllables":"sub-type se-lec-tive"},"inflection":{"notes":"Adjectives do not inflect in English, other than to form comparative and superlative degrees (which are not commonly used with this word)."},"usage_notes":{"explanation":"The term 'subtype-selective' is primarily used in scientific and medical contexts to describe agents or processes that specifically target or affect one particular subtype of a larger category. This is important for precision in research and treatment, as different subtypes may have different functions or responses.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The drug is selective to the subtype.","correct":"✓ The drug is subtype-selective. / ✓ The drug is selective for the subtype.","note":"The correct phrasing is either 'subtype-selective' (hyphenated) or 'selective for the subtype'."}],"priority":"☆☆☆"},"related_words":{"derivatives":["selectivity (noun)","subtype (noun)"],"phrases":["subtype-selective binding assay","subtype-selective expression"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific and technical literature.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'subtype-selective' is used in specialized fields like pharmacology, biology, and medicine. It describes something that targets a specific subtype (a more specific version) of a larger category, such as a receptor or enzyme. Understanding this term requires familiarity with scientific concepts related to molecular biology and drug action. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The researchers developed a **subtype-selective** compound to study the function of a specific receptor.","translation":"研究者たちは、特定の受容体の機能を研究するために、サブタイプ選択的な化合物を開発した。","type":"adjective","meaning_category":"亜型選択的な"},{"sentence":"This **subtype-selective** drug has fewer side effects compared to non-selective alternatives.","translation":"このサブタイプ選択的な薬は、非選択的な代替薬と比較して副作用が少ない。","type":"adjective","meaning_category":"特定のサブタイプのみに作用する"}]}