{"word":"Sensuism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"感覚主義：感覚的経験を知識の唯一の源泉とみなす哲学説。","english_definition":"The philosophical doctrine that all knowledge is derived from sense experience.","examples":[{"sentence":"Sensuism, as a philosophical approach, emphasizes the role of sensory input in shaping our understanding of the world.","translation":"哲学的なアプローチとしての感覚主義は、世界の理解を形成する上での感覚的入力の役割を強調している。"},{"sentence":"Some critics argue that sensuism neglects the role of reason and innate ideas in the acquisition of knowledge.","translation":"一部の批評家は、感覚主義が知識の獲得における理性と生得的なアイデアの役割を無視していると主張している。"}],"collocations":["philosophical sensuism","radical sensuism","criticisms of sensuism"],"synonyms":["empiricism","sensationalism"],"antonyms":["rationalism","idealism"]}],"etymology":{"value":"「sense」（感覚）+ 「-ism」（主義）","priority":"★★★"},"pronunciation":{"ipa":"ˈsɛnsjuɪzəm","syllables":"sen-su-ism"},"inflection":{"noun_plural":"Sensuisms"},"usage_notes":{"explanation":"Sensuismは、哲学的な文脈でのみ使用される専門用語であり、日常会話ではほとんど使用されません。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practiced sensuism in his daily life by relying only on his feelings.","correct":"✓ He relied heavily on his feelings in his daily life.","note":"Sensuismは哲学的な概念であり、単に感情に頼ることを指すものではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":["sensual","sensory","sensation"],"related_terms":["empiricism","rationalism","idealism"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Sensuism is a complex philosophical term that is typically encountered in academic contexts. It is not commonly used in everyday language. Understanding requires familiarity with philosophical concepts such as empiricism and rationalism."},"example_sentences":[{"sentence":"The core tenet of sensuism is that all ideas originate from sensory perceptions.","translation":"感覚主義の中核的な教義は、すべてのアイデアが感覚的知覚から生まれるということである。","type":"definition","meaning_category":"philosophy"},{"sentence":"Locke's philosophy is often interpreted as a form of sensuism, although he also acknowledged the role of reflection.","translation":"ロックの哲学は、内省の役割も認めていたが、感覚主義の一形態として解釈されることが多い。","type":"example","meaning_category":"philosophy"}]}