{"word":"Marcosian","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"マルコス大統領（フェルディナンド・マルコス）の、またはマルコス政権の","english_definition":"Relating to Ferdinand Marcos, the former president of the Philippines, or his regime.","examples":[{"sentence":"The Marcosian era was marked by both economic growth and widespread corruption.","translation":"マルコス時代は、経済成長と広範囲にわたる汚職の両方によって特徴づけられた。"},{"sentence":"Marcosian policies favored cronies and led to significant wealth inequality.","translation":"マルコス政策は、取り巻きを優遇し、重大な富の不平等をもたらした。"}],"collocations":["Marcosian era","Marcosian policies","Marcosian regime","Marcosian cronies"],"synonyms":["Marcos-era","Marcos-related"],"antonyms":[]},{"part_of_speech":"noun","definition":"マルコス支持者、マルコス政権関係者","english_definition":"A supporter of Ferdinand Marcos or his regime.","examples":[{"sentence":"The Marcosians still hold rallies to commemorate the former president.","translation":"マルコス支持者は、今でも元大統領を記念する集会を開催している。"},{"sentence":"Many Marcosians believe that the accusations of corruption were exaggerated.","translation":"多くのマルコス支持者は、汚職の告発は誇張されたものだと信じている。"}],"collocations":["die-hard Marcosians"],"synonyms":["Marcos loyalist","Marcos supporter"],"antonyms":[]}],"etymology":{"value":"Named after Ferdinand Marcos, the former president of the Philippines.","priority":"★★★"},"pronunciation":{"ipa":"/mɑːrˈkoʊziən/","syllables":"Mar-co-si-an"},"inflection":{"noun_plural":"Marcosians"},"usage_notes":{"explanation":"The term 'Marcosian' is primarily used in the context of Philippine history and politics, referring to the period when Ferdinand Marcos was in power. It often carries connotations of authoritarianism, corruption, and human rights abuses, although some Filipinos still view Marcos favorably.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Marcosian is a good person.","correct":"✓ A Marcosian is a supporter of Marcos.","note":"'Marcosian' as a noun refers to a supporter, not necessarily a good person."}],"priority":"★☆☆"},"related_words":{"derivatives":["Marcos (proper noun)","Marcos era (noun phrase)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Marcosian' is specific to Philippine history and politics, relating to Ferdinand Marcos's presidency. Understanding its meaning requires knowledge of this historical context. It's not a commonly used word outside of discussions about the Philippines.","priority":"★★☆"},"example_sentences":[{"sentence":"The Marcosian constitution concentrated power in the hands of the president.","translation":"マルコス憲法は、大統領の手に権力を集中させた。","type":"adjective","meaning_category":"マルコス大統領の、またはマルコス政権の"},{"sentence":"The Marcosians continue to defend his legacy.","translation":"マルコス支持者は、彼の遺産を守り続けている。","type":"noun","meaning_category":"マルコス支持者"}]}