{"word":"calcaneocuboid","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"踵骨立方関節の、踵骨立方骨の","english_definition":"Relating to the calcaneus and cuboid bones, or to the calcaneocuboid joint.","examples":[{"sentence":"The calcaneocuboid joint is an important part of the foot.","translation":"踵骨立方関節は足の重要な部分です。"},{"sentence":"Calcaneocuboid fusion is a surgical procedure.","translation":"踵骨立方骨癒合は外科手術の一種です。"}],"collocations":["calcaneocuboid joint (踵骨立方関節)","calcaneocuboid ligament (踵骨立方靭帯)","calcaneocuboid fusion (踵骨立方骨癒合)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the combination of 'calcaneo-' (referring to the calcaneus or heel bone) and 'cuboid' (referring to the cuboid bone).","priority":"★★☆"},"pronunciation":{"ipa":"/kælˌkeɪni.oʊˈkjuːbɔɪd/","syllables":"cal-ca-ne-o-cu-boid"},"inflection":{"notes":"This word does not have typical inflections as it is primarily used as an adjective."},"usage_notes":{"explanation":"The term 'calcaneocuboid' is primarily used in medical and anatomical contexts to describe structures or conditions related to both the calcaneus (heel bone) and the cuboid bone in the foot. It is often used to specify a particular joint, ligament, or surgical procedure involving these two bones.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ calcaneocuboid is a muscle.","correct":"✓ calcaneocuboid refers to a joint or structures involving the calcaneus and cuboid bones.","note":"The calcaneocuboid is not a muscle, but a joint between two bones. "},{"incorrect":"✗ calcaneocuboid is related to the wrist.","correct":"✓ calcaneocuboid is related to the foot.","note":"The calcaneocuboid is a structure in the foot, not the wrist."}],"priority":"★★☆"},"related_words":{"derivatives":["calcaneus (踵骨)","cuboid (立方骨)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'calcaneocuboid' is a highly specialized anatomical term primarily encountered in medical or advanced biology contexts. It refers specifically to structures or conditions involving both the calcaneus (heel bone) and the cuboid bone in the foot. Understanding this term requires a solid foundation in anatomy and medical terminology. Its usage is confined to professional or academic discussions within these fields."},"example_sentences":[{"sentence":"The calcaneocuboid joint allows for some inversion and eversion of the foot.","translation":"踵骨立方関節は足の内反と外反を可能にします。","type":"adjective","meaning_category":"Anatomy"},{"sentence":"Calcaneocuboid sprains are less common than ankle sprains.","translation":"踵骨立方関節捻挫は足関節捻挫よりも一般的ではありません。","type":"adjective","meaning_category":"Medical"}]}