{"word":"computer-integrated","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"コンピュータ統合された","english_definition":"(of a system, process, or technology) controlled or managed by computers to optimize efficiency and coordination.","examples":[{"sentence":"The factory uses a computer-integrated manufacturing system to streamline production.","translation":"その工場は、生産を効率化するためにコンピュータ統合製造システムを使用しています。"},{"sentence":"Our computer-integrated design process allows for rapid prototyping and testing.","translation":"当社のコンピュータ統合設計プロセスにより、迅速なプロトタイピングとテストが可能になります。"}],"collocations":["computer-integrated manufacturing (CIM)","computer-integrated design (CID)","computer-integrated system"],"synonyms":["automated","computerized","digitally controlled"],"antonyms":["manual","non-automated"]}],"etymology":{"value":"The term is formed by combining 'computer' (referring to an electronic device for storing and processing data) with 'integrated' (meaning combined or coordinated). It describes systems or processes where computers are used to manage and coordinate various aspects.","priority":"☆☆☆"},"pronunciation":{"ipa":"/kəmˌpjuːtər ˈɪntɪˌɡreɪtɪd/","syllables":"com-pu-ter-in-ti-grat-ed"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Computer-integrated' is often used in the context of manufacturing, design, and other technical fields. It implies a high degree of automation and coordination through the use of computer systems. The term emphasizes that computers are not just used for individual tasks, but are used to manage and coordinate multiple aspects of a process or system.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The system is computer integrate.","correct":"✓ The system is computer-integrated.","note":"The correct term is 'computer-integrated', with the '-ed' ending to indicate the past participle form used as an adjective."}],"priority":"☆☆☆"},"related_words":{"derivatives":["integration","computerization","automation"],"related_terms":["computer-aided design (CAD)","computer-aided manufacturing (CAM)","enterprise resource planning (ERP)"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Computer-integrated' is a technical term used to describe systems or processes that are controlled and managed by computers to improve efficiency and coordination. It's commonly found in manufacturing, design, and engineering contexts. The term implies a high level of automation and the use of computers to manage various aspects of a process or system. Understanding this term requires familiarity with technical and industrial concepts."},"example_sentences":[{"sentence":"The company invested in a computer-integrated supply chain to reduce costs.","translation":"その会社は、コストを削減するためにコンピュータ統合サプライチェーンに投資しました。","type":"general","meaning_category":"general"},{"sentence":"The new computer-integrated system improved the accuracy of our data analysis.","translation":"新しいコンピュータ統合システムにより、データ分析の精度が向上しました。","type":"general","meaning_category":"general"}]}