{"word":"twice-felt","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Felt or experienced two times; having a doubled or repeated emotional impact.","english_definition":"Experienced or felt two times; having a doubled or repeated emotional impact.","examples":[{"sentence":"The loss was twice-felt, first by her family, and then by the community.","translation":"その喪失は二度感じられた。最初は彼女の家族によって、そして次に地域社会によって。"},{"sentence":"The joy of reunion was twice-felt after such a long separation.","translation":"長い別れの後の再会の喜びは、二重に感じられた。"}],"collocations":["twice-felt sorrow","twice-felt joy","twice-felt pain","twice-felt relief"],"synonyms":["doubled","repeated","redoubled","intensified","heightened"],"antonyms":["single","once-felt","lessened","diminished"]}],"etymology":{"value":"The word is a compound of 'twice' (meaning two times) and 'felt' (the past participle of 'feel', indicating an emotion or sensation). It suggests an emotion or experience that is felt or experienced on two separate occasions or in a doubled intensity.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtwaɪsˌfelt/","syllables":"twice-felt"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb. Comparative and superlative forms are not typically used, but one could theoretically say 'more twice-felt' or 'most twice-felt' for emphasis, though it's uncommon."},"usage_notes":{"explanation":"'Twice-felt' is used to describe emotions or experiences that are either felt two separate times, or have an intensity that is doubled due to specific circumstances. It is often used to emphasize the depth or significance of the emotion. It is not a commonly used word, so it adds a degree of poetic or literary flair to the writing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He twice felt the pain.","correct":"✓ He felt the pain twice.","note":"'Twice' is an adverb and modifies the verb 'felt'. 'Twice-felt' is an adjective and modifies a noun (e.g., 'twice-felt pain')."},{"incorrect":"✗ The twice-felt is good.","correct":"✓ The twice-felt joy is good.","note":"'Twice-felt' is an adjective and needs a noun to modify."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_adjectives":["double-felt","repeatedly-felt"],"related_nouns":["feeling","emotion","experience"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (not a standard CEFR word)","frequency_google_ngram":"Very low frequency - not a commonly used word.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Twice-felt' is a sophisticated adjective used to describe an emotion or experience that is felt or experienced two times, or with doubled intensity. It is not a common word and is more likely to be found in literary or poetic contexts. The word is formed by combining 'twice' (meaning two times) and 'felt' (the past participle of 'feel'). It is used to emphasize the depth or significance of an emotion or experience. Due to its uncommon usage, it is considered a high-level vocabulary word."},"example_sentences":[{"sentence":"The relief at finding her cat safe was a twice-felt blessing after the long search.","translation":"猫が無事に見つかったことへの安堵は、長い捜索の後の二重の喜びだった。","type":"adjective","meaning_category":"doubled joy"},{"sentence":"The sting of betrayal was a twice-felt wound, both personal and professional.","translation":"裏切りの痛みは、個人的にも職業的にも、二重の傷だった。","type":"adjective","meaning_category":"doubled pain"},{"sentence":"The opportunity to celebrate felt twice-felt after overcoming so many challenges.","translation":"多くの困難を乗り越えた後、祝う機会は二重に感じられた。","type":"adjective","meaning_category":"doubled celebration"}]}