{"word":"outbrawl","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(格闘技などで)相手を乱闘で打ち負かす、乱闘で相手より優位に立つ","english_definition":"To defeat an opponent in a brawl; to be better than an opponent in a brawl.","examples":[{"sentence":"The heavyweight champion was able to outbrawl his challenger, winning by TKO in the later rounds.","translation":"ヘビー級チャンピオンは挑戦者を乱闘で打ち負かし、後半ラウンドでTKO勝ちを収めた。"},{"sentence":"Despite being smaller, the street fighter managed to outbrawl the larger, more muscular opponent.","translation":"小柄ながらも、そのストリートファイターは、より大きく筋肉質な相手を乱闘で打ち負かすことができた。"}],"collocations":["outbrawl an opponent","outbrawl someone in a fight"],"synonyms":["overpower","defeat","overcome","dominate","beat in a fight"],"antonyms":["lose to","be defeated by"],"notes":"The word implies a chaotic and often unskilled fight, relying more on brute strength and endurance than technique."}],"etymology":{"value":"Derived from the prefix 'out-' (meaning 'more than' or 'better than') combined with the word 'brawl' (meaning a noisy fight or quarrel).","priority":"★★☆"},"pronunciation":{"ipa":"/aʊtˈbrɔːl/","syllables":"out-brawl"},"inflection":{"verb_forms":{"present_simple":["outbrawl","outbrawls"],"past_simple":"outbrawled","past_participle":"outbrawled","present_participle":"outbrawling"}},"usage_notes":{"explanation":"'Outbrawl' is used to describe a situation where one fighter is more successful in a chaotic, often unskilled fight than their opponent. It implies that the victor was able to withstand and dish out more punishment in a brawl-like scenario.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He outbrawled with his opponent.","correct":"✓ He outbrawled his opponent.","note":"'Outbrawl' is a transitive verb and takes a direct object (the opponent). The preposition 'with' is not needed."}],"priority":"★★☆"},"related_words":{"derivatives":["brawl (noun: a noisy fight or quarrel)","brawler (noun: a person who is prone to brawling)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Relatively rare word, mostly used in the context of fighting sports or street fights.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Outbrawl' is a relatively uncommon word that combines the idea of surpassing someone in a 'brawl,' which is a rough and disorderly fight. It's mostly used in contexts where physical strength and endurance are more important than refined fighting techniques. Understanding this word requires familiarity with the base word 'brawl' and the prefix 'out-,' which indicates superiority or exceeding a certain level."},"example_sentences":[{"sentence":"The smaller fighter tried to outbrawl his larger opponent, but his lack of reach proved to be a disadvantage.","translation":"小柄なファイターは、より大きな相手を乱闘で打ち負かそうとしたが、リーチの短さが不利になった。","type":"verb","meaning_category":"乱闘で打ち負かす"},{"sentence":"The strategy was simple: outbrawl him in the center of the ring.","translation":"戦略は単純だった。リングの中央で彼を乱闘で打ち負かすことだ。","type":"verb","meaning_category":"乱闘で打ち負かす"}]}