{"word":"gradations","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"段階的な変化、グラデーション、濃淡","english_definition":"A series of successive changes or stages; a gradual passing from one shade or degree to another.","examples":[{"sentence":"The painting showed subtle gradations of color.","translation":"その絵は色の微妙なグラデーションを示していた。"},{"sentence":"There are many gradations of meaning in the word 'love'.","translation":"「愛」という言葉には意味の多くの段階的な変化がある。"},{"sentence":"The gradations of social status are not always clear.","translation":"社会的地位の段階的な変化は必ずしも明確ではない。"}],"collocations":["subtle gradations","fine gradations","gradations of color","gradations of meaning","gradations of social status"],"synonyms":["degrees","stages","levels","shades","nuances","variations"],"antonyms":["abrupt changes","discontinuities"]}],"etymology":{"value":"From the Latin word 'gradatio', meaning 'a stepping, advancing by steps, rhetorical climax'. This comes from 'gradus', meaning 'a step'.","priority":"★★★"},"pronunciation":{"ipa":"/ɡrəˈdeɪʃənz/","syllables":"gra-da-tions"},"inflection":{"noun_plural":"gradations"},"usage_notes":{"explanation":"'Gradations' refers to a series of gradual changes or steps, often in color, meaning, or social status. It implies a smooth transition from one state to another, rather than abrupt shifts. The term is often used to describe subtle differences or nuances.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The gradations was very subtle.","correct":"✓ The gradations were very subtle.","note":"'Gradations' is a plural noun, so it requires a plural verb ('were' instead of 'was')."},{"incorrect":"✗ The gradations of the hill was steep.","correct":"✓ The gradient of the hill was steep.","note":"'Gradations' refers to a series of changes, while 'gradient' refers to the slope or steepness of something. Use 'gradient' when referring to the steepness of a hill."}],"priority":"★★☆"},"related_words":{"derivatives":["gradation (singular form of gradations)","grade (a degree or level in a scale)","gradual (proceeding by steps or degrees)","graduate (to receive an academic degree or diploma)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, more common in academic or technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'gradations' refers to a series of small, incremental changes or steps. It is often used to describe subtle differences in color, meaning, or social status. This word is more common in academic or technical writing, where precise language is important. Understanding 'gradations' helps to appreciate the nuances and complexities of various phenomena.","priority":"★★☆"},"example_sentences":[{"sentence":"The sunset displayed beautiful gradations of orange and red.","translation":"夕焼けはオレンジと赤の美しいグラデーションを見せていた。","type":"noun","meaning_category":"段階的な変化 (色の濃淡)"},{"sentence":"There are subtle gradations in the quality of different wines.","translation":"様々なワインの品質には微妙な段階的な変化がある。","type":"noun","meaning_category":"段階的な変化 (品質)"},{"sentence":"The novel explores the gradations of moral ambiguity.","translation":"その小説は道徳的曖昧さの段階的な変化を探求している。","type":"noun","meaning_category":"段階的な変化 (道徳)"}]}