{"word":"purreic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(韻律学で) ピュリッヒの、二つの短音節からなる韻脚の","english_definition":"(prosody) Relating to or consisting of a pyrrhic foot (two short syllables).","examples":[{"sentence":"The word 'a' can form a purreic foot when unstressed in a line of poetry.","translation":"詩の一行の中で、単語「a」はストレスが置かれない場合、ピュリッヒ韻脚を形成することがある。"}],"collocations":["purreic foot","purreic verse"],"synonyms":["dibrachic"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek πυρρίχιος (purríkhios), relating to the pyrrhic dance.","priority":"★☆☆"},"pronunciation":{"ipa":"/pɪˈriːɪk/","syllables":"pir-ree-ic"},"inflection":{"notes":"Adjective, comparative and superlative forms are purreicer and purreicest, respectively, but rarely used."},"usage_notes":{"explanation":"The term 'purreic' is primarily used in the context of classical prosody, particularly when analyzing Greek and Latin verse. It describes something related to or composed of a pyrrhic foot, which consists of two unstressed or short syllables. In English poetry, purreic feet are rare and often function as substitutions within a more dominant meter.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The poem was entirely purreic.","correct":"✓ The poem contained purreic substitutions.","note":"Entire poems are rarely, if ever, composed entirely of pyrrhic feet. It's more common to find pyrrhic substitutions within a dominant meter."}],"priority":"★☆☆"},"related_words":{"derivatives":["pyrrhic (noun: a metrical foot of two short syllables)","pyrrhic foot (noun: a metrical foot of two short syllables)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'purreic' is a highly specialized term used in the field of prosody (the study of verse structure). It refers to something related to a pyrrhic foot, which is a metrical unit consisting of two unstressed syllables. This term is unlikely to be encountered outside of academic discussions of poetry and classical literature. Understanding it requires familiarity with the principles of classical metrics.","priority":"★☆☆"},"example_sentences":[{"sentence":"The line contained a purreic substitution to maintain the overall rhythm.","translation":"その行は、全体的なリズムを維持するためにピュリッヒ韻脚の代用を含んでいた。","type":"adjective","meaning_category":"韻律学"}]}