{"word":"multiton","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(プログラミング)マルチトン。あるクラスのインスタンスが、特定のキーに基づいて複数存在することを保証するデザインパターン。","english_definition":"(programming) A design pattern that ensures a class has only a limited number of instances, typically indexed by a key.","examples":[{"sentence":"The multiton pattern is useful when you need to manage a pool of resources.","translation":"マルチトンパターンは、リソースのプールを管理する必要がある場合に役立ちます。"},{"sentence":"Unlike the singleton pattern, a multiton allows multiple instances based on a key.","translation":"シングルトンパターンとは異なり、マルチトンはキーに基づいて複数のインスタンスを許可します。"}],"collocations":["implement a multiton","multiton instance","multiton pattern"],"synonyms":["singleton (related, but only one instance)"],"antonyms":[]}],"etymology":{"value":"Derived from 'multiple' and 'singleton'. It's an extension of the singleton pattern.","priority":"★★★"},"pronunciation":{"ipa":"/ˈmʌltɪtɑːn/","syllables":"mul-ti-ton"},"inflection":{"noun_plural":"multitons"},"usage_notes":{"explanation":"The multiton pattern is a software design pattern that generalizes the singleton pattern. While the singleton ensures only one instance of a class exists, the multiton pattern allows for a fixed number of named instances. These instances are typically accessed via a key.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ A multiton is the same as a singleton.","correct":"✓ A multiton allows multiple instances, unlike a singleton.","note":"A singleton guarantees only one instance, while a multiton allows multiple, keyed instances."}],"priority":"★★☆"},"related_words":{"derivatives":["singleton","factory pattern","design pattern"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'multiton' refers to a specific design pattern in software engineering. It's an advanced concept related to object-oriented programming and is typically discussed in the context of software architecture and design. Understanding it requires familiarity with design patterns like singleton and factory patterns."},"example_sentences":[{"sentence":"Implementing a `multiton` ensures that only a limited number of instances of a class exist, each associated with a unique key.","translation":"`マルチトン`を実装することで、クラスのインスタンス数が制限され、各インスタンスが一意のキーに関連付けられるようになります。","type":"noun","meaning_category":"programming pattern"},{"sentence":"The `multiton` pattern can be useful for managing database connections, where each connection is associated with a specific database.","translation":"`マルチトン`パターンは、データベース接続の管理に役立ちます。各接続は特定のデータベースに関連付けられています。","type":"noun","meaning_category":"programming pattern"}]}