{"word":"subspecies","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"亜種","english_definition":"a taxonomic rank below species, usually designating a geographically isolated population differing morphologically from other populations of the same species.","examples":[{"sentence":"The Siberian tiger is a subspecies of the tiger.","translation":"シベリアトラはトラの亜種です。"},{"sentence":"Different subspecies of birds can be found in various regions.","translation":"鳥の異なる亜種は様々な地域で見つけることができます。"}],"collocations":["identify a subspecies (亜種を特定する)","classify as a subspecies (亜種として分類する)","endangered subspecies (絶滅危惧亜種)","local subspecies (地域亜種)"],"synonyms":["variety","race","form","strain"],"antonyms":["species","genus","family","order","class","phylum","kingdom","domain"]}],"etymology":{"value":"'sub-' (below) + 'species'. First used in the 19th century as biological classification became more refined.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsʌbˌspiːʃiːz/","syllables":"sub-spe-cies"},"inflection":{"noun_plural":"subspecies (the plural form is the same as the singular)"},"usage_notes":{"explanation":"'Subspecies' is used in biology to classify organisms that are distinct from other populations within the same species, usually due to geographic isolation and resulting morphological differences. It is a rank below species but above 'race' or 'variety', although these latter terms are often used informally and inconsistently. The classification of subspecies can be controversial and is subject to change as new data emerges.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The subspecies are endangered. (when referring to a single subspecies)","correct":"✓ The subspecies is endangered.","note":"'Subspecies' is both singular and plural, but when referring to one, use the singular verb form."},{"incorrect":"✗ Subspecies is the same as species.","correct":"✓ Subspecies is a rank below species.","note":"Subspecies is a more specific classification within a species."}],"priority":"★★☆"},"related_words":{"derivatives":["subspecific (adjective)"],"phrases":["subspecies identification","subspecies classification"],"priority":"★★★"},"level_frequency":{"level":"C1","frequency_google_ngram":"Relatively low frequency, mainly used in scientific contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'subspecies' refers to a specific group within a species that has distinct characteristics, often due to geographic isolation. It's a scientific term used in biology to classify organisms more precisely than just 'species'. Understanding this term requires a background in basic biological classification. It's important to remember that 'subspecies' is a rank below 'species'. The plural form is the same as the singular form, which can sometimes be confusing."},"example_sentences":[{"sentence":"The Amur leopard is a critically endangered **subspecies** of leopard.","translation":"アムールヒョウは、ヒョウの絶滅危惧種に指定されている亜種です。","type":"scientific","meaning_category":"classification"},{"sentence":"Genetic analysis revealed significant differences between the two **subspecies**.","translation":"遺伝子解析により、2つの亜種間に大きな違いがあることが明らかになりました。","type":"scientific","meaning_category":"differentiation"},{"sentence":"Conservation efforts are focused on protecting the remaining populations of this unique **subspecies**.","translation":"保全活動は、このユニークな亜種の残りの個体群を保護することに重点を置いています。","type":"conservation","meaning_category":"protection"}]}