{"word":"root-bruising","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Causing damage or injury to the roots of a plant.","english_definition":"Describing something that causes damage or injury to the roots of a plant.","examples":[{"sentence":"The heavy machinery was root-bruising to the nearby trees.","translation":"重機は近くの木の根を傷つけていた。"},{"sentence":"Root-bruising activities can lead to the decline of forest health.","translation":"根を傷つける行為は、森林の健康状態の悪化につながる可能性がある。"}],"collocations":["root-bruising machinery","root-bruising activities","prevent root-bruising"],"synonyms":["root-damaging","root-injuring"],"antonyms":["root-protecting","root-conserving"]}],"etymology":{"value":"Compound word formed by combining \"root\" (referring to the underground part of a plant) and \"bruising\" (causing damage or injury).","priority":"N/A"},"pronunciation":{"ipa":"/ˈruːtˌbruːzɪŋ/","syllables":"root-bruis-ing"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb. Comparative and superlative forms (more root-bruising, most root-bruising) are possible but less common."},"usage_notes":{"explanation":"The term \"root-bruising\" is typically used in contexts related to forestry, gardening, or environmental science, where the health of plant roots is a concern. It describes actions or conditions that physically damage the roots, which can impair the plant's ability to absorb nutrients and water.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The root-bruising was caused by the rain.","correct":"✓ The root-bruising was caused by the construction.","note":"Root-bruising is typically caused by physical damage, not natural events like rain."}],"priority":"N/A"},"related_words":{"derivatives":["bruise","bruising","root"],"related_terms":["root rot","root damage","soil compaction"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - specialized term.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term \"root-bruising\" is a specialized term used in fields like forestry and environmental science. It refers to actions or conditions that cause physical damage to the roots of plants, which can negatively impact their health and survival. Understanding this term requires some knowledge of plant biology and environmental issues."},"example_sentences":[{"sentence":"Careless excavation can be very root-bruising to mature trees.","translation":"不注意な掘削は、成熟した木にとって非常に根を傷つける行為となりうる。","type":"adjective","meaning_category":"causing root damage"},{"sentence":"We need to avoid root-bruising when planting new saplings.","translation":"新しい苗木を植える際には、根を傷つけないようにする必要がある。","type":"adjective","meaning_category":"preventing root damage"}]}