{"word":"gravity-dependent","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"重力に依存する、重力の影響を受ける","english_definition":"Affected or determined by gravity; relying on gravity for its function or operation.","examples":[{"sentence":"The flow rate of the fluid is gravity-dependent.","translation":"その流体の流量は重力に依存する。"},{"sentence":"Some medical conditions are more pronounced in gravity-dependent positions, such as standing.","translation":"いくつかの病状は、立っているなど、重力の影響を受けやすい姿勢でより顕著になる。"},{"sentence":"Gravity-dependent drainage is used in some surgical procedures.","translation":"重力依存ドレナージは、いくつかの外科手術で使用される。"}],"collocations":["gravity-dependent drainage (重力依存ドレナージ)","gravity-dependent position (重力依存姿勢)","gravity-dependent edema (重力依存性浮腫)"],"synonyms":["gravity-related","gravity-influenced"],"antonyms":["gravity-independent","weightless"]},{"part_of_speech":"adjective","definition":"(医学)体位によって症状が変化する","english_definition":"(Medicine) Exhibiting symptoms or conditions that vary depending on the body's position relative to gravity.","examples":[{"sentence":"The patient's shortness of breath was gravity-dependent, worsening when lying flat.","translation":"その患者の息切れは体位によって変化し、仰向けになると悪化した。"}],"collocations":[],"synonyms":["positional","postural"],"antonyms":[]}],"etymology":{"value":"The word is formed by combining \"gravity\" (the force that attracts objects towards each other), \"dependent\" (relying on or being controlled by someone or something else), and connecting them with a hyphen.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌɡrævɪti dɪˈpɛndənt/","syllables":"grav-i-ty-de-pend-ent"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"The term \"gravity-dependent\" is often used in scientific and medical contexts to describe phenomena or conditions that are influenced by the force of gravity. In medicine, it can refer to symptoms or conditions that are more pronounced or only occur when a person is in a certain position relative to gravity.","priority":"☆☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["gravity","dependent","dependence"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term \"gravity-dependent\" is a technical term used in scientific and medical contexts to describe something that is affected or determined by gravity. It implies a direct relationship between gravity and the phenomenon being described. Understanding this term requires a good grasp of scientific concepts and vocabulary."},"example_sentences":[{"sentence":"The distribution of blood in the body is gravity-dependent.","translation":"体内の血液の分布は重力に依存する。","type":"general","meaning_category":"general"},{"sentence":"The experiment showed a gravity-dependent effect on cell growth.","translation":"その実験は、細胞の成長に対する重力依存効果を示した。","type":"scientific","meaning_category":"scientific"},{"sentence":"Gravity-dependent edema is a common symptom of venous insufficiency.","translation":"重力依存性浮腫は、静脈不全の一般的な症状である。","type":"medical","meaning_category":"medical"}]}