{"word":"conveyancer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"不動産譲渡人、不動産事務弁護士","english_definition":"A lawyer or licensed professional who specializes in the legal aspects of buying and selling property.","examples":[{"sentence":"The conveyancer handled all the legal paperwork for the property sale.","translation":"その不動産事務弁護士が物件売買に関するすべての法的手続きを処理しました。"},{"sentence":"It's important to choose a reliable conveyancer when buying a house.","translation":"家を購入する際には、信頼できる不動産事務弁護士を選ぶことが重要です。"}],"collocations":["instruct a conveyancer","hire a conveyancer","property conveyancer","licensed conveyancer"],"synonyms":["property lawyer","real estate attorney (US)","solicitor (UK, sometimes)"],"antonyms":[]}],"etymology":{"value":"The word 'conveyancer' comes from 'conveyance,' which refers to the transfer of property ownership. The suffix '-er' indicates a person who performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/kənˈveɪənsər/","syllables":"con-vey-anc-er"},"inflection":{"noun_plural":"conveyancers"},"usage_notes":{"explanation":"A conveyancer is a legal professional who specializes in the transfer of property ownership. They handle all the legal paperwork and processes involved in buying and selling property, ensuring that the transaction is legally sound and that the client's interests are protected. In some jurisdictions, conveyancing can be done by licensed conveyancers who are not necessarily lawyers, while in others, it is typically handled by solicitors or real estate attorneys.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need a conveyancer for my car.","correct":"✓ I need a lawyer for my car.","note":"Conveyancers deal with property, not vehicles."},{"incorrect":"✗ The conveyancer fixed my roof.","correct":"✓ The builder fixed my roof.","note":"Conveyancers handle legal paperwork, not property repairs."}],"priority":"★★☆"},"related_words":{"derivatives":["conveyance (noun: the transfer of property ownership)","convey (verb: to transfer or communicate something)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'conveyancer' refers to a legal professional who specializes in property law and the transfer of property ownership. They are responsible for handling the legal paperwork and processes involved in buying and selling property. This term is more commonly used in British English and legal contexts. Understanding the role of a conveyancer is important when dealing with real estate transactions."},"example_sentences":[{"sentence":"Our conveyancer ensured that all the legal requirements were met during the sale.","translation":"当社の不動産譲渡人は、販売中にすべての法的要件が満たされていることを確認しました。","type":"example","meaning_category":"General"},{"sentence":"The first step is to instruct a conveyancer to act on your behalf.","translation":"最初のステップは、あなたの代理として行動するように不動産譲渡人に指示することです。","type":"example","meaning_category":"Process"},{"sentence":"A good conveyancer will guide you through the complexities of property law.","translation":"優秀な不動産譲渡人は、不動産法の複雑さを案内してくれます。","type":"example","meaning_category":"Role"}]}