{"word":"noninferential","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"推論に基づかない、演繹的でない","english_definition":"Not based on inference; not involving or derived from inference.","examples":[{"sentence":"The data was presented in a noninferential manner, focusing solely on the observed facts.","translation":"データは推論に基づかない方法で提示され、観察された事実のみに焦点を当てていた。"},{"sentence":"A noninferential observation is one that is directly perceived without any intervening reasoning.","translation":"推論に基づかない観察とは、介在する推論なしに直接知覚されるものである。"}],"collocations":["noninferential knowledge","noninferential belief","noninferential observation","noninferential report"],"synonyms":["direct","immediate","observational","empirical"],"antonyms":["inferential","deductive","reasoned","conjectural"]}],"etymology":{"value":"'non-' (否定) + 'inferential' (推論に基づく)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnɪnfəˈrɛnʃəl/","syllables":"non-in-fer-en-tial"},"inflection":{},"usage_notes":{"explanation":"'Noninferential' describes something that is known or understood without needing to draw conclusions or make inferences. It contrasts with 'inferential,' which involves deriving new information from existing knowledge.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The conclusion was noninferential, so it was based on assumptions.","correct":"✓ The conclusion was inferential, so it was based on assumptions.","note":"Noninferential conclusions are based on direct observation, not assumptions."}],"priority":"★★★"},"related_words":{"derivatives":["noninference (noun): 推論しないこと"],"related_terms":["inference (noun): 推論","infer (verb): 推論する"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - Specialized or technical vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Noninferential' is a technical term primarily used in philosophy, epistemology, and some areas of cognitive science. It describes knowledge or beliefs that are directly perceived or known without requiring any reasoning or inference from other beliefs or evidence. Understanding this term requires familiarity with concepts of inference and epistemology."},"example_sentences":[{"sentence":"His testimony was considered noninferential because he reported only what he directly saw.","translation":"彼の証言は、直接見たことだけを報告していたため、推論に基づかないと見なされた。","type":"general","meaning_category":"推論に基づかない"},{"sentence":"Some philosophers argue that basic perceptual beliefs are noninferential.","translation":"一部の哲学者は、基本的な知覚的信念は推論に基づかないと主張している。","type":"academic","meaning_category":"推論に基づかない"}]}