{"word":"imperativamente","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"命令的に、断固として、強制的に","english_definition":"in an imperative manner; commandingly, forcefully, or obligatorily.","examples":[{"sentence":"El director habló imperativamente, exigiendo resultados inmediatos.","translation":"The director spoke imperatively, demanding immediate results. (取締役は命令的に話し、即時の結果を要求した。)","english_sentence":"The director spoke imperatively, demanding immediate results."},{"sentence":"La ley establece imperativamente que todos los ciudadanos deben pagar impuestos.","translation":"The law imperatively states that all citizens must pay taxes. (法律は、すべての市民が税金を支払わなければならないことを強制的に定めている。)","english_sentence":"The law imperatively states that all citizens must pay taxes."},{"sentence":"El médico le dijo imperativamente que dejara de fumar.","translation":"The doctor told him imperatively to stop smoking. (医者は彼に、タバコをやめるように断固として言った。)","english_sentence":"The doctor told him imperatively to stop smoking."}],"collocations":["hablar imperativamente (命令的に話す)","establecer imperativamente (強制的に定める)","decir imperativamente (断固として言う)"],"synonyms":["obligatoriamente","forzosamente","necesariamente","perentoriamente","dogmáticamente","autoritariamente"],"antonyms":["opcionalmente","voluntariamente","sugerentemente"]}],"etymology":{"value":"Derived from the Latin word 'imperativus', meaning 'relating to a command'.","priority":"★★☆"},"pronunciation":{"ipa":"/im.pe.ɾa.tiˈβa.men.te/","syllables":"im-pe-ra-ti-va-men-te"},"inflection":{"notes":"Adverbs in Spanish do not inflect."},"usage_notes":{"explanation":"'Imperativamente' is used to describe actions or statements that are expressed as a command or obligation. It indicates a sense of necessity or forcefulness. It is often used in formal contexts or when emphasizing the importance of following a rule or instruction.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Él sugirió imperativamente que deberíamos irnos.","correct":"Él sugirió de manera imperativa que deberíamos irnos.","note":"'Imperativamente' implies a command, not a suggestion. Use 'de manera imperativa' to correctly convey the manner of the suggestion."},{"incorrect":"Necesitamos imperativamente comprar comida.","correct":"Necesitamos comprar comida imperativamente. / Es imperativo que compremos comida.","note":"The placement of 'imperativamente' can affect the clarity. Placing it after the verb or using a construction with 'es imperativo' is often clearer."}],"priority":"★★☆"},"related_words":{"derivatives":["imperativo (adjective/noun)","imperar (verb)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Imperativamente' is an adverb that signifies that something is done in a commanding or obligatory manner. It's used to emphasize the necessity or force behind an action or statement. It is not a commonly used word and is more often found in formal or legal contexts."},"example_sentences":[{"sentence":"El jefe ordenó imperativamente que se terminara el proyecto antes del viernes.","translation":"The boss imperatively ordered that the project be finished before Friday.","type":"example","meaning_category":"commandingly"},{"sentence":"La señal de tráfico indica imperativamente la dirección a seguir.","translation":"The traffic sign imperatively indicates the direction to follow.","type":"example","meaning_category":"forcefully"},{"sentence":"La constitución establece imperativamente los derechos fundamentales de los ciudadanos.","translation":"The constitution imperatively establishes the fundamental rights of citizens.","type":"example","meaning_category":"obligatorily"}]}