{"word":"doggerelled","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"下手な詩で書かれた、下手な韻を踏んだ","english_definition":"written in poor, irregular verse; characterized by trivial, monotonous rhyme.","examples":[{"sentence":"The politician's speech was filled with doggerelled rhymes.","translation":"その政治家の演説は下手な韻を踏んだ詩で埋め尽くされていた。"},{"sentence":"He wrote a doggerelled poem for his friend's birthday.","translation":"彼は友人の誕生日に下手な詩を書いた。"}],"collocations":["doggerelled verse","doggerelled poem","doggerelled rhymes"],"synonyms":["crude","lousy","poor","inferior","bad","amateurish","inept"],"antonyms":["skilled","expert","professional","polished","refined","sophisticated"]}],"etymology":{"value":"doggerel + -ed. 'Doggerel' is from Middle English dogerel, of obscure origin.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdɒɡərəld/","syllables":"dog-ger-elled"},"inflection":{"notes":"This is the past participle form of the verb 'doggerel', used as an adjective."},"usage_notes":{"explanation":"'Doggerelled' is used to describe something written in doggerel, which refers to verse that is poorly written, often with irregular meter and forced or trivial rhymes. It implies a lack of skill or artistry in the writing.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doggerelled painting was amateurish.","correct":"✓ The amateurish painting was poorly executed.","note":"'Doggerelled' specifically refers to writing, particularly poetry or verse, not other forms of art like painting."},{"incorrect":"✗ The doggerelled speech moved the audience to tears.","correct":"✓ The sentimental speech moved the audience to tears.","note":"'Doggerelled' implies poor quality and lack of skill, so it would be contradictory to say it moved the audience deeply. A sentimental or emotional speech would be more appropriate if the intention is to convey that the speech was touching."}],"priority":"★★☆"},"related_words":{"derivatives":["doggerel (noun: poor, irregular verse)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Doggerelled' is a relatively uncommon word used to describe writing, especially poetry, that is of very poor quality, often characterized by forced rhymes and irregular meter. It is a critical term implying a lack of skill and artistry. This word is more likely to be encountered in literary criticism or discussions about writing style. Understanding the meaning of 'doggerel' is essential to understanding 'doggerelled'. "},"example_sentences":[{"sentence":"The play was interspersed with doggerelled songs that made the audience cringe.","translation":"その劇には下手な歌が散りばめられており、観客は身をすくませた。","type":"adjective","meaning_category":"poor verse"},{"sentence":"His doggerelled attempts at poetry were more amusing than artistic.","translation":"彼の下手な詩の試みは、芸術的というよりはむしろ面白かった。","type":"adjective","meaning_category":"poor verse"}]}