{"word":"Italo-Celtic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"インド・ヨーロッパ語族におけるイタリック語派とケルト語派に関連する、またはそれら両方を含む","english_definition":"Relating to or including both the Italic and Celtic branches of the Indo-European language family.","examples":[{"sentence":"The Italo-Celtic hypothesis suggests a common origin for these language groups.","translation":"イタロ・ケルト仮説は、これらの言語グループの共通の起源を示唆している。"}],"collocations":["Italo-Celtic languages","Italo-Celtic hypothesis"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"イタリック語派とケルト語派の共通の祖語を支持する仮説","english_definition":"The hypothetical common ancestor of the Italic and Celtic languages.","examples":[{"sentence":"The reconstruction of Proto-Italo-Celtic is a complex task.","translation":"原イタロ・ケルト語の再構築は複雑な作業である。"}],"collocations":["Proto-Italo-Celtic"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"\"Italo-\" (イタリック語派に関連する) + \"Celtic\" (ケルト語派に関連する)。この語は、イタリック語派とケルト語派が共通の祖先から派生したという言語学的仮説を指す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪtæloʊˈsɛltɪk/","syllables":"I-tal-o-Cel-tic"},"inflection":{},"usage_notes":{"explanation":"イタロ・ケルトという用語は、イタリック語派（ラテン語、オスク語、ウンブリア語などを含む）とケルト語派（アイルランド語、ウェールズ語、ブルトン語などを含む）が、インド・ヨーロッパ語族の中で特に密接な関係にあるという言語学的仮説に関連して使用されます。この仮説は、これらの語派が共通の祖語（原イタロ・ケルト語）から派生した可能性を示唆しています。ただし、この仮説は言語学者の間で広く受け入れられているわけではなく、議論の余地があります。","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Italic","Celtic","Indo-European"],"related_terms":["Proto-Italo-Celtic","Italo-Celtic hypothesis"]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The term \"Italo-Celtic\" is a specialized term used in linguistics to refer to the proposed relationship between the Italic and Celtic language families. It is typically encountered in academic discussions of Indo-European linguistics and is not commonly used in general conversation."},"example_sentences":[{"sentence":"Some linguists support the Italo-Celtic theory based on shared vocabulary and grammatical features.","translation":"一部の言語学者は、共有された語彙と文法的な特徴に基づいて、イタロ・ケルト理論を支持している。","type":"general","meaning_category":"linguistics"},{"sentence":"The existence of a common Proto-Italo-Celtic language is still a matter of debate among scholars.","translation":"共通の原イタロ・ケルト語の存在は、学者たちの間で依然として議論の的となっている。","type":"academic","meaning_category":"linguistics"}]}