{"word":"supply-side","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"サプライサイドの、供給側の","english_definition":"relating to the supply side of economics, which focuses on factors that increase the productive capacity of an economy","examples":[{"sentence":"Supply-side economics emphasizes tax cuts and deregulation to stimulate production.","translation":"サプライサイド経済学は、生産を刺激するために減税と規制緩和を重視します。"},{"sentence":"The government's supply-side policies aim to boost economic growth.","translation":"政府のサプライサイド政策は、経済成長を促進することを目的としています。"}],"collocations":["supply-side economics","supply-side policies","supply-side reforms","supply-side stimulus"],"synonyms":["production-oriented","growth-focused"],"antonyms":["demand-side"],"related_terms":["Laffer curve","tax cuts","deregulation","economic growth","productivity"]}],"etymology":{"value":"The term 'supply-side' emerged in the late 1970s and early 1980s, referring to economic theories that prioritize the supply of goods and services as the key driver of economic growth.","priority":"★★☆"},"pronunciation":{"ipa":"/səˈplaɪ saɪd/","syllables":"sup-ply-side"},"inflection":{"notes":"It is an adjective and does not have different forms."},"usage_notes":{"explanation":"'Supply-side' economics focuses on creating an environment that encourages businesses to produce more goods and services. This is often achieved through measures such as tax cuts, deregulation, and investments in education and infrastructure. The theory suggests that increasing the supply of goods and services will lead to lower prices, increased employment, and overall economic growth. It is often contrasted with demand-side economics, which emphasizes government spending and policies to stimulate demand.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The supply-side is a demand-side.","correct":"✓ The supply-side is different from the demand-side.","note":"Supply-side and demand-side are contrasting economic approaches."},{"incorrect":"✗ Supply-side only focuses government spending.","correct":"✓ Supply-side focuses on tax cuts and deregulation.","note":"Supply-side primarily emphasizes reducing taxes and regulations."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_concepts":["fiscal policy","monetary policy","economic theory","macroeconomics"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in economic and political contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'supply-side' is used in economics to describe policies that aim to increase the production of goods and services. This is often done by reducing taxes and regulations for businesses. It's a more advanced economic concept, so you'll typically encounter it in discussions about economic policy or in academic texts on economics. Understanding this term requires some familiarity with basic economic principles.","priority":"★★☆"},"example_sentences":[{"sentence":"The politician advocated for supply-side reforms to boost the economy.","translation":"その政治家は経済を活性化させるためにサプライサイド改革を提唱しました。","type":"general","meaning_category":"economic policy"},{"sentence":"Critics argue that supply-side policies primarily benefit the wealthy.","translation":"批判者たちは、サプライサイド政策は主に富裕層に利益をもたらすと主張しています。","type":"critical","meaning_category":"economic debate"}]}