{"word":"tantalizer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"焦らし屋、じらす人、おあずけを食わせる人","english_definition":"A person or thing that tantalizes; someone or something that teases or excites desire but remains unobtainable or unavailable.","examples":[{"sentence":"She's such a tantalizer; she always talks about her exciting plans but never follows through.","translation":"彼女は本当に焦らし屋だ。いつもワクワクするような計画を話すけど、決して実行しない。"},{"sentence":"The aroma of the freshly baked bread was a tantalizer, making everyone hungry.","translation":"焼きたてのパンの香りは焦らしだった。みんながお腹を空かせた。"}],"collocations":["a master tantalizer (熟練した焦らし屋)","a food tantalizer (食欲をそそるもの)"],"synonyms":["teaser","tempter","tormenter","provoker","seducer"],"antonyms":["satisfier","appeaser"]},{"part_of_speech":"noun","definition":"(演劇)幕の前に下ろされる短いカーテン","english_definition":"(theater) A short curtain hung just behind the proscenium arch to adjust the height of the opening.","examples":[{"sentence":"The tantalizer was lowered to create a more intimate setting for the scene.","translation":"場面をより親密なものにするために、タンタライザーが下げられた。"}],"collocations":["lower the tantalizer (タンタライザーを下げる)","raise the tantalizer (タンタライザーを上げる)"],"synonyms":["border","teaser"],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'tantalize,' which comes from the Greek mythological figure Tantalus. Tantalus was punished by the gods by being made to stand in a pool of water under a fruit tree, with the water and fruit always just out of his reach.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtæntəlaɪzər/","syllables":"tan-ta-li-zer"},"inflection":{"noun_plural":"tantalizers"},"usage_notes":{"explanation":"The word 'tantalizer' primarily refers to a person or thing that excites desire or hope but then frustrates it by remaining out of reach. It can also refer to a theatrical curtain used to adjust the stage opening. The meaning is closely tied to the verb 'tantalize,' which describes the act of teasing or tormenting someone in this way.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a good satisfier, not a tantalizer.","correct":"✓ He was a good satisfier, not a tantalizer.","note":"This example is correct. 'Satisfier' is the antonym of 'tantalizer.'"},{"incorrect":"✗ The tantalizer was used to satisfy the audience's curiosity.","correct":"✓ The teaser was used to pique the audience's curiosity.","note":"'Tantalizer' refers to something that frustrates desire, not satisfies it. In the context of theater, 'teaser' is a more appropriate term for a curtain that hints at what's to come."}],"priority":"★☆☆"},"related_words":{"derivatives":["tantalize (verb: to tease or torment by presenting something desirable but keeping it out of reach)","tantalizing (adjective: arousing desire or expectation but remaining unobtainable)","tantalization (noun: the act of tantalizing or the state of being tantalized)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tantalizer' is a relatively uncommon word that describes someone or something that teases or excites desire but remains unobtainable. It is derived from the verb 'tantalize,' which is more commonly used. The word is often used in literary or descriptive contexts to convey a sense of frustration or unfulfilled longing. It can also refer to a theatrical term for a curtain used to adjust the stage opening, but this usage is less common. Understanding the etymology of the word, which relates to the Greek myth of Tantalus, can help to grasp its meaning.","priority":"★☆☆"},"example_sentences":[{"sentence":"The promise of a promotion, which never materialized, was a cruel tantalizer.","translation":"決して実現しなかった昇進の約束は、残酷な焦らしだった。","type":"noun","meaning_category":"焦らし屋・じらす人"},{"sentence":"As a stagehand, he was responsible for adjusting the tantalizer before each act.","translation":"舞台係として、彼は各幕の前にタンタライザーを調整する責任があった。","type":"noun","meaning_category":"演劇用語 (カーテン)"}]}