{"word":"interknowledge","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"相互知識、共通認識、互いの知識についての知識","english_definition":"Mutual knowledge; knowledge that is shared and known to be shared by two or more people.","examples":[{"sentence":"The success of the project depended on the interknowledge of the team members.","translation":"プロジェクトの成功は、チームメンバー間の相互知識にかかっていた。"},{"sentence":"Effective communication requires a certain level of interknowledge between the speakers.","translation":"効果的なコミュニケーションには、話者間の一定レベルの共通認識が必要である。"},{"sentence":"The shared cultural background provided a strong foundation of interknowledge.","translation":"共有された文化的背景は、相互知識の強固な基盤を提供した。"}],"collocations":["shared interknowledge","common interknowledge","establish interknowledge","lack of interknowledge"],"synonyms":["mutual understanding","common ground","shared knowledge","common knowledge","shared awareness"],"antonyms":["misunderstanding","lack of awareness","ignorance"]},{"part_of_speech":"noun","definition":"（哲学、認識論において）相互に知識を持っていることの認識","english_definition":"(In philosophy, epistemology) The recognition of having mutual knowledge.","examples":[{"sentence":"The philosophical debate centered on the problem of interknowledge and its implications for social interaction.","translation":"哲学的な議論は、相互知識の問題とそれが社会的な相互作用に与える影響を中心に展開された。"},{"sentence":"Establishing interknowledge is crucial for building trust in collaborative environments.","translation":"相互知識を確立することは、共同環境で信頼を築くために重要である。"}],"collocations":["epistemic interknowledge","philosophical interknowledge"],"synonyms":["metaknowledge","recursive knowledge"],"antonyms":["lack of epistemic awareness"]}],"etymology":{"value":"'Inter-' (between, among) + 'knowledge' (facts, information, and skills acquired through experience or education).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪntərˈnɒlɪdʒ/","syllables":"in-ter-nol-edge"},"inflection":{"noun_plural":"interknowledges"},"usage_notes":{"explanation":"'Interknowledge' refers to the understanding that two or more people share the same knowledge and are aware that they share it. It is crucial for effective communication, collaboration, and building trust. In philosophy and epistemology, it is a concept related to metaknowledge and the recursive nature of understanding each other's knowledge.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The interknowledge between the students was very high because they studied together.","correct":"✓ The interknowledge among the students was very high because they studied together.","note":"Use 'among' when referring to more than two individuals. 'Between' is generally used for two entities."},{"incorrect":"✗ They had a good interknowledge with each other.","correct":"✓ They had good interknowledge of each other's fields.","note":"'Interknowledge' refers to the shared knowledge itself, not the relationship. Specify what the interknowledge pertains to."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrases":["common ground","shared understanding","mutual awareness"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. More common in academic or philosophical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Interknowledge' is a term that describes the understanding that multiple people not only know something, but they also know that others know it too. This is important for teamwork and communication because it helps people work together more effectively when they share a common understanding of the situation. It's a concept often discussed in philosophy and social sciences.","priority":"★★★"},"example_sentences":[{"sentence":"The success of the negotiation depended on the parties' interknowledge of each other's positions.","translation":"交渉の成功は、当事者間がお互いの立場について相互知識を持っているかにかかっていた。","type":"noun","meaning_category":"mutual understanding"},{"sentence":"Building a strong team requires fostering interknowledge among its members.","translation":"強力なチームを構築するには、メンバー間の相互知識を育成する必要がある。","type":"noun","meaning_category":"shared knowledge"},{"sentence":"The lack of interknowledge between departments led to miscommunication and delays.","translation":"部門間の相互知識の欠如は、コミュニケーションの誤りや遅延につながった。","type":"noun","meaning_category":"lack of awareness"},{"sentence":"In philosophy, interknowledge is a key concept for understanding social cognition.","translation":"哲学において、相互知識は社会的認知を理解するための重要な概念である。","type":"noun","meaning_category":"epistemology"}]}