{"word":"martyrologistic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"殉教者伝的な、殉教者録的な","english_definition":"Relating to or characteristic of a martyrology or the style of writing found in martyrologies; presenting a narrative in a way that emphasizes suffering and martyrdom.","examples":[{"sentence":"The historian adopted a martyrologistic approach to depicting the events.","translation":"歴史家は、出来事を描写するために殉教者録的なアプローチを採用した。"},{"sentence":"The film has a martyrologistic tone, focusing on the sacrifices made by the characters.","translation":"その映画は殉教者伝的なトーンで、登場人物たちの犠牲に焦点を当てている。"}],"collocations":["martyrologistic account","martyrologistic narrative","martyrologistic tone","martyrologistic style"],"synonyms":["hagiographic","heroic","sacrificial"],"antonyms":["unbiased","objective","impartial"]}],"etymology":{"value":"Derived from 'martyrology,' which comes from Late Latin 'martyrologium,' a list or register of martyrs. The suffix '-istic' indicates a characteristic or relation to something.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɑːrtɪrəˈlɒdʒɪstɪk/","syllables":"mar-tyr-o-log-is-tic"},"inflection":{"notes":"Adjectives do not typically inflect in English, beyond comparative and superlative forms (though these are uncommon for 'martyrologistic')."},"usage_notes":{"explanation":"'Martyrologistic' is used to describe something that resembles or pertains to a martyrology, particularly in its focus on the suffering and sacrifices of martyrs or heroes. It often implies a biased or emotionally charged presentation of events.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The martyrologistic novel was a true story.","correct":"✓ The novel, written in a martyrologistic style, was based on a true story.","note":"'Martyrologistic' describes the style or approach, not the veracity of the story itself."}],"priority":"★☆☆"},"related_words":{"derivatives":["martyr","martyrdom","martyrology"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Martyrologistic' is a specialized term used in historical, literary, or religious contexts to describe narratives that emphasize the suffering and sacrifices of individuals, often in a way that evokes strong emotions or glorifies their actions. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The author's martyrologistic portrayal of the protagonist made him seem almost unrealistically virtuous.","translation":"著者による主人公の殉教者録的な描写は、彼を非現実的なほど道徳的に優れた人物に見させた。","type":"general","meaning_category":"general"},{"sentence":"The film's martyrologistic approach to the war glossed over the complexities of the conflict.","translation":"その映画の戦争に対する殉教者録的なアプローチは、紛争の複雑さを覆い隠した。","type":"general","meaning_category":"general"}]}