{"word":"plugtray","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A tray with multiple cells, each containing a small amount of growing medium, used for starting seeds or rooting cuttings.","english_definition":"A tray with multiple cells, each containing a small amount of growing medium, used for starting seeds or rooting cuttings.","examples":[{"sentence":"The seedlings were grown in a plugtray before being transplanted to the garden.","translation":"苗は庭に移植される前に、プラグトレイで育てられました。"},{"sentence":"Using a plugtray allows for efficient use of space in the greenhouse.","translation":"プラグトレイを使用すると、温室のスペースを効率的に使用できます。"}],"collocations":["seedling plugtray","propagation plugtray","transplant plugtray"],"synonyms":["seed tray","seedling tray","propagation tray"],"antonyms":[]}],"etymology":{"value":"The term 'plugtray' is a compound word derived from 'plug', referring to the small, self-contained unit of growing medium containing a seedling or cutting, and 'tray', referring to the container holding multiple plugs.","priority":"N/A"},"pronunciation":{"ipa":"/plʌɡtreɪ/","syllables":"plug-tray"},"inflection":{"noun_plural":"plugtrays"},"usage_notes":{"explanation":"A plugtray is a specialized type of seed tray designed to hold individual 'plugs' of growing medium. This allows for easy handling and transplanting of seedlings or cuttings with minimal root disturbance. Plugtrays are commonly used in commercial horticulture and gardening.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ I planted the seeds directly in the ground instead of using a plugtray.","correct":"✓ I planted the seeds directly in the ground instead of using a plugtray.","note":"No common mistakes were identified, but users may confuse it with other types of seed trays."}],"priority":"N/A"},"related_words":{"derivatives":["plug (noun): A small, self-contained unit of growing medium containing a seedling or cutting.","tray (noun): A flat container used for holding or carrying items."],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Specialized horticultural term.","priority":"N/A"},"readability_explanation":{"level":"B2","text":"The term 'plugtray' is a specialized term used in gardening and horticulture. It refers to a tray that holds multiple individual cells, each containing a 'plug' of growing medium. These trays are used for starting seeds or rooting cuttings, providing a convenient way to manage and transplant young plants. Understanding this term requires some familiarity with gardening practices.","priority":"N/A"},"example_sentences":[{"sentence":"The nursery uses plugtrays to propagate a wide variety of plants.","translation":"その苗床では、プラグトレイを使って多種多様な植物を繁殖させています。","type":"noun","meaning_category":"horticulture"},{"sentence":"After the seeds germinate, the seedlings are transferred from the plugtray to larger pots.","translation":"種子が発芽した後、苗はプラグトレイからより大きな鉢に移されます。","type":"noun","meaning_category":"horticulture"}]}