{"word":"footnoted","priority":"★☆☆","meanings":[{"part_of_speech":"verb (past participle)","definition":"脚注を付けられた","english_definition":"having a footnote or footnotes added.","examples":[{"sentence":"The essay was heavily footnoted, with sources cited for every claim.","translation":"そのエッセイは、すべての主張に対して出典が引用され、多くの脚注が付けられていた。"},{"sentence":"A footnoted reference provides additional information without disrupting the main text.","translation":"脚注付きの参照は、本文を中断することなく追加情報を提供する。"}],"collocations":["heavily footnoted","extensively footnoted","carefully footnoted"],"synonyms":["annotated","referenced","cited"],"antonyms":["unreferenced","uncited"]},{"part_of_speech":"adjective","definition":"脚注付きの","english_definition":"containing footnotes.","examples":[{"sentence":"The footnoted edition of the book included valuable commentary.","translation":"脚注付き版の本には、貴重な解説が含まれていた。"},{"sentence":"A footnoted document allows readers to easily verify the sources of information.","translation":"脚注付きのドキュメントにより、読者は情報の出典を簡単に確認できる。"}],"collocations":["footnoted edition","footnoted document","footnoted text"],"synonyms":["annotated","referenced","cited"],"antonyms":["unreferenced","uncited"]}],"etymology":{"value":"The word \"footnoted\" comes directly from the verb \"footnote,\" which originated in the late 19th century. It is formed by combining \"foot\" (referring to the bottom of a page) and \"note\" (a piece of information).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfʊtˌnoʊtɪd/","syllables":"foot-not-ed"},"inflection":{"verb_forms":{"present_simple":["footnote","footnotes"],"past_simple":"footnoted","past_participle":"footnoted","present_participle":"footnoting"}},"usage_notes":{"explanation":"\"Footnoted\" is primarily used as the past participle of the verb \"footnote,\" meaning to add a footnote to a text. It can also function as an adjective to describe something that contains footnotes. Footnotes are typically used to provide additional information, cite sources, or offer commentary without interrupting the flow of the main text.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The book was footnoted with many pictures.","correct":"✓ The book was footnoted with many citations.","note":"Footnotes typically contain citations, references, or additional information, not pictures. Use \"illustrated\" if the book contains pictures."},{"incorrect":"✗ He footnoted the information in the text.","correct":"✓ He footnoted the text with the information.","note":"The correct structure is \"footnote the text with the information\" or \"footnote the information in the text.\""}],"priority":"★★☆"},"related_words":{"derivatives":["footnote (noun): a note placed at the bottom of a page in a book or document.","footnote (verb): to add a footnote to (a text)."],"phrasal_verbs":[],"related_terms":["endnote (noun): a note placed at the end of a chapter, book, or document.","citation (noun): a quotation from or reference to a book, paper, or author, especially in a scholarly work."]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"footnoted\" is generally used in academic or formal writing contexts. It indicates that a text has footnotes, which are notes placed at the bottom of a page to provide additional information, citations, or commentary. Understanding this word is essential for comprehending scholarly articles, research papers, and other types of formal documents.","priority":"★★☆"},"example_sentences":[{"sentence":"The research paper was carefully **footnoted** to give credit to all sources.","translation":"その研究論文は、すべての出典に敬意を表するために、注意深く脚注が付けられていた。","type":"verb (past participle)","meaning_category":"脚注を付けられた"},{"sentence":"The **footnoted** version of the document included detailed explanations of the methodology.","translation":"脚注付き版のドキュメントには、方法論の詳細な説明が含まれていた。","type":"adjective","meaning_category":"脚注付きの"},{"sentence":"All sources must be properly **footnoted** to avoid plagiarism.","translation":"盗用を避けるために、すべての出典を適切に脚注で示す必要がある。","type":"verb (past participle)","meaning_category":"脚注を付けられた"}]}