{"word":"Ardeae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"カモ目サギ亜科に属する鳥類の分類群","english_definition":"A taxonomic group of birds belonging to the heron subfamily of the order Pelecaniformes (or sometimes Ciconiiformes).","examples":[{"sentence":"The Ardeae include herons, egrets, and bitterns.","translation":"Ardeaeには、サギ、シラサギ、ヨシゴイなどが含まれます。"}],"collocations":["Ardeae species","Ardeae habitat","Ardeae behavior"],"synonyms":["herons","egrets","bitterns"],"antonyms":[]}],"etymology":{"value":"New Latin, from Ardea (the genus of typical herons) + -eae (standard suffix for subfamilies). Ardea itself comes from Latin ardea, meaning heron.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɑːrdiˌiː/","syllables":"Ar-de-ae"},"inflection":{"noun_plural":"N/A (taxonomic name)"},"usage_notes":{"explanation":"Ardeae is a scientific term used in biology to classify a specific group of birds. It is most commonly encountered in ornithological contexts or scientific literature.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Ardeae is a heron.","correct":"✓ An Ardeae is a heron. / ✓ Ardeae are herons.","note":"Ardeae is a taxonomic group containing multiple species. When referring to a single member, use 'An Ardeae'. When referring to the group in general, use the plural form 'Ardeae are'."}],"priority":"★☆☆"},"related_words":{"derivatives":["Ardea (genus)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ardeae' is a scientific term used to classify a specific group of birds, including herons, egrets, and bitterns. It is primarily used in scientific or ornithological contexts. Understanding this term requires a background in biology or a specific interest in birds.","priority":"★★☆"},"example_sentences":[{"sentence":"The study focused on the foraging behavior of various Ardeae species in the wetland.","translation":"その研究は、湿地におけるさまざまなArdeae種の採餌行動に焦点を当てた。","type":"noun","meaning_category":"Taxonomy"},{"sentence":"Conservation efforts are crucial to protect the habitats of Ardeae around the world.","translation":"世界中のArdeaeの生息地を保護するためには、保護活動が不可欠である。","type":"noun","meaning_category":"Ecology"}]}