{"word":"Ronsardist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ロンスール派の詩人、またはロンスール派の信奉者","english_definition":"A poet belonging to, or a follower of, the Pléiade, a group of 16th-century French Renaissance poets led by Pierre de Ronsard.","examples":[{"sentence":"He was a Ronsardist, deeply influenced by the classical ideals of the Pléiade.","translation":"彼はロンスール派の詩人で、プレイヤード派の古典的な理想に深く影響を受けていた。"}],"collocations":["Ronsardist poetry","Ronsardist ideals","a devoted Ronsardist"],"synonyms":["Pléiade poet","French Renaissance poet"],"antonyms":[]},{"part_of_speech":"adjective","definition":"ロンスール派の、ロンスール派に特徴的な","english_definition":"Relating to or characteristic of the Pléiade or their poetry.","examples":[{"sentence":"The painting had a Ronsardist quality, evoking a sense of classical beauty and elegance.","translation":"その絵画はロンスール派的な質を持ち、古典的な美と優雅さを呼び起こした。"},{"sentence":"Ronsardist themes of love and nature are prevalent in his early works.","translation":"彼の初期の作品には、愛と自然というロンスール派のテーマが広く見られる。"}],"collocations":["Ronsardist style","Ronsardist themes","Ronsardist influence"],"synonyms":["Pléiade","Renaissance"],"antonyms":[]}],"etymology":{"value":"From Pierre de Ronsard (1524-1585), the leading poet of the Pléiade, + -ist.","priority":"★★★"},"pronunciation":{"ipa":"/ˈrɒnsərdɪst/","syllables":"Ron-sard-ist"},"inflection":{"noun_plural":"Ronsardists"},"usage_notes":{"explanation":"The term 'Ronsardist' refers specifically to the poets and followers of the Pléiade, a group of 16th-century French poets who sought to emulate classical Greek and Roman literature. Their poetry often focused on themes of love, beauty, nature, and the passage of time.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Renaissance poet, so he is a Shakespearean.","correct":"✓ He is a Renaissance poet, so he is a Ronsardist.","note":"Shakespeare was an English Renaissance poet, while Ronsard was a French Renaissance poet. The term 'Ronsardist' is specific to the French Pléiade. Shakespearean is related to Shakespeare."}],"priority":"★★☆"},"related_words":{"derivatives":["Ronsardism (noun: the principles and style of the Pléiade)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Ronsardist' is a specialized term used in the context of French Renaissance literature. It refers to poets and followers of the Pléiade, a group led by Pierre de Ronsard. Understanding this term requires familiarity with French literary history and the specific characteristics of the Pléiade's poetry. It is not commonly used outside of academic or literary discussions.","priority":"★★★"},"example_sentences":[{"sentence":"As a committed Ronsardist, she dedicated her life to studying the works of the Pléiade.","translation":"熱心なロンスール派として、彼女はプレイヤード派の作品の研究に生涯を捧げた。","type":"noun","meaning_category":"ロンスール派の詩人・信奉者"},{"sentence":"The professor lectured on the Ronsardist influence in 16th-century French poetry.","translation":"教授は16世紀フランス詩におけるロンスール派の影響について講義した。","type":"adjective","meaning_category":"ロンスール派の"}]}