{"word":"Pinolia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Rare) A type of pine nut, especially those from the Italian stone pine (Pinus pinea).","english_definition":"A type of pine nut, especially those from the Italian stone pine (Pinus pinea).","examples":[{"sentence":"The recipe calls for pinolia, but regular pine nuts will work as a substitute.","translation":"レシピではピノリアを使うことになっていますが、普通の松の実でも代用できます。"},{"sentence":"Pinolia are prized for their delicate flavor and creamy texture.","translation":"ピノリアは、その繊細な風味とクリーミーな食感で珍重されています。"}],"collocations":["Italian pinolia","use pinolia","pinolia nuts"],"synonyms":["pine nut","pignoli"],"antonyms":[]}],"etymology":{"value":"Derived from the Italian word 'pinolo', meaning 'pine nut'.","priority":"★★★"},"pronunciation":{"ipa":"/pɪˈnoʊliə/","syllables":"pi-no-li-a"},"inflection":{"noun_plural":"pinolias"},"usage_notes":{"explanation":"'Pinolia' is a less common term, with 'pine nut' or 'pignoli' being more widely used. It specifically refers to pine nuts, particularly those from the Italian stone pine.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought pinolias for the pesto, but they were almonds.","correct":"✓ I bought pine nuts for the pesto, but they were almonds.","note":"Pinolia are a specific type of pine nut, not a general term for nuts."}],"priority":"★★☆"},"related_words":{"derivatives":["pinolic acid (a fatty acid found in pine nuts)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Pinolia' is a relatively uncommon term, mostly used in culinary contexts when referring specifically to pine nuts from the Italian stone pine. Understanding this term requires familiarity with specific types of nuts and Italian culinary vocabulary."},"example_sentences":[{"sentence":"Authentic pesto Genovese often includes pinolia for a richer flavor.","translation":"本格的なジェノベーゼペストには、より豊かな風味のためにピノリアが含まれていることが多いです。","type":"noun","meaning_category":"type of pine nut"},{"sentence":"The chef insisted on using only the highest quality pinolia in his dishes.","translation":"シェフは料理に最高品質のピノリアのみを使用することを主張しました。","type":"noun","meaning_category":"type of pine nut"}]}