{"word":"Resonators","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)共振器、共鳴体","english_definition":"plural of resonator: A device or system that exhibits resonance or resonant behavior.","examples":[{"sentence":"The circuit uses several resonators to filter out unwanted frequencies.","translation":"その回路は、不要な周波数をフィルタリングするためにいくつかの共振器を使用しています。"},{"sentence":"Acoustic resonators are used in musical instruments to amplify sound.","translation":"音響共振器は、楽器で音を増幅するために使用されます."}],"collocations":["acoustic resonators (音響共振器)","optical resonators (光共振器)","quartz resonators (水晶共振器)","microwave resonators (マイクロ波共振器)"],"synonyms":["oscillators","vibrators","amplifiers"],"antonyms":["dampers","absorbers"]}],"etymology":{"value":"The word 'resonator' comes from 'resonate,' which is derived from the Latin 'resonare,' meaning 'to resound.' The suffix '-or' indicates a device or agent that performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrɛzəneɪtərz/","syllables":"re-so-na-tors"},"inflection":{"noun_plural":"Resonators"},"usage_notes":{"explanation":"'Resonators' refers to multiple devices or systems designed to exhibit resonance. Resonance occurs when a system is driven at its natural frequency, leading to amplified oscillations. Resonators are used in a wide variety of applications, from electronics and acoustics to optics and mechanics. The specific properties and design of a resonator depend on its application.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The resonator are used in the circuit.","correct":"✓ The resonators are used in the circuit.","note":"Since 'resonators' is plural, the verb should also be plural ('are')."},{"incorrect":"✗ He designed a resonator, but he needs more resonator.","correct":"✓ He designed a resonator, but he needs more resonators.","note":"When referring to multiple resonators, use the plural form."}],"priority":"★★☆"},"related_words":{"derivatives":["Resonate (verb): to produce or exhibit resonance.","Resonance (noun): the condition of exhibiting enhanced oscillation.","Resonant (adjective): exhibiting resonance.","Resonantly (adverb): in a resonant manner."],"related_terms":["oscillator","filter","amplifier","cavity","frequency","wavelength","mode"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Resonators' is a technical term generally encountered in scientific or engineering contexts. It refers to multiple devices that exhibit resonance, a phenomenon where a system oscillates with greater amplitude at specific frequencies. Understanding this term requires some familiarity with physics or engineering principles related to oscillations and waves. The word is commonly used in discussions about electronics, acoustics, and optics."},"example_sentences":[{"sentence":"The design of the optical resonators is critical for laser performance.","translation":"レーザーの性能にとって、光共振器の設計は非常に重要です。","type":"noun","meaning_category":"共振器"},{"sentence":"These quartz resonators provide highly stable frequency references.","translation":"これらの水晶共振器は、非常に安定した周波数基準を提供します。","type":"noun","meaning_category":"共振器"},{"sentence":"The acoustic resonators in the instrument enhance the sound's richness.","translation":"楽器の音響共振器は、音の豊かさを高めます。","type":"noun","meaning_category":"共振器"}]}