{"word":"protein-linked","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"タンパク質に結合した、タンパク質が結合している","english_definition":"Attached or bound to a protein.","examples":[{"sentence":"The drug is protein-linked in the bloodstream.","translation":"その薬は血流中でタンパク質に結合している。"},{"sentence":"Protein-linked carbohydrates are important for cell signaling.","translation":"タンパク質に結合した炭水化物は細胞シグナル伝達に重要である。"}],"collocations":["protein-linked drug","protein-linked carbohydrate","protein-linked molecule"],"synonyms":["protein-bound","conjugated to protein"],"antonyms":["free","unbound"]},{"part_of_speech":"adjective","definition":"タンパク質と結合している状態の","english_definition":"Being in a state of being linked to a protein.","examples":[{"sentence":"The protein-linked form of the enzyme is more active.","translation":"その酵素のタンパク質結合型はより活性が高い。"}],"collocations":["protein-linked form","protein-linked state"],"synonyms":["protein-bound","protein-conjugated"],"antonyms":["unlinked","unconjugated"]}],"etymology":{"value":"Derived from the combination of 'protein' and 'linked', indicating a connection or bond to a protein molecule.","priority":"★★★"},"pronunciation":{"ipa":"ˈproʊtiːnˌlɪŋkt","syllables":"pro-tein-linked"},"inflection":{"notes":"This is an adjective, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Protein-linked' is typically used in scientific and technical contexts, particularly in biochemistry, molecular biology, and pharmacology. It describes a molecule or substance that has a direct physical association with a protein. This linkage can be covalent (a strong chemical bond) or non-covalent (weaker interactions). The term is often used to describe how drugs, hormones, or other molecules are transported in the body or how they interact with cellular components.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The protein-linked with the drug.","correct":"The drug is protein-linked.","note":"'Protein-linked' is an adjective, so it should be used to describe a noun (e.g., 'drug'). Avoid using it as a verb."}],"priority":"★★☆"},"related_words":{"derivatives":["protein","link","linked","protein binding"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'protein-linked' is a technical term used in scientific fields such as biochemistry and molecular biology. It indicates that a molecule or substance is attached or bound to a protein. Understanding this term requires a background in these scientific areas, as it is not commonly used in everyday language."},"example_sentences":[{"sentence":"The study investigated the effects of protein-linked modifications on enzyme activity.","translation":"その研究では、タンパク質結合修飾が酵素活性に与える影響を調査した。","type":"general","meaning_category":"タンパク質に結合した"},{"sentence":"The protein-linked nanoparticles were used for targeted drug delivery.","translation":"タンパク質結合ナノ粒子は、標的薬物送達に使用された。","type":"general","meaning_category":"タンパク質が結合している"}]}