{"word":"vicaress","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"女子修道院長代理、副女子修道院長","english_definition":"A woman who acts in the place of a prioress or abbess; the deputy of a female superior in a religious order.","examples":[{"sentence":"The vicaress oversaw the daily operations of the convent in the abbess's absence.","translation":"女子修道院長代理は、女子修道院長の不在中、修道院の日常業務を監督した。"},{"sentence":"As vicaress, she was responsible for maintaining discipline among the nuns.","translation":"女子修道院長代理として、彼女は修道女たちの規律を維持する責任があった。"}],"collocations":["appointed vicaress","acting vicaress","deputy vicaress"],"synonyms":["deputy abbess","subprioress","assistant prioress"],"antonyms":["abbess","prioress"]}],"etymology":{"value":"From 'vicar' + '-ess'. The term 'vicar' comes from Latin 'vicarius', meaning 'substitute' or 'deputy'. The suffix '-ess' is used to denote a female equivalent.","priority":"★★★"},"pronunciation":{"ipa":"/vɪˈkɛrɪs/","syllables":"vi-car-ess"},"inflection":{"noun_plural":"vicaresses"},"usage_notes":{"explanation":"The term 'vicaress' is specifically used in religious contexts, particularly within Christian monastic orders. It refers to a woman who holds a position of authority and responsibility, acting as a substitute or deputy for the abbess or prioress. The role involves overseeing the daily operations of the convent, maintaining discipline, and providing spiritual guidance to the nuns.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She was the vicaress of the monastery.","correct":"✓ She was the vicaress of the convent.","note":"'Vicaress' applies to female religious orders (convents), not male orders (monasteries)."},{"incorrect":"✗ He was appointed as vicaress.","correct":"✓ She was appointed as vicaress.","note":"'Vicaress' is a female term."}],"priority":"★★☆"},"related_words":{"derivatives":["vicar","vicarious","viceroy","vicereine"],"related_terms":["abbess","prioress","nun","convent","monastery"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'vicaress' is a relatively rare and specialized term used within the context of Christian monastic orders. It refers to a woman who serves as a deputy or substitute for the abbess or prioress in a convent. Understanding the term requires familiarity with religious hierarchies and terminology. The word is not commonly encountered in everyday conversation or general reading materials.","priority":"★★☆"},"example_sentences":[{"sentence":"The vicaress led the prayers in the chapel.","translation":"女子修道院長代理は礼拝堂で祈りを先導した。","type":"noun","meaning_category":"religious leadership"},{"sentence":"During the abbess's illness, the vicaress took over her duties.","translation":"女子修道院長の病気の間、女子修道院長代理が彼女の職務を引き継いだ。","type":"noun","meaning_category":"deputy role"},{"sentence":"The new vicaress was known for her wisdom and compassion.","translation":"新しい女子修道院長代理は、その知恵と慈悲深さで知られていた。","type":"noun","meaning_category":"character trait"}]}