{"word":"unlethally","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"致死的でない方法で、致命的でないように","english_definition":"In a manner that is not lethal; without causing death.","examples":[{"sentence":"The police deployed the weapon unlethally, aiming for the suspect's legs.","translation":"警察は容疑者の脚を狙い、その武器を非致死的に使用した。"},{"sentence":"The device is designed to subdue the target unlethally.","translation":"その装置は、対象を非致死的に制圧するように設計されている。"}],"collocations":["deploy unlethally","subdue unlethally","use unlethally"],"synonyms":["non-lethally","without fatal force","in a non-deadly manner"],"antonyms":["lethally","fatally","mortally"]}],"etymology":{"value":"Formed from \"un-\" (not) + \"lethally\" (in a lethal manner). \"Lethally\" is derived from \"lethal,\" which comes from Latin \"letalis\" (deadly).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈliːθəli/","syllables":"un-le-thal-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"\"Unlethally\" describes actions or methods intended to avoid causing death. It is often used in the context of law enforcement, military, or self-defense where the goal is to incapacitate or control a subject without killing them. The term emphasizes the intention and design of the action or tool to be non-fatal.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The weapon was used un-lethally.","correct":"✓ The weapon was used unlethally.","note":"The prefix \"un-\" should be attached directly to \"lethally\" to form a single word. Hyphenation is generally incorrect in this case."},{"incorrect":"✗ They tried to unlethal the situation.","correct":"✓ They tried to resolve the situation without lethal force.","note":"\"Unlethally\" is an adverb, not a verb. It modifies a verb to describe how something is done, not the action of making something non-lethal."}],"priority":"★★☆"},"related_words":{"derivatives":["unlethal (adjective)","lethal (adjective)","lethality (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unlethally\" means 'in a way that does not cause death.' It's an adverb used to describe how something is done, particularly in situations involving force or weapons where the intent is to avoid killing someone. It's a relatively uncommon word, mainly used in specialized contexts like law enforcement or military discussions."},"example_sentences":[{"sentence":"The riot control measures were designed to disperse the crowd unlethally.","translation":"暴動鎮圧措置は、群衆を非致死的に解散させるように設計されていた。","type":"adverb","meaning_category":"manner"},{"sentence":"The device delivers an electric shock unlethally, causing temporary incapacitation.","translation":"その装置は、一時的な無力化を引き起こす電気ショックを非致死的に与える。","type":"adverb","meaning_category":"manner"}]}