{"word":"effeminisation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"女性化、女性化すること","english_definition":"The process of becoming effeminate; the acquisition of feminine characteristics by a male.","examples":[{"sentence":"The effeminisation of society is a topic of debate.","translation":"社会の女性化は議論の的となっている。"},{"sentence":"Some studies suggest a link between certain chemicals and effeminisation in wildlife.","translation":"いくつかの研究は、特定の化学物質と野生生物の女性化との関連性を示唆している。"}],"collocations":["social effeminisation","cultural effeminisation","biological effeminisation"],"synonyms":["feminization","emasculation","softening","weakening"],"antonyms":["masculinization","virilization"]},{"part_of_speech":"noun","definition":"（医学）男性における女性的特徴の発達","english_definition":"(Medicine) The development of female characteristics in a male.","examples":[{"sentence":"Effeminisation can be a side effect of certain medical treatments.","translation":"女性化は特定の医療処置の副作用である可能性がある。"},{"sentence":"Hormonal imbalances can lead to effeminisation in men.","translation":"ホルモンバランスの崩れは、男性の女性化につながる可能性がある。"}],"collocations":["hormonal effeminisation","drug-induced effeminisation"],"synonyms":["gynaecomastia","feminization"],"antonyms":["masculinization","virilization"]}],"etymology":{"value":"Derived from 'effeminate' (having feminine qualities), with the suffix '-isation' (the process of becoming). 'Effeminate' comes from Latin 'ex-' (out of) + 'femina' (woman).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˌfemɪnaɪˈzeɪʃən/","syllables":"ef-fem-i-ni-sa-tion"},"inflection":{"noun_plural":"effeminisations"},"usage_notes":{"explanation":"'Effeminisation' refers to the process of acquiring feminine characteristics, typically in males. It can be used in social or cultural contexts to describe the adoption of traditionally feminine traits, or in a medical context to describe the development of female physical characteristics due to hormonal or other factors. The term can be controversial, depending on the context and connotations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The effeminization of the product made it more popular with women.","correct":"✓ The feminization of the product made it more popular with women.","note":"While 'effeminisation' and 'feminization' are often used interchangeably, 'feminization' is generally a more neutral and widely accepted term when referring to the process of making something more appealing to women."}],"priority":"★☆☆"},"related_words":{"derivatives":["effeminate (adjective)","effeminately (adverb)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Effeminisation' is a relatively uncommon and complex term, primarily used in academic or specialized contexts. It describes the process by which someone, typically male, acquires feminine characteristics. This can refer to social behaviors, cultural expressions, or physical traits. Due to its potential for misinterpretation and its association with gender stereotypes, it is important to use this word with sensitivity and precision."},"example_sentences":[{"sentence":"Critics argue that the effeminisation of male characters in modern media is a harmful stereotype.","translation":"批評家たちは、現代メディアにおける男性キャラクターの女性化は有害な固定観念であると主張する。","type":"noun","meaning_category":"social/cultural"},{"sentence":"The patient experienced effeminisation as a result of the hormone therapy.","translation":"患者はホルモン療法の結果、女性化を経験した。","type":"noun","meaning_category":"medical"}]}