{"word":"planimeter","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"プラニメーター、面積計","english_definition":"An instrument for mechanically determining the area of a plane figure by tracing its perimeter.","examples":[{"sentence":"He used a planimeter to measure the area of the irregular shape on the map.","translation":"彼はプラニメーターを使って地図上の不整形な領域の面積を測定した。"},{"sentence":"The planimeter is useful for calculating the area of a complex shape.","translation":"プラニメーターは複雑な形状の面積を計算するのに役立ちます。"}],"collocations":["use a planimeter","digital planimeter","polar planimeter","mechanical planimeter"],"synonyms":["area measurer","integrator"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'planos' (wandering, roaming) and 'metron' (measure).","priority":"★★☆"},"pronunciation":{"ipa":"/pləˈnɪmɪtər/","syllables":"pla-nim-e-ter"},"inflection":{"noun_plural":"planimeters"},"usage_notes":{"explanation":"A planimeter is a mechanical instrument used to measure the area of a two-dimensional shape. It is often used on maps, architectural drawings, and other technical diagrams. The user traces the perimeter of the shape with the planimeter's stylus, and the instrument calculates the area enclosed.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a planimeter to measure the volume.","correct":"✓ I used a planimeter to measure the area.","note":"A planimeter measures area, not volume."}],"priority":"★☆☆"},"related_words":{"derivatives":["planimetry (noun: the measurement of plane surfaces)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A planimeter is a specialized tool used to measure the area of two-dimensional shapes, often found in maps or technical drawings. Its usage is relatively niche, primarily within fields like cartography, engineering, or architecture. Understanding its function requires familiarity with technical measurements and geometric concepts."},"example_sentences":[{"sentence":"The engineer used a planimeter to verify the area of the land plot on the blueprint.","translation":"技師は青写真上の土地の区画の面積を確認するためにプラニメーターを使用した。","type":"noun","meaning_category":"area measurement"},{"sentence":"Digital planimeters offer more precision than traditional mechanical models.","translation":"デジタルプラニメーターは従来の機械モデルよりも高い精度を提供する。","type":"noun","meaning_category":"instrument"},{"sentence":"The cartographer employed a planimeter to calculate the surface area of the lake on the map.","translation":"地図製作者は地図上の湖の表面積を計算するためにプラニメーターを使用した。","type":"noun","meaning_category":"cartography"}]}