{"word":"simurgh","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ペルシア神話に登場する巨大な伝説の鳥、知恵と癒しの象徴","english_definition":"A mythical, wise, and benevolent bird in Persian mythology, often depicted as extremely large and capable of speech","examples":[{"sentence":"The simurgh appears in Ferdowsi's epic Shahnameh as a protector of heroes.","translation":"シームルグはフェルドウスィーの叙事詩『シャーナーメ』に英雄たちの保護者として登場する。"},{"sentence":"In Persian art, the simurgh is often depicted with the head of a dog and claws of a lion.","translation":"ペルシア美術では、シームルグはしばしば犬の頭とライオンの爪を持った姿で描かれる。"}],"cultural_context":"The simurgh appears in various Persian literary works including Attar's 'Conference of the Birds' where it serves as a symbol of divine wisdom. It's considered the king of birds in Persian tradition, similar to the phoenix in Western mythology but with distinct characteristics.","synonyms":["Persian phoenix","anqa (Arabic mythology)"],"related_mythological_creatures":["phoenix","roc","garuda","fenghuang"]}],"etymology":{"value":"ペルシア語「سیمرغ (sīmurgh)」に由来。パフラヴィー語の「sēn murw」から派生し、「sēn」は「鷲」、「murw」は「鳥」を意味する。アヴェスター語の「saēna」とも関連。","priority":"★★☆"},"pronunciation":{"ipa":"/sɪˈmʊərɡ/","syllables":"si-murgh"},"usage_notes":{"explanation":"「simurgh」は主にペルシア文学や神話に関する文脈で使用される専門的な語彙です。ファンタジー作品や比較神話学でも言及されることがあります。英語ではしばしば「Persian phoenix」と説明されますが、実際の伝承では不死鳥とは異なる特徴を持ちます。","priority":"★★☆"},"cultural_significance":{"description":"シームルグはペルシア文化において知恵、癒し、超越の象徴です。12世紀の詩人アッタールの『鳥の会議』では、鳥たちがシームルグを探す旅が神への求道の寓話として描かれています。現代イランでは国家的なシンボルの一つとして扱われることもあります。","priority":"★★★"},"related_words":{"literary_references":["Shahnameh (Book of Kings)","Conference of the Birds (Mantiq al-Tayr)"],"symbolism":["wisdom","healing","divine guidance","immortality"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門的な文化/神話用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"example_sentences":[{"sentence":"The simurgh was said to live for 1,700 years before plunging into flames like the phoenix.","translation":"シームルグは不死鳥のように1700年生きた後、炎に飛び込むと言われていた。","context":"mythological description"},{"sentence":"In Sufi tradition, the simurgh represents the ultimate truth that cannot be fully comprehended.","translation":"スーフィー（イスラム神秘主義）の伝統では、シームルグは完全には理解し得ない究極の真理を表している。","context":"religious symbolism"}]}