{"word":"Morphias","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Greek mythology) One of the thousand sons of Hypnos (Sleep), who appeared in dreams in human form.","english_definition":"In Greek mythology, Morphias is one of the thousand sons of Hypnos (Sleep). He appeared in dreams in human form.","examples":[{"sentence":"Morphias was known for his ability to shape dreams.","translation":"モルフィアスは夢を形作る能力で知られていました。"},{"sentence":"People would pray to Morphias for pleasant dreams.","translation":"人々は楽しい夢を見るためにモルフィアスに祈りました。"}],"collocations":["son of Hypnos","god of dreams","appear in dreams","shape dreams"],"synonyms":["Morpheus"],"antonyms":[]}],"etymology":{"value":"From the Greek Μορφεύς (Morpheus), derived from μορφή (morphē) meaning \"form\" or \"shape\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɔːrfiəs/","syllables":"Mor-phi-as"},"inflection":{"noun_plural":"N/A (Proper noun)"},"usage_notes":{"explanation":"Morphias is a figure from Greek mythology, often associated with dreams and sleep. He is less commonly known than Morpheus, who is also a god of dreams. The name Morphias is derived from the Greek word for \"form\" or \"shape,\" referring to his ability to shape the forms seen in dreams.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Morphias is the god of sleep.","correct":"✓ Morphias is one of the sons of Hypnos, the god of sleep.","note":"Morphias is not the god of sleep himself, but one of the sons of Hypnos. "},{"incorrect":"✗ Morphias is a common name.","correct":"✓ Morphias is a name from Greek mythology.","note":"Morphias is not a common name in modern usage."}],"priority":"★★☆"},"related_words":{"derivatives":["Morpheus (related dream god)","morph (verb - to change form)","morphology (study of forms)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Morphias is a name from Greek mythology, specifically referring to one of the sons of Hypnos, the god of sleep. He is associated with shaping dreams. While the name itself is not commonly used in everyday language, it is related to the more well-known figure Morpheus and the word \"morph,\" which means to change form. Understanding the context of Greek mythology is helpful for comprehending the meaning of Morphias."},"example_sentences":[{"sentence":"In Greek mythology, Morphias had the power to create illusions in dreams.","translation":"ギリシャ神話では、モルフィアスは夢の中に幻想を作り出す力を持っていました。","type":"noun","meaning_category":"mythology"},{"sentence":"The name Morphias is linked to the ability to alter the form of dreams.","translation":"モルフィアスの名前は、夢の形を変える能力と結びついています。","type":"noun","meaning_category":"mythology"}]}