{"word":"rural-oriented","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"農村指向の、農村重視の、地方志向の","english_definition":"Focused on or directed towards rural areas, interests, or needs.","examples":[{"sentence":"The government is implementing a rural-oriented development policy.","translation":"政府は農村指向の開発政策を実施している。"},{"sentence":"The university offers several rural-oriented programs, such as agricultural studies and rural healthcare.","translation":"その大学は、農業研究や地方医療など、農村志向のプログラムをいくつか提供している。"},{"sentence":"The company's marketing strategy is rural-oriented, targeting consumers in smaller towns and agricultural communities.","translation":"その会社のマーケティング戦略は農村志向で、より小さな町や農業コミュニティの消費者をターゲットにしている。"}],"collocations":["rural-oriented policy (農村指向政策)","rural-oriented development (農村指向開発)","rural-oriented program (農村指向プログラム)","rural-oriented approach (農村指向アプローチ)","rural-oriented economy (農村指向経済)"],"synonyms":["country-focused","agrarian-centered","regionally-focused","community-based"],"antonyms":["urban-oriented","city-centric","metropolitan-focused"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'rural' (relating to the countryside) and 'oriented' (directed or focused).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈrʊərəl ˈɔːrientɪd/","syllables":"ru-ral-o-ri-ent-ed"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are not commonly used with compound adjectives like this one. You would likely rephrase to show comparison (e.g., 'more rural-oriented')."},"usage_notes":{"explanation":"'Rural-oriented' is used to describe something that is designed, planned, or focused primarily on benefiting or addressing the needs of rural areas and populations. It implies a deliberate emphasis on the countryside and its specific characteristics. It is often used in the context of policies, programs, strategies, or studies.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The program is rural oriented.","correct":"✓ The program is rural-oriented.","note":"The hyphen is important to connect the two words and create a compound adjective."},{"incorrect":"✗ The rural oriented program.","correct":"✓ The rural-oriented program.","note":"The hyphenated form acts as a single adjective modifying 'program'."}],"priority":"★★☆"},"related_words":{"derivatives":["rural (adjective: 農村の)","orientation (noun: 方向付け、志向)"],"related_terms":["rural development (農村開発)","rural community (農村コミュニティ)","rural economy (農村経済)","rural area (農村地域)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but used in specific contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Rural-oriented' is a specialized term used in discussions about development, policy, and economics. It describes initiatives or approaches specifically designed to benefit or focus on rural areas. Understanding this term requires familiarity with the concept of rural development and the challenges faced by rural communities. It's more common in academic or professional contexts than in everyday conversation."},"example_sentences":[{"sentence":"The new agricultural policy is highly rural-oriented, aiming to support local farmers.","translation":"新しい農業政策は非常に農村指向で、地元の農家を支援することを目的としている。","type":"general","meaning_category":"農村指向の"},{"sentence":"The university's research is rural-oriented, focusing on sustainable farming practices.","translation":"大学の研究は農村指向で、持続可能な農業慣行に焦点を当てている。","type":"academic","meaning_category":"農村重視の"},{"sentence":"The company adopted a rural-oriented marketing strategy to reach customers in smaller towns.","translation":"その会社は、より小さな町の顧客にリーチするために、農村指向のマーケティング戦略を採用した。","type":"business","meaning_category":"地方志向の"}]}