{"word":"beylics","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(historical) Small Turkish principalities or emirates that emerged in Anatolia during the decline of the Seljuk Sultanate of Rum and before the rise of the Ottoman Empire.","english_definition":"Small Turkish principalities or emirates that emerged in Anatolia during the decline of the Seljuk Sultanate of Rum and before the rise of the Ottoman Empire.","examples":[{"sentence":"The Anatolian beyliks played a crucial role in the political landscape of the 13th and 14th centuries.","translation":"アナトリアのベイリクは、13世紀から14世紀の政治情勢において重要な役割を果たしました。"}],"collocations":["Anatolian beyliks","Turkish beyliks"],"synonyms":["emirates","principalities"],"antonyms":[]}],"etymology":{"value":"Derived from the Turkish word \"beylik\", meaning \"the territory or jurisdiction of a bey\" (a Turkish chieftain or governor).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbeɪlɪks/","syllables":"bey-lics"},"inflection":{"noun_plural":"beylics"},"usage_notes":{"explanation":"\"Beylics\" refers specifically to the small, independent Turkish states that formed in Anatolia after the weakening of the Seljuk Sultanate and before the consolidation of power under the Ottoman Empire. These beyliks were often in competition with each other and played a significant role in the early history of the Ottoman Empire.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["beylik (singular form)","bey (Turkish chieftain or governor)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Primarily used in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"beylics\" is a historical term referring to small Turkish principalities that existed in Anatolia during a specific period. Understanding this term requires knowledge of Ottoman and Turkish history. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The Ottoman Empire gradually absorbed the Anatolian **beylics** through conquest and alliances.","translation":"オスマン帝国は征服と同盟を通じてアナトリアのベイリクを徐々に吸収していきました。","type":"noun","meaning_category":"historical principalities"}]}