{"word":"Bakewell","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ベイクウェルタルト、ベイクウェルプディング","english_definition":"A type of English tart or pudding originating from the town of Bakewell in Derbyshire, typically consisting of a shortcrust pastry base with a layer of jam, frangipane (almond-flavored filling), and a topping of almonds or icing.","examples":[{"sentence":"I ordered a Bakewell tart with my afternoon tea.","translation":"私はアフタヌーンティーと一緒にベイクウェルタルトを注文しました。"},{"sentence":"She baked a homemade Bakewell pudding for dessert.","translation":"彼女はデザートに自家製のベイクウェルプディングを焼きました。"}],"collocations":["Bakewell tart","Bakewell pudding","almond Bakewell","cherry Bakewell"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after the town of Bakewell in Derbyshire, England, where it originated.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbeɪkˌwɛl/","syllables":"Bake-well"},"inflection":{"noun_plural":"Bakewells"},"usage_notes":{"explanation":"'Bakewell' refers to two similar but distinct desserts: Bakewell tart and Bakewell pudding. Bakewell tart typically has a pastry base, a layer of jam, frangipane, and a topping of flaked almonds or icing. Bakewell pudding has a puff pastry base and a filling similar to frangipane but with a more set custard-like texture. Both are associated with the town of Bakewell.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["frangipane","shortcrust pastry","puff pastry"],"related_food":["Victoria sponge","Eton mess","Chelsea bun"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Bakewell' refers to a specific type of English dessert from the town of Bakewell. It's not a common word unless you're familiar with British cuisine. It's useful to know if you encounter it in a recipe or when discussing English desserts. There are two main types: Bakewell tart and Bakewell pudding, which have slightly different ingredients and textures."},"example_sentences":[{"sentence":"We stopped in Bakewell to try the famous Bakewell tart.","translation":"有名なベイクウェルタルトを試食するためにベイクウェルに立ち寄りました。","type":"noun","meaning_category":"ベイクウェルタルト"},{"sentence":"The bakery in town sells both Bakewell tarts and Bakewell puddings.","translation":"町のパン屋ではベイクウェルタルトとベイクウェルプディングの両方を販売しています。","type":"noun","meaning_category":"ベイクウェルプディング"}]}