{"word":"nonharmoniously","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"非調和的に、不協和的に、不和に","english_definition":"In a way that lacks harmony or agreement; discordantly.","examples":[{"sentence":"The instruments played nonharmoniously, creating a jarring sound.","translation":"楽器は非調和的に演奏され、耳障りな音を出した。"},{"sentence":"The colors clashed nonharmoniously in the painting.","translation":"絵の中で色が不協和的に衝突していた。"},{"sentence":"The team members worked nonharmoniously, leading to conflicts.","translation":"チームメンバーは非協調的に働き、対立を引き起こした。"}],"collocations":["work nonharmoniously","play nonharmoniously","clash nonharmoniously"],"synonyms":["discordantly","inharmoniously","clashingly","dissonantly","unmelodiously","jarringly","abrasively","conflictingly","antagonistically","uncooperatively"],"antonyms":["harmoniously","melodiously","cooperatively","agreeably","concordantly"]}],"etymology":{"value":"Derived from \"harmoniously\" with the addition of the prefix \"non-\" indicating negation or the opposite.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnhɑːrˈmoʊniəsli/","syllables":"non-har-mo-ni-ous-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Nonharmoniously' is used to describe actions, sounds, or arrangements that lack agreement, balance, or pleasing combination. It often implies a sense of conflict or unpleasantness.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ They lived nonharmoniously together, but they were happy.","correct":"✓ They lived nonharmoniously together, and as a result, they were unhappy.","note":"Living nonharmoniously typically leads to unhappiness or conflict, so ensure the sentence reflects this logical consequence."},{"incorrect":"✗ The music was nonharmoniously, it made me sad.","correct":"✓ The music was nonharmonious, it made me sad.","note":"'Nonharmoniously' is an adverb, so it should modify a verb. 'Nonharmonious' is the adjective form that can describe the music itself."}],"priority":"★★☆"},"related_words":{"derivatives":["nonharmonious (adjective)","harmony (noun)","harmonious (adjective)","harmoniously (adverb)"],"antonyms":["harmoniously"],"synonyms":["discordantly","inharmoniously"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'nonharmoniously' is a more advanced term used to describe something done in a way that lacks agreement or pleasing combination. It is the opposite of 'harmoniously' and is used to describe situations or actions that are discordant or conflicting. It's not a commonly used word, so it's more likely to be found in formal writing or discussions."},"example_sentences":[{"sentence":"The gears in the machine turned nonharmoniously, causing the entire mechanism to shudder.","translation":"機械の歯車が非調和的に回転し、機構全体が震えた。","type":"general","meaning_category":"lack of mechanical harmony"},{"sentence":"The diplomats spoke nonharmoniously, failing to reach any agreement.","translation":"外交官たちは非協調的に話し、合意に達することができなかった。","type":"general","meaning_category":"lack of agreement"},{"sentence":"The singers performed nonharmoniously, resulting in a cacophony of sound.","translation":"歌手たちは非調和的に演奏し、騒音のような音になった。","type":"general","meaning_category":"lack of musical harmony"}]}