{"word":"sensitisation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(医学)感作、感受性亢進","english_definition":"The process of becoming susceptible to an allergen or other substance after initial exposure, leading to an exaggerated immune response upon subsequent exposure.","examples":[{"sentence":"Sensitisation to pollen can lead to hay fever symptoms.","translation":"花粉への感作は花粉症の症状を引き起こす可能性があります。"},{"sentence":"Repeated exposure to the chemical caused sensitisation in the workers.","translation":"その化学物質への繰り返しの暴露は、労働者に感作を引き起こしました。"}],"collocations":["allergen sensitisation","chemical sensitisation","skin sensitisation"],"synonyms":["allergy","hypersensitivity","susceptibility"],"antonyms":["desensitisation","tolerance"]},{"part_of_speech":"noun","definition":"(心理学)鋭敏化、過敏化","english_definition":"An increase in behavioral response after exposure to a threatening stimulus.","examples":[{"sentence":"The therapy aimed to reduce sensitisation to traumatic memories.","translation":"そのセラピーは、トラウマ的な記憶に対する鋭敏化を軽減することを目的としていました。"},{"sentence":"Sensitisation can lead to avoidance behavior.","translation":"鋭敏化は回避行動につながる可能性があります。"}],"collocations":["fear sensitisation","pain sensitisation","stress sensitisation"],"synonyms":["heightened awareness","increased sensitivity","overreaction"],"antonyms":["habituation","adaptation"]}],"etymology":{"value":"Derived from 'sensitise' (to make sensitive) + '-ation' (a suffix indicating a process or state). 'Sensitise' comes from 'sensitive' which originates from Latin 'sentire' (to feel).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɛnsɪtaɪˈzeɪʃən/","syllables":"sen-si-ti-sa-tion"},"inflection":{"noun_plural":"sensitisations"},"usage_notes":{"explanation":"'Sensitisation' refers to the process of becoming sensitive to a substance or stimulus. In medicine, it often describes the development of an allergic response. In psychology, it refers to an increased behavioral response to a stimulus, often after a threatening experience. The spelling 'sensitization' is also common, especially in American English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sensitisation was cured with antibiotics.","correct":"✓ The sensitisation was treated with antihistamines.","note":"Antibiotics are for bacterial infections, not allergic reactions. Sensitisation, especially in the context of allergies, is often managed with antihistamines or other allergy medications."},{"incorrect":"✗ He had a sensitisation to the cold weather.","correct":"✓ He had a sensitivity to the cold weather.","note":"While 'sensitisation' is a valid term, 'sensitivity' is more commonly used to describe a general reaction to something like cold weather, unless it's specifically an allergic reaction."}],"priority":"★★☆"},"related_words":{"derivatives":["sensitise (verb)","sensitive (adjective)","sensitivity (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sensitisation' is a technical term used in medicine and psychology to describe the process of becoming more reactive to a stimulus. In medicine, it often refers to developing an allergic reaction after initial exposure to an allergen. In psychology, it describes an increased behavioral response to a threatening stimulus. It's a relatively uncommon word, mainly used in specialized contexts."},"example_sentences":[{"sentence":"After repeated exposure, she developed a sensitisation to latex.","translation":"繰り返しの暴露の後、彼女はラテックスに対する感作を発症しました。","type":"noun","meaning_category":"感作 (医学)"},{"sentence":"The experiment demonstrated sensitisation to the conditioned stimulus.","translation":"その実験は、条件刺激に対する鋭敏化を示しました。","type":"noun","meaning_category":"鋭敏化 (心理学)"}]}