{"word":"antiproliferative","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"細胞増殖抑制性の、抗増殖性の","english_definition":"Having the property of inhibiting or preventing cell proliferation (growth and division).","examples":[{"sentence":"The drug has antiproliferative effects on cancer cells.","translation":"その薬は癌細胞に対して細胞増殖抑制効果がある。"},{"sentence":"Antiproliferative agents are used in the treatment of various diseases.","translation":"抗増殖剤は様々な疾患の治療に用いられる。"}],"collocations":["antiproliferative activity","antiproliferative effect","antiproliferative agent","antiproliferative drug","antiproliferative therapy"],"synonyms":["cytostatic","growth-inhibiting"],"antonyms":["proliferative","growth-promoting"]}],"etymology":{"value":"'Anti-' (against) + 'proliferative' (tending to proliferate, or grow rapidly).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌænti.prəˈlɪfərətɪv/","syllables":"an-ti-pro-lif-er-a-tive"},"inflection":{"notes":"Does not inflect; it's an adjective."},"usage_notes":{"explanation":"'Antiproliferative' is primarily used in medical and scientific contexts to describe substances or treatments that slow down or stop the growth of cells. It is commonly associated with cancer treatment, where controlling cell proliferation is essential.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The antiproliferative is good for health.","correct":"✓ The antiproliferative agent is good for health.","note":"'Antiproliferative' is an adjective, so it needs a noun to modify. 'Antiproliferative agent' is a common usage."}],"priority":"★★☆"},"related_words":{"derivatives":["proliferation (noun): rapid increase in numbers.","proliferative (adjective): tending to increase in numbers rapidly.","antiproliferation (noun): measures to prevent the spread of something, especially nuclear weapons."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in scientific and medical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Antiproliferative' is a technical term primarily encountered in scientific and medical contexts. It describes the property of a substance or treatment to inhibit cell growth. Understanding this term requires a background in biology or medicine. It's often used in discussions about cancer therapies and other conditions involving abnormal cell growth."},"example_sentences":[{"sentence":"The researchers investigated the antiproliferative properties of the new compound.","translation":"研究者たちはその新しい化合物の細胞増殖抑制特性を調査した。","type":"adjective","meaning_category":"cell growth inhibition"},{"sentence":"An antiproliferative drug was administered to slow the growth of the tumor.","translation":"腫瘍の成長を遅らせるために、抗増殖薬が投与された。","type":"adjective","meaning_category":"medical treatment"}]}