{"word":"Carpetbaggery","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史的文脈)南北戦争後の南部で、北部から来て政治的・経済的利益を得ようとした人々による搾取行為。","english_definition":"(historical context) The exploitation of the South by Northerners who came to the region after the Civil War seeking political or economic gain.","examples":[{"sentence":"Carpetbaggery was rampant in the South during Reconstruction.","translation":"レコンストラクション（再建時代）の間、南部では不正搾取が横行していた。"},{"sentence":"The term 'carpetbagger' is often used to describe someone who takes advantage of a vulnerable situation for personal profit.","translation":"「不正搾取者」という言葉は、個人的な利益のために脆弱な状況を利用する人を表すためによく使われる。"}],"collocations":["political carpetbaggery","economic carpetbaggery"],"synonyms":["exploitation","opportunism","profiteering"],"antonyms":[],"notes":"The term 'carpetbagger' originally referred to Northerners who arrived in the South with only a carpetbag (a type of suitcase made from carpet fabric)."}],"etymology":{"value":"The term originated after the American Civil War. 'Carpetbagger' referred to Northerners who migrated to the South during Reconstruction (1865–1877), allegedly carrying their possessions in a carpetbag. It implied that they were opportunistic outsiders seeking to exploit the defeated South for their own financial and political gain.","priority":"★★☆"},"pronunciation":{"ipa":"ˌkɑːrpɪtˈbæɡəri","syllables":"car-pet-bag-ger-y"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Carpetbaggery' is primarily a historical term referring to a specific period in American history. However, it can also be used more broadly to describe any situation where outsiders exploit a vulnerable region or population for personal gain. The term carries a strong negative connotation, implying dishonesty and opportunism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company's carpetbaggery led to economic growth in the region.","correct":"✓ The company's exploitative practices led to economic growth in the region.","note":"'Carpetbaggery' always implies exploitation and is not used to describe positive economic outcomes, even if they result from outside investment."}],"priority":"★☆☆"},"related_words":{"derivatives":["carpetbagger (noun)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency. Primarily used in historical contexts or discussions of political corruption.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Carpetbaggery' is a complex term with historical roots in the Reconstruction era of the United States. It refers to the exploitative practices of outsiders who take advantage of a vulnerable region for personal gain. Understanding the term requires knowledge of American history and the negative connotations associated with opportunism and exploitation."},"example_sentences":[{"sentence":"The governor was accused of carpetbaggery for awarding contracts to his friends.","translation":"知事は、友人たちに契約を与えたことで不正搾取の罪で告発された。","type":"noun","meaning_category":"搾取行為"},{"sentence":"Many Southerners viewed the Reconstruction policies as a form of carpetbaggery.","translation":"多くの南部人は、再建政策を不正搾取の一形態と見なした。","type":"noun","meaning_category":"搾取行為"}]}