{"word":"fief","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"封土、領地","english_definition":"an estate of land held on condition of feudal service; a territory held in fee.","examples":[{"sentence":"The lord granted him a fief in exchange for loyalty and military service.","translation":"領主は忠誠と軍役の代償として彼に封土を与えた。"},{"sentence":"The size of the fief determined the wealth and power of the vassal.","translation":"封土の大きさは、家臣の富と権力を決定づけた。"}],"collocations":["grant a fief","hold a fief","size of the fief","feudal fief"],"synonyms":["estate","domain","manor","territory","holding"],"antonyms":[]}],"etymology":{"value":"Old French *fief* (also *fieu*), from Medieval Latin *feudum*, of Germanic origin; akin to Old High German *fihu* 'cattle' (originally the main form of movable property).","priority":"★★☆"},"pronunciation":{"ipa":"/fiːf/","syllables":"fief"},"inflection":{"noun_plural":"fiefs"},"usage_notes":{"explanation":"The term 'fief' is primarily historical, referring to the system of feudalism in medieval Europe. It describes the land granted by a lord to a vassal in return for service. While rarely used in modern contexts, it can sometimes be used metaphorically to describe a territory or area of control.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He bought a fief in the city center.","correct":"He bought a property in the city center.","note":"'Fief' refers to a feudal land grant, not modern property. Use 'property' or 'estate' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["feudal","feudalism","feudatory"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Fief' is a specialized term related to the historical feudal system. It refers to a grant of land made by a lord to a vassal in exchange for service. It is not commonly used in modern contexts, so understanding requires knowledge of medieval history. The word is more likely to be encountered in historical texts or discussions of feudalism."},"example_sentences":[{"sentence":"The knight swore fealty to the king for the fief he received.","translation":"騎士は受け取った封土に対して王に忠誠を誓った。","type":"noun","meaning_category":"封土"},{"sentence":"The fief included several villages and their surrounding farmland.","translation":"その封土にはいくつかの村とその周辺の農地が含まれていた。","type":"noun","meaning_category":"領地"}]}