{"word":"Epilachna","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"テントウムシダマシ属：オオニジュウヤホシテントウやニジュウヤホシテントウなどを含む、植物食性のテントウムシの属","english_definition":"A genus of beetles in the family Coccinellidae (lady beetles), many of which are herbivorous and considered agricultural pests. Includes species such as the Mexican bean beetle (Epilachna varivestis) and the squash beetle (Epilachna borealis).","examples":[{"sentence":"Epilachna beetles can cause significant damage to crops.","translation":"テントウムシダマシ属の甲虫は作物に重大な損害を与える可能性がある。"},{"sentence":"The Mexican bean beetle is a well-known species of Epilachna.","translation":"メキシコ豆甲虫は、テントウムシダマシ属のよく知られた種である。"}],"collocations":["Epilachna varivestis (メキシコ豆甲虫)","Epilachna borealis (カボチャ甲虫)","Epilachna damage (テントウムシダマシ属による被害)"],"synonyms":["squash beetle","Mexican bean beetle"],"antonyms":[]}],"etymology":{"value":"The name Epilachna is derived from the Greek words 'epi' (upon) and 'lachne' (wool), referring to the hairy appearance of some species.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛpɪˈlæknə/","syllables":"Ep-i-lach-na"},"inflection":{"noun_plural":"Epilachnas"},"usage_notes":{"explanation":"Epilachna is a genus name used in scientific contexts, particularly in agriculture and entomology. It is not commonly used in everyday conversation. When referring to specific species within the genus, it is more common to use their common names (e.g., Mexican bean beetle).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Epilachna are beneficial insects.","correct":"✓ Some Epilachna are pests.","note":"While most ladybugs are beneficial, Epilachna beetles are herbivorous and considered pests."}],"priority":"★★☆"},"related_words":{"derivatives":["Coccinellidae (テントウムシ科)","herbivore (草食動物)","pest (害虫)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Epilachna' is a scientific term referring to a genus of beetles, specifically those within the lady beetle family that are herbivorous and often considered pests. This term is primarily used in academic, agricultural, or entomological contexts. Understanding its meaning requires familiarity with biological classification and pest management.","priority":"★★☆"},"example_sentences":[{"sentence":"The farmer sprayed insecticide to control the Epilachna population in his bean field.","translation":"農家は豆畑のテントウムシダマシ属の個体数を制御するために殺虫剤を散布した。","type":"noun","meaning_category":"genus of beetles"},{"sentence":"Research is being conducted to find natural predators of Epilachna varivestis.","translation":"メキシコ豆甲虫の天敵を見つけるための研究が行われている。","type":"noun","meaning_category":"genus of beetles"}]}