{"word":"tropism","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"屈性（くっせい）","english_definition":"The turning of all or part of an organism in a particular direction in response to an external stimulus.","examples":[{"sentence":"Phototropism is the orientation of a plant or other organism in response to light.","translation":"光屈性とは、光に対する植物や他の生物の方向づけのことです。"},{"sentence":"Geotropism causes plant roots to grow downwards.","translation":"重力屈性により、植物の根は下向きに成長します。"},{"sentence":"The tropism of the vine allowed it to climb the trellis.","translation":"つる植物の屈性により、格子垣を登ることができました。"}],"collocations":["phototropism (光屈性)","geotropism (重力屈性)","hydrotropism (水屈性)","thigmotropism (接触屈性)","chemotropism (化学屈性)","positive tropism (正の屈性)","negative tropism (負の屈性)"],"synonyms":["orientation","growth response","directional growth"],"antonyms":[]}],"etymology":{"value":"From Greek tropos (τρόπος) meaning 'a turn, direction, way'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtroʊpɪzəm/","syllables":"tro-pism"},"inflection":{"noun_plural":"tropisms"},"usage_notes":{"explanation":"Tropism refers to the directional growth or turning movement of a plant or other sessile organism in response to an environmental stimulus. It's a biological phenomenon that allows organisms to optimize their position and growth in relation to factors such as light, gravity, water, and chemicals. Tropisms can be positive (growth towards the stimulus) or negative (growth away from the stimulus).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant has tropism towards the sun.","correct":"✓ The plant exhibits phototropism.","note":"It's more precise to use the specific type of tropism (e.g., phototropism) when referring to a response to a particular stimulus. Using 'tropism' alone is less informative."},{"incorrect":"✗ Tropism is a voluntary movement.","correct":"✓ Tropism is an involuntary growth response.","note":"Tropism is not a voluntary movement but an automatic growth response to a stimulus."}],"priority":"★★☆"},"related_words":{"derivatives":["tropic (形容詞: 熱帯の, 屈性の)","tropal (形容詞: 屈性の)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tropism' is a specialized biological term referring to the directional growth response of a plant or sessile organism to an external stimulus. It is commonly used in scientific contexts related to botany, plant physiology, and environmental biology. Understanding the different types of tropisms (phototropism, geotropism, etc.) requires a background in biology.","priority":"★★☆"},"example_sentences":[{"sentence":"The seedlings demonstrated positive phototropism by bending towards the light source.","translation":"苗は光源に向かって曲がることで正の光屈性を示しました。","type":"noun","meaning_category":"屈性"},{"sentence":"Roots exhibit positive geotropism, growing downwards in response to gravity.","translation":"根は重力に応答して下向きに成長する正の重力屈性を示します。","type":"noun","meaning_category":"屈性"},{"sentence":"Hydrotropism guides root growth towards areas with higher moisture content.","translation":"水屈性は、より水分含有量の高い領域に向かって根の成長を導きます。","type":"noun","meaning_category":"屈性"}]}