{"word":"neurodiversity-unfriendly","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"神経多様性に配慮していない、神経多様性フレンドリーでない","english_definition":"Not designed or adapted to be inclusive of or accommodating to individuals with diverse neurological conditions or cognitive styles.","examples":[{"sentence":"The office environment was neurodiversity-unfriendly, with constant bright lights and loud noises.","translation":"そのオフィス環境は、常に明るい照明と騒音があり、神経多様性に配慮されていませんでした。"},{"sentence":"The traditional teaching methods were neurodiversity-unfriendly, failing to engage students with ADHD or autism.","translation":"従来の教育方法は神経多様性に配慮されておらず、ADHDや自閉症の生徒を引き込むことができませんでした。"},{"sentence":"The application process was neurodiversity-unfriendly, requiring candidates to complete timed tests that disadvantaged those with processing differences.","translation":"応募プロセスは神経多様性に配慮されておらず、処理能力に違いのある応募者に不利な時間制限付きのテストを完了させる必要がありました。"}],"collocations":["neurodiversity-unfriendly environment (神経多様性に配慮していない環境)","neurodiversity-unfriendly policies (神経多様性に配慮していない政策)","neurodiversity-unfriendly practices (神経多様性に配慮していない慣行)","neurodiversity-unfriendly design (神経多様性に配慮していない設計)"],"synonyms":["not neurodiversity-inclusive","not neurodiversity-affirming","not neurodiversity-supportive","discriminatory towards neurodivergent individuals"],"antonyms":["neurodiversity-friendly","neurodiversity-inclusive","neurodiversity-affirming","neurodiversity-supportive"],"notes":"This term is used to describe environments, practices, policies, or designs that do not adequately consider or accommodate the needs of neurodivergent individuals, potentially creating barriers to their participation and success."}],"etymology":{"value":"Formed by combining \"neurodiversity\" (the concept that neurological differences are natural and should be recognized and respected), and \"unfriendly\" (not kind or helpful).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌnjʊəroʊdaɪˈvɜːrsɪti ʌnˈfrendli/","syllables":"neu-ro-di-ver-si-ty un-friend-ly"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"The term 'neurodiversity-unfriendly' is used to highlight the lack of consideration or accommodation for neurodivergent individuals in a particular context. It implies that changes or adaptations are needed to create a more inclusive and supportive environment.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The neurodiversity-unfriendly is bad.","correct":"✓ The neurodiversity-unfriendly environment is bad.","note":"'Neurodiversity-unfriendly' is an adjective and needs to modify a noun."}],"priority":"☆☆☆"},"related_words":{"derivatives":[],"related_terms":["neurodiversity","neurodivergent","neurotypical","inclusion","accessibility","accommodation"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency, specific to discussions about neurodiversity.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"This term is relatively complex and specific, used in discussions about social justice, inclusion, and disability rights. It describes something that does not support or accommodate people with neurological differences. Understanding requires familiarity with the concept of neurodiversity.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The company's hiring practices were criticized for being neurodiversity-unfriendly.","translation":"その会社の採用慣行は、神経多様性に配慮していないとして批判されました。","type":"adjective","meaning_category":"Lack of accommodation"},{"sentence":"Many schools still operate under neurodiversity-unfriendly models of education.","translation":"多くの学校は依然として神経多様性に配慮していない教育モデルで運営されています。","type":"adjective","meaning_category":"Lack of accommodation"},{"sentence":"The building's design was neurodiversity-unfriendly, causing sensory overload for some employees.","translation":"その建物の設計は神経多様性に配慮されておらず、一部の従業員に感覚過負荷を引き起こしていました。","type":"adjective","meaning_category":"Lack of accommodation"}]}