{"word":"Noumenism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(哲学)可知論、本体論：現象の背後にある、感覚によっては知りえない本質（ヌーメン）の存在を認める立場。","english_definition":"(Philosophy) The belief in or acceptance of noumena, things as they are in themselves, as opposed to phenomena, things as they appear to the senses.","examples":[{"sentence":"Noumenism posits that there is a reality beyond our immediate perception.","translation":"可知論は、私たちの直接的な知覚を超えた現実が存在すると仮定する。"},{"sentence":"Kant's philosophy incorporates elements of noumenism.","translation":"カントの哲学は、可知論の要素を取り入れている。"}],"collocations":["noumenal realm (本体の世界)","noumenal object (本体的な対象)","transcendental noumenism (超越論的可知論)"],"synonyms":["Transcendental Realism","Ontological Realism"],"antonyms":["Phenomenalism","Positivism"]}],"etymology":{"value":"Derived from 'noumenon,' which comes from the Greek word 'νοούμενον' (nooúmenon), meaning 'thing being thought of' or 'perceived,' plus the suffix '-ism' indicating a doctrine or belief system.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnuːmənɪzəm/","syllables":"Nou-men-ism"},"inflection":{"noun_plural":"Noumenisms"},"usage_notes":{"explanation":"Noumenism is a philosophical position that acknowledges the existence of noumena, which are things-in-themselves that are inaccessible to direct sensory experience. It is often contrasted with phenomenalism, which asserts that reality is limited to what can be experienced. The term is most frequently encountered in discussions of Immanuel Kant's philosophy, where the distinction between phenomena and noumena is central.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Noumenism is the study of observable phenomena.","correct":"✓ Noumenism is the belief in the existence of things beyond observable phenomena.","note":"Noumenism deals with what is beyond observable phenomena, not the phenomena themselves."},{"incorrect":"✗ Noumenism and phenomenalism are the same thing.","correct":"✓ Noumenism and phenomenalism are opposing philosophical viewpoints.","note":"Noumenism and phenomenalism are contrasting philosophical positions."}],"priority":"★★☆"},"related_words":{"derivatives":["noumenal (adjective: relating to noumena)","noumenon (noun: a thing as it is in itself, unknowable by direct experience)"],"related_terms":["phenomenon (noun: something that appears to the senses)","phenomenalism (noun: the belief that reality is limited to what can be experienced)","transcendental (adjective: relating to conditions of possibility of experience)","ontology (noun: the study of being)","epistemology (noun: the study of knowledge)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized philosophical vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Noumenism' is a complex philosophical term referring to the belief in the existence of 'noumena,' which are things as they are in themselves, independent of our perception. This concept is often discussed in the context of Immanuel Kant's philosophy. Understanding 'noumenism' requires familiarity with philosophical concepts like ontology (the study of being) and epistemology (the study of knowledge). It's a term primarily used in academic philosophical discussions, and not in everyday language."},"example_sentences":[{"sentence":"The debate between noumenism and phenomenalism has been central to metaphysics for centuries.","translation":"可知論と現象論の間の議論は、何世紀にもわたって形而上学の中心となってきた。","type":"general","meaning_category":"philosophical concept"},{"sentence":"Some critics argue that noumenism leads to an unknowable and ultimately meaningless reality.","translation":"一部の批評家は、可知論は知り得ない、そして最終的には無意味な現実につながると主張している。","type":"critical","meaning_category":"philosophical concept"},{"sentence":"Transcendental noumenism attempts to bridge the gap between our experience and the noumenal world.","translation":"超越論的可知論は、私たちの経験と本体の世界の間のギャップを埋めようと試みる。","type":"specific","meaning_category":"philosophical concept"}]}