{"word":"Dasylirion","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ダシリリオン属 (リュウゼツラン亜科の属の一つ)","english_definition":"A genus of plants in the family Asparagaceae, subfamily Nolinoideae (formerly Ruscaceae), native to arid regions of northern Mexico, and the southwestern United States.","examples":[{"sentence":"The Dasylirion wheeleri is a popular ornamental plant.","translation":"ダシリリオン・ホイーレリは人気のある観賞植物です。"}],"collocations":["Dasylirion wheeleri (ダシリリオン・ホイーレリ)","Dasylirion longissimum (ダシリリオン・ロンギッシムム)"],"synonyms":["Sotol (ソトル - 一般名)"],"antonyms":[]}],"etymology":{"value":"Derived from Greek 'dasys' meaning 'shaggy' and 'lirion' meaning 'lily', referring to the shaggy leaves of some species.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdæsɪˈlɪriən/","syllables":"Da-sy-li-ri-on"},"inflection":{"noun_plural":"Dasylirions"},"usage_notes":{"explanation":"'Dasylirion' refers to a specific genus of plants, primarily found in arid regions. It is often used in botanical contexts or when discussing ornamental plants. The common name 'Sotol' is also used, especially when referring to the alcoholic beverage made from some species.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Dasylirion cactus.","correct":"✓ I saw a Dasylirion plant.","note":"Dasylirion are not cacti; they are more closely related to lilies and asparagus."}],"priority":"★☆☆"},"related_words":{"derivatives":["Dasylirion wheeleri","Sotol"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低い (Very low) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dasylirion' is a botanical term referring to a specific genus of plants. It is mainly used in specialized contexts related to botany, horticulture, or regional flora of arid areas in North America. Understanding this term requires some familiarity with plant classification. The common name 'Sotol' might be more widely known due to the alcoholic beverage.","note":"ダシリリオンは植物学の用語であり、特定の植物の属を指します。この用語を理解するには、植物分類に関するある程度の知識が必要です。一般名の「ソトル」は、アルコール飲料のために、より広く知られているかもしれません。"},"example_sentences":[{"sentence":"The desert landscape was dotted with various species of Dasylirion.","translation":"砂漠の風景には、さまざまな種類のダシリリオンが点在していた。","type":"general","meaning_category":"植物"},{"sentence":"Sotol, a spirit similar to tequila, is made from the Dasylirion plant.","translation":"テキーラに似た蒸留酒であるソトルは、ダシリリオン属の植物から作られる。","type":"general","meaning_category":"植物"}]}