{"word":"bastardy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(古語または法律)私生児であること、庶子であること","english_definition":"(archaic or legal) The state of being born out of wedlock; illegitimacy.","examples":[{"sentence":"The child's claim to the inheritance was challenged due to his alleged bastardy.","translation":"その子の相続権は、彼の主張された庶子性（私生児であること）のために異議を唱えられた。"},{"sentence":"In the past, bastardy carried a significant social stigma.","translation":"かつて、庶子であることは重大な社会的スティグマを伴っていた。"}],"collocations":["prove bastardy (庶子であることを証明する)","claim of bastardy (庶子であるという主張)","legal implications of bastardy (庶子であることの法的影響)"],"synonyms":["illegitimacy","illegitimate birth","out-of-wedlock birth"],"antonyms":["legitimacy","legitimate birth","lawful birth"]}],"etymology":{"value":"Old French *bastardie* 'state of being a bastard', from *bastard*.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbæstərdi/","syllables":"bas-tard-y"},"inflection":{"noun_plural":"bastardies (rare)"},"usage_notes":{"explanation":"The term 'bastardy' is now considered archaic and offensive in most contexts. It refers to the state of being born to parents who are not married. Modern legal and social contexts generally avoid this term, preferring more neutral language like 'illegitimacy' or 'non-marital birth'. The word is primarily encountered in historical texts or legal documents.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was accused of bastardy himself.","correct":"✓ He was accused of fathering a bastard.","note":"'Bastardy' refers to the state of being illegitimate, not the act of fathering a child out of wedlock. The correct usage would be to accuse someone of fathering a bastard child or of being a bastard (though this is offensive)."},{"incorrect":"✗ Bastardy is not a problem anymore.","correct":"✓ Illegitimacy is less of a social stigma than it used to be.","note":"While the social stigma associated with non-marital birth has decreased, it's more accurate to say that 'illegitimacy' (or 'non-marital birth') is less of a social issue than to use the archaic term 'bastardy'."}],"priority":"★★☆"},"related_words":{"derivatives":["bastard (noun/adjective)","bastardize (verb)"],"phrases":["born out of wedlock","illegitimate child","child born to unmarried parents"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (very low frequency, primarily historical or legal contexts)","frequency_google_ngram":"Very low frequency. Usage is declining significantly.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Bastardy' is an archaic and potentially offensive term referring to the state of being born to parents who are not married. It is rarely used in modern English, having been replaced by more neutral terms such as 'illegitimacy' or 'non-marital birth.' The word is most likely to be encountered in historical contexts or legal documents pertaining to inheritance or lineage. Due to its potential to offend, it is best avoided in contemporary conversation or writing."},"example_sentences":[{"sentence":"The novel explored the social consequences of bastardy in Victorian England.","translation":"その小説は、ヴィクトリア朝時代のイングランドにおける庶子であることの社会的影響を探求した。","type":"noun","meaning_category":"illegitimacy"},{"sentence":"The laws regarding bastardy have changed significantly over the centuries.","translation":"庶子に関する法は、数世紀にわたって大きく変化してきた。","type":"noun","meaning_category":"illegitimacy"},{"sentence":"The stigma of bastardy could affect a person's opportunities in life.","translation":"庶子であるというスティグマは、人の人生における機会に影響を与える可能性があった。","type":"noun","meaning_category":"illegitimacy"}]}