{"word":"Plurivory","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The consumption of multiple types of plant material, such as leaves, fruits, seeds, and roots, by an organism.","english_definition":"The practice of consuming various parts of plants, including leaves, fruits, seeds, and roots.","examples":[{"sentence":"Plurivory is a common feeding strategy among many herbivorous animals.","translation":"多食性は、多くの草食動物の間で一般的な摂食戦略です。"},{"sentence":"The study examined the effects of plurivory on the digestive systems of primates.","translation":"その研究は、霊長類の消化器系に対する多食性の影響を調べました。"},{"sentence":"Plurivory allows animals to obtain a more balanced nutrient intake compared to specializing on a single plant part.","translation":"多食性により、動物は単一の植物部分に特化するよりも、よりバランスの取れた栄養摂取を得ることができます。"}],"collocations":["exhibit plurivory","practice plurivory","benefit from plurivory","impact of plurivory","study of plurivory"],"synonyms":["herbivory","folivory","frugivory","granivory","rhizophagy"],"antonyms":["monophagy","carnivory","omnivory"]}],"etymology":{"value":"Derived from the Latin 'pluri-' (meaning 'many') and '-vory' (from 'vorare,' meaning 'to devour').","priority":"★★☆"},"pronunciation":{"ipa":"/plʊˈrɪvəri/","syllables":"plu-ri-vo-ry"},"inflection":{"noun_plural":"plurivories"},"usage_notes":{"explanation":"'Plurivory' is a term used in ecology and zoology to describe a feeding strategy where an organism consumes multiple types of plant material. It is often contrasted with more specialized feeding strategies such as folivory (eating primarily leaves) or frugivory (eating primarily fruits). The term is useful for describing the dietary habits of animals that do not fit neatly into these more specific categories.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The animal is a plurivore, eating only leaves.","correct":"✓ The animal is a folivore, eating only leaves.","note":"Plurivory means eating multiple plant parts, not just one. If an animal eats only leaves, it is a folivore."},{"incorrect":"✗ Plurivory is the same as omnivory.","correct":"✓ Plurivory is a type of herbivory, while omnivory includes both plant and animal matter.","note":"Omnivory involves eating both plants and animals, whereas plurivory is strictly the consumption of various plant parts."}],"priority":"★★☆"},"related_words":{"derivatives":["plurivore (noun: an animal that practices plurivory)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Plurivory' is a specialized term used in the fields of ecology and zoology to describe the dietary habit of consuming multiple types of plant material (leaves, fruits, seeds, roots, etc.). It's a more general term than 'folivory' (leaf-eating) or 'frugivory' (fruit-eating). Understanding this term helps in accurately describing the feeding habits of various herbivorous animals."},"example_sentences":[{"sentence":"Many primates exhibit **plurivory**, consuming a mix of fruits, leaves, and seeds depending on seasonal availability.","translation":"多くの霊長類は多食性を示し、季節的な入手可能性に応じて果物、葉、種子の混合物を消費します。","type":"general","meaning_category":"general"},{"sentence":"The study found that **plurivory** contributed to a more diverse gut microbiome in the studied herbivores.","translation":"研究の結果、多食性は、研究対象の草食動物において、より多様な腸内マイクロバイオームに貢献することがわかりました。","type":"scientific","meaning_category":"scientific"},{"sentence":"By practicing **plurivory**, the animal ensures it receives a wide range of essential nutrients.","translation":"多食性を実践することで、動物は幅広い必須栄養素を確実に摂取できます。","type":"nutritional","meaning_category":"nutritional"}]}