{"word":"exponible","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(論理学で)説明可能な、展開可能な、解釈可能な","english_definition":"(of a proposition, term, etc.) capable of being explained or interpreted; requiring explanation or interpretation.","examples":[{"sentence":"An exponible proposition contains implicit assumptions that need to be clarified.","translation":"説明可能な命題は、明確にする必要のある暗黙の前提を含んでいる。"},{"sentence":"The term 'justice' is exponible in various ways depending on the philosophical context.","translation":"「正義」という用語は、哲学的文脈に応じてさまざまな方法で解釈可能である。"}],"collocations":["exponible term (説明可能な用語)","exponible proposition (説明可能な命題)","exponible definition (説明可能な定義)"],"synonyms":["interpretable","explainable","definable","elucidatable"],"antonyms":["inexplicable","uninterpretable","undefined"]}],"etymology":{"value":"Late Latin *exponibilis*, from Latin *exponere* (to set forth, explain).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪkˈspoʊnɪbəl/","syllables":"ex-po-ni-ble"},"inflection":{"notes":"Adjective, comparative and superlative forms are 'more exponible' and 'most exponible' respectively, though rarely used."},"usage_notes":{"explanation":"The term 'exponible' is primarily used in logic, philosophy, and linguistics to describe something that requires or is capable of further explanation or interpretation. It suggests that the subject in question is not immediately clear and needs to be unpacked to reveal its underlying meaning or assumptions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The exponible painting was displayed in the gallery.","correct":"✓ The exhibited painting was displayed in the gallery.","note":"'Exponible' refers to the interpretability of something, not whether it is on display. Use 'exhibited' for something on display."},{"incorrect":"✗ His exponible behavior was confusing.","correct":"✓ His explicable behavior was confusing. / ✓ His explainable behavior was confusing.","note":"'Exponible' refers to the need for explanation, not necessarily the ease of explaining something. Use 'explicable' or 'explainable' to describe behavior that can be understood."}],"priority":"★☆☆"},"related_words":{"derivatives":["exponibility (noun: the quality of being exponible)","exposition (noun: a comprehensive description and explanation of an idea or theory)","exponent (noun: a person who advocates or promotes a theory, proposal, etc.)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Exponible' is a specialized term mainly used in academic contexts, particularly in logic and philosophy. It describes something that needs further explanation or interpretation to be fully understood. It's not a word commonly used in everyday conversation. Understanding this word requires familiarity with abstract concepts and logical reasoning."},"example_sentences":[{"sentence":"The professor argued that the concept of free will is inherently exponible.","translation":"教授は、自由意志の概念は本質的に説明可能であると主張した。","type":"adjective","meaning_category":"説明可能な"},{"sentence":"The exponible nature of legal texts requires careful analysis and interpretation.","translation":"法律文書の説明可能な性質は、注意深い分析と解釈を必要とする。","type":"adjective","meaning_category":"解釈可能な"},{"sentence":"The philosopher explored the exponible aspects of moral responsibility.","translation":"その哲学者は、道徳的責任の説明可能な側面を探求した。","type":"adjective","meaning_category":"説明可能な"}]}