{"word":"Unhushing","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(現在分詞)～を静けさから解放する、～の静寂を破る、～を騒がしくする","english_definition":"(present participle) The act of making something no longer quiet; disrupting the silence.","examples":[{"sentence":"Unhushing the library, the children burst into laughter.","translation":"子供たちは図書館の静けさを破り、笑い出した。"},{"sentence":"The band was unhushing the night with their loud music.","translation":"バンドは大音量の音楽で夜の静寂を破っていた。"}],"collocations":["unhushing the night","unhushing the forest","unhushing the crowd"],"synonyms":["disturbing","disrupting","breaking the silence","making noisy"],"antonyms":["hushing","silencing","quieting"]},{"part_of_speech":"noun","definition":"静寂を破ること、騒がしくすること","english_definition":"The act of disrupting or breaking a silence.","examples":[{"sentence":"The unhushing of the forest began with the first rays of sunlight.","translation":"森の静寂が破られるのは、最初の日差しが差し込んだ時だった。"},{"sentence":"The unhushing of the crowd was sudden and chaotic.","translation":"群衆の静寂が破られたのは、突然で混沌としていた。"}],"collocations":["the unhushing of the night","the unhushing of the crowd","the unhushing of the city"],"synonyms":["disturbance","disruption","noise-making","breaking of silence"],"antonyms":["silence","quiet","hush"]}],"etymology":{"value":"\"Unhushing\" is derived from the verb \"unhush\", which is formed by adding the prefix \"un-\" (meaning 'not' or 'opposite of') to the verb \"hush\" (meaning 'to make or become silent'). Thus, \"unhush\" means to reverse the action of hushing, i.e., to make something no longer silent. The addition of \"-ing\" creates the present participle or gerund form.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈhʌʃɪŋ/","syllables":"un-hush-ing"},"inflection":{"verb_forms":{"present_participle":"unhushing"},"noun_plural":"unhushings"},"usage_notes":{"explanation":"\"Unhushing\" is a relatively rare word, primarily used in descriptive or literary contexts to emphasize the act of breaking or disrupting a previously established silence. It can be used both as a verb (present participle) and as a noun (gerund). The word often carries a sense of suddenness or forcefulness in the disruption of silence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unhushing was very quiet.","correct":"✓ The unhushing was very sudden.","note":"The word \"unhushing\" implies a disruption of quiet, so describing it as \"quiet\" is contradictory. Use adjectives that describe the manner of the disruption, such as \"sudden\", \"loud\", or \"abrupt\"."},{"incorrect":"✗ He is unhushing.","correct":"✓ He is unhushing the crowd.","note":"When used as a verb, \"unhushing\" typically requires an object (what is being made un-silent)."}],"priority":"★★☆"},"related_words":{"derivatives":["hush (verb, noun)","unhush (verb)"],"antonyms":["hushing","silencing","quieting"],"synonyms":["disturbing","disrupting","awakening","agitating"]},"level_frequency":{"CEFR":"N/A (word not commonly found in CEFR level vocabulary lists)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unhushing\" is relatively uncommon and may not be familiar to many English speakers. It is formed by adding the prefix \"un-\" to \"hush\" and then adding \"-ing\" to create a present participle or gerund. Understanding the meanings of \"un-\" and \"hush\" is essential to comprehending \"unhushing.\" The word is primarily used in descriptive or literary contexts to convey the idea of breaking or disrupting a silence, often with a sense of suddenness or forcefulness. Due to its rarity and specific usage, it is more likely to be encountered in advanced texts or creative writing.","priority":"★☆☆"},"example_sentences":[{"sentence":"The rain was unhushing the rooftops.","translation":"雨が屋根の上の静けさを破っていた。","type":"verb (present participle)","meaning_category":"静寂を破る"},{"sentence":"The unhushing of the forest at dawn was a symphony of birdsong.","translation":"夜明けに森の静寂が破られるのは、鳥の歌のシンフォニーだった。","type":"noun (gerund)","meaning_category":"静寂を破ること"},{"sentence":"The children were unhushing the solemn atmosphere with their giggles.","translation":"子供たちはくすくす笑い声で厳粛な雰囲気を騒がしくしていた。","type":"verb (present participle)","meaning_category":"騒がしくする"}]}