{"word":"defocusing","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"焦点ぼけ、焦点が合っていない状態","english_definition":"The act or process of making something out of focus, or the state of being out of focus.","examples":[{"sentence":"The defocusing of the image made it difficult to see the details.","translation":"画像の焦点ぼけによって、詳細が見えにくくなった。"}],"collocations":["image defocusing","laser beam defocusing"],"synonyms":["blurring","softening","fuzziness"],"antonyms":["focusing","sharpening"]},{"part_of_speech":"verb","definition":"焦点をぼかすこと (defocusの現在分詞)","english_definition":"Present participle of defocus: to make something out of focus.","examples":[{"sentence":"He was defocusing the lens to create a dreamy effect.","translation":"彼は夢のような効果を出すためにレンズの焦点をぼかしていた。"}],"collocations":["defocusing a lens","defocusing an image"],"synonyms":["blurring","softening"],"antonyms":["focusing","sharpening"]}],"etymology":{"value":"The word 'defocusing' is derived from 'defocus', which is formed by adding the prefix 'de-' (meaning 'opposite of' or 'undoing') to the word 'focus'. The suffix '-ing' turns it into a present participle or gerund.","priority":"☆☆☆"},"pronunciation":{"ipa":"/diːˈfoʊkəsɪŋ/","syllables":"de-fo-cus-ing"},"inflection":{"verb_forms":{"present_participle":"defocusing"}},"usage_notes":{"explanation":"'Defocusing' can be used as a noun to describe the state of being out of focus, or as a verb (present participle) to describe the action of making something out of focus. It is commonly used in the context of photography, optics, and vision.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The defocusing was very bad, I couldn't see anything.","correct":"✓ The defocus was very bad, I couldn't see anything.","note":"'Defocus' is the noun form referring to the lack of focus, while 'defocusing' refers to the act of making something out of focus or the ongoing state of being out of focus. The choice depends on the intended meaning."}],"priority":"☆☆☆"},"related_words":{"derivatives":["defocus (verb, noun)","defocused (adjective)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"'Defocusing' refers to the act of making something blurry or out of focus. It can also describe the state of being blurry. This word is often used in technical contexts related to photography, optics, or vision science. It implies a deliberate or unintentional act of making something less clear. Understanding this word helps in comprehending descriptions of image quality and optical adjustments."},"example_sentences":[{"sentence":"The photographer used defocusing to create a soft, dreamlike portrait.","translation":"写真家は、ぼかしを使って、柔らかく夢のようなポートレートを作成しました。","type":"verb","meaning_category":"焦点をぼかす"},{"sentence":"The defocusing of the projector made the presentation unreadable.","translation":"プロジェクターの焦点ぼけにより、プレゼンテーションが読めなくなった。","type":"noun","meaning_category":"焦点ぼけ"}]}