{"word":"Jebusite","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"エブス人：古代カナンに住んでいた民族。特にエルサレムを占拠していた民族を指す。","english_definition":"A member of an ancient Canaanite people who inhabited Jerusalem before it was conquered by David.","examples":[{"sentence":"The Jebusites controlled Jerusalem until David captured the city.","translation":"ダビデがエルサレムを占領するまで、エブス人がエルサレムを支配していた。"},{"sentence":"Archaeological evidence suggests that the Jebusites had a well-fortified city.","translation":"考古学的証拠は、エブス人が堅固に要塞化された都市を持っていたことを示唆している。"}],"collocations":["ancient Jebusites","Jebusite king","Jebusite territory","conquest of the Jebusites"],"synonyms":["Canaanite inhabitant of Jerusalem"],"antonyms":[]}],"etymology":{"value":"Late Latin Jebusaeus, from Hebrew Yəbûsî, from Yəbûs (Jerusalem).","priority":"★★★"},"pronunciation":{"ipa":"ˈdʒɛbjʊˌzaɪt","syllables":"Je-bu-site"},"inflection":{"noun_plural":"Jebusites"},"usage_notes":{"explanation":"The term \"Jebusite\" primarily refers to the inhabitants of Jerusalem before its conquest by King David, as described in the Hebrew Bible. It is often used in historical and religious contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Jebusites were a tribe of Israel.","correct":"✓ The Jebusites were a Canaanite people who lived in Jerusalem.","note":"The Jebusites were not Israelites; they were a Canaanite people who predated the Israelite conquest."}],"priority":"★★★"},"related_words":{"derivatives":["Jebus (Jerusalem's earlier name)"],"phrases":["City of the Jebusites"],"related_historical_figures":["King David"],"related_places":["Jerusalem","Canaan"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'Jebusite' is a historical term referring to an ancient group of people who lived in Jerusalem before it was conquered by King David. It is primarily used in religious and historical contexts related to the Bible and ancient Near East history. Understanding this term requires familiarity with biblical narratives and ancient history.","priority":"★★☆"},"example_sentences":[{"sentence":"David's army fought against the Jebusites to take control of Jerusalem.","translation":"ダビデの軍隊は、エルサレムを支配するためにエブス人と戦った。","type":"historical context","meaning_category":"historical event"},{"sentence":"According to the Bible, the Jebusites were skilled builders and defenders of their city.","translation":"聖書によれば、エブス人は熟練した建築家であり、都市の防衛者であった。","type":"religious text","meaning_category":"biblical reference"}]}