{"word":"mesorrhine","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"中鼻の、中鼻型の：鼻の幅が平均的な","english_definition":"Having a nose of medium breadth; neither platyrrhine (broad-nosed) nor leptorrhine (narrow-nosed).","examples":[{"sentence":"The mesorrhine nasal index is typical of many European populations.","translation":"中鼻型の鼻の指標は、多くのヨーロッパの集団に典型的です。"},{"sentence":"Anthropologists use the mesorrhine classification to describe nasal morphology.","translation":"人類学者は鼻の形態を記述するために中鼻型の分類を使用します。"}],"collocations":["mesorrhine nasal index","mesorrhine skull"],"synonyms":["medium-nosed"],"antonyms":["platyrrhine","leptorrhine"]}],"etymology":{"value":"From the Greek words 'mesos' (middle) and 'rhis' (nose).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɛzəˌraɪn/","syllables":"mes-o-rrhine"},"inflection":{"notes":"Comparative and superlative forms are possible (more mesorrhine, most mesorrhine), but rarely used."},"usage_notes":{"explanation":"'Mesorrhine' is a term primarily used in physical anthropology and related fields to classify nasal shapes based on the nasal index (the ratio of nasal breadth to nasal height). It indicates a nose that is neither particularly broad nor narrow.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient has a mesorrhine condition.","correct":"✓ The patient has a mesorrhine nose.","note":"'Mesorrhine' is an adjective describing the nose, not a medical condition."}],"priority":"★☆☆"},"related_words":{"derivatives":["mesorrhiny (noun): the state of having a mesorrhine nose"],"related_terms":["nasal index","platyrrhine","leptorrhine"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Primarily used in academic or technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Mesorrhine' is a technical term used in anthropology to describe a nose of medium breadth. It is not commonly used in everyday language. Understanding this term requires familiarity with anthropological classifications.","priority":"★☆☆"},"example_sentences":[{"sentence":"The study analyzed mesorrhine skulls from various archaeological sites.","translation":"その研究は、さまざまな考古学的遺跡からの中鼻型の頭蓋骨を分析しました。","type":"adjective","meaning_category":"descriptive"},{"sentence":"Individuals with a mesorrhine nose tend to have a nasal index between 70 and 85.","translation":"中鼻型の人々は、鼻の指標が70から85の間になる傾向があります。","type":"adjective","meaning_category":"descriptive"}]}