{"word":"febricide","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"兄弟殺し、特に弟殺し","english_definition":"The killing of one's brother, especially one's younger brother.","examples":[{"sentence":"The play explores themes of fratricide and febricide within the royal family.","translation":"その劇は、王室における兄弟殺しと弟殺しのテーマを探求している。"},{"sentence":"In some cultures, febricide is considered an even greater taboo than fratricide in general.","translation":"いくつかの文化では、弟殺しは一般的な兄弟殺しよりもさらに大きなタブーと見なされている。"}],"collocations":["commit febricide (弟殺しを犯す)","act of febricide (弟殺しの行為)"],"synonyms":["fratricide (兄弟殺し)","sibling killing (兄弟姉妹殺し)"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin words \"frater\" (brother) and \"-cide\" (killer, act of killing). The \"febri-\" prefix is a less common variant, specifically denoting a younger brother.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɛbrɪsaɪd/","syllables":"fe-bri-cide"},"inflection":{"noun_plural":"febricides"},"usage_notes":{"explanation":"The term \"febricide\" is a specific type of fratricide, focusing on the killing of a younger brother. While \"fratricide\" is a more general term for the killing of any sibling, \"febricide\" specifies the relationship between the killer and the victim. It is a relatively rare term, often used in literature, psychology, or criminology when the specific relationship is relevant.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was charged with febricide after killing his sister.","correct":"✓ He was charged with sororicide after killing his sister. / ✓ He was charged with fratricide after killing his sister.","note":"\"Febricide\" specifically refers to killing a younger brother. Killing a sister is \"sororicide,\" and killing any sibling is \"fratricide.\""}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["fratricide (兄弟殺し)","sororicide (姉妹殺し)","parricide (親殺し)","homicide (殺人)","infanticide (幼児殺し)","matricide (母親殺し)","patricide (父親殺し)","regicide (国王殺し)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Febricide\" is a highly specialized term that refers to the act of killing one's younger brother. It is not a commonly used word and is typically found in contexts related to criminology, psychology, or literature when discussing specific types of familial violence. Understanding the term requires a grasp of Latin prefixes and suffixes, as well as the nuances of sibling relationships. It is important to distinguish it from the more general term \"fratricide,\" which refers to the killing of any sibling. Due to its rarity and specificity, \"febricide\" is considered an advanced vocabulary word.","example_sentences":[]}}