{"word":"crow-silk","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A cheap, coarse kind of silk.","english_definition":"A cheap, coarse kind of silk.","examples":[{"sentence":"The dress was made of crow-silk, but it looked elegant nonetheless.","translation":"そのドレスは粗末な絹でできていたが、それでも上品に見えた。"}],"collocations":[],"synonyms":["cheap silk","coarse silk"],"antonyms":["fine silk","high-quality silk"]}],"etymology":{"value":"The etymology of 'crow-silk' is not definitively known, but it likely refers to a type of silk that is dark or coarse, resembling the color or texture associated with crows. The term suggests a lower quality or less refined silk compared to finer varieties.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈkroʊˌsɪlk/","syllables":"crow-silk"},"inflection":{"noun_plural":"crow-silks"},"usage_notes":{"explanation":"'Crow-silk' is an archaic term referring to a cheap or coarse type of silk. It is not commonly used in modern English. When describing inexpensive or low-quality silk, more contemporary terms like 'cheap silk' or 'coarse silk' are generally preferred.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She wore a crow-silk dress to the gala.","correct":"✓ She wore a dress made of crow-silk to the gala.","note":"While grammatically correct, using 'crow-silk dress' might sound odd to modern ears. It's better to say 'a dress made of crow-silk' or 'a cheap silk dress'."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - This term is rarely used in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Crow-silk' is a historical term referring to a cheap, coarse type of silk. Due to its rarity in modern usage, understanding this term requires familiarity with historical contexts and vocabulary. It is not part of the common lexicon and would likely be encountered only in older literature or specialized texts. When referring to low-quality silk in contemporary contexts, it's preferable to use terms like 'cheap silk' or 'coarse silk'."},"example_sentences":[{"sentence":"The merchant offered crow-silk at a low price.","translation":"その商人は粗末な絹を安価で提供した。","type":"noun","meaning_category":"cheap silk"},{"sentence":"Her gown, though made of crow-silk, was skillfully embroidered.","translation":"彼女のガウンは粗末な絹でできていたが、巧みに刺繍が施されていた。","type":"noun","meaning_category":"coarse silk"}]}