{"word":"nonfidelity","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"不誠実、不貞、不実","english_definition":"Lack of fidelity; unfaithfulness, disloyalty, or infidelity, especially in a marriage or romantic relationship.","examples":[{"sentence":"Her therapist suggested that the root of their marital problems was his long history of nonfidelity.","translation":"彼女のセラピストは、彼らの夫婦問題の根源は彼の長年の不貞の歴史にあると示唆した。"},{"sentence":"The novel explores the emotional consequences of nonfidelity on all parties involved.","translation":"その小説は、不貞が関係者全員に与える感情的な影響を探求している。"}],"collocations":["marital nonfidelity (夫婦間の不貞)","emotional nonfidelity (精神的な不貞)","sexual nonfidelity (肉体的な不貞)"],"synonyms":["infidelity","unfaithfulness","adultery","disloyalty","cheating"],"antonyms":["fidelity","faithfulness","loyalty"]},{"part_of_speech":"noun","definition":"（情報伝達・記録における）不正確さ、忠実でないこと","english_definition":"Lack of accuracy or faithfulness in the transmission or recording of information.","examples":[{"sentence":"The audio recording suffered from nonfidelity, making it difficult to understand the conversation.","translation":"その音声録音は忠実度が低く、会話を理解するのが難しかった。"},{"sentence":"The simulation's nonfidelity to real-world conditions limited its usefulness.","translation":"そのシミュレーションの現実世界の状況に対する忠実度の低さが、その有用性を制限した。"}],"collocations":["audio nonfidelity (音声の不忠実さ)","data nonfidelity (データの不忠実さ)","simulation nonfidelity (シミュレーションの不忠実さ)"],"synonyms":["inaccuracy","distortion","corruption","deviation"],"antonyms":["accuracy","fidelity","precision"]}],"etymology":{"value":"\"Non-\" (否定の接頭辞) + \"fidelity\" (忠実、誠実)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnfɪˈdɛlɪti/","syllables":"non-fi-del-i-ty"},"inflection":{"noun_plural":"nonfidelities"},"usage_notes":{"explanation":"\"Nonfidelity\" is a formal term that describes a lack of faithfulness or accuracy. It is most commonly used to refer to infidelity in a romantic relationship, but can also be used in technical contexts to describe the degree to which a system or recording accurately represents the original source. It is less common than \"infidelity\" but more precise in certain contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed nonfidelity to his job.","correct":"✓ He showed a lack of fidelity to his job. / ✓ He was disloyal to his job.","note":"While technically correct, \"nonfidelity\" is rarely used in the context of job loyalty. \"Lack of fidelity\" or \"disloyalty\" are more common and natural-sounding alternatives."}],"priority":"★☆☆"},"related_words":{"derivatives":["fidelity","infidelity","nonfidelitous"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Nonfidelity\" is a relatively uncommon and formal term. It primarily refers to a lack of faithfulness, most often in the context of romantic relationships (synonymous with infidelity). It can also describe a lack of accuracy in data or recordings. Due to its formality, it is more often encountered in academic or technical writing than in everyday conversation. Understanding its meaning requires a solid grasp of the word \"fidelity\" and the function of the negative prefix \"non-\". "},"example_sentences":[{"sentence":"The couple sought counseling to address the issues stemming from his repeated acts of nonfidelity.","translation":"その夫婦は、彼の繰り返される不貞行為から生じる問題に対処するためにカウンセリングを求めた。","type":"noun","meaning_category":"不貞"},{"sentence":"The experiment was compromised by the nonfidelity of the data collected.","translation":"その実験は、収集されたデータの不正確さによって損なわれた。","type":"noun","meaning_category":"不正確さ"}]}