{"word":"admonisher","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"忠告する人、訓戒する人、たしなめる人","english_definition":"a person who admonishes; one who gives earnest advice or warning.","examples":[{"sentence":"He acted as an admonisher, pointing out the flaws in their plan.","translation":"彼は忠告者として行動し、彼らの計画の欠点を指摘した。"},{"sentence":"The old sage was known as a wise admonisher.","translation":"その老賢者は、賢明な忠告者として知られていた。"}],"collocations":["wise admonisher (賢明な忠告者)","stern admonisher (厳格な忠告者)"],"synonyms":["advisor","counselor","mentor","reprover","critic"],"antonyms":["flatterer","praiser"]}],"etymology":{"value":"admonish + -er (名詞を作る接尾辞)","priority":"★★☆"},"pronunciation":{"ipa":"/ædˈmɒnɪʃər/","syllables":"ad-mon-ish-er"},"inflection":{"noun_plural":"admonishers"},"usage_notes":{"explanation":"'Admonisher' is a relatively formal word. It implies a serious and earnest attempt to correct or improve someone's behavior or thinking through advice or warnings. It is less common than words like 'advisor' or 'critic'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He was a good admonisher, always flattering his friends.","correct":"He was a good admonisher, always giving constructive criticism to his friends.","note":"An admonisher provides constructive criticism, not flattery."}],"priority":"★☆☆"},"related_words":{"derivatives":["admonish (動詞: 忠告する、訓戒する)","admonishment (名詞: 忠告、訓戒)","admonition (名詞: 忠告、訓戒)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'admonisher' is a formal term for someone who gives advice or warnings, often to correct behavior. It's not a common word in everyday conversation, so it's more likely to appear in literature, formal writing, or when describing someone in a serious or official role. The act of admonishing implies a sense of responsibility or authority on the part of the admonisher."},"example_sentences":[{"sentence":"The teacher acted as an admonisher, correcting the students' mistakes.","translation":"先生は生徒たちの間違いを正す、忠告者としての役割を果たした。","type":"noun","meaning_category":"忠告する人"},{"sentence":"As a parent, she often found herself in the role of an admonisher.","translation":"親として、彼女はしばしば訓戒する立場にいることに気づいた。","type":"noun","meaning_category":"訓戒する人"}]}