{"word":"Pleiad","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"プレアデス星団、すばる","english_definition":"A star cluster in the constellation Taurus, visible to the naked eye; also known as the Seven Sisters or M45.","examples":[{"sentence":"The Pleiad is a beautiful cluster of stars.","translation":"プレアデス星団は美しい星の集まりです。"},{"sentence":"In Japanese, the Pleiad is called 'Subaru'.","translation":"日本語では、プレアデス星団は「すばる」と呼ばれています。"}],"collocations":["observe the Pleiad","view the Pleiad","Pleiad star cluster"],"synonyms":["Seven Sisters (星団の別名)","M45 (星団のカタログ番号)"],"antonyms":[]},{"part_of_speech":"noun","definition":"（古代ギリシャの）プレアデス、七人姉妹","english_definition":"(Greek mythology) Any of the seven daughters of Atlas and Pleione, transformed into stars.","examples":[{"sentence":"The Pleiades were daughters of Atlas.","translation":"プレアデスはアトラスの娘たちでした。"}],"collocations":["myth of the Pleiades","story of the Pleiades"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Ancient Greek Πλειάδες (Pleiádes), plural of Πλειάς (Pleiás), of uncertain origin. Possibly related to πλεῖν (pleîn, \"to sail\"), as the rising of the cluster marked the start of the sailing season in antiquity.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈplaɪ.əd/","syllables":"Plei-ad"},"inflection":{"noun_plural":"Pleiades"},"usage_notes":{"explanation":"The word \"Pleiad\" refers to both the star cluster and the mythological sisters. When referring to the star cluster, it is often used in the singular form, even though it is a cluster of stars. When referring to the mythological figures, it is typically used in the plural form, \"Pleiades.\"","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Pleiads last night.","correct":"✓ I saw the Pleiad last night.","note":"When referring to the star cluster as a whole, use the singular form 'Pleiad' even though it consists of many stars."},{"incorrect":"✗ The Pleiad is a group of seven star.","correct":"✓ The Pleiad is a group of seven stars.","note":"The Pleiad consists of multiple stars, so use the plural 'stars'."}],"priority":"★★☆"},"related_words":{"derivatives":["Pleiadian (形容詞: プレアデス星団の、プレアデス星人の)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"比較的低頻度 (Relatively low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"Pleiad\" has two main meanings: a star cluster and mythological figures. It is more commonly used to refer to the star cluster, which is visible to the naked eye under good conditions. The mythological meaning refers to the seven daughters of Atlas and Pleione in Greek mythology. The word is not very common in everyday conversation but may appear in discussions about astronomy or mythology."},"example_sentences":[{"sentence":"The **Pleiad** is easily visible in the night sky during winter.","translation":"プレアデス星団は冬の夜空によく見えます。","type":"noun","meaning_category":"星団"},{"sentence":"The myth of the **Pleiades** explains their origin as stars.","translation":"プレアデスの神話は、彼女たちが星になった起源を説明しています。","type":"noun","meaning_category":"ギリシャ神話の七人姉妹"}]}