{"word":"bovaristic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"ボヴァリー的な、ボヴァリズムの傾向がある","english_definition":"Characterized by bovarysme; affected by an exaggerated, romantic view of oneself and life, often leading to dissatisfaction with reality.","examples":[{"sentence":"Her bovaristic tendencies led her to constantly seek a more exciting and fulfilling life.","translation":"彼女のボヴァリー的な傾向は、常に刺激的で充実した人生を求めるように彼女を導いた。"},{"sentence":"The novel explores the bovaristic dreams of a young woman trapped in a mundane existence.","translation":"その小説は、平凡な生活に閉じ込められた若い女性のボヴァリー的な夢を描いている。"}],"collocations":["bovaristic tendencies","bovaristic dreams","bovaristic ideals","bovaristic longings","bovaristic worldview"],"synonyms":["romantic","idealistic","fanciful","escapist","visionary"],"antonyms":["realistic","pragmatic","down-to-earth","matter-of-fact"]}],"etymology":{"value":"From *bovarysme* (French), named after Emma Bovary, the protagonist of Gustave Flaubert's novel *Madame Bovary* (1856). Emma Bovary is known for her romantic fantasies and dissatisfaction with her ordinary life.","priority":"★★★"},"pronunciation":{"ipa":"/ˌboʊvəˈrɪstɪk/","syllables":"bo-var-is-tic"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns."},"usage_notes":{"explanation":"'Bovaristic' describes a state of mind where someone has an unrealistic, romanticized view of themselves and the world, often leading to disappointment and a yearning for something more exciting or fulfilling. It is directly linked to the character of Emma Bovary from Flaubert's novel, who embodies this trait.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a bovaristic approach to mathematics.","correct":"✓ He had a romantic approach to mathematics.","note":"'Bovaristic' is specifically related to romanticized views of life and self, not general approaches to subjects like mathematics."},{"incorrect":"✗ The bovaristic novel was a bestseller.","correct":"✓ The romantic novel was a bestseller.","note":"While a novel might depict bovaristic characters, calling the novel itself 'bovaristic' is less common than describing it as 'romantic' or 'idealistic'."}],"priority":"★☆☆"},"related_words":{"derivatives":["bovarysme (noun): bovarysme"],"phrases":["Madame Bovary (noun): Madame Bovary"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Bovaristic' is a relatively rare and sophisticated term used to describe a specific psychological or literary concept. It refers to the tendency to have exaggerated, romanticized, and unrealistic views of oneself and life, often leading to disillusionment and dissatisfaction. Understanding this term requires familiarity with Gustave Flaubert's novel *Madame Bovary*, as the term is directly derived from the character of Emma Bovary, who embodies these traits. It is more commonly encountered in literary analysis and psychological discussions rather than everyday conversation."},"example_sentences":[{"sentence":"Her **bovaristic** longing for a life of luxury and excitement blinded her to the simple joys around her.","translation":"彼女の贅沢で刺激的な生活へのボヴァリー的な憧れは、彼女の周りの単純な喜びを見えなくさせた。","type":"adjective","meaning_category":"general"},{"sentence":"The protagonist's **bovaristic** nature made her an easy target for manipulation.","translation":"主人公のボヴァリー的な性質は、彼女を操作の簡単な標的にした。","type":"adjective","meaning_category":"character"},{"sentence":"The film portrays the **bovaristic** disillusionment of a woman trapped in a loveless marriage.","translation":"その映画は、愛のない結婚に閉じ込められた女性のボヴァリー的な幻滅を描いている。","type":"adjective","meaning_category":"themes"}]}