{"word":"abandoner","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"見捨てる人、放棄する人","english_definition":"A person who abandons or deserts someone or something.","examples":[{"sentence":"He was labeled an abandoner after leaving his family.","translation":"彼は家族を捨てた後、見捨てる人というレッテルを貼られた。"},{"sentence":"The company became known as an abandoner of its employees.","translation":"その会社は従業員を見捨てる会社として知られるようになった。"}],"collocations":["a child abandoner (子供を捨てる人)","an animal abandoner (動物を捨てる人)"],"synonyms":["deserter","defector","quitter","forsaker"],"antonyms":["supporter","protector","rescuer"]}],"etymology":{"value":"The word 'abandoner' is derived from the verb 'abandon,' which comes from the Old French 'abandoner,' meaning 'to give up control of, relinquish, desert.' The suffix '-er' is added to form a noun denoting a person who performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈbændənər/","syllables":"a-ban-don-er"},"inflection":{"noun_plural":"abandoners"},"usage_notes":{"explanation":"The term 'abandoner' is typically used in negative contexts to describe someone who has failed to fulfill their responsibilities or commitments. It often carries a strong connotation of betrayal or neglect. It can be applied to individuals who abandon their families, companies that abandon their employees, or countries that abandon their allies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an abandoner of his car.","correct":"✓ He abandoned his car.","note":"'Abandoner' refers to a person, not an action related to an object. Use the verb 'abandon' instead."},{"incorrect":"✗ She is an abandoner, so sad.","correct":"✓ She is an abandoner, which is so sad.","note":"Use a relative clause to connect the statement about being an abandoner to the feeling of sadness."}],"priority":"★★☆"},"related_words":{"derivatives":["abandon (verb, noun)","abandonment (noun)"],"phrasal_verbs":[],"related_nouns":["abandoned child","abandoned property"],"related_adjectives":["abandoned"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'abandoner' is a formal term used to describe someone who leaves or deserts a person, thing, or responsibility. It implies a failure to fulfill a duty or commitment. This word is not commonly used in everyday conversation and is more often found in legal or formal contexts. Understanding the root word 'abandon' is helpful in grasping the meaning of 'abandoner.'"},"example_sentences":[{"sentence":"The court identified him as an abandoner of his parental duties.","translation":"裁判所は彼を親としての義務を放棄した人と認定した。","type":"noun","meaning_category":"見捨てる人"},{"sentence":"She was seen as an abandoner of her principles when she compromised her values for personal gain.","translation":"彼女は個人的な利益のために自分の価値観を妥協したとき、自分の原則を放棄した人と見なされた。","type":"noun","meaning_category":"放棄する人"}]}