{"word":"Resinoids","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"レジノイド：天然樹脂から溶媒抽出によって得られる、香料や医薬品として用いられる半固体または固体の物質。","english_definition":"Resinoids are extracts from natural raw materials, such as plants or animal products, obtained by solvent extraction. They are semi-solid or solid materials used in perfumery, aromatherapy, and pharmaceuticals.","examples":[{"sentence":"Resinoids are often used as fixatives in perfumes.","translation":"レジノイドは香水において保留剤としてよく使用される。"},{"sentence":"Benzoin resinoid has a sweet, balsamic aroma.","translation":"安息香レジノイドは甘くバルサムのような香りを持つ。"},{"sentence":"Oakmoss resinoid is a common ingredient in chypre perfumes.","translation":"オークモスレジノイドはシプレ香水によく使われる成分である。"}],"collocations":["benzoin resinoid","oakmoss resinoid","olibanum resinoid","extraction of resinoids","use of resinoids in perfumery"],"synonyms":["oleoresin","absolute","extract"],"antonyms":[]}],"etymology":{"value":"'Resin'（樹脂）と '-oid'（～のような）を組み合わせた造語。樹脂に似た物質であることを示す。","priority":"★★☆"},"pronunciation":{"ipa":"ˈrɛzɪˌnɔɪdz","syllables":"Res-i-noids"},"inflection":{"noun_plural":"Resinoids"},"usage_notes":{"explanation":"Resinoids are complex mixtures containing resins, essential oils, waxes, and other compounds extracted from natural sources. They are typically more viscous and less volatile than essential oils. Resinoids are used to impart depth, richness, and longevity to fragrances.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Resinoids are the same as essential oils.","correct":"✓ Resinoids are different from essential oils due to their extraction process and composition.","note":"Resinoids are extracted using solvents, while essential oils are typically extracted by steam distillation or cold pressing. Resinoids also contain non-volatile components like resins and waxes, which are not present in essential oils."}],"priority":"★☆☆"},"related_words":{"derivatives":["resin","oleoresin","absolute","extract"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Resinoids' are complex extracts from natural sources, used in perfumery and aromatherapy. They are similar to resins but obtained through solvent extraction, resulting in a mixture of resins, essential oils, and waxes. Understanding their composition and extraction process is key to differentiating them from essential oils and absolutes."},"example_sentences":[{"sentence":"The perfumer carefully selected the resinoids to create a unique fragrance profile.","translation":"調香師は独特な香りのプロファイルを作り出すために、レジノイドを注意深く選択した。","type":"general","meaning_category":"香料"},{"sentence":"Some resinoids are known for their fixative properties, helping to prolong the scent of a perfume.","translation":"いくつかのレジノイドは、香水の香りを長持ちさせる保留剤としての特性で知られている。","type":"properties","meaning_category":"香料"},{"sentence":"The extraction of resinoids involves the use of solvents to draw out the desired compounds from the raw material.","translation":"レジノイドの抽出には、原料から目的の化合物を引き出すために溶媒の使用が含まれる。","type":"extraction","meaning_category":"extraction"}]}