{"word":"nonnarration","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"非ナレーション、物語形式でないこと、物語的説明の欠如","english_definition":"The absence of narration; a lack of narrative or storytelling.","examples":[{"sentence":"The film employed nonnarration, relying solely on visuals and sound to convey its message.","translation":"その映画は非ナレーションを採用し、視覚と音だけでメッセージを伝えた。"},{"sentence":"The experimental novel explored themes of isolation through nonnarration, presenting fragmented scenes without a guiding voice.","translation":"その実験小説は、物語的な説明を排し、断片的なシーンを提示することで、孤立というテーマを探求した。"},{"sentence":"The documentary used a nonnarration approach, allowing the subjects to speak for themselves without commentary.","translation":"そのドキュメンタリーは非ナレーションの手法を用い、解説なしで被写体自身に語らせた。"}],"collocations":["employ nonnarration","nonnarration approach","experimental nonnarration"],"synonyms":["absence of narration","lack of narrative","non-narrative","descriptive","presentational"],"antonyms":["narration","storytelling","narrative","commentary"]},{"part_of_speech":"adjective","definition":"非ナレーションの、物語形式でない、物語的説明を含まない","english_definition":"Not involving narration; lacking a narrative or storytelling element.","examples":[{"sentence":"The nonnarration style of the art installation forced viewers to interpret the meaning for themselves.","translation":"そのアートインスタレーションの非ナレーション的なスタイルは、鑑賞者に意味を自分で解釈させることを強いた。"},{"sentence":"The play featured nonnarration sequences, relying on visual metaphors and symbolic actions.","translation":"その劇は、視覚的なメタファーと象徴的な行動に頼った非ナレーションのシークエンスを特徴としていた。"},{"sentence":"A nonnarration film can be challenging for audiences accustomed to traditional storytelling.","translation":"非ナレーション映画は、伝統的な物語形式に慣れている観客にとっては難しい場合がある。"}],"collocations":["nonnarration style","nonnarration sequences","nonnarration film"],"synonyms":["non-narrative","descriptive","presentational","non-storytelling"],"antonyms":["narrative","storytelling","narrational"]}],"etymology":{"value":"\"non-\" (否定接頭辞) + \"narration\" (物語ること、ナレーション)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒn.næˈreɪ.ʃən/","syllables":"non-nar-ra-tion"},"inflection":{"noun_plural":"nonnarrations"},"usage_notes":{"explanation":"\"Nonnarration\" refers to the absence of a narrator or a traditional storytelling structure. It's often used in experimental art forms like film, literature, and theater to challenge conventional narrative expectations. It can create a more ambiguous and subjective experience for the audience, forcing them to actively engage with the work and construct their own meaning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The movie had a non narration.","correct":"✓ The movie used nonnarration.","note":"\"Nonnarration\" is typically used as a concept or approach, not something that a movie \"has.\" It's more accurate to say that a movie \"employs\" or \"uses\" nonnarration."},{"incorrect":"✗ The book was non-narration.","correct":"✓ The book was non-narrative. / ✓ The book employed nonnarration.","note":"When used as an adjective, \"non-narrative\" is more common. \"Nonnarration\" is primarily a noun. To describe the book's approach, use \"employed nonnarration.\""}],"priority":"★★☆"},"related_words":{"derivatives":["narrate","narrative","narrator","narration"],"related_concepts":["experimental film","avant-garde literature","postmodernism","stream of consciousness"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"nonnarration\" describes the lack of a traditional storytelling structure or narrator in a work of art, such as a film or novel. Instead of a clear narrative voice guiding the audience, the work relies on other elements like visuals, sound, or fragmented scenes to convey meaning. This approach challenges conventional expectations and often requires the audience to actively participate in interpreting the work's message. It's a concept often found in experimental or avant-garde art forms.","priority":"★★☆"},"example_sentences":[{"sentence":"The artist deliberately chose nonnarration to avoid imposing a single interpretation on the viewers.","translation":"アーティストは、鑑賞者に単一の解釈を押し付けることを避けるために、意図的に非ナレーションを選んだ。","type":"noun","meaning_category":"absence of narration"},{"sentence":"The documentary's nonnarration approach allowed the subjects' experiences to speak for themselves.","translation":"そのドキュメンタリーの非ナレーション的なアプローチは、被写体の経験がそれ自体を語ることを可能にした。","type":"adjective","meaning_category":"lacking narrative"},{"sentence":"The use of nonnarration in the film created a sense of ambiguity and disorientation.","translation":"その映画における非ナレーションの使用は、曖昧さと方向感覚の喪失感を生み出した。","type":"noun","meaning_category":"absence of narration"},{"sentence":"The nonnarration sequences were interspersed with moments of traditional storytelling.","translation":"非ナレーションのシークエンスは、伝統的な物語形式の瞬間と交互に配置されていた。","type":"adjective","meaning_category":"lacking narrative"}]}