{"word":"goetical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"魔法の、特に黒魔術の、悪魔学の","english_definition":"Of or pertaining to goety; magical, especially involving black magic or demonology.","examples":[{"sentence":"The goetical arts were often associated with forbidden knowledge.","translation":"ゲーティアの術は禁断の知識と関連付けられることが多かった。"},{"sentence":"He delved into goetical practices, seeking power from dark forces.","translation":"彼は暗黒の力から力を得ようと、ゲーティアの実践に没頭した。"}],"collocations":["goetical magic","goetical practices","goetical rituals"],"synonyms":["magical","sorcerous","demonic","diabolical","occult"],"antonyms":["divine","holy","angelic"]}],"etymology":{"value":"Derived from 'goety,' which comes from the Greek word 'goēteia' (γοητεία) meaning sorcery, witchcraft, or magic, especially black magic.","priority":"★★★"},"pronunciation":{"ipa":"/ɡoʊˈɛtɪkəl/","syllables":"go-et-i-cal"},"inflection":{"notes":"Adjective, comparative and superlative forms are 'more goetical' and 'most goetical' respectively, though rarely used."},"usage_notes":{"explanation":"'Goetical' is a relatively rare term, primarily used in historical or occult contexts to describe magic that involves the summoning or control of spirits, particularly demons. It is often contrasted with 'theurgical' magic, which seeks to invoke divine powers.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used goetical methods to heal the sick.","correct":"✓ He used magical or theurgical methods to heal the sick.","note":"'Goetical' typically refers to darker, demonic magic, not healing. Use 'magical' or 'theurgical' for healing contexts."}],"priority":"★★☆"},"related_words":{"derivatives":["goety (noun: sorcery, black magic)"],"phrases":["Ars Goetia (a section of The Lesser Key of Solomon, detailing the summoning of demons)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Very rare, specialized vocabulary)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Goetical' is a highly specialized term primarily encountered in the context of occult studies, demonology, and historical discussions of magic. Its usage assumes a familiarity with the distinction between different types of magic, particularly the contrast between goety (demon summoning) and theurgy (divine invocation). Due to its rarity and specific connotation, it is not part of general vocabulary. Understanding requires knowledge of classical languages and occult traditions."},"example_sentences":[{"sentence":"The ancient grimoire contained instructions for various goetical operations.","translation":"古代のグリモワールには、さまざまなゲーティアの儀式の手順が記載されていた。","type":"adjective","meaning_category":"魔法の、黒魔術の"},{"sentence":"Some scholars believe that goetical practices were misunderstood forms of ancient religion.","translation":"一部の学者は、ゲーティアの実践は古代宗教の誤解された形態であると考えている。","type":"adjective","meaning_category":"悪魔学の"}]}