{"word":"bredi","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(South African, often Afrikaans) A type of stew, typically made with meat and vegetables.","english_definition":"A South African stew, usually made with meat and vegetables.","examples":[{"sentence":"My grandmother makes the best tomato bredi.","translation":"私の祖母は最高のトマトブレディを作る。"},{"sentence":"Waterblommetjie bredi is a traditional South African dish.","translation":"ウォーターブロメッチェブレディは伝統的な南アフリカ料理です。"}],"collocations":["tomato bredi","waterblommetjie bredi","green bean bredi"],"synonyms":["stew"],"antonyms":[]}],"etymology":{"value":"From Afrikaans 'bredie', of uncertain origin.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbreɪdi/","syllables":"bre-di"},"inflection":{"noun_plural":"bredis"},"usage_notes":{"explanation":"\"Bredi\" is a term primarily used in South Africa to refer to a specific type of stew. The ingredients can vary, but it generally includes meat (often lamb) and vegetables. It's a staple in South African cuisine, particularly within the Afrikaans community.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm making a stew, is it a bredi?","correct":"✓ I'm making a stew; it's a type of bredi if it's South African in origin.","note":"Not all stews are bredis. The term is specific to South African cuisine."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_dishes":["bobotie","biltong","boerewors"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency outside of South Africa","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Bredi\" is a specialized term primarily used in South Africa. It refers to a specific type of stew, often featuring meat and vegetables. Understanding this word requires familiarity with South African cuisine. Outside of South Africa, the word is not commonly used or understood."},"example_sentences":[{"sentence":"For dinner, we're having a hearty bredi with lamb and potatoes.","translation":"夕食には、ラムとジャガイモを使ったボリュームのあるブレディを食べる予定です。","type":"noun","meaning_category":"stew"},{"sentence":"Every family in South Africa has their own unique recipe for bredi.","translation":"南アフリカのすべての家族には、独自のブレディのレシピがあります。","type":"noun","meaning_category":"stew"}]}