{"word":"Requisitioners","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"複数形の requisitioner。要求者、徴発者、調達担当者。","english_definition":"Plural form of requisitioner. A person who makes a formal demand for something to be done, given, or supplied.","examples":[{"sentence":"The requisitioners submitted their requests to the purchasing department.","translation":"要求者たちは購買部に要求を提出した。"},{"sentence":"The project manager consulted with the requisitioners to clarify the specifications.","translation":"プロジェクトマネージャーは、仕様を明確にするために要求者たちと協議した。"}],"collocations":["internal requisitioners","external requisitioners","project requisitioners"],"synonyms":["requesters","demanders","procurement officers"],"antonyms":["suppliers","providers"],"related_words":["requisition","requisitioned","requisitioning"]}],"etymology":{"value":"From 'requisition' + '-er' (agent noun suffix) + '-s' (plural suffix). 'Requisition' comes from Latin 'requisitio', meaning 'a seeking, inquiry'.","priority":"★★☆"},"pronunciation":{"ipa":"/rɛkwɪˈzɪʃənərz/","syllables":"re-qui-si-tion-ers"},"inflection":{"noun_plural":"requisitioners"},"usage_notes":{"explanation":"'Requisitioners' refers to multiple individuals who are responsible for formally requesting goods or services, often within a business or organizational context. They initiate the process of acquiring resources by submitting requisitions, which are then reviewed and processed by relevant departments such as purchasing or procurement.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The requisitioners is responsible for submitting the form.","correct":"The requisitioners are responsible for submitting the form.","note":"'Requisitioners' is plural, so use the plural verb 'are'."}],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Requisitioners' is a formal term referring to multiple people who make requests for goods or services, typically within a business or organizational setting. Understanding this term requires a familiarity with business processes and vocabulary related to procurement and supply chain management."},"example_sentences":[{"sentence":"The project's success depended on the timely action of the requisitioners.","translation":"プロジェクトの成功は、要求者たちの迅速な行動にかかっていた。","type":"general","meaning_category":"general"},{"sentence":"The training session focused on improving the efficiency of the requisitioners.","translation":"研修セッションでは、要求者たちの効率改善に焦点が当てられた。","type":"business","meaning_category":"business"}]}