{"word":"keystoned","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"台形の形にする、キーストーンの形にする","english_definition":"To shape like a keystone; to give a keystone shape to something.","examples":[{"sentence":"The software keystoned the image to correct for perspective.","translation":"そのソフトウェアは、遠近法を修正するために画像を台形に変形させた。"},{"sentence":"The architect keystoned the archway for added stability.","translation":"建築家は、安定性を高めるためにアーチ道をキーストーンの形にした。"}],"collocations":["keystone an image","keystone an arch","keystone a shape"],"synonyms":["taper","wedge","converge"],"antonyms":["straighten","square"]},{"part_of_speech":"adjective","definition":"台形になった、キーストーンの形をした","english_definition":"Having the shape of a keystone; trapezoidal.","examples":[{"sentence":"The keystoned window added a unique architectural detail to the building.","translation":"台形の窓が、建物に独特の建築的ディテールを加えた。"},{"sentence":"The keystoned design of the logo was both modern and classic.","translation":"ロゴのキーストーン型のデザインは、モダンでありながらクラシックでもあった。"}],"collocations":["keystoned window","keystoned arch","keystoned design"],"synonyms":["trapezoidal","tapered","wedge-shaped"],"antonyms":["square","rectangular"]}],"etymology":{"value":"Derived from 'keystone,' the wedge-shaped stone at the apex of an arch, combined with the suffix '-ed' to form a verb or adjective.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkiːstoʊnd/","syllables":"key-stoned"},"inflection":{"verb_forms":{"present_simple":["keystone","keystones"],"past_simple":"keystoned","past_participle":"keystoned","present_participle":"keystoning"},"adjective_forms":{"comparative":null,"superlative":null}},"usage_notes":{"explanation":"'Keystoned' is often used in the context of image distortion or architectural design. As a verb, it describes the process of altering an image or structure to have a trapezoidal shape. As an adjective, it describes something that already has that shape.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The picture was keystoning.","correct":"✓ The picture was being keystoned.","note":"When used as a verb in the continuous tense, it's more accurate to use the passive form ('being keystoned') to indicate that something is having the keystone effect applied to it."},{"incorrect":"✗ He keystoned the arch with a square stone.","correct":"✓ He built the arch with a keystone.","note":"The verb 'keystone' implies shaping something into a keystone shape, not simply inserting a stone. The second sentence is more appropriate if he used a keystone to build the arch."}],"priority":"★★☆"},"related_words":{"derivatives":["keystone (noun)","keystoning (noun/gerund)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Keystoned' refers to the shape of a keystone, which is a trapezoidal shape. It can be used as an adjective to describe something that has this shape, or as a verb to describe the act of making something have this shape. It's most commonly encountered in technical contexts like architecture, photography, or digital image manipulation.","priority":"★★☆"},"example_sentences":[{"sentence":"The projector's lens keystoned the image, making it wider at the top.","translation":"プロジェクターのレンズが画像を台形に変形させ、上部がより広くなった。","type":"verb","meaning_category":"Shaping like a keystone"},{"sentence":"The keystoned arch was a hallmark of Roman architecture.","translation":"台形のアーチは、ローマ建築の典型的な特徴だった。","type":"adjective","meaning_category":"Having the shape of a keystone"}]}