{"word":"Discipling","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(キリスト教)弟子訓練をする、弟子として育てる","english_definition":"To train someone to be a disciple of Jesus Christ; to help someone grow in their faith and obedience to Christ.","examples":[{"sentence":"The church emphasizes discipling new believers.","translation":"その教会は、新しい信者を弟子として育てることを重視しています。"},{"sentence":"He is discipling a small group of young men.","translation":"彼は若い男性の小さなグループを弟子訓練しています。"},{"sentence":"Discipling involves teaching, mentoring, and accountability.","translation":"弟子訓練には、教えること、指導すること、責任を負わせることが含まれます。"}],"collocations":["discipling new believers (新しい信者を弟子訓練する)","discipling young adults (若い成人を弟子訓練する)","one-on-one discipling (一対一の弟子訓練)","small group discipling (小グループでの弟子訓練)"],"synonyms":["mentoring","teaching","training","coaching","guiding"],"antonyms":["neglecting","ignoring","abandoning"]}],"etymology":{"value":"Derived from the verb 'disciple,' which comes from the Latin 'discipulus' meaning 'learner' or 'follower.' The addition of '-ing' turns it into a present participle or gerund, indicating the act of making disciples.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈsaɪplɪŋ/","syllables":"di-sci-pling"},"inflection":{"verb_forms":{"present_participle":"discipling","gerund":"discipling"}},"usage_notes":{"explanation":"'Discipling' is primarily used within Christian contexts to describe the process of helping someone become a follower of Jesus Christ and grow in their faith. It involves teaching them about the Bible, helping them apply its principles to their lives, and holding them accountable for their spiritual growth. It is more than just teaching; it involves a personal relationship and commitment to helping someone mature in their faith.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am discipling in the church.","correct":"✓ I am discipling at the church.","note":"Use 'at' to indicate the location where the discipling is taking place."},{"incorrect":"✗ He is discipling to become a better Christian.","correct":"✓ He is being discipled to become a better Christian. / ✓ He is discipling others to become better Christians.","note":"If someone is receiving disciple, use the passive voice 'is being discipled'. If someone is leading the discipling, use 'He is discipling others'."},{"incorrect":"✗ Discipling is only about learning the Bible.","correct":"✓ Discipling involves more than just learning the Bible; it includes applying its principles to life.","note":"Discipling involves more than just learning facts; it includes application and personal growth."}],"priority":"★★☆"},"related_words":{"derivatives":["disciple (noun)","disciple (verb)","discipler (noun)","disciplinable (adjective)"],"phrasal_verbs":["None commonly used with 'discipling'."],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Specific to religious context)","frequency_google_ngram":"Low frequency, primarily used in religious contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Discipling' refers to the process of guiding and mentoring someone to become a follower of Jesus Christ. It involves teaching, training, and helping them grow in their faith and obedience. This term is mainly used in Christian contexts and implies a deeper level of commitment and personal relationship than simply teaching or training. It's about helping someone develop a Christ-like character and live according to Christian principles.","priority":"★☆☆"},"example_sentences":[{"sentence":"Our pastor is committed to discipling young adults in the church.","translation":"私たちの牧師は、教会の若い成人を弟子訓練することに尽力しています。","type":"verb","meaning_category":"弟子訓練をする"},{"sentence":"She sees discipling as a vital part of her ministry.","translation":"彼女は弟子訓練を彼女の宣教の重要な部分と見なしています。","type":"verb (gerund)","meaning_category":"弟子訓練をする"},{"sentence":"The discipling process includes regular Bible study and prayer.","translation":"弟子訓練のプロセスには、定期的な聖書研究と祈りが含まれています。","type":"verb (gerund)","meaning_category":"弟子訓練をする"},{"sentence":"He is passionate about discipling men to become spiritual leaders.","translation":"彼は男性を霊的な指導者として弟子訓練することに情熱を注いでいます。","type":"verb","meaning_category":"弟子訓練をする"}]}