{"word":"Norlander","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A person from a Nordic country; a Scandinavian.","english_definition":"A person who is from a Nordic country, especially Scandinavia (Norway, Sweden, Denmark, Finland, and Iceland).","examples":[{"sentence":"As a Norlander, he was used to cold weather.","translation":"ノーランダーとして、彼は寒い気候に慣れていた。"},{"sentence":"The Norlanders have a rich history of seafaring.","translation":"ノーランダーは航海の豊かな歴史を持っている。"}],"collocations":["fellow Norlander","proud Norlander"],"synonyms":["Scandinavian","Nordic person"],"antonyms":["Southerner"]},{"part_of_speech":"adjective","definition":"Relating to the Nordic countries or their people.","english_definition":"Relating to the Nordic countries or their people and cultures.","examples":[{"sentence":"Norlander traditions are often associated with winter festivals.","translation":"ノーランダーの伝統は、しばしば冬の祭りと関連付けられる。"},{"sentence":"The Norlander cuisine features a lot of seafood.","translation":"ノーランダーの料理は、シーフードを多く使用している。"}],"collocations":["Norlander culture","Norlander heritage","Norlander design"],"synonyms":["Nordic","Scandinavian"],"antonyms":["Southern"]}],"etymology":{"value":"Combination of 'North' and 'lander' (one who lives in a land).","priority":"★★★"},"pronunciation":{"ipa":"/ˈnɔːrlændər/","syllables":"Nor-land-er"},"inflection":{"noun_plural":"Norlanders"},"usage_notes":{"explanation":"'Norlander' is a term used to refer to people from the Nordic countries, particularly those in Scandinavia. It can be used as both a noun and an adjective. While 'Scandinavian' is a more common term, 'Norlander' can be used to emphasize the northern location and cultural aspects of these countries.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a Norlander from Spain.","correct":"✓ She is from Spain.","note":"Norlander refers to someone from a Nordic country, not Spain."},{"incorrect":"✗ The Norlander language is Spanish.","correct":"✓ The Norlander languages include Swedish, Norwegian, and Danish.","note":"Spanish is not a Norlander language."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Norlander' is a relatively uncommon word used to refer to people from Nordic countries, particularly those in Scandinavia. It's a more descriptive and less frequently used alternative to 'Scandinavian' or 'Nordic person.' The term emphasizes the northern location and cultural aspects of these countries. It's important to use this word accurately to avoid confusion, as it specifically refers to individuals from Norway, Sweden, Denmark, Finland, and Iceland, and not just anyone from northern Europe."},"example_sentences":[{"sentence":"Many Norlanders are known for their design aesthetic.","translation":"多くのノーランダーは、そのデザイン美学で知られている。","type":"noun","meaning_category":"Person from Nordic country"},{"sentence":"The Norlander influence is evident in the architecture of the city.","translation":"その都市の建築には、ノーランダーの影響が明らかである。","type":"adjective","meaning_category":"Relating to Nordic countries"}]}