{"word":"Court-bouillon","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"クールブイヨン（魚や野菜などを煮る際に用いる、水、香味野菜、ハーブ、スパイス、酸味などを加えて作るだし汁）","english_definition":"A quickly cooked broth used for poaching fish or other delicate foods.","examples":[{"sentence":"The chef prepared a delicate court-bouillon for poaching the salmon.","translation":"シェフはサーモンをポシェするための繊細なクールブイヨンを用意した。"},{"sentence":"Court-bouillon is essential for many classic seafood dishes.","translation":"クールブイヨンは多くの古典的なシーフード料理に不可欠である。"}],"collocations":["prepare a court-bouillon","delicate court-bouillon","classic court-bouillon"],"synonyms":["broth","stock","bouillon","fish stock","vegetable stock"],"antonyms":[]}],"etymology":{"value":"フランス語由来。「court」は「短い」を意味し、「bouillon」は「スープ、だし汁」を意味する。つまり、「短時間で調理するだし汁」という文字通りの意味を持つ。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkʊər buːˈjɒn/","syllables":"court-bouil-lon"},"inflection":{"noun_plural":"court-bouillons"},"usage_notes":{"explanation":"クールブイヨンは、通常、魚介類を煮る際に使用される風味豊かな液体です。水、ワイン（白ワインが一般的）、香味野菜（玉ねぎ、セロリ、人参など）、ハーブ（パセリ、タイム、ローリエなど）、スパイス（コショウなど）、酸味（レモン汁、酢など）を組み合わせて作られます。短時間で調理されるため、素材の風味を損なわずに引き出すことができます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used chicken stock instead of court-bouillon for the fish.","correct":"✓ I used chicken stock instead of court-bouillon for the fish, but it altered the flavor significantly.","note":"鶏肉のストックはクールブイヨンの代わりにはなりますが、魚料理の風味は大きく変わります。"},{"incorrect":"✗ Court-bouillon is the same as fish fumet.","correct":"✓ Court-bouillon is similar to fish fumet, but it's cooked for a shorter time and the ingredients can vary.","note":"クールブイヨンは魚のフュメと似ていますが、調理時間が短く、材料も異なる場合があります。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["fumet","stock","broth","consommé"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な料理用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Court-bouillon**」はフランス語由来の料理用語で、魚や野菜などの繊細な食材を煮るために使われる、風味豊かなだし汁を指します。水、ワイン、香味野菜、ハーブ、スパイス、酸味などを組み合わせて短時間で調理されるのが特徴です。家庭料理よりも、レストランやプロの料理人が使うことが多い専門的な用語です。"},"example_sentences":[{"sentence":"The scallops were poached in a lemon-infused court-bouillon.","translation":"ホタテはレモン風味のクールブイヨンでポシェされた。","type":"noun","meaning_category":"だし汁"},{"sentence":"Preparing a court-bouillon is the first step in making bouillabaisse.","translation":"クールブイヨンを準備することはブイヤベースを作る最初のステップである。","type":"noun","meaning_category":"だし汁"},{"sentence":"The subtle flavors of the court-bouillon enhanced the delicate taste of the flounder.","translation":"クールブイヨンの繊細な風味がヒラメの繊細な味を引き立てた。","type":"noun","meaning_category":"だし汁"}]}