{"word":"hypotonia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"筋緊張低下症、低緊張","english_definition":"A state of abnormally low muscle tone (the amount of tension or resistance to stretch in a muscle), often resulting in floppiness.","examples":[{"sentence":"The baby was diagnosed with hypotonia at birth.","translation":"その赤ちゃんは出生時に筋緊張低下症と診断されました。"},{"sentence":"Hypotonia can be a symptom of various underlying medical conditions.","translation":"筋緊張低下症は、さまざまな基礎疾患の症状である可能性があります。"},{"sentence":"Physical therapy is often used to manage hypotonia.","translation":"理学療法は、しばしば筋緊張低下症の管理に用いられます。"}],"collocations":["congenital hypotonia (先天性筋緊張低下症)","benign congenital hypotonia (良性先天性筋緊張低下症)","muscle hypotonia (筋緊張低下)","severe hypotonia (重度の筋緊張低下)","hypotonia management (筋緊張低下症管理)","hypotonia treatment (筋緊張低下症治療)"],"synonyms":["muscle weakness","floppiness","decreased muscle tone"],"antonyms":["hypertonia","muscle rigidity","spasticity"]}],"etymology":{"value":"From the Greek words 'hypo' (meaning 'under' or 'below') and 'tonos' (meaning 'tension' or 'tone'), combined with the suffix '-ia' (denoting a condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpəˈtoʊniə/","syllables":"hy-po-to-ni-a"},"inflection":{"noun_plural":"hypotonias"},"usage_notes":{"explanation":"Hypotonia is a medical term describing reduced muscle tone. It is not a disease itself but rather a symptom that can be associated with various neurological, genetic, or muscular disorders. The severity of hypotonia can vary widely. Diagnosis typically involves a physical examination and may require further testing to identify the underlying cause.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has hypotonic.","correct":"✓ He has hypotonia.","note":"Hypotonia is a noun (the condition itself). 'Hypotonic' is an adjective (describing something with reduced tone)."},{"incorrect":"✗ Hypotonia is a very rare disease.","correct":"✓ Hypotonia is a symptom that can be caused by various diseases.","note":"Hypotonia is a symptom or sign, not a disease itself."}],"priority":"★★☆"},"related_words":{"derivatives":["hypotonic (adjective: relating to or having reduced tone or tension)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized medical vocabulary)","frequency_google_ngram":"Low frequency (relatively uncommon outside of medical contexts)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Hypotonia is a medical term that refers to a condition where there is a decrease in muscle tone, making muscles feel floppy. It's important to understand that hypotonia is usually a symptom of another underlying condition rather than a disease itself. If someone is described as having hypotonia, it means their muscles have less resistance to movement than normal. This can affect their ability to control their movements and maintain posture. Diagnosis and management of hypotonia typically require medical expertise."},"example_sentences":[{"sentence":"The doctor noted significant hypotonia in the infant's limbs.","translation":"医師は、その乳児の手足に著しい筋緊張低下を認めました。","type":"noun","meaning_category":"medical condition"},{"sentence":"Early intervention is crucial for children with hypotonia to improve their motor skills.","translation":"運動能力を向上させるためには、筋緊張低下症の子供たちへの早期介入が重要です。","type":"noun","meaning_category":"medical condition"},{"sentence":"Genetic testing helped determine the cause of the patient's hypotonia.","translation":"遺伝子検査は、患者の筋緊張低下症の原因を特定するのに役立ちました。","type":"noun","meaning_category":"medical condition"}]}