{"word":"non-industrial","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"非工業的な、工業的でない","english_definition":"not related to or involved in industry; not having a developed industrial sector.","examples":[{"sentence":"The area has remained largely non-industrial, with agriculture as the primary occupation.","translation":"その地域は主に非工業的なままであり、農業が主な職業です。"},{"sentence":"We need to promote non-industrial uses of this land to preserve its natural beauty.","translation":"この土地の自然の美しさを保つために、非工業的な利用を促進する必要があります。"},{"sentence":"The government is investing in non-industrial sectors such as tourism and agriculture.","translation":"政府は観光や農業といった非工業セクターに投資しています。"}],"collocations":["non-industrial area","non-industrial sector","non-industrial use","non-industrial society","non-industrial economy"],"synonyms":["agricultural","rural","undeveloped","pre-industrial"],"antonyms":["industrial","manufacturing","developed","urban"]},{"part_of_speech":"adjective","definition":"手工業の、職人的な","english_definition":"relating to or characterized by small-scale, artisanal production rather than mass manufacturing.","examples":[{"sentence":"The furniture was made using non-industrial methods, relying on traditional craftsmanship.","translation":"その家具は伝統的な職人技に頼り、非工業的な方法で作られました。"},{"sentence":"These non-industrial products are often more expensive due to the labor-intensive production process.","translation":"これらの非工業製品は、労働集約的な生産プロセスのため、より高価になることがよくあります。"},{"sentence":"The gallery features non-industrial art, showcasing the unique skills of local artisans.","translation":"そのギャラリーでは、地元の職人のユニークなスキルを紹介する非工業的なアートを展示しています。"}],"collocations":["non-industrial production","non-industrial methods","non-industrial art","non-industrial craft","non-industrial design"],"synonyms":["artisanal","handcrafted","handmade","craft-based"],"antonyms":["mass-produced","factory-made","automated"]}],"etymology":{"value":"'Non-' (not) + 'industrial' (relating to industry).","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnɪnˈdʌstriəl/","syllables":"non-in-dus-tri-al"},"inflection":{"notes":"Adjective, no inflection."},"usage_notes":{"explanation":"'Non-industrial' generally describes something that is not related to large-scale manufacturing or heavy industry. It can refer to areas, economies, or societies that are primarily agricultural or service-based, or to products made using traditional, artisanal methods rather than mass production techniques. The specific meaning often depends on the context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The non industrial revolution changed society.","correct":"The pre-industrial society was changed by the industrial revolution.","note":"'Non-industrial' describes something that is not industrial. The Industrial Revolution is a specific historical period. Use 'pre-industrial' to describe the time before the Industrial Revolution."}],"priority":"★★☆"},"related_words":{"derivatives":["non-industrialized (adjective)"],"related_terms":["pre-industrial","post-industrial","deindustrialization"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Non-industrial' means 'not related to industry'. It's used to describe things that don't involve factories or large-scale manufacturing. For example, a 'non-industrial area' might be a farming region. It can also refer to products made by hand, rather than by machines in a factory. The word is formed by adding the prefix 'non-' to 'industrial', which makes it easier to understand if you know what 'industrial' means."},"example_sentences":[{"sentence":"The village has maintained its non-industrial character despite the growth of nearby cities.","translation":"その村は近隣都市の成長にもかかわらず、非工業的な性格を維持しています。","type":"adjective","meaning_category":"Not related to industry"},{"sentence":"The company specializes in non-industrial cleaning services for homes and small businesses.","translation":"その会社は、家庭や中小企業向けの非工業的な清掃サービスを専門としています。","type":"adjective","meaning_category":"Not related to industry"},{"sentence":"The museum showcases non-industrial tools and equipment used in traditional farming.","translation":"その博物館では、伝統的な農業で使用されていた非工業的な道具や機器を展示しています。","type":"adjective","meaning_category":"Handcrafted"}]}