{"word":"Nipmuck","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ニプマック族（北米の先住民族）","english_definition":"A member of a Native American people formerly inhabiting central Massachusetts and adjacent parts of Connecticut and Rhode Island.","examples":[{"sentence":"The Nipmuck people traditionally lived in villages along rivers and streams.","translation":"ニプマック族は伝統的に川や小川沿いの村に住んでいました。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"ニプマック語（ニプマック族の言語）","english_definition":"The Algonquian language formerly spoken by the Nipmuck people.","examples":[{"sentence":"Efforts are being made to revive the Nipmuck language.","translation":"ニプマック語を復活させるための努力がなされています。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"adjective","definition":"ニプマック族の、ニプマック語の","english_definition":"Relating to the Nipmuck people or their language.","examples":[{"sentence":"The museum has an exhibit on Nipmuck history.","translation":"博物館にはニプマック族の歴史に関する展示があります。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From the Nipmuck language, meaning \"freshwater fishing place\".","priority":"★★★"},"pronunciation":{"ipa":"ˈnɪpˌmʌk","syllables":"Nip-muck"},"inflection":{},"usage_notes":{"explanation":"'Nipmuck' refers to both the people and their language. It is also used as an adjective to describe things related to them. The Nipmuck people are one of the many Native American tribes who inhabited the New England area before European colonization.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The word 'Nipmuck' refers to a specific Native American tribe and their language. Understanding its meaning requires some knowledge of North American history and indigenous cultures. It's not a commonly used word, so familiarity with it indicates a higher level of English proficiency."},"example_sentences":[{"sentence":"The Nipmuck Cultural Preservation, Inc. works to preserve the tribe's heritage.","translation":"ニプマック文化保存会社は、部族の遺産を保存するために活動しています。","type":"noun","meaning_category":"ニプマック族"},{"sentence":"Few speakers of the Nipmuck language remain today.","translation":"今日、ニプマック語の話し手はほとんど残っていません。","type":"noun","meaning_category":"ニプマック語"},{"sentence":"Nipmuck artifacts are on display at the local historical society.","translation":"ニプマック族の工芸品が地元の歴史協会で展示されています。","type":"adjective","meaning_category":"ニプマック族の"}]}