{"word":"Damascene","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"ダマスカス産の、ダマスカス風の","english_definition":"Of or relating to Damascus; made in Damascus; imitating the style of Damascus.","examples":[{"sentence":"Damascene steel is famous for its strength and beauty.","translation":"ダマスカス鋼はその強度と美しさで有名です。"},{"sentence":"The museum displayed a collection of Damascene furniture.","translation":"博物館にはダマスカス風の家具のコレクションが展示されていました。"}],"collocations":["Damascene steel","Damascene blade","Damascene furniture","Damascene design"],"synonyms":["Damascenian"],"antonyms":[]},{"part_of_speech":"verb","transitivity":"vt","definition":"（金属に）象嵌（ぞうがん）細工を施す","english_definition":"To decorate (metal) with inlaid work of different metals.","examples":[{"sentence":"The artist Damascened the sword with gold and silver.","translation":"その芸術家は刀に金と銀で象嵌細工を施した。"}],"collocations":["Damascene with gold","Damascene with silver"],"synonyms":["inlay","encrust"],"antonyms":[]},{"part_of_speech":"noun","definition":"ダマスカス細工、象嵌細工","english_definition":"Metalware decorated with inlaid work of different metals; damascening.","examples":[{"sentence":"The antique shop had a beautiful example of Damascene on display.","translation":"その骨董品店には、美しいダマスカス細工の展示品があった。"}],"collocations":["gold Damascene","silver Damascene"],"synonyms":["damascening"],"antonyms":[]}],"etymology":{"value":"From Damascus, the capital city of Syria, where the technique originated.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdæməsiːn/","syllables":"Dam-a-scene"},"inflection":{"verb_forms":{"present_simple":["Damascene","Damascenes"],"past_simple":"Damascened","past_participle":"Damascened","present_participle":"Damascening"}},"usage_notes":{"explanation":"'Damascene' can refer to objects originating from Damascus, Syria, or to the technique of inlaying different metals into one another, particularly associated with that region. As an adjective, it describes something related to Damascus or in the style of Damascus. As a verb, it means to decorate metal using this inlaying technique. As a noun, it refers to the metalware itself.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used damascening to paint the sword.","correct":"✓ He used damascening to decorate the sword. / ✓ He Damascened the sword.","note":"Damascening is a technique, not a paint. The verb form 'Damascene' should be used if describing the action of applying the technique."}],"priority":"★☆☆"},"related_words":{"derivatives":["damascening (noun: the art or process of inlaying different metals into one another)"],"phrasal_verbs":[],"related_terms":["Damascus (noun: the capital of Syria)","steel (noun: a strong, hard, durable alloy of iron and carbon)","inlay (verb: to embed pieces of material into a surface to form a design)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Damascene' is relatively uncommon and specialized, mostly used in contexts related to art, history, and metalworking. Understanding the word requires knowledge of the city of Damascus and its historical significance in craftsmanship. The verb form and noun form are less frequently encountered than the adjective.","priority":"★☆☆"},"example_sentences":[{"sentence":"The craftsman created a stunning Damascene vase.","translation":"職人は見事なダマスカス細工の花瓶を作った。","type":"adjective","meaning_category":"ダマスカス風の"},{"sentence":"He carefully Damascened the hunting knife with intricate patterns.","translation":"彼は注意深く狩猟ナイフに複雑な模様で象嵌細工を施した。","type":"verb","meaning_category":"象嵌細工を施す"},{"sentence":"The museum's collection included several pieces of exquisite Damascene.","translation":"博物館のコレクションには、いくつかの精巧なダマスカス細工が含まれていた。","type":"noun","meaning_category":"ダマスカス細工"}]}