{"word":"acromelalgia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"肢端紅痛症（したんこうつうしょう）","english_definition":"A rare condition characterized by burning pain, redness, and increased skin temperature, primarily affecting the extremities (hands and feet).","examples":[{"sentence":"Acromelalgia can be a debilitating condition for those affected.","translation":"肢端紅痛症は、罹患者にとって衰弱性の病状となる可能性がある。"},{"sentence":"The patient presented with symptoms consistent with acromelalgia, including burning pain in the feet.","translation":"患者は、足の焼けるような痛みを含む、肢端紅痛症と一致する症状を呈した。"}],"collocations":["primary acromelalgia (原発性肢端紅痛症)","secondary acromelalgia (続発性肢端紅痛症)","treat acromelalgia (肢端紅痛症を治療する)","symptoms of acromelalgia (肢端紅痛症の症状)"],"synonyms":["erythromelalgia","Mitchell's disease"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'acro-' (extremity), 'melo-' (limb), and '-algia' (pain).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌækroʊˌmɛləlˈdʒiːə/","syllables":"ac-ro-me-lal-gi-a"},"inflection":{"noun_plural":"acromelalgias"},"usage_notes":{"explanation":"Acromelalgia is a rare vascular condition that causes intense burning pain, redness, and warmth in the extremities, most commonly the feet and hands. Symptoms are often triggered by heat, exercise, or standing for long periods. The condition can be primary (idiopathic) or secondary to other underlying conditions such as myeloproliferative disorders or autoimmune diseases. Treatment focuses on symptom management and addressing any underlying causes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Acromelalgia is a type of allergy.","correct":"✓ Acromelalgia is a vascular condition.","note":"Acromelalgia is a vascular condition, not an allergy."},{"incorrect":"✗ Acromelalgia only affects the hands.","correct":"✓ Acromelalgia primarily affects the hands and feet.","note":"While it can affect both, acromelalgia primarily affects the hands and feet."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (specialized medical term)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Acromelalgia is a complex medical term referring to a rare condition characterized by burning pain, redness, and increased temperature in the extremities, particularly the hands and feet. It is important to note that this condition can be either primary (idiopathic) or secondary to other underlying medical conditions. Due to its specialized nature, understanding acromelalgia requires a background in medical terminology and physiology."},"example_sentences":[{"sentence":"The doctor suspected acromelalgia due to the patient's complaints of burning pain in their feet.","translation":"医師は、患者の足の焼けるような痛みの訴えから、肢端紅痛症を疑った。","type":"general","meaning_category":"general"},{"sentence":"Treatment for acromelalgia often involves managing the symptoms with medication and avoiding triggers.","translation":"肢端紅痛症の治療は、多くの場合、薬による症状管理と誘因の回避を伴う。","type":"treatment","meaning_category":"treatment"},{"sentence":"Secondary acromelalgia can be associated with certain myeloproliferative disorders.","translation":"続発性肢端紅痛症は、特定の骨髄増殖性疾患と関連している可能性がある。","type":"secondary causes","meaning_category":"causes"}]}