{"word":"Indo-African","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"インド系アフリカ人の、インドとアフリカの文化が混ざった","english_definition":"Relating to people of Indian descent living in Africa, or to the cultural mix of Indian and African traditions.","examples":[{"sentence":"The Indo-African community has a rich history in East Africa.","translation":"インド系アフリカ人のコミュニティは、東アフリカに豊かな歴史を持っています。"},{"sentence":"Indo-African cuisine often combines spices from India with local African ingredients.","translation":"インド系アフリカ料理は、インドのスパイスとアフリカの地元の食材を組み合わせることがよくあります。"}],"collocations":["Indo-African community","Indo-African cuisine","Indo-African culture"],"synonyms":["Indian-African"],"antonyms":[]}],"etymology":{"value":"Combination of 'Indo-' (referring to India) and 'African' (referring to Africa).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪndoʊˈæfrɪkən/","syllables":"In-do-Af-ri-can"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"The term 'Indo-African' is used to describe people of Indian origin who reside in Africa, as well as the cultural fusion that has occurred between Indian and African traditions. It's commonly used in the context of East Africa, where significant Indian diaspora communities exist.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an Indo African.","correct":"✓ He is an Indo-African.","note":"The correct form is with a hyphen: Indo-African."}],"priority":"★★☆"},"related_words":{"derivatives":["Indo-African (noun: An Indo-African person)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Indo-African' refers to people of Indian descent who live in Africa, or to the blending of Indian and African cultures. It is most often used in the context of East Africa, where there are large communities of people with Indian ancestry. The term is relatively specialized and may not be widely understood outside of academic or cultural contexts related to the Indian diaspora in Africa."},"example_sentences":[{"sentence":"The Indo-African population in Durban, South Africa, is substantial.","translation":"南アフリカのダーバンには、かなりの数のインド系アフリカ人が住んでいます。","type":"adjective","meaning_category":"インド系アフリカ人の"},{"sentence":"The museum features exhibits on Indo-African art and history.","translation":"その博物館では、インド系アフリカ人の芸術と歴史に関する展示を行っています。","type":"adjective","meaning_category":"インドとアフリカの文化が混ざった"}]}