{"word":"Rhipidoptera","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A small order of insects, also known as Strepsiptera, that are endoparasites of other insects.","english_definition":"An order of insects whose members are endoparasites in other insects, now usually called Strepsiptera.","examples":[{"sentence":"Rhipidoptera are unusual insects with a complex life cycle.","translation":"ネジレバネ目は複雑な生活環を持つ珍しい昆虫です。"}],"collocations":[],"synonyms":["Strepsiptera"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek ῥιπίς (rhipís, “fan”) + πτερόν (pterón, “wing”), referring to the fan-like wings of the male insects.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌrɪpɪˈdɒptərə/","syllables":"Rhi-pid-op-te-ra"},"inflection":{"noun_plural":"Rhipidopterans"},"usage_notes":{"explanation":"The term 'Rhipidoptera' is an older name for the insect order now more commonly known as Strepsiptera. While 'Rhipidoptera' may still be encountered in older literature, 'Strepsiptera' is the preferred term in modern entomology. These insects are notable for their unique parasitic lifestyle and the distinct fan-shaped wings of the males.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["rhipidopteran (noun)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Rhipidoptera' is a scientific term referring to a specific order of insects. It is rarely used outside of entomological contexts. Understanding this term requires familiarity with scientific nomenclature and insect classification. The modern and preferred term is 'Strepsiptera.'"},"example_sentences":[{"sentence":"The classification of Rhipidoptera has been revised, and they are now generally referred to as Strepsiptera.","translation":"ネジレバネ目の分類は見直され、現在では一般的にストレプシプテラと呼ばれています。","type":"general","meaning_category":"scientific classification"}]}