{"word":"uneatableness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"食べられないこと、不食性","english_definition":"The state or quality of being uneatable; inedibility.","examples":[{"sentence":"The uneatableness of the spoiled food was obvious.","translation":"その腐った食べ物が食べられないことは明らかだった。"},{"sentence":"The uneatableness of the berries was due to their toxicity.","translation":"そのベリーが食べられないのは、毒性のためだった。"}],"collocations":["assess the uneatableness","determine the uneatableness"],"synonyms":["inedibility","unpalatability","nontoxicity (when referring to lack of toxins that would make something uneatable)"],"antonyms":["eatableness","palatability","edibility"]}],"etymology":{"value":"Formed from \"uneatable\" (not able to be eaten) + \"-ness\" (a suffix denoting a state or quality). \"Uneatable\" is formed from the prefix \"un-\" (not) + \"eatable\" (able to be eaten).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈiːtəbəlˌnɛs/","syllables":"un-eat-a-ble-ness"},"inflection":{"noun_plural":"uneatablenesses (rare)"},"usage_notes":{"explanation":"\"Uneatableness\" is a relatively uncommon noun that describes the condition of something being unfit or impossible to eat. This can be due to various reasons, such as spoilage, toxicity, or simply having an unpleasant taste or texture. It is often used in scientific or technical contexts when discussing food safety or the properties of different substances.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The uneatableness was because of the smell.","correct":"✓ The uneatableness was due to the smell.","note":"When indicating the cause of the uneatableness, use \"due to\" rather than \"because of.\" Although \"because of\" is commonly used in spoken English, \"due to\" is more appropriate in formal writing."}],"priority":"★☆☆"},"related_words":{"derivatives":["uneatable (adjective)","eatableness (noun)","eatable (adjective)","eat (verb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"uneatableness\" is a complex and uncommon noun, suitable for advanced learners. It describes the state of something being impossible or unpleasant to eat. It is formed by adding the suffixes \"un-\" and \"-ness\" to the base word \"eat,\" making it easy to understand its meaning if you know the individual parts. However, its rarity makes it more appropriate for those with a strong command of English.","example_sentences":[{"sentence":"The scientist tested the sample to determine its level of uneatableness.","translation":"科学者はそのサンプルを検査して、食べられないレベルを判断した。","type":"general","meaning_category":"general"},{"sentence":"The extreme uneatableness of the dish led to its immediate rejection.","translation":"その料理の極端な不食性により、即座に却下された。","type":"general","meaning_category":"general"}]}}