{"word":"semivulcanized","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"半加硫の、準加硫の","english_definition":"Partially vulcanized; having undergone partial vulcanization.","examples":[{"sentence":"Semivulcanized rubber is used in some specialized applications.","translation":"半加硫ゴムは、いくつかの特殊な用途で使用されます。"}],"collocations":[],"synonyms":["partially vulcanized"],"antonyms":["fully vulcanized"]}],"etymology":{"value":"'semi-' (半分) + 'vulcanized' (加硫された)","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɛmɪˈvʌlkənaɪzd/","syllables":"se-mi-vul-ca-nized"},"inflection":{"notes":"This is an adjective, so it doesn't have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Semivulcanized' describes a material, typically rubber, that has undergone a partial vulcanization process. Vulcanization is a chemical process that improves the strength, elasticity, and resistance to solvents and temperature changes of rubber. 'Semivulcanized' indicates that the process was not fully completed, resulting in properties that are different from both raw rubber and fully vulcanized rubber.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["semivulcanization (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word 'semivulcanized' is a technical term used in chemistry and materials science. It describes a state of rubber that has been partially treated with vulcanization, a process that improves its properties. Understanding this word requires knowledge of the vulcanization process itself."},"example_sentences":[{"sentence":"The manufacturer uses semivulcanized rubber to achieve the desired flexibility in the product.","translation":"製造業者は、製品に必要な柔軟性を実現するために半加硫ゴムを使用しています。","type":"general","meaning_category":"technical description"},{"sentence":"The properties of semivulcanized materials lie between those of raw and fully vulcanized rubber.","translation":"半加硫材料の特性は、未加硫ゴムと完全加硫ゴムの特性の間に位置します。","type":"general","meaning_category":"technical description"}]}