{"word":"Relandscaping","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(庭や土地の)再造成、再景観設計","english_definition":"The act of redesigning and replanning the landscape of an area, often involving changes to the terrain, vegetation, and other features.","examples":[{"sentence":"We are relandscaping our backyard to create a more relaxing space.","translation":"もっとリラックスできる空間を作るために、裏庭を再造成しています。"},{"sentence":"The city is relandscaping the park to improve its accessibility and aesthetic appeal.","translation":"市は公園のアクセス性と美観を向上させるために、公園を再造成しています。"}],"collocations":["relandscaping project","relandscaping costs","relandscaping design","relandscaping company"],"synonyms":["redesigning","remodeling","regrading","replanting","recontouring"],"antonyms":["maintaining","preserving","conserving"]}],"etymology":{"value":"The word 'relandscaping' is formed by adding the prefix 're-' (meaning again or anew) to the word 'landscaping'. Landscaping itself comes from 'land' and '-scape', referring to the shaping and arrangement of land.","priority":"★★☆"},"pronunciation":{"ipa":"/riːˈlændˌskeɪpɪŋ/","syllables":"re-land-scap-ing"},"inflection":{"verb_forms":{"present_simple":["relandscapes"],"past_simple":"relandscaped","past_participle":"relandscaped","present_participle":"relandscaping"}},"usage_notes":{"explanation":"'Relandscaping' refers to a significant alteration of an existing landscape, often involving substantial changes to the layout, plants, and features. It implies a more comprehensive transformation than simply maintaining or making minor adjustments to a landscape.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to relandscape the garden by mowing the lawn.","correct":"✓ I'm going to relandscape the garden by adding new flower beds and a patio.","note":"Relandscaping involves more significant changes than simple maintenance tasks like mowing. It typically includes redesigning and adding new features."}],"priority":"★★☆"},"related_words":{"derivatives":["landscape","landscaper","landscaping"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Relandscaping' is a relatively uncommon word that describes the process of significantly altering and redesigning an existing landscape. It implies a more extensive project than simple gardening or maintenance, often involving structural changes and new features. Understanding the prefix 're-' and the base word 'landscaping' can help in deciphering its meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The homeowners decided on a complete relandscaping of their front yard.","translation":"家の所有者たちは、家の正面の庭を完全に再造成することに決めました。","type":"general","meaning_category":"再造成"},{"sentence":"Relandscaping the area around the new office building improved its overall appearance.","translation":"新しいオフィスビルの周辺地域を再造成することで、全体的な外観が向上しました。","type":"general","meaning_category":"再景観設計"}]}