{"word":"Apostolicity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"使徒的であること、使徒継承性","english_definition":"The characteristic of a Church by which it is founded on the Apostles, in that it: (1) was founded by the Apostles; (2) maintains Apostolic teaching; and (3) is governed by successors of the Apostles.","examples":[{"sentence":"The Apostolicity of the Church is one of its four marks.","translation":"教会の使徒継承性は、教会の四つの標識の一つです。"}],"collocations":["Apostolicity of the Church"],"synonyms":["Apostolic succession","Apostolic tradition"],"antonyms":[]}],"etymology":{"value":"From Late Latin apostolicitas, from apostolicus (“apostolic”) + -itas (“-ity”).","priority":"★★★"},"pronunciation":{"ipa":"/əˌpɒstəlɪˈsɪti/","syllables":"a-pos-to-li-ci-ty"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"In Christian theology, Apostolicity is an essential characteristic of the true Church, referring to its direct lineage from the original Apostles of Jesus Christ. It is often cited as one of the four marks of the Church, along with unity, holiness, and catholicity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The church claimed to be apostolicity, but it had no historical evidence.","correct":"✓ The church claimed apostolicity, but it had no historical evidence.","note":"Apostolicity is a noun, so it should be used as such."}],"priority":"★★★"},"related_words":{"derivatives":["Apostolic (adjective)","Apostle (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Apostolicity' is a theological term primarily used within Christian contexts, particularly in discussions about the nature and authority of the Church. It signifies the Church's direct connection to the original Apostles of Jesus Christ, encompassing its historical foundation, doctrinal fidelity, and governance structure. Understanding this term requires familiarity with Christian theology and ecclesiology."},"example_sentences":[{"sentence":"The Orthodox Church emphasizes the importance of Apostolicity in maintaining the purity of its doctrine.","translation":"正教会は、教義の純粋さを維持する上で使徒継承性の重要性を強調しています。","type":"noun","meaning_category":"使徒継承性"},{"sentence":"The document examined the historical evidence for the Apostolicity of the early Church.","translation":"その文書は、初期の教会の使徒継承性に関する歴史的証拠を検証しました。","type":"noun","meaning_category":"使徒継承性"}]}