{"word":"tempo-oriented","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"テンポを重視した、テンポに重点を置いた","english_definition":"Focused on or emphasizing tempo, especially in music or other rhythmic activities.","examples":[{"sentence":"The song is very tempo-oriented, with a driving beat that makes you want to dance.","translation":"その曲は非常にテンポを重視しており、踊りたくなるような推進力のあるビートが特徴です。"},{"sentence":"The choreographer created a tempo-oriented routine that highlighted the dancers' precision.","translation":"振付師は、ダンサーの正確さを際立たせる、テンポを重視したルーチンを作成しました。"},{"sentence":"The music production software allows you to create tempo-oriented effects that sync with the beat.","translation":"その音楽制作ソフトウェアを使用すると、ビートに同期するテンポを重視したエフェクトを作成できます。"}],"collocations":["tempo-oriented music","tempo-oriented dance","tempo-oriented exercise","tempo-oriented design"],"synonyms":["rhythm-focused","beat-driven","cadence-based","rhythmic"],"antonyms":["melody-oriented","harmony-focused","atonal","arhythmic"]}],"etymology":{"value":"Derived from the word 'tempo,' referring to the speed or pace of music, and 'oriented,' meaning directed or focused towards.","priority":"N/A"},"pronunciation":{"ipa":"/ˈtɛmpoʊ ˌɔːriɛn.tɪd/","syllables":"tem-po-o-ri-en-ted"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Tempo-oriented' is used to describe something that places a strong emphasis on tempo, particularly in contexts like music, dance, or exercise. It suggests that the tempo is a key element that drives or defines the activity or creation.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The tempo-oriented project was a success.","correct":"The tempo-focused project was a success.","note":"While 'tempo-oriented' is valid, 'tempo-focused' might be more common in general contexts outside of music."}],"priority":"N/A"},"related_words":{"derivatives":["tempo","orientation"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Tempo-oriented' is a specialized term, most often used in the context of music, dance, or fitness. It means that the speed or rhythm (tempo) is a very important part of the activity or creation. It's not a common word in everyday conversation."},"example_sentences":[{"sentence":"The DJ created a tempo-oriented mix for the workout session.","translation":"DJは、ワークアウトセッションのためにテンポを重視したミックスを作成しました。","type":"general","meaning_category":"music/exercise"},{"sentence":"The composer's later works became more tempo-oriented, focusing on complex rhythmic patterns.","translation":"作曲家の後期の作品は、よりテンポを重視したものになり、複雑なリズムパターンに焦点を当てました。","type":"general","meaning_category":"music"},{"sentence":"The game's design is tempo-oriented, requiring players to react quickly to changes in the music.","translation":"そのゲームのデザインはテンポを重視しており、プレイヤーは音楽の変化に素早く反応する必要があります。","type":"general","meaning_category":"game design"}]}