{"word":"Liguliflorae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"キク科の舌状花亜科 (かつては独立した科として扱われていた)","english_definition":"(formerly) a major division of the plant family Compositae (now Asteraceae) characterized by having flower heads composed only of ray florets (ligulate flowers). Now considered a subfamily, Cichorioideae.","examples":[{"sentence":"The Liguliflorae are characterized by their milky sap and dandelion-like flowers.","translation":"舌状花亜科は、乳白色の樹液とタンポポのような花を持つことで特徴付けられます。"}],"collocations":["belong to the Liguliflorae","members of the Liguliflorae"],"synonyms":["Cichorioideae"],"antonyms":[]}],"etymology":{"value":"New Latin, from Latin 'ligula' (strap, tongue) + 'florae' (flowers), referring to the strap-shaped ray florets.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌlɪɡjʊlɪˈflɔːriː/","syllables":"Li-gu-li-flo-rae"},"inflection":{"noun_plural":"Liguliflorae (same as singular)"},"usage_notes":{"explanation":"The term 'Liguliflorae' is largely historical in botanical classification. Modern taxonomy places these plants within the subfamily Cichorioideae of the Asteraceae family. The name refers to the presence of ligulate or ray florets, which are strap-shaped petals, in the flower heads.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Liguliflorae is a type of animal.","correct":"✓ Liguliflorae is a group of plants.","note":"Liguliflorae refers to a group of plants, not animals."}],"priority":"★☆☆"},"related_words":{"derivatives":["ligulate (adjective: having a ligule or strap-shaped structure)","Cichorioideae (modern taxonomic name for the subfamily)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in botanical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Liguliflorae' is a technical term used in botany, specifically in the classification of plants. It refers to a group of plants, now classified as the Cichorioideae subfamily within the Asteraceae family, that have flower heads composed only of ray florets, which are strap-shaped petals. This term is not commonly used outside of botanical discussions. Understanding this term requires some familiarity with plant taxonomy.","priority":"★★☆"},"example_sentences":[{"sentence":"Historically, dandelions were classified under the Liguliflorae due to their characteristic ray florets.","translation":"歴史的に、タンポポはその特徴的な舌状花のために舌状花亜科に分類されていました。","type":"descriptive","meaning_category":"classification"},{"sentence":"The Liguliflorae are now considered part of the Cichorioideae subfamily in modern plant taxonomy.","translation":"舌状花亜科は現在、現代の植物分類学においてキク亜科の一部と見なされています。","type":"taxonomic","meaning_category":"classification"}]}