{"word":"Nyctanthes","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"夜香木 (ヤコウボク)","english_definition":"A genus of flowering plants in the family Oleaceae, native to Southeast Asia. The best-known species is Nyctanthes arbor-tristis, also known as the Night-flowering Jasmine or Parijat.","examples":[{"sentence":"Nyctanthes arbor-tristis is known for its fragrant flowers that bloom at night.","translation":"夜香木は夜に咲く香りの良い花で知られています。"}],"collocations":["Nyctanthes arbor-tristis (標準的な種)","Night-flowering Jasmine (一般的な別名)","Parijat (一般的な別名)"],"synonyms":["Night-flowering Jasmine","Parijat"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'nyx' (night) and 'anthos' (flower), referring to the night-blooming nature of the flowers.","priority":"★★☆"},"pronunciation":{"ipa":"/nɪkˈtænθiːz/","syllables":"Nyc-tan-thes"},"inflection":{"notes":"Plural: Nyctanthes (属名なので、複数形は通常使用しない)"},"usage_notes":{"explanation":"'Nyctanthes' is primarily used in botanical or horticultural contexts when discussing this specific genus of plants. The term 'Night-flowering Jasmine' is more commonly used in general conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Nyctanthes in my garden, it smelled like jasmine.","correct":"✓ I saw a Night-flowering Jasmine in my garden, it smelled like jasmine.","note":"In casual conversation, 'Night-flowering Jasmine' is more common than 'Nyctanthes'."}],"priority":"★☆☆"},"related_words":{"derivatives":["Oleaceae (科名)","arbor-tristis (種小名)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Nyctanthes' is a botanical term referring to a specific genus of plants known for their night-blooming flowers. It is primarily used in scientific or horticultural contexts. For general audiences, 'Night-flowering Jasmine' is a more accessible term. Understanding the etymology (Greek roots for 'night' and 'flower') can aid in remembering the term."},"example_sentences":[{"sentence":"The genus Nyctanthes includes several species of fragrant flowering plants.","translation":"夜香木属には香りの良い顕花植物がいくつか含まれています。","type":"noun","meaning_category":"植物学"},{"sentence":"Cultivation of Nyctanthes requires well-drained soil and partial sunlight.","translation":"夜香木の栽培には、水はけの良い土壌と部分的な日光が必要です。","type":"noun","meaning_category":"園芸"}]}