{"word":"Plantaginales","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"オオバコ目","english_definition":"An order of flowering plants, now largely included in the Lamiales order. Formerly containing families such as Plantaginaceae (plantain family), Callitrichaceae (water-starwort family), and Hippuridaceae (mare's tail family).","examples":[{"sentence":"The Plantaginales order has been reclassified in modern taxonomy.","translation":"オオバコ目は、現代の分類学では再分類されている。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the family name Plantaginaceae, which is based on the genus Plantago (plantain).","priority":"★★★"},"pronunciation":{"ipa":"/ˌplæntəˈdʒɪnəliːz/","syllables":"Plan-ta-gi-na-les"},"inflection":{},"usage_notes":{"explanation":"The term Plantaginales is primarily of historical significance in botany. Modern taxonomic systems, particularly those based on molecular phylogenetics, have largely dismantled the traditional Plantaginales order. The families formerly included within Plantaginales are now mostly classified within the order Lamiales. Therefore, the term Plantaginales is less frequently used in contemporary botanical literature.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["Plantaginaceae (plantain family)","Plantago (plantain genus)"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term Plantaginales refers to a taxonomic order that has been largely superseded by modern classifications. Understanding its historical context is useful for interpreting older botanical texts, but it's less relevant in current botanical discussions. The families formerly included in Plantaginales are now mostly found within the Lamiales order."},"example_sentences":[{"sentence":"In older botanical texts, you may find references to the Plantaginales order.","translation":"古い植物学の文献では、オオバコ目への言及が見られるかもしれない。","type":"noun","meaning_category":"Taxonomic order"},{"sentence":"The families once classified under Plantaginales are now part of Lamiales.","translation":"かつてオオバコ目に分類されていた科は、現在ではシソ目に属している。","type":"noun","meaning_category":"Taxonomic order"}]}