{"word":"Succubine","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"女夢魔、男性と寝る女性の悪霊","english_definition":"a female demon believed to have sexual intercourse with sleeping men.","examples":[{"sentence":"In medieval folklore, succubines were often blamed for unexplained pregnancies.","translation":"中世の民間伝承では、サキュバスはしばしば原因不明の妊娠の責任を負わされた。"},{"sentence":"The succubus was said to drain the life force from men during their sleep.","translation":"サキュバスは、睡眠中に男性から生命力を奪うと言われていた。"}],"collocations":["demon","nightmare","sleep paralysis"],"synonyms":["incubus (male counterpart)","demoness","spirit"],"antonyms":[]}],"etymology":{"value":"Late Latin succuba \"paramour, harlot,\" from succubare \"to lie under,\" from sub \"under\" + cubare \"to lie down.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsʌkjʊbaɪn/","syllables":"suc-cu-bine"},"inflection":{"noun_plural":"succubines"},"usage_notes":{"explanation":"The term 'succubus' (plural 'succubi' or 'succubuses') refers to a supernatural entity or demon in folklore that appears in the form of a woman to seduce men, usually through sexual activity during their sleep. The male counterpart is called an incubus. Belief in succubi was prevalent in medieval times and is often associated with sleep paralysis and nightmares. The succubus is believed to drain energy from the men they seduce.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was attacked by a incubine.","correct":"✓ He was attacked by a succubus.","note":"'Succubus' is the female demon, 'incubus' is the male demon."}],"priority":"★☆☆"},"related_words":{"derivatives":["succubic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"None (specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'succubus' is a specialized term from mythology and folklore, referring to a female demon believed to seduce men in their sleep. It is not commonly used in everyday language and is more likely to be encountered in literature, fantasy genres, or discussions of mythology. Understanding the term requires familiarity with folklore and demonology."},"example_sentences":[{"sentence":"The medieval texts described the succubus as a beautiful but deadly creature.","translation":"中世の文献では、サキュバスは美しくも致命的な生き物として描かれていた。","type":"general","meaning_category":"definition"},{"sentence":"Many legends tell of men being visited by a succubus in their dreams.","translation":"多くの伝説は、男性が夢の中でサキュバスに訪れられたことを語っている。","type":"general","meaning_category":"definition"}]}