{"word":"coreciprocal","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"相互的な関係にある、相互に影響しあう","english_definition":"Relating to or characterized by reciprocity; mutually corresponding or interactive.","examples":[{"sentence":"The two countries have a coreciprocal agreement on trade.","translation":"その二国間には貿易に関する相互的な合意がある。"},{"sentence":"Their relationship is coreciprocal, with each person supporting the other.","translation":"彼らの関係は相互的で、お互いを支え合っている。"}],"collocations":["coreciprocal relationship (相互的な関係)","coreciprocal agreement (相互的な合意)","coreciprocal interaction (相互的な相互作用)"],"synonyms":["reciprocal","mutual","interactive","interdependent"],"antonyms":["unilateral","independent"]},{"part_of_speech":"noun","definition":"相互関係にあるもの、相互作用","english_definition":"Something that is coreciprocal; a mutual or reciprocal element or interaction.","examples":[{"sentence":"Trust is a coreciprocal in any successful partnership.","translation":"信頼は、成功するパートナーシップにおいて相互関係にある要素だ。"},{"sentence":"Communication is a coreciprocal of effective teamwork.","translation":"コミュニケーションは、効果的なチームワークの相互作用である。"}],"collocations":["a coreciprocal of success (成功の相互関係)","a coreciprocal of trust (信頼の相互関係)"],"synonyms":["reciprocity","mutuality","interaction"],"antonyms":["independence"]}],"etymology":{"value":"The word \"coreciprocal\" is formed by combining the prefix \"co-\" (meaning \"together\" or \"mutual\") with \"reciprocal\" (meaning \"mutual\" or \"done in return\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkoʊrɪˈsɪprəkəl/","syllables":"co-re-cip-ro-cal"},"inflection":{"notes":"The word 'coreciprocal' can be inflected to form adverbs (coreciprocally) and nouns (coreciprocity)."},"usage_notes":{"explanation":"\"Coreciprocal\" emphasizes the mutual and interactive nature of a relationship or action. It is often used to describe situations where two or more parties are equally involved and dependent on each other. The prefix \"co-\" reinforces the idea of joint or shared action.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The agreement was just reciprocal, not coreciprocal.","correct":"✓ The agreement was coreciprocal, emphasizing the mutual benefits for both parties.","note":"Use 'coreciprocal' when you want to emphasize the mutual and interactive nature of the agreement, rather than just a one-way benefit."},{"incorrect":"✗  The coreciprocal was one-sided.","correct":"✓  The coreciprocal relationship requires mutual participation.","note":"A coreciprocal relationship inherently involves mutual participation, so describing it as one-sided is contradictory."}],"priority":"★★☆"},"related_words":{"derivatives":["coreciprocity (noun): The state or quality of being coreciprocal.","coreciprocally (adverb): In a coreciprocal manner."],"related_terms":["reciprocal","mutual","interdependent","interactive"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Coreciprocal' is a more formal and less common term than 'reciprocal' or 'mutual.' It is used to emphasize the interactive and interdependent nature of a relationship or action. Understanding the prefix 'co-' (meaning 'together' or 'shared') helps clarify the meaning. This word is typically found in academic or technical contexts where precision is important."},"example_sentences":[{"sentence":"The coreciprocal nature of the teacher-student relationship fosters a positive learning environment.","translation":"教師と生徒の関係の相互的な性質は、良好な学習環境を育む。","type":"adjective","meaning_category":"相互的な関係にある"},{"sentence":"The success of the project depended on the coreciprocal efforts of all team members.","translation":"プロジェクトの成功は、すべてのチームメンバーの相互的な努力にかかっていた。","type":"adjective","meaning_category":"相互に影響しあう"},{"sentence":"Trust and respect are coreciprocals in any healthy relationship.","translation":"信頼と尊敬は、健全な関係における相互関係にある要素だ。","type":"noun","meaning_category":"相互関係にあるもの"}]}