{"word":"prescriptible","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"規定できる、指示できる、定められるべき","english_definition":"Capable of being prescribed or dictated; that may be laid down as a rule or direction.","examples":[{"sentence":"The doctor's orders were prescriptible, leaving no room for interpretation.","translation":"医師の指示は規定可能であり、解釈の余地はなかった。"},{"sentence":"Whether such behavior is prescriptible is a matter of debate.","translation":"そのような行動が定められるべきかどうかは議論の余地がある。"}],"collocations":["prescriptible rules","prescriptible behavior","prescriptible guidelines"],"synonyms":["definable","regulatable","stipulatable","enjoinable"],"antonyms":["indefinable","unregulatable","unstipulatable"]},{"part_of_speech":"adjective","definition":"時効によって権利を主張できる","english_definition":"That may be acquired by prescription; relating to or involving prescription.","examples":[{"sentence":"The land became prescriptible after the statutory period of occupation.","translation":"その土地は、法定占有期間の経過後、時効によって権利を主張できるようになった。"}],"collocations":["prescriptible rights","prescriptible property","prescriptible claims"],"synonyms":["acquirable","obtainable by prescription"],"antonyms":["imprescriptible"]}],"etymology":{"value":"From Latin 'praescriptus', past participle of 'praescribere' (to prescribe), + '-ible'.","priority":"★★☆"},"pronunciation":{"ipa":"/prɪˈskrɪptɪbəl/","syllables":"pre-scrip-ti-ble"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more prescriptible' and 'most prescriptible', respectively."},"usage_notes":{"explanation":"'Prescriptible' is a relatively uncommon word with two main meanings. The first relates to something that can be prescribed or dictated, often referring to rules or guidelines. The second meaning relates to something that can be acquired through prescription, in a legal sense, such as rights or property acquired through long-term use or occupation. It is often contrasted with 'imprescriptible', which means not subject to prescription or limitation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The medicine was prescriptible without a doctor's note.","correct":"✓ The medicine was available by prescription only.","note":"'Prescriptible' describes the nature of something that *can* be prescribed, not whether a prescription is *required*. The correct way to express that a prescription is needed is to say 'available by prescription only'."}],"priority":"★☆☆"},"related_words":{"derivatives":["prescribe (verb)","prescription (noun)","prescriptive (adjective)","imprescriptible (adjective)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Prescriptible' is a formal and uncommon word. It has two main meanings: (1) capable of being prescribed, meaning that rules or guidelines can be laid down about it, and (2) capable of being acquired by prescription, referring to legal rights or property gained through long-term use. The word is more often encountered in legal or academic contexts. The antonym 'imprescriptible' is more frequently used, especially in discussions of human rights or fundamental freedoms that cannot be taken away or limited by time or legal processes."},"example_sentences":[{"sentence":"Whether these social norms are prescriptible by law is a complex question.","translation":"これらの社会規範が法律によって規定できるかどうかは複雑な問題である。","type":"adjective","meaning_category":"規定できる"},{"sentence":"The easement became prescriptible after twenty years of continuous use.","translation":"その地役権は、20年間の継続使用の後、時効によって権利を主張できるようになった。","type":"adjective","meaning_category":"時効によって権利を主張できる"}]}