{"word":"Hieromartyr","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Eastern Orthodox Church) A priest or bishop martyred for their faith.","english_definition":"In the Eastern Orthodox Church, a priest or bishop who was martyred for their Christian faith.","examples":[{"sentence":"Saint Ignatius of Antioch is considered a Hieromartyr.","translation":"アンティオキアの聖イグナティウスはヒエロマルティルとみなされています。"},{"sentence":"The Hieromartyr was venerated for his unwavering commitment to Christ.","translation":"そのヒエロマルティルは、キリストへの揺るぎない献身によって崇敬されていました。"}],"collocations":["venerate a Hieromartyr","Hieromartyr's feast day","Hieromartyr Saint"],"synonyms":["martyr-priest","martyr-bishop"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words ἱερο- (hiero-), meaning 'sacred' or 'priestly', and μάρτυς (martys), meaning 'witness' or 'martyr'.","priority":"★★☆"},"pronunciation":{"ipa":"ˌhaɪəroʊˈmɑːrtər","syllables":"Hi-e-ro-mar-tyr"},"inflection":{"noun_plural":"Hieromartyrs"},"usage_notes":{"explanation":"The term 'Hieromartyr' is specific to the Eastern Orthodox and Eastern Catholic Churches. It distinguishes clergy who were martyred from laypeople who were martyred (Martyrs) and from other categories of saints. The term reflects the belief that their priestly or episcopal office added a special dimension to their martyrdom.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a hieromartyr because he was a good person.","correct":"✓ He was a hieromartyr because he was killed for his Christian faith while serving as a priest.","note":"Being a good person is not sufficient for being considered a hieromartyr; the individual must have been a priest or bishop and martyred for their faith."}],"priority":"★☆☆"},"related_words":{"derivatives":["Hieromartyrdom (noun: the state or act of being a Hieromartyr)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hieromartyr' is a specialized term used within Eastern Orthodox and Eastern Catholic Christian contexts. It refers specifically to a priest or bishop who has been martyred for their faith. Understanding this term requires familiarity with the hierarchical structure and terminology of these religious traditions. It is not a commonly used word outside of these specific religious circles."},"example_sentences":[{"sentence":"The Orthodox Church commemorates the Hieromartyr on his feast day.","translation":"正教会はそのヒエロマルティルの記念日を祝います。","type":"noun","meaning_category":"Religious title"},{"sentence":"Many Hieromartyrs suffered greatly for refusing to renounce their belief in Christ.","translation":"多くのヒエロマルティルは、キリストへの信仰を捨てることを拒否したために大きな苦しみを受けました。","type":"noun","meaning_category":"Religious title"}]}