{"word":"laryngological","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"喉頭科学の、喉頭病学の","english_definition":"Relating to laryngology, the branch of medicine that deals with diseases and conditions of the larynx (voice box).","examples":[{"sentence":"The patient underwent a laryngological examination to determine the cause of their hoarseness.","translation":"患者は声のかすれの原因を特定するために、喉頭科学的な検査を受けた。"},{"sentence":"Laryngological research has led to advancements in the treatment of vocal cord disorders.","translation":"喉頭科学の研究は、声帯の疾患の治療の進歩につながった。"}],"collocations":["laryngological examination","laryngological findings","laryngological surgery","laryngological specialist","laryngological assessment"],"synonyms":["laryngeal","vocal"],"antonyms":[]}],"etymology":{"value":"Derived from 'laryngology' (the study of the larynx) + '-ical' (forming adjectives).","priority":"★★★"},"pronunciation":{"ipa":"/ləˌrɪŋɡəˈlɒdʒɪkəl/","syllables":"la-ryn-go-log-i-cal"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Laryngological' is a specialized term used in medical contexts to describe anything related to the study, diagnosis, and treatment of the larynx. It is typically used by medical professionals.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor performed a laryngology exam.","correct":"✓ The doctor performed a laryngological exam.","note":"'Laryngology' is the field of study, while 'laryngological' is the adjective describing something related to that field."}],"priority":"★★☆"},"related_words":{"derivatives":["laryngology (noun: the study of the larynx)","laryngologist (noun: a doctor specializing in laryngology)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. This is a highly specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Laryngological' is a technical term used in medicine. It describes something related to laryngology, which is the study of the larynx, also known as the voice box. This word is typically used by doctors and medical researchers. If you encounter this word, it will likely be in a medical context.","priority":"★★★"},"example_sentences":[{"sentence":"The laryngological report detailed the abnormalities found in the patient's vocal cords.","translation":"喉頭科学的な報告書は、患者の声帯に見つかった異常について詳しく述べていた。","type":"adjective","meaning_category":"Relating to the larynx"},{"sentence":"She sought a laryngological consultation for her persistent sore throat and voice changes.","translation":"彼女は持続的な喉の痛みと声の変化のために、喉頭科学の診察を求めた。","type":"adjective","meaning_category":"Relating to the larynx"}]}