{"word":"MDC","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(医学)最小検出可能濃度 (Minimum Detectable Concentration)","english_definition":"(Medicine) Abbreviation for Minimum Detectable Concentration, the lowest concentration of a substance that can be reliably detected by an analytical procedure.","examples":[{"sentence":"The MDC for this assay is 0.5 ng/mL.","translation":"このアッセイの最小検出可能濃度は0.5 ng/mLです。"}],"collocations":[],"synonyms":["LOD (Limit of Detection)"],"antonyms":[]},{"part_of_speech":"noun","definition":"(金融)市場データ消費者 (Market Data Consumer)","english_definition":"(Finance) Abbreviation for Market Data Consumer, an entity that receives and utilizes real-time or delayed market data from exchanges or vendors.","examples":[{"sentence":"The financial institution acts as an MDC, using the data for trading and analysis.","translation":"その金融機関は市場データ消費者として機能し、取引と分析のためにデータを使用します。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(コンピュータ) メッセージ配信コンテキスト (Message Delivery Context)","english_definition":"(Computing) Abbreviation for Message Delivery Context, information related to the delivery of a message, such as routing and security parameters.","examples":[{"sentence":"The MDC contains the necessary information for the message to be delivered securely.","translation":"MDCには、メッセージが安全に配信されるために必要な情報が含まれています。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(その他) その他様々な組織・略称","english_definition":"(Miscellaneous) Various organizations and abbreviations, context-dependent.","examples":[{"sentence":"MDC (Maryland Department of Corrections)","translation":"MDC（メリーランド州矯正局）"},{"sentence":"MDC (Miami Dade College)","translation":"MDC（マイアミデイド大学）"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Acronym formed from the initial letters of the words in the phrase it represents. The specific etymology depends on the meaning of the acronym.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛmˌdiːˈsiː/","syllables":"em-dee-see"},"inflection":{"notes":"Plural form is MDCS."},"usage_notes":{"explanation":"MDC is an acronym that can have multiple meanings depending on the context. It's crucial to understand the field (e.g., medicine, finance, computing) to interpret the correct meaning. In medicine, it refers to the minimum detectable concentration. In finance, it denotes a market data consumer. In computing, it relates to message delivery context. It can also stand for various organizations, such as Maryland Department of Corrections or Miami Dade College.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The MDC was very loud.","correct":"✓ (Context needed) The MDC (e.g., a market data consumer) experienced high data throughput.","note":"Without context, it's impossible to know what 'MDC' refers to. Provide context to avoid ambiguity."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_concepts":["Minimum Detectable Level (MDL)","Market Data","Message Queue"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Technical term)","frequency_google_ngram":"Low frequency (Context-dependent)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'MDC' is a highly context-dependent acronym. Its meaning varies significantly depending on the field in which it is used. In scientific or medical contexts, it typically refers to 'Minimum Detectable Concentration,' a technical term related to analytical sensitivity. In finance, it stands for 'Market Data Consumer,' referring to entities that utilize market data. In computing, it can mean 'Message Delivery Context.' Due to its varied meanings, it is essential to understand the specific domain to correctly interpret the acronym. Without context, 'MDC' is ambiguous and its meaning cannot be determined."},"example_sentences":[{"sentence":"The **MDC** of the new test is significantly lower than the old one.","translation":"新しい検査の最小検出可能濃度は、古いものよりも大幅に低いです。","type":"noun","meaning_category":"Minimum Detectable Concentration (Medicine)"},{"sentence":"As an **MDC**, the company requires a high-speed data connection.","translation":"市場データ消費者として、その会社は高速データ接続を必要とします。","type":"noun","meaning_category":"Market Data Consumer (Finance)"},{"sentence":"The **MDC** ensures that the message is routed correctly.","translation":"MDCは、メッセージが正しくルーティングされることを保証します。","type":"noun","meaning_category":"Message Delivery Context (Computing)"}]}