{"word":"Tepehua","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"テペワ族（メキシコに住む先住民族）","english_definition":"A group of indigenous people living in Mexico.","examples":[{"sentence":"The Tepehua people primarily reside in the states of Hidalgo, Veracruz, and Puebla.","translation":"テペワ族は主にイダルゴ州、ベラクルス州、プエブラ州に居住しています。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"テペワ語（テペワ族が話す言語）","english_definition":"The language spoken by the Tepehua people.","examples":[{"sentence":"Tepehua is a closely related language to Totonac.","translation":"テペワ語はトトナカ語と密接な関係があります。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the Nahuatl word 'tepehuani,' meaning 'owner of the hills' or 'mountain people.'","priority":"★★☆"},"pronunciation":{"ipa":"/teˈpewa/","syllables":"Te-pe-hua"},"inflection":{},"usage_notes":{"explanation":"'Tepehua' can refer to both the people and their language. When referring to the people, it is a plural noun. When referring to the language, it is a singular noun.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["Tepehuan (related but distinct indigenous group and language in northern Mexico)"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"'Tepehua' is a specific term referring to an indigenous group and their language in Mexico. It is not a commonly known term outside of specialized contexts such as anthropology, linguistics, or Mexican studies. Therefore, understanding and use of this term is more likely among advanced learners or those with specific knowledge in these areas."},"example_sentences":[{"sentence":"The Tepehua community maintains many of its traditional customs.","translation":"テペワ族のコミュニティは、多くの伝統的な習慣を維持しています。","type":"noun","meaning_category":"テペワ族"},{"sentence":"Linguists are studying the Tepehua language to understand its relationship to other Mesoamerican languages.","translation":"言語学者は、他のメソアメリカの言語との関係を理解するために、テペワ語を研究しています。","type":"noun","meaning_category":"テペワ語"}]}