{"word":"Pellian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(数学)ペル方程式に関連する、またはペル方程式の形をした","english_definition":"(mathematics) Relating to or having the form of Pell's equation.","examples":[{"sentence":"The Pellian equation is a Diophantine equation of the form x² - ny² = 1, where n is a non-square integer.","translation":"ペル方程式は、x² - ny² = 1 の形のディオファントス方程式であり、ここで n は非平方整数である。"},{"sentence":"Pellian triples are solutions to Pell's equation.","translation":"ペル数組はペル方程式の解である。"}],"collocations":["Pellian equation","Pellian triple","Pellian resolvent"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after John Pell, an English mathematician, although he was not the first to study the equation. The equation was mistakenly attributed to him by Leonhard Euler.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɛliən/","syllables":"Pel-li-an"},"inflection":{"notes":"This word does not have plural forms or comparative/superlative degrees."},"usage_notes":{"explanation":"The term 'Pellian' is almost exclusively used in mathematical contexts, specifically when discussing Pell's equation and related concepts. It is not a commonly used word outside of mathematics.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Pell's equation"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Pellian' is a highly specialized term used in advanced mathematics, specifically in the context of number theory and Diophantine equations. Understanding this term requires familiarity with mathematical concepts such as integer solutions, quadratic forms, and the history of number theory. It is unlikely to be encountered outside of academic or research settings related to mathematics."},"example_sentences":[{"sentence":"The fundamental solution of the Pellian equation can be found using continued fractions.","translation":"ペル方程式の基本解は、連分数を用いて見つけることができる。","type":"adjective","meaning_category":"数学"}]}