{"word":"monometalist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"金本位制論者、単本位制支持者","english_definition":"An advocate of monometallism, especially the gold standard.","examples":[{"sentence":"As a monometalist, he strongly believed in the stability of a currency backed by gold.","translation":"金本位制論者として、彼は金に裏打ちされた通貨の安定性を強く信じていた。"}],"collocations":["gold monometalist","silver monometalist"],"synonyms":["gold standard advocate","single standard supporter"],"antonyms":["bimetallist"]}],"etymology":{"value":"'Mono-' (single) + 'metal' (referring to the monetary metal) + '-ist' (a person who believes in or advocates something).","priority":"★★☆"},"pronunciation":{"ipa":"/məˈnɒmɪtəlɪst/","syllables":"mo-no-met-al-ist"},"inflection":{"noun_plural":"monometalists"},"usage_notes":{"explanation":"'Monometalist' refers to a person who advocates for a monetary system based on a single metal, typically gold (gold standard). This is in contrast to 'bimetallism,' which advocates for a system based on two metals, usually gold and silver. The term is most often used in historical contexts, particularly when discussing 19th and early 20th-century economic debates.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a monometal.","correct":"✓ He is a monometalist.","note":"'Monometal' refers to the single metal used in the system, while 'monometalist' refers to the person who advocates for the system."}],"priority":"★★☆"},"related_words":{"derivatives":["monometallism"],"phrases":["gold standard","bimetallism"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in historical or specialized economic discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'monometalist' is highly specialized and primarily found in discussions of economic history or monetary policy. It refers to someone who supports a monetary system based on a single metal, usually gold. Understanding this term requires familiarity with economic concepts and historical debates about currency standards."},"example_sentences":[{"sentence":"The monometalist argued that a gold standard would prevent inflation.","translation":"金本位制論者は、金本位制がインフレを防ぐと主張した。","type":"noun","meaning_category":"金本位制論者"},{"sentence":"Many monometalists believed in the self-regulating nature of the gold standard.","translation":"多くの単本位制支持者は、金本位制の自己調整機能を信じていた。","type":"noun","meaning_category":"単本位制支持者"}]}