{"word":"gladiatorism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"剣闘士根性、剣闘士精神、闘争主義、弱肉強食の社会観","english_definition":"The principles or practices of gladiators; a philosophy or system based on ruthless competition and survival of the fittest.","examples":[{"sentence":"His gladiatorism was evident in his cutthroat business tactics.","translation":"彼の剣闘士根性は、彼の冷酷なビジネス戦術に明らかだった。"},{"sentence":"The company's gladiatorism led to a toxic work environment.","translation":"その会社の闘争主義は、有害な職場環境につながった。"},{"sentence":"Some argue that modern capitalism promotes gladiatorism.","translation":"現代の資本主義は闘争主義を助長すると主張する人もいる。"}],"collocations":["business gladiatorism","corporate gladiatorism","social gladiatorism"],"synonyms":["ruthless competition","survival of the fittest","dog-eat-dog mentality","cutthroat competition","aggressive competition"],"antonyms":["cooperation","collaboration","altruism","harmony","egalitarianism"]}],"etymology":{"value":"From 'gladiator' (a combatant in ancient Roman public games) + '-ism' (a suffix denoting a principle, practice, or system).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡlædieɪtərɪzəm/","syllables":"gla-di-a-tor-is-m"},"inflection":{"noun_plural":"None (uncountable noun)"},"usage_notes":{"explanation":"'Gladiatorism' is a relatively rare and often negative term. It suggests a brutal and unforgiving environment where only the strongest or most ruthless succeed. It is often used critically to describe systems or philosophies that prioritize competition over cooperation or fairness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The gladiatorism was very kindness.","correct":"✓ The gladiatorism was very cruel.","note":"'Gladiatorism' implies cruelty and ruthlessness, so it's usually associated with negative qualities, not positive ones like kindness."},{"incorrect":"✗ He practiced gladiatorism by helping others.","correct":"✓ He practiced gladiatorism by undermining his rivals.","note":"'Gladiatorism' involves competition and often harming others to succeed, not helping them."}],"priority":"★★☆"},"related_words":{"derivatives":["gladiator","gladiatorial"],"phrases":["gladiatorial combat","gladiatorial games"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Gladiatorism' is a complex term that describes a system or philosophy based on intense competition and the idea that only the strongest survive. It's often used to criticize environments where people are ruthless and prioritize winning at all costs. This word is not commonly used in everyday conversation and is more likely to appear in academic or critical discussions."},"example_sentences":[{"sentence":"The company's culture of **gladiatorism** made it difficult for employees to collaborate effectively.","translation":"その会社の闘争主義的な文化は、従業員が効果的に協力することを困難にした。","type":"general","meaning_category":"闘争主義的な文化"},{"sentence":"Some critics argue that reality television promotes a form of social **gladiatorism**.","translation":"現実のテレビ番組は、社会的な闘争主義の一形態を促進すると批判する人もいる。","type":"general","meaning_category":"社会的な闘争主義"},{"sentence":"His relentless pursuit of success was driven by a strong sense of **gladiatorism**.","translation":"彼の成功への絶え間ない追求は、強い剣闘士根性に突き動かされていた。","type":"general","meaning_category":"剣闘士根性"}]}