{"word":"Reavowal","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A renewed avowal; a reaffirmation or restatement of something previously declared.","english_definition":"The act of avowing again; a renewed declaration or affirmation.","examples":[{"sentence":"The politician's reavowal of his commitment to environmental protection was met with skepticism.","translation":"政治家の環境保護へのコミットメントの再表明は、懐疑的に受け止められた。"},{"sentence":"Despite the challenges, her reavowal of faith gave her strength.","translation":"困難にもかかわらず、彼女の信仰の再確認は彼女に力を与えた。"},{"sentence":"The company's reavowal of its core values was intended to reassure investors.","translation":"会社のコアバリューの再表明は、投資家を安心させることを目的としていた。"}],"collocations":["reavowal of commitment","reavowal of faith","reavowal of support","reavowal of allegiance","reavowal of principles"],"synonyms":["reaffirmation","restatement","renewal","reassertion","reconfirmation","reiteration"],"antonyms":["denial","repudiation","retraction","disavowal"]}],"etymology":{"value":"Formed by adding the prefix 're-' (meaning 'again' or 'anew') to 'avowal,' which comes from the Old French 'avouer' (to acknowledge, to avow), ultimately derived from the Latin 'advocare' (to call to one's aid, to invoke, to acknowledge).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːəˈvaʊəl/","syllables":"re-a-vow-al"},"inflection":{"noun_plural":"reavowals"},"usage_notes":{"explanation":"'Reavowal' is a relatively rare and formal word, typically used in contexts where a previous declaration or commitment is being emphasized or reaffirmed, often after a period of doubt or challenge. It suggests a deliberate and conscious act of restating one's position or belief.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The reavowal was done verbally, but no one believed it.","correct":"✓ The reavowal was made verbally, but no one believed it.","note":"Use 'made' or 'issued' with reavowal, not 'done'."},{"incorrect":"✗ He reavowed his love, but it was a reavowal of nothing.","correct":"✓ He reavowed his love, but it seemed insincere.","note":"'Reavowal of nothing' is not idiomatic. Instead, focus on the insincerity or lack of substance."}],"priority":"★☆☆"},"related_words":{"derivatives":["reavow (verb)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'reavowal' is a formal and uncommon term indicating a renewed or reaffirmed declaration. It is suitable for advanced learners and is typically found in legal, political, or philosophical contexts where precise and emphatic language is required. Understanding its etymology and subtle differences from similar words like 'reaffirmation' is crucial for correct usage."},"example_sentences":[{"sentence":"The treaty included a formal reavowal of the nations' commitment to peace.","translation":"その条約には、平和に対する各国のコミットメントの正式な再表明が含まれていた。","type":"noun","meaning_category":"reaffirmation"},{"sentence":"Her reavowal of her artistic vision inspired a new generation of painters.","translation":"彼女の芸術的ビジョンの再表明は、新世代の画家たちにインスピレーションを与えた。","type":"noun","meaning_category":"reassertion"},{"sentence":"Despite the rumors, he issued a public reavowal of his loyalty to the company.","translation":"噂にもかかわらず、彼は会社への忠誠を公に再表明した。","type":"noun","meaning_category":"renewal"}]}