{"word":"Balantidiosis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"バランチジウム症：バランチジウム・コリという繊毛虫によって引き起こされる人獣共通感染症","english_definition":"An infection caused by the protozoan parasite Balantidium coli.","examples":[{"sentence":"Balantidiosis is more common in areas with poor sanitation.","translation":"バランチジウム症は、衛生状態の悪い地域でより一般的です。"},{"sentence":"Symptoms of balantidiosis can include diarrhea and abdominal pain.","translation":"バランチジウム症の症状には、下痢や腹痛などがあります。"}],"collocations":["contract balantidiosis (バランチジウム症に感染する)","treat balantidiosis (バランチジウム症を治療する)","diagnose balantidiosis (バランチジウム症を診断する)"],"synonyms":["Balantidium coli infection"],"antonyms":[]}],"etymology":{"value":"Balantidium (属名) + -osis (病気の状態を示す接尾辞)","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌbæləntɪˈdaɪəsɪs/","syllables":"ba-lan-ti-di-o-sis"},"inflection":{"noun_plural":"balantidioses"},"usage_notes":{"explanation":"Balantidiosis is a zoonotic disease, meaning it can be transmitted from animals to humans. Pigs are a common reservoir for Balantidium coli. Infection typically occurs through the ingestion of contaminated food or water. Diagnosis is usually made by identifying the parasite in stool samples.","priority":"☆☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Balantidium coli (バランチジウム・コリ)"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Balantidiosis is a rare parasitic infection caused by Balantidium coli, a protozoan. It's primarily found in areas with poor sanitation and close contact with pigs, which are a major reservoir of the parasite. The infection is transmitted through the fecal-oral route, typically via contaminated food or water. Symptoms can range from mild diarrhea to severe dysentery. Diagnosis involves identifying the parasite in stool samples, and treatment usually involves antibiotics. Due to its rarity and specific risk factors, balantidiosis is not a commonly discussed or encountered condition.","priority":"☆☆☆"},"example_sentences":[{"sentence":"Human balantidiosis is most often acquired through the ingestion of food or water contaminated with feces containing Balantidium coli cysts.","translation":"ヒトのバランチジウム症は、バランチジウム・コリのシストを含む糞便で汚染された食物または水を摂取することによって最も頻繁に感染します。","type":"general","meaning_category":"infection"}]}