{"word":"Phytobacteriology","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"植物細菌学：植物病理学の一分野で、細菌によって引き起こされる植物の病気を研究する学問。","english_definition":"The branch of plant pathology that deals with plant diseases caused by bacteria.","examples":[{"sentence":"Phytobacteriology is crucial for understanding and managing bacterial diseases in crops.","translation":"植物細菌学は、作物における細菌性疾患を理解し、管理するために重要である。"},{"sentence":"Advances in phytobacteriology have led to the development of new disease-resistant plant varieties.","translation":"植物細菌学の進歩は、新しい耐病性植物品種の開発につながっている。"}],"collocations":["study of phytobacteriology (植物細菌学の研究)","research in phytobacteriology (植物細菌学の研究)","field of phytobacteriology (植物細菌学の分野)"],"synonyms":["plant bacteriology"],"antonyms":[]}],"etymology":{"value":"\"phyto-\" (植物) + \"bacteriology\" (細菌学)","priority":"★★★"},"pronunciation":{"ipa":"/ˌfaɪtoʊbækˌtɪəriˈɒlədʒi/","syllables":"phy-to-bac-te-ri-ol-o-gy"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Phytobacteriology is a specialized field within plant pathology, focusing specifically on bacterial diseases. It encompasses the identification, characterization, and management of plant-pathogenic bacteria.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["phytobacteriologist (植物細菌学者)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Phytobacteriology is a highly specialized term used within the scientific community, specifically in the context of plant pathology. It refers to the study of plant diseases caused by bacteria. Due to its technical nature, it is not commonly encountered outside of academic or research settings. Understanding requires familiarity with basic concepts in biology, microbiology, and plant science."},"example_sentences":[{"sentence":"The phytobacteriology lab is equipped with advanced tools for bacterial identification.","translation":"その植物細菌学研究室には、細菌同定のための高度なツールが装備されている。","type":"general","meaning_category":"学問分野"},{"sentence":"Understanding the principles of phytobacteriology is essential for developing effective disease control strategies.","translation":"効果的な病害防除戦略を開発するには、植物細菌学の原則を理解することが不可欠である。","type":"general","meaning_category":"学問分野"}]}