{"word":"Vomitories","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(古代ローマの劇場や競技場の)観客席への出入り口","english_definition":"A passage situated below or behind a tier of seats in an amphitheater or stadium, through which big crowds can exit rapidly.","examples":[{"sentence":"The crowd surged through the vomitories after the concert.","translation":"コンサートの後、観客は吐き出し口を通って押し寄せた。"},{"sentence":"The vomitories allowed for quick dispersal of the audience.","translation":"吐き出し口のおかげで、観客は素早く分散できた。"}],"collocations":["stadium vomitories","theater vomitories","ancient vomitories","exit through vomitories","enter through vomitories"],"synonyms":["exit","entrance","passageway","corridor","gateway"],"antonyms":[]}],"etymology":{"value":"From Latin vomitorium, from vomere 'to vomit forth'. The name was applied because the passages allowed large numbers of people to 'spew forth' from the building.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvɒmɪtɔːriz/","syllables":"vom-i-to-ries"},"inflection":{"noun_plural":"vomitories"},"usage_notes":{"explanation":"'Vomitories' refers specifically to the entrance and exit passages in ancient Roman theaters and stadiums. While the word literally means 'to vomit forth', it's used in architecture to describe the function of these passages in quickly dispersing large crowds. It is not commonly used to describe modern exits, unless making a direct comparison to ancient Roman architecture.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The emergency exit was a vomitory.","correct":"✓ The emergency exit was a passageway.","note":"'Vomitory' is specific to ancient Roman architecture. Use 'passageway' or 'exit' for modern buildings."},{"incorrect":"✗ Vomitories are where people got sick at the stadium.","correct":"✓ Vomitories are exits for large crowds at stadiums.","note":"'Vomitory' refers to the exit, not a place where people vomit. "}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["amphitheater","stadium","arena","colosseum","passageway","exit","entrance"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Vomitories' is a specialized term used in the context of ancient Roman architecture, specifically referring to the entrance and exit passages in amphitheaters and stadiums. It's derived from the Latin word for 'to vomit forth,' describing how crowds would quickly exit these structures. This term is not commonly used in everyday language or modern architectural contexts, making it a high-level vocabulary word. Understanding its usage requires familiarity with historical architecture and Latin etymology."},"example_sentences":[{"sentence":"The gladiators entered the arena through the grand vomitories.","translation":"剣闘士たちは壮大な吐き出し口を通って競技場に入場した。","type":"noun","meaning_category":"entrance"},{"sentence":"The vomitories were designed to allow thousands of spectators to leave the Colosseum in minutes.","translation":"吐き出し口は、何千人もの観客が数分でコロッセオから退出できるように設計された。","type":"noun","meaning_category":"exit"},{"sentence":"Archaeologists are still studying the intricate design of the vomitories in the ancient theater.","translation":"考古学者は、古代劇場の吐き出し口の複雑な設計を今も研究している。","type":"noun","meaning_category":"passageway"}]}