{"word":"Missampling","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"標本抽出の誤り、不適切なサンプリング","english_definition":"A sampling error that occurs when the sample is not representative of the population.","examples":[{"sentence":"The study suffered from missampling, as it only included participants from one specific demographic.","translation":"その研究は、特定の人口統計の参加者のみを含んでいたため、標本抽出の誤りがあった。"},{"sentence":"The results were skewed due to missampling, leading to inaccurate conclusions.","translation":"結果は不適切なサンプリングにより歪められ、不正確な結論につながった。"}],"collocations":["sampling bias","non-random sampling","biased sample"],"synonyms":["sampling error","biased sampling","unrepresentative sampling"],"antonyms":["random sampling","representative sampling"]}],"etymology":{"value":"'Mis-' (誤った) + 'sampling' (標本抽出)","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌmɪsˈsæmplɪŋ/","syllables":"mis-sam-pling"},"inflection":{"noun_plural":"missamplings"},"usage_notes":{"explanation":"'Missampling' refers to a specific type of sampling error where the selected sample does not accurately reflect the characteristics of the overall population. This can lead to biased results and incorrect inferences about the population. It's crucial to employ proper sampling techniques to avoid missampling.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The missampling caused the results to be completely accurate.","correct":"✓ The missampling caused the results to be inaccurate.","note":"Missampling leads to inaccurate, not accurate, results."},{"incorrect":"✗ We used random sampling to ensure missampling.","correct":"✓ We used random sampling to avoid missampling.","note":"Random sampling is used to avoid, not ensure, missampling."}],"priority":"★☆☆"},"related_words":{"derivatives":["mis-sampled (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Missampling' is a technical term related to statistics and research methodology. It refers to a situation where the sample used in a study is not representative of the population, leading to biased or inaccurate results. Understanding this term is important for evaluating the validity of research findings.","priority":"★★☆"},"example_sentences":[{"sentence":"The researchers acknowledged that missampling might have affected the study's conclusions.","translation":"研究者たちは、標本抽出の誤りが研究の結論に影響を与えた可能性があることを認めた。","type":"noun","meaning_category":"標本抽出の誤り"},{"sentence":"Careful planning is essential to prevent missampling in surveys.","translation":"調査における標本抽出の誤りを防ぐためには、慎重な計画が不可欠である。","type":"noun","meaning_category":"標本抽出の誤り"}]}