{"word":"GUID","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"グローバル一意識別子（Globally Unique Identifier）","english_definition":"A universally unique identifier (UUID) is a 128-bit label used for information in computer systems. The term UUID is used by the Open Software Foundation (OSF), whereas GUID is used by Microsoft.","examples":[{"sentence":"The database uses a GUID to uniquely identify each record.","translation":"データベースは、各レコードを一意に識別するためにGUIDを使用します。"},{"sentence":"A new GUID was generated for the component.","translation":"コンポーネント用に新しいGUIDが生成されました。"}],"collocations":["generate GUID","GUID generator","GUID value","GUID string"],"synonyms":["UUID","Universally Unique Identifier"],"antonyms":[]}],"etymology":{"value":"Acronym for Globally Unique Identifier. Microsoft's implementation of the UUID standard.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡuːɪd/","syllables":"guid"},"inflection":{"noun_plural":"GUIDs"},"usage_notes":{"explanation":"GUID is a 128-bit number used to uniquely identify information in computer systems. It is often represented as a hexadecimal string. While the terms GUID and UUID are often used interchangeably, GUID is specifically used in the Microsoft environment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The GUID is a very long integer.","correct":"✓ The GUID is a 128-bit identifier.","note":"GUIDs are not integers, but identifiers represented by 128 bits."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["UUID","CLSID","Interface ID"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"GUID (Globally Unique Identifier) is a technical term used in computer science and software development. It refers to a 128-bit number that is designed to be unique across all systems and networks. It's commonly used to identify database records, software components, and other entities where uniqueness is critical. While the term UUID (Universally Unique Identifier) is more generic, GUID is specifically associated with Microsoft technologies. Understanding GUIDs is important for developers working with Microsoft platforms and systems that require unique identification of objects."},"example_sentences":[{"sentence":"Each user account is assigned a unique GUID.","translation":"各ユーザーアカウントには、一意のGUIDが割り当てられます。","type":"noun","meaning_category":"identifier"},{"sentence":"The application generates a new GUID for each session.","translation":"アプリケーションは、セッションごとに新しいGUIDを生成します。","type":"noun","meaning_category":"identifier"}]}