{"word":"Nemesia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ネメシア (オトギリソウ目ゴマノハグサ科の植物の属)","english_definition":"A genus of annuals, perennials, and sub-shrubs in the family Scrophulariaceae, native to South Africa.","examples":[{"sentence":"The garden was filled with colorful Nemesia flowers.","translation":"庭は色とりどりのネメシアの花でいっぱいだった。"},{"sentence":"Nemesia is a popular choice for bedding plants.","translation":"ネメシアは花壇の植物として人気がある。"}],"collocations":["Nemesia strumosa","Nemesia caerulea","grow Nemesia","plant Nemesia","Nemesia flower","colorful Nemesia"],"synonyms":["Cape Jewels","Diascia","Alonsoa"],"antonyms":[]}],"etymology":{"value":"The name 'Nemesia' is derived from the Greek word 'Nemesis', possibly referring to the goddess of retribution, or to the plant's resemblance to flax, which was associated with Nemesis.","priority":"★★☆"},"pronunciation":{"ipa":"/nɪˈmiːziə/","syllables":"Ne-me-si-a"},"inflection":{"noun_plural":"Nemesias"},"usage_notes":{"explanation":"'Nemesia' refers to a genus of flowering plants, often used in gardens for their bright colors and pleasant fragrance. It's important to note that the pronunciation can vary slightly.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I planted nemesias in my garden, it is so beautiful.","correct":"✓ I planted nemesias in my garden; they are so beautiful.","note":"'Nemesia' is a noun, so it requires a pronoun or a separate sentence to describe it."}],"priority":"★☆☆"},"related_words":{"derivatives":["nemesias (plural form)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nemesia' is a botanical term referring to a specific genus of flowering plants. It is typically encountered in gardening contexts or botanical discussions. Understanding its usage requires some familiarity with plant classification and gardening vocabulary."},"example_sentences":[{"sentence":"The vibrant colors of the Nemesia attracted many bees.","translation":"ネメシアの鮮やかな色彩は多くの蜂を引き寄せた。","type":"noun","meaning_category":"plant"},{"sentence":"She chose Nemesia for its long blooming season.","translation":"彼女はネメシアを開花期間が長いという理由で選んだ。","type":"noun","meaning_category":"plant"}]}