{"word":"Autonetics","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(historical) A division of North American Aviation (later Rockwell International) that developed guidance and control systems, primarily for missiles and spacecraft.","english_definition":"A former division of North American Aviation (later Rockwell International) known for developing guidance and control systems, especially for missiles and spacecraft.","examples":[{"sentence":"Autonetics was a key contractor for the Minuteman missile program.","translation":"オートネティクスは、ミニットマンミサイル計画の主要な契約業者でした。"},{"sentence":"The inertial navigation systems developed by Autonetics were used in many aircraft.","translation":"オートネティクスによって開発された慣性航法システムは、多くの航空機で使用されました。"}],"collocations":["Autonetics division","Autonetics navigation system","Autonetics guidance system"],"synonyms":["Rockwell Autonetics"],"antonyms":[]}],"etymology":{"value":"Formed from \"automatic\" and \"electronics\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɔːtoʊˈnɛtɪks/","syllables":"Au-to-net-ics"},"inflection":{},"usage_notes":{"explanation":"'Autonetics' is a proper noun referring to a specific, historical entity. It is primarily relevant in contexts discussing aerospace engineering, military technology, and the history of technology.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["automation","electronics"],"related_terms":["Rockwell International","North American Aviation","inertial navigation system","guidance system"]},"level_frequency":{"frequency_google_ngram":"Low frequency, primarily in historical or technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Autonetics' is a specialized term primarily encountered in historical or technical discussions related to aerospace and defense. Understanding requires familiarity with the history of these industries and the companies involved."},"example_sentences":[{"sentence":"The Apollo program relied heavily on guidance systems developed by Autonetics.","translation":"アポロ計画は、オートネティクスによって開発された誘導システムに大きく依存していました。","type":"noun","meaning_category":"Company Name"},{"sentence":"Autonetics' contributions to missile technology were significant during the Cold War.","translation":"オートネティクスのミサイル技術への貢献は、冷戦時代に重要なものでした。","type":"noun","meaning_category":"Company Name"}]}