{"word":"unsymmetrized","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"対称化されていない、非対称化された","english_definition":"Not symmetrized; lacking symmetry or having had symmetry removed.","examples":[{"sentence":"The unsymmetrized wavefunction is more complex to deal with.","translation":"対称化されていない波動関数は、扱うのがより複雑です。"},{"sentence":"An unsymmetrized tensor can have different properties.","translation":"対称化されていないテンソルは、異なる特性を持つことがあります。"}],"collocations":["unsymmetrized wavefunction","unsymmetrized tensor","unsymmetrized data"],"synonyms":["asymmetric","non-symmetrized"],"antonyms":["symmetrized"]}],"etymology":{"value":"Derived from \"symmetrized\" by adding the prefix \"un-\", indicating negation or the opposite of the base word.","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈsɪmɪˌtraɪzd/","syllables":"un-sim-mi-traized"},"inflection":{"notes":"Adjective; comparative and superlative forms (more unsymmetrized, most unsymmetrized) exist but are rare."},"usage_notes":{"explanation":"This term is primarily used in technical fields like physics, mathematics, and computer science, where symmetry is a critical concept. It describes something that either lacks symmetry or has had its symmetry removed through some process.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unsymmetrized object was very symmetry.","correct":"✓ The unsymmetrized object lacked symmetry.","note":"\"Symmetry\" is a noun, not an adjective in this context. Use \"lacked symmetry\" or \"was asymmetric\"."}],"priority":"★★☆"},"related_words":{"derivatives":["unsymmetrically"],"related_terms":["symmetry","symmetrize","antisymmetrized"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unsymmetrized' is a technical term used in advanced scientific and mathematical contexts. Understanding requires familiarity with the concept of symmetry and the processes by which objects or functions can be symmetrized or, conversely, left unsymmetrized. It's not commonly used in everyday language."},"example_sentences":[{"sentence":"The researcher analyzed the unsymmetrized data to identify patterns.","translation":"研究者はパターンを特定するために、対称化されていないデータを分析しました。","type":"general","meaning_category":"general"},{"sentence":"In quantum mechanics, the unsymmetrized product state does not satisfy the Pauli exclusion principle.","translation":"量子力学では、対称化されていない積状態はパウリの排他原理を満たしません。","type":"technical","meaning_category":"physics"}]}