{"word":"ISPM","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"国際植物検疫措置基準 (International Standards for Phytosanitary Measures)","english_definition":"International Standards for Phytosanitary Measures; a set of standards developed by the International Plant Protection Convention (IPPC) to prevent the spread of plant pests and diseases during international trade.","examples":[{"sentence":"ISPM 15 requires that wood packaging material be treated to prevent the spread of pests.","translation":"ISPM 15は、木材梱包材が害虫の蔓延を防ぐために処理されることを要求しています。"},{"sentence":"Compliance with ISPM standards is essential for international trade in plants and plant products.","translation":"ISPM基準の遵守は、植物および植物製品の国際貿易に不可欠です。"}],"collocations":["ISPM 15","comply with ISPM","ISPM standards","ISPM requirements"],"synonyms":["International Standards for Phytosanitary Measures"],"antonyms":[]}],"etymology":{"value":"An acronym for International Standards for Phytosanitary Measures.","priority":"★★★"},"pronunciation":{"ipa":"/ˌaɪ.ɛs.piːˈɛm/","syllables":"I-S-P-M"},"inflection":{"notes":"This is an acronym, so it doesn't inflect."},"usage_notes":{"explanation":"ISPM is an acronym referring to a set of international standards developed to prevent the spread of plant pests and diseases during international trade. These standards are crucial for ensuring that wood packaging material (pallets, crates, etc.) is treated to prevent the introduction of invasive species. The most well-known standard is ISPM 15, which outlines specific treatment and marking requirements for wood packaging material.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company follows the ISPM's.","correct":"✓ The company follows the ISPM standards.","note":"ISPM is an acronym for the standards themselves, so it's more accurate to say 'ISPM standards' or 'ISPM requirements' rather than adding an apostrophe 's'. "},{"incorrect":"✗ ISPM is a law.","correct":"✓ ISPM is a standard.","note":"ISPMs are international standards, not laws. However, many countries incorporate ISPM requirements into their national regulations."}],"priority":"★★☆"},"related_words":{"derivatives":["phytosanitary","quarantine","fumigation","heat treatment","wood packaging material"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency, primarily used in trade and agricultural contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"ISPM stands for International Standards for Phytosanitary Measures. These are a set of guidelines created to stop plant diseases and pests from spreading when countries trade with each other. ISPM 15 is a well-known standard that focuses on how wood used for packing (like pallets and crates) should be treated to prevent the spread of pests. If you work in international trade, agriculture, or shipping, you'll likely come across ISPM standards.","priority":"★★☆"},"example_sentences":[{"sentence":"All wood packaging material must comply with ISPM 15 regulations.","translation":"すべての木材梱包材は、ISPM 15の規制に準拠する必要があります。","type":"noun","meaning_category":"International Standards"},{"sentence":"The shipment was rejected due to non-compliance with ISPM standards.","translation":"その出荷は、ISPM基準への不適合のため拒否されました。","type":"noun","meaning_category":"International Standards"}]}