{"word":"sapremic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(医学)腐敗毒血症の、腐敗物質が血液に混入した状態の","english_definition":"Relating to or characterized by sapremia, a condition in which putrefactive substances are absorbed into the blood.","examples":[{"sentence":"The patient showed signs of a sapremic condition following the surgery.","translation":"患者は手術後、腐敗毒血症の状態を示す兆候が見られた。"},{"sentence":"Prompt treatment is crucial to prevent a sapremic infection.","translation":"迅速な治療は、腐敗毒血症感染を防ぐために重要である。"}],"collocations":["sapremic infection","sapremic condition","sapremic poisoning"],"synonyms":["septic","putrid","toxic","infected"],"antonyms":["aseptic","sterile","clean"]}],"etymology":{"value":"Derived from 'sapro-' (Greek for rotten, putrid) + '-emia' (Greek for blood condition).","priority":"★★☆"},"pronunciation":{"ipa":"/sæˈpriːmɪk/","syllables":"sa-pre-mic"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Sapremic' is a medical term specifically describing a condition where decaying organic matter or its toxic products are absorbed into the bloodstream. It is relatively rare in modern medicine due to advancements in hygiene and medical practices. It is important to distinguish from septicemia, which involves the presence of pathogenic microorganisms in the blood.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The wound was just sapremic.","correct":"✓ The wound showed signs of sapremia.","note":"'Sapremic' is an adjective describing the condition; 'sapremia' is the noun referring to the condition itself."}],"priority":"★★☆"},"related_words":{"derivatives":["sapremia (noun): The condition of having putrefactive substances in the blood.","saprogenic (adjective): Producing or caused by putrefaction."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Sapremic' is a specialized medical term indicating a condition where toxins from decaying organic matter are absorbed into the bloodstream. It is primarily encountered in advanced medical texts or discussions. Understanding requires familiarity with medical terminology related to infections and blood conditions. It is not a term used in everyday language."},"example_sentences":[{"sentence":"The autopsy revealed a sapremic state resulting from the untreated wound.","translation":"剖検の結果、未治療の傷が原因で腐敗毒血症の状態であったことが判明した。","type":"adjective","meaning_category":"medical condition"},{"sentence":"The doctor suspected a sapremic process was contributing to the patient's deteriorating health.","translation":"医師は、腐敗毒血症のプロセスが患者の健康状態悪化の一因となっている疑いを持った。","type":"adjective","meaning_category":"medical condition"}]}