{"word":"Flexner","priority":"N/A","meanings":[{"part_of_speech":"proper noun","definition":"A surname, most notably associated with Abraham Flexner (1866–1959), an American educator known for his reforms of medical education in the United States and Canada.","english_definition":"A surname, most notably associated with Abraham Flexner (1866–1959), an American educator known for his reforms of medical education in the United States and Canada.","examples":[{"sentence":"The Flexner Report revolutionized medical education.","translation":"フレクスナー報告は医学教育に革命をもたらした。"},{"sentence":"Abraham Flexner's work had a lasting impact on higher education.","translation":"エイブラハム・フレクスナーの業績は高等教育に永続的な影響を与えた。"}],"collocations":["Flexner Report","Abraham Flexner","Flexnerian model"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Likely derived from a German occupational surname referring to someone who worked with flax (linen).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfleksnər/","syllables":"Flex-ner"},"inflection":{},"usage_notes":{"explanation":"The name 'Flexner' is primarily significant due to Abraham Flexner and his influential 'Flexner Report' (1910), which assessed and reformed medical education in North America. The report led to the closure of many substandard medical schools and the standardization of medical curricula.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["Flexnerian (adjective: relating to Abraham Flexner or his educational principles)"],"priority":"★★☆"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The name 'Flexner' is primarily encountered in contexts related to the history of medical education. Understanding its significance requires familiarity with Abraham Flexner and the impact of his report. The term 'Flexnerian' might be used in academic discussions about educational reform.","priority":"★★☆"},"example_sentences":[{"sentence":"The **Flexner** Report led to significant changes in medical school curricula.","translation":"フレクスナー報告は医学部のカリキュラムに大きな変化をもたらした。","type":"proper noun","meaning_category":"Surname"},{"sentence":"**Abraham Flexner** was a prominent figure in the history of education.","translation":"エイブラハム・フレクスナーは教育史における著名な人物であった。","type":"proper noun","meaning_category":"Surname"}]}