{"word":"pyromaniacs","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"放火魔、放火癖のある人（複数形）","english_definition":"plural form of pyromaniac: a person with pyromania; someone who has an obsessive desire to set fire to things.","examples":[{"sentence":"The police were searching for the pyromaniacs who had set the warehouse ablaze.","translation":"警察は倉庫に火をつけた放火魔たちを捜索していた。"},{"sentence":"A group of pyromaniacs were suspected of starting the series of fires in the forest.","translation":"その森林での連続放火事件は、放火魔グループによるものだと疑われた。"}],"collocations":["arrest pyromaniacs (放火魔を逮捕する)","catch pyromaniacs (放火魔を捕まえる)","a group of pyromaniacs (放火魔グループ)","suspect pyromaniacs (放火魔を疑う)"],"synonyms":["arsonists","firebugs","incendiaries"],"antonyms":[],"notes":"Pyromaniacs are driven by an uncontrollable impulse to start fires, often experiencing a sense of relief or gratification from doing so. This is a psychological disorder, distinct from arson committed for financial gain or other motives."}],"etymology":{"value":"'Pyromaniac' is derived from the Greek words 'pyr' (fire) and 'mania' (madness, obsession).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpaɪroʊˈmeɪniæks/","syllables":"py-ro-ma-ni-acs"},"inflection":{"noun_plural":"pyromaniacs","noun_singular":"pyromaniac"},"usage_notes":{"explanation":"'Pyromaniacs' is the plural form of 'pyromaniac,' referring to multiple individuals who suffer from pyromania. Pyromania is a rare impulse control disorder characterized by an obsession with fire. It's important to distinguish pyromania from arson, which is a deliberate act of setting fires for personal gain or other malicious purposes. Pyromaniacs are driven by an uncontrollable urge and often experience tension or excitement before setting a fire, followed by relief or pleasure afterward.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a pyromaniacs.","correct":"✓ He is a pyromaniac.","note":"When referring to a single person, use the singular form 'pyromaniac'."},{"incorrect":"✗ Pyromaniacs are just criminals who like fire.","correct":"✓ Pyromaniacs suffer from a psychological disorder that compels them to set fires.","note":"It's important to understand that pyromania is a mental disorder, not simply a criminal act."}],"priority":"★★☆"},"related_words":{"derivatives":["pyromania (名詞: 放火癖)","pyromaniac (形容詞: 放火癖の)"],"related_terms":["arson (名詞: 放火)","arsonist (名詞: 放火犯)","firebug (名詞: 放火魔)","incendiary (名詞: 放火犯)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'pyromaniacs' refers to people who have a mental disorder called pyromania, which makes them have a strong urge to start fires. This word is not used very often in everyday conversation, but it might appear in news reports or discussions about mental health or crime. It's important to remember that pyromania is a real psychological condition, and people who have it need help and understanding."},"example_sentences":[{"sentence":"The detectives suspected that a group of **pyromaniacs** were responsible for the string of suspicious fires.","translation":"刑事たちは、一連の不審火は放火魔グループの仕業だと疑った。","type":"noun","meaning_category":"放火魔（複数形）"},{"sentence":"The psychiatrist specialized in treating **pyromaniacs** and other individuals with impulse control disorders.","translation":"その精神科医は、放火魔や他の衝動制御障害を持つ人々の治療を専門としていた。","type":"noun","meaning_category":"放火魔（複数形）"},{"sentence":"The news reported that several **pyromaniacs** had been apprehended after a series of arson attacks.","translation":"報道によると、連続放火事件の後、数人の放火魔が逮捕された。","type":"noun","meaning_category":"放火魔（複数形）"}]}