{"word":"gracejar","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare) A container or vessel filled with grace, blessings, or divine favor; a source of spiritual nourishment and inspiration.","english_definition":"(rare) A container or vessel filled with grace, blessings, or divine favor; a source of spiritual nourishment and inspiration.","examples":[{"sentence":"She considered her grandmother a gracejar, always offering wisdom and comfort.","translation":"彼女は祖母を恵みの器だと考えており、いつも知恵と慰めを与えてくれた。"},{"sentence":"The church felt like a gracejar, overflowing with love and acceptance.","translation":"その教会は恵みの器のように感じられ、愛と受容に満ち溢れていた。"}],"collocations":["be a gracejar","filled with grace, a gracejar","draw from the gracejar"],"synonyms":["source of grace","vessel of blessing","fountain of inspiration"],"antonyms":[]}],"etymology":{"value":"A compound word formed by combining 'grace,' referring to divine favor or blessing, and 'jar,' a container. The term evokes the image of a vessel holding and dispensing grace.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡreɪsˌdʒɑːr/","syllables":"grace-jar"},"inflection":{"noun_plural":"gracejars"},"usage_notes":{"explanation":"The term 'gracejar' is not widely recognized and is considered rare. It is often used metaphorically to describe a person, place, or thing that embodies and shares grace, blessings, or spiritual nourishment. Its usage is primarily found in religious or spiritual contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to fill my grace jar with water.","correct":"✓ I need to fill my gracejar with inspiration through prayer.","note":"The term 'gracejar' is metaphorical and not meant to be taken literally as a physical jar. It refers to a source of spiritual grace, not a container for physical substances."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["grace","blessing","vessel","container","spiritual","divine"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (rare word)","frequency_google_ngram":"Very low frequency - likely a neologism or rare metaphorical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'gracejar' is a rare and metaphorical term. Understanding it requires familiarity with the concept of 'grace' in a religious or spiritual context, as well as the ability to interpret figurative language. Due to its rarity and abstract nature, it is best suited for advanced learners or those with a specific interest in religious vocabulary."},"example_sentences":[{"sentence":"Her life was a testament to being a gracejar for others, always offering support and encouragement.","translation":"彼女の人生は、他者にとって恵みの器となることの証であり、常に支援と励ましを提供していた。","type":"noun","meaning_category":"source of spiritual nourishment"},{"sentence":"The retreat center served as a gracejar, providing a space for reflection and renewal.","translation":"そのリトリートセンターは恵みの器として機能し、内省と再生のための空間を提供した。","type":"noun","meaning_category":"vessel of blessing"}]}