{"word":"korhmn","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A fictional or invented word; meaning is context-dependent or undefined.","english_definition":"A neologism or nonce word with no established meaning, intended for use in a specific context or lacking a defined meaning.","examples":[{"sentence":"The author used 'korhmn' to describe a feeling that couldn't be expressed with existing words.","translation":"作者は既存の言葉では表現できない感情を説明するために「korhmn」を使用した。"},{"sentence":"'Korhmn' might refer to a type of alien creature in the science fiction story.","translation":"「Korhmn」は、そのサイエンスフィクションの物語に登場する異星人の一種を指すのかもしれない。"}],"collocations":["invented word","fictional term","made-up word","neologism"],"synonyms":["neologism","nonce word","coined term","invented term"],"antonyms":[]}],"etymology":{"value":"Likely a constructed or arbitrary word, with no clear etymological roots.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈkɔːrmən/","syllables":"korhm-n"},"inflection":{"noun_plural":"korhmns"},"usage_notes":{"explanation":"'Korhmn' is not a standard English word. Its meaning would depend entirely on the context in which it is used. It is likely to be encountered in creative writing, such as science fiction or fantasy, or in contexts where a new word is needed to describe something unique.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I looked up 'korhmn' in the dictionary, but I couldn't find it.","correct":"✓ 'Korhmn' is not a real word, so you won't find it in the dictionary.","note":"Since 'korhmn' is likely a made-up word, it won't be in standard dictionaries."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["neology","lexicography","word formation"]},"level_frequency":{"CEFR":"N/A (not a standard word)","frequency_google_ngram":"Very low frequency (likely non-existent in standard corpora)","priority":"★☆☆"},"readability_explanation":{"level":"Advanced (due to the concept of neologisms)","text":"'Korhmn' is not a word you'll find in everyday use. If you encounter it, it's probably a made-up word. To understand it, you'll need to rely on the surrounding text for clues about what it might mean. Think of it as a placeholder for a concept the writer wants to convey but doesn't have a standard word for."},"example_sentences":[{"sentence":"The alien race communicated using a series of 'korhmn' sounds.","translation":"その異星人種は一連の「korhmn」という音を使ってコミュニケーションをとった。","type":"noun","meaning_category":"Fictional term"},{"sentence":"She described the feeling as a deep sense of 'korhmn,' a longing for something unknown.","translation":"彼女はその感情を、未知のものへの憧れである、深い「korhmn」の感覚だと表現した。","type":"noun","meaning_category":"Fictional term"}]}