{"word":"Underwarden","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A subordinate warden; an assistant to a warden.","english_definition":"A subordinate warden; an assistant to a warden.","examples":[{"sentence":"The underwarden was responsible for overseeing the daily operations of the prison.","translation":"副看守長は、刑務所の日常業務を監督する責任を負っていた。"},{"sentence":"The warden delegated tasks to the underwarden to ensure the smooth functioning of the institution.","translation":"看守長は施設の円滑な機能を確保するために、副看守長にタスクを委任した。"}],"collocations":["prison underwarden","assistant underwarden"],"synonyms":["assistant warden","deputy warden"],"antonyms":["warden"]}],"etymology":{"value":"The word is formed by combining \"under\" (meaning subordinate or lower in rank) with \"warden\" (meaning a person responsible for the supervision of a particular place or thing).","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌndərˈwɔːrdən/","syllables":"un-der-war-den"},"inflection":{"noun_plural":"Underwardens"},"usage_notes":{"explanation":"The term \"underwarden\" is typically used in institutional settings, such as prisons or schools, to denote an individual who assists the warden in their duties. The underwarden often handles administrative tasks, supervises staff, and ensures compliance with regulations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is the under warden of the park.","correct":"✓ He is the underwarden of the park.","note":"The correct spelling is 'underwarden,' not 'under warden.' It is a single word."}],"priority":"★★☆"},"related_words":{"derivatives":["warden","under-","undersecretary"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word 'underwarden' is a specialized term primarily used in institutional contexts, such as prisons, to refer to an assistant to the warden. It is not commonly used in everyday language, making it more suitable for advanced learners or those with specific professional interests."},"example_sentences":[{"sentence":"The new underwarden implemented several reforms to improve the prison's educational programs.","translation":"新しい副看守長は、刑務所の教育プログラムを改善するためにいくつかの改革を実施した。","type":"noun","meaning_category":"assistant to a warden"},{"sentence":"As underwarden, she was responsible for maintaining order and discipline among the inmates.","translation":"副看守長として、彼女は受刑者間の秩序と規律を維持する責任を負っていた。","type":"noun","meaning_category":"assistant to a warden"}]}