{"word":"Pyarthrosis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"化膿性関節炎","english_definition":"Infection of a joint, usually bacterial, leading to pus formation within the joint space.","examples":[{"sentence":"Pyarthrosis requires prompt diagnosis and treatment to prevent joint damage.","translation":"化膿性関節炎は、関節の損傷を防ぐために迅速な診断と治療が必要です。"},{"sentence":"Staphylococcus aureus is a common cause of pyarthrosis.","translation":"黄色ブドウ球菌は、化膿性関節炎の一般的な原因です。"}],"collocations":["septic arthritis","joint infection","bacterial arthritis"],"synonyms":["septic arthritis","suppurative arthritis"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'pyo-' (pus) + 'arthro-' (joint) + '-osis' (condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpaɪɑːrˈθroʊsɪs/","syllables":"py-ar-thro-sis"},"inflection":{"noun_plural":"pyarthroses"},"usage_notes":{"explanation":"Pyarthrosis is a serious condition requiring immediate medical attention. It typically presents with joint pain, swelling, redness, and limited range of motion. Fever and chills may also be present. Diagnosis is usually made by joint aspiration and analysis of the synovial fluid. Treatment involves antibiotics and drainage of the infected joint.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ pyarthrosis is a virus infection.","correct":"✓ pyarthrosis is a bacterial infection.","note":"Pyarthrosis is typically caused by bacteria, not viruses."},{"incorrect":"✗ pyarthrosis is treated with anti-inflammatory drugs alone.","correct":"✓ pyarthrosis is treated with antibiotics and joint drainage.","note":"While anti-inflammatory drugs may help with symptoms, antibiotics and drainage are essential for treating the infection."}],"priority":"★★☆"},"related_words":{"derivatives":["arthritis","sepsis","synovitis"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pyarthrosis' is a highly specialized medical term referring to a specific type of joint infection. Understanding requires a strong background in medical terminology and pathology. The term is rarely encountered outside of medical contexts."},"example_sentences":[{"sentence":"The patient presented with acute knee pain and was subsequently diagnosed with pyarthrosis.","translation":"患者は急性の膝の痛みを訴え、その後、化膿性関節炎と診断されました。","type":"medical","meaning_category":"joint infection"},{"sentence":"Early diagnosis and treatment of pyarthrosis are crucial to prevent long-term joint damage.","translation":"化膿性関節炎の早期診断と治療は、長期的な関節損傷を防ぐために非常に重要です。","type":"medical","meaning_category":"joint infection"}]}