{"word":"semiarborescent","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"半樹木状の、半樹木の","english_definition":"Resembling a tree in some characteristics, but not fully a tree; partially treelike.","examples":[{"sentence":"The plant had a semiarborescent growth habit, with a single trunk and branching crown.","translation":"その植物は半樹木状の生育習性を持ち、一本の幹と枝分かれした樹冠を持っていました。"},{"sentence":"Semi-arborescent shrubs are often used in landscaping to provide a tree-like appearance without the full size of a tree.","translation":"半樹木状の低木は、樹木の完全な大きさなしに樹木のような外観を提供するために、景観緑化でよく使用されます。"}],"collocations":["semiarborescent shrub (半樹木状の低木)","semiarborescent growth (半樹木状の成長)","semiarborescent habit (半樹木状の習性)"],"synonyms":["shrubby","treelike","arborescent","partially woody"],"antonyms":["herbaceous","non-woody"]}],"etymology":{"value":"Derived from the prefix 'semi-' (meaning half or partially) combined with 'arborescent' (meaning treelike).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɛmiˌɑːrbəˈrɛsənt/","syllables":"sem-i-ar-bo-res-cent"},"inflection":{"notes":"This word is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Semiarborescent' describes plants that have some, but not all, of the characteristics of a tree. These plants may have a single trunk, woody stems, and a defined crown, but they typically remain smaller than true trees. The term is often used in botany and horticulture to classify plant growth forms.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The semiarborescent plant was completely herbaceous.","correct":"✓ The semiarborescent plant had some woody parts, but was not fully a tree.","note":"Semiarborescent plants are partially woody, not completely herbaceous."}],"priority":"★★☆"},"related_words":{"derivatives":["arborescent (樹木状の)","semi- (接頭辞: 半-)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'semiarborescent' is a technical term used in botany and horticulture to describe plants that are partially treelike. It is formed by combining 'semi-' (meaning half) with 'arborescent' (meaning treelike). Understanding this word requires familiarity with botanical terminology and the concept of plant growth forms. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The botanist classified the species as semiarborescent due to its woody stem and limited height.","translation":"植物学者は、その種が木質の茎と限られた高さのため、半樹木状であると分類しました。","type":"descriptive","meaning_category":"classification"},{"sentence":"The semiarborescent nature of the shrub made it ideal for creating a natural screen in the garden.","translation":"その低木の半樹木状の性質は、庭に自然なスクリーンを作るのに理想的でした。","type":"descriptive","meaning_category":"application"}]}