{"word":"Koppa","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(historical) An archaic letter of the Greek alphabet, used as a numeral for 90.","english_definition":"An archaic letter of the Greek alphabet that was used to represent a sound similar to /k/ before certain vowels. It was later used as a numeral for 90.","examples":[{"sentence":"The letter Koppa is no longer used in the modern Greek alphabet.","translation":"文字Koppaは現代ギリシャ文字ではもう使われていません。"},{"sentence":"In ancient inscriptions, Koppa often appeared before the vowels omicron and upsilon.","translation":"古代の碑文では、Koppaはしばしば母音のオミクロンとウプシロンの前に現れました。"}],"collocations":["archaic letter","Greek alphabet","numeral value","ancient inscriptions"],"synonyms":["Qoppa","Ϙ","Ϟ"],"antonyms":[]}],"etymology":{"value":"From the Greek letter Ϙ (Koppa), derived from the Phoenician letter Qoph.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkɒpə/","syllables":"Kop-pa"},"inflection":{"notes":"It is a noun, so it has a plural form: Koppas."},"usage_notes":{"explanation":"Koppa is primarily of historical and linguistic interest. It's rarely encountered outside of discussions of ancient Greek or historical linguistics. It's important to distinguish it from the letter Q, which has a different origin and sound in most modern languages.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Koppa is a vowel in the Greek alphabet.","correct":"✓ Koppa was a consonant in the ancient Greek alphabet.","note":"Koppa was a consonant, not a vowel."},{"incorrect":"✗ Koppa is still used in modern Greek.","correct":"✓ Koppa is an archaic letter and is not used in modern Greek.","note":"Koppa is no longer part of the modern Greek alphabet."}],"priority":"★★☆"},"related_words":{"derivatives":["Qoph (related Phoenician letter)"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Koppa' refers to an archaic letter of the Greek alphabet. It is primarily used in historical or linguistic contexts when discussing the evolution of the Greek alphabet or ancient numbering systems. Understanding this term requires familiarity with ancient languages and historical linguistics.","priority":"★★☆"},"example_sentences":[{"sentence":"The numerical value of Koppa in the ancient Greek system was 90.","translation":"古代ギリシャのシステムにおけるKoppaの数値は90でした。","type":"noun","meaning_category":"historical letter"},{"sentence":"Linguists study the use of Koppa to understand the pronunciation of ancient Greek.","translation":"言語学者は、古代ギリシャ語の発音を理解するためにKoppaの使用を研究しています。","type":"noun","meaning_category":"historical letter"}]}