{"word":"particularist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"特定主義者、特殊主義者：普遍的な原則よりも特定の状況やグループの利益を重視する人。","english_definition":"One who adheres to particularism; one who emphasizes the importance of particular circumstances, groups, or interests over universal principles.","examples":[{"sentence":"He was criticized for being a particularist, favoring his own region over the nation as a whole.","translation":"彼は特定主義者であると批判され、国全体よりも自分の地域を優先した。"},{"sentence":"The debate centered on whether to adopt a universal approach or a particularist one, tailored to each community's needs.","translation":"議論は、普遍的なアプローチを採用するか、各コミュニティのニーズに合わせた特定主義的なアプローチを採用するかを中心に展開された。"}],"collocations":["particularist approach","particularist policies","particularist tendencies"],"synonyms":["localist","regionalist","sectarian","specialist"],"antonyms":["universalist","generalist","cosmopolitan"]},{"part_of_speech":"adjective","definition":"特定主義の、特殊主義の：普遍的な原則よりも特定の状況やグループの利益を重視する。","english_definition":"Adhering to particularism; emphasizing the importance of particular circumstances, groups, or interests over universal principles.","examples":[{"sentence":"The government's particularist policies led to inequalities among different regions.","translation":"政府の特定主義的な政策は、異なる地域間の不平等につながった。"},{"sentence":"A particularist perspective can sometimes hinder broader cooperation and understanding.","translation":"特定主義的な視点は、より広範な協力と理解を妨げることがある。"}],"collocations":["particularist viewpoint","particularist agenda","particularist interests"],"synonyms":["parochial","insular","provincial","exclusive"],"antonyms":["universal","general","inclusive"]}],"etymology":{"value":"'Particular'（特定の）+ '-ist'（主義者）から派生。特定のグループや状況を重視する考え方を指す。","priority":"☆☆☆"},"pronunciation":{"ipa":"/pərˈtɪkjələrɪst/","syllables":"par-tic-u-lar-ist"},"inflection":{"noun_plural":"particularists"},"usage_notes":{"explanation":"'Particularist' は、普遍的な原則や全体的な視点よりも、特定の状況、地域、グループの利益を優先する立場や人を指す言葉です。政治、経済、社会など、さまざまな分野で使用されます。対義語は 'universalist' で、普遍的な原則や価値観を重視する立場を指します。","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"He is a particularist about food.","correct":"He is particular about food.","note":"'Particularist' は主義や思想を指す場合に使い、単に好みがうるさいという意味では 'particular' を使う。"},{"incorrect":"The particularist view is always wrong.","correct":"The particularist view can be problematic.","note":"特定主義的な視点が常に間違っているとは限らず、状況によっては適切である場合もあるため、断定的な表現は避ける。"}],"priority":"☆☆☆"},"related_words":{"derivatives":["particularism","particularity","particularize"],"related_concepts":["communitarianism","localism","regionalism","identity politics"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word 'particularist' refers to someone who prioritizes specific details, circumstances, or groups over general principles or universal considerations. It is often used in political or philosophical contexts to describe a perspective that emphasizes the unique needs and interests of a particular community or region, sometimes at the expense of broader, more inclusive approaches. Understanding this term requires a grasp of abstract concepts and nuanced arguments related to identity, ethics, and governance."},"example_sentences":[{"sentence":"The politician's particularist rhetoric appealed to voters in his district, but alienated others.","translation":"その政治家の特定主義的なレトリックは、彼の選挙区の有権者にはアピールしたが、他の人々を遠ざけた。","type":"adjective"},{"sentence":"As a particularist, she believed that each case should be judged on its own merits, without applying broad rules.","translation":"特定主義者として、彼女は各事例は広範な規則を適用せずに、それ自体のメリットに基づいて判断されるべきだと信じていた。","type":"noun"}]}