{"word":"Chamkanni","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A Pashtun tribe primarily residing in the Kurram Agency of the Federally Administered Tribal Areas (FATA) in Pakistan, and also in parts of Afghanistan.","english_definition":"A Pashtun tribe primarily residing in the Kurram Agency of the Federally Administered Tribal Areas (FATA) in Pakistan, and also in parts of Afghanistan.","examples":[{"sentence":"The Chamkanni tribe has a rich history and culture.","translation":"チャムカンニ族は豊かな歴史と文化を持っています。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Chamkanni' is believed to be derived from a historical figure or a geographical location associated with the tribe.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌtʃæmkɑːˈniː/","syllables":"Cham-kan-ni"},"inflection":{},"usage_notes":{"explanation":"'Chamkanni' refers specifically to the name of a Pashtun tribe. It is used in historical, anthropological, and geographical contexts when discussing the tribal structure of the Pashtun people in the Pakistan-Afghanistan border region.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"related_tribes":["Afridi","Wazir","Mahsud","Orakzai"],"geographic_locations":["Kurram Agency","Federally Administered Tribal Areas (FATA)","Afghanistan"],"priority":"★☆☆"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"'Chamkanni' is a proper noun referring to a specific Pashtun tribe. Understanding its usage requires knowledge of the tribal structure and geography of the Pakistan-Afghanistan border region. It is typically encountered in specialized texts related to anthropology, history, or regional studies."},"example_sentences":[{"sentence":"The Chamkanni Pashtuns are known for their traditional customs.","translation":"チャムカンニ・パシュトゥーン人は、その伝統的な慣習で知られています。","type":"noun","meaning_category":"tribe"},{"sentence":"The Chamkanni region has seen significant historical events.","translation":"チャムカンニ地方は重要な歴史的出来事を経験してきました。","type":"noun","meaning_category":"region"}]}