{"word":"light-scattering","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"光散乱","english_definition":"The phenomenon in which light deviates from a straight trajectory due to localized non-uniformities in the medium through which it passes.","examples":[{"sentence":"Light-scattering is used in various applications, including atmospheric studies and material characterization.","translation":"光散乱は大気研究や材料特性評価など、さまざまな応用で使用されています。"},{"sentence":"The intensity of light-scattering depends on the wavelength of light and the size of the scattering particles.","translation":"光散乱の強度は、光の波長と散乱粒子のサイズに依存します。"}],"collocations":["dynamic light-scattering (動的光散乱)","static light-scattering (静的光散乱)","Mie scattering (ミー散乱)","Rayleigh scattering (レイリー散乱)"],"synonyms":["diffusion","dispersion","reflection","refraction"],"antonyms":["absorption","transmission"]},{"part_of_speech":"adjective","definition":"光散乱性の","english_definition":"Having the property of scattering light.","examples":[{"sentence":"The light-scattering properties of the material make it suitable for use in displays.","translation":"その材料の光散乱特性により、ディスプレイでの使用に適しています。"},{"sentence":"Light-scattering particles in the atmosphere cause the sky to appear blue.","translation":"大気中の光散乱粒子が空を青く見せます。"}],"collocations":["light-scattering material (光散乱材料)","light-scattering effect (光散乱効果)"],"synonyms":["diffusive","dispersive"],"antonyms":["transparent","transmissive"]}],"etymology":{"value":"The term is a compound of 'light' and 'scattering'. 'Light' refers to electromagnetic radiation within a certain portion of the electromagnetic spectrum. 'Scattering' refers to the process by which small particles or density fluctuations in a medium redirect energy from an incident wave into various directions.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlaɪtˌskætərɪŋ/","syllables":"light-scat-ter-ing"},"inflection":{"notes":"The term can function as both a noun and an adjective, so inflection is not applicable."},"usage_notes":{"explanation":"'Light-scattering' refers to the physical process where light is deflected from its original path due to interactions with matter. It is a phenomenon that is crucial in many areas of science and engineering, including optics, atmospheric science, and materials science. The term is often used to describe both the process itself (as a noun) and the properties of materials that exhibit this behavior (as an adjective).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Light scattering is when light absorb.","correct":"✓ Light scattering is when light is deflected.","note":"Light scattering involves the deflection or redirection of light, not absorption. Absorption is a different process where light energy is converted into other forms of energy."},{"incorrect":"✗ The material is light scatter.","correct":"✓ The material is light-scattering.","note":"When used as an adjective, 'light-scattering' should be hyphenated. 'Light scatter' is grammatically incorrect in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["scatter (verb)","scattering (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Light-scattering' is a technical term that describes how light changes direction when it hits small particles or uneven surfaces. This is why the sky is blue and why some materials look hazy. It's used in science and engineering to understand how light behaves in different situations.","priority":"★★☆"},"example_sentences":[{"sentence":"The experiment measured the intensity of light-scattering at different angles.","translation":"その実験では、さまざまな角度での光散乱の強度を測定しました。","type":"noun","meaning_category":"光散乱"},{"sentence":"The light-scattering coating on the lens reduces glare.","translation":"レンズの光散乱コーティングはグレアを軽減します。","type":"adjective","meaning_category":"光散乱性の"}]}