{"word":"Tuskers","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)牙の生えた動物、特に牙の大きなゾウ","english_definition":"(plural) animals with tusks, especially elephants with large tusks.","examples":[{"sentence":"Tuskers are often targeted by poachers for their ivory.","translation":"牙の大きなゾウは、象牙目的の密猟者によく狙われる。"},{"sentence":"The national park is home to several impressive tuskers.","translation":"その国立公園には、いくつかの印象的な牙の生えたゾウが生息している。"}],"collocations":["impressive tuskers (印象的な牙の生えたゾウ)","large tuskers (大きな牙の生えたゾウ)","rare tuskers (希少な牙の生えたゾウ)"],"synonyms":["elephants with tusks","ivory-bearing animals"],"antonyms":[]}],"etymology":{"value":"「tusk」に複数形を作る接尾辞「-ers」が付いたもの。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʌskərz/","syllables":"tus-kers"},"inflection":{"noun_plural":"Tuskers"},"usage_notes":{"explanation":"「**Tuskers**」は、特に大きな牙を持つゾウを指す言葉として使われます。密猟の対象となりやすい象牙を持つゾウを強調する際に用いられることがあります。一般的には複数形で使用されます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ A tusker is walking.","correct":"✓ A tusker is walking. / ✓ An elephant with large tusks is walking.","note":"'Tusker' is used to describe an elephant with large tusks. If you are talking about a single elephant, using 'an elephant with large tusks' is more common. 'Tusker' is more often used when discussing the species or a group of elephants with large tusks."}],"priority":"★☆☆"},"related_words":{"derivatives":["tusk (名詞: 牙)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Tuskers' refers specifically to animals, most commonly elephants, that have very large tusks. This term is often used in conservation contexts, especially when discussing the threats these animals face due to poaching for their ivory. It's a relatively specialized term, so it's not commonly used in everyday conversation, but it is useful to know when reading about wildlife or conservation efforts."},"example_sentences":[{"sentence":"Conservationists are working to protect the remaining tuskers in the region.","translation":"自然保護活動家たちは、その地域に残された牙の大きなゾウたちを保護するために活動している。","type":"noun","meaning_category":"牙の生えた動物"},{"sentence":"The poachers were after the tuskers for their valuable ivory.","translation":"密猟者たちは、価値のある象牙のために牙の大きなゾウを狙っていた。","type":"noun","meaning_category":"牙の生えた動物"}]}