{"word":"Emotionalising","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"感情的にする、感情を込める","english_definition":"To make something emotional; to express or imbue something with emotion.","examples":[{"sentence":"The director was accused of emotionalising the story to appeal to a wider audience.","translation":"監督は、より多くの観客にアピールするために、物語を感情的にしすぎていると非難された。"},{"sentence":"She was emotionalising her argument, making it harder to follow the logic.","translation":"彼女は議論を感情的にしており、論理を追うのが難しくなっていた。"},{"sentence":"The author's emotionalising of the character's plight made the story very moving.","translation":"作者がそのキャラクターの苦境を感情的に表現したことで、物語は非常に感動的なものになった。"}],"collocations":["emotionalising a story","emotionalising an argument","emotionalising a situation"],"synonyms":["sensationalizing","dramatizing","sentimentalizing"],"antonyms":["rationalizing","objectifying","depersonalizing"]}],"etymology":{"value":"Derived from the verb 'emotionalise' (or 'emotionalize' in American English), which comes from 'emotional' + '-ise' (or '-ize'). 'Emotional' comes from 'emotion' + '-al'. 'Emotion' comes from the French word 'émotion', which in turn comes from the Latin word 'emovere' (to move out, stir up).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈməʊʃənəlaɪzɪŋ/","syllables":"e-mo-tion-al-is-ing"},"inflection":{"verb_forms":{"present_simple":["emotionalise","emotionalises"],"past_simple":"emotionalised","past_participle":"emotionalised","present_participle":"emotionalising"}},"usage_notes":{"explanation":"'Emotionalising' is the present participle and gerund form of the verb 'emotionalise'. It refers to the act of making something more emotional, often in a way that is seen as excessive or manipulative. It can also refer to expressing something with strong emotion. The term often carries a negative connotation, suggesting that the emotion is being used to distort or manipulate a situation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She was emotionalising, so I left.","correct":"✓ She was being emotional, so I left.","note":"When referring to someone's state of being, use 'being emotional' rather than 'emotionalising'. 'Emotionalising' refers to the act of making something emotional, not the state of the person. "},{"incorrect":"✗ He is emotionalising the problem.","correct":"✓ He is emotionalizing the problem.","note":"Both 'emotionalising' and 'emotionalizing' are correct, but the latter is the preferred spelling in American English."}],"priority":"★★☆"},"related_words":{"derivatives":["emotionalise","emotionalize","emotional","emotion","emotionalism","emotionality"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Emotionalising' refers to the act of making something more emotional, often in a way that is considered excessive or manipulative. It's used to describe the process of adding or emphasizing emotion in a situation, argument, or story, sometimes to the point where it becomes exaggerated or distorts the facts. This term is often used critically, implying that the emotional content is being used to sway opinions or manipulate feelings rather than to provide a balanced perspective. It's a more advanced term, typically encountered in discussions about rhetoric, media, or interpersonal communication."},"example_sentences":[{"sentence":"The politician was accused of emotionalising the issue to gain public support.","translation":"政治家は、大衆の支持を得るために問題を感情的にしていると非難された。","type":"verb (present participle)","meaning_category":"感情的にする"},{"sentence":"Stop emotionalising the situation; let's look at the facts.","translation":"状況を感情的にするのはやめて、事実を見てみましょう。","type":"verb (gerund)","meaning_category":"感情的にする"},{"sentence":"By emotionalising his speech, he managed to sway the audience's opinion.","translation":"スピーチを感情的にすることで、彼は聴衆の意見を左右することに成功した。","type":"verb (present participle)","meaning_category":"感情を込める"}]}