{"word":"Disgaveling","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(transitive) To remove or cease the use of a gavel, typically signifying the end of a meeting or session.","english_definition":"To formally end a meeting or session, typically by removing or ceasing the use of a gavel.","examples":[{"sentence":"The chairman disgavelled the meeting after all items on the agenda had been discussed.","translation":"議長は、議題のすべての項目が議論された後、会議を終了した。"},{"sentence":"After a long and productive session, the president disgavelled the proceedings.","translation":"長くて生産的なセッションの後、議長は議事を終了した。"}],"collocations":["disgavel a meeting","disgavel a session","disgavel the proceedings"],"synonyms":["adjourn","conclude","close","terminate"],"antonyms":["convene","begin","start","open"]}],"etymology":{"value":"Derived from 'dis-' (a prefix indicating negation or removal) and 'gaveling' (the act of using a gavel to call a meeting to order or maintain order).","priority":"★★☆"},"pronunciation":{"ipa":"/dɪsˈɡævəlɪŋ/","syllables":"dis-gav-el-ing"},"inflection":{"verb_forms":{"present_simple":["disgavel","disgavels"],"past_simple":"disgavelled","past_participle":"disgavelled","present_participle":"disgaveling"}},"usage_notes":{"explanation":"'Disgaveling' is a relatively uncommon term specifically used in formal meeting or parliamentary procedure contexts. It refers to the action of formally ending a meeting, often by ceasing the use of the gavel.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He disgaveling the table.","correct":"✓ He disgavelled the meeting.","note":"'Disgavel' is used with meetings, sessions, or proceedings, not physical objects like tables."}],"priority":"★★☆"},"related_words":{"derivatives":["disgavelled (past participle, adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Disgaveling' is a specialized term primarily used in formal meeting settings, particularly where parliamentary procedure is followed. It signifies the act of formally ending a session, often through the cessation of gavel use. Due to its specific context and infrequent usage, it is considered advanced vocabulary."},"example_sentences":[{"sentence":"The speaker announced that he would be disgaveling the conference at 5 PM.","translation":"議長は、午後5時に会議を終了すると発表した。","type":"verb","meaning_category":"ending a meeting"},{"sentence":"After the final vote, the president formally disgavelled the legislative session.","translation":"最終投票の後、議長は正式に立法会期を終了した。","type":"verb","meaning_category":"ending a session"},{"sentence":"The act of disgaveling signaled the conclusion of the annual general meeting.","translation":"会議の終了は、年次総会の終了を示した。","type":"verb","meaning_category":"ending a meeting"}]}