{"word":"unpolymerised","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"重合されていない、未重合の","english_definition":"Not having undergone polymerization; not yet formed into a polymer.","examples":[{"sentence":"The unpolymerised resin was still in liquid form.","translation":"未重合の樹脂はまだ液体の状態だった。"},{"sentence":"The properties of the unpolymerised material are different from those of the polymer.","translation":"未重合の材料の特性は、重合体の特性とは異なる。"}],"collocations":["unpolymerised resin","unpolymerised material","unpolymerised monomer"],"synonyms":["non-polymerized","unreacted","monomeric"],"antonyms":["polymerised","reacted","polymeric"]}],"etymology":{"value":"prefix 'un-' (not) + 'polymerised' (having undergone polymerization).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈpɒlɪməraɪzd/","syllables":"un-pol-y-mer-ised"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. Comparative and superlative forms are not commonly used, but 'more unpolymerised' and 'most unpolymerised' are grammatically possible."},"usage_notes":{"explanation":"'Unpolymerised' describes a substance, usually a monomer or a mixture of monomers, that has not yet undergone the chemical process of polymerization. Polymerization is the process where small molecules (monomers) combine to form a larger molecule (polymer). The term is commonly used in chemistry, materials science, and related fields.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The material is unpolymerized, so it's strong.","correct":"✓ The material is unpolymerised, so it's weak.","note":"Unpolymerised materials are typically weaker than their polymerised counterparts because the polymer chains have not yet formed to provide strength and rigidity."},{"incorrect":"✗ Unpolymerised means the same as depolymerised.","correct":"✓ Unpolymerised means not having undergone polymerization, while depolymerised means having been broken down from a polymer.","note":"'Unpolymerised' refers to a state before polymerization, whereas 'depolymerised' refers to the reverse process of breaking down a polymer into monomers."}],"priority":"★★☆"},"related_words":{"derivatives":["unpolymerized (alternative spelling)","polymerise (verb)","polymerisation (noun)","polymer (noun)","monomer (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unpolymerised' is a technical term used in chemistry and materials science. It describes a substance that has not yet undergone polymerization, the process of forming a polymer from smaller molecules called monomers. Understanding this term requires knowledge of basic polymer chemistry. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The shelf life of the unpolymerised adhesive is relatively short.","translation":"未重合の接着剤の貯蔵寿命は比較的短い。","type":"general","meaning_category":"General Usage"},{"sentence":"The researcher analysed the properties of the unpolymerised monomers.","translation":"研究者は未重合のモノマーの特性を分析した。","type":"scientific","meaning_category":"Scientific Context"},{"sentence":"The viscosity of the unpolymerised liquid decreased with increasing temperature.","translation":"未重合の液体の粘度は、温度の上昇とともに低下した。","type":"technical","meaning_category":"Technical Context"}]}