{"word":"occipitofacial","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"後頭部と顔面に関係する、またはそれらに影響を与える","english_definition":"Relating to or affecting the occiput and the face.","examples":[{"sentence":"The occipitofacial diameter is measured in fetal ultrasounds.","translation":"後頭顔面径は胎児超音波検査で測定される。"},{"sentence":"Occipitofacial injuries can result from trauma to the head.","translation":"後頭顔面部の損傷は、頭部外傷から生じることがある。"}],"collocations":["occipitofacial diameter","occipitofacial injury","occipitofacial region"],"synonyms":["craniofacial","cephalofacial"],"antonyms":[]}],"etymology":{"value":"Derived from the combination of 'occipito-' (referring to the occiput, the back of the head) and 'facial' (referring to the face).","priority":"★★★"},"pronunciation":{"ipa":"/ɒkˌsɪpɪtoʊˈfeɪʃəl/","syllables":"oc-cip-i-to-fa-cial"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than for comparative/superlative forms, which are rare for longer words like this."},"usage_notes":{"explanation":"This term is primarily used in medical and anatomical contexts to describe structures, conditions, or measurements involving both the occiput (back of the head) and the face. It is a relatively uncommon term in general conversation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor examined her occipital area.","correct":"✓ The doctor examined her occipitofacial area.","note":"Use 'occipitofacial' when referring to both the occiput and face, rather than just the occiput."}],"priority":"★★☆"},"related_words":{"derivatives":["occiput","face","facial"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'occipitofacial' is a specialized medical term used to describe something that relates to both the occiput (back of the head) and the face. Due to its specific and technical nature, it is not commonly used outside of medical or anatomical contexts. Understanding its meaning requires knowledge of anatomical terminology."},"example_sentences":[{"sentence":"The occipitofacial angle was used to assess the severity of the skull fracture.","translation":"後頭顔面角は、頭蓋骨骨折の重症度を評価するために使用された。","type":"adjective","meaning_category":"Anatomical measurement"},{"sentence":"Reconstructive surgery was performed to address the occipitofacial deformities.","translation":"後頭顔面部の変形を修正するために再建手術が行われた。","type":"adjective","meaning_category":"Medical condition"}]}