{"word":"Barbellula","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A genus of aquatic flies in the family Psychodidae (moth flies).","english_definition":"A genus of aquatic flies belonging to the family Psychodidae, characterized by their small size, hairy bodies, and preference for flowing water habitats.","examples":[{"sentence":"Species of Barbellula are often found in streams and rivers.","translation":"Barbellula属の種は、しばしば小川や川で見られる。"}],"collocations":["Barbellula species","Barbellula larvae","aquatic Barbellula"],"synonyms":["moth fly (general term)","psychodid fly"],"antonyms":[]}],"etymology":{"value":"The name 'Barbellula' is derived from the Latin word 'barbella,' meaning 'small beard' or 'barbel,' referring to the hairy appendages or structures found on these flies. The diminutive suffix '-ula' indicates 'small' or 'little'.","priority":"★★☆"},"pronunciation":{"ipa":"/bɑːrˌbɛljʊlə/","syllables":"Bar-bel-lu-la"},"inflection":{"noun_plural":"Barbellulae"},"usage_notes":{"explanation":"Barbellula is a specific genus within the broader group of moth flies (Psychodidae). These flies are typically small and hairy, and their larvae are aquatic, often found in flowing water habitats. They are not commonly encountered by the general public and are of more interest to entomologists and aquatic biologists.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Barbellula is a type of butterfly.","correct":"✓ Barbellula is a type of fly.","note":"Barbellula are flies, not butterflies."},{"incorrect":"✗ Barbellula are found in deserts.","correct":"✓ Barbellula are found in aquatic environments.","note":"Barbellula are aquatic and are found in water, not deserts."}],"priority":"★★☆"},"related_words":{"derivatives":["Psychodidae (family)","moth fly"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (scientific term)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な学術用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Barbellula' is a scientific term referring to a specific genus of aquatic flies within the family Psychodidae (moth flies). Understanding this term requires a background in entomology or aquatic biology. It is not commonly used in general conversation. The key characteristics of Barbellula flies include their small size, hairy bodies, and aquatic larvae, which are typically found in flowing water habitats such as streams and rivers."},"example_sentences":[{"sentence":"The larvae of Barbellula species play a role in the decomposition of organic matter in streams.","translation":"Barbellula属の幼虫は、小川の有機物の分解において役割を果たす。","type":"noun","meaning_category":"aquatic fly"},{"sentence":"Entomologists study Barbellula to understand their ecological impact on freshwater ecosystems.","translation":"昆虫学者は、淡水生態系に対するBarbellulaの生態学的影響を理解するために研究している。","type":"noun","meaning_category":"aquatic fly"}]}