{"word":"parivincular","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(数学、特に群論において)与えられた群のすべての部分群を含む","english_definition":"(mathematics, especially in group theory) Containing all subgroups of a given group.","examples":[{"sentence":"The parivincular subgroup is essential for understanding the structure of the group.","translation":"傍群部分群は、群の構造を理解するために不可欠である。"}],"collocations":["parivincular subgroup","parivincular lattice"],"synonyms":["comprehensive","inclusive"],"antonyms":["exclusive","restricted"]}],"etymology":{"value":"Derived from 'pari-' (equal) and 'vincular' (related to a vinculum, a binding element), suggesting a structure that equally binds or includes all subgroups.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌpærɪˈvɪŋkjʊlər/","syllables":"pa-ri-vin-cu-lar"},"inflection":{"notes":"Adjective, no standard inflections beyond comparative/superlative (more parivincular, most parivincular), though these are rarely used."},"usage_notes":{"explanation":"'Parivincular' is a highly specialized term primarily used in advanced group theory. It describes a subgroup or lattice that encompasses all subgroups of a particular group. Due to its technical nature, it is rarely encountered outside of mathematical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The parivincular element was used in everyday conversation.","correct":"✓ The term 'parivincular' is rarely used outside of mathematical contexts.","note":"This term is highly specific to mathematics and should not be used in general conversation."}],"priority":"★☆☆"},"related_words":{"derivatives":["vinculum","subgroup","lattice"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Extremely low frequency - a highly specialized term.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'parivincular' is a highly specialized mathematical term. Understanding requires advanced knowledge of group theory and lattice theory. It is unlikely to be encountered outside of academic mathematical discussions. The word describes a structure that includes all subgroups of a given group, reflecting a comprehensive or binding property. "},"example_sentences":[{"sentence":"The investigation of the parivincular lattice provides insights into the group's internal structure.","translation":"傍群束の調査は、群の内部構造への洞察を提供する。","type":"technical","meaning_category":"mathematics"}]}