{"word":"Orchestic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Relating to dancing; dance-like; expressive of dance.","english_definition":"Relating to or characteristic of dancing, especially in its rhythmic and expressive qualities.","examples":[{"sentence":"The orchestic movements of the ballet dancers were mesmerizing.","translation":"バレエダンサーの舞踊的な動きは、人々を魅了した。"},{"sentence":"The ancient Greeks valued orchestic expression as a form of art.","translation":"古代ギリシャ人は、舞踊的な表現を芸術の一形態として尊重した。"},{"sentence":"Her orchestic performance conveyed a deep sense of emotion.","translation":"彼女の舞踊的なパフォーマンスは、深い感情を伝えた。"}],"collocations":["orchestic art","orchestic expression","orchestic movement","orchestic performance","orchestic skill"],"synonyms":["choreographic","dance-related","rhythmic","expressive","kinetic","gestural"],"antonyms":["static","motionless","inert","unexpressive"]}],"etymology":{"value":"Derived from the Greek word 'orchestikos,' meaning 'relating to dancing,' which in turn comes from 'orcheisthai,' meaning 'to dance.'","priority":"★★☆"},"pronunciation":{"ipa":"/ɔːrˈkɛstɪk/","syllables":"or-ches-tic"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more orchestic' and 'most orchestic,' respectively."},"usage_notes":{"explanation":"'Orchestic' is a somewhat rare and formal term used to describe something related to or characteristic of dancing. It emphasizes the rhythmic and expressive qualities of dance. It is often used in academic or artistic contexts when discussing dance as a form of art or expression. It is not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The orchestic music accompanied the dance.","correct":"✓ The dance was orchestic. / ✓ The music accompanied the dance.","note":"'Orchestic' describes the dance itself, not the music. Use it to describe the qualities of the dance, not something that goes with it."},{"incorrect":"✗ He had an orchestic personality.","correct":"✓ He had a dynamic personality.","note":"'Orchestic' refers specifically to dance. For describing a lively personality, use words like 'dynamic,' 'energetic,' or 'vibrant.'"}],"priority":"★☆☆"},"related_words":{"derivatives":["orchestration (related to arranging music, but shares the 'orche-' root related to performance space)","orchestra (historically related to the dancing area in front of a stage)"],"phrases":["orchestic dance","orchestic arts"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (Very rare and specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Orchestic' is a specialized and uncommon word used to describe something related to dancing, particularly its rhythmic and expressive qualities. It is more likely to be encountered in academic or artistic discussions about dance rather than in everyday conversation. Understanding its etymology (from the Greek word for 'dancing') can help in remembering its meaning. It's important to note that it describes the dance itself, not just things associated with dance, like music or costumes."},"example_sentences":[{"sentence":"The choreographer aimed to create an orchestic experience that would deeply move the audience.","translation":"その振付師は、観客を深く感動させるような舞踊的な体験を作り出すことを目指した。","type":"general","meaning_category":"dance-related"},{"sentence":"Her orchestic interpretation of the music was both innovative and deeply respectful of the original composition.","translation":"彼女の音楽の舞踊的な解釈は、革新的であると同時に、原曲への深い敬意も感じられた。","type":"artistic","meaning_category":"dance-related"},{"sentence":"The professor lectured on the history of orchestic traditions in various cultures.","translation":"教授は、様々な文化における舞踊的な伝統の歴史について講義した。","type":"academic","meaning_category":"dance-related"}]}