{"word":"expectorator","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"喀痰器、痰壺","english_definition":"A vessel for receiving sputum; a spittoon.","examples":[{"sentence":"The expectorator was placed beside the patient's bed.","translation":"喀痰器は患者のベッドの横に置かれた。"},{"sentence":"In the old days, expectorators were common in public places.","translation":"昔は、喀痰器が公共の場所に置かれているのが一般的だった。"}],"collocations":["use an expectorator (喀痰器を使う)","clean an expectorator (喀痰器を掃除する)"],"synonyms":["spittoon","cuspidor"],"antonyms":[]}],"etymology":{"value":"From Latin ex- 'out' + pectus, pector- 'breast'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪkˈspektəˌreɪtər/","syllables":"ex-pec-to-ra-tor"},"inflection":{"noun_plural":"expectorators"},"usage_notes":{"explanation":"An expectorator is a specialized container, primarily used historically, to collect sputum (saliva and mucus) that is coughed up. While less common today due to hygiene concerns and the availability of disposable tissues, expectorators were once prevalent in hospitals, sanatoriums, and public spaces to prevent the spread of diseases like tuberculosis. The term is somewhat archaic now.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a cup as an expectorator.","correct":"✓ He used a cup as a spittoon.","note":"'Spittoon' is a more common and widely understood term for a receptacle for spit."}],"priority":"★☆☆"},"related_words":{"derivatives":["expectorate (verb: to cough up and spit out sputum)","expectoration (noun: the act of coughing up and spitting out sputum)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'expectorator' refers to a container, often called a spittoon, used for spitting into. This word is not commonly used in modern English and is associated with historical contexts, particularly in hospitals or public places where people needed to dispose of sputum. The verb form, 'expectorate,' meaning to cough up and spit out, is also relatively uncommon. Understanding this term requires a good grasp of medical and historical vocabulary."},"example_sentences":[{"sentence":"The antique museum displayed a collection of ornate expectorators from the Victorian era.","translation":"そのアンティーク博物館には、ビクトリア時代の華麗な喀痰器のコレクションが展示されていた。","type":"noun","meaning_category":"痰壺"},{"sentence":"During the tuberculosis epidemic, expectorators were essential tools in hospitals.","translation":"結核の流行中、喀痰器は病院で不可欠な道具だった。","type":"noun","meaning_category":"痰壺"}]}