{"word":"Jericho","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"エリコ (ヨルダン川西岸地区にある都市。世界最古の都市の一つとされる)","english_definition":"A city in the Palestinian Territories, located near the Jordan River in the West Bank. It is considered one of the oldest continuously inhabited cities in the world.","examples":[{"sentence":"Jericho is known for its historical significance and fertile land.","translation":"エリコは、その歴史的な重要性と肥沃な土地で知られています。"},{"sentence":"Tourists visit Jericho to see the ancient ruins and experience the local culture.","translation":"観光客は、古代遺跡を見学し、地元の文化を体験するためにエリコを訪れます。"}],"collocations":["City of Jericho","Ancient Jericho","Jericho walls"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(比喩的に) 遠隔地、僻地","english_definition":"(Figurative) A remote or isolated place.","examples":[{"sentence":"He felt like he was sent to Jericho when he was transferred to that small, isolated office.","translation":"彼はその小さくて孤立したオフィスに転勤になったとき、僻地に送られたように感じた。"}],"collocations":["go to Jericho","sent to Jericho"],"synonyms":["backwater","boondocks","middle of nowhere"],"antonyms":[]}],"etymology":{"value":"From Hebrew יְרִיחוֹ (yərīḥō), of uncertain origin. Possibly from יָרֵחַ (yārēaḥ, “moon”) or from רֵיחַ (rēaḥ, “fragrance”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒɛrɪkoʊ/","syllables":"Jer-i-cho"},"inflection":{},"usage_notes":{"explanation":"Jericho is primarily known as a city with immense historical importance. The figurative use of Jericho refers to a place that is far away and isolated, often implying a sense of being banished or exiled.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★★☆"},"related_words":{"derivatives":[],"phrases":[]},"level_frequency":{},"readability_explanation":{"level":"B2","text":"The word Jericho is most commonly used to refer to the city of Jericho, which is significant in history and religion. The figurative sense of the word is less common and implies a remote or isolated place, often with negative connotations. Understanding the context is essential to interpreting the intended meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The walls of Jericho are famous from the biblical story.","translation":"エリコの壁は、聖書の物語で有名です。","type":"noun","meaning_category":"City"},{"sentence":"After the argument, he felt like he was sent to Jericho, completely isolated from his friends.","translation":"口論の後、彼はまるでエリコに送られたかのように感じ、友人から完全に孤立した。","type":"noun","meaning_category":"Remote place"}]}