{"word":"Rosaceae","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"バラ科","english_definition":"The rose family of flowering plants, characterized by having flowers with five petals and numerous stamens, and including many economically important fruits, nuts, and ornamentals.","examples":[{"sentence":"Apples, pears, cherries, and strawberries all belong to the Rosaceae family.","translation":"リンゴ、ナシ、サクランボ、イチゴはすべてバラ科に属する。"},{"sentence":"Many ornamental plants, such as roses and spirea, are also members of the Rosaceae.","translation":"バラやシモツケなどの多くの観賞植物もバラ科の一員である。"}],"collocations":["Rosaceae family","members of Rosaceae","economically important Rosaceae"],"synonyms":["rose family"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin 'rosa' (rose) + '-aceae' (a standard suffix used to form the names of plant families).","priority":"★★★"},"pronunciation":{"ipa":"/roʊˈzeɪʃiˌi/","syllables":"Ro-sa-ce-ae"},"inflection":{"noun_plural":"Rosaceaes or Rosaceae (often used as a collective noun)"},"usage_notes":{"explanation":"'Rosaceae' refers specifically to the scientific family of plants that includes roses and many common fruits. It is typically used in botanical or agricultural contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Rosaceae is a beautiful flower.","correct":"✓ The Rosaceae is a beautiful family of plants. / ✓ Roses are beautiful flowers.","note":"'Rosaceae' refers to the entire plant family, not a single flower. To talk about a specific flower, use the name of the plant (e.g., rose, cherry blossom)."},{"incorrect":"✗ Rosaceaes are easy to grow.","correct":"✓ Rosaceae are easy to grow.","note":"'Rosaceae' is often used as a collective noun and does not always require a plural form. If a plural is desired, 'Rosaceaes' is acceptable but less common."}],"priority":"★★☆"},"related_words":{"derivatives":["rosaceous (adjective: relating to or belonging to the Rosaceae family)"],"phrases":["subfamilies of Rosaceae (e.g., Rosoideae, Spiraeoideae, Amygdaloideae)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency (scientific/technical context)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Rosaceae' is a technical term used in botany and agriculture to refer to the rose family of plants. This family includes a wide variety of plants, many of which are economically important for their fruits (like apples, pears, and cherries) and nuts (like almonds). The term is primarily encountered in scientific literature or specialized discussions about plants. Understanding the term helps in recognizing the relationships between different types of plants and their characteristics within this family."},"example_sentences":[{"sentence":"The genus *Prunus*, which includes cherries and plums, is part of the **Rosaceae** family.","translation":"サクランボやスモモを含む *Prunus* 属は、バラ科の一部である。","type":"general"},{"sentence":"Many members of the **Rosaceae** are susceptible to fire blight, a bacterial disease.","translation":"バラ科の多くの種は、細菌性の病気である火傷病にかかりやすい。","type":"general"},{"sentence":"Researchers are studying the genetic diversity within the **Rosaceae** to improve fruit breeding.","translation":"研究者たちは、果物の育種を改善するために、バラ科内の遺伝的多様性を研究している。","type":"scientific"}]}