{"word":"board-and-shingle","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(建築) 羽目板とこけら板張り、羽目板とシングル張り","english_definition":"A type of wall cladding consisting of a combination of vertical boards and shingles, typically used on the exterior of buildings.","examples":[{"sentence":"The house was built with board-and-shingle siding, giving it a rustic appearance.","translation":"その家は羽目板とシングル張りの外壁で建てられ、素朴な外観を呈していた。"}],"collocations":["board-and-shingle siding","board-and-shingle cladding","board-and-shingle construction"],"synonyms":["board-and-batten","clapboard","weatherboard","shingle siding"],"antonyms":[]},{"part_of_speech":"adjective","definition":"羽目板とこけら板張りの、羽目板とシングル張りの","english_definition":"Describing a building or structure clad with a combination of vertical boards and shingles.","examples":[{"sentence":"The board-and-shingle style was popular in coastal areas.","translation":"羽目板とシングル張りのスタイルは沿岸地域で人気があった。"}],"collocations":["board-and-shingle house","board-and-shingle facade","board-and-shingle design"],"synonyms":["board-and-batten","clapboard","weatherboard","shingled"],"antonyms":[]}],"etymology":{"value":"Combination of 'board' (referring to the vertical boards) and 'shingle' (referring to the overlapping shingles).","priority":"★★★"},"pronunciation":{"ipa":"/ˌbɔːrd ænd ˈʃɪŋɡəl/","syllables":"board-and-shin-gle"},"inflection":{"noun_plural":"board-and-shingles"},"usage_notes":{"explanation":"'Board-and-shingle' refers to a specific type of exterior wall covering that combines vertical boards with shingles. The boards are typically wider and provide a base, while the shingles are smaller and overlap to provide weather protection and visual texture. This style is often found in older homes and coastal architecture.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The house was made of board and shingles.","correct":"✓ The house was clad in board-and-shingle siding.","note":"'Board-and-shingle' is a specific term for the combination, not just any use of boards and shingles."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["board-and-batten","shingle style architecture","clapboard","siding"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Board-and-shingle' is a specialized architectural term. Understanding requires familiarity with construction terminology. It refers to a specific type of wall cladding that combines vertical boards and shingles. Due to its specialized nature, it is not commonly encountered outside of discussions about architecture or construction."},"example_sentences":[{"sentence":"The board-and-shingle exterior gave the cottage a charming, rustic look.","translation":"羽目板とシングル張りの外観は、そのコテージに魅力的で素朴な外観を与えた。","type":"noun","meaning_category":"建築"},{"sentence":"Many historic homes in the area feature board-and-shingle construction.","translation":"この地域の多くの歴史的な家屋は、羽目板とシングル張りの構造を特徴としている。","type":"adjective","meaning_category":"建築"}]}