{"word":"Myocarditis","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"心筋炎","english_definition":"Inflammation of the heart muscle (myocardium).","examples":[{"sentence":"Myocarditis can be caused by viral infections.","translation":"心筋炎はウイルス感染によって引き起こされることがあります。"},{"sentence":"Symptoms of myocarditis may include chest pain and shortness of breath.","translation":"心筋炎の症状には、胸痛や息切れなどがあります。"},{"sentence":"In severe cases, myocarditis can lead to heart failure.","translation":"重症の場合、心筋炎は心不全につながる可能性があります。"}],"collocations":["viral myocarditis (ウイルス性心筋炎)","acute myocarditis (急性心筋炎)","chronic myocarditis (慢性心筋炎)","fulminant myocarditis (劇症型心筋炎)","myocarditis diagnosis (心筋炎の診断)","myocarditis treatment (心筋炎の治療)","myocarditis symptoms (心筋炎の症状)"],"synonyms":["cardiac inflammation","inflammatory cardiomyopathy"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'myo' (muscle), 'card' (heart), and '-itis' (inflammation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmaɪ.oʊ.kɑrˈdaɪ.tɪs/","syllables":"my-o-car-di-tis"},"inflection":{"noun_plural":"myocarditides (less common)"},"usage_notes":{"explanation":"Myocarditis refers specifically to inflammation of the heart muscle. It can be caused by various factors, including infections, autoimmune diseases, and certain medications. Diagnosis often involves blood tests, ECG, and sometimes a heart biopsy. Treatment focuses on managing symptoms and addressing the underlying cause.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Myocarditis is a disease of the brain.","correct":"✓ Myocarditis is a disease of the heart.","note":"Myocarditis affects the heart muscle, not the brain."},{"incorrect":"✗ Myocarditis is always fatal.","correct":"✓ Myocarditis can be serious, but it is not always fatal.","note":"The severity of myocarditis varies, and many people recover fully."}],"priority":"★★☆"},"related_words":{"derivatives":["myocardial (adjective: relating to the heart muscle)","cardiomyopathy (noun: disease of the heart muscle)","pericarditis (noun: inflammation of the sac surrounding the heart)"],"medical_terms":["endocarditis (noun: inflammation of the inner lining of the heart)","arrhythmia (noun: irregular heartbeat)","heart failure (noun: condition in which the heart cannot pump enough blood)"],"priority":"★★☆"},"level_frequency":{"level":"C2","frequency_google_ngram":"Relatively low frequency, primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Myocarditis' is a medical term referring to inflammation of the heart muscle. It's important to understand that this condition can have various causes, ranging from viral infections to autoimmune reactions. Symptoms can vary widely, and diagnosis often requires specific medical tests. While the term itself is complex, understanding its meaning is crucial for discussions related to heart health and certain medical conditions."},"example_sentences":[{"sentence":"The patient was diagnosed with acute myocarditis after experiencing chest pain and fatigue.","translation":"患者は、胸痛と倦怠感を訴えた後、急性心筋炎と診断されました。","type":"medical condition","meaning_category":"心筋炎"},{"sentence":"Viral infections are a common cause of myocarditis, especially in young adults.","translation":"ウイルス感染は、特に若い成人の心筋炎の一般的な原因です。","type":"cause","meaning_category":"心筋炎の原因"},{"sentence":"Treatment for myocarditis typically involves rest and medications to reduce inflammation.","translation":"心筋炎の治療には、通常、安静と炎症を抑えるための薬物療法が含まれます。","type":"treatment","meaning_category":"心筋炎の治療"}]}