{"word":"Govinda","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A name of Krishna, a major deity in Hinduism.","english_definition":"A name of Krishna, often translated as 'one who gives pleasure to the cows, the land, and the senses'. It is derived from the Sanskrit words 'go' (cow, land, senses) and 'vinda' (one who gives pleasure).","examples":[{"sentence":"Devotees chant the name Govinda during prayers.","translation":"信者は祈りの際にゴーヴィンダという名前を唱えます。"},{"sentence":"The temple is dedicated to Lord Govinda.","translation":"その寺院はゴーヴィンダ神に捧げられています。"}],"collocations":["Lord Govinda","Chant Govinda","Govinda's blessings"],"synonyms":["Krishna","Mukunda","Madhava"],"antonyms":[]}],"etymology":{"value":"From Sanskrit 'Govinda' (गोविन्द), a name of Krishna. Derived from 'go' (cow, earth, senses) and 'vinda' (finder, one who obtains or gives pleasure).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡoʊvɪndə/","syllables":"Go-vin-da"},"inflection":{"notes":"Proper noun, does not have plural form."},"usage_notes":{"explanation":"'Govinda' is a significant name for Krishna, embodying his role as a protector and source of joy. It's frequently used in devotional contexts, such as chants, prayers, and hymns. The name highlights Krishna's connection to nature, particularly cows and the land, as well as his ability to captivate the senses.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Govinda is a god in Buddhism.","correct":"✓ Govinda is a name of Krishna, a god in Hinduism.","note":"Govinda is a name specifically associated with Krishna in Hinduism, not Buddhism."}],"priority":"★★☆"},"related_words":{"derivatives":["Govind (variant spelling)"],"phrases":["Jai Govinda (Victory to Govinda)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily used in religious or cultural contexts related to Hinduism.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Govinda' is a culturally specific term primarily used within the context of Hinduism. Understanding its significance requires familiarity with Hindu deities and devotional practices. The name represents a specific aspect of Krishna's character and role, making it relevant in religious and cultural discussions related to Hinduism."},"example_sentences":[{"sentence":"The bhajan (devotional song) praised the glories of Lord Govinda.","translation":"そのバジャン（献身的な歌）はゴーヴィンダ神の栄光を称賛していました。","type":"noun","meaning_category":"Name of Krishna"},{"sentence":"Many pilgrims visit Vrindavan to honor Govinda.","translation":"多くの巡礼者がゴーヴィンダを敬うためにヴリンダーヴァンを訪れます。","type":"noun","meaning_category":"Name of Krishna"}]}