{"word":"outpreen","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人)より着飾る、(人)よりおしゃれをする、(人)より美しく見せる","english_definition":"To surpass someone in grooming or finery; to be more elaborately or elegantly dressed than someone else.","examples":[{"sentence":"She tried to outpreen her rival at the party.","translation":"彼女はパーティーでライバルより着飾ろうとした。"},{"sentence":"No one can outpreen him; he always looks impeccable.","translation":"彼よりおしゃれな人はいない。彼はいつも完璧に見える。"}],"collocations":["outpreen someone at a party","outpreen a rival","outpreen the competition"],"synonyms":["outshine","surpass in elegance","exceed in finery","outdress","outdo"],"antonyms":["underdress","be less elegant","be less well-groomed"]}],"etymology":{"value":"The word 'outpreen' is formed by combining the prefix 'out-' (meaning to surpass or exceed) with the verb 'preen' (meaning to groom oneself carefully or to display oneself ostentatiously).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌaʊtˈpriːn/","syllables":"out-preen"},"inflection":{"verb_forms":{"present_simple":["outpreen","outpreens"],"past_simple":"outpreened","past_participle":"outpreened","present_participle":"outpreening"}},"usage_notes":{"explanation":"'Outpreen' is a relatively rare word, often used in a humorous or competitive context. It implies a deliberate effort to appear more attractive or well-groomed than someone else, often with a focus on clothing and personal appearance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She outpreened at the party.","correct":"✓ She outpreened her rival at the party.","note":"'Outpreen' is a transitive verb and typically requires a direct object (the person being surpassed)."},{"incorrect":"✗ He is outpreened.","correct":"✓ He was outpreened by her.","note":"When using the passive voice, ensure the subject is the one being surpassed."}],"priority":"★☆☆"},"related_words":{"derivatives":["preen (verb, noun)","preening (adjective, noun)"],"related_concepts":["grooming","finery","elegance","fashion","style"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in CEFR vocabulary lists)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Outpreen' is a sophisticated and rare word, meaning to surpass someone in grooming or finery. It's often used in contexts where there is a deliberate effort to appear more attractive or elegant than others. The word combines 'out-' (to exceed) with 'preen' (to groom oneself carefully). Understanding this word requires a strong grasp of vocabulary and an appreciation for nuanced language. It is not commonly used in everyday conversation and is more likely to be encountered in literature or formal writing."},"example_sentences":[{"sentence":"The peacock seemed to outpreen all the other birds in the aviary with its vibrant plumage.","translation":"そのクジャクは、鮮やかな羽で鳥小屋の他のすべての鳥よりも着飾っているように見えた。","type":"verb","meaning_category":"着飾る"},{"sentence":"The socialites competed to outpreen each other at the charity gala.","translation":"社交界の人々は、慈善ガラで互いに着飾ることを競い合った。","type":"verb","meaning_category":"おしゃれをする"},{"sentence":"She always managed to outpreen her colleagues, even on casual Fridays.","translation":"彼女はカジュアルフライデーでも、いつも同僚よりも美しく見せることに成功していた。","type":"verb","meaning_category":"美しく見せる"}]}