{"word":"nonrabbinical","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ラビ（ユダヤ教の教師・指導者）の、またはラビに関するものではない","english_definition":"Not of or relating to rabbis or rabbinical Judaism.","examples":[{"sentence":"The text includes both rabbinical and nonrabbinical sources.","translation":"そのテキストには、ラビ文献と非ラビ文献の両方が含まれています。"},{"sentence":"He had a nonrabbinical upbringing.","translation":"彼はラビ的でない環境で育った。"}],"collocations":["nonrabbinical sources","nonrabbinical literature","nonrabbinical education"],"synonyms":["secular","lay","non-clerical"],"antonyms":["rabbinical","clerical"],"notes":"Often used in the context of Jewish studies or history to distinguish between sources or traditions associated with rabbinic authority and those that are not."}],"etymology":{"value":"Formed from the prefix 'non-' (not) and the adjective 'rabbinical' (of or relating to rabbis).","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn.rəˈbɪn.ɪ.kəl/","syllables":"non-rab-bin-i-cal"},"inflection":{"notes":"Adjective; comparative and superlative forms are generally formed using 'more' and 'most' (e.g., more nonrabbinical, most nonrabbinical)."},"usage_notes":{"explanation":"'Nonrabbinical' is used to describe something that is not associated with or derived from rabbinic Judaism. This could refer to texts, traditions, or individuals. It is often used in academic or historical contexts to differentiate between different aspects of Jewish culture and history.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonrabbinical law.","correct":"✓ Nonrabbinical sources/traditions.","note":"'Nonrabbinical' typically modifies nouns referring to sources, texts, traditions, or people, rather than general concepts like 'law'."}],"priority":"★★☆"},"related_words":{"derivatives":["nonrabbinically (adverb)"],"related_terms":["rabbinical","rabbi","rabbinic Judaism","Halakha","Aggadah"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'nonrabbinical' is a specialized term primarily used in academic or religious contexts, specifically within the study of Judaism. It is used to distinguish elements that are not related to or derived from rabbinic authority or tradition. Due to its specific usage and the relatively low frequency of its occurrence, it is considered a more advanced vocabulary term."},"example_sentences":[{"sentence":"The historian examined both rabbinical and nonrabbinical interpretations of the biblical text.","translation":"歴史家は、聖書のテキストのラビ的解釈と非ラビ的解釈の両方を調べた。","type":"general"},{"sentence":"The archaeological findings shed light on nonrabbinical Jewish practices in the ancient world.","translation":"考古学的発見は、古代世界の非ラビ的ユダヤ教の慣習に光を当てた。","type":"historical"}]}