{"word":"trumpetleaf","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A carnivorous plant of the genus Sarracenia, particularly Sarracenia flava, characterized by its tall, trumpet-shaped leaves that trap insects.","english_definition":"A carnivorous plant of the genus Sarracenia, particularly Sarracenia flava, characterized by its tall, trumpet-shaped leaves that trap insects.","examples":[{"sentence":"The trumpetleaf pitcher plant attracts insects with its bright colors and sweet nectar.","translation":"トランペットリーフの食虫植物は、鮮やかな色と甘い蜜で昆虫を引き寄せます。"}],"collocations":["pitcher plant","carnivorous plant","Sarracenia flava"],"synonyms":["pitcher plant","Sarracenia"],"antonyms":[]}],"etymology":{"value":"Combination of 'trumpet' (referring to the shape of the leaves) and 'leaf'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtrʌmpɪtˌliːf/","syllables":"trum-pet-leaf"},"inflection":{"noun_plural":"trumpetleaves"},"usage_notes":{"explanation":"The term \"trumpetleaf\" is most commonly used to refer to Sarracenia flava, a specific species of pitcher plant. However, it can also be used more generally to describe any Sarracenia species with tall, trumpet-shaped leaves.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a trumpetleaf in my garden, but it was actually a Venus flytrap.","correct":"✓ I saw a trumpetleaf in the botanical garden.","note":"Trumpetleaves are not commonly found in regular gardens; Venus flytraps are a more common carnivorous plant. Trumpetleaves are more likely to be found in specific habitats or botanical gardens."}],"priority":"★☆☆"},"related_words":{"derivatives":["trumpet-leaved (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Trumpetleaf' refers to a type of carnivorous plant, specifically those in the Sarracenia genus with tall, trumpet-shaped leaves. This term is specialized and typically encountered in botanical or ecological contexts. Understanding this word requires familiarity with plant biology and carnivorous plant species.","priority":"★★☆"},"example_sentences":[{"sentence":"The tall, yellow-green trumpetleaf stood out among the other plants in the bog.","translation":"その背の高い黄緑色のトランペットリーフは、湿原の他の植物の中で際立っていた。","type":"noun","meaning_category":"plant description"},{"sentence":"Scientists study the digestive enzymes of the trumpetleaf to understand how it obtains nutrients from insects.","translation":"科学者たちは、トランペットリーフが昆虫からどのように栄養を得ているかを理解するために、その消化酵素を研究している。","type":"noun","meaning_category":"scientific study"}]}