{"word":"shagbag","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(ゴルフ)練習用ボールを集めるための袋","english_definition":"A bag used to collect practice golf balls.","examples":[{"sentence":"He filled the shagbag with golf balls after practice.","translation":"彼は練習後、ゴルフボールでシャグバッグを満たした。"}],"collocations":["fill a shagbag","empty a shagbag"],"synonyms":["ball bag"],"antonyms":[]},{"part_of_speech":"noun","definition":"(俗語,軽蔑的)だらしない人、魅力のない人","english_definition":"(Slang, derogatory) An unattractive or slovenly person.","examples":[{"sentence":"Look at that shagbag, he needs to get his life together.","translation":"あのシャグバッグを見てよ、彼は自分の人生を立て直す必要があるね。"}],"collocations":[],"synonyms":["slob","loser"],"antonyms":[]}],"etymology":{"value":"The etymology is straightforward: \"shag\" (referring to retrieving or collecting something, especially golf balls) + \"bag\". The slang usage likely derives from the idea of someone being unkempt or undesirable, like something discarded into a bag.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈʃæɡbæɡ/","syllables":"shag-bag"},"inflection":{"noun_plural":"shagbags"},"usage_notes":{"explanation":"The term \"shagbag\" has two distinct meanings. The primary meaning is a literal bag used for collecting golf balls. The secondary, slang meaning is a derogatory term for a person, implying they are unattractive or slovenly. The slang usage is considered offensive.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a shagbag of golf balls.","correct":"✓ He has a shagbag full of golf balls.","note":"When referring to the bag, use \"a shagbag full of golf balls\" or similar phrasing."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["shag (verb - to retrieve golf balls)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"shagbag\" is relatively uncommon. Its primary meaning relates to golf, while its slang meaning is offensive and should be used with extreme caution, if at all. Understanding the context is crucial to interpreting the intended meaning."},"example_sentences":[{"sentence":"The golf coach asked him to fill the shagbag before leaving the range.","translation":"ゴルフのコーチは、彼に練習場を離れる前にシャグバッグを満たすように頼んだ。","type":"noun","meaning_category":"golf bag"},{"sentence":"(offensive) Don't be such a shagbag; clean up after yourself!","translation":"（侮辱的）そんなだらしない人になるな。自分の後を片付けろ！","type":"noun","meaning_category":"derogatory slang"}]}