{"word":"adsorbent","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"吸着剤、吸着物質","english_definition":"a substance that adsorbs other substances; a material that is used to adsorb gases, liquids, or dissolved solids onto its surface.","examples":[{"sentence":"Activated carbon is a common adsorbent used in water filters.","translation":"活性炭は、浄水器で一般的に使用される吸着剤です。"},{"sentence":"Silica gel is an adsorbent used to keep things dry.","translation":"シリカゲルは、物を乾燥状態に保つために使用される吸着剤です。"},{"sentence":"The adsorbent material removed the pollutants from the air.","translation":"その吸着材は、空気から汚染物質を除去しました。"}],"collocations":["activated carbon adsorbent (活性炭吸着剤)","silica gel adsorbent (シリカゲル吸着剤)","molecular sieve adsorbent (モレキュラーシーブ吸着剤)","adsorbent material (吸着材)","adsorbent bed (吸着床)","adsorbent capacity (吸着容量)"],"synonyms":["desiccant","absorbent (sometimes used interchangeably, but adsorption is a surface phenomenon, while absorption involves penetration of the substance into the bulk of the material)"],"antonyms":["adsorbate"]},{"part_of_speech":"adjective","definition":"吸着性の、吸着力のある","english_definition":"having the ability to adsorb substances.","examples":[{"sentence":"The adsorbent properties of the material make it suitable for filtering applications.","translation":"その材料の吸着特性により、ろ過用途に適しています。"},{"sentence":"An adsorbent surface is crucial for the catalyst's effectiveness.","translation":"触媒の有効性には、吸着性の表面が不可欠です。"}],"collocations":["adsorbent surface (吸着面)","adsorbent properties (吸着特性)","adsorbent capacity (吸着能)"],"synonyms":["adsorptive"],"antonyms":["non-adsorbent"]}],"etymology":{"value":"Derived from 'adsorb,' which is from 'ad-' (to, toward) + 'sorb' (to suck up, to absorb). The term highlights the surface-level binding, distinguishing it from absorption.","priority":"★★☆"},"pronunciation":{"ipa":"/ædˈsɔːrbənt/","syllables":"ad-sor-bent"},"inflection":{"noun_plural":"adsorbents"},"usage_notes":{"explanation":"'Adsorbent' refers to a material that causes adsorption, which is the adhesion of atoms, ions, or molecules from a gas, liquid, or dissolved solid to a surface. This is different from 'absorbent,' which refers to a material that absorbs a substance into its volume. Adsorbents are used in various applications, including water purification, air filtration, and chromatography.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The absorbent removed the odor from the air.","correct":"✓ The adsorbent removed the odor from the air.","note":"'Adsorbent' is used when the substance adheres to the surface, while 'absorbent' is used when the substance is taken into the bulk of the material. Odor removal typically involves adsorption onto a surface."},{"incorrect":"✗ The adsorbent soaked up the water.","correct":"✓ The absorbent soaked up the water.","note":"'Absorbent' is used when a liquid is taken into the bulk of the material, like a sponge soaking up water. 'Adsorbent' would be used if the water molecules adhered to the surface of the material."}],"priority":"★★☆"},"related_words":{"derivatives":["adsorb (verb: to adhere to a surface)","adsorption (noun: the process of adhering to a surface)","adsorptive (adjective: having the ability to adsorb)","desorption (noun: the process of releasing from a surface)","adsorbate (noun: the substance that is adsorbed)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Adsorbent' is a technical term referring to a material that attracts and holds other substances to its surface through adsorption. This process is different from absorption, where the substance is taken into the volume of the material. Adsorbents are used in many industrial and scientific applications, such as water purification, air filtration, and chemical separations. Understanding the distinction between adsorption and absorption is crucial for using this term correctly."},"example_sentences":[{"sentence":"The **adsorbent** is used to remove impurities from the solution.","translation":"その吸着剤は、溶液から不純物を除去するために使用されます。","type":"noun","meaning_category":"吸着剤"},{"sentence":"The **adsorbent** material has a high surface area.","translation":"その吸着材は、表面積が大きい。","type":"adjective","meaning_category":"吸着性の"},{"sentence":"The **adsorbent** effectively captured the gas molecules.","translation":"その吸着剤は、ガス分子を効果的に捕捉した。","type":"noun","meaning_category":"吸着剤"}]}