{"word":"recedent","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"先行者、先例、前例","english_definition":"A person or thing that precedes; a preceding circumstance or event that serves as an example or justification for subsequent ones.","examples":[{"sentence":"The recedent in this case was a similar lawsuit filed last year.","translation":"この件の前例は、昨年提起された同様の訴訟だった。"},{"sentence":"We must consider the recedents before making a decision.","translation":"決定を下す前に、前例を考慮しなければならない。"}],"collocations":["legal recedent","historical recedent","establish a recedent","follow a recedent"],"synonyms":["precedent","antecedent","forerunner","prototype"],"antonyms":["subsequent","following"]}],"etymology":{"value":"From Latin 'recedens', the present participle of 'recedere' meaning 'to go back, withdraw'. The term implies something that has gone before and serves as a guide or basis for future actions or decisions.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrɛsɪdənt/","syllables":"res-i-dent"},"inflection":{"noun_plural":"recedents"},"usage_notes":{"explanation":"'Recedent' is a formal term, often used in legal or academic contexts, to refer to something that precedes and serves as an example. It is closely related to 'precedent' and can sometimes be used interchangeably, though 'precedent' is far more common. 'Recedent' emphasizes the act of preceding or going before.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The recedent was set by the Supreme Court.","correct":"✓ The precedent was set by the Supreme Court.","note":"'Precedent' is the more common term for a legal ruling that serves as a guide for future cases."},{"incorrect":"✗ We should always follow recedents blindly.","correct":"✓ We should always follow precedents cautiously.","note":"'Precedents' (or 'recedents') should be followed with caution and critical evaluation, not blindly."}],"priority":"★★☆"},"related_words":{"derivatives":["recede","recession"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Recedent' is a relatively uncommon term, primarily used in formal or legal contexts. It refers to something that comes before and serves as a guide or example for what follows. Understanding this word requires a strong grasp of vocabulary and an awareness of formal language use. While similar to 'precedent', 'recedent' is less frequently encountered in everyday language."},"example_sentences":[{"sentence":"The court examined the recedents to determine the appropriate course of action.","translation":"裁判所は、適切な行動方針を決定するために前例を検討した。","type":"noun","meaning_category":"preceding example"},{"sentence":"The historical recedents suggest that such policies are likely to fail.","translation":"歴史的な前例は、そのような政策が失敗する可能性が高いことを示唆している。","type":"noun","meaning_category":"historical example"}]}