{"word":"dwarfishly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"小人(こびと)のように、小人(こびと)らしく","english_definition":"In a manner resembling a dwarf; in a way that is characteristic of or befitting a dwarf.","examples":[{"sentence":"The oddly shaped tree grew dwarfishly, stunted and twisted.","translation":"その奇妙な形の木は、小人のように、成長が阻害され、ねじれて育った。"},{"sentence":"He was portrayed dwarfishly in the caricature, emphasizing his small stature.","translation":"彼は風刺画の中で小人のように描かれ、彼の低い身長が強調されていた。"}],"collocations":["grow dwarfishly","portrayed dwarfishly","appear dwarfishly"],"synonyms":["stuntedly","minutely","diminutively"],"antonyms":["gigantically","enormously","immensely"]}],"etymology":{"value":"From the adjective \"dwarfish\" (resembling a dwarf) + the suffix \"-ly\" (forming adverbs of manner).","priority":"★★★"},"pronunciation":{"ipa":"/ˈdwɔːrfɪʃli/","syllables":"dwarf-ish-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Dwarfishly' is an adverb that describes something being done or appearing in a manner that resembles a dwarf, often implying smallness, sturdiness, or a particular physical characteristic associated with dwarves. It's not a commonly used word, and its usage might sometimes be considered insensitive depending on the context, as it relies on stereotypes associated with people of short stature.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building was dwarfishly.","correct":"✓ The building looked dwarfishly small.","note":"'Dwarfishly' is an adverb, so it modifies a verb or adjective, not a noun. It describes how something is done or appears, not what something is."},{"incorrect":"✗ He acted dwarfishly towards her.","correct":"✓ He acted in a dwarfish manner towards her.","note":"While 'dwarfishly' can describe actions, it's more common to use 'in a dwarfish manner' to avoid potential misinterpretations or insensitivity."}],"priority":"★☆☆"},"related_words":{"derivatives":["dwarf (noun, verb, adjective)","dwarfish (adjective)","dwarfishness (noun)"],"phrasal_verbs":[],"related_concepts":["short stature","miniaturization","fantasy literature","mythology"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Dwarfishly' is a relatively rare adverb that means 'in a manner resembling a dwarf.' It is formed by adding the suffix '-ly' to the adjective 'dwarfish.' The word is most likely to be encountered in descriptive writing, particularly in fantasy literature or when describing something that is unusually small or stunted. Due to its potential to perpetuate stereotypes about people with dwarfism, it should be used with caution and sensitivity."},"example_sentences":[{"sentence":"The bonsai tree, carefully pruned, grew dwarfishly in its small pot.","translation":"注意深く剪定された盆栽は、小さな鉢の中で小人のように育った。","type":"adverb","meaning_category":"manner of growth"},{"sentence":"The artist portrayed the villain dwarfishly, exaggerating his physical imperfections.","translation":"アーティストは悪役を小人のように描き、彼の身体的な欠点を誇張した。","type":"adverb","meaning_category":"manner of portrayal"}]}