{"word":"non-affine","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"非アフィン的な","english_definition":"Not affine; lacking the properties of an affine transformation or space.","examples":[{"sentence":"The transformation is non-affine because it does not preserve parallelism.","translation":"その変換は平行性を保持しないため、非アフィン的である。"},{"sentence":"Non-affine geometry deals with figures that are not preserved under affine transformations.","translation":"非アフィン幾何学は、アフィン変換下で保存されない図形を扱う。"}],"collocations":["non-affine transformation","non-affine space","non-affine geometry"],"synonyms":["non-linear","curvilinear"],"antonyms":["affine","linear"]},{"part_of_speech":"adjective","definition":"(数学)アフィン性を持たない、アフィン写像でない","english_definition":"(Mathematics) Not possessing affine properties; not being an affine mapping.","examples":[{"sentence":"A non-affine function cannot be represented as a linear combination of its inputs plus a constant.","translation":"非アフィン関数は、入力の線形結合と定数の和として表現できない。"},{"sentence":"The curve is non-affine because it is not a straight line.","translation":"その曲線は直線ではないため、非アフィン的である。"}],"collocations":["non-affine function","non-affine mapping","non-affine curve"],"synonyms":["non-linear","curved"],"antonyms":["affine","linear"]}],"etymology":{"value":"Prefix 'non-' (not) + 'affine' (related to affine transformations).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌnɒn əˈfaɪn/","syllables":"non-af-fine"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"'Non-affine' is used in mathematics and computer graphics to describe objects, spaces, or transformations that do not adhere to the properties of affine geometry. Affine transformations preserve collinearity (points lying on a line remain on a line) and ratios of distances along a line, but not necessarily angles or lengths. Therefore, anything that doesn't maintain these properties is considered non-affine.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The affine transformation is non-affine.","correct":"✓ The transformation is non-affine.","note":"An affine transformation, by definition, cannot be non-affine. The adjective 'non-affine' should be applied to something that lacks affine properties."}],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["affine","affine transformation","affine space","linear transformation","non-linear"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Non-affine' is a technical term used in mathematics, particularly in geometry and linear algebra. It describes something that does not possess the properties of an affine transformation or space. Understanding this term requires familiarity with the concept of affine transformations, which preserve collinearity and ratios of distances but not necessarily angles or lengths. If a transformation or object does not maintain these properties, it is considered non-affine."},"example_sentences":[{"sentence":"The perspective projection is a non-affine transformation.","translation":"透視投影は非アフィン変換である。","type":"adjective","meaning_category":"mathematics"},{"sentence":"The surface is non-affine because it is curved.","translation":"その表面は曲がっているため、非アフィン的である。","type":"adjective","meaning_category":"mathematics"}]}