{"word":"Sooners","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(アメリカ合衆国史) 1889年の土地開放の際に、定められた期日より前にオクラホマの未開墾地に不法に入植した人々","english_definition":"(US History) People who illegally settled on the Unassigned Lands in Oklahoma before the official opening of the territory in 1889.","examples":[{"sentence":"The Sooners jumped the gun and staked their claims early.","translation":"スーナーズはフライングして、早くから自分たちの土地の権利を主張した。"}],"collocations":[],"synonyms":["land grabbers","claim jumpers"],"antonyms":[],"notes":"Often used historically, referring to the Oklahoma Land Rush."},{"part_of_speech":"noun","definition":"オクラホマ大学のアスレチックスチームの愛称","english_definition":"The nickname for the athletic teams of the University of Oklahoma.","examples":[{"sentence":"The Sooners are known for their strong football program.","translation":"スーナーズは、強力なフットボールプログラムで知られている。"},{"sentence":"Sooners fans are passionate about their teams.","translation":"スーナーズのファンは、自分たちのチームに情熱を注いでいる。"}],"collocations":["Oklahoma Sooners","Sooners football","Sooners basketball"],"synonyms":[],"antonyms":[],"notes":"Commonly used in sports contexts."}],"etymology":{"value":"From the phrase \"sooner than later,\" referring to those who entered the Unassigned Lands in Oklahoma before the legal date.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsuːnərz/","syllables":"Soo-ners"},"inflection":{"noun_plural":"Sooners"},"usage_notes":{"explanation":"\"Sooners\" has two primary meanings: historically, it refers to those who illegally entered Oklahoma before the official land rush. Currently, it is the nickname for the University of Oklahoma's athletic teams. The context usually clarifies which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["Sooner (singular form)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Moderate (depending on context)","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word \"Sooners\" can be confusing because it has both a historical and a contemporary meaning. In a historical context, it refers to people who cheated during the Oklahoma Land Rush. In a modern context, it refers to the athletic teams of the University of Oklahoma. Understanding the context is key to interpreting the word correctly.","priority":"★★★"},"example_sentences":[{"sentence":"The **Sooners** illegally entered the territory to claim land.","translation":"スーナーズは土地を主張するために不法に領土に侵入した。","type":"noun","meaning_category":"Historical"},{"sentence":"The **Sooners** won the national championship in football.","translation":"スーナーズはフットボールで全国選手権を獲得した。","type":"noun","meaning_category":"Athletics Team"}]}