{"word":"uncontractible","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(文法)短縮形にできない、短縮できない","english_definition":"(grammar) not able to be contracted; not able to be shortened into a contraction.","examples":[{"sentence":"'Is not' is uncontractible in certain grammatical contexts.","translation":"「Is not」は特定の文法的な文脈では短縮形にできません。"},{"sentence":"Some grammarians argue that certain auxiliary verbs are uncontractible in specific sentence structures.","translation":"一部の文法学者は、特定の助動詞は特定の文構造では短縮できないと主張しています。"}],"collocations":["uncontractible auxiliary verb","uncontractible form","uncontractible copula"],"synonyms":["non-contractible"],"antonyms":["contractible"]}],"etymology":{"value":"'Un-' (not) + 'contractible' (able to be contracted).","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnkənˈtræktɪbəl/","syllables":"un-con-tract-i-ble"},"inflection":{"notes":"Adjective; comparative and superlative forms are possible (more uncontractible, most uncontractible), but not common."},"usage_notes":{"explanation":"'Uncontractible' is primarily used in grammatical discussions to describe words or phrases that cannot be shortened into contractions. This is often due to grammatical rules or stylistic preferences. For example, in formal writing, contractions may be avoided, making certain forms uncontractible in that context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The muscle was uncontractible after the injury.","correct":"The muscle was unable to contract after the injury.","note":"'Uncontractible' is typically used in a grammatical context. For physical inability to contract, use 'unable to contract' or a similar phrase."}],"priority":"★★☆"},"related_words":{"derivatives":["uncontracted (adjective): not contracted","contraction (noun): a shortened form of a word or phrase"],"related_terms":["auxiliary verb","copula","grammar","syntax"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'uncontractible' is a technical term primarily used in linguistics and grammar. It describes a word or phrase that cannot be shortened to form a contraction. This term is not commonly used in everyday conversation and is more likely to be encountered in academic or specialized contexts related to language study."},"example_sentences":[{"sentence":"The professor explained why the verb 'am' is often uncontractible when it's emphasized.","translation":"教授は、動詞「am」が強調されるとき、なぜしばしば短縮できないのかを説明しました。","type":"adjective","meaning_category":"grammar"},{"sentence":"In formal writing, many writers avoid contractions, making forms like 'cannot' effectively uncontractible.","translation":"フォーマルな文章では、多くの書き手が短縮形を避け、「cannot」のような形を事実上短縮不可能にしています。","type":"adjective","meaning_category":"grammar"}]}