{"word":"nonexperimentally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"実験的でない方法で、実験によらずに","english_definition":"In a manner that is not experimental; without the use of experiments.","examples":[{"sentence":"The data was collected nonexperimentally, relying on observational studies.","translation":"データは実験によらずに収集され、観察研究に依存した。"},{"sentence":"The hypothesis was tested nonexperimentally through simulations.","translation":"仮説はシミュレーションを通して、実験的でない方法で検証された。"}],"collocations":["collect data nonexperimentally","test a hypothesis nonexperimentally","study something nonexperimentally"],"synonyms":["observationally","descriptively","qualitatively"],"antonyms":["experimentally"]}],"etymology":{"value":"Derived from 'non-' (prefix meaning 'not'), 'experimental' (relating to or based on experiments), and '-ly' (suffix forming adverbs).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnɪkˌspɛrɪˈmɛntəli/","syllables":"non-ex-per-i-men-tal-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Nonexperimentally' is used to describe methods or studies that do not involve controlled experiments. This often includes observational studies, surveys, and other forms of data collection where variables are not manipulated. It is commonly used in scientific and research contexts to differentiate between experimental and non-experimental approaches.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The study was done non experiment.","correct":"✓ The study was done nonexperimentally.","note":"'Nonexperimentally' is an adverb, so it modifies a verb. 'Non experiment' is not a grammatically correct phrase."}],"priority":"★☆☆"},"related_words":{"derivatives":["nonexperimental (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'nonexperimentally' is a technical term primarily used in academic and research contexts. It describes a methodology that does not involve controlled experiments, relying instead on observation or other non-manipulative data collection methods. Understanding this term requires familiarity with research methodologies and experimental design."},"example_sentences":[{"sentence":"The effects of the policy were evaluated nonexperimentally using existing datasets.","translation":"政策の効果は、既存のデータセットを用いて、実験的でない方法で評価された。","type":"adverb","meaning_category":"methodology"},{"sentence":"The correlation between the two variables was determined nonexperimentally through statistical analysis of survey responses.","translation":"2つの変数の相関関係は、アンケート回答の統計分析を通して、実験によらずに決定された。","type":"adverb","meaning_category":"data analysis"}]}