{"word":"voteless","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"選挙権のない、投票権を剥奪された","english_definition":"lacking the right to vote; disenfranchised.","examples":[{"sentence":"The voteless population felt marginalized by the political system.","translation":"選挙権のない人々は、政治システムによって疎外されていると感じていた。"},{"sentence":"Historically, many groups, including women and minorities, were voteless.","translation":"歴史的に、女性や少数派を含む多くのグループが選挙権を持っていなかった。"},{"sentence":"The new law made thousands of residents voteless.","translation":"新しい法律により、数千人の住民が選挙権を剥奪された。"}],"collocations":["voteless citizens","voteless residents","voteless population","remain voteless","become voteless"],"synonyms":["disenfranchised","ineligible to vote","non-voting","excluded from voting"],"antonyms":["enfranchised","voting","eligible to vote"]}],"etymology":{"value":"\"Vote\" + \"-less\". The suffix \"-less\" means \"without\" or \"lacking\". Thus, \"voteless\" literally means \"without a vote\" or \"lacking the right to vote.\"","priority":"★★★"},"pronunciation":{"ipa":"/ˈvoʊtləs/","syllables":"vote-less"},"inflection":{"notes":"Adjective; no plural form."},"usage_notes":{"explanation":"\"Voteless\" typically describes individuals or groups who are legally or systematically denied the right to participate in elections. It often carries a connotation of injustice or inequality, particularly when certain demographics are disproportionately affected. The term is frequently used in discussions about civil rights, political representation, and historical disenfranchisement.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The voteless country needs reform.","correct":"✓ The country with a voteless population needs reform.","note":"\"Voteless\" describes people, not places. A country can't be voteless, but it can have a voteless population."},{"incorrect":"✗ He is voteless because he didn't vote.","correct":"✓ He didn't vote, so he didn't participate in the election. / ✓ He is voteless because he is not a citizen.","note":"\"Voteless\" implies a lack of eligibility, not simply a failure to participate. If someone chooses not to vote, they are a non-voter, but not necessarily voteless."}],"priority":"★★☆"},"related_words":{"derivatives":["vote","voter","voting","disenfranchise","enfranchise","suffrage"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"voteless\" is a relatively uncommon term used to describe people who do not have the right to vote. This can be due to various reasons, such as not being a citizen, being a minor, or having been legally barred from voting. The term often appears in discussions about civil rights and political equality. It's formed by adding the suffix \"-less,\" meaning \"without,\" to the word \"vote.\""},"example_sentences":[{"sentence":"Many immigrants are voteless until they become citizens.","translation":"多くの移民は市民権を得るまで選挙権がない。","type":"descriptive","meaning_category":"lacking the right to vote"},{"sentence":"The proposed legislation would leave thousands of residents voteless.","translation":"提案された法律は、何千人もの住民を選挙権のない状態にするだろう。","type":"consequence","meaning_category":"lacking the right to vote"},{"sentence":"Activists fought to ensure that no segment of the population remained voteless.","translation":"活動家たちは、人口のどの層も選挙権のない状態にならないように戦った。","type":"historical context","meaning_category":"lacking the right to vote"}]}