{"word":"virilescent","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(医学)男性化しつつある、男性化の兆候を示す","english_definition":"(medicine) Becoming or tending to become masculine; exhibiting virilism.","examples":[{"sentence":"The patient showed virilescent symptoms, including increased facial hair and a deepened voice.","translation":"その患者は、顔の毛の増加や声の低音化など、男性化の兆候を示した。"}],"collocations":["virilescent symptoms","virilescent changes"],"synonyms":["masculinizing","androgenic"],"antonyms":["feminizing"]},{"part_of_speech":"adjective","definition":"(植物学)雄性化しつつある","english_definition":"(botany) Tending toward maleness.","examples":[{"sentence":"Some plants under stress may exhibit virilescent tendencies.","translation":"ストレス下にある植物の中には、雄性化の傾向を示すものもある。"}],"collocations":["virilescent plant","virilescent flower"],"synonyms":["staminate"],"antonyms":["pistillate"]}],"etymology":{"value":"From Latin 'virilescens', the present participle of 'virilescere' meaning 'to become a man, to become manly', from 'virilis' (manly, male) + '-escere' (becoming).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌvɪrɪˈlɛsənt/","syllables":"vi-ril-es-cent"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. Comparative and superlative forms are 'more virilescent' and 'most virilescent', respectively, though they are rarely used."},"usage_notes":{"explanation":"'Virilescent' is a relatively rare term, primarily used in medical and botanical contexts. In medicine, it describes the development of male secondary sexual characteristics in a female or a prepubescent male. In botany, it describes the tendency of a plant or flower to develop male characteristics. It is more commonly encountered in scientific literature.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The flower was virilescent because it was very strong.","correct":"✓ The flower was virilescent, showing more stamens than pistils.","note":"'Virilescent' refers specifically to the development of male characteristics, not general strength. The corrected sentence provides a specific example of virilescence in a flower."}],"priority":"★☆☆"},"related_words":{"derivatives":["virilescence (noun)","virilism (noun)","virile (adjective)"],"related_terms":["androgen","testosterone","masculinization","stamen","pistil"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Virilescent' is a specialized term primarily used in medical and botanical contexts to describe the development or tendency towards male characteristics. In medicine, it refers to the appearance of male secondary sexual characteristics, often in females. In botany, it describes the tendency of a plant to develop male characteristics. Due to its specialized nature, it is not commonly used in everyday language."},"example_sentences":[{"sentence":"The patient exhibited virilescent features due to a hormonal imbalance.","translation":"その患者はホルモンバランスの乱れにより、男性化の特徴を示した。","type":"medical","meaning_category":"男性化しつつある"},{"sentence":"The normally pistillate flower showed some virilescent traits.","translation":"通常は雌性の花が、いくつかの雄性化の特徴を示した。","type":"botanical","meaning_category":"雄性化しつつある"}]}