{"word":"type-dressing","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"The practice of assigning personality traits or characteristics to individuals based on their perceived type (e.g., personality type, astrological sign, etc.). This often involves making generalizations or stereotypes.","english_definition":"The practice of assigning personality traits or characteristics to individuals based on their perceived type (e.g., personality type, astrological sign, etc.). This often involves making generalizations or stereotypes.","examples":[{"sentence":"She accused him of type-dressing her when he said she was 'just being a typical Gemini.'","translation":"彼女は彼が「あなたは典型的な双子座なだけだ」と言った時、タイプドレッシングだと非難した。"},{"sentence":"Type-dressing can lead to unfair judgments and limit our understanding of individual differences.","translation":"タイプドレッシングは不公平な判断につながり、個々の違いに対する理解を制限する可能性がある。"}],"collocations":["avoid type-dressing","fall into type-dressing","be accused of type-dressing"],"synonyms":["stereotyping","labeling","categorizing","generalizing"],"antonyms":["individualizing","personalizing","differentiating","nuance"],"notes":"This term is often used critically to describe the act of oversimplifying someone's personality based on a specific type. It is related to the concept of pigeonholing.","related_terms":["pigeonholing","stereotyping","personality typing"],"usage":"Type-dressing is generally considered a negative practice, as it can lead to inaccurate assumptions and prejudice."}],"etymology":{"value":"A combination of 'type' (referring to a category or classification) and 'dressing' (implying an overlay or superficial application). The term suggests that personality traits are being superficially 'dressed' onto individuals based on their type, rather than being genuinely reflective of their individual character.","priority":"N/A"},"pronunciation":{"ipa":"/ˈtaɪpˌdrɛsɪŋ/","syllables":"type-dress-ing"},"inflection":{"noun_plural":"type-dressings"},"common_mistakes":{"examples":[{"incorrect":"✗ He was type-dressing the code.","correct":"✓ He was typecasting the code.","note":"Type-dressing is generally used in the context of people, not code. Typecasting is the correct term for code."}],"priority":"N/A"},"related_words":{"derivatives":[],"related_terms":["typecasting","stereotyping","profiling","characterization"]},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Type-dressing' refers to the act of assigning personality traits or characteristics to someone based on their perceived 'type,' such as their astrological sign or personality type. It's often used critically to describe the oversimplification of an individual's personality and can lead to unfair judgments. The term implies that these traits are being superficially 'dressed' onto the person, rather than reflecting their true individuality."},"example_sentences":[{"sentence":"The article criticized the tendency to type-dress individuals based on their Myers-Briggs personality type.","translation":"その記事は、個人の性格をマイヤーズ＝ブリッグス性格診断に基づいてタイプ分けする傾向を批判した。","type":"noun","meaning_category":"General use"},{"sentence":"She felt that being constantly type-dressed as 'the creative one' was limiting her opportunities.","translation":"彼女は、常に「クリエイティブな人」としてタイプ分けされることが、自分の機会を制限していると感じた。","type":"noun","meaning_category":"Limiting opportunities"},{"sentence":"It's important to avoid type-dressing people and to recognize their unique qualities.","translation":"人をタイプ分けすることを避け、その人ならではの資質を認識することが重要だ。","type":"verb (gerund)","meaning_category":"Avoiding type-dressing"}]}