{"word":"Ferryhouse","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A house located near a ferry landing or used in association with a ferry service.","english_definition":"A house located near a ferry landing or used in association with a ferry service.","examples":[{"sentence":"The old Ferryhouse was a landmark in the town.","translation":"その古いフェリーハウスはその町の名所だった。"},{"sentence":"They lived in the Ferryhouse, managing the ferry service for many years.","translation":"彼らはフェリーハウスに住み、長年フェリーサービスを管理していた。"}],"collocations":["old Ferryhouse","historic Ferryhouse","Ferryhouse Inn"],"synonyms":["ferryman's house","ferry terminal house"],"antonyms":[]}],"etymology":{"value":"Combination of 'ferry' (a boat or other means of conveyance used to transport passengers and goods across a body of water) and 'house' (a building used as a dwelling).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɛrihaʊs/","syllables":"Fer-ry-house"},"inflection":{"noun_plural":"Ferryhouses"},"usage_notes":{"explanation":"The term 'Ferryhouse' is relatively uncommon and usually refers to a specific building with a historical or functional connection to a ferry service. It often implies a building that served as the residence or office for the ferry operator.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ferryhouse is a type of ferry.","correct":"✓ The ferryhouse is a building near a ferry landing.","note":"A ferryhouse is a building, not a type of boat."}],"priority":"★★☆"},"related_words":{"derivatives":["ferryman","ferry terminal","ferry landing"],"related_terms":["boathouse","dockhouse","lighthouse"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ferryhouse' is a compound noun referring to a house associated with a ferry service, often located near the landing. It is not a common word, so understanding relies on knowing the meanings of 'ferry' and 'house' and inferring the combined meaning from context. The term is more likely to appear in historical or geographical contexts. "},"example_sentences":[{"sentence":"The sign pointed towards the Ferryhouse and the river crossing.","translation":"標識はフェリーハウスと川の渡し場を指していた。","type":"noun","meaning_category":"location"},{"sentence":"The family who owned the Ferryhouse also operated the local ferry service.","translation":"そのフェリーハウスを所有する家族は、地元のフェリーサービスも運営していた。","type":"noun","meaning_category":"ownership/operation"}]}