{"word":"heretically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"異端的に、正統から外れて","english_definition":"In a way that deviates from established or traditional beliefs, especially in religion; in a heretical manner.","examples":[{"sentence":"He argued heretically against the accepted scientific theories.","translation":"彼は受け入れられている科学理論に対して異端的に議論した。"},{"sentence":"The artist painted heretically, challenging the norms of the art world.","translation":"その芸術家は異端的に絵を描き、美術界の規範に挑戦した。"},{"sentence":"She spoke heretically about the company's policies, risking her job.","translation":"彼女は会社の政策について異端的に語り、職を危険にさらした。"}],"collocations":["speak heretically","think heretically","act heretically","paint heretically","argue heretically"],"synonyms":["unorthodoxly","heterodoxly","nonconformistly","iconoclastically","deviationally"],"antonyms":["orthodoxly","conventionally","traditionally","conformingly"]}],"etymology":{"value":"Derived from \"heretical,\" which comes from \"heresy.\" \"Heresy\" originates from the Greek word \"hairesis,\" meaning \"choice\" or \"sect.\" Over time, it came to mean a belief or opinion contrary to orthodox religious doctrine.","priority":"★★☆"},"pronunciation":{"ipa":"/həˈrɛtɪkli/","syllables":"he-ret-i-cal-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"\"Heretically\" describes actions, thoughts, or expressions that contradict established doctrines or beliefs, particularly in religion but also in other fields like science, art, or politics. It implies a deliberate departure from what is considered orthodox or traditional. The word often carries a negative connotation, suggesting that the deviation is considered wrong or dangerous by some.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He heretically believed in the importance of following the rules.","correct":"✓ He ironically believed in the importance of following the rules.","note":"\"Heretically\" implies a deviation from established beliefs. Believing in following rules is not heretical; it's more likely ironic or unexpected in a given context."},{"incorrect":"✗ The building was heretically designed.","correct":"✓ The building was unconventionally designed.","note":"While a building design can be unorthodox, \"heretically\" is typically reserved for beliefs or opinions, especially religious ones. \"Unconventionally\" is a more appropriate term for describing an unusual design."}],"priority":"★★☆"},"related_words":{"derivatives":["heretical (adjective)","heresy (noun)","heretic (noun)"],"phrasal_verbs":[],"related_concepts":["orthodoxy","doctrine","dogma","unbelief","apostasy"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"heretically\" is used to describe something done in a way that goes against accepted beliefs, especially religious ones. It's not a common word and is usually found in more formal writing or discussions about religion, philosophy, or challenging established ideas. It implies a strong disagreement with what is generally considered correct or true.","priority":"★★★"},"example_sentences":[{"sentence":"The scientist challenged the established theories heretically, proposing a radical new approach.","translation":"その科学者は確立された理論に異端的に挑戦し、根本的に新しいアプローチを提案した。","type":"general","meaning_category":"challenging established theories"},{"sentence":"She wrote heretically about the church's teachings, causing controversy among the faithful.","translation":"彼女は教会の教えについて異端的に書き、信者の間で論争を引き起こした。","type":"religious","meaning_category":"deviating from religious doctrine"},{"sentence":"He questioned the company's marketing strategy heretically, suggesting a completely different direction.","translation":"彼は会社のマーケティング戦略に異端的に疑問を呈し、全く異なる方向性を示唆した。","type":"business","meaning_category":"challenging business strategies"}]}