{"word":"spectrograph","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"分光写真器、スペクトログラフ","english_definition":"An instrument used to photograph or record spectra.","examples":[{"sentence":"The spectrograph revealed the presence of specific elements in the star's atmosphere.","translation":"その分光写真器は、恒星の大気中に特定の元素が存在することを示した。"},{"sentence":"Astronomers use spectrographs to analyze the light from distant galaxies.","translation":"天文学者は、遠い銀河からの光を分析するために分光写真器を使用する。"}],"collocations":["stellar spectrograph","high-resolution spectrograph","fiber-fed spectrograph"],"synonyms":["spectrometer","spectroscope"],"antonyms":[]}],"etymology":{"value":"Derived from 'spectrum' (Latin for 'image') and '-graph' (from Greek 'graphein' meaning 'to write').","priority":"★★☆"},"pronunciation":{"ipa":"ˈspektrəˌɡræf","syllables":"spec-tro-graph"},"inflection":{"noun_plural":"spectrographs"},"usage_notes":{"explanation":"A spectrograph is primarily used in astronomy and chemistry to analyze the composition of light or other electromagnetic radiation emitted or absorbed by a substance. It separates light into its component wavelengths (colors) and records the resulting spectrum. The spectrum can then be analyzed to identify the elements present in the substance, its temperature, density, and velocity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The spectrograph measures the speed of light directly.","correct":"✓ The spectrograph analyzes the wavelengths of light to determine properties such as composition and velocity.","note":"Spectrographs don't directly measure the speed of light, but analyze the wavelengths of light which can then be used to infer other properties."}],"priority":"★★☆"},"related_words":{"derivatives":["spectroscopy","spectroscopic"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A spectrograph is a scientific instrument used to create a detailed record of a spectrum. It is commonly used in fields like astronomy and chemistry to analyze the composition of light or other electromagnetic radiation. The instrument separates the incoming light into its constituent wavelengths, allowing scientists to identify the elements present in a sample, its temperature, density, and velocity. Understanding the term requires familiarity with scientific concepts like spectra and electromagnetic radiation."},"example_sentences":[{"sentence":"The research team used a spectrograph to identify the chemical composition of the unknown substance.","translation":"研究チームは、未知の物質の化学組成を特定するために分光写真器を使用した。","type":"noun","meaning_category":"instrument"},{"sentence":"The data from the spectrograph provided valuable insights into the star's evolution.","translation":"分光写真器からのデータは、恒星の進化に関する貴重な洞察を提供した。","type":"noun","meaning_category":"data analysis"}]}