{"word":"semiostracism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古代アテネにおける)準追放; 投票によって一時的な追放を決定する制度","english_definition":"(in ancient Athens) a form of temporary banishment similar to ostracism, but less severe.","examples":[{"sentence":"Semiostracism was a milder form of ostracism, involving a shorter period of exile.","translation":"準追放は追放よりも穏やかな形態であり、より短い期間の追放を伴った。"}],"collocations":["temporary banishment","political exile"],"synonyms":["ostracism","banishment","exile"],"antonyms":["acceptance","inclusion"]}],"etymology":{"value":"The word 'semiostracism' is formed by combining 'semi-' (meaning 'half' or 'partial') with 'ostracism'. Ostracism itself comes from the Greek word 'ostrakon' (ὄστρακον), which means 'shell' or 'potsherd'. In ancient Athens, citizens would write the name of the person they wished to banish on a piece of pottery (ostrakon), and if a certain threshold was met, that person would be exiled. 'Semiostracism' implies a lesser or partial form of this practice.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɛmioʊˈstræsɪzəm/","syllables":"se-mi-o-strac-i-sm"},"inflection":{"noun_plural":"semiostracisms"},"usage_notes":{"explanation":"'Semiostracism' refers to a historical practice in ancient Athens. It's a relatively rare term, primarily used in historical or academic contexts when discussing ancient Athenian political systems. It is important to note that this term is not commonly used in modern contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was semiostracized from the group for his unpopular opinions.","correct":"✓ He was ostracized from the group for his unpopular opinions.","note":"In modern contexts, 'ostracized' is generally used to describe social exclusion, rather than 'semiostracized'."}],"priority":"★☆☆"},"related_words":{"derivatives":["ostracism","ostracize"],"historical_terms":["ostrakon","ekklesia"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な歴史用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Semiostracism' is a highly specialized term referring to a specific historical practice in ancient Athens. Understanding this term requires knowledge of ancient Athenian political systems and the practice of ostracism. The term is rarely used outside of historical or academic discussions. It is important to distinguish it from the more common term 'ostracism,' which refers to general social exclusion.","priority":"★☆☆"},"example_sentences":[{"sentence":"The measure of semiostracism was proposed as a compromise to avoid fully ostracizing the popular general.","translation":"人気のある将軍を完全に追放することを避けるための妥協案として、準追放の措置が提案された。","type":"noun","meaning_category":"準追放の制度"},{"sentence":"Historians debate the exact differences between ostracism and semiostracism in ancient Athenian society.","translation":"歴史家たちは古代アテネ社会における追放と準追放の正確な違いについて議論している。","type":"noun","meaning_category":"準追放の制度"}]}