{"word":"unconciliating","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"和解しない、懐柔的でない、融和的でない","english_definition":"not tending to reconcile; not conciliatory; unwilling to compromise or appease.","examples":[{"sentence":"His unconciliating attitude made the negotiations even more difficult.","translation":"彼の非妥協的な態度は交渉をさらに困難にした。"},{"sentence":"The leader's unconciliating remarks sparked further conflict.","translation":"指導者の非融和的な発言はさらなる対立を引き起こした。"},{"sentence":"She adopted an unconciliating tone, refusing to listen to any opposing viewpoints.","translation":"彼女は反対意見に耳を傾けようとせず、非妥協的な口調をとった。"}],"collocations":["unconciliating attitude","unconciliating remarks","unconciliating tone","unconciliating behavior","unconciliating approach"],"synonyms":["inflexible","uncompromising","intransigent","obdurate","adamant","unyielding","implacable","antagonistic","belligerent","hostile"],"antonyms":["conciliating","appeasing","placatory","compromising","reconciliatory","peaceful","friendly","amicable"]}],"etymology":{"value":"\"Un-\" (not) + \"conciliating\" (tending to conciliate). \"Conciliate\" comes from Latin \"conciliare\" (to bring together, unite, reconcile).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnkənˈsɪliˌeɪtɪŋ/","syllables":"un-con-cil-i-at-ing"},"inflection":{"notes":"Adjective; comparative: more unconciliating, superlative: most unconciliating"},"usage_notes":{"explanation":"\"Unconciliating\" describes someone or something that does not attempt to make others feel better or more willing to agree. It emphasizes a lack of effort or intention to reconcile differences or ease tension. It often implies a stubborn or hostile stance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was unconciliating with his friends.","correct":"✓ He had an unconciliating attitude towards his friends.","note":"\"Unconciliating\" is typically used to describe a quality or characteristic (e.g., attitude, tone) rather than directly describing a person's relationship with someone using \"with.\""},{"incorrect":"✗ Her unconciliating made the situation worse.","correct":"✓ Her unconciliating attitude made the situation worse.","note":"\"Unconciliating\" is an adjective, not a noun. Use a noun like \"attitude,\" \"behavior,\" or \"approach\" to describe the quality."}],"priority":"★★☆"},"related_words":{"derivatives":["unconciliated (adjective: not conciliated)","conciliating (adjective: tending to conciliate)","conciliation (noun: the act of conciliating)","conciliatory (adjective: intended or likely to placate or appease)","reconcile (verb: to restore friendly relations)","irreconcilable (adjective: impossible to reconcile)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unconciliating\" is a relatively uncommon and formal adjective. It describes a person or behavior that is not intended to bring about agreement or reconciliation. Understanding this word requires a good vocabulary and an understanding of related terms like \"conciliation\" and \"reconcile.\""},"example_sentences":[{"sentence":"The diplomat's unconciliating stance threatened to derail the peace talks.","translation":"外交官の非妥協的な態度は和平交渉を頓挫させる恐れがあった。","type":"adjective","meaning_category":"not tending to reconcile"},{"sentence":"His unconciliating approach to management created a hostile work environment.","translation":"彼の非融和的な経営手法は敵対的な職場環境を生み出した。","type":"adjective","meaning_category":"not tending to reconcile"},{"sentence":"Despite the mediator's efforts, the two parties remained unconciliating.","translation":"調停者の努力にもかかわらず、両当事者は和解しようとしなかった。","type":"adjective","meaning_category":"not tending to reconcile"}]}