{"word":"pro-consumerism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"消費者主義賛成論、消費者主義推進論","english_definition":"The advocacy of consumerism; the belief that it is economically desirable for people to buy and use a lot of products and services.","examples":[{"sentence":"Pro-consumerism argues that increased spending drives economic growth.","translation":"消費者主義賛成論は、消費支出の増加が経済成長を促進すると主張する。"},{"sentence":"Critics of pro-consumerism point to its environmental impact.","translation":"消費者主義賛成論の批判者は、その環境への影響を指摘する。"}],"collocations":["support pro-consumerism (消費者主義賛成を支持する)","oppose pro-consumerism (消費者主義賛成に反対する)","the effects of pro-consumerism (消費者主義賛成の効果)"],"synonyms":["consumerism","consumptionism"],"antonyms":["anti-consumerism","consumer resistance","minimalism"]}],"etymology":{"value":"'Pro-' (賛成) + 'consumerism' (消費者主義)","priority":"★★★"},"pronunciation":{"ipa":"/ˌproʊ kənˈsuːmərɪzəm/","syllables":"pro-con-sum-er-ism"},"inflection":{"notes":"Uncountable noun"},"usage_notes":{"explanation":"'Pro-consumerism' is a relatively uncommon term, often used in academic or economic discussions. It represents the viewpoint that consumer spending is a positive force for economic prosperity. It's often contrasted with anti-consumerism, which emphasizes the negative social and environmental consequences of excessive consumption.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a pro-consumerism.","correct":"✓ He supports pro-consumerism.","note":"'Pro-consumerism' is a noun, not a person. Use it as a concept that someone supports."}],"priority":"★★☆"},"related_words":{"derivatives":["pro-consumer (形容詞: 消費者賛成の)","consumerism (名詞: 消費者主義)","consumer (名詞: 消費者)"],"phrases":["consumer culture (消費者文化)","consumer society (消費社会)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pro-consumerism' is a complex term related to economics and social theory. It's used to describe the belief that encouraging people to buy and use goods and services is good for the economy. You'll usually find this word in discussions about economic policy, marketing, and the impact of consumption on society and the environment. It's important to understand that this term has both supporters and critics."},"example_sentences":[{"sentence":"The government's policies seemed to promote pro-consumerism, encouraging citizens to spend more.","translation":"政府の政策は、国民にもっと消費するよう促し、消費者主義賛成を推進しているように見えた。","type":"noun","meaning_category":"advocacy of consumerism"},{"sentence":"The debate over pro-consumerism versus sustainability continues to shape economic discussions.","translation":"消費者主義賛成と持続可能性に関する議論は、経済に関する議論を形作り続けている。","type":"noun","meaning_category":"advocacy of consumerism"}]}