{"word":"non-lactating","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"授乳中でない、非授乳期の","english_definition":"Not producing or secreting milk; not breastfeeding.","examples":[{"sentence":"The study included both lactating and non-lactating women.","translation":"その研究には、授乳中の女性と授乳中でない女性の両方が含まれていた。"},{"sentence":"The medication is safe for non-lactating mothers.","translation":"その薬は授乳中でない母親には安全である。"},{"sentence":"A non-lactating breast may still experience hormonal changes.","translation":"授乳中でない乳房でも、ホルモン変化を経験することがある。"}],"collocations":["non-lactating woman","non-lactating mother","non-lactating breast"],"synonyms":["not breastfeeding","postpartum (if after pregnancy and not breastfeeding)"],"antonyms":["lactating","breastfeeding"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the word 'lactating' (producing milk).","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈlækteɪtɪŋ/","syllables":"non-lac-tat-ing"},"inflection":{"notes":"Adjectives do not typically inflect in English, beyond comparative and superlative forms, which are less common with 'non-lactating'."},"usage_notes":{"explanation":"'Non-lactating' is a descriptive term used primarily in medical and scientific contexts to differentiate individuals who are not currently producing milk, typically in reference to women after childbirth or those who have never given birth. It is often used in research studies, medical guidelines, and product labeling to specify safety or efficacy for this particular group.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is non-lactating since she stopped to breastfeed.","correct":"✓ She is non-lactating since she stopped breastfeeding.","note":"'Breastfeed' is typically used as one word, especially as a verb."},{"incorrect":"✗ The cow is non-lactating.","correct":"✓ The cow is not lactating.","note":"While technically correct, 'non-lactating' is usually used in more formal or scientific contexts. In everyday language, 'not lactating' is more common."}],"priority":"★★☆"},"related_words":{"derivatives":["lactation (noun): the secretion of milk by the mammary glands.","lactating (adjective): producing or secreting milk."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency - primarily used in medical or scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'non-lactating' is a specialized term used in medical and scientific fields to describe someone who is not currently producing milk. It is most often used in reference to women who are not breastfeeding or have completed breastfeeding. Because it is a technical term, it is less common in everyday conversation and more frequently encountered in research papers, medical texts, or health guidelines. Understanding this term is helpful for comprehending information related to women's health, infant nutrition, and pharmaceutical safety during and after pregnancy.","example_sentences":[]}}