{"word":"multiinfection","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"複数の感染症に同時に感染すること","english_definition":"The simultaneous infection with multiple infectious agents.","examples":[{"sentence":"The patient was diagnosed with a multiinfection involving influenza and pneumonia.","translation":"その患者はインフルエンザと肺炎を伴う重複感染と診断された。"},{"sentence":"Multiinfection can complicate treatment strategies.","translation":"重複感染は治療戦略を複雑にする可能性がある。"}],"collocations":["severe multiinfection","opportunistic multiinfection"],"synonyms":["coinfection","polymicrobial infection"],"antonyms":["single infection","mono-infection"]}],"etymology":{"value":"\"multi-\" (多くの) + \"infection\" (感染)","priority":"★★★"},"pronunciation":{"ipa":"/ˌmʌltɪɪnˈfekʃən/","syllables":"mul-ti-in-fec-tion"},"inflection":{"noun_plural":"multiinfections"},"usage_notes":{"explanation":"\"Multiinfection\" refers to the presence of more than one infection in the same individual at the same time. It's often used in medical contexts to describe situations where a patient is suffering from several diseases simultaneously.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The multiinfection was cause by one virus.","correct":"✓ The multiinfection was caused by multiple viruses.","note":"Multiinfections are caused by more than one pathogen."}],"priority":"★★★"},"related_words":{"derivatives":["multiinfectious (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Multiinfection\" is a term used in medical and scientific contexts to describe the simultaneous presence of multiple infections in an individual. This term is typically encountered in discussions related to infectious diseases, epidemiology, and clinical medicine. Understanding the concept of multiinfection is important for healthcare professionals and researchers dealing with complex cases of infectious diseases."},"example_sentences":[{"sentence":"The study investigated the prevalence of multiinfection in immunocompromised patients.","translation":"その研究では、免疫不全患者における重複感染の有病率を調査した。","type":"scientific research","meaning_category":"medical"},{"sentence":"Effective management of multiinfection requires a comprehensive diagnostic approach.","translation":"重複感染の効果的な管理には、包括的な診断アプローチが必要である。","type":"medical treatment","meaning_category":"medical"}]}