{"word":"contradistinctly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"対照的に、区別して、明確に区別して","english_definition":"In a way that is clearly distinguished from or contrasted with something else.","examples":[{"sentence":"The two concepts, while related, should be treated contradistinctly.","translation":"二つの概念は関連しているものの、対照的に扱うべきです。"},{"sentence":"The artist portrayed the figures contradistinctly, emphasizing their individual characteristics.","translation":"その芸術家は人物像を明確に区別して描き、それぞれの個性を強調しました。"}],"collocations":["treat something contradistinctly","portray something contradistinctly"],"synonyms":["distinctly","separately","contrastingly","differently","uniquely"],"antonyms":["similarly","identically","uniformly","in the same way"]}],"etymology":{"value":"The word is formed by combining \"contra-\" (against), \"distinctly\" (clearly distinguished), and the adverbial suffix \"-ly.\" It implies a manner of distinguishing something in opposition to something else.","priority":"★★☆"},"pronunciation":{"ipa":"ˌkɒntrədɪˈstɪŋktli","syllables":"con-tra-di-stinct-ly"},"inflection":{"notes":"As an adverb, it does not have different forms."},"usage_notes":{"explanation":"\"Contradistinctly\" is used to emphasize a clear and intentional differentiation between two or more things. It suggests that the distinction is important and should be maintained. It is a relatively formal word and is not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The colors were contradistinctly similar.","correct":"✓ The colors were distinctly similar.","note":"\"Contradistinctly\" implies contrast, so it cannot be used with \"similar.\" Use \"distinctly\" or another appropriate adverb instead."},{"incorrect":"✗ He contradistinctly explained the theory.","correct":"✓ He distinctly explained the theory.","note":"If the intention is to say that the explanation was clear, use \"distinctly.\" \"Contradistinctly\" should be used when comparing two different things."}],"priority":"★☆☆"},"related_words":{"derivatives":["contradistinction (noun): the act of distinguishing by contrast","distinct (adjective): clearly different; separate","distinctly (adverb): clearly; plainly; recognizably"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Contradistinctly\" is a formal and uncommon word that means to do something in a way that clearly shows the difference or contrast between things. It's used when you want to emphasize that things are intentionally being kept separate and distinct. Because it's not a common word, it's generally used in academic or formal writing."},"example_sentences":[{"sentence":"The author treated the historical events and fictional elements contradistinctly, maintaining a clear separation between them.","translation":"著者は歴史的な出来事とフィクションの要素を対照的に扱い、それらの明確な区別を維持しました。","type":"adverb","meaning_category":"対照的に"},{"sentence":"The lawyer presented the evidence contradistinctly, highlighting the differences in the testimonies.","translation":"弁護士は証拠を明確に区別して提示し、証言の相違点を強調しました。","type":"adverb","meaning_category":"区別して"}]}