{"word":"radioscopy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"透視検査、X線透視","english_definition":"examination of the internal structure of opaque objects by means of X-rays or gamma rays. The image is viewed on a fluorescent screen or displayed on a monitor.","examples":[{"sentence":"Radioscopy is used in medical diagnostics to view bones and organs.","translation":"透視検査は、骨や臓器を見るために医療診断で使用されます。"},{"sentence":"Industrial radioscopy can detect flaws in manufactured products.","translation":"工業用透視検査は、製造された製品の欠陥を検出できます。"}],"collocations":["medical radioscopy","industrial radioscopy","real-time radioscopy","digital radioscopy"],"synonyms":["fluoroscopy","X-ray examination","radiography"],"antonyms":[]}],"etymology":{"value":"From 'radio-' (referring to radiation) + '-scopy' (referring to viewing or examination).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌreɪdiˈɒskəpi/","syllables":"ra-di-os-co-py"},"inflection":{"noun_plural":"radioscopies"},"usage_notes":{"explanation":"Radioscopy is a technique that uses X-rays or gamma rays to view the internal structure of an object in real-time. It is often used interchangeably with fluoroscopy, especially in medical contexts. In industrial settings, it is used for non-destructive testing to identify defects in materials and products.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Radioscopy is when they take a picture of your bones.","correct":"✓ Radioscopy is when they look at your bones using X-rays in real-time.","note":"Radioscopy is a real-time viewing technique, unlike radiography which produces a static image. "},{"incorrect":"✗ Radioscopy is safe because there's no radiation.","correct":"✓ Radioscopy uses radiation, so precautions must be taken.","note":"Radioscopy involves radiation, so safety measures are essential."}],"priority":"★★☆"},"related_words":{"derivatives":["radioscopic (adjective)"],"phrasal_verbs":[],"related_terms":["radiography","fluoroscopy","X-ray","gamma ray","non-destructive testing"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Radioscopy is a specialized term referring to a real-time imaging technique using X-rays or gamma rays. It's commonly used in medicine (fluoroscopy) and industry for non-destructive testing. Understanding requires familiarity with medical and technical contexts."},"example_sentences":[{"sentence":"The doctor used radioscopy to guide the catheter during the procedure.","translation":"医師は、処置中にカテーテルを誘導するために透視検査を使用しました。","type":"noun","meaning_category":"medical imaging"},{"sentence":"Radioscopy revealed a crack in the metal casting.","translation":"透視検査により、金属鋳物に亀裂があることが明らかになりました。","type":"noun","meaning_category":"industrial inspection"}]}