{"word":"heart-deadened","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"心が麻痺した、感情が鈍くなった、心が死んだような","english_definition":"Having lost the capacity to feel emotion, especially love, compassion, or sympathy; emotionally numb or unresponsive.","examples":[{"sentence":"After years of hardship, he became heart-deadened to the suffering of others.","translation":"長年の苦難の後、彼は他者の苦しみに対して心が麻痺してしまった。"},{"sentence":"The constant betrayal left her feeling heart-deadened and unable to trust anyone.","translation":"絶え間ない裏切りによって、彼女は心が麻痺し、誰も信じられなくなった。"},{"sentence":"He walked through the city with a heart-deadened gaze, untouched by its beauty or its sorrow.","translation":"彼はその美しさにも悲しみにも心を動かされることなく、心が死んだような目で街を歩いた。"}],"collocations":["become heart-deadened","feel heart-deadened","heart-deadened gaze","heart-deadened expression","heart-deadened soul"],"synonyms":["numb","apathetic","callous","insensitive","unfeeling","emotionless","desensitized","indifferent","detached","alienated"],"antonyms":["compassionate","empathetic","sensitive","caring","feeling","responsive","warmhearted","kindhearted","sympathetic","tenderhearted"]}],"etymology":{"value":"The word is a compound adjective formed by combining \"heart\" (referring to emotions or feelings) and \"deadened\" (meaning made numb or insensitive). The combination suggests a state where the emotional capacity of the heart has been diminished or extinguished.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɑːrtˌdɛdənd/","syllables":"heart-dead-ened"},"inflection":{"notes":"Adjective; does not have plural forms or comparative/superlative degrees."},"usage_notes":{"explanation":"\"Heart-deadened\" is a descriptive adjective used to convey a profound loss of emotional responsiveness. It suggests a state of emotional numbness or insensitivity, often resulting from trauma, prolonged hardship, or repeated disappointment. The term implies that the person has become detached from their feelings and is unable to experience emotions such as love, compassion, or sympathy in the same way they once did. It is a stronger term than simply \"sad\" or \"unhappy,\" indicating a more profound and lasting emotional state.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was heart-deadened of the tragedy.","correct":"✓ He was heart-deadened by the tragedy.","note":"Use \"by\" to indicate the cause of the heart-deadened state. Other prepositions may be grammatically incorrect or change the meaning."},{"incorrect":"✗ She felt heart-deadened, so she started to cry.","correct":"✓ She felt heart-deadened, unable to cry even though she wanted to.","note":"Heart-deadened implies an inability to feel or express emotion, including sadness or grief. Crying would contradict the meaning of the word."},{"incorrect":"✗ The heart-deadened man was full of joy.","correct":"✓ The heart-deadened man showed no signs of joy.","note":"Being full of joy contradicts the meaning of heart-deadened, which implies an absence of positive emotions."}],"priority":"★★☆"},"related_words":{"derivatives":["heart (noun)","deadened (adjective, past participle of 'deaden')","deadening (adjective, present participle of 'deaden')","dead (adjective)"],"phrases":["dead to the world","cold-hearted","hard-hearted","numbed","emotionally unavailable"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Rare and sophisticated vocabulary)","frequency_google_ngram":"Low frequency (relatively uncommon)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Heart-deadened\" is a relatively uncommon and sophisticated term used to describe a state of emotional numbness or insensitivity. It suggests a profound loss of the ability to feel emotions, particularly love, compassion, or sympathy. This term is often used in literature or formal writing to convey a deep sense of emotional detachment or alienation. Understanding this word requires a strong grasp of emotional vocabulary and the ability to recognize nuanced meanings. It is not typically encountered in everyday conversation or basic English texts."},"example_sentences":[{"sentence":"The war had left him heart-deadened, unable to feel joy or sorrow.","translation":"戦争は彼を心が麻痺した状態にし、喜びも悲しみも感じられなくさせた。","type":"adjective","meaning_category":"Emotionally numb"},{"sentence":"Her voice was flat and heart-deadened as she recounted the tragic events.","translation":"彼女が悲劇的な出来事を語る声は平板で、感情がこもっていなかった。","type":"adjective","meaning_category":"Emotionless"},{"sentence":"He wandered through life with a heart-deadened indifference to the world around him.","translation":"彼は周りの世界に対して心が麻痺した無関心さを持って人生をさまよった。","type":"adjective","meaning_category":"Apathetic"}]}