{"word":"anticoagulated","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(血液が)凝固防止処理された、抗凝固剤で処理された","english_definition":"(of blood) having had an anticoagulant added to prevent clotting.","examples":[{"sentence":"The anticoagulated blood sample was sent to the lab for testing.","translation":"凝固防止処理された血液サンプルは、検査のために研究室に送られた。"},{"sentence":"Anticoagulated plasma is required for certain diagnostic procedures.","translation":"特定の診断手順には、抗凝固剤で処理された血漿が必要である。"}],"collocations":["anticoagulated blood","anticoagulated plasma","anticoagulated sample"],"synonyms":["unclotted","non-coagulated"],"antonyms":["coagulated","clotted"]}],"etymology":{"value":"The word \"anticoagulated\" is formed by adding the suffix \"-ed\" to the verb \"anticoagulate.\" \"Anticoagulate\" itself is formed from the prefix \"anti-\" (meaning \"against\") and the verb \"coagulate\" (meaning \"to clot\").","priority":"★★☆"},"pronunciation":{"ipa":"ˌæntiːkoʊˈæɡjʊleɪtɪd","syllables":"an-ti-co-ag-u-lat-ed"},"inflection":{"adjective_forms":{"comparative":null,"superlative":null}},"usage_notes":{"explanation":"\"Anticoagulated\" is primarily used in medical and scientific contexts to describe blood or blood products that have been treated with substances to prevent them from clotting. It is often used in laboratory procedures, blood transfusions, and medical research where maintaining the blood in a liquid state is essential.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The anti-coagulated blood.","correct":"✓ The anticoagulated blood.","note":"The hyphen is generally omitted in \"anticoagulated\"."}],"priority":"★★☆"},"related_words":{"derivatives":["anticoagulant (noun, adjective): a substance that prevents blood from clotting.","anticoagulation (noun): the process of preventing blood from clotting.","coagulate (verb): to change from a liquid to a thickened or solid state.","coagulation (noun): the process of blood clotting."],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in specialized medical and scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"anticoagulated\" is a technical term predominantly used in medical and scientific fields. It describes blood or blood products that have undergone a process to prevent clotting. Understanding this term requires familiarity with medical terminology related to blood and coagulation. It is not commonly used in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The patient's blood was anticoagulated with heparin to prevent further thrombus formation.","translation":"患者の血液は、さらなる血栓形成を防ぐためにヘパリンで凝固防止処理された。","type":"adjective","meaning_category":"Medical"},{"sentence":"Anticoagulated whole blood is necessary for accurate complete blood count (CBC) analysis.","translation":"正確な全血球計算（CBC）分析には、凝固防止処理された全血が必要である。","type":"adjective","meaning_category":"Scientific"},{"sentence":"The research team used anticoagulated samples to study the effects of a new drug on platelet aggregation.","translation":"研究チームは、新しい薬剤が血小板凝集に与える影響を研究するために、凝固防止処理されたサンプルを使用した。","type":"adjective","meaning_category":"Research"}]}