{"word":"Androgynia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"両性具有、男女両方の特徴を併せ持つこと","english_definition":"The combination of masculine and feminine characteristics into an ambiguous form. It may be expressed concerning biological sex, gender identity, gender expression, or sexual orientation.","examples":[{"sentence":"The model's androgynia made them highly sought after in the fashion industry.","translation":"そのモデルの両性具有的な外見は、ファッション業界で非常に人気を集めた。"},{"sentence":"Androgynia challenges traditional notions of gender.","translation":"両性具有は、伝統的なジェンダーの概念に挑戦する。"}],"collocations":["exhibit androgynia (両性具有を示す)","explore androgynia (両性具有を探求する)","artistic androgynia (芸術的な両性具有)","fashion androgynia (ファッションにおける両性具有)"],"synonyms":["gender ambiguity","gender neutrality","gender blending","unisexuality"],"antonyms":["gender conformity","gender distinctiveness","gender polarization"]}],"etymology":{"value":"Derived from the Greek words 'andro-' (meaning male) and '-gyn-' (meaning female), combined with the suffix '-ia' (denoting a condition or state).","priority":"★★★"},"pronunciation":{"ipa":"ˌændrəˈdʒɪniə","syllables":"An-dro-gyn-i-a"},"inflection":{"noun_plural":"androgynias (rarely used)"},"usage_notes":{"explanation":"'Androgynia' refers to the presence or combination of both masculine and feminine characteristics. It can manifest in various ways, including physical appearance, behavior, and self-identification. It is often used in discussions about gender identity, gender expression, and sexuality, and it challenges traditional binary notions of gender.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has androgynous.","correct":"✓ He has androgynia. / ✓ He is androgynous.","note":"'Androgynia' is a noun, while 'androgynous' is an adjective. Be careful to use the correct form. 'He has androgynia' refers to him possessing the characteristic of androgyny. 'He is androgynous' describes him as having androgynous qualities."},{"incorrect":"✗ Androgynia is a sexual orientation.","correct":"✓ Androgynia is a gender expression or identity.","note":"Androgynia is not a sexual orientation. It relates to gender expression or identity, not who someone is attracted to."}],"priority":"★★☆"},"related_words":{"derivatives":["androgynous (adjective)","androgyn (noun, referring to a person exhibiting androgynia)"],"phrases":["gender fluidity","genderqueer","non-binary"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency. More common in academic and specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Androgynia' is a term used to describe the combination of both masculine and feminine characteristics. It is often discussed in the context of gender studies, fashion, and art. The term challenges traditional binary notions of gender and can be used to describe individuals who do not conform to conventional gender roles or expressions. It is important to note that androgynia is not the same as sexual orientation; rather, it relates to gender identity and expression."},"example_sentences":[{"sentence":"The singer's androgynia was a key element of their stage persona.","translation":"その歌手の両性具有的な外見は、彼らのステージ上の個性の重要な要素だった。","type":"noun","meaning_category":"appearance"},{"sentence":"The designer's collection explored themes of androgynia and gender fluidity.","translation":"そのデザイナーのコレクションは、両性具有とジェンダー・フルイディティのテーマを探求した。","type":"noun","meaning_category":"theme"},{"sentence":"Some people feel that androgynia allows for a more authentic expression of self.","translation":"両性具有は、より本質的な自己表現を可能にすると感じる人もいる。","type":"noun","meaning_category":"identity"}]}