{"word":"infarction","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"梗塞（こうそく）","english_definition":"The obstruction of the blood supply to an organ or region of tissue, typically by a thrombus or embolus, causing local death of the tissue.","examples":[{"sentence":"Myocardial infarction is a serious condition.","translation":"心筋梗塞は深刻な状態です。"},{"sentence":"Cerebral infarction can lead to stroke.","translation":"脳梗塞は脳卒中につながる可能性があります。"},{"sentence":"The infarction caused irreversible damage to the organ.","translation":"梗塞は臓器に不可逆的な損傷を引き起こしました。"}],"collocations":["myocardial infarction (心筋梗塞)","cerebral infarction (脳梗塞)","pulmonary infarction (肺梗塞)","renal infarction (腎梗塞)","splenic infarction (脾梗塞)","cause an infarction (梗塞を引き起こす)","suffer an infarction (梗塞を起こす)"],"synonyms":["ischemia","necrosis","thrombosis","embolism"],"antonyms":["reperfusion","angiogenesis"]}],"etymology":{"value":"From Latin *infarcire* 'to stuff in', from *in-* 'in' + *farcire* 'to stuff'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈfɑːrkʃən/","syllables":"in-farc-tion"},"inflection":{"noun_plural":"infarctions"},"usage_notes":{"explanation":"'Infarction' refers to the process of tissue death (necrosis) resulting from a blockage in the blood supply. It is commonly used in medical contexts to describe conditions like heart attacks (myocardial infarction) and strokes (cerebral infarction). The term emphasizes the obstruction and the subsequent tissue damage.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor said I had an infection in my heart, it was an infarction.","correct":"✓ The doctor said I had an infarction in my heart.","note":"Infarction is not an infection; it's tissue death due to lack of blood supply. Infection is caused by pathogens. Use 'infarction' to specifically describe the blockage and tissue death."},{"incorrect":"✗ Infarction is when the heart beats too fast.","correct":"✓ Infarction is tissue death caused by a lack of blood supply, often due to a blockage in an artery.","note":"Infarction is not related to heart rate. It is about blood supply obstruction and subsequent tissue damage."}],"priority":"★★☆"},"related_words":{"derivatives":["infarct (noun: 梗塞巣; verb: 梗塞を起こす)","infarcted (adjective: 梗塞を起こした)"],"medical_terms":["ischemic stroke","thromboembolism","atherosclerosis","angina pectoris","cardiac arrest"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency; primarily a medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Infarction' is a medical term referring to the death of tissue resulting from a blockage of blood supply. It's crucial to understand that it's not an infection but rather a consequence of ischemia (lack of blood flow). The term is most often encountered in discussions about heart attacks (myocardial infarction) and strokes (cerebral infarction). Understanding this term is important for comprehending serious medical conditions and their causes."},"example_sentences":[{"sentence":"Early diagnosis is crucial in limiting the extent of the infarction.","translation":"早期診断は梗塞の範囲を制限するために重要です。","type":"noun","meaning_category":"梗塞"},{"sentence":"The patient suffered a severe myocardial infarction.","translation":"患者は重度の心筋梗塞を起こしました。","type":"noun","meaning_category":"梗塞"},{"sentence":"The infarcted tissue was removed during surgery.","translation":"梗塞を起こした組織は手術中に除去されました。","type":"adjective","meaning_category":"梗塞を起こした"}]}