{"word":"Schizanthus","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"キンギョソウ属の一種、胡蝶草（コチョウソウ）","english_definition":"Any plant of the genus Schizanthus, especially Schizanthus pinnatus, cultivated for its showy, intricately patterned flowers resembling butterflies.","examples":[{"sentence":"The garden was filled with colorful Schizanthus flowers.","translation":"庭は色とりどりの胡蝶草の花でいっぱいだった。"},{"sentence":"Schizanthus is a popular choice for adding vibrant color to borders and containers.","translation":"胡蝶草は、花壇やコンテナに鮮やかな色を加えるのに人気がある。"}],"collocations":["grow Schizanthus (胡蝶草を育てる)","Schizanthus pinnatus (羽状胡蝶草)","Schizanthus flower (胡蝶草の花)"],"synonyms":["butterfly flower","poor man's orchid"],"antonyms":[]}],"etymology":{"value":"From Greek 'schizein' (to split) + 'anthos' (flower), referring to the split petals of the flower.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌskɪˈzænθəs/","syllables":"skiz-an-thus"},"inflection":{"noun_plural":"Schizanthus or Schizanthuses"},"usage_notes":{"explanation":"'Schizanthus' refers to a genus of flowering plants, commonly known as butterfly flowers or poor man's orchids due to their resemblance to butterflies and orchids, respectively. They are popular ornamental plants, often grown for their brightly colored and intricately patterned flowers.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Schizanthus are easy to grow from seed.","correct":"✓ Schizanthus is easy to grow from seed.","note":"When referring to the genus in general, use the singular form 'Schizanthus' with a singular verb."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - primarily used in gardening and botanical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Schizanthus' is a botanical term referring to a genus of flowering plants. It is primarily encountered in gardening, horticulture, and botanical contexts. The term may not be familiar to general audiences. Understanding the term requires some knowledge of plant taxonomy or gardening practices."},"example_sentences":[{"sentence":"The delicate blooms of the Schizanthus added a touch of elegance to the display.","translation":"胡蝶草の繊細な花は、展示に優雅さを添えた。","type":"noun","meaning_category":"flower"},{"sentence":"Many gardeners appreciate Schizanthus for its long blooming period.","translation":"多くの園芸家は、胡蝶草の開花期間が長いことを評価している。","type":"noun","meaning_category":"flower"},{"sentence":"Schizanthus plants require well-drained soil and partial shade to thrive.","translation":"胡蝶草は、生育のために水はけの良い土壌と半日陰を必要とする。","type":"noun","meaning_category":"flower"}]}