{"word":"Hilara","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A genus of dance flies (Diptera: Empididae).","english_definition":"A genus of flies in the family Empididae, known as dance flies or balloon flies. They are characterized by their elaborate courtship rituals, often involving the males presenting the females with prey wrapped in silk.","examples":[{"sentence":"The male Hilara sartor presents the female with a silk balloon during courtship.","translation":"オスのHilara sartorは求愛中にメスに絹の風船を贈ります。"}],"collocations":["Hilara maura","Hilara sartor","dance fly","balloon fly","Empididae"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from Greek, possibly related to 'hilaros' meaning cheerful or merry, perhaps referencing the lively courtship dances of these flies.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɪlərə/","syllables":"Hi-la-ra"},"inflection":{},"usage_notes":{"explanation":"'Hilara' is a scientific term used in entomology to classify a specific group of dance flies. It is typically encountered in scientific literature or discussions related to insect taxonomy and behavior.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Empididae (family)","Diptera (order)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Hilara' is a scientific term used specifically in the field of entomology. Understanding its meaning requires familiarity with biological classification and the study of insects. It is not commonly used outside of scientific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"Researchers studied the mating behavior of Hilara species in the field.","translation":"研究者たちは野外でHilara種の交尾行動を研究しました。","type":"scientific","meaning_category":"taxonomy"},{"sentence":"The genus Hilara is known for its complex courtship rituals.","translation":"Hilara属は複雑な求愛儀式で知られています。","type":"scientific","meaning_category":"taxonomy"}]}