{"word":"Mehtarship","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The position, office, or tenure of a Mehtar.","english_definition":"The office, position, or period of holding office of a Mehtar (chief or ruler).","examples":[{"sentence":"During his Mehtarship, the region saw significant economic growth.","translation":"彼のメフタルシップの間、その地域は著しい経済成長を遂げた。"},{"sentence":"The transfer of Mehtarship was a peaceful and orderly process.","translation":"メフタルシップの移譲は平和的かつ秩序立ったプロセスだった。"}],"collocations":["transfer of Mehtarship","assume Mehtarship","end of Mehtarship"],"synonyms":["chieftainship","leadership","rule","governance"],"antonyms":["subordination","following"]},{"part_of_speech":"noun","definition":"The territory or area governed by a Mehtar.","english_definition":"The territory or area under the rule or jurisdiction of a Mehtar.","examples":[{"sentence":"The Mehtarship included several villages and surrounding farmland.","translation":"そのメフタルシップはいくつかの村と周辺の農地を含んでいた。"},{"sentence":"The boundaries of the Mehtarship were clearly defined by ancient treaties.","translation":"そのメフタルシップの境界は古代の条約によって明確に定められていた。"}],"collocations":["boundaries of the Mehtarship","within the Mehtarship"],"synonyms":["territory","domain","realm","jurisdiction"],"antonyms":[]}],"etymology":{"value":"Derived from 'Mehtar,' a title of Persian origin meaning 'chief' or 'prince,' combined with the suffix '-ship,' indicating a position, office, or state of being.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɛhtərʃɪp/","syllables":"Meh-tar-ship"},"inflection":{"noun_plural":"Mehtarships"},"usage_notes":{"explanation":"'Mehtarship' refers to the role, period in office, or the area governed by a 'Mehtar,' which is a historical title for a chief or ruler, particularly in some regions of Central Asia or the Indian subcontinent. It is not a commonly used word in modern English, and its usage is typically limited to historical or cultural contexts when discussing specific regions or titles.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was the Mehtar, so he had Mehtarship.","correct":"✓ He held the Mehtarship.","note":"While technically correct, it's more natural to say someone \"held the Mehtarship\" rather than \"had Mehtarship.\""},{"incorrect":"✗ The Mehtarship was very popularity.","correct":"✓ The Mehtarship was very popular.","note":"'Popularity' is a noun, while 'popular' is an adjective. The Mehtarship can be popular, but it doesn't have popularity."}],"priority":"★★☆"},"related_words":{"derivatives":["Mehtar"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Very rare - not typically found in language learning contexts)","frequency_google_ngram":"Very low frequency - Primarily used in specific historical or regional contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Mehtarship' is a niche term primarily encountered in historical or cultural discussions related to specific regions where the title 'Mehtar' was used for a chief or ruler. Understanding this term requires familiarity with historical titles and governance structures, making it suitable for advanced learners or those with specific interests in these areas."},"example_sentences":[{"sentence":"The documents detailed the responsibilities associated with the Mehtarship.","translation":"その文書はメフタルシップに伴う責任について詳述していた。","type":"noun","meaning_category":"position/office"},{"sentence":"The stability of the region depended on the wise leadership during his Mehtarship.","translation":"その地域の安定は、彼のメフタルシップ中の賢明なリーダーシップにかかっていた。","type":"noun","meaning_category":"tenure"},{"sentence":"The Mehtarship's borders were often contested by neighboring tribes.","translation":"そのメフタルシップの国境は、しばしば近隣の部族によって争われた。","type":"noun","meaning_category":"territory"}]}