{"word":"theorem","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(数学・論理学における)定理","english_definition":"a general proposition which is not self-evident but has been or can be proved from accepted premises and so is established as a law or principle.","examples":[{"sentence":"Pythagoras' theorem states that in a right-angled triangle, the square of the hypotenuse is equal to the sum of the squares of the other two sides.","translation":"ピタゴラスの定理は、直角三角形において、斜辺の二乗は他の二辺の二乗の和に等しいと述べている。"},{"sentence":"The fundamental theorem of calculus connects differentiation and integration.","translation":"微積分学の基本定理は、微分と積分を結びつけている。"},{"sentence":"He proved a new theorem in number theory.","translation":"彼は数論において新しい定理を証明した。"}],"collocations":["prove a theorem (定理を証明する)","state a theorem (定理を述べる)","apply a theorem (定理を適用する)","fundamental theorem (基本定理)","important theorem (重要な定理)"],"synonyms":["proposition","principle","law","rule","formula","axiom","postulate","lemma","corollary"],"antonyms":["axiom","postulate (証明なしに正しいと仮定されるもの)"]}],"etymology":{"value":"Late Middle English: from late Latin *theorema*, from Greek *theōrēma* ‘speculation, proposition regarded as true’, from *theōrein* ‘look at’ (related to *theōros* ‘spectator’).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈθɪərəm/","syllables":"the-o-rem"},"inflection":{"noun_plural":"theorems"},"usage_notes":{"explanation":"A **theorem** is a statement in mathematics or logic that has been proven to be true based on previously established statements, such as axioms, postulates, and other theorems. A theorem is more significant than a lemma (a minor result used in proving a larger theorem) or a corollary (a result that follows directly from a theorem). The process of proving a theorem involves logical deduction and rigorous argumentation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The theory is a theorem that has been proven.","correct":"✓ The theorem is a theory that has been proven.","note":"A **theorem** is a proven statement, while a **theory** is a well-substantiated explanation of some aspect of the natural world that can incorporate facts, laws, inferences, and tested hypotheses. They are different concepts. A theorem is specific to math and logic, while a theory is used in broader scientific contexts."},{"incorrect":"✗ He believes the theorem, but it hasn't been proven.","correct":"✓ He conjectures the statement, but it hasn't been proven. / ✓ He hypothesizes the statement, but it hasn't been proven.","note":"A **theorem** is, by definition, a proven statement. If it's not proven, it's a conjecture or a hypothesis."}],"priority":"★★☆"},"related_words":{"derivatives":["theoretical (形容詞: 理論的な)","theoretically (副詞: 理論的に)","theorize (動詞: 理論化する)"],"related_terms":["axiom (公理)","postulate (公準)","lemma (補題)","corollary (系)","proof (証明)","hypothesis (仮説)","conjecture (予想)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 主に数学や論理学の分野で使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**theorem**」は、数学や論理学で使われる言葉で、「定理」と訳されます。これは、すでに正しいと認められていること（例えば、公理）を使って証明された、正しいと認められる命題のことです。ピタゴラスの定理のように、数学の問題を解くために使われることが多いです。定理を理解するには、数学的な知識と論理的な思考力が必要です。"},"example_sentences":[{"sentence":"The **theorem** provides a powerful tool for solving geometric problems.","translation":"その定理は、幾何学の問題を解くための強力なツールを提供する。","type":"general","meaning_category":"数学"},{"sentence":"Before applying the **theorem**, we need to verify that the conditions are met.","translation":"その定理を適用する前に、条件が満たされていることを確認する必要がある。","type":"application","meaning_category":"数学"},{"sentence":"The proof of the **theorem** is quite complex and requires advanced mathematical knowledge.","translation":"その定理の証明は非常に複雑で、高度な数学的知識を必要とする。","type":"proof","meaning_category":"数学"},{"sentence":"This **theorem** is fundamental to understanding the behavior of these equations.","translation":"この定理は、これらの方程式の挙動を理解する上で基本となる。","type":"importance","meaning_category":"数学"}]}