{"word":"Astrophotometry","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"天体写真測光法：天体の写真画像から、その明るさを精密に測定する天文学の技術。","english_definition":"The technique in astronomy of precisely measuring the brightness of celestial objects from their photographic images.","examples":[{"sentence":"Astrophotometry is used to determine the magnitudes and colors of stars.","translation":"天体写真測光法は、星の等級と色を決定するために使用されます。"},{"sentence":"Modern astrophotometry often utilizes CCD cameras for high-precision measurements.","translation":"現代の天体写真測光法では、高精度の測定のためにCCDカメラがよく使用されます。"}],"collocations":["perform astrophotometry","apply astrophotometry","CCD astrophotometry","high-precision astrophotometry"],"synonyms":["photometry","stellar photometry"],"antonyms":[]}],"etymology":{"value":"\"Astro-\" (星) + \"photometry\" (測光法) から構成される。","priority":"★★★"},"pronunciation":{"ipa":"/ˌæstroʊfoʊˈtɑːmətri/","syllables":"as-tro-pho-tom-e-try"},"inflection":{"noun_plural":"astrophotometries"},"usage_notes":{"explanation":"Astrophotometry is a branch of astronomy that deals with measuring the brightness of celestial objects from photographic images. It is used to determine the magnitudes (brightness) and colors of stars, galaxies, and other celestial objects. Modern astrophotometry often employs CCD (charge-coupled device) cameras to obtain high-precision measurements.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Astrophotometry are used to measure the brightness.","correct":"✓ Astrophotometry is used to measure the brightness.","note":"Astrophotometry is a singular noun, so it takes a singular verb ('is')."},{"incorrect":"✗ Astrophotometry measures only the position of stars.","correct":"✓ Astrophotometry measures the brightness of stars.","note":"Astrophotometry primarily measures the brightness (flux) of stars, not their position (that's astrometry)."}],"priority":"★★☆"},"related_words":{"derivatives":["astrophotometric (adjective)"],"phrasal_verbs":[],"related_terms":["astronomy","photometry","spectroscopy","CCD","magnitude","flux"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"Astrophotometry is a specialized term in astronomy referring to the precise measurement of the brightness of celestial objects using photographic images. It involves techniques to determine the magnitude and color of stars and other celestial bodies. This term is typically encountered in advanced astronomical studies and research contexts."},"example_sentences":[{"sentence":"The researchers used astrophotometry to analyze the light curves of variable stars.","translation":"研究者たちは、変光星の光度曲線を分析するために天体写真測光法を使用しました。","type":"noun","meaning_category":"astronomy technique"},{"sentence":"Accurate astrophotometry is crucial for understanding the properties of distant galaxies.","translation":"正確な天体写真測光法は、遠方銀河の特性を理解するために不可欠です。","type":"noun","meaning_category":"astronomy technique"}]}