{"word":"vanpool","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"相乗りバン、バンを共同利用する通勤形態","english_definition":"A group of people who commute together on a regular basis in a van, typically sharing the cost of fuel and maintenance.","examples":[{"sentence":"Our company encourages employees to join a vanpool to reduce traffic congestion.","translation":"当社は、交通渋滞を緩和するために、従業員が相乗りバンに参加することを推奨しています。"},{"sentence":"She saves a lot of money each month by participating in a vanpool.","translation":"彼女は相乗りバンに参加することで、毎月多くのお金を節約しています。"},{"sentence":"The vanpool picks up members at designated locations each morning.","translation":"相乗りバンは毎朝、指定された場所でメンバーを乗せていきます。"}],"collocations":["join a vanpool (相乗りバンに参加する)","start a vanpool (相乗りバンを始める)","vanpool program (相乗りバンプログラム)","vanpool lane (相乗りバン専用レーン)"],"synonyms":["carpool","rideshare"],"antonyms":["single-occupancy vehicle"],"related_terms":["commute","car","van","transportation","environment"],"notes":"Vanpools typically involve 5 to 15 people sharing a van. They are often organized by employers, government agencies, or private companies.","image_url":"https://example.com/vanpool_image.jpg"}],"etymology":{"value":"A combination of 'van' (a type of vehicle) and 'pool' (referring to a shared resource or activity).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvænpuːl/","syllables":"van-pool"},"inflection":{"noun_plural":"vanpools"},"usage_notes":{"explanation":"A vanpool is a specific type of ridesharing arrangement that uses a van, as opposed to a regular car. It's often used for longer commutes and involves a more formal agreement among the participants.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I take a vanpool to work, it's very cheap.","correct":"✓ I take a vanpool to work; it's very cheap.","note":"Use a semicolon to connect two independent clauses. Alternatively, use 'because' or 'since' to connect the ideas."},{"incorrect":"✗ He drives the vanpool every day, so he gets paid.","correct":"✓ He drives the vanpool every day, so he gets reimbursed for expenses.","note":"Vanpool drivers are usually reimbursed for expenses, not paid a salary."}],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'vanpool' refers to a specific arrangement where a group of people regularly commute together in a van, sharing the costs. It's a more organized and larger-scale version of carpooling, often involving a designated driver and a set route. Understanding this term is useful when discussing transportation, environmental issues, or commuting options."},"example_sentences":[{"sentence":"The city offers incentives for companies that establish employee **vanpool** programs.","translation":"その市は、従業員の相乗りバンプログラムを確立する企業にインセンティブを提供しています。","type":"noun","meaning_category":"相乗りバン"},{"sentence":"Our **vanpool** has reduced our carbon footprint significantly.","translation":"私たちの相乗りバンは、二酸化炭素排出量を大幅に削減しました。","type":"noun","meaning_category":"相乗りバン"},{"sentence":"The **vanpool** is a great way to socialize with colleagues during the commute.","translation":"相乗りバンは、通勤中に同僚と交流するのに最適な方法です。","type":"noun","meaning_category":"相乗りバン"}]}