{"word":"spheroidizing","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"球状化処理する","english_definition":"To heat (steel or cast iron) to a suitable temperature and hold at that temperature for a sufficient time, followed by slow cooling, to produce a spheroidal or globular form of carbide in the iron matrix.","examples":[{"sentence":"The steel was spheroidized to improve its machinability.","translation":"その鋼は被削性を向上させるために球状化処理された。"}],"collocations":["spheroidizing annealing","isothermal spheroidizing"],"synonyms":["softening","annealing"],"antonyms":["hardening"]},{"part_of_speech":"noun","definition":"球状化処理","english_definition":"A type of annealing process applied to high-carbon steels to make them softer and more ductile.","examples":[{"sentence":"Spheroidizing is a common heat treatment for tool steels.","translation":"球状化処理は工具鋼によく用いられる熱処理である。"}],"collocations":["perform spheroidizing","spheroidizing process"],"synonyms":["spheroidization"],"antonyms":["hardening"]}],"etymology":{"value":"From 'spheroid' (a shape resembling a sphere) + '-ize' (to make or become) + '-ing' (present participle/gerund suffix).","priority":"★★★"},"pronunciation":{"ipa":"/ˈsfɪərɔɪdaɪzɪŋ/","syllables":"spher-oid-iz-ing"},"inflection":{"verb_forms":{"present_participle":"spheroidizing","gerund":"spheroidizing"},"noun_plural":null},"usage_notes":{"explanation":"Spheroidizing is a specific type of heat treatment used primarily on high-carbon steels and cast irons. It aims to improve the material's ductility and machinability by altering the microstructure of the carbides present. The process involves heating the metal to a temperature just below its critical point, holding it there for an extended period, and then slowly cooling it. This causes the cementite (iron carbide) to form into spherical or globular shapes within the ferrite matrix, making the metal softer and easier to work with.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The spheroidizing makes the steel harder.","correct":"✓ The spheroidizing makes the steel softer.","note":"Spheroidizing is a softening process, not a hardening one."}],"priority":"★★☆"},"related_words":{"derivatives":["spheroidize","spheroidized","spheroidization"],"related_terms":["annealing","heat treatment","carbide","ferrite","cementite"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Technical vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Spheroidizing' refers to a heat treatment process applied to steels, particularly high-carbon steels, to improve their machinability and ductility. This involves heating the steel to a specific temperature, holding it there to allow the carbides to form into spherical shapes, and then slowly cooling it. This process makes the steel softer and easier to work with. It's a technical term primarily used in metallurgy and materials science.","priority":"★★☆"},"example_sentences":[{"sentence":"Spheroidizing is essential for preparing high-carbon steel for cold forming.","translation":"球状化処理は、高炭素鋼を冷間成形するために不可欠である。","type":"noun","meaning_category":"熱処理"},{"sentence":"We are spheroidizing the steel to reduce its hardness.","translation":"硬度を下げるために鋼を球状化処理している。","type":"verb","meaning_category":"熱処理する"}]}