{"word":"autotransfusion","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"自己血輸血、自己輸血","english_definition":"The transfusion of blood or blood components that were previously collected from the recipient.","examples":[{"sentence":"Autotransfusion is often used during surgery to reduce the need for donor blood.","translation":"自己血輸血は、手術中にドナーからの輸血の必要性を減らすためによく使用されます。"},{"sentence":"The benefits of autotransfusion include a reduced risk of infection and transfusion reactions.","translation":"自己血輸血の利点には、感染症や輸血反応のリスクの軽減が含まれます。"}],"collocations":["intraoperative autotransfusion","preoperative autotransfusion","cell saver autotransfusion"],"synonyms":["blood salvage","cell salvage"],"antonyms":["allogeneic transfusion","homologous transfusion"]}],"etymology":{"value":"From 'auto-' (self) + 'transfusion' (the process of transfusing blood).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɔːtoʊtrænsˈfjuːʒən/","syllables":"au-to-trans-fu-sion"},"inflection":{"noun_plural":"autotransfusions"},"usage_notes":{"explanation":"Autotransfusion involves collecting and reinfusing a patient's own blood. This can be done before surgery (preoperative autologous donation), during surgery (intraoperative cell salvage), or after surgery (postoperative blood salvage). It is used to minimize the risks associated with using blood from donors.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a autotransfusion after the accident.","correct":"✓ He had an autotransfusion after the accident.","note":"'Autotransfusion' begins with a vowel sound, so use 'an' instead of 'a' as the indefinite article."}],"priority":"★★☆"},"related_words":{"derivatives":["autologous","transfusion","cell saver"],"medical_terms":["hemoglobin","hematocrit","blood bank","blood type"],"priority":"★★☆"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Autotransfusion' is a specialized medical term referring to the process of reinfusing a patient's own blood back into their system. It's primarily used in medical contexts, such as surgery or trauma care, to reduce the reliance on donor blood and minimize the risk of complications like infections or transfusion reactions. Understanding this term requires familiarity with medical terminology related to blood transfusions and surgical procedures."},"example_sentences":[{"sentence":"Intraoperative autotransfusion helped minimize blood loss during the complex cardiac surgery.","translation":"術中自己血輸血は、複雑な心臓手術中の出血量を最小限に抑えるのに役立ちました。","type":"noun","meaning_category":"Medical procedure"},{"sentence":"Preoperative autotransfusion is an option for patients undergoing elective surgery.","translation":"術前自己血輸血は、待機手術を受ける患者にとって選択肢の一つです。","type":"noun","meaning_category":"Medical procedure"}]}