{"word":"concordatory","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"協約的な、協約に関する","english_definition":"relating to or of the nature of a concordat (an agreement or treaty).","examples":[{"sentence":"The concordatory agreement aimed to resolve long-standing disputes.","translation":"その協約的な合意は、長年の紛争を解決することを目的としていた。"},{"sentence":"The concordatory clauses were carefully negotiated.","translation":"協約に関する条項は慎重に交渉された。"}],"collocations":["concordatory agreement","concordatory clauses","concordatory treaty"],"synonyms":["treaty-based","agreement-related","contractual"],"antonyms":["unilateral","discordant"]}],"etymology":{"value":"Derived from 'concordat' (an agreement, especially one between the Pope and a secular government) + '-ory' (suffix indicating relation or tendency). The term 'concordat' comes from Medieval Latin 'concordatum', past participle of 'concordare' (to agree).","priority":"★★☆"},"pronunciation":{"ipa":"/kənˈkɔːrdətɔːri/","syllables":"con-cor-da-to-ry"},"inflection":{"notes":"Adjectives do not inflect in English."},"usage_notes":{"explanation":"'Concordatory' is a relatively rare adjective used to describe something that pertains to or is in the nature of a concordat. It is most often found in historical or legal contexts when discussing agreements between the Vatican and a state.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The concordatory was concordatory.","correct":"✓ The concordat was concordatory.","note":"'Concordatory' is an adjective, so it must modify a noun. A concordat itself cannot 'be concordatory'; rather, its clauses or agreements can be described as such."}],"priority":"★★☆"},"related_words":{"derivatives":["concordat (noun): an agreement or treaty, especially one between the Pope and a secular government.","concord (noun): agreement or harmony between people or groups.","concordance (noun): an alphabetical index of the principal words in a book or the works of an author."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'concordatory' is a specialized term primarily used in historical, political, or religious contexts, specifically when referring to agreements or treaties, especially those involving the Vatican. Due to its limited usage and formal nature, it is considered a high-level vocabulary word."},"example_sentences":[{"sentence":"The concordatory nature of the document was evident in its careful balancing of interests.","translation":"その文書の協約的な性質は、利害関係の慎重なバランスに明らかであった。","type":"adjective","meaning_category":"協約に関する"},{"sentence":"The concordatory talks aimed to establish a lasting peace.","translation":"協約に関する協議は、永続的な平和を確立することを目的としていた。","type":"adjective","meaning_category":"協約に関する"}]}