{"word":"Lactobacillus","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"乳酸菌（属）","english_definition":"A genus of Gram-positive, aerotolerant anaerobic bacteria that produce lactic acid as the major metabolic end product of carbohydrate fermentation. They are commonly found in fermented foods and the gastrointestinal tract.","examples":[{"sentence":"Lactobacillus acidophilus is a common probiotic strain.","translation":"ラクトバチルス・アシドフィルスは一般的なプロバイオティクス菌株です。"},{"sentence":"Yogurt contains various species of Lactobacillus.","translation":"ヨーグルトには様々なラクトバチルス属の菌が含まれています。"}],"collocations":["Lactobacillus acidophilus","Lactobacillus casei","Lactobacillus plantarum","probiotic Lactobacillus","Lactobacillus culture"],"synonyms":["lactic acid bacteria","LAB"],"antonyms":[]}],"etymology":{"value":"Derived from 'lacto-' (referring to milk) and 'bacillus' (meaning small rod or staff), reflecting their rod-like shape and association with milk fermentation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌlæktoʊbəˈsɪləs/","syllables":"lac-to-ba-cil-lus"},"inflection":{"noun_plural":"Lactobacilli"},"usage_notes":{"explanation":"'Lactobacillus' refers to a genus of bacteria. When referring to a specific species within the genus, the full binomial nomenclature (e.g., Lactobacillus acidophilus) is typically used. These bacteria are important in food fermentation and are often used as probiotics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Lactobacilli is good for your gut.","correct":"✓ Lactobacilli are good for your gut.","note":"'Lactobacilli' is the plural form, so it requires a plural verb."},{"incorrect":"✗ Lactobacillus are a species of bacteria.","correct":"✓ Lactobacillus is a genus of bacteria.","note":"'Lactobacillus' refers to the genus, not a single species. Use the binomial name (e.g. Lactobacillus acidophilus) when referring to a specific species."}],"priority":"★★☆"},"related_words":{"derivatives":["Lactobacillaceae (family)","Lactate (related compound)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, primarily used in scientific or health-related contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lactobacillus' is a scientific term referring to a genus of bacteria known for producing lactic acid. It's commonly associated with fermented foods like yogurt and is often discussed in the context of probiotics and gut health. While not a word used in everyday conversation, it's important in scientific and health-related discussions. Understanding its role in fermentation and its potential health benefits requires some scientific literacy."},"example_sentences":[{"sentence":"The study investigated the effects of different strains of Lactobacillus on gut microbiota.","translation":"その研究では、様々なラクトバチルス菌株が腸内細菌叢に与える影響を調査しました。","type":"noun","meaning_category":"乳酸菌（属）"},{"sentence":"Adding Lactobacillus to the diet can improve digestion.","translation":"食事にラクトバチルスを加えることで消化を改善することができます。","type":"noun","meaning_category":"乳酸菌（属）"}]}