{"word":"zoochorous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(植物学) 動物散布性の、動物によって種子や胞子が散布される","english_definition":"(botany) (of a plant) having seeds or spores dispersed by animals.","examples":[{"sentence":"Many plants with fleshy fruits are zoochorous, relying on animals to eat the fruit and disperse the seeds.","translation":"果肉のある果実を持つ多くの植物は動物散布性であり、動物が果実を食べて種子を散布することに頼っている。"},{"sentence":"Zoochorous plants often have adaptations such as hooks or barbs to attach to animal fur.","translation":"動物散布性の植物は、動物の毛皮に付着するための鉤や棘などの適応を持つことが多い。"}],"collocations":["zoochorous plant","zoochorous seed dispersal","endozoochorous","epizoochorous"],"synonyms":["animal-dispersed","epizoochorous","endozoochorous"],"antonyms":["anemochorous","hydrochorous","autochorous"]}],"etymology":{"value":"Derived from the Greek words 'zoon' (ζῷον) meaning 'animal' and 'choros' (χωρος) meaning 'place' or 'spreading'.","priority":"★★★"},"pronunciation":{"ipa":"/zoʊˈɒkərəs/","syllables":"zo-o-cho-rous"},"inflection":{"notes":"This word is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"Zoochorous describes plants that rely on animals for seed dispersal. This can happen in two main ways: endozoochory, where animals eat the fruit and later deposit the seeds in their feces, or epizoochory, where seeds attach to the animal's fur or feathers and are carried to a new location. Zoochorous plants often have specific adaptations to attract animals or facilitate seed attachment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The plant is zoochore.","correct":"The plant is zoochorous.","note":"'Zoochore' is not the correct adjective form; the correct form is 'zoochorous'."}],"priority":"★★☆"},"related_words":{"derivatives":["zoochory (noun): the dispersal of seeds by animals","endozoochory (noun): seed dispersal via ingestion by animals","epizoochory (noun): seed dispersal via external attachment to animals"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Zoochorous' is a technical term used in botany to describe plants that have their seeds dispersed by animals. It's a relatively uncommon word, primarily used in scientific contexts. Understanding the term requires knowledge of basic botanical concepts and Greek root words. The word is more likely to be encountered in academic texts or specialized discussions about plant ecology and seed dispersal mechanisms."},"example_sentences":[{"sentence":"The burdock plant is an example of a zoochorous species, using hooks to attach its seeds to animal fur.","translation":"オナモミは動物散布性の種の例であり、鉤を使って種子を動物の毛皮に付着させる。","type":"general","meaning_category":"definition"},{"sentence":"Endozoochorous dispersal is common in fleshy fruits, where animals consume the fruit and excrete the seeds.","translation":"動物体内散布は、動物が果実を消費し、種子を排泄する果肉のある果実によく見られる。","type":"specific","meaning_category":"endozoochory"},{"sentence":"Epizoochorous plants often have seeds with barbs or sticky substances to aid in attachment to passing animals.","translation":"動物体外散布性の植物は、通過する動物への付着を助けるために、棘や粘着性物質のある種子を持つことが多い。","type":"specific","meaning_category":"epizoochory"}]}