{"word":"epitope-selective","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"エピトープ選択的な","english_definition":"Relating to or characterized by the ability to selectively bind to a specific epitope.","examples":[{"sentence":"The antibody is epitope-selective, binding only to a specific region of the protein.","translation":"その抗体はエピトープ選択的であり、タンパク質の特定領域にのみ結合する。"},{"sentence":"Epitope-selective therapies are being developed to target specific cancer cells.","translation":"特定のがん細胞を標的とするエピトープ選択的治療法が開発されている。"}],"collocations":["epitope-selective antibody","epitope-selective therapy","epitope-selective binding"],"synonyms":["epitope-specific","region-specific","site-selective"],"antonyms":["non-selective","broadly reactive"]}],"etymology":{"value":"Derived from 'epitope' (the part of an antigen molecule to which an antibody attaches itself) and 'selective' (relating to or involving selection).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛpɪtoʊp sɪˈlɛktɪv/","syllables":"ep-i-tope se-lec-tive"},"inflection":{"notes":"Does not inflect (adjective)."},"usage_notes":{"explanation":"'Epitope-selective' describes a molecule (often an antibody) or a process that specifically targets a particular epitope, which is a small, accessible region on an antigen. This selectivity is crucial in targeted therapies and diagnostics, as it minimizes off-target effects.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The drug is selective, but not epitope-selective.","correct":"✓ The drug is selective, but not epitope-specific.","note":"'Epitope-selective' implies a higher level of specificity than simply 'selective'; it refers to targeting a specific epitope. If it's just generally selective, avoid using 'epitope' in the description."}],"priority":"★★☆"},"related_words":{"derivatives":["epitope","selectivity","selective"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Epitope-selective' is a technical term used in immunology and related fields. It describes something that specifically targets a particular epitope, which is a small part of an antigen recognized by the immune system. Understanding this term requires knowledge of basic immunology concepts. It is not commonly used outside of scientific contexts."},"example_sentences":[{"sentence":"The researchers designed an epitope-selective antibody to neutralize the virus.","translation":"研究者らは、ウイルスを中和するためにエピトープ選択的抗体を設計した。","type":"adjective","meaning_category":"specific targeting"},{"sentence":"Epitope-selective vaccines offer the potential for improved safety and efficacy.","translation":"エピトープ選択的ワクチンは、安全性と有効性を向上させる可能性を提供する。","type":"adjective","meaning_category":"vaccine development"}]}