{"word":"vice-apostolical","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"代理使徒の、副使徒の","english_definition":"Acting in the place of an apostle; having the authority or function of an apostle's deputy.","examples":[{"sentence":"The bishop exercised vice-apostolical powers in the absence of the cardinal.","translation":"司教は枢機卿が不在の間、代理使徒の権限を行使した。"},{"sentence":"A vice-apostolical delegate was sent to oversee the mission.","translation":"副使徒の代表が派遣され、その任務を監督した。"}],"collocations":["vice-apostolical authority","vice-apostolical powers","vice-apostolical delegate"],"synonyms":["deputy-apostolic","sub-apostolic","pro-apostolic"],"antonyms":["apostolical"]}],"etymology":{"value":"\"vice-\" (in place of) + \"apostolical\" (relating to an apostle).","priority":"N/A"},"pronunciation":{"ipa":"/ˌvaɪs əˌpɒstəˈlɪkəl/","syllables":"vice-a-pos-to-li-cal"},"inflection":{"notes":"Adjective, no inflection."},"usage_notes":{"explanation":"This term is relatively rare and specific to religious contexts, particularly within Christianity. It describes someone or something that acts with the authority or function of an apostle's representative.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a vice-apostolic person.","correct":"✓ He held a vice-apostolical position.","note":"Use 'vice-apostolical' to describe a position, power, or function, not a person directly. Instead, describe the person's role or position using the adjective."}],"priority":"★☆☆"},"related_words":{"derivatives":["vice (prefix: in place of)","apostolical (adjective: relating to an apostle)","apostle (noun: a messenger or envoy, especially one of the original twelve disciples of Jesus)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'vice-apostolical' is a highly specialized term primarily used in religious or historical contexts related to Christianity. It signifies someone or something acting as a deputy or representative of an apostle, holding delegated authority or functions. Due to its limited and specific usage, it is unlikely to be encountered outside of academic or religious texts. Understanding requires familiarity with the concept of apostles and ecclesiastical hierarchies."},"example_sentences":[{"sentence":"The papal nuncio served in a vice-apostolical capacity during the interregnum.","translation":"教皇大使は教皇空位期間中、代理使徒の資格で務めた。","type":"adjective","meaning_category":"代理使徒の"},{"sentence":"The vice-apostolical commission was tasked with resolving the dispute.","translation":"副使徒委員会は紛争解決の任務を負っていた。","type":"adjective","meaning_category":"副使徒の"}]}