{"word":"moodishly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"気まぐれに、むら気のある様子で、不機嫌そうに","english_definition":"in a way that shows you are often in a bad mood or that you change your mood suddenly","examples":[{"sentence":"He stared moodishly out the window.","translation":"彼は不機嫌そうに窓の外をじっと見ていた。"},{"sentence":"She replied moodishly to the question.","translation":"彼女はその質問にむっつりと答えた。"},{"sentence":"The artist worked moodishly on his painting, sometimes inspired, sometimes frustrated.","translation":"その芸術家は気まぐれに絵を描き、時にはインスピレーションを受け、時には不満を感じていた。"}],"collocations":["stare moodishly","reply moodishly","work moodishly"],"synonyms":["sullenly","gloomily","morosely","poutingly","irascibly","capriciously"],"antonyms":["cheerfully","happily","brightly","amiably","pleasantly"]}],"etymology":{"value":"\"moody\" + \"-ly\". \"Moody\" is from \"mood\", originally meaning courage or spirit, later disposition or temper, from Old English \"mōd\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmuːdɪʃli/","syllables":"moo-dish-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"\"Moodishly\" describes actions or behaviors that are characterized by frequent changes in mood, often with a negative or sullen tone. It implies a tendency to be easily affected by one's feelings, leading to unpredictable or irritable behavior. The adverb is used to describe how someone performs an action, reflecting their current state of mind.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She felt moodishly today.","correct":"✓ She felt moody today.","note":"\"Moodishly\" is an adverb, describing how an action is performed. \"Moody\" is an adjective, describing a state of being. To describe how someone feels, use the adjective \"moody\"."},{"incorrect":"✗ He moodishly is a good person.","correct":"✓ He is moodily working.","note":"\"Moodishly\" modifies verbs, adjectives, or other adverbs, not nouns. The sentence needs a verb to be modified."}],"priority":"★★☆"},"related_words":{"derivatives":["moody (adjective)","moodiness (noun)"],"phrasal_verbs":[],"related_adverbs":["sullenly","gloomily","morosely","capriciously"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"moodishly\" is an adverb that describes doing something in a moody way. This means the person is acting in a way that shows they are often in a bad mood or that their mood changes suddenly. It's not a very common word, so it's more likely to be found in advanced texts or literature where the author wants to specifically describe someone's behavior as being influenced by their changing moods."},"example_sentences":[{"sentence":"The teenager slammed the door moodishly after the argument.","translation":"そのティーンエイジャーは口論の後、不機嫌そうにドアをバタンと閉めた。","type":"example","meaning_category":"manner"},{"sentence":"She stirred her coffee moodishly, lost in thought.","translation":"彼女は考えにふけりながら、不機嫌そうにコーヒーをかき混ぜた。","type":"example","meaning_category":"manner"},{"sentence":"He moodishly refused to participate in the game.","translation":"彼はむっつりとしてゲームへの参加を拒否した。","type":"example","meaning_category":"manner"}]}