{"word":"armorials","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"紋章学、紋章集、紋章図譜","english_definition":"A collection of coats of arms; heraldry.","examples":[{"sentence":"The library contained a vast collection of armorials, detailing the heraldic history of noble families.","translation":"その図書館には、貴族の家系の紋章の歴史を詳述した、膨大な紋章集が所蔵されていた。"},{"sentence":"His knowledge of armorials was impressive; he could identify any coat of arms at a glance.","translation":"彼の紋章学の知識は目覚ましく、一目でどんな紋章でも識別できた。"}],"collocations":["study of armorials (紋章学の研究)","collection of armorials (紋章集)","book of armorials (紋章図譜)"],"synonyms":["heraldry","coat of arms","emblazonry"],"antonyms":[]}],"etymology":{"value":"From the Medieval Latin 'armorialis', pertaining to arms (weapons or coats of arms).","priority":"★★☆"},"pronunciation":{"ipa":"/ɑːrˈmɔːriəlz/","syllables":"ar-mo-ri-als"},"inflection":{"noun_plural":"armorials"},"usage_notes":{"explanation":"'Armorials' refers to collections or studies of coats of arms and heraldry. It can also refer to the coats of arms themselves, especially when considered as a group or a subject of study. The term is often used in historical or genealogical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He designed a new armorial for his family.","correct":"✓ He designed a new coat of arms for his family.","note":"While 'armorials' refers to a collection or study of coats of arms, 'coat of arms' is the correct term for the individual design. Using 'armorial' to refer to a single coat of arms is incorrect."}],"priority":"★★☆"},"related_words":{"derivatives":["armorial (adjective: relating to heraldry or coats of arms)","armory (noun: a place where arms are stored; a heraldic office)","arms (noun: weapons; coats of arms)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Armorials' is a specialized term related to heraldry, the system of coats of arms and other heraldic devices. It refers to collections of coats of arms or the study of heraldry itself. Due to its specialized nature, it is not commonly used outside of historical or genealogical contexts."},"example_sentences":[{"sentence":"The historian consulted ancient armorials to trace the lineage of the royal family.","translation":"歴史家は、王室の血統をたどるために、古代の紋章集を調べた。","type":"noun","meaning_category":"紋章集"},{"sentence":"His expertise in armorials made him a valuable consultant for the museum's exhibition on medieval history.","translation":"彼の紋章学の専門知識は、博物館の中世史展覧会にとって貴重なコンサルタントとなった。","type":"noun","meaning_category":"紋章学"}]}