{"word":"radiosonde","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ラジオゾンデ（気象観測機器）","english_definition":"A balloon-borne instrument package that measures various atmospheric parameters, such as temperature, humidity, pressure, and wind speed and direction, and transmits the data to a ground receiver.","examples":[{"sentence":"The radiosonde is launched twice a day to gather data about the upper atmosphere.","translation":"ラジオゾンデは、上層大気に関するデータを収集するために、1日に2回打ち上げられます。"},{"sentence":"Radiosonde data is essential for weather forecasting.","translation":"ラジオゾンデのデータは、気象予報に不可欠です。"}],"collocations":["launch a radiosonde (ラジオゾンデを打ち上げる)","radiosonde data (ラジオゾンデのデータ)","upper-air radiosonde (高層ラジオゾンデ)"],"synonyms":["weather balloon","sounding balloon"],"antonyms":[]}],"etymology":{"value":"'Radio' (referring to radio transmission) + 'sonde' (from French, meaning probe or sounding device).","priority":"★★★"},"pronunciation":{"ipa":"/ˈreɪdiˌoʊsɒnd/","syllables":"ra-di-o-sonde"},"inflection":{"noun_plural":"radiosondes"},"usage_notes":{"explanation":"Radiosondes are typically attached to weather balloons and released into the atmosphere. As the balloon rises, the radiosonde measures atmospheric conditions and transmits the data back to a receiving station on the ground. The data is used to create vertical profiles of the atmosphere, which are essential for weather forecasting and climate research.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The radiosonde are launched.","correct":"✓ The radiosonde is launched.","note":"'Radiosonde' is a singular noun, even though it measures multiple parameters."}],"priority":"★★☆"},"related_words":{"derivatives":["radiosounding (名詞: ラジオゾンデ観測)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'radiosonde' refers to a specialized instrument used in meteorology. It is a device carried aloft by a weather balloon to measure atmospheric conditions such as temperature, humidity, and wind. Understanding this term is essential for comprehending discussions related to weather forecasting, climate research, and atmospheric science. The data collected by radiosondes provides valuable insights into the state of the atmosphere and helps improve weather prediction models."},"example_sentences":[{"sentence":"The weather service uses **radiosondes** to monitor atmospheric conditions.","translation":"気象局は、大気の状態を監視するためにラジオゾンデを使用しています。","type":"noun","meaning_category":"気象観測機器"},{"sentence":"The **radiosonde** transmitted data on temperature and humidity.","translation":"ラジオゾンデは、気温と湿度のデータを送信しました。","type":"noun","meaning_category":"気象観測機器"}]}