{"word":"outcaviled","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人を)出し抜いて難癖をつける、(人を)負かすほどに批判する","english_definition":"To surpass or defeat someone in finding fault or raising petty objections; to quibble more effectively than another.","examples":[{"sentence":"He tried to argue, but she outcaviled him with her sharp wit.","translation":"彼は議論しようとしたが、彼女の鋭い機知によって難癖をつけられて負かされた。"},{"sentence":"No one could outcavil the old professor when it came to obscure historical details.","translation":"難解な歴史の詳細に関して言えば、その老教授に難癖をつけて打ち負かすことができる人はいなかった。"}],"collocations":["outcavil someone in debate","outcavil a critic","outcavil an opponent"],"synonyms":["outargue","outdo in quibbling","surpass in fault-finding","defeat in nit-picking"],"antonyms":["agree with","support","concur with"]}],"etymology":{"value":"Derived from \"cavil,\" meaning to raise irritating and trivial objections; find fault unnecessarily. \"Out-\" prefix indicates surpassing or exceeding in the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌaʊtˈkævɪld/","syllables":"out-cav-iled"},"inflection":{"verb_forms":{"present_simple":["outcavil","outcavils"],"past_simple":"outcaviled","past_participle":"outcaviled","present_participle":"outcaviling"}},"usage_notes":{"explanation":"\"Outcavil\" is a relatively rare and somewhat archaic verb. It implies not just finding fault, but doing so to a greater extent or more effectively than someone else. It suggests a competitive aspect to fault-finding, where one person excels at raising trivial objections.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He outcaviled the problem.","correct":"✓ He outcaviled his opponent.","note":"\"Outcavil\" typically takes a person as its object, not an abstract concept like a problem. It describes surpassing someone in finding fault with something, not solving a problem through fault-finding."}],"priority":"★☆☆"},"related_words":{"derivatives":["cavil (verb/noun)","caviler (noun)","cavilingly (adverb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"outcaviled\" is a rare and sophisticated term. It signifies surpassing someone in the act of finding petty faults or raising trivial objections. Understanding this word requires a strong grasp of vocabulary and an appreciation for nuanced expressions. It is not commonly used in everyday conversation or writing."},"example_sentences":[{"sentence":"The lawyer outcaviled the witness, discrediting their testimony with minor inconsistencies.","translation":"弁護士は証人に難癖をつけ、些細な矛盾で証言の信用を失墜させた。","type":"verb","meaning_category":"criticize"},{"sentence":"She outcaviled all her critics, finding flaws in their arguments that no one else had noticed.","translation":"彼女はすべての批評家よりも難癖をつけ、他の誰も気づかなかった彼らの議論の欠陥を見つけた。","type":"verb","meaning_category":"criticize"}]}