{"word":"Socratically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"ソクラテスのように、ソクラテス的な方法で","english_definition":"In a manner resembling Socrates; using the Socratic method.","examples":[{"sentence":"The teacher questioned the students Socratically, guiding them to discover the answer themselves.","translation":"先生は生徒たちにソクラテス的な方法で質問し、彼らが自力で答えを見つけられるように導いた。"},{"sentence":"He approached the problem Socratically, constantly questioning assumptions and seeking deeper understanding.","translation":"彼はその問題にソクラテス的な方法で取り組み、常に前提を問い、より深い理解を求めた。"}],"collocations":["question Socratically","approach Socratically","examine Socratically","teach Socratically"],"synonyms":["dialectically","interrogatively","analytically","questioningly"],"antonyms":[]}],"etymology":{"value":"Derived from the adjective 'Socratic', which comes from the name of the Greek philosopher Socrates (c. 470–399 BC) + '-ally'.","priority":"★★☆"},"pronunciation":{"ipa":"/sɒˈkrætɪkli/","syllables":"So-crat-i-cal-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Socratically' describes a method of inquiry or discussion that resembles the Socratic method, which involves asking a series of questions to examine the underlying beliefs and assumptions of the other person, with the goal of stimulating critical thinking and illuminating underlying presuppositions. It's used to describe a style of teaching, debating, or problem-solving.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He answered Socratically.","correct":"✓ He responded Socratically. / ✓ He questioned Socratically.","note":"'Socratically' describes the manner of questioning or examining, not answering. It's about the method of inquiry, not the response."}],"priority":"★★☆"},"related_words":{"derivatives":["Socrates (noun: the Greek philosopher)","Socratic (adjective: relating to Socrates or his method of inquiry)","Socratism (noun: the principles and practice of Socrates)","Socratic method (noun: a form of cooperative argumentative dialogue between individuals, based on asking and answering questions to stimulate critical thinking and to draw out underlying presuppositions)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Socratically' means 'in a way that uses the Socratic method'. The Socratic method is a way of learning and discussing ideas by asking questions. Instead of giving answers directly, someone using the Socratic method asks questions to help you think more deeply about the topic and find the answers yourself. This word is not very common, but it's useful if you're talking about education, philosophy, or critical thinking."},"example_sentences":[{"sentence":"The professor engaged the class Socratically, prompting students to challenge their own assumptions.","translation":"教授はソクラテス的な方法で授業を行い、学生たちに自身の前提に異議を唱えるよう促した。","type":"adverb","meaning_category":"manner of questioning"},{"sentence":"She analyzed the ethical dilemma Socratically, breaking down the arguments into a series of probing questions.","translation":"彼女は倫理的なジレンマをソクラテス的な方法で分析し、議論を掘り下げた一連の質問に分解した。","type":"adverb","meaning_category":"analytical approach"}]}