{"word":"beer-antagonistic","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"Opposed to or having a strong dislike of beer.","english_definition":"Having or showing opposition or dislike towards beer.","examples":[{"sentence":"His beer-antagonistic stance made him an oddity at the brewery tour.","translation":"彼のビール嫌いの態度は、ビール工場見学では異質な存在だった。"},{"sentence":"The restaurant caters to a wide range of tastes, including those with beer-antagonistic preferences.","translation":"そのレストランは、ビール嫌いな人の好みを含め、幅広い味覚に対応している。"}],"collocations":["beer-antagonistic individuals","beer-antagonistic views","beer-antagonistic policies"],"synonyms":["anti-beer","beer-averse","beer-opposed"],"antonyms":["beer-loving","beer-enthusiastic","beer-friendly"]}],"etymology":{"value":"Formed by combining 'beer' with 'antagonistic', indicating opposition or dislike towards beer.","priority":"medium"},"pronunciation":{"ipa":"/ˌbɪər ænˌtæɡəˈnɪstɪk/","syllables":"beer-an-tag-o-nis-tic"},"inflection":{"notes":"This is an adjective, so it has comparative and superlative forms, though they are rarely used: more beer-antagonistic, most beer-antagonistic."},"usage_notes":{"explanation":"This term is used to describe someone who dislikes beer or is opposed to its consumption or promotion. It is relatively uncommon but can be used in contexts where such opposition is relevant.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"He is beer antagonistic.","correct":"He is beer-antagonistic.","note":"The hyphen is important to correctly form the compound adjective."}],"priority":"low"},"related_words":{"derivatives":["antagonistic","beer"],"related_terms":["teetotaler","abstainer"]},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"low"},"readability_explanation":{"level":"C1","text":"The term 'beer-antagonistic' is a niche adjective used to describe someone who dislikes or opposes beer. Due to its specific and somewhat uncommon nature, it is more likely to be encountered in specialized discussions or writing related to beverages, personal preferences, or social attitudes towards alcohol."},"example_sentences":[{"sentence":"The new health campaign is seen as beer-antagonistic by some brewers.","translation":"新しい健康キャンペーンは、一部のビール醸造業者からビールに敵対的だと見られている。","type":"adjective","meaning_category":"Opposed to beer"},{"sentence":"Despite the town's brewing history, a few residents remain beer-antagonistic.","translation":"その町の醸造の歴史にもかかわらず、少数の住民は依然としてビール嫌いだ。","type":"adjective","meaning_category":"Disliking beer"}]}