{"word":"disgracefulness","meanings":[{"part_of_speech":"noun","definition":"不名誉さ、恥辱、不面目さ","english_definition":"The state or quality of being disgraceful; shameful or dishonorable conduct or character.","examples":[{"sentence":"The disgracefulness of his actions shocked the entire community.","translation":"彼の行動の不名誉さは地域社会全体に衝撃を与えた。"},{"sentence":"She couldn't bear the disgracefulness of her family's scandal.","translation":"彼女は家族のスキャンダルの不面目さに耐えられなかった。"},{"sentence":"The disgracefulness of the defeat led to the coach's resignation.","translation":"敗北の不名誉さがコーチの辞任につながった。"}],"collocations":["utter disgracefulness","sheer disgracefulness","public disgracefulness"],"synonyms":["shamefulness","dishonor","ignominy","infamy","opprobrium","scandal","reproach","degradation"],"antonyms":["honor","respect","esteem","repute","dignity","worthiness"],"related_words":["disgraceful (adjective)","disgrace (noun)"]}],"etymology":{"value":"Derived from 'disgraceful' + '-ness'. 'Disgraceful' comes from 'disgrace' (loss of favor, respect, or honor), which originated from Old French 'desgrace' (lack of grace, misfortune), from 'des-' (dis-) + 'grace' (grace).","priority":"★★☆"},"pronunciation":{"ipa":"/dɪsˈɡreɪsfʊlnəs/","syllables":"dis-grace-ful-ness"},"inflection":{"noun_plural":"disgracefulnesses (rare)"},"usage_notes":{"explanation":"'Disgracefulness' is a noun that describes the extent to which something is disgraceful. It emphasizes the quality or state of being shameful or dishonorable. It is often used to describe actions, events, or situations that are deeply offensive to moral standards or public opinion.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The disgracefulness was too much to handle.","correct":"The disgrace was too much to handle.","note":"'Disgrace' is often used as a general term for shame or dishonor. 'Disgracefulness' is more specific, referring to the quality of being disgraceful."}],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Disgracefulness' is a noun that means the quality of being shameful or dishonorable. It's a more formal and less common word than 'disgrace' or 'shame'. It is used to emphasize the degree to which something is disgraceful. You would typically use this word when you want to highlight the intensity or extent of the shameful nature of something. For example, 'The disgracefulness of the crime shocked the nation' indicates that the crime was not just a disgrace, but its level of disgrace was particularly notable."},"example_sentences":[{"sentence":"The sheer disgracefulness of the politician's lies was astounding.","translation":"政治家の嘘の全くの不名誉さは驚くべきものだった。","type":"noun","meaning_category":"不名誉さ"},{"sentence":"The report detailed the disgracefulness of the company's environmental practices.","translation":"報告書は、会社の環境慣行の不名誉さを詳細に記述した。","type":"noun","meaning_category":"不面目さ"},{"sentence":"The disgracefulness of the situation demanded immediate action.","translation":"その状況の不名誉さは、直ちに行動を起こすことを要求した。","type":"noun","meaning_category":"恥辱"}]}