{"word":"deciduity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"落葉性、落葉すること","english_definition":"The state or quality of being deciduous; the shedding of leaves annually, as by deciduous trees.","examples":[{"sentence":"The deciduity of the maple tree is a beautiful sight in the fall.","translation":"秋の楓の木の落葉性は美しい光景です。"}],"collocations":["seasonal deciduity","foliar deciduity"],"synonyms":["deciduousness","leaf fall"],"antonyms":["evergreenness","persistence"]},{"part_of_speech":"noun","definition":"(比喩的に)一時的な性質、はかなさ","english_definition":"(figuratively) The quality of being temporary or transient.","examples":[{"sentence":"The deciduity of fame is a common theme in literature.","translation":"名声のはかなさは文学における共通のテーマです。"}],"collocations":["temporal deciduity","transient deciduity"],"synonyms":["transience","temporality","ephemerality"],"antonyms":["permanence","eternity"]}],"etymology":{"value":"From Latin 'deciduus' (falling off), from 'decidere' (to fall down, fall off), from 'de-' (down) + 'cadere' (to fall).","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈsɪdʒuɪti/","syllables":"de-cid-u-i-ty"},"inflection":{"noun_plural":"deciduities"},"usage_notes":{"explanation":"'Deciduity' primarily refers to the characteristic of plants, especially trees, that shed their leaves seasonally, typically in the autumn. It can also be used more abstractly to describe something that is temporary or not lasting. The word is relatively uncommon in everyday conversation and is more frequently found in scientific or literary contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The deciduity of the building was surprising.","correct":"✓ The dilapidation of the building was surprising.","note":"'Deciduity' refers to the shedding of leaves or a temporary nature, not the physical decay of a structure. Use 'dilapidation' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["deciduous (adjective)"],"related_terms":["abscission","senescence"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Deciduity' is a relatively rare and technical term. It primarily describes the characteristic of plants that shed their leaves seasonally. It can also be used in a more abstract or figurative sense to describe something that is temporary or transient. Because of its specialized meaning and infrequent use, it is considered an advanced vocabulary word."},"example_sentences":[{"sentence":"The park's beauty is enhanced by the deciduity of its many oak trees.","translation":"公園の美しさは、多くの樫の木の落葉性によって高められています。","type":"noun","meaning_category":"落葉性"},{"sentence":"Philosophers often ponder the deciduity of human life and achievements.","translation":"哲学者はしばしば人間の生活と業績のはかなさについて考えます。","type":"noun","meaning_category":"一時的な性質"}]}