{"word":"eyewashes","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"洗眼剤、洗眼液","english_definition":"A liquid preparation for cleansing or medicating the eye.","examples":[{"sentence":"She used eyewashes to relieve her irritated eyes.","translation":"彼女は炎症を起こした目を和らげるために洗眼剤を使った。"}],"collocations":["eye wash","sterile eyewash","saline eyewash"],"synonyms":["eye lotion","eye rinse","eye solution"],"antonyms":[]},{"part_of_speech":"noun","definition":"見え透いたごまかし、お世辞、体裁繕い","english_definition":"Something done or said to deceive or impress; flattery or humbug.","examples":[{"sentence":"His promises were just eyewashes to get votes.","translation":"彼の約束は票を得るための見え透いたごまかしにすぎなかった。"}],"collocations":["political eyewash","public relations eyewash"],"synonyms":["deception","sham","pretense","fraud","humbug"],"antonyms":["honesty","truthfulness"]}],"etymology":{"value":"'Eyewash' is a compound word formed from 'eye' and 'wash'. The literal sense refers to a liquid used to wash the eyes. The figurative sense, referring to deception, likely arose from the idea of something superficially cleansing or appearing beneficial but ultimately lacking substance.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈaɪˌwɒʃɪz/","syllables":"eye-wash-es"},"inflection":{"noun_plural":"eyewashes"},"usage_notes":{"explanation":"The word 'eyewashes' has two distinct meanings. Literally, it refers to solutions used to cleanse or medicate the eyes. Figuratively, it describes actions or statements intended to deceive or impress superficially. The plural form is typically used when referring to multiple instances of deception or multiple types of eye cleansing solutions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He gave eyewashes to his boss.","correct":"✓ He gave flattery to his boss. / ✓ He used eyewash on his boss.","note":"When referring to flattery or deception, use 'eyewash' as an uncountable noun or rephrase using synonyms like 'flattery' or 'deception'."}],"priority":"★★☆"},"related_words":{"derivatives":["eyewash (singular noun)"],"phrasal_verbs":[],"related_nouns":["eye","wash"],"related_verbs":["wash"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'eyewashes' can be understood on two levels. The literal meaning, referring to eye-cleansing solutions, is relatively straightforward. However, the figurative meaning, denoting deception or pretense, requires a more nuanced understanding of language and social contexts. The figurative sense is less common and more often encountered in formal writing or discussions about politics and public relations.","priority":"★☆☆"},"example_sentences":[{"sentence":"The doctor recommended using eyewashes to treat her conjunctivitis.","translation":"医者は彼女の結膜炎を治療するために洗眼剤を使うことを勧めた。","type":"noun","meaning_category":"洗眼剤"},{"sentence":"The company's claims about environmental responsibility were just eyewashes.","translation":"その会社の環境責任に関する主張は見え透いたごまかしにすぎなかった。","type":"noun","meaning_category":"ごまかし"}]}