{"word":"low-fiber","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"低繊維の、低食物繊維の","english_definition":"containing a small amount of dietary fiber.","examples":[{"sentence":"A low-fiber diet is often recommended after certain types of surgery.","translation":"低繊維食は、特定の手術後に推奨されることが多いです。"},{"sentence":"White bread is a low-fiber alternative to whole wheat bread.","translation":"白パンは、全粒粉パンの低繊維代替品です。"},{"sentence":"People with certain digestive conditions may need to follow a low-fiber diet.","translation":"特定の消化器系の疾患を持つ人々は、低繊維食に従う必要があるかもしれません。"}],"collocations":["low-fiber diet","low-fiber foods","low-fiber fruits","low-fiber vegetables"],"synonyms":["fiber-restricted","low-roughage"],"antonyms":["high-fiber"],"related_terms":["fiber","dietary fiber","roughage","constipation","diverticulitis","inflammatory bowel disease"],"notes":"Often used in the context of medical or dietary recommendations.","priority":"★★★"}],"etymology":{"value":"Combination of 'low' (having a small amount) and 'fiber' (dietary fiber).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌloʊ ˈfaɪbər/","syllables":"low-fi-ber"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Low-fiber' describes foods or diets that contain a minimal amount of dietary fiber. These diets are sometimes recommended for people with specific medical conditions, such as those recovering from surgery or experiencing digestive issues. It's important to consult with a healthcare professional or registered dietitian before starting a low-fiber diet.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need a low fiber for my health.","correct":"✓ I need a low-fiber diet for my health.","note":"'Low fiber' alone is incomplete. It typically modifies 'diet' or 'food.'"},{"incorrect":"✗ Low-fiber is very healthy for everyone.","correct":"✓ A low-fiber diet is not healthy for everyone.","note":"Low-fiber diets are not universally healthy and are usually recommended for specific medical reasons. High-fiber diets are generally considered healthier for the general population."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["high-fiber","fiber","dietary fiber","soluble fiber","insoluble fiber"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, used in specific contexts related to health and diet.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'low-fiber' is used to describe foods or diets that contain a small amount of dietary fiber. This type of diet is usually recommended for specific medical conditions, such as after surgery or for certain digestive issues. It's important to understand that a low-fiber diet is not generally recommended for the average healthy person. The term is most often encountered in medical or nutritional contexts.","priority":"★★★"},"example_sentences":[{"sentence":"After the surgery, the doctor recommended a **low-fiber** diet for a few weeks.","translation":"手術後、医師は数週間、低繊維食を推奨しました。","type":"general","meaning_category":"dietary recommendation"},{"sentence":"**Low-fiber** foods include white rice, cooked fruits without skins, and refined grains.","translation":"低繊維食品には、白米、皮なしの調理済み果物、精製穀物などが含まれます。","type":"food examples","meaning_category":"food types"},{"sentence":"A **low-fiber** diet can help reduce symptoms of diarrhea.","translation":"低繊維食は、下痢の症状を軽減するのに役立ちます。","type":"medical condition","meaning_category":"medical benefit"}]}