{"word":"whalebone","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"鯨骨、鯨ひげ","english_definition":"The baleen plates in the mouth of baleen whales, formerly used for stiffening corsets and other items.","examples":[{"sentence":"Whalebone was once used to make corsets.","translation":"鯨ひげはかつてコルセットを作るために使われていた。"},{"sentence":"The museum has a collection of artifacts made from whalebone.","translation":"その博物館には鯨骨で作られた工芸品のコレクションがある。"}],"collocations":["whalebone corset","whalebone stays","whalebone ribs"],"synonyms":["baleen"],"antonyms":[]}],"etymology":{"value":"From 'whale' + 'bone'. Originally referred to the actual bones of a whale, but later specifically applied to the baleen plates.","priority":"★★★"},"pronunciation":{"ipa":"/ˈweɪlboʊn/","syllables":"whale-bone"},"inflection":{"noun_plural":"whalebones"},"usage_notes":{"explanation":"'Whalebone' specifically refers to the baleen plates found in the mouths of baleen whales, which are used for filtering food from the water. It's important to distinguish this from the actual bones of the whale skeleton. The term is often associated with historical uses, such as in clothing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The whalebone is a bone in the whale's body.","correct":"✓ Whalebone is the baleen in the whale's mouth.","note":"Whalebone is not a bone but baleen, a different type of material."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'whalebone' refers to the baleen plates found in the mouths of baleen whales. These plates were historically used to make items like corsets. While not a common word in everyday conversation, it is relevant in historical or marine biology contexts. Understanding the distinction between whalebone (baleen) and actual whale bones is important."},"example_sentences":[{"sentence":"Antique shops sometimes sell items made of **whalebone**.","translation":"アンティークショップでは時々鯨ひげで作られたものが売られている。","type":"noun","meaning_category":"鯨ひげ"},{"sentence":"The **whalebone** in the whale's mouth filters small creatures from the water.","translation":"鯨の口の中の鯨ひげは、水から小さな生き物を濾過する。","type":"noun","meaning_category":"鯨ひげ"}]}