{"word":"survivalism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"サバイバリズム、サバイバル術、終末論的危機への備え","english_definition":"A movement of individuals or groups (called survivalists) who actively prepare for emergencies, including possible disruptions in social, political, or economic order.","examples":[{"sentence":"Survivalism has seen a resurgence in popularity due to global events.","translation":"世界的な出来事により、サバイバリズムの人気が再燃している。"},{"sentence":"He practices survivalism by stockpiling food and learning wilderness skills.","translation":"彼は食料を蓄えたり、野外スキルを学んだりして、サバイバリズムを実践している。"},{"sentence":"Survivalism is not just about hoarding supplies, but also about self-sufficiency.","translation":"サバイバリズムは単に物資をため込むだけでなく、自給自足についても重要である。"}],"collocations":["survivalist skills (サバイバリストのスキル)","survivalist gear (サバイバリストの装備)","practice survivalism (サバイバリズムを実践する)","survivalism community (サバイバリズムのコミュニティ)","economic survivalism (経済的サバイバリズム)"],"synonyms":["prepping","self-sufficiency","bushcraft","preparedness"],"antonyms":["dependence","reliance","complacency"]}],"etymology":{"value":"The term 'survivalism' emerged in the 1960s, combining 'survival' (the state or fact of continuing to live or exist) with the suffix '-ism' (denoting a belief, principle, or ideology).","priority":"★★☆"},"pronunciation":{"ipa":"/sərˈvaɪvəlɪzəm/","syllables":"sur-viv-al-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Survivalism is a philosophy and practice centered around preparing for potential disasters or emergencies that could disrupt normal life. This can range from natural disasters and economic collapse to societal breakdown and armed conflict. Survivalists often focus on acquiring skills and resources that would enable them to survive independently in such situations, such as food storage, water purification, first aid, self-defense, and wilderness survival skills. While some view survivalism as a fringe movement, others see it as a practical approach to risk management and self-reliance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a survival.","correct":"✓ He is a survivalist.","note":"'Survival' is a noun referring to the act of surviving, while 'survivalist' is the noun referring to a person who practices survivalism."},{"incorrect":"✗ Survivalism is only for crazy people.","correct":"✓ Survivalism is a diverse movement with varying levels of commitment.","note":"It's important to avoid generalizations about survivalism. While some portray it negatively, many view it as responsible preparedness."}],"priority":"★★☆"},"related_words":{"derivatives":["survivalist (noun: サバイバリスト, a person who practices survivalism)","survive (verb: 生き残る)","survival (noun: 生存)"],"phrasal_verbs":null,"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but increasing in recent years due to global events.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Survivalism' refers to a movement where people actively prepare for potential disasters or emergencies that could disrupt normal life. This involves acquiring skills and resources for self-sufficiency, such as stockpiling food, learning first aid, and developing wilderness survival techniques. The term is often associated with concerns about societal collapse or major disruptions, but it can also be seen as a form of practical preparedness. Understanding the term requires recognizing its connection to self-reliance and risk management in the face of potential crises."},"example_sentences":[{"sentence":"The book explores various aspects of **survivalism**, from food storage to self-defense.","translation":"その本は、食料の貯蔵から自己防衛まで、サバイバリズムのさまざまな側面を探求している。","type":"noun","meaning_category":"備え"},{"sentence":"Many people are turning to **survivalism** as a way to cope with uncertainty.","translation":"多くの人々が、不確実性に対処する方法としてサバイバリズムに目を向けている。","type":"noun","meaning_category":"備え"},{"sentence":"His interest in **survivalism** began after experiencing a major natural disaster.","translation":"彼のサバイバリズムへの関心は、大規模な自然災害を経験した後に始まった。","type":"noun","meaning_category":"備え"}]}