{"word":"quasi-mercantile","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"準重商主義的な、ほとんど重商主義的な","english_definition":"resembling or having some characteristics of mercantilism.","examples":[{"sentence":"The nation adopted a quasi-mercantile policy to boost its exports.","translation":"その国は輸出を促進するために準重商主義的な政策を採用した。"},{"sentence":"The government's approach was quasi-mercantile, focusing on trade surpluses.","translation":"政府のアプローチは準重商主義的で、貿易黒字に焦点を当てていた。"}],"collocations":["quasi-mercantile policies","quasi-mercantile approach","quasi-mercantile system"],"synonyms":["partly mercantilist","pseudo-mercantile","semi-mercantile"],"antonyms":["free trade","laissez-faire"],"notes":"Used to describe policies or systems that share some, but not all, features of mercantilism."}],"etymology":{"value":"'Quasi-' comes from Latin, meaning 'as if' or 'resembling'. 'Mercantile' refers to mercantilism, an economic theory that promotes governmental regulation of a nation's economy for the purpose of augmenting state power at the expense of rival national powers.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkweɪzaɪ mɜːrkənˌtaɪl/","syllables":"quasi-mer-can-tile"},"inflection":{"notes":"Adjective, no inflection."},"usage_notes":{"explanation":"'Quasi-mercantile' describes something that is similar to mercantilism but doesn't fully adhere to all its principles. It suggests an approach or policy that leans towards mercantilist ideas, such as prioritizing exports and accumulating wealth, but might also incorporate elements of other economic theories.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The economy was quasi-mercantile and free.","correct":"✓ The economy was quasi-mercantile but not entirely free.","note":"'Quasi-mercantile' implies some government intervention, so it is generally incompatible with a completely free economy."}],"priority":"★★☆"},"related_words":{"derivatives":["quasi (adverb, prefix)","mercantile (adjective)","mercantilism (noun)"],"related_terms":["protectionism","trade surplus","economic nationalism"]},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'quasi-mercantile' is used in economics and political science to describe policies or systems that resemble mercantilism but are not fully mercantilist. It is a relatively specialized term."},"example_sentences":[{"sentence":"The country's trade practices were viewed as quasi-mercantile by its partners.","translation":"その国の貿易慣行は、パートナー国から準重商主義的であると見なされていた。","type":"general"},{"sentence":"The new regulations reflect a quasi-mercantile strategy to support domestic industries.","translation":"新しい規制は、国内産業を支援するための準重商主義的な戦略を反映している。","type":"policy"}]}