{"word":"holophrastic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"一語文の、一語文的な","english_definition":"Expressing a complex of ideas in a single word or fixed phrase.","examples":[{"sentence":"The child's holophrastic speech consisted of single words used to convey entire thoughts.","translation":"その子供の一語文的な発話は、考え全体を伝えるために使われる単語一つから構成されていた。"},{"sentence":"'Up' can be a holophrastic utterance meaning 'Pick me up'.","translation":"「上」は「私を抱き上げて」という意味の一語文的な発話となりうる。"}],"collocations":["holophrastic speech","holophrastic utterance","holophrastic stage"],"synonyms":["one-word","monolexemic"],"antonyms":["telegraphic","multiword"]},{"part_of_speech":"adjective","definition":"一語文段階の","english_definition":"Relating to or characteristic of the stage of language development in which children use single words to express complex ideas.","examples":[{"sentence":"During the holophrastic stage, infants rely on context and intonation to communicate effectively.","translation":"一語文段階の間、幼児は効果的にコミュニケーションをとるために文脈とイントネーションに頼る。"},{"sentence":"The holophrastic stage typically occurs between the ages of 12 and 18 months.","translation":"一語文段階は通常、12か月から18か月の間に起こる。"}],"collocations":["holophrastic stage","holophrastic period","holophrastic development"],"synonyms":["one-word stage"],"antonyms":["two-word stage","multiword stage"]}],"etymology":{"value":"From the Greek words 'holos' meaning 'whole' and 'phrasis' meaning 'expression' or 'phrase'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɒləˈfræstɪk/","syllables":"ho-lo-phras-tic"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be used in comparative or superlative constructions with 'more' and 'most' or 'less' and 'least'"},"usage_notes":{"explanation":"'Holophrastic' describes a stage in language acquisition where a single word is used to express a more complex meaning, similar to a phrase or sentence. Context, tone, and gestures are crucial for understanding the intended meaning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The sentence was holophrastic because it was short.","correct":"✓ The utterance was holophrastic because the single word conveyed a complex meaning.","note":"Holophrastic refers to a single word expressing a complex idea, not just any short sentence."}],"priority":"★★☆"},"related_words":{"derivatives":["holophrase (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'holophrastic' is a specialized term in linguistics, specifically related to child language acquisition. It refers to the stage where children use single words to convey complex ideas, relying heavily on context and intonation. This term is not commonly used outside of academic or professional discussions of language development."},"example_sentences":[{"sentence":"The child used 'milk' as a holophrastic utterance to mean 'I want milk'.","translation":"その子供は「ミルク」を「ミルクが欲しい」という意味の一語文として使った。","type":"adjective","meaning_category":"一語文の"},{"sentence":"During the holophrastic stage, parents often interpret their child's single words based on the situation.","translation":"一語文段階の間、親はしばしば状況に基づいて子供の単語一つを解釈する。","type":"adjective","meaning_category":"一語文段階の"}]}