{"word":"Hindi-Urdu","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ヒンディー語とウルドゥー語を合わせた言語、またはその共通の口語形","english_definition":"a language spoken in India and Pakistan, which has two standard forms, Hindi and Urdu. The spoken form is largely the same, but the written forms and some vocabulary differ.","examples":[{"sentence":"Hindi-Urdu is a widely spoken language in the Indian subcontinent.","translation":"ヒンディー・ウルドゥー語はインド亜大陸で広く話されている言語です。"},{"sentence":"The grammar of Hindi-Urdu is relatively consistent across its dialects.","translation":"ヒンディー・ウルドゥー語の文法は、その方言間で比較的整合性があります。"}],"collocations":["spoken Hindi-Urdu (口語ヒンディー・ウルドゥー語)","written Hindi-Urdu (筆記ヒンディー・ウルドゥー語)","Hindi-Urdu grammar (ヒンディー・ウルドゥー語の文法)","Hindi-Urdu vocabulary (ヒンディー・ウルドゥー語の語彙)"],"synonyms":["Hindustani","Hindi","Urdu"],"antonyms":[]}],"etymology":{"value":"「Hindi」はペルシア語で「インドの」を意味する「Hind」に由来し、「Urdu」はテュルク語で「軍隊の陣営」を意味する「Ordu」に由来する。この言語は、インド亜大陸で異なる文化が交流する中で発展した。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɪndi ˈʊərduː/","syllables":"Hin-di-Ur-du"},"inflection":{"notes":"不可算名詞"},"usage_notes":{"explanation":"「**Hindi-Urdu**」は、ヒンディー語とウルドゥー語という2つの標準形を持つ言語を指します。口語レベルでは非常に似通っており、相互に理解可能です。しかし、書き言葉としては、ヒンディー語はデーヴァナーガリー文字を使用し、サンスクリット語からの借用語を多く含みます。一方、ウルドゥー語はペルシア・アラビア文字を使用し、ペルシア語やアラビア語からの借用語を多く含みます。そのため、公式な文脈や文学作品では、両言語の違いがより顕著になります。また、「Hindustani」という用語も、この言語の口語形を指すことがあります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Hindi-Urdu are spoken in India.","correct":"✓ Hindi-Urdu is spoken in India.","note":"「Hindi-Urdu」は一つの言語を指すため、単数扱いとなります。"},{"incorrect":"✗ Hindi and Urdu is the same language.","correct":"✓ Hindi and Urdu are the same language.","note":"「Hindi and Urdu」は2つの言語を指すため、複数扱いとなります。ただし、口語形を指す場合は「Hindi-Urdu」として単数扱いが適切です。"}],"priority":"★★☆"},"related_words":{"derivatives":["Hindustani (名詞/形容詞: ヒンドゥスターニー語、ヒンドゥスターンの)","Hindi (名詞: ヒンディー語)","Urdu (名詞: ウルドゥー語)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (言語名のため)","frequency_google_ngram":"中頻度 (Moderate frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Hindi-Urdu**」は、インドとパキスタンで話されている言語の名前です。口で話すときは、ほとんど同じですが、書くときにはヒンディー語とウルドゥー語で使う文字が違います。ヒンディー語はインドでよく使われ、ウルドゥー語はパキスタンでよく使われます。この言語について話すときは、書くときと話すときの違いに注意することが大切です。"},"example_sentences":[{"sentence":"Many Bollywood films use a simplified version of Hindi-Urdu that is easily understood by a wide audience.","translation":"多くのボリウッド映画は、幅広い観客に理解しやすいヒンディー・ウルドゥー語の簡略化されたバージョンを使用しています。","type":"general","meaning_category":"言語"},{"sentence":"Learning Hindi-Urdu can provide insights into both Indian and Pakistani culture.","translation":"ヒンディー・ウルドゥー語を学ぶことは、インドとパキスタンの両方の文化への洞察を提供することができます。","type":"general","meaning_category":"言語"},{"sentence":"While the spoken forms of Hindi and Urdu are very similar, their literary traditions differ significantly.","translation":"ヒンディー語とウルドゥー語の口語形は非常に似ていますが、その文学的伝統は大きく異なります。","type":"comparison","meaning_category":"言語"}]}