{"word":"imperialism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"帝国主義","english_definition":"A policy of extending a country's power and influence through colonization, use of military force, or other means.","examples":[{"sentence":"European imperialism had a profound impact on the world.","translation":"ヨーロッパの帝国主義は世界に深い影響を与えた。"},{"sentence":"Critics argue that globalization is a form of economic imperialism.","translation":"批評家たちはグローバル化は経済的帝国主義の一形態だと主張する。"},{"sentence":"The legacy of imperialism continues to shape international relations.","translation":"帝国主義の遺産は国際関係を形成し続けている。"}],"collocations":["colonial imperialism","economic imperialism","cultural imperialism","new imperialism","anti-imperialism","the age of imperialism","imperialist policies"],"synonyms":["colonialism","expansionism","hegemony","domination","supremacy"],"antonyms":["isolationism","nationalism","self-determination"]},{"part_of_speech":"noun","definition":"（比喩的に）ある集団・組織などが他に対して影響力を行使しようとする傾向","english_definition":"(figuratively) The tendency of a group, organization, etc., to exert influence over others.","examples":[{"sentence":"The company's aggressive marketing tactics were seen as a form of corporate imperialism.","translation":"その会社の積極的なマーケティング戦術は企業帝国主義の一形態と見なされた。"},{"sentence":"Some accuse the university of academic imperialism.","translation":"ある人々はその大学を学問的帝国主義だと非難する。"}],"collocations":["corporate imperialism","cultural imperialism","academic imperialism"],"synonyms":["domination","influence","control","hegemony"],"antonyms":["equality","cooperation","decentralization"]}],"etymology":{"value":"The term 'imperialism' comes from the Latin word 'imperium,' meaning 'command' or 'empire.' It emerged in the mid-19th century to describe the policies of European powers in acquiring and controlling overseas territories.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪmˈpɪəriəlɪzəm/","syllables":"im-pe-ri-al-ism"},"inflection":{"notes":"Uncountable noun"},"usage_notes":{"explanation":"'Imperialism' refers to the practice of a nation extending its control over other territories or nations, often through political, economic, or military means. It can also refer to the ideologies that justify such practices. The term is often used critically, highlighting the exploitation and oppression that can result from imperialist policies. It is important to distinguish between 'imperialism' and 'colonialism,' although the terms are often used interchangeably. Colonialism is a specific form of imperialism that involves the settlement and direct control of a territory and its people.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He supports imperialism because it brings benefits to the colonies.","correct":"✓ He supports imperialism, arguing that it brings benefits to the colonies.","note":"While some may argue that imperialism brings benefits, it's important to present this as an argument or perspective, not as a universally accepted fact."},{"incorrect":"✗ Imperialism is only about military conquest.","correct":"✓ Imperialism involves not only military conquest but also economic and cultural domination.","note":"Imperialism encompasses various forms of control, including economic and cultural influence, not just military conquest."}],"priority":"★★☆"},"related_words":{"derivatives":["imperialist (noun/adjective)","imperialistic (adjective)","anti-imperialism (noun)","neo-imperialism (noun)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively frequent, especially in historical and political contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Imperialism' is a complex term that describes the policy of a country extending its power and influence over other territories, often through colonization or military force. It's a concept frequently discussed in history, political science, and international relations. Understanding the term requires recognizing its historical context and the various forms it can take, including economic and cultural imperialism. It's important to be aware of the critical perspectives associated with imperialism, which often highlight its negative impacts on colonized populations."},"example_sentences":[{"sentence":"The museum exhibit explored the history of British imperialism in India.","translation":"その博物館の展示は、インドにおけるイギリス帝国主義の歴史を探求した。","type":"noun","meaning_category":"political/historical"},{"sentence":"Some scholars argue that contemporary globalization is a form of neo-imperialism.","translation":"現代のグローバル化は新帝国主義の一形態だと主張する学者もいる。","type":"noun","meaning_category":"political/economic"},{"sentence":"The anti-imperialism movement gained momentum in the early 20th century.","translation":"反帝国主義運動は20世紀初頭に勢いを増した。","type":"noun","meaning_category":"political/social"},{"sentence":"The company's expansion into new markets was criticized as corporate imperialism.","translation":"その会社の新市場への拡大は企業帝国主義として批判された。","type":"noun","meaning_category":"figurative/economic"}]}