{"word":"noneconomy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"非経済的な状態、経済的でないこと、経済活動以外の分野","english_definition":"A state of being noneconomic; something that is not related to the economy.","examples":[{"sentence":"His decision was based on social values, reflecting a noneconomy approach.","translation":"彼の決定は社会的な価値観に基づいており、非経済的なアプローチを反映していた。"},{"sentence":"The project's focus on environmental protection represents a shift towards noneconomy considerations.","translation":"そのプロジェクトの環境保護への重点は、非経済的な考慮事項への移行を示している。"}],"collocations":["noneconomy sector","noneconomy factors","noneconomy considerations","noneconomy activities"],"synonyms":["nonfinancial","noncommercial","social","environmental","cultural"],"antonyms":["economy","economic","financial","commercial"]},{"part_of_speech":"adjective","definition":"非経済的な、経済的でない","english_definition":"Not economic; unrelated to economic activity.","examples":[{"sentence":"The noneconomy benefits of the program include improved public health.","translation":"そのプログラムの非経済的な利点には、公衆衛生の改善が含まれる。"},{"sentence":"We need to consider the noneconomy impacts of this policy.","translation":"この政策の非経済的な影響を考慮する必要がある。"}],"collocations":["noneconomy benefits","noneconomy impacts","noneconomy value","noneconomy factors"],"synonyms":["nonfinancial","noncommercial","social","environmental","cultural"],"antonyms":["economic","financial","commercial"]}],"etymology":{"value":"\"non-\" (否定) + \"economy\" (経済)","priority":"★★★"},"pronunciation":{"ipa":"/nɒnɪˈkɒnəmi/","syllables":"non-e-con-o-my"},"inflection":{"noun_plural":"noneconomies"},"usage_notes":{"explanation":"\"Noneconomy\" is used to describe aspects or factors that are not primarily related to financial or commercial considerations. It often refers to social, environmental, or cultural values that are considered alongside or instead of economic ones. The term is relatively uncommon and may not be widely recognized.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The noneconomy is growing rapidly.","correct":"✓ The noneconomic sector is growing rapidly.","note":"\"Noneconomy\" typically refers to the state of being non-economic or factors outside the economy, not a sector itself. Use \"noneconomic sector\" instead."},{"incorrect":"✗ We should focus only on noneconomy.","correct":"✓ We should focus not only on the economy.","note":"The intended meaning might be to focus on other aspects besides the economy. Rephrase to clarify the intended meaning."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["economic","economy","economics","noneconomic"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"noneconomy\" is a relatively uncommon term used to describe aspects or factors that are not primarily related to financial or commercial considerations. It often refers to social, environmental, or cultural values that are considered alongside or instead of economic ones. Understanding the prefix \"non-\" (meaning \"not\") and the base word \"economy\" is essential to grasping the meaning of this word. The term is more likely to be encountered in academic or specialized contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The museum's cultural contributions represent a significant noneconomy value to the community.","translation":"その博物館の文化的貢献は、地域社会にとって重要な非経済的な価値を表している。","type":"noun","meaning_category":"非経済的な価値"},{"sentence":"We must balance economic growth with noneconomy considerations such as environmental sustainability.","translation":"経済成長と、環境の持続可能性のような非経済的な考慮事項とのバランスを取らなければならない。","type":"adjective","meaning_category":"非経済的な"},{"sentence":"The government's decision to invest in renewable energy reflects a commitment to noneconomy goals.","translation":"再生可能エネルギーへの投資を決定した政府の決定は、非経済的な目標へのコミットメントを反映している。","type":"noun","meaning_category":"非経済的な目標"}]}