{"word":"Essenian","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"エッセネ派の人","english_definition":"a member of an ancient Jewish ascetic sect of the 2nd century BC – 1st century AD in Palestine, who lived in highly organized groups and held property in common. They are widely regarded as the authors of the Dead Sea Scrolls.","examples":[{"sentence":"The Essenes were known for their strict adherence to religious law.","translation":"エッセネ派は、宗教的法律への厳格な遵守で知られていた。"},{"sentence":"Some scholars believe that John the Baptist was influenced by the Essenes.","translation":"洗礼者ヨハネはエッセネ派の影響を受けていたと信じる学者もいる。"}],"collocations":["Dead Sea Scrolls and the Essenes","Essenes community","Essenes beliefs"],"synonyms":["ascetic","sectarian","Jewish mystic"],"antonyms":[]},{"part_of_speech":"adjective","definition":"エッセネ派の","english_definition":"relating to the Essenes or their beliefs and practices.","examples":[{"sentence":"Essenian texts provide valuable insights into Jewish life during the Second Temple period.","translation":"エッセネ派の文書は、第二神殿時代のユダヤ人の生活に関する貴重な洞察を提供する。"},{"sentence":"The Essenian philosophy emphasized purity and communal living.","translation":"エッセネ派の哲学は、純粋さと共同生活を強調した。"}],"collocations":["Essenian texts","Essenian community","Essenian philosophy"],"synonyms":["ascetic","sectarian","Jewish mystic"],"antonyms":[]}],"etymology":{"value":"From Late Latin *Esseni*, from Greek *Essēnoi*, probably from Aramaic *’Esáyya’* meaning 'healers'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈsiːniən/","syllables":"Es-se-ni-an"},"inflection":{"noun_plural":"Essenians"},"usage_notes":{"explanation":"The term \"Essenian\" refers to both the members of the Essene sect and anything related to them. The Essenes are most famous for their possible connection to the Dead Sea Scrolls, which were discovered near the Essene settlement of Qumran.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Essenians was a Jewish sect.","correct":"✓ The Essenians were a Jewish sect.","note":"Essenians is plural, so it requires the plural form of the verb 'to be' (were)."},{"incorrect":"✗ Essene philosophy is very influence.","correct":"✓ Essene philosophy is very influential.","note":"Influence is a noun or verb. The adjective form, influential, should be used to describe the philosophy."}],"priority":"★★☆"},"related_words":{"derivatives":["Essenism (the beliefs and practices of the Essenes)"],"phrases":["Dead Sea Scrolls","Qumran"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency. Primarily encountered in historical or religious contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"Essenian\" is relatively uncommon and primarily used in historical or religious contexts when discussing the Essenes, an ancient Jewish sect. Understanding of the term often requires familiarity with ancient Jewish history and the Dead Sea Scrolls. The word's usage is typically found in academic or specialized texts.","priority":"★★☆"},"example_sentences":[{"sentence":"Archaeologists have unearthed several sites believed to have been inhabited by the **Essenian** community.","translation":"考古学者は、エッセネ派の共同体が住んでいたと考えられているいくつかの遺跡を発掘した。","type":"adjective","meaning_category":"relating to the Essenes"},{"sentence":"The **Essenians** practiced a communal lifestyle, sharing their possessions and adhering to strict dietary laws.","translation":"エッセネ派は共同生活を実践し、所有物を共有し、厳格な食餌療法を遵守した。","type":"noun","meaning_category":"a member of the Essene sect"}]}