{"word":"bathymetry","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"水深測量、水深図作成","english_definition":"the measurement of ocean depths and the charting of the shape or topography of the ocean floor.","examples":[{"sentence":"Bathymetry is essential for understanding ocean currents.","translation":"水深測量は、海流を理解するために不可欠です。"},{"sentence":"High-resolution bathymetry can reveal details about underwater geological features.","translation":"高解像度の水深測量は、水中の地質学的特徴に関する詳細を明らかにすることができます。"},{"sentence":"The bathymetry data was used to create a three-dimensional map of the seabed.","translation":"水深測量データは、海底の3次元地図を作成するために使用されました。"}],"collocations":["bathymetric survey (水深測量調査)","high-resolution bathymetry (高解像度水深測量)","multibeam bathymetry (マルチビーム水深測量)","bathymetry data (水深測量データ)","bathymetry map (水深測量図)"],"synonyms":["hydrography","sounding","depth measurement"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の「bathys」（深い）と「metron」（測定）に由来する。","priority":"★★★"},"pronunciation":{"ipa":"/bəˈθɪmətri/","syllables":"ba-thy-me-try"},"inflection":{"noun_plural":"bathymetries"},"usage_notes":{"explanation":"Bathymetry is analogous to topography, but applied to underwater environments. It involves measuring the depth of a body of water and mapping the underwater terrain. Various techniques are used, including sonar, satellite altimetry, and multibeam echosounders.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Bathymetry is the study of the atmosphere.","correct":"✓ Bathymetry is the study of underwater depths.","note":"Bathymetry deals with underwater depths, not the atmosphere."},{"incorrect":"✗ Bathymetry only measures the surface of the water.","correct":"✓ Bathymetry measures the depth and maps the underwater terrain.","note":"Bathymetry measures the depth and creates maps of the underwater terrain, not just the surface."}],"priority":"★★☆"},"related_words":{"derivatives":["bathymetric (形容詞: 水深測量の)","bathymetrically (副詞: 水深測量的に)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Bathymetry**」は、海や湖などの水深を測って、海底の地形を地図にすることを意味する専門用語です。陸地の地形を測る「topography」の水中版と考えると分かりやすいでしょう。この情報は、海流の研究や海底資源の探査、航海の安全確保などに役立ちます。専門的な分野で使われる言葉なので、一般の会話ではあまり使いません。"},"example_sentences":[{"sentence":"The research vessel used multibeam sonar to conduct a detailed bathymetry survey.","translation":"調査船は、詳細な水深測量調査を実施するためにマルチビームソナーを使用しました。","type":"example","meaning_category":"水深測量調査"},{"sentence":"The bathymetry of the lake revealed a previously unknown deep trench.","translation":"その湖の水深測量により、以前は知られていなかった深い溝が明らかになった。","type":"example","meaning_category":"水深測量"}]}