{"word":"Rhacophorus","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アオガエル属","english_definition":"A genus of arboreal (tree-dwelling) frogs in the family Rhacophoridae, found in tropical and subtropical Asia. They are characterized by their ability to glide using expanded webbing between their toes.","examples":[{"sentence":"Several species of frogs belong to the genus Rhacophorus.","translation":"数種のカエルがアオガエル属に属する。"},{"sentence":"Rhacophorus nigropalmatus is a gliding frog known for its black webbed feet.","translation":"Rhacophorus nigropalmatusは、黒い水かきのある足で知られる滑空ガエルです。"}],"collocations":["Rhacophorus kioensis","Rhacophorus reinwardtii","gliding frog","tree frog"],"synonyms":["tree frog","gliding frog"],"antonyms":[]}],"etymology":{"value":"The name Rhacophorus comes from the Greek words \"rhakos\" (ῥάκος) meaning \"rag\" or \"tatter\" and \"phoros\" (φόρος) meaning \"bearing\" or \"carrying\". This likely refers to the webbed feet of these frogs, which resemble tattered or ragged wings.","priority":"★★☆"},"pronunciation":{"ipa":"/rəˈkɒfərəs/","syllables":"Rha-co-pho-rus"},"inflection":{"noun_plural":"Rhacophoruses or Rhacophora (scientific plural)"},"usage_notes":{"explanation":"Rhacophorus is a scientific genus name, primarily used in zoology and herpetology. When referring to a specific species, the genus name is followed by the species name (e.g., Rhacophorus dennysi). In general conversation, these frogs may be referred to as gliding frogs or tree frogs.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Rhacophorus are a type of bird.","correct":"✓ Rhacophorus are a type of frog.","note":"Rhacophorus refers to a genus of frogs, not birds."},{"incorrect":"✗ Rhacophoruss is a frog.","correct":"✓ Rhacophorus is a frog.","note":"Rhacophorus is already the genus name; do not add an extra 's' to make it plural when referring to the genus in general."}],"priority":"★★☆"},"related_words":{"derivatives":["Rhacophoridae (family to which Rhacophorus belongs)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (scientific term)","frequency_google_ngram":"Low frequency (scientific literature)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Rhacophorus' is a scientific term used in biology, specifically to classify a genus of tree frogs known for their gliding abilities. It is not commonly used in everyday language and is primarily found in scientific literature or discussions related to zoology and herpetology. Understanding this term requires a background in biology or a specific interest in amphibians.","note":"This word is specific to scientific contexts and not generally used."},"example_sentences":[{"sentence":"The Rhacophorus genus includes several species of gliding frogs found in Southeast Asia.","translation":"アオガエル属には、東南アジアに生息する数種類の滑空ガエルが含まれています。","type":"noun","meaning_category":"アオガエル属"},{"sentence":"Scientists are studying the gliding mechanisms of Rhacophorus pardalis.","translation":"科学者たちは、ハラジロミドリガエルの滑空メカニズムを研究しています。","type":"noun","meaning_category":"アオガエル属"}]}