{"word":"Allis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(魚)アリス (ニシン科の魚の一種)","english_definition":"A species of fish, the allis shad (Alosa alosa), a member of the herring family.","examples":[{"sentence":"The Allis shad is a migratory fish.","translation":"アリスは回遊魚です。"},{"sentence":"Allis are found in European rivers.","translation":"アリスはヨーロッパの河川で見られます。"}],"collocations":["Allis shad","European Allis"],"synonyms":["allis shad","Alosa alosa"],"antonyms":[]}],"etymology":{"value":"Derived from Middle English, possibly from Old French alose, ultimately from Gaulish.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈælɪs/","syllables":"Al-lis"},"inflection":{"noun_plural":"Allis"},"usage_notes":{"explanation":"'Allis' refers specifically to the fish species Alosa alosa, also known as the Allis shad. It's a relatively uncommon word unless discussing specific fish species or European river ecosystems.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw many Allis in the sea.","correct":"✓ I saw many Allis in the river.","note":"Allis are typically found in rivers, not the sea, as they are migratory fish that spawn in rivers."}],"priority":"★☆☆"},"related_words":{"derivatives":["Shad","Herring"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Allis' is a specialized term referring to a specific species of fish, Alosa alosa. It's unlikely to be encountered outside of contexts related to ichthyology, European river ecosystems, or specific discussions about fish populations. Understanding this term requires a relatively advanced vocabulary and familiarity with biological nomenclature."},"example_sentences":[{"sentence":"The population of Allis has declined in recent years due to habitat loss.","translation":"生息地の喪失により、近年アリスの個体数が減少しています。","type":"noun","meaning_category":"Fish species"},{"sentence":"Scientists are studying the migration patterns of the Allis in the Loire River.","translation":"科学者たちはロワール川のアリスの回遊パターンを研究しています。","type":"noun","meaning_category":"Fish species"}]}