{"word":"Bromeliaceae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"パイナップル科","english_definition":"The pineapple family of monocot flowering plants containing around 75 genera and 3,590 known species.","examples":[{"sentence":"Bromeliaceae are native to the tropical Americas, with a few species found in tropical West Africa.","translation":"パイナップル科の植物は熱帯アメリカ原産で、一部の種は熱帯西アフリカに分布しています。"},{"sentence":"Many Bromeliaceae are epiphytes, growing on other plants without harming them.","translation":"多くのパイナップル科植物は着生植物で、他の植物に害を与えることなく生育します。"}],"collocations":["Bromeliaceae family","species of Bromeliaceae","cultivation of Bromeliaceae"],"synonyms":["pineapple family"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name *Bromelia*, which was named in honor of Swedish botanist Olaf Bromelius (1639-1705) + the suffix '-aceae' which denotes a plant family.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌbroʊmɪliˈeɪsiːˌaɪ/","syllables":"Bro-me-li-a-ce-ae"},"inflection":{"noun_plural":"Bromeliaceaes or Bromeliaceae"},"usage_notes":{"explanation":"*Bromeliaceae* refers to the plant family itself. Individual plants are referred to by their genus and species names (e.g., *Ananas comosus* for pineapple). The family is known for its diverse forms, including epiphytes, terrestrial plants, and tank bromeliads that collect water in their leaf axils.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Bromeliaceae is a type of orchid.","correct":"✓ Bromeliaceae is a distinct plant family, different from orchids.","note":"Bromeliaceae are often confused with other tropical plants, but they are a distinct family."}],"priority":"★★☆"},"related_words":{"derivatives":["bromeliad"],"genera":["Aechmea","Ananas","Billbergia","Guzmania","Tillandsia","Vriesea"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in botanical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term *Bromeliaceae* is a botanical term referring to the pineapple family. It is primarily used in scientific and horticultural contexts. Understanding this term requires familiarity with botanical nomenclature and plant classification systems. The family includes well-known plants like pineapples and Spanish moss, as well as many ornamental species.","note":"This explanation assumes a reader with some background in botany or horticulture."},"example_sentences":[{"sentence":"*Tillandsia* is a large genus within the *Bromeliaceae* family.","translation":"チランジアはパイナップル科の大きな属の一つです。","type":"scientific","meaning_category":"classification"},{"sentence":"Many species of *Bromeliaceae* are popular as houseplants due to their striking foliage and relatively easy care.","translation":"パイナップル科の多くの種は、その印象的な葉と比較的容易な手入れのために、観葉植物として人気があります。","type":"horticultural","meaning_category":"cultivation"}]}