{"word":"outgoing-eyed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"目が外向的な、好奇心旺盛な目をしている、社交的な目をしている","english_definition":"Having eyes that express sociability, curiosity, or a friendly and engaging nature.","examples":[{"sentence":"The puppy was outgoing-eyed and playful, immediately running up to greet us.","translation":"その子犬は外向的な目をキラキラさせ、遊び好きで、すぐに駆け寄ってきて私たちを迎えた。"},{"sentence":"She was an outgoing-eyed girl, always eager to meet new people and explore new places.","translation":"彼女は外向的な目をした女の子で、いつも新しい人に会ったり、新しい場所を探検したりすることを熱望していた。"},{"sentence":"His outgoing-eyed gaze made everyone feel comfortable and welcome.","translation":"彼の外向的な視線は、誰もが心地よく、歓迎されていると感じさせた。"}],"collocations":["outgoing-eyed puppy","outgoing-eyed child","outgoing-eyed gaze","outgoing-eyed expression","outgoing-eyed and friendly"],"synonyms":["sociable-eyed","friendly-eyed","engaging-eyed","approachable-eyed","curious-eyed"],"antonyms":["introverted-eyed","shy-eyed","reserved-eyed","withdrawn-eyed"]}],"etymology":{"value":"A compound word formed by combining 'outgoing' (expressing a friendly and sociable nature) and 'eyed' (having eyes of a specified kind). The term describes eyes that reflect an open, friendly, and engaging personality.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌaʊtˌɡoʊɪŋ ˈaɪd/","syllables":"out-go-ing-eyed"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Outgoing-eyed' is a descriptive adjective used to characterize someone whose eyes convey a sense of friendliness, openness, and sociability. It suggests that the person is approachable and has a positive, engaging demeanor. This term is often used in literature or descriptive writing to quickly convey a character's personality through their eyes.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was outgoing eyed.","correct":"✓ He was outgoing-eyed.","note":"The hyphen is important to correctly form the compound adjective 'outgoing-eyed'."},{"incorrect":"✗ She has outgoing eye.","correct":"✓ She has outgoing-eyed look.","note":"When using 'outgoing-eyed', it is used to describe the overall look or expression in the eyes, not a single eye."}],"priority":"☆☆☆"},"related_words":{"derivatives":["outgoingness (noun: the quality of being outgoing)","eyed (suffix: having eyes of a specified kind)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A (not a standard CEFR word)","frequency_google_ngram":"Low frequency (not commonly found in general text)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Outgoing-eyed' is a specialized and descriptive adjective, typically used in literary or descriptive contexts to convey a specific characteristic through someone's eyes. It implies that the person's eyes reflect an open, friendly, and sociable nature. Due to its specific and uncommon usage, it is more likely to be encountered in advanced reading materials or creative writing. Understanding the meanings of 'outgoing' and 'eyed' helps in deciphering the compound word's overall meaning."},"example_sentences":[{"sentence":"The new student was outgoing-eyed and quickly made friends in class.","translation":"その転校生は外向的な目をしていたので、すぐにクラスで友達を作った。","type":"adjective","meaning_category":"目が外向的な"},{"sentence":"Her outgoing-eyed expression put me at ease during the interview.","translation":"彼女の外向的な目の表情は、面接中、私を安心させた。","type":"adjective","meaning_category":"社交的な目をしている"},{"sentence":"The outgoing-eyed puppy wagged its tail excitedly.","translation":"その外向的な目をした子犬は、興奮して尻尾を振った。","type":"adjective","meaning_category":"好奇心旺盛な目をしている"}]}