{"word":"nonextrinsic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"非外因性の、外部からの影響を受けない、本質的な","english_definition":"Not extrinsic; not coming from or depending on external factors; inherent or intrinsic.","examples":[{"sentence":"The value of the artwork is nonextrinsic; it resides in its inherent beauty and artistic merit.","translation":"その芸術作品の価値は非外因性である。それはその本質的な美しさと芸術的価値に存在する。"},{"sentence":"The plant's resistance to the disease is nonextrinsic, meaning it is genetically determined rather than acquired from environmental factors.","translation":"その植物の病気に対する抵抗性は非外因性であり、環境要因から獲得されたものではなく、遺伝的に決定されていることを意味する。"}],"collocations":["nonextrinsic value","nonextrinsic property","nonextrinsic characteristic"],"synonyms":["intrinsic","inherent","essential","internal"],"antonyms":["extrinsic","external","acquired","superficial"]}],"etymology":{"value":"\"non-\" (否定) + \"extrinsic\" (外因性の)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnɪkˈstrɪnsɪk/","syllables":"non-ex-trin-sic"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"\"**Nonextrinsic**\" is used to describe something whose characteristics or value are not derived from external sources or influences. It emphasizes that the quality is inherent or intrinsic to the object or concept itself. It is often used in philosophical, scientific, and artistic contexts to distinguish between qualities that are inherent and those that are acquired or imposed from the outside.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonextrinsic factors affected the outcome.","correct":"✓ The extrinsic factors affected the outcome.","note":"\"Nonextrinsic\" refers to internal or inherent factors, while \"extrinsic\" refers to external factors. Using \"nonextrinsic\" to describe external influences is incorrect."},{"incorrect":"✗ The value is extrinsic, not nonextrinsic.","correct":"✓ The value is intrinsic, not extrinsic.","note":"Make sure to use the correct antonym. The opposite of \"extrinsic\" is \"intrinsic,\" not \"nonextrinsic.\" While \"nonextrinsic\" can be used, \"intrinsic\" is more commonly used to emphasize inherent qualities."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["intrinsic","extrinsic"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency (低頻度)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"**Nonextrinsic**\" is a relatively uncommon word that means something is not coming from the outside. Instead, it's a quality that is already part of something. For example, if you say the value of a painting is \"nonextrinsic,\" you mean its value comes from its own beauty, not from how famous the artist is or how much people are willing to pay for it. It's the opposite of \"extrinsic,\" which means coming from the outside. This word is often used in more formal or academic writing."},"example_sentences":[{"sentence":"The diamond's brilliance is a nonextrinsic property, inherent to its crystalline structure.","translation":"そのダイヤモンドの輝きは非外因性の特性であり、その結晶構造に固有のものである。","type":"adjective","meaning_category":"本質的な"},{"sentence":"The ethical value of an act should be judged by its nonextrinsic worth, not by its consequences.","translation":"行為の倫理的価値は、その結果ではなく、その非外因的な価値によって判断されるべきである。","type":"adjective","meaning_category":"本質的な"},{"sentence":"The nonextrinsic motivation of the students led to a deeper understanding of the subject matter.","translation":"学生たちの非外因的な動機は、主題に対するより深い理解につながった。","type":"adjective","meaning_category":"本質的な"}]}