{"word":"oryctognostic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"鉱物鑑定の、鉱物学的な","english_definition":"Relating to or characterized by oryctognosy (the science dealing with the systematic arrangement and classification of minerals).","examples":[{"sentence":"The oryctognostic properties of the mineral were carefully examined.","translation":"その鉱物の鉱物鑑定的な特性が注意深く調べられた。"},{"sentence":"The oryctognostic classification of the rock samples was completed by the geologist.","translation":"岩石標本の鉱物学的分類は地質学者によって完了された。"}],"collocations":["oryctognostic analysis","oryctognostic properties","oryctognostic classification"],"synonyms":["mineralogical","petrographic"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'orycto-' (referring to minerals or fossils) and 'gnostic' (relating to knowledge or knowing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɔːrɪkˌtɒɡˈnɒstɪk/","syllables":"o-ryc-tog-nos-tic"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than comparative and superlative forms, which are rare for this word."},"usage_notes":{"explanation":"The term 'oryctognostic' is highly specialized and primarily used within the field of mineralogy and geology. It describes something related to the identification and classification of minerals based on their physical and chemical properties. It is not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The oryctognostic painting depicted minerals.","correct":"✓ The mineralogical painting depicted minerals.","note":"'Oryctognostic' refers to the science of classifying minerals, not simply depicting them. 'Mineralogical' is more appropriate in this context."}],"priority":"★☆☆"},"related_words":{"derivatives":["oryctognosy (noun: 鉱物学)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very specialized vocabulary)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Oryctognostic' is a highly specialized term used in the fields of mineralogy and geology. It refers to the science of classifying and identifying minerals based on their physical and chemical properties. Due to its technical nature, it is not commonly encountered outside of these specific academic and professional contexts."},"example_sentences":[{"sentence":"The museum exhibited a detailed oryctognostic collection of rare minerals.","translation":"その博物館は、希少な鉱物の詳細な鉱物学的なコレクションを展示した。","type":"adjective","meaning_category":"鉱物鑑定の"},{"sentence":"An oryctognostic study was conducted to determine the composition of the newly discovered ore.","translation":"新しく発見された鉱石の組成を決定するために、鉱物鑑定研究が実施された。","type":"adjective","meaning_category":"鉱物学的な"}]}