{"word":"cable-stitch","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ケーブル編み、縄編み","english_definition":"A knitting stitch that creates a pattern resembling twisted rope or cables.","examples":[{"sentence":"The sweater featured a beautiful cable-stitch design.","translation":"そのセーターは美しいケーブル編みのデザインが特徴だった。"},{"sentence":"She's learning how to do a cable-stitch.","translation":"彼女はケーブル編みのやり方を学んでいる。"}],"collocations":["cable-stitch pattern","cable-stitch sweater","do a cable-stitch"],"synonyms":["cable knit","rope stitch"],"antonyms":[]}],"etymology":{"value":"'Cable' refers to the rope-like appearance of the stitch, and 'stitch' refers to the individual loop of yarn created in knitting.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkeɪbəl ˌstɪtʃ/","syllables":"ca-ble-stitch"},"inflection":{"noun_plural":"cable-stitches"},"usage_notes":{"explanation":"'Cable-stitch' is primarily used in the context of knitting and refers to a specific type of stitch that creates a raised, rope-like design. It's a decorative stitch often used in sweaters, blankets, and other knitted items.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm doing a cable stitch on my crochet project.","correct":"✓ I'm doing a cable stitch on my knitting project.","note":"Cable-stitch is a knitting technique, not a crochet technique."}],"priority":"★★☆"},"related_words":{"derivatives":["cable knit (noun: ケーブル編みのニット)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'cable-stitch' refers to a specific technique in knitting, creating a textured, rope-like pattern. Understanding this term requires familiarity with knitting terminology. It's commonly found in patterns and instructions for knitting projects. The complexity arises from understanding the process of creating the stitch, which involves manipulating groups of stitches to create the cable effect."},"example_sentences":[{"sentence":"The intricate cable-stitch of the Aran sweater is a traditional design.","translation":"アランセーターの複雑なケーブル編みは伝統的なデザインです。","type":"noun","meaning_category":"ケーブル編み"},{"sentence":"She spent hours perfecting the cable-stitch on her scarf.","translation":"彼女はスカーフのケーブル編みを完璧にするために何時間も費やした。","type":"noun","meaning_category":"ケーブル編み"}]}