{"word":"colourtype","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A classification of people based on their skin, hair, and eye colour, used in fashion and beauty to determine which colours are most flattering.","english_definition":"A system of classifying people according to their skin, hair, and eye colour to determine which colours of clothing and makeup suit them best.","examples":[{"sentence":"Knowing your colourtype can help you choose the right shades of clothing and makeup.","translation":"自分のカラータイプを知ることは、自分に合った服やメイクの色を選ぶのに役立ちます。"},{"sentence":"She had her colourtype analyzed by a professional stylist.","translation":"彼女はプロのスタイリストにカラータイプを分析してもらいました。"}],"collocations":["seasonal colourtype","colourtype analysis","determine colourtype","know your colourtype"],"synonyms":["color season","seasonal color analysis"],"antonyms":[]}],"etymology":{"value":"A compound word formed from 'colour' (or 'color') and 'type'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkʌləˌtaɪp/","syllables":"col-our-type"},"inflection":{"noun_plural":"colourtypes"},"usage_notes":{"explanation":"The term 'colourtype' is primarily used in the context of personal styling and fashion. It refers to the practice of categorizing individuals into different groups (often based on seasons like 'spring', 'summer', 'autumn', and 'winter') to identify which colours complement their natural features. The spelling 'colourtype' is more common in British English, while 'colortype' is more common in American English.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I am a summer colour type.","correct":"✓ I am a summer colourtype.","note":"The term is a single word, so it should be written as 'colourtype' (or 'colortype')."}],"priority":"★★☆"},"related_words":{"derivatives":["colour analysis","colour consultant","seasonal colour analysis"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Colourtype' refers to a system used in fashion and beauty to classify people based on their natural coloring (skin, hair, and eyes). The goal is to identify which colors of clothing and makeup will best enhance their appearance. This concept is most commonly associated with seasonal color analysis, where individuals are categorized into groups like 'spring', 'summer', 'autumn', or 'winter'. Understanding your colourtype can be helpful for making informed decisions about your wardrobe and beauty choices."},"example_sentences":[{"sentence":"She discovered she was a 'winter' colourtype after a professional consultation.","translation":"プロのコンサルタントに相談した後、彼女は自分が「冬」のカラータイプだと気づきました。","type":"noun","meaning_category":"Classification based on colour"},{"sentence":"Many people find that understanding their colourtype simplifies their shopping experience.","translation":"多くの人が、自分のカラータイプを理解することで、買い物が簡単になると感じています。","type":"noun","meaning_category":"Classification based on colour"}]}