{"word":"Symmedian","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(幾何学) 中線と等角な線、シム中央線","english_definition":"(geometry) A line through a triangle's vertex that is the reflection of the median through that vertex over the angle bisector through that vertex.","examples":[{"sentence":"The symmedian point is the intersection of the three symmedians of a triangle.","translation":"シム中央点は、三角形の3本のシム中央線の交点です。"}],"collocations":["symmedian point","symmedian triangle","symmedian axis"],"synonyms":["isogonal conjugate of the median"],"antonyms":[]}],"etymology":{"value":"'Sym-' (symmetric) + 'median'.","priority":"★★★"},"pronunciation":{"ipa":"/sɪmˈmiːdiən/","syllables":"sym-me-di-an"},"inflection":{"noun_plural":"symmedians"},"usage_notes":{"explanation":"The symmedian is a line segment associated with a triangle. It passes through a vertex of the triangle and is the reflection of the median about the angle bisector at that vertex. The three symmedians of a triangle are concurrent at a point called the symmedian point (or Lemoine point or Grebe point).","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["symmedian point","Lemoine point","Grebe point","median","angle bisector","isogonal conjugate"],"related_terms":["triangle","geometry","vertex","concurrent"],"priority":"★★★"},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term 'symmedian' is a specialized term in geometry, specifically related to triangles. It refers to a line segment that is the isogonal conjugate of the median of a triangle. Understanding this term requires a solid foundation in triangle geometry and related concepts such as medians, angle bisectors, and isogonal conjugates."},"example_sentences":[{"sentence":"The three symmedians of a triangle are concurrent at the symmedian point.","translation":"三角形の3本のシム中央線はシム中央点で交わります。","type":"definition"},{"sentence":"The symmedian is the isogonal conjugate of the median.","translation":"シム中央線は中線の等角共役線です。","type":"property"}]}