{"word":"property-based","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"特性に基づいた、性質に基づいた","english_definition":"Relating to or based on the properties or characteristics of something.","examples":[{"sentence":"The company uses a property-based testing approach to ensure the reliability of its software.","translation":"その会社は、ソフトウェアの信頼性を確保するために、特性に基づいたテストアプローチを使用しています。"},{"sentence":"Property-based encryption relies on the inherent properties of certain mathematical problems.","translation":"特性に基づいた暗号化は、特定の数学的問題の固有の特性に依存しています。"},{"sentence":"The researchers developed a property-based model to predict the behavior of the material under different conditions.","translation":"研究者たちは、さまざまな条件下での材料の挙動を予測するために、特性に基づいたモデルを開発しました。"}],"collocations":["property-based testing","property-based encryption","property-based model","property-based approach","property-based analysis"],"synonyms":["characteristic-based","attribute-based","feature-based","quality-based"],"antonyms":["value-based","rule-based","instance-based"]}],"etymology":{"value":"The term is formed by combining 'property' (a characteristic or attribute) with '-based' (meaning 'founded on' or 'relying on').","priority":"★★★"},"pronunciation":{"ipa":"/ˈprɒpərtiˌbeɪst/","syllables":"prop-er-ty-based"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"'Property-based' is often used in technical contexts, especially in computer science, engineering, and materials science. It signifies that a method, system, or analysis is designed around the inherent qualities or attributes of the subject matter, rather than specific instances or predefined rules.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The design is based on the property.","correct":"✓ The design is property-based.","note":"'Property-based' is an adjective and should be used to describe the type of design, not as a replacement for 'based on the property'."}],"priority":"★★☆"},"related_words":{"derivatives":["property (noun)","based (adjective)"],"related_terms":["attribute-based testing","feature engineering","characteristic analysis"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The adjective 'property-based' is used in technical and academic contexts to describe something that is designed or analyzed based on the inherent qualities or attributes of a subject. It's often used to differentiate an approach from one that is rule-based or instance-based. Understanding this term requires a grasp of abstract concepts and technical vocabulary."},"example_sentences":[{"sentence":"The new algorithm uses a property-based approach to identify fraudulent transactions.","translation":"新しいアルゴリズムは、不正な取引を識別するために特性に基づいたアプローチを使用しています。","type":"general","meaning_category":"approach"},{"sentence":"Property-based learning allows the system to generalize from a small number of examples.","translation":"特性に基づいた学習により、システムは少数の例から一般化できます。","type":"general","meaning_category":"learning"},{"sentence":"The security system relies on property-based access control.","translation":"そのセキュリティシステムは、特性に基づいたアクセス制御に依存しています。","type":"technical","meaning_category":"security"}]}