{"word":"metallograph","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"金属組織顕微鏡、金属顕微鏡","english_definition":"An optical microscope designed for the examination and photography of the microstructure of metals and alloys.","examples":[{"sentence":"The metallograph was used to analyze the grain structure of the steel sample.","translation":"その金属組織顕微鏡は、鋼鉄試料の結晶粒組織を分析するために使用された。"},{"sentence":"Metallographs are essential tools in materials science for studying the properties of metals.","translation":"金属組織顕微鏡は、金属の特性を研究するための材料科学における不可欠なツールである。"}],"collocations":["optical metallograph","inverted metallograph","digital metallograph"],"synonyms":["microscope","optical microscope","metallurgical microscope"],"antonyms":[],"notes":"Metallographs are typically equipped with vertical illumination to observe polished and etched metal surfaces."}],"etymology":{"value":"From 'metal' + '-o-' + '-graph' (instrument for recording).","priority":"★★☆"},"pronunciation":{"ipa":"/məˈtæl.əˌɡræf/","syllables":"me-tal-lo-graph"},"inflection":{"noun_plural":"metallographs"},"usage_notes":{"explanation":"A metallograph is a specialized type of microscope used to examine the microstructure of metals. It differs from a standard optical microscope in that it is designed to illuminate opaque materials, such as metals, using reflected light. This allows for the observation of features like grain boundaries, phases, and inclusions within the metal's structure.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The metallograph is used to see through the metal.","correct":"✓ The metallograph is used to examine the surface of the metal.","note":"Metallographs use reflected light to examine the surface microstructure, not transmitted light to see through the metal."}],"priority":"★★☆"},"related_words":{"derivatives":["metallography (金属組織学)","metallographer (金属組織学者)"],"related_terms":["microstructure","etching","grain boundary","phase"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - specialized technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Metallograph' is a technical term used in materials science and metallurgy. It refers to a specialized microscope designed to examine the microstructure of metals and alloys. Understanding this term requires familiarity with materials science concepts and microscopy techniques."},"example_sentences":[{"sentence":"The metallograph revealed the presence of carbides in the alloy.","translation":"その金属組織顕微鏡は、合金中の炭化物の存在を明らかにした。","type":"general","meaning_category":"examination of metals"},{"sentence":"Proper sample preparation is crucial for obtaining clear images with a metallograph.","translation":"適切な試料準備は、金属組織顕微鏡で鮮明な画像を得るために不可欠である。","type":"general","meaning_category":"examination of metals"}]}