{"word":"kisang","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Korean origin) A type of traditional Korean shamanic ritual or ceremony, often involving music, dance, and offerings to deities or spirits.","english_definition":"A traditional Korean shamanic ritual or ceremony, often involving music, dance, and offerings to deities or spirits.","examples":[{"sentence":"The village held a kisang to pray for a good harvest.","translation":"村は豊作を祈るためにキサンを行った。"},{"sentence":"The shaman led the kisang, chanting and dancing to appease the spirits.","translation":"シャーマンがキサンを率い、精霊を鎮めるために歌い踊った。"}],"collocations":["hold a kisang","perform a kisang","lead a kisang","attend a kisang"],"synonyms":["gut","je","ogut"],"antonyms":[]}],"etymology":{"value":"From Korean 기생 (kisang), which refers to a female entertainer in traditional Korean society. The term is now more broadly used to refer to shamanic rituals.","priority":"★★★"},"pronunciation":{"ipa":"/ki.sɑŋ/","syllables":"ki-sang"},"inflection":{"noun_plural":"kisangs"},"usage_notes":{"explanation":"'Kisang' is a term primarily used within the context of Korean culture and shamanism. It is less commonly used in general English, and understanding its meaning requires familiarity with Korean traditions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a kisang at the museum.","correct":"✓ I saw a traditional Korean shamanic ritual at the museum.","note":"Unless the context is specifically about Korean shamanism, it's better to use a more descriptive phrase."}],"priority":"★★☆"},"related_words":{"derivatives":["shaman","shamanism","Korean traditional music","Korean traditional dance"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Kisang' is a specialized term related to Korean shamanism. It is not part of general English vocabulary and requires specific cultural knowledge to understand. Its usage is limited to discussions about Korean culture, religion, or anthropology."},"example_sentences":[{"sentence":"The anthropologist studied the role of the kisang in rural Korean communities.","translation":"人類学者は、韓国の農村地域社会におけるキサンの役割を研究した。","type":"noun","meaning_category":"shamanic ritual"},{"sentence":"The music and dance of the kisang were mesmerizing.","translation":"キサンの音楽と踊りは魅惑的だった。","type":"noun","meaning_category":"shamanic ritual"}]}