{"word":"consentfully","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"同意をもって、承諾して、合意の上で","english_definition":"In a manner that indicates or involves consent; willingly and with agreement.","examples":[{"sentence":"The participants engaged in the activity consentfully, ensuring everyone felt comfortable and respected.","translation":"参加者たちは同意の上で活動に参加し、誰もが快適で尊重されていると感じられるようにしました。"},{"sentence":"She shared her personal experiences consentfully, knowing it could help others.","translation":"彼女はそれが他の人を助ける可能性があると知り、同意の上で自分の個人的な経験を共有しました。"},{"sentence":"The data was collected and used consentfully, adhering to all privacy regulations.","translation":"データはすべてのプライバシー規制を遵守し、同意の上で収集および使用されました。"}],"collocations":["act consentfully","share consentfully","participate consentfully","engage consentfully","collect consentfully","use consentfully"],"synonyms":["willingly","voluntarily","agreeably","accordantly","approvingly","permissively"],"antonyms":["unwillingly","involuntarily","forcibly","coercively","non-consensually"]}],"etymology":{"value":"The word is formed by adding the suffix '-fully' to the word 'consentful'. 'Consentful' itself is derived from 'consent' (meaning agreement or permission) and the suffix '-ful' (meaning full of or characterized by). Thus, 'consentfully' describes an action done in a manner characterized by consent.","priority":"★★☆"},"pronunciation":{"ipa":"/kənˈsɛntfəli/","syllables":"con-sent-ful-ly"},"inflection":{"notes":"Adverbs do not typically inflect. This word maintains the same form regardless of tense or number."},"usage_notes":{"explanation":"'Consentfully' is used to describe actions or behaviors that are performed with clear and enthusiastic consent from all parties involved. It emphasizes the importance of willing agreement and respect for individual boundaries. It is often used in discussions about ethical behavior, personal relationships, and data privacy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He consentfully took the item without asking.","correct":"✓ He took the item after receiving consent.","note":"'Consentfully' implies that consent was given. Taking something without asking does not involve consent. Instead, rephrase to emphasize the act of obtaining consent before acting."},{"incorrect":"✗ She consentfully assumed they agreed.","correct":"✓ She acted consentfully, ensuring they agreed.","note":"'Assuming' agreement is not the same as obtaining explicit consent. The adverb should describe the manner in which an action is performed, ensuring consent is actively sought and obtained."}],"priority":"★★☆"},"related_words":{"derivatives":["consent (noun, verb)","consentful (adjective)","non-consentful (adjective)","consensual (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. The word is relatively new and primarily used in specific contexts related to ethics, relationships, and data privacy.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Consentfully' is an adverb that describes an action done with clear and willing agreement. It's used to emphasize that everyone involved has given their permission and feels comfortable with what is happening. This word is often used in discussions about respect, boundaries, and ethical behavior, especially in relationships or when dealing with personal information. It highlights the importance of making sure everyone is on board and agrees to participate.","example_sentences":""},"example_sentences":[{"sentence":"They participated in the research study consentfully, after being fully informed about the risks and benefits.","translation":"彼らはリスクと利益について十分に知らされた後、同意の上で調査研究に参加しました。","type":"adverb","meaning_category":"agreement"},{"sentence":"She shared her story consentfully, hoping to empower others facing similar challenges.","translation":"彼女は同様の課題に直面している他の人々に力を与えたいと願い、同意の上で自分の話を共有しました。","type":"adverb","meaning_category":"willingness"},{"sentence":"The company collected user data consentfully, in accordance with privacy laws.","translation":"会社はプライバシー法に従い、同意の上でユーザーデータを収集しました。","type":"adverb","meaning_category":"permission"}]}