{"word":"fully-justify","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"（テキストを）両端揃えにする","english_definition":"to format text so that both the left and right edges of the paragraph are aligned, creating a clean, even appearance.","examples":[{"sentence":"The word processor can fully-justify text with a single command.","translation":"そのワープロソフトは、たった一つのコマンドでテキストを両端揃えにすることができます。"},{"sentence":"Make sure to fully-justify the paragraphs in your essay for a professional look.","translation":"プロフェッショナルな見た目にするために、エッセイの段落を必ず両端揃えにしてください。"}],"collocations":["fully-justify text","fully-justify paragraphs","fully-justify document"],"synonyms":["justify","block justify"],"antonyms":["left-align","right-align","center-align"]},{"part_of_speech":"verb","transitivity":"vt","definition":"（行為、決定などを）完全に正当化する、完全に弁明する","english_definition":"to provide a complete and convincing explanation or reason for an action, decision, or belief.","examples":[{"sentence":"The company struggled to fully-justify its decision to lay off employees.","translation":"会社は、従業員を解雇するという決定を完全に正当化するのに苦労しました。"},{"sentence":"Can you fully-justify spending so much money on a new car?","translation":"新しい車にそんなにお金をかけることを完全に正当化できますか？"}],"collocations":["fully-justify a decision","fully-justify an action","fully-justify a belief","fully-justify spending"],"synonyms":["completely justify","thoroughly justify","vindicate","exonerate"],"antonyms":["partially justify","fail to justify"]}],"etymology":{"value":"The term combines \"fully\" (completely) with \"justify\" (to show or prove to be right or reasonable). In the context of text formatting, it refers to aligning text to both margins. In the context of actions or decisions, it means providing a complete and convincing justification.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfʊli ˈdʒʌstɪfaɪ/","syllables":"ful-ly-jus-ti-fy"},"inflection":{"verb_forms":{"present_simple":["fully-justify","fully-justifies"],"past_simple":"fully-justified","past_participle":"fully-justified","present_participle":"fully-justifying"}},"usage_notes":{"explanation":"\"Fully-justify\" can have two main meanings depending on the context. In text formatting, it refers to aligning text to both the left and right margins. In a more general sense, it means to provide a complete and convincing justification for something. The hyphen is important for clarity, especially when used as a verb.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The text was fully justify.","correct":"✓ The text was fully-justified.","note":"When used as a verb in the past tense, it should be \"fully-justified.\""},{"incorrect":"✗ He tried to fully justify his actions, but failed.","correct":"✓ He tried to fully-justify his actions, but failed.","note":"The hyphen is important for clarity when used as a verb."}],"priority":"★★☆"},"related_words":{"derivatives":["justification","justify","fully"],"phrases":["justify","provide justification","offer an explanation"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but used in specific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Fully-justify\" is a compound verb that can refer to text formatting or providing a complete explanation for something. In text formatting, it means to align text to both the left and right margins. In a more general sense, it means to provide a complete and convincing justification. The hyphen is important for clarity. The word is not commonly used in everyday conversation but is more likely to appear in technical writing or formal discussions."},"example_sentences":[{"sentence":"The document was fully-justified to give it a professional appearance.","translation":"その文書はプロフェッショナルな外観にするために両端揃えにされました。","type":"verb","meaning_category":"両端揃えにする"},{"sentence":"The CEO had to fully-justify the company's decision to close the factory.","translation":"CEOは、工場を閉鎖するという会社の決定を完全に正当化する必要がありました。","type":"verb","meaning_category":"完全に正当化する"}]}