{"word":"Sapers","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(plural only) A surname.","english_definition":"A surname, typically used as a plural noun to refer to members of the Saper family.","examples":[{"sentence":"The Sapers have been a prominent family in the area for generations.","translation":"セーパース家は何世代にもわたってこの地域で著名な一族です。"},{"sentence":"We are having a reunion with the Sapers next weekend.","translation":"来週末、セーパース家との同窓会があります。"}],"collocations":["The Sapers family","Meet the Sapers","Visit the Sapers"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Likely a variant of Sapper, an occupational surname for a military engineer or someone who worked on fortifications.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈseɪpərz/","syllables":"Sa-pers"},"inflection":{"noun_plural":"N/A (already plural)"},"usage_notes":{"explanation":"'Sapers' is primarily used as a surname. When referring to the family as a whole, it is treated as a plural noun.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Sapers yesterday.","correct":"✓ I saw a member of the Sapers family yesterday.","note":"When referring to an individual, it is better to say 'a member of the Sapers family' rather than using the plural form."}],"priority":"★★☆"},"related_words":{"derivatives":["Saper (singular form of the surname)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (surname)","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sapers' is a surname, and its usage is primarily limited to contexts involving people with that last name. It is most commonly used in the plural form when referring to multiple members of the family. The etymology suggests a connection to military engineering, but this is not relevant to its modern usage as a surname."},"example_sentences":[{"sentence":"The Sapers are hosting a charity event this year.","translation":"セーパース家は今年、慈善イベントを主催します。","type":"noun","meaning_category":"Surname (family)"},{"sentence":"I received an invitation from the Sapers.","translation":"セーパース家から招待状を受け取りました。","type":"noun","meaning_category":"Surname (family)"}]}