{"word":"sheller","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に農業) 殻むき機、殻剥き器","english_definition":"A machine or tool used for removing the shells or husks from nuts, seeds, or other agricultural products.","examples":[{"sentence":"The farmer used a corn sheller to quickly separate the kernels from the cobs.","translation":"農家はトウモロコシの殻むき機を使って、トウモロコシの粒を芯から素早く分離した。"},{"sentence":"A peanut sheller is essential for processing large quantities of peanuts.","translation":"大量のピーナッツを加工するには、ピーナッツの殻むき機が不可欠だ。"}],"collocations":["corn sheller (トウモロコシ殻むき機)","peanut sheller (ピーナッツ殻むき機)","bean sheller (豆殻むき機)"],"synonyms":["husker","thresher","separator"],"antonyms":[]}],"etymology":{"value":"The word \"sheller\" is derived from the verb \"shell,\" meaning to remove the shell or husk from something, with the addition of the suffix \"-er,\" which denotes an agent or instrument.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʃɛlər/","syllables":"shel-ler"},"inflection":{"noun_plural":"shellers"},"usage_notes":{"explanation":"A \"sheller\" is typically a piece of machinery, often used in agriculture, designed to efficiently remove the outer covering (shell or husk) from various types of produce. The specific design of the sheller varies depending on the type of product it is intended to process (e.g., corn, peanuts, beans).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I use sheller to open nuts by hand.","correct":"✓ I use a nutcracker to open nuts by hand.","note":"A \"sheller\" is generally a machine. If you are opening nuts by hand, you would likely use a \"nutcracker\" or another hand tool."}],"priority":"★★☆"},"related_words":{"derivatives":["shell (verb, noun)"],"phrasal_verbs":[],"related_nouns":["shelling (noun)"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"sheller\" refers to a machine or tool that removes the outer covering (shell) from things like nuts, seeds, or corn. It's a specialized term mostly used in agricultural contexts. If you're talking about opening nuts by hand, you would usually use a \"nutcracker\" instead."},"example_sentences":[{"sentence":"The old corn **sheller** had been in the family for generations.","translation":"その古いトウモロコシ殻むき機は、何世代にもわたってその家で使われてきた。","type":"noun","meaning_category":"殻むき機"},{"sentence":"They needed a new peanut **sheller** to keep up with the increased harvest.","translation":"収穫量の増加に対応するために、彼らは新しいピーナッツ殻むき機が必要だった。","type":"noun","meaning_category":"殻むき機"}]}