{"word":"ambatch","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A very lightweight wood from the ambatch tree (Herminiera elaphroxylon) of tropical Africa, used for floats and rafts.","english_definition":"A very lightweight wood from the ambatch tree (Herminiera elaphroxylon) of tropical Africa, used for floats and rafts.","examples":[{"sentence":"The natives constructed a raft using ambatch wood.","translation":"現地の人々はアンバッチの木材を使って筏を建造した。"},{"sentence":"Ambatch is ideal for making floats due to its low density.","translation":"アンバッチは密度が低いため、浮きを作るのに最適です。"}],"collocations":["ambatch wood","ambatch raft","ambatch tree"],"synonyms":["corkwood","balsa"],"antonyms":[]}],"etymology":{"value":"Likely from a West African language; compare Wolof 'mbàcc' ('raft').","priority":"★★☆"},"pronunciation":{"ipa":"/ˈæm.bætʃ/","syllables":"am-batch"},"inflection":{"noun_plural":"ambatches"},"usage_notes":{"explanation":"Ambatch is primarily known for its use in buoyancy-related applications due to its extremely low density. The wood is so light that it can be easily carried and worked with, making it valuable in regions where it grows natively.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used ambatch to build a house.","correct":"✓ I used ambatch to build a raft.","note":"Ambatch is too soft and lightweight for building houses; it's better suited for rafts or floats."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["Herminiera elaphroxylon"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'ambatch' refers to a specific type of lightweight wood from the Herminiera elaphroxylon tree, primarily found in tropical Africa. It is used for making floats and rafts due to its low density. This term is not commonly encountered in everyday language and is more likely to appear in specialized contexts such as botany, materials science, or discussions about African flora and traditional crafts."},"example_sentences":[{"sentence":"The fishermen relied on ambatch rafts for their daily catch.","translation":"漁師たちは毎日の漁のためにアンバッチの筏に頼っていた。","type":"noun","meaning_category":"wood"},{"sentence":"Ambatch is one of the lightest woods known to man.","translation":"アンバッチは人類が知る最も軽い木材の一つです。","type":"noun","meaning_category":"wood"}]}