{"word":"obliquenesses","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"間接的であること、遠回しであること、あいまいさ、斜めであることの複数形","english_definition":"plural form of obliqueness: the quality of being oblique; indirectness or evasiveness in speech or conduct; the state of being slanted or inclined.","examples":[{"sentence":"The obliquenesses in his statement made it difficult to understand his true intentions.","translation":"彼の声明のあいまいさが、彼の真の意図を理解することを困難にした。"},{"sentence":"The report was criticized for its obliquenesses and lack of clear recommendations.","translation":"その報告書は、その遠回しな表現と明確な提言の欠如のために批判された。"}],"collocations":["studied obliquenesses (計算された遠回しな言い方)","deliberate obliquenesses (意図的なあいまいさ)"],"synonyms":["indirectnesses","ambiguities","vagueness","evasiveness","roundaboutness","slanting","inclinations"],"antonyms":["directness","clarity","straightforwardness","candor"]},{"part_of_speech":"noun","definition":"(天文学)黄道傾斜角の複数形","english_definition":"plural form of obliqueness: (astronomy) the angle between the ecliptic and the celestial equator.","examples":[{"sentence":"Calculations involving the Earth's obliquenesses are crucial for understanding seasonal changes.","translation":"地球の黄道傾斜角に関する計算は、季節の変化を理解するために重要である。"}],"collocations":["Earth's obliquenesses (地球の黄道傾斜角)"],"synonyms":["axial tilt","ecliptic inclination"],"antonyms":[]}],"etymology":{"value":"Derived from 'obliqueness', which comes from 'oblique'. 'Oblique' originates from the Latin 'obliquus', meaning 'slanting, sideways'.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈbliːknəsɪz/","syllables":"o-bli-que-ness-es"},"inflection":{"noun_plural":"obliquenesses"},"usage_notes":{"explanation":"'Obliquenesses' is the plural form of 'obliqueness'. It refers to multiple instances or aspects of being oblique. This can apply to indirect or evasive communication, or to physical slant or inclination. In astronomy, it can refer to multiple calculations or considerations of the angle between the ecliptic and the celestial equator.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The obliquenesses of the building made it difficult to photograph.","correct":"✓ The oblique angles of the building made it difficult to photograph.","note":"When referring to physical angles, it's often clearer to use 'oblique angles' rather than 'obliquenesses', unless you are specifically referring to the quality of being oblique."}],"priority":"★☆☆"},"related_words":{"derivatives":["oblique (adjective)","obliquely (adverb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'obliquenesses' is a relatively rare and complex term. It's primarily used in formal or technical contexts to describe multiple instances of indirectness, evasiveness, or slant. Due to its abstract nature and low frequency, it's best suited for advanced learners with a strong grasp of English vocabulary and grammar."},"example_sentences":[{"sentence":"The politician's speech was full of evasions and obliquenesses.","translation":"その政治家の演説は、ごまかしと遠回しな言い方でいっぱいだった。","type":"noun","meaning_category":"あいまいさ"},{"sentence":"The architect considered the various obliquenesses of the building's facade.","translation":"建築家は、建物のファサードのさまざまな傾斜を検討した。","type":"noun","meaning_category":"斜めであること"},{"sentence":"The historian analyzed the obliquenesses in the diplomatic correspondence.","translation":"歴史家は、外交書簡のあいまいさを分析した。","type":"noun","meaning_category":"間接的であること"}]}