{"word":"Theopolitician","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A politician who uses religious principles or beliefs to influence their political actions and policies.","english_definition":"A politician who uses religious principles or beliefs to influence their political actions and policies. Often implies a strong connection between religious doctrine and political ideology.","examples":[{"sentence":"The theopolitician argued that their policies were divinely inspired and necessary for the moral well-being of the nation.","translation":"その神政政治家は、彼らの政策は神から霊感を受けたものであり、国家の道徳的幸福のために必要であると主張した。"},{"sentence":"Critics accused the theopolitician of imposing their religious views on the entire population.","translation":"批判者たちは、その神政政治家が彼らの宗教的見解を国民全体に押し付けていると非難した。"}],"collocations":["religious principles","political actions","moral well-being","divinely inspired","impose religious views"],"synonyms":["religious politician","ideologue","zealot","fundamentalist"],"antonyms":["secular politician","pragmatist","moderate","centrist"]}],"etymology":{"value":"Combination of 'theo-' (from Greek 'theos' meaning 'god') and 'politician'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌθiːoʊpəˈlɪtɪʃən/","syllables":"the-o-po-li-ti-cian"},"inflection":{"noun_plural":"Theopoliticians"},"usage_notes":{"explanation":"The term 'theopolitician' is often used critically to describe politicians who are seen as excessively influenced by their religious beliefs, potentially to the detriment of secular governance or the rights of individuals with different beliefs. It is not always a neutral term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Theopoliticians are always bad.","correct":"✓ Theopoliticians can be controversial because they mix religion and politics.","note":"It's a generalization to say all theopoliticians are bad. The impact of their actions depends on their specific policies and how they are implemented."}],"priority":"★★☆"},"related_words":{"derivatives":["theocracy","theocratic","politician","politics","theology"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'theopolitician' refers to a politician whose actions are heavily influenced by religious beliefs. This term is often used in discussions about the role of religion in politics and can carry a negative connotation, suggesting that the politician is imposing their religious views on others. Understanding this word requires a grasp of both political and religious concepts."},"example_sentences":[{"sentence":"The rise of the theopolitician in the region has led to increased religious tensions.","translation":"その地域における神政政治家の台頭は、宗教的緊張の高まりにつながっている。","type":"noun","meaning_category":"Political Influence"},{"sentence":"Many voters were wary of the theopolitician's promise to govern according to religious law.","translation":"多くの有権者は、宗教法に従って統治するというその神政政治家の約束を警戒していた。","type":"noun","meaning_category":"Political Ideology"}]}