{"word":"Gambut","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A type of traditional Malay lute, primarily found in Malaysia, Indonesia, and Brunei. It usually has a pear-shaped body, a fretted neck, and is played with a plectrum.","english_definition":"A traditional Malay lute, typically pear-shaped, with a fretted neck, played with a plectrum, and found in Malaysia, Indonesia, and Brunei.","examples":[{"sentence":"The Gambut is often used in traditional Malay music ensembles.","translation":"ガンブットは、伝統的なマレー音楽アンサンブルでよく使用されます。"},{"sentence":"He skillfully played a melody on the Gambut.","translation":"彼はガンブットで巧みにメロディーを奏でた。"}],"collocations":["play the Gambut","traditional Gambut music","Gambut ensemble"],"synonyms":["lute"],"antonyms":[]}],"etymology":{"value":"The word 'Gambut' is believed to be derived from the Arabic word 'Oud' or 'Ud', which also refers to a pear-shaped, stringed instrument. This reflects the historical cultural exchanges and influences in the Malay Archipelago.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡɑːmbuːt/","syllables":"Gam-but"},"inflection":{"notes":"It's a noun, so it has a plural form: Gambuts"},"usage_notes":{"explanation":"The Gambut is a significant cultural instrument in the Malay world, often associated with traditional music, dance, and ceremonies. It is considered an important part of the cultural heritage of Malaysia, Indonesia, and Brunei.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I play guitar, like Gambut.","correct":"✓ I play the guitar, like the Gambut.","note":"When referring to a specific instrument, it is common to use the definite article 'the' before the instrument's name."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Gambut' refers to a specific type of lute found in Malay cultures. It's not a common word, so you'll likely only encounter it in contexts discussing Malay music or culture. Understanding its cultural significance is key to using the word correctly.","priority":"★★☆"},"example_sentences":[{"sentence":"The musician tuned his Gambut before the performance.","translation":"演奏者は演奏前にガンブットを調律した。","type":"noun","meaning_category":"Musical instrument"},{"sentence":"Traditional Malay stories are often accompanied by Gambut music.","translation":"伝統的なマレーの物語は、しばしばガンブットの音楽を伴う。","type":"noun","meaning_category":"Cultural context"}]}