{"word":"Daphnia","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ミジンコ属（ミジンコぞく）の甲殻類","english_definition":"A genus of small, planktonic crustaceans, typically 0.2–5 mm in length. They are filter feeders and are found in various aquatic environments such as ponds, lakes, and streams.","examples":[{"sentence":"Daphnia are commonly used as a model organism in ecological and toxicological studies.","translation":"ミジンコは、生態学的および毒性学的研究におけるモデル生物として一般的に使用されています。"},{"sentence":"Fish often feed on Daphnia in freshwater ecosystems.","translation":"魚は淡水生態系でミジンコを餌にすることが多いです。"},{"sentence":"The culture of Daphnia is important for feeding aquarium fish.","translation":"ミジンコの培養は、観賞魚の餌として重要です。"}],"collocations":["Daphnia magna (オオミジンコ)","Daphnia culture (ミジンコの培養)","Daphnia pulex (ネズミミジンコ)","Daphnia toxicity test (ミジンコ毒性試験)"],"synonyms":["water flea"],"antonyms":[]}],"etymology":{"value":"The name Daphnia comes from the Ancient Greek word 'δάφνη' (dáphnē), meaning 'laurel tree'. It was named by the Swedish zoologist Erik Dahl in 1779.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdæfniə/","syllables":"Daph-ni-a"},"inflection":{"noun_plural":"Daphnia (can be used as both singular and plural)"},"usage_notes":{"explanation":"Daphnia is often used in scientific research due to its sensitivity to environmental changes, rapid reproduction, and ease of culture. It is a key component of freshwater food webs and plays a crucial role in nutrient cycling.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Daphnia at the lake. They was very small.","correct":"✓ I saw Daphnia at the lake. They were very small.","note":"Daphnia can be used as both singular and plural, but in this case, since 'they' is used, the plural form is more appropriate, and the verb should be 'were'."}],"priority":"★☆☆"},"related_words":{"derivatives":["Daphniidae (ミジンコ科)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2-C1 (technical vocabulary)","frequency_google_ngram":"Low frequency (scientific context)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Daphnia' refers to a genus of small crustaceans commonly known as water fleas. They are frequently used in scientific studies to assess water quality and the effects of pollutants. The term is most often encountered in ecological, toxicological, or aquarist contexts. Understanding this term is useful for comprehending scientific literature related to aquatic ecosystems and environmental monitoring."},"example_sentences":[{"sentence":"The scientists studied the effects of pesticides on Daphnia populations.","translation":"科学者たちは、農薬がミジンコの個体数に与える影響を研究しました。","type":"noun","meaning_category":"甲殻類"},{"sentence":"Daphnia are an important food source for many small fish.","translation":"ミジンコは、多くの小型魚にとって重要な食料源です。","type":"noun","meaning_category":"甲殻類"},{"sentence":"The water sample contained a variety of plankton, including Daphnia.","translation":"その水サンプルには、ミジンコを含むさまざまなプランクトンが含まれていました。","type":"noun","meaning_category":"甲殻類"}]}