{"word":"ventriculous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"（古語または医学）小腹のある、腹の膨れた、または心室の","english_definition":"(archaic or medicine) Having a little belly; ventricose; or, pertaining to a ventricle.","examples":[{"sentence":"The ventriculous shape of the flask made it easy to grip.","translation":"そのフラスコの小腹のある形状は握りやすかった。"},{"sentence":"The ventriculous structure of the heart is essential for proper blood flow.","translation":"心臓の心室構造は、適切な血流に不可欠です。"}],"collocations":[],"synonyms":["ventricose","bellied","protuberant"],"antonyms":[]}],"etymology":{"value":"From Latin 'ventriculus', diminutive of 'venter' meaning 'belly'.","priority":"★★☆"},"pronunciation":{"ipa":"/vɛnˈtrɪkjʊləs/","syllables":"ven-tric-u-lous"},"inflection":{"notes":"Adjective, comparative and superlative forms are ventriculoser and ventriculosest, although rarely used."},"usage_notes":{"explanation":"'Ventriculous' is a relatively rare word, primarily found in older texts or medical contexts. It describes something that is either slightly bulging or related to a ventricle, especially in anatomical descriptions.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["ventricle","ventricular","ventricose"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Very rare)","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Ventriculous' is a specialized term, primarily encountered in medical or historical texts. Its usage is limited, and understanding requires a familiarity with anatomical terminology or archaic language. It is not part of common vocabulary."},"example_sentences":[{"sentence":"The ventriculous form of the ancient amphora suggested it was designed for easy handling.","translation":"古代のアンフォラの小腹のある形状は、取り扱いやすいように設計されたことを示唆していた。","type":"adjective","meaning_category":"shape"},{"sentence":"The ventriculous chambers of the heart ensure efficient pumping of blood throughout the body.","translation":"心臓の心室は、全身への効率的な血液のポンピングを保証する。","type":"adjective","meaning_category":"medical"}]}