{"word":"pregame","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"試合前のイベント、試合前のパーティー、試合前の準備","english_definition":"A social event or gathering held before a sporting event, especially one involving drinking alcohol. Also, the period of preparation before a game.","examples":[{"sentence":"We're having a pregame at my place before heading to the stadium.","translation":"スタジアムに行く前に、私の家でプレゲームパーティーをします。"},{"sentence":"The team's pregame ritual includes listening to the same song every time.","translation":"チームのプレゲームの儀式には、毎回同じ曲を聴くことが含まれています。"},{"sentence":"Let's meet up for a pregame before the concert.","translation":"コンサートの前にプレゲームで会いましょう。"}],"collocations":["pregame party","pregame ritual","pregame activities","pregame meal","pregame speech"],"synonyms":["tailgate","warm-up","pep rally"],"antonyms":["postgame"]},{"part_of_speech":"verb","transitivity":"vi","definition":"試合前にパーティーをする、試合前に酒を飲む","english_definition":"To attend or participate in a social gathering before a sporting event, often involving the consumption of alcohol.","examples":[{"sentence":"We're going to pregame at the bar before the baseball game.","translation":"野球の試合の前に、バーでプレゲームパーティーをします。"},{"sentence":"They pregamed pretty hard before the concert and were already drunk when they arrived.","translation":"彼らはコンサート前にかなりプレゲームパーティーをして、到着したときにはすでに酔っ払っていました。"},{"sentence":"Are you planning to pregame before the football game?","translation":"フットボールの試合前にプレゲームパーティーをする予定ですか？"}],"collocations":["pregame hard","pregame responsibly","pregame with friends"],"synonyms":["tailgate","warm up"],"antonyms":["postgame"]}],"etymology":{"value":"Derived from the prefix 'pre-' (before) and the word 'game'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈpriːɡeɪm/","syllables":"pre-game"},"inflection":{"verb_forms":{"present_simple":["pregame","pregames"],"past_simple":"pregamed","past_participle":"pregamed","present_participle":"pregaming"}},"usage_notes":{"explanation":"'Pregame' typically refers to social activities or preparations that occur immediately before a sporting event. It often involves gatherings where people socialize, eat, and sometimes consume alcohol before attending the game. As a verb, it describes the act of participating in these pre-event activities.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm going to pre-game the party.","correct":"✓ I'm going to pregame before the party.","note":"When used as a verb, 'pregame' doesn't take a direct object like 'the party.' Instead, it's used intransitively or with a prepositional phrase indicating the event it precedes."},{"incorrect":"✗ The pregame was very boring.","correct":"✓ The pregame party was very boring.","note":"To be more specific, use 'pregame party' or 'pregame event' instead of just 'pregame' when referring to the social gathering."}],"priority":"★★☆"},"related_words":{"derivatives":["pre-gaming (noun)"],"phrasal_verbs":[],"related_terms":["tailgate","warm-up","pep rally","after-party"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in specific social contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Pregame' refers to the activities that happen right before a sports game or event, often involving socializing and sometimes drinking. It can be used as a noun to describe the event itself or as a verb to describe the act of participating in these pre-event activities. The word is most commonly used in informal contexts, especially among younger people and sports fans.","priority":"★★★"},"example_sentences":[{"sentence":"The pregame atmosphere was electric with excitement.","translation":"プレゲームの雰囲気は興奮で満ちていた。","type":"noun","meaning_category":"試合前のイベント"},{"sentence":"We decided to pregame at the bar before heading to the concert.","translation":"コンサートに行く前に、バーでプレゲームパーティーをすることにしました。","type":"verb","meaning_category":"試合前にパーティーをする"},{"sentence":"The team's pregame routine helps them focus and prepare mentally.","translation":"チームのプレゲームのルーティンは、集中力を高め、精神的に準備するのに役立ちます。","type":"noun","meaning_category":"試合前の準備"},{"sentence":"They always pregame with pizza and beer before the big game.","translation":"彼らはいつも大きな試合の前にピザとビールでプレゲームパーティーをします。","type":"verb","meaning_category":"試合前に酒を飲む"}]}