{"word":"day-inspired","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Inspired by or related to the daytime, daylight, or daily life.","english_definition":"Inspired by or related to the daytime, daylight, or daily life.","examples":[{"sentence":"The artist created a series of day-inspired paintings, capturing the vibrant colors of the sunrise.","translation":"そのアーティストは、日の出の鮮やかな色彩を捉えた、昼をテーマにした一連の絵画を制作しました。"},{"sentence":"Her day-inspired fashion line featured light, airy fabrics and bright, cheerful patterns.","translation":"彼女の昼をイメージしたファッションラインは、軽くて風通しの良い生地と、明るく陽気な柄が特徴でした。"},{"sentence":"The composer's day-inspired symphony evoked feelings of energy and optimism.","translation":"作曲家の昼をイメージした交響曲は、エネルギーと楽観的な感情を呼び起こしました."}],"collocations":["day-inspired art","day-inspired design","day-inspired collection","day-inspired theme","day-inspired activities"],"synonyms":["daylight-inspired","sunlit","diurnal","daily-themed"],"antonyms":["night-inspired","moonlit","nocturnal"]},{"part_of_speech":"adjective","definition":"Motivated or influenced by events or experiences that occurred during the day.","english_definition":"Motivated or influenced by events or experiences that occurred during the day.","examples":[{"sentence":"His day-inspired decision to quit his job was a result of a frustrating meeting.","translation":"彼が仕事を辞めるという昼間の出来事に触発された決断は、不満のたまる会議の結果でした。"},{"sentence":"The day-inspired poem reflected on the simple joys of everyday life.","translation":"その昼間の出来事に触発された詩は、日常生活のシンプルな喜びを反映していました。"},{"sentence":"Her day-inspired activism focused on issues she encountered during her daily commute.","translation":"彼女の昼間の出来事に触発された活動は、毎日の通勤中に遭遇する問題に焦点を当てていました."}],"collocations":["day-inspired decision","day-inspired poem","day-inspired activism","day-inspired creativity","day-inspired change"],"synonyms":["daily-motivated","influenced by daily events","daytime-influenced"],"antonyms":["unaffected by daily events","uninspired by the day"]}],"etymology":{"value":"Combination of 'day' (referring to the period of light between sunrise and sunset, or daily life) and 'inspired' (influenced or stimulated to do or feel something creatively).","priority":"N/A"},"pronunciation":{"ipa":"/ˈdeɪ ɪnˌspaɪərd/","syllables":"day-in-spired"},"inflection":{"notes":"Adjective; does not have different forms for gender or number."},"usage_notes":{"explanation":"'Day-inspired' is a relatively uncommon adjective used to describe something that is either artistically inspired by daytime elements (like sunlight, colors, or activities) or motivated by events that happened during the day. It suggests a direct connection between the inspiration and the experiences or characteristics associated with the daytime.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The artist's work was day inspired.","correct":"The artist's work was day-inspired.","note":"The hyphen is important to connect 'day' and 'inspired' to form a single adjective modifying the noun."},{"incorrect":"The day inspired him to paint.","correct":"The day inspired him to paint a day-inspired painting.","note":"'Day inspired him' means the day itself gave him inspiration. 'Day-inspired' as an adjective describes the type of painting he created."}],"priority":"N/A"},"related_words":{"derivatives":["inspiration","inspired","daytime","daily"],"phrases":["inspired by the day","daytime activities","daily life"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Not a common term.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Day-inspired' is a compound adjective that describes something that has been influenced or motivated by the daytime, daylight, or experiences that occur during the day. It is used to convey that the subject is directly linked to or draws its creativity from the characteristics and events of the daytime. This term is not commonly used, so it is important to provide context when using it to ensure clear understanding."},"example_sentences":[{"sentence":"The architect designed a day-inspired building with large windows to maximize natural light.","translation":"建築家は、自然光を最大限に取り入れるために、大きな窓を備えた昼をイメージした建物を設計しました。","type":"adjective","meaning_category":"Inspired by daylight"},{"sentence":"Her day-inspired blog posts often featured stories about her morning walks.","translation":"彼女の昼をイメージしたブログ記事には、朝の散歩についての物語がよく掲載されていました。","type":"adjective","meaning_category":"Inspired by daily life"},{"sentence":"The musician composed a day-inspired melody that captured the feeling of a sunny afternoon.","translation":"音楽家は、晴れた午後の感覚を捉えた昼をイメージしたメロディーを作曲しました。","type":"adjective","meaning_category":"Inspired by daytime"}]}