{"word":"phenakistoscope","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"フェナキストスコープ（回転のぞき絵）","english_definition":"An early animation device that used a rotating disc with a series of images and slits, which when viewed in a mirror, created the illusion of motion.","examples":[{"sentence":"The phenakistoscope was a popular form of entertainment in the 19th century.","translation":"フェナキストスコープは19世紀に人気のある娯楽の形でした。"},{"sentence":"By using a phenakistoscope, one could observe early animation.","translation":"フェナキストスコープを使うことで、初期のアニメーションを観察できました。"}],"collocations":["early animation device","rotating disc","illusion of motion"],"synonyms":["zoetrope","praxinoscope"],"antonyms":[]}],"etymology":{"value":"The word \"phenakistoscope\" comes from the Greek words φενακίζω (phenakizo) meaning \"to deceive, cheat\" and σκοπέω (skopeō) meaning \"to view, look at\".","priority":"★★☆"},"pronunciation":{"ipa":"/fɪˈnækɪstəˌskoʊp/","syllables":"phe-nak-is-to-scope"},"inflection":{"noun_plural":"phenakistoscopes"},"usage_notes":{"explanation":"The phenakistoscope is significant in the history of animation as one of the first devices to create moving images. It relies on the persistence of vision to create the illusion of movement.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a phenakistoscope and it was like a movie.","correct":"✓ I saw a phenakistoscope and it was like very early animation.","note":"A phenakistoscope is a very early form of animation, not a movie. It creates a simple illusion of movement."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The phenakistoscope is a historical animation device. Understanding it requires knowledge of the history of animation and early optical toys. The word itself is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The museum displayed a collection of antique phenakistoscopes.","translation":"博物館はアンティークのフェナキストスコープのコレクションを展示していました。","type":"noun","meaning_category":"animation device"},{"sentence":"Children were fascinated by the moving images created by the phenakistoscope.","translation":"子供たちはフェナキストスコープによって作られた動く画像に魅了されました。","type":"noun","meaning_category":"animation device"}]}