{"word":"quadrichord","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(音楽)四音音階；四弦楽器","english_definition":"(music) a scale of four notes; a four-stringed instrument.","examples":[{"sentence":"The ancient Greeks used the tetrachord, which is a type of quadrichord, as a fundamental building block of their musical system.","translation":"古代ギリシャ人は、四音音階の一種であるテトラコードを、彼らの音楽システムの基本的な構成要素として使用していました。"},{"sentence":"Some early lutes were effectively quadrichords.","translation":"初期のリュートの中には、実質的に四弦楽器であったものもあります。"}],"collocations":["tetrachord (テトラコード、四音音階)","stringed instrument (弦楽器)"],"synonyms":["tetrachord"],"antonyms":[]},{"part_of_speech":"noun","definition":"(音楽)古代ギリシャの音楽理論における、特定の音程構造を持つ四つの音の連続","english_definition":"(music) in ancient Greek music theory, a succession of four notes with a specific intervallic structure.","examples":[{"sentence":"The Dorian tetrachord was characterized by a descending sequence of tones and semitones.","translation":"ドリア旋法テトラコードは、全音と半音が下降する配列を特徴としていました。"}],"collocations":["Dorian tetrachord (ドリア旋法テトラコード)","Phrygian tetrachord (フリギア旋法テトラコード)","Lydian tetrachord (リディア旋法テトラコード)"],"synonyms":["tetrachord"],"antonyms":[]}],"etymology":{"value":"From Latin *quadrichordus*, from *quadri-* (four) + *chorda* (string).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkwɒdrɪkɔːrd/","syllables":"qua-dri-chord"},"inflection":{"noun_plural":"quadrichords"},"usage_notes":{"explanation":"The term \"quadrichord\" is primarily used in historical musicology, particularly when discussing ancient Greek music theory. It is less common in modern musical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He played a beautiful quadrichord on his guitar.","correct":"✓ He played a beautiful melody on his guitar.","note":"While a guitar can play four notes, \"quadrichord\" refers to a specific scale or instrument type, not just any four notes played together."}],"priority":"★★☆"},"related_words":{"derivatives":["chord (和音)","monochord (モノコード、単弦楽器)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"quadrichord\" is a specialized term primarily encountered in the context of music history and theory, particularly in discussions of ancient Greek music. Understanding requires familiarity with musical terminology and historical musical systems. It is not typically used in general conversation or contemporary musical contexts."},"example_sentences":[{"sentence":"The construction of the Greek musical system relied heavily on the arrangement of quadrichords.","translation":"ギリシャの音楽システムの構築は、四音音階の配置に大きく依存していました。","type":"noun","meaning_category":"四音音階"},{"sentence":"Early forms of the lute can be considered quadrichords due to their four-stringed construction.","translation":"初期のリュートの形態は、その四弦構造から四弦楽器とみなすことができます。","type":"noun","meaning_category":"四弦楽器"}]}