{"word":"nonathletic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"運動神経がない、運動能力に欠ける、スポーツマンらしくない","english_definition":"Not athletic; lacking in physical coordination, strength, or skill in sports.","examples":[{"sentence":"He was always a nonathletic child, preferring books to sports.","translation":"彼はいつも運動神経のない子供で、スポーツよりも本を好んでいた。"},{"sentence":"The character is portrayed as a nonathletic intellectual.","translation":"そのキャラクターは、運動能力に欠ける知識人として描かれている。"},{"sentence":"Despite being nonathletic, she enjoyed hiking and other outdoor activities.","translation":"運動は得意ではないものの、彼女はハイキングや他のアウトドア活動を楽しんだ。"}],"collocations":["nonathletic build","nonathletic physique","nonathletic activities","nonathletic interests"],"synonyms":["unathletic","unsporting","clumsy","ungainly","awkward","uncoordinated"],"antonyms":["athletic","sporting","coordinated","graceful"]}],"etymology":{"value":"Derived from the prefix 'non-' (meaning 'not') combined with the word 'athletic'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒn.æθˈlɛtɪk/","syllables":"non-ath-let-ic"},"inflection":{"notes":"This word is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Nonathletic' is used to describe someone who does not possess natural athletic abilities or a physique suited for sports. It can also refer to activities or interests that are not related to sports or physical exercise. The term is generally neutral, but can sometimes carry a slightly negative connotation depending on the context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He is a non athletic.","correct":"He is a nonathletic person.","note":"'Nonathletic' is an adjective, so it needs to modify a noun. Using 'nonathletic' alone as a noun is incorrect."},{"incorrect":"She is very nonathletic, but she tries hard.","correct":"She is not very athletic, but she tries hard.","note":"While 'nonathletic' is a valid word, sometimes using 'not very athletic' sounds more natural and less harsh."}],"priority":"★★☆"},"related_words":{"derivatives":["nonathlete (noun)"],"phrasal_verbs":[],"related_terms":["athletic","athlete","athletics"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'nonathletic' is formed by adding the prefix 'non-' to 'athletic,' making it easy to understand as 'not athletic.' It's used to describe someone who isn't good at sports or doesn't have a sporty build. It's not a very common word, but it's straightforward to understand if you know what 'athletic' means."},"example_sentences":[{"sentence":"As a child, I was always considered nonathletic and preferred reading to playing sports.","translation":"子供の頃、私はいつも運動神経がないと思われていて、スポーツをするよりも読書を好んでいました。","type":"general","meaning_category":"lacking athletic ability"},{"sentence":"The movie portrayed him as a nonathletic character who unexpectedly becomes a hero.","translation":"その映画は、彼を運動能力に欠けるキャラクターとして描きながらも、予期せずヒーローになる様子を描いています。","type":"character description","meaning_category":"character trait"},{"sentence":"She found joy in nonathletic activities like painting and music.","translation":"彼女は絵を描いたり音楽を演奏したりするなど、運動とは関係のない活動に喜びを見出しました。","type":"interests","meaning_category":"interests"}]}