{"word":"overbribe","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人)を買収しすぎる、過剰な賄賂を贈る","english_definition":"To bribe excessively; to offer a bribe that is more than necessary or appropriate to influence someone's actions.","examples":[{"sentence":"The corrupt official was already willing to cooperate, but the company tried to overbribe him just to be absolutely sure.","translation":"その汚職官僚はすでに協力する気だったが、会社は念のために彼を買収しすぎようとした。"},{"sentence":"It's possible to overbribe someone, making them suspicious of your motives.","translation":"誰かを買収しすぎると、あなたの動機を疑われる可能性がある。"}],"collocations":["attempt to overbribe","be careful not to overbribe"],"synonyms":["excessively bribe","corrupt excessively"],"antonyms":["underbribe","fail to bribe"]},{"part_of_speech":"noun","definition":"過剰な賄賂","english_definition":"An excessive bribe.","examples":[{"sentence":"The investigation revealed an overbribe that was far beyond what was customary.","translation":"調査により、慣習をはるかに超える過剰な賄賂が明らかになった。"},{"sentence":"The amount offered was considered an overbribe, raising ethical concerns.","translation":"提示された金額は過剰な賄賂とみなされ、倫理的な懸念を引き起こした。"}],"collocations":["amount of the overbribe","investigation of the overbribe"],"synonyms":["excessive bribe"],"antonyms":["insufficient bribe"]}],"etymology":{"value":"Formed by combining \"over-\" (meaning excessively) with \"bribe.\"","priority":"★★★"},"pronunciation":{"ipa":"/ˌoʊvərˈbraɪb/","syllables":"o-ver-bribe"},"inflection":{"verb_forms":{"present_simple":["overbribe","overbribes"],"past_simple":"overbribed","past_participle":"overbribed","present_participle":"overbribing"},"noun_plural":"overbribes"},"usage_notes":{"explanation":"The word \"overbribe\" implies that the bribe offered is not only unethical but also excessive or unnecessary. It suggests a lack of judgment or an attempt to ensure compliance beyond what is reasonably required.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They overbribed with money.","correct":"✓ They overbribed him with money.","note":"When used as a verb, 'overbribe' typically requires a direct object (the person being bribed)."},{"incorrect":"✗ The overbribe was too much money.","correct":"✓ The overbribe was a large amount of money.","note":"'Too much money' is grammatically correct, but in this context, 'a large amount of money' is more idiomatic when referring to the size of the overbribe."}],"priority":"★★☆"},"related_words":{"derivatives":["bribe","bribery","bribable"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'overbribe' is a relatively uncommon word that combines the prefix 'over-' with the word 'bribe.' It describes the act of offering a bribe that is excessive or unnecessary, often to ensure compliance or influence actions beyond what is reasonably required. This term is typically used in discussions about corruption, ethics, and legal matters, and its understanding requires a strong vocabulary and comprehension of abstract concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The company decided to overbribe the officials to secure the contract, even though it was already likely to be approved.","translation":"会社は契約を確保するために、承認される可能性が高いにもかかわらず、当局者を買収しすぎることに決めた。","type":"verb","meaning_category":"過剰な賄賂を贈る"},{"sentence":"The sheer size of the overbribe raised suspicions and triggered an investigation.","translation":"過剰な賄賂の規模の大きさは疑念を引き起こし、調査のきっかけとなった。","type":"noun","meaning_category":"過剰な賄賂"}]}