{"word":"non-mountaineering","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"登山以外の、登山に関連しない","english_definition":"Not related to or involved in mountaineering.","examples":[{"sentence":"The trip included non-mountaineering activities such as sightseeing and cultural tours.","translation":"その旅行には、観光や文化ツアーなど、登山以外の活動が含まれていました。"},{"sentence":"We need to consider the non-mountaineering aspects of the expedition, such as logistics and medical support.","translation":"遠征のロジスティクスや医療サポートなど、登山以外の側面も考慮する必要があります。"}],"collocations":["non-mountaineering activity","non-mountaineering skills","non-mountaineering equipment"],"synonyms":["non-climbing","unrelated to mountaineering"],"antonyms":["mountaineering"],"related_terms":["mountaineering","climbing","hiking","trekking"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the word 'mountaineering'.","priority":"Medium"},"pronunciation":{"ipa":"/ˌnɒnˌmaʊnˈtɪərɪŋ/","syllables":"non-moun-tain-eer-ing"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"This term is used to distinguish activities, skills, or equipment that are not specifically related to the technical aspects of climbing mountains. It's often used in the context of expeditions or trips that combine mountaineering with other activities.","priority":"Medium"},"level_frequency":{"frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"The word 'non-mountaineering' is a specialized term used to describe activities or aspects that are not directly related to the act of climbing mountains. It is formed by adding the prefix 'non-' to 'mountaineering,' indicating negation. This word is typically used in contexts where mountaineering is the primary activity, but other supporting or alternative activities are also present."},"example_sentences":[{"sentence":"The base camp offered various non-mountaineering entertainment options.","translation":"ベースキャンプでは、さまざまな登山以外の娯楽が提供されていました。","type":"general","meaning_category":"Activities"},{"sentence":"The success of the expedition depended on both mountaineering and non-mountaineering expertise.","translation":"遠征の成功は、登山と登山以外の両方の専門知識にかかっていました。","type":"general","meaning_category":"Skills"},{"sentence":"They packed extra non-mountaineering clothing for relaxing at the lodge.","translation":"彼らはロッジでリラックスするために、登山以外の衣類を余分に詰めました。","type":"general","meaning_category":"Equipment"}]}