{"word":"Austronesian","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"オーストロネシア語族の、オーストロネシア人の","english_definition":"relating to or denoting a family of languages spoken in an area extending from Madagascar east to the Pacific islands and from Taiwan south to New Zealand.","examples":[{"sentence":"Austronesian languages are spoken across a vast area of the Pacific.","translation":"オーストロネシア語族の言語は太平洋の広大な地域で話されています。"},{"sentence":"The Austronesian people have a rich maritime history.","translation":"オーストロネシアの人々は豊かな海洋史を持っています。"}],"collocations":["Austronesian language","Austronesian culture","Austronesian migration","Austronesian people"],"synonyms":["Malayo-Polynesian"],"antonyms":[]},{"part_of_speech":"noun","definition":"オーストロネシア語族、オーストロネシア人","english_definition":"a family of languages spoken in an area extending from Madagascar east to the Pacific islands and from Taiwan south to New Zealand; a member of a population speaking an Austronesian language.","examples":[{"sentence":"Malay is an Austronesian language.","translation":"マレー語はオーストロネシア語族の言語です。"},{"sentence":"The Austronesians were skilled navigators.","translation":"オーストロネシア人は熟練した航海者でした。"}],"collocations":["speak Austronesian","the Austronesian expansion","early Austronesians"],"synonyms":["Malayo-Polynesian"],"antonyms":[]}],"etymology":{"value":"Derived from 'Austro-' (meaning 'south' in Latin) and 'nesos' (meaning 'island' in Greek), reflecting the geographic distribution of these languages across islands in the southern hemisphere.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɔːstrəˈniːʒən/","syllables":"Aus-tro-ne-sian"},"inflection":{"notes":"It can be used as both an adjective and a noun. The plural form of the noun is 'Austronesians'."},"usage_notes":{"explanation":"'Austronesian' is used to refer to both the language family and the people who speak these languages. It's important to note the vast geographic spread of Austronesian languages, encompassing areas from Madagascar to Hawaii to New Zealand.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Austronesian is a country.","correct":"✓ Austronesian is a language family.","note":"Austronesian is not a country, but a language family and a group of people."},{"incorrect":"✗ Austronesian languages are only spoken in Australia.","correct":"✓ Austronesian languages are spoken across a wide area, including Southeast Asia and the Pacific Islands.","note":"Austronesian languages are not limited to Australia; they are widespread across a large area."}],"priority":"★★☆"},"related_words":{"derivatives":["Austronesianist (a scholar of Austronesian languages and cultures)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, mainly used in academic or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Austronesian' is a term primarily used in academic and linguistic contexts to refer to a large language family and the people who speak those languages. Understanding the term requires knowledge of geography and linguistics, as it encompasses a vast area and numerous cultures. The word itself is complex and not commonly used in everyday conversation, making it more suitable for advanced learners or those with a specific interest in the subject."},"example_sentences":[{"sentence":"The study focused on the migration patterns of Austronesian speakers.","translation":"その研究は、オーストロネシア語族の話者の移動パターンに焦点を当てていました。","type":"noun","meaning_category":"people"},{"sentence":"Many Pacific Island cultures share common traits due to their Austronesian heritage.","translation":"多くの太平洋の島々の文化は、オーストロネシアの遺産のために共通の特徴を共有しています。","type":"adjective","meaning_category":"culture"},{"sentence":"Linguists have traced the origins of Austronesian languages back to Taiwan.","translation":"言語学者は、オーストロネシア語族の言語の起源を台湾に遡って追跡しました。","type":"noun","meaning_category":"language family"},{"sentence":"The term 'Austronesian' combines 'Austro' (south) and 'nesos' (island).","translation":"「オーストロネシア」という用語は、「オーストロ」（南）と「ネソス」（島）を組み合わせたものです。","type":"adjective","meaning_category":"etymology"}]}