{"word":"sugar-baker","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"砂糖菓子職人、砂糖菓子製造業者","english_definition":"A confectioner; a maker of sugar confectionery.","examples":[{"sentence":"The sugar-baker carefully crafted intricate designs with the melted sugar.","translation":"砂糖菓子職人は、溶かした砂糖で注意深く複雑なデザインを作り上げた。"},{"sentence":"In the 18th century, the sugar-baker was a highly skilled artisan.","translation":"18世紀において、砂糖菓子職人は高度な技術を持つ職人だった。"}],"collocations":["sugar-baker's shop","sugar-baker's trade","sugar-baker's art"],"synonyms":["confectioner","candymaker"],"antonyms":[]}],"etymology":{"value":"'Sugar' + 'baker'. Originally referred to someone who refined sugar, but later came to mean a maker of sugar confectionery.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʃʊɡərˌbeɪkər/","syllables":"su-gar-ba-ker"},"inflection":{"noun_plural":"sugar-bakers"},"usage_notes":{"explanation":"The term 'sugar-baker' is somewhat archaic and less commonly used in modern English. The more common term is 'confectioner' or 'candymaker'. It specifically refers to someone who makes and sells sugar-based sweets and candies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a bread sugar-baker.","correct":"✓ He is a sugar-baker. / ✓ He is a baker.","note":"'Sugar-baker' already implies the use of sugar, so adding 'bread' is redundant if you mean a sugar confectioner. If the person makes both bread and sugar confectionery, use 'baker'."}],"priority":"★☆☆"},"related_words":{"derivatives":["sugar","baker","sugar confectionery"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Very rare)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'sugar-baker' is an archaic term for a confectioner, someone who makes and sells sugar-based sweets. It is not commonly used in modern English. The word is formed by combining 'sugar' and 'baker', indicating someone who works with sugar in a baking context. It's a relatively obscure term, so understanding its meaning requires a good vocabulary and knowledge of historical trades."},"example_sentences":[{"sentence":"The old sugar-baker was famous for his elaborate gingerbread houses.","translation":"その年老いた砂糖菓子職人は、手の込んだジンジャーブレッドハウスで有名だった。","type":"noun","meaning_category":"砂糖菓子職人"},{"sentence":"The sugar-baker's shop was filled with the sweet aroma of caramel and vanilla.","translation":"砂糖菓子職人の店は、キャラメルとバニラの甘い香りで満たされていた。","type":"noun","meaning_category":"砂糖菓子職人"}]}