{"word":"Ciceronic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"キケロ（マルクス・トゥッリウス・キケロ）の、キケロ風の、キケロを模倣した","english_definition":"Resembling or characteristic of Cicero, especially in rhetoric or style.","examples":[{"sentence":"The speech was delivered in a Ciceronic style, full of elaborate sentences and rhetorical flourishes.","translation":"その演説はキケロ風のスタイルで行われ、手の込んだ文章と修辞的な誇張に満ちていた。"},{"sentence":"He admired the Ciceronic eloquence of the senator.","translation":"彼はその上院議員のキケロ風の雄弁さに感銘を受けた。"},{"sentence":"The essay attempted to capture the Ciceronic ideals of civic virtue and public service.","translation":"そのエッセイは、キケロ風の市民的美徳と公共奉仕の理想を捉えようとした。"}],"collocations":["Ciceronic eloquence (キケロ風の雄弁)","Ciceronic style (キケロ風の文体)","Ciceronic prose (キケロ風の散文)","Ciceronic rhetoric (キケロ風の修辞)"],"synonyms":["eloquent","rhetorical","oratorical","Ciceronian"],"antonyms":["laconic","terse","succinct"]}],"etymology":{"value":"Derived from the name of Marcus Tullius Cicero, a Roman statesman, lawyer, scholar, and orator, who lived from 106 BC to 43 BC. His writings and speeches were highly influential in the development of Latin literature and rhetoric.","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɪsəˈrɒnɪk/","syllables":"Ci-ce-ro-nic"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"\"Ciceronic\" is used to describe something that resembles or is characteristic of Cicero, particularly his style of writing or speaking. It often implies a high degree of eloquence, formality, and rhetorical skill. The term can also refer to Cicero's philosophical or political ideas. It is often used in literary or historical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The modern politician gave a Ciceronic tweet.","correct":"✓ The modern politician gave a speech with Ciceronic elements.","note":"While \"Ciceronic\" refers to style and rhetoric, it's usually associated with more formal communication, like speeches or essays, rather than short-form media like tweets."},{"incorrect":"✗ His Ciceronic was hard to understand.","correct":"✓ His Ciceronic style was hard to understand.","note":"\"Ciceronic\" is an adjective. You need to specify what is Ciceronic (e.g., style, speech, writing)."}],"priority":"★★☆"},"related_words":{"derivatives":["Cicero (noun: マルクス・トゥッリウス・キケロ)","Ciceronian (adjective: キケロの、キケロ風の; noun: キケロ主義者、キケロ風の文体)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"Ciceronic\" is relatively rare and is primarily encountered in academic or literary contexts when discussing classical rhetoric or the works of Cicero. Understanding the term requires familiarity with Cicero and his contributions to literature and political thought. It is not a word commonly used in everyday conversation."},"example_sentences":[{"sentence":"The professor analyzed the student's essay for its Ciceronic structure and argumentation.","translation":"教授は学生のエッセイを、そのキケロ風の構造と論証について分析した。","type":"adjective","meaning_category":"style"},{"sentence":"His Ciceronic oratory captivated the audience.","translation":"彼のキケロ風の弁舌は聴衆を魅了した。","type":"adjective","meaning_category":"eloquence"},{"sentence":"The author aimed for a Ciceronic level of elegance in his prose.","translation":"著者は彼の散文において、キケロ風の優雅さを目指した。","type":"adjective","meaning_category":"style"}]}