{"word":"nonstowed","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(貨物などが)積み込まれていない、格納されていない","english_definition":"Not stowed; not properly packed or stored, especially cargo on a ship or aircraft.","examples":[{"sentence":"The nonstowed cargo shifted during the storm, causing damage.","translation":"積み込まれていない貨物が嵐の間に移動し、損害を引き起こした。"},{"sentence":"All nonstowed items must be secured before takeoff.","translation":"離陸前に、積み込まれていないすべての品物を固定する必要があります。"}],"collocations":["nonstowed cargo","nonstowed items","nonstowed baggage"],"synonyms":["unsecured","unpacked","unloaded"],"antonyms":["stowed","secured","packed","loaded"]}],"etymology":{"value":"Derived from 'stow' (to pack or store carefully and neatly) with the addition of the prefix 'non-' (meaning not).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈstoʊd/","syllables":"non-stowed"},"inflection":{"notes":"Does not have comparative or superlative forms as it's a descriptive adjective."},"usage_notes":{"explanation":"'Nonstowed' is primarily used in contexts related to shipping, aviation, and logistics to describe items, particularly cargo or baggage, that have not been properly secured or stored for transport. It implies a potential hazard or violation of safety regulations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The passengers were nonstowed.","correct":"✓ The passengers were not stowed (away).","note":"'Nonstowed' typically applies to cargo or items, not people. To indicate passengers who are not properly seated or secured, use 'not stowed away' or similar phrasing."}],"priority":"★★☆"},"related_words":{"derivatives":["stow (verb)","stowage (noun)","stowed (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency (relatively rare word)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nonstowed' is a specialized term primarily used in the context of transportation, particularly shipping and aviation. It describes cargo or items that have not been properly packed or secured for transport. Understanding this term requires familiarity with logistics and safety procedures in these industries."},"example_sentences":[{"sentence":"The inspection revealed several pieces of nonstowed equipment in the hold.","translation":"検査により、船倉にいくつかの積み込まれていない機器があることが判明した。","type":"adjective","meaning_category":"Not properly stored"},{"sentence":"The airline requires all nonstowed carry-on luggage to fit under the seat.","translation":"航空会社は、積み込まれていないすべての機内持ち込み手荷物を座席の下に収納することを義務付けている。","type":"adjective","meaning_category":"Not secured"}]}