{"word":"agammaglobulinemia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"無ガンマグロブリン血症","english_definition":"A rare genetic disorder characterized by the virtual absence of gamma globulins in the blood, resulting in increased susceptibility to infection.","examples":[{"sentence":"Agammaglobulinemia is usually diagnosed in infancy due to recurrent infections.","translation":"無ガンマグロブリン血症は、通常、繰り返される感染症のために乳児期に診断されます。"},{"sentence":"Treatment for agammaglobulinemia typically involves immunoglobulin replacement therapy.","translation":"無ガンマグロブリン血症の治療は、通常、免疫グロブリン補充療法を伴います。"}],"collocations":["X-linked agammaglobulinemia (X連鎖無ガンマグロブリン血症)","Common variable agammaglobulinemia (共通可変型無ガンマグロブリン血症)"],"synonyms":["hypogammaglobulinemia","immunodeficiency"],"antonyms":["hypergammaglobulinemia"]},{"part_of_speech":"noun","definition":"アガムマグロブリン血症","english_definition":"A condition characterized by the absence or very low levels of gamma globulins in the blood.","examples":[{"sentence":"Patients with agammaglobulinemia are prone to bacterial infections.","translation":"アガムマグロブリン血症の患者は細菌感染を起こしやすい。"}],"collocations":["Agammaglobulinemia diagnosis","Agammaglobulinemia treatment"],"synonyms":["Immunodeficiency","Antibody deficiency"],"antonyms":["Normal immune function"]}],"etymology":{"value":"From the Greek prefix 'a-' (meaning 'without'), 'gamma' (referring to gamma globulins), 'globulin' (a type of protein in the blood), and '-emia' (referring to a condition of the blood).","priority":"★★☆"},"pronunciation":{"ipa":"/eɪˌɡæməˌɡlɒbjʊlɪˈniːmiə/","syllables":"a-gam-ma-glob-u-li-ne-mi-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Agammaglobulinemia is a rare immunodeficiency disorder characterized by the absence or extremely low levels of gamma globulins (antibodies) in the blood. This deficiency makes individuals highly susceptible to bacterial infections. Diagnosis is typically made in infancy or early childhood due to recurrent infections. Treatment usually involves immunoglobulin replacement therapy to provide the missing antibodies.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Agammaglobulinemia is a type of anemia.","correct":"✓ Agammaglobulinemia is a type of immunodeficiency.","note":"Agammaglobulinemia is an immunodeficiency, not a blood disorder like anemia."}],"priority":"★★☆"},"related_words":{"derivatives":["agammaglobulinemic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Agammaglobulinemia' is a complex medical term referring to a rare genetic disorder. Understanding requires knowledge of medical terminology, particularly related to immunology and blood components. The term is primarily used in medical contexts and is not commonly encountered in general conversation."},"example_sentences":[{"sentence":"X-linked agammaglobulinemia (XLA) is a genetic disorder that primarily affects males.","translation":"X連鎖無ガンマグロブリン血症（XLA）は、主に男性に影響を与える遺伝性疾患です。","type":"noun","meaning_category":"disease"},{"sentence":"Early diagnosis and treatment of agammaglobulinemia are crucial for preventing severe infections.","translation":"重症感染症を防ぐためには、無ガンマグロブリン血症の早期診断と治療が不可欠です。","type":"noun","meaning_category":"disease"},{"sentence":"Immunoglobulin replacement therapy is a common treatment for patients with agammaglobulinemia.","translation":"免疫グロブリン補充療法は、無ガンマグロブリン血症の患者に対する一般的な治療法です。","type":"noun","meaning_category":"treatment"}]}