{"word":"levelers","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(複数形)水平にする人、平らにする道具、平等主義者","english_definition":"(plural) people or things that make something level; people who advocate or work for social and economic equality.","examples":[{"sentence":"The construction workers used levelers to ensure the foundation was perfectly flat.","translation":"建設作業員は、基礎が完全に平らになるように水平器を使用した。"},{"sentence":"The political party promoted policies aimed at being levelers in society.","translation":"その政党は、社会の平等主義者を目指す政策を推進した。"}],"collocations":["construction levelers","social levelers","economic levelers"],"synonyms":["equalizers","flatteners","graders"],"antonyms":["discriminators","unequalizers"]}],"etymology":{"value":"Derived from the verb 'level', meaning to make something flat or equal. The suffix '-er' denotes a person or thing that performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɛvələrz/","syllables":"lev-el-ers"},"inflection":{"noun_plural":"levelers"},"usage_notes":{"explanation":"'Levelers' can refer to physical tools used to create a flat surface, or to people who advocate for social and economic equality. The context determines the meaning. When capitalized, 'Levelers' refers to a specific political movement in 17th-century England.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a leveler, he makes all the ground flat.","correct":"✓ He is a leveler; he makes all the ground flat. / ✓ He uses a leveler to make all the ground flat.","note":"The first sentence implies he is a person, the second clarifies the tool."},{"incorrect":"✗ The levelers are a tool for equality.","correct":"✓ Leveling is a tool for equality. / ✓ Policies promoting equality are levelers.","note":"Levelers are people or policies that promote equality, not the abstract concept of equality itself."}],"priority":"★★☆"},"related_words":{"derivatives":["level (verb, noun, adjective)","leveling (gerund/present participle)","leveler (singular noun)"],"phrases":["playing field leveler"],"priority":"★★★"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'levelers' has two main meanings. One refers to tools or devices used to make surfaces flat or horizontal. The other, often capitalized as 'Levelers', refers to historical or contemporary movements or individuals advocating for social and economic equality. The term implies a desire to reduce disparities and create a more even playing field. Understanding the context is essential to interpret the intended meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The surveyors used precision levelers to measure the elevation changes across the site.","translation":"測量技師は、現場全体の標高の変化を測定するために精密な水平器を使用した。","type":"noun","meaning_category":"Tools"},{"sentence":"The Levelers were a radical political movement during the English Civil War.","translation":"水平派は、イングランド内戦中の急進的な政治運動だった。","type":"noun","meaning_category":"Historical Movement"},{"sentence":"Some argue that progressive taxation acts as levelers in society, redistributing wealth.","translation":"累進課税は、社会の平等化装置として機能し、富を再分配すると主張する人もいる。","type":"noun","meaning_category":"Social/Economic Equality"}]}