{"word":"galoshe","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(ゴムまたは防水素材の)長靴、オーバーシューズ","english_definition":"a waterproof overshoe, typically made of rubber, worn to protect shoes from rain or snow.","examples":[{"sentence":"He put on his galoshes before going out in the snow.","translation":"彼は雪の中に出かける前に長靴を履いた。"},{"sentence":"She wore galoshes to keep her shoes dry.","translation":"彼女は靴を濡らさないようにオーバーシューズを履いた。"}],"collocations":["wear galoshes","rubber galoshes","put on galoshes","take off galoshes"],"synonyms":["overshoe","rubber boot","wellington boot","boot"],"antonyms":[],"notes":"Galoshes are typically worn over regular shoes. They are often made of rubber or other waterproof materials."}],"etymology":{"value":"フランス語の「galoche」から派生し、これはラテン語の「gallica solea」（ガリア風のサンダル）に由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/ɡəˈlɒʃ/","syllables":"ga-loshe"},"inflection":{"noun_plural":"galoshes"},"usage_notes":{"explanation":"A galoshe is a type of protective footwear worn over shoes, especially in wet or snowy conditions. While the term 'galoshes' is still used, especially to refer to rubber overshoes, the word is becoming less common as more modern waterproof footwear options become available.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I wear galosh in the rain.","correct":"✓ I wear galoshes in the rain.","note":"'Galoshes' is typically used in the plural form, even when referring to a single pair."},{"incorrect":"✗ He wore galoshe to the party.","correct":"✓ He wore shoes to the party.","note":"Galoshes are functional footwear for bad weather, not typically worn to formal events."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["boot","wellington boot","rubber boot","overshoe"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"galoshe\" refers to a type of waterproof overshoe, usually made of rubber, that you wear over your regular shoes to protect them from rain or snow. It's not a very common word these days, as there are many other kinds of waterproof boots available, but you might still hear it used, especially by older people. It's important to remember that the word is usually used in the plural form, \"galoshes,\" even when you're talking about one pair."},"example_sentences":[{"sentence":"During the heavy snowfall, everyone was advised to wear warm boots or galoshes.","translation":"大雪の間、誰もが暖かいブーツか長靴を履くように勧められた。","type":"general","meaning_category":"general"},{"sentence":"The children left their muddy galoshes by the door.","translation":"子供たちは泥だらけの長靴をドアのそばに置いた。","type":"general","meaning_category":"general"},{"sentence":"In the past, galoshes were a common sight on rainy days.","translation":"昔は、雨の日に長靴を履いている姿をよく見かけたものだ。","type":"historical","meaning_category":"historical"}]}