{"word":"antiromance","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"反ロマンス、反恋愛","english_definition":"A genre or style that opposes or subverts traditional romance tropes and conventions.","examples":[{"sentence":"The novel is an antiromance, focusing on the characters' disillusionment with love.","translation":"その小説は反ロマンスであり、登場人物たちの恋愛に対する幻滅に焦点を当てている。"},{"sentence":"The film uses antiromance elements to critique societal expectations of relationships.","translation":"その映画は、反ロマンスの要素を使って、社会的な人間関係への期待を批判している。"}],"collocations":["antiromance novel","antiromance film","elements of antiromance"],"synonyms":["cynical romance","unromantic narrative","subverted romance"],"antonyms":["romance","romantic narrative"]},{"part_of_speech":"adjective","definition":"反ロマンスの、反恋愛的な","english_definition":"Opposing or subverting traditional romance tropes and conventions.","examples":[{"sentence":"The antiromance themes in the play challenge the audience's expectations.","translation":"その劇の反ロマンスのテーマは、観客の期待に挑戦する。"},{"sentence":"The story has an antiromance feel, with characters who are skeptical about love.","translation":"その物語は反ロマンス的な雰囲気があり、登場人物たちは恋愛に対して懐疑的である。"}],"collocations":["antiromance theme","antiromance plot","antiromance elements"],"synonyms":["unromantic","cynical","skeptical of romance"],"antonyms":["romantic","sentimental"]}],"etymology":{"value":"Formed from \"anti-\" (against) + \"romance\".","priority":"★★★"},"pronunciation":{"ipa":"/ˌæntiˈroʊmæns/","syllables":"an-ti-ro-mance"},"inflection":{"notes":"The noun is countable. The adjective does not inflect."},"usage_notes":{"explanation":"'Antiromance' refers to works that intentionally go against the typical elements of romance stories. Instead of focusing on idealized love and happy endings, antiromances often explore the darker, more cynical, or realistic aspects of relationships. They may feature flawed characters, unhappy endings, or a general skepticism towards the idea of romantic love.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The movie was very romance, but actually antiromance.","correct":"✓ The movie seemed romantic, but was actually antiromance.","note":"'Romance' and 'antiromance' are opposing concepts. A work cannot be both at the same time. It can appear to be one, but then subvert the expectations."},{"incorrect":"✗ He wrote an antiromance about the love.","correct":"✓ He wrote an antiromance about love.","note":"'Antiromance' is a genre or style, not something one writes 'about the love', but rather a type of story. The story is about love, but the style is antiromance."}],"priority":"★★☆"},"related_words":{"derivatives":["antiromantic (adjective)"],"phrasal_verbs":[],"related_genres":["dark comedy","satire","realism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Antiromance' is a term used to describe narratives that deliberately challenge or undermine the conventions of traditional romance. Instead of focusing on idealized love, happy endings, and perfect relationships, antiromance stories often explore the more cynical, realistic, or even negative aspects of love and relationships. These stories may feature flawed characters, unhappy endings, or a general skepticism towards the idea of romantic love itself. The term is often used in literary and film criticism to categorize works that offer a counterpoint to mainstream romance narratives."},"example_sentences":[{"sentence":"The play is a clever **antiromance** that mocks the clichés of romantic comedies.","translation":"その劇は、ロマンチックコメディの決まり文句を嘲笑する巧妙な**反ロマンス**である。","type":"noun","meaning_category":"反ロマンス作品"},{"sentence":"The film's **antiromance** themes resonated with viewers who were tired of unrealistic portrayals of love.","translation":"その映画の**反ロマンス**のテーマは、非現実的な恋愛の描写に飽きていた視聴者の共感を呼んだ。","type":"adjective","meaning_category":"反ロマンス的な"},{"sentence":"Her novel is considered an **antiromance** because it portrays the complexities and disappointments of modern relationships.","translation":"彼女の小説は、現代の関係の複雑さと失望を描いているため、**反ロマンス**と見なされている。","type":"noun","meaning_category":"反ロマンス作品"}]}