{"word":"interlotted","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(主に不動産や土地に関して)区画整理された、相互に区画された","english_definition":"(chiefly of real estate or land) divided into lots that are interconnected or mutually arranged.","examples":[{"sentence":"The interlotted parcels of land were designed to maximize access to shared amenities.","translation":"相互に区画整理された土地は、共有設備へのアクセスを最大化するように設計されました。"},{"sentence":"The interlotted properties created a cohesive community with interconnected green spaces.","translation":"相互に区画整理された不動産は、相互につながった緑地のある結束の固いコミュニティを作り出しました。"}],"collocations":["interlotted parcels","interlotted properties","interlotted land"],"synonyms":["interconnected","interrelated","interlinked","integrated","mutually arranged"],"antonyms":["separated","isolated","disconnected","independent"]}],"etymology":{"value":"\"Inter-\"（相互に、間に）と \"lotted\"（区画された）の組み合わせ。不動産や土地開発の文脈で、区画が互いに関連し、計画的に配置されていることを示すために使用される。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪntərˈlɒtɪd/","syllables":"in-ter-lot-ted"},"inflection":{"notes":"形容詞であり、比較級や最上級の形は通常ありません。"},"usage_notes":{"explanation":"\"Interlotted\"は、主に不動産や土地開発の専門用語として使用され、区画が相互に接続され、計画的に配置されていることを指します。この用語は、コミュニティの結束を高め、共有リソースへのアクセスを改善するために設計された開発プロジェクトを説明する際によく使用されます。日常会話ではあまり一般的ではありません。","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The interlotted houses were very far apart.","correct":"✓ The houses, though interlotted, were still somewhat far apart.","note":"「interlotted」は区画が相互接続されていることを意味するため、物理的に遠く離れている場合は矛盾が生じます。接続されているにもかかわらず距離があることを示すように修正します。"},{"incorrect":"✗ The interlotted design made it difficult to tell where one property ended and another began.","correct":"✓ The integrated design made it difficult to tell where one property ended and another began.","note":"「integrated」はより一般的な用語であり、設計が統合されていることを示すため、より適切な場合があります。「interlotted」は土地の区画整理に特化した用語です。"}],"priority":"★☆☆"},"related_words":{"derivatives":["lot (名詞: 区画)","inter- (接頭辞: 相互に、間に)"],"phrasal_verbs":[],"related_concepts":["land development","urban planning","community design","real estate","zoning regulations"]},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 主に専門的な文脈で使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Interlotted\"という単語は、主に不動産や都市計画の分野で使用される専門用語です。土地が区画に分割され、それらの区画が相互に接続または関連付けられている状態を指します。この単語は、区画が独立しているのではなく、全体的な計画の一部として設計されていることを強調するために使用されます。日常会話ではほとんど使用されず、専門的な文脈でのみ見られる可能性が高いです。"},"example_sentences":[{"sentence":"The interlotted lots allowed for shared driveways and communal gardens.","translation":"相互に区画整理された区画は、共有の私道と共同庭園を可能にしました。","type":"adjective","meaning_category":"区画整理された"},{"sentence":"The city planners envisioned an interlotted community that fostered social interaction.","translation":"都市計画家は、社会的交流を促進する相互に区画整理されたコミュニティを構想しました。","type":"adjective","meaning_category":"区画整理された"},{"sentence":"The value of the interlotted properties increased due to the integrated design.","translation":"統合された設計により、相互に区画整理された不動産の価値が向上しました。","type":"adjective","meaning_category":"区画整理された"}]}