{"word":"copyreader","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"校正者、校閲者、編集者","english_definition":"A person who reads and corrects written material before it is printed or published.","examples":[{"sentence":"The copyreader meticulously checked the manuscript for errors.","translation":"校正者は原稿を細心の注意を払ってチェックし、誤りがないか確認した。"},{"sentence":"A good copyreader can improve the clarity and accuracy of any text.","translation":"優秀な校正者は、どんな文章でも明瞭さと正確さを向上させることができる。"},{"sentence":"The newspaper hired a new copyreader to ensure high-quality articles.","translation":"その新聞社は、質の高い記事を保証するために、新しい校正者を雇った。"}],"collocations":["work as a copyreader (校正者として働く)","hire a copyreader (校正者を雇う)","experienced copyreader (経験豊富な校正者)","freelance copyreader (フリーランスの校正者)"],"synonyms":["proofreader","editor","reviser","subeditor"],"antonyms":["writer","author"]}],"etymology":{"value":"The word 'copyreader' is a compound of 'copy' (referring to the written material) and 'reader' (someone who reads). It describes the person who reads the copy for errors and inconsistencies.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒpiˌriːdər/","syllables":"cop-y-read-er"},"inflection":{"noun_plural":"copyreaders"},"usage_notes":{"explanation":"A 'copyreader' is responsible for ensuring that written material is free of errors in grammar, spelling, punctuation, and style. They also check for factual accuracy and consistency. The role is crucial in publishing, journalism, and any field where written communication is important.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a copy writer.","correct":"✓ She is a copyreader.","note":"'Copywriter' is someone who writes advertising or marketing text, while a 'copyreader' corrects and edits text."},{"incorrect":"✗ The copyreader only looks for spelling mistakes.","correct":"✓ The copyreader looks for spelling mistakes, grammatical errors, and inconsistencies in style.","note":"Copyreaders check for more than just spelling; they also look for grammatical errors, factual inaccuracies, and inconsistencies in style."}],"priority":"★★☆"},"related_words":{"derivatives":["copyreading (noun: the act of reading and correcting copy)"],"phrasal_verbs":[],"related_occupations":["editor","proofreader","journalist","writer","content creator"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. More common in professional writing and publishing contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'copyreader' refers to a professional who reviews and corrects written material before publication. This involves checking for errors in grammar, spelling, punctuation, and style, as well as ensuring factual accuracy and consistency. Understanding this term is useful in contexts related to publishing, journalism, and professional writing.","priority":"★★☆"},"example_sentences":[{"sentence":"The publishing house employs several **copyreaders** to maintain the quality of their books.","translation":"その出版社は、書籍の品質を維持するために、数人の校正者を雇用している。","type":"noun","meaning_category":"校正者"},{"sentence":"As a **copyreader**, she has a keen eye for detail.","translation":"校正者として、彼女は細部に対する鋭い目を持っている。","type":"noun","meaning_category":"校正者"},{"sentence":"The **copyreader** suggested several improvements to the article's structure.","translation":"校正者は、記事の構成についていくつかの改善点を提案した。","type":"noun","meaning_category":"校正者"}]}