{"word":"noncontiguous","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"隣接していない、連続していない、接触していない","english_definition":"not sharing a common boundary; not adjacent; not continuous.","examples":[{"sentence":"The United States is noncontiguous with Hawaii and Alaska.","translation":"アメリカ合衆国は、ハワイとアラスカとは隣接していない。"},{"sentence":"The islands form a noncontiguous archipelago.","translation":"その島々は、隣接していない群島を形成している。"},{"sentence":"The company has several noncontiguous parcels of land.","translation":"その会社は、隣接していない複数の土地区画を所有している。"},{"sentence":"These noncontiguous fragments of DNA were assembled into a complete sequence.","translation":"これらの隣接していないDNA断片は、完全な配列に組み立てられた。"}],"collocations":["noncontiguous states","noncontiguous islands","noncontiguous parcels","noncontiguous memory","noncontiguous data"],"synonyms":["discontinuous","separated","disconnected","detached","isolated","scattered"],"antonyms":["contiguous","adjacent","continuous","connected","neighboring"]}],"etymology":{"value":"The word \"noncontiguous\" is formed by adding the prefix \"non-\" (meaning \"not\") to the word \"contiguous.\" The word \"contiguous\" comes from the Latin word \"contingere,\" meaning \"to touch\" or \"to border upon.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnkənˈtɪɡjuəs/","syllables":"non-con-tig-u-ous"},"inflection":{"notes":"This is an adjective and does not have different forms for gender or number."},"usage_notes":{"explanation":"\"Noncontiguous\" is used to describe things that are not touching or next to each other. It is often used in geography to describe areas that are not connected, such as states or islands. It can also be used in computer science to describe memory or data that is not stored in a continuous block. The word implies a spatial or sequential separation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The contiguous states are Hawaii and Alaska.","correct":"✓ The noncontiguous states are Hawaii and Alaska.","note":"Hawaii and Alaska are not connected to the main landmass of the United States, so they are noncontiguous, not contiguous."},{"incorrect":"✗ The data was stored in a contiguous manner.","correct":"✓ The data was stored in a noncontiguous manner.","note":"If data is not stored in a continuous block, it is noncontiguous, not contiguous."}],"priority":"★★☆"},"related_words":{"derivatives":["noncontiguously (adverb)","noncontiguity (noun)"],"related_terms":["contiguous","adjacency","discontinuous","discrete"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"noncontiguous\" is a relatively formal and technical term. It is most commonly used in specialized contexts such as geography, computer science, and real estate. Understanding the meaning of the prefix \"non-\" and the root word \"contiguous\" can help in understanding the meaning of this word. It is not typically used in everyday conversation."},"example_sentences":[{"sentence":"The company's offices are located in several noncontiguous buildings across the city.","translation":"その会社のオフィスは、市内の隣接していない複数の建物に位置している。","type":"general","meaning_category":"general"},{"sentence":"Noncontiguous memory allocation can lead to fragmentation.","translation":"隣接していないメモリ割り当ては、フラグメンテーションにつながる可能性がある。","type":"computer science","meaning_category":"computer science"},{"sentence":"The noncontiguous nature of the islands makes transportation challenging.","translation":"島々が隣接していないため、輸送が困難になっている。","type":"geography","meaning_category":"geography"}]}