{"word":"exopathic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"外部原因性の、外因性の","english_definition":"Relating to or caused by external factors or agents.","examples":[{"sentence":"The doctor determined that the patient's illness was exopathic, caused by a virus contracted from another person.","translation":"医師は、患者の病気が外因性であり、他人から感染したウイルスによって引き起こされたと判断した。"},{"sentence":"Exopathic factors, such as pollution and poor diet, can significantly impact public health.","translation":"汚染や不健康な食生活などの外因性の要因は、公衆衛生に大きな影響を与える可能性がある。"}],"collocations":["exopathic disease","exopathic factors","exopathic causes"],"synonyms":["extrinsic","external","environmental"],"antonyms":["idiopathic","intrinsic","endogenous"]}],"etymology":{"value":"Derived from the Greek words 'exo-' meaning 'outside' and 'pathos' meaning 'suffering' or 'disease'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛksoʊˈpæθɪk/","syllables":"ex-o-path-ic"},"inflection":{},"usage_notes":{"explanation":"The term 'exopathic' is often used in medical and scientific contexts to describe conditions or diseases that originate from external sources, as opposed to those that arise from internal or unknown causes. It is the opposite of 'idiopathic,' which refers to diseases of unknown origin, or 'endogenous,' which refers to conditions arising from within the body.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The exopathic disease was caused by genetic factors.","correct":"✓ The exopathic disease was caused by environmental factors.","note":"Exopathic diseases are caused by external factors, not genetic ones."}],"priority":"★☆☆"},"related_words":{"derivatives":["exopathy (noun): A disease or condition caused by external factors."],"related_terms":["pathogen","etiology","extrinsic"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in medical or scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Exopathic' is a specialized term primarily used in medical and scientific fields. It describes conditions or diseases caused by external factors, such as infections or environmental influences. Understanding this term requires a familiarity with medical terminology and the concept of disease etiology."},"example_sentences":[{"sentence":"The researchers investigated the exopathic causes of the outbreak.","translation":"研究者たちは、その発生の原因となった外因性の原因を調査した。","type":"general","meaning_category":"external causes"},{"sentence":"Exopathic agents, like bacteria and viruses, can lead to various infections.","translation":"細菌やウイルスのような外因性の病原体は、さまざまな感染症を引き起こす可能性がある。","type":"medical","meaning_category":"medical causes"}]}