{"word":"misingenuity","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"The quality of being deliberately misleading or deceptive; calculated lack of candor; artful deception.","english_definition":"The use of deception or subtle distortion to present a false picture; deliberate deceptiveness; calculated lack of candor.","examples":[{"sentence":"The company was accused of misingenuity in its advertising campaign.","translation":"その会社は広告キャンペーンにおける欺瞞行為で告発された。"},{"sentence":"His misingenuity was evident in the way he twisted the facts to suit his argument.","translation":"彼の欺瞞は、自分の主張に合うように事実を歪曲するやり方にはっきりと表れていた。"},{"sentence":"The politician's speech was filled with misingenuity, making it difficult to discern the truth.","translation":"その政治家の演説は欺瞞に満ちており、真実を見抜くのが困難だった。"}],"collocations":["calculated misingenuity","deliberate misingenuity","political misingenuity","corporate misingenuity"],"synonyms":["deception","dishonesty","deceitfulness","mendacity","duplicity","guile","artifice","subterfuge","trickery","fraudulence"],"antonyms":["candor","honesty","sincerity","truthfulness","frankness","ingenuousness"]}],"etymology":{"value":"Formed from \"mis-\" (prefix meaning \"wrongly\" or \"badly\") + \"ingenuity\" (cleverness, inventiveness, or skill), suggesting a cleverness or skill used for deceptive purposes.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɪsɪndʒəˈnjuːɪti/","syllables":"mis-in-ge-nu-i-ty"},"inflection":{"noun_plural":"misingenuities (rarely used)"},"usage_notes":{"explanation":"\"Misingenuity\" refers to the quality of being deliberately deceptive or misleading, often involving a clever or artful approach. It implies a calculated lack of candor, where someone uses their ingenuity to create a false impression or distort the truth. While it shares similarities with terms like \"deception\" and \"dishonesty,\" \"misingenuity\" often emphasizes the clever or skillful aspect of the deception.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ His misingenuity was to lie.","correct":"✓ His misingenuity involved twisting the facts.","note":"\"Misingenuity\" is a quality or characteristic, not an action itself. Therefore, it's better to describe what the misingenuity *involved* or *consisted of* rather than saying it *was* a specific action like lying."},{"incorrect":"✗ The misingenuity of the plan was obvious.","correct":"✓ The deceptiveness of the plan was obvious.","note":"While \"misingenuity\" implies deception, using \"deceptiveness\" might be clearer and more direct, as \"misingenuity\" is a less common word."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_concepts":["misinformation","disinformation","obfuscation","equivocation","prevarication"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (very rare and specialized vocabulary)","frequency_google_ngram":"Extremely low frequency - a relatively rare word.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Misingenuity\" is a sophisticated and uncommon word that describes the quality of being deliberately misleading or deceptive, often using clever or artful means. It's not a word you'll encounter frequently, and it's more likely to appear in formal writing or discussions about ethics, politics, or business where deliberate deception is a key issue. Because it's a rare word, it's important to understand its precise meaning to use it correctly. It is related to the idea of using ingenuity (cleverness) in a misleading way."},"example_sentences":[{"sentence":"The report revealed a pattern of corporate misingenuity designed to mislead investors.","translation":"その報告書は、投資家を欺くために設計された企業の欺瞞行為のパターンを明らかにした。","type":"noun","meaning_category":"deception"},{"sentence":"The lawyer skillfully exposed the witness's misingenuity during cross-examination.","translation":"弁護士は反対尋問中に、証人の欺瞞を巧みに暴いた。","type":"noun","meaning_category":"deception"},{"sentence":"The advertisement relied on clever misingenuity to create a false sense of value.","translation":"その広告は、価値があるという誤った感覚を作り出すために、巧妙な欺瞞に頼っていた。","type":"noun","meaning_category":"deception"}]}