{"word":"echophrasia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"反響言語：他人の言葉やフレーズを無意味に繰り返すこと。特に自閉症スペクトラム障害や統合失調症などの精神疾患を持つ人に見られる症状。","english_definition":"The meaningless repetition of another person's spoken words or phrases. It is often seen in individuals with mental disorders such as autism spectrum disorder or schizophrenia.","examples":[{"sentence":"The child with autism exhibited echophrasia by repeating everything his teacher said.","translation":"自閉症の子供は、先生が言ったことをすべて繰り返す反響言語を示した。"},{"sentence":"Echophrasia can be immediate, occurring right after hearing the words, or delayed, happening hours or days later.","translation":"反響言語は、言葉を聞いた直後に起こる即時性反響言語と、数時間または数日後に起こる遅延性反響言語がある。"}],"collocations":["exhibit echophrasia","delayed echophrasia","immediate echophrasia"],"synonyms":["echolalia","parrot talk","repetition of speech"],"antonyms":[],"notes":"Echophrasia is a type of echolalia, specifically referring to the repetition of phrases rather than single words."}],"etymology":{"value":"From Greek 'echo' (ἠχώ) meaning 'echo' and 'phrasis' (φράσις) meaning 'speech, phrase'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛkoʊˈfreɪziə/","syllables":"e-cho-phra-si-a"},"inflection":{"noun_plural":"echophrasias"},"usage_notes":{"explanation":"Echophrasia is a specific type of echolalia that involves the repetition of phrases or sentences, rather than just single words. It's often observed in individuals with autism spectrum disorder, but can also be a symptom of other neurological or psychiatric conditions. The repetition may be immediate or delayed, and the individual may or may not understand the meaning of the phrases they are repeating. It is important to note that echophrasia can sometimes serve a communicative function for individuals with autism, such as requesting something or initiating social interaction.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The child's echophrasia was a sign of intelligence.","correct":"✓ The child's echophrasia was a symptom of a developmental disorder.","note":"Echophrasia is a symptom of a developmental or neurological condition, not a sign of intelligence."},{"incorrect":"✗ Echophrasia is easily cured with medication.","correct":"✓ Echophrasia can be managed with therapy and support.","note":"Echophrasia is not typically cured with medication, but can be managed with therapy and support strategies."}],"priority":"★★☆"},"related_words":{"derivatives":["echolalia","phrase","echo"],"phrasal_verbs":[],"related_terms":["autism spectrum disorder","schizophrenia","developmental disorder","neurological disorder"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily used in medical or psychological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Echophrasia' is a technical term used in psychology and medicine to describe the repetition of phrases or sentences by another person. It's often associated with conditions like autism spectrum disorder. Because it's a specialized term, it's not commonly used in everyday conversation. Understanding this word requires a knowledge of psychological terminology."},"example_sentences":[{"sentence":"His echophrasia made it difficult to understand his original thoughts.","translation":"彼の反響言語のために、彼の本来の考えを理解することが困難だった。","type":"general","meaning_category":"general"},{"sentence":"The therapist worked with the child to reduce his echophrasia and improve communication skills.","translation":"セラピストは、子供の反響言語を減らし、コミュニケーションスキルを向上させるために協力した。","type":"clinical","meaning_category":"clinical"}]}