{"word":"occipitonuchal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"後頭部と項部に関する、またはそれらに位置する","english_definition":"Relating to or situated in the occiput and the nucha (the back of the neck).","examples":[{"sentence":"The occipitonuchal muscles are important for head movement.","translation":"後頭頸部の筋肉は、頭の動きに重要である。"},{"sentence":"An occipitonuchal headache can be caused by tension in the neck.","translation":"後頭頸部の頭痛は、首の緊張によって引き起こされることがある。"}],"collocations":["occipitonuchal muscles","occipitonuchal headache","occipitonuchal region"],"synonyms":["nuchal","occipital"],"antonyms":[]}],"etymology":{"value":"Derived from the combination of 'occipito-' (referring to the occiput, the back of the head) and 'nuchal' (referring to the nucha, the back of the neck).","priority":"★★☆"},"pronunciation":{"ipa":"/ɒkˌsɪpɪtoʊˈnuːkəl/","syllables":"oc-cip-i-to-nu-chal"},"inflection":{"notes":"Adjectives do not typically inflect in English, aside from comparative and superlative forms, which are not commonly used with this word."},"usage_notes":{"explanation":"The term 'occipitonuchal' is primarily used in medical and anatomical contexts to describe structures, regions, or conditions that involve both the occiput (the bone at the back of the skull) and the nucha (the back of the neck). It is a relatively specialized term.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["occiput","nucha"],"related_terms":["occipitofrontalis","nuchal rigidity","cervicalgia"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Occipitonuchal' is a highly specialized anatomical term primarily encountered in medical or scientific contexts. Understanding requires familiarity with anatomical terminology, specifically 'occiput' (back of the head) and 'nucha' (back of the neck). Due to its limited usage, it is unlikely to be encountered outside of specialized literature."},"example_sentences":[{"sentence":"The patient presented with occipitonuchal pain following the injury.","translation":"患者は、負傷後、後頭頸部の痛みを訴えた。","type":"general","meaning_category":"pain"},{"sentence":"Examination revealed tenderness in the occipitonuchal musculature.","translation":"検査により、後頭頸部の筋肉に圧痛が認められた。","type":"medical","meaning_category":"musculature"}]}