{"word":"catabolic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"異化作用の、異化的な","english_definition":"relating to or promoting catabolism, the metabolic breakdown of complex molecules into simpler ones, often with the release of energy.","examples":[{"sentence":"Catabolic processes release energy that the body can use.","translation":"異化プロセスは、体が使用できるエネルギーを放出します。"},{"sentence":"During starvation, the body enters a catabolic state.","translation":"飢餓の間、体は異化状態に入ります。"},{"sentence":"Certain hormones can have catabolic effects on muscle tissue.","translation":"特定のホルモンは、筋肉組織に異化作用を及ぼす可能性があります。"}],"collocations":["catabolic pathway","catabolic reaction","catabolic state","catabolic hormone"],"synonyms":["destructive","degenerative","breaking down"],"antonyms":["anabolic","constructive","building up"],"related_terms":["metabolism","catabolism","anabolism","hormone","muscle tissue"]}],"etymology":{"value":"Derived from 'catabolism', which comes from the Greek 'katabole' meaning 'a throwing down, overthrow', from 'kata-' meaning 'down' + 'ballein' meaning 'to throw'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkætəˈbɒlɪk/","syllables":"ca-ta-bol-ic"},"inflection":{"notes":"No specific inflectional forms beyond the adjective itself."},"usage_notes":{"explanation":"'Catabolic' describes processes that break down complex molecules into simpler ones, releasing energy. It's often used in the context of metabolism, nutrition, and exercise physiology. It's the opposite of 'anabolic', which refers to building up complex molecules.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The exercise was very catabolic and built muscle.","correct":"✓ The exercise was very intense and led to muscle breakdown, which can then be rebuilt with proper nutrition (anabolism).","note":"Catabolic processes break down tissue, including muscle. Muscle building is an anabolic process."}],"priority":"★☆☆"},"related_words":{"derivatives":["catabolism (noun): The breakdown of complex molecules in living organisms to form simpler ones, together with the release of energy; destructive metabolism.","catabolize (verb): To subject to catabolism."],"priority":"★★☆"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific or technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Catabolic' is a technical term used in biology and medicine to describe processes that break down complex substances in the body into simpler ones, releasing energy. It's often contrasted with 'anabolic', which refers to building up substances. Understanding this term requires some background knowledge in biology or biochemistry."},"example_sentences":[{"sentence":"Cortisol is a hormone known for its **catabolic** effects on muscle.","translation":"コルチゾールは、筋肉に対する異化作用で知られるホルモンです。","type":"adjective","meaning_category":"異化作用の"},{"sentence":"The **catabolic** pathways in the liver break down toxins.","translation":"肝臓の異化経路は毒素を分解します。","type":"adjective","meaning_category":"異化作用の"},{"sentence":"During prolonged endurance exercise, the body can become highly **catabolic**.","translation":"長時間の持久運動中、体は高度な異化状態になる可能性があります。","type":"adjective","meaning_category":"異化作用の"}]}