{"word":"outswindled","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"出し抜いて騙し取る、相手を上回る詐欺を働く","english_definition":"To swindle (someone) to a greater degree than they swindle others; to surpass in swindling.","examples":[{"sentence":"He thought he was a master con artist, but she outswindled him and took all his money.","translation":"彼は自分が詐欺師の達人だと思っていたが、彼女は彼を出し抜いて騙し、彼の金すべてを奪った。"},{"sentence":"The company outswindled its competitors by using more sophisticated scams.","translation":"その会社はより洗練された詐欺を使って競合他社を出し抜いた。"}],"collocations":["outswindle someone","outswindle competitors"],"synonyms":["defraud","cheat","dupe","deceive","hoodwink","trick"],"antonyms":["protect","guard","defend"]}],"etymology":{"value":"The word 'outswindle' is formed by adding the prefix 'out-' to the verb 'swindle.' The prefix 'out-' means 'more than' or 'to surpass.' 'Swindle' itself comes from German 'schwindeln,' meaning 'to be giddy, to act dishonestly.'","priority":"★★★"},"pronunciation":{"ipa":"/ˌaʊtˈswɪndəld/","syllables":"out-swin-dled"},"inflection":{"verb_forms":{"present_simple":["outswindle","outswindles"],"past_simple":"outswindled","past_participle":"outswindled","present_participle":"outswindling"}},"usage_notes":{"explanation":"'Outswindle' implies a competitive aspect to the act of swindling. It suggests that someone has not only been swindled but has been swindled to a greater extent or with more skill than they would have swindled others. It is often used to emphasize the cleverness or ruthlessness of the swindler.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He outswindled at the casino.","correct":"✓ He outswindled the other players at the casino.","note":"'Outswindle' requires a direct object, indicating who was swindled. It is not simply about swindling in a general sense, but about swindling someone more effectively than they swindle others."}],"priority":"★★☆"},"related_words":{"derivatives":["outswindling (noun/adjective)"],"phrasal_verbs":[],"related_verbs":["swindle"],"related_nouns":["swindler","swindle"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Outswindled' is a relatively rare and sophisticated word. It means to have been swindled to a greater degree than one would swindle others. The word implies a competitive or comparative aspect to the act of swindling, suggesting that the swindler was more skilled or ruthless than the victim. This word is more likely to be encountered in literature or formal writing about crime or deception."},"example_sentences":[{"sentence":"The experienced con artist outswindled the naive investor, leaving him penniless.","translation":"経験豊富な詐欺師は、世間知らずの投資家を出し抜いて騙し、一文無しにした。","type":"verb","meaning_category":"詐欺"},{"sentence":"She outswindled her business partner by manipulating the financial records.","translation":"彼女は会計記録を操作してビジネスパートナーを出し抜いて騙した。","type":"verb","meaning_category":"詐欺"},{"sentence":"The scammer outswindled several elderly people before being caught by the authorities.","translation":"その詐欺師は当局に捕まる前に、数人の高齢者から出し抜いて騙し取った。","type":"verb","meaning_category":"詐欺"}]}