{"word":"Limewood","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"菩提樹の木、またはその木材","english_definition":"The wood of the linden tree, also known as basswood in North America. It is a fine-grained, light-colored wood that is easy to carve.","examples":[{"sentence":"The sculptor used limewood to create the delicate details of the statue.","translation":"彫刻家は菩提樹の木を使って、彫像の繊細な細部を作り上げた。"},{"sentence":"Limewood is a popular choice for carving because it is soft and easy to work with.","translation":"菩提樹の木は柔らかく加工しやすいので、彫刻によく使われる。"}],"collocations":["limewood carving","limewood sculpture","fine-grained limewood","light limewood"],"synonyms":["basswood (North America)","linden wood"],"antonyms":[]}],"etymology":{"value":"Derived from 'lime' (referring to the linden tree, unrelated to the citrus fruit) and 'wood'. The name 'lime' for the tree comes from the Old English word 'lind', also referring to the linden tree.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlaɪm.wʊd/","syllables":"Lime-wood"},"inflection":{"noun_plural":"Limewoods"},"usage_notes":{"explanation":"'Limewood' refers specifically to the wood from the linden tree (Tilia species). In North America, the same wood is often called 'basswood'. It's valued for its smooth texture, light color, and ease of carving, making it a favorite among woodcarvers.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used lime wood for my project.","correct":"✓ I used limewood for my project.","note":"'Limewood' is one word when referring to the specific type of wood. Using 'lime wood' as two separate words might be confusing. It could imply wood that is lime green in color or wood treated with lime. "},{"incorrect":"✗ Is limewood a hardwood or a softwood?","correct":"✓ Limewood is a softwood.","note":"Limewood is a softwood, so it's incorrect to classify it as a hardwood."}],"priority":"★★☆"},"related_words":{"derivatives":["linden (tree)","basswood (North American synonym)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Limewood' is a specialized term referring to a specific type of wood known for its fine grain and suitability for carving. It's most likely to be encountered in contexts related to woodworking, sculpture, or historical artifacts. The term is relatively uncommon in everyday conversation, but understanding its meaning is useful for those interested in crafts or art history."},"example_sentences":[{"sentence":"The antique altarpiece was crafted from beautifully preserved limewood.","translation":"そのアンティークの祭壇衝立は、美しく保存された菩提樹の木で作られていた。","type":"noun","meaning_category":"material"},{"sentence":"He prefers limewood for his sculptures because of its smooth, even texture.","translation":"彼は彫刻に菩提樹の木を好む。なぜなら、その滑らかで均一な質感が好きだからだ。","type":"noun","meaning_category":"material"},{"sentence":"The model airplanes were made of lightweight limewood.","translation":"その模型飛行機は軽量な菩提樹の木で作られていた。","type":"noun","meaning_category":"material"}]}