{"word":"nonathlete","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"運動選手ではない人、スポーツをしない人","english_definition":"A person who does not participate in sports or athletic activities, or who is not considered to be athletic.","examples":[{"sentence":"The event was designed to attract both athletes and nonathletes.","translation":"そのイベントは、運動選手とそうでない人の両方を引きつけるように企画された。"},{"sentence":"As a nonathlete, I found the sports documentary surprisingly engaging.","translation":"運動選手ではない私にとって、そのスポーツドキュメンタリーは意外にも面白かった。"},{"sentence":"The survey compared the health habits of athletes and nonathletes.","translation":"その調査では、運動選手とそうでない人の健康習慣が比較された。"}],"collocations":["athlete and nonathlete (運動選手と非運動選手)","nonathlete population (非運動選手層)","former athlete to nonathlete (元運動選手から非運動選手へ)"],"synonyms":["non-sportsperson","average person","layperson"],"antonyms":["athlete","sportsperson","jock"],"related_terms":["sedentary","inactive","fitness","exercise"]}],"etymology":{"value":"\"non-\" (否定の接頭辞) + \"athlete\" (運動選手)","priority":"★★★"},"pronunciation":{"ipa":"/nɒnˈæθliːt/","syllables":"non-ath-lete"},"inflection":{"noun_plural":"nonathletes"},"usage_notes":{"explanation":"\"Nonathlete\" is a straightforward term used to describe someone who is not an athlete. It is often used in contrast to \"athlete\" in studies, discussions, or events that involve comparing or distinguishing between people who actively participate in sports and those who do not. The term is generally neutral and does not carry any negative connotations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a non-athlete person.","correct":"✓ He is a nonathlete. / ✓ He is not an athlete.","note":"\"Nonathlete\" is already a noun, so adding \"person\" is redundant. It's better to simply say \"He is a nonathlete\" or \"He is not an athlete.\""},{"incorrect":"✗ She is very nonathlete.","correct":"✓ She is not very athletic.","note":"\"Nonathlete\" is a noun, not an adjective. To describe someone as not athletic, use \"not athletic\" or \"not very athletic\"."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["athletic","athleticism","sports","exercise","fitness"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word \"nonathlete\" is relatively straightforward. It simply means someone who is not an athlete. It is commonly used in contexts where a distinction is being made between people who participate in sports and those who do not, such as in research studies or when discussing the benefits of exercise for different groups of people. While the word itself is not complex, understanding its usage may require some familiarity with the concept of athleticism and the role of sports in society."},"example_sentences":[{"sentence":"The study compared the cardiovascular health of athletes and nonathletes.","translation":"その研究では、運動選手と非運動選手の心血管の健康状態が比較された。","type":"general","meaning_category":"general"},{"sentence":"Many nonathletes find it difficult to start an exercise routine.","translation":"多くの非運動選手は、運動習慣を始めるのが難しいと感じている。","type":"general","meaning_category":"general"},{"sentence":"The program aims to encourage nonathletes to become more physically active.","translation":"そのプログラムは、非運動選手がより積極的に運動するように促すことを目的としている。","type":"general","meaning_category":"general"}]}