{"word":"metaphoricalness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"比喩性、隠喩性","english_definition":"The quality or state of being metaphorical; the extent to which something is expressed using metaphors.","examples":[{"sentence":"The metaphoricalness of his poetry made it difficult to understand at first.","translation":"彼の詩の比喩性は、最初は理解を難しくした。"},{"sentence":"The metaphoricalness in her writing added depth and richness to the story.","translation":"彼女の文章における比喩性は、物語に深みと豊かさを加えた。"}],"collocations":["high degree of metaphoricalness","increase in metaphoricalness","literary metaphoricalness"],"synonyms":["figurative language","symbolism","allegory","imagery"],"antonyms":["literalness","directness","plainness"]}],"etymology":{"value":"Formed from 'metaphorical' + '-ness'. 'Metaphorical' comes from 'metaphor', which originates from the Greek word 'metaphora' (μεταφορά), meaning 'a transfer' or 'carrying over'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɛtəˈfɔːrɪkəlnəs/","syllables":"met-a-phor-i-cal-ness"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Metaphoricalness' refers to the degree to which something employs or exhibits metaphors. It is often used in literary criticism, analysis of rhetoric, and discussions of figurative language. It describes the characteristic of using metaphors to convey meaning beyond the literal interpretation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The metaphoricalness is high in this book, so it's hard to understand.","correct":"✓ The degree of metaphoricalness is high in this book, so it's hard to understand.","note":"It is more common to specify the *degree* or *level* of metaphoricalness rather than using 'metaphoricalness' as a direct subject."}],"priority":"★★☆"},"related_words":{"derivatives":["metaphorical (adjective)","metaphor (noun)"],"phrases":["metaphorical language","figurative language"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Metaphoricalness' is a relatively advanced term used to describe the extent to which something uses metaphors or figurative language. It's commonly encountered in literary analysis or discussions about rhetoric, where the use of non-literal expressions is examined. Understanding this term requires familiarity with the concept of metaphor itself and the ability to recognize its presence in various forms of communication."},"example_sentences":[{"sentence":"The metaphoricalness of the poem made it open to multiple interpretations.","translation":"その詩の比喩性は、複数の解釈を可能にした。","type":"general","meaning_category":"比喩性"},{"sentence":"Critics often comment on the high metaphoricalness of Shakespeare's plays.","translation":"批評家はしばしばシェイクスピアの劇の高度な比喩性についてコメントする。","type":"literary analysis","meaning_category":"比喩性"},{"sentence":"The metaphoricalness of his speech obscured the real message he was trying to convey.","translation":"彼のスピーチの比喩性は、彼が伝えようとしていた本当のメッセージを曖昧にした。","type":"general","meaning_category":"比喩性"}]}