{"word":"unecstatic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"有頂天でない、狂喜していない、非常に喜んでいない","english_definition":"not ecstatic; not feeling or expressing overwhelming happiness or joy.","examples":[{"sentence":"She was unecstatic about the news, but pleased nonetheless.","translation":"彼女はその知らせに有頂天ではなかったが、それでも喜んでいた。"},{"sentence":"His response was unecstatic, suggesting he had expected the outcome.","translation":"彼の反応は狂喜しているというものではなく、その結果を予想していたことを示唆していた。"},{"sentence":"While the team won, the coach remained unecstatic, already focused on the next game.","translation":"チームは勝ったが、コーチはすでに次の試合に集中しており、有頂天になることはなかった。"}],"collocations":["remain unecstatic","seem unecstatic","appear unecstatic","unecstatic response","unecstatic reaction","unecstatic about"],"synonyms":["not thrilled","not overjoyed","not delighted","not ecstatic","not rapturous","displeased","indifferent","apathetic"],"antonyms":["ecstatic","overjoyed","thrilled","delighted","rapturous","elated","enthusiastic"]}],"etymology":{"value":"接頭辞 un- (否定) + ecstatic (有頂天の、狂喜した)","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnɪkˈstætɪk/","syllables":"un-ec-stat-ic"},"inflection":{"adjective_forms":{"comparative":"more unecstatic","superlative":"most unecstatic"}},"usage_notes":{"explanation":"\"**unecstatic**\" は、何かに非常に興奮したり、非常に喜んだりしていない状態を表すために使用されます。これは、必ずしも不満や不幸を意味するわけではなく、単に極端な喜びの欠如を示唆します。より一般的な類義語には、\"not thrilled\"、\"not overjoyed\" などがあります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She was unecstatic because she was very sad.","correct":"✓ She was unecstatic, though not necessarily sad.","note":"\"unecstatic\" は悲しみを意味するのではなく、単に極端な喜びの欠如を意味します。"},{"incorrect":"✗ The team was unecstatic, but they celebrated loudly.","correct":"✓ The team was unecstatic, but they still celebrated.","note":"\"unecstatic\" は喜びの表現がないことを意味しますが、お祝いをしないという意味ではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":["unecstatically"],"related_adjectives":["ecstatic"],"related_nouns":["ecstasy"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"**Unecstatic**\" is a less common word used to describe a lack of extreme joy or excitement. It suggests a state of being not particularly thrilled or overjoyed about something. It is often used to imply a more subdued or reserved reaction, rather than outright unhappiness or displeasure. The word is formed by adding the prefix \"un-\" to \"ecstatic,\" which means extremely happy or excited. Understanding the meaning of \"ecstatic\" helps in grasping the meaning of \"unecstatic.\" This word is more likely to be encountered in formal writing or sophisticated conversations."},"example_sentences":[{"sentence":"Despite receiving a promotion, John seemed unecstatic, perhaps because it came with additional responsibilities.","translation":"昇進したにもかかわらず、ジョンは有頂天には見えなかった。おそらく、それは追加の責任を伴うからだろう。","type":"adjective","meaning_category":"喜びの欠如"},{"sentence":"The critic's review was unecstatic but fair, acknowledging both the strengths and weaknesses of the performance.","translation":"批評家のレビューは有頂天ではなかったが公正で、パフォーマンスの長所と短所の両方を認めていた。","type":"adjective","meaning_category":"喜びの欠如"},{"sentence":"After winning the local competition, the team was unecstatic, saving their enthusiasm for the national championships.","translation":"地方大会で優勝した後、チームは有頂天になることはなく、全国選手権のために熱意を温存していた。","type":"adjective","meaning_category":"喜びの欠如"}]}