{"word":"Lapsibility","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The quality or state of being lapsible; the tendency to lapse or expire.","english_definition":"The quality or state of being lapsible; the tendency to lapse or expire.","examples":[{"sentence":"The lapsibility of the insurance policy meant that it would expire if not renewed.","translation":"その保険契約の失効性により、更新されなければ失効することになる。"},{"sentence":"Due to the lapsibility of the offer, we had to act quickly.","translation":"オファーの失効性のため、迅速に行動する必要があった。"}],"collocations":["policy lapsibility","offer lapsibility","contract lapsibility"],"synonyms":["expiration","invalidity","termination","voidability"],"antonyms":["validity","permanence","indefiniteness"]}],"etymology":{"value":"Derived from \"lapsible,\" which comes from the Latin word \"lapsus,\" meaning \"a slip, fall, error.\" The suffix \"-ility\" denotes a state or quality.","priority":"★★★"},"pronunciation":{"ipa":"/ˌlæpsəˈbɪləti/","syllables":"lap-si-bil-i-ty"},"inflection":{"noun_plural":"lapsibilities"},"usage_notes":{"explanation":"\"Lapsibility\" refers to the characteristic of something being able to lapse or expire. It is often used in legal or contractual contexts to describe the condition under which an agreement or right can become invalid if certain conditions are not met, such as timely renewal or fulfillment of obligations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lapsibility of the decision was immediate.","correct":"✓ The decision's lapsibility was immediate.","note":"The possessive form is more appropriate to show that the decision possesses the quality of lapsibility."},{"incorrect":"✗ The lapsibility was happened to the contract.","correct":"✓ The lapsibility applied to the contract.","note":"Use 'applied to' or 'affected' to show that the lapsibility is a characteristic of the contract."}],"priority":"★★★"},"related_words":{"derivatives":["lapsible","lapse"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Lapsibility\" is a formal term indicating the potential for something to expire or become invalid. It's often used in legal or contractual contexts to describe the condition under which an agreement or right can become invalid if certain conditions are not met. Understanding this term is useful in interpreting contracts and legal documents where expiration clauses are present."},"example_sentences":[{"sentence":"The **lapsibility** of the patent meant that competitors could freely use the technology after a certain date.","translation":"その特許の失効性により、競合他社は特定の日付以降、その技術を自由に使用できるようになった。","type":"noun","meaning_category":"expiration"},{"sentence":"Due to the **lapsibility** clause in the contract, the agreement was no longer valid after the deadline.","translation":"契約の失効条項により、合意は期限を過ぎると無効になった。","type":"noun","meaning_category":"invalidity"}]}