{"word":"jargonist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"専門用語を多用する人、専門用語ばかり使う人","english_definition":"A person who uses jargon, especially excessively or affectedly.","examples":[{"sentence":"The presentation was difficult to follow because the speaker was a jargonist.","translation":"発表者が専門用語ばかり使う人だったので、プレゼンテーションは理解するのが難しかった。"},{"sentence":"He's such a jargonist; I can never understand what he's talking about.","translation":"彼は専門用語ばかり使うから、彼が何を言っているのか決して理解できない。"}],"collocations":["technical jargonist","legal jargonist","medical jargonist"],"synonyms":["technical speaker","specialist","expert (with negative connotation)"],"antonyms":["layman","non-specialist"]}],"etymology":{"value":"The word 'jargonist' is derived from 'jargon' (specialized or technical language) with the suffix '-ist' (a person who does or is skilled in something).","priority":"★★★"},"pronunciation":{"ipa":"/ˈdʒɑːrɡənɪst/","syllables":"jar-gon-ist"},"inflection":{"noun_plural":"jargonists"},"usage_notes":{"explanation":"'Jargonist' is often used in a pejorative sense, implying that the person uses jargon to impress others or to obscure the meaning of what they are saying. It suggests that the speaker is more concerned with using technical language than with communicating effectively.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a jargonistic speaker.","correct":"✓ He is a jargonist.","note":"'Jargonistic' is an adjective describing something characterized by jargon, whereas 'jargonist' is the noun referring to the person who uses jargon."}],"priority":"★★☆"},"related_words":{"derivatives":["jargon (noun)","jargonistic (adjective)"],"phrases":["use jargon","speak in jargon"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'jargonist' is a relatively uncommon word used to describe someone who excessively uses jargon, which is specialized or technical language. It often carries a negative connotation, suggesting that the person is using jargon to confuse or impress rather than to communicate clearly. This word is more likely to be found in advanced texts or discussions about communication and language use."},"example_sentences":[{"sentence":"The professor was criticized for being a jargonist, making his lectures inaccessible to undergraduates.","translation":"その教授は専門用語ばかり使う人だと批判され、彼の講義は学部生には理解しにくかった。","type":"general","meaning_category":"general"},{"sentence":"As a jargonist, he often alienated his audience with overly complex terminology.","translation":"専門用語ばかり使う人として、彼はしばしば過度に複雑な専門用語で聴衆を遠ざけた。","type":"general","meaning_category":"general"}]}