{"word":"Surrenderee","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"降伏者、降伏を受け入れる者","english_definition":"A person to whom something is surrendered; the recipient of a surrender.","examples":[{"sentence":"The general was the surrenderee when the enemy troops laid down their arms.","translation":"敵軍が武器を置いたとき、将軍は降伏を受け入れる者だった。"},{"sentence":"As the surrenderee, she had the responsibility to ensure the prisoners of war were treated humanely.","translation":"降伏を受け入れる者として、彼女には戦争捕虜が人道的に扱われるようにする責任があった。"}],"collocations":["act as surrenderee","become the surrenderee","designated surrenderee"],"synonyms":["recipient","acceptor","receiver"],"antonyms":["surrenderer"]}],"etymology":{"value":"Formed from 'surrender' + '-ee'. The suffix '-ee' indicates the person who receives the action of the verb.","priority":"★★☆"},"pronunciation":{"ipa":"/səˌrɛndəˈriː/","syllables":"sur-ren-de-ree"},"inflection":{"noun_plural":"surrenderees"},"usage_notes":{"explanation":"'Surrenderee' refers to the individual or entity that receives the act of surrender. It is relatively uncommon in everyday language and is more frequently used in legal or military contexts. It's important to distinguish it from 'surrenderer', which is the person who is surrendering.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The surrenderee was captured by the enemy.","correct":"✓ The surrenderer was captured by the enemy.","note":"'Surrenderee' is the one receiving the surrender, not the one surrendering. Use 'surrenderer' to refer to the person giving up."},{"incorrect":"✗ The surrenderee gave back the weapons.","correct":"✓ The surrenderee received the weapons.","note":"The surrenderee receives what is being surrendered. 'Gave back' implies they were returning something they already had."}],"priority":"★★☆"},"related_words":{"derivatives":["surrender (verb, noun)","surrenderer (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"surrenderee\" is a formal term that refers to the person or party who receives the surrender from another party. It is mainly used in legal or military contexts. The word is not commonly used in everyday conversation. It's important to differentiate it from \"surrenderer,\" which refers to the person or party who is surrendering.","priority":"★☆☆"},"example_sentences":[{"sentence":"The commanding officer acted as the **surrenderee** during the formal ceremony.","translation":"指揮官は正式な式典で降伏を受け入れる者として行動した。","type":"noun","meaning_category":"降伏を受け入れる者"},{"sentence":"As the designated **surrenderee**, the diplomat was responsible for negotiating the terms of peace.","translation":"指名された降伏を受け入れる者として、外交官は和平条件を交渉する責任があった。","type":"noun","meaning_category":"降伏を受け入れる者"}]}