{"word":"toyishness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"おもちゃのような性質、子供じみたこと、おもちゃっぽさ","english_definition":"The quality of being toyish; resembling a toy, frivolous, or childish behavior.","examples":[{"sentence":"The toyishness of the design made it unsuitable for serious applications.","translation":"そのデザインのおもちゃっぽさが、真面目な用途には不向きにしていた。"},{"sentence":"He was criticized for the toyishness of his approach to the problem.","translation":"彼はその問題への取り組み方が子供じみていると批判された。"},{"sentence":"Despite its toyishness, the product proved surprisingly popular.","translation":"そのおもちゃっぽさにもかかわらず、その製品は驚くほど人気があることがわかった。"}],"collocations":["toyishness of design","toyishness of behavior","inherent toyishness"],"synonyms":["frivolity","childishness","playfulness","silliness","triviality","superficiality"],"antonyms":["seriousness","solemnity","gravity","earnestness"]}],"etymology":{"value":"Derived from 'toyish' (resembling a toy) + '-ness' (suffix indicating a state or quality).","priority":"★★★"},"pronunciation":{"ipa":"/ˈtɔɪɪʃnəs/","syllables":"toy-ish-ness"},"inflection":{"noun_plural":"toyishnesses (rarely used)"},"usage_notes":{"explanation":"'Toyishness' refers to the quality or state of being toyish, which implies something that resembles a toy, is frivolous, or exhibits childish behavior. It is often used in a derogatory sense to describe something that lacks seriousness or is overly simplistic.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The toyishness are evident in the product.","correct":"✓ The toyishness is evident in the product.","note":"'Toyishness' is an uncountable noun, so it takes a singular verb."},{"incorrect":"✗ He showed a lot of toyishness.","correct":"✓ He showed a lot of childishness/frivolity.","note":"While grammatically correct, using 'childishness' or 'frivolity' might be more common and natural-sounding in many contexts."}],"priority":"★★☆"},"related_words":{"derivatives":["toyish (adjective)","toy (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (not commonly found in standard CEFR vocabulary lists)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Toyishness' is a relatively uncommon word that describes the quality of something being like a toy, frivolous, or childish. It implies a lack of seriousness or depth. You might encounter this word in discussions about design, art, or behavior where the speaker wants to criticize something for being too simple or unserious."},"example_sentences":[{"sentence":"The critic noted the toyishness of the film's plot, finding it lacking in substance.","translation":"批評家は、映画のプロットのおもちゃっぽさを指摘し、内容に欠けていると判断した。","type":"general","meaning_category":"おもちゃのような性質"},{"sentence":"Her colleagues often teased her about the toyishness of her office decorations.","translation":"彼女の同僚は、彼女のオフィスの装飾のおもちゃっぽさについてよくからかった。","type":"general","meaning_category":"おもちゃのような性質"},{"sentence":"The toyishness of his arguments undermined his credibility.","translation":"彼の議論のおもちゃっぽさが、彼の信頼性を損なった。","type":"general","meaning_category":"子供じみたこと"}]}