{"word":"Herod","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ヘロデ (古代ユダヤの王の名)","english_definition":"A dynastic name, notably of several rulers of Judea in antiquity, particularly Herod the Great, known for his role in the New Testament.","examples":[{"sentence":"Herod the Great ordered the Massacre of the Innocents.","translation":"ヘロデ大王は罪のない人々の虐殺を命じた。"},{"sentence":"The New Testament mentions Herod Antipas.","translation":"新約聖書にはヘロデ・アンティパスについて言及されている。"}],"collocations":["Herod the Great","Herod Antipas","Herod Agrippa"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From the Greek Ἡρῴδης (Hērōdēs), a dynastic name of several rulers of Judea.","priority":"★★★"},"pronunciation":{"ipa":"/ˈhɛrəd/","syllables":"Her-od"},"inflection":{"notes":"Proper noun; plural form is Herods (referring to multiple individuals named Herod)."},"usage_notes":{"explanation":"'Herod' is primarily a historical name, referring to a series of rulers in Judea during the Roman period. The most well-known is Herod the Great, who reigned at the time of Jesus's birth and is associated with the biblical story of the Massacre of the Innocents. Mentions of Herod typically appear in historical or religious contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a hero like Herod.","correct":"✓ He was a hero, but not like Herod.","note":"Herod is generally viewed negatively in religious contexts, so comparing someone positively to Herod would be a mistake."}],"priority":"★★☆"},"related_words":{"derivatives":["Herodian (adjective: relating to Herod or his dynasty; noun: a supporter of Herod)"],"phrases":["Massacre of the Innocents (an event associated with Herod the Great)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Proper noun, historical figure)","frequency_google_ngram":"Relatively infrequent, primarily in historical or religious texts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The name 'Herod' is most often encountered in religious or historical texts, particularly those relating to the Roman period in Judea and the New Testament. Understanding the historical context and the negative connotations often associated with Herod is important for interpreting texts where this name appears."},"example_sentences":[{"sentence":"The reign of Herod the Great was marked by both significant construction projects and ruthless actions.","translation":"ヘロデ大王の治世は、重要な建設事業と冷酷な行動の両方によって特徴づけられた。","type":"historical context","meaning_category":"historical figure"},{"sentence":"The Gospels describe Herod's reaction to the news of Jesus's birth.","translation":"福音書は、イエスの誕生の知らせに対するヘロデの反応を描写している。","type":"religious context","meaning_category":"religious figure"}]}