{"word":"color-washed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(of a surface) having a thin, translucent layer of color applied to it, often to create a textured or aged effect.","english_definition":"Having a thin, translucent layer of color applied to a surface, typically to create a textured or aged appearance.","examples":[{"sentence":"The walls were color-washed in a soft shade of blue.","translation":"壁は薄い青色でカラーウォッシュされていた。"},{"sentence":"She used a color-washed technique to give the furniture a vintage look.","translation":"彼女は家具にヴィンテージ感を与えるためにカラーウォッシュの技法を使った。"}],"collocations":["color-washed walls","color-washed furniture","color-washed effect","color-washed finish"],"synonyms":["tinted","glazed","washed","stained"],"antonyms":["plain","uncolored","untreated"]}],"etymology":{"value":"Derived from the verb phrase \"color wash,\" which combines \"color\" (referring to hue or pigment) and \"wash\" (referring to a thin liquid application).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkʌlərˌwɒʃt/","syllables":"col-or-washed"},"inflection":{"notes":"The word 'color-washed' is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Color-washed' describes a surface treatment technique where a thin, often translucent, layer of paint or glaze is applied to create a subtle color effect, often with texture. It's commonly used in interior design to give walls or furniture an aged or softened appearance. The term implies a less uniform and more artistic application of color than simply painting a surface.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I color-washed the walls with a brush.","correct":"✓ I color-washed the walls. / ✓ I applied a color wash to the walls.","note":"'Color-washed' is an adjective describing the state of the walls. To describe the action, use 'apply a color wash' or 'color wash' as a verb."}],"priority":"★★☆"},"related_words":{"derivatives":["color wash (noun: the technique itself; verb: to apply the technique)"],"phrasal_verbs":[],"related_terms":["faux finish","glazing","antiquing","distressing"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - specialized vocabulary related to interior design and decorative painting.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Color-washed' is a term used in interior design and decorative arts to describe a surface that has been treated with a thin, translucent layer of color. This technique is often used to create a textured or aged appearance. The term is relatively specialized and may not be familiar to those outside of design-related fields. Understanding the term requires familiarity with decorative painting techniques and an understanding of how thin layers of color can affect the appearance of a surface."},"example_sentences":[{"sentence":"The designer chose a color-washed finish for the kitchen cabinets to complement the rustic decor.","translation":"デザイナーは、素朴な内装を引き立てるために、キッチンキャビネットにカラーウォッシュ仕上げを選んだ。","type":"adjective","meaning_category":"describing surface finish"},{"sentence":"The color-washed walls gave the room a soft, inviting ambiance.","translation":"カラーウォッシュされた壁は、部屋に柔らかく、魅力的な雰囲気を与えた。","type":"adjective","meaning_category":"describing room ambiance"}]}