{"word":"transcosmic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"宇宙を超越した、宇宙の範囲を超えた","english_definition":"Extending beyond or transcending the cosmos; beyond the limits of the universe.","examples":[{"sentence":"The philosopher explored transcosmic realms of existence.","translation":"その哲学者は、宇宙を超越した存在の領域を探求した。"},{"sentence":"The artist's vision was transcosmic, depicting realities beyond human comprehension.","translation":"その芸術家のビジョンは宇宙を超越しており、人間の理解を超えた現実を描いていた。"}],"collocations":["transcosmic consciousness","transcosmic reality","transcosmic journey","transcosmic perspective"],"synonyms":["extracosmic","supercosmic","metacosmic","transuniversal"],"antonyms":["intracosmic","cosmic","universal"]}],"etymology":{"value":"'trans-' (beyond) + 'cosmic' (relating to the cosmos or universe).","priority":"★★☆"},"pronunciation":{"ipa":"/trænsˈkɒzmɪk/","syllables":"trans-cos-mic"},"inflection":{"notes":"Adjective, so it has comparative and superlative forms (more transcosmic, most transcosmic), though they are rarely used."},"usage_notes":{"explanation":"'Transcosmic' is a relatively rare term, often used in philosophical, spiritual, or science fiction contexts to describe concepts or entities that exist outside or beyond the physical universe as we know it. It suggests a reality that is not bound by the laws and limitations of our cosmos.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The transcosmic energy is easily understood.","correct":"✓ The transcosmic energy is beyond human understanding.","note":"'Transcosmic' implies something beyond the normal understanding of the universe, so it's usually not easily understood."}],"priority":"★☆☆"},"related_words":{"derivatives":["transcosmically (adverb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Transcosmic' is a high-level word that describes something beyond the universe. It's often used in philosophical or science fiction contexts. Because it's a rare and abstract term, it's best suited for advanced learners who are comfortable with complex ideas."},"example_sentences":[{"sentence":"The mystic sought enlightenment through transcosmic meditation.","translation":"その神秘家は、宇宙を超越した瞑想を通して悟りを求めた。","type":"adjective","meaning_category":"beyond the universe"},{"sentence":"Her paintings depicted transcosmic landscapes filled with unimaginable forms.","translation":"彼女の絵画は、想像を絶する形で満たされた宇宙を超越した風景を描いていた。","type":"adjective","meaning_category":"beyond the universe"}]}