{"word":"technology-inclusive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"技術包摂的な、技術を包含する、技術を考慮に入れた","english_definition":"Designed or implemented in a way that considers and includes a wide range of technologies, ensuring accessibility and usability for diverse users and contexts.","examples":[{"sentence":"The new educational program is designed to be technology-inclusive, incorporating both digital and traditional learning methods.","translation":"その新しい教育プログラムは技術包摂的になるように設計されており、デジタル学習と伝統的な学習方法の両方を取り入れています。"},{"sentence":"A technology-inclusive approach ensures that solutions are adaptable to different technological infrastructures.","translation":"技術包摂的なアプローチは、ソリューションがさまざまな技術インフラストラクチャに適応可能であることを保証します。"},{"sentence":"The city's smart initiatives aim to be technology-inclusive, catering to residents with varying levels of digital literacy.","translation":"その都市のスマートイニシアチブは、さまざまなレベルのデジタルリテラシーを持つ住民に対応するため、技術包摂的であることを目指しています。"}],"collocations":["technology-inclusive design (技術包摂的な設計)","technology-inclusive education (技術包摂的な教育)","technology-inclusive solutions (技術包摂的なソリューション)","technology-inclusive policies (技術包摂的な政策)","technology-inclusive strategies (技術包摂的な戦略)"],"synonyms":["technology-embracing","technology-integrated","technology-adaptive","technology-sensitive","technology-aware"],"antonyms":["technology-exclusive","technology-limited","technology-restrictive"]},{"part_of_speech":"adjective","definition":"あらゆる技術レベルの人が利用しやすいように設計された","english_definition":"Designed to be accessible and usable by people of all technological skill levels.","examples":[{"sentence":"The app's user interface is technology-inclusive, making it easy for both beginners and experts to navigate.","translation":"そのアプリのユーザーインターフェースは技術包摂的であり、初心者と専門家の両方が簡単に操作できます。"},{"sentence":"The training program promotes a technology-inclusive environment where everyone feels comfortable using new tools.","translation":"そのトレーニングプログラムは、誰もが新しいツールを快適に使用できる技術包摂的な環境を推進しています。"},{"sentence":"The company strives to create technology-inclusive products that are intuitive and require minimal technical knowledge.","translation":"その会社は、直感的で最小限の技術知識しか必要としない技術包摂的な製品を作るよう努めています。"}],"collocations":["technology-inclusive interface (技術包摂的なインターフェース)","technology-inclusive training (技術包摂的なトレーニング)","technology-inclusive environment (技術包摂的な環境)","technology-inclusive products (技術包摂的な製品)","technology-inclusive design (技術包摂的な設計)"],"synonyms":["user-friendly","accessible","intuitive","easy-to-use","inclusive","universal"],"antonyms":["complex","difficult","exclusive","technical"]}],"etymology":{"value":"The term 'technology-inclusive' is formed by combining 'technology' (the application of scientific knowledge for practical purposes) with 'inclusive' (not excluding any section of society or any party involved in something).","priority":"☆☆☆"},"pronunciation":{"ipa":"/tɛkˈnɒlədʒi ɪnˈkluːsɪv/","syllables":"tech-nol-o-gy in-clu-sive"},"inflection":{"notes":"This is an adjective, so it does not have different forms for tense or number."},"usage_notes":{"explanation":"'Technology-inclusive' is used to describe systems, policies, or designs that are created to be accessible and beneficial to a wide range of users, regardless of their technological capabilities or the specific technologies they use. It emphasizes the importance of considering diverse technological contexts and skill levels to ensure that technology serves everyone effectively.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"The policy is technology-inclusive, so everyone must use the latest gadgets.","correct":"The policy is technology-inclusive, so it supports various devices and skill levels.","note":"A technology-inclusive policy should not mandate the use of specific technologies but rather accommodate a range of options."},{"incorrect":"Technology-inclusive means only using the most advanced technology.","correct":"Technology-inclusive means considering a wide range of technologies, including older and simpler ones.","note":"Technology-inclusive is about breadth and accessibility, not just cutting-edge technology."}],"priority":"☆☆☆"},"related_words":{"derivatives":["inclusivity (名詞: 包括性)","inclusion (名詞: 包括)"],"related_terms":["assistive technology (支援技術)","universal design (ユニバーサルデザイン)","digital divide (デジタルデバイド)","accessibility (アクセシビリティ)"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Technology-inclusive' means that something is designed or implemented in a way that considers and includes a wide range of technologies, ensuring it is accessible and usable for diverse users and contexts. It emphasizes that technology should be available and easy to use for everyone, regardless of their skill level or the specific technology they use. This term is often used in discussions about education, policy, and product design to promote fairness and accessibility in the digital age."},"example_sentences":[{"sentence":"The company's technology-inclusive approach to software development ensures that their products work well on both new and old devices.","translation":"その会社のソフトウェア開発における技術包摂的なアプローチにより、同社の製品は新旧両方のデバイスでうまく動作することが保証されています。","type":"adjective","meaning_category":"技術を包含する"},{"sentence":"A technology-inclusive curriculum provides students with the skills they need to succeed in a rapidly changing world.","translation":"技術包摂的なカリキュラムは、急速に変化する世界で成功するために必要なスキルを学生に提供します。","type":"adjective","meaning_category":"技術を考慮に入れた"},{"sentence":"The government's technology-inclusive policies aim to bridge the digital divide and provide equal access to information and services.","translation":"政府の技術包摂的な政策は、デジタルデバイドを解消し、情報とサービスへの平等なアクセスを提供することを目指しています。","type":"adjective","meaning_category":"技術を包含する"}]}