{"word":"hypergol","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(化学)ハイパーゴル：混合すると点火を必要とせずに自然発火する推進剤の組み合わせ","english_definition":"(chemistry) A combination of propellant components which spontaneously ignite on contact with each other, requiring no ignition source.","examples":[{"sentence":"The rocket used hypergols as its propellant.","translation":"そのロケットは推進剤としてハイパーゴルを使用した。"},{"sentence":"Hypergolic fuels are often used in spacecraft for their reliability.","translation":"ハイパーゴル燃料は、その信頼性の高さから宇宙船によく使用される。"}],"collocations":["hypergolic propellant","hypergolic fuel","self-igniting propellant"],"synonyms":["self-igniting propellant","spontaneously igniting fuel"],"antonyms":[],"related_terms":["monomethylhydrazine (MMH)","unsymmetrical dimethylhydrazine (UDMH)","nitrogen tetroxide (NTO)"]}],"etymology":{"value":"Derived from the Greek words 'hyper' (beyond, above) and 'ergon' (work), suggesting that the propellant goes beyond the need for external work (ignition).","priority":"★★☆"},"pronunciation":{"ipa":"ˈhaɪpərˌɡɔl","syllables":"hy-per-gol"},"inflection":{"noun_plural":"hypergols"},"usage_notes":{"explanation":"Hypergols are primarily used in rocketry and space applications due to their reliability and ability to ignite without an external ignition source. This is crucial for in-space maneuvers where reignition is necessary. Common hypergolic combinations include monomethylhydrazine (MMH) or unsymmetrical dimethylhydrazine (UDMH) as fuel, and nitrogen tetroxide (NTO) as oxidizer. These substances are highly toxic and corrosive, requiring careful handling.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The hypergolic fuel is safe to handle.","correct":"✓ The hypergolic fuel requires extreme caution when handling.","note":"Hypergolic fuels are highly toxic and corrosive, so safety is paramount."}],"priority":"★☆☆"},"related_words":{"derivatives":["hypergolic (adjective)"],"related_scientific_terms":["propellant","oxidizer","fuel","rocket engine","combustion"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in technical contexts related to rocketry and chemistry.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'hypergol' is a specialized term primarily used in the context of rocketry and chemistry. It refers to a combination of fuel and oxidizer that spontaneously ignite upon contact, making them useful in rocket engines where reliable ignition is critical. The concept requires an understanding of chemical properties and rocket propulsion systems. Therefore, it is typically encountered in advanced scientific or engineering contexts."},"example_sentences":[{"sentence":"The advantage of using hypergols is the instant ignition upon contact.","translation":"ハイパーゴルを使用する利点は、接触時の即時点火です。","type":"noun","meaning_category":"definition"},{"sentence":"Engineers carefully monitored the flow of hypergolic propellants into the rocket engine.","translation":"エンジニアは、ロケットエンジンへのハイパーゴル推進剤の流れを注意深く監視しました。","type":"noun","meaning_category":"application"}]}