{"word":"full-weight","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(商品などが)規定の重量であること、正量であること","english_definition":"being of the standard or specified weight.","examples":[{"sentence":"The shipment was inspected to ensure all packages were full-weight.","translation":"出荷品は、すべての荷物が正量であることを確認するために検査されました。"},{"sentence":"The bags of flour are sold as full-weight, guaranteeing the customer gets what they pay for.","translation":"小麦粉の袋は正量として販売されており、顧客が支払った分の量を得られることが保証されています。"}],"collocations":["full-weight product","full-weight shipment","full-weight bag"],"synonyms":["standard weight","regulation weight"],"antonyms":["underweight","short-weight"]},{"part_of_speech":"adjective","definition":"(スポーツなどで)全力の、本気の","english_definition":"(of a sports team or athlete) performing at full strength or capacity.","examples":[{"sentence":"The team is fielding a full-weight lineup for the championship game.","translation":"チームは選手権試合に向けて全力のラインナップを組んでいます。"},{"sentence":"The boxer trained hard to be full-weight for the upcoming fight.","translation":"ボクサーは、次の試合に向けて全力で戦えるように懸命にトレーニングしました。"}],"collocations":["full-weight lineup","full-weight team","full-weight performance"],"synonyms":["full strength","full power","all-out"],"antonyms":["understrength","weakened"]}],"etymology":{"value":"The term 'full-weight' is a compound word combining 'full,' indicating completeness or maximum capacity, and 'weight,' referring to the measure of heaviness. The etymology is straightforward, reflecting the literal meaning of being completely or fully weighted.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfʊlˌweɪt/","syllables":"full-weight"},"inflection":{"notes":"Since 'full-weight' is primarily an adjective, it does not have inflections for verb tenses or plural forms. It can be modified by adverbs such as 'very' or 'completely' to indicate the degree of being full-weight."},"usage_notes":{"explanation":"'Full-weight' is used to describe something that meets the required or expected weight, often in the context of products or shipments. It can also describe a team or athlete performing at their maximum capacity. The term implies that there is no deficiency or reduction in the specified weight or capability.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The full weight of the product was 10kg.","correct":"✓ The full-weight product was 10kg.","note":"When describing a product that is of the standard weight, use 'full-weight' as a compound adjective. 'The full weight' refers to the total weight, not the standard weight."},{"incorrect":"✗ He played with full weight.","correct":"✓ He played at full weight.","note":"When describing someone playing or performing at their maximum capacity, use 'at full weight' or 'a full-weight performance' to emphasize the level of effort and strength."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["heavyweight","lightweight","middleweight"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The term 'full-weight' is a compound adjective that describes something meeting the standard or expected weight, or someone performing at their maximum capacity. It is often used in commercial or sports contexts. Understanding the term involves recognizing its literal meaning and the contexts in which it is typically applied.","priority":"★★☆"},"example_sentences":[{"sentence":"The manufacturer guarantees that all their products are sold as **full-weight**.","translation":"製造業者は、すべての製品が正量で販売されることを保証しています。","type":"adjective","meaning_category":"規定の重量であること"},{"sentence":"The coach announced a **full-weight** roster for the upcoming tournament.","translation":"コーチは、次のトーナメントに向けて全力のロスターを発表しました。","type":"adjective","meaning_category":"全力の"}]}