{"word":"teacher-created","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"教師によって作成された、教師が作った","english_definition":"Made or designed by a teacher or teachers.","examples":[{"sentence":"The students used teacher-created worksheets to practice their math skills.","translation":"生徒たちは、数学のスキルを練習するために、教師が作成したワークシートを使用した。"},{"sentence":"The teacher-created assessment was designed to measure student understanding of the material.","translation":"教師が作成した評価は、教材に対する生徒の理解度を測るように設計されていた。"},{"sentence":"We used teacher-created resources to supplement the textbook.","translation":"教科書を補完するために、教師が作成したリソースを使用した。"}],"collocations":["teacher-created materials","teacher-created resources","teacher-created content","teacher-created curriculum","teacher-created assessment"],"synonyms":["teacher-designed","instructor-made","educator-developed"],"antonyms":["commercially-produced","publisher-provided","student-created"]}],"etymology":{"value":"A compound word formed by combining \"teacher\" and \"created,\" indicating something that has been brought into existence by a teacher.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈtiːtʃər kriˈeɪtɪd/","syllables":"teach-er-cre-a-ted"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"The term \"teacher-created\" is commonly used in educational contexts to describe materials, resources, or assessments that have been developed by teachers for use in their classrooms. It emphasizes the role of the teacher as a creator and designer of learning experiences.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The teacher created material was helpful.","correct":"✓ The teacher-created material was helpful.","note":"The hyphen is important to show that \"teacher\" modifies \"created\" and that the phrase is acting as a single adjective."},{"incorrect":"✗ The teacher created resources are more better than the textbook.","correct":"✓ The teacher-created resources are better than the textbook.","note":"Avoid double comparatives such as \"more better.\""}],"priority":"☆☆☆"},"related_words":{"derivatives":["create","creation","creator","teacher"],"phrasal_verbs":[],"related_terms":["educational resources","teaching materials","lesson plans","curriculum development"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency, but common in educational contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"The term 'teacher-created' is used to describe resources or materials that a teacher has made themselves, rather than using something that was bought or provided by a company. It's often used to highlight the fact that the resource is tailored to the specific needs of the students in that teacher's class."},"example_sentences":[{"sentence":"The teacher-created games made learning fun and engaging for the students.","translation":"教師が作ったゲームは、生徒たちにとって学習を楽しく魅力的なものにした。","type":"adjective","meaning_category":"Made by a teacher"},{"sentence":"Many teachers share their teacher-created resources online for other educators to use.","translation":"多くの教師が、他の教育者が使用できるように、教師が作成したリソースをオンラインで共有している。","type":"adjective","meaning_category":"Made by a teacher"},{"sentence":"The school library has a section dedicated to teacher-created materials.","translation":"学校の図書館には、教師が作成した教材専用のセクションがある。","type":"adjective","meaning_category":"Made by a teacher"}]}