{"word":"immolations","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"焼身供犠、いけにえ","english_definition":"Instances of killing or offering as a sacrifice, especially by burning.","examples":[{"sentence":"The ancient practice of immolations involved sacrificing animals or humans to appease the gods.","translation":"古代の焼身供犠の慣習は、神々をなだめるために動物や人間を生贄として捧げることを伴った。"},{"sentence":"Some religious texts describe immolations as acts of devotion.","translation":"一部の宗教文書は、焼身供犠を献身の行為として記述している。"},{"sentence":"Modern immolations are often acts of protest.","translation":"現代の焼身はしばしば抗議の行為である。"}],"collocations":["self-immolation (焼身自殺)","ritual immolation (儀式的焼身供犠)","religious immolation (宗教的焼身供犠)"],"synonyms":["sacrifice","offering","burnt offering"],"antonyms":[]}],"etymology":{"value":"Late Middle English: from Latin immolation-, immolatio, from immolare ‘sprinkle with sacrificial meal’, later ‘sacrifice’, from in- ‘upon’ + mola ‘meal’","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪməˈleɪʃənz/","syllables":"im-mo-la-tions"},"inflection":{"noun_plural":"immolations"},"usage_notes":{"explanation":"'Immolations' refers to multiple instances of immolation, which is the act of killing or offering something as a sacrifice, especially by burning. It often carries a connotation of religious or ritualistic practice, though it can also refer to self-immolation as a form of protest.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The immolation was done quick.","correct":"✓ The immolation was done quickly.","note":"'Immolation' is a noun, so it cannot be modified by an adjective like 'quick'. Use the adverb 'quickly' instead."},{"incorrect":"✗ He performed an immolation for his sins.","correct":"✓ He performed an act of immolation for his sins.","note":"While 'immolation' can refer to the act itself, it's often more appropriate to use 'act of immolation' to specify the action."}],"priority":"★★☆"},"related_words":{"derivatives":["immolate (verb: to kill or offer as a sacrifice, especially by burning)","immolator (noun: one who immolates)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"immolations\" is a formal term referring to instances of sacrificing something, especially by burning. It is often used in historical or religious contexts to describe ancient rituals or acts of devotion. The word is not commonly used in everyday conversation, making it more suitable for advanced English speakers or those studying specific topics like history or religion."},"example_sentences":[{"sentence":"The historian described several immolations that took place during the Roman Empire.","translation":"歴史家は、ローマ帝国時代に起こったいくつかの焼身供犠について記述した。","type":"noun","meaning_category":"Sacrificial acts"},{"sentence":"The immolations were intended to appease the angry gods.","translation":"その焼身供犠は、怒れる神々をなだめることを目的としていた。","type":"noun","meaning_category":"Sacrificial acts"},{"sentence":"The news reported on the immolations as a form of political protest.","translation":"そのニュースは、焼身を政治的抗議の形として報道した。","type":"noun","meaning_category":"Sacrificial acts"}]}