{"word":"Ornithodelphia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A subclass of marsupials proposed in some classifications to include the monotremes (platypus and echidnas).","english_definition":"A subclass of marsupials proposed in some classifications to include the monotremes (platypus and echidnas).","examples":[{"sentence":"The Ornithodelphia are unique among mammals in laying eggs.","translation":"カモノハシ類は、卵を産むという点で哺乳類の中で独特である。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Greek 'ornis' (bird) + 'delphys' (womb), referring to the bird-like characteristic of laying eggs, combined with the marsupial characteristic of having a womb.","priority":"★★☆"},"pronunciation":{"ipa":"/ɔrˌnɪθoʊˈdɛlfiə/","syllables":"Or-ni-tho-del-phi-a"},"inflection":{"noun_plural":"Ornithodelphias"},"usage_notes":{"explanation":"The term 'Ornithodelphia' is not commonly used in modern classifications, as monotremes are now recognized as a distinct group (Prototheria) separate from marsupials. It is primarily of historical interest.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["ornithodelphic (adjective)"],"phrasal_verbs":[],"related_terms":["Monotremata","Prototheria","Marsupialia"]},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Ornithodelphia' is a technical term from older biological classifications, referring to a group that included monotremes (egg-laying mammals like the platypus and echidna). It's rarely used in modern biology because monotremes are now classified in their own separate group, Prototheria. This term is more likely to be encountered in historical or specialized scientific contexts."},"example_sentences":[{"sentence":"The Ornithodelphia, including monotremes, exhibit a mix of reptilian and mammalian characteristics.","translation":"カモノハシ類を含むカモノハシ亜綱は、爬虫類と哺乳類の特徴を併せ持つ。","type":"noun","meaning_category":"Classification"}]}