{"word":"donorship","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"寄付者であること、寄付者の地位、寄付者資格","english_definition":"The state or condition of being a donor; the status or role of a donor.","examples":[{"sentence":"The organization recognized his donorship with a plaque.","translation":"その組織は彼の寄付者資格を記念の盾で表彰した。"},{"sentence":"They offer various benefits to encourage donorship.","translation":"彼らは寄付者資格を奨励するために様々な特典を提供している。"},{"sentence":"The gallery relies on private donorship for its funding.","translation":"その美術館は資金調達を個人の寄付に頼っている。"}],"collocations":["private donorship (私的寄付)","encourage donorship (寄付を奨励する)","increase donorship (寄付を増やす)","levels of donorship (寄付のレベル)","sustaining donorship (持続的な寄付)"],"synonyms":["sponsorship","patronage","contribution","philanthropy","gift-giving"],"antonyms":[]}],"etymology":{"value":"\"Donor\" + \"-ship\".  \"Donor\" comes from Latin *donare* \"to give,\" and \"-ship\" is a suffix denoting a state, condition, or office.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdoʊnərʃɪp/","syllables":"do-nor-ship"},"inflection":{"noun_plural":"donorships"},"usage_notes":{"explanation":"\"Donorship\" refers to the state or condition of being a donor, often in the context of charitable giving or sponsorship. It can also refer to the specific benefits or recognition associated with being a donor. The term is frequently used by non-profit organizations and institutions to describe and manage their relationships with donors. It is less common in everyday conversation and more often found in formal or professional contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The donorship provided a lot of money.","correct":"✓ The donation provided a lot of money.","note":"\"Donorship\" refers to the *state* of being a donor, not the act of giving or the money given. Use \"donation\" for the act or the money itself."},{"incorrect":"✗ He has a strong donorship to the museum.","correct":"✓ He has a strong commitment to the museum as a donor.","note":"\"Donorship\" is a state of being.  Use \"commitment as a donor\" or \"support as a donor\" to describe his dedication."}],"priority":"★★☆"},"related_words":{"derivatives":["donor","donate","donation","donee"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"donorship\" is a relatively formal term that refers to the state or condition of being a donor, particularly in the context of charitable giving or sponsorship. It's often used by organizations to describe the status and benefits associated with being a donor. Because it is a more specialized term, it is not commonly used in everyday conversation. It's important to understand that \"donorship\" refers to the status or role of being a donor, rather than the act of donating or the donation itself."},"example_sentences":[{"sentence":"The university's alumni association relies heavily on annual donorship to fund scholarships.","translation":"その大学の同窓会は、奨学金を資金調達するために毎年の寄付に大きく依存している。","type":"noun","meaning_category":"状態・資格"},{"sentence":"The museum offers different levels of donorship, each with its own set of benefits.","translation":"その博物館はさまざまなレベルの寄付者資格を提供しており、それぞれに独自の特典が付いている。","type":"noun","meaning_category":"状態・資格"},{"sentence":"Sustaining donorship is crucial for the long-term financial health of the non-profit organization.","translation":"持続的な寄付者資格は、非営利団体の長期的な財政的健全性にとって非常に重要である。","type":"noun","meaning_category":"状態・資格"},{"sentence":"The organization's annual report highlighted the importance of increased donorship to support its programs.","translation":"その組織の年次報告書は、プログラムを支援するための寄付の増加の重要性を強調した。","type":"noun","meaning_category":"状態・資格"},{"sentence":"They created a new program to recognize and reward long-term donorship.","translation":"彼らは長期的な寄付者資格を認識し、報いるための新しいプログラムを作成した。","type":"noun","meaning_category":"状態・資格"}]}