{"word":"well-dunged","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"(of land) heavily fertilized with dung; richly manured.","english_definition":"(of land) having been heavily fertilized with dung; richly manured.","examples":[{"sentence":"The well-dunged fields produced a bountiful harvest.","translation":"その肥沃な土地は豊かな収穫をもたらした。"},{"sentence":"A well-dunged garden is essential for growing healthy vegetables.","translation":"健康な野菜を育てるには、肥沃な庭が不可欠だ。"}],"collocations":["well-dunged field","well-dunged garden","well-dunged soil"],"synonyms":["manured","fertilized","rich","fertile"],"antonyms":["barren","infertile","poor"]}],"etymology":{"value":"Combination of 'well' (adverb meaning thoroughly) and 'dunged' (past participle of 'dung', meaning to fertilize with dung).","priority":"Medium"},"pronunciation":{"ipa":"/ˌwɛlˈdʌndʒd/","syllables":"well-dunged"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"The term 'well-dunged' is primarily used in agricultural or gardening contexts to describe land that has been heavily fertilized with animal manure (dung). It implies that the soil is rich in nutrients, making it suitable for growing crops or plants. The term is somewhat archaic and not commonly used in modern English, but it can still be found in literature or discussions related to traditional farming practices.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"The flowers were well-dunged.","correct":"The soil was well-dunged for the flowers.","note":"It is the soil or land that is well-dunged, not the plants themselves. The correct usage emphasizes the preparation of the soil."}],"priority":"Low"},"related_words":{"derivatives":["dung","dunging","manure","fertilizer"],"phrases":["well-manured","rich soil","fertile land"],"priority":"Low"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Well-dunged' is a specialized term primarily used in agricultural or gardening contexts. It describes land that has been heavily fertilized with animal manure, making it nutrient-rich and suitable for growing crops or plants. Due to its specific context and somewhat archaic nature, it is not commonly used in everyday language and may require some background knowledge to fully understand its meaning."},"example_sentences":[{"sentence":"The farmer ensured the fields were well-dunged before planting the new crop.","translation":"農家は新しい作物を植える前に、畑が十分に肥沃であることを確認した。","type":"descriptive","meaning_category":"fertilized with dung"},{"sentence":"A well-dunged vegetable patch is the key to a successful harvest.","translation":"十分に肥沃な菜園は、豊作の鍵となる。","type":"descriptive","meaning_category":"fertilized with dung"}]}