{"word":"retropharyngitis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"咽後膿瘍","english_definition":"Inflammation of the retropharyngeal space, the area in the back of the throat behind the pharynx.","examples":[{"sentence":"Retropharyngitis can be caused by bacterial infection.","translation":"咽後膿瘍は細菌感染によって引き起こされることがある。"},{"sentence":"Symptoms of retropharyngitis include fever, sore throat, and difficulty swallowing.","translation":"咽後膿瘍の症状には、発熱、喉の痛み、嚥下困難などがある。"}],"collocations":["acute retropharyngitis","chronic retropharyngitis"],"synonyms":["retropharyngeal abscess"],"antonyms":[]}],"etymology":{"value":"Derived from 'retro-' (behind), 'pharynx' (throat), and '-itis' (inflammation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌrɛtroʊˌfærɪnˈdʒaɪtɪs/","syllables":"re-tro-pha-ryn-gi-tis"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Retropharyngitis is often used interchangeably with retropharyngeal abscess, although the latter implies the presence of pus. It is a relatively rare condition but can be serious, especially in young children.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I have retropharyngitis, so I took antibiotics.","correct":"✓ I have a retropharyngeal abscess, so I took antibiotics.","note":"While retropharyngitis refers to inflammation, a retropharyngeal abscess specifically indicates a collection of pus. The latter is more commonly treated with antibiotics."}],"priority":"★★☆"},"related_words":{"derivatives":["retropharyngeal (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Retropharyngitis' is a medical term referring to inflammation in the retropharyngeal space. It is not a common term in everyday language and is primarily used in medical contexts. Understanding requires knowledge of medical terminology.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor diagnosed the child with acute retropharyngitis.","translation":"医師は子供を急性咽後膿瘍と診断した。","type":"medical","meaning_category":"diagnosis"},{"sentence":"Early diagnosis of retropharyngitis is crucial to prevent complications.","translation":"合併症を防ぐためには、咽後膿瘍の早期診断が重要である。","type":"medical","meaning_category":"importance of diagnosis"}]}