{"word":"dorsiventrality","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"背腹性、背腹性を示す状態","english_definition":"The condition of having distinct dorsal and ventral surfaces.","examples":[{"sentence":"The dorsiventrality of a leaf is evident in its distinct upper and lower surfaces.","translation":"葉の背腹性は、その明確な上面と下面に明らかである。"},{"sentence":"Dorsiventrality is a common feature in flatworms.","translation":"背腹性は扁形動物によく見られる特徴である。"}],"collocations":["leaf dorsiventrality","animal dorsiventrality"],"synonyms":["bilateral symmetry","polarity"],"antonyms":["radial symmetry"]},{"part_of_speech":"noun","definition":"(植物学)葉の表裏異性","english_definition":"(Botany) The condition of a leaf having distinct upper and lower surfaces.","examples":[{"sentence":"The dorsiventrality of leaves allows for efficient light capture.","translation":"葉の背腹性によって、効率的な光捕獲が可能になる。"}],"collocations":["leaf dorsiventrality"],"synonyms":["heterofaciality"],"antonyms":["isobilateral"]}],"etymology":{"value":"Derived from 'dorsiventral,' which combines 'dorsi-' (referring to the back or dorsal side) and 'ventral' (referring to the belly or ventral side) with the suffix '-ity' indicating a state or condition.","priority":"★★☆"},"pronunciation":{"ipa":"ˌdɔːrsiˌvɛnˈtræləti","syllables":"dor-si-ven-tral-i-ty"},"inflection":{"noun_plural":"dorsiventralities"},"usage_notes":{"explanation":"'Dorsiventrality' is primarily used in biology to describe organisms or structures that have distinct dorsal (back) and ventral (belly) surfaces. It is commonly applied to leaves, where the upper and lower surfaces have different structures and functions. In zoology, it describes animals like flatworms that are flattened and have distinct dorsal and ventral sides.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The flower showed dorsiventrality.","correct":"✓ The leaf showed dorsiventrality.","note":"Dorsiventrality is more commonly associated with leaves than flowers. Flowers may exhibit other forms of symmetry, but dorsiventrality specifically refers to the distinct upper and lower surfaces."}],"priority":"★☆☆"},"related_words":{"derivatives":["dorsiventral (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Dorsiventrality' is a technical term used in biology, particularly in botany and zoology, to describe the condition of having distinct dorsal (back) and ventral (belly) surfaces. This term is typically encountered in advanced scientific texts and is not part of everyday vocabulary. Understanding this term requires a background in biology or a related field."},"example_sentences":[{"sentence":"The **dorsiventrality** of the leaf is an adaptation for maximizing sunlight exposure on the upper surface.","translation":"葉の背腹性は、上面での日光曝露を最大化するための適応である。","type":"noun","meaning_category":"背腹性を示す状態"},{"sentence":"The **dorsiventrality** in flatworms allows for specialized functions on the dorsal and ventral sides of their bodies.","translation":"扁形動物の背腹性により、体の背面と腹面で特殊な機能が可能になる。","type":"noun","meaning_category":"背腹性を示す状態"}]}