{"word":"sandburr","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"イネ科の植物、特にCenchrus属の植物の総称。球状の硬いイガイガのついた苞を持ち、動物や人の衣服に付着して種子を散布する。","english_definition":"Any of several grasses, especially of the genus Cenchrus, having burs with prickly spines that stick to clothing and fur, aiding in seed dispersal.","examples":[{"sentence":"Sandburrs are a nuisance to hikers and pet owners.","translation":"サンドバーはハイカーやペットの飼い主にとって迷惑な存在です。"},{"sentence":"The field was full of sandburrs, making it difficult to walk through.","translation":"その野原はサンドバーでいっぱいだったので、歩くのが困難でした。"}],"collocations":["sandburr grass","field of sandburrs","remove sandburrs"],"synonyms":["burgrass","spurgrass"],"antonyms":[]},{"part_of_speech":"noun","definition":"サンドバーのイガイガのついた苞。","english_definition":"The prickly bur of a sandburr plant.","examples":[{"sentence":"I had to pick the sandburrs out of my dog's fur.","translation":"私は犬の毛からサンドバーを取り除かなければなりませんでした。"},{"sentence":"Be careful not to step on the sandburrs with bare feet.","translation":"裸足でサンドバーを踏まないように注意してください。"}],"collocations":["remove sandburrs","step on sandburrs"],"synonyms":["bur","prickly bur"],"antonyms":[]}],"etymology":{"value":"\"sand\"（砂）+ \"burr\"（イガイガ）から構成される合成語。砂地によく生え、イガイガのついた苞を持つ植物であることから。","priority":"★★☆"},"pronunciation":{"ipa":"ˈsændˌbɜːr/","syllables":"sand-burr"},"inflection":{"noun_plural":"sandburrs"},"usage_notes":{"explanation":"\"sandburr\"は、特に北米でよく見られる特定の種類のイネ科植物を指します。これらの植物は、動物や人の衣服に付着しやすいイガイガのついた苞を持つことで知られています。この単語は、植物全体を指すことも、イガイガのついた苞そのものを指すこともあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a lot of sandberry in the field.","correct":"✓ I saw a lot of sandburrs in the field.","note":"\"sandberry\"は別の単語であり、通常は特定の種類のベリーを指します。この場合は、イガイガのついた植物を指す\"sandburr\"が正しいです。"},{"incorrect":"✗ The sandburr is very pain when you step on it.","correct":"✓ The sandburr is very painful when you step on it.","note":"\"pain\"は名詞（痛み）であり、ここでは形容詞（痛い）の\"painful\"を使うのが適切です。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["grass","weed","prickly","bur"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Sandburr\" is a specific term for a type of grass known for its prickly burs. It's not a common word in everyday conversation but might be encountered in contexts related to botany, gardening, or outdoor activities in regions where these plants are prevalent. Understanding the word requires some familiarity with plant terminology and ecological concepts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The farmer was trying to eradicate the sandburrs from his pasture.","translation":"農家は牧草地からサンドバーを根絶しようとしていました。","type":"noun","meaning_category":"植物"},{"sentence":"The dog came back from the walk covered in sandburrs.","translation":"犬は散歩から帰ってきて、サンドバーだらけでした。","type":"noun","meaning_category":"イガイガのついた苞"}]}