{"word":"tuy","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(南米アンデスの) 鉱山労働者が使う送風管、ふいご","english_definition":"A blast pipe or tuyere used in South American (especially Andean) mining, particularly for ventilation.","examples":[{"sentence":"The miners used a long tuy to ventilate the deep shaft.","translation":"鉱夫たちは深い坑道を換気するために長い送風管を使った。"},{"sentence":"The ancient Incas employed a type of tuy for smelting metals.","translation":"古代インカ人は金属を精錬するために一種の送風管を使った。"}],"collocations":["mining tuy","ventilation tuy","Inca tuy"],"synonyms":["blast pipe","tuyere","air pipe","ventilation tube"],"antonyms":[]}],"etymology":{"value":"From Quechua *t'uyu* or Aymara *t'uyu*, both referring to a type of pipe or tube.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtuːiː/","syllables":"tu-i"},"inflection":{"notes":"Plural: tuys or tuyes"},"usage_notes":{"explanation":"The term \"tuy\" is relatively specialized, primarily used in the context of historical or traditional mining practices in the Andes region of South America. It refers to a specific type of pipe or tube used for ventilation or directing airflow in mines.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a tuy to water the plants.","correct":"✓ He used a hose to water the plants.","note":"\"Tuy\" specifically refers to a mining ventilation pipe, not a general-purpose pipe for watering plants or other uses."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["tuyere (より一般的な送風口の英語)","Quechua","Aymara","mining","Andes"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"tuy\" is a specialized term primarily encountered in contexts related to historical or traditional mining practices in the Andes region of South America. Understanding its meaning requires familiarity with Quechua or Aymara languages and/or knowledge of mining terminology. It is unlikely to be encountered in general English usage.","priority":"★☆☆"},"example_sentences":[{"sentence":"The archeologists discovered an ancient tuy used for ventilation in the silver mine.","translation":"考古学者たちは銀鉱山で換気のために使われた古代の送風管を発見した。","type":"noun","meaning_category":"mining"},{"sentence":"The indigenous miners still use a traditional tuy to improve airflow in the narrow tunnels.","translation":"先住民の鉱夫たちは、狭いトンネル内の空気の流れを改善するために、今でも伝統的な送風管を使っている。","type":"noun","meaning_category":"mining"}]}