{"word":"Taíno","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"タイノ族（カリブ海地域に居住していたアラワク族の民族）","english_definition":"A member of an Arawak people formerly inhabiting the Greater Antilles and the Bahamas.","examples":[{"sentence":"The Taíno people were the first Native Americans encountered by Christopher Columbus.","translation":"タイノ族は、クリストファー・コロンブスが遭遇した最初のアメリカ先住民でした。"},{"sentence":"Many words in the English language, such as 'canoe' and 'hammock', are derived from the Taíno language.","translation":"英語の多くの単語、例えば「カヌー」や「ハンモック」は、タイノ語に由来しています。"}],"collocations":["Taíno culture","Taíno language","Taíno artifacts","Taíno history"],"synonyms":["Arawak (related, broader group)"],"antonyms":[]},{"part_of_speech":"adjective","definition":"タイノ族の、タイノ語の","english_definition":"Relating to the Taíno people or their language.","examples":[{"sentence":"Taíno art is characterized by intricate carvings and pottery.","translation":"タイノ族の芸術は、複雑な彫刻と陶器によって特徴づけられます。"},{"sentence":"Efforts are being made to revive the Taíno language.","translation":"タイノ語を復活させるための努力がなされています。"}],"collocations":["Taíno art","Taíno language","Taíno heritage"],"synonyms":["Arawakan (related, broader group)"],"antonyms":[]}],"etymology":{"value":"From Taíno, meaning 'good' or 'noble'. It was used by the Taíno people to describe themselves.","priority":"★★★"},"pronunciation":{"ipa":"/taˈiːnoʊ/","syllables":"Ta-í-no"},"inflection":{"noun_plural":"Taínos"},"usage_notes":{"explanation":"The term \"Taíno\" refers to a specific Arawakan-speaking people who inhabited the Greater Antilles (Cuba, Hispaniola, Jamaica, Puerto Rico) and the Bahamas at the time of European contact. While often used interchangeably with \"Arawak,\" it's important to note that Arawak is a broader linguistic and cultural group, while Taíno refers to a specific subgroup within that larger group. The Taíno people played a significant role in the early history of the Americas, and their culture and language have had a lasting impact.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Tainoes were a peaceful tribe.","correct":"✓ The Taíno were a peaceful tribe.","note":"The correct plural form is \"Taíno\" or \"Taínos\" (less common). \"Tainoes\" is not standard. Also, remember to capitalize \"Taíno\" as it is a proper noun."},{"incorrect":"✗ Taino language is part of the Spanish language family.","correct":"✓ The Taíno language is part of the Arawakan language family.","note":"The Taíno language belongs to the Arawakan language family, not the Spanish language family."}],"priority":"★★☆"},"related_words":{"derivatives":["Arawak (related language family and broader cultural group)","Carib (another indigenous group in the Caribbean)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (Specialized vocabulary related to history and anthropology)","frequency_google_ngram":"Relatively low frequency, primarily in historical and anthropological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"**Taíno**\" is a term referring to an indigenous people of the Caribbean, specifically those who inhabited the Greater Antilles and the Bahamas before European colonization. Understanding this term requires some knowledge of Caribbean history and anthropology. It's important to distinguish between \"Taíno\" and the broader term \"Arawak,\" as Taíno represents a specific subgroup within the Arawakan-speaking peoples. Discussions involving the Taíno often involve topics such as pre-Columbian history, cultural exchange, and the impact of colonization on indigenous populations. Therefore, familiarity with these historical and cultural contexts is necessary for a comprehensive understanding of the term."},"example_sentences":[{"sentence":"The **Taíno** were skilled agriculturalists, cultivating crops such as cassava and maize.","translation":"タイノ族は熟練した農業者であり、キャッサバやトウモロコシなどの作物を栽培していました。","type":"noun","meaning_category":"ethnic group"},{"sentence":"Archaeological evidence provides insights into the **Taíno** way of life.","translation":"考古学的な証拠は、タイノ族の生活様式に関する洞察を提供します。","type":"adjective","meaning_category":"relating to the ethnic group"},{"sentence":"Columbus's arrival marked a turning point in the history of the **Taíno** people.","translation":"コロンブスの到着は、タイノ族の歴史における転換点となりました。","type":"noun","meaning_category":"ethnic group"},{"sentence":"The **Taíno** language has influenced some Caribbean Spanish dialects.","translation":"タイノ語は、カリブ海のスペイン語の方言に影響を与えています。","type":"adjective","meaning_category":"relating to the language"}]}