{"word":"dragger-up","priority":"low","meanings":[{"part_of_speech":"noun","definition":"(British slang, dated) A person, especially a woman, who dresses in an exaggeratedly flamboyant or vulgar manner.","english_definition":"(British slang, dated) A person, especially a woman, who dresses in an exaggeratedly flamboyant or vulgar manner.","examples":[{"sentence":"She was described as a 'dragger-up' because of her outlandish outfits.","translation":"彼女は奇抜な服装のせいで「けばけばしい女」と評された。"}],"collocations":[],"synonyms":["gaudy dresser","vulgar dresser"],"antonyms":[],"notes":"This term is considered outdated and potentially offensive. It is rarely used in modern English."}],"etymology":{"value":"Likely derived from the idea of someone 'dragging up' old or inappropriate clothing, or 'dragging up' attention to themselves through their appearance.","priority":"low"},"pronunciation":{"ipa":"/ˈdræɡərˌʌp/","syllables":"drag-ger-up"},"inflection":{"noun_plural":"dragger-ups"},"usage_notes":{"explanation":"This term is highly specific to British slang and is not commonly understood or used outside of that context. Its usage is also dated, and it carries a negative connotation, implying poor taste or a desire for attention through inappropriate dress.","priority":"low"},"common_mistakes":{},"related_words":{"derivatives":[],"related_terms":["drag queen (related but distinct; refers specifically to male performers dressing as women for entertainment)"],"priority":"low"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"low"},"readability_explanation":{"level":"C2","text":"The term 'dragger-up' is a highly specialized and dated piece of British slang. It's unlikely to be encountered in general English conversation or writing. Understanding its meaning requires familiarity with historical slang terms and social attitudes towards dress and appearance. Due to its potentially offensive nature and limited usage, it's best to avoid using this term.","priority":"low"},"example_sentences":[{"sentence":"In the old days, she would have been called a 'dragger-up' for wearing such bright colours.","translation":"昔なら、彼女はこんな派手な色を着ていることで「けばけばしい女」と呼ばれただろう。","type":"example","meaning_category":"vulgar dresser"}]}