{"word":"earthliness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"世俗性、現世的であること、物質主義","english_definition":"The quality of being concerned with worldly matters rather than spiritual ones; materialism.","examples":[{"sentence":"The artist's work lacked the earthliness that would have made it relatable to ordinary people.","translation":"その芸術家の作品には、一般の人々が共感できるような世俗性が欠けていた。"},{"sentence":"He was criticized for his earthliness and lack of spiritual depth.","translation":"彼はその世俗性と精神的な深みの欠如を批判された。"},{"sentence":"The novel explores the tension between spiritual aspirations and the pull of earthliness.","translation":"その小説は、精神的な願望と世俗的な魅力との間の緊張を探求している。"}],"collocations":["lack of earthliness","focus on earthliness","escape from earthliness","embrace earthliness"],"synonyms":["worldliness","materialism","secularity","temporal nature","mundaneness"],"antonyms":["spirituality","otherworldliness","immateriality","asceticism"]}],"etymology":{"value":"Derived from the word 'earthly' (relating to the earth), with the suffix '-ness' indicating a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɜːrθlinəs/","syllables":"earth-li-ness"},"inflection":{"noun_plural":"earthlinesses (rarely used)"},"usage_notes":{"explanation":"'Earthliness' refers to the quality of being focused on the material world and physical pleasures, often in contrast to spiritual or intellectual pursuits. It can carry a negative connotation, suggesting a lack of higher values or a preoccupation with superficial concerns.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The earthliness of the sky was beautiful.","correct":"The beauty of the earthly sky was captivating.","note":"'Earthliness' is not a quality of the sky, but rather a characteristic of someone's focus on worldly matters. Use 'earthly' to describe things related to the earth."}],"priority":"★★☆"},"related_words":{"derivatives":["earthly (adjective)","earth (noun)"],"phrasal_verbs":[],"related_concepts":["materialism","secularism","worldliness","temporal"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Earthliness' is a relatively abstract noun that describes a focus on worldly matters and material possessions, often contrasted with spiritual or intellectual concerns. It's not a common word, and understanding it requires a grasp of abstract concepts and a familiarity with discussions about values and priorities.","priority":"★☆☆"},"example_sentences":[{"sentence":"The monk renounced all forms of earthliness to dedicate himself to a life of prayer.","translation":"その僧侶は祈りの生活に専念するために、あらゆる形の世俗性を放棄した。","type":"noun","meaning_category":"世俗性"},{"sentence":"Her art celebrated the beauty and simplicity of earthliness.","translation":"彼女の芸術は、世俗性の美しさとシンプルさを称賛した。","type":"noun","meaning_category":"世俗性"},{"sentence":"He struggled to balance his spiritual beliefs with the demands of earthliness.","translation":"彼は精神的な信念と世俗性の要求とのバランスを取るのに苦労した。","type":"noun","meaning_category":"世俗性"}]}