{"word":"leveler","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"水平にする人、平らにする人、整地する人","english_definition":"A person or thing that levels something.","examples":[{"sentence":"The construction workers used a leveler to create a flat surface for the foundation.","translation":"建設作業員は、基礎のための平らな面を作るために整地機を使用した。"},{"sentence":"He is a skilled leveler, able to create perfectly even surfaces.","translation":"彼は熟練した整地作業員で、完全に平らな面を作ることができる。"}],"collocations":["road leveler","ground leveler","automatic leveler"],"synonyms":["grader","roller","flattening machine"]},{"part_of_speech":"noun","definition":"平等主義者、社会の階層をなくそうとする人","english_definition":"One who advocates for social or economic equality; especially, one who seeks to eliminate social hierarchies.","examples":[{"sentence":"The levelers believed that all people should have equal rights and opportunities.","translation":"平等主義者たちは、すべての人が平等な権利と機会を持つべきだと信じていた。"},{"sentence":"Historically, levelers have often been associated with radical political movements.","translation":"歴史的に、平等主義者はしばしば急進的な政治運動と関連付けられてきた。"}],"collocations":["social leveler","economic leveler"],"synonyms":["egalitarian","equalizer","democratizer"],"antonyms":["elitist","hierarchist"]},{"part_of_speech":"noun","definition":"（比喩的に）格差をなくすもの、平等化するもの","english_definition":"Something that makes things more equal or uniform.","examples":[{"sentence":"Technology can be a great leveler, providing access to information and education for all.","translation":"テクノロジーは、すべての人に情報と教育へのアクセスを提供し、偉大な平等化装置となりうる。"},{"sentence":"Disease can be a leveler, affecting people from all walks of life.","translation":"病気は、あらゆる階層の人々に影響を与えるため、格差をなくすものとなりうる。"}],"collocations":["great leveler","social leveler"],"synonyms":["equalizer","democratizer"]}],"etymology":{"value":"From the verb 'level' + '-er'. 'Level' comes from Old French 'level', from Latin 'libella' (a small level, balance), diminutive of 'libra' (a pound, balance).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɛvələr/","syllables":"lev-el-er"},"inflection":{"noun_plural":"levelers"},"usage_notes":{"explanation":"The word 'leveler' has two main meanings. One refers to a person or device that makes surfaces flat or even. The other refers to someone who advocates for social or economic equality, often seeking to eliminate social hierarchies. The context usually makes it clear which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He used a leveler to check if the wall was vertical.","correct":"He used a level to check if the wall was vertical.","note":"A 'level' is the tool used to check verticality, while a 'leveler' is used to make surfaces flat."}],"priority":"★★☆"},"related_words":{"derivatives":["level (verb, noun, adjective)","leveling (verb, noun)"],"related_concepts":["equality","egalitarianism","social justice","construction","surveying"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'leveler' has two primary meanings. One refers to a tool or person that makes surfaces flat, often in construction. The other, more abstract meaning, refers to someone who believes in or works towards social and economic equality, aiming to reduce or eliminate social hierarchies. The context usually indicates which meaning is intended. It's important to distinguish it from the more common word 'level,' which can be a noun, verb, or adjective."},"example_sentences":[{"sentence":"The road crew used a heavy-duty **leveler** to smooth out the gravel road.","translation":"道路作業員は、砂利道を滑らかにするために、頑丈な整地機を使用した。","type":"noun","meaning_category":"整地する人・機械"},{"sentence":"As a **leveler**, she fought for equal pay for women in the workplace.","translation":"平等主義者として、彼女は職場での女性への同一賃金を求めて戦った。","type":"noun","meaning_category":"平等主義者"},{"sentence":"The internet has been described as a great **leveler**, giving everyone a voice.","translation":"インターネットは、すべての人に発言権を与える偉大な平等化装置として説明されてきた。","type":"noun","meaning_category":"平等化するもの"}]}