{"word":"social-mindedly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"社会的な心を向けて、社会的な配慮をもって、社会意識を持って","english_definition":"In a manner that shows consideration for society and the well-being of others; with a social conscience.","examples":[{"sentence":"The company acted social-mindedly by donating a portion of its profits to local charities.","translation":"その会社は利益の一部を地元の慈善団体に寄付することで、社会的な配慮をもって行動した。"},{"sentence":"She approached the project social-mindedly, ensuring that it would benefit the community.","translation":"彼女は地域社会に利益をもたらすように、社会意識を持ってプロジェクトに取り組んだ。"},{"sentence":"We should all strive to live more social-mindedly, considering the impact of our actions on others.","translation":"私たちは皆、自分の行動が他者に与える影響を考慮して、より社会的な心を向けて生きるよう努めるべきだ。"}],"collocations":["act social-mindedly","approach a problem social-mindedly","live social-mindedly","behave social-mindedly","think social-mindedly"],"synonyms":["altruistically","benevolently","compassionately","considerately","humanely","public-spiritedly"],"antonyms":["selfishly","egotistically","self-centeredly"]}],"etymology":{"value":"Derived from \"social-minded\" (having a concern for social problems and welfare) and the adverbial suffix \"-ly\".","priority":"★★★"},"pronunciation":{"ipa":"/ˌsoʊʃəlˈmaɪndɪdli/","syllables":"so-cial-mind-ed-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"\"Social-mindedly\" describes actions or behaviors that are motivated by a concern for the well-being of society and other people. It implies a conscious effort to consider the social impact of one's actions and to act in a way that benefits the community. It is often used in the context of ethical business practices, community involvement, and responsible citizenship.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a social-mindedly person.","correct":"✓ He is a social-minded person.","note":"\"Social-minded\" is an adjective, so it modifies the noun \"person.\""},{"incorrect":"✗ She worked social-minded on the project.","correct":"✓ She worked social-mindedly on the project.","note":"\"Social-mindedly\" is an adverb, so it modifies the verb \"worked.\""}]},"related_words":{"derivatives":["social-minded (adjective)","social-mindedness (noun)"],"related_terms":["socially responsible","community-oriented","altruistic","philanthropic"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Social-mindedly\" is an adverb that describes acting with a strong awareness and consideration for the needs and well-being of society as a whole. It implies a conscious effort to make decisions and take actions that benefit the community and promote social good. This word is not commonly used in everyday conversation but is more often found in formal writing or discussions about ethics, social responsibility, and community development."},"example_sentences":[{"sentence":"The company decided to invest in renewable energy sources, acting social-mindedly to reduce its carbon footprint.","translation":"その会社は、二酸化炭素排出量を削減するために、社会的な配慮をもって再生可能エネルギー源に投資することを決定した。","type":"adverb","meaning_category":"社会的な配慮をもって"},{"sentence":"She approached her career social-mindedly, always seeking opportunities to contribute to the greater good.","translation":"彼女は常に社会全体の利益に貢献する機会を模索し、社会意識を持ってキャリアを追求した。","type":"adverb","meaning_category":"社会意識を持って"},{"sentence":"By volunteering their time and resources, they demonstrated how to live social-mindedly within their community.","translation":"彼らは時間と資源をボランティアで提供することで、地域社会の中で社会的な心を向けて生きる方法を示した。","type":"adverb","meaning_category":"社会的な心を向けて"}]}