{"word":"Heteropterous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"異翅亜目の、半翅目の","english_definition":"Belonging or pertaining to the Heteroptera (formerly a suborder, now a group within the Hemiptera), characterized by having forewings that are hardened at the base and membranous at the tip.","examples":[{"sentence":"The heteropterous insects include stink bugs and assassin bugs.","translation":"異翅亜目の昆虫には、カメムシやサシガメが含まれます。"}],"collocations":["heteropterous insect","heteropterous bug","heteropterous family"],"synonyms":["hemipteran"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'heteros' (ἕτερος) meaning 'different' and 'pteron' (πτερόν) meaning 'wing', referring to the different texture of the forewings.","priority":"★★★"},"pronunciation":{"ipa":"/ˌhɛtəˈrɒptərəs/","syllables":"het-er-op-ter-ous"},"inflection":{},"usage_notes":{"explanation":"'Heteropterous' is primarily a descriptive adjective used in entomology to classify insects belonging to the Heteroptera group within the order Hemiptera (true bugs). It emphasizes the distinctive feature of these insects: their forewings, which are partly hardened and partly membranous.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The heteropterous is a bug.","correct":"✓ The heteropterous insect is a bug.","note":"'Heteropterous' is an adjective, so it needs to modify a noun (e.g., insect, bug)."},{"incorrect":"✗ Heteropterous insects have the same wings.","correct":"✓ Heteropterous insects have different wings.","note":"The name 'Heteroptera' refers to the different texture of the forewings (hardened at the base, membranous at the tip)."}],"priority":"★★☆"},"related_words":{"derivatives":["Heteroptera (noun: the group of insects)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'heteropterous' is a technical adjective used in the field of entomology to describe insects belonging to the group Heteroptera (true bugs). The term refers to the unique structure of their forewings, which are partly hardened (hemelytra) and partly membranous. This term is rarely used outside of scientific or specialized contexts. Understanding this term requires familiarity with entomological terminology and insect anatomy.","priority":"★★☆"},"example_sentences":[{"sentence":"The heteropterous insects are characterized by their hemelytra.","translation":"異翅亜目の昆虫は、半鞘翅によって特徴づけられる。","type":"general","meaning_category":"description"},{"sentence":"Many heteropterous species are agricultural pests.","translation":"多くの異翅亜目の種は農業害虫である。","type":"ecology","meaning_category":"ecology"},{"sentence":"The classification of heteropterous families is based on wing venation and other morphological features.","translation":"異翅亜目の科の分類は、翅脈やその他の形態的特徴に基づいている。","type":"taxonomy","meaning_category":"taxonomy"}]}