{"word":"metatype","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"メタタイプ","english_definition":"A type whose instances are themselves types. It describes the structure and behavior of types, similar to how a class describes the structure and behavior of objects.","examples":[{"sentence":"In some programming languages, classes are instances of a metatype.","translation":"一部のプログラミング言語では、クラスはメタタイプのインスタンスです。"},{"sentence":"The metatype defines how new types can be created.","translation":"メタタイプは、新しい型がどのように作成されるかを定義します。"}],"collocations":["metatype object","metatype instance","define metatype","create metatype"],"synonyms":["class factory","type factory"],"antonyms":[]}],"etymology":{"value":"The word \"metatype\" is formed by combining the prefix \"meta-\" (meaning 'beyond' or 'about') with the word \"type\". It signifies a type that describes other types.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɛtəˌtaɪp/","syllables":"me-ta-type"},"inflection":{"noun_plural":"metatypes"},"usage_notes":{"explanation":"A metatype is a type whose instances are themselves types. It is a higher-order type that describes the structure and behavior of other types. This concept is often used in object-oriented programming languages to implement features such as class factories and reflection.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The metatype is an instance of a class.","correct":"✓ A class is an instance of a metatype.","note":"Classes are instances of metatypes, not the other way around."}],"priority":"★★☆"},"related_words":{"derivatives":["meta-object protocol","reflection","introspection"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"metatype\" is a technical term primarily used in computer science, specifically in the context of programming languages and type systems. It refers to a type whose instances are themselves types. Understanding this term requires familiarity with object-oriented programming concepts and type theory. It is not commonly used in general conversation or writing.","priority":"★★☆"},"example_sentences":[{"sentence":"The language's metatype system allows for dynamic creation of new types at runtime.","translation":"その言語のメタタイプシステムにより、実行時に新しい型を動的に作成できます。","type":"noun","meaning_category":"type system"},{"sentence":"The metatype provides a blueprint for creating classes with specific properties.","translation":"メタタイプは、特定のプロパティを持つクラスを作成するための設計図を提供します。","type":"noun","meaning_category":"programming"}]}