{"word":"unpushed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Not pushed; not subjected to being pushed.","english_definition":"Not having been pushed; not subjected to pressure or force to move forward or in a certain direction.","examples":[{"sentence":"The button remained unpushed, the machine dormant.","translation":"ボタンは押されないままで、機械は休止状態だった。"},{"sentence":"The door was unpushed and stayed firmly closed.","translation":"ドアは押されず、しっかりと閉じたままだった。"}],"collocations":["unpushed button","unpushed door","unpushed boundaries"],"synonyms":["untouched","unmoved","undisturbed","unpressed"],"antonyms":["pushed","pressed","actuated"]},{"part_of_speech":"adjective","definition":"(Figuratively) Not pressured or urged to achieve something; lacking ambition or drive.","english_definition":"(Figuratively) Not pressured or encouraged to advance, develop, or achieve something; lacking ambition or drive.","examples":[{"sentence":"He felt unpushed in his career, lacking the motivation to climb the corporate ladder.","translation":"彼はキャリアにおいてプレッシャーを感じず、出世階段を上る意欲に欠けていた。"},{"sentence":"She described herself as unpushed, content with her current role.","translation":"彼女は自身を、現状に満足し、向上心がないと表現した。"}],"collocations":["unpushed in career","unpushed student","unpushed potential"],"synonyms":["unmotivated","unambitious","content","unaspiring"],"antonyms":["ambitious","motivated","driven","pushed"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to the past participle 'pushed' of the verb 'push'.","priority":"N/A"},"pronunciation":{"ipa":"/ʌnˈpʊʃt/","syllables":"un-pushed"},"inflection":{"notes":"Adjective; comparative and superlative forms are typically 'more unpushed' and 'most unpushed', respectively, though these are rarely used."},"usage_notes":{"explanation":"'Unpushed' is primarily used to describe something that has not been physically pushed. Figuratively, it describes a lack of pressure or motivation to achieve something. The figurative use is less common but conveys a sense of contentment or lack of ambition.","priority":"2"},"common_mistakes":{"examples":[{"incorrect":"He was very unpushed to succeed.","correct":"He was not very pushed to succeed. / He lacked the drive to succeed.","note":"Using 'unpushed' to mean 'unwilling' is incorrect. It describes a lack of external pressure or internal motivation, not a refusal to act."}],"priority":"1"},"related_words":{"derivatives":["push (verb, noun)","pushed (adjective)","pushing (adjective)"],"phrasal_verbs":["N/A"],"related_adjectives":["unmotivated","unambitious","passive"],"related_nouns":["apathy","complacency"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency; not a commonly used word.","priority":"1"},"readability_explanation":{"level":"B2","text":"The word 'unpushed' is not very common. It generally means something hasn't been physically pushed, or figuratively, someone lacks the drive or pressure to achieve more. It's more often used in descriptive or reflective contexts than in everyday conversation. The figurative sense requires a slightly more advanced understanding of English vocabulary."},"example_sentences":[{"sentence":"The emergency exit remained unpushed during the fire drill.","translation":"避難訓練中、非常口の押しボタンは押されないままだった。","type":"adjective","meaning_category":"Not physically pushed"},{"sentence":"Despite his talent, he remained unpushed and never pursued his artistic dreams.","translation":"才能があったにもかかわらず、彼は向上心を抱かず、芸術的な夢を追求することはなかった。","type":"adjective","meaning_category":"Lacking ambition"}]}