{"word":"statement-shaped","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(比喩的に)声明のような形をした、声明のような性質を持つ","english_definition":"(figuratively) having the form or nature of a statement; resembling a statement. This often implies something is presented as a fact or declaration, even if it might be an opinion or not fully supported.","examples":[{"sentence":"The politician's response was statement-shaped, offering no room for discussion.","translation":"政治家の返答は声明のようなもので、議論の余地がなかった。"},{"sentence":"Her presentation was statement-shaped, lacking any real evidence or analysis.","translation":"彼女のプレゼンテーションは声明のようなもので、実際の証拠や分析が不足していた。"},{"sentence":"The article was written in a statement-shaped style, presenting opinions as if they were facts.","translation":"その記事は声明のようなスタイルで書かれており、意見を事実であるかのように提示していた。"}],"collocations":["statement-shaped response (声明のような返答)","statement-shaped presentation (声明のようなプレゼンテーション)","statement-shaped style (声明のようなスタイル)","statement-shaped argument (声明のような議論)"],"synonyms":["declarative","assertive","dogmatic","categorical","opinionated","factual-sounding"],"antonyms":["questioning","inquisitive","tentative","speculative","nuanced","open-ended"]},{"part_of_speech":"adjective","definition":"(文字通り)声明の形をした","english_definition":"(literally) shaped like a statement, typically referring to a physical object or design. This is a rare and less common usage.","examples":[{"sentence":"The sculpture was statement-shaped, resembling a large, unfolded document.","translation":"その彫刻は声明の形をしており、大きく広げられた文書に似ていた。"}],"collocations":["statement-shaped sculpture (声明の形をした彫刻)","statement-shaped design (声明の形をしたデザイン)"],"synonyms":["document-shaped","declaration-shaped"],"antonyms":[]}],"etymology":{"value":"A compound word formed by combining 'statement' (a definite or clear expression of something in speech or writing) with '-shaped' (having the form or shape of). The term implies that something possesses the characteristics of a statement, such as being assertive, declarative, or presented as a fact.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsteɪtməntˌʃeɪpt/","syllables":"state-ment-shaped"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"The term 'statement-shaped' is most often used figuratively to describe something that is presented in the manner of a formal statement, often implying a lack of nuance, discussion, or supporting evidence. It can carry a slightly negative connotation, suggesting that opinions are being presented as facts. The literal meaning (shaped like a statement) is much less common.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The cloud was statement-shaped like a heart.","correct":"✓ The cloud was heart-shaped.","note":"Use 'statement-shaped' when something is presented as a statement or declaration, not just to describe a physical shape. In the example, 'heart-shaped' is the correct term to describe the shape of the cloud."}],"priority":"★★☆"},"related_words":{"derivatives":["statement (noun)","shaped (adjective)"],"phrases":["in the form of a statement","presented as a statement","declarative","assertive"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. This is a relatively uncommon and specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'statement-shaped' is a relatively advanced and nuanced adjective, primarily used figuratively. It describes something that is presented in the manner of a statement, often implying a lack of nuance, discussion, or supporting evidence. Understanding the meaning requires a good grasp of the word 'statement' and the suffix '-shaped'. The literal meaning (shaped like a statement) is rare. The figurative usage is more common in academic or analytical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The company's press release was statement-shaped, offering no apologies or explanations.","translation":"その会社のプレスリリースは声明のようなもので、謝罪や説明はなかった。","type":"adjective","meaning_category":"figurative"},{"sentence":"The lawyer's opening argument was statement-shaped, designed to influence the jury from the start.","translation":"弁護士の冒頭陳述は声明のようなもので、最初から陪審員に影響を与えるように設計されていた。","type":"adjective","meaning_category":"figurative"},{"sentence":"The artist created a statement-shaped sculpture out of recycled materials.","translation":"アーティストはリサイクル素材を使って声明の形をした彫刻を作成した。","type":"adjective","meaning_category":"literal (rare)"}]}