{"word":"footmanry","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"召使いたち、特にフットマン（従僕）の集団","english_definition":"A body of footmen or servants, especially those in livery.","examples":[{"sentence":"The wealthy estate employed a large footmanry to attend to the needs of the family and guests.","translation":"その裕福な地所では、家族や客の世話をするために大勢の召使いたちを雇っていた。"},{"sentence":"The duke's footmanry was known for their impeccable manners and smart uniforms.","translation":"公爵の召使いたちは、その完璧なマナーと洒落た制服で知られていた。"}],"collocations":["large footmanry","duke's footmanry","royal footmanry"],"synonyms":["servants","attendants","entourage","staff","retinue"],"antonyms":["master","employer"]}],"etymology":{"value":"'Footman' + '-ry'. 'Footman' is from 'foot' + 'man', referring to a servant who runs alongside or behind a carriage. The '-ry' suffix denotes a group or collection.","priority":"★★☆"},"pronunciation":{"ipa":"ˈfʊtmənri","syllables":"foot-man-ry"},"inflection":{"noun_plural":"footmanries"},"usage_notes":{"explanation":"'Footmanry' is a somewhat archaic term, primarily used in historical contexts to describe the collective body of footmen or servants, especially those in livery (special uniform). It emphasizes the group nature of the servants rather than individual roles.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The footmanry was single.","correct":"✓ The footman was single.","note":"'Footmanry' refers to a group, not an individual. Use 'footman' for a single servant."}],"priority":"★☆☆"},"related_words":{"derivatives":["footman"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Footmanry' is a rare and formal word referring to a group of male servants (footmen). It is primarily encountered in historical novels or period dramas. The word is not in common usage. Understanding the meaning of 'footmanry' requires familiarity with historical social structures and vocabulary. "},"example_sentences":[{"sentence":"The grand ballroom was filled with the murmur of the assembled guests and the silent movements of the footmanry.","translation":"大広間は集まった客たちのざわめきと、召使いたちの静かな動きで満たされていた。","type":"noun","meaning_category":"group of servants"},{"sentence":"The efficiency of the estate's footmanry was a testament to the strict training they received.","translation":"その地所の召使いたちの効率の良さは、彼らが受けた厳しい訓練の証だった。","type":"noun","meaning_category":"group of servants"}]}