{"word":"additivity","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"加法性、加算性：ある操作や関数が、個々の要素に対する結果の合計が、全体の要素に対する結果と等しい性質。","english_definition":"The property of being additive; the property of a function such that the value of the function for a sum of arguments is equal to the sum of the values of the function for each argument.","examples":[{"sentence":"Linearity implies additivity and homogeneity.","translation":"線形性は加法性と斉一性（同次性）を意味する。"},{"sentence":"The additivity of variances is a key assumption in many statistical models.","translation":"分散の加法性は、多くの統計モデルにおける重要な仮定である。"},{"sentence":"In quantum mechanics, probability amplitudes exhibit additivity.","translation":"量子力学では、確率振幅が加法性を示す。"}],"collocations":["additivity of variance (分散の加法性)","additivity of energy (エネルギーの加法性)","additivity of probabilities (確率の加法性)","linear additivity (線形加法性)","approximate additivity (近似的な加法性)"],"synonyms":["superposition","linearity","summation"],"antonyms":["non-additivity","non-linearity"]},{"part_of_speech":"noun","definition":"（文脈によっては）添加性：物質を添加することによって特性が変化する性質。","english_definition":"(In some contexts) The property related to the effect of adding substances.","examples":[{"sentence":"The additivity of certain chemicals can enhance the effectiveness of a pesticide.","translation":"特定の化学物質の添加性は、殺虫剤の効果を高めることができる。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from \"additive\" + \"-ity\". \"Additive\" comes from \"add\" + \"-ive\".","priority":"★★★"},"pronunciation":{"ipa":"/ˌædɪˈtɪvɪti/","syllables":"ad-di-ti-vi-ty"},"inflection":{"noun_plural":"additivities"},"usage_notes":{"explanation":"\"Additivity\" refers to the property where the result of applying an operation to a combination of elements is the same as the sum of applying that operation to each element individually. This is particularly important in mathematics, physics, and statistics. In some contexts, it can also refer to the effects of adding substances to something.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The system has good addition.","correct":"✓ The system has good additivity.","note":"\"Addition\" refers to the act of adding, whereas \"additivity\" refers to the property of being additive."}],"priority":"★★☆"},"related_words":{"derivatives":["additive (adjective, noun)","add (verb)","addition (noun)"],"related_terms":["linearity","superposition","homogeneity"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"\"Additivity\" is a technical term that describes a property where the result of performing an operation on a combination of elements is equal to the sum of performing the operation on each element separately. It's often used in fields like mathematics, physics, and statistics. Understanding this term requires a solid grasp of abstract concepts and mathematical principles."},"example_sentences":[{"sentence":"The additivity of energy is a fundamental principle in physics.","translation":"エネルギーの加法性は物理学における基本的な原理である。","type":"general","meaning_category":"加法性"},{"sentence":"We tested the additivity of the new fertilizer by measuring its effect on individual plants and then on a group of plants.","translation":"新しい肥料の添加性を、個々の植物と植物のグループに対する効果を測定することでテストした。","type":"application","meaning_category":"添加性"},{"sentence":"The additivity of probabilities is crucial for calculating the likelihood of compound events.","translation":"確率の加法性は、複合事象の尤度を計算する上で重要である。","type":"statistics","meaning_category":"加法性"}]}