{"word":"Caucasoid","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"コーカソイドの、白人種の","english_definition":"Relating to or denoting a broad division of humankind covering people of European, Western Asian, and Indian subcontinent origin.","examples":[{"sentence":"The study focused on Caucasoid populations in Europe.","translation":"その研究はヨーロッパのコーカソイド集団に焦点を当てた。"}],"synonyms":["Caucasian"],"antonyms":["Negroid","Mongoloid"]},{"part_of_speech":"noun","definition":"コーカソイド、白人","english_definition":"A member of the Caucasoid race.","examples":[{"sentence":"He was identified as a Caucasoid based on his physical characteristics.","translation":"彼は身体的特徴からコーカソイドであると識別された。"}],"synonyms":["Caucasian"],"antonyms":["Negroid","Mongoloid"]}],"etymology":{"value":"Derived from 'Caucasus', a mountain region between Europe and Asia, mistakenly considered the origin of the race.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkɔːkəsɔɪd/","syllables":"Cau-ca-soid"},"usage_notes":{"explanation":"The term 'Caucasoid' is considered outdated and often offensive due to its historical association with scientific racism. It is generally recommended to avoid using this term. More appropriate terms include 'European descent' or specifying the geographic origin of the population.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Using 'Caucasoid' as a synonym for 'white' without understanding its problematic history.","correct":"Using more specific and respectful terms like 'European descent' or 'of European origin'.","note":"Avoid using outdated and potentially offensive racial classifications."}],"priority":"★★☆"},"related_words":{"derivatives":["Caucasian"],"related_terms":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'Caucasoid' is a technical term from historical anthropology, now largely deprecated due to its association with scientific racism. It refers to a broad racial classification that was once used to categorize people of European, West Asian, and Indian subcontinent origin. Due to its problematic history, it's best to avoid using this term in contemporary discussions. When referring to people, it's more accurate and respectful to use terms that specify geographic origin or ancestry, such as 'of European descent'."},"example_sentences":[{"sentence":"Anthropologists once classified Europeans as Caucasoid.","translation":"人類学者はかつてヨーロッパ人をコーカソイドとして分類した。","type":"adjective","meaning_category":"Historical classification"},{"sentence":"The skeletal remains were identified as belonging to a Caucasoid individual.","translation":"その骨格遺体はコーカソイドの人に属するものと識別された。","type":"noun","meaning_category":"Historical classification"}]}