{"word":"video-functioning","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"ビデオ機能が正常に動作している、ビデオ機能が使える状態の","english_definition":"Describes something with working video capabilities or the state of having video capabilities that are working properly.","examples":[{"sentence":"The video-functioning security system recorded the incident.","translation":"ビデオ機能が正常に動作しているセキュリティシステムがその事件を記録した。"},{"sentence":"The technician confirmed the camera was video-functioning before the broadcast.","translation":"技術者は放送前にカメラのビデオ機能が正常に動作していることを確認した。"}],"collocations":["video-functioning camera","video-functioning system","video-functioning device"],"synonyms":["operational","working","active","enabled"],"antonyms":["non-functioning","inoperative","disabled","broken"]}],"etymology":{"value":"Combination of 'video' (referring to visual recording or display) and 'functioning' (indicating proper operation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvɪdi.oʊ ˈfʌŋk.ʃənɪŋ/","syllables":"vi-de-o-func-tion-ing"},"inflection":{"notes":"This is a descriptive adjective and does not typically have inflections."},"usage_notes":{"explanation":"The term 'video-functioning' is used to emphasize that the video component of a device or system is in proper working order. It's often used in technical contexts or when confirming that video capabilities are active and operational. It is a relatively uncommon term and might be replaced with simpler alternatives like 'working' or 'operational'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The video-functioning is good on this camera.","correct":"✓ The video functionality is good on this camera. / ✓ The camera is video-functioning well.","note":"'Video-functioning' is an adjective, so it should describe a noun. Using 'video functionality' as a noun is more appropriate in the first case. In the second case, 'video-functioning' is used correctly to describe the camera."}],"priority":"★★☆"},"related_words":{"derivatives":["functionality","video","functioning"],"phrasal_verbs":[],"related_terms":["video camera","video recording","video playback","video streaming"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Video-functioning' is a technical term used to describe a device or system where the video component is working correctly. It's not a common word in everyday language, so it's more likely to be found in technical manuals or specifications. You can understand it by breaking it down: 'video' refers to the visual aspect, and 'functioning' means working properly. Therefore, 'video-functioning' means that the video part of something is working as it should."},"example_sentences":[{"sentence":"Ensure the surveillance equipment is video-functioning before leaving the premises.","translation":"施設を離れる前に、監視装置のビデオ機能が正常に動作していることを確認してください。","type":"adjective","meaning_category":"operational"},{"sentence":"The new software update is designed to improve the video-functioning capabilities of the smartphone.","translation":"新しいソフトウェアアップデートは、スマートフォンのビデオ機能の動作能力を向上させるように設計されています。","type":"adjective","meaning_category":"capabilities"}]}