{"word":"Ophthalmophorium","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A device or structure, often found in ancient burials, designed to allow the deceased to 'see' or 'look out' from the tomb. These can take various forms, such as eye-like openings or painted eyes on sarcophagi.","english_definition":"A device or structure, often found in ancient burials, designed to allow the deceased to 'see' or 'look out' from the tomb. These can take various forms, such as eye-like openings or painted eyes on sarcophagi.","examples":[{"sentence":"Archaeologists discovered an elaborate ophthalmophorium in the pharaoh's tomb, suggesting a strong belief in the afterlife.","translation":"考古学者たちは、ファラオの墓で精巧な眼孔を発見し、死後の世界への強い信仰を示唆した。"},{"sentence":"The presence of an ophthalmophorium in the burial chamber indicates that the deceased was meant to maintain a connection with the living world.","translation":"埋葬室に眼孔が存在することは、故人が生者の世界とのつながりを維持することを意図していたことを示している。"}],"collocations":["ancient burial","pharaoh's tomb","burial chamber","maintain a connection","afterlife"],"synonyms":["false door","eye panel","soul house"],"antonyms":[]}],"etymology":{"value":"The word is a modern construction, combining 'ophthalmo-' (from Greek 'ophthalmos' meaning 'eye') and '-phorium' (from Greek '-phoros' meaning 'bearing' or 'carrying'). Thus, it literally means 'eye-bearing' or 'eye-carrying' structure.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒfθælmoʊˈfɔːriəm/","syllables":"Oph-thal-mo-pho-ri-um"},"inflection":{"noun_plural":"Ophthalmophoria"},"usage_notes":{"explanation":"The term 'ophthalmophorium' is not widely used outside of specialized archaeological or Egyptological contexts. It refers to a specific type of architectural or artistic feature found primarily in ancient tombs, particularly in ancient Egypt, but also in other cultures. Its function is believed to be related to funerary beliefs about the soul's ability to see or interact with the world after death.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ophthalmophorium was used as a telescope.","correct":"✓ The ophthalmophorium was a symbolic feature, not a functional device.","note":"An ophthalmophorium is a symbolic or religious feature, not a practical device like a telescope."}],"priority":"★★☆"},"related_words":{"derivatives":["ophthalmology (眼科学)","ophthalmic (眼の)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Very specialized vocabulary)","frequency_google_ngram":"Extremely low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Ophthalmophorium' is a highly specialized term used in archaeology and related fields to describe a specific feature found in ancient tombs, particularly those of ancient Egypt. It refers to a structure or design element intended to allow the deceased to symbolically 'see' or maintain a connection with the outside world. Due to its limited usage, it is not typically encountered outside of academic or professional contexts dealing with ancient cultures and funerary practices."},"example_sentences":[{"sentence":"The elaborate ophthalmophorium in the tomb provided a symbolic window for the deceased's spirit.","translation":"墓にある精巧な眼孔は、故人の霊のための象徴的な窓を提供した。","type":"noun","meaning_category":"archaeology"},{"sentence":"Scholars debate the precise religious significance of the ophthalmophorium in ancient Egyptian burial rituals.","translation":"学者たちは、古代エジプトの埋葬儀式における眼孔の正確な宗教的意義について議論している。","type":"noun","meaning_category":"archaeology"}]}