{"word":"ergogenic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"運動能力を高める、作業能力を高める","english_definition":"intended to enhance physical performance, stamina, or recovery.","examples":[{"sentence":"Ergogenic aids are often used by athletes to improve their performance.","translation":"運動能力向上剤は、アスリートがパフォーマンスを向上させるためによく使用されます。"},{"sentence":"The study investigated the ergogenic effects of caffeine on endurance exercise.","translation":"その研究では、カフェインが持久力運動に及ぼす運動能力向上効果について調査しました。"}],"collocations":["ergogenic aid","ergogenic effect","ergogenic substance","ergogenic properties"],"synonyms":["performance-enhancing","work-enhancing","activity-enhancing"],"antonyms":["ergolytic (performance-reducing)"]},{"part_of_speech":"noun","definition":"運動能力を高める物質、作業能力を高める物質","english_definition":"a substance or practice that enhances physical performance, stamina, or recovery.","examples":[{"sentence":"Creatine is a popular ergogenic among weightlifters.","translation":"クレアチンは、重量挙げ選手の間で人気のある運動能力向上剤です。"},{"sentence":"The use of ergogenics is often controversial due to ethical and health concerns.","translation":"運動能力向上剤の使用は、倫理的および健康上の懸念から、しばしば議論の的となります。"}],"collocations":["use of ergogenics","types of ergogenics","natural ergogenics","synthetic ergogenics"],"synonyms":["performance enhancer","work enhancer","activity enhancer"],"antonyms":["ergolytic agent (performance-reducing agent)"]}],"etymology":{"value":"Derived from the Greek words 'ergon' (work) and 'genesis' (production, creation). Essentially, it means 'work-producing' or 'performance-enhancing'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɜːrɡəˈdʒɛnɪk/","syllables":"er-go-gen-ic"},"inflection":{"notes":"Adjective: ergogenic, Noun: ergogenic (often used in plural form 'ergogenics')"},"usage_notes":{"explanation":"The term 'ergogenic' is primarily used in the context of sports, exercise science, and nutrition. It refers to substances, techniques, or practices that are believed to improve physical performance, endurance, or recovery. These can range from nutritional supplements and dietary strategies to training methods and psychological techniques. The use of ergogenics is often subject to debate due to concerns about fair play, ethical considerations, and potential health risks.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The medicine has ergogenic effects on the patient's mood.","correct":"✓ The medicine has positive effects on the patient's mood.","note":"'Ergogenic' is typically used in the context of physical performance, not mood or general well-being. Use 'positive effects' or a more specific term in this context."},{"incorrect":"✗ He is an ergogenic athlete.","correct":"✓ He is an athlete who uses ergogenic aids.","note":"'Ergogenic' is an adjective describing something that enhances performance, not a characteristic of a person. Say 'an athlete who uses ergogenic aids' or 'a performance-enhanced athlete'."}],"priority":"★★☆"},"related_words":{"derivatives":["ergogenically (adverb)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (Specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'ergogenic' is a specialized term primarily used in the fields of sports science, exercise physiology, and nutrition. It describes something that is intended to improve physical performance, stamina, or recovery. This can refer to substances (like supplements), practices (like specific training techniques), or even psychological strategies. Because it is a technical term, it is more commonly found in academic or professional contexts related to sports and fitness. A simpler way to express the same idea would be 'performance-enhancing'.","priority":"★★★"},"example_sentences":[{"sentence":"The athlete tested positive for an ergogenic substance.","translation":"そのアスリートは運動能力向上物質の検査で陽性反応が出た。","type":"adjective","meaning_category":"運動能力を高める"},{"sentence":"Proper nutrition is an important ergogenic aid for runners.","translation":"適切な栄養は、ランナーにとって重要な運動能力向上剤です。","type":"noun","meaning_category":"運動能力を高める物質"},{"sentence":"Researchers are studying the ergogenic effects of beetroot juice.","translation":"研究者たちは、ビーツジュースの運動能力向上効果について研究しています。","type":"adjective","meaning_category":"運動能力を高める"},{"sentence":"The use of certain ergogenics is banned in professional sports.","translation":"特定の運動能力向上剤の使用は、プロスポーツで禁止されています。","type":"noun","meaning_category":"運動能力を高める物質"}]}