{"word":"Hypocholesterinemia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"低コレステロール血症","english_definition":"A condition characterized by abnormally low levels of cholesterol in the blood.","examples":[{"sentence":"Hypocholesterinemia can be associated with certain underlying medical conditions.","translation":"低コレステロール血症は、特定の基礎疾患と関連している可能性があります。"},{"sentence":"The doctor ordered blood tests to rule out hypocholesterinemia.","translation":"医師は低コレステロール血症を除外するために血液検査を指示しました。"}],"collocations":["severe hypocholesterinemia","secondary hypocholesterinemia","investigate hypocholesterinemia","diagnose hypocholesterinemia"],"synonyms":["low cholesterol","hypocholesterolemia"],"antonyms":["hypercholesterolemia","high cholesterol"]}],"etymology":{"value":"Derived from the Greek words 'hypo' (under, below), 'cholesterol' (a type of fat), and 'emia' (condition of the blood).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpoʊˌkɒləˌstɛrɪˈniːmiə/","syllables":"hy-po-cho-les-ter-i-ne-mi-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Hypocholesterinemia is typically diagnosed through a blood test that measures cholesterol levels. While high cholesterol is more commonly discussed, abnormally low cholesterol can also indicate health issues.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Hypocholesterinemia is a type of high cholesterol.","correct":"✓ Hypocholesterinemia is a condition of low cholesterol.","note":"Hypocholesterinemia refers to low cholesterol levels, not high cholesterol. "},{"incorrect":"✗ You can treat hypocholesterinemia by eating more fatty foods.","correct":"✓ Treatment for hypocholesterinemia depends on the underlying cause and should be determined by a healthcare professional.","note":"Treatment should be determined by a doctor."}],"priority":"★★☆"},"related_words":{"derivatives":["hypocholesterolemic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hypocholesterinemia' is a technical medical term referring to the condition of having abnormally low levels of cholesterol in the blood. This term is primarily used in medical contexts and is not commonly encountered in everyday language. Understanding this term requires a background in biology or medicine."},"example_sentences":[{"sentence":"Further investigation is needed to determine the cause of her hypocholesterinemia.","translation":"彼女の低コレステロール血症の原因を特定するためには、さらなる調査が必要です。","type":"medical","meaning_category":"condition"},{"sentence":"Hypocholesterinemia can sometimes be a sign of malnutrition or malabsorption.","translation":"低コレステロール血症は、栄養失調や吸収不良の兆候であることがあります。","type":"medical","meaning_category":"symptom"}]}