{"word":"daily-motivated","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"日々モチベーションを高く維持している、毎日のように意欲的な","english_definition":"Consistently feeling or showing enthusiasm and determination to achieve things on a daily basis.","examples":[{"sentence":"She is a daily-motivated employee who always arrives early and completes her tasks efficiently.","translation":"彼女は毎日意欲的な従業員で、いつも早く出社し、効率的に仕事をこなします。"},{"sentence":"To be a successful entrepreneur, you need to be daily-motivated and persistent.","translation":"成功する起業家になるには、毎日モチベーションを高く維持し、粘り強く取り組む必要があります。"},{"sentence":"He follows a strict routine to stay daily-motivated and focused on his goals.","translation":"彼は、毎日のモチベーションを維持し、目標に集中するために、厳格なルーチンに従っています。"}],"collocations":["stay daily-motivated (毎日モチベーションを維持する)","become daily-motivated (毎日意欲的になる)","remain daily-motivated (毎日意欲的なままでいる)","a daily-motivated individual (毎日意欲的な人)","a daily-motivated team (毎日意欲的なチーム)"],"synonyms":["self-motivated","driven","enthusiastic","determined","ambitious","enterprising","proactive"],"antonyms":["unmotivated","lethargic","apathetic","indifferent","uninspired"]}],"etymology":{"value":"A compound word formed by combining \"daily\" (every day) and \"motivated\" (having a reason or incentive to do something). It describes a state of being consistently driven and enthusiastic each day.","priority":"★☆☆"},"pronunciation":{"ipa":null,"syllables":"dai-ly-mo-ti-vat-ed"},"inflection":{"notes":"This is an adjective and does not have different forms for gender or number."},"usage_notes":{"explanation":"\"Daily-motivated\" describes someone who consistently demonstrates a high level of enthusiasm and determination in their daily activities. It emphasizes the consistency of their motivation, suggesting that they are not just occasionally driven, but maintain a high level of motivation every day. This term is often used in professional or self-improvement contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is very daily motivated.","correct":"✓ He is a daily-motivated person. / ✓ He is highly motivated every day.","note":"While \"daily-motivated\" is a valid adjective, using an adverb like \"very\" to modify it directly is less common. It's better to use it to describe a person or to rephrase the sentence to emphasize the daily aspect of the motivation. "},{"incorrect":"✗ She is daily-motivating.","correct":"✓ She is daily-motivated.","note":"\"Daily-motivating\" would imply that she is causing motivation on a daily basis, rather than being motivated herself. \"Daily-motivated\" is the correct form to describe someone who feels motivated daily."}],"priority":"★☆☆"},"related_words":{"derivatives":["motivation (noun)","motivate (verb)","daily (adverb/adjective)"],"phrases":["self-starter","go-getter","high-achiever","results-oriented","goal-driven"],"priority":"★☆☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency. This is not a common term, but it is understandable.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Daily-motivated\" is a compound adjective that describes someone who is consistently enthusiastic and determined to achieve their goals every day. It's a relatively uncommon term, but its meaning is easily understood by combining the meanings of \"daily\" and \"motivated.\" It's often used in professional or self-improvement contexts to describe individuals who are proactive and driven in their daily activities."},"example_sentences":[{"sentence":"The company seeks daily-motivated individuals to join its sales team.","translation":"会社は、営業チームに加わる毎日意欲的な人材を求めています。","type":"adjective","meaning_category":"意欲的な"},{"sentence":"Her daily-motivated approach to fitness helped her achieve her weight loss goals.","translation":"彼女の毎日のように意欲的なフィットネスへの取り組みが、減量目標の達成に役立ちました。","type":"adjective","meaning_category":"意欲的な"},{"sentence":"A daily-motivated mindset is essential for success in a fast-paced environment.","translation":"ペースの速い環境で成功するためには、毎日意欲的な考え方が不可欠です。","type":"adjective","meaning_category":"意欲的な"}]}