{"word":"vyingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"競争的に、張り合って","english_definition":"in a competitive manner; in a way that shows a strong desire to win or be better than someone else.","examples":[{"sentence":"The two companies vyingly advertised their new products.","translation":"その二つの会社は、競争的に新製品の広告を出した。"},{"sentence":"The athletes vyingly competed for the gold medal.","translation":"選手たちは金メダルを求めて張り切って競争した。"}],"collocations":["compete vyingly","advertise vyingly","struggle vyingly","try vyingly"],"synonyms":["competitively","rivalrously","contentiously","ambitiously","eagerly"],"antonyms":["cooperatively","collaboratively","harmoniously"]}],"etymology":{"value":"The word 'vyingly' is derived from the present participle 'vying' of the verb 'vie,' combined with the adverbial suffix '-ly.' The verb 'vie' comes from the Old French word 'envier,' meaning 'to challenge, to compete,' which is ultimately from the Latin word 'invitare,' meaning 'to invite, to challenge.'","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈvaɪɪŋli/","syllables":"vy-ing-ly"},"inflection":{"notes":"This is an adverb, so it does not have different forms based on tense or number."},"usage_notes":{"explanation":"'Vyingly' is used to describe actions or behaviors that are characterized by intense competition and a strong desire to outperform others. It suggests a situation where individuals or groups are actively striving to be superior or to achieve a particular goal.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The children played vyingly together.","correct":"✓ The children competed vyingly with each other.","note":"'Vyingly' implies competition, so it doesn't fit well with cooperative activities like playing together. Use 'competed vyingly' or a similar phrase to emphasize the competitive aspect."},{"incorrect":"✗ She vyingly smiled at him.","correct":"✓ She smiled at him encouragingly.","note":"'Vyingly' is not appropriate for describing simple actions like smiling. It should be used when there is a clear element of competition or rivalry."}],"priority":"★☆☆"},"related_words":{"derivatives":["vie (verb)","vying (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Vyingly' is an adverb that describes an action done in a competitive or rivalrous manner. It is not a commonly used word and is more likely to be found in formal writing or speech. It implies a strong desire to win or be better than others. Understanding its meaning requires a good grasp of vocabulary related to competition and rivalry."},"example_sentences":[{"sentence":"The two teams vyingly fought for possession of the ball.","translation":"その二つのチームはボールの支配権を求めて激しく争った。","type":"adverb","meaning_category":"競争的に"},{"sentence":"The artists vyingly submitted their paintings to the competition.","translation":"芸術家たちは競争的に自分たちの絵画をコンテストに提出した。","type":"adverb","meaning_category":"張り合って"}]}