{"word":"disjudication","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律)裁判の終了、判決、決定","english_definition":"The act or process of deciding a case or issue judicially; a judgment or decision.","examples":[{"sentence":"The disjudication of the case brought relief to the defendant.","translation":"その事件の判決は被告に安堵をもたらした。"},{"sentence":"The court's disjudication was based on the evidence presented.","translation":"裁判所の決定は提出された証拠に基づいていた。"}],"collocations":["final disjudication","court disjudication","judicial disjudication"],"synonyms":["adjudication","judgment","ruling","decision","verdict"],"antonyms":[]}],"etymology":{"value":"Derived from 'dis-' (a prefix indicating negation or reversal) and 'adjudication' (the act of adjudicating). The 'dis-' prefix here may imply the completion or finality of the adjudication process.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪsˌdʒuːdɪˈkeɪʃən/","syllables":"dis-ju-di-ca-tion"},"inflection":{"noun_plural":"disjudications"},"usage_notes":{"explanation":"'Disjudication' is a relatively rare term, often used in legal contexts to emphasize the finality or completion of a judicial decision. It is closely related to 'adjudication' but may carry a stronger connotation of closure.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The disjudication was made by the lawyer.","correct":"✓ The disjudication was made by the judge.","note":"Disjudication is a judicial act, so it's typically performed by a judge or court, not a lawyer."}],"priority":"★★☆"},"related_words":{"derivatives":["adjudicate","adjudication"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Disjudication' is a formal and rare term primarily used in legal settings. It refers to the process and outcome of a judicial decision, emphasizing the completion or finality of the legal proceedings. Due to its specialized usage, it is not commonly encountered outside of legal contexts."},"example_sentences":[{"sentence":"The appeal process delayed the final disjudication of the property dispute.","translation":"上訴手続きにより、財産紛争の最終的な判決が遅れた。","type":"noun","meaning_category":"裁判の終了"},{"sentence":"The disjudication provided a clear resolution to the complex legal issue.","translation":"その判決は複雑な法的問題に明確な解決策をもたらした。","type":"noun","meaning_category":"判決"}]}