{"word":"twice-disgraced","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"二度不名誉な目に遭った、二度失脚した","english_definition":"having suffered disgrace or loss of reputation on two separate occasions.","examples":[{"sentence":"The twice-disgraced politician struggled to regain public trust.","translation":"二度失脚した政治家は、国民の信頼を取り戻すのに苦労した。"},{"sentence":"He was a twice-disgraced athlete trying to make a comeback.","translation":"彼は二度不名誉な目に遭ったアスリートで、カムバックしようとしていた。"}],"collocations":["twice-disgraced official","twice-disgraced celebrity"],"synonyms":["repeatedly disgraced","fallen from grace twice"],"antonyms":["unblemished","reputable","honorable"]}],"etymology":{"value":"The word is formed by combining \"twice\" (meaning two times) with \"disgraced\" (meaning having lost honor or reputation).","priority":"★★★"},"pronunciation":{"ipa":"/ˌtwaɪs dɪsˈɡreɪst/","syllables":"twice-dis-graced"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"This adjective is used to describe someone who has experienced disgrace or a loss of reputation on two separate occasions. It implies a repeated failure or scandal that has damaged the person's standing.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a twice disgraced man.","correct":"✓ He is a twice-disgraced man.","note":"The hyphen is important to connect \"twice\" and \"disgraced\" when used as a compound adjective before a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["disgrace (noun, verb)","disgraced (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"twice-disgraced\" is a relatively uncommon and sophisticated term used to describe someone who has lost their reputation or honor on two separate occasions. It is generally used in formal or journalistic contexts to emphasize the severity of the person's situation. Understanding the word requires a good grasp of vocabulary related to reputation, honor, and repeated events."},"example_sentences":[{"sentence":"The twice-disgraced CEO attempted to start a new company, but investors were wary.","translation":"二度失脚したCEOは新しい会社を始めようとしたが、投資家たちは用心深かった。","type":"adjective","meaning_category":"失脚した"},{"sentence":"As a twice-disgraced figure, he found it difficult to find employment.","translation":"二度不名誉な目に遭った人物として、彼は職を見つけるのが難しいと感じた。","type":"adjective","meaning_category":"不名誉な"}]}