{"word":"Isophotes","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"等光度線","english_definition":"Lines on an image or map connecting points of equal light intensity.","examples":[{"sentence":"Isophotes are used in astronomy to study the structure of galaxies.","translation":"等光度線は、天文学において銀河の構造を研究するために使用されます。"},{"sentence":"The isophotes on the weather map showed areas of similar cloud cover.","translation":"天気図上の等光度線は、同様の雲量を示す領域を示していました。"}],"collocations":["draw isophotes","observe isophotes","analyze isophotes","isophote map"],"synonyms":["isoline","contour line"],"antonyms":[]}],"etymology":{"value":"The word \"isophote\" is derived from the Greek words \"iso-\" (meaning \"equal\") and \"phos\" (meaning \"light\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˈaɪsəˌfoʊts/","syllables":"I-so-photes"},"inflection":{"noun_plural":"Isophotes"},"usage_notes":{"explanation":"Isophotes are used in various fields, including astronomy, meteorology, and image processing, to represent areas of equal light intensity. They are similar to contour lines on a topographic map, but instead of representing elevation, they represent light intensity.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["isophotal (adjective)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term \"isophotes\" is a specialized term used in technical fields such as astronomy and image processing. It refers to lines connecting points of equal light intensity, similar to contour lines representing elevation. Understanding this term requires familiarity with concepts in these fields."},"example_sentences":[{"sentence":"The astronomer studied the isophotes of the galaxy to determine its shape.","translation":"天文学者は、銀河の形状を決定するために、その等光度線を研究しました。","type":"noun","meaning_category":"astronomy"},{"sentence":"Image processing software can generate isophotes to highlight areas of similar brightness.","translation":"画像処理ソフトウェアは、同様の明るさの領域を強調するために等光度線を生成できます。","type":"noun","meaning_category":"image processing"}]}