{"word":"benevolence-oriented","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"慈悲心に基づいた、博愛主義的な、親切心を中心とした","english_definition":"Focused on or characterized by kindness, generosity, and a desire to do good for others.","examples":[{"sentence":"The organization's mission is benevolence-oriented, aiming to provide aid to those in need.","translation":"その団体の使命は慈悲心に基づいたもので、困窮している人々に援助を提供することを目的としています。"},{"sentence":"Her benevolence-oriented approach to business has earned her the respect of her employees and the community.","translation":"彼女の博愛主義的なビジネスへの取り組みは、従業員と地域社会からの尊敬を集めています。"},{"sentence":"The company adopted a benevolence-oriented policy, donating a portion of its profits to charity.","translation":"その会社は慈悲心を中心とした方針を採用し、利益の一部を慈善団体に寄付しています。"}],"collocations":["benevolence-oriented organization (慈悲心に基づいた組織)","benevolence-oriented approach (慈悲心に基づいたアプローチ)","benevolence-oriented policy (慈悲心に基づいた政策)","benevolence-oriented leadership (慈悲心に基づいたリーダーシップ)","benevolence-oriented program (慈悲心に基づいたプログラム)"],"synonyms":["altruistic","compassionate","charitable","philanthropic","humanitarian","kindhearted","generous"],"antonyms":["malevolent","selfish","cruel","misanthropic","egoistic"]}],"etymology":{"value":"The word is formed by combining 'benevolence' (the quality of being well-meaning; kindness) with 'oriented' (directed or focused towards).","priority":"★★★"},"pronunciation":{"ipa":"/bəˈnevələns ˈɔːriˌentɪd/","syllables":"be-nev-o-lence o-ri-ent-ed"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Benevolence-oriented' is used to describe entities, actions, or approaches that are primarily motivated by a desire to do good and show kindness to others. It implies a focus on the well-being and welfare of others, often involving acts of charity, generosity, and compassion.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a benevolence oriented person.","correct":"✓ He is a benevolence-oriented person.","note":"The correct form includes the hyphen between 'benevolence' and 'oriented'."},{"incorrect":"✗ The program is benevolence.","correct":"✓ The program is benevolence-oriented.","note":"'Benevolence' alone is a noun. To describe the program's focus, use the adjective 'benevolence-oriented'."}],"priority":"★★☆"},"related_words":{"derivatives":["benevolence (noun): the quality of being well-meaning; kindness.","oriented (adjective): directed or focused towards something.","benevolent (adjective): well-meaning and kindly."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'benevolence-oriented' is a relatively sophisticated term used to describe something that is focused on doing good and being kind. It's often used in the context of organizations, policies, or approaches that prioritize the well-being of others. The word combines 'benevolence,' which means kindness and generosity, with 'oriented,' which means directed or focused. Therefore, 'benevolence-oriented' signifies a strong emphasis on acting with kindness and goodwill towards others."},"example_sentences":[{"sentence":"The foundation's activities are entirely benevolence-oriented, focusing on providing healthcare and education to underserved communities.","translation":"その財団の活動は完全に慈悲心に基づいたもので、恵まれない地域社会に医療と教育を提供することに焦点を当てています。","type":"adjective","meaning_category":"慈悲心に基づいた"},{"sentence":"The new manager implemented a more benevolence-oriented leadership style, emphasizing empathy and support for her team.","translation":"新しいマネージャーは、より慈悲心に基づいたリーダーシップスタイルを導入し、チームへの共感とサポートを重視しました。","type":"adjective","meaning_category":"博愛主義的な"},{"sentence":"Their benevolence-oriented initiatives have significantly improved the lives of many people in the region.","translation":"彼らの慈悲心を中心としたイニシアチブは、その地域の多くの人々の生活を大幅に改善しました。","type":"adjective","meaning_category":"親切心を中心とした"}]}