{"word":"multimetallist","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"複数の金属のメダルを獲得した選手","english_definition":"An athlete who has won medals in multiple metal categories (gold, silver, bronze) at a sporting event, such as the Olympics or World Championships.","examples":[{"sentence":"The multimetallist was celebrated for their outstanding performance across various events.","translation":"そのマルチメタリストは、様々な種目での傑出したパフォーマンスで称えられた。"},{"sentence":"She became a multimetallist after winning gold, silver, and bronze in different swimming events.","translation":"彼女は異なる水泳種目で金、銀、銅メダルを獲得し、マルチメタリストとなった。"}],"collocations":["Olympic multimetallist","World Championship multimetallist","become a multimetallist","celebrated as a multimetallist"],"synonyms":["medal winner","champion","decorated athlete"],"antonyms":["non-medallist"]},{"part_of_speech":"adjective","definition":"複数の金属のメダルを獲得した","english_definition":"Having won medals in multiple metal categories (gold, silver, bronze).","examples":[{"sentence":"The multimetallist athlete gave an inspiring speech about perseverance.","translation":"マルチメタリストのアスリートは、忍耐力について感動的なスピーチを行った。"},{"sentence":"Her multimetallist status made her a role model for aspiring athletes.","translation":"彼女のマルチメタリストとしての地位は、将来有望なアスリートたちのロールモデルとなった。"}],"collocations":["multimetallist athlete","multimetallist status","multimetallist performance"],"synonyms":["medal-winning","champion"],"antonyms":["non-medallist"]}],"etymology":{"value":"The word is formed by combining \"multi-\" (meaning many or multiple) with \"metall-\" (referring to metals, specifically the medals) and the suffix \"-ist\" (indicating a person who does or is associated with something).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌmʌltɪˈmɛtəlɪst/","syllables":"mul-ti-met-al-list"},"inflection":{"noun_plural":"multimetallists"},"usage_notes":{"explanation":"The term \"multimetallist\" is primarily used in sports contexts to describe athletes who have achieved medal-winning performances across different metal categories (gold, silver, and bronze). It is often used to highlight an athlete's versatility and success in multiple events or disciplines.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a multi-medalist.","correct":"✓ He is a multimetallist.","note":"While \"multi-medalist\" is sometimes used, \"multimetallist\" specifically refers to winning medals of different metals, not just multiple medals. If you mean multiple medals of any kind, \"multi-medalist\" is acceptable, but \"multimetallist\" is more precise when the metals differ."}],"priority":"☆☆☆"},"related_words":{"derivatives":["multi-medalist (multiple medals of any kind)"],"related_terms":["Olympian","athlete","medallist","gold medallist","silver medallist","bronze medallist"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term \"multimetallist\" is a specialized term used in sports to describe an athlete who has won medals of different metals (gold, silver, and bronze) in a sporting event. It is not a commonly used word outside of sports reporting and discussions about athletic achievements. Understanding the term requires a good vocabulary and familiarity with sports terminology."},"example_sentences":[{"sentence":"As a multimetallist, she inspired many young athletes to pursue excellence in their respective sports.","translation":"マルチメタリストとして、彼女は多くの若いアスリートにそれぞれのスポーツで卓越性を追求するよう促した。","type":"noun","meaning_category":"Athlete with multiple metal medals"},{"sentence":"The multimetallist swimmer dominated the competition with her exceptional skills.","translation":"そのマルチメタリストの水泳選手は、卓越したスキルで競技を圧倒した。","type":"adjective","meaning_category":"Having won multiple metal medals"}]}