{"word":"Eimeria","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"アイメリア属：コクシジウム症を引き起こす寄生性原生生物の属","english_definition":"A genus of parasitic protozoans that cause coccidiosis.","examples":[{"sentence":"Eimeria species are common parasites in poultry.","translation":"アイメリア属の種は、家禽によく見られる寄生虫です。"},{"sentence":"Infection with Eimeria can cause significant economic losses in livestock production.","translation":"アイメリアによる感染は、畜産において重大な経済的損失を引き起こす可能性があります。"}],"collocations":["Eimeria infection","Eimeria species","Eimeria oocysts","Eimeria tenella","Eimeria maxima"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Eimeria' is derived from the German zoologist Theodor Eimer (1843-1898).","priority":"★★☆"},"pronunciation":{"ipa":"/aɪˈmɪəriə/","syllables":"Ei-me-ri-a"},"inflection":{"noun_plural":"Eimerias"},"usage_notes":{"explanation":"'Eimeria' refers to a specific genus of protozoan parasites. It is most often encountered in the context of veterinary medicine and animal science, particularly concerning poultry and livestock. The term is used in scientific and technical discussions related to parasitic diseases and their control.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Eimeria is a bacteria.","correct":"✓ Eimeria is a protozoan.","note":"Eimeria is a protozoan parasite, not a bacterium."}],"priority":"★★☆"},"related_words":{"derivatives":["Eimeriidae (family)","coccidiosis (disease caused by Eimeria and related organisms)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Eimeria' is a scientific term used in biology and veterinary medicine. It refers to a genus of parasitic protozoans that cause coccidiosis, a disease affecting various animals, especially poultry. Understanding this term requires a background in biology or related fields."},"example_sentences":[{"sentence":"The study investigated the prevalence of different Eimeria species in chickens.","translation":"その研究では、鶏におけるさまざまなアイメリア属の種の蔓延を調査しました。","type":"noun","meaning_category":"parasitic protozoan"},{"sentence":"Control of Eimeria infection is essential for maintaining healthy poultry flocks.","translation":"アイメリア感染の制御は、健康な家禽群を維持するために不可欠です。","type":"noun","meaning_category":"parasitic protozoan"}]}