{"word":"flag-wavers","priority":"低","meanings":[{"part_of_speech":"名詞","definition":"国旗を振る人、愛国主義者、熱狂的な支持者","english_definition":"People who enthusiastically support their country or a particular cause, often in a demonstrative way, by waving flags or expressing strong patriotic sentiments.","examples":[{"sentence":"The stadium was filled with flag-wavers cheering on their national team.","translation":"スタジアムは国旗を振る人々で埋め尽くされ、自国の代表チームを応援していた。"},{"sentence":"The politician appealed to the flag-wavers in the crowd with his nationalistic rhetoric.","translation":"政治家は愛国的なレトリックで群衆の中の熱狂的な支持者たちに訴えかけた。"},{"sentence":"Some critics accused the film of being overly sentimental and pandering to flag-wavers.","translation":"一部の批評家は、その映画が過度に感傷的で、熱狂的な愛国主義者に媚びていると非難した。"}],"collocations":["patriotic flag-wavers (愛国的な国旗を振る人たち)","enthusiastic flag-wavers (熱狂的な国旗を振る人たち)","nationalistic flag-wavers (国家主義的な国旗を振る人たち)","appealing to flag-wavers (国旗を振る人たちに訴えかける)","criticizing flag-wavers (国旗を振る人たちを批判する)"],"synonyms":["patriots","nationalists","chauvinists","jingoists","supporters","partisans"],"antonyms":["critics","dissenters","objectors","opponents","skeptics"]},{"part_of_speech":"名詞","definition":"(軽蔑的に)盲目的に愛国主義を支持する人","english_definition":"(derogatory) Someone who blindly supports patriotism or a cause.","examples":[{"sentence":"He dismissed them as mere flag-wavers, uninterested in nuanced debate.","translation":"彼は彼らを単なる国旗を振る人たちとして一蹴し、ニュアンスのある議論には興味がないとした。"}],"collocations":["blind flag-wavers (盲目的な国旗を振る人たち)","mere flag-wavers (単なる国旗を振る人たち)"],"synonyms":["zealots","extremists","fanatics"],"antonyms":["moderates","realists"]}],"etymology":{"value":"The term combines \"flag\" (a symbol of a nation or cause) with \"waver\" (someone who waves something, in this case, a flag). It implies active and visible support for a country or ideology.","priority":"低"},"pronunciation":{"ipa":"/ˈflæɡˌweɪvərz/","syllables":"flag-wav-ers"},"inflection":{"noun_plural":"flag-wavers"},"usage_notes":{"explanation":"The term \"flag-wavers\" can be used in both a neutral and a derogatory sense. In a neutral sense, it simply refers to people who enthusiastically support their country or a cause. However, it is often used pejoratively to describe people who are seen as blindly patriotic or nationalistic, without critical thinking or nuanced understanding. The context usually indicates which meaning is intended.","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"The flag-waver is waving the flag.","correct":"The flag-waver is waving the flag. / The flag-wavers are waving the flags.","note":"\"flag-waver\" is a compound noun. The plural form is \"flag-wavers.\""}],"priority":"低"},"related_words":{"derivatives":["flag-waving (名詞: 国旗を振ること、愛国心の誇示)"],"phrases":["wave the flag (国旗を振る、愛国心を誇示する)"],"related_concepts":["patriotism (愛国心)","nationalism (国家主義)","chauvinism (排他的愛国主義)","jingoism (好戦的愛国主義)"]},"level_frequency":{"frequency_google_ngram":"Low","priority":"低"},"readability_explanation":{"level":"C1","text":"The term \"flag-wavers\" refers to people who enthusiastically and often demonstratively support their country or a cause. It can be used neutrally to describe patriotic individuals, but is frequently used in a critical or derogatory way to suggest that someone is blindly or excessively nationalistic. Understanding the context is crucial to interpreting the intended meaning."},"example_sentences":[{"sentence":"The parade was filled with flag-wavers celebrating the national holiday.","translation":"パレードは祝日を祝う国旗を振る人々でいっぱいだった。","type":"neutral"},{"sentence":"The article criticized the government for appealing to flag-wavers with simplistic solutions.","translation":"記事は政府が単純な解決策で熱狂的な愛国主義者に訴えかけていると批判した。","type":"derogatory"}]}