{"word":"Crypto-Catholic","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"秘密カトリック教徒、隠れカトリック教徒：公にはカトリック教徒であることを隠しているが、実際にはカトリックの信仰を保持している人。","english_definition":"A person who secretly adheres to Roman Catholicism while outwardly professing another faith or no faith at all.","examples":[{"sentence":"During the Reformation, many Crypto-Catholics practiced their faith in secret.","translation":"宗教改革の時代、多くの隠れカトリック教徒が秘密裏に信仰を守った。"},{"sentence":"Some historians believe that certain members of the court were Crypto-Catholics.","translation":"一部の歴史家は、宮廷の特定のメンバーが隠れカトリック教徒だったと考えている。"}],"collocations":["secret Catholic","hidden Catholic","underground Catholic"],"synonyms":["secret Catholic","closet Catholic"],"antonyms":["open Catholic","professed Catholic"],"notes":"主に歴史的な文脈で使用される言葉で、宗教的な迫害や差別があった時代に、自身の信仰を隠さざるを得なかった人々を指します。現代では、自身の信仰を公にしないカトリック教徒を指す場合もありますが、その場合は「private Catholic」のような表現がより適切かもしれません。","origin":"「Crypto-」は「隠れた、秘密の」という意味の接頭辞で、「Catholic」は「カトリック教徒」を意味します。"}],"etymology":{"value":"The term combines the prefix 'crypto-' (from Greek kryptos, meaning 'hidden' or 'secret') with 'Catholic,' referring to a person who secretly adheres to Catholic beliefs and practices while outwardly professing another faith or no faith at all.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkrɪptoʊˈkæθəlɪk/","syllables":"cryp-to-cath-o-lic"},"inflection":{"noun_plural":"Crypto-Catholics"},"usage_notes":{"explanation":"The term 'Crypto-Catholic' is primarily used in historical contexts to describe individuals who practiced Catholicism in secret due to religious persecution or discrimination. It can also refer to someone who privately holds Catholic beliefs without publicly identifying as Catholic. The term carries a connotation of secrecy and potential risk associated with openly professing the Catholic faith.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a crypto-Catholic because he goes to church every Sunday.","correct":"✓ He is a devout Catholic and goes to church every Sunday.","note":"If someone openly practices Catholicism, they are not a Crypto-Catholic. The term implies secrecy."},{"incorrect":"✗ She is crypto-Catholic, but everyone knows she is Catholic.","correct":"✓ She is secretly a Catholic, but everyone suspects it.","note":"The 'crypto-' prefix implies that the person's Catholic faith is not openly known."}],"priority":"★★☆"},"related_words":{"derivatives":["crypto- (prefix meaning hidden or secret)","Catholic (adherent of the Roman Catholic Church)"],"related_terms":["Nicodemite (similar concept, referring to secret Protestants)","dissenter (general term for those who disagree with the established religion)","recusant (historical term for English Catholics who refused to attend Anglican services)"],"priority":"★★☆"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency - primarily used in historical or specialized religious discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Crypto-Catholic' is a specialized term used to describe someone who secretly adheres to Catholic beliefs while outwardly professing another faith or no faith at all. It is most often encountered in historical contexts, particularly when discussing periods of religious persecution. The term implies a deliberate concealment of one's Catholic identity due to potential negative consequences. Understanding the term requires knowledge of the prefix 'crypto-' and the historical context in which it is used."},"example_sentences":[{"sentence":"During the reign of Queen Elizabeth I, many English Catholics were forced to become Crypto-Catholics to avoid persecution.","translation":"エリザベス1世の治世中、多くのイングランドのカトリック教徒は迫害を避けるために隠れカトリック教徒になることを余儀なくされた。","type":"historical context","meaning_category":"secret adherence to Catholicism"},{"sentence":"The historian argued that several prominent figures in the court were actually Crypto-Catholics, influencing policy from behind the scenes.","translation":"歴史家は、宮廷の著名な人物の何人かが実際には隠れカトリック教徒であり、舞台裏から政策に影響を与えていたと主張した。","type":"historical interpretation","meaning_category":"secret influence"},{"sentence":"In some regions where Catholicism is suppressed, Crypto-Catholics continue to practice their faith in secret.","translation":"カトリック教が抑圧されている地域では、隠れカトリック教徒は秘密裏に信仰を守り続けている。","type":"contemporary context","meaning_category":"secret practice of faith"},{"sentence":"The novel explores the challenges faced by a family of Crypto-Catholics in a predominantly Protestant society.","translation":"その小説は、プロテスタント社会で隠れカトリック教徒の家族が直面する困難を描いている。","type":"fictional representation","meaning_category":"challenges of secret faith"}]}