{"word":"Newburyport","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ニューベリーポート：アメリカ合衆国マサチューセッツ州にある都市。メリマック川の河口に位置する港町。","english_definition":"A city in Massachusetts, United States, located at the mouth of the Merrimack River. It is a historic seaport.","examples":[{"sentence":"Newburyport is known for its historic architecture and maritime history.","translation":"ニューベリーポートは、その歴史的な建築物と海洋史で知られています。"},{"sentence":"We visited the waterfront in Newburyport.","translation":"私たちはニューベリーポートのウォーターフロントを訪れました。"}],"collocations":["Newburyport, MA","Newburyport waterfront","historic Newburyport"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"ニューベリーポートは、元々ニューベリーの一部だったが、後に港町として発展し、分離して独立した都市となった。地名は、イギリスのニューベリーに由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnuːˌbɛriˌpɔrt/","syllables":"New-bu-ry-port"},"inflection":{},"usage_notes":{"explanation":"ニューベリーポートは、アメリカ合衆国マサチューセッツ州エセックス郡にある都市です。メリマック川の河口に位置し、歴史的な港町として知られています。観光地としても人気があり、美しい建築物やウォーターフロント、博物館などがあります。","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":[],"related_places":["Newbury (隣接する町)","Amesbury (近隣の町)","Salisbury (近隣の町)"],"priority":"★★☆"},"level_frequency":{},"readability_explanation":{"level":"B2","text":"Newburyport is a place name, specifically a city in Massachusetts. You would typically encounter this word in the context of American geography, history, or travel. Understanding this word requires knowledge of American place names and some familiarity with New England.","priority":"★★☆"},"example_sentences":[{"sentence":"We spent the weekend in Newburyport, exploring the shops and restaurants.","translation":"週末はニューベリーポートで過ごし、お店やレストランを散策しました。","type":"example","meaning_category":"場所"},{"sentence":"The history of Newburyport is closely tied to the maritime industry.","translation":"ニューベリーポートの歴史は、海運業と密接に結びついています。","type":"example","meaning_category":"歴史"},{"sentence":"Newburyport is a popular tourist destination in Massachusetts.","translation":"ニューベリーポートは、マサチューセッツ州で人気の観光地です。","type":"example","meaning_category":"観光"}]}