{"word":"commendator","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史)聖職禄の受禄者、特に修道院の収入を享受する世俗の人物","english_definition":"(historical) A person who holds a benefice in commendam, especially a lay person enjoying the revenues of a monastery.","examples":[{"sentence":"The commendator received the income from the abbey without performing its religious duties.","translation":"コメンダトールは修道院の宗教的義務を果たすことなく、その収入を受け取った。"}],"collocations":[],"synonyms":["beneficiary","patron","administrator"],"antonyms":[]}],"etymology":{"value":"From Medieval Latin commendator, from Latin commendare (to entrust, recommend).","priority":"★★★"},"pronunciation":{"ipa":"/kəˈmɛndeɪtər/","syllables":"co-men-da-tor"},"inflection":{"noun_plural":"commendators"},"usage_notes":{"explanation":"The term 'commendator' is primarily historical, referring to a practice where ecclesiastical revenues were granted to individuals, often lay persons, without the requirement to perform the associated religious duties. This practice was particularly prevalent in the later Middle Ages and the Renaissance.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["commendam (noun: holding a benefice in commendam)","commend (verb: to praise, recommend)","commendation (noun: praise, recommendation)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'commendator' is a rare and specialized term primarily encountered in historical contexts, particularly when discussing ecclesiastical history and the practice of commendam. It refers to an individual who received the revenues of a church benefice or monastery without necessarily performing the associated religious duties. Due to its limited usage and specific historical context, it is not commonly used or understood outside of academic or specialized discussions."},"example_sentences":[{"sentence":"As commendator, he controlled the abbey's finances but rarely visited the site.","translation":"コメンダトールとして、彼は修道院の財政を管理したが、その場所を訪れることはめったになかった。","type":"noun","meaning_category":"聖職禄の受禄者"},{"sentence":"The king appointed a trusted advisor as commendator of the wealthy monastery.","translation":"王は信頼する顧問を、裕福な修道院のコメンダトールに任命した。","type":"noun","meaning_category":"聖職禄の受禄者"}]}