{"word":"pettedly","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"意地悪く、けちけちと、ささいなことにこだわって","english_definition":"In a petty manner; in a way that shows meanness, spite, or a concern with trivial matters.","examples":[{"sentence":"He pettedly refused to share his toys with the other children.","translation":"彼は意地悪く他の子供たちにおもちゃを分け与えるのを拒否した。"},{"sentence":"She pettedly complained about the smallest details of the event.","translation":"彼女はそのイベントの最も小さな詳細について、けちけちと文句を言った。"},{"sentence":"The manager pettedly scrutinized every expense report, looking for any excuse to deny reimbursement.","translation":"そのマネージャーは、払い戻しを拒否する口実を探して、すべての経費報告書をささいなことにこだわって精査した。"}],"collocations":["act pettedly","behave pettedly","complain pettedly","refuse pettedly","scrutinize pettedly"],"synonyms":["meanly","spitefully","narrow-mindedly","small-mindedly","ungenerously","stingily","miserly","churlishly"],"antonyms":["generously","magnanimously","nobly","kindly","altruistically"]}],"etymology":{"value":"Derived from the adjective \"petty\" (meaning small, insignificant, or mean) and the adverbial suffix \"-ly\".","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɛtɪdli/","syllables":"pet-ti-dly"},"inflection":{"notes":"Adverb, so it does not inflect for number or gender."},"usage_notes":{"explanation":"\"Pettedly\" describes actions or behaviors that are characterized by a focus on trivial or insignificant details, often with a negative or spiteful intent. It suggests a lack of generosity, magnanimity, or a broader perspective. The actions are often seen as childish, immature, or unbecoming.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted pettily, it was obvious.","correct":"✓ He acted pettedly; it was obvious.","note":"The correct adverbial form is \"pettedly,\" not \"pettily.\" Although \"pettily\" exists, \"pettedly\" is the more precise and descriptive form when emphasizing the petty nature of the action."},{"incorrect":"✗ She pettedly because she was sad.","correct":"✓ She acted pettedly because she was sad.","note":"\"Pettedly\" is an adverb and needs a verb to modify.  You need a verb like 'acted' or 'behaved' to use it correctly."}],"priority":"★★☆"},"related_words":{"derivatives":["petty (adjective)","pettiness (noun)"],"phrases":["petty crime","petty cash","petty officer"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Pettedly\" describes doing something in a mean or small-minded way, focusing on unimportant details to be annoying or spiteful. It's not a common word, so you'll mostly find it in writing where the author wants to show someone is acting in a very small and unpleasant manner. It's related to the word \"petty,\" which means unimportant or trivial, but also can mean mean-spirited.","priority":"★★☆"},"example_sentences":[{"sentence":"The siblings pettedly argued over who got the bigger slice of cake.","translation":"兄弟姉妹は、どちらがケーキの大きい方のスライスを手に入れるかで意地悪く言い争った。","type":"adverb","meaning_category":"Meanly arguing over insignificant details"},{"sentence":"The disgruntled employee pettedly sabotaged the project by making minor, hard-to-detect errors.","translation":"不満を抱いた従業員は、検出が困難な小さなエラーを加えて、プロジェクトを意地悪く妨害した。","type":"adverb","meaning_category":"Sabotaging something in a small-minded way"},{"sentence":"Instead of addressing the real issues, he pettedly focused on irrelevant details during the meeting.","translation":"彼は本当の問題に取り組む代わりに、会議中に関係のない詳細に意地悪く焦点を当てた。","type":"adverb","meaning_category":"Focusing on irrelevant details"}]}