{"word":"verminly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"不潔に、害虫のように","english_definition":"In a manner resembling vermin; filthily; like pests.","examples":[{"sentence":"The old house was verminly infested with rats and mice.","translation":"その古い家はネズミやハツカネズミが害虫のように蔓延していた。"},{"sentence":"He lived verminly, surrounded by filth and decay.","translation":"彼は不潔に暮らし、汚物と腐敗に囲まれていた。"}],"collocations":["verminly infested","live verminly"],"synonyms":["filthily","repulsively","disgustingly","pestilently"],"antonyms":["cleanly","hygienically"]}],"etymology":{"value":"Derived from the word 'vermin' (meaning noxious, objectionable, or disgusting animals collectively, especially those of small size that appear commonly and are difficult to control) with the addition of the suffix '-ly' to form an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvɜːrmɪnli/","syllables":"ver-min-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Verminly' is an adverb that describes something done in a manner resembling vermin. It implies a state of being filthy, infested, or generally unpleasant, similar to conditions associated with pests or vermin. It is not a commonly used word and often carries a negative connotation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The garden was verminly beautiful.","correct":"✓ The garden was beautifully maintained.","note":"'Verminly' has negative connotations and should not be used to describe something positive or beautiful."}],"priority":"★★☆"},"related_words":{"derivatives":["vermin (noun)","verminous (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly used)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Verminly' is a rare and highly specific adverb. It's used to describe something done in a way that is filthy or infested with pests, similar to how vermin would behave or exist. Due to its strong negative connotation and infrequent use, it is more likely to be encountered in advanced or specialized contexts."},"example_sentences":[{"sentence":"The abandoned building was verminly crawling with insects.","translation":"その廃墟は虫が害虫のように這っていた。","type":"adverb","meaning_category":"不潔に、害虫のように"},{"sentence":"They treated the prisoners verminly, denying them basic sanitation.","translation":"彼らは囚人を不潔に扱い、基本的な衛生を拒否した。","type":"adverb","meaning_category":"不潔に、害虫のように"}]}