{"word":"endocrine-deficient","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"内分泌欠乏の、内分泌機能不全の","english_definition":"Suffering from a deficiency in the production or function of endocrine hormones.","examples":[{"sentence":"The patient was diagnosed as endocrine-deficient, requiring hormone replacement therapy.","translation":"その患者は内分泌欠乏と診断され、ホルモン補充療法が必要となった。"},{"sentence":"Endocrine-deficient conditions can lead to a variety of metabolic disorders.","translation":"内分泌欠乏状態は、さまざまな代謝異常を引き起こす可能性がある。"}],"collocations":["endocrine-deficient patient","endocrine-deficient condition","endocrine-deficient state"],"synonyms":["hormone-deficient","hypoendocrine"],"antonyms":["endocrine-excessive","hormone-excessive"]}],"etymology":{"value":"The term is formed by combining 'endocrine' (relating to endocrine glands and hormones) with 'deficient' (lacking or insufficient).","priority":"☆☆☆"},"pronunciation":{"ipa":"ˌɛndoʊkrɪn dɪˈfɪʃənt","syllables":"en-do-crine de-fi-cient"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Endocrine-deficient' describes a state where the endocrine system does not produce enough hormones or the hormones do not function properly. This can result from various causes, including gland damage, genetic disorders, or autoimmune diseases. Diagnosis typically involves hormone level testing, and treatment often includes hormone replacement therapy.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The endocrine deficient patient was treated.","correct":"✓ The endocrine-deficient patient was treated.","note":"Hyphenation is important for clarity. 'Endocrine-deficient' acts as a single adjective modifying 'patient'."}],"priority":"☆☆☆"},"related_words":{"derivatives":["endocrine","deficiency","hormone","hypothyroidism","hypogonadism"],"priority":"☆☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in medical contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Endocrine-deficient' is a technical term used in medicine to describe a condition where the endocrine system does not produce enough hormones or the hormones do not function properly. It is typically used by medical professionals and in scientific literature. Understanding requires knowledge of endocrinology."},"example_sentences":[{"sentence":"The endocrine-deficient state led to severe metabolic imbalances.","translation":"内分泌欠乏状態は、重度の代謝不均衡を引き起こした。","type":"general","meaning_category":"medical condition"},{"sentence":"Early diagnosis of endocrine-deficient disorders is crucial for effective treatment.","translation":"内分泌欠乏症の早期診断は、効果的な治療のために非常に重要である。","type":"medical","meaning_category":"diagnosis"}]}