{"word":"nonsubstantially","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"実質的でない程度に、重要でない程度に","english_definition":"In a manner that is not substantial or significant; to a degree that is minor or inconsequential.","examples":[{"sentence":"The changes to the policy were nonsubstantially different from the original.","translation":"その方針の変更は、元の方針と実質的に異なっていなかった。"},{"sentence":"The error affected the outcome nonsubstantially.","translation":"そのエラーは結果に重要でない程度に影響を与えた。"},{"sentence":"The company's profits increased nonsubstantially this quarter.","translation":"今四半期、その会社の利益は重要でない程度に増加した。"}],"collocations":["nonsubstantially different","nonsubstantially affect","nonsubstantially increase"],"synonyms":["inconsequentially","insignificantly","minimally","slightly","trivially","immaterially"],"antonyms":["substantially","significantly","materially","considerably"]}],"etymology":{"value":"Derived from 'nonsubstantial,' which combines the prefix 'non-' (meaning 'not') with 'substantial' (meaning 'considerable in amount, quantity, or importance). The addition of '-ly' transforms the adjective into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒn.səbˈstæn.ʃəl.i/","syllables":"non-sub-stan-tial-ly"},"inflection":{"notes":"Adverbs do not typically inflect. This word does not have different forms based on tense or number."},"usage_notes":{"explanation":"'Nonsubstantially' is used to indicate that something is different, changed, or affected, but to such a small degree that it is not considered important or meaningful. It is often used in legal, financial, or technical contexts where precision is important.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The item was nonsubstantially damaged. (implying it was not damaged at all)","correct":"✓ The item was slightly damaged.","note":"If you mean there was no damage, use 'undamaged' or 'not damaged.' 'Nonsubstantially damaged' implies there was some damage, but it was minor."},{"incorrect":"✗ The two reports were nonsubstantially the same.","correct":"✓ The two reports were substantially the same.","note":"If you want to say they were mostly the same, use 'substantially the same.' 'Nonsubstantially the same' is a double negative and is confusing."}],"priority":"★★☆"},"related_words":{"derivatives":["nonsubstantial (adjective)","substantially (adverb)","substantial (adjective)","insubstantial (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nonsubstantially' means 'not in a significant way.' It's used when something changes a little, but not enough to matter much. You'll often see it in formal writing, especially when talking about laws, money, or science. Because it's a long word with a negative prefix, it's not used very often in everyday conversation. It's important to use it correctly to avoid confusion, as it implies a small difference does exist, rather than no difference at all."},"example_sentences":[{"sentence":"The new evidence presented at trial differed nonsubstantially from the evidence already reviewed.","translation":"裁判で提示された新しい証拠は、すでに検討された証拠と実質的に異なっていなかった。","type":"adverb","meaning_category":"実質的でない程度に"},{"sentence":"The company's environmental impact was nonsubstantially affected by the new regulations.","translation":"その会社の環境への影響は、新しい規制によって重要でない程度に影響を受けた。","type":"adverb","meaning_category":"重要でない程度に"},{"sentence":"The software update changed the user interface nonsubstantially.","translation":"そのソフトウェアのアップデートは、ユーザーインターフェースを実質的に変更しなかった。","type":"adverb","meaning_category":"実質的でない程度に"}]}