{"word":"sloubbie","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(slang, Netherlands) A person who is considered to be of low social status, often unemployed, uneducated, and living in poverty.","english_definition":"(slang, Netherlands) A person who is considered to be of low social status, often unemployed, uneducated, and living in poverty.","examples":[{"sentence":"Die persoon is echt een sloubbie, hij doet niks anders dan de hele dag op de bank zitten.","translation":"That person is really a sloubbie, he does nothing but sit on the couch all day.","note":"This example illustrates the derogatory use of the term."}],"collocations":[],"synonyms":["underclass","chav","scum"],"antonyms":["elite","upper class"]}],"etymology":{"value":"The origin of the word is uncertain, but it is believed to have originated in the Netherlands as a derogatory term for people of low socioeconomic status.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈslʌbi/","syllables":"sloub-bie"},"inflection":{"noun_plural":"sloubbies"},"usage_notes":{"explanation":"'Sloubbie' is a derogatory term used in the Netherlands to describe individuals perceived as being of low social standing, often characterized by unemployment, lack of education, and poverty. It carries strong negative connotations.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Sloubbie' is a slang term with strong negative connotations, primarily used in the Netherlands to describe people of low social status. It's important to be aware of the term's derogatory nature and use it with caution, if at all."},"example_sentences":[{"sentence":"Hij wordt door sommigen gezien als een typische sloubbie.","translation":"He is seen by some as a typical sloubbie.","type":"noun","meaning_category":"Person of low social status"}]}