{"word":"dinarchies","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"Plural form of dinarchy. A dinarchy is a form of government where power is held by two individuals or entities.","english_definition":"The plural of dinarchy, which is a form of government in which power is held by two individuals or entities.","examples":[{"sentence":"Throughout history, there have been several examples of dinarchies, such as the dual monarchy of Austria-Hungary.","translation":"歴史を通して、オーストリア＝ハンガリー二重帝国のように、いくつかの二頭政治の例がありました。"},{"sentence":"The Roman Republic, with its two consuls, could be considered a form of dinarchy.","translation":"二人の執政官を擁する共和政ローマは、二頭政治の一形態とみなすことができる。"}],"collocations":["dual leadership","joint rule","co-rulership"],"synonyms":["duumvirate","dyarchy"],"antonyms":["monarchy","oligarchy","democracy"]}],"etymology":{"value":"Derived from the Greek words 'di-' (meaning two) and 'arche' (meaning rule or government).","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˈnɑːrkiz/","syllables":"di-nar-chies"},"inflection":{"noun_plural":"dinarchies"},"usage_notes":{"explanation":"The term 'dinarchy' is relatively uncommon. It refers to a system where two individuals or entities share power. It is distinct from a monarchy (rule by one), an oligarchy (rule by a few), or a democracy (rule by the people). Examples are rare, but the Roman Republic with its two consuls, or historical dual monarchies, are often cited.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The country was ruled by a dinarchy of families.","correct":"✓ The country was ruled by an oligarchy of families.","note":"A dinarchy involves two rulers, while an oligarchy involves a small group. Ensure the correct term is used based on the number of rulers."}],"priority":"★★☆"},"related_words":{"derivatives":["dinarchic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Dinarchies' refers to a form of government where two individuals or entities share power. This term is not commonly used and is more frequently found in academic or historical contexts when discussing specific political systems. Understanding this term requires a good grasp of political science vocabulary."},"example_sentences":[{"sentence":"The ancient city-state experimented with various forms of government, including brief periods of **dinarchies**.","translation":"古代都市国家は、短期間の二頭政治を含む、さまざまな形態の政府を試みました。","type":"noun","meaning_category":"form of government"},{"sentence":"Historians debate whether the joint rule of the two emperors constituted a true **dinarchy**.","translation":"歴史家たちは、二人の皇帝による共同統治が真の二頭政治を構成したかどうかについて議論しています。","type":"noun","meaning_category":"form of government"}]}