{"word":"Suramin","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"スラミン: 主にアフリカ睡眠病やオンコセルカ症（河川盲目症）の治療に用いられる薬","english_definition":"A polysulfonated naphthylurea used to treat African trypanosomiasis (sleeping sickness) and onchocerciasis (river blindness).","examples":[{"sentence":"Suramin is effective against the early stages of African sleeping sickness.","translation":"スラミンはアフリカ睡眠病の初期段階に効果的です。"},{"sentence":"The drug suramin is administered intravenously.","translation":"薬物のスラミンは静脈内投与されます。"}],"collocations":["suramin sodium","suramin therapy","suramin treatment"],"synonyms":["Antrypol","Germanin","Fourneau 309"],"antonyms":[]}],"etymology":{"value":"Derived from 'sur-' (meaning 'superior' or 'over'), 'am-' (referring to an amine group), and '-in' (a common suffix for chemical substances).","priority":"★★☆"},"pronunciation":{"ipa":"ˈsʊrəmɪn","syllables":"Su-ra-min"},"inflection":{"notes":"It is a noun, so it has no plural form."},"usage_notes":{"explanation":"Suramin is a medication used to treat specific parasitic infections, primarily African trypanosomiasis (sleeping sickness) and onchocerciasis (river blindness). It is administered intravenously and is effective in the early stages of sleeping sickness.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Suramin is a antibiotic.","correct":"✓ Suramin is an antiparasitic drug.","note":"Suramin is not an antibiotic; it is an antiparasitic drug used to treat parasitic infections."}],"priority":"★★☆"},"related_words":{"derivatives":["Suramin sodium"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Suramin is a complex term referring to a specific medication used to treat parasitic infections, particularly African trypanosomiasis and onchocerciasis. Understanding its use requires knowledge of medical terminology and infectious diseases. It is not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The doctor prescribed suramin for the patient's sleeping sickness.","translation":"医師は患者の睡眠病にスラミンを処方した。","type":"noun","meaning_category":"medication"},{"sentence":"Suramin inhibits several enzymes involved in DNA replication.","translation":"スラミンはDNA複製に関与するいくつかの酵素を阻害する。","type":"noun","meaning_category":"pharmacology"}]}