{"word":"lippered","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"分厚い唇の、だらしない唇の","english_definition":"Having thick or prominent lips; having lips that are loose or drooping.","examples":[{"sentence":"The old man had a lippered face, his mouth slightly agape.","translation":"その老人は分厚い唇をしており、口はわずかに開いていた。"},{"sentence":"A caricature often depicts someone with exaggerated, lippered features.","translation":"風刺画では、誇張された分厚い唇の特徴を持つ人物が描かれることが多い。"}],"collocations":["lippered face","lippered mouth","thick-lippered","full-lippered"],"synonyms":["thick-lipped","full-lipped","blubber-lipped","pouting"],"antonyms":["thin-lipped"],"notes":"The term can sometimes be considered offensive depending on the context and intent. It is more descriptive than pejorative in neutral contexts."}],"etymology":{"value":"Derived from 'lip' + '-ered' (suffix indicating possession or characteristic).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɪpərd/","syllables":"lip-pered"},"inflection":{"adjective_forms":{"comparative":"more lippered","superlative":"most lippered"}},"usage_notes":{"explanation":"'Lippered' is primarily a descriptive adjective referring to the physical appearance of someone's lips. While generally neutral, its use can be perceived negatively if used in a derogatory or mocking manner. Consider the context carefully when using this word.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lippered sound of the waves was soothing.","correct":"✓ The lapping sound of the waves was soothing.","note":"'Lippered' describes lips, not sounds. Use 'lapping' or another appropriate adjective for sounds."}],"priority":"★☆☆"},"related_words":{"derivatives":["lip (noun)","lipped (adjective - general term for having lips)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lippered' is a relatively uncommon adjective used to describe someone with prominent or thick lips. It's important to use this word carefully, as it can be considered insensitive or offensive depending on the context and how it's used. It's more often found in descriptive literature than in everyday conversation."},"example_sentences":[{"sentence":"The statue had a distinctly lippered mouth, which gave it a somewhat comical appearance.","translation":"その彫像は明らかに分厚い唇をしており、どことなく滑稽な印象を与えた。","type":"adjective","meaning_category":"Descriptive"},{"sentence":"He was described as a lippered man with a jovial demeanor.","translation":"彼は陽気な態度をした分厚い唇の男として描写された。","type":"adjective","meaning_category":"Descriptive"}]}