{"word":"pro-choicer","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(妊娠中絶の)選択支持者、中絶容認派","english_definition":"An individual who supports the legality of abortion, believing that a pregnant woman should have the right to choose whether or not to terminate her pregnancy.","examples":[{"sentence":"Pro-choicers argue that abortion is a matter of reproductive freedom.","translation":"選択支持者たちは、中絶はリプロダクティブ・フリーダムの問題だと主張する。"},{"sentence":"She identifies as a pro-choicer and actively advocates for abortion rights.","translation":"彼女は中絶容認派を自認し、中絶の権利を積極的に擁護している。"}],"collocations":["pro-choice movement (選択支持運動)","pro-choice advocate (選択支持の提唱者)","pro-choice stance (選択支持の立場)"],"synonyms":["abortion rights supporter","reproductive rights advocate"],"antonyms":["pro-lifer","anti-abortionist"]},{"part_of_speech":"adjective","definition":"(妊娠中絶の)選択支持の、中絶容認の","english_definition":"Supporting the legality of abortion and the right of a pregnant woman to choose whether or not to terminate her pregnancy.","examples":[{"sentence":"The politician has a consistently pro-choice voting record.","translation":"その政治家は一貫して中絶容認の投票記録を持っている。"},{"sentence":"The organization is known for its pro-choice activism.","translation":"その組織は中絶容認の活動で知られている。"}],"collocations":["pro-choice policy (選択支持政策)","pro-choice legislation (選択支持の法律)","pro-choice organization (選択支持団体)"],"synonyms":["abortion rights","reproductive rights"],"antonyms":["pro-life","anti-abortion"]}],"etymology":{"value":"A compound word formed from 'pro-' (supporting) and 'choice' (referring to the choice to have an abortion). The term emerged in the context of the abortion debate to represent those who advocate for the legal right to abortion.","priority":"★★★"},"pronunciation":{"ipa":"/ˌproʊˈtʃɔɪsər/","syllables":"pro-choic-er"},"inflection":{"noun_plural":"pro-choicers"},"usage_notes":{"explanation":"The term 'pro-choicer' is used to describe individuals or groups who believe that women should have the legal right to choose whether or not to have an abortion. It is often used in contrast to 'pro-lifer,' which describes those who oppose abortion. The term is politically charged and can be seen as biased depending on the user's perspective.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a pro-choice.","correct":"✓ She is a pro-choicer.","note":"'Pro-choice' is an adjective, while 'pro-choicer' is the noun referring to a person who supports abortion rights."},{"incorrect":"✗ Pro-choicers believe in abortion.","correct":"✓ Pro-choicers believe in the right to choose abortion.","note":"Pro-choicers support the right to choose, not necessarily the act of abortion itself."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["pro-life","abortion","abortion rights","reproductive rights","Roe v. Wade"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively infrequent, but common in political and social discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'pro-choicer' is used in discussions about abortion rights. It refers to someone who believes that a woman should have the legal right to choose whether or not to have an abortion. It's important to understand that this term is often used in contrast to 'pro-lifer,' who opposes abortion. The debate around these terms can be sensitive, so it's important to use them with awareness of the different viewpoints involved."},"example_sentences":[{"sentence":"Many **pro-choicers** advocate for access to safe and legal abortion services.","translation":"多くの中絶容認派は、安全で合法的な中絶サービスへのアクセスを提唱している。","type":"noun","meaning_category":"選択支持者"},{"sentence":"The candidate's **pro-choice** stance on abortion was a key issue in the election.","translation":"その候補者の中絶に対する選択支持の立場は、選挙における重要な争点だった。","type":"adjective","meaning_category":"選択支持の"}]}