{"word":"Orthopteroid","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"直翅(ちょくし)上目(もく)に属する","english_definition":"Belonging to the superorder Orthopteroidea.","examples":[{"sentence":"Orthopteroid insects include grasshoppers, crickets, and katydids.","translation":"直翅上目の昆虫には、バッタ、コオロギ、キリギリスなどが含まれます。"}],"collocations":[],"synonyms":["orthopteran"],"antonyms":[]},{"part_of_speech":"noun","definition":"直翅上目の昆虫","english_definition":"An insect belonging to the superorder Orthopteroidea.","examples":[{"sentence":"The orthopteroid is characterized by its chewing mouthparts and gradual metamorphosis.","translation":"直翅上目の昆虫は、咀嚼(そしゃく)口器と不完全変態を特徴とします。"}],"collocations":[],"synonyms":["orthopteran"],"antonyms":[]}],"etymology":{"value":"\"Ortho-\" (straight) + \"pteron\" (wing) + \"-oid\" (resembling). Refers to the straight wings characteristic of many insects in this group.","priority":"★★☆"},"pronunciation":{"ipa":"/ɔːrˈθɒptərɔɪd/","syllables":"Or-thop-ter-oid"},"inflection":{},"usage_notes":{"explanation":"The term \"Orthopteroid\" refers to a group of insects that were formerly classified within the order Orthoptera. Modern taxonomy has reclassified these insects into a superorder, Orthopteroidea, which includes several orders. The term is often used in entomology and zoology contexts.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Orthoptera","Orthopteroidea"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"\"Orthopteroid\" is a technical term used in entomology to classify a group of insects. It is derived from the Greek words for \"straight wing\" and refers to insects that were previously classified in the order Orthoptera but are now grouped into the superorder Orthopteroidea. This term is primarily encountered in scientific contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The orthopteroid insects are known for their jumping abilities.","translation":"直翅上目の昆虫は、跳躍能力で知られています。","type":"adjective","meaning_category":"直翅上目に属する"},{"sentence":"Many orthopteroid species are herbivores, feeding on plants.","translation":"多くの直翅上目の種は草食性で、植物を食べています。","type":"noun","meaning_category":"直翅上目の昆虫"}]}