{"word":"non-emulsifiable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"乳化しない、乳化できない","english_definition":"Not capable of being emulsified; unable to form a stable emulsion.","examples":[{"sentence":"This oil is non-emulsifiable in water.","translation":"この油は水に乳化しない。"},{"sentence":"A non-emulsifiable substance will separate into layers when mixed with water.","translation":"非乳化性の物質は、水と混合すると層に分離する。"}],"collocations":["non-emulsifiable oil","non-emulsifiable mixture"],"synonyms":["immiscible","unmixable","non-miscible"],"antonyms":["emulsifiable"]},{"part_of_speech":"adjective","definition":"乳化剤を加えても乳化しない","english_definition":"Remaining unable to form a stable emulsion even with the addition of an emulsifier.","examples":[{"sentence":"Even with vigorous mixing and the addition of an emulsifier, the solution remained non-emulsifiable.","translation":"激しく混合し、乳化剤を添加しても、溶液は乳化しないままであった。"}],"collocations":["non-emulsifiable even with emulsifier"],"synonyms":["emulsion-resistant"],"antonyms":["emulsifiable with emulsifier"]}],"etymology":{"value":"The word is formed by adding the prefix \"non-\" (meaning \"not\") to \"emulsifiable,\" which itself comes from \"emulsify\" (to form an emulsion) and the suffix \"-able\" (capable of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnɪˈmʌlsɪfaɪəbəl/","syllables":"non-e-mul-si-fi-a-ble"},"inflection":{"notes":"Adjectives do not typically inflect in English, aside from comparative and superlative forms (which are rarely used for this word)."},"usage_notes":{"explanation":"\"Non-emulsifiable\" describes substances that do not readily form a stable emulsion, which is a mixture of two or more liquids that are normally immiscible (unmixable or unblendable). The term is commonly used in chemistry, food science, and engineering to describe materials that resist emulsification. It's important to note that some substances may be non-emulsifiable under certain conditions (e.g., without an emulsifier or at certain temperatures) but can be emulsified under different conditions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The non-emulsifiable liquid emulsified easily.","correct":"✓ The non-emulsifiable liquid did not emulsify easily.","note":"A non-emulsifiable liquid, by definition, does not emulsify easily."},{"incorrect":"✗ This is a non-emulsionable substance.","correct":"✓ This is a non-emulsifiable substance.","note":"The correct term is \"non-emulsifiable,\" not \"non-emulsionable.\""}],"priority":"★★☆"},"related_words":{"derivatives":["non-emulsification (noun)"],"phrases":["emulsifiable","emulsify","emulsion","emulsifier"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. A technical term used in specific fields.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Non-emulsifiable\" is a technical term primarily used in scientific and industrial contexts. It describes a substance's inability to form a stable emulsion, which is a mixture where tiny droplets of one liquid are dispersed within another (like oil in water). The term is the opposite of \"emulsifiable,\" meaning capable of forming an emulsion. Understanding this term requires a basic grasp of chemistry and the concept of emulsions."},"example_sentences":[{"sentence":"The cleaning solvent was specifically chosen for its non-emulsifiable properties to prevent it from mixing with water during the cleaning process.","translation":"洗浄溶剤は、洗浄プロセス中に水と混ざらないように、その非乳化性の特性のために特別に選択された。","type":"adjective","meaning_category":"unable to form an emulsion"},{"sentence":"Due to its non-emulsifiable nature, the oil quickly separated from the vinegar in the salad dressing.","translation":"その非乳化性の性質のため、サラダドレッシング中の油はすぐに酢から分離した。","type":"adjective","meaning_category":"unable to form an emulsion"}]}