{"word":"narrow-span","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"狭いスパンの、短いスパンの","english_definition":"Having a short distance between supports or endpoints; covering a small range or extent.","examples":[{"sentence":"The bridge was a narrow-span structure, designed for light traffic.","translation":"その橋は狭いスパンの構造で、軽い交通量のために設計された。"},{"sentence":"The narrow-span shelving unit fit perfectly in the small alcove.","translation":"その狭いスパンの棚ユニットは、小さなアルコーブにぴったり収まった。"}],"collocations":["narrow-span bridge","narrow-span shelving","narrow-span construction"],"synonyms":["short-span","small-span","close-span"],"antonyms":["wide-span","long-span"],"related_words":["span","narrow","short"]}],"etymology":{"value":"Combination of 'narrow' (of limited width) and 'span' (the distance between two supports).","priority":"N/A"},"pronunciation":{"ipa":"/ˌnæroʊ ˈspæn/","syllables":"nar-row-span"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"'Narrow-span' is typically used in engineering, construction, and architecture to describe structures where the distance between supports is relatively small. It implies a design that is suitable for shorter distances and lighter loads compared to wide-span structures.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The narrow span of his life was filled with adventure.","correct":"His short life was filled with adventure.","note":"'Narrow-span' refers to physical distance, not the length of someone's life."}],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Narrow-span' is a technical term primarily used in construction and engineering. It describes something that has a small distance between its supports. For example, a 'narrow-span bridge' is a bridge where the distance between the pillars holding it up is short. This term is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The architect chose a narrow-span design to minimize the visual impact on the landscape.","translation":"建築家は景観への視覚的な影響を最小限に抑えるために、狭いスパンのデザインを選んだ。","type":"adjective","meaning_category":"design"},{"sentence":"Narrow-span bridges are often less expensive to build than their wider counterparts.","translation":"狭いスパンの橋は、広いスパンの橋よりも建設費が安価なことが多い。","type":"adjective","meaning_category":"construction"}]}