{"word":"polysemantic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"多義的な、多義性を持つ","english_definition":"Having multiple meanings; characterized by polysemy.","examples":[{"sentence":"The word 'bank' is polysemantic, as it can refer to a financial institution or the side of a river.","translation":"「bank」という単語は多義的で、金融機関や川岸を指すことがあります。"},{"sentence":"Polysemantic words can sometimes lead to ambiguity in communication.","translation":"多義的な単語は、コミュニケーションにおいて曖昧さを招くことがあります。"},{"sentence":"Linguists study polysemantic words to understand how language evolves.","translation":"言語学者は、言語がどのように進化するかを理解するために、多義的な単語を研究します。"}],"collocations":["polysemantic word (多義語)","polysemantic term (多義的な用語)","polysemantic nature (多義的な性質)","polysemantic meaning (多義的な意味)"],"synonyms":["ambiguous","equivocal","multivalent","vague","open to interpretation"],"antonyms":["monosemous","unambiguous","univocal","clear","precise"]},{"part_of_speech":"adjective","definition":"（言語学で）一つの語形が複数の意味を持つ","english_definition":"(In linguistics) Having one form with multiple related meanings.","examples":[{"sentence":"'Bright' is a polysemantic word, meaning both 'shining' and 'intelligent'.","translation":"「bright」は多義的な単語で、「輝いている」と「賢い」の両方の意味を持ちます。"},{"sentence":"The polysemantic nature of 'run' allows it to be used in many different contexts.","translation":"「run」の多義的な性質により、多くの異なる文脈で使用できます。"},{"sentence":"Understanding polysemantic relationships is crucial for natural language processing.","translation":"多義的な関係を理解することは、自然言語処理にとって非常に重要です。"}],"collocations":["lexical polysemy (語彙的多義性)","semantic polysemy (意味的多義性)","polysemous word (多義語)","polysemous lexeme (多義的な語彙素)"],"synonyms":["multiple meanings","various senses","diverse interpretations","semantic variation"],"antonyms":["monosemy","single meaning","unique sense"]}],"etymology":{"value":"Derived from the Greek words 'poly' (meaning 'many') and 'semantic' (relating to meaning).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɒliːsɪˈmæntɪk/","syllables":"pol-y-se-man-tic"},"inflection":{"notes":"This word is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Polysemantic' describes words or terms that have multiple related meanings. It's important in linguistics and semantics to understand how a single word can convey different concepts depending on context. Polysemy differs from homonymy (where words have the same form but unrelated meanings) and from ambiguity (where the intended meaning is unclear).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The sentence was polysemantic, making it hard to understand.","correct":"The sentence was ambiguous, making it hard to understand.","note":"'Polysemantic' describes a word, not a sentence. Use 'ambiguous' to describe a sentence with multiple possible interpretations."},{"incorrect":"This word has a lot of synonyms, so it's polysemantic.","correct":"This word has a lot of meanings, so it's polysemantic.","note":"'Polysemantic' refers to multiple meanings of a single word, not multiple words with the same meaning (synonyms)."}],"priority":"★★☆"},"related_words":{"derivatives":["polysemy (名詞: 多義性)","polyseme (名詞: 多義語)"],"phrasal_verbs":[],"related_concepts":["homonymy (同音異義)","homography (同形異義)","semantics (意味論)","lexicology (語彙論)","ambiguity (曖昧さ)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized vocabulary.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Polysemantic' is a term used in linguistics to describe words that have multiple related meanings. It's a more technical term than 'ambiguous,' which refers to something that is unclear or open to multiple interpretations. If a word is 'polysemantic,' it means that it has several meanings that are connected in some way. For example, the word 'paper' can refer to the material you write on, or a formal document. Understanding polysemy is important for analyzing language and how meanings evolve."},"example_sentences":[{"sentence":"The term 'network' is highly polysemantic, with applications in computer science, sociology, and biology.","translation":"「ネットワーク」という用語は非常に多義的であり、コンピュータサイエンス、社会学、生物学に応用されています。","type":"adjective","meaning_category":"多義的な"},{"sentence":"The polysemantic nature of metaphors allows for creative and nuanced expression.","translation":"比喩の多義的な性質は、創造的でニュアンスのある表現を可能にします。","type":"adjective","meaning_category":"多義的な"},{"sentence":"The professor explained the difference between polysemantic words and homonyms.","translation":"教授は、多義語と同音異義語の違いを説明しました。","type":"adjective","meaning_category":"多義的な"}]}