{"word":"neoorthodoxy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"新正統主義 (神学)","english_definition":"A 20th-century theological movement that reacted against liberal theology and emphasized the transcendence and authority of God, the sinfulness of humanity, and the importance of revelation in Jesus Christ.","examples":[{"sentence":"Neoorthodoxy significantly influenced Protestant theology in the mid-20th century.","translation":"新正統主義は20世紀中頃のプロテスタント神学に大きな影響を与えた。"},{"sentence":"Karl Barth is considered one of the most important figures in the development of neoorthodoxy.","translation":"カール・バルトは新正統主義の発展において最も重要な人物の一人とみなされている。"}],"collocations":["developments in neoorthodoxy","principles of neoorthodoxy","the influence of neoorthodoxy"],"synonyms":["dialectical theology","crisis theology"],"antonyms":["liberal theology"]}],"etymology":{"value":"'Neo-' (new) + 'orthodoxy' (traditional or established religious beliefs). The term arose to distinguish this movement from earlier forms of orthodoxy and from liberal theology.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌniːoʊˈɔːrθədɒksi/","syllables":"ne-o-or-tho-dox-y"},"inflection":{"noun_plural":"neoorthodoxies"},"usage_notes":{"explanation":"Neoorthodoxy is primarily used in theological contexts. It represents a specific set of beliefs and reactions within Protestant theology. The term is not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a neoorthodoxy person.","correct":"✓ He is a neoorthodox theologian. / ✓ He adheres to neoorthodoxy.","note":"Neoorthodoxy is a theological movement or system of belief, not a characteristic of a person. Use 'neoorthodox' as an adjective or refer to someone as a 'neoorthodox theologian'."}],"priority":"★★☆"},"related_words":{"derivatives":["neoorthodox (adjective)"],"related_terms":["theology","orthodoxy","liberal theology","existentialism","Karl Barth","crisis theology"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'neoorthodoxy' is highly specialized and primarily encountered in academic or theological discussions. Understanding requires familiarity with theological concepts and the history of 20th-century Protestant thought. The term is rarely used outside of these specific contexts."},"example_sentences":[{"sentence":"The rise of neoorthodoxy marked a shift away from the optimism of liberal theology.","translation":"新正統主義の台頭は、自由主義神学の楽観主義からの転換を示した。","type":"general","meaning_category":"definition"},{"sentence":"Critics of neoorthodoxy argued that it did not fully break with certain aspects of existentialist philosophy.","translation":"新正統主義の批評家たちは、それが実存主義哲学の特定の側面から完全には脱却していないと主張した。","type":"academic","meaning_category":"criticism"}]}