{"word":"drum-heavy","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ドラムが強調された、ドラムの音が大きい","english_definition":"characterized by a prominent or dominant drum sound in music.","examples":[{"sentence":"The song has a drum-heavy intro that really grabs your attention.","translation":"その曲は、聴衆の注意を引くドラムが強調されたイントロがある。"},{"sentence":"The band is known for their drum-heavy sound, influenced by tribal rhythms.","translation":"そのバンドは、部族のリズムに影響を受けたドラムが強調されたサウンドで知られている。"},{"sentence":"The producer wanted a more drum-heavy mix, so he boosted the levels during mastering.","translation":"プロデューサーは、よりドラムが強調されたミックスを望んでいたので、マスタリング中にレベルを上げた。"}],"collocations":["drum-heavy intro","drum-heavy sound","drum-heavy mix","drum-heavy production","drum-heavy track"],"synonyms":["percussion-driven","rhythm-focused","beat-centric"],"antonyms":["melody-driven","lyrically-focused","guitar-heavy","bass-heavy"],"notes":"Typically used to describe music genres like rock, metal, electronic, and hip-hop where drums play a central role."}],"etymology":{"value":"A compound word formed by combining 'drum' (referring to the percussion instrument) and 'heavy' (meaning prominent or dominant).","priority":"★★★"},"pronunciation":{"ipa":"/ˈdrʌm ˌhɛvi/","syllables":"drum-heav-y"},"inflection":{"notes":"This is an adjective and does not have different forms for tense or number."},"usage_notes":{"explanation":"'Drum-heavy' is used to describe music where the drum part is very prominent and loud in the mix. It can also imply that the drum part is complex or interesting. It's a subjective term, but generally means the drums are more noticeable than other instruments.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The song is very drums-heavy.","correct":"✓ The song is very drum-heavy.","note":"The adjective is 'drum-heavy', not 'drums-heavy'."},{"incorrect":"✗ The music is drum heavy.","correct":"✓ The music is drum-heavy.","note":"The compound adjective is typically hyphenated."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["percussion","rhythm section","drum machine","drumbeat","backbeat"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency, but common in music-related contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Drum-heavy' is a compound adjective used to describe music where the drum part is very prominent and loud in the mix. It is commonly used in music reviews, discussions, and descriptions to convey the emphasis on percussion in a particular song or genre. Understanding this term helps in accurately describing and appreciating the sound of music.","priority":"★★★"},"example_sentences":[{"sentence":"The new album is incredibly drum-heavy, with complex rhythms and powerful beats.","translation":"その新しいアルバムは信じられないほどドラムが強調されており、複雑なリズムと力強いビートが特徴です。","type":"adjective","meaning_category":"describing music"},{"sentence":"The producer decided to make the track more drum-heavy to give it a stronger impact.","translation":"プロデューサーは、より強いインパクトを与えるために、そのトラックをよりドラムが強調されたものにすることに決めた。","type":"adjective","meaning_category":"describing music production"},{"sentence":"Fans of the band appreciate their signature drum-heavy sound, which sets them apart from other rock groups.","translation":"そのバンドのファンは、彼らの特徴的なドラムが強調されたサウンドを高く評価しており、それが他のロックグループと一線を画している。","type":"adjective","meaning_category":"describing a band's style"}]}