{"word":"Chessart","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A chess variant combining elements of chess and art, often involving pieces with unique artistic designs or rules related to artistic concepts.","english_definition":"A chess variant that integrates artistic elements, such as uniquely designed pieces or rules inspired by artistic concepts.","examples":[{"sentence":"The Chessart exhibition showcased a variety of chess sets with elaborate, artistic designs.","translation":"チェスアート展では、精巧で芸術的なデザインのチェスセットが数多く展示されました。"},{"sentence":"In Chessart, the movement of pieces can be influenced by the color composition of the board.","translation":"チェスアートでは、駒の動きが盤面の色の構成によって影響を受けることがあります。"}],"collocations":["Chessart exhibition","play Chessart","Chessart pieces","design Chessart sets"],"synonyms":["artistic chess","design chess","creative chess"],"antonyms":[]}],"etymology":{"value":"A portmanteau of 'chess' and 'art', reflecting the combination of the two disciplines.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʃɛsɑːrt/","syllables":"Chess-art"},"inflection":{"noun_plural":"Chessarts"},"usage_notes":{"explanation":"'Chessart' is a niche term primarily used within the art and chess communities to describe chess variants that emphasize artistic design and conceptual rules. It is not a widely recognized term in general English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm playing Chessart with my friends, and it's very strategic.","correct":"✓ I'm playing a Chessart variant with my friends, and it's very strategic.","note":"It's more accurate to describe it as a 'Chessart variant' rather than simply 'Chessart' to emphasize its nature as a type of chess. Chessart is a category, not a specific game."}],"priority":"★★☆"},"related_words":{"derivatives":["art chess","chess design"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Chessart' is a specialized term combining 'chess' and 'art'. It refers to chess variants that incorporate artistic design or rules inspired by artistic concepts. Understanding this term requires familiarity with both chess and art terminology. It is not commonly used in general conversation and is more likely to appear in discussions or publications related to art, design, or chess variants."},"example_sentences":[{"sentence":"The museum displayed a stunning Chessart set made of glass and metal.","translation":"美術館では、ガラスと金属で作られた見事なチェスアートセットが展示されていました。","type":"noun","meaning_category":"chess variant"},{"sentence":"The artist created a Chessart game where the pieces represented different historical figures.","translation":"そのアーティストは、駒が異なる歴史上の人物を表現するチェスアートゲームを作成しました。","type":"noun","meaning_category":"chess variant"}]}