{"word":"noncontractile","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"収縮性のない、収縮しない","english_definition":"Not capable of contracting; lacking the ability to contract.","examples":[{"sentence":"The scar tissue is noncontractile and does not contribute to muscle function.","translation":"その瘢痕組織は収縮性がないため、筋肉機能に寄与しません。"},{"sentence":"Noncontractile cells provide structural support within the tissue.","translation":"収縮性のない細胞は、組織内で構造的な支持を提供します。"}],"collocations":["noncontractile tissue","noncontractile cells","noncontractile material"],"synonyms":["inelastic","non-motile","non-responsive"],"antonyms":["contractile","elastic","motile"]}],"etymology":{"value":"'non-' (否定) + 'contractile' (収縮性のある)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnkənˈtræktaɪl/","syllables":"non-con-trac-tile"},"inflection":{"notes":"adjective, no inflection"},"usage_notes":{"explanation":"'Noncontractile' is primarily used in biological and medical contexts to describe tissues, cells, or materials that do not have the ability to contract or shorten. It is often used to differentiate between functional and non-functional components within a system.","priority":"★★☆"},"related_words":{"derivatives":["contractile","contractility","contraction"],"related_terms":["muscle","tissue","cell"]},"level_frequency":{"priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The word 'noncontractile' is a technical term primarily used in biological and medical contexts. Understanding its meaning requires familiarity with basic concepts of cell biology and tissue function. It's formed by adding the prefix 'non-' to 'contractile', indicating the absence of the ability to contract. Therefore, it describes something that cannot shorten or tighten. This term is typically encountered in scientific literature or specialized medical discussions."},"example_sentences":[{"sentence":"The ligaments are composed of noncontractile fibrous tissue.","translation":"靭帯は収縮性のない線維組織で構成されています。","type":"adjective","meaning_category":"収縮性のない"},{"sentence":"The study investigated the role of noncontractile elements in heart failure.","translation":"その研究では、心不全における収縮性のない要素の役割が調査されました。","type":"adjective","meaning_category":"収縮性のない"}]}