{"word":"device-agnostic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(ソフトウェア、ウェブサイト、コンテンツなどが)特定のデバイスに依存しない、どのデバイスでも利用可能な","english_definition":"(of software, a website, content, etc.) designed to function independently of any specific device or operating system; compatible with a wide range of devices.","examples":[{"sentence":"The new website is designed to be device-agnostic, so it works well on desktops, tablets, and smartphones.","translation":"新しいウェブサイトはデバイスに依存しないように設計されているため、デスクトップ、タブレット、スマートフォンでうまく動作します。"},{"sentence":"We need to create device-agnostic content that can be accessed by anyone, regardless of their device.","translation":"デバイスに関係なく誰でもアクセスできる、デバイスに依存しないコンテンツを作成する必要があります。"},{"sentence":"The application is device-agnostic, meaning users can access it from any device with a web browser.","translation":"このアプリケーションはデバイスに依存しないため、ユーザーはウェブブラウザを備えた任意のデバイスからアクセスできます。"}],"collocations":["device-agnostic design (デバイスに依存しない設計)","device-agnostic platform (デバイスに依存しないプラットフォーム)","device-agnostic approach (デバイスに依存しないアプローチ)","device-agnostic application (デバイスに依存しないアプリケーション)","device-agnostic content (デバイスに依存しないコンテンツ)","device-agnostic solution (デバイスに依存しないソリューション)"],"synonyms":["cross-platform","platform-independent","device-independent","responsive","universal"],"antonyms":["device-specific","platform-specific","device-dependent"]}],"etymology":{"value":"「device」（デバイス）+「agnostic」（不可知論的な、特定のものを前提としない）の組み合わせ。特定のデバイスに限定されないという概念を表す。","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈvaɪs æɡˈnɒstɪk/","syllables":"de-vice-ag-nos-tic"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"「**device-agnostic**」は、特定のハードウェアやオペレーティングシステムに依存しないソフトウェア、ウェブサイト、コンテンツなどを指す技術用語です。これは、異なる種類のデバイス（デスクトップ、タブレット、スマートフォンなど）で同じように動作するように設計されていることを意味します。デバイスに依存しないアプローチは、より多くのユーザーにリーチし、開発とメンテナンスのコストを削減するのに役立ちます。レスポンシブデザインは、デバイスに依存しないウェブサイトを作成するための一般的な手法です。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ This app is device agnostic for Android only.","correct":"✓ This app is device-agnostic, but it may perform better on Android.","note":"「device-agnostic」は、特定のデバイスに限定されないことを意味するため、「Androidのみ」のような限定的な表現とは矛盾します。"},{"incorrect":"✗ Device-agnostic means it works on all devices perfectly.","correct":"✓ Device-agnostic means it is designed to work on many different devices.","note":"「device-agnostic」は、すべてのデバイスで完全に動作することを保証するものではありません。さまざまなデバイスで動作するように設計されていることを意味します。"}],"priority":"★★☆"},"related_words":{"derivatives":["agnostic (形容詞: 不可知論的な、特定のものを前提としない；名詞: 不可知論者)"],"phrases":["cross-platform compatibility (クロスプラットフォーム互換性)","responsive design (レスポンシブデザイン)","platform independence (プラットフォーム非依存性)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 技術的な文脈でよく使われる。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**device-agnostic**」は、技術的な内容で使われる言葉で、特定の種類のコンピューターやスマートフォンなどに限定されずに、いろいろな機械で使えるように作られていることを意味します。例えば、ウェブサイトやアプリが「device-agnostic」なら、パソコンでもスマホでも同じように使うことができます。これは、より多くの人がそれらを利用できるようにするための工夫です。"},"example_sentences":[{"sentence":"The company is developing a device-agnostic platform for streaming video.","translation":"その会社は、ビデオをストリーミングするためのデバイスに依存しないプラットフォームを開発しています。","type":"adjective","meaning_category":"特定のデバイスに依存しない"},{"sentence":"Our goal is to create a device-agnostic learning experience for all students.","translation":"私たちの目標は、すべての学生にデバイスに依存しない学習体験を創造することです。","type":"adjective","meaning_category":"特定のデバイスに依存しない"},{"sentence":"The software is designed with a device-agnostic architecture.","translation":"そのソフトウェアは、デバイスに依存しないアーキテクチャで設計されています。","type":"adjective","meaning_category":"特定のデバイスに依存しない"}]}