{"word":"pansciolism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"万物解釈学、全知主義：科学的知識や方法論を、本来科学的探求の範囲外である哲学、宗教、芸術、人文科学といった分野にまで不適切に適用しようとする傾向、またはその実践。科学至上主義の一形態。","english_definition":"The inappropriate or unwarranted application of scientific knowledge or methodology to areas outside the proper domain of scientific inquiry, such as philosophy, religion, art, or the humanities; a form of scientism.","examples":[{"sentence":"The critique of pansciolism highlights the limitations of scientific methods in addressing questions of meaning and value.","translation":"万物解釈学への批判は、意味や価値の問題に取り組む上での科学的方法の限界を強調する。"},{"sentence":"Pansciolism can lead to a reductionist view of human experience, neglecting the importance of subjective interpretation and qualitative understanding.","translation":"万物解釈学は、人間の経験を還元主義的に捉え、主観的な解釈や質的な理解の重要性を無視する可能性がある。"}],"collocations":["avoid pansciolism","critique of pansciolism","dangers of pansciolism","limitations of pansciolism"],"synonyms":["scientism","scientific reductionism","scientific imperialism"],"antonyms":["humanism","artistic interpretation","philosophical inquiry","religious understanding"]}],"etymology":{"value":"'Pan-' (all) + 'scio-' (to know, from Latin 'scire') + '-ism' (doctrine, practice). Essentially, the belief in 'knowing all' through science.","priority":"★★★"},"pronunciation":{"ipa":"/pænˈsaɪəˌlɪzəm/","syllables":"pan-sci-o-lism"},"inflection":{"noun_plural":"pansciolisms"},"usage_notes":{"explanation":"Pansciolism is a critical term used to describe the overextension of scientific principles into areas where they are not suitable or sufficient. It suggests that everything can be understood and explained solely through scientific means, often disregarding the value of other forms of knowledge and understanding, such as those derived from the humanities, arts, or personal experience. It is often used in academic and philosophical discussions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Pansciolism is the same as science.","correct":"✓ Pansciolism is the inappropriate application of science to non-scientific fields.","note":"Pansciolism is not science itself, but rather the misuse or overextension of scientific principles. It is a philosophical position, not a scientific one."},{"incorrect":"✗ Pansciolism means being good at science.","correct":"✓ Pansciolism is the belief that science can explain everything.","note":"Pansciolism is not about scientific competence, but about the belief that science is the only valid way of knowing."}],"priority":"★★☆"},"related_words":{"derivatives":["pansciolist (noun, adjective)"],"related_concepts":["scientism","reductionism","positivism","epistemology"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (very specialized academic vocabulary)","frequency_google_ngram":"Very low frequency - a specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Pansciolism' is a complex philosophical term referring to the belief that scientific methods and knowledge can and should be applied to all areas of inquiry, including those traditionally addressed by the humanities and arts. It is often used critically to point out the limitations of such an approach, particularly in understanding subjective experiences, values, and meanings that may not be quantifiable or empirically verifiable. Understanding this term requires familiarity with philosophical discourse on the nature of science and knowledge."},"example_sentences":[{"sentence":"The author argues against the dangers of pansciolism in literary criticism, advocating for a more nuanced approach that considers the aesthetic and emotional dimensions of literature.","translation":"著者は文学批評における万物解釈学の危険性について論じ、文学の美的および感情的な側面を考慮した、よりニュアンスのあるアプローチを提唱している。","type":"general","meaning_category":"application in literary criticism"},{"sentence":"Critics of pansciolism suggest that it undervalues the insights gained through introspection, intuition, and artistic expression.","translation":"万物解釈学の批判者たちは、内省、直感、芸術的表現を通じて得られる洞察を過小評価していると指摘する。","type":"general","meaning_category":"criticism of undervaluation of other knowledge forms"}]}