{"word":"porulose","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"多孔質の、小さな穴がたくさんある","english_definition":"Having many small pores or holes; porous.","examples":[{"sentence":"The porulose rock allowed water to seep through.","translation":"その多孔質の岩は水が染み込むのを許した。"},{"sentence":"The porulose structure of the bone makes it lightweight.","translation":"骨の多孔質な構造はそれを軽量にしている。"}],"collocations":["porulose rock","porulose bone","porulose material"],"synonyms":["porous","permeable","honeycombed","fenestrated"],"antonyms":["impermeable","dense","compact","solid"]}],"etymology":{"value":"Derived from the Latin word 'porus' meaning 'pore' and the suffix '-ose' indicating abundance or full of.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɔːrəloʊs/","syllables":"po-ru-lose"},"inflection":{"notes":"Comparative and superlative forms are 'more porulose' and 'most porulose', respectively, as it is a descriptive adjective."},"usage_notes":{"explanation":"'Porulose' is a relatively uncommon term, more frequently encountered in scientific or technical contexts, particularly in geology, biology, and materials science. It describes materials or structures characterized by numerous small pores that allow the passage of fluids or gases. The more common synonym 'porous' is often preferred in general usage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The porulose is strong.","correct":"✓ The porulose material is strong.","note":"'Porulose' is an adjective, so it must modify a noun. It cannot stand alone as a noun."},{"incorrect":"✗ The porulose rock prevent water flow.","correct":"✓ The porulose rock allows water flow.","note":"'Porulose' implies the presence of pores, which typically facilitates rather than prevents fluid flow."}],"priority":"★☆☆"},"related_words":{"derivatives":["porosity (noun): the state of being porous; the proportion of void space in a material.","pore (noun): a tiny opening or hole in a surface.","porous (adjective): having pores; permeable to fluids or gases."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (scientific/technical contexts)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Porulose' is a technical term used to describe something that has many small holes or pores. It's similar to 'porous' but less common. You'll mostly find it in scientific or technical writing when describing materials like rocks, bones, or filters that allow liquids or gases to pass through them. Remember that it's an adjective, so it needs to be used with a noun (e.g., 'porulose membrane')."},"example_sentences":[{"sentence":"The filter was made of a highly porulose material to maximize the flow rate.","translation":"そのフィルターは流量を最大化するために、非常に多孔質な材料で作られていた。","type":"adjective","meaning_category":"多孔質の"},{"sentence":"The researchers studied the porulose structure of the coral.","translation":"研究者たちはサンゴの多孔質な構造を研究した。","type":"adjective","meaning_category":"多孔質の"},{"sentence":"Due to its porulose nature, the soil retained water effectively.","translation":"その土壌は多孔質であるため、効果的に水を保持した。","type":"adjective","meaning_category":"多孔質の"}]}