{"word":"unmundanely","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"非日常的に、平凡さを超えて、世俗的でない方法で","english_definition":"In a way that is not mundane; beyond the ordinary or commonplace; in a manner that transcends the secular or worldly.","examples":[{"sentence":"She approached her work unmundanely, infusing every task with creativity and passion.","translation":"彼女は非日常的な方法で仕事に取り組み、すべてのタスクに創造性と情熱を注ぎ込んだ。"},{"sentence":"The artist lived unmundanely, seeking inspiration in the sublime and the spiritual.","translation":"そのアーティストは非日常的に生き、崇高なものや精神的なものにインスピレーションを求めた。"},{"sentence":"The film depicted the protagonist's life unmundanely, focusing on moments of transcendence and profound meaning.","translation":"その映画は、主人公の人生を非日常的に描き、超越と深い意味の瞬間を中心に描いた。"}],"collocations":["live unmundanely","approach something unmundanely","depict something unmundanely"],"synonyms":["extraordinarily","uncommonly","unusually","remarkably","exceptionally","supernaturally","spiritually"],"antonyms":["mundanely","ordinarily","commonly","usually","typically","secularly","worldly"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to 'mundanely'. 'Mundanely' is derived from 'mundane', which comes from the Latin word 'mundus' meaning 'world'. Therefore, 'unmundanely' means 'not of this world' or 'beyond the ordinary world'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnmʌnˈdeɪnli/","syllables":"un-mun-dan-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Unmundanely' is used to describe actions, behaviors, or depictions that go beyond the ordinary, everyday, or secular. It suggests a sense of transcendence, creativity, or spiritual depth. It is relatively rare and often used in literary or artistic contexts to emphasize the extraordinary nature of something.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The mundane task was completed unmundanely.","correct":"✓ The unmundane task was completed efficiently.","note":"'Unmundanely' should describe the *manner* in which something is done, not the *nature* of the task itself. A mundane task cannot be completed in a non-mundane way, as the task itself is inherently ordinary."}],"priority":"★☆☆"},"related_words":{"derivatives":["unmundane (adjective)","mundane (adjective)","mundaneness (noun)","mundanely (adverb)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency. This word is rare and not commonly used in everyday conversation or writing.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unmundanely' is a sophisticated word used to describe something done in a way that is far from ordinary or commonplace. It suggests a level of creativity, spirituality, or transcendence that elevates the action or depiction beyond the everyday world. Due to its rarity and complexity, it is more likely to be encountered in advanced literary or philosophical contexts."},"example_sentences":[{"sentence":"The dancer moved unmundanely across the stage, her movements defying gravity and expectation.","translation":"ダンサーは非日常的にステージを動き回り、その動きは重力と期待を裏切った。","type":"adverb","meaning_category":"超越"},{"sentence":"He lived his life unmundanely, always seeking deeper meaning and purpose beyond the superficial.","translation":"彼は非日常的な人生を送り、常に表面的なことの奥にある深い意味と目的を求めていた。","type":"adverb","meaning_category":"精神性"},{"sentence":"The author described the landscape unmundanely, imbuing it with a sense of magic and wonder.","translation":"著者は非日常的に風景を描写し、魔法と驚きの感覚を吹き込んだ。","type":"adverb","meaning_category":"創造性"}]}