{"word":"dog-trick","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"犬の芸、犬のトリック","english_definition":"A clever or amusing action performed by a dog, often trained.","examples":[{"sentence":"The dog-trick involved balancing a treat on its nose.","translation":"その犬の芸は、鼻の上におやつを乗せてバランスを取るというものだった。"},{"sentence":"She taught her dog several impressive dog-tricks.","translation":"彼女は犬にいくつかの印象的な犬の芸を教えた。"}],"collocations":["teach a dog-trick","perform a dog-trick","impressive dog-trick","simple dog-trick"],"synonyms":["dog trick","trick","dog stunt","dog act"],"antonyms":[]}],"etymology":{"value":"Compound word combining \"dog\" (domestic canine) and \"trick\" (a clever or skillful act designed to amuse or entertain).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɔɡˌtrɪk/","syllables":"dog-trick"},"inflection":{"noun_plural":"dog-tricks"},"usage_notes":{"explanation":"The term \"dog-trick\" typically refers to a specific, trained action that a dog performs for entertainment or demonstration. It implies a level of skill and training on the part of both the dog and the trainer. The term is generally used in a positive context, highlighting the dog's intelligence and the owner's dedication.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a trick-dog.","correct":"✓ He showed a dog-trick.","note":"The term is \"dog-trick,\" not \"trick-dog,\" when referring to a specific action or stunt performed by a dog."}],"priority":"★★☆"},"related_words":{"derivatives":["trick (noun, verb)","dog (noun)","training (noun)","obedience (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"dog-trick\" is a compound noun referring to a specific, trained action performed by a dog for entertainment. It is generally understood but not extremely common in everyday conversation. Understanding requires familiarity with both the general concept of a \"trick\" and the context of dog training.","priority":"★★☆"},"example_sentences":[{"sentence":"The crowd cheered as the dog completed the complex dog-trick.","translation":"犬が複雑な犬の芸を終えると、観衆は歓声を上げた。","type":"noun","meaning_category":"犬の芸"},{"sentence":"Learning a new dog-trick can be a fun bonding experience for you and your pet.","translation":"新しい犬の芸を学ぶことは、あなたとあなたのペットにとって楽しい絆を深める経験になる。","type":"noun","meaning_category":"犬の芸"},{"sentence":"She spent weeks perfecting the dog-trick for the talent show.","translation":"彼女は何週間もかけてタレントショーのために犬の芸を完成させた。","type":"noun","meaning_category":"犬の芸"}]}