{"word":"pleiotropy","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"多面発現、多面的発現","english_definition":"The production by a single gene of two or more apparently unrelated effects.","examples":[{"sentence":"Pleiotropy explains why some genetic disorders have a wide range of symptoms.","translation":"多面発現は、なぜいくつかの遺伝性疾患が広範囲の症状を示すのかを説明する。"},{"sentence":"The gene responsible for this trait exhibits pleiotropy, affecting both coat color and behavior.","translation":"この形質に関与する遺伝子は多面発現を示し、毛色と行動の両方に影響を与える。"}],"collocations":["exhibit pleiotropy","gene pleiotropy","understand pleiotropy","study pleiotropy"],"synonyms":["gene interaction","multiple effects","multifactorial trait"],"antonyms":["single effect","monogenic trait"]}],"etymology":{"value":"Derived from the Greek words 'pleio' (meaning more) and 'tropos' (meaning turn or affect), reflecting the concept of a single gene affecting multiple traits.","priority":"★★★"},"pronunciation":{"ipa":"/ˌplaɪəˈtrɒpi/","syllables":"pli-o-tro-py"},"inflection":{"noun_plural":"pleiotropies"},"usage_notes":{"explanation":"Pleiotropy is a concept in genetics where one gene influences two or more seemingly unrelated phenotypic traits. This is important in understanding complex genetic disorders and the interconnectedness of various biological systems.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Pleiotropy is when multiple genes affect one trait.","correct":"✓ Pleiotropy is when one gene affects multiple traits.","note":"Pleiotropy involves one gene affecting multiple traits, not the other way around."},{"incorrect":"✗ Pleiotropy only affects physical traits.","correct":"✓ Pleiotropy can affect both physical and behavioral traits.","note":"Pleiotropy can influence a wide range of traits, including behavioral characteristics."}],"priority":"★★☆"},"related_words":{"derivatives":["pleiotropic (adjective)"],"related_terms":["epistasis","polygenic inheritance"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in genetics and biology contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pleiotropy' is a term used in genetics to describe a situation where a single gene influences multiple different traits. Think of it as one gene having many jobs. This concept is important for understanding how genes work and how they can cause different effects in an organism. It's a more advanced topic in biology, so you'll typically encounter it in higher-level science discussions."},"example_sentences":[{"sentence":"The pleiotropy of the FTO gene affects both obesity and cognitive function.","translation":"FTO遺伝子の多面発現は、肥満と認知機能の両方に影響を与える。","type":"scientific","meaning_category":"genetics"},{"sentence":"Understanding pleiotropy is crucial for developing effective treatments for complex genetic disorders.","translation":"多面発現の理解は、複雑な遺伝性疾患に対する効果的な治療法を開発するために不可欠である。","type":"scientific","meaning_category":"genetics"}]}