{"word":"ex-employee","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"元従業員、退職者、以前の社員","english_definition":"a person who used to work for a particular company or organization but no longer does.","examples":[{"sentence":"The company is being sued by an ex-employee for wrongful termination.","translation":"その会社は不当解雇で元従業員から訴えられている。"},{"sentence":"We invited several ex-employees to the company's anniversary celebration.","translation":"私たちは会社の創立記念のお祝いに数名の元従業員を招待した。"},{"sentence":"An ex-employee revealed confidential information to the press.","translation":"元従業員が機密情報を報道機関に漏洩した。"}],"collocations":["former employee","previous employee","past employee","ex-staff member"],"synonyms":["former staff","previous worker","past colleague"],"antonyms":["current employee","present employee","existing staff"],"notes":"Often used in legal or formal contexts. Can sometimes carry a negative connotation depending on the circumstances."}],"etymology":{"value":"The prefix 'ex-' means 'former' or 'out of'. Combined with 'employee', it indicates someone who was previously an employee but is no longer.","priority":"★★★"},"pronunciation":{"ipa":"/ˌeks ɪmˈplɔɪiː/","syllables":"ex-em-ploy-ee"},"inflection":{"noun_plural":"ex-employees"},"usage_notes":{"explanation":"'Ex-employee' is used to refer to someone who was previously employed by a company or organization. It is a neutral term, but the context in which it is used can sometimes imply a negative relationship (e.g., in cases of lawsuits or disputes). It is more formal than simply saying 'former employee'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The ex employee is suing the company.","correct":"✓ An ex-employee is suing the company.","note":"'Ex-employee' is a countable noun, so it needs an article (a/an/the) or a possessive pronoun before it."},{"incorrect":"✗ He is a ex-employee.","correct":"✓ He is an ex-employee.","note":"Because 'ex-' is pronounced with a vowel sound, use 'an' instead of 'a' before 'ex-employee'."}],"priority":"★★☆"},"related_words":{"derivatives":["ex- (prefix meaning 'former')","employee","employer","employment"],"related_terms":["alumnus (for schools or universities)","retiree (for someone who has retired)","former colleague","previous staff member"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively common, especially in news and business contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Ex-employee' is a compound noun that is relatively easy to understand. The prefix 'ex-' is common and indicates 'former'. The word is most often used in business, legal, or news contexts when referring to someone who used to work for a company but doesn't anymore. The meaning is straightforward, but understanding the potential negative connotations in certain contexts is important."},"example_sentences":[{"sentence":"The company's policies regarding ex-employees are clearly outlined in the handbook.","translation":"元従業員に関する会社のポリシーは、ハンドブックに明確に記載されています。","type":"general"},{"sentence":"Several ex-employees attended the retirement party for the CEO.","translation":"数名の元従業員がCEOの退職パーティーに出席した。","type":"general"},{"sentence":"The ex-employee was accused of stealing trade secrets.","translation":"その元従業員は企業秘密を盗んだとして告発された。","type":"legal"}]}