{"word":"smockless","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"スモックを着ていない、スモックのない","english_definition":"Without a smock.","examples":[{"sentence":"The children were running around smockless in the garden.","translation":"子供たちは庭でスモックを着ないで走り回っていた。"},{"sentence":"A smockless existence seemed liberating after years of uniform.","translation":"何年も制服を着ていた後では、スモックのない生活は解放的に思えた。"}],"collocations":["smockless children","smockless existence"],"synonyms":["unsmocked","uncovered"],"antonyms":["smocked","covered"]},{"part_of_speech":"adjective","definition":"スモックを取り除いた、スモックを剥奪された","english_definition":"Having had a smock removed or taken away.","examples":[{"sentence":"The smockless workers felt exposed and vulnerable.","translation":"スモックを取り上げられた労働者たちは、むき出しで脆弱だと感じた。"}],"collocations":["smockless workers","smockless individuals"],"synonyms":["stripped of a smock","deprived of a smock"],"antonyms":["clothed in a smock","provided with a smock"]}],"etymology":{"value":"\"smock\" + \"-less\". The suffix \"-less\" means \"without\". So, \"smockless\" literally means \"without a smock\".","priority":"★★★"},"pronunciation":{"ipa":"/ˈsmɒkləs/","syllables":"smock-less"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. Comparative and superlative forms are possible, but less common (more smockless, most smockless)."},"usage_notes":{"explanation":"The word \"smockless\" is relatively rare. It is used to describe a state of being without a smock, which is a loose-fitting garment worn to protect clothing. It can be used literally to describe someone not wearing a smock or figuratively to describe a situation where the protection or covering provided by a smock is absent.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He felt smockless after losing his job.","correct":"✓ He felt vulnerable after losing his job.","note":"While \"smockless\" could be used figuratively, it's more common to use words like \"vulnerable\" or \"exposed\" to describe feeling unprotected after losing a job."}],"priority":"★☆☆"},"related_words":{"derivatives":["smock","smocked"],"phrasal_verbs":[],"related_adjectives":["unprotected","exposed","vulnerable"],"related_nouns":["nakedness","bareness"]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'smockless' is not commonly used and might not be immediately understood by all English speakers. It requires understanding of the word 'smock' and the suffix '-less', which indicates the absence of something. Therefore, it is more suitable for advanced learners or native speakers with a broader vocabulary. Its usage is often figurative or in specific contexts where the absence of a smock is relevant."},"example_sentences":[{"sentence":"The artist, smockless and covered in paint, surveyed her masterpiece.","translation":"芸術家は、スモックを着ておらず、ペンキまみれで、彼女の傑作を眺めた。","type":"adjective","meaning_category":"スモックを着ていない"},{"sentence":"The factory floor was a smockless zone, requiring full protective gear.","translation":"工場のフロアはスモック禁止区域で、完全な保護具が必要だった。","type":"adjective","meaning_category":"スモックのない"}]}