{"word":"gas-plant","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ハクサンフウロ（白山風露）","english_definition":"A plant of the genus Dictamnus, especially Dictamnus albus, known for emitting flammable vapors from its seedpods and flowers on hot days.","examples":[{"sentence":"The gas-plant is a beautiful addition to any garden.","translation":"ハクサンフウロはどんな庭にも美しい彩りを添えます。"},{"sentence":"Be careful when handling a gas-plant on a hot day, as it can emit flammable vapors.","translation":"暑い日にハクサンフウロを扱う際は、可燃性の蒸気を発することがあるので注意してください。"}],"collocations":["Dictamnus albus","flammable vapors","garden plant"],"synonyms":["Dictamnus","burning bush (sometimes)"],"antonyms":[]},{"part_of_speech":"noun","definition":"ガス製造所、ガス工場","english_definition":"A facility where gas is manufactured or processed.","examples":[{"sentence":"The old gas-plant was demolished to make way for a new housing development.","translation":"古いガス工場は、新しい住宅開発のために取り壊されました。"},{"sentence":"The gas-plant provides fuel for the city's heating system.","translation":"そのガス製造所は、都市の暖房システムに燃料を供給しています。"}],"collocations":["gas production","industrial facility","fuel supply"],"synonyms":["gasworks","gas factory"],"antonyms":[]}],"etymology":{"value":"The term \"gas-plant\" refers to the plant's ability to emit flammable vapors, similar to natural gas. The term also refers to industrial facilities that produce gas.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡæsˌplænt/","syllables":"gas-plant"},"inflection":{"noun_plural":"gas-plants"},"usage_notes":{"explanation":"The term \"gas-plant\" can refer to either a type of plant (Dictamnus) that emits flammable vapors or an industrial facility that manufactures gas. Context is crucial to determine the intended meaning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a beautiful gas-plant in the factory.","correct":"✓ I saw a beautiful Dictamnus in the factory.","note":"If you mean the plant, and it's in a factory, it's better to use the scientific name or specify that it's a garden within the factory. Otherwise, \"gas-plant\" will be understood as the industrial facility."}],"priority":"★★☆"},"related_words":{"derivatives":["gas","plant"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"gas-plant\" has two distinct meanings: a plant species (Dictamnus) that emits flammable vapors, and an industrial facility for gas production. The intended meaning depends on the context. Understanding this dual meaning is key to proper interpretation.","priority":"★★☆"},"example_sentences":[{"sentence":"The gardener warned us about the flammable nature of the gas-plant.","translation":"庭師は、ハクサンフウロの可燃性について私たちに警告しました。","type":"noun","meaning_category":"ハクサンフウロ"},{"sentence":"The gas-plant employed hundreds of workers in the town.","translation":"そのガス工場は町で数百人の労働者を雇用していました。","type":"noun","meaning_category":"ガス製造所"}]}