{"word":"icotype","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"図像標識、アイコンタイプ","english_definition":"A pictorial symbol or sign; a visual representation of an object, concept, or message, often used in information graphics or visual communication.","examples":[{"sentence":"The icotypes on the map helped us quickly identify nearby amenities.","translation":"地図上のアイコンタイプのおかげで、近くの施設をすぐに特定できました。"},{"sentence":"The designer used simple icotypes to represent complex data in the infographic.","translation":"デザイナーは、インフォグラフィックで複雑なデータを表すためにシンプルなアイコンタイプを使用しました。"}],"collocations":["design icotypes","use icotypes","map icotypes","infographic icotypes"],"synonyms":["icon","pictogram","symbol","glyph","visual symbol"],"antonyms":[]}],"etymology":{"value":"Derived from 'ico-' (combining form of 'icon') and 'type' (referring to a specific kind or form).","priority":"☆☆☆"},"pronunciation":{"ipa":"ˈaɪkoʊtaɪp","syllables":"i-co-type"},"inflection":{"noun_plural":"icotypes"},"usage_notes":{"explanation":"'Icotyp'e is a relatively specialized term, primarily used in the fields of graphic design, information visualization, and visual communication. It refers to a specific type of visual symbol or sign that is designed to convey information quickly and efficiently. While similar to 'icon' or 'pictogram,' 'icotype' often implies a more deliberate and systematic approach to visual representation.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The icotype was very verbal.","correct":"✓ The icotype was very clear.","note":"Icotypes are visual, not verbal, so clarity is more relevant than verbality."},{"incorrect":"✗ Use many words instead of icotypes.","correct":"✓ Use icotypes instead of many words.","note":"The purpose of icotypes is to reduce the need for words."}],"priority":"☆☆☆"},"related_words":{"derivatives":["icon","pictogram","symbol","glyph"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Icotyp'e is a technical term used in specialized fields such as graphic design and information visualization. It refers to a visual symbol designed to convey information efficiently. Understanding this term requires familiarity with design principles and visual communication strategies."},"example_sentences":[{"sentence":"The presentation utilized various icotypes to illustrate key concepts.","translation":"プレゼンテーションでは、主要な概念を説明するためにさまざまなアイコンタイプが使用されました。","type":"noun","meaning_category":"図像標識"},{"sentence":"Effective icotypes can significantly improve the user experience of a website.","translation":"効果的なアイコンタイプは、Webサイトのユーザーエクスペリエンスを大幅に向上させることができます。","type":"noun","meaning_category":"図像標識"}]}