{"word":"Indianesque","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"インド風の、インド趣味の","english_definition":"in the style of or resembling that of India","examples":[{"sentence":"The building had an Indianesque design, with intricate carvings and vibrant colors.","translation":"その建物は、複雑な彫刻と鮮やかな色彩が特徴的なインド風のデザインだった。"},{"sentence":"The music had an Indianesque flavor, incorporating sitar melodies and tabla rhythms.","translation":"その音楽は、シタールのメロディーとタブラのリズムを取り入れたインド風の趣があった。"}],"collocations":["Indianesque architecture","Indianesque music","Indianesque art","Indianesque style"],"synonyms":["Indian-style","Indian-inspired","Indo-style","Indo-inspired"],"antonyms":[]}],"etymology":{"value":"\"Indian\" + \"-esque\".","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪndiəˈnɛsk/","syllables":"In-di-a-nesque"},"inflection":{"notes":"不変化詞"},"usage_notes":{"explanation":"\"Indianesque\" is used to describe something that imitates or is reminiscent of Indian culture, art, or style. It is often used in the context of architecture, music, and art.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The restaurant served Indianesque food, but it wasn't authentic Indian cuisine.","correct":"✓ The restaurant served Indian-inspired food, but it wasn't authentic Indian cuisine.","note":"While \"Indianesque\" can be used to describe food, it's more common to use \"Indian-inspired\" or \"Indian-style\" in that context, especially if the food is not a direct imitation of Indian cuisine."}],"priority":"☆☆☆"},"related_words":{"derivatives":["-esque"],"related":["Indian","India"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"\"Indianesque\" is a relatively uncommon word used to describe something that resembles or is in the style of India. It's more likely to be encountered in specialized contexts such as art history, architecture, or cultural studies. Understanding the word requires familiarity with the suffix \"-esque,\" which indicates a resemblance or style.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The palace featured an Indianesque dome, reminiscent of Mughal architecture.","translation":"その宮殿は、ムガル建築を彷彿とさせるインド風のドームを特徴としていた。","type":"adjective","meaning_category":"インド風の"},{"sentence":"The designer incorporated Indianesque motifs into her textile collection.","translation":"そのデザイナーは、自身のテキスタイルコレクションにインド風のモチーフを取り入れた。","type":"adjective","meaning_category":"インド趣味の"}]}