{"word":"saprobiont","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"腐食性生物、腐水性生物","english_definition":"An organism (such as a bacterium or fungus) that obtains its nourishment from dead organic matter.","examples":[{"sentence":"Saprobionts play a crucial role in the decomposition of organic material in aquatic ecosystems.","translation":"腐食性生物は、水生生態系における有機物の分解において重要な役割を果たします。"},{"sentence":"Certain bacteria are saprobionts, feeding on decaying plant and animal matter.","translation":"特定の細菌は腐食性生物であり、腐敗した植物や動物の物質を餌とします。"}],"collocations":["aquatic saprobiont (水生腐食性生物)","bacterial saprobiont (細菌性腐食性生物)","fungal saprobiont (菌類腐食性生物)","saprobiont community (腐食性生物群集)","saprobiont system (腐食性生物系)"],"synonyms":["decomposer","detritivore","saprophyte"],"antonyms":["producer","autotroph"]},{"part_of_speech":"adjective","definition":"腐食性の、腐水性の","english_definition":"Living or growing on decaying organic matter.","examples":[{"sentence":"Saprobiont organisms are essential for nutrient cycling.","translation":"腐食性生物は栄養循環に不可欠です。"},{"sentence":"The saprobiont activity helps to break down complex organic molecules.","translation":"腐食性生物の活動は、複雑な有機分子の分解を助けます。"}],"collocations":["saprobiont activity (腐食性生物の活動)","saprobiont organism (腐食性生物)","saprobiont bacteria (腐食性細菌)","saprobiont fungi (腐食性菌類)"],"synonyms":["saprophytic","decomposing"],"antonyms":["autotrophic","photosynthetic"]}],"etymology":{"value":"Derived from the Greek words 'sapros' (rotten, decaying) + 'bios' (life) + '-ont' (being).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsæprəˈbaɪɒnt/","syllables":"sa-pro-bi-ont"},"inflection":{"noun_plural":"saprobionts"},"usage_notes":{"explanation":"The term \"saprobiont\" is primarily used in ecology and biology to describe organisms that feed on dead organic matter. It is often used in the context of aquatic environments and water quality assessment. The term is sometimes used interchangeably with \"saprophyte,\" although \"saprophyte\" is more commonly used for plants and fungi, while \"saprobiont\" is broader and includes bacteria and other microorganisms.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Saprobionts are plants that make their own food.","correct":"✓ Saprobionts are organisms that feed on dead organic matter.","note":"Saprobionts are not plants that produce their own food (autotrophs); they are decomposers that obtain nutrients from dead organic material."},{"incorrect":"✗ Saprobionts are only found in soil.","correct":"✓ Saprobionts can be found in both soil and aquatic environments.","note":"While some saprobionts are found in soil, many are also found in aquatic environments, playing a vital role in decomposition."}],"priority":"★★☆"},"related_words":{"derivatives":["saprobic (形容詞: 腐食性の)","saprobity (名詞: 腐水性、腐水度)","saprophyte (名詞: 腐生植物、腐生菌)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"saprobiont\" is a technical term used in biology and ecology to describe organisms that obtain nutrients from dead organic matter. These organisms are crucial for decomposition and nutrient cycling in ecosystems. The term is often used in scientific contexts and may not be familiar to the general public. Understanding the term requires knowledge of basic ecological concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"Saprobionts help break down leaf litter in streams.","translation":"腐食性生物は、小川の落ち葉の分解を助けます。","type":"noun","meaning_category":"腐食性生物"},{"sentence":"The presence of saprobiont bacteria indicates the presence of organic pollution.","translation":"腐食性細菌の存在は、有機汚染の存在を示しています。","type":"adjective","meaning_category":"腐食性の"},{"sentence":"Fungi are important saprobionts in forest ecosystems.","translation":"菌類は森林生態系において重要な腐食性生物です。","type":"noun","meaning_category":"腐食性生物"},{"sentence":"The saprobiont community plays a vital role in nutrient recycling.","translation":"腐食性生物群集は、栄養素のリサイクルにおいて重要な役割を果たします。","type":"noun","meaning_category":"腐食性生物"}]}