{"word":"photodynamically","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"光力学的に","english_definition":"In a manner relating to photodynamic therapy or photodynamic processes; using light to activate a substance (photosensitizer) to produce a cytotoxic effect, typically to destroy unwanted cells.","examples":[{"sentence":"The drug was administered photodynamically to target the cancerous cells.","translation":"その薬は、がん細胞を標的とするために光力学的に投与された。"},{"sentence":"Photodynamically active compounds are being investigated for their potential in treating skin conditions.","translation":"光力学的に活性な化合物は、皮膚疾患の治療における可能性について研究されている。"}],"collocations":["administered photodynamically","photodynamically active","treated photodynamically"],"synonyms":["light-activated","photoactivated"],"antonyms":[]}],"etymology":{"value":"Derived from 'photodynamic' (combining 'photo-' relating to light, and 'dynamic' relating to force or energy) + '-ally' (suffix forming adverbs).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌfoʊtoʊdaɪˈnæmɪkli/","syllables":"pho-to-dy-nam-i-cal-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"The term 'photodynamically' is primarily used in scientific and medical contexts, specifically when describing processes related to photodynamic therapy (PDT). PDT involves using a photosensitizer (a light-sensitive drug) that, when exposed to light of a specific wavelength, becomes activated and produces reactive oxygen species (ROS), which are toxic to cells. This process is used to selectively destroy targeted cells, such as cancer cells, while minimizing damage to surrounding healthy tissue.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cells were treated photodynamic.","correct":"✓ The cells were treated photodynamically.","note":"'Photodynamic' is an adjective, while 'photodynamically' is an adverb. Use the adverb to describe how something is treated."}],"priority":"☆☆☆"},"related_words":{"derivatives":["photodynamic (adjective)","photodynamic therapy (noun)","photosensitizer (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in scientific and medical literature.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Photodynamically' is a highly specialized term used in the context of photodynamic therapy (PDT), a medical treatment that uses light-activated drugs to destroy unwanted cells. Understanding this word requires familiarity with the underlying scientific principles of PDT, including the role of photosensitizers and reactive oxygen species. It is typically encountered in advanced scientific or medical texts. "},"example_sentences":[{"sentence":"The tumor was ablated **photodynamically** using a novel photosensitizer.","translation":"腫瘍は、新規光増感剤を用いて光力学的に切除された。","type":"adverb","meaning_category":"光力学的に"}]}