{"word":"piosity","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"敬虔、信心深さ、信心深い行為","english_definition":"the quality of being religious or reverent; devoutness.","examples":[{"sentence":"Her piosity was evident in her daily prayers and acts of charity.","translation":"彼女の敬虔さは、毎日の祈りと慈善行為に明らかだった。"},{"sentence":"The painting depicted scenes of religious piosity.","translation":"その絵は宗教的な敬虔さの場面を描いていた。"},{"sentence":"He was admired for his deep piosity and commitment to his faith.","translation":"彼は深い敬虔さと信仰への献身で賞賛された。"}],"collocations":["religious piosity","deep piosity","show piosity","act of piosity"],"synonyms":["devoutness","reverence","godliness","holiness","faithfulness","sanctity","religiousness"],"antonyms":["impiety","irreverence","atheism","secularism","profanity"]}],"etymology":{"value":"Late Middle English: from Old French piosite, from Latin piositas, from pius ‘pious’.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpaɪˈɒsɪti/","syllables":"pi-o-si-ty"},"inflection":{"noun_plural":"piosities (rarely used)"},"usage_notes":{"explanation":"\"Piosity\" refers to the quality of being deeply religious or showing great reverence for religious beliefs and practices. It can also refer to a specific act or expression of religious devotion. The word often carries a sense of sincerity and commitment to one's faith.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed great piosity by donating money to the poor, but his actions were motivated by pride.","correct":"✓ He showed outward piosity by donating money to the poor, but his actions were motivated by pride.","note":"While donating to the poor can be an act of piosity, the example highlights that the motivation behind the act matters. If the motivation is pride rather than genuine religious devotion, it is more accurately described as outward or feigned piosity."},{"incorrect":"✗ Her piosity was questioned because she didn't attend church every Sunday.","correct":"✓ Her piosity was questioned because she didn't conform to traditional religious practices.","note":"While attending church is a common expression of piosity, it is not the only measure. Piosity encompasses a broader sense of religious devotion and adherence to religious principles. The corrected sentence reflects this broader understanding."}],"priority":"★☆☆"},"related_words":{"derivatives":["pious (adjective)","piously (adverb)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"piosity\" refers to the quality of being deeply religious or devout. It describes a strong commitment to religious beliefs and practices, often expressed through acts of worship, prayer, and adherence to religious principles. This word is not commonly used in everyday conversation and is more often found in formal writing or discussions about religion.","priority":"★☆☆"},"example_sentences":[{"sentence":"The monk's life was marked by profound piosity and dedication to his religious order.","translation":"その修道士の人生は、深い敬虔さと修道会への献身によって特徴づけられていた。","type":"noun","meaning_category":"敬虔さ"},{"sentence":"The artist captured the subject's piosity through the use of religious symbols and iconography.","translation":"芸術家は、宗教的なシンボルと図像の使用を通して、主題の敬虔さを捉えた。","type":"noun","meaning_category":"敬虔さ"},{"sentence":"The community was known for its collective piosity and strong adherence to religious traditions.","translation":"そのコミュニティは、集団的な敬虔さと宗教的伝統への強い固執で知られていた。","type":"noun","meaning_category":"敬虔さ"}]}