{"word":"neo-orthodoxy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"新正統主義（神学）","english_definition":"A theological movement that emerged after World War I, emphasizing the transcendence of God and the limitations of human reason, while affirming the authority of Scripture.","examples":[{"sentence":"Neo-orthodoxy challenged liberal theology's optimistic view of humanity.","translation":"新正統主義は、自由主義神学の人類に対する楽観的な見方を批判した。"},{"sentence":"Karl Barth is considered a key figure in the development of neo-orthodoxy.","translation":"カール・バルトは新正統主義の発展における重要な人物と見なされている。"}],"collocations":["theology of neo-orthodoxy","key figures in neo-orthodoxy","influence of neo-orthodoxy"],"synonyms":["dialectical theology","crisis theology"],"antonyms":["liberal theology","fundamentalism"]}],"etymology":{"value":"'Neo-' (new) + 'orthodoxy' (traditional or established religious beliefs). It signifies a renewed emphasis on traditional Christian doctrines in response to modern theological trends.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌniːoʊˈɔːrθədɒksi/","syllables":"ne-o-or-tho-dox-y"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Neo-orthodoxy is a theological movement primarily associated with Karl Barth and other theologians in the early 20th century. It sought to recover elements of traditional Protestant theology while engaging with modern philosophical and historical criticism. Key tenets include the absolute transcendence of God, the fallen nature of humanity, and the unique revelation of God in Jesus Christ. It is also known as dialectical theology or crisis theology because of its emphasis on the tension between the divine and the human.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Neo-orthodoxy is the same as fundamentalism.","correct":"✓ Neo-orthodoxy is distinct from fundamentalism, although both react to liberal theology.","note":"Neo-orthodoxy and fundamentalism are distinct theological movements. Neo-orthodoxy engages with modern thought, while fundamentalism tends to reject it. "},{"incorrect":"✗ Neo-orthodoxy promotes a literal interpretation of the Bible.","correct":"✓ Neo-orthodoxy emphasizes the authority of Scripture but does not necessarily advocate for a literal interpretation.","note":"Neo-orthodoxy emphasizes the authority of Scripture but recognizes the need for interpretation within its historical and cultural context."}],"priority":"★★☆"},"related_words":{"derivatives":["neo-orthodox (adjective)"],"related_terms":["Karl Barth","dialectical theology","crisis theology","theology","Protestantism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Neo-orthodoxy' is a term used in theological studies to describe a movement that emerged in the early 20th century. It's a complex concept involving specific theological ideas and historical context, making it suitable for advanced learners or those studying theology. Understanding the term requires familiarity with theological concepts and historical movements within Christianity."},"example_sentences":[{"sentence":"The rise of **neo-orthodoxy** marked a shift away from liberal theology in the early 20th century.","translation":"新正統主義の台頭は、20世紀初頭の自由主義神学からの転換を示した。","type":"noun","meaning_category":"theological movement"},{"sentence":"Critics argue that **neo-orthodoxy**'s emphasis on divine transcendence can lead to a detachment from social concerns.","translation":"批評家たちは、新正統主義の神の超越性の強調が、社会的な関心からの乖離につながる可能性があると主張している。","type":"noun","meaning_category":"theological movement"}]}