{"word":"rhinophyma","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"鼻瘤（びりゅう）：酒さの重症型で、鼻の皮膚が肥厚し、赤みを帯び、こぶ状になる状態","english_definition":"A condition associated with severe rosacea, causing the nose to become bulbous, red, and enlarged due to thickened skin.","examples":[{"sentence":"His red, bulbous nose was a clear sign of rhinophyma.","translation":"彼の赤く、こぶ状の鼻は、鼻瘤の明らかな兆候だった。"},{"sentence":"Rhinophyma can be treated with surgery or laser resurfacing.","translation":"鼻瘤は、手術またはレーザー治療で治療できる。"}],"collocations":["treat rhinophyma (鼻瘤を治療する)","surgical treatment for rhinophyma (鼻瘤の外科的治療)","laser treatment for rhinophyma (鼻瘤のレーザー治療)","severe rhinophyma (重度の鼻瘤)","mild rhinophyma (軽度の鼻瘤)"],"synonyms":["bulbous nose","potato nose"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の 'rhis' (鼻) + 'phyma' (成長、腫瘍) に由来","priority":"★★☆"},"pronunciation":{"ipa":"/ˌraɪnəˈfaɪmə/","syllables":"rhi-no-phy-ma"},"inflection":{"noun_plural":"rhinophymas"},"usage_notes":{"explanation":"Rhinophyma is a dermatological condition, a subtype of rosacea, characterized by a large, red, bumpy nose. It primarily affects older men. While often mistakenly associated with alcohol abuse, it is not directly caused by it, although alcohol can exacerbate the condition. Treatment options include surgical removal of excess tissue, laser resurfacing, and other dermatological procedures.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has rhinophyma because he drinks too much.","correct":"✓ While excessive alcohol consumption can worsen rosacea, rhinophyma is not directly caused by alcohol abuse.","note":"It's important to dispel the myth that rhinophyma is caused by alcohol abuse. While alcohol can worsen rosacea, the underlying cause of rhinophyma is not directly related to alcohol consumption."}],"priority":"★☆☆"},"related_words":{"derivatives":["rosacea (酒さ)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学用語","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Rhinophyma is a medical term referring to a skin condition that affects the nose, causing it to become enlarged, red, and bumpy. It's a severe form of rosacea. The condition is more common in men and is often mistakenly associated with alcohol abuse. Treatment usually involves surgical or laser procedures to reshape the nose.","priority":"★★☆"},"example_sentences":[{"sentence":"The dermatologist diagnosed him with rhinophyma and recommended laser treatment.","translation":"皮膚科医は彼を鼻瘤と診断し、レーザー治療を勧めた。","type":"general","meaning_category":"diagnosis and treatment"},{"sentence":"Rhinophyma can significantly impact a person's self-esteem and quality of life.","translation":"鼻瘤は、人の自尊心と生活の質に大きな影響を与える可能性がある。","type":"general","meaning_category":"impact of condition"}]}