{"word":"Shakerism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"シェーカー教、シェーカー教徒の信仰・教義・慣習","english_definition":"The religious beliefs, doctrines, and practices of the Shakers, a Christian sect also known as the United Society of Believers in Christ's Second Appearing.","examples":[{"sentence":"Shakerism emphasized communal living, pacifism, and equality between the sexes.","translation":"シェーカー教は、共同生活、平和主義、男女平等を重視した。"},{"sentence":"The furniture produced by Shakers reflects the simplicity and practicality central to Shakerism.","translation":"シェーカー教徒が製作した家具は、シェーカー教の中心的な考え方であるシンプルさと実用性を反映している。"}],"collocations":["Shaker beliefs (シェーカーの信仰)","Shaker doctrines (シェーカーの教義)","Shaker practices (シェーカーの慣習)","Shaker community (シェーカーの共同体)","Shaker furniture (シェーカー家具)"],"synonyms":["Shaker religion","Shaker faith","Shaker theology"],"antonyms":[]}],"etymology":{"value":"The term 'Shakerism' is derived from 'Shaker,' the nickname given to members of the United Society of Believers in Christ's Second Appearing due to their ecstatic behavior during worship services, which included shaking, dancing, and shouting. The suffix '-ism' denotes a system of beliefs or practices.","priority":"★★★"},"pronunciation":{"ipa":"/ˈʃeɪkərɪzəm/","syllables":"Shak-er-is-m"},"inflection":{"notes":"Uncountable noun"},"usage_notes":{"explanation":"'Shakerism' refers specifically to the religious and social system of the Shakers. It encompasses their unique theology, communal lifestyle, pacifist stance, emphasis on gender equality, and distinctive artistic and craft traditions, particularly in furniture making. The term is often used in historical or academic contexts when discussing the Shaker movement.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Shakerism.","correct":"✓ He is a Shaker.","note":"'Shakerism' is the belief system, not the person. A person who follows Shakerism is a 'Shaker.'"},{"incorrect":"✗ Shakerism is an adjective.","correct":"✓ Shakerism is a noun.","note":"'Shakerism' is a noun referring to the religion or belief system. The adjective form would be 'Shaker' (e.g., Shaker furniture)."}],"priority":"★★☆"},"related_words":{"derivatives":["Shaker (noun: シェーカー教徒, adjective: シェーカーの)","Shaker community (シェーカー共同体)","Shaker furniture (シェーカー家具)","Shaking Quakers (シェーキング・クエーカー、シェーカー教徒の初期の呼称)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low frequency - Primarily used in historical or religious studies contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Shakerism' is a specialized term referring to the religious beliefs and practices of the Shakers, a unique Christian sect known for its communal living, pacifism, and distinctive craftsmanship. Understanding this term requires familiarity with religious history and American cultural movements. It is not commonly used in everyday conversation but is relevant in academic or historical discussions about the Shakers.","priority":"★★☆"},"example_sentences":[{"sentence":"Shakerism promoted a life of simplicity, hard work, and spiritual devotion.","translation":"シェーカー教は、質素、勤勉、精神的な献身の生活を奨励した。","type":"general","meaning_category":"beliefs and practices"},{"sentence":"The principles of Shakerism influenced their approach to design and craftsmanship.","translation":"シェーカー教の原則は、デザインと職人技へのアプローチに影響を与えた。","type":"general","meaning_category":"beliefs and practices"},{"sentence":"Historians study Shakerism to understand the social and religious movements of the 19th century.","translation":"歴史家は、19世紀の社会および宗教運動を理解するためにシェーカー教を研究する。","type":"academic","meaning_category":"historical context"}]}