{"word":"cheeseflower","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ハナミズキ（Cornus florida）","english_definition":"A common name for the dogwood tree (Cornus florida).","examples":[{"sentence":"The cheeseflower is known for its beautiful white bracts in the spring.","translation":"ハナミズキは春の美しい白い苞で知られています。"}],"collocations":["dogwood","Cornus florida"],"synonyms":["dogwood"],"antonyms":[]},{"part_of_speech":"noun","definition":"オオバコ（Plantago major）","english_definition":"A common name for the plant Plantago major, especially its seed head.","examples":[{"sentence":"Children sometimes play with cheeseflowers, using the seed heads as 'cheeses'.","translation":"子供たちは時々オオバコで遊び、種子を「チーズ」として使います。"}],"collocations":["Plantago major","plantain"],"synonyms":["plantain"],"antonyms":[]}],"etymology":{"value":"The name 'cheeseflower' is used for different plants based on perceived resemblance of parts of the plant to cheese. For Cornus florida, the flower head may have a cheese-like appearance. For Plantago major, the seed head may resemble a small cheese.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʃiːzˌflaʊər/","syllables":"cheese-flow-er"},"inflection":{"noun_plural":"cheeseflowers"},"usage_notes":{"explanation":"The term 'cheeseflower' can refer to different plants, most commonly either Cornus florida (dogwood) or Plantago major (plantain). Context is important to determine which plant is being referred to.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a cheeseflower growing in the forest with red berries.","correct":"✓ I saw a dogwood growing in the forest with red berries.","note":"Dogwoods can have red berries, while plantains do not have berries. Using 'dogwood' clarifies the intended meaning."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cheeseflower' is a relatively uncommon term with multiple meanings, referring to either the dogwood tree (Cornus florida) or the plantain plant (Plantago major). The specific plant being referenced is usually determined by context. It is more common to use the terms 'dogwood' or 'plantain' to avoid ambiguity."},"example_sentences":[{"sentence":"The garden was adorned with beautiful cheeseflowers in full bloom.","translation":"庭は満開の美しいハナミズキで飾られていました。","type":"noun","meaning_category":"ハナミズキ"},{"sentence":"We used to play with cheeseflowers in the field as children.","translation":"子供の頃、野原でオオバコで遊んだものです。","type":"noun","meaning_category":"オオバコ"}]}