{"word":"Grecophobe","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ギリシャ嫌い、ギリシャ文化嫌悪者","english_definition":"A person who dislikes or hates Greece, the Greeks, or Greek culture.","examples":[{"sentence":"He was labeled a Grecophobe because of his critical remarks about ancient Greek philosophy.","translation":"彼は古代ギリシャ哲学に対する批判的な発言のために、ギリシャ嫌いだとレッテルを貼られた。"},{"sentence":"Some historians argue that certain Roman emperors were Grecophobes.","translation":"一部の歴史家は、特定のローマ皇帝がギリシャ嫌いだったと主張している。"}],"collocations":["extreme Grecophobe","self-confessed Grecophobe"],"synonyms":["anti-Hellenist","Greek-hater"],"antonyms":["Grecophile","Hellenophile"]},{"part_of_speech":"adjective","definition":"ギリシャ嫌いの、ギリシャ文化嫌悪の","english_definition":"Having or showing a dislike or hatred of Greece, the Greeks, or Greek culture.","examples":[{"sentence":"His Grecophobe views were evident in his writings.","translation":"彼のギリシャ嫌いの見解は彼の著作に明らかだった。"},{"sentence":"The article criticized the Grecophobe sentiments expressed in the political debate.","translation":"その記事は、政治討論で表明されたギリシャ嫌いの感情を批判した。"}],"collocations":["Grecophobe sentiment","Grecophobe attitude"],"synonyms":["anti-Hellenic"],"antonyms":["Grecophilic","Hellenic"]}],"etymology":{"value":"From 'Greco-' (combining form relating to Greece) + '-phobe' (one who fears or hates).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡriːkəfoʊb/","syllables":"Gre-co-phobe"},"inflection":{"noun_plural":"Grecophobes"},"usage_notes":{"explanation":"'Grecophobe' refers to a person who has a strong dislike or hatred of Greece, its people, or its culture. It's the opposite of 'Grecophile,' which describes someone who loves Greece and Greek culture. The term can be used to describe individuals, groups, or even historical figures who have demonstrated anti-Greek sentiments.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a Greekphobe.","correct":"He is a Grecophobe.","note":"The correct spelling is 'Grecophobe,' not 'Greekphobe.'"},{"incorrect":"She has Grecophobic.","correct":"She is Grecophobic.","note":"'Grecophobic' is an adjective, so it needs a verb like 'is' before it."}],"priority":"★☆☆"},"related_words":{"derivatives":["Grecophobia (noun: fear or hatred of Greece, the Greeks, or Greek culture)","Grecophobic (adjective: characterized by a dislike or hatred of Greece, the Greeks, or Greek culture)"],"phobias":["xenophobia (fear or hatred of foreigners)","Anglophobia (fear or hatred of England or the English)","Islamophobia (fear or hatred of Islam or Muslims)"],"antonyms":["Grecophile (noun: lover of Greece, the Greeks, or Greek culture)","Grecophilia (noun: love of Greece, the Greeks, or Greek culture)","Hellenophile (noun: lover of Greece, the Greeks, or Greek culture)","Hellenophilia (noun: love of Greece, the Greeks, or Greek culture)"],"related_terms":["Hellenic (relating to Greece or Greek culture)","Hellenism (the principles and ideals associated with classical Greek civilization)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Grecophobe' is a relatively rare word that describes someone who dislikes or hates Greece, Greeks, or Greek culture. It is formed by combining 'Greco-' (referring to Greece) with '-phobe' (someone who fears or hates). The word is most often used in academic or historical contexts when discussing attitudes towards Greece. Understanding the word requires familiarity with the suffix '-phobe' and the prefix 'Greco-'. It is important to distinguish it from 'Grecophile,' which means someone who loves Greek culture."},"example_sentences":[{"sentence":"The politician's speech was criticized for its perceived Grecophobe undertones.","translation":"その政治家の演説は、ギリシャ嫌いの意図が含まれていると見なされ、批判された。","type":"adjective","meaning_category":"expressing dislike of Greece"},{"sentence":"As a self-proclaimed Grecophobe, he refused to visit Greece.","translation":"自称ギリシャ嫌いとして、彼はギリシャへの訪問を拒否した。","type":"noun","meaning_category":"person who dislikes Greece"}]}