{"word":"Wouk","priority":"N/A","meanings":[{"part_of_speech":"proper noun","definition":"Herman Wouk (1915-2019), an American author known for historical fiction and Pulitzer Prize-winning novel 'The Caine Mutiny'.","english_definition":"A surname, specifically referring to Herman Wouk, a notable American author.","examples":[{"sentence":"Herman Wouk's novels often explored themes of war, religion, and American identity.","translation":"ハーマン・ウォークの小説は、戦争、宗教、アメリカのアイデンティティというテーマを探求することが多かった。"},{"sentence":"'The Caine Mutiny' by Wouk won the Pulitzer Prize in 1952.","translation":"ウォークの『ケイン号の叛乱』は1952年にピューリッツァー賞を受賞した。"}],"collocations":["Herman Wouk","The Caine Mutiny","War and Remembrance"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Likely derived from a Slavic language. Specific origin requires further research.","priority":"★☆☆"},"pronunciation":{"ipa":"/woʊk/","syllables":"Woke (1 syllable)"},"inflection":{},"usage_notes":{"explanation":"'Wouk' is primarily recognized as the surname of the author Herman Wouk. When encountered, it almost always refers to him or his works. It is not a common name, so it's unlikely to be used in other contexts.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":[],"related_authors":[],"related_books":["The Caine Mutiny","War and Remembrance","The Winds of War","Youngblood Hawke","Marjorie Morningstar"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency, primarily associated with the author.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Wouk' is a proper noun, specifically a surname. Its usage is almost exclusively tied to Herman Wouk, a prominent American author. Therefore, understanding its meaning requires familiarity with his literary works and significance. The word itself is not complex, but its contextual understanding relies on cultural and literary knowledge.","requires_background_knowledge":true},"example_sentences":[{"sentence":"Have you read any novels by Herman Wouk?","translation":"ハーマン・ウォークの小説を読んだことがありますか？","type":"proper noun","meaning_category":"Author's surname"},{"sentence":"Wouk's writing style is known for its detailed historical accuracy.","translation":"ウォークの文体は、その詳細な歴史的正確さで知られています。","type":"proper noun","meaning_category":"Author's surname"},{"sentence":"The Caine Mutiny is considered Wouk's most famous work.","translation":"『ケイン号の叛乱』はウォークの最も有名な作品とされています。","type":"proper noun","meaning_category":"Author's surname"}]}