{"word":"atrabiliousness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"憂鬱質、気難しさ、怒りっぽさ","english_definition":"The state of being atrabilious; melancholy, irritability, or a tendency to be gloomy or bad-tempered.","examples":[{"sentence":"His atrabiliousness made him difficult to work with.","translation":"彼の気難しさは、彼との仕事を困難にした。"},{"sentence":"The novel explores the character's atrabiliousness and its roots in childhood trauma.","translation":"その小説は、登場人物の憂鬱質と、その原因である幼少期のトラウマを探求している。"}],"collocations":["cause atrabiliousness","suffer from atrabiliousness","overcome atrabiliousness"],"synonyms":["melancholy","gloominess","irascibility","cholericness","ill-humor","sullenness"],"antonyms":["cheerfulness","good humor","optimism"]}],"etymology":{"value":"Derived from 'atrabilious,' which comes from the Latin 'atra bilis' meaning 'black bile.' In medieval medicine, an excess of black bile was believed to cause melancholy and a bad temper.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌætrəˈbɪliəsnəs/","syllables":"at-ra-bil-i-ous-ness"},"inflection":{"noun_plural":"atrabiliousnesses (rare)"},"usage_notes":{"explanation":"'Atrabiliousness' is a somewhat archaic and uncommon word, primarily used in literature or formal contexts to describe a disposition characterized by gloom, irritability, and a melancholy temperament. It is related to the historical medical theory of humors, where an imbalance of black bile was thought to cause such a disposition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed atrabilious behavior.","correct":"✓ He showed atrabiliousness.","note":"'Atrabiliousness' is a noun referring to the state or quality of being atrabilious, not an adjective describing behavior. Use 'atrabilious' as the adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["atrabilious (adjective: 憂鬱質の、気難しい、怒りっぽい)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Atrabiliousness' is a sophisticated term denoting a state of melancholy, irritability, and gloominess. Its usage is rare and typically confined to formal writing or literary contexts. Understanding the word requires familiarity with its etymological roots in medieval humoral theory, where an excess of 'black bile' was believed to cause such a temperament. Due to its rarity and complexity, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The old man's atrabiliousness was a constant source of tension in the household.","translation":"その老人の気難しさは、家庭内の絶え間ない緊張の原因だった。","type":"noun","meaning_category":"憂鬱質、気難しさ"},{"sentence":"She recognized the atrabiliousness in his writing, a reflection of his own inner turmoil.","translation":"彼女は彼の文章の中に憂鬱質を認め、それは彼自身の内面の苦悩の反映だった。","type":"noun","meaning_category":"憂鬱質、気難しさ"}]}