{"word":"innovation-averse","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"革新を嫌う、革新に抵抗がある","english_definition":"Reluctant or opposed to innovation or change.","examples":[{"sentence":"The company is innovation-averse and prefers to stick to traditional methods.","translation":"その会社は革新を嫌い、従来の方法に固執することを好む。"},{"sentence":"An innovation-averse culture can stifle creativity and progress.","translation":"革新を嫌う文化は、創造性と進歩を妨げる可能性がある。"},{"sentence":"Many older industries are innovation-averse due to the high costs and risks associated with new technologies.","translation":"多くの古い産業は、新しい技術に伴う高いコストとリスクのために、革新を嫌う傾向がある。"}],"collocations":["highly innovation-averse","somewhat innovation-averse","remain innovation-averse","become innovation-averse"],"synonyms":["resistant to change","conservative","traditionalist","change-averse","status quo-oriented"],"antonyms":["innovation-friendly","innovation-embracing","progressive","forward-thinking","open to change"]}],"etymology":{"value":"The word is formed by combining 'innovation' (the introduction of something new) and 'averse' (having a strong dislike or opposition to something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪnəˈveɪʃən əˈvɜːrs/","syllables":"in-no-va-tion a-verse"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Innovation-averse' describes an entity (person, company, culture, etc.) that tends to avoid or resist new ideas, methods, or technologies. It suggests a preference for the familiar and established ways of doing things, often due to fear of risk, uncertainty, or disruption.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is innovation-adverse.","correct":"✓ The company is innovation-averse.","note":"'Averse' (having a strong dislike) is the correct term, not 'adverse' (unfavorable)."},{"incorrect":"✗ He is innovation-averse for new ideas.","correct":"✓ He is innovation-averse to new ideas.","note":"The correct preposition to use with 'averse' is 'to.'"}],"priority":"★★☆"},"related_words":{"derivatives":["innovation","averse","aversion"],"related_terms":["technology-averse","risk-averse","change-averse"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, primarily used in business, technology, and academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Innovation-averse' is a relatively advanced term used to describe a reluctance or opposition to new ideas, methods, or technologies. It is commonly used in business, technology, and academic contexts to describe organizations or individuals that prefer to stick with established practices rather than embrace change. The term implies a certain degree of resistance to progress or improvement. Understanding this term requires a solid vocabulary and familiarity with abstract concepts related to innovation and change management."},"example_sentences":[{"sentence":"The board of directors was largely innovation-averse, which made it difficult to implement new strategies.","translation":"取締役会は概して革新を嫌っていたため、新しい戦略を実行することが困難だった。","type":"adjective","meaning_category":"革新を嫌う"},{"sentence":"Startups often struggle to gain traction in innovation-averse industries.","translation":"スタートアップ企業は、革新を嫌う産業で勢いを増すのに苦労することが多い。","type":"adjective","meaning_category":"革新を嫌う"},{"sentence":"The government's innovation-averse policies have hindered economic growth.","translation":"政府の革新を嫌う政策は、経済成長を妨げている。","type":"adjective","meaning_category":"革新を嫌う"}]}