{"word":"stomachlessness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The state of lacking a stomach, either literally (through surgical removal or congenital absence) or figuratively (lacking the capacity for strong emotions or empathy).","english_definition":"The condition of not having a stomach, either physically or metaphorically.","examples":[{"sentence":"The patient suffered from stomachlessness after a total gastrectomy.","translation":"患者は胃全摘出手術後、胃がない状態に苦しんだ。"},{"sentence":"His stomachlessness towards the suffering of others was truly disturbing.","translation":"他者の苦しみに対する彼の無関心さは、本当に不快だった。"}],"collocations":["congenital stomachlessness","surgical stomachlessness","emotional stomachlessness"],"synonyms":["agastria","apathy","callousness","indifference","lack of empathy"],"antonyms":["empathy","compassion","sensitivity","stomach (presence of)"]}],"etymology":{"value":"Formed by combining \"stomach\" with the suffix \"-less\" (meaning without) and the suffix \"-ness\" (denoting a state or condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstʌməkˌləsnəs/","syllables":"stom-ach-less-ness"},"inflection":{"noun_plural":"stomachlessnesses (rarely used)"},"usage_notes":{"explanation":"The word \"stomachlessness\" is rare and can be used in both a literal and figurative sense. Literally, it refers to the absence of a stomach, often due to surgical removal. Figuratively, it describes a lack of emotional depth, empathy, or moral scruples. The figurative use is less common and might be considered somewhat informal or literary.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed stomachlessness when he ate all the food.","correct":"✓ He showed gluttony when he ate all the food.","note":"Stomachlessness refers to the absence of a stomach or lack of empathy, not overeating. Gluttony is the correct term for excessive eating."}],"priority":"★★☆"},"related_words":{"derivatives":["stomachless (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2 (very rare, specialized vocabulary)","frequency_google_ngram":"Extremely rare","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Stomachlessness\" is a very uncommon word, primarily used in medical or highly figurative contexts. It denotes the absence of a stomach, either physically (after surgery) or metaphorically (lacking empathy or strong emotions). Due to its rarity and specific usage, it is not part of general vocabulary. Understanding requires a good grasp of root words and suffixes.","priority":"★☆☆"},"example_sentences":[{"sentence":"The infant was diagnosed with congenital stomachlessness, a rare and often fatal condition.","translation":"その幼児は先天性無胃症と診断された。これはまれで、しばしば致命的な状態である。","type":"noun","meaning_category":"Literal absence of a stomach"},{"sentence":"The politician's stomachlessness in the face of the environmental disaster was widely criticized.","translation":"その政治家の環境災害に対する無関心は広く批判された。","type":"noun","meaning_category":"Figurative lack of empathy"}]}