{"word":"unionistic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"組合主義の、労働組合支持の、合同主義の、統一主義の","english_definition":"relating to or advocating unionism, especially the principles or practices of trade unions; relating to or advocating political union or unification.","examples":[{"sentence":"The unionistic sentiment was strong among the workers.","translation":"労働者の間では組合主義的な感情が強かった。"},{"sentence":"The party adopted a unionistic platform, calling for closer ties between the countries.","translation":"その政党は合同主義的な政策綱領を採用し、各国間のより緊密な関係を求めた。"}],"collocations":["unionistic policies","unionistic movement","unionistic ideals","unionistic principles","unionistic tendencies"],"synonyms":["pro-union","trade unionist","unificationist","integrationist","federalist"],"antonyms":["anti-union","separatist","divisionist","factional"],"notes":"The term can refer to either trade unionism or political unionism, depending on the context."}],"etymology":{"value":"Derived from \"union\" + \"-istic\". \"Union\" comes from Latin \"unus\" meaning \"one\". The suffix \"-istic\" indicates a belief in or adherence to the principles of unionism.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌjuːniəˈnɪstɪk/","syllables":"u-ni-on-is-tic"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"The word \"unionistic\" is used to describe something related to the principles of forming unions, either in the context of labor (trade unions) or politics (unification of states or countries). It often implies a positive or supportive attitude towards unions or unification efforts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a very unionistic personality.","correct":"✓ He had strong unionistic beliefs.","note":"\"Unionistic\" describes beliefs or policies, not personality traits. Use other adjectives to describe personality."}],"priority":"★☆☆"},"related_words":{"derivatives":["unionist (noun, adjective)","unionism (noun)"],"related_terms":["trade union","political union","unification","integration"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Relatively rare in general usage.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unionistic' is a specialized term, primarily used in political or labor contexts. It describes ideologies or actions that support the formation or strengthening of unions, whether those are trade unions for workers or political unions between states or nations. Due to its specific and somewhat technical nature, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The government's unionistic policies aimed to integrate the smaller provinces into a single economic entity.","translation":"政府の合同主義的な政策は、より小さな州を単一の経済主体に統合することを目指していた。","type":"general","meaning_category":"political union"},{"sentence":"The workers expressed their unionistic views by joining the newly formed labor organization.","translation":"労働者たちは、新しく結成された労働組合に加入することで、組合主義的な見解を表明した。","type":"general","meaning_category":"trade union"}]}