{"word":"Imbrues","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(古語または文語)～を浸す、染める、特に血で汚す","english_definition":"(archaic or literary) to stain (something, especially someone's hands or clothes) with blood or some other substance; to permeate or saturate.","examples":[{"sentence":"The murderer imbrued his hands in the victim's blood.","translation":"殺人者は犠牲者の血で手を汚した。"},{"sentence":"The battlefield was imbrued with the blood of fallen soldiers.","translation":"戦場は倒れた兵士たちの血で染まっていた。"},{"sentence":"His heart was imbrued with sorrow.","translation":"彼の心は悲しみで満たされていた。"}],"collocations":["imbue hands with blood","imbue a garment with dye","imbue the earth with rain"],"synonyms":["stain","soak","saturate","permeate","defile","contaminate"],"antonyms":["cleanse","purify"]},{"part_of_speech":"verb","transitivity":"vt","definition":"(古語または文語)～に（強い感情、思想などを）しみ込ませる、吹き込む","english_definition":"(archaic or literary) to instill deeply; to permeate with a feeling or quality.","examples":[{"sentence":"The teacher tried to imbue her students with a love of learning.","translation":"先生は生徒たちに学ぶことへの愛着を吹き込もうとした。"},{"sentence":"The artist imbrued his paintings with emotion.","translation":"その芸術家は絵画に感情を込めた。"}],"collocations":["imbue with courage","imbue with hope","imbue with patriotism"],"synonyms":["instill","infuse","inspire","impregnate","endow"],"antonyms":["remove","extract","divest"]}],"etymology":{"value":"From Middle English, from Old French *embruer*, from Latin *imbuere* (“to wet, moisten, soak, dye, stain, imbue”), from *in-* (“in”) + *biber* (“to drink”).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪmˈbruːz/","syllables":"im-brues"},"inflection":{"verb_forms":{"present_simple":["imbrues"],"past_simple":"imbrued","past_participle":"imbrued","present_participle":"imbruing"}},"usage_notes":{"explanation":"'Imbrue' is a rather uncommon word, mostly found in older literature or poetry. It carries a strong sense of staining or soaking, often with negative connotations, especially when referring to blood. When used in a figurative sense, it suggests a deep and pervasive influence or saturation. It's important to note the archaic nature of this word and to use it appropriately in context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The rain imbrued the plants with water.","correct":"✓ The rain saturated the plants with water.","note":"While 'imbrue' can mean to soak, it often carries a connotation of staining or defiling, so 'saturate' is a more neutral choice in this context."},{"incorrect":"✗ He imbrued his success with hard work.","correct":"✓ He achieved his success through hard work.","note":"'Imbrue' is not typically used to describe achieving something through effort. It's more about staining or permeating."}],"priority":"★☆☆"},"related_words":{"derivatives":["imbrued (adjective): stained or saturated","imbruement (noun): the act of imbruing"],"phrases":["imbrued with blood","imbrued with guilt"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Imbrue' is a relatively rare and literary word, primarily encountered in older texts or poetic contexts. It signifies the act of staining or saturating something, often with a connotation of blood or a deep, pervasive influence. Because of its infrequent use and somewhat archaic nature, it's considered a more advanced vocabulary word. Understanding its specific nuance and historical usage is key to interpreting it correctly.","priority":"★☆☆"},"example_sentences":[{"sentence":"The knight's sword was imbrued with the dragon's blood after the fierce battle.","translation":"激しい戦いの後、騎士の剣は竜の血で染まっていた。","type":"verb","meaning_category":"stain with blood"},{"sentence":"The artist sought to imbrue his sculptures with a sense of timeless beauty.","translation":"その芸術家は彫刻に時代を超越した美しさをしみ込ませようとした。","type":"verb","meaning_category":"instill deeply"},{"sentence":"The land was imbrued with the tears of generations past.","translation":"その土地は過去の世代の涙で染まっていた。","type":"verb","meaning_category":"permeate with sorrow"}]}