{"word":"autoincriminar-se","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"(ポルトガル語) 自己負罪する、自己を犯罪に関与させる証拠を提出する","english_definition":"(Portuguese) To incriminate oneself; to provide evidence that implicates oneself in a crime.","examples":[{"sentence":"Ele se recusou a autoincriminar-se perante o tribunal.","translation":"He refused to incriminate himself before the court.","language":"pt"},{"sentence":"A lei protege o direito de uma pessoa não ser forçada a autoincriminar-se.","translation":"The law protects a person's right not to be forced to incriminate themselves.","language":"pt"}],"collocations":["direito de não autoincriminação (right against self-incrimination)"],"synonyms":["incriminar-se","acusar-se","denunciar-se"],"antonyms":["exonerar-se","inocentar-se"]}],"etymology":{"value":"Formed from 'auto' (self) + 'incriminar' (to incriminate) + '-se' (reflexive pronoun).","language":"pt","notes":"Combination of prefix, verb, and reflexive pronoun."},"pronunciation":{"ipa":"/aw.tu.ĩ.kɾi.miˈnaɾ.si/","syllables":"au-to-in-cri-mi-nar-se"},"inflection":{"verb_forms":{"infinitive":"autoincriminar-se","gerund":"autoincriminando-se","past_participle":"autoincriminado"},"notes":"Reflexive verb in Portuguese. Conjugation follows regular patterns for -ar verbs, but with the reflexive pronoun adjusted for each person."},"usage_notes":{"explanation":"'Autoincriminar-se' is a reflexive verb in Portuguese, meaning that the subject of the verb is also the object. It refers to the act of providing evidence or testimony that implicates oneself in a crime or wrongdoing. The right not to 'autoincriminar-se' is a fundamental legal principle in many countries.","language":"pt"},"common_mistakes":{"examples":[{"incorrect":"Ele autoincriminou.","correct":"Ele se autoincriminou.","note":"The reflexive pronoun 'se' is required."}],"language":"pt"},"related_words":{"derivatives":["autoincriminação (self-incrimination)"],"related_terms":["incriminar (to incriminate)","crime (crime)","acusação (accusation)"],"language":"pt"},"level_frequency":{"frequency_google_ngram":"Low frequency, primarily used in legal contexts.","language":"pt"},"readability_explanation":{"level":"C1","text":"'Autoincriminar-se' is a relatively formal and technical term used primarily in legal contexts. It describes the act of providing evidence or testimony that implicates oneself in a crime. Understanding this term is important for comprehending legal discussions and documents related to due process and the right against self-incrimination.","language":"pt"},"example_sentences":[{"sentence":"O réu optou por autoincriminar-se ao confessar o crime.","translation":"The defendant chose to incriminate himself by confessing to the crime.","language":"pt","type":"verb","meaning_category":"self-incrimination"},{"sentence":"A testemunha tem o direito de não autoincriminar-se.","translation":"The witness has the right not to incriminate themselves.","language":"pt","type":"verb","meaning_category":"legal right"}]}