{"word":"scandal-bearer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A person who spreads scandalous or defamatory information; a gossipmonger.","english_definition":"A person who spreads scandalous or defamatory information; a gossipmonger.","examples":[{"sentence":"She was known in the village as a scandal-bearer, always eager to share the latest gossip.","translation":"彼女は村ではスキャンダルを広める人として知られており、いつも最新の噂話をしたがっていた。"},{"sentence":"Don't trust him; he's a scandal-bearer who will twist your words and spread them around.","translation":"彼を信用してはいけない。彼はあなたの言葉を歪めて広めるスキャンダル屋だ。"}],"collocations":["a notorious scandal-bearer","a malicious scandal-bearer","a village scandal-bearer"],"synonyms":["gossipmonger","rumormonger","talebearer","backbiter","slanderer","defamer"],"antonyms":["truthful person","honest person","loyal friend"]}],"etymology":{"value":"The term combines \"scandal,\" referring to discreditable or disgraceful action or event causing public outrage, with \"bearer,\" indicating someone who carries or spreads something. Thus, a scandal-bearer is someone who carries or spreads scandalous information.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskændəlˌbeərə(r)/","syllables":"scan-dal-bear-er"},"inflection":{"noun_plural":"scandal-bearers"},"usage_notes":{"explanation":"The term \"scandal-bearer\" is often used to describe someone who enjoys spreading rumors and gossip, especially if it damages the reputation of others. It carries a negative connotation, implying that the person is untrustworthy and malicious.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a scandal-bear.","correct":"✓ He is a scandal-bearer.","note":"The correct term is \"scandal-bearer,\" not \"scandal-bear.\""},{"incorrect":"✗ She scandal-bears the news.","correct":"✓ She is a scandal-bearer.","note":"\"Scandal-bearer\" is a noun, not a verb. To describe the act of spreading scandal, use verbs like \"spread,\" \"gossip,\" or \"rumormonger.\""}],"priority":"★★☆"},"related_words":{"derivatives":["scandal (noun)","bearer (noun)"],"phrasal_verbs":[],"related_terms":["gossip","rumor","slander","defamation","talebearing"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"scandal-bearer\" is relatively uncommon and is used to describe someone who spreads scandalous or defamatory information. It is a more descriptive and somewhat formal way of referring to a gossipmonger or rumormonger. Understanding the term requires a good vocabulary and an understanding of the negative connotations associated with spreading rumors and gossip."},"example_sentences":[{"sentence":"The newspaper described him as a scandal-bearer, eager to publish any damaging rumor about the politician.","translation":"その新聞は彼を、政治家に関するいかなる有害な噂でも掲載したがるスキャンダル屋だと評した。","type":"noun","meaning_category":"Spreader of scandalous information"},{"sentence":"She tried to avoid the scandal-bearers at the party, knowing they would twist her words.","translation":"彼女はパーティーでスキャンダル屋を避けようとした。彼らが彼女の言葉を歪めるだろうと知っていたからだ。","type":"noun","meaning_category":"Gossipmonger"},{"sentence":"The small town was rife with scandal-bearers, making it difficult to keep any secrets.","translation":"その小さな町はスキャンダル屋で溢れており、秘密を守るのが難しかった。","type":"noun","meaning_category":"Rumor spreader"}]}