{"word":"iddat","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(イスラム法)離婚または死別後の女性が再婚する前に守るべき待機期間","english_definition":"(in Islamic law) the period a woman must observe after the dissolution of a marriage, by death or divorce, before she can remarry.","examples":[{"sentence":"The iddat period varies depending on whether the marriage ended due to divorce or the death of the husband.","translation":"イッダの期間は、離婚による婚姻の解消か、夫の死亡によるものかで異なります。"},{"sentence":"During the iddat, the woman is entitled to financial support from her former husband.","translation":"イッダ期間中、女性は元夫からの経済的支援を受ける権利があります。"}],"collocations":["observe iddat","iddat period","waiting period (synonymous)"],"synonyms":["waiting period"],"antonyms":[]},{"part_of_speech":"noun","definition":"(一般的に)待機期間、熟慮期間","english_definition":"(generally) a waiting period, a period for reflection.","examples":[{"sentence":"The company imposed an iddat on the employee before making a final decision.","translation":"会社は最終決定を下す前に、従業員にイッダ（待機期間）を課しました。"}],"collocations":["impose iddat","iddat for reflection"],"synonyms":["cooling-off period","probationary period"],"antonyms":[]}],"etymology":{"value":"アラビア語の 'عدة ('iddah)' に由来し、数えること、計算することを意味する 'عَدّ (ʿadda)' という動詞から派生しています。これは、待機期間の日数を数えることに由来します。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɪdæt/","syllables":"id-dat"},"inflection":{"noun_plural":"iddats"},"usage_notes":{"explanation":"「**iddat**」は、主にイスラム法において、離婚または死別後の女性が再婚する前に守らなければならない待機期間を指す言葉です。この期間は、女性が妊娠しているかどうかを確認し、父親が不明な子供が生まれるのを防ぐために設けられています。また、死別の場合には、故人への敬意を表し、喪に服する期間としての意味合いも持ちます。より一般的に、重要な決定を下す前の「待機期間」や「熟慮期間」を指す比喩的な意味で使用されることもあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The iddat is the same for all women.","correct":"✓ The iddat period varies depending on the circumstances.","note":"イッダの期間は、離婚か死別か、妊娠しているかどうかなど、状況によって異なります。"},{"incorrect":"✗ A man also observes iddat after divorce.","correct":"✓ Iddat is observed by women after divorce or the death of their husband.","note":"イッダは主に女性が守るべき期間であり、男性には適用されません。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - イスラム法関連の文脈でのみ使用される専門用語。","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"「**Iddat**」は、イスラム法における専門用語であり、離婚または死別後の女性が再婚する前に守るべき待機期間を指します。この期間は、血統の明確化や故人への服喪など、複数の目的を持ちます。法的な文脈やイスラム教の文化に関する議論でのみ使用されるため、一般的な英語の語彙ではありません。専門的な知識を必要とするため、高度な読解力が必要です。"},"example_sentences":[{"sentence":"The duration of the **iddat** depends on various factors, including whether the woman is pregnant.","translation":"イッダの期間は、女性が妊娠しているかどうかなど、さまざまな要因によって異なります。","type":"noun","meaning_category":"待機期間 (イスラム法)"},{"sentence":"During her **iddat**, she is not allowed to leave the house except for essential needs.","translation":"彼女はイッダ期間中、必要不可欠な用事を除いて外出を許されていません。","type":"noun","meaning_category":"待機期間 (イスラム法)"}]}