{"word":"Czechization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"チェコ化、チェコ語化","english_definition":"The process of making something more Czech in character or culture; the adoption of Czech language, culture, or customs.","examples":[{"sentence":"The Czechization of street names in Prague after the fall of communism was a significant symbolic act.","translation":"共産主義崩壊後、プラハの通りの名前がチェコ語化されたことは、重要な象徴的な行為だった。"},{"sentence":"Some scholars argue that the policies of the First Czechoslovak Republic promoted Czechization at the expense of other ethnic groups.","translation":"一部の学者は、第一次チェコスロバキア共和国の政策は、他の民族グループを犠牲にしてチェコ化を推進したと主張している。"}],"collocations":["cultural Czechization (文化的なチェコ化)","linguistic Czechization (言語的なチェコ化)","political Czechization (政治的なチェコ化)"],"synonyms":["Czechification","Bohemization"],"antonyms":["Germanization","Russification","De-Czechization"]}],"etymology":{"value":"Formed from \"Czech\" + \"-ization\".","priority":"★★★"},"pronunciation":{"ipa":"/ˌtʃɛkaɪˈzeɪʃən/","syllables":"Czech-i-za-tion"},"inflection":{"noun_plural":"Czechizations"},"usage_notes":{"explanation":"Czechization refers to the process of something becoming more Czech. This can refer to language, culture, or customs. It is often used in historical contexts to describe policies or movements that aimed to promote Czech identity or language, sometimes at the expense of other cultures or languages within a given territory.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Czechization is good for all people.","correct":"✓ Czechization may have both positive and negative impacts on different groups.","note":"Czechization can be a sensitive topic, as it often involves cultural or linguistic dominance. Avoid making generalizations about its universal benefits."}],"priority":"★★☆"},"related_words":{"derivatives":["Czechize (verb)","Czech (adjective, noun)"],"related":["Bohemia","Czechoslovakia","Czech Republic"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term \"Czechization\" is a specialized term, primarily used in historical or sociopolitical contexts when discussing the spread or imposition of Czech language, culture, or identity. It's not commonly used in everyday conversation. Understanding the term requires some familiarity with Czech history and the dynamics of cultural and linguistic influence."},"example_sentences":[{"sentence":"The government implemented a program of Czechization in the schools.","translation":"政府は学校でチェコ化プログラムを実施した。","type":"general","meaning_category":"process"},{"sentence":"The Czechization of the region led to tensions with the German-speaking minority.","translation":"その地域のチェコ化は、ドイツ語を話す少数派との間に緊張を引き起こした。","type":"historical","meaning_category":"historical impact"}]}