{"word":"basal","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"基礎の、基底の、根本の","english_definition":"forming or belonging to a bottom layer or base.","examples":[{"sentence":"The basal layer of the skin contains cells that divide and replenish the upper layers.","translation":"皮膚の基底層には、分裂して上層を補充する細胞が含まれています。"},{"sentence":"The basal metabolic rate is the amount of energy your body uses at rest.","translation":"基礎代謝率は、体が安静時に使用するエネルギー量です。"},{"sentence":"The basal ganglia are a group of structures in the brain involved in motor control.","translation":"基底核は、運動制御に関与する脳内の構造群です。"}],"collocations":["basal layer (基底層)","basal metabolic rate (基礎代謝率)","basal ganglia (基底核)","basal cell carcinoma (基底細胞癌)"],"synonyms":["fundamental","basic","underlying","foundational"],"antonyms":["apical","terminal","superficial"]}],"etymology":{"value":"From Late Latin 'basalis', from Latin 'basis' meaning 'base'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbeɪsəl/","syllables":"ba-sal"},"inflection":{"notes":"Adjective, comparative and superlative forms are 'more basal' and 'most basal' respectively, though these are less common."},"usage_notes":{"explanation":"'Basal' generally refers to something that forms a base or foundation, either literally or figuratively. In biology and medicine, it often describes the lowest layer of cells or tissues, or a fundamental physiological process. In geology, it can refer to the bottom layer of a rock formation. The term implies a starting point or essential component.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The basal of the mountain was covered in trees.","correct":"✓ The base of the mountain was covered in trees.","note":"'Basal' is an adjective, so it must modify a noun. 'Base' is the noun meaning the bottom or foundation."},{"incorrect":"✗ The basal temperature is taken under the arm.","correct":"✓ The basal temperature is taken orally or rectally.","note":"Basal temperature refers to the body's resting temperature, typically measured orally or rectally, not under the arm."}],"priority":"★★☆"},"related_words":{"derivatives":["basally (adverb)"],"related_terms":["base (noun)","basis (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, common in scientific and medical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Basal' is a technical term primarily used in scientific and medical contexts to describe something that forms a base or foundation. It's often used to describe the lowest layer of cells or tissues in biology, or a fundamental physiological process like basal metabolic rate. Understanding this term requires familiarity with scientific vocabulary and concepts. While not commonly used in everyday conversation, it's important for comprehending scientific literature."},"example_sentences":[{"sentence":"The **basal** leaves of the plant are different in shape from the stem leaves.","translation":"その植物の根生葉は、茎葉とは形が異なります。","type":"adjective","meaning_category":"基礎の、基底の"},{"sentence":"Maintaining a healthy **basal** metabolic rate is important for weight management.","translation":"健康的な基礎代謝率を維持することは、体重管理にとって重要です。","type":"adjective","meaning_category":"基礎の、基底の"},{"sentence":"Damage to the **basal** ganglia can lead to movement disorders.","translation":"基底核の損傷は、運動障害を引き起こす可能性があります。","type":"adjective","meaning_category":"基礎の、基底の"}]}