{"word":"proromantic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ロマンチックな感情を経験することに肯定的または好意的な人、またはロマンチックな関係を求めること。","english_definition":"Being positive towards or favorable to experiencing romantic feelings or seeking romantic relationships.","examples":[{"sentence":"She identifies as proromantic because she enjoys the idea of romantic relationships even though she doesn't experience romantic attraction herself.","translation":"彼女はロマンチックな感情を抱くことはないものの、ロマンチックな関係という考えが好きなので、プロロマンチックであると認識しています。"},{"sentence":"Many proromantic asexuals seek out partnerships that involve emotional intimacy without sexual attraction.","translation":"多くのプロロマンチックな無性愛者は、性的魅力なしに感情的な親密さを伴うパートナーシップを求めています。"}],"collocations":["proromantic asexual","proromantic orientation","identify as proromantic"],"synonyms":["romance-positive","romance-favorable"],"antonyms":["antiromantic","romance-repulsed"]}],"etymology":{"value":"「pro-」（賛成の）と「romantic」（ロマンチックな）の組み合わせ。","priority":"★★★"},"pronunciation":{"ipa":"/ˌproʊroʊˈmæntɪk/","syllables":"pro-ro-man-tic"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化があります。"},"usage_notes":{"explanation":"「**proromantic**」は、主に無性愛コミュニティで使用される用語で、ロマンチックな感情や関係に対する肯定的な姿勢を表します。プロロマンチックな人は、自身がロマンチックな魅力を感じなくても、ロマンチックな関係の概念を高く評価したり、ロマンチックな関係を望んだりすることがあります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is proromantic with her.","correct":"✓ He is proromantic. / ✓ He identifies as proromantic.","note":"「proromantic」は、誰か特定の相手に対してロマンチックな感情を持っているという意味ではありません。ロマンチックな感情や関係全般に対して肯定的な姿勢を持っていることを意味します。"},{"incorrect":"✗ Proromantic means experiencing romantic attraction.","correct":"✓ Proromantic means being favorable towards romantic feelings or relationships, even if one doesn't experience romantic attraction.","note":"プロロマンチックであることは、必ずしもロマンチックな魅力を経験することを意味しません。ロマンチックな感情や関係を肯定的に捉えることを意味します。"}],"priority":"★★☆"},"related_words":{"derivatives":["proromanticism (名詞: プロロマンチシズム)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - 主に特定のオンラインコミュニティで使用される用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**proromantic**」は、ロマンチックな感情や関係に対する肯定的な姿勢を指す専門用語です。特に無性愛コミュニティで使用され、自身がロマンチックな魅力を感じなくても、ロマンチックな関係の概念を高く評価したり、望んだりする人を指します。この用語は、ロマンチックな感情を経験すること自体ではなく、その感情や関係に対する態度に焦点を当てています。"},"example_sentences":[{"sentence":"As a proromantic asexual, she enjoys reading romance novels and watching romantic comedies.","translation":"プロロマンチックな無性愛者として、彼女は恋愛小説を読んだり、恋愛コメディを見たりするのを楽しんでいます。","type":"adjective","meaning_category":"ロマンチックな感情を経験することに肯定的"},{"sentence":"He is proromantic and actively seeks a romantic partner, despite not experiencing sexual attraction.","translation":"彼はプロロマンチックであり、性的魅力を感じないにもかかわらず、積極的にロマンチックなパートナーを探しています。","type":"adjective","meaning_category":"ロマンチックな関係を求めること"}]}