{"word":"tar-and-feathering","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(歴史的に)タールと羽毛刑: 人に熱いタールを塗りつけ、羽毛をまぶして辱める私刑","english_definition":"A form of public punishment and humiliation in which hot tar is poured onto someone's body and then covered with feathers.","examples":[{"sentence":"In the 18th century, tar-and-feathering was used as a form of vigilante justice.","translation":"18世紀には、タールと羽毛刑は自警団による私刑の形として用いられた。"},{"sentence":"The threat of tar-and-feathering was enough to deter some people from speaking out against the group.","translation":"タールと羽毛刑の脅威は、一部の人々がそのグループに対して発言するのを阻止するのに十分だった。"}],"collocations":["be subjected to tar-and-feathering","threat of tar-and-feathering"],"synonyms":["lynching","public humiliation","vigilante justice"],"antonyms":[]},{"part_of_speech":"verb","definition":"(他動詞)タールと羽毛刑にする","english_definition":"To punish someone by covering them in hot tar and then feathers.","examples":[{"sentence":"The mob threatened to tar-and-feather the suspected thief.","translation":"暴徒は、泥棒の疑いがある者をタールと羽毛刑にすると脅した。"}],"collocations":["tar-and-feather someone"],"synonyms":["lynch","humiliate publicly"],"antonyms":[]}],"etymology":{"value":"The term comes from the historical practice of applying hot tar and feathers to someone as a form of punishment and public humiliation. This practice was particularly common in the 18th century, especially during the American Revolution.","priority":"★★★"},"pronunciation":{"ipa":"/ˌtɑːr ænd ˈfɛðərɪŋ/","syllables":"tar-and-feath-er-ing"},"inflection":{"noun_plural":"tar-and-featherings","verb_forms":{"present_simple":["tar-and-feather","tar-and-feathers"],"past_simple":"tar-and-feathered","past_participle":"tar-and-feathered","present_participle":"tar-and-feathering"}},"usage_notes":{"explanation":"Tar-and-feathering is a historical form of punishment and public humiliation. It is rarely used literally today, but the term may be used metaphorically to describe a severe public shaming or denunciation.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ They tar and feathered him of his crimes.","correct":"✓ They tarred and feathered him for his crimes.","note":"The correct phrase is 'tar and feather someone for something' or 'tar and feather someone because of something'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["lynching","vigilantism","mob rule"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"tar-and-feathering\" refers to a historical form of punishment where hot tar and feathers were applied to someone's body. It's a relatively uncommon term in modern usage, primarily appearing in historical contexts or metaphorical references to public shaming. Understanding its meaning requires familiarity with historical practices and figurative language."},"example_sentences":[{"sentence":"During the American Revolution, tax collectors were sometimes subjected to tar-and-feathering.","translation":"アメリカ独立戦争中、徴税人は時にタールと羽毛刑に処された。","type":"noun","meaning_category":"私刑"},{"sentence":"The angry townspeople threatened to tar-and-feather the con artist.","translation":"怒った町の人々は、詐欺師をタールと羽毛刑にすると脅した。","type":"verb","meaning_category":"タールと羽毛刑にする"},{"sentence":"The scandal was a form of metaphorical tar-and-feathering for the politician.","translation":"そのスキャンダルは、その政治家にとって比喩的なタールと羽毛刑だった。","type":"noun (metaphorical)","meaning_category":"比喩的な意味での公開処刑"}]}