{"word":"dietary-restricted","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"食事制限のある、食事制限を受けている","english_definition":"Having limitations or restrictions on what one can eat, usually due to medical, ethical, or religious reasons.","examples":[{"sentence":"Many restaurants now offer options for dietary-restricted customers.","translation":"多くのレストランが現在、食事制限のある顧客のために選択肢を提供しています。"},{"sentence":"It's important to ask about dietary-restricted needs when planning a group meal.","translation":"グループでの食事を計画する際には、食事制限のあるニーズについて尋ねることが重要です。"},{"sentence":"The chef is experienced in preparing meals for those who are dietary-restricted.","translation":"そのシェフは、食事制限のある人のための食事を作ることに慣れています。"}],"collocations":["dietary-restricted diet","dietary-restricted food","dietary-restricted meal","dietary-restricted needs","dietary-restricted individuals","dietary-restricted options"],"synonyms":["restricted diet","special diet","limited diet"],"antonyms":["unrestricted diet","regular diet","standard diet"]}],"etymology":{"value":"The term is formed by combining \"dietary\" (relating to diet) with \"restricted\" (limited or constrained).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈdaɪəˌtɛri rɪˈstrɪktɪd/","syllables":"di-e-ta-ry ri-strict-ed"},"inflection":{"notes":"Adjective, does not have comparative or superlative forms."},"usage_notes":{"explanation":"\"Dietary-restricted\" is used to describe someone whose food choices are limited due to health, ethical, or religious concerns. This can include allergies, intolerances, diabetes, vegetarianism, veganism, religious dietary laws (like kosher or halal), and other specific eating patterns. It's a more formal and precise way of saying someone has a \"special diet.\"","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a dietary-restricted.","correct":"✓ He is dietary-restricted. / ✓ He has a dietary restriction.","note":"\"Dietary-restricted\" is an adjective, so it needs to modify a noun. To refer to a person, you can say \"He is dietary-restricted\" (implying he has a dietary-restricted diet) or \"He has a dietary restriction.\""},{"incorrect":"✗ dietary restricted person","correct":"✓ dietary-restricted person","note":"The hyphen is important to show that \"dietary\" and \"restricted\" are working together to modify \"person.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["dietary restriction","dietary needs","food allergy","food intolerance","vegetarian","vegan","gluten-free","dairy-free","nut-free"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Dietary-restricted' is a term used to describe a person or a diet that has limitations on what can be eaten. This is often due to health reasons like allergies or diabetes, ethical reasons like vegetarianism, or religious reasons like keeping kosher. It's a more formal way of saying someone has a 'special diet'. When you see this term, it means you need to be careful about what food is offered to that person."},"example_sentences":[{"sentence":"We need to ensure that all guests have access to dietary-restricted options at the wedding.","translation":"結婚式では、すべてのゲストが食事制限のあるオプションを利用できるようにする必要があります。","type":"adjective","meaning_category":"食事制限のある"},{"sentence":"The hospital provides dietary-restricted meals for patients with specific medical conditions.","translation":"病院では、特定の病状を持つ患者のために食事制限のある食事を提供しています。","type":"adjective","meaning_category":"食事制限のある"},{"sentence":"Please inform us of any dietary-restricted requirements when booking your reservation.","translation":"ご予約の際、食事制限のある要件があればお知らせください。","type":"adjective","meaning_category":"食事制限のある"}]}