{"word":"negators","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"否定するもの、否定する人、無効にするもの","english_definition":"agents or things that negate, nullify, or deny something","examples":[{"sentence":"The amendment acted as one of the negators of the original law, significantly weakening its impact.","translation":"その修正条項は、元の法律の否定要因の一つとして機能し、その影響を大幅に弱めた。"},{"sentence":"In logic, certain operators function as negators, reversing the truth value of a statement.","translation":"論理学では、特定の演算子が否定子として機能し、ステートメントの真理値を反転させる。"}],"collocations":["logical negators","environmental negators","social negators"],"synonyms":["nullifiers","invalidators","deniers","opposers","contradictors"],"antonyms":["affirmers","validators","supporters","approvers"]}],"etymology":{"value":"Derived from the verb 'negate,' which comes from the Latin 'negare,' meaning 'to deny.' The suffix '-or' indicates an agent or instrument that performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/nɪˈɡeɪtərz/","syllables":"ne-ga-tors"},"inflection":{"singular":"negator"},"usage_notes":{"explanation":"The term 'negators' refers to entities, actions, or concepts that cause something to be ineffective or untrue. It can be used in various contexts, including law, logic, and general discourse. It often implies a force or element that actively works against or undermines something else.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a big negator of climate change, so he doesn't believe in it.","correct":"✓ He is a big denier of climate change, so he doesn't believe in it.","note":"'Denier' is more commonly used in the context of denying established facts or theories, such as climate change."}],"priority":"★☆☆"},"related_words":{"derivatives":["negate","negation","negative"],"phrases":["act as negators","function as negators"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Negators' is a relatively uncommon term that refers to things or agents that negate or invalidate something. It is often used in formal or technical contexts, such as law or logic, to describe elements that reverse or undermine a particular outcome or statement. Understanding the root verb 'negate' is helpful in grasping the meaning of 'negators.' "},"example_sentences":[{"sentence":"The presence of certain enzymes acts as negators of the drug's intended effect.","translation":"特定の酵素の存在は、薬の意図された効果の否定因子として作用する。","type":"noun","meaning_category":"agents that negate"},{"sentence":"These policies are seen as negators of individual freedom.","translation":"これらの政策は、個人の自由の否定要因と見なされている。","type":"noun","meaning_category":"things that negate"}]}