{"word":"tetraseme","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(言語学) 四つの意味素を持つ単語または形態素","english_definition":"(linguistics) A word or morpheme that has four sememes (semantic units of meaning).","examples":[{"sentence":"The word 'plant' can be considered a tetraseme because it has meanings related to vegetation, factories, the act of planting, and a plan or scheme.","translation":"「plant」という単語は、植物、工場、植える行為、計画または策略に関連する意味を持つため、四つの意味素を持つ単語と見なすことができます。"}],"collocations":["analyze a tetraseme","identify tetrasemes in a language"],"synonyms":["polyseme","multiseme"],"antonyms":["monoseme"],"notes":"Tetrasemes are a type of polyseme, which means they have multiple related meanings. The identification of sememes can be subjective and depend on the level of granularity used in semantic analysis."}],"etymology":{"value":"Derived from the Greek words 'tetra-' (meaning 'four') and 'seme' (meaning 'sign' or 'meaning').","priority":"★★★"},"pronunciation":{"ipa":"/ˈtɛtrəsiːm/","syllables":"te-tra-seme"},"inflection":{"noun_plural":"tetrasemes"},"usage_notes":{"explanation":"The term 'tetraseme' is primarily used in linguistics and semantics to describe words with four distinct but related meanings. It is part of a broader classification of words based on the number of sememes they possess.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ A tetraseme is a word with four syllables.","correct":"✓ A tetraseme is a word with four sememes (units of meaning).","note":"The term refers to semantic units, not phonetic units (syllables)."}],"priority":"★★☆"},"related_words":{"derivatives":["sememe","polyseme","monoseme"],"related_terms":["semantics","morpheme","lexeme"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - primarily a term used in specialized linguistic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Tetraseme' is a technical term used in linguistics to describe a word that has four distinct but related meanings (sememes). This term is not commonly used outside of academic discussions of semantics and morphology. Understanding this term requires familiarity with linguistic concepts such as sememes, morphemes, and polysemy."},"example_sentences":[{"sentence":"Linguists debated whether 'bank' should be considered a tetraseme or a polyseme with more than four related meanings.","translation":"言語学者は、「bank」という単語を四つの関連する意味を持つ単語と見なすべきか、または四つ以上の関連する意味を持つ多義語と見なすべきかを議論しました。","type":"example","meaning_category":"linguistics"},{"sentence":"The analysis of tetrasemes helps in understanding the semantic structure of a language.","translation":"四つの意味素を持つ単語の分析は、言語の意味構造を理解するのに役立ちます。","type":"example","meaning_category":"semantics"}]}