{"word":"admission-focused","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"入学に焦点を当てた、入学選考に特化した","english_definition":"Focused primarily on the process or requirements for admission, typically to a school, university, or other institution.","examples":[{"sentence":"The school's website has an admission-focused section with information on application deadlines and requirements.","translation":"その学校のウェブサイトには、出願締め切りや要件に関する情報が掲載された入学選考に特化したセクションがあります。"},{"sentence":"The consultant provided admission-focused advice to help students prepare their applications.","translation":"コンサルタントは、学生が応募書類を準備するのを支援するために、入学選考に特化したアドバイスを提供しました。"},{"sentence":"The workshop is admission-focused, covering topics such as writing a compelling personal statement and preparing for interviews.","translation":"このワークショップは入学選考に焦点を当てており、説得力のある自己推薦書の書き方や面接の準備などのトピックを取り扱います。"}],"collocations":["admission-focused strategy","admission-focused advice","admission-focused materials","admission-focused event","admission-focused program"],"synonyms":["enrollment-oriented","application-centered","acceptance-driven"],"antonyms":["general","broad","comprehensive"]}],"etymology":{"value":"The word is a compound adjective formed by combining 'admission' (the process of being allowed to enter a place or organization) and 'focused' (having one's attention or interest directed at something specific).","priority":"N/A"},"pronunciation":{"ipa":"/ədˈmɪʃən ˈfoʊkəst/","syllables":"ad-mis-sion fo-cused"},"inflection":{"notes":"Since this is an adjective, it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Admission-focused' is used to describe something that is specifically designed or oriented towards the process of gaining admission to an institution. It is often used in the context of education, referring to strategies, advice, or materials that are intended to help students navigate the application process.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The program is focus admission.","correct":"✓ The program is admission-focused.","note":"The correct term is 'admission-focused,' which is a compound adjective. Using 'focus admission' is grammatically incorrect."}],"priority":"N/A"},"related_words":{"derivatives":["admission","focused"],"phrasal_verbs":[],"related_terms":["admissions","enrollment","application","acceptance","matriculation"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'admission-focused' is a specialized term primarily used in educational contexts. It describes something that is specifically related to or designed to help with the process of gaining admission to a school, university, or other institution. The term is relatively straightforward but may not be familiar to those outside of educational or academic environments."},"example_sentences":[{"sentence":"The university offers admission-focused workshops to help prospective students prepare their applications.","translation":"その大学は、入学希望者が応募書類を準備するのを支援するために、入学選考に焦点を当てたワークショップを提供しています。","type":"general","meaning_category":"general"},{"sentence":"Our admission-focused counseling services provide personalized guidance to students seeking to gain acceptance to top universities.","translation":"当社の入学選考に焦点を当てたカウンセリングサービスは、一流大学への入学を目指す学生に個別のガイダンスを提供します。","type":"general","meaning_category":"general"}]}