{"word":"cherty","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"チャート質の、チャートに富む","english_definition":"Containing or resembling chert.","examples":[{"sentence":"The hillside was covered in cherty soil.","translation":"その丘の斜面はチャート質の土壌で覆われていた。"},{"sentence":"The rock formation was described as cherty limestone.","translation":"その岩石層はチャート質の石灰岩と記述された。"}],"collocations":["cherty soil","cherty limestone","cherty rock"],"synonyms":["siliceous","flinty"],"antonyms":[]}],"etymology":{"value":"Derived from the noun 'chert', with the addition of the adjective-forming suffix '-y'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtʃɜːrti/","syllables":"cher-ty"},"inflection":{"notes":"Comparative and superlative forms are 'more cherty' and 'most cherty', respectively, as it's a descriptive adjective."},"usage_notes":{"explanation":"'Cherty' is a descriptive adjective used in geology and related fields to indicate the presence or abundance of chert in a material, such as soil or rock. It is not commonly used outside of these contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The cherty person was very knowledgeable about rocks.","correct":"✓ The geologist was very knowledgeable about rocks.","note":"'Cherty' describes a material, not a person. Use a term like 'geologist' to describe a person knowledgeable about rocks."}],"priority":"★★★"},"related_words":{"derivatives":["chert (noun): A hard, dark, opaque sedimentary rock, composed of cryptocrystalline silica.","chertification (noun): The process by which a rock becomes cherty."],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Cherty' is a specialized geological term used to describe materials containing chert. Understanding this word requires familiarity with geological concepts and vocabulary. It is not typically encountered in general English usage."},"example_sentences":[{"sentence":"The archaeologists found cherty tools at the excavation site.","translation":"考古学者は発掘現場でチャート質の道具を発見した。","type":"adjective","meaning_category":"Containing chert"},{"sentence":"The area is known for its distinctive cherty outcrops.","translation":"その地域は特徴的なチャート質の露頭で知られている。","type":"adjective","meaning_category":"Composed of chert"}]}