{"word":"engine-sizer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A tool or software used to determine the appropriate size of an engine for a specific application.","english_definition":"A tool or software used to determine the appropriate size of an engine for a specific application.","examples":[{"sentence":"The engineer used an engine-sizer to calculate the optimal engine displacement for the new vehicle.","translation":"エンジニアは、新しい車両に最適なエンジン排気量を計算するためにエンジンサイザーを使用した。"},{"sentence":"Several online engine-sizers are available to help hobbyists select the right engine for their projects.","translation":"趣味家がプロジェクトに適したエンジンを選択するのに役立つ、いくつかのオンラインエンジンサイザーが利用可能である。"}],"collocations":["online engine-sizer","engine-sizer software","engine displacement","optimal engine size"],"synonyms":["engine sizing tool","engine calculator"],"antonyms":[]}],"etymology":{"value":"Combination of 'engine' and 'sizer', indicating a tool for determining engine size.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɛndʒɪnˌsaɪzər/","syllables":"en-gine-si-zer"},"inflection":{"noun_plural":"engine-sizers"},"usage_notes":{"explanation":"The term 'engine-sizer' is primarily used in engineering contexts, particularly in automotive, aerospace, and mechanical engineering. It refers to a specific tool or software designed to calculate and optimize engine size based on various parameters such as vehicle weight, desired performance, and fuel efficiency.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The engine sizer is used for repairing engines.","correct":"✓ The engine-sizer is used for determining engine size.","note":"Engine-sizers are for calculating engine size, not repairing engines."}],"priority":"★★☆"},"related_words":{"derivatives":["engine","size","sizing"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'engine-sizer' is a technical term used in engineering, specifically related to the process of determining the appropriate size of an engine for a particular application. It's not a commonly used word outside of these contexts, so its readability is limited to those with relevant technical knowledge."},"example_sentences":[{"sentence":"The software acts as an **engine-sizer**, helping engineers to choose the most efficient engine for their design.","translation":"そのソフトウェアは**エンジンサイザー**として機能し、エンジニアが設計に最も効率的なエンジンを選択するのに役立つ。","type":"noun","meaning_category":"tool"},{"sentence":"Using the **engine-sizer**, we were able to reduce fuel consumption by 15%.","translation":"**エンジンサイザー**を使用することで、燃料消費量を15％削減することができました。","type":"noun","meaning_category":"tool"}]}