{"word":"tasar","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"タッサーシルク、野蚕糸（やさんし）","english_definition":"A type of silk produced by wild silkworms, typically of the Antheraea genus, that is coarser and stronger than cultivated silk.","examples":[{"sentence":"The shawl was made of beautiful tasar silk.","translation":"そのショールは美しいタッサーシルクで作られていた。"},{"sentence":"Tasar silk is known for its durability and natural golden sheen.","translation":"タッサーシルクは耐久性と自然な黄金色の光沢で知られている。"}],"collocations":["tasar silk saree","tasar fabric","natural tasar","pure tasar"],"synonyms":["wild silk","tussah silk"],"antonyms":[]}],"etymology":{"value":"The word \"tasar\" or \"tussah\" is derived from the Sanskrit word \"tassar\" which means shuttle.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɑːsər/","syllables":"ta-sar"},"inflection":{"notes":"It is a noun and its plural form is \"tasars\" or \"tasar silks\"."},"usage_notes":{"explanation":"Tasar silk is valued for its texture and natural colors, which range from pale gold to dark brown. It is often used in clothing, home furnishings, and handicrafts. The production of tasar silk is an important source of income for many rural communities in India and other parts of Asia.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a tasar silk, it was very soft.","correct":"✓ I bought some tasar silk; it was very soft.","note":"Tasar silk is typically used as an uncountable noun."}],"priority":"★★★"},"related_words":{"derivatives":["tasariculture (タッサー養蚕)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tasar' refers to a specific type of silk obtained from wild silkworms. Understanding this word requires some familiarity with textile production and regional variations in silk types. It is not a commonly used word outside of contexts related to textiles, fashion, or specific regions where tasar silk production is prevalent."},"example_sentences":[{"sentence":"Many artisans in the region depend on tasar silk production for their livelihood.","translation":"その地域の多くの職人が、タッサーシルクの生産で生計を立てている。","type":"noun","meaning_category":"type of silk"},{"sentence":"The exhibition featured a stunning collection of tasar silk sarees.","translation":"その展示会では、タッサーシルクのサリーの素晴らしいコレクションが展示されていた。","type":"noun","meaning_category":"type of silk"}]}