{"word":"unanticipation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"予期しないこと、予想外であること、期待の欠如","english_definition":"The state of not anticipating something; lack of anticipation or expectation.","examples":[{"sentence":"The success of the project was a complete surprise, a result of pure unanticipation.","translation":"そのプロジェクトの成功は全くのサプライズであり、純粋な予期せぬ結果だった。"},{"sentence":"Her reaction showed complete unanticipation of the event.","translation":"彼女の反応は、その出来事を全く予期していなかったことを示していた。"}],"collocations":["complete unanticipation","total unanticipation","sheer unanticipation"],"synonyms":["unexpectedness","surprise","lack of foresight","unpreparedness","lack of expectation"],"antonyms":["anticipation","expectation","foresight","preparedness"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to the noun 'anticipation'. 'Anticipation' comes from the Latin 'anticipare', meaning 'to take beforehand'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnænˌtɪsɪˈpeɪʃən/","syllables":"un-an-ti-ci-pa-tion"},"inflection":{"noun_plural":"unanticipations (rarely used)"},"usage_notes":{"explanation":"'Unanticipation' is a relatively rare word, used to describe a state or situation where something is not anticipated or expected. It emphasizes the lack of foresight or preparation. It is often used to highlight the surprising nature of an event or outcome.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unanticipation was very high.","correct":"✓ The level of unanticipation was very high. / ✓ The event was met with complete unanticipation.","note":"'Unanticipation' refers to a state or lack thereof, not a measurable quantity. It's better to describe the level *of* unanticipation or use the word to describe how an event was received."}],"priority":"★☆☆"},"related_words":{"derivatives":["unanticipated (adjective): not anticipated; unexpected"],"related_terms":["anticipation (noun): the act of anticipating; expectation","unexpect (verb): to not expect; to be surprised by"]},"level_frequency":{"CEFR":"C2 (very rare)","frequency_google_ngram":"Extremely low frequency - a very uncommon word.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unanticipation' is a rare and complex word that means the state of not expecting something. It's used to describe situations where there is a complete lack of foresight or preparation for an event. Because it's uncommon, it's more likely to be found in formal writing or specialized contexts. It's formed by adding the prefix 'un-' to 'anticipation', which means to expect or foresee something. Understanding the root word 'anticipation' is key to understanding 'unanticipation'."},"example_sentences":[{"sentence":"The company's failure was due to a complete unanticipation of market changes.","translation":"その会社の失敗は、市場の変化を全く予期していなかったことに起因する。","type":"noun","meaning_category":"lack of expectation"},{"sentence":"The discovery was a result of pure chance and unanticipation.","translation":"その発見は、純粋な偶然と予期せぬ結果によるものだった。","type":"noun","meaning_category":"unexpectedness"},{"sentence":"The success of the new product was a testament to the power of unanticipation in a rapidly changing market.","translation":"新製品の成功は、急速に変化する市場における予期せぬ力の証だった。","type":"noun","meaning_category":"surprise"}]}