{"word":"estrogen-resistant","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"エストロゲン抵抗性の、エストロゲンに反応しない","english_definition":"Not responsive to estrogen; exhibiting resistance to the effects of estrogen.","examples":[{"sentence":"The tumor cells were found to be estrogen-resistant.","translation":"その腫瘍細胞はエストロゲン抵抗性であることが判明した。"},{"sentence":"Estrogen-resistant breast cancer is often more difficult to treat.","translation":"エストロゲン抵抗性の乳がんは、しばしば治療がより困難である。"}],"collocations":["estrogen-resistant cancer","estrogen-resistant cells","estrogen-resistant tumor"],"synonyms":["estrogen-insensitive","estrogen-nonresponsive"],"antonyms":["estrogen-sensitive","estrogen-responsive"]}],"etymology":{"value":"Formed by combining 'estrogen' with 'resistant'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛstrədʒən rɪˈzɪstənt/","syllables":"es-tro-gen re-sis-tant"},"inflection":{"notes":"Adjectives do not inflect in English."},"usage_notes":{"explanation":"'Estrogen-resistant' is primarily used in medical and scientific contexts to describe cells, tissues, or conditions that do not respond to estrogen, a hormone crucial for various physiological processes. This resistance can occur in diseases like breast cancer, where some tumors become resistant to estrogen-based therapies.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient is estrogen-resistant.","correct":"✓ The patient has estrogen-resistant cancer.","note":"It's more accurate to specify what is estrogen-resistant (e.g., the cancer, the cells), rather than saying a person is estrogen-resistant in general."}],"priority":"★★☆"},"related_words":{"derivatives":["resistance","estrogen","hormone resistance"],"related_terms":["estrogen receptor","hormone therapy","endocrine resistance"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Estrogen-resistant' is a technical term used in medicine and biology. It describes a condition where cells or tissues do not respond to estrogen, a hormone that plays a key role in female reproductive health and other bodily functions. This term is commonly used in the context of cancer, particularly breast cancer, where some tumors develop resistance to estrogen-based treatments. Understanding this term requires knowledge of basic biology and medical terminology."},"example_sentences":[{"sentence":"The development of estrogen-resistant disease is a major challenge in breast cancer treatment.","translation":"エストロゲン抵抗性疾患の発症は、乳がん治療における大きな課題である。","type":"general","meaning_category":"medical"},{"sentence":"Researchers are investigating new therapies to overcome estrogen resistance in cancer cells.","translation":"研究者らは、がん細胞におけるエストロゲン抵抗性を克服するための新しい治療法を研究している。","type":"research","meaning_category":"scientific"}]}