{"word":"palaces","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"宮殿、王宮、豪邸","english_definition":"The official residence of a sovereign, archbishop, bishop, or other exalted person; a large and splendid residence.","examples":[{"sentence":"The royal family lives in one of the most famous palaces in the world.","translation":"王室は世界で最も有名な宮殿の一つに住んでいます。"},{"sentence":"Many European cities are famous for their beautiful palaces.","translation":"多くのヨーロッパの都市は、美しい宮殿で有名です。"},{"sentence":"The wealthy businessman built a palace-like mansion on the hill.","translation":"その裕福なビジネスマンは丘の上に宮殿のような豪邸を建てた。"}],"collocations":["royal palace (王宮)","presidential palace (大統領官邸)","historic palace (歴史的な宮殿)","visit a palace (宮殿を訪問する)","live in a palace (宮殿に住む)","palace gardens (宮殿の庭園)"],"synonyms":["mansion","castle","stately home","residence","hall","chateau"],"antonyms":["hut","shack","hovel"]}],"etymology":{"value":"Old French 'palais' (palace), from Latin 'Palatium' (the Palatine Hill in Rome, where the emperors had their residence), from 'Palatinus' (belonging to the Palatine Hill).","priority":"★★★"},"pronunciation":{"ipa":"/ˈpælɪsɪz/","syllables":"pal-a-ces"},"inflection":{"noun_plural":"palaces"},"usage_notes":{"explanation":"'Palaces' refers to more than one palace. A palace is a grand and often historic residence, typically belonging to royalty or high-ranking officials. The word can also be used metaphorically to describe a very luxurious or impressive home.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I visited a palace yesterday. There were many palaces there.","correct":"✓ I visited a palace yesterday. There were many other palaces there.","note":"When referring to multiple palaces in the same location, it's clearer to use 'other palaces' to avoid confusion."},{"incorrect":"✗ The palace is very big, it's like a palaces.","correct":"✓ The palace is very big, it's like a palace.","note":"When comparing something to a single palace, use the singular form 'palace'."}],"priority":"★★☆"},"related_words":{"derivatives":["palatial (adjective: resembling a palace; magnificent)","palace (singular noun: a single palace)"],"phrases":["palace intrigue (陰謀)","palace coup (宮廷クーデター)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Moderate frequency","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word 'palaces' is generally understood by English speakers, but its usage is more common in formal contexts or when discussing historical or cultural topics. While most people know what a palace is, they may not encounter the word frequently in everyday conversation unless they are discussing travel, history, or architecture. The word is suitable for intermediate to advanced learners of English."},"example_sentences":[{"sentence":"The tourists admired the intricate architecture of the palaces.","translation":"観光客は宮殿の複雑な建築様式に感嘆した。","type":"general"},{"sentence":"Several palaces were damaged during the war.","translation":"いくつかの宮殿が戦争中に被害を受けた。","type":"historical"},{"sentence":"The city boasts numerous historical palaces.","translation":"その都市は数多くの歴史的な宮殿を誇っている。","type":"travel"},{"sentence":"The interior of the palaces was lavishly decorated.","translation":"宮殿の内部は贅沢に装飾されていた。","type":"descriptive"}]}