{"word":"guardians","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"保護者、後見人、守護者","english_definition":"people who protect or take care of someone or something","examples":[{"sentence":"The children were placed under the care of their guardians.","translation":"子供たちは保護者の監督下に置かれた。"},{"sentence":"The museum has several security guards who act as guardians of the artwork.","translation":"美術館には、美術品の守護者として働く警備員が数名いる。"},{"sentence":"Guardians of the Galaxy is a popular movie series.","translation":"ガーディアンズ・オブ・ギャラクシーは人気のある映画シリーズだ。"}],"collocations":["legal guardian (法的後見人)","guardian angel (守護天使)","guardian spirit (守護霊)","act as a guardian (保護者として行動する)","appoint a guardian (後見人を任命する)","primary guardian (主な保護者)"],"synonyms":["protector","keeper","defender","custodian","warden","caretaker"],"antonyms":["attacker","threat","endangerment"]}],"etymology":{"value":"The word 'guardian' comes from the Old French word 'gardien', which in turn comes from the Frankish word 'wardēn', meaning 'to guard'. This is related to the Old English word 'weard', meaning 'guard' or 'keeper'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡɑːrdiənz/","syllables":"guar-di-ans"},"inflection":{"noun_plural":"guardians","noun_singular":"guardian"},"usage_notes":{"explanation":"'Guardians' refers to multiple people who have a responsibility to protect or care for someone or something. This can be in a legal sense, such as a legal guardian for a child, or in a more general sense, such as someone who guards a building or protects a cause. The term can also refer to fictional characters who protect something, as in 'Guardians of the Galaxy'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is the guardian of the museum.","correct":"✓ She is a guardian of the museum.","note":"When referring to one person, use the singular form 'guardian' with the article 'a' or 'the' as appropriate."},{"incorrect":"✗ The guardians protect the child's rights. He is their guardian.","correct":"✓ The guardians protect the child's rights. They are his guardians.","note":"'Guardians' is plural, so the pronoun should be 'they' and the possessive pronoun should be 'their'."}],"priority":"★★☆"},"related_words":{"derivatives":["guardianship (名詞: 後見、保護)","guard (動詞: 守る、警備する；名詞: 警備員、護衛)","guardian angel (名詞: 守護天使)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Moderately frequent","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'guardians' refers to people who protect or take care of someone or something. It's often used in legal contexts to describe someone who has legal responsibility for a child or an adult who cannot care for themselves. It can also be used more generally to describe people who protect something valuable, like a museum's artwork. The word can also be used in fiction to describe characters who protect something important. Understanding the context is important to know the specific meaning of 'guardians'."},"example_sentences":[{"sentence":"The judge appointed them as the child's legal guardians.","translation":"裁判官は彼らを子供の法的後見人に任命した。","type":"noun","meaning_category":"legal responsibility"},{"sentence":"The security guards act as guardians of the building.","translation":"警備員は建物の守護者として行動する。","type":"noun","meaning_category":"protection"},{"sentence":"The Guardians of the Galaxy fought to save the universe.","translation":"ガーディアンズ・オブ・ギャラクシーは宇宙を救うために戦った。","type":"noun","meaning_category":"fictional protectors"}]}