{"word":"velvet-pile","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ビロードパイル","english_definition":"A fabric with a dense, soft, and erect pile, similar to velvet but with a longer and less dense pile.","examples":[{"sentence":"The antique chair was upholstered in a worn velvet-pile.","translation":"そのアンティークの椅子は、擦り切れたビロードパイルで装飾されていた。"},{"sentence":"She ran her hand over the soft velvet-pile of the rug.","translation":"彼女はラグの柔らかいビロードパイルの上を撫でた。"}],"collocations":["velvet-pile carpet","velvet-pile upholstery","soft velvet-pile"],"synonyms":["velveteen","pile fabric","cut pile"],"antonyms":[]}],"etymology":{"value":"Derived from 'velvet' (a soft, luxurious fabric) and 'pile' (the raised loops or tufts on the surface of a fabric).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvɛlvɪt paɪl/","syllables":"vel-vet-pile"},"inflection":{"noun_plural":"velvet-piles"},"usage_notes":{"explanation":"'Velvet-pile' refers to a specific type of fabric construction where the surface has a raised, plush texture. It is often used in upholstery, carpets, and sometimes clothing. It is similar to velvet but has a longer, less dense pile.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a velvet-pile shirt, but it's too hot for summer.","correct":"✓ I bought a velveteen shirt, but it's too hot for summer.","note":"'Velvet-pile' is more commonly used for upholstery or carpets, not typically for clothing. 'Velveteen' might be a more appropriate term for a similar fabric used in clothing."}],"priority":"★★☆"},"related_words":{"derivatives":["velvet","pile","velveteen"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Velvet-pile' is a relatively specialized term referring to a specific type of fabric with a raised, soft surface. It is most commonly encountered in descriptions of furniture, carpets, or other textiles. Understanding the term requires familiarity with fabric construction and terminology.","priority":"★★☆"},"example_sentences":[{"sentence":"The stage curtains were made of heavy, dark red velvet-pile.","translation":"舞台のカーテンは、重い、濃い赤色のビロードパイルで作られていた。","type":"noun","meaning_category":"Fabric"},{"sentence":"The texture of the velvet-pile was incredibly soft and inviting.","translation":"そのビロードパイルの質感は、信じられないほど柔らかく、人を誘うようだった。","type":"noun","meaning_category":"Texture"}]}