{"word":"influencability","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"影響されやすさ、感化されやすさ","english_definition":"The quality of being easily influenced or persuaded.","examples":[{"sentence":"His influencability made him a target for manipulation.","translation":"彼の影響されやすさは、彼を操作の標的にした。"},{"sentence":"The study examined the influencability of children by advertising.","translation":"その研究は、広告による子供たちの影響されやすさを調べた。"},{"sentence":"She worried about her son's influencability when he started hanging out with a new group of friends.","translation":"彼女は息子が新しい友達グループと付き合い始めたとき、彼の感化されやすさを心配した。"}],"collocations":["high influencability","low influencability","measure influencability","assess influencability"],"synonyms":["susceptibility","vulnerability","impressionability","persuadability","openness"],"antonyms":["resistance","invulnerability","insusceptibility","unyieldingness"]}],"etymology":{"value":"The word \"influencability\" is derived from \"influence\" + \"-able\" (capable of being) + \"-ity\" (state or quality).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪnfluənˈsæbɪləti/","syllables":"in-flu-en-ca-bi-li-ty"},"inflection":{"noun_plural":"influencabilities"},"usage_notes":{"explanation":"\"Influencability\" refers to the degree to which someone is open to or easily affected by the opinions, suggestions, or actions of others. It is often used in contexts where persuasion, manipulation, or conformity are factors. A person with high influencability may be more likely to change their beliefs or behaviors based on external pressures.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The influencability of the weather on his mood was significant.","correct":"✓ The influence of the weather on his mood was significant.","note":"\"Influencability\" refers to a person's trait, not the effect of something on something else. Use \"influence\" to describe the effect of weather on mood."},{"incorrect":"✗ His influencability is a good thing because he is open to new ideas.","correct":"✓ His openness to new ideas is a good thing. / His influencability can be both a positive and a negative trait.","note":"While openness to new ideas can be positive, \"influencability\" often carries a connotation of being easily manipulated, so it's important to consider the context."}],"priority":"★★☆"},"related_words":{"derivatives":["influence","influential","influenceable"],"phrasal_verbs":[],"related_concepts":["persuasion","manipulation","conformity","social influence","psychology of influence"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Influencability\" is a relatively complex word that describes the degree to which someone is easily affected by the opinions or actions of others. It's often used in discussions about psychology, marketing, or social dynamics, where understanding how people are persuaded or manipulated is important. The word implies a potential vulnerability to external pressures.","priority":"★★☆"},"example_sentences":[{"sentence":"The candidate's high influencability was seen as both a strength and a weakness by his campaign team.","translation":"その候補者の高い影響されやすさは、彼の選挙運動チームによって強みとも弱みとも見なされた。","type":"general","meaning_category":"general"},{"sentence":"Researchers are studying the factors that contribute to influencability in adolescents.","translation":"研究者たちは、青年期における影響されやすさに寄与する要因を研究している。","type":"academic","meaning_category":"academic"},{"sentence":"The cult leader exploited the influencability of his followers.","translation":"そのカルト指導者は、信者たちの影響されやすさを利用した。","type":"negative","meaning_category":"negative"}]}