{"word":"Genisaro","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(historical) A member of a social class in the Balkans, especially in the Ottoman Empire, composed of people of various origins (often Christian) who were enslaved, converted to Islam, and integrated into the Ottoman society, often serving in the military or administration.","english_definition":"(historical) A member of a social class in the Balkans, especially in the Ottoman Empire, composed of people of various origins (often Christian) who were enslaved, converted to Islam, and integrated into the Ottoman society, often serving in the military or administration.","examples":[{"sentence":"The Genisaros played a significant role in the Ottoman military and administration.","translation":"ジェニサロはオスマン帝国の軍事および行政において重要な役割を果たしました。"}],"collocations":["Ottoman Genisaros","Balkan Genisaros"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term 'Genisaro' is derived from the Greek word 'γενίτσαροι' (genítsaroi), which is itself derived from the Ottoman Turkish 'یڭیچری' (yeniçeri), meaning 'new soldier'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌdʒɛnɪˈsɑːroʊ/","syllables":"Ge-ni-sa-ro"},"inflection":{"noun_plural":"Genisaros"},"usage_notes":{"explanation":"The term 'Genisaro' is primarily used in a historical context to refer to a specific social and military class within the Ottoman Empire. It is important to note that the Genisaros were often forcibly converted to Islam and served the Ottoman state, sometimes rising to positions of power and influence.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["Janissary (English equivalent, derived from the same Ottoman Turkish root)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily used in historical contexts.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'Genisaro' refers to a specific historical group within the Ottoman Empire. Understanding the term requires knowledge of Ottoman history and social structures. The word is not commonly used in modern English outside of academic or historical contexts."},"example_sentences":[{"sentence":"The Ottoman army included a significant number of Genisaros.","translation":"オスマン帝国の軍隊には多数のジェニサロが含まれていました。","type":"noun","meaning_category":"historical"},{"sentence":"Many Genisaros rose to positions of power within the Ottoman administration.","translation":"多くのジェニサロがオスマン帝国の行政において権力の地位に昇進しました。","type":"noun","meaning_category":"historical"}]}