{"word":"chikee","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"チキー：セミノール族やミコスキー族が伝統的に使用する、高床式の屋根付き住居。","english_definition":"A chikee is a type of simple, open-sided dwelling with a raised floor and thatched roof, traditionally used by the Seminole and Miccosukee tribes of Florida.","examples":[{"sentence":"The family gathered under the chikee to escape the afternoon sun.","translation":"家族は午後の日差しを避けるためにチキーの下に集まった。"},{"sentence":"The Seminole tribe still builds chikees for ceremonial purposes and to preserve their cultural heritage.","translation":"セミノール族は今でも儀式用や文化遺産を保存するためにチキーを建てている。"}],"collocations":["build a chikee","live in a chikee","traditional chikee","Seminole chikee","Miccosukee chikee"],"synonyms":["hut","shelter","dwelling","cabin"],"antonyms":[]}],"etymology":{"value":"「chikee」という言葉は、セミノール族とミコスキー族の言語に由来する。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈtʃiːkiː/","syllables":"chi-kee"},"inflection":{"noun_plural":"chikees"},"usage_notes":{"explanation":"「chikee」は、主にフロリダ州のセミノール族とミコスキー族の伝統的な住居を指す言葉として使われる。観光地や文化的な文脈で使われることが多い。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They built a chikee made of bricks.","correct":"✓ They built a chikee made of wood and thatch.","note":"チキーは伝統的に木と茅葺きで作られる。"},{"incorrect":"✗ Chikees are common in all Native American tribes.","correct":"✓ Chikees are specific to the Seminole and Miccosukee tribes of Florida.","note":"チキーは特定の部族の文化的な構造物である。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Seminole","Miccosukee","thatched roof","stilt house","Native American architecture"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'chikee' refers to a specific type of traditional dwelling used by the Seminole and Miccosukee tribes of Florida. It is not a commonly used word in general English, so understanding its meaning requires some knowledge of Native American cultures or architecture. Its usage is typically limited to contexts discussing these specific tribes or historical dwellings."},"example_sentences":[{"sentence":"The museum displayed a replica of a traditional Seminole **chikee**.","translation":"博物館には伝統的なセミノール族のチキーのレプリカが展示されていた。","type":"noun","meaning_category":"dwelling"},{"sentence":"Visitors can stay in modern versions of **chikees** at some resorts in the Everglades.","translation":"エバーグレーズの一部のリゾートでは、チキーの現代版に宿泊できる。","type":"noun","meaning_category":"dwelling"}]}