{"word":"Avaram","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of flowering plant, specifically Senna auriculata, known for its medicinal properties and use in tanning.","english_definition":"A flowering plant, Senna auriculata, used in traditional medicine and tanning.","examples":[{"sentence":"Avaram is commonly used in Ayurvedic medicine for its various health benefits.","translation":"アバラムは、そのさまざまな健康上の利点から、アーユルヴェーダ医学で一般的に使用されています。"},{"sentence":"The bark of the Avaram plant is used in the tanning industry.","translation":"アバラム植物の樹皮は、なめし産業で使用されています。"}],"collocations":["Avaram bark","Avaram flower","Avaram tea"],"synonyms":["Senna auriculata","Tanner's cassia"],"antonyms":[]}],"etymology":{"value":"The word 'Avaram' is derived from Tamil, a Dravidian language spoken in South India, where the plant is native.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɑːvərʌm/","syllables":"a-va-ram"},"inflection":{"noun_plural":"Avarams"},"usage_notes":{"explanation":"Avaram is primarily used to refer to the plant Senna auriculata. It's often mentioned in the context of traditional medicine, particularly Ayurveda, and its use in the tanning of leather.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I drink avaram every morning for energy.","correct":"✓ I drink avaram tea every morning for energy.","note":"It's more common to specify 'Avaram tea' when referring to the beverage made from the plant."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Ayurveda","tanning","Senna","cassia"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Avaram' is a specific term referring to the plant Senna auriculata. It is most likely to be encountered in texts discussing traditional medicine, botany, or tanning processes. Understanding requires familiarity with these specialized fields."},"example_sentences":[{"sentence":"Traditional healers use Avaram flowers to prepare herbal remedies.","translation":"伝統的なヒーラーは、アバラムの花を使って薬草療法を準備します。","type":"noun","meaning_category":"Plant/Medicine"},{"sentence":"The Avaram plant is drought-resistant and grows well in arid regions.","translation":"アバラム植物は干ばつに強く、乾燥地帯でよく育ちます。","type":"noun","meaning_category":"Plant/Botany"}]}