{"word":"pollees","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) 世論調査対象者、投票者","english_definition":"plural form of 'pollee': individuals who are surveyed in a poll or who vote in an election.","examples":[{"sentence":"The pollees were asked about their political preferences.","translation":"世論調査対象者たちは、彼らの政治的選好について尋ねられました。"},{"sentence":"Many of the pollees expressed dissatisfaction with the current government.","translation":"多くの投票者は、現政府に対する不満を表明しました。"}],"collocations":["survey pollees","interview pollees","contact pollees","target pollees"],"synonyms":["respondents","voters","participants","surveyed individuals"],"antonyms":[]}],"etymology":{"value":"Derived from 'pollee,' which is formed by adding the suffix '-ee' to 'poll.' The suffix '-ee' indicates the recipient of an action, in this case, the person being polled.","priority":"★★☆"},"pronunciation":{"ipa":"/pɒˈliːz/","syllables":"pol-lees"},"inflection":{"noun_plural":"pollees"},"usage_notes":{"explanation":"'Pollees' is a relatively uncommon word, primarily used in academic or formal contexts when discussing polling or surveys. It specifically refers to the individuals who are the subject of the poll or survey. In more general contexts, terms like 'respondents,' 'participants,' or 'voters' might be preferred.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The poll had a good response from the pollee.","correct":"✓ The poll had a good response from the pollees.","note":"'Pollee' is singular, referring to one person. To refer to multiple people, use the plural form 'pollees'."},{"incorrect":"✗ The pollees are very important of the election.","correct":"✓ The pollees are very important to the election.","note":"The correct preposition to use with 'important' in this context is 'to,' not 'of'."}],"priority":"★★☆"},"related_words":{"derivatives":["poll (noun: 世論調査、投票；verb: 世論調査を行う、投票する)","pollee (noun: 世論調査対象者、投票者)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pollees' is a specialized term used in the context of polling and surveys. It refers to the individuals who are being surveyed or who are participating in a poll. The word is not commonly used in everyday conversation and is more likely to appear in academic papers, news articles about polling, or reports on survey results. Understanding the term is helpful for comprehending discussions about public opinion and electoral processes."},"example_sentences":[{"sentence":"The opinions of the pollees were carefully analyzed.","translation":"世論調査対象者の意見は注意深く分析された。","type":"noun","meaning_category":"世論調査対象者"},{"sentence":"Researchers contacted a diverse group of pollees for the study.","translation":"研究者たちは、研究のために多様なグループの世論調査対象者に連絡を取った。","type":"noun","meaning_category":"世論調査対象者"},{"sentence":"The responses from the pollees provided valuable insights into voter behavior.","translation":"世論調査対象者からの回答は、投票者の行動に関する貴重な洞察を提供した。","type":"noun","meaning_category":"世論調査対象者"}]}