{"word":"seasicknesses","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"複数の船酔い","english_definition":"plural of seasickness: the state of feeling sick, usually with nausea and vomiting, caused by the motion of a ship at sea.","examples":[{"sentence":"The doctor had to treat several passengers for seasicknesses during the rough voyage.","translation":"医者は荒れた航海の間、数人の乗客の船酔いを治療しなければならなかった。"}],"collocations":["experience seasicknesses","suffer from seasicknesses"],"synonyms":["nausea","motion sickness","sickness at sea","queasiness"],"antonyms":["health","well-being"]}],"etymology":{"value":"Formed by pluralizing 'seasickness', which itself is a compound of 'sea' and 'sickness'. 'Sea' refers to the ocean, and 'sickness' refers to the state of being ill.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsiːˌsɪknəsɪz/","syllables":"sea-sick-ness-es"},"inflection":{"noun_plural":"seasicknesses"},"usage_notes":{"explanation":"'Seasicknesses' is the plural form of 'seasickness'. It is used when referring to multiple instances or occurrences of seasickness, typically affecting different individuals or occurring at different times. While 'seasickness' is more commonly used in a general sense, 'seasicknesses' emphasizes the separate experiences of the condition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He had a seasickness.","correct":"✓ He had seasickness.","note":"'Seasickness' is usually an uncountable noun, so it doesn't typically take an indefinite article ('a')."},{"incorrect":"✗ Many people get seasickness during a cruise. (when referring to specific instances)","correct":"✓ Many people experienced seasicknesses during the particularly rough cruise.","note":"When referring to multiple separate instances of seasickness, using the plural 'seasicknesses' is more accurate."}],"priority":"★★☆"},"related_words":{"derivatives":["seasick (adjective: affected by seasickness)","seasickness (noun: the condition of being seasick)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (uncommon plural form)","frequency_google_ngram":"Low frequency (as a plural)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Seasicknesses' is the plural form of 'seasickness', referring to multiple instances of feeling sick due to the motion of a ship. It's less common than the singular form but is used to emphasize separate occurrences of the condition. Understanding this word requires a good grasp of noun plurals and the specific context of maritime travel.","priority":"★★☆"},"example_sentences":[{"sentence":"The nurse recorded several seasicknesses among the passengers after the storm.","translation":"看護師は嵐の後、乗客の間でいくつかの船酔いを記録した。","type":"noun","meaning_category":"plural of seasickness"},{"sentence":"The log detailed the various seasicknesses suffered by the crew during the long voyage.","translation":"航海日誌には、長い航海中に乗組員が苦しんだ様々な船酔いが詳細に記録されていた。","type":"noun","meaning_category":"plural of seasickness"}]}