{"word":"nonissuable","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"発行できない、発行に適さない","english_definition":"Not able to be issued; not suitable for issuing.","examples":[{"sentence":"The document was deemed nonissuable due to numerous errors.","translation":"その書類は多数のエラーのため、発行不能と判断された。"},{"sentence":"The bond was classified as nonissuable because it did not meet the required criteria.","translation":"その債券は必要な基準を満たしていなかったため、発行不能に分類された。"}],"collocations":["nonissuable document","nonissuable bond","nonissuable permit"],"synonyms":["unreleasable","unprocurable","unavailable"],"antonyms":["issuable","releasable","available"]}],"etymology":{"value":"The word is formed by adding the prefix 'non-' (meaning 'not') to the word 'issuable' (capable of being issued).","priority":"★★☆"},"pronunciation":{"ipa":"/nɒnˈɪʃuːəbəl/","syllables":"non-is-su-a-ble"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Nonissuable' is a relatively formal term, often used in legal, financial, or bureaucratic contexts. It indicates that something cannot be officially released or provided, typically due to specific regulations, errors, or other disqualifying factors.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonissuable of the visa caused problems.","correct":"✓ The nonissuance of the visa caused problems.","note":"'Nonissuable' is an adjective describing something that cannot be issued. 'Nonissuance' is a noun referring to the act or state of not being issued."}],"priority":"★★☆"},"related_words":{"derivatives":["nonissuance (noun): the act of not issuing something","issue (verb/noun): to officially give out or release something"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nonissuable' is a formal adjective indicating that something cannot be issued or released, often due to regulatory or procedural reasons. It is typically used in professional or technical contexts, such as finance, law, or government. Understanding this word requires familiarity with formal vocabulary and the concept of official issuance or release."},"example_sentences":[{"sentence":"The application was marked as 'nonissuable' because it lacked the necessary signatures.","translation":"その申請書は必要な署名がなかったため、「発行不能」とマークされた。","type":"adjective","meaning_category":"発行できない"},{"sentence":"Due to the ongoing investigation, all new permits are temporarily nonissuable.","translation":"現在調査中のため、すべての新規許可証は一時的に発行できません。","type":"adjective","meaning_category":"発行できない"}]}