{"word":"unrepellently","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"反発せずに、嫌悪感を与えずに","english_definition":"in a manner that is not repelling; without causing aversion or disgust.","examples":[{"sentence":"The speaker presented his arguments unrepellently, making them accessible to a wider audience.","translation":"演説者は反発感を与えないように議論を展開し、より多くの聴衆に理解してもらえるようにした。"},{"sentence":"She described the unpleasant situation unrepellently, focusing on the facts rather than emotional reactions.","translation":"彼女は不快な状況を嫌悪感を与えないように説明し、感情的な反応よりも事実を重視した。"}],"collocations":["present something unrepellently","describe something unrepellently","act unrepellently"],"synonyms":["agreeably","pleasantly","attractively","inoffensively","amiably"],"antonyms":["repellently","disgustingly","offensively","unpleasantly"]}],"etymology":{"value":"The word is formed by adding the prefix 'un-' (not) to the adverb 'repellently', which is derived from the verb 'repel' (to drive or force back; to cause aversion). The suffix '-ly' turns the adjective 'repellent' into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnrɪˈpɛləntli/","syllables":"un-re-pel-lent-ly"},"inflection":{"notes":"Adverbs do not typically inflect. This word does not have different forms.","adverb_forms":{}},"usage_notes":{"explanation":"'Unrepellently' is used to describe actions or manners that avoid causing aversion, disgust, or repulsion. It suggests a way of presenting or doing something that is agreeable or at least not offensive. It is relatively rare in common usage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He behaved unrepellently at the party, making everyone dislike him.","correct":"✓ He behaved repellently at the party, making everyone dislike him.","note":"'Unrepellently' means behaving in a way that does *not* cause dislike or aversion. If the behavior caused dislike, 'repellently' should be used."}],"priority":"★★☆"},"related_words":{"derivatives":["repel (verb)","repellent (adjective)","repellently (adverb)","repulsion (noun)","unrepulsive (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unrepellently' is a complex word indicating that something is done in a way that does not cause aversion or disgust. It is the opposite of 'repellently' and is used to describe actions or presentations that are agreeable or at least not offensive. Due to its complexity and the relative rarity of its usage, it is more likely to be encountered in formal or technical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The lawyer presented the evidence unrepellently, focusing on the facts and avoiding sensationalism.","translation":"弁護士は扇情主義を避け、事実に焦点を当てて、反発感を与えないように証拠を提示した。","type":"adverb","meaning_category":"manner"},{"sentence":"She spoke about the sensitive topic unrepellently, showing respect and empathy.","translation":"彼女は敬意と共感を示し、デリケートな話題について反発感を与えないように語った。","type":"adverb","meaning_category":"manner"}]}