{"word":"sinuato-","priority":"☆☆☆","meanings":[{"part_of_speech":"prefix","definition":"曲がった、波状の","english_definition":"A prefix denoting a curved or wavy form.","examples":[{"sentence":"sinuatoundulate","translation":"波状の","note":"This word combines 'sinuato-' with 'undulate' to describe something with both curved and wavy characteristics."}],"collocations":[],"synonyms":["curvi-","flex-","undul-"],"antonyms":["straight-","recti-"]}],"etymology":{"value":"From Latin 'sinuatus', past participle of 'sinuare' meaning 'to bend, curve, wind'.","priority":"★★★"},"pronunciation":{"ipa":"/saɪˌnjuːeɪtoʊ-/","syllables":"si-nu-a-to"},"inflection":{},"usage_notes":{"explanation":"This prefix is primarily used in scientific and technical contexts, particularly in biology, geology, and mathematics, to describe shapes or structures that are curved or wavy. It is not commonly used in everyday language.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["sinuate (adjective: having a wavy margin or border; verb: to bend or wind in and out)","sinuation (noun: the state of being sinuous; a bend or curve)","sinus (noun: a cavity or recess; related to the idea of a curve or bend)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in specialized fields.","priority":"★★☆"},"readability_explanation":{"level":"C2","text":"The prefix 'sinuato-' is highly specialized and primarily encountered in scientific and technical texts. Understanding its meaning is essential for comprehending terms in fields like botany, zoology, and geology, where descriptions of curved or wavy structures are common. Due to its limited use in general contexts, it is considered an advanced vocabulary element."},"example_sentences":[{"sentence":"The leaf margin is described as sinuatodentate.","translation":"その葉の縁は波状の歯状であると記述されている。","type":"example","meaning_category":"describing leaf morphology"},{"sentence":"The river follows a sinuato-meandering path through the valley.","translation":"その川は谷を蛇行しながら曲がりくねった経路をたどる。","type":"example","meaning_category":"describing geographical features"}]}