{"word":"recatalog","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"再分類する、再目録化する","english_definition":"to catalog again; to create a new catalog entry for something, often with a revised classification or description.","examples":[{"sentence":"The library decided to recatalog its entire collection using a new system.","translation":"図書館は新しいシステムを使ってコレクション全体を再分類することに決めた。"},{"sentence":"Due to changes in subject headings, many books had to be recataloged.","translation":"主題見出しの変更により、多くの本を再分類する必要があった。"},{"sentence":"The museum is recataloging its artifacts to improve accessibility for researchers.","translation":"博物館は研究者のアクセシビリティを向上させるために、所蔵品を再分類している。"}],"collocations":["recatalog a collection (コレクションを再分類する)","recatalog books (本を再分類する)","recatalog artifacts (所蔵品を再分類する)","recatalog using a new system (新しいシステムを使って再分類する)"],"synonyms":["reclassify","reindex","re-categorize","re-inventory"],"antonyms":["deaccession (除籍する)"]}],"etymology":{"value":"接頭辞 re- (再び) + catalog (目録を作る)","priority":"★★★"},"pronunciation":{"ipa":"/ˌriːˈkætəlɔːɡ/","syllables":"re-cat-a-log"},"inflection":{"verb_forms":{"present_simple":["recatalog","recatalogs"],"past_simple":"recataloged","past_participle":"recataloged","present_participle":"recataloging"}},"usage_notes":{"explanation":"\"Recatalog\" typically refers to the process of updating or revising the catalog entries for items in a library, museum, archive, or other collection. This may involve changing the classification, subject headings, or other descriptive information to reflect current standards or improve searchability.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The data was recatalog, but it didn't help.","correct":"✓ The data was recataloged, but it didn't help.","note":"Ensure the past participle form is correctly used (recataloged)."},{"incorrect":"✗ They are recataloging, it is very hard work.","correct":"✓ They are recataloging; it is very hard work.","note":"Use a semicolon or separate sentences to connect independent clauses."}],"priority":"★★☆"},"related_words":{"derivatives":["recataloging (名詞: 再分類)"],"related_terms":["catalog","cataloger","cataloging","classification","indexing","metadata"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈で使用されることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Recatalog\" is a specialized term primarily used in library science, museum studies, and archival contexts. It describes the process of creating new catalog entries for items, often involving revised classifications or descriptions. Understanding this term requires familiarity with cataloging principles and practices. It is not commonly used in general conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The university library plans to recatalog all of its rare books.","translation":"大学図書館はすべての稀覯本を再分類する予定である。","type":"verb","meaning_category":"再分類する"},{"sentence":"Recataloging the art collection will take several months.","translation":"美術コレクションの再分類には数ヶ月かかるだろう。","type":"verb","meaning_category":"再分類する"},{"sentence":"The museum hired additional staff to assist with the recataloging project.","translation":"博物館は再分類プロジェクトを支援するために追加のスタッフを雇用した。","type":"verb","meaning_category":"再分類する"}]}