{"word":"undeifying","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"神格化を取り消す、神聖さを奪う","english_definition":"To remove the divine status or attributes from someone or something; to desecrate or profane.","examples":[{"sentence":"The revolution sought to undeify the former dictator, removing all statues and symbols of his supposed divinity.","translation":"革命は、元独裁者の神格化を取り消すことを目指し、彼の神聖さを示すすべての像とシンボルを取り除いた。"},{"sentence":"Some scholars argue that the Enlightenment was a process of undeifying nature, shifting the focus from divine creation to scientific understanding.","translation":"一部の学者は、啓蒙時代は自然の神聖さを奪うプロセスであり、神の創造から科学的理解へと焦点を移したと主張している。"}],"collocations":["undeifying a leader","undeifying a concept","undeifying a symbol"],"synonyms":["desecrate","profane","deconsecrate","demystify","deglamorize"],"antonyms":["deify","sanctify","consecrate","revere","idolize"]}],"etymology":{"value":"Derived from 'deifying,' with the prefix 'un-' indicating reversal or negation. 'Deifying' comes from 'deity,' meaning 'god' or 'divine being.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndiˈɪfaɪɪŋ/","syllables":"un-de-i-fy-ing"},"inflection":{"verb_forms":{"present_simple":["undeify","undeifies"],"past_simple":"undeified","past_participle":"undeified","present_participle":"undeifying"}},"usage_notes":{"explanation":"'Undeifying' is the act of reversing the process of deification, which is the act of making someone or something a god or treating them like a god. It often involves removing symbols, statues, or other forms of reverence associated with the deified person or thing. The term can also be used in a more abstract sense to refer to the process of demystifying or debunking something that has been idealized or given undue importance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The process of undeifying was quick.","correct":"✓ The process of undeification was quick.","note":"'Undeifying' is the present participle or gerund form of the verb. When referring to the process in general, the noun form 'undeification' is more appropriate. "},{"incorrect":"✗ They undeified the hero with praises.","correct":"✓ They undeified the hero by revealing his flaws.","note":"'Undeifying' means to remove divine status, so it cannot be done 'with praises.' It is achieved by revealing negative aspects or flaws."}],"priority":"★☆☆"},"related_words":{"derivatives":["undeification (noun: the act of undeifying)","deify (verb: to make a god of)","deification (noun: the act of deifying)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Undeifying' is a relatively uncommon word that describes the act of removing divine status or attributes from someone or something. It is often used in academic or philosophical contexts when discussing the demotion of figures or concepts that were previously idealized or considered sacred. Understanding the word requires a grasp of the concept of deification and the function of the prefix 'un-' in reversing the meaning of a word."},"example_sentences":[{"sentence":"The new regime began undeifying the old king by tearing down his statues.","translation":"新政権は旧王の像を破壊することで、彼の神格化を取り消し始めた。","type":"verb","meaning_category":"神格化を取り消す"},{"sentence":"The author's goal was to undeify the romanticized image of war.","translation":"著者の目標は、戦争のロマンチックなイメージの神聖さを奪うことだった。","type":"verb","meaning_category":"神聖さを奪う"}]}