{"word":"Idoism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"イド語主義：国際補助語イドの原則と実践。","english_definition":"The principles and practice of Ido, an international auxiliary language.","examples":[{"sentence":"Idoism aims to create a simple and logical language for international communication.","translation":"イド語主義は、国際コミュニケーションのためのシンプルで論理的な言語を作ることを目指しています。"}],"collocations":["adherent of Idoism (イド語主義の支持者)","promote Idoism (イド語主義を推進する)"],"synonyms":["Ido","Ido language movement"],"antonyms":["Esperanto","Volapük"]},{"part_of_speech":"noun","definition":"イド語を支持するイデオロギー。","english_definition":"The ideology supporting the use and promotion of the Ido language.","examples":[{"sentence":"Idoism is based on the idea of linguistic neutrality and ease of learning.","translation":"イド語主義は、言語的中立性と学習の容易さという考えに基づいています。"}],"collocations":["principles of Idoism (イド語主義の原則)","philosophy of Idoism (イド語主義の哲学)"],"synonyms":["Ido ideology"],"antonyms":["Esperantism"]}],"etymology":{"value":"The term 'Idoism' is derived from 'Ido', the name of the language, plus the suffix '-ism', which denotes a doctrine, principle, or ideology.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈaɪdoʊɪzəm/","syllables":"I-do-ism"},"inflection":{"noun_plural":"Idoisms"},"usage_notes":{"explanation":"'Idoism' refers to the principles, practices, and ideology associated with the Ido language. It emphasizes linguistic neutrality, logical structure, and ease of learning as key goals for international communication. It is often contrasted with other constructed languages like Esperanto.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He studies Idoism to learn Esperanto.","correct":"✓ He studies Idoism to learn the Ido language.","note":"Idoism is the study or support of the Ido language, not Esperanto."}],"priority":"★★☆"},"related_words":{"derivatives":["Ido (noun: the Ido language)","Idist (noun: a speaker or supporter of Ido)"],"related_languages":["Esperanto","Interlingua","Volapük"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Idoism' is a term related to the constructed language Ido. It refers to the principles and ideology behind the language, which aims for linguistic neutrality and ease of learning for international communication. This term is typically used in discussions about constructed languages and linguistics, and it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The core tenets of Idoism prioritize logical structure and ease of acquisition for second-language learners.","translation":"イド語主義の中核となる信条は、第二言語学習者にとっての論理構造と習得の容易さを優先します。","type":"noun","meaning_category":"principles of Ido"},{"sentence":"Advocates of Idoism believe it offers improvements over other international auxiliary languages like Esperanto.","translation":"イド語主義の支持者は、イド語がエスペラントのような他の国際補助語よりも改善された点を提供すると信じています。","type":"noun","meaning_category":"ideology of Ido"}]}