{"word":"intermeasuring","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(計測器などを)相互に測定する、互いに測定し合う","english_definition":"To measure reciprocally or mutually, especially using instruments or devices.","examples":[{"sentence":"The scientists were intermeasuring the distances between the stars.","translation":"科学者たちは星々の間の距離を相互に測定していた。"},{"sentence":"The two teams used different methods of intermeasuring the data.","translation":"その2つのチームは異なる方法でデータを相互に測定していた。"}],"collocations":["intermeasuring distances","intermeasuring data","intermeasuring results"],"synonyms":["cross-measuring","mutual measuring"],"antonyms":["independent measuring","single measuring"]},{"part_of_speech":"noun","definition":"相互測定、相互計測","english_definition":"The act or process of measuring reciprocally or mutually.","examples":[{"sentence":"The intermeasuring of the angles provided more accurate results.","translation":"角度の相互測定によって、より正確な結果が得られた。"},{"sentence":"The intermeasuring process took several hours to complete.","translation":"相互測定のプロセスは完了するまでに数時間かかった。"}],"collocations":["process of intermeasuring","results of intermeasuring"],"synonyms":["cross-measurement","mutual measurement"],"antonyms":["independent measurement","single measurement"]}],"etymology":{"value":"The word 'intermeasuring' is formed by combining the prefix 'inter-' (meaning between, among, or mutually) with the word 'measuring' (the act of ascertaining the size, amount, or degree of something).","priority":"★★☆"},"pronunciation":{"ipa":"ˌɪntərˈmɛʒərɪŋ","syllables":"in-ter-mea-sur-ing"},"inflection":{"verb_forms":{"present_simple":["intermeasure","intermeasures"],"past_simple":"intermeasured","past_participle":"intermeasured","present_participle":"intermeasuring"},"noun_plural":"intermeasurings"},"usage_notes":{"explanation":"'Intermeasuring' is a relatively uncommon term, typically used in scientific or technical contexts. It refers to the process of measuring something by comparing or coordinating measurements taken from multiple sources or instruments. This approach is often used to improve accuracy or to obtain a more comprehensive understanding of the subject being measured.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The intermeasuring was done by one person.","correct":"✓ The intermeasuring was done by multiple people or instruments.","note":"'Intermeasuring' implies the involvement of more than one entity (person, instrument, etc.) in the measurement process."},{"incorrect":"✗ We are measuring, but not intermeasuring.","correct":"✓ We are measuring independently, not intermeasuring.","note":"If the measurements are not being compared or coordinated, it is simply 'measuring,' not 'intermeasuring'."}],"priority":"★★☆"},"related_words":{"derivatives":["intermeasure"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Intermeasuring' is a specialized term used in technical or scientific contexts to describe a method of measurement that involves multiple instruments or sources. It implies a reciprocal or mutual process of measuring, often for the purpose of improving accuracy or obtaining a more comprehensive understanding. This term is not commonly used in everyday language and is more likely to be encountered in academic or professional settings.","example_sentences":[]}}