{"word":"Melanorrhoea","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A rare condition characterized by the passage of black or very dark stools, usually due to the presence of altered blood.","english_definition":"The passage of black or very dark stools, usually due to the presence of altered blood.","examples":[{"sentence":"The patient presented with melanorrhoea and abdominal pain.","translation":"患者は黒色便と腹痛を訴えて来院した。"},{"sentence":"Melanorrhoea can be a sign of upper gastrointestinal bleeding.","translation":"黒色便は上部消化管出血の兆候である可能性がある。"}],"collocations":["cause of melanorrhoea","diagnosis of melanorrhoea","treatment for melanorrhoea"],"synonyms":["melaena","melena"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'melano-' meaning 'black' and '-rhoea' meaning 'flow'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmɛlənəˈriːə/","syllables":"Me-la-nor-rhoe-a"},"inflection":{"noun_plural":"melanorrhoeas"},"usage_notes":{"explanation":"Melanorrhoea is a medical term specifically referring to the passage of black, tarry stools. It is typically a sign of bleeding in the upper gastrointestinal tract, where blood has been digested and altered by stomach acids. It's important to note that certain medications and foods can also cause dark stools, but true melanorrhoea indicates the presence of altered blood.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient had melanorrhoea due to iron supplements.","correct":"✓ The patient had dark stools, possibly due to iron supplements.","note":"Iron supplements can cause dark stools, but true melanorrhoea is caused by altered blood. It's important to differentiate between the two. If the stools are dark but not tarry and there's no evidence of blood, it's likely not melanorrhoea."}],"priority":"★★☆"},"related_words":{"derivatives":["melena","hematochezia (passage of fresh blood in stool)","gastrointestinal bleeding"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2 (specialized medical vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Melanorrhoea' is a highly specialized medical term used to describe the passage of black, tarry stools resulting from digested blood, usually indicating upper gastrointestinal bleeding. This term is primarily used by medical professionals and is not commonly encountered in general language. Differentiating between melanorrhoea and dark stools caused by diet or medication is crucial for accurate diagnosis."},"example_sentences":[{"sentence":"The physician suspected upper gastrointestinal bleeding based on the patient's report of melanorrhoea.","translation":"医師は患者の黒色便の訴えから上部消化管出血を疑った。","type":"medical","meaning_category":"symptom"},{"sentence":"A stool sample was collected to confirm the presence of altered blood in the melanorrhoea.","translation":"黒色便中の変性血液の存在を確認するために便サンプルを採取した。","type":"medical","meaning_category":"diagnosis"}]}