{"word":"sostenuti","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(音楽) sostenutoの複数形、または男性・混合形。持続された、音を持続させて演奏される。","english_definition":"(music) plural or masculine/mixed form of sostenuto. Sustained; with notes held for their full value.","examples":[{"sentence":"I passaggi sostenuti richiedono un controllo del fiato eccezionale.","translation":"(Italian) Sustained passages require exceptional breath control.","type":"example"},{"sentence":"Gli accordi sostenuti creano un'atmosfera di tensione.","translation":"(Italian) Sustained chords create an atmosphere of tension.","type":"example"}],"collocations":["passaggi sostenuti (sustained passages)","accordi sostenuti (sustained chords)"],"synonyms":["tenuto","lento","adagio"],"antonyms":["accelerando","staccato"]}],"etymology":{"value":"Italian, plural of sostenuto, past participle of sostenere 'to sustain'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɔsteˈnuːti/","syllables":"so-ste-nu-ti"},"inflection":{"notes":"Plural form of the adjective sostenuto. Masculine plural or mixed plural form in Italian."},"usage_notes":{"explanation":"'Sostenuti' is the plural form of the Italian musical term 'sostenuto'. It indicates that notes or passages should be played in a sustained manner, holding each note for its full value. It's often used to create a sense of calmness or grandeur. In Italian grammar, adjectives change form to agree with the noun they modify, so 'sostenuti' would be used to describe multiple masculine or mixed-gender nouns.","priority":"★★★"},"related_words":{"derivatives":["sostenuto (adjective, adverb, noun)","sostenere (verb)"],"priority":"★★★"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sostenuti' is a musical term, specifically the plural form of 'sostenuto'. It's an Italian word indicating that musical notes or passages should be played in a sustained manner. Understanding this term requires some familiarity with musical notation and Italian grammar. It is not a commonly used word outside of musical contexts."},"example_sentences":[{"sentence":"I movimenti sostenuti dell'orchestra hanno creato un'atmosfera magica.","translation":"(Italian) The sustained movements of the orchestra created a magical atmosphere.","type":"example","meaning_category":"musical direction"},{"sentence":"I suoni sostenuti del violoncello riempivano la sala.","translation":"(Italian) The sustained sounds of the cello filled the hall.","type":"example","meaning_category":"musical direction"}]}