{"word":"hypothecia","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"（菌類の）子嚢盤の下層組織","english_definition":"The tissue layer immediately below the hymenium in an apothecium of a lichen or fungus.","examples":[{"sentence":"The hypothecia of this lichen are dark brown.","translation":"この地衣類のhypotheciaは濃い茶色です。"},{"sentence":"The thickness of the hypothecia is an important characteristic for identifying the species.","translation":"hypotheciaの厚さは、種を識別するための重要な特徴です。"}],"collocations":["dark hypothecia","thick hypothecia","thin hypothecia"],"synonyms":["subhymenium"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'hypo' (under) and 'theke' (case, receptacle), referring to its position below the hymenium.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpoʊˈθiːʃiə/","syllables":"hy-po-the-ci-a"},"inflection":{"noun_plural":"hypotheciae"},"usage_notes":{"explanation":"'Hypothecia' is a technical term used in mycology (the study of fungi) and lichenology (the study of lichens). It refers specifically to a layer of tissue found in certain types of fungal fruiting bodies, particularly apothecia. It is not a commonly used word outside of these scientific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The hypothecia is visible to the naked eye.","correct":"✓ The hypothecia is only visible under a microscope.","note":"Hypothecia are microscopic structures and cannot be seen without magnification."}],"priority":"★★☆"},"related_words":{"derivatives":["hymenium","apothecium","ascomycete"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'hypothecia' is highly specialized, belonging to the vocabulary of mycology and lichenology. Understanding requires familiarity with fungal and lichen anatomy, specifically the structure of apothecia. It's unlikely to be encountered outside of scientific literature or specialized field guides.","priority":"★★☆"},"example_sentences":[{"sentence":"The color of the hypothecia is a key feature in the identification of many lichen species.","translation":"hypotheciaの色は、多くの地衣類の種を識別する上で重要な特徴です。","type":"noun","meaning_category":"子嚢盤の下層組織"},{"sentence":"Microscopic examination revealed a well-developed hypothecia beneath the hymenium.","translation":"顕微鏡検査により、子嚢層の下に発達したhypotheciaが明らかになった。","type":"noun","meaning_category":"子嚢盤の下層組織"}]}