{"word":"playmongering","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"The act of exploiting or manipulating situations or people for personal gain, often in a theatrical or dramatic manner.","english_definition":"Exploitation or manipulation of situations or people for personal gain, often in a theatrical or dramatic manner.","examples":[{"sentence":"His playmongering was evident in how he used the company's resources for his own benefit.","translation":"彼の私利私欲のための状況操作は、彼が会社の資源を自分の利益のために利用していたことからも明らかだった。"},{"sentence":"The politician was accused of playmongering by using emotional rhetoric to sway public opinion.","translation":"その政治家は、感情的なレトリックを使って世論を操作しているとして、状況操作だと非難された。"}],"collocations":["political playmongering","corporate playmongering","emotional playmongering"],"synonyms":["manipulation","exploitation","opportunism","machiavellianism","self-seeking"],"antonyms":["altruism","honesty","integrity","fairness","ethics"]}],"etymology":{"value":"Derived from 'play' (referring to theatrical performance or manipulation) and 'mongering' (referring to the act of dealing in something, often in a derogatory way).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpleɪˌmʌŋɡərɪŋ/","syllables":"play-mun-ger-ing"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Playmongering' is a relatively rare term, often used in critical contexts to describe someone's behavior as opportunistic and manipulative. It suggests a calculated and often theatrical approach to achieving personal goals at the expense of others.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She was playmongering with her friends' feelings.","correct":"✓ She was engaging in playmongering by exploiting her friends' feelings.","note":"'Playmongering' is a noun, so it describes the act itself rather than being a verb describing an action done *to* someone."}],"priority":"★★☆"},"related_words":{"derivatives":["playmonger (noun: a person who engages in playmongering)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Playmongering' is a sophisticated term that describes the act of manipulating situations or people for personal gain, often in a dramatic or theatrical way. It is not a common word and is usually found in formal or critical contexts. The term implies a negative judgment about someone's behavior, suggesting that they are being opportunistic and unethical. Understanding this word requires a good grasp of abstract concepts and nuanced language."},"example_sentences":[{"sentence":"The CEO's playmongering led to the downfall of the company's reputation.","translation":"CEOの状況操作が、会社の評判を失墜させることにつながった。","type":"noun","meaning_category":"manipulation"},{"sentence":"Critics accused the director of playmongering by sensationalizing the documentary for higher ratings.","translation":"批評家たちは、監督が視聴率を上げるためにドキュメンタリーを扇情的にしたとして、状況操作だと非難した。","type":"noun","meaning_category":"exploitation"}]}