{"word":"loss-averse","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"損失回避的な、損失を嫌う","english_definition":"more motivated to avoid a loss than to acquire an equivalent gain.","examples":[{"sentence":"Humans are generally loss-averse.","translation":"人間は一般的に損失回避的である。"},{"sentence":"The investor was loss-averse and unwilling to take risks.","translation":"その投資家は損失回避的で、リスクを冒したがらなかった。"},{"sentence":"Loss-averse behavior can lead to suboptimal decision-making.","translation":"損失回避的な行動は、最適でない意思決定につながる可能性がある。"}],"collocations":["highly loss-averse","extremely loss-averse","demonstrates loss-averse behavior","loss-averse investor","loss-averse decision-making"],"synonyms":["risk-averse (文脈によっては)","conservative (文脈によっては)"],"antonyms":["risk-seeking","risk-neutral"]},{"part_of_speech":"adjective","definition":"(行動経済学において)損失回避性を示す","english_definition":"(in behavioral economics) exhibiting loss aversion.","examples":[{"sentence":"The study examined loss-averse preferences in different age groups.","translation":"その研究は、異なる年齢層における損失回避的な選好を調査した。"},{"sentence":"The model incorporates loss-averse agents.","translation":"そのモデルは、損失回避的な主体を組み込んでいる。"}],"collocations":["loss-averse preferences","loss-averse agents","loss-averse model","loss-averse individuals"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term is derived from the combination of \"loss\" (something that is lost) and \"averse\" (having a strong dislike of or opposition to something). It reflects the tendency to feel the pain of a loss more strongly than the pleasure of an equivalent gain.","priority":"★★★"},"pronunciation":{"ipa":"/ˌlɔːs əˈvɜːrs/","syllables":"loss-a-verse"},"inflection":{"notes":"This is an adjective and does not have different forms for gender or number."},"usage_notes":{"explanation":"\"Loss-averse\" is a term primarily used in behavioral economics and psychology. It describes the tendency for people to feel the pain of a loss more strongly than the pleasure of an equivalent gain. This can lead to irrational decision-making, as individuals may go to great lengths to avoid a loss, even if it means missing out on a potential gain. It's important to note that the degree of loss aversion can vary from person to person.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a loss averse person.","correct":"✓ He is a loss-averse person.","note":"The correct term is \"loss-averse,\" with a hyphen. It's a compound adjective."},{"incorrect":"✗ Loss aversion is when you like to lose money.","correct":"✓ Loss aversion is when you dislike losing money more than you like gaining the same amount.","note":"Loss aversion is not about liking to lose money; it's about disliking losing money more than liking to gain the same amount."}],"priority":"★★☆"},"related_words":{"derivatives":["loss aversion (名詞: 損失回避)"],"phrasal_verbs":[],"related_concepts":["prospect theory","framing effect","cognitive bias"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"relatively low frequency, primarily used in academic or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Loss-averse\" is a term used in economics and psychology to describe how people feel about losing something compared to gaining something of equal value. Imagine finding $100 versus losing $100. Most people would feel worse about losing the $100 than they would feel good about finding $100. That's loss aversion in action. It's a key idea in understanding why people make certain financial decisions.","priority":"★★★"},"example_sentences":[{"sentence":"The company's conservative investment strategy reflects its loss-averse culture.","translation":"その会社の保守的な投資戦略は、その損失回避的な文化を反映している。","type":"adjective","meaning_category":"傾向を示す"},{"sentence":"The study found that even small losses had a significant impact on the participants' decision-making due to their loss-averse tendencies.","translation":"その研究は、参加者の損失回避的な傾向のために、たとえ小さな損失であっても彼らの意思決定に大きな影響を与えることを発見した。","type":"adjective","meaning_category":"行動経済学"}]}