{"word":"fulminic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"雷酸の、爆発性の","english_definition":"Of or pertaining to fulminic acid or its salts; explosive.","examples":[{"sentence":"Fulminic acid is a highly unstable and explosive compound.","translation":"雷酸は非常に不安定で爆発性の高い化合物です。"},{"sentence":"Fulminic acid salts are known for their detonating properties.","translation":"雷酸塩は起爆性があることで知られています。"}],"collocations":["fulminic acid","fulminate of mercury"],"synonyms":["explosive","detonating","unstable"],"antonyms":["stable","inert"]}],"etymology":{"value":"Derived from 'fulminic acid,' which comes from the Latin 'fulmen' meaning 'lightning,' referring to the sudden and violent nature of its decomposition.","priority":"★★☆"},"pronunciation":{"ipa":"/fʊlˈmɪnɪk/","syllables":"ful-min-ic"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Fulminic' is primarily used in a chemical context to describe substances related to fulminic acid, particularly concerning their explosive properties. It is not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The situation was fulminic.","correct":"✓ The situation was volatile.","note":"'Fulminic' specifically refers to chemical compounds. For general explosive or volatile situations, use 'volatile' or 'explosive' instead."}],"priority":"★☆☆"},"related_words":{"derivatives":["fulminate (verb: to explode violently or denounce forcefully; noun: a salt of fulminic acid)","fulmination (noun: a violent explosion or a vehement denunciation)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - primarily used in specialized scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Fulminic' is a technical term primarily encountered in chemistry. It describes substances related to fulminic acid, known for their explosive nature. Due to its specialized use, it is rarely found outside of scientific or technical contexts. Understanding this term requires familiarity with chemical nomenclature and explosive compounds."},"example_sentences":[{"sentence":"The chemist carefully handled the fulminic compound.","translation":"化学者は慎重に雷酸化合物を扱った。","type":"adjective","meaning_category":"爆発性の"},{"sentence":"Fulminic acid derivatives are used in some types of detonators.","translation":"雷酸誘導体は、ある種の雷管に使用されている。","type":"adjective","meaning_category":"雷酸の"}]}