{"word":"nonbank","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"非銀行、ノンバンク","english_definition":"A financial institution that is not a bank, such as a credit union, insurance company, or finance company.","examples":[{"sentence":"Nonbanks play an increasingly important role in the financial system.","translation":"ノンバンクは金融システムにおいてますます重要な役割を果たしている。"},{"sentence":"Many nonbanks offer services similar to those of traditional banks.","translation":"多くのノンバンクは従来の銀行と同様のサービスを提供している。"},{"sentence":"The regulatory framework for nonbanks is often less stringent than for banks.","translation":"ノンバンクに対する規制の枠組みは、銀行に対するものよりも緩いことが多い。"}],"collocations":["nonbank financial institution","nonbank lender","nonbank mortgage company","shadow bank"],"synonyms":["financial institution","alternative lender"],"antonyms":["bank"],"notes":"Often used to describe institutions that provide financial services without being subject to the same regulations as traditional banks. Sometimes referred to as 'shadow banks'."}],"etymology":{"value":"Formed by adding the prefix 'non-' to the word 'bank'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈnɒn.bæŋk/","syllables":"non-bank"},"inflection":{"noun_plural":"nonbanks"},"usage_notes":{"explanation":"'Nonbank' refers to a financial institution that provides certain banking services but does not hold a banking license or is not subject to the same regulatory requirements as traditional banks. These institutions can include credit unions, insurance companies, finance companies, and other alternative lenders. They often specialize in specific types of lending or financial services.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonbank is regulated as a bank.","correct":"✓ The nonbank is regulated differently than a bank.","note":"Nonbanks are not regulated in the same way as banks, which is a key distinction."},{"incorrect":"✗ Only banks can offer mortgages; nonbanks cannot.","correct":"✓ Nonbanks can also offer mortgages.","note":"Nonbanks are often involved in mortgage lending."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["fintech","shadow banking","alternative finance"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but increasing in usage.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Nonbank' is a term used in finance to describe companies that offer financial services similar to banks but are not banks themselves. These companies might offer loans, mortgages, or other financial products. The term is important in understanding the modern financial system, as nonbanks play a significant role but are often regulated differently than traditional banks."},"example_sentences":[{"sentence":"The rise of nonbank lenders has increased competition in the mortgage market.","translation":"ノンバンクの貸し手の台頭は、住宅ローン市場における競争を激化させている。","type":"general"},{"sentence":"Some nonbanks specialize in providing loans to small businesses.","translation":"一部のノンバンクは、中小企業への融資を専門としている。","type":"specific"},{"sentence":"The government is considering new regulations for nonbank financial institutions.","translation":"政府はノンバンク金融機関に対する新たな規制を検討している。","type":"regulatory"}]}