{"word":"blast-frozen","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"急速冷凍された、ブラスト冷凍された","english_definition":"preserved by being frozen very rapidly.","examples":[{"sentence":"The blast-frozen vegetables retain more of their nutrients.","translation":"急速冷凍された野菜は、より多くの栄養素を保持している。"},{"sentence":"We use blast-frozen seafood to ensure freshness.","translation":"鮮度を保つため、急速冷凍されたシーフードを使用しています。"}],"collocations":["blast-frozen vegetables (急速冷凍された野菜)","blast-frozen seafood (急速冷凍されたシーフード)","blast-frozen food (急速冷凍された食品)"],"synonyms":["flash-frozen","snap-frozen","quick-frozen"],"antonyms":["slow-frozen","fresh"],"notes":"Blast freezing is a method of rapidly freezing food by subjecting it to extremely cold air, typically produced by fans blowing over cold coils. This process minimizes the formation of large ice crystals, which can damage the food's texture and flavor."}],"etymology":{"value":"The term 'blast-frozen' is a compound word derived from 'blast,' referring to the forceful air used in the freezing process, and 'frozen,' indicating the state of being solidified by cold.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈblæst ˈfroʊzən/","syllables":"blast-fro-zen"},"inflection":{"notes":"This is an adjective, so it does not inflect for number or gender."},"usage_notes":{"explanation":"'Blast-frozen' is used to describe food that has been quickly frozen using a blast freezer. This method is preferred because it helps to preserve the quality, texture, and flavor of the food better than slower freezing methods. It's commonly used in the food industry for items like vegetables, fruits, seafood, and meats.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The blast-freezed fish was delicious.","correct":"✓ The blast-frozen fish was delicious.","note":"The correct past participle form is 'frozen', not 'freezed'."}],"priority":"★★☆"},"related_words":{"derivatives":["blast freezer (急速冷凍庫)","freezing (冷凍)"],"phrasal_verbs":[],"related_terms":["flash freezing","snap freezing","cryogenic freezing"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in the context of food production and preservation.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Blast-frozen' describes food that has been frozen very quickly using a special method called blast freezing. This quick freezing helps keep the food fresh and tasty for longer. You'll often see this term used when talking about frozen vegetables, seafood, or other foods that need to stay in good condition. It's a bit more technical than just saying 'frozen,' as it specifies the type of freezing process used."},"example_sentences":[{"sentence":"The chef prefers using blast-frozen shrimp for his sushi.","translation":"そのシェフは寿司に急速冷凍されたエビを使うのを好む。","type":"general","meaning_category":"general"},{"sentence":"Blast-frozen berries are a great addition to smoothies.","translation":"急速冷凍されたベリーはスムージーに加えるのに最適だ。","type":"general","meaning_category":"general"}]}