{"word":"radiodense","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(医学)X線または他の放射線に対して不透過性のある、放射線不透過性の","english_definition":"(medicine) impenetrable to X-rays or other forms of radiation.","examples":[{"sentence":"The tumor appeared radiodense on the X-ray, indicating a high level of calcification.","translation":"腫瘍はX線で放射線不透過性を示し、高度の石灰化を示唆していた。"},{"sentence":"Barium sulfate is a radiodense contrast agent used to enhance the visibility of the gastrointestinal tract during imaging.","translation":"硫酸バリウムは、画像診断中に消化管の可視性を高めるために使用される放射線不透過性造影剤です。"},{"sentence":"Radiodense materials are used in radiation shielding to protect against harmful radiation exposure.","translation":"放射線不透過性材料は、有害な放射線被ばくから保護するために放射線遮蔽に使用されます。"}],"collocations":["radiodense lesion","radiodense material","radiodense contrast agent","appear radiodense","highly radiodense"],"synonyms":["radiopaque","opaque","impermeable to radiation"],"antonyms":["radiolucent","transparent to radiation"]}],"etymology":{"value":"Derived from 'radio-' (referring to radiation) and 'dense' (having high density).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌreɪdioʊˈdɛns/","syllables":"ra-di-o-dense"},"inflection":{"notes":"No specific inflection as it is an adjective."},"usage_notes":{"explanation":"'Radiodense' is a term used in medical imaging to describe the property of a substance or tissue that blocks or absorbs X-rays or other forms of radiation, appearing as a lighter or whiter area on a radiograph (X-ray image). The degree of radiodensity is related to the material's composition and density; denser materials like bone or metal are more radiodense than less dense tissues like lung or fat. This property is crucial for differentiating structures and identifying abnormalities in medical imaging.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The radiodense is on the left side of the image.","correct":"✓ The radiodense area/lesion is on the left side of the image.","note":"'Radiodense' is an adjective, so it needs to modify a noun (e.g., area, lesion, material)."},{"incorrect":"✗ The air is radiodense.","correct":"✓ The air is radiolucent.","note":"Air is not radiodense; it's radiolucent, meaning it allows radiation to pass through easily."}],"priority":"★★☆"},"related_words":{"derivatives":["radiodensity (noun)"],"phrasal_verbs":[],"related_terms":["radiopaque","radiolucent","X-ray","computed tomography (CT)","magnetic resonance imaging (MRI)","contrast agent","attenuation"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Radiodense' is a technical term used in medicine, specifically in radiology and medical imaging. It describes a substance or tissue that is difficult for X-rays or other radiation to pass through. On an X-ray image, radiodense areas appear lighter or whiter because they block more of the radiation. This term is important for doctors and radiologists to describe what they see on medical images and to help diagnose medical conditions. Understanding this term requires some knowledge of medical imaging principles."},"example_sentences":[{"sentence":"The **radiodense** foreign object was clearly visible in the patient's esophagus.","translation":"放射線不透過性の異物が患者の食道に明瞭に見えた。","type":"adjective","meaning_category":"medical imaging"},{"sentence":"Calcification within the artery made it appear **radiodense** on the angiogram.","translation":"動脈内の石灰化により、血管造影で放射線不透過性に見えた。","type":"adjective","meaning_category":"medical imaging"},{"sentence":"Compared to the surrounding tissue, the tumor exhibited a **radiodense** appearance.","translation":"周囲の組織と比較して、腫瘍は放射線不透過性の外観を示した。","type":"adjective","meaning_category":"medical imaging"}]}