{"word":"arithmocratic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(数学者や数字に精通した人々によって統治されることを特徴とするさま) 数理政治の、算術政治の","english_definition":"characterized by arithmocracy (government by mathematicians or those skilled in numbers)","examples":[{"sentence":"The novel depicted a dystopian society with an arithmocratic government, where citizens were ranked based on their mathematical abilities.","translation":"その小説は、市民が数学的能力に基づいてランク付けされる数理政治的な政府を持つ、ディストピア社会を描いていた。"}],"collocations":["arithmocratic government","arithmocratic society","arithmocratic rule"],"synonyms":["mathematicocracy","numerocracy"],"antonyms":["democracy","autocracy","oligarchy"]}],"etymology":{"value":"'Arithmocratic' is derived from the combination of 'arithmo-' (referring to arithmetic or numbers) and '-cratic' (referring to rule or power). The term reflects a system where power or governance is based on mathematical or numerical principles.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌærɪθməˈkrætɪk/","syllables":"a-rith-mo-crat-ic"},"inflection":{"notes":"Since 'arithmocratic' is an adjective, it does not have plural forms or verb conjugations. Its comparative and superlative forms are 'more arithmocratic' and 'most arithmocratic', respectively."},"usage_notes":{"explanation":"'Arithmocratic' is a relatively rare term used to describe a system of government or social structure where mathematical or numerical skills are the basis for authority or power. It is often used in fictional or theoretical contexts to explore the implications of such a system. The term is not commonly used in mainstream political science or sociology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The arithmocratic was elected by the people.","correct":"✓ The arithmocrat was elected by the people.","note":"'Arithmocratic' is an adjective, not a noun. To refer to a person who supports or practices arithmocracy, you might use 'arithmocrat' (though this term is also rare)."},{"incorrect":"✗ Arithmocratic is a type of democracy.","correct":"✓ Arithmocracy is a type of government, but is distinct from democracy.","note":"Arithmocracy is a distinct form of government, not a type of democracy. It is based on mathematical or numerical principles, whereas democracy is based on popular sovereignty."}],"priority":"★★☆"},"related_words":{"derivatives":["arithmocracy (noun: government by mathematicians or those skilled in numbers)","arithmocrat (noun: a supporter or practitioner of arithmocracy)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Arithmocratic' is a highly specialized term primarily used in theoretical or fictional contexts to describe a system where mathematical or numerical skills dictate governance or social hierarchy. Due to its rarity and the complexity of the concept it represents, it is not commonly encountered in general language use. Understanding this term requires familiarity with political theory and abstract concepts of governance.","priority":"★☆☆"},"example_sentences":[{"sentence":"The science fiction novel explored the potential consequences of an **arithmocratic** society.","translation":"そのSF小説は、数理政治的な社会の潜在的な結果を探求した。","type":"adjective","meaning_category":"Describing a society"},{"sentence":"In the philosopher's thought experiment, he imagined an **arithmocratic** state ruled by algorithms.","translation":"その哲学者の思考実験では、彼はアルゴリズムによって支配される数理政治的な国家を想像した。","type":"adjective","meaning_category":"Theoretical government"},{"sentence":"Critics of the proposed system argued it would lead to an **arithmocratic** elite, disconnected from the needs of ordinary citizens.","translation":"提案されたシステムに対する批評家は、それが一般市民のニーズから切り離された数理政治的なエリートにつながると主張した。","type":"adjective","meaning_category":"Criticism of a system"}]}