{"word":"elaterin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"エラテリン：ニガウリ（苦瓜）などの植物に含まれる苦味のある物質。下剤や催吐剤として用いられる。","english_definition":"A bitter crystalline compound, C32H44O8, obtained from the fruit of the squirting cucumber (Ecballium elaterium), formerly used as a drastic purgative and emetic.","examples":[{"sentence":"Elaterin is a potent substance found in certain plants.","translation":"エラテリンは特定の植物に含まれる強力な物質です。"},{"sentence":"The medicinal use of elaterin has declined due to its strong side effects.","translation":"エラテリンの薬用利用は、その強い副作用のために減少しました。"}],"collocations":["extract elaterin","elaterin toxicity","elaterin properties"],"synonyms":["cucurbitacin","bitter principle"],"antonyms":[]}],"etymology":{"value":"Derived from 'Elaterium', the pharmaceutical preparation made from the juice of the squirting cucumber, combined with the suffix '-in' denoting a chemical substance. Elaterium comes from Greek 'elaterios' meaning 'driving' or 'expelling', referring to its purgative action.","priority":"★★★"},"pronunciation":{"ipa":"/ɪˈlætərɪn/","syllables":"e-lat-er-in"},"inflection":{"noun_plural":"elaterins"},"usage_notes":{"explanation":"Elaterin is a specific chemical compound, primarily of historical and scientific interest. Its use as a medicine has largely been discontinued due to its potent effects and potential toxicity. The term is most often encountered in scientific literature or historical medical texts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Elaterin is a type of vitamin.","correct":"✓ Elaterin is a chemical compound found in certain plants.","note":"Elaterin is not a vitamin but a specific chemical compound."},{"incorrect":"✗ Elaterin is safe to use without any precautions.","correct":"✓ Elaterin should be handled with caution due to its potential toxicity.","note":"Elaterin is a potent substance and can be toxic if not used properly."}],"priority":"★★☆"},"related_words":{"derivatives":["Elaterium (noun: a dried sediment from the juice of the squirting cucumber)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な科学・医学分野でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**elaterin**」は、特定の植物、特にニガウリ（苦瓜）に含まれる苦味のある結晶性の化合物です。これは、かつては強力な下剤および催吐剤として使用されていましたが、その強い作用と潜在的な毒性のため、現代医学ではほとんど使用されていません。この用語は、主に化学、薬学、または植物学の分野で見られます。一般の人が日常的に使用する単語ではありません。"},"example_sentences":[{"sentence":"The plant extract contained a high concentration of elaterin.","translation":"その植物抽出物には高濃度のエラテリンが含まれていました。","type":"general","meaning_category":"chemical compound"},{"sentence":"Historically, elaterin was used to treat various ailments.","translation":"歴史的に、エラテリンは様々な病気の治療に使用されていました。","type":"historical","meaning_category":"medical use"},{"sentence":"Studies have investigated the potential toxicity of elaterin.","translation":"エラテリンの潜在的な毒性に関する研究が行われています。","type":"scientific","meaning_category":"toxicity"}]}