{"word":"orrisroot","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ニオイアヤメの根。香料、薬、化粧品などに使用される。","english_definition":"The rhizome of the Florentine iris (Iris florentina), or pale iris (Iris pallida), or sweet iris (Iris germanica), used in perfumery, medicine, and cosmetics.","examples":[{"sentence":"Orrisroot is used as a fixative in potpourris.","translation":"ニオイアヤメの根はポプリの保留剤として使われる。"},{"sentence":"The scent of orrisroot is often described as violet-like.","translation":"ニオイアヤメの根の香りは、しばしばスミレに似ていると表現される。"}],"collocations":["orris root powder","orris root extract"],"synonyms":["iris rhizome"],"antonyms":[]}],"etymology":{"value":"'Orris' is derived from 'iris', and 'root' refers to the rhizome of the iris plant.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɒrɪsˌruːt/","syllables":"or-ris-root"},"inflection":{"notes":"Uncountable noun"},"usage_notes":{"explanation":"Orrisroot is primarily valued for its fragrance, which develops during the drying and aging process. It is a common ingredient in perfumes, cosmetics, and potpourris. It also has historical uses in traditional medicine.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I added orrisroot to my soup for flavor.","correct":"✓ I added herbs and spices to my soup for flavor.","note":"Orrisroot is not typically used in cooking. It is primarily used for its fragrance."}],"priority":"★★☆"},"related_words":{"derivatives":["orris (noun, short for orrisroot)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Orrisroot' is a specialized term primarily encountered in contexts related to perfumery, cosmetics, and herbal medicine. It refers to the rhizome of certain iris species, valued for its violet-like scent after processing. Due to its niche usage, it is not a common term in general vocabulary."},"example_sentences":[{"sentence":"The antique perfume contained a base note of aged orrisroot.","translation":"そのアンティーク香水は、熟成されたニオイアヤメの根をベースノートとして含んでいた。","type":"noun","meaning_category":"fragrance"},{"sentence":"Orrisroot powder is sometimes used in cosmetics for its absorbent properties.","translation":"ニオイアヤメの根の粉末は、吸収性があるため、化粧品に時々使用される。","type":"noun","meaning_category":"cosmetics"}]}