{"word":"osteoderm","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"骨皮（こっぴ）：皮膚の中に形成される骨質の板状構造。爬虫類（ワニ、トカゲなど）や一部の哺乳類（アルマジロなど）に見られる。","english_definition":"A bony deposit forming scales, plates or other structures in the dermal layers of the skin. Osteoderms are found in a variety of extinct and extant vertebrate taxa, including reptiles and mammals.","examples":[{"sentence":"Crocodiles have osteoderms beneath their scales, providing them with extra protection.","translation":"ワニは鱗の下に骨皮を持ち、それによって追加の保護を得ている。"},{"sentence":"The armadillo's shell is composed of numerous osteoderms.","translation":"アルマジロの甲羅は多数の骨皮で構成されている。"}],"collocations":["dermal armor","bony plates","reptilian scales","mammalian armor"],"synonyms":["dermal bone","scute","scale","plate"],"antonyms":[]}],"etymology":{"value":"「osteo-」（骨）+「derm」（皮膚）の組み合わせ。ギリシャ語の「osteon」（骨）と「derma」（皮膚）に由来する。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɒstiːoʊdɜːrm/","syllables":"os-te-o-derm"},"inflection":{"noun_plural":"osteoderms"},"usage_notes":{"explanation":"Osteoderms are bony plates located in the dermis (skin) of various animals. They serve as a form of armor, providing protection against predators or environmental hazards. The size, shape, and arrangement of osteoderms vary greatly depending on the species.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The turtle's shell is an osteoderm.","correct":"✓ The turtle's shell contains bone, but is not solely composed of osteoderms.","note":"Turtle shells are more complex structures involving ribs and vertebrae fused with dermal bone. While osteoderms can be a component, it's not accurate to describe the entire shell as a single osteoderm."}],"priority":"★☆☆"},"related_words":{"derivatives":["osteodermal (形容詞：骨皮の)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Osteoderm' is a technical term used in zoology and paleontology to describe bony plates embedded in the skin of certain animals. It's not a word you'd encounter in everyday conversation, but rather in scientific contexts when discussing the anatomy or evolutionary adaptations of animals like crocodiles, armadillos, or dinosaurs. Understanding the term requires some background knowledge in biology or related fields."},"example_sentences":[{"sentence":"Fossil evidence suggests that many dinosaurs possessed osteoderms.","translation":"化石の証拠は、多くの恐竜が骨皮を持っていたことを示唆している。","type":"general","meaning_category":"general"},{"sentence":"The arrangement of osteoderms on an armadillo is unique to each species.","translation":"アルマジロの骨皮の配置は種ごとに独特である。","type":"specific","meaning_category":"specific"}]}