{"word":"gaolbird","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"（俗語、軽蔑的）常習犯、刑務所帰り、前科者","english_definition":"(slang, derogatory) a habitual criminal; a person who has served time in prison.","examples":[{"sentence":"He's a gaolbird with a long record of petty crimes.","translation":"彼は軽犯罪の長い記録を持つ前科者だ。","usage":"Describes someone with a history of imprisonment.","level":"C2"},{"sentence":"The newspaper referred to the suspect as a 'gaolbird' in its report.","translation":"新聞はその容疑者を記事の中で「刑務所帰り」と呼んだ。","usage":"Used in a derogatory way to label someone.","level":"C2"}],"collocations":["habitual gaolbird","notorious gaolbird","reformed gaolbird"],"synonyms":["ex-convict","jailbird","prisoner","inmate","recidivist","repeat offender","criminal","offender"],"antonyms":["law-abiding citizen","rehabilitated offender"],"register":"slang, derogatory"}],"etymology":{"value":"Combination of 'gaol' (British spelling of 'jail') and 'bird' (slang term for a person, especially one confined).","notes":"The term reflects the British origin of the word 'gaol' for 'jail'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒeɪlbɜːrd/","phonetic":"jail-burd"},"inflection":{"noun_plural":"gaolbirds"},"usage_notes":{"explanation":"The term 'gaolbird' is primarily used in British English and is considered slang and often derogatory. It refers to someone who has been imprisoned, especially repeatedly. The term carries a negative connotation and is not generally used in formal or neutral contexts. The American English equivalent is 'jailbird'.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He is a gaolbird, so we should admire him.","correct":"He is a gaolbird, so we should be cautious around him.","note":"The term 'gaolbird' has negative connotations; therefore, it is inappropriate to use it in a context suggesting admiration."},{"incorrect":"She is a gaolbird for stealing bread to feed her family.","correct":"She is an ex-convict for stealing bread to feed her family.","note":"While 'gaolbird' can be used, 'ex-convict' is a more neutral and less judgmental term in this context."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["gaol","jail","prison","convict","felon","misdemeanant"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Gaolbird' is an uncommon and informal term used to describe someone who has been imprisoned, often repeatedly. It carries a negative connotation and is primarily used in British English. Due to its informal and potentially offensive nature, it is important to use this term with caution and be aware of its implications. More neutral terms like 'ex-convict' or 'ex-offender' are often preferred in formal contexts."},"example_sentences":[{"sentence":"The old man was rumored to be a gaolbird who had spent half his life behind bars.","translation":"その老人は人生の半分を刑務所で過ごした常習犯だという噂があった。","type":"noun","meaning_category":"常習犯"},{"sentence":"Local residents were wary of the new neighbor, suspecting he was a gaolbird.","translation":"地元の住民は、新しい隣人が前科者ではないかと疑い、警戒していた。","type":"noun","meaning_category":"刑務所帰り"}]}