{"word":"quasi-truthful","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"部分的に真実である、ほとんど真実である、真実のように見えるが完全には真実ではない","english_definition":"partially truthful; seemingly truthful but not entirely so.","examples":[{"sentence":"The politician's statement was quasi-truthful, containing elements of fact mixed with misleading information.","translation":"その政治家の声明は、誤解を招く情報が混ざった事実の要素を含んでおり、部分的に真実であった。"},{"sentence":"The advertisement made quasi-truthful claims about the product's benefits, exaggerating its effectiveness.","translation":"その広告は、製品の利点について、効果を誇張した、ほとんど真実である主張をした。"},{"sentence":"His quasi-truthful account of the events left out crucial details.","translation":"彼の出来事に関するほとんど真実である説明は、重要な詳細を省いていた。"}],"collocations":["quasi-truthful statement","quasi-truthful claim","quasi-truthful account","quasi-truthful representation"],"synonyms":["partially true","somewhat truthful","apparently truthful","ostensibly truthful","seemingly truthful","not entirely truthful"],"antonyms":["completely false","wholly untrue","entirely misleading","patently false","untruthful"]}],"etymology":{"value":"「quasi-」は「似た、ほとんど～」を意味する接頭辞で、ラテン語の「quasi」（まるで、～のように）に由来する。「truthful」は「真実の、正直な」を意味する。したがって、「quasi-truthful」は「ほとんど真実の」または「真実のように見える」という意味になる。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkweɪzaɪˈtruːθfəl/","syllables":"quasi-truth-ful"},"inflection":{"notes":"形容詞なので、比較級 (more quasi-truthful) と最上級 (most quasi-truthful) が存在する。"},"usage_notes":{"explanation":"「**quasi-truthful**」は、何かが真実であるように見えるが、実際には完全に真実ではない状態を指す。しばしば、意図的に誤解を招くような情報が含まれている場合や、重要な詳細が省略されている場合に使われる。この単語は、完全な嘘ではないものの、真実を歪曲している状況を批判的に表現する際に役立つ。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The story was quasi-truthful, so it was completely reliable.","correct":"✓ The story was quasi-truthful, so it should be treated with caution.","note":"「quasi-truthful」な話は、完全に信頼できるとは限らない。部分的に真実であっても、誤解を招く要素が含まれている可能性があるため、注意が必要である。"},{"incorrect":"✗ He gave a quasi-truthful explanation, which meant it was 100% accurate.","correct":"✓ He gave a quasi-truthful explanation, which meant it was not entirely accurate.","note":"「quasi-truthful」な説明は、100％正確ではない。真実と嘘が混ざっている可能性がある。"}],"priority":"★★☆"},"related_words":{"derivatives":["quasi (副詞: ほとんど、～のような)","truthful (形容詞: 真実の、正直な)","truthfulness (名詞: 真実であること、正直さ)"],"phrases":["half-truth (名詞: 半真実)","misleading (形容詞: 誤解を招く)","deceptive (形容詞: 欺瞞的な)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門的な文脈でまれに使用される)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**quasi-truthful**」という言葉は、ある情報が真実のように見えるけれど、完全に真実ではないときに使われます。これは、少しだけ嘘が混ざっていたり、大切な情報が隠されていたりするときに使われることが多いです。例えば、政治家の発言や広告などで、真実を少し曲げて伝えているような場合に、この言葉を使うことができます。日常会話ではあまり使いませんが、ニュース記事や専門的な文章で目にすることがあります。"},"example_sentences":[{"sentence":"The company's marketing campaign made several quasi-truthful claims about the product's capabilities.","translation":"その会社のマーケティングキャンペーンは、製品の性能についていくつかのほとんど真実である主張をした。","type":"adjective","meaning_category":"部分的に真実である"},{"sentence":"The witness provided a quasi-truthful account of the incident, omitting key details that could incriminate him.","translation":"目撃者は、彼を罪に陥れる可能性のある重要な詳細を省略し、事件についてほとんど真実である説明をした。","type":"adjective","meaning_category":"真実のように見えるが完全には真実ではない"},{"sentence":"The documentary presented a quasi-truthful narrative, selectively highlighting certain facts to support its argument.","translation":"そのドキュメンタリーは、その主張を支持するために特定の事実を選択的に強調し、ほとんど真実である物語を提示した。","type":"adjective","meaning_category":"部分的に真実である"}]}