{"word":"Caesarism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"帝王主義、シーザー主義：強力な中央集権的政府による支配、特に軍事独裁者が人気取りの政策や扇動的な手法を用いて権力を維持する場合を指す政治体制。","english_definition":"A political system resembling that of the Roman emperors, especially one in which a strong central government is controlled by a leader, often a military dictator, who maintains power through popular appeal or demagoguery.","examples":[{"sentence":"Some historians argue that Napoleon's rule was a form of Caesarism.","translation":"一部の歴史家は、ナポレオンの統治は帝王主義の一形態であったと主張している。"},{"sentence":"Caesarism often arises in times of political instability and social unrest.","translation":"帝王主義は、政治的不安定と社会不安の時代によく発生する。"},{"sentence":"The leader's populist rhetoric masked a clear tendency towards Caesarism.","translation":"その指導者の大衆迎合的なレトリックは、帝王主義への明らかな傾向を覆い隠していた。"}],"collocations":["rise of Caesarism (帝王主義の台頭)","tendencies towards Caesarism (帝王主義への傾向)","modern Caesarism (現代の帝王主義)"],"synonyms":["autocracy","dictatorship","despotism","authoritarianism","tyranny"],"antonyms":["democracy","republicanism","constitutionalism"]},{"part_of_speech":"noun","definition":"（歴史的な文脈で）古代ローマの皇帝政治。","english_definition":"(In a historical context) The system of government practiced by the Roman emperors.","examples":[{"sentence":"Caesarism in ancient Rome involved a complex interplay of military power, political maneuvering, and popular support.","translation":"古代ローマの帝王主義は、軍事力、政治的策略、そして大衆の支持が複雑に絡み合っていた。"}],"collocations":[],"synonyms":["Roman Empire","Imperial rule"],"antonyms":["Roman Republic"]}],"etymology":{"value":"ラテン語の「Caesar」（カエサル、ローマ皇帝の称号）に、主義・体制を表す接尾辞「-ism」が付いたもの。ガイウス・ユリウス・カエサル（Gaius Julius Caesar）に由来し、彼の権力掌握と統治スタイルが、後の独裁的な支配体制のモデルとなった。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsiːzərɪzəm/","syllables":"Cae-sar-ism"},"inflection":{"notes":"不可算名詞"},"usage_notes":{"explanation":"「**Caesarism**」は、単なる独裁政治ではなく、リーダーが軍事力やカリスマ性、大衆扇動などを通じて大衆の支持を得ながら権力を維持する政治体制を指します。古代ローマのカエサルのように、形式的には共和制を維持しながらも、実質的には一人の人物が絶対的な権力を握る状態を指すことが多いです。現代の政治分析では、ポピュリズムと結びついた権威主義的なリーダーシップを批判的に表現する際に用いられます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The country transitioned from democracy to Caesarism peacefully.","correct":"✓ The country transitioned from democracy to Caesarism, often involving violence or coercion.","note":"帝王主義への移行は、通常、平和的なものではなく、暴力や強制力を伴うことが多いです。"},{"incorrect":"✗ Caesarism is the same as monarchy.","correct":"✓ Caesarism is similar to monarchy, but it emphasizes the leader's popular support and often involves populist policies.","note":"帝王主義は君主制と似ていますが、リーダーの大衆の支持と、大衆迎合的な政策が強調される点が異なります。"}],"priority":"★★☆"},"related_words":{"derivatives":["Caesarist (名詞/形容詞: 帝王主義者、帝王主義的な)","Caesaristic (形容詞: 帝王主義的な)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 政治学や歴史学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Caesarism**」は、一般的にはあまり使われない専門的な言葉で、政治学や歴史学でよく出てきます。これは、古代ローマの皇帝（カエサル）のように、強いリーダーが軍事力や人気を使って国を支配する政治のやり方を指します。ただの独裁政治ではなく、大衆の支持を得ながら権力を持つという点が特徴です。政治や歴史について深く学ぶときに知っておくと役立つ言葉です。"},"example_sentences":[{"sentence":"The political scientist analyzed the president's policies as a form of modern **Caesarism**.","translation":"その政治学者は、大統領の政策を現代の帝王主義の一形態として分析した。","type":"noun","meaning_category":"帝王主義"},{"sentence":"Critics accused the leader of exhibiting **Caesarism** through his control of the media and suppression of dissent.","translation":"批判者たちは、その指導者がメディアの支配と反対意見の抑圧を通じて帝王主義を示していると非難した。","type":"noun","meaning_category":"帝王主義"},{"sentence":"The historian argued that **Caesarism** was a natural outcome of the late Roman Republic's political decay.","translation":"その歴史家は、帝王主義はローマ共和制末期の政治的衰退の自然な結果であると主張した。","type":"noun","meaning_category":"帝王主義"}]}