{"word":"Semisaint","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A person who is regarded as being almost a saint, but who has not been officially canonized.","english_definition":"A person who is regarded as being almost a saint, but who has not been officially canonized by a church.","examples":[{"sentence":"She was revered as a semisaint by the local community for her selfless acts of charity.","translation":"彼女は無私の慈善活動により、地元のコミュニティから準聖人として崇拝されていました。"},{"sentence":"Although not formally recognized, his followers considered him a semisaint due to his extraordinary piety.","translation":"正式には認められていませんが、彼の信者たちは彼の並外れた敬虔さから、彼を準聖人とみなしていました。"}],"collocations":["revered as a semisaint","considered a semisaint","regarded as a semisaint"],"synonyms":["near-saint","almost saint"],"antonyms":[]}],"etymology":{"value":"Formed from the prefix 'semi-' (meaning 'half' or 'partly') and the noun 'saint'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɛmiˌseɪnt/","syllables":"sem-i-saint"},"inflection":{"noun_plural":"Semisaints"},"usage_notes":{"explanation":"The term 'semisaint' is used to describe individuals who possess saint-like qualities but have not undergone the formal process of canonization within a religious institution. It often reflects popular or local veneration rather than official recognition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a semi-saint person.","correct":"✓ He is a semisaint.","note":"The term 'semisaint' is already a noun, so adding 'person' is redundant."}],"priority":"★★☆"},"related_words":{"derivatives":["semisainted (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'semisaint' describes someone who is seen as very holy or saintly but hasn't been officially declared a saint by a church. It's like they're 'halfway' to being a saint in the eyes of people, but the official process hasn't happened. It's not a very common word, so you'll mostly find it in discussions about religion or history."},"example_sentences":[{"sentence":"The local villagers often spoke of the old woman as a semisaint because of her kindness and generosity.","translation":"地元の村人たちは、その老女の優しさと寛大さから、彼女を準聖人のように語ることがよくありました。","type":"noun","meaning_category":"Person regarded as almost a saint"},{"sentence":"Many believed that the founder of the order was a semisaint, though the Church had never formally recognized him.","translation":"多くの人が、その修道会の創設者は準聖人であると信じていましたが、教会は彼を正式に認めたことはありませんでした。","type":"noun","meaning_category":"Person regarded as almost a saint"}]}