{"word":"Civitan","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"シビタン、シビタンクラブ (公共奉仕団体)","english_definition":"A civic organization whose members volunteer to better their communities.","examples":[{"sentence":"She is a member of the local Civitan club.","translation":"彼女は地元のシビタンクラブの会員です。"},{"sentence":"The Civitan organization focuses on helping people with developmental disabilities.","translation":"シビタン組織は、発達障害を持つ人々の支援に重点を置いています。"},{"sentence":"Civitan clubs raise money for various charitable causes.","translation":"シビタンクラブは、さまざまな慈善活動のために資金を集めています。"}],"collocations":["Civitan club","local Civitan","Civitan member","Civitan International"],"synonyms":["service club","volunteer organization","community organization"],"antonyms":[]}],"etymology":{"value":"The name 'Civitan' is derived from the Latin word 'civitas,' meaning citizenship.","priority":"★★★"},"pronunciation":{"ipa":"ˈsɪvɪtən","syllables":"Civ-i-tan"},"inflection":{"noun_plural":"Civitans"},"usage_notes":{"explanation":"'Civitan' refers to a specific international service organization. It is a proper noun and is usually capitalized. The organization is known for its volunteer work and community service, particularly its focus on helping individuals with developmental disabilities.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a civitan.","correct":"✓ He is a Civitan.","note":"'Civitan' is a proper noun and should be capitalized when referring to a member or the organization itself."},{"incorrect":"✗ They are part of civitan club.","correct":"✓ They are part of the Civitan club.","note":"'Civitan club' is a specific organization and should be capitalized."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_organizations":["Kiwanis","Rotary","Lions Club"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Civitan' is a proper noun referring to a specific international service organization. Understanding its meaning requires familiarity with community service organizations. It is not a commonly used word outside of contexts related to volunteer work and community involvement. The etymology is straightforward, derived from the Latin 'civitas,' meaning citizenship, which provides context for the organization's mission.","priority":"★★★"},"example_sentences":[{"sentence":"The Civitan chapter organized a fundraising event for the local hospital.","translation":"シビタンの支部は、地元の病院のために資金調達イベントを企画しました。","type":"noun","meaning_category":"organization"},{"sentence":"As a Civitan, she volunteers her time to help children with special needs.","translation":"シビタンの会員として、彼女は特別な支援を必要とする子供たちのために時間を割いてボランティア活動をしています。","type":"noun","meaning_category":"member"},{"sentence":"Civitan International supports various community projects around the world.","translation":"シビタン・インターナショナルは、世界中のさまざまな地域社会プロジェクトを支援しています。","type":"noun","meaning_category":"organization"}]}