{"word":"plasticizer","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"可塑剤（かそざい）","english_definition":"A substance (typically a solvent) added to a synthetic resin to produce or promote plasticity and flexibility and to reduce brittleness.","examples":[{"sentence":"Phthalates are commonly used as plasticizers in PVC.","translation":"フタル酸エステルは、PVCの可塑剤として一般的に使用されています。"},{"sentence":"The plasticizer makes the plastic more flexible and durable.","translation":"可塑剤は、プラスチックをより柔軟で耐久性のあるものにします。"}],"collocations":["PVC plasticizer","phthalate plasticizer","add plasticizer","plasticizer migration"],"synonyms":["softener","flexibilizer","plasticity agent"],"antonyms":["hardener","stiffener"]}],"etymology":{"value":"'Plastic' + '-izer'. From the verb 'plasticize', meaning 'to make plastic'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈplæstɪsaɪzər/","syllables":"plas-ti-ci-zer"},"inflection":{"noun_plural":"plasticizers"},"usage_notes":{"explanation":"Plasticizers are additives that increase the plasticity or fluidity of a material. They are commonly used in the manufacture of plastics, especially PVC, to make them more flexible, durable, and easier to process. However, some plasticizers, such as phthalates, have raised health concerns due to their potential to leach out of the plastic and disrupt hormone function.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The plasticizer is a type of polymer.","correct":"✓ The plasticizer is an additive to a polymer.","note":"Plasticizers are additives, not polymers themselves. They are added to polymers to change their properties."},{"incorrect":"✗ Plasticizers are only used in food packaging.","correct":"✓ Plasticizers are used in a wide range of products, including food packaging, toys, and medical devices.","note":"Plasticizers are used in various applications, not just food packaging."}],"priority":"★★☆"},"related_words":{"derivatives":["plasticize (verb)","plasticization (noun)"],"phrases":["phthalate-free plasticizer","bio-based plasticizer"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Plasticizer' is a technical term used in chemistry and materials science. It refers to a substance added to a material, usually a plastic, to make it more flexible and less brittle. The concept is relatively complex and requires an understanding of polymer chemistry to fully grasp. It is not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The manufacturer added a new type of plasticizer to improve the product's flexibility.","translation":"製造業者は、製品の柔軟性を向上させるために、新しいタイプの可塑剤を添加しました。","type":"general","meaning_category":"general usage"},{"sentence":"The migration of plasticizers from food packaging into food is a major concern for food safety.","translation":"食品包装から食品への可塑剤の移行は、食品安全上の大きな懸念事項です。","type":"application","meaning_category":"application in food safety"},{"sentence":"Researchers are developing bio-based plasticizers as a sustainable alternative to traditional phthalates.","translation":"研究者たちは、従来のフタル酸エステルの持続可能な代替品として、バイオベースの可塑剤を開発しています。","type":"research","meaning_category":"research and development"}]}