{"word":"gonopod","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(節足動物、特に甲殻類や昆虫の雄に見られる)交接肢、生殖肢","english_definition":"A modified appendage of various arthropods used for copulation or egg-laying.","examples":[{"sentence":"The male mosquito uses his gonopods to transfer sperm to the female.","translation":"雄の蚊は、交接肢を使って精子を雌に渡します。"},{"sentence":"The gonopod morphology is an important characteristic for identifying different species of crayfish.","translation":"交接肢の形態は、ザリガニの異なる種を識別するための重要な特徴です。"}],"collocations":["male gonopod","modified gonopod","gonopod morphology","gonopod structure"],"synonyms":["copulatory appendage","reproductive appendage","clasper"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'gonos' (γονός) meaning 'offspring, seed' and 'pous' (πούς) meaning 'foot'.","priority":"★★☆"},"pronunciation":{"ipa":"ˈɡɒnəpɒd","syllables":"go-no-pod"},"inflection":{"noun_plural":"gonopods"},"usage_notes":{"explanation":"Gonopods are specialized appendages found in male arthropods, primarily crustaceans and insects. They are used to transfer sperm to the female during mating. The structure and morphology of gonopods can vary significantly between species and are often used as a key characteristic in taxonomic identification.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The female crab uses gonopods to carry eggs.","correct":"✓ The female crab uses pleopods to carry eggs.","note":"Gonopods are found only in males and are used for sperm transfer. Pleopods (swimmerets) are used by female crustaceans to carry eggs."}],"priority":"★☆☆"},"related_words":{"derivatives":["gonopodium (小さな交接肢)"],"related_terms":["pleopod (遊泳肢)","uropod (尾肢)","arthropod (節足動物)","crustacean (甲殻類)","insect (昆虫)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な生物学の文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'gonopod' refers to specialized appendages found in male arthropods, particularly crustaceans and insects, that are adapted for sperm transfer during mating. The morphology of gonopods is often species-specific and used in taxonomic identification. This term is primarily used in the context of zoology and entomology.","note":"This term is highly specialized and not commonly encountered outside of scientific literature."},"example_sentences":[{"sentence":"The presence and structure of the gonopod are crucial for identifying male shrimp species.","translation":"交接肢の存在と構造は、雄のエビの種類を特定するために非常に重要です。","type":"noun","meaning_category":"交接肢"},{"sentence":"Researchers studied the evolution of gonopod morphology in various crustacean lineages.","translation":"研究者たちは、さまざまな甲殻類の系統における交接肢の形態の進化を研究しました。","type":"noun","meaning_category":"交接肢"}]}