{"word":"manuma","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(ニューカレドニアの)カグー (鳥)","english_definition":"The cagou (Rhynochetos jubatus), a nearly flightless, ground-dwelling bird endemic to the dense mountain forests of New Caledonia.","examples":[{"sentence":"The manuma is the emblematic bird of New Caledonia.","translation":"マヌマはニューカレドニアの象徴的な鳥です。"},{"sentence":"Conservation efforts are underway to protect the manuma from extinction.","translation":"マヌマを絶滅から守るための保護活動が進行中です。"}],"collocations":["protect the manuma (マヌマを保護する)","manuma habitat (マヌマの生息地)","endangered manuma (絶滅危惧種のマヌマ)"],"synonyms":["cagou"],"antonyms":[]}],"etymology":{"value":"The word 'manuma' is a local name for the cagou in New Caledonia.","priority":"★★★"},"pronunciation":{"ipa":"/maˈnuːmə/","syllables":"ma-nu-ma"},"inflection":{"noun_plural":"manumas"},"usage_notes":{"explanation":"'Manuma' is specifically used to refer to the cagou bird, primarily within the context of New Caledonia or in ornithological discussions. It is less commonly used outside of these contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a manuma in my backyard in France.","correct":"✓ I saw a cagou in a zoo in France.","note":"Manuma are only found in New Caledonia, so seeing one in France is impossible unless it's in captivity."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Manuma' is a specialized term referring to a specific bird species found only in New Caledonia. Understanding this term requires familiarity with the region's fauna or ornithology. It is not a commonly used word outside of these contexts."},"example_sentences":[{"sentence":"The **manuma**'s distinctive call echoes through the New Caledonian forest.","translation":"マヌマの独特な鳴き声がニューカレドニアの森に響き渡る。","type":"noun","meaning_category":"カグー (鳥)"},{"sentence":"Protecting the **manuma** is crucial for maintaining the biodiversity of New Caledonia.","translation":"マヌマを保護することは、ニューカレドニアの生物多様性を維持するために不可欠である。","type":"noun","meaning_category":"カグー (鳥)"}]}