{"word":"seminarrative","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(言語学)半叙述。完全な物語の要素を一部しか持たないテキストまたは談話。出来事の連鎖はあるものの、完全な物語構造（例えば、明確な始まり、中間、終わり、またはクライマックス）を欠いているもの。","english_definition":"(linguistics) A text or discourse that possesses some, but not all, of the elements of a full narrative. It typically involves a sequence of events but lacks a complete narrative structure (e.g., a clear beginning, middle, and end, or a climax).","examples":[{"sentence":"The conversation consisted of seminarratives about daily routines, lacking any dramatic plot.","translation":"会話は日常のルーチンに関する半叙述で構成されており、劇的なプロットはなかった。"},{"sentence":"The news report presented a seminarrative of the accident, focusing on the sequence of events but without exploring the causes or consequences in depth.","translation":"ニュース報道は事故の半叙述を提示し、出来事の順序に焦点を当てていたが、原因や結果を深く掘り下げていなかった。"},{"sentence":"Her blog entries were often seminarratives, recounting events without a clear narrative arc.","translation":"彼女のブログのエントリーはしばしば半叙述であり、明確な物語の弧を描かずに出来事を語っていた。"}],"collocations":["consist of seminarratives","present a seminarrative","seminarrative of daily routines","seminarrative of the accident"],"synonyms":["anecdote","account","recounting of events","partial narrative"],"antonyms":["full narrative","complete narrative","story","novel"]}],"etymology":{"value":"'semi-' (半分) + 'narrative' (物語)。物語の一部の要素を持つものを示す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɛmiˈnærətɪv/","syllables":"se-mi-nar-ra-tive"},"inflection":{"noun_plural":"seminarratives"},"usage_notes":{"explanation":"'Seminarrative' は、言語学、特に談話分析や物語理論で使用される専門用語です。完全な物語の要件を満たさないテキストや談話を指します。物語の要素（出来事の連鎖など）は存在するものの、物語を物語たらしめる構造的な要素（明確な始まり、中間、終わり、クライマックス、教訓など）が欠けている場合に用いられます。日常会話、ニュース報道、ブログのエントリーなど、様々な文脈で見られます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The film was a seminarrative, with a clear plot and character development.","correct":"✓ The film was a full narrative, with a clear plot and character development.","note":"'Seminarrative' は、明確なプロットやキャラクターの発展など、完全な物語の要素を欠いている場合に用いられます。"},{"incorrect":"✗ He wrote a seminarrative novel.","correct":"✓ He wrote a novel. / ✓ He wrote a short story that could be considered a seminarrative.","note":"小説は通常、完全な物語構造を持っているため、'seminarrative novel' は矛盾した表現です。"}],"priority":"★★☆"},"related_words":{"derivatives":["narrative","narrativity","narratize"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Seminarrative' は、言語学や物語理論の分野で使用される特殊な用語です。完全な物語構造を持たないテキストや談話を指し、出来事の連鎖はあるものの、明確な始まり、中間、終わり、クライマックスなどの要素が欠けている場合に用いられます。この用語を理解するには、物語の基本的な要素に関する知識が必要です。日常会話ではあまり使われません。"},"example_sentences":[{"sentence":"The patient's description of their symptoms was more of a seminarrative than a coherent medical history.","translation":"患者の症状の説明は、一貫した病歴というよりは半叙述のようだった。","type":"noun","meaning_category":"言語学"},{"sentence":"Many social media posts can be categorized as seminarratives, lacking the depth and structure of traditional storytelling.","translation":"多くのソーシャルメディアの投稿は、伝統的な物語の深さと構造を欠いており、半叙述として分類できる。","type":"noun","meaning_category":"言語学"},{"sentence":"The ethnographer collected numerous seminarratives during her fieldwork, which she later analyzed for recurring themes.","translation":"民族誌学者はフィールドワーク中に多数の半叙述を収集し、後に繰り返されるテーマについて分析した。","type":"noun","meaning_category":"言語学"}]}