{"word":"dewcap","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(天文学)露除け筒","english_definition":"A cylindrical shield attached to the front of a telescope to prevent dew from forming on the lens or objective.","examples":[{"sentence":"The dewcap is an essential accessory for astrophotography in humid environments.","translation":"露除け筒は、湿度の高い環境での天体写真撮影に不可欠なアクセサリーです。"},{"sentence":"Without a dewcap, the telescope's view can quickly become obscured by condensation.","translation":"露除け筒がないと、望遠鏡の視界はすぐに結露によって遮られてしまいます。"}],"collocations":["telescope dewcap","dewcap heater","install a dewcap"],"synonyms":["dew shield"],"antonyms":[]},{"part_of_speech":"noun","definition":"(菌類)ヒナノヒガサ属のキノコ","english_definition":"Any mushroom of the genus *Cystoderma*.","examples":[{"sentence":"The dewcap is a small, orange-brown mushroom often found in coniferous forests.","translation":"ヒナノヒガサ属のキノコは、針葉樹林でよく見られる小型のオレンジがかった茶色のキノコです。"},{"sentence":"Some species of dewcap are edible, while others are poisonous.","translation":"ヒナノヒガサ属のキノコの中には食用になるものもあれば、有毒なものもあります。"}],"collocations":["edible dewcap","poisonous dewcap","Cystoderma amianthinum"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From 'dew' + 'cap'. The astronomical sense refers to the cap-like shape of the shield and its function in preventing dew. The mycological sense refers to the cap-like shape of the mushroom.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdjuːˌkæp/","syllables":"dew-cap"},"inflection":{"noun_plural":"dewcaps"},"usage_notes":{"explanation":"The term 'dewcap' has two distinct meanings: one in astronomy and one in mycology (the study of fungi). The astronomical dewcap is a practical accessory, while the mycological dewcap refers to a specific group of mushrooms.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a dewcap in the sky.","correct":"✓ I saw a nebula in the sky. / ✓ I saw a dewcap on the telescope.","note":"'Dewcap' in the astronomical sense is an accessory attached to a telescope, not something seen in the sky itself. Nebulae, planets, and stars are objects seen in the sky. If the user meant the telescope accessory, it should be clarified that it was on the telescope."},{"incorrect":"✗ I ate a dewcap and got sick.","correct":"✓ I ate a mushroom and got sick. / ✓ I ate a poisonous mushroom and got sick.","note":"Not all mushrooms are safe to eat. If someone got sick after eating a mushroom, it's important to specify that it was a mushroom in general, or a poisonous mushroom, rather than assuming all 'dewcaps' are edible."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["telescope","mushroom","fungi","Cystoderma"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dewcap' is a relatively uncommon word with two specialized meanings. One refers to a shield used on telescopes to prevent dew formation, and the other refers to a genus of mushrooms. Understanding the context is crucial to interpreting the intended meaning. Due to its specialized nature, it is not typically encountered in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"He attached the **dewcap** to his telescope before starting his night of stargazing.","translation":"彼は夜の星空観察を始める前に、望遠鏡に露除け筒を取り付けた。","type":"noun","meaning_category":"astronomy"},{"sentence":"The field guide identified the mushroom as a **dewcap** of the genus *Cystoderma*.","translation":"そのフィールドガイドは、そのキノコをヒナノヒガサ属のキノコであると特定した。","type":"noun","meaning_category":"mycology"}]}