{"word":"Keratoscopy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"角膜形状検査（かくまくけいじょうけんさ）","english_definition":"A diagnostic technique for examining the shape and condition of the cornea.","examples":[{"sentence":"Keratoscopy is used to detect irregularities in the corneal surface.","translation":"角膜形状検査は、角膜表面の不規則性を検出するために使用されます。"},{"sentence":"The doctor performed a keratoscopy to assess the patient's astigmatism.","translation":"医師は患者の乱視を評価するために角膜形状検査を実施しました。"}],"collocations":["perform keratoscopy","undergo keratoscopy","corneal keratoscopy"],"synonyms":["videokeratography","corneal topography"],"antonyms":[]}],"etymology":{"value":"The term 'keratoscopy' is derived from the Greek words 'kerato' (meaning cornea) and 'scopy' (meaning examination or viewing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɛrəˈtɒskəpi/","syllables":"ke-ra-tos-co-py"},"inflection":{"noun_plural":"keratoscopies"},"usage_notes":{"explanation":"Keratoscopy is a non-invasive diagnostic procedure used in ophthalmology to evaluate the curvature and topography of the cornea. It helps in identifying corneal abnormalities such as astigmatism, keratoconus, and other irregularities. The procedure involves projecting a series of concentric rings onto the cornea and analyzing the reflected image to create a detailed map of the corneal surface.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Keratoscopy is a treatment for astigmatism.","correct":"✓ Keratoscopy is a diagnostic tool for assessing astigmatism.","note":"Keratoscopy is a diagnostic procedure, not a treatment. It helps in identifying and assessing conditions like astigmatism."},{"incorrect":"✗ The patient had a keratoscopy done on their retina.","correct":"✓ The patient had a keratoscopy done on their cornea.","note":"Keratoscopy specifically examines the cornea, not the retina."}],"priority":"★★☆"},"related_words":{"derivatives":["keratoscope (角膜鏡)","keratoscopic (角膜鏡の)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Keratoscopy is a specialized medical term referring to a diagnostic procedure used to examine the cornea. It is primarily used by ophthalmologists and eye care professionals to assess corneal shape and identify any irregularities. Understanding this term requires a background in medical terminology and an understanding of ophthalmological procedures.","priority":"★★☆"},"example_sentences":[{"sentence":"The ophthalmologist used keratoscopy to diagnose the patient's keratoconus.","translation":"眼科医は角膜形状検査を用いて患者の円錐角膜を診断しました。","type":"general","meaning_category":"diagnosis"},{"sentence":"Keratoscopy provides a detailed map of the corneal surface.","translation":"角膜形状検査は角膜表面の詳細な地図を提供します。","type":"general","meaning_category":"procedure"},{"sentence":"Regular keratoscopy exams can help monitor the progression of corneal diseases.","translation":"定期的な角膜形状検査は角膜疾患の進行を監視するのに役立ちます。","type":"general","meaning_category":"monitoring"}]}