{"word":"scandalization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"中傷、名誉毀損、醜聞化","english_definition":"The action of scandalizing; the state of being scandalized. The act of treating something as scandalous, or causing scandal.","examples":[{"sentence":"The scandalization of the politician led to his resignation.","translation":"その政治家の中傷は、彼の辞任につながった。"},{"sentence":"The media's scandalization of the event created public outrage.","translation":"メディアによるその出来事の醜聞化は、大衆の怒りを引き起こした。"}],"collocations":["media scandalization","public scandalization"],"synonyms":["defamation","vilification","libel","slander","disgrace","dishonor"],"antonyms":["praise","honor","respect"]}],"etymology":{"value":"From 'scandalize' + '-ation'. 'Scandalize' comes from the Greek 'skandalon', meaning 'stumbling block' or 'cause of offense'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌskændəlaɪˈzeɪʃən/","syllables":"scan-da-li-za-tion"},"inflection":{"noun_plural":"scandalizations"},"usage_notes":{"explanation":"'Scandalization' refers to the process or act of causing scandal or treating something as scandalous. It often involves publicizing or exaggerating negative aspects of a situation or person to create outrage or condemnation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The scandalization was happened by the news.","correct":"✓ The scandalization was caused by the news.","note":"'Scandalization' is a noun and usually requires a verb like 'cause' or 'result in' to form a complete sentence."}],"priority":"★★☆"},"related_words":{"derivatives":["scandalize (verb)","scandalous (adjective)","scandal (noun)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Scandalization' is a relatively uncommon word that describes the act of causing a scandal or treating something as scandalous. It is often used in contexts involving media, politics, or public figures where negative information is exaggerated or publicized to create outrage or condemnation."},"example_sentences":[{"sentence":"The author accused the newspaper of scandalization for publishing false information about his personal life.","translation":"著者は、自身の私生活に関する虚偽の情報を掲載したとして、その新聞社を中傷で訴えた。","type":"noun","meaning_category":"中傷"},{"sentence":"The politician's supporters condemned the scandalization of his remarks, claiming they were taken out of context.","translation":"その政治家の支持者たちは、彼の発言の醜聞化を非難し、文脈から切り離されていると主張した。","type":"noun","meaning_category":"醜聞化"}]}