{"word":"coplotter","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"共謀者、陰謀仲間","english_definition":"A person who plots or conspires with others.","examples":[{"sentence":"He was named as a coplotter in the assassination attempt.","translation":"彼は暗殺未遂事件の共謀者として名前が挙げられた。"},{"sentence":"The police identified several coplotters involved in the bank robbery.","translation":"警察は銀行強盗に関与した複数の共謀者を特定した。"}],"collocations":["a fellow coplotter","identify coplotters","coplotter in a crime"],"synonyms":["conspirator","accomplice","collaborator","schemer"],"antonyms":["victim","opponent"]}],"etymology":{"value":"The word \"coplotter\" is formed by combining the prefix \"co-\" (meaning \"together\" or \"jointly\") with the word \"plotter\" (someone who makes plots or schemes).","priority":"★★★"},"pronunciation":{"ipa":"/koʊˈplɒtər/","syllables":"co-plot-ter"},"inflection":{"noun_plural":"coplotters"},"usage_notes":{"explanation":"\"Coplotter\" is a relatively formal term, often used in legal or journalistic contexts to describe someone who is involved in a conspiracy or plot. It implies a shared responsibility for the planning and execution of a scheme, typically one that is illegal or harmful.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a coplotter of the victim.","correct":"✓ He was a coplotter with the victim's murderer.","note":"A coplotter is someone who schemes *with* others, not *of* others. The preposition 'with' is crucial to indicate the collaborative nature of the plotting."}],"priority":"★☆☆"},"related_words":{"derivatives":["plot","plotter","plotting","conspiracy","conspirator","conspire"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"coplotter\" is a formal term that refers to someone who is involved in a secret plan or agreement to do something illegal or harmful. It is often used in legal or political contexts. Understanding the word requires knowledge of the base word \"plotter\" and the prefix \"co-\", which indicates joint involvement. The word is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The indictment named three other individuals as coplotters in the fraud scheme.","translation":"起訴状には、詐欺計画の共謀者として他に3人の個人が名前を挙げられていた。","type":"noun","meaning_category":"共謀者"},{"sentence":"The investigation revealed a network of coplotters working together to undermine the government.","translation":"捜査により、政府を弱体化させるために協力して活動している共謀者のネットワークが明らかになった。","type":"noun","meaning_category":"共謀者"}]}