{"word":"Buprestid","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"タマムシ科の甲虫","english_definition":"A beetle of the family Buprestidae, characterized by their metallic colors and elongated shape.","examples":[{"sentence":"The emerald ash borer is a destructive buprestid beetle.","translation":"エメラルドアッシュボアは破壊的なタマムシ科の甲虫です。"},{"sentence":"Buprestids are often found on or near trees.","translation":"タマムシ科の甲虫は、木の上や近くでよく見られます。"}],"collocations":["emerald ash borer","metallic buprestid","wood-boring buprestid"],"synonyms":["jewel beetle","metallic wood-boring beetle"],"antonyms":[]}],"etymology":{"value":"The term \"Buprestidae\" comes from the Greek words \"bous\" (ox) and \"pretho\" (to burn), referring to the belief that these beetles could kill cattle if swallowed.","priority":"★★☆"},"pronunciation":{"ipa":"/bjuːˈprɛstɪd/","syllables":"bu-pres-tid"},"inflection":{"noun_plural":"Buprestids"},"usage_notes":{"explanation":"\"Buprestid\" refers to any beetle belonging to the family Buprestidae. These beetles are known for their bright, metallic colors and are often called jewel beetles. They are typically found on trees, and some species are considered pests due to their wood-boring habits.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a buprestidae on the tree.","correct":"✓ I saw a buprestid on the tree.","note":"\"Buprestidae\" is the family name, while \"buprestid\" is the singular noun referring to one beetle."}],"priority":"★☆☆"},"related_words":{"derivatives":["Buprestidae (family name)"],"phrases":["metallic wood-boring beetle","jewel beetle"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Buprestid' is a specialized term referring to beetles in the Buprestidae family, often called jewel beetles due to their metallic appearance. It is a term primarily used in entomology or when discussing specific types of beetles in a scientific context. General audiences may not be familiar with this term."},"example_sentences":[{"sentence":"The collector displayed a variety of colorful buprestid specimens.","translation":"収集家は様々な色彩豊かなタマムシ科の標本を展示しました。","type":"noun","meaning_category":"甲虫"},{"sentence":"Many buprestid larvae are wood-borers, causing damage to trees.","translation":"多くのタマムシ科の幼虫は木を穿孔し、木に損傷を与えます。","type":"noun","meaning_category":"甲虫"}]}