{"word":"utriculosaccular","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(解剖学) 卵形嚢と球形嚢の、またはそれらに関係する","english_definition":"(anatomy) Relating to, or involving, both the utricle and the saccule of the inner ear.","examples":[{"sentence":"The utriculosaccular maculae are responsible for detecting linear acceleration and head tilt.","translation":"卵形嚢と球形嚢の斑は、直線加速度と頭部の傾きを検出する役割を担っています。"}],"collocations":["utriculosaccular function","utriculosaccular macula","utriculosaccular system"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the combination of 'utriculo-' (referring to the utricle) and 'saccular' (referring to the saccule). The utricle and saccule are two otolith organs in the vertebrate inner ear.","priority":"★★★"},"pronunciation":{"ipa":"/juːˌtrɪkjʊloʊˈsæk.jʊlər/","syllables":"u-tric-u-lo-sac-cu-lar"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"This term is highly specific to anatomy and physiology, particularly in the context of the inner ear and balance. It is used to describe structures, functions, or conditions that involve both the utricle and saccule, which are essential for sensing linear acceleration and gravity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ utriculosacular","correct":"✓ utriculosaccular","note":"The correct spelling includes two 'c's: 'utriculosaccular'."}],"priority":"★★★"},"related_words":{"derivatives":["utricle","saccule"],"related_terms":["otolith","macula","vestibular system"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency. This is a highly specialized term.","priority":"★★★"},"readability_explanation":{"level":"C2","text":"The term 'utriculosaccular' is a highly specialized anatomical term used in the fields of medicine, biology, and audiology. It refers to structures or functions that involve both the utricle and saccule, which are components of the inner ear responsible for balance and spatial orientation. Understanding this term requires advanced knowledge of anatomy and physiology."},"example_sentences":[{"sentence":"Utriculosaccular dysfunction can lead to balance disorders.","translation":"卵形嚢と球形嚢の機能不全は、平衡障害を引き起こす可能性があります。","type":"general","meaning_category":"medical"},{"sentence":"The study investigated the effects of aging on utriculosaccular sensitivity.","translation":"その研究では、加齢が卵形嚢と球形嚢の感受性に及ぼす影響を調査しました。","type":"research","meaning_category":"scientific"}]}