{"word":"triptans","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"トリプタン系薬剤：片頭痛の治療に用いられる薬のクラス","english_definition":"A class of drugs used to treat migraine headaches. They work by constricting blood vessels in the brain.","examples":[{"sentence":"My doctor prescribed triptans for my migraines.","translation":"私の医者は片頭痛のためにトリプタン系薬剤を処方しました。"},{"sentence":"Triptans are most effective when taken at the first sign of a migraine.","translation":"トリプタン系薬剤は、片頭痛の最初の兆候が現れたときに服用するのが最も効果的です。"}],"collocations":["take triptans","triptan medication","triptan side effects","triptan drugs"],"synonyms":["5-HT receptor agonists"],"antonyms":[]}],"etymology":{"value":"Derived from 'tryptamine', a monoamine alkaloid. The name reflects the structural similarity of these drugs to tryptamine.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtrɪptænz/","syllables":"trip-tans"},"inflection":{"noun_plural":"triptans"},"usage_notes":{"explanation":"'Triptans' specifically refers to a class of medications, not a single drug. It is almost exclusively used in the context of migraine treatment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I took a triptan for my headache.","correct":"✓ I took a triptan medication for my headache. / ✓ I took a triptan for my migraine.","note":"While understandable, it's more precise to specify 'triptan medication' or to indicate the headache is a migraine."}],"priority":"★★☆"},"related_words":{"derivatives":["sumatriptan","rizatriptan","eletriptan","zolmitriptan","naratriptan","frovatriptan","almotriptan"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily found in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Triptans' is a technical term used in the context of medicine, specifically related to the treatment of migraines. Understanding this word requires some familiarity with medical terminology. It is not commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"She relies on triptans to manage her chronic migraines.","translation":"彼女は慢性的な片頭痛を管理するためにトリプタン系薬剤に頼っています。","type":"noun","meaning_category":"medication"},{"sentence":"The doctor warned him about the potential side effects of triptans.","translation":"医師は彼にトリプタン系薬剤の潜在的な副作用について警告しました。","type":"noun","meaning_category":"medication"}]}