{"word":"Hubing","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(informal, Internet slang) A term used to describe the act of excessively using or being addicted to online platforms or social media hubs.","english_definition":"The act of excessively using or being addicted to online platforms or social media hubs.","examples":[{"sentence":"His constant hubing was affecting his real-life relationships.","translation":"彼の絶え間ないオンラインプラットフォーム中毒は、現実の人間関係に影響を与えていた。"},{"sentence":"She needed to cut back on her hubing to focus on her studies.","translation":"彼女は勉強に集中するために、オンラインプラットフォーム中毒を減らす必要があった。"}],"collocations":["social media hubing","online hubing","excessive hubing","constant hubing"],"synonyms":["scrolling","doomscrolling","online addiction","social media addiction"],"antonyms":["digital detox","offline activity","real-life engagement"]}],"etymology":{"value":"A neologism derived from the word 'hub,' referring to a central point or platform, combined with the '-ing' suffix to denote an ongoing activity.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈhʌbɪŋ/","syllables":"Hub-ing"},"inflection":{"noun_plural":"Hubings"},"usage_notes":{"explanation":"'Hubing' is an informal term, primarily used in online contexts, to describe the excessive or addictive use of online platforms or social media hubs. It often carries a negative connotation, implying that the individual is neglecting real-life responsibilities or relationships due to their online activity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I enjoy hubing with my friends.","correct":"✓ I enjoy connecting with my friends online.","note":"'Hubing' generally refers to excessive or addictive use, not casual enjoyment. Use more neutral terms like 'connecting online' for casual use."},{"incorrect":"✗ He is a hubing person.","correct":"✓ He is a huber. / ✓ He is addicted to online hubs.","note":"To describe a person, use 'huber' (though uncommon) or phrases like 'addicted to online hubs' rather than 'hubing person'."}],"priority":"★☆☆"},"related_words":{"derivatives":["huber (noun, a person who engages in hubing)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (slang, not typically included in CEFR)","frequency_google_ngram":"Very low frequency (neologism)","priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"'Hubing' is a relatively new and informal term used to describe the act of excessively using online platforms or social media hubs. It is often used critically to suggest that someone is spending too much time online, to the detriment of their real-life activities. The term is not widely recognized and is primarily used in online communities.","priority":"★☆☆"},"example_sentences":[{"sentence":"She realized her constant hubing was making her feel more isolated.","translation":"彼女は、絶え間ないオンラインプラットフォーム中毒が、自分をより孤立させていることに気づいた。","type":"noun","meaning_category":"Excessive online use"},{"sentence":"The article discussed the negative effects of hubing on mental health.","translation":"その記事は、オンラインプラットフォーム中毒が精神衛生に与える悪影響について論じた。","type":"noun","meaning_category":"Excessive online use"}]}