{"word":"pre-engagement","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"婚約前、婚約準備期間","english_definition":"The period before a formal engagement, often involving discussions and considerations about a potential marriage.","examples":[{"sentence":"Their pre-engagement period was filled with thoughtful conversations about their future.","translation":"彼らの婚約前の期間は、将来についての思慮深い会話で満たされていました。"},{"sentence":"She wanted to take things slow during the pre-engagement phase.","translation":"彼女は婚約前の段階でゆっくりと物事を進めたかった。"},{"sentence":"Many couples use pre-engagement counseling to ensure they are compatible.","translation":"多くのカップルは、相性を確認するために婚約前のカウンセリングを利用します。"}],"collocations":["pre-engagement counseling","pre-engagement ring","pre-engagement discussions","pre-engagement period","navigate the pre-engagement phase"],"synonyms":["courtship","dating period","pre-commitment phase"],"antonyms":["engagement","marriage"]},{"part_of_speech":"adjective","definition":"婚約前の","english_definition":"Relating to the period before a formal engagement.","examples":[{"sentence":"The pre-engagement discussions were crucial for their relationship.","translation":"婚約前の話し合いは彼らの関係にとって非常に重要でした。"},{"sentence":"She received a pre-engagement ring as a promise of future commitment.","translation":"彼女は将来の約束として婚約前の指輪を受け取りました。"}],"collocations":["pre-engagement ring","pre-engagement discussions","pre-engagement phase","pre-engagement period"],"synonyms":["pre-commitment","pre-proposal"],"antonyms":["engaged","married"]}],"etymology":{"value":"Formed by adding the prefix \"pre-\" (meaning before) to the noun \"engagement.\"","priority":"★★★"},"pronunciation":{"ipa":"/ˌpriːɪnˈɡeɪdʒmənt/","syllables":"pre-en-gage-ment"},"inflection":{"noun_plural":"pre-engagements"},"usage_notes":{"explanation":"\"Pre-engagement\" refers to the time before a couple officially gets engaged. It's a period where they might be seriously dating and considering marriage, but haven't yet made a formal commitment. It's often a time for deep conversations about values, goals, and expectations for the future. A \"pre-engagement ring\" is sometimes given as a promise of a future proposal.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is pre-engaged.","correct":"✓ She is in the pre-engagement phase.","note":"Using \"pre-engaged\" as an adjective to describe a person is less common. It's better to say they are \"in the pre-engagement phase\" or \"considering engagement.\""},{"incorrect":"✗ The preengagement was long.","correct":"✓ The pre-engagement period was long.","note":"Adding \"period\" clarifies that you are referring to the time before the engagement."}],"priority":"★★☆"},"related_words":{"derivatives":["engagement","pre-marital","courtship","dating"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"pre-engagement\" describes the period before a couple becomes officially engaged. It is a time when they are seriously considering marriage but have not yet made a formal proposal. This term is often used in discussions about relationships and marriage preparation. Understanding this term can help in conversations about relationship stages and commitment.","priority":"★★★"},"example_sentences":[{"sentence":"During their pre-engagement, they discussed their finances and future goals.","translation":"婚約前に、彼らは財政状況と将来の目標について話し合った。","type":"noun","meaning_category":"婚約前の期間"},{"sentence":"She wore a pre-engagement ring as a symbol of their commitment to each other.","translation":"彼女は、お互いへのコミットメントの象徴として婚約前の指輪を身に着けていた。","type":"adjective","meaning_category":"婚約前の"},{"sentence":"The pre-engagement phase is a crucial time for couples to assess their compatibility.","translation":"婚約前の段階は、カップルが相性を評価するための重要な時期です。","type":"noun","meaning_category":"婚約前の期間"},{"sentence":"Pre-engagement counseling can help couples navigate potential challenges in their relationship.","translation":"婚約前のカウンセリングは、カップルが関係における潜在的な課題を乗り越えるのに役立ちます。","type":"adjective","meaning_category":"婚約前の"}]}