{"word":"earcap","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A protective covering for the ear.","english_definition":"A covering, usually made of soft material, worn over the ear for protection from noise, cold, or water.","examples":[{"sentence":"He wore earcaps to protect his ears from the cold wind.","translation":"彼は冷たい風から耳を守るためにイヤーキャップを着用した。"},{"sentence":"Swimmers often use earcaps to prevent water from entering their ears.","translation":"水泳選手は、水が耳に入るのを防ぐためによくイヤーキャップを使用する。"}],"collocations":["wear earcaps","silicone earcap","neoprene earcap"],"synonyms":["earplug","earmuff"],"antonyms":[]}],"etymology":{"value":"The word 'earcap' is a compound word formed from 'ear' (the organ of hearing) and 'cap' (a covering for the head or other body part).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɪərˌkæp/","syllables":"ear-cap"},"inflection":{"noun_plural":"earcaps"},"usage_notes":{"explanation":"An 'earcap' is typically a small, close-fitting covering designed to protect the ear. It can be made of various materials, such as silicone, neoprene, or fabric, depending on its intended use. It differs from 'earmuffs' which are larger and cover the entire ear, primarily for warmth.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I need a new earcup for swimming.","correct":"✓ I need a new earcap for swimming.","note":"'Earcup' might be confused with 'earcap', but 'earcap' is the correct term for a swimming ear covering."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"The word 'earcap' is a relatively uncommon term. It refers to a small covering worn over the ear for protection, typically from water or cold. It is less common than terms like 'earplugs' or 'earmuffs'. Understanding the context in which it is used is important, as it is a specific type of ear protection.","priority":"★★☆"},"example_sentences":[{"sentence":"The diver put on his earcap before entering the water.","translation":"ダイバーは水に入る前にイヤーキャップをつけた。","type":"noun","meaning_category":"protective covering"},{"sentence":"She knitted a pair of wool earcap for her grandchildren.","translation":"彼女は孫たちのためにウールのイヤーキャップを編んだ。","type":"noun","meaning_category":"protective covering"}]}