{"word":"deteriority","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"悪化、低下、劣化","english_definition":"The state or process of becoming worse; decline; degradation.","examples":[{"sentence":"The deteriority of his health was a cause for concern.","translation":"彼の健康状態の悪化は懸念の原因だった。"},{"sentence":"We observed the deteriority in the quality of the product.","translation":"私たちは製品の品質の低下を観察した。"}],"collocations":["health deteriority (健康状態の悪化)","quality deteriority (品質の低下)","environmental deteriority (環境の悪化)"],"synonyms":["decline","degradation","worsening","decay","degeneration"],"antonyms":["improvement","amelioration","enhancement"]}],"etymology":{"value":"Derived from 'deteriorate' + '-ity'. 'Deteriorate' comes from Late Latin 'deterioratus', past participle of 'deteriorare' meaning 'to make worse'. The suffix '-ity' is used to form nouns expressing condition or quality.","priority":"★☆☆"},"pronunciation":{"ipa":"/dɪˌtɪəriˈɒrɪti/","syllables":"de-te-ri-o-ri-ty"},"inflection":{"noun_plural":"deteriorities"},"usage_notes":{"explanation":"'Deteriority' is a noun that describes the process or state of something becoming worse or declining in quality, condition, or value. It is often used in formal or technical contexts. While 'deterioration' is more commonly used, 'deteriority' emphasizes the quality or state of being deteriorated.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The deteriority was improved.","correct":"✓ The deteriority was reversed. / ✓ The deterioration was improved.","note":"'Deteriority' describes a negative state, so it cannot be improved directly. You can reverse or halt the deteriority. 'Deterioration' is also a more common and natural choice in this context."},{"incorrect":"✗ The deteriority of the building was very obvious.","correct":"✓ The deterioration of the building was very obvious.","note":"'Deterioration' is the more commonly used term to describe the process of something becoming worse. While 'deteriority' is a valid word, 'deterioration' is often preferred for its familiarity."}],"priority":"★☆☆"},"related_words":{"derivatives":["deteriorate (verb)","deterioration (noun)","deteriorative (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Deteriority' is a relatively uncommon noun that refers to the state or process of something becoming worse. It is often used in formal or technical contexts to describe a decline in quality, condition, or value. While 'deterioration' is more frequently used, 'deteriority' emphasizes the state of being deteriorated. This word is suitable for advanced learners who need to understand and use precise vocabulary in specific contexts."},"example_sentences":[{"sentence":"The deteriority of the historical artifacts was a major concern for the museum curators.","translation":"その歴史的工芸品の劣化は、美術館の学芸員にとって大きな懸念事項であった。","type":"noun","meaning_category":"悪化"},{"sentence":"The deteriority in air quality has led to increased respiratory problems among the city's residents.","translation":"大気質の悪化は、都市住民の間で呼吸器系の問題の増加につながっている。","type":"noun","meaning_category":"低下"},{"sentence":"The deteriority of the relationship between the two countries was evident in their increasingly hostile rhetoric.","translation":"両国間の関係の悪化は、彼らのますます敵対的なレトリックに明らかだった。","type":"noun","meaning_category":"劣化"}]}