{"word":"disease-focused","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"疾患に焦点を当てた、疾患中心の","english_definition":"Concentrating primarily on diseases, their causes, and treatments, often to the exclusion of other factors such as overall health and well-being.","examples":[{"sentence":"The research was disease-focused, investigating the genetic causes of cancer.","translation":"その研究は疾患中心で、癌の遺伝的原因を調査していた。"},{"sentence":"A disease-focused approach to medicine can sometimes overlook the importance of preventative care.","translation":"疾患中心の医療へのアプローチは、予防ケアの重要性を見落とすことがある。"},{"sentence":"The conference featured many disease-focused presentations on the latest treatments.","translation":"その会議では、最新の治療法に関する多くの疾患中心のプレゼンテーションが行われた。"}],"collocations":["disease-focused research (疾患中心の研究)","disease-focused approach (疾患中心のアプローチ)","disease-focused treatment (疾患中心の治療)","disease-focused strategy (疾患中心の戦略)","disease-focused intervention (疾患中心の介入)"],"synonyms":["illness-centered","pathology-oriented","condition-specific","symptom-based"],"antonyms":["health-focused","wellness-oriented","prevention-focused","holistic","patient-centered"]}],"etymology":{"value":"The term is a compound adjective formed by combining 'disease' and 'focused'.","priority":"N/A"},"pronunciation":{"ipa":"/dɪˈziːz ˈfoʊkəst/","syllables":"di-sease-fo-cused"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than to form comparative and superlative forms (which are less common for compound adjectives like this)."},"usage_notes":{"explanation":"'Disease-focused' describes something that prioritizes the study, treatment, or management of specific diseases. It often implies a narrower scope compared to approaches that consider broader aspects of health. It can sometimes carry a slightly critical connotation, suggesting that other important factors are being neglected.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The program was very disease focused.","correct":"✓ The program was very disease-focused.","note":"Hyphenation is important to correctly form the compound adjective. Without the hyphen, it may be interpreted as 'the program was focused on the disease' rather than 'the program had a disease-focused approach'."}],"priority":"N/A"},"related_words":{"derivatives":["focus (noun, verb)","focused (adjective)","disease (noun)"],"phrases":["disease management","disease prevention","disease control"]},"level_frequency":{"CEFR":"C1-C2","frequency_google_ngram":"Relatively low frequency, used primarily in academic and professional contexts.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'disease-focused' is a compound adjective used to describe approaches, research, or strategies that primarily concentrate on diseases and their treatment. It is often used in medical, scientific, and public health contexts. The term implies a specific emphasis on the pathology and symptoms of diseases, sometimes in contrast to more holistic or preventative approaches that consider overall health and well-being. Understanding the term requires familiarity with medical and scientific terminology."},"example_sentences":[{"sentence":"The hospital's new initiative is disease-focused, targeting specific conditions like diabetes and heart disease.","translation":"その病院の新しい取り組みは疾患中心で、糖尿病や心臓病などの特定の疾患を対象としている。","type":"general","meaning_category":"general"},{"sentence":"Critics argue that a solely disease-focused approach to healthcare can lead to fragmented care and neglect of underlying health issues.","translation":"批評家たちは、医療への単に疾患中心のアプローチは、ケアの断片化と根本的な健康問題の無視につながる可能性があると主張している。","type":"critical","meaning_category":"critical"},{"sentence":"Disease-focused funding often overshadows research into preventative measures.","translation":"疾患中心の資金提供は、予防策の研究をしばしば覆い隠してしまう。","type":"funding","meaning_category":"funding"}]}