{"word":"Shotgunning","priority":"★★☆","meanings":[{"part_of_speech":"verb","definition":"(俗語)ショットガン飲みをする","english_definition":"(slang) To rapidly consume a beverage, typically beer or soda, by puncturing a hole in the side of the can, placing the hole near one's mouth, and opening the top to allow the liquid to flow quickly.","examples":[{"sentence":"They were shotgunning beers at the tailgate party.","translation":"彼らはテールゲートパーティーでショットガン飲みをしていた。"},{"sentence":"He's known for being able to shotgun a beer faster than anyone else.","translation":"彼は誰よりも早くビールをショットガン飲みできることで知られている。"}],"collocations":["shotgun a beer","shotgun a can","shotgun a drink"],"synonyms":["chugging","downing","guzzling"],"antonyms":["sipping","nursing (a drink)"]},{"part_of_speech":"noun","definition":"(俗語)ショットガン飲み","english_definition":"(slang) The act of rapidly consuming a beverage by puncturing a hole in the side of the can, placing the hole near one's mouth, and opening the top to allow the liquid to flow quickly.","examples":[{"sentence":"Shotgunning is a popular activity at college parties.","translation":"ショットガン飲みは大学のパーティーで人気のあるアクティビティだ。"},{"sentence":"He won the shotgunning contest.","translation":"彼はショットガン飲みコンテストで優勝した。"}],"collocations":["do a shotgunning","win a shotgunning contest"],"synonyms":["chugging","guzzling"],"antonyms":[]}],"etymology":{"value":"Derived from the act of creating a hole in a can similar to the barrel of a shotgun, allowing for rapid consumption of the beverage.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʃɒtɡʌnɪŋ/","syllables":"shot-gun-ning"},"inflection":{"verb_forms":{"present_simple":["shotgunning"],"past_simple":"shotgunned","past_participle":"shotgunned","present_participle":"shotgunning"},"noun_plural":[]},"usage_notes":{"explanation":"'Shotgunning' is primarily a slang term referring to a specific method of rapidly consuming a canned beverage, usually beer. It's often associated with parties, college culture, and competitive drinking. The term can function as both a verb (to shotgun) and a noun (the act of shotgunning).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He shotgunning the water.","correct":"✓ He shotgunned the water.","note":"When used as a verb in the past tense, it should be 'shotgunned'."},{"incorrect":"✗ Shotgunning is very health.","correct":"✓ Shotgunning is very unhealthy.","note":"Shotgunning is generally considered an unhealthy practice due to the rapid consumption of alcohol or sugary drinks."}],"priority":"★★☆"},"related_words":{"derivatives":["shotgun (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Not applicable (slang)","frequency_google_ngram":"Low frequency (slang)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Shotgunning' is a slang term primarily used within specific subcultures, particularly those involving college students and parties. It refers to the act of quickly drinking a beverage from a can by puncturing a hole in the side. While the term is easily understood within these contexts, it's not part of standard English and may not be recognized by all speakers. The term carries connotations of youthful recklessness and excessive alcohol consumption."},"example_sentences":[{"sentence":"The crowd cheered as he started shotgunning the beer.","translation":"彼がビールをショットガン飲みし始めると、群衆は歓声を上げた。","type":"verb","meaning_category":"Drinking"},{"sentence":"Shotgunning is often discouraged due to its potential health risks.","translation":"ショットガン飲みは健康上のリスクがあるため、しばしば推奨されない。","type":"noun","meaning_category":"Drinking"}]}