{"word":"ripararsi","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vi","definition":"身を隠す、避難する、雨宿りする","english_definition":"to take shelter, to find refuge, to protect oneself from the elements (rain, wind, sun, etc.) or danger.","examples":[{"sentence":"I soldati si ripararono dietro il muro.","translation":"兵士たちは壁の後ろに身を隠した。"}],"collocations":["ripararsi dalla pioggia (雨宿りする)","ripararsi dal sole (日差しを避ける)","ripararsi dal vento (風を避ける)","ripararsi in un rifugio (避難所に避難する)","ripararsi dietro qualcosa (何かの後ろに身を隠す)"],"synonyms":["proteggersi","rifugiarsi","nascondersi","mettersi al riparo","trovare riparo"],"antonyms":["esporsi","scoprirsi","rischiare"]},{"part_of_speech":"verb","transitivity":"vr","definition":"(再帰動詞) 身を隠す、避難する、雨宿りする","english_definition":"(reflexive verb) to take shelter, to find refuge, to protect oneself from the elements (rain, wind, sun, etc.) or danger. This is the reflexive form of the verb.","examples":[{"sentence":"Dobbiamo ripararci prima che inizi a piovere forte.","translation":"雨が強くなる前に避難しなければならない。"}],"collocations":["ripararsi dalla pioggia (雨宿りする)","ripararsi dal sole (日差しを避ける)","ripararsi dal vento (風を避ける)","ripararsi in un rifugio (避難所に避難する)","ripararsi dietro qualcosa (何かの後ろに身を隠す)"],"synonyms":["proteggersi","rifugiarsi","nascondersi","mettersi al riparo","trovare riparo"],"antonyms":["esporsi","scoprirsi","rischiare"]}],"etymology":{"value":"Dal latino \"reparare\" (restaurare, riparare), con l'aggiunta del prefisso \"ri-\" (di nuovo) e il suffisso riflessivo \"-si\". Originariamente significava \"restaurare se stessi\", poi ha assunto il significato di \"proteggere se stessi\".","priority":"★☆☆"},"pronunciation":{"ipa":"/ri.paˈrar.si/","syllables":"ri-pa-rar-si"},"inflection":{"verb_type":"regular","conjugation_examples":{"presente":"io mi riparo, tu ti ripari, lui/lei si ripara, noi ci ripariamo, voi vi riparate, loro si riparano","passato_prossimo":"io mi sono riparato/a, tu ti sei riparato/a, lui/lei si è riparato/a, noi ci siamo riparati/e, voi vi siete riparati/e, loro si sono riparati/e","futuro_semplice":"io mi riparerò, tu ti riparerai, lui/lei si riparerà, noi ci ripareremo, voi vi riparerete, loro si ripareranno","imperfetto":"io mi riparavo, tu ti riparavi, lui/lei si riparava, noi ci riparavamo, voi vi riparavate, loro si riparavano","passato_remoto":"io mi riparai, tu ti riparasti, lui/lei si riparò, noi ci riparammo, voi vi riparaste, loro si ripararono","condizionale_presente":"io mi riparerei, tu ti ripareresti, lui/lei si riparerebbe, noi ci ripareremmo, voi vi riparereste, loro si riparerebbero","congiuntivo_presente":"che io mi ripari, che tu ti ripari, che lui/lei si ripari, che noi ci ripariamo, che voi vi ripariate, che loro si riparino","congiuntivo_imperfetto":"che io mi riparassi, che tu ti riparassi, che lui/lei si riparasse, che noi ci riparassimo, che voi vi riparaste, che loro si riparassero","imperativo":"riparati (tu), si ripari (lui/lei), riparamoci (noi), riparatevi (voi), si riparino (loro)"}},"usage_notes":{"explanation":"\"Ripararsi\" è un verbo riflessivo che indica l'azione di mettersi al sicuro da qualcosa, sia essa un agente atmosferico come pioggia o sole, sia un pericolo. Si usa spesso in contesti in cui si cerca un riparo temporaneo. La forma non riflessiva (\"riparare\") ha un significato diverso, ovvero \"aggiustare\" o \"restaurare\". È importante notare che \"ripararsi\" implica un'azione compiuta su se stessi per proteggersi.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"Mi riparo dalla pioggia con l'ombrello. (corretto, ma meno comune)","correct":"Mi riparo sotto l'ombrello quando piove.","note":"Anche se la prima frase è grammaticalmente corretta, è più comune specificare *dove* ci si ripara (sotto l'ombrello, sotto un albero, ecc.) piuttosto che *con cosa*."},{"incorrect":"Devo riparare dal sole.","correct":"Devo ripararmi dal sole.","note":"È necessario usare la forma riflessiva \"ripararmi\" per indicare che l'azione di ripararsi è compiuta su se stessi."},{"incorrect":"Si riparò perché aveva freddo.","correct":"Si riparò perché sentiva freddo.","note":"Anche se il significato è chiaro, è più naturale dire \"sentiva freddo\" piuttosto che \"aveva freddo\" in questo contesto."}],"priority":"★☆☆"},"related_words":{"derivatives":["riparo (sostantivo: riparo, rifugio)","riparabile (aggettivo: riparabile)","riparazione (sostantivo: riparazione)"],"phrases":["mettersi al riparo (to take shelter)","trovare riparo (to find shelter)"],"priority":"★★☆"},"level_frequency":{"frequency_corpus":"Moderately common.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"\"Ripararsi\" significa proteggere se stessi da qualcosa, come la pioggia, il sole o il vento. È un verbo riflessivo, quindi si usa con i pronomi riflessivi (mi, ti, si, ci, vi, si). Ad esempio, \"Mi riparo sotto l'ombrello\" significa \"Mi proteggo dalla pioggia usando l'ombrello\". Ricorda di usare la forma riflessiva corretta!"},"example_sentences":[{"sentence":"Quando inizia a piovere, è importante ripararsi subito.","translation":"When it starts to rain, it's important to take shelter immediately.","type":"general","meaning_category":"Taking shelter"},{"sentence":"Si ripararono dal sole cocente sotto un grande albero.","translation":"They sheltered from the scorching sun under a large tree.","type":"specific","meaning_category":"Protection from the sun"},{"sentence":"Durante la tempesta, ci siamo riparati in una grotta.","translation":"During the storm, we took shelter in a cave.","type":"specific","meaning_category":"Taking refuge in a cave"},{"sentence":"I gatti amano ripararsi in luoghi caldi e asciutti.","translation":"Cats love to take shelter in warm and dry places.","type":"general","meaning_category":"Animal behavior"},{"sentence":"Si riparò dietro la macchina per non farsi vedere.","translation":"He sheltered behind the car so as not to be seen.","type":"specific","meaning_category":"Hiding from view"}]}