{"word":"blenny","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"イソギンポ科の魚","english_definition":"a small, often brightly coloured fish of the family Blenniidae, typically found in shallow coastal waters.","examples":[{"sentence":"The rock pool was full of small blennies.","translation":"その岩のプールは小さなイソギンポ科の魚でいっぱいだった。"},{"sentence":"Blenny fish are known for their ability to adapt to different environments.","translation":"イソギンポ科の魚は、さまざまな環境に適応する能力で知られている。"}],"collocations":["rock blenny","shanny blenny","blenny habitat","blenny species"],"synonyms":["shanny","fish"],"antonyms":[]}],"etymology":{"value":"From Cornish *belynow* 'minnows'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈblɛni/","syllables":"blen-ny"},"inflection":{"noun_plural":"blennies"},"usage_notes":{"explanation":"'Blenny' refers to a specific type of fish, typically small and found in coastal waters. It's a relatively uncommon word unless discussing marine biology or fishing.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a blenny on the tree.","correct":"✓ I saw a blenny in the rock pool.","note":"Blenny are fish, so they are found in water, not on trees."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'blenny' is a technical term used in marine biology and ichthyology to refer to a specific family of fish. It is not a commonly used word in everyday conversation. Understanding and use of this word would indicate a higher level of English proficiency, particularly in specialized vocabulary related to natural sciences."},"example_sentences":[{"sentence":"The scuba diver spotted a colorful blenny hiding among the coral.","translation":"スキューバダイバーは、サンゴの中に隠れているカラフルなイソギンポを見つけた。","type":"noun","meaning_category":"fish"},{"sentence":"Blenny fish are often found in tide pools along the rocky coast.","translation":"イソギンポ科の魚は、岩場の海岸沿いの潮だまりでよく見られる。","type":"noun","meaning_category":"fish"}]}