{"word":"interlardation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(文章などへの)挿入、混入、散りばめ","english_definition":"The act of interlarding; insertion or mixture among other things.","examples":[{"sentence":"The speech was full of interlardations of humor.","translation":"そのスピーチはユーモアが散りばめられていた。"},{"sentence":"The interlardation of personal anecdotes made the lecture more engaging.","translation":"個人的な逸話の挿入が講義をより魅力的にした。"}],"collocations":["interlardation of anecdotes","interlardation of humor","interlardation of details"],"synonyms":["insertion","mixture","interspersion","addition","interpolation","admixture"],"antonyms":["separation","exclusion","omission"]}],"etymology":{"value":"From interlard + -ation.  Interlard is from French entrelarder, from entre- + larder (to lard).","priority":"★★☆"},"pronunciation":{"ipa":"ˌɪntərˌlɑːrˈdeɪʃən","syllables":"in-ter-lar-da-tion"},"inflection":{"noun_plural":"interlardations"},"usage_notes":{"explanation":"'Interlardation' refers to the act of inserting or mixing something into something else, often in writing or speech. It suggests a deliberate and somewhat decorative addition. The word is relatively formal and not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The interlardation was too much and ruined the text.","correct":"✓ The interlardation was excessive and ruined the text.","note":"'Too much' is grammatically correct, but 'excessive' is a more appropriate and formal synonym in this context."},{"incorrect":"✗ Interlardation is a good way to separate ideas.","correct":"✓ Interlardation is a way to combine ideas.","note":"Interlardation combines, rather than separates, ideas."}],"priority":"★☆☆"},"related_words":{"derivatives":["interlard (verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Interlardation' is a sophisticated word describing the act of mixing or inserting elements into something else, often to enrich or diversify it. It's not a common term, so understanding its meaning requires a strong vocabulary and familiarity with formal writing. You'll likely encounter it in academic or literary contexts rather than everyday conversation."},"example_sentences":[{"sentence":"The author's interlardation of historical facts made the novel more believable.","translation":"著者の歴史的事実の挿入が小説をより信憑性のあるものにした。","type":"general","meaning_category":"挿入"},{"sentence":"The interlardation of foreign phrases added a touch of exoticism to the poem.","translation":"外国語のフレーズの混入が詩に異国情緒を加えた。","type":"general","meaning_category":"混入"},{"sentence":"The chef's interlardation of spices created a unique flavor profile.","translation":"シェフのスパイスの散りばめが独特の風味を作り出した。","type":"general","meaning_category":"散りばめ"}]}