{"word":"gynaecomorphous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"女性の体型に似た、女性的な体つきの","english_definition":"Having a body shape resembling that of a woman; having feminine characteristics.","examples":[{"sentence":"The patient exhibited gynaecomorphous features due to hormonal imbalances.","translation":"その患者はホルモンバランスの乱れにより、女性的な体つきを示した。"},{"sentence":"Some athletes develop a gynaecomorphous physique as a side effect of certain medications.","translation":"一部のアスリートは、特定の薬の副作用として女性的な体格を発達させる。"}],"collocations":["gynaecomorphous physique","gynaecomorphous appearance","gynaecomorphous features"],"synonyms":["feminized","effeminate","womanly"],"antonyms":["andromorphous","masculine","virile"]}],"etymology":{"value":"Derived from the Greek words 'gynaikos' (woman) and 'morphe' (form).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡaɪnɪkəˈmɔːrfəs/","syllables":"gy-nae-co-mor-phous"},"inflection":{"notes":"Adjective, comparative and superlative forms are: more gynaecomorphous, most gynaecomorphous."},"usage_notes":{"explanation":"'Gynaecomorphous' is a descriptive term, often used in medical or biological contexts, to describe a male body exhibiting female-like characteristics, particularly in terms of body shape or features. It is often associated with conditions like gynecomastia (enlargement of male breast tissue).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant had gynaecomorphous flowers.","correct":"✓ The plant had flowers resembling female flowers.","note":"'Gynaecomorphous' is typically used to describe human or animal physical characteristics, not plants. Use descriptive language instead."},{"incorrect":"✗ He felt gynaecomorphous after the surgery.","correct":"✓ He felt self-conscious about his appearance after the surgery.","note":"'Gynaecomorphous' describes a physical state, not a feeling. Use terms describing emotions or self-perception."}],"priority":"★★☆"},"related_words":{"derivatives":["gynaecomorph (noun: an individual with gynaecomorphous characteristics)","gynaecomorphy (noun: the state of having gynaecomorphous characteristics)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Gynaecomorphous' is a specialized term primarily used in medical or biological contexts to describe a male body that exhibits female-like characteristics. Understanding its meaning requires familiarity with scientific vocabulary related to anatomy and morphology. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The doctor noted the patient's gynaecomorphous build during the physical examination.","translation":"医師は身体検査中に患者の女性的な体格に注目した。","type":"general","meaning_category":"physical description"},{"sentence":"Hormone therapy can sometimes lead to a gynaecomorphous appearance in men.","translation":"ホルモン療法は時に男性に女性的な外見をもたらすことがある。","type":"medical","meaning_category":"medical condition"},{"sentence":"The study investigated the prevalence of gynaecomorphous features in a specific population group.","translation":"その研究は、特定の集団における女性的な特徴の有病率を調査した。","type":"scientific","meaning_category":"research"}]}