{"word":"civilisable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"文明化できる、教化できる","english_definition":"Capable of being civilized; susceptible to being brought to a more advanced or refined state.","examples":[{"sentence":"The indigenous people were thought to be civilisable by the colonizers.","translation":"先住民は入植者によって文明化できると考えられていた。"},{"sentence":"Some believed that even the most savage tribes were civilisable with the right approach.","translation":"最も野蛮な部族でさえ、適切なアプローチで文明化できると信じる人もいた。"}],"collocations":["easily civilisable","potentially civilisable","considered civilisable"],"synonyms":["culturable","refinable","educable","developable","trainable"],"antonyms":["uncivilisable","untamable","incorrigible","irreclaimable"]}],"etymology":{"value":"The word 'civilisable' is derived from 'civilize' (to bring out of a savage, uneducated, or rude state; to educate; refine) + '-able' (capable of; susceptible of). 'Civilize' comes from the Latin word 'civilis,' pertaining to a citizen or state.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɪvəlaɪzəbəl/","syllables":"ci-vi-li-sa-ble"},"inflection":{"notes":"This is an adjective and does not have different forms for gender or number."},"usage_notes":{"explanation":"'Civilisable' is an adjective that describes something or someone capable of being civilized. It often carries historical and sometimes controversial connotations, as the concept of 'civilizing' has been used to justify colonialism and cultural assimilation. The term suggests a hierarchy where one culture or group is considered more advanced or refined than another, and therefore, capable of being improved or elevated.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The land was civilisable for farming.","correct":"✓ The land was cultivatable/arable for farming.","note":"'Civilisable' refers to people or societies, not land. Use 'cultivatable' or 'arable' for land suitable for farming."},{"incorrect":"✗ The civilisable of the tribe was a long process.","correct":"✓ The civilization of the tribe was a long process.","note":"'Civilisable' is an adjective. Use the noun 'civilization' to refer to the process of becoming civilized."}],"priority":"★★☆"},"related_words":{"derivatives":["civilize (verb)","civilization (noun)","civilized (adjective)","uncivilisable (adjective)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - The word is not commonly used in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Civilisable' is a relatively uncommon word that means 'capable of being civilized.' The concept of 'civilizing' often implies bringing someone or a group of people to a more advanced or refined state, often culturally or socially. This word is not frequently used in everyday conversation and is more likely to appear in historical or academic contexts when discussing colonialism, cultural development, or societal progress. It's important to be aware of the potential connotations and sensitivities associated with the term, as it can imply a hierarchy of cultures or societies."},"example_sentences":[{"sentence":"The missionaries believed the native population was civilisable and set out to convert them to Christianity.","translation":"宣教師たちは、先住民は文明化できると信じ、彼らをキリスト教に改宗させようとした。","type":"adjective","meaning_category":"文明化できる"},{"sentence":"Whether a society is truly civilisable depends on its willingness to adapt and learn.","translation":"社会が真に文明化できるかどうかは、適応し学ぶ意欲にかかっている。","type":"adjective","meaning_category":"文明化できる"},{"sentence":"Historically, the concept of being 'civilisable' has been used to justify cultural assimilation.","translation":"歴史的に、「文明化できる」という概念は、文化同化を正当化するために利用されてきた。","type":"adjective","meaning_category":"文明化できる"}]}