{"word":"Xerophthalmy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"乾性眼症、眼球乾燥症","english_definition":"A medical condition in which the eye fails to produce tears, resulting in dryness and damage to the conjunctiva and cornea.","examples":[{"sentence":"Xerophthalmy can lead to corneal damage if left untreated.","translation":"乾性眼症は、治療せずに放置すると角膜損傷につながる可能性があります。"},{"sentence":"Vitamin A deficiency is a major cause of xerophthalmy in developing countries.","translation":"ビタミンA欠乏症は、発展途上国における乾性眼症の主な原因です。"}],"collocations":["treat xerophthalmy (乾性眼症を治療する)","prevent xerophthalmy (乾性眼症を予防する)","cause xerophthalmy (乾性眼症を引き起こす)","severe xerophthalmy (重度の乾性眼症)","mild xerophthalmy (軽度の乾性眼症)"],"synonyms":["dry eye syndrome","keratoconjunctivitis sicca"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'xeros' (dry), 'ophthalmos' (eye), and '-ia' (a condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌzɪˌrɒfˈθælmɪ/","syllables":"ze-roph-thal-my"},"inflection":{"noun_plural":"xerophthalmies"},"usage_notes":{"explanation":"Xerophthalmy is a serious medical condition characterized by severe dryness of the eyes due to a lack of tear production. It is often associated with vitamin A deficiency, particularly in developing countries, but can also be caused by other factors such as autoimmune diseases or certain medications. Untreated xerophthalmy can lead to corneal damage, vision impairment, and even blindness.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has xerophthalmia.","correct":"✓ He has xerophthalmy.","note":"'Xerophthalmia' is an older, less precise term. 'Xerophthalmy' is the preferred term for the condition itself."},{"incorrect":"✗ Xerophthalmy is not a serious condition.","correct":"✓ Xerophthalmy can be a serious condition if left untreated.","note":"Xerophthalmy can lead to severe complications if not properly managed."}],"priority":"★★☆"},"related_words":{"derivatives":["xerotic (adjective: relating to or characterized by dryness)","ophthalmology (noun: the branch of medicine concerned with the study and treatment of disorders and diseases of the eye)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Xerophthalmy' is a technical medical term referring to severe dry eye disease caused by a lack of tear production. It is most commonly associated with vitamin A deficiency but can have other causes. Understanding this term requires a background in medical terminology. It is important to note the distinction between general dry eye and xerophthalmy, which is a more severe and specific condition."},"example_sentences":[{"sentence":"The doctor diagnosed her with xerophthalmy after examining her dry, irritated eyes.","translation":"医師は、彼女の乾燥して炎症を起こした目を診察した後、乾性眼症と診断しました。","type":"medical","meaning_category":"diagnosis"},{"sentence":"Treatment for xerophthalmy often involves vitamin A supplements and artificial tears.","translation":"乾性眼症の治療には、ビタミンAのサプリメントと人工涙液がよく用いられます。","type":"treatment","meaning_category":"treatment"},{"sentence":"Public health initiatives in developing countries focus on preventing xerophthalmy through vitamin A fortification of food.","translation":"発展途上国における公衆衛生イニシアチブは、食品へのビタミンA強化を通じて乾性眼症の予防に重点を置いています。","type":"prevention","meaning_category":"prevention"}]}