{"word":"diagonal-built","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"斜めに建てられた、斜めに構造された","english_definition":"Constructed or arranged in a diagonal manner.","examples":[{"sentence":"The diagonal-built bridge provided a unique architectural feature.","translation":"斜めに建てられた橋は、ユニークな建築上の特徴を提供した。"},{"sentence":"The diagonal-built shelves maximized space in the small room.","translation":"斜めに構造された棚は、狭い部屋のスペースを最大限に活用した。"}],"collocations":["diagonal-built bridge","diagonal-built structure","diagonal-built design"],"synonyms":["oblique-built","slanting-built","angled-built"],"antonyms":["horizontally-built","vertically-built","perpendicularly-built"]}],"etymology":{"value":"The word 'diagonal-built' is a compound adjective formed by combining 'diagonal' (referring to a line joining two non-adjacent corners of a polygon or solid) and 'built' (past participle of 'build', meaning constructed or created). The combination indicates that something has been constructed or arranged along a diagonal line or plane.","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˈæɡənəl bɪlt/","syllables":"di-ag-o-nal-built"},"inflection":{"notes":"Adjective, no inflections."},"usage_notes":{"explanation":"'Diagonal-built' is a descriptive adjective used to specify that a structure or design is constructed or arranged in a diagonal manner. It is often used to describe architectural features, furniture, or other objects where the diagonal arrangement is a notable characteristic.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building was diagonal built.","correct":"✓ The building was diagonal-built.","note":"The hyphen is important to connect 'diagonal' and 'built' to form a compound adjective modifying the noun."}],"priority":"★★☆"},"related_words":{"derivatives":["diagonal","built"],"phrasal_verbs":[],"related_terms":["diagonally","oblique","slant","angle"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'diagonal-built' is a relatively uncommon compound adjective used to describe structures or designs that are constructed or arranged in a diagonal manner. It is most likely to be encountered in architectural or design contexts. Understanding the individual components ('diagonal' and 'built') helps in deciphering the meaning. The hyphen is crucial for indicating that it is a compound adjective."},"example_sentences":[{"sentence":"The diagonal-built staircase added a modern touch to the interior.","translation":"斜めに建てられた階段は、インテリアにモダンな雰囲気を与えた。","type":"adjective","meaning_category":"Descriptive"},{"sentence":"They designed a diagonal-built support system for the unstable wall.","translation":"彼らは不安定な壁のために、斜めに構造された支持システムを設計した。","type":"adjective","meaning_category":"Structural"}]}