{"word":"longlines","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"延縄漁業","english_definition":"A fishing method that uses a long line, called the main line, with baited hooks attached at intervals by means of branch lines called snoods (or gangions).","examples":[{"sentence":"Longlines are used to catch tuna, swordfish, and other large fish.","translation":"延縄はマグロ、メカジキ、その他の大型魚を捕獲するために使用されます。"},{"sentence":"The use of longlines can have a significant impact on marine ecosystems.","translation":"延縄の使用は海洋生態系に大きな影響を与える可能性があります。"}],"collocations":["fishing longlines","pelagic longlines","deep-sea longlines"],"synonyms":["longline fishing","setlines"],"antonyms":[]}],"etymology":{"value":"Derived from the combination of 'long' and 'lines', referring to the long lines used in this fishing method.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɔŋˌlaɪnz/","syllables":"long-lines"},"inflection":{"noun_plural":"longlines"},"usage_notes":{"explanation":"'Longlines' refers to a specific fishing technique, and is most often used in the context of commercial fishing or marine conservation. It's important to note the potential environmental impact of this method.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a longline in the sea.","correct":"✓ I saw longlines being used by the fishing boat.","note":"'Longline' as a single line is rare; it's almost always plural 'longlines' to refer to the fishing method."}],"priority":"★☆☆"},"related_words":{"derivatives":["longliner (noun: a fishing vessel that uses longlines)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Longlines' is a technical term primarily used in the context of fishing and marine biology. Understanding this term requires familiarity with commercial fishing practices and potential environmental concerns associated with them."},"example_sentences":[{"sentence":"Many seabirds are accidentally caught by fishing **longlines**.","translation":"多くの海鳥が誤って延縄漁業によって捕獲されます。","type":"noun","meaning_category":"延縄漁業"},{"sentence":"The use of **longlines** is regulated in some areas to protect marine life.","translation":"海洋生物を保護するために、一部の地域では延縄の使用が規制されています。","type":"noun","meaning_category":"延縄漁業"}]}