{"word":"Phagedaena","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(病理) 腐食性潰瘍、食い潰し","english_definition":"(pathology) a rapidly spreading and destructive ulceration, often associated with bacterial infection.","examples":[{"sentence":"The patient presented with a severe case of phagedaena on their lower leg.","translation":"患者は下肢に重度の食い潰瘍を呈した。"},{"sentence":"Historically, phagedaena was a common complication of battlefield wounds.","translation":"歴史的に、食い潰しは戦場での傷の一般的な合併症であった。"}],"collocations":["phagedaenic ulcer","tropical phagedaena","hospital phagedaena"],"synonyms":["ulcer","necrosis","gangrene"],"antonyms":[]},{"part_of_speech":"adjective","definition":"(病理) 腐食性の、食い潰しの","english_definition":"(pathology) relating to or characterized by rapidly spreading and destructive ulceration.","examples":[{"sentence":"The wound exhibited phagedaenic characteristics, requiring immediate intervention.","translation":"その傷は腐食性の特徴を示し、直ちに介入が必要であった。"},{"sentence":"Phagedaenic infections can lead to significant tissue loss if left untreated.","translation":"食い潰しの感染症は、治療せずに放置すると重大な組織損失につながる可能性がある。"}],"collocations":["phagedaenic infection","phagedaenic ulceration"],"synonyms":["necrotic","ulcerative","gangrenous"],"antonyms":[]}],"etymology":{"value":"From Greek φάγος (phagos) 'eating' + δαίνω (dainō) 'to tear, rend, consume'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfædʒɪˈdiːnə/","syllables":"pha-ge-dae-na"},"inflection":{"noun_plural":"phagedaenas"},"usage_notes":{"explanation":"Phagedaena refers to a severe and rapidly progressing type of ulceration. It's a relatively rare term in modern medicine, often replaced by more specific diagnoses based on the underlying cause of the ulcer. The adjective 'phagedaenic' describes conditions or characteristics associated with this type of ulceration.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor diagnosed the patient with phagedaena of the heart.","correct":"✓ The doctor diagnosed the patient with a phagedaenic ulcer on the leg.","note":"Phagedaena specifically refers to ulceration, not a general condition affecting an organ like the heart."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Phagedaena' is a highly specialized medical term referring to a specific type of rapidly spreading and destructive ulceration. It is rarely encountered outside of medical contexts and is primarily used by healthcare professionals. Understanding this term requires a strong background in medical terminology and pathology."},"example_sentences":[{"sentence":"The surgeon noted the phagedaena was aggressively destroying the surrounding tissue.","translation":"外科医は、食い潰しが周囲の組織を積極的に破壊していることを指摘した。","type":"noun","meaning_category":"腐食性潰瘍"},{"sentence":"The patient's wound displayed phagedaenic characteristics, indicating a severe infection.","translation":"患者の傷は腐食性の特徴を示しており、重度の感染症を示唆していた。","type":"adjective","meaning_category":"腐食性の"}]}