{"word":"Singularist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(哲学) 単一主義者：唯一の実在を認める立場の人。","english_definition":"A proponent of singularism, the philosophical belief that reality is ultimately one unified substance or principle.","examples":[{"sentence":"As a singularist, he believed that all things are interconnected.","translation":"単一主義者として、彼はすべてのものが相互に繋がっていると信じていた。"}],"collocations":["philosophical singularist","religious singularist"],"synonyms":["monist"],"antonyms":["dualist","pluralist"]},{"part_of_speech":"noun","definition":"(宗教) ユニテリアン主義者：三位一体説を否定し、唯一神を信じる人。","english_definition":"A Unitarian, one who denies the doctrine of the Trinity and believes in the sole deity of God.","examples":[{"sentence":"The Singularists were known for their emphasis on reason and individual conscience.","translation":"単一主義者は、理性と個人の良心を重視することで知られていた。"}],"collocations":["historical singularist","modern singularist"],"synonyms":["Unitarian"],"antonyms":["Trinitarian"]},{"part_of_speech":"adjective","definition":"単一主義の、唯一の実在を認める。","english_definition":"Relating to or characteristic of singularism.","examples":[{"sentence":"The singularist perspective emphasizes the interconnectedness of all things.","translation":"単一主義的な視点は、すべてのものの相互のつながりを強調する。"}],"collocations":["singularist philosophy","singularist view"],"synonyms":["monistic"],"antonyms":["dualistic","pluralistic"]},{"part_of_speech":"adjective","definition":"ユニテリアン主義の、三位一体説を否定する。","english_definition":"Relating to or characteristic of Unitarianism.","examples":[{"sentence":"The singularist church advocated for religious tolerance.","translation":"単一主義の教会は、宗教的寛容を提唱した。"}],"collocations":["singularist theology","singularist beliefs"],"synonyms":["Unitarian"],"antonyms":["Trinitarian"]}],"etymology":{"value":"The term 'Singularist' is derived from 'singular,' emphasizing the belief in a single, unified reality or deity. It is used both in philosophy and in religious contexts, specifically referring to Unitarianism.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɪŋɡjələrɪst/","syllables":"sin-gu-lar-ist"},"inflection":{"noun_plural":"Singularists"},"usage_notes":{"explanation":"The term 'Singularist' can refer to two distinct concepts: philosophical singularism and Unitarianism. In philosophy, it denotes the belief in a single, unified reality. In religion, it refers to Unitarians, who reject the Trinity and believe in one God. Context is crucial to determine the intended meaning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a singularist because he likes single things.","correct":"✓ He is a singularist because he believes in a unified reality.","note":"Singularist refers to a philosophical or religious belief, not a preference for single items."}],"priority":"★★☆"},"related_words":{"derivatives":["Singularism","Unitarianism","Singular"],"related_terms":["Monism","Unitarian","Trinity","Dualism","Pluralism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Singularist' is a term primarily used in philosophical and religious contexts. It refers to someone who adheres to singularism (the belief in a single, unified reality) or to Unitarianism (a theological belief in the sole deity of God, rejecting the Trinity). Understanding this term requires familiarity with philosophical and theological concepts. The word is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The singularist philosopher argued that all apparent diversity is ultimately an illusion.","translation":"その単一主義の哲学者は、すべての見かけ上の多様性は究極的には幻想であると主張した。","type":"noun","meaning_category":"哲学"},{"sentence":"Many singularist churches were founded on principles of social justice and equality.","translation":"多くの単一主義の教会は、社会正義と平等の原則に基づいて設立された。","type":"noun","meaning_category":"宗教"},{"sentence":"His singularist view of the universe led him to reject traditional religious doctrines.","translation":"彼の宇宙に対する単一主義的な見方は、彼に伝統的な宗教的教義を拒否させた。","type":"adjective","meaning_category":"哲学"},{"sentence":"The singularist movement has a long history of advocating for individual freedom of belief.","translation":"単一主義運動は、個人の信仰の自由を提唱する長い歴史を持っている。","type":"adjective","meaning_category":"宗教"}]}