{"word":"denaturized","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"変性された、変性処理された","english_definition":"having undergone a process that makes something unfit for consumption or other unintended purposes, especially alcohol.","examples":[{"sentence":"Denaturized alcohol is used as a solvent.","translation":"変性アルコールは溶剤として使用されます。"},{"sentence":"The lab uses denaturized ethanol to prevent misuse.","translation":"その研究室では、誤用を防ぐために変性エタノールを使用しています。"}],"collocations":["denaturized alcohol","denaturized ethanol"],"synonyms":["modified","treated","altered"],"antonyms":["pure","unaltered","natural"]}],"etymology":{"value":"The word \"denaturized\" comes from the verb \"denature,\" which originates from \"de-\" (meaning removal or reversal) and \"nature\" (meaning the inherent character or constitution of something). It implies the removal or alteration of the natural properties of a substance.","priority":"★★★"},"pronunciation":{"ipa":"/diːˈneɪtʃəraɪzd/","syllables":"de-na-tur-ized"},"inflection":{"notes":"This is the past participle form of the verb 'denaturize' used as an adjective. It does not have comparative or superlative forms."},"usage_notes":{"explanation":"\"Denaturized\" is primarily used to describe substances, especially alcohol, that have been treated with additives to make them unsuitable for drinking or other purposes for which they were originally intended. This is often done to avoid taxes on alcohol intended for consumption. The term implies a deliberate alteration of the substance's properties to prevent misuse.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The denaturized food was delicious.","correct":"✓ The processed food was delicious.","note":"\"Denaturized\" is generally not used to describe food, as it implies making something unfit for consumption. Use \"processed\" or a more specific term instead."},{"incorrect":"✗ The water was denaturized.","correct":"✓ The water was treated.","note":"\"Denaturized\" is typically used for alcohol or similar substances. For water, use \"treated\" or a more specific term like \"purified\" or \"deionized\"."}],"priority":"★★☆"},"related_words":{"derivatives":["denature (verb): to subject to denaturation","denaturation (noun): the process of denaturing a substance"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, mainly used in scientific or technical contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word \"denaturized\" is a technical term primarily used in chemistry, biology, and related fields. It describes a substance, most commonly alcohol, that has been altered to make it unsuitable for human consumption or specific applications. The process of denaturing involves adding chemicals that change the substance's properties without necessarily changing its chemical composition. This term is not commonly used in everyday language and is more likely to be encountered in scientific or industrial contexts."},"example_sentences":[{"sentence":"The scientist used denaturized protein in the experiment.","translation":"科学者は実験で変性タンパク質を使用しました。","type":"adjective","meaning_category":"変性された"},{"sentence":"Denaturized spirits are often used as a cleaning agent.","translation":"変性スピリッツは洗浄剤としてよく使用されます。","type":"adjective","meaning_category":"変性された"},{"sentence":"The company produces denaturized alcohol for industrial purposes.","translation":"その会社は工業用に変性アルコールを製造しています。","type":"adjective","meaning_category":"変性された"}]}