{"word":"leprologist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ハンセン病専門医、らい学者","english_definition":"A medical specialist who studies and treats leprosy (Hansen's disease).","examples":[{"sentence":"The patient consulted a leprologist for treatment of their Hansen's disease.","translation":"患者はハンセン病の治療のためにハンセン病専門医に相談した。"}],"collocations":["consult a leprologist","refer to a leprologist","find a leprologist"],"synonyms":["Hansen's disease specialist"],"antonyms":[]}],"etymology":{"value":"The word \"leprologist\" is formed by combining \"leprology\" (the study of leprosy) with the suffix \"-ist\" (denoting a person engaged in a particular activity or field of study). \"Leprology\" itself comes from \"lepro-\" (referring to leprosy) and \"-logy\" (the study of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌlɛprəˈlɒdʒɪst/","syllables":"le-pro-lo-gist"},"inflection":{"noun_plural":"leprologists"},"usage_notes":{"explanation":"A leprologist is a medical doctor who specializes in the diagnosis, treatment, and management of leprosy, also known as Hansen's disease. They have expertise in the clinical manifestations, complications, and long-term care of individuals affected by this chronic infectious disease.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient went to a dermatologist for leprosy treatment.","correct":"✓ The patient went to a leprologist for leprosy treatment.","note":"A dermatologist is a skin specialist, but a leprologist has specific expertise in leprosy."}],"priority":"★☆☆"},"related_words":{"derivatives":["leprology (ハンセン病学)","leprosy (ハンセン病)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'leprologist' refers to a highly specialized medical professional. Understanding this word requires familiarity with medical terminology and a specific disease. It's not commonly used in everyday conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The leprologist carefully examined the patient's skin lesions.","translation":"ハンセン病専門医は患者の皮膚病変を注意深く診察した。","type":"general","meaning_category":"Medical specialist"},{"sentence":"Access to leprologists is crucial for effective leprosy control programs.","translation":"ハンセン病専門医へのアクセスは、効果的なハンセン病対策プログラムにとって非常に重要である。","type":"general","meaning_category":"Medical specialist"}]}