{"word":"hyperethically","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"過剰に倫理的に、極端に倫理的に","english_definition":"In an excessively ethical manner; to an extreme degree of ethicality.","examples":[{"sentence":"The company was operating hyperethically, refusing even marginally profitable ventures that could potentially raise ethical concerns.","translation":"その会社は過剰なまでに倫理的に運営されており、倫理的な懸念を引き起こす可能性のある、わずかな利益が見込める事業でさえ拒否していた。"},{"sentence":"He approached the problem hyperethically, considering every possible moral implication before making a decision.","translation":"彼はその問題に極端に倫理的に取り組み、決定を下す前に考えられるすべての道徳的影響を考慮した。"}],"collocations":["operate hyperethically","approach hyperethically","behave hyperethically"],"synonyms":["overzealously ethically","excessively morally","scrupulously ethically"],"antonyms":["unethically","immorally","amoral"],"notes":"This word implies a level of ethical consideration that may be impractical or unrealistic."}],"etymology":{"value":"Formed by combining the prefix 'hyper-' (meaning 'excessively' or 'beyond') with 'ethically'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌhaɪpərˈɛθɪkli/","syllables":"hy-per-eth-i-cal-ly"},"inflection":{"notes":"As an adverb, it does not have different forms."},"usage_notes":{"explanation":"'Hyperethically' describes actions or behaviors that adhere to ethical principles to an extreme or impractical degree. It suggests a level of ethical rigor that goes beyond what is typically expected or necessary, potentially leading to inefficiency or other negative consequences.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The hyperethically company.","correct":"✓ The hyperethical company.","note":"'Hyperethically' is an adverb and should modify a verb, adjective, or another adverb. 'Hyperethical' is the correct adjective form."},{"incorrect":"✗ He acted hyperethically, that was good.","correct":"✓ He acted hyperethically, which was admirable.","note":"When using 'hyperethically', ensure the sentence structure is correct. It should modify a verb describing how the action was performed."}],"priority":"★★☆"},"related_words":{"derivatives":["hyperethical (adjective)","ethics","ethical","ethically"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency. This is a relatively rare word.","priority":"★★☆"},"readability_explanation":{"level":"C2","text":"'Hyperethically' is an advanced term used to describe acting in an extremely ethical manner, possibly to an impractical degree. It combines 'hyper-' (excessively) with 'ethically'. This term is not commonly used and is more likely to appear in academic or specialized discussions about ethics."},"example_sentences":[{"sentence":"The organization aimed to behave hyperethically in all its dealings, even if it meant sacrificing short-term profits.","translation":"その組織は、たとえ短期的な利益を犠牲にすることを意味するとしても、すべての取引において過剰なまでに倫理的に行動することを目指した。","type":"general","meaning_category":"excessively ethical"},{"sentence":"The lawyer approached the case hyperethically, meticulously examining every potential conflict of interest.","translation":"弁護士はその事件に極端に倫理的に取り組み、起こりうる利益相反の可能性をすべて綿密に調べた。","type":"professional","meaning_category":"extreme ethical consideration"}]}