{"word":"dead-air","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(放送)無音状態、放送休止","english_definition":"A period of silence on radio or television, especially when it is unexpected or unplanned.","examples":[{"sentence":"There was a moment of dead-air during the live broadcast when the presenter's microphone failed.","translation":"生放送中に、プレゼンターのマイクが故障し、一瞬の無音状態が発生した。"},{"sentence":"The station experienced several minutes of dead-air due to a technical malfunction.","translation":"技術的な故障により、放送局は数分間の放送休止を経験した。"}],"collocations":["a moment of dead-air","dead-air time","unexpected dead-air","technical dead-air"],"synonyms":["silence","pause","break","interruption"],"antonyms":["live broadcast","airtime","programming"]},{"part_of_speech":"noun","definition":"(比喩的に)沈黙、気まずい静寂","english_definition":"(Figuratively) A period of silence or inactivity in a conversation or situation, often awkward or uncomfortable.","examples":[{"sentence":"After his controversial statement, there was a noticeable dead-air in the room.","translation":"彼の物議を醸す発言の後、部屋には明らかな沈黙が流れた。"},{"sentence":"The meeting ended with a long stretch of dead-air as no one knew what to say next.","translation":"会議は、次に何を言うべきか誰もわからず、長い沈黙のうちに終わった。"}],"collocations":["awkward dead-air","noticeable dead-air","uncomfortable dead-air"],"synonyms":["silence","pause","lull","stillness","hiatus"],"antonyms":["conversation","activity","engagement"]}],"etymology":{"value":"The term 'dead-air' likely originated in the early days of radio broadcasting, referring literally to the absence of a signal being transmitted through the air. The 'dead' part signifies the lack of activity or life, while 'air' refers to the medium of broadcast.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɛdˌɛr/","syllables":"dead-air"},"inflection":{"notes":"Plural form: dead-airs"},"usage_notes":{"explanation":"'Dead-air' primarily refers to the absence of sound in a broadcast, but it has also taken on a figurative meaning to describe awkward silences in conversations or meetings. In broadcasting, it is generally undesirable and indicates a technical problem or a lack of prepared content. In social situations, 'dead-air' can create discomfort as people feel the need to fill the silence.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The dead air was very loud.","correct":"✓ The dead air was very noticeable.","note":"'Dead-air' is the absence of sound, so it cannot be loud. Instead, focus on the fact that the silence was noticeable or awkward."},{"incorrect":"✗ We need to avoid dead-airs during the presentation.","correct":"✓ We need to avoid dead-air during the presentation.","note":"'Dead-air' is typically used as an uncountable noun, especially when referring to the general concept. While 'dead-airs' is grammatically correct as a plural, it is less common."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["airtime","broadcast","silence","pause","lull"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in contexts related to broadcasting and public speaking.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Dead-air' is a term used to describe a period of silence in a broadcast or a conversation. It's often used when something unexpected happens, like a technical problem on the radio or when no one knows what to say next in a meeting. The term can create a sense of awkwardness or tension, especially when the silence is prolonged. It's more common in professional settings like broadcasting or public speaking, but it can also be used in everyday conversations to describe an uncomfortable silence."},"example_sentences":[{"sentence":"The radio station filled the dead-air with music.","translation":"ラジオ局は無音状態を音楽で埋めた。","type":"noun","meaning_category":"(放送)無音状態"},{"sentence":"The comedian's joke was met with dead-air.","translation":"コメディアンのジョークは沈黙で迎えられた。","type":"noun","meaning_category":"(比喩的に)沈黙"},{"sentence":"The news anchor quickly recovered from the dead-air by ad-libbing.","translation":"ニュースキャスターはアドリブで無音状態からすぐに立ち直った。","type":"noun","meaning_category":"(放送)無音状態"},{"sentence":"The prolonged dead-air made the interview very awkward.","translation":"長引く沈黙がインタビューを非常に気まずくさせた。","type":"noun","meaning_category":"(比喩的に)沈黙"}]}