{"word":"syodicon","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(スラング、不快語) ショタコン、少年愛者","english_definition":"(slang, offensive) A person who is sexually attracted to young boys; a pedophile. This term is highly offensive.","examples":[{"sentence":"That guy is a total syodicon.","translation":"あいつは完全にショタコンだ。"},{"sentence":"Calling someone a syodicon is a serious accusation.","translation":"誰かをショタコンと呼ぶことは重大な告発だ。"}],"collocations":[],"synonyms":["pedophile","child molester"],"antonyms":[],"notes":"This term is extremely offensive and should be used with extreme caution, if at all. It is often used as a derogatory term and can have serious legal implications if used falsely."}],"etymology":{"value":"Derived from the Japanese word 'shotacon' (ショタコン), which is a portmanteau of 'shota' (ショタ), referring to young boys, and 'complex' (コンプレックス, konpurekkusu).","priority":"★★★"},"pronunciation":{"ipa":"/ˈʃoʊdəˌkɑn/","syllables":"sho-da-con"},"inflection":{"noun_plural":"syodicons"},"usage_notes":{"explanation":"'Syodicon' is a highly offensive slang term. It is derived from the Japanese 'shotacon', and refers to someone sexually attracted to young boys. Its use is strongly discouraged due to its offensive and potentially defamatory nature. It is often used as an insult and can carry legal consequences if used falsely.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a syodicon, so he likes anime.","correct":"✓ He likes anime. (Avoid using the term 'syodicon' unless you have concrete evidence and are prepared for the consequences.)","note":"Do not casually use the term 'syodicon' to describe someone's interests. It is a serious accusation."}],"priority":"★★★"},"related_words":{"derivatives":["shotacon"],"related_terms":["lolicon","pedophilia"]},"level_frequency":{"frequency_google_ngram":"Low frequency due to its offensive nature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'syodicon' is a highly offensive and derogatory slang term used to describe someone who is sexually attracted to young boys. Its use is strongly discouraged due to its offensive nature and potential legal ramifications. It is important to understand the severity of this term and avoid using it unless you are fully aware of its implications."},"example_sentences":[{"sentence":"I can't believe he's being accused of being a syodicon.","translation":"彼がショタコンだと告発されているなんて信じられない。","type":"noun","meaning_category":"offensive slang"},{"sentence":"The internet forum was shut down due to the proliferation of syodicon content.","translation":"そのインターネットフォーラムはショタコンコンテンツの拡散により閉鎖された。","type":"noun","meaning_category":"offensive slang"}]}