{"word":"flashover","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(火災における)フラッシュオーバー、爆燃現象","english_definition":"A transition phase in the development of a contained fire in which surfaces exposed to thermal radiation reach ignition temperature more or less simultaneously and fire spreads rapidly throughout the space.","examples":[{"sentence":"The firefighters recognized the signs of an impending flashover and evacuated the building.","translation":"消防士たちは差し迫ったフラッシュオーバーの兆候を認識し、建物から避難した。"},{"sentence":"Flashover can occur very rapidly, giving occupants little time to escape.","translation":"フラッシュオーバーは非常に急速に発生する可能性があり、居住者が避難する時間はほとんどない。"},{"sentence":"Understanding the conditions that lead to flashover is crucial for fire safety.","translation":"フラッシュオーバーにつながる条件を理解することは、火災安全にとって非常に重要である。"}],"collocations":["cause a flashover (フラッシュオーバーを引き起こす)","prevent flashover (フラッシュオーバーを防ぐ)","flashover temperature (フラッシュオーバー温度)","signs of flashover (フラッシュオーバーの兆候)","experience flashover (フラッシュオーバーを経験する)"],"synonyms":["backdraft","firestorm","rapid fire spread"],"antonyms":["smoldering","incipient fire"]},{"part_of_speech":"verb","definition":"(火災が)フラッシュオーバーを起こす","english_definition":"To undergo a flashover.","examples":[{"sentence":"The room flashed over in a matter of seconds.","translation":"部屋はほんの数秒でフラッシュオーバーを起こした。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term 'flashover' is derived from the sudden and rapid 'flash' of fire that 'over'spreads a room or enclosed space.","priority":"★★★"},"pronunciation":{"ipa":"/ˈflæʃˌoʊvər/","syllables":"flash-o-ver"},"inflection":{"noun_plural":"flashovers","verb_forms":{"present_simple":["flashover","flashovers"],"past_simple":"flashed over","past_participle":"flashed over","present_participle":"flashovering"}},"usage_notes":{"explanation":"'Flashover' is a technical term primarily used in the context of fire science, firefighting, and fire safety. It describes a very dangerous stage in a fire's development where the entire contents of a room ignite almost simultaneously. Recognizing the signs of flashover is critical for firefighter safety.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The small flame caused a flashover immediately.","correct":"✓ The small flame eventually led to a flashover.","note":"Flashover doesn't happen immediately. It's a process that occurs as a fire grows and heats up a space. A small flame might *lead* to flashover under the right conditions, but it won't cause it immediately."},{"incorrect":"✗ Flashover is the same as backdraft.","correct":"✓ Flashover and backdraft are both dangerous fire phenomena, but they are different.","note":"Flashover and backdraft are distinct phenomena. Flashover is the simultaneous ignition of contents in a room due to heat buildup. Backdraft is an explosion caused by the sudden introduction of oxygen into a smoldering, oxygen-deprived fire."}],"priority":"★★☆"},"related_words":{"derivatives":["flashover temperature","rollover","backdraft","fire tetrahedron","fire behavior"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Technical vocabulary)","frequency_google_ngram":"Low frequency (Specialized term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Flashover' is a specialized term related to fire dynamics. It refers to the rapid and near-simultaneous ignition of all combustible materials in an enclosed space. This occurs when the accumulated heat from a fire raises the temperature of the room to a point where everything ignites at once. It's a crucial concept in fire safety and firefighting, as it represents a very dangerous and rapidly escalating situation. Understanding the conditions that lead to flashover is essential for predicting and preventing catastrophic fire events."},"example_sentences":[{"sentence":"The rapid increase in temperature was a clear indication that a **flashover** was imminent.","translation":"急激な温度上昇は、フラッシュオーバーが差し迫っていることを明確に示していた。","type":"noun","meaning_category":"爆燃現象"},{"sentence":"Proper ventilation techniques can help delay or prevent **flashover**.","translation":"適切な換気技術は、フラッシュオーバーを遅らせたり、防いだりするのに役立つ。","type":"noun","meaning_category":"爆燃現象"},{"sentence":"The fire **flashed over** the entire room in seconds.","translation":"火は数秒で部屋全体にフラッシュオーバーを起こした。","type":"verb","meaning_category":"フラッシュオーバーを起こす"}]}