{"word":"leaker","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(情報)漏洩者、リークする人","english_definition":"a person who discloses secret or confidential information to the public or to unauthorized parties.","examples":[{"sentence":"The company is trying to identify the leaker who revealed the new product designs.","translation":"会社は、新製品のデザインを明らかにした情報漏洩者を特定しようとしています。"},{"sentence":"The government official was accused of being a leaker and faced severe consequences.","translation":"その政府高官は、情報漏洩者であると非難され、厳しい結果に直面しました。"},{"sentence":"Journalists often rely on leakers to uncover important stories.","translation":"ジャーナリストは、重要な記事を明らかにするために、情報漏洩者に頼ることがよくあります。"}],"collocations":["identify a leaker (情報漏洩者を特定する)","prosecute a leaker (情報漏洩者を起訴する)","hunt for a leaker (情報漏洩者を探す)","find a leaker (情報漏洩者を見つける)"],"synonyms":["whistleblower","informant","source","mole"],"antonyms":["confidant","keeper of secrets"],"related_words":["leak (動詞: 漏洩する、名詞: 漏洩)","leakage (名詞: 漏洩)"]}],"etymology":{"value":"The word 'leaker' is derived from the verb 'leak,' meaning to unintentionally or deliberately allow secret information to become known. The suffix '-er' is added to indicate a person who performs the action.","priority":"★★★"},"pronunciation":{"ipa":"/ˈliːkər/","syllables":"leak-er"},"inflection":{"noun_plural":"leakers"},"usage_notes":{"explanation":"The term 'leaker' is typically used in contexts involving sensitive or confidential information, such as government secrets, corporate strategies, or personal data. The act of leaking information is often considered unethical or illegal, depending on the nature of the information and the laws of the jurisdiction. However, in some cases, leakers may be seen as whistleblowers who expose wrongdoing or corruption in the public interest.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The leaker is very leak.","correct":"The leaker is very secretive.","note":"'Leak' is a verb or noun, not an adjective to describe a person. Use 'secretive' or similar adjectives instead."},{"incorrect":"He is a big leak.","correct":"He is a big leaker.","note":"'Leak' refers to the act of leaking, while 'leaker' refers to the person."}],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but usage has increased in recent years due to increased media coverage of information leaks.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'leaker' refers to someone who secretly shares private or confidential information. It's often used in news stories about government or corporate secrets being revealed. This word is more common in professional or political discussions rather than everyday conversation."},"example_sentences":[{"sentence":"The identity of the **leaker** remains unknown.","translation":"情報漏洩者の身元は不明のままである。","type":"noun","meaning_category":"情報漏洩者"},{"sentence":"The company fired the employee suspected of being a **leaker**.","translation":"会社は、情報漏洩者である疑いのある従業員を解雇した。","type":"noun","meaning_category":"情報漏洩者"},{"sentence":"The **leaker** provided the documents to the press anonymously.","translation":"情報漏洩者は、匿名で報道機関に文書を提供した。","type":"noun","meaning_category":"情報漏洩者"}]}