{"word":"contrariously","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"反対に、逆らって、反抗的に","english_definition":"in a contrary or opposing manner; perversely; stubbornly.","examples":[{"sentence":"He acted contrariously, doing the opposite of what he was told.","translation":"彼は指示されたことと反対のことをして、反抗的な態度をとった。"},{"sentence":"Contrariously, she insisted on going out despite the bad weather.","translation":"反対に、彼女は悪天候にもかかわらず外出すると主張した。"},{"sentence":"The child behaved contrariously, refusing to cooperate with the teacher.","translation":"その子供は反抗的に振る舞い、先生に協力することを拒んだ。"}],"collocations":["act contrariously","behave contrariously","insist contrariously"],"synonyms":["perversely","obstinately","stubbornly","defiantely","rebelliously","adversely","oppositely"],"antonyms":["agreeably","cooperatively","obediently","compliantly"]}],"etymology":{"value":"'Contrary' + '-ously'. The word 'contrary' comes from Latin 'contrarius' meaning 'opposite, opposed'.","priority":"★★☆"},"pronunciation":{"ipa":"/kənˈtreəriəsli/","syllables":"con-trar-i-ous-ly"},"inflection":{"notes":"This is an adverb, so it does not inflect."},"usage_notes":{"explanation":"'Contrariously' describes actions or behaviors done in a way that opposes or contradicts what is expected or desired. It often implies a deliberate or stubborn resistance to guidance or expectations. It's stronger than simply disagreeing; it suggests an intent to be difficult or uncooperative.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She contrariously felt happy.","correct":"✓ She felt contrarily happy.","note":"'Contrariously' describes an action, not a feeling. Use 'contrarily' to modify the feeling itself, though this is less common than other phrasing."},{"incorrect":"✗ He contrariously to the rules.","correct":"✓ He acted contrariously to the rules. / ✓ He acted in a contrary manner to the rules.","note":"'Contrariously' is an adverb and needs a verb to modify. It describes *how* someone acts, not the direct object of their action."}],"priority":"★☆☆"},"related_words":{"derivatives":["contrary (adjective, noun)","contrariness (noun)","contrarily (adverb)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Contrariously' means doing something in a way that is opposite or against what is expected or desired. It suggests a deliberate act of opposition or stubbornness. It is not a common word, and you'll mostly find it in formal writing or when describing someone who is intentionally difficult or uncooperative. For example, 'He contrariously refused to follow the instructions, even though it would have made things easier.'"},"example_sentences":[{"sentence":"The cat, contrariously, preferred to sleep on the cold floor rather than the soft bed.","translation":"その猫は、反対に、柔らかいベッドよりも冷たい床で寝ることを好んだ。","type":"adverb","meaning_category":"反対に"},{"sentence":"She argued contrariously, taking the opposite position just to provoke a reaction.","translation":"彼女は反抗的に議論し、ただ反応を引き起こすために反対の立場をとった。","type":"adverb","meaning_category":"逆らって"},{"sentence":"He behaved contrariously, ignoring all advice and doing exactly what he wanted.","translation":"彼は反抗的に振る舞い、すべてのアドバイスを無視して、自分がしたいことだけをした。","type":"adverb","meaning_category":"反抗的に"}]}