{"word":"Undoneness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"未完了の状態、未完成であること","english_definition":"The state of being incomplete or unfinished.","examples":[{"sentence":"The undoneness of the project caused frustration among the team members.","translation":"プロジェクトの未完了状態は、チームメンバー間に不満を引き起こした。"},{"sentence":"The chef apologized for the undoneness of the meat.","translation":"シェフは肉の焼き加減が不十分であったことを謝罪した。"},{"sentence":"The undoneness of her homework meant she had to stay up late to finish it.","translation":"彼女の宿題が未完成だったため、それを終えるために夜遅くまで起きていなければならなかった。"}],"collocations":["state of undoneness","degree of undoneness","feeling of undoneness"],"synonyms":["incompleteness","unfinished state","lack of completion","imperfectness"],"antonyms":["completeness","finished state","perfection","thoroughness"]}],"etymology":{"value":"Derived from the adjective 'undone' (not done) by adding the suffix '-ness' to form a noun.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈdʌnnəs/","syllables":"un-dun-ness"},"inflection":{"noun_plural":"undonenesses (rarely used)"},"usage_notes":{"explanation":"'Undoneness' is a relatively uncommon noun that describes the state or quality of something being incomplete or not fully executed. It is often used to refer to tasks, projects, or even food preparation that has not been brought to a satisfactory conclusion. The word emphasizes the lack of completion rather than the process of becoming complete.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The undoneness is very bad.","correct":"✓ The degree of undoneness is very high.","note":"'Undoneness' is a state, so it's better to describe the degree or extent of it rather than directly modifying it with adjectives like 'bad' or 'good'."},{"incorrect":"✗ I have a undoneness of my homework.","correct":"✓ My homework is in a state of undoneness.","note":"Use a phrase like 'state of undoneness' to properly convey the meaning."}],"priority":"★☆☆"},"related_words":{"derivatives":["undone (adjective)","do (verb)","done (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Undoneness' is a less common, more abstract noun. It means the state of something not being finished or complete. You might use it to describe a project that is still in progress or food that is not fully cooked. Because it's not frequently used, simpler terms like 'incompleteness' or 'unfinished state' are often preferred in everyday conversation."},"example_sentences":[{"sentence":"The persistent feeling of **undoneness** haunted her as she reviewed the unfinished manuscript.","translation":"未完成であるという持続的な感覚が、彼女が未完成の原稿を見直す際に彼女を悩ませた。","type":"noun","meaning_category":"未完了の状態"},{"sentence":"The **undoneness** of the renovations was apparent in the exposed wiring and unpainted walls.","translation":"改修工事の未完了の状態は、むき出しの配線や塗装されていない壁にはっきりと現れていた。","type":"noun","meaning_category":"未完成であること"},{"sentence":"He attributed the project's failure to the general **undoneness** of the planning phase.","translation":"彼はプロジェクトの失敗を、計画段階全般の未完成さに起因すると考えた。","type":"noun","meaning_category":"未完了の状態"}]}