{"word":"biformity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"二つの形を持つこと、二形性","english_definition":"The state or condition of having two forms or shapes.","examples":[{"sentence":"The biformity of the Roman god Janus, with faces looking in opposite directions, symbolizes beginnings and endings.","translation":"ローマ神ヤヌスが反対方向を向いた二つの顔を持つ二形性は、始まりと終わりを象徴しています。"},{"sentence":"Some insects exhibit biformity in their larval stages.","translation":"幼虫期に二形性を示す昆虫もいます。"}],"collocations":["exhibit biformity","display biformity","structural biformity"],"synonyms":["dimorphism","duality","double form"],"antonyms":["uniformity","monomorphism"]}],"etymology":{"value":"From 'bi-' (two) + 'form' (shape, form) + '-ity' (state, condition).","priority":"★★☆"},"pronunciation":{"ipa":"/baɪˈfɔːrmɪti/","syllables":"bi-for-mi-ty"},"inflection":{"noun_plural":"biformities"},"usage_notes":{"explanation":"'Biformity' is a relatively uncommon term, often used in scientific or mythological contexts to describe something that exists in two distinct forms. It's more specific than 'dimorphism,' which can also refer to differences in color or size, while 'biformity' typically refers to shape.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The biformity of the data made it difficult to analyze.","correct":"The bimodality of the data made it difficult to analyze.","note":"'Biformity' refers to shape, while 'bimodality' refers to having two modes or peaks in a distribution, which is more appropriate in the context of data analysis."}],"priority":"★☆☆"},"related_words":{"derivatives":["biform (adjective: having two forms)"],"related_terms":["dimorphism","polymorphism"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Biformity' is a specialized term that describes the condition of having two distinct forms or shapes. This word is rarely encountered in everyday language and is more likely to appear in scientific or academic contexts, particularly in fields like biology or mythology. Understanding this term requires a strong vocabulary and familiarity with abstract concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"The artist explored the concept of biformity in their sculpture, creating a piece that appeared both human and animal.","translation":"そのアーティストは彫刻で二形性の概念を探求し、人間と動物の両方に見える作品を制作しました。","type":"general","meaning_category":"artistic representation"},{"sentence":"Certain species of fungi exhibit biformity, existing as both yeast and mold depending on environmental conditions.","translation":"特定の種類の菌類は二形性を示し、環境条件に応じて酵母とカビの両方として存在します。","type":"scientific","meaning_category":"biology"}]}