{"word":"patellofemoral","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"膝蓋大腿関節の、膝蓋骨と大腿骨に関する","english_definition":"Relating to the patella (kneecap) and the femur (thigh bone), specifically referring to the patellofemoral joint.","examples":[{"sentence":"Patellofemoral pain syndrome is a common cause of knee pain.","translation":"膝蓋大腿関節痛症候群は、膝の痛みの一般的な原因です。"},{"sentence":"The patellofemoral joint is where the kneecap articulates with the thigh bone.","translation":"膝蓋大腿関節は、膝蓋骨が大腿骨と連結する場所です。"}],"collocations":["patellofemoral joint","patellofemoral pain syndrome","patellofemoral instability"],"synonyms":["knee joint","kneecap"],"antonyms":[]}],"etymology":{"value":"Derived from the combination of 'patella' (kneecap) and 'femoral' (relating to the femur or thigh bone).","priority":"★★★"},"pronunciation":{"ipa":"/pəˌtel.oʊˈfɛm.ər.əl/","syllables":"pa-tel-o-fem-or-al"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"The term 'patellofemoral' is primarily used in medical and anatomical contexts to describe structures, conditions, or treatments related to the joint formed by the patella (kneecap) and the femur (thigh bone). It is often encountered in discussions of knee pain, injuries, and related musculoskeletal issues.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ patellafemoral","correct":"✓ patellofemoral","note":"It's important to include the 'o' between 'patella' and 'femoral'."}],"priority":"★★☆"},"related_words":{"derivatives":["patella","femur","patellofemoral joint","patellofemoral pain syndrome"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Patellofemoral' is a specialized medical term used to describe the relationship between the patella (kneecap) and the femur (thigh bone). It is primarily encountered in medical or anatomical contexts. Understanding this term is essential for comprehending discussions related to knee joint mechanics, injuries, and conditions such as patellofemoral pain syndrome. Due to its technical nature, it is more commonly used and understood by healthcare professionals and those with a background in anatomy or medicine."},"example_sentences":[{"sentence":"Treatment for patellofemoral pain syndrome often includes physical therapy.","translation":"膝蓋大腿関節痛症候群の治療には、理学療法がよく含まれます。","type":"general","meaning_category":"Medical"},{"sentence":"The doctor examined the patellofemoral joint for signs of arthritis.","translation":"医師は関節炎の兆候がないか膝蓋大腿関節を診察した。","type":"general","meaning_category":"Medical"}]}