{"word":"blowby","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(エンジン内の)ブローバイガス、吹き抜けガス","english_definition":"(in an internal combustion engine) the leakage of combustion gases past the piston rings into the crankcase during normal engine operation.","examples":[{"sentence":"Excessive blowby can indicate worn piston rings.","translation":"過剰なブローバイガスは、ピストンリングの摩耗を示している可能性がある。"},{"sentence":"The blowby gases are then routed back into the intake manifold.","translation":"ブローバイガスは、その後、吸気マニホールドに戻される。"}],"collocations":["excessive blowby","blowby gas recirculation"],"synonyms":["crankcase ventilation","leakage"],"antonyms":[]},{"part_of_speech":"noun","definition":"(タイヤの)エア漏れ、空気漏れ","english_definition":"The escape of compressed air from a pneumatic tire or other pressurized system.","examples":[{"sentence":"The driver experienced blowby during the race, causing a flat tire.","translation":"ドライバーはレース中にエア漏れを経験し、タイヤがパンクした。"}],"collocations":[],"synonyms":["air leak","pressure loss"],"antonyms":[]}],"etymology":{"value":"'Blow' + 'by'. Refers to the gases or air 'blowing by' the intended seal or barrier.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbloʊbaɪ/","syllables":"blow-by"},"inflection":{"noun_plural":"blowbys"},"usage_notes":{"explanation":"'Blowby' typically refers to the unwanted leakage of gases or air. In the context of engines, it's specifically the combustion gases that escape past the piston rings. In the context of tires or pressurized systems, it refers to air leakage.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Blowby' is a technical term primarily used in automotive engineering and mechanics. It refers to the leakage of combustion gases in an engine or air leakage in a tire. Understanding requires familiarity with these contexts."},"example_sentences":[{"sentence":"The mechanic checked the engine for signs of excessive blowby.","translation":"整備士は、エンジンの過剰なブローバイガスの兆候がないか確認した。","type":"noun","meaning_category":"ブローバイガス"},{"sentence":"The sudden blowby caused the tire to deflate rapidly.","translation":"突然のエア漏れにより、タイヤは急速に空気が抜けた。","type":"noun","meaning_category":"エア漏れ"}]}