{"word":"alpha-blocker","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"アルファ遮断薬、α遮断薬","english_definition":"A type of medication that blocks alpha receptors, leading to relaxation of certain muscles and improved blood flow.","examples":[{"sentence":"My doctor prescribed an alpha-blocker to help manage my high blood pressure.","translation":"私の医者は、高血圧の管理を助けるためにアルファ遮断薬を処方しました。"},{"sentence":"Alpha-blockers are commonly used to treat benign prostatic hyperplasia (BPH).","translation":"アルファ遮断薬は、一般的に良性前立腺肥大症（BPH）の治療に使用されます。"}],"collocations":["prescribe alpha-blockers (アルファ遮断薬を処方する)","take alpha-blockers (アルファ遮断薬を服用する)","side effects of alpha-blockers (アルファ遮断薬の副作用)","selective alpha-blocker (選択的アルファ遮断薬)"],"synonyms":["alpha-adrenergic antagonist","alpha-adrenergic blocker"],"antonyms":[]}],"etymology":{"value":"The term 'alpha-blocker' is derived from its function: it 'blocks' the effects of alpha-adrenergic receptors in the body.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈælfə ˈblɒkər/","syllables":"al-pha-block-er"},"inflection":{"noun_plural":"alpha-blockers"},"usage_notes":{"explanation":"Alpha-blockers are primarily used to treat conditions related to high blood pressure and prostate enlargement. They work by relaxing certain muscles, which can improve blood flow and reduce urinary symptoms. It's important to note that alpha-blockers can have side effects, so they should only be taken under the guidance of a healthcare professional.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I started taking alpha-blocker for my cold.","correct":"✓ I started taking alpha-blockers for my enlarged prostate.","note":"Alpha-blockers are not used to treat colds. They are typically prescribed for conditions like high blood pressure or prostate issues."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'alpha-blocker' refers to a specific type of medication used to treat certain medical conditions, primarily related to blood pressure and prostate issues. Understanding this term requires some knowledge of pharmacology and medical terminology. It is not a commonly used term in everyday conversation and is more likely to be encountered in medical contexts or discussions about medication.","priority":"★★☆"},"example_sentences":[{"sentence":"The alpha-blocker helped to lower my blood pressure significantly.","translation":"アルファ遮断薬は私の血圧を大幅に下げるのに役立ちました。","type":"medical","meaning_category":"treatment"},{"sentence":"He experienced dizziness as a side effect of the alpha-blocker.","translation":"彼はアルファ遮断薬の副作用としてめまいを経験しました。","type":"medical","meaning_category":"side effects"}]}