{"word":"self-infliction","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"自己への加害、自傷行為","english_definition":"The act of deliberately harming oneself.","examples":[{"sentence":"Self-infliction is often a sign of deep emotional distress.","translation":"自傷行為は、しばしば深刻な精神的苦痛の兆候です。"},{"sentence":"The causes of self-infliction are complex and varied.","translation":"自傷行為の原因は複雑で多様です。"},{"sentence":"Support groups can be helpful for individuals struggling with self-infliction.","translation":"自傷行為に苦しむ人々にとって、支援グループは役立つことがあります。"}],"collocations":["self-infliction behavior","acts of self-infliction","patterns of self-infliction"],"synonyms":["self-harm","self-injury","self-mutilation"],"antonyms":["self-care","self-preservation"]}],"etymology":{"value":"The word is formed from 'self' (referring to oneself) and 'infliction' (the act of causing something unpleasant).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌselfɪnˈflɪkʃən/","syllables":"self-in-flic-tion"},"inflection":{"noun_plural":"self-inflictions"},"usage_notes":{"explanation":"'Self-infliction' is a formal term often used in medical or psychological contexts to describe the act of deliberately harming oneself. It's important to use this term with sensitivity and understanding, recognizing that it often stems from underlying emotional or psychological issues. While 'self-harm' and 'self-injury' are more commonly used in everyday language, 'self-infliction' can convey a more clinical or detached perspective.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He did a self-infliction.","correct":"✓ He engaged in self-infliction. / ✓ He self-inflicted.","note":"'Self-infliction' is a noun, so it's more accurate to say someone 'engaged in self-infliction' or to use the verb form 'self-inflict'."},{"incorrect":"✗ Self-infliction is always suicidal.","correct":"✓ Self-infliction is not always suicidal.","note":"It's important to remember that self-infliction is not always a suicide attempt. It can be a coping mechanism for dealing with intense emotions."}],"priority":"★★☆"},"related_words":{"derivatives":["self-inflicted (adjective: caused by oneself)"],"phrasal_verbs":[],"related_terms":["suicide","depression","anxiety","mental health","coping mechanism"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Self-infliction' is a formal term referring to the deliberate act of harming oneself. It's often used in clinical or academic contexts when discussing mental health and self-harm. Understanding this term is important for comprehending discussions about mental health issues and the various ways individuals may cope with emotional distress. It's crucial to remember that self-infliction is a complex issue and should be approached with sensitivity and understanding."},"example_sentences":[{"sentence":"The doctor noted the patient's history of self-infliction.","translation":"医師は患者の自傷行為の既往歴を記録しました。","type":"noun","meaning_category":"Self-harm"},{"sentence":"Understanding the reasons behind self-infliction is crucial for effective treatment.","translation":"自傷行為の背後にある理由を理解することは、効果的な治療のために重要です。","type":"noun","meaning_category":"Self-harm"},{"sentence":"Self-infliction can be a way for some individuals to cope with overwhelming emotions.","translation":"自傷行為は、圧倒的な感情に対処するための手段となることがあります。","type":"noun","meaning_category":"Self-harm"}]}