{"word":"RMR","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(医学)安静時代謝量 (Resting Metabolic Rate)","english_definition":"Resting Metabolic Rate: The amount of energy (calories) your body burns when it is at complete rest.","examples":[{"sentence":"The doctor measured my RMR to determine my daily calorie needs.","translation":"医師は私の1日のカロリー必要量を決定するために、私のRMRを測定しました。"},{"sentence":"Factors like age, sex, and muscle mass can affect your RMR.","translation":"年齢、性別、筋肉量などの要因はRMRに影響を与える可能性があります。"}],"collocations":["measure RMR","calculate RMR","increase RMR","decrease RMR"],"synonyms":["basal metabolic rate (BMR)"],"antonyms":[]}],"etymology":{"value":"An acronym formed from the initial letters of 'Resting Metabolic Rate'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɑːrˌemˈɑːr/","syllables":"Ar-Em-Ar"},"inflection":{},"usage_notes":{"explanation":"RMR is often used interchangeably with Basal Metabolic Rate (BMR), although RMR is generally easier to measure and slightly higher than BMR. It represents the energy your body uses for basic functions like breathing, circulation, and cell maintenance while at rest.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":[],"related_terms":["metabolism","calorie","energy expenditure","body composition"],"priority":"★★★"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"RMR (Resting Metabolic Rate) is a technical term used in the fields of medicine, nutrition, and fitness. It refers to the amount of energy, measured in calories, that your body uses while at complete rest. Understanding RMR is important for managing weight, planning diets, and assessing overall health. While similar to BMR (Basal Metabolic Rate), RMR is typically measured under less strict conditions.","priority":"★★★"},"example_sentences":[{"sentence":"Understanding your RMR can help you create an effective weight loss plan.","translation":"自分のRMRを理解することは、効果的な減量計画を作成するのに役立ちます。","type":"general","meaning_category":"definition"},{"sentence":"Regular exercise can help increase your RMR.","translation":"定期的な運動はRMRを上げるのに役立ちます。","type":"general","meaning_category":"effect of exercise"},{"sentence":"The dietitian used my RMR to calculate my personalized calorie requirements.","translation":"栄養士は私のRMRを使って、私個人のカロリー必要量を計算しました。","type":"general","meaning_category":"use in diet planning"}]}