{"word":"COFIGHTER","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A fellow fighter; someone who fights alongside another.","english_definition":"A person who fights alongside another, especially in a military or political context.","examples":[{"sentence":"He considered his fellow soldiers his cofighters in the battle against tyranny.","translation":"彼は、仲間の兵士たちを、圧政との戦いにおける協力者だと考えていた。"},{"sentence":"The activists saw themselves as cofighters in the struggle for social justice.","translation":"活動家たちは、自分たちを社会正義のための闘争における協力者だと考えていた。"}],"collocations":["fellow cofighter","political cofighter","military cofighter"],"synonyms":["ally","comrade","associate","partner","collaborator"],"antonyms":["opponent","enemy","adversary"]}],"etymology":{"value":"Formed by combining the prefix 'co-' (meaning 'together' or 'jointly') with the noun 'fighter'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkoʊˈfaɪtər/","syllables":"co-fight-er"},"inflection":{"noun_plural":"COFIGHTERS"},"usage_notes":{"explanation":"The term 'COFIGHTER' emphasizes the collaborative nature of fighting or struggling towards a common goal. It is often used to describe individuals who are united in their efforts, whether in a physical conflict or a more abstract battle, such as a political or social movement.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is my co-fighter in the war.","correct":"✓ He is my cofighter in the war.","note":"The word is written as one word, without a hyphen."}],"priority":"★☆☆"},"related_words":{"derivatives":["co-fight (verb)"],"related_terms":["fighter","combatant","warrior","activist","supporter"]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'COFIGHTER' is a relatively uncommon word that combines 'co-' (meaning 'together') with 'fighter'. It describes someone who fights alongside another person or group, often in a shared cause or struggle. The word implies a sense of camaraderie and shared purpose. Due to its relative rarity, it's more likely to be encountered in formal writing or specialized contexts rather than everyday conversation."},"example_sentences":[{"sentence":"The resistance members saw each other as brave COFIGHTERS against the oppressive regime.","translation":"抵抗勢力のメンバーは、互いを抑圧的な政権に対する勇敢な協力者とみなしていた。","type":"noun","meaning_category":"fellow fighter"},{"sentence":"As political COFIGHTERS, they organized rallies and protests to advocate for their cause.","translation":"政治的な協力者として、彼らは集会や抗議活動を組織し、自分たちの主張を訴えた。","type":"noun","meaning_category":"fellow fighter"}]}