{"word":"Bohairic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"ボハイラ方言の、ボハイラ語の","english_definition":"Relating to or written in the Bohairic dialect of the Coptic language.","examples":[{"sentence":"The Bohairic version of the Gospel of John is an important source for textual criticism.","translation":"ヨハネ福音書のボハイラ語版は、本文批評の重要な資料である。"}],"collocations":["Bohairic dialect","Bohairic Coptic","Bohairic version"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"ボハイラ語 (コプト語の方言の一つ)","english_definition":"The Bohairic dialect of the Coptic language, used liturgically by the Coptic Orthodox Church.","examples":[{"sentence":"Bohairic is still used in the Coptic Orthodox Church.","translation":"ボハイラ語は現在でもコプト正教会で使用されている。"}],"collocations":["speak Bohairic","read Bohairic","study Bohairic"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from Arabic البحيري (al-buhairi), meaning 'of the Lake', referring to the Lake Mareotis region in Lower Egypt where the dialect originated.","priority":"★★★"},"pronunciation":{"ipa":"/boʊˈhɛərɪk/","syllables":"Bo-hair-ic"},"inflection":{"notes":"N/A"},"usage_notes":{"explanation":"Bohairic is primarily used in religious contexts within the Coptic Orthodox Church. It is one of the best-attested dialects of the Coptic language and is important for understanding the history and development of Coptic.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Bohairic is a language spoken in Ethiopia.","correct":"✓ Bohairic is a dialect of Coptic spoken in Egypt.","note":"Bohairic is a dialect of Coptic, primarily associated with Egypt, not Ethiopia."}],"priority":"★★☆"},"related_words":{"derivatives":["Coptic","Sahidic","Akhmimic"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'Bohairic' refers to a specific dialect of the Coptic language, primarily used in liturgical contexts within the Coptic Orthodox Church. Understanding its significance requires knowledge of Coptic language history and religious practices. It's not a commonly used term outside of specialized academic or religious contexts."},"example_sentences":[{"sentence":"Many Coptic hymns are written in Bohairic.","translation":"多くのコプト聖歌はボハイラ語で書かれている。","type":"noun","meaning_category":"ボハイラ語"},{"sentence":"The Bohairic lectionary contains readings for the entire liturgical year.","translation":"ボハイラ語聖書日課は、典礼暦全体の朗読を含む。","type":"adjective","meaning_category":"ボハイラ方言の"}]}