{"word":"subjectibility","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"感受性、影響を受けやすさ、被影響性","english_definition":"The state or quality of being subjectible; the capacity or tendency to be affected or influenced by something.","examples":[{"sentence":"The patient's subjectibility to infection was increased due to their weakened immune system.","translation":"患者の免疫系が弱っていたため、感染症に対する感受性が高まっていた。"},{"sentence":"The material's subjectibility to corrosion makes it unsuitable for use in marine environments.","translation":"その材料の腐食に対する被影響性から、海洋環境での使用には適さない。"},{"sentence":"His subjectibility to flattery made him an easy target for manipulation.","translation":"彼はお世辞に弱いため、操縦の標的にされやすかった。"}],"collocations":["subjectibility to influence (影響を受けやすさ)","subjectibility to disease (病気に対する感受性)","subjectibility to change (変化に対する感受性)","increased subjectibility (感受性の増加)","high subjectibility (高い感受性)","low subjectibility (低い感受性)"],"synonyms":["susceptibility","vulnerability","sensitivity","receptivity","penetrability","openness","liability"],"antonyms":["insusceptibility","immunity","resistance","invulnerability","impenetrability","indifference","apathy"]}],"etymology":{"value":"Formed from 'subjectible' (capable of being subjected) + '-ity' (state, condition, or quality). 'Subjectible' is derived from 'subject' (to bring under control or dominion; to expose to) + '-ible' (capable of).","priority":"★★☆"},"pronunciation":{"ipa":"/sʌbˌdʒɛktɪˈbɪləti/","syllables":"sub-jec-ti-bil-i-ty"},"inflection":{"noun_plural":"subjectibilities"},"usage_notes":{"explanation":"'Subjectibility' is a relatively uncommon word that describes the degree to which something or someone is likely to be affected or influenced by something else. It is closely related to 'susceptibility' but is less frequently used. It emphasizes the inherent capacity or tendency to be acted upon or influenced. It is often used in scientific or technical contexts to describe the properties of materials or the condition of organisms.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The subjectibility of the experiment.","correct":"✓ The validity of the experiment is questionable. / The experiment is subject to error.","note":"'Subjectibility' refers to the *capacity* to be influenced, not the state of being influenced. Therefore, it's often misused when referring to the quality or validity of something. Use 'validity,' 'reliability,' or rephrase to indicate that the experiment is 'subject to' certain factors."},{"incorrect":"✗ His subjectibility was very high, so he caught a cold.","correct":"✓ His susceptibility was very high, so he caught a cold.","note":"'Susceptibility' is more commonly used in general contexts, especially when referring to health and disease. While 'subjectibility' is technically correct, 'susceptibility' is the more idiomatic and widely understood choice."}],"priority":"★★☆"},"related_words":{"derivatives":["subjectible (adjective: capable of being subjected)","subject (verb: to bring under control or dominion; to expose to; noun: a person or thing that is being discussed, described, or dealt with)","subjective (adjective: based on or influenced by personal feelings, tastes, or opinions)","subjection (noun: the act of subjecting someone or something to one's control or dominion)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (rare and technical vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Subjectibility' is a formal and uncommon noun that refers to the quality of being easily affected or influenced by something. It is similar to 'susceptibility' but is used less frequently. This word is often found in scientific, medical, or technical contexts when describing the properties of materials or the conditions of organisms. Understanding this word requires a strong vocabulary and familiarity with abstract concepts. It is not typically used in everyday conversation."},"example_sentences":[{"sentence":"The metal's high subjectibility to heat made it unsuitable for use in the engine.","translation":"その金属は熱に対する感受性が高いため、エンジンでの使用には適さなかった。","type":"noun","meaning_category":"Material Properties"},{"sentence":"The child's increased subjectibility to peer pressure led to some poor decisions.","translation":"その子供の仲間からのプレッシャーに対する感受性が高まったため、いくつかの誤った判断をしてしまった。","type":"noun","meaning_category":"Psychological Influence"},{"sentence":"The study examined the subjectibility of different plant species to the effects of acid rain.","translation":"その研究では、さまざまな植物種における酸性雨の影響に対する感受性を調べた。","type":"noun","meaning_category":"Environmental Science"},{"sentence":"The software's subjectibility to hacking attempts was a major concern for the company.","translation":"そのソフトウェアのハッキング試行に対する被影響性は、会社にとって大きな懸念事項だった。","type":"noun","meaning_category":"Computer Security"}]}