{"word":"recolonized","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"再植民地化する、再び植民地とする","english_definition":"to colonize again; to establish or re-establish control over a territory or people.","examples":[{"sentence":"After a period of independence, the country was recolonized by a neighboring power.","translation":"独立期間の後、その国は隣国によって再植民地化された。"},{"sentence":"Some historians argue that certain economic policies effectively recolonized the developing world.","translation":"一部の歴史家は、特定の経済政策が発展途上国を事実上再植民地化したと主張している。"}],"collocations":["be recolonized by","recolonize a territory","recolonize a people"],"synonyms":["re-occupied","re-controlled","re-subjugated"],"antonyms":["decolonized","liberated","freed"]}],"etymology":{"value":"The word is formed by adding the prefix 're-' (meaning 'again') to the word 'colonized'. 'Colonized' itself comes from 'colony', which originates from the Latin word 'colonia', meaning 'settlement' or 'farm'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˈkɒlənaɪzd/","syllables":"re-col-o-nized"},"inflection":{"verb_forms":{"present_simple":["recolonize","recolonizes"],"past_simple":"recolonized","past_participle":"recolonized","present_participle":"recolonizing"}},"usage_notes":{"explanation":"'Recolonized' implies a process where a territory or people, having previously been a colony or under external control, and perhaps having gained independence, is once again brought under colonial rule or similar forms of domination. It often carries negative connotations, suggesting a loss of sovereignty or autonomy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The country recolonized itself.","correct":"✓ The country was recolonized by another nation.","note":"Recolonization typically involves an external power exerting control, not a country recolonizing itself. It's usually a passive process for the territory being recolonized."},{"incorrect":"✗ The city was recolonized with new buildings.","correct":"✓ The city was rebuilt with new buildings.","note":"'Recolonized' refers to political or economic control, not simply rebuilding or repopulating a place."}],"priority":"★☆☆"},"related_words":{"derivatives":["recolonization (noun: the act of recolonizing)","recolonizer (noun: one who recolonizes)"],"related_terms":["colonialism","imperialism","neo-colonialism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Recolonized' is a relatively rare and complex term, primarily used in historical, political, and academic contexts. It describes the act of establishing or re-establishing control over a territory or people, often after a period of independence or autonomy. Understanding this word requires familiarity with concepts of colonialism, imperialism, and power dynamics between nations."},"example_sentences":[{"sentence":"The island was initially colonized by Europeans in the 18th century and then **recolonized** after a brief period of self-governance.","translation":"その島は18世紀にヨーロッパ人によって最初に植民地化され、その後、短い自治期間を経て再植民地化された。","type":"verb","meaning_category":"再植民地化する"},{"sentence":"Critics argue that international trade agreements have **recolonized** many developing nations through economic dependence.","translation":"批評家たちは、国際貿易協定が経済的依存を通じて多くの発展途上国を再植民地化したと主張している。","type":"verb","meaning_category":"再植民地化する"}]}