{"word":"Magianism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"マギ教、ゾロアスター教","english_definition":"A term sometimes used to refer to Zoroastrianism, particularly in its later forms, or to related religious traditions of ancient Persia.","examples":[{"sentence":"Magianism was the dominant religion in Persia before the advent of Islam.","translation":"イスラム教が到来する前、マギ教はペルシャにおける支配的な宗教でした。"},{"sentence":"The priests of Magianism were known as Magi.","translation":"マギ教の司祭はマギとして知られていました。"}],"collocations":["ancient Magianism","Persian Magianism","beliefs of Magianism","priests of Magianism"],"synonyms":["Zoroastrianism","Mazdaism","Parsiism"],"antonyms":[]}],"etymology":{"value":"Derived from 'Magi', the name for the priestly caste in ancient Persia who practiced Zoroastrianism. The term 'Magianism' was later used to refer to their religious system.","priority":"★★★"},"pronunciation":{"ipa":"/meɪˈdʒeɪnɪzəm/","syllables":"Ma-gi-an-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Magianism' is often used interchangeably with 'Zoroastrianism', but sometimes it refers more specifically to the later, possibly syncretic, forms of Zoroastrianism that developed over time. The term can also broadly refer to any of the religious practices associated with the Magi.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Magianism is a modern religion.","correct":"✓ Magianism was an ancient religion.","note":"Magianism, or Zoroastrianism, originated in ancient Persia."},{"incorrect":"✗ Magianism is the same as Judaism.","correct":"✓ Magianism is a distinct religion from Judaism.","note":"Magianism is a distinct religion with its own unique beliefs, although it may have influenced other religions."}],"priority":"★★☆"},"related_words":{"derivatives":["Magian (noun/adjective)","Magi (plural noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Magianism' is a specialized term primarily used in historical or religious studies contexts. It refers to Zoroastrianism, particularly its ancient forms, and the religious practices associated with the Magi, the priestly class of ancient Persia. Understanding this term requires familiarity with ancient history and religious studies."},"example_sentences":[{"sentence":"Scholars debate the exact nature of early Magianism.","translation":"学者たちは初期のマギ教の正確な性質について議論しています。","type":"noun","meaning_category":"マギ教 (ゾロアスター教)"},{"sentence":"The Magi played a significant role in the rituals of Magianism.","translation":"マギはマギ教の儀式において重要な役割を果たしました。","type":"noun","meaning_category":"マギ教 (ゾロアスター教)"}]}