{"word":"palestric","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"古代ギリシアのレスリング場（パライストラ）に関する、またはそれに適した","english_definition":"Of or pertaining to the ancient Greek wrestling school (palaestra); suitable for wrestling.","examples":[{"sentence":"The palestric exercises were an important part of ancient Greek education.","translation":"古代ギリシアの教育において、レスリング場の練習は重要な一部でした。"},{"sentence":"The palestric style of wrestling emphasized technique and strategy.","translation":"レスリング場のスタイルは、技術と戦略を重視していました。"}],"collocations":["palestric exercises","palestric style","palestric education"],"synonyms":["athletic","gymnastic","wrestling-related"],"antonyms":["non-athletic","sedentary"]}],"etymology":{"value":"Derived from the Greek word 'palaistra', meaning 'wrestling school' or 'gymnasium'.","priority":"★★☆"},"pronunciation":{"ipa":"/pəˈlɛstrɪk/","syllables":"pa-les-tric"},"inflection":{"notes":"This is an adjective, so it does not inflect for number or gender."},"usage_notes":{"explanation":"The term 'palestric' is primarily used in historical or academic contexts when discussing ancient Greek athletics and education. It refers specifically to activities or styles associated with the palaestra, which was more than just a wrestling school; it was a place for physical and intellectual development.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He enjoyed palestric activities like reading and writing.","correct":"✓ He enjoyed palestric activities like wrestling and discus throwing.","note":"'Palestric' relates to athletic activities, not intellectual ones."}],"priority":"★☆☆"},"related_words":{"derivatives":["palaestra (noun): an ancient Greek wrestling school or gymnasium."],"related_terms":["gymnasium","athletics","wrestling","ancient Greece"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'palestric' is a specialized term primarily encountered in academic or historical discussions about ancient Greek athletics and education. It specifically refers to activities or styles associated with the palaestra, an ancient Greek wrestling school and gymnasium. Due to its limited usage and specific context, it is considered a high-level vocabulary word. Understanding its connection to the palaestra is crucial for accurate interpretation."},"example_sentences":[{"sentence":"The young men engaged in various palestric contests.","translation":"若者たちは様々なレスリング場の競技に参加した。","type":"adjective","meaning_category":"relating to wrestling schools"},{"sentence":"The palestric ideal emphasized both physical and mental discipline.","translation":"レスリング場の理想は、肉体的および精神的な鍛錬の両方を重視していた。","type":"adjective","meaning_category":"relating to wrestling schools"}]}