{"word":"precooled","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"予冷された、あらかじめ冷却された","english_definition":"Having been cooled beforehand.","examples":[{"sentence":"The precooled samples were ready for the experiment.","translation":"予冷されたサンプルは実験の準備ができていた。"},{"sentence":"We used precooled water to make the ice.","translation":"氷を作るために予冷された水を使った。"}],"collocations":["precooled sample","precooled water","precooled storage"],"synonyms":["chilled","cooled","refrigerated"],"antonyms":["heated","warmed"]}],"etymology":{"value":"The word \"precooled\" is formed by adding the prefix \"pre-\" (meaning before) to the word \"cooled\" (having been made cold).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːˈkuːld/","syllables":"pre-cooled"},"inflection":{"notes":"This is the past participle form of the verb \"precool\" used as an adjective. It does not have comparative or superlative forms."},"usage_notes":{"explanation":"\"Precooled\" describes something that has been cooled in advance, often to prepare it for a specific purpose such as storage, transportation, or an experiment. It emphasizes that the cooling process happened before the current state or use.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The precooled is ready.","correct":"✓ The precooled sample is ready.","note":"\"Precooled\" is an adjective and needs to modify a noun. Using it alone as a noun is incorrect."},{"incorrect":"✗ We precooled the water yesterday, so it is very cold now.","correct":"✓ We precooled the water yesterday, so it is precooled now.","note":"The first sentence is correct, but the second sentence is more concise and natural."}],"priority":"★★☆"},"related_words":{"derivatives":["precool (verb: to cool beforehand)","precooling (noun: the act of cooling beforehand)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Precooled\" is a relatively straightforward word. It combines the prefix \"pre-\" meaning \"before\" with the past participle \"cooled.\" It is used to describe something that has been cooled in advance. The word is most likely to appear in technical or scientific contexts.","example_sentences":[]},"example_sentences":[{"sentence":"The precooled ingredients were added to the mixture.","translation":"予冷された材料が混合物に加えられた。","type":"adjective","meaning_category":"descriptive"},{"sentence":"The precooled container helps maintain the temperature.","translation":"予冷された容器は温度を維持するのに役立つ。","type":"adjective","meaning_category":"functional"}]}