{"word":"propylaeum","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(古代ギリシア・ローマ建築における)神殿・聖域・宮殿などの入口を飾る壮大な門、前門、門廊","english_definition":"A monumental gateway or entrance to a temple, sanctuary, palace, or other important enclosure, typically consisting of a colonnade.","examples":[{"sentence":"The propylaeum of the Acropolis in Athens is a famous example of classical architecture.","translation":"アテネのアクロポリスのプロピュライアは、古典建築の有名な例です。"},{"sentence":"The architect designed a grand propylaeum to serve as the entrance to the museum.","translation":"建築家は、博物館の入り口として機能する壮大なプロピュライアを設計しました。"}],"collocations":["Acropolis propylaeum","grand propylaeum","design a propylaeum","build a propylaeum"],"synonyms":["gateway","entrance","portal","vestibule","portico","colonnade"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek προπύλαιον (propúlaion), from πρό (pró, “before, in front of”) + πύλη (púlē, “gate, entrance”). Literally, 'that which is before the gates'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌprɒpɪˈliːəm/","syllables":"prop-y-lae-um"},"inflection":{"noun_plural":"propylaea"},"usage_notes":{"explanation":"The term 'propylaeum' specifically refers to a monumental gateway, often featuring columns, that serves as the entrance to an important area such as a temple or palace. It is most commonly associated with ancient Greek and Roman architecture. It is not a general term for any entrance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The small archway served as the propylaeum to the garden.","correct":"✓ The grand archway served as the propylaeum to the garden.","note":"Propylaea are typically grand and monumental, not small or simple. If the archway is small, it's better to use terms like 'archway' or 'entrance'. "},{"incorrect":"✗ The propylaia was built in the 18th century.","correct":"✓ The propylaia was inspired by classical designs.","note":"Propylaea are most associated with ancient Greek and Roman architecture. While modern structures can be inspired by them, they are not commonly built in later periods."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["portico","colonnade","gateway","temple","acropolis"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Propylaeum' is a specialized architectural term referring to a monumental gateway, primarily associated with ancient Greek and Roman structures. Understanding its usage requires familiarity with classical architecture. It is not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"Visitors passed through the impressive propylaeum before entering the sacred grounds of the temple.","translation":"訪問者たちは、神殿の神聖な敷地に入る前に、印象的なプロピュライアを通過しました。","type":"noun","meaning_category":"entrance"},{"sentence":"The reconstruction of the ancient propylaeum provided valuable insights into the architectural techniques of the time.","translation":"古代のプロピュライアの再建は、当時の建築技術に関する貴重な洞察を提供しました。","type":"noun","meaning_category":"entrance"}]}