{"word":"anti-English","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"反英語の、英語嫌いの、英語に反対する","english_definition":"Opposed to or against the English language, culture, or people.","examples":[{"sentence":"The political group is known for its anti-English sentiment.","translation":"その政治団体は反英語感情で知られている。"},{"sentence":"Some believe that the policy is anti-English and discriminates against English speakers.","translation":"その政策は反英語的で、英語話者を差別していると考える人もいる。"}],"collocations":["anti-English sentiment","anti-English policy","anti-English propaganda"],"synonyms":["xenophobic towards English","opposed to English","against English"],"antonyms":["pro-English","anglophile","English-friendly"]},{"part_of_speech":"noun","definition":"反英語主義者、英語嫌いの人、英語に反対する人","english_definition":"A person who is opposed to or against the English language, culture, or people.","examples":[{"sentence":"The anti-English activists protested against the use of English in government documents.","translation":"反英語主義の活動家たちは、政府文書における英語の使用に抗議した。"}],"collocations":["anti-English activist","anti-English protester"],"synonyms":["English hater","opposer of English"],"antonyms":["anglophile","pro-English advocate"]}],"etymology":{"value":"Combination of the prefix 'anti-' (meaning against) and the adjective 'English'.","priority":"Medium"},"pronunciation":{"ipa":"/ˌænti ˈɪŋɡlɪʃ/","syllables":"an-ti-Eng-lish"},"inflection":{"notes":"The adjective form does not inflect. The noun form can be pluralized (anti-Englishes)."},"usage_notes":{"explanation":"'Anti-English' is used to describe opposition to the English language, culture, or people. It can refer to policies, sentiments, or individuals that are against English influence or presence. The term often carries a negative connotation, implying prejudice or discrimination.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"He is very anti-English, he doesn't like nothing English.","correct":"He is very anti-English, he doesn't like anything English.","note":"Double negatives should be avoided. Use 'anything' instead of 'nothing'."}],"priority":"Low"},"related_words":{"derivatives":["anti- (prefix meaning against)","English (adjective/noun)","Anglophobia (fear or dislike of England or English culture)"],"phrases":["anti-American","anti-French","anti-German"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"The term 'anti-English' is used to describe opposition to the English language, culture, or people. It is often used in political or social contexts to describe sentiments or actions that are perceived as hostile towards English-speaking communities or English influence. It is important to understand the context in which the term is used, as it can carry strong negative connotations."},"example_sentences":[{"sentence":"The government faced accusations of implementing anti-English policies in education.","translation":"政府は教育において反英語政策を実施しているという非難に直面した。","type":"adjective","meaning_category":"反英語の"},{"sentence":"The anti-English movement gained traction after the controversial language law was passed.","translation":"物議を醸す言語法が可決された後、反英語運動は勢いを増した。","type":"adjective","meaning_category":"反英語の"},{"sentence":"He was labeled as anti-English because of his outspoken criticism of British colonialism.","translation":"彼はイギリスの植民地主義に対する率直な批判のために反英語主義者とレッテルを貼られた。","type":"noun","meaning_category":"反英語主義者"}]}