{"word":"unannexedness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"未併合であること、併合されていない状態","english_definition":"The state of not being annexed; the condition of not being incorporated into another political entity.","examples":[{"sentence":"The unannexedness of the territory allowed it to maintain its unique cultural identity.","translation":"その地域の未併合状態は、独自の文化的アイデンティティを維持することを可能にした。"},{"sentence":"The political debate centered on the future unannexedness or potential annexation of the disputed islands.","translation":"政治的議論は、係争中の島の将来の未併合状態または潜在的な併合を中心に展開された。"}],"collocations":["territorial unannexedness","political unannexedness"],"synonyms":["independence","autonomy","non-integration","sovereignty"],"antonyms":["annexation","incorporation","integration","absorption"]}],"etymology":{"value":"Formed from \"un-\" (not) + \"annexed\" (past participle of \"annex,\" meaning to add or incorporate) + \"-ness\" (suffix denoting a state or condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnəkˈnɛkstnəs/","syllables":"un-an-nexed-ness"},"inflection":{"noun_plural":"unannexednesses (rare)"},"usage_notes":{"explanation":"\"Unannexedness\" is a relatively rare and formal term. It specifically describes the condition or state of a territory or region that has not been formally annexed or incorporated into another political entity. It is often used in political or historical contexts when discussing territorial disputes, sovereignty, or the status of independent regions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unannexedness of the country made it difficult to trade with.","correct":"✓ The independence of the country made it difficult to trade with.","note":"In many contexts, \"independence\" or \"sovereignty\" may be more appropriate and commonly used than \"unannexedness.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["unannexed (adjective)"],"phrasal_verbs":[],"related_concepts":["sovereignty","territorial integrity","self-determination","political status","international law","geopolitics"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Very rare, specialized vocabulary)","frequency_google_ngram":"Extremely low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"unannexedness\" is a highly specialized term used in political science, international relations, and history. It refers to the state of a territory or region that has not been formally annexed or incorporated into another political entity. Understanding this word requires knowledge of the concept of annexation and its implications for sovereignty and territorial integrity. Due to its rarity and specific context, it is unlikely to be encountered outside of academic or professional settings dealing with these topics."},"example_sentences":[{"sentence":"The treaty addressed the issue of the region's unannexedness and its future political status.","translation":"その条約は、その地域の未併合状態とその将来の政治的地位の問題に対処した。","type":"noun","meaning_category":"未併合状態"},{"sentence":"Maintaining the unannexedness of the island was a key objective of the local government.","translation":"島の未併合状態を維持することは、地方政府の重要な目標であった。","type":"noun","meaning_category":"未併合状態"}]}