{"word":"parenterally","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"非経口的に、腸管を経由せずに","english_definition":"by a route other than through the alimentary canal, i.e., bypassing the intestine; usually refers to injection.","examples":[{"sentence":"The drug was administered parenterally.","translation":"その薬は非経口的に投与された。"},{"sentence":"Parenterally administered nutrition can be life-saving for patients with severe bowel obstruction.","translation":"非経口的に投与される栄養は、重度の腸閉塞の患者にとって命を救うことができる。"}],"collocations":["administer parenterally","parenterally administered nutrition","parenterally delivered medication"],"synonyms":["by injection","intravenously","subcutaneously","intramuscularly"],"antonyms":["orally","enterally"]},{"part_of_speech":"adjective","definition":"非経口的な","english_definition":"administered or occurring by a route other than through the alimentary canal.","examples":[{"sentence":"parenteral nutrition is necessary when the patient cannot eat.","translation":"患者が食事を摂れない場合、非経口栄養が必要となる。"}],"collocations":["parenteral nutrition","parenteral administration","parenteral route"],"synonyms":["injectable","non-oral"],"antonyms":["oral"]}],"etymology":{"value":"From the prefix 'para-' (beside, near) + 'enteral' (relating to the intestine). Essentially, it means 'beside the intestine,' indicating a route of administration that bypasses the digestive tract.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpærənˈtɛrəli/","syllables":"pa-ren-ter-al-ly"},"inflection":{"notes":"This word does not inflect as it is primarily an adverb. The adjective form is also 'parenteral' which does not inflect."},"usage_notes":{"explanation":"'Parenterally' refers to any method of drug administration that bypasses the digestive system. This commonly includes intravenous (IV), subcutaneous (SC), and intramuscular (IM) injections. It is frequently used in medical contexts when oral administration is not feasible or effective. The adjective form, 'parenteral,' is used to describe something related to this method of administration, such as 'parenteral nutrition.'","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The medication was given orally, but the doctor said it could also be given parenteral.","correct":"✓ The medication was given orally, but the doctor said it could also be given parenterally.","note":"'Parenteral' is the adjective, while 'parenterally' is the adverb. Use the adverb to describe how something is administered."},{"incorrect":"✗ Parenteral means through the digestive system.","correct":"✓ Parenteral means not through the digestive system.","note":"'Parenteral' specifically means bypassing the digestive system. It's the opposite of enteral."}],"priority":"★★☆"},"related_words":{"derivatives":["parenteral (adjective)","enteral (adjective, antonym)","intravenous (adjective)","subcutaneous (adjective)","intramuscular (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'parenterally' is a technical term primarily used in medical and pharmaceutical contexts. It describes a method of administering medications or nutrients that bypasses the digestive system, typically through injection. Understanding this term requires some familiarity with medical terminology and concepts. It's not commonly used in everyday language."},"example_sentences":[{"sentence":"The patient received fluids and electrolytes parenterally due to their inability to eat.","translation":"患者は食事ができないため、非経口的に水分と電解質を投与された。","type":"adverb","meaning_category":"administration"},{"sentence":"Parenteral nutrition is often required for patients recovering from major surgery.","translation":"大手術から回復中の患者には、非経口栄養が必要となることが多い。","type":"adjective (used as an adjective to modify nutrition)","meaning_category":"nutrition"},{"sentence":"The antibiotic was administered parenterally to ensure rapid absorption.","translation":"迅速な吸収を確実にするため、抗生物質は非経口的に投与された。","type":"adverb","meaning_category":"administration"}]}