{"word":"Cushing","priority":"★★☆","meanings":[{"part_of_speech":"proper noun","definition":"クッシング (人名: 姓)","english_definition":"A surname of English origin.","examples":[{"sentence":"Mr. Cushing is a well-known historian.","translation":"クッシングさんは有名な歴史家です。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"proper noun","definition":"クッシング病 (医学)","english_definition":"Cushing's disease: A hormonal disorder caused by prolonged exposure of the body's tissues to high levels of the hormone cortisol.","examples":[{"sentence":"Cushing's disease can lead to weight gain and high blood pressure.","translation":"クッシング病は体重増加や高血圧を引き起こす可能性があります。"}],"collocations":["Cushing's syndrome","Cushing's disease treatment"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The surname Cushing is of English origin, derived from a nickname for someone who was soft or gentle, from the Middle English word 'cushin' or 'cushion'.  Cushing's disease is named after Harvey Cushing, an American neurosurgeon who first described the condition.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkʊʃɪŋ/","syllables":"Cush-ing"},"inflection":{},"usage_notes":{"explanation":"\"Cushing\" can refer to a surname or, more commonly in medical contexts, to Cushing's disease.  When referring to the disease, it is often written as \"Cushing's disease\" to indicate its association with Harvey Cushing.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I have cushing.","correct":"✓ I have Cushing's disease.","note":"When referring to the medical condition, it's important to specify \"Cushing's disease\"."}],"priority":"★★☆"},"related_words":{"derivatives":["Cushingoid (adjective: relating to or resembling Cushing's syndrome)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency as a general term, higher in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term \"Cushing\" is most often encountered in medical contexts referring to Cushing's disease, a hormonal disorder. Outside of this, it is occasionally seen as a surname. Understanding the context is crucial to interpreting its meaning.","priority":"★★★"},"example_sentences":[{"sentence":"Dr. Smith specializes in treating Cushing's disease.","translation":"スミス医師はクッシング病の治療を専門としています。","type":"proper noun","meaning_category":"クッシング病"},{"sentence":"The Cushing family has a long history in the town.","translation":"クッシング家はこの町で長い歴史を持っています。","type":"proper noun","meaning_category":"クッシング (姓)"}]}