{"word":"Indo-Pacific","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"インド太平洋の","english_definition":"Relating to the Indian and Pacific Oceans, or the biogeographic region encompassing them.","examples":[{"sentence":"The Indo-Pacific region is rich in marine biodiversity.","translation":"インド太平洋地域は海洋生物多様性に富んでいます。"},{"sentence":"Many countries in the Indo-Pacific are experiencing rapid economic growth.","translation":"インド太平洋地域の多くの国々が急速な経済成長を遂げています。"}],"collocations":["Indo-Pacific region","Indo-Pacific strategy","Indo-Pacific security","Free and Open Indo-Pacific"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"インド太平洋地域","english_definition":"The biogeographic region of the Indian and Pacific Oceans.","examples":[{"sentence":"The Indo-Pacific is a major area of study for marine biologists.","translation":"インド太平洋地域は海洋生物学者にとって主要な研究分野です。"},{"sentence":"Geopolitical tensions are rising in the Indo-Pacific.","translation":"インド太平洋地域では地政学的な緊張が高まっています。"}],"collocations":["in the Indo-Pacific","across the Indo-Pacific","the future of the Indo-Pacific"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"A combination of \"Indian\" and \"Pacific,\" referring to the Indian and Pacific Oceans.","priority":"★★★"},"pronunciation":{"ipa":"ˌɪndoʊ pəˈsɪfɪk","syllables":"In-do-Pa-ci-fic"},"inflection":{},"usage_notes":{"explanation":"\"Indo-Pacific\" is used to describe the region encompassing the Indian and Pacific Oceans. It is often used in discussions of marine biology, biogeography, and geopolitics. The term \"Free and Open Indo-Pacific\" (FOIP) is a geopolitical strategy promoted by Japan and the United States to ensure freedom of navigation and trade in the region.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The India-Pacific region...","correct":"✓ The Indo-Pacific region...","note":"The correct term is \"Indo-Pacific,\" not \"India-Pacific.\""}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["Indian Ocean","Pacific Ocean","biogeography","geopolitics"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but increasing due to geopolitical significance.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term \"Indo-Pacific\" refers to the combined area of the Indian and Pacific Oceans. It's often used in discussions about geography, marine life, and especially international relations and security policies in that part of the world. Because it's used in more specialized contexts, it's considered a C1 level word."},"example_sentences":[{"sentence":"The coral reefs of the Indo-Pacific are among the most diverse in the world.","translation":"インド太平洋のサンゴ礁は、世界で最も多様性に富んでいます。","type":"adjective"},{"sentence":"The Indo-Pacific is a key strategic region for global trade.","translation":"インド太平洋地域は、世界の貿易にとって重要な戦略的地域です。","type":"noun"},{"sentence":"Many nations are investing in their navies to protect their interests in the Indo-Pacific.","translation":"多くの国がインド太平洋における自国の利益を守るために海軍に投資しています。","type":"noun"},{"sentence":"The Indo-Pacific area faces numerous environmental challenges, including climate change and pollution.","translation":"インド太平洋地域は、気候変動や汚染など、多くの環境問題に直面しています。","type":"noun"},{"sentence":"The Indo-Pacific Economic Framework aims to promote economic cooperation among participating countries.","translation":"インド太平洋経済枠組みは、参加国間の経済協力を促進することを目的としています。","type":"adjective"}]}