{"word":"hydatic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"水生の、水に関する","english_definition":"Relating to water; aquatic.","examples":[{"sentence":"The hydatic environment is crucial for the survival of many species.","translation":"水生の環境は多くの種の生存にとって重要である。"},{"sentence":"Hydatic plants are adapted to live in water.","translation":"水生植物は水中で生きるように適応している。"}],"collocations":["hydatic environment","hydatic plants","hydatic life"],"synonyms":["aquatic","hydrophytic","watery"],"antonyms":["terrestrial"],"notes":"This term is primarily used in scientific or technical contexts."}],"etymology":{"value":"From the Greek word 'hydatikos' (ὑδατικός) meaning 'relating to water', derived from 'hydor' (ὕδωρ) meaning 'water'.","priority":"★★☆"},"pronunciation":{"ipa":"/haɪˈdætɪk/","syllables":"hy-dat-ic"},"inflection":{"notes":"This word does not have common inflections."},"usage_notes":{"explanation":"The term 'hydatic' is relatively uncommon and primarily used in scientific or technical contexts, especially in biology and ecology, to describe things related to water or aquatic environments. It is often used to describe organisms or processes that occur in water.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The land was hydatic.","correct":"The land was aquatic.","note":"'Aquatic' is more commonly used to describe land or environments related to water."}],"priority":"★☆☆"},"related_words":{"derivatives":["hydatid (noun: a cyst formed by a tapeworm larva)","hydrology (noun: the study of water)","hydrophilic (adjective: tending to mix with or dissolve in water)","hydrophobic (adjective: tending to repel or fail to mix with water)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'hydatic' is a technical term mainly used in scientific fields, particularly in biology and ecology, to describe things related to water. It's not commonly used in everyday language, so it's more likely to be encountered in academic or professional contexts. Understanding its meaning can be helpful for comprehending scientific texts related to aquatic environments and organisms."},"example_sentences":[{"sentence":"The hydatic ecosystem of the lake supports a diverse range of species.","translation":"その湖の水生生態系は多様な種の生息を支えている。","type":"adjective","meaning_category":"水生の"},{"sentence":"Research focused on the hydatic properties of the soil.","translation":"研究は土壌の水分特性に焦点を当てた。","type":"adjective","meaning_category":"水に関する"}]}