{"word":"unshadily","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"日陰を作らずに、影を落とさずに、または、疑わしいやり方でなく、率直に、明白に","english_definition":"Without creating shade; without casting a shadow; or, in a straightforward, open, or honest manner; not in a shady way.","examples":[{"sentence":"The sun shone unshadily on the open field.","translation":"太陽は日陰を作らずに、開けた野原を照らした。"},{"sentence":"He conducted his business unshadily, earning the trust of his clients.","translation":"彼は疑わしいやり方をせずにビジネスを行い、顧客の信頼を得た。"}],"collocations":["shine unshadily","conduct business unshadily","act unshadily"],"synonyms":["openly","honestly","frankly","transparently","directly","clearly"],"antonyms":["shadily","secretly","dishonestly","obscurely"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to the adverb 'shadily'. 'Shadily' is derived from 'shady', which can refer to a place providing shade or, metaphorically, something of questionable honesty or legality.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈʃeɪdɪli/","syllables":"un-shad-i-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Unshadily' is the adverbial form of 'unshady'. It is used to describe actions or situations that are free from shadow, either literally (without casting a shadow) or figuratively (without being suspicious or dishonest). It is a relatively uncommon word, but its meaning is clear from its construction.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He unshadily parked his car.","correct":"✓ He parked his car in the sun.","note":"Unless the context specifically requires emphasizing the absence of shade created by the car, a simpler description of the parking location is more appropriate."},{"incorrect":"✗ The deal was unshadily.","correct":"✓ The deal was conducted unshadily.","note":"'Unshadily' is an adverb and should modify a verb. It describes how an action is performed, not the state of a noun."}],"priority":"★☆☆"},"related_words":{"derivatives":["unshady (adjective): not shady, not casting shade, not suspicious","shady (adjective): casting shade, suspicious, dishonest","shadily (adverb): in a shady manner","shade (noun): shadow, an area sheltered from direct light; a slight obscurity or degree of darkness; something that obscures or conceals something else.","shadow (noun): a dark area or shape produced by a body coming between light and a surface.","shadowy (adjective): full of shadows; mysterious or obscure."],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (too rare to be classified)","frequency_google_ngram":"Very low frequency - the word is rare in general usage.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unshadily' is a relatively rare and complex word. It is formed by negating 'shadily', which itself has both a literal meaning related to shade and a figurative meaning related to dishonesty or suspicion. Understanding the word requires a strong vocabulary and the ability to interpret the meaning based on its components and context. It is unlikely to be encountered in everyday language."},"example_sentences":[{"sentence":"The sun beat down unshadily on the desert landscape.","translation":"太陽は日陰を作らずに砂漠の風景を照りつけた。","type":"adverb","meaning_category":"Without creating shade"},{"sentence":"The investigation was conducted unshadily, with full transparency.","translation":"調査は完全に透明性を持って、疑わしいやり方なく行われた。","type":"adverb","meaning_category":"In a straightforward, honest manner"}]}