{"word":"thung","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に東南アジアで使われる)筒状のスカート、サロン","english_definition":"A traditional tube skirt or sarong worn in Southeast Asia, particularly in countries like Myanmar and Thailand.","examples":[{"sentence":"She wore a beautiful silk thung to the temple.","translation":"彼女は美しいシルクの筒状スカートを身に着けて寺院へ行った。"},{"sentence":"The market was filled with vendors selling colorful thungs.","translation":"市場は色とりどりの筒状スカートを売る露店でいっぱいだった。"}],"collocations":["wear a thung","silk thung","traditional thung","cotton thung"],"synonyms":["sarong","longyi","htamein","pha nung"],"antonyms":[]},{"part_of_speech":"noun","definition":"(俗語)Tバック、ひも状の下着","english_definition":"(slang) A thong; a type of underwear consisting of a narrow strip of fabric that passes between the buttocks.","examples":[{"sentence":"She was wearing a thung under her jeans.","translation":"彼女はジーンズの下にTバックを履いていた。"},{"sentence":"Thungs are popular for avoiding visible panty lines.","translation":"Tバックは見えやすい下着のラインを避けるために人気がある。"}],"collocations":["wear a thung","string thung","g-string","lace thung"],"synonyms":["thong","g-string"],"antonyms":[]}],"etymology":{"value":"The origin of the word 'thung' for the skirt is from Southeast Asian languages. The etymology for the underwear meaning is likely a shortening or alteration of 'thong'.","priority":"★★☆"},"pronunciation":{"ipa":"/θʌŋ/","syllables":"thung"},"inflection":{"noun_plural":"thungs"},"usage_notes":{"explanation":"The word 'thung' has two distinct meanings. The first refers to a traditional garment worn in Southeast Asia, similar to a sarong or longyi. The second, a more recent and informal usage, refers to a type of underwear, specifically a thong or g-string. Context is crucial to understanding which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She wore a thung to the beach (when meaning underwear).","correct":"✓ She wore a thong to the beach.","note":"When referring to underwear, 'thong' is the more common and widely understood term, even though 'thung' is sometimes used colloquially. Using 'thung' in this context might cause confusion. If you are talking about the traditional dress, it is correct to use 'thung'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["sarong","longyi","htamein","pha nung","thong","g-string"],"priority":"★★☆"},"level_frequency":{"CEFR":"No specific CEFR level, usage depends on context.","frequency_google_ngram":"Low frequency overall, higher in specific contexts (e.g., fashion, Southeast Asian culture).","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Thung' is a word with two different meanings, so it's important to understand the context. In Southeast Asia, it refers to a traditional skirt. In other contexts, it can refer to a type of underwear, similar to a 'thong'. Be aware that the underwear meaning is more informal and might not be appropriate in all situations. If unsure, 'thong' is a safer choice for the underwear meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"Many women in Myanmar wear a thung every day.","translation":"ミャンマーの多くの女性は毎日筒状のスカートを履いています。","type":"noun","meaning_category":"Traditional skirt"},{"sentence":"She chose a seamless thung to wear under her dress.","translation":"彼女はドレスの下に履くシームレスなTバックを選んだ。","type":"noun","meaning_category":"Underwear"}]}