{"word":"domestications","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)飼い慣らし、家畜化、栽培化","english_definition":"(plural) the process of taming an animal or cultivating a plant for human use or companionship.","examples":[{"sentence":"The domestications of animals like dogs and cats have greatly impacted human societies.","translation":"犬や猫のような動物の家畜化は、人間社会に大きな影響を与えてきました。"},{"sentence":"The early domestications of wheat and barley led to the development of agriculture.","translation":"小麦や大麦の初期の栽培化は、農業の発展につながりました。"},{"sentence":"Studies on domestications provide insights into the co-evolution of humans and other species.","translation":"家畜化に関する研究は、人間と他の生物種との共進化に関する洞察を提供します。"}],"collocations":["animal domestications (動物の家畜化)","plant domestications (植物の栽培化)","early domestications (初期の家畜化/栽培化)","successful domestications (成功した家畜化/栽培化)","the process of domestications (家畜化/栽培化の過程)"],"synonyms":["taming","domestication","cultivation","husbandry","breeding"],"antonyms":["wildness","ferality","naturalization"]}],"etymology":{"value":"The word \"domestications\" is the plural form of \"domestication.\" \"Domestication\" comes from the verb \"domesticate,\" which originates from the Latin word \"domesticus,\" meaning \"belonging to the house.\" This, in turn, comes from \"domus,\" meaning \"house.\" The suffix \"-ation\" indicates a process or result. Therefore, \"domestication\" refers to the process of bringing something (animal or plant) under human control and care, making it suitable for living in or around a house or farm.","priority":"★★☆"},"pronunciation":{"ipa":"/dəˌmɛstɪˈkeɪʃənz/","syllables":"do-mes-ti-ca-tions"},"inflection":{"noun_plural":"domestications"},"usage_notes":{"explanation":"\"Domestications\" is the plural form of \"domestication,\" referring to multiple instances or types of the process of domesticating animals or plants. It is often used in scientific or historical contexts when discussing various examples or aspects of how species have been brought under human control. The term emphasizes the transformative process and its impact on both the domesticated species and human societies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The domestication of many animals are important.","correct":"✓ The domestications of many animals are important.","note":"When referring to multiple instances or types of domestication, use the plural form \"domestications.\" In the incorrect sentence, \"domestication\" is singular, but the context implies multiple instances, so the plural form is more appropriate."},{"incorrect":"✗ The domestication are a long process.","correct":"✓ The domestications are a long process.","note":"When discussing the general concept of multiple instances of domestication, use the plural form \"domestications.\" The singular form \"domestication\" refers to the process in general or a single instance."}],"priority":"★★☆"},"related_words":{"derivatives":["domestication (noun: 家畜化、栽培化)","domesticate (verb: 家畜化する、栽培化する)","domesticated (adjective: 家畜化された、栽培化された)","domestic (adjective: 家庭の、国内の)"],"phrases":["the domestication process (家畜化の過程)","the history of domestications (家畜化の歴史)","the impact of domestications (家畜化の影響)","the origins of domestications (家畜化の起源)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"domestications\" is a more advanced term, mainly used in academic or scientific contexts. It refers to the various instances or types of the process of domesticating animals or plants. Understanding this word requires familiarity with the concept of domestication and its significance in history, biology, and anthropology. It's not a word commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The study examined the different domestications of crops in various regions of the world.","translation":"その研究は、世界の様々な地域における作物の異なる栽培化を調査しました。","type":"noun","meaning_category":"栽培化"},{"sentence":"The domestications of horses and cattle revolutionized transportation and agriculture.","translation":"馬と牛の家畜化は、輸送と農業に革命をもたらしました。","type":"noun","meaning_category":"家畜化"},{"sentence":"Archaeological evidence provides insights into the early domestications of animals in the Near East.","translation":"考古学的証拠は、近東における動物の初期の家畜化に関する洞察を提供します。","type":"noun","meaning_category":"家畜化"},{"sentence":"The domestications of certain plants led to the development of settled agricultural societies.","translation":"特定の植物の栽培化は、定住型の農業社会の発展につながりました。","type":"noun","meaning_category":"栽培化"}]}