{"word":"Christianized","priority":"N/A","meanings":[{"part_of_speech":"verb (past participle)","definition":"キリスト教化された、キリスト教に改宗された","english_definition":"converted to Christianity; brought under Christian influence or control.","examples":[{"sentence":"The pagan tribes were Christianized over several centuries.","translation":"異教徒の部族は数世紀にわたってキリスト教化された。"},{"sentence":"Much of Europe was Christianized during the Roman Empire.","translation":"ヨーロッパの多くはローマ帝国の間にキリスト教化された。"},{"sentence":"The missionaries Christianized the indigenous population.","translation":"宣教師たちは先住民をキリスト教化した。"}],"collocations":["fully Christianized","partially Christianized","forcefully Christianized","peacefully Christianized"],"synonyms":["converted","evangelized","baptized","catechized"],"antonyms":["de-Christianized","paganized","secularized"]}],"etymology":{"value":"The term 'Christianized' is derived from the verb 'to Christianize,' which comes from 'Christian' (a follower of Christ) + '-ize' (a suffix indicating the process of becoming or conforming to).","priority":"N/A"},"pronunciation":{"ipa":"/ˈkrɪstʃənaɪzd/","syllables":"Chris-tian-ized"},"inflection":{"verb_forms":{"present_simple":["Christianize","Christianizes"],"past_simple":"Christianized","past_participle":"Christianized","present_participle":"Christianizing"}},"usage_notes":{"explanation":"'Christianized' typically refers to the historical process of converting individuals or societies to Christianity. It can also describe the influence of Christian values or practices on a particular culture or region. The term can sometimes carry connotations of cultural imperialism or forced conversion, depending on the context.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The building was Christianized, so it was very old.","correct":"✓ The building was Christianized, meaning it was converted into a Christian place of worship.","note":"Christianization refers to the conversion to Christianity, not necessarily the age of a building."},{"incorrect":"✗ He Christianized his children by sending them to public school.","correct":"✓ He Christianized his children by raising them in the Christian faith and sending them to Sunday school.","note":"Christianizing involves religious upbringing and practices, not simply sending children to public school."}],"priority":"N/A"},"related_words":{"derivatives":["Christianize (verb)","Christianization (noun)","unchristianized (adjective)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Christianized' describes the act or process of converting someone or something to Christianity. This often involves religious instruction, baptism, and adopting Christian beliefs and practices. The term is frequently used in historical contexts to describe the spread of Christianity across different regions and cultures. It can also refer to the influence of Christian values on societal norms and institutions. Understanding the term requires familiarity with religious history and the concept of cultural conversion."},"example_sentences":[{"sentence":"The Roman Empire was gradually Christianized after Constantine's conversion.","translation":"コンスタンティヌスの改宗後、ローマ帝国は徐々にキリスト教化された。","type":"verb (past participle)","meaning_category":"conversion to Christianity"},{"sentence":"The local traditions were Christianized by incorporating them into religious festivals.","translation":"地元の伝統は、宗教的な祭りに組み込むことによってキリスト教化された。","type":"verb (past participle)","meaning_category":"cultural influence"},{"sentence":"The newly Christianized population built churches and monasteries.","translation":"新たにキリスト教化された人々は教会や修道院を建てた。","type":"verb (past participle)","meaning_category":"religious practice"}]}