{"word":"Torulas","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A genus of imperfect fungi in the Cryptococcaceae family.","english_definition":"A genus of imperfect fungi in the Cryptococcaceae family, characterized by budding yeast-like cells and the absence of sexual reproduction.","examples":[{"sentence":"Some species of Torulas are known to produce pigments.","translation":"Torulas属のいくつかの種は色素を生成することで知られています。"},{"sentence":"Torulas can be found in various environments, including soil and plants.","translation":"Torulasは土壌や植物など、さまざまな環境で見られます。"}],"collocations":["Torulas species","Torulas yeast","Torulas culture"],"synonyms":["Cryptococcus (related genus)","Yeast-like fungi"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin 'torulus,' meaning a small swelling or protuberance, referring to the shape of the fungal cells.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈtɒrələs/","syllables":"To-ru-las"},"inflection":{"noun_plural":"Torulas (plural is the same as the singular, as it refers to a genus)"},"usage_notes":{"explanation":"'Torulas' is a scientific term used in mycology (the study of fungi). It refers to a specific genus of fungi, and thus is most commonly encountered in scientific literature or discussions related to microbiology, food science (as some species can be involved in food spoilage), or environmental studies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I found a torulas in my bread.","correct":"✓ I found Torulas in my bread.","note":"'Torulas' refers to the genus, not a single organism. It's more accurate to say you found evidence of Torulas or a Torulas species. Also, remember to capitalize the genus name."},{"incorrect":"✗ Torulas are bacteria.","correct":"✓ Torulas are fungi.","note":"Torulas are a type of fungi, specifically yeast-like fungi, and not bacteria."}],"priority":"★☆☆"},"related_words":{"derivatives":["Torulopsis (older synonym for some Torulas species)","Torulaceae (older family name)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Very low frequency (scientific term)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Torulas' is a highly specialized term used in the field of mycology to refer to a specific genus of fungi. Understanding this term requires a background in biology or microbiology. It's unlikely to be encountered in general conversation or writing. The term is most often used in scientific publications or technical discussions related to fungal taxonomy, food spoilage, or environmental microbiology."},"example_sentences":[{"sentence":"The researchers isolated a novel strain of Torulas from the soil sample.","translation":"研究者らは土壌サンプルからTorulasの新規株を分離した。","type":"scientific context","meaning_category":"fungal genus"},{"sentence":"Some Torulas species are known for their ability to produce carotenoid pigments.","translation":"Torulas属のいくつかの種は、カロテノイド色素を生成する能力で知られています。","type":"scientific context","meaning_category":"fungal genus"}]}