{"word":"Europeanisation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"欧州化、ヨーロッパ化","english_definition":"The process by which non-European countries or regions adopt political, economic, or social systems and values that are characteristic of Europe. It can also refer to the increasing integration of European countries.","examples":[{"sentence":"The Europeanisation of Eastern European countries after the fall of the Soviet Union involved significant reforms.","translation":"ソ連崩壊後の東ヨーロッパ諸国の欧州化は、重要な改革を伴った。"},{"sentence":"Some scholars argue that globalisation is simply a form of Europeanisation.","translation":"グローバル化は単なる欧州化の一形態に過ぎないと主張する学者もいる。"}],"collocations":["political Europeanisation","economic Europeanisation","cultural Europeanisation"],"synonyms":["Europeanization","Westernisation","Westernization","Modernisation","Modernization"],"antonyms":["De-Europeanisation","De-Europeanization"]},{"part_of_speech":"noun","definition":"欧州連合（EU）の政策や法律が、加盟国または非加盟国の国内政策や法律に影響を与えるプロセス","english_definition":"The process whereby national policies and laws in member states or non-member states are shaped by EU policies and laws.","examples":[{"sentence":"Europeanisation has led to significant changes in environmental regulations across Europe.","translation":"欧州化は、ヨーロッパ全体の環境規制に大きな変化をもたらした。"},{"sentence":"The study examines the impact of Europeanisation on national identity.","translation":"この研究は、欧州化が国民のアイデンティティに与える影響を調査する。"}],"collocations":["EU Europeanisation","domestic Europeanisation","policy Europeanisation"],"synonyms":["EU integration","policy transfer","policy convergence"],"antonyms":["Nationalisation","Nationalization","Divergence"]}],"etymology":{"value":"Formed from \"European\" + \"-isation\".","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌjʊərəpiənʌɪˈzeɪʃən/","syllables":"Eu-ro-pe-an-i-sa-tion"},"inflection":{"noun_plural":"Europeanisations"},"usage_notes":{"explanation":"\"Europeanisation\" has two main senses. The first refers to the adoption of European characteristics by non-European entities, similar to Westernisation. The second, more specific sense, refers to the influence of EU policies on national policies. The term is often used in political science and international relations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The country is Europeanizing its culture.","correct":"✓ The country is undergoing Europeanisation of its culture.","note":"Europeanisation is primarily a noun referring to a process. Use it with verbs like 'undergo', 'experience', or 'promote'. To describe the act of making something more European, use 'Europeanise' (though this is less common)."},{"incorrect":"✗ Europeanisation is only about economics.","correct":"✓ Europeanisation involves political, economic, and social dimensions.","note":"Europeanisation is a multifaceted process that includes political, economic, and social aspects, not just economics."}],"priority":"☆☆☆"},"related_words":{"derivatives":["Europeanise","Europeanize","Europeanised","Europeanized"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term \"Europeanisation\" refers to the process of adopting European political, economic, or social systems and values. It can also refer to the influence of EU policies on national policies. This term is often used in academic and political contexts to describe the spread of European norms and practices. It's important to understand the context to determine which meaning is intended."},"example_sentences":[{"sentence":"The Europeanisation of legal standards has impacted human rights laws worldwide.","translation":"法的な基準の欧州化は、世界中の人権法に影響を与えている。","type":"general","meaning_category":"Adoption of European systems"},{"sentence":"Europeanisation requires member states to align their policies with EU directives.","translation":"欧州化は、加盟国が自国の政策をEUの指令に合わせることを要求する。","type":"EU-specific","meaning_category":"Influence of EU policies"}]}