{"word":"reserve-dependent","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(医学)予備能依存性の、リザーブ依存性の","english_definition":"(Medicine) Describing a condition where an organ or system relies heavily on its reserve capacity to maintain normal function, and is therefore vulnerable to even small reductions in that reserve.","examples":[{"sentence":"The patient's renal function was reserve-dependent, meaning that even a slight decrease in kidney function could lead to significant problems.","translation":"患者の腎機能は予備能依存性であり、腎機能がわずかに低下するだけでも重大な問題につながる可能性があった。"},{"sentence":"Elderly individuals often have more reserve-dependent organ systems, making them more susceptible to age-related decline and disease.","translation":"高齢者は、多くの場合、予備能依存性の臓器系が多く、加齢に伴う機能低下や病気の影響を受けやすくなっています。"}],"collocations":["reserve-dependent renal function (予備能依存性の腎機能)","reserve-dependent cardiac function (予備能依存性の心機能)","reserve-dependent pulmonary function (予備能依存性の肺機能)","become reserve-dependent (予備能依存性になる)"],"synonyms":["vulnerable","fragile","precarious","compromised","dependent on reserve capacity"],"antonyms":["robust","resilient","independent of reserve","stable"],"notes":["This term is primarily used in medical contexts, particularly in geriatrics, nephrology, cardiology, and pulmonology. It describes a state where an organ's function appears normal under resting conditions, but is highly susceptible to even minor stressors or insults due to limited functional reserve."]}],"etymology":{"value":"Derived from the combination of 'reserve' (referring to functional reserve capacity) and 'dependent' (relying on).","priority":"N/A"},"pronunciation":{"ipa":"/rɪˈzɜːrv dɪˈpɛndənt/","syllables":"re-serve-de-pend-ent"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"The term 'reserve-dependent' is used in medicine to describe a situation where an organ or system is heavily reliant on its functional reserve to maintain normal function. This means that even small reductions in the reserve capacity can lead to significant clinical consequences. It is often used in the context of aging, chronic diseases, and organ failure.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The muscle was reserve-dependent for strength.","correct":"The muscle strength was reserve-dependent.","note":"It's the function, not the organ itself, that is reserve-dependent."}],"priority":"★☆☆"},"related_words":{"derivatives":["reserve capacity (予備能)","functional reserve (機能的予備力)"],"related_terms":["frailty","aging","comorbidity","homeostenosis"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily a medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Reserve-dependent' is a specialized medical term. It means that a part of the body, like an organ, is working normally only because it's using all of its extra ability (reserve capacity). If that extra ability is reduced even a little, the organ might not work properly anymore. This is often seen in older people or those with health problems. It's like a car that's running fine, but the gas tank is almost empty – it can't go much further without problems. Understanding this term requires a good grasp of medical concepts."},"example_sentences":[{"sentence":"The patient's cognitive function was becoming increasingly reserve-dependent, indicating early signs of dementia.","translation":"患者の認知機能はますます予備能依存性になっており、認知症の初期兆候を示していた。","type":"general","meaning_category":"medical"},{"sentence":"Due to chronic hypertension, the patient's cardiac function was now reserve-dependent, requiring careful management to avoid heart failure.","translation":"慢性高血圧のため、患者の心機能は現在予備能依存性であり、心不全を避けるためには慎重な管理が必要であった。","type":"specific","meaning_category":"medical"}]}