{"word":"antipapalist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"反教皇主義者、教皇権反対者","english_definition":"A person who opposes the Pope or the papacy.","examples":[{"sentence":"The antipapalists strongly criticized the Pope's policies.","translation":"反教皇主義者たちは教皇の政策を強く批判した。"},{"sentence":"Historically, antipapalists have often been associated with Protestant movements.","translation":"歴史的に、反教皇主義者たちはしばしばプロテスタント運動と関連付けられてきた。"}],"collocations":["strong antipapalist","historical antipapalist"],"synonyms":["anti-Catholic","papophobe"],"antonyms":["papalist","pro-papal"],"notes":"This term is often used in historical contexts referring to opposition to the Pope's authority, particularly during the Reformation and subsequent periods."},{"part_of_speech":"adjective","definition":"反教皇主義の、教皇権に反対する","english_definition":"Opposing the Pope or the papacy.","examples":[{"sentence":"The antipapalist sentiment was strong in the region.","translation":"その地域では反教皇主義の感情が強かった。"},{"sentence":"The book presents an antipapalist perspective on the history of the Church.","translation":"その本は教会の歴史に対する反教皇主義的な視点を示している。"}],"collocations":["antipapalist sentiment","antipapalist literature"],"synonyms":["anti-Catholic","papophobic"],"antonyms":["papal","pro-papal"],"notes":"Describes views, sentiments, or writings that are against the authority or policies of the Pope."}],"etymology":{"value":"Formed from \"anti-\" (against) + \"papal\" (relating to the Pope) + \"-ist\" (a person who adheres to a belief or ideology).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæntiˈpeɪpəlɪst/","syllables":"an-ti-pa-pal-ist"},"inflection":{"noun_plural":"antipapalists"},"usage_notes":{"explanation":"The term 'antipapalist' refers to someone who opposes the authority and influence of the Pope and the papacy. It can also describe ideas, writings, or sentiments that express this opposition. The term is most frequently encountered in historical discussions, particularly those concerning the Reformation and subsequent religious conflicts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was an anti-papalist, so he hated all Catholics.","correct":"✓ He was an antipapalist, meaning he opposed the authority of the Pope, but not necessarily all Catholics.","note":"It's important to distinguish between opposing the Pope's authority and hating all Catholics. Antipapalism is specifically against the institution of the papacy, not necessarily against individual Catholics."}],"priority":"★☆☆"},"related_words":{"derivatives":["antipapalism (noun: opposition to the Pope or papacy)"],"related_terms":["papacy (noun: the office or authority of the Pope)","papal (adjective: relating to the Pope)","papist (noun: a supporter of the Pope; often used pejoratively)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"antipapalist\" is a specialized term primarily used in historical or religious contexts. It refers to someone who opposes the Pope and the papacy, or something related to this opposition. Understanding this word requires familiarity with the history of the Catholic Church and the various movements that have challenged papal authority. It is not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The pamphlet was filled with antipapalist rhetoric.","translation":"そのパンフレットは反教皇主義的なレトリックで満たされていた。","type":"adjective","meaning_category":"反教皇主義の"},{"sentence":"Many antipapalists fled to other countries to avoid persecution.","translation":"多くの反教皇主義者たちは迫害を避けるために他国へ逃れた。","type":"noun","meaning_category":"反教皇主義者"}]}