{"word":"graft-hybridization","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"接ぎ木雑種、接ぎ木変異","english_definition":"A plant that differs from both the scion and the stock, arising at or near the point of union of the two, and apparently owing its peculiarities to their mutual influence.","examples":[{"sentence":"Graft-hybridization is a rare phenomenon in plant biology.","translation":"接ぎ木雑種は植物生物学においてまれな現象です。"},{"sentence":"The characteristics of graft-hybridization can be unpredictable.","translation":"接ぎ木雑種の特性は予測できない場合があります。"}],"collocations":["graft-hybridization experiment","graft-hybridization study"],"synonyms":["chimera","graft chimera"],"antonyms":[]}],"etymology":{"value":"The term combines \"graft\" (the process of joining two plants) and \"hybridization\" (the process of creating a hybrid).","priority":"N/A"},"pronunciation":{"ipa":"/ˈɡræftˌhaɪbrɪdaɪˈzeɪʃən/","syllables":"graft-hy-brid-i-za-tion"},"inflection":{"noun_plural":"graft-hybridizations"},"usage_notes":{"explanation":"Graft-hybridization refers to the alteration of genetic material at the graft junction, resulting in a plant with characteristics different from both the scion and the stock. It is distinct from a chimera, where the genetic material of the two plants remains separate.","priority":"N/A"},"common_mistakes":{},"related_words":{"derivatives":["graft","hybridization","scion","stock","chimera"],"related_terms":["plant breeding","plant genetics","horticulture"]},"level_frequency":{},"readability_explanation":{"level":"N/A","text":"This term is specialized and used in the context of plant biology and horticulture. Understanding requires knowledge of grafting and hybridization processes."},"example_sentences":[{"sentence":"The study focused on the mechanisms behind graft-hybridization in tomatoes.","translation":"その研究は、トマトにおける接ぎ木雑種のメカニズムに焦点を当てました。","type":"scientific","meaning_category":"接ぎ木雑種研究"},{"sentence":"Researchers are investigating the potential for graft-hybridization to create novel plant varieties.","translation":"研究者たちは、接ぎ木雑種が新しい植物品種を生み出す可能性を調査しています。","type":"horticultural","meaning_category":"新品種開発"}]}