{"word":"indeterminismo","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"非決定論、不確定性原理","english_definition":"The philosophical view that not all events are causally determined by prior events. It is the opposite of determinism.","examples":[{"sentence":"El indeterminismo cuántico es una característica fundamental de la mecánica cuántica.","translation":"量子非決定論は、量子力学の基本的な特徴です。"},{"sentence":"El debate entre determinismo e indeterminismo ha sido central en la filosofía de la acción.","translation":"決定論と非決定論の間の議論は、行為の哲学において中心的なものでした。"}],"collocations":["indeterminismo cuántico (量子非決定論)","indeterminismo causal (因果的非決定論)","principio de indeterminismo (不確定性原理)"],"synonyms":["aleatoriedad","contingencia","azar"],"antonyms":["determinismo","causalidad"],"related_terms":["causalidad","determinismo","mecánica cuántica","libre albedrío"]}],"etymology":{"value":"From the prefix 'in-' (not) + 'determinismo' (determinism).","priority":"★★★"},"pronunciation":{"ipa":"/indetermiˈnismo/","syllables":"in-de-ter-mi-nis-mo"},"inflection":{"noun_forms":{"singular":"indeterminismo","plural":"indeterminismos"}},"usage_notes":{"explanation":"'Indeterminismo' refers to the philosophical concept that events are not entirely determined by prior causes. It is often discussed in the context of quantum mechanics and free will.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"El indeterminismo es lo mismo que el azar.","correct":"El indeterminismo implica azar, pero no son exactamente lo mismo.","note":"Indeterminism implies randomness, but it's not exactly the same thing. Indeterminism suggests that not all events are determined by prior causes, which can lead to randomness, but other factors might also be involved."}],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Indeterminismo' is a philosophical term that refers to the idea that not all events are determined by prior causes. It is often discussed in relation to free will and quantum mechanics. Understanding this term requires some background in philosophy and physics."}}