{"word":"daughterless","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"娘のいない、娘を亡くした","english_definition":"without a daughter or daughters; having lost a daughter or daughters.","examples":[{"sentence":"The king was daughterless and worried about the succession.","translation":"王には娘がいなかったので、後継を心配していた。"},{"sentence":"The daughterless couple adopted a child.","translation":"娘を亡くした夫婦は子供を養子に迎えた。"},{"sentence":"She wrote a poignant poem about being daughterless after her daughter's passing.","translation":"彼女は娘の死後、娘を亡くしたことについての痛切な詩を書いた。"}],"collocations":["daughterless father","daughterless mother","daughterless couple","become daughterless","feel daughterless"],"synonyms":["without daughters","bereaved of a daughter","childless (in terms of daughters)"],"antonyms":["with daughters","having daughters","daughtered"],"notes":"Often used to describe the emotional state of parents who have lost a daughter."}],"etymology":{"value":"Formed from the noun 'daughter' and the suffix '-less', meaning 'without'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɔːtərˌlɛs/","syllables":"daugh-ter-less"},"inflection":{"notes":"This is an adjective and does not inflect for number or gender."},"usage_notes":{"explanation":"The term 'daughterless' is primarily used to describe a person or couple who do not have any daughters, either by birth or adoption, or who have experienced the death of their daughter(s). It often carries a sense of loss or incompleteness, particularly when the desire for a daughter was present. It can also be used in a more neutral, descriptive sense.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is daughterless because she doesn't like children.","correct":"✓ She is daughterless because she never had any daughters.","note":"Daughterless refers to not having daughters, not to disliking children."},{"incorrect":"✗ The daughterless family.","correct":"✓ The family is daughterless.","note":"'Daughterless' is an adjective, so it describes the family, not modifies it directly like a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["fatherless","motherless","childless","siblingless"],"related_concepts":["family structure","bereavement","adoption","gender roles","inheritance"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'daughterless' is a relatively uncommon word used to describe someone who does not have a daughter. It is formed by combining 'daughter' with the suffix '-less', which means 'without'. The word is often used in contexts where the absence of a daughter is significant, such as in discussions of family lineage, inheritance, or the emotional impact of losing a child. Because it is not a frequently used word, it may be unfamiliar to some English speakers."},"example_sentences":[{"sentence":"The daughterless queen worried about who would inherit the throne.","translation":"娘のいない女王は、誰が王位を継承するのか心配していた。","type":"descriptive"},{"sentence":"After the accident, they became daughterless and their lives changed forever.","translation":"事故の後、彼らは娘を亡くし、人生は永遠に変わってしまった。","type":"emotional"},{"sentence":"The daughterless couple decided to explore adoption as an option.","translation":"娘のいない夫婦は、養子縁組を検討することにした。","type":"situational"}]}