{"word":"structurist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"構造主義者、構造主義の信奉者","english_definition":"An adherent or practitioner of structurism, especially in art or literary criticism.","examples":[{"sentence":"The structurists sought to uncover the underlying structures in various cultural phenomena.","translation":"構造主義者たちは、さまざまな文化現象の根底にある構造を明らかにしようとした。"},{"sentence":"As a structurist, he analyzed the novel in terms of its narrative structure and recurring motifs.","translation":"構造主義者として、彼は小説をその物語構造と繰り返されるモチーフの観点から分析した。"}],"collocations":["literary structurist (文学構造主義者)","art structurist (美術構造主義者)"],"synonyms":["structuralist"],"antonyms":[],"notes":"Often used in the context of art, literature, and social sciences."},{"part_of_speech":"adjective","definition":"構造主義の、構造主義的な","english_definition":"Relating to or characteristic of structurism.","examples":[{"sentence":"The structurist approach emphasizes the relationships between elements within a system.","translation":"構造主義的なアプローチは、システム内の要素間の関係を強調する。"},{"sentence":"Structurist art often features geometric forms and a focus on the underlying structure of the composition.","translation":"構造主義的な芸術は、幾何学的な形と、構成の根底にある構造に焦点を当てることを特徴とすることが多い。"}],"collocations":["structurist approach (構造主義的アプローチ)","structurist art (構造主義的芸術)","structurist principles (構造主義的原則)"],"synonyms":["structural"],"antonyms":[],"notes":"Used to describe methods, theories, or artworks that are based on the principles of structurism."}],"etymology":{"value":"Derived from 'structure' + '-ist'. 'Structure' comes from Latin 'structura' (a fitting together, arrangement, building), from 'struere' (to build). The suffix '-ist' denotes a person who practices or adheres to a particular doctrine or theory.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstrʌktʃərɪst/","syllables":"struc-tur-ist"},"inflection":{"noun_plural":"structurists"},"usage_notes":{"explanation":"The term 'structurist' is closely related to 'structuralist,' and the two are often used interchangeably. However, 'structurist' can sometimes refer more specifically to those involved in the structurist art movement, which emphasizes geometric forms and the underlying structure of compositions. In other contexts, both terms generally refer to someone who applies structuralist principles in fields such as literary criticism, anthropology, and linguistics.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a structureist.","correct":"✓ He is a structurist. / ✓ He is a structuralist.","note":"The correct term is 'structurist' or 'structuralist,' not 'structureist.'"},{"incorrect":"✗ Structurism is about building actual structures.","correct":"✓ Structurism is a theoretical approach that analyzes underlying structures in various systems.","note":"Structurism is primarily a theoretical approach, not necessarily about building physical structures."}],"priority":"★★☆"},"related_words":{"derivatives":["structurism","structuralism","structure","structural"],"related_terms":["post-structuralist","deconstruction"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'structurist' is a specialized term primarily used in academic and artistic contexts. It refers to someone who adheres to or practices structurism, a theoretical approach that analyzes underlying structures in various systems, such as language, literature, and art. Understanding this term requires familiarity with structuralist and post-structuralist theories. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"As a literary structurist, she focused on the underlying patterns in the novel's narrative.","translation":"文学構造主義者として、彼女は小説の物語の根底にあるパターンに焦点を当てた。","type":"noun","meaning_category":"構造主義者"},{"sentence":"The structurist movement in art sought to emphasize the geometric forms and spatial relationships.","translation":"美術における構造主義運動は、幾何学的な形と空間的関係を強調しようとした。","type":"adjective","meaning_category":"構造主義の"}]}