{"word":"mixedly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"入り混じって、混ざり合って、混合して","english_definition":"in a mixed manner; in a way that combines different elements or qualities.","examples":[{"sentence":"The reviews for the film were mixedly positive and negative.","translation":"その映画のレビューは、肯定的なものと否定的なものが入り混じっていた。"},{"sentence":"The children sang the song mixedly, some in tune and some out of tune.","translation":"子供たちは歌を歌ったが、音程が合っている子もいれば、外れている子もいて、入り混じっていた。"},{"sentence":"The audience reacted mixedly to the comedian's jokes.","translation":"観客はコメディアンのジョークに対して、さまざまな反応を示した。"}],"collocations":["mixedly positive","mixedly negative","mixedly received","mixedly successful"],"synonyms":["variously","diversely","heterogeneously","indiscriminately","promiscuously"],"antonyms":["uniformly","homogeneously","consistently"]},{"part_of_speech":"adverb","definition":"（感情などが）入り混じって、複雑に","english_definition":"with mixed feelings; in a way that shows a combination of different emotions.","examples":[{"sentence":"She looked at him mixedly, with both love and resentment.","translation":"彼女は彼を、愛と恨みが入り混じった複雑な表情で見つめた。"},{"sentence":"He approached the task mixedly, with excitement and trepidation.","translation":"彼は興奮と不安が入り混じった複雑な気持ちでその仕事に取り掛かった。"},{"sentence":"The news was received mixedly, with some people happy and others disappointed.","translation":"その知らせは、喜ぶ人もいれば失望する人もいて、さまざまな感情が入り混じって受け止められた。"}],"collocations":["mixedly excited","mixedly apprehensive","mixedly happy"],"synonyms":["ambivalently","equivocally","uncertainly","confusedly","complexly"],"antonyms":["unequivocally","certainly","resolutely"]}],"etymology":{"value":"\"Mixed\" + \"-ly\". From the adjective \"mixed\" (meaning combined or blended) and the adverbial suffix \"-ly\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɪksɪdli/","syllables":"mix-ed-ly"},"inflection":{"notes":"Adverb. No inflection."},"usage_notes":{"explanation":"\"Mixedly\" is an adverb that describes something done or experienced in a mixed manner. It often refers to a combination of different elements, qualities, or emotions. It's used to indicate that something is not uniform or consistent but rather a blend of various aspects. It's less common than the adjective \"mixed,\" and its usage is generally confined to more formal or descriptive contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The colors were mixedly on the canvas.","correct":"✓ The colors were mixed on the canvas.","note":"Use \"mixed\" (adjective) to describe the state of something. \"Mixedly\" describes how something is done."},{"incorrect":"✗ He felt mixedly about the decision. He was happy and sad.","correct":"✓ He felt mixed about the decision. He was happy and sad. / ✓ He felt mixed emotions about the decision. He was happy and sad.","note":"While \"mixedly\" can be used to describe feelings, it's more common to use \"mixed\" or \"mixed emotions.\""}],"priority":"★★☆"},"related_words":{"derivatives":["mixed (adjective)","mix (verb, noun)","mixture (noun)"],"phrases":["mixed feelings","mixed bag","mixed blessing"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Low frequency)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"mixedly\" is an adverb that means \"in a mixed manner\" or \"with mixed feelings.\" It is used to describe situations or actions where different elements, qualities, or emotions are combined. This word is less common and more formal than the adjective \"mixed.\" It is typically used in descriptive contexts to indicate a blend of various aspects or emotions. Due to its relatively low frequency, it is more likely to be encountered in advanced or formal texts."},"example_sentences":[{"sentence":"The project was met mixedly by the team, with some excited and others hesitant.","translation":"そのプロジェクトは、チームによって、興奮している人もいれば躊躇している人もいて、さまざまな反応で迎えられた。","type":"adverb","meaning_category":"入り混じって"},{"sentence":"The children, mixedly excited and nervous, lined up for the school play.","translation":"子供たちは、興奮と緊張が入り混じった複雑な気持ちで、学芸会の列に並んだ。","type":"adverb","meaning_category":"感情が入り混じって"},{"sentence":"The results of the experiment were mixedly successful, with some trials yielding positive outcomes and others failing.","translation":"実験の結果は、成功した試行もあれば失敗した試行もあり、結果が入り混じっていた。","type":"adverb","meaning_category":"混合して"}]}