{"word":"Bendee","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(Canada, regional) A type of flexible, usually wooden, toy figure or doll that can be bent into different poses.","english_definition":"A type of flexible, usually wooden, toy figure or doll that can be bent into different poses.","examples":[{"sentence":"My grandmother collected Bendee dolls when she was a child.","translation":"私の祖母は子供の頃、Bendee人形を集めていました。"},{"sentence":"The Bendee toy was popular in the mid-20th century.","translation":"Bendeeのおもちゃは20世紀半ばに人気がありました。"}],"collocations":["Bendee doll","wooden Bendee","vintage Bendee"],"synonyms":["flexible toy","poseable figure"],"antonyms":[]}],"etymology":{"value":"Likely a proprietary name or trademark that has become genericized in some regions. The origin of the name itself is uncertain, but it likely relates to the toy's ability to be 'bent'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɛndiː/","syllables":"Ben-dee"},"inflection":{"noun_plural":"Bendees"},"usage_notes":{"explanation":"'Bendee' is primarily used in Canada and possibly some other regions to refer to a specific type of flexible toy figure. It's less commonly known outside of these areas. The term may have originated as a brand name.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I bought a bendee for my child, but it was made of plastic.","correct":"✓ I bought a flexible toy for my child, but it was made of plastic.","note":"If the toy is not specifically a 'Bendee' brand or a similar wooden figure, it's more accurate to use a general term like 'flexible toy'."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, regional usage.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Bendee' is a relatively uncommon word, primarily used in specific regions (especially Canada) to refer to a particular type of flexible toy figure. Understanding the word requires familiarity with regional toy history and marketing. Outside of these regions, the term is unlikely to be recognized. If referring to a similar toy in a broader context, more general terms like 'flexible toy' or 'poseable figure' are more appropriate."},"example_sentences":[{"sentence":"She carefully positioned the **Bendee** on the shelf.","translation":"彼女は注意深くBendeeを棚の上に置いた。","type":"noun","meaning_category":"toy figure"},{"sentence":"Many antique stores carry vintage **Bendee** dolls.","translation":"多くのアンティークショップがヴィンテージのBendee人形を扱っている。","type":"noun","meaning_category":"toy figure"}]}