{"word":"megalopore","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A very large pore, especially in the context of materials science or geology.","english_definition":"A pore or void of exceptionally large size, typically exceeding 50 nanometers in diameter.","examples":[{"sentence":"The material's high permeability is attributed to the presence of numerous megalopores.","translation":"その材料の高い透過性は、多数の巨大細孔の存在に起因する。"},{"sentence":"Megalopores in the rock matrix facilitate fluid flow.","translation":"岩石マトリックス中の巨大細孔は、流体の流れを促進する。"}],"collocations":["high megalopore density","interconnected megalopores","megalopore structure","megalopore network"],"synonyms":["macropore","large pore","void"],"antonyms":["micropore","mesopore"]}],"etymology":{"value":"Derived from the Greek words 'megas' (μέγας) meaning 'large' and 'poros' (πόρος) meaning 'pore'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɛɡəloʊˈpɔːr/","syllables":"meg-a-lo-pore"},"inflection":{"noun_plural":"megalopores"},"usage_notes":{"explanation":"The term 'megalopore' is primarily used in technical fields such as materials science, geology, and occasionally in biology to describe unusually large pores or voids within a material's structure. It is often contrasted with micropores and mesopores, which are smaller.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The megalopore was microscopic.","correct":"✓ The megalopore was macroscopic.","note":"Megalopores are, by definition, large and often visible under magnification or even to the naked eye, so they are macroscopic, not microscopic."}],"priority":"★★☆"},"related_words":{"derivatives":["megaporous (adjective)"],"related_terms":["pore","micropore","mesopore","macropore","porosity","permeability"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Megalopore' is a technical term used in scientific contexts, specifically when discussing the structure and properties of materials with large pores. Understanding this term requires familiarity with concepts from materials science or geology, such as porosity and permeability. It's not a word commonly encountered in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The presence of interconnected megalopores significantly enhances the material's ability to absorb liquids.","translation":"相互接続された巨大細孔の存在は、材料の液体吸収能力を大幅に向上させる。","type":"general","meaning_category":"definition"},{"sentence":"Geologists study the distribution of megalopores in sedimentary rocks to understand fluid migration pathways.","translation":"地質学者は、流体の移動経路を理解するために、堆積岩中の巨大細孔の分布を研究する。","type":"specific","meaning_category":"application"}]}