{"word":"telescoping","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"望遠鏡のように伸縮すること、またはその機構","english_definition":"The act or process of something sliding or fitting into itself, like the sections of a telescope.","examples":[{"sentence":"The telescoping of the antenna made it easy to carry.","translation":"アンテナが伸縮式だったので、持ち運びが簡単だった。"},{"sentence":"The telescoping handle allows for adjustable height.","translation":"伸縮式のハンドルで高さを調節できます。"}],"collocations":["telescoping antenna","telescoping handle","telescoping mechanism"],"synonyms":["collapsing","compressing","retracting"],"antonyms":["extending","expanding","protruding"]},{"part_of_speech":"adjective","definition":"望遠鏡のように伸縮する","english_definition":"Having sections that slide or fit into each other.","examples":[{"sentence":"He used a telescoping ladder to reach the roof.","translation":"彼は屋根に届くように伸縮式の梯子を使った。"},{"sentence":"The telescoping arm of the crane extended over the construction site.","translation":"クレーンの伸縮アームが建設現場の上に伸びた。"}],"collocations":["telescoping ladder","telescoping arm","telescoping pole"],"synonyms":["collapsible","retractable","extendable"],"antonyms":["fixed","non-adjustable","rigid"]},{"part_of_speech":"verb","definition":"(天文学)望遠鏡で観察する","english_definition":"To observe with a telescope.","examples":[{"sentence":"Astronomers are telescoping the night sky to search for new planets.","translation":"天文学者たちは新しい惑星を探すために、望遠鏡で夜空を観察している。"}],"collocations":["telescoping the sky","telescoping distant objects"],"synonyms":["observing","viewing","scanning"],"antonyms":["ignoring","overlooking"]},{"part_of_speech":"verb","definition":"(比喩的に)短縮する、圧縮する、要約する","english_definition":"To make something shorter or more concise; to condense.","examples":[{"sentence":"The author telescoped the events of the war into a single chapter.","translation":"著者は戦争の出来事を1つの章に要約した。"},{"sentence":"We need to telescope the presentation to fit the time limit.","translation":"時間制限に合わせるために、プレゼンテーションを短縮する必要があります。"}],"collocations":["telescoping the story","telescoping the report","telescoping the timeline"],"synonyms":["condensing","shortening","abridging","summarizing"],"antonyms":["expanding","lengthening","elaborating"]}],"etymology":{"value":"The word \"telescoping\" comes from the noun \"telescope,\" which was coined in the early 17th century from the Greek words \"tele\" (distant) and \"skopein\" (to view). \"Telescoping\" as a verb and adjective developed later, describing the action or characteristic of something that can extend or retract like a telescope.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɛləskoʊpɪŋ/","syllables":"te-le-scop-ing"},"inflection":{"verb_forms":{"present_simple":["telescopes"],"past_simple":"telescoped","past_participle":"telescoped","present_participle":"telescoping"},"noun_plural":"telescopings"},"usage_notes":{"explanation":"The term \"telescoping\" is used both literally, to describe objects that physically extend and retract like a telescope, and figuratively, to describe the process of condensing or shortening information or events. When used literally, it often refers to mechanical devices or structures. When used figuratively, it implies a deliberate act of summarizing or compressing something for brevity or clarity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The car was telescoping after the accident.","correct":"✓ The car was telescoped after the accident.","note":"In the context of a car accident, \"telescoped\" is used to describe the result of the impact, not the action of the car itself. The verb should be in the past participle form to indicate the state of being compressed or crushed. Alternatively, one could say \"The front of the car telescoped.\""},{"incorrect":"✗ He is telescoping the meeting.","correct":"✓ He is shortening the meeting. / ✓ He is telescoping the agenda of the meeting.","note":"When referring to shortening a meeting, it's more appropriate to say \"shortening the meeting\" or \"telescoping the agenda of the meeting.\" \"Telescoping the meeting\" is less common and might sound awkward."}],"priority":"★★☆"},"related_words":{"derivatives":["telescope (noun)","telescoped (adjective, past participle)"],"phrasal_verbs":[],"related_concepts":["compression","condensation","summarization","retraction","extension"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in technical and descriptive contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"telescoping\" has multiple meanings. Literally, it describes something that can extend and retract like a telescope. Figuratively, it means to condense or shorten something, like a story or presentation. It's often used in technical contexts to describe mechanical devices or structures with adjustable lengths. Understanding the context is crucial to interpreting the intended meaning. The figurative use requires a higher level of reading comprehension.","priority":"★☆☆"},"example_sentences":[{"sentence":"The **telescoping** legs of the tripod made it easy to adjust the camera's height.","translation":"三脚の伸縮脚のおかげで、カメラの高さを簡単に調整できた。","type":"adjective","meaning_category":"伸縮する"},{"sentence":"The metal sheets **telescoped** upon impact, causing significant damage to the vehicle.","translation":"金属板は衝突時に伸縮し、車両に重大な損傷を与えた。","type":"verb","meaning_category":"伸縮する"},{"sentence":"She **telescoped** her presentation to fit within the allotted time.","translation":"彼女は割り当てられた時間内に収まるようにプレゼンテーションを短縮した。","type":"verb","meaning_category":"短縮する"},{"sentence":"The **telescoping** action of the piston is essential for the engine's operation.","translation":"ピストンの伸縮運動は、エンジンの動作に不可欠である。","type":"noun","meaning_category":"伸縮すること"}]}