{"word":"exorbitancy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"法外なこと、過度なこと、途方もないこと","english_definition":"the state or quality of exceeding the bounds of custom, reason, or propriety; excessiveness.","examples":[{"sentence":"The exorbitancy of the price discouraged potential buyers.","translation":"その価格の法外さが、潜在的な買い手を躊躇させた。"},{"sentence":"He complained about the exorbitancy of the taxes.","translation":"彼は税金の法外さについて不満を述べた。"},{"sentence":"The exorbitancy of her demands led to the breakdown of negotiations.","translation":"彼女の要求の途方もなさが、交渉決裂につながった。"}],"collocations":["price exorbitancy (法外な価格)","tax exorbitancy (法外な税金)","demand exorbitancy (法外な要求)"],"synonyms":["excessiveness","immoderation","outrageousness","unreasonableness","extravagance","profusion"],"antonyms":["reasonableness","moderation","fairness","adequacy"]}],"etymology":{"value":"Late Middle English: from Old French exorbitance, from late Latin exorbitantia, from exorbitare ‘deviate from the track’ (see exorbitant).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪɡˈzɔːrbɪtənsi/","syllables":"ex-or-bi-tan-cy"},"inflection":{"noun_plural":"exorbitancies"},"usage_notes":{"explanation":"\"Exorbitancy\" refers to a state of being excessive or unreasonable, often in terms of cost, demands, or other measurable quantities. It implies a deviation from what is considered fair, just, or appropriate. It is often used in formal contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The exorbitancy of the building was amazing.","correct":"✓ The size/grandeur of the building was amazing.","note":"\"Exorbitancy\" refers to excessiveness, not impressiveness. Use words like \"size,\" \"grandeur,\" or \"scale\" to describe impressive buildings. "},{"incorrect":"✗ The exorbitancy of the weather made it difficult to travel.","correct":"✓ The severity of the weather made it difficult to travel.","note":"\"Exorbitancy\" is usually applied to quantities or demands. Use words like \"severity,\" \"intensity,\" or \"harshness\" to describe extreme weather."}],"priority":"★☆☆"},"related_words":{"derivatives":["exorbitant (adjective: 法外な、過度の)","exorbitantly (adverb: 法外に、過度に)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Exorbitancy\" is a formal and relatively uncommon word that describes something exceeding reasonable or acceptable limits, often in terms of price or demands. It's used to express a strong sense of disapproval or criticism towards the excessive nature of something. You're more likely to encounter it in written texts, especially in legal or economic contexts, rather than in everyday conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The sheer exorbitancy of the fees made the course unaffordable for many students.","translation":"その授業料の法外さゆえに、多くの学生にとって受講不可能になった。","type":"noun","meaning_category":"excessiveness (fees)"},{"sentence":"The exorbitancy of the landlord's demands forced the tenants to seek legal counsel.","translation":"家主の法外な要求は、テナントに弁護士の助けを求めさせた。","type":"noun","meaning_category":"excessiveness (demands)"},{"sentence":"The critics condemned the exorbitancy of the government's spending on the project.","translation":"批評家たちは、政府のそのプロジェクトへの支出の法外さを非難した。","type":"noun","meaning_category":"excessiveness (spending)"}]}