{"word":"Turpin","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(人名)ターピン：英語圏の姓、男性名","english_definition":"A surname and a male given name of English origin.","examples":[{"sentence":"The Turpin family has lived in this town for generations.","translation":"ターピン家はこの町に何世代も住んでいる。"},{"sentence":"I met a man named Turpin at the conference.","translation":"会議でターピンという男性に会った。"}],"collocations":["Surname Turpin","Given name Turpin"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(歴史)ディック・ターピン：18世紀のイギリスの有名な追いはぎ","english_definition":"Dick Turpin (1705-1739): A notorious English highwayman of the 18th century.","examples":[{"sentence":"Dick Turpin is a legendary figure in English folklore.","translation":"ディック・ターピンはイギリスの民間伝承における伝説的な人物だ。"},{"sentence":"Many stories are told about Dick Turpin's daring exploits.","translation":"ディック・ターピンの大胆な冒険について多くの物語が語られている。"}],"collocations":["Dick Turpin","Highwayman Dick Turpin"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The surname Turpin is derived from the Old Norse personal name Þorbjörn, meaning \"Thor's bear\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtɜːrpɪn/","syllables":"Tur-pin"},"inflection":{},"usage_notes":{"explanation":"Turpin is a relatively uncommon surname and given name. It is most well-known in connection with Dick Turpin, the infamous highwayman.","priority":"★★☆"},"common_mistakes":{},"related_words":{},"level_frequency":{},"readability_explanation":{"level":"B2","text":"Turpin is a name with historical and cultural significance, primarily associated with the legendary highwayman Dick Turpin. While not a common name today, its historical context makes it recognizable, especially in British culture. The name itself has Norse origins, adding to its interesting background."},"example_sentences":[{"sentence":"Mr. Turpin is the new history teacher at our school.","translation":"ターピン先生は私たちの学校の新しい歴史教師だ。","type":"surname","meaning_category":"人名"},{"sentence":"The legend of Dick Turpin has been romanticized in many books and films.","translation":"ディック・ターピンの伝説は多くの本や映画で美化されてきた。","type":"historical figure","meaning_category":"歴史上の人物"}]}