{"word":"fluorhydric","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"フッ化水素の、フッ化水素酸の","english_definition":"Relating to or containing hydrogen fluoride or hydrofluoric acid.","examples":[{"sentence":"Fluorhydric acid is a highly corrosive substance.","translation":"フッ化水素酸は非常に腐食性の高い物質です。"},{"sentence":"The reaction requires a fluorhydric environment.","translation":"その反応にはフッ化水素の環境が必要です。"}],"collocations":["fluorhydric acid","fluorhydric environment"],"synonyms":["hydrofluoric"],"antonyms":[]}],"etymology":{"value":"The word \"fluorhydric\" is derived from \"fluor-\" (referring to fluorine) and \"hydric\" (referring to hydrogen). It indicates the presence of both fluorine and hydrogen in a compound, specifically hydrogen fluoride (HF).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌflʊərˈhaɪdrɪk/","syllables":"flu-or-hy-dric"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are less common for this word."},"usage_notes":{"explanation":"\"Fluorhydric\" is a technical term primarily used in chemistry and related fields to describe substances or environments containing hydrogen fluoride (HF). It is most commonly encountered in the phrase \"fluorhydric acid,\" which is the aqueous solution of hydrogen fluoride.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The fluorhydric is dangerous.","correct":"✓ Fluorhydric acid is dangerous.","note":"\"Fluorhydric\" is an adjective, so it needs to modify a noun. Using \"fluorhydric\" alone is grammatically incorrect; you should specify what is fluorhydric (e.g., fluorhydric acid)."}],"priority":"★★☆"},"related_words":{"derivatives":["fluoride","fluorine","hydrofluoric acid"],"related_terms":["hydrogen fluoride (HF)","acid"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"fluorhydric\" is a highly technical term primarily used in chemistry. It is used to describe something that contains or relates to hydrogen fluoride (HF). Its use is confined to scientific or technical contexts. Therefore, it is not commonly encountered in general language use."},"example_sentences":[{"sentence":"The etching process uses fluorhydric solutions to selectively remove materials.","translation":"エッチングプロセスでは、フッ化水素溶液を使用して材料を選択的に除去します。","type":"adjective","meaning_category":"フッ化水素の"},{"sentence":"Safety protocols are essential when working with fluorhydric compounds.","translation":"フッ化水素化合物を取り扱う際には、安全プロトコルが不可欠です。","type":"adjective","meaning_category":"フッ化水素酸の"}]}