{"word":"cattie","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(Scottish, Northern English dialect) A lively, mischievous, or headstrong girl or young woman.","english_definition":"A lively, mischievous, or headstrong girl or young woman.","examples":[{"sentence":"She's a right cattie, that one, always getting into scrapes.","translation":"あの子は本当にいたずらっ子で、いつも騒動に巻き込まれている。"},{"sentence":"The cattie was known for her quick wit and independent spirit.","translation":"そのおてんば娘は、機転の利くところと独立心で知られていた。"}],"collocations":[],"synonyms":["minx","hoyden","tomboy","urchin","scamp"],"antonyms":[],"notes":"This term is primarily used in Scottish and Northern English dialects and may not be widely understood elsewhere."}],"etymology":{"value":"Likely a diminutive of 'cat', suggesting a playful or mischievous nature.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkæti/","syllables":"cat-tie"},"inflection":{"noun_plural":"catties"},"usage_notes":{"explanation":"'Cattie' is a dialectal term, mainly found in Scotland and Northern England. It describes a young woman who is spirited, lively, and perhaps a bit mischievous. It's not typically used in formal contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He's such a cattie!","correct":"✓ She's such a cattie!","note":"The term is specifically used for girls or young women."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrases":[],"related_terms":["cat (noun)","kitten (noun)"]},"level_frequency":{"CEFR":"N/A (dialectal term)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Cattie' is a dialectal term primarily used in Scotland and Northern England to describe a lively, mischievous, or headstrong girl or young woman. It's not commonly used in standard English, so understanding it requires familiarity with regional dialects. The term carries a slightly affectionate or playful connotation, suggesting a spirited and independent nature. Because of its limited usage, it's important to be aware of the context and audience when using this word."},"example_sentences":[{"sentence":"The wee cattie was always climbing trees and playing pranks.","translation":"その小さないたずらっ子はいつも木に登ったり、悪ふざけをしたりしていた。","type":"noun","meaning_category":"Mischievous girl"},{"sentence":"She was known as a bit of a cattie in her youth, always full of energy and daring.","translation":"彼女は若い頃、少しおてんばとして知られており、いつもエネルギーと大胆さに満ち溢れていた。","type":"noun","meaning_category":"Lively girl"}]}