{"word":"Pyrrhonistic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"ピュロン主義の、懐疑主義的な","english_definition":"Relating to or characteristic of Pyrrhonism; skeptical.","examples":[{"sentence":"His Pyrrhonistic views made it difficult for him to accept any claim as absolutely true.","translation":"彼のピュロン主義的な見解は、いかなる主張も絶対的な真実として受け入れることを困難にした。"},{"sentence":"The philosopher adopted a Pyrrhonistic approach to knowledge, questioning all assumptions.","translation":"その哲学者は知識に対してピュロン主義的なアプローチを採用し、すべての前提を疑った。"}],"collocations":["Pyrrhonistic skepticism","Pyrrhonistic doubt","Pyrrhonistic philosophy","Pyrrhonistic attitude"],"synonyms":["skeptical","doubting","agnostic","questioning","cynical"],"antonyms":["dogmatic","certain","assertive","believing"]},{"part_of_speech":"adjective","definition":"(特に)極端な懐疑主義の","english_definition":"Characterized by extreme skepticism, especially regarding the possibility of knowledge.","examples":[{"sentence":"The author's Pyrrhonistic stance led him to deny the possibility of objective truth.","translation":"その著者のピュロン主義的な立場は、彼に客観的な真実の可能性を否定させた。"},{"sentence":"A Pyrrhonistic critique of science challenges the very foundations of empirical knowledge.","translation":"科学に対するピュロン主義的な批判は、経験的知識のまさに基礎に挑戦する。"}],"collocations":["extreme Pyrrhonistic","radical Pyrrhonistic","Pyrrhonistic critique","Pyrrhonistic denial"],"synonyms":["radical skepticism","extreme doubt","nihilistic","unbelieving"],"antonyms":["trusting","credulous","gullible"]}],"etymology":{"value":"Derived from 'Pyrrho,' the name of a Greek philosopher (c. 360-270 BC) who founded the school of skepticism known as Pyrrhonism, plus the suffix '-istic,' indicating a characteristic or relating to.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɪrəˈnɪstɪk/","syllables":"Pyr-rho-nis-tic"},"inflection":{"notes":"Adjectives do not typically inflect in English, except for comparative and superlative forms, which are not commonly used with 'Pyrrhonistic' due to its already extreme meaning."},"usage_notes":{"explanation":"'Pyrrhonistic' is used to describe something related to Pyrrhonism, a school of philosophical skepticism founded by Pyrrho of Elis. It implies a deep and pervasive doubt about the possibility of attaining certain knowledge. It is often used in philosophical or academic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ His approach was pyrrhonic, leading to many errors.","correct":"✓ His approach was Pyrrhonistic, leading to many doubts.","note":"'Pyrrhonic' is not the correct form. The adjective is 'Pyrrhonistic,' referring to Pyrrhonism."},{"incorrect":"✗ She had a very pyrrhic view of the world.","correct":"✓ She had a very Pyrrhonistic view of the world.","note":"'Pyrrhic' relates to a victory won at too great a cost, while 'Pyrrhonistic' relates to skepticism. They are different concepts."}],"priority":"★★☆"},"related_words":{"derivatives":["Pyrrho (noun: the founder of Pyrrhonism)","Pyrrhonism (noun: the philosophical school of skepticism)","Pyrrhonian (noun/adjective: relating to Pyrrhonism)"],"phrases":["Pyrrhonistic skepticism","Pyrrhonistic attitude"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Pyrrhonistic' is a specialized term primarily used in philosophical discussions. It describes a form of extreme skepticism that questions the possibility of attaining certain knowledge. Understanding this word requires familiarity with philosophical concepts and terminology."},"example_sentences":[{"sentence":"The professor's Pyrrhonistic arguments challenged the students' deeply held beliefs.","translation":"その教授のピュロン主義的な議論は、学生たちの深く抱かれていた信念に挑戦した。","type":"general","meaning_category":"philosophical skepticism"},{"sentence":"A Pyrrhonistic analysis of the evidence led to the conclusion that no definitive judgment could be made.","translation":"証拠に対するピュロン主義的な分析は、いかなる決定的な判断も下せないという結論に至った。","type":"analysis","meaning_category":"skeptical analysis"},{"sentence":"The author's Pyrrhonistic tendencies are evident in his constant questioning of established norms.","translation":"その著者のピュロン主義的な傾向は、確立された規範に対する彼の絶え間ない疑問視に明らかである。","type":"tendencies","meaning_category":"questioning norms"}]}