{"word":"Multiparity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"多産婦、経産婦（複数回出産経験のある女性）","english_definition":"The condition of having carried two or more pregnancies to the point of viability (regardless of the outcome).","examples":[{"sentence":"Multiparity increases the risk of certain pregnancy complications.","translation":"多産は特定の妊娠合併症のリスクを高めます。"},{"sentence":"The study focused on the effects of multiparity on maternal health.","translation":"その研究は、多産が母体の健康に及ぼす影響に焦点を当てました。"}],"collocations":["high multiparity (高多産)","grand multiparity (経産回数の多い多産)"],"synonyms":["pluriparity","multigravida"],"antonyms":["nulliparity (未産)","primiparity (初産)"]}],"etymology":{"value":"Derived from the Latin words 'multi-' (meaning 'many') and 'parere' (meaning 'to give birth').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmʌltɪˈpærɪti/","syllables":"mul-ti-par-i-ty"},"inflection":{"noun_plural":"multiparitites"},"usage_notes":{"explanation":"'Multiparity' is a medical term used to describe a woman who has had two or more pregnancies that resulted in a viable birth (regardless of whether the child was born alive or stillborn). It's important in obstetrics and gynecology for assessing risks and managing care during pregnancy and childbirth. The term is distinct from 'multigravida,' which refers to a woman who has been pregnant more than once, irrespective of whether the pregnancies resulted in a live birth.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient is a multipara, meaning she is pregnant for the first time.","correct":"✓ The patient is a multipara, meaning she has had two or more pregnancies that reached viability.","note":"Multiparity/multipara refers to having had multiple pregnancies that reached viability, not the first pregnancy."},{"incorrect":"✗ Multiparity is the same as multigravida.","correct":"✓ Multiparity refers to having had multiple viable pregnancies, while multigravida refers to having been pregnant multiple times, regardless of outcome.","note":"Multiparity and multigravida are related but distinct terms. Multigravida includes all pregnancies, while multiparity specifically refers to those that reached the point of viability."}],"priority":"★★☆"},"related_words":{"derivatives":["multipara (多産婦、経産婦)","multiparous (多産の)","primiparity (初産)","nulliparity (未産)","gravidity (妊娠回数)","parity (出産回数)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (Specialized vocabulary)","frequency_google_ngram":"Low frequency. Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Multiparity' is a specialized medical term used to describe a woman who has had two or more pregnancies that reached the point of viability. It is commonly used in obstetrics and gynecology to assess potential risks and manage care during pregnancy and childbirth. The term is distinct from 'multigravida,' which refers to a woman who has been pregnant more than once, regardless of the outcome of the pregnancies. Understanding this term requires knowledge of medical terminology and context.","priority":"★★☆"},"example_sentences":[{"sentence":"Advanced maternal age and multiparity are risk factors for uterine rupture.","translation":"高齢出産と多産は、子宮破裂の危険因子です。","type":"medical context","meaning_category":"obstetrics"},{"sentence":"Women with high multiparity may experience increased pelvic floor dysfunction.","translation":"多産回数の多い女性は、骨盤底機能障害が増加する可能性があります。","type":"medical context","meaning_category":"gynecology"}]}