{"word":"dorrbeetle","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主にイギリス英語) センチコガネ (糞虫の一種)","english_definition":"(chiefly British) a dung beetle, especially of the genus Geotrupes.","examples":[{"sentence":"The dorrbeetle flew clumsily around the dung heap.","translation":"センチコガネが糞の山を不器用に飛び回った。"},{"sentence":"I found a dorrbeetle burrowing in the soil.","translation":"土の中に潜っているセンチコガネを見つけた。"}],"collocations":["dorrbeetle larva","dorrbeetle burrow","dung beetle"],"synonyms":["dung beetle","tumblebug","earth-boring dung beetle"],"antonyms":[]},{"part_of_speech":"noun","definition":"(古語) カブトムシやクワガタムシなどの大型の甲虫の総称","english_definition":"(archaic) a general term for large beetles, such as stag beetles or rhinoceros beetles.","examples":[{"sentence":"In olden times, any large beetle might be called a dorrbeetle.","translation":"昔は、どんな大型の甲虫もセンチコガネと呼ばれていたかもしれない。"}],"collocations":[],"synonyms":["beetle","stag beetle","rhinoceros beetle"],"antonyms":[]}],"etymology":{"value":"Middle English 'dorre' (drone, buzzing insect) + 'beetle'. The 'dorre' part refers to the buzzing sound the beetle makes when flying.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɔːrˌbiːtl/","syllables":"dorr-bee-tle"},"inflection":{"noun_plural":"dorrbeetles"},"usage_notes":{"explanation":"The term \"dorrbeetle\" is primarily used in British English to refer to dung beetles, particularly those of the Geotrupes genus. In older usage, it could refer to any large beetle. The name comes from the buzzing sound the beetle makes while flying.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a dorrbeetle in my garden, it was very colorful.","correct":"✓ I saw a dorrbeetle in my garden. They are usually black or brown.","note":"Dorrbeetles are typically not very colorful; they are usually black or brown. Colorful beetles would likely be another species."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_species":["Geotrupes stercorarius (センチコガネの学名)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"(Not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dorrbeetle' is a relatively uncommon word, primarily used in British English to describe a type of dung beetle. It is not a word typically encountered in everyday conversation or general reading materials. Understanding and use of this word would indicate a more advanced vocabulary and familiarity with regional or specialized terminology. The archaic meaning is even less common.","priority":"★☆☆"},"example_sentences":[{"sentence":"The children were fascinated by the dorrbeetle rolling a ball of dung.","translation":"子供たちはセンチコガネが糞の塊を転がすのに魅了された。","type":"noun","meaning_category":"dung beetle"},{"sentence":"The naturalist identified the beetle as a dorrbeetle, noting its distinctive buzzing sound.","translation":"博物学者はその甲虫をセンチコガネだと特定し、特徴的な羽音に注目した。","type":"noun","meaning_category":"dung beetle"}]}