{"word":"counterfactual conditional","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"反実仮想条件文（もし～だったら、…だろうに、という過去の事実に反する仮定に基づく文）","english_definition":"A conditional statement that asserts what would be the case if an event contrary to fact had occurred.","examples":[{"sentence":"The sentence 'If I had studied harder, I would have passed the exam' is a counterfactual conditional.","translation":"「もしもっと一生懸命勉強していたら、試験に合格していただろうに」という文は反実仮想条件文です。"},{"sentence":"Counterfactual conditionals are often used to explore alternative possibilities in the past.","translation":"反実仮想条件文は、過去における別の可能性を探るためによく用いられます。"},{"sentence":"Understanding counterfactual conditionals is important in causal reasoning.","translation":"反実仮想条件文を理解することは、因果関係の推論において重要です。"}],"collocations":["express a counterfactual conditional","use a counterfactual conditional","analyze counterfactual conditionals","interpret counterfactual conditionals"],"synonyms":["subjunctive conditional","hypothetical conditional (in some contexts)"],"antonyms":[]}],"etymology":{"value":"The term combines 'counterfactual' (contrary to the facts) with 'conditional' (expressing a condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkaʊntərfæktʃuəl kənˈdɪʃənəl/","syllables":"coun-ter-fac-tu-al con-di-tion-al"},"inflection":{"notes":"This is a noun phrase. It does not inflect."},"usage_notes":{"explanation":"Counterfactual conditionals are used to discuss scenarios that did not happen. They typically use the past perfect tense in the 'if' clause and 'would have' + past participle in the main clause. They are important in philosophy, history, and other fields where alternative possibilities are considered.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"If I would have known, I would have told you.","correct":"If I had known, I would have told you.","note":"The 'if' clause should use the past perfect tense (had + past participle), not 'would have'."},{"incorrect":"If I knew, I would have told you.","correct":"If I had known, I would have told you.","note":"The 'if' clause needs to be in the past perfect to indicate a condition contrary to past fact."}],"priority":"★★☆"},"related_words":{"derivatives":["counterfactual (adjective, noun)","conditional (adjective, noun)"],"phrases":["possible world","modal logic","causal inference"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in academic and philosophical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'counterfactual conditional' is a technical term used in philosophy, logic, and related fields. It refers to a specific type of conditional statement that discusses what *would have* happened if something *had* been different in the past. Understanding this term requires familiarity with advanced concepts in logic and reasoning."},"example_sentences":[{"sentence":"If the Titanic had not hit the iceberg, it would have arrived safely in New York.","translation":"もしタイタニック号が氷山に衝突していなかったら、ニューヨークに無事に到着していただろう。","type":"example","meaning_category":"illustrative"},{"sentence":"Economists use counterfactual conditionals to analyze the effects of different policy choices.","translation":"経済学者は、異なる政策選択の効果を分析するために反実仮想条件文を使用します。","type":"example","meaning_category":"application"},{"sentence":"Historians often engage in counterfactual reasoning to explore alternative historical outcomes.","translation":"歴史家は、別の歴史的結果を探るために、反実仮想的な推論を行うことがよくあります。","type":"example","meaning_category":"application"}]}