{"word":"unliberalised","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"自由化されていない、規制緩和されていない","english_definition":"Not having been made more free or open, especially in terms of economic or political systems.","examples":[{"sentence":"The unliberalised market faced significant barriers to entry.","translation":"その自由化されていない市場は、参入に対する大きな障壁に直面していた。"},{"sentence":"Despite reforms in other sectors, the agricultural industry remained largely unliberalised.","translation":"他の分野での改革にもかかわらず、農業部門は依然として大部分が自由化されていなかった。"}],"collocations":["unliberalised market (自由化されていない市場)","unliberalised economy (自由化されていない経済)","remain unliberalised (自由化されていないままである)"],"synonyms":["regulated","restricted","controlled","protected"],"antonyms":["liberalised","deregulated","open","free"]},{"part_of_speech":"adjective","definition":"(特に政治的・社会的に)寛容でない、自由主義的でない","english_definition":"Not having been made more tolerant or open-minded, especially in terms of political or social views.","examples":[{"sentence":"The unliberalised society held traditional values tightly.","translation":"その自由主義的でない社会は、伝統的な価値観を強く保持していた。"},{"sentence":"His unliberalised views were out of step with the younger generation.","translation":"彼の自由主義的でない見解は、若い世代とは相容れないものだった。"}],"collocations":["unliberalised views (自由主義的でない見解)","unliberalised society (自由主義的でない社会)"],"synonyms":["conservative","traditional","illiberal","intolerant"],"antonyms":["liberal","progressive","tolerant","open-minded"]}],"etymology":{"value":"Derived from 'un-' (prefix meaning 'not'), combined with 'liberalised' (past participle of 'liberalise', meaning to make more liberal).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈlɪbərəlˌaɪzd/","syllables":"un-lib-er-al-ised"},"inflection":{"notes":"Adjective, so it can be modified by adverbs (e.g., 'highly unliberalised') but does not have comparative or superlative forms."},"usage_notes":{"explanation":"'Unliberalised' is used to describe something that has not undergone a process of becoming more free or open. It is commonly used in economic and political contexts to refer to markets, industries, or systems that have not been deregulated or made more accessible. It can also refer to societies or viewpoints that are not tolerant or open-minded. The term implies a state of being restricted or controlled, often by government regulations or traditional values.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unliberalised country was very popular with tourists.","correct":"✓ The country, being unliberalised, had fewer tourists.","note":"Unliberalised usually implies restrictions, so it's unlikely to be 'very popular with tourists' unless they are a specific type of tourist seeking that kind of experience. The corrected sentence reflects the more typical consequence of being unliberalised."},{"incorrect":"✗ He unliberalised the market.","correct":"✓ He did not liberalise the market. / The market remained unliberalised.","note":"'Unliberalise' is not a standard verb. To express the action of not liberalising, use 'did not liberalise' or describe the state as 'remaining unliberalised'."}],"priority":"★★☆"},"related_words":{"derivatives":["unliberal (adjective: not liberal)","liberalise (verb: to make more liberal)","liberalisation (noun: the process of becoming more liberal)","illiberal (adjective: not liberal; authoritarian)"],"antonyms":["liberalised (adjective: made more liberal)","deregulated (adjective: having fewer regulations)"],"synonyms":["restricted (adjective: limited or controlled)","regulated (adjective: controlled by rules or laws)","controlled (adjective: subject to control or authority)","protectionist (adjective: supporting protectionism, i.e., restricting trade)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Used primarily in specialized contexts such as economics and political science.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unliberalised' is a relatively uncommon term, primarily used in discussions of economics, politics, and social policy. It describes a state where something has not been made more free or open. This can refer to markets that are still heavily regulated, industries that are protected from competition, or societies that maintain traditional or conservative values. Understanding this word requires familiarity with the concept of liberalisation, which involves reducing restrictions and increasing freedom.","priority":"★★★"},"example_sentences":[{"sentence":"The government's decision to keep the banking sector unliberalised drew criticism from international financial institutions.","translation":"政府が銀行部門を自由化しないという決定は、国際金融機関から批判を浴びた。","type":"adjective","meaning_category":"自由化されていない (経済)"},{"sentence":"An unliberalised media landscape can stifle freedom of expression.","translation":"自由化されていないメディア環境は、表現の自由を抑制する可能性がある。","type":"adjective","meaning_category":"寛容でない (社会)"},{"sentence":"The country's unliberalised trade policies hindered economic growth.","translation":"その国の自由化されていない貿易政策は、経済成長を妨げた。","type":"adjective","meaning_category":"自由化されていない (経済)"},{"sentence":"Many felt that the education system remained unliberalised, clinging to outdated methods.","translation":"多くの人が、教育システムは依然として自由化されておらず、時代遅れの方法に固執していると感じていた。","type":"adjective","meaning_category":"寛容でない (社会)"}]}