{"word":"prognathism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"下顎前突症、顎前突（症）","english_definition":"The positional relationship of the mandible or maxilla to the skeletal base where either of the jaws protrudes beyond a predetermined imaginary line. In the case of mandibular prognathism (or 'prognathia'), the mandible protrudes beyond the maxilla. In maxillary prognathism, the maxilla protrudes beyond the mandible.","examples":[{"sentence":"Prognathism can be a hereditary condition.","translation":"下顎前突症は遺伝性の疾患である可能性がある。"},{"sentence":"Orthodontic treatment can sometimes correct prognathism.","translation":"矯正歯科治療で下顎前突症を矯正できる場合がある。"},{"sentence":"Severe cases of prognathism may require surgery.","translation":"重度の下顎前突症の場合は手術が必要になることがある。"}],"collocations":["mandibular prognathism (下顎前突症)","maxillary prognathism (上顎前突症)","surgical correction of prognathism (下顎前突症の外科的矯正)","mild prognathism (軽度の下顎前突症)","severe prognathism (重度の下顎前突症)"],"synonyms":["prognathia","protrusion of the jaw","mandibular protrusion","maxillary protrusion"],"antonyms":["retrognathism","retrognathia"]}],"etymology":{"value":"From 'pro-' (forward) + 'gnathos' (jaw) + '-ism' (condition). The term originates from Greek, reflecting the forward positioning of the jaw.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈprɒɡnəθɪzəm/","syllables":"prog-na-thism"},"inflection":{"noun_plural":"prognathisms"},"usage_notes":{"explanation":"'Prognathism' is a technical term used in dentistry, orthodontics, and anthropology to describe the abnormal protrusion of one or both jaws. It's important to specify whether it's mandibular (lower jaw) or maxillary (upper jaw) prognathism for clarity. The condition can range from mild to severe and may affect appearance, bite, and speech. Treatment options vary depending on the severity and can include orthodontics, surgery, or a combination of both.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a prognathism teeth.","correct":"✓ He has prognathism. / ✓ He has prognathic teeth.","note":"'Prognathism' is a noun referring to the condition itself. To describe the teeth, use 'prognathic' as an adjective. Alternatively, you can say 'He has prognathism' to indicate the condition."},{"incorrect":"✗ Prognathism is a disease.","correct":"✓ Prognathism is a condition.","note":"'Prognathism' is a condition or a characteristic, not a disease, although it can sometimes be associated with underlying medical issues."}],"priority":"★★☆"},"related_words":{"derivatives":["prognathic (adjective: relating to or having prognathism)","prognathous (adjective: having a projecting jaw)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (technical/medical vocabulary)","frequency_google_ngram":"Low frequency (specialized term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Prognathism' is a specialized term primarily used in medical and dental contexts. It describes a condition where the jaw protrudes abnormally. While not commonly used in everyday conversation, understanding this term is important for those in healthcare fields or when discussing related medical conditions. It's crucial to differentiate between mandibular and maxillary prognathism for accurate communication.","note":"This term is primarily encountered in medical or dental contexts and is not part of common vocabulary."},"example_sentences":[{"sentence":"The patient presented with significant mandibular **prognathism**.","translation":"患者は顕著な下顎前突症を呈していた。","type":"noun","meaning_category":"下顎前突症"},{"sentence":"Surgical intervention is often necessary to correct severe **prognathism**.","translation":"重度の下顎前突症を矯正するには、外科的介入が必要となることが多い。","type":"noun","meaning_category":"下顎前突症"},{"sentence":"Genetic factors can contribute to the development of **prognathism**.","translation":"遺伝的要因が下顎前突症の発症に関与することがある。","type":"noun","meaning_category":"下顎前突症"}]}