{"word":"Octahedrite","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"正八面体鉱","english_definition":"A rare titanium dioxide mineral, one of the three naturally occurring crystalline forms of TiO2, the others being rutile and brookite. It crystallizes in the tetragonal system and is typically found as small, well-formed crystals.","examples":[{"sentence":"The octahedrite crystals were small but perfectly formed.","translation":"その正八面体鉱の結晶は小さかったが、完璧な形をしていた。"}],"collocations":["octahedrite crystal","octahedrite specimen"],"synonyms":["anatase (a more common name for the same mineral)"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'ὀκτώ' (oktō) meaning 'eight' and 'ἕδρα' (hedra) meaning 'face' or 'seat', referring to the mineral's typical crystal shape, which resembles an octahedron (an eight-faced solid).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒktəˈhiːdraɪt/","syllables":"Oc-ta-he-drite"},"inflection":{"noun_plural":"octahedrites"},"usage_notes":{"explanation":"'Octahedrite' is a mineralogical term. It's a relatively uncommon word outside of geology and mineralogy contexts. The term 'anatase' is often used synonymously and is more widely known.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I found a octahedrite.","correct":"✓ I found an octahedrite.","note":"'Octahedrite' begins with a vowel sound, so the indefinite article 'an' should be used."}],"priority":"★★☆"},"related_words":{"derivatives":["octahedral (adjective: relating to an octahedron)","anatase (synonym: a more common name for the same mineral)","rutile (related mineral: another form of TiO2)","brookite (related mineral: another form of TiO2)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency - a specialized term used in mineralogy.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Octahedrite' is a technical term used in the field of mineralogy and geology. Understanding this word requires familiarity with basic geometric shapes (octahedron) and mineral classification. It is unlikely to be encountered outside of specialized scientific contexts."},"example_sentences":[{"sentence":"The museum displayed a rare specimen of blue octahedrite.","translation":"その博物館は珍しい青色の正八面体鉱の標本を展示していた。","type":"noun","meaning_category":"mineralogy"},{"sentence":"Octahedrite is a polymorph of titanium dioxide.","translation":"正八面体鉱は二酸化チタンの多形の一つである。","type":"noun","meaning_category":"chemistry"}]}