{"word":"Pan-Serb","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"汎セルビア主義の、大セルビア主義の","english_definition":"Relating to or advocating the unification of all Serbs into a single state or political entity.","examples":[{"sentence":"The Pan-Serb movement gained momentum in the 19th century.","translation":"汎セルビア主義運動は19世紀に勢いを増した。"},{"sentence":"Some historians argue that Pan-Serb ideals contributed to the outbreak of World War I.","translation":"一部の歴史家は、汎セルビア主義の理想が第一次世界大戦の勃発に貢献したと主張している。"}],"collocations":["Pan-Serb ideology","Pan-Serb nationalism","Pan-Serb aspirations","Pan-Serb policies"],"synonyms":["Greater Serbian","Serbian nationalist"],"antonyms":["anti-Serb","Yugoslavist"]},{"part_of_speech":"noun","definition":"汎セルビア主義者、大セルビア主義者","english_definition":"An advocate of Pan-Serbism.","examples":[{"sentence":"He was a fervent Pan-Serb, dedicated to uniting all Serbian lands.","translation":"彼は熱心な汎セルビア主義者であり、すべてのセルビア人の土地を統一することに尽力していた。"}],"collocations":["staunch Pan-Serb","radical Pan-Serb"],"synonyms":["Greater Serbian","Serbian nationalist"],"antonyms":["anti-Serb","Yugoslavist"]}],"etymology":{"value":"'Pan-' (all, encompassing) + 'Serb' (relating to Serbia or the Serbian people).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpænˈsɜːrb/","syllables":"Pan-Serb"},"inflection":{"notes":"The noun form can be either singular or plural depending on the context.","noun_plural":"Pan-Serbs"},"usage_notes":{"explanation":"'Pan-Serb' refers to the ideology and movement advocating the unification of all Serbs, regardless of their current country of residence, into a single state. It is often associated with Serbian nationalism and has historical and political significance, particularly in the context of the Balkans. The term can be sensitive due to its association with historical conflicts and territorial disputes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Pan-Serbian.","correct":"✓ He is a Pan-Serb.","note":"While 'Pan-Serbian' might seem like a logical alternative, 'Pan-Serb' is the more established and commonly used term."}],"priority":"★★☆"},"related_words":{"derivatives":["Pan-Serbism (noun: 汎セルビア主義)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Pan-Serb' is a specialized term related to political science and history, specifically concerning the Balkans. Understanding the term requires knowledge of the historical context of Serbian nationalism and the desire to unite all Serbs into a single political entity. The term is often used in discussions of the causes and consequences of conflicts in the region.","priority":"★★☆"},"example_sentences":[{"sentence":"The **Pan-Serb** ideology promoted the idea of a unified Serbian state.","translation":"汎セルビア主義のイデオロギーは、統一されたセルビア国家という考えを推進した。","type":"adjective","meaning_category":"汎セルビア主義の"},{"sentence":"As a **Pan-Serb**, he believed in the importance of Serbian cultural unity.","translation":"汎セルビア主義者として、彼はセルビア文化の統一の重要性を信じていた。","type":"noun","meaning_category":"汎セルビア主義者"}]}