{"word":"ilustrado","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(フィリピンの歴史) 啓蒙されたフィリピン人、知識人、特に19世紀後半のスペイン植民地時代にヨーロッパで教育を受けたフィリピン人愛国者","english_definition":"(In Philippine history) An educated Filipino; an intellectual, especially a Filipino patriot during the late 19th century Spanish colonial period who was educated in Europe.","examples":[{"sentence":"The ilustrados played a significant role in the Philippine Revolution.","translation":"イルストラド（啓蒙されたフィリピン人）たちはフィリピン革命において重要な役割を果たした。"},{"sentence":"José Rizal was one of the most famous ilustrados.","translation":"ホセ・リサールは最も有名なイルストラドの一人だった。"}],"collocations":["Filipino ilustrados","ilustrado movement","ilustrado class"],"synonyms":["intellectual","scholar","patriot","nationalist"],"antonyms":["ignorant","uneducated"]}],"etymology":{"value":"スペイン語の「ilustrado」（啓蒙された、知識のある）に由来する。動詞「ilustrar」（啓蒙する、明らかにする）から派生し、さらにラテン語の「illustrare」（照らす、明るくする）に遡る。","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˌlʊsˈtrɑːdoʊ/","syllables":"i-lus-tra-do"},"inflection":{"notes":"複数形は ilustrados"},"usage_notes":{"explanation":"「Ilustrado」は、特定の歴史的文脈、すなわち19世紀後半のフィリピンにおけるスペイン植民地時代に特有の用語です。ヨーロッパで教育を受け、啓蒙思想の影響を受けたフィリピン人エリート層を指します。彼らはフィリピンのナショナリズム運動において重要な役割を果たしました。現代では、単に「知識人」や「教養のある人」を指す言葉として使われることは稀です。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an ilustrado in modern politics.","correct":"✓ He is a modern intellectual.","note":"「Ilustrado」は歴史的な文脈でのみ使用するのが適切です。現代の政治における知識人を指す場合は、「intellectual」などの一般的な言葉を使用します。"},{"incorrect":"✗ The ilustrados were all wealthy landowners.","correct":"✓ While many ilustrados came from wealthy families, not all were landowners.","note":"イルストラドの中には裕福な家庭出身者もいましたが、全員が地主だったわけではありません。教育を受けた中産階級出身者もいました。"}],"priority":"★★☆"},"related_words":{"derivatives":["ilustracion (スペイン語: 啓蒙)"],"phrases":["La Solidaridad (イルストラドたちが創刊した新聞)","Propaganda Movement (イルストラドたちが主導した改革運動)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (歴史用語のため)","frequency_google_ngram":"低頻度 (Low frequency) - 特定の歴史的文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"ilustrado\" refers to a specific group of educated Filipinos during the Spanish colonial period in the 19th century. They were instrumental in the Philippine nationalist movement and advocated for reforms. Understanding the historical context is crucial when using this term. It is not a general term for intellectuals but rather a specific historical designation."},"example_sentences":[{"sentence":"The writings of the ilustrados inspired a generation of Filipinos to fight for independence.","translation":"イルストラドたちの著作は、独立のために戦うよう多くのフィリピン人を鼓舞した。","type":"noun","meaning_category":"啓蒙されたフィリピン人"},{"sentence":"Many ilustrados were influenced by European liberal ideas.","translation":"多くのイルストラドはヨーロッパの自由主義思想の影響を受けた。","type":"noun","meaning_category":"啓蒙されたフィリピン人"}]}