{"word":"synclastic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(数学、工学) 同主曲率の、正ガウス曲率を持つ","english_definition":"(mathematics, engineering) Having curvatures of the same sign in two orthogonal directions; having positive Gaussian curvature.","examples":[{"sentence":"A sphere is a synclastic surface.","translation":"球は同主曲率の表面です。"},{"sentence":"Synclastic surfaces are often used in lens design.","translation":"同主曲率の表面は、レンズ設計でよく使用されます。"}],"collocations":["synclastic surface","synclastic curvature"],"synonyms":["positive Gaussian curvature"],"antonyms":["anticlastic"]}],"etymology":{"value":"From the Greek words 'syn-' (together) and 'klastos' (bent).","priority":"★★☆"},"pronunciation":{"ipa":"/sɪŋˈklæstɪk/","syllables":"syn-clas-tic"},"inflection":{"notes":"Does not inflect."},"usage_notes":{"explanation":"'Synclastic' describes a surface where the principal curvatures at a point have the same sign. This means that the surface curves in the same direction in all directions around that point, like a sphere or an ellipsoid. It is often contrasted with 'anticlastic' surfaces, where the curvatures have opposite signs, such as a saddle shape.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The surface is synclastic because it's flat.","correct":"✓ The surface is synclastic because it's spherical.","note":"Flat surfaces have zero curvature, while synclastic surfaces have curvatures of the same sign."}],"priority":"★☆☆"},"related_words":{"derivatives":["synclastically"],"related_terms":["Gaussian curvature","anticlastic","curvature"]},"level_frequency":{"frequency_google_ngram":"Low frequency - technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Synclastic' is a technical term used in mathematics and engineering, particularly in the study of surfaces and their curvatures. It describes surfaces where the curvature is in the same direction in all directions around a point, resulting in a positive Gaussian curvature. This term is typically encountered in advanced studies of geometry, differential geometry, and related fields."},"example_sentences":[{"sentence":"The dome of the building has a synclastic shape, providing structural stability.","translation":"その建物のドームは同主曲率の形状をしており、構造的な安定性を提供しています。","type":"adjective","meaning_category":"同主曲率の"},{"sentence":"Lens designers often use synclastic surfaces to focus light effectively.","translation":"レンズ設計者は、光を効果的に集束させるために、同主曲率の表面をよく使用します。","type":"adjective","meaning_category":"同主曲率の"},{"sentence":"A simple example of a synclastic surface is the outer surface of a ball.","translation":"同主曲率の表面の簡単な例は、ボールの外面です。","type":"adjective","meaning_category":"同主曲率の"}]}