{"word":"Postconcretist","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ポスト具体主義の","english_definition":"Relating to or characteristic of post-concretism.","examples":[{"sentence":"The postconcretist sculpture incorporated elements of performance art.","translation":"そのポスト具体主義の彫刻は、パフォーマンスアートの要素を取り入れていた。"}],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"ポスト具体主義者","english_definition":"An artist or follower of post-concretism.","examples":[{"sentence":"The postconcretist sought to move beyond the limitations of pure form.","translation":"そのポスト具体主義者は、純粋な形態の限界を超えようと試みた。"}],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Formed by combining \"post-\" (meaning after or beyond) with \"concretist\" (referring to concretism, an art movement).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpoʊstˈkɒŋkriːtɪst/","syllables":"post-con-crete-ist"},"inflection":{},"usage_notes":{"explanation":"\"Postconcretist\" refers to art or artists that come after and react to the principles of Concretism, an art movement emphasizing pure abstraction and non-representational forms. Postconcretism often involves incorporating elements of representation, narrative, or social commentary, moving beyond the purely formal concerns of Concretism.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["postconcretism"],"related_terms":["concretism","abstraction","modern art"]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term \"postconcretist\" is a specialized term within the field of art history and criticism. It describes art that builds upon or reacts against the principles of Concretism, an earlier movement focused on pure abstraction. Understanding requires familiarity with art historical contexts."},"example_sentences":[{"sentence":"The exhibition featured several prominent postconcretist painters.","translation":"その展覧会では、著名なポスト具体主義の画家たちが数名紹介されていた。","type":"general","meaning_category":"art"},{"sentence":"Her work is considered a significant example of postconcretist aesthetics.","translation":"彼女の作品は、ポスト具体主義の美学の重要な例とみなされている。","type":"general","meaning_category":"art"}]}