{"word":"Symphyta","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"キバチ亜目：ハチ目に属する昆虫の亜目の一つ。","english_definition":"The sawflies and horntails, a suborder of insects in the order Hymenoptera (which includes bees, wasps, and ants).","examples":[{"sentence":"Sawflies and horntails belong to the suborder Symphyta.","translation":"キバチとクキバチはキバチ亜目に属する。"}],"collocations":["sawfly larva","horntail wasp"],"synonyms":["sawflies","horntails"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'symphy-' (meaning 'grown together' or 'united') and '-phyta' (referring to plants), reflecting the plant-feeding habits of many larvae in this group.","priority":"★★★"},"pronunciation":{"ipa":"/sɪmˈfaɪtə/","syllables":"Sym-phy-ta"},"inflection":{"noun_plural":"Symphyta (same as singular)"},"usage_notes":{"explanation":"'Symphyta' is a taxonomic term used in entomology. It refers to a specific group of Hymenopteran insects characterized by a broad connection between the thorax and abdomen, unlike the narrow 'waist' seen in wasps, bees, and ants (Apocrita). The larvae are typically plant feeders.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Symphyta is a type of bee.","correct":"✓ Symphyta is a suborder that includes sawflies and horntails, which are related to bees.","note":"Symphyta are related to bees but are not bees themselves. They are a more basal group within Hymenoptera."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Hymenoptera","Apocrita","sawfly","horntail","Hymenopteran"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - specialized scientific term.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Symphyta' is a technical term used in entomology (the study of insects). It refers to a suborder within the insect order Hymenoptera, which also includes bees, wasps, and ants. Symphyta are characterized by their plant-feeding larvae and the lack of a narrow 'waist' between their thorax and abdomen. This term is primarily encountered in scientific literature or specialized discussions about insect taxonomy."},"example_sentences":[{"sentence":"The larvae of Symphyta are often phytophagous, feeding on various plant tissues.","translation":"キバチ亜目の幼虫はしばしば植物食性で、様々な植物組織を食べる。","type":"scientific","meaning_category":"description"},{"sentence":"Symphyta represents a more basal lineage within the order Hymenoptera compared to Apocrita.","translation":"キバチ亜目はハチ目のなかで、ハチ亜目よりも基底的な系統を表す。","type":"taxonomic","meaning_category":"classification"}]}