{"word":"pyroscopy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"火炎試験、炎色反応","english_definition":"A method of analysis in which a substance is subjected to the action of heat, either alone or with reagents, in order to determine its composition or properties.","examples":[{"sentence":"Pyroscopy is used to identify minerals by observing the color of the flame produced when they are heated.","translation":"炎色反応は、鉱物を加熱した際に生じる炎の色を観察することで鉱物を特定するために用いられる。"},{"sentence":"The pyroscopy results indicated the presence of copper in the sample.","translation":"炎色反応の結果は、サンプル中に銅が存在することを示した。"}],"collocations":["perform pyroscopy","pyroscopy analysis","pyroscopy test","qualitative pyroscopy","quantitative pyroscopy"],"synonyms":["flame test","flame analysis","fire assay"],"antonyms":[]},{"part_of_speech":"noun","definition":"(古用法) 火による占い","english_definition":"(archaic) Divination by means of fire.","examples":[{"sentence":"In ancient times, pyroscopy was used to predict the future by interpreting the patterns of flames.","translation":"古代には、炎のパターンを解釈することによって未来を予測するために火占いが行われていた。"}],"collocations":[],"synonyms":["pyromancy","fire divination"],"antonyms":[]}],"etymology":{"value":"From the Greek words 'pyro' (fire) and 'skopein' (to view, examine).","priority":"★★☆"},"pronunciation":{"ipa":"/paɪˈrɒskəpi/","syllables":"py-ro-sco-py"},"inflection":{"noun_plural":"pyroscopies"},"usage_notes":{"explanation":"Pyroscopy primarily refers to the analytical technique involving the application of heat to a substance to observe its behavior and determine its properties. The term is also historically associated with divination using fire, though this usage is now rare. In modern scientific contexts, it is often used synonymously with flame tests or flame analysis, particularly in mineralogy and chemistry.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pyroscopy was done in a vacuum.","correct":"✓ The pyroscopy was done in open air.","note":"Pyroscopy, by definition, involves the use of heat and typically requires the presence of oxygen for combustion or oxidation to occur. Therefore, it is not usually performed in a vacuum."},{"incorrect":"✗ Pyroscopy is a method for measuring radioactivity.","correct":"✓ Pyroscopy is a method for analyzing the chemical composition of a substance using heat.","note":"Pyroscopy involves using heat to analyze a substance's chemical composition or properties, not for measuring radioactivity."}],"priority":"★☆☆"},"related_words":{"derivatives":["pyroscope (noun: an instrument for measuring the effects of heat)","pyrotechnics (noun: the art of making fireworks)","pyrogenic (adjective: produced by or originating from fire or heat)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pyroscopy' is a technical term primarily used in scientific contexts, specifically in chemistry and mineralogy. It refers to the process of analyzing a substance by subjecting it to heat and observing the resulting changes, such as flame color. While the term also has a historical association with divination using fire, this meaning is now archaic. Understanding the term requires familiarity with scientific vocabulary and analytical techniques."},"example_sentences":[{"sentence":"The chemist used pyroscopy to determine the elemental composition of the unknown compound.","translation":"化学者は炎色反応を用いて、未知の化合物の元素組成を決定した。","type":"scientific","meaning_category":"chemical analysis"},{"sentence":"The pyroscopy test revealed the presence of lithium, indicated by the crimson flame.","translation":"炎色反応試験により、深紅色の炎によって示されるリチウムの存在が明らかになった。","type":"scientific","meaning_category":"chemical analysis"},{"sentence":"Historically, pyroscopy was practiced as a form of divination, interpreting the patterns and colors of flames.","translation":"歴史的には、火占いは炎のパターンや色を解釈する占いの一形態として行われていた。","type":"historical","meaning_category":"divination"}]}