{"word":"Bursattee","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"An infectious skin disease of horses, characterized by hard, cordlike swellings under the skin, especially on the limbs and abdomen.","english_definition":"An infectious skin disease of horses, characterized by hard, cordlike swellings under the skin, especially on the limbs and abdomen.","examples":[{"sentence":"The horse was diagnosed with bursattee after developing lesions on its legs.","translation":"その馬は脚に病変が発生した後、バーサッティーと診断されました。"}],"synonyms":["equine pythiosis","kunkers"],"antonyms":[]}],"etymology":{"value":"Originating from the Hindi word 'barsati', meaning 'rainy season', as the disease was often associated with wet conditions.","priority":"★★☆"},"pronunciation":{"ipa":"/bɜːrˈsætiː/","syllables":"Bur-sat-tee"},"inflection":{"noun_plural":"bursattees"},"usage_notes":{"explanation":"Bursattee is a relatively rare disease, primarily affecting horses in tropical and subtropical regions. It is caused by oomycetes (water molds) rather than fungi, leading to difficulties in treatment with conventional antifungal medications.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The vet treated the bursattee with antibiotics.","correct":"✓ The vet treated the bursattee with antifungal medications and surgical removal of affected tissue.","note":"Bursattee is caused by oomycetes, not bacteria, so antibiotics are ineffective."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Bursattee' is a specialized term related to equine veterinary medicine. Understanding its meaning requires knowledge of infectious diseases in horses and basic veterinary terminology. It is not a commonly used word outside of this specific context."},"example_sentences":[{"sentence":"Early detection of bursattee is crucial for effective treatment.","translation":"バーサッティーの早期発見は効果的な治療に不可欠です。","type":"noun","meaning_category":"disease"},{"sentence":"The veterinarian recommended a combination of surgical debridement and antifungal therapy to combat the bursattee.","translation":"獣医はバーサッティーと闘うために、外科的デブリードマンと抗真菌療法を組み合わせることを推奨しました。","type":"noun","meaning_category":"disease"}]}