{"word":"nuclide","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"核種","english_definition":"A species of atom characterized by the constitution of its nucleus, which is specified by the number of protons, the number of neutrons, and the energy content; or, alternatively, by the atomic number, mass number, and isomeric state.","examples":[{"sentence":"Each nuclide is characterized by its atomic number, mass number, and energy state.","translation":"各核種は、原子番号、質量数、およびエネルギー状態で特徴付けられます。"},{"sentence":"Different nuclides of the same element have the same number of protons but different numbers of neutrons.","translation":"同じ元素の異なる核種は、同じ数の陽子を持つが、異なる数のニュートロンを持つ。"},{"sentence":"The chart of nuclides is a useful tool for understanding the properties of different atomic nuclei.","translation":"核種図は、異なる原子核の特性を理解するための便利なツールです。"}],"collocations":["stable nuclide","radioactive nuclide","chart of nuclides","heavy nuclide","light nuclide"],"synonyms":["isotope","isotope (strictly speaking, isotopes are nuclides of the same element)"],"antonyms":[]}],"etymology":{"value":"From 'nucleus' + '-ide'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnjuːklaɪd/","syllables":"nu-clide"},"inflection":{"noun_plural":"nuclides"},"usage_notes":{"explanation":"A nuclide is a specific type of atom defined by its nuclear composition (number of protons and neutrons). While the term 'isotope' is often used interchangeably, it strictly refers to nuclides of the *same* element (i.e., having the same number of protons). Therefore, all isotopes are nuclides, but not all nuclides are isotopes of each other.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Nuclides are the same as elements.","correct":"✓ Nuclides are specific types of atoms, while elements are defined by the number of protons.","note":"Nuclides refer to specific atomic nuclei, while elements are defined by their number of protons."},{"incorrect":"✗ All nuclides are isotopes.","correct":"✓ Isotopes are nuclides of the same element.","note":"Isotopes are a subset of nuclides; they must belong to the same element."}],"priority":"★★☆"},"related_words":{"derivatives":["radionuclide"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'nuclide' is primarily used in nuclear physics and chemistry. It refers to a specific type of atom characterized by its nuclear composition, including the number of protons and neutrons. It's a more precise term than 'isotope,' as isotopes are nuclides of the same element. Understanding this term requires a background in atomic structure and nuclear properties.","priority":"★★☆"},"example_sentences":[{"sentence":"The radioactive nuclide carbon-14 is used in radiocarbon dating.","translation":"放射性核種である炭素14は、放射性炭素年代測定に使用されます。","type":"scientific","meaning_category":"radioactive dating"},{"sentence":"The stability of a nuclide depends on the ratio of neutrons to protons in its nucleus.","translation":"核種の安定性は、その原子核内のニュートロンとプロトンの比率に依存します。","type":"scientific","meaning_category":"nuclear stability"},{"sentence":"The chart of nuclides provides information about the decay modes and half-lives of various nuclides.","translation":"核種図は、さまざまな核種の崩壊モードと半減期に関する情報を提供します。","type":"scientific","meaning_category":"nuclear properties"}]}