{"word":"self-aggrandizement","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自己顕示、自己宣伝、自己称揚、自己を大きく見せること","english_definition":"the act of enhancing one's own power, wealth, position, or reputation, often in an excessive or boastful way.","examples":[{"sentence":"His speech was full of self-aggrandizement, boasting about his achievements at every turn.","translation":"彼の演説は自己顕示に満ち溢れており、あらゆる機会に自分の業績を自慢していた。"},{"sentence":"She accused him of self-aggrandizement, saying he was only interested in promoting himself.","translation":"彼女は彼を自己宣伝だと非難し、彼は自分自身を宣伝することにしか興味がないと言った。"},{"sentence":"The politician's constant self-aggrandizement alienated many voters.","translation":"その政治家の絶え間ない自己称揚は多くの有権者を遠ざけた。"},{"sentence":"He used his position for self-aggrandizement, enriching himself at the expense of others.","translation":"彼は自分の地位を自己肥大化のために利用し、他人を犠牲にして自分を豊かにした。"}],"collocations":["pursuit of self-aggrandizement (自己顕示の追求)","act of self-aggrandizement (自己顕示の行為)","motivated by self-aggrandizement (自己顕示に動機づけられた)"],"synonyms":["boasting","bragging","self-promotion","egoism","narcissism","vainglory","exaltation of self"],"antonyms":["humility","modesty","self-deprecation","altruism"]}],"etymology":{"value":"\"Self-\" + \"aggrandizement\". \"Aggrandizement\" comes from the verb \"aggrandize,\" which originates from the French \"agrandir\" (to make greater), derived from Latin \"grandis\" (great). Thus, self-aggrandizement literally means \"making oneself greater.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌself əˈɡrændɪzmənt/","syllables":"self-ag-gran-dize-ment"},"inflection":{"noun_plural":"self-aggrandizements"},"usage_notes":{"explanation":"\"Self-aggrandizement\" refers to the act of exaggerating one's importance, often to gain power, status, or wealth. It typically carries a negative connotation, suggesting that the individual is excessively focused on their own ego and self-promotion. It is often associated with arrogance and a lack of genuine accomplishment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a self-aggrandizement person.","correct":"✓ He is a self-aggrandizing person. / ✓ He engages in self-aggrandizement.","note":"\"Self-aggrandizement\" is a noun. To describe a person who does this, use \"self-aggrandizing\" (adjective) or rephrase the sentence."},{"incorrect":"✗ Her self-aggrandizement was appreciated by everyone.","correct":"✓ Her self-aggrandizement was off-putting to everyone.","note":"Due to the negative connotation, self-aggrandizement is rarely appreciated. It's more likely to be seen as boastful or arrogant."}],"priority":"★★☆"},"related_words":{"derivatives":["aggrandize (verb: to increase the power, status, or wealth of)","aggrandizing (adjective: tending to aggrandize oneself or others)"],"phrases":["self-aggrandizing behavior","a display of self-aggrandizement"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency. More common in formal writing and discussions of psychology or politics.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Self-aggrandizement\" is a formal term referring to the act of making oneself appear more important or powerful than one actually is. It often involves boasting or exaggerating one's accomplishments. Because of its formal nature and complex construction, it's typically used in more sophisticated discussions or writing. The word carries a negative connotation, implying arrogance or excessive ego.","example_sentences":[{"sentence":"The dictator's speeches were filled with blatant self-aggrandizement.","translation":"その独裁者の演説は、あからさまな自己顕示に満ちていた。","type":"general"},{"sentence":"His constant self-aggrandizement made it difficult to work with him.","translation":"彼の絶え間ない自己宣伝は、彼と協力することを困難にした。","type":"general"},{"sentence":"The novel explores the themes of ambition and self-aggrandizement in the corporate world.","translation":"その小説は、企業の世界における野心と自己顕示のテーマを探求している。","type":"literary"}]}}