{"word":"Crocs","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"クロックス (ブランド名)","english_definition":"A brand of lightweight, waterproof, and comfortable shoes typically made of a molded plastic resin called Croslite.","examples":[{"sentence":"I wear Crocs around the house because they're comfortable.","translation":"家ではクロックスを履いています。快適だからです。"},{"sentence":"Crocs are popular for gardening and other outdoor activities.","translation":"クロックスはガーデニングやその他のアウトドア活動に人気があります。"},{"sentence":"Some people love Crocs, while others hate them.","translation":"クロックスを愛する人もいれば、嫌う人もいます。"}],"collocations":["wear Crocs","Crocs shoes","Crocs sandals","Crocs with socks"],"synonyms":["foam clogs","rubber clogs"],"antonyms":[]},{"part_of_speech":"noun","definition":"クロックス (靴の種類)","english_definition":"A type of shoe, similar in style to the brand Crocs, often made of foam or rubber and characterized by a rounded toe, ventilation holes, and a pivoting heel strap.","examples":[{"sentence":"She slipped on her crocs to go outside.","translation":"彼女は外に出るためにクロックスを履いた。"},{"sentence":"He wore crocs to the beach.","translation":"彼はビーチにクロックスを履いて行った。"},{"sentence":"These crocs are really easy to clean.","translation":"このクロックスは本当に掃除が簡単だ。"}],"collocations":["foam crocs","rubber crocs","fake crocs"],"synonyms":["clogs","foam shoes","rubber shoes"],"antonyms":[]}],"etymology":{"value":"The name 'Crocs' is derived from 'crocodile,' as the shoe's shape was initially designed to resemble a crocodile's snout.","priority":"★★☆"},"pronunciation":{"ipa":"/krɒks/","syllables":"crocs"},"inflection":{"noun_plural":"Crocs"},"usage_notes":{"explanation":"'Crocs' is a proper noun referring to the brand of shoes, but it's also commonly used as a generic term for similar styles of foam or rubber clogs. When referring to the brand, it should be capitalized. When referring to the style of shoe in general, it is sometimes written in lowercase ('crocs'), although capitalizing it is still acceptable.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I like croc.","correct":"✓ I like Crocs.","note":"When referring to the brand, use the plural form 'Crocs' even when talking about a single pair of shoes."},{"incorrect":"✗ I bought a new Croc.","correct":"✓ I bought a new pair of Crocs.","note":"Although you buy one pair, the brand name is plural. Alternatively, 'I bought new Crocs' is also correct."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"A2","frequency_google_ngram":"Relatively common, particularly in informal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"A2","text":"'Crocs' are a type of shoe. They are usually made of a soft, light material and have holes in the top. They are easy to put on and take off, and many people find them comfortable. The word 'Crocs' can refer to the brand of shoe or to the style of shoe in general.","priority":"★★★"},"example_sentences":[{"sentence":"She loves wearing her Crocs around the house.","translation":"彼女は家でクロックスを履くのが大好きです。","type":"noun","meaning_category":"shoe"},{"sentence":"He bought a new pair of Crocs for gardening.","translation":"彼はガーデニング用に新しいクロックスを買った。","type":"noun","meaning_category":"shoe"},{"sentence":"Crocs are known for being comfortable and easy to clean.","translation":"クロックスは快適でお手入れが簡単であることで知られています。","type":"noun","meaning_category":"shoe"},{"sentence":"Are those real Crocs or knock-offs?","translation":"あれは本物のクロックスですか、それとも模倣品ですか？","type":"noun","meaning_category":"shoe"}]}