{"word":"fractionalized","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(組織・集団などが)分裂した、分断された、派閥化した","english_definition":"Divided into factions; characterized by internal division or disunity.","examples":[{"sentence":"The political party was highly fractionalized, with several competing factions vying for control.","translation":"その政党は非常に派閥化しており、いくつかの競合する派閥が支配権を争っていた。"},{"sentence":"A fractionalized society is vulnerable to external threats.","translation":"分断された社会は、外部からの脅威に弱い。"},{"sentence":"The board of directors became increasingly fractionalized over the company's future direction.","translation":"取締役会は、会社の将来の方向性についてますます分裂していった。"}],"collocations":["highly fractionalized","increasingly fractionalized","fractionalized society","fractionalized market","fractionalized electorate"],"synonyms":["splintered","divided","fragmented","polarized","balkanized","factional"],"antonyms":["unified","united","cohesive","integrated","harmonious"]},{"part_of_speech":"verb (past participle)","definition":"(動詞 fractionalize の過去分詞形) 分割された、細分化された、断片化された","english_definition":"(past participle of the verb 'fractionalize') Divided into fractions or smaller parts; broken up into smaller units.","examples":[{"sentence":"The ownership of the company was fractionalized among many shareholders.","translation":"その会社の所有権は、多くの株主の間で細分化された。"},{"sentence":"The data was fractionalized to improve processing speed.","translation":"処理速度を向上させるために、データは細分化された。"},{"sentence":"The real estate investment was fractionalized, allowing smaller investors to participate.","translation":"その不動産投資は細分化され、より小規模な投資家が参加できるようになった。"}],"collocations":["fractionalized ownership","fractionalized data","fractionalized investment","fractionalized shares","fractionalized assets"],"synonyms":["fragmented","subdivided","partitioned","atomized","disaggregated"],"antonyms":["consolidated","aggregated","unified"]}],"etymology":{"value":"Derived from the verb 'fractionalize,' which comes from 'fraction' (a part of a whole) + '-ize' (to cause to become).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfrækʃənəˌlaɪzd/","syllables":"frac-tion-a-lized"},"inflection":{"notes":"Adjective and past participle form of the verb 'fractionalize'."},"usage_notes":{"explanation":"'Fractionalized' describes a state of division or fragmentation, often within a group, organization, or society. It implies a lack of unity and the presence of competing factions or interests. As a past participle, it indicates that something has been divided into smaller parts or fractions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The fractionalized problem was hard to solve.","correct":"✓ The fragmented problem was hard to solve.","note":"While 'fractionalized' can imply fragmentation, 'fragmented' is a more common and direct way to describe a problem that is broken into pieces. 'Fractionalized' is better suited for describing groups or ownership structures."},{"incorrect":"✗ The company is fractionalized because of the merger.","correct":"✓ The company is being fractionalized because of the merger.","note":"'Fractionalized' is a state, not an action. Use 'is being fractionalized' to describe the process of becoming fractionalized."}],"priority":"★☆☆"},"related_words":{"derivatives":["fractionalize (verb): to divide into fractions or smaller parts; to cause to become divided into factions.","fractionalization (noun): the process or state of becoming fractionalized.","fraction (noun): a part of a whole; a small or tiny amount.","faction (noun): a small, organized, dissenting group within a larger one."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'fractionalized' is a relatively advanced term used to describe a state of division or fragmentation, particularly within groups or organizations. It suggests a lack of unity and the presence of competing factions. It can also describe something that has been divided into smaller parts or fractions. Understanding this word requires a good grasp of vocabulary related to division, unity, and organizational structure."},"example_sentences":[{"sentence":"The country's political landscape has become increasingly fractionalized in recent years.","translation":"近年、その国の政治情勢はますます分断化している。","type":"adjective","meaning_category":"分裂した"},{"sentence":"The art collection was fractionalized and sold off at auction.","translation":"その美術コレクションは細分化され、オークションで売り払われた。","type":"verb (past participle)","meaning_category":"分割された"},{"sentence":"A fractionalized approach to problem-solving can lead to inefficient outcomes.","translation":"問題解決に対する断片的なアプローチは、非効率な結果につながる可能性がある。","type":"adjective","meaning_category":"分裂した"}]}