{"word":"Onychatrophia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"爪萎縮症（つめいしゅくしょう）: 爪の成長が阻害され、薄く、小さく、または変形する状態","english_definition":"Atrophy of the nails; a condition in which the nails waste away, becoming thin, small, and sometimes deformed.","examples":[{"sentence":"Onychatrophia can be caused by various factors, including trauma, infection, and systemic diseases.","translation":"爪萎縮症は、外傷、感染症、全身性疾患など、さまざまな要因によって引き起こされる可能性があります。"},{"sentence":"Treatment for onychatrophia depends on the underlying cause.","translation":"爪萎縮症の治療は、根本的な原因によって異なります。"}],"collocations":["congenital onychatrophia (先天性爪萎縮症)","idiopathic onychatrophia (特発性爪萎縮症)"],"synonyms":["nail atrophy"],"antonyms":[]}],"etymology":{"value":"「Onycho-」（爪を意味する接頭辞、ギリシャ語の「onyx」から）+ 「-atrophia」（萎縮を意味する接尾辞、ギリシャ語の「atrophia」から）。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒnɪkəˈtrɒfiə/","syllables":"on-y-cha-tro-phi-a"},"inflection":{"noun_plural":"onychatrophias"},"usage_notes":{"explanation":"Onychatrophia is a medical term describing the wasting away or atrophy of the nails. It can affect one or more nails and may be a symptom of an underlying health condition. Diagnosis typically involves a physical examination and may require further testing to determine the cause.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I think I have onychatrophia because my nails are brittle.","correct":"✓ Brittle nails can be a symptom of many conditions, including onychatrophia, so it's best to see a doctor for a diagnosis.","note":"Brittle nails are a common symptom of many conditions, so it's important to consult a doctor for an accurate diagnosis."}],"priority":"★☆☆"},"related_words":{"derivatives":["onycho- (接頭辞: 爪に関する)","atrophy (名詞: 萎縮)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学用語のため、一般的には使用されない。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Onychatrophia is a specialized medical term referring to the atrophy or wasting away of the nails. It is not a commonly used word outside of medical contexts. Understanding this term requires knowledge of medical terminology, specifically prefixes and suffixes related to nail conditions and atrophy. It is crucial to differentiate this term from other nail disorders and understand the potential underlying causes and diagnostic procedures.","priority":"★☆☆"},"example_sentences":[{"sentence":"The patient presented with severe onychatrophia in all fingernails.","translation":"患者はすべての指の爪に重度の爪萎縮症を呈した。","type":"medical","meaning_category":"爪の病気"},{"sentence":"Onychatrophia can sometimes be a side effect of certain medications.","translation":"爪萎縮症は、特定の薬の副作用である場合がある。","type":"medical","meaning_category":"爪の病気"}]}