{"word":"immoralist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"不道徳主義者、道徳否定論者","english_definition":"A person who rejects accepted moral standards or principles.","examples":[{"sentence":"The novel explores the ideas of an immoralist who believes in the supremacy of the individual will.","translation":"その小説は、個人の意志の優位性を信じる不道徳主義者の思想を探求している。"},{"sentence":"Some philosophers have been labeled immoralists because of their critiques of traditional morality.","translation":"伝統的な道徳に対する批判のために、一部の哲学者は不道徳主義者と見なされてきた。"}],"collocations":["philosophical immoralist (哲学的な不道徳主義者)","literary immoralist (文学的な不道徳主義者)","self-proclaimed immoralist (自称不道徳主義者)"],"synonyms":["nihilist","atheist","nonconformist","rebel"],"antonyms":["moralist","conformist","traditionalist"]},{"part_of_speech":"noun","definition":"（特にアンドレ・ジッドの小説）『背徳者』の主人公のような人物","english_definition":"A character, especially like the protagonist of André Gide's novel 'The Immoralist', who rejects conventional morality.","examples":[{"sentence":"He saw himself as an immoralist, free from the constraints of societal expectations.","translation":"彼は、社会の期待という制約から解放された、不道徳主義者としての自分を見ていた。"}],"collocations":["Gide's immoralist (ジッドの背徳者)","a character resembling an immoralist (背徳者に似た人物)"],"synonyms":["rebel","outsider","nonconformist"],"antonyms":["conventionalist","traditionalist"]}],"etymology":{"value":"'Immoral' + '-ist'. 'Immoral' comes from Latin 'immoralis', meaning 'not moral'. The suffix '-ist' denotes a person who adheres to or advocates a particular doctrine or belief.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈmɒrəlɪst/","syllables":"im-mor-al-ist"},"inflection":{"noun_plural":"immoralists"},"usage_notes":{"explanation":"The term 'immoralist' is often used in philosophical and literary contexts to describe someone who deliberately rejects or challenges conventional moral principles. It can also refer to a character who embodies such a rejection, particularly in the context of André Gide's novel 'The Immoralist'. The term carries a strong connotation of rejecting societal norms and values.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an amoralist, so he doesn't care about right or wrong.","correct":"✓ He is an immoralist, so he rejects conventional morality.","note":"'Amoralist' means lacking a sense of morality, while 'immoralist' means actively rejecting morality. The distinction is important. An amoral person doesn't understand morality, while an immoral person understands it but chooses to disregard it."}],"priority":"★★☆"},"related_words":{"derivatives":["immoral (adjective: 不道徳な)","immorality (noun: 不道徳)","moral (adjective: 道徳的な; noun: 教訓)","moralist (noun: 道徳主義者)"],"phrases":["Nietzschean immoralism (ニーチェ的不道徳主義)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Immoralist' refers to someone who actively goes against what society generally considers to be right or wrong. It's not just about lacking morals (that would be 'amoral'); it's about consciously rejecting established moral rules. This word is often used when discussing philosophy or literature, especially when exploring characters who challenge traditional values. It implies a deliberate choice to live outside the bounds of conventional morality."},"example_sentences":[{"sentence":"The philosopher argued that the true immoralist seeks not pleasure, but power.","translation":"その哲学者は、真の不道徳主義者は快楽ではなく、力を求めるのだと主張した。","type":"noun","meaning_category":"道徳否定論者"},{"sentence":"The protagonist of the novel is a complex immoralist, torn between his desires and societal expectations.","translation":"その小説の主人公は、欲望と社会の期待の間で引き裂かれる、複雑な不道徳主義者である。","type":"noun","meaning_category":"道徳否定論者"}]}