{"word":"Velella","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"カツオノエボシに似た浮遊性のヒドロ虫の一種","english_definition":"A genus of free-floating hydrozoans that live on the surface of the open ocean; also known as 'by-the-wind sailor' or 'sea raft'.","examples":[{"sentence":"The beach was covered in Velella after the storm.","translation":"嵐の後、浜辺はギンカクラゲで覆われていた。"}],"collocations":["Velella stranded","Velella bloom"],"synonyms":["by-the-wind sailor","sea raft"],"antonyms":[]}],"etymology":{"value":"Velella is derived from the Latin word 'velum,' meaning 'sail,' referring to the small sail-like structure that allows it to be propelled by the wind.","priority":"★★☆"},"pronunciation":{"ipa":"/vəˈlɛlə/","syllables":"Ve-lel-la"},"inflection":{"noun_plural":"Velellas"},"usage_notes":{"explanation":"Velella are commonly known as \"by-the-wind sailors\" due to their unique method of propulsion. They are often found washed up on beaches in large numbers following storms or strong winds. They are not dangerous to humans, unlike their relative, the Portuguese man-of-war.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a Portuguese man o' war, it must be a Velella.","correct":"✓ I saw a Velella. They are similar but the Portuguese man o' war is much more dangerous.","note":"Velella are often mistaken for Portuguese man-of-war, but they are smaller and harmless."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Hydrozoa","Cnidaria","Physalia physalis (Portuguese man-of-war)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Velella is a scientific term referring to a specific genus of hydrozoans. It is not a commonly used word in everyday conversation. Understanding requires some background knowledge in marine biology.","priority":"★☆☆"},"example_sentences":[{"sentence":"Large numbers of Velella were washed ashore after the strong winds.","translation":"強風の後、大量のギンカクラゲが海岸に打ち上げられた。","type":"noun","meaning_category":"Hydrozoan species"},{"sentence":"Velella use their small sail to navigate the ocean surface.","translation":"ギンカクラゲは小さな帆を使って海面を移動する。","type":"noun","meaning_category":"Hydrozoan species"}]}