{"word":"dead-stroke","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(ビリヤード)正確で力強いショット、(比喩的に)決定的な一撃","english_definition":"(Billiards) A perfectly executed and powerful shot; (figuratively) a decisive blow.","examples":[{"sentence":"He executed a dead-stroke, sinking the eight ball and winning the game.","translation":"彼はデッドストロークを決め、エイトボールを沈めてゲームに勝利した。"},{"sentence":"The company's new product was a dead-stroke to its competitors.","translation":"その会社の新製品は、競合他社にとって決定的な一撃となった。"}],"collocations":["execute a dead-stroke","deliver a dead-stroke","a dead-stroke to the competition"],"synonyms":["perfect shot","decisive blow","knockout punch"],"antonyms":["missed shot","ineffective attempt"]},{"part_of_speech":"noun","definition":"(機械工学)エンジンのピストンが動かなくなる状態、デッドポイント","english_definition":"(Mechanical Engineering) A condition in an engine where the piston cannot move, also known as a dead center.","examples":[{"sentence":"The engine stalled because it was stuck at dead-stroke.","translation":"エンジンはデッドストロークで動かなくなったため、停止した。"}],"collocations":["stuck at dead-stroke","avoid dead-stroke"],"synonyms":["dead center","top dead center","bottom dead center"],"antonyms":["N/A"]}],"etymology":{"value":"The term combines \"dead,\" indicating a complete or final state, with \"stroke,\" referring to a movement or action. In billiards, it signifies a shot executed with precision and power, effectively ending the game. In mechanical engineering, it refers to a point where movement ceases.","priority":"N/A"},"pronunciation":{"ipa":"/ˈdɛdˌstroʊk/","syllables":"dead-stroke"},"inflection":{"noun_plural":"dead-strokes"},"usage_notes":{"explanation":"The term \"dead-stroke\" has two primary meanings depending on the context. In billiards, it refers to a shot that is perfectly executed, often resulting in a win. Figuratively, it can describe a decisive action or event that defeats or eliminates competition. In mechanical engineering, it describes a state where an engine's piston cannot move, indicating a problem.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"He had a dead stroke and couldn't move his arm.","correct":"He had a stroke and couldn't move his arm.","note":"\"Dead stroke\" is not typically used to describe a medical stroke. Use \"stroke\" instead."}],"priority":"N/A"},"related_words":{"derivatives":["N/A"],"phrasal_verbs":["N/A"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term \"dead-stroke\" has specialized meanings in billiards and mechanical engineering. Understanding its use requires familiarity with these contexts. In billiards, it signifies a perfect, game-winning shot. In engineering, it refers to a specific mechanical condition where movement is impossible. Its figurative use implies a decisive, often destructive, action."},"example_sentences":[{"sentence":"With a confident stance, she lined up the shot and delivered a perfect dead-stroke.","translation":"自信に満ちた姿勢で、彼女はショットを狙い、完璧なデッドストロークを決めた。","type":"noun","meaning_category":"Billiards"},{"sentence":"The new regulations were a dead-stroke to small businesses.","translation":"その新しい規制は中小企業にとって決定的な打撃となった。","type":"noun","meaning_category":"Figurative"},{"sentence":"The mechanic identified the problem as the engine being stuck at dead-stroke.","translation":"整備士は、エンジンがデッドストロークで動かなくなっていることが問題だと特定した。","type":"noun","meaning_category":"Mechanical Engineering"}]}