{"word":"referente","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"参照物、指示対象、指示物 (言語学、記号学)","english_definition":"(linguistics, semiotics) the thing that a word or sign represents or refers to; the object or concept to which a word, phrase, or symbol points.","examples":[{"sentence":"In the sentence 'The cat is on the mat,' the cat and the mat are both referents.","translation":"「猫がマットの上にいる」という文では、猫とマットはどちらも指示対象である。"},{"sentence":"The referent of the word 'unicorn' is a mythical creature.","translation":"「ユニコーン」という言葉の指示対象は、神話上の生き物である。"},{"sentence":"Understanding the referent is crucial for interpreting the meaning of a text.","translation":"指示対象を理解することは、テキストの意味を解釈するために重要である。"}],"collocations":["identify the referent (指示対象を特定する)","determine the referent (指示対象を決定する)","ambiguous referent (曖昧な指示対象)","clear referent (明確な指示対象)","contextual referent (文脈上の指示対象)"],"synonyms":["reference","denotation","designatum","extension"],"antonyms":[],"notes":"The term 'referent' is often used in discussions of semantics, pragmatics, and philosophy of language."}],"etymology":{"value":"From the Latin 'referens', present participle of 'referre' (to carry back, refer), from 're-' (back) + 'ferre' (to carry).","priority":"★★☆"},"pronunciation":{"ipa":"/re.feˈɾen.te/","syllables":"re-fe-ren-te"},"inflection":{"noun_plural":"referentes"},"usage_notes":{"explanation":"'Referente' is a technical term used in linguistics and semiotics to describe the actual entity or concept in the real world that a word, symbol, or expression designates. It's important to distinguish the referent from the 'sense' or 'meaning' of the word, which is the concept associated with the word in our minds. For example, the words 'morning star' and 'evening star' have different senses, but they both have the same referent: the planet Venus.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The referent is the definition of the word.","correct":"✓ The referent is the object or entity that the word points to.","note":"The referent is not the definition, but the actual thing being referred to."},{"incorrect":"✗ The referent is always a real object.","correct":"✓ The referent can be a real object, a concept, or even a fictional entity.","note":"Referents can be abstract or fictional, not just concrete objects."}],"priority":"★★☆"},"related_words":{"derivatives":["referential (adjective)","reference (noun)","refer (verb)"],"broader_terms":["sign","symbol","expression"],"narrower_terms":[],"related_terms":["semantics","semiotics","pragmatics","denotation","connotation"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency (専門用語)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Referente' is a specialized term primarily used in linguistics, semiotics, and philosophy of language. It denotes the actual entity or concept in the real world to which a linguistic expression refers. Understanding this term requires familiarity with abstract concepts in language theory and is not typically encountered in general English usage. It is crucial to distinguish the 'referente' from the 'sense' or 'meaning' of the expression, as different expressions can have the same referent but different meanings, and vice versa. This concept is essential for analyzing how language connects to the external world and how meaning is constructed through reference."},"example_sentences":[{"sentence":"The **referente** of 'the President' changes depending on the context.","translation":"「大統領」の指示対象は、文脈によって変わる。","type":"noun","meaning_category":"指示対象"},{"sentence":"Identifying the **referente** of pronouns can be challenging in complex sentences.","translation":"複雑な文では、代名詞の指示対象を特定するのが難しいことがある。","type":"noun","meaning_category":"指示対象"},{"sentence":"The study of **referentes** is central to understanding how language relates to reality.","translation":"指示対象の研究は、言語が現実とどのように関係しているかを理解する上で中心となる。","type":"noun","meaning_category":"指示対象"}]}