{"word":"nondisposal","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(廃棄物などの)非処分、処分しないこと","english_definition":"The act or state of not disposing of something, especially waste.","examples":[{"sentence":"The company is focusing on nondisposal strategies to reduce its environmental impact.","translation":"その会社は、環境への影響を減らすために、非処分戦略に焦点を当てています。"},{"sentence":"Nondisposal of hazardous materials is a serious violation of environmental regulations.","translation":"有害物質の非処分は、環境規制の重大な違反です。"}],"collocations":["waste nondisposal (廃棄物の非処分)","hazardous waste nondisposal (有害廃棄物の非処分)","nondisposal strategy (非処分戦略)"],"synonyms":["retention","preservation","storage"],"antonyms":["disposal","discarding","elimination"]}],"etymology":{"value":"\"non-\" (否定) + \"disposal\" (処分)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒndɪˈspoʊzəl/","syllables":"non-di-spo-sal"},"inflection":{"noun_plural":"nondisposals"},"usage_notes":{"explanation":"\"Nondisposal\" refers to the practice of not discarding or eliminating something, often waste or unwanted materials. It implies finding alternative uses, storage, or methods of management other than disposal. It is often used in the context of environmental management and sustainability.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nondisposal of the garbage was a problem.","correct":"✓ The improper disposal of the garbage was a problem.","note":"If the garbage was not disposed of correctly, it's 'improper disposal,' not 'nondisposal,' unless the intention was to not dispose of it at all."}],"priority":"★★☆"},"related_words":{"derivatives":["dispose (verb)","disposal (noun)","nondisposable (adjective)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Nondisposal\" is a formal term primarily used in environmental and waste management contexts. It denotes the conscious decision or state of not discarding waste or other materials, often in favor of reuse, recycling, or alternative management strategies. Understanding this term requires familiarity with environmental vocabulary and concepts related to sustainability."},"example_sentences":[{"sentence":"The city implemented a new policy promoting the nondisposal of recyclable materials.","translation":"市はリサイクル可能な物質の非処分を促進する新しい政策を実施しました。","type":"noun","meaning_category":"非処分"},{"sentence":"Nondisposal methods, such as composting, can significantly reduce landfill waste.","translation":"堆肥化のような非処分方法は、埋め立て廃棄物を大幅に削減できます。","type":"noun","meaning_category":"非処分"}]}