{"word":"Cestrum","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"キチョウジ属（の植物）","english_definition":"A genus of flowering plants in the nightshade family, Solanaceae.","examples":[{"sentence":"Cestrum species are native to warm temperate to tropical regions of the Americas.","translation":"キチョウジ属の植物は、南北アメリカの温暖な温帯から熱帯地域が原産です。"}],"collocations":["Cestrum parqui (カワリバナ)","Cestrum nocturnum (夜香木)"],"synonyms":["Jessamine","Nightshade"],"antonyms":[]},{"part_of_speech":"noun","definition":"夜香木 (Cestrum nocturnum)","english_definition":"Specifically, Cestrum nocturnum, a species of Cestrum known for its strong, sweet fragrance at night.","examples":[{"sentence":"The fragrance of Cestrum filled the evening air.","translation":"夜香木の香りが夕方の空気に満ちていた。"}],"collocations":["Night-blooming cestrum","Lady of the night"],"synonyms":["Night-blooming jasmine","Night jessamine"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'kestron,' referring to a plant mentioned by Dioscorides, possibly related to the modern Cestrum.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɛstrəm/","syllables":"Ces-trum"},"inflection":{"noun_plural":"Cestrums"},"usage_notes":{"explanation":"'Cestrum' refers to a genus of plants, and sometimes specifically to Cestrum nocturnum (Night-blooming jasmine). When referring to the genus, it's a general term for a group of related plants. When referring to 'Cestrum nocturnum', it indicates that specific fragrant species.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I planted a Cestrum in my garden, it's a beautiful flower.","correct":"✓ I planted a Cestrum nocturnum in my garden, it's a beautiful flower.","note":"To avoid ambiguity, specify the species, especially if you mean Night-blooming jasmine."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_genera":["Solanum (ナス属)","Nicotiana (タバコ属)"],"related_families":["Solanaceae (ナス科)"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Primarily used in botanical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cestrum' is a botanical term referring to a genus of plants, particularly within the Solanaceae family. It is commonly used in horticultural and botanical contexts. The most well-known species is 'Cestrum nocturnum,' also known as night-blooming jasmine, which is known for its strong fragrance. Understanding this term requires some familiarity with plant taxonomy and botanical nomenclature."},"example_sentences":[{"sentence":"Several species of Cestrum are cultivated for their ornamental value.","translation":"いくつかのキチョウジ属の種は、観賞用として栽培されています。","type":"noun","meaning_category":"キチョウジ属"},{"sentence":"The strong fragrance of Cestrum nocturnum is most noticeable in the evening.","translation":"夜香木の強い香りは、夕方に最も顕著です。","type":"noun","meaning_category":"夜香木"}]}