{"word":"Polystictus","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(菌類)カワラタケ属","english_definition":"A former genus of fungi, now distributed among other genera, characterized by tough, leathery, often multicolored fruiting bodies with small pores on the underside.","examples":[{"sentence":"The genus Polystictus is no longer in use, as its species have been reclassified.","translation":"カワラタケ属は、その種が再分類されたため、もはや使用されていません。"}],"collocations":["Polystictus versicolor (カワラタケの旧学名)"],"synonyms":["Trametes","Coriolus","Fomes"],"antonyms":[]}],"etymology":{"value":"Derived from Greek 'polys' (many) and 'stiktos' (spotted), referring to the appearance of the fruiting bodies.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɒlɪˈstɪktəs/","syllables":"Po-ly-stic-tus"},"inflection":{"noun_plural":"Polysticti"},"usage_notes":{"explanation":"The term 'Polystictus' is largely historical in mycology. The species formerly classified under this genus are now assigned to other genera such as Trametes, Coriolus, and Fomes. When discussing fungal taxonomy, it's important to use the current classification.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I found a Polystictus mushroom; it must be edible.","correct":"✓ I found a Trametes versicolor mushroom; I need to identify it properly to determine if it's edible.","note":"Assuming edibility based on the old genus name is dangerous. Proper identification using current taxonomy is essential."}],"priority":"★★☆"},"related_words":{"derivatives":["Polysticta (鳥類の一属)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Polystictus' is a scientific term referring to a former genus of fungi. It's primarily encountered in mycological contexts or historical scientific literature. Understanding its usage requires familiarity with fungal taxonomy and nomenclature. The term is less relevant in general conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"Older texts may refer to Trametes versicolor as Polystictus versicolor.","translation":"古い文献では、カワラタケはPolystictus versicolorとして言及されているかもしれません。","type":"noun","meaning_category":"菌類"},{"sentence":"The taxonomy of the genus Polystictus has undergone significant revision.","translation":"カワラタケ属の分類は大幅な改訂を受けています。","type":"noun","meaning_category":"菌類"}]}