{"word":"nonentreatingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"懇願せずに、頼み込むことなく","english_definition":"Without entreating; in a manner that does not involve begging or pleading.","examples":[{"sentence":"She asked for the information nonentreatingly, stating her need matter-of-factly.","translation":"彼女は情報を懇願せずに、必要性を淡々と述べながら求めた。"},{"sentence":"He presented his case nonentreatingly, relying on facts rather than emotional appeals.","translation":"彼は感情的な訴えではなく事実に基づいて、懇願することなく自分の主張を述べた。"}],"collocations":["ask nonentreatingly","state nonentreatingly","present nonentreatingly"],"synonyms":["unsolicitously","unimploringly","unbeggingly"],"antonyms":["entreatingly","imploringly","beseechingly"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (not) to the adverb 'entreatingly'. 'Entreatingly' comes from the verb 'entreat', meaning to ask earnestly or beg.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnɪnˈtriːtɪŋli/","syllables":"non-in-treat-ing-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Nonentreatingly' is used to describe actions or manners of speaking that lack the quality of earnest pleading or begging. It suggests a detached or matter-of-fact approach to asking or requesting something. It is a relatively uncommon word.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She looked at him nonentreatingly. (when she was actually begging)","correct":"✓ She looked at him entreatingly.","note":"Make sure the action matches the description. If someone is begging, 'entreatingly' is the correct word."}],"priority":"★★☆"},"related_words":{"derivatives":["entreat (verb)","entreaty (noun)","entreatingly (adverb)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Nonentreatingly' is a formal and uncommon word. It means doing something without begging or pleading. You would use it to describe a situation where someone asks for something in a direct, unemotional way, relying on facts or logic rather than trying to persuade through emotional appeals. It is the opposite of 'entreatingly', which means begging or pleading. Because it's rare, it's best used in formal writing or when a very precise description is needed."},"example_sentences":[{"sentence":"The lawyer presented the evidence nonentreatingly, confident that the facts spoke for themselves.","translation":"弁護士は、事実が自ずと物語ると確信して、懇願することなく証拠を提示した。","type":"adverb","meaning_category":"without begging"},{"sentence":"He requested a raise nonentreatingly, highlighting his contributions to the company's success.","translation":"彼は会社の成功への貢献を強調し、懇願することなく昇給を要求した。","type":"adverb","meaning_category":"without pleading"}]}