{"word":"world-roving","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"世界を股にかける、世界を旅する、世界を放浪する","english_definition":"traveling extensively throughout the world; wandering or journeying around the world.","examples":[{"sentence":"He lived a world-roving life as a journalist.","translation":"彼はジャーナリストとして世界を股にかける生活を送った。"},{"sentence":"She has a world-roving spirit and loves to explore new cultures.","translation":"彼女は世界を旅する精神を持ち、新しい文化を探求することを愛している。"},{"sentence":"The world-roving photographer captured stunning images from every continent.","translation":"その世界を放浪する写真家は、すべての大陸から素晴らしい映像を捉えた。"}],"collocations":["world-roving adventurer","world-roving lifestyle","world-roving journalist","world-roving photographer","world-roving spirit"],"synonyms":["globetrotting","wandering","traveling","nomadic","itinerant"],"antonyms":["settled","stationary","homebound","localized"]}],"etymology":{"value":"'World' + 'roving'. 'World' refers to the earth and all the people and things on it. 'Roving' is the present participle of 'rove,' which means to travel constantly without a fixed destination.","priority":"★★★"},"pronunciation":{"ipa":"/ˈwɜːldˌroʊvɪŋ/","syllables":"world-rov-ing"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb or noun."},"usage_notes":{"explanation":"'World-roving' is typically used to describe someone or something that travels extensively and frequently around the world. It implies a sense of adventure, exploration, and a lack of fixed location. It's often used to describe professions or lifestyles that involve frequent international travel.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a world-rove person.","correct":"✓ He is a world-roving person.","note":"Use the correct adjective form 'world-roving' instead of trying to create a new form."},{"incorrect":"✗ She world-roved last year.","correct":"✓ She took a world-roving trip last year. / ✓ She traveled the world last year.","note":"'World-roving' is an adjective, not a verb. To describe the action of traveling the world, use the verb 'travel' or a phrase like 'take a world-roving trip'."}],"priority":"★★☆"},"related_words":{"derivatives":["rove (verb, noun)","rover (noun)","world (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'World-roving' is a relatively uncommon adjective used to describe someone or something that travels extensively around the world. It's more sophisticated than simply saying 'traveling' and implies a sense of adventure and exploration. Because of its relatively low frequency, it's more likely to be encountered in advanced texts or conversations."},"example_sentences":[{"sentence":"The documentary followed a world-roving chef as he discovered unique cuisines.","translation":"そのドキュメンタリーは、ユニークな料理を発見する世界を股にかけるシェフを追った。","type":"general","meaning_category":"traveling extensively"},{"sentence":"Her world-roving adventures inspired her to write a book.","translation":"彼女の世界を旅する冒険は、彼女に本を書くきっかけを与えた。","type":"general","meaning_category":"traveling extensively"},{"sentence":"The company needed a world-roving manager to oversee their international operations.","translation":"その会社は、国際的な事業を監督するために世界を股にかけるマネージャーを必要としていた。","type":"general","meaning_category":"traveling extensively"}]}