{"word":"Hartake","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Historical) A type of medieval weapon, specifically a polearm, used in Europe.","english_definition":"A historical type of polearm weapon used in medieval Europe. Details about its specific design and usage are scarce and may vary depending on the source.","examples":[{"sentence":"The hartake, though less common than the halberd, was another polearm used by infantry.","translation":"ハータケは、ハルバードほど一般的ではありませんでしたが、歩兵が使用した別のポールアームでした。"}],"collocations":["polearm","medieval weapon","infantry weapon"],"synonyms":["polearm","glaive","halberd"],"antonyms":[]}],"etymology":{"value":"The etymology of 'hartake' is not definitively known. It is likely derived from a regional or local term for a specific type of polearm. The 'hart' part might be related to 'hard' or a specific component of the weapon (though this is speculative).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈhɑːrtɑːk/","syllables":"har-take"},"inflection":{"noun_plural":"hartakes"},"usage_notes":{"explanation":"The term 'hartake' is relatively rare in historical texts and weapon descriptions. Information about its precise characteristics and usage is limited. It is generally understood to be a type of polearm, similar to a glaive or halberd, but specific details are often lacking.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ A hartake is a type of sword.","correct":"✓ A hartake is a type of polearm.","note":"A hartake is a polearm, which is a weapon with a blade or point mounted on a long shaft, not a sword."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["polearm","glaive","halberd","billhook","fauchard"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - a rare historical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'hartake' refers to a relatively obscure historical weapon. Understanding requires knowledge of medieval weaponry and historical terminology. Due to its rarity, it is not commonly encountered.","note":"This term is highly specialized and unlikely to be encountered outside of academic or historical contexts."},"example_sentences":[{"sentence":"The infantryman wielded a hartake, ready to defend the castle walls.","translation":"歩兵はハータケを手に、城壁を守る準備をした。","type":"example","meaning_category":"Historical Weapon"}]}