{"word":"biliously","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"不機嫌そうに、怒りっぽく、気難しそうに","english_definition":"in a manner expressing ill temper or irritability; peevishly; irritably.","examples":[{"sentence":"He glared biliously at the noisy children.","translation":"彼は騒がしい子供たちを不機嫌そうに睨みつけた。"},{"sentence":"She responded biliously to the question, clearly annoyed.","translation":"彼女は質問に不機嫌そうに答え、明らかに苛立っていた。"},{"sentence":"The old man grumbled biliously about the state of the world.","translation":"その老人は世界の状況について気難しそうに不平を言った。"}],"collocations":["glare biliously","respond biliously","grumble biliously","speak biliously","look biliously","act biliously"],"synonyms":["irascibly","peevishly","grumpily","testily","crossly","acerbically","sourly","bad-temperedly"],"antonyms":["cheerfully","happily","pleasantly","amiably"]}],"etymology":{"value":"\"Biliously\" is derived from the adjective \"bilious,\" which comes from the Latin word \"bilis\" meaning \"bile.\" In medieval physiology, an excess of bile was thought to cause irritability and bad temper. The suffix \"-ly\" turns it into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɪliəsli/","syllables":"bil-ious-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"\"Biliously\" describes actions or expressions that convey a sense of ill temper, irritability, or peevishness. It suggests a sour or unpleasant disposition. The term is not commonly used in everyday conversation but appears more frequently in literature or formal writing to depict a character's mood or behavior. It implies a deeper, more ingrained negativity than simple annoyance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She smiled biliously at the compliment.","correct":"✓ She smiled sarcastically at the compliment.","note":"\"Biliously\" implies ill temper, so it wouldn't be used with a smile unless the smile is meant to convey negativity. \"Sarcastically\" would be a more appropriate word in this context."},{"incorrect":"✗ The food tasted biliously.","correct":"✓ The food tasted bitter.","note":"While \"bilious\" is related to bile, \"biliously\" describes a person's manner, not the taste of food. Use words like \"bitter\" or \"unpleasant\" to describe the taste of food."}],"priority":"★★☆"},"related_words":{"derivatives":["bilious (adjective: affected by or associated with nausea or vomiting; spiteful; bad-tempered)","bile (noun: a bitter greenish-brown alkaline fluid that aids digestion and is secreted by the liver and stored in the gallbladder.)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"biliously\" is a relatively uncommon adverb that describes someone acting in a bad-tempered, irritable, or peevish manner. It is more often found in literature than in everyday speech. To understand its meaning, it's helpful to know that it comes from the word \"bilious,\" which historically referred to an excess of bile in the body, thought to cause irritability. Therefore, \"biliously\" suggests a sour or unpleasant disposition being expressed through one's actions or words."},"example_sentences":[{"sentence":"He regarded the interruption biliously.","translation":"彼は邪魔が入ったことに不機嫌そうに目を向けた。","type":"adverb","meaning_category":"不機嫌そうに"},{"sentence":"The critic commented biliously on the play's shortcomings.","translation":"評論家はその劇の欠点について気難しそうにコメントした。","type":"adverb","meaning_category":"気難しそうに"},{"sentence":"She answered the question biliously, making it clear she didn't want to discuss the matter.","translation":"彼女はその質問に不機嫌そうに答え、その件について議論したくないことを明らかにした。","type":"adverb","meaning_category":"怒りっぽく"}]}