{"word":"broomiest","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(主に比喩的に)最もほうきのような、最もほうきで掃除された、最もほうきに適した","english_definition":"(chiefly figuratively) most resembling a broom; most thoroughly swept with a broom; most suitable for sweeping with a broom.","examples":[{"sentence":"This is the broomiest corner of the house, always full of dust bunnies.","translation":"ここは家の中で一番ほうきのような角で、いつもホコリだらけだ。","type":"figurative"},{"sentence":"After the party, the floor needed the broomiest sweep to get rid of all the glitter.","translation":"パーティーの後、床はすべてのキラキラを取り除くために最も徹底的なほうき掃除が必要だった。","type":"literal"},{"sentence":"The old shed was the broomiest place on the farm, perfect for storing all the cleaning supplies.","translation":"古い小屋は農場で最もほうきに適した場所で、すべての掃除用品を保管するのに最適だった。","type":"literal"}],"collocations":["broomiest corner","broomiest sweep","broomiest place"],"synonyms":["sweeping","brushlike","cleanest","tidied","orderly"],"antonyms":["dirtiest","messiest","untidy"]}],"etymology":{"value":"Derived from 'broomy' (resembling a broom, overgrown with broom) with the superlative suffix '-est'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbruːmiɪst/","syllables":"broom-i-est"},"inflection":{"adjective_forms":{"comparative":"more broomy","superlative":"broomiest"}},"usage_notes":{"explanation":"'Broomiest' is a rarely used superlative adjective. It is formed from the adjective 'broomy', which itself is not very common. The word is most often used figuratively to describe something that resembles a broom in appearance or function, or to describe something that has been thoroughly swept. It can also describe a place that is particularly suited for sweeping.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She has the broomiest hair.","correct":"✓ She has the broomiest hair. (While grammatically correct, this is an unusual description. Consider 'She has the most broom-like hair'.)","note":"While grammatically correct, using 'broomiest' to describe hair is unusual. Consider alternative phrasing."},{"incorrect":"✗ This is the most broomy room.","correct":"✓ This is the broomiest room.","note":"'Broomiest' is already the superlative form; using 'most' is redundant."}],"priority":"★☆☆"},"related_words":{"derivatives":["broom","broomy"],"phrases":["broom closet","new broom sweeps clean"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Broomiest' is a very rare and specialized word. It is the superlative form of 'broomy,' meaning 'most like a broom' or 'most thoroughly swept.' Due to its rarity, it is unlikely to be encountered in everyday language. Its use is generally limited to descriptive or figurative contexts where the resemblance to a broom or the act of sweeping is emphasized. Understanding the root word 'broom' and the superlative suffix '-est' is essential for comprehending its meaning. Alternative phrasing is generally preferred due to the word's obscurity."},"example_sentences":[{"sentence":"This corner is the broomiest because the wind always blows leaves here.","translation":"この角は、風がいつも葉を吹き込むので、最もほうきのような状態になっている。","type":"descriptive","meaning_category":"resembling a broom"},{"sentence":"After hours of cleaning, this is the broomiest room in the house.","translation":"何時間も掃除した後、ここは家の中で最もほうきで掃除された部屋だ。","type":"literal","meaning_category":"thoroughly swept"},{"sentence":"The shed, with its dirt floor, was the broomiest place to store garden tools.","translation":"土の床の小屋は、園芸工具を保管するのに最もほうきに適した場所だった。","type":"descriptive","meaning_category":"suitable for sweeping"}]}