{"word":"scavagery","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に軽蔑的に) あさり、漁り、ゴミ拾い；腐肉食","english_definition":"The act or practice of scavenging; the collection of discarded or unwanted materials; the feeding on carrion.","examples":[{"sentence":"The scavagery of the gulls on the beach was a common sight.","translation":"海岸でのカモメのゴミ漁りはよく見られる光景だった。"},{"sentence":"The economic crisis led to increased scavagery in the city.","translation":"経済危機は都市部でのゴミ拾いの増加につながった。"},{"sentence":"The vultures engaged in scavagery on the carcass of the animal.","translation":"ハゲタカはその動物の死骸を漁った。"}],"collocations":["urban scavagery (都市部のゴミ拾い)","animal scavagery (動物の腐肉食)","economic scavagery (経済的な理由によるゴミ拾い)"],"synonyms":["scavenging","foraging","rummaging","gleaning","carrion-eating"],"antonyms":["conservation","preservation","hoarding"]}],"etymology":{"value":"Derived from 'scavenger' + '-y'. 'Scavenger' comes from Middle English 'scavager', 'scavageour', referring to a customs officer or someone who collected scavage (a toll on goods offered for sale). The meaning evolved to refer to someone who cleans streets and, later, to animals that feed on carrion.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskævɪndʒəri/","syllables":"scav-en-ger-y"},"inflection":{"noun_plural":"scavageries (rare)"},"usage_notes":{"explanation":"'Scavagery' is a noun that refers to the act or practice of scavenging. It often carries a negative connotation, implying a desperate or undignified search for resources. It can refer to both human and animal behavior. While 'scavenging' is more commonly used, 'scavagery' emphasizes the activity itself.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The scavagery was beautiful.","correct":"✓ The scene of scavagery was disturbing.","note":"'Scavagery' often implies something unpleasant or desperate, so describing it as 'beautiful' is usually inappropriate. Use adjectives like 'disturbing', 'desperate', or 'grim' instead."},{"incorrect":"✗ He did scavagery as a job.","correct":"✓ He worked as a scavenger. / ✓ He engaged in scavagery to survive.","note":"To describe someone who performs the action, use 'scavenger'. 'Scavagery' is the activity itself."}],"priority":"★★☆"},"related_words":{"derivatives":["scavenger (noun: person or animal that scavenges)","scavenge (verb: to search for discarded items)","scavenging (noun/adjective: the act of scavenging; related to scavenging)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Not commonly used in everyday conversation or writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Scavagery' is a relatively uncommon word that describes the act of scavenging, which means searching for and collecting discarded items or feeding on dead animals. It's often used in more formal or descriptive contexts, and may carry a negative connotation. Because it is not a common word, it is more likely to be encountered in written texts or specialized discussions rather than in everyday conversation."},"example_sentences":[{"sentence":"The documentary showed the harsh reality of urban scavagery.","translation":"そのドキュメンタリーは都市部でのゴミ拾いの厳しい現実を映し出した。","type":"noun","meaning_category":"ゴミ拾い"},{"sentence":"The scavagery of the hyenas kept the savanna clean.","translation":"ハイエナの腐肉食はサバンナを清潔に保った。","type":"noun","meaning_category":"腐肉食"},{"sentence":"The desperate scavagery for food was a sign of the famine.","translation":"食料を求めて必死にゴミを漁る姿は、飢饉の兆候だった。","type":"noun","meaning_category":"あさり"}]}