{"word":"guardedness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"用心深さ、警戒心、慎重さ","english_definition":"the state of being cautious and careful, especially in speech or actions, to avoid being deceived or trapped.","examples":[{"sentence":"His guardedness made it difficult to get to know him.","translation":"彼の用心深さのせいで、彼を知ることは難しかった。"},{"sentence":"There was a noticeable guardedness in her voice when she spoke about her past.","translation":"彼女が過去について話すとき、その声には明らかな警戒心が見られた。"},{"sentence":"The company's guardedness regarding the new product launch suggested they were unsure of its success.","translation":"新製品の発売に対する会社の用心深さは、彼らがその成功を確信していないことを示唆していた。"}],"collocations":["show guardedness (用心深さを示す)","a sense of guardedness (用心深さの感覚)","extreme guardedness (極度の用心深さ)","inherent guardedness (生来の用心深さ)"],"synonyms":["caution","wariness","circumspection","prudence","reserve","restraint","discretion"],"antonyms":["openness","candor","frankness","naivety","trust","artlessness"]}],"etymology":{"value":"'Guardedness' is derived from the adjective 'guarded,' which comes from the verb 'guard.' The suffix '-ness' is added to form the noun, indicating a state or quality.","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡɑːrdɪdnəs/","syllables":"guard-ed-ness"},"inflection":{"noun_plural":"(通常不可算名詞)"},"usage_notes":{"explanation":"'Guardedness' refers to a state of being careful and reserved, often due to a fear of vulnerability or deception. It implies a deliberate effort to protect oneself or one's interests. It is often used to describe someone's behavior or attitude in situations where trust is uncertain or risk is perceived.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He showed a lot of guardedness about the weather.","correct":"He showed a lot of concern about the weather.","note":"'Guardedness' is typically used in contexts involving interpersonal relationships, secrets, or potential threats. Concern about the weather would be expressed differently."},{"incorrect":"The guardedness was very happy.","correct":"The caution was very welcome.","note":"'Guardedness' is a state of mind, not an emotion. It cannot be described as 'happy.'"}],"priority":"★★☆"},"related_words":{"derivatives":["guarded (adjective)","guard (verb, noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Guardedness' is a relatively sophisticated term indicating a state of caution and reserve. It's used to describe someone who is careful about what they say or do, often because they are afraid of being tricked or revealing too much. The word implies a level of awareness and self-protection. It's not a common word in everyday conversation but appears in more formal or analytical contexts."},"example_sentences":[{"sentence":"The witness displayed a noticeable **guardedness** during the cross-examination.","translation":"証人は反対尋問の間、目立った用心深さを示した。","type":"general","meaning_category":"caution"},{"sentence":"Her **guardedness** around strangers made it difficult for her to form new friendships.","translation":"彼女の見知らぬ人に対する用心深さは、彼女が新しい友情を築くことを困難にした。","type":"general","meaning_category":"caution"},{"sentence":"The politician's **guardedness** on the controversial issue suggested he was trying to avoid taking a firm stance.","translation":"その政治家の物議を醸す問題に対する用心深さは、彼が明確な立場を取ることを避けようとしていることを示唆していた。","type":"political","meaning_category":"caution"}]}