{"word":"decommodifying","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"商品化解除、非商品化","english_definition":"To remove something's status as a commodity; to remove from the market or treat as if it were not a commodity.","examples":[{"sentence":"Decommodifying healthcare would ensure that everyone has access to essential medical services, regardless of their ability to pay.","translation":"医療の非商品化は、支払い能力に関わらず、誰もが必要な医療サービスを受けられるようにすることを保証するでしょう。"},{"sentence":"Some argue that information should be decommodified and freely available to all.","translation":"情報が非商品化され、すべての人に自由に利用可能であるべきだと主張する人もいます。"}],"collocations":["decommodifying healthcare","decommodifying education","decommodifying information"],"synonyms":["non-commodifying","de-marketizing"],"antonyms":["commodifying","marketizing"]},{"part_of_speech":"adjective","definition":"商品化解除の、非商品化の","english_definition":"Relating to the process of removing something's status as a commodity.","examples":[{"sentence":"The decommodifying approach to housing aims to provide affordable homes as a basic right, not as an investment opportunity.","translation":"住宅への非商品化のアプローチは、投資機会としてではなく、基本的な権利として手頃な価格の住宅を提供することを目指しています。"},{"sentence":"Decommodifying policies can help to reduce inequality and promote social justice.","translation":"非商品化政策は、不平等を減らし、社会正義を促進するのに役立ちます。"}],"collocations":["decommodifying policies","decommodifying approach","decommodifying strategies"],"synonyms":["non-commodified","de-marketized"],"antonyms":["commodified","marketized"]}],"etymology":{"value":"Derived from 'de-' (a prefix meaning 'removal' or 'reversal'), 'commodity' (something that can be bought and sold), and '-ify' (a suffix meaning 'to make or become').","priority":"☆☆☆"},"pronunciation":{"ipa":"/diːkəˈmɒdɪfaɪɪŋ/","syllables":"de-com-mod-i-fy-ing"},"inflection":{"verb_forms":{"present_simple":["decommodifies"],"past_simple":"decommodified","past_participle":"decommodified","present_participle":"decommodifying"},"adjective_forms":{}},"usage_notes":{"explanation":"'Decommodifying' refers to the process of removing something from the realm of market exchange, treating it as a right or public good rather than something to be bought and sold. This is often discussed in the context of essential services like healthcare, education, and housing.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Decommodifying is when you make something cheaper.","correct":"✓ Decommodifying is when you remove something from being treated as a commodity, not just making it cheaper.","note":"Decommodifying is not simply about making something cheaper; it's about changing its status from a commodity to something else, like a right or public good."}],"priority":"☆☆☆"},"related_words":{"derivatives":["decommodify","decommodification"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Decommodifying' means taking something out of the market so it's no longer treated as something to be bought and sold. It's often used when talking about things like healthcare or education, suggesting they should be available to everyone, not just those who can afford them. It's a more advanced term used in discussions about economics and social policy."},"example_sentences":[{"sentence":"The government is considering decommodifying public transport to make it more accessible.","translation":"政府は、公共交通機関をより利用しやすくするために、非商品化することを検討しています。","type":"verb","meaning_category":"非商品化する"},{"sentence":"A decommodifying approach to water resources ensures equitable distribution.","translation":"水資源への非商品化アプローチは、公平な分配を保証します。","type":"adjective","meaning_category":"非商品化の"}]}