{"word":"dielec","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"誘電体 (絶縁体)","english_definition":"A dielectric is an electrical insulator that can be polarized by an applied electric field. When a dielectric is placed in an electric field, electric charges do not flow through the material as they do in a conductor, but instead shift slightly from their average equilibrium positions causing dielectric polarization.","examples":[{"sentence":"The capacitor uses a ceramic dielectric.","translation":"そのコンデンサはセラミック誘電体を使用している。"},{"sentence":"The dielectric constant of the material is important for its performance.","translation":"その材料の誘電率は、その性能にとって重要である。"}],"collocations":["dielectric constant (誘電率)","dielectric strength (絶縁耐力)","dielectric material (誘電体材料)","ceramic dielectric (セラミック誘電体)"],"synonyms":["insulator","nonconductor"],"antonyms":["conductor"]},{"part_of_speech":"adjective","definition":"誘電性の","english_definition":"Relating to or having the properties of a dielectric.","examples":[{"sentence":"The dielectric properties of the material were studied.","translation":"その材料の誘電特性が研究された。"},{"sentence":"A dielectric layer is used to insulate the conductor.","translation":"誘電層は導体を絶縁するために使用される。"}],"collocations":["dielectric properties (誘電特性)","dielectric layer (誘電層)","dielectric heating (誘電加熱)"],"synonyms":["insulating","nonconducting"],"antonyms":["conducting"]}],"etymology":{"value":"Derived from 'di-' (meaning 'through' or 'apart') + 'electric'. The term suggests a substance through which electric force can act without conduction.","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˈɛlɛk/","syllables":"di-el-ek"},"inflection":{"noun_plural":"dielecs"},"usage_notes":{"explanation":"'Dielec' is a less common, shortened form of 'dielectric'. It is primarily used in technical contexts, especially in electrical engineering and physics, when referring to dielectric materials or properties. While 'dielectric' is more formal and widely accepted, 'dielec' can be used informally or in abbreviations within specialized fields.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The dielec is conduct electricity.","correct":"✓ The dielec does not conduct electricity.","note":"Dielectrics are insulators, so they do not conduct electricity. The opposite of a dielectric is a conductor."},{"incorrect":"✗ Use dielec materials for conductors.","correct":"✓ Use conductive materials for conductors. / Use dielectric materials for insulators.","note":"Dielectric materials are used for insulators, not conductors."}],"priority":"★★☆"},"related_words":{"derivatives":["dielectric (noun, adjective)","dielectrically (adverb)"],"related_terms":["capacitance","polarization","electric field","insulation"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency, primarily used in technical and scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dielec' is a technical term primarily used in physics and electrical engineering. It refers to a material that is an electrical insulator or nonconductor, meaning it does not allow electricity to flow through it easily. Instead, when placed in an electric field, it becomes polarized. This term is typically encountered in advanced scientific or engineering contexts, such as discussions about capacitors, insulators, or the properties of materials in electric fields. It is less common in everyday language."},"example_sentences":[{"sentence":"The engineer specified a high-performance dielec for the capacitor design.","translation":"エンジニアは、コンデンサの設計に高性能な誘電体を指定した。","type":"noun","meaning_category":"誘電体"},{"sentence":"The dielec layer prevents short circuits between the conductors.","translation":"誘電層は、導体間の短絡を防ぐ。","type":"adjective","meaning_category":"誘電性の"}]}