{"word":"degeneracies","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(物理学、数学)縮退 (状態)","english_definition":"plural form of degeneracy: a condition in which different states of a quantum system have the same energy; a situation in which a number of mathematical objects are distinct but described by the same equations.","examples":[{"sentence":"The degeneracies in the energy levels are lifted by the application of a magnetic field.","translation":"エネルギー準位の縮退は、磁場を印加することによって解消される。"},{"sentence":"These degeneracies lead to interesting phenomena in condensed matter physics.","translation":"これらの縮退は、凝縮系物理学において興味深い現象を引き起こす。"}],"collocations":["lift a degeneracy (縮退を解消する)","remove a degeneracy (縮退を取り除く)","energy level degeneracy (エネルギー準位の縮退)","accidental degeneracy (偶発的縮退)","geometric degeneracy (幾何学的縮退)"],"synonyms":["degeneration"],"antonyms":[]}],"etymology":{"value":"The word 'degeneracy' comes from the Latin 'degenerare', meaning 'to decline from ancestral quality'. In physics and mathematics, it describes a state where multiple distinct entities share the same characteristic value (e.g., energy level).","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˈdʒɛnərəsiz/","syllables":"de-gen-er-a-cies"},"inflection":{"noun_plural":"degeneracies"},"usage_notes":{"explanation":"In physics, 'degeneracy' refers to a situation where multiple quantum states have the same energy. This is common in systems with symmetry. In mathematics, it refers to a situation where different mathematical objects are described by the same equations or have the same properties. The plural form 'degeneracies' is used when referring to multiple instances or types of degeneracy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The degeneracy are important.","correct":"✓ The degeneracies are important.","note":"When referring to multiple instances of degeneracy, use the plural form 'degeneracies'."}],"priority":"★★☆"},"related_words":{"derivatives":["degenerate (verb, adjective)","degeneration (noun)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'degeneracies' is a technical term primarily used in physics and mathematics. It refers to situations where multiple distinct states or mathematical objects share the same characteristic value or are described by the same equations. Understanding this word requires a background in these fields."},"example_sentences":[{"sentence":"The **degeneracies** in the spectrum provide insights into the underlying symmetries of the system.","translation":"スペクトルにおける縮退は、系の根底にある対称性への洞察を提供する。","type":"noun","meaning_category":"(physics) energy levels"},{"sentence":"The presence of **degeneracies** complicates the numerical solution of the equations.","translation":"縮退の存在は、方程式の数値解を複雑にする。","type":"noun","meaning_category":"(mathematics) mathematical objects"}]}