{"word":"nongeneralized","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"一般化されていない、普遍化されていない","english_definition":"Not generalized; not made general or universal.","examples":[{"sentence":"The study focused on nongeneralized findings specific to the local population.","translation":"その研究は、地域住民に特有の一般化されていない調査結果に焦点を当てた。"},{"sentence":"The algorithm is nongeneralized and only works for this particular dataset.","translation":"そのアルゴリズムは一般化されておらず、この特定のデータセットに対してのみ機能する。"}],"collocations":["nongeneralized data","nongeneralized solution","nongeneralized model","nongeneralized approach"],"synonyms":["specific","particular","specialized","localized","unique"],"antonyms":["generalized","universal","common","widespread","broad"]},{"part_of_speech":"adjective","definition":"（数学・統計学で）一般化可能性が低い、適用範囲が限定的な","english_definition":"(Mathematics, Statistics) Having low generalizability; applicable only in a limited scope.","examples":[{"sentence":"The results are nongeneralized due to the small sample size.","translation":"サンプルサイズが小さいため、結果は一般化可能性が低い。"},{"sentence":"The model is nongeneralized and cannot be applied to other contexts.","translation":"そのモデルは一般化されておらず、他のコンテキストには適用できない。"}],"collocations":["nongeneralized results","nongeneralized model","nongeneralized conclusion","nongeneralized applicability"],"synonyms":["non-transferable","non-extrapolatable","context-specific","situation-dependent"],"antonyms":["generalizable","transferable","extrapolatable","widely applicable"]}],"etymology":{"value":"Derived from \"generalized\" by adding the prefix \"non-\" indicating negation or absence.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈdʒɛnərəˌlaɪzd/","syllables":"non-gen-er-a-lized"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"\"Nongeneralized\" is used to describe something that is not made general or universal. It emphasizes the specificity or uniqueness of a finding, solution, or model. In mathematics and statistics, it describes results or models that have limited applicability beyond the specific context in which they were developed. It is the opposite of \"generalized,\" which means to make something more widely applicable or universal.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The data is very nongeneral.","correct":"✓ The data is very specific / The data is not generalized.","note":"\"Nongeneralized\" is a more precise term than \"nongeneral.\" Use \"specific\" or \"not generalized\" for simpler phrasing."},{"incorrect":"✗ The theory is nongeneralized for all cases.","correct":"✓ The theory is not generalized for all cases.","note":"The correct usage is to say the theory is \"not generalized\" for all cases, or the theory is \"specific\" to certain cases."}],"priority":"★★☆"},"related_words":{"derivatives":["generalize","generalization","generalizable","ungeneralized"],"antonyms":["generalized","universalized","standardized","common"],"related_concepts":["specificity","context-specificity","applicability","generalizability"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"nongeneralized\" is a more advanced term used to describe something that is not made general or universal. It often appears in academic or technical contexts, especially in fields like statistics, mathematics, and research. It emphasizes that a finding, solution, or model is specific to a particular situation or context and cannot be easily applied to other situations. Understanding this word requires a good grasp of the concept of generalization and the ability to recognize its absence."},"example_sentences":[{"sentence":"The study's findings were nongeneralized due to the unique characteristics of the participants.","translation":"参加者の独自の特徴により、その研究の調査結果は一般化されていなかった。","type":"adjective","meaning_category":"Not generalized"},{"sentence":"A nongeneralized approach was necessary to address the specific needs of the community.","translation":"地域社会の特定のニーズに対応するためには、一般化されていないアプローチが必要だった。","type":"adjective","meaning_category":"Not generalized"},{"sentence":"The model's performance was excellent on the training data, but it remained nongeneralized when tested on new datasets.","translation":"そのモデルの性能はトレーニングデータでは優れていたが、新しいデータセットでテストしたところ、一般化されていなかった。","type":"adjective","meaning_category":"Low generalizability"}]}