{"word":"orthodromy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"大圏航路、正距方位航路","english_definition":"The shortest distance between two points on the Earth's surface; a great circle route.","examples":[{"sentence":"The captain calculated the orthodromy to minimize the travel distance.","translation":"船長は移動距離を最小限にするために大圏航路を計算した。"},{"sentence":"Orthodromy is used in aviation to find the most efficient route.","translation":"大圏航路は、最も効率的なルートを見つけるために航空で使用される。"}],"collocations":["calculate orthodromy","use orthodromy","orthodromy route","orthodromy distance"],"synonyms":["great circle route","geodesic route"],"antonyms":["rhumb line","loxodrome"]}],"etymology":{"value":"Derived from Greek 'orthos' (straight, right) and 'dromos' (course, running).","priority":"★★☆"},"pronunciation":{"ipa":"/ɔːrˈθɒdrəmi/","syllables":"or-tho-dro-my"},"inflection":{"noun_plural":"orthodromies"},"usage_notes":{"explanation":"Orthodromy refers to the shortest distance between two points on a sphere, such as the Earth. This path follows a great circle, which is a circle on the sphere with the same radius as the sphere itself. It's important in navigation for finding the most efficient routes, especially over long distances.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a loxodrome instead of orthodromy for the shortest path.","correct":"✓ He used orthodromy instead of a loxodrome for the shortest path.","note":"Orthodromy provides the shortest distance, while a loxodrome (rhumb line) provides a constant bearing but a longer distance."}],"priority":"★☆☆"},"related_words":{"derivatives":["orthodromic (adjective)"],"phrases":["great circle","rhumb line","loxodrome","navigation","geodesy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Orthodromy' is a technical term used in navigation and geodesy to describe the shortest distance between two points on a sphere, following a great circle route. It is primarily encountered in specialized contexts related to long-distance travel and mapping. Understanding this term requires familiarity with concepts of spherical geometry and navigation techniques."},"example_sentences":[{"sentence":"Modern navigation systems automatically calculate the orthodromy for air travel.","translation":"現代のナビゲーションシステムは、航空旅行のために自動的に大圏航路を計算する。","type":"general","meaning_category":"definition"},{"sentence":"The orthodromy between New York and Tokyo is a curved path across the globe.","translation":"ニューヨークと東京の間の大圏航路は、地球上では曲線経路になる。","type":"example","meaning_category":"example"}]}