{"word":"fatalism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"宿命論、運命論","english_definition":"The belief that all events are predetermined and therefore inevitable.","examples":[{"sentence":"His fatalism prevented him from taking any action to improve his situation.","translation":"彼の宿命論は、状況を改善するためのいかなる行動も起こさせなかった。"},{"sentence":"She adopted a fatalistic attitude towards her illness.","translation":"彼女は自身の病気に対して宿命論的な態度をとった。"},{"sentence":"Fatalism can lead to passivity and a lack of motivation.","translation":"宿命論は受動性と意欲の欠如につながる可能性がある。"}],"collocations":["a fatalistic attitude (宿命論的な態度)","a sense of fatalism (宿命論的な感覚)","embrace fatalism (宿命論を受け入れる)","reject fatalism (宿命論を拒否する)","religious fatalism (宗教的な宿命論)","philosophical fatalism (哲学的な宿命論)"],"synonyms":["determinism","predestination","inevitability","destiny","predetermination"],"antonyms":["free will","agency","volition","choice","autonomy"]},{"part_of_speech":"noun","definition":"諦め、無気力、投げやりな態度","english_definition":"A feeling of resignation or powerlessness in the face of events thought to be inevitable.","examples":[{"sentence":"There was a sense of fatalism in the community after the factory closed.","translation":"工場閉鎖後、地域社会には諦め感が漂っていた。"},{"sentence":"The refugees displayed a weary fatalism, having lost everything.","translation":"難民たちはすべてを失い、疲れた諦めの表情を浮かべていた。"},{"sentence":"Don't give in to fatalism; you can still make a difference.","translation":"諦めないでください。まだ何かできるはずです。"}],"collocations":["a feeling of fatalism (諦めの気持ち)","give in to fatalism (諦めに屈する)","overcome fatalism (諦めを克服する)","a weary fatalism (疲れた諦め)","a sense of powerlessness (無力感)"],"synonyms":["resignation","passivity","resignation","apathy","defeatism","pessimism","cynicism"],"antonyms":["optimism","hope","determination","agency","empowerment"]}],"etymology":{"value":"Derived from 'fatal', meaning 'determined by fate', and the suffix '-ism', denoting a belief or doctrine. 'Fatal' comes from the Latin 'fatalis', pertaining to fate.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfeɪtəlɪzəm/","syllables":"fa-tal-ism"},"inflection":{"notes":"Uncountable noun"},"usage_notes":{"explanation":"Fatalism is the belief that events are predetermined and inevitable, often leading to a sense of resignation or powerlessness. It can be a philosophical or religious belief, or simply a way of coping with difficult circumstances. It is often contrasted with the belief in free will, which emphasizes the ability of individuals to make choices and shape their own destinies. The term can also describe a general attitude of resignation or apathy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He practiced fatalism every day.","correct":"✓ He embraced fatalism. / ✓ He had a fatalistic attitude.","note":"Fatalism is a belief or attitude, not something one 'practices'. Use verbs like 'embrace', 'adopt', or 'have' to describe someone's relationship to fatalism."},{"incorrect":"✗ She was very fatalistic about the accident, so she sued the other driver.","correct":"✓ She was very upset about the accident, so she sued the other driver.","note":"Fatalism implies acceptance of events as inevitable. Suing someone suggests a belief in agency and responsibility, which is the opposite of fatalism. If someone is suing, they are likely not fatalistic about the situation."}],"priority":"★★☆"},"related_words":{"derivatives":["fatalist (noun: a person who believes in fatalism)","fatalistic (adjective: characterized by fatalism)","fatally (adverb: in a way that causes death or disaster)","fate (noun: the development of events beyond a person's control, regarded as predetermined by a supernatural power.)"],"phrases":["accept one's fate (運命を受け入れる)","leave it to fate (運命に任せる)","what will be, will be (なるようになる)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, more common in philosophical or academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Fatalism' is a concept often discussed in philosophy and literature. It refers to the belief that events are predetermined and cannot be changed by human action. Someone who believes in fatalism might think that whatever happens is meant to happen, regardless of their efforts. This idea can lead to a feeling of powerlessness or resignation. Understanding 'fatalism' requires grasping its connection to ideas about free will, destiny, and the nature of causality. It's a term that appears more frequently in intellectual discussions than in everyday conversation."},"example_sentences":[{"sentence":"The character in the novel was consumed by a sense of **fatalism**, believing he had no control over his life.","translation":"小説の登場人物は、自分の人生をコントロールできないと信じ、宿命論に取り憑かれていた。","type":"noun","meaning_category":"宿命論"},{"sentence":"Her **fatalistic** outlook made her reluctant to plan for the future.","translation":"彼女の宿命論的な考え方は、将来の計画を立てるのをためらわせた。","type":"adjective","meaning_category":"宿命論的な"},{"sentence":"Despite the challenges, he refused to succumb to **fatalism** and continued to fight for his goals.","translation":"困難にもかかわらず、彼は宿命論に屈することを拒否し、目標のために戦い続けた。","type":"noun","meaning_category":"諦め・無気力"},{"sentence":"Some religions incorporate elements of **fatalism**, emphasizing the power of divine will.","translation":"一部の宗教は、神の意志の力を強調し、宿命論の要素を取り入れている。","type":"noun","meaning_category":"宿命論"}]}