{"word":"cholinergic-resistant","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"コリン作動薬抵抗性の","english_definition":"Not susceptible to the effects of cholinergic agents; resistant to stimulation by acetylcholine or similar substances.","examples":[{"sentence":"The smooth muscle in this tissue is cholinergic-resistant.","translation":"この組織の平滑筋はコリン作動薬抵抗性である。"},{"sentence":"Some strains of insects have developed cholinergic-resistant mechanisms.","translation":"昆虫の一部の系統は、コリン作動薬抵抗性のメカニズムを発達させた。"}],"collocations":["cholinergic-resistant cells","cholinergic-resistant receptors","cholinergic-resistant mechanisms"],"synonyms":["anticholinergic","cholinergic-insensitive"],"antonyms":["cholinergic-sensitive","cholinergic-responsive"]}],"etymology":{"value":"Formed by combining \"cholinergic\" (relating to or resembling the actions of acetylcholine) and \"resistant\" (offering resistance; not susceptible).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌkoʊlɪnˈɜːrdʒɪk rɪˈzɪstənt/","syllables":"cho-lin-er-gic re-sis-tant"},"inflection":{"notes":"Adjective, no inflectional forms."},"usage_notes":{"explanation":"The term \"cholinergic-resistant\" describes a biological system (e.g., cells, tissues, organisms) that does not respond, or responds weakly, to cholinergic stimulation. Cholinergic stimulation typically involves the neurotransmitter acetylcholine or drugs that mimic or enhance its effects. Resistance can arise from various mechanisms, including altered receptors, reduced receptor density, or downstream signaling defects.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The organ was cholinergic resistant.","correct":"✓ The organ was cholinergic-resistant.","note":"Hyphen is required to link the two words into a single adjective."}],"priority":"☆☆☆"},"related_words":{"derivatives":["cholinergic (adjective)","resistance (noun)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"\"Cholinergic-resistant\" is a technical term used in biology, pharmacology, and medicine. It describes a state where a biological system is not responsive to cholinergic stimulation. Understanding requires knowledge of cholinergic neurotransmission and mechanisms of drug resistance."},"example_sentences":[{"sentence":"The study investigated the properties of cholinergic-resistant neurons in the brain.","translation":"その研究では、脳内のコリン作動薬抵抗性ニューロンの特性が調査された。","type":"scientific","meaning_category":"biology"},{"sentence":"The development of cholinergic-resistant pests poses a challenge for agriculture.","translation":"コリン作動薬抵抗性害虫の発生は、農業にとって課題となっている。","type":"agricultural","meaning_category":"agriculture"}]}