{"word":"Mylonites","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(地質学) ミロナイト：強いせん断変形を受けた結果、粒径が著しく小さくなった変成岩。","english_definition":"(geology) A fine-grained metamorphic rock formed by dynamic recrystallization of the constituent minerals resulting in a reduction in the grain size of the rock.","examples":[{"sentence":"Mylonites are commonly found in fault zones.","translation":"ミロナイトは断層帯でよく見られる。"},{"sentence":"The mylonites showed evidence of intense deformation.","translation":"そのミロナイトは激しい変形の証拠を示していた。"}],"collocations":["mylonite zone","ultramylonite","protomylonite","mylonitic foliation"],"synonyms":["tectonite","fault rock"],"antonyms":[]}],"etymology":{"value":"由来はギリシャ語の「mylos」（粉砕する）から来ており、これはミロナイトが形成される際の岩石の粉砕と粒径の縮小を反映している。","priority":"★★☆"},"pronunciation":{"ipa":"ˈmaɪləˌnaɪts","syllables":"My-lo-nites"},"inflection":{"noun_plural":"Mylonites"},"usage_notes":{"explanation":"Mylonites are metamorphic rocks that form under high shear stress, typically in fault zones. The intense deformation causes the original minerals to recrystallize into smaller grains, often resulting in a banded or foliated texture. Different types of mylonites are classified based on the degree of grain size reduction and the proportion of matrix to porphyroclasts (larger, relict grains).","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["mylonitic","mylonitization"],"related_terms":["fault","shear zone","metamorphism","recrystallization"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - specialized geological term.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"Mylonites are specialized geological terms used to describe metamorphic rocks formed under specific conditions of high shear stress and dynamic recrystallization. Understanding the term requires familiarity with basic geological concepts such as fault zones, metamorphism, and rock deformation processes."},"example_sentences":[{"sentence":"The thin section revealed the intricate microstructures within the mylonites.","translation":"薄片は、ミロナイト内の複雑な微細構造を明らかにした。","type":"general","meaning_category":"description"},{"sentence":"Geologists used the presence of mylonites to map the ancient fault line.","translation":"地質学者は、ミロナイトの存在を利用して、古代の断層線を地図に示した。","type":"context","meaning_category":"geology"}]}