{"word":"twice-insured","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"二重に保険をかけられた、二重保険の","english_definition":"Covered by two insurance policies.","examples":[{"sentence":"The car was twice-insured, which complicated the claims process after the accident.","translation":"その車は二重保険に入っていたため、事故後の保険金請求手続きが複雑になった。"},{"sentence":"It's generally not possible to receive double compensation for a loss if you are twice-insured.","translation":"二重保険に入っていても、通常、損失に対して二重の補償を受けることはできません。"}],"collocations":["twice-insured property","twice-insured vehicle","twice-insured against fire","twice-insured for flood damage"],"synonyms":["doubly insured","over-insured"],"antonyms":["underinsured","uninsured"]}],"etymology":{"value":"Formed from 'twice' (meaning two times) and 'insured' (covered by insurance).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈtwaɪs ɪnˈʃʊərd/","syllables":"twice-in-sured"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"'Twice-insured' describes a situation where the same asset or risk is covered by two separate insurance policies. While it might seem like a way to get double the compensation in case of a loss, insurance companies typically have clauses to prevent this. They coordinate to ensure that the insured party only receives compensation up to the actual amount of the loss. The term is often used in discussions about insurance fraud or the complexities of insurance claims.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is twice insured his house.","correct":"✓ His house is twice-insured.","note":"'Twice-insured' is an adjective describing the state of being insured, not a verb. Therefore, it modifies a noun (like 'house') rather than being used as a verb phrase."},{"incorrect":"✗ Being twice insured is always better.","correct":"✓ Being twice-insured doesn't necessarily mean better coverage.","note":"While it might seem beneficial, being twice-insured doesn't guarantee better coverage or double compensation. Insurance companies coordinate to avoid overpayment."}],"priority":"☆☆☆"},"related_words":{"derivatives":["insurance","insured","underinsured","overinsured"],"phrases":["double insurance","coordination of benefits","insurance claim"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - specialized term related to insurance.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Twice-insured' is a term used in the context of insurance, specifically when the same asset or risk is covered by two different insurance policies. It's important to understand that being twice-insured doesn't automatically mean you'll receive double the compensation if something goes wrong. Insurance companies typically coordinate to ensure that you only receive compensation up to the actual amount of the loss. This term is more likely to appear in legal or financial discussions related to insurance.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The company discovered that several of its vehicles were twice-insured due to an administrative error.","translation":"その会社は、事務処理の誤りにより、いくつかの車両が二重保険に加入していることを発見した。","type":"adjective","meaning_category":"二重保険の"},{"sentence":"Being twice-insured didn't result in a larger payout; the insurance companies coordinated to cover the loss.","translation":"二重保険に入っていても、より多くの保険金が支払われることはなく、保険会社が連携して損失を補填した。","type":"adjective","meaning_category":"二重保険の"}]}