{"word":"underfeeding","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"栄養不足、給餌不足、過小給餌","english_definition":"The state of not providing enough food or nourishment.","examples":[{"sentence":"Underfeeding can lead to serious health problems.","translation":"栄養不足は深刻な健康問題を引き起こす可能性があります。"},{"sentence":"The animals were suffering from underfeeding.","translation":"動物たちは栄養不足に苦しんでいました。"},{"sentence":"Underfeeding of infants can have long-term consequences.","translation":"乳児の栄養不足は長期的な影響を及ぼす可能性があります。"}],"collocations":["severe underfeeding","chronic underfeeding","effects of underfeeding","prevent underfeeding","risk of underfeeding"],"synonyms":["malnutrition","undernourishment","starvation","nutrient deficiency"],"antonyms":["overfeeding","malnutrition","obesity"]},{"part_of_speech":"verb","definition":"(人や動物)に十分な餌を与えない","english_definition":"To provide insufficient food or nourishment to (someone or something).","examples":[{"sentence":"They were accused of underfeeding the prisoners.","translation":"彼らは囚人たちに十分な食事を与えていないと非難されました。"},{"sentence":"Don't underfeed your pet; make sure they get enough to eat.","translation":"ペットに十分な餌を与えないでください。十分な食事を与えてください。"},{"sentence":"The plants were underfed and didn't grow properly.","translation":"植物は栄養不足で、適切に成長しませんでした。"}],"collocations":["underfeed a child","underfeed an animal","underfeed plants","deliberately underfeed","accidentally underfeed"],"synonyms":["starve","undernourish","deprive of food"],"antonyms":["overfeed","nourish","feed adequately"]}],"etymology":{"value":"The word \"underfeeding\" is formed by combining the prefix \"under-\" (meaning \"not enough\" or \"below\") with the word \"feeding\" (the act of providing food).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndərˈfiːdɪŋ/","syllables":"un-der-feed-ing"},"inflection":{"noun_plural":"underfeedings","verb_forms":{"present_simple":["underfeed","underfeeds"],"past_simple":"underfed","past_participle":"underfed","present_participle":"underfeeding"}},"usage_notes":{"explanation":"\"Underfeeding\" refers to the condition of not receiving enough food or nutrients. It can apply to humans, animals, or even plants. As a noun, it describes the state of being underfed. As a verb, it describes the act of providing insufficient food. It is often used in contexts related to health, nutrition, and animal care.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The underfeeding was caused by overeating.","correct":"✓ The underfeeding was caused by a lack of food.","note":"Underfeeding is the opposite of overeating. It is caused by insufficient food intake."},{"incorrect":"✗ He is underfeeding of food.","correct":"✓ He is underfeeding on food.","note":"The correct preposition to use with underfeeding is 'on'."}],"priority":"★★☆"},"related_words":{"derivatives":["underfed (adjective: not having been fed enough)","feed (verb/noun: to give food; food for animals)","feeding (noun: the act of giving food)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"underfeeding\" refers to the state of not providing enough food or nourishment. It is used in contexts where there is a deficiency in the amount of food given to someone or something, leading to potential health problems or stunted growth. It is important to distinguish it from related terms like malnutrition, which encompasses both underfeeding and overfeeding, as well as imbalances in nutrient intake. The term is often used in scientific, medical, or agricultural contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The researchers studied the effects of underfeeding on the growth of young animals.","translation":"研究者たちは、幼い動物の成長に対する栄養不足の影響を研究しました。","type":"noun","meaning_category":"栄養不足"},{"sentence":"The farmer was accused of underfeeding his livestock.","translation":"農家は家畜に十分な餌を与えていないと非難されました。","type":"verb","meaning_category":"十分な餌を与えない"},{"sentence":"Chronic underfeeding can lead to severe health complications.","translation":"慢性的な栄養不足は深刻な健康上の合併症につながる可能性があります。","type":"noun","meaning_category":"栄養不足"},{"sentence":"It's important not to underfeed your plants, especially during their growing season.","translation":"特に成長期には、植物に十分な栄養を与えないようにすることが重要です。","type":"verb","meaning_category":"十分な餌を与えない"}]}