{"word":"unemotional-looking","meanings":[{"part_of_speech":"adjective","definition":"感情を表に出さないように見える、無表情に見える","english_definition":"appearing to not show or express any emotions.","examples":[{"sentence":"The defendant remained unemotional-looking throughout the trial.","translation":"被告は裁判の間ずっと無表情だった。"},{"sentence":"Despite the tragic news, she remained unemotional-looking.","translation":"悲劇的な知らせにもかかわらず、彼女は無表情に見えた。"},{"sentence":"He gave an unemotional-looking response to the question.","translation":"彼はその質問に対して感情を表に出さないような返答をした。"}],"collocations":["remain unemotional-looking","appear unemotional-looking","unemotional-looking face","unemotional-looking expression"],"synonyms":["expressionless","impassive","stoic","blank-faced","deadpan","wooden"],"antonyms":["emotional","expressive","animated","passionate"],"notes":"This adjective describes someone's outward appearance and the impression they give, rather than their actual internal emotional state."}],"etymology":{"value":"Formed by combining 'un-' (not), 'emotional' (relating to emotions), and '-looking' (having the appearance of).","notes":"The word suggests a lack of visible emotion."},"pronunciation":{"ipa":"/ˌʌnɪˈmoʊʃənəl ˈlʊkɪŋ/","syllables":"un-e-mo-tion-al look-ing"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"The term 'unemotional-looking' is often used to describe someone who is trying to hide their emotions or who naturally has a reserved demeanor. It's important to remember that appearance doesn't always reflect inner feelings.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He was unemotional-looking, but inside he was very sad.","correct":"He was unemotional-looking, but inside he was very sad.","note":"This sentence is grammatically correct. Common mistakes might involve using it as a verb or misspelling it."}],"priority":"★☆☆"},"related_words":{"derivatives":["unemotionally (adverb)","emotional (adjective)","emotion (noun)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. More common in formal writing or detailed descriptions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unemotional-looking' describes someone who appears to lack visible emotion. It's a descriptive adjective used to convey a specific impression of someone's demeanor. It's more complex than simply saying someone is 'unemotional,' as it focuses on the outward appearance rather than the internal state."},"example_sentences":[{"sentence":"The spy's unemotional-looking demeanor made it difficult to read his true intentions.","translation":"そのスパイの無表情な態度は、彼の真の意図を読み取るのを困難にした。","type":"adjective","meaning_category":"appearance"},{"sentence":"Despite the chaos around her, the doctor remained calm and unemotional-looking as she treated the injured.","translation":"周りが混乱しているにもかかわらず、その医師は負傷者を治療しながら冷静で無表情に見えた。","type":"adjective","meaning_category":"appearance"},{"sentence":"The witness gave an unemotional-looking account of the events, which made some people question her sincerity.","translation":"目撃者は出来事について感情を表に出さないような説明をしたため、彼女の誠実さを疑う人もいた。","type":"adjective","meaning_category":"appearance"}]}