{"word":"hoardward","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(古語)宝を守る、財産を守る","english_definition":"(archaic) guarding treasure; protective of one's possessions.","examples":[{"sentence":"The dragon was hoardward of the ancient gold.","translation":"竜は古代の金を宝として守っていた。"},{"sentence":"A miser is often hoardward of his wealth, unwilling to share it.","translation":"守銭奴はしばしば自分の富を守り、分かち合うことを嫌がる。"}],"collocations":["hoardward dragon","hoardward miser"],"synonyms":["guarding","protective","defending","possessive","covetous"],"antonyms":["generous","liberal","giving","altruistic"]}],"etymology":{"value":"Old English 'hordweard,' from 'hord' (hoard) + 'weard' (ward, guard).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɔːrdwərd/","syllables":"hoard-ward"},"inflection":{"notes":"In modern English, it is rarely used. When used, it typically functions as an adjective. No plural form."},"usage_notes":{"explanation":"'Hoardward' is an archaic term, primarily found in older literature, especially that influenced by Old English or Anglo-Saxon themes. It describes someone or something that guards a hoard or treasure. The term implies not just guarding, but also a possessive or protective attitude towards the hoard.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted hoardward with his time.","correct":"✓ He was protective of his time.","note":"'Hoardward' specifically relates to guarding physical possessions or treasure, not abstract concepts like time."}],"priority":"★☆☆"},"related_words":{"derivatives":["hoard (noun, verb)","ward (noun, verb)"],"phrasal_verbs":[],"related_concepts":["treasure","guard","protection","possession","dragonlore"]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency - primarily found in older literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Hoardward' is an archaic and rare word, primarily encountered in older literature, especially works influenced by Old English. It describes someone or something that guards a hoard or treasure, implying a protective and possessive attitude. Due to its rarity, it is not part of common modern vocabulary and would be understood by a limited audience. Understanding requires familiarity with archaic language and literary contexts."},"example_sentences":[{"sentence":"The hoardward serpent coiled around the gold, its eyes never leaving the entrance.","translation":"宝を守る蛇は金に巻き付き、その目は入り口から決して離れなかった。","type":"adjective","meaning_category":"guarding treasure"},{"sentence":"He became hoardward of his memories, unwilling to share them with anyone.","translation":"彼は自分の記憶を守るようになり、誰とも共有しようとしなかった。","type":"adjective","meaning_category":"protective"}]}