{"word":"bombardments","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(連続)爆撃、砲撃、質問攻め、(大量の)浴びせかけ","english_definition":"the act of continuously attacking a place with bombs or artillery fire; a sustained attack, especially with questions or information.","examples":[{"sentence":"The city suffered heavy bombardments during the war.","translation":"その都市は戦争中、激しい爆撃に苦しんだ。"},{"sentence":"The enemy launched a series of heavy bombardments.","translation":"敵は一連の激しい砲撃を開始した。"},{"sentence":"The politician faced a bombardment of questions from the press.","translation":"政治家は報道陣からの質問攻めにあった。"},{"sentence":"We were subjected to a bombardment of advertising.","translation":"私たちは大量の広告を浴びせかけられた。"}],"collocations":["heavy bombardment (激しい爆撃)","artillery bombardment (砲撃)","air bombardment (空爆)","question bombardment (質問攻め)","constant bombardment (絶え間ない攻撃)","sustained bombardment (持続的な攻撃)"],"synonyms":["attack","shelling","barrage","onslaught","assault","fusillade","volley","hail"],"antonyms":["defense","protection","retreat"]},{"part_of_speech":"noun","definition":"(比喩的に)大量の何かを浴びせること","english_definition":"a concentrated outpouring or directed delivery of something, such as information, criticism, or stimuli.","examples":[{"sentence":"The new policy led to a bombardment of complaints.","translation":"新しい政策は苦情の殺到につながった。"},{"sentence":"The actor received a bombardment of fan mail.","translation":"その俳優は大量のファンレターを受け取った。"},{"sentence":"The website experienced a bombardment of traffic after the announcement.","translation":"発表後、ウェブサイトへのアクセスが殺到した。"}],"collocations":["bombardment of information (情報の洪水)","bombardment of criticism (批判の集中砲火)","bombardment of stimuli (刺激の洪水)"],"synonyms":["deluge","flood","onslaught","torrent","influx","outpouring"],"antonyms":["dearth","lack","scarcity"]}],"etymology":{"value":"The word \"bombardment\" comes from the French word \"bombardement,\" which is derived from \"bombarder,\" meaning \"to bombard.\" This, in turn, comes from \"bombarde,\" a type of large cannon or mortar used in the Middle Ages. The ultimate origin is likely from Late Latin \"bombus,\" meaning a deep, hollow sound.","priority":"★★☆"},"pronunciation":{"ipa":"/bɒmˈbɑːrdmənts/","syllables":"bom-bard-ments"},"inflection":{"noun_plural":"bombardments","noun_singular":"bombardment"},"usage_notes":{"explanation":"\"Bombardment\" refers to a sustained attack, either literally with bombs or artillery, or figuratively with a barrage of questions, information, or criticism. The word implies a relentless and overwhelming assault. It is often used in military contexts, but also in media, politics, and everyday life to describe situations where someone or something is subjected to a continuous stream of something.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The bombardment was very bombard.","correct":"The bombardment was very intense.","note":"\"Bombard\" is a verb, while \"bombardment\" is a noun. Use an adjective like \"intense,\" \"heavy,\" or \"severe\" to describe the bombardment."},{"incorrect":"They suffered a bombardment of rain.","correct":"They suffered a deluge of rain.","note":"While \"bombardment\" can be used figuratively, it often implies a negative or overwhelming experience. For neutral or positive situations, \"deluge,\" \"flood,\" or \"outpouring\" might be more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["bombard (verb)","bombardier (noun)"],"phrasal_verbs":[],"related_nouns":["bomb","bomber","artillery","shell"],"related_verbs":["attack","shell","pummel","assail"],"related_adjectives":["intense","heavy","sustained","relentless"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. More common in historical or military contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"bombardments\" is a relatively advanced term, typically used in contexts involving military conflict or intense, overwhelming situations. Understanding its meaning requires a grasp of abstract concepts and the ability to infer meaning from context. It's not a word commonly encountered in everyday conversation, but rather in news reports, historical accounts, or technical writing."},"example_sentences":[{"sentence":"The city faced relentless bombardments from the air.","translation":"その都市は空からの絶え間ない爆撃に直面した。","type":"noun","meaning_category":"Military attack"},{"sentence":"The company received a bombardment of complaints after the product recall.","translation":"その会社は製品リコールの後、苦情の殺到を受けた。","type":"noun","meaning_category":"Figurative attack"},{"sentence":"The island endured weeks of naval bombardments.","translation":"その島は何週間にもわたる海軍の砲撃に耐えた。","type":"noun","meaning_category":"Military attack"},{"sentence":"The students were subjected to a bombardment of information during the lecture.","translation":"学生たちは講義中、大量の情報を浴びせかけられた。","type":"noun","meaning_category":"Figurative attack"},{"sentence":"The trenches were designed to withstand heavy bombardments.","translation":"その塹壕は激しい爆撃に耐えるように設計されていた。","type":"noun","meaning_category":"Military attack"}]}