{"word":"Choora","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A traditional bangle worn by Punjabi brides in India. It is a set of red and white bangles, typically ivory or plastic, and is a significant part of the wedding attire.","english_definition":"A set of red and white bangles worn by Punjabi brides as a part of their wedding attire.","examples":[{"sentence":"The bride's choora was beautifully designed.","translation":"花嫁のチョーラは美しくデザインされていた。"},{"sentence":"Wearing a choora is an important tradition in Punjabi weddings.","translation":"チョーラを身につけることは、パンジャブの結婚式における重要な伝統です。"}],"collocations":["wear a choora","traditional choora","bridal choora","red and white choora"],"synonyms":["bangles","bridal bangles"],"antonyms":[]}],"etymology":{"value":"Derived from Punjabi culture and tradition. The word 'choora' itself refers to the set of bangles.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʃuːrɑː/","syllables":"Choo-ra"},"inflection":{"notes":"Noun, plural form is 'chooras'."},"usage_notes":{"explanation":"The choora is a symbol of marriage and fertility. The bride typically wears it for a certain period after the wedding, often for a year or 40 days, depending on family customs. It is considered auspicious and is believed to bring good luck to the newly married couple.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He wore a choora to the wedding.","correct":"✓ She wore a choora to the wedding.","note":"Choora is traditionally worn by the bride, not the groom."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'choora' refers to a specific cultural item, primarily known within the context of Punjabi weddings. Understanding requires knowledge of Indian wedding traditions and customs. Therefore, it is not commonly used or understood outside of this cultural context."},"example_sentences":[{"sentence":"Her maternal uncle puts the choora on the bride's wrists.","translation":"彼女の母方の叔父が花嫁の手首にチョーラをつけます。","type":"noun","meaning_category":"Traditional bangle"},{"sentence":"The red and white of the choora symbolize prosperity and new beginnings.","translation":"チョーラの赤と白は、繁栄と新たな始まりを象徴しています。","type":"noun","meaning_category":"Symbolism"}]}