{"word":"Melungeon","priority":"低","meanings":[{"part_of_speech":"名詞","definition":"アメリカ合衆国南東部のアパラチア山脈地域に住む、出自が不明瞭な混血の人々を指す歴史的・文化的な用語。","english_definition":"A term, now considered archaic and potentially offensive, historically applied to groups of people of mixed ancestry in the Appalachian region of the Southeastern United States. Their exact origins are uncertain, but they are generally believed to be descendants of Europeans, Africans, and Native Americans.","examples":[{"sentence":"The origins of the Melungeon people have been a subject of much debate and speculation.","translation":"メルンジェオンの人々の起源は、多くの議論と憶測の対象となってきた。"},{"sentence":"Some Melungeon families have been able to trace their ancestry back to the early colonial period.","translation":"メルンジェオンの家族の中には、その祖先を初期の植民地時代まで遡ることができる者もいる。"}],"collocations":["Melungeon heritage (メルンジェオンの遺産)","Melungeon ancestry (メルンジェオンの祖先)","Melungeon community (メルンジェオンのコミュニティ)","Melungeon history (メルンジェオンの歴史)"],"synonyms":["混血民","アパラチアの混血集団"],"antonyms":[]},{"part_of_speech":"形容詞","definition":"メルンジェオンに関連する、またはメルンジェオンに特徴的な。","english_definition":"Relating to or characteristic of the Melungeon people.","examples":[{"sentence":"Melungeon folklore is rich with stories of their mysterious origins.","translation":"メルンジェオンの民間伝承は、彼らの神秘的な起源の物語に富んでいる。"},{"sentence":"Researchers have studied Melungeon genealogy to understand their complex heritage.","translation":"研究者たちは、彼らの複雑な遺産を理解するためにメルンジェオンの系図を研究してきた。"}],"collocations":["Melungeon folklore (メルンジェオンの民間伝承)","Melungeon genealogy (メルンジェオンの系図)","Melungeon culture (メルンジェオンの文化)"],"synonyms":["混血の","アパラチアの"],"antonyms":[]}],"etymology":{"value":"語源は不明瞭。いくつかの説があり、フランス語の「mélange」（混合）に由来するという説、ポルトガル語の「melungo」（白人を意味する蔑称）に由来するという説、アフリカ起源の言葉に由来するという説などがある。","priority":"★★☆"},"pronunciation":{"ipa":"/məˈlʌndʒən/","syllables":"Me-lun-geon"},"inflection":{"notes":"名詞の複数形は Melungeons。形容詞は通常変化しません。"},"usage_notes":{"explanation":"「**Melungeon**」は、アメリカ合衆国南東部のアパラチア山脈地域に住む、出自が不明瞭な混血の人々を指す用語です。この用語は、歴史的に差別的な意味合いを持つことがあり、現代では使用を避けるべきだと考える人もいます。出自については、ヨーロッパ人、アフリカ人、ネイティブアメリカンの混血であるという説が一般的ですが、正確な起源は不明です。近年では、遺伝子研究などによって、そのルーツがより深く探求されています。使用する際には、その歴史的背景と潜在的な侮辱性を考慮する必要があります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Melungeons are a race.","correct":"✓ Melungeons are a group of people of mixed ancestry.","note":"メルンジェオンは単一の「人種」ではなく、混血の出自を持つ人々の集団です。"},{"incorrect":"✗ The term Melungeon is always offensive.","correct":"✓ The term Melungeon can be considered offensive by some people.","note":"「Melungeon」という言葉は、常に侮辱的であるとは限りませんが、歴史的な背景から、不快に感じる人もいます。使用する際には注意が必要です。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"不明","frequency_google_ngram":"低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Melungeon**」は、アメリカ合衆国南東部のアパラチア山脈地域に住む、出自が不明瞭な混血の人々を指す、歴史的・文化的な用語です。この用語は、その起源や意味合いについて複雑な歴史的背景があり、現代では使用を避けるべきだと考える人もいます。出自については、ヨーロッパ人、アフリカ人、ネイティブアメリカンの混血であるという説が一般的ですが、正確な起源は不明です。使用する際には、その歴史的背景と潜在的な侮辱性を十分に理解する必要があります。この単語は、歴史、文化、社会学などの文脈で現れることがあります。"},"example_sentences":[{"sentence":"The documentary explored the history and culture of the Melungeon people.","translation":"そのドキュメンタリーは、メルンジェオンの人々の歴史と文化を探求した。","type":"general","meaning_category":"歴史・文化"},{"sentence":"Genetic studies have shed light on the possible origins of the Melungeon population.","translation":"遺伝子研究は、メルンジェオンの人々の起源の可能性に光を当ててきた。","type":"scientific","meaning_category":"起源・遺伝子"}]}