{"word":"overpolice","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"過剰に取り締まる、過剰に警察力を投入する","english_definition":"To police (an area or group of people) to an excessive degree.","examples":[{"sentence":"Critics argue that some neighborhoods are overpoliced, leading to strained community relations.","translation":"批評家たちは、一部の地域が過剰に取り締まられており、地域社会との関係が悪化していると主張している。"},{"sentence":"The city has been accused of overpolicing minority communities.","translation":"その都市は、少数派コミュニティを過剰に取り締まっていると非難されている。"}],"collocations":["overpolice a neighborhood (地域を過剰に取り締まる)","overpolice a community (コミュニティを過剰に取り締まる)","overpolice a protest (抗議活動を過剰に取り締まる)"],"synonyms":["harass","persecute","oppress"],"antonyms":["underpolice","neglect"],"related_words":["police brutality","racial profiling","excessive force"]}],"etymology":{"value":"\"Over-\" (過剰に) + \"police\" (警察する)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊvərpəˈliːs/","syllables":"o-ver-po-lice"},"inflection":{"verb_forms":{"present_simple":["overpolice","overpolices"],"past_simple":"overpoliced","past_participle":"overpoliced","present_participle":"overpolicing"}},"usage_notes":{"explanation":"\"Overpolice\" typically refers to the excessive or disproportionate use of police force or surveillance in a particular area or towards a specific group of people. It often implies a negative impact on the community, such as increased tension, distrust, and feelings of harassment. The term is often used in discussions about social justice, civil rights, and police reform.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The area is overpoliced by citizens.","correct":"✓ The area is overpoliced by the police.","note":"The subject of 'overpolice' should be the authority doing the policing, typically the police force or government. Citizens do not overpolice."},{"incorrect":"✗ The overpolicing is good for safety.","correct":"✓ The overpolicing is seen as oppressive by some.","note":"Overpolicing is generally viewed negatively, so stating it's 'good for safety' might be controversial without further context."}],"priority":"★★☆"},"related_words":{"derivatives":["overpolicing (noun: 過剰な取り締まり)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"overpolice\" is a relatively complex term that is often used in discussions about social justice and law enforcement. It refers to the practice of policing an area or group of people to an excessive degree, often resulting in negative consequences such as strained community relations and feelings of harassment. Understanding this term requires familiarity with the broader context of debates surrounding police reform and civil rights."},"example_sentences":[{"sentence":"The report highlighted the issue of certain neighborhoods being overpoliced while others are neglected.","translation":"その報告書は、特定の地域が過剰に取り締まられている一方で、他の地域が見過ごされているという問題を強調した。","type":"verb","meaning_category":"過剰に取り締まる"},{"sentence":"Many residents feel that they are being unfairly overpoliced due to their ethnicity.","translation":"多くの住民は、自分たちの民族のために不当に過剰に取り締まられていると感じている。","type":"verb","meaning_category":"過剰に取り締まる"}]}