{"word":"multi-focal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"多焦点の、多焦点レンズの","english_definition":"Having more than one focal point; designed with more than one focal point.","examples":[{"sentence":"Multi-focal lenses allow you to see clearly at different distances.","translation":"多焦点レンズを使用すると、さまざまな距離で鮮明に見ることができます。"},{"sentence":"He wears multi-focal glasses for reading and driving.","translation":"彼は読書と運転のために多焦点眼鏡をかけています。"}],"collocations":["multi-focal lens","multi-focal glasses","multi-focal contact lenses"],"synonyms":["progressive","varifocal"],"antonyms":["single-vision","monofocal"]}],"etymology":{"value":"\"Multi-\" (many) + \"focal\" (relating to a focus).","priority":"★★★"},"pronunciation":{"ipa":"/ˌmʌltiˈfoʊkəl/","syllables":"mul-ti-fo-cal"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"\"Multi-focal\" is primarily used in the context of optics, specifically referring to lenses (glasses or contact lenses) that have multiple focal points to correct vision at different distances. These are often used to correct presbyopia (age-related farsightedness) and allow the wearer to see clearly both near and far without needing to switch glasses.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a multi-focus lens.","correct":"✓ He has a multi-focal lens.","note":"The correct term is \"multi-focal,\" not \"multi-focus.\""}],"priority":"★★☆"},"related_words":{"derivatives":["multifocally"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word \"multi-focal\" is a technical term, primarily used in the context of optometry and ophthalmology. It refers to lenses that have multiple focal points, allowing the wearer to see clearly at different distances. It is commonly used to describe glasses or contact lenses designed for people with presbyopia or other vision problems requiring correction at multiple distances."},"example_sentences":[{"sentence":"The doctor recommended multi-focal lenses to correct his vision.","translation":"医師は彼の視力を矯正するために多焦点レンズを勧めました。","type":"example","meaning_category":"vision correction"},{"sentence":"She found that multi-focal contact lenses were more convenient than reading glasses.","translation":"彼女は、多焦点コンタクトレンズの方が老眼鏡よりも便利であることに気づきました。","type":"example","meaning_category":"vision correction"}]}