{"word":"directionality","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"方向性、指向性","english_definition":"The property of being directional; the characteristic of having or following a particular direction.","examples":[{"sentence":"The directionality of the river flow is from north to south.","translation":"その川の流れの方向性は北から南へです。"},{"sentence":"This antenna has good directionality, allowing it to focus on signals from a specific location.","translation":"このアンテナは方向性が良く、特定の場所からの信号に焦点を当てることができます。"},{"sentence":"The study examined the directionality of social influence within the group.","translation":"その研究は、グループ内での社会的影響の方向性を調べました。"}],"collocations":["flow directionality (流れの方向性)","signal directionality (信号の方向性)","influence directionality (影響の方向性)","gene directionality (遺伝子の方向性)","directional preference (方向の好み)"],"synonyms":["orientation","alignment","course","tendency","vector","bearing"],"antonyms":["randomness","nondirectionality","isotropy"]},{"part_of_speech":"noun","definition":"(生物学) (特にDNAやRNAの)方向性","english_definition":"(Biology) The property of a molecule, especially DNA or RNA, having a specific orientation due to the arrangement of its chemical groups.","examples":[{"sentence":"DNA has directionality; one end is the 5' end and the other is the 3' end.","translation":"DNAには方向性があり、一方の端は5'末端、もう一方の端は3'末端です。"},{"sentence":"The directionality of RNA synthesis is always 5' to 3'.","translation":"RNA合成の方向性は常に5'から3'です。"},{"sentence":"Understanding the directionality of DNA is crucial for genetic engineering.","translation":"DNAの方向性を理解することは、遺伝子工学にとって非常に重要です。"}],"collocations":["5' to 3' directionality (5'から3'の方向性)","DNA directionality (DNAの方向性)","RNA directionality (RNAの方向性)","nucleic acid directionality (核酸の方向性)"],"synonyms":["polarity","orientation"],"antonyms":[]}],"etymology":{"value":"\"Directional\" + \"-ity\". The term \"directional\" comes from \"direction,\" which originates from Latin \"directio,\" meaning \"a straightening, a direct course.\" The suffix \"-ity\" denotes a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˌrɛkʃəˈnæləti/","syllables":"di-rec-tion-al-i-ty"},"inflection":{"noun_plural":"directionalities"},"usage_notes":{"explanation":"\"Directionality\" refers to the characteristic of having a specific direction or orientation. It is used in various fields, including physics, biology, and social sciences. In biology, particularly in the context of DNA and RNA, it refers to the chemical orientation of the molecule, with distinct 5' and 3' ends. Understanding the specific context is essential to interpreting the meaning of \"directionality\" correctly.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The directionality is important for understanding the map.","correct":"✓ The direction is important for understanding the map.","note":"In simple contexts where only the direction is relevant, use \"direction\" instead of \"directionality.\" \"Directionality\" is more appropriate when discussing the property or characteristic of having a direction. "},{"incorrect":"✗ The directionality of the reaction was random.","correct":"✓ The reaction lacked directionality. / ✓ The reaction was nondirectional.","note":"If something lacks a specific direction, it's better to say it lacks directionality or is nondirectional rather than implying it has a random directionality."}],"priority":"★★☆"},"related_words":{"derivatives":["directional (adjective: 方向性のある)","direction (noun: 方向)","directly (adverb: 直接的に)"],"phrasal_verbs":[],"related_terms":["anisotropy (名詞: 異方性)","isotropy (名詞: 等方性)","vector (名詞: ベクトル)","orientation (名詞: 方向、方位)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 専門的な文脈で使われることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Directionality\" is a term used to describe the property of having a specific direction or orientation. It is commonly used in technical and scientific contexts. For example, in biology, it refers to the specific chemical orientation of molecules like DNA and RNA. In physics, it can refer to the direction of forces or fields. The term is more abstract than simply \"direction\" and implies a characteristic or property related to having a specific direction. Understanding the context is crucial for interpreting its meaning accurately. "},"example_sentences":[{"sentence":"The **directionality** of light propagation is crucial in fiber optics.","translation":"光ファイバーでは、光の伝播の方向性が重要です。","type":"noun","meaning_category":"方向性 (物理)"},{"sentence":"The **directionality** of the promoter sequence determines which strand of DNA will be transcribed.","translation":"プロモーター配列の方向性によって、DNAのどの鎖が転写されるかが決まります。","type":"noun","meaning_category":"方向性 (生物学)"},{"sentence":"The research focused on the **directionality** of information flow within the organization.","translation":"その研究は、組織内の情報フローの方向性に焦点を当てました。","type":"noun","meaning_category":"方向性 (社会科学)"}]}