{"word":"Zooxanthella","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"褐虫藻（かっちゅうそう）: 腔腸動物、特にサンゴに共生する単細胞の藻類の一種","english_definition":"A unicellular, golden-brown algae (dinoflagellate) that lives symbiotically within the tissues of various marine invertebrates, especially corals.","examples":[{"sentence":"Zooxanthellae provide corals with essential nutrients through photosynthesis.","translation":"褐虫藻は光合成を通してサンゴに不可欠な栄養素を提供する。"},{"sentence":"Coral bleaching occurs when corals expel their zooxanthellae due to environmental stress.","translation":"サンゴの白化は、環境ストレスによりサンゴが褐虫藻を放出するときに起こる。"}],"collocations":["coral zooxanthellae","expel zooxanthellae","symbiotic zooxanthellae"],"synonyms":["symbiotic algae","dinoflagellate algae"],"antonyms":[]}],"etymology":{"value":"Derived from Greek roots: 'zoon' (animal), 'xanthos' (yellow), and 'ella' (diminutive suffix), referring to the algae's symbiotic relationship with animals and its yellowish-brown color.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌzoʊ.əˈzænθɛlə/","syllables":"zo-o-zan-thel-la"},"inflection":{"noun_plural":"Zooxanthellae (plural)"},"usage_notes":{"explanation":"'Zooxanthella' refers specifically to a type of dinoflagellate algae that forms a symbiotic relationship with marine invertebrates, most notably corals. This symbiosis is crucial for the health and survival of coral reefs, as the algae provide the coral with essential nutrients through photosynthesis.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Zooxanthella are a type of coral.","correct":"✓ Zooxanthellae are a type of algae that live in coral.","note":"Zooxanthellae are algae, not coral themselves. They live within coral tissues. "},{"incorrect":"✗ Zooxanthella is responsible for coral's color.","correct":"✓ Zooxanthellae are responsible for coral's color.","note":"Since 'zooxanthellae' is plural, the verb should also be plural."}],"priority":"★★☆"},"related_words":{"derivatives":["zooxanthellate (adjective: containing zooxanthellae)","symbiosis (noun: the interaction between two different organisms living in close physical association)","photosynthesis (noun: the process by which plants and some other organisms use sunlight to synthesize foods from carbon dioxide and water)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. (Specialized scientific term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Zooxanthella' is a scientific term referring to a specific type of algae that lives inside coral and other marine animals. These algae are very important because they help the coral get food through a process called photosynthesis. When the water gets too warm or polluted, the coral can push out the zooxanthellae, causing the coral to turn white, a process known as coral bleaching. Understanding zooxanthellae is crucial for understanding the health of coral reefs.","priority":"★★★"},"example_sentences":[{"sentence":"Healthy corals are vibrant because of the zooxanthellae living in their tissues.","translation":"健康なサンゴは、その組織に生息する褐虫藻のために鮮やかである。","type":"noun","meaning_category":"Algae"},{"sentence":"The loss of zooxanthellae is a major cause of coral reef decline worldwide.","translation":"褐虫藻の喪失は、世界中のサンゴ礁の衰退の主な原因である。","type":"noun","meaning_category":"Algae"},{"sentence":"Researchers are studying how to make zooxanthellae more resilient to climate change.","translation":"研究者たちは、褐虫藻を気候変動に対してより回復力のあるものにする方法を研究している。","type":"noun","meaning_category":"Algae"}]}