{"word":"baby-kissing","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(軽蔑的に) 赤ちゃんにキスをすること; 特に政治家が支持を得るために行う行為","english_definition":"(derogatory) The act of kissing babies, especially by politicians seeking public support.","examples":[{"sentence":"The candidate's baby-kissing tour was widely criticized as insincere.","translation":"その候補者の赤ちゃんにキスをする巡業は、誠意がないとして広く批判された。"},{"sentence":"He dismissed the event as just another example of baby-kissing.","translation":"彼はそのイベントを、支持を得るための単なるパフォーマンスだと一蹴した。"}],"collocations":["go on a baby-kissing tour","baby-kissing politician","baby-kissing campaign"],"synonyms":["pandering","grandstanding","showing off"],"antonyms":[],"notes":"Often used sarcastically or cynically to describe politicians' attempts to appear relatable and caring."}],"etymology":{"value":"A compound word formed from 'baby' and 'kissing', describing the act of kissing babies. The term gained a negative connotation as it became associated with politicians' insincere attempts to gain popularity.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbeɪbiˌkɪsɪŋ/","syllables":"bay-bee-kiss-ing"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Baby-kissing' is primarily used as a noun, often in a derogatory or cynical way, to describe a politician's behavior of kissing babies for the purpose of gaining votes or appearing relatable. It implies that the action is insincere and solely for political gain.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is very baby-kissing.","correct":"✓ He is engaged in baby-kissing.","note":"'Baby-kissing' is typically used as a noun or a gerund (verb acting as a noun), not as an adjective."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["photo op","stump speech","campaign trail"],"priority":"★☆☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Baby-kissing' is a term used to describe the act of politicians kissing babies, often seen as a way to gain public support. It's usually used in a negative way, suggesting that the politician is not sincere and is only doing it for votes. The term is not very common in everyday conversation but might appear in news articles or political commentary."},"example_sentences":[{"sentence":"The politician's **baby-kissing** at the local fair seemed staged.","translation":"その政治家の地元の祭りで赤ちゃんにキスをする様子は、まるで演出されたかのようだった。","type":"noun","meaning_category":"赤ちゃんにキスをすること (政治家のパフォーマンス)"}]}