{"word":"Subsumption","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"包含、包括、包摂","english_definition":"The act of including something under a more general category or rule.","examples":[{"sentence":"The subsumption of individual cases under general principles is essential for scientific reasoning.","translation":"個々の事例を一般原則に包含することは、科学的推論に不可欠である。"},{"sentence":"The subsumption architecture is a reactive robotic architecture that emphasizes a bottom-up design.","translation":"サブサンプションアーキテクチャは、ボトムアップ設計を重視する反応型ロボットアーキテクチャである。"},{"sentence":"The legal concept of subsumption involves applying a general law to a specific set of facts.","translation":"法的な包含の概念は、一般的な法律を特定の事実関係に適用することを含む。"}],"collocations":["subsumption architecture","legal subsumption","logical subsumption","semantic subsumption"],"synonyms":["inclusion","incorporation","encompassment","absorption","assimilation"],"antonyms":["separation","exclusion","differentiation"]}],"etymology":{"value":"Derived from the Latin 'subsumere,' meaning 'to take from below, take up, include.' 'Sub-' means 'under,' and 'sumere' means 'to take.'","priority":"★★★"},"pronunciation":{"ipa":"/səbˈsʌmpʃən/","syllables":"sub-sump-tion"},"inflection":{"noun_plural":"subsumptions"},"usage_notes":{"explanation":"'Subsumption' refers to the act of categorizing something specific under a broader, more general category or rule. It's commonly used in fields like law, computer science (especially AI and robotics), and philosophy. In law, it refers to the application of a general law to a specific set of facts. In AI, the subsumption architecture is a specific type of control architecture for robots.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The subsumption of the data was difficult.","correct":"✓ The subsumption of the data under the existing categories was difficult.","note":"It's important to specify what the subsumption is *under*. The sentence should clarify the broader category or rule that the specific item is being included in."},{"incorrect":"✗ He subsumed the argument.","correct":"✓ He used subsumption in the argument.","note":"'Subsume' as a verb means 'to contain or include,' but the noun 'subsumption' refers to the *act* of including. To say someone 'subsumed' something is grammatically correct but might not convey the intended meaning as clearly as using 'subsumption' as a noun describing a process or method."}],"priority":"★★☆"},"related_words":{"derivatives":["subsume (verb)","subsumable (adjective)"],"phrasal_verbs":[],"related_concepts":["hierarchy","classification","categorization","abstraction"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency, primarily in academic and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Subsumption' is a formal term that describes the act of placing a specific instance or example into a broader category or under a general rule. It's often used in academic or technical writing, particularly in fields like law, philosophy, and computer science. Think of it as fitting a puzzle piece (the specific instance) into a larger picture (the general category). Understanding this word requires a grasp of abstract concepts and hierarchical relationships."},"example_sentences":[{"sentence":"The court considered the subsumption of the defendant's actions under the relevant statute.","translation":"裁判所は、被告の行為を関連する法令に包含することを検討した。","type":"noun","meaning_category":"legal"},{"sentence":"The robot's behavior emerges from the interaction of simple layers in the subsumption architecture.","translation":"ロボットの動作は、サブサンプションアーキテクチャにおける単純なレイヤーの相互作用から生まれる。","type":"noun","meaning_category":"computer science"},{"sentence":"The subsumption of personal desires under the collective good is a common theme in utopian literature.","translation":"個人の欲望を集合的な利益に包含することは、ユートピア文学における共通のテーマである。","type":"noun","meaning_category":"general"}]}