{"word":"mystax","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(昆虫学)口上板の縁にある剛毛の列。特にハエ目の昆虫に見られる。","english_definition":"(entomology) A row of bristles on the edge of the epistome, especially in Diptera (flies).","examples":[{"sentence":"The mystax is an important feature for identifying certain species of robber flies.","translation":"口上板の剛毛の列は、一部のムシヒキアブの種を識別するための重要な特徴です。"},{"sentence":"The density and length of the mystax can vary significantly between different fly species.","translation":"口上板の剛毛の列の密度と長さは、ハエの種によって大きく異なることがあります。"}],"collocations":["dense mystax","sparse mystax","prominent mystax","mystax bristles","epistomal mystax"],"synonyms":["facial bristles","epistomal bristles"],"antonyms":[]}],"etymology":{"value":"Derived from the Ancient Greek word 'μύσταξ' (mustax), meaning 'upper lip' or 'moustache'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɪstæks/","syllables":"mys-tax"},"inflection":{"noun_plural":"mystaces"},"usage_notes":{"explanation":"The term 'mystax' is primarily used in entomology, specifically when describing the morphology of insects, especially flies (Diptera). It refers to the row of bristles located on the epistome (the area between the frons and the clypeus) of the insect's face. These bristles can serve various functions, such as protecting the insect's eyes or assisting in prey capture. The presence, density, and arrangement of the mystax are often important taxonomic characteristics used for species identification.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The insect had a long mustache.","correct":"✓ The insect had a prominent mystax.","note":"While 'mystax' is derived from a word meaning 'moustache', it refers specifically to the bristles on the epistome of insects, not a general mustache-like feature."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["epistome","clypeus","frons","bristle","Diptera","insect morphology"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low frequency - specialized term used in entomology.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'mystax' is a highly specialized term primarily used within the field of entomology. Understanding its meaning requires familiarity with insect anatomy and taxonomic terminology. It is unlikely to be encountered outside of scientific literature or discussions related to insect morphology, particularly within the order Diptera (flies)."},"example_sentences":[{"sentence":"Close examination of the fly's head revealed a dense mystax covering the lower portion of its face.","translation":"ハエの頭部を詳しく調べたところ、顔の下部を覆う密な口上板の剛毛の列が明らかになった。","type":"noun","meaning_category":"entomology"},{"sentence":"The arrangement of the bristles in the mystax is a key characteristic used to differentiate between species of robber flies.","translation":"口上板の剛毛の列の配置は、ムシヒキアブの種を区別するために使用される重要な特徴です。","type":"noun","meaning_category":"entomology"}]}