{"word":"biophilic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"バイオフィリアの、自然を愛する","english_definition":"Relating to or characterized by biophilia; having a love of nature.","examples":[{"sentence":"The architect incorporated biophilic design principles into the building.","translation":"建築家はバイオフィリックデザインの原則を建物に取り入れました。"},{"sentence":"Biophilic design aims to connect building occupants more closely to nature.","translation":"バイオフィリックデザインは、建物の居住者をより自然に近づけることを目的としています。"},{"sentence":"Studies have shown that biophilic environments can reduce stress and improve well-being.","translation":"研究によると、バイオフィリックな環境はストレスを軽減し、幸福度を向上させることが示されています。"}],"collocations":["biophilic design (バイオフィリックデザイン)","biophilic architecture (バイオフィリック建築)","biophilic environment (バイオフィリックな環境)","biophilic tendencies (バイオフィリックな傾向)","biophilic elements (バイオフィリックな要素)"],"synonyms":["nature-loving","ecophilic","environmentally conscious"],"antonyms":["biophobic"]},{"part_of_speech":"noun","definition":"バイオフィリア（愛自然的感情）を持つ人","english_definition":"A person who has biophilia; a lover of nature.","examples":[{"sentence":"As a biophilic, she spends much of her time outdoors.","translation":"バイオフィリアとして、彼女は多くの時間を屋外で過ごします。"},{"sentence":"Biophilics often advocate for environmental conservation.","translation":"バイオフィリアの人々は、しばしば環境保護を提唱します。"}],"collocations":[],"synonyms":["nature lover","environmentalist"],"antonyms":["biophobe"]}],"etymology":{"value":"The word \"biophilic\" is derived from the Greek words \"bios\" (life) and \"philia\" (love of). It was popularized by biologist Edward O. Wilson in his 1984 book, Biophilia.","priority":"★★★"},"pronunciation":{"ipa":"/ˌbaɪoʊˈfɪlɪk/","syllables":"bi-o-phil-ic"},"inflection":{"notes":"Adjective: biophilic; Noun: biophilic (person)"},"usage_notes":{"explanation":"\"Biophilic\" is most commonly used as an adjective to describe designs, environments, or tendencies that incorporate or reflect a love of nature. It is often used in the context of architecture, interior design, and urban planning. As a noun, it refers to a person who has a strong connection to and love for nature. The term is rooted in the concept of biophilia, which suggests that humans have an innate tendency to seek connections with nature and other forms of life.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The city is very biophilic.","correct":"✓ The city incorporates biophilic design elements.","note":"It's more accurate to say that a city incorporates biophilic design elements rather than saying the city itself is biophilic. The term usually describes specific designs or tendencies rather than entire entities. "},{"incorrect":"✗ He is a biophilia.","correct":"✓ He is biophilic. / ✓ He is a biophilic person.","note":"\"Biophilic\" is the adjective. The noun form to describe a person is either \"a biophilic person\" or, less commonly, simply \"a biophilic\"."}],"priority":"★★☆"},"related_words":{"derivatives":["biophilia (バイオフィリア)","biophily (バイオフィリー)"],"phrasal_verbs":[],"related_concepts":["nature connectedness","environmental psychology","restorative environment"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but increasing in usage in fields like architecture and design.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"\"Biophilic\" is a specialized term primarily used in fields like architecture, design, and environmental studies. It describes something that embodies a love of nature or incorporates natural elements to enhance well-being. Understanding the term requires familiarity with the concept of biophilia, which suggests an innate human connection to nature. While not a common word in everyday conversation, it's increasingly relevant in discussions about sustainable design and human health.","priority":"★★☆"},"example_sentences":[{"sentence":"The office space was designed with **biophilic** principles, incorporating natural light and plants.","translation":"そのオフィス空間は、自然光と植物を取り入れたバイオフィリックな原則に基づいて設計されました。","type":"adjective","meaning_category":"自然を愛する"},{"sentence":"She is a **biophilic** who finds solace and inspiration in the natural world.","translation":"彼女は自然界に慰めとインスピレーションを見出すバイオフィリアです。","type":"noun","meaning_category":"自然を愛する人"},{"sentence":"**Biophilic** architecture aims to create buildings that connect people with the environment.","translation":"バイオフィリック建築は、人々を環境と結びつける建物を創造することを目指しています。","type":"adjective","meaning_category":"自然を愛する"}]}