{"word":"Cyclophoric","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(言語学で)先行詞を伴わない、または文脈からのみ意味が明らかになる照応表現の","english_definition":"(in linguistics) Referring to an expression whose reference is not explicitly stated but is recoverable from the context or general knowledge.","examples":[{"sentence":"The pronoun 'it' in the sentence 'It is raining' is cyclophoric because 'it' does not refer to any specific noun.","translation":"「雨が降っている」という文の代名詞「it」は、特定の名称を参照しないため、周期的照応表現です。"},{"sentence":"Understanding cyclophoric references requires pragmatic inference.","translation":"周期的照応表現を理解するには、語用論的な推論が必要です。"}],"collocations":["cyclophoric pronoun","cyclophoric reference","cyclophoric use"],"synonyms":["exophoric","context-dependent","situation-dependent"],"antonyms":["endophoric","anaphoric","cataphoric"]}],"etymology":{"value":"The term 'cyclophoric' is derived from the concept of 'cyclophoria' in ophthalmology, referring to the rotation of the eyes around the visual axis. In linguistics, it was adapted to describe references that 'rotate' back to the context for meaning.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsaɪkləˈfɔːrɪk/","syllables":"cy-clo-pho-ric"},"inflection":{"notes":"Adjectives do not typically inflect in English, besides comparative and superlative forms.","adjective_forms":{"comparative":"more cyclophoric","superlative":"most cyclophoric"}},"usage_notes":{"explanation":"'Cyclophoric' references are distinct from anaphoric (referring back to a previously mentioned noun) and cataphoric (referring forward to a noun that will be mentioned later) references. Cyclophoricity relies on the listener or reader's ability to infer the meaning from the situation or shared knowledge, rather than from explicit linguistic cues within the text.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The word 'the' is cyclophoric.","correct":"✓ The word 'the' is definite article.","note":"'The' is a definite article, not a cyclophoric reference. Cyclophoric references are typically pronouns or other expressions that require contextual understanding."}],"priority":"★★☆"},"related_words":{"derivatives":["cyclophoria"],"related_terms":["anaphora","cataphora","exophora","endophora","reference","pragmatics","linguistics"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in specialized linguistic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Cyclophoric' is a technical term in linguistics used to describe a type of reference where the meaning is derived from the context or general knowledge rather than from explicit linguistic elements within the text. It is a concept that requires a high level of linguistic understanding to grasp fully. The term is not commonly used outside of academic discussions in linguistics and related fields."},"example_sentences":[{"sentence":"The use of 'they' in the sentence 'They say it will rain tomorrow' is cyclophoric, as 'they' refers to an unspecified group of people.","translation":"「明日は雨が降るそうだ」という文での「they」の使用は、特定されていない人々のグループを指すため、周期的照応表現です。","type":"example","meaning_category":"linguistics"},{"sentence":"Cyclophoric references are common in everyday conversation, where much is left unsaid but understood.","translation":"周期的照応表現は、多くが言われずに理解される日常会話で一般的です。","type":"example","meaning_category":"linguistics"}]}