{"word":"heterologously","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"異種に、異種で","english_definition":"In a heterologous manner; in a way that involves different or unrelated elements.","examples":[{"sentence":"The protein was expressed heterologously in E. coli.","translation":"そのタンパク質は大腸菌で異種発現された。"},{"sentence":"The gene was introduced heterologously into the plant cells.","translation":"その遺伝子は植物細胞に異種導入された。"}],"collocations":["expressed heterologously","introduced heterologously"],"synonyms":["exogenously","allotopically"],"antonyms":["autologously","homologously"]}],"etymology":{"value":"Derived from 'heterologous' (from Greek 'heteros' meaning 'other' and 'logos' meaning 'relation') + '-ly'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɛtərəˈlɒɡəsli/","syllables":"het-er-o-log-ous-ly"},"inflection":{"notes":"Adverbs do not typically inflect."},"usage_notes":{"explanation":"'Heterologously' is primarily used in scientific contexts, particularly in molecular biology and genetics. It describes processes where a gene, protein, or other biological element is expressed or introduced into a different or unrelated system than its original source. The term emphasizes the foreign or non-native nature of the element within the new system.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cells were grown heterologously.","correct":"✓ The gene was expressed heterologously in the cells.","note":"'Heterologously' should modify a verb that describes the action of expressing or introducing something into a different system, not the action of growing cells."}],"priority":"★☆☆"},"related_words":{"derivatives":["heterologous","heterology"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'heterologously' is a highly specialized term primarily used in advanced scientific writing, particularly in the fields of molecular biology and genetics. Understanding requires familiarity with concepts such as gene expression, protein production, and genetic engineering. The term describes processes where biological elements are introduced or expressed in systems different from their native origin. Due to its niche usage, it is not commonly encountered outside of specialized scientific literature."},"example_sentences":[{"sentence":"The enzyme was produced heterologously in yeast to increase yield.","translation":"その酵素は収量を増やすために酵母で異種産生された。","type":"general","meaning_category":"異種に"},{"sentence":"The signaling pathway was activated heterologously using a synthetic ligand.","translation":"そのシグナル伝達経路は合成リガンドを用いて異種的に活性化された。","type":"general","meaning_category":"異種に"}]}