{"word":"uncrop","priority":"N/A","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(画像を)トリミング解除する、トリミング前の状態に戻す","english_definition":"To restore an image to its original, untrimmed state; to remove the cropped portions of an image.","examples":[{"sentence":"I accidentally cropped the photo, but thankfully I could uncrop it using the editing software.","translation":"誤って写真をトリミングしてしまいましたが、ありがたいことに編集ソフトでトリミング解除できました。"},{"sentence":"The app allows you to easily uncrop images if you change your mind about the composition.","translation":"そのアプリでは、構図について気が変わった場合に、画像を簡単にトリミング解除できます。"}],"collocations":["uncrop an image","uncrop a photo","uncrop a picture"],"synonyms":["restore","revert","expand","untrim"],"antonyms":["crop","trim"],"related_words":["cropping","crop","cropped","untrimmed"]}],"etymology":{"value":"The word \"uncrop\" is formed by adding the prefix \"un-\" (meaning \"not\" or \"reverse action\") to the word \"crop.\" The word \"crop\" in this context refers to the act of trimming or cutting away unwanted parts of an image. Therefore, \"uncrop\" literally means to undo the cropping process.","priority":"N/A"},"pronunciation":{"ipa":"/ʌnˈkrɒp/","syllables":"un-crop"},"inflection":{"verb_forms":{"present_simple":["uncrop","uncrops"],"past_simple":"uncropped","past_participle":"uncropped","present_participle":"uncropping"}},"usage_notes":{"explanation":"\"Uncrop\" is a relatively new term, primarily used in the context of digital image editing. It refers to the process of restoring an image to its original, uncropped state. This is often done using image editing software or apps that store the original, uncropped version of the image even after it has been cropped. The term is not widely used in formal contexts but is common in discussions about photography and image editing.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ I uncropped the field.","correct":"✓ I harvested the field.","note":"\"Uncrop\" is specifically used for images. For fields or other agricultural contexts, use \"harvest\" or other relevant terms."}],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - relatively new and specialized term.","priority":"N/A"},"readability_explanation":{"level":"B2","text":"The word \"uncrop\" is a verb that means to undo the cropping of an image. Cropping is when you cut off the edges of a picture to make it look better or to focus on a specific part. To \"uncrop\" means to bring back the parts of the picture that were cut off. This word is mostly used when talking about editing photos on a computer or phone. It's not a very common word, but it's easy to understand if you know what \"crop\" means."},"example_sentences":[{"sentence":"Luckily, the photo editor allowed me to **uncrop** the image and recover the lost details.","translation":"幸いなことに、そのフォトエディタでは画像をトリミング解除して、失われたディテールを回復できました。","type":"verb","meaning_category":"トリミング解除する"},{"sentence":"Before sharing the photo, make sure to **uncrop** it to show the full scene.","translation":"写真を共有する前に、シーン全体を表示するためにトリミング解除してください。","type":"verb","meaning_category":"トリミング解除する"}]}