{"word":"brass-renting","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(slang, derogatory) The practice of a prostitute or sex worker offering their services for a short period of time, typically in a cheap or run-down establishment.","english_definition":"(slang, derogatory) The practice of a prostitute or sex worker offering their services for a short period of time, typically in a cheap or run-down establishment.","examples":[{"sentence":"The police raided several establishments known for brass-renting.","translation":"警察は、ブラス・レンティングで知られるいくつかの施設を摘発した。"},{"sentence":"Brass-renting is often associated with exploitation and unsafe conditions.","translation":"ブラス・レンティングは、しばしば搾取や危険な状況と関連付けられる。"}],"collocations":["establishments known for brass-renting","the dangers of brass-renting"],"synonyms":["prostitution","sex work","hooking"],"antonyms":[]}],"etymology":{"value":"The term likely derives from the slang use of \"brass\" to refer to money or payment, and \"renting\" to indicate the temporary nature of the service provided.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbræsˌrɛntɪŋ/","syllables":"brass-rent-ing"},"inflection":{"noun_plural":"N/A (uncountable noun)"},"usage_notes":{"explanation":"\"Brass-renting\" is a derogatory slang term used to describe a specific type of prostitution or sex work. It implies a short-term, often exploitative, transaction. The term is not widely used and may be considered offensive.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["brass (slang for money)","renting (temporary use for payment)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (slang, not typically found in standard language learning materials)","frequency_google_ngram":"Low frequency (slang, not widely used)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"brass-renting\" is a derogatory slang term and is not part of standard English vocabulary. Understanding it requires familiarity with slang and potentially offensive language related to prostitution and sex work. Due to its nature and limited usage, it is not recommended for general language learning.","warning":"This term is derogatory and potentially offensive. Use with caution."},"example_sentences":[{"sentence":"The documentary exposed the harsh realities of brass-renting in the city's red-light district.","translation":"そのドキュメンタリーは、市内の歓楽街におけるブラス・レンティングの厳しい現実を暴露した。","type":"noun","meaning_category":"prostitution"},{"sentence":"Many organizations are working to combat the exploitation associated with brass-renting.","translation":"多くの組織が、ブラス・レンティングに関連する搾取と闘うために活動している。","type":"noun","meaning_category":"prostitution"}]}