{"word":"micraesthete","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A petty or small-minded aesthete.","english_definition":"A person of minor or petty aesthetic sensibilities; a would-be aesthete who is overly concerned with trivial details of art or beauty.","examples":[{"sentence":"The critic was dismissed as a micraesthete, more concerned with the font used in the program than the play itself.","translation":"その批評家は、演劇そのものよりもプログラムに使われているフォントに関心がある、ささいなことを気にする審美家として切り捨てられた。"},{"sentence":"He was surrounded by micraesthetes who debated the merits of different shades of beige for hours.","translation":"彼は、ベージュのさまざまな色合いの長所を何時間も議論する、ささいなことを気にする審美家たちに囲まれていた。"}],"collocations":["petty aesthete","small-minded aesthete","trivial aesthete"],"synonyms":["pedant","nitpicker","formalist"],"antonyms":["aesthete","connoisseur"]}],"etymology":{"value":"Formed from 'micro-' (small) + 'aesthete'. The term suggests someone who focuses on the minutiae of aesthetics rather than broader artistic or philosophical concepts.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmaɪkræsˈθiːt/","syllables":"mi-cras-thete"},"inflection":{"noun_plural":"micraesthetes"},"usage_notes":{"explanation":"The term 'micraesthete' is often used pejoratively to describe someone whose aesthetic judgments are seen as overly fastidious, narrow, or focused on trivial details. It implies a lack of appreciation for the larger artistic or philosophical context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He considered himself a great micraesthete of art.","correct":"✓ He was considered a micraesthete by many due to his focus on minor details.","note":"The term is usually used by others to criticize someone's aesthetic sensibilities rather than a self-description."}],"priority":"★☆☆"},"related_words":{"derivatives":["micraesthesia (n.) - abnormally small sensitivity to touch"],"related_terms":["aesthete","aesthetics","micro-"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Micraesthete' is a relatively rare and sophisticated term used to describe someone who is overly concerned with minor or trivial details of art and aesthetics, often to the point of missing the larger picture or philosophical context. It is often used in a critical or dismissive way to suggest that someone's aesthetic judgments are overly fastidious or narrow-minded."},"example_sentences":[{"sentence":"The art critic was labeled a **micraesthete** for his relentless focus on the technical aspects of the painting rather than its emotional impact.","translation":"その美術評論家は、絵画の感情的な影響よりも技術的な側面に執拗に焦点を当てているため、「ミクラエステート」というレッテルを貼られた。","type":"noun","meaning_category":"petty aesthete"},{"sentence":"Her obsession with the precise shade of the wallpaper made her seem like a **micraesthete**.","translation":"彼女の壁紙の正確な色合いへのこだわりは、彼女を「ミクラエステート」のように見させた。","type":"noun","meaning_category":"petty aesthete"}]}