{"word":"renouncer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"放棄者、放棄する人、断念する人、放棄宣言者、出家者、隠遁者","english_definition":"A person who renounces something; one who formally rejects or disowns a belief, cause, or allegiance; a person who gives up worldly possessions and leads an ascetic life.","examples":[{"sentence":"He became a renouncer of worldly pleasures, seeking enlightenment through meditation.","translation":"彼は瞑想を通して悟りを求め、世俗的な喜びを放棄する者となった。"},{"sentence":"As a renouncer, she dedicated her life to helping others.","translation":"放棄者として、彼女は人生を他者を助けることに捧げた。"},{"sentence":"The renouncer took a vow of poverty and chastity.","translation":"その出家者は貧困と貞潔の誓いを立てた。"}],"collocations":["a renouncer of worldly possessions (世俗的な財産を放棄する人)","a renouncer of violence (暴力を放棄する人)","become a renouncer (放棄者になる)","religious renouncer (宗教的な放棄者)"],"synonyms":["ascetic","hermit","recluse","abstainer","deserter","apostate","defector"],"antonyms":["adherent","supporter","believer","follower","loyalist"]}],"etymology":{"value":"The word 'renouncer' is derived from the verb 'renounce,' which comes from the Old French 'renoncier' (to renounce, abandon), and ultimately from the Latin 'renuntiare' (to announce against, disclaim, reject). 'Re-' means 'back' or 'again,' and 'nuntiare' means 'to announce.' The suffix '-er' is added to denote a person who performs the action.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈnaʊnsər/","syllables":"re-noun-cer"},"inflection":{"noun_plural":"renouncers"},"usage_notes":{"explanation":"The term 'renouncer' often carries a connotation of someone who has made a significant and deliberate decision to abandon a former way of life, belief system, or set of values. It can be used in both religious and secular contexts. In religious contexts, it often refers to individuals who have chosen a life of asceticism and detachment from worldly possessions. In secular contexts, it can refer to someone who has publicly disavowed a political cause or personal relationship.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a renouncer for his family.","correct":"✓ He is a renouncer of his family.","note":"The correct preposition to use with 'renouncer' when indicating what is being renounced is 'of.'"},{"incorrect":"✗ She is a renouncer person.","correct":"✓ She is a renouncer.","note":"'Renouncer' is a noun referring to a person, so it doesn't need the additional word 'person' after it."}],"priority":"★★★"},"related_words":{"derivatives":["renounce (verb: 放棄する、捨てる、否認する)","renouncement (noun: 放棄、放棄宣言)","renunciation (noun: 放棄、放棄宣言)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'renouncer' is a relatively uncommon word, typically used in formal or literary contexts. It refers to someone who has made a deliberate decision to give up or reject something significant, such as a belief, a way of life, or worldly possessions. Understanding the word requires a grasp of the concept of renunciation, which involves a conscious act of relinquishing something valued. It is often associated with religious or philosophical contexts where individuals choose a life of asceticism or detachment.","priority":"★★☆"},"example_sentences":[{"sentence":"The old sage was a renouncer of material wealth, finding happiness in simplicity.","translation":"その老賢者は物質的な富を放棄する者であり、質素な生活に幸せを見出していた。","type":"noun","meaning_category":"放棄者・隠遁者"},{"sentence":"He became a renouncer after experiencing a profound spiritual awakening.","translation":"彼は深遠な霊的な目覚めを経験した後、放棄者となった。","type":"noun","meaning_category":"放棄者・出家者"},{"sentence":"As a renouncer of violence, she dedicated her life to promoting peace.","translation":"暴力を放棄する者として、彼女は人生を平和を促進することに捧げた。","type":"noun","meaning_category":"放棄者・断念する人"},{"sentence":"The renouncer lived a solitary life in the mountains, detached from society.","translation":"その隠遁者は社会から離れ、山の中で孤独な生活を送っていた。","type":"noun","meaning_category":"放棄者・隠遁者"}]}