{"word":"Readjourning","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(会議などを)再開すること (readjourn の現在分詞形)","english_definition":"The act of reconvening (a meeting, etc.) after a break or postponement. (present participle of readjourn)","examples":[{"sentence":"The committee is readjourning after a short recess.","translation":"委員会は短い休憩の後、再開します。"}],"collocations":["readjourning the meeting","readjourning after a break"],"synonyms":["reconvening","resuming","restarting"],"antonyms":["adjourning","suspending"]}],"etymology":{"value":"\"Readjourning\" is derived from \"readjourn,\" which combines the prefix \"re-\" (meaning again) with \"adjourn\" (to suspend or postpone a meeting).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːəˈdʒɜːrnɪŋ/","syllables":"re-a-djour-ning"},"inflection":{"verb_forms":{"present_participle":"readjourning"}},"usage_notes":{"explanation":"\"Readjourning\" is the present participle of the verb \"readjourn,\" indicating an ongoing action of reconvening a meeting or session that had been previously adjourned. It is typically used in formal or official contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The meeting is readjourn.","correct":"✓ The meeting is readjourning.","note":"Use the present participle form \"readjourning\" to indicate an action in progress."},{"incorrect":"✗ They are readjourning the meeting at 2 pm tomorrow.","correct":"✓ They will readjourn the meeting at 2 pm tomorrow. / ✓ They are readjourning the meeting at 2 pm.","note":"While \"readjourning\" can be used to describe a scheduled event, \"will readjourn\" is more common for future actions. The present continuous can be used if the action is already in progress or very soon to happen."}],"priority":"★★☆"},"related_words":{"derivatives":["readjourn (verb)","adjourn (verb)","adjournment (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Readjourning\" is a relatively uncommon word, primarily used in formal settings to describe the act of resuming a meeting or session after it has been temporarily suspended. It is the present participle of \"readjourn,\" and its usage implies an ongoing or imminent action. Understanding the base word \"adjourn\" is essential for comprehending \"readjourning.\""},"example_sentences":[{"sentence":"The conference is readjourning in the main hall after the lunch break.","translation":"会議は昼食休憩後、メインホールで再開します。","type":"verb","meaning_category":"再開する"},{"sentence":"The senate is readjourning to discuss the proposed legislation.","translation":"上院は提案された法案について議論するために再開します。","type":"verb","meaning_category":"再開する"}]}