{"word":"heterochthonous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"異地性の、外来性の（地質学で、その場所で形成されなかった岩石や堆積物について）","english_definition":"(geology) originating or formed elsewhere; transported from its original location.","examples":[{"sentence":"The heterochthonous rocks were transported by glaciers from hundreds of miles away.","translation":"その異地性の岩石は、数百マイル離れた場所から氷河によって運ばれてきた。"},{"sentence":"The presence of heterochthonous material indicates significant tectonic activity in the region.","translation":"異地性の物質の存在は、その地域における重要な地殻変動を示している。"}],"collocations":["heterochthonous rocks","heterochthonous sediments","heterochthonous terrane","heterochthonous material"],"synonyms":["allochthonous","exotic"],"antonyms":["autochthonous","indigenous","native"]}],"etymology":{"value":"ギリシャ語の「heteros」（異なる）+ 「chthōn」（土地、地球）から構成される。文字通りには「異なる土地から来た」という意味。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɛtərəˈkθɒnəs/","syllables":"het-er-o-chtho-nous"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"「**heterochthonous**」は、主に地質学で使用される専門用語で、ある場所で形成されたのではなく、他の場所から運ばれてきた岩石、堆積物、または地層を指します。この用語は、その物質の起源がその場所の地質学的文脈とは異なることを強調します。対義語は「autochthonous」（自生性の、その場所で形成された）です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The heterochthonous species of fish was introduced to the lake.","correct":"✓ The non-native species of fish was introduced to the lake.","note":"「heterochthonous」は主に地質学的な文脈で使用されます。生物学的な文脈で外来種を指す場合は、「non-native」、「introduced」、「exotic」などの用語を使用する方が適切です。"},{"incorrect":"✗ The soil is heterochthonous to the garden.","correct":"✓ The soil was brought in from elsewhere for the garden.","note":"土壌が他の場所から運ばれてきたことを示す場合は、「The soil was brought in from elsewhere」のように表現する方が一般的です。"}],"priority":"★☆☆"},"related_words":{"derivatives":["heterochthony (名詞: 異地性)"],"related_terms":["autochthonous (自生性の)","allochthon (異地性地層)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"低頻度 (Low frequency) - 専門分野でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**heterochthonous**」は、地質学で使われる専門的な言葉で、ある場所にある岩石や土などが、もともとその場所でできたものではなく、別の場所から運ばれてきたことを意味します。例えば、氷河によって遠くから運ばれてきた岩石を指す場合に使われます。この言葉は、その場所の地質を理解する上で、その物質の起源が重要であることを示しています。専門的な文脈以外では、一般的に使われることはありません。"},"example_sentences":[{"sentence":"The geologist identified the sandstone as heterochthonous, indicating it originated far from the current location.","translation":"地質学者はその砂岩を異地性であると特定し、現在の場所から遠く離れた場所で形成されたことを示した。","type":"adjective","meaning_category":"地質学"},{"sentence":"The presence of heterochthonous sediments suggests a history of significant sediment transport in the area.","translation":"異地性の堆積物の存在は、その地域における重要な堆積物輸送の歴史を示唆している。","type":"adjective","meaning_category":"地質学"},{"sentence":"Mapping the distribution of heterochthonous rocks helps reconstruct past tectonic events.","translation":"異地性岩石の分布を地図化することは、過去の地殻変動の再構築に役立つ。","type":"adjective","meaning_category":"地質学"}]}