{"word":"Oometry","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"卵の計測学、卵の大きさや形状の測定・研究","english_definition":"The science or study of the measurement of eggs, especially their size and shape.","examples":[{"sentence":"Oometry is used in zoology to classify and compare different species of birds based on their egg characteristics.","translation":"卵の計測学は、卵の特徴に基づいてさまざまな種類の鳥を分類し比較するために動物学で使用されます。"},{"sentence":"The oometry of fossilized eggs can provide insights into the reproductive strategies of extinct animals.","translation":"化石化した卵の卵計測学は、絶滅した動物の繁殖戦略に関する洞察を提供できます。"}],"collocations":["egg oometry","avian oometry","fossil oometry"],"synonyms":["egg measurement","egg morphometrics"],"antonyms":[]}],"etymology":{"value":"「oo-」(卵を意味する接頭辞) + 「-metry」(測定学を意味する接尾辞)","priority":"★★☆"},"pronunciation":{"ipa":"/oʊˈɒmɪtri/","syllables":"o-om-e-try"},"inflection":{"noun_plural":"oometries"},"usage_notes":{"explanation":"Oometry is a specialized term primarily used in zoology, paleontology, and related fields. It involves the precise measurement and analysis of egg characteristics, such as size, shape, volume, and shell thickness. This data can be used for taxonomic classification, evolutionary studies, and understanding reproductive biology.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The scientist performed oometry on the birds.","correct":"✓ The scientist performed oometric analysis on the birds.","note":"Oometry is the study or measurement itself. To describe the action of measuring, use 'oometric analysis' or 'oometric measurements'."}],"priority":"★☆☆"},"related_words":{"derivatives":["oometric (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Oometry is a technical term referring to the scientific measurement and study of eggs. It's primarily used in specialized fields like zoology and paleontology to analyze egg characteristics for classification, evolutionary studies, and understanding reproductive strategies. Due to its niche usage, it's not commonly encountered in general language.","priority":"★☆☆"},"example_sentences":[{"sentence":"The researchers used oometry to differentiate between the eggs of various species of reptiles.","translation":"研究者たちは、さまざまな種類の爬虫類の卵を区別するために卵の計測学を使用しました。","type":"noun","meaning_category":"卵の計測学"},{"sentence":"Oometry provides valuable data for understanding the reproductive biology of extinct dinosaurs.","translation":"卵の計測学は、絶滅した恐竜の繁殖生物学を理解するための貴重なデータを提供します。","type":"noun","meaning_category":"卵の計測学"}]}