{"word":"unlinked","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"リンクされていない、接続されていない","english_definition":"not connected to something else; not joined by a link.","examples":[{"sentence":"The two files were unlinked, so I couldn't access the information.","translation":"その2つのファイルはリンクされていなかったので、情報にアクセスできませんでした。"},{"sentence":"An unlinked account is not associated with any other account.","translation":"リンクされていないアカウントは、他のアカウントとは関連付けられていません。"},{"sentence":"The unlinked data made it difficult to draw conclusions.","translation":"リンクされていないデータは、結論を導き出すのを困難にしました。"}],"collocations":["unlinked account","unlinked data","unlinked files","remain unlinked"],"synonyms":["disconnected","detached","separated","unconnected","isolated"],"antonyms":["linked","connected","attached","joined"]},{"part_of_speech":"verb","definition":"(過去形・過去分詞) リンクを解除した、接続を解除した","english_definition":"(past tense and past participle of unlink) to disconnect or separate something that was previously linked.","examples":[{"sentence":"I unlinked my social media accounts from the website.","translation":"ウェブサイトからソーシャルメディアのアカウントのリンクを解除しました。"},{"sentence":"The administrator unlinked the user's profile due to inactivity.","translation":"管理者は非アクティブのため、ユーザーのプロフィールへのリンクを解除しました。"},{"sentence":"Once the files were unlinked, they could be moved independently.","translation":"ファイルへのリンクが解除されると、個別に移動できるようになりました。"}],"collocations":["unlink accounts","unlink profiles","unlink files","unlink data"],"synonyms":["disconnect","detach","separate","unconnect","isolate"],"antonyms":["link","connect","attach","join"]}],"etymology":{"value":"\"Un-\" (not) + \"linked\" (connected).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈlɪŋkt/","syllables":"un-linked"},"inflection":{"adjective_forms":{},"verb_forms":{"present_simple":["unlink","unlinks"],"past_simple":"unlinked","past_participle":"unlinked","present_participle":"unlinking"}},"usage_notes":{"explanation":"\"Unlinked\" typically describes something that was previously connected or associated but is no longer. It is frequently used in technical contexts, such as computer science and online platforms, to indicate a disconnection between files, accounts, or data. It can also describe a more general separation or lack of association. When used as a verb, it describes the action of disconnecting.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unlinked files are connected.","correct":"✓ The unlinked files are not connected.","note":"\"Unlinked\" means \"not connected,\" so avoid using it in a sentence that implies connection."},{"incorrect":"✗ I unlinked the account, but it's still linking.","correct":"✓ I unlinked the account, but it's still connected.","note":"\"Linking\" is the opposite of \"unlinking,\" so use \"connected\" to describe something still joined."}],"priority":"★★☆"},"related_words":{"derivatives":["unlink (verb)","linking (noun, adjective)","link (noun, verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"unlinked\" means not connected or associated. It's often used in technical contexts to describe files, accounts, or data that are no longer connected. It can also be used more generally to describe a lack of connection or association. The prefix \"un-\" indicates negation, so \"unlinked\" is the opposite of \"linked.\" Understanding the context is important to correctly interpret its meaning."},"example_sentences":[{"sentence":"The unlinked document could not be opened.","translation":"リンクされていないドキュメントを開くことができませんでした。","type":"adjective","meaning_category":"not connected"},{"sentence":"She unlinked her phone from the car's Bluetooth.","translation":"彼女は車のBluetoothから携帯電話のリンクを解除しました。","type":"verb (past tense)","meaning_category":"disconnected"},{"sentence":"The unlinked nodes in the network were causing problems.","translation":"ネットワーク内のリンクされていないノードが問題を引き起こしていました。","type":"adjective","meaning_category":"not connected"}]}