{"word":"chulice","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(slang, derogatory) A foolish, naive, or easily deceived person; a dupe.","english_definition":"(slang, derogatory) A person who is easily tricked or deceived; a gullible or foolish individual.","examples":[{"sentence":"Don't be such a chulice; you'll believe anything.","translation":"そんなに騙されやすい人になるな。何でも信じてしまうぞ。"},{"sentence":"He's a real chulice if he thinks that scheme will work.","translation":"もし彼があの計画がうまくいくと思っているなら、彼は本当に愚か者だ。"}],"collocations":["act like a chulice","treat someone like a chulice","call someone a chulice"],"synonyms":["dupe","fool","gull","sucker","pigeon","mark","simpleton","naif"],"antonyms":["schemer","trickster","con artist","wise person"]}],"etymology":{"value":"Likely a blend or alteration of 'chump' and 'dupe,' both terms with similar meanings. The exact origin is uncertain, but it appears to have emerged in informal speech.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈtʃuːlɪs/","syllables":"chu-lice"},"inflection":{"noun_plural":"chulices"},"usage_notes":{"explanation":"'Chulice' is a strongly derogatory slang term used to describe someone considered foolish, naive, or easily tricked. It's more informal and less common than synonyms like 'fool' or 'dupe.' Its use is generally discouraged in formal settings or when addressing someone directly, as it is highly offensive.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a chulice person.","correct":"He is a chulice.","note":"'Chulice' is already a noun referring to a person, so adding 'person' is redundant."},{"incorrect":"She chuliced him out of his money.","correct":"She duped him out of his money.","note":"'Chulice' is primarily a noun. To express the act of deceiving, use verbs like 'dupe,' 'trick,' or 'con'."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["chump","dupe","fool","sucker","gullible"]},"level_frequency":{"CEFR":"N/A (Slang, very low frequency)","frequency_google_ngram":"Very low frequency; primarily found in informal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Chulice' is a slang term, and its usage is highly context-dependent. It is used to describe someone who is easily tricked or deceived. Due to its derogatory nature and infrequent use, it is not suitable for formal communication or general conversation. Understanding its meaning is more important for recognizing it in informal contexts than for active use."},"example_sentences":[{"sentence":"That guy is such a chulice; he fell for the same scam twice.","translation":"あいつは本当に騙されやすいやつだ。同じ詐欺に二度も引っかかった。","type":"noun","meaning_category":"foolish person"},{"sentence":"Only a real chulice would believe those ridiculous claims.","translation":"あんな馬鹿げた主張を信じるのは、本当に愚かな人だけだろう。","type":"noun","meaning_category":"easily deceived person"}]}