{"word":"pest-hardy","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"害虫に強い、耐虫性のある","english_definition":"Resistant to pests; able to withstand pest infestation.","examples":[{"sentence":"This variety of apple tree is pest-hardy and requires less pesticide.","translation":"この品種のリンゴの木は害虫に強く、農薬の使用量が少なくて済みます。"},{"sentence":"We need to develop more pest-hardy crops to reduce our reliance on chemical controls.","translation":"化学的な防除への依存を減らすために、より害虫に強い作物を開発する必要があります。"}],"collocations":["pest-hardy plants","pest-hardy crops","pest-hardy variety","develop pest-hardy"],"synonyms":["pest-resistant","insect-resistant","disease-resistant (related, but refers to diseases)"],"antonyms":["pest-susceptible","pest-vulnerable"],"notes":"Often used in the context of agriculture, gardening, and plant breeding."}],"etymology":{"value":"Combination of 'pest' (an annoying or destructive insect or other animal that attacks crops, food, or livestock) and 'hardy' (robust; capable of enduring difficult conditions).","priority":"★★★"},"pronunciation":{"ipa":"/ˈpɛstˌhɑːrdi/","syllables":"pest-har-dy"},"inflection":{"notes":"Adjective, comparative and superlative forms are 'more pest-hardy' and 'most pest-hardy'."},"usage_notes":{"explanation":"'Pest-hardy' describes the ability of a plant or other organism to withstand attack or infestation by pests. It implies a natural resistance or a characteristic that makes the organism less attractive or vulnerable to pests.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant is pest hardy.","correct":"✓ The plant is pest-hardy.","note":"Hyphenation is important to correctly convey the meaning of a compound adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["hardy","resistance","pest"],"related_terms":["disease-hardy","drought-hardy","cold-hardy"]},"level_frequency":{"frequency_google_ngram":"Low frequency. Specialized term, primarily used in agricultural and horticultural contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'pest-hardy' is a compound adjective used to describe organisms, typically plants, that possess a natural or cultivated resistance to pests. Understanding this term requires familiarity with both 'pest' (harmful insects or animals) and 'hardy' (able to withstand difficult conditions). The term is most commonly encountered in discussions related to agriculture, gardening, and sustainable farming practices."},"example_sentences":[{"sentence":"Scientists are working to create pest-hardy strains of wheat.","translation":"科学者たちは、害虫に強い小麦の系統を作り出すために研究しています。","type":"general","meaning_category":"general"},{"sentence":"Using pest-hardy seeds can significantly reduce the need for pesticides.","translation":"害虫に強い種子を使用することで、殺虫剤の必要性を大幅に削減できます。","type":"agriculture","meaning_category":"agriculture"},{"sentence":"This rose variety is known for being pest-hardy and easy to care for.","translation":"このバラの品種は、害虫に強く、手入れが簡単であることで知られています。","type":"gardening","meaning_category":"gardening"}]}