{"word":"Carpetbaggism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史) 南北戦争後の南部で、個人的な利益のために北部からやってきた投機家や政治家による搾取的な行為","english_definition":"The exploitative actions of opportunists or political adventurers who came to the Southern states after the American Civil War from the North for personal gain.","examples":[{"sentence":"Carpetbaggism was rampant in the South during Reconstruction.","translation":"レコンストラクション時代、南部ではカーペットバッギズムが横行していた。"},{"sentence":"The term 'carpetbagger' was used to denigrate Northerners who sought political power in the South.","translation":"「カーペットバッガー」という言葉は、南部で政治権力を求める北部の人々を中傷するために使われた。"}],"collocations":["rampant carpetbaggism","carpetbagger politician","era of carpetbaggism"],"synonyms":["opportunism","exploitation","profiteering"],"antonyms":["altruism","philanthropy"]}],"etymology":{"value":"「Carpetbagger」という言葉に由来し、これは南北戦争後、わずかな所持品をカーペット製の旅行鞄（carpetbag）に入れて南部へやってきた北部の人々を指す軽蔑的な言葉だった。彼らはしばしば政治的または経済的な利益を追求したと見なされた。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɑːrpɪtbæɡɪzəm/","syllables":"car-pet-bag-gism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"「**Carpetbaggism**」は、アメリカの歴史における特定の時期、すなわち南北戦争後のレコンストラクション時代に関連する言葉です。この言葉は、個人的な利益のために南部を搾取したと見なされた北部の人々の行動を指します。現代では、この言葉は、ある地域に一時的に移住して、地元の資源や政治を利用する人々を批判的に指すために、比喩的に使われることがあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Carpetbaggism is a good thing for the economy.","correct":"✓ Carpetbaggism is often seen as detrimental to the local economy.","note":"Carpetbaggismは一般的に、搾取的な行為と見なされるため、経済にとって良いこととは見なされません。"},{"incorrect":"✗ Carpetbaggism is a modern political movement.","correct":"✓ Carpetbaggism is a historical phenomenon associated with the Reconstruction era.","note":"Carpetbaggismは、南北戦争後のレコンストラクション時代に特有の現象であり、現代の政治運動ではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":["carpetbagger (名詞: カーペットバッガー)"],"idioms_phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 歴史的な文脈でのみ使用されることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Carpetbaggism**」は、南北戦争後のアメリカ南部におけるレコンストラクション時代に、北部から来た投機家や政治家が個人的な利益のために行った搾取的な行為を指す歴史的な言葉です。これらの人々は、しばしば「カーペットバッガー」と呼ばれ、わずかな所持品をカーペット製の旅行鞄に入れて南部へやってきたことから、軽蔑的な意味合いで使用されました。現代では、この言葉は、ある地域に一時的に移住して、地元の資源や政治を利用する人々を批判的に指す比喩として使われることがあります。歴史的な文脈を理解することが重要です。"},"example_sentences":[{"sentence":"The legacy of carpetbaggism continues to be debated by historians.","translation":"カーペットバッギズムの遺産は、歴史家によって議論され続けている。","type":"noun","meaning_category":"搾取的な行為"},{"sentence":"Many Southerners resented the carpetbaggism that followed the Civil War.","translation":"多くの南部の人々は、南北戦争後のカーペットバッギズムを恨んでいた。","type":"noun","meaning_category":"搾取的な行為"}]}