{"word":"Trigonocephaly","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"三角頭蓋（さんかくとうがい）","english_definition":"A congenital condition characterized by a triangular-shaped forehead due to premature fusion of the metopic suture.","examples":[{"sentence":"Trigonocephaly is often diagnosed in infancy.","translation":"三角頭蓋はしばしば乳児期に診断される。"},{"sentence":"Surgery may be required to correct trigonocephaly.","translation":"三角頭蓋を矯正するには手術が必要となる場合がある。"}],"collocations":["metopic synostosis","cranial deformity","surgical correction"],"synonyms":["metopic synostosis"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'trigonon' (triangle) + 'cephale' (head) + '-y' (state, condition).","priority":"★★★"},"pronunciation":{"ipa":"/traɪˌɡɒnəˈsɛfəli/","syllables":"tri-gon-o-ceph-a-ly"},"inflection":{"noun_plural":"trigonocephalies"},"usage_notes":{"explanation":"Trigonocephaly is a specific type of craniosynostosis, involving the premature fusion of the metopic suture, which runs from the nose to the bregma (the soft spot on a baby's head). This fusion restricts normal skull growth and results in a keel-shaped or triangular forehead. Diagnosis typically involves physical examination and imaging studies such as CT scans. Treatment often includes surgery to release the fused suture and reshape the skull.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The baby has trigonocephaly, so he is very intelligent.","correct":"✓ The baby has trigonocephaly, which may require surgical intervention.","note":"Trigonocephaly is a medical condition and is not related to intelligence. The focus should be on the medical aspects and potential treatments."},{"incorrect":"✗ Trigonocephaly is a type of mental illness.","correct":"✓ Trigonocephaly is a type of cranial deformity.","note":"Trigonocephaly is a physical condition affecting the skull, not a mental illness."}],"priority":"★★☆"},"related_words":{"derivatives":["trigonocephalic (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized medical term)","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"Trigonocephaly is a highly specialized medical term referring to a specific congenital condition involving premature fusion of the metopic suture. Understanding this term requires a strong background in medical terminology and anatomy. The term is primarily used in medical contexts by healthcare professionals. Due to its specificity and limited use outside of medicine, it is considered a high-level term."},"example_sentences":[{"sentence":"The pediatrician suspected trigonocephaly and referred the infant to a craniofacial specialist.","translation":"小児科医は三角頭蓋を疑い、その乳児を頭蓋顔面専門医に紹介した。","type":"noun","meaning_category":"medical condition"},{"sentence":"Early diagnosis of trigonocephaly is crucial for optimal surgical outcomes.","translation":"三角頭蓋の早期診断は、最適な手術結果を得るために非常に重要である。","type":"noun","meaning_category":"medical condition"}]}