{"word":"kreep","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(俗語) 不快なほど媚びへつらう、嫌な感じで近づく、ストーカーのように付きまとう","english_definition":"(slang) to behave in a way that is considered unpleasant, strange, or annoying, especially by trying too hard to get someone's attention or affection; to stalk or follow someone in an unsettling way.","examples":[{"sentence":"He's such a kreep, always trying to flirt with girls who clearly aren't interested.","translation":"彼は本当に気持ち悪いやつだ。いつも明らかに興味のない女の子たちに媚びようとしている。"},{"sentence":"Stop kleeping around and just ask her out already!","translation":"うじうじしないで、さっさと彼女をデートに誘えよ！"},{"sentence":"I saw him kleeping outside her window last night. It was really disturbing.","translation":"昨夜、彼が彼女の窓の外をうろついているのを見た。本当に不気味だった。"}],"collocations":["kreep around","kreep on someone","kreep someone out"],"synonyms":["creep","stalk","lurk","ogle","hit on (aggressively)"],"antonyms":[],"notes":"This word is highly informal and often carries a negative connotation. It is generally used to describe behavior that is seen as socially inappropriate or even threatening."},{"part_of_speech":"noun","definition":"(俗語) 不快な人、気持ち悪い人、ストーカー","english_definition":"(slang) a person who behaves in a way that is considered unpleasant, strange, or annoying, especially by trying too hard to get someone's attention or affection; a stalker.","examples":[{"sentence":"Don't talk to him, he's a total kreep.","translation":"彼に話しかけないで、彼は完全に気持ち悪いやつだ。"},{"sentence":"She called him a kreep after he kept sending her unwanted messages.","translation":"彼がしつこく迷惑なメッセージを送り続けたので、彼女は彼を気持ち悪いやつと呼んだ。"},{"sentence":"There was a kreep hanging around the schoolyard, so we called the police.","translation":"校庭の周りをうろついている不審者がいたので、警察に通報した。"}],"collocations":["total kreep","creepy kreep","just a kreep"],"synonyms":["creep","weirdo","stalker","pervert","oddball"],"antonyms":[],"notes":"This word is highly informal and often carries a negative connotation. It is generally used to describe someone who is seen as socially inappropriate or even threatening."}],"etymology":{"value":"Likely a variant spelling of \"creep\", possibly influenced by phonetic spelling or deliberate alteration for emphasis. The term \"creep\" has long been used to describe someone unpleasant or unsettling.","priority":"★★☆"},"pronunciation":{"ipa":"/kriːp/","syllables":"kreep"},"inflection":{"verb_forms":{"present_simple":["kreep","kreeps"],"past_simple":"kreept","past_participle":"kreept","present_participle":"kleeping"},"noun_plural":"kreeeps"},"usage_notes":{"explanation":"\"Kreep\" is a slang term, primarily used in informal contexts, to describe someone who is perceived as being creepy, annoying, or overly persistent in their advances. It is a stronger and more derogatory term than simply calling someone \"weird\" or \"strange\". The verb form describes the act of behaving in a creepy or stalker-like manner. Due to its negative connotations, it should be used with caution.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is very kreep and kind.","correct":"✓ He is very creepy.","note":"\"Kreep\" usually implies negative qualities, so it's unlikely to be used with positive adjectives like \"kind\"."},{"incorrect":"✗ I saw him kleeping the floor.","correct":"✓ I saw him sweeping the floor.","note":"\"Kreep\" (slang) is different from \"creep\" (to move slowly and quietly). If you mean moving slowly, use \"creep\" or another appropriate verb."}],"priority":"★★☆"},"related_words":{"derivatives":["kreeper (noun, less common variant of \"creep\")","kleepy (adjective, describing something that is creepy)"],"synonyms":["creep","creepy","stalker","weirdo","pervert","oddball"],"antonyms":[]},"level_frequency":{"CEFR":"N/A (slang, not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Low frequency (primarily used in informal online contexts)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Kreep\" is a slang term, meaning it's very informal and not usually found in formal writing or speech. It's used to describe someone who is seen as creepy, annoying, or overly persistent in their advances. Because it's slang, it's important to understand the context and audience before using it. It's generally considered a negative term and can be offensive. It's more common in online communication and among younger speakers of English."},"example_sentences":[{"sentence":"That guy at the bar was such a kreep, he wouldn't leave me alone.","translation":"バーにいたあの男は本当に気持ち悪かった。全然私を放っておいてくれなかった。","type":"noun","meaning_category":"unpleasant person"},{"sentence":"Stop kleeping on her social media, it's embarrassing.","translation":"彼女のSNSをストーキングするのはやめろ。恥ずかしいぞ。","type":"verb","meaning_category":"behaving unpleasantly"},{"sentence":"He gave me a kleepy vibe.","translation":"彼は私に気持ち悪い雰囲気を与えた。","type":"adjective (kleepy)","meaning_category":"creepy"}]}