{"word":"By-bidder","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A person who makes a bid at an auction on behalf of the seller, with the intention of artificially raising the price; a shill bidder.","english_definition":"A person employed by the seller at an auction to bid on items, with the primary goal of driving up the price rather than genuinely wanting to purchase the item.","examples":[{"sentence":"The auction house was accused of using by-bidders to inflate the prices of artwork.","translation":"そのオークションハウスは、美術品の価格をつり上げるために、買い煽り屋を使っていたと告発された。"},{"sentence":"It's illegal to use by-bidders to deceive other potential buyers.","translation":"他の潜在的な買い手を欺くために、買い煽り屋を使うことは違法である。"}],"collocations":["shill bidder","dummy bidder","puff bidder"],"synonyms":["shill","dummy bidder","puff bidder"],"antonyms":["genuine bidder","bona fide bidder"]}],"etymology":{"value":"The term 'by-bidder' is derived from the practice of bidding 'by' or 'on behalf of' someone else, typically the seller, to manipulate the auction price.","priority":"N/A"},"pronunciation":{"ipa":"/ˈbaɪˌbɪdər/","syllables":"by-bid-der"},"inflection":{"noun_plural":"by-bidders"},"usage_notes":{"explanation":"The term 'by-bidder' refers to someone who bids at an auction not to genuinely buy an item, but to artificially increase its price. This practice is often illegal and considered unethical because it deceives other potential buyers. The main purpose of a by-bidder is to create the illusion of higher demand, thus encouraging genuine bidders to offer more money.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a by-bidder at the estate sale, trying to get a good deal.","correct":"✓ He was a by-bidder at the estate sale, trying to drive up the prices.","note":"By-bidders aim to increase prices, not get good deals. The purpose is to benefit the seller, not themselves."}],"priority":"★★☆"},"related_words":{"derivatives":["by-bidding (noun: the act of using by-bidders)"],"phrasal_verbs":[],"related_concepts":["auction","bidding","shill","fraud","price manipulation"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'by-bidder' is a specialized term primarily used in the context of auctions and legal discussions regarding fraudulent bidding practices. It refers to an individual who bids on behalf of the seller to artificially inflate the price of an item. Understanding this term requires familiarity with auction dynamics and ethical considerations in sales."},"example_sentences":[{"sentence":"The investigation revealed that several by-bidders were working in concert to raise the final sale price.","translation":"調査の結果、最終的な販売価格をつり上げるために、複数の買い煽り屋が共謀していたことが明らかになった。","type":"example","meaning_category":"Price manipulation"},{"sentence":"The auctioneer denied any knowledge of by-bidders operating during the sale.","translation":"競売人は、販売中に買い煽り屋が活動していたという認識はないと否定した。","type":"example","meaning_category":"Denial of illegal activity"}]}