{"word":"preconcealment","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律)計画的隠蔽、事前隠蔽：犯罪の意図を隠すために、犯罪の実行前に計画的に行う行為。","english_definition":"(law) The act of deliberately concealing something in advance, especially to hide a criminal intention.","examples":[{"sentence":"The prosecution argued that the defendant's preconcealment of the weapon demonstrated premeditation.","translation":"検察側は、被告による凶器の事前隠蔽が計画性を示していると主張した。"},{"sentence":"The evidence showed a clear pattern of preconcealment, suggesting a deliberate attempt to mislead investigators.","translation":"証拠は、調査官を欺こうとする意図的な試唆を示唆する、計画的な隠蔽の明確なパターンを示していた。"}],"collocations":["evidence of preconcealment (事前隠蔽の証拠)","act of preconcealment (事前隠蔽の行為)","establish preconcealment (事前隠蔽を立証する)","prove preconcealment (事前隠蔽を証明する)"],"synonyms":["premeditation","preplanning","advance concealment","deliberate hiding"],"antonyms":["disclosure","revelation","exposure","openness"]}],"etymology":{"value":"\"pre-\" (前もって) + \"concealment\" (隠蔽)","priority":"★★★"},"pronunciation":{"ipa":"/ˌpriːkənˈsiːlmənt/","syllables":"pre-con-ceal-ment"},"inflection":{"noun_plural":"preconcealments"},"usage_notes":{"explanation":"\"Preconcealment\" is a legal term referring to actions taken before a crime to hide one's intentions or preparations. It is often used to demonstrate premeditation, which can increase the severity of the charges.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The preconcealment of the evidence was accidental.","correct":"✓ The concealment of the evidence was accidental.","note":"Preconcealment implies a deliberate, planned action. If the concealment was accidental, \"concealment\" alone is more appropriate."},{"incorrect":"✗ He was charged with preconcealment, but there was no crime committed.","correct":"✓ He was charged with attempted fraud due to preconcealment.","note":"Preconcealment is not a crime in itself, but it is evidence of intent to commit a crime, such as fraud or theft."}],"priority":"★★☆"},"related_words":{"derivatives":["preconceal (verb)"],"phrasal_verbs":[],"related_legal_terms":["premeditation","intent","mens rea","actus reus"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 主に法律関連の文脈で使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Preconcealment\" is a specialized legal term that describes the act of intentionally hiding something in advance, typically to mask a criminal intention. It's a high-level concept often used in legal arguments to demonstrate premeditation or intent. Understanding this term requires a strong grasp of legal vocabulary and concepts. It's not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The judge considered the defendant's preconcealment of assets as a sign of fraudulent intent.","translation":"裁判官は、被告による資産の事前隠蔽を詐欺の意図の表れと見なした。","type":"noun","meaning_category":"legal"},{"sentence":"The prosecution presented evidence of the suspect's preconcealment of his identity before the robbery.","translation":"検察側は、強盗の前に容疑者が身元を事前隠蔽していた証拠を提出した。","type":"noun","meaning_category":"legal"}]}