{"word":"Toddick","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Rare, possibly archaic) A small child; a toddler. This usage is highly uncommon.","english_definition":"(Rare, possibly archaic) A diminutive or endearing term for a small child; a toddler.","examples":[{"sentence":"The little toddick ran gleefully through the field.","translation":"その小さなトディックは嬉しそうに野原を走り回った。"},{"sentence":"She held the toddick close, shielding him from the cold.","translation":"彼女はトディックを抱きしめ、寒さから守った。"}],"collocations":["little toddick","small toddick"],"synonyms":["toddler","child","infant","baby"],"antonyms":["adult"]}],"etymology":{"value":"Likely a diminutive form of 'todd', which itself is an archaic term for a fox or a foolish person. The '-ick' suffix suggests smallness or endearment.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈtɒdɪk/","syllables":"Tod-dick"},"inflection":{"noun_plural":"Toddicks"},"usage_notes":{"explanation":"The word 'Toddick' is extremely rare and not in common usage. If encountered, it most likely refers to a small child, similar to 'toddler.' However, its archaic nature makes it an unusual choice in modern English.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The toddick is a common term for a teenager.","correct":"✓ The toddick is an archaic term for a small child.","note":"'Toddick' refers to a small child, not a teenager."}],"priority":"★★☆"},"related_words":{"derivatives":["Todd (archaic term for a fox or foolish person)","Toddler (a child who is learning to walk)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Extremely rare)","frequency_google_ngram":"Very low frequency; likely not found in most corpora.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Toddick' is a very rare and archaic word. It is unlikely to be encountered in everyday language. If you do come across it, understand that it probably refers to a small child, but be aware that its usage is highly uncommon and may sound strange to native English speakers."},"example_sentences":[{"sentence":"The old woman smiled at the toddick playing in the garden.","translation":"老婆は庭で遊ぶトディックに微笑みかけた。","type":"noun","meaning_category":"small child"}]}