{"word":"endomictic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(湖などが)排水河川を持たない、閉鎖湖の","english_definition":"(of a lake or drainage basin) having no outflow to the ocean; closed.","examples":[{"sentence":"The Great Salt Lake is an endomictic lake.","translation":"グレートソルト湖は閉鎖湖である。"},{"sentence":"Endomictic basins are common in arid regions.","translation":"閉鎖盆地は乾燥地域によく見られる。"}],"collocations":["endomictic lake","endomictic basin","endomictic region"],"synonyms":["closed","endorheic"],"antonyms":["exorheic","rheic"]}],"etymology":{"value":"From the Greek words 'endo-' meaning 'within' and 'miktos' meaning 'mixed'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛndoʊˈmɪktɪk/","syllables":"en-do-mic-tic"},"inflection":{"notes":"Comparative and superlative forms are endomictic, more endomictic, most endomictic."},"usage_notes":{"explanation":"'Endomictic' is primarily used in geography and hydrology to describe bodies of water or drainage basins that do not drain into the ocean. These are also known as closed basins or interior drainage basins.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lake is endometric.","correct":"✓ The lake is endomictic.","note":"'Endometric' is not the correct term; the correct term is 'endomictic'."}],"priority":"★☆☆"},"related_words":{"derivatives":["endomictism (noun): the state of being endomictic.","endorheic (adjective): having interior drainage; synonymous with endomictic."],"related_terms":["endorheism (noun): the condition of having interior drainage."]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Endomictic' is a specialized term used in geography and hydrology. It describes a lake or drainage basin that does not have an outflow to the ocean. This means that water flows into the lake or basin, but it only leaves through evaporation or seepage. This term is not commonly used in everyday conversation but is important in specific scientific contexts."},"example_sentences":[{"sentence":"Lake Chad is located in an endomictic basin in Africa.","translation":"チャド湖はアフリカの閉鎖盆地に位置している。","type":"adjective","meaning_category":"describing a lake"},{"sentence":"The endomictic nature of the basin leads to high salinity in the lake.","translation":"その盆地の閉鎖性により、湖の塩分濃度が高くなっている。","type":"adjective","meaning_category":"describing a basin"},{"sentence":"Many of the world's largest lakes are endomictic.","translation":"世界の主要な湖の多くは閉鎖湖である。","type":"adjective","meaning_category":"describing lakes"},{"sentence":"The study focused on the hydrological characteristics of endomictic systems.","translation":"その研究は閉鎖系の水文特性に焦点を当てた。","type":"adjective","meaning_category":"describing systems"}]}