{"word":"protomorphic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(化学)プロトモルフィックの、原型を保った","english_definition":"Retaining the original form or structure; pertaining to or exhibiting protomorphism. (In chemistry, pertaining to a substance whose molecules have not undergone substantial alteration.)","examples":[{"sentence":"The protomorphic structure of the mineral remained intact despite the high pressure.","translation":"その鉱物のプロトモルフィックな構造は、高圧にもかかわらず損なわれずに残った。"},{"sentence":"Chemists analyzed the protomorphic compound to understand its original properties.","translation":"化学者たちは、その元の特性を理解するために、プロトモルフィックな化合物を分析した。"}],"collocations":["protomorphic structure","protomorphic compound","protomorphic state"],"synonyms":["original","unaltered","unmodified","pristine","underived"],"antonyms":["altered","modified","derived","transformed"],"notes":"Primarily used in scientific contexts, especially in chemistry and mineralogy."}],"etymology":{"value":"Derived from the Greek words 'protos' (meaning 'first' or 'original') and 'morphe' (meaning 'form' or 'shape').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊtoʊˈmɔːrfɪk/","syllables":"pro-to-mor-phic"},"inflection":{"notes":"Adjective, does not inflect for number or gender."},"usage_notes":{"explanation":"'Protomorophic' is a technical term mainly used in scientific disciplines to describe something that retains its original form or hasn't undergone significant changes. Its usage is limited to these specific contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artist aimed to create a protomorphic representation of the modern city.","correct":"✓ The artist aimed to create a realistic representation of the modern city.","note":"'Protomorophic' is not generally used to describe realistic artistic representations. It is more appropriate in scientific contexts where the original form is preserved. Replace with 'realistic' or 'accurate'."}],"priority":"★☆☆"},"related_words":{"derivatives":["protomorphism (noun): The state or quality of retaining the original form or structure."],"related_terms":["allomorphism","polymorphism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in specialized scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'protomorphic' is a highly specialized term primarily used in scientific fields like chemistry and mineralogy. It describes something that retains its original form or structure, indicating it hasn't undergone significant alteration. Due to its technical nature and limited application, it's rarely encountered outside of these specific contexts. Understanding requires familiarity with scientific terminology."},"example_sentences":[{"sentence":"The geologist studied the protomorphic crystals to determine their age.","translation":"地質学者は、それらの年代を特定するために、プロトモルフィックな結晶を研究した。","type":"scientific","meaning_category":"original form"},{"sentence":"The protomorphic nature of the polymer allowed for easy identification of its components.","translation":"そのポリマーのプロトモルフィックな性質により、その成分の容易な識別が可能になった。","type":"chemical","meaning_category":"unaltered structure"}]}