{"word":"crossgrainedness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"気難しいこと、つむじ曲がりな性質、扱いにくさ","english_definition":"the quality of being difficult, uncooperative, or ill-tempered; contrariness.","examples":[{"sentence":"His crossgrainedness made him unpopular with his colleagues.","translation":"彼の気難しさが、彼を同僚から不人気にした。"},{"sentence":"The crossgrainedness of the wood made it difficult to work with.","translation":"その木の扱いにくさが、加工を困難にした。"}],"collocations":["exhibit crossgrainedness (気難しさを示す)","overcome crossgrainedness (気難しさを克服する)"],"synonyms":["irascibility","cantankerousness","obstinacy","contrariness","perversity","stubbornness"],"antonyms":["agreeableness","cooperativeness","amiability","complaisance"]}],"etymology":{"value":"crossgrained + -ness.  'Crossgrained' originally referred to wood with fibers running in an irregular or contrary direction, making it difficult to work.  The figurative sense, applied to people, developed from this.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkrɔːsˈɡreɪnɪdnəs/","syllables":"cross-grained-ness"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Crossgrainedness' refers to a disposition characterized by stubbornness, contrariness, and a general unwillingness to cooperate. It can also describe the physical property of a material, especially wood, that makes it difficult to work with due to its irregular grain. The term is relatively uncommon in everyday speech but may be encountered in literature or technical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a lot of crossgrained.","correct":"✓ He showed a lot of crossgrainedness.","note":"'Crossgrained' is an adjective; the noun form is 'crossgrainedness'."}],"priority":"★★★"},"related_words":{"derivatives":["crossgrained (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'crossgrainedness' is a relatively uncommon and sophisticated term used to describe the quality of being difficult, uncooperative, or ill-tempered. It is often used in formal writing or when discussing complex personality traits. Understanding this word requires a good grasp of abstract concepts and nuanced vocabulary."},"example_sentences":[{"sentence":"The manager struggled to deal with the employee's inherent crossgrainedness.","translation":"マネージャーは、その従業員の生来の気難しさに苦労した。","type":"general","meaning_category":"気難しい性質"},{"sentence":"The carpenter cursed the crossgrainedness of the oak, making the carving process arduous.","translation":"大工は、樫の木の扱いにくさをののしり、彫刻のプロセスを困難にした。","type":"technical","meaning_category":"扱いにくさ"}]}