{"word":"tonuses","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(筋肉の)緊張、(身体の)調子","english_definition":"The continuous and passive partial contraction of the muscles, or their resistance to passive stretch during resting state. Also, general physical fitness or condition.","examples":[{"sentence":"Regular exercise helps improve muscle tonus.","translation":"定期的な運動は筋肉の緊張を改善するのに役立ちます。"},{"sentence":"The patient's muscle tonus was assessed by the physiotherapist.","translation":"患者の筋肉の緊張は理学療法士によって評価されました。"},{"sentence":"Maintaining good tonus is important for overall health.","translation":"良好な身体の調子を維持することは、全体的な健康にとって重要です。"}],"collocations":["muscle tonus","skin tonus","good tonus","poor tonus"],"synonyms":["tension","tone","firmness","condition","health"],"antonyms":["flaccidity","atony","weakness"]}],"etymology":{"value":"Derived from the word 'tonus', which comes from the Greek word 'tonos' (τόνος), meaning 'tension, pitch, tone'.","priority":"★★☆"},"pronunciation":{"ipa":"ˈtoʊnəsɪz","syllables":"to-nus-es"},"inflection":{"noun_plural":"tonuses"},"usage_notes":{"explanation":"'Tonuses' is the plural form of 'tonus'. 'Tonus' refers to the normal state of continuous contraction of muscle fibers, which maintains posture and readiness for action. It can also refer to the general condition of the body. In medical contexts, assessing muscle tonus is a routine part of a neurological examination.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tonus of her skin was very elastic.","correct":"✓ The tone of her skin was very elastic.","note":"'Tonus' specifically refers to muscle tension or general physical condition. 'Tone' can refer to skin condition, color, or elasticity."},{"incorrect":"✗ He had a high tonuses after the workout.","correct":"✓ He had high tonus after the workout.","note":"'Tonus' is often used as an uncountable noun, especially when referring to the general state of muscle tension."}],"priority":"★★☆"},"related_words":{"derivatives":["tonus","tonic","isotonic","hypertonic","hypotonic","tonicity"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'tonuses' (plural of 'tonus') is a technical term primarily used in the fields of medicine, physiology, and physical therapy. It refers to the state of continuous muscle contraction or the general physical condition of the body. Due to its specialized usage, it is not commonly encountered in everyday language. Understanding this term requires familiarity with biological and medical concepts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The physiotherapist checked the patient's muscle tonuses during the examination.","translation":"理学療法士は診察中に患者の筋肉の緊張をチェックしました。","type":"noun","meaning_category":"muscle tension"},{"sentence":"Changes in muscle tonuses can indicate underlying neurological conditions.","translation":"筋肉の緊張の変化は、根底にある神経学的状態を示す可能性があります。","type":"noun","meaning_category":"muscle tension"},{"sentence":"Regular exercise can help improve and maintain healthy muscle tonuses.","translation":"定期的な運動は、健康な筋肉の緊張を改善および維持するのに役立ちます。","type":"noun","meaning_category":"muscle tension"}]}