{"word":"seclusionist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(政治・外交における) 鎖国主義者、孤立主義者","english_definition":"An advocate of seclusionism, especially in politics and international relations.","examples":[{"sentence":"The country's leadership was dominated by seclusionists who opposed foreign trade and interaction.","translation":"その国の指導部は、外国貿易や交流に反対する鎖国主義者によって支配されていた。"},{"sentence":"Historically, Japan had a long period under a seclusionist policy.","translation":"歴史的に、日本は鎖国政策の下で長い期間を過ごした。"}],"collocations":["isolationist","protectionist","autarkist"],"synonyms":["isolationist","hermit","recluse"],"antonyms":["internationalist","globalist"]},{"part_of_speech":"adjective","definition":"鎖国主義の、孤立主義の","english_definition":"Relating to or advocating seclusionism.","examples":[{"sentence":"The government adopted a seclusionist approach to foreign policy.","translation":"政府は外交政策において鎖国主義的なアプローチを採用した。"},{"sentence":"The economic effects of the country's seclusionist policies were significant.","translation":"その国の鎖国主義政策の経済的影響は大きかった。"}],"collocations":["seclusionist policy","seclusionist regime","seclusionist ideology"],"synonyms":["isolationist","protectionist","autarkic"],"antonyms":["internationalist","globalist"]}],"etymology":{"value":"From 'seclusion' (the act of secluding oneself from society) + '-ist' (a suffix denoting an advocate or believer).","priority":"★★☆"},"pronunciation":{"ipa":"/sɪˈkluːʒənɪst/","syllables":"se-clu-sion-ist"},"inflection":{"noun_plural":"seclusionists"},"usage_notes":{"explanation":"'Seclusionist' refers to someone who believes in or supports the policy of isolating a country from other nations, typically to protect its economy, culture, or political system. It can also describe policies or ideologies that promote such isolation. The term is often used in historical contexts, such as describing Japan's Edo period, but can also apply to contemporary political debates.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"He is a seclusion.","correct":"He is a seclusionist.","note":"'Seclusion' is a state or act, while 'seclusionist' is a person who advocates for it."},{"incorrect":"The policy was seclusion.","correct":"The policy was seclusionist.","note":"'Seclusion' is a state or act, while 'seclusionist' is an adjective describing the policy."}],"priority":"★★☆"},"related_words":{"derivatives":["seclusion (noun: the state of being private and away from other people)","seclude (verb: to keep someone or something away from other people)"],"phrases":["policy of seclusion","economic seclusionism","cultural seclusionism"],"related_concepts":["isolationism","autarky","protectionism","xenophobia"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Seclusionist' is a relatively uncommon word that refers to someone who supports the idea of a country isolating itself from other countries. This can be for economic, political, or cultural reasons. It is often used in discussions of history or political science. The word is formed from 'seclusion,' which means being separate or hidden away, and '-ist,' which indicates a person who believes in or supports something.","priority":"★☆☆"},"example_sentences":[{"sentence":"The emperor was surrounded by seclusionists who advised him to reject all foreign influence.","translation":"皇帝は、すべての外国の影響を拒否するよう助言する鎖国主義者に囲まれていた。","type":"noun","meaning_category":"鎖国主義者"},{"sentence":"The country's seclusionist trade policies hindered its economic growth.","translation":"その国の鎖国主義的な貿易政策は経済成長を妨げた。","type":"adjective","meaning_category":"鎖国主義の"}]}