{"word":"nonmetric","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"非計量的な、非メートル法の","english_definition":"Not based on the metric system; not involving measurement.","examples":[{"sentence":"The recipe uses nonmetric units like cups and ounces.","translation":"そのレシピは、カップやオンスのような非メートル法の単位を使用しています。"},{"sentence":"A nonmetric space is a generalization of a metric space.","translation":"非計量空間は、計量空間の一般化です。"},{"sentence":"The data was collected using nonmetric methods.","translation":"そのデータは、非計量的な方法を用いて収集されました。"}],"collocations":["nonmetric units","nonmetric space","nonmetric data"],"synonyms":["imperial","customary"],"antonyms":["metric"],"notes":["Often used in scientific or technical contexts to describe systems or spaces that do not adhere to metric standards."]}],"etymology":{"value":"\"non-\" (not) + \"metric\".","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈmɛtrɪk/","syllables":"non-met-ric"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Nonmetric' is used to describe something that doesn't follow the metric system, which is a standard system of measurement. It can refer to units of measurement (like inches instead of centimeters) or to mathematical spaces that don't have a defined metric.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The ruler is non-metric, so it uses centimeters.","correct":"✓ The ruler is non-metric, so it uses inches.","note":"Non-metric rulers use units like inches, not centimeters."}],"priority":"★★☆"},"related_words":{"derivatives":["nonmetrical (adjective)"],"related_terms":["metric","metric system","measurement"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"relatively low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'nonmetric' is relatively technical and is used in contexts where the metric system is expected. It's most commonly found in scientific, engineering, or mathematical discussions where precise measurement is important. Understanding requires familiarity with the concept of the metric system itself."},"example_sentences":[{"sentence":"The old blueprints were drawn using nonmetric scales.","translation":"古い設計図は、非メートル法の縮尺で描かれていました。","type":"general","meaning_category":"non-metric units"},{"sentence":"In topology, a nonmetric space is a topological space that does not have a metric defined on it.","translation":"位相幾何学では、非計量空間は、その上に計量が定義されていない位相空間です。","type":"technical","meaning_category":"non-metric space"}]}