{"word":"perineoplasty","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"会陰形成術（えいんけいせいじゅつ）: 会陰（肛門と膣の間、または肛門と陰嚢の間の領域）の再建または修復を行う外科手術。","english_definition":"Surgical reconstruction or repair of the perineum (the area between the anus and the vagina or the anus and the scrotum).","examples":[{"sentence":"Perineoplasty is often performed to repair damage caused by childbirth.","translation":"会陰形成術は、出産によって引き起こされた損傷を修復するためにしばしば行われます。"},{"sentence":"Some women choose to undergo perineoplasty to improve their aesthetic appearance.","translation":"外観を改善するために会陰形成術を受けることを選ぶ女性もいます。"},{"sentence":"The doctor recommended perineoplasty to correct the perineal defect.","translation":"医師は会陰の欠損を修正するために会陰形成術を勧めました。"}],"collocations":["undergo perineoplasty (会陰形成術を受ける)","perineoplasty surgery (会陰形成手術)","vaginal perineoplasty (膣会陰形成術)","perineoplasty repair (会陰形成修復)"],"synonyms":["perineal reconstruction","perineal repair"],"antonyms":[]}],"etymology":{"value":"「perineo-」（会陰）+「-plasty」（形成術）から構成される。ギリシャ語の「perineos」（会陰）と「plassein」（形作る）に由来。","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌpɛrɪˈniːoʊˌplæsti/","syllables":"per-i-ne-o-plas-ty"},"inflection":{"noun_plural":"perineoplasties"},"usage_notes":{"explanation":"Perineoplasty is a surgical procedure that aims to restore or improve the function and/or appearance of the perineum. It is commonly performed after childbirth to repair tears or stretching of the perineal tissues. It can also be done for cosmetic reasons or to correct congenital defects. The procedure involves tightening the muscles and tissues of the perineum to provide better support and improve sexual function.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ perineoplasty surgery is a simple procedure with no risks.","correct":"✓ Perineoplasty surgery, like any surgical procedure, carries some risks and potential complications.","note":"会陰形成術を含むすべての手術には、感染、出血、瘢痕化、感覚の変化などのリスクが伴います。手術を受ける前に、医師とリスクについて話し合うことが重要です。"},{"incorrect":"✗ Perineoplasty is only for women.","correct":"✓ While more common in women, perineoplasty can also be performed on men in certain cases, such as after trauma or surgery in the perineal area.","note":"会陰形成術は主に女性を対象としていますが、男性にも適用される場合があります。"}],"priority":"★☆☆"},"related_words":{"derivatives":["perineal (形容詞: 会陰の)","vaginoplasty (名詞: 膣形成術)","labiaplasty (名詞: 小陰唇形成術)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (専門用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学専門用語。","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"「**Perineoplasty**」は、会陰（肛門と性器の間にある部分）の形を整えたり、修復したりする手術の名前です。出産で会陰が傷ついたり、緩んだりした場合に行われることがあります。また、見た目を良くするために行われることもあります。この手術では、会陰の筋肉や組織を引き締めて、より良いサポートを提供したり、性機能を改善したりします。手術にはリスクもあるので、医師とよく相談することが大切です。"},"example_sentences":[{"sentence":"The patient underwent **perineoplasty** to repair the episiotomy scar.","translation":"患者は会陰切開の傷跡を修復するために会陰形成術を受けた。","type":"noun","meaning_category":"会陰形成術"},{"sentence":"**Perineoplasty** can improve the strength and support of the pelvic floor muscles.","translation":"会陰形成術は、骨盤底筋の強度とサポートを改善することができます。","type":"noun","meaning_category":"会陰形成術"},{"sentence":"The surgeon specialized in **perineoplasty** and other reconstructive procedures.","translation":"その外科医は、会陰形成術およびその他の再建手術を専門としていた。","type":"noun","meaning_category":"会陰形成術"}]}