{"word":"occlusogingival","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(歯科)咬合面歯肉の、咬合面歯肉側の","english_definition":"(dentistry) Relating to the occlusal and gingival surfaces of a tooth.","examples":[{"sentence":"The occlusogingival height of the crown was carefully measured.","translation":"クラウンの咬合面歯肉側の高さは注意深く測定された。"}],"collocations":["occlusogingival dimension","occlusogingival height","occlusogingival width"],"synonyms":["occlusocervical"],"antonyms":[]}],"etymology":{"value":"Derived from the combination of 'occluso-' (relating to the occlusal surface) and 'gingival' (relating to the gingiva or gums).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒkluːsoʊˈdʒɪndʒɪvəl/","syllables":"oc-clu-so-gin-gi-val"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than to form comparative and superlative forms, which are not commonly used with this word."},"usage_notes":{"explanation":"This term is primarily used in dentistry to describe measurements, dimensions, or directions related to both the occlusal (biting) surface and the gingival (gum) margin of a tooth. It is used to provide precise descriptions in dental procedures and diagnoses.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The occlusoincisal is the same as occlusogingival.","correct":"✓ The occlusoincisal refers to incisors, while occlusogingival refers to other teeth.","note":"Occlusoincisal is used for incisors, while occlusogingival is a more general term for all teeth."}],"priority":"★☆☆"},"related_words":{"derivatives":["occlusal","gingival"],"related_terms":["mesiodistal","buccolingual","cervical"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily used in dental literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"This is a highly specialized term used within the field of dentistry. Understanding requires familiarity with dental anatomy and terminology. The term describes a direction or measurement relating to both the biting surface (occlusal) and the gum line (gingival) of a tooth. It is not commonly used outside of professional dental contexts."},"example_sentences":[{"sentence":"The dentist assessed the occlusogingival length of the prepared tooth.","translation":"歯科医は準備された歯の咬合面歯肉側の長さを評価した。","type":"general","meaning_category":"dental measurement"},{"sentence":"The restoration should have proper occlusogingival contour for optimal function.","translation":"修復物は最適な機能のために適切な咬合面歯肉側の輪郭を持つべきである。","type":"general","meaning_category":"dental restoration"}]}