{"word":"arcubalister","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A type of large medieval crossbow fixed to a stand, requiring a mechanical device to draw its powerful bowstring.","english_definition":"A large crossbow used in the Middle Ages, typically mounted on a stand and requiring a mechanical device to draw the string.","examples":[{"sentence":"The arcubalister was a formidable weapon in siege warfare.","translation":"アルクバリスタは攻城戦において恐るべき武器だった。"},{"sentence":"Arcubalisters were often used to target fortifications and enemy soldiers from a distance.","translation":"アルクバリスタは、遠距離から要塞や敵兵を標的にするためによく使用された。"}],"collocations":["siege arcubalister","heavy arcubalister","mounted arcubalister"],"synonyms":["ballista","siege crossbow","springald"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin words 'arcus' (bow) and 'ballista' (a type of catapult or large crossbow).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɑːrkjuːˈbælɪstər/","syllables":"ar-cu-bal-is-ter"},"inflection":{"noun_plural":"arcubalisters"},"usage_notes":{"explanation":"The term 'arcubalister' specifically refers to a large, stand-mounted crossbow, often used in siege warfare. It is distinct from smaller, handheld crossbows.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used an arcubalister to hunt deer.","correct":"✓ He used a crossbow to hunt deer.","note":"Arcubalisters were too large and cumbersome for hunting; smaller crossbows were used instead."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - a historical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Arcubalister' is a specialized historical term referring to a specific type of large crossbow used in medieval warfare. Understanding requires knowledge of medieval weaponry and siege tactics. It is not part of common modern vocabulary."},"example_sentences":[{"sentence":"The museum displayed a fully restored arcubalister, showcasing its impressive size and power.","translation":"博物館には完全に修復されたアルクバリスタが展示されており、その印象的な大きさと威力を示していた。","type":"noun","meaning_category":"weapon"},{"sentence":"Historical accounts describe the devastating impact of arcubalisters on castle walls during sieges.","translation":"歴史的記録には、攻囲戦におけるアルクバリスタの城壁への壊滅的な影響が記述されている。","type":"noun","meaning_category":"weapon"}]}