{"word":"non-commercialization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"非商業化、非営利化","english_definition":"The act or process of preventing something from becoming commercial or being used for commercial purposes.","examples":[{"sentence":"The university is committed to the non-commercialization of its research findings.","translation":"大学は研究成果の非商業化に尽力しています。"},{"sentence":"We need policies that support the non-commercialization of healthcare.","translation":"私たちは医療の非商業化を支援する政策が必要です。"},{"sentence":"The artist insisted on the non-commercialization of his artwork.","translation":"そのアーティストは自身の作品の非商業化を主張しました。"}],"collocations":["promote non-commercialization (非商業化を促進する)","ensure non-commercialization (非商業化を確実にする)","support non-commercialization (非商業化を支援する)"],"synonyms":["decommodification","non-profitization"],"antonyms":["commercialization","privatization"],"related_terms":["open source","public domain","creative commons"]}],"etymology":{"value":"'Non-' (否定接頭辞) + 'commercialization' (商業化)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn.kəˌmɜː.ʃəl.aɪˈzeɪ.ʃən/","syllables":"non-com-mer-cial-i-za-tion"},"inflection":{"noun_plural":"non-commercializations"},"usage_notes":{"explanation":"'Non-commercialization' refers to the act of keeping something out of the commercial sphere. This often applies to areas like research, healthcare, or art, where there is a desire to ensure access and availability are not driven solely by profit motives. It's often associated with efforts to make resources available under open licenses or within the public domain.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The non-commercialization is important for the company.","correct":"Non-commercialization is important.","note":"Non-commercialization is a concept, it doesn't belong to a company."}],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Non-commercialization' means preventing something from being used for business or profit. It's a more complex term often used in discussions about ethics, access to resources, and the role of profit in areas like healthcare, education, or research. Understanding this term requires a grasp of the concept of commercialization itself."},"example_sentences":[{"sentence":"The foundation's goal is the non-commercialization of renewable energy technologies.","translation":"その財団の目標は、再生可能エネルギー技術の非商業化です。","type":"noun","meaning_category":"非商業化"},{"sentence":"Efforts towards non-commercialization aim to make essential resources accessible to everyone.","translation":"非商業化に向けた取り組みは、不可欠な資源をすべての人々が利用できるようにすることを目指しています。","type":"noun","meaning_category":"非商業化"},{"sentence":"The non-commercialization of the software allowed for widespread adoption and collaboration.","translation":"そのソフトウェアの非商業化により、広範な採用とコラボレーションが可能になりました。","type":"noun","meaning_category":"非商業化"}]}