{"word":"romantico-heroic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ロマンチックで英雄的な、ロマン主義的英雄主義の","english_definition":"Combining elements of romanticism and heroism; relating to or characteristic of romantic heroism.","examples":[{"sentence":"The play had a romantico-heroic theme, focusing on the protagonist's courageous and passionate journey.","translation":"その劇は、主人公の勇敢で情熱的な旅に焦点を当てた、ロマンチックで英雄的なテーマを持っていた。"},{"sentence":"His romantico-heroic ideals led him to fight for what he believed was right, regardless of the personal cost.","translation":"彼のロマンチックで英雄的な理想は、個人的な犠牲を顧みず、正しいと信じることのために戦うことを彼に導いた。"}],"collocations":["romantico-heroic figure (ロマンチックで英雄的な人物)","romantico-heroic ideal (ロマンチックで英雄的な理想)","romantico-heroic theme (ロマンチックで英雄的なテーマ)"],"synonyms":["romantic","heroic","idealistic","chivalrous","gallant"],"antonyms":["realistic","pragmatic","unromantic","unheroic"]}],"etymology":{"value":"'Romantic' (ロマンチックな) と 'heroic' (英雄的な) の組み合わせ。ロマン主義の理想と英雄主義の特質を併せ持つことを示す合成語。","priority":"★★★"},"pronunciation":{"ipa":"/roʊˌmæntɪkoʊ hɪˈroʊɪk/","syllables":"ro-man-ti-co-he-ro-ic"},"inflection":{"adjective_forms":{"comparative":"more romantico-heroic","superlative":"most romantico-heroic"}},"usage_notes":{"explanation":"'Romantico-heroic' は、ロマン主義の感情的な深さ、理想主義、そして英雄的な勇気、自己犠牲といった要素が組み合わさった概念を表す形容詞です。文学、芸術、歴史において、特定の人物像やテーマを説明する際に用いられます。ロマンチックな情熱と英雄的な行動が結びついた状態を指し、しばしば理想化された人物や物語に適用されます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He lived a romantico-heroic life, but he was very realistic.","correct":"✓ He lived a romantico-heroic life, embracing ideals and taking bold actions.","note":"ロマンチックで英雄的な生き方と現実主義は対立する概念なので、両立させるのは難しいです。理想を追求し、大胆な行動をとるという点を強調する方が適切です。"},{"incorrect":"✗ The romantico-heroic movie was very boring and uninspiring.","correct":"✓ The movie attempted to be romantico-heroic, but it failed to capture the audience's imagination.","note":"ロマンチックで英雄的な映画は、本来、刺激的で感動的なものであるはずです。つまらない、感動しないという評価は、その映画がロマンチックで英雄的な要素を効果的に表現できていないことを示唆します。"}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_concepts":["Romanticism (ロマン主義)","Heroism (英雄主義)","Idealism (理想主義)","Chivalry (騎士道)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"低頻度 (Low frequency) - 特定の文脈や専門分野でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Romantico-heroic' は、ロマン主義と英雄主義の要素を組み合わせた概念を表す形容詞であり、特定の文学的、芸術的、または歴史的な文脈で使用されます。この単語は、感情的な深さ、理想主義、勇気、自己犠牲といった特徴を併せ持つ人物やテーマを説明するために用いられます。そのため、読解には、ロマン主義と英雄主義の基本的な理解が必要です。"},"example_sentences":[{"sentence":"The protagonist's journey was marked by a series of romantico-heroic acts, each displaying his unwavering commitment to justice.","translation":"主人公の旅は、正義への揺るぎない献身を示す一連のロマンチックで英雄的な行為によって特徴づけられた。","type":"adjective","meaning_category":"ロマンチックで英雄的な"},{"sentence":"The artist sought to capture the romantico-heroic spirit of the revolution in his paintings.","translation":"その芸術家は、自身の絵画で革命のロマンチックで英雄的な精神を捉えようとした。","type":"adjective","meaning_category":"ロマンチックで英雄的な"},{"sentence":"Despite the challenges, she maintained a romantico-heroic outlook, believing in the power of love and courage.","translation":"困難にもかかわらず、彼女は愛と勇気の力を信じ、ロマンチックで英雄的な見通しを維持した。","type":"adjective","meaning_category":"ロマンチックで英雄的な"}]}