{"word":"pre-examiner","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に法律分野で)予備審査官、事前審査官","english_definition":"A person who conducts a preliminary examination or review, especially in legal contexts.","examples":[{"sentence":"The pre-examiner reviewed the documents before they were submitted to the court.","translation":"予備審査官は、書類が裁判所に提出される前に審査した。"},{"sentence":"As a pre-examiner, her job was to identify any potential issues with the case.","translation":"事前審査官として、彼女の仕事は訴訟の潜在的な問題を特定することだった。"}],"collocations":["legal pre-examiner","patent pre-examiner"],"synonyms":["preliminary reviewer","initial assessor"],"antonyms":[]}],"etymology":{"value":"\"pre-\" (前に) + \"examiner\" (審査官)","priority":"★★★"},"pronunciation":{"ipa":"/ˌpriːɪɡˈzæmɪnər/","syllables":"pre-ex-am-i-ner"},"inflection":{"noun_plural":"pre-examiners"},"usage_notes":{"explanation":"\"Pre-examiner\" is a relatively specific term, most commonly used in legal or patent contexts. It refers to someone who conducts a preliminary review or examination to identify potential issues or ensure completeness before a more formal or in-depth examination takes place.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The pre-examiner examined the case.","correct":"✓ The pre-examiner pre-examined the case.","note":"The pre-examiner performs a *preliminary* examination, not the full examination. Using \"pre-examined\" clarifies the role. Alternatively, \"The examiner examined the case\" is correct if referring to the main examiner."}],"priority":"★★☆"},"related_words":{"derivatives":["pre-examination"],"related_terms":["examiner","examination","preliminary review"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"pre-examiner\" is a specialized term, primarily encountered in legal or patent-related fields. It denotes an individual responsible for conducting a preliminary assessment or review of documents or cases before they undergo a more thorough examination. Understanding the term requires familiarity with the context of legal or patent processes.","priority":"★★☆"},"example_sentences":[{"sentence":"The patent application was first reviewed by a pre-examiner.","translation":"その特許申請はまず予備審査官によって審査された。","type":"noun","meaning_category":"予備審査官"},{"sentence":"The pre-examiner identified several areas that needed clarification.","translation":"事前審査官は、明確化が必要な箇所をいくつか特定した。","type":"noun","meaning_category":"事前審査官"}]}