{"word":"Vibrios","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ビブリオ属細菌（複数形）","english_definition":"plural of Vibrio: a genus of Gram-negative bacteria possessing a curved rod shape. Many species are pathogenic, causing diseases such as cholera and vibriosis.","examples":[{"sentence":"Vibrios are commonly found in marine environments.","translation":"ビブリオ属細菌は一般的に海洋環境で見られる。"},{"sentence":"Some Vibrios can cause serious infections in humans.","translation":"一部のビブリオ属細菌は、ヒトに重篤な感染症を引き起こす可能性がある。"}],"collocations":["Vibrio cholerae (コレラ菌)","Vibrio vulnificus (腸炎ビブリオ)","marine Vibrios (海洋性ビブリオ属細菌)"],"synonyms":["Vibrio (単数形)","bacteria","microorganisms"],"antonyms":[]}],"etymology":{"value":"New Latin, from Vibrio (genus name) + -s (plural suffix). Vibrio itself is derived from Latin vibrare (to vibrate), referring to the bacteria's motility.","priority":"★★☆"},"pronunciation":{"ipa":"ˈvɪbrioʊz","syllables":"Vib-ri-os"},"inflection":{"noun_plural":"Vibrios"},"usage_notes":{"explanation":"\"Vibrios\" is the plural form of \"Vibrio,\" referring to a genus of bacteria. When discussing multiple species or a general group of these bacteria, use the plural form. When referring to a specific species or the genus as a whole, \"Vibrio\" (singular) can be used.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Vibrios is a type of bacteria.","correct":"✓ Vibrios are a type of bacteria.","note":"Since \"Vibrios\" is plural, use the plural verb \"are.\""},{"incorrect":"✗ Vibrio are dangerous.","correct":"✓ Vibrios are dangerous. / ✓ Vibrio is a genus of bacteria.","note":"When referring to multiple species, use \"Vibrios are.\" When referring to the genus as a whole, \"Vibrio is\" can be used."}],"priority":"★★☆"},"related_words":{"derivatives":["Vibrio (単数形)","Vibriosis (ビブリオ病)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"低頻度 (Low frequency) - 医学・生物学分野で使われる専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Vibrios\" refers to a group of bacteria known as the Vibrio genus. These bacteria are Gram-negative and have a curved rod shape. They are often found in marine environments. Some Vibrio species, such as Vibrio cholerae and Vibrio vulnificus, can cause diseases in humans. The term \"Vibrios\" is used when discussing multiple species or the genus in general. It is a term primarily used in scientific and medical contexts."},"example_sentences":[{"sentence":"The study examined the prevalence of Vibrios in coastal waters.","translation":"その研究では、沿岸水域におけるビブリオ属細菌の蔓延を調査した。","type":"noun","meaning_category":"ビブリオ属細菌（複数形）"},{"sentence":"Certain Vibrios are known to be pathogenic to shellfish.","translation":"特定のビブリオ属細菌は、貝類に対して病原性を持つことが知られている。","type":"noun","meaning_category":"ビブリオ属細菌（複数形）"}]}