{"word":"Satyrism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"男性における病的性欲亢進症、サチリズム","english_definition":"Excessive sexual desire or activity in a male.","examples":[{"sentence":"The patient's satyrism was a symptom of a larger neurological issue.","translation":"その患者のサチリズムは、より大きな神経学的問題の症状でした。"},{"sentence":"Satyrism, while rare, can significantly impact an individual's life.","translation":"サチリズムはまれですが、個人の生活に大きな影響を与える可能性があります。"}],"collocations":["exhibit satyrism","suffer from satyrism","treat satyrism"],"synonyms":["hypersexuality","Don Juanism","erotomania"],"antonyms":["frigidity","hyposexuality"]}],"etymology":{"value":"Derived from 'satyr,' a mythological creature known for its lustful nature, combined with the suffix '-ism,' indicating a condition or characteristic.","priority":"★★☆"},"pronunciation":{"ipa":"ˈsætɪˌrɪzəm","syllables":"sat-y-rism"},"inflection":{"noun_plural":"satyrisms"},"usage_notes":{"explanation":"'Satyrism' is a medical term, primarily used in psychology and psychiatry, to describe an abnormally high sex drive in males. It is the male equivalent of nymphomania in females, although nymphomania is now also considered an outdated and potentially stigmatizing term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed satyrism towards his wife.","correct":"✓ He exhibited satyrism.","note":"'Satyrism' refers to a condition, not an action directed towards someone. It's more accurate to say someone 'exhibits' or 'suffers from' satyrism."}],"priority":"★☆☆"},"related_words":{"derivatives":["satyr (noun: a mythological creature, part man and part goat, known for its lasciviousness)","satyric (adjective: pertaining to or resembling a satyr; lecherous)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Satyrism' is a highly specialized term primarily used in medical and psychological contexts. Understanding requires familiarity with medical terminology and the ability to interpret abstract concepts related to sexual disorders. It is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"His uncontrolled behavior was attributed to satyrism.","translation":"彼の制御不能な行動はサチリズムによるものとされた。","type":"noun","meaning_category":"病的な性欲亢進症"},{"sentence":"The doctor suspected satyrism after the patient described his compulsive sexual urges.","translation":"患者が強迫的な性的衝動について説明した後、医師はサチリズムを疑った。","type":"noun","meaning_category":"病的な性欲亢進症"}]}