{"word":"circumstantially","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"状況証拠に基づいて、状況から判断して、間接的に","english_definition":"depending on circumstances; based on circumstantial evidence rather than direct proof.","examples":[{"sentence":"The case against him was based almost entirely on circumstantially evidence.","translation":"彼に対する訴えは、ほぼ完全に状況証拠に基づいていた。"},{"sentence":"Circumstantially, it seems likely that he was involved.","translation":"状況から判断すると、彼が関与していた可能性が高いと思われる。"},{"sentence":"We can only prove his guilt circumstantially.","translation":"彼の有罪を状況証拠によってのみ証明できる。"}],"collocations":["circumstantially evidence (状況証拠)","circumstantially prove (状況証拠で証明する)","circumstantially linked (状況的に関連している)","circumstantially support (状況的に裏付ける)"],"synonyms":["indirectly","inferentially","deductively","conjecturally","presumptively"],"antonyms":["directly","explicitly","conclusively","definitively"]}],"etymology":{"value":"'Circumstantial' + '-ly'. 'Circumstantial' comes from 'circumstance', which originates from Latin 'circumstantia' (a standing around, condition, attribute), from 'circumstare' (to stand around), from 'circum' (around) + 'stare' (to stand).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɜːrkəmˈstænʃəli/","syllables":"cir-cum-stan-tial-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Circumstantially' is used to describe something that is based on or inferred from surrounding circumstances rather than direct evidence. It often appears in legal or investigative contexts when discussing evidence that suggests a conclusion without proving it directly. The word emphasizes that the conclusion is drawn from a collection of related facts rather than a single, definitive piece of proof.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He circumstantially told the story.","correct":"✓ He told the story in a circumstantial way.","note":"'Circumstantially' modifies the verb relating to how something is proven or inferred, not how a story is told. To describe a detailed story, use 'in a circumstantial way' or 'with many details'."},{"incorrect":"✗ The evidence was circumstantially.","correct":"✓ The evidence was circumstantial.","note":"'Circumstantially' is an adverb. To describe the nature of the evidence, use the adjective 'circumstantial'."}],"priority":"★★☆"},"related_words":{"derivatives":["circumstance (noun)","circumstantial (adjective)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"circumstantially\" means that something is based on circumstances or indirect evidence, rather than direct proof. It's a more advanced word often used in legal or formal contexts. If you're talking about evidence that hints at something but doesn't directly prove it, you might say the evidence supports the claim \"circumstantially.\" This word is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The police were able to circumstantially link the suspect to the crime scene through DNA found nearby.","translation":"警察は、近くで発見されたDNAを通じて、容疑者を状況証拠に基づいて犯罪現場と結びつけることができた。","type":"adverb","meaning_category":"based on circumstantial evidence"},{"sentence":"Although there were no witnesses, the prosecution argued that the defendant's guilt could be proven circumstantially through a series of connected events.","translation":"目撃者はいなかったものの、検察は一連の関連する出来事を通じて、被告の有罪を状況証拠によって証明できると主張した。","type":"adverb","meaning_category":"indirectly"},{"sentence":"The historian pieced together the events of the past circumstantially, relying on letters and documents to infer what had happened.","translation":"歴史家は、何が起こったかを推測するために手紙や文書に頼り、過去の出来事を状況証拠に基づいてつなぎ合わせた。","type":"adverb","meaning_category":"inferentially"}]}