{"word":"Quaker","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"クエーカー教徒、フレンド派教徒","english_definition":"a member of the Religious Society of Friends, a Christian movement founded in England in the 17th century","examples":[{"sentence":"She is a devout Quaker.","translation":"彼女は熱心なクエーカー教徒です。"},{"sentence":"The Quakers are known for their pacifism and social justice activism.","translation":"クエーカー教徒は、平和主義と社会正義運動で知られています。"}],"collocations":["Quaker meeting","Quaker school","Quaker values"],"synonyms":["Friend","member of the Religious Society of Friends"],"antonyms":[]},{"part_of_speech":"adjective","definition":"クエーカー教徒の、フレンド派の","english_definition":"relating to or characteristic of Quakers or their beliefs and practices","examples":[{"sentence":"The Quaker community is very supportive.","translation":"クエーカー教徒のコミュニティは非常に協力的です。"},{"sentence":"Quaker principles of equality and peace are admirable.","translation":"平等と平和というクエーカー教徒の原則は称賛に値します。"}],"collocations":["Quaker principles","Quaker community","Quaker beliefs"],"synonyms":["Friend","Religious Society of Friends"],"antonyms":[]}],"etymology":{"value":"The name 'Quaker' was originally a derogatory term given to members of the Religious Society of Friends in the mid-17th century. It is said to have originated when George Fox, the founder of the movement, told a judge to 'tremble at the word of the Lord.' The name stuck, and Quakers eventually adopted it themselves.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkweɪkər/","syllables":"Quak-er"},"inflection":{"notes":"Plural form of the noun is 'Quakers'"},"usage_notes":{"explanation":"The term 'Quaker' refers to members of the Religious Society of Friends. Quakers are known for their commitment to peace, equality, simplicity, and integrity. They often engage in social justice work and are historically known for their opposition to war and slavery. The term 'Friend' is also used to refer to Quakers, and many Quakers prefer this term.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a quaker of oats.","correct":"✓ He is a Quaker.","note":"'Quaker' refers to a member of the Religious Society of Friends, not to oatmeal. 'Quaker Oats' is a brand name, not the definition of the word 'Quaker' itself."}],"priority":"★★☆"},"related_words":{"derivatives":["Quakerism (クエーカー主義)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but recognizable in historical and cultural contexts.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word 'Quaker' refers to a member of the Religious Society of Friends, a Christian group that began in England in the 17th century. Quakers are known for their beliefs in peace, equality, and simple living. They often work for social justice. The term can be used as a noun to describe a person or as an adjective to describe something related to Quakers. Understanding the historical and cultural context of the word is important for accurate comprehension."},"example_sentences":[{"sentence":"Many Quakers were involved in the abolitionist movement.","translation":"多くのクエーカー教徒が奴隷制度廃止運動に関わっていました。","type":"noun","meaning_category":"クエーカー教徒"},{"sentence":"The Quaker school emphasized peace and non-violence.","translation":"そのクエーカー教徒の学校は、平和と非暴力を重視していました。","type":"adjective","meaning_category":"クエーカー教徒の"}]}