{"word":"oecoparasite","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(生物学) 生態寄生体：宿主の巣や生息地で生活し、宿主自体に寄生する生物。","english_definition":"(biology) An organism that lives in the nest or habitat of its host and parasitizes the host itself.","examples":[{"sentence":"Fleas are a common example of oecoparasites, living in the bedding of animals and feeding on their blood.","translation":"ノミは一般的な生態寄生体の例であり、動物の寝床に生息し、その血液を吸って生きています。"},{"sentence":"Some mites are oecoparasites of bees, living in the hive and feeding on the bees or their larvae.","translation":"一部のダニはミツバチの生態寄生体であり、巣箱に生息し、ミツバチやその幼虫を捕食します。"}],"collocations":["nest oecoparasite","hive oecoparasite"],"synonyms":["nidoparasite"],"antonyms":["endoparasite","parasitoid"]}],"etymology":{"value":"Derived from the Greek 'oeco-' (οἶκος) meaning 'house' or 'habitat', combined with 'parasite' (παράσιτος) meaning 'one who eats at the table of another'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌiːkoʊˈpærəsaɪt/","syllables":"ee-co-par-a-site"},"inflection":{"noun_plural":"oecoparasites"},"usage_notes":{"explanation":"Oecoparasites differ from typical parasites in that they do not live directly on or inside the host's body but rather in the host's immediate environment. This distinction is important in ecological studies and pest management.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The virus is an oecoparasite.","correct":"✓ The flea is an oecoparasite.","note":"Viruses are not oecoparasites; oecoparasites are multicellular organisms that live in the habitat of their host."}],"priority":"★☆☆"},"related_words":{"derivatives":["oecoparasitism"],"related_terms":["parasite","host","nest","habitat","ectoparasite"]},"level_frequency":{"frequency_google_ngram":"Low frequency - Specialized term used primarily in biology and ecology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Oecoparasite' is a specialized term in biology that refers to an organism living in the habitat of its host and parasitizing the host. It's a less common term than 'parasite' or 'ectoparasite', and understanding it requires some background in ecological concepts. The term is used to describe organisms like fleas or certain mites that live in nests or hives and feed on the inhabitants.","priority":"★☆☆"},"example_sentences":[{"sentence":"The researchers studied the oecoparasites in the bird nests.","translation":"研究者たちは鳥の巣にいる生態寄生体を研究しました。","type":"scientific study","meaning_category":"ecology"},{"sentence":"Oecoparasites can significantly impact the health of their hosts.","translation":"生態寄生体は宿主の健康に大きな影響を与える可能性があります。","type":"general statement","meaning_category":"impact"}]}