{"word":"IOCs","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(情報セキュリティ) 侵害指標 (Indicators of Compromise)","english_definition":"(Information Security) Indicators of Compromise; artifacts observed on a network or in an operating system that, with high confidence, indicate a computer security intrusion.","examples":[{"sentence":"Security teams use IOCs to identify and respond to cyber threats.","translation":"セキュリティチームはIOCを使用して、サイバー脅威を特定し、対応します。"},{"sentence":"Common IOCs include unusual network traffic, suspicious file hashes, and registry changes.","translation":"一般的なIOCには、異常なネットワークトラフィック、疑わしいファイルのハッシュ、およびレジストリの変更が含まれます。"},{"sentence":"Threat intelligence platforms often provide updated IOCs to help organizations stay ahead of emerging threats.","translation":"脅威インテリジェンスプラットフォームは、組織が新たな脅威に先んじるのを支援するために、更新されたIOCを提供することがよくあります。"}],"collocations":["threat intelligence","cybersecurity","incident response","malware analysis","network security"],"synonyms":["threat indicators","compromise indicators"],"antonyms":[]}],"etymology":{"value":"IOCsは、\"Indicators of Compromise\"の頭字語です。これは、システムまたはネットワークが侵害された可能性を示す証拠を指す情報セキュリティの用語です。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌaɪˌoʊˈsiːz/","syllables":"I-O-Cs"},"inflection":{"noun_plural":"IOCs (常に複数形で使用されることが多い)","notes":"IOCsは通常、複数形で使用されますが、文脈によっては単数形のIndicator of Compromise (IOC)が使用されることもあります。"},"usage_notes":{"explanation":"IOCs (侵害指標) は、サイバーセキュリティにおいて、システムやネットワークが攻撃を受け、セキュリティが侵害された可能性を示す証拠となる情報です。これらの指標は、セキュリティインシデントの検出、対応、および事後分析に不可欠です。IOCsには、ファイルハッシュ、IPアドレス、ドメイン名、URL、レジストリキー、ユーザーアカウント、ネットワークトラフィックパターンなど、さまざまな種類があります。セキュリティチームは、これらのIOCsを収集、分析し、脅威を特定して軽減するために使用します。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The IOC were found on the server.","correct":"✓ The IOCs were found on the server.","note":"IOCsは通常複数形で使用されるため、動詞も複数形にする必要があります。"},{"incorrect":"✗ We need to analyze the IOC to determine the scope of the breach.","correct":"✓ We need to analyze the IOCs to determine the scope of the breach.","note":"侵害の範囲を特定するためには、通常、複数のIOCを分析する必要があります。"}],"priority":"★★☆"},"related_words":{"derivatives":["IOC (Indicator of Compromise)","threat actor","malware","phishing","ransomware","exploit","vulnerability"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (専門用語)","frequency_google_ngram":"低頻度 (専門分野)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「IOCs」は、情報セキュリティの専門用語で、「侵害指標」を意味します。これは、コンピュータシステムやネットワークが攻撃を受けている、またはすでに攻撃された可能性を示す証拠のことです。例えば、不審なファイル、異常なネットワーク通信、許可されていないプログラムの実行などがIOCsとして挙げられます。セキュリティの専門家は、これらのIOCsを分析して、攻撃を特定し、対応策を講じます。一般の人が日常的に使う言葉ではありません。"},"example_sentences":[{"sentence":"The security analyst identified several IOCs related to the malware infection.","translation":"セキュリティアナリストは、マルウェア感染に関連するいくつかのIOCを特定しました。","type":"noun","meaning_category":"侵害指標"},{"sentence":"Sharing IOCs between organizations is crucial for effective threat intelligence.","translation":"組織間でのIOCの共有は、効果的な脅威インテリジェンスにとって重要です。","type":"noun","meaning_category":"侵害指標"},{"sentence":"The incident response team used the IOCs to contain the breach and prevent further damage.","translation":"インシデント対応チームは、IOCを使用して侵害を封じ込め、さらなる損害を防ぎました。","type":"noun","meaning_category":"侵害指標"}]}