{"word":"undomiciled","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"本籍を持たない、住所不定の、非居住の","english_definition":"Not having a fixed or permanent home or domicile; not resident in a particular jurisdiction for tax or legal purposes.","examples":[{"sentence":"He is an undomiciled resident of the UK, which affects his tax status.","translation":"彼は英国に居住しているものの本籍を持たないため、税務上の地位に影響がある。"},{"sentence":"The company is undomiciled in any specific country.","translation":"その会社は特定の国に本籍を置いていない。"}],"collocations":["undomiciled resident","undomiciled company","undomiciled for tax purposes"],"synonyms":["non-resident","homeless","transient"],"antonyms":["domiciled","resident","settled"]}],"etymology":{"value":"'Un-' (not) + 'domiciled' (having a domicile). 'Domiciled' comes from 'domicile,' which is from Latin 'domus' (house, home).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˈdɒmɪsaɪld/","syllables":"un-dom-i-ciled"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'Undomiciled' is often used in a legal or tax context to describe someone who lives in a country but whose permanent home is considered to be in another country. This can have significant implications for tax liabilities. It is distinct from 'non-resident,' although the terms can overlap.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is undomiciled because he doesn't have a house.","correct":"✓ He is undomiciled because his permanent home is considered to be outside the country, even though he lives here.","note":"'Undomiciled' refers to the location of one's permanent home for legal and tax purposes, not simply whether they have a house."}],"priority":"★★☆"},"related_words":{"derivatives":["domicile (noun)","domiciled (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'undomiciled' is a formal term primarily used in legal and financial contexts. It describes the status of an individual or entity whose permanent home or legal residence is considered to be outside of the jurisdiction in which they currently reside. Understanding this term is important for comprehending international tax law and residency regulations."},"example_sentences":[{"sentence":"Many wealthy individuals seek undomiciled status in countries with favorable tax laws.","translation":"多くの富裕層が、税法が有利な国で非居住者としての地位を求める。","type":"adjective","meaning_category":"本籍を持たない"},{"sentence":"The tax benefits for undomiciled residents can be substantial.","translation":"本籍を持たない居住者に対する税制上の優遇措置は相当なものになる可能性がある。","type":"adjective","meaning_category":"非居住の"}]}