{"word":"Melchizedek","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"メルキゼデク：旧約聖書に登場する祭司であり王。エルサレムの王であり、至高の神の祭司であったと創世記に記述されている。新約聖書（ヘブライ人への手紙）では、イエス・キリストの祭司職の原型として言及される。","english_definition":"A priest and king mentioned in the Old Testament. He was king of Salem and priest of God Most High, according to the Book of Genesis. In the New Testament (Book of Hebrews), he is referenced as a prototype of the priesthood of Jesus Christ.","examples":[{"sentence":"Melchizedek blessed Abram after Abram's victory.","translation":"メルキゼデクはアブラムの勝利の後、アブラムを祝福した。"},{"sentence":"The author of Hebrews argues that Jesus' priesthood is superior to the Levitical priesthood because it is in the order of Melchizedek.","translation":"ヘブライ人への手紙の著者は、イエスの祭司職がレビ族の祭司職よりも優れているのは、メルキゼデクの位階に属するからだと論じている。"}],"collocations":["order of Melchizedek (メルキゼデクの位階)","priesthood of Melchizedek (メルキゼデクの祭司職)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"ヘブライ語 מַלְכִּי־צֶדֶק (malkī-ṣedeq) に由来し、「義の王」または「私の王は義である」を意味する。 מֶלֶךְ (meleḵ) は「王」、צֶדֶק (ṣedeq) は「義」を意味する。","priority":"★★★"},"pronunciation":{"ipa":"/mɛlˈkɪzədɛk/","syllables":"Mel-chiz-e-dek"},"inflection":{"notes":"固有名詞のため、複数形はありません。"},"usage_notes":{"explanation":"「**Melchizedek**」は、聖書において重要な人物であり、特にキリスト教神学において重要な意味を持ちます。創世記における記述は比較的短いですが、ヘブライ人への手紙において、イエス・キリストの祭司職との関連で深く考察されています。神学的な議論や聖書研究において頻繁に言及される名前です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Melchizedek was a Levite priest.","correct":"✓ Melchizedek was not a Levite priest; his priesthood predates the Levitical priesthood.","note":"メルキゼデクはレビ族の祭司ではありません。彼の祭司職はレビ族の祭司職よりも前のものです。"},{"incorrect":"✗ Melchizedek is only mentioned in the Old Testament.","correct":"✓ Melchizedek is mentioned in both the Old Testament (Genesis) and the New Testament (Hebrews).","note":"メルキゼデクは旧約聖書（創世記）と新約聖書（ヘブライ人への手紙）の両方で言及されています。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrases":["order of Melchizedek (メルキゼデクの位階)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (専門的な語彙)","frequency_google_ngram":"低頻度 (Low frequency) - 主に宗教的、神学的な文脈で使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Melchizedek**」は、聖書に登場する人物の名前であり、一般的な語彙ではありません。聖書や神学の研究において言及されることが多く、特にヘブライ人への手紙におけるイエス・キリストの祭司職との関連性が重要です。聖書の知識や神学的な背景がないと理解が難しい単語です。"},"example_sentences":[{"sentence":"Genesis 14 describes Melchizedek bringing bread and wine to Abram.","translation":"創世記14章には、メルキゼデクがアブラムにパンとぶどう酒を持ってきた様子が記述されている。","type":"descriptive","meaning_category":"聖書の記述"},{"sentence":"Some theologians interpret Melchizedek as a pre-incarnate appearance of Christ.","translation":"一部の神学者は、メルキゼデクをキリストの受肉前の姿として解釈している。","type":"theological","meaning_category":"神学的解釈"},{"sentence":"The concept of the priesthood of Melchizedek is central to the Book of Hebrews.","translation":"メルキゼデクの祭司職の概念は、ヘブライ人への手紙の中心的なテーマである。","type":"theological","meaning_category":"神学的概念"}]}