{"word":"Chemisorption","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"化学吸着","english_definition":"A process in which a substance adheres to a surface through the formation of chemical bonds.","examples":[{"sentence":"Chemisorption is used in catalysis to activate reactants.","translation":"化学吸着は、触媒作用において反応物を活性化するために使用されます。"},{"sentence":"The rate of chemisorption depends on the temperature and pressure.","translation":"化学吸着の速度は、温度と圧力に依存します。"},{"sentence":"Chemisorption is a surface phenomenon involving chemical bonding.","translation":"化学吸着は、化学結合を伴う表面現象です。"}],"collocations":["chemisorption isotherm","chemisorption process","dissociative chemisorption","activated chemisorption"],"synonyms":["chemical adsorption"],"antonyms":["physisorption"]}],"etymology":{"value":"A blend of \"chemical\" and \"adsorption\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkiːmaɪˈsɔːrpʃən/","syllables":"ke-mi-sorp-tion"},"inflection":{"noun_plural":"chemisorptions"},"usage_notes":{"explanation":"Chemisorption involves the formation of chemical bonds between the adsorbate (the substance being adsorbed) and the adsorbent (the surface). This is different from physisorption, which involves weaker van der Waals forces. Chemisorption is often irreversible and highly specific.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Chemisorption is same as physisorption.","correct":"✓ Chemisorption is different from physisorption.","note":"Chemisorption involves chemical bonds, while physisorption involves weaker intermolecular forces."},{"incorrect":"✗ Chemisorption is reversible.","correct":"✓ Chemisorption is often irreversible.","note":"Due to the formation of chemical bonds, chemisorption is typically irreversible."}],"priority":"★★☆"},"related_words":{"derivatives":["chemisorb (verb)","chemisorbed (adjective)"],"priority":"★★☆"},"level_frequency":{"level":"Advanced scientific vocabulary","frequency_google_ngram":"Relatively low frequency, primarily used in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Chemisorption' is a technical term used in chemistry and materials science. It refers to the process where a substance adheres to a surface by forming a chemical bond. This is a stronger interaction than physisorption, which involves weaker forces. The term is typically encountered in advanced scientific texts and discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The catalyst's activity is enhanced by the chemisorption of reactants.","translation":"触媒の活性は、反応物の化学吸着によって向上します。","type":"general","meaning_category":"General usage"},{"sentence":"Dissociative chemisorption of hydrogen on the metal surface leads to the formation of metal hydrides.","translation":"金属表面への水素の解離化学吸着は、金属水素化物の形成につながります。","type":"specific","meaning_category":"Specific example"},{"sentence":"The chemisorption isotherm provides information about the surface coverage.","translation":"化学吸着等温線は、表面被覆率に関する情報を提供します。","type":"technical","meaning_category":"Technical context"}]}