{"word":"heterosexism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"異性愛規範主義、異性愛中心主義：異性愛が他の性的指向よりも自然で優れているという信念、またはその信念に基づく差別や偏見。","english_definition":"prejudice in favor of heterosexual people and against homosexual or bisexual people. Belief in the inherent superiority of heterosexuality and thereby its right to dominance.","examples":[{"sentence":"Heterosexism is often manifested through microaggressions and assumptions about someone's sexual orientation.","translation":"異性愛規範主義は、マイクロアグレッションや、誰かの性的指向に関する決めつけを通して現れることが多い。"},{"sentence":"The school's policies were criticized for promoting heterosexism and excluding LGBTQ+ students.","translation":"その学校の政策は、異性愛規範主義を助長し、LGBTQ+の生徒を排除しているとして批判された。"},{"sentence":"Challenging heterosexism requires acknowledging and valuing diverse sexual orientations and gender identities.","translation":"異性愛規範主義に異議を唱えるには、多様な性的指向とジェンダーアイデンティティを認識し、尊重する必要がある。"}],"collocations":["internalized heterosexism (内面化された異性愛規範主義)","institutional heterosexism (制度的異性愛規範主義)","combat heterosexism (異性愛規範主義と闘う)","challenge heterosexism (異性愛規範主義に異議を唱える)","perpetuate heterosexism (異性愛規範主義を永続させる)"],"synonyms":["homophobia (同性愛嫌悪 - より強い嫌悪感情を含む場合がある)","sexual prejudice (性的偏見)","heteronormativity (異性愛規範)","gender binarism (ジェンダー二元論 - 関連概念)"],"antonyms":["inclusion (包容)","equality (平等)","acceptance (受容)","diversity (多様性)"],"related_terms":["homophobia","transphobia","biphobia","LGBTQ+","sexual orientation","gender identity","discrimination","prejudice","microaggression"]}],"etymology":{"value":"\"heterosexual\"（異性愛の）と \"-ism\"（主義、思想）の組み合わせ。異性愛が標準であるという考え方を指す言葉として作られた。","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɛtərəˈsɛksɪzəm/","syllables":"het-er-o-sex-is-m"},"inflection":{"noun_plural":"heterosexisms (複数形は一般的ではない)"},"usage_notes":{"explanation":"Heterosexism is a system of attitudes, bias, and discrimination in favor of opposite-sex sexuality and relationships. It can include the assumption that everyone is heterosexual, or that opposite-sex relationships are superior. It is often subtle and ingrained in societal structures and norms. It is related to but distinct from homophobia, which is a fear or hatred of LGBTQ+ people. Heterosexism is the system that enables homophobia.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Heterosexism is just a personal opinion, not a form of discrimination.","correct":"✓ Heterosexism can manifest as discrimination, even if it's based on personal beliefs.","note":"異性愛規範主義は個人的な意見に基づく場合でも、差別として現れる可能性がある。"},{"incorrect":"✗ Heterosexism only affects gay men.","correct":"✓ Heterosexism affects anyone who doesn't conform to heterosexual norms, including lesbians, bisexual individuals, and transgender people.","note":"異性愛規範主義は、異性愛の規範に適合しないすべての人に影響を与える。"},{"incorrect":"✗ I'm not heterosexist, I just prefer dating people of the opposite sex.","correct":"✓ Preferring to date the opposite sex is not heterosexist in itself, but assuming that everyone else should do the same or that it's the 'right' way to be is.","note":"異性とデートすることを好むこと自体は異性愛規範主義ではないが、他の人もそうすべきだ、またはそれが「正しい」生き方だと仮定することはそうである。"}],"priority":"★★☆"},"related_words":{"derivatives":["heterosexist (形容詞：異性愛規範主義的な)","heteronormative (形容詞：異性愛規範的な)"],"related_terms":["cisnormativity (シスジェンダー規範)","ableism (障害者差別)","sexism (性差別)","racism (人種差別)","ageism (年齢差別)"],"phrases":["heterosexist privilege (異性愛規範主義的特権)"]},"level_frequency":{"CEFR":"C1-C2 (社会科学、ジェンダー研究などの分野で使われる専門用語)","frequency_google_ngram":"比較的低頻度 (Relatively low frequency) - 特定の分野で使われる専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Heterosexism' refers to the belief that heterosexuality is the normal and superior sexual orientation. It's a system of beliefs and practices that favor heterosexuals and can lead to discrimination or prejudice against people with other sexual orientations, such as homosexuals or bisexuals. It's often seen as a subtle form of bias that can be embedded in social structures and institutions. Understanding heterosexism is important for promoting equality and inclusivity for all individuals, regardless of their sexual orientation."},"example_sentences":[{"sentence":"The company's lack of same-sex partner benefits was seen as an example of **heterosexism**.","translation":"その会社の同性パートナーへの福利厚生の欠如は、異性愛規範主義の一例と見なされた。","type":"noun","meaning_category":"異性愛規範主義の例"},{"sentence":"The speaker challenged the audience to recognize and confront **heterosexism** in their own lives.","translation":"講演者は、聴衆に対し、自身の生活の中で異性愛規範主義を認識し、立ち向かうよう呼びかけた。","type":"noun","meaning_category":"異性愛規範主義への挑戦"},{"sentence":"Many LGBTQ+ activists work to dismantle **heterosexism** and create a more equitable society.","translation":"多くのLGBTQ+活動家は、異性愛規範主義を解体し、より公平な社会を創造するために活動している。","type":"noun","meaning_category":"異性愛規範主義の解体"}]}