{"word":"holliper","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare) A person who dances or cavorts in a wild or unrestrained manner; a reveler.","english_definition":"A person who dances or cavorts in a wild or unrestrained manner; a reveler.","examples":[{"sentence":"The bonfire attracted hollippers from all around, their laughter echoing through the night.","translation":"そのかがり火は周囲から騒ぎ立てる人々を引き寄せ、その笑い声は夜に響き渡った。"}],"collocations":["wild holliper","merry holliper"],"synonyms":["reveler","carouser","merrymaker","bacchant"],"antonyms":["ascetic","recluse"]}],"etymology":{"value":"Origin uncertain; possibly a fanciful formation or a dialectal term.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈhɒlɪpər/","syllables":"hol-li-per"},"inflection":{"noun_plural":"hollippers"},"usage_notes":{"explanation":"The word 'holliper' is quite rare and not commonly used in modern English. It evokes a sense of unrestrained joy and celebration, often associated with festivals or gatherings. It is more likely to be found in older texts or regional dialects.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The holliper was hollipping around the fire.","correct":"✓ The holliper was reveling around the fire.","note":"Since 'holliper' is a noun, use a more common verb like 'reveling' to describe the action."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["revelry","carousal","festivity"]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Holliper' is an obscure word, unlikely to be encountered except in specialized or historical contexts. Understanding it requires a grasp of less common vocabulary related to celebration and unrestrained behavior. Due to its rarity, it is not suitable for general use."},"example_sentences":[{"sentence":"The painting depicted a scene of rustic revelry, with several hollippers dancing around a maypole.","translation":"その絵は田舎のどんちゃん騒ぎの場面を描いており、数人の騒ぎ立てる人々がメイポール（五月柱）の周りで踊っていた。","type":"noun","meaning_category":"reveler"},{"sentence":"Though old and frail, he still had the spirit of a holliper at heart.","translation":"年老いて虚弱ではあったが、彼はまだ心の奥底に騒ぎ立てる人の精神を持っていた。","type":"noun","meaning_category":"reveler"}]}