{"word":"halation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ハレーション (写真、映画などで、強い光の周囲に発生する光のにじみ)","english_definition":"A blurring or halo effect in a photographic image, caused by light scattering within the emulsion or other layers of the film or sensor.","examples":[{"sentence":"The bright lights caused significant halation in the photograph.","translation":"強い光のために、写真にはかなりのハレーションが発生した。"},{"sentence":"Halation can be reduced by using anti-halation backing on the film.","translation":"ハレーションは、フィルムの裏面にハレーション防止層を使用することで軽減できる。"}],"collocations":["anti-halation backing","halation effect","halation artifact"],"synonyms":["blurring","blooming","halation effect","halation artifact","light scattering"],"antonyms":["sharpness","clarity","definition"]}],"etymology":{"value":"Derived from 'halo' (光輪) + '-ation' (名詞を作る接尾辞). The term describes the halo-like effect that occurs around bright areas in an image.","priority":"★★☆"},"pronunciation":{"ipa":"/heɪˈleɪʃən/","syllables":"ha-la-tion"},"inflection":{"noun_plural":"halations"},"usage_notes":{"explanation":"Halation is a photographic phenomenon that occurs when light passes through the emulsion layer of film or a digital sensor and reflects off the back surface, causing a halo or blurring effect around bright areas in the image. It is more noticeable with older film technologies and can be minimized with anti-halation backing or digital image processing techniques.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The image had a lot of flares. It must be halation.","correct":"✓ The image had a lot of flares. It must be lens flare.","note":"Halation is a blurring or halo effect *around* bright areas, whereas lens flare are distinct artifacts caused by light reflecting within the lens elements. They are different phenomena."},{"incorrect":"✗ The halation made the image more sharp.","correct":"✓ The halation made the image less sharp.","note":"Halation reduces sharpness and clarity, so it cannot make an image sharper."}],"priority":"★★☆"},"related_words":{"derivatives":["halide (ハロゲン化物 - 関連する化学物質)","halo (光輪 - ハレーションの語源)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Technical term)","frequency_google_ngram":"Low frequency (専門用語)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Halation' is a technical term used in photography and cinematography. It refers to the blurring or halo effect that appears around bright light sources in an image. This effect is caused by light scattering within the film emulsion or digital sensor. The term is primarily used by photographers, cinematographers, and those involved in image processing. Understanding halation is important for correcting or preventing it in images.","priority":"★★★"},"example_sentences":[{"sentence":"The old film stock was prone to **halation** around bright highlights.","translation":"その古いフィルムは、明るいハイライトの周りにハレーションが発生しやすかった。","type":"noun","meaning_category":"光のにじみ"},{"sentence":"Digital image processing can be used to reduce **halation** in scanned film photographs.","translation":"デジタル画像処理を使って、スキャンしたフィルム写真のハレーションを軽減することができる。","type":"noun","meaning_category":"光のにじみ"},{"sentence":"The effect of **halation** is more pronounced in high-contrast scenes.","translation":"ハレーションの影響は、コントラストの高いシーンでより顕著になる。","type":"noun","meaning_category":"光のにじみ"}]}