{"word":"mutinously","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"反抗的に、反乱的に、不服従に","english_definition":"in a rebellious or insubordinate manner; showing or involving a refusal to obey orders or rules.","examples":[{"sentence":"The crew acted mutinously, refusing to follow the captain's orders.","translation":"乗組員は反抗的な態度を取り、船長の命令に従うことを拒否した。"},{"sentence":"He stared mutinously at his plate, refusing to eat his vegetables.","translation":"彼は反抗的な目で皿を見つめ、野菜を食べるのを拒んだ。"},{"sentence":"The students responded mutinously to the new school regulations.","translation":"学生たちは新しい校則に対して反抗的な反応を示した。"}],"collocations":["act mutinously","stare mutinously","respond mutinously","behave mutinously"],"synonyms":["rebelliously","insubordinately","disobediently","defianty","resistantly"],"antonyms":["obediently","submissively","dutifully","compliantly"]}],"etymology":{"value":"The word 'mutinously' is derived from 'mutinous,' which comes from 'mutiny.' 'Mutiny' originates from the Old French word 'mutin,' meaning 'rebellious' or 'insubordinate.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmjuːtɪnəsli/","syllables":"mu-ti-nous-ly"},"inflection":{"notes":"Adverb; no inflection"},"usage_notes":{"explanation":"'Mutinously' describes an action or behavior that demonstrates a refusal to obey authority or follow established rules. It implies a spirit of rebellion and defiance. It is often used to describe the behavior of groups, such as a ship's crew, but can also describe individual actions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He mutinously acted.","correct":"✓ He acted mutinously.","note":"Adverbs typically modify verbs and are often placed after the verb or at the end of the clause for emphasis."},{"incorrect":"✗ The mutinously behavior was unacceptable.","correct":"✓ The mutinous behavior was unacceptable.","note":"'Mutinously' is an adverb, while 'mutinous' is the adjective form. Use the adjective to describe the behavior itself."}],"priority":"★★☆"},"related_words":{"derivatives":["mutiny (noun: an open rebellion against the proper authorities, especially by soldiers or sailors)","mutinous (adjective: refusing to obey the orders of a person in authority)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'mutinously' is an adverb describing actions done in a rebellious or insubordinate way. It's derived from 'mutiny,' which means an open rebellion against authority, especially in a military context. Therefore, 'mutinously' implies a strong resistance to orders or rules, often with a clear show of defiance. It is not a commonly used word and is more likely to appear in literature or historical contexts dealing with rebellion or disobedience. Understanding the root word 'mutiny' is helpful in grasping the meaning of 'mutinously.'"},"example_sentences":[{"sentence":"The soldiers glared **mutinously** at their commanding officer, making their discontent clear.","translation":"兵士たちは不満をあらわにするように、反抗的な目で指揮官を睨みつけた。","type":"adverb","meaning_category":"反抗的に"},{"sentence":"She slammed the door **mutinously** after being told she couldn't go to the party.","translation":"彼女はパーティーに行けないと言われた後、反抗的にドアをバタンと閉めた。","type":"adverb","meaning_category":"反抗的に"},{"sentence":"The workers stood **mutinously** by their machines, refusing to work until their demands were met.","translation":"労働者たちは要求が満たされるまで作業を拒否し、反抗的に機械のそばに立っていた。","type":"adverb","meaning_category":"反抗的に"}]}