{"word":"welfarism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"福祉主義","english_definition":"The belief or practice that a government should play a significant role in providing for the welfare of its citizens, especially through social programs.","examples":[{"sentence":"Welfarism aims to reduce poverty and inequality through state intervention.","translation":"福祉主義は、国家の介入を通じて貧困と不平等を削減することを目指しています。"},{"sentence":"The debate over welfarism often centers on the balance between individual responsibility and government support.","translation":"福祉主義に関する議論は、しばしば個人の責任と政府の支援のバランスに焦点を当てています。"},{"sentence":"Critics of welfarism argue that it can create dependency on the state.","translation":"福祉主義の批判者たちは、それが国家への依存を生み出す可能性があると主張しています。"}],"collocations":["social welfarism (社会福祉主義)","state welfarism (国家福祉主義)","welfarism policy (福祉政策)","expand welfarism (福祉を拡大する)","reduce welfarism (福祉を削減する)"],"synonyms":["social democracy","socialism (in some contexts)","social welfare","public assistance"],"antonyms":["laissez-faire capitalism","individualism","libertarianism","free market capitalism"]}],"etymology":{"value":"Derived from 'welfare' (well-being, good fortune, or happiness) and the suffix '-ism' (denoting a belief, principle, or ideology).","priority":"★★★"},"pronunciation":{"ipa":"/ˈwɛlˌfɛərɪzəm/","syllables":"wel-fare-ism"},"inflection":{"notes":"Uncountable noun."},"usage_notes":{"explanation":"'Welfarism' refers to a political and economic system where the state takes an active role in protecting and promoting the economic and social well-being of its citizens. This typically involves providing social services such as healthcare, education, unemployment benefits, and housing assistance. The term is often used in discussions about the role of government in society and the extent to which the state should intervene in the economy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She supports welfareism because she is a welfare.","correct":"✓ She supports welfarism because she believes in social welfare.","note":"'Welfare' is a state of well-being or assistance, while 'welfarism' is the ideology. 'Welfare' is not a person."},{"incorrect":"✗ Welfarism is when the government does everything.","correct":"✓ Welfarism is when the government plays a significant role in providing social services.","note":"Welfarism does not imply the government does 'everything,' but rather plays a significant role in social welfare."}],"priority":"★★☆"},"related_words":{"derivatives":["welfare (noun, adjective)","welfare state (noun)","welfarist (noun, adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in academic and political contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Welfarism' is a term used to describe a political system where the government plays a significant role in providing social and economic support to its citizens. It involves policies and programs aimed at ensuring a basic standard of living, healthcare, education, and other essential services. This term is often used in discussions about political ideologies and the role of government in society. Understanding 'welfarism' requires familiarity with concepts like social welfare, social democracy, and state intervention.","priority":"★★☆"},"example_sentences":[{"sentence":"The rise of welfarism in Europe after World War II led to significant improvements in living standards.","translation":"第二次世界大戦後のヨーロッパにおける福祉主義の台頭は、生活水準の大幅な向上につながりました。","type":"general","meaning_category":"historical context"},{"sentence":"The government's welfarism policies have been criticized for being unsustainable in the long term.","translation":"政府の福祉主義政策は、長期的には持続可能でないとして批判されています。","type":"political","meaning_category":"policy criticism"},{"sentence":"Welfarism is often contrasted with more market-oriented approaches to social and economic policy.","translation":"福祉主義は、社会経済政策に対するより市場志向のアプローチとしばしば対比されます。","type":"theoretical","meaning_category":"comparison"},{"sentence":"Many Scandinavian countries are known for their strong commitment to welfarism.","translation":"多くのスカンジナビア諸国は、福祉主義への強いコミットメントで知られています。","type":"geographical","meaning_category":"national examples"}]}