{"word":"natalism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"出産奨励主義、出生主義：出生率の低下を問題視し、出産や育児を奨励する思想または政策","english_definition":"A belief or policy that promotes human reproduction, often with the goal of increasing the population or preventing its decline.","examples":[{"sentence":"The government's natalist policies include financial incentives for families with children.","translation":"政府の出産奨励政策には、子供を持つ家族への経済的インセンティブが含まれている。"},{"sentence":"Some argue that natalism is necessary to maintain a stable workforce and support the elderly population.","translation":"出生主義は、安定した労働力を維持し、高齢者人口を支えるために必要であると主張する人もいる。"},{"sentence":"Pronatalism is often associated with conservative social values and a concern about national identity.","translation":"出産奨励主義は、保守的な社会価値観や国家アイデンティティへの懸念と関連付けられることが多い。"}],"collocations":["pro-natalism","natalist policy","anti-natalism","demographic decline","population growth","fertility rate","birth rate"],"synonyms":["pronatalism","procreationism"],"antonyms":["antinatalism","childfree movement","voluntary human extinction movement (VHEMT)"]},{"part_of_speech":"noun","definition":"（より広義には）出生を肯定的に捉える思想","english_definition":"(More broadly) any ideology that views childbirth as positive.","examples":[{"sentence":"Even without explicit policies, a culture can exhibit natalism through its emphasis on family and children.","translation":"明示的な政策がなくても、文化は家族や子供を重視することで出生を肯定的に捉える思想を示すことがある。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From Latin *natalis* meaning 'relating to birth', plus *-ism* indicating a belief or ideology.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈneɪtəlɪzəm/","syllables":"na-tal-ism"},"inflection":{"noun_plural":"natalisms"},"usage_notes":{"explanation":"Natalism is often used in discussions about population trends, social policy, and ethical considerations related to reproduction. It can be a controversial topic, with proponents arguing for its necessity in addressing demographic challenges and critics raising concerns about individual autonomy and environmental sustainability. The term is often used in contrast to antinatalism, which is the view that procreation is morally wrong or undesirable.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Natalism is about hating children.","correct":"✓ Natalism is about promoting childbirth and larger families.","note":"Natalism is not about hating children; it's about encouraging people to have more children. Antinatalism is the view that having children is morally wrong."},{"incorrect":"✗ Natalism is the same as nationalism.","correct":"✓ Natalism is related to population, while nationalism is related to national identity.","note":"While natalism can sometimes be linked to nationalism, they are distinct concepts. Natalism focuses on increasing birth rates, while nationalism focuses on national identity and interests."}],"priority":"★★☆"},"related_words":{"derivatives":["natalist (adjective, noun)","pronatalist (adjective, noun)","antinatalist (adjective, noun)","natality (noun)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Natalism' refers to the belief or policy that encourages people to have children. It's often discussed in the context of countries with declining birth rates. People who support natalism might believe it's important for economic growth or cultural preservation. It's a more complex idea than simply liking children; it involves thinking about the bigger picture of society and population. The opposite of natalism is antinatalism, which is the belief that having children is morally wrong or undesirable."},"example_sentences":[{"sentence":"France has implemented several **natalist** policies, such as subsidized childcare, to encourage higher birth rates.","translation":"フランスは、出生率を高めるために、保育費の補助金など、いくつかの出産奨励政策を実施している。","type":"adjective","meaning_category":"出産奨励の"},{"sentence":"Some historians argue that ancient Rome's expansion was fueled by a strong **natalist** culture.","translation":"一部の歴史家は、古代ローマの拡大は、強力な出産奨励文化によって促進されたと主張している。","type":"adjective","meaning_category":"出産奨励の"},{"sentence":"The debate over **natalism** often involves discussions about women's reproductive rights and economic opportunities.","translation":"出産奨励主義に関する議論には、女性の生殖に関する権利や経済的機会についての議論がしばしば含まれる。","type":"noun","meaning_category":"出産奨励主義"}]}