{"word":"preacquisitiveness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(通常好ましくない意味で)過度な取得欲、先取りしようとする性質、強欲さ","english_definition":"Excessive acquisitiveness, especially in anticipation of future needs or opportunities; eagerness to acquire something before others.","examples":[{"sentence":"His preacquisitiveness led him to buy up all the available land in the area, driving up prices for everyone else.","translation":"彼の過度な取得欲は、その地域の利用可能な土地をすべて買い占めさせ、他の人々のために価格をつり上げた。"},{"sentence":"The company's preacquisitiveness in the tech market raised concerns about monopolistic practices.","translation":"その会社のテクノロジー市場における先取りしようとする性質は、独占的な慣行についての懸念を高めた。"}],"collocations":["excessive preacquisitiveness","demonstrate preacquisitiveness","fueled by preacquisitiveness"],"synonyms":["greed","avarice","cupidity","materialism","rapacity","possessiveness","covetousness"],"antonyms":["generosity","altruism","selflessness","charity","philanthropy"]}],"etymology":{"value":"\"pre-\" (before) + \"acquisitiveness\" (desire to acquire possessions). The word suggests an eagerness to acquire things, often before they are needed or available to others.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriː.əˈkwɪzɪtɪvnəs/","syllables":"pre-ac-qui-si-tive-ness"},"inflection":{"noun_plural":"preacquisitiveness (uncountable)"},"usage_notes":{"explanation":"\"Preacquisitiveness\" describes a strong desire to acquire possessions or advantages, often with a sense of urgency or anticipation. It often carries a negative connotation, suggesting that the individual is overly concerned with accumulating wealth or resources, potentially at the expense of others. It is less commonly used than simpler words like \"greed\" or \"avarice,\" but it provides a more specific nuance of acquiring something in advance or before others can.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ His preacquisitiveness was admired by everyone.","correct":"✓ His preacquisitiveness was criticized by many.","note":"Because \"preacquisitiveness\" usually implies a negative trait, it is rarely admired. It's more often associated with criticism or disapproval."},{"incorrect":"✗ She showed a little preacquisitiveness when choosing a gift.","correct":"✓ She showed a little eagerness when choosing a gift.","note":"\"Preacquisitiveness\" implies a strong, often excessive desire. If the desire is mild, use words like \"eagerness\" or \"interest\" instead."}],"priority":"★★☆"},"related_words":{"derivatives":["acquisitive (adjective: having a strong desire to acquire things)","acquisitively (adverb: in an acquisitive manner)","acquisitiveness (noun: the quality of being acquisitive)"],"phrases":["demonstrate preacquisitiveness","motivated by preacquisitiveness","driven by preacquisitiveness"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (rare and specialized vocabulary)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Preacquisitiveness\" is a complex word describing an excessive desire to acquire things, often before others or in anticipation of future needs. It's a formal term that suggests a strong, often negative, focus on accumulating possessions or advantages. This word is not commonly used in everyday conversation and is more likely to be encountered in academic or specialized contexts."},"example_sentences":[{"sentence":"The investor's preacquisitiveness was evident in his aggressive pursuit of undervalued assets.","translation":"その投資家の過度な取得欲は、過小評価された資産を積極的に追求する姿勢に明らかだった。","type":"noun","meaning_category":"過度な取得欲"},{"sentence":"Her preacquisitiveness for knowledge led her to enroll in multiple courses simultaneously.","translation":"彼女の知識に対する先取りしようとする性質は、彼女を複数のコースに同時に入学させた。","type":"noun","meaning_category":"先取りしようとする性質"},{"sentence":"The company's preacquisitiveness in acquiring smaller competitors stifled innovation in the industry.","translation":"その会社の小規模な競合他社を買収しようとする強欲さは、業界のイノベーションを抑制した。","type":"noun","meaning_category":"強欲さ"}]}