{"word":"nitrate-enriched","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"硝酸塩が強化された、硝酸塩が豊富にされた","english_definition":"Having had nitrates added to it or having a higher concentration of nitrates than is naturally occurring.","examples":[{"sentence":"Nitrate-enriched foods are sometimes used to improve athletic performance.","translation":"硝酸塩が強化された食品は、運動能力を向上させるために使用されることがあります。"},{"sentence":"The study examined the effects of nitrate-enriched beetroot juice on blood pressure.","translation":"その研究では、硝酸塩が強化されたビーツジュースが血圧に及ぼす影響を調べました。"}],"collocations":["nitrate-enriched fertilizer","nitrate-enriched water","nitrate-enriched diet"],"synonyms":["nitrate-enhanced","nitrate-fortified"],"antonyms":["nitrate-depleted","nitrate-poor"]}],"etymology":{"value":"Derived from the combination of 'nitrate' (a salt or ester of nitric acid) and 'enriched' (having something added to increase its value or concentration).","priority":"N/A"},"pronunciation":{"ipa":"/ˈnaɪtreɪt ɪnˈrɪtʃt/","syllables":"ni-trate in-riched"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb or noun."},"usage_notes":{"explanation":"'Nitrate-enriched' describes something that has had nitrates added to it to increase its concentration. It is commonly used in the context of food, water, or fertilizers. The term implies a deliberate process of increasing the nitrate content for a specific purpose, such as improving crop yield or enhancing athletic performance.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The nitrate-enrich food.","correct":"✓ The nitrate-enriched food.","note":"'Enriched' is a past participle used as an adjective, so it should be 'nitrate-enriched' not 'nitrate-enrich'."}],"priority":"N/A"},"related_words":{"derivatives":["enrichment (noun)","nitrate (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, technical term.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'nitrate-enriched' is a technical term, primarily used in scientific, agricultural, and nutritional contexts. It describes a substance (e.g., food, water, fertilizer) to which nitrates have been added to increase the concentration of nitrates. Understanding this term requires familiarity with basic chemistry and the role of nitrates in various applications."},"example_sentences":[{"sentence":"The athletes consumed nitrate-enriched supplements before the competition.","translation":"選手たちは試合前に硝酸塩が強化されたサプリメントを摂取しました。","type":"general","meaning_category":"general"},{"sentence":"Nitrate-enriched irrigation water can improve crop yields.","translation":"硝酸塩が強化された灌漑用水は、作物の収量を改善することができます。","type":"agricultural","meaning_category":"agricultural"}]}