{"word":"eburnated","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"象牙質の、象牙のような","english_definition":"Having a smooth, hard, ivory-like appearance or texture.","examples":[{"sentence":"The bone surface was eburnated due to chronic friction.","translation":"慢性的な摩擦により、骨の表面は象牙質化した。"},{"sentence":"Eburnated bone is often seen in advanced osteoarthritis.","translation":"象牙質化した骨は、進行した変形性関節症によく見られる。"}],"collocations":["eburnated bone (象牙質化した骨)","eburnated surface (象牙質化した表面)"],"synonyms":["ivory-like","polished","smooth","hardened"],"antonyms":["rough","uneven","porous"]}],"etymology":{"value":"From Latin *eburneus* meaning 'of ivory', from *ebur* meaning 'ivory'. The suffix '-ated' indicates a state or condition of being like ivory.","priority":"★★☆"},"pronunciation":{"ipa":"ˈiːbərˌneɪtɪd","syllables":"e-bur-na-ted"},"inflection":{"notes":"This is an adjective, so it has comparative and superlative forms, though they are rarely used: more eburnated, most eburnated."},"usage_notes":{"explanation":"'Eburnated' is primarily used in medical and scientific contexts, particularly in describing the appearance of bone in cases of osteoarthritis or other conditions involving chronic friction or wear. It refers to the bone taking on a smooth, dense, and ivory-like quality. It is not commonly used in everyday language.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The eburnated wood gave the furniture a unique look.","correct":"✓ The polished wood gave the furniture a unique look.","note":"'Eburnated' specifically refers to a bone-like or ivory-like appearance. Use 'polished' or another more general term for wood or other materials."}],"priority":"★★☆"},"related_words":{"derivatives":["eburnation (noun: the process of becoming eburnated)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Eburnated' is a highly specialized term primarily used in medical and scientific fields, particularly in the context of describing bone conditions like osteoarthritis. It describes the bone's surface as having a smooth, hard, and ivory-like appearance due to chronic friction or wear. Due to its specific usage, it is not commonly encountered in general English contexts."},"example_sentences":[{"sentence":"The X-ray showed significant eburnation of the femoral head.","translation":"レントゲン写真では、大腿骨頭の著しい象牙質化が認められた。","type":"general","meaning_category":"describing bone condition"},{"sentence":"Microscopic examination revealed an eburnated surface on the cartilage.","translation":"顕微鏡検査により、軟骨表面の象牙質化が明らかになった。","type":"medical","meaning_category":"medical description"}]}