{"word":"unsustainably-managed","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"持続不可能な方法で管理されている","english_definition":"Managed or operated in a way that cannot be maintained at the current rate or level without depleting resources or causing environmental damage.","examples":[{"sentence":"The forest was unsustainably-managed, leading to deforestation and soil erosion.","translation":"その森林は持続不可能な方法で管理されていたため、森林破壊と土壌浸食につながった。"},{"sentence":"Unsustainably-managed fisheries can collapse, harming both the ecosystem and the local economy.","translation":"持続不可能な方法で管理された漁業は崩壊し、生態系と地域経済の両方に悪影響を及ぼす可能性がある。"},{"sentence":"The company's unsustainably-managed practices were criticized by environmental groups.","translation":"その企業の持続不可能な経営慣行は、環境保護団体から批判された。"}],"collocations":["unsustainably-managed resources","unsustainably-managed forests","unsustainably-managed fisheries","unsustainably-managed agriculture"],"synonyms":["poorly-managed","irresponsibly-managed","exploitatively-managed","depletively-managed"],"antonyms":["sustainably-managed","responsibly-managed","conservatively-managed","ecologically-managed"]}],"etymology":{"value":"Formed by combining 'unsustainably' (in a manner that cannot be sustained) and 'managed' (controlled or directed).","priority":"Low"},"pronunciation":{"ipa":"/ˌʌnsəˈsteɪnəbli ˈmænɪdʒd/","syllables":"un-suh-stain-uh-bli man-aged"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"The term 'unsustainably-managed' is typically used to describe resources, ecosystems, or industries that are being exploited or operated in a way that compromises their long-term viability. It implies a lack of consideration for environmental or social consequences, often driven by short-term economic gains.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is unsustainably managed.","correct":"✓ The company's resources are unsustainably-managed.","note":"It's more precise to specify what is being managed unsustainably (e.g., resources, forests, fisheries) rather than saying the company itself is unsustainably managed."}],"priority":"Low"},"related_words":{"derivatives":["sustainability","sustainable","unsustainable","management"],"related_terms":["environmental degradation","resource depletion","deforestation","overfishing","ecological damage"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Unsustainably-managed' describes something that is handled in a way that cannot continue without causing harm or using up resources too quickly. It's often used in discussions about the environment, business, or resources. It implies a lack of long-term planning or concern for the consequences."},"example_sentences":[{"sentence":"The unsustainably-managed water resources led to severe droughts in the region.","translation":"持続不可能な方法で管理された水資源は、その地域で深刻な干ばつを引き起こした。","type":"adjective","meaning_category":"Environmental Management"},{"sentence":"Unsustainably-managed agricultural practices can deplete soil nutrients and reduce crop yields.","translation":"持続不可能な方法で管理された農業慣行は、土壌の栄養分を枯渇させ、作物の収量を減少させる可能性がある。","type":"adjective","meaning_category":"Agriculture"},{"sentence":"The unsustainably-managed logging operations destroyed vast areas of rainforest.","translation":"持続不可能な方法で管理された伐採作業は、広大な熱帯雨林を破壊した。","type":"adjective","meaning_category":"Forestry"}]}