{"word":"Baalshem","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"バアル・シェム、バアル・シェム・トヴ。ユダヤ教における神秘主義的な治療者、奇跡を行う者の称号。特に、ハシディズムの創始者であるイスラエル・ベン・エリエゼル（バアル・シェム・トヴ）を指すことが多い。","english_definition":"A title given to Jewish mystics and miracle workers, particularly those known for their healing abilities. Most notably associated with Israel ben Eliezer, the founder of Hasidism, who is often referred to as the Baal Shem Tov.","examples":[{"sentence":"The Baalshem was known for his ability to heal the sick.","translation":"バアル・シェムは病人を癒す能力で知られていた。"},{"sentence":"Stories of the Baalshem's miracles are central to Hasidic tradition.","translation":"バアル・シェムの奇跡の物語は、ハシディズムの伝統の中心である。"}],"collocations":["Baal Shem Tov (バアル・シェム・トヴ)","stories of the Baalshem (バアル・シェムの物語)","teachings of the Baalshem (バアル・シェムの教え)"],"synonyms":["healer","miracle worker","mystic","Baal Shem Tov"],"antonyms":[]}],"etymology":{"value":"ヘブライ語の בעל שם (ba'al shem) に由来し、「名前の所有者」または「名前の達人」を意味する。ここで「名前」とは、神の名、特に神秘的な力を持つとされる神聖な名前を指す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɑːl ˈʃɛm/","syllables":"Baal-shem"},"inflection":{"notes":"単数形のみ。複数形は通常用いない。"},"usage_notes":{"explanation":"「**Baalshem**」は、ユダヤ教、特にハシディズムの文脈で用いられる称号です。神秘的な知識や力を持つ人物、特に病気を癒したり奇跡を起こしたりする能力を持つ者に与えられます。最も有名なバアル・シェムは、18世紀の神秘家であり、ハシディズムの創始者であるイスラエル・ベン・エリエゼル（バアル・シェム・トヴ）です。彼に関する物語や教えは、ハシディズムの信仰と実践において重要な役割を果たしています。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Baalshems are common in modern Judaism.","correct":"✓ The title Baalshem refers to specific individuals in Jewish history, particularly in Hasidism.","note":"「Baalshem」は一般的な称号ではなく、特定の歴史的人物、特にバアル・シェム・トヴに関連付けられています。"},{"incorrect":"✗ Baalshem is a type of rabbi.","correct":"✓ Baalshem were often healers and mystics, but not necessarily rabbis.","note":"バアル・シェムは必ずしもラビ（律法学者）であるとは限りません。彼らはむしろ、癒しや神秘的な実践で知られていました。"}],"priority":"★★☆"},"related_words":{"derivatives":["Baal Shem Tov (バアル・シェム・トヴ)","Hasidism (ハシディズム)","Kabbalah (カバラ)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (専門的な用語のため)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - ユダヤ教、特にハシディズム関連の文脈でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**Baalshem**」は、ユダヤ教の神秘主義、特にハシディズムの文脈でのみ使用される専門用語です。この称号は、神秘的な知識や力、特に癒しの能力を持つ人物に与えられます。最も有名なバアル・シェムは、ハシディズムの創始者であるイスラエル・ベン・エリエゼル（バアル・シェム・トヴ）です。この単語を理解するには、ハシディズムの歴史と信仰に関する知識が必要です。ユダヤ教の研究者や、ハシディズムに関心のある人以外には、あまり馴染みのない言葉でしょう。"},"example_sentences":[{"sentence":"The story tells of how the Baalshem healed a sick child with a mystical amulet.","translation":"その物語は、バアル・シェムが神秘的なお守りで病気の子供を癒した方法を語っている。","type":"noun","meaning_category":"称号・人物"},{"sentence":"Many legends surround the life and deeds of the Baalshem Tov.","translation":"多くの伝説がバアル・シェム・トヴの生涯と業績をめぐって存在する。","type":"noun","meaning_category":"称号・人物"},{"sentence":"The Baalshem's teachings emphasized the importance of joy and devotion in religious practice.","translation":"バアル・シェムの教えは、宗教的実践における喜びと献身の重要性を強調した。","type":"noun","meaning_category":"称号・人物"}]}