{"word":"tendron","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物学)巻きひげ","english_definition":"A slender threadlike appendage of a climbing plant, often growing in a spiral form, that stretches out and twines around any suitable support.","examples":[{"sentence":"The cucumber plant uses its tendrils to climb the trellis.","translation":"キュウリの植物は、巻きひげを使って格子垣を登ります。"},{"sentence":"The tendron of the grape vine wrapped tightly around the wire.","translation":"ブドウの木の巻きひげは、ワイヤーにしっかりと巻き付いています。"}],"collocations":["plant tendron","grape tendron","cucumber tendron"],"synonyms":["tendril","cirrus"],"antonyms":[]}],"etymology":{"value":"Derived from the French word 'tendron', which itself comes from 'tendre' meaning 'tender' or 'soft', referring to the delicate nature of the tendril.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtendrən/","syllables":"ten-dron"},"inflection":{"noun_plural":"tendrons"},"usage_notes":{"explanation":"'Tendron' is primarily used in botanical contexts to specifically refer to the thread-like appendages that climbing plants use for support. While 'tendril' is a more common term, 'tendron' can be used interchangeably, though it might be considered slightly more technical or less frequently encountered.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant's roots were tendrons, anchoring it to the ground.","correct":"✓ The plant's roots anchored it to the ground; its tendrils helped it climb.","note":"Tendrons (or tendrils) are for climbing, not anchoring. Roots anchor plants."},{"incorrect":"✗ The tendron was thick and woody.","correct":"✓ The tendron was thin and flexible.","note":"Tendrons are typically slender and flexible, not thick and woody."}],"priority":"★★☆"},"related_words":{"derivatives":["tendril (より一般的な用語)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Tendron' is a relatively uncommon word, primarily encountered in botanical or horticultural contexts. It refers specifically to the thread-like appendages that climbing plants use to attach themselves to structures for support. Understanding this term requires some familiarity with botanical vocabulary. The more common synonym is 'tendril.'"},"example_sentences":[{"sentence":"The pea plant extended its **tendron** towards the nearby stake.","translation":"エンドウ豆の植物は、近くの杭に向かって巻きひげを伸ばしました。","type":"noun","meaning_category":"巻きひげ"},{"sentence":"Carefully guide the **tendron** of the climbing rose to encourage it to grow along the fence.","translation":"つるバラの巻きひげを慎重に誘導して、フェンスに沿って成長するように促します。","type":"noun","meaning_category":"巻きひげ"}]}