{"word":"khirka","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(イスラム教スーフィーの)粗末な修行着、托鉢僧の着るつぎはぎの服","english_definition":"(in Sufism) a patched woolen garment worn by dervishes or Sufis, symbolizing poverty and detachment from worldly possessions.","examples":[{"sentence":"The Sufi donned his khirka and set out on his journey.","translation":"そのスーフィーはkhirkaを身につけ、旅に出た。"},{"sentence":"The khirka is a symbol of spiritual poverty in Sufi tradition.","translation":"khirkaはスーフィーの伝統における精神的な貧しさの象徴である。"}],"collocations":["wear a khirka","don a khirka","Sufi khirka","patched khirka"],"synonyms":["dervish robe","Sufi cloak","patched garment"],"antonyms":[]}],"etymology":{"value":"Derived from the Arabic word 'khirqah' (خرقة) meaning 'a piece of cloth, rag, patch'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkɪrkə/","syllables":"khir-ka"},"inflection":{"noun_plural":"khirkas"},"usage_notes":{"explanation":"The term 'khirka' is specifically associated with Sufism, a mystical branch of Islam. It represents the renunciation of material wealth and dedication to spiritual pursuits. The garment is often made of coarse wool and patched together from different pieces of cloth, symbolizing the Sufi's detachment from worldly possessions and their commitment to a life of poverty and devotion.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wore a beautiful khirka made of silk.","correct":"✓ He wore a simple khirka made of wool.","note":"Khirkas are traditionally made of coarse wool, not luxurious materials like silk."},{"incorrect":"✗ The khirka is a symbol of wealth and power.","correct":"✓ The khirka is a symbol of poverty and spiritual devotion.","note":"The khirka symbolizes the opposite of wealth and power."}],"priority":"★★☆"},"related_words":{"derivatives":["Sufi","dervish","tasawwuf (Sufism)","faqir (poor or ascetic person)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'khirka' is a specialized term primarily used in the context of Sufism. Understanding its meaning requires familiarity with Islamic mysticism and the symbolism associated with Sufi practices. The term is not commonly encountered in general English usage.","priority":"★★☆"},"example_sentences":[{"sentence":"The dervish's worn khirka spoke of years spent in contemplation and service.","translation":"その托鉢僧の着古したkhirkaは、瞑想と奉仕に費やされた年月を物語っていた。","type":"noun","meaning_category":"修行着"},{"sentence":"The act of receiving a khirka from a spiritual master signifies initiation into a Sufi order.","translation":"精神的な指導者からkhirkaを受け取る行為は、スーフィー教団への入団を意味する。","type":"noun","meaning_category":"修行着"},{"sentence":"The patched khirka served as a constant reminder of the Sufi's vow of poverty.","translation":"つぎはぎだらけのkhirkaは、スーフィーの貧困の誓いを常に思い出させるものだった。","type":"noun","meaning_category":"修行着"}]}