{"word":"Hypomnesia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"記憶力低下、記憶減退","english_definition":"A condition of impaired ability to remember past events; reduced memory.","examples":[{"sentence":"The patient exhibited hypomnesia following the head trauma.","translation":"その患者は頭部外傷後、記憶力低下を示した。"},{"sentence":"Hypomnesia can be a symptom of various neurological disorders.","translation":"記憶力低下は様々な神経疾患の症状となりうる。"}],"collocations":["exhibit hypomnesia","experience hypomnesia","cause hypomnesia","suffer from hypomnesia","hypomnesia symptom","mild hypomnesia","severe hypomnesia"],"synonyms":["memory impairment","memory loss","amnesia (severe case)","forgetfulness","reduced memory"],"antonyms":["hypermnesia","eidetic memory","perfect memory","anamnesis"]},{"part_of_speech":"noun","definition":"(心理学)特定の期間または出来事に関する記憶の想起困難","english_definition":"Difficulty recalling memories of a specific period or event.","examples":[{"sentence":"He had hypomnesia regarding the events of that night.","translation":"彼はその夜の出来事に関する記憶の想起困難を抱えていた。"},{"sentence":"The therapist helped her address the hypomnesia related to her childhood trauma.","translation":"セラピストは彼女が子供時代のトラウマに関連する記憶減退に対処するのを助けた。"}],"collocations":["event-related hypomnesia","childhood hypomnesia","traumatic hypomnesia","selective hypomnesia","temporary hypomnesia"],"synonyms":["recollection difficulty","memory retrieval deficit","recall impairment","memory gap"],"antonyms":["complete recall","full recollection","detailed memory"]}],"etymology":{"value":"The word \"hypomnesia\" comes from the Greek words \"hypo-\" (meaning \"under\" or \"less than\") and \"mnesia\" (meaning \"memory\"). Thus, hypomnesia literally means \"less than memory\" or \"reduced memory\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhaɪpoʊmˈniːziə/","syllables":"hy-po-mne-si-a"},"inflection":{"noun_plural":"hypomnesias"},"usage_notes":{"explanation":"Hypomnesia is a medical and psychological term used to describe a decrease in the ability to recall information or past events. It is a less severe form of memory impairment compared to amnesia, where memory loss is more extensive. Hypomnesia can be caused by various factors, including head injuries, neurological disorders, psychological trauma, stress, and certain medications. It can affect short-term memory, long-term memory, or both. The severity of hypomnesia can vary from mild forgetfulness to significant difficulty in recalling important information.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was diagnosed with hypomnesia, so he completely forgot everything.","correct":"✓ He was diagnosed with hypomnesia, so he had difficulty remembering certain events.","note":"Hypomnesia is a reduction in memory, not complete memory loss like in amnesia."},{"incorrect":"✗ Hypomnesia is the same as dementia.","correct":"✓ Hypomnesia can be a symptom of dementia, but it is not the same thing.","note":"Dementia is a broader term for cognitive decline, while hypomnesia specifically refers to impaired memory."},{"incorrect":"✗ She has hypomnesia, so she can't learn anything new.","correct":"✓ She has hypomnesia, so she has difficulty recalling past events, but she can still learn new things.","note":"Hypomnesia primarily affects the recall of existing memories, not necessarily the ability to form new ones."}],"priority":"★★☆"},"related_words":{"derivatives":["hypomnesic (adjective)"],"phrasal_verbs":[],"related_terms":["amnesia","hypermnesia","dementia","cognitive impairment","memory","anamnesis","paramnesia","cryptomnesia"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. It is a technical term used in medical and psychological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Hypomnesia\" is a technical term used in medicine and psychology to describe a condition where a person has difficulty remembering things. It's like having a weaker memory than usual. It's not the same as forgetting everything completely (which is called amnesia), but rather having trouble recalling certain events or pieces of information. Doctors and therapists might use this word when talking about someone's memory problems, especially if they are related to a specific event or condition.","priority":"★★☆"},"example_sentences":[{"sentence":"The patient's hypomnesia made it difficult for him to recount the details of the accident.","translation":"患者の記憶力低下により、事故の詳細を詳しく語ることが困難になった。","type":"general","meaning_category":"memory impairment"},{"sentence":"Stress and anxiety can contribute to temporary hypomnesia.","translation":"ストレスと不安は一時的な記憶力低下を引き起こす可能性がある。","type":"general","meaning_category":"memory impairment"},{"sentence":"The doctor conducted tests to assess the extent of her hypomnesia.","translation":"医師は彼女の記憶力低下の程度を評価するために検査を行った。","type":"general","meaning_category":"memory impairment"},{"sentence":"He experienced hypomnesia following the concussion, struggling to remember events from the previous day.","translation":"彼は脳震盪後、記憶力低下を経験し、前日の出来事を思い出すのに苦労した。","type":"specific","meaning_category":"recall difficulty"},{"sentence":"The study investigated the effects of sleep deprivation on hypomnesia.","translation":"その研究では、睡眠不足が記憶力低下に及ぼす影響を調査した。","type":"research","meaning_category":"memory impairment"}]}