{"word":"co-tenants","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"共同テナント、共同賃借人","english_definition":"Individuals or entities who jointly lease or rent a property under the same lease agreement.","examples":[{"sentence":"The co-tenants were responsible for paying the rent together.","translation":"共同テナントたちは、家賃を一緒に支払う責任がありました。"},{"sentence":"The lease agreement outlined the responsibilities of each of the co-tenants.","translation":"賃貸契約書には、各共同テナントの責任が明記されていました。"},{"sentence":"If one co-tenant moves out, the remaining co-tenants are still responsible for the full rent.","translation":"共同テナントの一人が退去した場合でも、残りの共同テナントは全額の家賃を支払う責任があります。"}],"collocations":["jointly liable co-tenants (連帯責任を負う共同テナント)","co-tenancy clause (共同テナント条項)","commercial co-tenants (商業施設の共同テナント)","residential co-tenants (居住用物件の共同テナント)"],"synonyms":["joint tenants","joint lessees","roommates (informal, if residential)"],"antonyms":["sole tenant","single tenant"]},{"part_of_speech":"noun","definition":"（商業施設における）共存テナント","english_definition":"In commercial real estate, refers to other tenants within the same property or shopping center, particularly when their presence impacts the success of another tenant.","examples":[{"sentence":"The new restaurant was concerned about the mix of co-tenants in the shopping center.","translation":"新しいレストランは、ショッピングセンター内の共存テナントの組み合わせを懸念していました。"},{"sentence":"The co-tenants in the mall included a department store, a movie theater, and several smaller retailers.","translation":"モール内の共存テナントには、デパート、映画館、およびいくつかの小規模な小売店が含まれていました。"},{"sentence":"A co-tenancy clause in the lease allowed the business to terminate the lease if a major co-tenant left.","translation":"賃貸契約の共存テナント条項により、主要な共存テナントが退去した場合、その事業は賃貸契約を解除することができました。"}],"collocations":["anchor co-tenants (核となる共存テナント)","major co-tenants (主要な共存テナント)","co-tenancy requirements (共存テナント要件)","co-tenancy mix (共存テナントの組み合わせ)","co-tenancy provisions (共存テナント条項)"],"synonyms":["neighboring tenants","adjacent tenants","fellow tenants"],"antonyms":["sole occupant","only tenant"]}],"etymology":{"value":"The word 'co-tenant' is formed by adding the prefix 'co-' (meaning 'together' or 'jointly') to the word 'tenant'. Tenant comes from the Old French word 'tenant', meaning 'holding' or 'occupying'.","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌkoʊˈtɛnənts/","syllables":"co-ten-ants"},"inflection":{"noun_plural":"co-tenants","noun_singular":"co-tenant"},"usage_notes":{"explanation":"The term 'co-tenants' can refer to individuals sharing a residential lease or to businesses operating within the same commercial property. In residential contexts, it emphasizes shared responsibility. In commercial real estate, it often relates to lease clauses protecting businesses if key neighboring tenants leave, impacting customer traffic.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The co-tenant is responsible for all the rent.","correct":"✓ The co-tenants are responsible for all the rent.","note":"When referring to multiple people sharing a lease, use the plural form 'co-tenants'."},{"incorrect":"✗ He is my co-tenant in the office building. He is my competitor.","correct":"✓ He is my co-tenant in the office building. We share the same landlord.","note":"'Co-tenant' refers to sharing a lease or rental agreement, not necessarily being competitors. Clarify the relationship."}],"priority":"★★☆"},"related_words":{"derivatives":["co-tenancy"],"phrases":["co-tenancy clause","joint and several liability"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Co-tenants' refers to multiple individuals or businesses who share a lease agreement for a property. In residential contexts, it means roommates or housemates who are all legally bound by the same lease. In commercial contexts, it refers to businesses that share the same building or shopping center. Understanding the term is important for legal and real estate contexts.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The co-tenants signed the lease agreement together, agreeing to share the responsibilities of maintaining the property.","translation":"共同テナントたちは賃貸契約書に一緒に署名し、物件の維持管理の責任を分担することに合意しました。","type":"noun","meaning_category":"Joint lease responsibility"},{"sentence":"The retail store's lease included a co-tenancy clause that allowed them to reduce rent if the anchor tenant vacated the shopping center.","translation":"その小売店のリースには、主要テナントがショッピングセンターから退去した場合に家賃を減額できる共存テナント条項が含まれていました。","type":"noun","meaning_category":"Commercial lease agreement"},{"sentence":"As co-tenants, they split the utility bills evenly each month.","translation":"共同テナントとして、彼らは毎月光熱費を均等に分割しました。","type":"noun","meaning_category":"Shared expenses"}]}