{"word":"scrobiculate","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(表面が)細かく粗い、細かい網目状の","english_definition":"Having the surface roughened with small, shallow, pits or furrows; finely pitted or furrowed.","examples":[{"sentence":"The fossil shell had a scrobiculate surface.","translation":"その化石の貝殻は、細かく粗い表面をしていた。"},{"sentence":"The scrobiculate texture of the rock indicated a specific type of weathering.","translation":"その岩石の細かい網目状の質感は、特定の種類の風化を示していた。"}],"collocations":["scrobiculate shell","scrobiculate texture","scrobiculate surface"],"synonyms":["pitted","furrowed","rugose","reticulate"],"antonyms":["smooth","polished","glossy"]}],"etymology":{"value":"Derived from the Latin word 'scrobiculus,' a diminutive of 'scrobis,' meaning 'a ditch or furrow.'","priority":"★★☆"},"pronunciation":{"ipa":"/skrɒˈbɪkjʊlət/","syllables":"scro-bic-u-late"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than to form comparative and superlative degrees (which are rare for this word)."},"usage_notes":{"explanation":"The term 'scrobiculate' is primarily used in scientific contexts, particularly in describing the surface texture of fossils, shells, rocks, and sometimes biological specimens. It refers to a surface that is not smooth but has a pattern of small pits or furrows.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The smooth surface was scrobiculate.","correct":"✓ The rough surface was scrobiculate.","note":"'Scrobiculate' implies a rough, pitted surface, so it cannot describe something smooth."}],"priority":"★☆☆"},"related_words":{"derivatives":["scrobicule (noun: a small pit or furrow)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. A specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Scrobiculate' is a specialized term primarily used in scientific and technical contexts, such as geology, paleontology, and biology. It describes a surface texture characterized by small pits or furrows. Due to its limited usage, it is considered a high-level vocabulary word. Understanding requires familiarity with scientific descriptive language."},"example_sentences":[{"sentence":"The paleontologist described the fossil as having a distinctly scrobiculate exoskeleton.","translation":"古生物学者は、その化石が明確な細かい網目状の外骨格を持つと説明した。","type":"adjective","meaning_category":"Describing surface texture"},{"sentence":"Under magnification, the scrobiculate pattern of the leaf became more apparent.","translation":"拡大すると、葉の細かい網目状の模様がより明らかになった。","type":"adjective","meaning_category":"Describing surface texture"}]}