{"word":"polyglotally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"多言語に通じて、複数の言語を用いて","english_definition":"In a polyglot manner; speaking or using several languages.","examples":[{"sentence":"She communicated polyglotally with the international team, switching effortlessly between English, French, and Spanish.","translation":"彼女は国際的なチームと多言語に通じてコミュニケーションを取り、英語、フランス語、スペイン語を難なく切り替えた。"},{"sentence":"The conference was conducted polyglotally to accommodate attendees from various countries.","translation":"会議は様々な国からの参加者に対応するため、複数の言語を用いて行われた。"}],"collocations":["communicate polyglotally","conducted polyglotally","speak polyglotally","understand polyglotally"],"synonyms":["multilingually","linguistically diverse","in multiple languages"],"antonyms":["monolingually"]}],"etymology":{"value":"Derived from 'polyglot' (adjective or noun referring to someone speaking multiple languages) with the addition of the adverbial suffix '-ally'. 'Polyglot' comes from the Greek 'polyglōttos' (πολύγλωττος) meaning 'many-tongued'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɒlɪˈɡlɒtəli/","syllables":"pol-y-glot-al-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Polyglotally' is an adverb that describes actions or communication done using multiple languages. It is relatively rare compared to its adjective or noun form ('polyglot'). It is often used to emphasize the ability to switch between languages fluently or the use of multiple languages to facilitate communication within a diverse group.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He speaks polyglotally languages.","correct":"✓ He speaks polyglotally. / ✓ He speaks multiple languages.","note":"'Polyglotally' is an adverb and modifies the verb 'speaks,' not the noun 'languages.' Use 'multiple languages' if you want to specify what he speaks."},{"incorrect":"✗ The meeting was polyglot.","correct":"✓ The meeting was conducted polyglotally. / ✓ The meeting was polyglot (adjective).","note":"'Polyglot' as an adjective can describe the meeting, but 'polyglotally' (adverb) describes how the meeting was conducted."}],"priority":"★☆☆"},"related_words":{"derivatives":["polyglot (noun, adjective)","polyglotism (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Extremely rare.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Polyglotally' is a sophisticated term indicating the use or ability to use multiple languages in communication or expression. Its usage is infrequent, typically found in academic or specialized contexts concerning linguistics or international relations. Understanding requires familiarity with the root word 'polyglot' and the function of adverbial suffixes.","priority":"★☆☆"},"example_sentences":[{"sentence":"The diplomat addressed the assembly polyglotally, ensuring all delegates could understand.","translation":"外交官はすべての代表者が理解できるように、多言語に通じて会議で演説した。","type":"adverb","meaning_category":"多言語を用いて"},{"sentence":"The software was designed to function polyglotally, supporting input and output in numerous languages.","translation":"そのソフトウェアは、多数の言語での入出力をサポートするために、複数の言語を用いて機能するように設計された。","type":"adverb","meaning_category":"多言語を用いて"}]}