{"word":"unhelmed","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"ヘルメットをかぶっていない、兜を脱いだ","english_definition":"Not wearing a helmet; without a helmet.","examples":[{"sentence":"The knight rode into battle unhelmed, his face exposed to the enemy.","translation":"騎士は兜を脱ぎ、顔を敵にさらして戦場に乗り込んだ。"},{"sentence":"He stood unhelmed before the king, awaiting his judgment.","translation":"彼は王の前に兜を脱いで立ち、判決を待った。"}],"collocations":["ride unhelmed","stand unhelmed","go unhelmed"],"synonyms":["bareheaded","uncovered","hatless"],"antonyms":["helmed","helmeted","covered"]},{"part_of_speech":"adjective","definition":"（船が）舵のない、操舵されていない","english_definition":"(Of a ship) without a helm or rudder; not steered.","examples":[{"sentence":"The unhelmed ship drifted aimlessly on the open sea.","translation":"舵のない船は、大海原をあてもなく漂流した。"},{"sentence":"The storm left the vessel unhelmed and at the mercy of the waves.","translation":"嵐により船は操舵不能となり、波のなすがままとなった。"}],"collocations":["drift unhelmed","left unhelmed"],"synonyms":["rudderless","adrift","uncontrolled"],"antonyms":["steered","controlled"]}],"etymology":{"value":"\"Un-\" (not) + \"helmed\" (wearing a helm or having a helm).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈhɛlmd/","syllables":"un-helmed"},"inflection":{"notes":"Adjective; comparative and superlative forms are typically formed using 'more' and 'most' (e.g., more unhelmed, most unhelmed)."},"usage_notes":{"explanation":"The word \"unhelmed\" is relatively uncommon and somewhat archaic. It primarily has two meanings: not wearing a helmet, and (of a ship) without a helm or rudder. The context usually makes it clear which meaning is intended. The first meaning is more common in historical or fantasy settings, while the second is more often found in nautical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He unhelmed his car.","correct":"✓ He took off his helmet.","note":"\"Unhelmed\" is an adjective, not a verb. You cannot \"unhelm\" something. Instead, use a verb like \"remove\" or \"take off\" with the noun \"helmet.\""}],"priority":"★★☆"},"related_words":{"derivatives":["helm (noun: a tiller or wheel and any associated equipment for steering a ship or boat)","helmet (noun: a hard or padded protective covering for the head, used by soldiers, police officers, sports players, etc.)"],"phrasal_verbs":[],"related_adjectives":["helmed","helmeted"]},"level_frequency":{"CEFR":"N/A (Too rare to be included in CEFR levels)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Unhelmed\" is a relatively rare and formal word. It is most likely to be encountered in literature, historical texts, or nautical contexts. Understanding the word requires knowledge of the prefix \"un-\" (meaning \"not\") and the word \"helmed\" (meaning \"wearing a helmet\" or \"having a helm\")."},"example_sentences":[{"sentence":"The warrior, unhelmed and weary, surveyed the battlefield.","translation":"戦士は兜を脱ぎ、疲れ果てて戦場を見渡した。","type":"adjective","meaning_category":"Not wearing a helmet"},{"sentence":"The unhelmed vessel was tossed about by the raging storm.","translation":"舵のない船は、荒れ狂う嵐にもてあそばれた。","type":"adjective","meaning_category":"Without a helm or rudder"}]}