{"word":"lumenal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(解剖学)管腔の、内腔の","english_definition":"Relating to a lumen, especially the lumen of a gland, cell, or blood vessel.","examples":[{"sentence":"The lumenal surface of the cell is exposed to the contents of the organ.","translation":"細胞の管腔側の表面は、臓器の内容物にさらされている。"},{"sentence":"Lumenal cells secrete various substances into the gland's lumen.","translation":"管腔細胞は、様々な物質を腺の内腔に分泌する。"}],"collocations":["lumenal surface","lumenal cells","lumenal space","lumenal membrane"],"synonyms":["intracavitary","intraluminal"],"antonyms":["abluminal","basolateral"]}],"etymology":{"value":"From lumen + -al. Lumen comes from Latin lumen, meaning 'light' or 'opening'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈluːmənəl/","syllables":"lu-men-al"},"inflection":{"notes":"Adjective; no comparative or superlative forms."},"usage_notes":{"explanation":"'Lumenal' specifically refers to the space within a tubular structure in the body, such as a blood vessel, gland, or cell. It describes the surface or cells that line this space. It is used primarily in a biological or medical context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lumenal of the room was bright.","correct":"✓ The lighting of the room was bright.","note":"'Lumenal' refers to a biological lumen, not general lighting or room space."}],"priority":"★☆☆"},"related_words":{"derivatives":["lumen (noun): the SI unit of luminous flux, equal to the amount of light emitted per second in a unit solid angle of one steradian by a uniform point source of one candela.","lumenize (verb): to increase the light-transmitting power of (a lens) by coating with a thin transparent film of magnesium fluoride or other substance."],"related_terms":["intraluminal (adjective): situated or occurring within the lumen of a vessel or tubular structure.","abluminal (adjective): located away from the lumen."]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lumenal' is a technical term used in biology and medicine to describe something related to the lumen, which is the inside space of a tubular structure like a blood vessel or gland. It's not a common word in everyday language, and understanding it requires some knowledge of anatomy or cell biology. You'll typically find this word in scientific papers, textbooks, or medical reports."},"example_sentences":[{"sentence":"The lumenal diameter of the artery was measured to assess blood flow.","translation":"動脈の管腔径を測定して、血流を評価した。","type":"scientific","meaning_category":"anatomy"},{"sentence":"Lumenal antigens can stimulate an immune response in the gut.","translation":"管腔抗原は腸内で免疫応答を刺激することがある。","type":"scientific","meaning_category":"biology"}]}