{"word":"servitorial","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"召使いの、使用人らしい、奉仕的な","english_definition":"Of or relating to service or servants; befitting a servant; characterized by or expressing service or subservience.","examples":[{"sentence":"The hotel staff provided servitorial assistance to the guests.","translation":"ホテルのスタッフは宿泊客に奉仕的な援助を提供した。"},{"sentence":"His servitorial demeanor made him a popular butler.","translation":"彼の使用人らしい態度は、彼を人気のある執事にした。"},{"sentence":"The company culture encouraged a servitorial approach to customer relations.","translation":"その企業文化は、顧客関係に対する奉仕的なアプローチを奨励していた。"}],"collocations":["servitorial duties (使用人としての義務)","servitorial staff (使用人)","servitorial role (奉仕的な役割)","servitorial attitude (奉仕的な態度)","servitorial assistance (奉仕的な援助)"],"synonyms":["subservient","obsequious","menial","attendant","helpful","obliging"],"antonyms":["domineering","authoritative","imperious","masterful"]},{"part_of_speech":"adjective","definition":"(法律)地役権に関する","english_definition":"(Law) Pertaining to a servitude or easement.","examples":[{"sentence":"The property was subject to a servitorial obligation to allow access to the neighboring land.","translation":"その不動産は、隣接する土地へのアクセスを許可するという地役権の義務を負っていた。"},{"sentence":"The servitorial rights were clearly defined in the property deed.","translation":"地役権は、不動産譲渡証書に明確に定義されていた。"}],"collocations":["servitorial obligation (地役権の義務)","servitorial rights (地役権)","servitorial easement (地役権)"],"synonyms":["easementary","obligatory"],"antonyms":["freehold"]}],"etymology":{"value":"From Latin 'servitorius', from 'servitor' (servant), from 'servire' (to serve).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɜːrvɪˈtɔːriəl/","syllables":"ser-vi-to-ri-al"},"inflection":{"adjective_forms":{"comparative":"more servitorial","superlative":"most servitorial"}},"usage_notes":{"explanation":"'Servitorial' is a relatively uncommon word, primarily used in formal contexts. It describes qualities or actions associated with serving or being a servant. In legal contexts, it relates to servitudes or easements, which are rights to use someone else's property for a specific purpose.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The servitorial was very helpful.","correct":"✓ The servitorial staff was very helpful.","note":"'Servitorial' is an adjective, so it needs to modify a noun. Using it as a noun is incorrect."},{"incorrect":"✗ He had a servitorial attitude for success.","correct":"✓ He had a subservient attitude for success.","note":"'Servitorial' describes the act of serving, while 'subservient' describes being excessively willing to obey others, which might be the intended meaning."}],"priority":"★★☆"},"related_words":{"derivatives":["servitor (noun: a servant or attendant)","service (noun: the action of helping or doing work for someone)","servitude (noun: the state of being a slave or completely subject to someone more powerful)","serve (verb: to perform duties or services for another person or organization)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Servitorial' is a formal and uncommon adjective. It describes something related to service or servants. It can also refer to legal obligations related to land use rights. Because of its rarity and specific contexts, it is generally encountered in advanced reading or specialized fields like law or hospitality. Understanding the root word 'serve' helps in grasping its meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The company's servitorial approach to customer service ensured high levels of satisfaction.","translation":"その会社の顧客サービスに対する奉仕的なアプローチは、高いレベルの満足度を保証した。","type":"adjective","meaning_category":"奉仕的な"},{"sentence":"The ancient document outlined the servitorial obligations of the tenant farmers.","translation":"その古代文書は、小作農の地役権の義務を概説していた。","type":"adjective","meaning_category":"(法律)地役権に関する"},{"sentence":"He adopted a servitorial manner in order to please his superiors.","translation":"彼は上司を喜ばせるために、使用人のような態度をとった。","type":"adjective","meaning_category":"召使いの"}]}