{"word":"regrettingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"残念ながら、遺憾ながら、申し訳なく思いながら","english_definition":"in a regretful manner; with feelings of sorrow, disappointment, or remorse about something that one has done or failed to do.","examples":[{"sentence":"Regrettingly, I must decline your invitation.","translation":"残念ながら、ご招待をお断りしなければなりません。"},{"sentence":"He regrettingly admitted his mistake.","translation":"彼は申し訳なく思いながら自分の過ちを認めた。"},{"sentence":"Regrettingly, we have to inform you that your application has been rejected.","translation":"残念ながら、あなたの応募は却下されたことをお知らせしなければなりません。"}],"collocations":["regrettingly decline","regrettingly inform","regrettingly admit","regrettingly say"],"synonyms":["unfortunately","sadly","alas","sorrowfully","apologetically","remorsefully"],"antonyms":["happily","joyfully","gladly"]}],"etymology":{"value":"The word 'regrettingly' is formed by adding the suffix '-ly' to the word 'regretting', which is the present participle of the verb 'regret'. 'Regret' comes from the Old French 'regreter', meaning 'to bewail, lament', which is possibly of Germanic origin.","priority":"★★☆"},"pronunciation":{"ipa":"/rɪˈɡrɛtɪŋli/","syllables":"re-gret-ting-ly"},"inflection":{"notes":"As an adverb, 'regrettingly' does not have different inflected forms. Its form remains constant regardless of tense, number, or gender."},"usage_notes":{"explanation":"'Regrettingly' is used to express a feeling of regret or sorrow while conveying information or performing an action. It indicates that the speaker or writer feels bad about what they are saying or doing. It is often used in formal contexts to soften the impact of bad news or to express politeness. The adverb modifies the verb in the sentence, indicating the manner in which the action is performed.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I regrettingly to inform you...","correct":"✓ I regrettingly inform you...","note":"The adverb 'regrettingly' directly modifies the verb 'inform'. The preposition 'to' is unnecessary and grammatically incorrect in this context."},{"incorrect":"✗ Regrettingly, I am regretful to say...","correct":"✓ Regrettingly, I must say... / ✓ I am regretful to say...","note":"Using both 'regrettingly' and 'regretful' in the same sentence is redundant. Choose one or the other to avoid unnecessary repetition."},{"incorrect":"✗ He said regrettingly that he was sorry.","correct":"✓ He said regrettingly that he was sorry. / ✓ He said with regret that he was sorry.","note":"While grammatically correct, using 'regrettingly' with 'said' can sometimes sound awkward. Consider using 'with regret' or rephrasing the sentence for better flow."}],"priority":"★★☆"},"related_words":{"derivatives":["regret (noun, verb)","regretful (adjective)","regretfully (adverb)","unregretful (adjective)","unregretting (adjective)"],"idioms_phrases":["no regrets (having lived life without remorse)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency - More common in formal writing.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Regrettingly' is an adverb that means 'in a regretful manner'. It's used to show that someone is doing something with feelings of sadness or disappointment. This word is more common in formal writing or speech. For example, you might say, \"Regrettingly, I have to decline your invitation,\" which means you're sorry that you can't accept the invitation. It's a way to express politeness and acknowledge that you wish things were different."},"example_sentences":[{"sentence":"Regrettingly, the concert has been canceled due to unforeseen circumstances.","translation":"残念ながら、コンサートは予期せぬ事情により中止となりました。","type":"adverb","meaning_category":"expressing regret"},{"sentence":"She regrettingly turned down the job offer, as it required her to relocate.","translation":"彼女は転勤が必要だったため、申し訳なく思いながらその仕事のオファーを断った。","type":"adverb","meaning_category":"expressing regret"},{"sentence":"Regrettingly, we must inform you that the product is out of stock.","translation":"残念ながら、その製品は在庫切れであることをお知らせしなければなりません。","type":"adverb","meaning_category":"expressing regret"}]}