{"word":"thievingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"盗むように、こっそりと盗んで、盗みをするように","english_definition":"in a manner that involves stealing or characteristic of a thief; stealthily, furtively.","examples":[{"sentence":"He glanced thievingly around the room, looking for something to take.","translation":"彼は盗むように部屋を見回し、何か盗むものはないか探した。"},{"sentence":"The cat crept thievingly towards the unattended plate of fish.","translation":"猫はこっそりと魚の皿に忍び寄った。"},{"sentence":"She acted thievingly, trying to hide the stolen goods.","translation":"彼女は盗んだものを隠そうと、盗みをするように振る舞った。"}],"collocations":["look thievingly","act thievingly","move thievingly","creep thievingly","glance thievingly"],"synonyms":["furtively","stealthily","surreptitiously","secretly","covertly","slyly","sneakily"],"antonyms":["honestly","openly","forthrightly","candidly","blatantly"]}],"etymology":{"value":"Derived from the adjective 'thieving' (tending to steal) by adding the adverbial suffix '-ly'. 'Thieving' comes from 'thief' + '-ing'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈθiːvɪŋli/","syllables":"thiev-ing-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Thievingly' describes an action performed in a way that suggests theft or the behavior of a thief. It implies secrecy, dishonesty, and an intent to steal. It is often used to describe how someone looks around or moves when they are trying to steal something without being noticed.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He thievingly stole the money.","correct":"✓ He thievingly looked around the room. / ✓ He stole the money.","note":"'Thievingly' describes the manner of an action, not the action itself. It's redundant to use it with the verb 'stole'. Instead, use it to describe how someone looks or moves when they are about to steal something."}],"priority":"★★☆"},"related_words":{"derivatives":["thief (noun): a person who steals.","thieving (adjective): tending to steal; characterized by theft.","thieve (verb): to steal.","theft (noun): the act of stealing."],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'thievingly' is an adverb that describes an action done in a way that suggests stealing or the behavior of a thief. It is not a commonly used word and is more likely to be found in literature or descriptive writing. It implies secrecy and dishonesty in the way something is done, suggesting an intent to steal without being caught. It is more nuanced than simply saying someone 'stole' something, as it describes the manner in which they acted."},"example_sentences":[{"sentence":"The raccoon peered thievingly into the garbage can.","translation":"アライグマは盗むようにゴミ箱の中を覗き込んだ。","type":"adverb","meaning_category":"manner of action"},{"sentence":"He crept thievingly through the dark alley, hoping not to be seen.","translation":"彼は見られないようにと、盗むように暗い路地を這い進んだ。","type":"adverb","meaning_category":"manner of action"},{"sentence":"She glanced thievingly at the jewelry display, contemplating her next move.","translation":"彼女は次にどうするか考えながら、盗むように宝石の展示ケースをちらりと見た。","type":"adverb","meaning_category":"manner of action"}]}