{"word":"Eurocentricity","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ヨーロッパ中心主義、欧米中心主義","english_definition":"The tendency to interpret the world from a European or generally Western, point of view.","examples":[{"sentence":"The curriculum has been criticized for its Eurocentricity.","translation":"そのカリキュラムはヨーロッパ中心主義であると批判されている。"},{"sentence":"Eurocentricity can lead to a biased understanding of history.","translation":"ヨーロッパ中心主義は、歴史の偏った理解につながる可能性がある。"},{"sentence":"The museum is trying to move away from Eurocentricity in its exhibits.","translation":"その博物館は展示においてヨーロッパ中心主義から脱却しようとしている。"}],"collocations":["avoid Eurocentricity (ヨーロッパ中心主義を避ける)","challenge Eurocentricity (ヨーロッパ中心主義に異議を唱える)","overcome Eurocentricity (ヨーロッパ中心主義を克服する)","historical Eurocentricity (歴史的なヨーロッパ中心主義)","cultural Eurocentricity (文化的なヨーロッパ中心主義)"],"synonyms":["Western-centrism","Occidentalism"],"antonyms":["Afrocentricity","Sinocentrism","Multiculturalism","Global perspective"]},{"part_of_speech":"noun","definition":"ヨーロッパ中心的な視点、ヨーロッパ中心的な考え方","english_definition":"A worldview that is centered on Western civilization or a biased view that favors it over non-Western cultures.","examples":[{"sentence":"Eurocentricity is evident in many textbooks.","translation":"ヨーロッパ中心的な視点は多くの教科書に明らかに見られる。"},{"sentence":"We need to be aware of the dangers of Eurocentricity when studying other cultures.","translation":"他の文化を研究する際には、ヨーロッパ中心的な考え方の危険性に注意する必要がある。"}],"collocations":["exhibit Eurocentricity (ヨーロッパ中心的な視点を示す)","demonstrate Eurocentricity (ヨーロッパ中心的な考え方を示す)"],"synonyms":["European bias","Western bias"],"antonyms":["cultural relativism","impartiality"]}],"etymology":{"value":"\"Euro-\" (Europe) + \"centric\" (centered) + \"-ity\" (state or quality).","priority":"★★★"},"pronunciation":{"ipa":"/ˌjʊərəʊsenˈtrɪsɪti/","syllables":"Eu-ro-cen-tric-i-ty"},"inflection":{"notes":"Uncountable noun"},"usage_notes":{"explanation":"\"Eurocentricity\" refers to the conscious or unconscious privileging of European (or Western) perspectives, values, and experiences over those of other cultures. It often involves viewing the world through a European lens, which can lead to misinterpretations or undervaluing of non-Western cultures and histories. It is often used in discussions about colonialism, cultural studies, and education.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Eurocentric.","correct":"✓ He holds Eurocentric views. / ✓ He exhibits Eurocentricity.","note":"While you can say someone 'is Eurocentric' as an adjective, when using it as a noun, it's better to say they 'hold Eurocentric views' or 'exhibit Eurocentricity'."},{"incorrect":"✗ Eurocentricity is good.","correct":"✓ Eurocentricity is a problematic perspective.","note":"Generally, the term carries a negative connotation, implying bias. It's rarely seen as a positive attribute."}],"priority":"★★☆"},"related_words":{"derivatives":["Eurocentric (adjective)","Eurocentrism (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, but increasing in academic and social discourse.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Eurocentricity\" is a complex term used to describe the tendency to view the world primarily from a European or Western perspective. This can lead to a biased understanding of history, culture, and other aspects of the world. It is often discussed in academic and social contexts related to colonialism, multiculturalism, and cultural studies. Understanding this term requires a grasp of historical and cultural contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The professor argued that the textbook presented a Eurocentric view of history.","translation":"教授はその教科書が歴史のヨーロッパ中心的な見方を提示していると主張した。","type":"noun","meaning_category":"ヨーロッパ中心主義"},{"sentence":"Critics have accused the museum of Eurocentricity in its selection of artifacts.","translation":"批評家たちは、博物館の工芸品の選択におけるヨーロッパ中心主義を非難している。","type":"noun","meaning_category":"ヨーロッパ中心的な視点"},{"sentence":"Addressing Eurocentricity in education is crucial for promoting a more inclusive understanding of the world.","translation":"教育におけるヨーロッパ中心主義に対処することは、世界をより包括的に理解するために重要である。","type":"noun","meaning_category":"ヨーロッパ中心主義"}]}