{"word":"solvation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"溶媒和（ようばいわ）：溶質粒子が溶媒分子に囲まれる現象","english_definition":"The process by which solvent molecules surround and interact with solute ions or molecules.","examples":[{"sentence":"Solvation of ions is essential for dissolving ionic compounds in water.","translation":"イオンの溶媒和は、イオン性化合物を水に溶解するために不可欠です。"},{"sentence":"The degree of solvation depends on the nature of the solute and solvent.","translation":"溶媒和の程度は、溶質と溶媒の性質に依存します。"},{"sentence":"Solvation energy is released during the solvation process.","translation":"溶媒和エネルギーは、溶媒和の過程で放出されます。"}],"collocations":["solvation energy (溶媒和エネルギー)","solvation shell (溶媒和殻)","preferential solvation (優先溶媒和)","hydration (水和、水溶液における溶媒和)"],"synonyms":["dissolution","dissolving","hydration (when the solvent is water)"],"antonyms":["precipitation","crystallization"]},{"part_of_speech":"noun","definition":"（より一般的に）溶解","english_definition":"The general process of dissolving a solute in a solvent.","examples":[{"sentence":"Solvation is a key step in many chemical reactions.","translation":"溶媒和は、多くの化学反応における重要なステップです。"}],"collocations":[],"synonyms":["dissolution","dissolving"],"antonyms":["precipitation","crystallization"]}],"etymology":{"value":"Derived from 'solve' (to dissolve) and '-ation' (a suffix denoting a process or state).","priority":"★★☆"},"pronunciation":{"ipa":"/sɒlˈveɪʃən/","syllables":"sol-va-tion"},"inflection":{"noun_plural":"solvations (rarely used)"},"usage_notes":{"explanation":"'Solvation' specifically refers to the interaction between solute and solvent molecules, where solvent molecules surround the solute. When the solvent is water, the term 'hydration' is often used instead of 'solvation', although 'hydration' is a specific type of solvation. The concept is important in chemistry for understanding solubility, reaction rates, and other solution properties.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The solvation is when a solid becomes liquid.","correct":"✓ Solvation is the process where solvent molecules surround solute particles.","note":"Solvation is not simply a solid becoming liquid, but the interaction between the solute and solvent molecules."}],"priority":"★★☆"},"related_words":{"derivatives":["solvate (verb: 溶媒和する; noun: 溶媒和物)","solvated (adjective: 溶媒和された)","solvophobic (adjective: 溶媒を嫌う)","solvophilic (adjective: 溶媒を好む)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency (専門用語)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Solvation' is a technical term used in chemistry to describe the process where solvent molecules surround solute particles, such as ions or molecules. This interaction stabilizes the solute in the solution. The term is particularly relevant when discussing the dissolution of ionic compounds or the behavior of molecules in solution. Understanding solvation is crucial for comprehending various chemical phenomena, including reaction kinetics and thermodynamics of solutions. When water is the solvent, the term 'hydration' is often used instead of 'solvation'."},"example_sentences":[{"sentence":"The **solvation** of sodium chloride in water leads to the formation of hydrated sodium and chloride ions.","translation":"塩化ナトリウムの水への溶媒和は、水和されたナトリウムイオンと塩化物イオンの形成につながります。","type":"noun","meaning_category":"溶媒和"},{"sentence":"**Solvation** energy plays a critical role in determining the solubility of a compound.","translation":"溶媒和エネルギーは、化合物の溶解度を決定する上で重要な役割を果たします。","type":"noun","meaning_category":"溶媒和"},{"sentence":"The extent of **solvation** can influence the rate of a chemical reaction.","translation":"溶媒和の程度は、化学反応の速度に影響を与える可能性があります。","type":"noun","meaning_category":"溶媒和"}]}