{"word":"sejero","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Ethiopian dish) A traditional Ethiopian dish made of spiced, ground beef that is cooked rare or medium-rare. It is often served with injera (a type of flatbread) and awaze (a spicy sauce).","english_definition":"A traditional Ethiopian dish made of spiced, ground beef that is cooked rare or medium-rare. It is often served with injera (a type of flatbread) and awaze (a spicy sauce).","examples":[{"sentence":"We ordered sejero at the Ethiopian restaurant.","translation":"エチオピア料理店でセジェロを注文しました。"},{"sentence":"Sejero is a popular dish during Ethiopian holidays.","translation":"セジェロはエチオピアの祝日に人気のある料理です。"}],"collocations":["order sejero","eat sejero","make sejero"],"synonyms":["kitfo","gored gored"],"antonyms":[]}],"etymology":{"value":"The word 'sejero' likely originates from the Amharic language, which is the official language of Ethiopia. The exact etymological roots are not widely documented, but it is understood to be a native term for this specific type of beef dish.","priority":"★★★"},"pronunciation":{"ipa":"/sɛˈdʒɛroʊ/","syllables":"se-je-ro"},"inflection":{"noun_plural":"sejero (usually uncountable)"},"usage_notes":{"explanation":"Sejero is a dish that is typically eaten in Ethiopia and Eritrea. It is similar to kitfo, but it is usually less finely ground and may be cooked slightly more. It is often considered a delicacy and is served on special occasions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I want a sejero, please. (when ordering at a restaurant)","correct":"✓ I would like to order the sejero, please.","note":"When ordering at a restaurant, it's better to use a more polite phrase like 'I would like to order the sejero.'"},{"incorrect":"✗ Sejero are delicious.","correct":"✓ Sejero is delicious.","note":"Sejero is generally treated as an uncountable noun, so use the singular verb form."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_dishes":["kitfo","gored gored","tibs","injera","awaze"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sejero' is a specialized term referring to a specific Ethiopian dish. Understanding its meaning requires familiarity with Ethiopian cuisine. The term is not commonly used outside of contexts related to Ethiopian food or culture."},"example_sentences":[{"sentence":"The menu featured both kitfo and sejero, offering a choice of finely minced or coarsely ground beef.","translation":"メニューにはキトフォとセジェロの両方が掲載されており、細かく挽いた牛肉か粗く挽いた牛肉かを選べた。","type":"noun","meaning_category":"Ethiopian cuisine"},{"sentence":"For a truly authentic Ethiopian experience, try the sejero with a side of homemade injera.","translation":"本格的なエチオピア料理を体験するには、自家製インジェラを添えたセジェロをお試しください。","type":"noun","meaning_category":"Ethiopian cuisine"}]}