{"word":"purgeable","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"浄化できる、除去できる、追放できる","english_definition":"Capable of being purged; able to be cleansed, purified, or removed.","examples":[{"sentence":"This data is purgeable after a certain period to save storage space.","translation":"このデータはある期間が過ぎると、ストレージ容量を節約するために削除可能です。"},{"sentence":"The system identifies purgeable files that are no longer needed.","translation":"システムは不要になった削除可能なファイルを識別します。"},{"sentence":"These toxins are purgeable through a healthy diet and exercise.","translation":"これらの毒素は、健康的な食事と運動によって除去可能です。"}],"collocations":["purgeable data (削除可能なデータ)","purgeable files (削除可能なファイル)","purgeable memory (削除可能なメモリ)","purgeable content (削除可能なコンテンツ)"],"synonyms":["removable","erasable","expungable","cleansable","eliminable"],"antonyms":["unpurgeable","irremovable","indelible","permanent"]}],"etymology":{"value":"The word \"purgeable\" is formed from the verb \"purge\" and the suffix \"-able.\" \"Purge\" comes from the Old French word \"purgier,\" meaning \"to cleanse,\" which in turn comes from the Latin word \"purgare,\" meaning \"to cleanse, purify.\" The suffix \"-able\" indicates the capability or possibility of being acted upon.","priority":"★★☆"},"pronunciation":{"ipa":"ˈpɜːrdʒəbəl","syllables":"pur-gea-ble"},"inflection":{"notes":"Adjective, comparative and superlative forms are 'more purgeable' and 'most purgeable' respectively."},"usage_notes":{"explanation":"\"Purgeable\" is most commonly used in technical contexts, especially in computing and data management, to describe data or files that can be safely deleted or removed from a system to free up space or improve performance. It can also be used more broadly to describe anything that can be cleansed or removed, such as toxins from the body. The term implies that the item is no longer needed or is detrimental to keep.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The purgeable is ready.","correct":"✓ The purgeable data is ready.","note":"\"Purgeable\" is an adjective and needs to modify a noun. It cannot stand alone as a noun."},{"incorrect":"✗ The system purged the purgeable.","correct":"✓ The system purged the purgeable data.","note":"\"Purgeable\" needs to be followed by a noun it modifies, such as 'data' or 'files'."}],"priority":"★★☆"},"related_words":{"derivatives":["purge (verb, noun)","purged (adjective)","purging (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"purgeable\" is a technical term, mostly used in computing and data management contexts. It means something can be removed or deleted to free up space or improve performance. It is not a common word in everyday conversation, so understanding its meaning requires a good vocabulary and familiarity with technical language."},"example_sentences":[{"sentence":"The system automatically flags temporary files as purgeable.","translation":"システムは一時ファイルを自動的に削除可能としてフラグを立てます。","type":"general","meaning_category":"removable"},{"sentence":"Ensure that all sensitive data is securely purged before marking it as purgeable.","translation":"機密データはすべて安全に削除してから、削除可能としてマークしてください。","type":"technical","meaning_category":"removable"},{"sentence":"The application identifies purgeable memory regions to optimize performance.","translation":"アプリケーションは、パフォーマンスを最適化するために、削除可能なメモリ領域を識別します。","type":"technical","meaning_category":"removable"}]}