{"word":"airbrasive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"研磨剤を空気圧で吹き付ける","english_definition":"Pertaining to a process that uses a stream of abrasive particles propelled by compressed air for cutting, etching, cleaning, or polishing hard materials.","examples":[{"sentence":"Airbrasive techniques are used in dentistry for removing small cavities.","translation":"エアブレイシブ技術は、歯科において小さな虫歯を除去するために使用されます。"},{"sentence":"The jeweler used an airbrasive tool to etch a design onto the gemstone.","translation":"宝石商は、エアブレイシブツールを使用して宝石にデザインをエッチングしました。"}],"collocations":["airbrasive cleaning","airbrasive machining","airbrasive technique"],"synonyms":["sandblasting","abrasive blasting"],"antonyms":[]}],"etymology":{"value":"Combination of 'air' and 'abrasive', describing the method of using air to propel abrasive particles.","priority":"★★★"},"pronunciation":{"ipa":"ˈɛərˌbreɪsɪv","syllables":"air-bra-sive"},"inflection":{"notes":"This word is primarily used as an adjective. It can also function as a noun referring to the process or equipment, though this is less common."},"usage_notes":{"explanation":"'Airbrasive' specifically refers to the process or equipment that uses compressed air to propel abrasive particles for various applications, such as cleaning, cutting, or etching. It is commonly encountered in industrial, dental, and jewelry-making contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The dentist used air abrasion.","correct":"✓ The dentist used airbrasive technique.","note":"'Air abrasion' is a related but distinct term, sometimes used interchangeably but more broadly referring to any abrasion using air. 'Airbrasive' is more specific to the equipment or process using abrasive particles."}],"priority":"★★☆"},"related_words":{"derivatives":["airbrasion","abrasive","air blast"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'airbrasive' is a technical term used in specific fields like dentistry, manufacturing, and jewelry making. Understanding the term requires familiarity with industrial processes and materials science. The word is formed by combining 'air' and 'abrasive', indicating a process that uses air to propel abrasive materials for surface treatment. Due to its specialized usage, it is not commonly encountered in general English."},"example_sentences":[{"sentence":"The museum conservator used an **airbrasive** system to carefully clean the delicate artifact.","translation":"博物館の修復家は、繊細な工芸品を注意深く洗浄するためにエアブレイシブシステムを使用しました。","type":"adjective","meaning_category":"研磨剤を空気圧で吹き付ける"},{"sentence":"**Airbrasive** machining is effective for cutting brittle materials.","translation":"エアブレイシブ加工は、脆性材料の切断に効果的です。","type":"adjective","meaning_category":"研磨剤を空気圧で吹き付ける"}]}