{"word":"trichromat","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"三色型色覚者：正常な色覚を持つ人、または3種類の錐体細胞を持つ人","english_definition":"An individual with normal color vision, possessing three independent channels for conveying color information, derived from the three different cone types.","examples":[{"sentence":"Most humans are trichromats.","translation":"ほとんどの人間は三色型色覚者です。"},{"sentence":"Trichromats can distinguish a wide range of colors.","translation":"三色型色覚者は広範囲の色を識別できます。"}],"collocations":["normal trichromat","typical trichromat","human trichromat"],"synonyms":["normal color vision","three-color vision"],"antonyms":["dichromat","monochromat","color blind"]},{"part_of_speech":"adjective","definition":"三色型の：正常な色覚を持つ、または3種類の錐体細胞を持つこと","english_definition":"Having normal color vision, possessing three independent channels for conveying color information, derived from the three different cone types.","examples":[{"sentence":"A trichromat vision allows for the perception of a wide spectrum of colors.","translation":"三色型色覚により、広範囲の色の知覚が可能になります。"},{"sentence":"Trichromat color vision is essential for many professions.","translation":"三色型色覚は多くの職業にとって不可欠です。"}],"collocations":["trichromat vision","trichromat color vision","trichromat observer"],"synonyms":["normal color vision","three-color"],"antonyms":["dichromatic","monochromatic","color blind"]}],"etymology":{"value":"From the Greek words 'tri-' meaning 'three,' 'chroma' meaning 'color,' and '-at' indicating 'having.'","priority":"★★★"},"pronunciation":{"ipa":"ˈtraɪˌkroʊmæt","syllables":"tri-chro-mat"},"inflection":{"noun_plural":"trichromats"},"usage_notes":{"explanation":"'Trichromat' refers to individuals with normal color vision, who possess three types of cone cells in their eyes, each sensitive to different wavelengths of light (red, green, and blue). This allows them to perceive a wide range of colors. It is the standard type of color vision in humans.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a dichromat, so he is a trichromat.","correct":"✓ He is not a trichromat, because he is a dichromat.","note":"Dichromats have a form of color blindness and cannot be trichromats, who have normal color vision."}],"priority":"★★☆"},"related_words":{"derivatives":["trichromacy (noun: the state of having trichromat vision)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'trichromat' is a technical term used in the field of vision science to describe individuals with normal color vision. It is not a commonly used word in everyday language. Understanding this term requires knowledge of basic biology and the science of color perception.","priority":"★★☆"},"example_sentences":[{"sentence":"As a trichromat, she could easily distinguish between subtle shades of green.","translation":"三色型色覚者として、彼女は緑の微妙な色合いを容易に区別できました。","type":"noun","meaning_category":"Normal color vision"},{"sentence":"The test confirmed that he had trichromat vision.","translation":"テストの結果、彼が三色型色覚を持っていることが確認されました。","type":"adjective","meaning_category":"Normal color vision"}]}