{"word":"capuchins","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) オマキザル属のサル","english_definition":"(plural noun) small, intelligent monkeys of the genus Cebus, native to Central and South America. They are known for their use of tools and their expressive faces.","examples":[{"sentence":"The capuchins at the zoo are very popular with visitors.","translation":"動物園のオマキザルは来園者にとても人気があります。"},{"sentence":"Capuchins are known for their intelligence and ability to use tools.","translation":"オマキザルは知能が高く、道具を使う能力があることで知られています。"}],"collocations":["white-faced capuchins","brown capuchins","capuchin monkey habitat","capuchin monkey diet","capuchin monkey behavior"],"synonyms":["Cebus monkeys"],"antonyms":[]},{"part_of_speech":"noun","definition":"(複数形) カプチン修道会士","english_definition":"(plural noun) members of the Order of Friars Minor Capuchin, a Roman Catholic religious order.","examples":[{"sentence":"The capuchins are known for their simple lifestyle and dedication to serving the poor.","translation":"カプチン修道会士は、質素な生活と貧しい人々への献身で知られています。"},{"sentence":"The capuchins established a mission in the Amazon rainforest.","translation":"カプチン修道会士はアマゾンの熱帯雨林に伝道所を設立しました。"}],"collocations":["Capuchin monastery","Capuchin order","Capuchin friars","Capuchin habit"],"synonyms":["Capuchin friars"],"antonyms":[]}],"etymology":{"value":"The word \"capuchin\" comes from the Italian word \"cappuccino,\" which refers to the hood worn by monks of the Capuchin order. The monkeys were named after the monks because their facial markings and coloration resembled the monks' hooded robes.","priority":"★★☆"},"pronunciation":{"ipa":"/kəˈpjuːtʃɪnz/","syllables":"ca-pu-chins"},"inflection":{"noun_plural":"capuchins"},"usage_notes":{"explanation":"The word \"capuchins\" can refer to either the monkeys or the members of the Capuchin religious order. The context usually makes it clear which meaning is intended. When referring to a single monkey or friar, the singular form \"capuchin\" is used.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ capuchin (when referring to multiple monkeys)","correct":"✓ capuchins (plural form)","note":"Remember to use the plural form \"capuchins\" when referring to more than one monkey or friar."}],"priority":"★★☆"},"related_words":{"derivatives":["capuchin (singular form of the noun)"],"phrasal_verbs":[],"related_terms":["monk","monkey","Cebus","friar","religious order"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"capuchins\" has two distinct meanings, referring either to a type of monkey or to members of a specific religious order. Understanding the context is crucial to correctly interpret the intended meaning. The term is derived from the resemblance of the monkeys' appearance to the hooded robes worn by Capuchin monks, adding an interesting historical and cultural connection to the word's usage."},"example_sentences":[{"sentence":"The playful capuchins swung through the trees.","translation":"遊び好きなオマキザルが木々を揺れ動いた。","type":"noun","meaning_category":"monkeys"},{"sentence":"The capuchins dedicated their lives to serving the community.","translation":"カプチン修道会士は地域社会への奉仕に生涯を捧げた。","type":"noun","meaning_category":"friars"}]}