{"word":"Ophionid","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A member of the Ichneumonidae family, subfamily Ophioninae.","english_definition":"A wasp of the subfamily Ophioninae in the family Ichneumonidae.","examples":[{"sentence":"The Ophionid wasp is a nocturnal insect.","translation":"オフィオンイドスズメバチは夜行性の昆虫です。"}],"collocations":["Ophionid wasp","Ophionid larva"],"synonyms":["Ichneumon wasp"],"antonyms":[]}],"etymology":{"value":"From the genus name *Ophion* + -id. *Ophion* is derived from Greek *ophis* (ὄφις) meaning 'snake', referring to the snake-like appearance of some species.","priority":"★★☆"},"pronunciation":{"ipa":"/ɒˈfaɪənɪd/","syllables":"O-phi-o-nid"},"inflection":{"noun_plural":"Ophionids"},"usage_notes":{"explanation":"Ophionid wasps are typically nocturnal and are parasitoids, meaning their larvae develop inside or on another insect, eventually killing it. They are beneficial insects as they help control populations of other insects.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★★★"},"related_words":{"derivatives":["Ophioninae (subfamily)","Ichneumonidae (family)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Ophionids are a specific type of parasitic wasp, primarily active at night. They belong to the subfamily Ophioninae within the larger Ichneumonidae family. Their larvae are parasitoids, developing on or inside other insects, ultimately leading to the host's death. This makes them a beneficial insect for controlling other insect populations. The term is relatively specialized and not commonly encountered outside of entomological contexts."},"example_sentences":[{"sentence":"The light attracted many insects, including an Ophionid wasp.","translation":"その光は多くの昆虫を引き寄せ、その中にはオフィオンイドスズメバチもいた。","type":"noun","meaning_category":"insect"},{"sentence":"Ophionid wasps are known for their slender, elongated bodies.","translation":"オフィオンイドスズメバチは、細長く伸びた体で知られている。","type":"noun","meaning_category":"insect"}]}