{"word":"uranographer","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"天体図製作者、星図製作者","english_definition":"A person who draws or makes maps of the heavens or celestial bodies; a celestial cartographer.","examples":[{"sentence":"Tycho Brahe was a famous uranographer who meticulously charted the positions of stars.","translation":"ティコ・ブラーエは、星の位置を綿密に記録した有名な天体図製作者でした。"},{"sentence":"Early uranographers often combined artistic skill with astronomical observation.","translation":"初期の天体図製作者は、芸術的なスキルと天文学的な観察を組み合わせていました。"}],"collocations":["celestial map","star chart","astronomical atlas"],"synonyms":["celestial cartographer","astronomer","star mapper"],"antonyms":[]}],"etymology":{"value":"The word \"uranographer\" comes from the combination of \"urano-\" (referring to the heavens or sky, derived from Greek \"ουρανός\" (ouranos) meaning \"sky\" or \"heaven\") and \"-grapher\" (referring to someone who writes or draws, from Greek \"γράφειν\" (graphein) meaning \"to write\" or \"to draw\").","priority":"★★★"},"pronunciation":{"ipa":"/juːˈræ.nɒɡ.rə.fər/","syllables":"u-ra-nog-ra-pher"},"inflection":{"noun_plural":"uranographers"},"usage_notes":{"explanation":"The term \"uranographer\" is somewhat archaic, with the role now largely encompassed by modern astronomers and astrophysicists who use digital tools and advanced telescopes. However, it specifically refers to the historical practice of creating detailed maps and charts of the stars and constellations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a uranography.","correct":"✓ He is an uranographer.","note":"\"Uranography\" is the study or practice of mapping the heavens; \"uranographer\" is the person who does it."}],"priority":"★★☆"},"related_words":{"derivatives":["uranography (noun: the art or science of mapping the heavens)"],"related_terms":["astronomy","astrophysics","cartography","celestial mechanics"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - The term is rarely used in modern contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"uranographer\" refers to someone who makes maps of the stars and other celestial bodies. It's a somewhat old-fashioned term, as modern astronomers use computers and advanced technology to do this work. If you encounter this word, it's usually in the context of historical astronomy or discussions about the history of star charts and celestial mapping."},"example_sentences":[{"sentence":"Johannes Bayer, a 17th-century uranographer, created the \"Uranometria,\" one of the most influential star atlases of its time.","translation":"17世紀の天体図製作者であるヨハンネス・バイヤーは、当時最も影響力のある星図の一つである『ウラノメトリア』を作成しました。","type":"noun","meaning_category":"天体図製作者"},{"sentence":"The uranographer carefully plotted the positions of newly discovered nebulae on his chart.","translation":"その天体図製作者は、新たに発見された星雲の位置を注意深く図に描き込みました。","type":"noun","meaning_category":"天体図製作者"}]}