{"word":"wandering-gazed","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"さまようような視線を向けている、ぼんやりと見つめている","english_definition":"Having a gaze that is unfocused, roaming, or lost in thought; looking around aimlessly or thoughtfully.","examples":[{"sentence":"She sat by the window, wandering-gazed at the falling snow.","translation":"彼女は窓際に座り、さまようような視線で降る雪を見つめていた。"},{"sentence":"He had a wandering-gazed expression, as if lost in a daydream.","translation":"彼は白昼夢を見ているかのように、ぼんやりとした表情をしていた。"}],"collocations":["wandering-gazed expression (ぼんやりとした表情)","wandering-gazed look (さまようような視線)"],"synonyms":["absent-minded","dreamy-eyed","vacant-eyed","lost in thought","roaming gaze"],"antonyms":["focused","attentive","concentrated"],"notes":"This is a compound adjective combining the ideas of 'wandering' and 'gazing.' It describes a particular quality of a person's gaze."}],"etymology":{"value":"Combination of 'wandering' (moving without a fixed course or destination) and 'gazed' (looked steadily and intently, often in wonder or thought).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɒndərɪŋ ˈɡeɪzd/","syllables":"won-der-ing-gazed"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"'Wandering-gazed' is a descriptive adjective, often used to depict someone who is lost in thought, daydreaming, or simply looking around without a specific focus. It suggests a lack of concentration or a dreamy state.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was wandering-gazed around the city.","correct":"✓ He wandered around the city, gazing at the sights.","note":"'Wandering-gazed' describes the gaze, not the action of wandering itself. To describe someone moving around and looking, use separate verbs."}],"priority":"★☆☆"},"related_words":{"derivatives":["wandering (adjective, noun)","gaze (verb, noun)","gazing (adjective)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - not a common term, more descriptive.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Wandering-gazed' is a relatively uncommon and descriptive adjective. It is used to describe someone whose gaze is unfocused and seems to be roaming around, often because they are lost in thought or daydreaming. The term combines the idea of 'wandering' (moving aimlessly) and 'gazing' (looking steadily)."},"example_sentences":[{"sentence":"The artist depicted the shepherd with a wandering-gazed expression, capturing his peaceful contemplation.","translation":"画家は羊飼いを、さまようような視線をたたえた表情で描き、彼の穏やかな瞑想を捉えた。","type":"adjective","meaning_category":"descriptive"},{"sentence":"Her wandering-gazed eyes betrayed her distraction during the lecture.","translation":"彼女のさまようような視線は、講義中に気が散っていることを物語っていた。","type":"adjective","meaning_category":"descriptive"}]}