{"word":"lineature","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(印刷)線数、網点数","english_definition":"The number of lines or dots per unit of length in a halftone screen or printed image.","examples":[{"sentence":"The lineature of the halftone screen affects the detail and sharpness of the printed image.","translation":"ハーフトーンスクリーンの線数は、印刷された画像のディテールと鮮明さに影響を与えます。"}],"collocations":["screen lineature","halftone lineature"],"synonyms":["screen ruling"],"antonyms":[]}],"etymology":{"value":"Derived from 'line' and the suffix '-ature', indicating a system or arrangement of lines.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɪniətʃər/","syllables":"lin-e-a-ture"},"inflection":{"noun_plural":"lineatures"},"usage_notes":{"explanation":"'Lineature' is a technical term primarily used in the printing and graphic arts industries to describe the fineness of a halftone screen. It is a key factor in determining the quality of printed images, with higher lineatures generally resulting in greater detail.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lineature was too coarse, so the image was blurry.","correct":"✓ The lineature was too coarse, so the image was blurry.","note":"Correct spelling and usage of the term."}],"priority":"★★☆"},"related_words":{"derivatives":["line","linear"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Lineature' is a specialized term used in printing and graphic design, referring to the density of lines or dots in a halftone screen. Understanding this term requires familiarity with printing processes and image reproduction techniques."},"example_sentences":[{"sentence":"Choosing the correct lineature is crucial for achieving the desired print quality.","translation":"適切な線数を選択することは、望ましい印刷品質を達成するために重要です。","type":"noun","meaning_category":"印刷"},{"sentence":"The printer adjusted the lineature to improve the tonal range of the photograph.","translation":"プリンターは、写真の階調範囲を改善するために線数を調整しました。","type":"noun","meaning_category":"印刷"}]}