{"word":"ScrapieS","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"スクレイピー (ヒツジやヤギの伝染性海綿状脳症)","english_definition":"A fatal, degenerative disease affecting the central nervous system of sheep and goats. It is classified as a transmissible spongiform encephalopathy (TSE).","examples":[{"sentence":"Scrapie is a prion disease that affects sheep.","translation":"スクレイピーはヒツジに影響を与えるプリオン病です。"},{"sentence":"The farmer reported a case of scrapie in his flock.","translation":"農家は自分の群れでスクレイピーの症例を報告しました。"}],"collocations":["scrapie agent","scrapie prion","scrapie-free","scrapie surveillance"],"synonyms":["transmissible spongiform encephalopathy (TSE)","prion disease"],"antonyms":[]},{"part_of_speech":"noun","definition":"(複数形) スクレピーに感染した動物","english_definition":"Animals infected with scrapie.","examples":[{"sentence":"The scrapies were isolated from the rest of the flock to prevent further spread of the disease.","translation":"スクレイピーに感染した動物は、病気のさらなる蔓延を防ぐために、群れの残りの部分から隔離されました。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the Middle English word \"scrapie,\" referring to the tendency of affected animals to scrape their bodies against objects due to intense itching.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskreɪpiːz/","syllables":"Scra-pies"},"inflection":{"noun_plural":"scrapies (already plural, referring to multiple cases or animals)"},"usage_notes":{"explanation":"\"Scrapie\" is primarily a veterinary term. It's important to note that while the word itself is singular, it is often used in the plural form (\"scrapies\") to refer to multiple affected animals or instances of the disease.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I think my dog has scrapie.","correct":"✓ Scrapie only affects sheep and goats.","note":"Scrapie is specific to sheep and goats and does not affect dogs or other common pets."}],"priority":"★★☆"},"related_words":{"derivatives":["scrapie-associated prion protein (PrPSc)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"scrapies\" refers to a specific prion disease affecting sheep and goats. Understanding this term requires knowledge of veterinary medicine and prion diseases. While the word itself is not inherently complex, the concept it represents is highly specialized."},"example_sentences":[{"sentence":"The outbreak of scrapies led to the culling of many sheep.","translation":"スクレイピーの発生により、多くの羊が淘汰されることになった。","type":"noun","meaning_category":"disease"},{"sentence":"Researchers are studying the scrapies prion protein to understand the disease's progression.","translation":"研究者たちは、病気の進行を理解するために、スクレイピーのプリオンタンパク質を研究している。","type":"noun","meaning_category":"disease"}]}