{"word":"Leukocytoplania","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(medicine) A condition characterized by the presence of leukocytes (white blood cells) outside the blood vessels and within tissues, often indicating inflammation or infection.","english_definition":"The presence of leukocytes outside blood vessels and within tissues.","examples":[{"sentence":"Leukocytoplania was observed in the biopsy sample, suggesting an inflammatory process.","translation":"生検サンプルにおいて白血球遊走が観察され、炎症過程を示唆した。"}],"collocations":["observe leucocytoplania","detect leucocytoplania","evidence of leucocytoplania"],"synonyms":["leukocyte extravasation","leukocyte infiltration"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'leuko' (white), 'cyto' (cell), 'plan' (wandering), and '-ia' (condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌljuːkoʊˌsaɪtoʊpleɪˈniːə/","syllables":"Leu-co-cy-to-pla-ni-a"},"inflection":{"noun_plural":"leukocytoplanias"},"usage_notes":{"explanation":"Leukocytoplania is a descriptive term rather than a specific diagnosis. It indicates a pathological process involving the migration of leukocytes into tissues. This is a common finding in various inflammatory and infectious conditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor diagnosed him with leucocytoplania.","correct":"✓ The doctor observed leucocytoplania in the tissue sample.","note":"Leukocytoplania is a finding, not a diagnosis in itself."}],"priority":"★★☆"},"related_words":{"derivatives":["leukocyte","inflammation","infection"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Leukocytoplania is a highly specialized medical term referring to the presence of white blood cells outside of blood vessels and within tissues, typically indicative of an inflammatory or infectious process. Understanding this term requires a strong background in medical terminology and pathology. It is not a commonly used word outside of professional medical contexts."},"example_sentences":[{"sentence":"The pathologist noted significant leucocytoplania in the lung tissue, indicating pneumonia.","translation":"病理医は肺組織における著しい白血球遊走を指摘し、肺炎を示唆した。","type":"medical finding","meaning_category":"inflammation"},{"sentence":"Evidence of leucocytoplania was found near the site of the injury.","translation":"負傷部位の近くで白血球遊走の証拠が見つかった。","type":"medical finding","meaning_category":"inflammation"}]}