{"word":"Poikilocythemia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"異形赤血球症","english_definition":"The presence of poikilocytes (abnormally shaped red blood cells) in the blood.","examples":[{"sentence":"Poikilocythemia can be indicative of certain anemias or other blood disorders.","translation":"異形赤血球症は、特定の貧血やその他の血液疾患の兆候である可能性があります。"}],"collocations":["severe poikilocythemia","mild poikilocythemia"],"synonyms":["anisocytosis (related, but refers to variation in size)"],"antonyms":[]}],"etymology":{"value":"From Greek 'poikilos' (varied, spotted) + 'kytos' (cell) + 'emia' (blood condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɔɪkɪləˌsaɪˈθiːmiə/","syllables":"poi-ki-lo-cy-the-mi-a"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Poikilocythemia is a descriptive term, not a diagnosis itself. It indicates that further investigation is needed to determine the underlying cause of the abnormal red blood cell shapes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Poikilocythemia is a disease.","correct":"✓ Poikilocythemia is a condition indicating the presence of abnormally shaped red blood cells.","note":"Poikilocythemia is a finding, not a specific disease. It points to an underlying issue."}],"priority":"★★☆"},"related_words":{"derivatives":["poikilocyte (異形赤血球)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2 (technical medical vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Poikilocythemia' is a highly specialized medical term referring to the presence of abnormally shaped red blood cells in the blood. It's primarily used in hematology and pathology contexts. Understanding requires familiarity with medical terminology related to blood cell morphology."},"example_sentences":[{"sentence":"The blood smear revealed significant poikilocythemia, prompting further diagnostic tests.","translation":"血液塗抹標本では著しい異形赤血球症が認められ、さらなる診断検査が必要となった。","type":"medical report","meaning_category":"hematology"},{"sentence":"Different types of poikilocytes can provide clues about the specific cause of the underlying anemia.","translation":"異なる種類の異形赤血球は、基礎となる貧血の特定原因に関する手がかりを提供できます。","type":"medical textbook","meaning_category":"pathology"}]}