{"word":"nonabsorbability","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"非吸収性、吸収されない性質","english_definition":"The quality or state of not being able to be absorbed.","examples":[{"sentence":"The nonabsorbability of the material makes it suitable for waterproof applications.","translation":"その素材の非吸収性により、防水用途に適しています。"},{"sentence":"The drug's nonabsorbability in the digestive tract limits its effectiveness when taken orally.","translation":"その薬物が消化管で吸収されないため、経口投与した場合の効果が制限されます。"}],"collocations":["material nonabsorbability","drug nonabsorbability","inherent nonabsorbability"],"synonyms":["impermeability","repellency","nonporosity"],"antonyms":["absorbability","permeability","porosity"]}],"etymology":{"value":"'non-' (否定) + 'absorbability' (吸収性)","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnəbˌzɔːrbaˈbɪləti/","syllables":"non-ab-sor-ba-bil-i-ty"},"inflection":{"noun_plural":"nonabsorbabilities"},"usage_notes":{"explanation":"'Nonabsorbability' refers to the characteristic of a substance or material that prevents it from absorbing liquids or other substances. It is often a desirable property in applications where preventing absorption is important, such as in waterproof coatings or certain medical implants.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonabsorbability is good for the product.","correct":"✓ The nonabsorbability of the material is good for the product.","note":"It is better to specify what has nonabsorbability."}],"priority":"★★☆"},"related_words":{"derivatives":["nonabsorbent (adjective)","absorbability (noun)","absorbent (adjective)","absorb (verb)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nonabsorbability' is a technical term used to describe the property of a substance that does not absorb liquids or other substances. It is commonly used in scientific and technical contexts, particularly in materials science, chemistry, and medicine. Understanding this term requires a good command of scientific vocabulary and the ability to comprehend complex concepts related to material properties.","priority":"★★☆"},"example_sentences":[{"sentence":"The nonabsorbability of the plastic ensures that it remains waterproof.","translation":"そのプラスチックの非吸収性により、防水性が確保されます。","type":"general","meaning_category":"property"},{"sentence":"The scientist tested the nonabsorbability of the new coating.","translation":"科学者は新しいコーティングの非吸収性をテストしました。","type":"scientific","meaning_category":"testing"},{"sentence":"Due to its nonabsorbability, the chemical is safe for external use.","translation":"その化学物質は非吸収性のため、外用として安全です。","type":"chemical","meaning_category":"safety"}]}