{"word":"trapezoid","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"台形","english_definition":"A quadrilateral with at least one pair of parallel sides.","examples":[{"sentence":"The tabletop was shaped like a trapezoid.","translation":"テーブルトップは台形の形をしていた。"},{"sentence":"Calculate the area of the trapezoid.","translation":"台形の面積を計算しなさい。"}],"collocations":["isosceles trapezoid (等脚台形)","right trapezoid (直角台形)","area of a trapezoid (台形の面積)"],"synonyms":["trapezium (British English)"],"antonyms":[]}],"etymology":{"value":"From Late Latin *trapezium*, from Greek *trapezion* (τραπέζιον), literally 'a little table', from *trapeza* (τράπεζα) 'table', plus the diminutive suffix *-ion*. The term was originally used for any irregular quadrilateral, but its meaning narrowed over time.","priority":"★★☆"},"pronunciation":{"ipa":"ˈtræpɪzɔɪd","syllables":"trap-e-zoid"},"inflection":{"noun_plural":"trapezoids"},"usage_notes":{"explanation":"In American English, a *trapezoid* is a quadrilateral with at least one pair of parallel sides. In British English, this shape is usually called a *trapezium*. The term *trapezoid* in British English refers to a quadrilateral with no parallel sides. Be aware of this difference when communicating with people from different English-speaking countries.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The trapezoid has two parallel sides and two equal sides.","correct":"✓ The trapezoid has at least two parallel sides. The two non-parallel sides may or may not be equal.","note":"A trapezoid only requires at least one pair of parallel sides. The other sides can be of any length, and may or may not be equal."}],"priority":"★☆☆"},"related_words":{"derivatives":["trapezoidal (adjective)"],"phrasal_verbs":[],"related_terms":["quadrilateral","parallelogram","rectangle","square","rhombus","polygon"]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"trapezoid\" refers to a specific type of four-sided shape (quadrilateral) in geometry. Its defining characteristic is having at least one pair of parallel sides. It's a term primarily used in mathematics and technical contexts, so it's not commonly encountered in everyday conversation. Understanding the term is crucial for comprehending geometric concepts and solving related problems. Note the difference in terminology between American and British English.","priority":"★☆☆"},"example_sentences":[{"sentence":"The architect used trapezoids in the design of the building's facade.","translation":"建築家は建物のファサードのデザインに台形を使用した。","type":"general","meaning_category":"shape"},{"sentence":"The formula for calculating the area of a trapezoid involves the lengths of its parallel sides and its height.","translation":"台形の面積を計算する公式は、平行な辺の長さと高さを使用する。","type":"mathematical","meaning_category":"area calculation"}]}