{"word":"overrepresentatively","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"代表されるべき割合以上に代表して、過剰に代表して","english_definition":"in a way that gives a disproportionately large amount of something to someone or something; in a manner that represents something to a greater extent than is actually the case.","examples":[{"sentence":"Women are overrepresentatively employed in the healthcare sector.","translation":"女性は医療部門で代表されるべき割合以上に雇用されている。"},{"sentence":"Minorities are overrepresentatively incarcerated compared to their proportion of the population.","translation":"少数派は人口比率と比較して過剰に投獄されている。"}],"collocations":["overrepresentatively employed","overrepresentatively incarcerated","overrepresentatively featured"],"synonyms":["disproportionately","excessively","unduly","inordinately"],"antonyms":["underrepresentatively","proportionately","equally"]}],"etymology":{"value":"'over-' (過剰に) + 'representatively' (代表して)","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌoʊvərˌrɛprɪˈzɛntətɪvli/","syllables":"o-ver-re-pre-sen-ta-tive-ly"},"inflection":{"notes":"This word is an adverb and does not have different inflections."},"usage_notes":{"explanation":"This adverb is used to indicate that a particular group or thing is represented to a greater degree than would be expected based on its actual size or importance. It often implies an imbalance or unfairness in representation.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The study overrepresentatively.","correct":"✓ The study showed data overrepresentatively.","note":"The adverb needs a verb to modify. Ensure the sentence structure allows for the adverb to properly modify a verb or adjective."}],"priority":"☆☆☆"},"related_words":{"derivatives":["overrepresent (verb)","overrepresentation (noun)"],"priority":"☆☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"This is a complex word used in formal contexts, particularly in discussions of statistics, demographics, and social issues. It indicates that a particular group or category is represented in a way that is disproportionately large compared to its actual size or prevalence. Understanding requires a strong vocabulary and familiarity with abstract concepts related to representation and proportionality."},"example_sentences":[{"sentence":"In the survey, younger voters were overrepresentatively sampled, skewing the results.","translation":"調査では、若い有権者が代表されるべき割合以上にサンプルとして抽出され、結果が歪められた。","type":"general","meaning_category":"disproportionate representation"},{"sentence":"The media overrepresentatively covers stories about crime in wealthy neighborhoods.","translation":"メディアは富裕層の近隣における犯罪に関する話を代表されるべき割合以上に報道する。","type":"general","meaning_category":"disproportionate coverage"}]}