{"word":"undenunciated","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"非難されていない、公に非難されていない","english_definition":"Not publicly denounced or condemned.","examples":[{"sentence":"The politician's actions, while controversial, remained undenunciated by his party.","translation":"その政治家の行動は物議を醸したが、彼の党からは非難されなかった。"},{"sentence":"The company's unethical practices went undenunciated for years, allowing them to continue.","translation":"その会社の非倫理的な慣行は長年非難されず、継続を許された。"}],"collocations":["remain undenunciated","go undenunciated"],"synonyms":["uncondemned","uncriticized","unreproached","unblamed"],"antonyms":["denounced","condemned","criticized","reproached","blamed"]}],"etymology":{"value":"\"Un-\" (not) + \"denunciated\" (past participle of \"denounce\"). Denounce comes from Latin \"denuntiare\" (to announce officially, to threaten).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndɪˈnʌnsieɪtɪd/","syllables":"un-de-nun-ci-a-ted"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"\"Undenunciated\" describes something that has not been publicly and formally criticized or condemned. It often implies that something *should* have been denounced, but for some reason, it wasn't. It suggests a lack of accountability or a failure to speak out against something wrong.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The undenunciated joy of the crowd was palpable.","correct":"✓ The unbridled joy of the crowd was palpable.","note":"\"Undenunciated\" refers to a lack of condemnation, not a lack of restraint. Use \"unbridled\" or \"unrestrained\" to describe joy that is freely expressed."}],"priority":"★★☆"},"related_words":{"derivatives":["denounce (verb)","denunciation (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"undenunciated\" is a relatively rare and formal word. It means that something has not been publicly criticized or condemned, even though it might deserve to be. It is often used in political or ethical contexts. Because it is not a common word, it is more likely to be encountered in advanced reading materials or formal discussions."},"example_sentences":[{"sentence":"The government's silence on the human rights abuses left the atrocities undenunciated.","translation":"政府が人権侵害について沈黙したため、その残虐行為は非難されずに終わった。","type":"adjective","meaning_category":"Not publicly condemned"},{"sentence":"Despite the evidence, the company's fraudulent activities remained undenunciated by the regulatory bodies.","translation":"証拠があるにもかかわらず、その会社の不正行為は規制当局によって非難されなかった。","type":"adjective","meaning_category":"Not publicly condemned"}]}