{"word":"goniometer","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"角度計、ゴニオメーター","english_definition":"an instrument for the precise measurement of angles, especially in crystallography.","examples":[{"sentence":"The goniometer is used to measure the angles between crystal faces.","translation":"ゴニオメーターは、結晶面の間の角度を測定するために使用されます。"},{"sentence":"The geologist used a goniometer to determine the angles of the rock strata.","translation":"地質学者は、岩層の角度を決定するためにゴニオメーターを使用しました。"}],"collocations":["X-ray goniometer","optical goniometer","measure angles with a goniometer","adjust the goniometer"],"synonyms":["angle meter","protractor"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'gonia' (angle) and 'metron' (measure).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡoʊniˈɑːmɪtər/","syllables":"go-ni-o-me-ter"},"inflection":{"noun_plural":"goniometers"},"usage_notes":{"explanation":"A goniometer is a precision instrument used to measure angles. It is commonly used in crystallography to determine the angles between crystal faces, and in geology to measure the angles of rock strata. Goniometers are also used in other fields, such as medicine and engineering, to measure joint angles and other angles.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a protractor, which is a type of goniometer.","correct":"✓ I used a goniometer to measure the angle.","note":"A protractor is a simpler instrument for measuring angles. A goniometer is a more precise instrument."}],"priority":"★☆☆"},"related_words":{"derivatives":["goniometry (the science or art of measuring angles)"],"related_terms":["crystallography","spectrometer","theodolite"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'goniometer' is a technical term primarily used in scientific and engineering contexts. It refers to a precision instrument used for measuring angles, particularly in crystallography and geology. Understanding this term requires some familiarity with these fields. The word itself is derived from Greek roots, reflecting its scientific origin."},"example_sentences":[{"sentence":"The X-ray **goniometer** allowed for precise determination of the crystal structure.","translation":"X線ゴニオメーターにより、結晶構造を正確に決定することができました。","type":"general","meaning_category":"definition"},{"sentence":"The physical therapist used a **goniometer** to assess the patient's range of motion.","translation":"理学療法士はゴニオメーターを使用して、患者の可動域を評価しました。","type":"medical","meaning_category":"application"}]}