{"word":"sexistically","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"性差別的に","english_definition":"In a manner that shows prejudice, stereotyping, or discrimination on the basis of sex, typically against women.","examples":[{"sentence":"The advertisement was criticized for portraying women sexistically.","translation":"その広告は、女性を性差別的に描いているとして批判された。"},{"sentence":"He argued that the policy was applied sexistically, favoring men over women.","translation":"彼は、その政策が性差別的に適用され、女性よりも男性を優遇していると主張した。"},{"sentence":"The company was accused of treating its female employees sexistically.","translation":"その会社は、女性従業員を性差別的に扱っていると非難された。"}],"collocations":["treat someone sexistically (誰かを性差別的に扱う)","portray someone sexistically (誰かを性差別的に描く)","apply something sexistically (何かを性差別的に適用する)","act sexistically (性差別的に行動する)"],"synonyms":["discriminatorily","prejudicially","unfairly","inequitably"],"antonyms":["fairly","equitably","impartially","justly"]}],"etymology":{"value":"The word 'sexistically' is derived from 'sexist,' which combines 'sex' (referring to biological sex) with the suffix '-ist' (denoting someone who practices or believes in a certain ideology). The suffix '-ly' is added to 'sexist' to form the adverb 'sexistically,' indicating the manner in which something is done.","priority":"★☆☆"},"pronunciation":{"ipa":"/sɛkˈsɪstɪkli/","syllables":"sex-ist-i-cal-ly"},"inflection":{"notes":"This is an adverb and does not have different forms."},"usage_notes":{"explanation":"'Sexistically' is used to describe actions, behaviors, or representations that perpetuate or reflect sexism. It implies a bias or prejudice based on gender, often resulting in unfair or discriminatory treatment. The term is often used in discussions about gender equality, social justice, and media representation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He sexistically discriminated against women.","correct":"✓ He discriminated against women sexistically. / ✓ He discriminated against women in a sexist manner.","note":"The word 'discriminate' already implies a biased action, so using 'sexistically discriminate' can be redundant. It's better to use 'discriminate sexistically' or rephrase the sentence to use 'sexist manner' instead."},{"incorrect":"✗ The movie was sexisticly made.","correct":"✓ The movie was sexistically made.","note":"The correct spelling of the adverb is 'sexistically,' not 'sexisticly'."}],"priority":"★☆☆"},"related_words":{"derivatives":["sexist (adjective, noun)","sexism (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'sexistically' is an adverb that describes doing something in a way that shows sexism. Sexism is prejudice or discrimination based on a person's sex or gender. Using 'sexistically' means that someone is acting in a way that unfairly favors one gender over another, often women. This word is often used in discussions about social justice and equality.","priority":"★★☆"},"example_sentences":[{"sentence":"The interviewer asked the female candidate sexistically phrased questions about her family plans.","translation":"面接官は、女性候補者に対して、彼女の家族計画について性差別的な表現で質問した。","type":"adverb","meaning_category":"showing prejudice"},{"sentence":"The toys were marketed sexistically, with pink dolls for girls and blue trucks for boys.","translation":"おもちゃは性差別的に販売され、女の子にはピンクの人形、男の子には青いトラックが売られた。","type":"adverb","meaning_category":"stereotyping"},{"sentence":"The judge ruled that the company had acted sexistically in denying the promotion to the qualified female employee.","translation":"裁判官は、会社が有能な女性従業員の昇進を拒否したことは性差別的な行為であると判決を下した。","type":"adverb","meaning_category":"discrimination"}]}