{"word":"Impleader","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(法律) 第三者加入請求、求償請求","english_definition":"(law) A procedure by which a defendant in a lawsuit may bring in a third party who is liable to the defendant for all or part of the plaintiff's claim against the defendant.","examples":[{"sentence":"The defendant filed an impleader to bring in the subcontractor.","translation":"被告は、下請け業者を訴訟に引き込むために第三者加入請求を申し立てた。"},{"sentence":"Impleader is often used in construction defect cases.","translation":"第三者加入請求は、建設欠陥訴訟でよく使用される。"}],"collocations":["file an impleader","impleader action","impleader claim","impleader statute"],"synonyms":["third-party complaint","contribution claim","indemnity claim"],"antonyms":[]}],"etymology":{"value":"The term 'impleader' comes from the Middle English word 'impleden', meaning 'to sue' or 'to prosecute'. It is related to the word 'plead'.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪmˈpliːdər/","syllables":"im-plead-er"},"inflection":{"noun_plural":"impleaders"},"usage_notes":{"explanation":"Impleader is a procedural device used in civil litigation. It allows a defendant to bring a third party into a lawsuit if that third party may be liable to the defendant for some or all of the plaintiff's damages. The purpose is to avoid multiple lawsuits and ensure that all related claims are resolved in a single action. The rules governing impleader vary by jurisdiction.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The plaintiff filed an impleader against the third party.","correct":"✓ The defendant filed an impleader against the third party.","note":"Only the defendant can file an impleader to bring in a third party. The plaintiff cannot use impleader."},{"incorrect":"✗ Impleader is used to sue the plaintiff's insurance company.","correct":"✓ Impleader is used to sue a third party who may be liable to the defendant.","note":"Impleader is not used to directly sue the plaintiff's insurance company. It is used to bring in a third party who may owe indemnity or contribution to the defendant."}],"priority":"★★☆"},"related_words":{"derivatives":["implead (verb): to bring (someone) into a lawsuit"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Impleader' is a legal term referring to a procedural mechanism that allows a defendant to bring a third party into an existing lawsuit. This is done when the defendant believes that the third party may be liable for some or all of the damages claimed by the plaintiff. The purpose is to resolve all related claims in a single case, promoting efficiency and preventing inconsistent judgments. This term is typically encountered in legal contexts and requires an understanding of civil procedure."},"example_sentences":[{"sentence":"The company sought **impleader** of its insurance carrier to cover potential liabilities.","translation":"その会社は、潜在的な責任をカバーするために、保険会社に対する第三者加入請求を求めた。","type":"noun","meaning_category":"求償請求"},{"sentence":"Under Rule 14 of the Federal Rules of Civil Procedure, a defendant may assert an **impleader** claim.","translation":"連邦民事訴訟規則第14条に基づき、被告は第三者加入請求を主張することができる。","type":"noun","meaning_category":"第三者加入請求"}]}