{"word":"supersensitization","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"過敏化、超感受性亢進","english_definition":"An increased sensitivity to a stimulus after exposure to it, often after a period of deprivation; also, the process by which this occurs.","examples":[{"sentence":"Denervation supersensitization can occur when a nerve is damaged.","translation":"脱神経過敏は神経が損傷した際に起こりうる。"},{"sentence":"Repeated exposure to the drug can lead to supersensitization of the receptors.","translation":"薬物への反復暴露は受容体の過敏化を引き起こす可能性がある。"}],"collocations":["denervation supersensitization","receptor supersensitization","develop supersensitization","induce supersensitization"],"synonyms":["hypersensitivity","sensitization","increased sensitivity"],"antonyms":["desensitization","tolerance"]}],"etymology":{"value":"The word is formed by combining 'super-' (meaning 'above' or 'beyond') with 'sensitization' (the process of becoming sensitive).","priority":"★★☆"},"pronunciation":{"ipa":"ˌsuːpərˌsɛnsɪtaɪˈzeɪʃən/","syllables":"su-per-sen-si-ti-za-tion"},"inflection":{"noun_plural":"supersensitizations"},"usage_notes":{"explanation":"Supersensitization refers to an increased response to a stimulus. In neurobiology, it often describes the increased sensitivity of a neuron to a neurotransmitter after a period of reduced stimulation or after damage to the nerve. It can also refer to an increased sensitivity to a drug or other substance after repeated exposure or withdrawal.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient showed super sensitivity.","correct":"✓ The patient showed supersensitization.","note":"'Supersensitization' is the specific term for the process or state of increased sensitivity, while 'super sensitivity' is a more general term and may not be appropriate in a technical context."}],"priority":"★☆☆"},"related_words":{"derivatives":["supersensitive (adjective)","sensitization (noun)","desensitization (noun)"],"related_terms":["upregulation (related mechanism in receptor biology)","denervation (cause of some types of supersensitization)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in scientific and medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Supersensitization' is a technical term primarily used in biology, medicine, and pharmacology. It describes a process where an organism or a specific tissue becomes more sensitive to a particular stimulus than it was previously. This often occurs after a period of reduced exposure to the stimulus or as a result of certain physiological changes. Understanding this term requires some background knowledge in these fields."},"example_sentences":[{"sentence":"Following long-term opioid use, patients can experience receptor supersensitization, leading to increased pain sensitivity upon withdrawal.","translation":"長期的なオピオイド使用後、患者は受容体過敏化を経験することがあり、離脱時に痛みの感受性が増加する。","type":"general","meaning_category":"general"},{"sentence":"Denervation supersensitization in smooth muscle can result in exaggerated responses to neurotransmitters.","translation":"平滑筋における脱神経過敏は、神経伝達物質に対する過剰な反応を引き起こす可能性がある。","type":"specific","meaning_category":"medical"}]}