{"word":"aeropause","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"大気圏と宇宙空間との境界領域","english_definition":"The region of gradual transition between the earth's atmosphere and outer space.","examples":[{"sentence":"The aeropause is where aerodynamic flight is no longer possible.","translation":"航空力学的な飛行がもはや不可能になるのが、大気圏界面である。"},{"sentence":"Satellites in low Earth orbit experience some atmospheric drag even in the aeropause.","translation":"低軌道の衛星は大気圏界面でも若干の大気抵抗を受ける。"}],"collocations":["enter the aeropause","exit the aeropause","atmospheric drag in the aeropause"],"synonyms":["exobase","thermopause"],"antonyms":[]},{"part_of_speech":"noun","definition":"航空機や宇宙船が航空力学的な制御を失う高度","english_definition":"The altitude at which an aircraft or spacecraft loses aerodynamic control.","examples":[{"sentence":"The space shuttle passes through the aeropause during reentry.","translation":"スペースシャトルは大気圏再突入時に大気圏界面を通過する。"},{"sentence":"Maintaining stability above the aeropause requires reaction control systems.","translation":"大気圏界面より上で安定性を維持するには、姿勢制御システムが必要となる。"}],"collocations":["fly above the aeropause","control systems for the aeropause"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from 'aero-' (referring to air or atmosphere) and 'pause' (referring to a cessation or boundary).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛəroʊˈpɔːz/","syllables":"a-er-o-pause"},"inflection":{"noun_plural":"aeropauses"},"usage_notes":{"explanation":"The term 'aeropause' is used in aerospace engineering and atmospheric science to describe the transitional region where the atmosphere becomes extremely thin and the properties of air become less significant. It is not a sharply defined boundary but rather a gradual transition zone.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The aeropause is a solid surface.","correct":"✓ The aeropause is a region of gradual transition.","note":"The aeropause is not a solid boundary but a gradual transition zone. "},{"incorrect":"✗ Aeropause is the same as the Karman line.","correct":"✓ The aeropause is above the Karman line.","note":"The Karman line (100 km) is often used as a definition for the start of outer space, while the aeropause is a broader region where atmospheric effects gradually diminish."}],"priority":"★★☆"},"related_words":{"derivatives":["aerodynamic","atmosphere","exosphere","thermosphere"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Technical term)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Aeropause' is a technical term used in fields like aerospace engineering and atmospheric science. It refers to the region where the Earth's atmosphere gradually transitions into outer space. This area is characterized by extremely thin air, making aerodynamic control for aircraft increasingly difficult. The aeropause is not a fixed boundary but a zone where atmospheric properties diminish. Understanding this term requires knowledge of atmospheric layers and aerospace concepts.","priority":"★★☆"},"example_sentences":[{"sentence":"Above the aeropause, spacecraft rely on thrusters for maneuvering.","translation":"大気圏界面より上では、宇宙船は姿勢制御のためにスラスターに頼る。","type":"noun","meaning_category":"Boundary region"},{"sentence":"Scientists study the composition of the atmosphere in the aeropause.","translation":"科学者たちは大気圏界面における大気の組成を研究する。","type":"noun","meaning_category":"Boundary region"}]}