{"word":"unimporting","priority":"★☆☆","meanings":[{"part_of_speech":"verb","definition":"(現在分詞)インポートしないこと、重要でないものを輸入しないこと","english_definition":"(present participle) The act of not importing; specifically, refraining from importing something considered non-essential or undesirable.","examples":[{"sentence":"The country is unimporting luxury goods to support local industries.","translation":"その国は地元の産業を支援するために、贅沢品の輸入を控えている。"},{"sentence":"They are unimporting products from companies with poor labor practices.","translation":"彼らは労働慣行の悪い企業からの製品の輸入を控えている。"}],"collocations":["unimporting goods","unimporting products"],"synonyms":["not importing","refraining from importing","avoiding import"],"antonyms":["importing"],"notes":"This word is not commonly used, and its meaning is highly context-dependent. It is often used in discussions about trade policy or ethical consumption."}],"etymology":{"value":"Formed by adding the prefix 'un-' (not) to the verb 'import'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnɪmˈpɔːrtɪŋ/","syllables":"un-im-port-ing"},"inflection":{"verb_forms":{"present_participle":"unimporting"}},"usage_notes":{"explanation":"'Unimporting' is a relatively rare word. It describes the action of not importing, often with a specific intention or policy behind it. It is most likely to be encountered in discussions of economics, trade, or ethical consumerism.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unimporting of the country led to economic growth.","correct":"✓ The cessation of imports by the country led to economic growth.","note":"'Unimporting' is not commonly used as a noun. It is better to use phrases like 'cessation of imports' or 'reduction in imports'."}],"priority":"★☆☆"},"related_words":{"derivatives":["import","unimported"],"related_concepts":["trade","exports","tariffs","economic policy","boycott"]},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Unimporting' is a rare and specialized term. It is used to describe the act of deliberately not importing goods, often for economic or ethical reasons. Due to its infrequent use, it is more likely to be encountered in advanced texts on economics or trade policy."},"example_sentences":[{"sentence":"The government's policy of unimporting certain agricultural products aims to protect local farmers.","translation":"政府が特定の農産物の輸入を控える政策は、地元の農家を保護することを目的としている。","type":"verb (present participle)","meaning_category":"not importing"},{"sentence":"By unimporting goods from countries with human rights abuses, consumers can exert ethical pressure.","translation":"人権侵害のある国からの商品の輸入を控えることで、消費者は倫理的な圧力をかけることができる。","type":"verb (present participle)","meaning_category":"not importing"}]}