{"word":"magnetosphere","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"磁気圏","english_definition":"The region surrounding a planet that is controlled by the planet's magnetic field.","examples":[{"sentence":"The Earth's magnetosphere protects us from harmful solar radiation.","translation":"地球の磁気圏は有害な太陽放射から私たちを守っています。"},{"sentence":"Jupiter has a very large and powerful magnetosphere.","translation":"木星は非常に大きく強力な磁気圏を持っています。"},{"sentence":"The solar wind interacts with the magnetosphere, causing auroras.","translation":"太陽風は磁気圏と相互作用し、オーロラを引き起こします。"}],"collocations":["Earth's magnetosphere","planetary magnetosphere","magnetosphere boundary","magnetosphere dynamics","magnetosphere plasma"],"synonyms":["magnetic field region"],"antonyms":[]}],"etymology":{"value":"The word \"magnetosphere\" is a combination of \"magneto-\" (referring to magnetism) and \"-sphere\" (referring to a region or sphere of influence). It was coined in the late 1950s or early 1960s as scientists began to understand the extent and nature of the region around the Earth dominated by its magnetic field.","priority":"★★☆"},"pronunciation":{"ipa":"/mæɡˈniːtəˌsfɪər/","syllables":"mag-ne-to-sphere"},"inflection":{"noun_plural":"magnetospheres"},"usage_notes":{"explanation":"The magnetosphere is a complex region surrounding a planet that is shaped by the interaction of the planet's magnetic field with the solar wind (a stream of charged particles emitted by the Sun). It acts as a protective shield, deflecting most of the solar wind and preventing it from directly impacting the planet's atmosphere. The size and shape of a magnetosphere vary depending on the strength of the planet's magnetic field and the intensity of the solar wind.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The atmosphere is the same as the magnetosphere.","correct":"✓ The atmosphere and the magnetosphere are different regions.","note":"The atmosphere is the layer of gases surrounding a planet, while the magnetosphere is the region controlled by the planet's magnetic field. They are distinct but interacting regions."}],"priority":"★★☆"},"related_words":{"derivatives":["magnetospheric (adjective)"],"related_terms":["magnetic field","solar wind","aurora","ionosphere","plasma"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1-C2 (specialized scientific vocabulary)","frequency_google_ngram":"Low frequency - Used primarily in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"magnetosphere\" refers to the region around a planet that is dominated by its magnetic field. This region is formed by the interaction of the planet's magnetic field with the solar wind, a stream of charged particles from the Sun. The magnetosphere acts as a protective shield, deflecting most of the solar wind and preventing it from directly interacting with the planet's atmosphere. Understanding the magnetosphere requires knowledge of physics, space science, and planetary science.","priority":"★★☆"},"example_sentences":[{"sentence":"The study focused on the dynamics of the Earth's **magnetosphere** during a solar storm.","translation":"その研究は、太陽嵐の間の地球の磁気圏のダイナミクスに焦点を当てた。","type":"noun","meaning_category":"磁気圏"},{"sentence":"The **magnetosphere** of Neptune is tilted at a large angle relative to its rotational axis.","translation":"海王星の磁気圏は、その回転軸に対して大きな角度で傾いている。","type":"noun","meaning_category":"磁気圏"},{"sentence":"Scientists use satellites to study the properties of the **magnetosphere**.","translation":"科学者たちは衛星を使って磁気圏の特性を研究している。","type":"noun","meaning_category":"磁気圏"}]}