{"word":"transcalescent","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"変態点を示す、変態温度の","english_definition":"Exhibiting transcalescence; having a critical temperature or temperature range at which there is a marked change in physical properties.","examples":[{"sentence":"The transcalescent point of iron is around 900 degrees Celsius.","translation":"鉄の変態点は摂氏約900度です。"},{"sentence":"The alloy exhibits a transcalescent range rather than a single point.","translation":"その合金は単一点ではなく、変態温度範囲を示します。"}],"collocations":["transcalescent point","transcalescent temperature","transcalescent range"],"synonyms":["critical temperature","transformation temperature"],"antonyms":[]}],"etymology":{"value":"From *trans-* (across, beyond) + *calescence* (increasing in temperature).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtrænskəˈlɛsənt/","syllables":"trans-ca-les-cent"},"inflection":{"notes":"Does not inflect."},"usage_notes":{"explanation":"Used primarily in materials science and metallurgy to describe materials that undergo a change in crystalline structure or other physical properties at a specific temperature or temperature range.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"★☆☆"},"related_words":{"derivatives":["transcalescence (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Transcalescent' is a technical term used in the field of materials science, particularly when discussing metals and alloys. It refers to the property of a material exhibiting a noticeable change in its physical characteristics, such as its crystal structure, at a particular temperature. This temperature is known as the transcalescence point or transformation temperature. Due to its specialized usage, it is not commonly encountered outside of scientific or engineering contexts."},"example_sentences":[{"sentence":"The steel became non-magnetic after reaching its transcalescent temperature.","translation":"その鋼は変態温度に達した後、非磁性になった。","type":"adjective","meaning_category":"変態点を示す"},{"sentence":"The transcalescent behavior of the metal was studied using differential scanning calorimetry.","translation":"その金属の変態挙動は、示差走査熱量測定法を用いて研究された。","type":"adjective","meaning_category":"変態温度の"}]}