{"word":"vection","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自己運動感覚、自己の運動知覚","english_definition":"An illusion of self-motion caused by visual stimuli when one is, in fact, stationary.","examples":[{"sentence":"The vection I experienced while watching the IMAX movie was so strong, I felt like I was really flying.","translation":"IMAX映画を見ている時に経験した自己運動感覚は非常に強く、まるで本当に飛んでいるように感じました。"},{"sentence":"Motion sickness can be exacerbated by strong vection.","translation":"乗り物酔いは、強い自己運動感覚によって悪化することがあります。"},{"sentence":"Researchers are studying vection to better understand how the brain processes motion.","translation":"研究者たちは、脳がどのように運動を処理するかをより良く理解するために、自己運動感覚を研究しています。"}],"collocations":["circular vection (円運動自己運動感覚)","linear vection (線形自己運動感覚)","vection strength (自己運動感覚の強さ)","induce vection (自己運動感覚を誘発する)"],"synonyms":["self-motion perception","induced motion","visually induced self-motion (VISM)"],"antonyms":["stationary","stillness"]},{"part_of_speech":"noun","definition":"(稀) 運搬、輸送","english_definition":"(rare) The act of carrying or transporting.","examples":[{"sentence":"(Historical context) The vection of goods across the desert was a perilous undertaking.","translation":"(歴史的文脈) 砂漠を越えての物資の運搬は危険な事業でした。"}],"collocations":[],"synonyms":["transportation","conveyance","carriage"],"antonyms":["stasis","immobility"]}],"etymology":{"value":"Derived from the Latin word \"vectio,\" meaning \"a carrying, conveyance,\" from \"vectus,\" the past participle of \"vehere,\" meaning \"to carry, convey.\" The primary meaning related to self-motion perception is a later, specialized usage in psychology and neuroscience.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈvɛkʃən/","syllables":"vec-tion"},"inflection":{"noun_plural":"vections"},"usage_notes":{"explanation":"The term \"vection\" primarily refers to the illusion of self-motion induced by visual stimuli. This is a specialized term used in psychology, neuroscience, and related fields. The older, less common meaning refers to the act of carrying or transporting something. When encountering this word, context is crucial to determine the intended meaning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I felt a strong vector while watching the film.","correct":"✓ I felt a strong vection while watching the film.","note":"\"Vection\" (self-motion perception) is often confused with \"vector\" (a quantity with magnitude and direction)."},{"incorrect":"✗ The vection of the package was delayed.","correct":"✓ The delivery of the package was delayed.","note":"In the context of transporting goods, \"delivery\" or \"transportation\" is more commonly used than \"vection.\""}],"priority":"★★☆"},"related_words":{"derivatives":["vectional (adjective, relating to vection)"],"related_terms":["visual perception","motion perception","sensory illusion","simulator sickness","cybersickness"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency (専門的な分野でのみ使用される)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Vection\" is a technical term primarily used in psychology and neuroscience to describe the illusion of self-motion caused by visual stimuli. It's not a commonly used word in everyday conversation. Understanding this term requires a background in these fields. The older meaning of \"carrying\" is rare and mostly found in historical contexts. Therefore, it's essential to consider the context in which the word is used to determine its meaning accurately.","priority":"★★☆"},"example_sentences":[{"sentence":"The simulator induced a strong sense of **vection**, making participants feel like they were actually moving.","translation":"そのシミュレーターは強い自己運動感覚を誘発し、参加者に実際に動いているような感覚を与えました。","type":"noun","meaning_category":"自己運動感覚"},{"sentence":"The **vection** experienced in virtual reality can sometimes lead to motion sickness.","translation":"バーチャルリアリティで経験する自己運動感覚は、時に乗り物酔いを引き起こすことがあります。","type":"noun","meaning_category":"自己運動感覚"},{"sentence":"(Historical) The **vection** of supplies was crucial for the survival of the early settlers.","translation":"(歴史的) 物資の運搬は、初期の入植者の生存にとって非常に重要でした。","type":"noun","meaning_category":"運搬 (稀)"}]}