{"word":"myosarcomatous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"平滑筋肉腫の、平滑筋肉腫性の","english_definition":"Relating to or resembling a myosarcoma (a malignant tumor of muscle tissue).","examples":[{"sentence":"The patient was diagnosed with a myosarcomatous tumor in the leg.","translation":"患者は脚に平滑筋肉腫性の腫瘍があると診断された。"},{"sentence":"Myosarcomatous tissue was identified during the biopsy.","translation":"生検中に平滑筋肉腫性の組織が確認された。"}],"collocations":["myosarcomatous tumor","myosarcomatous tissue","myosarcomatous cells"],"synonyms":["leiomyosarcomatous"],"antonyms":[]}],"etymology":{"value":"Derived from 'myosarcoma' (a malignant tumor of muscle tissue) + '-tous' (suffix indicating resemblance or relation). 'Myo-' refers to muscle, 'sarcoma' refers to a malignant tumor of connective or non-epithelial tissue.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmaɪoʊsɑːrkəˈmətoʊs/","syllables":"my-o-sar-co-ma-tous"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Myosarcomatous' is a medical term specifically used to describe something related to or resembling a myosarcoma. It is typically used in pathology and oncology contexts when discussing the characteristics of a tumor or tissue sample.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The tumor was myosarcoma.","correct":"✓ The tumor was myosarcomatous.","note":"'Myosarcoma' is the name of the tumor itself, while 'myosarcomatous' describes the characteristics of the tumor or related tissue."}],"priority":"★★☆"},"related_words":{"derivatives":["myosarcoma (noun): A malignant tumor of muscle tissue.","leiomyosarcoma (noun): A type of myosarcoma that originates from smooth muscle tissue."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Specialized medical vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Myosarcomatous' is a highly specialized medical term used in the context of oncology and pathology. Understanding this term requires a strong background in medical terminology and an understanding of tumor classification. It is not commonly used outside of medical settings."},"example_sentences":[{"sentence":"Microscopic examination revealed myosarcomatous features within the mass.","translation":"顕微鏡検査により、腫瘤内に平滑筋肉腫性の特徴が認められた。","type":"medical","meaning_category":"pathology"},{"sentence":"The myosarcomatous component of the tumor was highly aggressive.","translation":"腫瘍の平滑筋肉腫性の構成要素は非常に攻撃的であった。","type":"medical","meaning_category":"oncology"}]}