{"word":"Numidia","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヌミディア（古代北アフリカの地域）","english_definition":"An ancient region in North Africa, corresponding roughly to modern Algeria and parts of Tunisia and Libya.","examples":[{"sentence":"Numidia was a kingdom of the Berber people.","translation":"ヌミディアはベルベル人の王国でした。"},{"sentence":"The Romans fought several wars against Numidia.","translation":"ローマ人はヌミディアに対して何度か戦争をしました。"}],"collocations":["Kingdom of Numidia","Ancient Numidia","Roman Numidia"],"synonyms":["None"],"antonyms":["None"]}],"etymology":{"value":"From Latin 'Numidia', from Greek 'Νουμιδία' (Noumidía), of uncertain origin, possibly from a Berber language.","priority":"★★☆"},"pronunciation":{"ipa":"/njuːˈmɪdiə/","syllables":"Nu-mid-i-a"},"inflection":{"notes":"Proper noun, no plural form."},"usage_notes":{"explanation":"'Numidia' refers specifically to the historical region in North Africa. It is mainly encountered in historical contexts, especially when discussing the Roman Empire and its interactions with North African kingdoms.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Numidia is a country in Europe.","correct":"✓ Numidia was a region in North Africa.","note":"Numidia was located in North Africa, not Europe."}],"priority":"★★☆"},"related_words":{"derivatives":["Numidian (adjective, noun)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily used in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Numidia' is a term primarily encountered in historical texts and discussions related to ancient North Africa and the Roman Empire. Understanding its significance requires familiarity with ancient history. It is not a commonly used word in modern English. "},"example_sentences":[{"sentence":"The history of Numidia is closely linked to that of Carthage and Rome.","translation":"ヌミディアの歴史は、カルタゴとローマの歴史と密接に関連しています。","type":"general","meaning_category":"historical context"},{"sentence":"King Masinissa ruled Numidia for over 50 years.","translation":"マシニッサ王は50年以上にわたってヌミディアを統治しました。","type":"historical figure","meaning_category":"historical context"}]}