{"word":"diversity-promoting","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"多様性を促進する、多様性を奨励する","english_definition":"actively encouraging or supporting diversity, especially in a social or professional context.","examples":[{"sentence":"The company has implemented several diversity-promoting initiatives.","translation":"その会社は、いくつかの多様性を促進するイニシアチブを実施しています。"},{"sentence":"We need more diversity-promoting policies in the workplace.","translation":"職場には、より多くの多様性を促進する政策が必要です。"},{"sentence":"The university is committed to creating a diversity-promoting environment.","translation":"その大学は、多様性を促進する環境を作ることに尽力しています。"}],"collocations":["diversity-promoting initiative (多様性を促進するイニシアチブ)","diversity-promoting policy (多様性を促進する政策)","diversity-promoting program (多様性を促進するプログラム)","diversity-promoting environment (多様性を促進する環境)","diversity-promoting activities (多様性を促進する活動)"],"synonyms":["inclusive","egalitarian","multicultural","pluralistic"],"antonyms":["exclusive","discriminatory","homogenous"]}],"etymology":{"value":"The word is formed by combining \"diversity\" (the state of being diverse) with \"promoting\" (actively encouraging or furthering).","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˈvɜːrsɪti prəˈmoʊtɪŋ/","syllables":"di-ver-si-ty pro-mo-ting"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"\"**diversity-promoting**\" is used to describe actions, policies, or environments that actively work to increase and support diversity. It suggests a proactive approach to inclusivity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is promoting diversity, it's diversity-promote.","correct":"✓ The company is promoting diversity; it's diversity-promoting.","note":"\"Diversity-promote\" is not a correct adjective form. Use \"diversity-promoting\" to describe something that promotes diversity."},{"incorrect":"✗ He is a diversity-promote person.","correct":"✓ He is a person who promotes diversity. / ✓ He is a diversity advocate.","note":"It's better to say 'a person who promotes diversity' or use another term like 'diversity advocate' rather than 'diversity-promote person'."}],"priority":"★★☆"},"related_words":{"derivatives":["diversity (noun)","promote (verb)","promotion (noun)"],"phrasal_verbs":[],"related_terms":["inclusion","equity","multiculturalism","pluralism"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but increasing in use.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"**diversity-promoting**\" is used to describe something that actively encourages diversity. It is often used in the context of organizations, policies, or initiatives that aim to create a more inclusive and representative environment. The term implies a deliberate effort to increase the presence and participation of individuals from various backgrounds and identities. It is a relatively sophisticated term, typically used in formal or professional settings where discussions of diversity and inclusion are common."},"example_sentences":[{"sentence":"The organization received an award for its diversity-promoting efforts.","translation":"その組織は、多様性を促進する取り組みが評価され、賞を受賞しました。","type":"general","meaning_category":"general"},{"sentence":"The new curriculum includes diversity-promoting materials to better reflect the student body.","translation":"新しいカリキュラムには、学生の構成をより良く反映するために、多様性を促進する教材が含まれています。","type":"education","meaning_category":"education"},{"sentence":"The company's diversity-promoting recruitment strategy aims to attract a wider range of candidates.","translation":"その会社の多様性を促進する採用戦略は、より幅広い候補者を引きつけることを目的としています。","type":"business","meaning_category":"business"}]}