{"word":"Chinked","priority":"低","meanings":[{"part_of_speech":"adjective","definition":"(建築)隙間を詰められた、目地が埋められた","english_definition":"(of a structure) having the chinks or gaps filled in, typically with daub or other material.","examples":[{"sentence":"The chinked log cabin stood sturdy against the wind.","translation":"隙間を詰められた丸太小屋は、風に強く立っていた。"},{"sentence":"They built a chinked stone wall to protect the garden.","translation":"彼らは庭を守るために、目地が埋められた石壁を築いた。"}],"collocations":["chinked log cabin","chinked stone wall","chinked construction"],"synonyms":["filled","sealed","mortared","daubed"],"antonyms":["open","gapped","unfilled"]},{"part_of_speech":"verb (past participle)","definition":"(建築)隙間を詰めた、目地を埋めた (chinkの過去分詞)","english_definition":"past participle of the verb 'chink,' meaning to fill the chinks or gaps in something.","examples":[{"sentence":"The gaps between the logs were carefully chinked with clay.","translation":"丸太の間の隙間は粘土で丁寧に詰められた。"},{"sentence":"After the wall was chinked, it was much more resistant to the weather.","translation":"壁の目地が埋められた後、それはより耐候性になった。"}],"collocations":["chinked with clay","chinked with mortar","chinked with daub"],"synonyms":["filled","sealed","mortared","daubed"],"antonyms":["left open","unfilled"]}],"etymology":{"value":"'Chinked' derives from the verb 'chink,' which means to fill the chinks (gaps or cracks) in a wall or structure. The word 'chink' itself likely comes from a sound-imitative origin, referring to the small, sharp sound made when filling a small gap with a hard material.","priority":"中"},"pronunciation":{"ipa":"/tʃɪŋkt/","syllables":"chinked"},"inflection":{"verb_forms":{"present_simple":["chink","chinks"],"past_simple":"chinked","past_participle":"chinked","present_participle":"chinking"}},"usage_notes":{"explanation":"'Chinked' is primarily used in the context of construction, particularly when describing older building techniques where gaps in walls (especially log cabins or stone walls) are filled with materials like clay, mortar, or daub. It is a descriptive term, often used to convey a sense of rustic or historical construction.","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"✗ The chinked armor protected the knight.","correct":"✓ The knight wore chinked armor.","note":"While 'chinked' describes something having gaps filled, it's not typically associated with armor. 'Chinked armor' might refer to armor with small gaps or spaces, but it's not a standard term."}],"priority":"低"},"related_words":{"derivatives":["chink (noun: a small gap or crack; verb: to fill gaps)","chinking (noun: the material used to fill chinks)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (specialized vocabulary)","frequency_google_ngram":"Low","priority":"低"},"readability_explanation":{"level":"C1","text":"The word 'chinked' is a specialized term primarily used in the context of construction and historical building techniques. It describes a structure (usually a wall) that has had its gaps or cracks filled with a material like clay, mortar, or daub. Understanding this word requires some familiarity with construction terminology and historical building methods."},"example_sentences":[{"sentence":"The old stone farmhouse had been carefully chinked to keep out the drafts.","translation":"古い石造りの農家は、隙間風を防ぐために丁寧に目地が埋められていた。","type":"adjective","meaning_category":"建築"},{"sentence":"They chinked the log cabin with a mixture of mud and straw.","translation":"彼らは泥とわらを混ぜたもので丸太小屋の隙間を詰めた。","type":"verb (past simple)","meaning_category":"建築"},{"sentence":"The chinked walls of the fort provided excellent protection from the elements.","translation":"砦の目地が埋められた壁は、風雨からの優れた保護を提供した。","type":"adjective","meaning_category":"建築"}]}