{"word":"soilbag","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"A bag filled with soil, typically used in gardening, construction, or flood control.","english_definition":"A bag filled with soil, typically used for gardening, construction, or flood control.","examples":[{"sentence":"We used soilbags to build a temporary retaining wall.","translation":"土嚢を使って一時的な擁壁を作りました。"},{"sentence":"The garden center sells soilbags in various sizes.","translation":"園芸店では様々なサイズの土嚢を販売しています。"},{"sentence":"During the flood, residents used soilbags to protect their homes.","translation":"洪水の間、住民は土嚢を使って家を守りました。"}],"collocations":["fill a soilbag","stack soilbags","soilbag wall","soilbag construction"],"synonyms":["sandbag","earthbag","grow bag"],"antonyms":[]}],"etymology":{"value":"Combination of 'soil' (earth) and 'bag' (container).","priority":"Medium"},"pronunciation":{"ipa":"/ˈsɔɪlbæɡ/","syllables":"soil-bag"},"inflection":{"noun_plural":"soilbags"},"usage_notes":{"explanation":"'Soilbag' is a straightforward compound noun. It's most commonly used in practical contexts related to gardening, construction, and emergency flood control. It is often used interchangeably with 'sandbag', although 'sandbag' implies the bag is filled with sand rather than soil.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"I need a soil bag for my plants.","correct":"I need a soilbag for my plants.","note":"'Soilbag' is typically written as one word."}],"priority":"Low"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"B1","text":"The word 'soilbag' is easy to understand because it is made up of two common words: 'soil' (the dirt in which plants grow) and 'bag' (a container). It refers to a bag filled with soil, used for various purposes such as gardening or preventing floods."},"example_sentences":[{"sentence":"The volunteers worked together to fill and distribute soilbags.","translation":"ボランティアたちは協力して土嚢を詰め、配布しました。","type":"noun","meaning_category":"container"},{"sentence":"The soilbag wall helped to divert the floodwaters.","translation":"土嚢の壁は洪水をそらすのに役立ちました。","type":"noun","meaning_category":"barrier"}]}