{"word":"Rhizopogon","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ショウロ属：担子菌門、真正担子菌綱、イグチ目、ショウロ科に属する菌類の属。","english_definition":"A genus of ectomycorrhizal fungi in the family Rhizopogonaceae. These fungi form symbiotic relationships with the roots of various trees, particularly pines.","examples":[{"sentence":"Rhizopogon species are important for forest ecosystems.","translation":"ショウロ属の菌は森林生態系にとって重要である。"}],"collocations":["Rhizopogon roseolus (バラショウロ)","Rhizopogon luteolus (キショウロ)"],"synonyms":["false truffle"],"antonyms":[]}],"etymology":{"value":"The name Rhizopogon comes from the Greek words 'rhiza' (root) and 'pogon' (beard), referring to the root-like strands (mycelia) that extend from the fruiting body.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌraɪzoʊˈpɒɡən/","syllables":"Rhi-zo-po-gon"},"inflection":{"noun_plural":"Rhizopogons"},"usage_notes":{"explanation":"Rhizopogon is a genus of fungi that forms mycorrhizal relationships with trees. This means that the fungus colonizes the roots of the tree and helps it to absorb nutrients from the soil, while the tree provides the fungus with carbohydrates. Rhizopogon species are important for forest health and are also sometimes harvested for food.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Rhizopogon is a type of tree.","correct":"✓ Rhizopogon is a type of fungus.","note":"Rhizopogon is a fungus, not a tree."}],"priority":"★☆☆"},"related_words":{"derivatives":["Rhizopogonaceae (ショウロ科)","ectomycorrhizal (外生菌根性の)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Rhizopogon is a scientific term referring to a genus of fungi that forms symbiotic relationships with tree roots. Understanding this term requires knowledge of mycology and forest ecology. It's typically encountered in scientific literature or specialized discussions about fungi and forest ecosystems."},"example_sentences":[{"sentence":"Several species of Rhizopogon are edible and considered delicacies in some regions.","translation":"ショウロ属のいくつかの種は食用であり、一部の地域では珍味とされている。","type":"general","meaning_category":"description"},{"sentence":"The presence of Rhizopogon helps pine seedlings establish in nutrient-poor soils.","translation":"ショウロ属の存在は、栄養の乏しい土壌でのマツの苗木の定着を助ける。","type":"ecological","meaning_category":"function"}]}