{"word":"extinguishably","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"消すことができるように、消火可能なやり方で","english_definition":"In a manner that can be extinguished; in a way that is capable of being put out or quenched.","examples":[{"sentence":"The fire was extinguishably small, allowing them to quickly put it out.","translation":"火は消せるほど小さかったので、彼らはすぐに消し止めることができた。"},{"sentence":"The candle burned extinguishably, providing a soft light that could be easily turned off.","translation":"ろうそくは消せるように燃え、簡単に消せる柔らかな光を提供した。"}],"collocations":["burn extinguishably","small extinguishably","easily extinguishably"],"synonyms":["quenchably","suppressibly","repressibly"],"antonyms":["inextinguishably","unquenchably","irremovably"]}],"etymology":{"value":"Derived from 'extinguishable' by adding the suffix '-ly'. 'Extinguishable' comes from 'extinguish', which originates from Latin 'ex-' (out) and 'stinguere' (to quench).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪkˈstɪŋɡwɪʃəbli/","syllables":"ex-tin-guish-a-bly"},"inflection":{"notes":"Adverbs do not typically inflect. This is the standard form."},"usage_notes":{"explanation":"'Extinguishably' is an adverb that describes the manner in which something can be put out or quenched. It is relatively rare in modern usage, but it is used to express the capability of something being extinguished. It's often used to describe fires, lights, or other things that can be put out.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The feeling was extinguishably.","correct":"✓ The feeling was extinguishable.","note":"'Extinguishably' is an adverb and modifies verbs, adjectives, or other adverbs, not nouns. Use 'extinguishable' as an adjective to describe a noun."},{"incorrect":"✗ He extinguishably put out the fire.","correct":"✓ He extinguishably small put out the fire.","note":"The adverb should describe the manner of the verb. So, it is better to use the adverb to describe the adjective, and then the adjective to describe the noun."}],"priority":"★★☆"},"related_words":{"derivatives":["extinguish (verb)","extinguisher (noun)","extinguishable (adjective)","inextinguishable (adjective)","extinguishment (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Extinguishably' is a relatively rare adverb that means 'in a manner that can be extinguished'. It is formed by adding '-ly' to 'extinguishable'. This word is typically used in formal contexts to describe something that can be easily put out, such as a small fire or a candle. Because of its rarity and formal nature, it is more likely to be encountered in advanced texts or specialized contexts related to fire safety or similar topics."},"example_sentences":[{"sentence":"The small flame burned extinguishably, allowing the scientist to easily conduct experiments.","translation":"小さな炎は消せるように燃え、科学者が簡単に実験を行うことを可能にした。","type":"adverb","meaning_category":"消火可能なやり方で"},{"sentence":"The candle was designed to burn extinguishably, providing a safe and convenient source of light.","translation":"ろうそくは消せるように設計されており、安全で便利な光源を提供した。","type":"adverb","meaning_category":"消火可能なやり方で"}]}