{"word":"microcycle","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(スポーツ科学)トレーニング計画における、通常1週間程度の短い期間。特定の目標を達成するための、数回のトレーニングセッションで構成される。","english_definition":"(sports science) A short training period, usually lasting about a week, within a larger training plan, consisting of several training sessions designed to achieve a specific goal.","examples":[{"sentence":"The coach adjusted the microcycle to focus on speed work before the competition.","translation":"コーチは試合前にスピード練習に集中するようにマイクロサイクルを調整した。"},{"sentence":"Each microcycle in the program builds upon the previous one, gradually increasing the intensity.","translation":"プログラムの各マイクロサイクルは前のサイクルに基づいており、徐々に強度が増していく。"},{"sentence":"The microcycle includes strength training, endurance exercises, and active recovery days.","translation":"マイクロサイクルには、筋力トレーニング、持久力トレーニング、アクティブレスト日が含まれている。"}],"collocations":["training microcycle","adjust a microcycle","plan a microcycle","implement a microcycle","focus on a microcycle","within a microcycle"],"synonyms":["training week","short-term training plan"],"antonyms":["macrocycle","mesocycle"]}],"etymology":{"value":"'micro-' (小さい) + 'cycle' (周期) の組み合わせ。トレーニング計画における短い周期を意味する。","priority":"★★★"},"pronunciation":{"ipa":"/ˈmaɪkroʊˌsaɪkəl/","syllables":"mi-cro-cy-cle"},"inflection":{"noun_plural":"microcycles"},"usage_notes":{"explanation":"マイクロサイクルは、より大きなトレーニング計画（メゾサイクル、マクロサイクル）の一部であり、具体的な目標（筋力向上、持久力向上、技術向上など）に焦点を当てた、集中的なトレーニング期間です。通常、1週間程度ですが、個々のトレーニング計画や競技スケジュールによって期間は異なります。マイクロサイクルの計画には、トレーニングの種類、強度、頻度、休息日などが含まれます。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The athlete only focused on the microcycle and ignored the overall plan.","correct":"✓ The athlete focused on the microcycle as part of the overall plan.","note":"マイクロサイクルは全体的な計画の一部であり、それだけを重視してはいけません。"},{"incorrect":"✗ A microcycle is the same as a macrocycle.","correct":"✓ A microcycle is much shorter than a macrocycle.","note":"マイクロサイクルはマクロサイクルよりもはるかに短い期間です。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["mesocycle","macrocycle","periodization","training plan","training session","recovery","overtraining"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"低頻度 (Low frequency) - スポーツ科学分野で使われる専門用語。","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"「**microcycle**」は、スポーツのトレーニング計画で使われる専門用語です。これは、通常1週間程度の短い期間を指し、特定の目標を達成するためにいくつかのトレーニングセッションを組み合わせて構成されます。マイクロサイクルは、より大きなトレーニング計画（メゾサイクルやマクロサイクル）の一部であり、アスリートが特定のスキルや能力を向上させるために集中的にトレーニングする期間です。この用語は、スポーツ科学やコーチングの分野でよく使われます。"},"example_sentences":[{"sentence":"The team's strength and conditioning coach designed a new microcycle to improve power output.","translation":"チームのストレングス＆コンディショニングコーチは、パワー出力を向上させるための新しいマイクロサイクルを設計した。","type":"noun","meaning_category":"スポーツ科学"},{"sentence":"During the recovery microcycle, athletes focus on low-intensity activities and stretching.","translation":"回復マイクロサイクル中、アスリートは低強度の活動とストレッチに集中する。","type":"noun","meaning_category":"スポーツ科学"},{"sentence":"The effectiveness of the microcycle is evaluated based on the athlete's performance and feedback.","translation":"マイクロサイクルの有効性は、アスリートのパフォーマンスとフィードバックに基づいて評価される。","type":"noun","meaning_category":"スポーツ科学"}]}