{"word":"zero-lift","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(航空) 揚力ゼロ状態、無揚力状態","english_definition":"A condition in aviation where an aircraft generates no lift.","examples":[{"sentence":"The aircraft entered a zero-lift condition during the steep dive.","translation":"航空機は急降下中に揚力ゼロ状態に入った。"},{"sentence":"Understanding zero-lift is crucial for stall recovery.","translation":"失速からの回復には無揚力状態の理解が不可欠である。"}],"collocations":["zero-lift drag","zero-lift condition","achieve zero-lift"],"synonyms":["no lift","loss of lift"],"antonyms":["maximum lift","positive lift"]},{"part_of_speech":"adjective","definition":"(航空) 揚力ゼロの、無揚力の","english_definition":"Relating to or characterized by a condition where no lift is generated.","examples":[{"sentence":"The zero-lift angle of attack was calculated to be -3 degrees.","translation":"揚力ゼロの迎え角は-3度と計算された。"},{"sentence":"Zero-lift drag is a significant factor at high speeds.","translation":"無揚力抗力は高速時に重要な要素となる。"}],"collocations":["zero-lift angle of attack","zero-lift drag coefficient"],"synonyms":["no-lift","lift-free"],"antonyms":["lifting"]}],"etymology":{"value":"The term combines 'zero' (meaning none) and 'lift' (the aerodynamic force that opposes the weight of an aircraft).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈzɪəroʊˌlɪft/","syllables":"ze-ro-lift"},"inflection":{"notes":"The word 'zero-lift' is generally used as a noun or adjective and does not have plural or verb forms."},"usage_notes":{"explanation":"'Zero-lift' refers to the state where an aircraft's wings produce no aerodynamic lift. This can occur at specific angles of attack or during certain maneuvers. It's an important concept in aerodynamics and flight dynamics.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The plane was zero lift.","correct":"✓ The plane was in a zero-lift condition.","note":"'Zero-lift' is usually used as an adjective modifying a noun (e.g., 'zero-lift angle') or as part of a noun phrase (e.g., 'zero-lift condition')."},{"incorrect":"✗ Zero lift is good for flying.","correct":"✓ Zero lift is dangerous for flying.","note":"Zero lift is generally an undesirable condition, especially during normal flight. It can lead to a stall or loss of control."}],"priority":"★★☆"},"related_words":{"derivatives":["lift","drag","angle of attack","stall","aerodynamics"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Zero-lift' is a technical term used in aviation and aerodynamics. It describes the condition where an aircraft's wings are not generating any lift. This concept is important for understanding flight dynamics, stall characteristics, and aircraft performance. It's typically encountered in advanced discussions of aviation theory.","priority":"★★☆"},"example_sentences":[{"sentence":"The pilot had to quickly adjust the aircraft's attitude to avoid a prolonged zero-lift situation.","translation":"パイロットは、揚力ゼロの状態が長く続くのを避けるために、航空機の姿勢を素早く調整する必要があった。","type":"noun","meaning_category":"航空"},{"sentence":"The zero-lift drag coefficient is used in calculating the total drag on the aircraft.","translation":"揚力ゼロ抗力係数は、航空機にかかる全抗力を計算する際に使用される。","type":"adjective","meaning_category":"航空"}]}