{"word":"Steatorrhea","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"脂肪便、脂肪瀉（しぼうしゃ）","english_definition":"The excretion of abnormal quantities of fat with the feces due to reduced absorption of fat by the small intestine.","examples":[{"sentence":"Steatorrhea can be a symptom of malabsorption.","translation":"脂肪便は吸収不良の症状である可能性があります。"},{"sentence":"The patient presented with chronic diarrhea and steatorrhea.","translation":"患者は慢性的な下痢と脂肪便を呈した。"}],"collocations":["cause steatorrhea","treat steatorrhea","severe steatorrhea","chronic steatorrhea"],"synonyms":["fatty stool","fat malabsorption"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'stéar' (στέαρ) meaning 'fat, tallow' and 'rhéein' (ῥέειν) meaning 'to flow'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌstiːætəˈriːə/","syllables":"stee-a-tuh-ree-uh"},"inflection":{"noun_plural":"steatorrheas"},"usage_notes":{"explanation":"Steatorrhea is a medical term describing the presence of excess fat in feces. It is often characterized by stools that are bulky, pale, and foul-smelling, and may float due to the high fat content. It is typically a symptom of malabsorption, where the small intestine is unable to properly absorb fats from digested food. Conditions that can cause steatorrhea include celiac disease, cystic fibrosis, pancreatic insufficiency, and certain infections. Diagnosis usually involves stool tests to measure the amount of fat present.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Steatorrhea is a disease itself.","correct":"✓ Steatorrhea is a symptom of an underlying condition.","note":"Steatorrhea is a symptom, not a disease. It indicates a problem with fat absorption. "},{"incorrect":"✗ Steatorrhea always causes abdominal pain.","correct":"✓ Steatorrhea may or may not cause abdominal pain.","note":"While abdominal discomfort can accompany steatorrhea, it's not always present. Other symptoms like diarrhea and weight loss are more consistent."}],"priority":"★★☆"},"related_words":{"derivatives":["steatorrheic (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (specialized medical vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Steatorrhea' is a technical term used in medicine to describe the condition of having too much fat in your stool. It's not a common word you'd hear in everyday conversation. If a doctor tells you that you have steatorrhea, it means they've found that your body isn't absorbing fat properly. This can be caused by various medical conditions. The stool may appear pale, bulky, and have a bad smell.","priority":"★★★"},"example_sentences":[{"sentence":"Chronic pancreatitis can lead to steatorrhea due to insufficient enzyme production.","translation":"慢性膵炎は、酵素産生不全により脂肪便を引き起こす可能性がある。","type":"general","meaning_category":"cause"},{"sentence":"A stool fat test is used to diagnose steatorrhea.","translation":"便中脂肪検査は、脂肪便を診断するために使用される。","type":"diagnosis","meaning_category":"diagnosis"},{"sentence":"Treatment for steatorrhea focuses on addressing the underlying cause of fat malabsorption.","translation":"脂肪便の治療は、脂肪吸収不良の根本原因に対処することに焦点を当てる。","type":"treatment","meaning_category":"treatment"}]}