{"word":"Michelin","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ミシュラン（フランスのタイヤメーカー）","english_definition":"A French tire manufacturer.","examples":[{"sentence":"Michelin is a well-known tire brand.","translation":"ミシュランは有名なタイヤブランドです。"}],"collocations":["Michelin tires","Michelin guide"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"ミシュランガイド","english_definition":"The Michelin Guide, a series of guide books published by Michelin for over a century. The Guide awards up to three Michelin stars for excellence to a select few establishments.","examples":[{"sentence":"The restaurant has three Michelin stars.","translation":"そのレストランはミシュランの三ツ星を獲得している。"},{"sentence":"We consulted the Michelin Guide before choosing a restaurant.","translation":"レストランを選ぶ前にミシュランガイドを参考にした。"}],"collocations":["Michelin star","Michelin Guide","Michelin-starred restaurant"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Édouard Michelin and André Michelin, the brothers who founded the company in 1889.","priority":"★★★"},"pronunciation":{"ipa":"/ˈmɪʃəlɪn/","syllables":"Mi-che-lin"},"inflection":{},"usage_notes":{"explanation":"The word \"Michelin\" primarily refers to the French tire company. However, it is also widely recognized as the name of the Michelin Guide, a prestigious restaurant guide that awards stars to restaurants for their culinary excellence. The Michelin Guide is highly influential in the culinary world.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["Michelin-starred (adjective)"],"related_terms":["tire","restaurant","guide","star"]},"level_frequency":{"frequency_google_ngram":"Relatively frequent, especially in contexts related to automobiles or fine dining.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word \"Michelin\" is commonly understood in two main contexts: as a brand name for tires and as the publisher of the renowned Michelin Guide for restaurants. When discussing automobiles or tires, \"Michelin\" refers to the tire manufacturer. In the context of dining and cuisine, \"Michelin\" refers to the Michelin Guide, which awards stars to restaurants based on their quality. Understanding the context is crucial to interpreting the meaning of \"Michelin\" correctly."},"example_sentences":[{"sentence":"I need to buy new Michelin tires for my car.","translation":"私の車に新しいミシュランのタイヤを買う必要があります。","type":"noun","meaning_category":"tire manufacturer"},{"sentence":"We celebrated our anniversary at a Michelin-starred restaurant.","translation":"私たちはミシュランの星付きレストランで記念日を祝いました。","type":"adjective","meaning_category":"Michelin Guide"}]}