{"word":"proboulevard","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare, humorous) A wide street or road, possibly intended to be a boulevard, but lacking the characteristics or grandeur typically associated with one.","english_definition":"(rare, humorous) A wide street or road, possibly intended to be a boulevard, but lacking the characteristics or grandeur typically associated with one.","examples":[{"sentence":"The city planners called it a 'future boulevard,' but it was really just a proboulevard lined with strip malls.","translation":"都市計画家はそれを「未来のブールバード」と呼んだが、実際にはストリップモールが並ぶプロブールバードにすぎなかった。"},{"sentence":"This so-called 'boulevard' is more of a proboulevard; it's wide, but there's nothing special about it.","translation":"このいわゆる「ブールバード」は、プロブールバードのようなものだ。広いけど、特別なものは何もない。"}],"collocations":["future proboulevard","so-called proboulevard"],"synonyms":["wide street","road","thoroughfare"],"antonyms":[]},{"part_of_speech":"noun","definition":"(rare, humorous, neologism) A street that is 'almost' a boulevard, implying it is in the process of becoming one or aspires to be one.","english_definition":"(rare, humorous, neologism) A street that is 'almost' a boulevard, implying it is in the process of becoming one or aspires to be one.","examples":[{"sentence":"With the new landscaping and wider sidewalks, Main Street is slowly transforming into a proboulevard.","translation":"新しい景観整備と広い歩道により、メインストリートは徐々にプロブールバードへと変貌しつつある。"},{"sentence":"The city council hopes that the development project will turn this ordinary street into a proper boulevard, or at least a decent proboulevard.","translation":"市議会は、この開発プロジェクトがこの普通の通りを本格的なブールバード、少なくともまともなプロブールバードに変えることを期待している。"}],"collocations":["developing proboulevard","aspiring proboulevard"],"synonyms":["almost-boulevard","near-boulevard"],"antonyms":[]}],"etymology":{"value":"A blend of \"probably\" or \"proto-\" and \"boulevard,\" suggesting something that is almost or aspiring to be a boulevard, but not quite there yet. It plays on the grandeur and status associated with the term \"boulevard\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌproʊˈbuːləˌvɑːrd/","syllables":"pro-bou-le-vard"},"inflection":{"noun_plural":"proboulevards"},"usage_notes":{"explanation":"\"Proboulevard\" is a humorous and relatively rare term, often used to describe a street that is wide like a boulevard but lacks the aesthetic appeal, landscaping, or other features that would truly qualify it as one. It can also imply a street that is in the process of becoming a boulevard. The term is often used in urban planning or architectural discussions to jokingly critique or describe streets that fall short of the boulevard ideal.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The proboulevard was filled with trees and fancy shops, making it a true boulevard.","correct":"✓ The proboulevard was wide but lacked trees and fancy shops, setting it apart from a true boulevard.","note":"A proboulevard, by definition, is not a true boulevard. If it has the characteristics of a boulevard, it should be called a boulevard."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["boulevard","street","avenue","road","thoroughfare"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (rare and not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Very low frequency - a relatively rare and humorous term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"proboulevard\" is a somewhat humorous neologism, typically used in urban planning or architectural contexts. It describes a street that has some characteristics of a boulevard (such as width) but lacks the aesthetic or functional qualities that would make it a true boulevard. Understanding the term requires familiarity with the concept of a boulevard and an appreciation for the humor in its almost-but-not-quite status. It is not a common word and would likely only be encountered in specialized discussions or writing.","priority":"★★☆"},"example_sentences":[{"sentence":"The city council hoped to transform the ordinary street into a grand boulevard, but it ended up being just a wide, unremarkable proboulevard.","translation":"市議会は、その普通の通りを壮大なブールバードに変えたいと願っていたが、結局はただの広くて平凡なプロブールバードになってしまった。","type":"noun","meaning_category":"lacking boulevard characteristics"},{"sentence":"With the addition of trees and decorative lighting, the street is slowly evolving from a mere road into a promising proboulevard.","translation":"木々や装飾的な照明が追加されたことで、その通りは単なる道路から有望なプロブールバードへと徐々に進化している。","type":"noun","meaning_category":"aspiring to be a boulevard"}]}