{"word":"Leuckartiidae","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A family of parasitic copepods in the order Cyclopoida.","english_definition":"A family of parasitic copepods belonging to the order Cyclopoida. These copepods are typically found as parasites of marine invertebrates.","examples":[{"sentence":"The Leuckartiidae family includes several genera of copepods that parasitize marine organisms.","translation":"Leuckartiidae科には、海洋生物に寄生するいくつかのコペポーダ属が含まれています。"}],"collocations":["copepod parasite","marine invertebrate","Cyclopoida order"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the genus name 'Leuckartia' + '-idae' (a suffix used to denote a zoological family). 'Leuckartia' is named after the German zoologist Rudolf Leuckart.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌluːkɑːrˈtaɪɪdiː/","syllables":"Loo-kar-TY-i-dee"},"inflection":{"noun_plural":"Leuckartiids"},"usage_notes":{"explanation":"Leuckartiidae is a relatively small family of copepods, primarily known for their parasitic lifestyle. They are not commonly encountered outside of scientific or specialist contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Leuckartiidae is a genus.","correct":"✓ Leuckartiidae is a family.","note":"Leuckartiidae is a family, not a genus. A genus would be 'Leuckartia'."}],"priority":"★★☆"},"related_words":{"derivatives":["Leuckartia (genus)","Cyclopoida (order)","copepod (general term)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very Low Frequency - Specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Leuckartiidae' is a highly specialized term used within the field of marine biology and parasitology. Understanding this term requires familiarity with the taxonomic classification of organisms, specifically copepods and their parasitic lifestyles. It is unlikely to be encountered outside of scientific literature or academic discussions. The pronunciation and spelling can be challenging for those unfamiliar with scientific nomenclature."},"example_sentences":[{"sentence":"Studies on the morphology of Leuckartiidae contribute to our understanding of copepod evolution.","translation":"Leuckartiidaeの形態に関する研究は、コペポーダの進化の理解に貢献しています。","type":"scientific context","meaning_category":"Taxonomy"},{"sentence":"Members of the Leuckartiidae family are often found parasitizing specific species of marine worms.","translation":"Leuckartiidae科のメンバーは、特定の種類の海洋蠕虫に寄生していることがよくあります。","type":"scientific context","meaning_category":"Parasitology"}]}