{"word":"three-phaser","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"三相交流機、三相電力システム","english_definition":"An electrical machine or power system that uses three-phase alternating current.","examples":[{"sentence":"The factory uses a three-phaser to power its heavy machinery.","translation":"その工場は重機に電力を供給するために三相交流機を使用しています。"},{"sentence":"A three-phaser is more efficient for high-power applications.","translation":"三相交流機は高電力用途においてより効率的です。"}],"collocations":["three-phase motor","three-phase power","three-phase system"],"synonyms":["three-phase generator","three-phase alternator"],"antonyms":["single-phaser"]}],"etymology":{"value":"Derived from 'three-phase', referring to the three alternating currents, combined with the suffix '-er', indicating an agent or device.","priority":"★★★"},"pronunciation":{"ipa":"/ˈθriːˌfeɪzər/","syllables":"three-pha-ser"},"inflection":{"noun_plural":"three-phasers"},"usage_notes":{"explanation":"The term 'three-phaser' is often used informally or technically to refer to components or systems utilizing three-phase power. It is most commonly used in engineering and industrial contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The three-phaser is running on single phase.","correct":"✓ The three-phaser is running on three-phase power.","note":"Three-phasers require three-phase power to operate correctly."}],"priority":"★☆☆"},"related_words":{"derivatives":["three-phase (adjective)","phaser (noun - general term for a device that adjusts phase)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'three-phaser' is a technical term used in electrical engineering. It refers to a device or system that operates using three-phase alternating current, which is more efficient for high-power applications compared to single-phase systems. Understanding this term requires knowledge of electrical engineering principles.","priority":"★★☆"},"example_sentences":[{"sentence":"The electrician installed a new three-phaser for the air conditioning system.","translation":"電気技師は空調システム用に新しい三相交流機を設置しました。","type":"noun","meaning_category":"electrical machine"},{"sentence":"The efficiency of the three-phaser reduces energy costs for the company.","translation":"三相交流機の効率は、会社のエネルギーコストを削減します。","type":"noun","meaning_category":"electrical system"}]}