{"word":"MTTFF","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"平均故障回復時間","english_definition":"Mean Time To Full Function. A reliability metric that represents the average time required to restore a system to full operational functionality after a failure.","examples":[{"sentence":"The MTTFF of the server is critical for maintaining business continuity.","translation":"サーバーのMTTFFは、事業継続性を維持するために重要です。"}],"collocations":["calculate MTTFF","improve MTTFF","high MTTFF","low MTTFF"],"synonyms":["Mean Time To Repair (MTTR)","Mean Time To Restore (MTTR)"],"antonyms":["Mean Time Between Failures (MTBF)","Mean Time To Failure (MTTF)"]}],"etymology":{"value":"Acronym from Mean Time To Full Function.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛmˌtiːˌtiːˌɛfˈɛf/","syllables":"em-tee-tee-eff-eff"},"inflection":{"noun_plural":"MTTFFs"},"usage_notes":{"explanation":"MTTFF is a reliability metric used to measure the maintainability and serviceability of a repairable system. It indicates the average time taken to restore a system to its full operational capability after a failure.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The MTTFF should be minimized to reduce downtime.","correct":"✓ The MTTFF should be minimized to reduce downtime.","note":"MTTFF represents the time to restore full function, so minimizing it reduces downtime."}],"priority":"★★★"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"MTTFF (Mean Time To Full Function) is a technical term used in reliability engineering and maintenance management. It represents the average time required to restore a system to full operational functionality after a failure. The metric is used to assess the maintainability and serviceability of repairable systems. A lower MTTFF indicates that the system can be restored to full function more quickly, reducing downtime and improving overall system availability."},"example_sentences":[{"sentence":"The new maintenance procedures have significantly improved the MTTFF of the production line.","translation":"新しいメンテナンス手順により、生産ラインのMTTFFが大幅に改善されました。","type":"general","meaning_category":"Reliability Metric"},{"sentence":"The engineering team is working to reduce the MTTFF by implementing automated diagnostic tools.","translation":"エンジニアリングチームは、自動診断ツールを実装してMTTFFを短縮しようとしています。","type":"technical","meaning_category":"System Maintenance"}]}