{"word":"Painterliness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"絵画的な性質、絵画らしさ、画家らしい筆致","english_definition":"The quality of a painting in which the strokes of paint are visible and the surface has a textured or varied appearance, emphasizing the physical act of painting.","examples":[{"sentence":"The exhibition showcased the artist's painterliness, with visible brushstrokes and a textured surface.","translation":"その展覧会では、見える筆致と質感のある表面で、アーティストの絵画的な性質が展示されました。"},{"sentence":"Impressionism is known for its painterliness, capturing the fleeting effects of light and atmosphere.","translation":"印象派はその絵画的な性質で知られており、光と雰囲気の一時的な効果を捉えています。"},{"sentence":"His work demonstrates a high degree of painterliness, emphasizing the materiality of the paint itself.","translation":"彼の作品は高度な絵画的性質を示しており、絵の具自体の物質性を強調しています。"}],"collocations":["visible brushstrokes (見える筆致)","textured surface (質感のある表面)","expressive handling of paint (絵の具の表現力豊かな扱い)","emphasis on materiality (物質性の強調)","artistic technique (芸術的な技法)"],"synonyms":["painterly quality","visual texture","brushwork","surface articulation","artistic handling"],"antonyms":["smoothness","flatness","linearity","precision","photorealism"]}],"etymology":{"value":"The term 'painterliness' is derived from the adjective 'painterly,' which describes a style of painting that emphasizes the qualities and techniques specific to painting, such as visible brushstrokes and the texture of the paint surface. The term gained prominence in art criticism during the late 19th and early 20th centuries, particularly in discussions of Impressionism and Post-Impressionism.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpeɪntərlinəs/","syllables":"pain-ter-li-ness"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Painterliness' refers to the qualities in a painting that emphasize the act of painting itself, as opposed to creating a smooth, illusionistic representation of reality. It highlights the artist's technique, the texture of the paint, and the visible brushstrokes. This term is often used to describe and appreciate styles like Impressionism, Expressionism, and other movements where the artist's hand is evident in the final work.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The painterliness of the photo was stunning.","correct":"✓ The painterliness of the painting was stunning.","note":"'Painterliness' is a quality specific to paintings, not photographs."},{"incorrect":"✗ The artist used painterliness to hide mistakes.","correct":"✓ The artist used painterliness to create texture and visual interest.","note":"'Painterliness' is not about hiding mistakes but about emphasizing the artistic process."}],"priority":"★★☆"},"related_words":{"derivatives":["painterly (adjective: 絵画的な、画家らしい)"],"phrasal_verbs":null,"related_concepts":["Impressionism","Expressionism","Abstract Expressionism","alla prima","impasto","brushstroke","texture","materiality","art criticism","visual arts","painting techniques"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in art criticism and academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Painterliness' is a term used in art to describe paintings where you can see the brushstrokes and the way the paint was applied. It's about noticing the artist's technique and the texture of the paint, rather than just seeing a smooth picture. Think of it as appreciating the 'hand-made' quality of the painting. This word is mostly used by people who study or talk about art.","priority":"★★☆"},"example_sentences":[{"sentence":"The **painterliness** of Van Gogh's sunflowers is immediately recognizable.","translation":"ゴッホのヒマワリの絵画的な性質は一目でそれとわかる。","type":"noun","meaning_category":"絵画的な性質"},{"sentence":"Critics praised the artist's ability to convey emotion through **painterliness**.","translation":"批評家たちは、アーティストが絵画的な性質を通して感情を伝える能力を称賛した。","type":"noun","meaning_category":"絵画的な性質"},{"sentence":"The **painterliness** of the work creates a sense of immediacy and intimacy.","translation":"その作品の絵画的な性質は、即時性と親密さの感覚を生み出す。","type":"noun","meaning_category":"絵画的な性質"}]}