{"word":"strobilus","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"球果、胞子嚢穂","english_definition":"A structure present on many land plant species consisting of sporangia-bearing structures densely aggregated along a stem.","examples":[{"sentence":"Conifers bear strobili, commonly known as cones.","translation":"針葉樹は、一般的に球果として知られるストロビルスを付ける。"},{"sentence":"The strobilus contains the plant's reproductive structures.","translation":"そのストロビルスは植物の生殖構造を含んでいる。"}],"collocations":["conifer strobilus","seed strobilus","pollen strobilus"],"synonyms":["cone","sporophyll","fruit"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek στρόβιλος (stróbilos, “something twisted”), from στροβέω (strobéō, “I whirl, twist”).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstrɒbɪləs/","syllables":"strob-i-lus"},"inflection":{"noun_plural":"strobili"},"usage_notes":{"explanation":"A strobilus is a cone-like structure that contains the reproductive organs of certain plants, particularly gymnosperms like conifers and some lycophytes. It is often referred to as a cone, especially in conifers.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The strobilus is a flower.","correct":"The strobilus is a cone-like structure, not a flower.","note":"Strobili are reproductive structures found in gymnosperms and some other plants, but they are distinct from flowers, which are found in angiosperms."}],"priority":"★☆☆"},"related_words":{"derivatives":["strobilation","strobilar"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"strobilus\" is a technical term used in botany to describe the cone-like structures that contain the reproductive organs of certain plants, particularly gymnosperms like conifers and some lycophytes. It is a relatively uncommon word outside of scientific contexts. Understanding the term requires knowledge of plant reproductive biology and terminology.","priority":"★☆☆"},"example_sentences":[{"sentence":"The pollen **strobilus** releases pollen into the wind.","translation":"花粉ストロビルスは花粉を風に放出する。","type":"noun","meaning_category":"球果"},{"sentence":"The seed **strobilus** of the pine tree matures into a woody cone.","translation":"マツの種子ストロビルスは成熟して木質の球果になる。","type":"noun","meaning_category":"球果"}]}