{"word":"union-opposed","meanings":[{"part_of_speech":"adjective","definition":"労働組合に反対する、労働組合に敵対的な","english_definition":"opposed to or hostile towards labor unions.","examples":[{"sentence":"The company is known for its union-opposed stance.","translation":"その会社は労働組合に反対する姿勢で知られている。"},{"sentence":"The manager's union-opposed views were causing conflict with the employees.","translation":"そのマネージャーの労働組合に反対する考え方が従業員との間で対立を引き起こしていた。"}],"collocations":["union-opposed company","union-opposed management","union-opposed policy","union-opposed legislation"],"synonyms":["anti-union","non-union","union-resistant"],"antonyms":["pro-union","union-friendly","union-supporting"],"related_words":["union busting","right-to-work laws"],"usage_notes":{"explanation":"This term describes individuals, companies, or policies that are against the formation, existence, or activities of labor unions. It often implies an active effort to prevent unionization or to undermine existing unions.","priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, but commonly used in discussions about labor relations.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'union-opposed' is relatively straightforward, but its use often appears in complex discussions about labor rights, business strategy, and legal frameworks. Understanding the term requires familiarity with the concept of labor unions and the dynamics of employer-employee relations."},"example_sentences":[{"sentence":"The factory owner implemented several union-opposed measures to discourage workers from organizing.","translation":"その工場主は、労働者が組織化するのを阻止するために、いくつかの労働組合に反対する措置を実施した。","type":"general"},{"sentence":"The politician's union-opposed voting record raised concerns among labor activists.","translation":"その政治家の労働組合に反対する投票記録は、労働活動家の間で懸念を引き起こした。","type":"political"}]}],"etymology":{"value":"Formed by combining 'union' (referring to labor unions) with 'opposed' (meaning against or in opposition to).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈjuːniən əˈpoʊzd/","syllables":"u-ni-on op-posed"},"inflection":{"notes":"Adjectives do not typically inflect in English."}}