{"word":"orthotropy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"直交異方性：材料の特性が互いに直交する3つの方向に沿って異なること。","english_definition":"The property of a material having different properties in three mutually perpendicular directions.","examples":[{"sentence":"Wood is a common example of a material exhibiting orthotropy.","translation":"木材は直交異方性を示す一般的な材料の例です。"},{"sentence":"The orthotropy of the composite material was carefully considered in the design.","translation":"複合材料の直交異方性は、設計において慎重に検討されました。"}],"collocations":["exhibit orthotropy","material orthotropy","orthotropy properties"],"synonyms":["anisotropy"],"antonyms":["isotropy"]}],"etymology":{"value":"The term 'orthotropy' comes from the Greek words 'orthos' (straight, right) and 'tropos' (manner, direction), referring to the straight, perpendicular directions of differing material properties.","priority":"★★☆"},"pronunciation":{"ipa":"/ɔːrˈθɒtrəpi/","syllables":"or-thot-ro-py"},"inflection":{"noun_plural":"orthotropies"},"usage_notes":{"explanation":"Orthotropy is commonly observed in materials like wood, where the properties along the grain, radial direction, and tangential direction are different. It's also relevant in composite materials.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The material is isotropic, showing orthotropy.","correct":"✓ The material is orthotropic, not isotropic.","note":"Orthotropy and isotropy are opposite properties. Isotropic materials have the same properties in all directions."}],"priority":"★★☆"},"related_words":{"derivatives":["orthotropic (adjective)"],"related_terms":["anisotropic","isotropic","material properties","composite materials"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Orthotropy' is a technical term used in materials science and engineering to describe materials that have different properties in three perpendicular directions. This concept is important when designing structures and components using materials like wood or composites, where the direction of the material's fibers or layers significantly affects its strength and stiffness. Understanding orthotropy is crucial for accurate stress analysis and predicting material behavior under different loading conditions."},"example_sentences":[{"sentence":"The orthotropy of the carbon fiber reinforced polymer was a key factor in the design of the aircraft wing.","translation":"炭素繊維強化ポリマーの直交異方性は、航空機の翼の設計における重要な要素でした。","type":"general","meaning_category":"直交異方性"},{"sentence":"Due to its orthotropy, wood's strength varies greatly depending on the direction of the applied force.","translation":"その直交異方性のため、木材の強度は、加えられる力の方向によって大きく異なります。","type":"general","meaning_category":"直交異方性"}]}