{"word":"Coulombic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"クーロンの法則に関する、クーロン力による","english_definition":"Relating to Coulomb's law or Coulomb forces.","examples":[{"sentence":"The Coulombic interaction between the ions is strong.","translation":"イオン間のクーロン相互作用は強い。"},{"sentence":"Coulombic forces are responsible for the attraction between oppositely charged particles.","translation":"クーロン力は、反対に帯電した粒子間の引力を担っている。"}],"collocations":["Coulombic attraction","Coulombic repulsion","Coulombic interaction","Coulombic potential","Coulombic energy"],"synonyms":["electrostatic","electrostatic"],"antonyms":[]}],"etymology":{"value":"Named after Charles-Augustin de Coulomb, a French physicist who formulated Coulomb's law in 1785.","priority":"★★★"},"pronunciation":{"ipa":"/kuːˈlɒmbɪk/","syllables":"Cou-lomb-ic"},"inflection":{},"usage_notes":{"explanation":"'Coulombic' is primarily used in scientific contexts, particularly in physics and chemistry, when discussing electrostatic interactions. It is often used to describe forces, potentials, or energies that arise due to the electric charge of particles.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["Coulomb (noun): the SI unit of electric charge","Coulomb's law (noun): a law stating the electrostatic force between two point charges is proportional to the product of the magnitudes of each charge and inversely proportional to the square of the distance between them."],"related_terms":["electrostatics","electrostatic force","electric charge","potential energy"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Coulombic' is a technical term used in physics and chemistry. It refers to anything related to Coulomb's law, which describes the electrostatic interaction between electrically charged particles. Understanding this term requires a background in physics or chemistry.","priority":"★★★"},"example_sentences":[{"sentence":"The stability of the molecule is determined by the balance of Coulombic and quantum mechanical forces.","translation":"分子の安定性は、クーロン力と量子力学的力のバランスによって決定される。","type":"scientific","meaning_category":"physics/chemistry"},{"sentence":"The Coulombic potential energy is calculated based on the distance between the charged particles.","translation":"クーロンポテンシャルエネルギーは、帯電した粒子間の距離に基づいて計算される。","type":"scientific","meaning_category":"physics/chemistry"}]}