{"word":"Rhizoflagellata","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"根足鞭毛虫類：鞭毛を持つ単細胞真核生物のグループで、仮足（根足）を伸ばして運動したり、食物を捕獲したりする。","english_definition":"A group of unicellular eukaryotic organisms characterized by possessing both flagella and pseudopodia (rhizopodia), used for locomotion and/or feeding.","examples":[{"sentence":"Rhizoflagellates are found in various aquatic and terrestrial environments.","translation":"根足鞭毛虫類は、様々な水生および陸生環境で見られる。"},{"sentence":"Some rhizoflagellates are free-living, while others are parasitic.","translation":"根足鞭毛虫類には自由生活するものもいれば、寄生性のものもいる。"}],"collocations":["rhizoflagellate species","rhizoflagellate morphology","rhizoflagellate taxonomy","rhizoflagellate habitat"],"synonyms":["flagellate","protozoan","protist"],"antonyms":[]}],"etymology":{"value":"Derived from 'rhizo-' (root) + 'flagellata' (flagellated organisms), referring to their root-like pseudopodia and flagella.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌraɪzoʊfləˈdʒɛlətə/","syllables":"Rhi-zo-fla-gel-la-ta"},"inflection":{"noun_plural":"Rhizoflagellata (often treated as a collective noun)"},"usage_notes":{"explanation":"'Rhizoflagellata' is a taxonomic term, though its usage may vary depending on the classification system. It describes organisms that combine characteristics of both flagellates (organisms with flagella) and rhizopods (organisms with pseudopodia).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Rhizoflagellata is a bacteria.","correct":"✓ Rhizoflagellata is a protist.","note":"Rhizoflagellates are eukaryotes, belonging to the protist kingdom, not bacteria."}],"priority":"★☆☆"},"related_words":{"derivatives":["rhizopod","flagellate","pseudopodia"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2 (specialized scientific vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Rhizoflagellata' is a scientific term used in biology and microbiology to describe a specific group of protists. Understanding this term requires knowledge of basic biological concepts such as eukaryotes, flagella, and pseudopodia. It is not a commonly used word outside of scientific contexts."},"example_sentences":[{"sentence":"The study focused on the diversity of rhizoflagellata in freshwater ecosystems.","translation":"その研究は、淡水生態系における根足鞭毛虫類の多様性に焦点を当てた。","type":"scientific","meaning_category":"general"},{"sentence":"Rhizoflagellata use their flagella for swimming and pseudopodia for capturing prey.","translation":"根足鞭毛虫類は、鞭毛を遊泳に、仮足を獲物の捕獲に使う。","type":"biological","meaning_category":"function"}]}