{"word":"internegative","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(写真)インターネガ、中間ネガ：ポジフィルムから作成されるネガフィルム。","english_definition":"A negative film made from a positive transparency (such as a color slide) for the purpose of making prints.","examples":[{"sentence":"The internegative allows for multiple prints to be made from the original slide.","translation":"インターネガにより、元のスライドから複数のプリントを作成できます。"},{"sentence":"Creating an internegative is a common step in film duplication.","translation":"インターネガの作成は、フィルム複製における一般的なステップです。"}],"collocations":["create an internegative","scan an internegative","use an internegative"],"synonyms":["intermediate negative"],"antonyms":["positive transparency","original slide"]}],"etymology":{"value":"\"inter-\" (between) + \"negative\". The \"inter-\" prefix indicates that it is an intermediate step between the original positive image and the final print.","priority":"★★☆"},"pronunciation":{"ipa":"ˌɪntərˈnɛɡətɪv","syllables":"in-ter-neg-a-tive"},"inflection":{"noun_plural":"internegatives"},"usage_notes":{"explanation":"An internegative is primarily used in film photography and film processing. It's a crucial step when you need to create multiple prints from a single positive transparency, especially in color photography. The internegative acts as a master negative from which prints can be easily made, preserving the original transparency.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The internegative is the same as the original negative.","correct":"✓ The internegative is a negative created from a positive transparency.","note":"An internegative is created *from* a positive image, not the original negative. It's an intermediate step."}],"priority":"★★☆"},"related_words":{"derivatives":["interpositive"],"related_terms":["negative","positive","transparency","film","print"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'internegative' is specific to film photography and processing, referring to a negative image created from a positive transparency (like a slide). This process allows for easier reproduction of prints from a single positive source. Understanding this term requires familiarity with film photography terminology."},"example_sentences":[{"sentence":"The photographer used an internegative to create a larger print of the landscape scene.","translation":"写真家は、風景写真のより大きなプリントを作成するためにインターネガを使用しました。","type":"noun","meaning_category":"photographic process"},{"sentence":"Scanning the internegative allowed for digital restoration of the old photograph.","translation":"インターネガをスキャンすることで、古い写真のデジタル復元が可能になりました。","type":"noun","meaning_category":"digital restoration"},{"sentence":"Without the internegative, it would have been impossible to produce multiple copies of the slide.","translation":"インターネガがなければ、スライドの複数コピーを作成することは不可能だったでしょう。","type":"noun","meaning_category":"film duplication"}]}