{"word":"Manneristical","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"手法主義的な、様式的な、技巧に凝った","english_definition":"Of or relating to Mannerism, a style of European art that emerged in the later years of the Italian High Renaissance and lasted until about 1600, characterized by elongated forms, exaggerated poses, and the use of artificial colors and light. More generally, excessively or affectedly stylized.","examples":[{"sentence":"The painting's manneristical style is evident in its distorted figures and dramatic lighting.","translation":"その絵画の手法主義的なスタイルは、歪んだ人物像と劇的な照明に明らかである。"},{"sentence":"The architect's manneristical designs were criticized for being overly elaborate and impractical.","translation":"その建築家の技巧に凝ったデザインは、過度に精巧で非現実的であると批判された。"},{"sentence":"The writer's manneristical prose is full of convoluted sentences and obscure allusions.","translation":"その作家の様式的な散文は、入り組んだ文と曖昧な言及に満ちている。"}],"collocations":["Manneristical style","Manneristical painting","Manneristical architecture","Manneristical prose","Manneristical features","Manneristical tendencies"],"synonyms":["stylized","affected","artificial","elaborate","ornate","pretentious","contrived","theatrical"],"antonyms":["natural","realistic","simple","unaffected","unpretentious"]},{"part_of_speech":"adjective","definition":"（人・行動などが）型にはまった、形式ばった、気取った","english_definition":"(Of a person or their behavior) characterized by excessive adherence to a particular manner or style; affected or artificial.","examples":[{"sentence":"His manneristical gestures and speech made him seem insincere.","translation":"彼の型にはまった身振り手振りと話し方は、彼を不誠実に見させた。"},{"sentence":"She found his manneristical compliments to be rather tiresome.","translation":"彼女は彼の形式ばった褒め言葉をかなりうんざりだと感じた。"},{"sentence":"The actor's manneristical performance lacked genuine emotion.","translation":"その俳優の気取った演技には、本物の感情が欠けていた。"}],"collocations":["Manneristical behavior","Manneristical gestures","Manneristical speech","Manneristical compliments","Manneristical performance","Manneristical approach"],"synonyms":["affected","artificial","insincere","stilted","theatrical","contrived","pretentious","pompous"],"antonyms":["genuine","sincere","natural","authentic","unaffected"]}],"etymology":{"value":"Derived from 'Mannerism,' a term used to describe a style of art that emerged in Italy during the High Renaissance. The suffix '-istical' is added to form an adjective.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmænəˈrɪstɪkəl/","syllables":"man-ner-is-ti-cal"},"inflection":{"notes":"Adjective; comparative and superlative forms are typically 'more manneristical' and 'most manneristical,' respectively, though these are less common."},"usage_notes":{"explanation":"'Manneristical' is primarily used in the context of art history to describe works that exhibit the characteristics of Mannerism. More broadly, it can describe anything that is excessively stylized, artificial, or affected in its manner or style. It often carries a negative connotation, suggesting a lack of sincerity or originality.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building was manneristic.","correct":"✓ The building was manneristical.","note":"While 'manneristic' is sometimes used, 'manneristical' is the more common and widely accepted form of the adjective."},{"incorrect":"✗ His manneristical behavior was natural.","correct":"✓ His manneristical behavior was artificial.","note":"'Manneristical' implies artificiality, so it is contradictory to describe it as natural."}],"priority":"★★☆"},"related_words":{"derivatives":["Mannerism (noun): A style of European art that emerged in the later years of the Italian High Renaissance.","Mannerist (noun/adjective): An artist or work of art associated with Mannerism."],"phrases":["Manneristical style","Manneristical approach","Manneristical tendencies"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Manneristical' is a relatively uncommon word, primarily used in art history and criticism. It describes something that is excessively stylized, artificial, or affected, often in a way that is considered pretentious or insincere. Understanding the term requires familiarity with the art historical movement of Mannerism, from which it derives. The word is more likely to be encountered in academic or specialized contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The artist's later works became increasingly manneristical, with exaggerated poses and unnatural colors.","translation":"その芸術家の後期の作品は、誇張されたポーズと不自然な色使いで、ますます手法主義的になった。","type":"adjective","meaning_category":"Artistic style"},{"sentence":"His manneristical compliments seemed insincere and forced.","translation":"彼の形式ばった褒め言葉は、不誠実で無理強いしているように感じられた。","type":"adjective","meaning_category":"Behavioral style"},{"sentence":"The play's manneristical dialogue was difficult for the audience to follow.","translation":"その劇の技巧に凝った台詞は、観客にとって理解するのが難しかった。","type":"adjective","meaning_category":"Literary style"}]}