{"word":"rousting","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人)を寝床からたたき起こす、(人)を追い立てる","english_definition":"to force someone to wake up or leave a place, especially roughly.","examples":[{"sentence":"The police rousted the protesters from the park.","translation":"警察は抗議者たちを公園から追い立てた。"},{"sentence":"He was rousted out of bed at 5 a.m.","translation":"彼は午前5時にたたき起こされた。"}],"collocations":["roust someone out of bed","roust someone from a place"],"synonyms":["wake up","stir up","drive out","expel"],"antonyms":["leave alone","let sleep"]},{"part_of_speech":"verb","transitivity":"vt","definition":"(隠れている人や動物)を捜し出す、あぶり出す","english_definition":"to search for and find someone or something that is hidden or concealed.","examples":[{"sentence":"The dogs were used to roust out the rabbits.","translation":"犬はウサギを捜し出すために使われた。"},{"sentence":"They rousted the suspect from his hiding place.","translation":"彼らは容疑者を隠れ家からあぶり出した。"}],"collocations":["roust out a suspect","roust out game"],"synonyms":["flush out","unearth","discover","find"],"antonyms":["hide","conceal"]},{"part_of_speech":"verb","transitivity":"vi","definition":"(俗語)騒ぐ、乱暴に振る舞う","english_definition":"(slang) to behave in a noisy and disruptive manner.","examples":[{"sentence":"The boys were rousting around in the backyard.","translation":"少年たちは裏庭で騒いでいた。"}],"collocations":["roust around"],"synonyms":["carouse","revel","make merry"],"antonyms":["behave quietly"]}],"etymology":{"value":"The word \"roust\" comes from the Dutch word \"roesten,\" meaning \"to rustle, stir.\" It entered English in the early 19th century, initially referring to stirring up or disturbing something. The meaning evolved to include waking someone up roughly and searching for hidden things.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈraʊstɪŋ/","syllables":"roust-ing"},"inflection":{"verb_forms":{"present_simple":["roust","rousts"],"past_simple":"rousted","past_participle":"rousted","present_participle":"rousting"}},"usage_notes":{"explanation":"\"Rousting\" is the present participle and gerund form of the verb \"roust.\" It typically implies a forceful or energetic action, whether it's waking someone up, searching for something, or behaving in a boisterous manner. The context usually indicates the specific meaning. The slang sense of \"rousting around\" suggests lively, often playful, activity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was rousting by the noise.","correct":"✓ He was rousted by the noise.","note":"When used in the passive voice, the past participle \"rousted\" should be used, not the present participle \"rousting.\""},{"incorrect":"✗ They are rousting for a solution.","correct":"✓ They are searching for a solution.","note":"While \"roust\" can mean to search, it usually implies searching for something hidden or unwilling to be found. For a general search, \"searching\" is more appropriate."}],"priority":"★★☆"},"related_words":{"derivatives":["roustabout (noun: an unskilled laborer, especially on an oil rig or in a circus)","rouster (noun: one who rousts)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"rousting\" is a relatively uncommon word, generally used in specific contexts. It typically describes a forceful action, such as waking someone abruptly or searching for something hidden. The slang usage implies noisy and disruptive behavior. Understanding the context is crucial to interpreting the intended meaning. It's more likely to be encountered in literature or specific professional fields (e.g., law enforcement, oil industry) than in everyday conversation."},"example_sentences":[{"sentence":"The sergeant was known for rousting new recruits at dawn.","translation":"その軍曹は、夜明けに新兵をたたき起こすことで知られていた。","type":"verb","meaning_category":"たたき起こす"},{"sentence":"The detectives were rousting around for any clues.","translation":"刑事たちは手がかりを求めて捜索していた。","type":"verb","meaning_category":"捜し出す"},{"sentence":"The cowboys spent the evening rousting in the saloon.","translation":"カウボーイたちは夕方を酒場で騒いで過ごした。","type":"verb","meaning_category":"騒ぐ"},{"sentence":"Rousting the birds from their nests is illegal.","translation":"巣から鳥を追い払うことは違法です。","type":"verb","meaning_category":"追い立てる"},{"sentence":"They were rousting the suspect out of his car.","translation":"彼らは容疑者を車から引きずり出していた。","type":"verb","meaning_category":"追い立てる"}]}