{"word":"pseudoanaphylaxis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"仮性アナフィラキシー、アナフィラキシー様反応","english_definition":"A non-immunoglobulin E (IgE) mediated reaction that mimics anaphylaxis.","examples":[{"sentence":"Pseudoanaphylaxis can be caused by direct mast cell activation.","translation":"仮性アナフィラキシーは、肥満細胞の直接的な活性化によって引き起こされる可能性があります。"},{"sentence":"The symptoms of pseudoanaphylaxis are similar to those of anaphylaxis.","translation":"仮性アナフィラキシーの症状はアナフィラキシーの症状と類似しています。"}],"collocations":["cause pseudoanaphylaxis","symptoms of pseudoanaphylaxis","differentiate from anaphylaxis"],"synonyms":["anaphylactoid reaction","non-IgE-mediated anaphylaxis"],"antonyms":[]}],"etymology":{"value":"The term is formed by combining \"pseudo-\" (meaning false or resembling) with \"anaphylaxis\".","priority":"★★★"},"pronunciation":{"ipa":"/ˌsjuːdoʊˌænəfɪˈlæksɪs/","syllables":"pseu-do-an-a-phy-lax-is"},"inflection":{"noun_plural":"pseudoanaphylaxes"},"usage_notes":{"explanation":"Pseudoanaphylaxis is clinically similar to anaphylaxis but does not involve IgE antibodies. It is often caused by direct activation of mast cells, leading to the release of mediators such as histamine. Common triggers include certain medications (e.g., NSAIDs, opioids), radiocontrast media, and physical factors.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Pseudoanaphylaxis is always caused by an allergic reaction.","correct":"✓ Pseudoanaphylaxis is not caused by an allergic reaction but mimics one.","note":"Pseudoanaphylaxis is not IgE-mediated and therefore not a true allergic reaction."}],"priority":"★★★"},"related_words":{"derivatives":["pseudoanaphylactic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"This term is highly specialized and used in medical contexts. It refers to a condition that resembles anaphylaxis but is not caused by the same immune mechanisms (i.e., IgE antibodies). Understanding requires knowledge of immunology and allergic reactions."},"example_sentences":[{"sentence":"The patient experienced pseudoanaphylaxis after the administration of the contrast dye.","translation":"患者は造影剤投与後に仮性アナフィラキシーを発症しました。","type":"medical","meaning_category":"medical condition"},{"sentence":"It is important to differentiate pseudoanaphylaxis from true anaphylaxis to provide appropriate treatment.","translation":"適切な治療を提供するために、仮性アナフィラキシーを真のアナフィラキシーと区別することが重要です。","type":"medical","meaning_category":"medical condition"}]}