{"word":"Hemidactylus","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヤモリ属 (半指蜥蜴属)","english_definition":"A large genus of geckos, commonly known as house geckos, wall geckos, or moon lizards, characterized by their adhesive toe pads.","examples":[{"sentence":"Hemidactylus frenatus is a common species of house gecko found in tropical regions.","translation":"Hemidactylus frenatusは、熱帯地域でよく見られるイエヤモリの一種です。"}],"collocations":["Hemidactylus frenatus (ヤモリ)","Hemidactylus platyurus (キノボリヤモリ)"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'hemi' (half) and 'dactylos' (finger or toe), referring to the divided toe pads characteristic of this genus.","priority":"★★★"},"pronunciation":{"ipa":"/ˌhɛmɪˈdæktɪləs/","syllables":"hem-i-dac-ty-lus"},"inflection":{"noun_plural":"Hemidactylus (same as singular)"},"usage_notes":{"explanation":"'Hemidactylus' is a scientific term used in zoology and herpetology to classify a specific genus of geckos. It's typically used in scientific contexts or when discussing the taxonomy of these reptiles.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["gecko","reptile","lizard"],"phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily used in scientific literature.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Hemidactylus' is a scientific term referring to a specific genus of geckos. It is primarily used in scientific or academic contexts related to zoology and herpetology. Understanding this term requires familiarity with biological classification systems."},"example_sentences":[{"sentence":"The researchers studied the adhesive properties of Hemidactylus toe pads.","translation":"研究者たちは、ヤモリ属の足指の接着特性を研究しました。","type":"noun","meaning_category":"ヤモリ属"},{"sentence":"Several species of Hemidactylus are invasive in various parts of the world.","translation":"ヤモリ属のいくつかの種は、世界のさまざまな地域で侵略的外来種となっています。","type":"noun","meaning_category":"ヤモリ属"}]}