{"word":"deviator","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"逸脱者、常軌を逸した人、標準から外れる人","english_definition":"a person or thing that deviates from what is considered normal, acceptable, or desirable; someone who departs from an established course or standard.","examples":[{"sentence":"He was considered a social deviator because of his unconventional lifestyle.","translation":"彼は型破りなライフスタイルが原因で、社会の逸脱者と見なされた。"},{"sentence":"The study focused on identifying deviators in the data set.","translation":"その研究は、データセット内の逸脱者を特定することに焦点を当てた。"},{"sentence":"She was labeled a deviator for challenging the company's traditional practices.","translation":"彼女は会社の伝統的な慣習に異議を唱えたため、逸脱者というレッテルを貼られた。"}],"collocations":["social deviator (社会の逸脱者)","statistical deviator (統計的な逸脱者)","moral deviator (道徳的な逸脱者)"],"synonyms":["nonconformist","rebel","dissenter","maverick","outlier","heretic"],"antonyms":["conformist","traditionalist","follower","adherent"]},{"part_of_speech":"noun","definition":"（特に性的な意味で）変質者、異常性癖者","english_definition":"(especially in a sexual context) a person whose behavior deviates from accepted standards, especially in a way considered abnormal or unacceptable.","examples":[{"sentence":"The film explores the psychology of sexual deviators.","translation":"その映画は、性的変質者の心理を探求している。"},{"sentence":"He was portrayed as a dangerous deviator in the media.","translation":"彼はメディアで危険な変質者として描かれた。"},{"sentence":"The police are investigating a series of crimes committed by a known deviator.","translation":"警察は、既知の変質者によって犯された一連の犯罪を捜査している。"}],"collocations":["sexual deviator (性的変質者)","criminal deviator (犯罪的な変質者)"],"synonyms":["pervert","degenerate","aberrant","abnormal","kinkster"],"antonyms":["normal","conventional"]}],"etymology":{"value":"Derived from the verb 'deviate,' which comes from the Latin 'deviare,' meaning 'to turn aside from the road.' 'De-' means 'from' and 'via' means 'road' or 'way.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdiːvieɪtər/","syllables":"de-vi-a-tor"},"inflection":{"noun_plural":"deviators"},"usage_notes":{"explanation":"The term 'deviator' generally refers to someone who strays from established norms or standards. However, it can carry negative connotations, especially when used in contexts related to morality, legality, or sexuality. In statistical contexts, 'deviator' simply refers to a data point that differs significantly from the average. The specific meaning depends heavily on the context.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a deviator of the rules.","correct":"✓ He is a deviator from the rules.","note":"When using 'deviator' to describe someone who doesn't follow rules, use the preposition 'from.'"},{"incorrect":"✗ Deviators are always bad people.","correct":"✓ Deviators are not always bad people; they may simply have different perspectives or values.","note":"Avoid generalizing that all deviators are inherently negative. Deviating from norms doesn't automatically equate to being a 'bad' person."}],"priority":"★★☆"},"related_words":{"derivatives":["deviate (verb)","deviation (noun)","deviant (adjective, noun)","deviance (noun)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Deviator' is a relatively uncommon word that describes someone who doesn't follow the usual rules or standards of society. It can have a negative meaning, especially when talking about sexual or moral behavior. However, it can also simply refer to someone who is different or unconventional. Because it can be offensive, it's important to use this word carefully and be aware of the context."},"example_sentences":[{"sentence":"The psychologist studied the behavior of social deviators to understand the roots of nonconformity.","translation":"心理学者は、非同調性の根源を理解するために、社会の逸脱者の行動を研究した。","type":"noun","meaning_category":"逸脱者"},{"sentence":"In statistics, a deviator is a data point that lies far from the mean.","translation":"統計学では、逸脱者とは平均から大きく外れたデータポイントのことである。","type":"noun","meaning_category":"統計的な逸脱者"},{"sentence":"The community struggled with how to deal with individuals considered moral deviators.","translation":"地域社会は、道徳的な逸脱者と見なされる個人にどのように対処するか苦慮した。","type":"noun","meaning_category":"道徳的な逸脱者"},{"sentence":"The author explored the complex motivations of a character labeled as a sexual deviator.","translation":"著者は、性的変質者というレッテルを貼られたキャラクターの複雑な動機を探求した。","type":"noun","meaning_category":"性的変質者"}]}