{"word":"encroacher","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"侵入者、侵害する人、権利を侵害する人","english_definition":"a person who encroaches; someone who intrudes on the rights or possessions of another.","examples":[{"sentence":"The developer was seen as an encroacher on the natural habitat.","translation":"その開発業者は自然の生息地への侵入者とみなされた。"},{"sentence":"The encroachers were warned to leave the property immediately.","translation":"侵入者たちは直ちにその土地から立ち去るよう警告された。"},{"sentence":"He is an encroacher on my personal space.","translation":"彼は私の個人的な空間への侵入者だ。"}],"collocations":["land encroacher (土地侵略者)","property encroacher (不動産侵略者)","border encroacher (国境侵犯者)","space encroacher (空間侵略者)"],"synonyms":["trespasser","intruder","invader","infringer","violator","poacher"],"antonyms":["defender","protector","guardian"]}],"etymology":{"value":"The word \"encroacher\" comes from the verb \"encroach,\" which originated in the late Middle English period. \"Encroach\" is derived from the Old French word \"encrochier,\" meaning \"to seize, grab, or hook.\" This, in turn, comes from \"croc,\" meaning \"hook.\" The sense evolved to mean gradually taking possession of something belonging to another.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈkroʊtʃər/","syllables":"en-croach-er"},"inflection":{"noun_plural":"encroachers"},"usage_notes":{"explanation":"An \"encroacher\" is someone who gradually or illegally takes possession of someone else's property, rights, or opportunities. The term often implies a gradual or subtle intrusion rather than a sudden or violent one. It's commonly used in contexts involving land disputes, property rights, or the violation of personal boundaries.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an encroacher of my privacy.","correct":"✓ He is an encroacher on my privacy.","note":"The correct preposition to use with \"encroacher\" when referring to what is being encroached upon is \"on.\" So, it should be \"encroacher on\" rather than \"encroacher of.\""},{"incorrect":"✗ The encroacher was encroaching.","correct":"✓ The encroacher was trespassing.","note":"While grammatically correct, \"The encroacher was encroaching\" can sound redundant. It's often more natural to use a more descriptive verb like \"trespassing\" or \"intruding\" to describe the action of an encroacher."}],"priority":"★★☆"},"related_words":{"derivatives":["encroach (verb: to intrude on someone else's territory, rights, etc.)","encroachment (noun: intrusion on a person's territory, rights, etc.)"],"phrasal_verbs":[],"related_concepts":["trespassing","intrusion","infringement","violation","poaching","squatting"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"encroacher\" is a more formal and less common word than synonyms like \"intruder\" or \"trespasser.\" It specifically refers to someone who gradually or subtly takes over someone else's property, rights, or territory. It is often used in legal or formal contexts to describe the action of gradually infringing upon someone else's boundaries. Understanding the subtle difference between \"encroacher\" and its synonyms requires a higher level of English proficiency."},"example_sentences":[{"sentence":"The government is working to remove illegal encroachers from protected forest areas.","translation":"政府は保護された森林地域から不法な侵入者を排除するために取り組んでいる。","type":"noun","meaning_category":"侵入者"},{"sentence":"The company was accused of being an encroacher on the rights of local communities.","translation":"その会社は地域社会の権利を侵害していると非難された。","type":"noun","meaning_category":"権利を侵害する人"},{"sentence":"The encroacher built a fence that extended onto his neighbor's property.","translation":"その侵入者は隣人の土地まで伸びるフェンスを建てた。","type":"noun","meaning_category":"侵入者"}]}