{"word":"Pyoperitoneum","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"腹腔内膿瘍、腹腔内の膿の蓄積","english_definition":"The presence of purulent (pus-containing) fluid within the peritoneal cavity.","examples":[{"sentence":"Pyoperitoneum is a serious condition requiring prompt medical or surgical intervention.","translation":"腹腔内膿瘍は、迅速な内科的または外科的介入を必要とする重篤な状態です。"},{"sentence":"Diagnostic imaging can help confirm the presence of pyoperitoneum.","translation":"画像診断は、腹腔内膿瘍の存在を確認するのに役立ちます。"}],"collocations":["septic pyoperitoneum","feline pyoperitoneum","canine pyoperitoneum","diagnose pyoperitoneum","treat pyoperitoneum"],"synonyms":["peritonitis","abdominal sepsis"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'pyo-' (pus), 'peritoneum' (the membrane lining the abdominal cavity), and '-ia' (condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpaɪoʊˌpɛrɪtəˈniːəm/","syllables":"py-o-per-i-to-ne-um"},"inflection":{"noun_plural":"pyoperitoneums"},"usage_notes":{"explanation":"Pyoperitoneum is a medical term used to describe a condition where pus accumulates within the peritoneal cavity, the space that surrounds the abdominal organs. It is often a result of a perforated organ, such as a ruptured appendix or a leaking bowel, leading to bacterial contamination and inflammation. The condition is serious and requires immediate medical attention.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor suspected pyoperitoneum, but it was just ascites.","correct":"✓ The doctor suspected pyoperitoneum, but it was just ascites.","note":"Ascites is fluid buildup in the peritoneal cavity, but it is not necessarily infected or purulent like pyoperitoneum."}],"priority":"★★☆"},"related_words":{"derivatives":["peritonitis","sepsis","abscess","effusion"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Pyoperitoneum is a highly technical medical term, primarily encountered in professional medical contexts such as surgical reports, pathology findings, and veterinary medicine. Due to its specificity and infrequent use outside of these fields, it is not considered part of general vocabulary. Understanding this term requires a background in anatomy, physiology, and pathology."},"example_sentences":[{"sentence":"The veterinarian diagnosed the dog with pyoperitoneum following abdominal imaging.","translation":"獣医は腹部画像検査の結果、その犬を腹腔内膿瘍と診断した。","type":"medical","meaning_category":"diagnosis"},{"sentence":"Surgical intervention is often necessary to treat pyoperitoneum and prevent further complications.","translation":"腹腔内膿瘍の治療とさらなる合併症の予防には、外科的介入が必要となることが多い。","type":"medical","meaning_category":"treatment"},{"sentence":"Septic pyoperitoneum can lead to systemic inflammatory response syndrome (SIRS).","translation":"敗血症性腹腔内膿瘍は、全身性炎症反応症候群（SIRS）を引き起こす可能性がある。","type":"medical","meaning_category":"complication"}]}