{"word":"sciomachiology","priority":"低","meanings":[{"part_of_speech":"noun","definition":"影との戦い、または影と戦うことの研究。無意味な戦いまたは議論に参加すること。","english_definition":"The act of fighting a shadow, or the study of fighting shadows; engaging in a meaningless battle or argument.","examples":[{"sentence":"His sciomachiology with critics only served to prolong the controversy.","translation":"彼の評論家との影との戦いは、論争を長引かせるだけに終わった。"},{"sentence":"The politician's sciomachiology against imaginary enemies was a distraction from real issues.","translation":"政治家の架空の敵との影との戦いは、現実の問題からの気をそらしだった。"}],"collocations":["engage in sciomachiology","sciomachiology with critics","sciomachiology against enemies"],"synonyms":["shadowboxing","tilting at windmills","quixotism","futile combat"],"antonyms":["constructive dialogue","productive engagement"]}],"etymology":{"value":"ギリシャ語の 'skia' (影) + 'mache' (戦い) + 'logia' (研究) から派生。","priority":"中"},"pronunciation":{"ipa":"/ˌsaɪ.əˌmæk.iˈɒl.ə.dʒi/","syllables":"sci-o-mach-i-ol-o-gy"},"inflection":{"noun_plural":"sciomachiologies"},"usage_notes":{"explanation":"この単語は、無意味で非生産的な戦いまたは議論を指すために使用されます。それは、現実の敵ではなく、影または想像上の敵と戦うことを暗示しています。","priority":"中"},"common_mistakes":{"examples":[{"incorrect":"✗ He practiced sciomachiology to improve his boxing skills.","correct":"✓ He practiced shadowboxing to improve his boxing skills.","note":"ボクシングのスキルを向上させるために影と戦う練習をする場合は、shadowboxing（シャドーボクシング）を使用します。sciomachiologyは、比喩的な意味での無意味な戦いを指します。"}],"priority":"低"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低い","priority":"低"},"readability_explanation":{"level":"C2","text":"'Sciomachiology' is a rare and sophisticated term used to describe the act of fighting shadows, both literally and figuratively. It implies engaging in futile or imaginary battles, often as a distraction from more pressing concerns. Due to its rarity, it is primarily encountered in academic or literary contexts where precise and nuanced language is valued."},"example_sentences":[{"sentence":"The company's sciomachiology with smaller competitors masked its own internal problems.","translation":"その会社の小規模な競合他社との影との戦いは、自社の内部問題を覆い隠していた。","type":"noun","meaning_category":"無意味な戦い"},{"sentence":"The author accused his critics of engaging in sciomachiology, attacking straw men rather than addressing his actual arguments.","translation":"著者は批評家たちを、実際の議論に取り組むのではなく、藁人形を攻撃する影との戦いをしていると非難した。","type":"noun","meaning_category":"無意味な議論"}]}