{"word":"refouler","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"(フランス語)不法入国者を強制送還する","english_definition":"(French) to forcibly return (a person) to a country, especially one where they are at risk of persecution.","examples":[{"sentence":"La France a été critiquée pour avoir refoulé des demandeurs d'asile.","translation":"France has been criticized for refouling asylum seekers.","note":"This example shows the verb used in a sentence."}],"collocations":["refouler un demandeur d'asile (to refoul an asylum seeker)","refouler à la frontière (to refoul at the border)"],"synonyms":["expulser","déporter","renvoyer"],"antonyms":["accueillir","accepter"],"notes":"This term is often used in the context of international law and human rights."}],"etymology":{"value":"From French 'refouler', meaning 'to drive back, repel, push back', from re- (back) + fouler (to trample, press).","priority":"N/A"},"pronunciation":{"ipa":"/ʁəfule/","syllables":"re-fou-ler"},"inflection":{"verb_forms":{"present_simple":["refoule","refoules","refoule","refoulons","refoulez","refoulent"],"past_simple":["refoulai","refoulas","refoula","refoulâmes","refoulâtes","refoulèrent"],"future_simple":["refoulerai","refouleras","refoulera","refoulerons","refoulerez","refouleront"],"present_participle":"refoulant","past_participle":"refoulé"}},"usage_notes":{"explanation":"'Refouler' is a French term that has gained usage in international law and human rights discourse, particularly when discussing the principle of non-refoulement. This principle prohibits states from returning individuals to countries where they face a serious risk of persecution, torture, or other irreparable harm.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"Le gouvernement refoule les réfugiés vers un pays sûr.","correct":"Le gouvernement refoule les réfugiés vers un pays où ils risquent d'être persécutés.","note":"The key element of 'refoulement' is sending someone back to a place where they are in danger."}],"priority":"N/A"},"related_words":{"derivatives":["refoulement (noun): the act of refouling"],"phrases":["principe de non-refoulement (principle of non-refoulement)"],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively infrequent, but used in specific legal and political contexts.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Refouler' is a specialized term, primarily used in legal and political contexts related to international law, human rights, and refugee law. It refers to the act of returning someone to a country where they face significant danger. Understanding this term requires familiarity with these fields of study."},"example_sentences":[{"sentence":"Le droit international interdit de refouler des personnes vers des pays où elles risquent la torture.","translation":"International law prohibits refouling individuals to countries where they risk torture.","type":"verb","meaning_category":"Forcible return"},{"sentence":"L'ONG a dénoncé le refoulement des migrants à la frontière.","translation":"The NGO denounced the refoulement of migrants at the border.","type":"noun (refoulement)","meaning_category":"Act of forcible return"}]}