{"word":"nonrescissory","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"取り消し不能の、撤回不能の","english_definition":"Not able to be rescinded or revoked; irrevocable.","examples":[{"sentence":"The contract contained a nonrescissory clause, ensuring its terms could not be cancelled.","translation":"その契約には取り消し不能条項が含まれており、その条件がキャンセルできないことを保証していた。"},{"sentence":"The judge ruled the agreement was nonrescissory, making it legally binding.","translation":"裁判官は、その合意が取り消し不能であると判決し、法的拘束力を持たせた。"}],"collocations":["nonrescissory agreement","nonrescissory clause","nonrescissory contract","nonrescissory order"],"synonyms":["irrevocable","unrepealable","unrecallable","binding","permanent"],"antonyms":["rescissory","revocable","repealable","cancellable"]}],"etymology":{"value":"The word 'nonrescissory' is formed by adding the prefix 'non-' (meaning 'not') to 'rescissory'. 'Rescissory' comes from 'rescind', which originates from the Latin word 'rescindere', meaning 'to cut off' or 'to annul'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒn.rɪˈsɪs.ə.ri/","syllables":"non-re-cis-so-ry"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It does not have different forms for gender or number."},"usage_notes":{"explanation":"'Nonrescissory' is a formal term, primarily used in legal and contractual contexts. It indicates that an agreement, contract, or order cannot be cancelled, revoked, or undone. The term emphasizes the binding and permanent nature of the arrangement. Its usage is relatively rare outside of specialized legal or business discussions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The nonrescissory of the contract was upheld.","correct":"✓ The nonrescissory nature of the contract was upheld.","note":"'Nonrescissory' is an adjective and should be used to describe a noun, not as a noun itself. Use 'nonrescissory nature' or a similar construction to correctly convey the meaning."},{"incorrect":"✗ The agreement is non-rescind.","correct":"✓ The agreement is nonrescissory.","note":"'Non-rescind' is not a correct term. The proper adjective form is 'nonrescissory'."}],"priority":"★★☆"},"related_words":{"derivatives":["rescind (verb)","rescission (noun)","rescissory (adjective)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'nonrescissory' is a highly specialized legal term indicating that something cannot be revoked or cancelled. It's primarily found in formal legal documents and discussions. Understanding this word requires familiarity with legal concepts and vocabulary, making it suitable for advanced learners or professionals in law or related fields."},"example_sentences":[{"sentence":"The settlement agreement was drafted with a nonrescissory provision to ensure finality.","translation":"和解契約は、最終性を確保するために、取り消し不能条項を設けて作成された。","type":"general","meaning_category":"取り消し不能の"},{"sentence":"The court determined that the judgment was nonrescissory due to the specific circumstances of the case.","translation":"裁判所は、訴訟の特定の状況により、判決が取り消し不能であると判断した。","type":"legal","meaning_category":"取り消し不能の"}]}