{"word":"collembolan","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"トビムシ","english_definition":"A small, wingless arthropod of the order Collembola, characterized by a forked appendage (furcula) used for jumping.","examples":[{"sentence":"Collembolans are common in soil and leaf litter.","translation":"トビムシは土壌や落ち葉の中に普通に見られる。"},{"sentence":"Some collembolans are important decomposers in ecosystems.","translation":"一部のトビムシは生態系において重要な分解者である。"}],"collocations":["soil collembolan","springtail collembolan"],"synonyms":["springtail"],"antonyms":[]}],"etymology":{"value":"From Collembola, the order to which these arthropods belong. Collembola is derived from the Greek words 'kolla' (glue) and 'embolon' (peg, piston), referring to the collophore, a tube-like structure used for adhesion.","priority":"★★☆"},"pronunciation":{"ipa":"/kɒlɛmˈboʊlən/","syllables":"col-lem-bo-lan"},"inflection":{"noun_plural":"collembolans"},"usage_notes":{"explanation":"'Collembolan' is the scientific term for springtails, small arthropods found in moist environments. They are not insects, although they were once classified as such. The term is most often used in scientific or technical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["Collembola (order)"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The term 'collembolan' is a scientific term primarily used in biology, ecology, and related fields. It refers to a specific order of arthropods, and understanding its usage requires familiarity with scientific classification systems and terminology. Due to its specialized nature, it is not commonly encountered in general English. "},"example_sentences":[{"sentence":"The scientist studied the diversity of collembolan species in the forest.","translation":"科学者は森林におけるトビムシの種の多様性を研究した。","type":"noun","meaning_category":"トビムシ"},{"sentence":"Collembolan populations can be indicators of soil health.","translation":"トビムシの個体数は土壌の健康状態の指標となりうる。","type":"noun","meaning_category":"トビムシ"}]}