{"word":"anti-art","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"反芸術","english_definition":"Art that rejects the generally accepted definitions of art and questions the boundaries of art. It often challenges traditional aesthetic values and aims to provoke or disrupt.","examples":[{"sentence":"Dadaism is often considered an anti-art movement.","translation":"ダダイスムはしばしば反芸術運動とみなされる。"},{"sentence":"His work was seen as anti-art because it challenged the very notion of artistic skill.","translation":"彼の作品は、芸術的スキルの概念そのものに挑戦しているため、反芸術と見なされた。"}],"collocations":["Dada anti-art","Conceptual anti-art","anti-art movement","anti-art stance","anti-art aesthetic"],"synonyms":["non-art","counter-art","dada","conceptual art (sometimes)"],"antonyms":["traditional art","conventional art","academic art"]},{"part_of_speech":"adjective","definition":"反芸術の","english_definition":"Relating to or characteristic of anti-art.","examples":[{"sentence":"The exhibition featured several anti-art pieces.","translation":"その展覧会では、いくつかの反芸術作品が展示されていた。"},{"sentence":"His anti-art approach was controversial but influential.","translation":"彼の反芸術的なアプローチは物議を醸したが、影響力があった。"}],"collocations":["anti-art movement","anti-art approach","anti-art sentiment","anti-art attitude"],"synonyms":["non-art","counter-art"],"antonyms":["artistic","conventional"]}],"etymology":{"value":"A term that emerged primarily with the Dada movement in the early 20th century. It combines the prefix 'anti-' (meaning against or opposed to) with 'art'. It signifies a rejection of traditional artistic values, aesthetics, and institutions.","priority":"★★★"},"pronunciation":{"ipa":"/ˌænti ˈɑːrt/","syllables":"an-ti-art"},"inflection":{"notes":"It functions as both a noun and an adjective, so inflection is minimal."},"usage_notes":{"explanation":"'Anti-art' is not simply bad art or the absence of art. It is a deliberate and often intellectual stance against established artistic norms. It aims to question what constitutes art, who gets to define it, and what purpose it serves. It is often associated with movements like Dadaism and some forms of Conceptual Art. It can be provocative and challenging, seeking to disrupt conventional aesthetic expectations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ This painting is very anti-art because it's ugly.","correct":"✓ This painting is considered anti-art because it rejects traditional artistic techniques and challenges the definition of art.","note":"Anti-art is not simply about being ugly or unskilled. It's about a conscious rejection of artistic conventions. The reason for considering something anti-art should be related to its conceptual challenge rather than its aesthetic appeal (or lack thereof)."},{"incorrect":"✗ Anti-art is the opposite of art.","correct":"✓ Anti-art is a reaction to and critique of established art.","note":"Anti-art is not simply the opposite of art; it exists in relation to art. It's a critical response to existing artistic practices and values. It's a form of art that questions art itself."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["Dadaism","Conceptual Art","Avant-garde","Modernism","Postmodernism","Readymades","Found objects","Art criticism"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, mainly used in art-related discussions.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Anti-art' is a term used in art theory and history to describe art that deliberately challenges or rejects traditional ideas about what art should be. It's not just about making something that looks bad; it's about questioning the very definition of art and its role in society. This concept is often discussed in relation to movements like Dadaism and Conceptual Art, which aimed to disrupt conventional artistic values and provoke new ways of thinking about art. Understanding 'anti-art' requires some familiarity with art history and theory, making it a more advanced concept."},"example_sentences":[{"sentence":"Marcel Duchamp's 'Fountain,' a signed urinal, is a famous example of anti-art.","translation":"マルセル・デュシャンの署名入り小便器である「泉」は、反芸術の有名な例である。","type":"noun","meaning_category":"Example of anti-art"},{"sentence":"The artist's anti-art statement was a rejection of the commercialization of the art world.","translation":"そのアーティストの反芸術的な声明は、美術界の商業化の拒否であった。","type":"adjective","meaning_category":"Anti-art statement"},{"sentence":"Some critics saw the performance as a deliberate attempt at anti-art, designed to shock and offend.","translation":"一部の批評家は、そのパフォーマンスを、衝撃を与え、不快感を与えるように設計された、意図的な反芸術の試みと見なした。","type":"noun","meaning_category":"Attempt at anti-art"}]}