{"word":"familism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"家族主義、家族中心主義","english_definition":"A social structure where the needs of the family are more important and take precedence over the needs of any of the family members.","examples":[{"sentence":"Familism is a core value in many Asian cultures.","translation":"家族主義は多くのアジア文化において中心的な価値観です。"},{"sentence":"The strength of familism in the community provides a strong support network for its members.","translation":"地域社会における家族主義の強さは、その構成員に強力な支援ネットワークを提供します。"},{"sentence":"Familism can sometimes conflict with individual autonomy.","translation":"家族主義は時に個人の自律性と対立することがあります。"}],"collocations":["strong familism (強い家族主義)","cultural familism (文化的な家族主義)","traditional familism (伝統的な家族主義)","practice of familism (家族主義の実践)"],"synonyms":["family-centeredness","family loyalty","collectivism (in a family context)"],"antonyms":["individualism","autonomy","self-reliance"]}],"etymology":{"value":"The word \"familism\" is derived from the word \"family\" with the suffix \"-ism\" which denotes a belief system or ideology.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfæmɪlɪzəm/","syllables":"fa-mil-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Familism is a sociological term that describes a social structure where the family's needs and values are prioritized over individual needs. It often involves strong family loyalty, support, and interdependence. It can be a source of strength and stability but can also create conflict when individual desires clash with family expectations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a familism person.","correct":"✓ He is a family-oriented person. / ✓ He believes in familism.","note":"\"Familism\" is a concept or ideology, not a characteristic of a person. To describe a person who values family, use \"family-oriented.\""},{"incorrect":"✗ Familism is always good.","correct":"✓ Familism can be both beneficial and detrimental, depending on the context.","note":"Familism has both positive and negative aspects. It's important to recognize that while it can provide support and stability, it can also limit individual freedom and create pressure."}],"priority":"★★☆"},"related_words":{"derivatives":["family (家族)","family-oriented (家族志向の)"],"phrases":["extended family (拡大家族)","nuclear family (核家族)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in academic and sociological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"familism\" refers to a social structure or cultural value system that prioritizes the needs and well-being of the family unit above the individual desires of its members. It often entails strong family loyalty, mutual support, and a sense of obligation among family members. While it can foster a sense of belonging and security, it may also lead to conflicts when individual aspirations clash with family expectations. This concept is frequently discussed in sociology, anthropology, and cultural studies.","priority":"★★★"},"example_sentences":[{"sentence":"In many Hispanic cultures, **familism** plays a significant role in social life.","translation":"多くのヒスパニック文化において、家族主義は社会生活において重要な役割を果たしています。","type":"general","meaning_category":"Definition"},{"sentence":"The study examined the impact of **familism** on academic achievement among immigrant students.","translation":"その研究は、移民の学生の学業成績に対する家族主義の影響を調査しました。","type":"academic","meaning_category":"Research"},{"sentence":"Critics argue that **familism** can sometimes hinder individual growth and independence.","translation":"批評家は、家族主義が時に個人の成長と自立を妨げることがあると主張しています。","type":"critical","meaning_category":"Criticism"}]}