{"word":"Occident-centric","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"西洋中心の、欧米中心の","english_definition":"Centered on or favoring the Occident (Western world), often to the exclusion or detriment of other cultures or perspectives.","examples":[{"sentence":"The curriculum was criticized for being too Occident-centric and neglecting non-Western perspectives.","translation":"そのカリキュラムは西洋中心主義的すぎ、非西洋的な視点を軽視していると批判された。"},{"sentence":"The museum's collection, while impressive, has a distinctly Occident-centric focus.","translation":"その美術館のコレクションは、印象的ではあるものの、明らかに西洋中心の焦点を持っている。"}],"collocations":["Occident-centric view","Occident-centric approach","Occident-centric bias","Occident-centric perspective"],"synonyms":["Eurocentric","Western-centric"],"antonyms":["Eastern-centric","Asia-centric","Afrocentric","multicultural","inclusive"]},{"part_of_speech":"noun","definition":"西洋中心主義者","english_definition":"A person who is centered on or favors the Occident (Western world), often to the exclusion or detriment of other cultures or perspectives.","examples":[{"sentence":"He was accused of being an Occident-centric, unwilling to consider other viewpoints.","translation":"彼は西洋中心主義者だと非難され、他の視点を考慮することを拒否した。"}],"collocations":[],"synonyms":["Eurocentrist","Western-centrist"],"antonyms":["multiculturalist"]}],"etymology":{"value":"Combination of 'Occident' (the West) and '-centric' (centered on).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɒksɪˈdent ˈsɛntrɪk/","syllables":"Oc-ci-dent-cen-tric"},"inflection":{"notes":"Adjective: Occident-centric (comparative/superlative forms are rare but possible: more/most Occident-centric). Noun: Occident-centric (plural: Occident-centrics)"},"usage_notes":{"explanation":"'Occident-centric' is often used critically to describe perspectives, attitudes, or practices that prioritize Western culture, values, and history while marginalizing or ignoring those of other regions. It implies a bias towards Western viewpoints as being superior or more important.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Occident-centric is good.","correct":"✓ An Occident-centric approach is not always good.","note":"'Occident-centric' is typically used as an adjective to describe something (e.g., view, approach, perspective). Using it as a standalone noun is less common and can sound awkward. It is better to use 'Occident-centrism' as a noun to describe the ideology."}],"priority":"★★☆"},"related_words":{"derivatives":["Occident-centrism (noun: 西洋中心主義)"],"phrasal_verbs":[],"related_concepts":["Eurocentrism","Westernization","cultural bias","ethnocentrism","Orientalism"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Occident-centric' is a complex term used in academic and critical discourse to describe a bias towards Western culture and perspectives. It implies a prioritization of Western values and a marginalization of non-Western viewpoints. The term is often used in discussions of cultural studies, postcolonialism, and globalization. Understanding this term requires familiarity with concepts of cultural bias and ethnocentrism."},"example_sentences":[{"sentence":"The analysis of global politics was criticized for its Occident-centric assumptions.","translation":"世界政治の分析は、その西洋中心的な前提のために批判された。","type":"adjective","meaning_category":"西洋中心の"},{"sentence":"The author challenges the Occident-centric narrative of history.","translation":"その著者は、歴史の西洋中心的な物語に異議を唱えている。","type":"adjective","meaning_category":"西洋中心の"}]}