{"word":"foster-nurse","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"乳母、養育係","english_definition":"A woman who suckles or brings up another's child; a wet nurse.","examples":[{"sentence":"In the past, it was common for wealthy families to employ a foster-nurse to care for their children.","translation":"昔は、裕福な家庭が子供の世話をするために乳母を雇うのが一般的でした。"},{"sentence":"The foster-nurse played a significant role in the child's early development.","translation":"乳母は子供の初期の発達において重要な役割を果たしました。"}],"collocations":["hire a foster-nurse","employ a foster-nurse","care for a child as a foster-nurse"],"synonyms":["wet nurse","nanny","nursemaid","carer"],"antonyms":[]}],"etymology":{"value":"The term 'foster' comes from Old English 'fostrian', meaning 'to nourish, support, bring up'. 'Nurse' comes from Old French 'norrice', from Latin 'nutricia', meaning 'a wet nurse'. The combination 'foster-nurse' specifically denotes a nurse who provides care and nourishment, often including breastfeeding, to a child who is not her own.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɒstərˌnɜːrs/","syllables":"fos-ter-nurse"},"inflection":{"noun_plural":"foster-nurses"},"usage_notes":{"explanation":"The term 'foster-nurse' is somewhat archaic and less commonly used in modern English. It specifically refers to a woman who breastfeeds and cares for another woman's child. Modern terms like 'nanny' or 'childcare provider' are more frequently used to describe someone who cares for children, although they do not necessarily imply breastfeeding.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She worked as a foster nurse for the elderly.","correct":"✓ She worked as a nurse for the elderly.","note":"'Foster-nurse' specifically refers to someone who cares for a child, not an elderly person. For the elderly, simply use 'nurse' or 'caregiver'."},{"incorrect":"✗ He was raised by a foster-nurse, so she is his foster mother.","correct":"✓ He was raised by a foster-nurse.","note":"A 'foster-nurse' is not necessarily a 'foster mother'. A foster mother takes on the role of a parent. A foster-nurse is specifically a caregiver providing nourishment and care."}],"priority":"★★☆"},"related_words":{"derivatives":["foster (verb, adjective): to nurture, to raise; providing parental care although not by blood or adoption","nurse (noun, verb): a person trained to care for the sick or infirm; to tend to someone's needs"],"phrasal_verbs":[],"related_terms":["wet nurse","nanny","nursemaid","childcare provider"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - The term is not commonly used in modern English.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'foster-nurse' is a relatively uncommon and somewhat archaic term. It refers specifically to a woman who breastfeeds and cares for a child who is not her own. The word is less frequently used in modern contexts, where terms like 'nanny' or 'childcare provider' are more common. Understanding the historical context and specific meaning of 'foster-nurse' requires a higher level of English proficiency.","priority":"★★☆"},"example_sentences":[{"sentence":"The novel described the close bond between the princess and her foster-nurse.","translation":"その小説は、王女とその乳母の間の親密な絆を描いていました。","type":"noun","meaning_category":"乳母"},{"sentence":"In historical dramas, the role of the foster-nurse is often portrayed as a trusted confidante.","translation":"歴史ドラマでは、乳母の役割はしばしば信頼できる相談相手として描かれています。","type":"noun","meaning_category":"養育係"}]}