{"word":"lithogenous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"岩石起源の、岩石から生成された","english_definition":"Consisting of or derived from rocks or stones.","examples":[{"sentence":"Lithogenous sediments are common in areas with high erosion rates.","translation":"岩石起源の堆積物は、侵食率の高い地域でよく見られます。"},{"sentence":"The lithogenous material contributed to the formation of the island.","translation":"岩石起源の物質が島の形成に寄与しました。"}],"collocations":["lithogenous sediment","lithogenous material","lithogenous particles"],"synonyms":["petrogenic","rock-derived"],"antonyms":["biogenous","hydrogenous","cosmogenous"]}],"etymology":{"value":"From Greek 'lithos' (stone) + 'genous' (producing, born).","priority":"★★☆"},"pronunciation":{"ipa":"/lɪˈθɒdʒənəs/","syllables":"li-thog-e-nous"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"'Lithogenous' is primarily used in geology and oceanography to describe sediments or materials that originate from the weathering and erosion of rocks. It distinguishes these materials from those that are biogenous (derived from living organisms), hydrogenous (precipitated from water), or cosmogenous (originating from outer space).","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The lithogenous rock was formed from organic matter.","correct":"The rock was formed from lithogenous sediment.","note":"Lithogenous refers to the origin of the sediment, not the rock itself. Rocks are formed from various types of sediments, including lithogenous ones."}],"priority":"★☆☆"},"related_words":{"derivatives":["lithogenesis (岩石生成)","lithology (岩石学)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'lithogenous' is a specialized term primarily used in geology and related fields. It describes materials, especially sediments, that are derived from the weathering and erosion of pre-existing rocks. Understanding this term requires a background in earth sciences or a strong vocabulary related to natural processes."},"example_sentences":[{"sentence":"The deep-sea clay contains a significant proportion of lithogenous particles.","translation":"深海粘土には、かなりの割合で岩石起源の粒子が含まれています。","type":"adjective","meaning_category":"rock-derived"},{"sentence":"Analysis of the sediment revealed that it was predominantly lithogenous in origin.","translation":"堆積物の分析により、その起源が主に岩石起源であることが明らかになりました。","type":"adjective","meaning_category":"rock-derived"}]}