{"word":"allergen-unlabeled","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"アレルゲン表示のない、アレルゲンに関するラベル表示がされていない","english_definition":"Not having allergen information labeled on a product.","examples":[{"sentence":"The product was recalled because it was allergen-unlabeled and posed a risk to consumers with allergies.","translation":"その製品はアレルゲン表示がなく、アレルギーを持つ消費者にリスクをもたらすため、回収されました。"},{"sentence":"Consumers should be cautious of allergen-unlabeled foods, especially if they have known allergies.","translation":"消費者は、特に既知のアレルギーがある場合、アレルゲン表示のない食品に注意する必要があります。"},{"sentence":"The new regulations require all food products to be clearly labeled, eliminating allergen-unlabeled items from the market.","translation":"新しい規制では、すべての食品製品に明確なラベル表示が義務付けられ、市場からアレルゲン表示のない製品が排除されます。"}],"collocations":["allergen-unlabeled product","allergen-unlabeled food","allergen-unlabeled item"],"synonyms":["unlabeled for allergens","allergen information missing","no allergen declaration"],"antonyms":["allergen-labeled","allergen-declared","with allergen information"]},{"part_of_speech":"noun","definition":"アレルゲン表示のない製品","english_definition":"A product that does not have allergen information labeled on it.","examples":[{"sentence":"The store removed all allergen-unlabeled products from its shelves.","translation":"その店は、棚からすべてのアレルゲン表示のない製品を撤去しました。"},{"sentence":"The health inspector found several allergen-unlabeled items during the inspection.","translation":"保健所の検査官は、検査中にいくつかのアレルゲン表示のない製品を発見しました。"}],"collocations":["find allergen-unlabeled products","remove allergen-unlabeled items"],"synonyms":["unlabeled allergen products","products without allergen labels"],"antonyms":["allergen-labeled products"]}],"etymology":{"value":"Combination of 'allergen' (a substance that causes an allergic reaction) and 'unlabeled' (not having a label).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈælərdʒən ʌnˈleɪbəld/","syllables":"al-ler-gen un-la-beled"},"inflection":{"notes":"Typically used as an adjective. Plural form for noun usage would be 'allergen-unlabeled products' or 'allergen-unlabeled items'."},"usage_notes":{"explanation":"'Allergen-unlabeled' is used to describe products, typically food, that do not have labels indicating the presence of common allergens such as nuts, dairy, soy, etc. This poses a significant risk to individuals with allergies, as they cannot make informed decisions about whether the product is safe for them to consume.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The food is allergen unlabeled.","correct":"✓ The food is allergen-unlabeled.","note":"The hyphen is important to connect the words and create a compound adjective."},{"incorrect":"✗ Allergen unlabeleds are dangerous.","correct":"✓ Allergen-unlabeled products are dangerous.","note":"When used as a noun, it's generally best to use the term as an adjective modifying a noun (e.g., 'allergen-unlabeled products') rather than trying to pluralize 'allergen-unlabeled' directly."}],"priority":"★★☆"},"related_words":{"derivatives":["allergen","unlabeled","labeling","allergy","food allergy"],"phrasal_verbs":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, specific to discussions about food safety and regulations.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Allergen-unlabeled' is a compound adjective used to describe food or products that do not have a label indicating the presence of allergens. Understanding this term is important for people with food allergies to avoid potentially dangerous products. It is commonly used in discussions about food safety regulations and labeling requirements."},"example_sentences":[{"sentence":"The company faced legal action for selling allergen-unlabeled snacks.","translation":"その会社は、アレルゲン表示のないスナックを販売したことで法的措置に直面しました。","type":"adjective","meaning_category":"アレルゲン表示のない"},{"sentence":"Finding allergen-unlabeled items on the shelves is a serious violation of food safety standards.","translation":"棚にアレルゲン表示のない製品を見つけることは、食品安全基準の重大な違反です。","type":"noun","meaning_category":"アレルゲン表示のない製品"}]}