{"word":"Corporealness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"有形性、肉体性、物質性","english_definition":"The state or quality of being corporeal; having a physical body or substance.","examples":[{"sentence":"The corporealness of the sculpture made it feel very real.","translation":"その彫刻の有形性は、それを非常に現実的に感じさせた。"},{"sentence":"He struggled to reconcile his spiritual beliefs with the corporealness of human existence.","translation":"彼は自身の精神的な信念と、人間の存在の肉体性とを調和させるのに苦労した。"}],"collocations":["emphasize corporealness","experience corporealness","corporealness of being","corporealness of existence"],"synonyms":["materiality","substantiality","physicality","tangibility","embodiment"],"antonyms":["immateriality","spirituality","ethereality","intangibility"]}],"etymology":{"value":"Derived from 'corporeal', which comes from the Latin 'corporeus' (belonging to the body), from 'corpus' (body). The suffix '-ness' turns it into a noun indicating a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/kɔːrˈpɔːriəlˌnɛs/","syllables":"cor-po-re-al-ness"},"inflection":{"noun_plural":"corporealnesses (rarely used)"},"usage_notes":{"explanation":"'Corporealness' refers to the quality of being physical or having a body. It is often used in philosophical or theological contexts when discussing the nature of existence, contrasting the physical with the spiritual or immaterial. It is not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The corporealness is important for ghosts.","correct":"✓ The lack of corporealness is a defining characteristic of ghosts.","note":"Ghosts are typically defined by their lack of physical form, so corporealness is not usually associated with them."},{"incorrect":"✗ He described the corporealness of the idea.","correct":"✓ He described the materiality of the idea.","note":"Ideas are abstract and do not possess corporealness. Materiality or tangibility might be more appropriate if the idea has concrete manifestations."}],"priority":"★☆☆"},"related_words":{"derivatives":["corporeal (adjective)","corporeality (noun)","incorporate (verb)"],"phrases":["corporeal being","corporeal world","corporeal form"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Corporealness' is a high-level, abstract noun used to describe the state of having a physical body or substance. It is most often encountered in philosophical, theological, or academic discussions about the nature of existence and the contrast between the physical and non-physical realms. Due to its abstract nature and infrequent use, it is considered a complex word. Understanding the root word 'corporeal' (relating to the body) is helpful in grasping its meaning."},"example_sentences":[{"sentence":"The artist sought to capture the corporealness of the human form in his sculptures.","translation":"その芸術家は、彫刻で人間の形の肉体性を捉えようとした。","type":"general","meaning_category":"肉体性"},{"sentence":"Philosophers debate the relationship between consciousness and corporealness.","translation":"哲学者は意識と肉体性の関係について議論する。","type":"philosophical","meaning_category":"有形性"},{"sentence":"The virtual world lacks the corporealness of real life.","translation":"仮想世界には現実世界の物質性がない。","type":"comparative","meaning_category":"物質性"}]}