{"word":"Avianize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"鳥のようにする、鳥の特徴を与える、鳥の性質を帯びさせる","english_definition":"To give something the characteristics of a bird; to make something bird-like.","examples":[{"sentence":"The artist tried to avianize the sculpture by adding feathers and wings.","translation":"芸術家は、羽毛と翼を加えることで、彫刻を鳥のようにしようと試みた。"},{"sentence":"The architect's goal was to avianize the building's design, making it light and airy.","translation":"建築家の目標は、建物のデザインを鳥のようにし、軽くて風通しの良いものにすることだった。"}],"collocations":["avianize a design","avianize a sculpture","avianize a concept"],"synonyms":["birdify","ornithify"],"antonyms":["humanize","mammalize"]}],"etymology":{"value":"From 'avian' (relating to birds) + '-ize' (a suffix indicating the act of making or becoming).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈeɪviənaɪz/","syllables":"A-vi-an-ize"},"inflection":{"verb_forms":{"present_simple":["avianize","avianizes"],"past_simple":"avianized","past_participle":"avianized","present_participle":"avianizing"}},"usage_notes":{"explanation":"'Avianize' is a relatively rare and specialized verb, primarily used in artistic, design, or scientific contexts. It implies a deliberate effort to imbue something with avian characteristics, whether physical or conceptual.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The program avianized the data.","correct":"✓ The program analyzed the data.","note":"'Avianize' is not a general-purpose verb for processing or transforming data. Use 'analyze' or a more specific verb instead."},{"incorrect":"✗ The car was avianized for better fuel efficiency.","correct":"✓ The car was streamlined for better fuel efficiency.","note":"Streamlining, not avianizing, is the appropriate term for improving aerodynamics in vehicles."}],"priority":"★☆☆"},"related_words":{"derivatives":["avianization (noun: the process of avianizing)","avian (adjective: relating to birds)"],"related_terms":["ornithology (the study of birds)","aviary (a place for keeping birds)","aviation (the design, development, and production of aircraft)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (not commonly found in standard language learning resources)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Avianize' is a niche word, primarily used in specialized contexts such as art, design, or biology. It means to make something bird-like or to give it avian characteristics. Due to its rarity, it's not typically encountered in general English usage. Understanding the root 'avian' (relating to birds) and the suffix '-ize' (to make or become) is helpful in deciphering its meaning.","priority":"★☆☆"},"example_sentences":[{"sentence":"The costume designer avianized the superhero's outfit with feathered wings and a beak-like mask.","translation":"コスチュームデザイナーは、羽毛の翼とくちばしのようなマスクで、スーパーヒーローの衣装を鳥のようにした。","type":"verb","meaning_category":"鳥のようにする (衣装)"},{"sentence":"The architect sought to avianize the building's structure, creating a design that mimicked the lightness and grace of a bird in flight.","translation":"建築家は、建物の構造を鳥のようにしようとし、飛行中の鳥の軽さと優雅さを模倣したデザインを作成した。","type":"verb","meaning_category":"鳥のようにする (建築)"}]}