{"word":"gun-shyness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"銃恐怖症、銃に対する極度の嫌悪感","english_definition":"A fear of or aversion to guns, especially loud noises associated with them.","examples":[{"sentence":"The dog developed gun-shyness after being exposed to loud gunfire.","translation":"その犬は大きな銃声にさらされた後、銃恐怖症になった。"},{"sentence":"Gun-shyness can be a problem for hunting dogs.","translation":"銃恐怖症は猟犬にとって問題となることがある。"},{"sentence":"The therapy aims to reduce the horse's gun-shyness.","translation":"そのセラピーは馬の銃恐怖症を軽減することを目的としている。"}],"collocations":["develop gun-shyness","overcome gun-shyness","treat gun-shyness","suffer from gun-shyness"],"synonyms":["fear of guns","aversion to firearms","noise sensitivity"],"antonyms":["gun enthusiasm","affinity for firearms","love of shooting"]},{"part_of_speech":"noun","definition":"(比喩的に)特定のことに対する極度の警戒心や嫌悪感","english_definition":"(Figurative) Extreme caution or aversion towards something specific.","examples":[{"sentence":"After the scandal, the company developed a gun-shyness towards controversial projects.","translation":"スキャンダルの後、その会社は物議を醸すプロジェクトに対して極度の警戒心を持つようになった。"},{"sentence":"The politician's gun-shyness about tax reform made it difficult to address the issue.","translation":"その政治家の税制改革に対する極度の警戒心が、問題への対処を困難にした。"},{"sentence":"The investor's gun-shyness towards tech stocks stemmed from past losses.","translation":"その投資家のハイテク株に対する極度の警戒心は、過去の損失に起因していた。"}],"collocations":["develop gun-shyness towards","show gun-shyness about","exhibit gun-shyness regarding"],"synonyms":["extreme caution","aversion","wariness","hesitation","reluctance"],"antonyms":["enthusiasm","eagerness","willingness","boldness"]}],"etymology":{"value":"The term likely originated from observations of animals, particularly dogs and horses, exhibiting fear responses to the sound of gunfire. The combination of \"gun\" (referring to firearms) and \"shyness\" (indicating timidity or aversion) creates a descriptive term for this specific phobia or aversion.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡʌnˌʃaɪnəs/","syllables":"gun-shy-ness"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"\"Gun-shyness\" primarily refers to the fear or aversion to guns, especially the loud noises they produce. This is commonly observed in animals trained for hunting or other activities involving firearms. Figuratively, it can describe a strong reluctance or aversion to something due to past negative experiences or potential risks.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a gun-shy about public speaking.","correct":"✓ He has gun-shyness about public speaking.","note":"\"Gun-shyness\" is a noun, so it should be used as such in a sentence. The incorrect sentence uses it as an adjective."},{"incorrect":"✗ The dog was gun-shy of the gun.","correct":"✓ The dog was gun-shy of the gunfire.","note":"The fear is usually triggered by the sound of the gun (gunfire), not the gun itself."}],"priority":"★★☆"},"related_words":{"derivatives":["gun-shy (adjective)"],"phrases":["noise phobia","sound sensitivity"],"related_concepts":["animal behavior","phobias","classical conditioning"]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"gun-shyness\" is a relatively uncommon term, primarily used to describe a specific phobia or aversion to guns and the sounds associated with them. Its figurative usage, referring to extreme caution or reluctance, is even less frequent. Understanding the term requires a grasp of both literal and metaphorical language, making it more suitable for advanced learners."},"example_sentences":[{"sentence":"The hunting dog's gun-shyness made it impossible to use him effectively.","translation":"その猟犬の銃恐怖症のせいで、彼を効果的に使うことが不可能になった。","type":"noun","meaning_category":"fear of guns"},{"sentence":"After the project failed, the team developed a gun-shyness towards new initiatives.","translation":"プロジェクトが失敗した後、チームは新しいイニシアチブに対して極度の警戒心を持つようになった。","type":"noun","meaning_category":"figurative aversion"},{"sentence":"The trainer worked patiently to overcome the horse's gun-shyness.","translation":"トレーナーは馬の銃恐怖症を克服するために根気強く取り組んだ。","type":"noun","meaning_category":"fear of guns"},{"sentence":"The company's gun-shyness regarding investment in renewable energy is holding them back.","translation":"再生可能エネルギーへの投資に対する会社の極度の警戒心が、彼らの足を引っ張っている。","type":"noun","meaning_category":"figurative aversion"}]}