{"word":"borated","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ホウ素を添加された、ホウ素処理された","english_definition":"Treated or mixed with boron or a boron compound.","examples":[{"sentence":"Borated polyethylene is used for neutron shielding.","translation":"ホウ素添加ポリエチレンは中性子遮蔽に使用される。"},{"sentence":"The reactor uses borated water as a neutron absorber.","translation":"その原子炉は中性子吸収材としてホウ素処理された水を使用する。"}],"collocations":["borated polyethylene","borated water","borated steel"],"synonyms":["boron-containing","boron-treated"],"antonyms":[]}],"etymology":{"value":"'Borated' is derived from 'borate,' which refers to a salt or ester of boric acid. The term 'borated' indicates that something has been treated or mixed with a borate compound or boron itself.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbɔːreɪtɪd/","syllables":"bo-rat-ed"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb."},"usage_notes":{"explanation":"'Borated' is primarily used in technical contexts, especially in nuclear engineering, chemistry, and materials science. It describes materials that have been modified by the addition of boron compounds to enhance specific properties, such as neutron absorption. The term is not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The food was borated for extra flavor.","correct":"✓ The food was seasoned for extra flavor.","note":"'Borated' is not used to describe food preparation. It's specific to chemical or industrial processes."}],"priority":"★★★"},"related_words":{"derivatives":["borate (noun, verb)","boron (noun)","boric acid (noun)"],"related_terms":["neutron absorption","shielding","nuclear reactor"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in technical and scientific literature.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'borated' is a technical term primarily encountered in scientific or industrial contexts, particularly related to nuclear engineering, chemistry, and materials science. It signifies that a material has undergone treatment or mixing with boron or a boron compound. Due to its specialized usage, it is not commonly found in general English discourse. Understanding requires familiarity with basic chemistry and nuclear concepts."},"example_sentences":[{"sentence":"The experimental setup included a borated glass window for radiation protection.","translation":"実験装置には、放射線防護のためのホウ素処理されたガラス窓が含まれていた。","type":"adjective","meaning_category":"ホウ素添加された"},{"sentence":"Borated solutions are often used in nuclear reactors to control the rate of fission.","translation":"ホウ素処理された溶液は、核分裂の速度を制御するために原子炉でよく使用される。","type":"adjective","meaning_category":"ホウ素処理された"}]}