{"word":"protopathy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"粗大な触覚や痛覚など、原始的な感覚","english_definition":"A primitive or basic sensation, such as crude touch, pain, or temperature, as opposed to epicritic sensations which are more refined.","examples":[{"sentence":"Protopathy allows us to feel pain, alerting us to potential harm.","translation":"原痛覚は、痛みを感知させ、潜在的な危害を知らせてくれる。"},{"sentence":"The protopathy pathway is responsible for the initial sensation of heat.","translation":"原痛覚経路は、熱の最初の感覚を伝える役割を担っている。"}],"collocations":["protopathic sensation","protopathic pathway","loss of protopathy"],"synonyms":["crude sensation","primitive sensibility"],"antonyms":["epicritic sensation","fine touch"],"notes":"Protopathy is often contrasted with epicritic sensation, which involves more refined and localized sensory perception."}],"etymology":{"value":"From Greek 'protos' (first, primitive) and 'pathos' (feeling, suffering).","priority":"★★☆"},"pronunciation":{"ipa":"/proʊˈtɒpəθi/","syllables":"pro-to-pa-thy"},"inflection":{"noun_plural":"protopathies"},"usage_notes":{"explanation":"Protopathy refers to the initial, less refined sensory experience, often related to pain, temperature, or crude touch. It is a more basic and less localized sensation compared to epicritic sensations, which allow for finer discrimination and localization.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient experienced a loss of epicritic sensation, but their protopathy was intact.","correct":"✓ The patient experienced a loss of epicritic sensation, but their protopathy was intact.","note":"This is already correct. The example highlights the contrast between the two types of sensation."}],"priority":"★☆☆"},"related_words":{"derivatives":["protopathic (adjective)"],"related_terms":["epicritic","sensory pathway","nociception"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Protopathy' is a specialized term used in neurology and sensory physiology to describe a basic, less refined type of sensory perception, such as crude touch, pain, or temperature. It's contrasted with 'epicritic' sensation, which involves finer discrimination and localization. Understanding this term requires a background in biology or medicine."},"example_sentences":[{"sentence":"Following the nerve injury, the patient exhibited preserved protopathy but impaired epicritic function.","translation":"神経損傷後、患者は原痛覚は保たれていたが、後知覚機能は障害されていた。","type":"medical","meaning_category":"sensory perception"},{"sentence":"Protopathy is essential for detecting potentially harmful stimuli.","translation":"原痛覚は、潜在的に有害な刺激を検出するために不可欠である。","type":"physiology","meaning_category":"sensory function"}]}