{"word":"pericentral","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(天文学)周心点の、軌道上で中心天体から最も遠い点に関する","english_definition":"relating to or situated at the point in an orbit that is farthest from the center of attraction (the primary body).","examples":[{"sentence":"The pericentral distance of the comet is much greater than the perihelion distance.","translation":"その彗星の周心距離は、近日点距離よりもはるかに大きい。"},{"sentence":"Pericentral velocity is the speed of an orbiting body at its farthest point from the central body.","translation":"周心速度とは、軌道上の天体が中心天体から最も遠い点における速度のことである。"}],"collocations":["pericentral distance","pericentral velocity","pericentral passage"],"synonyms":["apocentric","apoapsidal","apogean","aphelion"],"antonyms":["pericentric","periapsidal","perigean","perihelion"]}],"etymology":{"value":"Derived from the Greek prefix 'peri-' (around, near) and 'central' (relating to the center).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɛrɪˈsɛntrəl/","syllables":"per-i-cen-tral"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Pericentral' is a technical term used in astronomy and orbital mechanics. It describes properties or characteristics associated with the point in an orbit that is farthest from the central body. It is a general term that can be applied to any orbiting body around any central body. The specific term used depends on the central body (e.g., aphelion for the Sun, apogee for the Earth).","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The pericentral point is when the satellite is closest to Earth.","correct":"✓ The pericentral point is when the satellite is farthest from Earth.","note":"Pericentral refers to the farthest point, not the closest."}],"priority":"★★☆"},"related_words":{"derivatives":["pericenter (noun): the point in an orbit farthest from the central body.","apocenter (noun): synonym for pericenter."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pericentral' is a specialized term used in astronomy to describe the point in an orbit that is farthest from the central body. It's important to note that while 'pericentral' is a general term, specific terms like 'aphelion' (for orbits around the Sun) and 'apogee' (for orbits around the Earth) are more commonly used in those contexts. Understanding this term requires knowledge of orbital mechanics and astronomical vocabulary."},"example_sentences":[{"sentence":"The spacecraft reached its pericentral point after a long journey through space.","translation":"その宇宙船は、宇宙空間を長旅した後、周心点に到達した。","type":"general","meaning_category":"周心点"},{"sentence":"Calculating the pericentral velocity is crucial for planning orbital maneuvers.","translation":"周心速度の計算は、軌道操作を計画する上で非常に重要である。","type":"technical","meaning_category":"周心速度"}]}