{"word":"parcel-tying","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"抱き合わせ販売","english_definition":"The practice of selling one product or service as a mandatory addition to the purchase of a different product or service.","examples":[{"sentence":"Parcel-tying is often used to increase sales of less popular products.","translation":"抱き合わせ販売は、あまり人気のない製品の販売を増やすためによく使用されます。"},{"sentence":"The company was accused of parcel-tying by forcing customers to buy unnecessary software.","translation":"その会社は、顧客に不要なソフトウェアを購入させることで、抱き合わせ販売を行っているとして非難されました。"}],"collocations":["illegal parcel-tying","anti-competitive parcel-tying"],"synonyms":["bundling","product bundling"],"antonyms":["unbundling"]},{"part_of_speech":"verb","definition":"抱き合わせ販売する","english_definition":"To sell one product or service as a mandatory addition to the purchase of a different product or service.","examples":[{"sentence":"The company was parcel-tying its new software with its existing hardware.","translation":"その会社は、新しいソフトウェアを既存のハードウェアと抱き合わせ販売していました。"}],"collocations":[],"synonyms":["bundle","tie-in"],"antonyms":["unbundle"]}],"etymology":{"value":"The term 'parcel-tying' comes from the idea of tying one product (the 'parcel') to another, forcing the consumer to purchase both together.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpɑːrsəlˌtaɪɪŋ/","syllables":"par-cel-ty-ing"},"inflection":{"noun_plural":"parcel-tyings"},"usage_notes":{"explanation":"Parcel-tying is generally considered anti-competitive if it restricts consumer choice and harms competition. It is often subject to legal scrutiny.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The store was parcel-tying all of their products.","correct":"✓ The store was bundling all of their products.","note":"Bundling is a more general term, while parcel-tying implies a potentially anti-competitive practice."}],"priority":"★☆☆"},"related_words":{"derivatives":["tie-in sale"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Parcel-tying' is a specialized business term referring to the practice of requiring customers to purchase one product only if they also purchase another, often less desirable, product. It's often associated with anti-competitive behavior and legal concerns. Understanding this term requires familiarity with business and legal contexts."},"example_sentences":[{"sentence":"The regulator investigated the company for engaging in illegal **parcel-tying**.","translation":"規制当局は、その会社が違法な抱き合わせ販売に関与しているとして調査しました。","type":"noun","meaning_category":"抱き合わせ販売"},{"sentence":"Critics argued that the software company was **parcel-tying** its operating system with its web browser.","translation":"批評家たちは、そのソフトウェア会社がオペレーティングシステムをウェブブラウザと抱き合わせ販売していると主張しました。","type":"verb","meaning_category":"抱き合わせ販売する"}]}