{"word":"Cosmogonists","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"宇宙起源論者（複数形）: 宇宙の起源と進化に関する理論や神話を研究または提唱する人々。","english_definition":"Plural form of cosmogonist: Individuals who study or propose theories or myths concerning the origin and evolution of the universe.","examples":[{"sentence":"The cosmogonists of ancient Greece had various theories about the creation of the cosmos.","translation":"古代ギリシャの宇宙起源論者たちは、宇宙の創造に関する様々な理論を持っていた。"},{"sentence":"Modern cosmogonists use scientific methods to understand the early universe.","translation":"現代の宇宙起源論者たちは、初期宇宙を理解するために科学的な方法を用いている。"}],"collocations":["ancient cosmogonists (古代の宇宙起源論者)","modern cosmogonists (現代の宇宙起源論者)","religious cosmogonists (宗教的な宇宙起源論者)","scientific cosmogonists (科学的な宇宙起源論者)"],"synonyms":["creationists","theorists of cosmic origin"],"antonyms":["N/A - No direct antonyms, but may contrast with those who deny a specific origin or evolution of the universe."]}],"etymology":{"value":"From 'cosmogony' (the study of the origin of the universe) + '-ist' (a person who studies or believes in something)","priority":"★★☆"},"pronunciation":{"ipa":"/kɒzˈmɒɡənɪsts/","syllables":"cos-mog-o-nists"},"inflection":{"noun_plural":"Cosmogonists"},"usage_notes":{"explanation":"'Cosmogonists' refers to a group of people, not a single individual. It encompasses both those who approach the topic from a mythological or religious perspective and those who use scientific methodologies. The term is often used in historical or academic contexts when discussing different theories of the universe's beginning.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a cosmogonists.","correct":"✓ He is a cosmogonist.","note":"'Cosmogonists' is plural. For a single person, use 'cosmogonist'."}],"priority":"★★☆"},"related_words":{"derivatives":["cosmogony (宇宙起源論)","cosmological (宇宙論的な)","cosmology (宇宙論)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Cosmogonists' is a specialized term used in the context of cosmology, philosophy, and religious studies. It refers to individuals who engage in the study or formulation of theories about the origin and development of the universe. The term is most likely to be encountered in academic texts or discussions related to these fields."},"example_sentences":[{"sentence":"The writings of early cosmogonists often blended myth and proto-science.","translation":"初期の宇宙起源論者たちの著作は、しばしば神話と原始科学を融合させていた。","type":"noun","meaning_category":"宇宙起源論者"},{"sentence":"Contemporary cosmogonists rely on astrophysics and particle physics to develop their models.","translation":"現代の宇宙起源論者たちは、彼らのモデルを開発するために天体物理学と素粒子物理学に依存している。","type":"noun","meaning_category":"宇宙起源論者"}]}