{"word":"Nativists","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)生粋主義者、自国人優先主義者","english_definition":"(plural) individuals or groups who advocate for the protection and prioritization of native-born inhabitants over immigrants.","examples":[{"sentence":"The nativists opposed further immigration into the country.","translation":"生粋主義者たちは、その国へのさらなる移民に反対した。"},{"sentence":"Historically, nativists have expressed concerns about the cultural and economic impact of immigrants.","translation":"歴史的に、生粋主義者たちは移民の文化的および経済的影響について懸念を表明してきた。"}],"collocations":["anti-immigrant sentiment (反移民感情)","restrictive immigration policies (制限的な移民政策)","cultural homogeneity (文化的な同質性)","economic protectionism (経済的保護主義)"],"synonyms":["xenophobes","protectionists","isolationists"],"antonyms":["immigration advocates","multiculturalists","globalists"]},{"part_of_speech":"noun","definition":"(複数形、専門用語)生得説論者","english_definition":"(plural, technical) proponents of nativism, the philosophical view that certain kinds of knowledge are innate or inborn.","examples":[{"sentence":"The nativists in the debate argued that language acquisition is largely predetermined.","translation":"議論において、生得説論者たちは言語習得は大部分があらかじめ決定されていると主張した。"},{"sentence":"In psychology, nativists often contrast with empiricists, who emphasize the role of experience.","translation":"心理学において、生得説論者たちは経験の役割を強調する経験論者と対照的である。"}],"collocations":["innate knowledge (生得的な知識)","language acquisition (言語習得)","nature versus nurture (生得対育成)","philosophical debate (哲学的議論)"],"synonyms":["innatists","hereditarians"],"antonyms":["empiricists","environmentalists"]}],"etymology":{"value":"The term 'nativist' is derived from 'native,' referring to someone born in a particular place. The suffix '-ist' indicates an adherent or believer in a particular ideology or principle. In the context of immigration, it signifies a preference for native-born citizens over immigrants. In philosophy and psychology, it refers to the belief that certain knowledge or abilities are innate rather than learned.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈneɪtɪvɪsts/","syllables":"na-tiv-ists"},"inflection":{"noun_plural":"Nativists"},"usage_notes":{"explanation":"The term 'Nativists' can have two distinct meanings depending on the context:\n\n1.  In discussions about immigration, 'Nativists' refers to individuals or groups who advocate for policies that favor native-born citizens and restrict immigration. This usage often carries negative connotations, implying prejudice or discrimination against immigrants.\n2.  In philosophy and psychology, 'Nativists' (or innatists) refers to those who believe that certain knowledge, abilities, or predispositions are innate or inborn, rather than acquired through experience. This is a technical term used in academic contexts.\n\nIt's important to understand the context to correctly interpret the meaning of 'Nativists.'","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The nativists believe that all foreigners are bad.","correct":"✓ The nativists believe that immigration should be restricted to protect native-born citizens.","note":"Nativism is not necessarily about believing that all foreigners are bad, but rather about prioritizing the interests of native-born citizens. The incorrect sentence is an oversimplification and may be inaccurate."},{"incorrect":"✗ The nativists are always right about immigration policy.","correct":"✓ The nativists have a particular perspective on immigration policy that should be considered alongside other viewpoints.","note":"It is important to present nativism as one perspective among many, rather than as an inherently correct or incorrect viewpoint."}],"priority":"★★☆"},"related_words":{"derivatives":["nativism (名詞: 生粋主義、自国人優先主義、生得説)","native (名詞/形容詞: 生まれつきの、原住民の、自国の)","natively (副詞: 生まれつき、自然に)"],"phrases":["nativist movement (生粋主義運動)","anti-immigrant sentiment (反移民感情)","innate ability (生得的な能力)","nature versus nurture (生得対育成)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Relatively low frequency, but important in specific contexts (immigration, philosophy, psychology).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"Nativists\" refers to two distinct concepts. In the context of immigration, it describes individuals or groups who prioritize the interests of native-born citizens and advocate for restrictive immigration policies. This usage often carries negative connotations. In philosophy and psychology, \"Nativists\" refers to those who believe that certain knowledge or abilities are innate rather than learned through experience. This is a more technical usage. Understanding the context is crucial to interpreting the meaning of \"Nativists\" correctly.","priority":"★★☆"},"example_sentences":[{"sentence":"The **nativists** argued for stricter border controls.","translation":"生粋主義者たちは、より厳格な国境管理を主張した。","type":"noun","meaning_category":"Immigration context"},{"sentence":"Some **nativists** believe that certain cognitive abilities are present from birth.","translation":"一部の生得説論者は、特定の認知能力は生まれつき備わっていると信じている。","type":"noun","meaning_category":"Philosophical context"},{"sentence":"The rise of **nativists** parties has been observed in several European countries.","translation":"生粋主義政党の台頭は、いくつかのヨーロッパ諸国で観察されている。","type":"noun","meaning_category":"Immigration context"},{"sentence":"**Nativists** in the 19th century often targeted Irish and Chinese immigrants.","translation":"19世紀の生粋主義者たちは、しばしばアイルランド人と中国人の移民を標的にした。","type":"noun","meaning_category":"Historical context"},{"sentence":"The debate between **nativists** and empiricists continues to shape our understanding of human development.","translation":"生得説論者と経験論者の間の議論は、人間の発達についての私たちの理解を形成し続けている。","type":"noun","meaning_category":"Philosophical context"}]}