{"word":"silvervine","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"マタタビ (植物)","english_definition":"A deciduous climbing vine, Actinidia polygama, native to Japan, China, Korea, and Russia, known for its effects on cats similar to those of catnip.","examples":[{"sentence":"My cat loves playing with silvervine sticks.","translation":"私の猫はマタタビの棒で遊ぶのが大好きです。"},{"sentence":"Silvervine is often used as a cat toy.","translation":"マタタビは猫のおもちゃとしてよく使われます。"},{"sentence":"The active ingredient in silvervine is actinidine.","translation":"マタタビの有効成分はアクチニジンです。"}],"collocations":["silvervine stick (マタタビの棒)","silvervine powder (マタタビの粉)","cat and silvervine (猫とマタタビ)"],"synonyms":["catnip (イヌハッカ)"],"antonyms":[]}],"etymology":{"value":"\"Silver\" + \"vine\". The name refers to the silvery appearance of the leaves of some varieties of the plant.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɪlvərvaɪn/","syllables":"sil-ver-vine"},"inflection":{"noun_plural":"silvervines"},"usage_notes":{"explanation":"Silvervine is a plant native to East Asia, particularly Japan. It is well known for its effects on cats, which are often more pronounced than those of catnip. Cats may exhibit behaviors such as rolling, rubbing, licking, and playing when exposed to silvervine. It is often sold in the form of dried sticks, powder, or included in cat toys.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ My cat is addicted to silvervine, so I give it to him everyday.","correct":"✓ My cat enjoys silvervine, but I only give it to him occasionally.","note":"While cats enjoy silvervine, it's best to give it to them in moderation to maintain its effectiveness."}],"priority":"★★☆"},"related_words":{"derivatives":["actinidine (アクチニジン)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"Uncommon (B2-C2)","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"silvervine\" refers to a specific type of plant, Actinidia polygama, which is known for its stimulating effect on cats, similar to catnip. It's not a commonly used word unless you're discussing cats or botany. The term is relatively straightforward in construction, combining \"silver\" and \"vine\" to describe the plant's appearance."},"example_sentences":[{"sentence":"Many cats react strongly to **silvervine**, exhibiting playful behavior.","translation":"多くの猫はマタタビに強く反応し、遊び好きな行動を示します。","type":"noun","meaning_category":"植物"},{"sentence":"I bought a **silvervine** toy for my cat, and he loves it.","translation":"猫のためにマタタビのおもちゃを買ったら、とても気に入っています。","type":"noun","meaning_category":"植物"},{"sentence":"Some studies show that **silvervine** is more effective than catnip for some cats.","translation":"いくつかの研究では、マタタビは一部の猫にとってイヌハッカよりも効果的であることが示されています。","type":"noun","meaning_category":"植物"}]}