{"word":"unbeveled","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"面取りされていない、斜角がつけられていない","english_definition":"Not having a beveled edge; without a sloped or angled edge.","examples":[{"sentence":"The mirror had an unbeveled edge, giving it a sharp, modern look.","translation":"その鏡は面取りされておらず、シャープでモダンな外観になっていた。"},{"sentence":"The unbeveled glass was more prone to chipping.","translation":"面取りされていないガラスは、欠けやすかった。"}],"collocations":["unbeveled edge","unbeveled glass","unbeveled surface"],"synonyms":["square-edged","straight-edged","non-beveled"],"antonyms":["beveled","chamfered","angled"],"notes":"Often used in the context of glass, mirrors, or woodworking."}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to the word 'beveled'.","priority":"low"},"pronunciation":{"ipa":"/ʌnˈbevəld/","syllables":"un-bev-eled"},"inflection":{"notes":"This word is an adjective and follows standard adjective inflection rules (none)."},"usage_notes":{"explanation":"'Unbeveled' describes an object that lacks a beveled edge. A beveled edge is one that has been cut at an angle to the main surface, often to reduce sharpness or for decorative purposes. Therefore, an unbeveled object has a straight, perpendicular edge.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"The unbeveled edge was smooth.","correct":"The unbeveled edge was sharp.","note":"Unbeveled edges are typically sharp, not smooth, unless they have been further processed (e.g., sanded)."},{"incorrect":"He beveled the edge to make it unbeveled.","correct":"He removed the bevel to make it unbeveled.","note":"You can't bevel something to make it unbeveled. You would need to remove an existing bevel."}],"priority":"low"},"related_words":{"derivatives":["bevel (noun, verb)","beveler (noun)"],"related_terms":["chamfer","miter","edge","angle"],"priority":"medium"},"level_frequency":{"frequency_google_ngram":"Low frequency. Technical or descriptive contexts.","priority":"low"},"readability_explanation":{"level":"C1","text":"'Unbeveled' is a relatively uncommon word, primarily used in technical or descriptive contexts, such as construction, woodworking, or glassmaking. It describes an edge or surface that has not been cut at an angle. Understanding the term 'bevel' is necessary to comprehend 'unbeveled'. Due to its specialized use, it is not typically encountered in everyday language."},"example_sentences":[{"sentence":"The furniture design called for an unbeveled tabletop.","translation":"その家具のデザインでは、面取りされていないテーブルトップが求められていた。","type":"general","meaning_category":"description"},{"sentence":"The safety regulations required beveled edges, so the unbeveled prototype had to be modified.","translation":"安全規制では面取りされたエッジが必要とされていたため、面取りされていない試作品は修正する必要があった。","type":"technical","meaning_category":"regulation"}]}