{"word":"mysophobic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"不潔恐怖症の、細菌恐怖症の","english_definition":"Having an extreme fear of dirt, germs, contamination, or filth.","examples":[{"sentence":"He is mysophobic and washes his hands dozens of times a day.","translation":"彼は不潔恐怖症で、一日に何十回も手を洗う。"},{"sentence":"Her mysophobic tendencies made it difficult for her to use public restrooms.","translation":"彼女の不潔恐怖症の傾向により、公共のトイレを使うのが困難だった。"}],"collocations":["mysophobic tendencies","mysophobic behavior","mysophobic person"],"synonyms":["germophobic","verminophobic","contaminophobic"],"antonyms":["none (opposite is someone with no fear of germs or dirt)"]}],"etymology":{"value":"From the Greek words 'mysos' (μύσος) meaning 'uncleanness' or 'defilement' and 'phobos' (φόβος) meaning 'fear'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmaɪsəˈfoʊbɪk/","syllables":"my-so-pho-bic"},"inflection":{"notes":"Adjective, no specific inflections."},"usage_notes":{"explanation":"'Mysophobic' describes someone who has mysophobia, an anxiety disorder characterized by an excessive fear of germs, dirt, contamination, and filth. It is more than just being clean; it's an irrational and overwhelming fear that significantly impacts daily life.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He is mysophobic, so he is very clean.","correct":"He is mysophobic, so he has an extreme fear of germs.","note":"Being clean is not the same as having mysophobia. Mysophobia is an extreme fear, not just a preference for cleanliness."}],"priority":"★★☆"},"related_words":{"derivatives":["mysophobia (noun): The extreme fear of dirt, germs, contamination, or filth."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2 (rare, technical term)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mysophobic' is a specialized term used to describe someone who suffers from mysophobia, an extreme and irrational fear of germs, dirt, and contamination. This fear is so intense that it can significantly interfere with a person's daily life, leading to compulsive cleaning behaviors and avoidance of public spaces. The word is derived from Greek roots and is primarily used in psychological or medical contexts."},"example_sentences":[{"sentence":"The doctor diagnosed him as mysophobic after observing his compulsive hand-washing.","translation":"医師は、彼が強迫的に手を洗うのを見て、彼を不潔恐怖症と診断した。","type":"adjective","meaning_category":"Medical/Psychological"},{"sentence":"Her mysophobic reactions were triggered by the sight of the dirty subway car.","translation":"彼女の不潔恐怖症的な反応は、汚い地下鉄車両を見たことで引き起こされた。","type":"adjective","meaning_category":"General"}]}