{"word":"monotreme","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"単孔類（たんこうるい）","english_definition":"any mammal of the order Monotremata, which comprises the echidnas and platypuses; they are distinguished by laying eggs rather than giving birth to live young, and by having a single opening (the cloaca) for excretion and reproduction.","examples":[{"sentence":"The platypus is a monotreme native to Australia.","translation":"カモノハシはオーストラリア原産の単孔類です。"},{"sentence":"Monotremes are unique among mammals in their reproductive strategy.","translation":"単孔類は哺乳類の中で、その繁殖戦略において独特です。"},{"sentence":"Echidnas and platypuses are the only extant monotremes.","translation":"ハリモグラとカモノハシは現存する唯一の単孔類です。"}],"collocations":["Australian monotreme","extant monotreme","primitive monotreme","monotreme egg","monotreme physiology"],"synonyms":["egg-laying mammal"],"antonyms":["placental mammal","marsupial"],"scientific_classification":{"kingdom":"Animalia","phylum":"Chordata","class":"Mammalia","order":"Monotremata"}}],"etymology":{"value":"Derived from the Greek words 'monos' (single) and 'trema' (hole), referring to the single opening (cloaca) used for excretion and reproduction.","priority":"★★★"},"pronunciation":{"ipa":"ˈmɒnətriːm","syllables":"mon-o-treme"},"inflection":{"noun_plural":"monotremes"},"usage_notes":{"explanation":"'Monotreme' refers specifically to the order of mammals that lay eggs instead of giving birth to live young. The term highlights their unique anatomical feature: the cloaca, a single opening for excretion, urination, and reproduction. This characteristic distinguishes them from placental and marsupial mammals.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Monotremes are reptiles.","correct":"✓ Monotremes are mammals.","note":"Monotremes are often mistaken for reptiles because they lay eggs, but they are classified as mammals due to having fur, producing milk, and being warm-blooded."},{"incorrect":"✗ All mammals are monotremes.","correct":"✓ Some mammals are monotremes.","note":"Monotremes are a small and unique group within mammals; most mammals are placental or marsupial."}],"priority":"★★☆"},"related_words":{"derivatives":["monotrematous (adjective)"],"related_terms":["echidna","platypus","cloaca","mammal","egg-laying mammal"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency. Primarily used in scientific or educational contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'monotreme' is a scientific term used to describe a specific group of mammals that lay eggs. Understanding this word requires some biological knowledge, as it refers to a unique characteristic that distinguishes these animals from other mammals. The term is most likely encountered in scientific texts, documentaries, or educational materials related to zoology or evolutionary biology."},"example_sentences":[{"sentence":"The **monotreme** has a pouch like a marsupial.","translation":"その単孔類は有袋類のような袋を持っている。","type":"general","meaning_category":"general"},{"sentence":"The study focused on the evolutionary history of the **monotreme**.","translation":"その研究は単孔類の進化の歴史に焦点を当てていた。","type":"scientific","meaning_category":"scientific"},{"sentence":"The **monotreme** is an important part of the Australian ecosystem.","translation":"単孔類はオーストラリアの生態系において重要な役割を果たしている。","type":"ecological","meaning_category":"ecological"}]}