{"word":"horse-flesh","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"馬肉","english_definition":"The meat of a horse, used as food.","examples":[{"sentence":"In some countries, horse-flesh is considered a delicacy.","translation":"一部の国では、馬肉は珍味とされています。"},{"sentence":"The butcher sold horse-flesh at a lower price than beef.","translation":"その肉屋は牛肉よりも安い値段で馬肉を売っていた。"}],"collocations":["eat horse-flesh","horse-flesh sausage","horse-flesh butcher"],"synonyms":["chevaline","horsemeat"],"antonyms":[]},{"part_of_speech":"noun","definition":"（軽蔑的に）年老いた、または魅力のない女性","english_definition":"(derogatory) An old or unattractive woman.","examples":[{"sentence":"He referred to his ex-wife as horse-flesh.","translation":"彼は元妻を軽蔑的に「馬肉」と呼んだ。"},{"sentence":"The critic described the actress as 'over the hill' and 'horse-flesh'.","translation":"評論家はその女優を「峠を過ぎた」「馬肉」と評した。"}],"collocations":["call someone horse-flesh","describe someone as horse-flesh"],"synonyms":["hag","crone","old bag"],"antonyms":[]}],"etymology":{"value":"'Horse' + 'flesh'. The derogatory sense likely arose from the association of old, worn-out horses being suitable only for meat.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɔːrsˌfleʃ/","syllables":"horse-flesh"},"inflection":{"noun_plural":"horse-fleshes"},"usage_notes":{"explanation":"The term 'horse-flesh' has two distinct meanings. The primary meaning refers to the meat of a horse, which is consumed in some cultures. However, it also carries a derogatory and offensive meaning when used to describe an old or unattractive woman. This usage is highly offensive and should be avoided. The context is crucial in determining the intended meaning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She cooked horse-flesh for dinner, showing her love for animals.","correct":"✓ She cooked horse-flesh for dinner, showing her cultural culinary preferences.","note":"Cooking horse-flesh might be seen as contradictory to showing love for animals in some cultures. It's better to indicate cultural preference or culinary interest."},{"incorrect":"✗ He complimented her by calling her horse-flesh.","correct":"✓ He insulted her by calling her horse-flesh.","note":"Calling someone 'horse-flesh' is an insult, not a compliment."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["horsemeat","chevaline"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Horse-flesh' is a term that can refer to the meat of a horse, or, more offensively, an unattractive or old woman. The derogatory use is highly offensive and should be avoided. The term is not commonly used in everyday conversation, and understanding its context is important to avoid misinterpretation or causing offense."},"example_sentences":[{"sentence":"The recipe called for horse-flesh, which was difficult to find in this region.","translation":"そのレシピには馬肉が必要だったが、この地域では見つけるのが難しかった。","type":"noun","meaning_category":"馬肉"},{"sentence":"His comment about her being 'horse-flesh' was incredibly rude and disrespectful.","translation":"彼女を「馬肉」と呼ぶ彼のコメントは、信じられないほど失礼で無礼だった。","type":"noun","meaning_category":"（軽蔑的に）年老いた、または魅力のない女性"}]}