{"word":"Delphinine","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"デルフィニン：キンポウゲ科の植物に含まれる有毒なアルカロイド","english_definition":"A poisonous alkaloid found in plants of the genus Delphinium (larkspurs).","examples":[{"sentence":"Delphinine is a highly toxic compound affecting the nervous system.","translation":"デルフィニンは神経系に影響を与える非常に有毒な化合物です。"},{"sentence":"Livestock poisoning is often associated with delphinine-containing plants.","translation":"家畜の中毒は、デルフィニンを含む植物と関連していることが多いです。"}],"collocations":["delphinine poisoning","delphinine alkaloid","delphinium species"],"synonyms":["larkspur alkaloid"],"antonyms":[]}],"etymology":{"value":"Derived from the genus name \"Delphinium\", which comes from the Greek word \"delphinion\" referring to larkspur plants. The name is due to the flower's resemblance to a dolphin.","priority":"★★☆"},"pronunciation":{"ipa":"/dɛlˈfɪnɪn/","syllables":"Del-phin-ine"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Delphinine is a toxic alkaloid primarily found in larkspur plants (Delphinium species). It is known for its neurotoxic effects and can be harmful to both humans and animals, particularly livestock.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Delphinine is a type of vitamin.","correct":"✓ Delphinine is a type of alkaloid.","note":"Delphinine is an alkaloid, not a vitamin."},{"incorrect":"✗ Delphinine is safe to consume in small quantities.","correct":"✓ Delphinine is toxic and should not be consumed.","note":"Delphinine is a poison and should not be consumed."}],"priority":"★★☆"},"related_words":{"derivatives":["Delphinium (genus)","alkaloid"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Delphinine is a technical term referring to a specific toxic alkaloid found in larkspur plants. Understanding this term requires a background in botany, chemistry, or toxicology. It is typically encountered in scientific or technical contexts related to plant toxins and their effects.","priority":"★★☆"},"example_sentences":[{"sentence":"The chemical structure of delphinine has been extensively studied.","translation":"デルフィニンの化学構造は広範囲に研究されています。","type":"noun","meaning_category":"toxic alkaloid"},{"sentence":"Delphinine can cause neuromuscular paralysis in animals.","translation":"デルフィニンは動物に神経筋麻痺を引き起こす可能性があります。","type":"noun","meaning_category":"toxic alkaloid"},{"sentence":"The concentration of delphinine varies among different species of Delphinium.","translation":"デルフィニンの濃度は、さまざまなデルフィニウム種間で異なります。","type":"noun","meaning_category":"toxic alkaloid"}]}