{"word":"Yohimbin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ヨヒンビン：アフリカ原産のヨヒンベの木の樹皮から抽出されるアルカロイド。媚薬や勃起不全の治療薬として使用される。また、脂肪燃焼を促進するサプリメントとしても販売されている。","english_definition":"Yohimbine is an alkaloid derived from the bark of the African yohimbe tree. It is used as an aphrodisiac and to treat erectile dysfunction. It is also marketed as a supplement to promote fat burning.","examples":[{"sentence":"Yohimbin wird in einigen Nahrungsergänzungsmitteln zur Gewichtsreduktion verwendet.","translation":"ヨヒンビンは、いくつかの減量サプリメントに使用されています。（ドイツ語）"},{"sentence":"Yohimbin ist ein selektiver α2-Adrenozeptor-Antagonist.","translation":"ヨヒンビンは選択的α2アドレナリン受容体拮抗薬です。（ドイツ語）"},{"sentence":"Some studies suggest that yohimbine may be effective in treating erectile dysfunction.","translation":"いくつかの研究では、ヨヒンビンが勃起不全の治療に有効である可能性が示唆されています。"}],"collocations":["yohimbine hydrochloride","yohimbe extract","alpha-2 adrenergic receptor antagonist","fat burning supplement","sexual dysfunction treatment"],"synonyms":["aphrodisiac","erectile dysfunction drug","fat burner"],"antonyms":[]}],"etymology":{"value":"The word \"yohimbine\" comes from the name of the yohimbe tree (Pausinystalia yohimbe), native to Africa, from which the alkaloid is extracted.","priority":"★★☆"},"pronunciation":{"ipa":"/joʊˈhɪmbiːn/","syllables":"yo-him-been"},"inflection":{"notes":"単数形"},"usage_notes":{"explanation":"Yohimbine is a chemical compound found naturally in the yohimbe tree. It is often marketed as a dietary supplement, but its effectiveness and safety are subjects of debate. It is important to consult with a healthcare professional before using yohimbine, as it can have side effects and interact with certain medications.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I take yohimbin for my cold.","correct":"✓ I take yohimbin for erectile dysfunction/fat loss.","note":"Yohimbine is not used to treat colds. It is primarily used for erectile dysfunction and fat loss. It's important to use it for the correct purpose and under medical supervision."}],"priority":"★★☆"},"related_words":{"derivatives":["yohimbe (ヨヒンベ)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Yohimbine is a complex term referring to a chemical compound extracted from the yohimbe tree. It is associated with discussions about supplements, treatments for erectile dysfunction, and fat loss. Understanding this term requires some background knowledge in biology, pharmacology, or related fields. It's important to note that using yohimbine can have potential side effects, so it's crucial to consult with a healthcare professional before considering it.","priority":"★★☆"},"example_sentences":[{"sentence":"The supplement contains yohimbine to aid in fat burning.","translation":"そのサプリメントには、脂肪燃焼を助けるためにヨヒンビンが含まれています。","type":"general","meaning_category":"fat burning supplement"},{"sentence":"Yohimbine is sometimes used to treat erectile dysfunction.","translation":"ヨヒンビンは、勃起不全の治療に使用されることがあります。","type":"medical","meaning_category":"erectile dysfunction treatment"},{"sentence":"Consult a doctor before taking yohimbine, as it can have side effects.","translation":"ヨヒンビンを服用する前に医師に相談してください。副作用がある可能性があります。","type":"medical","meaning_category":"medical precaution"}]}