{"word":"extractant","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"抽出剤、抽出溶媒","english_definition":"A solvent or other substance used in extraction to dissolve and separate a desired material from a mixture.","examples":[{"sentence":"The extractant used in this process is supercritical carbon dioxide.","translation":"このプロセスで使用される抽出剤は、超臨界二酸化炭素です。"},{"sentence":"The choice of extractant depends on the properties of the target compound.","translation":"抽出剤の選択は、目的化合物の特性によって決まります。"},{"sentence":"An organic solvent is often used as an extractant in liquid-liquid extraction.","translation":"液液抽出では、有機溶媒が抽出剤としてよく使用されます。"}],"collocations":["organic extractant (有機抽出剤)","supercritical extractant (超臨界抽出剤)","selective extractant (選択的抽出剤)","suitable extractant (適切な抽出剤)","effective extractant (効果的な抽出剤)"],"synonyms":["solvent","extracting agent","leachant","eluent"],"antonyms":[]}],"etymology":{"value":"From 'extract' (to draw out) + '-ant' (a suffix indicating a substance or agent that performs the action).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪkˈstræktənt/","syllables":"ex-tract-ant"},"inflection":{"noun_plural":"extractants"},"usage_notes":{"explanation":"An 'extractant' is a specific type of solvent or agent chosen to selectively dissolve and remove a particular substance from a mixture. It is crucial in various chemical and industrial processes, including separation, purification, and analysis. The selection of the appropriate extractant is based on factors such as solubility, selectivity, cost, and environmental impact.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The extractant extracted the desired compound.","correct":"✓ The extractant extracted the desired compound from the mixture.","note":"It's important to specify the source from which the compound is extracted. Using 'from the mixture' clarifies this. Alternatively, 'The extractant was used to extract the desired compound' is also correct."},{"incorrect":"✗ Extractant is used for adding a substance to a mixture.","correct":"✓ Extractant is used for removing a substance from a mixture.","note":"An extractant removes, not adds, a substance from a mixture."}],"priority":"★★☆"},"related_words":{"derivatives":["extract (verb, noun)","extraction (noun)","extractable (adjective)"],"related_terms":["solvent extraction","liquid-liquid extraction","supercritical fluid extraction","solid-phase extraction","leaching"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Extractant' is a technical term primarily used in chemistry, chemical engineering, and related fields. It refers to a substance, typically a solvent, used to extract a specific compound from a mixture. Understanding this term requires familiarity with chemical processes and separation techniques. It is not commonly used in everyday language.","priority":"★☆☆"},"example_sentences":[{"sentence":"The efficiency of the extraction process depends on the choice of the extractant.","translation":"抽出プロセスの効率は、抽出剤の選択に依存します。","type":"general"},{"sentence":"Hexane is a common extractant used for extracting oils from seeds.","translation":"ヘキサンは、種子から油を抽出するためによく使用される抽出剤です。","type":"specific"},{"sentence":"The researchers tested several different extractants to find the most effective one.","translation":"研究者たちは、最も効果的な抽出剤を見つけるために、いくつかの異なる抽出剤をテストしました。","type":"research"}]}