{"word":"phorometric","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"屈折検査の、斜位測定の","english_definition":"Relating to phorometry, the measurement of heterophoria (the tendency of the eyes to deviate when fusion is broken).","examples":[{"sentence":"The phorometric examination revealed a significant exophoria.","translation":"斜位測定検査で、顕著な外斜位が明らかになった。"},{"sentence":"Phorometric data is essential for diagnosing binocular vision disorders.","translation":"斜位測定データは、両眼視機能障害の診断に不可欠である。"}],"collocations":["phorometric testing","phorometric measurements","phorometric analysis","phorometric examination","phorometric findings"],"synonyms":["heterophoric","binocular vision assessment"],"antonyms":[]}],"etymology":{"value":"Derived from 'phorometry', which combines 'phoro-' (from Greek 'phoros' meaning 'bearing, carrying') and '-metry' (measurement).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfɔːroʊˈmɛtrɪk/","syllables":"pho-ro-met-ric"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns."},"usage_notes":{"explanation":"'Phorometric' is a technical term used in optometry and ophthalmology. It specifically refers to measurements and assessments related to heterophoria, which is the misalignment of the eyes when binocular vision is disrupted. It's used to describe tests, data, and findings related to this type of eye examination.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The doctor used a phorometric to check my vision.","correct":"✓ The doctor performed phorometry to check my vision.","note":"'Phorometric' is an adjective, not a noun. The noun form for the procedure is 'phorometry'."}],"priority":"★☆☆"},"related_words":{"derivatives":["phorometry (noun)","phorometer (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Phorometric' is a specialized term used in the field of optometry and ophthalmology. It describes anything related to the measurement of heterophoria, which is the tendency of the eyes to misalign when not actively focusing on an object. This term is not commonly used outside of professional contexts related to eye care."},"example_sentences":[{"sentence":"The patient underwent a comprehensive phorometric evaluation to assess their binocular vision.","translation":"患者は、両眼視機能を評価するために、包括的な斜位測定評価を受けた。","type":"adjective","meaning_category":"屈折検査の、斜位測定の"},{"sentence":"Phorometric results indicated a need for vision therapy.","translation":"斜位測定の結果は、視覚療法が必要であることを示した。","type":"adjective","meaning_category":"屈折検査の、斜位測定の"}]}