{"word":"autoreinfusion","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"自己血輸血、自己輸血","english_definition":"The reinfusion of a patient's own blood that has been collected and processed, typically during or after surgery.","examples":[{"sentence":"Autoreinfusion is often used in orthopedic surgery to reduce the need for allogeneic blood transfusions.","translation":"自己血輸血は、異種血輸血の必要性を減らすために、整形外科手術でよく使用されます。"},{"sentence":"The system for autoreinfusion collects blood from the surgical site, filters it, and then returns it to the patient.","translation":"自己血輸血のためのシステムは、手術部位から血液を収集し、それをろ過してから、患者に戻します。"}],"collocations":["intraoperative autoreinfusion (術中自己血輸血)","postoperative autoreinfusion (術後自己血輸血)","cell saver autoreinfusion (セルセーバー自己血輸血)"],"synonyms":["autotransfusion","blood salvage"],"antonyms":["allogeneic transfusion","homologous transfusion"]}],"etymology":{"value":"'auto-' (self) + 're-' (again) + 'infusion' (the process of introducing a liquid into the body).","priority":"★★★"},"pronunciation":{"ipa":"ˌɔːtoʊriːɪnˈfjuːʒən","syllables":"au-to-re-in-fu-sion"},"inflection":{"noun_plural":"autoreinfusions"},"usage_notes":{"explanation":"Autoreinfusion is a medical procedure where a patient receives their own blood back during or after surgery. This reduces the risk of complications associated with transfusions from other donors. It is also known as autotransfusion or blood salvage.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Autoreinfusion is when you give someone else's blood.","correct":"✓ Autoreinfusion is when you give someone your own blood back.","note":"Autoreinfusion involves using the patient's own blood, not someone else's."}],"priority":"★★☆"},"related_words":{"derivatives":["autotransfusion","cell saver"],"related_terms":["blood transfusion","hemoglobin","hematocrit","surgery","anemia"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Autoreinfusion is a medical term referring to the process of reintroducing a patient's own blood back into their system, usually during or after surgery. This technique is used to minimize the need for donor blood and reduce the risks associated with transfusions. It's a specialized term primarily encountered in medical settings."},"example_sentences":[{"sentence":"The surgeon recommended autoreinfusion to minimize the risk of infection.","translation":"外科医は感染のリスクを最小限に抑えるために自己血輸血を推奨しました。","type":"noun","meaning_category":"medical procedure"},{"sentence":"Autoreinfusion can significantly reduce the need for donor blood during major surgeries.","translation":"自己血輸血は、大手術中のドナー血液の必要性を大幅に減らすことができます。","type":"noun","meaning_category":"medical procedure"}]}