{"word":"fat-susceptible","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"脂肪の影響を受けやすい、脂肪によって状態が左右されやすい","english_definition":"Easily affected or influenced by fat, especially in terms of health or physical condition.","examples":[{"sentence":"This breed of dog is fat-susceptible and requires a carefully controlled diet.","translation":"この犬種は脂肪の影響を受けやすく、注意深く管理された食事が必要です。"},{"sentence":"Individuals with certain genetic predispositions may be more fat-susceptible than others.","translation":"特定の遺伝的素因を持つ人は、他の人よりも脂肪の影響を受けやすい可能性があります。"},{"sentence":"The study examined how different diets affected fat-susceptible mice.","translation":"その研究では、異なる食事が脂肪の影響を受けやすいマウスにどのように影響するかを調べました。"}],"collocations":["fat-susceptible breed","fat-susceptible individuals","fat-susceptible mice","fat-susceptible population","fat-susceptible genes"],"synonyms":["prone to fat accumulation","easily affected by dietary fat","sensitive to fat intake"],"antonyms":["fat-resistant","fat-tolerant","fat-insensitive"]},{"part_of_speech":"adjective","definition":"（比喩的に）贅肉がつきやすい、無駄や非効率が入り込みやすい","english_definition":"(Figuratively) Prone to accumulating excess or inefficiency, similar to gaining physical fat.","examples":[{"sentence":"The bureaucracy became fat-susceptible after years of unchecked growth.","translation":"その官僚機構は、長年の抑制されない成長の後、贅肉がつきやすくなった。"},{"sentence":"The project's budget was fat-susceptible, requiring constant monitoring to prevent overspending.","translation":"そのプロジェクトの予算は無駄が入り込みやすく、予算超過を防ぐために常に監視が必要だった。"}],"collocations":["fat-susceptible bureaucracy","fat-susceptible budget","fat-susceptible organization","fat-susceptible system"],"synonyms":["inefficient","bloated","unwieldy","prone to excess"],"antonyms":["lean","efficient","streamlined"]}],"etymology":{"value":"A compound word formed by combining 'fat' (referring to adipose tissue or dietary fat) and 'susceptible' (meaning likely to be affected by).","priority":"N/A"},"pronunciation":{"ipa":"/ˈfæt səsˈɛptəbəl/","syllables":"fat-sus-cep-ti-ble"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be modified by adverbs (e.g., very fat-susceptible)."},"usage_notes":{"explanation":"'Fat-susceptible' is often used in scientific or medical contexts to describe organisms or individuals that are particularly prone to developing health problems related to fat intake or accumulation. It can also be used metaphorically to describe systems or organizations that are prone to inefficiency or excess.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The fat-susceptible person ate a lot of fat.","correct":"The fat-susceptible person should avoid eating a lot of fat.","note":"It's important to understand that 'fat-susceptible' describes a predisposition, not a behavior. The sentence should reflect awareness of this predisposition."}],"priority":"N/A"},"related_words":{"derivatives":["susceptibility (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. Primarily used in scientific and medical literature.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Fat-susceptible' is a technical term often used in scientific or medical contexts. It describes a predisposition to being negatively affected by fat, either in terms of health or, metaphorically, in terms of efficiency and leanness. Understanding the term requires familiarity with scientific vocabulary and the concept of predisposition."},"example_sentences":[{"sentence":"The researchers identified several genes associated with being fat-susceptible.","translation":"研究者たちは、脂肪の影響を受けやすいことに関連するいくつかの遺伝子を特定しました。","type":"adjective","meaning_category":"prone to fat accumulation"},{"sentence":"The new management team aimed to make the company less fat-susceptible by cutting unnecessary expenses.","translation":"新しい経営陣は、不必要な経費を削減することで、会社を贅肉がつきにくいようにすることを目指しました。","type":"adjective","meaning_category":"prone to excess"}]}