{"word":"Lebanese","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"レバノンの、レバノン人の、レバノン産の","english_definition":"relating to Lebanon, its people, or its language.","examples":[{"sentence":"Lebanese cuisine is famous for its fresh ingredients and flavorful spices.","translation":"レバノン料理は、新鮮な食材と風味豊かなスパイスで有名です。"},{"sentence":"She is a Lebanese citizen.","translation":"彼女はレバノン国民です。"},{"sentence":"We visited a Lebanese restaurant last night.","translation":"私たちは昨夜、レバノン料理店に行きました。"}],"collocations":["Lebanese food","Lebanese people","Lebanese culture","Lebanese government","Lebanese cedar"],"synonyms":["of Lebanon","from Lebanon"],"antonyms":[]},{"part_of_speech":"noun","definition":"レバノン人（男女問わず）","english_definition":"a person from Lebanon.","examples":[{"sentence":"He is a Lebanese who immigrated to the United States.","translation":"彼はアメリカに移住したレバノン人です。"},{"sentence":"Many Lebanese live abroad due to the country's political instability.","translation":"国の政治的な不安定さのため、多くのレバノン人が海外に住んでいます。"}],"collocations":["a Lebanese man","a Lebanese woman","Lebanese immigrants","Lebanese diaspora"],"synonyms":["person from Lebanon","citizen of Lebanon"],"antonyms":[]},{"part_of_speech":"noun","definition":"レバノン・アラビア語","english_definition":"the variety of Arabic spoken in Lebanon.","examples":[{"sentence":"Lebanese is a dialect of Arabic that includes many French and Aramaic loanwords.","translation":"レバノン・アラビア語は、フランス語やアラム語からの借用語を多く含むアラビア語の方言です。"},{"sentence":"She is fluent in both standard Arabic and Lebanese.","translation":"彼女は標準アラビア語とレバノン・アラビア語の両方を流暢に話します。"}],"collocations":["speak Lebanese","Lebanese dialect","Lebanese Arabic"],"synonyms":["Lebanese Arabic","Lebanese dialect of Arabic"],"antonyms":[]}],"etymology":{"value":"Derived from 'Lebanon,' the name of the country, with the suffix '-ese' indicating origin or affiliation. 'Lebanon' itself comes from the Semitic root 'LBN,' meaning 'white,' referring to the snow-capped mountains.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌlɛbəˈniːz/","syllables":"Le-ba-nese"},"inflection":{"noun_plural":"Lebanese (the plural form is the same as the singular)","notes":"As a noun referring to people, 'Lebanese' is invariable in the plural. As an adjective, it does not inflect."},"usage_notes":{"explanation":"'Lebanese' can function as both an adjective and a noun. As an adjective, it describes something related to Lebanon. As a noun, it refers to a person or people from Lebanon. When referring to the language, it specifically means the Lebanese dialect of Arabic.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I met a Lebanese person.","correct":"✓ I met a Lebanese.","note":"While 'Lebanese person' is grammatically correct, it's more common and natural to simply say 'Lebanese' when referring to a person from Lebanon."},{"incorrect":"✗ The Lebanese language is very different from Arabic.","correct":"✓ The Lebanese dialect is very different from standard Arabic.","note":"Lebanese is a dialect of Arabic, not a separate language. It's more accurate to refer to it as the Lebanese dialect of Arabic."}],"priority":"★★☆"},"related_words":{"derivatives":["Lebanon (noun: the country)","Lebanese American (noun: a person of Lebanese descent who is an American citizen)","Lebanese Canadian (noun: a person of Lebanese descent who is a Canadian citizen)"],"phrases":["Lebanese cuisine (Lebanese food)","Lebanese cedar (a type of cedar tree native to Lebanon)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B1","frequency_google_ngram":"Relatively frequent, especially in contexts related to food, culture, and current events.","priority":"★☆☆"},"readability_explanation":{"level":"B1","text":"'Lebanese' is a word used to describe things that come from or are related to the country of Lebanon. It can be used as an adjective, like in 'Lebanese food,' or as a noun to refer to a person from Lebanon, like 'He is Lebanese.' It's also used to refer to the specific type of Arabic spoken in Lebanon, which is called Lebanese Arabic or the Lebanese dialect. It's not a super common word, but you'll hear it when people are talking about Lebanon or things from Lebanon."},"example_sentences":[{"sentence":"The **Lebanese** restaurant served delicious hummus.","translation":"そのレバノン料理店では美味しいフムスが出された。","type":"adjective","meaning_category":"レバノン産の"},{"sentence":"She is a proud **Lebanese** who loves her country.","translation":"彼女は自分の国を愛する誇り高きレバノン人です。","type":"noun","meaning_category":"レバノン人"},{"sentence":"Many **Lebanese** have emigrated to other countries seeking better opportunities.","translation":"より良い機会を求めて、多くのレバノン人が他国へ移住しました。","type":"noun","meaning_category":"レバノン人"},{"sentence":"He is learning **Lebanese** so he can communicate with his relatives.","translation":"彼は親戚とコミュニケーションを取れるようにレバノン・アラビア語を学んでいます。","type":"noun","meaning_category":"レバノン・アラビア語"}]}