{"word":"unmatronlike","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"婦人らしくない、既婚女性らしくない","english_definition":"Not behaving or appearing in a manner expected of a matron or married woman; lacking the qualities or characteristics typically associated with a matron.","examples":[{"sentence":"Her youthful energy and unconventional style gave her an unmatronlike appearance.","translation":"彼女の若々しいエネルギーと型破りなスタイルは、彼女に婦人らしくない外見を与えた。"},{"sentence":"Some considered her outspoken opinions and independent spirit to be unmatronlike.","translation":"彼女の率直な意見と独立心は、婦人らしくないと考える人もいた。"}],"collocations":["unmatronlike behavior","unmatronlike appearance","unmatronlike conduct","unmatronlike manner"],"synonyms":["unconventional","unladylike","unconventional","youthful","spirited","independent"],"antonyms":["matronly","conventional","ladylike","dignified","reserved"]}],"etymology":{"value":"Prefix 'un-' (not) + 'matronlike' (resembling or befitting a matron). 'Matron' comes from the Latin 'matrona,' meaning a married woman, especially one of dignity and social standing.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˈmeɪtrənlaɪk/","syllables":"un-ma-tron-like"},"inflection":{"adjective_forms":{"comparative":"more unmatronlike","superlative":"most unmatronlike"}},"usage_notes":{"explanation":"'Unmatronlike' is used to describe someone, typically a married woman, whose behavior, appearance, or characteristics do not conform to the traditional expectations associated with a matron. It often implies a deviation from conventional norms of decorum, dignity, or restraint. The term can sometimes carry a slightly negative connotation, suggesting that the person is not behaving in a way considered appropriate for their age or marital status, but it can also be used in a neutral or even positive way to describe someone who is youthful, spirited, or unconventional.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She acted very unmatronlike at the party.","correct":"✓ She behaved in an unmatronlike manner at the party.","note":"The phrase 'in an unmatronlike manner' is often used to modify the verb 'behave' or 'act.' Alternatively, one could say, 'She had unmatronlike behavior at the party.'"},{"incorrect":"✗ The dress was unmatronlike for her age.","correct":"✓ The dress was unmatronlike, considering her age.","note":"It is more precise to say 'unmatronlike, considering her age' or 'unmatronlike for someone of her age' to clarify the contrast with expected norms."}],"priority":"★☆☆"},"related_words":{"derivatives":["matron (noun)","matronly (adjective)","matronliness (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (rare, specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unmatronlike' is a relatively uncommon word used to describe someone, usually a married woman, who does not behave or appear in a way that is traditionally expected of a matron. It suggests a deviation from conventional norms of behavior, appearance, or demeanor associated with older, married women. Understanding the word requires familiarity with the concept of a 'matron' and the qualities traditionally associated with that role. The word is often used in contexts where social expectations and gender roles are being discussed or challenged."},"example_sentences":[{"sentence":"Her decision to wear a bright, modern dress to the formal event was considered unmatronlike by some of the older guests.","translation":"彼女がフォーマルなイベントに明るくモダンなドレスを着るという決断は、年配のゲストの中には婦人らしくないと考える人もいた。","type":"general","meaning_category":"general"},{"sentence":"Despite being a grandmother, her unmatronlike enthusiasm for adventure kept her young at heart.","translation":"祖母であるにもかかわらず、彼女の冒険に対する婦人らしくない熱意は、彼女の心を若く保った。","type":"general","meaning_category":"general"}]}