{"word":"subpyramidic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Nearly pyramid-shaped; somewhat resembling a pyramid.","english_definition":"Having a shape that is somewhat like a pyramid, but not perfectly so.","examples":[{"sentence":"The crystal structure was described as subpyramidic due to its slightly distorted pyramidal form.","translation":"その結晶構造は、わずかに歪んだピラミッド形のため、亜ピラミッド形と記述された。"},{"sentence":"The hills in the region have a subpyramidic appearance, worn down by centuries of erosion.","translation":"その地域の丘は、何世紀にもわたる浸食によって摩耗し、亜ピラミッドのような外観を呈している。"}],"collocations":["subpyramidic crystal","subpyramidic hill","subpyramidic shape","subpyramidic structure"],"synonyms":["pyramid-like","pyramidal","conical","tapering"],"antonyms":["spherical","cuboid","cylindrical"]}],"etymology":{"value":"The word 'subpyramidic' is formed by combining the prefix 'sub-' (meaning 'under' or 'nearly') with 'pyramidic' (meaning 'pyramid-shaped').","priority":"★★★"},"pronunciation":{"ipa":"/sʌbˌpɪrəˈmɪdɪk/","syllables":"sub-pi-ra-mid-ic"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. It can also be used in comparative and superlative forms (more subpyramidic, most subpyramidic), though these are rare."},"usage_notes":{"explanation":"'Subpyramidic' is a descriptive term used in geology, mineralogy, and sometimes in architecture or design. It indicates that something has a shape that approximates a pyramid, but lacks the precise characteristics of a true pyramid. The 'sub-' prefix suggests a degree of approximation or incompleteness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building was subpyramidic, therefore it was a perfect pyramid.","correct":"✓ The building was subpyramidic, meaning it resembled a pyramid but wasn't perfectly so.","note":"'Subpyramidic' implies an imperfect or approximate pyramidal shape, not a perfect one."}],"priority":"★☆☆"},"related_words":{"derivatives":["subpyramid (noun, a structure or object that is nearly pyramid-shaped)"],"related_terms":["pyramid","pyramidal","tetrahedral","conical"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'subpyramidic' is a technical term used to describe shapes that are similar to, but not exactly, pyramids. It's usually found in scientific or technical contexts, such as geology or crystallography, where precise descriptions of shapes are important. The prefix 'sub-' indicates 'less than' or 'almost,' so 'subpyramidic' means 'almost pyramid-shaped.'"},"example_sentences":[{"sentence":"The eroded mountain had a distinct, yet subpyramidic, profile.","translation":"浸食された山は、独特でありながら、亜ピラミッド形の輪郭をしていた。","type":"adjective","meaning_category":"shape"},{"sentence":"The mineral sample exhibited a subpyramidic habit, with slightly rounded edges.","translation":"その鉱物サンプルは、わずかに丸みを帯びたエッジを持つ、亜ピラミッド形の晶癖を示した。","type":"adjective","meaning_category":"mineralogy"}]}