{"word":"orthogamy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"配偶者選択における、遺伝的または社会的類似性に基づく選択。特に、遺伝的疾患のリスクを減らすために、遺伝的に異なる配偶者を選ぶこと。","english_definition":"The selection of a mate based on genetic or social dissimilarity, especially to reduce the risk of genetic disorders by choosing a genetically different partner.","examples":[{"sentence":"Orthogamy is a strategy to avoid inbreeding and increase genetic diversity in offspring.","translation":"直交配偶は、近親交配を避け、子孫の遺伝的多様性を高めるための戦略である。"},{"sentence":"Some cultures practice orthogamy by encouraging marriage outside of the immediate family or clan.","translation":"一部の文化では、近親者や氏族外での結婚を奨励することにより、直交配偶を実践している。"},{"sentence":"Genetic counseling can help individuals understand the principles of orthogamy and make informed decisions about mate selection.","translation":"遺伝カウンセリングは、個人が直交配偶の原則を理解し、配偶者選択について情報に基づいた決定を下すのに役立つ。"}],"collocations":["practice orthogamy (直交配偶を実践する)","promote orthogamy (直交配偶を促進する)","genetic orthogamy (遺伝的直交配偶)","social orthogamy (社会的直交配偶)"],"synonyms":["outbreeding","exogamy","assortative mating (negative)"],"antonyms":["endogamy","inbreeding","assortative mating (positive)"]}],"etymology":{"value":"ギリシャ語の「orthos」（正しい、まっすぐな）と「gamos」（結婚）に由来する。遺伝的に「正しい」配偶者を選ぶという意味合いから。","priority":"★★☆"},"pronunciation":{"ipa":"ɔːrˈθɒɡəmi","syllables":"or-thog-a-my"},"inflection":{"noun_plural":"orthogamies"},"usage_notes":{"explanation":"「**orthogamy**」は、生物学、遺伝学、社会学の分野で使われる専門用語です。配偶者を選ぶ際に、遺伝的または社会的な類似性ではなく、むしろ違いを重視する戦略を指します。これは、近親交配による遺伝的疾患のリスクを減らしたり、集団の遺伝的多様性を高めたりすることを目的としています。社会的な文脈では、異なる社会階層や民族グループからの結婚を奨励することも含まれます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Orthogamy is when you marry someone who is very similar to you.","correct":"✓ Orthogamy is when you marry someone who is very different from you.","note":"Orthogamyは類似性ではなく、相違性に基づいて配偶者を選ぶことです。"},{"incorrect":"✗ Orthogamy is only about avoiding genetic diseases.","correct":"✓ Orthogamy is about avoiding genetic diseases and increasing genetic diversity.","note":"遺伝的疾患のリスクを減らすだけでなく、遺伝的多様性を高めることも目的です。"}],"priority":"★★☆"},"related_words":{"derivatives":["orthogamous (形容詞: 直交配偶の)"],"related_concepts":["assortative mating (配偶者選択)","genetic diversity (遺伝的多様性)","inbreeding depression (近交弱勢)","exogamy (族外婚)","endogamy (族内婚)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門的な文脈でのみ使用される)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**orthogamy**」は、遺伝学や社会学で使われる専門的な言葉で、配偶者を選ぶときに、自分と似た人ではなく、遺伝的または社会的に異なる人を選ぶことを意味します。これは、近親婚を避けて、子孫の遺伝的な多様性を高めるためです。この言葉は、日常会話ではほとんど使われません。"},"example_sentences":[{"sentence":"The study examined the prevalence of orthogamy in different human populations.","translation":"その研究では、さまざまな人類集団における直交配偶の普及率を調査した。","type":"general","meaning_category":"配偶者選択"},{"sentence":"Orthogamy can lead to increased heterozygosity in offspring.","translation":"直交配偶は、子孫におけるヘテロ接合性の増加につながる可能性がある。","type":"genetic","meaning_category":"遺伝的影響"},{"sentence":"Social orthogamy may promote integration between different social groups.","translation":"社会的直交配偶は、異なる社会集団間の統合を促進する可能性がある。","type":"social","meaning_category":"社会的影響"}]}