{"word":"subscheme","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"下位計画、副計画","english_definition":"A scheme that is part of a larger scheme; a subsidiary or subordinate scheme.","examples":[{"sentence":"The project was divided into several subschemes for better management.","translation":"プロジェクトは、より良い管理のためにいくつかの下位計画に分割されました。"},{"sentence":"This subscheme addresses the specific needs of rural communities.","translation":"この副計画は、農村コミュニティの特定のニーズに対応しています。"}],"collocations":["implement a subscheme (下位計画を実行する)","develop a subscheme (下位計画を開発する)","integrate subschemes (下位計画を統合する)","funding for subschemes (下位計画への資金提供)"],"synonyms":["subprogram","subsection","component scheme","subsidiary plan"],"antonyms":["main scheme","overarching plan"]}],"etymology":{"value":"The word 'subscheme' is formed by combining the prefix 'sub-' (meaning under, below, or subordinate) with the noun 'scheme' (meaning a plan or arrangement).","priority":"★★★"},"pronunciation":{"ipa":"/ˈsʌbskiːm/","syllables":"sub-scheme"},"inflection":{"noun_plural":"subschemes"},"usage_notes":{"explanation":"'Subscheme' is typically used in contexts where a larger, more complex plan or project is broken down into smaller, more manageable parts. Each subscheme represents a specific aspect or component of the overall plan. It is often used in project management, urban planning, and government initiatives.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The subscheme is the same as the main scheme.","correct":"✓ The subscheme is a part of the main scheme.","note":"A subscheme is always a part of, and subordinate to, the main scheme."},{"incorrect":"✗ We need to subscheme the project.","correct":"✓ We need to divide the project into subschemes.","note":"'Subscheme' is primarily a noun. To express the action of dividing into subschemes, use a phrase like 'divide into subschemes'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_concepts":["project management","urban planning","government programs","subsidiary","component","hierarchy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'subscheme' is a relatively specialized term, primarily used in contexts involving complex planning or project management. It indicates a smaller, more specific plan that is part of a larger, overarching scheme. Understanding this term requires familiarity with the general concept of 'schemes' and the function of the prefix 'sub-'. Due to its specific usage, it is more commonly encountered in professional or academic settings.","priority":"★★☆"},"example_sentences":[{"sentence":"The government launched a new subscheme to support small businesses.","translation":"政府は中小企業を支援するための新しい下位計画を開始しました。","type":"general","meaning_category":"下位計画"},{"sentence":"Each subscheme has its own budget and timeline.","translation":"各下位計画には、独自の予算とタイムラインがあります。","type":"general","meaning_category":"下位計画"},{"sentence":"The success of the overall project depends on the effective implementation of each subscheme.","translation":"プロジェクト全体の成功は、各下位計画の効果的な実施にかかっています。","type":"general","meaning_category":"下位計画"}]}