{"word":"Unobjectivized","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Not treated as an object; not having been subjected to objectification.","english_definition":"Not having been turned into or regarded as an object, especially for sexual or commercial purposes.","examples":[{"sentence":"The artist sought to portray the model in an unobjectivized manner, focusing on her inner strength rather than her physical appearance.","translation":"そのアーティストは、モデルを客観視せずに、彼女の外面的な美しさよりも内面の強さに焦点を当てて描こうとした。"},{"sentence":"The goal of the campaign is to ensure that women are seen as individuals with agency, not as unobjectivized bodies.","translation":"そのキャンペーンの目的は、女性が客観視された身体としてではなく、主体性を持った個人として見られるようにすることである。"}],"collocations":["unobjectivized portrayal","unobjectivized representation","unobjectivized perspective","unobjectivized view"],"synonyms":["de-objectified","humanized","personalized","individualized"],"antonyms":["objectified","commodified","sexualized","instrumentalized"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to the past participle 'objectivized' of the verb 'objectivize'. 'Objectivize' itself is derived from 'objective', referring to treating something as an object.","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnəbˈdʒɛktɪvaɪzd/","syllables":"un-ob-jec-ti-vized"},"inflection":{"adjective_forms":{}},"usage_notes":{"explanation":"'Unobjectivized' is used to describe something or someone that has not been subjected to objectification, which is the act of treating a person or thing as an object, often disregarding their inherent worth or individuality. It is frequently used in discussions about feminism, media representation, and ethics. The term emphasizes the importance of recognizing the intrinsic value and agency of individuals, rather than reducing them to mere objects of desire or utility.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unobjectivized data was used for the analysis.","correct":"✓ The objective data was used for the analysis.","note":"'Unobjectivized' refers to people or things not being treated as objects, whereas 'objective' refers to unbiased data or analysis. Using 'objective' is more appropriate in the context of data analysis."},{"incorrect":"✗ She felt unobjectivized by the compliment.","correct":"✓ She felt objectified by the compliment.","note":"'Unobjectivized' means not treated as an object, so feeling 'unobjectivized' doesn't make sense. If someone feels like a compliment reduced them to an object, they would feel 'objectified'."}],"priority":"★★☆"},"related_words":{"derivatives":["objectify","objectification","subjective","objective"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unobjectivized' is a complex term used to describe something that has not been treated as a mere object, particularly in contexts where people are reduced to their physical attributes or utility. It's often used in discussions about social justice, media representation, and ethical treatment of individuals. Understanding this word requires a grasp of the concept of objectification and the implications of treating someone as an object rather than a person with inherent worth and agency. The prefix 'un-' indicates the negation of objectification, making it clear that the subject is being viewed or treated in a way that respects their individuality and humanity."},"example_sentences":[{"sentence":"The photographer aimed to capture the unobjectivized beauty of the landscape, focusing on its natural forms and textures.","translation":"その写真家は、風景の自然な形と質感に焦点を当てて、客観視されていない美しさを捉えることを目指した。","type":"adjective","meaning_category":"Not treated as an object"},{"sentence":"The film received praise for its unobjectivized portrayal of female characters, showing them as complex individuals with their own goals and desires.","translation":"その映画は、女性キャラクターを客観視せずに、独自の目標と願望を持つ複雑な個人として描いたことで賞賛された。","type":"adjective","meaning_category":"Not treated as an object"}]}