{"word":"euphenics","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"表現型改善学、優生改善学：遺伝子疾患を持つ個人の表現型を改善するための医学的または環境的な介入の研究","english_definition":"The study of improving the phenotype of individuals with genetic disorders through medical or environmental interventions.","examples":[{"sentence":"Euphenics aims to improve the quality of life for individuals affected by genetic diseases.","translation":"表現型改善学は、遺伝性疾患に苦しむ人々の生活の質を向上させることを目的としています。"},{"sentence":"Gene therapy and dietary adjustments are examples of euphenic approaches.","translation":"遺伝子治療と食事療法は、表現型改善学的なアプローチの例です。"}],"collocations":["euphenic treatment (表現型改善治療)","euphenic approach (表現型改善アプローチ)","euphenic intervention (表現型改善介入)"],"synonyms":["phenotype modification","genetic amelioration"],"antonyms":["eugenics (優生学) - 遺伝子プール全体の改善を目指すのに対し、euphenics は個人の表現型改善に焦点を当てる"],"notes":"Euphenics is often contrasted with eugenics, which aims to improve the genetic quality of a population as a whole. Euphenics focuses on improving the lives of individuals already affected by genetic disorders.","related_terms":["gene therapy (遺伝子治療)","pharmacogenomics (薬理遺伝学)","personalized medicine (個別化医療)"]}],"etymology":{"value":"Derived from the Greek words 'eu' (meaning 'good' or 'well') and 'phenos' (meaning 'appearance' or 'observable trait'), combined with the suffix '-ics' (denoting a field of study).","priority":"★★☆"},"pronunciation":{"ipa":"/juːˈfɛnɪks/","syllables":"eu-phen-ics"},"inflection":{"noun_plural":"N/A (usually used as a singular noun)"},"usage_notes":{"explanation":"Euphenics is a relatively specialized term within the fields of genetics and medicine. It refers specifically to interventions aimed at improving the expressed traits (phenotype) of individuals with genetic disorders, rather than altering the underlying genes themselves (as in gene therapy, which can also be considered a form of euphenics in some contexts). The term is not widely used in general conversation.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Euphenics is about changing genes to create 'perfect' humans.","correct":"✓ Euphenics is about improving the lives of people with genetic disorders through medical treatments and environmental changes.","note":"Euphenics focuses on improving the phenotype (observable traits) of individuals with existing genetic disorders, not on creating 'perfect' humans or altering the germline. It is distinct from eugenics."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_concepts":["eugenics (優生学)","gene therapy (遺伝子治療)","genetics (遺伝学)","phenotype (表現型)","genotype (遺伝子型)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very specialized term)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Euphenics' is a highly specialized term used in genetics and medicine. It describes the field focused on improving the observable characteristics (phenotype) of individuals who have genetic disorders. This is done through medical treatments or changes to the environment. It's important to understand that euphenics doesn't aim to change the genes themselves, but rather to manage or lessen the effects of those genes. It's often compared to 'eugenics,' but they are different. Eugenics aims to improve the genetic makeup of an entire population, while euphenics helps individuals who already have genetic issues."},"example_sentences":[{"sentence":"Through euphenics, individuals with phenylketonuria (PKU) can manage their condition with a special diet.","translation":"表現型改善学を通して、フェニルケトン尿症（PKU）の個人は特別な食事療法で症状を管理することができます。","type":"general","meaning_category":"Medical intervention"},{"sentence":"Researchers are exploring new euphenic strategies to mitigate the effects of Down syndrome.","translation":"研究者たちは、ダウン症候群の影響を軽減するための新しい表現型改善戦略を模索しています。","type":"research","meaning_category":"Research and development"}]}