{"word":"Ingaevonic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Ingvaeonic（言語学用語）","english_definition":"Relating to or denoting the West Germanic languages spoken by the Ingvaeones.","examples":[{"sentence":"Ingaevonic languages are also known as North Sea Germanic languages.","translation":"Ingaevonic言語は、北海ゲルマン語としても知られています。"}],"collocations":[],"synonyms":["North Sea Germanic"],"antonyms":[]},{"part_of_speech":"noun","definition":"Ingvaeonic語（言語学用語）","english_definition":"The Ingvaeonic group of West Germanic languages.","examples":[{"sentence":"Ingaevonic includes Old English, Old Frisian, and Old Saxon.","translation":"Ingaevonicには、古英語、古フリジア語、古ザクセン語が含まれます。"}],"collocations":[],"synonyms":["North Sea Germanic languages"],"antonyms":[]}],"etymology":{"value":"Named after the Ingvaeones, a West Germanic tribal confederation.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪŋɡiːˈɒnɪk/","syllables":"In-gee-o-nic"},"inflection":{},"usage_notes":{"explanation":"'Ingaevonic' is a term used in historical linguistics to classify a group of West Germanic languages that share certain features. It is often used synonymously with 'North Sea Germanic'.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["Ingvaeones"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term 'Ingaevonic' is primarily used in academic contexts related to historical linguistics and the study of Germanic languages. It refers to a specific subgroup within the West Germanic language family. Understanding this term requires familiarity with linguistic classifications and historical Germanic tribal groups."},"example_sentences":[{"sentence":"The development of the umlaut in Ingaevonic languages differs from that in other Germanic languages.","translation":"Ingaevonic言語におけるウムラウトの発展は、他のゲルマン語におけるそれとは異なります。","type":"adjective","meaning_category":"Relating to Ingvaeonic languages."},{"sentence":"The study of Ingaevonic provides insights into the early linguistic landscape of the North Sea region.","translation":"Ingaevonicの研究は、北海地域の初期の言語状況に関する洞察を提供します。","type":"noun","meaning_category":"The Ingaevonic group of languages."}]}