{"word":"goat-kneed","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(人について)膝が前に突き出ている、または膝が内側に曲がっている","english_definition":"(of a person) having knees that project forward or bend inward.","examples":[{"sentence":"The old man was goat-kneed and walked with a shuffle.","translation":"その老人は膝が前に突き出ていて、足を引きずって歩いた。"},{"sentence":"The athlete's goat-kneed stance made it difficult for her to run efficiently.","translation":"その運動選手の膝が内側に曲がった姿勢は、効率的に走ることを困難にした。"}],"collocations":["goat-kneed stance (膝が突き出た姿勢)","goat-kneed gait (膝が突き出た歩き方)"],"synonyms":["knock-kneed","bow-legged","bandy-legged"],"antonyms":["straight-legged"],"notes":"This term is often used descriptively and can sometimes be considered derogatory depending on the context."}],"etymology":{"value":"The term \"goat-kneed\" likely derives from the observation that goats often have a distinctive bend in their knees. It's a descriptive term based on a physical characteristic.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡoʊtˌniːd/","syllables":"goat-kneed"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can form comparative and superlative forms (more goat-kneed, most goat-kneed)."},"usage_notes":{"explanation":"\"Goat-kneed\" is a descriptive term for a physical characteristic, specifically the appearance of the knees. It's not a commonly used term and may be unfamiliar to many people. It can be considered impolite or offensive depending on the context and how it's used.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was goat-kneed because he played soccer.","correct":"✓ He was goat-kneed, which made it difficult to play soccer.","note":"The term describes a physical characteristic, not necessarily a cause. The first sentence implies that playing soccer caused the condition, which may not be accurate."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["knock-kneed","bow-legged","bandy-legged"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not commonly found in standard CEFR vocabulary lists.)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"goat-kneed\" is specialized and not commonly used, making it suitable for advanced learners or those with a specific interest in descriptive language. Understanding requires familiarity with figurative language and potentially an understanding of animal anatomy for comparison.","priority":"★☆☆"},"example_sentences":[{"sentence":"The old cowboy had a distinctive, goat-kneed walk.","translation":"その年老いたカウボーイは特徴的な、膝が突き出た歩き方をしていた。","type":"adjective","meaning_category":"Descriptive"},{"sentence":"Her goat-kneed posture was a result of a childhood injury.","translation":"彼女の膝が突き出た姿勢は、子供の頃の怪我の結果だった。","type":"adjective","meaning_category":"Descriptive"}]}