{"word":"gameplay-driven","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ゲームプレイ主導の、ゲームプレイ重視の","english_definition":"(of a video game) designed with the gameplay mechanics as the primary focus, rather than the narrative, graphics, or other elements.","examples":[{"sentence":"This is a gameplay-driven title that prioritizes fun over story.","translation":"これはストーリーよりも楽しさを重視した、ゲームプレイ主導のタイトルです。"},{"sentence":"The developers wanted to create a gameplay-driven experience that would keep players engaged for hours.","translation":"開発者たちは、プレイヤーを何時間も夢中にさせるような、ゲームプレイ重視の体験を作りたかったのです。"}],"collocations":["gameplay-driven design (ゲームプレイ主導のデザイン)","gameplay-driven experience (ゲームプレイ主導の体験)","gameplay-driven mechanics (ゲームプレイ主導のメカニクス)"],"synonyms":["mechanics-focused","game-centric","action-oriented"],"antonyms":["narrative-driven","story-focused","cinematic"],"notes":"Often used to describe video games where the core mechanics and player interaction are more important than the plot or visual presentation."}],"etymology":{"value":"Combination of 'gameplay' (the way a game is played) and 'driven' (propelled or motivated by something).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˈɡeɪmpleɪ ˌdrɪvn/","syllables":"game-play-dri-ven"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"'Gameplay-driven' describes a game where the primary focus is on the mechanics and how the player interacts with the game world. These games often have simple or minimal stories, prioritizing player agency and engaging mechanics.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The game was very drive by gameplay.","correct":"✓ The game was very gameplay-driven.","note":"Use the correct compound adjective form."}],"priority":"☆☆☆"},"related_words":{"derivatives":["gameplay (noun)","driven (adjective)"],"related_concepts":["game mechanics","player agency","core loop"]},"level_frequency":{"frequency_google_ngram":"Relatively low frequency; primarily used in video game discussions and reviews.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'gameplay-driven' is a specialized term used within the context of video game design and criticism. It indicates a design philosophy where the interactive elements and mechanics of the game are prioritized over narrative or visual aspects. Understanding this term requires familiarity with video game terminology."},"example_sentences":[{"sentence":"The roguelike genre is known for being highly gameplay-driven.","translation":"ローグライクジャンルは、非常にゲームプレイ主導であることで知られています。","type":"general","meaning_category":"general"},{"sentence":"Many indie games are gameplay-driven due to limited resources for graphics and story.","translation":"多くのインディーゲームは、グラフィックやストーリーのためのリソースが限られているため、ゲームプレイ主導です。","type":"general","meaning_category":"general"}]}