{"word":"infusedly","priority":"★★☆","meanings":[{"part_of_speech":"adverb","definition":"注入されたように、しみ込んだように、染み渡るように","english_definition":"In an infused manner; permeated or saturated.","examples":[{"sentence":"The tea was infusedly flavored with herbs.","translation":"そのお茶はハーブの香りがしみ込むように風味付けされていた。"},{"sentence":"The room was infusedly lit by the soft glow of the candles.","translation":"部屋はろうそくの柔らかな光が染み渡るように照らされていた。"}],"collocations":["infusedly flavored","infusedly lit"],"synonyms":["permeatedly","saturatedly","imbuedly"],"antonyms":["superficially"]}],"etymology":{"value":"Derived from the word \"infused\" with the suffix \"-ly\". \"Infused\" comes from the Latin word \"infusus\", the past participle of \"infundere\" (to pour in).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪnˈfjuːzdli/","syllables":"in-fus-ed-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"The adverb \"infusedly\" describes an action or state that is thoroughly permeated or saturated, often with a particular quality or characteristic. It suggests a deep and thorough penetration or blending. It is not a commonly used word, and its usage tends to be more literary or descriptive.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The water was infusedly.","correct":"✓ The water was infused.","note":"\"Infused\" is an adjective, not an adverb. Use \"infused\" to describe the water itself, not how it is acting."},{"incorrect":"✗ She infusedly the water with lemon.","correct":"✓ She infused the water with lemon.","note":"\"Infuse\" is the verb. \"Infusedly\" is an adverb that describes how something is infused."}],"priority":"★★☆"},"related_words":{"derivatives":["infuse (verb)","infused (adjective)","infusion (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Infusedly' is an adverb that describes something done in a way that it's thoroughly permeated or saturated. It's not a common word and is more often found in descriptive or literary contexts. It's derived from 'infused', which means to soak something in liquid to extract its flavor or properties, or to fill something with a particular quality. 'Infusedly' describes the manner in which something is infused."},"example_sentences":[{"sentence":"The narrative was infusedly woven with elements of folklore and mythology.","translation":"物語は民話と神話の要素が染み渡るように織り込まれていた。","type":"adverb","meaning_category":"Permeated"},{"sentence":"The air was infusedly scented with the fragrance of blooming jasmine.","translation":"空気は咲き誇るジャスミンの香りが染み渡るように香っていた。","type":"adverb","meaning_category":"Saturated"}]}