{"word":"institution-centeredness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"機関中心主義、施設中心主義","english_definition":"The quality or state of being focused primarily on the needs, priorities, or perspectives of an institution (such as a school, hospital, or organization) rather than on the individuals or communities it serves.","examples":[{"sentence":"The report criticized the hospital for its institution-centeredness, arguing that patient care was often secondary to administrative concerns.","translation":"その報告書は、病院の機関中心主義を批判し、患者ケアがしばしば管理上の懸念事項よりも二の次になっていると主張した。"},{"sentence":"The school's institution-centeredness was evident in its rigid curriculum and lack of responsiveness to student needs.","translation":"その学校の施設中心主義は、硬直的なカリキュラムと学生のニーズへの対応の欠如に明らかだった。"},{"sentence":"A shift away from institution-centeredness is needed to create more effective and responsive social services.","translation":"より効果的で対応力のある社会サービスを創出するためには、機関中心主義からの脱却が必要である。"}],"collocations":["institution-centered approach","institution-centered care","overcome institution-centeredness","challenges of institution-centeredness"],"synonyms":["organizational focus","bureaucratic focus","system-centeredness"],"antonyms":["person-centeredness","patient-centeredness","community-centeredness","client-centeredness"]}],"etymology":{"value":"Formed by combining 'institution' (a established organization or corporation), 'centered' (focused on), and '-ness' (a suffix denoting a state or quality).","priority":"☆☆☆"},"pronunciation":{"ipa":null,"syllables":"in-sti-tu-tion-cen-tered-ness"},"inflection":{"notes":"This is a noun, so it primarily exists in singular form. A plural form is not typically used."},"usage_notes":{"explanation":"'Institution-centeredness' describes a situation where an organization's internal needs, procedures, and priorities take precedence over the needs and well-being of the people it is meant to serve. This can lead to inefficiencies, lack of responsiveness, and a disconnect between the institution and the community. It is often contrasted with approaches that prioritize the individual, such as person-centered or patient-centered care.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The institution-centeredness is good for the organization.","correct":"Reducing institution-centeredness is good for the organization's mission.","note":"While efficiency can be a byproduct, the term usually carries a negative connotation, implying a lack of focus on the people served."}],"priority":"☆☆☆"},"related_words":{"derivatives":["institution","centered","center","centralize"],"phrasal_verbs":[]},"level_frequency":{"CEFR":null,"frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Institution-centeredness' is a complex term used in fields like sociology, education, and healthcare to describe when an organization focuses more on its own needs than on the people it's supposed to help. It's often seen as a problem because it can lead to poor service and a lack of understanding of people's real needs. The opposite of this is putting people first, which is called 'person-centeredness' or 'patient-centeredness.'"},"example_sentences":[{"sentence":"The government's policies were criticized for their institution-centeredness, neglecting the needs of marginalized communities.","translation":"政府の政策は、疎外されたコミュニティのニーズを無視し、機関中心主義であると批判された。","type":"noun","meaning_category":"general"},{"sentence":"To improve student outcomes, the university needed to address its institution-centeredness and adopt a more student-focused approach.","translation":"学生の成果を向上させるためには、大学は機関中心主義に対処し、より学生に焦点を当てたアプローチを採用する必要があった。","type":"noun","meaning_category":"education"},{"sentence":"The healthcare system's institution-centeredness often resulted in fragmented and impersonal care for patients.","translation":"医療システムの機関中心主義は、しばしば患者に対する断片的で非人間的なケアをもたらした。","type":"noun","meaning_category":"healthcare"}]}