{"word":"shopkeeping","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"小売業、商店経営","english_definition":"The activity or business of owning or managing a shop or store.","examples":[{"sentence":"Shopkeeping is a challenging but rewarding profession.","translation":"小売業は大変だがやりがいのある職業です。"},{"sentence":"His family has a long tradition of shopkeeping.","translation":"彼の家族は商店経営の長い伝統があります。"}],"collocations":["run a shopkeeping business","go into shopkeeping","family shopkeeping tradition"],"synonyms":["retail","merchandising","store management","running a store"],"antonyms":["wholesale","manufacturing"]},{"part_of_speech":"adjective","definition":"小売業の、商店経営の","english_definition":"Relating to the business of owning or managing a shop or store.","examples":[{"sentence":"He inherited the shopkeeping skills from his father.","translation":"彼は父親から小売業のスキルを受け継いだ。"},{"sentence":"The town's economy relied heavily on shopkeeping activities.","translation":"その町の経済は小売業の活動に大きく依存していた。"}],"collocations":["shopkeeping skills","shopkeeping activities","shopkeeping experience"],"synonyms":["retail","mercantile","commercial"],"antonyms":["wholesale","industrial"]}],"etymology":{"value":"The word 'shopkeeping' is derived from the combination of 'shop' and 'keeping'. 'Shop' comes from Old English 'sceoppa', meaning a booth or shed. 'Keeping' refers to the act of managing or maintaining something.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈʃɒpˌkiːpɪŋ/","syllables":"shop-keep-ing"},"inflection":{"noun_plural":"shopkeepings (rarely used in plural)"},"usage_notes":{"explanation":"'Shopkeeping' refers to the general activity and business of running a retail store. It encompasses all aspects of managing a shop, including buying and selling goods, managing inventory, and dealing with customers. It is often used to describe a traditional or small-scale retail business, as opposed to larger corporate retail operations.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is good at shopkeep.","correct":"✓ He is good at shopkeeping.","note":"'Shopkeep' is not a standard word. Use 'shopkeeping' to refer to the activity or business."},{"incorrect":"✗ She has a shopkeeping in the town.","correct":"✓ She has a shopkeeping business in the town. / ✓ She runs a shop in the town.","note":"'Shopkeeping' is an activity or business, not a physical place. Use 'shopkeeping business' or 'runs a shop' to describe owning a store."}],"priority":"★★☆"},"related_words":{"derivatives":["shopkeeper (noun: a person who owns or manages a shop)","shop (noun: a place where goods are sold)","keep (verb: to manage, maintain, or operate)"],"phrasal_verbs":["N/A"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in specific contexts related to retail.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Shopkeeping' is a term used to describe the business and activities involved in running a retail store. It involves managing inventory, serving customers, and handling the day-to-day operations of a shop. While not a very common word, it is useful in contexts where you want to refer to the entire process of running a small retail business, especially one that is independently owned and operated. It is more formal than simply saying 'running a shop'."},"example_sentences":[{"sentence":"Successful shopkeeping requires a good understanding of customer needs.","translation":"成功する小売業には、顧客のニーズをよく理解することが必要です。","type":"noun","meaning_category":"小売業"},{"sentence":"The art of shopkeeping has changed significantly with the rise of online retail.","translation":"小売業の技術は、オンライン小売の台頭により大きく変化しました。","type":"noun","meaning_category":"小売業"},{"sentence":"His shopkeeping experience helped him start his own online store.","translation":"彼の小売業の経験は、彼自身のオンラインストアを始めるのに役立ちました。","type":"adjective","meaning_category":"小売業の"}]}