{"word":"protanopic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(人が)第一色盲の、赤色盲の","english_definition":"Relating to or affected by protanopia, a form of dichromatism in which red is perceived as grey or black, and there is difficulty distinguishing between blues and greens.","examples":[{"sentence":"A protanopic person has difficulty distinguishing between red and green.","translation":"第一色盲の人は赤と緑の区別が難しい。"},{"sentence":"He is protanopic, so he sees red as a dark shade.","translation":"彼は第一色盲なので、赤を暗い色合いとして認識する。"}],"collocations":["protanopic vision","protanopic color blindness","protanopic individual"],"synonyms":["red-blind","red-deficient"],"antonyms":["normal color vision","trichromatic vision"]},{"part_of_speech":"noun","definition":"第一色盲の人、赤色盲の人","english_definition":"A person affected by protanopia.","examples":[{"sentence":"The test identified him as a protanopic.","translation":"検査の結果、彼は第一色盲であることが判明した。"},{"sentence":"Protanopics often rely on context to identify colors.","translation":"第一色盲の人は、色を識別するために文脈に頼ることが多い。"}],"collocations":["diagnosed protanopic","protanopic patient","protanopic subject"],"synonyms":["red-blind person","red-deficient individual"],"antonyms":["person with normal color vision","trichromat"]}],"etymology":{"value":"From the Greek words 'protos' (first) + 'an-' (without) + 'ops' (eye), referring to the reduced sensitivity to the 'first' color, red.","priority":"★★★"},"pronunciation":{"ipa":"/ˌproʊtəˈnɒpɪk/","syllables":"pro-ta-no-pic"},"inflection":{"notes":"Adjective: protanopic; Noun: protanopic (person)"},"usage_notes":{"explanation":"'Protanopic' specifically refers to red-blindness, a type of dichromatism. It's important to distinguish it from other forms of color blindness, such as deuteranopia (green-blindness) and tritanopia (blue-yellow color blindness). The term can be used as both an adjective to describe the condition and as a noun to refer to a person with the condition.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is protanopia.","correct":"✓ He has protanopia. / ✓ He is protanopic.","note":"'Protanopia' is the condition itself (the noun), while 'protanopic' is the adjective describing someone affected by it."},{"incorrect":"✗ Protanopic is a type of blindness.","correct":"✓ Protanopia is a type of color blindness.","note":"Protanopia is a type of color blindness, not total blindness. People with protanopia still see colors, but their perception of red and other colors is altered."}],"priority":"★★☆"},"related_words":{"derivatives":["protanopia (noun: red-blindness)","dichromatism (noun: condition of having only two types of color receptors)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Protanopic' is a technical term used in the context of color vision deficiency, specifically red-blindness. Understanding this word requires knowledge of basic concepts in biology and visual perception. It is most likely encountered in scientific or medical contexts. The term is relatively rare in everyday conversation."},"example_sentences":[{"sentence":"The colorblind test is designed to identify individuals who are protanopic.","translation":"その色覚検査は、第一色盲の人を特定するように設計されている。","type":"adjective","meaning_category":"red-blind"},{"sentence":"As a protanopic, he relies on brightness cues to distinguish between certain colors.","translation":"第一色盲として、彼は特定の色を区別するために明るさの手がかりに頼っている。","type":"noun","meaning_category":"person with red-blindness"},{"sentence":"The artist's work was particularly challenging for protanopic viewers.","translation":"そのアーティストの作品は、特に第一色盲の鑑賞者にとって困難だった。","type":"adjective","meaning_category":"red-blind"}]}