{"word":"endonulear","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"核内の、核内部の","english_definition":"Located or occurring within the nucleus of a cell.","examples":[{"sentence":"The endonuclear proteins play a crucial role in DNA replication.","translation":"核内タンパク質はDNA複製において重要な役割を果たす。"},{"sentence":"Endonuclear structures are often studied using advanced microscopy techniques.","translation":"核内構造は、高度な顕微鏡技術を用いて研究されることが多い。"}],"collocations":["endonuclear protein (核内タンパク質)","endonuclear structure (核内構造)","endonuclear environment (核内環境)"],"synonyms":["intranuclear"],"antonyms":["extranuclear","cytoplasmic"]}],"etymology":{"value":"The term 'endonulear' is composed of the following parts: 'endo-' (prefix meaning 'within' or 'inner'), 'nucle-' (referring to the nucleus), and '-ar' (suffix indicating 'relating to'). Therefore, it literally means 'relating to the inside of the nucleus'.","priority":"★★★"},"pronunciation":{"ipa":"ˌɛndoʊˈnuːkliər","syllables":"en-do-nu-cle-ar"},"inflection":{"notes":"Since it is an adjective, it can be used to modify nouns. It does not have plural forms."},"usage_notes":{"explanation":"'Endonuclear' is a term used in biology, particularly in cell biology and genetics, to describe anything that is located or occurs within the nucleus of a cell. It is often used to specify the location or function of proteins, structures, or processes that are confined to the nuclear compartment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The endonuclear is important for cell function.","correct":"✓ The endonuclear components are important for cell function.","note":"'Endonuclear' is an adjective, so it needs to modify a noun. Using it as a noun is incorrect."},{"incorrect":"✗ The endonuclear process happens outside the nucleus.","correct":"✓ The endonuclear process happens inside the nucleus.","note":"'Endo-' means 'inside', so the process must occur within the nucleus."}],"priority":"★★☆"},"related_words":{"derivatives":["endonucleus (名詞: 核の内側)"],"related_terms":["nucleus (名詞: 細胞核)","intranuclear (形容詞: 核内の)","extranuclear (形容詞: 核外の)","cytoplasm (名詞: 細胞質)","nuclear membrane (名詞: 核膜)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'endonulear' is a scientific term used in the field of cell biology. It refers to anything located or occurring within the nucleus of a cell. The nucleus is the control center of the cell, containing the genetic material (DNA). Therefore, 'endonulear' is used to describe components, processes, or structures found inside the nucleus. This term is typically encountered in advanced biology textbooks, research papers, and scientific discussions related to cell biology and genetics."},"example_sentences":[{"sentence":"Endonuclear DNA replication is a tightly regulated process.","translation":"核内DNA複製は厳密に制御されたプロセスである。","type":"general","meaning_category":"DNA Replication"},{"sentence":"The distribution of endonuclear proteins changes during mitosis.","translation":"有糸分裂の間に核内タンパク質の分布が変化する。","type":"general","meaning_category":"Protein Distribution"},{"sentence":"Endonuclear bodies are observed in some cancer cells.","translation":"核内小体は、一部の癌細胞で観察される。","type":"general","meaning_category":"Cancer Research"}]}