{"word":"rifle-range","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"射撃場、ライフル射撃場","english_definition":"A place or area designed for practice or testing with rifles.","examples":[{"sentence":"The soldiers practiced at the rifle-range every week.","translation":"兵士たちは毎週射撃場で練習した。"},{"sentence":"The new rifle-range was built outside of town.","translation":"新しいライフル射撃場は町の外に建設された。"}],"collocations":["visit a rifle-range","practice at a rifle-range","build a rifle-range"],"synonyms":["shooting range","firing range","gun range"],"antonyms":[]}],"etymology":{"value":"Compound word of 'rifle' and 'range'. 'Rifle' refers to a type of gun, and 'range' refers to the area where shooting takes place.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈraɪfəlˌreɪndʒ/","syllables":"ri-fle-range"},"inflection":{"noun_plural":"rifle-ranges"},"usage_notes":{"explanation":"A rifle-range is specifically designed for rifles, as opposed to other types of firearms. It usually includes targets at various distances and safety features to prevent accidents.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I went to the rifle range with my pistol.","correct":"✓ I went to the shooting range with my pistol.","note":"A rifle-range is specifically for rifles. If you're using a pistol, a general shooting range is more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["rifle","range","shooting"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'rifle-range' is a compound noun that refers to a specialized area for rifle shooting practice or testing. It's generally used in contexts related to military, law enforcement, or recreational shooting activities. The word is straightforward in meaning but may not be commonly used outside of these specific contexts."},"example_sentences":[{"sentence":"The police officers trained at the rifle-range to improve their accuracy.","translation":"警察官たちは精度を上げるために射撃場で訓練をした。","type":"noun","meaning_category":"場所"},{"sentence":"The club members organized a competition at the local rifle-range.","translation":"クラブのメンバーは地元のライフル射撃場で競技会を企画した。","type":"noun","meaning_category":"場所"}]}