{"word":"Touchbacks","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(アメリカンフットボール、カナディアンフットボール) タッチバック","english_definition":"(American and Canadian football) A play in which the ball is downed in the end zone by the defending team, resulting in the ball being placed at the 25-yard line (NFL) or 20-yard line (other leagues) for the offensive team.","examples":[{"sentence":"The punt resulted in a touchback.","translation":"そのパントはタッチバックになった。"},{"sentence":"He tried to run it out of the end zone, but he should have taken the touchback.","translation":"彼はエンドゾーンから走り出そうとしたが、タッチバックを取るべきだった。"}],"collocations":["take a touchback","result in a touchback","kick for a touchback"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Touchback' is a compound word derived from 'touch' and 'back'. It describes the action of touching the ball down in the end zone and then bringing it 'back' to the other team's possession at a designated point on the field.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtʌtʃbæks/","syllables":"Touch-backs"},"inflection":{"noun_plural":"Touchbacks"},"usage_notes":{"explanation":"In American and Canadian football, a touchback occurs when the ball is downed in the end zone by the defending team under specific circumstances, such as when a punt or kickoff goes into the end zone and is not returned, or when a player is tackled in their own end zone after gaining possession there. The result is that the ball is placed at the 25-yard line (in the NFL) or 20-yard line (in other leagues) for the opposing team. It's a relatively safe play that avoids the risk of a turnover or poor field position.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He made a touchback.","correct":"✓ He took a touchback. / ✓ The play resulted in a touchback.","note":"The correct phrasing is 'take a touchback' or 'the play resulted in a touchback', not 'make a touchback'."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["End zone","Kickoff","Punt","Safety","Downed"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency, specific to football terminology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Touchback' is a term specific to American and Canadian football. It refers to a situation where the ball is downed in the end zone by the defending team, resulting in the ball being placed at a set yard line for the offensive team. Understanding this term requires familiarity with the rules and terminology of football. It's not a commonly used word outside of the context of the sport.","priority":"★★☆"},"example_sentences":[{"sentence":"The punt went into the end zone, resulting in a touchback for the receiving team.","translation":"パントがエンドゾーンに入り、リシーブチームにタッチバックが与えられた。","type":"noun","meaning_category":"American/Canadian Football"},{"sentence":"Instead of risking a return, the player wisely took a touchback.","translation":"リターンを試みるリスクを冒す代わりに、その選手は賢明にもタッチバックを選んだ。","type":"noun","meaning_category":"American/Canadian Football"}]}