{"word":"submatrix","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(数学)行列の一部分からなる行列","english_definition":"(mathematics) A matrix formed by selecting certain rows and columns from a larger matrix.","examples":[{"sentence":"The determinant of a submatrix can be used to determine the rank of the original matrix.","translation":"部分行列の行列式は、元の行列のランクを決定するために使用できます。"},{"sentence":"We extracted a 3x3 submatrix from the original 5x5 matrix.","translation":"元の5x5行列から3x3の部分行列を抽出しました。"}],"collocations":["extract a submatrix","form a submatrix","determinant of a submatrix"],"synonyms":["minor (related, but specifically refers to the determinant of a square submatrix)"],"antonyms":["supermatrix (a matrix containing the original matrix as a submatrix)"]},{"part_of_speech":"noun","definition":"(プログラミング)配列の一部分からなる配列","english_definition":"(programming) A portion of a larger array, accessed by specifying a range of indices for each dimension.","examples":[{"sentence":"The function returns a submatrix of the input array.","translation":"この関数は、入力配列の部分行列を返します。"},{"sentence":"We used array slicing to create a submatrix.","translation":"配列スライスを使用して部分行列を作成しました。"}],"collocations":["create a submatrix","extract a submatrix","submatrix indexing"],"synonyms":["subarray","slice"],"antonyms":["superarray"]}],"etymology":{"value":"The word \"submatrix\" is formed by combining the prefix \"sub-\" (meaning under, below, or a part of) with the word \"matrix\".","priority":"★★★"},"pronunciation":{"ipa":"/ˈsʌbmeɪtrɪks/","syllables":"sub-ma-trix"},"inflection":{"noun_plural":"submatrices"},"usage_notes":{"explanation":"A **submatrix** is a matrix formed by selecting rows and columns from another matrix. If you have a matrix *A*, any matrix formed by deleting rows and/or columns of *A* is a submatrix of *A*. In programming contexts, it often refers to a section of a multi-dimensional array.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The submatrix was created by adding rows to the original matrix.","correct":"✓ The submatrix was created by selecting rows from the original matrix.","note":"Submatrices are formed by *selecting* rows and columns, not by adding them. Adding rows or columns would create a supermatrix, not a submatrix."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["matrix","minor","determinant","rank"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency (technical term)","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term \"submatrix\" is a technical term used in linear algebra and computer science. It refers to a matrix that is formed by selecting certain rows and columns from a larger matrix. Understanding this term requires familiarity with matrix operations and linear algebra concepts."},"example_sentences":[{"sentence":"The algorithm efficiently computes the determinant of each submatrix.","translation":"そのアルゴリズムは、各部分行列の行列式を効率的に計算します。","type":"noun","meaning_category":"mathematics"},{"sentence":"We can use nested loops to iterate over all possible submatrices of a given size.","translation":"ネストされたループを使用して、指定されたサイズの可能なすべての部分行列を反復処理できます。","type":"noun","meaning_category":"programming"}]}