{"word":"Jestude","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A jesting attitude or manner; a tendency to joke or make light of serious matters.","english_definition":"A playful or humorous disposition; a habit of joking or treating serious topics lightly.","examples":[{"sentence":"His jestude often got him into trouble during serious meetings.","translation":"彼の冗談めかした態度は、深刻な会議中にしばしば彼を困らせた。"},{"sentence":"She adopted a jestude to cope with the stressful situation.","translation":"彼女はストレスの多い状況に対処するために、冗談めかした態度をとった。"}],"collocations":["display a jestude","adopt a jestude","maintain a jestude","a light jestude","a cynical jestude"],"synonyms":["jocularity","flippancy","levity","humor","banter"],"antonyms":["seriousness","solemnity","gravity"]}],"etymology":{"value":"A blend of 'jest' (a joke or witty remark) and 'attitude' or 'habitude' (a customary behavior or manner).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdʒɛstjuːd/","syllables":"Jes-tude"},"inflection":{"noun_plural":"Jestudes"},"usage_notes":{"explanation":"'Jestude' is a relatively uncommon word that describes a person's characteristic way of behaving in a joking or playful manner, even when the situation might call for seriousness. It implies a habitual tendency to make light of things. It is not a widely recognized or frequently used word, so its usage might be considered somewhat informal or creative.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed jestude towards the suffering people.","correct":"✓ He showed levity/disrespect towards the suffering people.","note":"'Jestude' describes a general attitude, not a specific action towards someone. Use synonyms like 'levity' or 'disrespect' for actions. "},{"incorrect":"✗ The jestude of the clown made everyone laugh.","correct":"✓ The clown's jokes/humor made everyone laugh.","note":"'Jestude' is the attitude, not the joke itself. Use 'jokes' or 'humor' to describe the clown's actions."}],"priority":"★★☆"},"related_words":{"derivatives":["jest (noun/verb)","jester (noun)","jocose (adjective)","jocular (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Jestude' is a rare and somewhat informal word describing a habitual joking or lighthearted attitude, even in serious situations. It combines the idea of 'jest' (a joke) with a habitual manner. Because it's not commonly used, it's important to ensure your audience understands the intended meaning. Synonyms like 'jocularity' or 'flippancy' might be more widely understood, depending on the context. "},"example_sentences":[{"sentence":"Despite the somber occasion, a hint of jestude could be detected in his eyes.","translation":"厳粛な機会にもかかわらず、彼の目には冗談めかした態度がわずかに見られた。","type":"noun","meaning_category":"joking attitude"},{"sentence":"Her jestude was a defense mechanism against vulnerability.","translation":"彼女の冗談めかした態度は、脆弱性に対する防御メカニズムだった。","type":"noun","meaning_category":"joking attitude"},{"sentence":"The professor's jestude made the complex subject matter more approachable.","translation":"教授の冗談めかした態度は、複雑な主題をより親しみやすくした。","type":"noun","meaning_category":"joking attitude"}]}