{"word":"pseudonationally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"疑似国家的に、見せかけの国家の体裁で","english_definition":"In a manner that imitates or falsely represents a national identity or character.","examples":[{"sentence":"The region was governed pseudonationally, with local leaders acting as puppets for the foreign power.","translation":"その地域は見せかけの国家の体裁で統治され、地元の指導者たちは外国勢力の人形として行動した。"}],"collocations":["govern pseudonationally","operate pseudonationally"],"synonyms":["ostensibly nationally","seemingly nationally","falsely nationally"],"antonyms":["genuinely nationally","truly nationally","authentically nationally"]}],"etymology":{"value":"\"pseudo-\" (偽の) + \"nationally\" (国家的に)","priority":"★★★"},"pronunciation":{"ipa":"ˌsuːdoʊˈnæʃənəli","syllables":"pseu-do-na-tion-al-ly"},"inflection":{"notes":"Adverb, no inflection"},"usage_notes":{"explanation":"This word is used to describe actions, governance, or representation that appear to be national but are, in reality, artificial or insincere. It often implies a lack of genuine national identity or sovereignty.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company acted pseudonationally by supporting local charities.","correct":"✓ The company acted nationally by supporting local charities.","note":"Using \"nationally\" is more appropriate when the action genuinely supports the nation. \"Pseudonationally\" implies insincerity or a false representation."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudonational (adjective)","pseudonationalism (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"pseudonationally\" is a complex term used to describe something done in a way that falsely or superficially represents national identity. It is not a common word and would typically be found in academic or political contexts when discussing artificial or insincere displays of nationalism. Understanding the prefixes and suffixes (pseudo- and -ly) helps to decode the meaning. "},"example_sentences":[{"sentence":"The election was conducted pseudonationally, with the outcome predetermined by external forces.","translation":"その選挙は見せかけの国家の体裁で行われ、結果は外部勢力によって事前に決定されていた。","type":"adverb","meaning_category":"false representation of national identity"},{"sentence":"The government's policies were implemented pseudonationally, benefiting only a select few while claiming to serve the entire nation.","translation":"政府の政策は見せかけの国家の体裁で実施され、国全体に奉仕すると主張しながら、選ばれた少数者のみに利益をもたらした。","type":"adverb","meaning_category":"insincere national governance"}]}