{"word":"side-lever","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に時計や銃器の)側面レバー","english_definition":"A lever located on the side of a mechanism, such as a watch or firearm.","examples":[{"sentence":"The side-lever on the antique watch was used to wind it.","translation":"そのアンティーク時計の側面レバーは、ゼンマイを巻くために使われていた。"},{"sentence":"He adjusted the side-lever on his rifle before taking aim.","translation":"彼は狙いを定める前に、ライフル銃の側面レバーを調整した。"}],"collocations":["side-lever action","side-lever mechanism","wind with side-lever","adjust side-lever"],"synonyms":["lever","handle","control","switch"],"antonyms":[]}],"etymology":{"value":"The term 'side-lever' is a compound word formed by combining 'side,' referring to the lateral position, and 'lever,' indicating a bar or handle used for mechanical advantage.","priority":"★★★"},"pronunciation":{"ipa":"/ˈsaɪdˌliːvər/","syllables":"side-le-ver"},"inflection":{"noun_plural":"side-levers"},"usage_notes":{"explanation":"The term 'side-lever' is most commonly encountered in the context of antique watches and firearms. It refers to a lever positioned on the side of the device, used for winding, setting, or other mechanical operations. The term is relatively specialized and not widely used in general conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used the side-lever to break the gun.","correct":"✓ He used the side-lever to load the gun.","note":"Side-levers are typically used for loading, winding, or adjusting, not for breaking or disassembling the device."},{"incorrect":"✗ The side-lever is on the top.","correct":"✓ The side-lever is on the side.","note":"The defining characteristic of a side-lever is its location on the side of the mechanism."}],"priority":"★★☆"},"related_words":{"derivatives":["lever","side"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Technical vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'side-lever' is a technical term primarily used in the context of antique watches and firearms. Understanding the term requires familiarity with mechanical devices and their components. The word itself is straightforward, but its usage is limited to specific fields.","priority":"★★☆"},"example_sentences":[{"sentence":"The watchmaker carefully examined the intricate side-lever mechanism.","translation":"時計職人は複雑な側面レバー機構を注意深く調べた。","type":"noun","meaning_category":"Mechanism component"},{"sentence":"The hunter smoothly operated the side-lever to reload his shotgun.","translation":"猟師はスムーズに側面レバーを操作して、ショットガンを再装填した。","type":"noun","meaning_category":"Firearm component"}]}