{"word":"adulticide","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"殺成虫剤、成虫駆除剤","english_definition":"A pesticide used to kill adult insects or other adult pests.","examples":[{"sentence":"The city used an adulticide to control the mosquito population.","translation":"市は蚊の個体数を制御するために殺成虫剤を使用した。"},{"sentence":"The adulticide is effective against a wide range of adult insects.","translation":"その殺成虫剤は広範囲の成虫に対して効果的である。"}],"collocations":["mosquito adulticide","apply adulticide","adulticide spraying"],"synonyms":["pesticide","insecticide"],"antonyms":[]}],"etymology":{"value":"From 'adult' + '-i-' (connecting vowel) + '-cide' (killer).","priority":"★★☆"},"pronunciation":{"ipa":"/əˈdʌltɪsaɪd/","syllables":"a-dul-ti-cide"},"inflection":{"noun_plural":"adulticides"},"usage_notes":{"explanation":"'Adulticide' specifically refers to a pesticide that targets the adult stage of pests, especially insects. It's often used in public health contexts to control disease-carrying insects like mosquitoes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The adulticide killed all the eggs.","correct":"✓ The adulticide killed all the adult insects.","note":"Adulticides are designed to kill adult insects, not eggs or larvae."}],"priority":"★★☆"},"related_words":{"derivatives":["larvicide","pesticide","insecticide"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Adulticide' is a specialized term used in the context of pest control, specifically referring to substances that kill adult insects. It is not a commonly used word in everyday conversation, but rather in scientific, agricultural, or public health discussions related to managing insect populations. Understanding the term requires knowledge of basic biology and pest control strategies."},"example_sentences":[{"sentence":"The use of adulticides has been shown to effectively reduce the spread of mosquito-borne diseases.","translation":"殺成虫剤の使用は、蚊が媒介する病気の蔓延を効果的に減少させることが示されている。","type":"general","meaning_category":"pest control"},{"sentence":"The farmer sprayed an adulticide on his crops to protect them from insect damage.","translation":"農家は作物を昆虫の被害から守るために、殺成虫剤を作物に散布した。","type":"agricultural","meaning_category":"agriculture"},{"sentence":"The environmental impact of adulticide use is a subject of ongoing research.","translation":"殺成虫剤の使用による環境への影響は、現在も研究課題となっている。","type":"environmental","meaning_category":"environmental impact"}]}