{"word":"Leming","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"レミング、タビネズミ","english_definition":"A small, short-tailed rodent found in or near the Arctic, known for its periodic mass migrations.","examples":[{"sentence":"The lemming population fluctuates dramatically every few years.","translation":"レミングの個体数は数年ごとに劇的に変動する。"},{"sentence":"Lemmings are well-adapted to the harsh conditions of the Arctic tundra.","translation":"レミングは北極ツンドラの厳しい環境によく適応している。"}],"collocations":["lemming population","arctic lemming","lemming migration"],"synonyms":["vole","rodent"],"antonyms":[]}],"etymology":{"value":"From Norwegian 'lemming', of uncertain origin, possibly related to Old Norse 'lemmr' meaning 'fragment'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɛmɪŋ/","syllables":"Lem-ing"},"inflection":{"noun_plural":"lemmings"},"usage_notes":{"explanation":"Lemmings are known for their cyclical population booms and subsequent mass migrations. A popular myth suggests that lemmings commit mass suicide by jumping off cliffs, but this is not accurate. While they do migrate and sometimes cross bodies of water, they do not intentionally jump to their deaths.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lemming jumped off the cliff to commit suicide.","correct":"✓ The lemming migrated to find new resources.","note":"Lemmings do not intentionally commit suicide by jumping off cliffs. This is a misconception."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'lemming' refers to a small rodent living in the Arctic. It's important to know that the common belief about lemmings committing mass suicide is a myth. This word might appear in discussions about animal behavior, ecology, or debunking common misconceptions.","priority":"★☆☆"},"example_sentences":[{"sentence":"The documentary explored the migratory patterns of the Arctic **lemming**.","translation":"そのドキュメンタリーは北極レミングの移動パターンを探求した。","type":"noun","meaning_category":"animal"},{"sentence":"The **lemming** population experienced a significant increase this year.","translation":"レミングの個体数は今年大幅に増加した。","type":"noun","meaning_category":"population"}]}