{"word":"angkuh","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"(of a person) arrogant, haughty, conceited, proud","english_definition":"having or revealing an exaggerated sense of one's own importance or abilities; excessively proud or superior.","examples":[{"sentence":"Dia adalah seorang yang angkuh dan tidak disukai oleh banyak orang.","translation":"He is an arrogant person and disliked by many people.","english_translation":"He is an arrogant person and is disliked by many people."},{"sentence":"Jangan bersikap angkuh, karena itu akan membuatmu dijauhi.","translation":"Don't be arrogant, because it will make you be avoided.","english_translation":"Don't be arrogant, because that will cause people to avoid you."},{"sentence":"Sikapnya yang angkuh membuatnya kehilangan banyak teman.","translation":"His haughty attitude made him lose many friends.","english_translation":"His haughty attitude caused him to lose many friends."}],"collocations":["bersikap angkuh (to act arrogantly)","orang yang angkuh (an arrogant person)","sikap angkuh (arrogant attitude)"],"synonyms":["sombong","congkak","tinggi hati","pongah"],"antonyms":["rendah hati","sederhana","tawadhu'"]}],"etymology":{"value":"The exact etymology is uncertain, but it is believed to be derived from a Proto-Malayic word.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈaŋkuh/","syllables":"ang-kuh"},"inflection":{"notes":"It is an adjective, so it can be modified by adverbs (e.g., sangat angkuh - very arrogant) and can be used in comparative and superlative forms (though less common)."},"usage_notes":{"explanation":"'Angkuh' describes a negative personality trait characterized by excessive pride and a belief in one's own superiority. It is often associated with a lack of humility and a tendency to look down on others.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Dia adalah angkuh.","correct":"Dia adalah orang yang angkuh.","note":"While grammatically understandable, it's more natural to say 'Dia adalah orang yang angkuh' (He is an arrogant person) rather than 'Dia adalah angkuh' (He is arrogant)."},{"incorrect":"Angkuhnya sangat baik.","correct":"Sikap angkuhnya sangat buruk.","note":"'Angkuh' itself is not good or bad. It's the *attitude* of arrogance that is negative. So, it's better to say 'Sikap angkuhnya sangat buruk' (His arrogant attitude is very bad)."}],"priority":"★★☆"},"related_words":{"derivatives":["keangkuhan (arrogance, haughtiness)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively frequent.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"'Angkuh' is a word used to describe someone who thinks they are better than others. It's a negative trait, meaning the person is arrogant and not humble. You might read this word in literature or news articles discussing someone's character. It's important to understand that being 'angkuh' is generally seen as undesirable in Indonesian culture."},"example_sentences":[{"sentence":"Pemain sepak bola itu menjadi angkuh setelah memenangkan pertandingan.","translation":"The football player became arrogant after winning the match.","type":"example","meaning_category":"arrogant"},{"sentence":"Keangkuhannya membuatnya dijauhi oleh teman-temannya.","translation":"His arrogance caused him to be avoided by his friends.","type":"example","meaning_category":"arrogance (noun form)"},{"sentence":"Jangan menjadi orang yang angkuh, tetapi tetaplah rendah hati.","translation":"Don't be an arrogant person, but remain humble.","type":"example","meaning_category":"arrogant (advice)"}]}