{"word":"reaming-out","priority":"★☆☆","meanings":[{"part_of_speech":"verb","definition":"(穴などを)リーマで広げる、仕上げる","english_definition":"Enlarging or finishing a hole with a reamer.","examples":[{"sentence":"He was reaming-out the hole to the correct diameter.","translation":"彼は穴を正しい直径にリーマで広げていた。"}],"collocations":[],"synonyms":["reaming","boring","drilling"],"antonyms":[]}],"etymology":{"value":"The term 'reaming-out' is derived from the verb 'ream,' which means to enlarge or shape a hole with a reamer. The addition of '-out' emphasizes the action of expanding or finishing the hole.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈriːmɪŋˌaʊt/","syllables":"reem-ing-out"},"inflection":{"verb_forms":{"present_participle":"reaming-out"}},"usage_notes":{"explanation":"'Reaming-out' is a specific term used in machining and engineering contexts to describe the process of using a reamer to enlarge or finish a hole to precise dimensions. It implies a more refined and accurate process than simply drilling a hole.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I'm drilling-out the hole.","correct":"✓ I'm reaming-out the hole.","note":"'Drilling' is a more general term for making a hole, while 'reaming' specifically refers to enlarging or finishing a pre-existing hole to a precise size and smooth finish."}],"priority":"★★☆"},"related_words":{"derivatives":["ream (verb, noun)","reamer (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Reaming-out' is a specialized term used in engineering and machining. It refers to the process of using a reamer, a rotary cutting tool, to enlarge or finish an existing hole to a precise diameter and smooth surface. The term is relatively uncommon in general conversation but is well-understood within relevant technical fields."},"example_sentences":[{"sentence":"The machinist is carefully reaming-out the cylinder bore.","translation":"機械工は慎重にシリンダーの内径をリーマで仕上げている。","type":"verb","meaning_category":"リーマ仕上げ"},{"sentence":"Reaming-out ensures a precise fit for the pin.","translation":"リーマ仕上げはピンの正確な嵌合を保証する。","type":"verb","meaning_category":"リーマ仕上げ"}]}