{"word":"misotheistic","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"神を憎む、神を嫌悪する","english_definition":"Characterized by or exhibiting hatred of God or gods.","examples":[{"sentence":"The character's misotheistic views were central to the novel's theme.","translation":"その登場人物の神を憎む考え方は、小説のテーマの中心だった。"},{"sentence":"Some philosophers have been described as misotheistic due to their rejection of traditional religious beliefs.","translation":"伝統的な宗教的信念を拒否したため、一部の哲学者は神を憎むと表現されてきた。"}],"collocations":["misotheistic views","misotheistic arguments","misotheistic philosophy","misotheistic character"],"synonyms":["god-hating","anti-theistic","irreligious","blasphemous"],"antonyms":["theistic","religious","god-loving"]}],"etymology":{"value":"Derived from the Greek words 'misos' (hatred) and 'theos' (god), combined with the suffix '-istic' (relating to).","priority":"★★★"},"pronunciation":{"ipa":"/ˌmɪsəθiˈɪstɪk/","syllables":"mi-so-the-is-tic"},"inflection":{"notes":"This word is an adjective and does not have different inflections."},"usage_notes":{"explanation":"'Misotheistic' is used to describe someone or something that expresses hatred or dislike of God or gods. It is often used in philosophical, theological, or literary contexts. It is stronger than simply being non-religious or atheistic; it implies active animosity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a misotheistic person because he doesn't believe in God.","correct":"✓ He is an atheist because he doesn't believe in God. He is misotheistic because he actively hates the idea of God.","note":"Atheism is the lack of belief in God, while misotheism is the hatred of God. They are not the same thing."}],"priority":"★★☆"},"related_words":{"derivatives":["misotheism (noun: hatred of God)","misotheist (noun: one who hates God)"],"related_concepts":["atheism (lack of belief in God)","theism (belief in God)","antitheism (opposition to theism)","dystheism (belief in a god that is not wholly good)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - This is a relatively rare word.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Misotheistic' is a specialized term used to describe a hatred or animosity towards God or gods. It's not simply a lack of belief (atheism) but an active dislike. You'll typically find this word in discussions about philosophy, religion, or literature when analyzing characters or arguments that express this kind of hatred."},"example_sentences":[{"sentence":"The play explored the protagonist's journey from faith to a deeply misotheistic perspective.","translation":"その劇は、主人公が信仰から深く神を憎む視点へと至る過程を探求した。","type":"general"},{"sentence":"His misotheistic writings challenged traditional religious doctrines.","translation":"彼の神を憎む著作は、伝統的な宗教的教義に異議を唱えた。","type":"general"}]}