{"word":"data-structure-sensitive","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"データ構造に依存する、データ構造を考慮した","english_definition":"Relating to or designed in consideration of the specific data structures used.","examples":[{"sentence":"The algorithm is data-structure-sensitive, meaning its performance depends heavily on the choice of data structure.","translation":"そのアルゴリズムはデータ構造に依存しており、その性能はデータ構造の選択に大きく左右される。"},{"sentence":"A data-structure-sensitive approach can lead to significant performance improvements.","translation":"データ構造を考慮したアプローチは、大幅な性能向上につながる可能性がある。"}],"collocations":["data-structure-sensitive algorithm","data-structure-sensitive design","data-structure-sensitive optimization"],"synonyms":["data-aware","data-dependent"],"antonyms":["data-structure-agnostic","data-independent"]}],"etymology":{"value":"A compound word formed by combining 'data-structure' and 'sensitive'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈdeɪtə ˌstrʌktʃər ˈsɛnsətɪv/","syllables":"da-ta-struc-ture-sen-si-tive"},"inflection":{"notes":"Adjectives do not inflect in English."},"usage_notes":{"explanation":"This term is primarily used in computer science and software engineering to describe algorithms, designs, or optimizations that are specifically tailored to the characteristics of the data structures they operate on. It implies that the choice of data structure has a significant impact on the performance or behavior of the system.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The code is sensitive, so it's data-structure-sensitive.","correct":"✓ The code's performance is sensitive to the data structure used, so it's data-structure-sensitive.","note":"'Sensitive' alone is too general. The term implies a direct relationship between the data structure and the behavior of the algorithm or system."}],"priority":"★★☆"},"related_words":{"derivatives":["data structure","sensitive"],"related_terms":["algorithm","data structure","optimization","performance"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'data-structure-sensitive' is a specialized term used in computer science. It describes something (usually an algorithm or a piece of code) that is designed to take advantage of the specific properties of the data structure it is working with. Understanding this term requires familiarity with data structures and algorithm design principles."},"example_sentences":[{"sentence":"A data-structure-sensitive garbage collector can improve memory management efficiency.","translation":"データ構造を考慮したガベージコレクタは、メモリ管理の効率を向上させることができる。","type":"general","meaning_category":"Technical Description"},{"sentence":"The compiler performs data-structure-sensitive optimizations to reduce memory access overhead.","translation":"コンパイラは、メモリアクセスのオーバーヘッドを削減するために、データ構造を考慮した最適化を実行する。","type":"general","meaning_category":"Technical Description"}]}