{"word":"superformally","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"非常に形式的に、極めて形式ばって","english_definition":"In an extremely formal manner; with excessive formality.","examples":[{"sentence":"The meeting was conducted superformally, with every detail meticulously planned.","translation":"会議は非常に形式的に行われ、すべての詳細が綿密に計画されていました。"},{"sentence":"He addressed the queen superformally, using only the most respectful language.","translation":"彼は女王に極めて形式ばって話し、最も丁寧な言葉遣いだけを使いました。"},{"sentence":"The contract was written superformally, using legal jargon that was difficult to understand.","translation":"契約書は非常に形式的に書かれており、理解するのが難しい法律用語が使われていました。"}],"collocations":["address someone superformally","conduct something superformally","write something superformally"],"synonyms":["excessively formally","overly formally","ceremoniously","stiffly","pompously"],"antonyms":["informally","casually","naturally","spontaneously"]}],"etymology":{"value":"\"super-\" (above, beyond) + \"formally\" (in a formal manner). Indicates a degree of formality exceeding the usual or expected.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsuːpərˈfɔːrməli/","syllables":"su-per-for-mal-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"\"Superformally\" describes actions or behaviors that adhere to strict rules of etiquette and protocol to an extreme degree. It often implies that the level of formality is unnecessary or excessive for the situation. The term is relatively rare and is used to emphasize the high degree of formality.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted super formal.","correct":"✓ He acted superformally.","note":"Since it is an adverb, it must end with '-ly' to modify a verb correctly."}],"priority":"★★☆"},"related_words":{"derivatives":["formal","formally","superformal","formality"],"related_terms":["ceremonial","protocol","etiquette"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'superformally' is used to describe actions done in a way that is extremely formal, often more than necessary. It's not a common word, so it's usually used when you want to emphasize that something was done with a very high level of formality. For example, if a meeting was conducted 'superformally,' it means that every rule and procedure was followed very strictly, perhaps even more strictly than needed."},"example_sentences":[{"sentence":"The ambassador greeted the visiting dignitary superformally, bowing deeply and reciting a prepared speech.","translation":"大使は訪問中の高官を非常に形式的に迎え、深くお辞儀をし、用意されたスピーチを朗読しました。","type":"adverb","meaning_category":"manner"},{"sentence":"The wedding ceremony was conducted superformally, with strict adherence to every tradition.","translation":"結婚式は非常に形式的に行われ、すべての伝統が厳守されました。","type":"adverb","meaning_category":"manner"},{"sentence":"The legal document was drafted superformally to avoid any possible ambiguity.","translation":"法的文書は、起こりうる曖昧さを避けるために、非常に形式的に起草されました。","type":"adverb","meaning_category":"manner"}]}