{"word":"maltsters","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"麦芽製造業者、麦芽職人","english_definition":"plural of maltster: a person who malts grain, especially barley, for use in brewing or distilling.","examples":[{"sentence":"The maltsters carefully control the temperature and humidity during the malting process.","translation":"麦芽製造業者は、麦芽製造工程中の温度と湿度を注意深く管理します。"},{"sentence":"Maltsters supply breweries with the malted barley needed to make beer.","translation":"麦芽製造業者は、ビール製造に必要な麦芽大麦を醸造所に供給します。"}],"collocations":["independent maltsters","craft maltsters","local maltsters"],"synonyms":["malt producer","malt maker"],"antonyms":[]}],"etymology":{"value":"Derived from 'maltster', which comes from 'malt' (Old English 'mealt', meaning grain prepared for brewing) + '-ster' (suffix denoting a person engaged in an occupation).","priority":"★★☆"},"pronunciation":{"ipa":"ˈmɔːltstərz","syllables":"malt-sters"},"inflection":{"noun_plural":"maltsters"},"usage_notes":{"explanation":"'Maltsters' refers specifically to people involved in the process of malting, which is a crucial step in the production of beer, whiskey, and some foods. They are responsible for steeping, germinating, and kilning grains, typically barley, to convert starches into fermentable sugars.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The maltsters are making malts.","correct":"✓ The maltsters are malting barley.","note":"'Malts' refers to the product (the malted grain), while 'malting' is the process the maltsters perform."}],"priority":"★★☆"},"related_words":{"derivatives":["maltster (singular noun)","malting (noun: the process of malting grain; adjective: relating to the process of malting)","malt (noun: grain, usually barley, that has been steeped, germinated, and kilned)"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown (specialized vocabulary)","frequency_google_ngram":"Low frequency (specialized term)","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Maltsters' is a specialized term related to the brewing and distilling industries. It refers to individuals or businesses that perform the malting process, which is the controlled germination and drying of grains (usually barley) to convert starches into sugars that can be fermented. Understanding this term requires familiarity with the beer or whiskey production process."},"example_sentences":[{"sentence":"The local breweries rely on the skills of the maltsters to provide high-quality malt.","translation":"地元の醸造所は、高品質の麦芽を提供するために麦芽製造業者の技術に頼っています。","type":"noun","meaning_category":"麦芽製造業者"},{"sentence":"Many craft breweries prefer to work with independent maltsters to ensure unique flavor profiles in their beers.","translation":"多くのクラフトビール醸造所は、ビールに独特の風味を与えるために、独立した麦芽製造業者と協力することを好みます。","type":"noun","meaning_category":"麦芽製造業者"}]}