{"word":"Zoogloeic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"細菌が分泌する粘液性物質に包まれた状態、またはそのような物質を生成する細菌に関する","english_definition":"Relating to or characterized by zoogloea; pertaining to bacteria embedded in a gelatinous matrix of their own secretion.","examples":[{"sentence":"The bacteria in the wastewater treatment plant formed a zoogloeic mass.","translation":"その排水処理施設の細菌は、動物膠様の塊を形成した。"},{"sentence":"Zoogloeic growth is common in certain types of bacterial colonies.","translation":"動物膠様の成長は、特定の種類の細菌コロニーによく見られる。"}],"collocations":["zoogloeic mass","zoogloeic growth","zoogloeic bacteria"],"synonyms":["gelatinous","mucilaginous","slimy"],"antonyms":[]}],"etymology":{"value":"Derived from the term 'zoogloea,' which combines 'zoo-' (referring to animal-like or living organisms) and 'gloea' (meaning gelatinous or glue-like substance).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌzoʊ.əˈɡliːɪk/","syllables":"zo-o-glee-ic"},"inflection":{"notes":"Adjective form only; no plural or verb forms."},"usage_notes":{"explanation":"'Zoogloeic' describes the state or characteristic of bacteria that are embedded within a self-secreted, gelatinous matrix. This is often observed in environments like wastewater treatment plants, where bacteria aggregate to form flocs that aid in the removal of pollutants. It's a technical term primarily used in microbiology and environmental science.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The zoogloeic bacteria was visible.","correct":"✓ The zoogloeic bacteria were visible.","note":"'Bacteria' is plural, so use 'were' instead of 'was'."},{"incorrect":"✗ The zoogloeic is a type of bacteria.","correct":"✓ Zoogloea is a type of bacterial aggregate.","note":"'Zoogloeic' is an adjective; 'zoogloea' is the noun referring to the bacterial aggregate."}],"priority":"★★☆"},"related_words":{"derivatives":["zoogloea (noun: a gelatinous mass formed by bacteria)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Zoogloeic' is a highly specialized term used in microbiology and environmental science to describe bacteria embedded in a gelatinous matrix. Understanding this term requires knowledge of bacterial structures and ecological processes, particularly in wastewater treatment. It is not commonly used outside of scientific contexts."},"example_sentences":[{"sentence":"The **zoogloeic** film on the rocks indicated the presence of specific bacteria.","translation":"岩の上の動物膠様の膜は、特定の細菌の存在を示していた。","type":"adjective","meaning_category":"Describing bacterial state"},{"sentence":"The efficiency of the wastewater treatment process depends on the formation of **zoogloeic** flocs.","translation":"排水処理プロセスの効率は、動物膠様のフロックの形成に依存する。","type":"adjective","meaning_category":"Describing a process"}]}