{"word":"nonviable","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"生存不能な、実行不可能な","english_definition":"not capable of surviving or succeeding.","examples":[{"sentence":"The eggs were nonviable and did not hatch.","translation":"その卵は生存不能で、孵化しなかった。"},{"sentence":"The proposed business plan was deemed nonviable by the investors.","translation":"提案された事業計画は、投資家によって実行不可能と判断された。"},{"sentence":"A nonviable fetus cannot survive outside the womb.","translation":"生存不能な胎児は、子宮外では生存できない。"}],"collocations":["nonviable egg","nonviable fetus","nonviable business","nonviable solution","nonviable option","nonviable plan"],"synonyms":["unfeasible","impractical","unsustainable","unworkable","inoperable","impossible"],"antonyms":["viable","feasible","practical","sustainable","workable","operable"]}],"etymology":{"value":"\"non-\" (not) + \"viable\" (capable of living or succeeding). \"Viable\" comes from Latin \"vita\" (life).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈvaɪəbəl/","syllables":"non-vi-a-ble"},"inflection":{"notes":"Adjective; comparative and superlative forms are typically formed using \"more\" and \"most\" (e.g., more nonviable, most nonviable)."},"usage_notes":{"explanation":"\"Nonviable\" is used to describe something that cannot live, grow, or develop successfully. It is often used in biological contexts to describe organisms or cells that are unable to survive. It can also be used in business or planning contexts to describe ideas or proposals that are unlikely to succeed. The term implies a fundamental flaw or condition that prevents success.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is nonviable to compete with larger corporations.","correct":"✓ The company is nonviable because it cannot compete with larger corporations.","note":"\"Nonviable\" describes the state of being unable to survive or succeed. It's better to use \"because\" or another similar conjunction to explain the reason for the nonviability."},{"incorrect":"✗ The nonviable of the project led to its cancellation.","correct":"✓ The nonviability of the project led to its cancellation.","note":"\"Nonviable\" is an adjective. The noun form is \"nonviability.\""}],"priority":"★★☆"},"related_words":{"derivatives":["nonviability (noun): the state of not being viable"],"phrases":["nonviable pregnancy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. More common in scientific or technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Nonviable\" means something is not able to live or succeed. It's often used in science, especially biology, to describe things like seeds or cells that can't grow. It can also describe plans or ideas that won't work. It's a more formal word, so you'll see it more in writing than in everyday conversation."},"example_sentences":[{"sentence":"The seed was nonviable and failed to germinate.","translation":"その種子は生存不能で、発芽しなかった。","type":"adjective","meaning_category":"biology"},{"sentence":"The business model proved to be nonviable in the current market conditions.","translation":"そのビジネスモデルは、現在の市場状況では実行不可能であることが判明した。","type":"adjective","meaning_category":"business"},{"sentence":"The doctor confirmed that the pregnancy was nonviable.","translation":"医師は、妊娠が継続不可能であることを確認した。","type":"adjective","meaning_category":"medicine"}]}