{"word":"unmillable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"製粉できない、粉にすることができない","english_definition":"Not suitable for milling; unable to be ground into flour or meal.","examples":[{"sentence":"The grain was unmillable due to its high moisture content.","translation":"その穀物は水分含有量が高いため、製粉できなかった。"},{"sentence":"Unmillable wood is often used for other purposes, such as firewood.","translation":"製粉できない木材は、薪など他の用途に使われることが多い。"}],"collocations":["unmillable grain","unmillable wood","unmillable material"],"synonyms":["ungrindable","unpowderable"],"antonyms":["millable","grindable","powderable"]}],"etymology":{"value":"\"un-\" (否定の接頭辞) + \"millable\" (製粉できる)","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈmɪləbəl/","syllables":"un-mil-la-ble"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化があります。 (unmillabler, unmillablest)"},"usage_notes":{"explanation":"\"Unmillable\" is a relatively uncommon word that describes something that cannot be milled, typically referring to grains or other materials that cannot be ground into flour or meal. It often implies that the material is unsuitable due to its condition (e.g., too wet, too hard) or inherent properties.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The metal was unmillable.","correct":"✓ The metal was unmachinable.","note":"\"Unmillable\" typically refers to materials intended for milling into flour or meal. For metals or other materials that are machined, use \"unmachinable\"."}],"priority":"★★☆"},"related_words":{"derivatives":["mill (名詞: 製粉機、工場; 動詞: 製粉する)","millable (形容詞: 製粉できる)","milling (名詞: 製粉)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語に近い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Unmillable\" is a specialized term primarily used in the context of agriculture and food processing. It describes materials, especially grains, that are not suitable for milling into flour or meal. This unsuitability can arise from various factors, such as excessive moisture, damage, or the presence of foreign substances. The word is not commonly encountered in everyday language and is more likely to appear in technical or industry-specific contexts."},"example_sentences":[{"sentence":"The damaged wheat was deemed unmillable and was used as animal feed instead.","translation":"損傷した小麦は製粉できないと判断され、代わりに動物の飼料として使用された。","type":"adjective","meaning_category":"製粉できない"},{"sentence":"The high stone content made the ore unmillable with conventional equipment.","translation":"石の含有量が高いため、その鉱石は従来の設備では製粉できなかった。","type":"adjective","meaning_category":"製粉できない"}]}