{"word":"autoepilation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"自分で毛を抜く行為、自発的脱毛","english_definition":"The act of pulling out one's own hair, especially as a nervous habit or symptom of a psychological disorder.","examples":[{"sentence":"Her doctor suspected autoepilation when he noticed the uneven patches of hair loss.","translation":"医師は、彼女の髪の毛が不均一に抜けていることに気づき、自己抜毛を疑った。"},{"sentence":"Autoepilation can be a coping mechanism for stress and anxiety.","translation":"自己抜毛は、ストレスや不安に対する対処メカニズムとなることがある。"}],"collocations":["nervous autoepilation (神経質な自己抜毛)","compulsive autoepilation (強迫的な自己抜毛)"],"synonyms":["trichotillomania (抜毛症)","hair pulling (毛を抜く行為)"],"antonyms":[]}],"etymology":{"value":"\"auto-\" (自己) + \"epilation\" (脱毛)","priority":"★★★"},"pronunciation":{"ipa":"/ˌɔːtoʊˌɛpɪˈleɪʃən/","syllables":"au-to-ep-i-la-tion"},"inflection":{"noun_plural":"autoepilations"},"usage_notes":{"explanation":"\"Autoepilation\" refers specifically to the act of someone pulling out their own hair. It can be a conscious habit or a symptom of an underlying psychological condition, such as trichotillomania. It is more clinical than simply saying \"hair pulling\" which can refer to any instance of pulling hair.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She uses autoepilation to remove unwanted hair on her legs.","correct":"✓ She waxes or shaves her legs to remove unwanted hair. / She has laser hair removal on her legs.","note":"Autoepilation is typically associated with compulsive hair pulling, not routine hair removal. Use terms like 'waxing,' 'shaving,' or 'laser hair removal' for normal hair removal practices."}],"priority":"★☆☆"},"related_words":{"derivatives":["epilation (脱毛)","trichotillomania (抜毛症)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"autoepilation\" is a specialized term referring to the act of pulling out one's own hair, often as a compulsive behavior or symptom of a psychological disorder. It is not a common word and is primarily used in medical or psychological contexts. Understanding this word requires familiarity with medical terminology and psychological concepts."},"example_sentences":[{"sentence":"The therapist helped her address the underlying anxiety that triggered her autoepilation.","translation":"セラピストは、彼女の自己抜毛を引き起こす根本的な不安に対処するのを手伝った。","type":"noun","meaning_category":"compulsive behavior"},{"sentence":"Chronic autoepilation can lead to noticeable hair loss and scalp damage.","translation":"慢性の自己抜毛は、目に見える脱毛や頭皮の損傷につながる可能性がある。","type":"noun","meaning_category":"compulsive behavior"}]}