{"word":"twice-charged","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"二価の、二重に帯電した","english_definition":"Having a double electric charge; possessing a charge of +2 or -2.","examples":[{"sentence":"The twice-charged ion was detected by the mass spectrometer.","translation":"その二価のイオンは質量分析計によって検出された。"},{"sentence":"Twice-charged calcium ions are essential for many biological processes.","translation":"二価のカルシウムイオンは多くの生物学的プロセスに不可欠である。"}],"collocations":["twice-charged ion","twice-charged particle","twice-charged cation","twice-charged anion"],"synonyms":["doubly charged","divalent","bivalent"],"antonyms":["singly charged","monovalent"]}],"etymology":{"value":"The term is formed by combining \"twice\" (meaning two times) with \"charged\" (meaning having an electrical charge).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌtwaɪsˈtʃɑːrdʒd/","syllables":"twice-charged"},"inflection":{"notes":"This is an adjective, so it does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"\"Twice-charged\" is a term primarily used in chemistry and physics to describe ions or particles that have either lost or gained two electrons, resulting in a charge of +2 or -2, respectively. It's often used in the context of mass spectrometry, ion channels, and other scientific applications involving charged particles.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The atom was twice charge.","correct":"✓ The atom was twice-charged.","note":"The correct form is \"twice-charged\" (adjective). \"Twice charge\" is grammatically incorrect."},{"incorrect":"✗ The twice charged ion are stable.","correct":"✓ The twice-charged ion is stable.","note":"Ensure subject-verb agreement. If referring to a single ion, use \"is\"."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["ion","charge","cation","anion","divalent","mass spectrometry","electrochemistry"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency. Primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"twice-charged\" is a technical term mainly used in scientific fields like chemistry and physics. It describes an ion or particle that has either lost or gained two electrons, giving it a charge of +2 or -2. Understanding this term requires some background knowledge in basic chemistry and physics concepts such as ions, charges, and valence. It is not commonly used in everyday language.","priority":"★★☆"},"example_sentences":[{"sentence":"The mass spectrometer can detect twice-charged ions with high precision.","translation":"その質量分析計は二価のイオンを高精度で検出できる。","type":"general","meaning_category":"scientific"},{"sentence":"The stability of the twice-charged cation is influenced by its electronic configuration.","translation":"その二価の陽イオンの安定性は、その電子配置に影響される。","type":"general","meaning_category":"scientific"}]}