{"word":"sedimentation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"沈殿、沈降、堆積","english_definition":"The process of settling or being deposited as a sediment.","examples":[{"sentence":"Sedimentation is a key process in the formation of sedimentary rocks.","translation":"沈殿は堆積岩の形成における重要な過程です。"},{"sentence":"The sedimentation of silt in the river is causing problems for navigation.","translation":"川のシルトの沈殿が航行上の問題を引き起こしています。"},{"sentence":"We studied the rate of sedimentation in the lake.","translation":"私たちは湖における沈殿速度を研究しました。"}],"collocations":["rate of sedimentation (沈殿速度)","sedimentation basin (沈殿池)","sedimentation process (沈殿過程)","accelerated sedimentation (加速された沈殿)","sedimentation analysis (沈殿分析)"],"synonyms":["deposition","settling","precipitation","accumulation","lodgement"],"antonyms":["erosion","dissolution","suspension"]}],"etymology":{"value":"From the Late Latin 'sedimentationem', noun of action from past participle of 'sedimentare' (to settle), from 'sedimentum' (sediment).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɛdɪmɛnˈteɪʃən/","syllables":"sed-i-men-ta-tion"},"inflection":{"noun_plural":"sedimentations (rarely used)"},"usage_notes":{"explanation":"'Sedimentation' refers to the process by which solid particles settle out of a liquid or gas due to gravity. It is a fundamental process in geology, environmental science, and engineering. It is often used in the context of water treatment, where it is used to remove suspended solids from water.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The sedimentation was eroded by the wind.","correct":"✓ The sediment was eroded by the wind.","note":"'Sedimentation' is the process of settling, while 'sediment' is the material that has settled. Wind erodes sediment, not the process of sedimentation itself."},{"incorrect":"✗ Sedimentation is when the water dissolves the rocks.","correct":"✓ Sedimentation is when the particles settle out of the water.","note":"Sedimentation is the settling of particles, not the dissolving of rocks. Dissolving is a different process."}],"priority":"★★☆"},"related_words":{"derivatives":["sediment (noun: 沈殿物、堆積物)","sedimentary (adjective: 堆積性の)","sedimentologist (noun: 堆積学者)","sedimentology (noun: 堆積学)","sedate (verb: 沈殿させる、落ち着かせる)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency. Technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sedimentation' is a technical term referring to the process where solid particles settle out of a liquid or gas due to gravity. It's commonly used in scientific and engineering contexts, such as geology (formation of sedimentary rocks), environmental science (water treatment), and civil engineering (design of sedimentation basins). The word implies a gradual accumulation of material at the bottom of a liquid or gas. It is not typically used in everyday conversation."},"example_sentences":[{"sentence":"The **sedimentation** of organic matter at the bottom of the lake created a rich environment for aquatic life.","translation":"湖底における有機物の沈殿は、水生生物にとって豊かな環境を作り出しました。","type":"noun","meaning_category":"沈殿"},{"sentence":"The city's water treatment plant uses **sedimentation** to remove impurities from the drinking water supply.","translation":"市の浄水場は、飲料水から不純物を取り除くために沈殿を利用しています。","type":"noun","meaning_category":"沈殿"},{"sentence":"Geologists study **sedimentation** patterns to understand the history of the Earth's surface.","translation":"地質学者は、地球の表面の歴史を理解するために沈殿パターンを研究します。","type":"noun","meaning_category":"沈殿"}]}