{"word":"succubous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"サキュバス（夢魔）に関する、またはサキュバスのような","english_definition":"Relating to or resembling a succubus.","examples":[{"sentence":"The painting had a succubous quality, both alluring and terrifying.","translation":"その絵は魅惑的でありながら恐ろしい、サキュバスのような性質を持っていた。"},{"sentence":"He described the nightmare as a succubous visitation.","translation":"彼はその悪夢をサキュバスの訪問だと表現した。"}],"collocations":["succubous dream","succubous figure","succubous nightmare"],"synonyms":["incubous (related, but referring to incubi)","demonic","seductive","alluring","nightmarish"],"antonyms":[]}],"etymology":{"value":"Derived from 'succubus', a demon in female form believed to have sexual intercourse with men in their sleep. The suffix '-ous' indicates 'having the quality of' or 'resembling'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsʌkjʊbəs/","syllables":"suc-cu-bous"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be used in comparative and superlative forms (more succubous, most succubous) although this is rare."},"usage_notes":{"explanation":"The term 'succubous' is relatively rare and primarily used in literary or fantastical contexts. It describes something that possesses qualities associated with a succubus, such as being seductive, alluring, or nightmarish. It is often used metaphorically.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She was succubous of success.","correct":"✓ (This is not a typical usage. Consider: She was obsessed with success.)","note":"'Succubous' is not typically used to describe someone who is 'possessed by' or 'obsessed with' something, but rather to describe something that has the qualities of a succubus."}],"priority":"★☆☆"},"related_words":{"derivatives":["succubus (noun: a female demon believed to have sexual intercourse with sleeping men)"],"phrases":["succubous attack","succubous entity"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Succubous' is a rare and specialized term, primarily found in literature, fantasy, or discussions of mythology and folklore. Understanding requires familiarity with the concept of a succubus. The word is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The forest at night had a succubous atmosphere, drawing travelers in with its deceptive beauty.","translation":"夜の森は、その欺瞞的な美しさで旅人を引き込む、サキュバスのような雰囲気を持っていた。","type":"adjective","meaning_category":"relating to succubus"},{"sentence":"Her succubous charm made him forget all his responsibilities.","translation":"彼女のサキュバスのような魅力は、彼にすべての責任を忘れさせた。","type":"adjective","meaning_category":"resembling succubus"}]}