{"word":"deratting","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"駆除、ネズミ駆除","english_definition":"The process of eliminating rats from a building or area.","examples":[{"sentence":"The restaurant was closed for deratting after a rat infestation.","translation":"そのレストランはネズミの大量発生後、駆除のために閉鎖された。"},{"sentence":"Regular deratting is essential for maintaining hygiene in food storage facilities.","translation":"定期的な駆除は、食品保管施設の衛生を維持するために不可欠である。"}],"collocations":["carry out deratting (駆除を行う)","professional deratting (専門業者による駆除)","deratting certificate (駆除証明書)"],"synonyms":["rat control","pest control","rodent control","extermination"],"antonyms":["rat infestation"]},{"part_of_speech":"verb","definition":"(ネズミを)駆除する","english_definition":"To eliminate rats from a building or area.","examples":[{"sentence":"The building owner hired a company to derat the premises.","translation":"建物の所有者は、敷地内のネズミを駆除するために業者を雇った。"},{"sentence":"We need to derat this area before we can start construction.","translation":"建設を開始する前に、この地域を駆除する必要がある。"}],"collocations":["derat a building (建物を駆除する)","derat an area (地域を駆除する)"],"synonyms":["exterminate rats","eliminate rats","control rats","remove rats"],"antonyms":["allow rats to infest"]}],"etymology":{"value":"'Derat' (to rid of rats) + '-ing'. 'Derat' itself comes from 'de-' (removal) + 'rat'.","priority":"★★☆"},"pronunciation":{"ipa":"/diːˈrætɪŋ/","syllables":"de-rat-ting"},"inflection":{"noun_plural":"derattings (まれに、駆除作業の複数回を指す場合)","verb_forms":{"present_simple":["derat","derats"],"past_simple":"deratted","past_participle":"deratted","present_participle":"deratting"}},"usage_notes":{"explanation":"'Deratting' refers specifically to the process of eliminating rats. While 'pest control' is a broader term that includes the control of various pests, 'deratting' is focused solely on rats. It is often used in contexts related to public health, food safety, and building maintenance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ We need to do a pest control for rats.","correct":"✓ We need to do deratting. / ✓ We need to do pest control for rats.","note":"'Deratting' is specifically for rats, so using 'pest control' and specifying 'for rats' is redundant unless you are talking about a broader pest control effort that includes rats."},{"incorrect":"✗ The deratting was very effective, there are no more pest.","correct":"✓ The deratting was very effective, there are no more rats.","note":"'Deratting' specifically targets rats, not all pests. If you want to say there are no more pests in general, use 'pest control' and 'pests'."}],"priority":"★★☆"},"related_words":{"derivatives":["derat (verb: 駆除する)","deratted (adjective: 駆除済みの)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な語彙。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Deratting' is a specialized term referring to the process of eliminating rats from a specific area or building. It is commonly used in contexts related to public health, sanitation, and pest management. Understanding this term is useful in fields such as environmental health, food safety, and building maintenance. The word implies a targeted effort specifically aimed at controlling rat populations, distinguishing it from broader pest control measures."},"example_sentences":[{"sentence":"The city council implemented a new deratting program to reduce the rat population.","translation":"市議会はネズミの個体数を減らすために、新しい駆除プログラムを実施した。","type":"noun","meaning_category":"駆除"},{"sentence":"All food establishments are required to undergo regular deratting inspections.","translation":"すべての食品施設は、定期的な駆除検査を受けることが義務付けられている。","type":"noun","meaning_category":"駆除"},{"sentence":"The landlord decided to derat the apartment building after several tenants reported seeing rats.","translation":"家主は、数人のテナントがネズミを見たと報告した後、アパートの駆除を決定した。","type":"verb","meaning_category":"駆除する"},{"sentence":"The effectiveness of the deratting operation was assessed by monitoring the number of rats caught in traps.","translation":"駆除作戦の有効性は、罠で捕獲されたネズミの数を監視することによって評価された。","type":"noun","meaning_category":"駆除"}]}