{"word":"sawfly","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(昆虫) ハバチ","english_definition":"A type of insect in the suborder Symphyta of the order Hymenoptera, related to wasps and ants, but with a broad connection between the abdomen and thorax. The larvae are mostly herbivorous and resemble caterpillars.","examples":[{"sentence":"The rose bushes were infested with sawfly larvae.","translation":"バラの茂みはハバチの幼虫に侵されていた。"},{"sentence":"Sawflies can cause significant damage to forests.","translation":"ハバチは森林に重大な損害を与える可能性がある。"}],"collocations":["sawfly larvae","sawfly infestation","pine sawfly","rose sawfly"],"synonyms":["symphytan"],"antonyms":[]}],"etymology":{"value":"The name \"sawfly\" comes from the saw-like ovipositor that the female uses to cut into plants when laying eggs.","priority":"★★☆"},"pronunciation":{"ipa":"ˈsɔːflaɪ","syllables":"saw-fly"},"inflection":{"noun_plural":"sawflies"},"usage_notes":{"explanation":"Sawflies are often mistaken for caterpillars due to the similar appearance of their larvae. However, sawfly larvae have more prolegs (fleshy, leg-like structures) than caterpillars.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a saw fly in the garden.","correct":"✓ I saw a sawfly in the garden.","note":"\"Saw fly\" (two words) could be misinterpreted as seeing a saw (tool) flying. \"Sawfly\" (one word) is the insect."}],"priority":"★★☆"},"related_words":{"derivatives":["symphyta"],"phrasal_verbs":[],"related_species":["pine sawfly","rose sawfly","pear slug sawfly"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"sawfly\" refers to a specific type of insect. Understanding its meaning requires some knowledge of entomology. The term is not commonly used in everyday conversation.","priority":"★☆☆"},"example_sentences":[{"sentence":"The leaves of the birch tree were being eaten by sawfly larvae.","translation":"カバの木の葉はハバチの幼虫に食べられていた。","type":"noun","meaning_category":"insect"},{"sentence":"Different species of sawfly target different types of plants.","translation":"ハバチの種によって、標的とする植物の種類が異なる。","type":"noun","meaning_category":"insect"}]}