{"word":"reedily","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"葦のように、葦のような音で","english_definition":"In a reedy manner; with a tone resembling that of a reed instrument.","examples":[{"sentence":"The oboe sounded reedily in the orchestra.","translation":"オーケストラの中でオーボエが葦のような音色を響かせた。"},{"sentence":"The old saxophone played reedily, its pads worn and leaky.","translation":"古いサックスは、パッドがすり減り、隙間だらけで、葦のような音を立てて演奏された。"}],"collocations":["sound reedily","play reedily"],"synonyms":["thinly","shrilly","nasally"],"antonyms":["richly","fully","resonantly"]}],"etymology":{"value":"Derived from 'reedy' + '-ly'. 'Reedy' comes from 'reed' (a tall, slender-leaved plant of the grass family) + '-y' (forming adjectives).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈriːdɪli/","syllables":"ree-di-ly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"The adverb 'reedily' describes something done in a way that resembles the sound or quality of a reed instrument, such as an oboe or clarinet. It often implies a thin, slightly nasal, or sometimes shrill tone. It is not a commonly used word, but it is useful for describing specific qualities of sound.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The singer sang reedily, but with great power.","correct":"The singer sang powerfully, but with a reedy tone.","note":"'Reedily' describes the quality of the sound, not the manner of singing. It's better to use it to describe the tone itself."},{"incorrect":"The grass grew reedily along the riverbank.","correct":"The grass grew thickly along the riverbank.","note":"'Reedily' is used for sound, not for describing the manner of growth. 'Thickly' or 'densely' would be more appropriate for describing how grass grows."}],"priority":"★★☆"},"related_words":{"derivatives":["reedy (adjective)","reed (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Reedily' is a somewhat uncommon adverb used to describe a sound that is thin, nasal, or like that of a reed instrument. It's most often used in descriptions of music or voices. Because it is not frequently used, it is considered a more advanced vocabulary word."},"example_sentences":[{"sentence":"The clarinet played the solo reedily, its high notes almost piercing.","translation":"クラリネットはソロを葦のような音色で奏で、その高い音はほとんど突き刺すようだった。","type":"adverb","meaning_category":"葦のような音で"},{"sentence":"The old recording captured the singer's voice reedily, highlighting its nasal quality.","translation":"古い録音は、歌手の声を葦のように捉え、その鼻にかかった音質を際立たせた。","type":"adverb","meaning_category":"葦のような音で"}]}