{"word":"Exteriorization","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"外在化、外面化、外化","english_definition":"The act of expressing or representing something abstract or internal in an external or tangible form; the process of making something subjective objective.","examples":[{"sentence":"The exteriorization of his inner turmoil was evident in his art.","translation":"彼の内面の葛藤の外在化は彼の芸術に明らかだった。"},{"sentence":"Through therapy, she achieved exteriorization of her feelings, allowing her to better understand them.","translation":"セラピーを通して、彼女は自分の感情の外在化を達成し、より良く理解できるようになった。"},{"sentence":"The author used vivid imagery to achieve the exteriorization of the character's thoughts.","translation":"著者は鮮やかなイメージを使って、登場人物の思考の外在化を達成した。"}],"collocations":["exteriorization of feelings","exteriorization of thoughts","exteriorization of trauma","achieve exteriorization","facilitate exteriorization"],"synonyms":["externalization","objectification","manifestation","embodiment","expression"],"antonyms":["internalization","subjectification"]},{"part_of_speech":"noun","definition":"（心理学）外面化：問題や感情を自分自身から切り離して認識するセラピー技法","english_definition":"(Psychology) A therapeutic technique in which a person is encouraged to perceive problems or emotions as external to themselves.","examples":[{"sentence":"Exteriorization helps clients to see their problems as separate from their identity.","translation":"外面化は、クライアントが自分の問題を自分のアイデンティティとは切り離して認識するのに役立つ。"},{"sentence":"In narrative therapy, exteriorization is used to reduce feelings of shame and blame.","translation":"ナラティブセラピーでは、外面化は恥や罪悪感を軽減するために使用される。"},{"sentence":"By using exteriorization, the therapist helped the client to take control over the problem.","translation":"外面化を使うことで、セラピストはクライアントが問題に対するコントロールを取り戻すのを助けた。"}],"collocations":["narrative therapy exteriorization","exteriorization techniques","problem exteriorization","therapeutic exteriorization"],"synonyms":["externalizing","separating","distancing"],"antonyms":["identification","assimilation"]}],"etymology":{"value":"Formed from 'exterior' (from Latin 'exterius', meaning 'outer') + '-ize' (suffix denoting a process or action) + '-ation' (suffix denoting a state or result).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪkˌstɪəriəraɪˈzeɪʃən/","syllables":"ex-te-ri-or-i-za-tion"},"inflection":{"noun_plural":"Exteriorizations"},"usage_notes":{"explanation":"'Exteriorization' refers to the process of making something internal (like thoughts, feelings, or problems) external or tangible. It can describe the general act of expressing something, or a specific therapeutic technique used in psychology. In therapy, it helps individuals separate themselves from their problems, viewing them as external entities that can be addressed.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The exteriorization of the building was impressive.","correct":"✓ The exterior of the building was impressive.","note":"'Exteriorization' refers to making something internal external, not the external appearance of a building. Use 'exterior' for the outer surface or appearance. "},{"incorrect":"✗ He used exteriorization to keep his feelings inside.","correct":"✓ He used suppression to keep his feelings inside.","note":"'Exteriorization' is about expressing feelings, not suppressing them. 'Suppression' or 'internalization' would be the opposite."}],"priority":"★★☆"},"related_words":{"derivatives":["exteriorize (verb)","externalization (noun)","externalize (verb)"],"phrasal_verbs":[],"related_concepts":["narrative therapy","psychology","expression","objectification","subjective","objective"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Exteriorization' is a complex term primarily used in psychology and philosophy. It refers to the process of making internal thoughts, feelings, or problems external or tangible. This can involve expressing emotions through art, or, in therapy, separating a person from their problems to view them as external entities. The word is not commonly used in everyday conversation and is more likely to appear in academic or therapeutic contexts."},"example_sentences":[{"sentence":"The artist's paintings were a powerful exteriorization of her grief.","translation":"その画家の絵は、彼女の悲しみの強力な外在化だった。","type":"general","meaning_category":"expression"},{"sentence":"Exteriorization in narrative therapy helps clients to redefine their relationship with their problems.","translation":"ナラティブセラピーにおける外面化は、クライアントが自分の問題との関係を再定義するのに役立つ。","type":"psychology","meaning_category":"therapeutic technique"},{"sentence":"The play was an attempt at the exteriorization of abstract philosophical concepts.","translation":"その劇は、抽象的な哲学概念の外在化の試みだった。","type":"general","meaning_category":"representation"}]}