{"word":"Allottee","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"割当を受けた人、配当を受けた人、割り当てられた人","english_definition":"A person to whom something has been allotted, assigned, or distributed.","examples":[{"sentence":"The allottees of the new housing project were excited to receive their keys.","translation":"新しい住宅プロジェクトの割当を受けた人々は、鍵を受け取るのを楽しみにしていました。"},{"sentence":"Each allottee received a portion of the company's shares.","translation":"各割当を受けた人は、会社の株式の一部を受け取りました。"},{"sentence":"The allottees were required to attend an orientation session.","translation":"割当を受けた人々は、オリエンテーションに参加する必要がありました。"}],"collocations":["share allottee (株式割当を受けた人)","land allottee (土地割当を受けた人)","housing allottee (住宅割当を受けた人)"],"synonyms":["recipient","beneficiary","grantee","assignee","awardee"],"antonyms":["allotter","assignor","distributor"]}],"etymology":{"value":"The word \"allottee\" is derived from the verb \"allot,\" which comes from the Old French word \"aloter\" meaning \"to divide into lots.\" The suffix \"-ee\" indicates the person who receives the action of the verb.","priority":"★★☆"},"pronunciation":{"ipa":"/əˌlɒˈtiː/","syllables":"al-lot-tee"},"inflection":{"noun_plural":"allottees"},"usage_notes":{"explanation":"The term \"allottee\" is typically used in formal or legal contexts to refer to someone who has been officially granted or assigned something, such as land, shares, or housing. It emphasizes the formal process of allocation or distribution.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The allotter received the land.","correct":"✓ The allottee received the land.","note":"\"Allotter\" is the person who assigns or distributes, while \"allottee\" is the person who receives the allotment."}],"priority":"★★☆"},"related_words":{"derivatives":["allot (verb)","allotment (noun)"],"related_terms":["allocate","assignment","distribution","grant","award"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'allottee' is a formal term referring to someone who has been officially given or assigned something, such as land, shares, or housing. It is typically used in legal or administrative contexts. Understanding this word requires a good grasp of formal vocabulary and the concept of allocation or assignment."},"example_sentences":[{"sentence":"The names of the successful allottees were published on the company website.","translation":"割り当てに成功した人々の名前は、会社のウェブサイトに掲載されました。","type":"noun","meaning_category":"割当を受けた人"},{"sentence":"As an allottee, you are entitled to certain rights and privileges.","translation":"割当を受けた人として、あなたはある種の権利と特権を与えられています。","type":"noun","meaning_category":"割当を受けた人"},{"sentence":"The government provided assistance to the land allottees to help them develop their plots.","translation":"政府は、土地の割当を受けた人々が区画を開発するのを支援するために援助を提供しました。","type":"noun","meaning_category":"割当を受けた人"}]}