{"word":"transfusion-inclined","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"輸血を好む、または輸血を必要とする傾向がある","english_definition":"Having a tendency to favor or require blood transfusions.","examples":[{"sentence":"The patient's condition was worsening, making them transfusion-inclined.","translation":"患者の状態が悪化しており、輸血を必要とする傾向がありました。"},{"sentence":"Due to the severity of the anemia, the doctor considered the patient transfusion-inclined.","translation":"貧血の重症度のため、医師は患者が輸血を必要とする傾向にあると考えました。"}],"collocations":["become transfusion-inclined","consider someone transfusion-inclined"],"synonyms":["transfusion-dependent","likely to need transfusion"],"antonyms":["transfusion-averse","unlikely to need transfusion"]}],"etymology":{"value":"Combination of 'transfusion' (the process of transferring blood or blood products into a person's circulation intravenously) and 'inclined' (having a tendency or disposition towards something).","priority":"N/A"},"pronunciation":{"ipa":"/trænsˈfjuːʒən ɪnˌklaɪnd/","syllables":"trans-fu-sion in-clined"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"This term is used in medical contexts to describe a patient or condition that is likely to require blood transfusions. It indicates a predisposition or necessity for transfusion due to factors such as anemia, blood loss, or other medical conditions.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["transfusion","inclined"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, specific to medical contexts.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"The term 'transfusion-inclined' is a specialized medical term. It describes a situation where a patient is likely to require blood transfusions due to their medical condition. This term is generally used by medical professionals and may not be widely understood by the general public."},"example_sentences":[{"sentence":"Patients with severe aplastic anemia are often transfusion-inclined to manage their low blood counts.","translation":"重度の再生不良性貧血の患者は、低い血球数を管理するために輸血を必要とする傾向があります。","type":"adjective","meaning_category":"輸血を好む、または輸血を必要とする傾向がある"}]}