{"word":"Gallinaceae","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"キジ目キジ科の鳥類の総称","english_definition":"The taxonomic family of heavy ground-feeding birds that includes turkeys, chickens, grouse, quail, and pheasants.","examples":[{"sentence":"The Gallinaceae are known for their strong legs and ability to forage on the ground.","translation":"キジ科の鳥類は、その強い脚と地上での採餌能力で知られています。"}],"collocations":["Gallinaceous birds","Gallinaceae family","Members of Gallinaceae"],"synonyms":["Phasianidae","Chicken-like birds","Gamefowl"],"antonyms":[]}],"etymology":{"value":"Derived from Latin 'gallina' meaning 'hen' or 'chicken', and '-aceae' a standard suffix used in biological nomenclature to form the name of a family.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɡælɪˈneɪʃiː/","syllables":"Gal-li-na-ce-ae"},"inflection":{"noun_plural":"Gallinaceaes or Gallinaceae (often used as a collective plural)"},"usage_notes":{"explanation":"'Gallinaceae' is a scientific term used in biology and zoology to classify a specific family of birds. It is typically used in formal or academic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Gallinaceae is a bird.","correct":"✓ A Gallinaceous bird is a bird.","note":"'Gallinaceae' refers to the entire family, not a single bird. Use 'Gallinaceous bird' to refer to an individual member."}],"priority":"★☆☆"},"related_words":{"derivatives":["Gallinaceous (adjective: relating to or belonging to the Gallinaceae)"],"phrases":["Order Galliformes (キジ目)","Family Phasianidae (キジ科)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Primarily used in scientific or academic texts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Gallinaceae' is a scientific term used to classify a family of birds. It is not commonly used in everyday language and is typically found in biological or zoological contexts. Understanding this term requires familiarity with scientific nomenclature and taxonomy."},"example_sentences":[{"sentence":"The study focused on the dietary habits of various species within the Gallinaceae family.","translation":"その研究は、キジ科のさまざまな種の食性習慣に焦点を当てていた。","type":"general","meaning_category":"キジ科の鳥類"},{"sentence":"Many members of the Gallinaceae are popular game birds.","translation":"キジ科の多くの種は人気の狩猟鳥である。","type":"general","meaning_category":"キジ科の鳥類"}]}