{"word":"amphophilic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"両親媒性の、親水性と疎水性の両方の性質を持つ","english_definition":"Having both hydrophilic (water-attracting) and hydrophobic (water-repelling) properties.","examples":[{"sentence":"Amphophilic molecules are crucial for the formation of micelles and liposomes.","translation":"両親媒性分子は、ミセルやリポソームの形成に不可欠です。"},{"sentence":"Soaps are amphophilic compounds that can emulsify fats in water.","translation":"石鹸は、水中で脂肪を乳化できる両親媒性化合物です。"}],"collocations":["amphophilic molecule","amphophilic polymer","amphophilic surfactant"],"synonyms":["amphipathic","surface-active"],"antonyms":["hydrophilic","hydrophobic"]}],"etymology":{"value":"Derived from the Greek words 'amphi' (meaning 'both' or 'double') and 'philic' (meaning 'loving' or 'attracting').","priority":"★★★"},"pronunciation":{"ipa":"/ˌæmfəˈfɪlɪk/","syllables":"am-pho-phil-ic"},"inflection":{"notes":"The word 'amphophilic' is an adjective and does not have different inflectional forms."},"usage_notes":{"explanation":"'Amphophilic' describes substances that are attracted to both water and oil (or fats). These substances are important in many biological and chemical processes, particularly in forming structures like cell membranes and in cleaning applications. The term is often used interchangeably with 'amphipathic', although 'amphiphilic' tends to emphasize the affinity for both types of solvents, while 'amphipathic' emphasizes the structural aspect of having distinct hydrophilic and hydrophobic regions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The amphophilic material repelled both water and oil.","correct":"✓ The amphophilic material attracted both water and oil (or at least one part attracted water and the other oil).","note":"Amphophilic materials attract both water and oil, they do not repel both. Repelling both would be hydrophobic. "},{"incorrect":"✗ Amphophilic is the same as hydrophilic.","correct":"✓ Amphophilic is different from hydrophilic; it has both hydrophilic and hydrophobic parts.","note":"Hydrophilic materials only attract water, while amphophilic materials attract both water and oil."}],"priority":"★★☆"},"related_words":{"derivatives":["amphiphile (noun): A molecule that is amphophilic.","amphiphilicity (noun): The property of being amphophilic."],"related_terms":["hydrophilic","hydrophobic","amphipathic","surfactant","micelle","liposome"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency, mainly used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Amphophilic' is a technical term used in chemistry, biology, and materials science. It describes molecules or substances that have both a part that attracts water (hydrophilic) and a part that repels water but attracts oils or fats (hydrophobic). These substances are important for creating stable mixtures of oil and water, like in soaps and detergents, and for forming biological structures like cell membranes. Understanding this term requires a background in basic chemistry or biology.","priority":"★★☆"},"example_sentences":[{"sentence":"The amphophilic nature of phospholipids allows them to form bilayers in cell membranes.","translation":"リン脂質の両親媒性により、細胞膜に二重層を形成することができます。","type":"scientific","meaning_category":"molecular biology"},{"sentence":"Amphophilic block copolymers can self-assemble into various nanostructures in solution.","translation":"両親媒性ブロック共重合体は、溶液中で様々なナノ構造に自己組織化することができます。","type":"chemistry","meaning_category":"polymer chemistry"},{"sentence":"The effectiveness of a detergent relies on its amphophilic properties to remove oily stains.","translation":"洗剤の有効性は、油性の汚れを除去するためのその両親媒性特性に依存しています。","type":"chemistry","meaning_category":"detergents"}]}