{"word":"DLitt","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"文学博士 (Doctor of Letters or Doctor of Literature)","english_definition":"A higher doctorate awarded by a university, usually on the basis of a substantial body of published work that makes an original contribution to scholarship. It is awarded in recognition of academic achievement and is higher than a PhD.","examples":[{"sentence":"She was awarded a DLitt for her contributions to the field of Victorian literature.","translation":"彼女はヴィクトリア朝文学の分野への貢献により文学博士号を授与された。"},{"sentence":"He holds a DLitt from Oxford University.","translation":"彼はオックスフォード大学の文学博士号を持っている。"}],"collocations":["award a DLitt","hold a DLitt","earn a DLitt","honorary DLitt"],"synonyms":["Doctor of Letters","Doctor of Literature"],"antonyms":[]}],"etymology":{"value":"Abbreviation of 'Doctor of Letters' or 'Doctor of Literature', from the Latin 'Doctor Litterarum'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdiːˈlɪt/","syllables":"Dee-Litt"},"inflection":{"noun_plural":"DLitts"},"usage_notes":{"explanation":"DLitt is an abbreviation for Doctor of Letters or Doctor of Literature. It is a higher doctorate, meaning it is a more advanced academic degree than a PhD. It is awarded by universities to scholars who have made significant and original contributions to their field of study, typically demonstrated through a substantial body of published work.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a DLitt degree in science.","correct":"✓ He has a DLitt degree in literature.","note":"DLitt is specifically for the humanities, particularly literature. A science doctorate would be a DSc (Doctor of Science)."},{"incorrect":"✗ She's doing her DLitt.","correct":"✓ She's working towards her DLitt. / ✓ She has a DLitt.","note":"One doesn't 'do' a DLitt in the same way as a PhD. It's awarded based on existing published work, so one 'works towards' it or 'has' it."}],"priority":"★★☆"},"related_words":{"derivatives":["DSc (Doctor of Science)","PhD (Doctor of Philosophy)","MA (Master of Arts)","BA (Bachelor of Arts)"],"phrases":["honorary degree","higher doctorate","academic degree","postgraduate qualification"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in academic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'DLitt' stands for Doctor of Letters or Doctor of Literature. It's a high-level academic degree, even higher than a PhD. Universities give it to people who have already done a lot of important research and writing in areas like literature, history, or languages. Getting a DLitt means someone is a real expert in their field and has made a big impact with their work. It's not something you 'study for' in the same way as a PhD; it's awarded based on the work you've already published."},"example_sentences":[{"sentence":"Professor Smith was awarded a DLitt in recognition of her lifelong dedication to the study of Shakespeare.","translation":"スミス教授は、シェイクスピア研究への生涯にわたる献身が認められ、文学博士号を授与されました。","type":"noun","meaning_category":"Academic Degree"},{"sentence":"Holding a DLitt is a testament to his significant contributions to the field of classical studies.","translation":"文学博士号を持っていることは、彼の古典研究分野への重要な貢献の証です。","type":"noun","meaning_category":"Academic Achievement"},{"sentence":"The university offers both PhD and DLitt programs in the humanities.","translation":"その大学は、人文学において博士号と文学博士号の両方のプログラムを提供しています。","type":"noun","meaning_category":"University Program"}]}