{"word":"self-flagellatingly","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"自己批判的に、自虐的に、自己を責めるように","english_definition":"In a self-flagellating manner; in a way that involves excessive self-criticism or self-punishment.","examples":[{"sentence":"He spoke self-flagellatingly about his past mistakes.","translation":"彼は過去の過ちについて自己批判的に語った。"},{"sentence":"She analyzed her performance self-flagellatingly, focusing only on her failures.","translation":"彼女は自分のパフォーマンスを自虐的に分析し、失敗だけに焦点を当てた。"}],"collocations":["speak self-flagellatingly","analyze self-flagellatingly","think self-flagellatingly"],"synonyms":["self-critically","self-reproachfully","remorsefully","penitently","contritely"],"antonyms":["complacently","smugly","self-satisfiedly","unrepentantly"]}],"etymology":{"value":"The word is derived from 'self-flagellating,' which combines 'self' (referring to oneself) with 'flagellating' (whipping or flogging, often as a form of religious penance). The '-ly' suffix turns it into an adverb.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌself flædʒəˈleɪtɪŋli/","syllables":"self-flag-el-lat-ing-ly"},"inflection":{"notes":"As an adverb, it does not have different forms for tense or number."},"usage_notes":{"explanation":"'Self-flagellatingly' describes the manner in which someone engages in excessive self-criticism or punishes themselves, either literally or figuratively. It often implies a harsh or exaggerated level of self-reproach. The term is relatively uncommon in everyday conversation but may be used in literary or psychological contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He felt self-flagellating.","correct":"✓ He felt self-flagellatingly remorseful.","note":"'Self-flagellating' is an adjective, so it needs a noun to modify. 'Self-flagellatingly' is an adverb and modifies a verb or adjective."},{"incorrect":"✗ She acted self-flagellating.","correct":"✓ She acted self-flagellatingly.","note":"'Self-flagellatingly' describes the manner of acting, so it's an adverb, not an adjective."}],"priority":"★★☆"},"related_words":{"derivatives":["self-flagellation (noun: the act of self-flagellating)","self-flagellating (adjective: characterized by self-flagellation)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'self-flagellatingly' is an adverb that describes doing something in a way that involves excessive self-criticism or self-punishment. It's a complex word that combines the idea of 'self' with 'flagellation,' which originally referred to whipping oneself for religious reasons. Now, it's mostly used to describe someone who is very hard on themselves. Because of its complexity and specific meaning, it's not commonly used and is more likely to appear in formal writing or discussions about psychology or behavior."},"example_sentences":[{"sentence":"The author wrote self-flagellatingly about his own shortcomings in the memoir.","translation":"その作家は回顧録の中で、自身の欠点について自虐的に書いた。","type":"adverb","meaning_category":"自己批判的に"},{"sentence":"After the project failed, she spoke self-flagellatingly about her leadership.","translation":"プロジェクトが失敗した後、彼女は自身のリーダーシップについて自己批判的に語った。","type":"adverb","meaning_category":"自己を責めるように"}]}