{"word":"TeX","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"組版処理システムTeX（テフ）","english_definition":"A typesetting system created by Donald Knuth.","examples":[{"sentence":"TeX is widely used in academia for typesetting mathematical formulas.","translation":"TeXは学術分野で数式を組版するために広く使用されています。"},{"sentence":"LaTeX is a macro package for TeX.","translation":"LaTeXはTeXのマクロパッケージです。"}],"collocations":["TeX document","TeX macro","TeX engine"],"synonyms":["LaTeX"],"antonyms":[]},{"part_of_speech":"verb","definition":"TeXで組版する","english_definition":"To typeset using TeX.","examples":[{"sentence":"I need to TeX this document before submitting it.","translation":"提出する前にこのドキュメントをTeXで組版する必要があります。"}],"collocations":["TeX a document"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word τέχνη (tékhnē), meaning 'art' or 'skill'. The 'X' is meant to resemble the Greek letter chi (χ), so the pronunciation is 'tekh'.","priority":"★★☆"},"pronunciation":{"ipa":"/tɛx/","syllables":"TeX"},"inflection":{"notes":"TeX is both a noun and a verb. There are no plural forms for the noun in the traditional sense, as it refers to a system. The verb form follows standard English verb conjugation rules."},"usage_notes":{"explanation":"TeX is a powerful typesetting system particularly well-suited for mathematical and scientific documents. It provides precise control over formatting and is known for producing high-quality output. LaTeX is a popular macro package built on top of TeX, simplifying the typesetting process.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used tex to write my paper.","correct":"✓ I used TeX to write my paper.","note":"The correct capitalization is TeX, with a capital 'T' and 'e', and a capital 'X'. It's not an acronym, but a name derived from Greek."},{"incorrect":"✗ I will latex the document.","correct":"✓ I will typeset the document using LaTeX. / ✓ I will TeX the document using LaTeX.","note":"While 'LaTeX' is often used, the verb form is less common. It's more common to say you are typesetting with LaTeX or using LaTeX."}],"priority":"★★☆"},"related_words":{"derivatives":["LaTeX (A document preparation system and markup language)","typesetting (The process of arranging text and images for printing)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily used in technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"TeX is a sophisticated typesetting system primarily used in academic and technical fields for creating high-quality documents, especially those containing complex mathematical formulas. While not a general-purpose word processor, it offers unparalleled control over document formatting. LaTeX, a macro package for TeX, simplifies the process for many users. Understanding TeX and LaTeX requires familiarity with markup languages and typesetting principles.","priority":"★★☆"},"example_sentences":[{"sentence":"Many scientific journals require submissions to be formatted using TeX or LaTeX.","translation":"多くの科学雑誌では、TeXまたはLaTeXでフォーマットされた投稿が必要です。","type":"noun","meaning_category":"typesetting system"},{"sentence":"He spent hours TeXing his dissertation.","translation":"彼は何時間もかけて自分の論文をTeXで組版した。","type":"verb","meaning_category":"typesetting"}]}