{"word":"auding","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(サイエントロジー) オーディティング、カウンセリングの一種","english_definition":"(Scientology) A form of counseling in Scientology, in which a person answers questions from an auditor in order to examine their past and address spiritual difficulties.","examples":[{"sentence":"Auditing is a central practice in Scientology.","translation":"オーディティングはサイエントロジーの中心的な実践です。"},{"sentence":"During auding, the individual recounts past experiences.","translation":"オーディティング中、個人は過去の経験を語ります。"}],"collocations":["receive auding","undergo auding","auditing session"],"synonyms":["counseling","therapy"],"antonyms":[]}],"etymology":{"value":"Derived from 'audit', meaning to conduct a systematic review or assessment. In Scientology, it refers to a process of spiritual examination.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɔːdɪŋ/","syllables":"Au-ding"},"inflection":{"noun_plural":"audings"},"usage_notes":{"explanation":"'Auditing' in Scientology is a unique term that should not be confused with financial auditing. It refers to a specific process of spiritual counseling within the context of Scientology.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is auditing the company's finances.","correct":"✓ He is auditing the company's accounts.","note":"In a financial context, use 'accounts' rather than 'finances'."},{"incorrect":"✗ She is going to auditing for her mental health.","correct":"✓ She is going to therapy for her mental health.","note":"'Auditing' specifically refers to Scientology. For general mental health help, use 'therapy'."}],"priority":"★★☆"},"related_words":{"derivatives":["audit","auditor","preclear"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Auditing' is a term primarily used within the context of Scientology. It refers to a specific counseling process aimed at spiritual betterment. Understanding this term requires familiarity with Scientology's terminology. It is not commonly used outside of this context.","priority":"★☆☆"},"example_sentences":[{"sentence":"The Scientologist participated in regular auding sessions.","translation":"そのサイエントロジストは定期的なオーディティングセッションに参加しました。","type":"noun","meaning_category":"Scientology counseling"},{"sentence":"Auditing aims to help individuals overcome spiritual barriers.","translation":"オーディティングは、個人が精神的な障壁を克服するのを助けることを目的としています。","type":"noun","meaning_category":"Scientology counseling"}]}