{"word":"polyglotwise","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"In a manner pertaining to or characteristic of a polyglot; with knowledge of or facility in multiple languages.","english_definition":"In a manner that demonstrates knowledge of or skill in multiple languages.","examples":[{"sentence":"Polyglotwise, she was the most impressive person I'd ever met; she could switch between five languages effortlessly.","translation":"多言語話者として、彼女は私が今まで会った中で最も印象的な人物でした。彼女は5つの言語を難なく切り替えることができました。"},{"sentence":"The software was designed to be polyglotwise, supporting input and output in a wide range of languages.","translation":"そのソフトウェアは多言語に対応できるように設計されており、幅広い言語での入出力をサポートしていました。"}],"collocations":["speak polyglotwise","designed polyglotwise","analyze polyglotwise"],"synonyms":["linguistically","multilingualistically"],"antonyms":["monolingually"]}],"etymology":{"value":"Formed by combining 'polyglot' (knowing or using several languages) with the suffix '-wise' (in the manner or direction of).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɒlɪˌɡlɒtwaɪz/","syllables":"pol-y-glot-wise"},"inflection":{"notes":"As an adverb, 'polyglotwise' does not have different inflections."},"usage_notes":{"explanation":"'Polyglotwise' is a relatively rare adverb used to describe something done or considered from the perspective of a polyglot, or in a way that demonstrates knowledge or skill in multiple languages. It's often used to highlight someone's linguistic abilities or to describe systems or approaches that accommodate multiple languages.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is polyglotwise.","correct":"✓ He speaks polyglotwise.","note":"'Polyglotwise' is an adverb, so it should modify a verb (e.g., 'speaks', 'analyzes') rather than stand alone as a description of a person. Use 'He is a polyglot' instead."},{"incorrect":"✗ The company is polyglotwise.","correct":"✓ The company operates polyglotwise.","note":"Similar to the previous example, use 'polyglotwise' to modify a verb describing how the company operates, rather than as a direct descriptor."}],"priority":"★★☆"},"related_words":{"derivatives":["polyglot (noun, adjective)","-wise (suffix indicating manner or direction)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - not commonly used.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Polyglotwise' is a specialized adverb that describes something done in a way that shows skill in multiple languages. It's not a common word, so it's more likely to be encountered in discussions about linguistics or language learning. Remember that it modifies a verb, describing how something is done, rather than directly describing a person or thing."},"example_sentences":[{"sentence":"She approached the translation task polyglotwise, considering the nuances of each language.","translation":"彼女は翻訳のタスクに、各言語のニュアンスを考慮して、多言語話者のように取り組みました。","type":"adverb","meaning_category":"manner of using multiple languages"},{"sentence":"The system was designed polyglotwise to support users from different linguistic backgrounds.","translation":"そのシステムは、さまざまな言語的背景を持つユーザーをサポートするために、多言語話者の視点から設計されました。","type":"adverb","meaning_category":"design approach"}]}