{"word":"cotenants","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"（不動産の）共有者、共同賃借人","english_definition":"Two or more parties who own or lease a property together.","examples":[{"sentence":"The cotenants were responsible for paying the rent together.","translation":"その共同賃借人たちは、家賃を一緒に支払う責任がありました。"},{"sentence":"The agreement outlined the rights and responsibilities of each of the cotenants.","translation":"その契約は、各共有者の権利と責任を概説していました。"},{"sentence":"Disputes among cotenants can sometimes lead to legal action.","translation":"共有者間の紛争は、時に訴訟につながることがあります。"}],"collocations":["joint tenants","tenants in common","lease agreement","property rights","rental agreement","shared responsibility"],"synonyms":["joint owners","co-lessees","co-possessors","joint holders"],"antonyms":["sole tenant","single owner"]},{"part_of_speech":"noun","definition":"（商業用不動産において）他のテナントと事業を補完し合うテナント","english_definition":"In commercial real estate, tenants whose businesses complement each other, attracting customers to the same location.","examples":[{"sentence":"The shopping center sought cotenants that would create a synergistic shopping experience.","translation":"そのショッピングセンターは、相乗効果のあるショッピング体験を生み出すようなテナントを探していました。"},{"sentence":"A coffee shop and a bookstore can be ideal cotenants in a retail space.","translation":"コーヒーショップと書店は、商業スペースにおいて理想的な共同テナントとなりえます。"},{"sentence":"The presence of strong cotenants can increase foot traffic for all businesses in the area.","translation":"強力な共同テナントの存在は、その地域のすべてのビジネスの通行量を増加させる可能性があります。"}],"collocations":["anchor tenant","synergistic relationship","retail space","shopping center","foot traffic","commercial lease"],"synonyms":["complementary businesses","neighboring tenants"],"antonyms":["competing businesses"]}],"etymology":{"value":"The word \"cotenant\" is formed by combining \"co-\" (meaning \"together\" or \"jointly\") with \"tenant\" (a person who occupies land or property rented from a landlord).","priority":"★★☆"},"pronunciation":{"ipa":"/koʊˈtɛnənts/","syllables":"co-ten-ants"},"inflection":{"noun_plural":"cotenants"},"usage_notes":{"explanation":"The term \"cotenants\" refers to multiple individuals or entities that share ownership or tenancy of a property. In residential contexts, it typically refers to joint renters or owners. In commercial real estate, it can also refer to businesses that benefit from being located near each other, creating a mutually beneficial environment. Understanding the specific context is important to correctly interpret the meaning.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The co-tenants was arguing about the rent.","correct":"✓ The cotenants were arguing about the rent.","note":"Since \"cotenants\" is plural, the verb should also be plural (were instead of was)."},{"incorrect":"✗ He is a cotenant of the building, meaning he owns it all.","correct":"✓ He is a cotenant of the building, meaning he shares ownership with others.","note":"A cotenant shares ownership or tenancy, rather than owning the entire property. The correction clarifies that he shares the ownership with others."}],"priority":"★★☆"},"related_words":{"derivatives":["cotenancy (名詞: 共同保有、共同賃借)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"cotenants\" refers to two or more people who jointly own or rent a property. This term is commonly used in legal and real estate contexts to describe shared responsibilities and rights among multiple tenants or owners. In commercial real estate, it can also refer to businesses that complement each other by attracting customers to the same location. Understanding the term is essential for anyone involved in property management, real estate law, or commercial leasing.","priority":"★★☆"},"example_sentences":[{"sentence":"The **cotenants** signed a joint lease agreement for the apartment.","translation":"その共同賃借人たちは、そのアパートの共同賃貸契約に署名しました。","type":"noun","meaning_category":"共同賃借人"},{"sentence":"The success of the shopping center depended on attracting compatible **cotenants**.","translation":"そのショッピングセンターの成功は、相性の良い共同テナントを誘致できるかどうかにかかっていました。","type":"noun","meaning_category":"商業用不動産における共同テナント"},{"sentence":"As **cotenants**, they were equally responsible for maintaining the property.","translation":"共同所有者として、彼らはその不動産の維持に等しく責任がありました。","type":"noun","meaning_category":"共有者"}]}