{"word":"Hercynian","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"ヘルシニア造山運動の、ヘルシニア地方の","english_definition":"Relating to the Hercynian orogeny or the Hercynian Forest.","examples":[{"sentence":"The Hercynian forest once covered a vast area of central Europe.","translation":"かつてヘルシニアの森は中央ヨーロッパの広大な地域を覆っていました。"},{"sentence":"Hercynian orogeny resulted in the formation of several mountain ranges.","translation":"ヘルシニア造山運動は、いくつかの山脈の形成をもたらしました。"}],"collocations":["Hercynian forest","Hercynian orogeny","Hercynian mountains"],"synonyms":["Variscan"],"antonyms":[]},{"part_of_speech":"noun","definition":"ヘルシニア造山運動","english_definition":"The Hercynian orogeny.","examples":[{"sentence":"The Hercynian was a major period of mountain building in Europe.","translation":"ヘルシニア造山運動は、ヨーロッパにおける主要な造山活動期でした。"}],"collocations":[],"synonyms":["Variscan orogeny"],"antonyms":[]}],"etymology":{"value":"Derived from 'Hercynia', the ancient name for a large forest region in central Europe, likely from a Celtic source.","priority":"★★★"},"pronunciation":{"ipa":"/hərˈsɪniən/","syllables":"Her-cyn-i-an"},"inflection":{"notes":"Adjective: Hercynian (comparative/superlative forms are rarely used). Noun: Hercynian (plural: Hercynians, but rarely used)."},"usage_notes":{"explanation":"'Hercynian' is primarily used in geological and historical contexts. It refers to the Hercynian Forest, an ancient forest, or the Hercynian orogeny, a mountain-building event in the late Paleozoic era.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Hercynian is a person from Germany.","correct":"✓ The Hercynian refers to a geological period or a forest.","note":"'Hercynian' does not refer to a person from Germany, although the Hercynian Forest was located in that region."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["orogeny","Variscan","Paleozoic","forest","mountain"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hercynian' is a specialized term primarily used in geology and historical geography. It refers to the Hercynian Forest, an ancient forest in central Europe, or the Hercynian orogeny, a significant mountain-building event in the late Paleozoic era. Due to its specific usage, it is considered an advanced vocabulary word."},"example_sentences":[{"sentence":"The Hercynian forest was a formidable barrier to Roman expansion.","translation":"ヘルシニアの森は、ローマの拡大に対する手ごわい障壁でした。","type":"adjective","meaning_category":"ヘルシニア地方の"},{"sentence":"The Hercynian orogeny shaped the landscape of much of Europe.","translation":"ヘルシニア造山運動は、ヨーロッパの多くの地域の地形を形作りました。","type":"noun","meaning_category":"ヘルシニア造山運動"}]}