{"word":"neume","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"（中世のグレゴリオ聖歌などで用いられた）音符、ネウマ譜","english_definition":"a note or group of notes to be sung to one syllable in Gregorian chant or other early music. Also, a system of notation using such symbols.","examples":[{"sentence":"The earliest neumes were simply indications of melodic direction.","translation":"初期のネウマは、単に旋律の方向を示すものでした。"},{"sentence":"The monks used neumes to preserve the melodies of their chants.","translation":"修道士たちは、聖歌の旋律を保存するためにネウマを使用しました。"},{"sentence":"Modern musical notation evolved from neumes.","translation":"現代の楽譜はネウマから発展しました。"}],"collocations":["Gregorian neumes","early neumes","square neumes","neume notation","neume script"],"synonyms":["musical notation","note","staff notation","chant notation"],"antonyms":[]}],"etymology":{"value":"From Middle English *newme*, from Old French *neume*, from Latin *neuma*, from Ancient Greek *πνεῦμα* (pneûma, “breath”). The musical sense developed from the idea that the notes represented the 'breath' of the music.","priority":"★★☆"},"pronunciation":{"ipa":"/njuːm/","syllables":"neume"},"inflection":{"noun_plural":"neumes"},"usage_notes":{"explanation":"A *neume* is a symbol used in the notation of Gregorian chant and other early forms of Western music. Unlike modern musical notation, neumes do not indicate precise pitches or rhythms, but rather the melodic contour and relative duration of notes within a phrase. They are an important part of music history and the development of musical notation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He wrote a poem in neumes.","correct":"✓ He wrote a poem.","note":"Neumes are specific to musical notation, not poetry. Use 'poem' for a written work with rhythm and rhyme."},{"incorrect":"✗ I played the neume on the piano.","correct":"✓ I played the melody on the piano.","note":"Neumes are notations, not instruments or melodies themselves. You play a melody that is written using neumes."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Gregorian chant","notation","musicology","paleography","staff notation","mensural notation"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"neume\" refers to a notation system used in early Western music, particularly Gregorian chant. It's a specialized term within musicology and historical music studies, indicating symbols that represent melodic contours rather than precise pitches. Understanding requires familiarity with music history and notation practices.","priority":"★☆☆"},"example_sentences":[{"sentence":"The musicologist studied the ancient manuscript filled with neumes.","translation":"音楽学者はネウマで埋め尽くされた古代の写本を研究しました。","type":"noun","meaning_category":"musical notation"},{"sentence":"Early neumes indicated the direction of the melody, not the exact notes.","translation":"初期のネウマは、正確な音符ではなく、旋律の方向を示していました。","type":"noun","meaning_category":"musical notation"},{"sentence":"The choir sang the Gregorian chant from a score written in neumes.","translation":"聖歌隊はネウマで書かれた楽譜からグレゴリオ聖歌を歌いました。","type":"noun","meaning_category":"musical notation"}]}