{"word":"Monarchian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"君主主義の、一位神論の","english_definition":"Relating to Monarchianism, a Christian theological belief that emphasizes the oneness of God, in contrast to Trinitarianism.","examples":[{"sentence":"The Monarchian view of God was considered heretical by some early church fathers.","translation":"神に対する君主主義的な見解は、初期の教父の一部によって異端とみなされた。"}],"collocations":["Monarchian theology","Monarchian doctrine","Monarchian controversy"],"synonyms":["Unitarian","anti-Trinitarian"],"antonyms":["Trinitarian"]},{"part_of_speech":"noun","definition":"君主主義者、一位神論者","english_definition":"A proponent of Monarchianism.","examples":[{"sentence":"The Monarchians sought to defend the unity of God against what they saw as Trinitarian divisions.","translation":"君主主義者たちは、三位一体論的な分裂と彼らがみなしたことに対して、神の統一性を擁護しようとした。"}],"collocations":["early Monarchians","influential Monarchians"],"synonyms":["Unitarian","anti-Trinitarian"],"antonyms":["Trinitarian"]}],"etymology":{"value":"From the Greek words 'monos' (single, alone) and 'arche' (rule, principle), reflecting the belief in the sole sovereignty and unity of God.","priority":"★★☆"},"pronunciation":{"ipa":"/məˈnɑːrkiən/","syllables":"mo-nar-ki-an"},"inflection":{"notes":"Adjective: comparative/superlative forms are possible (more Monarchian, most Monarchian), but rarely used. Noun: plural is Monarchians."},"usage_notes":{"explanation":"'Monarchian' refers to a specific theological position within early Christianity. It's important to distinguish it from general monotheism. Monarchianism specifically addresses the nature of Christ and the Trinity, emphasizing God's indivisible unity. It's a term primarily used in theological and historical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a monarchian of England.","correct":"✓ He was a monarchist of England.","note":"'Monarchian' is a theological term, while 'monarchist' refers to someone who supports a monarchy as a form of government."}],"priority":"★☆☆"},"related_words":{"derivatives":["Monarchianism (noun: the theological doctrine)","Monarchist (noun: supporter of monarchy)","Monarchy (noun: a form of government with a monarch)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency. A specialized term used in theology and religious history.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Monarchian' is a specialized term primarily encountered in the context of Christian theology and church history. Understanding it requires familiarity with debates surrounding the Trinity and early Christian doctrines. It's not a word commonly used in everyday conversation."},"example_sentences":[{"sentence":"The historical study focused on the various Monarchian movements in the early centuries of Christianity.","translation":"その歴史研究は、キリスト教の初期の数世紀における様々な君主主義運動に焦点を当てた。","type":"adjective","meaning_category":"theological"},{"sentence":"Some scholars argue that certain biblical passages support a Monarchian interpretation of God.","translation":"一部の学者は、特定の聖書の箇所が神の君主主義的な解釈を支持すると主張している。","type":"adjective","meaning_category":"theological"},{"sentence":"The writings of the early Monarchians provide insight into the development of Trinitarian doctrine.","translation":"初期の君主主義者たちの著作は、三位一体論の発展に対する洞察を提供する。","type":"noun","meaning_category":"theological"}]}