{"word":"non-degeneracy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"非退化性：数学や物理学において、ある対象（例えば、行列、関数、エネルギー準位など）が退化していない状態を指す。退化とは、複数の異なる状態が同じ値を持つことを意味し、非退化はその逆の状態を指す。","english_definition":"The state of not being degenerate; in mathematics and physics, it refers to the condition where an object (e.g., a matrix, a function, an energy level) is not degenerate. Degeneracy means that multiple distinct states have the same value, while non-degeneracy is the opposite.","examples":[{"sentence":"The non-degeneracy of the matrix ensures that the system of equations has a unique solution.","translation":"その行列の非退化性により、方程式系は一意の解を持つことが保証される。"},{"sentence":"In quantum mechanics, the non-degeneracy of energy levels is often lifted by perturbations.","translation":"量子力学において、エネルギー準位の非退化性はしばしば摂動によって解消される。"}],"collocations":["non-degeneracy condition (非退化条件)","non-degenerate matrix (非退化行列)","non-degenerate energy level (非退化エネルギー準位)","ensure non-degeneracy (非退化性を保証する)","lift non-degeneracy (非退化性を解消する)"],"synonyms":["non-degeneration","invertibility (for matrices)","distinctness"],"antonyms":["degeneracy","degeneration"],"related_terms":["degenerate","degeneracy","matrix","linear independence","eigenvalue","eigenvector","quantum mechanics","perturbation theory"]}],"etymology":{"value":"\"Non-\" (否定接頭辞) + \"degeneracy\" (退化性) から構成される。","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌnɒn.dɪˈdʒɛn.ə.rə.si/","syllables":"non-de-gen-er-a-cy"},"inflection":{"noun_plural":"non-degeneracies"},"usage_notes":{"explanation":"\"Non-degeneracy\" は、数学、物理学、工学などの分野で専門的に使用される用語です。一般的には、あるシステムや対象が予期される特性を維持している状態を指します。退化 (degeneracy) が何らかの異常な状態や、区別がつかなくなる状態を指すのに対し、非退化はその正常な状態を意味します。","priority":"☆☆☆"},"level_frequency":{"level":"専門用語 (Specialized term)","frequency_google_ngram":"低頻度 (Low frequency)","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"\"Non-degeneracy\" is a technical term primarily used in advanced mathematics, physics, and engineering. It describes a state where a system or object maintains its expected properties and distinctiveness. Understanding this term requires familiarity with the concept of \"degeneracy,\" which refers to a state where distinct elements or states become indistinguishable or share the same properties. Therefore, \"non-degeneracy\" implies the absence of such indistinguishability or shared properties, ensuring the system behaves in a predictable and well-defined manner. This term is not commonly encountered in everyday language and is typically confined to specialized academic and professional contexts."},"example_sentences":[{"sentence":"The proof relies on the non-degeneracy of the quadratic form.","translation":"その証明は、二次形式の非退化性に依存している。","type":"noun","meaning_category":"数学"},{"sentence":"The non-degeneracy of the ground state is a crucial assumption in many physical models.","translation":"基底状態の非退化性は、多くの物理モデルにおいて重要な仮定である。","type":"noun","meaning_category":"物理学"},{"sentence":"We need to verify the non-degeneracy condition before applying this algorithm.","translation":"このアルゴリズムを適用する前に、非退化条件を確認する必要がある。","type":"noun","meaning_category":"工学"}]}