{"word":"time-exposure","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"長時間露光","english_definition":"A photographic technique in which the shutter of a camera is open for an extended period of time to allow more light to reach the film or digital sensor. This is often used to capture images in low-light conditions or to create motion blur effects.","examples":[{"sentence":"The photographer used a time-exposure to capture the light trails of the cars on the highway.","translation":"写真家は長時間露光を使って、高速道路の車の光跡を捉えた。"},{"sentence":"Time-exposure photography is often used to capture the beauty of the night sky.","translation":"長時間露光写真は、夜空の美しさを捉えるためによく使われる。"},{"sentence":"She set her camera to time-exposure mode to photograph the waterfall.","translation":"彼女は滝を撮影するために、カメラを長時間露光モードに設定した。"}],"collocations":["long time-exposure","time-exposure photography","set to time-exposure","use time-exposure"],"synonyms":["long exposure"],"antonyms":["short exposure","instantaneous exposure"]}],"etymology":{"value":"The term 'time-exposure' is a combination of 'time' referring to the duration the camera shutter is open, and 'exposure' referring to the process of allowing light to reach the film or sensor.","priority":"★★★"},"pronunciation":{"ipa":"/ˈtaɪmɪkˌspoʊʒər/","syllables":"time-ex-po-sure"},"inflection":{"noun_plural":"time-exposures"},"usage_notes":{"explanation":"'Time-exposure' is primarily used in the context of photography. It refers to the technique itself and the resulting images. The hyphen is often included, but 'time exposure' (without the hyphen) is also commonly used and understood. The technique is used to create artistic effects, capture faint light sources, or blur motion.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I made a time exposure photo.","correct":"✓ I took a time-exposure photo. / ✓ I created a time-exposure image.","note":"Use 'take' or 'create' with 'time-exposure photo/image' rather than 'make'."},{"incorrect":"✗ The photo is very time exposed.","correct":"✓ The photo is a time-exposure. / ✓ The photo was taken with a long exposure.","note":"Use 'time-exposure' as a noun to describe the photo, or use 'long exposure' to describe the process."}],"priority":"★★☆"},"related_words":{"derivatives":["exposure","shutter speed","aperture","ISO","motion blur","light trails"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, technical term.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Time-exposure' is a technical term used in photography to describe the technique of leaving a camera's shutter open for a prolonged period. This allows more light to reach the sensor, enabling the capture of images in low-light conditions or the creation of motion blur effects. It is a more advanced concept, typically encountered by those with some knowledge of photography. Understanding the term requires familiarity with basic photographic principles like shutter speed and exposure.","priority":"★★☆"},"example_sentences":[{"sentence":"The Milky Way was visible in the time-exposure photograph.","translation":"長時間露光の写真には天の川が見えた。","type":"noun","meaning_category":"photography"},{"sentence":"She used a time-exposure to blur the movement of the clouds.","translation":"彼女は雲の動きをぼかすために長時間露光を使用した。","type":"noun","meaning_category":"photography"},{"sentence":"The time-exposure revealed details in the shadows that were invisible to the naked eye.","translation":"長時間露光は、肉眼では見えなかった影の中のディテールを明らかにした。","type":"noun","meaning_category":"photography"}]}