{"word":"bander","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A person who bands birds or other animals for scientific study.","english_definition":"A person who attaches a band to a bird or other animal for the purpose of identification and tracking.","examples":[{"sentence":"The bird bander carefully attached the small metal ring to the bird's leg.","translation":"鳥類標識調査員は、小さな金属製のリングを鳥の足に注意深く取り付けた。"},{"sentence":"Experienced banders can quickly and safely capture, band, and release birds.","translation":"経験豊富な標識調査員は、鳥を迅速かつ安全に捕獲、標識し、放鳥することができる。"}],"collocations":["bird bander","wildlife bander","banding station","banding permit"],"synonyms":["ringer (UK)","tagger","marker"],"antonyms":[]}],"etymology":{"value":"Derived from the verb 'band,' referring to the act of attaching a band.","priority":"★★★"},"pronunciation":{"ipa":"/ˈbændər/","syllables":"ban-der"},"inflection":{"noun_plural":"banders"},"usage_notes":{"explanation":"The term 'bander' is most commonly used in the context of ornithology (the study of birds), but it can also refer to someone who bands other types of animals, such as bats or certain mammals. The purpose of banding is to gather data on animal migration, population size, lifespan, and other aspects of their ecology.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The bander painted the bird.","correct":"✓ The bander banded the bird.","note":"'Banding' refers to the act of attaching a band, not painting or otherwise marking the animal. Painting might be a supplementary method, but the core activity is attaching a band."}],"priority":"★★☆"},"related_words":{"derivatives":["band (verb, noun)","banding (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'bander' refers to a specialist who attaches identification bands to animals, primarily birds, for research purposes. This term is most often encountered in scientific or conservation contexts. Understanding the role of a 'bander' requires familiarity with wildlife research and conservation practices."},"example_sentences":[{"sentence":"The **bander** recorded the bird's species, age, and weight before releasing it.","translation":"標識調査員は、鳥の種類、年齢、体重を記録してから放鳥した。","type":"noun","meaning_category":"Person who bands animals"},{"sentence":"To become a licensed **bander**, one must undergo extensive training.","translation":"免許を持った標識調査員になるには、広範な訓練を受ける必要がある。","type":"noun","meaning_category":"Person who bands animals"}]}