{"word":"mesole","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(有機化学)メソ体：分子内にキラル中心を持つが、分子全体としてはキラリティーを持たない化合物。","english_definition":"(organic chemistry) A meso compound: a compound that contains chiral centers but is achiral due to an internal plane of symmetry.","examples":[{"sentence":"Tartaric acid can exist as a meso compound.","translation":"酒石酸はメソ体として存在することがある。"}],"collocations":[],"synonyms":["meso compound"],"antonyms":["chiral compound"]}],"etymology":{"value":"Derived from the Greek word 'mesos' meaning 'middle', referring to the internal symmetry that cancels out chirality.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈmɛsoʊl/","syllables":"me-sole"},"inflection":{"noun_plural":"mesoles"},"usage_notes":{"explanation":"'Mesole' is primarily used in organic chemistry to specifically denote a meso compound. It is not a commonly used word outside of this context. The key characteristic of a mesole is that despite having chiral centers, the molecule is superimposable on its mirror image due to an internal plane of symmetry.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ This molecule is chiral because it is a mesole.","correct":"✓ This molecule is achiral because it is a mesole.","note":"Mesoles are achiral, not chiral, due to their internal symmetry."}],"priority":"★★☆"},"related_words":{"derivatives":["meso compound","meso- (prefix)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Low frequency (specialized term)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mesole' is a highly specialized term used in organic chemistry. It refers to a specific type of molecule that contains chiral centers but is not chiral overall due to internal symmetry. Understanding this term requires a solid foundation in stereochemistry and chirality. It is not commonly encountered outside of advanced chemistry contexts."},"example_sentences":[{"sentence":"The meso compound does not rotate plane-polarized light.","translation":"そのメソ化合物は偏光を回転させない。","type":"noun","meaning_category":"メソ体"},{"sentence":"This molecule is a mesole because it has an internal plane of symmetry.","translation":"この分子は内部対称面を持つため、メソ体である。","type":"noun","meaning_category":"メソ体"}]}