{"word":"Adjoiner","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(不動産)隣接者、隣接地の所有者","english_definition":"A person or thing that adjoins; especially, a landowner whose property is contiguous to another's.","examples":[{"sentence":"The adjoiner to the east of our property is planning to build a fence.","translation":"私たちの土地の東側に隣接する土地の所有者は、フェンスを建てる計画を立てています。"},{"sentence":"We need to notify the adjoiners before we start construction.","translation":"建設を開始する前に、隣接地の所有者に通知する必要があります。"}],"collocations":["notify adjoiners","eastern adjoiner","western adjoiner"],"synonyms":["neighbor","abutting owner","contiguous landowner"],"antonyms":[]}],"etymology":{"value":"From the verb 'adjoin' (to be next to or in contact with) + '-er' (suffix indicating a person or thing that performs the action).","priority":"★★★"},"pronunciation":{"ipa":"/əˈdʒɔɪnər/","syllables":"ad-join-er"},"inflection":{"noun_plural":"Adjoiners"},"usage_notes":{"explanation":"'Adjoiner' is a relatively formal term, often used in legal or real estate contexts. It specifically refers to someone whose property shares a boundary with another property. It's more precise than 'neighbor,' which can refer to anyone living nearby, even if their properties don't directly touch.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The adjoiner is very friendly, living three houses down.","correct":"✓ The neighbor is very friendly, living three houses down.","note":"'Adjoiner' refers to a property owner whose land shares a boundary with yours, not just someone who lives nearby."},{"incorrect":"✗ We need to get permission from all the neighbors, including the adjoiner.","correct":"✓ We need to get permission from all the neighbors, especially the adjoiner.","note":"The adjoiner *is* a neighbor, but the term emphasizes the shared boundary, making their permission particularly important."}],"priority":"★★☆"},"related_words":{"derivatives":["adjoin (verb)","adjoining (adjective)","adjoinment (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'adjoiner' is relatively uncommon and is primarily used in formal or legal contexts related to property ownership. It refers specifically to a person whose land is directly next to another person's land, sharing a boundary. Understanding this term is important in situations involving property rights, construction, or legal disputes concerning land. It is not a word typically used in everyday conversation."},"example_sentences":[{"sentence":"The surveyor identified the property lines and the names of the adjoiners.","translation":"測量技師は、境界線と隣接地の所有者の名前を特定しました。","type":"noun","meaning_category":"隣接者"},{"sentence":"The city planning commission requires notification of all adjoiners before approving a new development.","translation":"都市計画委員会は、新しい開発を承認する前に、すべての隣接地の所有者への通知を義務付けています。","type":"noun","meaning_category":"隣接者"}]}