{"word":"NTSB","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(米)国家運輸安全委員会","english_definition":"(US) National Transportation Safety Board: an independent US government investigative agency responsible for civil transportation accident investigation.","examples":[{"sentence":"The NTSB is investigating the plane crash.","translation":"NTSBはその航空機墜落事故を調査している。"},{"sentence":"The NTSB report cited pilot error as a contributing factor.","translation":"NTSBの報告書は、パイロットの過失を要因の一つとして挙げている。"}],"collocations":["NTSB investigation (NTSBの調査)","NTSB report (NTSBの報告書)","NTSB findings (NTSBの調査結果)"],"synonyms":["(none - proper noun)"],"antonyms":["(none - proper noun)"]}],"etymology":{"value":"Acronym for National Transportation Safety Board.","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛnˌtiːˈɛsˈbiː/","syllables":"en-tee-ess-bee"},"inflection":{"notes":"(acronym - no inflection)"},"usage_notes":{"explanation":"The NTSB is an independent U.S. government agency that investigates transportation accidents, including aviation, highway, marine, railroad, and pipeline accidents. Its primary goal is to determine the probable cause of accidents and issue safety recommendations to prevent similar accidents from happening in the future. The NTSB does not assign blame or liability.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The NTSB are investigating...","correct":"✓ The NTSB is investigating...","note":"Although it refers to a board, NTSB is treated as a singular entity and takes a singular verb."}],"priority":"★★☆"},"related_words":{"derivatives":["(none - acronym)"],"phrasal_verbs":["(none)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1 (technical vocabulary)","frequency_google_ngram":"Relatively infrequent, but common in news reports about transportation accidents.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"NTSB is an acronym for the National Transportation Safety Board, a US government agency that investigates transportation accidents. It is technical vocabulary, primarily used in news reports and discussions related to transportation safety. Understanding this term is important for comprehending news and reports about transportation accidents in the United States."},"example_sentences":[{"sentence":"The **NTSB** arrived at the scene of the train derailment to begin their investigation.","translation":"NTSBは、列車脱線事故の現場に到着し、調査を開始した。","type":"noun","meaning_category":"Government Agency"},{"sentence":"According to the **NTSB**, the cause of the plane crash was engine failure.","translation":"NTSBによると、その航空機墜落事故の原因はエンジン故障だった。","type":"noun","meaning_category":"Government Agency"},{"sentence":"The **NTSB** issued several safety recommendations following the investigation of the bridge collapse.","translation":"NTSBは、橋の崩落事故の調査後、いくつかの安全に関する提言を発表した。","type":"noun","meaning_category":"Government Agency"}]}