{"word":"limnery","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"The art of painting portraits or miniatures; a place where such art is practiced.","english_definition":"The art of painting portraits or miniatures; a place where such art is practiced.","examples":[{"sentence":"The limnery was filled with portraits of the royal family.","translation":"その肖像画工房は王室一家の肖像画でいっぱいだった。"},{"sentence":"She studied limnery under a renowned master.","translation":"彼女は著名な巨匠の下で肖像画術を学んだ。"}],"collocations":["royal limnery","study limnery","practice limnery"],"synonyms":["portraiture","miniature painting","art studio"],"antonyms":[]}],"etymology":{"value":"Derived from 'limner,' referring to a painter, especially of portraits or miniatures. 'Limner' comes from the Middle English 'lumynour,' meaning an illuminator of manuscripts, ultimately from the Latin 'illuminare' (to illuminate).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɪmnəri/","syllables":"lim-ner-y"},"inflection":{"noun_plural":"limneries"},"usage_notes":{"explanation":"'Limnery' is a relatively rare word, primarily used in historical contexts to describe the art or practice of painting portraits or miniatures, or the place where such work is done. It is related to the word 'limner,' which refers to the artist themselves. The term evokes a sense of traditional craftsmanship and artistic skill.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The limnery was full of limners.","correct":"✓ The limnery was full of portraits.","note":"A 'limnery' is the place or art, not the artists themselves. The artists are 'limners.'"}],"priority":"★☆☆"},"related_words":{"derivatives":["limner (noun: a painter, especially of portraits or miniatures)","limn (verb: to depict or describe in painting or drawing)"]},"level_frequency":{"frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Limnery' is an uncommon word referring to the art of painting portraits or miniatures, or the place where such art is practiced. It is derived from 'limner,' a term for the artist. Understanding this word requires familiarity with art history and less common vocabulary."},"example_sentences":[{"sentence":"The royal limnery employed the most skilled artists of the kingdom.","translation":"王室の肖像画工房は王国で最も熟練した芸術家を雇用していた。","type":"noun","meaning_category":"Art studio"},{"sentence":"Her passion for limnery led her to create exquisite miniature portraits.","translation":"彼女の肖像画術への情熱が、精巧なミニチュア肖像画の制作へと繋がった。","type":"noun","meaning_category":"Art of painting"}]}