{"word":"houseparent","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(主に寄宿学校や児童養護施設などの)寮母、寮父、舎監","english_definition":"An adult responsible for the welfare of children living in a residential setting such as a boarding school, orphanage, or group home.","examples":[{"sentence":"The houseparent made sure all the students were in bed by 10 PM.","translation":"寮母は生徒全員が午後10時までに就寝していることを確認した。"},{"sentence":"Our houseparent was always there to help us with our problems.","translation":"私たちの寮母はいつも私たちの問題を助けてくれた。"},{"sentence":"The houseparents organized activities for the children during the holidays.","translation":"寮母たちは休暇中に子供たちのために活動を企画した。"}],"collocations":["dorm parent","residential advisor","caregiver","chaperone","guardian"],"synonyms":["dormitory supervisor","residential advisor","childcare worker","group home parent"],"antonyms":[],"related_words":["boarding school","orphanage","group home","residential care","foster parent"]}],"etymology":{"value":"The word 'houseparent' is a compound word formed by combining 'house' (referring to the residential setting) and 'parent' (referring to the parental role and responsibilities).","priority":"★★★"},"pronunciation":{"ipa":"/ˈhaʊsˌpɛərənt/","syllables":"house-par-ent"},"inflection":{"noun_plural":"houseparents"},"usage_notes":{"explanation":"The term 'houseparent' is primarily used in the context of residential institutions where children or young adults live away from their biological families. Their role is to provide care, supervision, and guidance to the residents, similar to what a parent would do in a family setting. The term is often used interchangeably with 'dorm parent' or 'residential advisor,' although the specific responsibilities may vary depending on the institution.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"She is a homeparent at the school.","correct":"She is a houseparent at the school.","note":"The correct term is 'houseparent,' not 'homeparent.'"},{"incorrect":"The houseparent take care of the children.","correct":"The houseparent takes care of the children.","note":"Ensure subject-verb agreement. 'Houseparent' is singular, so the verb should be 'takes.'"}],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency. More common in specific contexts related to residential care facilities and boarding schools.","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word 'houseparent' refers to an adult who takes on a parental role in a residential setting, such as a boarding school or children's home. They are responsible for the care, supervision, and well-being of the children living there. The term is relatively straightforward but may not be commonly used outside of contexts related to residential care. It implies a significant level of responsibility and involvement in the lives of the children under their care."},"example_sentences":[{"sentence":"The new **houseparent** organized a movie night for the students.","translation":"新しい寮母は生徒たちのために映画鑑賞会を企画した。","type":"example","meaning_category":"General"},{"sentence":"The **houseparent** helped the children with their homework after school.","translation":"寮母は放課後、子供たちの宿題を手伝った。","type":"example","meaning_category":"Responsibilities"},{"sentence":"The **houseparent** provided a supportive environment for the teenagers in the group home.","translation":"寮母はグループホームのティーンエイジャーに支援的な環境を提供した。","type":"example","meaning_category":"Supportive role"}]}