{"word":"lymph","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"リンパ液","english_definition":"A colorless fluid containing white blood cells, which bathes the tissues and drains through the lymphatic system into the bloodstream.","examples":[{"sentence":"Lymph nodes filter the lymph fluid.","translation":"リンパ節はリンパ液をろ過する。"},{"sentence":"The swelling was caused by a buildup of lymph.","translation":"腫れはリンパ液の蓄積によって引き起こされた。"}],"collocations":["lymph node (リンパ節)","lymphatic system (リンパ系)","lymph fluid (リンパ液)","lymphatic drainage (リンパドレナージ)","lymphocyte (リンパ球)"],"synonyms":["lymph fluid"],"antonyms":[]}],"etymology":{"value":"From Latin 'lympha' meaning 'water, clear spring water', associated with a divinity of fresh water.","priority":"★★☆"},"pronunciation":{"ipa":"/lɪmf/","syllables":"lymph (1 syllable)"},"inflection":{"noun_plural":"lymphs"},"usage_notes":{"explanation":"Lymph is a fluid that circulates throughout the body in the lymphatic system. It is similar to blood plasma but contains white blood cells, which help fight infection. The lymphatic system plays a crucial role in the immune system and fluid balance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The lymph are clear.","correct":"✓ The lymph is clear.","note":"Lymph is typically treated as a non-count noun, so it takes a singular verb."}],"priority":"★★☆"},"related_words":{"derivatives":["lymphatic (adjective: relating to lymph or the lymphatic system)","lymphocyte (noun: a type of white blood cell found in lymph)","lymphedema (noun: swelling caused by lymph accumulation)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, more common in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Lymph' refers to a clear fluid in the body's lymphatic system, important for immunity. It's a technical term, so it appears more often in scientific or medical contexts than in everyday conversation. Understanding 'lymph' helps in comprehending discussions about health, the immune system, and related medical topics."},"example_sentences":[{"sentence":"The doctor examined the patient's lymph nodes for signs of infection.","translation":"医師は感染の兆候がないか患者のリンパ節を診察した。","type":"general","meaning_category":"medical"},{"sentence":"Lymphocytes are a crucial part of the immune response.","translation":"リンパ球は免疫反応の重要な部分である。","type":"scientific","meaning_category":"biological"}]}