{"word":"acaricide","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"殺ダニ剤、ダニ駆除剤","english_definition":"a pesticide used to kill mites and ticks (acarids).","examples":[{"sentence":"Acaricides are used to control mite infestations in crops.","translation":"殺ダニ剤は、作物におけるダニの蔓延を抑制するために使用されます。"},{"sentence":"The farmer sprayed the orchard with an acaricide.","translation":"農家は果樹園に殺ダニ剤を散布しました。"}],"collocations":["apply acaricide","acaricide resistance","acaricide treatment"],"synonyms":["miticide"],"antonyms":[]}],"etymology":{"value":"「acari-」（ダニの学術的なグループ名）+「-cide」（殺すもの）から構成される。","priority":"★★☆"},"pronunciation":{"ipa":"/əˈkærɪsaɪd/","syllables":"a-car-i-cide"},"inflection":{"noun_plural":"acaricides"},"usage_notes":{"explanation":"Acaricides are a type of pesticide specifically designed to kill mites and ticks, which are collectively known as acarids. These chemicals are used in agriculture, horticulture, and veterinary medicine to control infestations that can damage crops, harm animals, and transmit diseases. Acaricides can be applied as sprays, dusts, or dips, depending on the target pest and the application site.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The insecticide killed the mites.","correct":"✓ The acaricide killed the mites.","note":"Insecticides are designed to kill insects, while acaricides are specifically for mites and ticks. Using the wrong term can be misleading."}],"priority":"★☆☆"},"related_words":{"derivatives":["acaricidal (adjective)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"acaricide\" is a technical term used to describe a type of pesticide that specifically targets mites and ticks (acarids). It is commonly used in agricultural, horticultural, and veterinary contexts. Understanding this term is essential for professionals and researchers in these fields, as it distinguishes these specialized pesticides from broader categories like insecticides. The term is derived from \"acari-\" (referring to the group of mites and ticks) and \"-cide\" (meaning to kill)."},"example_sentences":[{"sentence":"The effectiveness of the acaricide was evaluated in controlling spider mites on tomato plants.","translation":"その殺ダニ剤の効果は、トマトの木についたハダニを駆除する上で評価されました。","type":"noun","meaning_category":"殺ダニ剤"},{"sentence":"Due to the development of resistance, the acaricide was no longer effective in controlling the tick population.","translation":"抵抗性の発達により、その殺ダニ剤はダニの個体数を制御するのに効果がなくなりました。","type":"noun","meaning_category":"殺ダニ剤"}]}