{"word":"codelinquent","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A person who enables or supports the addictive or destructive behavior of another person, often unintentionally.","english_definition":"A person whose behavior supports or enables another person's addiction, irresponsibility, or underachievement.","examples":[{"sentence":"She realized she was a codelinquent in her son's alcohol abuse by always making excuses for him.","translation":"彼女は、いつも息子の言い訳をすることで、息子のアルコール依存症を助長する共依存者であることに気づいた。"},{"sentence":"The therapist helped the parents understand how their actions were making them codelinquents in their child's failure to launch.","translation":"セラピストは、親たちが自分たちの行動が、子供の自立失敗を助長する共依存者になっているかを理解するのを助けた。"}],"collocations":["enabling behavior","dysfunctional relationship","supportive role","unintentional harm"],"synonyms":["enabler","codependent"],"antonyms":["independent","self-reliant"]}],"etymology":{"value":"A blend of \"co-\" (meaning together or jointly) and \"delinquent\" (referring to a neglect of duty or wrongdoing). The term suggests a shared or supportive role in another person's negative behavior.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkoʊdɪˈlɪŋkwənt/","syllables":"co-de-lin-quent"},"inflection":{"noun_plural":"codelinquents"},"usage_notes":{"explanation":"The term \"codelinquent\" is often used in the context of addiction, family dynamics, and dysfunctional relationships. It describes someone who, often with good intentions, inadvertently supports or enables another person's negative behaviors or irresponsibility. This can involve making excuses, covering up mistakes, or taking on responsibilities that the other person should be handling themselves.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a delinquent because he steals. She is codelinquent.","correct":"✓ He is delinquent because he steals. She is codelinquent because she covers up his crimes.","note":"\"Delinquent\" refers to the person engaging in the negative behavior, while \"codelinquent\" refers to the person supporting that behavior."},{"incorrect":"✗ Being codelinquent is always intentional.","correct":"✓ Being codelinquent is often unintentional, stemming from a desire to help or protect someone.","note":"Codelinquency often arises from a desire to help, not from malicious intent."}],"priority":"★★☆"},"related_words":{"derivatives":["codelinquency (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"codelinquent\" describes a person who supports another's negative behaviors, often unintentionally. It's a blend of \"co-\" and \"delinquent,\" indicating a shared role in the negative behavior. This term is often used in discussions about addiction or dysfunctional relationships, where one person's actions enable another's harmful behaviors. Understanding this term requires a grasp of complex relationship dynamics and enabling behaviors."},"example_sentences":[{"sentence":"As a codelinquent, she consistently bailed her brother out of financial trouble, preventing him from learning responsibility.","translation":"共依存者として、彼女は一貫して兄の経済的な問題を肩代わりし、彼が責任を学ぶことを妨げていた。","type":"noun","meaning_category":"enabling behavior"},{"sentence":"The parents were identified as codelinquents for making excuses for their child's truancy.","translation":"親たちは、子供の無断欠席の言い訳をすることで、共依存者とみなされた。","type":"noun","meaning_category":"supportive role"},{"sentence":"It's important to recognize codelinquent behaviors in order to break the cycle of enabling.","translation":"助長するサイクルを断ち切るためには、共依存的な行動を認識することが重要だ。","type":"noun","meaning_category":"dysfunctional relationship"}]}