{"word":"spawneater","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(主にゲーム用語) スポーン地点荒らし、スポーンキラー：ゲームにおいて、敵プレイヤーがリスポーン（再出現）する地点で待ち伏せし、出現直後の無防備な状態の敵を連続して倒す行為、またはそれを行うプレイヤー。","english_definition":"(Primarily gaming slang) A player who camps at or near an enemy's spawn point in a multiplayer game, repeatedly killing them as soon as they reappear.","examples":[{"sentence":"The spawneater ruined the game for everyone by camping at our base.","translation":"スポーンイーターが私たちの基地で待ち伏せすることで、みんなのゲームを台無しにした。"},{"sentence":"Don't be a spawneater; it's unsportsmanlike.","translation":"スポーンイーターになるな。それはスポーツマンシップに反する。"}],"collocations":["spawn camping","spawn killing","griefing"],"synonyms":["spawn camper","spawn killer","griefer"],"antonyms":["fair player","sportsmanlike player"]}],"etymology":{"value":"'Spawn'（ゲームでキャラクターが再出現する場所）と 'eater'（～を食べる人、ここでは比喩的に「むさぼる人」）の合成語。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈspɔːnˌiːtər/","syllables":"spawn-eat-er"},"inflection":{"noun_plural":"spawneaters"},"usage_notes":{"explanation":"'Spawneater' はオンラインマルチプレイヤーゲーム、特にファーストパーソン・シューティングゲーム (FPS) やマルチプレイヤーオンラインバトルアリーナ (MOBA) などのジャンルで使われるスラングです。この行為は一般的に、ゲームのバランスを崩し、他のプレイヤーの楽しみを奪う行為とみなされ、多くのゲームコミュニティでは非難されています。ただし、ゲームによってはスポーン地点が戦略的に重要な場所である場合や、スポーン地点を攻撃することがゲームの目的の一部となっている場合もあります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a spawneater because he is very good at the game.","correct":"✓ He is a spawneater because he camps at the spawn point.","note":"'Spawneater' はゲームが上手いことを意味するのではなく、スポーン地点で待ち伏せする行為を指します。"},{"incorrect":"✗ Spawneating is a good strategy to win the game.","correct":"✓ Spawneating is considered an unfair strategy by many players.","note":"多くのプレイヤーはスポーン地点荒らしを不公平な戦略だと考えています。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["camping","griefing","frag","K/D ratio","spawn point","respawn"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (ゲームスラング)","frequency_google_ngram":"低頻度 (Low frequency) - 主にゲームコミュニティで使用されるスラング。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Spawneater' is a slang term used almost exclusively in the context of online multiplayer video games. It refers to a player who repeatedly kills other players immediately after they respawn, often by waiting near the respawn point. This behavior is generally considered unsportsmanlike and can be frustrating for the victims. Understanding this term requires familiarity with gaming culture and terminology."},"example_sentences":[{"sentence":"The server admin banned the spawneater for repeatedly harassing new players.","translation":"サーバー管理者は、スポーンイーターが繰り返し新規プレイヤーを嫌がらせたため、BANした。","type":"noun","meaning_category":"スポーン地点荒らし"},{"sentence":"Spawneating is a cheap tactic that ruins the fun for everyone else.","translation":"スポーン地点荒らしは、他のすべての人の楽しみを台無しにする安っぽい戦術だ。","type":"noun","meaning_category":"スポーン地点荒らし"}]}