{"word":"hot-deck","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(統計)ホットデック法を用いて欠損値を補完する","english_definition":"(statistics) to impute missing values using the hot-deck imputation method.","examples":[{"sentence":"We hot-decked the missing income data using information from similar respondents.","translation":"類似した回答者の情報を用いて、ホットデック法で欠損している所得データを補完した。"}],"collocations":["hot-deck imputation","hot-deck missing data"],"synonyms":["impute","fill in","estimate"],"antonyms":["delete","ignore"]},{"part_of_speech":"noun","definition":"(統計)ホットデック法","english_definition":"(statistics) a method of imputing missing data in which each missing value is replaced with an observed response from a 'donor' that is similar to the recipient unit.","examples":[{"sentence":"Hot-deck is a common method for handling missing data in surveys.","translation":"ホットデック法は、調査における欠損データを処理するための一般的な手法である。"}],"collocations":["hot-deck imputation","nearest neighbor hot-deck","random hot-deck"],"synonyms":["imputation","missing data imputation"],"antonyms":["complete-case analysis"]}],"etymology":{"value":"The term 'hot-deck' refers to the practice of using a 'deck' of punched cards containing survey data. When a missing value was encountered, a similar card (the 'donor') was selected from the 'hot' deck (i.e., the current deck being processed) to provide a replacement value.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɒtˌdɛk/","syllables":"hot-deck"},"inflection":{"verb_forms":{"present_simple":["hot-deck","hot-decks"],"past_simple":"hot-decked","past_participle":"hot-decked","present_participle":"hot-decking"},"noun_plural":"hot-decks"},"usage_notes":{"explanation":"'Hot-deck' imputation is a statistical technique used to address missing data in datasets. It involves replacing missing values with actual observed values from similar records (donors) within the dataset. The 'donor' is selected based on matching criteria, aiming to preserve the distribution and relationships within the data.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ We hot-decked the data with random numbers.","correct":"✓ We hot-decked the data using values from similar respondents.","note":"Hot-deck imputation uses actual observed values, not random numbers."}],"priority":"★★☆"},"related_words":{"derivatives":["cold-deck imputation","nearest neighbor imputation"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hot-deck' imputation is a statistical method for handling missing data. It involves replacing missing values with observed values from similar records within the dataset. This technique is more complex than simply deleting incomplete cases and requires an understanding of statistical imputation methods. It is generally used in advanced statistical analysis.","priority":"★★★"},"example_sentences":[{"sentence":"The researchers used hot-deck imputation to fill in the missing values in the survey data.","translation":"研究者らは、調査データの欠損値を補完するためにホットデック法を用いた。","type":"verb","meaning_category":"欠損値を補完する"},{"sentence":"Hot-deck is a popular method for handling missing data in large surveys.","translation":"ホットデック法は、大規模調査における欠損データを処理するための一般的な手法である。","type":"noun","meaning_category":"ホットデック法"}]}