{"word":"zoogeog","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"動物地理学","english_definition":"The branch of zoology dealing with the geographical distribution of animals.","examples":[{"sentence":"Zoogeography helps us understand how animal species have spread across the globe.","translation":"動物地理学は、動物種がどのように地球上に広がったかを理解するのに役立ちます。"},{"sentence":"His research focused on the zoogeography of island mammals.","translation":"彼の研究は、島の哺乳類の動物地理学に焦点を当てていました。"}],"collocations":["study of zoogeography","regional zoogeography","historical zoogeography"],"synonyms":["animal geography","geographical zoology"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'zoon' (animal), 'geo' (earth), and 'graphia' (description).","priority":"★★☆"},"pronunciation":{"ipa":"ˌzoʊ.oʊdʒiˈɒɡrəfi","syllables":"zo-o-ge-og-ra-phy"},"inflection":{"noun_plural":"zoogeographies"},"usage_notes":{"explanation":"Zoogeography is a scientific field that examines the distribution patterns of animals and the factors that influence these patterns. It often involves studying the historical, ecological, and evolutionary aspects of animal distribution.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is studying zoogeographic.","correct":"✓ He is studying zoogeography.","note":"'Zoogeographic' is an adjective, while 'zoogeography' is the noun (the field of study)."},{"incorrect":"✗ Zoogeography studies plants.","correct":"✓ Zoogeography studies animals.","note":"Zoogeography specifically deals with the geographical distribution of animals, not plants (which are studied in biogeography or phytogeography)."}],"priority":"★★☆"},"related_words":{"derivatives":["zoogeographer (noun: a person who studies zoogeography)","zoogeographic (adjective: relating to zoogeography)"],"related_fields":["biogeography (the study of the geographic distribution of all organisms)","phytogeography (the study of the geographic distribution of plants)","ecology (the study of the relationships between organisms and their environment)","evolutionary biology (the study of the evolutionary processes that produce the diversity of life)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - primarily used in academic or scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Zoogeography' is a specialized term used in the field of biology, specifically within zoology and geography. It refers to the study of the geographic distribution of animals, including the reasons for their distribution patterns and the historical and ecological factors that influence them. This term is most commonly encountered in scientific literature, academic discussions, and advanced educational settings related to biology, ecology, and geography."},"example_sentences":[{"sentence":"The professor lectured on the zoogeography of the Amazon rainforest.","translation":"教授はアマゾン熱帯雨林の動物地理学について講義しました。","type":"general","meaning_category":"Definition"},{"sentence":"Understanding zoogeography is crucial for conservation efforts.","translation":"動物地理学を理解することは、保護活動にとって重要です。","type":"general","meaning_category":"Application"}]}