{"word":"pseudoephedrine","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"プソイドエフェドリン：充血除去剤として使用される薬剤","english_definition":"A drug used as a decongestant, typically to relieve nasal congestion.","examples":[{"sentence":"Pseudoephedrine is a common ingredient in cold and allergy medications.","translation":"プソイドエフェドリンは、風邪薬やアレルギー薬によく含まれる成分です。"},{"sentence":"Due to its potential misuse in the production of methamphetamine, pseudoephedrine is often regulated.","translation":"メタンフェタミンの製造に悪用される可能性があるため、プソイドエフェドリンはしばしば規制されています。"}],"collocations":["pseudoephedrine hydrochloride","pseudoephedrine sulfate","containing pseudoephedrine","pseudoephedrine tablets","pseudoephedrine nasal spray"],"synonyms":["decongestant","ephedrine","phenylephrine"],"antonyms":[]}],"etymology":{"value":"Derived from the prefix 'pseudo-' (meaning false or deceptive) combined with 'ephedrine', a similar compound.","priority":"★★☆"},"pronunciation":{"ipa":"ˌsjuːdoʊɪˈfɛdrɪn","syllables":"pseu-do-e-phed-rine"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Pseudoephedrine is a sympathomimetic amine used as a decongestant. It works by constricting blood vessels in the nasal passages, which reduces swelling and congestion. Because it can be used to illegally manufacture methamphetamine, its sale is often restricted, requiring identification and purchase limits.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I took pseudoephedrine for my headache.","correct":"✓ I took pseudoephedrine for my nasal congestion.","note":"Pseudoephedrine is primarily a decongestant, not a pain reliever. It's used for nasal congestion, not headaches."},{"incorrect":"✗ Pseudoephedrine is safe for everyone.","correct":"✓ Pseudoephedrine should be used with caution and under medical advice, especially for individuals with certain health conditions.","note":"Pseudoephedrine can have side effects and may not be suitable for everyone, especially those with heart conditions, high blood pressure, or glaucoma."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudoephedrine hydrochloride","pseudoephedrine sulfate"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pseudoephedrine' is a technical term referring to a specific medication used as a decongestant. It is typically encountered in medical contexts or when discussing regulations related to drug manufacturing. Understanding this term implies familiarity with pharmaceutical vocabulary and potentially legal or regulatory frameworks.","priority":"★★☆"},"example_sentences":[{"sentence":"The pharmacist asked for my ID when I purchased pseudoephedrine.","translation":"薬剤師は私がプソイドエフェドリンを購入する際に身分証明書の提示を求めました。","type":"noun","meaning_category":"medication"},{"sentence":"Many over-the-counter cold medicines contain pseudoephedrine to relieve nasal congestion.","translation":"多くの市販の風邪薬には、鼻づまりを緩和するためにプソイドエフェドリンが含まれています。","type":"noun","meaning_category":"medication"}]}