{"word":"earth-gravity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"地球の重力","english_definition":"The gravitational force exerted by the Earth on an object at or near its surface.","examples":[{"sentence":"The experiment was conducted under earth-gravity conditions.","translation":"その実験は地球の重力下で行われた。"},{"sentence":"Astronauts experience a significant change in gravity when they leave earth-gravity.","translation":"宇宙飛行士は地球の重力から離れると、重力の大きな変化を経験する。"}],"collocations":["earth-gravity conditions","under earth-gravity","simulated earth-gravity"],"synonyms":["gravitational force of Earth","terrestrial gravity"],"antonyms":["zero-gravity","microgravity"]},{"part_of_speech":"adjective","definition":"地球の重力下にある、地球の重力をシミュレートした","english_definition":"Relating to or simulating the gravitational force of the Earth.","examples":[{"sentence":"Earth-gravity experiments help us understand the effects of gravity on biological systems.","translation":"地球の重力下での実験は、重力が生物学的システムに与える影響を理解するのに役立つ。"},{"sentence":"The researchers created an earth-gravity environment in the laboratory.","translation":"研究者たちは実験室で地球の重力環境を作り出した。"}],"collocations":["earth-gravity environment","earth-gravity simulation","earth-gravity research"],"synonyms":["terrestrial gravity","simulated gravity"],"antonyms":["zero-gravity","microgravity"]}],"etymology":{"value":"A compound word formed by combining 'earth' (referring to the planet) and 'gravity' (the force of attraction between objects with mass).","priority":"★★★"},"pronunciation":{"ipa":"/ˈɜːrθ ˈɡrævɪti/","syllables":"earth-grav-i-ty"},"inflection":{"notes":"The noun form is uncountable. The adjective form does not inflect."},"usage_notes":{"explanation":"'Earth-gravity' refers specifically to the gravitational force experienced on or near the surface of Earth. It is often used in scientific contexts, especially when comparing it to other gravitational environments (e.g., on other planets or in space). The term can also be used to describe simulated earth-gravity environments.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is living in earth gravity.","correct":"✓ He is living under earth gravity.","note":"When referring to being subject to Earth's gravity, use the preposition 'under'."},{"incorrect":"✗ The earth gravity is different on the moon.","correct":"✓ The gravity is different on the moon. / ✓ The gravity on the moon is different from earth-gravity.","note":"Use 'earth-gravity' to specifically contrast with gravity on other celestial bodies."}],"priority":"★★☆"},"related_words":{"derivatives":["gravity","gravitational","geocentric"],"phrasal_verbs":[],"related_terms":["zero-gravity","microgravity","artificial gravity","gravitational force","weight","mass"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency, primarily used in scientific and technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Earth-gravity' is a technical term primarily used in scientific and engineering contexts to specifically denote the gravitational force experienced on Earth. It is often used in discussions related to space exploration, physics, and biology when comparing gravitational forces or simulating Earth-like conditions. Understanding this term requires a background in basic physics and an awareness of its specific usage in scientific literature."},"example_sentences":[{"sentence":"The plants were grown under simulated earth-gravity to study their growth patterns.","translation":"その植物は、成長パターンを研究するために、シミュレートされた地球の重力下で育てられた。","type":"noun","meaning_category":"地球の重力"},{"sentence":"The earth-gravity environment in the centrifuge allowed the researchers to study the effects of high gravity on cells.","translation":"遠心分離機内の地球の重力環境により、研究者たちは高重力が細胞に与える影響を研究することができた。","type":"adjective","meaning_category":"地球の重力下にある"}]}