{"word":"single-acting","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"単動式の","english_definition":"(of a mechanism, especially a cylinder or piston) operating in only one direction, with the return movement being achieved by a spring or other external force.","examples":[{"sentence":"A single-acting cylinder uses compressed air to move the piston in one direction only.","translation":"単動シリンダーは、圧縮空気を使用してピストンを一方向にのみ動かします。"},{"sentence":"The single-acting pump is simpler in design compared to a double-acting pump.","translation":"単動ポンプは、複動ポンプに比べて設計がよりシンプルです。"}],"collocations":["single-acting cylinder","single-acting pump","single-acting mechanism"],"synonyms":["unidirectional","one-way"],"antonyms":["double-acting"]},{"part_of_speech":"adjective","definition":"(機械などが)片側だけに作用する、単動の","english_definition":"operating or effective in one direction or manner only.","examples":[{"sentence":"This is a single-acting brake system.","translation":"これは単動ブレーキシステムです。"}],"collocations":["single-acting brake"],"synonyms":["one-way","unilateral"],"antonyms":["double-acting","bilateral"]}],"etymology":{"value":"The term 'single-acting' is derived from the fact that the mechanism performs work or exerts force in only one direction during its cycle.","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɪŋɡəl ˈæktɪŋ/","syllables":"sin-gle-act-ing"},"inflection":{"notes":"This is an adjective and does not inflect."},"usage_notes":{"explanation":"The term 'single-acting' is primarily used in engineering and mechanics to describe devices like cylinders, pistons, and pumps. It indicates that the device performs its primary function in only one direction, relying on a spring, gravity, or other external force for the return stroke. The opposite of 'single-acting' is 'double-acting,' which refers to devices that perform work in both directions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The machine is single action.","correct":"✓ The machine is single-acting.","note":"'Single-acting' is the correct term to describe the mechanism."}],"priority":"★★★"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["cylinder","piston","pump","double-acting","actuator","mechanism"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - Primarily used in technical contexts.","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"The term 'single-acting' is a technical term used in engineering and mechanics. It describes a device or mechanism that operates in only one direction. For example, a single-acting cylinder moves the piston in one direction using compressed air, and a spring returns it to its original position. This term is usually encountered in technical manuals, engineering specifications, and related contexts. Understanding this term requires some familiarity with mechanical principles.","priority":"★★★"},"example_sentences":[{"sentence":"The single-acting hydraulic cylinder is used in applications where force is needed in only one direction.","translation":"単動油圧シリンダーは、一方向にのみ力が必要な用途で使用されます。","type":"adjective","meaning_category":"Technical Description"},{"sentence":"This single-acting air compressor is compact and efficient for small-scale tasks.","translation":"この単動式エアコンプレッサーは、小型で効率的で小規模な作業に適しています。","type":"adjective","meaning_category":"Technical Description"}]}