{"word":"sclerotium","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"菌核（きんかく）","english_definition":"A compact mass of hardened fungal mycelium containing food reserves, enabling the fungus to survive adverse conditions.","examples":[{"sentence":"The sclerotium allows the fungus to survive through the winter.","translation":"菌核によって、その菌は冬を越すことができる。"},{"sentence":"Some fungi produce sclerotia as a survival strategy.","translation":"生存戦略として菌核を作る菌もいる。"}],"collocations":["form a sclerotium","sclerotium formation","sclerotium development"],"synonyms":["fungal resting body"],"antonyms":[]},{"part_of_speech":"noun","definition":"麦角菌核（ばっかくきんかく）","english_definition":"The sclerotium of the ergot fungus (Claviceps purpurea), a dark-purple body that replaces the grain of rye and other grasses.","examples":[{"sentence":"Ergot is a fungal disease caused by the sclerotium of Claviceps purpurea.","translation":"麦角病は、麦角菌（Claviceps purpurea）の菌核によって引き起こされる真菌病である。"},{"sentence":"The sclerotium of ergot contains toxic alkaloids.","translation":"麦角菌核には有毒なアルカロイドが含まれている。"}],"collocations":["ergot sclerotium","Claviceps purpurea sclerotium"],"synonyms":["ergot","ergot body"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'skleros' meaning 'hard'.","priority":"★★☆"},"pronunciation":{"ipa":"/sklɪˈroʊʃiəm/","syllables":"skle-ro-shi-um"},"inflection":{"noun_plural":"sclerotia"},"usage_notes":{"explanation":"A sclerotium is a hardened, often darkened, mass of fungal mycelium that functions as a survival structure. It allows the fungus to remain dormant during unfavorable conditions (e.g., drought, cold) and then resume growth when conditions improve. Sclerotia are found in many different types of fungi. The ergot sclerotium is a specific and important example due to its toxicity and historical significance.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sclerotium is a type of bacteria.","correct":"✓ The sclerotium is a structure formed by fungi.","note":"Sclerotia are formed by fungi, not bacteria."},{"incorrect":"✗ Sclerotium are always poisonous.","correct":"✓ Some sclerotia, like ergot, are poisonous.","note":"Not all sclerotia are poisonous, though some, like ergot, contain toxins."}],"priority":"★★☆"},"related_words":{"derivatives":["sclerotic (adjective: hardened)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sclerotium' is a technical term used in mycology (the study of fungi). It refers to a hardened mass of fungal mycelium that allows the fungus to survive adverse conditions. Understanding this term requires some background knowledge of fungal biology. It is not a commonly used word outside of scientific contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The fungus survives the winter as a sclerotium in the soil.","translation":"その菌は、土壌中で菌核として冬を越す。","type":"general","meaning_category":"survival structure"},{"sentence":"The ergot sclerotium can contaminate grain crops.","translation":"麦角菌核は穀物作物を汚染することがある。","type":"specific","meaning_category":"ergot"}]}