{"word":"Degradand","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A compound formed by degradation of another compound.","english_definition":"A compound formed by the degradation of another compound.","examples":[{"sentence":"The degradand was identified as a key intermediate in the breakdown pathway.","translation":"その分解生成物は、分解経路における重要な中間体として特定されました。"}],"collocations":[],"synonyms":["breakdown product","metabolite"],"antonyms":[]}],"etymology":{"value":"Formed from 'degrade' + '-and' (suffix indicating a substance produced by a process).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈdɛɡrədænd/","syllables":"De-gra-dand"},"inflection":{"noun_plural":"degradands"},"usage_notes":{"explanation":"'Degradand' is a technical term primarily used in chemistry, environmental science, and related fields to describe a specific product resulting from the degradation of a parent compound. It is often used when discussing the breakdown of pollutants, pharmaceuticals, or other complex molecules in the environment or in biological systems.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["degrade","degradation"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'degradand' is a highly specialized term used in scientific contexts, particularly in chemistry and environmental science. It refers to a compound that is formed as a result of the degradation process of another compound. Understanding this word requires a strong background in these scientific fields."},"example_sentences":[{"sentence":"The study focused on identifying the various degradands of the pesticide in soil.","translation":"その研究は、土壌中の農薬の様々な分解生成物を特定することに焦点を当てました。","type":"noun","meaning_category":"compound"},{"sentence":"Analysis of the water sample revealed the presence of several degradands from the original contaminant.","translation":"水サンプルを分析したところ、元の汚染物質からのいくつかの分解生成物の存在が明らかになりました。","type":"noun","meaning_category":"compound"}]}