{"word":"Urdu-impaired","meanings":[{"part_of_speech":"adjective","definition":"Having a limited or nonexistent understanding of the Urdu language.","english_definition":"Having a limited or nonexistent understanding of the Urdu language.","examples":[{"sentence":"As an Urdu-impaired individual, I rely on translations to understand the news from Pakistan.","translation":"ウルドゥー語が苦手な私は、パキスタンのニュースを理解するために翻訳に頼っています。"},{"sentence":"The conference catered to both Urdu speakers and the Urdu-impaired by providing simultaneous translation.","translation":"会議では同時通訳を提供することで、ウルドゥー語話者とウルドゥー語が苦手な人の両方に対応しました。"}],"synonyms":["Urdu-challenged","lacking Urdu proficiency","non-Urdu speaking"],"antonyms":["Urdu-proficient","fluent in Urdu","Urdu-speaking"]}],"etymology":{"value":"Formed by combining \"Urdu\" (referring to the Urdu language) with \"-impaired,\" indicating a deficiency or lack of ability.","notes":"The term is often used humorously or euphemistically to describe someone who does not speak or understand Urdu well. It follows a pattern similar to other \"-impaired\" constructions, such as \"hearing-impaired\" or \"visually-impaired.\""},"pronunciation":{"notes":"Pronunciation would follow the standard pronunciation of \"Urdu\" and \"impaired\"."},"usage_notes":{"explanation":"This term is generally used informally and can sometimes be considered insensitive depending on the context and the person's preference. It's often used in self-deprecating humor or lighthearted conversation. More neutral terms like \"non-Urdu speaking\" or \"lacking Urdu proficiency\" are generally preferred in formal settings.","caution":"Be mindful of the context and audience when using this term, as it may be considered offensive by some."},"related_words":{"related_terms":["language-impaired","monolingual","bilingual","multilingual"]},"level_frequency":{"frequency_google_ngram":"Low frequency - This is a relatively uncommon term.","notes":"The frequency of this term is low due to its informal and somewhat humorous nature."},"example_sentences":[{"sentence":"Despite living in Karachi for a year, I remain stubbornly Urdu-impaired.","translation":"カラチに1年住んでいるにもかかわらず、私は相変わらずウルドゥー語が苦手です。","type":"general"},{"sentence":"The website offers resources for both Urdu speakers and those who are Urdu-impaired.","translation":"そのウェブサイトは、ウルドゥー語話者とウルドゥー語が苦手な人の両方のためのリソースを提供しています。","type":"general"}]}