{"word":"Lafayette","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ラファイエット: フランスの貴族、軍人。アメリカ独立革命でアメリカを支援した。","english_definition":"Marquis de Lafayette: A French aristocrat and military officer who fought for the United States in the American Revolutionary War.","examples":[{"sentence":"Lafayette played a crucial role in the American Revolution.","translation":"ラファイエットはアメリカ独立革命で重要な役割を果たした。"},{"sentence":"Statues of Lafayette can be found in both France and the United States.","translation":"ラファイエットの像はフランスとアメリカ合衆国の両方で見つけることができる。"}],"collocations":["Marquis de Lafayette","General Lafayette","Lafayette's contribution","Lafayette's visit"],"synonyms":["Marquis de Lafayette","Marie-Joseph Paul Yves Roch Gilbert du Motier, Marquis de Lafayette"],"antonyms":[]},{"part_of_speech":"noun","definition":"アメリカ合衆国の多くの都市や郡の名前。","english_definition":"The name of numerous cities and counties in the United States, often named in honor of the Marquis de Lafayette.","examples":[{"sentence":"We are driving through Lafayette, Indiana, on our way to Chicago.","translation":"シカゴへ向かう途中、インディアナ州のラファイエットを通過している。"},{"sentence":"Lafayette Parish is located in Louisiana.","translation":"ラファイエット郡区はルイジアナ州に位置している。"}],"collocations":["Lafayette, Indiana","Lafayette, Louisiana","Lafayette County"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Named after Marquis de Lafayette, a French aristocrat and military officer who played a significant role in the American Revolutionary War.","priority":"★★★"},"pronunciation":{"ipa":"/ˌlæfiˈɛt/","syllables":"La-fi-ette"},"inflection":{},"usage_notes":{"explanation":"'Lafayette' is primarily used as a proper noun, referring either to the historical figure or to places named after him. When referring to the person, it's often preceded by 'Marquis de' or 'General'. When referring to places, it's usually followed by the state or region where it's located.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I visited the Lafayette.","correct":"✓ I visited Lafayette, Indiana.","note":"When referring to a place, specify the state or region to avoid ambiguity."},{"incorrect":"✗ Lafayette was a president of the United States.","correct":"✓ Lafayette was a French aristocrat who helped the United States in the American Revolution.","note":"Lafayette was not a U.S. president; he was a French military officer who aided the U.S. during the Revolutionary War."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_places":["Fayetteville (often confused, also named after Lafayette)"],"historical_events":["American Revolution","French Revolution (Lafayette also played a role)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively infrequent, but recognizable due to historical significance and place names.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Lafayette' is a proper noun that primarily refers to Marquis de Lafayette, a significant figure in the American Revolutionary War. It's also used as the name of several places in the United States. Understanding its historical context is helpful for interpreting its usage. It's important to distinguish it from similar-sounding names like 'Fayetteville'."},"example_sentences":[{"sentence":"Marquis de Lafayette was a key ally to George Washington during the American Revolution.","translation":"ラファイエット侯爵はアメリカ独立革命においてジョージ・ワシントンの重要な同盟者だった。","type":"historical context","meaning_category":"Historical Figure"},{"sentence":"We spent a week in Lafayette, Louisiana, exploring Cajun culture.","translation":"ケイジャン文化を探求するため、ルイジアナ州のラファイエットで一週間過ごした。","type":"place name","meaning_category":"Place Name"},{"sentence":"The city of Lafayette, Indiana, is home to Purdue University.","translation":"インディアナ州のラファイエット市はパデュー大学の所在地である。","type":"place name","meaning_category":"Place Name"}]}