{"word":"centiare","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"サンチアール (面積の単位で、1平方メートルに相当)","english_definition":"A unit of area equal to one square meter, primarily used in land measurement.","examples":[{"sentence":"The small garden measured approximately 5 centiares.","translation":"その小さな庭はおよそ5サンチアールの広さだった。"},{"sentence":"Land prices are often quoted per centiare in rural areas.","translation":"地方では土地の価格がサンチアール単位で提示されることが多い。"}],"collocations":["measure in centiares","price per centiare","area in centiares"],"synonyms":["square meter"],"antonyms":[]},{"part_of_speech":"noun","definition":"(歴史的) メートル法の初期に使用された面積の単位","english_definition":"(Historical) A unit of area formerly used in the metric system, equivalent to one square meter.","examples":[{"sentence":"Early metric surveys often recorded land areas in centiares.","translation":"初期のメートル法による測量では、土地の面積がサンチアールで記録されることが多かった。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From French 'centi-' (meaning one hundredth) + 'are' (a unit of area equal to 100 square meters). Thus, a centiare is one hundredth of an are.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɛntiˌɑːr/","syllables":"cen-ti-are"},"inflection":{"noun_plural":"centiares"},"usage_notes":{"explanation":"The centiare is a relatively small unit of area, making it suitable for measuring small plots of land or gardens. It is primarily used in contexts where the metric system is standard. While not as commonly used as other units like hectares or square kilometers, it provides a precise measurement for smaller areas.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The room was 20 centiares squared.","correct":"✓ The room was 20 centiares.","note":"'Centiare' already implies a unit of area (square meters), so 'squared' is redundant."}],"priority":"★★☆"},"related_words":{"derivatives":["centi- (prefix meaning one hundredth)","are (unit of area equal to 100 square meters)","hectare (unit of area equal to 10,000 square meters or 100 ares)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Technical vocabulary)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'centiare' refers to a specific unit of area measurement equal to one square meter. It is most commonly encountered in contexts related to land surveying, real estate, or agriculture, particularly in regions that use the metric system. Understanding this term is useful when dealing with precise measurements of small land plots or gardens. It's essential to remember that a centiare is one hundredth of an 'are,' which is a larger unit of area.","priority":"★★☆"},"example_sentences":[{"sentence":"Each plot in the community garden is allocated 2 centiares.","translation":"共同菜園の各区画には2サンチアールが割り当てられています。","type":"noun","meaning_category":"area measurement"},{"sentence":"The price of the land was $50 per centiare.","translation":"その土地の価格は1サンチアールあたり50ドルだった。","type":"noun","meaning_category":"land pricing"}]}