{"word":"portention","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"An omen or portent; something that foreshadows a future event.","english_definition":"An omen or sign of something about to happen, often something momentous or calamitous.","examples":[{"sentence":"The dark clouds gathering on the horizon were a portention of the storm to come.","translation":"地平線に集まる暗い雲は、これから来る嵐の前兆だった。"},{"sentence":"Some saw the economic downturn as a portention of greater financial troubles ahead.","translation":"経済の低迷を、今後起こるであろうより大きな財政難の前兆と見る人もいた。"}],"collocations":["ominous portention","clear portention","act as a portention","a portention of doom"],"synonyms":["omen","portent","foreshadowing","augury","prognostication","premonition","sign","warning"],"antonyms":[]}],"etymology":{"value":"Derived from 'portent' with the addition of a suffix to create a noun form. 'Portent' comes from the Latin 'portendere' meaning 'to indicate beforehand, to presage'.","priority":"★★☆"},"pronunciation":{"ipa":"/pɔːrˈtɛnʃən/","syllables":"por-ten-tion"},"inflection":{"noun_plural":"portentions"},"usage_notes":{"explanation":"'Portention' is a relatively rare word, often used in literary or formal contexts. It emphasizes the predictive or indicative nature of a sign or event, suggesting that it carries a message about what is to come. It is closely related to 'portent,' but 'portention' may sometimes imply a more active or forceful signaling of future events.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The portention was good, so we proceeded with the plan.","correct":"✓ The portents were good, so we proceeded with the plan.","note":"Use 'portents' (plural of 'portent') when referring to multiple signs or omens. 'Portention' is more about the overall sense of foreshadowing."},{"incorrect":"✗ He had a strong portention about the accident.","correct":"✓ He had a strong premonition about the accident.","note":"While 'portention' relates to omens and signs, 'premonition' refers to a feeling or intuition about a future event."}],"priority":"★★☆"},"related_words":{"derivatives":["portent","portentous"],"related_concepts":["omen","augury","divination","prophecy","soothsaying"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Portention' is a formal and relatively uncommon noun that signifies an omen or sign foreshadowing a future event, often of great importance or negative consequence. It is used to describe something that serves as a predictive indication. Understanding this word requires a good grasp of abstract concepts and literary vocabulary."},"example_sentences":[{"sentence":"The sudden silence in the forest was a chilling portention of danger.","translation":"森の突然の静寂は、危険を予感させる身の毛もよだつ前兆だった。","type":"noun","meaning_category":"omen"},{"sentence":"Ancient cultures often interpreted natural phenomena as portentions of divine will.","translation":"古代文化では、自然現象が神の意志の前兆として解釈されることが多かった。","type":"noun","meaning_category":"omen"}]}