{"word":"sphere-descended","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"天球から降りてきた、高貴な血統の","english_definition":"Having a noble or exalted origin, as if descended from the heavens or celestial spheres.","examples":[{"sentence":"The queen was seen as a sphere-descended ruler, blessed by the gods.","translation":"女王は神々に祝福された、天球から降りてきたような高貴な支配者と見なされていた。"},{"sentence":"His sphere-descended wisdom was evident in his every decision.","translation":"彼の天球から降りてきたような知恵は、彼のすべての決定に明らかだった。"}],"collocations":["sphere-descended wisdom","sphere-descended ruler","sphere-descended lineage"],"synonyms":["noble","exalted","divine","celestial","heavenly","highborn"],"antonyms":["lowborn","common","earthly","mundane"]}],"etymology":{"value":"The term combines \"sphere,\" referring to the celestial spheres in ancient cosmology, and \"descended,\" indicating a downward motion or origin. The concept suggests a connection to the divine or the heavens.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsfɪər dɪˈsɛndɪd/","syllables":"sphere-de-scend-ed"},"inflection":{},"usage_notes":{"explanation":"This term is often used metaphorically to describe someone of high status, exceptional talent, or divine origin. It evokes a sense of awe and reverence, suggesting that the individual possesses qualities that are not of this world. It is relatively rare in modern usage, primarily found in literary or historical contexts.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["sphere","descended","descent"],"related_concepts":["celestial sphere","divine right of kings","cosmology"]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The word 'sphere-descended' is a relatively uncommon and literary term. It implies that someone or something has an origin in the celestial spheres, suggesting a divine or extremely noble lineage. Understanding this word requires knowledge of historical cosmology and metaphorical language use."},"example_sentences":[{"sentence":"The artist's work possessed a sphere-descended quality, as if inspired by the heavens themselves.","translation":"その芸術家の作品は、まるで天国そのものからインスピレーションを受けたかのような、天球から降りてきたような性質を持っていた。","type":"adjective","meaning_category":"高貴な血統"},{"sentence":"Legends spoke of a sphere-descended hero who would save the kingdom from darkness.","translation":"伝説は、王国を闇から救う天球から降りてきた英雄について語っていた。","type":"adjective","meaning_category":"高貴な血統"}]}