{"word":"unparochialism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"偏狭さのなさ、視野の広さ、国際性","english_definition":"The quality of not being limited to a narrow outlook or scope; broad-mindedness; cosmopolitanism.","examples":[{"sentence":"His unparochialism allowed him to appreciate cultures from around the world.","translation":"彼の視野の広さのおかげで、彼は世界中の文化を理解することができた。"},{"sentence":"The company's success is due to its unparochialism and willingness to embrace new ideas.","translation":"その会社の成功は、偏狭さのなさ、そして新しい考えを受け入れる意欲のおかげである。"}],"collocations":["demonstrate unparochialism (視野の広さを示す)","promote unparochialism (視野の広さを促進する)","intellectual unparochialism (知的な視野の広さ)"],"synonyms":["broad-mindedness","cosmopolitanism","open-mindedness","universality","tolerance"],"antonyms":["parochialism","narrow-mindedness","provincialism","intolerance"]}],"etymology":{"value":"\"un-\" (否定の接頭辞) + \"parochialism\" (教区主義、偏狭さ)","priority":"★★★"},"pronunciation":{"ipa":"/ˌʌnpəˈroʊkiəlɪzəm/","syllables":"un-pa-ro-chi-al-ism"},"inflection":{"noun_plural":"unparochialisms (まれ)"},"usage_notes":{"explanation":"\"Unparochialism\" is the opposite of \"parochialism,\" which refers to a limited or narrow outlook, typically focused on local concerns. \"Unparochialism\" therefore describes a broad, open-minded perspective that is not restricted by local or regional biases. It often implies an understanding and appreciation of diverse cultures and ideas.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a great parochialism in his views.","correct":"✓ He showed a great unparochialism in his views.","note":"Make sure to use the correct prefix (un-) to indicate the opposite of parochialism."}],"priority":"★★☆"},"related_words":{"derivatives":["unparochial (adjective)"],"antonyms":["parochialism","provincialism","narrow-mindedness"],"related_concepts":["globalization","cultural exchange","international relations"]},"level_frequency":{"frequency_google_ngram":"Low Frequency - 専門的な文脈や学術的な議論で使われることが多い。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Unparochialism\" is a relatively uncommon word that describes the quality of having a broad and open-minded perspective, free from the limitations of local or regional biases. It's often used in discussions about globalization, cultural understanding, and intellectual openness. Understanding the root word \"parochialism\" is helpful in grasping the meaning of \"unparochialism.\""},"example_sentences":[{"sentence":"The university aims to foster unparochialism among its students through international exchange programs.","translation":"大学は、国際交流プログラムを通じて、学生たちの視野の広さを育むことを目指している。","type":"general","meaning_category":"視野の広さ"},{"sentence":"Her unparochialism was evident in her willingness to learn from people of different backgrounds.","translation":"彼女の視野の広さは、異なる背景を持つ人々から学ぶ意欲に明らかだった。","type":"general","meaning_category":"視野の広さ"}]}