{"word":"Antiatheism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"反無神論：無神論に反対する立場、または無神論の否定を推進する立場。","english_definition":"Opposition to atheism; the position that atheism is harmful or destructive.","examples":[{"sentence":"Antiatheism is often associated with the belief that religion is necessary for morality and social order.","translation":"反無神論は、道徳や社会秩序には宗教が必要であるという信念と関連付けられることが多い。"},{"sentence":"Some argue that antiatheism can lead to discrimination against atheists.","translation":"反無神論は無神論者に対する差別につながる可能性があると主張する人もいる。"}],"collocations":["promote antiatheism (反無神論を推進する)","criticize antiatheism (反無神論を批判する)","rise of antiatheism (反無神論の高まり)"],"synonyms":["anti-atheist","opposition to atheism"],"antonyms":["atheism","pro-atheism"]},{"part_of_speech":"noun","definition":"無神論に対する敵意または偏見。","english_definition":"Hostility or prejudice against atheism.","examples":[{"sentence":"The politician's speech was seen by many as an expression of antiatheism.","translation":"その政治家の演説は、多くの人によって反無神論の表明と見なされた。"}],"collocations":["religious antiatheism (宗教的な反無神論)","secular antiatheism (世俗的な反無神論)"],"synonyms":["prejudice against atheism","discrimination against atheism"],"antonyms":["acceptance of atheism","tolerance of atheism"]}],"etymology":{"value":"\"Anti-\" (反対) + \"atheism\" (無神論)","priority":"★★★"},"pronunciation":{"ipa":"/ˌæntiˈeɪθiɪzəm/","syllables":"an-ti-a-the-ism"},"inflection":{"noun_plural":"antiatheisms"},"usage_notes":{"explanation":"\"Antiatheism\" refers to the opposition to atheism. It can range from philosophical arguments against the validity or desirability of atheism to active hostility or discrimination towards atheists. It's important to distinguish antiatheism from theism (belief in God or gods), as not all theists are antiatheists.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an antiatheist, so he doesn't believe in God.","correct":"✓ He is an antiatheist, so he opposes atheism.","note":"Antiatheists oppose atheism; they are not atheists themselves."}],"priority":"★★★"},"related_words":{"derivatives":["antiatheist (noun, adjective)"],"related_terms":["theism","atheism","agnosticism","religion","secularism"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Antiatheism' is a relatively uncommon term referring to opposition to atheism. It's often used in philosophical or sociological discussions about religion and belief. Understanding the term requires familiarity with concepts like atheism, theism, and religious belief systems. It's important to note that antiatheism is not the same as theism; it specifically denotes opposition to atheism, which can manifest in various forms, from philosophical arguments to social discrimination."},"example_sentences":[{"sentence":"The debate centered on the role of religion in public life and the rise of antiatheism.","translation":"議論は、公共生活における宗教の役割と反無神論の高まりに集中した。","type":"general"},{"sentence":"Some critics argue that certain forms of antiatheism promote intolerance.","translation":"一部の批評家は、特定の形態の反無神論が不寛容を助長すると主張している。","type":"general"}]}