{"word":"boneblack","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"骨炭、骨を焼いて作った黒色の顔料","english_definition":"A black pigment made by charring animal bones; also known as animal charcoal.","examples":[{"sentence":"Boneblack is used as a pigment in artists' paints.","translation":"骨炭は、アーティストの絵の具の顔料として使用されます。"},{"sentence":"Boneblack was historically used in sugar refining to remove color impurities.","translation":"骨炭は、歴史的に砂糖精製において、色の不純物を取り除くために使用されていました。"}],"collocations":["animal charcoal","ivory black","bone char"],"synonyms":["animal charcoal","ivory black"],"antonyms":[]}],"etymology":{"value":"From \"bone\" + \"black\". Refers to the black pigment derived from animal bones.","priority":"★★★"},"pronunciation":{"ipa":"/ˈboʊnˌblæk/","syllables":"bone-black"},"inflection":{"noun_plural":"boneblacks"},"usage_notes":{"explanation":"Boneblack is a fine black pigment produced by heating animal bones in the absence of air. It is chemically composed primarily of calcium phosphate and carbon. It is used as a black pigment in various applications, including artists' paints, calligraphy inks, and other coloring materials. Historically, it was also used in sugar refining to decolorize raw sugar.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Bone black is a type of bone meal used for fertilizer.","correct":"✓ Boneblack is a black pigment, while bone meal is used as fertilizer.","note":"Boneblack is a pigment, whereas bone meal is a fertilizer made from ground bones."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"Boneblack is a specialized term referring to a black pigment derived from charred animal bones. Its usage is primarily in art, historical contexts related to sugar refining, and technical discussions about pigments and materials. Due to its specific application, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The artist used boneblack to create deep shadows in the painting.","translation":"その画家は骨炭を使って、絵に深い影を作った。","type":"example","meaning_category":"pigment"},{"sentence":"Boneblack was once a key component in the sugar decolorization process.","translation":"骨炭はかつて、砂糖の脱色工程における重要な成分だった。","type":"example","meaning_category":"historical use"}]}