{"word":"preborrowing","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(図書館などで)予約資料の貸し出し準備が完了したことを示す通知","english_definition":"A notification indicating that a reserved item is ready for pickup at a library or similar institution.","examples":[{"sentence":"I received a preborrowing notification from the library, so I can pick up the book tomorrow.","translation":"図書館から予約資料の貸し出し準備完了通知が来たので、明日その本を取りに行けます。"}],"collocations":["receive a preborrowing notification","check preborrowing status"],"synonyms":["hold request fulfillment","ready for pickup notification"],"antonyms":["overdue notice","renewal notice"]}],"etymology":{"value":"The word is formed by combining the prefix 'pre-' (meaning 'before' or 'in advance') with 'borrowing', indicating that the notification occurs before the actual borrowing takes place.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpriːˈbɒroʊɪŋ/","syllables":"pre-bor-row-ing"},"inflection":{"noun_plural":"preborrowings"},"usage_notes":{"explanation":"'Preborrowing' is a relatively new term, primarily used in the context of library services and online reservation systems. It specifically refers to the notification sent to a patron when a requested item is available for them to borrow. It is not a widely used term outside of this specific context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"I got a preborrowing, so I returned the book.","correct":"I got a preborrowing, so I picked up the book.","note":"A preborrowing notification indicates that a book is ready to be borrowed, not returned."}],"priority":"★★☆"},"related_words":{"derivatives":["borrow","borrowing","pre-"],"related_terms":["hold request","library notification","pickup notice"]},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in library-related contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Preborrowing' is a specialized term primarily used in library settings. It refers to the notification a patron receives when a book or other item they have reserved is ready to be picked up. The term is not commonly used in everyday conversation and is mainly encountered in library communications or online library systems."},"example_sentences":[{"sentence":"The library's automated system sends a preborrowing email when a reserved book becomes available.","translation":"図書館の自動システムは、予約された本が利用可能になると、貸し出し準備完了のメールを送信します。","type":"noun","meaning_category":"notification"},{"sentence":"Check your online account to see if you have any preborrowing notifications.","translation":"オンラインアカウントを確認して、貸し出し準備完了通知があるかどうか確認してください。","type":"noun","meaning_category":"notification"}]}