{"word":"cohibitive","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"(価格などが)高すぎて手が出ない、抑制的な、禁止的な","english_definition":"(especially of prices) so high as to prevent purchase or use; tending to restrain or prohibit.","examples":[{"sentence":"The cost of the treatment was cohibitive for many patients.","translation":"その治療費は多くの患者にとって高すぎて手が出なかった。"},{"sentence":"The government imposed cohibitive taxes on imported goods.","translation":"政府は輸入品に抑制的な税金を課した。"},{"sentence":"The regulations were cohibitive, effectively banning the practice.","translation":"その規制は禁止的であり、事実上その慣行を禁止していた。"}],"collocations":["cohibitive cost (高すぎる費用)","cohibitive price (高すぎる価格)","cohibitive tax (抑制的な税金)","cohibitive regulations (禁止的な規制)"],"synonyms":["prohibitive","restrictive","deterrent","inhibitory","expensive","unaffordable"],"antonyms":["affordable","encouraging","permissive","accessible"]}],"etymology":{"value":"Late Middle English: from late Latin cohibit- ‘restrained’ (from the verb cohibere, from co- ‘together’ + habere ‘hold’) + -ive.","priority":"★★☆"},"pronunciation":{"ipa":"/koʊˈhɪbɪtɪv/","syllables":"co-hib-i-tive"},"inflection":{"notes":"Adjectives do not inflect in English."},"usage_notes":{"explanation":"'**Cohibitive**' is typically used to describe something, most often a price or cost, that is so high it prevents people from buying or using something. It can also describe regulations or taxes that are designed to discourage or prevent certain activities. It is a more formal word than 'expensive' or 'high'. It implies a deliberate act of making something inaccessible or difficult through high cost or strict rules.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The weather was cohibitive, so we stayed inside.","correct":"✓ The weather was terrible, so we stayed inside.","note":"'Cohibitive' is usually related to prices, costs, taxes, or regulations that prevent access or use. Use 'terrible', 'bad', or 'unpleasant' to describe weather."},{"incorrect":"✗ The cohibitive child was quiet and shy.","correct":"✓ The inhibited child was quiet and shy.","note":"'Cohibitive' is not used to describe a person's personality. Use 'inhibited' to describe someone who is shy or restrained."}],"priority":"★★☆"},"related_words":{"derivatives":["cohibit (verb: to restrain, check, or repress)","cohibition (noun: the act of restraining or repressing)"],"related_concepts":["deterrence","restriction","prohibition","regulation"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"cohibitive\" is a formal and relatively uncommon adjective. It describes something, usually a price or cost, that is so high it prevents people from buying or using it. It can also describe rules or laws that are designed to stop people from doing something. Because it is not a common word, it is more likely to be found in formal writing or speech."},"example_sentences":[{"sentence":"The cohibitive entrance fees kept many families away from the museum.","translation":"高すぎる入場料が多くの家族を博物館から遠ざけた。","type":"adjective","meaning_category":"高すぎて手が出ない"},{"sentence":"The cohibitive taxes on cigarettes are intended to discourage smoking.","translation":"タバコに対する抑制的な税金は喫煙を抑制することを目的としている。","type":"adjective","meaning_category":"抑制的な"},{"sentence":"The cohibitive regulations made it nearly impossible to start a new business in the city.","translation":"その禁止的な規制により、市内での新規事業開始はほぼ不可能になった。","type":"adjective","meaning_category":"禁止的な"}]}