{"word":"Cryptodirous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(動物学) 潜頸亜目（カメの一分類群）に属する","english_definition":"Belonging to the suborder Cryptodira (a group of turtles).","examples":[{"sentence":"The cryptodirous turtles are characterized by their ability to retract their necks straight back into their shells.","translation":"潜頸亜目のカメは、首をまっすぐ甲羅の中に引っ込めることができるのが特徴です。"}],"collocations":["cryptodirous turtle","cryptodirous neck retraction"],"synonyms":["hidden-necked","cryptodire"],"antonyms":["pleurodirous"]}],"etymology":{"value":"From the Greek words 'crypto-' (hidden) and 'dirus' (neck), referring to the way these turtles retract their necks.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkrɪptoʊˈdaɪrəs/","syllables":"cryp-to-di-rous"},"inflection":{},"usage_notes":{"explanation":"'Cryptodirous' is a technical term used in zoology to classify turtles based on their neck retraction mechanism. They retract their necks straight back into the shell, unlike pleurodirous turtles which bend their necks sideways.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cryptodirous turtle bends its neck to the side.","correct":"✓ The cryptodirous turtle retracts its neck straight back.","note":"Cryptodirous turtles retract their necks straight back, while pleurodirous turtles bend them sideways."}],"priority":"★☆☆"},"related_words":{"derivatives":["Cryptodira (noun: the suborder of turtles)"],"related_terms":["Pleurodirous (adjective: side-necked turtles)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Cryptodirous' is a highly specialized term used in zoology to describe a specific group of turtles. Understanding this term requires knowledge of biological classification and turtle anatomy. It is unlikely to be encountered outside of scientific contexts.","note":"This term is primarily used in scientific literature and is not commonly encountered in general English.","priority":"★☆☆"},"example_sentences":[{"sentence":"Most modern turtles are cryptodirous, meaning they retract their necks straight back into their shells.","translation":"現代のカメのほとんどは潜頸亜目に属し、首をまっすぐ甲羅の中に引っ込めます。","type":"general","meaning_category":"classification"},{"sentence":"The evolutionary history of cryptodirous turtles is complex and not fully understood.","translation":"潜頸亜目のカメの進化の歴史は複雑で、完全には解明されていません。","type":"scientific","meaning_category":"evolution"}]}