{"word":"garpike","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(魚)ガーパイク","english_definition":"Any of several North American fishes of the genus Lepisosteus, having a long, slender body and a long, beak-like snout with many sharp teeth.","examples":[{"sentence":"The garpike is a prehistoric-looking fish.","translation":"ガーパイクは先史時代のような見た目の魚です。"},{"sentence":"Garpike are known for their ability to survive in low-oxygen waters.","translation":"ガーパイクは低酸素水域で生き残る能力で知られています。"}],"collocations":["catch a garpike","garpike fishing","longnose garpike","spotted garpike"],"synonyms":["gar","Lepisosteus"],"antonyms":[]},{"part_of_speech":"noun","definition":"(魚)ガーパイクの肉","english_definition":"The flesh of the garpike fish, used as food.","examples":[{"sentence":"Garpike meat is not widely consumed due to its tough texture.","translation":"ガーパイクの肉は、その硬い食感のため、広く消費されていません。"}],"collocations":["garpike fillet","cooked garpike"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Combination of 'gar' (from Old English gār, meaning spear, referring to the fish's snout) and 'pike' (referring to its resemblance to the pike fish).","priority":"★★☆"},"pronunciation":{"ipa":"ˈɡɑːrpaɪk","syllables":"gar-pike"},"inflection":{"noun_plural":"garpikes"},"usage_notes":{"explanation":"'Garpike' refers specifically to fish of the genus Lepisosteus, native to North America. They are characterized by their elongated bodies and long, toothy snouts. While they are edible, their meat is not commonly eaten due to its toughness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"I saw a garpike in the ocean.","correct":"I saw a garpike in the river.","note":"Garpike are freshwater fish, so they are found in rivers and lakes, not the ocean."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Garpike' is a relatively uncommon word referring to a specific type of fish found in North America. Understanding this word requires familiarity with zoological terms and North American wildlife. Its usage is limited to contexts discussing these specific fish or related topics.","priority":"★★☆"},"example_sentences":[{"sentence":"The angler was surprised to reel in a large garpike.","translation":"釣り人は大きなガーパイクを釣り上げて驚いた。","type":"noun","meaning_category":"fish"},{"sentence":"Some cultures have traditionally used garpike scales for decorative purposes.","translation":"一部の文化では、伝統的にガーパイクの鱗を装飾目的で使用してきました。","type":"noun","meaning_category":"fish"}]}