{"word":"Platonised","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(過去形・過去分詞) プラトン化された、プラトン主義の影響を受けた","english_definition":"(past tense and past participle) Having been influenced by or made to conform to Platonic ideals or philosophy.","examples":[{"sentence":"The art of the Renaissance became increasingly Platonised, emphasizing ideal forms.","translation":"ルネサンスの芸術はますますプラトン化され、理想的な形態を強調するようになった。"},{"sentence":"His views on love were Platonised, focusing on spiritual rather than physical connection.","translation":"彼の愛に関する見解はプラトン化され、肉体的なつながりよりも精神的なつながりに焦点を当てていた。"}],"collocations":["Platonised art","Platonised love","Platonised philosophy"],"synonyms":["influenced by Plato","Platonic","idealized"],"antonyms":["materialistic","realistic","unidealized"]}],"etymology":{"value":"The word \"Platonised\" is derived from the verb \"Platonise,\" which comes from \"Plato,\" the ancient Greek philosopher, and the suffix \"-ise\" (or \"-ize\"), indicating the process of making something like or conforming to Plato's ideas.","priority":"★★☆"},"pronunciation":{"ipa":"ˈpleɪtənaɪzd","syllables":"Pla-to-nised"},"inflection":{"verb_forms":{"present_simple":["Platonise","Platonises"],"past_simple":"Platonised","past_participle":"Platonised","present_participle":"Platonising"}},"usage_notes":{"explanation":"\"Platonised\" is used to describe something that has been influenced by or made to conform to the philosophical ideas of Plato, particularly his theory of Forms, which emphasizes ideal and abstract concepts over the physical world. It often implies a focus on the ideal, the abstract, or the spiritual, rather than the material or practical.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building was Platonised with gold.","correct":"✓ The building was gilded with gold.","note":"\"Platonised\" refers to philosophical influence, not literal ornamentation."}],"priority":"★☆☆"},"related_words":{"derivatives":["Platonise (verb): to make Platonic or to influence with Platonic ideas","Platonism (noun): the philosophy of Plato","Platonist (noun): a follower of Plato's philosophy","Platonic (adjective): relating to Plato or his philosophy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Platonised\" is a specialized term used in the context of philosophy, art history, and intellectual discourse. It describes something that has been influenced by or made to conform to the philosophical ideas of Plato, particularly his theory of Forms, which emphasizes ideal and abstract concepts over the physical world. Understanding this term requires familiarity with Platonic philosophy and its influence on various fields."},"example_sentences":[{"sentence":"The medieval concept of courtly love was often Platonised, emphasizing spiritual devotion over physical desire.","translation":"中世の宮廷愛の概念はしばしばプラトン化され、肉体的な欲望よりも精神的な献身を強調した。","type":"verb (past participle)","meaning_category":"プラトン主義の影響を受けた"},{"sentence":"Renaissance artists Platonised classical forms, seeking to capture ideal beauty.","translation":"ルネサンスの芸術家たちは古典的な形式をプラトン化し、理想的な美しさを捉えようとした。","type":"verb (past participle)","meaning_category":"プラトン主義の影響を受けた"}]}