{"word":"appendance","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"付加物、付属物、付属品","english_definition":"Something that is added or attached to something else; an appendage or accessory.","examples":[{"sentence":"The document included several appendances containing supporting data.","translation":"その文書には、裏付けとなるデータを含むいくつかの付加物が含まれていました。"},{"sentence":"The building's design featured various architectural appendances.","translation":"その建物のデザインは、さまざまな建築的な付属品を特徴としていました。"},{"sentence":"The software update included several useful appendances.","translation":"そのソフトウェアアップデートには、いくつかの便利な付属品が含まれていました."}],"collocations":["architectural appendance","useful appendance","supporting appendance"],"synonyms":["appendage","accessory","addition","attachment","adjunct","supplement"],"antonyms":["core","main part","essential element"]}],"etymology":{"value":"Derived from the word 'append', which comes from the Latin 'appendere', meaning 'to hang upon' or 'to attach'. The suffix '-ance' indicates a state, quality, or action.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈpɛndəns/","syllables":"ap-pen-dance"},"inflection":{"noun_plural":"appendances"},"usage_notes":{"explanation":"'Appendance' is a relatively formal term for something added or attached to a main part. It is often used in technical or formal contexts. It is similar to 'appendage' but can also refer to less tangible additions, such as supporting data in a document.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The appendance of the body was injured.","correct":"✓ The appendage of the body was injured.","note":"'Appendage' is more commonly used when referring to body parts or limbs. 'Appendance' is more often used for non-biological additions or attachments."},{"incorrect":"✗ The appendance was essential to the function.","correct":"✓ The main part was essential to the function.","note":"'Appendance' refers to something additional, not essential. If it's essential, it's not an 'appendance'."}],"priority":"★☆☆"},"related_words":{"derivatives":["append","appendant","appendicular"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Appendance' is a formal term referring to something added to a main part, often in technical or written contexts. It is less common than 'appendage' or 'accessory'. Understanding its usage requires a good vocabulary and comprehension of formal language.","priority":"★☆☆"},"example_sentences":[{"sentence":"The report included an appendance with detailed financial statements.","translation":"そのレポートには、詳細な財務諸表を含む付加物が含まれていました。","type":"noun","meaning_category":"付加物"},{"sentence":"The software had several appendances that enhanced its functionality.","translation":"そのソフトウェアには、その機能を強化するいくつかの付属品がありました。","type":"noun","meaning_category":"付属品"},{"sentence":"The historical document had several appendances added over the centuries.","translation":"その歴史的な文書には、何世紀にもわたって追加されたいくつかの付加物がありました。","type":"noun","meaning_category":"付加物"}]}