{"word":"subinfeudatory","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(歴史)再封建制の、再分封建制の：封建領主が、自らの領地の一部をさらに下位の領主に分与するシステムに関連する、またはそのシステムを用いる。","english_definition":"(historical) Relating to or using subinfeudation: the system by which a feudal lord grants part of his land to another, who then becomes a vassal of the lord.","examples":[{"sentence":"The subinfeudatory system was common in medieval England.","translation":"再分封建制は中世イングランドで一般的だった。"},{"sentence":"Under the subinfeudatory system, a tenant-in-chief could create his own manorial court.","translation":"再分封建制の下では、首位保有者は自身の荘園裁判所を設立することができた。"}],"collocations":["subinfeudatory system","subinfeudatory tenure","subinfeudatory grant"],"synonyms":["vassalage","feudal","manorial"],"antonyms":["allodial"],"notes":"This term is primarily used in a historical context when discussing feudal systems."}],"etymology":{"value":"Derived from 'sub-' (meaning 'under' or 'below'), 'infeudate' (meaning 'to grant as a fief'), and '-ory' (forming an adjective). Essentially, it describes something related to the act of granting land to a sub-vassal.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsʌbɪnˈfjuːdəˌtɔːri/","syllables":"sub-in-feu-da-to-ry"},"inflection":{"notes":"This word does not have typical inflections as it is primarily an adjective."},"usage_notes":{"explanation":"The term 'subinfeudatory' specifically refers to the historical practice of subinfeudation within feudal societies. It describes the relationships and systems created when a vassal further divided their land among sub-vassals. This practice was eventually restricted or abolished in many countries to prevent the fragmentation of land ownership and to strengthen the direct relationship between the monarch and landholders.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The modern land ownership is subinfeudatory.","correct":"✓ Modern land ownership is not subinfeudatory; it is based on direct ownership.","note":"Subinfeudation is a historical system and generally does not apply to modern land ownership structures."}],"priority":"★☆☆"},"related_words":{"derivatives":["subinfeudation (名詞: 再分封建制)","infeudation (名詞: 封建化)"],"phrasal_verbs":[],"related_concepts":["feudalism","vassal","fief","manor","tenant-in-chief"]},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'subinfeudatory' is highly specialized and primarily used in historical contexts when discussing feudal systems. It refers to the practice of subinfeudation, where a vassal grants a portion of their land to another, creating a sub-vassal. Understanding this term requires knowledge of feudal history and land tenure systems. It is not commonly encountered in general English usage."},"example_sentences":[{"sentence":"The Statute of Quia Emptores aimed to prevent further subinfeudatory grants.","translation":"クィア・エンプトーレス法は、さらなる再分封建的譲渡を防ぐことを目的としていた。","type":"adjective","meaning_category":"再封建制の"},{"sentence":"The subinfeudatory structure complicated land ownership records.","translation":"再分封建的な構造は、土地所有記録を複雑にした。","type":"adjective","meaning_category":"再封建制の"}]}