{"word":"congregationalize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"会衆派教会にする、会衆派の組織にする","english_definition":"To organize according to Congregational principles; to cause to conform to Congregationalism.","examples":[{"sentence":"The movement to congregationalize the churches in the region faced strong opposition.","translation":"その地域の教会を会衆派教会にする運動は、強い反対に直面した。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From 'congregational' (referring to Congregationalism, a form of Protestant church governance) + '-ize' (a suffix indicating the process of making something conform to a particular type).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkɒŋɡrɪˈɡeɪʃənəˌlaɪz/","syllables":"con-gre-ga-tion-al-ize"},"inflection":{"verb_forms":{"present_simple":["congregationalize","congregationalizes"],"past_simple":"congregationalized","past_participle":"congregationalized","present_participle":"congregationalizing"}},"usage_notes":{"explanation":"This verb is relatively rare and specific to the context of church governance and history. It describes the act of bringing a church or organization into alignment with the principles of Congregationalism, a Protestant Christian tradition where each local church is self-governing.","priority":"★☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["congregational (adjective)","congregationalism (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'congregationalize' is a highly specialized term primarily used in historical or religious contexts related to church governance. Understanding requires familiarity with the principles of Congregationalism, a specific form of Protestant church organization. Due to its rarity and specialized usage, it is not commonly encountered.","priority":"★☆☆"},"example_sentences":[{"sentence":"The reformers sought to congregationalize the existing parish structure.","translation":"改革者たちは既存の教区組織を会衆派教会にしようと試みた。","type":"verb","meaning_category":"会衆派教会にする"},{"sentence":"They debated whether to congregationalize the mission's administrative functions.","translation":"彼らは伝道所の管理機能を会衆派の組織にするかどうか議論した。","type":"verb","meaning_category":"会衆派の組織にする"}]}