{"word":"sussultatory","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"Characterized by leaps or jumps; leaping; jumping.","english_definition":"Characterized by leaps or jumps; leaping; jumping.","examples":[{"sentence":"The child's sussultatory movements across the playground were full of energy.","translation":"遊び場を飛び跳ねる子供の動きは、エネルギーに満ち溢れていた。"},{"sentence":"The frog's sussultatory locomotion is well-suited for its environment.","translation":"カエルの跳躍運動は、その環境に適している。"}],"collocations":["sussultatory motion","sussultatory locomotion","sussultatory behavior"],"synonyms":["leaping","jumping","saltatory","bounding","hopping"],"antonyms":["steady","continuous","smooth","gliding"]}],"etymology":{"value":"Derived from the Latin word 'sussultare,' meaning 'to leap up, spring up,' which is the frequentative of 'subsilire,' meaning 'to leap up.'","priority":"★★★"},"pronunciation":{"ipa":"/səˈsʌltətɔːri/","syllables":"sus-sul-ta-to-ry"},"inflection":{"notes":"Comparative and superlative forms are 'more sussultatory' and 'most sussultatory', respectively, as it's an adjective."},"usage_notes":{"explanation":"'Sussultatory' is a relatively rare word, primarily used in scientific or technical contexts to describe movement characterized by leaps or jumps. It is more precise than simply saying 'jumping' because it implies a specific type of locomotion or motion involving distinct leaps.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The car moved in a sussultatory manner down the road.","correct":"✓ The car moved in a jerky manner down the road.","note":"'Sussultatory' refers to leaping or jumping motions, not jerky or uneven movements. Use 'jerky' or 'uneven' for the car example."},{"incorrect":"✗ The sussultatory rhythm of the music made it hard to dance to.","correct":"✓ The syncopated rhythm of the music made it hard to dance to.","note":"'Sussultatory' describes physical movement, not rhythm. Use 'syncopated' or 'irregular' to describe the music's rhythm."}],"priority":"★★☆"},"related_words":{"derivatives":["sussultation (noun: the act of leaping or jumping)","sussultorial (adjective: relating to leaping or jumping)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sussultatory' is a specialized term used to describe movement characterized by leaping or jumping. It is not commonly used in everyday language and is more likely to be found in scientific, zoological, or technical contexts when describing a specific type of locomotion. Understanding the Latin root 'sussultare' (to leap up) helps to grasp the word's meaning.","example_sentences":[]}}