{"word":"rachitides","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"くる病 (rickets)","english_definition":"A disease of childhood, caused by a deficiency of vitamin D, characterized by soft, deformed bones.","examples":[{"sentence":"Rachitides can be prevented by adequate vitamin D intake.","translation":"くる病は、十分なビタミンD摂取によって予防できます。"},{"sentence":"In the past, rachitides was a common childhood illness.","translation":"かつて、くる病は一般的な小児疾患でした。"}],"collocations":["vitamin D deficiency rachitides (ビタミンD欠乏性くる病)","nutritional rachitides (栄養性くる病)"],"synonyms":["rickets","osteomalacia (adult form)"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'rhachis' meaning spine, and the suffix '-itis' indicating inflammation. Although rachitis is not primarily an inflammatory condition, the name stuck.","priority":"★★☆"},"pronunciation":{"ipa":"/rəˈkɪtɪdiːz/","syllables":"ra-chi-ti-des"},"inflection":{"noun_plural":"rachitides (already plural, refers to the condition)","notes":"This is a plural noun, even when referring to a single case of the disease."},"usage_notes":{"explanation":"'Rachitides' is a less common, more technical term for rickets. 'Rickets' is the more frequently used term in general conversation. Rachitides specifically refers to the disease state, while rickets can also refer to the underlying condition.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has a rachitide.","correct":"✓ He has rachitides. / ✓ He has rickets.","note":"'Rachitides' is a plural noun, even when referring to a single case. 'Rickets' can be used in both singular and plural contexts, but is generally treated as singular."}],"priority":"★★☆"},"related_words":{"derivatives":["rachitic (adjective: relating to or affected by rachitides/rickets)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (technical/medical vocabulary)","frequency_google_ngram":"Very low frequency - Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Rachitides' is a medical term for rickets, a disease caused by vitamin D deficiency leading to soft bones. It's a technical term, less frequently used than 'rickets' in common language. Understanding this word is more relevant in medical or scientific contexts."},"example_sentences":[{"sentence":"The doctor diagnosed the child with rachitides.","translation":"医師はその子供をくる病と診断した。","type":"noun","meaning_category":"disease"},{"sentence":"Early detection of rachitides is crucial for proper treatment.","translation":"くる病の早期発見は適切な治療に不可欠です。","type":"noun","meaning_category":"disease"}]}