{"word":"half-proletarian","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"半プロレタリア、半無産者：一部の生産手段を所有しながら、主に賃労働によって生計を立てる人々。","english_definition":"A person who owns some means of production but relies primarily on wage labor for income.","examples":[{"sentence":"The rural population was largely composed of half-proletarians who owned small plots of land but also worked as agricultural laborers.","translation":"農村人口は、小さな土地を所有しながらも農業労働者として働く半プロレタリアで大部分が構成されていた。"},{"sentence":"The rise of industrial capitalism created a large class of half-proletarians who were neither fully independent nor fully dependent on wage labor.","translation":"産業資本主義の台頭は、完全に独立しているわけでも、完全に賃労働に依存しているわけでもない、大規模な半プロレタリア階級を生み出した。"}],"collocations":["rural half-proletarian (農村半プロレタリア)","urban half-proletarian (都市半プロレタリア)","class of half-proletarians (半プロレタリア階級)"],"synonyms":["semi-proletarian","part-proletarian"],"antonyms":["proletarian","bourgeoisie"]},{"part_of_speech":"adjective","definition":"半プロレタリアの、半無産者の：半プロレタリア階級に属する、またはそれに関連する。","english_definition":"Relating to or belonging to the half-proletarian class.","examples":[{"sentence":"The half-proletarian family struggled to make ends meet, relying on both their small farm and seasonal labor.","translation":"その半プロレタリアの家族は、小さな農場と季節労働の両方に頼りながら、なんとか生活をやりくりしていた。"},{"sentence":"Half-proletarian status often led to precarious living conditions and economic instability.","translation":"半プロレタリアの地位は、不安定な生活環境と経済的不安定につながることが多かった。"}],"collocations":["half-proletarian status (半プロレタリアの地位)","half-proletarian family (半プロレタリアの家族)","half-proletarian background (半プロレタリアの出自)"],"synonyms":["semi-proletarian","part-proletarian"],"antonyms":["proletarian","bourgeois"]}],"etymology":{"value":"'Half-' + 'proletarian'. Reflects a socioeconomic position between owning no means of production (proletarian) and owning significant means of production (bourgeoisie).","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌhæf.proʊ.ləˈtɛəriən/","syllables":"half-pro-le-tar-i-an"},"inflection":{"noun_plural":"half-proletarians","adjective_forms":{}},"usage_notes":{"explanation":"The term 'half-proletarian' is used in Marxist theory to describe a class of people who are partially proletarian (working class) but also own some means of production, such as a small farm or workshop. They are not fully independent because they rely on wage labor to supplement their income. This term is less commonly used in contemporary discourse.","priority":"☆☆☆"},"common_mistakes":{},"related_words":{"derivatives":["proletarian","proletariat","bourgeoisie","semi-proletarian"],"phrases":[]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term 'half-proletarian' is a specialized term from Marxist theory, referring to individuals who are partially working class but also own some means of production. It is not commonly used in everyday language and requires an understanding of Marxist socioeconomic concepts."},"example_sentences":[{"sentence":"Many peasants in pre-revolutionary Russia were essentially half-proletarians.","translation":"革命前のロシアの多くの農民は、本質的に半プロレタリアであった。","type":"noun","meaning_category":"半プロレタリア"},{"sentence":"The family's half-proletarian existence meant they were always vulnerable to economic downturns.","translation":"その家族の半プロレタリアとしての生活は、常に景気後退に対して脆弱であることを意味していた。","type":"adjective","meaning_category":"半プロレタリアの"}]}