{"word":"uncausativeness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(言語学)非使役性、非能動性：ある動詞が、使役的な意味合いを持たない性質。","english_definition":"(linguistics) The property of a verb not having a causative meaning; the state of not being causative.","examples":[{"sentence":"The uncausativeness of the verb 'die' is evident in that it cannot be used to describe someone causing another to die directly.","translation":"動詞「die（死ぬ）」の非使役性は、誰かが他の人に直接死をもたらすことを記述するために使用できないことからも明らかである。"},{"sentence":"The concept of uncausativeness is important in understanding verb transitivity.","translation":"非使役性の概念は、動詞の他動性を理解する上で重要である。"}],"collocations":["verb uncausativeness","property of uncausativeness","linguistic uncausativeness"],"synonyms":["non-causativity","non-causation"],"antonyms":["causativeness","causation"]}],"etymology":{"value":"Derived from 'uncausative' (not causative) + '-ness' (suffix forming nouns denoting a state or quality). 'Uncausative' is formed from 'un-' (prefix denoting negation) + 'causative' (causing something).","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈkɔːzətɪvnəs/","syllables":"un-cau-sa-tive-ness"},"inflection":{"noun_plural":"uncausativenesses (rarely used)"},"usage_notes":{"explanation":"'Uncausativeness' is a technical term primarily used in linguistics, particularly in the study of verb transitivity and semantics. It refers to the inherent property of certain verbs that prevents them from being used in a causative sense, meaning they cannot describe an action where one entity directly causes another to perform the action. This is in contrast to causative verbs, which explicitly describe such a relationship.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The uncausativeness of the event led to confusion.","correct":"✓ The non-causality of the event led to confusion.","note":"'Uncausativeness' is specific to verbs in linguistics. For general events, 'non-causality' or 'lack of causation' is more appropriate."}],"priority":"★☆☆"},"related_words":{"derivatives":["uncausative (adjective)","causative (adjective, noun)","causation (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized vocabulary)","frequency_google_ngram":"Very low frequency - primarily used in academic linguistic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Uncausativeness' is a specialized term in linguistics that describes the characteristic of a verb that prevents it from expressing an action where one entity causes another to perform it. It's used in the context of analyzing verb transitivity and semantic roles, and is not commonly encountered outside of academic discussions in linguistics."},"example_sentences":[{"sentence":"The inherent uncausativeness of 'sleep' makes it difficult to construct a sentence where someone is directly causing another to sleep.","translation":"「眠る」という動詞の本来の非使役性により、誰かが他の人に直接眠らせる文を構成することは難しい。","type":"noun","meaning_category":"linguistics"}]}