{"word":"nonbourgeois","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"非ブルジョア的な、ブルジョア階級に属さない、またはブルジョア的価値観を持たない","english_definition":"Not bourgeois; not belonging to or characteristic of the bourgeoisie; not having bourgeois values or attitudes.","examples":[{"sentence":"The artist adopted a nonbourgeois lifestyle, rejecting material possessions and conventional social norms.","translation":"その芸術家は、物質的な所有物や従来の社会規範を拒否し、非ブルジョア的なライフスタイルを採用した。"},{"sentence":"The film explores the tensions between bourgeois respectability and nonbourgeois rebellion.","translation":"その映画は、ブルジョア的な体面と非ブルジョア的な反抗との間の緊張を探求している。"},{"sentence":"The character's nonbourgeois background shaped his political views.","translation":"その登場人物の非ブルジョア的な背景が、彼の政治的見解を形成した。"}],"collocations":["nonbourgeois values (非ブルジョア的な価値観)","nonbourgeois lifestyle (非ブルジョア的なライフスタイル)","nonbourgeois art (非ブルジョア的な芸術)","nonbourgeois culture (非ブルジョア的な文化)","nonbourgeois origins (非ブルジョア的な出自)"],"synonyms":["proletarian","working-class","anti-bourgeois","unconventional","bohemian"],"antonyms":["bourgeois","middle-class","conventional","establishment"],"notes":"Often used in sociological or political contexts to describe people, ideas, or movements that oppose or reject bourgeois norms and values."}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to 'bourgeois'. 'Bourgeois' comes from the Old French word 'burgeis', meaning 'town dweller' or 'freeman of a borough', which in turn derives from 'bourg' (a market town). The term originally referred to the middle class in medieval towns, but later acquired connotations of materialism, conformity, and conservatism.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɒnˈbʊərʒwɑː/","syllables":"non-bour-geois"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be modified by adverbs (e.g., 'very nonbourgeois')."},"usage_notes":{"explanation":"'Nonbourgeois' is used to describe something that is the opposite of 'bourgeois'. 'Bourgeois' can refer to the middle class, or to the values and attitudes associated with the middle class, such as materialism, conformity, and a concern for respectability. Therefore, 'nonbourgeois' can describe someone who is not middle class, or someone who rejects these values. The term often carries connotations of rebellion, unconventionality, or a rejection of mainstream society.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He lived a very bourgeois life, completely nonbourgeois.","correct":"✓ He lived a very bourgeois life, completely rejecting nonbourgeois values.","note":"'Bourgeois' and 'nonbourgeois' are opposites. It's contradictory to say someone lives a bourgeois life while being nonbourgeois. Instead, clarify what aspects of the bourgeois lifestyle are being rejected."},{"incorrect":"✗ The nonbourgeoisie supported the revolution.","correct":"✓ The nonbourgeois classes supported the revolution.","note":"'Nonbourgeois' is an adjective, not a noun. To refer to people who are not bourgeois, use phrases like 'nonbourgeois classes', 'nonbourgeois individuals', or use alternative terms like 'the proletariat' or 'the working class'."}],"priority":"★☆☆"},"related_words":{"derivatives":["nonbourgeoisie (noun, rare)","nonbourgeoisly (adverb, rare)"],"antonyms":["bourgeoisie (noun)","bourgeois (adjective/noun)"],"related_concepts":["proletariat","class struggle","socialism","Marxism","bohemianism","counterculture"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency. More common in academic or political discourse.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'nonbourgeois' is a relatively uncommon term, primarily used in academic, sociological, or political contexts. It describes something that is not bourgeois, meaning it does not belong to or reflect the values of the middle class, such as materialism, conformity, and respectability. Understanding this word requires familiarity with the concept of 'bourgeoisie' and its associated connotations. The term often implies a rejection of mainstream societal norms and values."},"example_sentences":[{"sentence":"The artist's work was a deliberate attempt to challenge bourgeois sensibilities and embrace a nonbourgeois aesthetic.","translation":"その芸術家の作品は、ブルジョア的な感性に挑戦し、非ブルジョア的な美学を受け入れる意図的な試みだった。","type":"adjective","meaning_category":"Rejecting bourgeois values"},{"sentence":"Many members of the counterculture movement sought to create a nonbourgeois society based on communal living and shared resources.","translation":"多くのカウンターカルチャー運動のメンバーは、共同生活と共有資源に基づいた非ブルジョア的な社会を創造しようとした。","type":"adjective","meaning_category":"Opposing bourgeois norms"},{"sentence":"The novel depicts the struggles of a family trying to maintain their nonbourgeois identity in a rapidly changing world.","translation":"その小説は、急速に変化する世界の中で非ブルジョア的なアイデンティティを維持しようとする家族の苦闘を描いている。","type":"adjective","meaning_category":"Not belonging to the bourgeoisie"}]}