{"word":"Bailors","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(law) Plural form of bailor; the party who temporarily transfers possession of property in a bailment.","english_definition":"The plural form of 'bailor', referring to multiple parties who entrust their property to another party (the bailee) for a specific purpose, without transferring ownership.","examples":[{"sentence":"The bailors retained ownership of the equipment while it was in the bailee's possession.","translation":"寄託者は、機器が受寄託者の占有下にある間も、その所有権を保持していた。"}],"collocations":["bailors and bailees","rights of bailors","obligations of bailors"],"synonyms":["consignors","transferors","grantors"],"antonyms":["bailees","receivers","transferees"]}],"etymology":{"value":"Derived from 'bailor,' which comes from the Middle English 'bailen' (to deliver), ultimately from Latin 'baiulare' (to carry a burden).","priority":"N/A"},"pronunciation":{"ipa":"/ˈbeɪlɔrz/","syllables":"Bay-lors"},"inflection":{"noun_plural":"Bailors"},"usage_notes":{"explanation":"'Bailors' refers specifically to the plural of 'bailor,' a legal term in bailment. Bailment is a legal relationship where physical possession of personal property, or chattel, is transferred from one person (the bailor) to another person (the bailee) who subsequently has possession of the property. The bailor retains ownership of the property.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"The bailors are responsible for the damage caused by the bailee.","correct":"The bailee is responsible for the damage caused by their negligence, but the bailors may be responsible if they failed to disclose known defects in the property.","note":"The bailee is typically responsible for damage caused by their negligence, not the bailors, unless the bailors failed to disclose known defects in the property."}],"priority":"N/A"},"related_words":{"derivatives":["bailor","bailment","bailee"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Bailors' is a legal term referring to multiple individuals who temporarily entrust their property to a bailee. Understanding its usage requires familiarity with legal concepts related to bailment, making it suitable for advanced learners or those studying law."},"example_sentences":[{"sentence":"The bailors signed a contract outlining the terms of the bailment.","translation":"寄託者たちは、寄託の条件を概説する契約書に署名した。","type":"noun","meaning_category":"legal"},{"sentence":"The rights of the bailors are protected under the bailment agreement.","translation":"寄託者の権利は、寄託契約に基づいて保護されている。","type":"noun","meaning_category":"legal"}]}