{"word":"nucleolus","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"核小体","english_definition":"A distinct structure present in the nucleus of eukaryotic cells, primarily involved in ribosome biogenesis.","examples":[{"sentence":"The nucleolus is the site of rRNA synthesis and ribosome assembly.","translation":"核小体はrRNA合成とリボソーム組み立ての場所です。"},{"sentence":"The size and number of nucleoli can vary depending on the cell's activity.","translation":"核小体のサイズと数は、細胞の活動によって変化することがあります。"},{"sentence":"The nucleolus disappears during mitosis and reforms in the daughter cells.","translation":"核小体は有糸分裂中に消失し、娘細胞で再形成されます。"}],"collocations":["nucleolus organizer region (NOR)","ribosome biogenesis","rRNA synthesis","nucleolar proteins"],"synonyms":["none (specific synonym, as it's a specific cell structure)"],"antonyms":["none (as it's a specific cell structure)"]}],"etymology":{"value":"From Latin 'nucleolus', diminutive of 'nucleus' (kernel, nut, nucleus).","priority":"★★★"},"pronunciation":{"ipa":"/njuːˈkliːələs/","syllables":"nu-cle-o-lus"},"inflection":{"noun_plural":"nucleoli"},"usage_notes":{"explanation":"The nucleolus is a key structure within the cell nucleus, essential for producing ribosomes, which are vital for protein synthesis. Its structure and function are closely tied to the cell's overall activity and growth.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The nucleolus is in prokaryotic cells.","correct":"✓ The nucleolus is in eukaryotic cells.","note":"Nucleoli are only found in eukaryotic cells, not prokaryotic cells."},{"incorrect":"✗ Nucleolus is for DNA replication.","correct":"✓ Nucleolus is for ribosome biogenesis.","note":"The primary function of the nucleolus is ribosome biogenesis, not DNA replication."}],"priority":"★★☆"},"related_words":{"derivatives":["nucleolar (adjective)"],"related_terms":["nucleus","ribosome","rRNA","chromosome"],"priority":"★★★"},"level_frequency":{"level":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in scientific contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The term 'nucleolus' refers to a specialized structure within the nucleus of eukaryotic cells. Its main function is ribosome biogenesis, which includes the synthesis and processing of ribosomal RNA (rRNA) and the assembly of ribosomes. Understanding the nucleolus is crucial in the context of molecular biology and cell biology, particularly when studying gene expression and protein synthesis. It is important to note that prokaryotic cells lack a nucleolus, as they do not have a membrane-bound nucleus. The term is predominantly used in scientific literature and advanced biology courses."},"example_sentences":[{"sentence":"The **nucleolus** plays a critical role in the production of ribosomes.","translation":"核小体はリボソームの生産において重要な役割を果たします。","type":"general","meaning_category":"function"},{"sentence":"Changes in the structure of the **nucleolus** can indicate cellular stress.","translation":"核小体の構造の変化は、細胞のストレスを示す可能性があります。","type":"research","meaning_category":"structure"},{"sentence":"The **nucleolus** organizer regions (NORs) are located on specific chromosomes.","translation":"核小体形成領域（NOR）は、特定の染色体上に位置しています。","type":"technical","meaning_category":"location"}]}