{"word":"semi-Salic","priority":"低","meanings":[{"part_of_speech":"adjective","definition":"準ザリーク法的な","english_definition":"Relating to or following a modified version of Salic law, typically allowing female succession to the throne or other hereditary positions in the absence of male heirs.","examples":[{"sentence":"The kingdom adopted a semi-Salic system, allowing the king's daughter to inherit the throne since he had no sons.","translation":"その王国は準ザリーク法を採用し、国王に息子がいなかったため、王女が王位を継承することを認めた。"},{"sentence":"Debates arose about whether the country's constitution should be interpreted as fully Salic or semi-Salic.","translation":"その国の憲法が完全なザリーク法であるか、準ザリーク法であるかについて議論が起こった。"}],"collocations":["semi-Salic succession","semi-Salic law","apply a semi-Salic rule"],"synonyms":["modified Salic","agnatic-cognatic"],"antonyms":["Salic","agnatic"]},{"part_of_speech":"adjective","definition":"（歴史学において）女性の王位継承を条件付きで認める","english_definition":"(In historical contexts) Pertaining to a system where female succession is permitted under certain conditions, such as the extinction of all male lines.","examples":[{"sentence":"Many European monarchies historically operated under semi-Salic principles.","translation":"歴史的に、多くのヨーロッパの君主国が準ザリーク法の原則に基づいて運営されていた。"}],"collocations":["historical semi-Salic systems","semi-Salic monarchies"],"synonyms":["conditional female succession"],"antonyms":["male-preference primogeniture"]}],"etymology":{"value":"The term combines 'semi-' meaning 'partly' or 'somewhat' with 'Salic,' referring to Salic law. Salic law itself is named after the Salian Franks.","priority":"中"},"pronunciation":{"ipa":"/ˌsɛmi ˈsælɪk/","syllables":"sem-i-Sal-ic"},"inflection":{"notes":"Adjective, no plural form"},"usage_notes":{"explanation":"'Semi-Salic' describes a legal or customary system of inheritance, especially in monarchies, where women can inherit only if there are no eligible male heirs. It's a modification of strict Salic law, which completely excludes females from succession. The term is most often used in historical and legal discussions of European monarchies.","priority":"高"},"common_mistakes":{"examples":[{"incorrect":"The country had a Salic law, so the queen inherited the throne.","correct":"The country had a semi-Salic law, so the queen inherited the throne.","note":"Salic law excludes female inheritance, while semi-Salic law allows it under specific conditions."}],"priority":"中"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["Salic law","agnatic succession","cognatic succession","primogeniture"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"低"},"readability_explanation":{"level":"C2","text":"The term 'semi-Salic' is a specialized historical and legal term. It refers to a system of succession where females can inherit, but only if there are no male heirs available. Understanding requires knowledge of European history and legal concepts related to monarchies and inheritance laws. It's not commonly used in everyday language."},"example_sentences":[{"sentence":"Under the semi-Salic tradition, the throne passed to the nearest female relative after all male relatives had died.","translation":"準ザリーク法の伝統の下では、すべての男性親族が亡くなった後、王位は最も近い女性親族に引き継がれた。","type":"adjective","meaning_category":"法律・歴史"},{"sentence":"The interpretation of the succession laws as semi-Salic allowed for a peaceful transition of power.","translation":"継承法を準ザリーク法として解釈することで、権力の平和的な移行が可能になった。","type":"adjective","meaning_category":"法律・歴史"}]}