{"word":"Nabla","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ナブラ記号 (∇)","english_definition":"The del operator, represented by the symbol ∇. It is a vector differential operator used in mathematics, in particular in vector calculus, as a form of shorthand when taking gradients, divergences, curls, and Laplacians.","examples":[{"sentence":"The Nabla operator is used extensively in physics and engineering.","translation":"ナブラ演算子は物理学と工学で広く使用されています。"},{"sentence":"The gradient of a scalar field can be expressed using the Nabla symbol.","translation":"スカラー場の勾配はナブラ記号を使って表現できます。"}],"collocations":["nabla operator","nabla symbol","del operator","gradient","divergence","curl","Laplacian"],"synonyms":["del operator","vector differential operator"],"antonyms":[]}],"etymology":{"value":"The name 'nabla' comes from the Hebrew word for a harp, because the symbol's shape resembles an ancient harp. It was coined by the Scottish physicist Peter Guthrie Tait in the 19th century.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈnæblə/","syllables":"nab-la"},"inflection":{"notes":"単数形・複数形ともに Nabla で扱われることが多いですが、複数形は Nablas とすることもあります。"},"usage_notes":{"explanation":"The Nabla symbol (∇) represents a vector differential operator. It's a shorthand notation used in vector calculus for expressing gradient, divergence, curl, and the Laplacian. When applied to a scalar field, it gives the gradient. When the divergence is taken, it's a dot product with a vector field. The curl is a cross product with a vector field. Applying Nabla twice gives the Laplacian. It is primarily used in advanced mathematics, physics, and engineering contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Nabla is a scalar.","correct":"✓ The Nabla is an operator.","note":"Nabla is an operator, not a scalar or a vector itself. It acts on scalar or vector fields. "},{"incorrect":"✗ Use Nabla for simple arithmetic.","correct":"✓ Use Nabla for vector calculus.","note":"Nabla is used in vector calculus and differential operations, not basic arithmetic."}],"priority":"★★☆"},"related_words":{"derivatives":["Laplacian","Gradient","Divergence","Curl","Del Squared"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な分野でのみ使用される単語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nabla' refers to the symbol ∇, which represents a vector differential operator. This operator is used in advanced mathematics, physics, and engineering to simplify notation for gradient, divergence, curl, and Laplacian operations. It's a shorthand way to express these complex calculations. Understanding Nabla requires a background in vector calculus. It is not commonly used outside of these specialized fields."},"example_sentences":[{"sentence":"The Laplacian operator can be expressed as ∇².","translation":"ラプラシアン演算子は∇²と表現できます。","type":"noun","meaning_category":"mathematics"},{"sentence":"The gradient of the temperature field is given by ∇T.","translation":"温度場の勾配は∇Tで与えられます。","type":"noun","meaning_category":"physics"}]}