{"word":"prereceipt","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A receipt issued before payment is made, often as a pro forma invoice or a preliminary record of a transaction.","english_definition":"A receipt issued in advance of payment, often serving as a preliminary invoice or record of a pending transaction.","examples":[{"sentence":"The company provided a prereceipt for the ordered goods, outlining the total cost.","translation":"会社は注文された商品の代金の概算を示すために、合計金額を記載した仮領収書を発行した。"},{"sentence":"I received a prereceipt for the service, which I need to pay before the work begins.","translation":"サービスの仮領収書を受け取りました。作業開始前に支払う必要があります。"}],"collocations":["issue a prereceipt","receive a prereceipt","prereceipt invoice"],"synonyms":["pro forma invoice","preliminary invoice","advance receipt"],"antonyms":["receipt","invoice"]},{"part_of_speech":"verb","definition":"To issue a receipt before payment is received.","english_definition":"To create and provide a receipt in advance of payment.","examples":[{"sentence":"The system allows us to prereceipt orders, which helps with tracking.","translation":"そのシステムでは、注文に対して仮領収書を発行できるため、追跡に役立ちます。"},{"sentence":"We prereceipted the transaction to ensure the customer had a record of the pending charge.","translation":"顧客が保留中の請求の記録を確実に持てるように、取引に対して仮領収書を発行しました。"}],"collocations":["prereceipt an order","prereceipt a transaction"],"synonyms":["pre-invoice"],"antonyms":["receipt"]}],"etymology":{"value":"The word is formed by adding the prefix 'pre-' (meaning 'before') to the word 'receipt'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpriːriˈsiːt/","syllables":"pre-re-ceipt"},"inflection":{"noun_plural":"prereceipts","verb_forms":{"present_simple":["prereceipt","prereceipts"],"past_simple":"prereceipted","past_participle":"prereceipted","present_participle":"prereceipting"}},"usage_notes":{"explanation":"'Prereceipt' is not a commonly used word. It is primarily used in business or accounting contexts to describe a receipt-like document issued before payment is made. It often functions as a pro forma invoice or an advance notice of a transaction. The verb form is even less common.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"I need to prereceipt the money before I get the goods.","correct":"I need to prepay for the goods before I receive them.","note":"'Prereceipt' refers to issuing a receipt, not paying money. Use 'prepay' or 'pay in advance' to indicate paying before receiving goods or services."}],"priority":"★★☆"},"related_words":{"derivatives":["prepayment","receipt","invoice","pro forma invoice"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (not commonly used)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'prereceipt' is a specialized term not commonly encountered in everyday language. It is primarily used in business and accounting contexts to refer to a receipt-like document issued before payment. Understanding its meaning requires familiarity with business transactions and accounting practices. The verb form is even rarer. Due to its limited usage, it is considered a high-level vocabulary word."},"example_sentences":[{"sentence":"The vendor provided a prereceipt outlining the expected charges.","translation":"ベンダーは予想される料金を概説した仮領収書を提供した。","type":"noun","meaning_category":"document"},{"sentence":"We prereceipt all orders to maintain accurate records.","translation":"正確な記録を維持するために、すべての注文に対して仮領収書を発行します。","type":"verb","meaning_category":"issue document"}]}