{"word":"phonism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"音象徴、音感聯想（言語音と意味・イメージとの間の非恣意的な結びつき）","english_definition":"The association of a particular sound or phoneme with a particular meaning or image; sound symbolism.","examples":[{"sentence":"The study of phonism explores how certain sounds evoke specific feelings or ideas.","translation":"音象徴の研究は、特定の音がどのように特定の感情や考えを喚起するかを探求する。"},{"sentence":"Many words for small things contain high-pitched sounds, illustrating a common phonism.","translation":"小さいものを表す多くの単語には、高音が含まれており、一般的な音象徴を示している。"}],"collocations":["sound symbolism","phonetic symbolism","linguistic phonism"],"synonyms":["sound symbolism","phonetic iconism","mimesis"],"antonyms":[]},{"part_of_speech":"noun","definition":"（まれ）音声の癖、発声の異常","english_definition":"(rare) A peculiarity of voice; an abnormality in vocalization.","examples":[{"sentence":"The doctor noted a strange phonism in the patient's speech.","translation":"医師は患者の話し方に奇妙な発声癖があることに気づいた。"}],"collocations":[],"synonyms":["speech defect","vocalization abnormality"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'phone' (φώνη), meaning 'sound, voice,' combined with the suffix '-ism,' indicating a doctrine, principle, or characteristic.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfoʊnɪzəm/","syllables":"pho-nism"},"inflection":{"noun_plural":"phonisms"},"usage_notes":{"explanation":"The term 'phonism' primarily refers to sound symbolism, the non-arbitrary association between sounds and meanings. It is a concept explored in linguistics and semiotics. The rarer, secondary meaning refers to a vocal peculiarity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artist used phonism to create a visual image.","correct":"✓ The artist used sound symbolism to create a visual image.","note":"'Phonism' refers to sound-meaning relationships, not visual imagery. 'Sound symbolism' is a more common and clearer term in this context."}],"priority":"★☆☆"},"related_words":{"derivatives":["phonetic","phonology","phoneme","telephone"],"related_terms":["onomatopoeia (擬音語)","synesthesia (共感覚)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (専門的な言語学の文脈)","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Phonism' is a technical term primarily used in linguistics to describe the phenomenon of sound symbolism, where certain sounds are intuitively associated with specific meanings or characteristics. It's not a commonly used word outside of academic contexts related to language and semiotics. The secondary meaning related to vocal abnormalities is even rarer."},"example_sentences":[{"sentence":"Linguistic research suggests that certain phonisms are universal across languages.","translation":"言語学の研究は、特定の音象徴が言語間で普遍的であることを示唆している。","type":"noun","meaning_category":"音象徴"},{"sentence":"The poet used phonism to enhance the emotional impact of the verse.","translation":"詩人は音象徴を用いて詩句の感情的なインパクトを高めた。","type":"noun","meaning_category":"音象徴"}]}