{"word":"searchership","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The position or role of a searcher; the act or process of searching.","english_definition":"The state, position, or function of being a searcher; the activities involved in searching.","examples":[{"sentence":"Her searchership on the team was invaluable.","translation":"彼女のチームにおける探索者としての役割は非常に貴重だった。"},{"sentence":"The searchership required extensive knowledge of the database.","translation":"その探索者の職務には、データベースに関する広範な知識が必要とされた。"}],"collocations":["searchership duties","searchership role","searchership position"],"synonyms":["searcher","seeker","investigator"],"antonyms":[]}],"etymology":{"value":"Derived from 'searcher' (one who searches) with the suffix '-ship' (denoting a state, condition, office, or skill).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɜːrtʃərʃɪp/","syllables":"search-er-ship"},"inflection":{"noun_plural":"searcherships"},"usage_notes":{"explanation":"'Searchership' is a relatively uncommon noun that refers to the role, position, or function of a searcher. It emphasizes the activities and responsibilities associated with searching.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The searchership was done by the computer.","correct":"✓ The search was done by the computer.","note":"Use 'search' for the general act of searching, not 'searchership'."}],"priority":"★☆☆"},"related_words":{"derivatives":["searcher","search","searching"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Searchership' is a relatively rare and formal term. It is best used when specifically referring to the role or position of a searcher, rather than the act of searching itself. The word is more common in professional or technical contexts."},"example_sentences":[{"sentence":"The company established a new searchership to improve its market analysis.","translation":"その会社は、市場分析を改善するために新しい探索者の職を設けた。","type":"noun","meaning_category":"position"},{"sentence":"His searchership was crucial in finding the missing documents.","translation":"彼の探索者としての役割は、紛失した書類を見つける上で非常に重要だった。","type":"noun","meaning_category":"role"}]}