{"word":"Snakeroot","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"ヘビノネゴザ属の植物の総称、特に薬用として用いられるもの","english_definition":"Any of various plants of the genus *Sanicula*, or other plants formerly thought to be a remedy for snakebites.","examples":[{"sentence":"Black snakeroot is used in some herbal remedies.","translation":"クロバナヘビノネゴザはいくつかの薬草療法で使用されます。"},{"sentence":"The settlers used snakeroot to treat snake bites.","translation":"入植者たちはヘビノネゴザをヘビ咬傷の治療に使用しました。"}],"collocations":["black snakeroot","Virginia snakeroot","white snakeroot"],"synonyms":["sanicle","birthwort","aristolochia"],"antonyms":[]},{"part_of_speech":"noun","definition":"セネガ（アメリカニンジンの根）","english_definition":"The root of *Polygala senega*, used medicinally.","examples":[{"sentence":"Senega snakeroot is known for its expectorant properties.","translation":"セネガヘビノネゴザは去痰作用があることで知られています。"}],"collocations":["Senega snakeroot extract"],"synonyms":["senega","seneca snakeroot"],"antonyms":[]}],"etymology":{"value":"'Snake' + 'root'.  The name derives from the historical use of these plants as a supposed remedy for snakebites.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsneɪkˌruːt/","syllables":"snake-root"},"inflection":{"noun_plural":"Snakeroots"},"usage_notes":{"explanation":"'Snakeroot' is a general term applied to various plants, often those with a historical reputation for treating snakebites.  It is important to specify which type of snakeroot is being referred to, as different species have different properties and uses.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I planted snakeroots in my garden for decoration.","correct":"✓ I planted flowers in my garden for decoration.","note":"Snakeroot is not commonly grown for ornamental purposes. If planting for decoration, specify the plant type."}],"priority":"★☆☆"},"related_words":{"derivatives":["snakeweed"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Snakeroot' refers to a variety of plants historically used as a remedy for snakebites. It is a somewhat obscure term, and understanding requires familiarity with herbal medicine and plant taxonomy. The term can be ambiguous, as it applies to different species. Therefore, it is best to be specific about the plant being discussed."},"example_sentences":[{"sentence":"The herbalist recommended snakeroot tea for its medicinal properties.","translation":"その薬草家は、薬効成分があるとしてヘビノネゴザの茶を勧めた。","type":"noun","meaning_category":"medicinal plant"},{"sentence":"Early settlers relied on snakeroot as a first-aid treatment for snakebites.","translation":"初期の入植者たちは、ヘビ咬傷の応急処置としてヘビノネゴザに頼っていた。","type":"noun","meaning_category":"historical remedy"}]}