{"word":"disassembler","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"逆アセンブラ：機械語のプログラムを、人間が理解しやすいアセンブリ言語のコードに変換するプログラム","english_definition":"A computer program that translates machine code into assembly language, a more human-readable form.","examples":[{"sentence":"The disassembler helped me understand how the program worked at a low level.","translation":"逆アセンブラは、プログラムが低レベルでどのように動作するかを理解するのに役立ちました。"},{"sentence":"Security researchers often use disassemblers to analyze malware.","translation":"セキュリティ研究者は、マルウェアを分析するためによく逆アセンブラを使用します。"},{"sentence":"Debugging complex software can be easier with the output from a disassembler.","translation":"複雑なソフトウェアのデバッグは、逆アセンブラからの出力を使用すると簡単になる場合があります。"}],"collocations":["use a disassembler","run a disassembler","disassemble code","reverse engineer code","analyze executable"],"synonyms":["reverse compiler","decompiler (related, but typically for higher-level languages)"],"antonyms":["assembler","compiler"],"related_terms":["assembly language","machine code","executable","reverse engineering","debugging"]}],"etymology":{"value":"The word 'disassembler' is formed by adding the prefix 'dis-' (meaning 'opposite of' or 'undoing') to 'assembler'. 'Assembler' refers to a program that translates assembly language into machine code. Thus, a disassembler does the reverse.","priority":"★★☆"},"pronunciation":{"ipa":"/dɪsəˈsemblər/","syllables":"dis-as-sem-bler"},"inflection":{"noun_plural":"disassemblers"},"usage_notes":{"explanation":"A disassembler is a crucial tool for reverse engineering, security analysis, and understanding low-level program behavior. It's particularly useful when source code is unavailable. The output of a disassembler is assembly language, which is still relatively complex but much easier to understand than raw machine code (binary). Disassemblers are often used in conjunction with debuggers and other reverse engineering tools.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ A disassembler compiles code.","correct":"✓ A disassembler disassembles code.","note":"Disassemblers perform the opposite function of compilers. Compilers translate high-level languages into machine code, while disassemblers translate machine code into assembly language."},{"incorrect":"✗ Disassemblers are only used for illegal activities.","correct":"✓ Disassemblers are used for a variety of purposes, including security analysis, reverse engineering, and debugging.","note":"While disassemblers can be used for malicious purposes like analyzing malware, they also have legitimate uses in software development and security research."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["assembler","assembly language","machine code","reverse engineering","debugger","decompiler"],"priority":"★★★"},"level_frequency":{"level":"C1","frequency_google_ngram":"Low frequency - Primarily used in technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"A **disassembler** is a program that translates machine code (the binary instructions a computer directly executes) into assembly language. Assembly language is a more human-readable representation of those instructions. Think of it as translating a very complex code into something a programmer can at least begin to understand. Disassemblers are essential for reverse engineering, analyzing malware, and debugging software when the original source code isn't available. They're a key tool for understanding how software works at a very low level.","priority":"★★★"},"example_sentences":[{"sentence":"The security expert used a **disassembler** to examine the malicious program's code.","translation":"セキュリティ専門家は、悪意のあるプログラムのコードを調べるために逆アセンブラを使用しました。","type":"general","meaning_category":"Definition"},{"sentence":"By using a **disassembler**, the programmer could identify the bug in the compiled code.","translation":"逆アセンブラを使用することで、プログラマーはコンパイルされたコードのバグを特定できました。","type":"usage","meaning_category":"Debugging"},{"sentence":"The **disassembler** output showed the sequence of instructions the CPU was executing.","translation":"逆アセンブラの出力は、CPUが実行していた命令のシーケンスを示していました。","type":"technical","meaning_category":"Technical Details"}]}