{"word":"nonseverities","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"Plural form of nonseverity. Refers to instances or conditions that are not severe.","english_definition":"The plural form of 'nonseverity,' indicating multiple instances or conditions that are not severe.","examples":[{"sentence":"The doctor noted several nonseverities in the patient's condition, such as mild discomfort but no acute pain.","translation":"医師は患者の状態にいくつかの非重度な点、例えば軽度の不快感はあるものの、急性の痛みはないことを指摘した。"},{"sentence":"The report highlighted the nonseverities of the software bugs, which were mostly cosmetic and did not affect functionality.","translation":"報告書はソフトウェアのバグの非重度性を強調しており、それらはほとんどが見た目に関するもので、機能には影響しなかった。"}],"collocations":["minor issues","mild cases","non-critical problems","cosmetic defects"],"synonyms":["mildness","lightness","insignificance","triviality"],"antonyms":["severities","criticalities","graveness","seriousness"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to the noun 'severities,' which is the plural of 'severity' (meaning the state or quality of being severe).","priority":"Medium"},"pronunciation":{"ipa":"/ˌnɒn.sɪˈvɛr.ə.tiz/","syllables":"non-se-ver-i-ties"},"inflection":{"noun_plural":"nonseverities"},"usage_notes":{"explanation":"The term 'nonseverities' is relatively uncommon and is primarily used in technical or medical contexts to specifically denote conditions or issues that are not considered severe. Its use is often to contrast with more serious or critical conditions.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"The nonseverity was obvious.","correct":"The nonseverity was obvious. / The nonseverities were obvious.","note":"'Nonseverity' is the singular form, referring to a general lack of severity. 'Nonseverities' refers to multiple instances of non-severe conditions. The correct form depends on the context."}],"priority":"Low"},"related_words":{"derivatives":["nonseverity (singular noun)","severe (adjective)","severity (noun)"],"priority":"Low"},"level_frequency":{"frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"'Nonseverities' is a technical term indicating multiple instances of conditions that are not severe. It is used in contexts where distinguishing between severe and non-severe cases is important, such as in medical or technical reports. The word is formed by adding 'non-' to 'severities,' making it clear that it refers to the opposite of severe conditions."},"example_sentences":[{"sentence":"The audit revealed several **nonseverities** in the security protocols, which needed addressing but were not critical.","translation":"監査により、セキュリティプロトコルにいくつかの非重度な点が明らかになったが、対処は必要であるものの、重大なものではなかった。","type":"noun","meaning_category":"Instances of non-severe conditions"},{"sentence":"The doctor reassured the patient that the symptoms were **nonseverities** and would likely resolve on their own.","translation":"医師は患者に、症状は非重度であり、自然に治る可能性が高いと安心させた。","type":"noun","meaning_category":"Instances of non-severe symptoms"}]}