{"word":"Overregistration","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"過剰登録、定員超過登録","english_definition":"The act of registering more individuals or items than the specified or permitted limit.","examples":[{"sentence":"The university experienced overregistration in its popular courses this semester.","translation":"その大学では、今学期、人気のあるコースで定員超過登録が発生した。"},{"sentence":"Due to overregistration, some students were placed on a waiting list.","translation":"過剰登録のため、一部の学生はウェイティングリストに登録された。"},{"sentence":"The system is designed to prevent overregistration by automatically closing when the maximum number of participants is reached.","translation":"そのシステムは、参加者の最大数に達すると自動的に閉じることで、過剰登録を防ぐように設計されている。"}],"collocations":["prevent overregistration (過剰登録を防ぐ)","address overregistration (過剰登録に対処する)","deal with overregistration (過剰登録を処理する)","course overregistration (コースの定員超過登録)","student overregistration (学生の過剰登録)"],"synonyms":["oversubscription","over-enrollment","excess registration"],"antonyms":["underregistration","under-enrollment"]}],"etymology":{"value":"'Over-' (excessive) + 'registration' (the act of registering).","priority":"★★★"},"pronunciation":{"ipa":"/ˌoʊvərˌrɛdʒɪˈstreɪʃən/","syllables":"o-ver-re-gis-tra-tion"},"inflection":{"noun_plural":"overregistrations"},"usage_notes":{"explanation":"'Overregistration' refers specifically to the situation where more people or items are registered than the allowed capacity. It is often used in the context of courses, events, or services with limited availability. It implies a problem or challenge that needs to be addressed to manage the excess demand.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The overregistration was happened because of the system error.","correct":"✓ The overregistration happened because of the system error.","note":"'Overregistration' is a noun, so it is not used as a verb. Use 'happened' to describe the event."},{"incorrect":"✗ There are too much registrations.","correct":"✓ There is too much overregistration.","note":"'Overregistration' is a specific term for excessive registration. 'Too much registrations' is grammatically incorrect; use 'too many registrations' or, preferably, 'too much overregistration'."}],"priority":"★★☆"},"related_words":{"derivatives":["overregister (verb)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'overregistration' is a relatively uncommon term, typically used in formal contexts such as education, event management, or government administration. It refers to a situation where the number of registrations exceeds the available capacity or limit. Understanding this word requires a good grasp of prefixes ('over-') and root words ('registration')."},"example_sentences":[{"sentence":"The conference organizers are trying to mitigate the effects of overregistration by offering additional sessions.","translation":"会議の主催者は、追加のセッションを提供することで、過剰登録の影響を軽減しようとしている。","type":"general","meaning_category":"General usage"},{"sentence":"The software automatically sends out notifications to students when there is overregistration in a course.","translation":"そのソフトウェアは、コースで過剰登録が発生すると、学生に自動的に通知を送信する。","type":"education","meaning_category":"Education"},{"sentence":"The city council is reviewing its online registration system to prevent future instances of overregistration for community programs.","translation":"市議会は、コミュニティプログラムの将来の過剰登録事例を防ぐために、オンライン登録システムを見直している。","type":"government","meaning_category":"Government"}]}