{"word":"Tutee","priority":"★★★","meanings":[{"part_of_speech":"noun","definition":"(特に個別指導を受ける)生徒、教え子","english_definition":"A person who receives tuition, especially individual instruction.","examples":[{"sentence":"The tutor worked closely with his tutee to improve her math skills.","translation":"家庭教師は教え子の数学のスキルを向上させるために密接に協力した。"},{"sentence":"As a tutee, he was expected to complete all assigned homework.","translation":"生徒として、彼は割り当てられたすべての宿題を完了することが期待されていた。"},{"sentence":"The program pairs volunteer tutors with tutees who need extra help.","translation":"そのプログラムは、ボランティアの家庭教師と、追加の支援を必要とする生徒をペアにする。"}],"collocations":["mentor and tutee (指導者と生徒)","tutor and tutee (家庭教師と生徒)","become a tutee (生徒になる)","work with a tutee (生徒と協力する)"],"synonyms":["student","pupil","learner","protégé"],"antonyms":["tutor","mentor","instructor"]}],"etymology":{"value":"The word 'tutee' is derived from 'tutor' by analogy. It was formed by reversing the roles, where the one being tutored is the 'tutee'.","priority":"★★☆"},"pronunciation":{"ipa":"/tjuːˈtiː/","syllables":"tu-tee"},"inflection":{"noun_plural":"tutees"},"usage_notes":{"explanation":"'Tutee' specifically refers to someone receiving individual or small-group instruction, often from a tutor or mentor. It emphasizes the one-on-one or personalized nature of the learning relationship. Unlike 'student,' which is a more general term, 'tutee' highlights the specific role of receiving targeted guidance.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a tutor of her tutee.","correct":"✓ She is the tutor of her tutee.","note":"'Tutor' is the person giving the instruction, while 'tutee' is the person receiving it. Make sure to use the correct term for each role."},{"incorrect":"✗ The tutee teached the tutor.","correct":"✓ The tutor taught the tutee.","note":"The tutor is the one who teaches; the tutee is the one who is taught. 'Teach' is the verb, and its past tense is 'taught'."}],"priority":"★★☆"},"related_words":{"derivatives":["tutor (名詞: 家庭教師、指導教官；動詞: 個別指導をする)","tutelage (名詞: 指導、保護)","tuition (名詞: 授業料、指導)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Tutee' is a noun that refers to a person who is being tutored, meaning they are receiving individual or small-group instruction from a tutor. It's less common than 'student' but more specific, emphasizing the one-on-one learning relationship. Understanding this word helps in contexts where personalized learning or mentorship is discussed."},"example_sentences":[{"sentence":"The tutee showed significant improvement after several sessions with the tutor.","translation":"生徒は家庭教師との数回のセッションの後、著しい改善を見せた。","type":"noun","meaning_category":"生徒"},{"sentence":"The program aims to match each tutee with a suitable mentor.","translation":"そのプログラムは、各生徒に適切な指導者をマッチングすることを目指している。","type":"noun","meaning_category":"生徒"},{"sentence":"As a tutee, she felt comfortable asking questions and seeking clarification.","translation":"生徒として、彼女は質問をしたり、明確化を求めたりすることに抵抗がなかった。","type":"noun","meaning_category":"生徒"}]}