{"word":"foddered","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(家畜に)飼料を与える","english_definition":"To feed with fodder; to supply with food, especially dried hay or feed, for livestock.","examples":[{"sentence":"The farmer foddered his cattle every morning.","translation":"農夫は毎朝牛に飼料を与えた。"},{"sentence":"We foddered the horses with hay during the winter months.","translation":"冬の間、私たちは馬に干し草を与えた。"}],"collocations":["fodder cattle","fodder horses","fodder livestock","fodder the animals"],"synonyms":["feed","provision","supply","nourish"],"antonyms":["starve","deprive"]}],"etymology":{"value":"Derived from the noun 'fodder,' which comes from Old English 'fōdor,' meaning food for animals. The verb form 'foddered' simply means to provide that food.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfɒdəd/","syllables":"fod-dered"},"inflection":{"verb_forms":{"present_simple":["fodder"],"past_simple":"foddered","past_participle":"foddered","present_participle":"foddering"}},"usage_notes":{"explanation":"'Foddered' is the past simple and past participle form of the verb 'fodder.' It specifically refers to the act of providing fodder (dried hay, feed, etc.) to livestock. It's a relatively uncommon word in modern English, often replaced by the simpler 'fed.'","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The politician foddered the public with false promises.","correct":"✓ The politician fed the public false promises.","note":"While 'fodder' can be used metaphorically to mean providing something to be consumed, 'foddered' is rarely used in this way. 'Fed' is more appropriate here."},{"incorrect":"✗ He foddered himself after a long day of work.","correct":"✓ He fed himself after a long day of work.","note":"'Foddered' is specifically for feeding livestock, not humans. Use 'fed' for humans."}],"priority":"★★☆"},"related_words":{"derivatives":["fodder (noun: food, especially dried hay or feed, for cattle and other livestock)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (uncommon word)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Foddered' is a specialized term related to agriculture and animal husbandry. It means to have provided fodder, which is a type of animal feed, to livestock. Due to its specific context, it is not commonly used in general conversation or writing. Understanding its meaning requires familiarity with agricultural practices."},"example_sentences":[{"sentence":"The sheep were foddered with fresh hay.","translation":"羊には新鮮な干し草が与えられた。","type":"verb","meaning_category":"飼料を与える"},{"sentence":"Having foddered the cows, he went inside for dinner.","translation":"牛に飼料を与えた後、彼は夕食のために家に入った。","type":"verb","meaning_category":"飼料を与える"}]}