{"word":"unhealthy-appearing","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"不健康そうに見える、健康状態が悪いように見える","english_definition":"appearing to be in poor health; having a look or appearance that suggests a lack of physical well-being.","examples":[{"sentence":"The stray cat was thin and unhealthy-appearing.","translation":"その野良猫は痩せていて、不健康そうに見えた。"},{"sentence":"The patient was pale and unhealthy-appearing, so the doctor ordered more tests.","translation":"患者は顔色が悪く、不健康そうに見えたので、医師は追加の検査を指示した。"},{"sentence":"Despite her smile, she looked tired and unhealthy-appearing.","translation":"彼女は笑顔だったが、疲れていて不健康そうに見えた。"}],"collocations":["unhealthy-appearing skin (不健康そうな肌)","unhealthy-appearing weight loss (不健康そうな体重減少)","unhealthy-appearing pallor (不健康そうな青白さ)"],"synonyms":["sickly","frail-looking","wan","pale","poorly","ailing","infirm","debilitated","weak","unwell"],"antonyms":["healthy-appearing","robust","vigorous","hale","hearty","fit","well","strong"],"notes":["This term is often used in medical contexts or when describing someone's overall physical condition based on their appearance. It implies that the person's outward appearance suggests an underlying health issue or lack of well-being."]}],"etymology":{"value":"Combination of 'unhealthy' (not healthy) and 'appearing' (giving the impression of).","priority":"N/A"},"pronunciation":{"ipa":"/ʌnˈhɛlθi əˈpɪərɪŋ/","syllables":"un-hel-thy ap-pear-ing"},"inflection":{"notes":"Adjective; does not inflect for number or gender."},"usage_notes":{"explanation":"'Unhealthy-appearing' is used to describe someone whose physical appearance suggests they are not in good health. It focuses on the visual impression of poor health, rather than a confirmed medical diagnosis. It can be used to describe various aspects of appearance, such as skin tone, weight, energy levels, etc.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He was unhealthy-appearing because he ate too much junk food.","correct":"✓ He was unhealthy-appearing, likely because he ate too much junk food.","note":"The term describes the appearance, not the cause. The cause can be stated separately."}],"priority":"N/A"},"related_words":{"derivatives":["unhealthily (adverb)","health (noun)","healthy (adjective)","appearance (noun)","appear (verb)"],"phrases":["look unhealthy","appear unwell","seem sickly"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"'Unhealthy-appearing' is a relatively complex adjective used to describe someone whose appearance suggests poor health. It is often used in formal or medical contexts. The word combines the concept of 'unhealthy' with the act of 'appearing' in a certain way. Understanding the individual components helps in grasping the overall meaning."},"example_sentences":[{"sentence":"The patient's unhealthy-appearing complexion concerned the doctor.","translation":"患者の不健康そうな顔色は医師を心配させた。","type":"general","meaning_category":"general"},{"sentence":"The stray dog was scrawny and unhealthy-appearing, clearly in need of care.","translation":"その野良犬は痩せていて不健康そうに見え、明らかに手当が必要だった。","type":"general","meaning_category":"general"}]}