{"word":"dragboat","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A type of boat specifically designed and built for drag racing on water.","english_definition":"A boat designed and built for drag racing on water, typically featuring a powerful engine and a streamlined hull for maximum speed over a short distance.","examples":[{"sentence":"The dragboat roared down the course, leaving a huge spray of water in its wake.","translation":"ドラッグボートはコースを轟音を立てて走り抜け、その航跡には大量の水しぶきが残った。"},{"sentence":"Dragboat racing is a popular spectator sport in many lakeside communities.","translation":"ドラッグボートレースは、多くの湖畔の地域社会で人気の観戦スポーツです。"}],"collocations":["dragboat racing","top fuel dragboat","jet dragboat","dragboat engine","dragboat hull"],"synonyms":["racing boat","speed boat"],"antonyms":[]}],"etymology":{"value":"A compound word formed by combining \"drag\" (referring to drag racing) and \"boat.\"","priority":"N/A"},"pronunciation":{"ipa":"ˈdræɡˌboʊt","syllables":"drag-boat"},"inflection":{"noun_plural":"dragboats"},"usage_notes":{"explanation":"Dragboats are specialized racing boats designed for straight-line acceleration over a short, measured distance, similar to drag racing with cars. They often feature powerful engines, sometimes jet engines, and are designed for maximum speed and acceleration.","priority":"N/A"},"common_mistakes":{},"related_words":{"derivatives":["drag racing"],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"N/A","text":"The term \"dragboat\" is relatively specialized and may not be familiar to those outside of the sport of drag boat racing. It refers to a specific type of boat designed for high-speed, short-distance racing on water."},"example_sentences":[{"sentence":"The crowd cheered as the dragboat crossed the finish line.","translation":"ドラッグボートがフィニッシュラインを越えると、観客は歓声を上げた。","type":"noun","meaning_category":"racing boat"},{"sentence":"He spent years building and perfecting his dragboat.","translation":"彼は何年もかけて自分のドラッグボートを製作し、完成させた。","type":"noun","meaning_category":"racing boat"}]}