{"word":"ornithophobia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"鳥恐怖症、鳥に対する病的な恐怖","english_definition":"An extreme or irrational fear of birds.","examples":[{"sentence":"She suffers from ornithophobia and cannot go near pigeons.","translation":"彼女は鳥恐怖症を患っており、ハトに近づくことができない。"},{"sentence":"Ornithophobia can be a debilitating phobia for some people.","translation":"鳥恐怖症は、一部の人々にとって生活を困難にする恐怖症となる可能性がある。"}],"collocations":["have ornithophobia","suffer from ornithophobia","extreme ornithophobia","severe ornithophobia"],"synonyms":["fear of birds","bird phobia"],"antonyms":["ornithophilia (鳥好き)"]}],"etymology":{"value":"The word \"ornithophobia\" comes from the Greek words \"ornis\" (ὄρνις) meaning \"bird\" and \"phobos\" (φόβος) meaning \"fear\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɔːrnɪθəˈfoʊbiə/","syllables":"or-ni-tho-pho-bi-a"},"inflection":{"noun_plural":"ornithophobias"},"usage_notes":{"explanation":"Ornithophobia is a specific phobia, meaning it is an irrational and excessive fear of a particular object or situation. In this case, the object of fear is birds. The severity of the phobia can vary greatly from person to person. Some individuals may only experience anxiety when in close proximity to birds, while others may experience panic attacks at the mere sight or thought of birds.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I have a ornithophobia.","correct":"✓ I have ornithophobia.","note":"\"Ornithophobia\" is an uncountable noun, so it doesn't usually take an article like \"a\" or \"an\"."},{"incorrect":"✗ He is ornithophobic.","correct":"✓ He has ornithophobia.","note":"While \"ornithophobic\" is a valid adjective, it's more common to say \"He has ornithophobia\" to describe someone with the phobia."}],"priority":"★☆☆"},"related_words":{"derivatives":["ornithophobic (adjective: 鳥恐怖症の)"],"phobias":["aviophobia (飛行機恐怖症)","zoophobia (動物恐怖症)","arachnophobia (クモ恐怖症)"],"other_related_terms":["phobia (恐怖症)","fear (恐怖)","anxiety (不安)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - This is a relatively uncommon word, mainly used in psychological or medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Ornithophobia\" is a specialized term referring to the specific phobia of birds. It is not a commonly used word in everyday conversation, but it is recognized within the context of psychology and mental health. Understanding the word requires knowledge of Greek roots and the concept of specific phobias. Its usage is primarily limited to discussions about mental health conditions or in clinical settings."},"example_sentences":[{"sentence":"His ornithophobia made it impossible for him to visit the zoo.","translation":"彼の鳥恐怖症のせいで、彼は動物園に行くことができなかった。","type":"general","meaning_category":"鳥恐怖症"},{"sentence":"The therapist helped her manage her ornithophobia through exposure therapy.","translation":"セラピストは、暴露療法を通じて彼女が鳥恐怖症を管理するのを助けた。","type":"treatment","meaning_category":"鳥恐怖症の治療"},{"sentence":"Even seeing pictures of birds can trigger anxiety for someone with ornithophobia.","translation":"鳥の写真を見るだけでも、鳥恐怖症の人にとっては不安を引き起こす可能性がある。","type":"symptoms","meaning_category":"鳥恐怖症の症状"}]}