{"word":"pastorling","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"小牧師、未熟な牧師、経験の浅い牧師","english_definition":"a young or inexperienced pastor; a diminutive or sometimes derogatory term for a pastor","examples":[{"sentence":"The old bishop smiled indulgently at the enthusiastic pastorling.","translation":"老主教はその熱心な小牧師に寛大に微笑んだ。"},{"sentence":"These pastorlings need more guidance before taking full responsibility for a congregation.","translation":"これらの未熟な牧師たちは、会衆の全責任を負う前にさらなる指導が必要だ。"}],"notes":"This term often carries a slightly condescending or affectionate tone, implying the pastor is young, inexperienced, or not fully authoritative. The '-ling' suffix typically indicates smallness or inferiority.","synonyms":["young pastor","novice minister","inexperienced clergyman"],"antonyms":["senior pastor","veteran minister","bishop"]}],"etymology":{"value":"Formed from 'pastor' (from Latin 'pastor' meaning 'shepherd') + the diminutive suffix '-ling' (from Old English '-ling', indicating smallness or inferiority). First recorded use in the 17th century.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈpæstərlɪŋ/","syllables":"pas-tor-ling"},"usage_notes":{"explanation":"A somewhat archaic or literary term. While technically neutral, it often carries either affectionate or condescending connotations depending on context. Mostly found in historical texts or used self-deprecatingly by young pastors. Not commonly used in modern religious discourse.","priority":"★☆☆"},"related_words":{"derivatives":[],"similar_terms":[{"word":"pastor","relation":"root word"},{"word":"priestling","relation":"similar formation"},{"word":"novitiate","relation":"similar concept"}],"priority":"★☆☆"},"level_frequency":{"CEFR":"Not applicable (rare/archaic term)","frequency_google_ngram":"Extremely low frequency - appears mainly in historical texts","priority":"★☆☆"},"example_sentences":[{"sentence":"The pastorling trembled as he delivered his first sermon to the critical congregation.","translation":"小牧師は批評的な会衆に向けて初めての説教をする際に震えていた。","type":"noun","meaning_category":"未熟な牧師"},{"sentence":"Though just a pastorling, his earnestness won the hearts of his flock.","translation":"ただの小牧師にすぎなかったが、彼の真摯さが信徒たちの心を勝ち取った。","type":"noun","meaning_category":"若い牧師"}]}