{"word":"Yahvist","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"ヤハウィスト：旧約聖書の最初の5つの書（創世記、出エジプト記、レビ記、民数記、申命記）の資料源の一つと考えられているもの。神を擬人的な方法で描写し、神の名「YHWH」（ヤハウェ）を使用することを特徴とする。","english_definition":"(Biblical studies) A hypothetical source of the Pentateuch (the first five books of the Old Testament) characterized by its anthropomorphic depictions of God and its use of the divine name YHWH (Yahweh).","examples":[{"sentence":"The Yahwist source is believed to be one of the oldest sources of the Pentateuch.","translation":"ヤハウィスト資料は、旧約聖書の最初の5つの書の中で最も古い資料の一つであると考えられている。"}],"collocations":["Yahwist source","Yahwist narrative","Yahwist tradition"],"synonyms":["J (symbol used by scholars)"],"antonyms":[]},{"part_of_speech":"adjective","definition":"ヤハウィストの：ヤハウィスト資料に関連する、またはヤハウィスト資料に特徴的な。","english_definition":"Relating to or characteristic of the Yahwist source.","examples":[{"sentence":"The Yahwist account of the flood is more detailed than other accounts.","translation":"ヤハウィストによる洪水の説明は、他の説明よりも詳細である。"}],"collocations":["Yahwist account","Yahwist theology","Yahwist perspective"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term \"Yahwist\" is derived from the use of the name \"Yahweh\" (YHWH) for God in the texts attributed to this source.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈjɑːvɪst/","syllables":"Yah-vist"},"inflection":{"noun_plural":"Yahwists"},"usage_notes":{"explanation":"The Yahwist (often abbreviated as 'J' by biblical scholars, from the German 'Jahwe') is one of the four main sources hypothesized to have been woven together to create the Pentateuch/Torah. The others are the Elohist (E), the Deuteronomist (D), and the Priestly source (P). The Yahwist source is characterized by its vivid narrative style, its focus on the southern kingdom of Judah, and its portrayal of God as having human-like qualities. The existence and precise characteristics of the Yahwist source are subjects of ongoing scholarly debate.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The Yahwist wrote the entire Old Testament.","correct":"✓ The Yahwist is believed to be one of the sources of the Pentateuch.","note":"The Yahwist is not believed to have written the entire Old Testament, but rather to be one of the sources that contributed to the Pentateuch."}],"priority":"★☆☆"},"related_words":{"derivatives":["Elohist","Deuteronomist","Priestly source","Pentateuch","Source criticism"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency. This term is primarily used in academic and theological contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"Yahwist\" refers to a scholarly hypothesis about the authorship of the Pentateuch (the first five books of the Bible). It's used in academic discussions about biblical source criticism, a method of analyzing biblical texts to identify their original sources and authors. Understanding the term requires familiarity with biblical studies and the documentary hypothesis. The Yahwist source is characterized by its use of the name \"Yahweh\" for God and its anthropomorphic depictions of the deity. This term is not commonly used outside of academic or theological contexts."},"example_sentences":[{"sentence":"Scholars debate the extent and influence of the Yahwist source in the Book of Genesis.","translation":"学者たちは、創世記におけるヤハウィスト資料の範囲と影響について議論している。","type":"noun","meaning_category":"Biblical source"},{"sentence":"The Yahwist narrative often portrays God as interacting directly with humans.","translation":"ヤハウィストの物語は、神が人間と直接交流する様子を描写することが多い。","type":"adjective","meaning_category":"Relating to the Yahwist source"}]}