{"word":"asconoid","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"海綿動物の体型の一種である、単純な壺状の構造を持つさま","english_definition":"Having the simplest type of canal system in sponges, with choanocytes lining the spongocoel.","examples":[{"sentence":"Asconoid sponges are typically small and tube-shaped.","translation":"アスコノイド型の海綿動物は、一般的に小さく、管状の形をしています。"}],"collocations":["asconoid sponge","asconoid structure"],"synonyms":["tubular","simple-structured"],"antonyms":["syconoid","leuconoid"]},{"part_of_speech":"noun","definition":"海綿動物におけるアスコノイド型の体型を持つもの","english_definition":"A sponge of the asconoid type.","examples":[{"sentence":"The asconoid is characterized by its simple vase-like structure.","translation":"アスコノイドは、単純な花瓶のような構造によって特徴づけられます。"}],"collocations":["asconoid type","asconoid body plan"],"synonyms":["ascon sponge"],"antonyms":["syconoid","leuconoid"]}],"etymology":{"value":"Derived from the Greek words 'askos' meaning 'sac' or 'bag' and '-oid' meaning 'resembling'.","priority":"★★☆"},"pronunciation":{"ipa":"/æsˈkɒnɔɪd/","syllables":"as-co-noid"},"inflection":{"notes":"The word 'asconoid' can function as both an adjective and a noun. The plural form of the noun is 'asconoids'."},"usage_notes":{"explanation":"'Asconoid' refers to one of the three main body plans found in sponges (Porifera). Asconoid sponges are the simplest in structure, characterized by a large central cavity called the spongocoel, which is lined with choanocytes (flagellated collar cells). Water enters through small pores (ostia) directly into the spongocoel and exits through a single large opening called the osculum. Due to their simple structure, asconoid sponges are typically small in size. The other two body plans are syconoid and leuconoid, which are more complex and allow for larger sponge sizes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The asconoid is a complex sponge structure.","correct":"✓ The asconoid is a simple sponge structure.","note":"Asconoid sponges have the simplest structure among sponge body plans."},{"incorrect":"✗ Asconoid sponges are very large.","correct":"✓ Asconoid sponges are typically small.","note":"Due to their simple structure, asconoid sponges are usually small in size."}],"priority":"★★☆"},"related_words":{"derivatives":["ascon (shortened form, less common)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Specialized biological term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'asconoid' is a technical term used in zoology, specifically when discussing the body plans of sponges (phylum Porifera). It refers to the simplest type of sponge structure, characterized by a large, central cavity lined with choanocytes. Understanding this term requires some background knowledge in biology, particularly the anatomy and classification of sponges. It is not commonly used outside of a scientific or educational context related to zoology or marine biology."},"example_sentences":[{"sentence":"The Grantia is a classic example of an asconoid sponge.","translation":"グラントはアスコノイド型の海綿動物の典型的な例です。","type":"noun","meaning_category":"海綿動物"},{"sentence":"Asconoid sponges rely on choanocytes to filter food particles from the water.","translation":"アスコノイド型の海綿動物は、襟細胞を使って水から食物粒子を濾過します。","type":"adjective","meaning_category":"海綿動物の構造"}]}