{"word":"partigianamente","priority":"N/A","meanings":[{"part_of_speech":"adverb","definition":"党派的に、偏って","english_definition":"In a partisan manner; with bias or prejudice towards a particular party or cause.","examples":[{"sentence":"Il giornalista ha scritto partigianamente, favorendo un candidato.","translation":"The journalist wrote in a partisan manner, favoring one candidate.","notes":"This example shows how the adverb is used to describe the manner in which someone acts, specifically showing bias."},{"sentence":"La questione è stata affrontata partigianamente, senza considerare tutti i punti di vista.","translation":"The issue was addressed in a partisan way, without considering all points of view.","notes":"This example illustrates how the adverb describes the approach to a subject, indicating a lack of impartiality."}],"collocations":["agire partigianamente (to act in a partisan way)","scrivere partigianamente (to write in a partisan way)","affrontare partigianamente (to address in a partisan way)"],"synonyms":["parzialmente","faziosamente","tendenziosamente","settariamente"],"antonyms":["imparzialmente","obiettivamente","equamente"]}],"etymology":{"value":"Derives from the Italian word 'partigiano' (partisan) and the suffix '-mente' (which turns adjectives into adverbs).","priority":"N/A"},"pronunciation":{"ipa":"/partid͡ʒanaˈmente/","syllables":"par-ti-gia-na-men-te"},"inflection":{"notes":"Italian adverbs are generally invariable and do not inflect."},"usage_notes":{"explanation":"'Partigianamente' describes actions or behaviors characterized by strong support for a particular party, faction, or cause, often to the exclusion of other perspectives. It implies a lack of objectivity and fairness.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"Ha parlato partigiana.","correct":"Ha parlato partigianamente.","note":"'Partigiana' is the feminine form of the adjective 'partigiano'. The adverbial form is 'partigianamente'."}],"priority":"N/A"},"related_words":{"derivatives":["partigiano (partisan - noun/adjective)","parte (part - noun)"],"priority":"N/A"},"level_frequency":{"priority":"N/A"},"readability_explanation":{"level":"C1","text":"The word 'partigianamente' is used to describe actions or writings that are biased towards a particular group or political party. It suggests a lack of objectivity and fairness in presenting information or making decisions. This word is more common in political or journalistic contexts."},"example_sentences":[{"sentence":"Il giornale ha riportato la notizia partigianamente, esaltando solo le azioni del governo.","translation":"The newspaper reported the news in a partisan way, only praising the actions of the government.","type":"adverb","meaning_category":"biased reporting"},{"sentence":"L'arbitro ha fischiato partigianamente, favorendo la squadra di casa.","translation":"The referee whistled in a partisan manner, favoring the home team.","type":"adverb","meaning_category":"biased refereeing"}]}