{"word":"photoepinasty","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(植物学)光によって引き起こされる葉の屈曲運動","english_definition":"(botany) The downward bending of a leaf caused by greater growth on the upper side in response to light.","examples":[{"sentence":"Photoepinasty is observed in plants exposed to excessive light.","translation":"光屈性は、過剰な光にさらされた植物に見られる。"},{"sentence":"The degree of photoepinasty can indicate the plant's stress level.","translation":"光屈性の程度は、植物のストレスレベルを示すことがある。"}],"collocations":["exhibit photoepinasty","induce photoepinasty","degree of photoepinasty"],"synonyms":["epinasty (general term for downward leaf bending)"],"antonyms":[]}],"etymology":{"value":"'photo-' (光) + 'epinasty' (植物の葉や他の器官の屈曲運動で、上側の成長が下側よりも速いこと)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌfoʊtoʊɪˈpɪnæsti/","syllables":"pho-to-e-pi-nas-ty"},"inflection":{"noun_plural":"photoepinasties"},"usage_notes":{"explanation":"Photoepinasty is a specific type of epinasty where the bending is triggered by light. It's a physiological response in plants, often associated with stress or hormonal imbalances.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant showed photoepinasty due to gravity.","correct":"✓ The plant showed epinasty due to gravity.","note":"Photoepinasty is specifically caused by light; gravity-induced bending is simply epinasty."}],"priority":"★★☆"},"related_words":{"derivatives":["epinasty","hyponasty"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Photoepinasty' is a technical term in botany referring to the downward bending of a leaf due to greater growth on its upper surface in response to light. Understanding this term requires knowledge of plant physiology and growth responses to environmental stimuli. It is not commonly used outside of scientific contexts.","note":"Technical botanical term."},"example_sentences":[{"sentence":"Ethylene exposure can induce photoepinasty in tomato plants.","translation":"エチレン暴露はトマト植物に光屈性を引き起こす可能性がある。","type":"scientific","meaning_category":"botany"},{"sentence":"Researchers are studying the mechanisms behind photoepinasty in various plant species.","translation":"研究者たちは、さまざまな植物種における光屈性のメカニズムを研究している。","type":"scientific","meaning_category":"botany"}]}