{"word":"Skance","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Slang, rare) A derogatory term, possibly referring to a promiscuous or unappealing woman. The exact meaning and usage vary and are often offensive.","english_definition":"(Slang, rare) A derogatory term, possibly referring to a promiscuous or unappealing woman. The exact meaning and usage vary and are often offensive.","examples":[{"sentence":"(Hypothetical) He called her a skance, which was incredibly rude.","translation":"（仮の例）彼は彼女をskanceと呼んだが、それは信じられないほど失礼だった。"}],"collocations":[],"synonyms":["slut","tramp","(Note: These synonyms are also offensive and should be used with extreme caution.)"],"antonyms":[]}],"etymology":{"value":"Origin is uncertain; likely a slang term with regional or subcultural roots. No widely accepted etymology is available.","priority":"★☆☆"},"pronunciation":{"ipa":"/skæns/","syllables":"skance (1 syllable)"},"inflection":{"notes":"It's primarily used as a noun. Plural form would likely be 'skances', but usage is rare."},"usage_notes":{"explanation":"'Skance' is a highly offensive and rarely used slang term. Its meaning is vague and context-dependent, but it is generally used to insult or demean a woman. Due to its offensive nature and lack of clear definition, it is strongly advised to avoid using this word. Its inclusion here is for informational purposes only, to document its existence as a potential (though uncommon) term.","priority":"★★★"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"priority":"☆☆☆"},"level_frequency":{"CEFR":"N/A (Very rare slang)","frequency_google_ngram":"Extremely Low Frequency - The word is very rarely found in general text.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'skance' is a very rare and offensive slang term. It is not recommended to use this word. Its meaning is not precisely defined and its usage is highly context-dependent, but it is generally used as a derogatory term for a woman. This entry is purely for informational purposes to document its existence, and not as an endorsement of its use. Due to its offensive nature, it is unlikely to appear in standard texts or educational materials."},"example_sentences":[{"sentence":"(Avoid using) I would strongly advise against using the word 'skance' as it is highly offensive.","translation":"(使用を避ける) 'skance'という言葉は非常に不快なので、使用しないことを強くお勧めします。","type":"warning","meaning_category":"offensive slang"}]}