{"word":"Tulipist","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"チューリップ狂、チューリップ投機家","english_definition":"A person who is obsessed with tulips, especially during the period of tulip mania in the 17th century Netherlands; a person who speculates wildly in tulips.","examples":[{"sentence":"The tulipist invested all his savings in rare tulip bulbs.","translation":"そのチューリップ狂は貯金のすべてを珍しいチューリップの球根に投資した。"},{"sentence":"Many tulipists went bankrupt when the tulip market crashed.","translation":"チューリップ市場が崩壊したとき、多くのチューリップ投機家が破産した。"}],"collocations":["tulipist speculation","tulipist frenzy"],"synonyms":["tulip speculator","tulip enthusiast"],"antonyms":[]}],"etymology":{"value":"Derived from 'tulip' (the flower) and '-ist' (a suffix denoting a person who is concerned with or believes in something). The term gained prominence during the Tulip Mania of the 17th century.","priority":"★★☆"},"pronunciation":{"ipa":"ˈtjuːlɪpɪst","syllables":"tu-li-pist"},"inflection":{"noun_plural":"Tulipists"},"usage_notes":{"explanation":"The term 'Tulipist' specifically refers to individuals involved in the speculative trading of tulip bulbs, particularly during the Tulip Mania period in the Netherlands. It often carries a connotation of irrational exuberance and financial risk.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a tulipist because he likes tulips.","correct":"✓ He is a tulipist because he speculates in the tulip market.","note":"Being a 'tulipist' implies more than just liking tulips; it involves speculative investment."}],"priority":"★☆☆"},"related_words":{"derivatives":["tulip","tulipomania"],"phrases":[]},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Rare","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Tulipist' is a niche term primarily associated with the historical event of Tulip Mania in the 17th century Netherlands. It describes someone who was deeply involved in the speculative market for tulip bulbs, often to an irrational or obsessive degree. Understanding the term requires knowledge of this specific historical context."},"example_sentences":[{"sentence":"The actions of the tulipists drove the price of tulip bulbs to unprecedented heights.","translation":"チューリップ狂たちの行動が、チューリップの球根の価格を前例のない高さまで押し上げた。","type":"noun","meaning_category":"チューリップ投機家"},{"sentence":"He was known as a tulipist for his reckless investments in the flower market.","translation":"彼は花市場への無謀な投資でチューリップ投機家として知られていた。","type":"noun","meaning_category":"チューリップ投機家"}]}