{"word":"liturate","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(rare) to erase or obliterate writing or printing.","english_definition":"(rare) To erase or obliterate writing or printing.","examples":[{"sentence":"The ancient scribe attempted to liturate the heretical text from the manuscript.","translation":"古代の筆記者は、異端の文章を写本から消し去ろうと試みた。"},{"sentence":"The censor ordered the lituration of politically sensitive passages in the book.","translation":"検閲官は、その本の政治的にデリケートな箇所を削除するように命じた。"}],"collocations":["liturate text","liturate a passage","liturate from a manuscript"],"synonyms":["erase","obliterate","delete","expunge","efface","remove"],"antonyms":["write","print","inscribe","record"]}],"etymology":{"value":"Derived from Late Latin 'lituratus,' past participle of 'liturare,' meaning 'to smear over, erase,' from 'litura,' meaning 'a smearing, erasure.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˈlɪtʃəˌreɪt/","syllables":"lit-u-rate"},"inflection":{"verb_forms":{"present_simple":["liturate","liturates"],"past_simple":"liturated","past_participle":"liturated","present_participle":"liturating"}},"usage_notes":{"explanation":"'Liturate' is a rare and somewhat archaic verb that specifically refers to the act of erasing or obliterating written text. It is not commonly used in modern English, with more common alternatives like 'erase,' 'delete,' or 'obliterate' being preferred. Its usage often implies a formal or historical context.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He liturated the document with a pen.","correct":"✓ He liturated the document using an eraser.","note":"'Liturate' implies a more thorough removal, so using an eraser is more fitting than simply crossing out with a pen."},{"incorrect":"✗ The artist liturated the painting.","correct":"✓ The artist erased the drawing.","note":"'Liturate' is typically used for text, not visual art. 'Erase' or 'remove' would be more appropriate for a painting or drawing."}],"priority":"★☆☆"},"related_words":{"derivatives":["lituration (noun): the act of erasing or obliterating writing"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely rare; not found in common usage databases.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Liturate' is a highly uncommon and specialized word, primarily encountered in historical or academic contexts related to textual studies or archival work. Its meaning is closely associated with the deliberate and thorough removal of written material. Due to its rarity, it is unlikely to be understood by non-specialist audiences, and more common synonyms should generally be preferred in contemporary writing and speech."},"example_sentences":[{"sentence":"The monks were tasked to liturate any dissenting opinions found within the ancient scrolls.","translation":"修道士たちは、古代の巻物の中から異論を見つけたら削除するように命じられた。","type":"verb","meaning_category":"erase"},{"sentence":"The historian discovered evidence of liturated passages in the original manuscript, suggesting later alterations.","translation":"歴史家は、原本の写本に削除された箇所がある証拠を発見し、後世の改変を示唆した。","type":"verb","meaning_category":"obliterate"}]}