{"word":"cancelar-se","priority":"N/A","meanings":[{"part_of_speech":"pronominal verb","definition":"(ポルトガル語) 自己キャンセルする、自分自身を取り消す、自己否定する","english_definition":"(Portuguese) to cancel oneself, to negate or deny oneself, to self-cancel. This can refer to retracting a statement, withdrawing from a commitment, or metaphorically denying one's own identity or past actions.","examples":[{"sentence":"Ele decidiu cancelar-se da festa de última hora.","translation":"He decided to cancel himself from the party at the last minute.","note":"Meaning: He decided to withdraw from attending the party."},{"sentence":"Ela tentou cancelar-se da polêmica, mas foi difícil.","translation":"She tried to cancel herself from the controversy, but it was difficult.","note":"Meaning: She tried to distance herself from the controversy."},{"sentence":"O artista parece querer cancelar-se, renegando suas obras antigas.","translation":"The artist seems to want to cancel himself, disowning his old works.","note":"Meaning: The artist seems to want to disown his old works."}],"collocations":["cancelar-se de um evento (cancel oneself from an event)","cancelar-se da sociedade (cancel oneself from society)","cancelar-se publicamente (cancel oneself publicly)"],"synonyms":["retirar-se","desistir","renegar-se","anular-se","desdizer-se"],"antonyms":["afirmar-se","manter-se","comprometer-se"]},{"part_of_speech":"reflexive verb","definition":"(ブラジルポルトガル語、スラング) キャンセルされる、社会的に抹殺される","english_definition":"(Brazilian Portuguese, slang) to be cancelled; to be socially ostracized or boycotted due to controversial actions or statements.","examples":[{"sentence":"Ele foi cancelado na internet depois do comentário ofensivo.","translation":"He was cancelled on the internet after the offensive comment.","note":"Meaning: He faced widespread criticism and social boycott online after making an offensive comment."},{"sentence":"A cantora tem medo de ser cancelada se expressar sua opinião.","translation":"The singer is afraid of being cancelled if she expresses her opinion.","note":"Meaning: The singer fears facing public backlash and career damage if she shares her opinion."},{"sentence":"A cultura do cancelamento está a destruir a liberdade de expressão.","translation":"Cancel culture is destroying freedom of expression.","note":"This example illustrates the broader concept of 'cancel culture' where individuals face severe social and professional consequences for perceived missteps."}],"collocations":["ser cancelado na internet (to be cancelled on the internet)","cultura do cancelamento (cancel culture)","cancelado nas redes sociais (cancelled on social media)"],"synonyms":["ser boicotado","ser ostracizado","ser excluído","ser rejeitado"],"antonyms":["ser apoiado","ser aclamado","ser perdoado"]}],"etymology":{"value":"Derives from the verb 'cancelar' (to cancel) with the reflexive pronoun 'se' (oneself). The reflexive form indicates that the action of canceling is directed back at the subject. The slang usage related to 'cancel culture' is a more recent development.","priority":"★★☆"},"pronunciation":{"ipa":"/kɐ̃seˈlaɾ.si/","syllables":"can-ce-lar-se"},"inflection":{"verb_forms":{"present_simple":["cancelo-me","cancelas-te","cancela-se","cancelamo-nos","cancelais-vos","cancelam-se"],"past_simple":["cancelei-me","cancelaste-te","cancelou-se","cancelámo-nos","cancelastes-vos","cancelaram-se"],"future_simple":["cancelar-me-ei","cancelar-te-ás","cancelar-se-á","cancelar-nos-emos","cancelar-vos-eis","cancelar-se-ão"],"present_subjunctive":["cancele-me","canceles-te","cancele-se","cancelemo-nos","canceles-vos","cancelem-se"],"past_subjunctive":["cancelasse-me","cancelasses-te","cancelasse-se","cancelássemos-nos","cancelásseis-vos","cancelassem-se"],"imperative":["cancela-te (tu)","cancele-se (você)","cancelai-vos (vós)","cancelem-se (vocês)"]},"notes":"This is a pronominal verb, so it requires the use of reflexive pronouns (me, te, se, nos, vos, se) that agree with the subject. The reflexive pronoun is attached to the verb in certain tenses and moods."},"usage_notes":{"explanation":"The verb 'cancelar-se' has two main usages. The first is a more literal and general sense of 'canceling oneself' from something, like an event or commitment. The second, and more recent, usage is related to 'cancel culture,' where it means to be socially ostracized or boycotted due to controversial behavior. This second meaning is more common in Brazilian Portuguese slang.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Eu cancelo.","correct":"Eu cancelo-me.","note":"When using 'cancelar-se' in the reflexive sense, always include the reflexive pronoun."},{"incorrect":"Ele foi cancelar.","correct":"Ele foi cancelado.","note":"To express being 'cancelled' in the social ostracism sense, use the passive form 'ser cancelado' (to be cancelled) rather than trying to use 'cancelar' directly."}],"priority":"★★☆"},"related_words":{"derivatives":["cancelamento (cancellation)","cancelado (cancelled)"],"phrases":["cultura do cancelamento (cancel culture)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Moderate frequency, especially with the rise of 'cancel culture' discussions.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Cancelar-se' is a pronominal verb with two main meanings. The first is the literal sense of withdrawing or removing oneself from something. The second, more contemporary meaning, refers to being subjected to 'cancel culture', a form of social ostracism. Understanding the context is crucial to interpreting the intended meaning. The reflexive pronouns are essential for correct usage.","note":"This explanation assumes a reader familiar with the concept of 'cancel culture'."},"example_sentences":[{"sentence":"Após a controvérsia, ele decidiu cancelar-se da vida pública.","translation":"After the controversy, he decided to withdraw from public life.","type":"pronominal verb","meaning_category":"withdrawing from something"},{"sentence":"Ela tem medo de ser cancelada nas redes sociais por suas opiniões políticas.","translation":"She is afraid of being cancelled on social media for her political opinions.","type":"reflexive verb (slang)","meaning_category":"being socially ostracized"},{"sentence":"O autor se cancelou da apresentação do livro devido a problemas de saúde.","translation":"The author cancelled himself from the book presentation due to health problems.","type":"pronominal verb","meaning_category":"withdrawing from something"},{"sentence":"A cultura do cancelamento pode ter um impacto negativo na liberdade de expressão.","translation":"Cancel culture can have a negative impact on freedom of expression.","type":"related phrase","meaning_category":"cancel culture"}]}