{"word":"Bathymetry","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"水深測量（学）、水深図作成（法）","english_definition":"The measurement of depth of water in oceans, seas, or lakes. Also, the art or science of mapping or charting depths of water.","examples":[{"sentence":"Bathymetry is essential for safe navigation.","translation":"水深測量は安全な航行に不可欠です。"},{"sentence":"High-resolution bathymetry revealed previously unknown underwater features.","translation":"高解像度の水深測量により、これまで知られていなかった水中の地形が明らかになった。"},{"sentence":"Scientists use bathymetry to study ocean floor topography.","translation":"科学者たちは水深測量を使って海底地形を研究する。"}],"collocations":["Conduct bathymetry","High-resolution bathymetry","Multibeam bathymetry","Seafloor bathymetry","Coastal bathymetry"],"synonyms":["Hydrography","Depth sounding","Underwater mapping"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek βαθύς (bathýs, \"deep\") + μέτρον (métron, \"measure\").","priority":"★★★"},"pronunciation":{"ipa":"/bæˈθɪmətri/","syllables":"ba-thim-e-try"},"inflection":{"noun_plural":"Bathymetries"},"usage_notes":{"explanation":"Bathymetry is the underwater equivalent of topography. While topography deals with the mapping of land surfaces, bathymetry focuses on mapping the depths and shapes of underwater terrain. It's crucial for various applications, including navigation, resource exploration, environmental monitoring, and scientific research.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Bathymetry is used to measure height of mountains.","correct":"✓ Bathymetry is used to measure depth of water bodies.","note":"Bathymetry specifically measures water depth, not land height. Topography is used for measuring land elevation."},{"incorrect":"✗ Bathymetry is the same as oceanography.","correct":"✓ Bathymetry is a component of oceanography.","note":"Oceanography is a broader field that encompasses the study of the ocean, while bathymetry is a specific technique for measuring water depth."}],"priority":"★★☆"},"related_words":{"derivatives":["Bathymetric (adjective)","Bathymetrically (adverb)"],"phrasal_verbs":[],"related_fields":["Oceanography","Hydrography","Geophysics","Marine Geology"]},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Bathymetry is a specialized term used in the fields of oceanography, hydrography, and marine science. Understanding it requires familiarity with scientific vocabulary and the concepts of underwater mapping and depth measurement. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The research vessel used multibeam sonar to perform detailed bathymetry of the coral reef.","translation":"調査船は、マルチビームソナーを使用して、サンゴ礁の詳細な水深測量を実施した。","type":"general","meaning_category":"水深測量"},{"sentence":"Changes in bathymetry can indicate shifts in sediment deposition patterns.","translation":"水深測量の変化は、堆積物の堆積パターンの変化を示す可能性がある。","type":"scientific","meaning_category":"水深測量"},{"sentence":"Accurate bathymetry is crucial for creating nautical charts.","translation":"正確な水深測量は、海図を作成するために不可欠である。","type":"practical","meaning_category":"水深測量"}]}