{"word":"ex-founder","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(会社・組織などの)元創業者、以前の創業者","english_definition":"A person who formerly founded a company or organization.","examples":[{"sentence":"The ex-founder is now a consultant for several startups.","translation":"その元創業者は現在、いくつかのスタートアップ企業のコンサルタントをしている。"},{"sentence":"She interviewed the ex-founder to get insights into the company's early days.","translation":"彼女は会社の初期の頃の内情を知るために、元創業者のインタビューを行った。"},{"sentence":"Many investors are interested in companies led by ex-founders.","translation":"多くの投資家は、元創業者が率いる企業に興味を持っている。"}],"collocations":["ex-CEO","ex-president","former founder","previous founder"],"synonyms":["former founder","previous founder"],"antonyms":["current founder","incumbent founder"]}],"etymology":{"value":"The prefix 'ex-' is added to 'founder' to indicate a former or previous status. 'Founder' comes from the Latin 'fundator,' meaning 'one who lays a foundation.'","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌɛksˈfaʊndər/","syllables":"ex-found-er"},"inflection":{"noun_plural":"ex-founders"},"usage_notes":{"explanation":"'Ex-founder' refers to someone who used to be a founder of a company or organization but is no longer in that role. This term is often used in business contexts to describe individuals who have moved on from their founding roles, perhaps to pursue other ventures, retire, or take on different positions within or outside the company.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a ex-founder of the company.","correct":"✓ He is an ex-founder of the company.","note":"Use 'an' before 'ex-' because it is pronounced with a vowel sound."},{"incorrect":"✗ The ex founder are very successful.","correct":"✓ The ex-founders are very successful.","note":"Make sure to use the plural form 'ex-founders' when referring to multiple former founders."}],"priority":"★☆☆"},"related_words":{"derivatives":["founder","co-founder","founding member","founding team"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Relatively low frequency. Used primarily in business and startup contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'ex-founder' is a compound noun used to describe someone who was previously a founder of a company or organization. It is commonly used in business and startup contexts. The prefix 'ex-' indicates a former status, similar to 'ex-president' or 'ex-wife.' Understanding the meaning of 'ex-' and 'founder' individually helps to grasp the meaning of 'ex-founder.'"},"example_sentences":[{"sentence":"The ex-founder of Google is now focusing on philanthropic endeavors.","translation":"Googleの元創業者は現在、慈善活動に注力している。","type":"noun","meaning_category":"元創業者"},{"sentence":"Many venture capitalists seek advice from ex-founders who have successfully exited their companies.","translation":"多くのベンチャーキャピタリストは、会社を成功裡にイグジットさせた元創業者からアドバイスを求めている。","type":"noun","meaning_category":"元創業者"},{"sentence":"The ex-founder shared valuable lessons learned during the company's initial stages.","translation":"元創業者は、会社の初期段階で学んだ貴重な教訓を共有した。","type":"noun","meaning_category":"元創業者"}]}