{"word":"convocating","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(会議・集会などを)招集する、召集する","english_definition":"To call together or summon (an assembly or meeting).","examples":[{"sentence":"The president is convocating a meeting of his advisors.","translation":"大統領は顧問会議を招集している。"},{"sentence":"The university is convocating a special assembly to address the recent events.","translation":"大学は最近の出来事に対処するために特別集会を招集している。"}],"collocations":["convocate a meeting","convocate an assembly","convocate a conference"],"synonyms":["assemble","summon","convene","muster","gather"],"antonyms":["adjourn","dismiss","disband"]},{"part_of_speech":"verb","transitivity":"vi","definition":"(集会などが)招集される、召集される","english_definition":"To come together in a meeting or assembly.","examples":[{"sentence":"The committee is convocating next week to discuss the budget.","translation":"委員会は予算について議論するために来週招集される。"},{"sentence":"The delegates are convocating in Geneva for the international conference.","translation":"代表者たちは国際会議のためにジュネーブに召集されている。"}],"collocations":["committee convocating","delegates convocating"],"synonyms":["assemble","convene","gather"],"antonyms":["disperse","scatter"]}],"etymology":{"value":"Late Latin convocatus, past participle of convocare, from Latin com- 'together' + vocare 'to call'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒnvəˌkeɪtɪŋ/","syllables":"con-vo-cat-ing"},"inflection":{"verb_forms":{"present_simple":["convocate","convocates"],"past_simple":"convocated","past_participle":"convocated","present_participle":"convocating"}},"usage_notes":{"explanation":"'Convocating' is the present participle and gerund form of the verb 'convocate'. It is used to describe the action of calling together or summoning an assembly or meeting, or the state of coming together in a meeting. It is a formal term often used in academic, governmental, or organizational contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The convocating of the students were held in the auditorium.","correct":"✓ The convocation of the students was held in the auditorium.","note":"'Convocating' is a verb form; the noun form for the event is 'convocation'."},{"incorrect":"✗ They are convocating about the issue.","correct":"✓ They are convocating to discuss the issue.","note":"When 'convocating' is used to describe the purpose of the meeting, use 'to' + infinitive."}],"priority":"★★☆"},"related_words":{"derivatives":["convocation (noun): A formal gathering of people, especially for academic purposes.","convocator (noun): One who convocates or calls together."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Convocating' is a formal and relatively uncommon word that refers to the act of calling together a formal assembly or meeting. It is often used in academic or official contexts. Understanding its meaning and usage requires a strong vocabulary and familiarity with formal language.","priority":"★★☆"},"example_sentences":[{"sentence":"The principal is convocating a meeting with the teachers to discuss the new curriculum.","translation":"校長は新しいカリキュラムについて議論するために教師との会議を招集している。","type":"verb","meaning_category":"招集する"},{"sentence":"The representatives are convocating in the capital city to address the national crisis.","translation":"代表者たちは国家の危機に対処するために首都に召集されている。","type":"verb","meaning_category":"召集される"},{"sentence":"The committee is currently convocating to review the proposals.","translation":"委員会は現在、提案を検討するために招集されている。","type":"verb","meaning_category":"招集される"}]}