{"word":"deer-fly","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"シカバエ","english_definition":"Any of various bloodsucking flies of the genus *Chrysops*, which are pests of deer and other animals, including humans.","examples":[{"sentence":"Deer-flies are known for their painful bites.","translation":"シカバエは痛い刺し傷で知られています。"},{"sentence":"I was bitten by a deer-fly while hiking in the woods.","translation":"森をハイキング中にシカバエに刺されました。"}],"collocations":["deer-fly bite","deer-fly repellent","deer-fly larvae"],"synonyms":["gadfly","horsefly"],"antonyms":[]}],"etymology":{"value":"Compound of \"deer\" + \"fly\", referring to the insect's habit of feeding on deer.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈdɪərflaɪ/","syllables":"deer-fly"},"inflection":{"noun_plural":"deer-flies"},"usage_notes":{"explanation":"Deer-flies are often found in wooded areas and near bodies of water. They are active during the daytime and are attracted to movement and dark colors. Their bites can be painful and cause irritation.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a deer fly.","correct":"✓ I saw a deer-fly.","note":"The correct spelling is with a hyphen: deer-fly."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Deer-fly' refers to a specific type of biting fly that is a pest to deer and other animals, including humans. It's a compound word that is relatively uncommon in everyday conversation but may be encountered in descriptions of nature, hiking, or pest control. Because it's a specific term, understanding the context in which it's used is important."},"example_sentences":[{"sentence":"The deer-fly was persistent in its attempts to bite me.","translation":"そのシカバエはしつこく私を刺そうとしてきた。","type":"noun","meaning_category":"insect"},{"sentence":"Applying insect repellent can help protect against deer-fly bites.","translation":"虫よけスプレーを塗ることは、シカバエの咬傷から身を守るのに役立ちます。","type":"noun","meaning_category":"insect"}]}