{"word":"Opisthotonic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"後弓反張の、後弓緊張の","english_definition":"Relating to or characterized by opisthotonos, a condition of severe hyperextension and spasticity in which an individual's head, neck, spinal column, and lower extremities form a backward arch.","examples":[{"sentence":"The child exhibited opisthotonic posturing due to severe meningitis.","translation":"その子供は重度の髄膜炎により後弓反張の姿勢を示した。"},{"sentence":"Opisthotonic spasms can be a symptom of tetanus.","translation":"後弓反張の痙攣は破傷風の症状である可能性がある。"}],"collocations":["opisthotonic posture","opisthotonic spasm","opisthotonic arching"],"synonyms":["hyperextended","arched","spastic"],"antonyms":[]}],"etymology":{"value":"From Ancient Greek ὀπισθότονος (opisthótonos), from ὀπίσθιος (opísthios, “behind”) + τόνος (tónos, “tension, tone”).","priority":"★★☆"},"pronunciation":{"ipa":"ˌɒpɪsθəˈtɒnɪk","syllables":"o-pis-tho-ton-ic"},"inflection":{"notes":"This word is primarily used as an adjective. The noun form is 'opisthotonos'."},"usage_notes":{"explanation":"Opisthotonic describes a specific type of abnormal posture or spasm characterized by severe hyperextension and arching of the back. It is most often associated with neurological conditions, such as tetanus, meningitis, or severe brain injury. The term is primarily used in medical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The patient was opisthotonic with joy.","correct":"✓ The patient exhibited opisthotonic posturing due to a neurological condition.","note":"Opisthotonic is a medical term describing a specific, severe physical condition, not a general expression of emotion. It is caused by muscle spasms and hyperextension, usually due to a neurological issue."}],"priority":"★☆☆"},"related_words":{"derivatives":["opisthotonos (noun: 後弓反張)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Specialized medical vocabulary)","frequency_google_ngram":"Very low frequency. Primarily a medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Opisthotonic' is a highly specialized medical term referring to a specific type of severe muscle spasm and hyperextension causing arching of the back. It is primarily encountered in medical literature and discussions related to neurological conditions such as tetanus or meningitis. Due to its highly technical nature and limited usage outside of medical contexts, it is considered a C2 level word."},"example_sentences":[{"sentence":"The doctor noted the patient's opisthotonic position in the examination report.","translation":"医師は診察報告書に患者の後弓反張の姿勢を記録した。","type":"adjective","meaning_category":"後弓反張の"},{"sentence":"Opisthotonic seizures are a rare but serious complication of certain infections.","translation":"後弓反張の発作はまれだが、特定の感染症の重篤な合併症である。","type":"adjective","meaning_category":"後弓反張の"}]}