{"word":"unadjournment","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(会議などの)再開、休会解除","english_definition":"The act of resuming or reconvening a meeting or session that had been adjourned.","examples":[{"sentence":"The unadjournment of the committee meeting allowed them to finish discussing the pending legislation.","translation":"委員会会議が再開されたことで、彼らは懸案の法案について議論を終えることができた。"},{"sentence":"After a brief recess, the unadjournment of the court proceedings allowed the trial to continue.","translation":"短い休憩の後、裁判手続きが再開され、裁判を継続することができた。"}],"collocations":["motion for unadjournment","order of unadjournment","formal unadjournment"],"synonyms":["reconvening","resumption","reactivation"],"antonyms":["adjournment","recess","suspension"]}],"etymology":{"value":"The word is formed by adding the prefix 'un-' (meaning 'not' or 'opposite of') to the word 'adjournment'. 'Adjournment' itself comes from the Old French 'ajorner', meaning 'to put off to a day', which is derived from 'a jorn', meaning 'to a day'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnədˈdʒɜːrnmənt/","syllables":"un-ad-journ-ment"},"inflection":{"noun_plural":"unadjournments"},"usage_notes":{"explanation":"'Unadjournment' is a relatively rare and formal term, primarily used in parliamentary or legal contexts. It refers to the act of bringing a meeting or session back into session after it has been formally adjourned. The term implies a deliberate and official action to resume proceedings.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The unadjournment was held informally.","correct":"✓ The unadjournment was conducted formally.","note":"Unadjournment typically implies a formal process, so describing it as 'informal' is contradictory. It usually requires a motion and a vote."},{"incorrect":"✗ They unadjourned the meeting without a notice.","correct":"✓ They reconvened the meeting without a notice.","note":"While 'unadjourned' is technically correct, 'reconvened' is a more common and easily understood term in general usage."}],"priority":"★★☆"},"related_words":{"derivatives":["adjourn (verb): to postpone or suspend a session.","adjournment (noun): the act of adjourning.","reconvene (verb): to convene again, to resume a meeting.","resumption (noun): the act of beginning again or continuing after a pause or interruption."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (very rare, specialized vocabulary)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Unadjournment' is a formal term used in legal or parliamentary settings. It refers to the act of resuming a meeting or session after it has been officially adjourned (suspended). It's the opposite of adjournment and implies a formal process to bring the meeting back into session. This word is not commonly used in everyday conversation and is primarily found in formal documents or discussions related to governance and legal procedures."},"example_sentences":[{"sentence":"The senator called for an unadjournment to address the urgent matter before the legislative body.","translation":"上院議員は、立法府が緊急の問題に対処するために休会解除を求めた。","type":"noun","meaning_category":"再開、休会解除"},{"sentence":"Following the recess, the unadjournment of the hearing allowed the witnesses to continue their testimony.","translation":"休憩後、公聴会が再開され、証人たちは証言を続けることができた。","type":"noun","meaning_category":"再開、休会解除"}]}