{"word":"epanaphoral","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(修辞学で)エパナフォラ（反復法）の、句頭反復の","english_definition":"Relating to or characterized by epanaphora (the repetition of a word or phrase at the beginning of successive clauses).","examples":[{"sentence":"The speech employed epanaphoral structures for emphasis.","translation":"その演説は強調のためにエパナフォラ構造を用いた。"},{"sentence":"Epanaphoral repetition can create a powerful rhetorical effect.","translation":"句頭反復は、強力な修辞効果を生み出すことができる。"}],"collocations":["epanaphoral structure","epanaphoral repetition","epanaphoral effect"],"synonyms":["anaphoric","repetitive","rhetorical"],"antonyms":[]}],"etymology":{"value":"Derived from \"epanaphora\" (from Greek ἐπαναφορά, epanaphora, 'repetition') + \"-al\" (suffix indicating relation).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛpənəˈfɔːrəl/","syllables":"e-pan-a-pho-ral"},"inflection":{"notes":"Adjectives do not typically inflect in English, beyond comparative and superlative forms, which are rare for this word."},"usage_notes":{"explanation":"The term \"epanaphoral\" is specifically used in the context of rhetoric and literary analysis to describe something that is related to or makes use of epanaphora. It is not a commonly used word outside of these specific fields.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The epanaphoral is a type of metaphor.","correct":"✓ Epanaphora is a type of rhetorical device.","note":"Epanaphora is the rhetorical device; epanaphoral is the adjective describing something related to it."}],"priority":"★★☆"},"related_words":{"derivatives":["epanaphora (noun: the repetition of a word or phrase at the beginning of successive clauses)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"epanaphoral\" is a technical term used in rhetoric and literary analysis. It describes something related to epanaphora, which is the repetition of a word or phrase at the beginning of successive clauses. Understanding this word requires a strong vocabulary and familiarity with rhetorical devices. It is unlikely to be encountered outside of academic or specialized contexts."},"example_sentences":[{"sentence":"The poet used an epanaphoral style to create a sense of urgency.","translation":"詩人は、切迫感を生み出すためにエパナフォラ形式を用いた。","type":"adjective","meaning_category":"(修辞学で)エパナフォラ（反復法）の、句頭反復の"}]}