{"word":"Strouding","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(historical) A coarse cloth formerly used for shrouds or for trade with Native Americans.","english_definition":"A coarse, heavy cloth, often woolen, formerly used for shrouds or as a trade item with Native Americans.","examples":[{"sentence":"The traders offered strouding and other goods in exchange for furs.","translation":"交易商たちは、毛皮と引き換えにストローディングやその他の商品を提供した。"},{"sentence":"The body was wrapped in strouding before burial.","translation":"遺体は埋葬前にストローディングで包まれた。"}],"collocations":["trade strouding","woolen strouding","wrap in strouding"],"synonyms":["coarse cloth","shroud cloth"],"antonyms":[]}],"etymology":{"value":"From Stroud, a town in Gloucestershire, England, known for its woollen cloth production.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstraʊdɪŋ/","syllables":"Stroud-ing"},"inflection":{"noun_plural":"Stroudings"},"usage_notes":{"explanation":"'Strouding' refers to a specific type of coarse cloth, historically significant in trade, particularly with Native Americans, and for use as shrouds. It is primarily encountered in historical contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She bought some strouding to make a dress.","correct":"✓ She bought some wool fabric to make a dress.","note":"'Strouding' is a specific historical term. For general cloth, use 'wool fabric' or similar terms."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Strouding' is a highly specialized historical term referring to a coarse cloth. It is unlikely to be encountered outside of historical texts or discussions of early American trade. Understanding requires knowledge of historical textiles and trade practices."},"example_sentences":[{"sentence":"The museum displayed a piece of original strouding used in the fur trade.","translation":"博物館では、毛皮貿易で使用されたオリジナルのストローディングの断片が展示されていた。","type":"noun","meaning_category":"historical cloth"},{"sentence":"Early settlers often bartered strouding for goods with the local tribes.","translation":"初期の入植者たちは、地元の部族との間でストローディングを物々交換することが多かった。","type":"noun","meaning_category":"historical trade item"}]}