{"word":"underminer","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(人や計画などを)弱体化させる人、陰で妨害する人","english_definition":"a person who weakens or sabotages something, especially gradually or secretly.","examples":[{"sentence":"He saw his rivals as underminers of the company's success.","translation":"彼はライバルたちを会社の成功を弱体化させる者だと見ていた。"},{"sentence":"She accused him of being an underminer of her authority.","translation":"彼女は彼を自分の権威を陰で弱体化させる者だと非難した。"}],"collocations":["a political underminer (政治的な妨害者)","an underminer of trust (信頼を損なう人)"],"synonyms":["saboteur","subverter","detractor","weakener","attacker","critic"],"antonyms":["supporter","promoter","defender","strengthener"]}],"etymology":{"value":"The word 'underminer' is derived from the verb 'undermine,' which comes from 'under-' (beneath) and 'mine' (to dig). Originally, it referred to digging beneath something to weaken its foundations.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndərˈmaɪnər/","syllables":"un-der-mi-ner"},"inflection":{"noun_plural":"underminers"},"usage_notes":{"explanation":"'Underminer' refers to someone who weakens or sabotages something, often in a subtle or secretive way. It can apply to individuals who undermine relationships, organizations, or even abstract concepts like trust or authority. The action is often gradual and insidious, rather than a direct, overt attack.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a big underminer.","correct":"✓ He is a major underminer. / ✓ He is a significant underminer.","note":"While 'big' can sometimes be used informally, 'major' or 'significant' are more common and appropriate when describing the extent of someone's undermining actions."},{"incorrect":"✗ She is an underminer of the building.","correct":"✓ She is undermining the building's foundation.","note":"'Underminer' generally refers to a person, not something that directly affects a physical structure. If referring to a physical structure, use the verb 'undermine'."}],"priority":"★★☆"},"related_words":{"derivatives":["undermine (verb)","undermining (adjective/gerund)"],"idioms_phrases":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1-C2","frequency_google_ngram":"Relatively low frequency. The verb 'undermine' is more common.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'underminer' is a relatively sophisticated term that describes someone who weakens or sabotages something, often in a subtle or secretive way. It implies a gradual and insidious process of weakening, rather than a direct, overt attack. Understanding the nuances of this word requires a good grasp of abstract concepts and the ability to recognize subtle forms of manipulation or sabotage."},"example_sentences":[{"sentence":"The constant criticism from his colleagues made him feel like they were underminers of his confidence.","translation":"同僚からの絶え間ない批判は、彼らが彼の自信を弱体化させる者のように感じさせた。","type":"noun","meaning_category":"弱体化させる人"},{"sentence":"She identified several key underminers within the organization who were actively working against the new policies.","translation":"彼女は、新しい政策に積極的に反対している組織内の主要な妨害者を数人特定した。","type":"noun","meaning_category":"陰で妨害する人"},{"sentence":"The constant leaks to the press suggested that there were underminers within the government.","translation":"マスコミへの絶え間ないリークは、政府内に妨害者がいることを示唆していた。","type":"noun","meaning_category":"陰で妨害する人"}]}