{"word":"Defectology","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"欠陥学（発達障害、身体障害、精神遅滞など、様々な欠陥や障害を持つ人々の教育、リハビリテーション、社会適応を研究する学問分野）","english_definition":"The study of individuals with developmental disabilities, physical disabilities, and intellectual disabilities, focusing on their education, rehabilitation, and social adaptation.","examples":[{"sentence":"Defectology plays a crucial role in developing effective educational strategies for children with special needs.","translation":"欠陥学は、特別なニーズを持つ子供たちのための効果的な教育戦略を開発する上で重要な役割を果たしています。"},{"sentence":"The principles of defectology are applied in designing inclusive programs for people with disabilities.","translation":"欠陥学の原則は、障害を持つ人々のための包括的なプログラムを設計する際に適用されます。"}],"collocations":["applied defectology","educational defectology","medical defectology","principles of defectology"],"synonyms":["special education","remedial education","rehabilitation science"],"antonyms":[]}],"etymology":{"value":"The term 'defectology' is derived from the word 'defect,' referring to impairments or deficiencies, combined with '-ology,' indicating the study of a particular subject.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdiːfɛkˈtɒlədʒi/","syllables":"de-fec-tol-o-gy"},"inflection":{"noun_plural":"defectologies"},"usage_notes":{"explanation":"Defectology is a specialized field that integrates aspects of education, psychology, medicine, and sociology to address the needs of individuals with various disabilities. It focuses on understanding the nature of the defects, developing appropriate interventions, and promoting social inclusion.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Defectology is only concerned with physical disabilities.","correct":"✓ Defectology encompasses a wide range of disabilities, including physical, intellectual, and developmental.","note":"Defectology covers various types of disabilities, not just physical ones."},{"incorrect":"✗ Defectology aims to cure disabilities.","correct":"✓ Defectology focuses on education, rehabilitation, and social adaptation for individuals with disabilities.","note":"The primary goal is to improve the quality of life and social integration, not necessarily to cure the disabilities."}],"priority":"★★☆"},"related_words":{"derivatives":["defectologist (noun: 欠陥学者)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Defectology is an advanced academic term referring to the study and treatment of individuals with various disabilities, including developmental, physical, and intellectual impairments. It is a multidisciplinary field that combines education, psychology, medicine, and sociology to develop effective strategies for rehabilitation and social inclusion. This term is primarily used in academic and professional contexts related to special education and disability studies.","note":"This term is not commonly used in everyday conversation and is primarily found in academic and professional contexts."},"example_sentences":[{"sentence":"The conference featured presentations on the latest research in defectology.","translation":"その会議では、欠陥学における最新の研究に関する発表が行われました。","type":"general","meaning_category":"study"},{"sentence":"Applied defectology provides practical methods for supporting students with learning disabilities.","translation":"応用欠陥学は、学習障害を持つ学生を支援するための実践的な方法を提供します。","type":"applied","meaning_category":"application"},{"sentence":"Defectology emphasizes the importance of early intervention for children with developmental delays.","translation":"欠陥学は、発達の遅れを持つ子供たちに対する早期介入の重要性を強調しています。","type":"emphasis","meaning_category":"importance"}]}