{"word":"unsaturation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"不飽和（の状態）、不飽和度","english_definition":"The state of being unsaturated; the degree to which a substance is unsaturated. In chemistry, it refers to a compound containing double or triple bonds, and thus capable of adding more atoms or groups.","examples":[{"sentence":"The oil's unsaturation level affects its stability.","translation":"その油の不飽和度は安定性に影響を与える。"},{"sentence":"Unsaturation in fatty acids is important for their biological function.","translation":"脂肪酸の不飽和は、その生物学的機能にとって重要である。"},{"sentence":"The degree of unsaturation can be determined by chemical analysis.","translation":"不飽和度は化学分析によって決定できる。"}],"collocations":["degree of unsaturation (不飽和度)","level of unsaturation (不飽和レベル)","increase unsaturation (不飽和度を上げる)","reduce unsaturation (不飽和度を下げる)"],"synonyms":["non-saturation","incompleteness"],"antonyms":["saturation"],"related_terms":["saturated","unsaturated","fatty acid","double bond","triple bond","hydrogenation"],"usage_notes":"In chemistry, unsaturation specifically refers to the presence of double or triple bonds in a molecule, particularly in organic compounds like fats and oils. It indicates that the molecule can accommodate additional atoms or groups through chemical reactions.","level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in scientific or technical contexts.","CEFR":"C2"},"readability_explanation":{"level":"C1","text":"'Unsaturation' is a technical term primarily used in chemistry and related fields. It refers to the presence of multiple bonds (double or triple bonds) in a molecule, indicating that it is not fully saturated with hydrogen atoms. Understanding this term requires a background in chemistry, particularly organic chemistry. It is not commonly used in everyday language."}}],"etymology":{"value":"From 'un-' (not) + 'saturation'. 'Saturation' comes from Latin 'saturare' (to fill fully, to satiate). Thus, 'unsaturation' literally means 'not filled fully'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌnˌsætʃəˈreɪʃən/","syllables":"un-sat-u-ra-tion"},"inflection":{},"common_mistakes":{"examples":[{"incorrect":"✗ The unsaturation of the color.","correct":"✓ The desaturation of the color.","note":"'Unsaturation' is generally not used to describe colors; 'desaturation' is the correct term in that context."}]}}