{"word":"Malayo-Polynesian","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"マレー・ポリネシア語派の、マレー・ポリネシア人の","english_definition":"Relating to or denoting a family of languages spoken in Malaysia, Indonesia, the Philippines, Madagascar, and the islands of the Pacific Ocean.","examples":[{"sentence":"Malayo-Polynesian languages are spoken across a wide geographical area.","translation":"マレー・ポリネシア語族の言語は、広大な地理的領域にわたって話されています。"},{"sentence":"The Malayo-Polynesian people have a rich cultural heritage.","translation":"マレー・ポリネシアの人々は豊かな文化遺産を持っています。"}],"collocations":["Malayo-Polynesian language family","Malayo-Polynesian culture","Proto-Malayo-Polynesian"],"synonyms":["Austronesian"],"antonyms":[]},{"part_of_speech":"noun","definition":"マレー・ポリネシア語、マレー・ポリネシア人","english_definition":"A branch of the Austronesian language family, or a person who speaks a Malayo-Polynesian language.","examples":[{"sentence":"Malayo-Polynesian is a diverse group of languages.","translation":"マレー・ポリネシア語は多様な言語群です。"},{"sentence":"Many Malayo-Polynesians are skilled seafarers.","translation":"多くのマレー・ポリネシア人は熟練した船乗りです。"}],"collocations":["speak Malayo-Polynesian","study Malayo-Polynesian"],"synonyms":["Austronesian language","Austronesian people"],"antonyms":[]}],"etymology":{"value":"'Malayo-' refers to Malaysia, and 'Polynesian' refers to Polynesia, two regions where these languages are prevalent. The term reflects the geographical distribution of the language family.","priority":"★★★"},"pronunciation":{"ipa":"/məˌleɪoʊ pɒlɪˈniːʒən/","syllables":"Ma-lay-o-Po-ly-ne-sian"},"inflection":{"notes":"It can be used as both an adjective and a noun, with no plural form when used as an adjective."},"usage_notes":{"explanation":"'Malayo-Polynesian' is often used interchangeably with 'Austronesian,' although 'Austronesian' is the broader and more scientifically accurate term. 'Malayo-Polynesian' is sometimes used to refer to a subgroup within Austronesian, excluding languages like those spoken in Taiwan.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"Malayo-Polynesian is a country.","correct":"Malayo-Polynesian is a language family.","note":"Malayo-Polynesian refers to a group of languages and people, not a country."}],"priority":"★★☆"},"related_words":{"derivatives":["Austronesian","Polynesian","Malay","Indonesian","Filipino","Madagascan"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'Malayo-Polynesian' is a technical term used in linguistics and anthropology to refer to a large family of languages and the people who speak them. It is most commonly encountered in academic contexts or discussions about language origins and cultural connections in Southeast Asia and the Pacific. Understanding this term requires some familiarity with these fields of study."},"example_sentences":[{"sentence":"Tagalog is a Malayo-Polynesian language spoken in the Philippines.","translation":"タガログ語はフィリピンで話されているマレー・ポリネシア語族の言語です。","type":"adjective","meaning_category":"Language Family"},{"sentence":"The migration patterns of Malayo-Polynesian peoples can be traced through linguistic analysis.","translation":"マレー・ポリネシア人の移住パターンは、言語分析を通じて追跡できます。","type":"noun","meaning_category":"People"},{"sentence":"Research suggests that Proto-Malayo-Polynesian originated in Taiwan.","translation":"研究によると、原マレー・ポリネシア語は台湾で発生したと考えられています。","type":"adjective","meaning_category":"Language Origin"}]}