{"word":"cladocerous","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"枝角類の","english_definition":"Relating to or belonging to the Cladocera, an order of small crustaceans also known as water fleas.","examples":[{"sentence":"The lake was teeming with cladocerous organisms.","translation":"その湖は枝角類の生物でいっぱいだった。"},{"sentence":"Cladoceran species are an important part of the freshwater food web.","translation":"枝角類の種は淡水食物網の重要な部分である。"}],"collocations":["cladocerous zooplankton","cladocerous population","cladocerous species"],"synonyms":["water flea-like"],"antonyms":[]}],"etymology":{"value":"From the taxonomic name Cladocera, which is derived from Greek 'klados' (branch) and 'keras' (horn), referring to the branched antennae of these crustaceans.","priority":"★★☆"},"pronunciation":{"ipa":"/kləˈdɒsərəs/","syllables":"cla-doc-er-ous"},"inflection":{"notes":"Does not inflect.","adjective_forms":{}},"usage_notes":{"explanation":"'Cladocerous' is primarily used in scientific or technical contexts when discussing or describing characteristics of cladocerans. It is not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cladocerous is swimming in the lake.","correct":"✓ A cladoceran is swimming in the lake.","note":"'Cladocerous' is an adjective, not a noun. Use 'cladoceran' as a noun. "},{"incorrect":"✗ The cladocerous animal.","correct":"✓ The cladoceran animal.","note":"'Cladoceran' is the correct noun form. 'Cladocerous' should modify the noun."}],"priority":"★★☆"},"related_words":{"derivatives":["Cladocera (noun: the order of crustaceans)","cladoceran (noun: an individual crustacean of the order Cladocera)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term 'cladocerous' is a highly specialized adjective primarily used in scientific and academic contexts, specifically within the fields of biology, zoology, and ecology. It describes something that relates to or is part of the Cladocera order, which includes water fleas. Due to its niche usage, it is not commonly encountered outside of these specialized fields. Understanding requires familiarity with biological classification and crustacean anatomy."},"example_sentences":[{"sentence":"The researchers studied the cladocerous fauna of the region.","translation":"研究者たちはその地域の枝角類の動物相を調査した。","type":"adjective","meaning_category":"Relating to Cladocera"},{"sentence":"The cladocerous filter feeders play a crucial role in maintaining water quality.","translation":"枝角類の濾過摂食者は水質を維持する上で重要な役割を果たしている。","type":"adjective","meaning_category":"Relating to Cladocera"}]}