{"word":"macronutrients","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"主要栄養素、多量栄養素（炭水化物、タンパク質、脂質など、生命維持や成長に必要な大量の栄養素）","english_definition":"Nutrients that are required in large amounts to provide the energy (calories) and building blocks for growth, maintenance, and repair of the body. The three macronutrients are carbohydrates, proteins, and fats.","examples":[{"sentence":"Macronutrients are essential for human health.","translation":"主要栄養素は人間の健康に不可欠です。"},{"sentence":"The balance of macronutrients in your diet is important for weight management.","translation":"食事中の主要栄養素のバランスは、体重管理に重要です。"},{"sentence":"Athletes often need to carefully monitor their macronutrient intake.","translation":"アスリートは、主要栄養素の摂取量を注意深く監視する必要があることがよくあります。"}],"collocations":["macronutrient intake (主要栄養素の摂取量)","macronutrient ratio (主要栄養素の比率)","balance of macronutrients (主要栄養素のバランス)","essential macronutrients (必須主要栄養素)"],"synonyms":["major nutrients","bulk nutrients"],"antonyms":["micronutrients"]},{"part_of_speech":"noun","definition":"(より広義に)植物に必要な主要栄養素（窒素、リン、カリウムなど）","english_definition":"(More broadly) Essential elements that plants need in large quantities for growth and survival, such as nitrogen, phosphorus, and potassium.","examples":[{"sentence":"Nitrogen, phosphorus, and potassium are the primary macronutrients for plant growth.","translation":"窒素、リン、カリウムは、植物の成長に必要な主要な栄養素です。"},{"sentence":"Farmers often add macronutrients to the soil to improve crop yields.","translation":"農家は、作物の収量を改善するために、主要栄養素を土壌に添加することがよくあります。"}],"collocations":["plant macronutrients (植物の主要栄養素)","essential macronutrients for plants (植物に必要な必須主要栄養素)"],"synonyms":["primary nutrients (for plants)","major plant nutrients"],"antonyms":["micronutrients (for plants)"]}],"etymology":{"value":"'Macro-' (large) + 'nutrient' (nourishing substance). Coined to distinguish from micronutrients, which are needed in smaller quantities.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmækroʊˈnuːtriənts/","syllables":"mac-ro-nu-tri-ents"},"inflection":{"noun_plural":"macronutrients","noun_singular":"macronutrient"},"usage_notes":{"explanation":"'Macronutrients' refers to the three main components of the human diet: carbohydrates, proteins, and fats. They provide energy (measured in calories) and are essential for growth, maintenance, and repair. The term is also used in botany to refer to the major nutrients required by plants, such as nitrogen, phosphorus, and potassium. When discussing diet, it's important to specify the source (e.g., 'macronutrients for humans' or 'plant macronutrients') if the context is unclear.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Macronutrients are vitamins and minerals.","correct":"✓ Macronutrients are carbohydrates, proteins, and fats.","note":"Vitamins and minerals are micronutrients, not macronutrients."},{"incorrect":"✗ You only need a little bit of macronutrients.","correct":"✓ You need a lot of macronutrients.","note":"Macronutrients are required in large amounts, unlike micronutrients."}],"priority":"★★☆"},"related_words":{"derivatives":["macronutrient (singular noun)"],"phrases":["macronutrient deficiency (主要栄養素欠乏症)","macronutrient profile (主要栄養素の構成)","macronutrient composition (主要栄養素の組成)"],"related_terms":["carbohydrates","proteins","fats","micronutrients","vitamins","minerals","diet","nutrition"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, used in specialized contexts (nutrition, health, agriculture).","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Macronutrients' are the essential nutrients that the body needs in large amounts to function properly. These include carbohydrates, proteins, and fats. They provide energy and support growth and maintenance. The term is often used in discussions about diet, nutrition, and health. It's important to understand the role of macronutrients in order to make informed choices about food and nutrition. The term is also used in agriculture to refer to the essential nutrients that plants need in large quantities, such as nitrogen, phosphorus, and potassium. It is important to distinguish macronutrients from micronutrients, which are needed in smaller amounts."},"example_sentences":[{"sentence":"A balanced diet includes the right proportions of all three **macronutrients**.","translation":"バランスの取れた食事には、3つの主要栄養素が適切な割合で含まれています。","type":"noun","meaning_category":"主要栄養素"},{"sentence":"Understanding **macronutrients** can help you achieve your fitness goals.","translation":"主要栄養素を理解することで、フィットネスの目標を達成するのに役立ちます。","type":"noun","meaning_category":"主要栄養素"},{"sentence":"The **macronutrient** composition of this food is listed on the label.","translation":"この食品の主要栄養素の組成はラベルに記載されています。","type":"noun","meaning_category":"主要栄養素"},{"sentence":"Legumes are a good source of both protein and carbohydrates, two important **macronutrients**.","translation":"豆類は、タンパク質と炭水化物の両方の優れた供給源であり、これらは2つの重要な主要栄養素です。","type":"noun","meaning_category":"主要栄養素"}]}