{"word":"smooth-stroking","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"お世辞を言う、へつらう、ごまをする、おべっかを使う","english_definition":"using flattery and charm to persuade someone to do what you want.","examples":[{"sentence":"He's a smooth-stroking salesman who can sell ice to Eskimos.","translation":"彼は、エスキモーに氷を売ることができる、お世辞上手なセールスマンだ。"},{"sentence":"She used her smooth-stroking techniques to get a promotion.","translation":"彼女は、昇進するために、おべっかを使うテクニックを使った。"}],"collocations":["smooth-stroking politician (お世辞を言う政治家)","smooth-stroking salesman (お世辞を言うセールスマン)","smooth-stroking manner (お世辞を言う態度)"],"synonyms":["flattering","ingratiating","obsequious","sycophantic","adulatory","fawning"],"antonyms":["blunt","direct","honest","sincere","forthright"]}],"etymology":{"value":"The term 'smooth-stroking' likely derives from the idea of physically stroking someone smoothly, as a way to soothe or please them. This physical action is then metaphorically applied to the use of flattering words and actions to achieve a desired outcome.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsmuːθ ˈstroʊkɪŋ/","syllables":"smooth-strok-ing"},"inflection":{"notes":"This is an adjective, derived from the verb 'to stroke' (in the sense of flattering). It does not have typical adjective inflections like comparative or superlative forms."},"usage_notes":{"explanation":"'Smooth-stroking' describes someone who uses excessive flattery and charm to manipulate or persuade others. It often carries a negative connotation, suggesting insincerity and a lack of genuine respect. The term implies that the person is not being honest or straightforward, but rather using manipulative tactics to get what they want.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He was smooth-stroke.","correct":"✓ He was smooth-stroking.","note":"'Smooth-stroking' is an adjective, so it needs to be used to describe a noun. 'Smooth-stroke' is not a correct form in this context."},{"incorrect":"✗ She used smooth-stroking to get the job done honestly.","correct":"✓ She used smooth-stroking to get the job done, but it wasn't very honest.","note":"'Smooth-stroking' implies a lack of honesty or sincerity, so it's contradictory to say it was used 'honestly'."}],"priority":"★★☆"},"related_words":{"derivatives":["stroke (noun, verb)","smooth (adjective)"],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Smooth-stroking' is a relatively advanced term used to describe someone who uses flattery and charm to get what they want. It implies a manipulative and insincere approach. This term is not commonly used in everyday conversation and is more likely to appear in literature or professional contexts where nuanced descriptions of behavior are needed. Understanding the negative connotation associated with 'smooth-stroking' is crucial for interpreting its meaning correctly."},"example_sentences":[{"sentence":"The CEO was known for his **smooth-stroking** approach to negotiations.","translation":"そのCEOは、交渉においてお世辞を言うやり方で知られていた。","type":"adjective","meaning_category":"お世辞を言う"},{"sentence":"Don't be fooled by his **smooth-stroking** words; he's only trying to get your money.","translation":"彼のお世辞に騙されないで。彼はあなたのお金を騙し取ろうとしているだけだ。","type":"adjective","meaning_category":"お世辞を言う"},{"sentence":"The politician's **smooth-stroking** tactics were evident in his campaign speeches.","translation":"その政治家のお世辞を言う戦術は、彼の選挙演説で明らかだった。","type":"adjective","meaning_category":"お世辞を言う"}]}