{"word":"orthopaedy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"整形外科学","english_definition":"The branch of medicine dealing with the correction or prevention of deformities, disorders, or injuries of the skeleton and associated structures (such as tendons and ligaments).","examples":[{"sentence":"He is a doctor specializing in orthopaedy.","translation":"彼は整形外科を専門とする医者です。"},{"sentence":"She had to see the orthopaedy department after the accident.","translation":"彼女は事故後、整形外科を受診しなければなりませんでした。"}],"collocations":["orthopaedy clinic (整形外科クリニック)","orthopaedy surgeon (整形外科医)","orthopaedy department (整形外科)"],"synonyms":["orthopedics"],"antonyms":[]}],"etymology":{"value":"From the Greek words \"orthos\" (straight) and \"paideia\" (rearing of children). Originally, orthopaedy focused on correcting deformities in children, but now it encompasses the treatment of musculoskeletal problems in people of all ages.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɔːrθəˈpiːdi/","syllables":"or-tho-pae-dy"},"inflection":{"noun_plural":"orthopaedies"},"usage_notes":{"explanation":"\"Orthopaedy\" and \"orthopedics\" are essentially the same word, both referring to the medical specialty dealing with musculoskeletal conditions. \"Orthopaedy\" is more common in British English, while \"orthopedics\" is the standard spelling in American English. Both spellings are derived from Greek roots.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to go to orthopaedy for my heart.","correct":"✓ I need to go to cardiology for my heart. / ✓ I need to go to orthopaedy for my knee.","note":"Orthopaedy deals with bones and muscles, not the heart. Cardiology is the specialty for heart-related issues."},{"incorrect":"✗ He is an orthopaedy doctor.","correct":"✓ He is an orthopaedist. / ✓ He is an orthopaedic surgeon.","note":"The correct term for a doctor specializing in orthopaedy is \"orthopaedist\" or \"orthopaedic surgeon.\""}],"priority":"★★☆"},"related_words":{"derivatives":["orthopaedic (adjective: relating to orthopaedy)","orthopaedist (noun: a doctor specializing in orthopaedy)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Orthopaedy\" is a specialized medical term referring to the branch of medicine focused on correcting or preventing problems with bones, joints, muscles, ligaments, and tendons. It's a less common spelling of \"orthopedics,\" primarily used in British English. Understanding this term requires a good grasp of medical vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The patient was referred to orthopaedy for a knee replacement.","translation":"患者は膝関節置換術のため整形外科に紹介された。","type":"noun","meaning_category":"整形外科学"},{"sentence":"Orthopaedy has made significant advances in treating sports injuries.","translation":"整形外科はスポーツ外傷の治療において著しい進歩を遂げている。","type":"noun","meaning_category":"整形外科学"}]}