{"word":"fumigants","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"燻蒸剤（くんじょうざい）","english_definition":"Chemicals used to fumigate, i.e., to disinfect or exterminate pests in an enclosed space with fumes or gas.","examples":[{"sentence":"The warehouse was treated with fumigants to eliminate the rodent infestation.","translation":"その倉庫は、ネズミの大量発生を駆除するために燻蒸剤で処理された。"},{"sentence":"Farmers use fumigants to protect their crops from soilborne diseases and pests.","translation":"農家は、土壌伝染性の病気や害虫から作物を守るために燻蒸剤を使用する。"},{"sentence":"The use of certain fumigants is restricted due to their environmental impact.","translation":"特定の燻蒸剤の使用は、環境への影響のために制限されている。"}],"collocations":["soil fumigants (土壌燻蒸剤)","methyl bromide (臭化メチル - 特定の燻蒸剤)","phosphine (リン化水素 - 特定の燻蒸剤)","fumigation treatment (燻蒸処理)","control pests (害虫駆除)"],"synonyms":["pesticide","insecticide","disinfectant","sterilant"],"antonyms":[]}],"etymology":{"value":"The word 'fumigant' comes from the Latin word 'fumigare,' meaning 'to smoke' or 'to fumigate.' This reflects the method of application, where the chemicals are released as fumes or gas.","priority":"★★★"},"pronunciation":{"ipa":"ˈfjuːmɪɡənts","syllables":"fu-mi-gants"},"inflection":{"noun_plural":"fumigants"},"usage_notes":{"explanation":"'Fumigants' are typically used in enclosed spaces such as warehouses, greenhouses, or soil covered with plastic sheeting. They are highly toxic and require careful handling and application by trained professionals. Due to their potential environmental and health hazards, many fumigants are subject to strict regulations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The fumigant is spray.","correct":"✓ The fumigant is a gas.","note":"Fumigants are typically gases or chemicals that release gases, not sprays. Sprays are a different type of pesticide application."},{"incorrect":"✗ You can use fumigants safely without protection.","correct":"✓ You must use fumigants with proper protection.","note":"Fumigants are highly toxic and require protective gear such as respirators and gloves."}],"priority":"★★★"},"related_words":{"derivatives":["fumigate (verb: 燻蒸する)","fumigation (noun: 燻蒸)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, technical term.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word 'fumigants' refers to chemicals that are used to kill pests or disinfect areas by releasing toxic fumes or gases. This term is often used in agricultural, pest control, and public health contexts. Because of the hazardous nature of these chemicals, their use is often regulated and requires specialized knowledge. Understanding this word is important in discussions about pest management, environmental safety, and agricultural practices."},"example_sentences":[{"sentence":"The pest control company used strong **fumigants** to rid the building of termites.","translation":"害虫駆除業者は、建物からシロアリを駆除するために強力な燻蒸剤を使用した。","type":"general"},{"sentence":"Before planting, the soil was treated with **fumigants** to prevent nematode infestations.","translation":"植え付け前に、線虫の寄生を防ぐために土壌を燻蒸剤で処理した。","type":"agricultural"},{"sentence":"The shipping containers were sealed and filled with **fumigants** to comply with import regulations.","translation":"輸送コンテナは密閉され、輸入規制を遵守するために燻蒸剤が充填された。","type":"industrial"}]}