{"word":"helotage","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(古代スパルタの)ヘロット制度、ヘロットの身分","english_definition":"The state or condition of being a helot; the helots as a class.","examples":[{"sentence":"The helotage of the Messenians was a key feature of Spartan society.","translation":"メッセニア人のヘロット制度は、スパルタ社会の重要な特徴だった。"},{"sentence":"Helotage was a system of serfdom unique to ancient Sparta.","translation":"ヘロット制度は、古代スパルタ特有の農奴制度だった。"}],"collocations":["system of helotage","condition of helotage"],"synonyms":["serfdom","slavery","servitude","bondage"],"antonyms":["freedom","liberty","independence"]}],"etymology":{"value":"From Ancient Greek 'εἱλωτεία' (heilōteía), from 'εἵλωτες' (heílōtes, \"helots\").","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɛlətɪdʒ/","syllables":"hel-o-tage"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Helotage' refers specifically to the system of serfdom practiced in ancient Sparta, where the helots were a class of people subjected to the Spartan state. It is not a general term for slavery or serfdom.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The helotage was a free citizen of Sparta.","correct":"✓ The helot was not a free citizen of Sparta.","note":"Helots were not free citizens; they were a subjugated class. 'Helotage' refers to the system itself, not an individual."}],"priority":"★★☆"},"related_words":{"derivatives":["helot (noun: a member of the class of serfs in ancient Sparta)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Helotage' is a specialized term referring to the system of serfdom in ancient Sparta. It is unlikely to be encountered outside of historical or academic contexts. Understanding requires familiarity with ancient Greek history and social structures."},"example_sentences":[{"sentence":"The fear of helotage uprisings constantly influenced Spartan policy.","translation":"ヘロットの反乱への恐れは、常にスパルタの政策に影響を与えた。","type":"noun","meaning_category":"ヘロット制度"},{"sentence":"The burdens of helotage were heavy, with helots performing agricultural labor for their Spartan masters.","translation":"ヘロット制度の負担は重く、ヘロットたちはスパルタの主人たちのために農業労働に従事した。","type":"noun","meaning_category":"ヘロットの身分"}]}