{"word":"Exodontics","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"抜歯術、抜歯学","english_definition":"The branch of dentistry dealing with the extraction of teeth.","examples":[{"sentence":"He specialized in exodontics after dental school.","translation":"彼は歯学部卒業後、抜歯術を専門とした。"},{"sentence":"Exodontics requires a thorough understanding of oral anatomy.","translation":"抜歯術は口腔解剖学の徹底的な理解を必要とする。"}],"collocations":["surgical exodontics","complex exodontics","routine exodontics"],"synonyms":["tooth extraction","dental extraction"],"antonyms":["restorative dentistry","endodontics"]}],"etymology":{"value":"Derived from the Greek words 'ex' (out) + 'odont' (tooth) + 'ics' (science or study of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛksoʊˈdɒntɪks/","syllables":"ex-o-don-tics"},"inflection":{"notes":"Plural form is usually not used. It is generally treated as a singular noun referring to the field of study or practice."},"usage_notes":{"explanation":"'Exodontics' is a specialized field within dentistry. It focuses on the surgical removal of teeth, often due to decay, impaction, or other dental issues. It is a technical term, more common in professional dental settings than in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I need to go to the exodontic.","correct":"✓ I need to see an exodontist.","note":"'Exodontics' is the field of study or practice. 'Exodontist' is the dentist who specializes in exodontics."}],"priority":"★★☆"},"related_words":{"derivatives":["exodontist (noun: a dentist specializing in exodontics)"],"related_terms":["oral surgery","dentistry","extraction"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in professional dental contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Exodontics' is a highly specialized term used within the field of dentistry. It refers specifically to the practice and study of tooth extraction. Due to its technical nature, it's not commonly used outside of professional dental contexts. Understanding this term is primarily relevant for those in the dental field or those researching specific dental procedures."},"example_sentences":[{"sentence":"The patient was referred to exodontics for removal of impacted wisdom teeth.","translation":"患者は埋伏した親知らずの抜歯のため、抜歯科に紹介された。","type":"noun","meaning_category":"抜歯術"},{"sentence":"Advanced training in exodontics is required to perform complex extractions.","translation":"複雑な抜歯を行うには、抜歯術の高度な訓練が必要である。","type":"noun","meaning_category":"抜歯術"}]}