{"topic":"Hotel-related Vocabulary","description":"Common words and phrases associated with hotels, including types of rooms, services, and staff.","categories":[{"category":"Types of Hotels","words":[{"term":"Hotel","definition":"A commercial establishment providing lodging, meals, and other services to the public."},{"term":"Motel","definition":"A roadside hotel or group of cabins for motorists."},{"term":"Resort","definition":"A place that provides recreation and entertainment, especially to vacationers."},{"term":"Boutique Hotel","definition":"A small, stylish hotel, typically in a fashionable urban location."},{"term":"Hostel","definition":"An inexpensive lodging establishment, often with dormitory-style rooms."},{"term":"Inn","definition":"A traditional lodging establishment, often in a rural area, providing food and lodging."},{"term":"Suite Hotel","definition":"A hotel where all rooms are suites, typically including a living area and kitchenette."}]},{"category":"Hotel Rooms & Features","words":[{"term":"Single Room","definition":"A room for one person."},{"term":"Double Room","definition":"A room for two people, typically with one double bed."},{"term":"Twin Room","definition":"A room for two people, typically with two single beds."},{"term":"Suite","definition":"A set of connected rooms, especially in a hotel."},{"term":"Connecting Rooms","definition":"Rooms that are next to each other and have a door connecting them."},{"term":"Adjoining Rooms","definition":"Rooms that are next to each other but do not have a connecting door."},{"term":"Room Service","definition":"The service of having food and drinks brought to one's room in a hotel."},{"term":"Amenities","definition":"Desirable or useful features or facilities of a building or place."},{"term":"En-suite Bathroom","definition":"A bathroom that is directly connected to a bedroom."},{"term":"Mini-bar","definition":"A small refrigerator in a hotel room, typically stocked with drinks and snacks."},{"term":"Balcony","definition":"A platform projecting from the wall of a building, usually with a railing or balustrade."},{"term":"View","definition":"The ability to see something from a particular place; what can be seen from a particular place."}]},{"category":"Hotel Services & Facilities","words":[{"term":"Reception","definition":"The area in a hotel where guests are greeted and checked in."},{"term":"Lobby","definition":"The entrance hall of a hotel."},{"term":"Concierge","definition":"A hotel employee whose job is to assist guests by arranging tours, making reservations, etc."},{"term":"Bellhop","definition":"A hotel employee who carries guests' luggage to their rooms."},{"term":"Housekeeping","definition":"The department responsible for cleaning and maintaining hotel rooms."},{"term":"Laundry Service","definition":"A service that washes and dries clothes for guests."},{"term":"Valet Parking","definition":"A parking service where a hotel employee parks the guest's car."},{"term":"Gym","definition":"A room or building equipped for physical exercise."},{"term":"Swimming Pool","definition":"An artificial pool for swimming."},{"term":"Restaurant","definition":"A place where people pay to sit and eat meals."},{"term":"Bar","definition":"A place where alcoholic drinks are served."},{"term":"Conference Room","definition":"A room in a hotel that is used for meetings and conferences."},{"term":"Wi-Fi","definition":"A wireless networking technology that allows devices to connect to the internet."}]},{"category":"Hotel Staff","words":[{"term":"Manager","definition":"The person responsible for running the hotel."},{"term":"Front Desk Clerk","definition":"An employee who handles check-ins, check-outs, and guest inquiries."},{"term":"Concierge","definition":"An employee who assists guests with travel arrangements, reservations, and other needs."},{"term":"Bellhop","definition":"An employee who carries guests' luggage."},{"term":"Housekeeper","definition":"An employee who cleans and maintains hotel rooms."},{"term":"Chef","definition":"A professional cook, especially in a restaurant or hotel."},{"term":"Bartender","definition":"A person who serves drinks at a bar."},{"term":"Waiter/Waitress","definition":"A person who serves food and drinks at a restaurant or hotel."}]},{"category":"Hotel Actions & Phrases","words":[{"term":"Check-in","definition":"The process of registering at a hotel upon arrival."},{"term":"Check-out","definition":"The process of settling one's account and leaving a hotel."},{"term":"Reservation","definition":"An arrangement to have something (such as a room or table) held for one's use at a later time."},{"term":"Book a room","definition":"To make a reservation for a hotel room."},{"term":"Cancel a reservation","definition":"To revoke a previous reservation."},{"term":"Extend a stay","definition":"To stay longer than originally planned."},{"term":"Early check-in","definition":"Checking in before the standard check-in time."},{"term":"Late check-out","definition":"Checking out after the standard check-out time."},{"term":"Full","definition":"Having no vacancies."},{"term":"Vacancy","definition":"An unoccupied room or space available for rent."},{"term":"Room rate","definition":"The price charged for a room."},{"term":"Upgrade","definition":"To move to a better room or service."},{"term":"Complimentary","definition":"Given free of charge."},{"term":"All-inclusive","definition":"Including all meals, drinks, and activities in the price."}]}]}