{"word":"Safrole","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"サフロール：無色またはわずかに黄色の油状液体で、樟脳のような臭いを持つ。一部の植物（ニクズク、シナモン、月桂樹など）に含まれており、香料、殺虫剤、医薬品の合成に使用される。発がん性があるため、多くの国で使用が制限または禁止されている。","english_definition":"A colorless or slightly yellow oily liquid with a camphor-like odor, found in certain plants (e.g., nutmeg, cinnamon, sassafras). It is used in the synthesis of fragrances, insecticides, and pharmaceuticals. Its use is restricted or banned in many countries due to its carcinogenic properties.","examples":[{"sentence":"Safrole is a precursor in the synthesis of MDMA.","translation":"サフロールはMDMAの合成における前駆体である。"},{"sentence":"The FDA has banned the use of safrole in food and beverages.","translation":"FDAは食品および飲料へのサフロールの使用を禁止している。"}],"collocations":["safrole content","safrole oil","safrole synthesis","safrole extraction","safrole-rich"],"synonyms":["shikimol","allyldioxybenzene","m-methylenedioxybenzene"],"antonyms":[]}],"etymology":{"value":"由来は、1880年代にフランス語の「safrol」から。これは、サッサフラス（sassafras）の油から分離されたことにちなんで名付けられた。サッサフラスは、北米原産の樹木で、根皮から香りの良い油が抽出される。","priority":"★★☆"},"pronunciation":{"ipa":"ˈsæfˌroʊl","syllables":"saf-role"},"inflection":{"noun_plural":"safroles"},"usage_notes":{"explanation":"「Safrole」は化学物質名であり、一般的な会話で使われることは少ない。主に化学、薬学、食品科学などの分野で使用される。発がん性物質であるため、一般消費者が直接触れる機会はほとんどない。学術的な文脈や、規制に関する議論で言及されることが多い。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Safrole is safe to consume in large quantities.","correct":"✓ Safrole is not safe to consume due to its carcinogenic properties.","note":"サフロールは発がん性があるため、摂取は安全ではありません。"},{"incorrect":"✗ Safrole is a common household cleaning product.","correct":"✓ Safrole is not a common household cleaning product due to its restricted use.","note":"サフロールは使用が制限されているため、一般的な家庭用洗剤には含まれていません。"}],"priority":"★★☆"},"related_words":{"derivatives":["isosafrole","dihydrosafrole","methylenedioxy"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「Safrole」は、化学物質の名称であり、一般的な単語ではありません。主に科学、医学、または規制関連の文脈で使用されます。この化合物は、特定の植物油に含まれており、かつては香料や医薬品の製造に使用されていましたが、発がん性があるため、多くの国で使用が制限または禁止されています。そのため、一般の人が日常的に使用したり、目にしたりする機会はほとんどありません。専門的な知識が必要となる単語です。"},"example_sentences":[{"sentence":"The study investigated the carcinogenic effects of safrole in laboratory animals.","translation":"その研究では、実験動物におけるサフロールの発がん性影響が調査された。","type":"noun","meaning_category":"化学物質"},{"sentence":"Safrole is a naturally occurring compound found in sassafras oil.","translation":"サフロールは、サッサフラス油に含まれる天然の化合物である。","type":"noun","meaning_category":"化学物質"},{"sentence":"Regulations limit the amount of safrole allowed in consumer products.","translation":"規制により、消費者製品に許可されるサフロールの量が制限されている。","type":"noun","meaning_category":"化学物質"}]}