{"word":"antiradicalism","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"反急進主義、反過激主義","english_definition":"opposition to radicalism; opposition to fundamental or revolutionary changes in political or social structures.","examples":[{"sentence":"The government's antiradicalism campaign targeted leftist groups.","translation":"政府の反急進主義キャンペーンは、左翼グループを標的にした。"},{"sentence":"Antiradicalism is often associated with conservative political ideologies.","translation":"反急進主義は、保守的な政治イデオロギーと関連付けられることが多い。"}],"collocations":["political antiradicalism","social antiradicalism","antiradicalism campaign","antiradicalism movement"],"synonyms":["conservatism","anti-extremism","anti-revolutionism"],"antonyms":["radicalism","progressivism","revolutionism"]}],"etymology":{"value":"\"anti-\"（反対）+ \"radicalism\"（急進主義）","priority":"★★★"},"pronunciation":{"ipa":"/ˌæntiˈrædɪkəlɪzəm/","syllables":"an-ti-rad-i-cal-ism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"\"Antiradicalism\" refers to the opposition to radical or extreme political or social changes. It often involves defending existing institutions and norms against those who advocate for fundamental reforms or revolutions.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He supported antiradicalism, so he joined the radical party.","correct":"✓ He opposed radicalism, so he joined the conservative party.","note":"Antiradicalism is the opposition to radicalism, so someone who supports antiradicalism would not join a radical party."}],"priority":"★★☆"},"related_words":{"derivatives":["antiradical (adjective)"],"related_terms":["radicalism","conservatism","extremism","ideology"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"antiradicalism\" is a complex term used in political science and sociology to describe opposition to radical political or social change. It implies a defense of existing structures and norms against those who advocate for fundamental reforms or revolutions. Understanding this term requires a grasp of political ideologies and historical contexts where radical movements have emerged."},"example_sentences":[{"sentence":"The rise of populism has fueled a new wave of antiradicalism in many countries.","translation":"ポピュリズムの台頭は、多くの国で新たな反急進主義の波を引き起こしている。","type":"noun","meaning_category":"反急進主義"},{"sentence":"His political views were characterized by a strong antiradicalism.","translation":"彼の政治的見解は、強い反急進主義によって特徴付けられていた。","type":"noun","meaning_category":"反急進主義"}]}