{"word":"deconstructivism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"脱構築主義（建築、文学、哲学などにおける理論および実践）","english_definition":"A postmodern architectural (and philosophical) movement that rejects the rational order and symmetry of modernism, often characterized by fragmentation, non-rectilinear shapes, and controlled chaos. More generally, a critical approach that aims to dismantle traditional structures of thought and meaning.","examples":[{"sentence":"Deconstructivism in architecture often results in buildings that appear unstable or fragmented.","translation":"建築における脱構築主義は、しばしば不安定または断片化されたように見える建物を生み出す。"},{"sentence":"Deconstructivism challenges the idea that there is a single, fixed meaning in a text.","translation":"脱構築主義は、テキストに単一の固定された意味があるという考えに異議を唱える。"}],"collocations":["deconstructivist architecture (脱構築主義建築)","deconstructivist theory (脱構築主義理論)","apply deconstructivism (脱構築主義を適用する)","influence of deconstructivism (脱構築主義の影響)"],"synonyms":["post-structuralism","postmodernism","fragmentation","anti-rationalism"],"antonyms":["structuralism","modernism","functionalism","rationalism","constructivism"]},{"part_of_speech":"adjective","definition":"脱構築主義の","english_definition":"Relating to or characteristic of deconstructivism.","examples":[{"sentence":"The museum features a deconstructivist design.","translation":"その美術館は脱構築主義的なデザインを特徴としている。"},{"sentence":"He is a deconstructivist architect.","translation":"彼は脱構築主義の建築家だ。"}],"collocations":["deconstructivist building (脱構築主義的な建物)","deconstructivist approach (脱構築主義的なアプローチ)","deconstructivist artist (脱構築主義のアーティスト)"],"synonyms":["post-structuralist","postmodern"],"antonyms":["structuralist","modernist"]}],"etymology":{"value":"'Deconstructivism' is formed from 'deconstruct' (to break down into constituent parts; to dismantle) and '-ism' (a suffix indicating a doctrine, theory, or practice). The term gained prominence in the late 1980s, particularly in architectural discourse, influenced by the philosophical work of Jacques Derrida.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdiːkənˈstrʌktɪvɪzəm/","syllables":"de-con-struc-tiv-ism"},"inflection":{"notes":"It is primarily a noun; the adjective form is 'deconstructivist'."},"usage_notes":{"explanation":"Deconstructivism is a complex concept that originated in philosophy and literary criticism before being applied to architecture and other fields. It challenges traditional notions of order, structure, and meaning. In architecture, it often manifests as buildings with fragmented forms, unconventional angles, and a lack of clear symmetry. It's important to distinguish deconstructivism from simple chaos or disorder; it's a deliberate attempt to question and disrupt established conventions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Deconstructionism is the same as destruction.","correct":"✓ Deconstructivism is a critical approach, not simply destruction.","note":"Deconstructivism is not about random destruction; it's a critical analysis and reinterpretation of existing structures. It aims to expose underlying assumptions and contradictions, not just to tear things down. "},{"incorrect":"✗ All modern architecture is deconstructivism.","correct":"✓ Deconstructivism is a specific movement within postmodern architecture.","note":"Deconstructivism is a specific style with identifiable characteristics, not a general term for all modern or postmodern architecture."}],"priority":"★★☆"},"related_words":{"derivatives":["deconstruct (verb: to dismantle, analyze critically)","deconstruction (noun: the act of deconstructing)","deconstructivist (adjective/noun: relating to/a practitioner of deconstructivism)"],"related_concepts":["postmodernism","structuralism","Jacques Derrida","fragmentation","chaos theory","critical theory"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, primarily used in academic or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Deconstructivism' is a complex term primarily used in architecture, philosophy, and literary criticism. It refers to a movement that challenges traditional structures and meanings by breaking them down and reassembling them in unconventional ways. In architecture, this often results in buildings that appear fragmented or asymmetrical. Understanding deconstructivism requires familiarity with postmodern thought and critical theory. It's not a term commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"Frank Gehry is a prominent figure in **deconstructivism** architecture.","translation":"フランク・ゲーリーは脱構築主義建築の著名な人物である。","type":"noun","meaning_category":"脱構築主義"},{"sentence":"The design of the building reflects a **deconstructivist** aesthetic.","translation":"その建物のデザインは脱構築主義的な美学を反映している。","type":"adjective","meaning_category":"脱構築主義の"},{"sentence":"Critics have debated the meaning and purpose of **deconstructivism** in art.","translation":"批評家たちは、芸術における脱構築主義の意味と目的について議論してきた。","type":"noun","meaning_category":"脱構築主義"},{"sentence":"His **deconstructivist** approach to literary analysis is highly influential.","translation":"彼の文学分析への脱構築主義的なアプローチは非常に影響力がある。","type":"adjective","meaning_category":"脱構築主義の"}]}