{"word":"a-swarm","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"群れをなした、うようよいる、わんさかいる","english_definition":"teeming, swarming, or crowded with a large number of things or people.","examples":[{"sentence":"The beach was a-swarm with tourists.","translation":"そのビーチは観光客でごった返していた。"},{"sentence":"The old house was a-swarm with rats.","translation":"その古い家はネズミがうようよいた。"},{"sentence":"The marketplace was a-swarm with vendors and shoppers.","translation":"その市場は露店商と買い物客でごった返していた。"}],"collocations":["a-swarm with tourists","a-swarm with bees","a-swarm with activity"],"synonyms":["teeming","swarming","crowded","thronged","packed"],"antonyms":["deserted","empty","sparse"]},{"part_of_speech":"verb","definition":"群がる、押し寄せる","english_definition":"to move in a large group or mass.","examples":[{"sentence":"The fans a-swarm the stage after the concert.","translation":"コンサートの後、ファンがステージに群がった。"},{"sentence":"Reporters a-swarm the politician after the announcement.","translation":"発表後、記者たちが政治家に群がった。"}],"collocations":["a-swarm the stage","a-swarm the entrance","a-swarm around"],"synonyms":["swarm","throng","crowd","flock","converge"],"antonyms":["disperse","scatter"]}],"etymology":{"value":"The prefix \"a-\" is an archaic English prefix used to indicate a state or condition of being. Combined with \"swarm,\" it creates a descriptive term for being filled with or characterized by a swarm.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈswɔːrm/","syllables":"uh-sworm"},"inflection":{"notes":"This word is often used in a descriptive or figurative manner. The verb form is less common than the adjective form."},"usage_notes":{"explanation":"The term \"a-swarm\" is somewhat archaic and less frequently used in modern English compared to its base word \"swarm.\" It is often employed to vividly describe a place or object that is densely populated or filled with activity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The city is swarm with people.","correct":"✓ The city is a-swarm with people.","note":"The prefix \"a-\" is necessary to form the adjective. Without it, the sentence is grammatically incorrect."},{"incorrect":"✗ They a-swarm to the new store every day.","correct":"✓ They swarm to the new store every day.","note":"The prefix \"a-\" is not typically used with the verb form in modern English. Use \"swarm\" instead."}],"priority":"★★☆"},"related_words":{"derivatives":["swarm (noun, verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"a-swarm\" is a relatively uncommon and somewhat archaic term used to describe something that is teeming or crowded with a large number of things or people. It is more frequently encountered in literature or descriptive writing than in everyday conversation. Understanding the prefix \"a-\" can aid in recognizing the word's meaning, but it's important to note that \"swarm\" is the more common and versatile term.","example_sentences":[]},"example_sentences":[{"sentence":"The park was a-swarm with children during the summer festival.","translation":"夏の祭りの間、公園は子供たちでごった返していた。","type":"adjective","meaning_category":"群れをなした"},{"sentence":"Bees a-swarm the hive in the early morning.","translation":"ミツバチが早朝に巣に群がる。","type":"verb","meaning_category":"群がる"}]}