{"word":"Lymphotoxin","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"リンホトキシン","english_definition":"A cytotoxic cytokine produced by lymphocytes, especially T cells. It is a member of the tumor necrosis factor family and plays a role in inflammation, immunity, and development of lymphoid organs.","examples":[{"sentence":"Lymphotoxin is involved in the pathogenesis of several autoimmune diseases.","translation":"リンホトキシンはいくつかの自己免疫疾患の病因に関与している。"},{"sentence":"The expression of lymphotoxin is upregulated during T cell activation.","translation":"リンホトキシンの発現はT細胞活性化中に上方制御される。"}],"collocations":["lymphotoxin alpha","lymphotoxin beta","lymphotoxin receptor","tumor necrosis factor family"],"synonyms":["TNF-beta","Tumor necrosis factor beta"],"antonyms":[]}],"etymology":{"value":"Derived from \"lymphocyte\" and \"toxin\", reflecting its origin from lymphocytes and its cytotoxic properties.","priority":"★★★"},"pronunciation":{"ipa":"/ˌlɪmfoʊˈtɒksɪn/","syllables":"lym-pho-tox-in"},"inflection":{"noun_plural":"lymphotoxins"},"usage_notes":{"explanation":"Lymphotoxin is a key cytokine involved in immune responses and lymphoid organ development. It exists in different forms, including lymphotoxin-alpha (LTα) and lymphotoxin-beta (LTβ). Dysregulation of lymphotoxin is implicated in various inflammatory and autoimmune conditions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Lymphotoxin is a type of antibody.","correct":"✓ Lymphotoxin is a type of cytokine.","note":"Lymphotoxin is a cytokine, not an antibody. Antibodies are produced by B cells, while lymphotoxin is produced by lymphocytes, especially T cells."}],"priority":"★★☆"},"related_words":{"derivatives":["lymphotoxin-alpha (LTα)","lymphotoxin-beta (LTβ)","cytokine","lymphocyte","tumor necrosis factor (TNF)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Lymphotoxin is a specialized term in immunology and molecular biology. It refers to a specific type of cytokine produced by lymphocytes that plays a role in immune responses and inflammation. Understanding this term requires knowledge of basic immunology and cell signaling. It is primarily used in scientific literature and research contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The study investigated the role of lymphotoxin in chronic inflammation.","translation":"その研究では、慢性炎症におけるリンホトキシンの役割が調査された。","type":"scientific","meaning_category":"inflammation"},{"sentence":"Lymphotoxin-alpha is a key mediator in the development of lymphoid tissues.","translation":"リンホトキシンアルファは、リンパ組織の発達における重要なメディエーターである。","type":"scientific","meaning_category":"immunology"}]}