{"word":"desvirtuado","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(スペイン語) 本来の性質や目的が損なわれた、歪められた、堕落した","english_definition":"(Spanish) distorted, corrupted, perverted, having lost its original nature or purpose.","examples":[{"sentence":"El debate se ha desvirtuado por los ataques personales.","translation":"The debate has been distorted by personal attacks.","note":"(The debate has lost its original purpose because of personal attacks.)"},{"sentence":"La fiesta se desvirtuó cuando empezaron a beber demasiado.","translation":"The party was ruined when they started drinking too much.","note":"(The party lost its original joyful nature when they started drinking too much.)"},{"sentence":"La ley ha sido desvirtuada por la corrupción.","translation":"The law has been corrupted by corruption.","note":"(The law has lost its original integrity because of corruption.)"}],"collocations":["desvirtuar un debate (議論を歪める)","desvirtuar una ley (法律を堕落させる)","desvirtuar una tradición (伝統を歪める)","desvirtuar un propósito (目的を損なう)"],"synonyms":["corrompido","degradado","pervertido","adulterado","tergiversado","falseado"],"antonyms":["auténtico","genuino","puro","íntegro"]}],"etymology":{"value":"Derives from the Spanish verb 'desvirtuar', which comes from 'des-' (dis-, meaning negation or reversal) + 'virtud' (virtue, quality, power) + '-ar' (infinitive ending). Therefore, it literally means 'to take away the virtue or quality'.","priority":"N/A"},"pronunciation":{"ipa":"/des.biɾˈtwa.ðo/","syllables":"des-vir-tua-do"},"inflection":{"gender":"masculine","number":"singular"},"usage_notes":{"explanation":"'Desvirtuado' is used to describe something that has lost its original essence, purity, or value. It implies a negative change, often due to external influences or actions. It can apply to abstract concepts like laws, debates, or traditions, as well as to more concrete situations like parties or events. The term suggests a deviation from what was intended or expected, resulting in a less desirable or even negative outcome.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"*El agua está desvirtuada.","correct":"El agua está contaminada.","note":"'Desvirtuado' is not typically used for physical contamination. 'Contaminada' (contaminated) is more appropriate."},{"incorrect":"*Estoy desvirtuado.","correct":"Estoy decepcionado / desilusionado.","note":"'Desvirtuado' is rarely used to describe a person's emotional state directly. 'Decepcionado' (disappointed) or 'desilusionado' (disillusioned) are better choices."}],"priority":"N/A"},"related_words":{"derivatives":["desvirtuar (verb: to distort, corrupt, pervert)","desvirtuación (noun: distortion, corruption, perversion)"],"phrases":["estar desvirtuado (to be distorted/corrupted)","sentirse desvirtuado (to feel that something has lost its value)"],"priority":"N/A"},"level_frequency":{"CEFR":"C1-C2","frequency_google_ngram":"Relatively infrequent.","priority":"N/A"},"readability_explanation":{"level":"Advanced","text":"The word 'desvirtuado' is a more advanced term that implies a significant alteration or corruption of something's original nature or purpose. It's not a word commonly used in everyday conversation but is more frequently found in formal writing or discussions about abstract concepts or societal issues. Understanding the nuance of 'desvirtuado' requires a good grasp of Spanish vocabulary and an ability to comprehend abstract ideas."},"example_sentences":[{"sentence":"La globalización ha desvirtuado muchas culturas locales.","translation":"Globalization has distorted many local cultures.","type":"general","meaning_category":"Distorted cultures"},{"sentence":"El testimonio del testigo fue desvirtuado por el abogado defensor.","translation":"The witness's testimony was discredited by the defense lawyer.","type":"legal","meaning_category":"Discredited testimony"},{"sentence":"La inocencia de la infancia se ve desvirtuada por la exposición temprana a la violencia.","translation":"The innocence of childhood is corrupted by early exposure to violence.","type":"social","meaning_category":"Corrupted innocence"}]}