{"word":"stasimorphy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"（植物学）花における雄しべの、雌しべへの形態変化","english_definition":"(botany) The transformation of stamens into pistils in a flower.","examples":[{"sentence":"Stasimorphy is a type of floral metamorphosis.","translation":"stasimorphyは、花の変態の一種です。"},{"sentence":"The occurrence of stasimorphy can be influenced by environmental factors.","translation":"stasimorphyの発生は、環境要因によって影響を受ける可能性があります。"}],"collocations":["floral stasimorphy","experimental stasimorphy"],"synonyms":["pistillation","carpellody"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'stasis' (standing, state) + 'morph' (form) + '-y' (suffix denoting a condition or process).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsteɪsɪˈmɔːrfi/","syllables":"sta-si-mor-phy"},"inflection":{"noun_plural":"stasimorphies"},"usage_notes":{"explanation":"Stasimorphy is a relatively uncommon term used specifically in the field of botany to describe the transformation of stamens into pistils. It is a type of floral abnormality or modification.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The stasimorphy caused the plant to die.","correct":"✓ The stasimorphy altered the plant's reproductive structure.","note":"Stasimorphy itself doesn't necessarily cause death, but it changes the reproductive structure. "},{"incorrect":"✗ Stasimorphy is the same as petalody.","correct":"✓ Stasimorphy is the transformation of stamens into pistils, while petalody is the transformation of other floral parts into petals.","note":"Stasimorphy specifically involves stamens and pistils, while petalody involves other floral parts."}],"priority":"★★☆"},"related_words":{"derivatives":["stasimorphic (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Specialized vocabulary)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Stasimorphy' is a highly specialized botanical term. Understanding requires familiarity with floral morphology and developmental biology. It describes a specific type of alteration in floral structure, where stamens, the male reproductive organs, transform into pistils, the female reproductive organs. This term is rarely used outside of academic or research contexts in botany."},"example_sentences":[{"sentence":"Researchers observed stasimorphy in several specimens of the mutant plant.","translation":"研究者らは、その突然変異植物のいくつかの標本において、stasimorphyを観察しました。","type":"scientific observation","meaning_category":"botany"},{"sentence":"The degree of stasimorphy varied among the different experimental groups.","translation":"stasimorphyの程度は、異なる実験グループ間で異なっていました。","type":"experimental result","meaning_category":"botany"}]}