{"word":"whats-her-name","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(軽蔑的または忘れてしまったときに使う)誰だっけ、名前が出てこないあの女","english_definition":"used to refer to a woman whose name you do not know or have forgotten, often used in a dismissive or contemptuous way.","examples":[{"sentence":"I ran into whats-her-name from accounting the other day.","translation":"先日、経理部の誰だっけ、あの女にばったり会ったよ。"},{"sentence":"Whats-her-name, the one with the red hair, is getting married.","translation":"誰だっけ、あの赤毛の女が結婚するんだ。"},{"sentence":"Oh, you know, whats-her-name, the actress who was in that movie.","translation":"ああ、ほら、誰だっけ、あの映画に出てた女優。"}],"collocations":["used dismissively","used when you can't remember a name","often used with 'thingy' or 'whatsit' for objects"],"synonyms":["whatsit","thingy","what-do-you-call-her","so-and-so","whatchamacallit (for objects)"],"antonyms":[]},{"part_of_speech":"noun","definition":"(軽蔑的または忘れてしまったときに使う)どうでもいい女、取るに足らない女","english_definition":"a woman who is considered unimportant or insignificant.","examples":[{"sentence":"He left his wife for some whats-her-name he met at a bar.","translation":"彼は妻を捨てて、バーで知り合ったどうでもいい女と一緒になった。"},{"sentence":"Don't worry about whats-her-name; she's not worth your time.","translation":"どうでもいい女のことは気にするな。君の時間を費やす価値はない。"}],"collocations":["used dismissively","implies the woman is unimportant"],"synonyms":["nobody","nonentity","inconsequential woman"],"antonyms":[]}],"etymology":{"value":"A blend of 'what' + 'is' + 'her' + 'name'. The phrase is used when the speaker either doesn't know or can't recall the name of the person they are referring to. The construction follows a pattern similar to 'whatsit' or 'whatchamacallit'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌwʌts hɜːr ˈneɪm/","syllables":"whats-her-name"},"inflection":{"notes":"This is a noun and does not inflect."},"usage_notes":{"explanation":"'Whats-her-name' is a colloquial expression used to refer to a woman whose name is unknown or forgotten. It is often used in a dismissive or contemptuous way, implying that the woman is not important enough to be remembered. The male equivalent is 'what's-his-name'. It is important to be mindful of the tone and context in which this phrase is used, as it can be considered rude or offensive.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw whats-her-name yesterday, you know, the doctor.","correct":"✓ I saw whats-her-name yesterday, you know, the doctor.","note":"The phrase is already a single unit, so there is no need to add extra words to it."},{"incorrect":"✗ He is dating whats-her-name.","correct":"✓ He is dating whats-her-name.","note":"The phrase is used as a single word, so it should be written as 'whats-her-name' with a hyphen."}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"related_terms":["what's-his-name (male equivalent)","whatsit","thingy","whatchamacallit"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but recognizable.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Whats-her-name' is used when you can't remember a woman's name or don't think she's important. It's informal and can sound rude, so be careful when you use it. The male version is 'what's-his-name'. It's like saying 'that woman I can't remember'. It's not something you'd use in formal situations."},"example_sentences":[{"sentence":"I saw whats-her-name at the grocery store yesterday.","translation":"昨日、スーパーで誰だっけ、あの女を見かけたよ。","type":"noun","meaning_category":"unnamed woman"},{"sentence":"He's going out with whats-her-name from the office.","translation":"彼は会社の誰だっけ、あの女と付き合ってるんだ。","type":"noun","meaning_category":"unnamed woman"},{"sentence":"Whats-her-name, the one who always wears purple, is retiring.","translation":"誰だっけ、いつも紫色の服を着てるあの女が退職するんだ。","type":"noun","meaning_category":"unnamed woman"}]}