{"word":"unperfectiveness","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"The state or quality of not being perfective; specifically, in linguistics, the aspect of a verb that does not represent an action as a completed whole, but rather as ongoing, habitual, or iterative.","english_definition":"The state or quality of not being perfective; the aspect of a verb that does not represent an action as a completed whole.","examples":[{"sentence":"The unperfectiveness of the verb form indicated that the action was ongoing.","translation":"その動詞の形の未完了相は、動作が進行中であることを示していた。"},{"sentence":"Unperfectiveness is a key feature in many Slavic languages.","translation":"未完了相は多くのスラブ語派の言語における重要な特徴である。"}],"collocations":["aspectual unperfectiveness","verbal unperfectiveness"],"synonyms":["imperfectivity","non-perfectiveness"],"antonyms":["perfectiveness","perfectivity"]}],"etymology":{"value":"Formed from \"un-\" (not) + \"perfective\" + \"-ness\" (state or quality).","priority":"Medium"},"pronunciation":{"ipa":"/ˌʌnpərˈfɛktɪvnəs/","syllables":"un-per-fec-tive-ness"},"inflection":{"noun_plural":"unperfectivenesses"},"usage_notes":{"explanation":"'Unperfectiveness' is primarily a term used in linguistics, specifically in the study of aspect. It refers to the aspect of a verb that portrays an action as incomplete, ongoing, habitual, repeated, or lacking a defined endpoint. It is the opposite of 'perfectiveness,' which presents an action as a completed whole.","priority":"High"},"common_mistakes":{"examples":[{"incorrect":"The unperfectiveness made the sentence unclear.","correct":"The unperfective aspect made the sentence unclear.","note":"Use 'unperfective aspect' rather than just 'unperfectiveness' to clearly indicate you're referring to the linguistic concept."}],"priority":"Medium"},"related_words":{"derivatives":["unperfective (adjective)"],"phrasal_verbs":[],"related_terms":["aspect","perfective","imperfective","verb aspect"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"Low"},"readability_explanation":{"level":"C2","text":"'Unperfectiveness' is a technical term primarily used in the field of linguistics, specifically when discussing verb aspects. It describes the characteristic of a verb form that presents an action as ongoing, habitual, or without a defined endpoint, rather than as a completed whole. Understanding this term requires familiarity with linguistic concepts related to verb aspect and grammatical analysis."},"example_sentences":[{"sentence":"The use of the past continuous tense often implies unperfectiveness.","translation":"過去進行形の用法はしばしば未完了相を意味する。","type":"linguistics","meaning_category":"aspect"},{"sentence":"In some languages, unperfectiveness is marked morphologically on the verb.","translation":"いくつかの言語では、未完了相は動詞に形態的に標示される。","type":"linguistics","meaning_category":"aspect"}]}