{"word":"mesnalties","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(歴史) 中間領主権、中間領主の地位","english_definition":"(historical) The rights and status of a mesne lord; the position of being a mesne lord.","examples":[{"sentence":"The mesnalties were often a source of conflict between the crown and the tenants in chief.","translation":"中間領主権は、しばしば王室と直臣との間の紛争の源であった。"}],"collocations":["hold mesnalties","exercise mesnalties"],"synonyms":["intermediate lordship","tenancy in chief"],"antonyms":["demesne","fee simple"]}],"etymology":{"value":"Derived from 'mesne', meaning intermediate or intervening, referring to the position of the lord in the feudal hierarchy between the tenant in chief and the actual tenant.","priority":"★★★"},"pronunciation":{"ipa":"/ˈmiːzənəltiz/","syllables":"me-sna-l-ties"},"inflection":{"noun_plural":"mesnalties"},"usage_notes":{"explanation":"'Mesnalties' refers specifically to the rights, duties, and status associated with being a mesne lord in the feudal system. It is a historical term and not commonly used in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He inherited the mesnalties to the kingdom.","correct":"✓ He inherited the mesnalties of the manor.","note":"Mesnalties are associated with manors or fiefs, not entire kingdoms."}],"priority":"★★☆"},"related_words":{"derivatives":["mesne (adjective/noun): intermediate, intervening; a mesne lord"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Mesnalties' is a highly specialized historical term related to feudalism. Understanding requires knowledge of the feudal system and its hierarchy. It's rarely encountered outside of academic or historical contexts."},"example_sentences":[{"sentence":"The records detailed the various mesnalties associated with the manor.","translation":"記録には、荘園に関連するさまざまな中間領主権が詳細に記載されていた。","type":"noun","meaning_category":"中間領主権"},{"sentence":"Disputes over mesnalties often led to legal battles in medieval England.","translation":"中間領主権をめぐる紛争は、中世イングランドでしばしば法廷闘争につながった。","type":"noun","meaning_category":"中間領主の地位"}]}