{"word":"metalcraft","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"金属工芸、金属加工","english_definition":"the activity or skill of making things out of metal","examples":[{"sentence":"She is skilled in metalcraft, creating beautiful jewelry and sculptures.","translation":"彼女は金属工芸に長けており、美しいジュエリーや彫刻を制作しています。"},{"sentence":"The museum features a collection of ancient metalcraft from various cultures.","translation":"その博物館には、様々な文化の古代金属工芸品のコレクションが展示されています。"},{"sentence":"He learned the art of metalcraft from his grandfather, who was a blacksmith.","translation":"彼は祖父から金属工芸の技術を学びました。祖父は鍛冶屋でした。"}],"collocations":["practice metalcraft","learn metalcraft","metalcraft techniques","metalcraft workshop","metalcraft artist","metalcraft design"],"synonyms":["metalworking","smithing","metal art","art metal"],"antonyms":[]}],"etymology":{"value":"'Metal' + 'craft'. The term combines the material (metal) with the skill or art of making things (craft).","priority":"★★★"},"pronunciation":{"ipa":"/ˈmɛtəlˌkræft/","syllables":"met-al-craft"},"inflection":{"noun_plural":"metalcrafts"},"usage_notes":{"explanation":"'Metalcraft' refers to the general skill and practice of working with metal to create decorative or functional objects. It can encompass a wide range of techniques, including forging, casting, welding, and engraving. It is often used to describe both traditional and contemporary forms of metal art.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He is doing a metal craft.","correct":"He is practicing metalcraft.","note":"'Metalcraft' is often used as an uncountable noun to refer to the general practice.  Using 'a metal craft' is possible, but less common, and would refer to a specific item made through metalcraft."},{"incorrect":"Metal craft is easy.","correct":"Metalcraft is challenging.","note":"This is a subjective statement, but it highlights that metalcraft requires skill and practice, and is not typically considered easy."}],"priority":"★★☆"},"related_words":{"derivatives":["metalcrafting (noun: the process of metalcraft)","metalcrafter (noun: a person who practices metalcraft)"],"phrasal_verbs":[],"related_terms":["silversmithing (銀細工)","goldsmithing (金細工)","blacksmithing (鍛冶)","jewelry making (ジュエリー制作)","sculpture (彫刻)"],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"B2","text":"The word 'metalcraft' is a compound noun that combines 'metal' and 'craft'. It refers to the skill and practice of creating objects from metal. While the individual words are common, the compound word 'metalcraft' is less frequently used and more specialized, typically appearing in contexts related to art, design, or historical artifacts."},"example_sentences":[{"sentence":"The local community college offers courses in various forms of metalcraft.","translation":"地元のコミュニティカレッジでは、様々な形態の金属工芸のコースを提供しています。","type":"general","meaning_category":"general"},{"sentence":"Her metalcraft pieces are inspired by nature and often feature intricate floral designs.","translation":"彼女の金属工芸作品は自然からインスピレーションを得ており、複雑な花の模様が特徴です。","type":"artistic","meaning_category":"artistic"},{"sentence":"Ancient civilizations used metalcraft to create weapons, tools, and decorative objects.","translation":"古代文明は金属工芸を使って、武器、道具、装飾品を作りました。","type":"historical","meaning_category":"historical"}]}