{"word":"Frosthart","priority":"N/A","meanings":[{"part_of_speech":"proper noun","definition":"A fictional name, potentially a surname or place name, evoking cold or winter themes.","english_definition":"A fictional name, likely a surname or place name, suggesting coldness, winter, or ice.","examples":[{"sentence":"The Frosthart family was known for their resilience in the harsh winter.","translation":"フロストハート家は、厳しい冬における彼らの回復力で知られていました。"},{"sentence":"Frosthart Peak was the highest mountain in the range.","translation":"フロストハート山は、その山脈で最も高い山でした。"}],"collocations":["Frosthart family","Frosthart Peak","Lord Frosthart","Lady Frosthart"],"synonyms":["Winterfell","Icewind","Coldharbour"],"antonyms":["Sunhaven","Summerisle","Warmglen"]}],"etymology":{"value":"A combination of 'frost' (referring to ice or cold temperatures) and 'hart' (an archaic word for a male deer, or symbolically, the heart). The combination suggests a cold or resilient heart, or a place associated with cold and deer.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfrɒstˌhɑːrt/","syllables":"Frost-hart"},"inflection":{},"usage_notes":{"explanation":"'Frosthart' is a constructed name, often used in fantasy literature, games, or other fictional settings. It carries connotations of cold, resilience, and possibly nobility or a connection to nature. Its meaning is largely symbolic and evocative, rather than literal.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"'Frosthart' is not a real word found in common usage. It is a constructed term, most likely encountered in fictional contexts. Understanding its meaning relies on recognizing the component words 'frost' and 'hart' and interpreting their combined symbolic significance. The name is designed to evoke a specific atmosphere and set of associations.","priority":"★★☆"},"example_sentences":[{"sentence":"Lord Frosthart ruled the northern territories with an iron fist.","translation":"フロストハート卿は鉄拳で北部領土を支配した。","type":"example","meaning_category":"Fictional Character"},{"sentence":"The legend of Frosthart Keep spoke of ancient magic and forgotten kings.","translation":"フロストハート要塞の伝説は、古代の魔法と忘れられた王たちについて語っていた。","type":"example","meaning_category":"Fictional Location"}]}