{"word":"non-architectural","priority":"low","meanings":[{"part_of_speech":"adjective","definition":"建築的でない、建築に関係のない","english_definition":"Not relating to or characteristic of architecture.","examples":[{"sentence":"The book covers non-architectural aspects of urban planning, such as social and economic factors.","translation":"その本は、都市計画の建築的でない側面、例えば社会的および経済的要因を扱っています。"},{"sentence":"The software is designed for non-architectural users who need to visualize data.","translation":"そのソフトウェアは、データを視覚化する必要がある建築関係者以外のユーザー向けに設計されています。"}],"collocations":["non-architectural design","non-architectural elements","non-architectural features","non-architectural applications"],"synonyms":["unrelated to architecture","not architectural","exterior"],"antonyms":["architectural"],"related_words":["architecture","architect","architecturally"]}],"etymology":{"value":"Prefix 'non-' (not) + 'architectural' (relating to architecture).","priority":"low"},"pronunciation":{"ipa":"/ˌnɒnˌɑːrkɪˈtektʃərəl/","syllables":"non-ar-chi-tec-tur-al"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"'Non-architectural' is typically used to describe something that is outside the scope of architecture, or that does not possess the characteristics or qualities typically associated with architecture. It is often used to distinguish between elements that are and are not part of a building's design or construction.","priority":"medium"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The word 'non-architectural' is formed by adding the prefix 'non-' to 'architectural', indicating negation. It's used to describe something that is not related to architecture. This term is more common in technical or academic contexts when discussing aspects outside of architectural design or construction."},"example_sentences":[{"sentence":"The project included non-architectural landscaping to enhance the building's surroundings.","translation":"そのプロジェクトには、建物の周辺環境を向上させるための建築的でない景観設計が含まれていました。","type":"example","meaning_category":"general"},{"sentence":"The discussion focused on the non-architectural challenges of implementing the new technology.","translation":"議論は、新しい技術を導入する際の建築的でない課題に焦点を当てました。","type":"example","meaning_category":"challenges"}]}