{"word":"Ectomorphy","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"外胚葉型（がいはいようがた）: 体型分類の一つで、細身で筋肉や脂肪がつきにくい体質","english_definition":"A somatotype characterized by linearity, fragility, and maximum surface area per unit of mass; typically tall, thin, and lightly muscled.","examples":[{"sentence":"His ectomorphy made it difficult for him to gain weight and muscle.","translation":"彼の外胚葉型体質は、体重や筋肉を増やすのを難しくした。"},{"sentence":"Ectomorphy is often associated with endurance sports.","translation":"外胚葉型はしばしば持久力スポーツと関連付けられる。"}],"collocations":["pure ectomorphy (純粋な外胚葉型)","high ectomorphy (高い外胚葉型)","somatotype component (体型要素)"],"synonyms":["thinness","linearity","slenderness"],"antonyms":["endomorphy","mesomorphy"]}],"etymology":{"value":"Derived from the Greek words 'ecto' (outer, external) + 'morph' (form, shape) + '-y' (a suffix denoting a state or condition). It refers to the predominance of tissues derived from the embryonic ectoderm.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛktoʊˈmɔːrfi/","syllables":"ek-to-mor-phy"},"inflection":{"noun_plural":"ectomorphies"},"usage_notes":{"explanation":"Ectomorphy is one of the three somatotypes (body types) identified by William Herbert Sheldon in the 1940s. The other two are endomorphy (characterized by roundness and a tendency to gain fat) and mesomorphy (characterized by muscularity). Individuals are rarely purely one somatotype; most people are a combination of the three, with one or two being dominant. Ectomorphy is associated with a fast metabolism, making it difficult to gain weight, whether muscle or fat.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has ectomorph.","correct":"✓ He has ectomorphy.","note":"'Ectomorphy' is the noun form referring to the body type. 'Ectomorph' is the noun referring to a person with ectomorphic characteristics."},{"incorrect":"✗ Ectomorphy people are strong.","correct":"✓ Ectomorphic people are often slender.","note":"Ectomorphy describes a body type characterized by slenderness, not necessarily strength. Strength depends on muscle development, which can vary."}],"priority":"★★☆"},"related_words":{"derivatives":["ectomorph (noun: a person with an ectomorphic body type)","ectomorphic (adjective: relating to or having the characteristics of an ectomorph)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in the context of fitness, bodybuilding, and sports science.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ectomorphy' is a specialized term used in the field of somatotyping, which is a system for classifying body types. It describes a body characterized by being thin, linear, and having difficulty gaining weight. It's not a commonly used word in everyday conversation, but it is relevant in discussions about fitness, nutrition, and body composition. Understanding this term requires some background knowledge of human anatomy and physiology."},"example_sentences":[{"sentence":"Due to his high degree of ectomorphy, he struggled to put on muscle mass despite intense training.","translation":"彼の高い外胚葉型体質のために、彼は集中的なトレーニングにもかかわらず筋肉量を増やすのに苦労した。","type":"noun","meaning_category":"体型分類"},{"sentence":"The runner's ectomorphy gave him an advantage in long-distance races.","translation":"そのランナーの外胚葉型体質は、長距離レースで彼に有利に働いた。","type":"noun","meaning_category":"体型分類"},{"sentence":"Understanding somatotypes like ectomorphy can help tailor fitness and nutrition plans.","translation":"外胚葉型のような体型を理解することは、フィットネスや栄養プランを調整するのに役立つ。","type":"noun","meaning_category":"体型分類"}]}