{"word":"cataractwise","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"白内障の、または白内障のような方法で","english_definition":"In a manner resembling or relating to cataracts (the eye condition).","examples":[{"sentence":"The light filtered through the dusty window, refracting cataractwise across the room.","translation":"光はほこりっぽい窓を通り抜け、白内障のように屈折して部屋中に広がった。"},{"sentence":"Looking through the old, scratched lens, the world appeared distorted, almost cataractwise.","translation":"古くて傷ついたレンズを通して見ると、世界は歪んで見え、ほとんど白内障のようだった。"}],"collocations":["filter cataractwise","appear cataractwise"],"synonyms":["opaquely","dimly","blurredly"],"antonyms":["clearly","distinctly"]}],"etymology":{"value":"'cataract' (白内障) + '-wise' (～のように)","priority":"★★★"},"pronunciation":{"ipa":"/ˌkætəˈræktwaɪz/","syllables":"cat-a-ract-wise"},"inflection":{"notes":"This word does not inflect."},"usage_notes":{"explanation":"This word is quite rare and is primarily used in descriptive contexts to evoke the visual distortion or opacity associated with cataracts. It is often used metaphorically.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The river flowed cataractwise over the rocks.","correct":"✓ The river flowed in a cataract over the rocks.","note":"'cataractwise' refers to the quality of vision, not the physical phenomenon of a waterfall (which is also called a cataract)."},{"incorrect":"✗ He looked at the world cataractwise because he was sad.","correct":"✓ He looked at the world dimly because he was sad.","note":"'cataractwise' describes a visual condition, not an emotional state. Use other adverbs like 'dimly' or 'blearily' to describe sadness."}],"priority":"★★☆"},"related_words":{"derivatives":["cataract (noun): 白内障"],"phrases":["cataract surgery (白内障手術)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Extremely rare.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'cataractwise' is a rare and specialized term. It is used to describe something that resembles or is related to cataracts, a medical condition affecting the eye. Due to its infrequent use and specific context, it is considered an advanced vocabulary word. Understanding the base word 'cataract' is essential for comprehending 'cataractwise'."},"example_sentences":[{"sentence":"The fog rolled in, making the streetlights glow cataractwise.","translation":"霧が立ち込め、街灯が白内障のように光った。","type":"adverb","meaning_category":"白内障のように"},{"sentence":"Her vision was becoming increasingly cataractwise as the disease progressed.","translation":"病気が進行するにつれて、彼女の視力はますます白内障のようになっていった。","type":"adverb","meaning_category":"白内障のように"}]}