{"word":"percarbonate","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"過炭酸塩","english_definition":"A chemical compound with the formula Na₂H₃CO₆, an adduct of sodium carbonate and hydrogen peroxide. When dissolved in water, it releases hydrogen peroxide. It is used as a bleaching agent, cleaning agent, and disinfectant.","examples":[{"sentence":"Percarbonate is an environmentally friendly bleaching agent.","translation":"過炭酸塩は環境に優しい漂白剤です。"},{"sentence":"I use percarbonate to clean my washing machine.","translation":"私は洗濯槽の掃除に過炭酸塩を使っています。"}],"collocations":["sodium percarbonate","oxygen bleach","percarbonate cleaner"],"synonyms":["sodium percarbonate","oxygen bleach"],"antonyms":[]}],"etymology":{"value":"From 'per-' (intensive prefix) + 'carbonate'.","priority":"★★★"},"pronunciation":{"ipa":"/pərˈkɑːrbənət/","syllables":"per-car-bo-nate"},"inflection":{"noun_plural":"percarbonates"},"usage_notes":{"explanation":"Percarbonate is commonly used as a safer alternative to chlorine bleach. It decomposes into sodium carbonate (washing soda) and hydrogen peroxide in water, making it relatively environmentally friendly. It's effective for stain removal, whitening, and disinfecting.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I added too much percarbonate and it fizzes too much.","correct":"✓ I added too much percarbonate and it fizzed too much.","note":"Percarbonate reacts with water, so use the past tense to describe the reaction that already happened."}],"priority":"★★☆"},"related_words":{"derivatives":["carbonate","hydrogen peroxide","sodium carbonate"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"Percarbonate is a chemical compound used as a cleaning and bleaching agent. It's known for being a more environmentally friendly alternative to chlorine bleach because it breaks down into sodium carbonate and hydrogen peroxide when dissolved in water. You'll often find it in laundry detergents and household cleaners.","priority":"★★★"},"example_sentences":[{"sentence":"The laundry detergent contains percarbonate for effective stain removal.","translation":"その洗濯洗剤には、効果的な染み抜きのために過炭酸塩が含まれています。","type":"noun","meaning_category":"cleaning agent"},{"sentence":"Percarbonate is often used to clean decks and patios.","translation":"過炭酸塩は、デッキやパティオの掃除によく使用されます。","type":"noun","meaning_category":"cleaning agent"},{"sentence":"Soaking the stained clothes in a percarbonate solution can help to lift the stains.","translation":"汚れた衣類を過炭酸塩溶液に浸すと、汚れを浮き上がらせるのに役立ちます。","type":"noun","meaning_category":"cleaning agent"}]}