{"word":"Periboli","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Greek: Περιβόλι) A village in Corfu, Greece.","english_definition":"A village in the northwestern part of the island of Corfu, Greece.","examples":[{"sentence":"We spent a lovely afternoon in Periboli, exploring the local shops and enjoying the beautiful scenery.","translation":"私たちはペリボリで素敵な午後を過ごし、地元の店を探索したり、美しい景色を楽しんだりしました。"}],"collocations":["visit Periboli","explore Periboli","Periboli village"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Periboli' likely comes from the Greek word 'perivoli' (περιβόλι), meaning 'orchard' or 'garden'. This suggests the area was historically known for its fertile land and agricultural production.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɛrɪˈvoʊli/","syllables":"Pe-ri-bo-li"},"inflection":{"notes":"Proper noun, does not have plural form."},"usage_notes":{"explanation":"'Periboli' refers specifically to the village located on Corfu. When discussing travel or geography, it is important to specify that you are referring to the Corfu location to avoid confusion with other places that might have similar names.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I am going to Periboli in Italy.","correct":"✓ I am going to Periboli in Corfu, Greece.","note":"Specify that Periboli is in Corfu, Greece."}],"priority":"★☆☆"},"related_words":{"derivatives":["Perivolia (similar place names in Greece)"],"related_places":["Corfu (island)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Periboli' is a specific place name, referring to a village in Corfu, Greece. It is not a common word, so understanding its context requires knowledge of Greek geography. The etymology suggests the area was historically known for orchards or gardens, which provides some insight into the region's past. Using this word correctly requires specifying its location to avoid confusion.","priority":"★☆☆"},"example_sentences":[{"sentence":"The church in Periboli is a beautiful example of traditional Corfiot architecture.","translation":"ペリボリの教会は、伝統的なコルフ建築の美しい例です。","type":"general","meaning_category":"location"},{"sentence":"Many tourists enjoy hiking through the olive groves surrounding Periboli.","translation":"多くの観光客がペリボリ周辺のオリーブ畑をハイキングして楽しんでいます。","type":"travel","meaning_category":"location"}]}