{"word":"coreceiver","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"共同受信機、共同受信者","english_definition":"A person or entity that jointly receives something with others; a receiver that shares the reception with other receivers.","examples":[{"sentence":"The grant was awarded to the university with the hospital as a coreceiver.","translation":"その助成金は大学に授与され、病院が共同受信者となった。"},{"sentence":"In a multicast system, multiple devices act as coreceivers of the data stream.","translation":"マルチキャストシステムでは、複数のデバイスがデータストリームの共同受信機として機能する。"}],"collocations":["act as coreceiver","designated coreceiver","primary receiver and coreceiver"],"synonyms":["joint receiver","co-recipient"],"antonyms":["sole receiver","single receiver"]},{"part_of_speech":"noun","definition":"（電気通信）共同受信装置","english_definition":"(Telecommunications) A receiving device that is part of a system where multiple devices receive the same signal.","examples":[{"sentence":"The coreceiver in the wireless sensor network ensures redundancy in data collection.","translation":"ワイヤレスセンサーネットワークにおける共同受信装置は、データ収集の冗長性を保証する。"}],"collocations":["wireless coreceiver","network coreceiver","redundant coreceiver"],"synonyms":["shared receiver","distributed receiver"],"antonyms":["dedicated receiver","isolated receiver"]}],"etymology":{"value":"The word is formed by combining \"co-\" (meaning 'jointly' or 'together') with \"receiver\".","priority":"★★☆"},"pronunciation":{"ipa":"/ˌkoʊ.rɪˈsiːvər/","syllables":"co-re-ceiv-er"},"inflection":{"noun_plural":"coreceivers"},"usage_notes":{"explanation":"The term \"coreceiver\" is often used in contexts where multiple entities or devices are designed to receive the same information or signal. It emphasizes the shared nature of the reception. In business or legal contexts, it can refer to multiple recipients of a grant, award, or other benefit. In telecommunications, it refers to a receiver that operates as part of a distributed or redundant system.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The coreceiver was only one person.","correct":"✓ There was only one coreceiver.","note":"The term implies there are multiple receivers, so saying \"the coreceiver\" when referring to a single entity can be misleading. It's better to clarify that there is only one coreceiver in that specific situation."}],"priority":"★☆☆"},"related_words":{"derivatives":["co-receive (verb)"],"related_terms":["receiver","transmitter","transceiver","multicast","broadcast"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"coreceiver\" is a technical term used in specific fields such as telecommunications and business. It refers to an entity or device that shares the reception of something with others. Understanding this term requires familiarity with concepts like joint ownership, distributed systems, and redundancy. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The two companies were named as coreceivers of the innovation award.","translation":"その2社は、イノベーション賞の共同受賞者として指名された。","type":"noun","meaning_category":"共同受信者"},{"sentence":"The distributed antenna system uses multiple coreceivers to improve signal strength.","translation":"分散アンテナシステムは、信号強度を向上させるために複数の共同受信機を使用する。","type":"noun","meaning_category":"共同受信機"}]}