{"word":"pedelion","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Archaic) A type of small, light boat or skiff.","english_definition":"An archaic term for a small, light boat or skiff, often used for pleasure or fishing.","examples":[{"sentence":"The fisherman rowed his pedelion along the calm river.","translation":"漁師は穏やかな川をペデリオンで漕いで行った。"},{"sentence":"In olden times, pedelions were common on the lake.","translation":"昔、ペデリオンは湖でよく見られた。"}],"collocations":["row a pedelion","small pedelion","light pedelion"],"synonyms":["skiff","rowboat","dinghy","small boat"],"antonyms":[]}],"etymology":{"value":"The etymology of 'pedelion' is uncertain, but it is likely derived from a regional or dialectal term for a small boat. It is not a commonly used word, and its origins are obscure.","priority":"★☆☆"},"pronunciation":{"ipa":"/pɪˈdiːliən/","syllables":"pe-de-li-on"},"inflection":{"noun_plural":"pedelions"},"usage_notes":{"explanation":"'Pedelion' is an archaic and rarely used word. It is primarily found in older literature or historical contexts when referring to a small boat. It is not part of modern, common vocabulary.","priority":"★☆☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely rare","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Pedelion' is a very rare and archaic word, primarily found in older literature. It refers to a small, light boat. Due to its rarity, it is unlikely to be encountered in everyday language. Understanding this word is useful only for interpreting specific historical or literary texts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The artist painted a serene scene of a pedelion drifting on the lake.","translation":"画家は湖に漂うペデリオンの穏やかな風景を描いた。","type":"noun","meaning_category":"small boat"},{"sentence":"He remembered his grandfather telling stories of fishing from a pedelion.","translation":"彼は祖父がペデリオンから釣りをした話を語っていたのを思い出した。","type":"noun","meaning_category":"small boat"}]}