{"word":"Sinocentrism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"中華思想、中国中心主義","english_definition":"The ethnocentric perspective that regards China as central or superior to other nations.","examples":[{"sentence":"Sinocentrism has historically influenced China's foreign policy.","translation":"中華思想は歴史的に中国の外交政策に影響を与えてきた。"},{"sentence":"Some scholars argue that elements of Sinocentrism still persist in modern Chinese nationalism.","translation":"一部の研究者は、中華思想の要素が現代中国のナショナリズムに依然として残っていると主張している。"}],"collocations":["cultural Sinocentrism (文化的な中華思想)","historical Sinocentrism (歴史的な中華思想)","political Sinocentrism (政治的な中華思想)","manifestations of Sinocentrism (中華思想の表れ)"],"synonyms":["China-centricity","Sino-supremacy"],"antonyms":["Eurocentrism","Multiculturalism","Globalism"]}],"etymology":{"value":"Derived from 'Sino-' (referring to China) and '-centrism' (the belief in the centrality of something).","priority":"★★★"},"pronunciation":{"ipa":"/ˌsaɪnoʊˈsɛntrɪzəm/","syllables":"Si-no-cen-trism"},"inflection":{"notes":"It's a noun, so it has no inflection."},"usage_notes":{"explanation":"Sinocentrism refers to the belief that China is the center of the world, culturally, politically, and economically. It often involves a hierarchical view of other nations, with China at the top. It's important to note that this term can be controversial, as some view it as a neutral historical concept, while others see it as a pejorative term used to criticize Chinese nationalism or foreign policy.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Sinocentrism person.","correct":"✓ He holds Sinocentric views.","note":"Sinocentrism is a concept or ideology, not a personal attribute. To describe a person, use 'Sinocentric' (adjective) or say they 'hold Sinocentric views'."},{"incorrect":"✗ Sinocentrism is good for China.","correct":"✓ The effects of Sinocentrism are debated.","note":"Whether Sinocentrism is 'good' or 'bad' is a subjective and complex issue. It's better to discuss its effects or manifestations objectively."}],"priority":"★★☆"},"related_words":{"derivatives":["Sinocentric (adjective)"],"phrases":["Tributary system (朝貢体制)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in academic or political discussions.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"'Sinocentrism' is a term used in history, political science, and cultural studies to describe the belief that China is the central and most important country in the world. It's often discussed in the context of China's historical relationships with other countries, particularly in East Asia. Understanding this term requires some knowledge of history and political theory."},"example_sentences":[{"sentence":"The tributary system was a key expression of Sinocentrism in East Asia.","translation":"朝貢体制は、東アジアにおける中華思想の重要な表れであった。","type":"general","meaning_category":"historical context"},{"sentence":"Critics argue that some aspects of China's current foreign policy reflect a form of Sinocentrism.","translation":"批判者たちは、中国の現在の外交政策のいくつかの側面が中華思想の一形態を反映していると主張している。","type":"general","meaning_category":"modern context"}]}