{"word":"world-swallowing","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"世界を飲み込むような、非常に巨大な、圧倒的な","english_definition":"So immense or all-encompassing as to seem to consume or engulf the entire world.","examples":[{"sentence":"The company's ambition was world-swallowing, aiming to dominate every market.","translation":"その会社の野望は世界を飲み込むほどで、あらゆる市場を支配することを目指していた。"},{"sentence":"The crisis felt world-swallowing, threatening to destabilize the global economy.","translation":"その危機は世界を飲み込むように感じられ、世界経済を不安定化させる恐れがあった。"},{"sentence":"The artist created a world-swallowing installation that filled the entire museum.","translation":"そのアーティストは美術館全体を埋め尽くす、世界を飲み込むようなインスタレーションを制作した。"}],"collocations":["world-swallowing ambition","world-swallowing crisis","world-swallowing power","world-swallowing empire","world-swallowing scale"],"synonyms":["all-encompassing","global","universal","immense","vast","colossal","gigantic","earth-shattering","overwhelming"],"antonyms":["limited","local","regional","small","insignificant"]}],"etymology":{"value":"'World' + 'swallowing'. A metaphorical term combining the concept of the world with the action of swallowing, suggesting something of immense scale or impact.","priority":"★★★"},"pronunciation":{"ipa":"/ˈwɜːldˌswɒləʊɪŋ/","syllables":"world-swal-low-ing"},"inflection":{"notes":"Adjective, no comparative or superlative forms."},"usage_notes":{"explanation":"'World-swallowing' is a figurative adjective used to describe something extremely large, powerful, or impactful, as if it could consume or engulf the entire world. It is often used to emphasize the scale or intensity of something, such as an ambition, crisis, or empire. The term evokes a sense of vastness and overwhelming power.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The world-swallowing is very dangerous.","correct":"✓ The world-swallowing crisis is very dangerous.","note":"'World-swallowing' is an adjective and must be used to modify a noun. It cannot stand alone as a noun."},{"incorrect":"✗ He has a world swallowing ambition.","correct":"✓ He has a world-swallowing ambition.","note":"The adjective is a compound adjective and should be hyphenated."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_adjectives":["all-consuming","earth-shattering","overwhelming","immense","vast"],"related_nouns":["ambition","crisis","power","empire","scale"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'World-swallowing' is a high-level adjective used to describe something extremely large or impactful, as if it could consume the entire world. It is a figurative term used to emphasize the scale or intensity of something, such as an ambition or crisis. This word is not commonly used in everyday conversation and is more likely to appear in formal writing or literature.","priority":"★★☆"},"example_sentences":[{"sentence":"The dictator's world-swallowing ego led to the destruction of his country.","translation":"その独裁者の世界を飲み込むようなエゴが、自国の破滅につながった。","type":"general","meaning_category":"general"},{"sentence":"The corporation had world-swallowing reach, with offices in every major city.","translation":"その企業は世界を飲み込むような影響力を持ち、すべての主要都市にオフィスを構えていた。","type":"general","meaning_category":"general"},{"sentence":"The artist's vision was of a world-swallowing utopia, where everyone lived in harmony.","translation":"そのアーティストのビジョンは、誰もが調和して暮らす、世界を飲み込むようなユートピアだった。","type":"general","meaning_category":"general"}]}