{"word":"staffstriker","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A person who is both a staff member and a striker (in the context of labor disputes or soccer).","english_definition":"An employee who is also participating in a strike; or, less commonly, a soccer player who is also a member of the team's staff.","examples":[{"sentence":"The union lauded the staffstriker for their dedication to the cause.","translation":"組合は、その目的への献身を理由に、ストライキに参加している職員を称賛した。"},{"sentence":"As a staffstriker, he faced a difficult decision between his job and his principles.","translation":"ストライキに参加している職員として、彼は仕事と自分の原則の間で難しい決断を迫られた。"},{"sentence":"The staffstriker scored the winning goal, proving his value both on and off the field.","translation":"スタッフストライカーは決勝点を決め、ピッチ内外での彼の価値を証明した。"}],"collocations":["union staffstriker","dedicated staffstriker","supporting staffstriker"],"synonyms":["striking worker","employee on strike"],"antonyms":["non-striking staff","replacement worker"]}],"etymology":{"value":"Combination of 'staff' (referring to employees) and 'striker' (referring to someone on strike).","priority":"N/A"},"pronunciation":{"ipa":"/ˈstæfˌstraɪkər/","syllables":"staff-stri-ker"},"inflection":{"noun_plural":"staffstrikers"},"usage_notes":{"explanation":"The term 'staffstriker' is relatively uncommon and context-dependent. It is primarily used in discussions about labor disputes where employees are participating in a strike. The soccer-related meaning is very rare.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The staffstriker was happy to be working during the strike.","correct":"✓ The staffstriker was committed to the strike, even though it meant lost wages.","note":"Staffstrikers are participating in a strike, so they are unlikely to be happy to be working during the strike."}],"priority":"N/A"},"related_words":{"derivatives":["strike","staff","striker"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term 'staffstriker' combines 'staff' (employees) and 'striker' (someone on strike). It refers to an employee who is participating in a labor strike. The term is not commonly used and is specific to the context of labor disputes."},"example_sentences":[{"sentence":"The staffstriker picketed outside the factory gates.","translation":"ストライキに参加している職員は、工場の門の外でピケを張った。","type":"noun","meaning_category":"labor dispute"},{"sentence":"Several staffstrikers were interviewed by the local news.","translation":"数名のストライキに参加している職員が、地元のニュースのインタビューを受けた。","type":"noun","meaning_category":"labor dispute"}]}