{"word":"polyemic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"多義的な、多義性を持つ","english_definition":"Having multiple meanings; exhibiting polysemy.","examples":[{"sentence":"The word 'bank' is polyemic, as it can refer to a financial institution or the side of a river.","translation":"「bank」という単語は多義的で、金融機関または川岸を指すことがあります。"},{"sentence":"Polyemic words can sometimes cause confusion in communication.","translation":"多義的な単語は、コミュニケーションにおいて混乱を引き起こすことがあります。"}],"collocations":["polyemic word","polyemic term","polyemic nature"],"synonyms":["polysemous","multivalent","ambiguous"],"antonyms":["monosemic","univalent","univocal"]}],"etymology":{"value":"Derived from the Greek words 'poly' (meaning 'many') and 'semy' (meaning 'meaning' or 'sign').","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpɒliˈiːmɪk/","syllables":"po-ly-e-mic"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than with comparative and superlative forms (more polyemic, most polyemic)."},"usage_notes":{"explanation":"'Polyemic' describes words or phrases that have multiple related meanings. It is often used in linguistics and semantics to analyze how words evolve and acquire different senses over time. It is closely related to 'polysemy', which is the property of having multiple meanings.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The sentence was polyemic, making it hard to understand.","correct":"✓ The word used in the sentence was polyemic, making it hard to understand the sentence's intended meaning.","note":"Sentences are not typically described as 'polyemic'; rather, the words within them are. The polysemy of a word can contribute to the ambiguity of a sentence."}],"priority":"★☆☆"},"related_words":{"derivatives":["polysemy (noun: the existence of multiple meanings for a single word or phrase)","polyseme (noun: a single word or phrase with multiple meanings)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. A technical term used primarily in linguistics.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Polyemic' is a term used in linguistics to describe words that have multiple related meanings. It's like a word that can do more than one job, but all the jobs are connected in some way. For example, the word 'bright' can mean 'full of light' or 'intelligent'. Because it's a technical term, you'll mostly find it in academic writing or discussions about language."},"example_sentences":[{"sentence":"Linguists study how polyemic words develop their various meanings over time.","translation":"言語学者は、多義的な単語がどのようにしてさまざまな意味を発展させるかを研究しています。","type":"adjective","meaning_category":"多義的な"},{"sentence":"The polyemic nature of the term 'network' allows it to be used in both social and technological contexts.","translation":"「ネットワーク」という用語の多義的な性質により、社会的および技術的な文脈の両方で使用できます。","type":"adjective","meaning_category":"多義的な"}]}