{"word":"dimensionless","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"無次元の、次元を持たない","english_definition":"having no physical dimensions (such as length, mass, time, or electric charge).","examples":[{"sentence":"The Reynolds number is a dimensionless quantity used in fluid mechanics.","translation":"レイノルズ数は流体力学で使用される無次元量です。"},{"sentence":"A dimensionless number is often used to simplify complex equations.","translation":"無次元数は、複雑な方程式を単純化するためによく使用されます。"},{"sentence":"The angle in radians is a dimensionless quantity.","translation":"ラジアンで表される角度は無次元量です。"}],"collocations":["dimensionless quantity","dimensionless number","dimensionless parameter","dimensionless analysis"],"synonyms":["non-dimensional","dimension-free"],"antonyms":["dimensional"],"notes":"In physics and engineering, dimensionless quantities are often ratios of quantities with the same units, so the units cancel out.","related_terms":["dimension","unit","physical quantity","scaling"],"usage_examples":["The Froude number is a dimensionless number used to characterize the ratio of inertial forces to gravitational forces in fluid flow."],"common_mistakes":["Confusing dimensionless with unitless. Dimensionless quantities have no physical dimensions, but they may still have units (e.g., radians for angles)."],"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in technical contexts.","priority":"★☆☆"}}],"etymology":{"value":"Formed from 'dimension' + '-less'.","priority":"★☆☆"},"pronunciation":{"ipa":"/daɪˈmɛnʃənləs/","syllables":"di-men-sion-less"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"related_words":{"derivatives":["dimensionlessness (noun)"],"related_concepts":["Pi theorem","Buckingham Pi theorem"]},"readability_explanation":{"level":"C1","text":"The term 'dimensionless' is primarily used in technical fields like physics, engineering, and mathematics. It describes a quantity that does not have physical dimensions such as length, mass, time, or electric charge. Understanding this term requires a basic knowledge of physical units and dimensional analysis. It's often encountered in the context of dimensionless numbers, which are ratios of physical quantities that simplify complex equations by eliminating units."},"example_sentences":[{"sentence":"The drag coefficient is a **dimensionless** parameter that characterizes the resistance of an object in a fluid.","translation":"抗力係数は、流体中の物体の抵抗を特徴づける無次元パラメータです。","type":"adjective","meaning_category":"無次元の"},{"sentence":"Using **dimensionless** analysis, we can reduce the number of variables needed to describe the system.","translation":"無次元解析を使用することで、システムを記述するために必要な変数の数を減らすことができます。","type":"adjective","meaning_category":"無次元の"},{"sentence":"The Strouhal number is a **dimensionless** value used to describe oscillating flow mechanisms.","translation":"ストローハル数は、振動流のメカニズムを記述するために使用される無次元の値です。","type":"adjective","meaning_category":"無次元の"}]}