{"word":"Undevotion","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"不信心、不敬虔、不誠実、不熱心","english_definition":"Lack of devotion; lack of religious feeling or expression; lack of dedication or loyalty.","examples":[{"sentence":"His undevotion to the cause led to his eventual dismissal.","translation":"彼のその活動への不熱心さが、最終的な解雇につながった。"},{"sentence":"The sermon addressed the growing undevotion among the younger generation.","translation":"説教は、若い世代の間で広がる不信心について述べた。"},{"sentence":"Her undevotion to her husband was a source of constant conflict.","translation":"彼女の夫に対する不誠実さが、絶え間ない争いの原因だった。"}],"collocations":["lack of undevotion","show undevotion","growing undevotion","religious undevotion","marital undevotion"],"synonyms":["disloyalty","infidelity","apathy","irreverence","impiety","unfaithfulness","disaffection"],"antonyms":["devotion","loyalty","faithfulness","dedication","piety","reverence"]}],"etymology":{"value":"Formed from \"devotion\" with the prefix \"un-\" indicating negation or the opposite.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌʌndiˈvoʊʃən/","syllables":"un-de-vo-tion"},"inflection":{"noun_plural":"Undevotions (rarely used in plural)"},"usage_notes":{"explanation":"\"Undevotion\" is a relatively uncommon word that describes a lack of commitment, loyalty, or religious feeling. It is often used in formal or literary contexts. It can refer to a lack of religious piety, a lack of dedication to a cause, or a lack of faithfulness in a relationship. The word emphasizes the absence of positive qualities associated with devotion.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed undevotion to his job by always being on time.","correct":"✓ He showed undevotion to his job by always being late.","note":"Undevotion implies a lack of dedication, so lateness would be an example, not punctuality."},{"incorrect":"✗ The undevotion was very good.","correct":"✓ The devotion was very good.","note":"Undevotion is the opposite of devotion, so it cannot be 'good' if devotion is desired."}],"priority":"★★☆"},"related_words":{"derivatives":["devotion","devotional","devoted","undevoted"],"antonyms":["devotion","faith","loyalty","dedication","piety"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word \"undevotion\" is a relatively rare and abstract term, typically encountered in advanced or literary contexts. It describes the absence or lack of devotion, which itself is a concept requiring some level of abstract understanding. Due to its infrequent use and the nuanced understanding required, it is considered a C2 level word."},"example_sentences":[{"sentence":"The king's undevotion to his people led to widespread discontent.","translation":"王の民への不誠実さが、広範囲な不満につながった。","type":"noun","meaning_category":"lack of loyalty"},{"sentence":"The scholar noted the undevotion of the modern era to traditional values.","translation":"学者は、現代の伝統的価値観への不敬虔さに注目した。","type":"noun","meaning_category":"lack of religious feeling"},{"sentence":"Her undevotion was evident in her neglect of her duties.","translation":"彼女の不熱心さは、彼女の義務の怠慢に明らかだった。","type":"noun","meaning_category":"lack of dedication"}]}