{"word":"disfranchiser","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(人種差別的な)選挙権剥奪者、公民権剥奪者","english_definition":"A person or thing that disenfranchises; especially, someone who works to deprive a group of people (such as racial minorities) of the right to vote.","examples":[{"sentence":"The Jim Crow laws were designed to be disfranchisers, preventing African Americans from voting.","translation":"ジム・クロウ法は、アフリカ系アメリカ人の投票を妨げる、選挙権剥奪者となるように設計された。"},{"sentence":"He was a known disfranchiser, actively campaigning against voting rights for immigrants.","translation":"彼は移民の投票権に反対する運動を積極的に行っていた、知られた公民権剥奪者だった。"}],"collocations":["act as a disfranchiser","a historical disfranchiser","a modern disfranchiser"],"synonyms":["suppressor","oppressor","subverter of rights"],"antonyms":["enfranchiser","suffragist","defender of rights"]}],"etymology":{"value":"From 'disfranchise' (to deprive of the right to vote) + '-er' (agent noun suffix). 'Disfranchise' itself comes from 'dis-' (reversal) + 'franchise' (to grant the rights of citizenship, especially the right to vote), which ultimately derives from Old French 'franchir' (to free).","priority":"★★☆"},"pronunciation":{"ipa":"/dɪsˈfræntʃaɪzər/","syllables":"dis-fran-chiz-er"},"inflection":{"noun_plural":"disfranchisers"},"usage_notes":{"explanation":"'Disfranchiser' typically carries a negative connotation, referring to individuals or systems that unfairly or unjustly remove voting rights from a particular group. It is often associated with historical or contemporary efforts to suppress minority voting or restrict access to democracy.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The law was a disfranchisement.","correct":"✓ The law was a disfranchiser.","note":"'Disfranchisement' is the act of depriving someone of the right to vote, while 'disfranchiser' is the person or thing that does the depriving."},{"incorrect":"✗ He is a disfranchiser of wealth.","correct":"✓ He is an oppressor of the poor.","note":"'Disfranchiser' specifically refers to the deprivation of voting rights, not general oppression or economic inequality. Use a more appropriate term like 'oppressor' or 'exploiter' in other contexts."}],"priority":"★★☆"},"related_words":{"derivatives":["disfranchise (verb)","disfranchisement (noun)","enfranchise (verb)","enfranchisement (noun)","franchise (noun)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized vocabulary related to political science and history.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Disfranchiser' is a relatively uncommon term that refers to someone who actively works to prevent a group of people from exercising their right to vote. This word is often used in discussions about historical or contemporary efforts to suppress voting rights, particularly those targeting minority groups. Understanding the term requires a grasp of the concept of disenfranchisement and its implications for democratic participation."},"example_sentences":[{"sentence":"The senator was labeled a disfranchiser after supporting legislation that restricted early voting.","translation":"その上院議員は、期日前投票を制限する法律を支持した後、公民権剥奪者というレッテルを貼られた。","type":"noun","meaning_category":"公民権剥奪者"},{"sentence":"Historically, many Southern politicians acted as disfranchisers, implementing policies to prevent Black citizens from voting.","translation":"歴史的に、多くの南部政治家は公民権剥奪者として行動し、黒人市民の投票を妨げる政策を実施した。","type":"noun","meaning_category":"公民権剥奪者"},{"sentence":"The new voter ID law was criticized as a modern disfranchiser, disproportionately affecting low-income communities.","translation":"新しい有権者ID法は、低所得者層に不均衡な影響を与える現代の公民権剥奪者として批判された。","type":"noun","meaning_category":"公民権剥奪者"}]}