{"word":"success-related","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"成功に関連する、成功に関わる","english_definition":"connected with or relating to success","examples":[{"sentence":"The conference focused on success-related strategies for entrepreneurs.","translation":"その会議は、起業家向けの成功に関連する戦略に焦点を当てました。"},{"sentence":"He attributed his achievements to several success-related factors.","translation":"彼は自身の業績を、いくつかの成功に関わる要因に帰しました。"},{"sentence":"The book examines the psychological aspects of success-related stress.","translation":"その本は、成功に関わるストレスの心理的側面を検証します。"}],"collocations":["success-related factors","success-related strategies","success-related skills","success-related challenges","success-related issues"],"synonyms":["achievement-related","prosperity-related","triumph-related"],"antonyms":["failure-related"]}],"etymology":{"value":"\"success\" + \"related\". \"Success\" comes from Latin \"successus\" (an advance, a coming after, good fortune, happy outcome), from past participle of \"succedere\" (to come after, follow, succeed). \"Related\" comes from \"relate\" (to bring into relation, connect), from Latin \"relatus\", past participle of \"referre\" (to bring back, refer).","priority":"★★☆"},"pronunciation":{"ipa":"/səkˈsɛs rɪˌleɪtɪd/","syllables":"suc-cess-re-lat-ed"},"inflection":{"notes":"Adjective, does not inflect."},"usage_notes":{"explanation":"\"Success-related\" is used to describe something that is connected to or has an impact on achieving success. It is often used in business, psychology, and education contexts. The term implies a causal or correlational relationship between the described item and the attainment of success.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ success related","correct":"✓ success-related","note":"It should be hyphenated when used as a compound adjective before a noun."}],"priority":"★☆☆"},"related_words":{"derivatives":["success","successful","successfully","relate","relatedly","relationship"],"phrases":["factors related to success","skills related to success","issues related to success"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Moderately frequent","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Success-related\" is a compound adjective used to describe things that are connected to or have an impact on achieving success. It's commonly used in professional or academic contexts to discuss factors, strategies, or challenges that influence whether someone achieves their goals. Understanding the meaning of \"success\" and \"related\" is helpful in grasping the overall meaning of this term."},"example_sentences":[{"sentence":"The workshop covered various success-related topics, including time management and networking.","translation":"そのワークショップでは、時間管理やネットワーキングなど、さまざまな成功に関連するトピックを取り上げました。","type":"adjective","meaning_category":"Relating to success"},{"sentence":"Research suggests that resilience is a key success-related trait.","translation":"研究によると、レジリエンス（回復力）は、成功に関連する重要な特性です。","type":"adjective","meaning_category":"Relating to success"},{"sentence":"The company offers training programs to enhance success-related skills among its employees.","translation":"その会社は、従業員の成功に関連するスキルを高めるための研修プログラムを提供しています。","type":"adjective","meaning_category":"Relating to success"}]}