{"word":"threaping","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(スコットランド方言)穀物の脱穀","english_definition":"(Scottish dialect) The act of threshing grain.","examples":[{"sentence":"The threaping was hard work, but it was necessary to get the grain.","translation":"脱穀は大変な作業でしたが、穀物を手に入れるためには必要でした。"}],"collocations":[],"synonyms":["threshing","flailing"],"antonyms":[]}],"etymology":{"value":"Derived from the Middle English word 'threpe', meaning to assert, argue, or maintain, and related to the Old English word 'þrēapian', meaning to rebuke or threaten. The connection to threshing is less direct but implies a forceful action.","priority":"★★★"},"pronunciation":{"ipa":"/ˈθriːpɪŋ/","syllables":"three-ping"},"inflection":{"noun_plural":"threapings"},"usage_notes":{"explanation":"'Threaping' is primarily a historical and dialectal term, largely confined to Scotland. It refers specifically to the process of separating grain from the husk, typically by beating it. The term is rarely used in modern English outside of historical or regional contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ They were threaping the wheat in the field.","correct":"✓ They were threshing the wheat in the field.","note":"Use 'threshing' in standard English instead of the dialectal 'threaping'."}],"priority":"★★☆"},"related_words":{"derivatives":["threap (verb) - to maintain or assert; to argue or contend"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Threaping' is a highly specialized and archaic term, primarily found in Scottish dialects and historical texts. It refers to the act of threshing grain, a process of separating the grain from the husk. Due to its limited usage, it is unlikely to be encountered in general English contexts. Understanding this term requires familiarity with historical agricultural practices and regional dialects."},"example_sentences":[{"sentence":"The sound of the **threaping** filled the barn as the workers separated the wheat from the chaff.","translation":"作業員たちが小麦ともみ殻を分離するにつれて、脱穀の音が納屋に響き渡った。","type":"noun","meaning_category":"脱穀"}]}