{"word":"xerodermatic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"乾皮症の、皮膚乾燥症の","english_definition":"Relating to or affected by xeroderma (abnormal dryness of the skin).","examples":[{"sentence":"The patient presented with xerodermatic skin on their hands and face.","translation":"患者は手と顔に乾皮症の皮膚症状を呈した。"},{"sentence":"Xerodermatic conditions can be exacerbated by cold weather.","translation":"乾皮症の状態は、寒さによって悪化することがある。"}],"collocations":["xerodermatic skin","xerodermatic condition","xerodermatic symptoms"],"synonyms":["xerosic","dry-skinned"],"antonyms":["hydrated","moisturized"]},{"part_of_speech":"adjective","definition":"色素性乾皮症の","english_definition":"Relating to or affected by xeroderma pigmentosum (a rare genetic disorder characterized by extreme sensitivity to ultraviolet light and a high risk of skin cancer).","examples":[{"sentence":"Xerodermatic pigmentosum is a rare autosomal recessive genetic disorder.","translation":"色素性乾皮症はまれな常染色体劣性遺伝疾患である。"},{"sentence":"Individuals with xerodermatic pigmentosum must avoid sunlight.","translation":"色素性乾皮症の患者は日光を避けなければならない。"}],"collocations":["xerodermatic pigmentosum","XP"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"From the Greek words 'xeros' (dry) + 'derma' (skin) + '-tic' (relating to).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌzɪroʊdərˈmætɪk/","syllables":"ze-ro-der-mat-ic"},"inflection":{},"usage_notes":{"explanation":"'Xerodermatic' is primarily used in medical contexts to describe skin conditions characterized by abnormal dryness. It can refer to simple dry skin (xeroderma) or the more serious genetic condition, xeroderma pigmentosum. When used without further context, it's important to clarify which condition is being referenced.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She used lotion to treat her xerodermatic.","correct":"✓ She used lotion to treat her xerodermatic skin.","note":"'Xerodermatic' is an adjective, so it needs to modify a noun like 'skin' or 'condition'."}],"priority":"★★☆"},"related_words":{"derivatives":["xeroderma","xerosis","xeroderma pigmentosum"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Primarily found in medical literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'xerodermatic' is a technical term primarily used in medical contexts. It describes a condition related to abnormal dryness of the skin. It's important to understand the root words (xeros = dry, derma = skin) to grasp the meaning. It can refer to general dry skin or the specific genetic disorder, xeroderma pigmentosum. The context usually clarifies which meaning is intended."},"example_sentences":[{"sentence":"The dermatologist diagnosed the patient with a xerodermatic condition.","translation":"皮膚科医は患者を乾皮症と診断した。","type":"adjective","meaning_category":"乾皮症の"},{"sentence":"Protective clothing is essential for individuals with xerodermatic pigmentosum.","translation":"色素性乾皮症の患者にとって、保護服は不可欠である。","type":"adjective","meaning_category":"色素性乾皮症の"}]}