{"word":"connature","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"共同の性質、共通の性質","english_definition":"A shared or common nature.","examples":[{"sentence":"The two elements share a connature, making them highly reactive.","translation":"その二つの元素は共通の性質を共有しており、それらが非常に反応しやすい原因となっている。"},{"sentence":"Despite their differences, the siblings possessed a connature that bound them together.","translation":"彼らは異なっているにもかかわらず、その兄弟姉妹は彼らを結びつける共通の性質を持っていた。"}],"collocations":["share a connature","possess a connature"],"synonyms":["common nature","shared essence","mutual characteristic"],"antonyms":["distinct nature","divergent characteristic"]}],"etymology":{"value":"Derived from the prefix 'con-' (meaning 'together' or 'with') and 'nature', indicating a shared or common nature.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒneɪtʃər/","syllables":"con-na-ture"},"inflection":{"noun_plural":"connatures"},"usage_notes":{"explanation":"'Connature' is a relatively rare word, primarily used in philosophical or scientific contexts to describe a shared or common attribute among different entities. It emphasizes the inherent similarity or shared essence that links things together.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The connature of the building was its size.","correct":"✓ The characteristic of the building was its size.","note":"'Connature' refers to a shared nature, not a single characteristic of one entity."}],"priority":"★☆☆"},"related_words":{"derivatives":["connate (adjective: existing at or dating from birth; inherent)"],"related_terms":["nature","essence","attribute","characteristic"]},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Connature' is a rare and somewhat technical term. It is most likely to be encountered in philosophical or scientific writings that discuss shared attributes or common essences. Understanding the etymology (con- + nature) can help in grasping its meaning."},"example_sentences":[{"sentence":"The connature of these artistic movements lies in their rejection of traditional forms.","translation":"これらの芸術運動の共通の性質は、伝統的な形式の拒絶にある。","type":"noun","meaning_category":"共通の性質"},{"sentence":"The scientists sought to understand the connature of the two newly discovered elements.","translation":"科学者たちは、新たに発見された二つの元素の共通の性質を理解しようと努めた。","type":"noun","meaning_category":"共同の性質"}]}