{"word":"actinoelectric","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"光電気の、光によって電気を発生する","english_definition":"Relating to or exhibiting actinoelectricity; generating electricity by the action of light.","examples":[{"sentence":"The actinoelectric effect is observed in certain semiconductors.","translation":"光電気効果は特定の半導体で見られる。"},{"sentence":"Actinoelectric cells convert light energy into electrical energy.","translation":"光電気セルは光エネルギーを電気エネルギーに変換する。"}],"collocations":["actinoelectric effect","actinoelectric cell"],"synonyms":["photoelectric"],"antonyms":[]}],"etymology":{"value":"From 'actino-' (referring to radiation, especially light) + 'electric'. The 'actino-' prefix comes from the Greek word 'aktis' meaning 'ray'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæktɪnoʊɪˈlɛktrɪk/","syllables":"ac-ti-no-e-lec-tric"},"inflection":{"notes":"This is an adjective, so it has comparative and superlative forms, although they are rarely used: more actinoelectric, most actinoelectric."},"usage_notes":{"explanation":"The term 'actinoelectric' is relatively uncommon and primarily used in scientific or technical contexts when discussing the generation of electricity from light. It is often used interchangeably with 'photoelectric', although 'photoelectric' is the more widely used term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The actinoelectric is used in solar panels.","correct":"✓ The actinoelectric effect is used in solar panels.","note":"'Actinoelectric' is an adjective, not a noun. You need to refer to the 'actinoelectric effect' or use a different term like 'photoelectric effect'."}],"priority":"★☆☆"},"related_words":{"derivatives":["actinoelectricity (noun: 光電気)"],"phrasal_verbs":[],"related_terms":["photoelectric","photovoltaic","solar cell"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Actinoelectric' is a highly specialized term primarily used in physics and engineering to describe the generation of electricity from light. It is synonymous with 'photoelectric' but less commonly used. Understanding this term requires a strong background in physics and electrical engineering. It's not typically encountered outside of these specific fields."},"example_sentences":[{"sentence":"The actinoelectric properties of the material were studied extensively.","translation":"その材料の光電気特性が広範囲に研究された。","type":"adjective","meaning_category":"光電気の"},{"sentence":"Scientists are exploring new actinoelectric materials for solar energy conversion.","translation":"科学者たちは太陽エネルギー変換のための新しい光電気材料を研究している。","type":"adjective","meaning_category":"光によって電気を発生する"}]}