{"word":"fountainously","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"噴水のように、豊富に湧き出るように","english_definition":"In the manner of a fountain; abundantly, copiously.","examples":[{"sentence":"The wine flowed fountainously at the wedding feast.","translation":"結婚披露宴ではワインが噴水のように豊富に注がれた。"},{"sentence":"Ideas flowed fountainously from the brainstorming session.","translation":"ブレインストーミングセッションから、アイデアが噴水のように湧き出た。"}],"collocations":[],"synonyms":["abundantly","copiously","profusely","lavishly"],"antonyms":["sparingly","meagerly"]}],"etymology":{"value":"Derived from the adjective 'fountainous' (resembling a fountain) by adding the adverbial suffix '-ly'. 'Fountainous' itself comes from 'fountain' (a spring or artificial jet of water) + '-ous' (having the quality of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfaʊntənəsli/","syllables":"foun-tain-ous-ly"},"inflection":{},"usage_notes":{"explanation":"'Fountainously' describes something occurring in a way that resembles a fountain – plentiful, gushing, and continuous. It is often used figuratively to describe the abundant flow of liquids, ideas, or emotions. This word is relatively rare and more often found in descriptive writing.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["fountain (noun)","fountainous (adjective)"],"priority":"★☆☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'fountainously' is a relatively rare and advanced word. It is used to describe something happening in a way that is abundant and flowing, like a fountain. Because of its rarity, it is more likely to be encountered in literature or formal writing rather than everyday conversation."},"example_sentences":[{"sentence":"The tears flowed fountainously down her cheeks as she heard the news.","translation":"その知らせを聞いて、彼女の頬に涙が噴水のように流れ落ちた。","type":"adverb","meaning_category":"豊富に湧き出るように"},{"sentence":"His creativity expressed itself fountainously in his artwork.","translation":"彼の創造性は、彼の作品の中で噴水のように豊かに表現された。","type":"adverb","meaning_category":"豊富に湧き出るように"}]}