{"word":"Lazarist","priority":"低","meanings":[{"part_of_speech":"noun","definition":"ラザリスト会士、聖ビンセンシオ・ア・パウロ宣教会会員","english_definition":"A member of the Congregation of the Mission, a Roman Catholic religious order founded by St. Vincent de Paul.","examples":[{"sentence":"He became a Lazarist priest.","translation":"彼はラザリスト会の司祭になった。"},{"sentence":"The Lazarists are known for their missionary work and service to the poor.","translation":"ラザリスト会は、その宣教活動と貧しい人々への奉仕で知られている。"}],"collocations":["Lazarist priest","Lazarist mission","Lazarist order"],"synonyms":["Vincentian","Pauline Father"],"antonyms":[]},{"part_of_speech":"adjective","definition":"ラザリスト会（の）、聖ビンセンシオ・ア・パウロ宣教会（の）","english_definition":"Relating to the Lazarists or their order.","examples":[{"sentence":"The Lazarist church is a beautiful example of Baroque architecture.","translation":"ラザリスト会の教会は、バロック建築の美しい例である。"},{"sentence":"Lazarist education emphasizes both intellectual and spiritual development.","translation":"ラザリスト会の教育は、知的および精神的な発達の両方を重視している。"}],"collocations":["Lazarist church","Lazarist education","Lazarist missionary"],"synonyms":["Vincentian","Pauline"],"antonyms":[]}],"etymology":{"value":"From the name of the priory of St. Lazare in Paris, which was given to St. Vincent de Paul in 1632 as the mother house of his congregation.","priority":"★★☆"},"pronunciation":{"ipa":"ˈlæzərəst","syllables":"Laz-a-rist"},"inflection":{"noun_plural":"Lazarists"},"usage_notes":{"explanation":"The term \"Lazarist\" is often used interchangeably with \"Vincentian\" or \"Pauline Father,\" although \"Vincentian\" is a broader term that can also refer to other organizations inspired by St. Vincent de Paul. Lazarists are primarily engaged in missionary work, education, and charitable activities, particularly serving the poor and marginalized.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a Lasarist.","correct":"✓ He is a Lazarist.","note":"The correct spelling is \"Lazarist,\" not \"Lasarist.\""}],"priority":"★☆☆"},"related_words":{"derivatives":["Lazarism (the principles and practices of the Lazarists)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低い頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"Lazarist\" refers to a member of a specific Roman Catholic religious order founded by St. Vincent de Paul. Understanding this term requires familiarity with religious orders and their historical context. The word is not commonly used in everyday conversation and is more likely to appear in historical or religious texts.","priority":"★★☆"},"example_sentences":[{"sentence":"The **Lazarist** missionaries established schools and hospitals in remote areas.","translation":"ラザリスト会の宣教師たちは、遠隔地に学校や病院を設立した。","type":"noun","meaning_category":"ラザリスト会士"},{"sentence":"The **Lazarist** order has a long history of serving the poor and marginalized.","translation":"ラザリスト会は、貧しい人々や社会から疎外された人々に奉仕してきた長い歴史を持っている。","type":"adjective","meaning_category":"ラザリスト会（の）"}]}