{"word":"toxicodermitis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"中毒性皮膚炎","english_definition":"An inflammatory skin condition caused by an adverse reaction to a medication or other chemical substance, resulting in a variety of skin eruptions.","examples":[{"sentence":"Toxicodermitis can manifest as a rash, blisters, or even skin peeling.","translation":"中毒性皮膚炎は、発疹、水疱、または皮膚剥離として現れることがあります。"},{"sentence":"The patient developed toxicodermitis after starting a new antibiotic.","translation":"患者は新しい抗生物質の服用を開始後、中毒性皮膚炎を発症しました。"}],"collocations":["drug-induced toxicodermitis","acute toxicodermitis","severe toxicodermitis","toxic epidermal necrolysis (TEN)","Stevens-Johnson syndrome (SJS)"],"synonyms":["drug eruption","drug rash","exanthematous drug eruption"],"antonyms":[]}],"etymology":{"value":"The term 'toxicodermitis' is derived from the following components: 'toxico-' (relating to poison or toxin), '-derma' (relating to the skin), and '-itis' (denoting inflammation).","priority":"★★★"},"pronunciation":{"ipa":"/ˌtɒksɪkoʊdərˈmaɪtɪs/","syllables":"tox-i-co-der-mi-tis"},"inflection":{"noun_plural":"toxicodermitides (rare)"},"usage_notes":{"explanation":"Toxicodermitis is a broad term encompassing various skin reactions caused by systemic exposure to medications or chemicals. The clinical presentation can vary widely, ranging from mild rashes to severe, life-threatening conditions such as Stevens-Johnson syndrome (SJS) and toxic epidermal necrolysis (TEN). Diagnosis typically involves a detailed medication history and clinical examination.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ toxicodermatitis","correct":"✓ toxicodermitis","note":"While 'toxicodermatitis' is sometimes used, 'toxicodermitis' is the more accepted and commonly used term in medical literature."}],"priority":"★★☆"},"related_words":{"derivatives":["toxic","dermatitis","dermatology"],"phrasal_verbs":[]},"level_frequency":{"frequency_google_ngram":"Low frequency - Primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Toxicodermitis' is a medical term referring to skin inflammation caused by a reaction to drugs or chemicals. It is primarily used in medical contexts and may not be familiar to the general public. Understanding this term requires knowledge of medical terminology related to dermatology and toxicology."},"example_sentences":[{"sentence":"The dermatologist suspected toxicodermitis based on the patient's symptoms and medication list.","translation":"皮膚科医は患者の症状と薬歴から中毒性皮膚炎を疑った。","type":"general","meaning_category":"general"},{"sentence":"Treatment for toxicodermitis often involves discontinuing the offending medication and supportive care.","translation":"中毒性皮膚炎の治療には、原因薬剤の中止と支持療法がしばしば含まれる。","type":"treatment","meaning_category":"treatment"}]}