{"word":"didascalos","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古代ギリシャ)教師、特に合唱隊の教師","english_definition":"(Ancient Greece) A teacher, especially a teacher or trainer of a chorus.","examples":[{"sentence":"The didascalos was responsible for training the chorus in both song and dance.","translation":"そのdidascalosは、歌と踊りの両方で合唱隊を訓練する責任がありました。"}],"collocations":[],"synonyms":["teacher","instructor","trainer","choragus"],"antonyms":["student","pupil"]}],"etymology":{"value":"Borrowed from Ancient Greek διδάσκαλος (didáskalos, “teacher”), from διδάσκω (didáskō, “I teach”).","priority":"★★★"},"pronunciation":{"ipa":"/dɪˈdæskələs/","syllables":"di-das-ca-los"},"inflection":{"noun_plural":"didascaloi (διδάσκαλοι)"},"usage_notes":{"explanation":"The term 'didascalos' is primarily used in historical contexts when discussing ancient Greek theatre and education. It specifically refers to the individual responsible for training and directing a chorus. The term is not commonly used in modern English.","priority":"★★☆"},"common_mistakes":{"examples":[],"priority":"☆☆☆"},"related_words":{"derivatives":["didactic"],"related_terms":["didaskalia (διδασκαλία) - teaching, instruction"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'didascalos' is a specialized term primarily used in the context of ancient Greek history, particularly related to theatre and education. It refers to a teacher or trainer, especially one who trained a chorus. Due to its specialized nature and historical context, it is not a commonly encountered word in modern English. Understanding the term requires familiarity with ancient Greek culture and terminology."},"example_sentences":[{"sentence":"The ancient Greek playwright often served as his own didascalos, training the actors and chorus.","translation":"古代ギリシャの劇作家は、俳優と合唱隊を訓練する自身のdidascalosを務めることが多かった。","type":"noun","meaning_category":"teacher"}]}