{"word":"subassembly","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"部分組立品、サブアッセンブリー","english_definition":"A self-contained part of a larger assembly.","examples":[{"sentence":"The engine block is a subassembly of the car's engine.","translation":"エンジンブロックは、自動車エンジンのサブアッセンブリーです。"},{"sentence":"The hard drive is a subassembly of the computer.","translation":"ハードドライブは、コンピュータのサブアッセンブリーです。"},{"sentence":"The wing is a subassembly of the airplane.","translation":"翼は、飛行機のサブアッセンブリーです。"}],"collocations":["engine subassembly","wing subassembly","electronic subassembly"],"synonyms":["component","module","unit","part"],"antonyms":["assembly"],"notes":"Subassemblies are often manufactured separately and then assembled into the final product.","images":[]}],"etymology":{"value":"The word \"subassembly\" is formed by combining the prefix \"sub-\" (meaning \"under\" or \"below\") with the word \"assembly.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsʌbəˈsɛmbli/","syllables":"sub-as-sem-bly"},"inflection":{"noun_plural":"subassemblies"},"usage_notes":{"explanation":"A subassembly is a pre-built component that is part of a larger assembly. It is a modular approach to manufacturing, allowing for parallel production processes and easier final assembly.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The car is a subassembly of the engine.","correct":"The engine is a subassembly of the car.","note":"Ensure the subassembly is a component *within* the larger assembly."}],"priority":"★★☆"},"related_words":{"derivatives":["assemble","assembly","disassembly"],"related_terms":["component","module","part","system"],"priority":"★★★"},"level_frequency":{"frequency_corpus":"Relatively infrequent in general conversation, but common in manufacturing and engineering contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'subassembly' is primarily used in technical contexts, especially in manufacturing and engineering. It refers to a component that is itself made up of multiple parts but is designed to be used as a single unit in a larger assembly. Understanding this term is important for anyone working in these fields.","priority":"★★☆"},"example_sentences":[{"sentence":"The robot arm is a complex subassembly consisting of motors, gears, and sensors.","translation":"ロボットアームは、モーター、ギア、センサーで構成される複雑なサブアッセンブリーです。","type":"general","meaning_category":"definition"},{"sentence":"The manufacturing process involves creating several subassemblies before final assembly.","translation":"製造プロセスでは、最終組み立ての前にいくつかのサブアッセンブリーを作成します。","type":"process","meaning_category":"manufacturing"},{"sentence":"Quality control checks are performed on each subassembly to ensure proper functionality.","translation":"適切な機能性を確保するために、各サブアッセンブリーで品質管理チェックが実行されます。","type":"quality control","meaning_category":"quality control"}]}