{"word":"sfumato","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(絵画) スフマート、ぼかし painting technique that uses subtle gradations of light and shadow to produce soft, hazy edges in figures and objects, creating a sense of depth and atmospheric perspective.","english_definition":"A painting technique which employs subtle gradations of light and shadow to produce soft, hazy edges in figures and objects, creating a sense of depth and atmospheric perspective.","examples":[{"sentence":"Leonardo da Vinci's Mona Lisa is famous for its use of sfumato.","translation":"レオナルド・ダ・ヴィンチのモナリザは、スフマートの使用で有名です。"},{"sentence":"The artist used sfumato to create a dreamlike quality in the landscape.","translation":"その画家はスフマートを使って、風景に夢のような雰囲気を作り出しました。"}],"collocations":["use sfumato","apply sfumato","master sfumato"],"synonyms":["chiaroscuro","haze","blur"],"antonyms":["clarity","sharpness"]}],"etymology":{"value":"Italian, from sfumare 'to tone down, evaporate like smoke,' from fumo 'smoke,' from Latin fumus.","priority":"★★★"},"pronunciation":{"ipa":"/sfʊˈmɑːtoʊ/","syllables":"sfu-ma-to"},"inflection":{"notes":"スフマートはイタリア語由来の名詞であり、複数形は通常使用されません。"},"usage_notes":{"explanation":"Sfumato is a painting technique, particularly associated with Leonardo da Vinci, that uses subtle gradations of light and shadow to produce soft, almost imperceptible transitions between tones. It creates a hazy, dreamlike effect, softening the outlines of figures and objects and giving the painting a sense of depth and atmosphere.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a lot of contrast, like sfumato.","correct":"✓ He used sfumato to reduce the contrast.","note":"Sfumato is about subtle gradations, not strong contrast."},{"incorrect":"✗ Sfumato is a type of brushstroke.","correct":"✓ Sfumato is a technique using subtle gradations of tone.","note":"Sfumato is a technique, not a specific type of brushstroke."}],"priority":"★★☆"},"related_words":{"derivatives":["sfumare (verb, Italian: to tone down, to evaporate like smoke)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Primarily used in art historical or art criticism contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Sfumato is a specialized term in art, referring to a painting technique that uses very subtle changes in light and shadow to create soft, hazy outlines. It's often used to create a sense of depth and atmosphere in a painting. You'll mostly encounter this word in discussions or writings about art history or art techniques.","priority":"★★☆"},"example_sentences":[{"sentence":"The artist skillfully employed sfumato to soften the edges of the portrait.","translation":"画家は巧みにスフマートを用いて、肖像画の輪郭を柔らかくしました。","type":"noun","meaning_category":"painting technique"},{"sentence":"Sfumato gives the Mona Lisa its enigmatic and ethereal quality.","translation":"スフマートはモナリザに、その謎めいた、この世のものとは思えない雰囲気を与えています。","type":"noun","meaning_category":"painting technique"}]}