{"word":"God-man","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"神人、神と人両方の性質を持つ存在","english_definition":"A being who possesses both divine and human natures.","examples":[{"sentence":"Jesus Christ is considered the God-man in Christian theology.","translation":"イエス・キリストはキリスト教神学において神人であると考えられている。"},{"sentence":"The concept of a God-man is central to understanding certain religious beliefs.","translation":"神人の概念は、特定の宗教的信念を理解する上で中心となる。"}],"collocations":["divine and human nature","incarnation","theanthropic"],"synonyms":["divine human","human deity","incarnate god"],"antonyms":["mortal","human"]},{"part_of_speech":"noun","definition":"（比喩的に）非常に優れた能力を持つ人、超人的な人物","english_definition":"(Figuratively) A person with extraordinary abilities or qualities, seemingly superhuman.","examples":[{"sentence":"He's a God-man on the basketball court.","translation":"彼はバスケットボールコートでは神のような存在だ。"},{"sentence":"She's a God-man when it comes to solving complex problems.","translation":"彼女は複雑な問題を解決することに関しては神のような存在だ。"}],"collocations":["exceptional talent","superhuman ability","remarkable skill"],"synonyms":["prodigy","genius","virtuoso","superstar"],"antonyms":["average","ordinary","mediocre"]}],"etymology":{"value":"A compound word combining \"God\" (divine being) and \"man\" (human being), reflecting the dual nature of the entity.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡɒd mæn/","syllables":"God-man"},"inflection":{"noun_plural":"God-men"},"usage_notes":{"explanation":"The term \"God-man\" primarily refers to a being that embodies both divine and human attributes. This concept is most prominently found in religious contexts, particularly in Christianity concerning Jesus Christ. Figuratively, it can describe someone exceptionally skilled, almost superhuman, in a particular field.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a god man.","correct":"✓ He is a God-man.","note":"When referring to the specific concept of a being with both divine and human natures, it is typically written as a compound word with a hyphen: God-man."},{"incorrect":"✗ She is god-man at her job.","correct":"✓ She is a God-man at her job.","note":"When used figuratively to describe someone with exceptional abilities, the article 'a' is necessary."}],"priority":"★☆☆"},"related_words":{"derivatives":["godhood","manhood","deity","humanity"],"phrases":["Son of God","Incarnation","Theanthropic principle"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (Rare, primarily in theological or philosophical discussions)","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"God-man\" is a complex concept primarily used in religious and philosophical discussions. It refers to a being that possesses both divine and human characteristics. Understanding this term requires familiarity with theological concepts such as incarnation and the nature of divinity. Outside of religious contexts, it can be used figuratively to describe someone with extraordinary abilities. Due to its specialized usage, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The doctrine of the God-man is a cornerstone of Christian belief.","translation":"神人の教義はキリスト教信仰の基礎である。","type":"noun","meaning_category":"Religious concept"},{"sentence":"In his field, he's considered a God-man.","translation":"彼の分野では、彼は神のような存在だと思われている。","type":"noun","meaning_category":"Figurative"}]}