{"word":"turgidities","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) 腫脹、肥大、誇張された表現、衒学的さ","english_definition":"(plural form) The state or quality of being turgid; swelling; distension; inflated or bombastic language; pomposity.","examples":[{"sentence":"The turgidities in his writing made it difficult to understand.","translation":"彼の文章における誇張された表現のせいで理解するのが難しかった。"},{"sentence":"The doctor noted the turgidities in the patient's legs.","translation":"医者は患者の脚の腫脹に気づいた。"}],"collocations":["literary turgidities (文学的な誇張表現)","physical turgidities (身体的な腫脹)"],"synonyms":["swelling","distension","inflation","bombast","pomposity","grandiloquence"],"antonyms":["simplicity","plainness","compression"]}],"etymology":{"value":"Derived from 'turgid', which comes from the Latin word 'turgidus', meaning 'swollen'. The suffix '-ity' is added to form a noun indicating a state or quality.","priority":"★★☆"},"pronunciation":{"ipa":"/tɜːrˈdʒɪdɪtiz/","syllables":"tur-gid-i-ties"},"inflection":{"noun_plural":"turgidities"},"usage_notes":{"explanation":"'Turgidities' refers to multiple instances or examples of something being turgid. It can describe physical swelling or, more commonly, inflated or excessively ornate language. It is a relatively uncommon word, primarily used in formal or academic contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The turgidities of the water made it hard to swim.","correct":"✓ The turbidity of the water made it hard to swim.","note":"'Turgidities' refers to swelling or inflated language, not the cloudiness of water. Use 'turbidity' for water cloudiness."}],"priority":"★★☆"},"related_words":{"derivatives":["turgid (adjective)","turgidity (singular noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Turgidities' is a rare and sophisticated word. It is most often used in literary or medical contexts to describe either physical swelling or excessively ornate and difficult-to-understand writing. Due to its rarity and complexity, it is suitable for advanced learners only."},"example_sentences":[{"sentence":"The critic pointed out the many turgidities in the author's latest novel.","translation":"評論家は、著者の最新の小説における多くの誇張された表現を指摘した。","type":"noun","meaning_category":"誇張された表現"},{"sentence":"The turgidities observed in the plant's stem indicated a disease.","translation":"植物の茎に見られた腫脹は病気を示していた。","type":"noun","meaning_category":"腫脹"}]}