{"word":"Patwin","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"パトウィン語（カリフォルニア州の先住民言語）","english_definition":"A Wintuan language formerly spoken by the Patwin people of Northern California.","examples":[{"sentence":"Patwin is related to other Wintuan languages such as Wintu and Nomlaki.","translation":"パトウィン語は、ウィントゥ語やノムラキ語といった他のウィントゥアン語族の言語と関連がある。"}],"collocations":["River Patwin","Hill Patwin"],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"パトウィン族（カリフォルニア州の先住民族）","english_definition":"A member of a Native American people formerly living in the Sacramento Valley of Northern California.","examples":[{"sentence":"The Patwin people traditionally lived along the Sacramento River.","translation":"パトウィン族は伝統的にサクラメント川沿いに住んでいた。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Originates from the Patwin language itself, possibly meaning 'people' or referring to a specific place.","priority":"N/A"},"pronunciation":{"ipa":"/ˈpæt.wɪn/","syllables":"Pat-win"},"inflection":{"noun_plural":"Patwins"},"usage_notes":{"explanation":"'Patwin' can refer to either the language or the people who spoke it. Context is important to determine which meaning is intended. The language is critically endangered.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["Wintuan (language family)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"N/A","text":"This entry is about a specific Native American language and people. It is unlikely to appear in general English conversation. Understanding requires knowledge of California history and linguistics."},"example_sentences":[{"sentence":"Efforts are being made to revitalize the Patwin language.","translation":"パトウィン語を復興させるための取り組みが行われている。","type":"noun","meaning_category":"language"},{"sentence":"The Patwin tribe had a rich cultural heritage.","translation":"パトウィン族は豊かな文化遺産を持っていた。","type":"noun","meaning_category":"people"}]}