{"word":"Pholiota","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"スギタケ属 (きのこの分類群)","english_definition":"A genus of fungi in the family Strophariaceae, characterized by scaly caps and stems.","examples":[{"sentence":"Many Pholiota species are edible, but some are poisonous.","translation":"スギタケ属の多くの種は食用ですが、有毒なものもあります。"}],"collocations":["Pholiota nameko (ナメコ)","Pholiota microspora (クリタケ)"],"synonyms":["scalycaps"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek word 'pholis' meaning 'scale', referring to the scaly caps of many species in this genus.","priority":"★★☆"},"pronunciation":{"ipa":"/foʊˈlaɪoʊtə/","syllables":"Pho-li-o-ta"},"inflection":{"noun_plural":"Pholiotas"},"usage_notes":{"explanation":"'Pholiota' refers to a specific genus in mycology. It is most often used in scientific or technical contexts when discussing fungi.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate a Pholiota and it was delicious, but I don't know which one.","correct":"✓ I ate a Pholiota mushroom and it was delicious, but I don't know which species it was.","note":"It's better to specify 'Pholiota mushroom' to avoid ambiguity, especially when talking about eating it. Also, use 'species' to refer to a specific type within the genus."}],"priority":"★★☆"},"related_words":{"derivatives":["Pholiotina (近縁の属)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pholiota' is a technical term used in mycology (the study of fungi). It refers to a specific genus of mushrooms characterized by their scaly caps. This term is primarily encountered in scientific literature, field guides for mushroom identification, or discussions among mycologists and mushroom enthusiasts. A general understanding of biology and scientific classification is helpful for comprehending this term."},"example_sentences":[{"sentence":"The scaly cap is a key characteristic of the genus Pholiota.","translation":"鱗状の傘は、スギタケ属の重要な特徴です。","type":"noun","meaning_category":"きのこ属"},{"sentence":"Pholiota nameko is a popular edible mushroom in Japan.","translation":"ナメコは日本で人気の食用キノコです。","type":"noun","meaning_category":"きのこ属"}]}