{"word":"digamous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"重婚の、再婚の","english_definition":"Relating to or practicing digamy; having two spouses at the same time or serially.","examples":[{"sentence":"The digamous nature of some societies presents unique legal challenges.","translation":"一部の社会における重婚の性質は、独特な法的課題を提示する。"},{"sentence":"The historical prevalence of digamous relationships varies greatly across cultures.","translation":"重婚関係の歴史的な普及率は、文化によって大きく異なる。"}],"collocations":["digamous marriage","digamous relationship","digamous society"],"synonyms":["bigamous","polygamous"],"antonyms":["monogamous"]},{"part_of_speech":"adjective","definition":"(植物学)二形花の","english_definition":"(Botany) Having two kinds of flowers.","examples":[{"sentence":"The digamous plant exhibited distinct male and female flower structures.","translation":"その二形花の植物は、明確な雄花と雌花の構造を示した。"}],"collocations":["digamous plant","digamous flower"],"synonyms":["dimorphic"],"antonyms":["monomorphic"]}],"etymology":{"value":"From the Greek words 'di-' (meaning 'two') and 'gamos' (meaning 'marriage').","priority":"★★★"},"pronunciation":{"ipa":"/ˈdɪɡəməs/","syllables":"di-ga-mous"},"inflection":{},"usage_notes":{"explanation":"'Digamous' refers to the state of being digamous, which can relate to marriage or botany. In the context of marriage, it refers to having two spouses either simultaneously (bigamy/polygamy) or serially (successive marriages after divorce or death of a spouse). In botany, it describes plants having two different types of flowers. The word is not commonly used.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is digamous because he has many wives.","correct":"✓ He is polygamous because he has many wives.","note":"'Digamous' refers to having two spouses, while 'polygamous' refers to having more than two."}],"priority":"★★☆"},"related_words":{"derivatives":["digamy"],"related_terms":["bigamy","polygamy","monogamy"]},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'digamous' is a technical term, not commonly used in everyday language. It is more likely to be encountered in academic or legal contexts when discussing marriage practices or in botanical contexts when describing plant characteristics. Understanding the prefixes 'di-' (two) and the root 'gamous' (related to marriage or reproduction) can aid in deciphering the word's meaning."},"example_sentences":[{"sentence":"The anthropologist studied the digamous practices of the tribe.","translation":"人類学者はその部族の重婚の慣習を研究した。","type":"general","meaning_category":"重婚の"},{"sentence":"This digamous plant species has evolved to attract different pollinators.","translation":"この二形花の植物種は、異なる送粉者を誘引するように進化した。","type":"botany","meaning_category":"二形花の"}]}