{"word":"Shaws","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(plural only) A surname.","english_definition":"A surname, typically of Scottish or Irish origin.","examples":[{"sentence":"The Shaws are a well-known family in the area.","translation":"ショーズ家は、この地域ではよく知られた家族です。"},{"sentence":"I met someone named Shaws at the conference.","translation":"会議でショーズという人に会いました。"}],"collocations":[],"synonyms":[],"antonyms":[]},{"part_of_speech":"noun","definition":"(plural only) A chain of supermarkets in the United States.","english_definition":"A chain of supermarkets located in the Northeastern United States.","examples":[{"sentence":"I'm going to Shaws to buy groceries.","translation":"ショーズに食料品を買いに行きます。"},{"sentence":"Shaws has a great selection of fresh produce.","translation":"ショーズには新鮮な農産物が豊富に揃っています。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the surname Shaw, which has Scottish and Irish origins. The supermarket chain likely adopted the name for branding purposes.","priority":"N/A"},"pronunciation":{"ipa":"/ʃɔːz/","syllables":"Shaws"},"inflection":{"noun_plural":"Shaws (already plural)"},"usage_notes":{"explanation":"'Shaws' is primarily encountered as a surname or as the name of the supermarket chain. When referring to the surname, it's typically plural to indicate multiple members of the Shaw family. When referring to the supermarket, it's treated as a proper noun.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["Shaw"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily as a surname or brand name.","priority":"N/A"},"readability_explanation":{"level":"N/A","text":"'Shaws' is generally straightforward. It's either a surname or a supermarket chain name. Context should clarify the meaning.","priority":"N/A"},"example_sentences":[{"sentence":"The Shaws family has lived in this town for generations.","translation":"ショーズ家はこの町に何世代も住んでいます。","type":"noun","meaning_category":"Surname"},{"sentence":"We stopped by Shaws to pick up some milk and bread.","translation":"牛乳とパンを買うためにショーズに立ち寄りました。","type":"noun","meaning_category":"Supermarket Chain"}]}