{"word":"unequivalently","priority":"★☆☆","meanings":[{"part_of_speech":"adverb","definition":"同等でなく、異なって、明確に区別されて","english_definition":"In a manner that is not equivalent; differently; distinctly; in a way that is not equal or interchangeable.","examples":[{"sentence":"The two concepts are treated unequivocally in the research paper.","translation":"その二つの概念は研究論文の中で明確に区別して扱われている。"},{"sentence":"The company's policy states unequivocally that harassment will not be tolerated.","translation":"会社のポリシーは、ハラスメントを容認しないことを明確に述べている。"},{"sentence":"The data unequivocally supports the hypothesis.","translation":"そのデータは仮説を明確に支持している。"}],"collocations":["state unequivocally","support unequivocally","demonstrate unequivocally","prove unequivocally","reject unequivocally"],"synonyms":["distinctly","differently","unambiguously","clearly","explicitly","definitely","positively"],"antonyms":["equivalently","ambiguously","vaguely","similarly"]}],"etymology":{"value":"\"Unequivocally\" is formed by adding the suffix \"-ly\" to the adjective \"unequivocal.\" \"Unequivocal\" comes from \"un-\" (not) + \"equivocal,\" which is derived from Late Latin \"aequivocus\" (of equal voice or significance), from Latin \"aequus\" (equal) + \"vocare\" (to call). Thus, \"unequivocally\" means \"not of equal voice or significance,\" implying a clear, distinct, and unambiguous manner.","priority":"★★☆"},"pronunciation":{"ipa":"ˌʌnɪˈkwɪvək(ə)li","syllables":"un-e-quiv-o-cal-ly"},"inflection":{"notes":"As an adverb, \"unequivocally\" does not have different forms for gender or number. It modifies verbs, adjectives, or other adverbs."},"usage_notes":{"explanation":"\"Unequivocally\" is used to emphasize that something is expressed or demonstrated in a way that leaves no room for doubt or ambiguity. It indicates a clear and direct statement or action, without any possibility of misinterpretation. It is often used in formal writing and speech to convey certainty and conviction.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He unequivocally said maybe.","correct":"✓ He unequivocally said no.","note":"\"Unequivocally\" implies a clear and unambiguous statement. Saying \"maybe\" is ambiguous, so it contradicts the meaning of \"unequivocally.\" Use it with clear, definite statements. "},{"incorrect":"✗ The evidence was unequivocally, but not strongly, in favor of the hypothesis.","correct":"✓ The evidence was unequivocally in favor of the hypothesis.","note":"\"Unequivocally\" already indicates a strong and clear support. Adding \"but not strongly\" creates a contradiction. If the support is not strong, then \"unequivocally\" is not the right word to use."}],"priority":"★★☆"},"related_words":{"derivatives":["unequivocal (adjective)","equivocal (adjective)","equivocate (verb)","equivocation (noun)"],"phrases":["state unequivocally","support unequivocally","reject unequivocally"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"unequivocally\" means in a way that is clear, absolute, and leaves no doubt. It's used to emphasize that something is expressed or shown without any possibility of misunderstanding or uncertainty. Because it's a formal word, it appears more often in academic, legal, or professional contexts where precision and clarity are important. It is not commonly used in everyday conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The scientist unequivocally rejected the flawed data.","translation":"科学者は欠陥のあるデータを明確に拒否した。","type":"general","meaning_category":"without doubt"},{"sentence":"The contract states unequivocally the terms of the agreement.","translation":"契約書には合意条件が明確に記載されている。","type":"legal","meaning_category":"without ambiguity"},{"sentence":"The witness unequivocally identified the suspect in the lineup.","translation":"証人は、立ち並んだ容疑者の中から容疑者を明確に特定した。","type":"legal","meaning_category":"without ambiguity"}]}