{"word":"Sialolithiasis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"唾石症（だせきしょう）","english_definition":"The formation of salivary calculi (sialoliths) in the salivary glands or ducts.","examples":[{"sentence":"Sialolithiasis is a common cause of salivary gland pain and swelling.","translation":"唾石症は唾液腺の痛みと腫れを引き起こす一般的な原因です。"},{"sentence":"Treatment for sialolithiasis may involve surgical removal of the stone.","translation":"唾石症の治療には、唾石の外科的除去が含まれる場合があります。"}],"collocations":["salivary gland sialolithiasis","submandibular gland sialolithiasis","recurrent sialolithiasis","sialolithiasis treatment","sialolithiasis surgery"],"synonyms":["salivary duct stone","salivary calculus","salivary gland stone"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'sialo-' (saliva), 'lithos' (stone), and '-iasis' (process, condition).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsaɪəloʊlɪˈθaɪəsɪs/","syllables":"Si-a-lo-li-thi-a-sis"},"inflection":{"noun_plural":"Sialolithiases (rarely used)"},"usage_notes":{"explanation":"Sialolithiasis primarily affects the submandibular gland (顎下腺) due to its longer, more tortuous duct and the higher calcium and mucin content of its saliva. The condition can cause pain, especially during eating, as saliva production increases and is blocked by the stone. Diagnosis is typically made through physical examination and imaging studies such as X-rays or CT scans.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ sialolithiasis are rare.","correct":"✓ Sialolithiasis is rare.","note":"Sialolithiasis is a singular noun referring to the condition itself."},{"incorrect":"✗ I have a sialolithiasis in my mouth.","correct":"✓ I have sialolithiasis. / ✓ I have a sialolith in my salivary gland.","note":"The correct way to say you have the condition is 'I have sialolithiasis.' If referring to the stone itself, use 'sialolith'."}],"priority":"★☆☆"},"related_words":{"derivatives":["sialolith (noun: 唾石)","sialadenitis (noun: 唾液腺炎)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Medical terminology)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 医学用語","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Sialolithiasis' is a medical term referring to the condition where stones form in the salivary glands or ducts. These stones, called sialoliths, can block the flow of saliva, causing pain and swelling, especially during meals. The most commonly affected gland is the submandibular gland. Diagnosis often involves imaging techniques, and treatment can range from conservative measures to surgical removal of the stone. This term is primarily used in medical contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The patient presented with symptoms consistent with sialolithiasis, including pain and swelling in the submandibular region.","translation":"患者は顎下部の痛みと腫れを含む、唾石症と一致する症状を呈した。","type":"medical","meaning_category":"symptoms"},{"sentence":"Radiographic imaging confirmed the presence of a sialolith causing obstruction of the salivary duct.","translation":"放射線画像検査により、唾液管の閉塞を引き起こす唾石の存在が確認された。","type":"diagnosis","meaning_category":"diagnosis"},{"sentence":"Surgical removal of the sialolith was necessary to relieve the patient's symptoms.","translation":"患者の症状を緩和するために、唾石の外科的除去が必要であった。","type":"treatment","meaning_category":"treatment"}]}