{"word":"Myzostomidae","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ウミシダヤドリヒザムシ科：環形動物門に属する科で、主にウミシダに寄生する","english_definition":"A family of annelid worms belonging to the order Myzostomida, primarily parasitic on crinoids (feather stars).","examples":[{"sentence":"Myzostomidae are known for their diverse morphologies and host specificity.","translation":"ウミシダヤドリヒザムシ科は、その多様な形態と宿主特異性で知られています。"}],"collocations":["Myzostomidae parasite","Myzostomidae crinoid association"],"synonyms":["Myzostomida"],"antonyms":[]}],"etymology":{"value":"Derived from Myzostomida (the order to which it belongs) + -idae (standard suffix for animal families). Myzostomida comes from Greek 'myzeo' (to suck) + 'stoma' (mouth), referring to their parasitic feeding habits.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌmaɪzoʊˈstɒmɪdiː/","syllables":"My-zo-sto-mi-dae"},"inflection":{"noun_plural":"Myzostomidae (already plural form)"},"usage_notes":{"explanation":"Myzostomidae is a taxonomic family name, usually used in scientific contexts. It refers to a specific group of marine worms that are parasitic on crinoids.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Myzostomidae is a type of fish.","correct":"✓ Myzostomidae is a family of marine worms.","note":"Myzostomidae are not fish; they are annelid worms."}],"priority":"★☆☆"},"related_words":{"derivatives":["Myzostomida (order)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Scientific Term)","frequency_google_ngram":"Very Low","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Myzostomidae' is a scientific term used in marine biology and zoology. Understanding requires familiarity with taxonomic classification and marine invertebrate biology. The term is rarely encountered outside of specialized scientific literature."},"example_sentences":[{"sentence":"Research on Myzostomidae provides insights into parasite-host coevolution.","translation":"ウミシダヤドリヒザムシ科の研究は、寄生者と宿主の共進化に関する洞察を提供します。","type":"general","meaning_category":"scientific"}]}