{"word":"Globulose","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(化学)球状タンパク質の、球状タンパク質に関する","english_definition":"Relating to or consisting of globulins (a type of globular protein).","examples":[{"sentence":"Globulose proteins are typically soluble in dilute salt solutions.","translation":"球状タンパク質は通常、希薄な塩溶液に可溶です。"},{"sentence":"The globulose nature of the antibody allows it to bind to antigens.","translation":"抗体の球状タンパク質としての性質により、抗原に結合することができます。"}],"collocations":["globulose protein","globulose structure","globulose molecule"],"synonyms":["globular","spherical"],"antonyms":["fibrous"]}],"etymology":{"value":"Derived from \"globule\" (a small spherical body) + \"-ose\" (a suffix used in chemistry, often indicating a sugar or carbohydrate, but in this case used to denote a protein type).","priority":"★★☆"},"pronunciation":{"ipa":"ˈɡlɒbjʊloʊs","syllables":"Glob-u-lose"},"inflection":{"notes":"The term is primarily used as an adjective. The noun form is 'globulin'."},"usage_notes":{"explanation":"'Globulose' is primarily used in scientific and technical contexts, specifically in biochemistry and related fields. It describes substances or structures that are related to or composed of globulins, which are a type of globular protein. It is not a commonly used term in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The globulose was found in the blood sample.","correct":"✓ Globulin was found in the blood sample.","note":"'Globulose' is an adjective; 'globulin' is the noun referring to the protein itself."}],"priority":"★★☆"},"related_words":{"derivatives":["globule","globular","globulin"],"related_terms":["protein","amino acid","antibody","immunoglobulin"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency - primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Globulose' is a highly specialized term used in biochemistry and related scientific fields. It describes characteristics or components associated with globulins, a class of globular proteins. Understanding this term requires a background in chemistry or biology. It is not part of general vocabulary.","priority":"★★☆"},"example_sentences":[{"sentence":"The study focused on the globulose components of the serum.","translation":"その研究は血清の球状タンパク質成分に焦点を当てた。","type":"adjective","meaning_category":"球状タンパク質に関する"},{"sentence":"Globulose proteins exhibit a compact, folded structure.","translation":"球状タンパク質はコンパクトに折り畳まれた構造を示す。","type":"adjective","meaning_category":"球状タンパク質の"}]}