{"word":"Freudism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"フロイト主義、精神分析学","english_definition":"A system of psychological theory and therapy which aims to treat mental disorders by investigating the interaction of conscious and unconscious elements in the patient's mind and bringing repressed fears and conflicts into the conscious mind by techniques such as dream interpretation and free association.","examples":[{"sentence":"Freudism has had a profound influence on 20th-century thought.","translation":"フロイト主義は20世紀の思想に深い影響を与えた。"},{"sentence":"The principles of Freudism are often debated and reinterpreted.","translation":"フロイト主義の原則はしばしば議論され、再解釈される。"}],"collocations":["classical Freudism (古典的なフロイト主義)","contemporary Freudism (現代のフロイト主義)","interpret through Freudism (フロイト主義を通して解釈する)","apply Freudism (フロイト主義を適用する)","study Freudism (フロイト主義を研究する)"],"synonyms":["psychoanalysis","Freudian psychology","depth psychology"],"antonyms":[]}],"etymology":{"value":"Named after Sigmund Freud (1856-1939), the founder of psychoanalysis, with the suffix '-ism' indicating a system of thought or doctrine.","priority":"★★★"},"pronunciation":{"ipa":"/ˈfrɔɪdɪzəm/","syllables":"Freud-ism"},"inflection":{"noun_plural":"Freudisms"},"usage_notes":{"explanation":"'Freudism' refers specifically to the theories and practices developed by Sigmund Freud and his early followers. It emphasizes the role of the unconscious mind, early childhood experiences, and psychosexual development in shaping personality and behavior. While psychoanalysis as a therapeutic method is still practiced, many of Freud's original theories have been revised or challenged by later psychologists and psychoanalysts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He practices Freudism as a hobby.","correct":"✓ He studies Freudism as a hobby. / ✓ He practices psychoanalysis.","note":"'Freudism' refers to the theory, while 'psychoanalysis' refers to the practice or therapy. You can study Freudism, but you practice psychoanalysis. "},{"incorrect":"✗ Freudism is the only form of psychology.","correct":"✓ Freudism is one form of psychology.","note":"Freudism is a specific school of thought within psychology, but it is not the only one. There are many other approaches and theories in psychology."}],"priority":"★★☆"},"related_words":{"derivatives":["Freudian (adjective: フロイトの、フロイト主義の; noun: フロイト主義者)","psychoanalytic (adjective: 精神分析の; noun: 精神分析家)","psychoanalysis (noun: 精神分析)","Oedipus complex (名詞: エディプスコンプレックス)","Electra complex (名詞: エレクトラコンプレックス)","id (名詞: エス)","ego (名詞:自我)","superego (名詞:超自我)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in academic or specialized contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Freudism' is a term used in psychology and related fields to describe the theories and methods developed by Sigmund Freud. It involves complex concepts such as the unconscious mind, the interpretation of dreams, and the influence of early childhood experiences on adult behavior. Understanding 'Freudism' requires familiarity with psychological terminology and a basic knowledge of the history of psychology. It is most often encountered in academic texts or discussions about the history and development of psychological thought.","priority":"★★☆"},"example_sentences":[{"sentence":"The professor lectured on the key concepts of **Freudism**.","translation":"教授はフロイト主義の主要な概念について講義した。","type":"noun","meaning_category":"精神分析学"},{"sentence":"Some critics argue that **Freudism** lacks empirical evidence.","translation":"批評家の中には、フロイト主義には経験的証拠が欠けていると主張する者もいる。","type":"noun","meaning_category":"精神分析学"},{"sentence":"Her interpretation of the novel was heavily influenced by **Freudism**.","translation":"彼女の小説の解釈はフロイト主義に大きく影響を受けていた。","type":"noun","meaning_category":"精神分析学"}]}