{"word":"Ontography","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"An account or description of being or existence; a description of what exists.","english_definition":"A description or account of being or existence; a branch of metaphysics concerned with describing the different kinds of entities that exist.","examples":[{"sentence":"His work delved into the ontography of the digital world.","translation":"彼の研究はデジタル世界の存在論的記述を掘り下げた。"},{"sentence":"The ontography of the novel presented a complex interplay of characters and settings.","translation":"その小説の存在論的記述は、登場人物と舞台設定の複雑な相互作用を示していた。"}],"collocations":["digital ontography","philosophical ontography","narrative ontography"],"synonyms":["description of being","account of existence","ontology (related)","metaphysical description"],"antonyms":["N/A - Ontography is a descriptive field, not typically opposed by other concepts."]}],"etymology":{"value":"Derived from 'onto-' (related to being or existence) and '-graphy' (describing or writing).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒnˈtɒɡrəfi/","syllables":"on-tog-ra-phy"},"inflection":{"noun_plural":"ontographies"},"usage_notes":{"explanation":"'Ontography' is a term used to describe the process or result of describing what exists. It is closely related to 'ontology,' which is the study of being, but ontography focuses more on the descriptive aspect. It can be used in philosophical, literary, or technical contexts to refer to a detailed account of the entities and their relationships within a specific domain.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ontography defines the existence of God.","correct":"✓ The ontology defines the existence of God.","note":"Ontology is the branch of philosophy that defines existence; ontography describes it."},{"incorrect":"✗ He created an ontography to solve the problem.","correct":"✓ He created an ontology to solve the problem.","note":"Ontology is used to create a framework, ontography is used to describe what exists."}],"priority":"★★☆"},"related_words":{"derivatives":["ontographic (adjective)"],"phrasal_verbs":[],"related_terms":["ontology","metaphysics","epistemology","description","account"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - primarily used in academic or philosophical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Ontography' is a specialized term used in philosophy and related fields to refer to the description of what exists. It is a detailed account of entities and their relationships within a specific domain. While closely related to 'ontology,' which is the study of being, ontography focuses on the descriptive aspect. Understanding this term requires familiarity with philosophical concepts and academic discourse. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The researcher developed an ontography of the social media landscape to understand the interactions between users.","translation":"研究者は、ユーザー間の相互作用を理解するために、ソーシャルメディアの状況の存在論的記述を作成した。","type":"general","meaning_category":"description of existence"},{"sentence":"The artist's ontography of the city captured the essence of urban life through detailed depictions of its inhabitants and architecture.","translation":"アーティストの都市の存在論的記述は、住民と建築の詳細な描写を通じて都市生活の本質を捉えた。","type":"literary","meaning_category":"description of existence"},{"sentence":"The software engineer created an ontography of the database schema to document the structure and relationships of the data.","translation":"ソフトウェアエンジニアは、データの構造と関係を文書化するために、データベーススキーマの存在論的記述を作成した。","type":"technical","meaning_category":"description of existence"}]}