{"word":"Stolas","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Demonology) A Great Prince of Hell, commanding twenty-six legions of demons. He appears as a wise owl, but can take human form. He teaches astronomy, herbalism, and the knowledge of precious stones.","english_definition":"In demonology, Stolas is a Great Prince of Hell, commanding twenty-six legions of demons. He appears as a wise owl, but can take human form. He teaches astronomy, herbalism, and the knowledge of precious stones.","examples":[{"sentence":"Stolas is described in the Ars Goetia as the thirty-sixth spirit.","translation":"ストラスは、アルス・ゴエティアにおいて36番目の霊として記述されている。"},{"sentence":"Summoning Stolas is said to grant knowledge of the stars.","translation":"ストラスを召喚すると、星の知識が得られると言われている。"}],"collocations":["summon Stolas","Stolas teaches","Stolas appears"],"synonyms":["Stolos","Solas"],"antonyms":[]}],"etymology":{"value":"The name 'Stolas' is believed to be derived from the Greek word 'στολή' (stolē), meaning 'robe' or 'garment,' possibly alluding to his princely status.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstoʊləs/","syllables":"Sto-las"},"inflection":{},"usage_notes":{"explanation":"Stolas is primarily known within the context of demonology and occult studies. He is not a commonly used word outside of these specific areas. References to Stolas are most often found in grimoires and related literature.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["demon","demonology","Goetia"],"idioms_phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門用語。","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Stolas' is a term primarily encountered in the context of demonology, specifically within grimoires like the Ars Goetia. Understanding references to Stolas requires familiarity with occult literature and demonological hierarchies. The term is not part of common vocabulary and is restricted to specialized fields of study.","priority":"★★☆"},"example_sentences":[{"sentence":"According to the Lesser Key of Solomon, Stolas is a powerful demon.","translation":"ソロモンの小さな鍵によると、ストラスは強力な悪魔である。","type":"noun","meaning_category":"Demonology"},{"sentence":"The grimoire describes Stolas's appearance as an owl.","translation":"そのグリモワールは、ストラスの外見をフクロウとして記述している。","type":"noun","meaning_category":"Demonology"}]}