{"word":"extrusive","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(地質学)噴出した、噴出性の","english_definition":"(geology) relating to or denoting rock that has been extruded at the earth's surface as lava or other volcanic material.","examples":[{"sentence":"Extrusive rocks are formed from lava that cools quickly on the Earth's surface.","translation":"噴出岩は、地球の表面で急速に冷却される溶岩から形成されます。"},{"sentence":"Basalt is a common type of extrusive igneous rock.","translation":"玄武岩は一般的な種類の噴出性火成岩です。"}],"collocations":["extrusive rock","extrusive igneous rock","extrusive volcanism"],"synonyms":["volcanic","effusive"],"antonyms":["intrusive"]}],"etymology":{"value":"From 'extrude' + '-ive'. 'Extrude' comes from Latin 'ex-' (out) + 'trudere' (to push).","priority":"★★★"},"pronunciation":{"ipa":"/ɪkˈstruːsɪv/","syllables":"ex-tru-sive"},"inflection":{"notes":"Comparative and superlative forms are 'more extrusive' and 'most extrusive', respectively, as it's an adjective derived from a verb."},"usage_notes":{"explanation":"'Extrusive' is primarily used in geology to describe igneous rocks that solidify on the Earth's surface. These rocks typically have smaller crystals due to rapid cooling. It is the opposite of 'intrusive', which describes rocks that solidify beneath the surface.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The extrusive rock was found deep underground.","correct":"✓ The intrusive rock was found deep underground.","note":"Extrusive rocks are found on the surface, not deep underground."}],"priority":"★★☆"},"related_words":{"derivatives":["extrusion","extrude"],"related_terms":["igneous","volcanic","lava","magma","intrusive"]},"level_frequency":{"level":"Technical (Geology)","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'extrusive' is a technical term primarily used in the field of geology. It specifically describes igneous rocks that have formed on the Earth's surface from the cooling of lava or other volcanic materials. Understanding this term requires a basic understanding of geological processes and rock formation."},"example_sentences":[{"sentence":"The Hawaiian Islands are largely composed of extrusive basalt.","translation":"ハワイ諸島は主に噴出した玄武岩で構成されています。","type":"adjective","meaning_category":"geology"},{"sentence":"The rapid cooling of the lava resulted in fine-grained extrusive rocks.","translation":"溶岩の急速な冷却により、細かい粒子状の噴出岩が生成されました。","type":"adjective","meaning_category":"geology"}]}