{"word":"bathyesthesia","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"深部感覚、深部知覚","english_definition":"The sensibility to feeling deep within the body, as in muscles, joints, etc.","examples":[{"sentence":"Bathyesthesia allows us to perceive the position of our limbs even with our eyes closed.","translation":"深部感覚によって、私たちは目を閉じていても手足の位置を知覚できます。"},{"sentence":"Impairment of bathyesthesia can lead to difficulties in coordination and balance.","translation":"深部感覚の障害は、協調運動やバランスの困難につながる可能性があります。"}],"collocations":["impaired bathyesthesia (障害された深部感覚)","loss of bathyesthesia (深部感覚の喪失)","testing bathyesthesia (深部感覚の検査)"],"synonyms":["proprioception","kinesthesia","deep sensibility"],"antonyms":[]}],"etymology":{"value":"From Greek βαθύς (bathys) meaning 'deep' and αἴσθησις (aisthesis) meaning 'sensation, perception'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌbæθɪiːsˈθiːziə/","syllables":"ba-thy-es-the-si-a"},"inflection":{"noun_plural":"bathyesthesias"},"usage_notes":{"explanation":"Bathyesthesia refers specifically to the sense of position and movement of the body that originates from deep within the tissues, muscles, and joints. It is a component of proprioception, which is a broader term encompassing all aspects of body awareness.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Bathyesthesia is the same as touch.","correct":"✓ Bathyesthesia is a type of deep sensation, not just touch.","note":"Bathyesthesia is not the same as simple touch; it involves the perception of position and movement of body parts. "},{"incorrect":"✗ Bathyesthesia can be tested using vision.","correct":"✓ Bathyesthesia is tested without visual cues.","note":"Bathyesthesia is tested by assessing the ability to perceive joint position and movement without visual input."}],"priority":"★★☆"},"related_words":{"derivatives":["bathyesthetic (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Bathyesthesia' is a specialized term in physiology and neurology, referring to the deep sensibility within the body. It is not commonly used outside of medical or scientific contexts. Understanding requires a background in anatomy and sensory perception."},"example_sentences":[{"sentence":"The neurologist tested the patient's bathyesthesia by assessing their ability to perceive joint position without visual cues.","translation":"神経科医は、視覚的な手がかりなしに関節の位置を知覚する患者の能力を評価することにより、患者の深部感覚を検査しました。","type":"noun","meaning_category":"深部感覚"},{"sentence":"Loss of bathyesthesia can result from peripheral neuropathy or damage to the spinal cord.","translation":"深部感覚の喪失は、末梢神経障害または脊髄の損傷に起因する可能性があります。","type":"noun","meaning_category":"深部感覚"}]}