{"word":"Blackwashing","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(映画・テレビなどで)歴史上の人物やフィクションのキャラクターを、原作では白人として描かれているにもかかわらず、黒人俳優が演じること。","english_definition":"The practice of casting Black actors in roles that were originally written to be White characters in historical or fictional works.","examples":[{"sentence":"The casting of a Black actress as Anne Boleyn was met with both praise and accusations of blackwashing.","translation":"アン・ブーリン役への黒人女優の配役は、称賛とブラックウォッシングの非難の両方を受けた。"},{"sentence":"Some argue that blackwashing is a form of representation, while others see it as erasure of White history.","translation":"ブラックウォッシングは表現の一形態だと主張する人もいれば、白人の歴史の消去だと見る人もいる。"}],"collocations":["reverse casting","color-blind casting","racebending"],"synonyms":[],"antonyms":["whitewashing"]},{"part_of_speech":"verb","definition":"(映画・テレビなどで)ブラックウォッシングを行う。","english_definition":"To engage in the practice of blackwashing.","examples":[{"sentence":"The production company was accused of blackwashing the play by casting predominantly Black actors in traditionally White roles.","translation":"その制作会社は、伝統的に白人の役柄に主に黒人俳優を配役することで、演劇をブラックウォッシングしていると非難された。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"「Whitewashing（ホワイトウォッシング）」という言葉を基にした造語で、ホワイトウォッシングが白人俳優を優先して非白人の役を演じさせることを指すのに対し、ブラックウォッシングは黒人俳優を優先して白人の役を演じさせることを指す。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈblækˌwɒʃɪŋ/","syllables":"black-wash-ing"},"inflection":{"verb_forms":{},"noun_plural":""},"usage_notes":{"explanation":"「**Blackwashing**」は、映画やテレビなどのメディアにおいて、歴史上の人物やフィクションのキャラクターを、原作では白人として描かれているにもかかわらず、黒人俳優が演じることを指す言葉です。この言葉はしばしば議論を呼び、肯定的な意見（多様性の促進、表現の自由）と否定的な意見（歴史の改ざん、文化の盗用）があります。類似の概念として、「color-blind casting（人種を考慮しない配役）」や「racebending（人種転換）」がありますが、ブラックウォッシングは特に、原作が白人キャラクターであることを強調する文脈で使用されます。対義語は「whitewashing（ホワイトウォッシング）」で、これは白人俳優が非白人の役を演じることを指します。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The movie was praised for its blackwashing of the historical event.","correct":"✓ The movie was criticized for its blackwashing of the historical event.","note":"「Blackwashing」はしばしば批判的な意味合いで使用されるため、文脈に注意が必要です。"},{"incorrect":"✗ Blackwashing is always a good thing for diversity.","correct":"✓ Some people believe that blackwashing can be a good thing for diversity, while others disagree.","note":"「Blackwashing」に対する意見は分かれるため、一方的な肯定や否定は避けるべきです。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"idioms_phrases":[],"related_terms":["Whitewashing","Color-blind casting","Racebending","Representation","Diversity","Cultural appropriation"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 比較的新しい言葉で、特定の文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Blackwashing**」は、映画やテレビで、もともと白人として書かれたキャラクターを黒人俳優が演じることを指す言葉です。これは「whitewashing（ホワイトウォッシング）」という言葉から来ており、ホワイトウォッシングは非白人のキャラクターを白人俳優が演じることを意味します。ブラックウォッシングは、多様性を増やす試みとして評価されることもありますが、歴史や文化の正確さを損なうとして批判されることもあります。この言葉を使うときは、それが議論の的となる可能性があることを理解しておくことが大切です。"},"example_sentences":[{"sentence":"The debate over blackwashing in the new film adaptation sparked heated discussions online.","translation":"新作映画の翻案におけるブラックウォッシングに関する議論は、オンラインで激しい議論を引き起こした。","type":"noun","meaning_category":"映画・テレビにおける配役"},{"sentence":"Critics accused the director of blackwashing the source material to appeal to a wider audience.","translation":"批評家たちは、監督がより幅広い観客にアピールするために原作をブラックウォッシングしたと非難した。","type":"verb","meaning_category":"ブラックウォッシングを行う"}]}