{"word":"terrenely","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"現世的に、世俗的に、地上で","english_definition":"In an earthly or worldly manner; in a terrestrial way.","examples":[{"sentence":"He lived terrenely, concerned only with the matters of this world.","translation":"彼は現世的に生き、この世のことだけを気にかけていた。"},{"sentence":"She approached the problem terrenely, focusing on practical solutions.","translation":"彼女はその問題に世俗的に取り組み、現実的な解決策に焦点を当てた。"}],"collocations":["live terrenely","approach terrenely","think terrenely"],"synonyms":["earthly","worldly","mundanely","materially","secularly"],"antonyms":["heavenly","spiritually","otherworldly"]}],"etymology":{"value":"Derived from the adjective 'terrene,' which comes from the Latin 'terrenus' meaning 'of the earth,' and the suffix '-ly' which forms adverbs.","priority":"★★☆"},"pronunciation":{"ipa":"/təˈriːnli/","syllables":"ter-rene-ly"},"inflection":{"notes":"Adverb - no inflection."},"usage_notes":{"explanation":"'Terrenely' is an adverb that describes actions or states related to the earth or worldly matters, as opposed to spiritual or heavenly concerns. It is not a commonly used word, and its usage often implies a focus on practical, material, or secular aspects.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted terrenely when he should have been spiritual.","correct":"✓ He acted in a terrene manner when he should have been spiritual.","note":"While 'terrenely' is correct, using 'in a terrene manner' might sound more natural to some speakers, especially if the adverb sounds too formal or unusual."}],"priority":"★☆☆"},"related_words":{"derivatives":["terrene (adjective: earthly, worldly)","terrestrial (adjective: relating to the earth)","terrain (noun: a stretch of land, especially with regard to its physical features)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 稀な語彙 (Rare vocabulary).","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Terrenely' is a relatively rare and formal adverb that means 'in an earthly or worldly manner.' It is used to describe actions or thoughts that are focused on the material world rather than spiritual or heavenly matters. Because of its rarity and formality, it is more likely to be encountered in academic or literary contexts rather than everyday conversation."},"example_sentences":[{"sentence":"The philosopher argued that humans should live more terrenely, focusing on the needs of the present world.","translation":"その哲学者は、人間はもっと現世的に生きるべきで、現在の世界のニーズに焦点を当てるべきだと主張した。","type":"adverb","meaning_category":"世俗的に"},{"sentence":"She approached her business terrenely, always prioritizing profit and market share.","translation":"彼女は常に利益と市場シェアを優先し、ビジネスに世俗的に取り組んだ。","type":"adverb","meaning_category":"現世的に"}]}