{"word":"reburials","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"再埋葬（複数形）","english_definition":"plural of reburial: the act of burying again.","examples":[{"sentence":"The museum oversaw the reburials of the indigenous remains.","translation":"博物館は、先住民の遺骨の再埋葬を監督しました。"},{"sentence":"Controversy surrounded the reburials due to differing cultural beliefs.","translation":"文化的な信念の違いから、再埋葬をめぐる論争が起きました。"}],"collocations":["ceremonial reburials (儀式的な再埋葬)","mass reburials (集団再埋葬)","reburials site (再埋葬地)"],"synonyms":["interment","re-interment"],"antonyms":["exhumation","disinterment"]}],"etymology":{"value":"\"re-\" (再び) + \"burial\" (埋葬)","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːˈberiəlz/","syllables":"re-bur-i-als"},"inflection":{"noun_plural":"reburials"},"usage_notes":{"explanation":"\"Reburials\" refers to the act of burying something again, typically human remains. This often occurs after an exhumation (digging up) for forensic analysis, archaeological study, or relocation of a cemetery. The term is often used in discussions about cultural heritage, indigenous rights, and ethical treatment of the dead.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The reburial were performed quickly.","correct":"✓ The reburials were performed quickly.","note":"Since 'reburials' is plural, the verb should also be plural ('were')."},{"incorrect":"✗ He attended the reburial of his ancestor.","correct":"✓ He attended the reburial of his ancestors. / ✓ He attended the reburials of his ancestors.","note":"If multiple ancestors were reburied, use the plural form 'reburials'. If referring to a single ancestor, use 'reburial'."}],"priority":"★★☆"},"related_words":{"derivatives":["rebury (verb): to bury again","burial (noun): the act of burying","exhumation (noun): the act of digging up a body"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Reburials\" is a specialized term primarily used in contexts related to archaeology, anthropology, cultural heritage, and indigenous rights. It refers to the act of burying something again, usually human remains. Understanding this term requires familiarity with discussions surrounding ethical treatment of the dead and cultural sensitivities. It's not a commonly used word in everyday conversation."},"example_sentences":[{"sentence":"The archaeological team carefully documented the reburials site.","translation":"考古学チームは、再埋葬地を注意深く記録しました。","type":"noun","meaning_category":"再埋葬地"},{"sentence":"The reburials were conducted according to traditional customs.","translation":"再埋葬は伝統的な慣習に従って行われました。","type":"noun","meaning_category":"再埋葬"}]}