{"word":"Euploidies","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"The condition of having a chromosome number that is an exact multiple of the haploid number.","english_definition":"The state of a cell or organism having a chromosome number that is an exact multiple of the haploid number (n).","examples":[{"sentence":"Euploidies are normal in some tissues, such as liver cells, which may be polyploid.","translation":"正倍数性は、多倍体となり得る肝細胞など、一部の組織では正常です。"},{"sentence":"A human cell with 46 chromosomes (2n) is euploid, while one with 47 or 45 is aneuploid.","translation":"46本の染色体（2n）を持つヒト細胞は正倍数体ですが、47本または45本の染色体を持つ細胞は異数体です。"}],"collocations":["polyploid euploidy","haploid euploidy","diploid euploidy"],"synonyms":["polyploidy","haploidy","diploidy"],"antonyms":["aneuploidy"]}],"etymology":{"value":"Derived from the Greek words 'eu' meaning 'true' or 'good', and 'ploid' referring to the number of chromosome sets. The suffix '-ies' indicates a plural form or a condition.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈjuːˌplɔɪdiz/","syllables":"Eu-ploid-ies"},"inflection":{"noun_plural":"euploidies"},"usage_notes":{"explanation":"'Euploidies' refers to the state where a cell or organism has a complete set or sets of chromosomes, as opposed to missing or extra individual chromosomes (aneuploidy). It is important in genetics and cell biology to understand chromosome number variations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Euploidies always cause genetic disorders.","correct":"✓ Aneuploidies often cause genetic disorders; euploidies are sometimes normal.","note":"Euploidies, particularly polyploidies, can be normal in some organisms or tissues, whereas aneuploidies are more often associated with genetic disorders."}],"priority":"★★☆"},"related_words":{"derivatives":["euploid (adjective, noun)","polyploid (adjective, noun)","aneuploid (adjective, noun)"],"related_terms":["chromosome","genome","ploidy","haploid","diploid","polyploidy","aneuploidy"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Euploidies' is a technical term used in genetics to describe cells or organisms with a chromosome number that is an exact multiple of the haploid number. This term is typically encountered in advanced biology or genetics contexts when discussing chromosome variations and their implications. Understanding this term requires a background in basic genetics and cell biology.","priority":"★★☆"},"example_sentences":[{"sentence":"The researchers examined the prevalence of euploidies in different plant species.","translation":"研究者たちは、さまざまな植物種における正倍数性の有病率を調査しました。","type":"general","meaning_category":"chromosome number"},{"sentence":"Some types of cancer cells exhibit euploidies as a result of genome duplication.","translation":"一部の種類の癌細胞は、ゲノム重複の結果として正倍数性を示します。","type":"medical","meaning_category":"genetics"},{"sentence":"Understanding euploidies is crucial for studying the evolution of chromosome numbers in eukaryotes.","translation":"正倍数性を理解することは、真核生物における染色体数の進化を研究するために不可欠です。","type":"biological","meaning_category":"evolution"}]}