{"word":"wikiup","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(米国南西部インディアンの)小屋、仮小屋","english_definition":"a temporary or semi-permanent dwelling used by nomadic Native American tribes, particularly in the Southwest of the United States. It is typically made of a frame of branches covered with brush, grass, or hides.","examples":[{"sentence":"The Apache family lived in a wikiup during the summer months.","translation":"アパッチ族の家族は夏の数ヶ月間、ウィキアップに住んでいた。"},{"sentence":"Archaeologists found the remains of several wikiups at the ancient campsite.","translation":"考古学者は古代のキャンプ地でいくつかのウィキアップの残骸を発見した。"}],"collocations":["build a wikiup","live in a wikiup","wikiup shelter"],"synonyms":["shelter","lodge","hut","wigwam","hogan"],"antonyms":[]}],"etymology":{"value":"語源は、おそらくアパッチ語に由来すると考えられている。","priority":"★★☆"},"pronunciation":{"ipa":"ˈwɪkiˌʌp","syllables":"wi-ki-up"},"inflection":{"noun_plural":"wikiups"},"usage_notes":{"explanation":"「**wikiup**」は、主にアメリカ南西部の先住民族（特にアパッチ族など）が使用した、一時的な住居を指す言葉です。枝や草、動物の皮などで作られた簡素な小屋であり、遊牧生活に適した構造をしています。現代では、歴史的な文脈や、先住民族の文化に関する記述で用いられることが多い単語です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ They built a wikiup out of bricks.","correct":"✓ They built a wikiup out of branches and brush.","note":"ウィキアップは通常、レンガなどの恒久的な材料ではなく、枝や草などの自然素材で作られます。"},{"incorrect":"✗ All Native American tribes lived in wikiups.","correct":"✓ Some Native American tribes in the Southwest lived in wikiups.","note":"ウィキアップは、すべてのアメリカ先住民族が使用していたわけではありません。主に南西部の特定の部族が使用していました。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["wigwam","tipi","hogan","longhouse"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (非常に特殊な語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**wikiup**」は、アメリカ南西部の先住民族、特にアパッチ族などが使用していた一時的な住居を指す専門的な単語です。一般的な語彙ではなく、考古学、人類学、またはアメリカ先住民族の文化に関する文脈でのみ使用される可能性が高いです。この単語を理解するには、アメリカ南西部の先住民族の歴史と文化に関するある程度の知識が必要です。"},"example_sentences":[{"sentence":"The family constructed a wikiup to provide shelter from the desert sun.","translation":"その家族は砂漠の太陽から身を守るためにウィキアップを建てた。","type":"noun","meaning_category":"小屋"},{"sentence":"The anthropologist studied the construction techniques of traditional wikiups.","translation":"人類学者は伝統的なウィキアップの建設技術を研究した。","type":"noun","meaning_category":"小屋"}]}