{"word":"repromulgation","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"再公布、再発布","english_definition":"The act of officially proclaiming or publishing (a law, decree, etc.) again.","examples":[{"sentence":"The repromulgation of the revised regulations is expected next month.","translation":"改正された規則の再公布は来月予定されています。"},{"sentence":"The government announced the repromulgation of the emergency decree.","translation":"政府は緊急令の再公布を発表した。"}],"collocations":["repromulgation of a law","repromulgation of regulations","repromulgation of a decree"],"synonyms":["republication","reissue","re-enactment"],"antonyms":["repeal","revocation"]}],"etymology":{"value":"The word \"repromulgation\" is formed by adding the prefix \"re-\" (meaning again) to \"promulgation.\" \"Promulgation\" comes from the Latin word \"promulgare,\" meaning to make known publicly, proclaim, or publish.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːprɒmʌlˈɡeɪʃən/","syllables":"re-pro-mul-ga-tion"},"inflection":{"noun_plural":"repromulgations"},"usage_notes":{"explanation":"\"Repromulgation\" refers to the act of officially announcing or publishing something (usually a law, regulation, or decree) again. This is typically done when a previous version has been amended or when it is necessary to reaffirm its validity. It is a formal and legal term.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The repromulgation was done in secret.","correct":"✓ The repromulgation was announced publicly.","note":"Repromulgation, by definition, involves a public announcement, so it cannot be done in secret."}],"priority":"★☆☆"},"related_words":{"derivatives":["repromulgate (verb)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Repromulgation\" is a formal and technical term primarily used in legal and governmental contexts. It refers to the act of officially reissuing or republishing a law, regulation, or decree. Understanding this word requires familiarity with legal and administrative processes. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The repromulgation of the environmental protection law aimed to strengthen its enforcement.","translation":"環境保護法の再公布は、その施行を強化することを目的としていた。","type":"general","meaning_category":"再公布"},{"sentence":"Due to recent amendments, the repromulgation of the guidelines was deemed necessary.","translation":"最近の修正により、ガイドラインの再公布が必要と判断された。","type":"general","meaning_category":"再公布"}]}