{"word":"emotion-focused","priority":"★★★","meanings":[{"part_of_speech":"adjective","definition":"感情に焦点を当てた、感情中心の","english_definition":"Primarily concerned with understanding, expressing, or regulating emotions.","examples":[{"sentence":"Emotion-focused therapy aims to help individuals understand and manage their feelings.","translation":"感情焦点療法は、個人が自分の感情を理解し、管理するのを助けることを目的としています。"},{"sentence":"An emotion-focused approach can be beneficial in dealing with grief and loss.","translation":"感情中心のアプローチは、悲しみや喪失に対処する際に有益となることがあります。"},{"sentence":"Emotion-focused coping strategies involve accepting and processing one's feelings.","translation":"感情焦点型のコーピング戦略は、自分の感情を受け入れ、処理することを含みます。"}],"collocations":["emotion-focused therapy (感情焦点療法)","emotion-focused coping (感情焦点型コーピング)","emotion-focused approach (感情焦点型アプローチ)","emotion-focused regulation (感情焦点型調整)"],"synonyms":["affect-focused","feeling-oriented","emotion-centered"],"antonyms":["problem-focused","task-oriented","cognitive-focused"]},{"part_of_speech":"adjective","definition":"感情に重点を置いている、感情を重視する","english_definition":"Giving significant importance or attention to emotions.","examples":[{"sentence":"The book takes an emotion-focused perspective on human behavior.","translation":"その本は、人間の行動に対する感情重視の視点を取り上げています。"},{"sentence":"Emotion-focused leadership involves understanding and responding to the emotional needs of team members.","translation":"感情焦点型のリーダーシップは、チームメンバーの感情的なニーズを理解し、対応することを含みます。"}],"collocations":["emotion-focused leadership (感情焦点型リーダーシップ)","emotion-focused perspective (感情焦点型視点)"],"synonyms":["emotionally driven","sentiment-based","affectively oriented"],"antonyms":["rationally driven","fact-based","logically oriented"]}],"etymology":{"value":"The term 'emotion-focused' is formed by combining 'emotion' (a strong feeling such as love, hate, anger, joy, or grief) with 'focused' (having one's attention or interest directed at something specific). The combination indicates a primary attention or emphasis on emotions.","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈmoʊʃən ˈfoʊkəst/","syllables":"e-mo-tion-fo-cused"},"inflection":{"notes":"As an adjective, 'emotion-focused' does not have different inflections. It can be modified by adverbs (e.g., 'very emotion-focused')."},"usage_notes":{"explanation":"'Emotion-focused' is often used in psychology, therapy, and leadership contexts to describe approaches or strategies that prioritize understanding, managing, and responding to emotions. It is frequently contrasted with 'problem-focused' approaches, which prioritize addressing the practical aspects of a situation. The term implies a deep consideration of emotional processes and their impact on behavior and well-being.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is very emotion focused.","correct":"✓ He is very emotion-focused.","note":"The hyphen is important to connect 'emotion' and 'focused' to form a compound adjective. Without the hyphen, the meaning is unclear. Using 'emotionally focused' is also grammatically correct. "},{"incorrect":"✗ Emotion focus therapy.","correct":"✓ Emotion-focused therapy.","note":"The adjective 'emotion-focused' modifies the noun 'therapy,' so the hyphen is necessary to link the two words into a single descriptive unit. "},{"incorrect":"✗ Emotion focused coping is important.","correct":"✓ Emotion-focused coping is important.","note":"The hyphen is necessary to link the two words into a single descriptive unit. "}],"priority":"★★☆"},"related_words":{"derivatives":["emotion","focused","emotionally","focus","focusing"],"related_terms":["emotion regulation","emotional intelligence","affective science","coping mechanisms","psychotherapy","counseling"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, but common in academic and professional contexts related to psychology and therapy.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Emotion-focused' is a term primarily used in psychology, counseling, and related fields. It describes approaches or strategies that prioritize understanding, expressing, and managing emotions. The term is often used in contrast to 'problem-focused,' which emphasizes addressing practical issues. Understanding this term requires familiarity with psychological concepts and therapeutic approaches. It is frequently found in academic literature, professional discussions, and specialized contexts related to mental health and well-being."},"example_sentences":[{"sentence":"The study examined the effectiveness of emotion-focused interventions for anxiety.","translation":"その研究は、不安に対する感情焦点型介入の有効性を調査しました。","type":"adjective","meaning_category":"concerned with emotions"},{"sentence":"Emotion-focused support from friends can help individuals cope with stressful life events.","translation":"友人からの感情焦点型のサポートは、個人がストレスの多いライフイベントに対処するのに役立ちます。","type":"adjective","meaning_category":"emotionally supportive"},{"sentence":"Emotion-focused strategies are often used in conjunction with problem-focused approaches.","translation":"感情焦点型戦略は、問題焦点型アプローチと組み合わせて使用​​されることがよくあります。","type":"adjective","meaning_category":"coping strategies"}]}