{"word":"heroinize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(人を)英雄化する、ヒロインのように扱う","english_definition":"To treat or depict someone as a hero or heroine; to idealize or romanticize someone's actions or character.","examples":[{"sentence":"The media tended to heroinize the soldiers returning from war.","translation":"メディアは戦争から帰還した兵士たちを英雄化する傾向があった。"},{"sentence":"She felt that the movie heroinized the criminal, which sent the wrong message.","translation":"彼女はその映画が犯罪者を英雄化していると感じ、間違ったメッセージを送っていると思った。"}],"collocations":["heroinize a soldier (兵士を英雄化する)","heroinize a criminal (犯罪者を英雄化する)","heroinize a historical figure (歴史上の人物を英雄化する)"],"synonyms":["idealize","romanticize","glorify","deify","idolize"],"antonyms":["vilify","demonize","criticize","degrade"]}],"etymology":{"value":"'Heroinize' is derived from 'heroine' (a female hero) + '-ize' (a suffix used to form verbs, meaning 'to make, to treat as'). The word implies the act of making someone or something into a heroine or treating them as such.","priority":"★★★"},"pronunciation":{"ipa":"/ˈhɪroʊɪnaɪz/","syllables":"he-ro-in-ize"},"inflection":{"verb_forms":{"present_simple":["heroinize","heroinizes"],"past_simple":"heroinized","past_participle":"heroinized","present_participle":"heroinizing"}},"usage_notes":{"explanation":"'Heroinize' is used to describe the act of portraying someone as a hero, often in a way that is exaggerated or unrealistic. It can be used critically, suggesting that someone is being unfairly or inappropriately glorified. The term is relatively uncommon and often replaced by synonyms like 'idealize' or 'romanticize'.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The story heroinized the reality of war.","correct":"✓ The story romanticized the reality of war.","note":"While 'heroinize' can be used, 'romanticize' is a more common and natural choice in this context."},{"incorrect":"✗ They are heroinizing about the past.","correct":"✓ They are idealizing the past.","note":"'Heroinize' is a transitive verb, requiring a direct object. 'Idealize' is a more flexible option here."}],"priority":"★★☆"},"related_words":{"derivatives":["heroine (名詞: 女主人公、女傑)","hero (名詞: 英雄)","heroic (形容詞: 英雄的な)","heroism (名詞: 英雄的行為、勇気)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'heroinize' is a relatively uncommon verb that means to portray someone as a hero or heroine, often in an idealized or romanticized way. It's typically used in more formal or academic contexts when discussing how individuals or groups are presented in media, literature, or history. The term carries a critical connotation, suggesting that the portrayal may be unrealistic or overly flattering. It's important to note that the more common synonyms like 'idealize' or 'romanticize' are often preferred.","priority":"★★☆"},"example_sentences":[{"sentence":"The film was criticized for its attempt to heroinize a notorious criminal.","translation":"その映画は悪名高い犯罪者を英雄化しようとしたとして批判された。","type":"general","meaning_category":"英雄化する"},{"sentence":"Some historians argue that we should not heroinize figures from the past without acknowledging their flaws.","translation":"一部の歴史家は、過去の人物の欠点を認めずに英雄化すべきではないと主張している。","type":"general","meaning_category":"英雄化する"},{"sentence":"The novel heroinizes the protagonist, making her seem almost superhuman.","translation":"その小説は主人公を英雄化し、彼女をほとんど超人的に見せている。","type":"general","meaning_category":"英雄化する"}]}