{"word":"moveableness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"可動性、移動性、動きやすさ","english_definition":"The quality or state of being movable; the capability of being moved.","examples":[{"sentence":"The moveableness of the furniture made it easy to rearrange the room.","translation":"家具の可動性のおかげで、部屋の模様替えが簡単だった。"},{"sentence":"Consider the moveableness of the equipment when designing the workspace.","translation":"作業スペースを設計する際には、設備の移動性を考慮してください。"}],"collocations":["improve moveableness (可動性を改善する)","increase moveableness (可動性を高める)","assess moveableness (可動性を評価する)"],"synonyms":["mobility","portability","transportability","maneuverability","flexibility"],"antonyms":["immobility","fixity","stability","immovability"]}],"etymology":{"value":"The word 'moveableness' is derived from 'movable' by adding the suffix '-ness', which transforms an adjective into a noun denoting a state or quality. 'Movable' comes from 'move' + '-able', indicating the capacity to be moved.","priority":"★★☆"},"pronunciation":{"ipa":"/muːvəbəlˈnəs/","syllables":"moo-va-ble-ness"},"inflection":{"noun_plural":"moveablenesses"},"usage_notes":{"explanation":"'Moveableness' is a relatively uncommon noun that refers to the quality of being easily moved or rearranged. It is often used in technical or formal contexts when discussing the design or properties of objects or systems. It is important to note that while 'mobility' is a more common synonym, 'moveableness' specifically emphasizes the capacity for physical relocation or adjustment.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The moveableness is important for the project.","correct":"✓ Moveableness is important for the project.","note":"The word 'moveableness' is already a noun, so adding 'the' before it is often unnecessary unless referring to a specific instance of moveableness."},{"incorrect":"✗ The moveableness of the car is very good.","correct":"✓ The maneuverability of the car is very good.","note":"While 'moveableness' is technically correct, 'maneuverability' is a more common and natural-sounding word to describe the ease with which a car can be moved or controlled."}],"priority":"★★☆"},"related_words":{"derivatives":["movable (adjective)","move (verb)","movement (noun)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'moveableness' is a formal term that describes how easily something can be moved. It's not a word you'd use in everyday conversation, but you might encounter it in technical documents or when discussing the design of something that needs to be easily rearranged. A more common word with a similar meaning is 'mobility,' but 'moveableness' specifically highlights the characteristic of being movable.","priority":"★★☆"},"example_sentences":[{"sentence":"The key to the exhibit's success was the moveableness of the display cases, allowing for frequent rearrangements.","translation":"展示の成功の鍵は、展示ケースの可動性にあり、頻繁な再配置が可能になった。","type":"general","meaning_category":"可動性"},{"sentence":"The designer prioritized the moveableness of the walls to create a flexible office space.","translation":"デザイナーは、柔軟なオフィス空間を作るために、壁の可動性を優先した。","type":"general","meaning_category":"可動性"}]}