{"word":"cosmography","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"宇宙誌、宇宙記述学：宇宙の構造、内容、および起源に関する記述または地図作成の学問。","english_definition":"The science that deals with the general features of the universe, including the earth, and aims at describing and mapping them.","examples":[{"sentence":"Ancient cosmography attempted to explain the arrangement of the heavens and the earth.","translation":"古代の宇宙誌は、天と地の配置を説明しようと試みました。"},{"sentence":"His book is a detailed cosmography of the known world.","translation":"彼の著書は、既知の世界の詳細な宇宙誌です。"}],"collocations":["descriptive cosmography","mathematical cosmography","historical cosmography"],"synonyms":["uranography","astronomy","geography","cartography"],"antonyms":[]}],"etymology":{"value":"ギリシャ語の 'kosmos' (宇宙) + 'graphia' (記述) に由来します。","priority":"★★☆"},"pronunciation":{"ipa":"/kɒzˈmɒɡrəfi/","syllables":"cos-mog-ra-phy"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"Cosmography は、宇宙の記述に焦点を当てた学問であり、しばしば地図作成を含みます。現代の天文学や宇宙論とは異なり、歴史的な宇宙誌は、科学的説明と神話的、宗教的解釈が混ざり合っていることがよくありました。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He studied cosmology, which is the same as cosmography.","correct":"✓ He studied cosmography, which is the description of the universe, not necessarily its physical properties like cosmology.","note":"Cosmology (宇宙論) は宇宙の起源、進化、最終的な運命を研究する物理学の一分野であり、Cosmography (宇宙誌) は宇宙の記述と地図作成を目的とする学問です。"},{"incorrect":"✗ The cosmography showed the planets orbiting around the sun, which was incorrect at that time.","correct":"✓ The cosmography showed the planets orbiting around the Earth, which was the prevailing belief at that time.","note":"歴史的な宇宙誌は、当時の信念体系を反映しているため、必ずしも現代科学の視点から見て正確であるとは限りません。"}],"priority":"★★☆"},"related_words":{"derivatives":["cosmographer (宇宙誌学者)","cosmographic (宇宙誌の)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":null,"frequency_google_ngram":"低頻度","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「cosmography」は、宇宙の構造や内容を記述する学問分野を指す専門用語です。この単語は、歴史的な文脈や、宇宙に関する学問の発展を議論する際に使用されることがあります。現代の天文学や宇宙論とは異なり、cosmographyはより記述的で、初期の宇宙観を反映していることが多いです。この単語は、科学史や地理学の分野でよく見られます。"},"example_sentences":[{"sentence":"Ptolemy's 'Geography' is considered a foundational work of ancient cosmography.","translation":"プトレマイオスの『地理学』は、古代宇宙誌の基礎的な著作とみなされています。","type":"noun","meaning_category":"宇宙誌"},{"sentence":"The cosmography of the medieval period often incorporated religious and philosophical beliefs.","translation":"中世の宇宙誌は、しばしば宗教的および哲学的信念を取り入れていました。","type":"noun","meaning_category":"宇宙誌"},{"sentence":"Early explorers relied on cosmography to create maps of newly discovered lands.","translation":"初期の探検家たちは、新たに発見された土地の地図を作成するために宇宙誌に頼っていました。","type":"noun","meaning_category":"宇宙誌"}]}