{"word":"self-kindness","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自己への優しさ、自分自身に対する思いやり","english_definition":"Extending compassion to oneself when facing inadequacies, failures, or suffering. It involves treating oneself with the same care and understanding that one would offer to a friend in a similar situation.","examples":[{"sentence":"Practicing self-kindness can help reduce stress and improve overall well-being.","translation":"自己への優しさを実践することは、ストレスを軽減し、全体的な幸福感を向上させるのに役立ちます。"},{"sentence":"Instead of criticizing yourself, try approaching the situation with self-kindness.","translation":"自分を批判する代わりに、自己への優しさを持って状況にアプローチしてみてください。"},{"sentence":"Self-kindness is not about being selfish; it's about recognizing your own worth and treating yourself with respect.","translation":"自己への優しさは利己的であることではありません。それは、自分自身の価値を認識し、自分自身を尊重して扱うことです。"}],"collocations":["practice self-kindness (自己への優しさを実践する)","show self-kindness (自己への優しさを示す)","cultivate self-kindness (自己への優しさを育む)","develop self-kindness (自己への優しさを発達させる)","lack self-kindness (自己への優しさが欠けている)"],"synonyms":["self-compassion","self-acceptance","self-love","self-care","self-empathy"],"antonyms":["self-criticism","self-hatred","self-condemnation","self-blame","self-rejection"]}],"etymology":{"value":"The term 'self-kindness' is a compound word formed by combining 'self,' referring to oneself, and 'kindness,' which denotes the quality of being friendly, generous, and considerate. It reflects the act of extending kindness and compassion inward, towards oneself.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌselfˈkaɪndnəs/","syllables":"self-kind-ness"},"inflection":{"noun_plural":null,"notes":"Self-kindness is generally used as an uncountable noun, so it doesn't typically have a plural form."},"usage_notes":{"explanation":"'Self-kindness' is a concept often discussed in psychology and mindfulness practices. It emphasizes the importance of treating oneself with the same understanding, patience, and compassion that one would offer to a friend or loved one. It's particularly relevant when dealing with personal shortcomings, failures, or difficult life circumstances. It's not about self-pity or excusing bad behavior, but rather about acknowledging one's humanity and inherent worth.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She is very self-kindly.","correct":"✓ She practices self-kindness.","note":"'Self-kindness' is a noun, so it's not typically used with adverbs like 'self-kindly'. Instead, use phrases like 'practice self-kindness' or 'show self-kindness'."},{"incorrect":"✗ Self-kindness means you never hold yourself accountable.","correct":"✓ Self-kindness means you treat yourself with compassion while still holding yourself accountable.","note":"Self-kindness is not about avoiding responsibility for one's actions. It's about approaching oneself with understanding and compassion while still acknowledging and addressing one's mistakes."}],"priority":"★★☆"},"related_words":{"derivatives":["kindness (名詞: 優しさ、親切さ)","self (名詞: 自己、自分)","self-compassionate (形容詞: 自己への思いやりのある)"],"idioms_phrases":["treat yourself with kindness (自分自身を優しく扱う)","extend kindness to yourself (自分に優しさを向ける)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (conceptually), C1 (in academic or psychological contexts)","frequency_google_ngram":"Moderately frequent, especially in psychology and self-help literature.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Self-kindness' is a term that describes the practice of being understanding and compassionate towards yourself, especially when you are struggling or feeling inadequate. It involves treating yourself with the same care and concern that you would offer to a friend in a similar situation. It's about recognizing that everyone makes mistakes and that you deserve to be treated with kindness, even when you fall short of your own expectations. This concept is often discussed in the context of mental health and well-being, and it's considered an important aspect of self-care and emotional resilience."},"example_sentences":[{"sentence":"During difficult times, remember to show yourself **self-kindness**.","translation":"困難な時には、自分自身に自己への優しさを示すことを忘れないでください。","type":"noun","meaning_category":"自己への優しさ"},{"sentence":"**Self-kindness** involves accepting your imperfections and treating yourself with compassion.","translation":"自己への優しさとは、自分の不完全さを受け入れ、自分自身を思いやりを持って扱うことです。","type":"noun","meaning_category":"自己への優しさ"},{"sentence":"She learned to cultivate **self-kindness** through mindfulness practices.","translation":"彼女はマインドフルネスの実践を通して、自己への優しさを育むことを学びました。","type":"noun","meaning_category":"自己への優しさ"},{"sentence":"It's important to distinguish **self-kindness** from self-pity.","translation":"自己への優しさと自己憐憫を区別することが重要です。","type":"noun","meaning_category":"自己への優しさ"},{"sentence":"Lacking **self-kindness** can lead to increased stress and anxiety.","translation":"自己への優しさが欠如すると、ストレスや不安が増大する可能性があります。","type":"noun","meaning_category":"自己への優しさ"}]}