{"word":"aedoeology","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"性器の研究、特に男性性器の研究","english_definition":"The study of the genitalia, especially the male genitalia.","examples":[{"sentence":"His research focused on aedoeology, specifically the morphology of the penis.","translation":"彼の研究は性器学、特にペニスの形態に焦点を当てていた。"},{"sentence":"Aedoeology is a subfield of anatomy and sexual biology.","translation":"性器学は解剖学と性生物学の下位分野である。"}],"collocations":["research in aedoeology","study of aedoeology","field of aedoeology"],"synonyms":["phallology","genital morphology"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words αἰδοῖα (aidoia) meaning 'genitals' and -λογία (-logia) meaning 'study of'.","priority":"★★☆"},"pronunciation":{"ipa":"ˌiːdiːˈɒlədʒi","syllables":"ee-dee-ol-o-gy"},"inflection":{"noun_plural":"aedoeologies"},"usage_notes":{"explanation":"Aedoeology is a specialized term primarily used in academic and scientific contexts. It is not commonly used in everyday language. The term phallology is a close synonym, though aedoeology has a broader scope, encompassing the study of all genitalia, not just the penis.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an aedoeologist of flowers.","correct":"✓ He is an aedoeologist specializing in male genitalia.","note":"Aedoeology specifically refers to the study of genitalia, not other biological structures like flowers."}],"priority":"★★☆"},"related_words":{"derivatives":["aedoeologist (noun: a person who studies aedoeology)"],"phrasal_verbs":[],"related_terms":["anatomy","sexual biology","phallology","genitalia","penis","morphology"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low Frequency - Specialized academic term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Aedoeology' is a highly specialized term primarily encountered within academic and scientific disciplines, specifically in the fields of anatomy, sexual biology, and related areas. Its usage is confined to discussions and research concerning the study of genitalia, particularly male genitalia. Due to its technical nature and limited application, it is not commonly found in general texts or everyday conversation. Understanding this term is relevant for those engaged in advanced studies or research within these specific scientific domains."},"example_sentences":[{"sentence":"The conference included a session on recent advances in aedoeology.","translation":"会議には、性器学における最近の進歩に関するセッションが含まれていた。","type":"noun","meaning_category":"study of genitalia"},{"sentence":"His doctoral thesis was a detailed analysis of aedoeology across different species.","translation":"彼の博士論文は、異なる種における性器学の詳細な分析であった。","type":"noun","meaning_category":"study of genitalia"}]}