{"word":"Thanatism","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"死滅説、死後滅亡説","english_definition":"The belief that death is the absolute end of existence; the doctrine that the soul perishes with the body.","examples":[{"sentence":"Thanatism denies the existence of an afterlife.","translation":"死滅説は死後の世界の存在を否定する。"},{"sentence":"Some philosophical schools embrace a form of thanatism.","translation":"いくつかの哲学学派は死滅説の一形態を受け入れている。"}],"collocations":["embrace thanatism","deny thanatism","philosophical thanatism"],"synonyms":["annihilationism","mortalism"],"antonyms":["immortalism","survivalism"]},{"part_of_speech":"noun","definition":"(比喩的に) 破壊主義、滅亡主義","english_definition":"(Figuratively) A tendency towards destruction or self-destruction.","examples":[{"sentence":"The leader's policies reflected a certain thanatism, leading to the country's decline.","translation":"その指導者の政策はある種の滅亡主義を反映しており、国の衰退につながった。"}],"collocations":["political thanatism","social thanatism"],"synonyms":["destructivism","nihilism"],"antonyms":["constructivism","preservationism"]}],"etymology":{"value":"Derived from the Greek word 'thanatos' (θάνατος) meaning 'death', with the suffix '-ism' indicating a belief, doctrine, or principle.","priority":"★★★"},"pronunciation":{"ipa":"/ˈθænəˌtɪzəm/","syllables":"Tha-na-tism"},"inflection":{"noun_plural":"Thanatisms"},"usage_notes":{"explanation":"'Thanatism' primarily refers to the philosophical or religious belief that death is the final end of existence, with no afterlife or survival of the soul. It can also be used metaphorically to describe a destructive or self-destructive tendency. The term is relatively rare in common usage.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He practiced thanatism by meditating on life.","correct":"✓ He contemplated thanatism by meditating on death.","note":"Thanatism is a belief, not a practice. Contemplation or study is more appropriate than practice."},{"incorrect":"✗ Thanatism is the same as euthanasia.","correct":"✓ Thanatism is a belief about the nature of death, while euthanasia is the practice of intentionally ending a life to relieve pain and suffering.","note":"Thanatism is a philosophical belief, while euthanasia is a medical practice."}],"priority":"★★☆"},"related_words":{"derivatives":["thanatist (noun: a believer in thanatism)","thanatophobia (noun: fear of death)"],"phrases":["thanatotic (adjective: relating to death or dying)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Thanatism' is a rare and specialized term primarily used in philosophy and theology to describe the belief that death is the absolute end of existence. It is not commonly used in everyday conversation. Understanding requires familiarity with philosophical concepts related to death and the afterlife."},"example_sentences":[{"sentence":"The ancient materialists often espoused a form of thanatism.","translation":"古代の唯物論者はしばしば死滅説の一形態を支持した。","type":"philosophical belief","meaning_category":"death is the end"},{"sentence":"His policies were criticized as a form of political thanatism, leading to societal collapse.","translation":"彼の政策は政治的滅亡主義の一形態として批判され、社会崩壊につながった。","type":"figurative","meaning_category":"destruction"}]}