{"word":"Sammael","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"サマエル（ユダヤ教の伝承における天使の名前。しばしば死の天使、告発者、誘惑者として言及される）","english_definition":"(In Jewish tradition) the name of an angel, often referred to as the Angel of Death, an accuser, or a seducer.","examples":[{"sentence":"Sammael is considered a significant figure in some Kabbalistic texts.","translation":"サマエルはカバラのいくつかの文献において重要な人物とみなされている。"},{"sentence":"Some traditions associate Sammael with the serpent in the Garden of Eden.","translation":"一部の伝承では、サマエルはエデンの園の蛇と関連付けられている。"}],"collocations":["Angel Sammael (天使サマエル)","Sammael in Kabbalah (カバラにおけるサマエル)","Sammael and Lilith (サマエルとリリス)"],"synonyms":["Angel of Death","Accuser","Satan (一部の解釈)"],"antonyms":[]}],"etymology":{"value":"ヘブライ語の סַמָּאֵל (Sammael) に由来すると考えられている。語源的には「神の毒」または「盲目の神」を意味すると解釈されることがある。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsæmiːˌɛl/","syllables":"Sam-ma-el"},"inflection":{"notes":"固有名詞のため、複数形はありません。"},"usage_notes":{"explanation":"「**Sammael**」は、ユダヤ教の神秘主義（カバラ）や一部の伝承に登場する天使の名前です。その性格や役割は文献によって異なり、死の天使、告発者、誘惑者、あるいは神の怒りを執行する存在として描かれることがあります。一部の解釈では、サタンと同一視されることもあります。一般的なユダヤ教の教義においては、サマエルは必ずしも悪の存在として描かれているわけではなく、神の計画における役割を果たす存在として捉えられることもあります。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Sammael is a demon in all Jewish traditions.","correct":"✓ Sammael's role varies; he is not always considered a demon.","note":"サマエルは必ずしも悪魔として描かれるわけではありません。伝承によって役割が異なります。"},{"incorrect":"✗ Sammael is the same as Michael.","correct":"✓ Sammael and Michael are different angels with different roles.","note":"サマエルとミカエルは異なる天使であり、役割も異なります。"}],"priority":"★★☆"},"related_words":{"derivatives":["Samael (異綴)"],"related_figures":["Lilith (リリス - サマエルの配偶者とされることがある)","Michael (ミカエル - 天使。サマエルと対立する存在として描かれることがある)","Gabriel (ガブリエル - 天使)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"低頻度 (Low frequency) - 特定の宗教的・神秘主義的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Sammael**」は、ユダヤ教の神秘主義や伝承に登場する天使の名前であり、一般的には馴染みのない単語です。カバラなどの特定の宗教的・神秘主義的な文脈でのみ言及されるため、一般的な英語の語彙としては頻度が低く、高度な理解を要します。関連する宗教的・文化的背景知識がないと、意味を理解することは難しいでしょう。"},"example_sentences":[{"sentence":"The figure of Sammael is complex and subject to various interpretations.","translation":"サマエルの人物像は複雑であり、さまざまな解釈の対象となる。","type":"noun","meaning_category":"天使の名前"},{"sentence":"In some esoteric traditions, Sammael is seen as a force of divine judgment.","translation":"一部の秘教的な伝承では、サマエルは神の裁きの力として見なされる。","type":"noun","meaning_category":"天使の名前"},{"sentence":"The story of Sammael and Lilith is a recurring theme in Jewish folklore.","translation":"サマエルとリリスの物語は、ユダヤの民間伝承における繰り返されるテーマである。","type":"noun","meaning_category":"天使の名前"}]}