{"word":"Puritaness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"女性のピューリタン、ピューリタン的な女性","english_definition":"A female Puritan; a woman with Puritanical beliefs or behaviors.","examples":[{"sentence":"She was described as a Puritaness due to her strict moral code.","translation":"彼女は厳格な道徳規範のためにピューリタン的な女性だと評された。"},{"sentence":"The Puritaness upheld the values of hard work and piety.","translation":"そのピューリタン的な女性は勤勉と敬虔さの価値観を擁護した。"}],"collocations":["strict Puritaness","devout Puritaness"],"synonyms":["Puritan woman","moralist","prude"],"antonyms":["libertine","hedonist"]}],"etymology":{"value":"Derived from 'Puritan' (a member of a religious reform movement in the late 16th and 17th centuries) with the addition of the feminine suffix '-ess'.","priority":"★★★"},"pronunciation":{"ipa":"/ˌpjʊərɪˈtænəs/","syllables":"Pu-ri-tan-ess"},"inflection":{"noun_plural":"Puritanesses"},"usage_notes":{"explanation":"The term 'Puritaness' specifically denotes a female adherent to Puritan beliefs or someone exhibiting Puritanical characteristics. It is less commonly used than 'Puritan' and can sometimes carry a slightly pejorative connotation, implying excessive strictness or prudery.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a puritaness, therefore she is from the 17th century.","correct":"✓ She is a puritaness, meaning she has very strict moral beliefs.","note":"While Puritanism was a historical movement, 'puritaness' can also refer to a modern woman with similar beliefs."}],"priority":"★☆☆"},"related_words":{"derivatives":["Puritan","Puritanical","Puritanism"],"related_terms":["prude","moralist","Victorian"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Puritaness' is a relatively uncommon term used to describe a woman who adheres to Puritanical beliefs or exhibits Puritanical characteristics. Understanding the historical context of Puritanism is helpful in interpreting the meaning of this word. It often implies a strict adherence to moral and religious principles, sometimes to an excessive degree."},"example_sentences":[{"sentence":"The novel portrayed her as a rigid Puritaness, unyielding in her convictions.","translation":"その小説は彼女を、信念に固執する厳格なピューリタン的な女性として描いた。","type":"general"},{"sentence":"Some viewed her as a virtuous woman, while others saw her as an old-fashioned Puritaness.","translation":"彼女を貞淑な女性と見る人もいれば、古風なピューリタン的な女性と見る人もいた。","type":"general"}]}