{"word":"muriciform","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(生物学) いぼ状の、桑の実状の","english_definition":"(biology) Having a surface resembling that of a mulberry; covered with short, conical projections.","examples":[{"sentence":"The spores of this fungus are muriciform.","translation":"この菌の胞子は桑の実状である。"},{"sentence":"The muriciform surface provides a large surface area.","translation":"そのいぼ状の表面は大きな表面積を提供する。"}],"collocations":["muriciform spore","muriciform surface"],"synonyms":["warty","tuberculate","papillate"],"antonyms":["smooth","glabrous"]}],"etymology":{"value":"From Latin 'mūricus' (a kind of shellfish, also used to refer to warty growths) + '-form' (having the form of). The resemblance to a mulberry fruit comes from the warty or bumpy appearance.","priority":"★★☆"},"pronunciation":{"ipa":"/mjʊˈrɪsɪˌfɔːrm/","syllables":"mu-ri-ci-form"},"inflection":{"notes":"Does not inflect.","adjective_forms":{}},"usage_notes":{"explanation":"'Muriciform' is a technical term used primarily in biology, especially in mycology (the study of fungi) and botany, to describe structures that have a bumpy or warty surface resembling a mulberry fruit. It is not a commonly used word in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The skin was muriciform and soft.","correct":"✓ The skin was rough and muriciform.","note":"'Muriciform' implies a rough or bumpy texture, so it is not usually associated with softness."}],"priority":"☆☆☆"},"related_words":{"derivatives":[],"related_terms":["mulberry","wart","tubercles"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'muriciform' is a highly specialized term used in scientific contexts, particularly in biology. It describes a surface texture resembling that of a mulberry fruit, characterized by numerous small, bumpy projections. Due to its specialized nature, it is unlikely to be encountered outside of scientific literature or discussions. Understanding this word requires a background in biology or a strong interest in scientific terminology."},"example_sentences":[{"sentence":"Under the microscope, the fungal spores appeared distinctly muriciform.","translation":"顕微鏡下では、その菌の胞子は明らかに桑の実状に見えた。","type":"general","meaning_category":"description"},{"sentence":"The muriciform texture of the seed coat aids in dispersal by animals.","translation":"種皮の桑の実状の質感は、動物による散布を助ける。","type":"general","meaning_category":"function"}]}