{"word":"semibejan","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(古語、歴史) 洗礼を受けていない人、特に異教徒の子供","english_definition":"(archaic, historical) A person who has not been baptized, especially a pagan child.","examples":[{"sentence":"In medieval times, a semibejan was believed to be in limbo if they died.","translation":"中世において、洗礼を受けていない人は死後、辺獄にいると信じられていた。"}],"collocations":[],"synonyms":["unbaptized","pagan","heathen"],"antonyms":["baptized","Christian"]},{"part_of_speech":"adjective","definition":"(古語、歴史) 洗礼を受けていない、または洗礼を受けていない人に属する","english_definition":"(archaic, historical) Not baptized, or relating to a person who has not been baptized.","examples":[{"sentence":"The semibejan population decreased as Christianity spread.","translation":"キリスト教の普及とともに、洗礼を受けていない人々の人口は減少した。"}],"collocations":[],"synonyms":["unbaptized","pagan","heathen"],"antonyms":["baptized","Christian"]}],"etymology":{"value":"From semi- + bejan. 'Bejan' is an archaic term for a novice or beginner, especially in a university context, derived from the French 'besoin' (need), referring to someone in need of instruction. The 'semi-' prefix indicates 'half' or 'partially', thus 'semibejan' suggests someone partially initiated or not fully Christianized through baptism.","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɛmiˈbiːdʒən/","syllables":"se-mi-be-jan"},"inflection":{},"usage_notes":{"explanation":"The term 'semibejan' is highly archaic and rarely used in modern English. It primarily appears in historical contexts related to religious practices and beliefs, particularly concerning baptism and the status of unbaptized individuals, especially children, in Christian theology. The term reflects a historical worldview where baptism was considered essential for salvation.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":[],"related_terms":["limbo (辺獄)","baptism (洗礼)","pagan (異教徒)","heathen (異教徒)"],"priority":"★★★"},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Extremely rare.","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"The word 'semibejan' is an extremely rare and archaic term, primarily found in historical or theological texts. Understanding requires knowledge of historical religious practices and beliefs concerning baptism. Due to its rarity, it is unlikely to be encountered in general usage.","priority":"★★★"},"example_sentences":[{"sentence":"The fate of semibejan children was a subject of much debate among theologians.","translation":"洗礼を受けていない子供たちの運命は、神学者たちの間で多くの議論の対象となった。","type":"noun","meaning_category":"洗礼を受けていない人"},{"sentence":"The missionaries aimed to convert the semibejan tribes to Christianity.","translation":"宣教師たちは、洗礼を受けていない部族をキリスト教に改宗させることを目指した。","type":"adjective","meaning_category":"洗礼を受けていない"}]}