{"word":"Rett","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"レット症候群 (主に女児に発症する神経発達障害)","english_definition":"A neurodevelopmental disorder primarily affecting girls, characterized by normal early development followed by a slowing of development, loss of purposeful use of hands, distinctive hand movements, slowed brain and head growth, seizures, and intellectual disability.","examples":[{"sentence":"Rett syndrome is caused by mutations in the MECP2 gene.","translation":"レット症候群はMECP2遺伝子の変異によって引き起こされる。"},{"sentence":"Early diagnosis of Rett syndrome is crucial for providing appropriate support and therapies.","translation":"レット症候群の早期診断は、適切な支援と治療を提供する上で重要である。"}],"collocations":["Rett syndrome","MECP2 gene","neurodevelopmental disorder","genetic mutation","early diagnosis","therapy","support"],"synonyms":["RTT (abbreviation)"],"antonyms":[]}],"etymology":{"value":"Named after Andreas Rett, an Austrian pediatrician who first described the syndrome in 1966.","priority":"★★★"},"pronunciation":{"ipa":"/rɛt/","syllables":"Rett"},"inflection":{"notes":"単数形"},"usage_notes":{"explanation":"\"Rett\" is primarily used as part of the term \"Rett syndrome.\" It is rarely used in isolation. When referring to the condition, it is important to use the full term \"Rett syndrome\" for clarity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She has Rett.","correct":"✓ She has Rett syndrome.","note":"Always use \"Rett syndrome\" instead of just \"Rett\" when referring to the condition."}],"priority":"★★★"},"related_words":{"derivatives":["Rett syndrome-like disorders"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Specialized medical term)","frequency_google_ngram":"Low frequency (専門用語)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Rett\" is a highly specialized medical term referring to Rett syndrome, a rare neurodevelopmental disorder. Understanding this term requires familiarity with medical terminology and genetics. It is typically encountered in medical contexts or discussions related to genetic disorders. The term itself is not commonly used in everyday conversation outside of medical or research settings."},"example_sentences":[{"sentence":"The doctor suspected Rett syndrome based on the child's symptoms.","translation":"医師は子供の症状からレット症候群を疑った。","type":"noun","meaning_category":"病名"},{"sentence":"Research into the MECP2 gene is crucial for understanding Rett syndrome.","translation":"MECP2遺伝子の研究は、レット症候群の理解に不可欠である。","type":"noun","meaning_category":"病名"}]}