{"word":"overcategorize","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"過剰に分類する、細かく分類しすぎる","english_definition":"To categorize excessively or in too much detail.","examples":[{"sentence":"The report overcategorized the data, making it difficult to see the overall trends.","translation":"その報告書はデータを過剰に分類したため、全体的な傾向が把握しにくくなった。"},{"sentence":"The software tends to overcategorize customer feedback, creating unnecessary complexity.","translation":"そのソフトウェアは顧客からのフィードバックを過剰に分類する傾向があり、不必要な複雑さを生み出している。"}],"collocations":["overcategorize data","overcategorize information","overcategorize feedback"],"synonyms":["overclassify","overanalyze","overspecify"],"antonyms":["generalize","simplify","underclassify"]}],"etymology":{"value":"\"over-\" (過剰に) + \"categorize\" (分類する)","priority":"★★★"},"pronunciation":{"ipa":"/ˌoʊvərˈkætəɡəˌraɪz/","syllables":"o-ver-cat-e-go-rize"},"inflection":{"verb_forms":{"present_simple":["overcategorize","overcategorizes"],"past_simple":"overcategorized","past_participle":"overcategorized","present_participle":"overcategorizing"}},"usage_notes":{"explanation":"\"Overcategorize\" means to divide something into too many categories or to make the categories too specific. It often implies that this excessive categorization is unnecessary or makes the information harder to understand or use.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The system overcategorizes, it's difficult to use.","correct":"✓ Because the system overcategorizes, it's difficult to use. / ✓ The system overcategorizes, making it difficult to use.","note":"When using \"overcategorize\" to explain why something is difficult, ensure the sentence structure is correct. Use a conjunction like \"because\" or a participle phrase like \"making it difficult.\""}],"priority":"★★☆"},"related_words":{"derivatives":["overcategorization (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"\"Overcategorize\" is a relatively uncommon word that means to classify something in too much detail. It's used in contexts where excessive categorization leads to confusion or inefficiency. It is formed by adding the prefix \"over-\" to the verb \"categorize,\" indicating an excess of categorization."},"example_sentences":[{"sentence":"The museum's website overcategorizes its collection, making it hard to browse.","translation":"その美術館のウェブサイトはコレクションを過剰に分類しているため、閲覧しにくい。","type":"general","meaning_category":"過剰に分類する"},{"sentence":"The researcher was criticized for overcategorizing the responses in the survey.","translation":"研究者は、アンケートの回答を過剰に分類したとして批判された。","type":"academic","meaning_category":"過剰に分類する"}]}