{"word":"anemograph","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"自記風力計","english_definition":"An instrument for recording the velocity and direction of the wind.","examples":[{"sentence":"The anemograph recorded the highest wind speed of the year during the storm.","translation":"その自記風力計は、嵐の間に今年の最高風速を記録した。"},{"sentence":"Anemographs are used in weather stations to monitor wind patterns.","translation":"自記風力計は、気象観測所で風のパターンを監視するために使用されている。"}],"collocations":["record wind speed","monitor wind patterns","weather station","data analysis"],"synonyms":["wind recorder","wind-recording instrument"],"antonyms":[]}],"etymology":{"value":"From Greek *anemos* (wind) + *graph* (writing, recording).","priority":"★★☆"},"pronunciation":{"ipa":"/əˈnɛməˌɡræf/","syllables":"a-ne-mo-graph"},"inflection":{"noun_plural":"anemographs"},"usage_notes":{"explanation":"An anemograph is a type of anemometer that records wind speed and direction over a period of time, typically using a rotating vane or cups to measure wind speed and a compass to determine wind direction. The data is usually recorded on a chart or digitally.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The anemograph measures the temperature.","correct":"✓ The anemograph measures the wind speed and direction.","note":"An anemograph specifically measures wind speed and direction, not temperature."},{"incorrect":"✗ An anemograph is a person who studies wind.","correct":"✓ An anemograph is an instrument that records wind speed and direction.","note":"An anemograph is an instrument, not a person."}],"priority":"★★☆"},"related_words":{"derivatives":["anemometer","anemography"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"An anemograph is a specialized instrument used in meteorology to record wind speed and direction over time. It's more complex than a simple anemometer, which only measures wind speed. Understanding this term requires some knowledge of scientific instruments and weather monitoring. It's not commonly used in everyday conversation."},"example_sentences":[{"sentence":"The meteorologist examined the data from the anemograph to predict the storm's path.","translation":"気象学者は、嵐の経路を予測するために自記風力計からのデータを調べた。","type":"noun","meaning_category":"instrument"},{"sentence":"The old anemograph needed calibration to ensure accurate readings.","translation":"正確な測定を保証するために、古い自記風力計は校正が必要だった。","type":"noun","meaning_category":"instrument"}]}