{"word":"fistulous","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"瘻孔（ろうこう）のある、瘻孔性の","english_definition":"relating to or having the nature of a fistula.","examples":[{"sentence":"The patient presented with a fistulous tract near the surgical site.","translation":"患者は手術部位付近に瘻孔を伴う瘻管を呈した。"},{"sentence":"Fistulous openings were observed during the examination.","translation":"診察中に瘻孔性の開口部が観察された。"}],"collocations":["fistulous tract (瘻孔管)","fistulous opening (瘻孔口)","fistulous communication (瘻孔性の交通)"],"synonyms":["fistular"],"antonyms":["nonfistulous"]}],"etymology":{"value":"Late Middle English: from Latin *fistulosus*, from *fistula* 'pipe, fistula'.","priority":"★★☆"},"pronunciation":{"ipa":"ˈfɪstʃələs","syllables":"fis-tu-lous"},"inflection":{"notes":"No specific inflectional forms beyond the adjective itself."},"usage_notes":{"explanation":"'Fistulous' is a medical term used to describe something related to or having the characteristics of a fistula, which is an abnormal connection or passageway between two organs, vessels, or other structures that are not normally connected. It is a relatively uncommon word, primarily used in medical contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The wound was fistulous, so we cleaned it.","correct":"✓ The wound had a fistula, so we cleaned it.","note":"'Fistulous' describes the *nature* of something being related to a fistula, not the presence of a fistula itself. To describe the presence, use 'had a fistula'."}],"priority":"★★☆"},"related_words":{"derivatives":["fistula (noun: 瘻孔)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. Primarily a medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Fistulous' is a highly specialized medical term. Understanding requires knowledge of medical terminology, specifically the term 'fistula'. Due to its limited use to medical contexts, it is considered an advanced vocabulary word."},"example_sentences":[{"sentence":"The X-ray revealed a fistulous connection between the bowel and the bladder.","translation":"レントゲン検査で、腸と膀胱の間の瘻孔性のつながりが明らかになった。","type":"adjective","meaning_category":"瘻孔のある"},{"sentence":"Surgical intervention is often required to correct fistulous conditions.","translation":"瘻孔性の状態を改善するためには、外科的介入が必要となることが多い。","type":"adjective","meaning_category":"瘻孔性の"}]}