{"word":"Occidentalophobic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"西洋嫌いの、欧米嫌いの","english_definition":"Having or showing a dislike or fear of Western cultures, people, or things.","examples":[{"sentence":"The article discussed the rise of Occidentalophobic sentiment in some parts of the world.","translation":"その記事は、世界のいくつかの地域における西洋嫌いの感情の高まりについて論じた。"},{"sentence":"He was accused of being Occidentalophobic because of his criticisms of Western foreign policy.","translation":"彼は西洋の外交政策を批判したため、西洋嫌いであると非難された。"}],"collocations":["Occidentalophobic sentiment","Occidentalophobic rhetoric","Occidentalophobic views"],"synonyms":["anti-Western","anti-European","anti-American"],"antonyms":["Occidentalophilic","pro-Western"]},{"part_of_speech":"noun","definition":"西洋嫌いの人、欧米嫌いの人","english_definition":"A person who dislikes or fears Western cultures, people, or things.","examples":[{"sentence":"Some argue that he is not truly Occidentalophobic, but simply critical of certain Western practices.","translation":"彼が本当に西洋嫌いなのではなく、単に特定の西洋の慣習を批判しているだけだと主張する人もいる。"},{"sentence":"The group was labeled as Occidentalophobic due to their protests against globalization.","translation":"そのグループは、グローバル化に対する抗議活動のために西洋嫌いだとレッテルを貼られた。"}],"collocations":["self-identified Occidentalophobe"],"synonyms":["anti-Westerner","anti-Europeanist","anti-Americanist"],"antonyms":["Occidentalophile","pro-Westerner"]}],"etymology":{"value":"From 'Occidental' (relating to the West) + 'phobia' (fear or dislike) + '-ic' (forming an adjective).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɒk.sɪˌden.təˈloʊ.fəbɪk/","syllables":"Oc-ci-den-to-pho-bic"},"inflection":{"noun_form":"Occidentalophobia"},"usage_notes":{"explanation":"'Occidentalophobic' describes a strong aversion or dislike towards Western culture, people, or ideas. It is often used in political or cultural discussions to describe individuals or groups who are critical of Western influence or dominance. The term can be controversial, as it may be seen as an oversimplification or a way to dismiss legitimate criticisms of the West.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is occidentalophobic with Japanese culture.","correct":"✓ He is occidentalophobic. / ✓ He is familiar with Japanese culture.","note":"'Occidentalophobic' describes a dislike of Western culture, not an affinity for other cultures. The sentence should either state he is occidentalophobic in general, or that he is familiar with Japanese culture."}],"priority":"★☆☆"},"related_words":{"derivatives":["Occidentalophobia (noun)"],"phrases":["cultural relativism","anti-imperialism","decolonization"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'Occidentalophobic' is a complex term used to describe a strong dislike or fear of Western cultures, people, or things. It is often used in academic or political contexts to discuss cultural biases or criticisms of Western influence. Because it is a relatively rare and specialized term, it is more likely to be encountered in advanced reading materials or discussions."},"example_sentences":[{"sentence":"Some critics argue that certain policies are driven by Occidentalophobic sentiments.","translation":"一部の批評家は、特定の政策が西洋嫌いの感情によって推進されていると主張している。","type":"adjective","meaning_category":"西洋嫌いの"},{"sentence":"The author explores the roots of Occidentalophobia in post-colonial societies.","translation":"著者は、植民地後の社会における西洋嫌いの根源を探求している。","type":"noun","meaning_category":"西洋嫌いの人"}]}