{"word":"nonebullience","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"Lack of enthusiasm or exuberance; a state of being not effervescent or lively.","english_definition":"The absence of enthusiasm, exuberance, or effervescence; a state of being not lively or spirited.","examples":[{"sentence":"His nonebullience at the party was noticeable; he seemed withdrawn and uninterested.","translation":"パーティーでの彼の元気のなさは目立った。彼は引きこもりがちで、興味がないようだった。"},{"sentence":"The team's nonebullience after their loss was understandable, but they needed to regain their spirit for the next game.","translation":"敗北後のチームの元気のなさは理解できるが、次の試合に向けて気持ちを立て直す必要があった。"}],"collocations":["display nonebullience","notice nonebullience","general nonebullience"],"synonyms":["apathy","indifference","lethargy","listlessness","lack of enthusiasm","lack of exuberance"],"antonyms":["ebullience","enthusiasm","exuberance","vivacity","liveliness","spiritedness"]}],"etymology":{"value":"Formed by adding the prefix 'non-' (meaning 'not') to 'ebullience'. 'Ebullience' comes from the Latin 'ebullire,' meaning 'to bubble out or boil over.'","priority":"★★☆"},"pronunciation":{"ipa":"/nɒnˈbʊliəns/","syllables":"non-bul-i-ence"},"inflection":{"noun_plural":"nonebulliences"},"usage_notes":{"explanation":"'Nonebullience' describes a state characterized by a lack of energy, excitement, or bubbling enthusiasm. It is often used to describe a temporary emotional state in response to a specific event or situation. It is relatively uncommon in everyday conversation but may be used in more formal or descriptive contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a great nonebullience.","correct":"✓ He showed great nonebullience.","note":"'Nonebullience' is a lack of something, so it is not usually described as 'great' or 'small.' Instead, focus on describing the degree of the absence of enthusiasm."},{"incorrect":"✗ The nonebullience was caused by the ebullience.","correct":"✓ The nonebullience was caused by the disappointment.","note":"'Nonebullience' is the opposite of 'ebullience,' so it cannot be caused by it. It is usually caused by something that dampens spirits, such as disappointment or sadness."}],"priority":"★★☆"},"related_words":{"derivatives":["nonebullient (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Nonebullience' is a relatively rare and formal word that describes the absence of enthusiasm or exuberance. It is formed by adding the prefix 'non-' to 'ebullience,' which means high spirits or liveliness. The word is typically used in descriptive or analytical contexts to denote a lack of energy or excitement, often in response to a specific situation or event. Due to its rarity and formality, it is more likely to be encountered in written texts or formal discussions rather than in everyday conversation."},"example_sentences":[{"sentence":"The team's nonebullience was palpable after their unexpected defeat.","translation":"予期せぬ敗北の後、チームの元気のなさは明らかだった。","type":"noun","meaning_category":"Lack of enthusiasm"},{"sentence":"His general nonebullience made it difficult to motivate the other members of the group.","translation":"彼の全体的な元気のなさは、グループの他のメンバーをやる気にさせるのを困難にした。","type":"noun","meaning_category":"Lack of exuberance"}]}