{"word":"AAMSI","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(computing, Windows) Anti-Malware Scan Interface; a Windows component that allows applications and services to send requests to any registered anti-malware product to scan for malicious software.","english_definition":"A Windows component that allows applications and services to send requests to any registered anti-malware product to scan for malicious software.","examples":[{"sentence":"AAMSI helps detect malicious scripts and macros.","translation":"AAMSIは悪意のあるスクリプトとマクロの検出に役立ちます。"},{"sentence":"Bypassing AAMSI is a common technique used by malware.","translation":"AAMSIをバイパスすることは、マルウェアによって使用される一般的な手法です。"}],"collocations":["AAMSI bypass","AAMSI integration","AAMSI provider"],"synonyms":["Anti-Malware Scan Interface"],"antonyms":[]}],"etymology":{"value":"Acronym for Anti-Malware Scan Interface.","priority":"★★★"},"pronunciation":{"ipa":"/ˈæmzi/","syllables":"AAM-SI"},"inflection":{"notes":"This is an acronym, so it doesn't inflect."},"usage_notes":{"explanation":"AAMSI is a security feature in Windows operating systems. It is used by applications, such as Office, to send data to anti-malware products for scanning. This helps to prevent malicious code from running on the system.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The AAMSI is a software.","correct":"✓ AAMSI is an interface.","note":"AAMSI is an interface, not a software program itself."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["anti-malware","malware","Windows","API","security"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency. Technical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"AAMSI (Anti-Malware Scan Interface) is a technical term related to Windows operating systems and cybersecurity. It is an interface that allows applications to request scans for malware from registered anti-malware products. Understanding AAMSI requires familiarity with Windows security architecture and anti-malware concepts."},"example_sentences":[{"sentence":"The application uses AAMSI to scan for potentially harmful scripts.","translation":"このアプリケーションはAAMSIを使用して、潜在的に有害なスクリプトをスキャンします。","type":"general","meaning_category":"Definition"},{"sentence":"Attackers often attempt to bypass AAMSI to execute malicious code undetected.","translation":"攻撃者は、検出されずに悪意のあるコードを実行するために、AAMSIをバイパスしようとすることがよくあります。","type":"security","meaning_category":"Security"}]}