{"word":"predevise","priority":"★☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(計画・策略などを)前もって考案する、事前に計画する","english_definition":"to devise or plan beforehand; to contrive or scheme in advance.","examples":[{"sentence":"They predevised a plan to rob the bank.","translation":"彼らは銀行を襲う計画を前もって考案した。"},{"sentence":"The company predevised a marketing strategy to launch the new product.","translation":"その会社は新製品を発売するために、マーケティング戦略を事前に計画した。"}],"collocations":["predevise a plan","predevise a strategy","predevise a scheme","predevise a method"],"synonyms":["preplan","prearrange","precontrive","foreshadow","anticipate","design beforehand"],"antonyms":["improvise","extemporize","ad-lib"]}],"etymology":{"value":"\"pre-\" (before) + \"devise\" (to plan, invent). The word indicates the act of planning or inventing something before it is needed or executed.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌpriːdɪˈvaɪz/","syllables":"pre-de-vise"},"inflection":{"verb_forms":{"present_simple":["predevise","predevises"],"past_simple":"predevised","past_participle":"predevised","present_participle":"predevising"}},"usage_notes":{"explanation":"\"Predevise\" is a relatively uncommon word, suggesting a deliberate and often secretive planning process. It implies a level of forethought and preparation that goes beyond simple planning. It is often used in contexts where the plan is complex or involves some degree of deception.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He predevised to go to the store.","correct":"✓ He predevised a plan to go to the store.","note":"\"Predevise\" typically requires a direct object, such as a plan, strategy, or scheme. It is not usually followed directly by an infinitive."}],"priority":"★★☆"},"related_words":{"derivatives":["deviser (noun): a person who devises or invents something.","device (noun): a thing made or adapted for a particular purpose, especially a piece of mechanical or electronic equipment."],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Predevise\" is a formal and uncommon word that means to plan something in advance, often with a specific purpose or strategy in mind. It suggests a level of detailed planning and forethought. Because of its rarity, it is more likely to be encountered in formal writing or specialized contexts. Understanding the prefix \"pre-\" (before) and the root word \"devise\" (to plan or invent) can help in understanding the meaning of \"predevise.\""},"example_sentences":[{"sentence":"The rebels had predevised a complex strategy to overthrow the government.","translation":"反乱軍は政府を打倒するための複雑な戦略を事前に考案していた。","type":"verb","meaning_category":"plan beforehand"},{"sentence":"The architect predevised the design of the building to withstand earthquakes.","translation":"建築家は地震に耐えられるように建物の設計を事前に考案した。","type":"verb","meaning_category":"plan beforehand"},{"sentence":"The con artists predevised an elaborate scheme to defraud investors.","translation":"詐欺師たちは投資家を欺くための手の込んだ計画を事前に考案した。","type":"verb","meaning_category":"plan beforehand"}]}