{"word":"monoraciality","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"単一人種であること、または単一人種であるという状態","english_definition":"The state or condition of being of only one race.","examples":[{"sentence":"The study focused on the experiences of individuals who identify with monoraciality.","translation":"その研究は、単一人種であると認識する個人の経験に焦点を当てた。"},{"sentence":"Monoraciality is often contrasted with multiraciality or biraciality.","translation":"単一人種性は、しばしば多民族性や二重人種性と対比される。"}],"collocations":["identify with monoraciality","contrast with multiraciality"],"synonyms":["single-race identity"],"antonyms":["multiraciality","biraciality"]}],"etymology":{"value":"Derived from 'monoracial,' which combines 'mono-' (meaning 'one') with 'racial' (relating to race) and the suffix '-ity' indicating a state or condition.","priority":"Medium"},"pronunciation":{"ipa":"/ˌmɒnoʊreɪˈʃæləti/","syllables":"mo-no-ra-ci-al-i-ty"},"inflection":{"noun_plural":"monoracialities"},"usage_notes":{"explanation":"'Monoraciality' is a term used in discussions of race and identity, particularly in contrast to multiraciality. It refers to individuals who identify with or are perceived as belonging to a single racial group. The term is often used in academic and sociological contexts.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"Monoraciality is when you have many races.","correct":"Monoraciality is when you have only one race.","note":"The prefix 'mono-' means 'one,' so monoraciality refers to a single race, not multiple races."}],"priority":"Low"},"related_words":{"derivatives":["monoracial (adjective)"],"related_terms":["race","ethnicity","identity","multiraciality","biraciality"]},"level_frequency":{"frequency_google_ngram":"Low"},"readability_explanation":{"level":"C1","text":"The term 'monoraciality' is a relatively complex term used in social sciences and discussions about race and identity. It refers to the condition of belonging to a single, distinct racial group. Understanding the term requires familiarity with discussions of race, ethnicity, and identity in social contexts."},"example_sentences":[{"sentence":"The survey aimed to understand the experiences of individuals identifying with monoraciality in diverse societies.","translation":"その調査は、多様な社会において単一人種性と認識する個人の経験を理解することを目的とした。","type":"general","meaning_category":"Definition"},{"sentence":"Discussions on monoraciality often involve examining the social and political implications of racial categorization.","translation":"単一人種性に関する議論は、しばしば人種分類の社会的および政治的意味合いの検討を含む。","type":"academic","meaning_category":"Contextual"}]}