{"word":"Chouanize","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vi","definition":"(歴史)シュアニ（Chouan）党に加わる、シュアニ党のようになる、シュアニ党を支持する","english_definition":"To become like or support the Chouans (royalist insurgents during the French Revolution).","examples":[{"sentence":"The villagers began to Chouanize after the execution of the king.","translation":"国王の処刑後、村人たちはシュアニ党のようになっていった。"},{"sentence":"The region was Chouanizing rapidly due to the unpopularity of the revolutionary government.","translation":"革命政府が不人気だったため、その地域は急速にシュアニ党化していった。"}],"collocations":["Chouanize the region (地域をシュアニ党化する)","begin to Chouanize (シュアニ党化し始める)"],"synonyms":["become royalist","support counter-revolution"],"antonyms":["republicanize","support the revolution"]},{"part_of_speech":"verb","transitivity":"vt","definition":"(歴史)シュアニ党の主義を広める、シュアニ党の影響を与える","english_definition":"To cause to become like or support the Chouans.","examples":[{"sentence":"The priests attempted to Chouanize the local population.","translation":"司祭たちは地元住民をシュアニ党化しようと試みた。"},{"sentence":"The pamphlets were designed to Chouanize the peasants.","translation":"そのパンフレットは農民をシュアニ党化するように作られていた。"}],"collocations":["Chouanize the population (住民をシュアニ党化する)","Chouanize the peasants (農民をシュアニ党化する)"],"synonyms":["convert to royalism","influence with counter-revolutionary ideas"],"antonyms":["republicanize","indoctrinate with revolutionary ideas"]}],"etymology":{"value":"From \"Chouan,\" the name given to royalist insurgents in Brittany and surrounding areas during the French Revolution, + \"-ize,\" a suffix indicating the process of becoming or causing to become.","priority":"★★★"},"pronunciation":{"ipa":"/ˈʃuːənˌaɪz/","syllables":"Chou-an-ize"},"inflection":{"verb_forms":{"present_simple":["Chouanize","Chouanizes"],"past_simple":"Chouanized","past_participle":"Chouanized","present_participle":"Chouanizing"}},"usage_notes":{"explanation":"\"Chouanize\" refers specifically to the historical context of the Chouan rebellion during the French Revolution. It describes the act of becoming or causing others to become sympathetic to the royalist cause represented by the Chouans. The term is relatively rare and primarily used in historical discussions of the period.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The city was Chouanized by the new technology.","correct":"✓ The city was modernized by the new technology.","note":"\"Chouanize\" is specific to the historical Chouan movement and should not be used in other contexts."}],"priority":"★☆☆"},"related_words":{"derivatives":["Chouan (noun: a member of the Chouan movement)","Chouannerie (noun: the Chouan movement or rebellion)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (very rare, historical term)","frequency_google_ngram":"Very low frequency - primarily used in historical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Chouanize\" is a highly specialized term related to the French Revolution, specifically the Chouan rebellion. It describes the process of adopting or promoting the royalist, counter-revolutionary sentiments of the Chouans. Due to its niche historical usage, it is unlikely to be encountered outside of academic or specialized historical contexts."},"example_sentences":[{"sentence":"The local clergy sought to Chouanize the rural population against the revolutionary government.","translation":"地元の聖職者は、革命政府に対して農村部の住民をシュアニ党化しようとした。","type":"verb","meaning_category":"To cause to support the Chouans"},{"sentence":"As the revolution grew more radical, many formerly neutral citizens began to Chouanize.","translation":"革命がより過激になるにつれて、以前は中立だった多くの市民がシュアニ党化し始めた。","type":"verb","meaning_category":"To become like or support the Chouans"}]}