{"word":"pulmonary-immune","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Relating to both the lungs (pulmonary) and the immune system.","english_definition":"Relating to or affecting both the lungs and the immune system.","examples":[{"sentence":"Pulmonary-immune interactions play a crucial role in respiratory health.","translation":"肺免疫相互作用は、呼吸器の健康において重要な役割を果たします。"},{"sentence":"The study investigates the pulmonary-immune response to viral infections.","translation":"この研究は、ウイルス感染に対する肺免疫応答を調査しています。"}],"collocations":["pulmonary-immune response","pulmonary-immune system","pulmonary-immune interactions","pulmonary-immune axis"],"synonyms":["lung-immune","respiratory-immune"],"antonyms":[]}],"etymology":{"value":"A combination of 'pulmonary' (relating to the lungs) and 'immune' (relating to the immune system).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpʊlməˌneri ɪˈmjuːn/","syllables":"pul-mo-na-ry im-mune"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"The term 'pulmonary-immune' is used to describe processes, conditions, or systems that involve both the lungs and the immune system. It is often used in the context of respiratory diseases, infections, and immunological responses within the lungs.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ pulmonary immune","correct":"✓ pulmonary-immune","note":"The hyphen is important to indicate that the adjective describes a combined relationship between the pulmonary system and the immune system."}],"priority":"★★☆"},"related_words":{"derivatives":["pulmonary","immune","immunology","pulmonology"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized medical terminology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'pulmonary-immune' is a specialized term used in medical and scientific contexts to describe the interaction between the lungs and the immune system. It requires a good understanding of both pulmonology (the study of the lungs) and immunology (the study of the immune system). This term is typically encountered in research papers, medical journals, and advanced discussions related to respiratory health and disease."},"example_sentences":[{"sentence":"Dysregulation of the pulmonary-immune system can lead to chronic lung diseases.","translation":"肺免疫系の調節不全は、慢性肺疾患につながる可能性があります。","type":"general","meaning_category":"Medical"},{"sentence":"New therapies are being developed to modulate the pulmonary-immune response in patients with asthma.","translation":"喘息患者の肺免疫応答を調節するための新しい治療法が開発されています。","type":"medical","meaning_category":"Treatment"}]}