{"word":"varigradation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(写真)バリグラデーション：印画紙のコントラストを調整する技術、またはその印画紙","english_definition":"(Photography) A technique for adjusting the contrast of photographic paper, or the photographic paper itself.","examples":[{"sentence":"Varigradation paper allows for a wide range of contrast levels.","translation":"バリグラデーションペーパーは、幅広いコントラストレベルを可能にします。"},{"sentence":"The varigradation process involves using filters to control contrast during printing.","translation":"バリグラデーションプロセスでは、プリント時にフィルターを使用してコントラストを制御します。"}],"collocations":["varigradation paper","varigradation printing","varigradation process"],"synonyms":["multigrade","variable contrast"],"antonyms":[]}],"etymology":{"value":"'Vari-' (variation) + 'gradation' (gradual change in tone or color).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌværiɡreɪˈdeɪʃən/","syllables":"va-ri-gra-da-tion"},"inflection":{"noun_plural":"varigradations"},"usage_notes":{"explanation":"'Varigradation' is a specialized term primarily used in photography, specifically in the context of black and white printing. It refers to the ability to control the contrast of the print by using different filters during the exposure process.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I used varigradation to edit the color of the photo.","correct":"✓ I used varigradation to adjust the contrast of the photo.","note":"Varigradation is specifically for adjusting contrast, not color."}],"priority":"★☆☆"},"related_words":{"derivatives":["varigrade (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Varigradation' is a technical term used in photography, referring to a method of controlling contrast in black and white printing. It's not a commonly used word outside of this specific context."},"example_sentences":[{"sentence":"The photographer preferred varigradation for its flexibility in contrast control.","translation":"その写真家は、コントラスト制御の柔軟性のためにバリグラデーションを好んだ。","type":"noun","meaning_category":"写真技術"},{"sentence":"He experimented with different filters to achieve the desired effect using varigradation.","translation":"彼はバリグラデーションを使用して、目的の効果を得るためにさまざまなフィルターを試した。","type":"noun","meaning_category":"写真技術"}]}