{"word":"surgy","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"波立つ、うねりのある、激しく動く","english_definition":"characterized by surges; tending to surge.","examples":[{"sentence":"The surgy sea made it difficult to navigate the small boat.","translation":"波立つ海だったので、小型ボートの航行は困難だった。"},{"sentence":"The surgy crowd pushed forward towards the stage.","translation":"波のように押し寄せる群衆がステージに向かって押し進んだ。"}],"collocations":["surgy sea","surgy waves","surgy crowd","surgy motion"],"synonyms":["turbulent","tumultuous","restless","heaving","billowy"],"antonyms":["calm","placid","still","tranquil"]},{"part_of_speech":"adjective","definition":"(電気などが)サージを伴う、急激な電圧・電流変動のある","english_definition":"characterized by sudden increases or surges of electrical current or voltage.","examples":[{"sentence":"The surgy power supply can damage sensitive electronic equipment.","translation":"サージを伴う電源は、精密な電子機器を損傷する可能性がある。"},{"sentence":"A surge protector is needed to protect against surgy electricity.","translation":"サージ電力から保護するために、サージプロテクターが必要だ。"}],"collocations":["surgy power","surgy current","surgy voltage","surgy electricity"],"synonyms":["fluctuating","unstable","erratic","pulsating","intermittent"],"antonyms":["stable","constant","steady","uniform"]}],"etymology":{"value":"\"Surgy\" is derived from the word \"surge,\" with the addition of the adjectival suffix \"-y.\" \"Surge\" comes from the Old French word \"sourdre,\" meaning \"to rise, spring up,\" which in turn comes from the Latin word \"surgere,\" meaning \"to rise.\" The addition of \"-y\" transforms the noun \"surge\" into an adjective describing something characterized by surges.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɜːrdʒi/","syllables":"sur-gy"},"inflection":{"notes":"Adjective; comparative and superlative forms are \"more surgy\" and \"most surgy,\" respectively, though these are not commonly used."},"usage_notes":{"explanation":"The adjective \"surgy\" describes something that exhibits characteristics of a surge, meaning a sudden, powerful rush or increase. It can refer to physical phenomena like waves or crowds, or to electrical phenomena like voltage or current. When describing physical phenomena, it implies a turbulent or restless quality. When describing electrical phenomena, it implies instability and potential danger to sensitive equipment.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The surgy was very high.","correct":"✓ The surge was very high.","note":"\"Surgy\" is an adjective, so it modifies a noun. \"Surge\" is the noun referring to the wave or rush itself."},{"incorrect":"✗ The sea was very surge.","correct":"✓ The sea was very surgy.","note":"\"Surge\" is a noun or verb, not an adjective. Use \"surgy\" to describe the sea."}],"priority":"★★☆"},"related_words":{"derivatives":["surge (noun: a sudden powerful forward or upward movement, especially by a crowd or by a natural force such as the waves; verb: move suddenly and powerfully forward or upward)","surging (adjective: increasing suddenly and greatly; moving with a surge)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (This word is not commonly found in CEFR vocabulary lists.)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"surgy\" is a relatively uncommon adjective that describes something characterized by surges. A surge is a sudden, powerful rush or increase. \"Surgy\" can describe physical phenomena like waves or crowds, indicating a turbulent or restless quality. It can also describe electrical phenomena, indicating sudden and potentially damaging fluctuations in voltage or current. Because it's not a common word, it's more likely to be encountered in technical or descriptive contexts."},"example_sentences":[{"sentence":"The **surgy** river made crossing treacherous.","translation":"波立つ川は横断を危険にした。","type":"adjective","meaning_category":"波立つ"},{"sentence":"The **surgy** current overloaded the circuit.","translation":"サージ電流が回路に過負荷をかけた。","type":"adjective","meaning_category":"(電気)サージを伴う"}]}