{"word":"stunkard","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"(archaic) A miserly or mean person; a skinflint.","english_definition":"(archaic) A miserly or mean person; a skinflint.","examples":[{"sentence":"He was known in the village as a stunkard who never shared his wealth.","translation":"彼は村では、決して富を分かち合わないケチとして知られていた。"}],"synonyms":["miser","skinflint","cheapskate","tightwad","niggard"],"antonyms":["philanthropist","spendthrift","generous person"]}],"etymology":{"value":"Origin uncertain; possibly related to 'stink' suggesting a repulsive character, or a variant of 'stun' implying someone who is numbed to generosity.","priority":"Low"},"pronunciation":{"ipa":"/ˈstʌŋkərd/","syllables":"stun-kard"},"inflection":{"noun_plural":"stunkards"},"usage_notes":{"explanation":"The word 'stunkard' is archaic and rarely used in modern English. It denotes a person who is extremely stingy and unwilling to spend money, even when necessary. It carries a strong negative connotation.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"He was a stunkard with his time, never helping others.","correct":"He was a stunkard with his money, never helping others."}],"note":"The word 'stunkard' typically refers to someone who is stingy with money, not necessarily with their time or other resources."},"related_words":{"derivatives":[],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"Low"},"readability_explanation":{"level":"C2","text":"'Stunkard' is an archaic term, rarely encountered in contemporary English. Its meaning pertains to an individual characterized by extreme miserliness and an unwillingness to part with their wealth, even in situations where generosity would be appropriate or expected. Due to its obsolescence, understanding this word requires familiarity with older English literature and vocabulary."},"example_sentences":[{"sentence":"The old stunkard refused to donate even a penny to the charity.","translation":"その年老いたケチは、慈善団体に一銭たりとも寄付することを拒否した。","type":"noun","meaning_category":"miserly person"}]}