{"word":"deskilling","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(労働における)脱技能化、スキルの低下、単純化","english_definition":"The process by which skilled labor within an industry or economy is eliminated by the introduction of technologies operated by semiskilled or unskilled workers.","examples":[{"sentence":"The deskilling of factory work has led to lower wages for many employees.","translation":"工場労働の脱技能化は、多くの従業員の賃金低下につながっている。"},{"sentence":"Automation can lead to deskilling if workers are not retrained to use the new technology.","translation":"自動化は、労働者が新しい技術を使用するために再訓練されない場合、脱技能化につながる可能性がある。"},{"sentence":"Some argue that the gig economy promotes deskilling by offering only low-skill, short-term jobs.","translation":"ギグエコノミーは、低スキルで短期的な仕事しか提供しないため、脱技能化を促進すると主張する人もいる。"}],"collocations":["job deskilling","workplace deskilling","process of deskilling","economic deskilling","social deskilling"],"synonyms":["degradation of labor","proletarianization","skill erosion","simplification of work","routinization"],"antonyms":["upskilling","reskilling","skill enhancement","skill development","professionalization"]},{"part_of_speech":"verb","definition":"(労働者の)スキルを低下させる、単純化する","english_definition":"To reduce the level of skill required to perform a job.","examples":[{"sentence":"The company's new software deskilled many of the tasks previously done by experienced employees.","translation":"同社の新しいソフトウェアは、以前は経験豊富な従業員が行っていたタスクの多くを単純化した。"},{"sentence":"Management's decision to automate the process deskilled the workforce.","translation":"経営陣がプロセスを自動化するという決定は、労働者のスキルを低下させた。"},{"sentence":"The introduction of standardized procedures deskilled the job, making it less challenging.","translation":"標準化された手順の導入により、仕事のスキルが低下し、やりがいがなくなった。"}],"collocations":["deskilling the workforce","deskilling jobs","deskilling tasks","deskilling the labor force","deskilling through automation"],"synonyms":["degrade skills","simplify tasks","reduce skill level","automate processes","routinize work"],"antonyms":["upskill","reskill","train","educate","develop skills"]}],"etymology":{"value":"The term 'deskilling' emerged in the late 20th century, particularly within sociological and economic contexts. It's formed from the prefix 'de-' (meaning 'removal' or 'reduction') and 'skilling' (referring to the process of acquiring or possessing skills). The concept gained prominence through the work of sociologists like Harry Braverman, who analyzed the changing nature of labor in capitalist economies.","priority":"★★☆"},"pronunciation":{"ipa":"/diːˈskɪlɪŋ/","syllables":"de-skil-ling"},"inflection":{"noun_plural":"deskillings","verb_forms":{"present_simple":["deskill","deskills"],"past_simple":"deskilled","past_participle":"deskilled","present_participle":"deskilling"}},"usage_notes":{"explanation":"'Deskilling' refers to the reduction in skill requirements for a job, often due to automation, technology, or changes in work processes. It can lead to lower wages, reduced job satisfaction, and a decline in the overall quality of work. The term is often used in discussions about the impact of technology on the labor market and the changing nature of work.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company is descaling the workers.","correct":"✓ The company is deskilling the workers.","note":"'Deskilling' (reducing skills) is different from 'descaling' (removing scale or deposits)."},{"incorrect":"✗ Deskilling is always a good thing because it makes jobs easier.","correct":"✓ Deskilling can have negative consequences, such as lower wages and reduced job satisfaction.","note":"Deskilling is often seen as a negative trend because it can lead to job losses and lower wages. While it may make some tasks easier, it can also reduce the value of workers' skills."}],"priority":"★★☆"},"related_words":{"derivatives":["deskilled (adjective)","deskiller (noun)"],"related_concepts":["automation","labor market","job polarization","technological unemployment","Taylorism","scientific management"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in academic and professional contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Deskilling' is a term used in economics and sociology to describe the process where jobs require less skill than they used to. This often happens because of new technology or changes in how work is organized. For example, if a factory uses robots to do tasks that used to be done by skilled workers, that's deskilling. It's important to understand this term when discussing how technology affects jobs and the economy."},"example_sentences":[{"sentence":"The **deskilling** of manufacturing jobs has been a major concern in recent decades.","translation":"製造業の仕事の脱技能化は、ここ数十年で大きな懸念事項となっている。","type":"noun","meaning_category":"脱技能化"},{"sentence":"The new software is **deskilling** the work of many data entry clerks.","translation":"新しいソフトウェアは、多くのデータ入力事務員の仕事を単純化している。","type":"verb","meaning_category":"スキルを低下させる"},{"sentence":"The company's **deskilling** strategy led to a decline in employee morale.","translation":"同社の脱技能化戦略は、従業員の士気低下につながった。","type":"noun","meaning_category":"脱技能化"},{"sentence":"Many fear that artificial intelligence will further **deskill** the workforce.","translation":"多くの人が、人工知能が労働者のスキルをさらに低下させることを懸念している。","type":"verb","meaning_category":"スキルを低下させる"}]}