{"word":"Conqueress","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"女性の征服者、または征服する女性","english_definition":"A female conqueror; a woman who conquers.","examples":[{"sentence":"She was hailed as a conqueress after leading her army to victory.","translation":"彼女は軍を勝利に導いた後、征服者として迎えられた。"},{"sentence":"History remembers her as a powerful conqueress who expanded her empire.","translation":"歴史は彼女を帝国を拡大した強力な征服者として記憶している。"}],"collocations":["great conqueress","powerful conqueress","historical conqueress"],"synonyms":["victor","champion","vanquisher","female ruler","female leader"],"antonyms":["conquered","defeated"]}],"etymology":{"value":"\"Conqueress\" is derived from \"conqueror,\" with the suffix \"-ess\" added to denote a female agent. \"Conqueror\" comes from the Old French word \"conquerre,\" meaning \"to acquire, gain,\" which in turn comes from the Latin word \"conquirere,\" meaning \"to seek together, search for diligently.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɒŋkərəs/","syllables":"Con-quer-ess"},"inflection":{"noun_plural":"Conqueresses"},"usage_notes":{"explanation":"The term \"conqueress\" specifically refers to a female individual who achieves victory through force or skill, often in a military or competitive context. It emphasizes the female gender of the conqueror. It is less commonly used than \"conqueror,\" but it is appropriate when specifying the gender is relevant.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is a conqueress of the mountain.","correct":"✓ She is a conqueror of the mountain.","note":"While \"conqueress\" is correct for a female conqueror, \"conqueror\" can be used regardless of gender. Use \"conqueress\" only when you specifically want to emphasize the female gender."}],"priority":"★☆☆"},"related_words":{"derivatives":["conquer (verb)","conqueror (noun - male or unspecified gender)","conquest (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"conqueress\" is a less common term than \"conqueror.\" It is specifically used to denote a female conqueror. Understanding its meaning requires a good vocabulary and an understanding of the suffix \"-ess,\" which indicates a female gender. It is typically used in historical or literary contexts.","priority":"★☆☆"},"example_sentences":[{"sentence":"The ancient queen was remembered as a fierce conqueress.","translation":"古代の女王は、獰猛な征服者として記憶されていた。","type":"noun","meaning_category":"female conqueror"},{"sentence":"She proved to be a formidable conqueress on the battlefield.","translation":"彼女は戦場で手ごわい征服者であることが証明された。","type":"noun","meaning_category":"female conqueror"}]}