{"word":"company-town","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"企業城下町、企業都市","english_definition":"A town or city where most or all of the local jobs and housing are owned by one company.","examples":[{"sentence":"The town was a classic company-town, with the mine employing almost everyone.","translation":"その町は典型的な企業城下町で、鉱山がほぼすべての住民を雇用していた。"},{"sentence":"Life in a company-town can be both secure and restrictive.","translation":"企業城下町での生活は、安定している反面、制約も多い。"},{"sentence":"The company-town provided housing, schools, and even a store for its workers.","translation":"その企業城下町は、労働者のために住宅、学校、さらには商店まで提供していた。"}],"collocations":["mining company-town (鉱山企業城下町)","railroad company-town (鉄道企業城下町)","mill company-town (製粉企業城下町)"],"synonyms":["planned community","industrial town"],"antonyms":[]},{"part_of_speech":"adjective","definition":"企業城下町の","english_definition":"Relating to or characteristic of a company-town.","examples":[{"sentence":"The company-town atmosphere was very different from that of a typical city.","translation":"その企業城下町特有の雰囲気は、典型的な都市とは大きく異なっていた。"},{"sentence":"The company-town spirit was strong, with everyone working towards the same goal.","translation":"企業城下町精神は強く、誰もが同じ目標に向かって努力していた。"}],"collocations":["company-town atmosphere (企業城下町特有の雰囲気)","company-town spirit (企業城下町精神)"],"synonyms":["company-owned","company-controlled"],"antonyms":[]}],"etymology":{"value":"The term 'company-town' is derived from the fact that the town is owned and controlled by a single company.","priority":"★★★"},"pronunciation":{"ipa":"/ˈkʌmpəni taʊn/","syllables":"com-pa-ny town"},"inflection":{"noun_plural":"company-towns"},"usage_notes":{"explanation":"The term 'company-town' often carries a connotation of both stability (due to guaranteed employment and housing) and potential exploitation (due to the company's control over all aspects of life). The term is most often used in historical contexts, referring to towns built in the late 19th and early 20th centuries, but can still be applied to some modern communities.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company town is very big city.","correct":"✓ The company town is a small town.","note":"Company towns are usually small towns, not big cities."}],"priority":"★★☆"},"related_words":{"derivatives":["company (企業)","town (町)"],"phrasal_verbs":[],"related_concepts":["urban planning","industrialization","paternalism"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The term 'company-town' refers to a town where a single company owns most of the buildings and employs most of the residents. It's often used in historical contexts to describe towns built around mines, factories, or other large industries. Understanding this term requires knowledge of economic history and industrial development."},"example_sentences":[{"sentence":"Many company-towns were built in the American West to support mining operations.","translation":"多く企業城下町は、鉱業を支援するためにアメリカ西部に建設されました。","type":"noun","meaning_category":"企業城下町"},{"sentence":"The company-town provided all the necessary amenities for its workers.","translation":"その企業城下町は、労働者に必要なすべてのアメニティを提供していました。","type":"noun","meaning_category":"企業城下町"},{"sentence":"Living in a company-town meant that your life was closely tied to the success of the company.","translation":"企業城下町に住むということは、あなたの人生が会社の成功と密接に結びついていることを意味しました。","type":"noun","meaning_category":"企業城下町"}]}