{"word":"picture-resistant","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"(Of a person or thing) difficult to photograph well; not photogenic.","english_definition":"(Of a person or thing) difficult to photograph well; not photogenic.","examples":[{"sentence":"He claims to be picture-resistant, but I think he just needs a better photographer.","translation":"彼は写真写りが悪いと言い張るが、もっと腕の良い写真家が必要なだけだと思う。"},{"sentence":"Some materials are picture-resistant due to their reflective properties.","translation":"反射特性のために、写真写りが悪い素材もある。"}],"collocations":["not photogenic","unphotogenic","difficult to photograph"],"synonyms":["unphotogenic","not photogenic"],"antonyms":["photogenic","picturesque"]}],"etymology":{"value":"Formed by combining 'picture' (referring to a photograph) and 'resistant' (tending to resist or be unaffected by something).","priority":"N/A"},"pronunciation":{"ipa":"/ˈpɪktʃər rɪˈzɪstənt/","syllables":"pic-ture re-sis-tant"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can be used in comparative and superlative forms (more picture-resistant, most picture-resistant)."},"usage_notes":{"explanation":"'Picture-resistant' is used to describe someone or something that does not photograph well. This can be due to various factors, such as unflattering lighting, awkward poses, or inherent qualities of the subject itself. It is often used humorously or self-deprecatingly.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He is picture resistant.","correct":"✓ He is picture-resistant.","note":"The hyphen is important to connect the two words and create a compound adjective."}],"priority":"N/A"},"related_words":{"derivatives":["photogenic","unphotogenic","picturesque"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"B2","text":"'Picture-resistant' is a compound adjective that describes someone or something that is difficult to photograph well. It combines the noun 'picture' with the adjective 'resistant,' meaning tending to resist or be unaffected by something. The term is often used informally to describe people who don't look good in photos, regardless of the photographer's skill. Understanding the individual components helps to grasp the meaning of the compound word."},"example_sentences":[{"sentence":"Despite being a talented actor, he always seemed picture-resistant.","translation":"才能のある俳優であるにもかかわらず、彼はいつも写真写りが悪いようだった。","type":"adjective","meaning_category":"Not photogenic"},{"sentence":"The glossy surface of the product made it picture-resistant in the studio.","translation":"製品の光沢のある表面は、スタジオでの写真撮影を困難にした。","type":"adjective","meaning_category":"Difficult to photograph"}]}