{"word":"dispositionally","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"性向的に、気質的に、性質上","english_definition":"In a manner relating to or characterized by one's disposition or inherent qualities; according to one's typical behavior or tendencies.","examples":[{"sentence":"Dispositionally, she is an optimist, always seeing the best in people.","translation":"彼女は性向的に楽観主義者で、常に人の良いところを見ようとします。"},{"sentence":"He is dispositionally inclined to be cautious, which often prevents him from taking risks.","translation":"彼は気質的に用心深い傾向があり、それがしばしば彼がリスクを冒すことを妨げます。"},{"sentence":"Dispositionally, some people are more prone to anxiety than others.","translation":"性質上、不安になりやすい人もいれば、そうでない人もいます。"}],"collocations":["dispositionally inclined","dispositionally optimistic","dispositionally pessimistic","dispositionally different"],"synonyms":["temperamentally","inherently","naturally","characteristically","constitutionally"],"antonyms":["situationally","environmentally","externally"]}],"etymology":{"value":"Derived from 'disposition,' which comes from Latin 'disponere' (to arrange, put in order), plus the suffix '-al' (relating to), and finally '-ly' (in a manner). Thus, 'dispositionally' means 'in a manner relating to one's disposition.'","priority":"★★☆"},"pronunciation":{"ipa":"/ˌdɪspəˈzɪʃənəli/","syllables":"dis-po-si-tion-al-ly"},"inflection":{"notes":"Adverbs do not inflect."},"usage_notes":{"explanation":"'Dispositionally' is used to describe actions, behaviors, or characteristics that are rooted in a person's inherent nature or temperament. It suggests that a particular trait is a consistent part of someone's personality rather than a response to a specific situation. This adverb is often used in psychology, sociology, and philosophy to discuss the underlying causes of human behavior.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He acted dispositionally because of the pressure.","correct":"✓ He acted anxiously because of the pressure. / ✓ He is dispositionally anxious.","note":"'Dispositionally' describes a consistent trait, not a reaction to a situation. Use it to describe a general tendency, not a specific instance caused by external factors."},{"incorrect":"✗ The weather is dispositionally sunny.","correct":"✓ The weather is typically sunny in this region.","note":"'Dispositionally' applies to people's inherent qualities, not to inanimate objects or natural phenomena. Use other adverbs like 'typically' or 'usually' for such cases."}],"priority":"★★☆"},"related_words":{"derivatives":["disposition (noun)","dispositional (adjective)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'dispositionally' describes something that happens because of a person's usual character or nature. It's not something that changes easily based on the situation. It's a more formal word, often used in discussions about personality or behavior in fields like psychology or philosophy. For example, if someone is 'dispositionally optimistic,' it means they are naturally inclined to see the positive side of things, regardless of what's happening around them."},"example_sentences":[{"sentence":"Dispositionally, she tends to avoid conflict, preferring to find peaceful resolutions.","translation":"彼女は性向的に争いを避け、平和的な解決策を見つけることを好みます。","type":"adverb","meaning_category":"general tendency"},{"sentence":"His dispositionally calm demeanor made him an excellent mediator.","translation":"彼の気質的に穏やかな態度は、彼を優れた調停者にしました。","type":"adverb","meaning_category":"characteristic behavior"},{"sentence":"Dispositionally, some individuals are more resilient to stress than others.","translation":"性質上、ストレスに対する回復力が高い人もいれば、そうでない人もいます。","type":"adverb","meaning_category":"inherent quality"}]}