{"word":"base-court","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(歴史)中世の城や邸宅における、主要な居住区の外部にある下級な中庭。","english_definition":"(historical) the outer courtyard of a medieval castle or manor house, outside the main residential area.","examples":[{"sentence":"The merchants and farmers gathered in the base-court to trade their goods.","translation":"商人や農民は、商品を取引するために下級な中庭に集まった。"},{"sentence":"The base-court was a bustling area, filled with the sounds of blacksmiths and other craftsmen.","translation":"下級な中庭は、鍛冶屋や他の職人の音で満たされた、賑やかな場所だった。"}],"collocations":["inner court","outer court","castle base-court","manor base-court"],"synonyms":["outer bailey","outer ward","forecourt"],"antonyms":["inner court","keep"],"notes":"The base-court typically contained service buildings such as stables, kitchens, and workshops. It served as a buffer zone between the outside world and the more secure inner areas of the castle or manor.","related_terms":["bailey","ward","keep","moat"]}],"etymology":{"value":"The term 'base' in 'base-court' refers to the outer or lower area, as opposed to the more fortified and elevated inner areas. 'Court' refers to an enclosed area or courtyard.","priority":"2"},"pronunciation":{"ipa":"/ˈbeɪsˌkɔːrt/","syllables":"base-court"},"inflection":{"noun_plural":"base-courts"},"usage_notes":{"explanation":"The term 'base-court' is primarily used in historical contexts when describing medieval castles and manor houses. It is not commonly used in modern English.","priority":"2"},"common_mistakes":{},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term 'base-court' is a specialized historical term, primarily encountered in literature or historical texts describing medieval castles and manor houses. Understanding requires familiarity with medieval architecture and social structures."},"example_sentences":[{"sentence":"Supplies were delivered to the castle through the main gate and stored in the base-court.","translation":"物資は正門を通って城に届けられ、下級な中庭に保管された。","type":"noun","meaning_category":"historical architecture"},{"sentence":"The lord of the manor often held court in the base-court to resolve disputes among his tenants.","translation":"荘園の領主はしばしば、小作人たちの間の紛争を解決するために下級な中庭で裁判を開いた。","type":"noun","meaning_category":"historical social structure"}]}