{"word":"Semi-tychonic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"半ティコ的な：天文学において、地球が宇宙の中心に静止しており、太陽が地球の周りを公転し、他の惑星が太陽の周りを公転するという、ティコ・ブラーエの宇宙モデルに部分的に従うさま。","english_definition":"Partially conforming to the Tychonic system of cosmology, in which the Earth is at the center of the universe, the Sun orbits the Earth, and the other planets orbit the Sun.","examples":[{"sentence":"The semi-tychonic model offered a compromise between the geocentric and heliocentric views.","translation":"半ティコモデルは、地球中心説と太陽中心説の妥協案を提供した。"}],"collocations":["semi-tychonic model","semi-tychonic system"],"synonyms":["geo-heliocentric"],"antonyms":["heliocentric","geocentric"]}],"etymology":{"value":"\"Semi-\"（部分的な）+ \"Tychonic\"（ティコ・ブラーエの）に由来。ティコ・ブラーエ（Tycho Brahe）は、16世紀のデンマークの天文学者で、独自の宇宙モデルを提唱した。","priority":"★★★"},"pronunciation":{"ipa":"/ˌsɛmi taɪˈkɒnɪk/","syllables":"Se-mi-ty-chon-ic"},"inflection":{"notes":"形容詞なので、比較級・最上級の変化はありません。"},"usage_notes":{"explanation":"\"Semi-tychonic\" は、主に天文学や科学史の文脈で使用される専門用語です。日常会話で使われることはほとんどありません。ティコ・ブラーエの宇宙モデルは、地球中心説と太陽中心説の中間的な位置づけであり、半ティコ的なモデルは、そのモデルに部分的に準拠するものを指します。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The semi-tychonic theory is widely accepted today.","correct":"✓ The semi-tychonic theory is historically significant but not widely accepted today.","note":"半ティコ的な宇宙モデルは、歴史的な意義はありますが、現代の科学では受け入れられていません。"},{"incorrect":"✗ He has a semi-tychonic view on politics.","correct":"✗ This term is not typically used outside of astronomy.","note":"この用語は、天文学以外の分野では通常使用されません。"}],"priority":"★★☆"},"related_words":{"derivatives":["Tychonic","Tychonically"],"related_terms":["geocentric","heliocentric","Tycho Brahe","cosmology","astronomy"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (非常に専門的な用語)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 専門的な文脈でのみ使用される。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Semi-tychonic\" is a highly specialized term primarily used in the context of astronomy and the history of science. It refers to a cosmological model that partially adheres to the Tychonic system, a model proposed by Tycho Brahe. Understanding this term requires familiarity with different historical cosmological models (geocentric, heliocentric, Tychonic) and their significance in the development of astronomy. It is unlikely to be encountered outside of academic or specialized discussions.","note":"This term is very rare and technical, mostly used in academic contexts related to the history of astronomy and cosmology."},"example_sentences":[{"sentence":"The astronomer proposed a semi-tychonic model to explain the observed planetary motions.","translation":"その天文学者は、観測された惑星の動きを説明するために、半ティコモデルを提案した。","type":"adjective","meaning_category":"天文学"},{"sentence":"Early semi-tychonic systems were attempts to reconcile religious beliefs with emerging scientific observations.","translation":"初期の半ティコシステムは、宗教的信念と新たな科学的観測を調和させようとする試みだった。","type":"adjective","meaning_category":"天文学"}]}