{"word":"gravity-dominated","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"重力が支配的な、重力によって大きく影響を受ける","english_definition":"Primarily influenced or controlled by the force of gravity.","examples":[{"sentence":"The motion of the planets is gravity-dominated.","translation":"惑星の運動は重力が支配的である。"},{"sentence":"In a gravity-dominated system, objects tend to clump together.","translation":"重力が支配的な系では、物体は凝集する傾向がある。"},{"sentence":"The formation of stars is a gravity-dominated process.","translation":"星の形成は重力が支配的な過程である。"}],"collocations":["gravity-dominated system","gravity-dominated collapse","gravity-dominated regime","gravity-dominated environment"],"synonyms":["gravitationally bound","gravitationally influenced","gravitationally controlled"],"antonyms":["pressure-dominated","radiation-dominated","magnetically-dominated"]}],"etymology":{"value":"The term is a compound of 'gravity' (the force of attraction between objects with mass) and 'dominated' (controlled or heavily influenced). It describes a situation where gravity is the most important or controlling force.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡrævɪti dəˌmɪneɪtɪd/","syllables":"grav-i-ty-do-mi-nat-ed"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"'Gravity-dominated' is often used in physics, astronomy, and related fields to describe systems or processes where the gravitational force is the primary factor determining their behavior. This can range from the motion of celestial bodies to the behavior of fluids under certain conditions. It's used to contrast situations where other forces (such as pressure, radiation, or magnetic forces) are more important.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The air is gravity-dominated.","correct":"✓ The atmosphere is gravity-dominated.","note":"Air itself isn't gravity-dominated; the atmosphere (the layer of gases surrounding a planet) is held in place by gravity."},{"incorrect":"✗ The reaction was gravity-dominated.","correct":"✓ The collapse was gravity-dominated.","note":"'Reaction' is too general. Use a more specific noun that is affected by gravity."}],"priority":"★★☆"},"related_words":{"derivatives":["dominate","gravity","gravitational","gravitationally"],"related_terms":["gravitational force","gravitational collapse","gravitational binding energy"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency, primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Gravity-dominated' is a technical term used in science, particularly in physics and astronomy. It describes situations where the force of gravity is the most important factor influencing how something behaves. For example, the way planets move around the sun is gravity-dominated because the sun's gravity is the main force controlling their orbits. This term is used to distinguish situations where gravity is the key force from those where other forces, like pressure or magnetism, are more important. It is not typically used in everyday conversation. "},"example_sentences":[{"sentence":"The orbits of the planets in our solar system are **gravity-dominated**.","translation":"私たちの太陽系の惑星の軌道は重力が支配的である。","type":"adjective","meaning_category":"重力が支配的な"},{"sentence":"During the early stages of star formation, the cloud's collapse is **gravity-dominated**.","translation":"星形成の初期段階では、雲の崩壊は重力が支配的である。","type":"adjective","meaning_category":"重力が支配的な"},{"sentence":"In a **gravity-dominated** environment, objects tend to aggregate and form larger structures.","translation":"重力が支配的な環境では、物体は凝集してより大きな構造を形成する傾向がある。","type":"adjective","meaning_category":"重力が支配的な"}]}