{"word":"church-papist","priority":"低","meanings":[{"part_of_speech":"名詞","definition":"（歴史的用法、軽蔑的）英国国教会に形式的に従うカトリック教徒。表面上は国教徒でありながら、内心ではカトリックの信仰を保持している人。","english_definition":"(historical, derogatory) A Roman Catholic who outwardly conforms to the Church of England. A person who outwardly appears to be an Anglican but secretly adheres to the Roman Catholic faith.","examples":[{"sentence":"During the reign of Elizabeth I, many church-papists attended Anglican services to avoid fines, while secretly practicing their Catholic faith at home.","translation":"エリザベス1世の治世中、多くの教会付きカトリック教徒は罰金を避けるために英国国教会の礼拝に出席したが、密かに自宅でカトリックの信仰を実践していた。"}],"collocations":["a secret church-papist (秘密の教会付きカトリック教徒)","professed church-papist (自称教会付きカトリック教徒)"],"synonyms":["dissimulator","hypocrite","Nicodemite"],"antonyms":["recusant","nonconformist","loyal Anglican"],"notes":"この用語は、16世紀から17世紀にかけて、英国国教会への忠誠を装いながら、実際にはカトリックの信仰を保持していた人々を指すために使われました。軽蔑的な意味合いが強いです。","historical_context":"この用語は、宗教改革後のイングランドにおける宗教的緊張の時代に生まれました。カトリック教徒は英国国教会への従順を装うことで、迫害や罰金を避けることができました。"}],"etymology":{"value":"「church」（教会）と「papist」（ローマ教皇主義者、カトリック教徒）の組み合わせ。英国国教会に形式的に従うカトリック教徒を指す軽蔑的な用語。","priority":"中"},"pronunciation":{"ipa":"/ˈtʃɜːrtʃ ˈpeɪpɪst/","syllables":"church-pa-pist"},"inflection":{"noun_plural":"church-papists"},"usage_notes":{"explanation":"この用語は現代ではほとんど使用されませんが、歴史的な文脈で、特に英国の宗教史を研究する際に遭遇する可能性があります。軽蔑的なニュアンスを持つため、使用には注意が必要です。","priority":"中"},"related_words":{"derivatives":["papist (ローマ教皇主義者、カトリック教徒)","papistry (ローマ教皇主義、カトリック信仰)"],"historical_terms":["recusant (英国国教会への出席を拒否したカトリック教徒)","nonconformist (英国国教会に従わないプロテスタント)"],"religious_terms":["Anglican (英国国教会の信徒)","Catholic (カトリック教徒)"]},"level_frequency":{"frequency_google_ngram":"非常に低い頻度 (Very low frequency) - 現代英語ではほとんど使用されない。","priority":"低"},"readability_explanation":{"level":"C2","text":"「church-papist」は、英国の宗教史における特定の状況を指す、非常に特殊で歴史的な用語です。現代英語ではほとんど使用されません。この用語は、英国国教会に表面上は従うものの、内心ではカトリックの信仰を保持していた人々を指し、軽蔑的な意味合いを持ちます。この用語を理解するには、16世紀から17世紀のイングランドにおける宗教的緊張と、カトリック教徒が迫害を避けるためにとった行動に関する知識が必要です。"},"example_sentences":[{"sentence":"The historian described several figures as church-papists, suggesting they outwardly conformed to Anglicanism for political reasons.","translation":"歴史家は、いくつかの人物を教会付きカトリック教徒と表現し、彼らが政治的な理由で英国国教会に表面上従っていたことを示唆した。","type":"historical context","meaning_category":"英国国教会に形式的に従うカトリック教徒"}]}