{"word":"polemisch","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"論争的な、議論好きな、批判的な","english_definition":"of, relating to, or of the nature of a polemic; controversial; argumentative.","examples":[{"sentence":"Ihre polemische Schrift löste heftige Reaktionen aus.","translation":"彼女の論争的な著作は激しい反応を引き起こした。"}],"collocations":["polemische Auseinandersetzung (論争的な対立)","polemische Debatte (論争的な討論)","polemische Kritik (論争的な批判)","polemische Äußerung (論争的な発言)","polemische Schrift (論争的な文章)"],"synonyms":["streitbar","kontrovers","kritisch","aggressiv","angreifend"],"antonyms":["friedlich","versöhnlich","sachlich","neutral","objektiv"]}],"etymology":{"value":"Das Wort 'polemisch' stammt vom griechischen Wort 'polemikos' (πολεμικός) ab, was 'kriegerisch', 'feindlich' oder 'zum Krieg gehörig' bedeutet. Es ist abgeleitet von 'polemos' (πόλεμος), was 'Krieg' bedeutet. Im übertragenen Sinne bezieht sich 'polemisch' auf eine Auseinandersetzung oder einen Streit in Worten.","priority":"★★☆"},"pronunciation":{"ipa":"/poˈleːmɪʃ/","syllables":"po-le-misch"},"inflection":{"adjective_forms":{"comparative":"polemischer","superlative":"am polemischsten"}},"usage_notes":{"explanation":"'Polemisch' beschreibt eine Art der Auseinandersetzung, die durch starke Meinungsverschiedenheiten, Kritik und oft auch durch eine aggressive oder konfrontative Haltung gekennzeichnet ist. Es wird verwendet, um Aussagen, Schriften oder Debatten zu beschreiben, die darauf abzielen, eine bestimmte Position zu verteidigen oder eine andere anzugreifen. Im Gegensatz zu einer sachlichen oder neutralen Diskussion ist eine polemische Auseinandersetzung oft von Emotionen und subjektiven Bewertungen geprägt.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"Er hat eine polemische Meinung.","correct":"Er hat eine polemische Äußerung gemacht. / Er vertritt eine polemische Position.","note":"'Meinung' selbst ist nicht polemisch, sondern die Art und Weise, wie sie geäußert wird. Daher ist es besser, von einer polemischen Äußerung oder Position zu sprechen."},{"incorrect":"Die Diskussion war sehr polemisch, aber konstruktiv.","correct":"Die Diskussion war sehr kontrovers, aber konstruktiv.","note":"'Polemisch' impliziert oft eine destruktive oder zumindest nicht konstruktive Auseinandersetzung. Wenn die Diskussion konstruktiv war, ist 'kontrovers' ein passenderes Wort."}],"priority":"★★☆"},"related_words":{"derivatives":["Polemik (名詞: 論争)","Polemiker (名詞: 論争家)"],"phrases":["eine polemische Debatte führen (論争的な討論を行う)","sich polemisch äußern (論争的に発言する)"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relativ selten (Relatively rare) - wird eher in formellen Kontexten verwendet.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Polemisch' bedeutet, dass etwas streitlustig, angriffslustig oder auf eine heftige Auseinandersetzung aus ist. Es beschreibt eine Art von Kommunikation, bei der es weniger um einen sachlichen Austausch von Argumenten geht, sondern vielmehr darum, die eigene Meinung durchzusetzen und andere Meinungen abzuwerten oder anzugreifen. Das Wort wird oft verwendet, um Texte, Reden oder Diskussionen zu beschreiben, die sehr emotional und parteiisch sind. Es ist wichtig zu verstehen, dass 'polemisch' nicht einfach nur 'kritisch' bedeutet, sondern eine stärkere Form der Auseinandersetzung impliziert."},"example_sentences":[{"sentence":"Seine polemische Rede sorgte für Aufruhr im Publikum.","translation":"彼の論争的な演説は聴衆に騒動を引き起こした。","type":"adjective","meaning_category":"論争的な"},{"sentence":"Die Zeitung veröffentlichte einen polemischen Artikel gegen die Regierung.","translation":"その新聞は政府に対する論争的な記事を発表した。","type":"adjective","meaning_category":"論争的な"},{"sentence":"Sie reagierte polemisch auf die Kritik an ihrer Arbeit.","translation":"彼女は自分の仕事への批判に論争的に反応した。","type":"adjective","meaning_category":"論争的な"}]}