{"word":"brassiness","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(髪の毛の)金髪の黄ばみ、赤み","english_definition":"An undesirable yellow or orange tone in blonde or lightened hair.","examples":[{"sentence":"She used a purple shampoo to combat the brassiness in her blonde hair.","translation":"彼女は金髪の黄ばみを抑えるために紫色のシャンプーを使った。"},{"sentence":"The brassiness became more noticeable after she spent a lot of time in the sun.","translation":"日光に長く当たった後、黄ばみがより目立つようになった。"}],"collocations":["combat brassiness","reduce brassiness","neutralize brassiness","tone down brassiness"],"synonyms":["yellowing","orange tones","warm tones"],"antonyms":["cool tones","ashy tones"]},{"part_of_speech":"noun","definition":"(比喩的に)厚かましさ、ずうずうしさ、無遠慮さ","english_definition":"Boldness or impudence; brazenness.","examples":[{"sentence":"His brassiness in asking for a raise after only a month on the job was shocking.","translation":"入社してたった1ヶ月で昇給を要求する彼の厚かましさには驚いた。"},{"sentence":"She admired his brassiness when he stood up to the bully.","translation":"彼がいじめっ子に立ち向かったときの彼のずうずうしさに彼女は感心した。"}],"collocations":["sheer brassiness","unbelievable brassiness","outrageous brassiness"],"synonyms":["audacity","impudence","cheek","nerve","boldness","brazenness"],"antonyms":["timidity","shyness","modesty","humility"]}],"etymology":{"value":"Derived from 'brassy,' referring to the color of brass (a yellow alloy of copper and zinc) or, figuratively, to boldness or impudence.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbræsɪnəs/","syllables":"bras-si-ness"},"inflection":{"noun_plural":"brassinesses (rarely used)"},"usage_notes":{"explanation":"'Brassiness' has two main meanings. In the context of hair, it refers to the unwanted yellow or orange tones that can appear in blonde or lightened hair. This is often due to oxidation or mineral buildup. In a figurative sense, 'brassiness' describes someone's bold, impudent, or brazen behavior. The context usually makes it clear which meaning is intended.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The brassiness of the trumpet was loud.","correct":"✓ The sound of the trumpet was brassy.","note":"'Brassiness' is a noun referring to the quality of being brassy. To describe the sound of a trumpet, use the adjective 'brassy.'"},{"incorrect":"✗ She had a lot of brassiness, so she was shy.","correct":"✓ She had a lot of brassiness, so she wasn't afraid to speak her mind.","note":"'Brassiness' implies boldness and a lack of shyness, so it's contradictory to say someone with brassiness is shy."}],"priority":"★★☆"},"related_words":{"derivatives":["brassy (adjective)","brass (noun)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Brassiness' is a relatively uncommon word with two distinct meanings. One refers to the unwanted yellow or orange tones in blonde hair, often addressed with specialized hair products. The other, more figurative meaning describes a person's bold, impudent, or brazen behavior. Understanding the context is crucial to interpreting the intended meaning. It is more common to encounter the adjective 'brassy' than the noun 'brassiness.'"},"example_sentences":[{"sentence":"The stylist recommended a toner to correct the **brassiness** in her highlights.","translation":"スタイリストは、彼女のハイライトの黄ばみを修正するためにトナーを勧めた。","type":"noun","meaning_category":"hair color"},{"sentence":"His **brassiness** at the negotiation table surprised even his colleagues.","translation":"交渉の場で彼の厚かましさは同僚さえも驚かせた。","type":"noun","meaning_category":"behavior"}]}