{"word":"leucoxene","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"白鈦石：チタン鉄鉱が変質して生じる、微細な白色または黄褐色の鉱物。二酸化チタンを主成分とし、イルメナイトやチタン鉄鉱の仮晶として産出する。","english_definition":"A fine-grained alteration product of titanium-bearing minerals such as ilmenite, commonly white, yellowish, or brownish in color, and consisting mainly of titanium dioxide. It typically occurs as pseudomorphs after ilmenite or titaniferous magnetite.","examples":[{"sentence":"The leucoxene in this rock sample indicates alteration of the original ilmenite.","translation":"この岩石標本中の白鈦石は、元のイルメナイトが変質したことを示している。"}],"collocations":["leucoxene grain","leucoxene pseudomorph","altered leucoxene"],"synonyms":["anatase","rutile","brookite (all are TiO2 polymorphs, but leucoxene is an alteration product, not a primary mineral)"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'leukos' (λευκός) meaning 'white' and 'xenos' (ξένος) meaning 'stranger' or 'foreign'. This refers to its white color and its origin as an alteration product of other minerals.","priority":"★★☆"},"pronunciation":{"ipa":"/ljuːˈkɒksˌiːn/","syllables":"leu-cox-ene"},"inflection":{"noun_plural":"leucoxenes"},"usage_notes":{"explanation":"Leucoxene is not a mineral species itself, but rather a fine-grained alteration product or aggregate of titanium dioxide minerals. It is often used as an indicator of weathering or alteration processes in rocks. It is commonly found as a pseudomorph replacing ilmenite.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Leucoxene is a primary mineral.","correct":"✓ Leucoxene is an alteration product.","note":"Leucoxene is formed by the alteration of other titanium-bearing minerals, not as a primary precipitate."}],"priority":"★☆☆"},"related_words":{"derivatives":["titanium dioxide","ilmenite","pseudomorph"],"phrasal_verbs":[]},"level_frequency":{"frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Leucoxene' is a technical term used in geology and mineralogy to describe a specific alteration product of titanium-bearing minerals. It is not commonly encountered outside of these specialized contexts. Understanding requires knowledge of mineral alteration processes and mineral compositions."},"example_sentences":[{"sentence":"The presence of leucoxene suggests that the ilmenite has undergone significant weathering.","translation":"白鈦石の存在は、イルメナイトが著しい風化作用を受けたことを示唆している。","type":"descriptive","meaning_category":"alteration product"},{"sentence":"Leucoxene is often identified under the microscope by its fine-grained texture and high reflectivity.","translation":"白鈦石は、顕微鏡下で、その微細な組織と高い反射率によって識別されることが多い。","type":"identification","meaning_category":"identification"}]}