{"word":"bojite","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(historical, derogatory) a term used in Japan to refer to a woman who is considered to be Westernized or modern in a way that is seen as undesirable or inappropriate.","english_definition":"(historical, derogatory) a term used in Japan to refer to a woman who is considered to be Westernized or modern in a way that is seen as undesirable or inappropriate.","examples":[{"sentence":"その時代には、西洋文化に染まった女性は「bojite」と呼ばれ、批判の対象となった。","translation":"In that era, women who were influenced by Western culture were called 'bojite' and were subject to criticism."}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The term 'bojite' (モダンガール) originated in Japan during the Taisho and early Showa periods (early 20th century) to describe women who adopted Western fashion, lifestyles, and ideas. It was often used with negative connotations, implying a rejection of traditional Japanese values.","priority":"★★★"},"pronunciation":{"ipa":"/bo̞ːd͡ʑite̞/","syllables":"bo-ji-te"},"inflection":{"noun_plural":"bojite"},"usage_notes":{"explanation":"'Bojite' is a historical term and is now rarely used. It reflects a period of cultural tension in Japan as the country rapidly modernized and Westernized. The term is considered derogatory because it implies that adopting Western ways is inherently negative or undesirable for Japanese women.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["modan garu (モダンガール) - a more common term for a modern woman during the same period, though also sometimes used critically."],"phrasal_verbs":[]},"level_frequency":{},"readability_explanation":{"level":"C2","text":"The term 'bojite' is a historical and culturally specific term that requires an understanding of Japanese history and social attitudes during the early 20th century. It is not commonly used in contemporary English or Japanese. Understanding its meaning requires familiarity with the context of Japanese modernization and Westernization.","priority":"★★★"},"example_sentences":[{"sentence":"かつて、日本の伝統を重んじる人々は、西洋風の服装をする女性を「bojite」と呼んで非難した。","translation":"In the past, people who valued Japanese traditions criticized women who wore Western-style clothing, calling them 'bojite'."}]}