{"word":"overinflationary","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"過度にインフレ的な、インフレを過剰に引き起こす","english_definition":"Tending to cause or characterized by excessive inflation.","examples":[{"sentence":"The government's spending policies are considered overinflationary by some economists.","translation":"政府の支出政策は、一部の経済学者によって過度にインフレ的であると考えられている。"},{"sentence":"An overinflationary monetary policy can lead to a rapid devaluation of the currency.","translation":"過度にインフレ的な金融政策は、通貨の急速な切り下げにつながる可能性がある。"}],"collocations":["overinflationary policy","overinflationary pressure","overinflationary effect"],"synonyms":["hyperinflationary","inflation-inducing"],"antonyms":["deflationary","anti-inflationary"]}],"etymology":{"value":"The word is formed by adding the prefix 'over-' to 'inflationary'. 'Over-' indicates excessiveness. 'Inflationary' refers to causing or relating to inflation.","priority":"★★★"},"pronunciation":{"ipa":"/ˌoʊvərɪnˈfleɪʃənəri/","syllables":"o-ver-in-fla-tion-a-ry"},"inflection":{"notes":"Adjectives do not typically inflect in English, other than to form comparative and superlative degrees (e.g., more overinflationary, most overinflationary)."},"usage_notes":{"explanation":"'Overinflationary' is used to describe policies, actions, or situations that are likely to cause an excessive and undesirable level of inflation. It is often used in economic and financial contexts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The overinflationary is a problem.","correct":"✓ Overinflation is a problem.","note":"'Overinflationary' is an adjective and needs to modify a noun. 'Overinflation' is the noun form referring to excessive inflation."}],"priority":"★★☆"},"related_words":{"derivatives":["overinflation (noun): excessive inflation","inflationary (adjective): causing or relating to inflation"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'overinflationary' is a specialized term primarily used in economics and finance. It describes something that causes too much inflation, which is a general increase in prices and a fall in the purchasing value of money. This term is not commonly used in everyday conversation and is more likely to appear in academic or professional contexts related to economics. Understanding the base word 'inflationary' is essential to grasping the meaning of 'overinflationary'."},"example_sentences":[{"sentence":"The proposed tax cuts were criticized as potentially overinflationary.","translation":"提案された減税は、潜在的に過度にインフレ的であるとして批判された。","type":"general","meaning_category":"causing excessive inflation"},{"sentence":"Analysts warned that the central bank's actions could have overinflationary consequences.","translation":"アナリストは、中央銀行の行動が過度にインフレ的な結果をもたらす可能性があると警告した。","type":"economic","meaning_category":"economic policy"}]}