{"word":"despoliations","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"略奪、強奪、破壊","english_definition":"The act of plundering or stripping; devastation; spoliation.","examples":[{"sentence":"The city suffered from repeated despoliations during the war.","translation":"その都市は戦争中に繰り返される略奪に苦しんだ。"},{"sentence":"The despoliations of the environment by industrial activity are a serious concern.","translation":"産業活動による環境の略奪は深刻な懸念事項である。"}],"collocations":["environmental despoliation (環境破壊)","wartime despoliation (戦時中の略奪)"],"synonyms":["plundering","looting","pillage","ravaging","devastation","spoliation"],"antonyms":["conservation","preservation","restoration"]},{"part_of_speech":"noun","definition":"(法律)財産の不法な没収","english_definition":"(Law) The act of wrongfully depriving someone of their property.","examples":[{"sentence":"The despoliations of church property were a major issue during the Reformation.","translation":"宗教改革の時代、教会財産の不法な没収は大きな問題だった。"}],"collocations":["despoliation of church property (教会財産の没収)"],"synonyms":["expropriation","confiscation","seizure"],"antonyms":["restitution","return"]}],"etymology":{"value":"Late Latin despoliationem (accusative of despoliatio) \"a plundering,\" from despoliare \"to plunder, strip,\" from de- \"completely\" + spoliare \"to strip, plunder,\" from spolium \"spoils, booty.\"","priority":"★★☆"},"pronunciation":{"ipa":"/dɪˌspoʊliˈeɪʃənz/","syllables":"de-spo-li-a-tions"},"inflection":{"noun_plural":"despoliations"},"usage_notes":{"explanation":"\"Despoliations\" is the plural form of \"despoliation,\" which refers to the act of plundering, looting, or stripping something of value, often involving violence or force. It can also refer to the devastation or destruction of a place or environment. In a legal context, it can denote the wrongful deprivation of property. The word is relatively formal and not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The despoliation was happen.","correct":"✓ The despoliation happened.","note":"\"Despoliation\" is a noun and requires a verb to form a complete sentence. Use the correct verb tense to describe when the despoliation occurred."},{"incorrect":"✗ The despoliations of the environment is a serious problem.","correct":"✓ The despoliations of the environment are a serious problem.","note":"Since \"despoliations\" is plural, the verb must agree and also be plural (i.e., \"are\" instead of \"is\")."}],"priority":"★★☆"},"related_words":{"derivatives":["despoil (verb: to plunder, rob, strip)","despoiler (noun: one who despoils)","spoliation (noun: the act of despoiling; similar in meaning to despoliation)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Despoliations\" is a formal and relatively uncommon word that refers to acts of plundering, looting, or devastating something. It is often used in historical or legal contexts to describe the forceful taking or destruction of property or resources. Understanding this word requires a strong vocabulary and familiarity with formal language. It is not typically used in everyday conversation."},"example_sentences":[{"sentence":"The museum documented the despoliations of ancient artifacts by colonial powers.","translation":"その博物館は、植民地支配国による古代遺物の略奪を記録した。","type":"noun","meaning_category":"略奪"},{"sentence":"Environmental groups protested the despoliations of the rainforest by logging companies.","translation":"環境保護団体は、林業会社による熱帯雨林の破壊に抗議した。","type":"noun","meaning_category":"破壊"},{"sentence":"The despoliations of private property during the revolution led to widespread chaos.","translation":"革命中の私有財産の不法な没収は、広範囲にわたる混乱を引き起こした。","type":"noun","meaning_category":"(法律)財産の不法な没収"}]}