{"word":"fire-hoofed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Having hooves that resemble fire, either in color or effect.","english_definition":"Describing an animal with hooves that are fiery in appearance, either in color or as if they are emitting flames. Often used in fantasy or mythological contexts.","examples":[{"sentence":"The nightmare was a terrifying steed, fire-hoofed and wreathed in shadow.","translation":"その悪夢は恐ろしい馬で、蹄は炎のようで、影に包まれていた。"},{"sentence":"Legends spoke of a fire-hoofed horse that roamed the volcanic plains.","translation":"伝説では、火山平原を歩き回る炎の蹄を持つ馬について語られていた。"}],"collocations":["fire-hoofed steed","fire-hoofed horse","fire-hoofed demon"],"synonyms":["flame-hoofed","igni-hoofed"],"antonyms":["ice-hoofed","snow-hoofed"]}],"etymology":{"value":"Combination of 'fire' and 'hoofed'. 'Fire' refers to flames or a fiery color, and 'hoofed' means having hooves.","priority":"N/A"},"pronunciation":{"ipa":"/ˈfaɪərˌhuːft/","syllables":"fire-hoofed"},"inflection":{"notes":"Does not inflect"},"usage_notes":{"explanation":"This word is primarily used in descriptive or imaginative writing, especially in fantasy, mythology, or horror genres. It evokes a strong visual image of an animal with powerful, fiery hooves.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["fire","hoof"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency. Primarily used in creative writing.","priority":"N/A"},"readability_explanation":{"level":"C2","text":"This word is highly specialized and not commonly used. Its meaning is relatively straightforward to deduce from its component parts, 'fire' and 'hoofed', but it requires a strong vocabulary and familiarity with descriptive language. Expect to encounter it only in advanced literature or specialized genres. "},"example_sentences":[{"sentence":"The artist depicted the demonic horse as fire-hoofed and breathing smoke.","translation":"そのアーティストは、悪魔のような馬を、蹄が炎のようで煙を吐いているように描いた。","type":"adjective","meaning_category":"Descriptive"},{"sentence":"Only a hero of great courage could ride the fire-hoofed beast.","translation":"並外れた勇気の英雄だけが、炎の蹄を持つ獣に乗ることができた。","type":"adjective","meaning_category":"Descriptive"}]}