{"word":"reendowment","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"再寄贈、再賦与、再授与","english_definition":"The act of endowing again; a renewed endowment.","examples":[{"sentence":"The university received a significant reendowment from a generous alumnus.","translation":"その大学は、寛大な卒業生から多額の再寄贈を受けた。"},{"sentence":"The reendowment of the scholarship program ensured its continuation for future generations.","translation":"奨学金プログラムの再賦与により、将来の世代への継続が保証された。"}],"collocations":["significant reendowment","reendowment of a program","financial reendowment"],"synonyms":["reinvestment","renewal of funding","recapitalization"],"antonyms":["disinvestment","withdrawal of funds"]}],"etymology":{"value":"The word is formed by adding the prefix 're-' (meaning again or anew) to 'endowment.' 'Endowment' itself comes from the Middle English 'endowment,' derived from 'endow,' meaning to provide with a permanent source of income or support.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌriːɪnˈdaʊmənt/","syllables":"re-en-dow-ment"},"inflection":{"noun_plural":"reendowments"},"usage_notes":{"explanation":"'Reendowment' refers to the act of providing funds or assets to an institution or cause that has already been endowed previously. It often implies a continuation or renewal of support. The term is commonly used in the context of universities, charities, and other non-profit organizations.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The reendowment was used to pay off debts instead of funding new projects.","correct":"✓ The reendowment was intended to fund new projects, but it was used to pay off debts.","note":"Reendowment is typically intended for long-term support or new initiatives, not for covering existing debts."}],"priority":"★☆☆"},"related_words":{"derivatives":["endow","endowment","re-endow"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Reendowment' is a relatively rare and specialized term, primarily used in financial and philanthropic contexts. It refers to the act of providing additional funds or assets to an entity that has already received an endowment. Understanding the term requires familiarity with the concept of 'endowment' and the prefix 're-,' indicating repetition or renewal. Due to its specific usage and low frequency, it is more likely to be encountered in formal or technical texts.","priority":"★★☆"},"example_sentences":[{"sentence":"The museum's future was secured by a generous reendowment from a private donor.","translation":"その美術館の将来は、個人寄贈者からの寛大な再寄贈によって確保された。","type":"general","meaning_category":"再寄贈"},{"sentence":"The university launched a campaign to seek reendowment for its aging infrastructure.","translation":"その大学は、老朽化したインフラの再賦与を求めるキャンペーンを開始した。","type":"general","meaning_category":"再賦与"},{"sentence":"The foundation announced the reendowment of its environmental conservation program.","translation":"その財団は、環境保護プログラムの再授与を発表した。","type":"general","meaning_category":"再授与"}]}