{"word":"astromancer","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"占星術師、星占師","english_definition":"A person who practices astromancy; one who claims to foretell the future by studying the stars and planets.","examples":[{"sentence":"The king consulted the astromancer before making any major decisions.","translation":"王は重大な決定を下す前に、占星術師に相談した。"},{"sentence":"In ancient times, the astromancer held a position of great influence.","translation":"古代において、占星術師は大きな影響力を持つ地位にあった。"}],"collocations":["consult an astromancer","the astromancer's predictions","ancient astromancer"],"synonyms":["astrologer","stargazer","seer","diviner"],"antonyms":[]}],"etymology":{"value":"\"Astromancer\" combines \"astro-\" (from Greek \"astron\" meaning \"star\") and \"-mancer\" (from Greek \"manteia\" meaning \"divination\"). Thus, it literally means \"one who divines by the stars.\"","priority":"★★★"},"pronunciation":{"ipa":"/ˈæstroʊˌmænsər/","syllables":"as-tro-man-cer"},"inflection":{"noun_plural":"astromancers"},"usage_notes":{"explanation":"The term \"astromancer\" is often used interchangeably with \"astrologer,\" but sometimes carries a connotation of being a more archaic or mystical term. It specifically refers to someone who practices divination through the observation and interpretation of celestial bodies.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a good astronomer, so he must be an astromancer.","correct":"✓ He is a good astronomer, but that doesn't mean he is an astromancer.","note":"Astronomy is the scientific study of celestial objects, while astromancy (or astrology) is a form of divination. Being skilled in one does not imply skill or belief in the other."}],"priority":"★★☆"},"related_words":{"derivatives":["astromancy (noun: 占星術、星占い)"],"related_fields":["astrology (noun: 占星術)","astronomy (noun: 天文学)"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"astromancer\" is a relatively uncommon term referring to someone who practices divination by interpreting the positions and movements of celestial bodies. It's largely synonymous with \"astrologer\" but can imply a more archaic or mystical approach. Understanding this word requires familiarity with the concepts of astrology and divination.","priority":"★★★"},"example_sentences":[{"sentence":"The fictional kingdom relied heavily on the prophecies of its court **astromancer**.","translation":"その架空の王国は、宮廷占星術師の予言に大きく依存していた。","type":"general","meaning_category":"占い師"},{"sentence":"Many fantasy novels feature **astromancers** who wield cosmic power.","translation":"多くのファンタジー小説には、宇宙の力を行使する占星術師が登場する。","type":"general","meaning_category":"占い師"},{"sentence":"The old **astromancer** studied the constellations for signs of the coming war.","translation":"老いた占星術師は、来るべき戦争の兆候を求めて星座を研究した。","type":"general","meaning_category":"占い師"}]}