{"word":"phagosome","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"食胞（しょくほう）：細胞が食作用によって取り込んだ物質を包む膜結合小胞","english_definition":"A vesicle formed around a particle engulfed by a phagocyte via phagocytosis.","examples":[{"sentence":"The phagosome fuses with a lysosome to form a phagolysosome.","translation":"食胞はリソソームと融合して食胞リソソームを形成する。"},{"sentence":"The phagosome contains bacteria and cellular debris.","translation":"食胞は細菌や細胞の破片を含む。"}],"collocations":["phagosome formation","phagosome maturation","phagosome-lysosome fusion"],"synonyms":["vacuole","vesicle"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'phagein' (to eat) and 'soma' (body).","priority":"★★★"},"pronunciation":{"ipa":"/ˈfæɡəˌsoʊm/","syllables":"phag-o-some"},"inflection":{"noun_plural":"phagosomes"},"usage_notes":{"explanation":"A phagosome is a membrane-bound vesicle formed when a cell engulfs a particle through phagocytosis. It is an important part of the innate immune response, where phagocytes (e.g., macrophages, neutrophils) engulf pathogens and cellular debris. The phagosome then matures by fusing with lysosomes, forming a phagolysosome, where the engulfed material is degraded.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The phagosome is an organelle that digests proteins.","correct":"✓ The phagolysosome is an organelle that digests proteins.","note":"The phagosome itself doesn't digest proteins; it must first fuse with a lysosome to form a phagolysosome, which contains digestive enzymes."}],"priority":"★★☆"},"related_words":{"derivatives":["phagocytosis","phagocyte","phagolysosome"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Relatively low frequency, primarily used in scientific contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Phagosome' is a term used in cell biology and immunology. It refers to a vesicle that is formed when a cell engulfs a particle, such as a bacterium or cellular debris, through a process called phagocytosis. This term is typically encountered in advanced biology or medical texts. Understanding this term is essential for comprehending the mechanisms of the immune system and cellular processes.","priority":"★★☆"},"example_sentences":[{"sentence":"Following engulfment of the bacterium, a phagosome is formed.","translation":"細菌の貪食後、食胞が形成される。","type":"general","meaning_category":"Formation"},{"sentence":"The phagosome then fuses with lysosomes to degrade the engulfed material.","translation":"その後、食胞はリソソームと融合して、取り込まれた物質を分解する。","type":"general","meaning_category":"Function"},{"sentence":"Defects in phagosome maturation can lead to immune deficiencies.","translation":"食胞の成熟の欠陥は、免疫不全につながる可能性がある。","type":"medical","meaning_category":"Medical Significance"}]}