{"word":"COMSAT","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(米)通信衛星会社、通信衛星機構","english_definition":"(US) Communications Satellite Corporation; a former American communications company that was instrumental in the development of satellite communications.","examples":[{"sentence":"COMSAT was a key player in the early days of satellite technology.","translation":"COMSATは衛星技術の初期において重要な役割を果たした。"},{"sentence":"COMSAT's work helped to establish global satellite communication networks.","translation":"COMSATの活動は、グローバルな衛星通信ネットワークの確立に貢献した。"}],"collocations":["COMSAT satellite","COMSAT technology","COMSAT corporation"],"synonyms":["Communications Satellite Corporation"],"antonyms":[]}],"etymology":{"value":"COMSAT is an acronym for Communications Satellite Corporation.","priority":"★★★"},"pronunciation":{"ipa":"ˈkɒmˌsæt","syllables":"Com-sat"},"inflection":{"notes":"It is a noun, so it has no inflection."},"usage_notes":{"explanation":"COMSAT refers specifically to the Communications Satellite Corporation, a US company established in 1962. It played a vital role in the development and implementation of early communications satellites. Although the company no longer exists in its original form, the term is still used in historical contexts related to satellite communications.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The comsat is orbiting the earth.","correct":"✓ The communications satellite is orbiting the earth.","note":"comsat is the name of the company, not the satellite itself. Use 'communications satellite' to refer to the satellite."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"related_terms":["satellite","communications satellite","Intelsat","satellite communication"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"COMSAT is a specialized term referring to a specific historical entity, the Communications Satellite Corporation. It is primarily encountered in contexts discussing the history of satellite technology and telecommunications. Understanding of this term requires some background knowledge of the development of satellite communication systems."},"example_sentences":[{"sentence":"COMSAT was created as a public-private partnership to develop satellite technology.","translation":"COMSATは、衛星技術開発のために官民パートナーシップとして設立された。","type":"noun","meaning_category":"通信衛星会社"},{"sentence":"The establishment of COMSAT marked a turning point in global communications.","translation":"COMSATの設立は、グローバルコミュニケーションにおける転換点となった。","type":"noun","meaning_category":"通信衛星機構"}]}