{"word":"covenantor","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"契約当事者、特に契約上の義務を負う人","english_definition":"A person who makes a covenant, especially one who makes a promise or agreement that creates an obligation.","examples":[{"sentence":"The covenantor is responsible for fulfilling the terms of the agreement.","translation":"契約者は契約条件を履行する責任があります。"},{"sentence":"The covenantor must adhere to the stipulations outlined in the document.","translation":"契約者は文書に概説されている規定を遵守しなければなりません。"}],"collocations":["joint covenantor (共同契約者)","primary covenantor (主要契約者)","secondary covenantor (二次的契約者)"],"synonyms":["contractor","promisor","obligor"],"antonyms":["covenantee"]},{"part_of_speech":"noun","definition":"(法律) 誓約者","english_definition":"(Law) The party who makes a covenant or agreement.","examples":[{"sentence":"The covenantor is bound by the terms of the restrictive covenant.","translation":"誓約者は制限的誓約の条項に拘束されます。"}],"collocations":[],"synonyms":["promisor","obligor"],"antonyms":["covenantee"]}],"etymology":{"value":"From the word 'covenant' (an agreement) + '-or' (suffix denoting the person who performs the action).","priority":"★★★"},"pronunciation":{"ipa":"/ˈkʌvənəntɔːr/","syllables":"cov-e-nan-tor"},"inflection":{"noun_plural":"covenantors"},"usage_notes":{"explanation":"The term 'covenantor' is often used in legal and formal contexts to refer to the party who is making a promise or agreement, particularly one that is legally binding. It is the counterpart to the 'covenantee,' who is the party to whom the promise is made.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The covenantor received the benefits of the agreement.","correct":"✓ The covenantee received the benefits of the agreement.","note":"The covenantor is the one giving the promise, not receiving the benefits. The covenantee receives the benefits."}],"priority":"★★☆"},"related_words":{"derivatives":["covenant (noun: 契約、誓約; verb: 契約する、誓約する)","covenantee (noun: 契約の相手方、約束を受ける人)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Covenantor' is a legal term that refers to the party who makes a covenant or agreement, especially one that creates a legal obligation. It is used in formal contexts such as contracts, deeds, and other legal documents. Understanding this term is essential for interpreting legal agreements correctly. It is less commonly used in everyday conversation."},"example_sentences":[{"sentence":"As the covenantor, he agreed to maintain the property in good condition.","translation":"契約者として、彼はその不動産を良好な状態に維持することに同意しました。","type":"noun","meaning_category":"契約当事者"},{"sentence":"The covenantor was held liable for breaching the terms of the contract.","translation":"契約者は契約条件の違反について責任を問われました。","type":"noun","meaning_category":"契約当事者"}]}