{"word":"Sturmer","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"A variety of apple, also known as Sturmer Pippin.","english_definition":"A late-season cultivar of apple, known for its tart flavor and good keeping qualities.","examples":[{"sentence":"I planted a Sturmer apple tree in my orchard last year.","translation":"昨年、私の果樹園にスターマーのリンゴの木を植えました。"},{"sentence":"Sturmer apples are excellent for making cider.","translation":"スターマーリンゴはサイダー作りに最適です。"}],"collocations":["Sturmer apple tree","Sturmer Pippin","grow Sturmer apples","Sturmer cider"],"synonyms":["Sturmer Pippin"],"antonyms":[]}],"etymology":{"value":"Named after Mr. Sturmer, who first cultivated the apple in England in the 19th century.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈstɜːrmər/","syllables":"Stur-mer"},"inflection":{"notes":"Plural: Sturmers"},"usage_notes":{"explanation":"'Sturmer' refers specifically to a type of apple. It is most often used by those involved in horticulture, agriculture, or cooking, especially when discussing apple varieties or cider making.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate a Sturmer yesterday, it was quiet.","correct":"✓ I ate a Sturmer yesterday, it was tart.","note":"'Sturmer' is an apple variety, not a description of sound. It is known for its tartness."}],"priority":"★★☆"},"related_words":{"derivatives":["apple","apple variety","Pippin (often used in the name)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - primarily used in specific contexts related to apple cultivation.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Sturmer' is a specialized term referring to a specific cultivar of apple. Understanding and use of this term is typically limited to individuals with a specific interest in horticulture, agriculture, or culinary arts, particularly those involved in apple cultivation or cider making. Due to its niche usage, it is not part of general vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The Sturmer apples are ready for harvest in late October.","translation":"スターマーリンゴは10月下旬に収穫の準備が整います。","type":"noun","meaning_category":"apple variety"},{"sentence":"He prefers the tartness of Sturmer Pippin apples over sweeter varieties.","translation":"彼はより甘い品種よりも、スターマーピピンリンゴの酸味を好みます。","type":"noun","meaning_category":"apple variety"}]}