{"word":"judiciable","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"裁判に適した、司法判断の対象となる","english_definition":"Appropriate or suitable for judicial determination or consideration by a court; within the purview of the judiciary.","examples":[{"sentence":"The case presented a justiciable controversy that the court could resolve.","translation":"その訴訟は、裁判所が解決できる裁判に適した争点を示していた。"},{"sentence":"Whether the government's action was arbitrary and capricious is a justiciable question.","translation":"政府の行動が恣意的で気まぐれであったかどうかは、司法判断の対象となる問題である。"}],"collocations":["justiciable issue","justiciable question","justiciable controversy","justiciable claim","non-justiciable"],"synonyms":["triable","actionable","litigable","determinable","resolvable"],"antonyms":["non-justiciable","non-triable","unreviewable"]},{"part_of_speech":"adjective","definition":"(法律)裁判所の管轄権内にある","english_definition":"(Law) Within the jurisdiction of a court of law.","examples":[{"sentence":"The matter was justiciable in the federal court because it involved a federal law.","translation":"その件は連邦法に関わるため、連邦裁判所の管轄権内であった。"}],"collocations":["fall within the justiciable jurisdiction","be justiciable in a court"],"synonyms":["within jurisdiction","under judicial authority"],"antonyms":["outside jurisdiction","beyond judicial authority"]}],"etymology":{"value":"Derived from the word \"justice\" and the suffix \"-able\", indicating the capability of being subjected to judicial process or determination.","priority":"★★★"},"pronunciation":{"ipa":"/dʒuˈdɪʃiəbəl/","syllables":"ju-di-cia-ble"},"inflection":{"notes":"Adjective, no specific inflectional forms."},"usage_notes":{"explanation":"\"Judiciable\" is a term primarily used in legal contexts to describe issues or cases that are appropriate for resolution by a court. It implies that the matter involves a genuine dispute or controversy that can be addressed through legal proceedings. A justiciable issue must present a real and substantial question, not merely a hypothetical or abstract concern.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The judge determined the evidence was not judiciable.","correct":"The judge determined the evidence was not admissible.","note":"\"Judiciable\" refers to the nature of the case or issue, not the evidence itself. \"Admissible\" is the correct term for whether evidence can be presented in court."},{"incorrect":"The politician claimed the policy decision was judiciable by the people.","correct":"The politician claimed the policy decision was subject to a referendum by the people.","note":"\"Judiciable\" refers to judicial review, not popular vote. A referendum is a vote by the people, while a justiciable issue is one that a court can decide."}],"priority":"★★☆"},"related_words":{"derivatives":["justiciability (noun): the state or quality of being justiciable","non-justiciable (adjective): not appropriate for judicial determination"],"related_terms":["jurisdiction","judicial review","standing","case or controversy"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Relatively low frequency, primarily used in legal and academic contexts.","priority":"★★☆"},"readability_explanation":{"level":"C1","text":"The word \"judiciable\" is primarily used in legal settings. It refers to whether a case or issue is suitable for a court to make a decision on. If something is judiciable, it means a court has the power and authority to hear the case and resolve the dispute. It's important to understand this term if you are studying law or reading legal documents.","priority":"★★☆"},"example_sentences":[{"sentence":"The court held that the plaintiff's claim was not justiciable because they lacked standing.","translation":"裁判所は、原告が訴訟を起こす資格を欠いているため、その訴えは裁判に適さないと判断した。","type":"adjective","meaning_category":"Appropriate for judicial determination"},{"sentence":"The question of whether the President exceeded his authority was a justiciable one.","translation":"大統領が権限を逸脱したかどうかという問題は、司法判断の対象となるものであった。","type":"adjective","meaning_category":"Within the jurisdiction of a court"},{"sentence":"The dispute was not justiciable because it involved a political question that was best left to the other branches of government.","translation":"その紛争は、政府の他の部門に委ねるのが最善である政治的な問題を含んでいたため、裁判に適さなかった。","type":"adjective","meaning_category":"Not appropriate for judicial determination"}]}