{"word":"Thermoplasticity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"熱可塑性、熱可塑性を示す性質","english_definition":"The property of a material that allows it to soften when heated and harden when cooled; the ability to be repeatedly softened by heating and hardened by cooling.","examples":[{"sentence":"Thermoplasticity is a key characteristic of many polymers used in injection molding.","translation":"熱可塑性は射出成形に使用される多くのポリマーの重要な特性です。"},{"sentence":"The thermoplasticity of the material allows it to be easily recycled.","translation":"その材料の熱可塑性により、容易にリサイクルできます。"}],"collocations":["exhibit thermoplasticity","high thermoplasticity","low thermoplasticity"],"synonyms":["heat-softening","thermoelasticity"],"antonyms":["thermosetting","thermoset"],"related_terms":["thermoplastic","polymer","injection molding","extrusion","thermoset"]}],"etymology":{"value":"Derived from 'thermo-' (heat) + 'plastic' (capable of being molded) + '-ity' (state or quality).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌθɜːrmoʊplæˈstɪsɪti/","syllables":"ther-mo-plas-tic-i-ty"},"inflection":{"notes":"This is a noun and does not have different forms."},"usage_notes":{"explanation":"'Thermoplasticity' refers to the ability of a material, typically a polymer, to become pliable or moldable above a specific temperature and return to a solid state upon cooling. This process is reversible and can be repeated multiple times, making thermoplastic materials recyclable. This is in contrast to thermosetting polymers, which undergo irreversible chemical changes upon heating and curing.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The thermoplasticity material is good for molding.","correct":"✓ The thermoplastic material exhibits thermoplasticity, which is good for molding.","note":"'Thermoplasticity' is a property, not a material itself. The material is 'thermoplastic'."},{"incorrect":"✗ Thermoplasticity is when a material hardens when heated.","correct":"✓ Thermoplasticity is when a material softens when heated and hardens when cooled.","note":"Thermoplasticity involves softening upon heating *and* hardening upon cooling."}],"priority":"★★☆"},"related_words":{"derivatives":["thermoplastic","plasticity","thermoelasticity"],"related_terms":["polymer","extrusion","injection molding","thermoset"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency. Technical term used in materials science and engineering.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Thermoplasticity' is a technical term used in materials science and engineering to describe a specific property of materials. It indicates the ability of a material to become soft and moldable when heated and to solidify upon cooling. This process is reversible and repeatable, which is a key characteristic that distinguishes thermoplastics from thermosets. Understanding this term requires a background in chemistry or materials science."},"example_sentences":[{"sentence":"The high thermoplasticity of polyethylene makes it suitable for film packaging.","translation":"ポリエチレンの高い熱可塑性により、フィルム包装に適しています。","type":"example","meaning_category":"characteristic"},{"sentence":"The thermoplasticity of PVC allows it to be easily shaped into pipes and fittings.","translation":"PVCの熱可塑性により、パイプや継手に簡単に成形できます。","type":"example","meaning_category":"application"},{"sentence":"Understanding the thermoplasticity of different polymers is crucial for selecting the right material for a specific application.","translation":"さまざまなポリマーの熱可塑性を理解することは、特定の用途に適した材料を選択するために重要です。","type":"example","meaning_category":"importance"}]}