{"word":"gourd-shaped","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ひょうたん形の、瓢箪形の","english_definition":"having the shape of a gourd; resembling a gourd in form.","examples":[{"sentence":"The vase was gourd-shaped and beautifully decorated.","translation":"その花瓶はひょうたん形で、美しく装飾されていた。"},{"sentence":"Gourd-shaped ornaments hung from the tree.","translation":"ひょうたん形の装飾品が木からぶら下がっていた。"}],"collocations":["gourd-shaped bottle","gourd-shaped vase","gourd-shaped ornament"],"synonyms":["pyriform","lageniform"],"antonyms":[]}],"etymology":{"value":"The term is a compound adjective formed by combining the noun 'gourd' (referring to a type of fruit with a bulbous shape) and the adjective 'shaped' (indicating form or appearance).","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡɔːrdˌʃeɪpt/","syllables":"gourd-shaped"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Gourd-shaped' is a descriptive adjective used to specify that an object or form resembles the shape of a gourd, which is typically bulbous at the bottom and tapers towards the top. It is often used in descriptions of pottery, ornaments, and other decorative items.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The object was gourd shape.","correct":"✓ The object was gourd-shaped.","note":"'Gourd-shaped' is an adjective and should be used to describe a noun. 'Gourd shape' is not grammatically correct in this context."}],"priority":"★★☆"},"related_words":{"derivatives":["gourd (noun): a fleshy, typically large fruit with a hard skin, some varieties of which are edible.","shaped (adjective): having a specified shape or form."],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'gourd-shaped' is relatively straightforward to understand, as it directly combines the concept of a 'gourd' (a type of fruit) with the idea of being 'shaped' like it. However, its usage is more common in descriptive contexts, particularly when discussing decorative arts, pottery, or natural forms, making it more frequently encountered by those with a broader vocabulary or specific interest in these areas."},"example_sentences":[{"sentence":"The artist created a series of gourd-shaped sculptures.","translation":"そのアーティストは一連のひょうたん形の彫刻を制作した。","type":"general","meaning_category":"description"},{"sentence":"She filled the gourd-shaped bottle with homemade wine.","translation":"彼女は自家製ワインをひょうたん形のボトルに詰めた。","type":"general","meaning_category":"description"}]}