{"word":"tuinga","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Tongan) a string or garland of flowers, leaves, or other decorative items, worn around the neck or head; a lei.","english_definition":"In Tongan culture, a string or garland of flowers, leaves, or other decorative items, worn around the neck or head; a lei.","examples":[{"sentence":"She presented him with a beautiful tuinga made of fragrant jasmine flowers.","translation":"彼女は彼に、香りの良いジャスミンの花で作られた美しいtuingaを贈った。"},{"sentence":"The dancers wore colorful tuinga as part of their traditional costumes.","translation":"ダンサーたちは伝統的な衣装の一部として、カラフルなtuingaを身に着けていた。"}],"collocations":["wear a tuinga","make a tuinga","present a tuinga","fragrant tuinga","flower tuinga","leaf tuinga"],"synonyms":["lei (Hawaiian)","garland","wreath","necklace"],"antonyms":[]}],"etymology":{"value":"From the Tongan language, where 'tuinga' refers to a garland or necklace of flowers and leaves.","priority":"★★☆"},"pronunciation":{"ipa":"/tuˈiŋa/","syllables":"tu-i-nga"},"inflection":{"noun_plural":"tuingas","notes":"The plural form is often 'tuinga' as well, especially when referring to multiple types or instances collectively."},"usage_notes":{"explanation":"A 'tuinga' is a significant cultural item in Tonga, often used in ceremonies, celebrations, and as a sign of respect or affection. It is similar to a Hawaiian 'lei' but specific to Tongan traditions. The materials used can vary, including flowers, leaves, shells, and other natural items. The act of giving or receiving a tuinga is often a meaningful gesture.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ She wore a lei from Tonga.","correct":"✓ She wore a tuinga from Tonga.","note":"While 'lei' is a similar concept, using 'tuinga' specifically identifies the Tongan origin and cultural significance."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["kahoa (Tongan necklace)","sisi (Tongan fragrant oil)","Tonga","Tongan"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency, primarily used in contexts related to Tongan culture.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'tuinga' is a culturally specific term from the Tongan language, referring to a garland or lei. Understanding its usage requires familiarity with Tongan customs and traditions. It is not a commonly used word in general English, so encountering it typically occurs in contexts discussing Tongan culture, anthropology, or related fields."},"example_sentences":[{"sentence":"The bride was adorned with a beautiful tuinga, symbolizing her connection to her Tongan heritage.","translation":"花嫁は美しいtuingaで飾られ、トンガの伝統とのつながりを象徴していた。","type":"noun","meaning_category":"cultural item"},{"sentence":"Making a tuinga is a traditional craft passed down through generations in Tonga.","translation":"tuingaを作ることは、トンガで世代を超えて受け継がれてきた伝統工芸です。","type":"noun","meaning_category":"cultural practice"},{"sentence":"He received a tuinga as a sign of respect and welcome upon arriving in Tonga.","translation":"彼はトンガに到着した際、敬意と歓迎の印としてtuingaを受け取った。","type":"noun","meaning_category":"cultural symbol"}]}