{"word":"bezzle","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(主に経済学で) 組織または経済全体が、詐欺や不正行為が明らかになるまでの期間、繁栄しているように見える期間。","english_definition":"(chiefly in economics) the period during which an organization or economy appears to be thriving due to embezzlement or fraud that has not yet been discovered.","examples":[{"sentence":"The bezzle is the hidden embezzlement that takes place within a company or economy.","translation":"ベズルとは、企業や経済の中で行われる隠れた横領のことです。"},{"sentence":"During the bezzle, everyone feels richer, but it's all based on a lie.","translation":"ベズルの間、誰もがより豊かになったように感じますが、それはすべて嘘に基づいています。"},{"sentence":"The discovery of the bezzle always leads to a financial crisis.","translation":"ベズルの発見は常に金融危機につながります。"}],"collocations":["the bezzle period","hidden bezzle","financial bezzle","corporate bezzle"],"synonyms":["embezzlement","fraud","defalcation","misappropriation"],"antonyms":[]}],"etymology":{"value":"経済学者のジョン・ケネス・ガルブレイスが著書『The Great Crash, 1929』(1955)の中で初めて使用した言葉。語源は不明だが、'embezzle' (横領する)からの造語である可能性が高い。ガルブレイスは、この言葉を「まだ発見されていない横領、詐欺、または不正行為」と定義した。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈbɛzəl/","syllables":"bez-zel"},"inflection":{"noun_plural":"bezzles"},"usage_notes":{"explanation":"「**bezzle**」は、経済学や金融の分野で使われる専門用語です。日常会話で使われることはほとんどありません。この言葉は、不正行為が発覚するまでの間、経済や組織が一時的に繁栄しているように見える状態を指します。ガルブレイスによって広められた概念で、不正によって生み出された架空の富が、あたかも本物であるかのように錯覚させる状況を表します。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company had a bezzle of new products.","correct":"✓ The company had a bezzle due to accounting fraud.","note":"「bezzle」は、新しい製品や活動の活発さを指す言葉ではありません。不正行為によって生じた架空の繁栄を指します。"},{"incorrect":"✗ He was bezzling money from the company.","correct":"✓ He was embezzling money from the company.","note":"「bezzle」は名詞であり、動詞ではありません。横領する行為を指す動詞は「embezzle」です。"}],"priority":"★☆☆"},"related_words":{"derivatives":["embezzle (動詞: 横領する)","embezzlement (名詞: 横領)","fraud (名詞: 詐欺)","fraudulent (形容詞: 詐欺的な)"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (非常に専門的な語彙)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 経済学の専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**bezzle**」は、経済学の分野で使われる専門用語で、日常会話ではほとんど使われません。この単語は、企業や経済全体が、不正行為（横領や詐欺など）によって一時的に繁栄しているように見える期間を指します。この不正行為はまだ発覚していないため、表面上は健全な成長を遂げているように見えますが、実際には虚構の繁栄です。この概念は、経済学者のジョン・ケネス・ガルブレイスによって広められました。経済や金融に関する専門的な文脈でのみ使用されることを理解しておきましょう。"},"example_sentences":[{"sentence":"The Enron scandal revealed a massive bezzle that had been hidden for years.","translation":"エンロンのスキャンダルは、長年隠されていた大規模なベズルを明らかにしました。","type":"noun","meaning_category":"不正による繁栄"},{"sentence":"The bezzle created a false sense of security among investors.","translation":"ベズルは投資家の間に誤った安心感を生み出しました。","type":"noun","meaning_category":"不正による繁栄"},{"sentence":"Economists warned that the bezzle would eventually lead to a market correction.","translation":"経済学者たちは、ベズルが最終的には市場の調整につながると警告しました。","type":"noun","meaning_category":"不正による繁栄"}]}