{"word":"petrolytic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"石油分解の、石油分解性の","english_definition":"Relating to or involving petrolysis (the decomposition of petroleum or its fractions).","examples":[{"sentence":"The petrolytic cracking process is used to produce olefins.","translation":"石油分解クラッキングプロセスは、オレフィンを製造するために使用されます。"},{"sentence":"Petrolytic reactions are important in the oil refining industry.","translation":"石油分解反応は石油精製産業において重要です。"}],"collocations":["petrolytic cracking","petrolytic process"],"synonyms":["pyrolytic","cracking"],"antonyms":[]}],"etymology":{"value":"Derived from 'petro-' (relating to petroleum) and '-lytic' (relating to lysis, decomposition).","priority":"★★★"},"pronunciation":{"ipa":"/ˌpɛtroʊˈlɪtɪk/","syllables":"pe-tro-ly-tic"},"inflection":{"notes":"This is an adjective and does not have different inflections."},"usage_notes":{"explanation":"The term 'petrolytic' is primarily used in technical and scientific contexts related to the petroleum industry. It describes processes or substances involved in the decomposition or cracking of petroleum.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The petrolytic energy is used in cars.","correct":"✓ Petroleum-derived energy is used in cars.","note":"'Petrolytic' describes a process, not the energy itself. Use 'petroleum-derived' or 'petroleum-based' to describe energy from petroleum."}],"priority":"★★☆"},"related_words":{"derivatives":["petrolysis (noun): the decomposition of petroleum or its fractions.","petroleum (noun): a liquid mixture of hydrocarbons that is present in certain rock strata and can be extracted and refined to produce fuels including gasoline, kerosene, and fuel oil."],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'petrolytic' is a technical term primarily used in the context of chemistry and petroleum engineering. It refers to processes involving the decomposition of petroleum or its fractions, typically through cracking. Due to its specialized nature, it is not commonly encountered outside of these specific fields."},"example_sentences":[{"sentence":"The **petrolytic** process breaks down large hydrocarbon molecules into smaller, more useful ones.","translation":"石油分解プロセスは、大きな炭化水素分子をより小さく、より有用なものに分解します。","type":"adjective","meaning_category":"石油分解の"},{"sentence":"**Petrolytic** cracking is a key step in the production of gasoline.","translation":"石油分解クラッキングは、ガソリン製造の重要なステップです。","type":"adjective","meaning_category":"石油分解の"}]}