{"word":"excommunicative","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"破門の、追放の、排斥の","english_definition":"Relating to or involving excommunication; tending to excommunicate.","examples":[{"sentence":"The church took an excommunicative stance against the heretic.","translation":"教会は異端者に対して破門の姿勢をとった。"},{"sentence":"His excommunicative actions alienated many members.","translation":"彼の排斥的な行動は多くのメンバーを遠ざけた。"}],"collocations":["excommunicative decree","excommunicative power","excommunicative action"],"synonyms":["exclusionary","rejective","banishing","ostracizing"],"antonyms":["inclusive","accepting","welcoming"]}],"etymology":{"value":"From 'excommunicate' + '-ive'. 'Excommunicate' comes from Late Latin 'excommunicatus', past participle of 'excommunicare' (to put out of the communion), from Latin 'ex-' (out of) + 'communicare' (to share, communicate).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɛkskəˈmjuːnɪkeɪtɪv/","syllables":"ex-com-mu-ni-ca-tive"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more excommunicative' and 'most excommunicative', respectively."},"usage_notes":{"explanation":"'Excommunicative' describes something that relates to or involves excommunication, which is the act of officially excluding someone from participation in the sacraments and services of a Christian church. It can also refer more generally to the act of excluding someone from a group or community.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was very excommunicative, so everyone liked him.","correct":"✓ He was very exclusive, so everyone wanted to be his friend.","note":"'Excommunicative' implies rejection and exclusion, so it wouldn't cause people to like someone. 'Exclusive' is a better fit for this context."},{"incorrect":"✗ The excommunicative person was welcomed into the group.","correct":"✓ The excluded person was welcomed into the group.","note":"'Excommunicative' describes the action or tendency to exclude, not the state of being excluded. Use 'excluded' or 'ostracized' to describe the person."}],"priority":"★★☆"},"related_words":{"derivatives":["excommunicate (verb, noun)","excommunication (noun)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Excommunicative' is a relatively rare and formal word. It is used to describe actions, policies, or attitudes that involve or tend towards excommunication, which is the formal exclusion of someone from a religious community or, more broadly, from a group or society. The word carries a negative connotation, implying rejection and exclusion. Understanding this word requires a good grasp of formal vocabulary and abstract concepts related to social exclusion."},"example_sentences":[{"sentence":"The leader's excommunicative policies led to a significant decline in membership.","translation":"指導者の排斥的な政策は、会員数の大幅な減少につながった。","type":"general","meaning_category":"排斥的な政策"},{"sentence":"The excommunicative tone of the article alienated many potential readers.","translation":"記事の排斥的な口調は、多くの潜在的な読者を遠ざけた。","type":"general","meaning_category":"排斥的な口調"},{"sentence":"The church's excommunicative actions were seen as harsh and unforgiving.","translation":"教会の破門の行動は、厳しく容赦がないと見なされた。","type":"religious","meaning_category":"破門の行動"}]}