{"word":"elapid","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"コブラ科のヘビ","english_definition":"any venomous snake of the family Elapidae, characterized by hollow, fixed fangs","examples":[{"sentence":"The king cobra is a large elapid.","translation":"キングコブラは大型のコブラ科のヘビです。"},{"sentence":"Elapids are found in tropical and subtropical regions around the world.","translation":"コブラ科のヘビは世界中の熱帯および亜熱帯地域で見られます。"}],"collocations":["venomous elapid","Australian elapid","sea elapid"],"synonyms":["cobra","mamba","coral snake","krait"],"antonyms":[]},{"part_of_speech":"adjective","definition":"コブラ科の","english_definition":"of or relating to the Elapidae family of snakes","examples":[{"sentence":"Elapid snakes possess a potent neurotoxic venom.","translation":"コブラ科のヘビは強力な神経毒性の毒を持っています。"},{"sentence":"The elapid family includes some of the world's most dangerous snakes.","translation":"コブラ科には世界で最も危険なヘビがいくつか含まれています。"}],"collocations":["elapid venom","elapid snake","elapid family"],"synonyms":["elapidous"],"antonyms":[]}],"etymology":{"value":"Derived from Elapidae, the taxonomic family name. Elapidae comes from the Greek word 'elaps' (ἔλλοψ), meaning 'a kind of snake'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɛləpɪd/","syllables":"e-lap-id"},"inflection":{"noun_plural":"elapids"},"usage_notes":{"explanation":"'Elapid' refers specifically to snakes belonging to the family Elapidae, which are characterized by their proteroglyphous fangs (hollow, fixed fangs at the front of the upper jaw). This family includes cobras, mambas, kraits, coral snakes, and sea snakes. The term is used in both scientific and general contexts to describe or refer to these snakes.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The elapid is a type of viper.","correct":"✓ The elapid is a type of cobra.","note":"Elapids are not vipers; they belong to a different family of venomous snakes. Vipers have hinged fangs, while elapids have fixed fangs."}],"priority":"★☆☆"},"related_words":{"derivatives":["Elapidae (family name)","elapidous (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'elapid' is a scientific term used to describe snakes belonging to the family Elapidae. This family includes well-known venomous snakes such as cobras, mambas, and coral snakes. Understanding this term requires familiarity with biological classifications and snake anatomy. It is commonly used in zoology, herpetology, and related fields."},"example_sentences":[{"sentence":"The coastal taipan is a highly venomous elapid found in Australia.","translation":"沿岸タイパンはオーストラリアに生息する非常に有毒なコブラ科のヘビです。","type":"noun","meaning_category":"コブラ科のヘビ"},{"sentence":"Elapid venom often contains potent neurotoxins.","translation":"コブラ科のヘビの毒は、しばしば強力な神経毒を含んでいます。","type":"adjective","meaning_category":"コブラ科の"}]}