{"word":"mendicantism","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"托鉢修道制度、托鉢主義","english_definition":"The practice of religious mendicants relying chiefly or exclusively on charitable donations to support themselves.","examples":[{"sentence":"Mendicantism was a significant feature of medieval religious life.","translation":"托鉢修道制度は中世の宗教生活の重要な特徴でした。"},{"sentence":"The rise of mendicant orders in the 13th century reflected a new emphasis on poverty and preaching.","translation":"13世紀の托鉢修道会の台頭は、貧困と説教に対する新たな重点を反映していました。"}],"collocations":["religious mendicantism","Christian mendicantism","Buddhist mendicantism","practice mendicantism","the spirit of mendicantism"],"synonyms":["beggary","pauperism","asceticism","voluntary poverty"],"antonyms":["wealth","affluence","materialism"]},{"part_of_speech":"noun","definition":"托鉢修道士の生活様式","english_definition":"The way of life of a mendicant friar or monk.","examples":[{"sentence":"He embraced mendicantism, renouncing all personal possessions.","translation":"彼は托鉢修道士の生活様式を受け入れ、すべての個人的な所有物を放棄しました。"},{"sentence":"Mendicantism requires a life of simplicity and dependence on others.","translation":"托鉢修道士の生活様式は、質素さと他者への依存を必要とします。"}],"collocations":["embrace mendicantism","practice mendicantism","live a life of mendicantism","the principles of mendicantism"],"synonyms":["ascetic life","life of poverty","religious life","monasticism"],"antonyms":["materialistic lifestyle","luxurious lifestyle","secular life"]}],"etymology":{"value":"From the Latin 'mendicans', the present participle of 'mendicare' meaning 'to beg'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈmɛndɪkəntɪzəm/","syllables":"men-di-can-tism"},"inflection":{"noun_plural":null},"usage_notes":{"explanation":"'Mendicantism' refers to the practice of religious orders (especially in Christianity and Buddhism) where members take a vow of poverty and rely on charity for their sustenance. It is distinct from other forms of monasticism where communities may own property and be self-supporting. The term is often used in historical or religious contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a mendicantism of the church.","correct":"✓ He practiced mendicantism as a member of the church.","note":"'Mendicantism' is a practice or system, not a person. Use 'mendicant' to refer to a person who practices mendicantism."}],"priority":"★☆☆"},"related_words":{"derivatives":["mendicant (adjective, noun)","mendicate (verb - rare)"],"phrasal_verbs":null,"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Mendicantism' is a specialized term primarily used in the context of religious studies, history, and sociology. It describes a specific type of religious practice where individuals or groups renounce personal wealth and rely on the charity of others for their basic needs. Understanding this term requires familiarity with religious concepts and historical contexts. It is not commonly used in everyday conversation."},"example_sentences":[{"sentence":"Franciscan friars are known for their commitment to mendicantism.","translation":"フランシスコ会修道士は、托鉢修道制度への献身で知られています。","type":"noun","meaning_category":"托鉢修道制度"},{"sentence":"The principles of mendicantism emphasize humility and dependence on divine providence.","translation":"托鉢修道制度の原則は、謙虚さと神の摂理への依存を強調しています。","type":"noun","meaning_category":"托鉢修道制度"},{"sentence":"Historically, mendicantism served as a way for religious orders to connect with the poor and marginalized.","translation":"歴史的に、托鉢修道制度は、宗教団体が貧しい人々や社会から疎外された人々とつながるための手段として役立ってきました。","type":"noun","meaning_category":"托鉢修道制度"}]}