{"word":"unclaimable","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"請求できない、所有権を主張できない、権利を主張できない","english_definition":"Not able to be claimed; not eligible for a claim; not able to have ownership asserted.","examples":[{"sentence":"The lost property was unclaimable after six months.","translation":"遺失物は6か月後には請求できなくなった。"},{"sentence":"Due to the terms of the agreement, the prize became unclaimable.","translation":"契約条件により、賞品は請求できなくなった。"},{"sentence":"The funds remained unclaimable because no one could prove ownership.","translation":"誰も所有権を証明できなかったため、資金は請求できないままだった。"}],"collocations":["unclaimable property (請求できない財産)","unclaimable funds (請求できない資金)","unclaimable prize (請求できない賞品)","become unclaimable (請求できなくなる)","remain unclaimable (請求できないままである)"],"synonyms":["forfeited","unredeemable","unrecoverable","abandoned"],"antonyms":["claimable","redeemable","recoverable"],"related_words":["claimable (請求可能な)","claim (請求、主張)","unclaimed (未請求の)"]}],"etymology":{"value":"\"un-\" (否定) + \"claimable\" (請求可能な)","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈkleɪməbəl/","syllables":"un-claim-a-ble"},"inflection":{"notes":"Adjective; comparative and superlative forms are 'more unclaimable' and 'most unclaimable', respectively, though these are rarely used."},"usage_notes":{"explanation":"\"Unclaimable\" refers to something that cannot be claimed, either because the time limit for claiming it has passed, the conditions for claiming it have not been met, or no one can prove ownership. It often applies to lost property, prizes, or funds.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The unclaimable money was given to charity.","correct":"✓ The unclaimed money was given to charity.","note":"\"Unclaimed\" (未請求の) is more common when referring to money or property that has not yet been claimed but could be. \"Unclaimable\" implies that it is impossible to claim, even if someone wanted to."}],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'unclaimable' is a relatively uncommon word that means something cannot be claimed. This might be because too much time has passed, or because the rules say it cannot be claimed. It is often used in legal or formal contexts."},"example_sentences":[{"sentence":"After a year, the unclaimed lottery winnings became unclaimable and were donated to charity.","translation":"1年後、未請求の宝くじの賞金は請求できなくなり、慈善団体に寄付されました。","type":"example","meaning_category":"General"},{"sentence":"The insurance payout was deemed unclaimable due to a breach of contract.","translation":"保険金は契約違反のため、請求できないと判断されました。","type":"example","meaning_category":"Legal/Contractual"},{"sentence":"The lost baggage remained unclaimable, as the owner could not be identified.","translation":"所有者が特定できなかったため、紛失した手荷物は請求できないままでした。","type":"example","meaning_category":"Lost Property"}]}