{"word":"Disulfiram","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"ジスルフィラム：アルデヒド脱水素酵素阻害薬の一種で、アルコール依存症の治療に用いられる。","english_definition":"A drug used to support the treatment of chronic alcoholism by producing an acute sensitivity to ethanol (drinking alcohol).","examples":[{"sentence":"Disulfiram is used as a deterrent to drinking alcohol.","translation":"ジスルフィラムは飲酒の抑止剤として使用される。"},{"sentence":"Patients taking disulfiram must avoid all forms of alcohol.","translation":"ジスルフィラムを服用している患者は、あらゆる種類のアルコールを避けなければならない。"}],"collocations":["disulfiram implant","disulfiram reaction","disulfiram therapy"],"synonyms":["Antabuse"],"antonyms":[]}],"etymology":{"value":"Derived from di- (meaning two), sulfur, and -am (a suffix used in organic chemistry).","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˈsʌlfɪræm/","syllables":"di-sul-fi-ram"},"inflection":{"notes":"This is a noun and does not inflect."},"usage_notes":{"explanation":"Disulfiram works by inhibiting the enzyme aldehyde dehydrogenase, which is involved in the metabolism of alcohol. When alcohol is ingested after taking disulfiram, acetaldehyde builds up in the body, leading to unpleasant symptoms such as nausea, vomiting, flushing, headache, and palpitations. This reaction discourages the individual from drinking alcohol. It is typically used in conjunction with counseling and other support therapies.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I can drink alcohol while on Disulfiram if I only have a little.","correct":"✓ Patients taking disulfiram must avoid all forms of alcohol.","note":"Even small amounts of alcohol can cause a severe reaction when taking disulfiram."}],"priority":"★★☆"},"related_words":{"derivatives":["aldehyde dehydrogenase","ethanol","alcohol dependence","acetaldehyde"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Disulfiram is a medication used to treat alcohol dependence. It works by causing unpleasant side effects when alcohol is consumed, such as nausea and headaches. This helps deter people from drinking. It's important to avoid all alcohol while taking this medication.","priority":"★★☆"},"example_sentences":[{"sentence":"The doctor prescribed disulfiram to help him stop drinking.","translation":"医師は彼が飲酒をやめるのを助けるためにジスルフィラムを処方した。","type":"general","meaning_category":"treatment"},{"sentence":"The disulfiram reaction can be very unpleasant.","translation":"ジスルフィラム反応は非常に不快になる可能性がある。","type":"side effect","meaning_category":"reaction"}]}