{"word":"summons-proof","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(法律)召喚状が届かない、または召喚状の影響を受けない","english_definition":"Unable to be legally summoned or unaffected by a summons.","examples":[{"sentence":"The company structured its operations to be summons-proof, making legal action difficult.","translation":"その会社は、訴訟を困難にするために、召喚状が届かないように事業を構築した。"},{"sentence":"He made sure his assets were summons-proof before engaging in risky business ventures.","translation":"彼は危険な事業に乗り出す前に、自分の資産が召喚状の影響を受けないようにした。"}],"collocations":["summons-proof assets","summons-proof structure","become summons-proof"],"synonyms":["unreachable","immune to summons","legally shielded"],"antonyms":["vulnerable to summons","reachable by summons"]}],"etymology":{"value":"The word is formed by combining 'summons' (a legal order to appear before a court) with 'proof' (resistant or impervious to something).","priority":"★★★"},"pronunciation":{"ipa":"/ˈsʌmənzˌpruːf/","syllables":"sum-mons-proof"},"inflection":{"notes":"This word is primarily used as an adjective and does not typically have different inflections."},"usage_notes":{"explanation":"'Summons-proof' is often used in legal and business contexts to describe entities or assets that are structured in such a way that they are difficult or impossible to reach through legal summons. This can involve complex ownership structures or offshore accounts. The term implies a deliberate effort to avoid legal accountability.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lawyer made the case summons-proof.","correct":"✓ The lawyer made the case summons-proof by establishing a trust.","note":"The term usually describes the state of being protected from summons, not the act of making something protected. It's better to describe how something becomes summons-proof."},{"incorrect":"✗ He is summons-proof from all crimes.","correct":"✓ He structured his assets to be summons-proof.","note":"Being summons-proof doesn't mean someone is immune to all legal consequences, but rather that their assets or operations are difficult to reach through summons."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["summons","subpoena","asset protection","legal immunity","offshore account"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Summons-proof' is a specialized term primarily used in legal and financial contexts. It describes a situation where assets or entities are structured in a way that makes them difficult or impossible to reach through legal summons, often to avoid legal accountability. Understanding this term requires familiarity with legal concepts and financial structuring. It is not commonly used in everyday language."},"example_sentences":[{"sentence":"The wealthy businessman created a series of trusts to make his assets summons-proof.","translation":"その裕福なビジネスマンは、自分の資産を召喚状から保護するために、一連の信託を設立した。","type":"adjective","meaning_category":"Legal/Financial"},{"sentence":"Critics argue that the company's complex structure is designed to be summons-proof, shielding it from legal responsibility.","translation":"批評家たちは、その会社の複雑な構造は、法的責任から保護するために、召喚状が届かないように設計されていると主張している。","type":"adjective","meaning_category":"Legal/Business"}]}