{"word":"gastrosopher","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"美食哲学者、食通、美食家","english_definition":"A person who combines a knowledge of food with philosophical principles; a gourmet; a connoisseur of fine dining.","examples":[{"sentence":"The gastrosopher argued that the ethical sourcing of ingredients was as important as their flavor.","translation":"美食哲学者は、食材の倫理的な調達が、その風味と同じくらい重要であると主張した。"},{"sentence":"He was considered a gastrosopher by his friends due to his extensive knowledge of wines and cheeses.","translation":"彼はワインとチーズに関する豊富な知識から、友人たちから美食哲学者と見なされていた。"}],"collocations":["culinary philosophy","food ethics","gourmet dining","wine connoisseur","cheese aficionado"],"synonyms":["gourmet","epicure","foodie","connoisseur","gastronome"],"antonyms":["glutton","gourmand"]},{"part_of_speech":"noun","definition":"(古語) 料理人、料理研究家","english_definition":"(archaic) A cook or student of cookery.","examples":[{"sentence":"In the 19th century, a gastrosopher was often simply a term for a skilled chef.","translation":"19世紀には、美食哲学者という言葉は、しばしば熟練した料理人を指す言葉だった。"}],"collocations":["skilled chef","culinary expert","cookery book"],"synonyms":["chef","cook","culinary artist"]}],"etymology":{"value":"The word is a blend of 'gastro-' (referring to the stomach or food, from Greek 'gastēr') and '-sopher' (referring to a wise or knowledgeable person, from Greek 'sophos').","priority":"★★☆"},"pronunciation":{"ipa":"/ɡæsˈtrɒsəfər/","syllables":"gas-tro-so-pher"},"inflection":{"noun_plural":"gastrosophers"},"usage_notes":{"explanation":"The term 'gastrosopher' is not commonly used in modern English. It suggests someone who appreciates food not only for its taste but also for its cultural, ethical, and philosophical implications. It is distinct from 'gourmet' or 'foodie,' which primarily focus on the enjoyment of fine food.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a gastrosopher because he eats a lot.","correct":"✓ He is a gastrosopher because he understands the history and culture behind the food.","note":"A gastrosopher is not simply someone who eats a lot, but someone who has a deep understanding and appreciation of food. "},{"incorrect":"✗ Gastrosophy is the study of stomachs.","correct":"✓ Gastrosophy is the philosophy of food and eating.","note":"Gastrosophy is not the study of stomachs, but the philosophy of food and eating."}],"priority":"★☆☆"},"related_words":{"derivatives":["gastrosophic (adjective)","gastrosophy (noun): the philosophy of food and eating"],"related_concepts":["molecular gastronomy","slow food movement","food criticism","culinary arts","food studies"],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (Not commonly used)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Gastrosopher' is a rare word referring to someone who combines a deep knowledge and appreciation of food with philosophical principles. It implies an understanding of the cultural, ethical, and historical aspects of food, not just its taste. The word is not commonly used in everyday conversation and might be found more often in academic or culinary contexts."},"example_sentences":[{"sentence":"As a true gastrosopher, he believed that every meal should be an exploration of culture and history.","translation":"真の美食哲学者として、彼はすべての食事が文化と歴史の探求であるべきだと信じていた。","type":"noun","meaning_category":"美食哲学者"},{"sentence":"The gastrosopher's writings explored the connection between food, society, and personal identity.","translation":"その美食哲学者の著作は、食、社会、そして個人のアイデンティティのつながりを考察していた。","type":"noun","meaning_category":"美食哲学者"}]}