{"word":"faux-house","priority":"Low","meanings":[{"part_of_speech":"noun","definition":"A house that is built to look like a different style or period than it actually is, often using artificial materials or techniques.","english_definition":"A house constructed to imitate a style or period other than its own, frequently employing artificial materials or methods to achieve the desired aesthetic.","examples":[{"sentence":"The development was full of faux-houses, each trying to look like a historic mansion but clearly built in the last decade.","translation":"その開発地は、偽の家々でいっぱいだった。それぞれが歴史的な大邸宅のように見せようとしていたが、明らかに過去10年間に建てられたものだった。"},{"sentence":"They built a faux-house with a Tudor facade, even though the rest of the structure was modern.","translation":"彼らはチューダー様式のファサードを持つ偽の家を建てたが、構造の残りの部分は現代的だった。"}],"collocations":["build a faux-house","design a faux-house","faux-house architecture","faux-house facade"],"synonyms":["imitation house","replica house","stylized house","thematic house"],"antonyms":["authentic house","genuine house","original house"]}],"etymology":{"value":"The term combines \"faux,\" meaning fake or artificial (from French), with \"house.\" It describes a house that is not genuine in its architectural style or materials.","priority":"Medium"},"pronunciation":{"ipa":"/ˌfoʊ ˈhaʊs/","syllables":"faux-house"},"inflection":{"noun_plural":"faux-houses"},"usage_notes":{"explanation":"The term \"faux-house\" is often used critically to describe houses that lack authenticity or historical accuracy in their design. It implies that the house is trying to imitate a style without genuinely embodying it. The term is relatively uncommon.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"The faux-house was made of real brick.","correct":"The faux-house had a facade of real brick.","note":"While a faux-house might incorporate some real materials, the term implies that the overall effect is artificial or imitative. If the house is genuinely built in a particular style with authentic materials, it would not be called a faux-house."}],"priority":"Low"},"related_words":{"derivatives":["faux (adj.)","house (n.)"],"related_terms":["McMansion (often used to describe large, poorly designed faux-houses)"],"priority":"Low"},"level_frequency":{"frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"The term 'faux-house' is used to describe a house that is built to imitate a particular architectural style or period, often using artificial materials or design elements. It is a relatively uncommon term, and understanding it requires familiarity with the word 'faux,' which means fake or imitation. The term is often used critically to suggest that the house lacks authenticity or genuine character."},"example_sentences":[{"sentence":"The new development featured a series of faux-houses designed to evoke a sense of old-world charm.","translation":"その新しい開発地には、古き良き時代の魅力を呼び起こすように設計された一連の偽の家が建ち並んでいた。","type":"general","meaning_category":"General Description"},{"sentence":"Critics derided the neighborhood as a collection of tasteless faux-houses.","translation":"批評家たちは、その近隣を趣味の悪い偽の家々の集まりだと酷評した。","type":"critical","meaning_category":"Critical Opinion"}]}