{"word":"Twice-promised","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"二度約束された、二重に約束された","english_definition":"Having been promised or guaranteed on two separate occasions.","examples":[{"sentence":"The twice-promised funding never materialized.","translation":"二度約束された資金は結局実現しなかった。"},{"sentence":"He broke his twice-promised vow.","translation":"彼は二度約束した誓いを破った。"}],"collocations":["twice-promised funding (二度約束された資金)","twice-promised vow (二度約束された誓い)","twice-promised commitment (二度約束された約束)"],"synonyms":["double-promised","re-promised","guaranteed twice"],"antonyms":["unpromised","unpledged"]}],"etymology":{"value":"Formed by combining \"twice\" (meaning two times) with the past participle of \"promise.\"","priority":"★★★"},"pronunciation":{"ipa":"/ˈtwaɪs prɒmɪst/","syllables":"twice-prom-ised"},"inflection":{"notes":"This is an adjective, so it does not inflect like a verb. It can be used to modify nouns."},"usage_notes":{"explanation":"\"Twice-promised\" is used to emphasize that a promise or guarantee has been made on two separate occasions, often implying a sense of disappointment or betrayal if the promise is not fulfilled. It is a relatively uncommon word, but useful for highlighting the repeated nature of the commitment.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He twice promised me.","correct":"✓ He twice promised me the money. / ✓ He promised me the money twice.","note":"While \"twice\" can modify the verb \"promised\" directly, \"twice-promised\" functions as an adjective and must modify a noun."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"twice-promised\" is a compound adjective used to describe something that has been promised on two separate occasions. It is generally used in formal contexts to emphasize the repeated nature of the promise and often carries a negative connotation, suggesting disappointment or unfulfilled expectations. Understanding the word requires familiarity with the meanings of \"twice\" and \"promised\" and the ability to recognize compound adjectives."},"example_sentences":[{"sentence":"The project was delayed despite the twice-promised assurances from the government.","translation":"そのプロジェクトは、政府からの二度約束された保証にもかかわらず遅延した。","type":"adjective","meaning_category":"promised twice"},{"sentence":"The company failed to deliver on its twice-promised improvements to customer service.","translation":"その会社は、二度約束された顧客サービス改善を果たすことができなかった。","type":"adjective","meaning_category":"promised twice"}]}