{"word":"marasmic","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"消耗症の、極度に栄養不良の","english_definition":"Relating to or suffering from marasmus (severe undernourishment causing an infant's or child's weight to be significantly low for their age).","examples":[{"sentence":"The child was marasmic due to the prolonged famine.","translation":"その子供は長引く飢饉のために消耗症だった。"},{"sentence":"Marasmic children often have a skeletal appearance.","translation":"消耗症の子供はしばしば骨格のような外見をしている。"}],"collocations":["marasmic child","marasmic condition","severe marasmus"],"synonyms":["emaciated","underfed","malnourished","wasted"],"antonyms":["well-nourished","healthy","robust"]}],"etymology":{"value":"Derived from 'marasmus,' which comes from the Greek word 'marasmos' (μαρασμός), meaning 'wasting' or 'consumption.'","priority":"★★☆"},"pronunciation":{"ipa":"/məˈræzmɪk/","syllables":"ma-ras-mic"},"inflection":{"notes":"This is an adjective, so it can be used to modify nouns. Comparative and superlative forms are possible (more marasmic, most marasmic), but less common."},"usage_notes":{"explanation":"'Marasmic' is a term used in medical contexts to describe a state of severe malnutrition, particularly in children. It indicates a deficiency in both calories and protein, leading to significant wasting of muscle and fat. It is a more specific term than simply 'malnourished.'","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant looked marasmic because it didn't get enough sunlight.","correct":"✓ The plant looked withered because it didn't get enough sunlight.","note":"'Marasmic' specifically refers to severe malnutrition in living beings, especially children. For plants, use terms like 'withered' or 'stunted.'"},{"incorrect":"✗ He felt marasmic after a long day at work.","correct":"✓ He felt exhausted after a long day at work.","note":"'Marasmic' indicates a severe, prolonged state of malnutrition, not just temporary tiredness. Use 'exhausted' or 'fatigued' for general tiredness."}],"priority":"★★☆"},"related_words":{"derivatives":["marasmus (noun): severe undernourishment causing an infant's or child's weight to be significantly low for their age"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency. This is a specialized medical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Marasmic' is a specialized medical term primarily used by healthcare professionals to describe a specific condition of severe malnutrition, particularly in children. It implies a chronic deficiency of both calories and protein, resulting in extreme wasting. Its use is generally restricted to medical or scientific contexts."},"example_sentences":[{"sentence":"The doctor diagnosed the infant as marasmic after observing the severe weight loss and muscle wasting.","translation":"医師は、著しい体重減少と筋肉消耗を観察した後、その乳児を消耗症と診断した。","type":"adjective","meaning_category":"Medical Condition"},{"sentence":"Nutritional intervention is crucial for treating marasmic children and preventing long-term health complications.","translation":"栄養介入は、消耗症の子供たちを治療し、長期的な健康上の合併症を防ぐために不可欠である。","type":"adjective","meaning_category":"Medical Treatment"},{"sentence":"The aid workers were shocked by the number of marasmic children in the refugee camp.","translation":"援助労働者は、難民キャンプにいる消耗症の子供たちの数に衝撃を受けた。","type":"adjective","meaning_category":"Humanitarian Crisis"}]}