{"word":"laminar","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"層状の、薄板状の；層流の","english_definition":"arranged in layers or sheets; (of fluid flow) occurring in smooth, parallel layers with little or no mixing.","examples":[{"sentence":"Laminar rock formations are often found in sedimentary environments.","translation":"層状の岩石構造は、堆積環境でよく見られる。"},{"sentence":"The experiment requires laminar flow of air to ensure accurate measurements.","translation":"実験では、正確な測定を保証するために空気の層流が必要である。"}],"collocations":["laminar flow","laminar structure","laminar boundary layer"],"synonyms":["layered","stratified","sheet-like","smooth","streamlined"],"antonyms":["turbulent","chaotic","mixed"]}],"etymology":{"value":"From Latin 'lamina' meaning 'thin plate, layer'.","priority":"★★★"},"pronunciation":{"ipa":"/ˈlæmɪnər/","syllables":"lam-i-nar"},"inflection":{"notes":"Comparative and superlative forms are possible but not common (more laminar, most laminar)."},"usage_notes":{"explanation":"'Laminar' is most commonly used in scientific and technical contexts, particularly in geology (describing rock formations) and fluid dynamics (describing smooth, non-turbulent flow). It emphasizes the arrangement in distinct layers or the smooth, orderly nature of flow.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The water was very laminar and rough.","correct":"The water was very laminar and smooth.","note":"Laminar flow implies smoothness, so it cannot be rough."}],"priority":"★★☆"},"related_words":{"derivatives":["lamina (noun: a thin plate or layer)","laminate (verb: to overlay with a thin layer; noun: a material constructed from layers)","lamination (noun: the process of laminating; a layered structure)"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Laminar' is a technical term primarily used in scientific and engineering fields. It describes something arranged in layers or, more commonly, a type of fluid flow characterized by smooth, parallel layers with minimal mixing. Understanding requires familiarity with scientific concepts like fluid dynamics or geology."},"example_sentences":[{"sentence":"The wing was designed to maintain laminar airflow and reduce drag.","translation":"翼は、層流を維持し、抗力を減らすように設計された。","type":"general","meaning_category":"fluid dynamics"},{"sentence":"The shale exhibited a distinct laminar structure.","translation":"頁岩は明確な層状構造を示した。","type":"general","meaning_category":"geology"}]}