{"word":"oversocial","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"社交的すぎる、過度に社交的な","english_definition":"Excessively sociable; excessively fond of company.","examples":[{"sentence":"He's a bit oversocial; he can't stand being alone.","translation":"彼は少し社交的すぎる。一人でいるのが耐えられないんだ。"},{"sentence":"An oversocial person might find it difficult to focus on solitary tasks.","translation":"社交的すぎる人は、一人で行う作業に集中するのが難しいと感じるかもしれない。"}],"collocations":["oversocial behavior","oversocial personality","tendency to be oversocial"],"synonyms":["gregarious","outgoing","extroverted","sociable","convivial"],"antonyms":["antisocial","unsociable","introverted","reclusive"]},{"part_of_speech":"adjective","definition":"(行動が)社会生活を過度に重視する、社会的な活動に偏っている","english_definition":"(of behavior) placing excessive emphasis on social activities.","examples":[{"sentence":"His oversocial lifestyle left him little time for his studies.","translation":"彼の社交的な生活スタイルは、勉強のための時間をほとんど残さなかった。"},{"sentence":"The oversocial schedule of events left many attendees exhausted.","translation":"社会的なイベントで過密なスケジュールは、多くの参加者を疲れさせた。"}],"collocations":["oversocial lifestyle","oversocial schedule","oversocial calendar"],"synonyms":["busy","hectic","eventful"],"antonyms":["quiet","sedate","unhurried"]}],"etymology":{"value":"'over-' (過度に) + 'social' (社交的な)","priority":"★★★"},"pronunciation":{"ipa":"/ˌoʊvərˈsoʊʃəl/","syllables":"o-ver-so-cial"},"inflection":{"notes":"形容詞なので、比較級・最上級は more oversocial, most oversocial となりますが、あまり一般的ではありません。"},"usage_notes":{"explanation":"\"Oversocial\" describes someone who is excessively sociable or a situation that involves too much social activity. It often carries a negative connotation, suggesting that the person or situation is imbalanced or that the social activity is interfering with other important aspects of life. The word is relatively uncommon, but it is useful for describing a specific type of behavior or lifestyle.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is very oversocial, so he is always lonely.","correct":"✓ He is very oversocial, so he is rarely lonely.","note":"Oversocial people are usually not lonely because they enjoy being around others."},{"incorrect":"✗ She is oversocial to her work.","correct":"✓ She is oversocial and neglects her work.","note":"The correct usage implies that someone's social life is interfering with other aspects of their life, such as work."}],"priority":"★★☆"},"related_words":{"derivatives":["oversocialize (動詞: 社交的になりすぎる)"],"phrases":["social butterfly (社交的な人、人気者)","socialite (社交界の名士)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Oversocial\" is a word used to describe someone who is excessively sociable or a situation that involves too much social activity. It suggests that the person or situation is imbalanced or that the social activity is interfering with other important aspects of life. This word is not very common, so it is important to understand its specific meaning before using it. It is often used in contexts where someone's social life is negatively affecting their work or personal life."},"example_sentences":[{"sentence":"His oversocial nature often led him to accept invitations even when he was exhausted.","translation":"彼の社交的な性格は、疲れていても招待を断れないことがよくあった。","type":"adjective","meaning_category":"過度に社交的な"},{"sentence":"The conference had an oversocial atmosphere, with networking events scheduled every evening.","translation":"その会議は社交的な雰囲気が強く、毎晩ネットワーキングイベントが予定されていた。","type":"adjective","meaning_category":"社会的な活動に偏っている"}]}