{"word":"clamatorial","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"(鳥類が)騒々しく鳴く、よく鳴き叫ぶ","english_definition":"(of birds) noisy; given to loud calling or crying.","examples":[{"sentence":"The clamatorial birds filled the forest with their calls.","translation":"騒々しく鳴く鳥たちが、その鳴き声で森を満たした。"},{"sentence":"The clamatorial nature of the mockingbird makes it easily identifiable.","translation":"マネシツグミの騒々しく鳴く性質は、それを見分けやすくしている。"}],"collocations":["clamatorial birds","clamatorial calls","clamatorial behavior"],"synonyms":["vociferous","raucous","strident","loud","noisy"],"antonyms":["silent","quiet","taciturn"]}],"etymology":{"value":"Late Latin *clamatorius*, from Latin *clamator* (shouter, crier), from *clamare* (to cry out, shout).","priority":"★★☆"},"pronunciation":{"ipa":"/klæməˈtɔːriəl/","syllables":"cla-ma-to-ri-al"},"inflection":{"notes":"Adjective, comparative and superlative forms are 'more clamatorial' and 'most clamatorial' respectively."},"usage_notes":{"explanation":"'Clamatorial' is a relatively uncommon word, primarily used in ornithology to describe birds that are notably loud or vocal. It emphasizes the characteristic of emitting frequent and often raucous calls. It is not generally used to describe human sounds.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The clamatorial children were playing in the park.","correct":"✓ The noisy children were playing in the park.","note":"'Clamatorial' is typically reserved for describing the vocalizations of birds, not humans."},{"incorrect":"✗ The clamatorial silence was broken by a sudden noise.","correct":"✓ The oppressive silence was broken by a sudden noise.","note":"'Clamatorial' describes loud sounds, not silence. It is an antonym to silence."}],"priority":"★★☆"},"related_words":{"derivatives":["clamator (noun: one who shouts or cries out)","clamor (noun: a loud and confused noise, especially that of people shouting vehemently)","exclamatory (adjective: relating to or characterized by exclamation)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (Not typically included in CEFR vocabulary lists)","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Clamatorial' is a specialized term, primarily used in the context of ornithology or advanced vocabulary. It describes the characteristic of birds that are notably loud or vocal. Due to its limited usage and technical nature, it is considered a high-level vocabulary word."},"example_sentences":[{"sentence":"The dawn chorus was particularly clamatorial this morning.","translation":"今朝の明け方の合唱は特に騒々しかった。","type":"adjective","meaning_category":"騒々しく鳴く"},{"sentence":"Ornithologists often classify birds based on their clamatorial habits.","translation":"鳥類学者は、鳥を騒々しく鳴く習性に基づいて分類することがよくある。","type":"adjective","meaning_category":"騒々しく鳴く"},{"sentence":"The parrot's clamatorial squawks echoed through the aviary.","translation":"オウムの騒々しい叫び声が鳥小屋に響き渡った。","type":"adjective","meaning_category":"騒々しく鳴く"}]}