{"word":"unfervent","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"熱心でない、情熱的でない、不熱心な","english_definition":"not fervent; lacking in enthusiasm or intensity.","examples":[{"sentence":"His unfervent support for the cause was noticeable.","translation":"彼のその大義への不熱心な支持は目立っていた。"},{"sentence":"The performance was unfervent and failed to move the audience.","translation":"そのパフォーマンスは熱意に欠け、観客を感動させることができなかった。"},{"sentence":"An unfervent handshake can suggest a lack of sincerity.","translation":"不熱心な握手は誠意の欠如を示唆することがある。"}],"collocations":["unfervent support","unfervent performance","unfervent belief","unfervent endorsement","unfervent response"],"synonyms":["apathetic","indifferent","lukewarm","tepid","halfhearted","unenthusiastic","blasé","nonchalant"],"antonyms":["fervent","passionate","enthusiastic","ardent","zealous","intense"]}],"etymology":{"value":"接頭辞 un-（～でない）+ fervent（熱心な）","priority":"★★☆"},"pronunciation":{"ipa":"/ʌnˈfɜːrvənt/","syllables":"un-fer-vent"},"inflection":{"adjective_forms":{"comparative":"more unfervent","superlative":"most unfervent"}},"usage_notes":{"explanation":"\"Unfervent\" describes a lack of strong feeling, enthusiasm, or passion. It suggests a state of indifference or a lack of commitment to something. It is often used to describe actions, beliefs, or expressions that are not marked by zeal or intensity.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He gave an unfervent speech with many emotions.","correct":"✓ He gave an unfervent speech, showing little emotion.","note":"\"Unfervent\" means lacking emotion, so it's contradictory to say it was \"with many emotions.\""},{"incorrect":"✗ The unfervent heat made the room comfortable.","correct":"✓ The mild heat made the room comfortable.","note":"\"Unfervent\" refers to a lack of emotional intensity, not physical intensity. Use \"mild\" or \"gentle\" to describe low levels of heat."}],"priority":"★★☆"},"related_words":{"derivatives":["unfervently (adverb: 熱心でなく、情熱的でなく)","fervent (adjective: 熱心な、情熱的な)","fervor (noun: 熱心、情熱)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Unfervent\" is a relatively uncommon word that means lacking in enthusiasm or passion. It is used to describe something that is not intense or zealous. Because it is not frequently used, it is more likely to be encountered in formal writing or speech. Understanding the root word \"fervent\" (meaning passionate or enthusiastic) helps in understanding \"unfervent.\"","priority":"★★☆"},"example_sentences":[{"sentence":"The politician's unfervent response to the crisis raised concerns about his commitment.","translation":"政治家のその危機に対する不熱心な反応は、彼のコミットメントに対する懸念を高めた。","type":"adjective","meaning_category":"熱心でない"},{"sentence":"Her unfervent apology did little to mend the hurt feelings.","translation":"彼女の不熱心な謝罪は、傷ついた感情をほとんど癒すことができなかった。","type":"adjective","meaning_category":"情熱的でない"},{"sentence":"The audience remained unfervent despite the actor's best efforts.","translation":"俳優の最善の努力にもかかわらず、観客は熱狂的ではなかった。","type":"adjective","meaning_category":"不熱心な"}]}