{"word":"Scorpiid","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(天文学)さそり座流星群の流星","english_definition":"A meteor from the Scorpiid meteor shower.","examples":[{"sentence":"The Scorpiid meteor shower is best viewed in late spring.","translation":"さそり座流星群は春の終わりに最もよく見えます。"}],"collocations":["Scorpiid meteor shower (さそり座流星群)"],"synonyms":["none"],"antonyms":["none"]},{"part_of_speech":"noun","definition":"(生物学、まれ)サソリ目の動物","english_definition":"(rare) An animal belonging to the order Scorpiones (scorpions).","examples":[{"sentence":"The Scorpiid is an arachnid characterized by a segmented tail and venomous stinger.","translation":"サソリ目は、分節された尾と有毒な刺針を特徴とするクモ形類です。"}],"collocations":["none"],"synonyms":["scorpion"],"antonyms":["none"]}],"etymology":{"value":"Derived from Scorpius (the constellation Scorpius or the order Scorpiones) + -id (suffix indicating a member of a group or a descendant).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈskɔːrpiɪd/","syllables":"scor-pi-id"},"inflection":{"noun_plural":"Scorpiids"},"usage_notes":{"explanation":"The term \"Scorpiid\" can refer to meteors associated with the Scorpius constellation or, less commonly, to scorpions themselves. The astronomical usage is more prevalent.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a scorpiid crawling in my house (when referring to a spider).","correct":"✓ I saw a scorpion crawling in my house.","note":"Use 'scorpion' for the animal, not 'scorpiid', unless in a very specific scientific context."}],"priority":"★☆☆"},"related_words":{"derivatives":["Scorpius","Scorpiones"],"phrases":["Scorpiid meteor shower"],"priority":"★★☆"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Scorpiid' is a specialized term primarily used in astronomy to refer to meteors from the Scorpiid meteor shower. Its usage in biology to refer to scorpions is rare. The word's meaning is derived from its connection to the constellation Scorpius or the order Scorpiones, combined with the suffix '-id', indicating membership or origin. Understanding this term requires familiarity with astronomical and biological nomenclature."},"example_sentences":[{"sentence":"During the annual Scorpiid meteor shower, stargazers gather to witness the celestial display.","translation":"毎年恒例のさそり座流星群の間、星空観察者は天体のショーを目撃するために集まります。","type":"noun","meaning_category":"さそり座流星群の流星"},{"sentence":"(Rare) The Scorpiid used its venomous stinger to defend itself.","translation":"(まれ)サソリ目は、身を守るために有毒な針を使用しました。","type":"noun","meaning_category":"サソリ目の動物"}]}