{"word":"teasers","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形) 焦らし広告、予告編、ティーザー広告","english_definition":"(plural) advertisements or promotions designed to arouse curiosity and create interest in a product or service without revealing all the details.","examples":[{"sentence":"The company released a series of teasers before the official product launch.","translation":"その会社は、公式製品発表の前に一連のティーザー広告を公開した。"},{"sentence":"Movie teasers often show only brief clips to build anticipation.","translation":"映画のティーザー広告は、期待感を高めるために短いクリップのみを表示することが多い。"}],"collocations":["movie teasers (映画のティーザー広告)","product teasers (製品のティーザー広告)","campaign teasers (キャンペーンのティーザー広告)"],"synonyms":["previews","trailers","promos","sneak peeks"],"antonyms":["full reveal","complete disclosure"]},{"part_of_speech":"noun","definition":"(複数形) いじめる人、からかう人","english_definition":"(plural) people who tease or playfully mock others.","examples":[{"sentence":"The older kids were teasers, always making fun of the younger ones.","translation":"年上の子供たちはからかう人で、いつも年下の子をからかっていた。"},{"sentence":"Don't pay attention to the teasers; they're just trying to get a reaction.","translation":"からかう人に注意を払わないで。彼らはただ反応を得ようとしているだけだ。"}],"collocations":["school teasers (学校のからかう人)","playground teasers (遊び場のからかう人)"],"synonyms":["bullies","tormentors","mockers","taunters"],"antonyms":["supporters","friends","comforters"]},{"part_of_speech":"noun","definition":"(複数形) 知恵の輪、パズル","english_definition":"(plural) puzzles or riddles that test one's ingenuity or knowledge.","examples":[{"sentence":"The book is full of brain teasers to challenge your mind.","translation":"その本は、あなたの心を試すための知恵の輪でいっぱいだ。"},{"sentence":"Solving logic teasers can improve your problem-solving skills.","translation":"論理的な知恵の輪を解くことは、問題解決能力を向上させることができる。"}],"collocations":["brain teasers (知恵の輪)","logic teasers (論理的な知恵の輪)","math teasers (数学の知恵の輪)"],"synonyms":["puzzles","riddles","brainteasers","challenges"],"antonyms":["straightforward questions","easy problems"]}],"etymology":{"value":"The word \"teaser\" comes from the verb \"tease,\" which means to annoy or provoke someone in a playful or irritating way. The advertising sense developed from the idea of teasing potential customers with incomplete information to pique their interest.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtiːzərz/","syllables":"tea-sers"},"inflection":{"noun_plural":"teasers (already plural)"},"usage_notes":{"explanation":"\"Teasers\" has multiple meanings depending on the context. In advertising, it refers to promotional materials designed to create curiosity. In a social context, it refers to people who tease others. It can also refer to puzzles or riddles. The context usually makes the intended meaning clear.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is one of the teasers.","correct":"✓ He is one of the teasers. / ✓ He is a teaser.","note":"\"Teasers\" is already plural. If referring to one person, use \"a teaser.\" If referring to a group, use \"teasers.\""},{"incorrect":"✗ The company used a teaser to advertise their new product, it was very effective.","correct":"✓ The company used teasers to advertise their new product; they were very effective. / ✓ The company used a teaser campaign to advertise their new product; it was very effective.","note":"If referring to multiple advertisements, use \"teasers.\" If referring to the campaign as a whole, use \"a teaser campaign.\""}],"priority":"★★☆"},"related_words":{"derivatives":["tease (verb, noun)","teasing (adjective)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'teasers' can refer to different things depending on the context. It can mean advertisements that try to make you curious about something without giving away all the details. It can also mean people who like to playfully annoy or make fun of others. Finally, it can refer to puzzles or riddles that are designed to be challenging. Pay attention to the surrounding words to understand which meaning is intended.","priority":"★★☆"},"example_sentences":[{"sentence":"The marketing team created several engaging video teasers.","translation":"マーケティングチームは、いくつかの魅力的なビデオティーザーを作成した。","type":"noun","meaning_category":"焦らし広告"},{"sentence":"The older boys were known as the teasers of the neighborhood.","translation":"年上の男の子たちは、近所のからかう人として知られていた。","type":"noun","meaning_category":"いじめる人"},{"sentence":"She enjoys solving brain teasers in her free time.","translation":"彼女は暇な時間に知恵の輪を解くのを楽しんでいる。","type":"noun","meaning_category":"知恵の輪"}]}