{"word":"homonegativity","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"同性愛嫌悪に類似する概念で、同性愛者に対する否定的な態度や信念、感情を指すが、より微妙で間接的な形をとることが多い。直接的な憎悪や差別というよりは、不安、不快感、軽蔑、あるいは同性愛者の存在や権利に対する消極的な拒絶として現れることがある。","english_definition":"A concept similar to homophobia, referring to negative attitudes, beliefs, or feelings towards homosexuals, but often taking more subtle and indirect forms. It may manifest as anxiety, discomfort, disdain, or passive rejection of the existence or rights of homosexuals, rather than overt hatred or discrimination.","examples":[{"sentence":"Homonegativity can be expressed through microaggressions and subtle forms of exclusion.","translation":"同性愛嫌悪は、マイクロアグレッションや微妙な排除の形で表現されることがある。"},{"sentence":"Some people may exhibit homonegativity without realizing the impact of their words or actions.","translation":"自分の言葉や行動の影響に気づかずに同性愛嫌悪を示す人もいる。"},{"sentence":"Educational programs can help to reduce homonegativity by promoting understanding and empathy.","translation":"教育プログラムは、理解と共感を促進することで、同性愛嫌悪を減らすのに役立つ。"}],"collocations":["internalized homonegativity (内面化された同性愛嫌悪)","express homonegativity (同性愛嫌悪を表現する)","reduce homonegativity (同性愛嫌悪を減らす)","combat homonegativity (同性愛嫌悪と闘う)","challenge homonegativity (同性愛嫌悪に異議を唱える)"],"synonyms":["homophobia","anti-gay bias","heterosexism","sexual prejudice"],"antonyms":["homophilia","acceptance","tolerance","inclusion","equality"]}],"etymology":{"value":"\"Homo-\"（同性）+ \"negativity\"（否定性）からなる造語。同性愛に対する否定的な感情や態度を表す。","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌhoʊmoʊˌnɛɡəˈtɪvɪti/","syllables":"ho-mo-neg-a-tiv-i-ty"},"inflection":{"notes":"不可算名詞"},"usage_notes":{"explanation":"「**homonegativity**」は、「homophobia（同性愛嫌悪）」と似た概念ですが、より広範で微妙なニュアンスを含みます。homophobia が直接的な恐怖や嫌悪感を指すのに対し、homonegativity は不安、不快感、軽蔑、あるいは無関心といった、より間接的な否定的な感情や態度を指すことがあります。また、homonegativity は、同性愛者に対する差別的な行動を伴わない場合もあります。この用語は、社会における同性愛に対する否定的な態度をより包括的に理解するために用いられます。","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Homonegativity is the same as homophobia, so we can use them interchangeably.","correct":"✓ Homonegativity is related to homophobia, but it encompasses more subtle and indirect forms of negativity.","note":"Homonegativity は homophobia と関連する概念ですが、より微妙で間接的な否定性を指します。"},{"incorrect":"✗ Only overtly hateful people exhibit homonegativity.","correct":"✓ Homonegativity can be expressed through subtle biases and microaggressions, even by people who don't consider themselves hateful.","note":"Homonegativity は、直接的な憎悪を持たない人でも、微妙な偏見やマイクロアグレッションを通じて表れることがあります。"}],"priority":"☆☆☆"},"related_words":{"derivatives":["homonegative (形容詞: 同性愛嫌悪的な)"],"related_terms":["homophobia (同性愛嫌悪)","heteronormativity (異性愛規範)","internalized homophobia (内面化された同性愛嫌悪)","sexual prejudice (性的偏見)","microaggression (マイクロアグレッション)"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な文脈で使用されることが多い。","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"「**homonegativity**」は、同性愛者に対する否定的な態度や感情を指す言葉ですが、「homophobia（同性愛嫌悪）」よりも広い意味を持ちます。直接的な嫌悪感だけでなく、不安や不快感、無関心といった、より微妙な感情も含まれます。例えば、同性愛者の存在を認めつつも、どこか居心地の悪さを感じたり、同性愛に関する話題を避けたりする態度も、homonegativity の一種と言えます。この言葉は、社会における同性愛に対する否定的な感情をより深く理解するために使われます。専門的な文脈で使われることが多い言葉です。"},"example_sentences":[{"sentence":"The study examined the impact of homonegativity on the mental health of LGBTQ+ individuals.","translation":"その研究は、同性愛嫌悪が LGBTQ+ の人々の精神的健康に与える影響を調査した。","type":"noun","meaning_category":"同性愛嫌悪"},{"sentence":"Many LGBTQ+ individuals experience internalized homonegativity, which can lead to feelings of shame and self-doubt.","translation":"多くの LGBTQ+ の人々は内面化された同性愛嫌悪を経験し、それが恥や自己不信の感情につながることがある。","type":"noun","meaning_category":"同性愛嫌悪"},{"sentence":"The organization aims to combat homonegativity through education and advocacy.","translation":"その組織は、教育と擁護を通じて同性愛嫌悪と闘うことを目指している。","type":"noun","meaning_category":"同性愛嫌悪"}]}