{"word":"accusable","priority":"★☆☆","meanings":[{"part_of_speech":"adjective","definition":"非難されるべき、告訴されるべき、告発できる","english_definition":"deserving of accusation; liable to be accused.","examples":[{"sentence":"His actions were accusable, leading to public outrage.","translation":"彼の行動は非難されるべきものであり、大衆の怒りを招いた。"},{"sentence":"The company was found accusable of negligence.","translation":"その会社は過失で告発できると判断された。"},{"sentence":"Is this person accusable for the crime?","translation":"この人物はその犯罪で告発できますか？"}],"collocations":["accusable conduct (非難されるべき行為)","accusable offense (告訴されるべき犯罪)","be accusable of (～で告発できる)"],"synonyms":["blameworthy","culpable","reprehensible","indictable","chargeable"],"antonyms":["blameless","innocent","excusable","praiseworthy"]}],"etymology":{"value":"\"Accusable\" comes from the verb \"accuse,\" which originates from the Latin \"accusare\" (to call to account, to blame, to accuse). The suffix \"-able\" indicates capability or suitability for something. Thus, \"accusable\" means capable of being accused.","priority":"★★☆"},"pronunciation":{"ipa":"/əˈkjuːzəbəl/","syllables":"ac-cu-sa-ble"},"inflection":{"adjective_forms":{"comparative":"more accusable","superlative":"most accusable"}},"usage_notes":{"explanation":"\"Accusable\" is an adjective that describes someone or something deserving of being accused, typically of a wrongdoing or crime. It suggests that there is sufficient reason or evidence to warrant an accusation, though it does not necessarily imply guilt. The term is relatively formal and less commonly used than synonyms like \"blameworthy\" or \"culpable.\"","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The situation was very accuse.","correct":"✓ The situation was very accusable.","note":"\"Accuse\" is a verb. The adjective form is \"accusable.\""},{"incorrect":"✗ He is accusable for the accident.","correct":"✓ He is accusable of the accident.","note":"The correct preposition to use with \"accusable\" in this context is \"of.\""}],"priority":"★★☆"},"related_words":{"derivatives":["accuse (verb: 告発する)","accusation (noun: 告発)","accuser (noun: 告発者)","accusatory (adjective: 告発的な)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word \"accusable\" means that someone or something deserves to be accused of doing something wrong. It's a formal word that you might find in legal or serious contexts. It suggests there's a good reason to accuse someone, but it doesn't mean they are definitely guilty. For example, if someone's actions clearly broke a rule, you might say their actions were \"accusable.\" It's not a word you'd use in everyday conversation very often."},"example_sentences":[{"sentence":"The politician's questionable dealings made him accusable of corruption.","translation":"その政治家の疑わしい取引は、彼を汚職で告発できるものにした。","type":"adjective","meaning_category":"deserving of accusation"},{"sentence":"The company's failure to comply with safety regulations rendered them accusable of negligence.","translation":"その会社が安全規制を遵守しなかったことは、彼らを過失で告発できるものにした。","type":"adjective","meaning_category":"liable to be accused"},{"sentence":"While his behavior was inappropriate, it wasn't necessarily accusable under the law.","translation":"彼の行動は不適切だったが、必ずしも法律の下で告発できるものではなかった。","type":"adjective","meaning_category":"chargeable"}]}