{"word":"surplus-financed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"黒字財政の、余剰資金で賄われた","english_definition":"Funded or supported by surplus funds; relating to a financial situation where income exceeds expenditure.","examples":[{"sentence":"The government aimed for a surplus-financed budget to reduce national debt.","translation":"政府は国債を削減するために黒字財政予算を目指した。"},{"sentence":"The project was surplus-financed, allowing for expansion without borrowing.","translation":"そのプロジェクトは余剰資金で賄われていたため、借入なしで拡大することができた。"}],"collocations":["surplus-financed budget","surplus-financed project","surplus-financed investment"],"synonyms":["self-funded","internally financed","profit-funded"],"antonyms":["deficit-financed","debt-financed","loan-funded"]},{"part_of_speech":"adjective","definition":"(特に社会保障制度などが)積立金で賄われている","english_definition":"(Especially of a social security system) funded by accumulated surpluses or reserves.","examples":[{"sentence":"The surplus-financed pension system ensured benefits for future retirees.","translation":"積立金で賄われている年金制度は、将来の退職者のための給付を保証した。"}],"collocations":["surplus-financed pension system","surplus-financed social security"],"synonyms":["reserve-funded","endowment-funded"],"antonyms":["pay-as-you-go","unfunded"]}],"etymology":{"value":"The term is formed by combining \"surplus\" (an excess of income or assets) with \"financed\" (provided with funds).","priority":"N/A"},"pronunciation":{"ipa":"ˈsɜːrplʌs faɪˌnænst/","syllables":"sur-plus-fi-nanced"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"\"Surplus-financed\" describes situations where funding originates from accumulated profits or excess revenue, rather than debt or external sources. It is often used in discussions of government budgets, large projects, or social security systems.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The project was surplus financed by the bank.","correct":"✓ The project was surplus-financed and didn't require bank loans.","note":"\"Surplus-financed\" implies the absence of external funding like bank loans. Using \"by the bank\" contradicts the meaning."}],"priority":"★☆☆"},"related_words":{"derivatives":["surplus (noun)","finance (verb)","financing (noun)"],"phrases":["budget surplus","fiscal surplus","revenue surplus"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized financial and economic term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Surplus-financed\" is a term used in economics and finance to describe something that is paid for using extra money that is available, rather than borrowing money or using other sources of funds. It's often used when talking about government budgets or large projects that are paid for with extra tax money or profits. The opposite of surplus-financed is often \"deficit-financed\" or \"debt-financed\", which means that something was paid for by borrowing money.","priority":"★★☆"},"example_sentences":[{"sentence":"The new infrastructure project was entirely surplus-financed, a testament to the city's strong economy.","translation":"その新しいインフラプロジェクトは完全に黒字財政で賄われており、市の強力な経済力の証となっている。","type":"adjective","meaning_category":"黒字財政の"},{"sentence":"The company's surplus-financed research program led to several groundbreaking innovations.","translation":"その会社の余剰資金で賄われた研究プログラムは、いくつかの画期的なイノベーションにつながった。","type":"adjective","meaning_category":"余剰資金で賄われた"},{"sentence":"The government boasted about its surplus-financed social programs, claiming they were sustainable in the long term.","translation":"政府は、その黒字財政で賄われた社会プログラムを誇り、長期的に持続可能であると主張した。","type":"adjective","meaning_category":"黒字財政の"}]}