{"word":"directdiscourse","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"直接話法、直接引用","english_definition":"The reporting of speech by repeating the actual words of a speaker.","examples":[{"sentence":"The novel used a lot of direct discourse to make the characters more vivid.","translation":"その小説は、登場人物をより生き生きとさせるために、直接話法を多用していた。"},{"sentence":"In direct discourse, the speaker's words are enclosed in quotation marks.","translation":"直接話法では、話し手の言葉は引用符で囲まれる。"},{"sentence":"He used direct discourse to emphasize the importance of the statement.","translation":"彼は、その発言の重要性を強調するために直接話法を用いた。"}],"collocations":["use direct discourse","in direct discourse","convert to direct discourse","examples of direct discourse"],"synonyms":["quoted speech","verbatim speech","literal quotation"],"antonyms":["indirect discourse","reported speech","paraphrase"]}],"etymology":{"value":"'Direct' comes from Latin 'directus,' meaning 'straight' or 'explicit.' 'Discourse' comes from Latin 'discursus,' meaning 'conversation' or 'speech.' The combination refers to the straight or explicit representation of speech.","priority":"★★☆"},"pronunciation":{"ipa":"/daɪˌrɛkt ˈdɪsˌkɔːrs/","syllables":"di-rect-dis-course"},"inflection":{"noun_plural":"direct discourses"},"usage_notes":{"explanation":"Direct discourse is a way of reporting what someone said by using their exact words, usually enclosed in quotation marks. It contrasts with indirect discourse (reported speech), where the speaker's words are paraphrased. Direct discourse is often used to add emphasis, authenticity, or vividness to writing.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He said, \"I am going.\" That is indirect discourse.","correct":"✓ He said, \"I am going.\" That is direct discourse.","note":"The example provided is direct discourse because it uses the exact words of the speaker enclosed in quotation marks."},{"incorrect":"✗ Direct discourse doesn't use quotation marks.","correct":"✓ Direct discourse uses quotation marks to enclose the speaker's exact words.","note":"Quotation marks are a key feature of direct discourse."}],"priority":"★★☆"},"related_words":{"derivatives":["discourse (noun)","direct (adjective)"],"phrasal_verbs":[],"related_terms":["indirect discourse","reported speech","quotation","verbatim","paraphrase"],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, primarily used in linguistic or literary contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Direct discourse' is a term used in language studies and writing to describe when someone's exact words are quoted. It's more complex than everyday language because it's a specific way of presenting speech or thoughts in writing. Understanding it requires recognizing the difference between quoting someone directly and summarizing what they said (indirect discourse).","priority":"★☆☆"},"example_sentences":[{"sentence":"In her novel, she often used direct discourse to bring the characters' voices to life.","translation":"彼女の小説では、登場人物の声に命を吹き込むために、直接話法がよく使われた。","type":"example","meaning_category":"Usage in literature"},{"sentence":"The witness provided a clear example of direct discourse when recounting the events.","translation":"目撃者は、出来事を語る際に直接話法の明確な例を示した。","type":"example","meaning_category":"Reporting events"},{"sentence":"The teacher explained the difference between direct discourse and indirect discourse to the students.","translation":"教師は生徒たちに直接話法と間接話法の違いを説明した。","type":"example","meaning_category":"Teaching linguistics"}]}