{"word":"Redia","meanings":[{"part_of_speech":"noun","definition":"(生物学) レディア：吸虫類の幼生の一形態。スポロシスト内で発生し、さらに別の世代のレディアやセルカリアを産生する。","english_definition":"(biology) A larval stage of certain trematodes (flukes) which develops within the sporocyst, and produces either another generation of rediae or cercariae.","examples":[{"sentence":"The redia stage is characterized by the presence of a gut.","translation":"レディア期は腸の存在によって特徴づけられる。"},{"sentence":"Rediae are more complex than sporocysts.","translation":"レディアはスポロシストよりも複雑である。"}],"collocations":["redia stage","redia larva","develop into redia","produce redia"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"19th century: named after Francesco Redi, Italian physician and naturalist who disproved spontaneous generation.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈriːdiə/","syllables":"Ree-di-a"},"inflection":{"noun_plural":"rediae"},"usage_notes":{"explanation":"The term 'redia' is specific to the life cycle of trematodes. It refers to a particular larval stage that develops within a sporocyst and is capable of producing more rediae or cercariae. Understanding the redia stage is important in studying the life cycle and transmission of parasitic flukes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The redia is a type of worm.","correct":"✓ The redia is a larval stage of a trematode (fluke).","note":"Rediae are not worms themselves, but a larval stage of parasitic flatworms (trematodes)."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["trematode","fluke","sporocyst","cercaria","metacercaria","life cycle"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2 (specialized scientific vocabulary)","frequency_google_ngram":"Low frequency - Specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Redia' is a technical term used in parasitology and biology to describe a specific larval stage of trematodes (flukes). It is not a commonly used word outside of these scientific contexts. Understanding the term requires knowledge of the life cycles of parasitic worms.","priority":"★★☆"},"example_sentences":[{"sentence":"The snail acts as an intermediate host in which the sporocyst develops into the redia stage.","translation":"そのカタツムリは、スポロシストがレディア期に発達する中間宿主として機能する。","type":"noun","meaning_category":"biology"},{"sentence":"The rediae actively feed within the snail host.","translation":"レディアはカタツムリの宿主内で活発に摂食する。","type":"noun","meaning_category":"biology"},{"sentence":"The number of rediae produced within a sporocyst can vary greatly.","translation":"1つのスポロシスト内で産生されるレディアの数は大きく異なる場合がある。","type":"noun","meaning_category":"biology"}]}