{"word":"godships","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"(rare) ships considered to be of divine origin or possessing divine qualities; ships associated with gods or deities.","english_definition":"(rare) ships considered to be of divine origin or possessing divine qualities; ships associated with gods or deities.","examples":[{"sentence":"In ancient mythology, certain vessels were revered as godships, believed to carry the power of the gods across the seas.","translation":"古代神話では、特定の船は神船として崇拝され、神々の力を海を越えて運ぶと信じられていました。"},{"sentence":"The Viking longboats, with their dragon-headed prows, could be seen as godships, symbols of their seafaring gods.","translation":"竜の頭の舳先を持つヴァイキングのロングボートは、彼らの航海の神々の象徴である神船と見なすことができます。"}],"collocations":["divine godships","ancient godships","mythical godships"],"synonyms":["divine vessels","sacred ships","deity ships"],"antonyms":[]}],"etymology":{"value":"A compound word formed from 'god' and 'ships'. The concept likely arises from cultures where seafaring and maritime activities were deeply intertwined with religious beliefs and mythology.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɡɒdʃɪps/","syllables":"god-ships"},"inflection":{"noun_plural":"godships"},"usage_notes":{"explanation":"The term 'godships' is not commonly used in modern English. It is primarily found in discussions of mythology, religious history, or fantasy literature. The word suggests a strong connection between ships and divine entities, often implying that the ships themselves are either sacred or possess supernatural qualities.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The godships is sailing to the new world.","correct":"✓ The godships are sailing to the new world.","note":"'Godships' is a plural noun, so it requires a plural verb form ('are')."},{"incorrect":"✗ The godships was a beautiful sight.","correct":"✓ The godship was a beautiful sight.","note":"If referring to a single ship, use the singular form 'godship' and the singular verb form ('was')."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency. The term is rare and not commonly used in general English.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Godships' is a rare and specialized term, primarily encountered in academic or literary contexts dealing with mythology, religious studies, or fantasy. Understanding the word requires familiarity with the concept of attributing divine qualities to objects or vessels, a common theme in various cultures' mythologies. Due to its infrequent usage, it is not part of standard English vocabulary.","priority":"★☆☆"},"example_sentences":[{"sentence":"The ancient Egyptians revered certain boats as godships, believing they carried the sun god Ra across the sky each day.","translation":"古代エジプト人は、特定のボートを神船として崇拝し、太陽神ラーが毎日空を渡ると信じていました。","type":"noun","meaning_category":"mythology"},{"sentence":"In the fantasy novel, the protagonist sails aboard a godship, a vessel imbued with magical powers and the spirit of a sea deity.","translation":"ファンタジー小説では、主人公は神船に乗って航海します。神船は魔法の力と海の神の精神が吹き込まれた船です。","type":"noun","meaning_category":"literature"}]}