{"word":"realists","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"現実主義者、リアリスト","english_definition":"People who accept and deal with situations as they actually are, rather than hoping for things to be better or thinking about how things could be different.","examples":[{"sentence":"Realists believe in practical solutions rather than idealistic dreams.","translation":"現実主義者は、理想的な夢よりも現実的な解決策を信じている。"},{"sentence":"The realists in the group knew the project was unlikely to succeed.","translation":"グループ内の現実主義者たちは、プロジェクトが成功する可能性は低いと知っていた。"},{"sentence":"Some consider him a pessimist, but he sees himself as a realist.","translation":"彼を悲観主義者と見なす人もいるが、彼は自分自身を現実主義者だと考えている。"}],"collocations":["political realists (政治的現実主義者)","economic realists (経済的現実主義者)","pragmatic realists (実用的な現実主義者)","hard-headed realists (頭の固い現実主義者)"],"synonyms":["pragmatists","materialists","down-to-earth people","practical thinkers","level-headed individuals"],"antonyms":["idealists","dreamers","optimists","visionaries"]},{"part_of_speech":"noun","definition":"（美術・文学における）写実主義者、リアリスト","english_definition":"Artists or writers who depict subjects as they appear in real life, without idealization or romanticism.","examples":[{"sentence":"The realists aimed to portray everyday life accurately.","translation":"写実主義者たちは、日常生活を正確に描写することを目指した。"},{"sentence":"Courbet was one of the leading realists of the 19th century.","translation":"クールベは19世紀の主要な写実主義者の一人だった。"},{"sentence":"Realists in literature often focus on the struggles of ordinary people.","translation":"文学における写実主義者は、しばしば普通の人々の苦闘に焦点を当てる。"}],"collocations":["literary realists (文学的写実主義者)","artistic realists (芸術的写実主義者)","social realists (社会主義リアリズムの作家・芸術家)","19th-century realists (19世紀の写実主義者)"],"synonyms":["naturalists","verists","objective artists","representational artists"],"antonyms":["romanticists","idealists","expressionists","surrealists"]}],"etymology":{"value":"The word 'realist' comes from 'real,' which is derived from the Late Latin 'realis,' meaning 'relating to things as they are; genuine.' The suffix '-ist' denotes a person who adheres to or practices something.","priority":"★★☆"},"pronunciation":{"ipa":"ˈriːəlɪsts","syllables":"re-al-ists"},"inflection":{"noun_singular":"realist"},"usage_notes":{"explanation":"The term 'realists' can refer to individuals who approach situations practically and objectively, or to artists and writers who focus on depicting reality accurately. The context usually clarifies which meaning is intended. In political and economic contexts, 'realists' are often contrasted with 'idealists.' In art and literature, they are contrasted with 'romanticists' or 'idealists.'","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"He is a realists, he doesn't believe in magic.","correct":"He is a realist; he doesn't believe in magic.","note":"The singular form 'realist' should be used when referring to one person. Also, a semicolon or period is needed to connect two independent clauses."},{"incorrect":"The realists are always negative.","correct":"Realists are often cautious, but not always negative.","note":"While realists tend to be pragmatic, it's a stereotype to assume they are always negative. Their realism can also lead to positive outcomes through careful planning."}],"priority":"★★☆"},"related_words":{"derivatives":["realism (noun: the quality of accepting reality and dealing with it practically; a style of art or literature that shows things as they actually are)","realistic (adjective: having or showing a practical understanding of things; resembling real life)","realistically (adverb: in a realistic manner)"],"related_concepts":["pragmatism (noun: a practical approach to problems and affairs)","materialism (noun: a tendency to consider material possessions and physical comfort as more important than spiritual values)","naturalism (noun: a philosophical viewpoint that emphasizes the importance of scientific observation and rejects supernatural explanations)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively common, especially in academic and journalistic contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'realists' refers to people who prefer to see and deal with things as they actually are, rather than how they might wish them to be. This can apply to various areas, such as politics, economics, or personal relationships. It can also refer to a movement in art and literature that focuses on depicting subjects realistically, without idealization. Understanding the context is important to determine the specific meaning.","priority":"★★☆"},"example_sentences":[{"sentence":"The **realists** on the team argued for a more conservative budget.","translation":"チームの現実主義者たちは、より保守的な予算を主張した。","type":"noun","meaning_category":"現実主義者（人）"},{"sentence":"The **realists** in the art world rejected romanticism.","translation":"美術界の写実主義者たちは、ロマン主義を拒否した。","type":"noun","meaning_category":"写実主義者（芸術家）"},{"sentence":"**Realists** are often seen as pessimistic, but they are simply pragmatic.","translation":"現実主義者はしばしば悲観的だと見なされるが、彼らは単に実用的であるだけだ。","type":"noun","meaning_category":"現実主義者（人）"},{"sentence":"The novel was praised for its portrayal of working-class life by **realists**.","translation":"その小説は、写実主義者たちによって、労働者階級の生活の描写が称賛された。","type":"noun","meaning_category":"写実主義者（芸術家）"}]}