{"word":"suspensions","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(複数形)一時停止、停職、出場停止、中断","english_definition":"(plural) the act of suspending someone or something; a temporary removal or cessation.","examples":[{"sentence":"The player received a two-game suspension for unsportsmanlike conduct.","translation":"その選手はスポーツマンシップに反する行為で2試合の出場停止処分を受けた。"},{"sentence":"The project is on suspension due to lack of funding.","translation":"そのプロジェクトは資金不足のため中断されている。"},{"sentence":"The employee faced suspensions pending an investigation.","translation":"その従業員は調査の結果が出るまで停職処分を受けた。"}],"collocations":["game suspension (試合出場停止)","work suspension (業務停止)","temporary suspension (一時停止)","suspension from school (停学)","suspension of disbelief (サスペンション・オブ・ディスビリーフ、物語への没入を促すために、非現実的な要素を一時的に信じること)","suspension bridge (吊り橋)"],"synonyms":["hiatus","interruption","moratorium","deferment","postponement","layoff","banishment","exclusion"],"antonyms":["continuation","resumption","reinstatement"]},{"part_of_speech":"noun","definition":"(複数形)懸濁液、懸濁状態","english_definition":"(plural) a mixture in which particles are dispersed throughout a fluid but are not dissolved.","examples":[{"sentence":"The medicine is a suspension and needs to be shaken well before use.","translation":"この薬は懸濁液なので、使用前に良く振る必要があります。"},{"sentence":"The scientist studied the properties of the suspensions.","translation":"科学者は懸濁液の特性を研究した。"}],"collocations":["colloidal suspension (コロイド懸濁液)","aqueous suspension (水性懸濁液)","stable suspension (安定した懸濁液)"],"synonyms":["mixture","dispersion","emulsion"],"antonyms":["solution"]},{"part_of_speech":"noun","definition":"(複数形)サスペンション（自動車などの）","english_definition":"(plural) the system of springs and shock absorbers in a vehicle.","examples":[{"sentence":"The car has a smooth suspension.","translation":"その車は乗り心地の良いサスペンションを備えている。"},{"sentence":"He upgraded the suspensions on his truck.","translation":"彼はトラックのサスペンションをアップグレードした。"}],"collocations":["air suspension (エアサスペンション)","coil suspension (コイルスプリングサスペンション)","independent suspension (独立懸架式サスペンション)"],"synonyms":["springs","shock absorbers"],"antonyms":[]}],"etymology":{"value":"The word \"suspension\" comes from the Latin word \"suspendere,\" meaning \"to hang up, to suspend.\" This is formed from \"sub-\" (up from below) and \"pendere\" (to hang). The various meanings of suspension all relate to this core idea of something being held up, whether physically or metaphorically.","priority":"☆☆☆"},"pronunciation":{"ipa":"/səˈspɛnʃənz/","syllables":"sus-pen-shuns"},"inflection":{"noun_singular":"suspension"},"usage_notes":{"explanation":"The word \"suspensions\" is the plural form of \"suspension,\" which has several distinct meanings. It can refer to a temporary removal or cessation, such as a suspension from school or a suspension of disbelief. In chemistry, it refers to a mixture where particles are dispersed but not dissolved. In automotive contexts, it refers to the suspension system of a vehicle. The specific meaning is usually clear from the context.","priority":"☆☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The suspension was given to him for one game.","correct":"✓ A suspension was given to him for one game.","note":"When referring to a single instance of suspension, use the singular form \"suspension.\""},{"incorrect":"✗ The suspensions of the bridge were damaged.","correct":"✓ The cables of the suspension bridge were damaged.","note":"When referring to a suspension bridge, it is more accurate to say \"cables\" rather than \"suspensions.\" The suspension is the system, not the individual components."}],"priority":"☆☆☆"},"related_words":{"derivatives":["suspend (verb)","suspended (adjective)","suspensory (adjective)"],"phrasal_verbs":["suspend from (停職する、停止する)"],"priority":"☆☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but common in specific contexts (sports, science, engineering).","priority":"☆☆☆"},"readability_explanation":{"level":"B2","text":"The word \"suspensions\" is a plural noun with multiple meanings, making it a B2 level word. It can refer to a temporary removal (e.g., from a job or school), a mixture of undissolved particles in a liquid, or the system of springs and shock absorbers in a vehicle. Understanding the context is crucial to interpreting the intended meaning. The word is commonly used in sports, science, and engineering contexts, but less common in everyday conversation.","priority":"☆☆☆"},"example_sentences":[{"sentence":"The student faced suspensions for violating the school's code of conduct.","translation":"その生徒は学校の行動規範に違反したため停学処分を受けた。","type":"noun","meaning_category":"Temporary removal"},{"sentence":"The company announced suspensions of its operations in the region.","translation":"その会社は、その地域での事業活動の一時停止を発表した。","type":"noun","meaning_category":"Interruption"},{"sentence":"The chemist prepared several suspensions for the experiment.","translation":"化学者は実験のためにいくつかの懸濁液を準備した。","type":"noun","meaning_category":"Mixture"},{"sentence":"The car's suspensions provided a smooth ride even on rough roads.","translation":"その車のサスペンションは、荒れた道でもスムーズな乗り心地を提供した。","type":"noun","meaning_category":"Automotive system"}]}