{"word":"Psittaciformes","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"オウム目","english_definition":"An order of birds that comprises about 398 species in 92 genera, found mostly in tropical and subtropical regions; characterized by a strong curved bill, an upright stance, strong legs, and zygodactyl feet.","examples":[{"sentence":"Parrots belong to the order Psittaciformes.","translation":"オウムはオウム目に属する。"}],"collocations":[],"synonyms":["parrot","parrot order"],"antonyms":[]}],"etymology":{"value":"From Latin, combining \"psittacus\" (parrot) and \"-formes\" (having the form of).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsɪtəˈsɪfɔːrmiːz/","syllables":"Psit-ta-ci-for-mes"},"inflection":{"noun_plural":"Psittaciformes"},"usage_notes":{"explanation":"\"Psittaciformes\" is a scientific term used in biology and ornithology to classify a specific order of birds. It is primarily used in academic or technical contexts.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["psittacine (adjective relating to parrots)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The term \"Psittaciformes\" is a scientific classification used by biologists and ornithologists. It is not commonly used in everyday language. Understanding this term requires a background in biology or a specific interest in birds. It's mainly encountered in scientific literature or specialized discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The diversity within the Psittaciformes order is remarkable, with species ranging from tiny parrotlets to large macaws.","translation":"オウム目の多様性は目覚ましく、小さなコニュアから大きなコンゴウインコまで様々な種が存在する。","type":"scientific","meaning_category":"classification"},{"sentence":"Studies of Psittaciformes behavior provide insights into avian intelligence and social structures.","translation":"オウム目の行動の研究は、鳥類の知能と社会構造への洞察を提供する。","type":"scientific","meaning_category":"study"}]}