{"word":"complexionary","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A book or treatise dealing with complexions, especially in the context of physiognomy or medicine.","english_definition":"A book or treatise dealing with complexions, especially in the context of physiognomy or medicine.","examples":[{"sentence":"The old physician consulted his complexionary to diagnose the patient's ailment.","translation":"その老医師は、患者の病気を診断するために、人相学または医学の観点から顔色を扱った専門書を調べた。"}],"collocations":["consult a complexionary","study a complexionary"],"synonyms":["treatise on complexions","book on physiognomy"],"antonyms":[]}],"etymology":{"value":"Derived from 'complexion' (the appearance of the skin, especially the face) and the suffix '-ary' (denoting a collection or relating to).","priority":"★★★"},"pronunciation":{"ipa":"/kəmˈplɛkʃənˌɛri/","syllables":"com-plex-ion-ar-y"},"inflection":{"noun_plural":"complexionaries"},"usage_notes":{"explanation":"The term 'complexionary' is relatively rare and typically found in historical or literary contexts related to the study of physiognomy or early medicine. It refers to a text that analyzes a person's complexion as an indicator of their health, temperament, or character.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He used a complexionary to apply makeup.","correct":"✓ He used a makeup guide to apply makeup.","note":"'Complexionary' refers to a book about analyzing complexions, not applying makeup."}],"priority":"★★☆"},"related_words":{"derivatives":["complexion","complexional"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Complexionary' is a rare and specialized term. It refers to a book or treatise that discusses complexions, especially in the context of physiognomy (the study of facial features and their relation to character) or historical medicine. Understanding this word requires familiarity with these specialized fields."},"example_sentences":[{"sentence":"The scholar discovered an ancient complexionary in the library's archives.","translation":"学者は図書館の書庫で古代の顔色学に関する専門書を発見した。","type":"noun","meaning_category":"book/treatise"},{"sentence":"Early physicians often relied on complexionaries to understand a patient's constitution.","translation":"初期の医師は、患者の体質を理解するために、顔色学に関する専門書に頼ることが多かった。","type":"noun","meaning_category":"book/treatise"}]}