{"word":"non-portability","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"非移植性、移植不可能性","english_definition":"The quality or state of not being portable; the inability to be easily moved or transferred to another environment or system.","examples":[{"sentence":"The non-portability of the software made it difficult to use on different operating systems.","translation":"そのソフトウェアの非移植性により、異なるオペレーティングシステムでの使用が困難になった。"},{"sentence":"Hardware dependencies often lead to non-portability of applications.","translation":"ハードウェアへの依存は、アプリケーションの非移植性につながることが多い。"},{"sentence":"The company addressed the issue of non-portability by rewriting the code in a more platform-independent language.","translation":"その会社は、よりプラットフォームに依存しない言語でコードを書き換えることにより、非移植性の問題に対処した。"}],"collocations":["software non-portability","application non-portability","data non-portability","address non-portability","overcome non-portability"],"synonyms":["immobility","untransferability","inflexibility","incompatibility"],"antonyms":["portability","transferability","flexibility","compatibility"]}],"etymology":{"value":"Derived from 'portable' (capable of being easily carried or moved) with the addition of the prefix 'non-' (meaning 'not').","priority":"☆☆☆"},"pronunciation":{"ipa":"/ˌnɒnˌpɔːrtəˈbɪləti/","syllables":"non-por-ta-bil-i-ty"},"inflection":{"noun_plural":"non-portabilities"},"usage_notes":{"explanation":"'Non-portability' is primarily used in technical contexts, especially in computer science and engineering, to describe software, data, or systems that cannot be easily moved or adapted to different environments (e.g., different operating systems, hardware platforms, or databases). It is the opposite of 'portability,' which is a desirable characteristic in many software and hardware designs.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The program has a lot of non-portable.","correct":"✓ The program has a lot of non-portability.","note":"'Non-portability' is a noun, so it should be used as such in a sentence. Avoid using it as an adjective or other part of speech."},{"incorrect":"✗ The app is non-portable because of the internet.","correct":"✓ The app is non-portable because of its reliance on a specific operating system.","note":"Non-portability typically refers to dependencies on specific systems or hardware, not necessarily internet connectivity."}],"priority":"★☆☆"},"related_words":{"derivatives":["nonportable (adjective)"],"phrasal_verbs":[],"related_terms":["portability","portable","port","migration","compatibility","platform-independent"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C1","text":"'Non-portability' is a technical term that describes the inability of something, usually software or data, to be easily moved or used in different environments. It's the opposite of 'portability.' You'll often find this word in discussions about software development, system architecture, and data management where the ability to adapt to different platforms is important."},"example_sentences":[{"sentence":"The legacy system suffered from severe non-portability, making upgrades extremely challenging.","translation":"そのレガシーシステムは深刻な非移植性に悩まされており、アップグレードが非常に困難になっていた。","type":"noun","meaning_category":"inability to be moved"},{"sentence":"Data non-portability can create significant barriers to cloud migration.","translation":"データの非移植性は、クラウド移行に大きな障壁となる可能性がある。","type":"noun","meaning_category":"inability to be transferred"},{"sentence":"The developers aimed to minimize non-portability by adhering to open standards.","translation":"開発者はオープンスタンダードを遵守することで、非移植性を最小限に抑えることを目指した。","type":"noun","meaning_category":"inability to be adapted"}]}