{"word":"supra-aural","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"耳介の上に載せるタイプの（ヘッドホンなど）","english_definition":"(of headphones, etc.) resting on the outer ear.","examples":[{"sentence":"Supra-aural headphones are lighter and more portable than circumaural models.","translation":"耳乗せ型ヘッドホンは、耳覆い型モデルよりも軽量で携帯性に優れています。"},{"sentence":"Many people find supra-aural headphones more comfortable for extended listening sessions.","translation":"多くの人が、耳乗せ型ヘッドホンの方が長時間のリスニングセッションに適していると感じています。"}],"collocations":["supra-aural headphones","supra-aural design"],"synonyms":["on-ear","ear-cup"],"antonyms":["circumaural","over-ear"]},{"part_of_speech":"adjective","definition":"聴覚の、聴覚を超える","english_definition":"relating to or situated above the ear; surpassing the normal range of hearing.","examples":[{"sentence":"Supra-aural perception involves processing sounds beyond the audible spectrum.","translation":"超聴覚的知覚は、可聴スペクトルを超える音の処理を伴います。"}],"collocations":["supra-aural perception"],"synonyms":["auditory","acoustic"],"antonyms":[]}],"etymology":{"value":"\"supra-\" (above) + \"aural\" (relating to the ear).","priority":"★★☆"},"pronunciation":{"ipa":"ˌsuːprəˈɔːrəl","syllables":"su-pra-au-ral"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"The term \"supra-aural\" primarily describes headphones that rest on the ear rather than fully enclosing it. It can also refer to anything related to the area above the ear or exceeding normal hearing capabilities, though this usage is less common.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I prefer supra-aural because they are more quieter.","correct":"✓ I prefer supra-aural headphones because they are quieter.","note":"'Supra-aural' is an adjective describing the headphones, so the noun 'headphones' should be included. Also, the comparative form of 'quiet' is 'quieter'."}],"priority":"★★☆"},"related_words":{"derivatives":["aural","circumaural","monaural","binaural"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"Unknown","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Supra-aural\" is a technical term, mainly used in the context of audio equipment, specifically headphones. It describes headphones that sit on the ear, rather than fully surrounding it (circumaural) or going inside the ear canal (in-ear). The term is not commonly used in everyday conversation and is more likely to be encountered in product descriptions or audio-related discussions."},"example_sentences":[{"sentence":"These supra-aural headphones provide good sound quality without completely isolating you from your surroundings.","translation":"これらの耳乗せ型ヘッドホンは、周囲の音を完全に遮断することなく、優れた音質を提供します。","type":"adjective","meaning_category":"headphones"},{"sentence":"Some users find supra-aural headphones more comfortable than circumaural ones for long listening sessions.","translation":"一部のユーザーは、長時間のリスニングセッションでは、耳覆い型ヘッドホンよりも耳乗せ型ヘッドホンの方が快適だと感じています。","type":"adjective","meaning_category":"headphones"}]}