{"word":"Insectaria","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"昆虫館、昆虫飼育室","english_definition":"A place where live insects are kept and exhibited; a collection of living insects for study or display.","examples":[{"sentence":"The museum has a large insectarium with many different species of butterflies.","translation":"その博物館には大きな昆虫館があり、様々な種類の蝶がいます。"},{"sentence":"The school's insectarium allows students to study insect behavior up close.","translation":"学校の昆虫飼育室では、生徒たちが間近で昆虫の行動を研究できます。"}],"collocations":["public insectarium","school insectarium","research insectarium"],"synonyms":["vivarium","insect zoo"],"antonyms":[]}],"etymology":{"value":"Derived from 'insect' + '-arium' (a suffix denoting a place for keeping something).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɪnsɛkˈtɛəriəm/","syllables":"in-sec-TAIR-ee-um"},"inflection":{"noun_plural":"Insectariums or Insectaria"},"usage_notes":{"explanation":"An insectarium is a specialized facility, often part of a larger museum, zoo, or educational institution. It focuses specifically on insects and other arthropods. The term can also refer to a smaller, more controlled environment for raising or studying insects.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I visited the insectarium with many spiders.","correct":"✓ I visited the insectarium with many insects.","note":"While insectariums may sometimes house other arthropods, the primary focus is on insects."}],"priority":"★☆☆"},"related_words":{"derivatives":["insect","insectivore","insectivorous"],"phrases":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'insectarium' is relatively uncommon and specific, typically encountered in contexts related to museums, zoos, or scientific research. Understanding its meaning requires familiarity with scientific vocabulary and specialized terminology."},"example_sentences":[{"sentence":"Many people find the insectarium fascinating, despite their fear of bugs.","translation":"虫嫌いな人も多いが、昆虫館は多くの人にとって魅力的だ。","type":"general","meaning_category":"general"},{"sentence":"The insectarium provides a controlled environment for studying insect life cycles.","translation":"昆虫飼育室は、昆虫のライフサイクルを研究するための管理された環境を提供する。","type":"scientific","meaning_category":"scientific"}]}