{"word":"hemiparalysis","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"片麻痺（へんまひ）","english_definition":"paralysis of one side of the body.","examples":[{"sentence":"The stroke caused hemiparalysis on his left side.","translation":"脳卒中により、彼の左半身に片麻痺が生じた。"},{"sentence":"She is undergoing rehabilitation to improve her hemiparalysis.","translation":"彼女は片麻痺を改善するためにリハビリを受けている。"}],"collocations":["cause hemiparalysis (片麻痺を引き起こす)","suffer from hemiparalysis (片麻痺に苦しむ)","hemiparalysis rehabilitation (片麻痺のリハビリ)"],"synonyms":["unilateral paralysis"],"antonyms":["quadriplegia","paraplegia"]}],"etymology":{"value":"The word \"hemiparalysis\" comes from the Greek words \"hemi-\" meaning \"half\" and \"paralysis\" meaning \"paralysis.\"","priority":"★★☆"},"pronunciation":{"ipa":"/ˌhɛmiːpəˈræləsɪs/","syllables":"he-mi-pa-ral-y-sis"},"inflection":{"noun_plural":"hemiparalyses"},"usage_notes":{"explanation":"\"Hemiparalysis\" refers to weakness or the inability to move on one side of the body. It is typically caused by damage to the brain, such as from a stroke, traumatic brain injury, or other neurological conditions. The severity of hemiparalysis can vary widely, from mild weakness to complete paralysis.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He has hemiplegia, which is the same as hemiparalysis, but less severe.","correct":"✓ Hemiparesis is less severe than hemiplegia. Hemiparalysis is another term for hemiplegia.","note":"Hemiparesis refers to weakness on one side of the body, while hemiplegia (or hemiparalysis) refers to complete paralysis on one side of the body."}],"priority":"★★☆"},"related_words":{"derivatives":["hemiplegia","hemiparesis"],"related_medical_terms":["stroke","cerebral palsy","spinal cord injury"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Hemiparalysis\" is a medical term referring to paralysis affecting one side of the body. It's important to note that this term is often used interchangeably with \"hemiplegia,\" although some sources may differentiate between them based on the severity of the paralysis. This term is primarily encountered in medical contexts or discussions related to neurological conditions."},"example_sentences":[{"sentence":"Following the accident, she developed hemiparalysis on the right side of her body.","translation":"事故後、彼女は右半身に片麻痺を発症した。","type":"general","meaning_category":"medical"},{"sentence":"Physical therapy is crucial in managing hemiparalysis and improving motor function.","translation":"理学療法は片麻痺の管理と運動機能の改善に不可欠である。","type":"treatment","meaning_category":"medical"},{"sentence":"The doctor explained that the hemiparalysis was a result of damage to the motor cortex.","translation":"医師は、片麻痺は運動皮質の損傷の結果であると説明した。","type":"cause","meaning_category":"medical"}]}