{"word":"nonpueblo","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"プエブロでない、プエブロ族でない","english_definition":"Not Pueblo; not belonging to a Pueblo people or culture.","examples":[{"sentence":"The nonpueblo tribes often traded with the Pueblo people.","translation":"プエブロ族以外の部族は、しばしばプエブロ族と交易を行った。"},{"sentence":"This land was traditionally used by both Pueblo and nonpueblo communities.","translation":"この土地は伝統的にプエブロ族とプエブロ族以外のコミュニティの両方によって使用されていました。"}],"collocations":[],"synonyms":["non-Puebloan"],"antonyms":["Pueblo","Puebloan"]},{"part_of_speech":"noun","definition":"プエブロ族以外の人","english_definition":"A person who is not a member of a Pueblo people.","examples":[{"sentence":"The archaeological site shows evidence of both Pueblo and nonpueblo occupation.","translation":"その遺跡は、プエブロ族とプエブロ族以外の居住の証拠を示している。"}],"collocations":[],"synonyms":[],"antonyms":["Puebloan"]}],"etymology":{"value":"Formed by combining the prefix \"non-\" (meaning \"not\") with the word \"Pueblo.\"","priority":"★★★"},"pronunciation":{"ipa":"/ˌnɒnˈpwɛbloʊ/","syllables":"non-pueb-lo"},"inflection":{},"usage_notes":{"explanation":"This term is used in anthropological, archaeological, and historical contexts to differentiate between the Pueblo peoples of the Southwestern United States and other Indigenous groups or cultures. It is important to use this term with sensitivity and respect.","priority":"★★☆"},"common_mistakes":{},"related_words":{"derivatives":["Pueblo","Puebloan"],"related_terms":[]},"level_frequency":{},"readability_explanation":{"level":"C1","text":"The word \"nonpueblo\" is a specialized term used primarily in academic or historical contexts related to the Southwestern United States. It refers to individuals or groups that are not part of the Pueblo cultures. Due to its specific usage, it is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The museum exhibit highlighted the interactions between Pueblo and nonpueblo cultures in the region.","translation":"博物館の展示では、この地域のプエブロ文化とプエブロ以外の文化の交流が強調されていた。","type":"adjective","meaning_category":"プエブロでない"},{"sentence":"Archaeological evidence suggests that nonpueblo groups also utilized the irrigation systems.","translation":"考古学的証拠は、プエブロ族以外のグループも灌漑システムを利用していたことを示唆している。","type":"noun","meaning_category":"プエブロ族以外の人"}]}