{"word":"hand-sort","priority":"★★☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"手で選別する、手作業で分類する","english_definition":"To sort or classify items manually, by hand.","examples":[{"sentence":"We need to hand-sort these letters to ensure they reach the correct departments.","translation":"これらの手紙が確実に正しい部署に届くように、手作業で選別する必要があります。"},{"sentence":"The company hand-sorts the recycled materials to remove any contaminants.","translation":"その会社は、汚染物質を取り除くために、リサイクルされた材料を手作業で選別します。"},{"sentence":"The fruit is hand-sorted to remove any damaged or unripe pieces.","translation":"傷んだり熟していないものを取り除くために、果物は手作業で選別されます。"}],"collocations":["hand-sort mail (郵便物を手選別する)","hand-sort produce (農産物を手選別する)","hand-sort recyclables (リサイクル品を手選別する)","hand-sort components (部品を手選別する)"],"synonyms":["manually sort","sort by hand","grade by hand","classify manually"],"antonyms":["machine-sort","automatically sort"],"related_words":["sorting","manual labor","quality control","inspection","classification"],"word_family":["sort","sorted","sorting"]}],"etymology":{"value":"The term is a compound word formed by combining \"hand\" (referring to manual labor) and \"sort\" (to classify or arrange).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhændˌsɔːrt/","syllables":"hand-sort"},"inflection":{"verb_forms":{"present_simple":["hand-sort","hand-sorts"],"past_simple":"hand-sorted","past_participle":"hand-sorted","present_participle":"hand-sorting"}},"usage_notes":{"explanation":"\"Hand-sort\" implies a manual process of separating or classifying items based on certain criteria. It is often used when automated sorting is not feasible or when a higher level of precision is required. The term emphasizes the direct involvement of human labor in the sorting process.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The machine hand-sorts the packages.","correct":"✓ The workers hand-sort the packages.","note":"\"Hand-sort\" implies a manual process, so it should be performed by people, not machines."},{"incorrect":"✗ We need to hand sort the documents.","correct":"✓ We need to hand-sort the documents.","note":"It is generally written as a hyphenated compound word."}],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, used in specific contexts related to manual labor and sorting processes.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"\"Hand-sort\" means to sort things by hand, instead of using a machine. It's often used when you need to be very careful or when the items are delicate. For example, you might hand-sort fruit to make sure only the best pieces are sold. It's a combination of \"hand,\" meaning done by a person, and \"sort,\" meaning to separate into groups."},"example_sentences":[{"sentence":"The volunteers hand-sort the donations before distributing them.","translation":"ボランティアは寄付された品物を配布する前に手作業で選別します。","type":"verb","meaning_category":"手で選別する"},{"sentence":"Due to the delicate nature of the artifacts, they must be hand-sorted by experts.","translation":"工芸品の性質上、専門家による手作業での選別が必要です。","type":"verb","meaning_category":"手作業で分類する"},{"sentence":"The jewelry is hand-sorted to ensure each piece meets the quality standards.","translation":"宝石は、各製品が品質基準を満たしていることを確認するために手作業で選別されます。","type":"verb","meaning_category":"手で選別する"}]}