{"word":"skull-built","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Having a skull-like or skeletal structure; gaunt or emaciated in appearance.","english_definition":"Resembling a skull in construction or appearance; having a gaunt, skeletal look.","examples":[{"sentence":"The old shack was skull-built, with exposed beams and a decaying facade.","translation":"その古い小屋は、むき出しの梁と朽ちかけた外観で、骸骨のような構造だった。"},{"sentence":"After weeks of illness, he looked skull-built and weak.","translation":"数週間の病の後、彼はやつれて骸骨のようになり、弱っていた。"}],"collocations":["skull-built shack","skull-built appearance","skull-built frame","skull-built face"],"synonyms":["skeletal","gaunt","emaciated","cadaverous","bony"],"antonyms":["fleshy","plump","robust","healthy"],"notes":"This word is relatively uncommon and often used to describe something with a grim or macabre quality."}],"etymology":{"value":"Likely a compound word formed from 'skull' (referring to the bony structure of the head) and 'built' (implying a constructed or structural resemblance). The term suggests a structure or appearance that is reminiscent of a skull due to its stark, bony, or skeletal nature.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˈskʌlˌbɪlt/","syllables":"skull-built"},"inflection":{"adjective_forms":{"comparative":null,"superlative":null}},"usage_notes":{"explanation":"'Skull-built' is a descriptive adjective, often used in literature or descriptive writing to evoke a sense of decay, grimness, or a stark, skeletal appearance. It's not a commonly used word in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The building was skull-built with modern materials.","correct":"✓ The building was stark and modern, with sharp angles.","note":"'Skull-built' implies a certain level of decay or skeletal appearance, so it wouldn't typically be used to describe something modern or well-maintained."}],"priority":"★☆☆"},"related_words":{"derivatives":["skull","built"],"related_terms":["skull-like","skeletal","gaunt","emaciated"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - not a common term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Skull-built' is a relatively rare and evocative adjective. It's used to describe something that resembles a skull in structure or appearance, often implying a gaunt, skeletal, or decaying quality. Because of its specific and somewhat macabre connotation, it is more likely to be encountered in literary or descriptive contexts rather than everyday conversation. Understanding the word requires a familiarity with the imagery associated with skulls and skeletal structures."},"example_sentences":[{"sentence":"The abandoned house had a skull-built silhouette against the stormy sky.","translation":"嵐の空を背景に、その廃屋は骸骨のようなシルエットをしていた。","type":"adjective","meaning_category":"appearance"},{"sentence":"His face, once full, now had a skull-built quality after his long illness.","translation":"かつてはふっくらとしていた彼の顔は、長患いの後、骸骨のような様相を呈していた。","type":"adjective","meaning_category":"appearance"}]}