{"word":"pryingness","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"詮索好き、詮索好きな性質、詮索好きなこと","english_definition":"The quality of being unduly curious about the affairs of others; intrusive inquisitiveness.","examples":[{"sentence":"Her pryingness made it difficult to keep any secrets from her.","translation":"彼女の詮索好きのせいで、彼女に秘密にしておくことは難しかった。"},{"sentence":"The reporter's pryingness uncovered a major scandal.","translation":"その記者の詮索好きが、大きなスキャンダルを暴いた。"},{"sentence":"I was annoyed by his constant pryingness into my personal life.","translation":"彼が私の私生活を絶えず詮索することに、私はうんざりした。"}],"collocations":["show pryingness","display pryingness","constant pryingness","unwarranted pryingness","excessive pryingness"],"synonyms":["inquisitiveness","curiosity","nosiness","meddling","interference","intrusiveness"],"antonyms":["disinterest","apathy","unconcern","indifference"]}],"etymology":{"value":"The word 'pryingness' is derived from the adjective 'prying,' which comes from the verb 'pry.' The verb 'pry' originally meant 'to look closely or inquisitively,' and later developed the connotation of being intrusive or nosy. The suffix '-ness' is added to 'prying' to form the noun 'pryingness,' which denotes the quality or state of being prying.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈpraɪɪŋnəs/","syllables":"pry-ing-ness"},"inflection":{"noun_plural":"pryingnesses (rarely used)"},"usage_notes":{"explanation":"'Pryingness' refers to the characteristic of being excessively curious and intrusive into the private matters of others. It often carries a negative connotation, suggesting that the person exhibiting pryingness is overstepping boundaries and being inappropriately inquisitive. The word is typically used to describe a habitual or persistent behavior rather than a one-time occurrence.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He showed a lot of prying.","correct":"✓ He showed a lot of pryingness.","note":"'Prying' can be used as an adjective, but 'pryingness' is the correct noun form to describe the quality of being prying."},{"incorrect":"✗ Her pryingness made me angry, so I told her to pry off.","correct":"✓ Her pryingness made me angry, so I told her to stop prying.","note":"'Pry off' has a different meaning (to force something open or away). To tell someone to stop being nosy, use 'stop prying'."}],"priority":"★★☆"},"related_words":{"derivatives":["pry (verb): to inquire too closely into a person's private affairs.","prying (adjective): excessively interested in someone's private affairs.","pryingly (adverb): in a prying manner."],"related_terms":["nosy","inquisitive","curious","meddlesome","intrusive"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Pryingness' is a relatively uncommon word that describes the quality of being excessively curious and intrusive into other people's private lives. It is generally used in more formal or literary contexts. Understanding the word requires a good vocabulary and the ability to recognize abstract nouns. The concept itself is easy to grasp, but the specific word is not frequently encountered in everyday conversation."},"example_sentences":[{"sentence":"The journalist's relentless pryingness eventually exposed the corruption within the government.","translation":"そのジャーナリストの執拗な詮索好きが、最終的に政府内の汚職を暴露した。","type":"noun","meaning_category":"詮索好きな性質"},{"sentence":"His pryingness was a constant source of irritation for his neighbors.","translation":"彼の詮索好きは、近所の人々にとって常にいらだたしい原因だった。","type":"noun","meaning_category":"詮索好きな性質"},{"sentence":"She excused her pryingness as simply being concerned for her friend's well-being.","translation":"彼女は自分の詮索好きを、単に友人の安否を気遣っているだけだと弁解した。","type":"noun","meaning_category":"詮索好きな性質"}]}