{"word":"self-affair","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"自己の事柄、自分自身に関わる問題","english_definition":"A matter or concern that relates solely to oneself.","examples":[{"sentence":"Whether or not he attends the meeting is a self-affair.","translation":"彼が会議に出席するかどうかは、彼自身の問題だ。"},{"sentence":"Her career choices are a self-affair, and no one else's business.","translation":"彼女のキャリア選択は彼女自身の問題であり、他の誰にも関係ない。"}],"collocations":["personal self-affair","private self-affair"],"synonyms":["personal matter","private business","own concern","individual affair"],"antonyms":["public matter","shared responsibility","collective concern"]}],"etymology":{"value":"Combination of 'self' (referring to oneself) and 'affair' (a matter or concern).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌself əˈfeər/","syllables":"self-af-fair"},"inflection":{"noun_plural":"self-affairs"},"usage_notes":{"explanation":"'Self-affair' is used to emphasize that something is exclusively the concern of a particular individual and not of others. It often implies that others should not interfere or be concerned with the matter. It can sometimes carry a slightly negative connotation, suggesting that the person is being overly individualistic or secretive.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The company's profit is a self-affair.","correct":"✓ The company's profit is a company matter.","note":"'Self-affair' is generally used for personal matters, not for business or organizational issues."},{"incorrect":"✗ He made it a self-affair to learn Japanese.","correct":"✓ He made it his personal goal to learn Japanese.","note":"'Self-affair' is a noun, not an adjective. Use 'personal' or 'own' to describe a goal or task."}],"priority":"★☆☆"},"related_words":{"derivatives":["self (noun, adjective, pronoun)","affair (noun)"],"phrasal_verbs":[],"related_terms":["personal matter","private life","individual responsibility"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Self-affair' is a relatively uncommon term used to describe something that is solely someone's personal business or concern. It implies that the matter is private and not to be interfered with by others. Because it is not a frequently used term, it is more likely to be encountered in formal writing or speech where precision is important. Understanding the context is crucial to correctly interpreting its meaning."},"example_sentences":[{"sentence":"His decision to quit his job is a self-affair, and we should respect it.","translation":"彼が仕事を辞めるという決断は彼自身の問題であり、私たちはそれを尊重すべきだ。","type":"noun","meaning_category":"Personal matter"},{"sentence":"I consider my financial situation a self-affair.","translation":"私は自分の経済状況を個人的な問題だと考えている。","type":"noun","meaning_category":"Private concern"},{"sentence":"Whether she chooses to marry him is entirely her self-affair.","translation":"彼女が彼と結婚するかどうかは完全に彼女自身の問題だ。","type":"noun","meaning_category":"Individual decision"}]}