{"word":"normal-gravity","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"通常の重力下にある、または通常の重力をシミュレートする","english_definition":"relating to or simulating the normal gravitational force of the Earth.","examples":[{"sentence":"The experiment was conducted under normal-gravity conditions.","translation":"その実験は通常の重力条件下で行われた。"},{"sentence":"The normal-gravity simulator allowed the astronauts to train for their mission.","translation":"その通常重力シミュレーターは宇宙飛行士がミッションに向けて訓練することを可能にした。"}],"collocations":["normal-gravity conditions","normal-gravity environment","normal-gravity simulator","normal-gravity experiments"],"synonyms":["1g","Earth-gravity","standard-gravity"],"antonyms":["microgravity","zero-gravity","reduced-gravity"]},{"part_of_speech":"noun","definition":"通常の重力","english_definition":"the normal gravitational force of the Earth, approximately 9.8 m/s².","examples":[{"sentence":"Plant growth is different in normal-gravity compared to microgravity.","translation":"植物の成長は、通常の重力下と微小重力下で異なる。"}],"collocations":["under normal-gravity","in normal-gravity"],"synonyms":["1g","Earth-gravity","standard-gravity"],"antonyms":["microgravity","zero-gravity","reduced-gravity"]}],"etymology":{"value":"'Normal' + 'gravity'. Indicates gravitational conditions similar to those experienced on Earth's surface.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌnɔːrməl ˈɡrævəti/","syllables":"nor-mal-grav-i-ty"},"inflection":{"notes":"Hyphenated compound word. Adjective form does not inflect. Noun form is typically singular and non-count."},"usage_notes":{"explanation":"The term 'normal-gravity' is often used in scientific contexts, particularly when comparing results obtained under Earth's gravity to those obtained in microgravity or other altered gravitational environments. It's used to specify that the conditions are standard and not altered.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The plant grew fast in normal gravity.","correct":"✓ The plant grew fast under normal gravity. / ✓ The plant grew fast in normal-gravity conditions.","note":"When referring to the environment, it's better to use 'under normal gravity' or 'in normal-gravity conditions' for clarity."}],"priority":"★★☆"},"related_words":{"derivatives":["gravity","microgravity","zero-gravity","reduced-gravity"],"related_terms":["g-force","gravitational force","weightlessness"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency, primarily used in scientific literature.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Normal-gravity' is a technical term used in science and engineering to describe conditions where the gravitational force is the same as that experienced on Earth's surface. It's often used when comparing experiments or situations in space (where gravity is different) to those on Earth. The term helps to clarify that the gravitational conditions are standard and haven't been artificially altered.","priority":"★★☆"},"example_sentences":[{"sentence":"The effects of radiation were studied on cells cultured in a normal-gravity environment.","translation":"放射線の影響は、通常の重力環境で培養された細胞について研究された。","type":"adjective","meaning_category":"通常の重力下"},{"sentence":"The experiment aims to understand how fluids behave differently in normal-gravity versus microgravity.","translation":"その実験は、通常の重力下と微小重力下で流体がどのように異なる挙動を示すかを理解することを目的としている。","type":"noun","meaning_category":"通常の重力"}]}