{"word":"immunogenetics","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"免疫遺伝学","english_definition":"The branch of genetics concerned with the genetic basis of the immune response.","examples":[{"sentence":"Immunogenetics plays a crucial role in understanding autoimmune diseases.","translation":"免疫遺伝学は、自己免疫疾患の理解において重要な役割を果たしています。"},{"sentence":"Research in immunogenetics has led to advances in transplantation medicine.","translation":"免疫遺伝学の研究は、移植医療の進歩につながりました。"}],"collocations":["major histocompatibility complex (MHC)","human leukocyte antigen (HLA)","T cell receptor (TCR)","B cell receptor (BCR)","immune response genes","disease susceptibility","genetic polymorphism"],"synonyms":["genetic immunology"],"antonyms":[]}],"etymology":{"value":"'Immuno-' (related to immunity) + 'genetics' (the study of genes and heredity).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɪmjunoʊdʒəˈnɛtɪks/","syllables":"im-mu-no-ge-net-ics"},"inflection":{"noun_plural":"immunogenetics (uncountable)"},"usage_notes":{"explanation":"Immunogenetics is a specialized field that combines immunology and genetics. It focuses on the genes that control the immune system, including those involved in recognizing antigens, producing antibodies, and regulating immune responses. Key areas of study include the major histocompatibility complex (MHC), also known as human leukocyte antigen (HLA) in humans, which plays a critical role in antigen presentation and T cell activation. Immunogenetics is essential for understanding the genetic basis of susceptibility to infectious diseases, autoimmune disorders, and cancer, as well as for improving transplantation outcomes.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Immunogenetic is a study of immune system.","correct":"✓ Immunogenetics is a study of the immune system.","note":"Immunogenetics is a field of study, so it should be used as a noun."}],"priority":"★★☆"},"related_words":{"derivatives":["immunogenetic (adjective)"],"related_terms":["immunology","genetics","MHC","HLA","autoimmunity","transplantation"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency - Specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Immunogenetics is a complex term referring to the study of how genes influence the immune system. It's a combination of 'immunology' (the study of the immune system) and 'genetics' (the study of genes and heredity). This field helps us understand why some people are more susceptible to certain diseases and how the immune system can be manipulated for treatments like organ transplantation or fighting cancer. It involves understanding complex genetic factors that control immune responses.","priority":"★★☆"},"example_sentences":[{"sentence":"Understanding the role of specific genes in the immune response is a central focus of **immunogenetics**.","translation":"免疫応答における特定の遺伝子の役割を理解することは、免疫遺伝学の中心的な焦点です。","type":"definition"},{"sentence":"**Immunogenetics** research has identified several genes associated with increased risk of autoimmune diseases.","translation":"免疫遺伝学の研究により、自己免疫疾患のリスク増加に関連するいくつかの遺伝子が特定されました。","type":"research"},{"sentence":"The field of **immunogenetics** is crucial for improving the success rates of organ transplantation by matching donor and recipient HLA types.","translation":"免疫遺伝学の分野は、ドナーとレシピエントのHLA型を一致させることにより、臓器移植の成功率を向上させるために重要です。","type":"application"}]}