{"word":"kistful","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"A quantity that fills a kist (a chest or box).","english_definition":"As much as a kist will hold.","examples":[{"sentence":"She had a kistful of old letters from her sweetheart.","translation":"彼女は恋人からの古い手紙を箱いっぱいに持っていた。"},{"sentence":"The children gathered a kistful of seashells at the beach.","translation":"子供たちは浜辺で箱いっぱいの貝殻を集めた。"}],"collocations":["a kistful of memories","a kistful of treasures","a kistful of dreams"],"synonyms":["chestful","boxful","containerful"],"antonyms":["handful","few"]}],"etymology":{"value":"Derived from 'kist' (a chest or box, especially one used for storage) and '-ful' (meaning 'full of').","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkɪstfʊl/","syllables":"kist-ful"},"inflection":{"noun_plural":"kistfuls"},"usage_notes":{"explanation":"'Kistful' is a relatively uncommon word, primarily used to describe the amount or quantity that can be contained within a kist. A 'kist' itself is an archaic or regional term for a chest or box, often used for storage. Therefore, 'kistful' implies a substantial, but not necessarily precisely defined, quantity.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He gave me a kistful of advices.","correct":"✓ He gave me a kistful of advice.","note":"'Advice' is an uncountable noun, so it does not take a plural form, even when describing a large quantity."},{"incorrect":"✗ The room was kistful with people.","correct":"✓ The room was filled with people.","note":"'Kistful' describes the quantity of something that can fit in a kist, not the state of being filled. Use 'filled' or 'crowded' to describe a room full of people."}],"priority":"★★☆"},"related_words":{"derivatives":["kist","ful"],"phrases":[]},"level_frequency":{"CEFR":"N/A (Uncommon word)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Kistful' is an uncommon word that means 'as much as a kist (a chest or box) will hold.' It is formed by combining 'kist' (an old-fashioned word for a chest) and '-ful' (meaning 'full of'). Because both 'kist' and 'kistful' are not frequently used, this word is more likely to be encountered in older literature or regional dialects. Understanding the meaning of 'kist' is essential to understanding 'kistful'."},"example_sentences":[{"sentence":"The attic was filled with kists, each containing a kistful of forgotten memories.","translation":"屋根裏部屋は箱でいっぱいだった。それぞれの箱には忘れられた思い出が詰まっていた。","type":"noun","meaning_category":"quantity"},{"sentence":"She opened the old kist and found a kistful of antique jewelry.","translation":"彼女は古い箱を開けて、アンティークの宝石がいっぱい入っているのを見つけた。","type":"noun","meaning_category":"quantity"},{"sentence":"He dreamt of finding a kistful of gold coins.","translation":"彼は金貨がいっぱい入った箱を見つけることを夢見た。","type":"noun","meaning_category":"quantity"}]}