{"word":"subdichotomy","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"二分法の下位区分、さらに細分化された二分法","english_definition":"A secondary or further division into two parts or categories of an existing dichotomy.","examples":[{"sentence":"The author explores the subdichotomies within the broader categories of nature and nurture.","translation":"著者は、生まれつきと育ちというより広いカテゴリーの中にある下位区分を探求している。"},{"sentence":"The study identified several subdichotomies in the responses, providing a more nuanced understanding of the data.","translation":"その研究は、回答の中にいくつかの下位区分を特定し、データに対するより微妙な理解を提供した。"}],"collocations":["explore subdichotomies","identify subdichotomies","analyze subdichotomies","create subdichotomies"],"synonyms":["subdivision","subcategory","subset","branch","refinement"],"antonyms":["dichotomy","classification","categorization"]}],"etymology":{"value":"\"sub-\" (下位) + \"dichotomy\" (二分法) から構成される。","priority":"★★★"},"pronunciation":{"ipa":"/sʌbdaɪˈkɒtəmi/","syllables":"sub-di-cho-to-my"},"inflection":{"noun_plural":"subdichotomies"},"usage_notes":{"explanation":"\"subdichotomy\" は、既存の二分法をさらに細かく二つに分けた区分を指す言葉です。より詳細な分析や分類を行う際に用いられます。学術的な文脈や専門的な議論で使われることが多いです。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The subdichotomy was too broad to be useful.","correct":"✓ The subdichotomy was too narrow to be useful.","note":"Subdichotomies are usually meant to be more specific, not broader, than the original dichotomy."},{"incorrect":"✗ We used a subdichotomy to combine the data.","correct":"✓ We used a subdichotomy to separate the data further.","note":"Subdichotomies are used for further separation or division, not combination."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["dichotomy","taxonomy","classification","categorization","hierarchy"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"非常に低頻度 (Very low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Subdichotomy\" is a term used to describe a further division of an existing dichotomy. A dichotomy is a division into two mutually exclusive categories. A subdichotomy, therefore, represents a more granular or refined categorization within one or both of those original categories. This term is typically encountered in academic or technical contexts where precise classification is important. Understanding the base term \"dichotomy\" is essential before understanding \"subdichotomy.\""},"example_sentences":[{"sentence":"The research paper delved into the subdichotomies of introversion and extroversion, revealing nuanced personality traits.","translation":"その研究論文は、内向性と外向性の下位区分を掘り下げ、微妙な性格特性を明らかにした。","type":"general","meaning_category":"二分法の下位区分"},{"sentence":"The classification system used a subdichotomy to further categorize the types of errors found in the data.","translation":"その分類システムは、データに見られるエラーの種類をさらに分類するために、下位区分を使用した。","type":"technical","meaning_category":"二分法の下位区分"}]}