{"word":"exponentials","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(数学) 指数関数、指数関数的なもの","english_definition":"(mathematics) quantities that involve exponents; functions in which an independent variable appears in one or more exponents.","examples":[{"sentence":"The graph shows the behavior of exponentials.","translation":"そのグラフは指数関数の挙動を示している。"},{"sentence":"Exponentials are used to model population growth.","translation":"指数関数は人口増加をモデル化するために使われる。"}],"collocations":["exponential growth (指数関数的成長)","exponential decay (指数関数的減衰)","exponential function (指数関数)"],"synonyms":["exponential functions"],"antonyms":[]}],"etymology":{"value":"The word 'exponential' comes from 'exponent', which is derived from the Latin word 'exponere' meaning 'to set forth, explain'. The term 'exponential' started being used in mathematics to describe functions where the variable appears as an exponent.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌɛkspoʊˈnɛnʃəlz/","syllables":"ex-po-nen-tials"},"inflection":{"noun_plural":"exponentials"},"usage_notes":{"explanation":"'Exponentials' refers to quantities or functions that involve exponents. In mathematics, an exponential function is a function of the form f(x) = a^x, where 'a' is a constant (the base) and 'x' is the independent variable. These functions are characterized by rapid growth or decay, depending on the value of 'a'. The term is often used in contexts involving mathematics, science, and finance to describe processes that increase or decrease at an accelerating rate.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The exponentials is increasing rapidly.","correct":"✓ The exponential function is increasing rapidly.","note":"'Exponentials' is a plural noun. When referring to a single function, use 'exponential function' or 'the exponential'."},{"incorrect":"✗ Exponential is used in finance.","correct":"✓ Exponentials are used in finance.","note":"When referring to the general concept or multiple instances, use the plural form 'exponentials'."}],"priority":"★★☆"},"related_words":{"derivatives":["exponential (adjective)","exponent (noun)","exponentially (adverb)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency, used primarily in technical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'exponentials' is a mathematical term referring to functions where the variable is in the exponent. These functions are known for their rapid growth or decay. Understanding this term requires a background in algebra and calculus. It's commonly used in scientific and financial contexts to describe rapid changes."},"example_sentences":[{"sentence":"The study of exponentials is crucial in understanding compound interest.","translation":"指数関数の研究は、複利を理解する上で重要である。","type":"noun","meaning_category":"mathematics"},{"sentence":"The model uses exponentials to predict the spread of the virus.","translation":"そのモデルは、ウイルスの拡散を予測するために指数関数を使用する。","type":"noun","meaning_category":"mathematics"}]}