{"word":"Revenant","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(物語・伝説などにおける) 生き返った人、亡霊、帰ってきた人","english_definition":"A person who has returned, especially supposedly from the dead.","examples":[{"sentence":"The revenant haunted the village, seeking revenge for his murder.","translation":"その亡霊は村をさまよい、殺されたことへの復讐を求めていた。"},{"sentence":"In some folklore, revenants are believed to be animated corpses.","translation":"一部の民間伝承では、亡霊は生ける屍であると考えられている。"},{"sentence":"The hero's return was like that of a revenant, long absent and presumed dead.","translation":"その英雄の帰還は、長い間不在で死んだと思われていた亡霊のようだった。"}],"collocations":["ghostly revenant","vengeful revenant","legend of the revenant"],"synonyms":["ghost","specter","phantom","apparition","zombie","animated corpse"],"antonyms":["living person"]},{"part_of_speech":"noun","definition":"(比喩的に) 長い間忘れられていたものが再び現れたもの","english_definition":"Someone or something that has returned after a long absence.","examples":[{"sentence":"The old fashion trend is a revenant, making a comeback after decades.","translation":"その古いファッションのトレンドは亡霊のように蘇り、数十年ぶりに復活を遂げている。"},{"sentence":"The political ideology was a revenant, resurrected by a new generation.","translation":"その政治思想は亡霊のように蘇り、新しい世代によって復活した。"}],"collocations":["political revenant","cultural revenant"],"synonyms":["resurgence","revival","comeback"]}],"etymology":{"value":"From French *revenant*, the present participle of *revenir* 'to return', from Latin *revenire*, from *re-* 'again' + *venire* 'to come'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈrɛvənənt/","syllables":"rev-e-nant"},"inflection":{"noun_plural":"Revenants"},"usage_notes":{"explanation":"The word \"Revenant\" typically refers to a person who has returned from the dead, often in folklore or supernatural contexts. It can also be used metaphorically to describe something that has returned after a long absence or period of dormancy. The term often carries a connotation of something eerie, unsettling, or vengeful.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a revenant from the store.","correct":"✓ He was a returning customer.","note":"\"Revenant\" specifically implies a return from death or a very long absence, not just a regular return to a store."},{"incorrect":"✗ The revenant was happy and cheerful.","correct":"✓ The revenant was vengeful and tormented.","note":"Revenants are typically portrayed as troubled or vengeful spirits, not happy ones."}],"priority":"★★☆"},"related_words":{"derivatives":["Revenance (noun) - The act of returning or reappearing."],"related_terms":["Resurrection","Undead","Spectre","Haunt"],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'revenant' is relatively uncommon and typically used in literary or historical contexts, especially when discussing folklore, ghost stories, or the supernatural. It implies a return from death or a long absence, often with a negative or unsettling connotation. Understanding this word requires familiarity with themes of death, resurrection, and the supernatural. It is not typically encountered in everyday conversation."},"example_sentences":[{"sentence":"The **revenant** emerged from the graveyard, its eyes glowing with an eerie light.","translation":"その亡霊は墓場から現れ、その目は不気味な光を放っていた。","type":"noun","meaning_category":"supernatural being"},{"sentence":"After years of obscurity, the band's music experienced a **revenant**, gaining popularity among a new generation.","translation":"長年の無名時代を経て、そのバンドの音楽は亡霊のように蘇り、新しい世代の間で人気を博した。","type":"noun","meaning_category":"metaphorical return"}]}