{"word":"treasonably","priority":"☆☆☆","meanings":[{"part_of_speech":"adverb","definition":"反逆的に、裏切り行為として","english_definition":"In a manner that constitutes treason; traitorously.","examples":[{"sentence":"He acted treasonably by aiding the enemy.","translation":"彼は敵を支援することで反逆的な行為をした。"},{"sentence":"The documents were treasonably leaked to the press.","translation":"その文書は反逆的な方法で報道機関にリークされた。"}],"collocations":["act treasonably","behave treasonably","treasonably leak"],"synonyms":["traitorously","disloyally","sediciously","subversively"],"antonyms":["loyally","patriotically","faithfully"]}],"etymology":{"value":"Derived from 'treasonable' (adjective meaning 'constituting or involving treason') + '-ly' (suffix forming adverbs). 'Treasonable' comes from 'treason' + '-able'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈtriːzənəbli/","syllables":"trea-son-a-bly"},"inflection":{"notes":"Adverb, no inflection."},"usage_notes":{"explanation":"'Treasonably' describes actions or behaviors that resemble or involve treason, but may not necessarily meet the strict legal definition of treason. It often implies a betrayal of trust or loyalty to one's country or organization. It is used to describe the manner in which something is done, emphasizing its disloyal or subversive nature.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was treasonably.","correct":"✓ He acted treasonably.","note":"'Treasonably' is an adverb and modifies a verb, not a noun or pronoun. It describes how someone acted, not who they are."},{"incorrect":"✗ The treasonably act.","correct":"✓ The treasonable act.","note":"'Treasonably' is an adverb; the adjective form 'treasonable' should be used to modify a noun."}],"priority":"★☆☆"},"related_words":{"derivatives":["treason (noun): the crime of betraying one's country","treasonable (adjective): constituting or involving treason","traitor (noun): a person who betrays their country or a cause","traitorous (adjective): relating to or characteristic of a traitor"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'treasonably' is an adverb that describes actions done in a way that resembles treason, or betrayal of one's country or organization. It is a formal word and not commonly used in everyday conversation. It is often used in legal or political contexts to describe actions that are considered disloyal or subversive. It is important to remember that 'treasonably' is an adverb, so it modifies a verb, describing how the action was performed.","example_sentences":[]}}