{"word":"Vespetro","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"A dry martini cocktail made with gin, vodka, and Lillet Blanc.","english_definition":"A dry martini cocktail made with gin, vodka, and Lillet Blanc, popularized by James Bond in the novel Casino Royale.","examples":[{"sentence":"He ordered a Vespetro at the bar.","translation":"彼はバーでヴェスぺトロを注文した。"},{"sentence":"The bartender mixed a Vespetro according to the original recipe.","translation":"バーテンダーはオリジナルのレシピに従ってヴェスぺトロを混ぜた。"}],"collocations":["order a Vespetro","mix a Vespetro","drink a Vespetro"],"synonyms":["martini","cocktail"],"antonyms":[]}],"etymology":{"value":"The name 'Vespetro' is derived from 'Vesper', the name of the double agent Vesper Lynd in Ian Fleming's novel Casino Royale.","priority":"★★★"},"pronunciation":{"ipa":"/ˈvɛspəˌtroʊ/","syllables":"Ves-pe-tro"},"inflection":{"noun_plural":"Vespetros"},"usage_notes":{"explanation":"'Vespetro' is primarily known as James Bond's signature martini in the novel Casino Royale. The exact recipe is specified in the book, making it a distinct variation of a dry martini.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I'll have a vesper.","correct":"✓ I'll have a Vespetro.","note":"'Vesper' is the name of the character, while 'Vespetro' is the name of the drink."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Vespetro' is a specialized term primarily associated with the James Bond novel Casino Royale. Its usage is generally limited to discussions of cocktails, James Bond lore, or literary references. Familiarity with the term implies a relatively high level of cultural literacy or specific interest in these areas."},"example_sentences":[{"sentence":"James Bond famously orders a Vespetro in Casino Royale.","translation":"ジェームズ・ボンドはカジノ・ロワイヤルでヴェスぺトロを注文することで有名だ。","type":"noun","meaning_category":"cocktail"}]}