{"word":"Saadi","priority":"★★☆","meanings":[{"part_of_speech":"proper noun","definition":"(人名) サーディー、13世紀ペルシアの詩人","english_definition":"(Proper noun) Saadi of Shiraz, a major Persian poet and prose writer of the medieval period.","examples":[{"sentence":"Saadi's poetry is known for its moral and social themes.","translation":"サーディーの詩は、その道徳的、社会的なテーマで知られています。"},{"sentence":"The Gulistan and Bustan are Saadi's most famous works.","translation":"『薔薇園』と『果樹園』はサーディーの最も有名な作品です。"}],"collocations":["Saadi of Shiraz","Saadi's Gulistan","Saadi's Bustan"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"サーディーは、彼のペンネームであり、シラーズの支配者であるサアド・イブン・ザンギーに敬意を表して名付けられました。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsɑːdi/","syllables":"Saa-di"},"inflection":{},"usage_notes":{"explanation":"Saadi of Shiraz (1210-1291/92 or 1213-1292), also known as Saadi Shirazi, was a Persian poet and prose writer of the medieval period. He is recognized for the quality of his writings and for the depth of his social and moral thoughts. Saadi is widely considered one of the greatest poets of the classical literary tradition. His best-known works are the Bustan (The Orchard) completed in 1257 and the Gulistan (The Rose Garden) in 1258.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["Saadian (形容詞: サーディーの、サーディー風の)"],"idioms_phrases":[],"priority":"★★☆"},"level_frequency":{},"readability_explanation":{"level":"C1","text":"Saadi is a proper noun referring to a famous Persian poet. Understanding this word requires knowledge of Persian literature and history. His works are often studied in comparative literature courses.","priority":"★★☆"},"example_sentences":[{"sentence":"Scholars often compare Saadi to other great moralists like Aesop.","translation":"学者たちはしばしばサーディーをイソップのような他の偉大な道徳家と比較します。","type":"example","meaning_category":"General"},{"sentence":"Saadi's influence on Persian literature is undeniable.","translation":"サーディーのペルシア文学への影響は否定できません。","type":"example","meaning_category":"Influence"}]}