{"word":"Grenoble","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"グルノーブル（フランス南東部の都市）","english_definition":"A city in southeastern France, located in the Auvergne-Rhône-Alpes region.","examples":[{"sentence":"Grenoble is known for its universities and research centers.","translation":"グルノーブルは大学や研究センターで知られています。"},{"sentence":"We visited Grenoble during our trip to the French Alps.","translation":"フランスアルプスへの旅行中にグルノーブルを訪れました。"}],"collocations":["visit Grenoble","in Grenoble","near Grenoble"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name 'Grenoble' comes from 'Gratianopolis', named after the Roman Emperor Gratian in the 4th century.","priority":"★★★"},"pronunciation":{"ipa":"/ɡʁə.nɔbl/","syllables":"Gre-noble"},"inflection":{},"usage_notes":{"explanation":"Grenoble is a city in the Auvergne-Rhône-Alpes region of southeastern France. It's known as a scientific hub, especially in the fields of physics, nuclear physics, and micro- and nanotechnology. It is also a gateway to the French Alps, making it popular for winter sports and hiking.","priority":"★★★"},"common_mistakes":{},"related_words":{"derivatives":["Grenoblois (inhabitant of Grenoble)"],"related_places":["French Alps","Lyon","Chambery"],"priority":"★★☆"},"level_frequency":{},"readability_explanation":{"level":"B1","text":"Grenoble is a city in France. It is known for being a center for science and technology, and it is close to the Alps mountains. If you are interested in science or mountains, you might want to learn more about Grenoble."},"example_sentences":[{"sentence":"Grenoble is a major center for scientific research in France.","translation":"グルノーブルはフランスにおける科学研究の主要な中心地です。","type":"general","meaning_category":"City Description"},{"sentence":"Many tourists visit Grenoble to access the ski resorts in the Alps.","translation":"多くの観光客がアルプスのスキーリゾートに行くためにグルノーブルを訪れます。","type":"tourism","meaning_category":"Tourism"},{"sentence":"The University of Grenoble Alpes is one of the largest universities in France.","translation":"グルノーブルアルプ大学はフランス最大の大学の一つです。","type":"education","meaning_category":"Education"}]}