{"word":"kueh","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(東南アジアの)クエ、クエh (米、ココナッツミルク、砂糖などをベースにした様々な種類のケーキやスナック)","english_definition":"(Southeast Asia) a bite-sized snack or dessert food commonly found in Southeast Asia. It is a fairly broad term which may include items that would be called cakes, cookies, dumplings, pudding, biscuits, or pastries in English. It is typically made from rice flour, glutinous rice flour, tapioca and/or coconut milk and sugar.","examples":[{"sentence":"She brought a selection of kueh for the party.","translation":"彼女はパーティーのために様々な種類のクエを持ってきた。"},{"sentence":"Kueh are often brightly colored and intricately decorated.","translation":"クエはしばしば鮮やかな色で、複雑に装飾されている。"},{"sentence":"There are many different types of kueh, each with its own unique flavor and texture.","translation":"クエには多くの異なる種類があり、それぞれ独自の風味と食感がある。"}],"collocations":["kueh lapis (クエ・ラピス: 何層にも重ねられたケーキ)","kueh dadar (クエ・ダダール: ココナッツ風味のクレープ)","kueh bahulu (クエ・バフル: マドレーヌのような焼き菓子)","kueh salat (クエ・サラット: ココナッツミルクとパンダンのケーキ)"],"synonyms":["kuih (マレーシア、ブルネイ、シンガポールでの綴り)","kue (インドネシアでの綴り)"],"antonyms":[]},{"part_of_speech":"noun","definition":"(地域によっては)クエを作るためのレシピ、またはクエの作り方","english_definition":"(regional) a recipe for making kueh, or the method of preparing kueh.","examples":[{"sentence":"My grandmother's kueh recipe has been passed down for generations.","translation":"祖母のクエのレシピは、何世代にもわたって受け継がれてきた。"},{"sentence":"She learned the traditional kueh from her mother.","translation":"彼女は母親から伝統的なクエの作り方を学んだ。"}],"collocations":[],"synonyms":["kuih recipe","kue recipe"],"antonyms":[]}],"etymology":{"value":"「kueh」は、福建語（中国語の方言）の「粿 (kué)」に由来し、米粉で作られたケーキやスナックを意味する。東南アジアに中国系移民が広まるにつれて、この言葉も各地に伝わり、それぞれの地域で独自のクエ文化が発展した。","priority":"★★☆"},"pronunciation":{"ipa":"/ˈkweɪ/","syllables":"kueh (1 syllable, rhymes with 'way')"},"inflection":{"noun_plural":"kueh (通常、複数形は使わない。複数の種類を指す場合は 'types of kueh' など)","notes":"単数・複数同形"},"usage_notes":{"explanation":"「**kueh**」は、東南アジア（特にインドネシア、マレーシア、シンガポール）で一般的な、一口サイズのケーキやスナックを指す総称です。米粉、ココナッツミルク、砂糖などを主な材料とし、蒸したり、焼いたり、揚げたりして作られます。様々な種類があり、甘いものから塩辛いものまで、色や形も多種多様です。マレーシア、ブルネイ、シンガポールでは「kuih」と綴られることが一般的です。英語圏では、東南アジア料理に詳しい人以外には馴染みのない単語ですが、現地の食文化を紹介する文脈で使われることがあります。","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I ate a kuehs at the market.","correct":"✓ I ate some kueh at the market. / ✓ I ate a few types of kueh at the market.","note":"「kueh」は、集合名詞のように扱われることが多く、複数形を直接使うことは少ないです。複数の種類を指す場合は、「some kueh」や「types of kueh」のように表現します。"},{"incorrect":"✗ Kueh is a type of bread.","correct":"✓ Kueh is a type of cake/snack.","note":"クエはパンではなく、ケーキやスナックの一種です。米粉やココナッツミルクをベースに作られることが多いです。"},{"incorrect":"✗ I don't like kueh because it's too spicy.","correct":"✓ I don't like kueh because it's too sweet. / ✓ I don't like some kueh because they are too sweet.","note":"クエは一般的に甘いものが多く、辛いものはありません。辛いクエがある場合は、非常に特殊な種類である可能性が高いです。"}],"priority":"★★☆"},"related_words":{"derivatives":[],"idioms_phrases":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"(一般的にCEFRレベルには該当しない - 東南アジアの食文化に特有の単語)","frequency_google_ngram":"低頻度 (Low frequency) - 東南アジア料理に関する文脈以外ではあまり使われない。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**kueh**」は、東南アジアの料理に特有な単語で、英語圏では一般的に知られていません。この単語は、米粉、ココナッツミルク、砂糖などを材料とする、一口サイズのケーキやスナックの総称として使われます。インドネシア、マレーシア、シンガポールなどの国々で様々な種類のクエがあり、それぞれ異なる風味や食感を持っています。この単語を理解するには、東南アジアの食文化に関する知識が必要となります。"},"example_sentences":[{"sentence":"The market was filled with vendors selling colorful **kueh**.","translation":"市場は、色とりどりのクエを売る露店でいっぱいだった。","type":"noun","meaning_category":"お菓子"},{"sentence":"She learned how to make traditional **kueh** from her grandmother.","translation":"彼女は祖母から伝統的なクエの作り方を学んだ。","type":"noun","meaning_category":"お菓子"},{"sentence":"**Kueh** lapis is a popular layered cake in Southeast Asia.","translation":"クエ・ラピスは、東南アジアで人気のある層状のケーキだ。","type":"noun","meaning_category":"お菓子"},{"sentence":"Many types of **kueh** are steamed to achieve a soft and chewy texture.","translation":"多くの種類のクエは、柔らかくてもちもちとした食感にするために蒸される。","type":"noun","meaning_category":"お菓子"},{"sentence":"Coconut milk is a key ingredient in many **kueh** recipes.","translation":"ココナッツミルクは、多くのクエのレシピの重要な材料だ。","type":"noun","meaning_category":"お菓子"}]}