{"word":"radiographic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"放射線写真の、レントゲン写真の","english_definition":"relating to radiography; using X-rays or other forms of radiation for imaging.","examples":[{"sentence":"The radiographic examination revealed a fracture.","translation":"放射線写真検査で骨折が明らかになった。"},{"sentence":"Radiographic techniques are used to detect internal defects in materials.","translation":"放射線写真技術は、材料の内部欠陥を検出するために使用される。"},{"sentence":"The doctor ordered a radiographic study of the chest.","translation":"医師は胸部のレントゲン検査を指示した。"}],"collocations":["radiographic examination","radiographic image","radiographic findings","radiographic technique","radiographic study"],"synonyms":["X-ray","roentgenographic"],"antonyms":[]}],"etymology":{"value":"'Radiographic' is derived from 'radiography,' which combines 'radio-' (referring to radiation) and '-graphy' (referring to a process of recording or imaging).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌreɪdiəˈɡræfɪk/","syllables":"ra-di-o-graph-ic"},"inflection":{"notes":"This is an adjective and does not have plural forms or verb conjugations."},"usage_notes":{"explanation":"'Radiographic' is an adjective used to describe something related to the process or results of radiography. Radiography is a technique that uses X-rays, gamma rays, or other forms of ionizing radiation to view the internal structure of an object, such as the human body or industrial components. The term is often used in medical and industrial contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"The radiographic was clear.","correct":"The radiographic image was clear.","note":"'Radiographic' is an adjective and needs to be followed by a noun. 'Radiograph' is the noun that refers to the image itself."}],"priority":"★★☆"},"related_words":{"derivatives":["radiography (noun): the process of using radiation to produce images.","radiograph (noun): an image produced by radiography, such as an X-ray.","radiologist (noun): a doctor who specializes in interpreting radiographic images."],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'radiographic' is a technical term primarily used in medical and industrial contexts. It refers to anything related to radiography, which is the process of creating images using X-rays or other forms of radiation. Understanding this word requires familiarity with medical or industrial imaging procedures."},"example_sentences":[{"sentence":"The patient underwent a radiographic evaluation to assess the extent of the injury.","translation":"患者は怪我の程度を評価するために放射線写真評価を受けた。","type":"general","meaning_category":"medical"},{"sentence":"Radiographic testing is commonly used in the aerospace industry to ensure the integrity of aircraft components.","translation":"放射線写真検査は、航空宇宙産業で航空機部品の完全性を確保するために一般的に使用されている。","type":"general","meaning_category":"industrial"}]}