{"word":"Gurdwara","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"グルドワラ (シク教の礼拝所)","english_definition":"A place of worship for Sikhs; any place where the Guru Granth Sahib (the Sikh holy scripture) is installed.","examples":[{"sentence":"We visited the local Gurdwara to offer prayers.","translation":"私たちは祈りを捧げるために地元のグルドワラを訪れました。"},{"sentence":"The Gurdwara provides free meals to all visitors.","translation":"そのグルドワラはすべての訪問者に無料の食事を提供しています。"},{"sentence":"The Guru Granth Sahib is the central focus of the Gurdwara.","translation":"グル・グラント・サーヒブはグルドワラの中心的な焦点です。"}],"collocations":["visit a Gurdwara","attend Gurdwara","Gurdwara Sahib","main Gurdwara","historic Gurdwara"],"synonyms":["Sikh temple","Sikh place of worship"],"antonyms":[]}],"etymology":{"value":"From Punjabi ਗੁਰਦੁਆਰਾ (gurdu'ārā), from ਗੁਰੂ (gurū, \"guru, teacher\") + ਦੁਆਰਾ (du'ārā, \"door, gateway\"), literally \"the gateway to the guru\".","priority":"★★★"},"pronunciation":{"ipa":"/ɡʊərˈdwɑːrə/","syllables":"Gur-dwa-ra"},"inflection":{"noun_plural":"Gurdwaras"},"usage_notes":{"explanation":"A Gurdwara is more than just a place of worship; it is a community center, a place for learning, and a place for serving others. All Gurdwaras have a langar (community kitchen) where free meals are served to everyone, regardless of their religion, caste, or background. Visitors are expected to cover their heads as a sign of respect when entering a Gurdwara. Shoes are also removed.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I went to the church. (when referring to a Gurdwara)","correct":"✓ I went to the Gurdwara.","note":"Use the correct term 'Gurdwara' when referring to a Sikh place of worship, not 'church' which is a Christian place of worship."},{"incorrect":"✗ You don't need to cover your head in a Gurdwara.","correct":"✓ You need to cover your head in a Gurdwara.","note":"Covering the head is a sign of respect and is mandatory in a Gurdwara."}],"priority":"★★☆"},"related_words":{"derivatives":["Guru Granth Sahib","langar","Sikh","Sikhism","Khalsa"],"phrases":["Waheguru Ji Ka Khalsa, Waheguru Ji Ki Fateh (A Sikh greeting)"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2 (for those studying religion or culture)","frequency_google_ngram":"Relatively low frequency, specific to Sikhism and related contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Gurdwara' is a specific term for a Sikh place of worship. Understanding its significance requires some familiarity with Sikhism. The term is not commonly used outside of contexts related to Sikh religion and culture. The word's etymology and cultural importance contribute to its complexity for non-native speakers.","priority":"★★☆"},"example_sentences":[{"sentence":"The local Sikh community built a new Gurdwara in the neighborhood.","translation":"地元のシク教徒コミュニティは近所に新しいグルドワラを建設しました。","type":"noun","meaning_category":"Sikh place of worship"},{"sentence":"Every Sunday, we volunteer at the Gurdwara's langar.","translation":"毎週日曜日、私たちはグルドワラのランガルでボランティアをします。","type":"noun","meaning_category":"Sikh place of worship"},{"sentence":"The Gurdwara is open to people of all faiths.","translation":"そのグルドワラはすべての信仰の人々に開かれています。","type":"noun","meaning_category":"Sikh place of worship"}]}