{"word":"frogging","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(装飾) 飾り紐、飾りボタン","english_definition":"An ornamental braiding or fastening on a garment, consisting of button-like ornaments and loops through which they pass.","examples":[{"sentence":"The hussar's jacket was adorned with elaborate frogging.","translation":"ユサールのジャケットは、手の込んだフロッギングで飾られていた。"},{"sentence":"The military-style coat featured frogging closures.","translation":"そのミリタリースタイルのコートは、フロッギング留め具が特徴だった。"}],"collocations":["military frogging","ornamental frogging","frogging closure"],"synonyms":["braiding","ornamentation","trimming"],"antonyms":[]},{"part_of_speech":"verb","definition":"(カエルを捕まえること)","english_definition":"The act of hunting or catching frogs.","examples":[{"sentence":"The children went frogging by the pond.","translation":"子供たちは池でカエルを捕まえに行った。"},{"sentence":"Frogging is a popular activity in some rural areas.","translation":"カエル捕りは、一部の農村地域で人気のある活動である。"}],"collocations":["go frogging","night frogging"],"synonyms":["frog hunting","frog catching"],"antonyms":[]}],"etymology":{"value":"The noun 'frogging' referring to ornamentation likely derives from the resemblance of the braided loops to frogs' legs. The verb 'frogging' is simply derived from the word 'frog'.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈfrɒɡɪŋ/","syllables":"frog-ging"},"inflection":{"noun_plural":"froggings","verb_present_participle":"frogging"},"usage_notes":{"explanation":"'Frogging' has two distinct meanings. As a noun, it refers to a type of decorative braiding or fastening, often seen on military-style clothing. As a verb, it refers to the activity of hunting or catching frogs, typically for food or sport. The context usually makes it clear which meaning is intended.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She wore a dress with many froggings. (Intended meaning: frogs)","correct":"✓ She wore a dress with many frog designs.","note":"If you mean 'frogs' as in the animal, use 'frog designs' or a similar phrase. 'Frogging' as a noun always refers to the ornamentation."}],"priority":"★☆☆"},"related_words":{"derivatives":["frog (noun)","frogman (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"Not typically included in CEFR vocabulary lists.","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'frogging' is relatively uncommon. As a noun, it refers to a specific type of decorative braiding or fastening, often found on military-style clothing. As a verb, it refers to the act of hunting or catching frogs. The context will usually make the meaning clear. It's important to distinguish between the two meanings and to remember that the noun form always refers to the ornamentation, not the animal."},"example_sentences":[{"sentence":"The general's uniform was covered in elaborate gold frogging.","translation":"将軍の制服は、手の込んだ金のフロッギングで覆われていた。","type":"noun","meaning_category":"ornamentation"},{"sentence":"We spent the evening frogging in the marsh.","translation":"私たちは夕方を湿地帯でカエル捕りをして過ごした。","type":"verb","meaning_category":"frog catching"}]}