{"word":"lagopodous","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"ウサギ足の、ウサギのような足を持つ","english_definition":"Having feet resembling those of a hare or rabbit; hare-footed.","examples":[{"sentence":"The lagopodous gait of the snowshoe hare allows it to traverse deep snow.","translation":"カンジキウサギのウサギのような足取りは、深い雪の中を移動することを可能にする。"},{"sentence":"Some birds in cold climates have lagopodous feet, providing insulation and traction.","translation":"寒冷地に生息する一部の鳥類は、断熱性と牽引力を提供するウサギ足のような足を持つ。"}],"collocations":["lagopodous gait","lagopodous feet"],"synonyms":["hare-footed"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'lagos' (λαγός) meaning 'hare' or 'rabbit' and 'pous' (πούς) meaning 'foot'.","priority":"★★★"},"pronunciation":{"ipa":"/ləˈɡɒpədəs/","syllables":"la-go-po-dous"},"inflection":{"notes":"Does not inflect; it's an adjective."},"usage_notes":{"explanation":"The term 'lagopodous' is primarily used in zoology and related fields to describe animals, particularly birds and mammals, that possess feet similar in structure or function to those of hares or rabbits. These adaptations often involve having broad, furred feet that aid in locomotion across snow or soft ground.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The lagopodous animal swam across the river.","correct":"✓ The lagopodous animal moved across the snow.","note":"Lagopodous feet are adapted for movement on snow or soft ground, not for swimming."}],"priority":"☆☆☆"},"related_words":{"derivatives":["Lagopus (genus of ptarmigans and related birds with feathered feet)"],"phrases":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"☆☆☆"},"readability_explanation":{"level":"C2","text":"'Lagopodous' is a highly specialized term primarily used in zoology to describe animals with feet resembling those of hares or rabbits, adapted for movement on snow or soft ground. Due to its limited usage, it is not commonly encountered outside of scientific contexts."},"example_sentences":[{"sentence":"The ptarmigan is a lagopodous bird, well-adapted to arctic environments.","translation":"ライチョウはウサギ足の鳥であり、北極圏の環境によく適応している。","type":"adjective","meaning_category":"ウサギ足の"}]}