{"word":"myringodermatitis","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"水疱性鼓膜炎","english_definition":"An inflammatory condition of the eardrum (tympanic membrane) characterized by the formation of vesicles (small fluid-filled blisters).","examples":[{"sentence":"The patient was diagnosed with myringodermatitis after complaining of severe ear pain.","translation":"患者は激しい耳の痛みを訴えた後、水疱性鼓膜炎と診断された。"}],"collocations":["myringodermatitis treatment (水疱性鼓膜炎の治療)","bullous myringodermatitis (水疱性鼓膜炎)"],"synonyms":["bullous myringitis"],"antonyms":[]}],"etymology":{"value":"The term 'myringodermatitis' is derived from the following Greek roots: 'myringo-' (referring to the tympanic membrane or eardrum), 'dermato-' (referring to the skin), and '-itis' (denoting inflammation).","priority":"★★☆"},"pronunciation":{"ipa":"/məˌrɪŋɡoʊˌdɜːrməˈtaɪtɪs/","syllables":"my-rin-go-der-ma-ti-tis"},"inflection":{"noun_plural":"myringodermatitides (rare)"},"usage_notes":{"explanation":"Myringodermatitis is often associated with bacterial or viral infections. Symptoms include severe ear pain, hearing loss, and sometimes bloody discharge from the ear. The condition is usually treated with antibiotics or antiviral medications, along with pain relievers. It is important to differentiate myringodermatitis from other ear infections, such as otitis media, as the treatment approaches may differ.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Myringodermatitis is the same as otitis media.","correct":"✓ Myringodermatitis is different from otitis media.","note":"Myringodermatitis affects the eardrum, while otitis media affects the middle ear."}],"priority":"★★☆"},"related_words":{"derivatives":["myringitis (鼓膜炎)","dermatitis (皮膚炎)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A (medical term)","frequency_google_ngram":"Very low frequency (medical term)","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Myringodermatitis' is a specialized medical term referring to an inflammation of the eardrum characterized by blisters. Due to its technical nature, it is primarily used within medical contexts. Understanding this term requires familiarity with medical terminology related to the ear and inflammatory conditions. It's crucial to differentiate it from other ear infections like otitis media, as the affected area and treatment methods vary."},"example_sentences":[{"sentence":"Microscopic examination revealed the presence of vesicles, confirming the diagnosis of myringodermatitis.","translation":"顕微鏡検査により水疱の存在が確認され、水疱性鼓膜炎の診断が確定した。","type":"medical","meaning_category":"diagnosis"},{"sentence":"The patient's myringodermatitis was successfully treated with a course of antibiotics.","translation":"患者の水疱性鼓膜炎は、抗生物質の投与により効果的に治療された。","type":"medical","meaning_category":"treatment"}]}