{"word":"ovogonium","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"(生物学) 卵原細胞、始原卵細胞","english_definition":"(biology) A primitive germ cell of the female sex that differentiates to produce oogonia, which undergo oogenesis to form mature egg cells.","examples":[{"sentence":"The oogonium divides mitotically to increase the number of germ cells.","translation":"卵原細胞は有糸分裂して生殖細胞の数を増やします。"},{"sentence":"The ovogonium is the precursor to the oocyte.","translation":"卵原細胞は卵母細胞の前駆体です。"}],"collocations":["primordial germ cell","oogenesis","oocyte","follicle"],"synonyms":["primordial germ cell","oogonium"],"antonyms":[]},{"part_of_speech":"noun","definition":"(藻類・菌類) 造卵器","english_definition":"(botany, mycology) The female reproductive structure in certain algae and fungi, containing one or more oospheres.","examples":[{"sentence":"The oogonium in Chara is surrounded by a spiral of cells.","translation":"シャジクモの造卵器は細胞の螺旋状構造に囲まれています。"},{"sentence":"Fertilization occurs when a sperm cell enters the oogonium.","translation":"精細胞が造卵器に入ると受精が起こります。"}],"collocations":["oospore","antheridium","algae","fungi","Chara"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'ōon' (egg) and 'gonos' (offspring, seed).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌoʊvəˈɡoʊniəm/","syllables":"o-vo-go-ni-um"},"inflection":{"noun_plural":"ovogonia"},"usage_notes":{"explanation":"In animal biology, 'ovogonium' refers to the diploid germ cell that gives rise to oocytes through oogenesis. In botany and mycology, 'ovogonium' refers to the female reproductive structure in algae and fungi that contains the oosphere.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The ovogonium is a male reproductive cell.","correct":"✓ The ovogonium is a female reproductive cell.","note":"The ovogonium is a female reproductive cell, not a male one."}],"priority":"★★☆"},"related_words":{"derivatives":["oogenesis","oocyte","oosphere","antheridium"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Ovogonium' is a technical term used in biology, specifically in the fields of animal reproduction (oogenesis) and the study of algae and fungi. It refers to the precursor cell to the oocyte in animals and to the female reproductive structure in certain algae and fungi. Understanding this term requires a background in biology or related fields."},"example_sentences":[{"sentence":"The number of oogonia in the ovary increases through mitotic divisions.","translation":"卵巣内の卵原細胞の数は、有糸分裂によって増加します。","type":"noun","meaning_category":"Animal Biology"},{"sentence":"The oogonium in algae contains the oosphere, which will develop into a new organism after fertilization.","translation":"藻類の造卵器には卵胞が含まれており、受精後に新しい生物に発達します。","type":"noun","meaning_category":"Botany/Mycology"}]}