{"word":"Undocketed","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Not officially recorded or listed in a docket or official record.","english_definition":"Not entered into a docket or official list; not officially recorded.","examples":[{"sentence":"The undocketed documents were found in a filing cabinet.","translation":"未登録の書類はファイリングキャビネットの中で見つかりました。"},{"sentence":"The lawyer realized some undocketed cases needed immediate attention.","translation":"弁護士は、いくつかの未登録の事件が早急な対応を必要としていることに気づきました。"}],"collocations":["undocketed case","undocketed document","undocketed item","undocketed evidence"],"synonyms":["unrecorded","unlisted","unofficial","unfiled","unregistered"],"antonyms":["docketed","recorded","listed","official","filed","registered"]}],"etymology":{"value":"Formed by adding the prefix 'un-' (meaning 'not') to 'docketed,' the past participle of the verb 'docket.' 'Docket' comes from Middle English doket, a diminutive of 'dock,' referring to a place where ships are loaded or unloaded, and later to a list or summary of such activities.","priority":"N/A"},"pronunciation":{"ipa":"/ˌʌnˈdɒkɪtɪd/","syllables":"un-dock-et-ed"},"inflection":{"notes":"Adjective; does not inflect."},"usage_notes":{"explanation":"'Undocketed' typically refers to items, cases, or documents that have not been formally entered into an official record-keeping system. This can occur in legal, administrative, or organizational contexts where proper documentation is essential. The term implies a lack of official recognition or processing.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ The undocketed information was very important.","correct":"✓ The unrecorded information was very important.","note":"While 'undocketed' specifically means not entered in a docket, 'unrecorded' is a more general term for not being written down or formally noted. If the context doesn't explicitly involve a docket, 'unrecorded' might be more appropriate."}],"priority":"N/A"},"related_words":{"derivatives":["docket (noun, verb)","docketed (adjective)"],"phrasal_verbs":[],"priority":"N/A"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Undocketed' is a relatively uncommon word, primarily used in legal or administrative contexts. It describes something that has not been officially recorded or listed in a formal record or docket. Understanding this word requires familiarity with the concept of a 'docket' as an official list of cases or documents. Due to its specialized usage, it is not typically encountered in general English conversation or writing."},"example_sentences":[{"sentence":"The auditor discovered several undocketed transactions during the review.","translation":"監査人はレビュー中にいくつかの未登録の取引を発見しました。","type":"adjective","meaning_category":"Not officially recorded"},{"sentence":"The undocketed appeal caused confusion among the court staff.","translation":"未登録の控訴は裁判所職員の間で混乱を引き起こしました。","type":"adjective","meaning_category":"Not officially recorded"}]}