{"word":"Patroons","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"(歴史) パトロン制における地主、領主 (特にオランダ植民地時代のニューヨーク)","english_definition":"(historical) A landholder with manorial rights in the former Dutch colony of New Netherland (later New York), under Dutch patroonship.","examples":[{"sentence":"The patroons held considerable power in the early days of New Netherland.","translation":"パトロンたちはニューネーデルラントの初期においてかなりの権力を持っていた。"},{"sentence":"The patroon system aimed to encourage settlement in the New World.","translation":"パトロン制は新世界への入植を奨励することを目的としていた。"}],"collocations":["patroon system","van Rensselaer patroonship"],"synonyms":["landlord","seigneur","manor lord"],"antonyms":["tenant","peasant"]}],"etymology":{"value":"オランダ語の「patroon」（パトロン、後援者、守護聖人）に由来する。これはフランス語の「patron」を経て、ラテン語の「patronus」（保護者、擁護者）に遡る。","priority":"★★★"},"pronunciation":{"ipa":"/pəˈtruːnz/","syllables":"pa-troons"},"inflection":{"noun_plural":"Patroons"},"usage_notes":{"explanation":"「**Patroons**」は、特に17世紀のオランダ植民地ニューネーデルラント（現在のニューヨーク州の一部）における、特定の種類の地主を指す歴史的な用語です。彼らは、オランダ西インド会社によって与えられた特権の下で、広大な土地を所有し、入植者を連れてくる責任を負っていました。パトロン制は、植民地への入植を促進するためのものでしたが、後に社会的な不平等を生み出す要因となりました。現代英語では、歴史的な文脈でのみ使用されます。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a patron of the arts, like a patroon.","correct":"✓ He was a patron of the arts.","note":"「patron」は芸術家などを支援する人を指しますが、「patroon」は歴史的な地主を指すため、意味が異なります。文脈に応じて使い分けましょう。"},{"incorrect":"✗ The patroons were always fair to their tenants.","correct":"✓ The patroons were not always fair to their tenants.","note":"パトロン制は、地主が大きな権力を持つ制度であり、必ずしもテナントに公平であったとは限りません。歴史的な正確さを心がけましょう。"}],"priority":"★★☆"},"related_words":{"derivatives":["patroonship (名詞: パトロン制)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"C2 (歴史的な文脈でのみ)","frequency_google_ngram":"非常に低頻度 (Very low frequency) - 歴史的な文脈でのみ使用される専門用語。","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"「**Patroons**」は、オランダ植民地時代のニューヨーク（ニューネーデルラント）における特定の地主階級を指す歴史的な用語です。彼らは、植民地政府から広大な土地を与えられ、入植者を誘致し、その土地を開発する責任を負っていました。パトロン制は、植民地への入植を促進するための制度でしたが、同時に社会的な階層構造を固定化する側面もありました。この単語は、歴史学や社会学の文脈で、特にオランダ植民地時代のアメリカ史を扱う際に登場します。現代の日常会話ではほとんど使用されません。"},"example_sentences":[{"sentence":"The **patroons** of New Netherland wielded significant economic and political influence.","translation":"ニューネーデルラントのパトロンたちは、大きな経済的および政治的影響力を行使した。","type":"noun","meaning_category":"地主、領主"},{"sentence":"The **patroon** system ultimately failed to create a stable social order.","translation":"パトロン制は最終的に安定した社会秩序を築くことに失敗した。","type":"noun (singular form used generically)","meaning_category":"地主制度"}]}