{"word":"ohmmeter","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"オームメーター、抵抗計","english_definition":"An instrument for measuring electrical resistance in ohms.","examples":[{"sentence":"Use an ohmmeter to check the resistance of the resistor.","translation":"オームメーターを使って抵抗器の抵抗値を調べてください。"},{"sentence":"The ohmmeter showed a reading of 10 ohms.","translation":"オームメーターは10オームの値を表示しました。"}],"collocations":["digital ohmmeter (デジタルオームメーター)","analog ohmmeter (アナログオームメーター)","calibrate an ohmmeter (オームメーターを校正する)","use an ohmmeter (オームメーターを使う)"],"synonyms":["resistance meter"],"antonyms":[]}],"etymology":{"value":"The word \"ohmmeter\" is derived from \"ohm\" (the unit of electrical resistance, named after Georg Ohm) and \"meter\" (an instrument for measuring).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈoʊmˌmiːtər/","syllables":"ohm-me-ter"},"inflection":{"noun_plural":"ohmmeters"},"usage_notes":{"explanation":"An ohmmeter is used to measure the resistance of a component or circuit. It typically works by applying a small voltage to the component and measuring the resulting current. The resistance is then calculated using Ohm's Law (R = V/I). When using an ohmmeter, it's important to ensure that the circuit is not powered, as external voltage can damage the meter or give inaccurate readings.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a voltmeter to measure resistance.","correct":"✓ I used an ohmmeter to measure resistance.","note":"A voltmeter measures voltage, while an ohmmeter measures resistance."},{"incorrect":"✗ Ohmmeter measures current.","correct":"✓ An ohmmeter measures resistance.","note":"An ammeter measures current, while an ohmmeter measures resistance."}],"priority":"★★☆"},"related_words":{"derivatives":["ohm (オーム: 電気抵抗の単位)","resistance (抵抗)","resistor (抵抗器)"],"phrasal_verbs":[],"priority":"★★★"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"An ohmmeter is a tool used to measure how much a material resists the flow of electricity. It's like checking how easily electricity can pass through something. If the ohmmeter shows a high number, it means the material doesn't let electricity pass through easily. If it shows a low number, it means electricity can flow through it more easily. It is important to make sure the circuit you are testing is not powered on when using an ohmmeter."},"example_sentences":[{"sentence":"The electrician used an **ohmmeter** to test the wiring.","translation":"電気技師は配線をテストするためにオームメーターを使った。","type":"noun","meaning_category":"測定器"},{"sentence":"Before replacing the fuse, check it with an **ohmmeter** to see if it's blown.","translation":"ヒューズを交換する前に、オームメーターでチェックして切れているかどうか確認してください。","type":"noun","meaning_category":"測定器"}]}