{"word":"over-coach","priority":"N/A","meanings":[{"part_of_speech":"verb","definition":"(スポーツなどで)過剰に指導する、コーチングしすぎる","english_definition":"To coach (someone) excessively or to an unnecessary degree, often to the point of being detrimental.","examples":[{"sentence":"The young athlete felt stifled by his father, who tended to over-coach him at every practice.","translation":"その若い選手は、練習のたびに過剰に指導してくる父親に息苦しさを感じていた。"},{"sentence":"Some parents over-coach their children, pushing them too hard and taking the fun out of the game.","translation":"子供たちを過剰に指導し、無理強いをしてゲームの楽しさを奪ってしまう親もいる。"},{"sentence":"The coach was accused of over-coaching, focusing too much on minute details and not enough on the overall strategy.","translation":"そのコーチは、細部にこだわりすぎて全体的な戦略に十分な注意を払っていないとして、過剰な指導だと非難された。"}],"collocations":["over-coach a player (選手を過剰に指導する)","over-coach a team (チームを過剰に指導する)","tend to over-coach (過剰に指導しがちである)","be accused of over-coaching (過剰な指導だと非難される)"],"synonyms":["micromanage","overmanage","overinstruct","push too hard"],"antonyms":["under-coach","leave alone","give space"],"notes":"Typically implies negative consequences such as stifling creativity, increasing stress, or reducing enjoyment."}],"etymology":{"value":"Formed by combining the prefix 'over-' (meaning 'excessively' or 'too much') with the verb 'coach'.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌoʊvərˈkoʊtʃ/","syllables":"o-ver-coach"},"inflection":{"verb_forms":{"present_simple":["over-coach","over-coaches"],"past_simple":"over-coached","past_participle":"over-coached","present_participle":"over-coaching"}},"usage_notes":{"explanation":"'Over-coach' is often used in the context of sports, but it can also be applied to other areas where instruction or guidance is given, such as music, academics, or even parenting. The term implies that the coaching is excessive and counterproductive.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is over coach his son.","correct":"✓ He over-coaches his son.","note":"'Over-coach' is a verb, so it needs to be conjugated correctly. Also, it is usually written as one word or with a hyphen."},{"incorrect":"✗ The team was over-coached, so they lost the game.","correct":"✓ The team was over-coached, and as a result, they lost the game.","note":"The sentence implies a causal relationship. Adding \"as a result\" or similar phrase makes the connection clearer."}],"priority":"★☆☆"},"related_words":{"derivatives":["over-coaching (noun: 過剰な指導)"],"related_terms":["coach","coaching","micromanagement","helicopter parenting"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency - not a common term, but understandable.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Over-coach' means to give someone too much instruction or guidance, often in sports. It suggests that the coaching is excessive and may be harmful. It's used when someone is trying to control or direct someone else too much, which can prevent them from learning or enjoying the activity. It's not a very common word, but the meaning is clear from the combination of 'over-' and 'coach'."},"example_sentences":[{"sentence":"The coach's constant criticism caused him to over-coach the players, making them nervous and hesitant.","translation":"コーチの絶え間ない批判が、彼に選手たちを過剰に指導させ、選手たちを神経質でためらいがちにした。","type":"verb","meaning_category":"過剰に指導する"},{"sentence":"She realized she was starting to over-coach her daughter and decided to take a step back.","translation":"彼女は娘を過剰に指導し始めていることに気づき、一歩引くことにした。","type":"verb","meaning_category":"過剰に指導する"},{"sentence":"The effects of over-coaching can be detrimental to an athlete's confidence and performance.","translation":"過剰な指導の影響は、アスリートの自信とパフォーマンスに悪影響を及ぼす可能性がある。","type":"noun (over-coaching)","meaning_category":"過剰な指導"}]}