{"word":"Supertrain","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(1979年にアメリカで放送されたテレビドラマ)超特急","english_definition":"A short-lived American television series that aired in 1979 about a nuclear-powered, high-speed train that travels between New York City and Los Angeles.","examples":[{"sentence":"Supertrain was one of the most expensive television series ever made at the time.","translation":"超特急は当時、制作費が最も高額なテレビドラマの一つだった。"},{"sentence":"Despite its high production values, Supertrain was a critical and commercial failure.","translation":"高い制作費にもかかわらず、超特急は批評的にも商業的にも失敗作だった。"}],"collocations":["Supertrain TV series","Supertrain episode"],"synonyms":[],"antonyms":[]}],"etymology":{"value":"The name is a combination of 'super' and 'train', suggesting a train that is superior to ordinary trains.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈsuːpərˌtreɪn/","syllables":"Su-per-train"},"inflection":{"notes":"This word is a proper noun, so it doesn't have plural forms."},"usage_notes":{"explanation":"'Supertrain' refers specifically to the American television series from 1979. It is not a general term for high-speed trains.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The Japanese Shinkansen is a real supertrain.","correct":"✓ The Japanese Shinkansen is a real bullet train. / ✓ The Japanese Shinkansen is a very fast train.","note":"'Supertrain' should not be used as a generic term for high-speed trains. Use 'bullet train' or 'high-speed train' instead."}],"priority":"★★☆"},"related_words":{"derivatives":[],"related_terms":["bullet train","high-speed train","Shinkansen"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Supertrain' is a proper noun referring to a specific, relatively obscure television series. Understanding requires knowledge of 1970s American television history. It is not part of common vocabulary.","priority":"★★★"},"example_sentences":[{"sentence":"I've heard of Supertrain, but I've never actually seen an episode.","translation":"超特急のことは聞いたことがあるけど、実際にエピソードを見たことはない。","type":"noun","meaning_category":"TV series"},{"sentence":"Supertrain was known for its elaborate sets and special effects.","translation":"超特急はその凝ったセットと特殊効果で知られていた。","type":"noun","meaning_category":"TV series"}]}