{"word":"spur-rowel","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"a type of spur with a revolving toothed wheel","english_definition":"A type of spur that features a revolving disk or wheel with radiating points or teeth, designed to be rolled along the horse's flank.","examples":[{"sentence":"The cowboy's spur-rowels jingled as he walked.","translation":"カウボーイが歩くと、拍車の歯車がチャリンチャリンと音を立てた。"}],"collocations":["wear spur-rowels","use spur-rowels"],"synonyms":["rowel spur","toothed spur"],"antonyms":[]}],"etymology":{"value":"Combination of 'spur' (a device worn on a rider's heel for urging a horse onward) and 'rowel' (the revolving toothed wheel of a spur).","priority":"N/A"},"pronunciation":{"ipa":"/ˈspɜːrˌraʊəl/","syllables":"spur-row-el"},"inflection":{"noun_plural":"spur-rowels"},"usage_notes":{"explanation":"The term 'spur-rowel' specifically describes a spur equipped with a toothed wheel. The rowel is designed to rotate, providing a gentler (though still potentially forceful) means of urging a horse forward compared to spurs with a fixed point.","priority":"N/A"},"common_mistakes":{"examples":[],"priority":"N/A"},"related_words":{"derivatives":["spur","rowel"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low","priority":"N/A"},"readability_explanation":{"level":"C2","text":"'Spur-rowel' is a specialized term related to equestrian equipment, specifically referring to a type of spur with a toothed wheel. Understanding this term requires familiarity with horse riding and related terminology. It is not a commonly used word outside of contexts involving horses or historical discussions of riding equipment."},"example_sentences":[{"sentence":"The museum displayed various types of spurs, including several antique spur-rowels.","translation":"博物館には、いくつかのアンティークの歯車拍車を含む、さまざまな種類の拍車が展示されていました。","type":"noun","meaning_category":"type of spur"},{"sentence":"He adjusted his spur-rowels before mounting his horse.","translation":"彼は馬に乗る前に歯車拍車を調整した。","type":"noun","meaning_category":"type of spur"}]}