{"word":"polyglotting","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(言語を)多言語話者になる、多言語を習得する","english_definition":"The act or process of becoming multilingual; learning and using multiple languages.","examples":[{"sentence":"She enjoys polyglotting and is currently learning her fifth language.","translation":"彼女は多言語話者になることを楽しんでおり、現在5番目の言語を学んでいます。"},{"sentence":"Polyglotting can open up many opportunities for travel and work.","translation":"多言語を習得することは、旅行や仕事において多くの機会を開く可能性があります。"}],"collocations":["enjoy polyglotting","start polyglotting","practice polyglotting","opportunities for polyglotting"],"synonyms":["multilingualism","language acquisition","language learning"],"antonyms":["monolingualism"]}],"etymology":{"value":"Derived from 'polyglot' (knowing or using several languages) + '-ing' (present participle suffix).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌpɒlɪˈɡlɒtɪŋ/","syllables":"pol-y-glot-ting"},"inflection":{"verb_forms":{"present_simple":["polyglots"],"past_simple":"polyglotted","past_participle":"polyglotted","present_participle":"polyglotting"}},"usage_notes":{"explanation":"'Polyglotting' is a relatively recent term, primarily used in language learning communities to describe the active process of acquiring and using multiple languages. It emphasizes the ongoing nature of language learning and the identity of someone who actively engages in multilingualism.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is a polyglotting.","correct":"✓ He is polyglotting. / ✓ He is a polyglot.","note":"'Polyglotting' is a verb (present participle) or a gerund. To describe someone who speaks many languages, use 'polyglot' as a noun or adjective."},{"incorrect":"✗ Polyglotting is easy.","correct":"✓ Polyglotting is not always easy.","note":"While some people find it easier than others, acquiring multiple languages typically requires dedication and effort."}],"priority":"★☆☆"},"related_words":{"derivatives":["polyglot (noun: a person who knows and is able to use several languages; adjective: knowing or using several languages)","polyglotism (noun: the state of being polyglot)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A (Not a standard CEFR vocabulary word)","frequency_google_ngram":"Low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Polyglotting' refers to the process of learning and using multiple languages. It's a term often used among language enthusiasts to describe the active pursuit of multilingualism. It suggests an ongoing commitment to language acquisition and cultural understanding. Although not a common word in general conversation, it is recognized within specific language learning communities."},"example_sentences":[{"sentence":"She's dedicated to polyglotting and aims to speak ten languages fluently.","translation":"彼女は多言語話者になることに専念しており、10ヶ国語を流暢に話せるようになることを目指しています。","type":"verb","meaning_category":"多言語を習得する"},{"sentence":"His polyglotting skills impressed everyone at the international conference.","translation":"彼の多言語を話す能力は、国際会議で皆を感心させました。","type":"noun (gerund)","meaning_category":"多言語を習得すること"},{"sentence":"The online forum is a great resource for anyone interested in polyglotting.","translation":"そのオンラインフォーラムは、多言語習得に関心のある人にとって素晴らしい情報源です。","type":"noun (gerund)","meaning_category":"多言語を習得すること"},{"sentence":"Polyglotting is not just about memorizing vocabulary; it's about understanding different cultures.","translation":"多言語を習得することは、単に語彙を暗記することではなく、異文化を理解することです。","type":"noun (gerund)","meaning_category":"多言語を習得すること"}]}