{"word":"bipartible","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"二分割できる、二分可能な","english_definition":"Capable of being divided into two parts.","examples":[{"sentence":"The contract was designed to be bipartible, allowing for easy termination by either party.","translation":"その契約は二分割可能になるように設計されており、どちらの当事者も容易に解除できるようになっている。"},{"sentence":"The issue is not bipartible; there are more than two sides to the argument.","translation":"この問題は二分割できるものではない。議論には二つ以上の側面がある。"}],"collocations":["bipartible contract","bipartible agreement","bipartible structure"],"synonyms":["divisible","separable","bisectable"],"antonyms":["indivisible","inseparable","unitary"]}],"etymology":{"value":"From the Latin 'bi-' (two) + 'partire' (to divide).","priority":"★★☆"},"pronunciation":{"ipa":"/baɪˈpɑːrtɪbəl/","syllables":"bi-par-ti-ble"},"inflection":{"notes":"Comparative and superlative forms are not commonly used."},"usage_notes":{"explanation":"'Bipartible' is a relatively uncommon word, primarily used in formal or technical contexts. It indicates that something can be split into two distinct parts. It is often used in legal, mathematical, or structural contexts.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The bipartible decision was made by three parties.","correct":"✓ The bipartite decision was made by two parties.","note":"'Bipartible' refers to the capability of being divided into two parts, while 'bipartite' refers to something involving two parties or consisting of two parts. Use 'bipartite' when referring to decisions or agreements between two entities."}],"priority":"★★☆"},"related_words":{"derivatives":["bipartition (noun): the act of dividing into two parts","bipartite (adjective): involving two parts or parties"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'bipartible' is a formal term indicating the capability of being divided into two parts. It is not commonly used in everyday language and is more likely to appear in technical or legal contexts. Understanding its meaning requires a good grasp of Latin prefixes and root words."},"example_sentences":[{"sentence":"The data structure was designed to be bipartible for efficient processing.","translation":"そのデータ構造は、効率的な処理のために二分割可能になるように設計された。","type":"adjective","meaning_category":"二分割できる"},{"sentence":"The problem is not simply bipartible; there are multiple factors to consider.","translation":"その問題は単に二分割できるものではない。考慮すべき要因が複数存在する。","type":"adjective","meaning_category":"二分割できる"}]}