{"word":"simulfixation","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"同時置換、同時接辞付加：語の内部の音を変化させることによって文法的情報を伝える形態論的プロセス","english_definition":"A morphological process in which a morpheme is realized by modifying one or more features of a segment within the base to which it applies.","examples":[{"sentence":"Simulfixation is used in some languages to mark grammatical categories like tense or number.","translation":"同時置換は、いくつかの言語で時制や数などの文法カテゴリを示すために使用されます。"},{"sentence":"An example of simulfixation can be found in some dialects of English where the vowel in 'sit' changes to 'sat' in the past tense.","translation":"同時置換の例は、英語の方言に見られ、「sit」の母音が過去形で「sat」に変わる。"}],"collocations":["morphological process","grammatical category","vowel change","internal modification"],"synonyms":["internal modification","apophony","ablaut"],"antonyms":[]}],"etymology":{"value":"The term 'simulfixation' is derived from 'simultaneous' and 'affixation,' highlighting the simultaneous modification within the word rather than adding a separate affix.","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌsɪməlˈfɪkseɪʃən/","syllables":"si-mul-fix-a-tion"},"inflection":{"noun_plural":"simulfixations"},"usage_notes":{"explanation":"Simulfixation is a type of nonconcatenative morphology, meaning that it doesn't involve adding prefixes or suffixes to a word. Instead, it changes the internal structure of the word itself. This is relatively rare compared to affixation but occurs in various languages.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"Simulfixation involves adding prefixes and suffixes.","correct":"Simulfixation involves changing sounds within a word, not adding prefixes or suffixes.","note":"Simulfixation is about internal changes, not adding affixes."}],"priority":"★☆☆"},"related_words":{"derivatives":["simulfix (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"Simulfixation is a technical term in linguistics referring to a morphological process where a word's internal sounds change to indicate grammatical information, rather than adding prefixes or suffixes. This concept is typically encountered in advanced linguistic studies.","translation":"同時置換は言語学の専門用語で、接頭辞や接尾辞を追加するのではなく、単語の内部の音を変化させて文法情報を示す形態論的プロセスを指します。この概念は通常、高度な言語学の研究で遭遇します。"},"example_sentences":[{"sentence":"The use of simulfixation in verb conjugation is a characteristic feature of Semitic languages.","translation":"動詞の活用における同時置換の使用は、セム語族の特徴的な特徴です。","type":"general","meaning_category":"morphology"},{"sentence":"Simulfixation can be subtle, making it difficult to identify without linguistic analysis.","translation":"同時置換は微妙な場合があり、言語分析なしに識別することは困難です。","type":"general","meaning_category":"linguistics"}]}