{"word":"Psychologising","priority":"★☆☆","meanings":[{"part_of_speech":"verb","definition":"(他動詞・自動詞)心理学的に解釈する、心理学的に分析する、深読みする","english_definition":"(verb) to interpret or analyze something from a psychological perspective, often excessively or inappropriately.","examples":[{"sentence":"He was psychologising about her motives, trying to understand why she acted that way.","translation":"彼は彼女の動機を心理学的に分析し、なぜ彼女がそのような行動をとったのか理解しようとしていた。"},{"sentence":"Stop psychologising and just accept what happened.","translation":"深読みするのはやめて、ただ起きたことを受け入れなさい。"},{"sentence":"She tends to psychologise everything, even simple interactions.","translation":"彼女はどんなことでも、単純なやり取りさえも心理学的に解釈する傾向がある。"}],"collocations":["psychologise about (something)","psychologise someone's motives","psychologise a situation"],"synonyms":["analyze","interpret","psychoanalyze","overanalyze","speculate"],"antonyms":["accept","ignore","disregard","simplify"]},{"part_of_speech":"noun","definition":"心理学的な解釈、心理分析、深読み","english_definition":"(noun) the act or process of interpreting or analyzing something from a psychological perspective, often excessively or inappropriately.","examples":[{"sentence":"His psychologising of the situation was unhelpful and inaccurate.","translation":"彼の状況に対する心理学的な解釈は役に立たず、不正確だった。"},{"sentence":"Her constant psychologising became tiresome to those around her.","translation":"彼女の絶え間ない深読みは、周りの人々にとってうんざりするものになった。"}],"collocations":["excessive psychologising","unnecessary psychologising","psychologising of (something)"],"synonyms":["analysis","interpretation","psychoanalysis","overanalysis","speculation"],"antonyms":["acceptance","ignorance","disregard","simplification"]}],"etymology":{"value":"The word is derived from 'psychology' (the study of the mind) and the suffix '-ise' (or '-ize' in American English), which indicates the act of doing something. Therefore, 'psychologise' means to apply psychological principles or theories to understand or explain something.","priority":"★★☆"},"pronunciation":{"ipa":"/saɪˈkɒlədʒaɪzɪŋ/","syllables":"psy-chol-o-gis-ing"},"inflection":{"verb_forms":{"present_simple":["psychologise","psychologises"],"past_simple":"psychologised","past_participle":"psychologised","present_participle":"psychologising"},"noun_plural":"psychologisings"},"usage_notes":{"explanation":"'Psychologising' often carries a negative connotation, implying that someone is overanalyzing or inappropriately applying psychological principles to a situation. It can suggest a tendency to find hidden meanings or motivations where none exist, or to pathologize normal behavior. The term is frequently used when someone is trying to understand another person's actions or feelings, or when analyzing a social or cultural phenomenon.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He is psychologising the problem with math.","correct":"✓ He is psychologising the problem. / ✓ He is analyzing the problem psychologically.","note":"'Psychologising' refers to psychological analysis, not other types of analysis like mathematical analysis. If the analysis isn't psychological, a different verb should be used."},{"incorrect":"✗ She psychologised, and it was very helpful.","correct":"✓ She analyzed the situation psychologically, and it was very helpful.","note":"While psychologising can be helpful, the word often implies excessive or inappropriate analysis. If the analysis was genuinely helpful and appropriate, a more neutral term like 'analyzed psychologically' might be more suitable."}],"priority":"★★☆"},"related_words":{"derivatives":["psychology (名詞: 心理学)","psychological (形容詞: 心理的な)","psychologically (副詞: 心理学的に)","psychologist (名詞: 心理学者)","psychoanalysis (名詞: 精神分析)","psychoanalyze (動詞: 精神分析する)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Psychologising' refers to the act of analyzing or interpreting something from a psychological perspective. This often implies an attempt to understand the underlying motives, emotions, or reasons behind someone's behavior or a particular situation. The term can sometimes carry a negative connotation, suggesting that the analysis is excessive, speculative, or based on flimsy evidence. It is often used in contexts where someone is trying to understand complex human behavior or social dynamics.","priority":"★★☆"},"example_sentences":[{"sentence":"The professor was psychologising the characters' actions in the novel.","translation":"教授はその小説の登場人物の行動を心理学的に解釈していた。","type":"verb","meaning_category":"心理学的に解釈する"},{"sentence":"His constant psychologising of their relationship was exhausting.","translation":"彼の絶え間ない二人の関係に対する深読みは疲れるものだった。","type":"noun","meaning_category":"心理学的な解釈"},{"sentence":"She tried to avoid psychologising her friend's choices.","translation":"彼女は友人の選択を深読みすることを避けようとした。","type":"verb","meaning_category":"心理学的に解釈する"},{"sentence":"The article criticised the psychologising of political events.","translation":"その記事は政治的出来事の心理学的な解釈を批判した。","type":"noun","meaning_category":"心理学的な解釈"}]}