{"word":"glasscutter","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"ガラス切り、ガラスカッター","english_definition":"a tool used for scoring glass prior to breaking it.","examples":[{"sentence":"He used a glasscutter to cut the window pane.","translation":"彼はガラス切りを使って窓ガラスを切った。"},{"sentence":"A glasscutter is essential for working with sheet glass.","translation":"板ガラスを扱うにはガラス切りが不可欠だ。"}],"collocations":["diamond glasscutter","oil-filled glasscutter","carbide glasscutter"],"synonyms":["glass scorer","glass scribing tool"],"antonyms":[]},{"part_of_speech":"noun","definition":"(まれ) ガラスを切る人","english_definition":"(rare) a person who cuts glass.","examples":[{"sentence":"The glasscutter carefully measured the sheet before making the cut.","translation":"ガラス切り職人は、切断する前にシートを注意深く測定した。"}],"collocations":[],"synonyms":["glazier"],"antonyms":[]}],"etymology":{"value":"glass (ガラス) + cutter (切る人/道具)","priority":"★★★"},"pronunciation":{"ipa":"/ˈɡlæskʌtər/","syllables":"glass-cut-ter"},"inflection":{"noun_plural":"glasscutters"},"usage_notes":{"explanation":"A glasscutter is a tool specifically designed to score a line on a piece of glass. This score weakens the glass along that line, allowing it to be cleanly broken. It's important to note that a glasscutter doesn't actually cut the glass in the way a saw cuts wood; it creates a controlled fracture point.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I used a glass cutter to carve the glass.","correct":"✓ I used a glasscutter to score the glass.","note":"Glasscutters are used for scoring, not carving. Carving glass requires different tools and techniques."}],"priority":"★★☆"},"related_words":{"derivatives":["cut (verb, noun)","glass (noun)"],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"比較的低頻度 (Relatively low frequency)","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word 'glasscutter' refers to a specialized tool used for scoring glass. It's a compound word that combines 'glass' and 'cutter,' making its meaning relatively straightforward. While not an everyday word, it's commonly encountered in contexts related to construction, home improvement, or crafts involving glass. Understanding its function requires some familiarity with the process of cutting glass, which involves scoring the surface to create a controlled break.","priority":"★★☆"},"example_sentences":[{"sentence":"The stained glass artist used a glasscutter to shape the colorful pieces.","translation":"ステンドグラス作家は、ガラス切りを使ってカラフルなピースを成形した。","type":"noun","meaning_category":"道具"},{"sentence":"Always wear safety glasses when using a glasscutter.","translation":"ガラス切りを使用するときは、必ず安全メガネを着用してください。","type":"noun","meaning_category":"道具"},{"sentence":"The professional glasscutter could create intricate designs with ease.","translation":"プロのガラス切り職人は、複雑なデザインを簡単に作成できた。","type":"noun","meaning_category":"人 (まれ)"}]}