{"word":"Instrumentist","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"楽器演奏者、器楽奏者","english_definition":"A person who plays a musical instrument, especially as a profession.","examples":[{"sentence":"The orchestra was full of talented instrumentists.","translation":"そのオーケストラは才能ある器楽奏者でいっぱいだった。"},{"sentence":"He is a skilled instrumentist, proficient in both piano and violin.","translation":"彼は熟練した楽器演奏者で、ピアノとバイオリンの両方に精通している。"},{"sentence":"The instrumentist tuned his guitar before the performance.","translation":"その楽器演奏者は演奏前にギターを調律した。"}],"collocations":["talented instrumentist","skilled instrumentist","professional instrumentist","session instrumentist"],"synonyms":["musician","player","virtuoso","instrumentalist"],"antonyms":["vocalist","singer","composer","conductor"]}],"etymology":{"value":"From 'instrument' + '-ist'. 'Instrument' comes from Latin 'instrumentum' (tool, implement), and '-ist' is a suffix denoting a person who practices or is skilled in something.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈɪnstrəmən(t)ɪst/","syllables":"in-stru-men-tist"},"inflection":{"noun_plural":"instrumentists"},"usage_notes":{"explanation":"'Instrumentist' generally refers to someone who plays a musical instrument, often with a high level of skill. It is often used in contexts where the specific skill or profession of playing an instrument is emphasized. While 'musician' is a broader term, 'instrumentist' specifically highlights the instrumental aspect of their musical talent.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She is an instrumentist singer.","correct":"✓ She is an instrumentalist and a singer. / ✓ She is a singer who plays instruments.","note":"'Instrumentist' refers to playing instruments, so combining it directly with 'singer' is redundant. Instead, use 'instrumentalist and singer' or describe her as a singer who also plays instruments."},{"incorrect":"✗ He is a good instrumentalist.","correct":"✓ He is a good instrumentist.","note":"'Instrumentalist' is a more common and standard term than 'instrumentalist'."}],"priority":"★★☆"},"related_words":{"derivatives":["instrument","instrumental","instrumentation"],"related_terms":["musician","composer","conductor","orchestra","ensemble"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency, but used in formal contexts.","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"'Instrumentist' is a formal term for someone who plays a musical instrument. It's more specific than 'musician' because it highlights the person's skill with an instrument. You'll often find it in writing about orchestras, bands, or professional musicians. It's not a word you'd use in everyday conversation, but it's useful when you need a precise term for a musician who plays an instrument."},"example_sentences":[{"sentence":"The jazz band featured several talented instrumentists.","translation":"そのジャズバンドは数人の才能ある器楽奏者をフィーチャーしていた。","type":"general","meaning_category":"楽器演奏者"},{"sentence":"As a session instrumentist, she was hired to play on numerous albums.","translation":"セッション楽器演奏者として、彼女は数多くのアルバムで演奏するために雇われた。","type":"professional","meaning_category":"楽器演奏者"},{"sentence":"The instrumentist carefully selected his reeds before the performance.","translation":"その楽器演奏者は演奏前に慎重にリードを選んだ。","type":"specific instrument","meaning_category":"楽器演奏者"}]}