{"word":"pseudo-Assyrian","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"疑似アッシリア様式の、アッシリア風の","english_definition":"Imitating or resembling the art, architecture, or culture of ancient Assyria, but not genuinely Assyrian.","examples":[{"sentence":"The building's facade featured pseudo-Assyrian reliefs.","translation":"その建物の正面には疑似アッシリア様式のレリーフが施されていた。"},{"sentence":"The museum displayed several artifacts in a pseudo-Assyrian style.","translation":"その博物館には、疑似アッシリア様式で作られたいくつかの工芸品が展示されていた。"}],"collocations":["pseudo-Assyrian art","pseudo-Assyrian architecture","pseudo-Assyrian style","pseudo-Assyrian reliefs"],"synonyms":["Assyrian-inspired","Assyrian-esque","Assyrian-like"],"antonyms":["authentic Assyrian","genuine Assyrian"]}],"etymology":{"value":"The prefix \"pseudo-\" comes from Greek meaning \"false\" or \"pretended.\" It is combined with \"Assyrian,\" referring to the ancient Mesopotamian civilization. Thus, \"pseudo-Assyrian\" describes something that imitates Assyrian characteristics but is not authentically Assyrian.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsuːdoʊ əˈsɪriən/","syllables":"pseu-do-As-syr-i-an"},"inflection":{"notes":"Adjectives do not typically inflect in English."},"usage_notes":{"explanation":"\"Pseudo-Assyrian\" is used to describe art, architecture, or cultural artifacts that are made in a style that resembles that of ancient Assyria, but are not actually from that period or culture. It suggests an imitation or revival of Assyrian aesthetics. It is often used in the context of historical or art-historical discussions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The artifact was pseudo-Assyrian, so it was definitely from ancient Assyria.","correct":"✓ The artifact was pseudo-Assyrian, so it was made to look like it was from ancient Assyria, but it is not.","note":"Pseudo-Assyrian means it only resembles Assyrian, not that it is actually Assyrian."}],"priority":"★★☆"},"related_words":{"derivatives":["pseudo- (prefix meaning false or imitation)","Assyrian (relating to ancient Assyria)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term \"pseudo-Assyrian\" is a specialized term used in art history and archaeology to describe items or styles that imitate ancient Assyrian art but are not genuinely from that period or culture. Understanding the prefix \"pseudo-\" (meaning false or imitation) is essential to grasping the term's meaning. It is most likely encountered in academic or specialized contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The museum featured a collection of pseudo-Assyrian sculptures created in the 19th century.","translation":"その博物館には、19世紀に作られた疑似アッシリア様式の彫刻コレクションが展示されていた。","type":"adjective","meaning_category":"Imitation of Assyrian art"},{"sentence":"The architect incorporated pseudo-Assyrian motifs into the building's design.","translation":"建築家は建物のデザインに疑似アッシリア様式のモチーフを取り入れた。","type":"adjective","meaning_category":"Imitation of Assyrian architecture"}]}