{"word":"plasmolytic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"(細胞が)原形質分離した、原形質分離性の","english_definition":"Relating to or causing plasmolysis.","examples":[{"sentence":"The cell became plasmolytic after being placed in a hypertonic solution.","translation":"その細胞は高張液に置かれた後、原形質分離した。"}],"collocations":["plasmolytic cell","plasmolytic condition"],"synonyms":["plasmolyzed"],"antonyms":["turgid"],"notes":["Used in biology to describe cells that have undergone plasmolysis."]}],"etymology":{"value":"From 'plasmolysis' (the process of a cell losing water and shrinking) + '-tic' (suffix indicating relation).","priority":"★★☆"},"pronunciation":{"ipa":"/ˌplæzməˈlɪtɪk/","syllables":"plaz-mo-ly-tic"},"inflection":{"notes":"Adjectives do not typically inflect in English, but can form comparative and superlative degrees (more plasmolytic, most plasmolytic)."},"usage_notes":{"explanation":"'Plasmolytic' is a technical term used in biology, specifically in the context of cell biology and botany. It describes the state of a cell, particularly a plant cell, that has undergone plasmolysis. Plasmolysis occurs when the cell is in a hypertonic environment, causing water to move out of the cell, leading to shrinkage of the protoplasm and separation from the cell wall.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The cell is plasmolysis.","correct":"✓ The cell is plasmolytic.","note":"'Plasmolysis' is a noun (the process), while 'plasmolytic' is an adjective (describing the state)."},{"incorrect":"✗ The plasmolytic cell is full of water.","correct":"✓ The plasmolytic cell has lost water.","note":"Plasmolysis involves water loss, so a plasmolytic cell is not full of water."}],"priority":"★★☆"},"related_words":{"derivatives":["plasmolysis (noun): The process of a cell losing water and shrinking.","plasmolyze (verb): To undergo or cause plasmolysis."],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - a specialized term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Plasmolytic' is a scientific term primarily used in biology. It describes a cell that has undergone plasmolysis, which means it has lost water and its cytoplasm has shrunk away from the cell wall. This usually happens when the cell is in a hypertonic solution (a solution with a higher concentration of solutes than the cell's interior). Understanding this term requires knowledge of basic cell biology and osmosis."},"example_sentences":[{"sentence":"The plant cells became plasmolytic when immersed in a salt solution.","translation":"その植物細胞は塩溶液に浸されると原形質分離した。","type":"general"},{"sentence":"Under the microscope, the plasmolytic cells were easily identifiable by their shrunken protoplasts.","translation":"顕微鏡下では、原形質分離した細胞は、その収縮した原形質によって容易に識別できた。","type":"technical"}]}