{"word":"mogigraphic","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Relating to mogigraphia, the art of drawing or writing rapidly and carelessly.","english_definition":"Relating to or characteristic of mogigraphia, which is the art of rapid, careless drawing or writing.","examples":[{"sentence":"The artist's mogigraphic sketches captured the essence of the scene in a few quick strokes.","translation":"その芸術家のモギグラフィックなスケッチは、数回の素早いストロークでシーンの本質を捉えていた。"},{"sentence":"His notes were mogigraphic, almost illegible due to their hurried nature.","translation":"彼のメモはモギグラフィックで、急いで書かれたためほとんど判読できなかった。"}],"collocations":["mogigraphic sketch","mogigraphic style","mogigraphic notes","mogigraphic art"],"synonyms":["hasty","careless","rapid","scribbled","sketchy"],"antonyms":["careful","precise","deliberate","detailed"]}],"etymology":{"value":"Derived from 'mogigraphia,' which combines the Greek words 'mogis' (with difficulty) and 'graphia' (writing or drawing).","priority":"★☆☆"},"pronunciation":{"ipa":"/ˌmɒɡɪˈɡræfɪk/","syllables":"mo-gi-graph-ic"},"inflection":{"adjective_forms":{"comparative":"more mogigraphic","superlative":"most mogigraphic"}},"usage_notes":{"explanation":"'Mogigraphic' is a relatively rare term used to describe something related to mogigraphia, the art of quick, often careless, drawing or writing. It is often used to describe sketches, notes, or other forms of expression that are done rapidly and without great attention to detail. The term implies a sense of spontaneity and lack of formality.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The mogigraphic painting was highly detailed.","correct":"✓ The mogigraphic painting was characterized by its loose and rapid strokes.","note":"Mogigraphic art is generally characterized by its lack of detail and rapid execution, so describing it as highly detailed would be contradictory."}],"priority":"★☆☆"},"related_words":{"derivatives":["mogigraphia (noun): The art of rapid, careless drawing or writing.","mogigrapher (noun): One who practices mogigraphia."]},"level_frequency":{"CEFR":"N/A (Very rare)","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Mogigraphic' is a niche term primarily used in artistic or literary contexts to describe something related to the practice of mogigraphia. Understanding requires familiarity with the root term and its implications of speed, carelessness, and spontaneity in drawing or writing. The word is not commonly encountered in everyday language."},"example_sentences":[{"sentence":"The architect's mogigraphic renderings quickly conveyed the initial design concepts.","translation":"建築家のモギグラフィックなレンダリングは、初期のデザインコンセプトを素早く伝えた。","type":"adjective","meaning_category":"Relating to rapid drawing"},{"sentence":"Her mogigraphic handwriting made it difficult to decipher her grocery list.","translation":"彼女のモギグラフィックな筆跡は、食料品リストを解読するのを困難にした。","type":"adjective","meaning_category":"Relating to careless writing"}]}