{"word":"interdistrict","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"複数の地区間の、地区間で行われる","english_definition":"Involving or relating to more than one district.","examples":[{"sentence":"The interdistrict competition brought together students from all over the region.","translation":"地区間競技会は、地域全体の学生を集めました。"},{"sentence":"An interdistrict agreement was established to share resources.","translation":"資源を共有するために地区間協定が締結されました。"},{"sentence":"The interdistrict bus service connects several towns.","translation":"地区間バスサービスは、いくつかの町を結んでいます。"}],"collocations":["interdistrict transportation","interdistrict cooperation","interdistrict rivalry","interdistrict transfer"],"synonyms":["regional","areawide","multidistrict"],"antonyms":["local","intradistrict","parochial"]}],"etymology":{"value":"The word \"interdistrict\" is formed by combining the prefix \"inter-\" (meaning between, among) with the word \"district\".","priority":"★★★"},"pronunciation":{"ipa":"ˌɪntərˈdɪstrɪkt/","syllables":"in-ter-dis-trict"},"inflection":{"notes":"This word is an adjective and does not have different inflections."},"usage_notes":{"explanation":"\"Interdistrict\" is used to describe activities, agreements, or relationships that involve multiple districts. It is commonly used in contexts such as education, transportation, and governance. The word emphasizes the connection or interaction between different districts.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"The intradistrict game was exciting.","correct":"The interdistrict game was exciting.","note":"Use \"interdistrict\" when the game is between multiple districts, not within a single district."}],"priority":"★★☆"},"related_words":{"derivatives":["interdistricts (noun)"],"phrases":["interdistrict transfer","interdistrict agreement"],"priority":"★★☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"relatively low","priority":"★☆☆"},"readability_explanation":{"level":"B2","text":"The word \"interdistrict\" is used to describe something that involves more than one district. A district is a specific area or region, often used for administrative or governmental purposes. Therefore, \"interdistrict\" refers to activities, agreements, or relationships that occur between or among different districts. It is commonly used in formal contexts such as education, transportation, or governance.","priority":"★★☆"},"example_sentences":[{"sentence":"The interdistrict project aims to improve water quality across several regions.","translation":"その地区間プロジェクトは、いくつかの地域全体の水質改善を目指しています。","type":"general","meaning_category":"general"},{"sentence":"Our school participates in an interdistrict sports league.","translation":"私たちの学校は、地区間スポーツリーグに参加しています。","type":"education","meaning_category":"education"},{"sentence":"The interdistrict highway connects rural communities to urban centers.","translation":"その地区間高速道路は、農村地域と都市部を結んでいます。","type":"transportation","meaning_category":"transportation"}]}