{"word":"worker-endorsed","meanings":[{"part_of_speech":"adjective","definition":"労働者によって支持された、労働者の支持を得ている","english_definition":"Supported or approved by workers; having the endorsement of workers.","examples":[{"sentence":"The union is promoting a worker-endorsed candidate for the board.","translation":"労働組合は、労働者の支持を得ている候補者を理事会に推薦しています。"},{"sentence":"This policy is worker-endorsed and aims to improve working conditions.","translation":"この政策は労働者の支持を得ており、労働条件の改善を目指しています。"},{"sentence":"The company proudly announced its worker-endorsed safety program.","translation":"会社は労働者の支持を得ている安全プログラムを発表しました。"}],"collocations":["worker-endorsed candidate","worker-endorsed policy","worker-endorsed program","worker-endorsed initiative","worker-endorsed product"],"synonyms":["labor-supported","union-approved","employee-backed","staff-endorsed"],"antonyms":["management-approved","employer-sponsored","company-backed"],"related_words":["worker","endorse","endorsement","labor","union","employee"],"level_frequency":{},"usage_notes":{"explanation":"'Worker-endorsed' is often used to emphasize that a particular decision, product, or candidate has the support of the workforce, rather than being imposed by management. It suggests that the workers themselves have had a say in the matter and approve of the outcome.","priority":"★★★"},"readability_explanation":{"level":"C1","text":"The term 'worker-endorsed' signifies that a product, policy, or candidate has received the backing and approval of the workers themselves. It implies a level of support and agreement from the employees, suggesting that their voices have been heard and their preferences considered. This term is often used in contexts related to labor unions, workplace initiatives, and political campaigns to highlight the support of the working class."},"example_sentences":[{"sentence":"The new contract is worker-endorsed and includes better benefits.","translation":"新しい契約は労働者の支持を得ており、より良い福利厚生が含まれています。","type":"adjective","meaning_category":"労働者によって支持された"},{"sentence":"We are proud to offer worker-endorsed products made with fair labor practices.","translation":"公正な労働慣行で作られた、労働者の支持を得ている製品を提供できることを誇りに思います。","type":"adjective","meaning_category":"労働者の支持を得ている"}]}],"etymology":{"value":"Combination of 'worker' (someone who works) and 'endorsed' (approved or supported).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈwɜːrkər ɪnˈdɔːrst/","syllables":"work-er en-dorsed"},"inflection":{},"common_mistakes":{}}