{"word":"esoterismo","priority":"N/A","meanings":[{"part_of_speech":"noun","definition":"Conjunto de conocimientos, doctrinas, enseñanzas, iniciaciones, ritos, símbolos y prácticas de una corriente religiosa, filosófica, artística o científica, que son secretos, ocultos o de difícil acceso, y que sólo pueden ser entendidos o practicados por un grupo selecto de personas iniciadas.","english_definition":"A body of knowledge, doctrines, teachings, initiations, rites, symbols, and practices of a religious, philosophical, artistic, or scientific current, that are secret, hidden, or difficult to access, and that can only be understood or practiced by a select group of initiated people.","examples":[{"sentence":"El esoterismo siempre ha atraído a aquellos que buscan un conocimiento más profundo de la realidad.","translation":"Esotericism has always attracted those who seek a deeper understanding of reality."},{"sentence":"Muchas sociedades secretas basan sus enseñanzas en el esoterismo.","translation":"Many secret societies base their teachings on esotericism."}],"collocations":["prácticas de esoterismo","conocimientos de esoterismo","estudios de esoterismo"],"synonyms":["ocultismo","misticismo"],"antonyms":["exoterismo"]}],"etymology":{"value":"Del griego ἐσωτερικός (esōterikós, 'interno').","priority":"N/A"},"pronunciation":{"ipa":"/eso.teˈɾiz.mo/","syllables":"e-so-te-ris-mo"},"inflection":{"noun_plural":"esoterismos"},"usage_notes":{"explanation":"El término 'esoterismo' se refiere a un conjunto de conocimientos y prácticas que son considerados secretos o accesibles sólo a un grupo selecto de personas. Se diferencia del 'exoterismo', que se refiere a las enseñanzas públicas y accesibles a todos.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"El esoterismo es una ciencia exacta.","correct":"El esoterismo es un conjunto de creencias y prácticas no necesariamente basadas en la ciencia.","note":"El esoterismo no es una ciencia exacta, sino más bien un conjunto de creencias y prácticas."}],"priority":"N/A"},"related_words":{"derivatives":["esotérico"],"related_concepts":["ocultismo","gnosticismo","hermetismo","alquimia","astrología"]},"level_frequency":{"level":"C1","frequency_google_ngram":"Relativamente bajo. Es un término especializado.","priority":"N/A"},"readability_explanation":{"level":"C1","text":"El término 'esoterismo' se utiliza en contextos académicos, filosóficos y religiosos para referirse a un conjunto de conocimientos y prácticas ocultas o secretas. Su comprensión requiere un cierto nivel de familiaridad con estos campos."},"example_sentences":[{"sentence":"El esoterismo occidental ha influido en muchas corrientes filosóficas y artísticas.","translation":"Western esotericism has influenced many philosophical and artistic currents.","type":"noun","meaning_category":"Conjunto de conocimientos ocultos"},{"sentence":"Algunos autores consideran que el esoterismo es una forma de búsqueda espiritual.","translation":"Some authors consider esotericism to be a form of spiritual search.","type":"noun","meaning_category":"Búsqueda espiritual"}]}