{"word":"dutra","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(Botany) A genus of poisonous plants, commonly known as jimsonweeds or devil's trumpets, belonging to the nightshade family (Solanaceae).","english_definition":"A genus of poisonous plants, commonly known as jimsonweeds or devil's trumpets, belonging to the nightshade family (Solanaceae).","examples":[{"sentence":"The field was overgrown with dutra plants.","translation":"その畑はドゥトラの植物が生い茂っていた。"},{"sentence":"Dutra is known for its hallucinogenic properties.","translation":"ドゥトラは幻覚作用があることで知られている。"}],"collocations":["dutra plant","dutra poisoning","dutra extract"],"synonyms":["jimsonweed","devil's trumpet","thorn apple"],"antonyms":[]}],"etymology":{"value":"The word 'dutra' is derived from the Hindi name 'dhatura' for these plants.","priority":"★★★"},"pronunciation":{"ipa":"/ˈduːtrə/","syllables":"du-tra"},"inflection":{"noun_plural":"dutras"},"usage_notes":{"explanation":"'Dutra' refers specifically to plants of the genus Datura. These plants are known for their toxicity and hallucinogenic effects.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a beautiful dutra in the garden.","correct":"✓ I saw a beautiful flower in the garden.","note":"Unless you are specifically identifying a Datura plant, it's better to use a more general term like 'flower'."}],"priority":"★★☆"},"related_words":{"derivatives":["daturism (poisoning from datura plants)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Dutra' is a specialized botanical term referring to plants of the genus Datura. It is not commonly used outside of botanical or toxicological contexts. Understanding of this term implies a familiarity with plant taxonomy or related scientific fields."},"example_sentences":[{"sentence":"The shaman used dutra in the ritual.","translation":"シャーマンは儀式でドゥトラを使った。","type":"noun","meaning_category":"Botany"},{"sentence":"Symptoms of dutra poisoning can include hallucinations and delirium.","translation":"ドゥトラ中毒の症状には、幻覚やせん妄が含まれることがある。","type":"noun","meaning_category":"Toxicology"}]}