{"word":"roseola","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"突発性発疹","english_definition":"a common viral infection of infants and young children, characterized by a high fever followed by a rash.","examples":[{"sentence":"My baby has a high fever and a rash; the doctor suspects roseola.","translation":"私の赤ちゃんは高熱と発疹があり、医者は突発性発疹を疑っています。"},{"sentence":"Roseola is usually mild and self-limiting.","translation":"突発性発疹は通常、軽度で自然に治ります。"}],"collocations":["roseola infantum","get roseola","diagnose roseola","roseola rash","roseola symptoms"],"synonyms":["exanthem subitum","sixth disease"],"antonyms":[]}],"etymology":{"value":"The term 'roseola' comes from the Latin word 'roseus,' meaning 'rosy' or 'rose-colored,' referring to the characteristic rash associated with the disease.","priority":"★★☆"},"pronunciation":{"ipa":"/roʊˈziːələ/","syllables":"ro-se-o-la"},"inflection":{"noun_plural":"roseolas"},"usage_notes":{"explanation":"Roseola is a common childhood illness, typically affecting children between six months and two years old. It is caused by human herpesvirus 6 (HHV-6) or, less commonly, human herpesvirus 7 (HHV-7). The illness usually begins with a sudden high fever, often exceeding 103°F (39.4°C), which lasts for three to seven days. Once the fever subsides, a characteristic rash appears, consisting of small, pink, slightly raised spots. The rash typically starts on the trunk and then spreads to the neck, face, and extremities. Roseola is generally mild and self-limiting, and most children recover without complications.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Roseola is a bacterial infection.","correct":"✓ Roseola is a viral infection.","note":"Roseola is caused by a virus, not bacteria."},{"incorrect":"✗ Roseola is prevented by the MMR vaccine.","correct":"✓ There is no vaccine to prevent roseola.","note":"The MMR vaccine protects against measles, mumps, and rubella, but not roseola."},{"incorrect":"✗ The rash appears before the fever in roseola.","correct":"✓ The fever appears before the rash in roseola.","note":"In roseola, the high fever typically precedes the rash."}],"priority":"★★☆"},"related_words":{"derivatives":["roseolic (adjective)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"B2","frequency_google_ngram":"Relatively low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Roseola' is a medical term referring to a common viral infection in young children. It's characterized by a high fever followed by a distinctive rash. The term is primarily used in medical contexts and is not part of everyday vocabulary. Understanding the term is useful for parents and caregivers dealing with common childhood illnesses. The infection is typically mild and self-limiting, but it's important to consult a healthcare professional for diagnosis and management."},"example_sentences":[{"sentence":"The doctor diagnosed the baby with **roseola** after observing the fever and rash.","translation":"医師は熱と発疹を観察した後、その赤ちゃんを突発性発疹と診断しました。","type":"noun","meaning_category":"disease"},{"sentence":"The **roseola** rash typically appears after the fever breaks.","translation":"突発性発疹の発疹は通常、熱が下がった後に現れます。","type":"noun","meaning_category":"symptom"},{"sentence":"Most children recover from **roseola** without any complications.","translation":"ほとんどの子供たちは合併症なしに突発性発疹から回復します。","type":"noun","meaning_category":"recovery"}]}