{"word":"heritance","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"相続、遺産、受け継いだもの","english_definition":"The act or right of inheriting; something that is inherited; an inheritance.","examples":[{"sentence":"The heritance included a large sum of money and several properties.","translation":"相続財産には多額の金銭といくつかの不動産が含まれていました。"},{"sentence":"She received a substantial heritance from her grandmother.","translation":"彼女は祖母からかなりの遺産を受け継ぎました。"},{"sentence":"His heritance allowed him to start his own business.","translation":"彼の遺産のおかげで、彼は自分のビジネスを始めることができました。"}],"collocations":["receive a heritance (遺産を受け取る)","substantial heritance (かなりの遺産)","family heritance (家族の遺産)"],"synonyms":["inheritance","legacy","bequest","heritage"],"antonyms":["forfeiture","loss"]}],"etymology":{"value":"'Heritance' is derived from the Middle English word 'heritaunce', which comes from the Old French 'heritage'. It is related to the word 'heir', meaning someone who inherits.","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɛrɪtəns/","syllables":"her-i-tance"},"inflection":{"noun_plural":"heritances"},"usage_notes":{"explanation":"'Heritance' is a formal and somewhat archaic term for 'inheritance'. While 'inheritance' is more commonly used in modern English, 'heritance' can still be found in legal or formal contexts. It refers to the act of inheriting or the property that is inherited.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ She received a great heritance of knowledge from her father.","correct":"✓ She received a great inheritance of knowledge from her father.","note":"While 'heritance' can refer to something inherited, 'inheritance' is more common when referring to non-tangible things like knowledge or skills."},{"incorrect":"✗ The heritance was divide between the siblings.","correct":"✓ The heritance was divided between the siblings.","note":"'Heritance' is a noun, so it should be used as such. 'Divide' should be 'divided' to match the tense."}],"priority":"★★☆"},"related_words":{"derivatives":["inherit (verb: 相続する)","heir (noun: 相続人)","heritage (noun: 遺産、文化遺産)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Heritance' is a formal noun that means the same as 'inheritance'. It refers to the act of receiving property, money, or other assets from someone who has died. While 'inheritance' is more commonly used, 'heritance' may appear in legal or very formal writing. It's not a word you'll hear or read every day, but understanding it can be helpful in certain contexts."},"example_sentences":[{"sentence":"The lawyer carefully reviewed the terms of the heritance.","translation":"弁護士は遺産の条件を注意深く確認しました。","type":"noun","meaning_category":"相続、遺産"},{"sentence":"The family's heritance included a valuable collection of antiques.","translation":"家族の遺産には貴重なアンティークコレクションが含まれていました。","type":"noun","meaning_category":"受け継いだもの"}]}