{"word":"Ascomycetal","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"子嚢菌の、子嚢菌に属する","english_definition":"Relating to or belonging to the Ascomycota (Ascomycetes).","examples":[{"sentence":"Ascomycetal fungi are a diverse group.","translation":"子嚢菌類は多様なグループである。"}],"collocations":["ascomycetal fungi","ascomycetal spores"],"synonyms":["ascomycetous"],"antonyms":[]}],"etymology":{"value":"From Ascomycota (the phylum name) + -al (suffix indicating belonging or relating to). Ascomycota is derived from the Greek words 'askos' (sac or bag) and 'mykes' (fungus), referring to the sac-like structure (ascus) in which spores are formed.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌæskəmaɪˈsiːtəl/","syllables":"As-co-my-ce-tal"},"inflection":{"notes":"Adjective, no specific inflection."},"usage_notes":{"explanation":"'Ascomycetal' is primarily used in scientific and mycological contexts to describe characteristics, structures, or species belonging to the Ascomycota phylum. It's not commonly used in everyday language.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ An ascomycetal is a type of mushroom.","correct":"✓ An ascomycetal fungus is a type of fungus.","note":"'Ascomycetal' is an adjective, not a noun. Use it to describe something, like 'ascomycetal fungus' rather than using it as a noun itself."}],"priority":"★★☆"},"related_words":{"derivatives":["Ascomycota (phylum name)","Ascomycete (noun: a fungus belonging to the Ascomycota)","Ascus (sac-like structure in which spores are formed)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Ascomycetal' is a technical term used in mycology (the study of fungi) and biology. Understanding requires knowledge of fungal classification and reproductive structures. It is not a word used in general conversation.","priority":"★★☆"},"example_sentences":[{"sentence":"The study focused on the identification of various ascomycetal species in the soil sample.","translation":"その研究は、土壌サンプル中の様々な子嚢菌種の特定に焦点を当てた。","type":"adjective","meaning_category":"子嚢菌の"},{"sentence":"Ascomycetal infections can affect both plants and animals.","translation":"子嚢菌による感染症は、植物と動物の両方に影響を与える可能性がある。","type":"adjective","meaning_category":"子嚢菌に属する"}]}