{"word":"imbruting","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","definition":"(transitive) To reduce to the state of a brute; to brutalize.","english_definition":"To reduce to the state of a brute; to brutalize.","examples":[{"sentence":"The constant exposure to violence imbruted the soldiers.","translation":"絶え間ない暴力への暴露は兵士たちを獣のようにした。"}],"synonyms":["brutalize","degrade","dehumanize"],"antonyms":["civilize","ennoble"]}],"etymology":{"value":"From im- (prefix meaning 'into' or 'cause to be') + brute + -ing (present participle suffix).","priority":"★★★"},"pronunciation":{"ipa":"/ɪmˈbruːtɪŋ/","syllables":"im-brut-ing"},"inflection":{"verb_forms":{"present_simple":["imbrute","imbrutes"],"past_simple":"imbruted","past_participle":"imbruted","present_participle":"imbruting"}},"usage_notes":{"explanation":"'Imbruting' is the present participle and gerund form of the verb 'imbrute,' which means to degrade or brutalize someone or something, reducing them to a brutish state. It implies a loss of higher qualities such as reason, compassion, or refinement.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The imbruting weather made everyone stay inside.","correct":"✓ The brutal weather made everyone stay inside.","note":"'Imbruting' refers to the act of making something brutish, not simply harsh conditions. Use 'brutal' or 'harsh' for weather. "},{"incorrect":"✗ He was imbruting because of the stress.","correct":"✓ He was becoming imbruted because of the stress.","note":"'Imbruting' is the action of making something brutish. To describe someone becoming brutish, use 'becoming imbruted' or 'being imbruted'."}],"priority":"★★☆"},"related_words":{"derivatives":["imbrute (verb)","imbruted (adjective)","imbrutement (noun)"],"related_terms":["brute (noun)","brutish (adjective)","brutality (noun)"],"priority":"★★☆"},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency - A rare word.","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Imbruting' is a relatively rare and sophisticated word that describes the process of making someone or something brutish, degrading their moral or intellectual qualities. It is often used in literary or academic contexts to describe the negative effects of violence, oppression, or dehumanizing conditions. Because of its rarity and specific meaning, it is unlikely to be encountered in everyday conversation or writing. Understanding the word requires a strong vocabulary and an awareness of its connotations of moral and intellectual degradation."},"example_sentences":[{"sentence":"The harsh conditions of the prison were imbruting the inmates, stripping them of their humanity.","translation":"刑務所の過酷な環境は囚人たちを獣のようにし、人間性を奪っていた。","type":"verb","meaning_category":"brutalizing"},{"sentence":"He witnessed the imbruting effect of war on the young soldiers.","translation":"彼は戦争が若い兵士たちを獣のように変えていく影響を目撃した。","type":"verb","meaning_category":"degrading"},{"sentence":"The constant exposure to propaganda was imbruting the population, making them more susceptible to violence.","translation":"絶え間ないプロパガンダへの暴露は人々を獣のようにし、暴力を受け入れやすくしていた。","type":"verb","meaning_category":"dehumanizing"}]}