{"word":"iridocyte","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"虹色素胞：動物の体表に見られる、光を反射して虹色や金属光沢を出す特殊な細胞。","english_definition":"A specialized pigment cell in animals that reflects light using crystalline guanine, often producing iridescence or metallic sheen.","examples":[{"sentence":"The iridocytes in the fish's scales create a shimmering effect.","translation":"魚の鱗にある虹色素胞が、きらめく効果を生み出している。"},{"sentence":"Iridocytes are responsible for the vibrant colors seen in many cephalopods.","translation":"虹色素胞は、多くの頭足類に見られる鮮やかな色の原因となっている。"}],"collocations":["iridocyte layer","iridocyte reflection","guanine iridocyte"],"synonyms":["guanophore","reflecting cell","iridosome"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words \"iris\" (rainbow) and \"kytos\" (cell).","priority":"★★☆"},"pronunciation":{"ipa":"/ɪˈrɪdəˌsaɪt/","syllables":"i-ri-do-cyte"},"inflection":{"noun_plural":"iridocytes"},"usage_notes":{"explanation":"Iridocytes are found in a variety of animals, including fish, amphibians, reptiles, and cephalopods. The reflected light can serve various purposes, such as camouflage, communication, or attracting mates. The iridescence is caused by the interference of light waves reflected from the multiple layers of guanine crystals within the cell.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The iridocyte is what makes the fish smell.","correct":"✓ The iridocyte is what makes the fish shimmer.","note":"Iridocytes are responsible for the shimmer, not the smell."}],"priority":"★☆☆"},"related_words":{"derivatives":["iridescence (noun): the property of exhibiting rainbow-like colors.","iridescent (adjective): exhibiting rainbow-like colors."],"phrasal_verbs":[],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'iridocyte' refers to a specialized cell found in certain animals, responsible for producing iridescent or metallic colors through light reflection. This is achieved via crystalline guanine structures within the cell. Understanding this term requires familiarity with biological terminology and optical phenomena.","priority":"★★☆"},"example_sentences":[{"sentence":"The squid uses its iridocytes to change color and blend in with its surroundings.","translation":"イカは虹色素胞を使って色を変え、周囲の環境に溶け込む。","type":"scientific","meaning_category":"camouflage"},{"sentence":"Researchers are studying the structure of iridocytes to develop new types of optical materials.","translation":"研究者たちは、新しいタイプの光学材料を開発するために、虹色素胞の構造を研究している。","type":"scientific","meaning_category":"optical materials"}]}