{"word":"Twice-sentenced","priority":"N/A","meanings":[{"part_of_speech":"adjective","definition":"Having received two sentences for crimes, typically referring to a legal or judicial context.","english_definition":"Having been sentenced to punishment for a crime on two separate occasions.","examples":[{"sentence":"The twice-sentenced offender was back in court for a new charge.","translation":"二度判決を受けた犯罪者は、新たな罪で再び法廷に現れた。"},{"sentence":"The parole board considered the twice-sentenced inmate's request for early release.","translation":"仮釈放審査委員会は、二度判決を受けた受刑者の早期釈放の要求を検討した。"}],"collocations":["twice-sentenced offender","twice-sentenced inmate","twice-sentenced felon"],"synonyms":["repeat offender","recidivist","habitual criminal"],"antonyms":["first-time offender"]}],"etymology":{"value":"The word is formed by combining \"twice\" (meaning two times) with \"sentenced\" (meaning having received a legal punishment).","priority":"N/A"},"pronunciation":{"ipa":"/ˈtwaɪsˌsɛntənst/","syllables":"twice-sen-tenced"},"inflection":{"notes":"This word does not have typical inflections as it is an adjective."},"usage_notes":{"explanation":"This term is primarily used in legal and criminological contexts to describe individuals who have been convicted and sentenced for crimes on two separate occasions. It's often used to highlight the person's history of criminal behavior.","priority":"N/A"},"common_mistakes":{"examples":[{"incorrect":"✗ He was twice sentence for the crime.","correct":"✓ He was twice-sentenced for the crime.","note":"The correct form is \"twice-sentenced\" as a compound adjective modifying the person. The verb form would be \"sentenced twice.\""}],"priority":"N/A"},"related_words":{"derivatives":["sentence","sentencing","twice"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"N/A"},"readability_explanation":{"level":"C1","text":"The term \"twice-sentenced\" is a relatively specialized term used in legal or criminological contexts. It implies a level of understanding of the justice system and the concept of sentencing. Therefore, it is more suitable for advanced learners. "},"example_sentences":[{"sentence":"The court documents identified him as a twice-sentenced drug dealer.","translation":"裁判所の書類は彼を二度判決を受けた麻薬売人として特定した。","type":"adjective","meaning_category":"Legal/Criminology"},{"sentence":"The study focused on the rehabilitation outcomes of twice-sentenced individuals.","translation":"その研究は、二度判決を受けた個人のリハビリテーションの結果に焦点を当てた。","type":"adjective","meaning_category":"Criminology"}]}