{"word":"autonitridation","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(化学)自己窒化: ある物質が、外部から窒素源を加えなくても、高温下で自身の構成元素から窒素を取り込み、窒化物へと変化する現象。","english_definition":"(chemistry) A process in which a material incorporates nitrogen from its own constituent elements to form a nitride at high temperatures, without the addition of an external nitrogen source.","examples":[{"sentence":"Silicon powder undergoes autonitridation at high temperatures to form silicon nitride.","translation":"シリコン粉末は高温で自己窒化を起こし、窒化ケイ素を生成する。"},{"sentence":"The autonitridation process is used in the synthesis of certain advanced ceramic materials.","translation":"自己窒化プロセスは、特定の先進セラミック材料の合成に利用される。"}],"collocations":["silicon autonitridation (シリコンの自己窒化)","titanium autonitridation (チタンの自己窒化)","autonitridation process (自己窒化プロセス)","high-temperature autonitridation (高温自己窒化)"],"synonyms":["self-nitridation"],"antonyms":[]}],"etymology":{"value":"\"auto-\" (自己) + \"nitridation\" (窒化) から構成される。\"Nitridation\" は、窒素を導入して窒化物にする化学プロセスを指す。","priority":"★★☆"},"pronunciation":{"ipa":"ˌɔːtoʊˌnaɪˈtrɪdeɪʃən","syllables":"au-to-ni-tri-da-tion"},"inflection":{"noun_plural":"autonitridations"},"usage_notes":{"explanation":"\"Autonitridation\" は、特定の材料科学や化学の分野で使われる専門用語です。一般的には、シリコンやチタンなどの元素が、高温環境下で自身の元素から窒素を取り込み、窒化物セラミックスを形成するプロセスを指します。外部から窒素ガスなどを供給する必要がない点が特徴です。","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The autonitridation was caused by adding nitrogen gas.","correct":"✓ The autonitridation occurred without adding nitrogen gas.","note":"自己窒化は外部からの窒素源なしに起こる現象なので、窒素ガスを加えるという記述は誤りです。"},{"incorrect":"✗ Autonitridation is a process of adding oxygen.","correct":"✓ Autonitridation is a process of adding nitrogen from its own constituent elements.","note":"自己窒化は窒素を取り込むプロセスであり、酸素を加えるプロセスではありません。"}],"priority":"★★☆"},"related_words":{"derivatives":["nitride (窒化物)","nitriding (窒化処理)"],"priority":"★★☆"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"低頻度 (Low frequency) - 専門的な科学論文でのみ見られる。","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"「**autonitridation**」は、材料科学や化学の分野で使われる専門用語で、ある物質が外部から窒素源を加えなくても、高温下で自身の構成元素から窒素を取り込んで窒化物へと変化する現象を指します。このプロセスは、特に窒化ケイ素などのセラミックス材料の合成に利用されます。この用語を理解するには、\"nitridation\"（窒化）というプロセスと、\"auto-\"（自己）という接頭辞の意味を知っておく必要があります。専門的な論文や技術文書でのみ使用されるため、一般的な英語学習者には馴染みのない単語です。"},"example_sentences":[{"sentence":"The autonitridation of silicon results in the formation of a hard, wear-resistant ceramic.","translation":"シリコンの自己窒化は、硬くて耐摩耗性のセラミックスの形成をもたらす。","type":"noun","meaning_category":"自己窒化プロセス"},{"sentence":"The kinetics of autonitridation are highly dependent on temperature and pressure.","translation":"自己窒化の反応速度は、温度と圧力に大きく依存する。","type":"noun","meaning_category":"自己窒化プロセス"},{"sentence":"Autonitridation offers a cost-effective route for the synthesis of certain nitride ceramics.","translation":"自己窒化は、特定の窒化物セラミックスの合成のための費用対効果の高い経路を提供する。","type":"noun","meaning_category":"自己窒化プロセス"}]}