{"word":"hexone","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(有機化学) ヘキソン：リシン、アルギニン、ヒスチジンなどの塩基性アミノ酸に含まれる共通構造。また、それらを含むタンパク質またはタンパク質分解生成物を指すこともある。","english_definition":"(organic chemistry) A common structure found in basic amino acids such as lysine, arginine, and histidine; also, a protein or protein decomposition product containing them.","examples":[{"sentence":"The hexone bases are important components of many proteins.","translation":"ヘキソン塩基は多くのタンパク質の重要な構成要素です。"},{"sentence":"Hexone is produced during the breakdown of proteins containing lysine.","translation":"ヘキソンはリジンを含むタンパク質の分解中に生成されます。"}],"collocations":["hexone base","hexone fraction"],"synonyms":["amino acid derivative"],"antonyms":[]}],"etymology":{"value":"Derived from 'hex-' (referring to a six-carbon structure, though not always literally present) and '-one' (a suffix often used in organic chemistry for ketones and related compounds).","priority":"★★☆"},"pronunciation":{"ipa":"/ˈhɛksoʊn/","syllables":"hex-one"},"inflection":{"noun_plural":"hexones"},"usage_notes":{"explanation":"'Hexone' is a relatively specialized term used in biochemistry and organic chemistry, particularly when discussing the composition and breakdown products of proteins. It refers to a structural feature or a class of compounds rather than a specific molecule.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ Hexone is a type of sugar.","correct":"✓ Hexone is related to certain amino acids.","note":"Hexone is not a sugar; it's associated with amino acids. "},{"incorrect":"✗ All proteins contain hexone.","correct":"✓ Only proteins containing specific amino acids (like lysine, arginine, histidine) yield hexone.","note":"Not all proteins contain the amino acids that produce hexone."}],"priority":"★★☆"},"related_words":{"derivatives":[],"phrasal_verbs":[],"related_terms":["lysine","arginine","histidine","amino acid","protein","peptide"]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency - Specialized scientific term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Hexone' is a technical term primarily used in biochemistry and organic chemistry. It describes a structural component found in specific amino acids, especially lysine, arginine, and histidine. Understanding this term requires a background in chemistry, particularly knowledge of amino acid structures and protein composition. It is not a commonly used word outside of scientific contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The analysis revealed a high concentration of hexone in the sample.","translation":"分析により、サンプル中に高濃度のヘキソンが検出された。","type":"noun","meaning_category":"chemical compound"},{"sentence":"During protein hydrolysis, hexone bases are released.","translation":"タンパク質加水分解中には、ヘキソン塩基が放出される。","type":"noun","meaning_category":"chemical compound"}]}