{"word":"heterodoxize","priority":"low","meanings":[{"part_of_speech":"verb","transitivity":"intransitive","definition":"To deviate from or express opinions contrary to established or orthodox doctrines or beliefs.","english_definition":"To hold or express opinions that are different from or contrary to the officially accepted or established doctrines or beliefs.","examples":[{"sentence":"He began to heterodoxize on matters of religious doctrine.","translation":"彼は宗教教義の問題について異説を唱え始めた。"},{"sentence":"Some scholars heterodoxize regarding traditional interpretations of the text.","translation":"一部の学者は、テキストの伝統的な解釈に関して異説を唱える。"}],"collocations":["heterodoxize on","heterodoxize about"],"synonyms":["deviate","dissent","nonconform","challenge","question"],"antonyms":["conform","adhere","orthodoxize"]}],"etymology":{"value":"From 'heterodox' (holding unorthodox opinions) + '-ize' (a suffix used to form verbs indicating to make or become).","priority":"medium"},"pronunciation":{"ipa":"/ˌhɛtərəˈdɒksaɪz/","syllables":"het-er-o-dox-ize"},"inflection":{"verb_forms":{"present_simple":["heterodoxize","heterodoxizes"],"past_simple":"heterodoxized","past_participle":"heterodoxized","present_participle":"heterodoxizing"}},"usage_notes":{"explanation":"'Heterodoxize' is a relatively rare verb that describes the act of holding or expressing unorthodox or dissenting opinions, especially in the context of religion, politics, or philosophy. It implies a conscious departure from established norms or beliefs.","priority":"medium"},"common_mistakes":{"examples":[{"incorrect":"He heterodoxized the religion.","correct":"He heterodoxized on the religion.","note":"'Heterodoxize' is usually intransitive, meaning it doesn't take a direct object. Use 'on' or 'about' to indicate the subject being questioned."}],"priority":"low"},"related_words":{"derivatives":["heterodoxy (noun): unorthodox beliefs or opinions","heterodox (adjective): holding unorthodox beliefs or opinions"],"priority":"medium"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Very low frequency","priority":"low"},"readability_explanation":{"level":"C2","text":"'Heterodoxize' is a sophisticated term used to describe the act of diverging from established or orthodox beliefs. It is typically found in academic or philosophical contexts when discussing challenges to conventional thought. Understanding this word requires a strong grasp of abstract concepts and a familiarity with intellectual discourse."},"example_sentences":[{"sentence":"As he studied the ancient texts, he began to heterodoxize about the accepted interpretations.","translation":"古代のテキストを研究するにつれて、彼は受け入れられている解釈について異説を唱え始めた。","type":"verb","meaning_category":"deviate from orthodox beliefs"},{"sentence":"She chose to heterodoxize, openly questioning the party's long-held principles.","translation":"彼女はあえて異説を唱え、党の長年の原則を公然と疑問視した。","type":"verb","meaning_category":"express contrary opinions"}]}