{"word":"nonsporulating","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"(主に微生物学で)芽胞を形成しない、非胞子形成性の","english_definition":"(primarily in microbiology) not forming spores; incapable of sporulation.","examples":[{"sentence":"The bacteria were identified as nonsporulating gram-positive rods.","translation":"その細菌は、芽胞を形成しないグラム陽性桿菌として同定された。"},{"sentence":"Nonsporulating strains are often less resistant to environmental stressors.","translation":"芽胞を形成しない菌株は、環境ストレスに対する抵抗性が低いことが多い。"}],"collocations":["nonsporulating bacteria","nonsporulating yeast","nonsporulating fungi"],"synonyms":["asporogenous","asporogenic"],"antonyms":["sporulating","spore-forming"]},{"part_of_speech":"adjective","definition":"(より一般的に)胞子を形成しない","english_definition":"(more generally) not producing spores.","examples":[{"sentence":"This type of algae is nonsporulating under these conditions.","translation":"この種の藻類は、この条件下では胞子を形成しない。"}],"collocations":["nonsporulating algae","nonsporulating mold"],"synonyms":["asporous"],"antonyms":["sporiferous","sporogenous"]}],"etymology":{"value":"\"non-\" (否定) + \"sporulating\" (胞子形成).","priority":"Medium"},"pronunciation":{"ipa":"/ˌnɒnˈspɔːrjuˌleɪtɪŋ/","syllables":"non-spor-u-lat-ing"},"inflection":{"notes":"Adjective, no plural form."},"usage_notes":{"explanation":"The term \"nonsporulating\" is primarily used in microbiology to describe microorganisms that do not produce spores. Spores are dormant, highly resistant structures that allow bacteria, fungi, and other microorganisms to survive harsh environmental conditions. Nonsporulating organisms are generally less resistant to heat, desiccation, radiation, and disinfectants. The term can also be used more generally to describe any organism that does not produce spores.","priority":"High"},"common_mistakes":{"examples":[{"incorrect":"The non-sporulating bacteria was heat resistant.","correct":"The nonsporulating bacteria were not heat resistant.","note":"Nonsporulating bacteria are generally less heat resistant than sporulating bacteria."}],"priority":"Medium"},"related_words":{"derivatives":["sporulate (verb)","sporulation (noun)","spore (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low","priority":"Low"},"readability_explanation":{"level":"C1","text":"The word \"nonsporulating\" is a technical term primarily used in scientific contexts, particularly in microbiology. It describes organisms that do not produce spores, which are resistant structures that allow microorganisms to survive harsh conditions. Understanding this term requires familiarity with basic microbiology concepts. The prefix \"non-\" indicates negation, and \"sporulating\" refers to the process of forming spores. Therefore, \"nonsporulating\" simply means \"not forming spores.\""},"example_sentences":[{"sentence":"The effectiveness of the disinfectant was tested on both sporulating and nonsporulating bacteria.","translation":"その消毒剤の有効性は、芽胞を形成する細菌と芽胞を形成しない細菌の両方で試験された。","type":"adjective","meaning_category":"Microbiology"},{"sentence":"Identification of the nonsporulating bacteria required specialized staining techniques.","translation":"芽胞を形成しない細菌の同定には、特殊な染色技術が必要だった。","type":"adjective","meaning_category":"Microbiology"}]}