{"word":"gregaritic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"群生性の、集団生活をする","english_definition":"(of animals, especially insects) living in groups or colonies; social.","examples":[{"sentence":"Locusts are known for their gregaritic behavior, forming massive swarms that can devastate crops.","translation":"イナゴは群生行動で知られており、作物を荒廃させる大規模な群れを形成します。"},{"sentence":"The gregaritic phase of the insect is characterized by increased activity and reproduction.","translation":"その昆虫の群生期は、活動と繁殖の増加によって特徴づけられます。"}],"collocations":["gregaritic behavior","gregaritic phase","gregaritic insects"],"synonyms":["social","communal","flocking","herding"],"antonyms":["solitary","individual","isolated"]}],"etymology":{"value":"Derived from the Latin word \"gregarius,\" meaning \"belonging to a flock or herd,\" which in turn comes from \"grex\" (flock, herd).","priority":"★★★"},"pronunciation":{"ipa":"/ˌɡrɛɡəˈrɪtɪk/","syllables":"gre-gar-i-tic"},"inflection":{},"usage_notes":{"explanation":"The term \"gregaritic\" is most often used in biology and entomology to describe animals, especially insects, that exhibit a tendency to live in groups or colonies. It often implies a change in behavior or morphology when the animal transitions from a solitary to a social phase.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The hermit was a gregaritic person.","correct":"✓ The hermit was an antisocial person.","note":"Hermits, by definition, are solitary and avoid social interaction, so they cannot be described as gregaritic."}],"priority":"★☆☆"},"related_words":{"derivatives":["gregariously (adverb)","gregariousness (noun)","gregarian (adjective, less common)"],"priority":"★★☆"},"level_frequency":{"frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Gregaritic\" is a specialized term used in biology to describe animals, particularly insects, that live in groups. It's not a commonly used word in everyday language. Understanding its meaning is helpful in the context of scientific or zoological discussions.","priority":"★★☆"},"example_sentences":[{"sentence":"The caterpillars exhibit gregaritic feeding behavior, consuming entire plants together.","translation":"その毛虫は群生的な摂食行動を示し、植物全体を一緒に消費します。","type":"general","meaning_category":"群生性の"},{"sentence":"During the gregaritic phase, the locusts undergo physiological changes that prepare them for long-distance migration.","translation":"群生期の間、イナゴは長距離移動に備えるための生理学的変化を起こします。","type":"general","meaning_category":"集団生活をする"}]}