{"word":"embryogenic","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"胚発生能のある、胚形成性の","english_definition":"Capable of or relating to embryogenesis (the process by which an embryo develops).","examples":[{"sentence":"The embryogenic callus was used for plant regeneration.","translation":"その胚発生能のあるカルスは、植物の再生に用いられた。"},{"sentence":"Embryogenic cells are essential for somatic embryogenesis.","translation":"胚形成性の細胞は、体細胞胚形成に不可欠である。"}],"collocations":["embryogenic callus","embryogenic cell","embryogenic potential","somatic embryogenesis"],"synonyms":["totipotent","pluripotent"],"antonyms":["differentiated"],"notes":"Often used in the context of plant tissue culture and developmental biology."}],"etymology":{"value":"Derived from 'embryo' (from Greek 'embryon' meaning 'unborn fetus') + '-genic' (from Greek 'genos' meaning 'birth, origin, kind').","priority":"★★☆"},"pronunciation":{"ipa":"ˌembrɪoʊˈdʒɛnɪk/","syllables":"em-bry-o-gen-ic"},"inflection":{"adjective_forms":{"comparative":"more embryogenic","superlative":"most embryogenic"}},"usage_notes":{"explanation":"'Embryogenic' describes cells or tissues that have the ability to form an embryo. This term is frequently encountered in plant biotechnology when discussing the regeneration of plants from cell cultures. It implies a high degree of developmental plasticity.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The embryological callus...","correct":"✓ The embryogenic callus...","note":"'Embryological' refers to the study of embryos, while 'embryogenic' refers to the ability to form embryos. Use the correct term based on the context."}],"priority":"★☆☆"},"related_words":{"derivatives":["embryogenesis (noun: the formation and development of an embryo)","embryo (noun: an unborn or unhatched offspring in the process of development)"],"priority":"★★☆"},"level_frequency":{"level":"C2","frequency_google_ngram":"Low frequency - specialized term used in biology.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Embryogenic' is a specialized term primarily used in biology, particularly in the fields of developmental biology and plant tissue culture. It describes cells or tissues that possess the capacity to undergo embryogenesis, the process of forming an embryo. Understanding this term requires familiarity with basic biological concepts related to development and cell differentiation."},"example_sentences":[{"sentence":"The researchers identified several embryogenic cell lines.","translation":"研究者らは、いくつかの胚発生能のある細胞株を特定した。","type":"general","meaning_category":"general"},{"sentence":"Somatic embryogenesis relies on the use of embryogenic cultures.","translation":"体細胞胚形成は、胚形成性の培養の使用に依存している。","type":"technical","meaning_category":"technical"}]}