{"word":"subdelegated","priority":"☆☆☆","meanings":[{"part_of_speech":"verb","transitivity":"vt","definition":"(権限・任務など)を再委任する、下位委任する","english_definition":"To delegate further; to delegate a task or responsibility that one has already been delegated to someone else.","examples":[{"sentence":"The manager subdelegated the task to a junior employee.","translation":"マネージャーはそのタスクを部下の従業員に再委任した。"},{"sentence":"She was subdelegated the responsibility of overseeing the project.","translation":"彼女はそのプロジェクトを監督する責任を再委任された。"}],"collocations":["subdelegate authority","subdelegate responsibility","subdelegate a task"],"synonyms":["redelegate","transfer","assign"],"antonyms":["retain","keep","hold"]}],"etymology":{"value":"The word 'subdelegated' is formed from the prefix 'sub-' meaning 'under' or 'further,' combined with the past participle of the verb 'delegate,' which means to entrust a task or responsibility to another person.","priority":"★★☆"},"pronunciation":{"ipa":"/ˌsʌbˈdɛlɪɡeɪtɪd/","syllables":"sub-del-e-gat-ed"},"inflection":{"verb_forms":{"present_simple":["subdelegate","subdelegates"],"past_simple":"subdelegated","past_participle":"subdelegated","present_participle":"subdelegating"}},"usage_notes":{"explanation":"'Subdelegated' refers to the act of passing on a responsibility or authority that one has already received from someone else. It implies a chain of delegation, where the original authority is passed down through multiple levels. It is often used in organizational contexts, such as in business or government.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He subdelegated the work for his assistant.","correct":"✓ He subdelegated the work to his assistant.","note":"The correct preposition to use with 'subdelegate' is 'to,' indicating the person or entity to whom the task or responsibility is being passed. Using 'for' is incorrect."},{"incorrect":"✗ She subdelegated the responsibility, but she didn't oversee it.","correct":"✓ She subdelegated the responsibility, but she still oversaw it.","note":"When subdelegating, it is still important to ensure that the task is completed correctly. Therefore, it is important to oversee the task even after it has been subdelegated."}],"priority":"★☆☆"},"related_words":{"derivatives":["subdelegation (noun)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The word 'subdelegated' is a relatively uncommon term, primarily used in formal or professional contexts. It describes the act of passing on a responsibility or authority that one has already received from someone else. Understanding this word requires a good grasp of the concept of delegation and the prefix 'sub-,' which indicates a further level of delegation. It is most often encountered in legal, business, or governmental documents where the distribution of authority is explicitly defined."},"example_sentences":[{"sentence":"The CEO subdelegated the project management to the vice president.","translation":"CEOはプロジェクト管理を副社長に再委任した。","type":"verb","meaning_category":"再委任する"},{"sentence":"Having too many layers of subdelegated authority can lead to confusion.","translation":"再委任された権限の階層が多すぎると、混乱を招く可能性がある。","type":"verb","meaning_category":"再委任する"},{"sentence":"The committee subdelegated the task of reviewing applications to a smaller subcommittee.","translation":"委員会は、申請書の審査作業をより小さな小委員会に再委任した。","type":"verb","meaning_category":"再委任する"}]}