{"word":"Cocceian","priority":"☆☆☆","meanings":[{"part_of_speech":"adjective","definition":"コクケイウス家（古代ローマの貴族の家系）に関連する、またはコクケイウス家に特徴的な","english_definition":"Relating to or characteristic of the Cocceii, an ancient Roman noble family.","examples":[{"sentence":"The Cocceian family was known for its influence in Roman politics.","translation":"コクケイウス家はローマ政治における影響力で知られていた。"},{"sentence":"The Cocceian style of architecture is evident in several buildings of the era.","translation":"コクケイウス様式の建築は、その時代のいくつかの建物に見られる。"}],"collocations":["Cocceian family","Cocceian architecture","Cocceian influence"],"synonyms":["Nerva-Antonine","Roman"],"antonyms":[]}],"etymology":{"value":"From the Latin 'Cocceius', the family name, plus the adjectival suffix '-an'.","priority":"★★★"},"pronunciation":{"ipa":"/kɒkˈsiːən/","syllables":"Coc-cei-an"},"inflection":{"notes":"Adjective, so it has comparative (more Cocceian) and superlative (most Cocceian) forms, though they are rarely used."},"usage_notes":{"explanation":"'Cocceian' is a relatively rare adjective used in historical or academic contexts to refer to something related to the Cocceii family. It is most often encountered in discussions of Roman history, genealogy, or architecture.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ He was a Cocceian emperor.","correct":"✓ He was an emperor from the Cocceian family.","note":"'Cocceian' describes association, not direct membership. Emperors were not *Cocceian*, but could be related to the family."}],"priority":"★☆☆"},"related_words":{"derivatives":["Cocceius (noun: the family name)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"The word 'Cocceian' is highly specialized and rarely encountered outside of academic or historical contexts. Understanding requires familiarity with Roman history and aristocratic families. Usage is limited to describing things associated with the Cocceii family."},"example_sentences":[{"sentence":"The Cocceian bridge was an engineering marvel of its time.","translation":"コクケイウス橋は当時の工学的な驚異だった。","type":"adjective","meaning_category":"Relating to the Cocceii family"},{"sentence":"The senator's Cocceian roots gave him considerable social standing.","translation":"その元老院議員のコクケイウス家のルーツは、彼にかなりの社会的地位を与えた。","type":"adjective","meaning_category":"Relating to the Cocceii family"}]}