{"word":"marcasite","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"白鉄鉱 (黄鉄鉱と同質異像の鉱物)","english_definition":"a mineral, iron disulfide, FeS₂, with the same composition as pyrite but an orthorhombic crystal structure.","examples":[{"sentence":"Marcasite is often found in sedimentary rocks.","translation":"白鉄鉱はしばしば堆積岩中に見られる。"},{"sentence":"The crystal structure of marcasite differs from that of pyrite.","translation":"白鉄鉱の結晶構造は黄鉄鉱のそれとは異なる。"}],"collocations":["found in sedimentary rocks","crystal structure","iron sulfide"],"synonyms":["white iron pyrite","iron pyrite (sometimes used loosely, but pyrite is a distinct mineral)"],"antonyms":[]}],"etymology":{"value":"中世ラテン語の *marcasita* に由来し、アラビア語またはペルシア語起源である可能性がある。元々は黄鉄鉱や他の硫化鉄鉱物を指す一般的な用語だった。","priority":"★☆☆"},"pronunciation":{"ipa":"ˈmɑːrkəˌsaɪt","syllables":"mar-ca-site"},"inflection":{"noun_plural":"marcasites"},"usage_notes":{"explanation":"Marcasite is a polymorph of pyrite, meaning they have the same chemical formula (FeS₂) but different crystal structures. Marcasite is less stable than pyrite and more susceptible to decomposition, especially in humid conditions. It is sometimes used in jewelry, though less commonly than pyrite, and is often misidentified as pyrite.","priority":"★☆☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The jewelry was made of pyrite, but it was labeled marcasite.","correct":"✓ The jewelry was made of marcasite, but it was labeled pyrite.","note":"Marcasite is often mistaken for pyrite, so ensure correct identification."}],"priority":"★☆☆"},"related_words":{"derivatives":[],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Very low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"Marcasite is a relatively uncommon mineralogical term. Understanding requires knowledge of mineralogy and crystallography. The distinction between marcasite and pyrite is important for accurate identification in geological and gemological contexts."},"example_sentences":[{"sentence":"The museum displayed a sample of **marcasite** with a distinctive radiating structure.","translation":"博物館は特徴的な放射状構造を持つ白鉄鉱の標本を展示していた。","type":"noun","meaning_category":"mineral"},{"sentence":"**Marcasite** jewelry requires special care to prevent decomposition.","translation":"白鉄鉱のジュエリーは分解を防ぐために特別な手入れが必要です。","type":"noun","meaning_category":"mineral"}]}