{"word":"metastable","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"準安定の、メタ安定の","english_definition":"(of a state of a system) apparently stable but liable to change suddenly to a more stable state.","examples":[{"sentence":"The compound exists in a metastable state at room temperature.","translation":"その化合物は室温で準安定状態で存在する。"},{"sentence":"A metastable atom can store energy for a relatively long time.","translation":"準安定原子は比較的長い間エネルギーを蓄えることができる。"},{"sentence":"The system is in a metastable equilibrium.","translation":"その系は準安定平衡状態にある。"}],"collocations":["metastable state","metastable equilibrium","metastable atom","metastable phase"],"synonyms":["unstable","conditionally stable","marginally stable"],"antonyms":["stable","equilibrium"]},{"part_of_speech":"noun","definition":"準安定状態","english_definition":"a metastable state.","examples":[{"sentence":"The system can exist in a metastable for a long time.","translation":"その系は準安定状態で長時間存在できる。"}],"collocations":[],"synonyms":[],"antonyms":[]}],"etymology":{"value":"'Meta-' (beyond) + 'stable'. Indicates a state that appears stable but is not at the lowest energy level and can transition to a more stable state.","priority":"★★★"},"pronunciation":{"ipa":"/ˌmetəˈsteɪbəl/","syllables":"met-a-sta-ble"},"inflection":{"notes":"Adjective: metastable. Noun: metastability (the state of being metastable)."},"usage_notes":{"explanation":"'Metastable' describes a state that appears stable but is not at the lowest energy level. It can transition to a more stable state given the right conditions (e.g., a small perturbation or sufficient energy). This term is commonly used in physics, chemistry, and materials science.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The element is very metastable, so it's always changing.","correct":"✓ The element is metastable, so it can change to a more stable state under certain conditions.","note":"'Metastable' doesn't mean 'always changing,' but rather 'capable of changing under certain conditions.'"}],"priority":"★★☆"},"related_words":{"derivatives":["metastability (noun): the state of being metastable"],"related_terms":["stable","unstable","equilibrium","phase transition","supercooled","superheated"],"priority":"★★★"},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency (specialized scientific vocabulary)","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Metastable' is a technical term used in science, particularly in physics and chemistry. It describes a condition that seems stable but is actually prone to change to a more stable condition if disturbed. Think of it like a ball resting in a small dip on a hillside; it looks stable, but a small push will send it rolling down to a more stable position at the bottom of the hill. Understanding this term requires some background knowledge in science.","priority":"★★☆"},"example_sentences":[{"sentence":"The diamond is a metastable form of carbon under normal conditions.","translation":"ダイヤモンドは通常の条件下では準安定な炭素の形態である。","type":"adjective","meaning_category":"describing a state"},{"sentence":"The system is trapped in a metastable minimum.","translation":"その系は準安定極小に閉じ込められている。","type":"adjective","meaning_category":"describing a state"},{"sentence":"Metastable states are important in many chemical reactions.","translation":"準安定状態は多くの化学反応において重要である。","type":"adjective","meaning_category":"describing a state"}]}