{"word":"Tunnage","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"トン数、容積トン数、トン税","english_definition":"The carrying capacity of a ship, measured in tons; a tax levied per ton of a ship's capacity.","examples":[{"sentence":"The ship's tunnage was recorded at 5000 tons.","translation":"その船のトン数は5000トンと記録された。"},{"sentence":"The tunnage tax was a significant source of revenue for the port.","translation":"トン税は港にとって重要な収入源だった。"}],"collocations":["gross tunnage","net tunnage","register tunnage"],"synonyms":["tonnage","capacity","burden","measurement"],"antonyms":[]}],"etymology":{"value":"Derived from 'tun', a large cask for wine, and '-age', indicating a charge or measurement related to the capacity of such casks. Originally referred to the capacity of a ship measured by how many tuns of wine it could carry.","priority":"★★☆"},"pronunciation":{"ipa":"ˈtʌnɪdʒ","syllables":"tun-nage"},"inflection":{"noun_plural":"tunnages"},"usage_notes":{"explanation":"'Tunnage' specifically refers to a ship's carrying capacity or the tax associated with that capacity. While 'tonnage' is the more common term, 'tunnage' can be found in historical or legal contexts. It is less frequently used in modern maritime discussions.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ The tunnage of the bridge was impressive.","correct":"✓ The size of the bridge was impressive.","note":"'Tunnage' is specific to ships and their carrying capacity, not general structures like bridges."},{"incorrect":"✗ He paid the tunnage for his car.","correct":"✓ He paid the toll for his car.","note":"'Tunnage' refers to ships, not cars. Cars pay tolls, not tunnage."}],"priority":"★★☆"},"related_words":{"derivatives":["tun (noun: a large cask or barrel)"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"C2","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Tunnage' is a specialized term primarily used in maritime or historical contexts to describe a ship's carrying capacity or a tax based on that capacity. Due to its limited usage and specific domain, it is considered an advanced vocabulary word. It is important to distinguish it from the more common term 'tonnage', although they are often used interchangeably. Understanding the historical context related to the measurement of ships by the number of 'tuns' (large casks) they could carry is helpful for grasping the term's origin and meaning."},"example_sentences":[{"sentence":"The ship's tunnage determined the fees it had to pay at the port.","translation":"その船のトン数によって、港で支払うべき料金が決まった。","type":"general","meaning_category":"carrying capacity"},{"sentence":"Historical records indicate a significant increase in tunnage entering the harbor during that period.","translation":"歴史的記録は、その期間中に港に入るトン数が大幅に増加したことを示している。","type":"historical","meaning_category":"carrying capacity"},{"sentence":"The tunnage dues were a point of contention between the merchants and the local government.","translation":"トン税は商人たちと地方政府との間の争点だった。","type":"economic","meaning_category":"tax"}]}