{"word":"submissive-eyed","priority":"Low","meanings":[{"part_of_speech":"adjective","definition":"Having or characterized by a submissive expression in the eyes.","english_definition":"Having eyes that express or suggest a willingness to submit to the will or authority of another.","examples":[{"sentence":"The character was portrayed as a meek, submissive-eyed servant.","translation":"そのキャラクターは、従順そうな目をしたおとなしい召使いとして描かれていた。"},{"sentence":"She gave him a submissive-eyed glance, indicating her agreement.","translation":"彼女は従順そうな目で彼を見て、同意を示した。"}],"collocations":["submissive-eyed gaze","submissive-eyed look","a submissive-eyed expression"],"synonyms":["meek-eyed","compliant-eyed","yielding-eyed","docile-eyed"],"antonyms":["assertive-eyed","dominant-eyed","defiant-eyed","rebellious-eyed"]}],"etymology":{"value":"Combination of 'submissive' (willing to submit) and 'eyed' (having eyes of a certain kind).","priority":"Medium"},"pronunciation":{"ipa":"/səbˈmɪsɪv aɪd/","syllables":"sub-miss-ive-eyed"},"inflection":{"notes":"Adjective, does not inflect for number or gender."},"usage_notes":{"explanation":"This adjective is typically used to describe someone whose eyes convey a sense of obedience, humility, or willingness to follow instructions or commands. It can be used in literature or descriptive writing to characterize a person's demeanor or personality.","priority":"Medium"},"common_mistakes":{"examples":[{"incorrect":"✗ He was submissive eyed.","correct":"✓ He was submissive-eyed.","note":"The hyphen is important to connect the two words and form a compound adjective."}],"priority":"Low"},"related_words":{"derivatives":["submissive (adjective)","submission (noun)"],"related_terms":["obeisant","deferential","servile","acquiescent"]},"level_frequency":{"frequency_google_ngram":"Low frequency - not a common term, primarily found in descriptive or literary contexts.","priority":"Low"},"readability_explanation":{"level":"C1","text":"The term 'submissive-eyed' is a compound adjective used to describe someone whose eyes convey a sense of submission or willingness to obey. It's not a commonly used term and is more likely to be found in descriptive writing or literature. Understanding requires knowledge of the word 'submissive' and the ability to understand compound adjectives."},"example_sentences":[{"sentence":"The abused dog cowered, giving its owner a submissive-eyed look.","translation":"虐待された犬は身をすくめ、飼い主に従順そうな目を向けた。","type":"adjective","meaning_category":"Descriptive"},{"sentence":"In the painting, the artist depicted the character with a submissive-eyed expression, highlighting their lack of power.","translation":"絵の中で、画家はキャラクターを従順そうな目で描き、彼らの力のなさを強調した。","type":"adjective","meaning_category":"Descriptive"},{"sentence":"The young intern, eager to please, offered a submissive-eyed reply to every instruction.","translation":"熱心な若いインターンは、喜んで従おうと、すべての指示に対して従順そうな目で返事をした。","type":"adjective","meaning_category":"Descriptive"}]}