{"word":"Loranthus","priority":"★☆☆","meanings":[{"part_of_speech":"noun","definition":"オニノヤドリギ属","english_definition":"A genus of parasitic plants in the family Loranthaceae, commonly known as loranthuses.","examples":[{"sentence":"Loranthus species are hemiparasites that grow on the branches of trees.","translation":"オニノヤドリギ属の種は、木の枝に寄生する半寄生植物です。"}],"collocations":["Loranthus parasiticus","Loranthus europaeus"],"synonyms":["mistletoe (general term for similar parasitic plants)"],"antonyms":[]}],"etymology":{"value":"Derived from the Greek words 'loron' (strap, thong) and 'anthos' (flower), referring to the strap-like petals of some species.","priority":"★★☆"},"pronunciation":{"ipa":"/lɒˈrænθəs/","syllables":"Lo-ran-thus"},"inflection":{"noun_plural":"Loranthuses"},"usage_notes":{"explanation":"Loranthus is a scientific term referring to a specific genus of parasitic plants. It is not commonly used in everyday conversation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I saw a loranthus on my oak tree, it's a beautiful flower.","correct":"✓ I saw a mistletoe on my oak tree, it's a beautiful flower.","note":"Use 'mistletoe' as a more general and common term unless specifically referring to the Loranthus genus."}],"priority":"★☆☆"},"related_words":{"derivatives":["Loranthaceae (family name)"],"phrasal_verbs":[],"priority":"★☆☆"},"level_frequency":{"CEFR":"N/A (scientific term)","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"'Loranthus' is a botanical term used to refer to a specific genus of parasitic plants. Due to its specialized nature, it is primarily encountered in scientific or academic contexts related to botany and ecology. Understanding of this term requires familiarity with plant taxonomy and parasitic plant biology."},"example_sentences":[{"sentence":"The distribution of Loranthus species is influenced by the availability of suitable host trees.","translation":"オニノヤドリギ属の種の分布は、適切な宿主となる木の利用可能性に影響されます。","type":"noun","meaning_category":"オニノヤドリギ属"},{"sentence":"Studies have investigated the chemical compounds found in Loranthus parasiticus for potential medicinal uses.","translation":"オニノヤドリギ（Loranthus parasiticus）に含まれる化学化合物について、潜在的な薬効に関する研究が行われています。","type":"noun","meaning_category":"オニノヤドリギ属"}]}