{"word":"colletarium","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"(rare) A place for keeping or displaying collections; a museum or cabinet of curiosities.","english_definition":"A place for keeping or displaying collections; a museum or cabinet of curiosities.","examples":[{"sentence":"The old manor house had been transformed into a colletarium, filled with strange and wonderful artifacts.","translation":"その古い荘園の家は、奇妙で素晴らしい人工物で満たされたコレタリュームに変わっていました。"}],"collocations":["private colletarium","transform into a colletarium"],"synonyms":["museum","cabinet of curiosities","collection"],"antonyms":[]}],"etymology":{"value":"Derived from the Latin word \"collectio\" (collection) with the suffix \"-arium\" (a place for).","priority":"★★☆"},"pronunciation":{"ipa":"/kɒlɪˈteəriəm/","syllables":"col-le-tar-i-um"},"inflection":{"noun_plural":"colletariums"},"usage_notes":{"explanation":"\"Colletarium\" is a relatively rare word, primarily used to describe a place dedicated to housing and exhibiting collections of items, often with a focus on curiosities or artifacts. It is similar in meaning to \"museum\" or \"cabinet of curiosities\" but carries a more specialized or archaic connotation.","priority":"★★☆"},"common_mistakes":{"examples":[{"incorrect":"✗ I visited the colletarium yesterday, it was full of art.","correct":"✓ I visited the colletarium yesterday, it was full of curiosities.","note":"While a colletarium can contain art, it typically implies a collection of unusual or curious items rather than fine art."}],"priority":"★★☆"},"related_words":{"derivatives":["collection","collector"]},"level_frequency":{"frequency_google_ngram":"Very Low Frequency","priority":"★☆☆"},"readability_explanation":{"level":"C2","text":"\"Colletarium\" is a rare and sophisticated word used to describe a place for keeping or displaying collections, similar to a museum or cabinet of curiosities. The word is derived from Latin and is not commonly used in everyday conversation. Understanding its meaning requires a strong vocabulary and familiarity with historical collections."},"example_sentences":[{"sentence":"The eccentric millionaire built a private colletarium to house his extensive collection of rare books and manuscripts.","translation":"その風変わりな大富豪は、彼の膨大な希少本と原稿のコレクションを収容するために、私的なコレタリュームを建設しました。","type":"noun","meaning_category":"place for collections"},{"sentence":"The university's colletarium showcased a diverse array of scientific instruments and natural history specimens.","translation":"大学のコレタリュームには、科学機器と自然史標本の多様な配列が展示されていました。","type":"noun","meaning_category":"place for collections"}]}