{"word":"alliteration","priority":"★★☆","meanings":[{"part_of_speech":"noun","definition":"頭韻、頭韻法","english_definition":"The occurrence of the same letter or sound at the beginning of adjacent or closely connected words.","examples":[{"sentence":"'She sells sea shells by the sea shore' is an example of alliteration.","translation":"「彼女は海岸で貝殻を売る」は頭韻の例です。"},{"sentence":"The poem uses alliteration to create a musical effect.","translation":"その詩は音楽的な効果を生み出すために頭韻を使用しています。"},{"sentence":"The phrase 'Peter Piper picked a peck of pickled peppers' is a classic example of alliteration.","translation":"「ピーター・パイパーはピクルスにしたピーマンをたくさん摘んだ」は頭韻の典型的な例です。"}],"collocations":["use alliteration","example of alliteration","poetic alliteration","create alliteration","literary alliteration"],"synonyms":["head rhyme","initial rhyme","repetition of sounds"],"antonyms":[]}],"etymology":{"value":"Derived from Latin 'ad litteram' meaning 'to the letter'. It was re-Latinized in the 16th century from the earlier English term 'letter rhyme'.","priority":"★★★"},"pronunciation":{"ipa":"/əˌlɪtəˈreɪʃən/","syllables":"al-lit-er-a-tion"},"inflection":{"noun_plural":"alliterations"},"usage_notes":{"explanation":"Alliteration is a literary device where the same consonant sound is repeated at the beginning of words in a phrase or sentence. It is often used in poetry, advertising, and tongue twisters to create a memorable or pleasing effect. The repeated sounds draw attention to the phrase and can enhance its rhythm and impact.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ The poem has a lot of assonance, like alliteration.","correct":"✓ The poem has a lot of alliteration, with repeated consonant sounds.","note":"Alliteration involves the repetition of initial consonant sounds, whereas assonance involves the repetition of vowel sounds. They are different literary devices."},{"incorrect":"✗ Alliteration is only used in poems.","correct":"✓ Alliteration is used in poems, advertisements, and everyday speech.","note":"While common in poetry, alliteration is also used in other forms of writing and speech to make phrases more memorable or impactful."}],"priority":"★★☆"},"related_words":{"derivatives":["alliterative (adjective)"],"phrasal_verbs":[],"related_terms":["assonance","consonance","rhyme","literary device","figure of speech"],"priority":"★★☆"},"level_frequency":{"CEFR":"C1","frequency_google_ngram":"Relatively low frequency but recognized in literary contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"'Alliteration' is a literary term referring to the repetition of the same consonant sound at the beginning of words in a phrase or sentence. It's used to create a musical effect or to make a phrase more memorable. You'll often find it in poetry, tongue twisters, and advertising. Understanding this term helps in analyzing and appreciating literary texts and creative writing.","priority":"★★☆"},"example_sentences":[{"sentence":"The **alliteration** in the tongue twister made it difficult to say quickly.","translation":"その早口言葉の頭韻は、それを素早く言うのを難しくしました。","type":"noun","meaning_category":"頭韻"},{"sentence":"The author used **alliteration** to emphasize certain words in the poem.","translation":"著者は詩の中で特定の言葉を強調するために頭韻を使用しました。","type":"noun","meaning_category":"頭韻"},{"sentence":"Many advertising slogans use **alliteration** to make them more memorable.","translation":"多くの広告スローガンは、より記憶に残るようにするために頭韻を使用しています。","type":"noun","meaning_category":"頭韻"},{"sentence":"The repeated 's' sound is an example of **alliteration**.","translation":"繰り返される「s」の音は頭韻の例です。","type":"noun","meaning_category":"頭韻"}]}