{"word":"ICL","priority":"☆☆☆","meanings":[{"part_of_speech":"noun","definition":"眼内コンタクトレンズ (Implantable Collamer Lens)","english_definition":"An implantable collamer lens, a type of phakic intraocular lens used in vision correction.","examples":[{"sentence":"My doctor recommended ICL surgery to correct my nearsightedness.","translation":"私の医者は、私の近視を矯正するためにICL手術を勧めました。"},{"sentence":"ICL offers a good alternative to LASIK for patients with thin corneas.","translation":"ICLは、角膜が薄い患者にとってLASIKの良い代替手段となります。"}],"collocations":["ICL surgery","ICL implantation","ICL lens"],"synonyms":["Implantable Contact Lens","Phakic IOL"],"antonyms":[]}],"etymology":{"value":"Abbreviation of Implantable Collamer Lens.","priority":"★★★"},"pronunciation":{"ipa":"/ˌaɪ siː ˈɛl/","syllables":"I-C-L (each letter pronounced separately)"},"inflection":{},"usage_notes":{"explanation":"ICL is an acronym, referring to a specific type of implantable lens used in refractive surgery. It's typically used in the context of vision correction, particularly for myopia (nearsightedness) and astigmatism.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ ICLs are a type of laser eye surgery.","correct":"✓ ICLs are a type of refractive surgery, but not laser eye surgery.","note":"ICL implantation is a type of refractive surgery, but it doesn't involve lasers like LASIK or PRK."}],"priority":"★★☆"},"related_words":{"derivatives":["myopia","hyperopia","astigmatism","refractive surgery","LASIK","PRK","intraocular lens","ophthalmology"],"phrasal_verbs":[]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency, primarily used in medical contexts.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"ICL stands for Implantable Collamer Lens. It's a type of lens that's surgically implanted into the eye to correct vision problems like nearsightedness (myopia) or astigmatism. Unlike LASIK, which reshapes the cornea, ICL involves inserting a lens without removing any corneal tissue. It's often considered for people who aren't good candidates for LASIK. The term is mainly used in medical and ophthalmological contexts.","priority":"★★☆"},"example_sentences":[{"sentence":"The patient underwent ICL implantation to improve their vision.","translation":"患者は視力改善のためにICL移植手術を受けた。","type":"noun","meaning_category":"眼内コンタクトレンズ"},{"sentence":"ICL surgery is a safe and effective way to correct high myopia.","translation":"ICL手術は、強度近視を矯正するための安全で効果的な方法です。","type":"noun","meaning_category":"眼内コンタクトレンズ"}]}