{"word":"Unarticled","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(法律)事務弁護士見習い期間を終えていない","english_definition":"Not having served articles of clerkship; not having completed the required period of training to become a solicitor.","examples":[{"sentence":"He is an unarticled clerk in a law firm.","translation":"彼は法律事務所で事務弁護士見習い期間を終えていない事務員です。"},{"sentence":"Unarticled graduates often find it difficult to secure employment.","translation":"事務弁護士見習い期間を終えていない卒業生は、就職が難しいことが多いです。"}],"collocations":["unarticled clerk","unarticled graduate"],"synonyms":["untrained","inexperienced","unqualified"],"antonyms":["articled","qualified","experienced"]}],"etymology":{"value":"The word \"unarticled\" is formed by adding the prefix \"un-\" (meaning 'not') to the word \"articled.\" The term \"articled\" refers to being bound by articles of clerkship, a formal agreement for legal training.","priority":"★★★"},"pronunciation":{"ipa":"/ʌnˈɑːrtɪkəld/","syllables":"un-ar-ti-cled"},"inflection":{"notes":"This word does not have different inflectional forms as it is an adjective."},"usage_notes":{"explanation":"The term \"unarticled\" is primarily used in legal contexts, specifically in countries that follow the British legal system (e.g., the UK, Canada, Australia). It describes someone who has not completed their articles of clerkship, which is a period of practical training required to qualify as a solicitor.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ He is an unarticled lawyer.","correct":"✓ He is an unarticled clerk.","note":"\"Lawyer\" is a general term. \"Unarticled\" specifically refers to the period before someone qualifies as a solicitor (in relevant legal systems), during which they are typically referred to as a clerk."}],"priority":"★★☆"},"related_words":{"derivatives":["article (noun, verb)","articled (adjective)","articles of clerkship (noun)"],"related_terms":["solicitor","barrister","clerk","trainee","legal profession"]},"level_frequency":{"CEFR":"N/A","frequency_google_ngram":"Low frequency","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"The term 'unarticled' is specific to the legal profession, particularly in jurisdictions following the British legal system. It indicates that a person has not completed the required training period (articles of clerkship) to become a fully qualified solicitor. Understanding this term requires familiarity with legal terminology and the structure of the legal profession in relevant countries."},"example_sentences":[{"sentence":"Many law graduates start as **unarticled** clerks to gain practical experience.","translation":"多くの法学部の卒業生は、実務経験を積むために事務弁護士見習い期間を終えていない事務員として働き始めます。","type":"adjective","meaning_category":"legal status"},{"sentence":"The **unarticled** trainee was eager to learn from the senior solicitors.","translation":"事務弁護士見習い期間を終えていない研修生は、ベテラン事務弁護士から熱心に学ぼうとしていました。","type":"adjective","meaning_category":"legal status"}]}