{"word":"Hypercomplex","priority":"★★☆","meanings":[{"part_of_speech":"adjective","definition":"(数学)複素数を拡張した数体系に関する、またはそれらを用いた","english_definition":"Relating to or using a number system that extends the complex numbers, such as quaternions or octonions.","examples":[{"sentence":"Hypercomplex numbers are used in various areas of physics and mathematics.","translation":"超複素数は、物理学や数学のさまざまな分野で使用されています。"},{"sentence":"Quaternions are a type of hypercomplex number.","translation":"四元数は、超複素数の一種です。"}],"collocations":["hypercomplex number","hypercomplex algebra","hypercomplex analysis"],"synonyms":["multicomplex","extended complex"],"antonyms":["real","complex"]}],"etymology":{"value":"\"Hyper-\" (above, beyond) + \"complex\", indicating an extension beyond the complex numbers.","priority":"★★★"},"pronunciation":{"ipa":"/ˌhaɪpərˈkɑːmpleks/","syllables":"hy-per-com-plex"},"inflection":{"notes":"Adjective, no standard inflection."},"usage_notes":{"explanation":"\"Hypercomplex\" refers to number systems that generalize complex numbers. Common examples include quaternions, octonions, and sedenions. These systems often sacrifice properties of complex numbers, such as commutativity or associativity, in exchange for other useful features.","priority":"★★★"},"common_mistakes":{"examples":[{"incorrect":"✗ Hypercomplex numbers are always commutative.","correct":"✓ Hypercomplex numbers are not always commutative.","note":"Many hypercomplex number systems, such as quaternions, are non-commutative. Order matters in multiplication."},{"incorrect":"✗ Hypercomplex numbers are the same as multidimensional real numbers.","correct":"✓ Hypercomplex numbers are a specific type of multidimensional number system that extends complex numbers.","note":"While hypercomplex numbers are multidimensional, they have specific algebraic properties related to complex numbers."}],"priority":"★★☆"},"related_words":{"derivatives":["hypercomplexity (noun)"],"related_terms":["quaternion","octonion","sedenion","complex number","algebra","number theory"],"priority":"★★★"},"level_frequency":{"frequency_google_ngram":"Low frequency. Specialized mathematical term.","priority":"★☆☆"},"readability_explanation":{"level":"C1","text":"\"Hypercomplex\" is a specialized mathematical term that describes number systems that extend the concept of complex numbers. Understanding this term requires familiarity with complex numbers and abstract algebra. Examples of hypercomplex numbers include quaternions and octonions. These number systems are used in advanced mathematics and physics. "},"example_sentences":[{"sentence":"The study of hypercomplex algebras provides insights into non-commutative mathematics.","translation":"超複素代数の研究は、非可換数学への洞察を提供します。","type":"general"},{"sentence":"Hypercomplex numbers are applied in computer graphics for 3D rotations.","translation":"超複素数は、3D回転のためにコンピュータグラフィックスに応用されています。","type":"application"}]}